{
  "name": "Keenan Crane",
  "homepage": "http://www.cs.cmu.edu/~kmcrane",
  "status": "success",
  "content": "Keenan Crane Keenan Crane CARNEGIE MELLON UNIVERSITY Home News Teaching Publications Code YouTube Twitter CV FAQ Misc About I am the Michael B. Donohue Associate Professor of Computer Science and Robotics at Carnegie Mellon University, and a member of the Center for Nonlinear Analysis. I also mentor some incredible students in the Geometry Collective. Our work in the emerging field of Discrete Differential Geometry uses insights from differential geometry to build fundamental representations and algorithms for processing, designing, and analyzing geometric data. I received my BS from UIUC, was a Google PhD Fellow at Caltech, an NSF Mathematical Sciences Postdoctoral Fellow at Columbia University. I am a Packard Fellow, recipient of an NSF CAREER Award, and a proud dad. Research Overview Note: I am on sabbatical leave at Roblox and am not currently accepting new students, postdocs, or undergrad research assistants. I am also not serving on committees or review panels during this time. For any administrative matters connected to CMU, please contact my awesome admin Christina Contreras. Teaching Computer Graphics (15-462/662) Videos Code Webpage FA 2021 FA 2020 SP 2020 FA 2018 FA 2017 FA 2016 FA 2015 Discrete Differential Geometry (15-458/768) Videos Code [C++/JS] Webpage SP 2025 SP 2024 SP 2023 SP 2022 SP 2021 SP 2020 SP 2019 FA 2017 SP 2016 Monte Carlo Methods (15-327/627/860, 21-387) New! Webpage FA 2024 FA 2023 Publications Rectangular Surface Parameterization Corman, Crane ACM Trans. on Graph. (2025) Abstract This paper describes a method for computing surface parameterizations that map infinitesimal axis-aligned squares in the plane to infinitesimal rectangles on the surface. Such rectangular parameterizations are needed for a broad range of tasks, from physical simulation to geometric modeling to computational fabrication. Our main contribution is a novel strategy for constructing frame fields that are perfectly orthogonal and exactly integrable, in the limit of mesh refinement. In contrast to past strategies for achieving integrability, we obtain maps that are less distorted and better preserve target field directions. The method supports user-defined distortion measures, sharp feature alignment, prescribed or automatic cone singularities, and direct control over boundary behavior (e.g.,, sizing or aspect ratio). By quantizing and contouring these maps we obtain high-quality anisotropic quad meshes, even without element-based optimization. Empirically, we outperform state-of-the-art research and commercial mesh generation algorithms in terms of element quality, accuracy, and asymptotic convergence rate in end-to-end simulation tasks, are competitive with the widely-used ZBrush package for automatic retopology, and provide Chebyshev nets of superior quality to methods specifically tailored to digital fabrication. PDF Supplement BibTeX @article{Corman:2025:RSP, author = {Corman, Etienne and Crane, Keenan}, title = {Rectangular Surface Parameterization}, journal = {ACM Trans. Graph.}, volume = {44}, number = {4}, year = {2025}, publisher = {ACM}, address = {New York, NY, USA}, } Best Paper (Honorable Mention) SolvingPartial Differential Equationsin Participating Media Miller, Sawhney, Crane Gkioulekas ACM Trans. on Graph. (2025) Abstract We consider the problem of solving partial differential equations (PDEs) in domains with complex microparticle geometry that is impractical, or intractable, to model explicitly. Drawing inspiration from volume rendering, we propose tackling this problem by treating the domain as a participating medium that models microparticle geometry stochastically, through aggregate statistical properties (e.g., particle density). We first introduce the problem setting of PDE simulation in participating media. We then specialize to exponential media and describe the properties that make them an attractive model of microparticle geometry for PDE simulation problems. We use these properties to develop two new algorithms, volumetric walk on spheres and volumetric walk on stars, that generalize previous Monte Carlo algorithms to enable efficient and discretization-free simulation of linear elliptic PDEs (e.g., Laplace) in participating media. We demonstrate experimentally that our algorithms can solve Laplace boundary value problems with complex microparticle geometry more accurately and more efficiently than previous approaches, such as ensemble averaging and homogenization. PDF Project BibTeX @article{Miller:2025:PRB, author = {Miller, Bailey and Sawhney, Rohan and Crane, Keenan and Gkioulekas, Ioannis}, title = {Solving Partial Differential Equations in Participating Media}, journal = {ACM Trans. Graph.}, volume = {44}, number = {4}, year = {2025}, publisher = {ACM}, address = {New York, NY, USA}, } Putting Rigid Bodies to Rest Baktash, Sharp, Zhou, Crane, Jacobson ACM Trans. on Graph. (2025) Abstract This paper explores the analysis and design of the resting configurations of a rigid body, without the use of physical simulation. In particular, given a rigid body in âÂ³, we identify all possible stationary points, as well as the probability that the body will stop at these points, assuming a random initial orientation and negligible momentum. The forward version of our method can hence be used to automatically orient models, to provide feedback about object stability during the design process, and to furnish plausible distributions of shape orientation for natural scene modeling. Moreover, a differentiable inverse version of our method lets us design shapes with target resting behavior, such as dice with target, nonuniform probabilities. Here we find solutions that would be nearly impossible to find using classical techniques, such as dice with additional unstable faces that provide more natural overall geometry. PDF Data BibTeX @article{Baktash:2025:PRB, author = {Baktash, Hossein and Sharp, Nicholas and Zhou, Qingnan and Crane, Keenan and Jacobson, Alec}, title = {Putting Rigid Bodies to Rest}, journal = {ACM Trans. Graph.}, volume = {44}, number = {4}, year = {2025}, publisher = {ACM}, address = {New York, NY, USA}, } Differential Walk on Spheres Miller, Sawhney, Crane, Gkioulekas ACM Trans. on Graph. (2024) Abstract We introduce a Monte Carlo method for evaluating derivatives of the solution to a partial differential equation (PDE) with respect to problem parameters (such as domain geometry or boundary conditions). Derivatives can be evaluated at arbitrary points without performing a global solve, or constructing a volumetric grid or mesh. The method is hence well-suited to inverse problems with complex geometry, such as PDE-constrained shape optimization. Like other walk on spheres (WoS) algorithms, our method is trivial to parallelize, and is agnostic to boundary representation (meshes, splines, implicit surfaces, etc.), supporting large topological changes. We focus in particular on screened Poisson equations, which model diverse problems from scientific and geometric computing. As in differentiable rendering, we jointly estimate derivatives with respect to all parameters—hence, cost does not grow significantly with parameter count. In practice, even noisy derivative estimates exhibit fast, stable convergence for stochastic gradient-based optimization—as we show via examples from thermal design, shape from diffusion, and computer graphics. Project PDF BibTeX @article{Miller:2024:WRW, author = {DWS}, title = {Differential Walk on Spheres}, journal = {ACM Trans. Graph.}, volume = {43}, number = {6}, year = {2024}, publisher = {ACM}, address = {New York, NY, USA}, } Ray TracingHarmonic Functions Gillespie, Yang, Botsch, Crane ACM Trans. on Graph. (2024) Abstract The sphere tracing algorithm provides a fast and high-quality strategy for visualizing surfaces encoded by signed distance functions (SDFs), which have become a centerpiece in a wide range of visual computing algorithms. In this paper we introduce a sphere tracing algorithm for a completely different class of functions, harmonic functions, opening up a whole new set of possibilities. Harmonic functions are found throughout geometric and visual computing, where they arise naturally as the solution to interpolation problems, and in the physical sciences, where they appear as solutions to the Laplace equation. Our algorithm for harmonic functions is similar in spirit to the sphere tracing algorithm for SDFs: by using a conservative lower bound on the distance to the level set, we can take much larger steps than with naïve ray marching. Our key observation is that for harmonic functions such a bound is given by Harnack's inequality. Unlike Lipschitz bounds used in traditional sphere tracing, this Harnack bound requires only the value of the function at a pointâwe use this bound to develop a sphere tracing algorithm that can also handle jump discontinuities arising in angle-based harmonic functions. We show how this algorithm can be used to directly visualize smooth surfaces reconstructed from point clouds (via Poisson surface reconstruction) or polygon soup (via generalized winding numbers) without performing linear solves or mesh extraction. We also show how it can be used to render nonplanar polygons (including those with holes), and to visualize key objects from mathematics, including knots, links, spherical harmonics, and Riemann surfaces. PDF Project BibTeX @article{Gillespie:2024:RTH, author = {Gillespie, Mark and Yang, Denise and Botsch, Mario and Crane, Keenan}, title = {Ray Tracing Harmonic Functions}, journal = {ACM Trans. Graph.}, volume = {43}, number = {4}, year = {2024}, publisher = {ACM}, address = {New York, NY, USA}, } Best Paper (Honorable Mention) Repulsive Shells Sassen, Schumacher, Rumpf, Crane ACM Trans. on Graph. (2024) Abstract This paper develops a shape space framework for collision-aware geometric modeling, where basic geometric operations automatically avoid interpenetration. Shape spaces are a powe",
  "content_length": 114281,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:19"
}