{
  "name": "Kees van Berkel 0001",
  "homepage": "https://sites.google.com/view/keesvanberkel",
  "status": "success",
  "content": "Kees van Berkel - TU WienSearch this siteEmbedded FilesSkip to main contentSkip to navigationKees van Berkel - Researcher in AI and PhilosophyAssistant Professor AI Ethics, TU WienAcademic BioPublicationsAcademic ServicesTeachingAbout me:I am an Assistant Professor of AI ethics at the Institute of Logic and Computation, TU Wien. My core research interests are in AI Ethics and logical and formal argumentative perspectives on normative reasoning. It includes the study of norm explanations in AI, the logical analysis of meta-ethical principles, proof theory for defeasible normative reasoning, and argumentative characterizations of nonmonotonic deontic logics.News:Christian Strasser and I gave a foundational course at ESSLLI 2025, at Ruhr University Bochum, July 2025. Course: introduction to logical argumentation (see the course page for content). See this page for old (archived) news.  Academic biography:> 2024. Co-coordinator of the special interest group \"AI Ethics\" and the Center for Artificial Intelligence and Machine Learning (CAIML). > 2024. Key researcher in the Cluster of Excellence Bilateral AI (BILAI), within the research module \"Ethical AI Systems\". The affiliation hosts a PhD position on AI Alignment and Dialogues.> 2024. Assistant Professor in AI Ethics at the Institute for Logic and Computation, TU Wien, Austria (tenure track). > 2024. Affiliate of the project \"Logical methods for Deontic Explanations (LoDEx)\", which is a collaboration between Ruhr Universität Bochum (C. Strasser), TU Wien (A. Ciabattoni), and the University of Luxembourg (L. van der Torre). 2022 - 2023. Postdoctoral researcher (wiss. Mitarbeiter) in the group \"Reasoning, Rationality, and Science\" led by Dunja Šešelja and Christian Strasser, at the Institute for Philosophy II, Fakultat fur Philosophie und Erziehungswissenschaft, Ruhr University Bochum, Germany.2022. Research Assistantship at School of Computer Science, The Academic College of Tel-Aviv-Yaffo. Working with Ofer Arieli. > 2022. Research affiliate of the LANCAR group (Language and Cognition in Argumentation) at the University of Amsterdam.2018 - 2022. PhD in Computer Science (Technischen Wissenschaften) at the doctoral college on `Logical Methods in Computer Science' (0.75 fte). Advisors: Agata Ciabattoni and Stefan Woltran. Institute for Logic and Computation, TU Wien, Austria.Thesis: A Logical Analysis of Normative Reasoning: Agency, Action, and Argumentation. 2018 - 2022. Project assistant in the interdisciplinary project `Reasoning Tools for Deontic Logic and Applications to Indian Sacred Texts' led by Agata Ciabattoni, funded by WWTF (0.25 fte). Institute for Logic and Computation, TU Wien, Austria.2017 Research assistant for Kim Knibbe at University of Groningen, the Netherlands (Topics: care ethics, feminist metaphysics, phenomenology of pregnancy).2012 - 2015 Master of Science in Logic, track: Logic & Philosophy. Institute for Language Logic and Computation (ILLC), University of Amsterdam, the Netherlands.2010 - 2012 Bachelor of Arts in Philosophy. Faculty of Humanities, University of Amsterdam, the Netherlands. 2009 - 2010 Propaedeutic in Business Economics. Tilburg University, the Netherlands.Publications:2025van Berkel, K., Straßer, C. (2025). A Tutorial in Proof-Theoretic Approaches to Logical Argumentation. In: Console, M., Konev, B. (eds) Reasoning Web. Declarative Artificial Intelligence: Knowledge, Rules, Logic. Lecture Notes in Computer Science, vol 15400. Springer, Cham. (pdf)2024Lyon, T. and van Berkel, K.: \"Proof Theory and Decision Procedures for Deontic STIT Logics\". In: Journal of Artificial Intelligence Research. Vol. 81. pp.837-876. (pdf)van Berkel, K. and Strasser, C.:  \"Towards Deontic Explanation through Dialogue\". In: Proceedings of ArgXAI 2024, the 2nd International Workshop on Argumentation for eXplainable AI, Hagen. (pdf)Arieli, O., van Berkel, K., Raddaoui, B., and Strasser, C.: ``Deontic Reasoning based on Inconsistency Measures\". In: Proceedings of KR2024, the 21st International Conference on Principles of Knowledge Representation and Reasoning, Hanoi. (pdf)van Berkel, K., Strasser, C., and Zhou, Z.: \"Towards and Argumentative Unification of Default Reasoning\"  In: Proceedings of COMMA 2024, the 10th International Conference on Computational Models of Argument, Hagen. Joint work with Christian Strasser and Zheng Zhou. (pdf)van Berkel, K., and Modgil, S,: \"A nonmonotonic proof theory for dialectical argumentation under bounded resources\". In: Proceedings of COMMA 2024, the 10th International Conference on Computational Models of Argument. (pdf)Arieli, O., van Berkel, K., and Strasser, C.: \"Defeasible Normative Reasoning: A Proof-Theoretic Integration of Logical Argumentation.\" In: Proceedings of AAAI24,  the 38th Annual AAAI Conference on Artificial Intelligence. (pdf)2023van Berkel, K., Markovich, R., Strasser, C., and van der Torre, L.: Arguing About Choosing a Normative System: Conflict of Laws. In: Legal Knowledge and Information Systems (proceedings of JURIX23), pp.73-82van Berkel, K., Lyon, T., Pascucci, M.: A Logical Analysis of Instrumentality Judgments: Means-End Relations in the Context of Experience and Expectations. In: Journal of Philosophical Logic.  van Berkel, K., Wagemans, J.: Practical Reasoning and Practical Argumentation: A Stakeholder Commitment Approach. In: TOPOI, An International Review of Philosophy.van Berkel, K., Ciabattoni, A., Freschi, E., Gulisano, F., Olszewski, M.: Deontic paradoxes in Mmam. sa logics: there and back again. In: Journal of Logic, Language and Information. Vol. 32, March issue, pp.19–62van Berkel, K.:  A Logical Analysis of Normative Reasoning: Agency, Action, and Argumentation. PhD Dissertation, TU Wien. Supervision: Agata Ciabattoni and Stefan Woltran (co). 2022 van Berkel, K., Strasser, C: Reasoning With and About Norms in Logical Argumentation. In: COMMA 2022, 9th International Conference on Computational Models of Argument.Arieli, O., van Berkel, K., Strasser, C.: Annotated Sequent Calculi for Paraconsistent Reasoning and Their Relations to Logical Argumentation. In: 31st International Joint Conference on Articial Intelligence (IJCAI22).van Berkel, K.: Kant's Logic: Letting go of a Historical Assumption. In: Stenning, K., Stokhof, M. (eds), Rules, Regularities, Randomness. Festschrift for Michiel van Lambalgen. pp.35-552021 van Berkel, K., Ciabattoni, A., Freschi, E., Gulisano, F., Olszewski, M.: The Gentle Murder Paradox in Sanskrit Philosophy. In: Liu, F., Marra, A., Portner, P., Van De Putte, F. (eds), Deontic Logic and Normative Systems: 15th International Conference (DEON21). College Publications, Londonvan Berkel, K., Gabbay, D., van der Torre, L.: If you want to smoke, don't buy cigarettes: Near-Anankastics, Contexts, and Hyper Modality. In: Liu, F., Marra, A., Portner, P., Van De Putte, F. (eds), Deontic Logic and Normative Systems: 15th International Conference (DEON21). College Publications, London2020 van Berkel, K., Lyon, T.: The Varieties of Ought-implies-Can and Deontic STIT Logic. In: Liu, F., Marra, A., Portner, P., Van De Putte, F. (eds), Deontic Logic and Normative Systems: 15th International Conference (DEON21). College Publications, Londonvan Berkel K., Lyon T., Olivieri F.: A Decidable Multi-agent Logic for Reasoning About Actions, Instruments, and Norms. In: Dastani M., Dong H., van der Torre L. (eds), Logic and Argumentation. CLAR 2020. Lecture Notes in Computer Science, vol 12061. Springer, Cham2019 Lyon T., van Berkel K.: Automating Agential Reasoning: Proof-Calculi and Syntactic Decidability for STIT Logics. In: Baldoni M., Dastani M., Liao B., Sakurai Y., Zalila Wenkstern R. (eds), International Conference on Principles and Practice of Multi-Agent Systems (PRIMA19). LNAI vol 11873. Springer, Cham van Berkel K., Lyon T.: A Neutral Temporal Deontic STIT Logic. In: Blackburn P., Lorini E., Guo, M. (eds), Logic, Rationality, and Interaction. LORI 2019. LNAI vol 11813. Springer, Berlin, Heidelbergvan Berkel, K., Ciabattoni, A., Freschi, E., Modgil, S.: Evaluating Networks of Arguments: A Case Study in Mmam. sa Dialectics. In: Blackburn P., Lorini E., Guo, M. (eds), Logic, Rationality, and Interaction. LORI 2019. LNAI vol 11813. Springer, Berlin, Heidelbergvan Berkel, K., Lyon, T.: Cut-free Calculi and Relational Semantics for Temporal STIT Logics. In: Calimeri F., Leone N., Manna M. (eds), European Conference on Logics in Articial Intelligence (JELIA19). LNAI vol 11468. Springer, Cham 2018 van Berkel, K., Pascucci, M.: Notions of Instrumentality in Agency Logic. In: Miller, T., Oren, N., Sakurai, Y., Noda, I., Savarimuthu, B., Son, T.C. (eds) International Conference on Principles and Practice of Multi-Agent Systems (PRIMA18). LNAI vol 11224. Springer, ChamCiabattoni, A. Lellmann, B. van Berkel, K.: Deontic reasoning: from ancient texts to articial intelligence. Workshop report. In: ACM SIGLOG News 5(4), pp.48-512017 van Berkel, K.: De Kantiaanse Stemwijzer (transl. The Kantian Voting Guide) In: deFusie, Amsterdam (Online philosophy magazine) (March 10, 2017)2015 van Berkel, K.: Kant's Logic in the Critique of Practical Reason - A Logical Formalization of Kant's Practical Transcendental Argument. In: ILLC Publications, Master of Logic: Thesis (MoL) SeriesAcademic Service:2025PC member DEON 2025, The 17th International Conference on Deontic Logic and normative systems, Vienna. PC member Green-Aware AI 2025, the 2nd Workshop on Green-Aware Artificial Intelligence, Bologna.  OC chair DEON 2025, The 17th International Conference on Deontic Logic and normative systems, Vienna.OC member Logic Colloquium 2025, Vienna.2024Program Committee Member of AAAI25, The 38th Annual AAAI Conference on Artificial Intelligence.Panel member: CAIML Symposium 2024 (May 6, 2024). The 3rd CAIML Symposium will bring together leading experts and enthusiasts in the field of AI.Program Committee Member of KR24, 21st International Conference on Knowledge Representation and Reasoning.2023 Pr",
  "content_length": 13582,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:19"
}