{
  "name": "Keiichi Yasumoto",
  "homepage": "https://researchmap.jp/keiichi.yasumoto",
  "status": "success",
  "content": "安本 慶一 (Keiichi Yasumoto) - マイポータル - researchmap × {{flash.message}} 基本情報 所属奈良先端科学技術大学院大学 先端科学技術研究科 教授理化学研究所革新知能統合研究センター（AIP） 研究員 学位 博士（工学）(大阪大学) 研究者番号 40273396J-GLOBAL ID200901032479455462researchmap会員ID5000045168 外部リンクhttp://ubi-lab.naist.jp 研究キーワード 3 分散システム モバイルコンピューティング ユビキタスコンピューティング 研究分野 3 情報通信 / 情報ネットワーク / 情報通信 / 計算機システム / 情報通信 / 情報学基礎論 / 経歴 14 2024年2月 - 現在 名古屋大学, 未来社会創造機構, 客員教授 2018年4月 - 現在 奈良先端科学技術大学院大学, 先端科学技術研究科, 教授 2017年4月 - 現在 理化学研究所, 革新知能統合研究センター (研究員) 2013年4月 - 現在 大阪大学, 大学院情報科学研究科, 招聘教授 2024年4月 - 2025年3月 奈良先端科学技術大学院大学, 先端科学技術研究科, 副研究科長 2023年4月 - 2025年3月 奈良先端科学技術大学院大学, 先端科学技術研究科 情報科学領域, 領域長 2023年4月 - 2024年3月 奈良先端科学技術大学院大学, 先端科学技術研究科, 研究科長 2021年4月 - 2023年3月 奈良先端科学技術大学院大学, 先端科学技術研究科情報科学領域, 副領域長 2011年4月 - 2018年3月 奈良先端科学技術大学院大学, 情報科学研究科, 教授 2007年4月 - 2011年3月 奈良先端科学技術大学院大学・情報科学研究科 准教授 2001年10月 - 2007年3月 奈良先端科学技術大学院大学・情報科学研究科 助教授 1998年11月 - 2002年3月 滋賀大学経済学部 助教授 1996年4月 - 1998年10月 滋賀大学経済学部 講師 1995年5月 - 1996年3月 滋賀大学経済学部 助手 学歴 3 1993年4月 - 1995年3月 大阪大学, 基礎工学研究科, 物理系情報工学分野博士後期課程 1991年4月 - 1993年3月 大阪大学, 大学院基礎工学研究科, 物理系情報工学分野博士前期課程 1986年4月 - 1991年3月 大阪大学, 基礎工学部, 情報工学科 委員歴 9 2022年11月 - 現在 The 13th International Conference on the Internet of Things (IoT 2023), General Co-Chair 2017年6月 - 2019年6月 国際会議IEEE PerCom 2019, 組織委員長 2017年1月 - 2018年12月 国際会議ICMU 2018, 組織委員長 2015年5月 - 2017年5月 情報処理学会関西支部, 支部長 2015年12月 - 2016年12月 国際会議MobiQuitous 2016, ワークショップ委員長 2015年6月 - 2016年6月 国際会議IEEE ICDCS 2016, デモ委員長 2013年6月 - 2015年5月 情報処理学会, 理事 2008年4月 - 2012年3月 情報処理学会 モバイルコンピューティングとユビキタス通信（MBL）研究会 幹事 2008.4- 2005年6月 - 2006年5月 情報処理学会 論文誌編集委員会主査（基盤技術グループ）2005.6-2006.5 受賞 21 2022年9月 Best Paper Award, Aromug: Mug-type Olfactory Interface to Assist in Reducing Sugar Intake, ACM WellComp 2022 Daiki Mayumi, Yugo Nakamura, Yuki Matsuda, Shinya Misaki, Keiichi Yasumoto 2021年11月 Best Paper Award, Multi-person Daily Activity Recognition with Non-contact Sensors based on Activity Co-occurrence, ICMU 2021 Tomokazu Matsui, Shinya Misaki, Yuma Sato, Manato Fujimoto, Hirohiko Suwa, Keiichi Yasumoto 2021年3月 2021 Best Demo Award, eat2pic: Food-tech Design as a Healthy Nudge with Smart Chopsticks and Canvas, IEEE PerCom 2021 Rei Nakaoka, Yugo Nakamura, Yuki Matsuda, Shinya Misaki, Keiichi Yasumoto 2020年11月 Best Demo Runner-up Award, Fishing Activity Sensing and Visualization System using Sensor-equipped Fishing Rod, ACM SenSys 2020 Shuichi Fukuda, Hyuckjin Choi, Yuki Matsuda, Keiichi Yasumoto 2019年3月 Best Demonstration Award, Towards Real-Time Contextual Touristic Emotion and Satisfaction Estimation with Wearable Devices, IEEE PerCom 2019 Dmitrii Fedotov, Yuki Matsuda, Yuta Takahashi, Yutaka Arakawa, Keiichi Yasumoto, Wolfgang Minker 2016年9月 Best Demo Award, SenStick 2: ultra tiny all-in-one sensor with wireless charging, ACM UbiComp 2016 Y. Nakamura, T. kanehira, Y. Arakawa, K. Yasumoto 2016年6月 学会活動貢献賞, 情報処理学会 安本 慶一 2016年6月 論文賞, A Method for Navigating Cars in Multilevel Parking Facility, 情報処理学会 安本 慶一 2015年9月 UbiComp 2015 Honorable Mention Award, SakuraSensor: Quasi-Realtime Cherry-Lined Roads Detection through Participatory Video Sensing by Cars, ACM 安本 慶一 2015年6月 論文賞, Disaster Information Collection with Opportunistic Communication and Message Aggregation, 情報処理学会 安本 慶一 2013年6月 山下記念研究賞, 快適度の低下を最小限に抑える省エネデバイス制御手法, 情報処理学会 安本 慶一 2007年 情報処理学会 MBL研究会 優秀発表 2006年 情報処理学会 DICOMO2006シンポジウム 優秀論文賞 2005年 情報処理学会 DICOMO2005シンポジウム 最優秀デモンストレーション賞（野口賞） 2005年 情報処理学会 DICOMO 2005シンポジウム 優秀論文賞 2004年 情報学ワークショップ2004 優秀論文賞 2003年 情報処理学会 モバイルコンピューティングとユビキタス通信(MBL)研究会 優秀論文賞 2002年 情報処理学会 モバイルコンピューティングとワイヤレス通信(MBL)研究会 優秀論文賞 2002年 情報処理学会 マルチメディア，分散，協調とモバイル(DICOMO 2002) シンポジウム ベストカンバーサント賞 1998年 電子情報通信学会 情報ネットワーク研究賞 もっとみる 主要な論文 581 Movement recognition via channel-activation-wise sEMG attention Jiaxuan Zhang, Yuki Matsuda, Manato Fujimoto, Hirohiko Suwa, Keiichi Yasumoto Methods 218 39-47 2023年10月  査読有り HPRoP: Hierarchical Privacy-Preserving Route Planning for Smart Cities Francis Tiausas, Keiichi Yasumoto, Jose Paolo Talusan, Hayato Yamana, Hirozumi Yamaguchi, Shameek Bhattacharjee, Abhishek Dubey, Sajal K. Das ACM Transactions on Cyber-Physical Systems 2023年8月  査読有り Scalable Pythagorean Mean based Incident Detection in Smart Transportation Systems Md. Jaminur Islam, Jose Paolo Talusan, Shameek Bhattacharjee, Francis Tiausas, Abhishek Dubey, Keiichi Yasumoto, Sajal K. Das ACM Transactions on Cyber-Physical Systems 2023年6月5日  査読有り eat2pic: An Eating-Painting Interactive System to Nudge Users into Making Healthier Diet Choices Yugo Nakamura, Rei Nakaoka, Yuki Matsuda, Keiichi Yasumoto Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 7(1) 24-23 2023年3月28日  査読有り Garbage Content Estimation Using Internet of Things and Machine Learning. Eunice David Likotiko, Yuki Matsuda 0001, Keiichi Yasumoto IEEE Access 11 13000-13012 2023年  査読有り Stress Estimation Using Biometric and Activity Indicators to Improve QoL of the Elderly Kanta Matsumoto, Tomokazu Matsui, Hirohiko Suwa, Keiichi Yasumoto Sensors 23(1) 535-535 2023年1月  査読有り PATROL: Participatory Activity Tracking and Risk Assessment for Anonymous Elderly Monitoring Research Dawadi, Teruhiro Mizumoto, Yuki Matsuda, Keiichi Yasumoto Sensors 22(18) 6965-6965 2022年9月  査読有り ParmoSense: Scenario-based Participatory Mobile Urban Sensing Platform with User Motivation Engine Yuki Matsuda, Shogo Kawanaka, Hirohiko Suwa, Yutaka Arakawa, Keiichi Yasumoto Sensors and Materials 34(8) 3063-3063 2022年8月2日 Large-Scale Evacuation Shelter Selection Method Through Iterations of Pedestrian Simulations With Dynamic Congestion Reproduction Kazuhito Umeki, Tomoki Tanaka, Yugo Nakamura, Manato Fujimoto, Teruhiro Mizumoto, Hirohiko Suwa, Yutaka Arakawa, Keiichi Yasumoto IEEE Access 10 89387-89401 2022年8月  査読有り Estimating Congestion in a Fixed-Route Bus by Using BLE Signals Yuji Kanamitsu, Eigo Taya, Koki Tachibana, Yugo Nakamura, Yuki Matsuda, Hirohiko Suwa, Keiichi Yasumoto Sensors 22(3) 881-881 2022年1月24日 Anomaly based Incident Detection in Large Scale Smart Transportation Systems. Mohammad Jaminur Islam, Jose Paolo Talusan, Shameek Bhattacharjee, Francis Tiausas, Sayyed Mohsen Vazirizade, Abhishek Dubey, Keiichi Yasumoto, Sajal K. Das 0001 ICCPS 215-224 2022年 Wi-CaL: WiFi Sensing and Machine Learning Based Device-Free Crowd Counting and Localization Hyuckjin Choi, Manato Fujimoto, Tomokazu Matsui, Shinya Misaki, Keiichi Yasumoto IEEE Access 10 24395-24410 2022年 FedTour: Participatory Federated Learning of Tourism Object Recognition Models with Minimal Parameter Exchanges between User Devices. Shusaku Tomita, Jose Paolo Talusan, Yugo Nakamura, Hirohiko Suwa, Keiichi Yasumoto PerCom Workshops 667-673 2022年 Multi-person Daily Activity Recognition with Non-contact Sensors based on Activity Co-occurrence Tomokazu Matsui, Shinya Misaki, Yuma Sato, Manato Fujimoto, Hirohiko Suwa, Keiichi Yasumoto 2021 Thirteenth International Conference on Mobile Computing and Ubiquitous Network (ICMU) 2021年11月17日 User-centric Distributed Route Planning in Smart Cities based on Multi-objective Optimization Francis Tiausas, Jose Paolo Talusan, Yu Ishimaki, Hayato Yamana, Hirozumi Yamaguchi, Shameek Bhattacharjee, Abhishek Dubey, Keiichi Yasumoto, Sajal K. Das Proceedings - 2021 IEEE International Conference on Smart Computing, SMARTCOMP 2021 77-82 2021年8月 Optimal cooking procedure presentation system for multiple recipes and investigating its effect Jin Nakabe, Teruhiro Mizumoto, Hirohiko Suwa, Keiichi Yasumoto Algorithms 14(2) 2021年2月 A Method for Detecting Street Parking Using Dashboard Camera Videos Akihiro Matsuda, Tomokazu Matsui, Yuki Matsuda, Hirohiko Suwa, Keiichi Yasumoto Sensors and Materials 33(1) 17-17 2021年1月15日 Exploring the Impacts of Elaborateness and Indirectness in a Behavior Change Support System Zhihua Zhang, Juliana Miehle, Yuki Matsuda, Manato Fujimoto, Yutaka Arakawa, Keiichi Yasumoto, Wolfgang Minker IEEE Access 9 74778-74788 2021年 ProceThings: Data Processing Platform with In-situ IoT Devices for Smart Community Services. Yugo Nakamura, Jose Paolo Talusan, Teruhiro Mizumoto, Hirohiko Suwa, Yutaka Arakawa, Hirozumi Yamaguchi, Keiichi Yasumoto ICDCN '21: International Conference on Distributed Computing and Networking 116-121 2021年 Timeliness-Aware On-Site Planning Method for Tour Navigation Shogo Isoda, Masato Hidaka, Yuki Matsuda, Hirohiko Suwa, Keiichi Yasumoto Smart Cities 2020年11月 SALON: Simplified Sensing System for Activity of Daily Living in Ordinary Home Tomokazu Matsui, Kosei Onishi, Shinya Misaki, Manato Fujimoto, Hirohiko Suwa, Keiichi Yasumoto Sensors 20(17) 4895-4895 2020年8月  査読有り Gamified Participatory Sensing in Tourism: An Experimental Study of the Effects on Tourist Behavior and Satisfaction Shogo Kawanaka, Yuki Matsuda, Hirohiko Suwa, Manato Fujimoto, Yutaka Arakawa, Keiichi Yasumoto Smart Cities 3(3) 736-757 2020年7月16日 On-site Trip Planning Support System Based on Dynamic Information on Tourism Spots Masato Hidaka, Yuki Kanaya, Shogo Kawanaka, Yuki Matsuda, Yugo Nakamura, Hirohiko Suwa, Manato Fujimoto, Yutaka Arakawa, Keiichi Yasumoto Smart Cities 3(2) 212-231 2020年4月10日 Privacy-Aware Sensor Data Upload Management for Securely Receiving Smart Home Services. Sopicha Stirapongsasuti, Yugo Nakamura, Keiichi Yasumoto IEEE International Conference on Smart Computing(SMARTCOMP) 214-219 2020年  査読有り Time-dependent Decentralized Routing using Federated Learning. Michael Wilbur, Chinmaya Samal, Jose Paolo Talusan, Keiichi Yasumoto, Abhishek Dubey 23rd IEEE International Symposium on Real-Time Distributed Computing(ISORC) 56-64 2020年 On Decentralized Route Planning Using the Road Side Units as Computing Resources. Jose Paolo Talusan, Michael Wilbur, Abhishek Dubey, Keiichi Yasumoto 2020 IEEE International Conference on Fog Computing(ICFC) 1-8 2020年 Route Planning Through Distributed Computing by Road Side Units. Jose Paolo Talusan, Michael Wilbur, Abhishek Dubey, Keiichi Yasumoto IEEE Access 8 176134-176148 2020年 Energy aware simulation and testing of smart-spaces El-Fakih, K., Mizumoto, T., Yasumoto, K., Higashino, T. Inform",
  "content_length": 16997,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:20"
}