{
  "name": "Keiji Kimura",
  "homepage": "http://www.apal.cs.waseda.ac.jp/kimura/index.en.html",
  "status": "success",
  "content": "WASEDA UNIVERSITY Computer Science and Engineering Kimura Laboratory | Japanese | English | Private Page Professor Research Publications Members Class Infomeation Location Kasahara Lab Links KIMURA, Keiji Keiji Kimura received the Ph.D. degree in electrical engineering from Waseda University in 2001. He was an assistant professor in 2004, an associate professor in 2005, and a professor in 2012 at Waseda University. He has been a director of Green Computing System Research Organization at Waseda since 2019. He is a recipient of the 2014 MEXT (Ministry of Education, Culture, Sports, Science and Technology in Japan) award. His research interests include multicore processor architecture, parallelizing compiler technologies, and secure computer systems. He is a member of IPSJ, ACM, and IEEE. He has served on the program committee of many conferences. Office: 40-705 (main office), 55N-510A/B, 504B Key words: Multi-core and Multiprocessor Architectures, Parallelizing Compilers, Parallelization of Applications, Embedded Systems, System Software, Secure Computer Systems Activities: The 31st International Conference on Parallel Architectures and Compilation Techniques (PACT 2022) The 30th International Conference on Parallel Architectures and Compilation Techniques (PACT 2021) The 34th International Workshop on Languages and Compilers for Parallel Computing (LCPC 2021) ACM Principles and Practice of Parallel Programming 2021 (PPoPP 2021), Extended Review Committee The 37th IEEE International Conference on Computer Design (ICCD 2019), Program track Chair (Processor Architecture) The 26th IEEE International Symposium on High-Performance Computer Architecture, Program Committee 24th Asia and South Pacific Design Automation Conference (ASP-DAC 2019), Program Committee (On-chip Communication and Networks-on-Chip) Principles and Practice of Parallel Programming 2018 (PPoPP 2018), February, 2018, Publicity Chair (Japan) The 32nd, 28th IEEE International Parallel & Distributed Processing Symposium (IPDPS 2019, 2018, 2014), Program Committee IEEE COMPSAC 2018, Computer Architecture and Platforms Co-Chairs IEEE 12th International Symposium on Embedded Multicore/Many-core System-on-Chip (MCSoC 2018), Track 2: Embedded Multicore/Manycore SoC Architecture co-chairs The 22nd IEEE International Conference on Parallel and Distributed Systems (ICPADS 2016), Program Vice Chair (Parallel / Distributed Algorithms and Applications) The 45th International Conference on Parallel Processing (ICPP-2016), Program Committee (Programming Models, Languages and Compilers) The 13th IFIP International Conference on Network and Paralell Computing (NPC 2016), Program Committee The 3rd International Workshop on Software and Engineering for Parallel Sysmtems (SEPS 2016), Program Committee The 24th International Conference on Parallel Architectures and Compilation Techniques (PACT 2015), Program Committee 27th International Symposium on Computer Architecture and High Performance Computing (SBAC PAD 2015), Program Committee (Software Track) XXVII--XXXII IEEE International Conference on Computer Design (ICCD 2009--2014), Program Committee (Computer System Design and Application Track) The 27th Internationcal Conference on Supercomputing (ICS 2013), Program Committee The 28th IEEE International Parallel & Distributed Processing Symposium (IPDPS 2014), Program Committee The 20th, 19th and 17th IEEE International Conference on Parallel and Distributed Systems (ICPADS 2014, 2013, 2011), Program Committee (Multicore Computing and Parallel / Distributed Architecture) The 24-26th International Workshop on Languages and Compilers for Parallel Computing (LCPC 2011-2013), Program Committee, Program Chair (2012) The 13th International Forum on Embedded MPSoC and Multicore (MPSoC2013), Finace Co-Chairs The 12th International Forum on Embedded MPSoC and Multicore (MPSoC2012), Program Co-Chairs Advanced Parallel Processing Technology Symposium (APPT 2011), Program Committee 2010 IEEE International Symposium on Workload Characterization (IISWC-2010), Program Committee 22nd International Symposium on Computer Architecture and High Performance Computing (SBAC PAD 2010), Program Committee (System Software Track) The 38th International Conference on Parallel Processing (ICPP-2009), Program Committee (Programming Models, Languages and Compilers) IEEE Symposium on Low-Power and High-Speed Chips (COOL Chips VIII, XII--XVII), Program Committee IEEE Symposium on Low-Power and High-Speed Chips (COOL Chips IX--XI), Program Committee Vice Chair The 15th International Symposium on High-Performance Computer Architecture (HPCA-15), Publicity Co-Chairs IPSJ SACSIS 2006, 2008--2013, Program Committee IPSJ ESS 2012, Program Co-Chairs IPSJ ESS, 2010-2011 Program Committee, 2012 Program Co-Chairs, 2013 Program Chair IPSJ ComSys 2006--2008, Program Committee IPSJ DA Symposium 2007, University Chair, 2007 IPSJ Transaction on Advanced Computing Systems, Editor, 2005-2009, 2013- ISPJ SACSIS 2004, Financial Chair and Program Committee, 2004 Copyright (C) 2009 Kimura Lab., Waseda University.",
  "content_length": 5098,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:20"
}