{
  "name": "Keijo Heljanko",
  "homepage": "https://researchportal.helsinki.fi/en/persons/keijo-tapio-heljanko",
  "status": "success",
  "content": "Keijo Tapio Heljanko - University of Helsinki View Scopus Profile Keijo Tapio Heljanko, Professor Helsinki Institute for Information TechnologyProfessor, Department of Computer ScienceSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿EUROFusion Advanced Computing Hub Finland https://orcid.org/0000-0002-4547-2701 Phone+358505560400, +358294151354Emailkeijo.heljankohelsinkifi FinlandPL 68 (Pietari Kalmin katu 5)00014Finland 1996 …2025 Research activity per year Personal profile External positionsPrincipal Investigator, Helsinki Institute of Information Technology1 Mar 2013 → …Associate Professor, Aalto University1 Aug 2008 → 31 Dec 2018 Fields of Science113 Computer and information sciences Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1996 1999 2000 2001 2004 2008 2009 2011 2012 2013 2015 2016 2017 2018 2019 2020 2025 69 Conference contribution 39 Article 16 Commissioned report 3 Anthology or special issue 4 More 3 Chapter 1 Book Research output per year Research output per year A generalized disjunctive programming model for the static bike sharing rebalancing problem with demand intervalsIkonen, T. J., Heljanko, K. & Harjunkoski, I., 25 Feb 2025, In: Optimization and Engineering. 26, p. 1781-1813 33 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Explainable machine learning for modeling of net ecosystem exchange in boreal forestsEzhova, E., Laanti, T. M., Lintunen, A., Kolari, P., Nieminen, T., Mammarella, I., Heljanko, K. & Kulmala, M., 13 Jan 2025, In: Biogeosciences. 22, 1, p. 257-288 32 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Towards Unified Analysis of GPU ConsistencyTong, H., Gavrilenko, N., Ponce De Leon, H. & Heljanko, K., 10 Apr 2025, ASPLOS 2024 - Proceedings of the 29th ACM International Conference on Architectural Support for Programming Languages and Operating Systems. Association for Computing Machinery, p. 329-344 16 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Certifying Phase AbstractionFroleyks, N., Yu, E., Biere, A. & Heljanko, K., 2024, Automated Reasoning, IJCAR 2024, Pt I. Benzmuller, C., Heule, M. & Schmidt, R. (eds.). Springer Nature, Vol. 14739. p. 284-303 20 p. (Lecture Notes In Artificial Intelligence).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile SOMA: Observability, monitoring, and in situ analytics for exascale applicationsYokelson, D., Lappi, O. J., Ramesh, S., Väisälä, M., Huck, K., Puro, T., Norris, B., Korpi-Lagg, M., Heljanko, K. & Malony, A. D., 30 Aug 2024, In: Concurrency and Computation: Practice & Experience. 36, 19, 19 p., e8141.Research output: Contribution to journal › Article › Scientific › peer-review View all 131 research outputs Projects Projects per year 2025 2025 2029 2 Active Projects per year Design Methods for Massively Parallel GPU Computing (MaPaGPU)Heljanko, K. T. (Project manager)Academy of Finland01/09/2025 → 31/08/2029Project: Research Council of Finland: Academy Project LUMI AI Factory - Service CenterHeljanko, K. T. (Project manager), Dönges, S. I. (Participant), Medlar, A. (Participant), Niskanen, A. (Participant), Robertson, F. R. (Participant), Rodriguez Beltran, S. (Participant), Sarapisto, T. (Participant), Satrio, N. R. B. (Participant), Tong, H. (Participant) & Wang, Y. (Participant)European Commission, CSC-Tieteen tietotekniikan keskus Oy01/03/2025 → 29/02/2028Project: EU Horizon Europe Joint Undertaking (JU-RIA) Press/Media Finnish AI research gets boost from NVIDIAHeljanko, K.27/05/20201 item of Media coveragePress/Media: Press / Media Nvidia and Finnish researchers create AI technology centerHeljanko, K.27/05/20201 item of Media coveragePress/Media: Press / Media CSC: Finnish Cen­ter for AI and NVIDIA to es­tab­lish a joint NVIDIA AI Technology Cen­terKaski, S. & Heljanko, K.26/05/20202 items of Media coveragePress/Media: Press / Media -UNIVERSITY OF HELSINKI: Future search engines will help users find information they don't even know they are looking forHeljanko, K. & Ruotsalainen, L.17/06/20191 item of Media coveragePress/Media: Press / Media UNIVERSITY OF HELSINKI : Data science may soon expose fake newsHeljanko, K. & Ruotsalainen, L.13/03/20191 item of Media coveragePress/Media: Press / Media View all 9 press/media",
  "content_length": 4829,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:22"
}