{
  "name": "Keishi Tajima",
  "homepage": "http://www.dl.soc.i.kyoto-u.ac.jp/~tajima/index.html",
  "status": "success",
  "content": "Keishi TAJIMA - Kyoto University [ English | Japanese ] Keishi TAJIMA, D.Sc. (1996, the Dept. of Information Science of University of Tokyo) Professor at Institute for Liberal Arts and Sciences, Kyoto University Professor at Social Media Research Unit, Social Informatics Course, Graduate School of Informatics, Kyoto University (secondary) 2005.05-2013.03: an associate professor at Dept. of Social Informatics, Graduate School of Informatics, Kyoto University. 2001.09-2006.03: an associate professor (-2005.04) / a visiting associate professor (2005.05-) at School of Information Science, JAIST. 2000.08-2001.08: a visiting assistant professor at the Dept. of Computer and Information Science, University of Pennsylvania and a member of the database research group. 1996.04-2001.08: a research associate at the Dept. of Computer and Systems Eng., Kobe University and a member of the database research group led by Katsumi Tanaka. 1994.04-1996.03: a resident at Research Institute of Mathematical Sciences of Kyoto University. Advisor: Atsushi Ohori. Also a member of KABA. 1987.04-1996.03: a student at the Dept. of Information Science of University of Tokyo. Advisor (1990-1994): Takashi Masuda, Kazuhiko Kato. Program Committee: WWW'26 (full, short), WSDM'26 (full,short), CIKM'25 (full, short), SIGIR'25 (full, short), IUI'25 (demo/poster), WSDM'25, CIKM'24 (full, short), ICMR'24, SIGIR'24 (full, short), AAAI'24, WSDM'24, SIGIR-AP'23, HCOMP'23, CIKM'23 (full, short), SIGIR'23 (full, short), WSDM'23, HCOMP'22, CIKM'22, SIGIR'22 (full, short), WSDM'22, CIKM'21, KDD'21, SIGIR'21, IUI'21 (demo/poster), WSDM'21, CIKM'20, VLDB'20 (demo), SIGIR'20, … Research Interests Social Information Extraction and Analysis Social Network Analysis Crowdsourcing (CREST CyborgCrowd Project) Information Retrieval Information Access User Interface Data Models Data Security Publications (copyright notice) a longer but yet incomplete list a list at DBLP ACM Digital Library Author Page Recent Publications title / published in author(s) pdf misc Graph-Structure-Based Grouping of Web Browser Tabs into Tasks Adjunct Proc. of ACM UIST, pp.96:1-96:3, Busan, Korea, 2025 Mizuki Hisatomi, Keishi Tajima abstract poster .bib Analysis of Echo Chamber Formation by Friend Recommendation Proc. of ACM Hypertext, pp.38-42, Chicago, IL, 2025 Masafumi Iwanaga, Keishi Tajima abstract slides .bib SARI: A Stage-Aware Recognition Method for Ingredients Changing Appearance in Cooking Image Sequences JIP, Vol33, 104-114, 2025 Yixin Zhang, Yoko Yamakata, Keishi Tajima abstract  .bib Next Topic Recommendation for Influencers on Social Media Proc. of IEEE BigData, pp.723-728, Washington DC, USA, 2024 Masafumi Iwanaga, Keishi Tajima, Yoko Yamakata abstract  .bib slides  talk Adaptive Feature Inheritance and Thresholding for Ingredient Recognition in Multimedia Cooking Instructions Proc. of ACM Multimedia Asia, pp.94:1-94:7, Auckland, New Zealand, 2024 Yixin Zhang, Yoko Yamakata, Keishi Tajima abstract slides  .bib Content-Based Exclusion Queries in Keyword-Based Image Retrieval Proc. of ACM ICMR, pp.1145-1149, Phuket, Thailand, 2024 Eisaku Yoshikawa, Keishi Tajima abstract poster .bib Automatic Construction of Expiration Time Expression Dataset from Retweets Proc. of WWW Conf., pp.545-548, Singapore, 2024 Hirotaka Nagashima, Keishi Tajima abstract poster .bib promo video An Adaptive Feature Selection Method for Learning-to-Enumerate Problem Proc. of ECIR Part III, pp.122-136, Glasgow, UK, 2024 Satoshi Horikawa, Chiyonosuke Nemoto, Keishi Tajima, Masaki Matsubara, Atsuyuki Morishima abstract slides  .bib Search Result Presentation for Non-Native Language Documents Companion Proc. of ACM IUI, pp.89-94, Greenville, SC, 2024 Tetsuya Sasaoka, Yoko Yamakata, Keishi Tajima abstract .bib poster  slides A Centrality for Social Media Users Focusing on Information-Gathering Ability Proc. of ACM Hypertext, pp.32:1-32:9, Rome, Italy, 2023 Mamoru Yamakawa, Keishi Tajima abstract slides  .bib Active Learning Strategies Based on Text Informativeness Proc. of IEEE/WIC/ACM WI-IAT, pp.32-39, Niagara Falls, Canada, 2022 Ruide Li, Yoko Yamakata, Keishi Tajima abstract  .bib slides  video Real-World Popularity Estimation from Community Structure of Followers on SNS Proc. of IEEE/WIC/ACM WI-IAT, pp.328-334, Niagara Falls, Canada, 2022 Shuhei Kobayashi, Keishi Tajima abstract slides  .bib Worker Qualifications for Image-Aesthetic-Assessment Tasks in Crowdsourcing Work-in-progress paper in AAAI HCOMP, #pages:3, 2022 Yudai Kato, Marie Katsurai, Keishi Tajima abstract  .bib slides  poster MIAIS: A Multimedia Recipe Dataset with Ingredient Annotation at Each Instructional Step Proc. of CEA++ (In conj. with ACM MM), pp.49-52, Lisbon, Portugal, 2022 Yixin Zhang, Yoko Yamakata, Keishi Tajima abstract  .bib slides  video poster Spammer Detection Based on Task Completion Time Variation in Crowdsourcing Proc. of HMData (collocated with IEEE BigData), pp.3568-3570, 2021 Ayato Watanabe, Keishi Tajima abstract slides  .bib MIRecipe: A Recipe Dataset for Stage-Aware Recognition of Changes in Appearance of Ingredients Proc. of ACM Multimedia Asia, pp.16:1-16:7, 2021 Yixin Zhang, Yoko Yamakata, Keishi Tajima abstract  .bib slides  video poster Supplementing Omitted Named Entities in Cooking Procedural Text with Attached Images Proc. of IEEE MIPR, pp.199-205, 2021 Yixin Zhang, Yoko Yamakata, Keishi Tajima abstract  .bib slides  video poster Making AI Machines Work for Humans in FoW ACM SIGMOD Record, Vol.49, No.2, pp.30-35, 2020 author list .bib Categorization of Cooking Actions Based on Textual/Visual Similarity Proc. of MADiMa (In conj. with ACM MM), pp.42-49, Nice, France, 2019 Yixin Zhang, Yoko Yamakata, Keishi Tajima abstract  .bib slides  poster Disjunctive Sets of Phrase Queries for Diverse Query Suggestion Proc. of IEEE/WIC/ACM WI, pp.449-455, Thessaloniki, Greece, 2019 Ziyang Liao, Keishi Tajima abstract slides  .bib Identifying Tags Describing Image Contents Proc. of ACM Hypertext, pp.297-298, Hof, Germany, 2019 Taka Maenishi, Keishi Tajima abstract poster  .bib Imagine All the People and AI in the Future of Work ACM SIGMOD Blog, 2019 author list -- HTML Temporal Analysis of Supply and Demand of Topics on The Web Proc. of ACM WebSci, pp.143-144, Boston, MA, 2019 Masahiro Inoue, Keishi Tajima abstract poster  .bib A Ranking Method for Relaxed Queries in Book Search Proc. of ACM/IEEE JCDL, pp.400-401, Urbana-Champaign, IL, 2019 Momo Kyozuka, Yang Xu, Keishi Tajima abstract poster  .bib Improving Multiclass Classification in Crowdsourcing by Using Hierarchical Schemes Proc. of WWW Conf., pp.2694-2700, San Francisco, CA, 2019 Xiaoni Duan, Keishi Tajima abstract poster  .bib A Map Search System based on a Spatial Query Language (demo) Proc. of EDBT, pp.578-581, Lisbon, Portugal, 2019 Yuanyuan Wang, Panote Siriaraya, Haruka Sakata, Yukiko Kawai, Keishi Tajima abstract .bib demo1  demo2 A Proposal of Spatial Operators for a Collaborative Map Search System Companion Proc. of ACM IUI, pp.79-80, Los Angeles, CA, 2019 Yuanyuan Wang, Panote Siriaraya, Yukiko Kawai, Keishi Tajima abstract poster  .bib A Case Study on Start-up of Dataset Construction: In Case of Recipe Named Entity Corpus Proc. of HMData (collocated with IEEE BigData), pp.3564-3567, Seattle, WA, 2018 Yoko Yamakata, Keishi Tajima, Shinsuke Mori abstract slides  .bib A Cache-based Approach to Dynamic Switching between Different Dataflows in Crowdsourcing Proc. of HMData (collocated with IEEE BigData), pp.3552-3554, Seattle, WA, 2018 Yusuke Suzuki, Masaki Matsubara, Keishi Tajima, Toshiyuki Amagasa, Atsuyuki Morishima -- abstract  .bib slides  poster Ranking Methods for Query Relaxation in Book Search Proc. of IEEE/WIC/ACM WI, pp.466-473, Santiago, Chile, 2018 Momo Kyozuka, Keishi Tajima abstract slides  .bib SNS Retrieval Based on User Profile Estimation Using Transfer Learning from Web Search Proc. of IEEE/WIC/ACM WI, pp.278-285, Santiago, Chile, 2018 Daisuke Kataoka, Keishi Tajima abstract slides  .bib Efficient Pipeline Processing of Crowdsourcing Workflows Proc. of ACM CIKM, pp.1559-1562, Turin, Italy, 2018 Ken Mizusawa, Keishi Tajima, Masaki Matsubara, Toshiyuki Amagasa, Atsuyuki Morishima abstract poster  .bib Main Publications There are bugs in our ICDE 2010 paper. Here is a bug-fixed version. title / published in author(s) pdf misc Predicting Popularity of Twitter Accounts through the Discovery of Link-Propagating Early Adopters Proc. of ACM CIKM, pp.639-648, Indianapolis, IN, 2016 Daichi Imamori, Keishi Tajima abstract slides  .bib Classification of Twitter Accounts into Targeting Accounts and Non-Targeting Accounts Proc. of ACM Hypertext, pp.291-296, Halifax, Canada, 2016 Hikaru Takemura, Keishi Tajima abstract slides  .bib Extracting Logical Hierarchical Structure of HTML Documents Based on Headings Proc. of VLDB, Vol.8, No.12, pp.1606-1617, Kohala Coast, HI, 2015 Tomohiro Manabe, Keishi Tajima abstract  .bib slides  poster software Classification of Twitter Follow Links Based on the Followers' Intention Proc. of ACM SAC, pp.1174-1180, Salamanca, Spain, 2015 Hikaru Takemura, Atsushi Tanaka, Keishi Tajima abstract slides  .bib Why You Follow: A Classification Scheme for Twitter Follow Links Proc. of ACM Hypertext, pp.324-326, Santiago, Chile, 2014 Atsushi Tanaka, Hikaru Takemura, Keishi Tajima abstract poster  .bib Schemaless Semistructured Data Revisited--Reinventing Peter Buneman's Deterministic Semistructured Data Model-- In Search of Elegance in the Theory and Practice of Computation- Essays Dedicated to Peter Buneman, pp.466-482, LNCS, Vol. 8000, Edinburgh, Scotland, 2013 Keishi Tajima abstract slides  .bib Tweet Classification Based on Their Lifetime Duration Proc. of ACM CIKM, pp.2367-2370, Maui, HI, 2012 Hikaru Takemura, Keishi Tajima abstract poster  .bib Optimal Tree Node Ordering for Child/Descendant Navigations Proc. of IEEE ICDE, pp.840-843, Long Beach, CA, 2010 Atsuyuki Morishima, Keishi Tajima, Masateru Tadaishi abstract slides  .bib",
  "content_length": 12740,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:20"
}