{
  "name": "Keith Mayes",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/keith-mayes",
  "status": "success",
  "content": "Keith Mayes - Royal Holloway Research Portal View Scopus Profile Keith Mayes Professor Emeritus Professor Information Security, Department of Information Security Phone+44 1784 414408EmailKeith.Mayesrhul.acuk TW20 0EX Personal profile Personal profileProf Keith Mayes B.Sc. Ph.D. CEng FIET MCIIS received his BSc (Hons) in Electronic Engineering in 1983, and his PhD in Digital Image Processing in 1987, both from the University of Bath. He has authored 150+ research publications in numerous conferences, books and journals. During his BSc he was employed by Pye TVT (Philips) which designed and produced TV broadcast and studio equipment. His PhD was sponsored by Honeywell Aerospace and Defence, where we worked until 1988 when he joined Racal Research, working on a wide range of research and advanced development projects, leading to his recognition as a Chartered Engineer. In 1995 he joined Racal Messenger to continue work on a vehicle licence plate recognition system (Talon) and an early packet radio system (Widanet/Paknet). In 1996 Keith joined Vodafone as a Senior Manager working within the Communication Security and Advanced Development group, under Professor Michael Walker. Early work concerned advanced mesh radio systems, and involved participation in international standardisation (ETSI SMG2). Later he led the Maths & Modelling team and the Fraud & Security group. During this time he was training in intellectual property and licensing, culminating in membership of the Licensing Executives Society (LES) and the added responsibility for patent issues in Vodafone UK. In 2000, following work on m-commerce and Smart Cards he joined the Vodafone International organisation as the Vodafone Global SIM Card Manager, responsible for SIM card harmonisation and strategy for the Vodafone Group. In 2002, Keith left Vodafone to set up Crisp Telecom, but then in November 2002 he was also appointed as the Founder Director of the Smart Card Centre (SCC) at Royal Holloway University of London (RHUL), reporting to Professor Fred Piper in the world renowned Information Security Group (ISG). Almost 13 years later, he was appointed as the Director of the ISG (for three years) and the next year he was also appointed as the Head of the School of Mathematics and Information Security (for two years). He was later the Founder Director of the Transformative Digital Technologies, Security and Society research catalyst and the creator of the “Omnidrome”, drone and robotics centre initiative at RHUL; for the latter he qualified as a UK GVC and A2CofC drone pilot. Other academic roles have included, ISG Director of Impact, CI/PI for ISG involvement in the UK National Cyber Security Centre (NCSC) Academic Centres of Excellence in Cyber Security Research (ACE-CSR) programme, CI for the RHUL Centre for Doctoral Training in Cyber Security (CDT), member of the Academic Board Executive Committee, Academic Board, Science Faculty Board and the Steering Committee for the RHUL Institute for Cyber Security Innovation (ICSI).Keith is a Chartered Engineer, a Fellow of the Institution of Engineering and Technology, a Member of the Chartered Institute of Information Security and an experienced company director and consultant. He is, active in the UK All Party Parliamentary Group (APPG) on Cyber Security, an Adjunct Professor at the University of Maryland Baltimore County (USA), a Guest Professor at Keio University (Japan), and the former Chairman of the International Cyber Security Centre of Excellence (INCS-CoE).Research interestsHis research interests are diverse; although there is a common pull towards applied research of \"impact\". Topics include, mobile communications, NFC, Mobile platform security, smart cards, RFIDS, the Internet of Things, CNI, Cyber-Physical systems, transport ticketing/system security, financial transactions and mobile commerce, image processing and biometrics for authentication. Implementing security algorithms and solutions on secured chips is a recurring interest; for example some work (driven by industry/government sponsorship), investigated the feasibility/performance of implementing cryptographic algorithms on secured smart card platforms; including the TUAK mobile authentication algorithm (for ETSI/SAGE/GSMA/3GPP), authenticated encryption modes (for EMV) and a Speck based 3G authentication algorithm (for NCSC). Future work is looking to international collaboration on critical systems research via the International Cyber Security Center of Excellence (INCS-CoE) initiative, and more generally at the research cross-over between security and engineering disciplines. A recent and growing interest is in the practical use of drones and land/water based robotic vehicles; including archeological survey using drone mounted LiDAR.ConsultancyKeith is an experienced consultant and project manager in a range of technical, security and intellectual property areas. Major projects via Royal Holloway, University of London (RHUL), have included the security work that he led on the Ov-Chipkaart for the Dutch transport ministry, following published attacks on the MIFARE Classic chip card; and his contribution to security studies for the UK Cards Association and for ITSO.He is also the owner/director of Crisp Telecom Limited that has provided expert advisory and development/test services for 20+ years.His LinkedIn profile is www.linkedin.com/in/keithmayes Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 80 Conference contribution 29 Article 17 Paper 16 Chapter 16 More 9 Other contribution 4 Chapter (peer-reviewed) 2 Book 1 Special issue Research output per year Research output per year Enhanced Cyber-Physical Security Using Attack-resistant Cyber Nodes and Event-triggered Moving Target DefenceHiggins, M., Mayes, K. & Teng, F., 10 Mar 2021, (E-pub ahead of print) In: IET Cyber-Physical Systems: Theory & Applications. 6, 1, p. 12-26 15 p.Research output: Contribution to journal › Article › peer-review Open Access One Covert Channel to Rule Them All: A Practical Approach to Data Exfiltration in the CloudSemal, B., Markantonakis, K., Mayes, K. & Kalbantner, J., 9 Feb 2021, (E-pub ahead of print).Research output: Contribution to conference › Paper › peer-review Open AccessFile 610 Downloads (Pure) Privacy-preserving Group Authentication for RFID Tags Using Bit-Collision Patterns Yang, A., Boshoff, D., Hu, Q., Hancke, G., Luo, X., Weng, J., Mayes, K. & Markantonakis, K., 12 Feb 2021, (E-pub ahead of print) In: IEEE Internet of Things Journal.Research output: Contribution to journal › Article › peer-review Open AccessFile 247 Downloads (Pure) High Precision Laser Fault Injection using Low-cost ComponentsKelly, M. & Mayes, K., 25 Dec 2020, (E-pub ahead of print) p. 1-10. 10 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile 1776 Downloads (Pure) Performance Evaluation and Optimisation for Kyber on the MULTOS IoT Trust-AnchorMayes, K., 10 Sept 2020, (E-pub ahead of print) p. 1-8. 8 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile 313 Downloads (Pure) View all 158 research outputs Projects 16 Finished Projects per year EPSRC CDT2Cid, C. (PI), Paterson, K. (CoI), Mayes, K. (CoI), Martin, K. M. (CoI), Kinder, J. (CoI) & Adey, P. (CoI)Eng & Phys Sci Res Council EPSRC1/10/16 → 31/03/23Project: Research New member of the Smart Card Centre for researchMarkantonakis, K. (PI) & Mayes, K. (CoI)VISA Europe Services Inc1/09/13 → 31/08/14Project: Research Renewal of associate membership of the Smart Card Centre, for research in to transport ticketing system securitymayesMayes, K. (PI) & Markantonakis, K. (CoI)ITSO Limited1/04/13 → 31/03/14Project: Research Full council membership contribution to the smart card centre for researching security and attacks in transport ticketing and related systemsMayes, K. (PI) & Markantonakis, K. (CoI)Transport for London1/09/12 → 31/08/18Project: Research Academic Centre of Excellence in Cyber Security ResearchCrampton, J. (PI) & Mayes, K. (CoI)Eng & Phys Sci Res Council EPSRC1/07/12 → 30/06/15Project: Research View all 16 projects",
  "content_length": 8723,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:24"
}