{
  "name": "Keith M. Martin",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/keith-m-martin",
  "status": "success",
  "content": "Keith M. Martin - Royal Holloway Research Portal Keith M. Martin Professor Professor of Information Security, Department of Information Security https://orcid.org/0000-0001-7877-9075 Phone+44 1784 443099EmailKeith.Martinrhul.acuk TW20 0EX Personal profile Personal profileI am a Professor in the Information Security Group, with broad interests in cryptography and cyber security. I am Director of the EPSRC Centre for Doctoral Training in Cyber Security for the Everyday. I was Director of the Information Security Group from 2010 to 2015. Personal Homepage Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 59 Article 45 Chapter 27 Conference contribution 5 Book 10 More 3 Paper 3 Other contribution 2 Special issue 1 Chapter (peer-reviewed) 1 Abstract Research output per year Research output per year Cryptographic SystemsMartin, K. M., 20 Feb 2025, Realizing Complex System Design. Boca Raton: Taylor & FrancisResearch output: Chapter in Book/Report/Conference proceeding › Chapter Cyber Security Foundations: Fundamentals, technology and societyMartin, K. M., Happa, J., Mersinas, K. & Schmitz, G., 3 Mar 2025, London: Kogan Page. 287 p.Research output: Book/Report › Book Cyber threat intelligence in practice: Implications of the blurred lines between public and private intelligence activityAshdown, N. & Martin, K. M., 1 Jan 2025, In: Cyber Security: A Peer-Reviewed Journal. 8, 3, p. 264-272 9 p.Research output: Contribution to journal › Article › peer-review Everyday Cryptography: Fundamental Principles and ApplicationsMartin, K. M., 17 Jul 2025, 3rd ed. Oxford University Press.Research output: Book/Report › Book A milestone in encryption control – what sank the US key-escrow policy?Jarvis, C. & Martin, K. M., 31 Jan 2024, (E-pub ahead of print) In: Intelligence and National Security. 39, 6, p. 986-1008 23 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 67 Downloads (Pure) View all 146 research outputs Projects 2 Active 5 Finished Projects per year EPSRC Centre for Doctoral Training in Cyber Security for the EverydayMartin, K. M. (PI)Eng & Phys Sci Res Council EPSRC1/10/19 → 31/03/28Project: Research EPSRC Centre for Doctoral Training in Cyber Security for the Everyday Martin, K. M. (PI), Cid, C. (CoI), Coles-Kemp, L. (CoI), Jensen, R. B. (CoI) & Adey, P. (CoI)1/10/19 → 31/03/28Project: Other EPSRC CDT2Cid, C. (PI), Paterson, K. (CoI), Mayes, K. (CoI), Martin, K. M. (CoI), Kinder, J. (CoI) & Adey, P. (CoI)Eng & Phys Sci Res Council EPSRC1/10/16 → 31/03/23Project: Research CLARUS: A Framework for user centred privacy and Security in the CloudMartin, K. M. (PI) & Crampton, J. (PI)European Commission1/01/15 → 31/12/17Project: Research Centre for Doctoral Training in Cyber SecurityCid, C. (PI), Crampton, J. (CoI), Martin, K. M. (CoI) & Paterson, K. (CoI)Eng & Phys Sci Res Council EPSRC1/04/13 → 31/12/19Project: Research View all 7 projects",
  "content_length": 3241,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:24"
}