{
  "name": "Keith Marzullo",
  "homepage": "https://www.cics.umass.edu/about/directory/keith-marzullo",
  "status": "success",
  "content": "Keith Marzullo : Manning College of Information & Computer Sciences : UMass Amherst Skip to main content The University of Massachusetts Amherst Image Keith Marzullo Dean Contact marzullo [at] umass [dot] edu (413) 545-2572 Location Room A125E Lederle Graduate Research Center Lowrise 740 N. Pleasant Street Amherst , MA 01003 United States Research Areas Security and Privacy Health Informatics Human-Computer Interactions About Keith Marzullo is the Donna M. and Robert J. Manning Dean of the UMass Amherst Manning College of Information and Computer Sciences (CICS).  Prior to joining Manning CICS in 2025, he served for nine years as dean of the College of Information (INFO) at the University of Maryland, where he led the college through a period of strategic growth, expanded academic programs and research capacity, and deepened partnerships across academia, industry, and the community.Marzullo is the head of the North American section of the international iSchools organization. As an ACM Fellow, he is part of an elite group that represents less than 1% of the ACM’s global membership, recognized for significant contributions to the field of computation and computer science. In recent years, Marzullo’s research has focused on technology in the service of people, with specific interests in cybersecurity, privacy, and socio-technical systems, such as technology that assists in emotion regulation.Before his deanship at the University of Maryland, Marzullo held leadership roles in the federal government, including at the White House Office of Science and Technology Policy, where he served as director of the Networking and Information Technology Research and Development program. In this role, he coordinated R&D and strategic planning activities across more than 20 federal agencies in several areas, including AI, data analytics, cybersecurity, and privacy. Prior to this, Marzullo spent five years at the National Science Foundation, where he directed the Division of Computer and Network Systems in the Directorate for Computer and Information Science and Engineering.Earlier in his career, Marzullo held faculty positions at the University of California, San Diego (where he chaired the Department of Computer Science and Engineering), the University of Tromsø, Norway, and Cornell University. Marzullo received an AB in physics from Occidental College, and both an MS in applied physics and a PhD in electrical engineering from Stanford University. While earning his PhD, Marzullo developed the Xerox Research Internet Clock Synchronization protocol, one of the first practical fault-tolerant protocols for keeping widely distributed clocks synchronized with each other. Marzullo has contributed over 100 publications and articles to the fields of computing and information science. Education AB, Physics, Occidental College MS, Applied Physics, Stanford University PhD, Electrical Engineering, Stanford University Global footer ©2025 University of Massachusetts Amherst Site policies Privacy Non-discrimination notice Accessibility Terms of use",
  "content_length": 3069,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:24"
}