{
  "name": "Keith Paarporn",
  "homepage": "https://sites.google.com/site/kpaarporn",
  "status": "success",
  "content": "Keith PaarpornSearch this siteEmbedded FilesSkip to main contentSkip to navigationKeith PaarpornI am an assistant professor in the Department of Computer Science at the University of Colorado, Colorado Springs.I am currently looking for highly motivated students to work in the areas of game theory, multi-agent systems, control, and security. If you are interested in working with me, please send me an email with your CV and a brief description of your academic background and research interests.Research Interests: game theory,  multi-agent systems, control theory.Email: kpaarpor at uccs dot eduGoogle ScholarCV (updated 7/2025).Recent NewsNov 2025 - New journal paper published at Games and Economic Behavior! The art of concession in General Lotto gamesOct 2025 - New journal paper published: The Defense of Networked Targets in General Lotto games, at IEEE TCNS.Aug 2025 - Faezeh's first paper accepted to Allerton!July 2025 - Four papers accepted to CDC 2025! See you in Rio!May 2025 - I presented my research on evolutionary games at the SIAM Conference on Applications of Dynamical Systems (DS25). It was part of a mini-symposium on Modeling and Controlling Human Behavior in Complex Systems. Many thanks to Lorenzo Zino and Alessandro Rizzo for organizing!Mar 2025 - I presented my research titled \"Learning to Avoid Tragedies: Feedback-Evolving Games with Heterogeneous Learning Rules\" at the Department of Mechanical Engineering at the University of New Mexico.Feb 2025 - I presented my research titled \"Beyond Imitation: Heterogeneous Learning Rules in Feedback-evolving Games\" at the Center for Control, Dynamical Systems, and Computation (CCDC) at UC Santa Barbara.Jan 2025 - I presented my research on \"Strategic resource allocation in competitive environments: Recent advances in Colonel Blotto games\" at the Wm Michael Barnes '64 Department of Industrial and Systems Engineering at Texas A&M University. Jan 2025 - Three papers accepted for presentation at ACC 2025! See you in Denver!Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2052,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:23"
}