{
  "name": "Keith W. Ross",
  "homepage": "https://nyuad.nyu.edu/en/academics/divisions/science/faculty/keith-ross.html",
  "status": "success",
  "content": "Keith W. Ross - NYU Abu Dhabi Skip To All NYU Navigation Skip To Main Content To open and close this bar, use optionalt+/ Keith W. Ross Professor of Computer Science Affiliation: NYU Abu Dhabi Education: BS Tufts University; MS Columbia University; PhD University of Michigan keithwross@nyu.edu Research Areas: Deep Reinforcement Learning; Deep Learning; Artificial Intelligence Keith Ross' Website Keith Ross is a Professor of Computer Science at NYU Abu Dhabi. He currently does research in deep reinforcement learning and artificial intelligence. Previously he worked in other branches of computer science, including Internet privacy, modeling and measurement of computer networks, and Markov decision processes. Professor Ross also holds affiliated appointments with NYU Tandon, NYU Courant Institute of Mathematical Science, NYU Center for Data Science, and NYU Shanghai. Before joining NYU Abu Dhabi, Professor Ross was Dean of Computer Science, Data Science and Engineering at NYU Shanghai from 2013 to 2023. At NYU Shanghai he was also Co-Director of the Center for Data Science and Artificial Intelligence. He also previously held faculty positions at NYU Tandon/Polytechnic University (2003-2013), Institute Eurecom (1998-2003), and University of Pennsylvania (1985-1998). He is an ACM Fellow and an IEEE Fellow. He is also the recipient of several prestigious best paper awards, and his work on Internet privacy was featured in the mainstream press, including The New York Times, NPR, and Bloomberg Television. Professor Ross is co-author (with James F. Kurose) of the popular textbook Computer Networking: A Top-Down Approach Featuring the Internet, published by Pearson (first edition in 2000, eighth edition 2020). It is the most popular textbook on computer networking, both nationally and internationally, and has been translated into fourteen languages. In 1999, he co-founded and led Wimba,  which developed voice and video applications for online learning. He was the Wimba CEO and CTO from 1999 to 2001. Wimba was acquired by Blackboard in 2010. Courses Taught Expand/Collapse all",
  "content_length": 2100,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:25"
}