{
  "name": "Kejiang Ye",
  "homepage": "https://people.ucas.edu.cn/~kejiang?language=en",
  "status": "success",
  "content": "叶可江-中国科学院大学-UCAS [中文] [English] Biography Research Interests Projects Recent Conference Papers General Kejiang YePhD, Professor, DirectorCenter for Cloud ComputingSIAT, CASkj.ye@siat.ac.cn Biography Kejiang Ye is currently a Professor and the Director of the Research Center for Cloud Computing, Shenzhen Institutes of Advanced Technology, Chinese Academy of Sciences. He received his B.S and Ph.D degree both from Zhejiang University and was a Post Doctoral Research Associate at Carnegie Mellon University (CMU). His research interests include Digital Technology and Systems (e.g., Cloud Computing, Big Data and Industrial Internet). He is a Senior Member of IEEE and a Distinguished Member of China Computer Federation (CCF). Research Interests Digital Technology and Systems (Cloud Computing, Big Data, Industrial Internet) Projects [1] National Key R&D Program of China, 2025.12-2028.11, PI[2] National Key R&D Program of China, 2021.12-2024.11, PI[3] NSFC Project, 2023.1-2025.12, PI[4] NSFC Project, 2021.1-2024.12, PI[5] NSFC Project, 2018.1-2020.12, PI Recent Conference Papers Y. Lin, S. Peng, C. Lu, C. Xu, K. Ye. FlexPipe: Adapting Dynamic LLM Serving Through Inflight Pipeline Refactoring in Fragmented Serverless Clusters, EuroSys 2026.Y. Lin, S. Wu, S. Luo, H. Xu, H. Shen, C. Ma, M. Shen, L. Chen, C. Xu, L. Qu, K. Ye. Understanding Diffussion Model Serving in Production: A Top-Down Analysis of Workload, Scheduling, and Resource Efficiency, SoCC 2025.W. Chen, C. Lu, H. Xu, K. Ye, C. Xu. Multiplexing Dynamic Deep Learning Workloads with SLO-awareness in GPU Clusters, EuroSys 2025.L. Chen, S. Luo, C. Lin, Z. Mo, H. Xu, K. Ye, C. Xu. Derm: SLA-aware Resource Management for Highly Dynamic Microservices, ISCA 2024.C. Lu, H. Xu, Y. Li, W. Chen, K. Ye, C. Xu. SMIless: Serving DAG-based Inference with Dynamic Invocations under Serverless Computing, SC 2024. W. Chen, Z. Mo, H. Xu, K. Ye, C. Xu. Interference-aware Multiplexing for Deep Learning in GPU Clusters: A Middleware Approach, SC 2023.C. Lu, H. Xu, K. Ye, G. Xu, L. Zhang, G. Yang, C. Xu. Understanding and Optimizing Workloads for Unified Resource Management in Large Cloud Platforms, EuroSys 2023. S. Luo, H. Xu, K. Ye, G. Xu, L. Zhang, J. He, G. Yang, C. Xu. Erms: Efficient Resource Management for Shared Microservices with SLA Guarantees, ASPLOS 2023. S. Luo, H. Xu, K. Ye, G. Xu, L. Zhang, G. Yang, C. Xu. The Power of Prediction: Microservice Auto Scaling via Workload Learning, SoCC 2022.S. Luo, H. Xu, C. Lu, K. Ye, G. Xu, L. Zhang, Y. Ding, J. He, C. Xu. Characterizing Microservice Dependency and Performance: Alibaba trace analysis, SoCC 2021.（Best Paper Award） 声明：导师网页信息由导师个人维护，仅代表导师本人。教师系统仅提供信息存储空间服务。2013 © 中国科学院大学，网络信息中心.",
  "content_length": 2713,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:24"
}