{
  "name": "Kelly Rosa Braghetto",
  "homepage": "http://www.ime.usp.br/~kellyrb",
  "status": "success",
  "content": "Kelly Rosa Braghetto Kelly Rosa Braghetto Assistant Professor Department of Computer Science Institute of Mathematics and Statistics University of São Paulo Office: IME/USP room C-224 Tel.: +55 11 3091-0750 Fax: +55 11 3091-6134 Email: kellyrb@ime.usp.br Address: Departamento de Ciência da Computação - IME - USP Rua do Matão, 1010 Cidade Universitária - São Paulo - SP - Brasil CEP: 05508-090 Research interests: Databases, Workflow Management, Business Process Management, Formal Methods and Models for System Design and Analysis, Performance Evaluation via Analytical Modeling Talks (in Portuguese): March, 2015 - A Nova Ciência Baseada em Dados apresentado na mesa-redonda com o tema \"Semeando na Nuvem - A biblioteca, a inovação e a produção de conhecimento\" do evento comemorativo do Dia do Bibliotecário 2015, promovido pelo Sistema Integrado de Bibliotecas (SIBi) da USP [Slides]. Tutorials (in Portuguese): September, 2014 - Introdução ao Armazenamento de Dados de Experimentos em Neurociência presented at XXXVIII Reunião da Sociedade Brasileira de Neurociências e Comportamento (SBNeC 2014) [Slides and other resources]. July, 2014 - Introdução à Modelagem e Execução de Workflows Científicos presented at XXXIII Jornadas de Atualização em Informática (JAI 2014) [slides] [lecture notes]. Courses (in Portuguese): [2017, 1st semester] MAC2166 - Introdução à Computação [2017, 1st semester] IBI5013 - Banco de Dados para Bioinformática [2017, 1st semester] MAC0426 - Sistemas de Bancos de Dados [2016, 2st semester] MAC0313 - Introdução aos Sistemas de Bancos de Dados para Estatística [2016, 1st semester] IBI5013 - Banco de Dados para Bioinformática [2016, 1st semester] MAC0426 - Sistemas de Bancos de Dados [2015, 2nd semester] MAC5861 - Modelagem de Banco de Dados [2015, 2nd semester] MAC0439 - Laboratório de Bancos de Dados [2015, 1st semester] MAC2166 - Introdução à Computação [2014, 1st semester] MAC0313 - Introdução aos Sistemas de Bancos de Dados para Estatística [2014, 2nd semester] MAC0439 - Laboratório de Bancos de Dados [2014, 1st semester] MAC2166 - Introdução à Computação [2013, 2nd semester] MAC5861 - Modelagem de Banco de Dados [2013, 2nd semester] MAC0439 - Laboratório de Bancos de Dados [2013, 1st semester] MAC0211 - Laboratório de Programação Education: [2007 - 2011]: Ph.D. student in Computer Science at University of São Paulo. Thesis (in portuguese): Técnicas de Modelagem para a Análise de Desempenho de Processos de Negócio. Slides of the thesis defense (in English): Modeling Techniques for Business Process Performance Analysis. Advisors: Prof. João Eduardo Ferreira and Jean-Marc Vincent. Grantee of: The State of São Paulo Research Foundation (FAPESP). [2009 - 2010]: Ph.D. internship in the MESCAL project at Laboratoire d'Informatique de Grenoble / INRIA Rhône Alpes. Internship advisor: Prof. Jean-Marc Vincent. Grantee of: Coordination for the Improvement of Higher Education Personnel (CAPES) and Égide - Université Joseph Fourier. [2003 - 2006]: MSc student in Computer Science at University of São Paulo. Master's thesis (in portuguese): Padrões de Fluxos de Processos em Banco de Dados Relacionais. Advisor: João Eduardo Ferreira. Grantee of: The National Council for Scientific and Technological Development (CNPq/Brazil). [1999 - 2002]: BSc student in Computer Science at São Paulo State University. Advisor of undergraduate research: Hélio Aparecido Navarro Grantee of: The National Council for Scientific and Technological Development (CNPq/Brazil). Publications: Journals Methodological guidelines for reducing the complexity of data warehouse development for transactional blood bank systems. TAKECIAN, P. L., OIKAWA, M. K., BRAGHETTO, K. R., ROCHA, P., LUCENA, F., KAVOUNIS, K., SCHLUMPF, K. S., ACKER, S., CARNEIRO-PROIETTI, A. B. F, SABINO, E., CUSTER, B., BUSCH, M. P., FERREIRA, J. E. Decision Support Systems (DSS), 55(3), pages 728-739, 2013. Da ciência à e-ciência: paradigmas da descoberta de conhecimento. CORDEIRO, D., BRAGHETTO, K. R., GOLDMAN, A., KON, F. Revista USP, 97, pages 71-80, 2013. Performance Evaluation of Resource-Aware Business Processes Using Stochastic Automata Networks. BRAGHETTO, K. R., FERREIRA, J. E., VINCENT, J.-M. International Journal of Innovative Computing, Information and Control (IJICIC), 8(7(B)), pages 5295-5316, 2012. An Implementation of a Transaction Model for Business Process Systems. GARCIA, M. O., BRAGHETTO, K. R., PU, C., FERREIRA, J. E. Journal of Information and Data Management (JIDM), 3(3), pages 271-286, 2012. Long Lived Transaction Processing for Business Processes and Scientific Workflows. FERREIRA, J. E., ARAÚJO, L. V., BRAGHETTO, K. R., ITALIANO, I. C., OIKAWA, M. K., TAKECIAN, P. L. Journal of Information and Data Management (JIDM), 3(1), pages 35-50, 2012. A Rigorous Approach to Facilitate and Guarantee the Correctness of the Genetic Testing Management in Human Genome Information Systems. ARAÚJO, L. V., MALKOWSKI, S., BRAGHETTO, K. R., PASSOS-BUENO, M. R., ZATZ, M., PU, C., FERREIRA, J. E. BMC Genomics, 12(Suppl 4):S13, 2011. Proceedings Creating Families of Conceptual Database Schemas Using Database Feature Diagrams (DBFDs). MORAES, L. C., BRAGHETTO, K. R. In 30th Brazilian Symposium on Databases (SBBD 2015), Petrópolis, RJ, Brazil, Oct, 2015, pages 45-50. The Case for Resource Sharing in Scientific Workflow Executions. ODA, R., CORDEIRO, D., SILVA, R. F., DEELMAN, E., BRAGHETTO, K. R. In XVI Simpósio de Sistemas Computacionais de Alto Desempenho (WSCAD 2015), Florianópolis, SC, Brazil, Oct, 2015, pages 1-12. Algoritmos para economia de energia no escalonamento de workflows em nuvens computacionais. WATANABE, E. N., CAMPOS, P. P. V., BRAGHETTO, K. R., BATISTA, D. M. In Anais do 32o. Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos (SBRC 2014), Florianópolis, SC, Brazil, May, 2014, pages 31-44. Uma abordagem ad hoc para o tratamento de exceções em processos transacionais. SILVA, P. P. S. B., BRAGHETTO, K. R., FERREIRA, J. E. In Proceedings of 27th Brazilian Symposium on Databases (SBBD 2012), São Paulo, SP, Brazil, October, 2012, pages 153-160. SBC. Transactional Recovery Support for Robust Exception Handling in Business Process Services. FERREIRA, J. E., BRAGHETTO, K. R., TAKAI, O. K., PU, C. In Proceedings of IEEE 19th International Conference on Web Services (ICWS 2012), Honolulu, Hawaii, USA, June, 2012, pages 303 - 310. IEEE Computer Society. Performance Evaluation of Business Processes through a Formal Transformation to SAN. BRAGHETTO, K. R., FERREIRA, J. E., VINCENT, J.-M. In Proceedings of the 8th European Performance Engineering Workshop (EPEW 2011), Borrowdale, UK, October, 2011, pages 42 - 56. LNCS Volume 6977, Springer. Performance Analysis Modeling Applied to Business Processes. BRAGHETTO, K. R., FERREIRA, J. E., VINCENT, J.-M. In Proceedings of the 2010 Spring Simulation Multiconference (SpringSim'10), Orlando, FL, USA, April, 2010, pages 122:1 - 122:8. ACM. Business Processes Management Using Process Algebra and Relational Database Model. BRAGHETTO, K. R., FERREIRA, J. E., PU, C. In Proceedings of the International Conference in e-Business (ICE-B), Porto, Portugal, July, 2008, pages 223 - 233. INSTICC Press. Using Process Algebra to Control the Execution of Business Processes. BRAGHETTO, K. R., FERREIRA, J. E., PU, C. In Proceedings of 23rd Annual ACM Symposium on Applied Computing, Fortaleza, Brazil, March, 2008, pages 128 - 129. ACM. Using Control-Flow Patterns for Specifying Business Processes in Cooperative Environments. BRAGHETTO, K. R., FERREIRA, J. E., and PU, C. In Proceedings of 22rd Annual ACM Symposium on Applied Computing, Seoul, Korea, March, 2007, pages 1234 - 1241.ACM. Large Scale Order Processing through Navigation Plan Concept. FERREIRA, J. E., TAKAI, O. K., BRAGHETTO, K. R., and PU, C. In Proceedings of the 2006 IEEE International Conference on Services Computing, Chicago, USA, September, 2006, pages 297 - 300. IEEE Computer Society. BibIme - Um Software Gerenciador de Bibliotecas Produzido de Forma Cooperativa. BASSI, D., BRAGHETTO, K. R., COLLI, E., KON, F., and FERREIRA, J. E. In Anais do VI Workshop de Software Livre (WSL'2005), Porto Alegre, Brazil, June, 2005. Algoritmo e Análise Geométrica de Escoamentos de Fluidos Incompressíveis. BRAGHETTO, K. R. In Anais do XIV Congresso de Iniciação Científica da UNESP, Presidente Prudente, Brazil, 2002. Algoritmo para a Simulação de Escoamentos de Fluidos Incompressíveis. BRAGHETTO, K. R., and NAVARRO, H. A. In Anais da 1a Escola Temática de Dinâmica e Controle (Dincon 2002) da SBMAC, São José do Rio Preto, Brazil, 2002. Book Chapters Introdução à Modelagem e Execução de Workflows Científicos. BRAGHETTO, K. R., CORDEIRO, D. Atualizações em Informática, 2014, pages 1 - 40. SBC. NPTool: Towards Scalability and Reliability of Business Process Management. BRAGHETTO, K. R., FERREIRA, J. E., PU, C. e-Business and Telecommunications, Communications in Computer and Information Science, Volume 48, 2009, pages 99 - 112. Springer. Technical Reports From Business Process Model and Notation to Stochastic Automata Network. BRAGHETTO, K. R., FERREIRA, J. E., VINCENT, J.-M. Technical report (Reference Number: RT-MAC-2011-03), IME-USP, 2011. Comparison of modeling approaches to business process performance evaluation. BRAGHETTO, K. R., FERREIRA, J. E., VINCENT, J.-M. Technical report (Reference Number: 7065), INRIA, 2009. Academic Awards: Best Student Paper, International Conference in e-Business (ICE-B), July, 2008. Files: Presentations July, 2014 - Introdução à Modelagem e Execução de Workflows Científicos presented at XXXIII Jornadas de Atualização em Informática (JAI 2014). October, 2011 - Performance Evaluation of Business Processes through a Formal Transformation to SAN presented at The 8th European Performance Engineering Workshop (EPEW 2011). September, 2011 - Modeling Techniques for Business Process Performance Analysis, Ph.D. Thesis Defense presented at IME-USP. April, 20",
  "content_length": 10834,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:30"
}