{
  "name": "Kelly Caine",
  "homepage": "https://kellycaine.wordpress.com",
  "status": "success",
  "content": "Kelly Caine Kelly Caine Skip to content HomeResearch News CV Publications Contact About Dr. Kelly Caine is currently a Fulbright Scholar in Computer Science at the University of Iceland. She is also a Professor in the Human-Centered Computing Division of the School of Computing at Clemson University. She is the founder and co-director of the Humans and Technology Lab where she leads research in human factors, cybersecurity, human-centered computing, privacy, usable security, and human-computer interaction. She is co-author of Understanding Your Users: A Practical Guide to User Research (2015) and has published over 100 peer-reviewed papers. She loves teaching students about science and has mentored over 60 students, ranging from undergraduates to post-doctoral fellows, as research assistants in her lab. She and her students have received awards for their collaborative research from the National Academy of Engineering, the Institute of Medicine, the American Public Health Association, and the Human Factors and Ergonomics Society. Prior to joining Clemson, she was Principal Research Scientist in the School of Computing at Indiana University’s Center for Applied Cybersecurity Research, and a UX researcher at Google. She holds degrees from the University of South Carolina (B.A.) and the Georgia Institute of Technology (M.S. and Ph.D.). ThemesAdvisor aging in place Author awards cybersecurity education engineering psychology Fulbright hci health healthcare health communication health informatics health systems home human computer interaction human factors Iceland innovation medical monitoring older adults privacy security speaker technology usability women in computing News Speaking at UTmessan Selected as Fulbright Scholar Introducing Dr. Byron Lowens! College of Engineering, Computing, and Applied Sciences Dean’s Professorship Award Cited in Article about Innovative Approach to Cybersecurity Education Understanding Your Users Published Named Clemson Researcher of the Month Cited in Washington Post Named to Advisory Board of Freedom of the Press Foundation Awarded NSF grant to develop computational jewelry for mHealth Poster Wins 1st Prize at American Public Health Association Meeting Accepted position as assistant professor at Clemson University Awarded NSF grant to develop crowdsourced computer security HealthyState Team Wins NAE/IOM Challenge Awarded NSF grant to develop technologies to help underserved older adults age in place Blog at WordPress.com. Subscribe Subscribed Kelly Caine Sign me up Already have a WordPress.com account? Log in now. Kelly Caine Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 2810,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:27"
}