{
  "name": "Kelly Garcés Pernett",
  "homepage": "https://profesores.virtual.uniandes.edu.co/kjgarces971/es/inicio",
  "status": "success",
  "content": "Kelly Johany Garcés Pernett Kelly Johany Garcés Pernett Profesor Asociado Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Contacto: Oficina: Office: ML 647 Correo: Email: Extensión: Extension: 1780 Formación Investigación Publicaciones Cursos Dictados Proyectos Post-doctoral fellow, INRIA (Sophia Antipolis, France) Ph.D. en Informática, Universidad de Nantes, Francia M.S., Ciencias de la Computación, Universidad de los Andes, Colombia B.S., Ciencias de la Computación, Universidad Pontificia Bolivariana Intereses y líneas de Investigación: Ingeniería basada en modelos Lenguajes de dominio específico Modernización y evolución de software Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar The Software Infrastructure Attitude Scale (SIAS): A Questionnaire Instrument for Measuring Professionals' Attitudes Toward Technical and Sociotechnical Infrastructure Capítulo en Memoria 2026 Kuutila M, Ralph P, Garces K. (2026) The Software Infrastructure Attitude Scale (SIAS): A Questionnaire Instrument for Measuring Professionals' Attitudes Toward Technical and Sociotechnical Infrastructure. Proceedings of the 2026 IEEE/ACM 48th International Conference on Software Engineering (ISBN 000-0-000-00000-0) Brasil. - 2026 Quality concerns when integrating quantum and classical computing: a systematic mapping study Capítulo en Memoria 2025 Marquez C, Garces K, Ojeda J. (2025) Quality concerns when integrating quantum and classical computing: a systematic mapping study. Proceedings of the 28th Ibero-American Conference on Software Engineering (ISBN 979-8-3313-2229-8) España. - 2025 AI-Powered Tutoring for Novice Programmers: Supporting Students Throughout Project Development Capítulo en Memoria 2025 Lugo J, Manrique R, Garces K. (2025) AI-Powered Tutoring for Novice Programmers: Supporting Students Throughout Project Development. Generative Intelligence and Intelligent Tutoring Systems (ISBN 978-3-031-63031-6) Grecia. - 2025 Are there any differences in the way that software engineers perceive their productivity depending on their work style? Capítulo en Memoria 2025 Aranda G, Vizcaíno A, Soto J, Garces K. (2025) Are there any differences in the way that software engineers perceive their productivity depending on their work style?. Agile Processes in Software Engineering and Extreme Programming – Workshops. XP 2025 (ISBN 978-3-032-05798-3) Suiza. - 2025 Doctoral Symposium of the 28th Ibero-American Conference on Software Engineering Evento 2025 Garces K, Segura S.(2025). Doctoral Symposium of the 28th Ibero-American Conference on Software Engineering. - 2025 Establishing a set of visualizations for post-runtime infomation in Quantum Computers. Tesis 2025 .(2025). Establishing a set of visualizations for post-runtime infomation in Quantum Computers..Trabajo Dirigido por: Garces K - 2025 Identificación de factores que impactan el desempeño y bienestar de los desarrolladores de software a partir de grupos focales Tesis 2025 .(2025). Identificación de factores que impactan el desempeño y bienestar de los desarrolladores de software a partir de grupos focales.Trabajo Dirigido por: Garces K - 2025 Retraining and evaluation of machine learning and deep learning models for seizure classification from EEG data Artículo 2025 Carvajal-dossman J, Guio L, García-orjuela D, Guzmán-porras J, Garces K, Naranjo A, Maradei-anaya S, Duitama J. (2025) Retraining and evaluation of machine learning and deep learning models for seizure classification from EEG data. SCIENTIFIC REPORTS (ISSN 2045-2322) 15 (1), pp. 15345-15345. - 2025 VitaVision-AIris: adaptador móvil oftalmológico Tesis 2025 .(2025). VitaVision-AIris: adaptador móvil oftalmológico.Trabajo Dirigido por: Bigio D, Henriquez A, Garces K - 2025 qWard: A Unified Toolkit for Pre- and Post-Runtime Quantum Circuit Metrics OTHER 2025 Marquez C, Sierra D, Garces K. qWard: A Unified Toolkit for Pre- and Post-Runtime Quantum Circuit Metrics. (2025) - 2025 qWard: A Unified Toolkit for Pre- and Post-Runtime Quantum Circuit Metrics Capítulo en Memoria 2025 Marquez C, Sierra D, Garces K. (2025) qWard: A Unified Toolkit for Pre- and Post-Runtime Quantum Circuit Metrics. IEEE Chilecon 2025 2025 IEEE CHILEAN Conference on Electrical, Electronics Engineering, Information and Communication Technologies (CHILECON) (ISBN 000-0-0000-0000-0) Chile. - 2025 ¿Cómo perciben los ingenieros de software su productividad trabajando de forma remota? Un estudio comparativo entre países latinos Capítulo en Memoria 2025 Garces K, Vizcaíno A, Aranda G, Soto J. (2025) ¿Cómo perciben los ingenieros de software su productividad trabajando de forma remota? Un estudio comparativo entre países latinos. Proceedings of the 28th Ibero-American Conference on Software Engineering (ISBN 979-8-3313-2229-8) España. - 2025 Analyzing Quantum Circuit Execution in the Cloud OTHER 2024 Marquez C, Sierra D, Garces K. Analyzing Quantum Circuit Execution in the Cloud. (2024) - 2024 Factors influencing performance, motivation and stress levels of software developers in remotework: a leadership role analysis Tesis 2024 .(2024). Factors influencing performance, motivation and stress levels of software developers in remotework: a leadership role analysis.Trabajo Dirigido por: Garces K - 2024 GITSIGHT PRO: Herramienta para el análisis de repositorios públicos Tesis 2024 .(2024). GITSIGHT PRO: Herramienta para el análisis de repositorios públicos.Trabajo Dirigido por: Garces K - 2024 Integration of a web-based Magnetic Resonance Imaging visualization tool Tesis 2024 .(2024). Integration of a web-based Magnetic Resonance Imaging visualization tool.Trabajo Dirigido por: Duitama J, Garces K - 2024 Introducción a computación cuántica: teoría y práctica Evento 2024 Sierra D, Garces K, Luis Felipe Giraldo.(2024). Introducción a computación cuántica: teoría y práctica. - 2024 Machine learning classification for epilepsy lesions localization based on MRIs Tesis 2024 .(2024). Machine learning classification for epilepsy lesions localization based on MRIs.Trabajo Dirigido por: Garces K, Duitama J - 2024 2015 2015-10 ARQUITECTURA Y DISEÑO DE SW LAB. ARQUITEC. Y DISEÑO DE SW MEJOR. PRODUCT: AUTOMATIZACION 2015-13 ARQUITECTURA DE SOFTWARE 2015-20 ARQUITECTURA Y DISEÑO DE SW LAB. ARQUITEC. Y DISEÑO DE SW MEJOR. PRODUCT: AUTOMATIZACION 2016 2016-10 MEJOR. PRODUCT: AUTOMATIZACION LAB. ARQUITEC. Y DISEÑO DE SW ARQUITECTURA Y DISEÑO DE SW 2016-20 ARQUITECTURA Y DISEÑO DE SW LAB. ARQUITEC. Y DISEÑO DE SW NIVELATORIO MODELAJE SOFTWARE MEJOR. PRODUCT: AUTOMATIZACION PROYECTO INTEGRADOR 2017 2017-10 LAB. ARQUITEC. Y DISEÑO DE SW NIVELATORIO MODELAJE SOFTWARE ARQUITECTURA Y DISEÑO DE SW PROYECTO INTEGRADOR MEJOR. PRODUCT: AUTOMATIZACION 2017-20 MEJOR. PRODUCT: AUTOMATIZACION DESARROLLO DE SW EN EQUIPO ARQUITECTURA Y DISEÑO DE SW PROYECTO INTEGRADOR NIVELATORIO MODELAJE SOFTWARE 2018 2018-10 NIVELATORIO MODELAJE SOFTWARE MEJOR. PRODUCT: AUTOMATIZACION PROYECTO INTEGRADOR ARQUITECTURA Y DISEÑO DE SW 2018-20 PROYECTO INTEGRADOR MEJOR. PRODUCT: AUTOMATIZACION NIVELATORIO MODELAJE SOFTWARE ARQUITECTURA Y DISEÑO DE SW ALGORITMICA Y PROGR. OBJ. I 2019 2019-10 ARQUITECTURA Y DISEÑO DE SW MEJOR. PRODUCT: AUTOMATIZACION PROYECTO INTEGRADOR NIVELATORIO MODELAJE SOFTWARE 2019-20 ARQUITECTURA Y DISEÑO DE SW PROYECTO INTEGRADOR MEJOR. PRODUCT: AUTOMATIZACION NIVELATORIO MODELAJE SOFTWARE 2020 2020-10 ARQUITECTURA Y DISEÑO DE SW MEJOR. PRODUCT: AUTOMATIZACIÓN NIVELATORIO MODELAJE SOFTWARE PROYECTO INTEGRADOR 2020-20 ARQUITECTURA Y DISEÑO DE SW PROYECTO INTEGRADOR NIVELATORIO MODELAJE SOFTWARE 2021 2021-20 PROYECTO INTEGRADOR ARQUITECTURA Y DISEÑO DE SW 2022 2022-10 PROYECTO INTEGRADOR NIVELATORIO MODELAJE SOFTWARE PROYECTO DE GRADO INTRODUCCIÓN A LA PROGRAMACIÓN ARQUITECTURA Y DISEÑO DE SW 2022-13 DISEÑO DE SISTEMAS IOT 2022-14 DISEÑO DE SISTEMAS IOT 2022-20 ARQUITECTURA Y DISEÑO DE SW DISEÑO DE SISTEMAS IOT PROYECTO INTEGRADOR INTRODUCCIÓN A LA PROGRAMACIÓN PROYECTO DE GRADO 2023 2023-10 ARQUITECTURA Y DISEÑO DE SW INTRODUCCIÓN A LA PROGRAMACIÓN PROYECTO DE GRADO PROYECTO INTEGRADOR 2023-13 MODERNIZACIÓN DE SOFTWARE 2023-14 DISEÑO DE SISTEMAS IOT 2023-18 ARQUITECTURA NUEVA TECNOLOGÍA 2023-19 MODERNIZACIÓN DE SOFTWARE 2023-20 INTRODUCCIÓN A LA PROGRAMACIÓN DESARROLLO DE SW EN EQUIPO PROYECTO DE GRADO DISEÑO DE SISTEMAS IOT ARQUITECTURA Y DISEÑO DE SW 2024 2024-10 ARQUITECTURA Y DISEÑO DE SW PROYECTO INTEGRADOR PROYECTO DE GRADO DESARROLLO DE SW EN EQUIPO 2024-13 MODERNIZACIÓN DE SOFTWARE 2024-14 DISEÑO DE SISTEMAS IOT 2024-18 COMPUTACIÓN CUÁNTICA: INTRO COMPUTACIÓN CUÁNTICA: INTRO 2024-19 MODERNIZACIÓN DE SOFTWARE 2024-20 PROYECTO DE GRADO PROYECTO INTEGRADOR DESARROLLO DE SW EN EQUIPO ARQUITECTURA Y DISEÑO DE SW DISEÑO DE SISTEMAS IOT DISEÑO Y PROGRAMACIÓN O.O. 2025 2025-10 ARQUITECTURA Y DISEÑO DE SW DESARROLLO DE SW EN EQUIPO PROYECTO DE GRADO 2025-13 MODERNIZACIÓN DE SOFTWARE 2025-19 MODERNIZACIÓN DE SOFTWARE 2025-20 DESARROLLO DE SW EN EQUIPO PROYECTO DE GRADO ARQUITECTURA Y DISEÑO DE SW",
  "content_length": 9665,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:35"
}