{
  "name": "Kelly Lyons",
  "homepage": "http://individual.utoronto.ca/klyons",
  "status": "success",
  "content": "Website of Kelly Lyons Kelly Lyons Professor Faculty of Information University of Toronto Contact Info Research Publications Teaching Contact Info Mailing address: 140 St. George St. #612 Bissell Building Toronto, Ontario Canada M5S 3G6 Phone: +1-416-946-3839 e-mail: kelly.lyons (at) utoronto.ca My blog: Moving2Academia Twitter: @prof_lyons Curriculum Vitae Kelly Lyons Bio Research My research is situated in the emerging field of service science: the science of the human, organizational, and technological systems called service systems in which I investigate social platforms as enablers for service system interactions. My research interests also include knowledge mobilization, data science, social media, collaborative work, and software engineering. Prior to joining the University of Toronto iSchool in January 2008, I was the Program Director of the IBM Toronto Lab Centre for Advanced Studies (CAS) which partners with university faculty members and graduate students around the world to apply their research to the software products that are built in the IBM Toronto Software Lab. For more information about my work in this role, click here. Research Funding Data Sciences Institute (DSI) Catalyst Grant, PI: M. Alexopoulos (UofT). Using Data Science Methods to Understand the Differential Impact of COVID on Researcher Output by Gender, 2022-2023: $100,000 over 2 years. IBM Canada Advanced Studies Fellowship, PI: S. Zhou (UofT). Line of Business Explainability, 2021-2024: $75,000 over 3 years. eCampus, Virtual Learning Strategy (VLS), Co-PI ($17,000 to UofT), PI: M. Bliemel (UOIT), Co-PI H. Ali-Hassan (York U.), K. Lyons (UofT). Serious Game to Teach Data Literacy and Visualization, 2021: $89,678 over one year. UCL And University of Toronto - COVID 19 Challenges, Economic, Individual, and Societal Impacts of Pandemic Responses on Cities, Co-PI with E. Lomas (UCL), A. Walford (UCL), M. Alexopoulos (UofT), 2021: $15,000 (UofT), £9,900 (UCL) over one year. SSHRC Knowledge Synthesis Grant, 2021, $29,587 over one year, \"Canada's workforce in the Digital Age: Evaluating the Future of Skills, Jobs, Gaps and Policies Post COVID-19\", Co-PI: M. Alexopoulos, UofT. NSERC Discovery Grant, March 2020 to March 2025, $175,000 over 5 years, \"A Data-Driven Approach to Social Platforms for Supporting Value-cocreation and Innovation in Software Development and Industry-Academic Collaborations\". University College London-University of Toronto, Fund for Workshops on Developing Collaborative Projects and Exchange Activities in Artificial Intelligence, Co-PI, \"AI Governance: Building ethical frameworks to balance risk and innovation\", 2020: $15,000 (to R. Alexander and K. Lyons, UofT) and £13,000 (to Co-PIs J. Bunn and E. Lomas, UCL). Mitacs Accelerate, \"Multi-Perspective Text Analysis of Social Knowledge Networks\", 2017-2019 $197,500 over 2 years ($50,000 to K. Lyons over 2 years) PI: E. Stroulia, University of Alberta, Co-PIs: K. Lyons, University of Toronto and L. Lefsrud, University of Alberta, with Partner Organizations, IBM Canada, COSIA, Cerebri AI, and SOSCIP. NSERC Strategic Project Grant September 2015 to September 2019, $747,000, \"Data-Driven Knowledge Mobilization, Translation & Innovation\" PI: K. Lyons, Co-PIs; K. Booth, UBC; R. Miller, University of Toronto; E. Stroulia, University of Alberta. CFI-JELF, 2015, $69,021, \"Large Scale Analysis of Textual Repositories\", PIs: P. Andritsos and K. Lyons. NSERC Engage Grant, 2015, $25,000, with Dell Software Canada \"Semantic Information Extraction for Creating an Expertise Knowledge Base\". Check out the IT World Canada article about this project. NSERC Engage Grant, 2014, $24,900, with Sciencescape \"Investigating Social Network Analysis (SNA) for Recommendation Systems in Science Research Discovery\". NSERC Discovery Grant, March 2013 to March 2018, $75,000 over 5 years, \"Interaction Systems for Smarter Service Engagements\". GRAND (Graphics, Animation, and New Media) Network, March 2013 to 2014, $15,000 over 1 year, \"Media Enabled Organizational Workflow, Collaboration in the GRAND Forum\", Project Leader: Eleni Stroulia (University of Alberta); Project Co-Leader: Kellogg Booth, University of British Columbia. CA Technologies MITACS Accelerate Grant with doctoral candidate, Zack Hayat, April 2013 to September 2013, $15,000 over 1 year, \"Analyzing a Large User Community using the Social Network Analysis Framework\" SAP Business Objects Vancouver Academic Research Center Fellowship and Faculty Grant and NSERC Collaborative Research and Development Grant (CRD) from May 2009 until April 2012, $271,749, over 3 years \"Collaboration Technology for Business Intelligence\". NSERC Discovery Grant March 2011 to 2012, $14,000 1 year, Title: Improving Technology-Mediated Human-to-Human Interactions in Service Systems\". IBM University Relations Smarter Planet Industry Skills Innovation Award, 2011; $10,000 over 1 year; Other Participants: R. McEwen, Faculty of Information, \"Building Smarter Cities Case Studies in an Information, Systems, Services, and Design Course\" NSERC Discovery Grant March 2008 to 2011, $15,000/year for 3 years, Title: Tools and methods for modeling, managing, and implementing service systems. Connaught Start-Up Grant April 2008 to December 2009, $10,000, Title: Understanding Not-for-Profit Service Systems. Media Hilson, G., (July 15, 2015) U of T and Dell Research collaborate on how to find expertise within an organization, IT World Canada. Serebrin, J. (January 18, 2016) With tech giants like Google going after female talent, how can startups compete?, The Globe and Mail. Bathke, B. (December 18, 2015) How public schools arent living up to our expectations in computer science education, Dallas Morning News. Bathke, B. (November 9, 2015) The importance of early exposure to STEM fields, The Deseret News. Lopez-Pacheco, Alexandra. (2010, November 15). Understanding the Service-centric Economy. Financial Post. Publications Recent publications: (Google Scholar Profile) Liu, Y., Noei, E., & Lyons, K. (2022). How ReadMe files are structured in open source Java projects. Information and Software Technology, 148, 106924. (PDF) Qiu, R., Lyons, K., Chen, W. (2021). (eds) AI and Analytics for Smart Cities and Service Systems Proceedings of the 2021 INFORMS International Conference on Service Science, Lecture Notes in Operations Research, Springer, Cham. Noei, E. and Lyons, K. (2022). A Study of Gender in User Reviews Posted on the Google Play Store, Empirical Software Engineering, 27(2), 1-28. (PDF) Alexopoulos, M. & Lyons, K. (2021). Toward understanding the COVID-19 impact on Data Science Innovation in Canada, Accepted for publication in CASCON 21: The 31st Annual International Conference on Computer Science and Software Engineering, November 22-26, 2021, Toronto, Canada (Virtual Event), 10 pages. (PDF) Alexopoulos, M., Lyons, K., Mahetaji, K., & Chiu, K. (2021). Evaluating the Disruption of COVID-19 on AI Innovation using Patent Filings, Accepted for publication in the 2021 IEEE International Symposium on Technology and Society (ISTAS), 28-31 October 2021, Waterloo, Ontario, Canada (Virtual Event), 6 pages. (PDF) Noei, E., Perrie, J., Hao, Y., Hayat, Z., Colak, R., Vembu, S., Lyons, K., and Molyneux, (2021). S. A Qualitative Study of Large-Scale Recommendation Algorithms for Biomedical Knowledge Bases, International Journal on Digital Libraries volume 22, 197215. (PDF) Bashardoost, B. G., Miller, R. J., Lyons, K., & Nargesian, F. (2020). Knowledge translation. Proceedings of the VLDB Endowment, 13(12), 2018-2032. (PDF) Bashardoost, B. G., Miller, R. J., Lyons, K., & Nargesian, F. (2020). Knowledge translation: Extended technical report. arXiv preprint arXiv:2008.01208 (PDF) Anderson, L., Lyons, K. and Sawatani, Y. (2020). Research Approaches to Service Innovation: Organizational Perspectives, to appear in Advances in the Human Side of Service Engineering, J. Spohrer and C. Leitner (Eds.): AHFE 2020, AISC 1208, 7 pages (PDF). Alexander, R. and Lyons, K. (2020). Barriers to Service Innovation Using Data Science, to appear in Advances in the Human Side of Service Engineering, J. Spohrer and C. Leitner (Eds.): AHFE 2020, AISC 1208, 6 pages (PDF). Brisson, S., Noei, E., & Lyons, K. (2020). We Are Family: Analyzing Communication in GitHub Software Repositories and Their Forks. Accepted for publication in 27th IEEE International Conference on Software Analysis, Evolution and Reengineering London, Ontario, Canada, February 18-21, 2020 (pp. 59-69). (PDF) Perrie, J., Xie, J., Nayebi, M., Fokaefs, M., Lyons, K., & Stroulia, E. (2019). City on the river: visualizing temporal collaboration. In Proceedings of the 29th Annual International Conference on Computer Science and Software Engineering (pp. 82-91). (PDF) Noei, E., & Lyons, K. (2019). A survey of utilizing user-reviews posted on Google play store. In Proceedings of the 29th Annual International Conference on Computer Science and Software Engineering (pp. 54-63). (PDF) Bashardoost, B. G., Miller, R., and Lyons, K., (2019). Towards a Benchmark for Knowledge Base Exchange, In Proceedings of the 1st International Workshop on Challenges and Experiences from Data Integration to Knowledge Graphs, held in conjunction with 25th ACM SIGKDD Conference on Knowledge Discovery and Data Mining 2019 (Anchorage, Alaska , August 5, 2019), 5 pages. (PDF) Maglio P., Kieliszewski C., Spohrer J., Lyons K., Patrício L., Sawatani Y. (2019). (eds) Handbook of Service Science, Volume II. Service Science: Research and Innovations in the Service Economy. Springer, Cham. Messinger, P. R., Ge, X., Smirnov, K., Stroulia, E., & Lyons, K. (2019). Reflections of the extended self: Visual self-representation in avatar-mediated environments. Journal of Business Research, in press. (PDF) Frost, R.B., Cheng, M., & Lyons, K. (2019) A Multilayer Framework for Service System Analysis. In: Maglio P., Kieliszewski C., Spohrer J., Lyons K., Patrício L., Sawatani Y. (eds) Handbook",
  "content_length": 21928,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:28"
}