{
  "name": "Kelsey R. Fulton",
  "homepage": "http://www.cs.umd.edu/~kfulton",
  "status": "success",
  "content": "Kelsey Fulton CTLM 214C 1650 Arapahoe St Golden, CO 80401 I’m an Assistant Professor in the Department of Computer Science at the Colorado School of Mines where I run the Security and People at Mines (SPAM) lab. I received my PhD from the University of Maryland, where I was advised by Michelle Mazurek in the Security, Privacy, and People Lab (SP2). My research exists at the intersection of people and security and privacy. The goal of my research is to improve peoples’ understandings and implementations of security and privacy by empirically evaluating their experiences and knowledge. Recent research has focused on: Improving security and privacy education at the K-12 level Exploring the impacts of AI on security and privacy in various capacities (K-12 spaces, software development, study design, etc) Improving the adoption of secure tools and programming languages (fuzzers, Rust, etc) As a result of my work, I aim to provide scientifically-based recommendations for the improvement of secure development, security and privacy education, and the security and privacy considerations of emerging AI technologies. I am fortunate to work with a number of incredible graduate students: Kelly Fisher (CS PhD) Jake Hoekstra (CS PhD) Jack Kingham (CS PhD) Katy Limes (CS PhD) I do not currenlty have any openings for PhD students. I have a few openings for excited, motivated undergraduate and Master’s students. Prospective students can look at the prospective students page for details. news Sep 2025 BAD NEWS: Grant rejected from OpenAI Cybersecurity Grant program. Jul 2025 BAD NEWS: Paper rejected from IEEE S&P. Jun 2024 GOOD NEWS: Our paper detailing the system we built for remote secure development studies has been accepted at CSET 2024! May 2024 GOOD NEWS: Our paper exploring alternatives to code writing as a method for secure development studies has been accepted at SOUPS 2024! May 2024 GOOD NEWS: Work with colleagues exploring the coomunity experiences of security professionals has been accepted at SOUPS 2024! selected publications SOUPS Write, Read, or Fix? Exploring Alternative Methods for Secure Development Studies Kelsey R Fulton , Joseph Lewis , Nathan Malkin, and 1 more author In Symposium on Usable Privacy and Security , 2024 PDF Slides S&P Vulnerability Discovery for All: Experiences of Marginalization in Vulnerability Discovery Kelsey R Fulton , S. Katcher , K. Song , and 4 more authors In IEEE Symposium on Security and Privacy , 2023 PDF Slides CCS Understanding the How and the Why: Exploring Secure Development Practices through a Course Competition Kelsey R Fulton , Daniel Votipka, Desiree Abrokwa , and 3 more authors In ACM SIGSAC Conference on Computer and Communications Security , 2022 PDF Slides SOUPS Benefits and Drawbacks of Adopting a Secure Programming Language: Rust as a Case Study Kelsey R Fulton , Anna Chan , Daniel Votipka, and 2 more authors In Symposium on Usable Privacy and Security , 2021 PDF Slides The best way to reach is me is by sending me an email.",
  "content_length": 3021,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:29"
}