{
  "name": "Ken Satoh",
  "homepage": "http://research.nii.ac.jp/~ksatoh",
  "status": "success",
  "content": "Ken Satoh's Home Page Ken Satoh I am the director of Center for Juris-Informatics in the Joint Support-Center for Data Science Research (ROIS-DS), Japan. Contact Information: Surface Mail Address: Center for Juris-Informatics, Chiyoda-ku, 2-1-2, Hitotsubashi, Tokyo 101-8430, Japan Tel: +81-3-4212-2000 Fax: +81-3-3556-1916 E-mail: ksatoh at nii.ac.jp Home Page: http://research.nii.ac.jp/~ksatoh I am currently investigating juris-informatics (aiming at amalmagation of informatics and law, as bio-informatics amalmagates informatics and biology). You can find my publications about juris-informatics here. I am a member of steering committee of JURISIN workshops (International Workshop on Juris-informatics), JURISIN 2007, JURISIN 2008, JURISIN 2009, JURISIN 2010, JURISIN 2011, JURISIN 2012, JURISIN 2013, JURISIN 2014, JURISIN 2015, JURISIN 2016. JURISIN 2017, JURISIN 2018, JURISIN 2019, JURISIN 2020, JURISIN 2021, JURISIN 2022, JURISIN 2023, JURISIN 2024 and JURISIN 2025 Anyone who are interested in the area are very welcome to join our research group. Research interests Juris-informatics Logical Foundation of Artificial Intelligence Nonmonotonic Reasoning Preference-based Reasoning Logic Programming Case-based Reasoning Machine Learning Discovery Science Software Engineering Multi-Agent Systems Multimedia Retrieval List of Publications (as of January 1, 2025) If you are interested in any papers below, please send a request to: \"ksatoh at nii.ac.jp\". I will send the papers to you by email within 24 hours. Journal Papers 2024 50 Goebel, R., Kano, Y., Kim, M.-Y., Rabelo, J., Satoh, K., Yoshioka, M., \"Overview and Discussion of the Competition on Legal Information, Extraction/Entailment (COLIEE) 2023. Rev. Socionetwork Strateg. 18(1), pp. 27-47 (2024). 2023 49 Robaldo, L., Batsakis, S., Calegari, R., Calimeri, F., Fujita, M., Governatori, G., Morelli, M. C., Pacenza, F., Pisano, G., Satoh, K., Tachmazidis, I., Zangari, J., \"Compliance checking on first-order knowledge with conflicting and compensatory norms: a comparison among currently available technologies\", Artificial Intelligence and Law (2023). https://doi.org/10.1007/s10506-023-09360-z 2022 48 Fungwacharakorn, W., Satoh, K., \"Toward a practical legal rule revision in legal debugging\", Computer Law & Security Review 46 (2022). https://doi.org/10.1016/j.clsr.2022.105696 47 Vuong, Y. T.-H., Bui, Q. M., Nguyen, H.-T., Nguyen, T.-T.-T., Tran, V., Phan, X.-H., Satoh, K., Nguyen, L.-M., \"SM-BERT-CR: a deep learning approach for case law retrieval with supporting model\", Artificial Intelligence and Law Vol. 30 pp. 1-28 (2022). https://doi.org/10.1007/s10506-022-09319-6 46 Arisaka, R., Dauphin, J., Satoh, K., van der Torre, L., \"Multi-agent Argumentation and Dialogue\", Journal of Applied Logics - IfCoLog Journal 9(4), pp. 921-954 (2022). 45 Vu, S. T., Nguyen, M. L., Satoh, K., \"Abstract meaning representation for legal documents: an empirical research on a human-annotated dataset\", Artificial Intelligence and Law 30(2), pp. 221-243 (2022). https://doi.org/10.1007/s10506-021-09292-6 44 Fungwacharakorn, W., Tsushima, K., Satoh, K., \"Diagnosing and Treating Effect of Legal Rule-Based Revision\", New Generation Computing, 40(1), pp. 25-45 (2022). https://doi.org/10.1007/s00354-022-00157-3 43 Rabelo, J., Goebel, R., Kim, M.-Y., Kano, Y., Yoshioka, M., Satoh, K., \"Overview and Discussion of the Competition on Legal Information Extraction/Entailment (COLIEE) 2021\", The Review of Socionetwork Strategies (2022). https://doi.org/10.1007/s12626-022-00105-z 42 Nguyen, H.-T., Nguyen, M.-P., Vuong, T.-H.-Y, Bui, M.-Q., Nguyen, M.-C., Dang, T.-B., Tran, V., Nguyen, L.-M., Satoh, K., \"Transformer-Based Approaches for Legal Text Processing\", The Review of Socionetwork Strategies, 16(1), pp. 135-155 (2022). https://10.1007/s12626-022-00102-2 2021 41 Fungwacharakorn, W., Tsushima, K., Satoh, K., \"Resolving Counterintuitive Consequences in Law Using Legal Debugging\", Artificial Intelligence and Law (2021). https://doi.org/10.1007/s10506-021-09283-7 2020 40 Walton, D., Oliveira, T., Satoh, K. and Mebane, W., \"Argumentation Analytics for Treatment Deliberations in Multimorbidity Cases: An Introduction to Two Artificial Intelligence Approaches\", Topoi (2020). https://doi.org/10.1007/s11245-020-09701-6 39 Tran, V., Le Nguyen, M., Tojo, S., Satoh, K., \"Encoded Summarization: Summarizing Documents into Continuous Vector Space for Legal Case Retrieval\", Artif Intell Law (2020). https://doi.org/10.1007/s10506-020-09262-4 38 Alberti, M., Gavanelli, M., Lamma, E., Riguzzi, F., Satoh, K., Zese, R., \"Dischargeable Obligations in the 𝒮CIFF Framework\", Fundam. Informaticae, 176(3-4): 321-348 (2020). https://doi.org/10.3233/FI-2020-1976 2019 37 Bellodi, E., Satoh, K., Sugiyama, M., \"Summarizing Sinificant Subgraphs by Probablisitic Logic Programming\", Intelligent Data Analysis, 23(6): 1299-1312 (2019). https://doi.org/10.3233/IDA-184339 36 Oliveira, T., Gonçalves, F., Novais, P., Satoh, K., Neves, J., \"OWL-based Acquisition and Editing of Computer-Interpretable Guidelines with the CompGuide\", Expert Systems 36(3) (2019) 35 Pooksook, J., Phan Minh Dung, P. M., Satoh K., Sartor G., ``Modelling Last-act Attempted Crime in Criminal Law'', Journal of Applied Non-Classical Logics, Volume 29, Issue 4, Pages 327-357 (2019). https://doi.org/10.1080/11663081.2019.1647652 A preliminary version appeared as Pooksook, J., Dung, P. M., Satoh, K., \"Modeling Attempted Crime in Criminal Law\", Proceedings of the 10th International Workshop on Juris-Informatics (JURISIN 2016), pp. 59 -- 72, Yokohama, Japan (2016). 2018 34 Ramos, J., Oliveira, T., Novais, P., Neves, J., Satoh, K., ``Cognitive Assistants - An Analysis and Future Trends Based on Speculative Default Reasoning'', Applied Science, 8(5), 742; https://doi.org/10.3390/app8050742 (2018). 33 Nguyen, T. S., Nguyen, L-M, Tojo, S., Satoh, K., Shimazu, A., \"Recurrent Neural Network-based Models for Recognizing Requisite and Effectuation Parts in Legal Texts\", Artificial Intelligence and Law, Vol. 26, No. 2,pp. 169-199 (2018). 32 Kowalski, R., and Satoh, K., \"Obligation as Optimal Goal Satisfaction\", Journal of Philosophical Logic, Vol 47. No. 4, pp. 579-609, https://doi.org/10.1007/s10992-017-9440-3 (2018). 31 Oliveira, T., Silva, A., Satoh, K., Julian, V., Leao, P., Novais P., \"Survivability Prediction of Colorectal Cancer Patients: A System with Evolving Features for Continuous Improvement\", Sensors, Vol. 18 No.9, E2983 (2018). 2017 30 Fujita, M., Goto, Y. Nide, N., Satoh, K. and Hosobe, H., \"Toward a Robot that Acquires Logical Recognition of Space\" Information Engineering Express, Vol. 3, No. 4, pp. 1 -- 10 (2017). 2016 29 Oliveira, T., Satoh, K., Novais, P., Neves, J., and Hosobe, H., \"A Dynamic Default Revision Mechanism for Speculative Computation\", Autonomous Agents and Multi-Agent Systems, Vol. 31 pp. 656-695, doi:10.1007/s10458-016-9341-9 (2016). 2011 28 Nishigai, Y., Asai, K., Kubota, M., Kogawa, T., Satoh, K., Shirakawa, K., Takano, C., Nakamura, M., \"PROLEG: the Presupposed Ultimate Fact Theory by PROLOG Technology\", Information Network Law Review, Volume 10, pp. 54 -- 89 (2011) (in Japanese). 27 Corapi, D., Russo, A., De Vos, M., Padget, J. A., Satoh, K., \"Normative Design Using Inductive Learning\", Theory and Practice of Logic Programming (TPLP), Volume 11(Number 4-5), pp. 783 -- 799 (2011). 2010 26 Hosobe, H., Satoh, K., Ma, J., Russo, A., Broda, K., \"Speculative Constraint Processing for Hierarchical Agents,\" in AI Communications, Volume 23, Number 4, pp. 373-388, IOS Press (2010). A preliminary version appeared as Hosobe, H., Satoh, K., Ma, J., Russo, A., Broda, K., \"Speculative Constraint Processing for Hierarchical Agents\", Proc. of European Workshop on Multi-Agent Systems 2009 (2009). 25 Kaneiwa, K., Satoh, K., \"On the Complexities of Consistency Checking for Restricted UML Class Diagrams\", Theor. Comput. Sci. 411(2): 301-323 (2010) 2009 24 Satoh, K., \"Formalization of Burden of Proof and Its Surrounding Concepts by Logic Programming\", The University of Tokyo Law Review, vol. 4, 46-57 (2009) (in Japanese). 23 Nakamura, S., Nagai, T., Iwahashi,N., Satoh, K. and Asoh, H., \"Learning of Abstract Concepts and Words Based on Model Structure Selection Using Variational Bayes\", IEICE Transactions on Information and Systems, J92-D(4):467-479 (2009) (in Japanese). 2007 22 Hosobe, H., Satoh, K., and Codognet, P., ``Agent-Based Speculative Constraint Processing'', IEICE Transactions on Information and Systems, E90-D(9):1354-1362 (2007). A preliminary version appeared as Satoh, K., Codognet, P., Hosobe, H., ``Speculative Constraint Processing in Multi-agent Systems'', Proc. of Sixth Pacific Rim International Workshop on Multi-Agents (PRIMA2003), LNAI 2891, pp. 133 -- 144, Seoul Korea (2003) (Best Paper Award) 2005 21 Satoh, K., ``Learning Taxonomic Relation by Case-based Reasoning'', Theoretical Computer Science, Vol. 348, pp. 58 -- 69 (2005). A preliminary version appeared as Satoh, K., ``Learning Taxonomic Relation by Case-based Reasoning'', Proceedings of the Eleventh International Conference on Algorithmic Learning Theory, LNAI1968 pp. 179 -- 193 (2000). 20 Satoh, K., ``Speculative Computation and Abduction for an Autonomous Agent, IEICE transactions on Information and Systems'', Vol. E88-D, No. 9, pp. 2031 -- 2038 (2005). A preliminary version appeared as Satoh, K., ``Speculative Computation and Abduction for an Autonomous Agent'', Proceedings of the Ninth International Workshop on Non-Monotonic Reasoning, pp. 191 -- 199, Toulouse, France (2002). 2003 19 Satoh, K., Inoue, K., Iwanuma, K., Sakama, C., ``Speculative Computation by Abduction in Agent Communication'', Computer Software, Vol. 20 No.1, pp. 27 -- 35 (2003) (in Japanese). A preliminary English version appeared as Satoh, K., Inoue, K., Iwanuma, K., Sakama, C., ``Speculative Computation by Abduction under Incomplete Communication Environments'', Proceedings of the Fourth International Conference on ",
  "content_length": 70011,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:37"
}