{
  "name": "Ken Goldberg",
  "homepage": "http://goldberg.berkeley.edu",
  "status": "success",
  "content": "ken goldberg, professor, uc berkeley Ken GoldbergPresident, Robot Learning FoundationProfessor, Industrial Engineering and Operations ResearchWilliam S. Floyd Jr. Distinguished Chair in Engineering, UC BerkeleyChief Scientist, Ambi Robotics and Jacobi Robotics [ about | projects and news | research | teaching | patents | artwork | service | miscellaneous ] about Research Papers News, Presentations, Interviews Contact Info and Office Hours CV Bio and Photos Robot Learning Foundation (organizer of CoRL confs) AUTOLab (Automation Research) BAIR: Berkeley AI Research Lab. IEOR: Industrial Engineering and Operations Research Department EECS: Electrical Engineering and Computer Science Department COE: College of Engineering. Art Practice Department Radiation Oncology Department, UCSF UC Berkeley BCNM: Berkeley Center for New Media. Sky Computing Lab CAL-MR: Center for Automation and Learning for Medical Robotics. ATC: Art, Technology, and Culture Lecture Series. Twitter / X projects and news Armchair Expert Podcast and Video Ancient Wisdom: art exhibit (Los Angeles) Breathless: robot dance performance (NY and SF) Is Data All You Need? Large Robot Action Models and Good Old Fashioned Engineering Augmented Surgical Dexterity (Science Robotics, Nov 2024) Robots: What's Taking So Long?? (TED talk) Chair, BAIR Steering Committee Chief Scientist, Ambi Robotics Chief Scientist, Jacobi Robotics Conference on Robot Learning (CoRL) Executive Board Editorial Board - Science Robotics Journal Orienting Polygonal Parts Without Sensors (online algorithm) Editorial: Getting a Grip on Reality. Science Robotics. V6(54), 26 May 2021. Art and Engineering Interview, National Academy of Engineering. Bridge Journal, June 2021. ICRA Plenary Panel: Synergies between Automation and Robotics (June 2021) New AUTOLab Papers (June 2021) Orienting Polygonal Parts Without Sensors (in Python) AUTOLab Papers (Nov 2020) How To Train Your Robot (free 15 min kids video) How To Train Your Robot (free kids book) AlphaGarden IFRR Panel on Art and Robots (10 Sept 2020) CITRIS People and Robots Initiative Weekly Seminar Series General Chair, 2022 Conference on Robot Learning (CoRL), Auckland, New Zealand. Avuncular Advice from A to Z (RSS Pioneers Workshop for senior PhD and Postdocs, 11 July 2020) Adversarial Grasp Objects. Dexterity Network (Dex-Net) 4.0: Deep Learning for Robust Grasping of Generic Objects Complementarity: Is AI a Threat...or an Opportunity? Dex-Net 1.0 as a Service (DNaaS) Fog Robotics The Center for Automation and Learning for Medical Robotics (Cal-MR) Robots, Botox, and Google Glass (Short Documentary Film) Robots with Their Heads in the Clouds International Advisory Board, Chronus Media Art Center, Shanghai The Science of Character (Short Documentary Film) Why We Love Robots (Short Documentary Film, Botscar Award: Robot Film Festival, Nominated: Emmy Award) Fitts' Law: Open-Access Datasets with 94,000 Timing Measurements Opinion Space: Social Media for Innovation and Insight The Rashomon Project (Multi-Perspective Video Timelines) UC Berkeley Regents' Lectures Program LACMA Art and Technology Lab Jester Dataset of 6.5M joke ratings for Collaborative Filtering and Recommender Systems (updated Nov 2020) Algorithmic Automation Art Projects Applets (interactive Java software) and Videos research Research Papers Summary of Research Contributions Berkeley Automation Science Lab Patents Java Applets, Interactive Online Demonstrations, and Videos ICRA Plenary Panel: Covid-19: How Can Roboticists Help? (June 2020) Open Problems for Robots in Surgery and Healthcare (Workshop, May 2020) The Third Wave of Robot Grasping (This Week in AI (twiml) Podcast with Sam Charrington (March 2020) Debate on Sim2Real at Robotics: Science and Systems Conference Workshop (July 2020) SCHooL: Scalable Collaborative Human-Robot Learning (NSF NRI Project) RAPID: Robot-Assisted Precision Irrigation Delivery (USDA/NSF NRI Project) CITRIS Data and Democracy Initiative NSF National Robotics Initiative Project: Multilateral Manipulation by Human-Robot Collaborative Systems Collaborative Assessment and Feedback Engine (CAFE) Chancellor's Award for Research in the Public Interest (for CAFE) Creative Compliance: Workshop on Robots and Art, IEEE ICRA, Brisbane, AU Top US Schools to Study Robotics First Conference on Robot Learning (#CoRL2017), Mountain View, CA, Nov 13-15, 2017. Co-Chair Free Speech on Free Speech (Online Dialogue) Free Speech Symposium at UC Berkeley Symposium on Robot Learning (SoRL), UC Berkeley, May 1, 2017. Co-Chair. AI in Automation Workshop, ICRA, Singapore, June 2 2017. Co-Chair. Inclusive AI: Technology and Policy for a Diverse Urban Future, UC Berkeley, May 10, 2017. Program Committee. 12th Workshop on Algorithmic Foundations of Robotics (WAFR), Dec 18-20, 2016. San Francisco NSF National Robotics Initiative Project: Multilateral Manipulation by Human-Robot Collaborative Systems CITRIS Data and Democracy Initiative Editor-in-Chief, IEEE Transactions on Automation Science and Engineering Cloud Manufacturing and Automation Workshop Steering Flexible Needles through Soft Tissues (NIH Project) Concept Sketch: ALAN, A Practical Robot for Industry? Motion Planning in Medicine: Optimization and Simulation Algorithms for Image-Guided Procedures: (Monograph). Member, Technical Activities Board, IEEE Robotics and Automation Society Hybrid Wisdom Labs Donation Dashboard: Recommending Charities with Collaborative Filtering Steering Flexible Needles through Soft Tissues (NIH Project) ANA*: An Anytime Nonparametric A* Search Algorithm CONE: Collaborative Observatories for Natural Environments (NSF Project) CONE Welder: Online Game using Robot Camera to Document Wild Birds (NSF/Smithsonian Project) ACONE: Autonomous Camera for the Search for the Ivory-Billed Woodpecker (NSF Project) Respectful Cameras (NSF Project) Jester 4.0: Recommending Jokes with Collaborative Filtering Academic CV Tele-Actor archive Collaborative Teleoperation archive The Tele-Actor and Collaborative Telerobotics Beyond Webcams: An Introduction to Online Robots (MIT Press, 2002) The Robot in the Garden (MIT Press, 2000) Stochastic Plans for Robotic Manipulation (PhD Dissertation, 1990, searchable pdf, 45MB) TechCrunch Robotics Symposium, May 2018, UC Berkeley The California Report Card QuakeCAFE Platform for Earthquake Preparedness Robotics at UC Berkeley teaching Ongoing: Art, Technology, and Culture Colloquium S25: IEOR 215: Analysis and Design of Database Systems F24: IEOR 375: Proseminar on Teaching Engineering F24: IEOR 115: Industrial and Commercial Data Systems S24: IEOR 215: Analysis and Design of Database Systems F23: IEOR 375: Proseminar on Teaching Engineering F23: IEOR 115: Industrial and Commercial Data Systems S23: IEOR 215: Analysis and Design of Database Systems F22: IEOR 375: Proseminar on Teaching Engineering F22: IEOR 115: Industrial and Commercial Data Systems S22: IEOR 215: Analysis and Design of Database Systems S21: IEOR 215: Analysis and Design of Database Systems F20: IEOR 375: Proseminar on Teaching Engineering F20: IEOR 115: Industrial and Commercial Data Systems F20: CS 298-015: BAIR First Year Proseminar F19: IEOR 375: Proseminar on Teaching Engineering F19: IEOR 115: Industrial and Commercial Data Systems F19: CS 298-015: BAIR First Year Proseminar F18: IEOR 115: Industrial and Commercial Data Systems F18: NE 375: Teaching Techniques for Engineering F17: IEOR 115: Industrial and Commercial Data Systems F16: IEOR 115: Industrial and Commercial Data Systems F16: IEOR 66: A Bivariate Introduction to IE and OR S16: IEOR 170: Industrial Design and Human Factors S16: EE 106B/206B: Robotic Manipulation and Interaction F15: IEOR 24: Freshman Seminar: Intro to IEOR S15: IEOR 170: Industrial Design and Human Factors F14: IEOR 115: Industrial and Commercial Data Systems F14: IEOR 24: Freshman Seminar: Intro to IEOR S14: IEOR 170: Industrial Design and Human Factors F13: IEOR 115: Industrial and Commercial Data Systems F13: NWMEDIA 201: Questioning New Media F13: IEOR 24: Freshman Seminar: Intro to IEOR S11: IEOR 215: Analysis and Design of Databases S10: LS 160E: Technology, New Media, and Contemporary Experience F09: BCNM's 'Future of the Forum' Symposium F06: Symposium: Unblinking: New Perspectives on Visual Privacy S06: IEOR 190G: Questioning Efficiency: Human Factors and Existential Phenomenology S02: Advanced Product Design Studio, Pasadena Art Center College of Design S02: EECS 287 / IEOR 290k: Advanced Topics in Robotics S00: IEOR 140: Industrial Production Methods Why We Love Robots (Short Documentary Film) S99: Art 160a: Special Topics in Visual Studies S99: SFAI Grad Critique Seminar on Net Art F97: CS 294-5: Algorithmic Foundations of Robotics F96: IEOR 290K: Algorithms for Robotic Manufacturing patents Patents artwork Current and Past Art Projects Artist Portfolio (2011) The Art, Technology, and Culture Colloquium Artist Resume Selected High Resolution Images Bloom (an internet-based earthwork) Engineering Utopia Exhibition on Art and Engineering at Ohio State University Wow and Flutter (an internet-based earthwork) The Making of a Mensch (Short Documentary Film) Multiplicity: Let's Move Beyond the 'Singularity': Medium Essay Multiplicity: 5-min Video Robots and Creativity: Nautilus Interview Natural Frequencies: Installation and Performance for the 100th anniversary of UC Berkeley's Sather Tower Wow and Flutter (an internet-based earthwork) A Century of Art and Technology in the Bay Area (essay) Robot Art and Science event at the de Young Museum (20 Nov) Body-in-White Robot Sculpture Adam, Golem, Robot. Body-in-White Robot Sculpture The Uncanny Valley Revisited: A Tribute to Masahiro Mori at IROS 2013 Workshop on Art and Robotics: Freud's Unheimlich and the Uncanny Valley Natural Frequencies: Installation and Performance for the 100th anniversary of UC Berkeley's Sather Tower The Rabbi and the Robot STEAM: Using the Arts to Expand Public Interest in STEM Fi",
  "content_length": 12176,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:35"
}