{
  "name": "Kenji Yamanishi",
  "homepage": "http://www.ibis.t.u-tokyo.ac.jp/yamanishi/index_e.html",
  "status": "success",
  "content": "東京大学大学院情報理工学系研究科 数理情報学専攻 山西健司｜プロフィール Prof． Kenji Yamanishi Web Last Updated： Dec. 2019 Japanese English ▶What's New： The book \"Learning with the Minimum Description Length Principle\" has been published from Springer. See the web site of Yamanishi's laboratory for other information. ▼Profile Kenji Yamanishi Professor Department of Mathematical Informatics Graduate School of Information Science and Technology The University of Tokyo. Adress：7-3-1 Hongo, Bunkyo-ku, Tokyo, 113-8656, JAPAN. TEL: +81-3-5841-6895 FAX: +81-3-5841-8599 e-mail: yamanishi att mist.i.u-tokyo.ac.jp [Education] 1992 Ph.D. Mathematical Engineering, University of Tokyo, Japan. Advisor: Prof. Shun-ichi Amari. Dissertation: A Statistical Approach to Computational Learning Theory. 1987 M.S. Mathematical Engineering, University of Tokyo, Japan. Advisor: Prof. Shun-ichi Amari. Thesis: A Study on Algebraic-Geometric Codes. (in Japanese). 1984 B.A. Mathematical Engineering, University of Tokyo, Japan. Advisor: Prof. Shun-ichi Amari. Thesis: A Geometical Approach to Theories of Time Series and Systems.(in Japanese). [Employment　History] Apr. 2009―present Professor, Department of Mathematical Informatics, Graduate School of Information Science and Technology, The University of Tokyo. Apr. 2024― Mar. 2025 Head of Department of Mathematical Engineering and Information Physics, Engineering Department, The University of Tokyo. Apr. 2023― Mar. 2025 Head of Department of Mathematical Informatics, Graduate School of Information Science and Technology. The University of Tokyo. Apr. 2020― Mar. 2022 Vice Dean of Graduate School of Information Science and Technology, The University of Tokyo. Apr. 2016― Mar. 2018 Head of Department of Creative Informatics, Graduate School of Information Science and Technology, The University of Tokyo. Apr. 2013―Mar. 2019 Professor, Department of Creative Informatics, Graduate School of Information Science and Technology, The University of Tokyo. July 2002―Dec. 2008 Research Fellow, NEC Corporation, Japan. July 2000―June 2002 Principal Researcher, NEC Corporation, Japan. Sept.1995―June 2000 Assistant Manager, NEC Corporation, Japan. Aug.1992ーAug.1995. Visiting Scientist, NEC Research Institute, Inc., NJ, U.S.A. July 1992. Assistant Manager, NEC Corporation, Japan. Apr.1987―June 1992. Researcher, NEC Corporation, Japan. [Research Interest] Theory: Information-theoretic Learning TheoryComputational Learning Theory, Statistical Inference, Computational Statistics, Theory of Latent Dynamics Applications: Machine Learning, Data Mining (Anomaly Detection, Rule Induction), Text Mining (Text Classification, Topic Analysis). [Awards] 2023. IEICE Fellow 2015. The Best Teaching Award from the University of Tokyo 2014. IBM Faculty Award 2005. Advanced Technology Award -Fuji Sankei Business Eye Award 2004. Best Invention Award from NEC Corporation (Joint Work) 2003. Contribution Award from NEC Corporation. 2002. Contribution Award from NEC Corporation. 1999. Contribution Award from NEC Corporation. 1992. Contribution Award from NEC Corporation. 1991. Uenohara Award from NEC Corporation. 1991. Contribution Award from NEC Corporation. 1990. Best Paper Award from the Institute of Electronics, Information and Communication Engineers, Japan. Paper:On New Asymptotic Performance Evaluation of Binary Modular Codes. [Membership] IEEE Information Theory Society/Computer Society, Senior Member ACM KDD IEICE(Institute of Electronics, Information, Communication, and Engineers), Fellow JSAI (Japanese Society of Artificial Intelligence), SITA(Society of Information Theory and Its Applications) [Link] Research Map Google Scholar dblp Research Gate ▼Publifications [Refereed Journal Papers] Y. Li, L. Xu, and K. Yamanishi \"GMMDA: Gaussian Mixture Modeling of Graph in Latent Space for Graph Data Augmentation”　Knowledge and Information Systems, 2024. R.Yuki, Y.Ike, and K.Yamanishi:　\" Dimensionality selection for hyperbolic embedding using decomposed normalized maximum likelihood code-length,\" Knowledge and Information Systems, 2023, DOI: 10.1007/s10115-023-01934-2 K.Yamanishi and S. Hirai \"Detecting Signs of Model Change with Continuous Model Selection Based on Descriptive Dimensionality,\" Applied Intelligence, 2023.DOI : 10.1007/s10489-023-04780-5 S.Kyoya and K.Yamanishi: \"Summarizing Finite Mixture Model with　Overlapping Quantification,\" accepted for publication in Entropy, 2021. Y. Hashimoto, T. Kiwaki, H. Sugiura, S. Asano, H. Murata, Y. Fujino, M. Matsuura, A. Miki, K. Mori, Y. Ikeda, T. Kanamoto, J. Yamagami, K. Inoue, M. Tanito, K. Yamanishi, R. Asaoka,: \"Predicting 10-2 visual field from optical coherence tomography in glaucoma using deep learning corrected with 24-2/30-2 visual field\" accepted for publication at Translational Vision Science and Technology. K.Yamanishi, L.Xu, R.Yuki, S.Fukushima, and C. Lin: \"Change Sign Detection with Differential MDL Change Statistics and Its Applications to COVID-19 Pandemic Analysis\" Scientific Reports, 11, Article number: 19795, 2021. https://doi.org/10.1038/s41598-021-98781-4 R. Asaoka, L Xu, H. Murata, T. Kiwaki, M. Matsuura, Y. Fujino, M. Tanito, K. Mori, Y. Ikeda, T. Kanamoto, K. Inoue, J. Yamagami, and K. Yamanishi: \"A joint multitask learning model for cross-sectional and longitudinal predictions of visual field using optical coherence tomography\" accepted for publication in Ophthalmology Science journal, 2021. P.T. Hung and K.Yamanishi: \" Word2vec Skip-gram Dimensionality Selection via Sequential Normalized Maximum Likelihood\", Entropy 2021, 23(8), 997; https://doi.org/10.3390/e23080997 A.Suzukiand K.Yamanishi: \"Fourier-analysis-based Form of Normalized Maximum Likelihood: Exact Formula and Relation to Complex Bayesian Prior\", IEEE Transactions on Information Theory, Vol.67, 9, pp:6164--6178, 2021.\tDOI:10.1109/TIT.2021.3088304 J.Huang, L.Xu, \tK.Qian, J.Wang, K.Yamanishi: \"Multi-label learning with missing and completely unobserved labels\", Data Mining and Knowledge Discovery, 35(3): pp:1061-1086, 2021.\thttps://doi.org/10.1007/s10618-021-00743-x L. Xu, R. Asaoka, H. Murata, T. Kiwaki, Y. Zheng, M. Matsuura, Y. Fujino, M. Tanito, K. Mori,Y. Ikeda, T. Kanamoto, K. Yamanishi: \"Improving visual field trend analysis with optical coherence tomography and deeply-regularized latent-space linear regression\", Ophthalmology Glaucoma, Vol. 4, Issue 1, January–February Pages 78-88, 2021. DOI:doi.org/10.1016/j.ogla.2020.08.002 Y. Hashimoto, R. Asaoka, T. Kiwaki, H. Sugiura, S. Asano, H. Murata, M. Matsuura, A. Miki, K.Mori, Y. Ikeda, T.Kanamoto, J. Yamagami, K. Inoue, M. Tanito, K. Yamanishi: \"Deep learning model to predict visual field in central 10 degrees from optical coherence tomography measurement in glaucoma\" the British Journal of Ophthalmology, 105(4):bjophthalmol-2019-315600 DOI: 10.1136/bjophthalmol-2019-315600 L. Xu, R. Asaoka, T. Kiwaki, H. Murata, Y. Fujino, M. Matsuura, Y. Hashimoto,S. Asano, A. Miki, K. Mori, Y. Ikeda, T.Kanamoto, J. Yamagami, K. Inoue, M. Tanito, K. Yamanishi: \"Predicting the glaucomatous central 10 degrees visual field from optical coherence tomography using deep learning and tensor regression,\" the American Journal of Ophthalmology, 2020. DOI:doi.org/10.1016/j.ajo.2020.04.037 M.Okada, N.Masuda, K.Yamanishi: “Long-tailed distributions of inter-event times as mixtures of exponential distributions”, Royal Society Open Science, Published:26 February 2020, DOI: doi.org/10.1098/rsos.191643 S. Fukushima, K. Yamanshi:　\"Detecting Metachanges in Data Streams from the Viewpoint of the MDL Principle\", Entropy, 2019. L. Xu, J. Wang, L. He, J. Cao, X. Wei, P. S. Yu, K. Yamanishi:　“MixSp: A Framework for Embedding Heterogeneous Information Networks with Arbitrary Number of Node and Edge Types” accepted for publication for IEEE Transactions on Knowledge and Data Engineering, 2019 2019DOI: 10.1109/TKDE.2019.2955945. T. Lee, S.Matsushima, and K.Yamanshi: \"Grafting for combinatorial binary model using frequent itemset mining\", Data Mining and Knowledge Discovery, 2019. Y. Fu, S.Matsushima, K.Yamanishi: \"Model Selection for Non-negative Tensor Factorization with Minimum Description Length\", Entropy 2019, 21(7), 632. DOI:10.3390/e21070632 K.Yamanishi, T.Wu, S.Sugawara, M.Okada: \"The decomposed normalized maximum likelihood code-length criterion for selecting hierarchical latent variable models\", Data Mining and Knowledge Discovery, 2019.DOI: 10.1007/s10618-019-00624-4 K. Moriya, S. Matsushima, K.Yamanishi: “Traffic Risk Mining from Heterogeneous Road Statistics\", IEEE Transactions on Intelligent Transportation Systems, vol 19(11), 3662-3675, 2018.DOI:10.1109/TITS.2018.2856533, 2018 K. Miyaguchi and K. Yamanishi:: \"High-dimensional Penalty Selection via Minimum Description Length Principle\" Machine Learning Journal, 107(8-10), pp:1283-1302, 2018. DOI:10.1007/s10994-018-5732-2 S. Yousefi, T. Kiwaki, Y. Zheng, H. Suigura, R. Asaoka, H. Murata, H. Lemij and K. Yamanishi: \"Detection of Longitudinal Visual Field Progression in Glaucoma Using Machine Learning\", American Journal of Ophthalmology,Vol. 193, pp: 71-79, 2018. DOI: 10.1016/j.ajo.2018.06.007. K.Yamanishi and S.Fukushima::“Model change detection with MDL principle”, IEEE Transactions on Information Theory, 64(9), pp: 6115-6126, 2018. DOI: 10.1109/TIT.2018.2852747. K. Miyaguchi and K. Yamanishi: \"On-line detection of continuous chanages in stochastic processes,\" International Journal of Data Science and Analytics, 3:pp:213-229, 2017. DOI:10.1007/41060-017-0045-2 S. Sugawara, T. Wu, and K. Yamaishi:\" A basket two-part model to analyze medical expenditure on interdependent multiple sectors\", Statistical Methods in Medical Research, Volume: 27 issue: 5, page(s): 1585-1600, Sep.2016.DOI: https://doi.org/10.1177/0962280216665642. K.Morino, Y.Hirata, R.Tomioka, H.Kashima, K.Yamanishi, N.Hayashi, S.Egawa, and K.Aihara: \"Predicting disease progression from short biomarker series using expert advice algorithm\" Scientific Reports ,“ Vol. 5, 8953, 20th, May, 2015.,” DOI",
  "content_length": 59726,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:41"
}