{
  "name": "Kenji Suzuki 0002",
  "homepage": "http://www.ai.iit.tsukuba.ac.jp/kenji",
  "status": "success",
  "content": "Kenji Suzuki, Ph.D. | University of Tsukuba Menu Home News Member Mission Research Publications Joining Lab Access Kenji Suzuki   Dr. Eng. Professor Executive Officer Dean of the Institute of Systems and Information Engineering University of Tsukuba, Japan. Principal investigator: Artificial Intelligence Laboratory Human Smartcity Connection Center for Cybernics Research Center for Innovative Medicine and Engineering Center for Artificial Intelligence Research Advisor to the City of Tsukuba (Smart City / Super City) Associate Member, Science Council of Japan JST CREST Principal Investigator IEEE Robotics and Automation Society, AdCom member He is currently a Professor of the Faculty of Engineering, Information and Systems, and also Principle Investigator of Artificial Intelligence Laboratory, University of Tsukuba. He received the B.S. in Physics, M.E. and Dr. Eng. in Pure and Applied Physics from Waseda University, Tokyo, Japan, in 1997, 2000 and 2003, respectively. He was awarded a research fellowship by the Japan Society for Promotion of Science. Prior to joining the University of Tsukuba in 2005, he was a Research Associate with the Dept. of Applied Physics, Waseda University, Tokyo from 2003 to 2005. From 1997 to 1999, he was a visiting researcher at the Laboratory of Musical Information, University of Genoa, Italy, where he was engaged in a project of Human-robot interaction, Theatrical Museal Machine. In 2009, he was a visiting researcher at LPPA, Laboratory of Physiology of Perception and Action, at the College de France, Paris. He is now a director of the Center for Cybernics Research, and an active member of the Center for Artificial Intelligence Research at the University of Tsukuba. He is an advisor to the City of Tsukuba regarding Smart City . He is served as an elected administrative committee member of the IEEE Robotics and Automation Society since 2019. His primary research interests include artificial intelligence, Cybernics, wearable robotics and devices, affective computing, social robotics and assistive robotics with a particular emphasis on machine learning, pattern classification and dynamical modeling approaches. A special emphasis is laid on the design of empowering people, particularly for elderly, adults and children with special needs. He has published more than 200 peer-reviewed papers and presented a number of invited talks and contributions at conferences in these areas. He also leads several funded research projects, including JST PRESTO and CREST project, which is recognized as a significant early career contribution. He is currently a senior member of IEEE . Professional Experience April 2024 to present Dean and Exective Officer Institute of Systems and Information Engineering University of Tsukuba, Japan. April 2016 to present Professor Faculty of Engineering, Information and Systems University of Tsukuba, Japan. May 2012 - March 2016 Associate Professor Faculty of Engineering, Information and Systems University of Tsukuba, Japan. March 2005 - May 2012 Assistant Professor Graduate School of Systems and Information Engineering University of Tsukuba, Japan. April 2002 to March 2005Research Associate, Dept. of Applied Physics Waseda University, Tokyo, Japan October 2014 â presentJST CREST Principal Investigator ([Intelligent Information Processing] \"Social Imaging: Technologies for Supporting Creative Activities and Facilitating Social Interaction\") October 2011 - March 2015JST PRESTO Principal Investigator ([Information Environment and Humans] \"Social Playware for Supporting and Enhancing Social Interaction\") June 2009 - November 2009Visiting Researcher LPPA, Laboratory of Physiology of Perception and Action College de France, France April 2000 â March 2002Research Fellow for Young Researchers (DC1) Japan Society for the Promotion of Science October 1997 - January 1999Visiting Researcher Laboratory of Musical Information University of Genoa, Italy Education and Qualifications Obtained April 2000 to March 2003Doctor of Engineering Dept. of Pure and Applied Physics, Graduate School of Waseda University, Tokyo, Japan PhD Thesis \"A Study on Multimodal Human-Machine Communication\" Research supervisor: Professor Shuji Hashimoto at Department of Applied Physics April 1997 to March 2000Master of Engineering Graduate School of Waseda University, Tokyo, Japan April 1993 to March 1997 Bachelor of Science Department of Physics, Waseda University, Tokyo, Japan Faculty and Teaching Faculty:Dept. of Intelligent Interaction Technologies Faculty of Engineering, Information and Systems Research: Center for Cybernics Research Center for Artificial Intelligence Research Center for Innovative Medicine and Engineering Undergraduate:College of Engineering Systems Graduate Schoolï¼Dept. of Intelligent Interaction Technologies Graduate School of Systems and Information Engineering Ph.D. Program in Empowerment Informatics, School of Integrative and Global Majors Ph.D. Program in Humanics, School of Integrative and Global Majors Program in Kansei, Behavioral, and Brain Sciences, Graduate School of Comprehensive Human Sciences Links IEEE (Institute of Electrical and Electronics Engineers) IEEE RAS (Robotics and Automation Sociery) ACM (Association for Computing Machinery) Laboratory of Musical Information University of Genoa, Italy (Prof. Antonio Camurri) LPPA, Laboratory of Physiology of Perception and Action College de France, France (ï¼)Prof. Alain Berthoz) Center for Cybernics Research Ph.D. Program in Empowerment Informatics, Ph.D. Program in Humanics Center for Artificial Intelligence Research Center for Innovative Medicine and Engineering UTARC: Advanced Robotics and Cybernics JST START AI for Measuring Swallows JST CREST Social Imaging",
  "content_length": 5761,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:41"
}