{
  "name": "Kenli Li 0001",
  "homepage": "http://csee.hnu.edu.cn/people/likenli",
  "status": "success",
  "content": "李肯立-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 李肯立 我的位置在： 首页 > 学院概况 > 师资力量 > 李肯立 教师介绍 李肯立，湖南大学副校长，国家超级计算长沙中心主任，全国创新争先奖获得者，入选国家高层次人才计划，CCF会士，宝钢优秀教师，享受国务院政府特殊津贴。教育部高效能计算学科创新引智基地负责人、高性能计算应用软件技术教育部工程研究中心主任。国家超级计算创新联盟副理事长、新一代人工智能产业技术创新联盟专家委员会委员、高性能计算国家重点研发计划总体专家组成员、IEEE高级会员、CCF长沙主席、湖南省计算机学会副理事长、IEEE-TC/TSUSC/TII副编辑、《计算机研究与发展》编委。主持国家重点研发计划、国家重大科研仪器研制项目、基金委重点项目、JWKJW重点项目等国家和省部级项目40余项。以排名第一获国家科技进步二等奖2项、中国专利金奖1项、省部科技一等奖4项，获国家科技进步一等奖创新团队奖(排名13)。主要研究领域为高性能计算调度与应用，发表CCF推荐A类会议/期刊、IEEE/ACM汇刊论文200余篇。获授权专利和软件著作权共150余项。 中文名： 李肯立 英文名： 学历： 博士 职称： 教授 联系电话： 0731-88664161 电子邮件： lkl@hnu.edu.cn 研究方向： 高性能计算系统软件与应用 联系地址： 湖南省长沙市岳麓区湖南大学信息科学与工程学院（410082） 所属机构： 计算机科学系 学院教师 联系方式 CONTACT INFORMATIONl Email: lkl@hnu.edu.cn; lkl510@263.netl Office Tel: +86-0731-88664161l Fax: +86-0731-88664161l Mailing address and zip code: College of Information Science and Engineering, National  Supercomputing Center in Changsha, Hunan University, Changsha, Hunan Province, P. R. China, 410082 基本情况 NATIONALITYl People’s Republic of ChinaProfessional Titlel Ph.D.l Cheung Kong Professorl Doctoral SupervisorDUTYl Director of National Supercomputing Center in Changsha, Hunan, Changshal Dean of College of Information Science and Engineering in Hunan Universityl Senior Member of the IEEE, Senior Menber of the IEEE-TCDPl Deputy President of the Supercomputing Innovation Allicationl Distinguished Member of the China Computer Federation (CCF)l Member of the Technical Committee of High Performance Computing of the CCFl Executive Member of Mathematical Software Branch of China Software Industry Associationl Secretary-general of the Hunan Provincial Computer Federationl Vice Chair of Changsha Branch of the CCFl Chair of Young Computer Scientists and Engineers Forum (YOCSEF) of the CCF (2011-2012)RESEARCH INTERESTSl Parallel and Distributed Processingl Cloud Computing and Supercomputingl Big Data Managementl Artificial Intelligencel Scheduling Algorithmsl Biological Computingl Computer Simulationl Seismic Data Processing and VisualizationEDUCATIONl  Ph.D., Computer Software and Theory, Huazhong Universityof Science and Technology, China, November 2003WORK EXPERIENCEl Professor: July 2007-, College of Information Science and Engineering, Hunan University, P. R. Chinal Doctoral Supervisor: September 2008-, College of Information Science and Engineering, Hunan University, P. R. Chinal Visiting Scholar: July 2004-June 2005, University of Illinois at Champaign-Urbana, National Center for Supercomputer Applications, Champaign-Urbana, USAl Associate Professor: July 2004-June 2007, College of Computer and Communication, Hunan University, P. R. Chinal Lecturer: November 2003-June 2004, College of Computer and Communication, Hunan University, P. R. ChinaORGANIZING INTERNATIONAL CONFERENCE l Served as Program Chair of the 2019 High Performance Computing and Communications (HPCC 2019), Zhangjiajie, Chinal Served as Publication Chair of the 2016 12th International Conference on Natural Computation, Fuzzy Systems and Knowledge Discovery (ICNCFSKD 2016), Changsha, Chinal Served as General Chair of the 11th International Conference on Natural Computation (ICNC 2015)/the 12th International Conference on Fuzzy Systems and Knowledge Discovery (FSKD 2015), Zhangjiajie, China l Served as Program Chair of the 15th International Conference on Algorithms and Architectures for Parallel Processing (ICA3PP 2015), Zhangjiajie, Chinal Served as Publicity Chair of the 15th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGrid 2015), Shenzhen, Chinal Served as Vice Chair of the 25th International Conference on Parallel Computational Fluid  Dynamics (ParCFD 2013), Changsha, China l Served as Vice Chair of the National High Performance Computing Annual Conference (HPC-China 2012),   Zhangjiajie, Chinal Served as Chair of the 6th International Conference on Bio-Inspired Computing: Theories and   Applications (BIC-TA 2011), Changsha, Chinal Served as Member of Program Committee of ICPP 2014, NPC2015, PAAP 2014, PAAP 2013, etc.HONORS AND AWARDSl The Second Award of National Scientific and Technological Progress Award, the prime principal of this projectl The First Award of Technological Invention Award of Hunan Province, the prime principal of this projectl The First Award of Science and Technology Development of Hunan Province, the prime principal of this projectl The Second Award of Natural science of Hunan Province, the prime principal of this projectl The Second Award for Science & Technology Development/Achievement of the Ministry of Education, the prime principal of this projectl The Second Award of Teaching Achievement Award of Hunan Province, the prime principal of this projectRECENT PROFESSIONAL ACTIVITIESl The Principal Guest Editor of the special issue of IEEE Internet of Things Journal, 2019.10l The Principal Guest Editor of the special issue of Information Sciences, 2019.9l The Principal Guest Editor of the special issue of International Journal of Fuzzy Systems, 2018.10l The Principal Guest Editor of the special issue of  Neurocomputing, 2017.12l The Principal Guest Editor of the special issue of Journal of Computer and System Sciences, 2016.12l The Principal Guest Editor of the special issue of International Journal of Pattern Recognition and Artificial Intelligence, 2015.12l The Principal Guest Editor of the special issue of Concurrency and Computation-Practice & Experience, 2015.12l The Principal Guest Editor of the special issue of Elsevier journal of Computers and Fluids, 2014.12l The Principal Guest Editor of the special issue of Elsevier Procedia Engineering, 2013.5l The Principal Guest Editor of the special issue of Springer Communications in Computer and Information Science, 2012.11l Reviewers of more than 30 famous journals, including IEEE Trans. on Computers, IEEE Trans. on Parallel and Distributed Systems, IEEE Trans. on Nanobioscience, IEEE Trans. on Cloud Computing, IEEE Trans. on Emerging Topics in Computing, ACM Trans. on Embedded Computing Systems, Information Sciences, Journal of Parallel and Distributed Computing, The Journal of SuperComputing, Parallel Computing, Future Generation ComputerSystems, The Journal of Grid computing, Frontiers of Computer Science et al.SELECTED PUBLICATIONSPublished more than 300 technical papers in the above areas, including more than 80 top journals and conferences, such as IEEE-TC, IEEE-TPDS, IEEE-TSP, IEEE-TETC, IEEE-TCS, IEEE-TKDE, VLDBJ, AAAI, ICPP, ICDCS, CIKM, ICDM, etc., where more than 250 papers are cited by SCI-E and 50 papers are cited by EI or ISTP. 学生培养 COURSES TAUGHTl High Performance Computing and Cloud Computing (Ph.D students course)l Parallel Processing (Ph.D students course)l Introduction to the Theory of Computation (Master students course)l Design and Analysis of Computer Algorithms(Undergraduate students course)l Fundamentals of Compiling (Undergraduate students course)STUDENTS SUPERVISEDl Current Ph.D. students: 9    2019: 邹骁锋; 唐大海     2018: 李扬帆; 罗文晟    2017: 彭继武; 刘晓伟    2016: 汤超; 李昊    2014: 费雄伟l Graduated Ph.D. students: 24    2015: 李闯; 陈岑    2014: 肖国庆; 吴志强; NKUNZIMANA HILAIRE    2013: 阳王东; LE ANH DUC; 刘楚波; 潘果    2012: 周旭; 李大普; 叶钰; 梅晶; 王艳    2011: 郑伟华; 徐雨明; 余思洋; 刘静    2010: 张龙信; 童钊; 朱香元; Ahmed Salah Mohamed    2009: 唐小勇; 吴帆; Tung Khac Truong    2008: 石林   l Current M.Sc. students: 20 (2018: 9; 2017: 8; 2016: 3)l Graduated M.Sc. students: 72 (2015: 8; 2014: 9; 2013: 15; 2012: 5; 2011: 10; 2010: 5; 2009: 6; 2008: 7; 2007: 7)AWARDS OFSTUDENTS SUPERVISEDl In 2018, a PhD student was awarded Chancellor's Scholarship and two PhD students were awarded National Scholarshipl In 2017, two PhD student were awarded Chancellor's Scholarship and a PhD student was awarded National Scholarshipl In 2016, two PhD students were awarded Chancellor's Scholarship and two PhD students were awarded National Scholarshipl In 2015, two PhD students were awarded Chancellor's Scholarship and two PhD students were    awarded National Scholarshipl In 2014, a PhD student was awarded Chancellor's Scholarship, three PhD students and one master student were awarded National Scholarshipl In 2013, a PhD student was awarded Chancellor's Scholarship and four PhD students were   awarded National Scholarshipl In 2012, a PhD student was awarded National Scholarshipl In 2009, a master's thesis was evaluated as Model Master Thesis of Hunan Province 科研状况 RESEARCH FUNDINGS, PIl International (Regional) Cooperation and Exchange Program of National Natural Science Foundation of China (Grant NO.: 61860206011), Title: The Parallel Algorithm and Its Application for Artificial Intelligence Oriented Large-scaleTensor, 2019.1-2023.12l National Key R&D Program of China (Grant NO.: 2018YFB0203800), Title: Research on the Servitization Model and Architecture of High Performance Computing, 2018.6-2020.12l National Natural Science Foundation of China (Grant NO.: 61751204), Title: Heterogeneous Parallel Processing Methods and Platforms for Large-scale Multimodal Machine Learning, 2018.1-2020.12l National Distguinshed Youth Scholar Foundation of China (Grant NO.: 61625202), Title: High Efficient Computation, 2017.1-2021.12l National Natural Science Foundation of China (Grant NO.: 61472124 ), Title: Higher Order Sparse Matrix Vector Multiplication Scalable Heterogeneous Parallel Algorithm and Its Application in Electromagnetic Computation, 2015.1-2018.12l The State of International Science and Technology Cooperation Projects, Title: The Management of the Cloud System Based on Heterogeneous Supercomputer, 2015.1-2017.12l The Key Project of National Natural ScienceFoundation of China (Grant No.: 61133005), Title: Efficient Scheduling Theory and Methods of Large-scale Heterogeneous Parallel",
  "content_length": 28813,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:40"
}