{
  "name": "Kenneth R. Koedinger",
  "homepage": "http://pact.cs.cmu.edu/koedinger.html",
  "status": "success",
  "content": "Kenneth Koedinger Kenneth R. Koedinger koedinger@cmu.edu LearnLab Director METALS Program Director Professor, Human-Computer Interaction Institute and Psychology Hillman Professor of Computer Science and Human-Computer Interaction Contact: Carnegie Mellon University Office: 3601 Newell-Simon Hall Pittsburgh, PA 15213 412-268-7667 Home | Research Statement  | Publications | Curriculum Vitae | Microsoft Academic Search Biography KENNETH R. KOEDINGER is a professor of Human Computer Interaction and Psychology at Carnegie Mellon University. Dr. Koedinger has an M.S. in Computer Science, a Ph.D. in Cognitive Psychology, and experience teaching in an urban high school. His multidisciplinary background supports his research goals of understanding human learning and creating educational technologies that increase student achievement. His research has contributed new principles and techniques for the design of educational software and has produced basic cognitive science research results on the nature of student thinking and learning. Koedinger directs LearnLab (learnlab.org <http://learnlab.org>), which started with 10 years of National Science Foundation funding and is now the scientific arm of CMU’s Simon Initiative (cmu.edu/simon <http://cmu.edu/simon>). LearnLab builds on the past success of Cognitive Tutors, an approach to online personalized tutoring that is in use in thousands of schools and has been repeatedly demonstrated to increase student achievement, for example, doubling what algebra students learn in a school year. He was a co-founder of Carnegie Learning, Inc. (carnegielearning.com <http://carnegielearning.com>) that has brought Cognitive Tutor based courses to millions of students since it was formed in 1998, and leads LearnLab (see learnlab.org), now the scientific arm of CMU’s Simon Initiative (see cmu.edu/simon). Dr. Koedinger has authored over 250 peer-reviewed publications and has been a project investigator on over 45 grants. In 2017, he received the Hillman Professorship of Computer Science and in 2018, he was recognized as a fellow of Cognitive Science. Director of METALS: Masters in Educational Technology and Applied Learning Science More about METALS METALS (Masters of Educational Technology and Applied Learning Science) is a one-year, interdisciplinary masters program that trains graduate students to apply evidence-based research in learning to create effective instruction and educational technologies within formal and informal settings such as schools, workplaces and museums. The professional program culminates with a seven-month capstone project http://learnlab.org/metals/index.php/capstone-project/ for an external client. Guided by industry and faculty mentors in this team-based research and development project, students experience the end-to-end process of a product cycle from idea through prototyping. Return to the PACT Home Page",
  "content_length": 2906,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:48"
}