{
  "name": "Kenneth M. Anderson",
  "homepage": "http://www.cs.colorado.edu/~kena",
  "status": "success",
  "content": "Home | Kenneth M. Anderson | University of Colorado Boulder Skip to main content TranslateEnglishSpanishChineseFrenchGermanKoreanLaoNepaliJapaneseTibetanSearchEnter the terms you wish to search for.Other ways to search:Events CalendarCampus MapHomeKenneth M. AndersonProfessor and Chair, Department of Computer ScienceKen Anderson is Professor and Chair of the Department of Computer Science in the College of Engineering & Applied Science at the University of Colorado at Boulder. He is also the Co-Director of the Center for Software and Society and leads that Center's Big Data Initiative and he co-directs Project EPIC, a $4M NSF grant that investigates how members of the public make use of social media during times of mass emergency. Professor Anderson leads the design and implementation of a large-scale data collection and analytics system for that project.Professor Anderson joined the department in July 1998 and received tenure in 2005. He was Associate Chair of the Department from Spring 2010 to Summer 2013. He became an ATLAS Fellow in March 2010. During the 2011-2012 academic year, Dr. Anderson participated in CU's Excellence in Leadership Program and from Fall 2011 to Spring 2014, Dr. Anderson was a member of the College of Engineering and Applied Science's Faculty Leadership Advancement Group (FLAG).Prof. Anderson became Chair of the Department of Computer Science at CU Boulder in July 2019. As Chair, Prof. Anderson provides vision and leadership for the Department of Computer Science as well as coordination and support for department operations. He leads the Department's work on Justice, Equity, Diversity and Inclusion (JEDI) via multiple activities including the development of the department's diversity and inclusion statement, the creation of an NSF BPC (Broadening Participation in Computing) plan for the department, creating an Associate Chair for Inclusive Excellence position, and reviewing/updating department practices and culture. He created training for instructors and TAs for improving classroom culture. He oversaw the integration of the Technology, Cybersecurity, and Policy program into the department in Summer and Fall 2020 and led the process for allowing the department to offer a new Professional Masters program in Network Engineering for Fall 2021. He led the hiring of four new tenure-track faculty (3 assistant professors; 1 associate professor; 2 men and 2 women) and five new teaching faculty. Based on feedback, he moved the department to meeting more frequently and using department meetings to get feedback on issues facing the department from faculty and staff.From January 2016 to August 2019, Prof. Anderson was the Associate Dean for Education for the College of Engineering and Applied Science. During his tenure as Associate Dean, he and his team were responsible for the creation of the CEAS internship for credit program, the engineering math pilot, new options for H&SS courses for CEAS students, new pathways for transfer students, improvements to the CEAS pre-engineering program, a new model for undergraduate advising in the college, the reaccreditation of all CEAS accredited degree programs and initial accreditation for engineering plus, a rebooted orientation experience, known as Engineering Launch, that is already showing preliminary success in student retention and belonging, a new scholarship program, a campus-wide grade replacement policy, more flexible sessions for classes within a term, new academic standing policies, a new Change Your Major policy, and an early alert process that started in CEAS and has since spread to include many other units on campus. He also managed the the academic review process related to the creation of three Biomedical Engineering degrees (BS, MS, and PhD) ensuring that these programs passed review at college, campus, and system levels and presented these degrees to the Regent's University Affairs committee for approval before they were finally approved by the Regents in the Summer of 2019.Prof. Anderson was a participant in the first cohort of the NCWIT Pacesetters program, a program designed to recruit more women to the field of computer science and encourage them to pursue their careers in technology. As part of his Pacesetters efforts, Prof. Anderson led the charge to create a new Bachelor of Arts in Computer Science degree at CU from Summer 2010 to Spring 2013 that allows students in Arts and Sciences to earn a degree in computer science. This new degree program was first offered in Fall 2013 and had 240 students enroll during its first semester and now has nearly 600 majors less than two years later.Prof. Anderson also organizes and hosts the annual NCWIT Colorado Aspirations in Computing Award, something he did for eight years. This award recognizes the computing achievements of female high school students in Colorado and encourages them to enroll in computer science at the college level.Prof. Anderson received his Ph.D. in Computer Science in 1997 at the University of California, Irvine.In the distant past, Prof. Anderson played trombone for 15 years and now lives vicariously as a musician via his three children who are all learning piano and are now branching out to other instruments. In his copious spare time, Prof. Anderson loves to read science fiction and fantasy novels and, in the distant past, to teach his kids how to program. He also spends time with the community on Mastodon.Research InterestsProf. Anderson is broadly interested in the fields of software engineering, hypermedia, computer-supported cooperative work, and human-computer interaction. He is currently working on projects related to crisis informatics, software architecture, and the design and implementation of data-intensive software systems.Note: Prof. Anderson is NOT seeking new graduate students or students for summer internships due to the heavy service load associated with being the Chair of his department.Past ActivitiesDr. Anderson was PI or Co-PI on the following NSF and DARPA Grants:Hyperlocal and Hypertemporal Information in Mass Emergencies Events: Next Generation Crisis Informatics Data Collection & Analytics ($1.2M)The Future of Geospatial Data: The Analytics and Implications of Open Source Mapping ($500K)Mining and Understanding Bug Fixes to Address Application-Framework Protocol Defects ($1.6M) DARPA MUSE Program.Directions in Data Discovery (Data Cubed) in Undergraduate Education ($590K)Hazard Prediction and Communication Dynamics in the Modern Information Environment ($1.1M subcontract)Automating Reasoning in Interpreting Climate Records of the Past ($642K)Widescale Computer-Mediated Communication in Crisis Response: Roles, Trust & Accuracy in the Social Distribution of Information ($2.4M)Dr. Anderson has given talks on the intersection of software engineering, crisis informatics, and the management/analysis of large data sets:Using Cassandra to Support Crisis Informatics Research at the 2014 Cassandra Day in Denver. Video: YouTube. (October 2014)EPIC Analyze: Lessons Learned Analyzing Large Twitter Datasets in Support of Crisis Informatics Research at the Leeds Business Analytics Conference. (September 2014)Big Data Crisis Informatics: Challenges in Software Design, Data Modeling, and Analysis at Aarhus University. (June 2014)Supporting Disaster Reconnaissance with Social Media Data: A Design-Oriented Case Study of the 2013 Colorado Floods at ISCRAM 2014. (May 2014).Big Data & Disasters: How You Can Help at TedxCU. (April 2014)Big Data in Crisis Informatics: Project EPIC’s Analytics Infrastructure at the Leeds Business Analytics Meetup. (Nov. 2013)Dr. Anderson has been featured on Planet Cassandra. In that interview, he discusses how Project EPIC makes use of Cassandra to store social media data. Dr. Anderson was also recently interviewed by students looking at issues related to privacy concerns and Big Data.Office HoursBy appointment only. Quick Links DepartmentCollegeUniversityProject EPICHCC @ CUMastodon",
  "content_length": 8010,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:48"
}