{
  "name": "Kenny Q. Zhu",
  "homepage": "https://kenzhu2000.github.io",
  "status": "success",
  "content": "Kenny Q. Zhu's Home Page Kenny Q. Zhu (朱其立) Professor Dept. of Computer Science & Engineering University of Texas at Arlington Bio & Contact Publications (DBLP) (Google Scholar) Vita My Students (ACL Lab) Links Prospective graduate students: I am recruiting PhD and Masters students for the Spring/Fall 2026 admission. If you are curious, honest, independent and hardworking, and want to work on : Natural Language Processing, especially Animal Language Processing, please email your CV and transcripts to me! Prospective undergraduate students: Please check out our wonderful summer REU site research opportunity funded by National Science Foundation (NSF): Animal Language Processing and Understanding! News 10/3/2025: Our research is featured on UTA newspaper Shorthorn. 10/01/2025: Our canine vocalization research was featured on Dallas Morning News! 08/01/2025: Three of our papers on dog vocalization were accepted by ACM Multimedia 2025! Congrats to Hridayesh and Tuan! 07/31/2025: Our paper \"Toward Automatic Discovery of a Canine Phonetic Alphabet\" has won the ACL 2025 Outstanding Paper Award! It's one of the 26 papers that received this accolade. ACL 2025 published 3,400 papers. 05/15/2025: Two papers accepted by ACL 2025 main conference. Congrats to Theron and Minghao! 04/15/2025: ACL2 has just released a new canine vocalization understanding challenge as part of the IJCAI 2025 Competition Track. All are invited to participate! 02/25/2025: One full paper accepted by AAAI 2025, and three full papers accepted by NAACL 2025. 10/17/2024: Kenny Zhu was featured on an Atlantic magazine article about dog languages. 07/30/2024: Two papers accepted by EMNLP 2024 Findings. Congrats to Sinong, Xingyuan, Yvvonne and Haoan! 06/24/2024: Kenny Zhu appeared on CBS 11 Texas and ABC 8 (DFW) news to discuss his research on animal language processing and understanding. 05/12/2024: Kenny Zhu interviewed by UTA correspondent on the dog communications. 03/04/2024: One paper accepted by ICLR 2024. Congrats to Roy! Research My past work was focused on enabling machines to understand natural languages and further generate these languages, which is one of the most challenging tasks in artificial intelligence. My recent focus has been more interdisciplinary. At the heart of my research, I'm trying to answer the big science question: what's the relationship between intelligence and language? Specifically, i) is language (skill) a necessary part (or outcome) of intelligence? ii) can the use of a language or the lack of which affect the development of intelligence? To answer these questions, I have embarked on the following projects. Current Research Animal language processing and understanding (view demo) NLP for mental health Fusing structured knowledge with language models Good Research Advices How to write a good research paper. Simon Peyton Jones. Common errors in technical writing.. John Owens @ UC Davis and Kenny Zhu @ UTA. How to give a good research talk. Simon Peyton Jones. What's the right way to do scientific experiments. Amer Diwan @ PLDI 2012. My Students' Top Cited Papers (>50 cites) Ke Wu, Song Yang, Kenny Q. Zhu. False rumors detection on sina weibo by propagation structures. ICDE 2015. Citations Bill Y. Lin, Frank F. Xu, Zhiyi Luo, Kenny Q. Zhu. Multi-channel bilstm-crf model for emerging named entity recognition in social media. ACL NUT 2017. Citations Kangqi Luo, Fengli Lin, Xusheng Luo, Kenny Q. Zhu. Knowledge base question answering via encoding of complex query graphs. EMNLP 2018. Citations Kaiqi Zhao, Gao Cong, Quan Yuan, Kenny Q. Zhu. SAR: A sentiment-aspect-region model for user preference analysis in geo-tagged reviews. ICDE 2015. Citations Zhiyi Luo, Yuchen Sha, Kenny Q. Zhu, S Hwang, Z Wang. Commonsense causal reasoning between short texts. KR 2016. Citations Yuding Liang, Kenny Q. Zhu. Automatic generation of text descriptive comments for code blocks. AAAI 2018. Citations Yizhu Liu, Zhiyi Luo, Kenny Q. Zhu. Controlling length in abstractive summarization using a convolutional neural network. EMNLP 2018. Citations Xusheng Luo, Luxin Liu, Yonghua Yang, Le Bo, Yuanpeng Cao, Jinghang Wu, Qiang Li, Keping Yang, Kenny Q. Zhu. AliCoCo: Alibaba e-commerce cognitive concept net. SIGMOD 2020. Citations Zhiyi Luo, Shanshan Huang, Kenny Q. Zhu. Knowledge empowered prominent aspect extraction from product review. Information Processing & Management 56 (2). Citations Yu Gong, Yu Zhu, Lu Duan, Qingwen Liu, Ziyu Guan, Fei Sun, Wenwu Ou, and Kenny Q. Zhu. Exact-k recommendation via maximal clique optimization. SIGKDD 2019. Citations Zelin Zhou, Zhiling Zhang, Xuenan Xu, Zeye Xie, Mengyue Wu, Kenny Q. Zhu. Can Audio Captions Be Evaluated with Image Caption Metrics? ICASSP 2022. Citations Siyu Ren, Kenny Q. Zhu. Knowledge-driven distractor generation for cloze-style multiple choice questions. AAAI 2021. Citations Shansan Gong, Kenny Q Zhu. Positive, negative and neutral: Modeling implicit feedback in session-based news recommendation. SIGIR 2022. Citations Interesting Electronic Conference Proceedings AAAI IJCAI ACL/EMNLP/NAACL/COLING SIGMOD/PODS VLDB ICDE PLDI POPL CP Teaching CSE3302/5307 Programming Languages (2025 Fall) Lecture: MW 2:30PM-3:50PM Office Hour: Wed 4-5 PM Video of class on simply typed lambda calculus on Sept 26, 2016 CSE4392 Special Topics: Natural Language Processing (2025 Spring) Lecture: MW 2:30PM-3:50PM Office Hour: Wed 4-5 PM Useful Links News Portal World Major Indices z-lib Google Docs One Drive SJTU CS Webmail Princeton Webmail Princeton CS Webmail Princeton Library Catalog Singapore National Library ACM Conferece Listing / Guide2Research CS Conf Ranking/ Impact ratio Scorpus Search SCI Search EI Search LaTeX Online Help Math symbols DBLP Citeceer CRA Acad Keys ACM Career Chronicle Jobs.ac.uk This page was last modified on Sept 18, 2025",
  "content_length": 5849,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:50"
}