{
  "name": "Kenneth E. Jansen",
  "homepage": "https://experts.colorado.edu/display/fisid_147360",
  "status": "success",
  "content": "Jansen, Kenneth E | CU Experts | CU Boulder Close Contact Info Email Curriculum Vitae Publications in VIVO Co-author Network Map of Science Research Areas Aerodynamics Aeromechanics Aeronautical/Astronautical Engineering Artificial Intelligence/Cybernetics Biomechanics Biomedical Engineering Cardiovascular Diseases Cardiovascular System Computational Mechanics Flow Control Fluid Dynamics Mechanics Nuclear Engineering Respiratory System Turbulence Research research overview Dr. Jansen's teaching and research interests are focused on computational fluid dynamics. He specializes in massively parallel simulations using unstructured/adaptive grids. Applications include aerospace (with an emphasis on flow control and turbulence), cardiovascular flows, and two-phase flows. keywords computational fluid dynamics, flow control, aerodynamics, multiphase flows, cardiovascular flows, respiratory flows Publications selected publications chapter Finite element methods for turbulence. 189-234. 2023 Chapter 15 Extreme Scale Unstructured Adaptive CFD for Aerodynamic; Flow Control 2017 Numerical Study of Turbulent Pipe Flow with Transverse Magnetic Field Using a Spectral/Finite Element Solver. ERCOFTAC Series. 569-575. 2015 conference proceeding Modeling Thermochemical Nonequilibrium with the Continuous Galerkin Finite Element Flow Solver PHASTA 2024 Investigation of the Developing Jet from an Open Test Section Wind Tunnel 2024 Shock Stand-Off Distance and Development of a Supersonic Turbulent Boundary Layer: CFD Analysis of a Diamond-shaped 2D Fin 2023 Aerodynamic Response of Swept Wings in a Temporally and Spatially Varying Freestream 2023 Data-Driven Reynolds Stress Models using Model Derived Turbulence Variables 2023 Extension of the Smagorinsky Subgrid Stress Model to Anisotropic Filters 2023 Impact of Streamwise Gusts on the Aerodynamic Performance of a Finite-Span Wing 2022 Wall-modeled large eddy simulations of a turbulent boundary layer over the Boeing speed bump at ReL=2 million 2022 Obstruction Influence on Low-Speed, In-Situ Stratospheric Turbulence Measurements 2021 Optimal Clipping of the Gradient Model for Subgrid Stress Closure 2021 Unstructured LESDNS of a Turbulent Boundary Layer over a Gaussian Bump 2021 Wall temperature effect on hypersonic turbulent boundary layers via DNS 2021 Video: Supersonic turbulent boundary layer subject to strong concave and convex wall curvatures 2020 Modeling Strategies of Active Flow Control Applied to a Vertical Tail Assembly 2020 Wall-Modeled LES of Flow over a Gaussian Bump with Strong Pressure Gradients and Separation 2020 Generalized Non-Linear Eddy Viscosity Models for Data-Assisted Reynolds Stress Closure 2020 Hybrid Turbulence Model Computations of the NASA Juncture Flow Model Using PHASTA 2020 Reynolds number dependency in supersonic spatially-developing turbulent boundary layers 2020 Direct simulation of a Mach-5 turbulent spatially-developing boundary layer 2019 COMPRESSIBILITY EFFECT ON SPATIALLY-DEVELOPING TURBULENT BOUNDARY LAYERS VIA DNS 2019 PHASTA Science Gateway for High Performance Computational Fluid Dynamics. 1-4. 2018 A Comparison of RANS, URANS, and DDES for High Lift Systems from HiLiftPW-3 2018 An Evaluation of Multi-Fidelity Modeling Efficiency on a Parametric Study of NACA Airfoils 2017 Interaction of a Synthetic Jet Actuator on Separated flow over a Vertical Tail 2017 Investigation into the Performance of Turbulence Models for the Computation of High-Lift Flows at Large Angles of Attack 2017 Reduced-Basis Multifidelity Approach for Efficient Parametric Study of NACA Airfoils. AIAA Journal. 1481-1491. 2017 Active Flow Control in an Aggressive Transonic Diffuser. Bulletin of the American Physical Society. 2017 Adaptivity for Active Flow Control on a Vertical Tail Rudder Assembly 2017 An investigation into the reduction of log-layer mismatch in wall-modeled LES with a hybrid RANS/LES approach. Bulletin of the American Physical Society. 2017 Analyst-Guided Adaptive Simulation at Extreme Scale -- Beyond In Situ 2017 Compressibility effect on thermal coherent structures in spatially-developing turbulent boundary layers via DNS. Bulletin of the American Physical Society. 2017 Interaction of a Synthetic Jet Actuator with a Severely Separated Crossflow. Bulletin of the American Physical Society. 2017 Performance Analysis, Design Considerations, and Applications of Extreme-scale In Situ Infrastructures. 921-932. 2016 In-memory Integration of Existing Software Components for Parallel Adaptive Unstructured Mesh Workflows 2016 BOUNDARY LAYER ADAPTIVITY FOR INCOMPRESSIBLE TURBULENT FLOWS. 5439-5459. 2014 Parallel Adaptive Detached Eddy Simulations of the EUROLIFT DLR-F11 high lift configuration 2014 Anisotropic Boundary Layer Adaptivity of Multi-Element Wings 2014 Finite Element Flow Simulations of the EUROLIFT DLR-F11 High Lift Configuration 2014 Boundary Layer Adaptivity for Transonic Turbulent Flows 2013 Study of Incompressible MHD Flow in a Circular Pipe with Transverse Magnetic Field using a Spectral/Finite Element Solver 2013 Parallel Adaptive Boundary Layer Meshing for CFD Analysis. 437-455. 2013 EDNS of Stable Spatially-Developing Turbulent Thermal Boundary Layers under Weak Stratification. Springer Proceedings in Physics. 165-171. 2012 Electronic poster. 103-104. 2011 The ParaView Coprocessing Library: A scalable, general purpose in situ visualization library. 89-96. 2011 Low-Order Nonlinear Models for Active Flow Control of a Low L/D Inlet Duct. Proceedings of the ... American Control Conference. American Control Conference. 2989-2994. 2010 Interaction of a Finite-span Synthetic-jet and Cross-flow over a Swept Wing 2010 Scalable parallel I/O alternatives for massively parallel partitioned solver systems. 1-8. 2010 Scalable Implicit Finite Element Solver for Massively Parallel Processing with Demonstration to 160K cores 2009 Experimental and Numerical Investigation of Active Control of 3-D Flows 2009 PARALLEL ADAPTIVE COMPUTATION OF BLOOD FLOW IN A 3D \"WHOLE\" BODY MODEL. 1317-1318. 2009 Subdomain Communication to Increase Scalability in Large-Scale Scientific Applications. 497-498. 2009 A Multi-scale & Dynamic Method for Spatially Evolving Flows. ERCOFTAC Series. 219-+. 2009 Simulation of Flow Control in a Serpentine Duct 2009 NON-NEWTONIAN STUDY OF BLOOD FLOW IN A BIFURCATION WITH A STABILIZED FINITE ELEMENT METHOD. 323-324. 2008 Thermal boundary layers simulations under adverse pressure gradients. Springer Proceedings in Physics. 743-743. 2007 On coupling a lumped-parameter heart model with a three-dimensional finite element model of the aorta. 317-318. 2007 Simulation of blood flow and vessel deformation in three-dimensional, patient-specific models of the cardiovascular system using a novel method for fluid-solid interactions. 143-152. 2005 Inflow Generation Technique for Large Eddy Simulation Using Equilibrium Similarity Analysis 2005 Generation of turbulent inlet conditions for Velocity/Thermal boundary layer simulations. Springer Proceedings in Physics. 145-+. 2005 Investigation of turbulent melt flow in a crystal growth system. Proceedings of the International Conference on Parallel Processing Workshops. 214-221. 2004 An evaluation of the variational multiscale model for large-eddy simulation while using a hierarchical basis 2002 Integrated multiscale process simulation: Reactor scale to grain scale. 77-84. 2001 Effects of transpiration flow control on hovering rotor blades 1999 A comparison between Lighthill analogy and the method of Kirchhoff surfaces for aeroacoustic predictions in finite elements 1999 An adaptive solution procedure for rotorcraft aerodynamics 1998 STABILIZED FINITE ELEMENT METHODS IN FLUIDS - INSPIRATIONS, ORIGINS, STATUS AND RECENT DEVELOPMENTS. 272-292. 1994 CURRENT REFLECTIONS ON STABILIZED FINITE-ELEMENT METHODS FOR COMPUTATIONAL FLUID-MECHANICS. 44-63. 1993 journal article Unsteady Pressure Gradients in Wind Tunnels with Time-Varying Freestreams. AIAA Journal. 3185-3190. 2024 Aerodynamic Performance of a Finite-Span Wing in a Time-Varying Freestream. AIAA Journal. 2248-2263. 2024 A streamline coordinate analysis of a turbulent boundary layer subject to pressure gradients and curvature on the windward side of a bump. Journal of Fluid Mechanics. 2024 Invariant data-driven subgrid stress modeling on anisotropic grids for large eddy simulation. Computer Methods in Applied Mechanics and Engineering. 2024 Convergence of Phase-Averaged, Transitional Flow in an Abdominal Aortic Aneurysmal Model. Journal of Biomechanical Engineering. 2023 Optimal Clipping of Structural Subgrid Stress Closures for Large-Eddy Simulation. AIAA Journal. 6897-6909. 2022 Software tools to enable immersive simulation. Engineering with Computers. 4697-4713. 2022 Invariant data-driven subgrid stress modeling in the strain-rate eigenframe for large eddy simulation. Computer Methods in Applied Mechanics and Engineering. 2022 Bi-fidelity reduced polynomial chaos expansion for uncertainty quantification. Computational Mechanics. 405-424. 2022 S-frame discrepancy correction models for data-informed Reynolds stress closure. Journal of Computational Physics. 2022 Direct numerical simulation of a turbulent boundary layer over a bump with strong pressure gradients. Journal of Fluid Mechanics. 2021 Assessing and improving the accuracy of synthetic turbulence generation. Journal of Fluid Mechanics. 2021 Annular Flow Simulation Supported by Iterative In-Memory Mesh Adaptation. Nuclear Science and Engineering. 676-689. 2020 ON TRANSFER LEARNING OF NEURAL NETWORKS USING BI-FIDELITY DATA FOR UNCERTAINTY PROPAGATION. International Journal for Uncertainty Quantification. 543-573. 2020 Reduced Order Modeling of a Supersonic Flow Field. Journal of Propulsion and Power. 277-288. 2019 Interface Tracking Investigation of Geometric Effects on the Bubbly Flow in PWR Subchannels. Nuclear Science and Engineering. 46-62. 2019 In-memory integration of existing software components for p",
  "content_length": 24548,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:45"
}