{
  "name": "Kenneth Blair Kent",
  "homepage": "http://www.cs.unb.ca/~ken",
  "status": "success",
  "content": "Ken Kent's Homepage U n i v e r s i t y  o f  N e w  B r u n s w i c k F a c u l t y  o f  C o m p u t e r  S c i e n c e Kenneth B. Kent Professor & Barrett Chair in Entrepreneurship for Digital Transformation Director of IBM Centre for Advanced Studies - Atlantic Ph.D., M.Sc. (University of Victoria); B.Sc. (Memorial University of Newfoundland) Faculty of Computer Science University of New Brunswick 550 Windsor Street Fredericton, New Brunswick, Canada, E3B 5A3 Phone: (506) 451-6971 Fax: (506) 453-3566 ken@unb.ca RESEARCH: My research interests are in Hardware/Software Co-Design, Virtual Machines, Reconfigurable Computing, Software Engineering, and Embedded Systems. The Centre for Advanced Studies - Atlantic webpages provide a good look into some of the more specific research projects I am involved in at UNB. You can also look at the Institute for Visual Computing at Hochschule Bonn-Rhein-Sieg for some of the research projects I am involved with there. My current graduate students include: Alireza Azadi (PhD) Nicholas Dehnen (MCS - BRSU) Mohammad Mohammadi (PhD) Navid Jafarof (MCS) Geetesh More (PhD) Ritwik Sinha (MAS - BRSU) Subhabrata Rana (MCS) Danial Khadivi (MCS) Nancy Chahal (MCS) Shubham Verma (MCS) Harpreet Kaur (PhD) Hassan Arafat (PhD) Fatemeh Khoda Parast (PhD) Scott Young (PhD) Georgiy Krylov (PhD) Max Uzun (MCS) Mozammel Hossain (PhD) Graduate student alumni include: Maria Patrou (PhD) Sujit Bhandari (MCS) Siri Sahiti Ponangi (MCS) Alvee Noor (MCS) Seyed Alireza Damghani (MCS) Gabriel Adeyemo (MCS) Aaron Graham (MCS) Damian Dmonte (MCS) Zhouran Li (MCS) Anil Hitang (MCS) Tobias Niessen (MCS) Jean-Philippe Legault (MCS) Eric Coffin (MCS) Petar Jelenkovic (MCS) Kay Boldt (MCS and MCS - BRSU) Britta Sennewald (MCS and MCS - BRSU) Abhijit Taware (MCS) Konstantin Nasartchuk (PhD) Scott Young (MCS) Andrii Kuch (MCS) Jiapeng Zhu (MCS) Panagiotis Patros (PhD) Taees Eimouri (PhD) Maria Patrou (MCS) Johannes Ilisei (MCS) Bing Yang (PhD) Tristan Basa (MCS) Azden Bierbrauer (MCS and MAS - BRSU) Devarghya Bhattacharya (MCS) Federico Sogaro (MCS) Chandan Bagai (MCS) Umang Pandya (MCS) Yan Bo (MCS) Nicolas Neu (MCS and MCS - BRSU) Jingjing Li (MCS) Dayal Dilli (MCS) Ning Ju (MCS) Sen Wang (MCS) Chirag Sharawat (MCS) Andrew Somerville (MCS) Petr Samarin (MAS - BRSU) Emily Wilson (MCS) Marcel Dombrowski (MCS and MAS - BRSU) Konstantin Nasartchuk (MCS and MAS - BRSU) Nils Reichert (MCS and MCS - BRSU) Alexander Bochem (MCS and MAS - BRSU) Michael Schlosser (MCS and MCS - BRSU) John Cole (MCS) Tim Beatty (MCS) Farnaz Gharibian (MCS) Ryan Proudfoot (MCS) Shawn McGinn (MCS) Joseph Libby (MCS) Adam Baker (MCS) Beatriz Iaderoza (MSc - UVic) Nan Chen (MCS) Graham Mathias (MCS) Zhao Yong (MCS) Thomas Hall (MCS) Joshua Dick (MCS) Nathanial Couture (MCS) Hejun Ma (MSc - ECE) I try to keep a selection of my publications available on-line. TEACHING: I am teaching in 2021/2022 the following courses. Computer Science 6905 – Virtual Machines (fall term) Recent courses instructed: Computer Science 6999 – FPGA CAD Computer Science 2999 – Problem Solving for Programmers Computer Science 3413 – Operating Systems Computer Science 1023 – Data Structures and Algorithms for Engineers Computer Science 3997 – Professional Practice Computer Science 1203 – Introduction to Computer Science Computer Science 3813 – Computer Organization II Computer Science 2013 – Software Engineering I Computer Science 4405/6605 – Operating Systems II Computer Science 4805/6885 – Embedded Systems Software Engineering 265 – Software Engineering I (UVic) Software Engineering 365 – Software Engineering II (UVic) Computer Science 485A/556 – Hardware/Software Co-Design (UVic) PERSONAL: Everyone has a weakness and mine is classic cars. I have a 1968 Mustang that I have restored. Here are some pictures from when I drove it across the country – 3 times! In general I am the kind of guy who is always on the move. My other hobbies include bicycle camping and jogging. My latest biking adventures include 3 weeks cycling around the Greek Islands, a 700 km ride of the northern peninsula of Newfoundland, and a 1500 km ride of the maritimes.",
  "content_length": 4153,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:43"
}