{
  "name": "Kenneth M. Dawson-Howe",
  "homepage": "https://www.scss.tcd.ie/Kenneth.Dawson-Howe",
  "status": "success",
  "content": "Dr. Kenneth Dawson-Howe - Personnel - Department Details - Computer Science Department - Computer Science - Trinity College Dublin Skip to main content » Trinity College Dublin Search TCD TCD Home Faculties & Schools Courses Research Services Contact A – Z Computer Science Department > Department Details > Personnel > Dr. Kenneth Dawson-Howe Home Teaching CSU11011 Programming CSU44053 Vision Student Projects Previous Projects (from tcd.ie only) Sample Ethics (from tcd.ie only) Research Qualifications Contact points Personal Travel the world Banoffi Pie Dr. Kenneth Dawson-Howe I am a tenured lecturer (a title which is sometimes confusingly referred to as \"assistant professor\") in the School of Computer Science and Statistics in Trinity College Dublin. My research is in the area of Computer Vision and hence I am part of the Graphics, Vision, Augmented and Virtual Reality research area. Teaching Computer Vision/Vision Systems (CSU44053). This is an introduction to Computer Vision for final year. Read this extra information if you're thinking of taking this option. There is also a video intro to the module available. Details of the planned organisation of the module are already available for 2022-23 (See the page) and for students considering switching to the module, links to the first two weeks of (online) material will be provided (but you will need to attend the in-person classes). No further lectures will be made available outside of Blackboard - so you need to get the Teaching Unit to move you to this module if you want to continue. Introduction to Programming I (CSU11011). This is a one semester introductory module in imperative programming which is taught using Java. It looks at simple types, variables, I/O, loops, conditional statements, functions and arrays. Students are introduced to the use of Coding Standards and are expected to write code in a way which can be easily understood by others! Programming is something which can only be learnt by doing so students are expected to write multiple (simple) programs each week - and will be assessed based on their ability to solve a prorgramming problems on a machine in a supervised laboratory. Project Supervision I supervise (final year / year 5 / taught MSc) projects which have a computer vision component. To give you a feel for this type of project have a look at some previous projects (from tcd.ie domains only) that I have supervised. For further information regarding projects done under my supervisor (e.g. project meetings, stages of development, weighting for evaluation, etc.) see this page. If you want to talk about a project or suggest one in the area of computer vision my contact details are here. All of my project proposals are relevant to final year students, year 5 students (taking an integrated Masters programme) and taught M.Sc. students. My proposals will/should appear on the projects page once the release date has passed. Research & Publications Full publication listing (click here). My most significant publications are a textbook in computer vision, and two editions of a dictionary of computer vision terminology. My current research interests are primarily in the application of computer vision in cardio-pulmonary resuscitation (CPR). My previous areas of research have included Gambling, Surveillance, Medical Imaging (Analysis of Ultrasound Images), Robotic landmine detection, Assistive Robotics for the disabled, Attention in Active Vision, Image Compression, Teaching in Computer Science, Real-time tracking of hand pose for Virtual Reality, Industrial Inspection (Relay Contacts and Printed Circuit Boards), Landmine Detection in Infrared Images, Computer Vision (General), Camera Calibration, Object Recognition (using 3-D models), 3-D Model extraction from images. Qualifications M.A., Ph.D., Dip.Mgt. Contact points e-mail: Kenneth.Dawson-Howe @ tcd.ie (This is my preferred method of contact) Postal address: Dr. Kenneth Dawson-Howe, Department of Computer Science, Trinity College, Dublin 2, Ireland. Office location: Room G.12, O'Reilly Institute. Personal I thought a little personal stuff might make this page more interesting... Travel the world... A Banoffi recipe Kenneth.Dawson-Howe @ tcd.ie Trinity College Dublin, College Green, Dublin 2. Central Switchboard: +353 1 896 1000. Accessibility Privacy Disclaimer Contact",
  "content_length": 4360,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:48"
}