{
  "name": "Kentaro Shimizu",
  "homepage": "http://www.bi.a.u-tokyo.ac.jp/~shimizu/index_e.html",
  "status": "success",
  "content": "Kentaro Shimizu Japanese SHIMIZU, Kentaro Name Kentaro Shimizu, Doctor of Science Affiliation Professor, The Department of Biotechnology, Graduate School of Agricultural and Life Sciences, The Department of Computer Science, Graduate School of Information Science and Technology (concurrent post), and Applied Computer Science Course, Interfaculty Initiative in Information Studies and the Graduate School of Interdisciplinary Information Studies (concurrent post), The University of Tokyo. Genome and post-genome research has generated a huge amount of experimental data, and the way to extract useful information from the data is now critically important. For this purpose, analyses using information science techniques are essential. Our laboratory conducts research to understand biological phenomena using techniques in computer science. Our research covers a broad range of topics, one of which is prediction of protein structures. Protein structure prediction generally uses a known protein structure as a template. We have developed a de novo structure prediction method that can be used even in cases where such templates are not available. Based on the predicted structures, we now exert our research efforts to understand protein function through high-accuracy protein modeling under near in vivo conditions, by applying a molecular simulation taking into account the solvation effect. Functions of biomolecules are determined through interactions with other molecules. Our research includes prediction of the protein-ligand, protein-protein, and protein-nucleic acids interaction sites and development of a method for modeling the structures of these complexes. We developed a high-speed docking simulation method for complex structure modeling, and are now developing a method capable of dealing with structural changes during binding and a method for detailed analysis of interactions at the atomic level. Molecular simulation is an important means to analyze dynamic structures (dynamics) of biomolecules. In addition to the research described above, we conduct research to understand mechanisms of protein folding through protein folding simulation. We also work on dynamic analysis of chemical reactions where we compute free energy changes based on a large number of conformations obtained from molecular simulations and subsequently apply quantum chemical calculations. Since such research requires an enormous amount of computation, parallel computation algorithms, and basic software for high-performance computing are important. These are also major development topics for our laboratory: we developed a distributed shared array (DSA), a programming environment that allows efficient and flexible sharing of matrices and vectors on a huge virtual memory created on networked PCs. The environment is used in the PDB-REPRDB, a representative protein chains selection system, operated by the Computational Biology Research Center (CBRC), National Institute of Advanced Industrial Science and Technology. Machine learning techniques such as a support vector machine (SVM) provide important means to analyze genome and amino acid sequences of proteins. Our laboratory uses SVM to predict and evaluate protein structures, and predict interaction sites of proteins. We also conduct research on prediction of post-translational modification and localization of proteins by using SVM with learned protein sequence patterns, and cooperate with experiment-based research laboratories to improve prediction accuracy. Other research activities of our laboratory include analysis of DNA microarray data and metabolome analysis, which are conducted in collaboration with companies and other laboratories. In the areas of joint research and student guidance, we receive much help from faculty members of the Agricultural Bioinformatics Unit in our graduate school in particular. Our laboratory aims to contribute to the progress of agricultural and life sciences (Agri Bio) and to develop technologies unique to Agri Bio, working together with faculty members of the unit, and through cooperative research with researchers in the Agri Bio field in the research of food, environment, and various other areas. Our research is interdisciplinary that covers multiple areas such as bioinformatics, computational biophysics, and computational chemistry. We welcome people who are eager to meet the challenge of this new research area. Please feel free to visit us to take a tour of our laboratory if you are interested. Nougakubu 6-304 Phone +81-3-5841-5455, FAX +81-3-5841-8002 shimizu@bi.a.u-tokyo.ac.jp",
  "content_length": 4605,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:02"
}