{
  "name": "Kent Quanrud",
  "homepage": "https://www.kentquanrud.com",
  "status": "success",
  "content": "Kent QuanrudAssistant Professor, Theory GroupDept. of Computer Science, Purdue Universitykrq (at) purdue.eduLawson 1211My research is about the design and analysis of algorithms in theoretical computer science. I have worked on approximation algorithms, randomized algorithms, combinatorial optimization, continuous optimization, online learning, and discrete geometry. I am particularly interested in highly scalable algorithms for fundamental problems in optimization.TeachingRandomized algorithms: Fall 2025, Spring 2024, Fall 2022, Fall 2020, and Fall 2019 (with Petros Drineas)Undergraduate algorithms: Spring 2025 and Spring 2022Graduate algorithms: Spring 2024, Spring 2023, Spring 2021, and Spring 2020Advanced topics in (graph) algorithms: Fall 2021Course materials available at the links above.ResearchMy research is supported in part by NSF. See DBLP for a more up-to-date list.whatwherewith whoslides & moreQuotient sparsification for submodular functionsManuscript, Nov. 2022Dagstuhl, SimonsFaster exact and approximation algorithms for packing and covering matroids via push-relabelManuscript, July 2022 (1-ε)-approximate fully dynamic densest subgraph: linear space and faster update timeManuscript, July 2022Chandra Chekuri Convergence to Lexicographically Optimal Base in a (Contra)Polymatroid and Applications to Densest Subgraph and Tree PackingESA (Track S) 2023Chandra Chekuri and Elfarouk Harb Independent Sets in Elimination Graphs with a Submodular ObjectiveAPPROX 2023Chandra Chekuri Faster and Scalable Algorithms for Densest Subgraph and DecompositionNeuRIPS 2022Chandra Chekuri and Elfarouk Harb Densest Subgraph: Supermodularity, Iterative Peeling, and FlowSODA 2022Chandra Chekuri and Manuel Torres Algorithms for covering multiple submodular constraints and applicationsJournal of Combinatorial Optimization, 2022Chandra Chekuri, Tanmay Inamdar, Kasturi Varadarajan, and Zhao Zhang Minimum Cuts in Directed Graphs via Partial SparsificationFOCS 2021Ruoxu Cen, Jason Li, Danupon Nanongkai, Debmalya Panigrahi, and Thatchaphol Saranurak Faster Algorithms for Rooted Connectivity in Directed GraphsICALP 2021Chandra Chekuri Isolating Cuts, (Bi-)Submodularity, and Faster Algorithms for Global Connectivity ProblemsICALP 2021Chandra Chekuri Spectral Sparsification for Metrics and KernelsSODA 2021SODAFast Approximation Algorithms for Bounded Degree and Crossing Spanning Tree ProblemsAPPROX 2021Chandra Chekuri and Manuel Torres Online Directed Spanners and Steiner ForestsAPPROX 2021Elena Grigorescu and Young-San Lin Circle Packing of Planar Graphs in Nearly Linear TimeSODA 2020Sally Dong and Yin Tat Lee Fast LP-based Approximations for Geometric Packing and Covering ProblemsSODA 2020Chandra Chekuri and Sariel Har-Peled Nearly linear time approximations for mixed packing and covering problems without data structures or randomizationSOSA@SODA 2020SOSAℓ1‑Sparsity Approximation Bounds for Packing Integer Programs.Math Program. 2020, IPCO 2019Chandra Chekuri and Manuel R. Torres Fast and Deterministic Approximations for k‑cutAPPROX 2019APPROXParallelizing Greedy for Submodular Set Function Maximization in Matroids and BeyondSTOC 2019Chandra ChekuriBellairs, MSR, Purdue, NWUApproximating Optimal Transport with Linear ProgramsSOSA 2019SOSALP Relaxation and Tree Packings for Minimum k‑cutSOSA 2019Chandra Chekuri and Chao Xu On Approximating (Sparse) Covering Integer ProgramsSODA 2019Chandra ChekuriSODASubmodular Function Maximization in Parallel via the Multilinear RelaxationSODA 2019Chandra ChekuriBellairs, MSR, Purdue, NWU, SODA, AllertonFast Approximations for Metric‑TSP via Linear ProgrammingarXiv 2018Chandra ChekuriBIRS (video, slides), ISMP, UIUCRandomized MWU for Positive LPsSODA 2018Chandra ChekuriSODAApproximation Algorithms for Polynomial Expansion and Low‑Density GraphsSIAM J. Comput. (SICOMP) 2017ESA 2015Sariel Har-PeledUIUC, add'l notesApproximating the Held‑Karp Bound for Metric TSP in Nearly Linear TimeFOCS 2017Invited to HALG 2018Chandra ChekuriBIRS (video, slides), ISMP, FOCS (video, slides)Near‑Linear‑Time Approximation Schemes for some Implicit Fractional Packing ProblemsSODA 2017Chandra ChekuriSODA, BellairsA Fast Approximation for Maximum Weight Matroid IntersectionSODA 2016Chandra ChekuriSODA, UIUCStreaming Algorithms for Submodular Function MaximizationICALP 2015Chandra Chekuri and Shalmoli GuptaBonn (video, slides)Online Learning with Adversarial DelaysNIPS 2015Daniel KhashabiNIPSQuotient sparsification for submodular functionsManuscript, Nov. 2022slides: Dagstuhl, SimonsFaster exact and approximation algorithms for packing and covering matroids via push-relabelManuscript, July 2022(1-ε)-approximate fully dynamic densest subgraph: linear space and faster update timeManuscript, July 2022with Chandra ChekuriConvergence to Lexicographically Optimal Base in a (Contra)Polymatroid and Applications to Densest Subgraph and Tree PackingESA (Track S) 2023with Chandra Chekuri and Elfarouk HarbIndependent Sets in Elimination Graphs with a Submodular ObjectiveAPPROX 2023with Chandra ChekuriFaster and Scalable Algorithms for Densest Subgraph and DecompositionNeuRIPS 2022with Chandra Chekuri and Elfarouk HarbDensest Subgraph: Supermodularity, Iterative Peeling, and FlowSODA 2022with Chandra Chekuri and Manuel TorresAlgorithms for covering multiple submodular constraints and applicationsJournal of Combinatorial Optimization, 2022with Chandra Chekuri, Tanmay Inamdar, Kasturi Varadarajan, and Zhao ZhangMinimum Cuts in Directed Graphs via Partial SparsificationFOCS 2021with Ruoxu Cen, Jason Li, Danupon Nanongkai, Debmalya Panigrahi, and Thatchaphol SaranurakFaster Algorithms for Rooted Connectivity in Directed GraphsICALP 2021with Chandra ChekuriIsolating Cuts, (Bi-)Submodularity, and Faster Algorithms for Global Connectivity ProblemsICALP 2021with Chandra ChekuriSpectral Sparsification for Metrics and KernelsSODA 2021slides: SODAFast Approximation Algorithms for Bounded Degree and Crossing Spanning Tree ProblemsAPPROX 2021with Chandra Chekuri and Manuel TorresOnline Directed Spanners and Steiner ForestsAPPROX 2021with Elena Grigorescu and Young-San LinCircle Packing of Planar Graphs in Nearly Linear TimeSODA 2020with Sally Dong and Yin Tat LeeFast LP-based Approximations for Geometric Packing and Covering ProblemsSODA 2020with Chandra Chekuri and Sariel Har-PeledNearly linear time approximations for mixed packing and covering problems without data structures or randomizationSOSA@SODA 2020slides: SOSAℓ1‑Sparsity Approximation Bounds for Packing Integer Programs.Math Program. 2020, IPCO 2019with Chandra Chekuri and Manuel R. TorresFast and Deterministic Approximations for k‑cutAPPROX 2019slides: APPROXParallelizing Greedy for Submodular Set Function Maximization in Matroids and BeyondSTOC 2019with Chandra Chekurislides: Bellairs, MSR, Purdue, NWUApproximating Optimal Transport with Linear ProgramsSOSA 2019slides: SOSALP Relaxation and Tree Packings for Minimum k‑cutSOSA 2019with Chandra Chekuri and Chao XuOn Approximating (Sparse) Covering Integer ProgramsSODA 2019with Chandra Chekurislides: SODASubmodular Function Maximization in Parallel via the Multilinear RelaxationSODA 2019with Chandra Chekurislides: Bellairs, MSR, Purdue, NWU, SODA, AllertonFast Approximations for Metric‑TSP via Linear ProgrammingarXiv 2018with Chandra Chekurislides: BIRS (video, slides), ISMP, UIUCRandomized MWU for Positive LPsSODA 2018with Chandra Chekurislides: SODAApproximation Algorithms for Polynomial Expansion and Low‑Density GraphsSIAM J. Comput. (SICOMP) 2017ESA 2015with Sariel Har-Peledslides: UIUC, add'l notesApproximating the Held‑Karp Bound for Metric TSP in Nearly Linear TimeFOCS 2017Invited to HALG 2018with Chandra Chekurislides: BIRS (video, slides), ISMP, FOCS (video, slides)Near‑Linear‑Time Approximation Schemes for some Implicit Fractional Packing ProblemsSODA 2017with Chandra Chekurislides: SODA, BellairsA Fast Approximation for Maximum Weight Matroid IntersectionSODA 2016with Chandra Chekurislides: SODA, UIUCStreaming Algorithms for Submodular Function MaximizationICALP 2015with Chandra Chekuri and Shalmoli Guptaslides: Bonn (video, slides)Online Learning with Adversarial DelaysNIPS 2015with Daniel Khashabislides: NIPS",
  "content_length": 8251,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:53"
}