{
  "name": "Keqin Li 0001",
  "homepage": "http://csee.hnu.edu.cn/people/likeqin",
  "status": "success",
  "content": "李克勤-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 李克勤 我的位置在： 首页 > 学院概况 > 师资力量 > 李克勤 教师介绍 中文名： 李克勤 英文名： 学历： 职称： 教授 联系电话： 电子邮件： likq@hnu.edu.cn 研究方向： 云计算、雾计算和移动边缘计算、高能效计算和通信、物联网和信息物理系统、异构计算系统、大数据计算、高性能计算、CPU-GPU混合协同计算、计算机系统结构、计算机网络、机器学习、智能计算 联系地址： 湖南省长沙市岳麓区麓山南路2号,湖南大学信息科学与工程学院（410082） 所属机构： 计算机科学系 学院教师 个人简介 李克勤，IEEE Fellow、湖南大学信息科学与工程学院教授（岳麓学者领军岗）、博士生导师、院学术委员会主席、超级计算与云计算研究所所长。目前研究课题集中在云计算、雾计算和移动边缘计算、高能效计算和通信、物联网和信息物理系统、异构计算系统、大数据计算、高性能计算、CPU-GPU混合协同计算、计算机系统结构、计算机网络、机器学习、智能计算等。在学术著作、研究期刊、和国际会议上共发表论文660篇以上（其中IEEE/ACM Transactions/Journals论文超过170篇，SCI期刊论文超过410篇）。他与人合著的最新学术著作Scheduling Parallel Applications on Heterogeneous Distributed Systems（异构分布式系统中的并行应用调度）由国际顶尖的斯普林格（Springer）学术出版社于2019年出版。他曾多次荣获国际学术会议最佳论文奖。他多次担任国际学术会议主席，并且担任2017年召开的第7届IEEE国际云计算和服务计算年会和2019年召开的第21届IEEE高性能计算和通信会议的主席。他主持国家自然科学基金委员会的重点项目“面向激光聚变模拟的大规模异构众核系统可扩展并行算法与优化方法”；主持国家自然科学基金委和新加坡国家研究基金会数据科学合作研究项目“面向列车故障检测的深度学习模型及其异构并行处理技术”；承担科技部863重大项目“高性能计算环境应用服务优化关键技术”和“基于内存计算的并行处理系统研究与开发”；并且主持科技部国家重点研发计划“面向异构体系结构的高性能分布式数据处理技术与系统” 的子项目“面向大数据集的数据流编程模型及高通量视频示范应用”；同时在“大规模异构并行系统的高效能调度理论与方法”领域带领湖南省自然科学基金创新研究群体。他是IEEE Transactions on Parallel and Distributed Systems, IEEE Transactions on Computers, IEEE Transactions on Cloud Computing, IEEE Transactions on Services Computing, IEEE Transactions on Sustainable Computing等著名和顶级学术刊物的编委。 近几年的期刊文章及学术著作（2011-至今） 1.K. Li, \"New divisible load distribution methods using pipelined communication techniques on tree and pyramid networks,\" IEEE Transactions on Aerospace and Electronic Systems, vol. 47, no. 2, pp. 806-819, April 2011. 2.K. Li, \"Cost analysis and minimization of movement-based location management schemes in wireless communication networks: a renewal process approach,\" Wireless Networks, vol. 17, no. 4, pp. 1031-1053, 2011. 3.K. Li, \"Downlink data transmission scheduling algorithms in wireless networks,\" Simulation Modelling Practice and Theory, vol. 19, pp. 1427-1444, 2011. 4.K. Li, \"Algorithms and analysis of energy-efficient scheduling of parallel tasks,\" Handbook of Energy-Aware and Green Computing, Vol. 1 (Chapter 15), I. Ahmad and S. Ranka, eds., pp. 331-360, CRC Press/Taylor & Francis Group, 2012. 5.K. Li, \"Optimal power allocation among multiple heterogeneous servers in a data center,\" Sustainable Computing: Informatics and Systems, vol. 2, pp. 13-22, 2012. 6.K. Li, \"Energy efficient scheduling of parallel tasks on multiprocessor computers,\" Journal of Supercomputing (Special Issue on Energy-Efficient High-Performance Parallel and Distributed Computing), vol. 60, no. 2, pp. 223-247, 2012. 7.K. Li, \"Performance analysis and evaluation of random walk algorithms on wireless networks,\" International Journal of Foundations of Computer Science (Special Issue on Advances in Parallel and Distributed Computational Models), vol. 23, no. 4, pp. 779-802, June 2012. 8.K. Li and J. Li, \"Optimal energy allocation in heterogeneous wireless sensor networks for lifetime maximization,\" Journal of Parallel and Distributed Computing, vol. 72, no. 7, pp. 902-916, July 2012. 9.K. Li, \"Optimal configuration of a multicore server processor for managing the power and performance tradeoff,\" Journal of Supercomputing (Special Issue on Enabling Technologies for Programming Extreme Scale Systems), vol. 61, no. 1, pp. 189-214, 2012. 10.K. Li, \"Power allocation and task scheduling on multiprocessor computers with energy and time constraints,\" Energy-Efficient Distributed Computing Systems, A. Y. Zomaya and Y. C. Lee, eds., Chapter 1, pp. 1-37, John Wiley & Sons, 2012. 11.K. Li, \"Probing high-capacity peers to reduce download times in P2P file sharing systems with stochastic service capacities,\" International Journal of Foundations of Computer Science, vol. 23, no. 6, pp. 1341-1369, 2012. 12.K. Li, \"Scheduling precedence constrained tasks with reduced processor energy on multiprocessor computers,\" IEEE Transactions on Computers (special issue on energy efficient computing), vol. 61, no. 12, pp. 1668-1681, December 2012. (This is the only paper accepted with minor revision among 44 submissions with acceptance ratio 18%.) 13.K. Li, \"Cost optimization for scalable communication in wireless networks with movement-based location management,\" Scalable Computing and Communications: Theory and Practice, S. U. Khan, A. Y. Zomaya, and L. Wang, eds., Chapter 10, pp. 185-208, John Wiley & Sons, 2013. 14.K. Li, \"Analysis of distance-based location management in wireless communication networks,\" IEEE Transactions on Parallel and Distributed Systems, vol. 24, no. 2, pp. 225-238, February 2013. 15.K. Li, \"Optimal load distribution for multiple heterogeneous blade servers in a cloud computing environment,\" Journal of Grid Computing, vol. 11, no. 1, pp. 27-46, 2013. 16.J. Cao, K. Hwang, K. Li, and A. Zomaya, \"Optimal multiserver configuration for profit maximization in cloud computing,\" IEEE Transactions on Parallel and Distributed Systems (special issue on cloud computing), vol. 24, no. 6, pp. 1087-1096, June 2013. (This is the spotlight paper of the issue selected from over 100 submissions with acceptance ratio less than 19%. It is highlighted on the journal home page and available to the public for free for 30 days.) 17.Luna Mingyi Zhang, Keqin Li, Dan Chia-Tien Lo, and Yanqing Zhang, \"Energy-efficient task scheduling algorithms on heterogeneous computers with continuous and discrete speeds,\" Sustainable Computing: Informatics and Systems, vol. 3, no. 2, pp. 109-118, June 2013. 18.Xingwei Wang, Hui Cheng, Keqin Li, Jie Li, and Jiajia Sun, \"A cross-layer optimization based integrated routing and grooming algorithm for green multi-granularity transport networks,\" Journal of Parallel and Distributed Computing, vol. 73, no. 6, pp. 807-822, June 2013. 19.Kashif Bilal, Marc Manzano, Samee U. Khan, Eusebi Calle, Keqin Li, and Albert Y. Zomaya, \"On the characterization of the structural robustness of data center networks,\" IEEE Transactions on Cloud Computing, vol. 1, no. 1, pp. 64-77, January-June 2013. (This is the inaugural issue.) 20.Yuanping Mu, Keqiu Li, Keqin Li, and Geyong Min, \"Exchanged crossed cube: a novel interconnection network for parallel computation,\" IEEE Transactions on Parallel and Distributed Systems, vol. 24, no. 11, pp. 2211-2219, November 2013. 21.Guangyan Zhang, Weimin Zheng, and Keqin Li, \"Design and evaluation of a new approach to RAID-0 scaling,\" ACM Transactions on Storage, vol. 9, no. 4, Article 11, November 2013. 22.K. Li, \"Optimal number of annuli for maximizing the lifetime of sensor networks,\" Journal of Parallel and Distributed Computing, vol. 74, no. 1, pp. 1719-1729, January 2014. 23.Xiangyuan Zhu, Kenli Li, Ahmad Salah, and Keqin Li, \"Cluster-distribute-align-merge: a general algorithm to speed up multiple sequence alignment on multi-core computers,\" Journal of Computational and Theoretical Nanoscience, vol. 11, pp. 1-7, 2014. 24.J. Cao, K. Li, and I. Stojmenovic, \"Optimal power allocation and load distribution for multiple heterogeneous multicore server processors across clouds and data centers,\" IEEE Transactions on Computers (special issue on cloud of clouds), vol. 63, no. 1, pp. 45-58, January 2014. 25.K. Li, \"Analysis of cost and quality of service of time-based dynamic mobility management in wireless networks,\" Wireless Networks, vol. 20, no. 2, pp. 261-288, February 2014. 26.Weihua Zheng, Kenli Li, and Keqin Li, \"A fast algorithm based on SRFFT for length N=q×2m DFTs,\" IEEE Transactions on Circuits and Systems II, vol. 61, no. 2, February 2014. 27.K. Li, \"On the expected file download time of the random time-based switching algorithm in P2P networks,\" Peer-to-Peer Networking and Applications, vol. 7, no. 2, pp. 147-158, June 2014. 28.Yuxin Wan, Junwei Cao, Kang He, Huaying Zhang, Peng Yu, Senjing Yao, and Keqin Li, \"Node placement analysis for overlay networks in IoT applications,\" International Journal of Distributed Sensor Networks, vol. 2014, Article ID 427496, 12 pages, 2014. 29.Y. Yuan, Y. Wu, W. Zheng, and K. Li, \"Guarantee strict fairness and utilize prediction better in parallel job scheduling,\" IEEE Transactions on Parallel and Distributed Systems, 2014, in press. 30.G. Zhang, W. Zheng, and K. Li, \"Rethinking RAID-5 data layout for better scalability,\" IEEE Transactions on Computers, 2014, in press. 31.X. Zhao, Y. Zhang, Y. Wu, K. Chen, J. Jiang, and K. Li, \"Liquid: a scalable deduplication file system for virtual machine images,\" IEEE Transactions on Parallel and Distributed Systems, 2014, in press. 32.J. Mei, Kenli Li, and Keqin Li, \"Energy-aware task scheduling in heterogeneous computing environments,\" Cluster Computing, 2014, in press. 33.Fan Zhang, Junwei Cao, Keqin Li, Samee U. Khan, and Kai Hwang, \"Multi-objective scheduling of many tasks in cloud platforms,\" Future Generation Computer Systems (special issue on Advances in Data-Intensive Modelling and Simulation (ADIMS)), 2014, in press. 34.Yuan Tian, Chuang Lin, and Keqin Li, \"Managing performance and power consumption tradeoff for multiple heterogeneous servers in cloud computing,\" Cluster Computing, 2014, in press. 35.Xiaoyong Tang, Kenli Li, Bharadwaj Veeravalli, and Keqin Li, \"Scheduling precedence constrained stochastic tasks on heterogeneous cluster systems,\" IEEE Transactions on Computers, 2014, in press. 36.Guangyan Zhang, Keqin Li, Jingzhe Wang, and Weimin Zheng, \"Accelerate RDP RAID-6 scaling by reducing disk I/Os and XOR operations,\" IEEE Transactions on Computers, 2014, in press. 37.Kenli Li, Xiaoyong Tang, and Keqin Li, \"Energy-efficient stochastic task scheduling on heterogeneous computing systems,\" IEEE Transactions on Parallel and Distributed Systems, 2014, in press. 38.Lanjun Wan, Kenli Li, Jing Liu, and Keqin Li, \"GPU implementation of a parallel two-list algorithm fo",
  "content_length": 12925,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:53"
}