{
  "name": "Keren Fu",
  "homepage": "http://www.kerenfu.top",
  "status": "success",
  "content": "Welcome to Keren Fu's homepage >Home Home About Publication Projects Teaching Alumni Contact Google scholar Welcome! - My name is Keren Fu (傅可人) and I'm a research associate professor (副研究员) and PhD supervisor (博士生导师) with the College of Computer Science (Link to Biometrics Research Laboratory), Sichuan Univerisity, Chengdu, China. (News: 现招收2026年入学的硕士生和博士生，欢迎报考304（计算机学院）和604（图像所）的同学联系我！) - I received my dual Ph.D. degrees from both Shanghai Jiao Tong University and Chalmers University of Technology, Sweden, in 2016, and joined Sichuan University in 2017. - My current interests mainly focus on visual computing, saliency analyses [online demo], stereo vision, and machine learning. News: 2025-11: I am invited to serve as a reviewer for CVPR 2026! 2025-11: One paper is accepted by AAAI 2026! 2025-4: One paper is accepted by IEEE TIP! 2025-4: Our Samba work is selected as Highlight in CVPR 2025![Link] 2025-2: Two papers are accepted to CVPR 2025! 2025-2: I am invited to serve as a reviewer for ICCV 2025! 2024-12: Two papers are accepted to ICASSP 2025! 2024-11: I am invited to serve as a reviewer for CVPR 2025! 2024-11: Two papers are accepted by IEEE TIP! 2024-7: One paper is accepted to ECCV 2024! 2024-6: Four papers are accepted to PRCV 2024! 2024-5: One paper is accepted by Visual Intelligence![Arxiv] 2024-4: Our paper on video object segmentation has received Honorable Mention Award in CVMJ! Congrats to Ge-Peng and all co-authors![Link] 2024-2: One paper is accepted by IEEE Signal Processing Letters![Link] 2024-1: I am invited to serve as a reviewer for ECCV 2024! 2024-1: One paper is accepted by Image and Vision Computing![Link] 2023-12: We conduct a preliminary work to promote segmentation accuracy of SAM![Arxiv][Link] 2023-12: I am invited to serve as a PC member for IJCAI 2024! 2023-10: We have released a pioneer work for RGB-D Video Salient Object Detection![Link] 2023-10: I am invited to serve as a reviewer for CVPR 2024! 2023-10: I am acknowledged as Outstanding Reviewer at ICCV 2023![Link] 2023-8: One paper on dynmaic facial expression recognition is accepted by PRCV-2023! 2023-6: Congratulations to three my master students, Yao Jiang, Yukang Lu, and Dingyao Min, for receiving Outstanding Master Thesis Awards from the College! 2023-2: I am invited to serve as a reviewer for ICCV 2023! 2022-12: I am invited to serve as a PC member for IJCAI 2023! 2022-10: I am invited to serve as a reviewer for CVPR 2023! 2022-9: One paper on few-shot learning-based RGB-D SOD is accepted by Neurocomputing! 2022-8: One paper is accepted by IEEE TNNLS![Link] 2022-8: One paper is accepted by Computerized Medical Imaging and Graphics! 2022-8: One paper is accepted by IEEE TMM! 2022-7: One paper is accepted by IEEE Signal Processing Letters! 2022-6: We release a Demo website for our previous RGB-D SOD paper published on ACMMM-2021! Try it yourself!![Online demo] 2022-3: One paper is accepted by Neurocomputing! 2021-10: One paper is accepted by Pattern Recognition![Link] 2021-10: One paper is accepted by Computational Visual Media (CVMJ)![Link] 2021-10: Congratulations to my master student Wenbo Zhang for acceptance of National Scholarship! 2021-10: One paper is accepted by Computational Visual Media (CVMJ)![Link] 2021-7: One paper is accepted by ICCV-2021![Link] 2021-7: I will serve as a TPC member for IJCAI-2022! 2021-7: One paper is accepted by ACMMM-2021![Link][Online demo] 2021-7: One paper is accepted by Neurocomputing! 2021-4: One paper is accepted by IEEE TII! 2021-4: One paper is accepted by IEEE TPAMI! 2021-4: One paper is accepted by Neurocomputing! 2021-3: One paper is accepted by ICME-2021! 2021-1: One Neurocomputing paper accepted! 2020-12: One paper is accepted by AAAI-2021![Link] 2020-11: We have released a Review and Benchmark for Light Field Salient Object Detection![Link] 2020-11: I was invited as a SPC member for IJCAI-2021! 2020-10: One Pattern Recognition paper accepted! 2020-10: I serve as a TPC member for IJCAI-2021! 2020-9: I serve as a TPC member for AAAI-2021! 2020-8: One Image and Vision Computing paper accepted! 2020-6: One IEEE SPL paper accepted! 2020-5: One Neurocomputing paper accepted! 2020-4: One IEEE TMM paper accepted! 2020-4: One Neurocomputing paper accepted! 2020-2: One paper on RGB-D SOD is accepted by CVPR-2020![Link] About me I received the B.S. degree from Huazhong University of Science and Technology, Wuhan, China, in 2011, and dual Ph.D. degrees from Shanghai Jiao Tong University, Shanghai, China, and Chalmers University of Technology, Gothenburg, Sweden, in 2016, under the joint supervision of Prof. Jie Yang and Prof. Irene Yu-Hua Gu. I am currently a research associated professor with College of Computer Science, Sichuan University, Chengdu, China. My current research interests include visual computing, saliency analysis, and machine learning. My study and work Publication Journal papers - Xin Zhang, Keren Fu*, Qijun Zhao. Dynamic patch-aware enrichment transformer for occluded person re-identification, Knowledge-Based Systems, 327: 114193, 2025. [Github] - Xin Zhang, Tao Xiao, Ge-Peng Ji, Xuan Wu, Keren Fu*, Qijun Zhao. Explicit Motion Handling and Interactive Prompting for Video Camouflaged Object Detection , IEEE Transactions on Image Processing, 34: 2853-2866, 2025. [Github] - Yao Jiang, Xin Li, Keren Fu*, Qijun Zhao. Transformer-based Light Field Salient Object Detection and Its Application to Autofocus, IEEE Transactions on Image Processing, 33: 6647-6659, 2024. [Github] - Ao Mou, Yukang Lu, Jiahao He, Dingyao Min, Keren Fu*, Qijun Zhao. Salient Object Detection in RGB-D Videos, IEEE Transactions on Image Processing, 33: 6660-6675, 2024. [Github] - Yao Jiang, Xinyu Yan, Ge-Peng Ji, Keren Fu*, Meijun Sun, Huan Xiong*, Deng-Ping Fan, Fahad Shahbaz Khan. Effectiveness Assessment of Recent Large Vision-Language Models, Visual Intelligence (VI), 2(17), 2024. [Arxiv] - Bo Yuan, Yao Jiang, Keren Fu*, Qijun Zhao. Parallax-aware Network for Light Field Salient Object Detection, IEEE Signal Processing Letters, 31: 810-814, 2024. [Github] - Chengcheng Lu, Yiben Jiang, Keren Fu*, Qijun Zhao, Hongyu Yang. LSTPNet: Long short-term perception network for dynamic facial expression recognition in the wild, Image and Vision Computing, 142: 104915, 2024. [Github] - Keren Fu, Jing He, Xiao Yang. Few-Shot Learning-based RGB-D Salient Object Detection: A Case Study, Neurocomputing, 512: 142-152, 2022. - Qian Chen, Zhenxi Zhang, Yanye Lu, Keren Fu*, Qijun Zhao. 3-D Convolutional Neural Networks for RGB-D Salient Object Detection and Beyond, IEEE Transactions on Neural Networks and Learning Systems, 35(3): 4309-4323, 2024. [Github] - Huakun Yang, Qian Chen, Keren Fu, Lei Zhu, Lujia Jin, Qiushi Ren, Hongwei Du, Yanye Lu. Boosting Medical Image Segmentation via Conditional-Synergistic Convolution and Lesion Decoupling, Computerized Medical Imaging and Graphics, 101: 102110, 2022. - Geng Chen, Huazhu Fu, Tao Zhou, Guobao Xiao, Keren Fu, Yong Xia, Yanning Zhang. Fusion-Embedding Siamese Network for Light Field Salient Object Detection, IEEE Transactions on Multimedia, 26: 984-994, 2023. - Dingyao Min, Chao Zhang, Yukang Lu, Keren Fu*, Qijun Zhao. Mutual-Guidance Transformer-Embedding Network For Video Salient Object Detection, IEEE Signal Processing Letters, 29: 1674-1678, 2022. [Github] - Yao Jiang, Wenbo Zhang, Keren Fu*, Qijun Zhao. MEANet: Multi-Modal Edge-Aware Network for Light Field Salient Object Detection, Neurocomputing, 491: 78-90, 2022. [Github] - Ge-Peng Ji, Lei Zhu, Mingchen Zhuge, Keren Fu*. Fast Camouflaged Object Detection via Edge-based Reversible Re-calibration Network, Pattern Recognition, 123: 108414, 2022. [Github] - Ge-Peng Ji, Deng-Ping Fan, Keren Fu, Zhe Wu, Jianbing Shen, Ling Shao. Full-Duplex Strategy for Video Object Segmentation, Computational Visual Media, 9(1): 155-175, 2023.[Honorable Mention Award] - Keren Fu, Yao Jiang, Ge-Peng Ji, Tao Zhou, Qijun Zhao, Deng-Ping Fan. Light Field Salient Object Detection: A Review and Benchmark, Computational Visual Media, 8(4): 509-534, 2022.[PDF][Github] - Yi He, Keren Fu*, Peng Cheng, Jianwei Zhang. Facial Expression Recognition with Geometric Scattering on 3D Point Clouds, Sensors, 22(21): 8293, 2022. - Yi Zhang, Keren Fu, Cong Han, et al. PGM-Face: Pose-Guided Margin Loss for Cross-Pose Face Recognition, Neurocomputing, 460: 154-165, 2021. - Ye Lin, Keren Fu, Shenggui Ling, Jiang Wang, Peng Cheng. Toward Identity Preserving Face Synthesis between Sketches and Photos Using Deep Feature Injection, IEEE Transactions on Industrial Informatics, 18(1): 327-336, 2021. - Keren Fu, Deng-Ping Fan, Ge-Peng Ji, Qijun Zhao, Jianbing Shen, Ce Zhu. Siamese Network for RGB-D Salient Object Detection and Beyond, IEEE Transactions on Pattern Analysis and Machine Intelligence, 44(9): 5541-5559, 2022. [PDF][Github] - Yi Zhang, Keren Fu, Cong Han, Peng Cheng. Identity-and-Pose-Guided Generative Adversarial Network for Face Rotation, Neurocomputing, 450: 33-47, 2021. -* Bo Dong, Yan Zhou, Chuanfei Hu, Keren Fu*, Geng Chen. BCNet: Bidirectional Collaboration Network for Edge-Guided Salient Object Detection, Neurocomputing, 437: 58-71, 2021. - Qian Chen, Keren Fu, Ze Liu, Geng Chen, Hongwei Du, Bensheng Qiu. EF-Net: A Novel Enhancement and Fusion Network for RGB-D Saliency Detection, Pattern Recognition, 112: 107740, 2021. - Yu Zhao, Qiaoyuan Shu, Keren Fu, Pengcheng Wei, Jian Zhan. Joint patch and instance discrimination learning for unsupervised person re-identification, Image and Vision Computing, 104000, 2020. - Ye Lin, Shenggui Ling, Keren Fu, Peng Cheng. An Identity-Preserved Model for Face Sketch-Photo Synthesis, IEEE Signal Processing Letters, 27: 1095-1099, 2020. - Yi Zhang, Keren Fu, Peng Cheng. Learning from Discrete Gaussian Label Distribution and Spatial Channel-aware Residual Attention for Head Pose Estimation, Neurocomputing, 407: 259-269, 2020. - Lei Zhou, Chen Gong, Zhi Liu, Keren Fu. SAL:Selection and Attention Losses for Weakly Su",
  "content_length": 26620,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:55"
}