{
  "name": "Kerry L. Taylor",
  "homepage": "https://cs.anu.edu.au/people/kerry-taylor",
  "status": "success",
  "content": "Kerry Taylor | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Research My research interests broadly cover ontologies, semantic web and linked data, machine learning and data mining, sensor networks and IoT, and spatial data systems, and especially problems at the intersection of all those topics. Biography Dr Taylor joined The Australian National University (ANU) in January 2016. She spent the previous six months working on a UN ‘big data’ project with Australian Bureau of Statistics, after 20 years at CSIRO as a principal research scientist in the polyonymous IT research division. She has also worked as an IT practioner in consulting, publishing, education and government, in Sydney, Montreal and Oxford. Her research has focused on data management, integration, mining and machine learning in interdisciplinary contexts, especially employing logic-based and semantic approaches. Much of her recent work addresses data arising from IoT. She has lectured in logic programming, networking, software engineering and agile project management. Currently she lectures in data mining and convenes the ANU postgraduate programs in applied data analytics. From 2015-2017 she co-Chaired the joint Spatial Data on the Web working group of the W3C and the OGC. Activities & Awards Kerry holds a BSc (Hons 1) in Computer Science from UNSW 1983 and a PhD in Computer Science and Technology from the ANU in 1996. She is a Visiting Reader at the University of Surrey UK, and has been a Visiting Fellow at University of Melbourne. She serves on the Editorial boards of Knowledge-Based Systems and International Journal of Distributed Sensor Networks and many conference programme committees including ISWC, ESWC, and WWW. She is an organiser of Women in Big Data Canberra Grants Linkage Infrastructure, Equipment and Facilities 2018-19 , “A Large-Scale Distributed Experimental Facility for the Internet of Things” CASS/CECS cross-college grant 2017/18 “Development of a flexible smart criminal justice cost-benefit tool: Does crime prevention pay?” Icon Water and ActewAGL Endowment Fund 2018-19 “Mining Open Data for Smart Energy Use” Department of Finance, 2019-2020 “An ontology framework for government information”. bars search times",
  "content_length": 2384,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:58"
}