{
  "name": "Kerstin Schill",
  "homepage": "http://www.cognitive-neuroinformatics.com/de/team/kerstin-schill",
  "status": "success",
  "content": "Prof. Dr. Kerstin Schill - Cognitive Neuroinformatics DE EN Suchen ... Aktuelle Seite: Home -Team -Prof. Dr. Kerstin Schill Drucken E-Mail Prof. Dr. Kerstin Schill Leitung: Arbeitsgruppe Kognitive NeuroinformatikCurriculum Vitae                                                              Raum: 4.041 | Telefon: +49 (0)421 218 - 64240E-Mail: Diese E-Mail-Adresse ist vor Spambots geschützt! Zur Anzeige muss JavaScript eingeschaltet sein!Sprechzeiten: Nach Vereinbarung Rektorin des Hanse-Wissenschaftskollegs Delmenhorst Vizepräsidentin der Deutschen Forschungsgemeinschaft (DFG) Publikationen: Filter publications: 2025 [85] Robot pouring: identifying causes of spillage and selecting alternative action parameters using probabilistic actual causation (Jaime Maldonado, Jonas Krumme, Christoph Zetzsche, Vanessa Didelez, Kerstin Schill), In Frontiers in Cognition, Frontiers Media SA, volume 4, 2025. [bibtex] [abstract] [doi] [84] Efficient Object Detection Using Quasi-2D LiDAR Data for Autonomous Vehicles (Samanti Das, Joachim Clemens, Darshan Ghugare, Kerstin Schill), In International Conference on Information Fusion (FUSION), IEEE, 2025. [bibtex] [83] A Sensorimotor Vision Transformer (Konrad Gadzicki, Kerstin Schill, Christoph Zetzsche), 2025. [bibtex] [pdf] 2024 [82] Multi-Robot Graph SLAM Using LIDAR (Andreas Serov, Joachim Clemens, Kerstin Schill), In 10th International Conference on Automation, Robotics and Applications (ICARA), 2024. [bibtex] [abstract] [pdf] [doi] [81] PRORETA 5 – building blocks for automated urban driving enhancing city road safety (Christoph Popp, Andreas Serov, Felix Glatzki, Christoph Ziegler, Andreea-Iulia Olaru, Jaime Maldonado, Joachim Clemens, Jürgen Adamy, Maxim Arbitmann, Florin Leon, Steven Peters, Kerstin Schill, Sighard Schräbler, Hermann Winner), In at - Automatisierungstechnik, volume 72, 2024. [bibtex] [abstract] [pdf] [doi] 2022 [80] Visual-Inertial Odometry aided by Speed and Steering Angle Measurements (Andreas Serov, Joachim Clemens, Kerstin Schill), In 25th International Conference on Information Fusion (FUSION), IEEE, 2022. [bibtex] [abstract] [pdf] [doi] [79] Coverage Path Planning and Precise Localization for Autonomous Lawn Mowers (Maria Höffmann, Joachim Clemens, David Stronzek-Pfeifer, Ruggero Simonelli, Andreas Serov, Sven Schettino, Margareta Runge, Kerstin Schill, Christof Büskens), In 6th IEEE International Conference on Robotic Computing (IRC), 2022. [bibtex] [abstract] [pdf] [doi] [78] The OPA3L System and Testconcept for Urban Autonomous Driving (Andreas Folkers, Constantin Wellhausen, Matthias Rick, Xibo Li, Lennart Evers, Verena Schwarting, Joachim Clemens, Philipp Dittmann, Mahmood Shubbak, Tom Bustert, Gabriel Zachmann, Kerstin Schill, Christof Büskens), In 25th IEEE International Conference on Intelligent Transportation Systems (ITSC), IEEE, 2022. [bibtex] [abstract] [pdf] [doi] 2021 [77] Efficient Grid Map Data Structures for Autonomous Driving in Large-Scale Environments (Constantin Wellhausen, Joachim Clemens, Kerstin Schill), In 24th IEEE International Conference on Intelligent Transportation (ITSC), IEEE, 2021. [bibtex] [abstract] [pdf] [doi] [76] Visual-Multi-Sensor Odometry with Application in Autonomous Driving (Andreas Serov, Joachim Clemens, Kerstin Schill), In 93rd IEEE Vehicular Technology Conference (VTC2021-Spring), IEEE, 2021. [bibtex] [abstract] [pdf] [doi] 2020 [75] Kalman Filter with Moving Reference for Jump-Free, Multi-Sensor Odometry with Application in Autonomous Driving (Joachim Clemens, Constantin Wellhausen, Tom Luca Koller, Udo Frese, Kerstin Schill), In 23rd International Conference on Information Fusion (FUSION), IEEE, 2020. [bibtex] [abstract] [pdf] [doi] [74] Extended Object Tracking on the Affine Group Aff(2) (Lino Antoni Giefer, Joachim Clemens, Kerstin Schill), In 23rd International Conference on Information Fusion (FUSION), IEEE, 2020. [bibtex] [abstract] [pdf] [doi] [73] From Human to Robot Everyday Activity (C. Mason, K. Gadzicki, M. Meier, F. Ahrens, T. Kluss, J. Maldonado, F. Putze, T. Fehr, C. Zetzsche, M. Herrmann, K. Schill, T. Schultz), In 2020 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2020. [bibtex] [abstract] [doi] [72] Evaluation of Measurement Space Representations of Deep Multi-Modal Object Detection for Extended Object Tracking in Autonomous Driving (Lino Antoni Giefer, Razieh Khamsehashari, Kerstin Schill), In IEEE 3rd Connected and Automated Vehicles Symposium (CAVS), 2020. [bibtex] [abstract] [pdf] [doi] [71] Realizing a Demonstrator for the Autonomous Exploration of a Parking Lot (Andreas Folkers, Joachim Clemens, Frank Schrödel, Matthias Rick, Arne Berger, Verena Schwarting, Constantin Wellhausen, Mitja Echim, Max Gerwien, Matthias Knauer, Kerstin Schill, Christof Büskens), In 1st Virtual IFAC World Congress 2020 (IFAC-V), 2020. (extended abstract) [bibtex] [abstract] [70] Cooperative Autonomous Navigation for Extra-Terrestrial Exploration (J. Clemens, M. Echim, R. Weller, J. Backhaus, A. Goel, C. Rachuy, K. Chahour, M. Otten, S. Schettino, X. Li, M. Bobbe, K. Schill, C. Büskens, G. Zachmann, U. Bestmann, O. Funke), In 17th International Planetary Probe Workshop (IPPW), 2020. (extended ebstract) [bibtex] [pdf] 2019 [69] Autonomous Driving Based on Nonlinear Model Predictive Control and Multi-Sensor Fusion (Matthias Rick, Joachim Clemens, Laura Sommer, Kerstin Schill, Christof Büskens), In 10th IFAC Symposium on Intelligent Autonomous Vehicles (IAV2019), 2019. [bibtex] [abstract] [pdf] [doi] 2018 [68] Autonomous In-Ice Exploration of the Saturnian Moon Enceladus (Joachim Clemens, Christian Meerpohl, Verena Schwarting, Matthias Rick, Kerstin Schill, Christof Büskens), In 69th International Astronautical Congress (IAC), 2018. [bibtex] [abstract] [67] Multi-Sensor Fusion and Active Perception for Autonomous Deep Space Navigation (David Nakath, Joachim Clemens, Kerstin Schill), In 21st International Conference on Information Fusion (FUSION), IEEE, 2018. [bibtex] [abstract] [pdf] [doi] 2017 [66] Neural Computation of Statistical Image Properties in Peripheral Vision (Christoph Zetzsche, Ruth Rosenholtz, Noshaba Cheema, Konrad Gadzicki, Lex Fridman, Kerstin Schill), In Computational and Mathematical Models in Vision (MODVIS), 2017. [bibtex] 2016 [65] Extended Kalman filter with manifold state representation for navigating a maneuverable melting probe (Joachim Clemens, Kerstin Schill), In 19th International Conference on Information Fusion (FUSION), IEEE, 2016. [bibtex] [abstract] [pdf] [64] Optimal rotation sequences for active perception (David Nakath, Carsten Rachuy, Joachim Clemens, Kerstin Schill), In Proc. SPIE: Multisensor, Multisource Information Fusion: Architectures, Algorithms, and Applications (Jerome J. Braun, ed.), SPIE Press, volume 9872, 2016. [bibtex] [abstract] [pdf] [doi] [63] Towards the exploitation of formal methods for information fusion (Joachim Clemens, Robert Wille, Kerstin Schill), In Proc. SPIE: Multisensor, Multisource Information Fusion: Architectures, Algorithms, and Applications (Jerome J. Braun, ed.), SPIE Press, volume 9872, 2016. [bibtex] [abstract] [pdf] [doi] [62] Navigation technology for exploration of glacier ice with maneuverable melting probes (J. Kowalski, P. Linder, S. Zierke, B. von Wulfen, J. Clemens, K. Konstantinidis, G. Ameres, R. Hoffmann, J. Mikucki, S. Tulaczyk, O. Funke, D. Blandfort, C. Espe, M. Feldmann, G. Francke, S. Hiecker, E. Plescher, S. Schöngarth, K. Schüller, B. Dachwald, I. Digel, G. Artmann, D. Eliseev, D. Heinen, F. Scholz, C. Wiebusch, S. Macht, U. Bestmann, T. Reineking, C. Zetzsche, K. Schill, R. Förstner, H. Niedermeier, A. Szumski, B. Eissfeller, U. Naumann, K. Helbing), In Cold Regions Science and Technology, Elsevier, volume 123, 2016. [bibtex] [abstract] [pdf] [doi] 2015 [61] KaNaRiA: Identifying the Challenges for Cognitive Autonomous Navigation and Guidance for Missions to Small Planetary Bodies (Alena Probst, Graciela González Peytaví, David Nakath, Anne Schattel, Carsten Rachuy, Patrick Lange, Joachim Clemens, Mitja Echim, Verena Schwarting, Abhishek Srinivas, Konrad Gadzicki, Roger Förstner, Bernd Eissfeller, Kerstin Schill, Christof Büskens, Gabriel Zachmann), In 66th International Astronautical Congress (IAC), 2015. [bibtex] [60] Autonomous Orbit Navigation for a Mission to the Asteroid Main Belt (G. González Peytaví, J. Clemens, D. Nakath, A. Probst, R. Förstner, K. Schill, B. Eissfeller), In 66th International Astronautical Congress (IAC), 2015. [bibtex] [59] Affordance-Based Object Recognition Using Interactions Obtained from a Utility Maximization Principle (Tobias Kluth, David Nakath, Thomas Reineking, Christoph Zetzsche, Kerstin Schill), Chapter in Computer Vision - ECCV 2014 Workshops, Springer Science + Business Media, 2015. [bibtex] [abstract] [pdf] [doi] 2014 [58] Evidential Object Recognition Based on Information Gain Maximization (Thomas Reineking, Kerstin Schill), In Belief Functions: Theory and Applications, Springer Science + Business Media, 2014. [bibtex] [abstract] [pdf] [doi] [57] Active Sensorimotor Object Recognition in Three-Dimensional Space (David Nakath, Tobias Kluth, Thomas Reineking, Christoph Zetzsche, Kerstin Schill), Chapter in Spatial Cognition IX, Springer Science + Business Media, 2014. [bibtex] [abstract] [pdf] [doi] [56] Gelenkte Imagination durch narrative Kontextualisierung – Filmische Bewegtbilder in Eye-Tracking-Experimenten (T. Kluss, H. Preußer, J. A. Bateman, K. Schill), Chapter in Anschauen und Vorstellen. Gelenkte Imagination im Kino (H. Preußer, ed.), Schüren, volume 4, 2014. [bibtex] 2013 [55] Is the user trained? Assessing performance and cognitive resource demands in the Virtusphere (William E. Marsh, Tim Hantel, Christoph Zetzsche, Kerstin Schill), In 2013 IEEE Symposium on 3D User Interfaces (3DUI), Institute of Electrical & Electronics Engineers (IEEE), 2013. [bibtex] [abstract] [pdf] [doi] [54] Ubiquitous Fall Detection and Activity Recognition ",
  "content_length": 22897,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:03"
}