{
  "name": "Kerstin Lenk",
  "homepage": "https://www.tugraz.at/institute/ine/people/kerstin-lenk",
  "status": "success",
  "content": "INE - kerstin-lenk image/svg+xml Institute of Neural Engineering SCIENCEPASSIONTECHNOLOGYTUGraz LogoLogo of the TUGraz INE/kerstin-lenk Menü Institute HomeNewsContactTeamFoundersAlumniimage/svg+xmlStudying CoursesSummer termWinter termGuidelinesBachelor/Master Thesesimage/svg+xmlResearch Team Müller-PutzINTRECOMNeuroGraspClinical application of BCI-based motor Neuroprosthetics in spinal cord injuryFeel Your ReachCommunication in DoCAutonomous control through measurement of the neural correlate of perturbationTeam WriessneggerPassive BCI systemsEffects of visuo-spatial complexity on motor imageryVR based neurofeedback environmentsTeam LenkPublicationsResearch FieldsPast ProjectsrE(EG)map!EEG@Wachkomabci4rehabCoupling measures in BCIsNoninvasive Multimodal Recording of Biosignals for Feedback ApplicationsEHK-NIRSSoftwareVideosimage/svg+xmlGraz BCI Conferences 10th Graz BCI Conference 20269th Graz BCI Conference 2024CommitteesProceedings and Contributions8th Graz BCI Conference 2019CYBATHLON BCI Series 2019Proceedings and ContributionsCommitteesPhotos of the Conference7th Graz BCI Conference 2017Proceedings and ContributionsCommitteesPhotos of the ConferenceBCI Science Slam VideoAfter Conference Questionaire6th Graz BCI Conference 20145th Graz BCI Conference 20114th Graz BCI Conference 20083rd Graz BCI Conference 2006image/svg+xmlGraz BCI Racing Team Kerstin Lenk, Ass. Prof. Dr. rer. nat. Institute of Neural Engineering Graz University of Technology Stremayrgasse 16/IV 8010 Graz, Austria Tel: +43-316-873-30712 Email: kerstin.lenk@tugraz.at Follow me on Twitter. Since April 2021, I am an Assistant Professor at the Institute of Neural Engineering. I studied Computer Science with a major in medical informatics at Lausitz University of Applied Sciences in Senftenberg, Germany. I wrote my diploma thesis with the title \"Use of image processing techniques for dyssynchrony analysis on MR ventricular volumetric data in Tetralogy of Fallot\" (motion analysis of the right ventricle of the heart in 3D space) at King's College London, UK. During my Ph.D., I developed a neuronal network model that simulates the activity of up to 10,000 neurons. One focus was to model the influence of neuroactive substances, for example, antiepileptic drugs, on the neuronal synapses and thus to be able to draw conclusions about the connections between neurons in the network. In 2016, I received my Ph.D. (Dr. rer. nat.) in Computer Science at Clausthal University of Technology, Germany. In December 2016, I started my first Postdoctoral position at the TU Dresden, Germany. There, I analyzed transcriptomic data of human stem cell-derived neurons with bioinformatics tools. In 2018, I was granted a prestigious position as a Postdoctoral Researcher by the Academy of Finland. At Tampere University (TUNI, former TUT) in Finland, I started to develop computational models of local calcium dynamics in human single-cell astrocytes and neuron-astrocyte networks. Member in: Initiative Gehirnforschung Steiermark (IngeST) Gesellschaft für Informatik (G) Neurowissenschaftliche Gesellschaft (NWG) Austrian Neuroscience Association (ANA) Organization for Computational Neurosciences (OCNS) Research image/svg+xml Check here. My publications can be found on: Google Scholar ResearchGate Teaching image/svg+xml Bachelor: Verfassen wissenschaftlicher Arbeiten Scientific Computing: MATLAB Master: Selected Topics of Neural Engineering Legal Notice, Privacy Policy, Barrierefreiheitserklärung Accept all cookies Save preferences Cookie-Categories: Functional Analysis Marketing We use cookies in order to be able to provide you with the best possible service in the future. In the privacy policy you will find further information as well as the possibility of withdrawal.",
  "content_length": 3769,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:59"
}