{
  "name": "Kerstin Bach",
  "homepage": "https://www.ntnu.edu/employees/kerstin.bach",
  "status": "success",
  "content": "Kerstin Bach - NTNU Kerstin Bach Download press photo Download press photo Foto: Close Kerstin Bach Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering kerstin.bach@ntnu.no +4773597410 +4793032400 Gamle fysikk, 254, Gløshaugen Twitter ResearchGate Google Scholar https://kerstinbach.de/ About Kerstin is a professor at the Department of Computer Science. Her core competence field is Machine Learning and Artificial Intelligence. She is currently the director of the Norwegian Open AI Lab, research director of the NorwAI research center, and deputy head of the Data and Artificial Intelligence unit. Kerstin was awarded her PhD in Computer Science from the University of Hildesheim, Germany. Her main research interests are data-driven decision support systems as well as knowledge-intensive Case-Based Reasoning. She is active in the national and international AI community, chairing and reviewing for international conferences and serving on the board of the German Society for Computer Science's Special Interest Group on Knowledge Management and the Norwegian AI Society. She is a member of ACM, IEEE, and ELLIS. Research Interest: The main focus of her work is methods for applied artificial intelligence. While the application domains differ, we are investigating how to make knowledge and experience available through intelligent systems. Moreover, how to build systems that support complex, knowledge-intensive decisions using heterogeneous data sources. She has been managing AI research in several e-health research projects, including the management of low back pain, physical activity, and sleep, or mental health. She enjoys discussing AI methodologies and applications with fellow researchers, but more importantly, teaching it to students and bringing it into multidisciplinary projects, thereby shaping the new digital world. In particular, we are applying methods from the following research fields: Case-Based Reasoning Explainable Artificial Intelligence Decision Support Systems Information Extraction and Knowledge Engineering Research Unit: Data and Artificial Intelligence Current Projects: TrustLLM - Democratising trustworthy and factual large language model technology for Europe (2023-2026, Funding: EU HEU) LABDA - Learning Network for Advanced Behavioural Data Analysis (2023-2027, Funding: EU MSCA) Digi-FrailCare: A sustainable multidisciplinary model for personalized care for frail older people, using artificial intelligence and the next generation of medical records (2023-2027, Funding NTNU Helse) AI-MENT - Machine learning to tailor treatments in mental health (2023-2027, Funding NTNU Helse) SmaRTWork - a digital system for personalized return-to-work recommendations for sick-listed with musculoskeletal disorders (2021 - 2027, Funding: Research Council of Norway) Physical activity behavior and sleep study (2020-2025, Funding NTNU Helse) SupportPrim - Using AI for treatment planning of musculoskeletal pain (2020-2024, Funding: Research Council of Norway) Exaigon - Explainable AI systems for gradual industry adoption (2020 - 2024, Funding: Research Council of Norway) Completed Projects: AI4EU - An AI-on-demand platform for Europe (partner, Funding: EU H2020, 2019 – 2021) selfBACK - A decision support system for self-management of low back pain (project manager, Funding: EUH2020, 2016-2021) Back-UP - Personalised Prognostic Models to Improve Well-being and Return to Work After Neck and Low Back Pain (task leader, Funding: EU H2020, 2018 – 2021) Competencies Artificial intelligence Big Data Case-Based Reasoning EHealth & mHealth Explainable AI Information retrieval Knowledge Management Knowledge acquisition Knowledge modelling Machine learning ehealth Publications 2025 Sylvester, Rebecca Sophia; Bach, Kerstin; Kallestad, Håvard. (2025) Visual Question Answering to Generate Case-Based Explanations for Image Classification. Academic chapter/article/Conference paper Jenssen, Robert; Bach, Kerstin; Bjørklund, Petter. (2025) UiT er vertskap for landsdekkende KI-konferanse. uit.no Popular scientific article Jenssen, Robert; Tegnander, Cathrine; Olsen, Dag Rune; Syrstad, Ragnhild Sjoner; Teigland, André; Thaulow, Sven Størmer. (2025) Forskningsdrevet innovasjon innen KI: Hvordan styrker vi det sammen?. Other presentation Logacjov, Aleksej; Bach, Kerstin; Mork, Paul Jarle. (2025) Long-term self-supervised learning for accelerometer-based sleep–wake recognition. Engineering Applications of Artificial Intelligence Academic article Logacjov, Aleksej; Ludvigsen, Tonje Pedersen; Bach, Kerstin; Kongsvold, Atle; Flaaten, Mats; Marcuzzi, Anna. (2025) The performance of a machine learning model in predicting accelerometer-derived walking speed. Heliyon Academic article Asad, Hafiz Areeb; Kraemer, Frank Alexander; Bach, Kerstin; Renner, Bernd-Christian. (2025) UtiliGEM: Energy Management Guided by Learned Application Utility. Academic chapter/article/Conference paper Jenssen, Robert; Bach, Kerstin. (2025) Proceedings of the Symposium of the Norwegian AI Society 2025. CEUR-WS CEUR-WS Academic anthology/Conference proceedings Kongsvold, Atle; Skarpsno, Eivind Schjelderup; Flaaten, Mats; Logacjov, Aleksej; Bach, Kerstin; Nilsen, Tom Ivar Lund. (2025) Associations of sport and exercise participation in adolescence with body composition and device-measured physical activity in adulthood: longitudinal data from the Norwegian HUNT study. International Journal of Behavioral Nutrition and Physical Activity Academic article Herland, Sverre; Bach, Kerstin; Misimi, Ekrem; Langseth, Helge. (2025) Reinforcement Learning for Robotic Control and Manipulation in Ocean Space Applications. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation 2024 Westphal, Florian; Peretz-Andersson, Einav; Riveiro, Maria; Bach, Kerstin; Heintz, Fredrik. (2024) 14th Scandinavian Conference on Artificial Intelligence SCAI 2024, June 10-11, 2024, Jönköping, Sweden. Swedish Artificial Intelligence Society Swedish Artificial Intelligence Society Academic anthology/Conference proceedings Herland, Sverre; Bach, Kerstin; Misimi, Ekrem. (2024) 6-DoF Closed-Loop Grasping with Reinforcement Learning. Academic chapter/article/Conference paper Hurmuz, Marian; Jansen-Kosterink, Stephanie; Mork, Paul Jarle; Bach, Kerstin; Hermens, HJ. (2024) Factors influencing the use of an artificial intelligence-based app (selfBACK) for tailored self-management support among adults with neck and/or low back pain. Disability and Rehabilitation Academic article Ottersen, Stuart Gallina; Bach, Kerstin. (2024) Automatic Adjusting Global Similarity Measures in Learning CBR Systems. Academic chapter/article/Conference paper Marcuzzi, Anna; Klevanger, Nina Elisabeth; Aasdahl, Lene; Gismervik, Sigmund Østgård; Bach, Kerstin; Mork, Paul Jarle. (2024) An Artificial Intelligence–Based App for Self-Management of Low Back and Neck Pain in Specialist Care: Process Evaluation From a Randomized Clinical Trial. JMIR Human Factors Academic article Logacjov, Aleksej; Herland, Sverre; Ustad, Astrid; Bach, Kerstin. (2024) SelfPAB: large-scale pre-training on accelerometer data for human activity recognition. Applied Intelligence - The International Journal of Research on Intelligent Systems for Real Life Complex Problems Academic article Bayrak, Betül; Bach, Kerstin. (2024) Evaluation of Instance-Based Explanations: An In-Depth Analysis of Counterfactual Evaluation Metrics, Challenges, and the CEval Toolkit. IEEE Access Academic article Granviken, Fredrik; Vasseljen, Ottar; Bach, Kerstin; Jaiswal, Amar Deep; Meisingset, Ingebrigt. (2024) Decision Support for Managing Common Musculoskeletal Pain Disorders: Development of a Case-Based Reasoning Application. JMIR Formative Research Academic article Logacjov, Aleksej; Bach, Kerstin. (2024) Self-supervised learning with randomized cross-sensor masked reconstruction for human activity recognition. Engineering Applications of Artificial Intelligence Academic article Murad, Abdulmajid; Kraemer, Frank Alexander; Bach, Kerstin; Taylor, Gavin. (2024) Uncertainty-aware autonomous sensing with deep reinforcement learning. Future Generation Computer Systems Academic article Granviken, Fredrik; Meisingset, Ingebrigt; Bach, Kerstin; Bones, Anita Formo; Simpson, Melanie Rae; Hill, Jonathan C.. (2024) Personalised decision support in the management of patients with musculoskeletal pain in primary physiotherapy care: a cluster randomised controlled trial (the SupportPrim project). Pain Academic article Endriss, Ulle; Melo, Francisco; Bach, Kerstin; Bugarín-Diz, Alberto; Alonso-Moral, José; Barro, Senén. (2024) 27th European Conference on Artificial Intelligence, 19–24 October 2024, Santiago de Compostela, Spain – Including 13th Conference on Prestigious Applications of Intelligent Systems (PAIS 2024). IOS Press IOS Press Academic anthology/Conference proceedings Logacjov, Aleksej; Skarpsno, Eivind Schjelderup; Kongsvold, Atle Austnes; Bach, Kerstin; Mork, Paul Jarle. (2024) A Machine Learning Model for Predicting Sleep and Wakefulness Based on Accelerometry, Skin Temperature and Contextual Information. Nature and Science of Sleep Academic article Flogard, Eirik Lund; Mengshoel, Ole Jakob; Langseth, Helge; Ramampiaro, Heri; Bach, Kerstin. (2024) Improving Labour Inspection Efficiency via Machine Learning. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation 2023 Kongsvold, Atle Austnes; Flaaten, Mats; Logacjov, Aleksej; Skarpsno, Eivind Schjelderup; Bach, Kerstin; Nilsen, Tom Ivar Lund. (2023) Can the bias of self-reported sitting time be corrected? A statistical model validation study based on data from 23 993 adults in the Norwegian HUNT study. International Journal of Behavioral Nutrition and Physical Activity Academic article Ustad, Astrid; Logacjov, Aleksej; Trollebø, Stine Øverengen; Thingstad, Anne Pernille Mæhl",
  "content_length": 66115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:03"
}