{
  "name": "Kerstin Maike Strecker",
  "homepage": "https://www.uni-goettingen.de/de/team/611719.html",
  "status": "success",
  "content": "Team - Georg-August-Universität Göttingen ✖ Suchbegriff Mit Google™ suchen Interne Suche nutzen (eingeschränkte Ergebnisqualität) Team XLAB Schule & Praxis Lernszenarien Werkzeuge Menü Menü Suchbegriff Suchbegriff Mit Google™ suchen Interne Suche nutzen (eingeschränkte Ergebnisqualität). Suche starten Mit der Nutzung der Google™ Suche stimmen Sie den Datenschutzbestimmungen von Google™ zu Auf der Suche nach Personen, Veranstaltungen oder Räumen ? Zum eCampus Schließen Team Professorinnen und Professoren Prof. Dr. Kerstin Strecker Interessensschwerpunkte • Informatik und Allgemeinbildung • Aufbereitung zukunftsträchtiger Themen für den Informatikunterricht; aktuell: Maschinelles Lernen • Entwicklung von (digitalen) Unterrichtsmaterialien für den Informatikunterricht unter besonderer Berücksichtigung kontextbezogener und offener Aufgaben • Medizinische Informatik in der Sekundarstufe 1 • Physical Computing • Konzeption berufsbegleitender Weiterbildungsmaßnahmen für Lehrkräfte in Informatik. Kontakt Prof. Dr. Kerstin Strecker Institut für Informatik, Goldschmidtstr. 7, Raum 0.109 0551/39-20265 kerstin.strecker[at]informatik.uni-goettingen.de Sprechzeiten: nach Vereinbarung per E-Mail Lebenslauf Ausbildung 1998Diplom in Informatik mit Anwendungsfach Medizinische Informatik 2004Master of Arts in Schulpädagogik und Didaktik 2007Zweites Staatsexamen für das Lehramt an Gymnasien, Fächer: Informatik und Mathematik 2009Promotion in Informatikdidaktik (Dr. rer. nat.) Berufliche Laufbahn 1998 – 2002Tätigkeit als Informatikerin, u.a. bei Fagus GreCon, Alfeld/Leine 2002 – 2005Wissenschaftliche Mitarbeiterin, Universität Göttingen 2005 – 2007Referendariat (Geschwister-Scholl-Schule Göttingen) 2007 – 2019Gymnasiallehrkraft und Fachberaterin für Informatik bei der Niedersächsischen Landesschulbehörde, Regionalabteilung Braunschweig (Studiendirektorin) 2007 – 2012Studienrätin Max-Planck-Gymnasium Göttingen 2012 – 2019 Hainberg-Gymnasium Göttingen 2014 Ernennung zur Oberstudienrätin 2015 Ernennung zur Studiendirektorin Zusätzlich: 2010 – 2012Mitwirkerin am Studienseminar Göttingen für das Lehramt an Gymnasien, Ausbilderin von Referendarinnen und Referendaren im Fach Informatik 2010 – 2019Lehraufträge an der Universität Göttingen in der Fachdidaktik Informatik 2011 – 2019 Leitung des „Sprintstudium Informatik“, einer Maßnahme des Niedersächsischen Kultusministeriums (MK), Niedersächsischen Landesinstitut für schulische Qualitätsentwicklung (NLQ) und Universität Göttingen zur Qualifikation von Gymnasiallehrerinnen und Gymnasiallehrern in Informatik 2013Ernennung zur Fachberaterin in der Schulaufsicht für das Fach Informatik bei der Niedersächsischen Landesschulbehörde (NLSchB), Regionalabteilung Braunschweig 2016Bestellung zur Honorarprofessorin für „Didaktik der Informatik“ an der Universität Göttingen seit 2019Professorin für „Didaktik der Informatik“ an der Universität Göttingen Aktuelle Veröffentlichungen in 2025 Bücher • Eickhoff-Schachtebeck, A. und Strecker, K. (2025): Themenheft Informatik: Künstliche Intelligenz und Maschinelles Lernen. Klett-Verlag, ISBN: 978-3-12-007626-1 Artikel • Eickhoff-Schachtebeck, A. und Strecker, K. (2025). Zum Stellenwert von Verfahren des maschinellen Lernens im allgemeinbildenden Informatikunterricht. Informatische Bildung in Schulen 3(1). https://doi.org/10.18420/ibis-03-01-08 • Morgenstern, L., Waitz, S., Strecker, K. & Waitz, T. (2025). Interaction Boxes Promoting Scientific Interest in Non-Formal Learning Environments. In Pixel (Hrsg.), Conference Proceedings. New Perspectives in Science Education: 14th Conference Edition (S. 83–87). Filodiritto Publisher. • ​Berges, M., Eickhoff-Schachtebeck, A., Engbring, D., Gapski, H., Schulte, C., Strecker, K., & Verständig, D. (2025). KI-Bildung! Sechs Thesen zum Verhältnis von Künstlicher Intelligenz, Bildung und Gesellschaft aus interdisziplinärer Perspektive. MedienPädagogik: Zeitschrift für Theorie Und Praxis Der Medienbildung, (Statements and Frameworks), 1–17. https://doi.org/10.21240/mpaed/00/2025.07.07.X • ​Brandt, Y. und Strecker, K. (2025). Bildmanipulation als Lernszenario im Bereich Algorithmik. Informatische Bildung in Schulen 3(2). https://doi.org/10.18420/ibis-03-02-03 Sonstiges • Eickhoff-Schachtebeck, A. und Strecker, K. (2025): Themenheft Informatik Künstliche Intelligenz und Maschinelles Lernen. Didaktischer Kommentar. Klett-Verlag, ISBN: ECM00322UAA99 Prof. Dr. Eckart Modrow Ich beschäftige mich mit den Themen „Informatik und Allgemeinbildung“ sowie „grafische Programmiersprachen“. Ich entwickle Bibliotheken für die grafische Programmierumgebung Snap! der Universität in Berkeley und deren Anwendung z. B. in der Astrophysik. https://ddi-mod.uni-goettingen.de/ Kontakt Prof. Dr. Eckart Modrow Institut für Informatik, Goldschmidtstr. 7, Raum 0.109 0551/39-20265 eckart.modrow[at]mathematik.uni-goettingen.de Wissenschaftliche Mitarbeiter Lucas Daniel Warnecke Als wissenschaftlicher Mitarbeiter befasse ich mich mit neuesten Entwicklungen innerhalb der Didaktik der Informatik und unterstütze und gestalte Lehrveranstaltungen für Bachelor- und Masterstudierende. Darüber hinaus erforsche ich im Rahmen meiner Promotion die Nutzung und Integration humanbiologischer und medizinischer Kontexte in Lernszenarien zur Förderung von Kompetenzen im Algorithmischen Problemlösen mit dem Ziel, Zielgruppen zu motivieren, die bisher weniger Interesse am Programmieren zeigen. Kontakt Lucas Daniel Warnecke, M.Ed. Institut für Informatik, Goldschmidtstr. 7, Raum 0.108 0551/39-20231 lucas.warnecke[at]uni-goettingen.de Sprechzeiten: nach Vereinbarung per E-Mail Lebenslauf Ausbildung 2017Abitur am Börde-Gymnasium Wanzleben 2021Bachelor of Arts im 2-Fach-Bachelorstudiengang: Informatik und Biologie (Profil Lehramt) an der Georg-August-Universität Göttingen 2024Master of Education in Lehramt für Informatik & Biologie an der Georg-August-Universität Göttingen gefördert durch FundaMINT-Stipendium der Deutschen Telekom Stiftung zusätzlich erworbene Zertifikate: „Fächerübergreifendes Unterrichten - Schwerpunkt Unterrichten von Naturwissenschaften“ Berufliche Laufbahn 2019-2024Pädagogischer Mitarbeiter am Theodor-Heuss-Gymnasium Göttingen 2019Studentische Hilfskraft in der Didaktik der Biologie an der Georg-August-Universität Göttingen 2024Vertretungslehrkraft am Geschwister-Scholl-Gymnasium Magdeburg seit 2024Wissenschaftlicher Mitarbeiter und Doktorand an der Georg-August-Universität Göttingen in der Abteilung Didaktik der Informatik Aktuelle Veröffentlichungen in 2025 Konferenzbeitrag • Warnecke, L. (2025). Genderaspekte im Informatikunterricht - Ein Vorschlag zur Berücksichtigung der Empathizing-Systemizing-Theory bei der Wahl von Unterrichtskontexten. In Grenzen überwinden - voneinander lernen: Bd. Lecture Notes in Informatics (LNI) (S. 109-117). Gesellschaft für Informatik. https://www.infos2025.ch/proceedings/infos2025_wi_2.pdf Lehrerbildungszentrum Informatik Ylva Brandt Ich arbeite als Informatiklehrerin an einem Gymnasium und unterstütze zusätzlich das Lehrerbildungszentrum Informatik. Kontakt Ylva Brandt brandt[at]informatik.uni-goettingen.de Dr. Annika Eickhoff-Schachtebeck Ich arbeite als Informatiklehrerin an einem Gymnasium und bin Fachberaterin für Informatik. Zusätzlich unterstütze das Lehrerbildungszentrum Informatik. Kontakt Dr. Annika Eickhoff-Schachtebeck eickhoff-schachtebeck[at]informatik.uni-goettingen.de Externe Doktoranden Mirek Hančl Kontakt Mirek Hančl mirek.hancl[at]informatik.uni-goettingen.de Studentische Hilfskräfte Sebastian Rottstock Als studentische Hilfskraft begleite ich die Bachelorveranstaltung vom Frau Prof. Dr. Strecker mit. Neben der Pflege und Instandhaltung des Lehrer:innenzimmers, unterstütze ich auch den Informatik-Bereich im XLAB. Kontakt Sebastian Rottstock sebastian.rottstock[at]uni-goettingen.de",
  "content_length": 7835,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:00"
}