{
  "name": "Kevin R. B. Butler",
  "homepage": "http://cise.ufl.edu/~butler",
  "status": "success",
  "content": "Home page for Kevin R. B. Butler KEVIN R. B. BUTLER Professor Department of Computer and Information Science and Engineering University of Florida Email: butler at ufl.edu Phone: (352) 294-2090 Fax: (352) 392-1220 Mailing Address: 1889 Museum Rd. Ste. 5400 Gainesville, FL 32611 USA On-Campus Address: 4200B Malachowsky Hall Home News Publications Teaching Vita I am Director of the Florida Institute for Cybersecurity Research and a University Term Professor. I also direct the Center for Privacy and Security for Marginalized and Vulnerable Populations (PRISM), a National Science Foundation Frontiers project. I am also a member of the Computing Research Association's Community Computing Council. I joined the University of Florida in 2014 as part of the UF Rising to National Preeminence Hiring Program and was the Arnold and Lisa Goldberg Rising Star Associate Professor in Computer Science prior to promotion to Professor. My research focuses on the security of computing devices, systems, networks, and users of computing technology. Recent work in my group has included securing embedded systems and protocols, mobile device security and privacy, cellular device and network security, side channel analysis, establishing the trustworthiness of data and maintaining its provenance, protection of Internet traffic and examination of censorship, and attacks and defenses against the cloud infrastructure, and needs of marginalized and vulnerable users, particularly populations with impairments and survivors of abuse. Some of my other research areas of interest include securing Internet routing, malware propagation, applied cryptosystems, adversarial machine learning, cyber-physical systems, and trustworthy computing. I received a National Science Foundation CAREER award in 2013, and was named International Educator of the Year within the Herbert Wertheim College of Engineering in 2017 for my work on developing global standards for securing digital financial services in the developing world. From 2017-2022 I was co-chair of the International Telecommunications Union's Security, Infrastructure, and Trust Working Group as part of the Financial Inclusion Global Initiative. I am a Senior Member of the IEEE and ACM. I was technical program co-chair of the 2022 USENIX Security Symposium and conference general chair for ACSAC 2020 and ACSAC 2021. I am also an affiliate faculty member of the Center for Children and Families within the University of Florida's Levin College of Law. Note: We have built a world-class security research group at the University of Florida. I am looking for talented and motivated students students with an interest in systems security and doing inspiring work with real-world impact. The most important quality is intellectual curiosity and the ability to be a self-starter, but experience with binary analysis, embedded systems, trustworthy computing, mobile security, machine learning, or human-computer interaction would be particularly useful. If you are not at student at the University of Florida and you are interested in my research, please apply to the program. \"You must be the change you wish to see in the world.\" — Mohandas Gandhi",
  "content_length": 3189,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:30"
}