{
  "name": "Kevin Fu",
  "homepage": "https://web.eecs.umich.edu/~kevinfu",
  "status": "success",
  "content": "Kevin Fu Kevin Fu 傅佳偉 Professor ACM Fellow, IEEE Fellow, Sloan Research Fellow, Dr. Dwight E. Harken Memorial Lecturer Northeastern University Electrical & Computer Engineering and Khoury College of Computer Sciences Contact — Bio — CV HomePublicationsResearchTalksServiceTeachingStudentsMusingsFunBlog » Upcoming Paper:Side Eye: Characterizing the Limits of POV Acoustic Eavesdropping from Smartphone Cameras with Rolling Shutters and Movable Lenses (IEEE S&P May 2023)  « As of January 2023, I've moved to Northeastern University in Boston where I am Professor of Electrical & Computer Engineering in the College of Engineering and the Khoury College of Computer Sciences. I am actively recruiting graduate students for advanced research in both medical device security (computing/bioengineering/public policy) and analog sensor cybersecurity (computer engineering, semiconductor design, physics). My research vision is a world where science-based security is built-in by design to all embedded systems: medical devices, autonomous transportation, healthcare delivery, manufacturing, and the Internet of Things. This is challenging because the number of vulnerabilities continues to increase dramatically while solutions remain largely piecemeal and reactive. Finding systematic solutions that address root causes rather than symptoms of risk is extremely important now because consumers are surrendering control to IoT devices before the autonomous systems have adequate trustworthiness to withstand modern, constantly evolving adversaries and threat models. I founded the Archimedes Center for Healthcare and Device Security. I direct the Security and Privacy Research (SPQR) group at Michigan. I previously served as the inaugural Acting Director of Medical Device Cybersecurity at FDA's Center for Devices and Radiological Health. I lead the Distinguished Speaker Series on Cybersecurity for Biomedical Engineering at the UCSF-Stanford Center for Regulatory Science and Innovation (FDA CERSI). I was a founding member of the N95decon.org team on decontamination science for emergency reuse of N95 filtering facepiece respirators during healthcare worker PPE shortages. I have an archived blog on medical device security and safety. Selected Talks and Events (less incomplete list): University of Toronto Schwartz Reisman Institute for Technology and Society (February 2022), Purdue Weldon School of Biomedical Engineering, Distinguished Lecture (January 2022), The George Washington University and CyberMed Summit (January 2022), ECRI Top 10 Health Technology Hazards (January 2022), Indiana University Kelley School of Business: Cybersecurity in Healthcare and the Life Sciences, AdvaMed Cybersecurity Summit, Science Friday, University of Michigan, Cybersecurity for Future Leaders: Embedded Security, DEFCON Bio Hacking Village: FDA and Medical Device Security, Tufts Computer Science Virtual Colloquium, Mayo Clinic Grand Rounds, MIT CSAIL Seminar on Physics of Embedded Security, Cambridge University Computer Laboratory Security Seminar, CRA CCC Leadership in Embedded Security Workshop Toons: Honors: IEEE Fellow for contributions to embedded and medical device security, Top Influencers in Health InfoSec, World Economic Forum Young Scientist, Fed100 Award,TR35 Innovator of the Year 2009, Sloan Fellowship, NSF CAREER, Paper Awards [ACM SIGCOMM, IEEE S&P, USENIX Security] News: Kevin Fu joins AAMI Editorial Board on Biomedical Instrumentation and Technology, Science Friday, NY Times and Wired and Ars Technica on Light Commands, NY Times on an acoustic virus, Slashdot interview, NBC Chicago, NY Times, Scientific American, MIT Technology Review, Slashdot, Economist, PBS Newshour, Forbes, BBC, LA Times, NIST. [Archived news] Fun stuff: Cybersecurity standup comedy. I wrote the lyrics of a Taylor Swift-inspired a capella music video about programming. I used to maintain a collection of links on why Ann Arbor is cool. Undergrads considering graduate school: When my students are not kiteboarding on the beautiful shores of Lake Michigan, they are probably publishing security research with an emphasis on analog sensor security or medical device security within the field of embedded security. Prospective graduate students can read advice on how to write more effective graduate school applications. This event was part of a larger national set of workshops to broaden participation in computing research. Also see my links to reports on women in computing research. Selected publications (complete list): Poltergeist: Acoustic Adversarial Machine Learning against Cameras and Computer Vision (IEEE S&P) Light Commands: Laser-Based Audio Injection Attacks on Voice-Controllable Systems (USENIX Security) Blue Note: How Intentional Acoustic Interference Damages Availability and Integrity in Hard Disk Drives and Operating Systems (IEEE S&P) How We Reverse Engineered the Cuban \"Sonic Weapon\" Attack (IEEE Spectrum) Inside Risks: Risks of Trusting the Physics of Sensors (CACM) WALNUT: Waging Doubt on the Integrity of MEMS Accelerometers with Acoustic Injection Attacks (IEEE Euro S&P) Ghost Talk: Mitigating EMI Signal Injection Attacks against Analog Sensors (IEEE S&P) Mementos: System Support for Long-Running Computation on RFID-Scale Devices (ACM ASPLOS) Pacemakers and Implantable Cardiac Defibrillators: Software Radio Attacks and Zero-Power Defenses (IEEE S&P) Videos and More (complete talks list): Announcements: Chair of CCC Cybersecurity Task Force; Senate testimony; House testimony; Program chair for USENIX Security; Appointment to ACM Committee on Computers and Public Policy; first graduate course in the nation dedicated to medical device security. Affiliations: THaW, Security @Michigan, SPQR Lab, Archimedes Recent research support: National Science Foundation, ADI, Archimedes Join the Blue Ribbon Online Free Speech Campaign!",
  "content_length": 5871,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:09"
}