{
  "name": "Kevin Shuai Xu",
  "homepage": "https://sites.google.com/site/kevinshuaixu",
  "status": "success",
  "content": "Kevin Shuai XuSearch this siteEmbedded FilesSkip to main contentSkip to navigationKevin S. XuAssistant ProfessorDepartment of Computer and Data SciencesCase Western Reserve University10900 Euclid Ave., Cleveland, OH 44106-7071, USAResearchI lead the Machine Learning and Network Science (MLNS) laboratory at Case Western Reserve University. Our research is primarily in the areas of machine learning and network science with applications to human dynamics, health care, education, and wearable computing.Recent news2025Sept. 23: Our paper \"LIT-LVM: Structured regularization for interaction terms in linear predictors using latent variable models\" has been published in the Transactions on Machine Learning Research, available at https://openreview.net/forum?id=3uW5nxESu1 -- congratulations to former PhD students Mohammadreza Nemati and Zhipeng Huang!July 13: Congratulations to PhD student Mohammadreza Nemati for successfully defending his PhD dissertation \"Data-Driven Models for Kidney Transplant Survival Prediction and Donor-Recipient Compatibility\"!July 10: Our paper \"Temporal Motif Participation Profiles for Analyzing Node Similarity in Temporal Networks\" has been accepted to ASONAM 2025. A preprint on arXiv is available at https://arxiv.org/abs/2507.06465 -- congratulations to BS student Maxwell Lee!2024July 26: Congratulations to PhD student Zhipeng Huang for successfully defending his PhD dissertation \"Probabilistic generative models for complex network analysis\". He will be joining the Mathematics & Computer Science Department at Suffolk University as an assistant professor beginning in Fall 2024!Jan. 3: I have several openings starting in Fall 2024 for PhD students interested in machine learning and network science, particularly for biomedical and health applications. If you are interested, please email me with your CV, transcripts, GRE scores, and a 2-page summary of your research experience.2023Sept. 19: I am co-organizing the Second Symposium on Survival Prediction: Algorithms, Challenges & Applications (SPACA 2023) at the AAAI 2023 Fall Symposium Series. We are open for poster submissions. Please consider participating and submitting your work related to survival prediction and analysis!Mar. 30: I will be giving a talk at the Institute for Mathematics and its Applications at the University of Minnesota on Tuesday, April 4. It will be livestreamed also on Zoom. Link to seminar2022Aug. 16: I have joined Case Western Reserve University as an assistant professor in the Department of Computer and Data Sciences. I have several openings for both graduate and undergraduate research assistants interested in probabilistic machine learning or network science--please email me if you are interested!Jul. 29: Congratulations to MS student Tanner Hilsabeck for successfully defending his MS thesis \"A Hybrid Adjacency and Time-Based Data Structure for Analysis of Temporal Networks\" and to MS student Hadeel Soliman for successfully defending her MS thesis \"Community Hawkes Models for Continuous-time Networks\"!Jul. 8: Our paper \"A hybrid adjacency and time-based data structure for analysis of temporal networks\" has been published in Applied Network Science: https://appliednetsci.springeropen.com/articles/10.1007/s41109-022-00489-5 -- congratulations to MS student Tanner Hilsabeck and former MS student Makan Arastuie!May 16: 2 papers accepted: \"The Multivariate Community Hawkes Model for Dependent Relational Events in Continuous-time Networks\" (ICML 2022: arXiv preprint) and \"A Mutually Exciting Latent Space Hawkes Process Model for Continuous-time Networks\" (UAI 2022: arXiv preprint). Congratulations to PhD student Zhipeng Huang and MS student Hadeel Soliman on their first publications since joining the IDEAS Lab!May 7: I am serving as a tutorial chair for CIKM 2022. General areas of interest for tutorials include general areas include artificial intelligence, data science, databases, information retrieval, and knowledge management. Please feel free to contact me if you would like to discuss a tutorial proposal! Call for tutorialsApr. 5: I have received the College of Engineering Award for Excellence in Supervision of Undergraduate Research. Thanks to all the wonderful undergraduate student researchers I've had the pleasure of advising!Research projectsCurrent projectsCreation of statistical models and efficient inference procedures for discrete-time and continuous-time dynamic network data, particularly social network data (supported by NSF CAREER award IIS-2318751 and previously by NSF grants IIS-1755824 and DMS-1830412)Development of robust machine learning algorithms for multiple modalities of sensor data streams, particularly on physiological data such as electrodermal activity, heart rate variability, and blood pressure (supported by awards from the Department of Veterans Affairs and the American Heart Association)Prediction of survival times for kidney transplants by integrating high-dimensional survival analysis and network models with biological models of immunogenicity (previously supported by the by NIH grant R01LM013311)Prediction of chronic PTSD from structural and functional MRI brain imaging data (previously supported by NIH grants R21MH125277 and R01MH110483)Prediction of students' performance and mental workload levels using clickstream and wearable data analytics (previously supported by NSF grant EEC-2025088)Past projectsPrediction of human performance and cognitive load levels for human-machine collaboration (supported by the Ohio Federal Research Network)EducationPhD, University of Michigan, Electrical Engineering: Systems, 2012, Advisor: Alfred O. Hero IIIMSE, University of Michigan, Electrical Engineering: Systems, 2009BASc, University of Waterloo, Honors Electrical Engineering, 2007Honors and awardsUniversity of Toledo College of Engineering Award for Excellence in Supervision of Undergraduate Research, 2022NSF CAREER Award, 2021NSF Computer and Information Science and Engineering (CISE) Research Initiation Initiative (CRII) Award, 2018Exceptional Service Award, International Conference on Social Computing, Behavioral-Cultural Modeling, & Prediction and Behavior Representation in Modeling and Simulation (SBP-BRiMS), 2016Winner, International Conference on Social Computing, Behavioral-Cultural Modeling, and Prediction Challenge (SBP), 2013Postgraduate scholarship: Doctorate, Natural Sciences and Engineering Research Council of Canada (NSERC), 2010-2011Postgraduate scholarship: Master’s, Natural Sciences and Engineering Research Council of Canada (NSERC), 2008Selected publicationsFor a full publication list, please see my CV or my Google Scholar Citations profile.Nemati, M., Huang, Z., & Xu, K. S. (2025). LIT-LVM: Structured regularization for interaction terms in linear predictors using latent variable models. Transactions on Machine Learning Research. arxiv:2506.15492Soliman, H., Zhao, L., Huang, Z., Paul, S., & Xu, K. S. (2022). The Multivariate Community Hawkes model for dependent relational events in continuous-time networks. In Proceedings of the 39th International Conference on Machine Learning (pp. 20329-20346). arXiv:2205.00639Arastuie, M., Paul, S., & Xu, K. S. (2020). CHIP: A Hawkes process model for continuous-time networks with scalable and consistent estimation. In Advances in Neural Information Processing Systems 33 (pp. 16983-16996). arXiv:1908.06940Junuthula, R. R., Haghdan, M., Xu, K. S., & Devabhaktuni, V. K. (2019). The Block Point Process Model for continuous-time event-based dynamic networks. In Proceedings of the World Wide Web Conference (pp. 829-839). arXiv: 1711.10967Zhang, Y., Haghdan, M., & Xu, K. S. (2017). Unsupervised motion artifact detection in wrist-measured electrodermal activity data. In Proceedings of the 21st ACM International Symposium on Wearable Computers (pp. 54–57). arXiv:1707.08287Jain, S., Oswal, U., Xu, K. S., Eriksson, B., & Haupt, J. (2017). A compressed sensing based decomposition of electrodermal activity signals. IEEE Transactions on Biomedical Engineering, 64(9), 2142–2151. arXiv:1602.07754Han, Q., Xu, K. S., & Airoldi, E. M. (2015). Consistent estimation of dynamic and multi-layer block models. In Proceedings of the 32nd International Conference on Machine Learning (pp. 1511–1520). arXiv:1410.8597Xu, K. S. (2015). Stochastic block transition models for dynamic networks. In Proceedings of the 18th International Conference on Artificial Intelligence and Statistics (pp. 1079–1087). arXiv:1411.5404Xu, K. S., & Hero III, A. O. (2014). Dynamic stochastic blockmodels for time-evolving social networks. IEEE Journal of Selected Topics in Signal Processing, 8(4), 552–562. arXiv:1403.0921.Xu, K. S., Kliger, M., & Hero III, A. O. (2014). Adaptive evolutionary clustering. Data Mining and Knowledge Discovery, 28(2), 304–336. arXiv:1104.1990.TeachingCase Western Reserve University (2022-present)CSDS 340 Introduction to Machine Learning: Fall 2022-2025CSDS 446 Machine Learning on Graphs: Spring 2024-2025CSDS 600 Special Topics – Machine Learning on Graphs: Spring 2023University of Toledo (2015-2022)EECS 1100 Digital Logic Design: Fall 2016-2021EECS 1510 Introduction to Object-Oriented Programming: Fall 2015, Spring 2020EECS 2510 Non-linear Data Structures: Spring 2021-2022EECS 4750/5750 Machine Learning: Fall 2021, Fall 2016-2019EECS 4980/5980 Special Topics – Social and Information Networks: Fall 2020, Spring 2020, Spring 2018EECS 6980/8980 Special Topics – Probabilistic Methods in Data Science: Spring 2020-2021, Spring 2018EECS 6980/8980 Special Topics – Social Network Analysis: Spring 2016Selected service to research communityAssociate editor for IEEE Transactions on Computational Social Systems (2016-2025) and PLOS ONE (2023-present)Program co-chair of SBP-BRiMS (2016-2017) and SBP 2015Area chair/senior program committee member of AISTATS (2025-2026), UAI (2024-2025), CIKM (2023-2025), and SBP (2014)Program committee member/reviewer of AAAI (2021-2026), NeurIPS (2",
  "content_length": 14939,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:30"
}