{
  "name": "Kevin Vella",
  "homepage": "https://www.um.edu.mt/profile/kevinvella",
  "status": "success",
  "content": "Prof. Kevin Vella - L-Università ta' Malta Prof. Kevin Vella Prof. Kevin Vella Prof. Kevin Vella B.Sc.(Melit.),Ph.D.(Kent) Associate Professor Computer Science Faculty of Information & Communication Technology Level 1, Block B Room 1 ICT Building University of Malta Msida +356 2340 3550 Send Email Research Interests Distributed computingComputing systemsParallel computingSoftware development Publications Azzopardi, G., Muscat, A. & Vella, K. 2017, \"Distributing CSP Process Networks over MPI Clusters\", Communicating Process Architectures 2017, eds. J. Broenink, K. Chalmers, J. Pedersen, K. Vella, B. Vinter & P. Welch, WoTUG; IOS Press, Amsterdam, the Netherlands, Aug.Broenink, J., Chalmers, K., Pedersen, J., Vella, K., Vinter, B. & Welch, P. (eds) 2017, Communicating Process Architectures 2017, WoTUG; IOS Press, Amsterdam, the Netherlands.Micallef, K. & Vella, K. 2016, \"Communicating Generators in JavaScript\", Communicating Process Architectures 2016WoTUG; Open Channel Publishing, , Aug, pp. 87.Bailey, D. & Vella, K. 2011, \"Peer-to-peer virtualized services\", vol. 4, no. 3, pp. 89-102.Andronico, G., Barbera, R., Bruno, R., Cavalli, V., Durnford, L., Jaume-Rajaonia, S., Jemni, M., Koumantaros, K., Rocca, G.L., Liabotis, I., Nassar, S., Reale, M., Ruggieri, F., Suleiman, M., Tanlongo, F., Torman, Y., Vella, K. & West, D. 2008, e-Infrastructures across the Mediterranean, Trans-European Research and Education Networking Association.Vella, K. 2005, EUMEDGRID - User and eInfrastructure Requirements Capture and Analysis for the Mediterranean Region, FP6-Infrastructures SSA.Debattista, K., Cordina, J. & Vella, K. 2003, \"Wait-free cache-affinity thread scheduling\", vol. 150, no. 2, pp. 137-146.Debattista, K., Cordina, J. & Vella, K. 2002, \"Cache-affinity scheduling for fine grain multithreading\", vol. 2002, pp. 135-146.Debattista, K. & Vella, K. 2002, \"High Performance Wait-Free Thread Scheduling on Shared Memory Multiprocessors\", Proceedings of the International Conference on Parallel and Distributed Processing Techniques and Applications, Volume 2, ed. H. M. Arabnia, CSREA Press, , pp. 1022.Dobinson, R.W., Haas, S., Korcyl, K., LeVine, M.J., Lokier, J., Martin, B., Meirosu, C., Saka, F. & Vella, K. 2001, \"Testing and modeling Ethernet switches and networks for use in ATLAS high-level triggers\", vol. 48, no. 3, pp. 607-612.Vella, K. & Welch, P.H. 1999, \"CSP/occam on Shared Memory Multiprocessor Workstations\", P}roceedings of {W}o{TUG}-22: {A}rchitectures, {L}anguages and {T}echniques for {C}oncurrent {S}ystems, ed. B. M. Cook, IOS Press, , Apr, pp. 87.Vella, K. 1998, Seamless parallel computing on heterogeneous networks of multiprocessor workstations, University of Kent at Canterbury.Vella, K. 1996, \"CSP/occam on networks of workstations\", Proceedings of UK Parallel '96: The BCS PPSG Annual Conference, eds. C.R. Jesshope & A.V. Shafarenko, Springer-Verlag, , Jul, pp. 70. Lecturing Portfolio CPS1014 - Operating SystemsCPS2003 - Systems ProgrammingCPS3236 - Concurrency, HPC and Distributed Computing Search for staff Study at UMUndergraduatePostgraduate & ResearchMicro-credentialsUndergraduate prospectus [PDF]Postgraduate prospectus [PDF]",
  "content_length": 3184,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:31"
}