{
  "name": "Kevin Leyton-Brown",
  "homepage": "http://www.cs.ubc.ca/~kevinlb",
  "status": "success",
  "content": "Kevin Leyton-Brown Kevin Leyton-Brown Research Teaching Publications Software Misc Kevin Leyton-Brown Distinguished University Scholar Canada CIFAR AI Chair, Amii Professor Computer Science University of British Columbia 2366 Main Mall, Room X565 Vancouver, BC V6T 1Z4 604-822-1453 (phone) 604-822-5485 (fax) Meeting Times Office Location Biography Curriculum Vitae Notable Recent News AAAI Conference Committee Chair  I chair the committee that appoints general and program chairs for the AAAI conference and advises them in the operation of the conference. Academic Affiliations I'm Director of the UBC ICICS Center for AI Decision-making and Action (CAIDA), Director of the UBC Science Research Cluster on AI Methods for Scientific Impact (AIM-SI), and an Associate Member of the Vancouver School of Economics. I'm a Fellow of the Royal Society of Canada (RSC), a Fellow of the Association of Computing Machinery (ACM), and a Fellow of the Association for the Advancement of Artificial Intelligence (AAAI). Industry Affiliations  I currently advise AI21 Labs, Auctionomics, OneChronos, and AnyLog. I have co-founded two companies: Kudu.ug and Meta-Algorithmic Technologies. In the past, I have consulted for Cryptic Labs, Qudos, Zynga, Trading Dynamics, Ariba, and Cariocas. I was scientific advisor to Vancouver-based Zite until it was acquired by CNN in 2011. Past Academic Affiliations In 2022 I was a long-term visitor at the Simons Institute program on Learning and Games at UC Berkeley. In 2018 I was a visiting researcher at Microsoft Research New York City and a visiting faculty member at both Technion IIT and Hebrew University of Jerusalem. In 2016 I was a long-term visitor at the Simons Institute program on Algorithms and Uncertainty at UC Berkeley, a visiting researcher at Microsoft Research New England, and a visiting faculty member at Harvard University. In 2015 I was a long-term visitor at the Simons Institute program on Economics and Computation at UC Berkeley. On my 2010–11 sabbatical I visited Makerere University in Kampala, Uganda, and Hebrew University of Jerusalem's Institute for Advanced Studies. I'm a former member of Yoav Shoham's Multiagent Group in the Artificial Intelligence Lab of Stanford University's Department of Computer Science. Editorial  I am an associate editor of the ACM Transactions on Economics and Computation (ACM-TEAC), and AI Access, and have served as associate editor of the Artificial Intelligence Journal (AIJ) and the Journal of AI Research (JAIR). I was General Chair for ACM-EC in 2023, Program Chair for AAAI in 2021, and Program Chair for ACM-EC in 2012. I was Chair of the ACM Special Interest Group on Electronic Commerce (SIG-Ecom) from 2015–2019 and a member of the Board of Directors of the International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS) from 2014–2020. Books  I coauthored Multiagent Systems: Algorithmic, Game-Theoretic, and Logical Foundations, and Essentials of Game Theory: A Concise, Multidisciplinary Introduction, both with Yoav Shoham. Prospective Graduate Students  For students not enrolled at UBC: please do not contact me directly; instead, apply to my department and indicate an interest in working with me. You can learn about my research area from my free online class. I am likely to take on new PhD students from outside UBC only when I am already familiar with their publications from conferences that I attend. I am more likely to take on other students for an MSc with the possibility of continuing to a PhD. For students who are already at UBC, please take my grad class and drop by GT-DT if you're interested in the intersection between artificial intelligence, heuristic optimization, and strategic behavior. Current Graduate Students My current grad students are Greg d'Eon, Devon Graham, Pierre Lardet, Raymond Liu, Taylor Lundy, and Narun Raman. Past Graduate Students and Postdocs My past PhD students are Chris Cameron (2024), Hedayat Zarkoob (2024), Neil Newman (2024), Jason Hartford (2021), James Wright (2016), David Thompson (2015), Lin Xu (2014), Baharak Rastegari (2013), Albert Xin Jiang (2011), Frank Hutter (2009). My past MSc students (excluding those already named who continued on to a PhD) are Yingsai Dong (2015), Steve Ramage (2015), Chris Thornton (2013), Chris Nell (2011), Ashiqur KhudaBukhsk (2009), Erik Zawadzki (2008), Asher Lipson (2005). My past postdocs are Lars Kotthoff (2017), Alice Gao (2017), Frank Hutter (2013). Last updated November 28, 2025",
  "content_length": 4511,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:28"
}