{
  "name": "Kevin Smith",
  "homepage": "https://www.kth.se/profile/ksmith",
  "status": "success",
  "content": "KTH | Kevin Smith Skip to main content Kevin SmithProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/ksmithDetailsWorks for Division of Computational Science and TechnologyTelephone +46 8 790 64 37Unit address Lindstedtsvägen 5E-mail ksmith@kth.seResearcherResearcher IDGoogle Scholar IDAbout meI am a professor of computer vision and biomedical image analysis with the KTH Royal Institute of Technology and the Science for Life Laboratory. I lead the Computer Vision and Biomedical Image Analysis group and direct the Bioimage Informatics Facility node in Solna, part of Sweden’s national infrastructure for life science data. Before joining KTH, I held research positions at ETH Zürich and EPFL. Research My research sits at the intersection of machine learning, medicine, and biology. I’m interested in how to build learning systems that generalize across settings, adapt to new data, and collaborate effectively with human experts, especially in domains where data are scarce and uncertainty matters. We work across several areas: Joint Human-AI Systems Models that complement human reasoning and integrate into clinical workflows, enabling more accurate, trustworthy decisions. Model Adaptation and Generalization Methods to adapt models efficiently to new tasks and domains, especially where retraining is impractical. Learning with Limited Supervision Strategies to learn from partial, noisy, or sparse labels—critical in both medical and biological data. Interpretability and Uncertainty Estimation Techniques to explain decisions and quantify model confidence and flag unreliable predictions, improving trust and human-AI interaction. Generative Modeling Models for synthesizing and reconstructing images, supporting data augmentation, modality translation, and analysis. Inverse Problems Learning-based approaches for denoising, deblurring, and image reconstruction. Our work combines foundational machine learning with close collaboration in medicine and biology. We partner with clinicians at Karolinska Institutet and researchers at AstraZeneca, and have developed AI systems tested in real-world clinical trials for cancer screening. Positions PhD, postdoc, and engineering positions with my group are announced on the KTH jobs page. Please apply through the job portal, do not contact me directly. Students enrolled at KTH interested in working on their MSc thesis are invited to contact me. Possible subjects for the MSc thesis with my research group include: Analysis of medical imaging data (diagnostic classification, segmentation, etc) Inverse problems such as denoising or super resolution in microscopy data Outlier detection in biomedical data Risk prediction Addresses Postal Science for Life Laboratory Box 1031 17121 Solna, Sweden Visiting Tomtebodavägen 23A 17165 Solna, Sweden KTH Main Campus (I am not here) Lindstedtsvägen 3,5 (Plan 4) 100 44 Stockholm, Sweden CoursesApplied Programming and Computer Science, Part 2 (DD1324), examiner, course responsibleDeep Learning Methods for Biomedical Image Analysis (FDD3020), examinerFoundations of Machine Learning (DD1420), teacher, course responsible, examinerProgram Integrating Course in Machine Learning (DD2301), teacherSurvey group on select topics in computer science (FDD3021), examinerPublicationsPublication listLinksGoogle Scholar profileLinkedIn",
  "content_length": 3343,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:38"
}