{
  "name": "Kevin Ponto",
  "homepage": "https://pages.discovery.wisc.edu/~kponto",
  "status": "success",
  "content": "Home | Kevin Ponto Kevin Ponto Professor, University of Wisconsin-Madison Light Dark I am a professor in at the Wisconsin Institute for Discovery (WID) and in the Design Studies Department in The School of Human Ecology at the University of Wisconsin-Madison. My research revolves around the utilization of virtual, mixed and augmented reality to simulate the experience of real-life spaces for real-world outcomes. My long-term goal is to develop new technologies, tools and methods to bridge the physical/digital divide. Hear my thoughts on the Badger Talks Podcast Posts UW–Madison Team Receives $1 Million NSF Grant Oct 20, 2025 About 1 min A research team at the University of Wisconsin–Madison’s School of Human Ecology, led by Associate Professor Kevin Ponto, has received a $1 million grant from the National Science Foundation (NSF). This grant will support their work in developing new virtual and augmented reality technologies. You can read the full story on the School of Human... Read More UW Tech Exploration Lab student projects highlight innovation, emerging technologies May 19, 2025 About 1 min Bold ideas, creative problem-solving, and community impact were on full display in the 24 student projects recently launched at the UW Tech Exploration Lab. A partnership between the Wisconsin School of Business and the Wisconsin Institute for Discovery, the lab provides a space for multidisciplinary students to experiment with emerging technolo... Read More #AI#student projects#entrepreneurship App under development at UW could make it easier, more affordable to 'age in place' Apr 17, 2025 About 1 min Using augmented reality, UW–Madison researchers are developing an app to improve the safety and quality of life for older adults who want to “age in place.” The innovation, called the Augmented Reality Home Assessment Tool, or ARHAT, aims to provide a more affordable and community-based approach to home safety assessments. The app is currently ... Read More #aging#technology#augmented reality#accessibility OnWisconsin Magazine Aug 28, 2023 About 1 min This Wisconsin Alumni magazine has done a recent short piece on the Virtual Reality course I created here on campus: https://onwisconsin.uwalumni.com/courses-on-the-cutting-edge/ Read More #magazine#uwalumni#news#onwisconsin SoHE Researcher Spotlight Jul 28, 2023 About 1 min Researcher Spotlights are Q&As that shine a light on School of Human Ecology faculty members’ unique scholarship and research interests. Read my responses here: https://humanecology.wisc.edu/researcher-spotlights-kevin-ponto-design-studies-associate-professor/ Read More #article#QA#news#sohe Free Download of Our Book Chapter Mar 08, 2023 About 1 min Our bookchapter, “Augmented Reality into Live Theatrical Performance” by Dan Lisowski, Kevin Ponto, Shuxing Fan, Caleb Probst & Bryce Sprecher in the Springer Handbook of Augmented Reality is currently available for free at: https://bit.ly/3kxmOuu Read More #bookchapter CAVE Tour Feb 23, 2023 About 1 min The Virtual Environments Group is offering free CAVE tours to show off plant tomograms in VR on Wednesday, March 1st, from 1 PM to 6 PM. This work is produced under an NSF funded project led by Dr. Marisa Otegui of the Department of Botany. The tours will occur in 20 minute intervals with a maximum of 8 people per group. The lab is in the Wisc... Read More #CAVE Moments in Time: Photographers' Choice 2015 Dec 31, 2015 About 1 min Each year, UW-Madison’s University Communications photographers, Jeff Miller and Bryce Richter, capture thousands of moments that define campus life. In their 2015 “Moments in Time” feature, they highlighted a selection of photographs that showcase the university’s diverse and vibrant community. I made it into this years set of images: Read the ... Read More #photography#year in review#campus life#student life Kevin Ponto Audrey Rothermel Bascom Professor Associate Professor University of Wisconsin-Madison kevin.ponto@wisc.edu 608-316-4330 Wisconsin Institute for Discovery 330 N. Orchard St. Madison, WI 53715 0000-0003-4156-9693 Google Scholar",
  "content_length": 4123,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:29"
}