{
  "name": "Kevin Moran",
  "homepage": "https://www.kpmoran.com",
  "status": "success",
  "content": "Kevin Moran Ph.D. Contact MePlease direct all correspondence to my email address on my home page, or by filling out this contact form. Thank you! 4400 University Drive MSN 4A5 Fairfax, VA, 22030 USA Kevin Moran is an Assistant Professor in the Department of Computer Science at the University of Central Florida where he is also affiliated with the Cyber Security and Privacy Cluster (CyberSP) and directs the SAGE Research Lab. He was previously an Assistant Professor at George Mason University from 2020-2023. He graduated with his B.A. in Physics with a Computer Science Minor from the College of the Holy Cross in 2013. He graduated with his M.S. in Computer Science from William & Mary in 2015, and his Ph.D. in Computer Science from William & Mary in 2018, advised by Dr. Denys Poshyvanyk. His main research interests include software engineering, security, maintenance, and evolution with a focus on mobile platforms. Additionally, he explores applications of machine learning to data mined from software repositories in order to build practical automated tools for developers. Kevin Moran Ph.D. Info Email Search Home This is the academic home page of Kevin Moran Ph.D. Dr. Moran conducts research in the fields of software engineering, machine learning, and computer security as a Post-Doctoral Fellow at William & Mary. He has published numerous papers at top conferences and journals in the field of software engineering. About:Kevin Moran is an Assistant Professor in the Department of Computer Science at the University of Central Florida where he is also affiliated with the Cyber Security and Privacy Cluster (CyberSP) and directs the SAGE Research Lab. He was previously an Assistant Professor at George Mason University from 2020-2023. He graduated with his B.A. in Physics with a Computer Science Minor from the College of the Holy Cross in 2013. He graduated with his M.S. in Computer Science from William & Mary in 2015, and his Ph.D. in Computer Science from William & Mary in 2018, advised by Dr. Denys Poshyvanyk.  His main research interests include software engineering, security, maintenance, and evolution with a focus on mobile platforms. Additionally, he explores applications of machine learning to data mined from software repositories in order to build practical automated tools for developers. He is a recipient of the NSF CAREER Award and multiple Distinguished Paper Awards at top Software Engineering and Computer Security Conferences. Contact Info:Office: Harris Engineering Center, Room 217A, Orlando, FL, 32816Office Hours: By appointment (for Summer 2025)Email: kpmoran [at] ucf [dot] eduPhone: (407)-823-3219Calendar: Click here to view my Public Calendar Prospective Students:I am generally always open to recruiting outstanding students who are interested in research at the intersection of software engineering and machine learning. Please visit my prospective students page for more information. Connect with Me: Latest News:-January 2025: I have received the NSF CAREER Award for advancing the future of UI Engineering!! Thank you to all my students and collaborators who have contributed to the work that helped form this proposal!!-January 2025: One technical paper on Automatically Assessing Bug Report Quality accepted to ICPC’25!!! Congrats to Sage Lab member Junayed!!-December 2024: The Sage Lab has received a research award from Apple’s Human-Centered Machine Learning group for our work on UI Engineering!!-December 2024: One technical paper on IoT Testing Practices accepted to ICST’25!! Congrats to Sage Lab member Safwat!!-November 2024: SAGE Lab PhD student Atish won 1st place in the ACM Student Research Competition at ASE’24 🏆 for his work on LLM Understanding of Code Stylometry!! Congrats Atish!!-July 2024: One technical paper on Mapping Bug Reports to UI Screens accepted to ISSTA’24!! Congrats to Sage Lab Member Junayed, and collaborators Antu, Yang, Ying, and Oscar!!-May 2024: Our IEEE S&P’24 paper on Industry Perspectives of Static Analysis Tools for Security has received a distinguished paper award (awarded to 9 out of 1,463 submissions)!!! 🏆 Congrats to SAGE Lab collaborator Amit!! Award Photo!-March 2024: One journal paper accepted to IEEE TSE on building a Theory of Causation for Interpreting Neural Models of Source Code!! Congrats to SAGE Lab Collaborators David, Alejandro, and Nathan!! If you are interested in Interpretability for LLMs of code, check out this paper!-January 2024: One technical paper on Neural Code Understanding for Impact Analysis accepted to FSE’24!! Congrats to SAGE Lab collaborators Yanfu Yan and Nathan Cooper!! This paper is also a collaboration with Cisco Systems!!-January 2024: Junayed Mahmud has received the Outstanding Graduate Creative Work Award from UCF CECS for his paper, “On Using GUI Interaction Data to Improve Text Retrieval-based Bug Localization”!! Congrats Junayed!! Click for More News",
  "content_length": 4917,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:22"
}