{
  "name": "Kevyn Collins-Thompson",
  "homepage": "http://www-personal.umich.edu/~kevynct",
  "status": "success",
  "content": "Kevyn Collins-Thompson's HomePage Kevyn Collins-Thompson Associate Professor of Information Associate Professor of Electrical Engineering and Computer Science University of Michigan School of Information and College of Engineering (affiliate) Phone: +1-734-615-2132 Fax: +1-734-615-3587 Email: kevynct AT umich . edu Mailing Address: School of Information 3344 North Quad 105 S. State Street Ann Arbor, MI 48109-1285 I am an associate professor with tenure at the University of Michigan (Ann Arbor), with appointments in the School of Information and College of Engineering, Dept. of Electrical Engineering and Computer Science (affiliate, CSE Division). I am also an affiliate faculty member of the Artificial Intelligence Lab and the Michigan Institute for Data Science (MIDAS). From 2022 to 2025 I was the academic director of the Masters of Applied Data Science program, the largest online degree program at the University of Michigan. Spanning 20 years of academic and industry research, my work blends information retrieval, machine learning, natural language processing, and large-scale data mining to optimally connect people with information, especially to help them learn and discover. If you're interested in joining my lab as a graduate student, please apply through the regular admissions process (in either Information or Computer Science) and mention my name and your connection to my lab's research areas in your graduate school application. Unfortunately, I cannot respond to individual emails. News Jan 15 2025: I've been named one of 20 Innovation Champions across the University of Michigan campus system, who are faculty innovators chosen for their \"passion and dedication to advancing innovation\" and significant activity in the university's research commercialization ecosystem. My startup company LearningClues co-founded with Prof. Perry Samson, is bringing adaptive, effective AI tools to instructors and students across the country. Feb 15 2022: I've been appointed the next academic director for online programs, including the Master of Applied Data Science program at the University of Michigan, starting June 1, 2022. Dec 15 2020: I've been named an ACM Distinguished Member \"for outstanding scientific contributions to computing\". Thanks to my wonderful students and other collaborators. For my sabbatical year 2019-2020 I was a visiting researcher in France at Inria, France's national research institute for computer science. Sept 1 2019: Honored to receive the Michael D. Cohen Outstanding Service Award from the University of Michigan School of Information. June 30 2019: I'll be a keynote speaker at LILE 2019, Learning and Education with Web Data, collocated with ACM WebSci 2019, Boston. Oct 1 2018: Qiaozhu Mei and I received an ACM Recognition of Service Award for our work as General Chairs of ACM SIGIR 2018 in Ann Arbor. July-August 2018: Visiting researcher at Microsoft Research AI. Mar 15 2018: My PhD student Rohail Syed has won a Best Student Paper award at the ACM SIGIR Conference on Human Information Interaction and Retrieval (CHIIR). Mar 15 2018: I've been named co-winner of Coursera's Outstanding Educator Award. Feb 12-13, 2018: Visiting RMIT Computer Science, Melbourne, Australia. Feb 5 2018: Participating in the VC/Industry Day panel at WSDM 2018 (Los Angeles) on academic vs industry careers. Oct 27 2017: I'll be presenting recent research at Carnegie Mellon's LTI Colloquium on Fri. Oct 27. Feb 2017: Here's the homepage for our Dagstuhl Seminar on Searching as Learning, co-organized with Claudia Hauff and Preben Hansen. Older news Major contributions Pioneered the use of statistical machine learning to predict text difficulty, with an extensive body of research on varied aspects of this problem. My 2008 PhD dissertation introduced risk-aware information retrieval. In my paper published at NeurIPS 2008, I showed how convex optimization problems inspired by portfolio theory and methods from financial risk modeling could be used to create and evaluate robust search and recommender systems. By formulating risky operations like query expansion as robust convex optimization problems, I showed how systems could achieve much better worst-case performance with little or no reduction in strong average-case performance. I am fascinated by how people learn language. With cognitive psychology colleagues, we published a series of papers over time on effective strategies for learning new vocabulary from context, and we've applied our research to helping middle-school kids in Atlanta and Pittsburgh improve their literacy skills. My group has also helped establish the new field of searching as learning, and we published the first search engine ranking algorithm to incorporate a cognitive model of content difficulty along with general relevance. Research directions My general research approach focuses on human-centered scenarios in machine learning, like systems that can help improve a child's literacy skills. These human-centered problems are often not well-solved by traditional machine learning frameworks whose optimization objectives ignore (for example) human cognitive abilities in processing information. To address this, my collaborators and I formalize new types of learning optimization problems that can also account for important external goals, constraints or sources of difficulty or uncertainty, develop practical algorithms to solve the theoretical problem (approximately) that are tractable and deployable, and then conduct user lab studies or large-scale online experiments to assess the real-world success of the approach (and iterating if necessary, based on what we learned). Example products of my research have included include search engines that can deliver the right kind of personalized information at the right time, and intelligent tutoring systems that learn when and how to be most helpful in teaching a particular student. Building effective, reliable systems like these will require new theoretical, algorithmic, and methodological advances in multiple research areas, including machine learning, optimization, information retrieval, and human-computer interaction. My current research is centered on education, but I'm also interested in mobile and health-related applications. Brief bio Before joining the University of Michigan in Fall 2013, I was a researcher at Microsoft Research, in the Context, Learning, and User Experience for Search (CLUES) Group. My Ph.D. is from the School of Computer Science at Carnegie Mellon University, where my advisor was Jamie Callan I was a member of the Language Technologies Institute. My undergraduate degree is a B.Math. in Computer Science from the University of Waterloo. Apparently, I'm not the only one who thinks that CMU and Waterloo are a great combination! Publications 2023-24 Michael Ion, Sumit Asthana, Fengquan Qiao, Tianyi Wang and Kevyn Collins-Thompson (2025) Adaptive Knowledge Assessment in Simulated Coding Interviews. Proceedings of iRAISE 2025: Innovation and Responsibility for AI-Supported Education at the 39th AAAI Annual Conference on AI. Philadelphia, USA.(pdf) Dima El Zein, Ryan Burton, Arpitha Ghanate, Celia da Costa Pereira and Kevyn Collins-Thompson (2024) A Qualitative Exploration of Conversational LLM Assistance for Technical Reading. Proceedings of Educational Data Mining 2024 Workshop on Writing and Literacy Instruction. Atlanta, USA. T. Arif, S. Asthana, K. Collins-Thompson. (2024) Generation and Assessment of Multiple-Choice Questions from Video Transcripts using Large Language Models. Proceedings of Learning@Scale 2024. Atlanta, USA. (pdf) S. Asthana, K. Collins-Thompson. (2024) Towards Educational Theory of Mind for Generative AI: A Review of Related Literature and Future Opportunities. Proceedings of CHI 2024 Workshop on Theory of Mind in Human-AI Interaction. Honolulu, Hawaii. (pdf) S. J. Nam, K. Collins-Thompson, D. Jurgens, X. Tong. (2024) Finding Educationally Supportive Contexts for Vocabulary Learning with Attention-Based Models. Proceedings of LREC-COLING 2024. (pdf) S. Asthana, T. Arif, K. Collins-Thompson. (2023) Field experiences and reflections on using Large Language Models to generate comprehensive lecture metadata. Proceedings of the NeurIPS'23 Workshop on Generative AI for Education (GAIED). (pdf) 2022 S. Nam, D. Jurgens, G. Frishkoff, K. Collins-Thompson. (2022) An Attention-Based Model for Predicting Contextual Informativeness. ArXiv preprint R. Burton, K. Collins-Thompson. Visualisation to Aid Decision-Making for Time-Quality Tradeoffs in Search. IQIIR 2022 Workshop, ACM CHIIR 2022. (pdf) (Full paper) 2021 McCarthy, K. S., Crossley, S. A., Meyers, K., Boser, U., Allen, L. K., Chaudhri, V. K., Collins-Thompson, K., et al. (2021). Toward more effective and equitable learning: Identifying barriers and solutions for the future of online education. Technology, Mind, & Behavior. 2020 Rohail Syed, Kevyn Collins-Thompson, Paul Bennett, Mengqiu Teng, Shane Williams, Wendy Tay and Shamsi Iqbal. Improving Learning Outcomes with Gaze Tracking and Automatic Question Generation. Proceedings of The Web Conference 2020 (WWW 2020). Taipei, Taiwan. (pdf) (Full paper) 2019 U.S. Patent 10,579,652. Learning and using contextual content retrieval rules for query disambiguation. M. DeJonckheere, L. Nichols, V.G. Vydiswaran, X. Zhao, K. Collins-Thompson, K. Resnicow, T. Chang. Using Text Messaging, Social Media, and Interviews to Understand What Pregnant Youth Think about Weight Gain During Pregnancy. J. Medical Inform. Formative Research. 2019 Apr 1;3(2):e11397. doi: 10.2196/11397 2018 Jin Shang, Mingxuan Sun, and Kevyn Collins-Thompson. Demographic Inference via Knowledge Transfer in Cross-Domain Recommender Systems. Proceedings of ICDM 2018. Singapore, 2018, pp. 1218-1223.doi: 10.1109/ICDM.2018.00162 Nalin Chhibber, Rohail Syed, Mengqiu Teng, Joslin Goh, Kevyn Collins-Thompson and Edith Law. Human Perception of Surprise: A User Study. SIGIR 2018 CompS18 W",
  "content_length": 33719,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:34"
}