{
  "name": "Kexin Pei",
  "homepage": "https://cs.uchicago.edu/people/kexin-pei",
  "status": "success",
  "content": "Kexin Pei – Department of Computer Science Skip to content Contact Info Email kpei@uchicago.edu Website https://sites.google.com/site/kexinpeisite/ Office JCL 260 Kexin is an Assistant Professor of computer science. His research lies at the intersection of Security, Software Engineering, and Machine Learning, focusing on developing data-driven program analysis approaches to improve the security and reliability of traditional and AI-based software systems. He gets most excited about developing machine learning models that can reason about program structure and behavior to precisely and efficiently analyze, detect, and fix software bugs and vulnerabilities. His research has received the Best Paper Award in SOSP, a Distinguished Artifact Award, been featured in CACM Research Highlight, and won CSAW Applied Research Competition Runner-Up. He works with Learning for Code team at Google DeepMind, building program analysis tools based on large language models. Kexin received his Ph.D. in Computer Science from Columbia University. Focus Areas: Machine Learning for Code, Program Analysis, Software Security and Reliability Research AI & Machine Learning Foundations and applications of computer algorithms making data-centric models, predictions, and decisions Security & Privacy Understanding and defending against emerging threats in our increasingly computational world Systems, Architecture & Networking Design and analysis of computing systems: cloud, edge, Internet, quantum, and beyond Awards & Honors 2024 Neubauer family assistant professorship 2023 Google conference scholarship 2019 CACM research highlight 2018 CSAW applied research competition runner-up among top-10 finalists arrow-down-largearrow-left-largearrow-right-large-greyarrow-right-large-yellowarrow-right-largearrow-right-smallbutton-arrowclosedocumentfacebookfacet-arrow-down-whitefacet-arrow-downPage 1CheckedCheckedicon-apple-t5backgroundLayer 1icon-google-t5icon-office365-t5icon-outlook-t5backgroundLayer 1icon-outlookcom-t5backgroundLayer 1icon-yahoo-t5backgroundLayer 1internal-yellowinternalintranetlinkedinlinkoutpauseplaypresentationsearch-bluesearchshareslider-arrow-nextslider-arrow-prevtwittervideoyoutube",
  "content_length": 2201,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:33"
}