{
  "name": "Keze Wang",
  "homepage": "https://kezewang.com",
  "status": "success",
  "content": "Keze Wang (王可泽) Biography Currently, I am an Associate Professor at the School of Computer Science and Engineering at Sun Yat-sen University. Previously, I was a postdoctoral scholar in Prof. Song-Chun Zhu's VCLA lab at UCLA. Before that, I was a research scientist at the Human Cyber Physical Intelligence Integration Lab of Sun Yat-sen University, advised by Prof. Liang Lin and Prof. Hui Cheng. I obtained dual PhD awards in the Department of Computing of the Hong Kong Polytechnic University in March 2019, advised by Prof. Lei Zhang. I obtained my Ph.D. degree with honors from the School of Data and Computer Science at Sun Yat-sen University in December 2017, advised by Prof. Liang Lin. I also received a BE degree with honors from Sun Yat-sen University. I am recruiting self-motivated Ph.D / Master students in computer vision and machine learning. If you are interested in, please directly send me your resume. Email: kezewang(at)gmail.com [Github] [Google Scholar] [中文版] News Six papers (One oral paper) have been accepted by AAAI 2026. The paper and source code will be released soon! Four papers have been accepted by NeurIPS 2025. The paper and source code will be released soon! I am honored to serve as an Area Chair for ICLR 2026. Four papers (One main conference and three findings) have been accepted by EMNLP 2025. The paper and source code will be released soon! One paper is accepted by TMM 2025. The source code is available. One paper is accepted by ICML 2025. The paper is available. The source code is available. One paper is accepted by KDD 2025. The paper is available. The source code is available. One paper is accepted by CVPR 2025. The paper is available. The source code is available. One paper is accepted by AAAI 2025. The paper is available . The source code is available. One paper is accepted by TMM 2024. Three papers have been accepted by AAAI 2024. One paper is accepted by TPAMI 2023. One paper is accepted by TMM 2023. One paper is accepted by TIP 2022. Our journal work on Explainable AI (X-ToM) is accepted in iScience Cell Press Journal 2022. One paper is accepted by TIP 2021. One paper is accepted by EMNLP 2021. Two papers have been accepted by ICCV 2021. The paper and source code will be released soon! One paper is accepted by ICRA 2021. The source code is available. One paper is accepted by TNNLS 2021. The proposed dataset is available. Research Interest Complex Visual Reasoning via Causal Cognition Multi-Agent Collaborative Higher-Order Reasoning Multimodal Productive AI Embodied Intelligence Recently, AI powered by large-scale models has advanced at an extraordinary pace, reshaping language, vision, and multimodal intelligence. However, the existing large models still fall short in universality, interpretability, and reliability. These limitations hinder real-world impact and challenge the very future of AI. Facing this defining moment, we have to push forward with bold theoretical breakthroughs and ambitious practical innovation. Our mission is to forge a new paradigm for multimodal learning and reasoning, fundamentally upgrading the generality, robustness, and cognitive depth of large models. We aim to build systems that truly understand across modalities and possess human-like abilities in causal reasoning, logic, and analogical thinking. This is more than research, i.e., it is a technological mission for the next era. We strive to help AI rise from a “powerful tool” to a “trusted intelligent partner”, driving humanity toward a smarter and more inspiring future. Academic Services Managing Editor for Image and Vision Computing Associate Editor for The Visual Computer The Journal of Visual Communication and Image Representation Area Chair for ACL ICLR 2026 Reviewer for IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) IEEE Transactions on Neural Networks and Learning Systems (TNNLS) IEEE Transactions on Medical Imaging (TMI) IEEE Transactions on Circuits and Systems for Video Technology (TCSVT) IEEE Transactions on Image Processing (TIP) IEEE Transactions on Multimedia (TMM) Pattern Recognition (PR) Neural Networks Neurocomputing Autonomous Robots (AURO) Applied Sciences International Conference on Learning Representations (ICLR) 2023 International Conference on Computer Vision and Pattern Recognition (CVPR) 2018, 2019, 2020, 2021, 2023 European Conference on Computer Vision (ECCV) 2020 Neural Information Processing Systems (NeurIPS) 2020 AAAI Conference on Artificial Intelligence (AAAI) 2019, 2020, 2021 IEEE International Conference on Computer Vision (ICCV) 2019, 2021 IEEE International Conference on Robotics and Automation (ICRA) 2021 International Joint Conference on Artificial Intelligence (IJCAI) 2018, 2019, 2020 Winter Conference on Applications of Computer Vision (WACV) 2021 Asian Conference on Computer Vision (ACCV) 2018 International Conference on Pattern Recognition (ICPR) 2020 Selected Honors & Awards 2022 AI 2000 Most Influential Scholar Award Honorable Mention 2019 Chinese Association for Artificial Intelligence (CAAI) Best Doctoral Dissertation Award 2017 Student travel grant, awarded by SIGMM and ACM Multimedia 2017 2016 Graduate National Scholarship 2015 Graduate National Scholarship 粤ICP备17051736号-1",
  "content_length": 5252,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:32"
}