{
  "name": "Kezhi Wang",
  "homepage": "https://www.brunel.ac.uk/people/kezhi-wang",
  "status": "success",
  "content": "Professor Kezhi Wang | Introduction | Brunel University London Skip to Content Home People Professor Kezhi Wang Professor Kezhi WangProfessor Wilfred Brown 217 Email: kezhi.wang@brunel.ac.uk Tel: +44 (0)1895 265094 Google Scholar Computer Science College of Engineering, Design and Physical Sciences Summary Royal Society Industry Fellow Highly Cited Researcher by Clarivate Web of Science (2023, 2024, 2025) IEEE Communications Society Leonard G. Abraham Prize IEEE Communications Society Heinrich Hertz Award IEEE Communications Society Fred W. Ellersick Prize Top 2% Scientist of the World Rising Star of Science Award, Research.com, 2025 ScholarGPS (2025):  Highly Ranked Scholar - Prior Five Years, All Fields: #863; Engineering: #398; Computer Science: #88; UAV: #18 Distinguished Visiting Fellowship, The Royal Academy of Engineering EU MSCA Doctoral Networks ANT EU MSCA Postdoctoral Fellowship S-ISAC Chancellor’s International Scholarship, University of Warwick JSPS Invitational Fellowship Distinguished Lecturer, IEEE Vehicular Technology Society 150+ IEEE Journals, citation 15,000+, h-index: 59 (Google Scholar) Committee on Drones Member, IEEE Vehicular Technology Society Workshops and Symposia Officer, IEEE Reconfigurable Intelligent Surfaces Emerging Technology Initiative 5+ Clarivate ESI hot papers (0.1%); 18+Clarivate ESI highly cited papers (1%), 25+ Popular papers (IEEE Explore), 4 Patents Nomination for Young Author Best Paper Award by MLST TC, IEEE Signal Processing Society, 2023 Nomination for Best Paper Award by SAM TC, IEEE Signal Processing Society, 2024 Publication in IEEE Transactions on Signal Processing has been Highlighted by the IEEE Signal Processing Society PhD examiner for the KCL, Glasgow, Sheffield, Aberdeen, Exeter, Aston, Essex, KTH, IIIT-Delhi, UNSW-Australia, etc Proposal Reviewer for the Austrian Science Fund, Israel Science Foundation, UKRI, EPSRC, Royal Society, RGC, etc IEEE Senior Member, HEA Fellow, EPSRC Associate College Member, and UKRI Talent Peer Review College Member (Co-) supervised several PhD students to completion, most of whom are now working at prestigious Universities/Industries across the UK and the world. External supervisor for many students, e.g., @Newcastle University and QMUL, UK. Associate Editor for IEEE Transactions on Vehicular Technology, IEEE Wireless Communications Letters, and IEEE Access; serves/served as a Lead/Guest Editor for many international journals and TPC Track Chair/Publicity Co-Chair/Session Chair/TPC member for many conferences. Invited as a reviewer for many international journals, e.g., IEEE Transactions, and for Books from Elsevier, Taylor & Francis, Wiley, Springer, etc. Invited to talk at 20+ universities and organizations, such as IEEE ComSoc School Series UK and Ireland, University of Exeter, University of Tunis, and SAP. All the students/research fellows in my group will have a lot of opportunities to collaborate with our national and international partners in Europe, Canada, and Australia. The students will conduct Secondments (up to 12 Months in their study, fees will be covered) to prestigious universities including KTH, Sweden, University of Göttingen, Germany, TU/e and TU Delft, Netherlands, University of Alberta, Canada, University of Sydney, Australia and many others, via our EU Horizon Europe HarmonicAI and COVER, and Royal Society International exchange projects. If you are interested in pursuing a PhD with me or joining my group, e.g., as an EU MSCA Postdoctoral Fellow or Newton International Fellow, please do not hesitate to email me your CV.",
  "content_length": 3595,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:37"
}