{
  "name": "Khai Nhut Truong",
  "homepage": "http://www.cs.toronto.edu/~khai",
  "status": "success",
  "content": "Khai N. TRUONG about me | research interests | selected publications | teaching | advisees | professional activities Khai N. TRUONG Professor Department of Computer Science University of Toronto CONTACT information 40 St. George Street, Room 7268 Toronto, Ontario, CANADA, M5S 2E4 Phone: +1 (416) 978-4761 Email: khai@cs.toronto.edu ABOUT me I am a Professor in the Department of Computer Science at the University of Toronto. I received my Bachelor degree in Computer Engineering from the School of Electrical and Computer Engineering and my Ph.D. degree in Computer Science from the College of Computing at the Georgia Institute of Technology. RESEARCH interests My research interests are in human-computer interaction (HCI) and ubiquitous computing (Ubicomp). I investigate tools and methods to support the development of novel ubiquitous computing systems and techniques and models to facilitate user interactions with off-the-desktop computing devices and services. Much of my current work focuses on the design and evaluation of health and assistive technologies. Selected PUBLICATIONS The following is a list of some of my recent publications from the last 5 years: de Lacerda Pataca, C.*, Ahn, S.*, Yoo, S.*, Kim, J., Truong, K. N., Hong, J., Peiris, R. L., & Huenerfauth, M. CuCap: Comparative Analysis of Customized Captioning between North American and South Korean d/Deaf and Hard-of-Hearing Users. In Proceedings Proc. ACM SIGACCESS Conference on Computers and Accessibility (ASSETS 2025), Article #, October 2025. doi: 10.1145/3663547.374640 Lin, G., Le, M.N., Truong, K.N., Mariakakis, A. The Cognitive Strategies Behind Multimodal Health Sensemaking: A Menstrual Health Tracking Case Study. In Proceedings of ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), Volume 9(3), Article 110, September 2025. doi: 10.1145/3749482 Li, B., Tauseef, S., Truong, K.N., Mariakakis, A. A Comparative Analysis of Information Gathering by Chatbots, Questionnaires, and Humans in Clinical Pre-Consultation. In Proceedings of the 2025 ACM Conference on Human Factors in Computing Systems (CHI), Article 639, April-May 2025. doi: 10.1145/3706598.3713613 Yoo, S., Truong, K.N., Kim, Y-H. ELMI: Interactive and Intelligent Sign Language Translation of Lyrics for Song Signing. In Proceedings of the 2025 ACM Conference on Human Factors in Computing Systems (CHI), Article 566, April-May 2025. doi: 10.1145/3706598.3713973 Lin, G., Lessar, P.W., Le, M.N., Li, B., Chevalier, F., Truong, K.N., Mariakakis, A. Functional Design Requirements to Facilitate Menstrual Health Data Exploration. In Proceedings of the 2024 ACM Conference on Human Factors in Computing Systems (CHI), Article 687, May 2024. doi: 10.1145/3613904.3642282 Li, B., Gross, O., Crampton, N., Kapoor, M., Tauseef, S., Jain, M., Truong, K.N., Mariakakis, A. Beyond the Waiting Room: Patient's Perspectives on the Conversational Nuances of Pre-Consultation Chatbots. In Proceedings of the 2024 ACM Conference on Human Factors in Computing Systems (CHI), Article 438, May 2024. doi: 10.1145/3613904.3641913 Lin, G., Siddiqui, R., Lin, Z., Blodgett, J.M., Patel, S.N., Truong, K.N., Mariakakis, A. Blood glucose variance measured by continuous glucose monitors across the menstrual cycle. In npj Digital Medicine, Volume 6, Article 140, August 11, 2023. doi: 10.1038/s41746-023-00884-x Lin, G., Li, J.Y., Fazly, A., Pavlovic, V., Truong, K.N. Identifying Multimodal Context Awareness Requirements for Supporting User Interaction with Procedural Videos. In Proceedings of the 2023 ACM Conference on Human Factors in Computing Systems (CHI), Article 761, April 2023. doi: 10.1145/3544548.3581006 Yoo, S., Lin, G., Byeon, H.J., Hwang, A.S., Truong, K.N. Understanding tensions in music accessibility through song signing for and with d/Deaf and Non-d/Deaf persons. In Proceedings of the 2023 ACM Conference on Human Factors in Computing Systems (CHI), Article 59, April 2023. doi: 10.1145/3544548.3581287 Li, B., Skoropad, T., Seth, P., Jain, M., Truong, K.N., Mariakakis, A. Constraints and Workarounds to Support Clinical Consultations in Synchronous Text-based Platforms. In Proceedings of the 2023 ACM Conference on Human Factors in Computing Systems (CHI), Article 342, April 2023. doi: 10.1145/3544548.3581014 Dai, J., Moffatt, K., Lin, J., Truong, K.N. Designing for Relational Maintenance: New Directions for AAC Research. In Proceedings of the 2022 ACM Conference on Human Factors in Computing Systems (CHI), Article 602, April 2022. doi: 10.1145/3491102.3502011 Li, F.M., Lu, C., Lu, Z., Carrington, P., Truong, K.N. An Exploration of Captioning Practices and Challenges of Individual Content Creators on YouTube for People with Hearing Impairments. In Proceedings of ACM on Human-Computer Interaction (PACMHCI), Volume 6, Issue CSCW1, Article 75, April 2022. doi: 10.1145/3512922 Chen, C., Wu, R., Khan, H., Truong, K.N., Chevalier, F. VIDDE: Visualizations for Helping People with COPD Interpret Dyspnea During Exercise. In Proceedings Proc. ACM SIGACCESS Conference on Computers and Accessibility (ASSETS 2021), Article 13, October 2021. doi: 10.1145/3441852.3471204 Li, B., Crampton, N., Yeates, T., Xia, Y., Tian, X., Truong, K.N. Automating Clinical Documentation with Digital Scribes: Understanding the Impact on Physicians. In Proceedings of the 2021 ACM Conference on Human Factors in Computing Systems (CHI), Article 658, May 2021. doi: 10.1145/3411764.3445172 Li, F.M., Chen, D.L., Fan, M., Truong, K.N. \"I Choose Assistive Devices That Save My Face\" A Study on Perceptions of Accessibility and Assistive Technology Use Conducted in China. In Proceedings of the 2021 ACM Conference on Human Factors in Computing Systems (CHI), Article 372, May 2021. doi: 10.1145/3411764.3445321 Zeng, S.Y., Wu, R., Truong, K.N., Chevalier, F. Evaluating the Gradual Delivery of Knowledge-focused and Mindset-focused Messages for Facilitating the Acceptance of COPD. In Proceedings of ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), Volume 4(4), Article 160, December 2020. doi: 10.1145/3432218 Hwang, A.S., Jackson, P., Sixsmith, A., Nygård, L., Astell, A., Truong, K.N., Mihailidis, A. Exploring How Persons with Dementia and Care Partners Collaboratively Appropriate Information and Communication Technologies. In ACM Transactions on Computer-Human Interaction (TOCHI), Volume 27(6), Article 46, 2020. doi: 10.1145/3389377 Courses I am TEACHING I am teaching or have taught the following courses recently: CSC318-Winter 2026: The Design of Interactive Computational Media CSC318-Fall 2024: The Design of Interactive Computational Media CSC309-Winter 2024: Programming on the Web CSC300-Winter 2022: Computers & Society CSC318-Winter 2020: The Design of Interactive Computational Media ADVISEES Current students: Mohammad Kianpisheh (Ph.D. student) Sue Yoo (Ph.D. student) Mitsuka Kiyohara (Undergrad student) Jaehyuk Choi (Visiting undergrad student) Kevin Mi (Undergrad student) Professional ACTIVITIES The following is some of my recent professional activities (a.k.a. service) from the last 5 years: Proceedings of ACM on IMWUT: Interactive, Mobile, Wearable, Ubiquitous Technologies Journal, Distinguished Papers Award Co-chair, 2021-2025 CHI: The ACM Conference on Human Factors in Computing Systems, Associate Chair for Papers Program (2024) ASSETS: The International ACM SIGACCESS Conference on Computers and Accessibility, Papers Program Committee Member (2020, 2025)",
  "content_length": 7486,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:34"
}