{
  "name": "Khaled N. Khasawneh",
  "homepage": "https://sites.google.com/view/knkhasawneh/khaled-n-khasawneh",
  "status": "success",
  "content": "Khaled N. Khasawneh | Associate Professor at GMUSearch this siteEmbedded FilesSkip to main contentSkip to navigationKHALED N. KHASAWNEHAssociate  Professor, Department of Electrical & Computer Engineering (ECE)Affiliated Faculty, Department of Computer Science (CS)Associate Director, Center for Trusted, Accelerated, and Secure Computing & Communications (C-TASC)Director, Computer Architecture, Machine Learning, and Security (CAMLsec) LabEmail: kkhasawn [AT] gmu [DOT] eduOffice: ENGR 3223Phone : (703) 993-5430Web Presence: BioKhaled N. Khasawneh is an associate  professor in the Department of Electrical and Computer Engineering at George Mason University. His research spans Computer Architecture, Security, and Machine Learning. His current research focuses on hardware support for security, microarchitecture security, machine learning security and privacy, and malware detection. His research has been recognized as Nature Electronics Research Highlight in 2018, received the Best Paper Award at WOOT in 2018, and was selected as a Top Pick in Hardware and Embedded Security in 2021. He completed his PhD in Computer Science at the University of California, Riverside (UCR) working with Professor Nael Abu-Ghazaleh. He earned his MS in Computer Science at Binghamton University and BS in Computer Engineering at Jordan University of Science and Technology (JUST).I am always looking for talented self-motivated students.  If you are interested to work with me on cutting edge research in systems security, please send me an email or stop by my office!NEWS AwardsTop Picks in Hardware and Embedded Security, 2021International Student Recognition Award, University of California, Riverside, 2019Best paper award at WOOT, 2018Dissertation Year Program award, University of California, Riverside, 2018-2019Dean’s Distinguished Fellowship, Bourns College of Engineering, University of California, Riverside, 2014-2016Dean's Honor List, Computer & Information Technology College, Jordan University of Science & Technology, 2009Professional ActivitiesTrack ChairICCD: 2022, 2023Publicity ChairASPLOS: 2024SEED: 2024PACT: 2024, 2025Program Committee MemberNDSS: 2026MICRO: 2020 (ERC), 2021 (ERC), 2022 (TPC), 2025ASPLOS: 2021 (ERC)SEED: 2021, 2022ICCD: 2020, 2021HASP: 2020, 2023GLSVLSI: 2020, 2023Top Picks in Hardware Security: 2023Invited ReviewerTransactions on Architecture and Code Optimization (TACO)IEEE Transactions on Computers (TC)IEEE Computer Architecture Letters (CAL)Computers & Security (COSE)Journal of Computer Security (JCS)IET Information SecurityEAI TransactionsJournal of Computer Science and Technology (JCST)Asian Hardware Oriented Security and Trust Symposium (AsianHOST), 2019Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2777,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:37"
}