{
  "name": "Khaled Bashir Shaban",
  "homepage": "http://qufaculty.qu.edu.qa/khaled-shaban",
  "status": "success",
  "content": "Dr. Khaled Bashir Shaban's Site موقع د. خالد بشير شعبان | Qatar University Faculty Site موقع أعضاء هيئة التدريس بجامعة قطر خالد شعبان Khaled Shaban بروفيسور، قسم علوم وهندسة الحاسب، كلية الهندسة، جامعة قطر Professor, Computer Science and Engineering Department, College of Engineering, Qatar University Home Research Teaching Contact © Khaled Bashir Shaban Home Profiles: LinkedIn Google Scholar ORCID Publons ResearcherID Scopus Semantic Scholar SciProfiles Web of Science ResearchGate Affiliations: Professor, April 22, 2021 – Present, Associate Professor, Feb. 22, 2016 – April 21, 2021, Assistant Professor, Aug. 31, 2008 – Feb. 22, 2016, Computer Science and Engineering Department, College of Engineering, Qatar University, Doha, Qatar. Adjunct Professor, Jun. 2021 – Jun. 2024, Adjunct Associate Professor, Jun. 2015 – May 2018, Jun. 1, 2018–May 31, 2021, Electrical and Computer Engineering, Faculty of Engineering, University of Waterloo, Waterloo, Canada. Affiliate Associate Professor, Apr. 1, 2019 – Mar. 31, 2022, and Nov. 2015 – Oct. 2018, Affiliate Assistant Professor, Nov. 2012 – Oct. 2015, Concordia Institute for Information Systems Engineering, Concordia University, Montreal, Canada. Adjunct Assistant Professor, Aug. 2012 – Jul. 2015, Electrical and Computer Engineering, School of Engineering, University of New Mexico, New Mexico, USA. Faculty R&D Affiliate, Sept. 2010 – Jul. 2014, Qatar Mobility Innovation Center (QMIC), Doha, Qatar. General Manager, Nov., 2017 – Present, Smart Pivoting LLC QSTP, Qatar Science and Technology Park (QSTP), Doha, Qatar Education: Ph.D., Electrical and Computer Engineering, Faculty of Engineering, University of Waterloo, Canada, 2006. M.Sc., Engineering Systems and Computing, School of Engineering, University of Guelph, Canada, 2002. B.Sc., Computer Science, Faculty of Science, University of Tripoli, Libya, 1996. Short Bio.: Khaled Bashir Shaban, a native of Libya, received his Bachelor’s degree in Computer Science in 1996 from the Faculty of Science at the University of Tripoli, Tripoli, Libya. From 1996 to 2000, he worked as a software developer and instructor for various industries and academic institutions. In 2000, he began a Master of Science program in Engineering Systems and Computing at the School of Engineering, University of Guelph, Canada. His thesis, titled “Information Fusion in a Cooperative Multi-agent System for Web Information Retrieval,” aimed to enhance the efficiency and relevance of web search tools. He completed the program and earned his degree in 2002. In 2003, Khaled enrolled in a PhD program in Electrical and Computer Engineering at the Department of Electrical and Computer Engineering, University of Waterloo, Canada. His research focused on applying text semantic understanding in document mining. His thesis was titled “A Semantic Graph Model for Text Representation and Matching in Document Mining.” During and after his graduate studies, he worked as a Research and Development Consultant through his company, Multimedia Paradise. He was awarded his PhD on October 24, 2006. Since September 2008, Dr. Khaled Shaban has been a faculty member at Qatar University in the Computer Science and Engineering Department, College of Engineering. In 2017, he established a startup company, Smart Pivoting LLC, at Qatar Science and Technology Park, where he currently serves as the General Manager. Dr. Shaban’s research experience spans both academic and industrial institutions, covering various domains in intelligent systems application and design. His MSc work focused on improving web information retrieval through multi-agent systems and information fusion, enhancing the efficiency and relevance of search tools. His PhD research introduced a formal semantic representation of linguistic inputs and developed a novel distance measure for determining similarities between document contents. Throughout his career, Dr. Shaban has been involved in numerous research and development projects, including natural speech understanding systems, advanced eLearning and mobile systems, and the application of sophisticated artificial intelligence, knowledge discovery, and data science techniques. He has also addressed several optimization problems across various fields. His work has been published in numerous international journals and conferences. As a business leader, Dr. Shaban drives the development of innovative products and services, helping clients and partners leverage technology to grow their businesses. Memberships: ACM Association for Computing Machinery (Life Member) ACM SIGACT  ACM Special Interest Group on Algorithms and Computation Theory ACM SIGART ACM Special Interest Group on Intelligence ACM SIGKDD ACM Special Interest Group on Knowledge Discovery and Data Mining IEEE Institute of Electrical and Electronics Engineers (Senior Member) IEEE CS  IEEE Computer Society IEEE CIS IEEE Computational Intelligence Society IEEE SMCS IEEE Systems, Man, and Cybernetics Society ACL Association of Computational Linguistics (Member) ACL SIGARAB Special Interest Group on Arabic Natural Language Processing",
  "content_length": 5124,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:37"
}