{
  "name": "Khalad Hasan",
  "homepage": "https://cmps.ok.ubc.ca/about/contact/mohammad-khalad-hasan",
  "status": "success",
  "content": "Mohammad Khalad Hasan Skip to main content Skip to main navigation Skip to page-level navigation Go to the Disability Resource Centre Website Go to the DRC Booking Accommodation Portal Go to the Inclusive Technology Lab Website Search Irving K. Barber Faculty of ScienceDepartment of Computer Science, Mathematics, Physics and Statistics Undergraduate Computer Science Data Science Environmental Analytics Mathematics Physics Statistics Undergraduate Student Resources Graduate Computer Science Data Science Mathematics Medical Physics Graduate Student Resources Graduate Student FAQs Research About Us Alumni Careers Contact & People News & Events BIRS Events Apply to UBC Undergraduate Graduate Science Home Home / About Us / Contact & People / Mohammad Khalad Hasan About Us Alumni Careers Contact & People News & Events Mohammad Khalad Hasan Associate Professor Computer Science, Data Science Office: SCI 260 Phone: 250.807.8077 Email: khalad.hasan@ubc.ca Graduate student supervisor Research SummaryHuman-computer interaction, mobile and wearable (e.g., smartwatches, smart glasses) user interfaces, augmented/virtual/mixed reality, information visualization, gesture interaction, computer vision, machine learning, navigation interfaces, input devices. Courses & TeachingHuman-computer interaction, user interfaces, collaborative software development, scripting and reporting, data analytics. BiographyI am an Associate Professor in Computer Science at the University of British Columbia (Okanagan campus). I received my PhD and MSc from the University of Manitoba where I was supervised by Dr. Pourang Irani. After my PhD, I joined the Cheriton School of Computer Science at the University of Waterloo as an NSERC postdoctoral fellow, working with Dr. Edward Lank. I received my B.Sc. engineering degree from Shahjalal University of Science & Technology (SUST), Bangladesh. My research interest is in Human-Computer Interaction (HCI), with a focus on interactions with mobile and wearable devices. More specifically, I am interested in exploring user needs and limitations while interacting with mobile and wearable devices, designing new interaction techniques to facilitate the needs and help users to overcome the limitations. Websitespeople.ok.ubc.ca/mkhasan/ DegreesPhD University of Manitoba Research Interests & ProjectsAD-Binning: Leveraging Around-Device Space for Storing, Browsing and Retrieving Mobile Device Content A-Coord Input: Augmented Pen-Based Interactions by Combining Auxiliary Input Channels Acceptance Studies of Around-Device Gestures in and for Public Settings Comparing Direct Off-Screen Pointing, Peephole, and Flick&Pinch Interaction for Map Navigation EdgeSplit: Facilitating the Selection of Off-Screen Objects Selected Publications & PresentationsDavid Ahlström, Khalad Hasan, Edward Lank, Robert Liang. 2018. TiltCrown: Extending Input on a Smartwatch with a Tiltable Digital Crown. In Proceedings of the 17th International Conference on Mobile and Ubiquitous Multimedia (MUM 2018). Cairo, Egypt. ACM. 9 Pages. [pdf] (To appear) Fouad Alallah, Ali Neshati, Yumiko Sakamoto, Khalad Hasan, Edward Lank, Andrea Bunt, Pourang Irani. 2018. Performer vs. Observer: Whose Comfort Level Should We Consider when Examining the Social Acceptability of Input Modalities for Head-Worn Display?. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (VRST 2018). Tokyo, Japan. ACM. 10 Pages. [pdf] (To appear) Teng Han, Jiannan Li, Khalad Hasan, Keisuke Nakamura, Randy Gomez, Ravin Balakrishnan, and Pourang Irani. 2018. PageFlip: Leveraging Page-Flipping Gestures for Efficient Command and Value Selection on Smartwatches. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI 2018). Montréal, Canada. ACM. Paper 529, 12 pages. [pdf] [Video] Fouad Alallah, Ali Neshati, Nima Sheibani, Yumiko Sakamoto, Andrea Bunt, Pourang Irani, and Khalad Hasan. 2018. Crowdsourcing vs Laboratory-Style Social Acceptability Studies?: Examining the Social Acceptability of Spatial User Interactions for Head-Worn Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI 2018). Montréal, Canada. ACM. Paper 310, 7 pages. [pdf] Teng Han, Khalad Hasan, Keisuke Nakamura, Randy Gomez, Pourang Irani. SoundCraft: Enabling Spatial Interactions on Smartwatches using Hand Generated Acoustics. In Proceedings of the 30th Symposium on User Interface Software and Technology (UIST 2017). Quebec City, Canada. ACM. 579-591. [pdf] [Video] Fereshteh Amini, Khalad Hasan, Andrea Bunt, and Pourang Irani. Data Representations for In-Situ Exploration of Health and Fitness Data. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth 2017). Barcelona, Spain. ACM. Khalad Hasan, David Ahlström, Junhyeok Kim, and Pourang Irani. 2017. AirPanes: Leveraging Two-Handed Around-Device Interaction for In-Air Pane Switching on Smartphones. In Proceedings of the 35th International Conference on Human Factors in Computing Systems (CHI 2017). Denver, CO. ACM. 679-691. [pdf] [Video] Teng Han, Khalad Hasan, Randy Gomez, Keisuke Nakamura, and Pourang Irani. Enabling Localized Gestures via Acoustic Sensing on Smartwatches. In Workshop on Designing Speech, Acoustic, and Multimodal Interactions. 35th International Conference on Human Factors in Computing Systems (CHI 2017). Denver, CO. Khalad Hasan, Junhyeok Kim, David Ahlström, and Pourang Irani. 2016. Thumbs-Up: 3D Spatial Thumb-Reachable Space for One-Handed Thumb Interaction on Smartphones. In Proceedings of the 2016 Symposium on Spatial User Interaction (SUI 2016). Tokyo, Japan. ACM. 103-106. [pdf] Khalad Hasan, David Ahlström, and Pourang Irani. 2015. SAMMI: A Spatially-Aware Multi-Mobile Interface for Analytic Map Navigation Tasks. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI 2015). Copenhagen, Denmark. ACM. 36-45. [Video] Khalad Hasan, David Ahlström, and Pourang Irani. 2015. Comparing Direct Off-Screen Pointing, Peephole, and Flick&Pinch Interaction for Map Navigation. In Proceedings of the ACM Symposium on Spatial User Interaction (SUI 2015). Los Angeles, USA. ACM. 99-102. SUI 2015 Best Paper Award. [Video] Marcos Serrano, Khalad Hasan, Barrett Ens, Xing-Dong Yang and Pourang Irani. 2015. Smartwatches + Head-Worn Displays: the ‘New’ Smartphone. In Workshop on Mobile Collocated Interactions: From Smartphones to Wearables. 33rd International Conference on Human Factors in Computing Systems (CHI 2015). Seoul, Korea. [pdf] David Ahlström, Khalad Hasan, Pourang Irani. 2014. Are You Comfortable Doing That?: Acceptance Studies of Around-Device Gestures in and for Public Settings. In Proceedings of the 16th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI 2014).Toronto, Canada. ACM. 193-202. [pdf] Xing-Dong Yang, Khalad Hasan, Neil Bruce, Pourang Irani. 2013. Surround-See: Enabling Peripheral Vision on Smartphones during Active Use. In Proceedings of the 26th Symposium on User Interface Software and Technology (UIST 2013). St. Andrews, UK. ACM. 291-300. [pdf] [Video] Khalad Hasan, Yang Wang, Wing Kwong and Pourang Irani. 2013. Enabling User Interactions with Video Contents. In Proceedings of the Tenth Conference on Computer and Robot Vision (CRV 2013). Regina, Saskatchewan. IEEE. 234-241. [pdf] [Video] Professional Services/Affiliations/CommitteesACM Transactions on Computer-Human Interaction (2018) International Journal of Human-Computer Studies (2018) Apologies, but no results were found.",
  "content_length": 7671,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:36"
}