{
  "name": "Khalid Elgazzar",
  "homepage": "http://www.ucs.louisiana.edu/~kae9655",
  "status": "success",
  "content": "Khalid Elgazzar - Home Khalid Elgazzar HomeResearchProfessional ExperienceAwardsProjectsTeachingPublicationsContacts Welcome to my home page I am an Assistant Professor at The Center of Advanced Computer Studies, University of Louisiana at Lafayette. I am also an adjunct assistant professor at Queen's School of Computing. Before joining CACS I was an NSERC posdoc fellow at Carnegie Mellon School of Computer Science. I received my PhD from Queen's University in 2013. My research interests span the areas of mobile and ubiquitous computing, distributed systems, context-aware cyber-physical systems, and elastic networking paradigms to cope with dynamic applications. My current research focus is on novel Ubiquitous Cloud paradigms and Internet of Things (IoT). Google Scholar Index. I lead the IoT Research Lab at University of Louisiana at Lafayette. Latest Highlights - 7/2017     Project on \"Data Integrity of Smart City Traffic Infrastructure\" awarded! Thank you CVDI IAB: CGI! - 7/2017     Project on \"Enabling Mobile Visual Analytics\" awarded! Thank you CVDI IAB: Lite! - 6/2017     Paper on \"An Empirical Study of Latency in an Emerging Class of Edge Computing Applications\" accepted to SEC'17. Congratulations Zhuo (CMU). - 6/2017     Project on \"Improving Student Learning in Hydrology \\& Water Resources Engineering by Enabling the Development, Sharing and Interoperability of Active Learning Resources\" awarded! Thank you NSF! (Award ID: 1726965) - 4/2017     Project on \"Dynamic Access Control in IoT Deployments\" awarded! Thank you Board of Regent! (Award ID: LEQSF(2017-20)-RD-A-19) - 11/2016     Our chapter on secure healthcare services accepted to Emergent Computation. - 08/2016     Joined CACS at University of Louisiana at Lafayette as an assistant professor. - 04/2016     Our paper on Web service discovery for IoT deployments accepted to IJSC. Congratulations Yehia. - 02/2016     IoT Expedition received funding extension. - 02/2016     Our workshop on distributed mobile systems and IoT services (DMSS 2016) is open for submissions. - 02/2016     Sima Soltani (my 1st PhD student) received her PhD from Queen's, congratulations Dr. Soltani. - 01/2016     Our workshop on Scalable Interent of Things (S-IoT 2016) is open for submissions. - 01/2016     Open Face v2 released on github. - 01/2016     Our paper on Access Control accepted to IEEE BigDataSecruity 2016. Congratulations Nafiseh. - 12/2015     Our paper on Mobile Face Recognition accepted to WCNC 2016. Congratulations Galal. - 12/2015     Serving as workshop chair for UCC2016, Shanghai, China. - 12/2015     Organizing Worshop on Scalable Internet of Things (S-IoT'2016)-- submission open. - 11/2015     Visited Google@Mountain View and gave a research talk on Edge Analytics for IoT. - 10/2015     Our paper on Cloud Monitoring accepted to UCC2015. Congratulations Saad and Marwa. - 09/2015     Our team @ CMU is leading the Google IoT expedition. - 07/2015     New OCE VIP/NSERC ENGAGE(CA) project on Ubiquitous Mobile Service Exchange is awarded. - 03/2015     Received NSERC PDF Award. - 04/2015     Our paper goDiscovery accepted to ICWS 2015. Congratulations Yehia. - 03/2015     Paper submission is open for DMSS 2015 (please contribute). - 03/2015     Paper submission is open for UMC 2015-IEEE SERVICES 2015 (please contribute).",
  "content_length": 3330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:49"
}