{
  "name": "Khaled R. Ahmed",
  "homepage": "https://www.cs.siu.edu/~kahmed",
  "status": "success",
  "content": "Khaled Ahmed Khaled R. Ahmed Associate Professor Graduate Program Director School of Computing Southern Illinois University Carbondale, IL, USA 62901 1230 Lincoln Drive, Engineering A. Room 307C Phone: +1 618-453-6048 Fax: +1 618-453-6044 E-mail: khaled.ahmed@siu.edu Home Page Teaching Research Lab Publications Research Projects Professional Activities Academic Qualification Ph. D. from (Tokyo Institute of Technology), Tokyo, Japan in 2004 (Major: Computer Science). Short Bio Khaled Ahmed is currently an associate professor and graduate program director in the School of Computing at Southern Illinois University. He was an associate professor in the department of computer science, College of Computer and Information Technology at King Faisal University. Moreover, he was a postdoctoral researcher at University of Tokyo, Japan. He has over 19 years of experience in Academia, Research and Industry. His research background in Software Engineering, Distributed Systems, Parallel Computing, Machine Learning, Computer Vision and Intelligent Transport systems. Dr. Ahmed's prolific publication record, including 69 articles in journals and proceedings and edited four books in Peer-to-peer, Wireless sensor network and advances in Big data, blockchain and Deep Learning. He acted as PI and Co-PI in about 11 funded research projects. Currently he is a PI and Co-PI of three federal/state research funds. His current research focus in the areas of Computer vision, Deep learning, Big data, real-time video analysis for safety applications. News Feb 09, 2024: My graduate student Abeer Almalky received the 2023 Outstanding Thesis Award. Congratulations! Received two-years research fedral award from USDA-NIFA titled Detecting Subacute Ruminal Acidosis using a real-time Deep Learning Algorithm. My PhD student Memari Majid successfully defended his dissertation and will graduate Fall 2023 Received two-years research fedral award from USDA-NIFA titled Artificial Intelligence for Greener Livestock: Educational and Research. Received a year seed research grant from ILLINOIS INNOVATION NETWORK). My graduate student Subash Kharel received 2021 Outstanding Thesis Award. Congratulations! Research Assistant Oppurtunity: OPEN right now to start on Fall 2024 A competitive two-years research assistantship is open for graduate student to complete his/her PhD degree. Please contact me for further information. My resarch lab (Big dAta and Software Engineering) is actively seeking well-motivated PhD and MSc students to work on different projects. The minimum requirements are: An MS/BS degree in computer science or related fields, Background on Deep learning, Big data (e.g. Apache Spark), and SE. Efficient programming skills in C++/Python/Java. Interested person should contact me directly through mail: : kahmed@cs.siu.edu. 2025-2026 Fulbright-Nehru Postdoctoral Research Fellowships Indian faculty and researchers who are in the early stages of their research careers in India. This fellowshop will provide you an opportunity to strengthen your research capacities. Postdoctoral fellows having research interest in Deep learning and object detection could use this fellowship to join BASE lab. This fellowship are for eight to 24 months. SIU SIU Computer Science SIU College of Engineering SIU Graduate School",
  "content_length": 3319,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:40"
}