{
  "name": "Khanh Hoa Dam",
  "homepage": "https://documents.uow.edu.au/~hoa",
  "status": "success",
  "content": "﻿ Hoa Khanh Dam Homepage Professor Hoa Khanh Dam ﻿ Director, Decision Systems Lab School of Computing and IT University of Wollongong, NSW 2522 Australia Email: hoa (at) uow (dot) edu (dot) au Brief bio Hoa Khanh Dam is Professor in Software Engineering at the School of Computing and Information Technology, University of Wollongong (UOW) in Australia. He is Director for the Decision System Lab at UOW. His research interests lie primarily in the intersection of Software Engineering and Artificial Intelligence (AI). He develops AI solutions for project managers, software engineers, QA and security teams to improve software quality/cybersecurity and accelerate productivity. His research also focuses on methodologies and techniques for developing AI/IoT autonomous and cyber resilient systems. Read More ﻿ Latest Events Co-chairing the Future of Software Engineering Track at ICSE 2023. SBIR grant with Wize Dynamics funded $96,448 for AI for identifying koalas. Two new research projects with DSTG received $321,030 in total. NGTF grant on Autonomic Cyber Resilience and Antifragility has been funded: $1,157,100. Two Aus4Innovation grants funded: $550,000. Started serving as Associate Editor for the Automated Software Engineering (Springer) journal from 2020. Serving on the Program Committe for ICSE 2022, ASE 2021, MSR 2021 AI app for JIRA featured at Atlassian Developer website Awarded a UGPN research grant (USD $40,000) to develop AI-driven techniques for sustainable project management. Invited to serve as red judge for the prestigious $5 million IBM Watson AI XPRIZE competition challenging teams to develop and demonstrate how humans can collaborate with powerful Artificial Intelligence (AI) technologies to solve humanity's grand challenges. AI-driven cyber solutions for Defence Read More Agentic AI in Software Engineering AI-enabled JIRA Cloud app for issue analytics Read More Critical error: when machines go off-script Read More AI-powered agile software project management Read More Can AI learn to become more human? Read More AI/IoT for ecosystem and environmental management Read More Airbone and AI-driven technology for farming and agriculture Read More About My Research My research mainly focuses on exploring new paradigms and technologies such as Artificial Intelligence (AI) to tackle various issues and challenges in different aspects of software engineering. Currently, I'm focusing on the following areas: AI-driven software quality and cybersecurity (read more) AI for project management (read more) Engineering AI/IoT autonomous systems (read more) Enterprise AI Analytics (including Process and Service Analytics - read more) View all Publications Hoa Khanh Dam, Truyen Tran, Trang Pham, Shien Wee Ng, John Grundy, Aditya Ghose, Automatic feature learning for predicting vulnerable software components, IEEE Transactions on Software Engineering. DOI: 10.1109/TSE.2018.2881961 Morakot Choetkiertikul, Hoa Khanh Dam, Truyen Tran, Trang Pham, Aditya Ghose, Tim Menzies, A deep learning model for estimating story points, IEEE Transactions on Software Engineering, DOI: 10.1109/TSE.2018.2792473 Jirayus Jiarpakdee, Chakkrit Tantithamthavorn, Hoa Khanh Dam and John Grundy, An Empirical Study of Model-Agnostic Techniques for Defect Prediction Models, IEEE Transactions on Software Engineering, DOI 10.1109/TSE.2020.2982385 Morakot Choetkiertikul, Hoa Khanh Dam, Truyen Tran, Aditya Ghose, Predicting the delay of issues with due dates in software projects, Empirical Software Engineering. DOI: 10.1007/s10664-016-9496-7",
  "content_length": 3566,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:44"
}