{
  "name": "Khuzaima Daudjee",
  "homepage": "http://cs.uwaterloo.ca/~kdaudjee",
  "status": "success",
  "content": "Khuzaima Daudjee - Data • Systems • Networks - Professor Activities Publications Teaching Contact I am a Professor in the research stream and David R. Cheriton Faculty Fellow in the Cheriton School of Computer Science at the University of Waterloo. I am interested in systems-oriented research. I work at the intersection of systems and data management, particularly on building large-scale systems, storage and infrastructure in the cloud and on modern hardware. I am affiliated with two research groups: Data Systems and Systems & Networks. If you are interested in graduate studies, check out this link. Awards/Honours ACM Distinguished Scientist – awarded for outstanding scientific contributions to computing ACM SIGMOD Best System Demonstration Awards ACM Symposium on Cloud Computing Best Paper Award Sapienza Fellowship (Category A: awarded to professors/researchers with an outstanding track record in their field) Mercator Fellowship Salesforce Research Award Outstanding Performance Awards, University of Waterloo VLDB Distinguished Associate Editor Awards SIGMOD Distinguished Program Committee Member VLDB Distinguished Reviewer Awards EDBT Distinguished Meta-Reviewer Activities Program Committee Chair: 42nd IEEE International Conference on Data Engineering (ICDE 2026) Associate Editor/Chair: ACM SIGMOD 2026 Proc. VLDB 2026 ACM SIGMOD 2025 IEEE ICDE 2025 EDBT 2025 VLDB Journal ACM Heidelberg Laureate Forum Selection Committee 2023-2024 Associate Editor/Chair: ACM SIGMOD 2024 ACM SIGMOD 2023 Proceedings of VLDB Endowment (PVLDB) Volume 16 (2022-2023) Proceedings of VLDB Endowment (PVLDB) Volume 15 (2021-2022) 38th IEEE International Conference on Data Engineering (ICDE 2022) Information Systems 2017-2025 Distributed and Parallel Databases 2020-2024 IEEE Transactions on Knowledge and Data Engineering (TKDE) 2017-2022 Program Committees: ACM Symposium on Cloud Computing (2023, 2022, 2020) VLDB (2024, 2023, 2022, 2021, 2020, 2019, 2018, 2017, 2015, 2014, 2012) SIGMOD (2023, 2022, 2021, 2020, 2018, 2014, 2013) ICDE (2022, 2021, 2020, 2019, 2018, 2017, 2016, 2015, 2013, 2012, 2011) ICDCS (2025, 2021, 2020, 2019, 2016, 2015), DEBS (2022, 2021, 2019), Middleware (2022, 2017), SRDS 2021, EDBT (2016, 2015) Co-Chair: 2020 ACM International Conference on Distributed and Event-Based Systems ICDE HardBD and Active 2020, 2019 ACM/IFIP 2019 Middleware Tutorials Publications Some Refereed Papers: L. Fernando, T. Kim, K. Daudjee, T. Rabl, Enjima: A Resource-Adaptive Stream Processing System, to appear in ACM SIGMOD. M. Khalaji, T. Vanderkooy, R. Guo, K. Daudjee, Sampling-based Predictive Database Buffer Management, to appear in VLDB. Zeynep Korkmaz, Tamer Özsu, Khuzaima Daudjee, Locality-Aware Cache Replacement Policy for Graph Traversals, Proc. VLDB 2025. S. Choy, J. Lee, B. Wong, K. Daudjee, Conflux: A Multi-homed Adaptive Bitrate Protocol for On-Site Live Video Streaming, to appear in IEEE/ACM Transactions on Networking. B. Guo, U. Anand, A. Chen, K. Daudjee, Cephalo: Harnessing Heterogeneous GPU Clusters for Training Transformer Models, ACM International Conference on Supercomputing, 2025. J. Zhang, Z. Pan, M. Xu, K. Daudjee, S. Liu, FreeRide: Harvesting Bubbles in Pipeline Parallelism, to appear in ACM/IFIP International Middleware Conference, 2025. T. Kashi, K. Salem, J. Kim, K. Daudjee, Eventual Durability, VLDB 2025. Mark Dodds, Khuzaima Daudjee, Apache Ignite + Calcite Composable Database System: Experimental Evaluation and Analysis, in EDBT 2025 Joshua Hildred, Michael Abebe, Khuzaima Daudjee, Caerus: Low-Latency Distributed Transactions for Geo-Replicated Systems, in VLDB 2024 (among best papers of VLDB 2024). M. Khalaji, T. Brown, K. Daudjee, V. Aksenov, Practical Hardware Transactional vEB Trees, in 2024 ACM Symposium on Principles and Practice of Parallel Programming. Lasantha Fernando, Harsh Bindra, Khuzaima Daudjee, An Experimental Analysis of Quantile Sketches over Data Streams, in Proc. EDBT 2023. Michael Abebe*, Horatiu Lazu, Khuzaima Daudjee, Tiresias: Enabling Predictive Autonomous Storage and Indexing, in Proc. VLDB 2022.*Cheriton School of Computer Science Distinguished Dissertation Award Winner B. Guo, V. Guo, A. Kim, J. Hildred, K. Daudjee, Hydrozoa: Dynamic Hybrid-Parallel DNN Training on Serverless Containers, in Proc. MLSys 2022. Michael Abebe, Horatiu Lazu, Khuzaima Daudjee, Proteus: Autonomous Adaptive Storage for Mixed Workloads, in Proc. of ACM International Conference on Management of Data (SIGMOD), 2022. Brad Glasbergen, Fangyu Wu, Khuzaima Daudjee, Dendrite: Bolt-on Adaptivity for Data Systems, in Proc. of ACM International Conference on Management of Data (SIGMOD) System Demonstration Track, 2021. Best System Demonstration Award Omar Farhat, Khuzaima Daudjee, Leonardo Querzoni, Klink: Progress-Aware Scheduling for Streaming Data Systems, in Proc. of ACM International Conference on Management of Data (SIGMOD), 2021. Kyle Langendoen, Brad Glasbergen, Khuzaima Daudjee, NIR-Tree: A Non-Intersecting R-Tree, in Proc. of 33rd International Conference on Scientific and Statistical Database Management (SSDBM), 2021. Michael Abebe, Brad Glasbergen, Khuzaima Daudjee, MorphoSys: Automatic Physical Design Metamorphosis for Distributed Database Systems, in Proc. VLDB 2020. Brad Glasbergen, Michael Abebe, Khuzaima Daudjee, Amit Levi, Sentinel: Universal Analysis and Insight for Data Systems, in Proc. VLDB 2020. Brad Glasbergen, Michael Abebe, Khuzaima Daudjee, Daniel Vogel, Jian Zhao, Sentinel: Understanding Data Systems, in Proc. of ACM International Conference on Management of Data (SIGMOD) Systems Demonstration Track, 2020. Best System Demonstration Award Brad Glasbergen, Kyle Langendoen, Michael Abebe, Khuzaima Daudjee, ChronoCache: Predictive and Adaptive Mid-Tier Query Result Caching, in Proc. of ACM International Conference on Management of Data (SIGMOD), 2020. Runsheng Benson Guo, Khuzaima Daudjee, Research Challenges in Deep Reinforcement Learning-based Join Query Optimization in aiDM@SIGMOD 2020. Michael Abebe, Brad Glasbergen, Khuzaima Daudjee, DynaMast: Adaptive Dynamic Mastering for Replicated Systems, in Proc. of IEEE International Conference on Data Engineering (ICDE), 2020. Omar Farhat, Harsh Bindra, Khuzaima Daudjee, Leaving Stragglers at the Window: Low-Latency Stream Sampling with Accuracy Guarantees, in Proc. 14th ACM International Conference on Distributed and Event-Based Systems (DEBS) 2020. M. Kazhamiaka, B. Memon, C. Kankanamge, S. Sahu, S. Rizvi, B. Wong, K. Daudjee, Sift: Resource-Efficient Consensus with RDMA, Proc. 2019 ACM CoNEXT, pages 260-271. Güneş Aluç, M. Tamer Özsu, Khuzaima Daudjee, Building Self-Clustering RDF Databases Using Tunable-LSH, VLDB Journal, Volume 28, Issue 2, pages 173-195, 2019. Michael Abebe, Brad Glasbergen, Khuzaima Daudjee, WatDFS: A Project for Understanding Distributed Systems in the Undergraduate Curriculum, ACM Technical Symposium on Computer Science Education (SIGCSE), pages 920-926, 2019. Brad Glasbergen, Michael Abebe, Khuzaima Daudjee, Tutorial: Adaptive Replication and Partitioning in Data Systems, in Proc. of the 19th ACM/IFIP/USENIX International Middleware Conference, 2018. Michael Abebe, Khuzaima Daudjee, Brad Glasbergen, Y. Tian, EC-Store: Bridging the Gap Between Storage and Latency in Distributed Erasure Coded Systems, in Proc. 38th IEEE International Conference on Distributed Computing Systems (ICDCS). B. Glasbergen, M. Abebe, K. Daudjee, S. Foggo, A. Pacaci, Apollo: Learning Query Correlations for Predictive Caching in Geo-Distributed Systems, in Proc. 21st International Conference on Extending Database Technology (EDBT), 2018. X. Cui, M. Mior, B. Wong, K. Daudjee, S. Rizvi, NetStore: Leveraging Network Optimizations to Improve Distributed Transaction Processing Performance in Proc. 2017 ACM International Workshop on Active Middleware on Modern Hardware. J. Mate, K. Daudjee, S. Kamali, Robust Multi-Tenant Server Consolidation in the Cloud for Data Analytics Workloads in Proc. 37th IEEE International Conference on Distributed Computing Systems (ICDCS), 2017. Minyang Han*, Khuzaima Daudjee, Providing Serializability for Pregel-like Graph Processing Systems in Proc. 19th International Conference on Extending Database Technology (EDBT), 2016. Code is available here. *Winner of Governor General's Gold Medal (top research award university-wide) Shreya Agrawal, Khuzaima Daudjee, A Performance Comparison of Algorithms for Byzantine Agreement in Distributed Systems in Proc. 12th European Dependable Computing Conference, pages 249-260, 2016. S. Radhakrishnan, B. Muscedere, K. Daudjee, V-Hadoop: Virtualized Hadoop Using Containers, in Proc. 15th IEEE International Symposium on Network Computing and Applications (IEEE NCA), 2016. Minyang Han, Khuzaima Daudjee, Giraph Unchained: Barrierless Asynchronous Parallel Execution in Pregel-like Graph Processing Systems in Proc. VLDB 2015. Code for our GiraphUC system is available here. J. Kim, K. Salem, K. Daudjee, A. Aboulnaga, X. Pan, Database High Availability Using SHADOW Systems in Proc. ACM Symposium on Cloud Computing, 2015. Best Paper Award F. Abu-Khzam, K. Daudjee, A. Mouawad, N. Nishimura, On Scalable Parallel Recursive Backtracking, in Journal of Parallel and Distributed Computing, pages 65-75, 2015. J. Kim, K. Salem, K. Daudjee, Write Amplification: An Analysis of In-Memory Database Durability Techniques in Proc. VLDB International Workshop on In-Memory Data Management and Analytics (IMDM), 2015. F. Petroni, L. Querzoni, K. Daudjee, S. Kamali, G. Iacoboni, HDRF: Stream-Based Partitioning for Power-Law Graphs in Proc. 24th ACM International Conference on Information and Knowledge Management (CIKM), 2015. [HDRF has been integrated into PowerGraph.] D. Nicoara, S. Kamali, K. Daudjee, L. Chen, Hermes: Dynamic Partitioning for Distributed Social Network Graph Databases in Proc. 18th International Conference on Extending Database Technology (EDBT), 2015. G. Aluç, M. T. Özsu, K. Daudjee, O. Hartig, Execut",
  "content_length": 14057,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:55"
}