{
  "name": "Kibok Lee 0003",
  "homepage": "https://sites.google.com/site/kibok90",
  "status": "success",
  "content": "Kibok LeeSearch this siteEmbedded FilesSkip to main contentSkip to navigationKibok LeeAssistant ProfessorApplied Statistics / Statistics and Data Science @ Yonsei Universitykibok90 _at_ gmail _dot_ com (for non-academic stuffs)kibok _at_ yonsei _dot_ ac _dot_ kr[Google Scholar] [GitHub]I am an assistant professor at Yonsei University. Previously, I was an applied scientist at Amazon Web Services. I finished my Ph.D. at the University of Michigan, advised by Honglak Lee. My research interests lie in machine learning and computer vision.New website: https://ml.yonsei.ac.kr/Research Topics(Self-Supervised) Representation LearningOut-of-Distribution DetectionContinual LearningFew-Shot LearningPublications (C: conference, J: journal, P: preprint, *: equal contribution)[C13] Rethinking Few-Shot Object Detection on a Multi-Domain BenchmarkKibok Lee, Hao Yang, Satyaki Chakraborty, Zhaowei Cai, Gurumurthy Swaminathan, Avinash Ravichandran, Onkar DabeerIn ECCV, 2022. [paper, arXiv:2207.11169][GitHub][C12] Improving Transferability of Representations via Augmentation-Aware Self-SupervisionHankook Lee, Kibok Lee, Kimin Lee, Honglak Lee, Jinwoo ShinIn NeurIPS, 2021. [paper, arXiv:2111.09613][GitHub][C11] i-Mix: A Domain-Agnostic Strategy for Contrastive Representation LearningKibok Lee, Yian Zhu, Kihyuk Sohn, Chun-Liang Li, Jinwoo Shin, Honglak LeeIn ICLR, 2021. [paper, arXiv:2010.08887][GitHub][poster][P1] ShapeAdv: Generating Shape-Aware Adversarial 3D Point CloudsKibok Lee, Zhuoyuan Chen, Xinchen Yan, Raquel Urtasun, Ersin YumerPreprint. [arXiv:2005.11626][C10] Network Randomization: A Simple Technique for Generalization in Deep Reinforcement LearningKimin Lee*, Kibok Lee*, Jinwoo Shin, Honglak LeeIn ICLR, 2020. [paper, arXiv:1910.05396][GitHub]Preliminary version [poster] was presented in NeurIPS Workshop on Deep Reinforcement Learning, 2019. Contributed talk[C9] Overcoming Catastrophic Forgetting with Unlabeled Data in the WildKibok Lee, Kimin Lee, Jinwoo Shin, Honglak LeeIn ICCV, 2019. [paper, arXiv:1903.12648][GitHub][poster][Short version][slides] was presented in CVPR Workshop on Uncertainty and Robustness in Deep Visual Learning, 2019. Spotlight[C8] Robust Inference via Generative Classifiers for Handling Noisy LabelsKimin Lee, Sukmin Yun, Kibok Lee, Honglak Lee, Bo Li, Jinwoo ShinIn ICML, 2019. Long presentation [paper, arXiv:1901.11300][GitHub][C7] Automatic Correction of Lithography Hotspots with a Deep Generative ModelWoojoo Sim*, Kibok Lee*, Dingdong Yang, Jaeseung Jeong, Ji-Suk Hong, Sooryong Lee, Honglak LeeIn SPIE Advanced Lithography, 2019. Invited (long presentation) [paper][C6] A Simple Unified Framework for Detecting Out-of-Distribution Samples and Adversarial AttacksKimin Lee, Kibok Lee, Honglak Lee, Jinwoo ShinIn NeurIPS, 2018. Spotlight (168/4856=3.5%) [paper, arXiv:1807.03888][GitHub]Comment: Adversarial samples can be used to validate our proposed method without OOD samples; check the right side of the Table 2.[C5] Hierarchical Novelty Detection for Visual Object RecognitionKibok Lee, Kimin Lee, Kyle Min, Yuting Zhang, Jinwoo Shin, Honglak LeeIn CVPR, 2018. [paper, arXiv:1804.00722][GitHub][poster]Comment: Hierarchical novelty detection is a generalization of generalized zero-shot learning, in the sense that it does not require semantic information about zero-shot classes.[C4] Training Confidence-calibrated Classifiers for Detecting Out-of-Distribution SamplesKimin Lee, Honglak Lee, Kibok Lee, Jinwoo ShinIn ICLR, 2018. [paper, arXiv:1711.09325][GitHub][C3] Towards Understanding the Invertibility of Convolutional Neural NetworksAnna Gilbert, Yi Zhang, Kibok Lee, Yuting Zhang, Honglak LeeIn IJCAI, 2017. [paper, arXiv:1705.08664][slides][poster][C2] Augmenting Supervised Neural Networks with Unsupervised Objectives for Large-scale Image ClassificationYuting Zhang, Kibok Lee, Honglak LeeIn ICML, 2016. [paper, arXiv:1606.06582][GitHub][slides][poster][J1] A Flexible Framework for Online Document Segmentation by Pair-wise Stroke Distance LearningAdrien Delaye, Kibok LeePattern Recognition, 2015. [paper (ScienceDirect) (ResearchGate)][C1] On the Equivalence of Linear Discriminant Analysis and Least SquaresKibok Lee, Junmo KimIn AAAI, 2015. [paper (gdrive)] [supplementary]Employment2022-Present: Assistant Professor, Applied Statistics / Statistics and Data Science at Yonsei University, Seoul, Korea2020-2022: Applied Scientist, Amazon Web Services, WA, US2019-2019: Research Intern, Uber Advanced Technologies Group, CA, US2012-2015: Research Engineer, Samsung Electronics, Suwon, KoreaEducationPh.D. in Computer Science and Engineering, University of Michigan, 2020M.S. in Electrical Engineering, KAIST, 2012B.S. in Electrical Engineering, KAIST, 2011Professional ServiceJournal ReviewerIEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)Journal of Machine Learning Research (JMLR)Transactions on Machine Learning Research (TMLR)International Journal of Computer Vision (IJCV)Conference ReviewerAAAI 2020-2022ACCV 2020-2022CVPR 2020-2022ECCV 2020-2022ICCV 2019-2021ICLR 2020–2022ICML 2020–2022NeurIPS 2019–2022WACV 2021–2023Workshop Program CommitteeECCV 2022 Workshop on a Challenge for Out-of-Distribution Generalization in Computer VisionECCV 2022 Workshop on Adversarial Robustness in the Real WorldNeurIPS 2021 Workshop on Distribution ShiftsICCV 2021 Workshop on Adversarial Robustness In the Real WorldICML 2021 Workshop on Uncertainty and Robustness in Deep LearningECCV 2020 Workshop on Adversarial Robustness in the Real WorldICML 2020 Workshop on Uncertainty and Robustness in Deep LearningNeurIPS 2018 Workshop on Continual LearningGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5724,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:52"
}