{
  "name": "Kieron O'Hara",
  "homepage": "https://www.ecs.soton.ac.uk/people/kmoh",
  "status": "success",
  "content": "Kieron O'Hara | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Kieron O'Hara Research interests Privacy, trust, digital modernity, ethics, Web Science, anonymisation, Politics of data More research Connect with Kieron Email: kmo@ecs.soton.ac.uk ORCID On this page About Research Publications External roles and responsibilities Biography About Research Publications External roles and responsibilities Biography About Kieron O'Hara is an associate professor in Electronics and Computer Science at the University of Southampton. He has had a central involvement in the development of the discipline of Web Science. He is the author of several books, including: 'Plato and the Internet' (2002); 'Trust: From Socrates to Spin' (2004); 'inequality.com: Power, Poverty and the Digital Divide' (2006, with David Stevens); and 'The Spy in the Coffee Machine: The End of Privacy As We Know It' (2008, with Nigel Shadbolt), as well as 'A Framework for Web Science' (2006, with Tim Berners-Lee et al). He has also written extensively on British politics and political theory, and is a research fellow for the Centre for Policy Studies, and an associate fellow of Bright Blue. His latest book is 'The Anonymisation Decision-Making Framework' (2016, with Mark Elliot et al), and his latest edited collection is 'The Digital Enlightenment Forum Yearbook 2014: Social Networks and Social Machines, Surveillance and Empowerment' (2013, edited with M-H Carolyn Nguyen and Peter Haynes). He chaired the transparency sector panel for crime and criminal justice for the Ministry of Justice and the Home Office from 2011-15. His report on privacy in the context of the UK government's transparency programme, 'Transparent Government, Not Transparent Citizens', was published in September 2011. He is one of the leads for the UKAN network of anonymisation professionals. He is the editor of Foundations and Trends in Web Science. Research Research groups Member of: Web and Internet Science Centre for Democratic Futures Research interests Privacy, trust, digital modernity, ethics, Web Science, anonymisation, Politics of data Current research His research interests are in the nature of digital modernity: in other words, the impact and future trajectory of networked digital technology on society, the economy and politics. The technologies available to us, to the groups and social machines we form, and to the institutions around us, are increasing in power and scope, on the back of the data revolution. This creates many economic and social opportunities, while at the same time innovation becomes more disruptive, and long-established practices are disintermediated. Privacy is harder to defend as AI, ML, big data, the Internet of Things, social networking and the free services economy threaten to overwhelm the data protection framework based around individual rights and personal data. Trust becomes more complex as understandings of trustworthy behaviour are disconnected from well-understood social norms. Different visions of the Internet’s future governance are being forged by geopolitical tensions, which will influence the affordances of the technology for individuals, social groups, companies and states. What does digital modernity look like, and where might its logic take us? Where do the opportunities lie, and how can we protect existing valuable practices and resources as we explore those opportunities? Research projects Completed projects Provenance and Anonymization Researchers: Professor Age Chapman Kieron O'Hara Sponsor: Alan Turing Institute Ecological Analysis of National Identity Systems Researchers: Dame Wendy Hall Kieron O'Hara Sponsor: Alan Turing Institute Publications Five AIMS: lessons from internet governance for artificial intelligence management strategies Dame Wendy Hall, Kieron O'hara & Pierre Noro, 2025 Type: report Web3: the promise & the reality Ben Hawes, Wendy Hall, Bill Thompson & Kieron O'Hara, 2023 DOI: 10.5258/SOTON/WSI-WP006 Type: workingPaper Digital modernity Kieron O'Hara, 2022, Foundations and Trends in Web Science, 9(1-2), 1-254 DOI: 10.1561/1800000031 Type: article Privacy, privacy-enhancing technologies & the individual Kieron O'Hara, 2022 Type: report What Conservatives Value Kieron O'hara, 2021, Political Studies Review DOI: 10.1177/14789299211062039 Type: article Applying mechanical philosophy to web science: The case of social machines Paul Smart, Kieron O'hara & Wendy Hall, 2021, European Journal for Philosophy of Science, 11(3), 1-29 DOI: 10.1007/s13194-021-00388-z Type: article Four Internets: data, geopolitics, and the governance of cyberspace Wendy Hall & Kieron O'hara, 2021 DOI: 10.1093/oso/9780197523681.001.0001 Type: book Burkean conservatism, legibility and populism Kieron O'Hara, 2021, Journal of Political Ideologies, 26(1), 81-100 DOI: 10.1080/13569317.2020.1844371 Type: article Data trusts Kieron O'hara, 2020, European Data Protection Law Review, 6(4), 484-491 DOI: 10.21552/edpl/2020/4/4 Type: article Explainable AI and the philosophy and practice of explanation Kieron O'Hara, 2020, Computer Law & Security Review, 39 DOI: 10.1016/j.clsr.2020.105474 Type: article External roles and responsibilities Name: Four Internets: The Ethics and Geopolitics of the Internet Role: Speaker Year: 2019 Biography Prizes Best paper prize, ACM Web Science Conference 2016 (2016) Best oral presentation, Sensecam 2012 (2012) Best paper prize, ACM Web Science Conference 2016 (2016) Best oral presentation, Sensecam 2012 (2012) Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Pre-sessional English courses Course modules Assessment Subjects Acoustical engineering Aeronautical and astronautical engineering Ageing and gerontology Archaeology Art, design and fashion Audiology Biological sciences Biomedical and medical engineering Business, accounting, finance and marketing Chemistry Civil engineering Computer science and software engineering Economics Education Electrical and electronic engineering English Film studies French Geography and environmental science History Languages and linguistics Law Maritime engineering Mathematical sciences Mechanical engineering Medicine Music Nursing, midwifery and healthcare Ocean and Earth science Philosophy Photonics and optoelectronics Physics and astronomy Politics and international relations Psychology Social statistics and demography Sociology, social policy and criminology PhDs and research degrees Create your own research project Find a PhD project A missing link between continental shelves and the deep sea: Have we underestimated the importance of land-detached canyons? A study of rolling contact fatigue in electric vehicles (EVs) Acoustic monitoring of forest exploitation to establish community perspectives of sustainable hunting Acoustic sensing and characterisation of soil organic matter Advancing intersectional geographies of diaspora-led development in times of multiple crises Aero engine fan wake turbulence – Simulation and wind tunnel experiments Against Climate Change (DACC): impro",
  "content_length": 29278,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:59"
}