{
  "name": "Kihong Heo",
  "homepage": "https://kihongheo.kaist.ac.kr",
  "status": "success",
  "content": "Kihong Heo · Home Kihong Heo (허기홍) Associate Professor Programming Systems Laboratory School of Computing / Graduate School of Information Security KAIST Notice I am looking for highly motivated graduate/undergraduate students who are interested in program analysis, program synthesis/transformation, and machine learning techniques for next-generation programming systems. For more detailed information, see projects, publications, talks, recruitment, blog, Youtube Video (in Korean), or send me an email. Vita Present Associate Professor, KAIST 2020 - 2024 Assistant Professor, KAIST 2017 - 2019 Post-doctoral Researcher, University of Pennsylvania 2009 - 2017 Ph.D., Computer Science & Engineering, Seoul National University 2005 - 2009 B.S., Computer Science & Engineering, Seoul National University News June 2025 📄 Our paper Safeguarding Mobile GUI Agent via Logic-based Action Verification will appear at MobiCom 2025. June 2025 🏆 UnitCon won the ACM SIGSOFT Distinguished Paper Award at FSE 2025. Checkout our paper and research story. June 2025 📄 Our paper Optimization-Directed Compiler Fuzzing for Continuous Translation Validation was published at PLDI 2025. Checkout our project page and research story. Research Interest My research aims to develop program reasoning systems for safe and reliable software. In particular, I am working on the following topics: AI-based program analysis systems for detecting deep semantic software bugs General-purpose program simplification systems for secure and efficient software Scalable program synthesis systems for automatic software generation and repair For more information about my research, see projects, publications, talks, and the following Youtube videos (in Korean). Courses CS348: Introduction to Information Security, 2021S, 2022S, 2023S, 2025S CS424: Program Reasoning, 2022F, 2023F, 2024F, 2025F CS524: Program Analysis, 2021F, 2022F, 2024S, 2025S IS511: Introduction to Information Security, 2021S IS593: Language-based Security, 2020S, 2023F IS661: Advanced Software Security, 2020F, 2022S, 2024S CS966: KAIST SoC Colloquium, 2023S [photo] Students Ph.D Students Yeonhee Ryou Taeeun Kim Sujin Jang Master Students Dongjae Lee Geon Park Jaehoon Jang Bongjun Jang See more. Professional Activities Program Committee 2025: SOAP (PC Co-Chair), ICSE, APLAS, SAS (AE Co-Chair) 2024: ICSE, OOPSLA, SAS, LCTES 2023: PLDI 2022: PLDI, POPL, OOPSLA, SAS, FSE (SRC), ECOOP (Doctoral Symposium) 2021: APLAS, SYNT, OCAML 2020: TAPAS, ICSE (Virtualization Committee) 2019: PLDI (ERC) Editorial Board ACM Transactions on Software Engineering and Methodology (TOSEM) Associate Editor Awards ACM SIGSOFT Distinguished Paper Award, FSE 2025 Amazon Research Award, 2024 The Soo-Young Lee Teaching innovation Award, KAIST, 2024 Prize for Excellence in Teaching, KAIST, 2024 Best Artifact Award, ICSE 2022 ACM SIGPLAN Distinguished Paper Award, PLDI 2019 ACM SIGSOFT Distinguished Paper Award, ICSE 2019 Outstanding Dissertation Award, Department of Computer Science and Engineering, Seoul National University, 2017 Contact kihong.heo (at) kaist.ac.kr +82-42-350-3581 Room 2321, N5 School of Computing KAIST 291 Daehak-ro, Yuseong-gu, Daejeon 34141, Korea Last updated: 28 Oct 2025",
  "content_length": 3230,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:56"
}