{
  "name": "Kijung Shin",
  "homepage": "http://kijungshin.com",
  "status": "success",
  "content": "Kijung Shin @ KAIST Kijung Shin (신기정) Associate Professor Data Mining Lab, KAIST AI & EE About Me I am an Associate Professor in the Kim Jaechul Graduate School of AI and the School of Electrical Engineering (Computer Division) at KAIST. I received my Ph.D. in Computer Science from Carnegie Mellon University, where I was advised by Prof. Christos Faloutsos and supported by the KFAS Scholarship and the Siebel Scholar Fellowship. I received my B.S. in Computer Science and Engineering and B.A. in Economics from Seoul National University. My research interests include data mining, graph algorithms, and network science. At KAIST, I lead the Data Mining Lab. Contact Details Email: kijungs (at) kaist.ac.kr Web: https://kijungs.github.io Address: Kim Jaechul Graduate School of AI, KAIST 85, Hoegi-ro, Dongdaemun-gu Seoul, 02455, Republic of Korea Download C.V. Education Carnegie Mellon University Ph.D. in Computer Science •Feb. 2019 M.S. in Computer Science •Dec. 2017 Seoul National University B.S. in Computer Science and Engineering•Aug. 2015 B.A. in Economics (Double Major) •Aug. 2015 Positions KAIST Associate Professor • Mar. 2023 - Present Ewon Endowed Assistant Professor • Feb. 2019 - Feb. 2023 LinkedIn Research Intern • May. 2017 - Aug. 2017 & May. 2018 - Aug. 2018 CYRAM Associate Researcher • Jan. 2011 - Dec. 2013 Teaching KAIST AI607 Graph Mining and Social Network Analysis Instructor • [ 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 ] KAIST AI506 Data Mining and Search Instructor • [ 2025 | 2024 | 2023 | 2022 | 2021 | 2020 ] KAIST EE210 Probability and Introductory Random Processes Instructor • [ 2020 ] KAIST EE209(B) Programming Structure for Electrical Engineering Instructor • [ 2019 ] CMU 10-601 Introduction to Machine Learning Teaching Assistant • [ 2017 ] CMU 15-780 Graduate Artificial Intelligence Teaching Assistant • [ 2017 ] Tutorials [T2] Hypergraph Neural Networks: An In-depth and Step-By-Step Guide Sunwoo Kim*, Soo Yong Lee*, Yue Gao, Alessia Antelmi, Mirko Polato, and Kijung Shin AAAI 2025 / CIKM 2025 / ICDM 2024 / KDD 2024 [ survey [C73] | proposal | slides | bib ] [T1] Mining of Real-world Hypergraphs: Patterns, Tools, and Generators Geon Lee, Jaemin Yoo, and Kijung Shin KDD 2023 / WWW 2023 / ICDM 2022 / CIKM 2022 [ survey [J29] | proposal | video | slides | bib ] Publications [ Google Scholar | DBLP | Research Gate ] 2026 and Forthcoming [C104] Feature-Centric Unsupervised Node Representation Learning Without Homophily Assumption Sunwoo Kim, Soo Yong Lee, Kyungho Kim, Hyunjin Hwang, Jaemin Yoo, and Kijung Shin AAAI 2026 [ paper | slides | poster | code and datsets | bib ] [C103] Sequential Data Augmentation for Generative Recommendation Geon Lee, Bhuvesh Kumar, Mingxuan Ju, Tong Zhao, Kijung Shin, Neil Shah, and Liam Collins WSDM 2026 [ paper | slides | poster | code and datsets | bib ] 2025 [C102] RDB2G-Bench: A Comprehensive Benchmark for Automatic Graph Modeling of Relational Databases Dongwon Choi, Sunwoo Kim, Juyeon Kim, Kyungho Kim, Geon Lee, Shinhwan Kang, Myunghwan Kim, and Kijung Shin NeurIPS 2025 (Benchmark Paper) [ paper | poster | code and datasets | bib ] [C101] Learning to Flow from Generative Pretext Tasks for Neural Architecture Encoding Sunwoo Kim, Hyunjin Hwang, and Kijung Shin NeurIPS 2025 [ paper | poster | code and datasets | bib ] [C100] TimeXL: Explainable Multi-modal Time Series Prediction with LLM-in-the-Loop Yushan Jiang, Wenchao Yu, Geon Lee, Dongjin Song, Kijung Shin, Wei Cheng, Yanchi Liu, and Haifeng Chen NeurIPS 2025 [ paper | bib ] [C99] Edge Probability Graph Models Beyond Edge Independency: Concepts, Analyses, and Algorithms Fanchen Bu, Ruochen Yang, Paul Bogdan, and Kijung Shin ICDM 2025 [ paper | video | slides | code and datasets | bib ] Selected as one of the best-ranked papers of ICDM 2025 for fast-track journal invitation [C98] HyperSearch: Prediction of New Hyperedges through Unconstrained yet Efficient Search Hyunjin Choo, Fanchen Bu, Hyunjin Hwang, Young-Gyu Yoon, and Kijung Shin ICDM 2025 [ paper | video | slides | code and datasets | bib ] [C97] Attributed Hypergraph Generation with Realistic Interplay Between Structure and Attributes Jaewan Chun*, Seokbum Yoon*, Minyoung Choe, Geon Lee, and Kijung Shin ICDM 2025 [ paper | video | slides | code and datasets | bib ] Received the IEEE ICDM Best Paper Award [link] Selected as one of the best-ranked papers of ICDM 2025 for fast-track journal invitation [C96] Identifying Group Anchors in Real-World Group Interactions Under Label Scarcity Fanchen Bu, Geon Lee, Minyoung Choe, and Kijung Shin ICDM 2025 [ paper | video | slides | code and datasets | bib ] [C95] 'Hello, World!': Making GNNs Talk with LLMs Sunwoo Kim, Soo Yong, Jaemin Yoo, and Kijung Shin Findings of EMNLP 2025 (Short Paper) [ paper | video | slides | poster | code and datasets | bib ] [C94] A Self-Supervised Mixture-of-Experts Framework for Multi-behavior Recommendation Kyungho Kim, Sunwoo Kim, Geon Lee, and Kijung Shin CIKM 2025 [ paper | slides | code and datasets | bib ] [C93] SkySearch: Satellite Video Search at Scale Minyoung Choe*, Geon Lee*, Changhun Han*, Suji Kim, Woong Hu, Hyebeen Hwang, Geunseok Park, Byeongyeon Kim, Hyesook Lee, Ha-Myung Park, and Kijung Shin KDD 2025 (Industry Paper) [ paper | slides | poster | code and datasets | bib ] [C92] RL4CO: An Extensive Reinforcement Learning for Combinatorial Optimization Benchmark Federico Berto*, Chuanbo Hua*, Junyoung Park*, Laurin Luttmann*, Yining Ma, Fanchen Bu, Jiarui Wang, Haoran Ye, Minsu Kim, Sanghyeok Choi, Zepeda Gast, Andre Hottung, Jianan Zhou, Jieyi Bi, Yu Hu, Fei Liu, Hyeonah Kim, Jiwoo Son, Haeyeon Kim, Davide Angioni, Wouter Kool, Zhiguang Cao, Jie Zhang, Kijung Shin, Cathy Wu, Sungsoo Ahn, Guojie Song, Changhyun Kwon, Lin Xie, and Jinkyoo Park KDD 2025 (Benchmark Paper) [ paper | code and datasets | bib ] [C91] On Measuring Unnoticeability of Graph Adversarial Attacks: Observations, New Measure, and Applications Hyeonsoo Jo*, Hyunjin Hwang*, Fanchen Bu, Soo Yong Lee, Chanyoung Park, and Kijung Shin KDD 2025 [ paper | slides | poster | code and datasets | bib ] [C90] Mitigating Over-Squashing in Graph Neural Networks by Spectrum-Preserving Sparsification Langzhang Liang, Fanchen Bu, Zixing Song, Zenglin Xu, Shirui Pan, and Kijung Shin ICML 2025 [ paper | code and datasets | bib ] [C89] KGMEL: Knowledge Graph-Enhanced Multimodal Entity Linking Juyeon Kim, Geon Lee, Taeuk Kim, and Kijung Shin SIGIR 2025 (Short Paper) [ paper | video | poster | code and datasets | bib ] [C88] MARIOH: Multiplicity-Aware Hypergraph Reconstruction Kyuhan Lee, Geon Lee, and Kijung Shin ICDE 2025 [ paper | appendix | code and datasets | bib ] [C87] Simple yet Effective Node Property Prediction on Edge Streams under Distribution Shifts Jongha Lee, Taehyung Kwon, Heechan Moon, and Kijung Shin ICDE 2025 [ paper | appendix | slides | poster | code and datasets | bib ] [C86] Multi-Behavior Recommender Systems: A Survey Kyungho Kim, Sunwoo Kim, Geon Lee, Jinhong Jung, and Kijung Shin PAKDD 2025 (Survey Paper) [ paper | bib ] Received the PAKDD Best Survey Paper Award [link] [C85] TiGer: Self-Supervised Purification for Time-evolving Graphs Hyeonsoo Jo, Jongha Lee, Fanchen Bu and Kijung Shin PAKDD 2025 [ paper | code and datasets | bib ] [C84] Kronecker Generative Models for Power-Law Patterns in Real-World Hypergraphs Minyoung Choe, Jihoon Ko, Taehyung Kwon, Kijung Shin, and Christos Faloutsos WWW 2025 [ paper | appendix | slides | poster | code and datasets | bib ] [C83] Beyond Neighbors: Distance-Generalized Graphlets for Enhanced Graph Characterization Yeongho Kim, Yuyeong Kim, Geon Lee, and Kijung Shin WWW 2025 [ paper | poster | code and datasets | bib ] [C82] DiffIM: Differentiable Influence Minimization with Surrogate Modeling and Continuous Relaxation Junghun Lee, Hyunju Kim, Fanchen Bu, Jihoon Ko, and Kijung Shin AAAI 2025 [ paper | poster | code and datasets | bib ] [C81] TimeCAP: Learning to Contextualize, Augment, and Predict Time Series Events with Large Language Model Agents Geon Lee, Wenchao Yu, Kijung Shin, Wei Cheng, and Haifeng Chen AAAI 2025 [ paper | appendix | poster | datasets | bib ] [C80] RASP: Robust Mining of Frequent Temporal Sequential Patterns under Temporal Variations Hyunjin Choo, Minho Eom, Gyuri Kim, Young-Gyu Yoon, and Kijung Shin EDBT 2025 [ paper | slides | code and datasets | bib ] [J33] Revisiting LightGCN: Unexpected Inflexibility, Inconsistency, and A Remedy Towards Improved Recommendation Geon Lee, Kyungho Kim, Fanchen Bu, Langzhang Liang, and Kijung Shin ACM TORS [ paper | shorter ver. [C76] | code and datasets | bib ] [J32] Inductive Influence Estimation and Maximization over Unseen Social Networks under Two Diffusion Models Jihoon Ko*, Seojeong Kim*, Kyuhan Lee, Shinhwan Kang, Dongyeong Hwang, Kijung Shin, and Noseong Park Data Mining and Knowledge Discovery [ paper | shorter ver. [C28] | code and datasets | bib ] [J31] Gene Expression Inference Based on Graph Neural Networks Using L1000 Data Tae Hyun Kim*, Harim Kim*, Hyunjin Hwang*, Shinwhan Kang*, Kijung Shin, and Inwha Baek Briefings in Bioinformatics [ paper | code and datasets | bib ] [J30] Effective and Lightweight Lossy Compression of Tensors: Techniques and Applications Jihoon Ko, Taehyung Kwon, Jinhong Jung, and Kijung Shin Knowledge and Information Systems [ paper | shorter ver. [C78] | slides | code and datasets | bib ] [J29] A Survey on Hypergraph Mining: Patterns, Tools, and Generators Geon Lee*, Fanchen Bu*, Tina Eliassi-Rad, and Kijung Shin ACM Computing Surveys [ paper | appendix | video | slides | bib ] [J28] Estimating Simplet Counts via Sampling Hyunju Kim*, Heechan Moon*, Fanchen Bu, Jihoon Ko, and Kijung Shin The VLDB Journal [ paper | shorter ver. [C52] | code and datasets | bib ] [J27] BeGin: Extensive Benchmark Scenarios and An Easy-to-use Framework for Graph Continual Learning Jihoon Ko*, Shinhwan Kang*, Taehyung Kwon, Heechan Moon, and Kijung Shin ACM TIST [ paper | code and data",
  "content_length": 37058,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:57"
}