{
  "name": "Kim Guldstrand Larsen",
  "homepage": "http://www.cs.aau.dk/~kgl",
  "status": "success",
  "content": "Kim Guldstrand Larsen – VILLUM Investigator, R Skip to content I am a professor in the Department of Computer Science at Aalborg University within the Distributed, Embedded Systems and Intelligent (DEIS) Unit and director of the ICT-competence center CISS, Center for Embedded Software Systems. I am a VILLUM Investigator with the project S4OS:  Scalable analysis and Synthesis of Safe,  Secure and Optimal Strategies for Cyber-Physical Systems. In 2015 I won an ERC Advanced Grant with the project LASSO for learning, analysis, synthesis and optimization of cyber physical systems. I am also director of the Danish Innovation Network InfinIT, as well as the Innovation Fund Denmark research center DiCyPS. I am the PI of the Villum Synergy Project CLAIRE and the project BEOCOVID funded by Poul Due Jensen Grundfos Foundation.  I am also co-PI in the Innovation Fund Denmark projects FED and DONUT and the Vienna Science and Technology Fund project WHATIF. Research My research interests include modeling and semantics, verification and logic, concurrency theory, performance analysis of real-time, embedded and cyber-physical systems, model checking and machine learning with numerous application in transport, energy and water management.  I am prime investigator of the award winning tool UPPAAL as well as its branches targeting planning, optimization, testing, synthesis, machine learning and compositional analysis. Affiliations Foreign Expert of China, Distinguished Professor, Northeastern University, China  (2018-)INRIA International Chair, France (2016- ) Recent and Upcoming Conferences (please submit) & Ínvited Talks DIREC Talks, Formal Verification and Machine Learning Joining ForcesxDigital Tech SummitMEMOCODE’21, 19th ACM-IEEE International Conference on Formal Methods and Models for System DesignNovo Nordisk Foundation, DataScience TalkInfoSecurity 2021 – Version 2.ICTAC 2021, 18th International Colloqwuium on Theoretical Aspects of ComputingSynthesis of Models and Systems, Simons Institute, Berkeley,  Spring 2021.(Invited Lecture).TACAS 2022 (PC Member)TACAS 2021 (Chair)CAV 2021 (PC Member)HSCC 2021 (PC Member)Workshop on Verified Systems, Isaac Newton Institute, Cambridge, June, 2021(Co-Organizer) Spin-outs UP4ALLAT-Systems PhD Thesis, Edinburgh University available here. Tweets by kglaau News GRUNDFOS ASSOCIATE PROFESSORSHIP IN CSAssociate Professorship in Computer Science sponsored by Poul Due Jensen Foundation. Application by March 15, 2019.Future Energy 2018DiCyPS Vision Day, March 8, 2018. Utzon Center, Slotspladsen 4, 9000 Aalborg. Full Professorship in CSFull Professorship in Computer Science at Aalborg University. Deadline for application: April 2, 2018. Contact Department of Computer Science Aalborg University Street: Selma Lagerlöfs Vej 300, City: 9220 Aalborg Øst Office: 0.2.32 Mail: kgl@cs.aau.dk",
  "content_length": 2852,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:05"
}