{
  "name": "Kim Binsted",
  "homepage": "http://www2.hawaii.edu/~binsted",
  "status": "success",
  "content": "Kim Binsted ICS Department HI-SEAS Publications Kim Binsted Biography Kim Binsted received her BSc in Physics at McGill (1991), and her PhD in Artificial Intelligence from the University of Edinburgh (1996). Her thesis topic was the computational modeling and generation of punning riddles, and her program, JAPE (Joke Analysis and Production Engine), generated puns such as \"What do you call a Martian who drinks beer? An ale-ien!\". She then went to Japan, where she conducted research at Sony's Computer Science Laboratories on human-computer interfaces, and then started a company, I-Chara KK, which developed social software agents for mobile phones. In 2002, she joined the faculty of the Information and Computer Sciences Department at the University of Hawaii, where she does research on artificial intelligence, human-computer interfaces, and long-duration human space exploration. In 2015, she received a MS in Planetary Geology, for attempting to characterize the deuterium-hydrogen ratio in the primitive Earth mantle. Dr. Binsted was a co-investigator at the UH-NASA Astrobiology Institute, which formed in late 2003. She was a NASA Summer Faculty Fellow at Ames Research Center in 2003 and 2004, where she worked on sub-vocal speech recognition technology in the Neuroengineering Laboratory. She was Chief Scientist on the FMARS 2007 Long Duration Mission, a four-month Mars exploration analogue on Devon Island in the Canadian High Arctic. In 2009, she spent her sabbatical as a visiting scientist at the Canadian Space Agency (CSA), working on the CSA's planetary analogues program. She spent the summers of 2016 and 2017 in Russia on a Fulbright Award. She served as an AAAS Science and Technology Policy Fellow (2018-2019) in Senator Whitehouse's office in Washington, DC. Dr. Binsted is the principal investigator for the NASA-funded HI-SEAS (Hawaii Space Exploration Analog and Simulation) program, which conducts long-duration space exploration simulations at an isolated habitat on Mauna Loa. Her hobbies include flying, diving, kayaking, cooking and improvisational comedy.",
  "content_length": 2095,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:58"
}