{
  "name": "Kim Marriott",
  "homepage": "https://research.monash.edu/en/persons/kimbal-marriott",
  "status": "success",
  "content": "Kimbal Marriott - Monash University Kimbal Marriott public CV View Scopus Profile Kimbal Marriott Professor Professor, Department of Human Centred Computing https://orcid.org/0000-0002-9813-0377 EmailKim.Marriottmonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 1987 …2025 Research activity per year Personal profile BiographyKim is a Professor in Computer Science. After obtaining his PhD in 1989 he worked at the IBM TJ Watson Research Center until joining Monash in 1993. He was previously Head of the Department of Human-Centred Computing and now leads the Monash Assistive Tech and Society (MATS) Centre. Research interestsI am currently exploring how new technologies like mixed reality, AI, refreshable tactile displays, and 3D printing can be used to present graphical content and environmental information to people who are blind or have low vision. I'm particularly intereseted in supporting inclusive data understanding and visualisation. Monash teaching commitmentKim has or is lecturing the following units in the Faculty of IT: FIT5147 Data Exploration and VisualisationFIT1049 IT Professional Practice Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, University of MelbourneAward Date: 1 May 1989Computer Science, Bachelor of Science (Honours), University of MelbourneAward Date: 1 Dec 1983 Research area keywordsAccessible GraphicsData VisualisationImmersive AnalyticsAssistive Technologies Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2000 2014 2017 2028 1 Not started 4 Active 31 Finished Projects per year Accessible Mathematics for Students: Accessible Mathematics for Students who are Blind or have Low VisionMarriott, K. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Fanshawe, M. (Chief Investigator (CI)), Wybrow, M. (Chief Investigator (CI)), Hayman, S. (Partner Investigator (PI)), Rodda, M. (Partner Investigator (PI)) & Jardine, A. (Partner Investigator (PI))ARC - Australian Research Council29/09/25 → 28/09/28Project: Research Enabling Accessible, Inclusive Playgrounds for Children and Carers with Vision ImpairmentReinhardt, D. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Marriott, K. (Chief Investigator (CI)), Holloway, L. (Partner Investigator (PI)), Loke, L. (Chief Investigator (CI)), Silveira, S. (Partner Investigator (PI)) & Tait, K. (Chief Investigator (CI))1/07/24 → 30/06/27Project: Research Accessible Data Exploration and Analysis for Blind PeopleMarriott, K. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Zukerman, I. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)) & Lee, B. (Partner Investigator (PI))ARC - Australian Research Council28/02/23 → 27/02/27Project: Research Conviction Politics: the convict routes of Australian democracyMoore, A. (Primary Chief Investigator (PCI)), McCormack, J. (Chief Investigator (CI)), Marriott, K. (Chief Investigator (CI)), Maxwell-Stewart, H. (Chief Investigator (CI)), Quinlan, M. (Chief Investigator (CI)), Carter, N. (Chief Investigator (CI)), Davis, M. (Chief Investigator (CI)), Brookes, J. (Partner Investigator (PI)) & Thomas, S. (Partner Investigator (PI))Union Education Foundation, University of Tasmania11/02/20 → 10/02/26Project: Research Immersive Analytics - Extension (Data61 CRP 31)Marriott, K. (Primary Chief Investigator (PCI)), Dwyer, T. (Chief Investigator (CI)), Jenny, B. (Chief Investigator (CI)), Cordeil, M. (Chief Investigator (CI)), Engelke, U. (Partner Investigator (PI)), Nguyen, H. (Partner Investigator (PI)), Watkins, D. (Partner Investigator (PI)), Chen, H. (Partner Investigator (PI)) & Knight, K. (Project Manager)Project: Research View all 36 projects Research output Research output per year 1987 1997 1998 1999 2000 2003 2005 2006 2007 2008 2015 2017 2018 2019 2020 2021 2023 2025 157 Conference Paper 81 Article 14 Chapter (Book) 9 Book 15 More 7 Other 3 Commissioned Report 2 Abstract 1 Edited Book 1 Foreword / Postscript 1 Review Article Research output per year Research output per year 3D Printing for Accessible Education: A Case Study in Assistive Technology AdoptionHolloway, L., Butler, M., Waddell, A. & Marriott, K., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 19 p. 273Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Enhancing Tactile Learning: A Co-Designed System for Supporting Speech Interaction with Multi-Part 3D Printed Models by Students who are BlindNagassa, R. G., Pham, A. K., Butler, M., Holloway, L., Stefanov, K., De Vent, S. & Marriott, K., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 18 p. 294Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 1 Citation (Scopus) \"It Brought the Model to Life\": Exploring the Embodiment of Multimodal I3Ms for People who are Blind or have Low VisionReinders, S., Butler, M. & Marriott, K., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 19 p. 367Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile The Sky is the Limit: Understanding How Generative AI can Enhance Screen Reader Users' Experience with Productivity ApplicationsPerera, M., Ananthanarayan, S., Goncu, C. & Marriott, K., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 17 p. 1165Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 1 Citation (Scopus) When Refreshable Tactile Displays Meet Conversational Agents: Investigating Accessible Data Presentation and Analysis with Touch and SpeechReinders, S., Butler, M., Zukerman, I., Lee, B., Qu, L. & Marriott, K., Jan 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 1, p. 864-874 11 p.Research output: Contribution to journal › Article › Research › peer-review 7 Citations (Scopus) View all 276 research outputs Prizes IEEE InfoVis 2015 best paper awardKieffer, S. A. (Recipient), Dwyer, T. (Recipient), Marriott, K. (Recipient) & Wybrow, M. (Recipient), 2015Prize: Prize (including medals and awards) IEEE InfoVis Best Paper Honorable Mention AwardYang, Y. (Recipient), Dwyer, T. (Recipient), Goodwin, S. (Recipient) & Marriott, K. (Recipient), 2016Prize: Prize (including medals and awards) Activities Activities per year 1998 2010 2016 2016 2 External research organisation, centre or institute 2 Membership of an advisory panel/policy group/ board 1 Submissions to industry or govt committees, commissions and inquiries 1 Editorial responsibility Activities per year Head - Clayton School of Information Technology - Faculty of Information Technology, Monash UniversityMarriott, K. (Chair/ Co-Chair)1 Jan 2016Activity: External Academic Engagement › External research organisation, centre or institute Monash University (External organisation)Marriott, K. (Member)1 Jan 2016Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board Member - Association for Computing Machinery (ACM)Marriott, K. (Member)1 Jan 2016Activity: External Academic Engagement › External research organisation, centre or institute Member - Senior Leadership Team - Monash UniversityMarriott, K. (Member)1 Jan 2010 → 31 Dec 2012Activity: External Academic Engagement › Submissions to industry or govt committees, commissions and inquiries Monash University (External organisation)Marriott, K. (Member)1 Jan 2010 → 31 Dec 2012Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board View all 6 activities",
  "content_length": 8957,
  "method": "requests",
  "crawl_time": "2025-12-01 13:42:59"
}