{
  "name": "Kimia Ghobadi",
  "homepage": "https://systems.jhu.edu/kimia",
  "status": "success",
  "content": "Kimia Ghobadi – JHU CSSE Skip to content Welcome to Dr. Ghobadi's Lab Kimia Ghobadi John C. Malone Assistant Professor I am the Johns C. Malone Assistant Professor in Civil and Systems Engineering at Johns Hopkins University. I am  a member of Center for Systems Science and Engineering (CSSE) and the Malone Center for Engineering in Healthcare. My main research interest is developing data-driven optimization frameworks for healthcare applications. Many of my projects are in collaborations with healthcare entities, including the Johns Hopkins Hospital. Prior to joining JHU, I obtained my PhD in Industrial Engineering at the University of Toronto (collaborating with the Princess Margaret Cancer Centre) and was a post-doctoral fellow at the MIT Sloan School of Management in collaboration with the Massachusetts General Hospital. Research Interests My research is inspired by data-driven applications of operations research. I am interested in both developing theory and empirical work. My recent work has focused on optimization models and algorithms with healthcare applications.Research Interest Topics: Data-driven operational research, Healthcare, Data analytics, Optimization techniques (inverse optimization, integer programming), Algorithms (approximation, heuristic, deterministic). Select Projects in Media Inverse Optimization for Diet RecommendationsOverview, Read moreCOVID-19 Hospital Capacity Management and Load BalancingOverview, Read more Current Doctoral Students Farzin Ahmadi, PhD CandidateNimeesha Chan, PhD CandidateFardin Ganjkhanloo, PhD CandidateKathy Kha, DEng CandidateJing Liu, PhD CandidateElahe Mohammadi Siahroodi, PhD StudentFelix Parker, PhD Candidate Our Current Interns Cindy Dong (UG in CS), Chenxi Fan (MS in Systems Eng), Yinuo Fan (MS in Systems Eng), Meredith Gao (UG in Applied Math and Stats), Mung Yao Jia (UG in CS), Shiyu Jiang (MS in CS), Victor Ke (UG in CS), Johnnie Massart (MS in CS), Chen Wang (MS in Biomed Eng), Tianyi Wu (MS in Applied Math and Stats), Shaochong (Shaun) Xu (MS in Systems Eng), Jia Yi (Ady) Zhang (UG in CS), Chi Zhang (MS in CS). Our Past Interns Michaela Corrothers (Alteryx), Wenyi Wang (Harvard University),  Nicky Shengwei Zhang (MIT Sloan), Yuhang Zhang (Vanderbilt University), Lilian Zhou (Amazon). Teaching ‘‘Advanced Topics in Optimization” (EN.560.645)Civil and Systems Engineering Department, Fall‘‘Introduction to Mathematical Decision Making” (EN.560.250)Civil and Systems Engineering Department, Spring ‘‘Operations Research” (EN.560.450, EN.560.650) Civil and Systems Engineering Department, Spring‘‘CaSE Coding” (EN.560.291)Civil and Systems Engineering Department, Spring Awards and Honors Discovery Award, Johns Hopkins University, 2020John C. Malone Assistant Professorship, 2019. Natural Sciences and Engineering Research Council of Canada Post-Doctoral Fellowship (NSERC PDF), 2015INFORMS Judith Liebman Award for Outstanding Student Volunteer Work at University of Toronto Student Chapter, INFROMS San Francisco, 2014First place in poster competition, OCAIRO category, 11th Imaging Network Ontario (ImNO) Symposium, Toronto, ON, Provincial Competition, 2013Natural Sciences and Engineering Research Council of Canada Postgraduate Scholarships (NSERC PGS-D), 2012Ontario Graduate Scholarship (OGS), 2011Mart Liinve Graduate Scholarship, Ontario Graduate Scholarship in Science and Technology (OGSST), 2010Shared Hierarchical Academic Research Computing Network (SHARCNET) Graduate Fellowship, South Ontario Super-Computer Cluster, 2008First place as a team at the first CORS/VISUAL8 Student Simulation Competition, CORS Annual Meeting, London, ON, International Competition, 2007First place as a team at the first International Operations Research Case Competition (IORCC), Simon Fraser University, Vancouver, BC, 2007 Contact Personal Site (JHU) kimia@jhu.edu Latrobe Hall, Room 201M, Johns Hopkins University Linkedin Profile Google Scholar For a list of publications, please click here (Google Scholar)",
  "content_length": 4006,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:01"
}