{
  "name": "Kimon Fountoulakis",
  "homepage": "https://opallab.ca",
  "status": "success",
  "content": "WatCL Lab - Home - WatCL Lab WatCL Lab - Home | WatCL Lab Welcome to the WatCL Lab The Waterloo Computational Learning Lab at the Cheriton School of Computer Science, University of Waterloo. The Waterloo Computational Learning (WatCL) Lab is a research group at the Cheriton School of Computer Science. We work on machine learning and artificial intelligence models, with a focus on computational learning for long reasoning processes, such as algorithmic tasks. We are located at the University of Waterloo, a vibrant technological hub with Concept, Velocity and Google around the block. We are also part of the Scientific Computation Group and the Waterloo Data and Artificial Intelligence Institute. We are grateful for funding from the University of Waterloo and NSERC. Explore Our Publications Meet Our Team Latest News 7 October 2025 New paper: On the Statistical Query Complexity of Learning Semiautomata: a Random Walk Approach. 18 September 2025 Our paper Learning to Add, Multiply, and Execute Algorithmic Instructions Exactly with Neural Networks was accepted at NeurIPS 2025. 10 June 2025 Aseem Baranwal has won the SCS PhD Dissertation Award! 7 July 2025 Our paper Exact Learning of Permutations for Nonzero Binary Inputs with Logarithmic Training Size and Quadratic Ensemble Complexity was accepted at the 3rd Workshop on High-Dimensional Learning Dynamics (HiLD) at ICML 2025. 25 May 2025 New paper: Learning to Add, Multiply, and Execute Algorithmic Instructions Exactly with Neural Networks. 22 May 2025 Artur Back de Luca has been awarded the Ontario Graduate Scholarship (OGS) and the President's Graduate Scholarship (PGS). 1 May 2025 Our paper Positional Attention: Expressivity and Learnability of Algorithmic Computation was accepted at ICML 2025. 28 February 2025 Artur Back de Luca will join Amazon NY as an intern in May/June 2025. 4 February 2025 New paper: Positional Attention: Expressivity and Learnability of Algorithmic Computation. You can read a brief announcement of it here. 10 January 2025 Shenghao Yang successfully defended his thesis with title 'Perspectives of Graph Diffusion: Computation, Local Partitioning, Statistical Recovery, and Applications'. You can read a brief announcement of it here. View All News Our Research Computational Learning Computational learning theory applied to algorithmic tasks. Graph Neural Networks Theoretical understanding of graph neural networks for reasoning and classification applications. Local Graph Clustering Scalable algorithms for detecting communities and clusters in large-scale networks.",
  "content_length": 2575,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:04"
}