{
  "name": "Kiran Balagani",
  "homepage": "https://site.nyit.edu/bio/kbalagan",
  "status": "success",
  "content": "Kiran Balagani | New York Tech Staff & Faculty Directory Kiran Balagani Professor; Computer Science, College of Engineering & Computing Sciences Professor; Electrical & Computer Engineering, College of Engineering & Computing Sciences Education Credentials: Ph.D.Joined New York Tech: 2011 Kiran Balagani co-directs the cybersecurity laboratory at NYIT College of Engineering and Computing Sciences, and conducts research in behavioral biometrics, biometric security, privacy, anomaly detection, and applied machine learning. His research has appeared in several leading peer-reviewed journals and conferences. He has three U.S. patents related to network-centric attack detection. In addition, Balagani teaches graduate and undergraduate courses such as Computer Networks, Artificial Intelligence, and Network and Perimeter Security. He also created the new graduate course on Biometrics. Prior to New York Tech, Balagani was a Research Assistant Professor at the Center for Secure Cyberspace, Louisiana Tech University. He received his Ph.D. in computational analysis and modeling, his M.S. in mathematics and computer science from Louisiana Tech University, and his B.S. in computer science and engineering from Bangalore University. Recent Projects/Research Hand Movement, Orientation, and Grasp (H-MOG): A New Behavioral Modality for Active Authentication of Smartphone UsersPI: K. S. Balagani; Co-PIs: Paolo Gasti, New York Tech, Gang Zhou, College of William and MarySource: Defense Advanced Research Projects Agency (DARPA)Duration: 23 September 2013 – 31 December 2014Funding Amount: $513, 671.00 (New York Tech’s share: $328, 226.00) Investigating Cognitive Rhythms as a New Modality for Continuous AuthenticationPI: K. S. Balagani; Co-PI: V. Phoha (Louisiana Tech University); Co-PI: A. Rosenberg (CUNY)Source: Defense Advanced Research Projects Agency (DARPA)Duration: 6/18/2012 – 5/17/2013Funding Amount: $479,886.00 (New York Tech’s share: $175,463.60) Design and Development of a Suite of Keyboard-based Biometrics for an Active Authentication System PI: Vir V. Phoha, Louisiana Tech University; Co-PIs: K. S. Balagani, New York Tech; Andrew Rosenberg, CUNY; Enamul Karim, Louisiana Tech University; Mike O’Neal, Louisiana Tech University; Craig Spohn, Cyber Innovation Center, LouisianaSource: Defense Advanced Research Projects Agency (DARPA)Duration: 18 months (27 September 2013-30 September 2015)Funding Amount: $1,796,558.75 (New York Tech’s share: $231,176.00) Smartphone Operations and Security (SOS) Research at New York TechPI: Cecilia Dong; Faculty Mentor: K. S. BalaganiSource: National Science FoundationDuration: 3 years (1 June 2013 – 30 May 2016) Publications J. Sedenka, S. Govindarajan, P. Gasti, and K. S. Balagani, “Secure Outsourced Biometric Authentication with Performance Evaluation on Smartphones,” IEEE Transactions on Information Forensics and Security, vol.10, no.2, pp.384-396, Feb. 2015 T. Hayajneh, S. Ullah, B. J. Mohd, K. S. Balagani, “An Enhanced WLAN Security System With FPGA Implementation for Multimedia Applications,” IEEE Systems Journal, Vol. PP, no.99, pp.1-10, May 2015. D. G. Brizan, A. Goodkind, P. Koch, K. S. Balagani, V. V. Phoha, A. Rosenberg, “Utilizing Linguistically Enhanced Keystroke Dynamics to Predict Typist Cognition and Demographics,” International Journal of Human-Computer Studies, Vol. 82, pp. 57-68, Oct. 2015. K. A. Rahman, K. S. Balagani, V. V. Phoha, “Snoop-forge-replay Attacks on Continuous Verification with Keystrokes.” IEEE Transactions on Information Forensics and Security, Vol. 8, No. 3, March 2013. H. Locklear, Z. Sitova, S. Govindarajan, A. Goodkind, D. Brizan, P. Gasti, A. Rosenberg, V. Phoha, and K. S. Balagani. “Continuous Authentication with Cognition-centric Text Production and Revision Features,” IEEE/IAPR International Joint Conference on Biometrics, 2014, Clearwater, Florida, USA. Honors + Awards Best Reviewer, IEEE/IAPR International Joint Conference on Biometrics, Clearwater, Florida–2014 Outstanding Research and Service Award, Center for Secure Cyberspace, Louisiana Tech University–2011 Courses Taught at New York Tech CSCI 860: Special Topics – Biometrics and Its Applications in a Networked Society CSCI 690: Computer Networks CSCI 345: Computer Networks CSCI 870: Project I CSCI 889: Thesis I INCS 870: Project I CSCI 889: Thesis I CSCI 755: Artificial Intelligence CSCI 455: Senior Project CSCI 891: Thesis II ITEC 410: Internetworking Laboratory CSC 460: Special Topics: Network Security ITEC 410: Internetworking Laboratory Additional Contact Info ResearchGate Contact Information Email: kbalagan@nyit.edu Phone: 516.686.1302 Office: Long Island, NY Website: https://scholar.google.com/citations?user=bU6NdUYAAAAJ&hl=en&oi=ao By continuing to use the website, you consent to analytics tracking per New York Tech's Privacy StatementAccept Cookies",
  "content_length": 4863,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:06"
}