{
  "name": "Kira Goldner",
  "homepage": "https://www.kiragoldner.com",
  "status": "success",
  "content": "Kira Goldner Kira Goldner Shibulal Family Career Development Professor Faculty of Computing & Data Sciences Boston University Email: goldner [at] bu.edu (read first if we aren't acquainted) Office: CDS 1339, 665 Commonwealth Ave, Boston, MA 02215 About me I am a Shibulal Family Career Development Assistant Professor in the Faculty of Computing & Data Sciences at Boston University, am affiliated with Computer Science, and am a member of the Algorithms & Theory group. I am also the Founder and Director of BEACH. My research interests are primarily in algorithmic mechanism design and approximation algorithms, particularly in using these techniques to improve access to rights and opportunities or mitigate global harms. As part of this agenda, I originally co-founded the Mechanism Design for Social Good initiative. I am also interested in the intersection of these topics with healthcare, climate change, law, AI Ethics, and more, as well as more foundational topics such as revenue maximization, and varied behavioral and informational assumptions. See my publications on my research page or information for prospective students. Before joining Boston University, I was an NSF Mathematical Sciences Postdoctoral Research Fellow and a Data Science Institute Postdoctoral Fellow at Columbia University hosted by Tim Roughgarden. I received my PhD in Computer Science & Engineering at the University of Washington, where I was very fortunate to be advised by Anna Karlin. During my PhD, I was very generously supported by a 2017-19 Microsoft Research PhD Fellowship and a 2016-17 Google Anita Borg Scholarship. Before that, I attended Oberlin College where I received a B.A. in Mathematics and minored in Computer Science. I also studied at Budapest Semesters in Mathematics. My Curriculum Vitae can be found here. My cats Scarf and Xenna have their own instagram with far more interesting content than the rest of this webpage. Students: The best part of an academic job is working with students. This currently includes: Divyarthi Mohan (Postdoc, on the market!) Thodoris Tsilivis (PhD student) Anh Phung (PhD student) Former Students: Michael Hyder (undergrad) → Rutgers CS PhD Interested in doing research with me? Check out my information for prospective students. Upcoming and Recent News: New (Spotlight) paper in NeurIPS 2025 on Multidimensional Bayesian Utility Maximization with Taylor Lundy! New paper \"Bilateral Trade with Interdependent Values: Information vs. Approximation\" in EC 2025 with Shahar Dobzinski, Alon Eden, Ariel Shaulker, and Thodoris Tsilivis! I was on the EC 2025 Mentoring Workshop Job Market Panel. I gave a talk on Multidimensional Bayesian Utility Maximization at ALGA 2025. I organized the inaugural BEACH Day workshop on Behavioral Models in EconCS on April 4, 2025 with Divyarthi Mohan. I am very honored to have received the NSF CAREER Award on \"Multidimensional Utility Maximization when Ordeals are Payments\"! I presented new papers \"To Regulate or Not to Regulate\" and \"Non-Adaptive Matroid Prophet Inequalities\" at SAGT 2024. Our FOCS 2023 paper \"A Constant Approximation for Private Interdependent Valuations\" is being presented at Highlights Beyond EC 2024 by co-author Divya Mohan! I spoke at the SLMath/MSRI Program on the Mathematics and Computer Science of Market and Mechanism Design in September! Both their Connections Workshop Sept 7-8 and their Introductory Workshop Sept 11-15. [ talk 1 | talk 2 ] I wrote an extremely detailed blog post on my advice for and experience with the academic job market. Created by Kira Goldner | Updated September 2025",
  "content_length": 3607,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:04"
}