{
  "name": "Kirill Serkh",
  "homepage": "https://www.cs.toronto.edu/~kserkh",
  "status": "success",
  "content": "Kirill Serkh Kirill Serkh's Home Page Assistant Professor of Mathematics and Computer Science, University of Toronto Research Interests: Numerical analysis, Scientific computing, Partial differential equations, Numerical linear algebra, Quadrature and approximation theory, Special functions Mailing Address: Department of Mathematics University of Toronto 40 St. George St, room 6290 Toronto, Ontario M5S 2E4 Canada Office information: Bahen Building 40 St. George St, room 6260 Contact information: phone: (647) 793-5984 email: kserkh@math. toronto.edu Selected Papers: Shukui Chen, Kirill Serkh, and James Bremer. On the adaptive Levin method. Numer. Math. 156 (2024): 1927–1985. arXiv Mohan Zhao and Kirill Serkh. A continuation method for fitting a bandlimited curve to points in the plane. Adv. Comput. Math. 50.74 (2024). Code arXiv Tech. Rep. Zewen Shen and Kirill Serkh. Rapid Evaluation of Newtonian Potentials on Planar Domains. SIAM J. Sci. Comput. 46.1 (2024): A609–A628. Data arXiv Tech. Rep. Seungbae Bang, Kirill Serkh, Oded Stein, and Alec Jacobson. An adaptive fast-multipole-accelerated hybrid boundary integral equation method for accurate diffusion curves. ACM T. Graphic. 42.6 (2023): 1–28. Confer. Webpage arXiv Kirill Serkh and James Bremer. Phase function methods for second order inhomogeneous linear ordinary differential equations. J. Sci. Comput. 98.1 (2024): 14. arXiv Dawei Wang, Kirill Serkh, and Christina Christara. A high-order deferred correction method for the solution of free boundary problems using penalty iteration, with an application to American option pricing. J. Comput. Appl. Math. 432 (2023): 115272. arXiv Tech. Rep. James Garritano, Yuval Kluger, Vladimir Rokhlin, and Kirill Serkh. On the efficient evaluation of the azimuthal Fourier components of the Green's function for Helmholtz's equation in cylindrical coordinates. J. Comput. Phys. 471 (2022): 111585. Code arXiv Tech. Rep. Zewen Shen and Kirill Serkh. On the evaluation of the eigendecomposition of the Airy integral operator. App. Comput. Harmon. Anal. 57 (2022): 105–150. arXiv Tech. Rep. Manas Rachh and Kirill Serkh. On the Solution of the Stokes Equation on Regions with Corners. Commun. Pur. Appl. Math. 73.11 (2020): 2295–2369. arXiv Tech. Rep. Kirill Serkh. On the Solution of Elliptic Partial Differential Equations on Regions with Corners II: Detailed Analysis. App. Comput. Harmon. Anal. 46.2 (2019): 250–287. Tech. Rep. Kirill Serkh and Vladimir Rokhlin. On the Solution of the Helmholtz Equation on Regions with Corners. PNAS 113.33 (2016): 9171–9176. Tech. Rep. Kirill Serkh and Vladimir Rokhlin. On the Solution of Elliptic Partial Differential Equations on Regions with Corners. J. Comput. Phys. 305 (2016): 150–171. Tech. Rep. Selected Preprints: Zakaria Patel and Kirill Serkh. Enhancing Image Layout Control with Loss-Guided Diffusion Models. 2nd ver. arXiv preprint arXiv:2405.14101 (2024). Accepted at WACV 2025. Andreas A. Buchheit, Torsten Keßler, and Kirill Serkh. On the computation of lattice sums without translational invariance. arXiv preprint arXiv:2403.03213 (2024). Accepted at Math. Comput. Code Dawei Wang, Christina Christara, and Kirill Serkh. Analysis of high-order time-stepping schemes for nonsmooth initial conditions in financial pricing. University of Toronto NA Technical Report (2023). Mohan Zhao and Kirill Serkh. On the Approximation of Singular Functions by Series of Non-integer Powers. 3rd ver. arXiv preprint arXiv:2308.10439 (2023). Accepted at IMA J. Numer. Anal. Tech. Rep. Data Zewen Shen and Kirill Serkh. On polynomial interpolation in the monomial basis 4th ver. arXiv preprint arXiv:2212.10519 (2022). Accepted at SIAM J. Numer. Anal. Tech. Rep. Zewen Shen and Kirill Serkh. Accelerating potential evaluation over unstructured meshes in two dimensions. University of Toronto NA Technical Report (2022). arXiv Kirill Serkh and Vladimir Rokhlin. A Provably Componentwise Backward Stable O(n²) QR Algorithm for the Diagonalization of Colleague Matrices. University of Toronto NA Technical Report (2021). arXiv Kirill Serkh. A Note on the Use of the Spectra of Multiplication Operators as a Numerical Tool. Yale Technical Report YALEU/DCS/TR-1541 (2018). Kirill Serkh. On the Solution of Elliptic Partial Differential Equations on Regions with Corners III: Curved Boundaries. New York University Technical Report NYU/CIMS/TR2018-989 (2018). Kirill Serkh. On Generalized Prolate Spheroidal Functions. Yale Technical Report YALEU/DCS/TR-1519 (2015).",
  "content_length": 4511,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:07"
}