{
  "name": "Kiriakos N. Kutulakos",
  "homepage": "http://www.cs.toronto.edu/~kyros",
  "status": "success",
  "content": "Kyros Kutulakos' Home Page Kyros Kutulakos Professor Department of Computer Science University of Toronto Office: BA7270, Bahen Center (7th floor) Phone: (416) 946-8045 Fax: (416) 978-1455 Email: kyros AT cs.toronto.edu Mailing address: 40 St. George St, Rm 4283, Toronto, Ontario M5S 2E4, Canada Affiliations: Toronto Computational Imaging Group, Computer Vision Group, Dynamic Graphics Project (DGP), Vector Institute Group Members Courses PhD students Mian Wei Parsa Mirdehghan Robin Swanson Esther Lin Victor Rong MSc students Maxx Wu MScAC students Jamie Xu Postdocs Harel Haim Sotiris Nousias BSc & BEng students Haojun Qiu Shahmeer Athar Kevin Vaidyan Undergraduate (Spring 2024) CSC320: Introduction to Visual Computing Graduate (Spring 2024) CSC2530: Computational Imaging & 3D Sensing Selected Publications News, Honors & Activities Computational single-photon imaging Passive Ultra-Wideband Single-Photon Imaging (ICCV 2023) Theory of Fermat Paths for NLOS Shape Reconstruction (CVPR 2019) First-Returning Photons for Non-Line-of-Sight Imaging (CVPR 2017) Computational CMOS image sensors Regression-Based HDR Flux-to-Digital Conversion (ISSCC 2023) 39kHz Coded Sensor for Adaptive Snapshot Imaging (JSSC 2022) Dual-Tap CMOS Sensor for Computational Imaging (JSSC 2019) Coded Two-Bucket Cameras for Computer Vision (ECCV 2018) Computational imaging for astronomy Neural Control of Adaptive Optics Telescopes (MNRAS 2021) Computational imaging for microscopy Sub-Wavelength Passive Super-Oscillatory Imaging (Optica 2022) Non-scanning Incoherent Super-Oscillatory Imaging (ACS Photonics 2021) Neural rendering Transient Neural Radiance Fields for Lidar View Synthesis (NeurIPS 2023) A Neural Rendering Framework for Free-Viewpoint Relighting (CVPR 2020) Machine learning for structured-light 3D imaging Auto-tuning Structured Light by Optical SGD (CVPR 2020) Optimal Structured Light A La Carte (CVPR 2018) Computational cameras for 3D sensing & light transport analysis Epipolar Time of Flight (SIGGRAPH 2017) Computational Imaging on the Electric Grid (CVPR 2017) Energy-Efficient 2D & 3D Imaging (SIGGRAPH 2015) 3D Shape & Indirect Appearance by Structured Light Transport (CVPR 2014) 5D Transient Analysis of Light Transport (SIGGRAPH 2014) Primal-Dual Coding to Probe Light Transport (SIGGRAPH 2012) Optical Computing for Fast Light Transport Analysis (SIGGRAPH Asia 2010) Computational photography Learning Lens Blur Fields (arXiv 2023) Depth from Defocus in the Wild (CVPR 2017) Light-Efficient Photography (ECCV 2008, PAMI 2011) Time-Constrained Photography (ICCV 2009) Confocal Stereo (ECCV 2006, IJCV 2009) 3D computer vision in presence of complex light transport Dynamic Refraction stereo (ICCV 2005, PAMI 2011) Refractive 3D Shape by Light-Path Triangulation (ICCV 2005, IJCV 2008) A Theory of Inverse Light Transport (ICCV 2005) 3D / 4D scene modeling & rendering from multiple views Multi-View 4D Capture by Surfel Sampling (ICCV 2001, IJCV 2002) A Theory of Shape by Space Carving (ICCV 1999, IJCV 2000) Plenoptic Image Editing (ICCV 1998, IJCV 2002) Augmented reality Calibration-Free Augmented Reality (VRAIS 1996, TVCG 1998) Recent news (12/23) Kyros wins Dean's research excellence award (10/23) Passive ultra-wideband imaging wins the best paper prize at ICCV (9/23) Congrats to Rahul Gulve for his amazing PhD defense!  (9/23) PhD student Victor Rong and MSc student Maxx Wu join the group! (5/23) Visiting PhD alumn Mark Sheinin to join Weizmann Inst. as Assistant Prof (1/23) PhD alumn Wenzheng Chen to join Peking U. as Assistant Prof Paper Prizes Best paper award (Marr Prize), ICCV 2023 Best paper award, CVPR 2019 Best student paper award, CVPR 2017 Best paper honorable mention, CVPR 2014 Best paper honorable mention, ECCV 2006  Best paper (Marr Prize) honorable mention, ICCV 2005 Best paper award (Marr Prize), ICCV 1999 Best student paper award, CVPR 1994 Other Selected Honors Best demo awards at ICCP 2021, CVPR 2015, ICCP 2015 PhD alum O'Toole wins SIGGRAPH oustanding dissertation hon. mention Sloan Research Fellowship, 2001 Conference Organization Program co-Chair, ICCV 2013 Program co-Chair, ICCP 2010 Program co-Chair, CVPR 2003",
  "content_length": 4180,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:05"
}