{
  "name": "Kirill E. Medvedev",
  "homepage": "https://www.cs.ucf.edu/person/kirillmedevdev",
  "status": "success",
  "content": "Kirill Medvedev Skip to main content Kirill MedvedevAssistant Professor EMAIL Office: L3Harris Engineering Center Email: kirill.medvedev@ucf.edu Phone: 407-823-3957 Medvedev Lab Biography Research Publications News BIOGRAPHY Kirill Medvedev joined UCF In August 2025 and started his research group, Medvedev Lab. Prior to coming to UCF, he served at the University of Texas Southwestern Medical Center. He earned a master’s degree in bioinformatics from Novosibirsk State University in 2010 and a doctoral degree in mathematical biology and bioinformatics from the Institute of Cytology and Genetics in 2015. EDUCATION Ph.D. in Mathematical Biology and Bioinformatics, Institute of Cytology and GeneticsM.S. in Bioinformatics, Novosibirsk State University RESEARCH Computational BiologyBioinformaticsStructural BiologyDrug DiscoveryDigital Pathology PUBLICATIONS Kirill E. Medvedev, R. Dustin Schaeffer, Nick V. Grishin (2025) Leveraging AI to Explore Structural Contexts of Post-Translational Modifications in Drug Binding. Journal of Chemoinformatics 17(1): 67. https://doi.org/10.1186/s13321-025-01019-ySchaeffer R.D., Medvedev K.E., Andreeva A., Chuguransky S., Lázaro-Pinto B., Zhang J., Cong Q., Bateman A., Grishin N.V. (2025) ECOD: Integrating classifications of protein domains from experimental and predicted structures. Nucleic Acids Research, 53(D1), D411-D418. https://doi.org/10.1093/nar/gkae1029Kirill E. Medvedev, R. Dustin Schaeffer, Nick V. Grishin (2024) DrugDomain: The evolutionary context of drugs and small molecules bound to domains. Protein Science 33(8): e5116. https://doi.org/10.1002/pro.5116Schaeffer R.D., Zhang J., Medvedev K.E., Kinch L.N., Cong Q., Grishin N.V. (2024). ECOD domain classification of 48 whole proteomes from AlphaFold Structure Database using DPAM2. PLoS Computational Biology, 20(2), e1011586. https://doi.org/10.1371/journal.pcbi.1011586Medvedev K.E., Acosta P.H., Jia L., Grishin N.V. (2024). Deep learning for subtypes identification of pure seminoma of the testis. Clinical Pathology, 17, 1-7. https://doi.org/10.1177/2632010X241232302Medvedev K.E., Schaeffer R.D., Chen K.S., Grishin N.V. (2023). Pan-cancer structurome reveals overrepresentation of beta sandwiches and underrepresentation of alpha helical domains. Scientific Reports, 13(1), 11988. https://doi.org/10.1038/s41598-023-39273-5Savelyeva A.V & Medvedev K.E. (2023). Seminoma subtypes differ in the organization and functional state of the immune microenvironment. 3 Biotech, 13(3), 110. https://doi.org/10.1007/s13205-023-03530-1 LATEST NEWS Skip to content",
  "content_length": 2576,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:11"
}