{
  "name": "Kirk Martinez",
  "homepage": "https://www.ecs.soton.ac.uk/people/km2",
  "status": "success",
  "content": "Professor Kirk Martinez | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor Kirk Martinez Prof of Electronics & Computer Science Accepting applications from PhD students. Connect with Kirk Email: km@ecs.soton.ac.uk Tel: +44 23 8059 4491 ORCID On this page About Research Publications External roles and responsibilities Biography About Research Publications External roles and responsibilities Biography About Kirk Martinez is a Professor in Electronics and Computer Science at the University of Southampton UK. His research interests include environmental sensor networks, Internet of Things and Imaging. Research Research groups Member of: Web and Internet Science Southampton Marine and Maritime Institute Southampton Geospatial Centre for Robotics Research projects Completed projects GLACSWEB 2 Researchers: Professor Kirk Martinez Professor Jane Hart Sponsor: EPSRC libVIPS Researchers: Professor Kirk Martinez Fing-Art-Print Researchers: Professor Kirk Martinez Sponsor: European Union Sculpteur Researchers: Professor Kirk Martinez Sponsor: European Union superRTIdome - high precision RTI imaging system Researchers: Professor Kirk Martinez Sponsor: Centre of Maritime Technoloiges e.v. E-CHASE (ECS) Researchers: Professor Kirk Martinez Emeritus Professor Paul Lewis Sponsor: European Union Reflectance Transformation Imaging Systems for Ancient Documentary Artefacts Researchers: Professor Kirk Martinez Sponsor: Arts & Humanities Research Council The RTI FoF: Reflectance Transformation Imaging Follow-on Funding Project Researchers: Professor Kirk Martinez Sponsor: Arts & Humanities Research Council KTS-EPSRC IAA (Innovation Acceleration Account) Researchers: Professor Neil White Professor Kirk Martinez Sponsor: EPSRC Hart, Using the latest technology to record to understand the retreat of two contrasting Icelandic Glaciers Researchers: Professor Jane Hart Professor Kirk Martinez Sponsor: National Geographic Society SemsorGrid Researchers: Professor Jason Sadler , Professor Kirk Martinez Sponsor: European Union Hart, NERC, Using Internet of Things technology to aid in Earth and Environmental Science Research Researchers: Professor Jane Hart Professor Kirk Martinez ARCOMEM-EU FP7-Paul Lewis Researchers: Emeritus Professor Paul Lewis Professor Kirk Martinez , Dame Wendy Hall Sponsor: European Union The role of subglacial soft bed hydrology on glacier response to climate change Researchers: Professor Jane Hart Professor Kirk Martinez Sponsor: Leverhulme Trust Investigating Glacier Stick-Slip Motion Researchers: Professor Jane Hart Professor Kirk Martinez Sponsor: Leverhulme Trust Publications Contrasting dynamic behaviour of six lake-terminating glaciers draining the Vatnajökull Ice Cap and links to bedrock topography Nathaniel R. Baurley, Amelia Andrews, Benjamin Robson, Sherif Attia, Kirk Martinez & Jane K. Hart, 2025, Remote Sensing in Earth System Science, 2025(1), 696-717 DOI: 10.1007/s41976-025-00213-8 Type: article Seasonal velocity patterns provide insights for the soft-bed subglacial hydrology continuum Jane K. Hart, Nathaniel R. Baurley, Amy Bonnie, Benjamin A. Robson, Graeme McLachlan Bragg & Kirk Martinez, 2025, Communications Earth & Environment, 6(1) DOI: 10.1038/s43247-025-02198-0 Type: article Different styles of subglacial soft bed hydrology: examples from Breiðamerkurjökull and Fjallsjökull, Iceland Jane K. Hart, Kirk Martinez, Nathaniel Ross Baurley, Benjamin A. Robson & Amelia Andrews, 2025, Earth Surface Processes and Landforms, 50(2) DOI: 10.1002/esp.70014 Type: article The libvips image processing library John Cupitt, Kirk Martinez, Lovell Fuller & Kleis Auke Wolthuizen, 2025 DOI: 10.2352/EI.2025.37.12.HPCI-178 Type: conference Understanding energy consumption in real-world E-IoT systems with CoAP, RPL, and 6LoWPAN Jiawei Lu, Kirk Martinez & Alex Weddell, 2024 DOI: 10.1007/978-981-97-4780-1_14 Type: conference The seasonal evolution of subglacial drainage pathways beneath a soft-bedded glacier Jane K. Hart, David S. Young, Nathaniel Baurley, Benjamin A. Robson & Kirk Martinez, 2022, Communications Earth & Environment, 3(1) DOI: 10.1038/s43247-022-00484-9 Type: article Quantifying subglacial soft bed sedimentary processes Jane Hart, Kirk Martinez, Nathaniel Baurley & Benjamin Robson, 2022 DOI: 10.5194/egusphere-egu22-1801 Type: conference Sensor networks and geohazards Jane Hart & Kirk Martinez, 2022 DOI: 10.1016/B978-0-12-818234-5.00037-7 Type: bookChapter Increased winter warm events in Iceland drive enhanced glacier velocity and melting Jane Hart, Kirk Martinez, Nathaniel Baurley & Benjamin Robson, 2021 DOI: 10.5194/egusphere-egu21-8411 Type: conference Sensor networks and geohazards Jane Hart & Kirk Martinez, 2020 DOI: 10.1016/B978-0-12-818234-5.00037-7 Type: bookChapter External roles and responsibilities Name: A tale of two glaciers Role: Speaker Year: 2019 Name: American Geophysical Union (Publisher) Role: Reviewer Year: 2019 - 2022 Biography Kirk Martinez is a Professor in Electronics and Computer Science at the University of Southampton UK. He gained a BSc in Physics from the University of Reading and a PhD in Image Processing in the department of Electronic Systems Engineering at the University of Essex. While Arts Computing Lecturer at Birkbeck College London (1987–96) he pioneered the digital imaging of paintings together with The National Gallery, London in the European project VASARI (1980s). This led to development of art imaging projects to print accurate art books (MARC project), view high detail images on the web (Viseum project) and find art images online (Artiste, SCULPTEUR and eCHASE). He has published this research in books on image processing and computer architecture as well as Transactions of the IEEE on content-based image retrieval He was an advisor on the imaging and image processing required for the Archimedes Palimpsest. Recent research led to a new imaging system for ancient seals together with Oxford University - which is helping to capture and read historic texts.[1] He is one of the founders of the Electronics and the Visual Arts: EVA Conferences. He helped to found the Earth and Space Science Informatics focus group of the American Geophysical Union, is on the executive committee and has run ten annual sessions on applying sensor networks to earth science. In 2017 he received the AGU's Leptoukh award [2] for contributions to this area. He is the co-founder of the VIPS (software) image processing package together with John Cupitt (National Gallery London and now Imperial College London). This is used widely and available as a standard package in Linux distributions as well as for Microsoft Windows/OS X. It is known for mosaicing, colour and parallel processing/performance. It has become the fastest way to generate thumbnails and resize images on web servers so is in use in Wikipedia itself[3] and sites such as Booking.com. His current research is on Environmental Sensor Networks[4] which are wireless sensor networks for studying/monitoring the environment, particularly in relation to glaciers [5] and climate change (Glacsweb project). This research featured on BBC technology news and the BBC's News, it was the first wireless sensor network designed to be used in/under glaciers. His work to test the technology for landslide detection was also on BBC n",
  "content_length": 31340,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:09"
}