{
  "name": "Kirshanthan Sundararajah",
  "homepage": "https://kirshanthans.github.io",
  "status": "success",
  "content": "Kirshanthan (\"Krish\") Sundararajah Search Assistant Professor Virginia Tech | Computer Science About I am an Assistant Professor of Computer Science at Virginia Tech. My research interests span the areas of compilers, programming languages, and high-performance computing. I am particularly interested in solving challenges arise from the irregularity in programs. I am currently looking for motivated PhD students starting in Fall 2025. Please feel free to reach out if my work interests you. I received my PhD from Purdue University where I was fortunate enough to advised by Milind Kulkarni. I was part of the PurPL group at Purdue University. I earned my Bachelor’s in Electronic and Telecommunication Engineering from UoM, Sri Lanka. [Research Statement] [Teaching Statement] Interests Compilers Programming Languages High-Performance Computing Education PhD in Electrical and Computer Eng., 2023 Purdue University, USA MS in Electrical and Computer Eng., 2022 Purdue University, USA BSc in Electronic and Telecom. Eng., 2014 University of Moratuwa, Sri Lanka Publications Conferences SparseAuto: An Auto-scheduler for Sparse Tensor Computations using Recursive Loop Nest Restructuring Adhitha Dias, Logan Anderson, Kirshanthan Sundararajah, Artem Pelenitsyn, Milind Kulkarni Preprint PDF Code Slides HyBF: A Hybrid Branch Fusion Strategy for Code Size Reduction Rodrigo Rocha, Charitha Saumya, Kirshanthan Sundararajah, Pavlos Petoumenos, Milind Kulkarni, Michael F. P. O’Boyle PDF Code Slides UniRec: A Unimodular-Like Framework for Nested Recursions and Loops Kirshanthan Sundararajah, Charitha Saumya, Milind Kulkarni PDF Slides SparseLNR: Accelerating Sparse Tensor Computations Using Loop Nest Restructuring Adhitha Dias, Kirshanthan Sundararajah, Charitha Saumya, Milind Kulkarni Preprint PDF Code Video DARM: Control-Flow Melding for SIMT Thread Divergence Reduction Charitha Saumya, Kirshanthan Sundararajah, Milind Kulkarni Preprint PDF Code Slides HACCLE: Metaprogramming for Secure Multi-Party Computation Yuyan Bao, Kirshanthan Sundararajah, Raghav Malik, Qianchuan Ye, Christopher Wagner, Nouraldin Jaber, Fei Wang, Mohammad Hassan Ameri, Donghang Lu, Alexander Seto, Benjamin Delaware, Roopsha Samanta, Aniket Kate, Christina Garman, Jeremiah Blocki, Pierre-David Letourneau, Benoit Meister, Jonathan Springer, Tiark Rompf, Milind Kulkarni Preprint PDF Code Slides Video Composable, Sound Transformations of Nested Recursion and Loops Kirshanthan Sundararajah, Milind Kulkarni Preprint PDF Code Slides Video Sound, Fine-grained Traversal Fusion for Heterogeneous Trees Laith Sakka, Kirshanthan Sundararajah, Ryan R Newton, Milind Kulkarni Preprint PDF Code Video Treelogy: A Benchmark Suite for Tree Traversals Nikhil Hegde, Jianqiao Liu, Kirshanthan Sundararajah, Milind Kulkarni PDF Code Slides TreeFuser: A Framework for Analyzing and Fusing General Recursive Tree Traversals Laith Sakka, Kirshanthan Sundararajah, Milind Kulkarni PDF Code Video Locality Transformations for Nested Recursive Iteration Spaces Kirshanthan Sundararajah, Laith Sakka, Milind Kulkarni PDF Code Poster Slides Model-based Input-adaptive Vectorization Kirshanthan Sundararajah, Sanath Jayasena PDF Layered Depth Image Based HEVC Multi-view Codec Kirshanthan Sundararajah, Lajanugen Logeswaran, Nisal Panagoda, Lakshitha Prabath Wijesinghe, Varuna De Silva, Ajith Pasqual PDF Video Publications Journals Orchard: Heterogeneous Parallelism and Fine-grained Fusion for Complex Tree Traversals Vidush Singhal, Laith Sakka, Kirshanthan Sundararajah, Ryan R Newton, Milind Kulkarni PDF Code Publications Preprints SABLE: Staging Blocked Evaluation of Sparse Matrix Computations Pratyush Das, Adhitha Dias, Anxhelo Xhebraj, Artem Pelenitsyn, Kirshanthan Sundararajah, Milind Kulkarni PDF Targeted Control-flow Transformations for Mitigating Path Explosion in Dynamic Symbolic Execution Charitha Saumya, Rohan Gangaraju, Kirshanthan Sundararajah, Milind Kulkarni PDF Teaching I teach compilers and programming languages courses for both graduate and undergraduate students. CS 5314 Programming Languages Fall 2024 CS 6304 Advanced Topics Language and Translation Spring 2024 CS 5304 Compiler Design Fall 2023 CS 4304 Compiler Design Fall 2023 Service Program Committee (PLDI) 2025 Program Committee (PPoPP) 2025 Program Committee (CGO) 2025 Program Committee (PLDI SRC) 2024 Program Committee (CC) 2024 Registration Chair (PPoPP) 2023 Project for Inclusion in ECE (PIECE) Committee 2022 External Review Committee (OOPSLA) 2022 Artifact Evaluation Committee (OOPSLA) 2022 Artifact Evaluation Committee (PLDI) 2020 Program Committee (ECOOP Doctoral Symposium) 2019 Collaborative Reviewer (POPL) 2019 Awards Best Paper Award at ICS (2022) Bilsland Dissertation Fellowship (2021) Silver Medal in ACM Student Research Competition at SPLASH (2018) Electrical and Computer Engineering Fellowship (2015) Cite × Copy Download",
  "content_length": 4907,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:07"
}