{
  "name": "Kirsten Ellis",
  "homepage": "https://research.monash.edu/en/persons/kirsten-ellis",
  "status": "success",
  "content": "Kirsten Ellis - Monash University Kirsten Ellis public CV View Scopus Profile Kirsten Ellis Assoc Professor Associate Professor, Department of Human Centred Computing https://orcid.org/0000-0002-7570-0939 EmailKirsten.Ellismonashedu 20032024 Research activity per year Personal profile Research interestsWebsite for Dr Kirsten Ellis - https://sites.google.com/site/drkirstenellis/homeBiographyDr Kirsten Ellis has a creative and technical background and has experience in designing, developing and evaluating systems for people with unique requirements. Her research interests include human computer interaction and how technology can create a more inclusive society. She had developed multiple resources using a variety of technologies including on the Nintendo DS lite, iPad, iPhone, Android and the Microsoft Kinect. She also plays with maker technologies including eTextiles to make creative pieces and artefacts to assist people. In addition, she also researches innovative technologies to create tangible objects as authentic learning experiences. Making for All Dr Kirsten Ellis is involved with creating a variety of activities to engage everyone, no matter what their abilities are, in STEM Making. By redesigning activities we can make it possible for everyone to engage in the making process. The items use off the shelf technology that are hacked, modified and used in different ways to facilitate activities that show the creative and fun side to technology that is then of interest to a more diverse range of users and developers. Australian Sign Language Dr Kirsten Ellis researches teaching sign language to hearing people so that they can interact with deaf people in a common language that is fully accessible to all participants and she has designed and developed multiple resources to enable this. Kirsten has conducted research in how the use a whole range of technologies to improve the learning experience and learning outcomes. Young Children and Technology Kirsten Ellis has researched two year old children using technology in terms of behavior, interaction style and concentration span. This work has tracked how new technologies are making computer accessible to even the youngest members of the community. Digital Health Kirsten is currently undertaking research on how to utilise the distributed nature of the internet to facilitate large scale medical projects. These project deal with the collection and distribution of information in a medical context that has not been previously possible.Monash teaching commitmentDr Kirsten Ellis has experience as the Chief Examiner for the following units in the Faculty of IT: FIT3149 Maker Lab Kirsten has experience as the Lecturer for the following units in the Faculty of IT: FIT1012/FIT9027 Website authoringFIT2032/FIT3045 Industry-based learningFIT2003 IT professional practice Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInformation Technology, Doctor of Philosophy, Monash UniversityAward Date: 16 Oct 2008Information Technology, Masters of IT (Research), Monash UniversityAward Date: 1 Jan 2002Information Management, Bachelor of Applied Science, Deakin UniversityAward Date: 1 Jan 1995 Research area keywordsChildren's playComputer Education/LiteracyComputer GraphicsComputer InterfaceComputers and information technology in educationDeaf CultureDeafnessDevelopment of CD ROMsDevelopmental DisabilitiesDevelopmental dyslexiaDevices for the blind and deafDisabilityEarly Childhood DevelopmentEarly Childhood EducationEarly childhoodEducation development and assessmentEducation researchEducational/Instructional TechnologyEthics in educationEthics in information technologyHuman Learning and MemoryHuman computer interaction, multimediaInformation technology in education Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2004 2013 2019 2020 2026 1 Active 17 Finished Projects per year Making eMaking Accessible for People with Intellectual DisabilitiesEllis, K. (Primary Chief Investigator (PCI)), Kidman, G. (Chief Investigator (CI)), Ananthanarayan, S. (Chief Investigator (CI)), Tan, H. (Chief Investigator (CI)) & Callaway, L. (Chief Investigator (CI))1/02/23 → 31/01/26Project: Research MakerVan: A mobile makerspace delivering STEM engagement to disability communities across VictoriaEllis, K. (Primary Chief Investigator (PCI)) & Ananthanarayan, S. (Chief Investigator (CI))1/11/22 → 26/05/23Project: Research Veski Inspiring Women Career Recovery GrantEllis, K. (Primary Chief Investigator (PCI))15/11/21 → 15/11/22Project: Research Engaged Exchanges: Teaching and integrating inquiry learning in online environmentsKidman, G. (Primary Chief Investigator (PCI)), Tan, H. (Chief Investigator (CI)), Kewalramani, S. (Chief Investigator (CI)), Ellis, K. (Chief Investigator (CI)), Rady, D. (Chief Investigator (CI)), Kinnaird, N. (Chief Investigator (CI)), Daujat, S. (Chief Investigator (CI)) & Bourke, S. (Chief Investigator (CI))27/10/20 → 10/12/20Project: Research COVID-19: Pedagogical Opportunities for students&#39; Online Inquiry-Based-LearningKidman, G. (Primary Chief Investigator (PCI)), Ellis, K. (Chief Investigator (CI)), Kewalramani, S. (Chief Investigator (CI)) & Tan, H. (Chief Investigator (CI))1/10/20 → 31/12/21Project: Research View all 18 projects Research output Research output per year 2003 2004 2006 2007 2018 2020 2021 2022 2023 2024 2024 32 Conference Paper 12 Article 3 Chapter (Book) 2 Review Article Research output per year Research output per year Creative Technologies in Action: Empowering Individuals with Intellectual DisabilitiesGuedes, L. S., Johnstone, J., Ellis, K. & Landoni, M., 2024, Computers Helping People with Special Needs - 19th International Conference, ICCHP 2024 Linz, Austria, July 8–12, 2024 Proceedings, Part II. Miesenberger, K., Peňáz, P. & Kobayashi, M. (eds.). Cham Switzerland: Springer, p. 193-200 8 p. (Lecture Notes in Computer Science; vol. 14751).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research 6 Citations (Scopus) Designing Accessible Adaptations for an Electronic Toolkit with Blind and Low Vision UsersJohnstone, J., Nadeeshani, M., Chen, H., Vemula, M., Tandori, E. J., Stephens, K., Senaratne, H., Ellis, K. & Ananthanarayan, S., 2024, ASSETS 2024 - Proceedings of the 26th International ACM SIGACCESS Conference on Computers and Accessibility. Guerreiro, T. & Brewer, R. (eds.). New York NY USA: Association for Computing Machinery (ACM), 15 p. 43Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 4 Citations (Scopus) Grand challenges in WaterHCIMueller, F. '., Montoya, M. F., Pell, S. J., Oppermann, L., Blythe, M., Dietz, P. H., Marshall, J., Bateman, S., Smith, I., Ananthanarayan, S., Mazalek, A., Verni, A., Bakogeorge, A., Simonnet, M., Ellis, K., Semertzidis, N. A., Burleson, W., Quarles, J., Mann, S. & Hill, C. & 2 others, Clashing, C. & Elvitigala, D. S., 2024, Proceedings of the 2024 CHI Conference on Human Factors in Computing Sytems. L. Wilson, M., Toups Dugas, P. & Shklovski, I. (eds.). New York NY USA: Association for Computing Machinery (ACM), 18 p. 225Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 10 Citations (Scopus) A Gallery In My Hand: A Multi-Exhibition Investigation of Accessible and Inclusive Gallery Experiences for Blind and Low Vision VisitorsButler, M., Tandori, E., Dziekan, V., Ellis, K., Hall, J., Holloway, L., Nagassa, R. & Marriott, K., 22 Oct 2023, Proceedings of the 25th International ACM SIGACCESS Conference on Computers and Accessibility. Brady, E. & Wolters, M. (eds.). New York NY USA: Association for Computing Machinery (ACM), 15 p. 9Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 8 Citations (Scopus) Assessing calf exercise fidelity among people with Achilles tendinopathy using videos recorded via Zoom®: an observational studyWhale, R., Hasani, F., Haines, T., Munteanu, S. E., Ellis, K., Patel, S., Buchholtz, K., Warne, J., Vallance, P. & Malliaras, P., 13 Feb 2023, In: Disability and Rehabilitation. 46, 4, p. 697-704 8 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 1 Citation (Scopus) View all 49 research outputs Prizes 2024 Good Design Award, Social Impact: Co-Designing STEAM experiences with and for people with intellectual disabilities: The Accessible MarkervanJohnstone, J. (Recipient), Ellis, K. (Recipient), Ananthanarayan, S. (Recipient) & Mcgee, T. (Recipient), Sept 2024Prize: Prize (including medals and awards) 2nd prize Make: Amazing Maker Awards - Education categoryEllis, K. (Recipient), 2022Prize: Prize (including medals and awards) Eureka Prize - Department of Industry, Science and Resources for STEM InclusionEllis, K. (Recipient), 2022Prize: Prize (including medals and awards) Women in Tech – Social Impact Advocacy AwardEllis, K. (Recipient), 2023Prize: Prize (including medals and awards) Press/Media How to build a more inclusive STEM program in early childhood using robotics and conductive blocksKewalramani, S., Ellis, K. & Kidman, G.4/06/201 Media contributionPress/Media: Article/Feature",
  "content_length": 9814,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:09"
}