{
  "name": "Kirstin H. Petersen",
  "homepage": "https://cei.ece.cornell.edu/members/kirstin-h-petersen",
  "status": "success",
  "content": "Kirstin Hagelskjær Petersen – Collective Embodied Intelligence Lab Collective Embodied Intelligence Lab Kirstin Hagelskjær Petersen [Curriculum Vitae] Aref and Manon Lahham Faculty FellowCornell Atkinson Center for Sustainability Faculty FellowSchool of Electrical and Computer Engineering (CS, MAE, and SE field membership) Prof. Petersen’s interests are on design and coordination of bio-inspired robot collectives and studies of their natural counterparts. She started her career with a B.Sc. in electro-technical engineering at Odense University College of Engineering in 2005, and a masters in modern artificial intelligence with Prof. John Hallam at the University of Southern Denmark in 2008. After a couple of detours, she completed a PhD thesis with Prof. Radhika Nagpal at Harvard University and the Wyss Institute for Biologically Inspired Engineering in 2014. Petersen continued on to a postdoc with Director Metin Sitti at the Max Planck Institute for Intelligent Systems 2014-2016, and became a fellow with the Max Planck ETH Center for Learning Systems in 2015. Petersen started the Collective Embodied Intelligence Lab in 2016 as part of the Electrical and Computer Engineering department at Cornell University, and has field memberships in Computer Science, Mechanical and Aerospace Engineering, and Systems Engineering. Awards and Honors Cornell Atkinson Center for Sustainability Faculty Fellow, October 2025. Elevated to IEEE senior member, July 2024. Douglas Whitney ‘61 Excellence in Teaching Award in the Cornell College of Engineering, September 2022. Cornell College of Engineering Research Excellence Award, December 2021. Aref and Manon Lahham Faculty Fellow, March 2021-2026. National Science Foundation CAREER Award, March 2021. Awarded a Packard Fellowship for Science and Engineering, October 2019. Visionary Technologist, Seven on Seven edition by Rhizome, presented at the New Museum, NYC, April 2019. Early Career Faculty Champion Award, Cornell Office of Inclusion and Student Engagement, April 2018. Fellow of the Elisabeth Schiemann Kolleg, Max Planck, 2016-present Fellowship with the Max Planck Institute for Intelligent Systems, 2014-2016 Research ranked 4th in Science Magazine’s Top 10 Scientific Achievements of 2014 Other Academic Roles Cornell Institute for Digital Agriculture executive committee member, 2021-2024 Faculty advisor for CUair, 2021-2024. International Academic Advisory Board for the Journal of Advanced Intelligent Systems Editorial Board for the Journal of Swarm Intelligence, Springer, 2020-current Associate Editor for IEEE Robotics Automation Letters (RA-L) 2018-current Area Chair for the International Symposium on Multi-Robot and Multi-Agent Systems (MRS) 2019. Area Chair for the ACM Symposium on Computational Fabrication (SCF) 2019 Area Chair of Robotics: Science and Systems (RSS) 2018 Reviewer/PC member for Science Robotics, AAAS, Science Advances, AAAS, Nature Scientific Reports, IEEE Transactions of Robotics, Robotics: Science and Systems (RSS), IEEE International Conference of Robotics and Automation (ICRA), IEEE/RSJ International Conference on Robots and Systems (IROS), International Conference on Advanced Robotics (ICAR), International Symposium on distributed Autonomous Robotic Systems (DARS), IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO, SOCO workshop), IEEE International Conference Series on Cognitive Informatics and Cognitive Computing (ICCI-CC). Favorite (and perhaps most representative) Quote About Petersen’s Research Michael Connor, Rhizome’s Artistic Director: “I think one of the challenges, honestly, is that Kirstin’s work is already so weird and fascinating. It’s not clear what the role for art is, if the science is already generating such odd forms.” Copyright © 2025 · All Rights Reserved · Collective Embodied Intelligence Lab Swell Lite from Organic Themes · RSS Feed",
  "content_length": 3913,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:12"
}