{
  "name": "Kirthevasan Kandasamy",
  "homepage": "https://pages.cs.wisc.edu/~kandasamy",
  "status": "success",
  "content": "Kirthevasan Kandasamy kirthevasan (kirthi) kandasamy Assistant Professor Department of Computer Sciences University of Wisconsin-Madison [Google Scholar] [GitHub] I am an assistant professor in the Department of Computer Sciences, at the School of Computing, Data, and Information Sciences at UW-Madison. I am also affiliated with the Department of Statistics. I work on theoretical topics in machine learning and game theory. For more details, see my publications. Prior to UW-Madison, I was at UC Berkeley, Carnegie Mellon University, and the University of Moratuwa, Sri Lanka. See here for a formal bio. Selected publications: One of my current research agendas, supported in part by an NSF CAREER award, explores the incentives that arise when agents share data with one another. We are developing data-sharing mechanisms and marketplaces that promote truthful data contribution, ensure fair benefits for the participants, and generate value for society as a whole. Below are some relevant papers: A Cramér-von Mises Approach to Incentivizing Truthful Data Sharing [arxiv], NeurIPS 2025 Collaborative Mean Estimation Among Heterogeneous Strategic Agents: Individual Rationality, Fairness, and Truthful Contribution [arxiv], ICML 2025 Mechanism Design for Collaborative Normal Mean Estimation [arxiv], NeurIPS 2023 Contributor-Side Incentives in a Data Marketplace for Mean Estimation [arxiv] Learning to Price Homogeneous Data [arxiv], NeurIPS 2024 Current teaching (Fall '25): CS/ECE/STAT-861 - Theoretical Foundations of Machine Learning PhD students Keran Chen (Statistics) Alex Clinton (CS) Michael Harding (Statistics) Joon Suk Huh (CS) Peter Yang (CS) Openings: I am recruiting students with strong backgrounds in mathematics and statistics. If you are a PhD student at UW-Madison who is interested in working with me, please drop me an email (and follow up if I do not respond). Undergraduate students may also email me, but I prioritize students who have taken one of my classes. Unfortunately, I am not always able to individually respond to such inquiries from prospective students who are not at UW-Madison. However, you may apply to the MS/PhD program at the Department of Computer Sciences and drop me an email. Contact Morgridge Hall 5506 University of Wisconsin-Madison Madison, WI 53706. email: kandasamy [at] cs (dot) wisc {dot} edu",
  "content_length": 2354,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:10"
}