{
  "name": "Kishor S. Trivedi",
  "homepage": "https://ece.duke.edu/faculty/kishor-trivedi",
  "status": "success",
  "content": "Kishor Trivedi | Duke Electrical & Computer Engineering Kishor Trivedi, Ph.D. Electrical and Computer Engineering Hudson Distinguished Professor of Electrical and Computer Engineering Kishor Trivedi, Ph.D. Profile Photo Research Themes Trustworthy Computing Research Interests Markov models, Fault trees, Stochastic Petri nets, Reliability Modeling, Availability Modeling, Performability modeling, Survivability modeling, Cyber Security, Software reliability, Software Fault Tolerance, Software Aging and Rejuvenation Bio Kishor Trivedi holds the Hudson Chair in the Department of Electrical and Computer Engineering at Duke University. He is known as a leading international expert in the domain of reliability and performability evaluation of Dependable systems, and has made seminal contributions to stochastic modeling formalisms and their efficient solution. He is currently carrying out experimental research in software reliability during operation where he is researching software fault tolerance through environmental diversity. This work, including software bug classification, empirical study of real failure data and associated theory of affordable software fault tolerance, has already gained significant attention. He has made key contributions to his field in many ways. He has encapsulated developed algorithms into usable and well circulated software packages, and applied research results to practical problems working directly with industry. This work has not only been able to solve difficult real-life problems but also produce new research based on the problems. He has published over 600 articles, has supervised 48 Ph.D. dissertations and more than 50 postdoctoral associates. He is a Life Fellow of the Institute of Electrical and Electronics Engineers and a Golden Core Member of IEEE Computer Society. He has served on many editorial boards and conference committees and is the recipient of IEEE Computer Society Technical Achievement Award for his research on Software Aging and Rejuvenation. He is the recipient of IEEE Reliability Society's Life Time Achievement Award. He is on ISI’s highly cited list with an h-index of 108, and has received grants from such governmental agencies as NASA, NATO, NSF, DARPA, AFOSR, ARO, NIH, NSWC, ONR, and RADC. Trivedi has also helped several high-profile companies carry out reliability/availability prediction of their products under design or in existence, including 3Com, Avaya, Boeing, Cisco, DEC, EMC, GE, HP, Huawei, IBM, Lucent, NEC, TCS, Union Switch and Signals, Wipro. Most notable among these, is his help in reliability modeling of the current return network subsystem of the Boeing 787 for FAA certification. The algorithm he developed for this problem has been jointly patented by Boeing and Trivedi. He led the reliability/availability modeling of SIP on IBM WebSphere; this model was responsible for the sale of the system by IBM to AT & T. Furthermore, Trivedi has written several influential books, including textbooks. He is the author of a well-known text entitled, Probability and Statistics with Reliability, Queuing and Computer Science Applications, originally published by Prentice-Hall; a thoroughly revised second edition (including its Indian edition) has been published by John Wiley. This book is translated into Chinese in Nov. 2015. This book has  appeared as a paperback in July 2016.He has also published two other books titled, Performance and Reliability Analysis of Computer Systems, published by Springer and Queueing Networks and Markov Chains by John Wiley. His latest book, Reliability and Availability Engineering: Modeling, Analysis and Applications, is published by Cambridge University Press in 2017. Education B.Tech. Indian Institute of Technology, Bombay (India), 1968 M.S. University of Illinois, 1972 Ph.D. University of Illinois, 1974 Trainings & Certifications Specially Appointed Professor, Hiroshima University (Japan) 2018 - 2020 (2018 - 2020) Hiroshima University (Japan) Positions Hudson Distinguished Professor of Electrical and Computer Engineering Professor of Electrical and Computer Engineering Professor of Electrical and Computer Engineering at Duke Kunshan University Professor of Computer Science Awards, Honors, and Distinctions AAAS Fellow. American Association for the Advancement of Science. 2023 Lifetime Achievement Award. IEEE Reliability Society. 2021 Life Fellow. IEEE. 2017 ONR Faculty Fellow Summer 2015. ONR. 2015 NordsecMob Scholar. Norwegian University of Science and Technology. 2014 Fellow. Japan Society for the Promotion of Science. 2014 Doctor Honoris Causa. USMP, Lima, Peru. 2012 Technical Achievement Award. IEEE Computer Society. 2008 Traditional Fulbright Scholarship. Council for International Exchange of Scholars. 2002 Highly Cited Researcher. Thomson Reuters. 2001 Fellow. Institute for Electrical and Electronics Engineers. 1992 Courses Taught K_ECE 590K: ADVANCED TOPICS IN ECE K_CMPSCI 320: Software Reliability ECE 899: Special Readings in Electrical Engineering ECE 891: Internship ECE 590K: Advanced Topics in Electrical and Computer Engineering ECE 590: Advanced Topics in Electrical and Computer Engineering ECE 555: Probability for Electrical and Computer Engineers COMPSCI 555: Probability for Electrical and Computer Engineers COMPSCI 393: Research Independent Study Publications Bai J, Chang X, Machida F, Trivedi KS. Understanding Container-Based Services Under Software Aging: Dependability and Performance Views. IEEE Transactions on Sustainable Computing. 2025 Jan 1;10(3):562u201375. Qin F, Zheng Z, Sui Y, Gong S, Shi Z, Trivedi KS. Cross-project concurrency bug prediction using domain-adversarial neural network. Journal of Systems and Software. 2024 Aug 1;214. Trivedi K, Bobbio A. Reliability and Availability Analysis in Practice: Toward Multilevel Models for Complex Systems. Computer. 2024 Apr 1;57(4):82u201392. Trivedi KS, Grottke M, Lopez JA. Rethinking Software Fault Tolerance. IEEE Transactions on Reliability. 2024 Mar 1;73(1):67u201372. Trivedi K. Reliability and Availability Assessment. In: IEEE Transactions on Reliability. 2024. p. 17u20138. Trivedi KS, Xing L. Probability models applied to reliability and availability engineering. In 2024. p. 195u2013214. Bai J, Li Y, Chang X, Machida F, Trivedi KS. Understanding NFV-Enabled Vehicle Platooning Application: A Dependability View. IEEE Transactions on Cloud Computing. 2023 Oct 1;11(4):3367u201380. Bai J, Chang X, MacHida F, Trivedi KS, Li Y. Model-Driven Dependability Assessment of Microservice Chains in MEC-Enabled IoT. IEEE Transactions on Services Computing. 2023 Jul 1;16(4):2769u201385. Bai J, Chang X, Machida F, Jiang L, Han Z, Trivedi KS. Impact of Service Function Aging on the Dependability for MEC Service Function Chain. IEEE Transactions on Dependable and Secure Computing. 2023 Jul 1;20(4):2811u201324. Grottke M, Avritzer A, Washizaki H, Trivedi K. Guest Editorial Special Section on Applied Software Aging and Rejuvenation. IEEE Transactions on Emerging Topics in Computing. 2023 Jul 1;11(3):550u20132. Zheng Z, Strigini L, Antunes N, Trivedi K. Editorial: Software Reliability and Dependability Engineering. IEEE Transactions on Dependable and Secure Computing. 2023 Jul 1;20(4):2674u20136. Bai J, Chang X, Rodriguez RJ, Trivedi KS, Li S. Towards UAV-Based MEC Service Chain Resilience Evaluation: A Quantitative Modeling Approach. IEEE Transactions on Vehicular Technology. 2023 Apr 1;72(4):5181u201394. Okamura H, Zheng J, Dohi T, Trivedi KS. Effect of Epistemic Uncertainty in Markovian Reliability Models. In: Springer Series in Reliability Engineering. 2023. p. 371u201392. Du X, Zheng Z, Xiao G, Zhou Z, Trivedi KS. DeepSIM: Deep Semantic Information-Based Automatic Mandelbug Classification. IEEE Transactions on Reliability. 2022 Dec 1;71(4):1540u201354. Bai J, Chang X, Machida F, Han Z, Xu Y, Trivedi KS. Quantitative understanding serial-parallel hybrid sfc services: a dependability perspective. Peer to Peer Networking and Applications. 2022 Jul 1;15(4):1923u201338. Grottke M, Trivedi KS. Aging, Fast and Slow. Computer. 2022 May 1;55(5):73u20135. Chang X, Shi Y, Zhang Z, Xu Z, Trivedi KS. Job Completion Time Under Migration-Based Dynamic Platform Technique. IEEE Transactions on Services Computing. 2022 Jan 1;15(3):1345u201357. Bai J, Chang X, Ning G, Zhang Z, Trivedi KS. Service Availability Analysis in a Virtualized System: A Markov Regenerative Model Approach. IEEE Transactions on Cloud Computing. 2022 Jan 1;10(3):2118u201330. Ma X, Trivedi KS. SINR-Based Analysis of IEEE 802.11p/bd Broadcast VANETs for Safety Services. IEEE Transactions on Network and Service Management. 2021 Sep 1;18(3):2672u201386. Qiu K, Zheng Z, Trivedi KS, Mura I. Availability Analysis of Systems Deploying Sequences of Environmental-Diversity-Based Recovery Methods. IEEE Transactions on Reliability. 2021 Sep 1;70(3):1126u201342. Zheng J, Okamura H, Dohi T, Trivedi KS. Quantitative Security Evaluation of Intrusion Tolerant Systems with Markovian Arrivals. IEEE Transactions on Reliability. 2021 Jun 1;70(2):547u201362. Cai KY, Trivedi KS, Yin B. S-ADA: Software as an Autonomous, Dependable and Affordable System. In: Proceedings 51st Annual IEEE IFIP International Conference on Dependable Systems and Networks Supplemental Volume Dsn S 2021. 2021. p. 17u20138. Bai J, Chang X, Trivedi KS, Han Z. Resilience-Driven Quantitative Analysis of Vehicle Platooning Service. IEEE Transactions on Vehicular Technology. 2021 Jun 1;70(6):5378u201389. Vizarreta P, Sieber C, Blenk A, Van Bemten A, Ramachandra V, Kellerer W, et al. ARES: A Framework for Management of Aging and Rejuvenation in Softwarized Networks. IEEE Transactions on Network and Service Management. 2021 Jun 1;18(2):1389u2013400. Dos Santos CAR, Matias R, Trivedi KS. A Multisite Characterization Study on Failure Causes in System and Applications Software. In: Brazilian Symposium on Computing System Engineering Sbesc. 2021. Liu B, Bobbio A, Bai J, Martinez J",
  "content_length": 128308,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:13"
}