{
  "name": "Kitty Meeks",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/kittymeeks",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Kitty Meeks Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Kitty MeeksMr Ethan KellyZhen Tian Professor Kitty Meeks Professor of Theoretical Computing Science (School of Computing Science) telephone: 0141 330 8469 email: Kitty.Meeks@glasgow.ac.uk Room 406, 1 Lilybank Gardens, School of Computing Science, Sir Alwyn Williams Building, University of Glasgow Import to contacts https://orcid.org/0000-0001-5299-3073 Biography I joined the University of Glasgow in 2014, as a Lecturer in the School of Mathematics and Statistics; I moved to the School of Computing Science in 2016, where I held a Royal Society of Edinburgh Personal Research Fellowship from 2016 to 2021.  My work is currently funded by an EPSRC Fellowship (2021-2030). I gained my MMath in Mathematics and Computer Science (2009) and DPhil in Mathematics (2013) from the University of Oxford, and from 2012 to 2014 I worked as a Postdoctoral Research Assistant at Queen Mary University of London. Research interests My research involves developing new techniques for the design of provably correct and efficient algorithms, and applying these techniques in as many domains as possible - from Social Network Analysis to Precision Medicine. I am particularly interested in parameterised algorithms, counting complexity, and temporal networks. From 2016 to 2021, I held a Personal Research Fellowship from the Royal Society of Edinburgh, to work on the project Exploiting Realistic Graph Structure. The goal of this work was to help bridge the gap between theory and practice in the design of network algorithms by developing our understanding of how structural properties of real datasets can help us to extract information from them more efficiently. Since October 2021, I my research has been funded by an EPSRC Fellowship, Beyond One Solution in Combinatorial Optimisation.  In this project I aim to develop new techniques for the design of algorithms that do more than just find a single \"best\" solution: we aim to find all good solutions or, failing that, to estimate the number of good solutions and sample randomly from this collection.  This will involve combining techniques for the design of parameterised algorithms and approximate counting algorithms.  While these abstract techniques will be very widely applicable, we have identified several target applications in the field of Precision Medicine which will be explored during the project. I also work extensively on algorithms for temporal graphs, which model networks whose connections change over time (e.g. transport networks, social networks), with a focus on understanding the structural properties of these networks that can be leveraged to design practical algorithms.Research groupsFormal Analysis, Theory & Algorithms Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012Number of items: 50.2025 Agdur, Vilhelm, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Larios-Jones, Laura ORCID: https://orcid.org/0000-0003-3322-0176, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Skerman, Fiona and Yates, Ella (2025) Approximating temporal modularity on graphs of small underlying treewidth. In: International Symposium on Algorithmics of Wireless Networks (ALGOWIN 2025), Warsaw, Poland, 18-19 September 2025, (Accepted for Publication) Corsini, Timothée, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Larios-Jones, Laura ORCID: https://orcid.org/0000-0003-3322-0176 and Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2025) Temporal Orienteering with Changing Fuel Costs. In: International Symposium on Algorithmics of Wireless Networks (ALGOWIN 2025), Warsaw, Poland, 18-19 September 2025, (Accepted for Publication) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 and Sylvester, John ORCID: https://orcid.org/0000-0002-6543-2934 (2025) Tangled paths: a random graph model from mallows permutations. Electronic Journal of Combinatorics, 32(2), P2.35. (doi: 10.37236/11602) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Molter, Henrik (2025) Counting temporal paths. Algorithmica, 87(5), pp. 736-782. (doi: 10.1007/s00453-025-01301-3) (PMID:40352583) (PMCID:PMC12062201) Davot, Tom, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Madathil, Jayakrishnan and Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2025) Temporal Triadic Closure: Finding Dense Substructures in Social Networks That Evolve Over Time. In: 39th AAAI Conference on Artificial Intelligence (AAAI-25), Philadelphia, PA, USA, 25 Feb - 04 Mar 2025, pp. 26939-26946. ISBN 9781577358978 (doi: 10.1609/aaai.v39i25.34899) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Larios-Jones, Laura, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 (2025) Reachability in Temporal Graphs under Perturbation. In: 50th International Conference on Current Trends in Theory and Practice of Computer Science (SOFSEM 2025), Bratislava, Slovakia, 20-23 Jan 2025, pp. 255-269. ISBN 978-3-031-82669-6 (doi: 10.1007/978-3-031-82670-2_19) 2024 Bressan, Marco, Goldberg, Leslie Ann, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Roth, Marc (2024) Counting subgraphs in somewhere dense graphs. SIAM Journal on Computing, 53(5), pp. 1409-1438. (doi: 10.1137/22M1535668) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Lee, Duncan ORCID: https://orcid.org/0000-0002-6175-6800, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Sylvester, John ORCID: https://orcid.org/0000-0002-6543-2934 and Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 (2024) The complexity of finding and enumerating optimal subgraphs to represent spatial correlation. Algorithmica, 86(10), pp. 3186-3230. (doi: 10.1007/s00453-024-01256-x) Bocci, Christiano, Capresi, Chiara, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Sylvester, John ORCID: https://orcid.org/0000-0002-6543-2934 (2024) A new temporal interpretation of cluster editing. Journal of Computer and System Sciences, 144, 103551. (doi: 10.1016/j.jcss.2024.103551) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Hand, Samuel D., Larios-Jones, Laura ORCID: https://orcid.org/0000-0003-3322-0176 and Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2024) Structural Parameters for Dense Temporal Graphs. In: 49th International Symposium on Mathematical Foundations of Computer Science, Bratislava, Slovakia, 26-30 Aug 2024, 52:1-52:15. ISBN 9783959773355 (doi: 10.4230/LIPIcs.MFCS.2024.52) Dell, Holger, Lapinskas, John and Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2024) Nearly Optimal Independence Oracle Algorithms for Edge Estimation in Hypergraphs. In: 51st EATCS International Colloquium on Automata, Languages, and Programming (ICALP 2024), Tallinn, Estonia, 8-13 July 2024, 54:1-54:17. (doi: 10.4230/LIPIcs.ICALP.2024.54) 2023 Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 and Sylvester, John (2023) Cops and robbers on multi-layer graphs. In: Graph-Theoretic Concepts in Computer Science:49th International Workshop, WG 2023, Fribourg, Switzerland, June 28–30, 2023, Revised Selected Papers. Series: Lecture notes in computer science (14093). Springer: Cham. ISBN 9783031433795 (Accepted for Publication) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Molter, Hendrik (2023) Counting Temporal Paths. In: 40th International Symposium on Theoretical Aspects of Computer Science (STACS 2023), Hamburg, Germany, 07-10 Mar 2023, p. 30. (doi: 10.4230/LIPIcs.STACS.2023.30) Bumpus, Benjamin Merlin and Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2023) Edge exploration of temporal graphs. Algorithmica, 85(3), pp. 688-716. (doi: 10.1007/s00453-022-01018-7) Bressan, Marco, Goldberg, Leslie Ann, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Roth, Marc (2023) Counting Subgraphs in Somewhere Dense Graphs. In: 14th Innovations in Theoretical Computer Science Conference (ITCS 2023), Cambridge, Massachusetts, USA, 10-13 January 2023, ISBN 9783959772631 2022 Groenland, Carla, Johnston, Tom, Kupavskii, Andrey, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Scott, Alex and Tan, Jane (2022) Reconstructing the degree sequence of a sparse graph from a partial deck. Journal of Combinatorial Theory, Series B, 157, pp. 283-293. (doi: 10.1016/j.jctb.2022.07.004) Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2022) Reducing reachability in temporal graphs: towards a more realistic model of real-world spreading processes. In: Computability in Europe: Revolutions and Revelations in Computability (CiE 2022), Swansea, UK, 11-15 Jul 2022, pp. 186-195. ISBN 978303",
  "content_length": 37326,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:14"
}