{
  "name": "Kiwan Maeng",
  "homepage": "https://kiwanmaeng.com",
  "status": "success",
  "content": "Kiwan Maeng KIWAN MAENG Assistant Professor · Computer Science and Engineering · Pennsylvania State University (2022.8 --) Postdoc Researcher · SysML Team · Meta AI Research (2021.8 -- 2022.8) I am a tenure-track assistant professor in the Computer Science and Engineering Department at Pennsylvania State University. Prior to joining PSU, I did a one-year postdoc at Meta AI Research's SysML Team. I did my Ph.D. at Carnegie Mellon University, under the advisement of Professor Brandon Lucia. My research interest lies in systems for privacy-preserving machine learning in the broadest sense. I am interested in studying the privacy implications of modern ML systems and developing algorithm/system/hardware solutions for privacy-preserving ML training and inference. In the past, I've also worked on systems for ML, ML and sustainability, and batteryless energy-harvesting devices. If you are interested in working with me, please send me an email with: (1) your interested research area (with respect to my research interest), (2) at least one of my publication you read and want to build upon, and (3) your relevant background experiences (e.g., courses, projects, publication experiences). If these are not provided explicitly, I will not respond to your email. I am also an amateur webtoonist. Check out my work if you know Korean. Otherwise, do not bother. My pronouns are: he/his/him. Email: kwmaeng91 [at] gmail [dot] com Recent News Dec 2025: Our work \"In-depth Characterization of Machine Learning on an Optimized Multi-party Computing Library\" was accepted to CAL 2025! Dec 2025: Our work \"Characterizing the System Overhead of Discrete Noise Generation for Differential Privacy\" was accepted to CAL 2025! Mar 2025: Our work \"Hermes: Algorithm-System Co-design for Efficient Retrieval Augmented Generation At-Scale\" was accepted to ISCA 2025! Jan 2025: Our work \"Practical Federated Recommendation Model Learning Using ORAM with Controlled Privacy\" was accepted to ASPLOS 2025! Jan 2025: Our work \"Pirate: No Compromise Low-Bandwidth VR Streaming for Edge Devices\" was accepted to ASPLOS 2025! Show more... May 2024: Our work \"Information Flow Control in Machine Learning through Modular Model Architecture\" was accepted to Usenix Security 2024! Feb 2024: Our work \"Accelerating ReLU for MPC-Based Private Inference with a Communication-Efficient Sign Estimation\" was accepted to MLSys 2024! Dec 2023: Our work \"Compiler-based Memory Encryption for Machine Learning on Commodity Low-power Devices\" was accepted to CC 2024! Nov 2023: Our work \"LazyDP: Co-Designing Algorithm-Software for Scalable Training of Differentially Private Recommendation Models\" was accepted to ASPLOS 2024! Sep 2023: Our work \"Bounding the Invertibility of Privacy-preserving Instance Encoding using Fisher Information\" was accepted to NeurIPS 2023! Jul 2023: Our work \"GPU-based Private Information Retrieval for On-Device Machine Learning Inference\" was accepted to ASPLOS 2024! Apr 2023: Our work \"Cocktail Party Attack: Breaking Aggregation-Based Privacy in Federated Learning using Independent Component Analysis\" was accepted to ICML 2023! Publications (Systems for) Privacy-preserving Machine Learning CrypTorch: PyTorch-based Auto-tuning Compiler for Machine Learning with Multi-party Computation Arxiv [PDF] Jinyu Liu, Gang Tan, and Kiwan Maeng In-depth Characterization of Machine Learning on an Optimized Multi-party Computing Library CAL 2025 [PDF] Jinyu Liu and Kiwan Maeng Characterizing the System Overhead of Discrete Noise Generation for Differential Privacy CAL 2025 [PDF] Seokhyeon Kong, Donghwan Kim, Euiseong Seo, and Kiwan Maeng Correlating Cross-Iteration Noise for DP-SGD using Model Curvature Arxiv [PDF] Xin Gu, Yingtai Xiao, Guanline He, Jiamu Bai, Daniel Kifer, and Kiwan Maeng Cocoon: A System Architecture for Differentially Private Training with Correlated Noises Arxiv [PDF] Donghwan Kim, Xin Gu, Jinho Baek, Timothy Lo, Younghoon Min, Kwangsik Shin, Jongryool Kim, Jongse Park, and Kiwan Maeng Practical Federated Recommendation Model Learning Using ORAM with Controlled Privacy ASPLOS 2025 [PDF] Jinyu Liu, Wenjie Xiong, G. Edward Suh, and Kiwan Maeng Information Flow Control in Machine Learning through Modular Model Architecture Usenix Security 2024 [PDF] Trishita Tiwari, Suchin Gururangan, Chuan Guo, Weizhe Hua, Sanjay Kariyappa, Udit Gupta, Wenjie Xiong, Kiwan Maeng, Hsien-Hsin S. Lee, and G. Edward Suh Accelerating ReLU for MPC-Based Private Inference with a Communication-Efficient Sign Estimation MLSys 2024 [PDF] Kiwan Maeng and G. Edward Suh Compiler-based Memory Encryption for Machine Learning on Commodity Low-power Devices CC 2024 [PDF] Kiwan Maeng and Brandon Lucia LazyDP: Co-Designing Algorithm-Software for Scalable Training of Differentially Private Recommendation Models ASPLOS 2024 [PDF] Juntaek Lim, Youngeun Kwon, Ranggi Hwang, Kiwan Maeng, G. Edward Suh, and Minsoo Rhu Bounding the Invertibility of Privacy-preserving Instance Encoding using Fisher Information NeurIPS 2023 [PDF] Kiwan Maeng*, Chuan Guo*, Sanjay Kariyappa, and G. Edward Suh GPU-based Private Information Retrieval for On-Device Machine Learning Inference ASPLOS 2024 [PDF] Maximilian Lam, Jeff Johnson, Wenjie Xiong, Kiwan Maeng, Udit Gupta, Minsoo Rhu, Hsien-Hsin S. Lee, Vijay Janapa Reddi, Gu-Yeon Wei, David Brooks, and G. Edward Suh Cocktail Party Attack: Breaking Aggregation-Based Privacy in Federated Learning using Independent Component Analysis ICML 2023 [PDF] Sanjay Kariyappa, Chuan Guo, Kiwan Maeng, Wenjie Xiong, G. Edward Suh, Moinuddin K Qureshi, and Hsien-Hsin S. Lee Measuring and Controlling Split Layer Privacy Leakage Using Fisher Information FL-NeurIPS 2022 Workshop [PDF] Kiwan Maeng, Chuan Guo, Sanjay Kariyappa, and G. Edward Suh Towards Fair Federated Recommendation Learning: Characterizing the Inter-Dependence of System and Data Heterogeneity RecSys 2022 (Best Paper Finalist) [PDF] Kiwan Maeng, Haiyu Lu, Luca Melis, John Nguyen, Mike Rabbat, and Carole-Jean Wu Sustainable AI: Environmental Implications, Challenges and Opportunities MLSys 2022 [PDF] Carole-Jean Wu, Ramya Raghavendra, Udit Gupta, Bilge Acun, Newsha Ardalani, Kiwan Maeng, Gloria Chang, Fiona Aga Behram, James Huang, Charles Bai, Michael Gschwind, Anurag Gupta, Myle Ott, Anastasia Melnikov, Salvatore Candido, David Brooks, Geeta Chauhan, Benjamin Lee, Hsien-Hsin S. Lee, Bugra Akyildiz, Maximilian Balandat, Joe Spisak, Ravi Jain, Mike Rabbat, and Kim Hazelwood Green Federated Learning FL-ICML 2023 Workshop [PDF] Ashkan Yousefpour, Shen Guo, Ashish Shenoy, Sayan Ghosh, Pierre Stock, Kiwan Maeng, Schalk-Willem Krüger, Michael Rabbat, Carole-Jean Wu, and Ilya Mironov FEL: High Capacity Learning for Recommendation and Ranking via Federated Ensemble Learning IEEE Data Eng. Bull 2023 [PDF] Meisam Hejazinia, Dzmitry Huba, Ilias Leontiadis, Kiwan Maeng, Mani Malek, Luca Melis, Ilya Mironov, Milad Nasr, Kaikai Wang, and Carole-Jean Wu Systems for ML Hermes: Algorithm-System Co-design for Efficient Retrieval Augmented Generation At-Scale ISCA 2025 [PDF] Michael Shen, Muhammad Umar, Kiwan Maeng, G. Edward Suh, and Udit Gupta Towards Understanding Systems Trade-offs in Retrieval-Augmented Generation Model Inference Arxiv [PDF] Michael Shen, Muhammad Umar, Kiwan Maeng, G. Edward Suh, and Udit Gupta Pirate: No Compromise Low-Bandwidth VR Streaming for Edge Devices ASPLOS 2025 [PDF] Yingtian Zhang, Yan Kang, Ziyu Ying, Wanhang Lu, Sijie Lan, Huijuan Xu, Kiwan Maeng, Anand Sivasubramaniam, Mahmut Kandemir, and Chita Das Optimizing CPU Performance for Recommendation Systems At-Scale ISCA 2023 [PDF] Rishabh Jain, Scott Cheng, Vishwas Kalagi, Vrushabh Sanghavi, Samvit Kaul, Meena Arunachalam, Kiwan Maeng, Adwait Jog, Anand Sivasubramaniam, Mahmut Taylan Kandemir, and Chita Das Carbon Explorer: A Holistic Approach for Designing Carbon Aware Datacenters ASPLOS 2023 [PDF] Bilge Acun, Benjamin Lee, Fiodar Kazhamiaka, Kiwan Maeng, Manoj Chakkaravarthy, Udit Gupta, David Brooks, and Carole-Jean Wu Carbon Dependencies in Datacenter Design and Management HotCarbon 2022 [PDF] Bilge Acun, Benjamin Lee, Fiodar Kazhamiaka, Aditya Sundarrajan, Manoj Chakkaravarthy, Kiwan Maeng, David Brooks, and Carole-Jean Wu CPR: Understanding and Improving Failure Tolerant Training for Deep Learning Recommendation with Partial Recovery MLSys 2021 [PDF] Kiwan Maeng, Shivam Bharuka, Isabel Gao, Mark C. Jeffrey, Vikram Saraph, Bor-Yiing Su, Caroline Trippel, Jiyan Yang, Mike Rabbat, Brandon Lucia, and Carole-Jean Wu Batteryless Energy-harvesting Devices An Architectural Charge Management Interface for Energy-Harvesting Systems MICRO 2022 [PDF] Emily Ruppel, Milijana Surbatovich, Harsh Desai, Kiwan Maeng, and Brandon Lucia Adaptive Low-overhead Scheduling for Periodic and Reactive Intermittent Execution PLDI 2020 [PDF] Kiwan Maeng and Brandon Lucia Enhancing Stratospheric Weather Analysis and Forecasts by Deploying Sensors from a Weather Balloon NeurIPS 2019 Workshop (Spotlight Talk) [PDF] Kiwan Maeng, Iskender Kushan, Brandon Lucia, and Ashish Kapoor Supporting Peripherals in Intermittent Systems with Just-In-Time Checkpoints PLDI 2019 [PDF] Kiwan Maeng and Brandon Lucia Adaptive Dynamic Checkpointing for Safe Efficient Intermittent Computing OSDI 2018 [PDF] Kiwan Maeng and Brandon Lucia Alpaca: Intermittent Execution Without Checkpoints OOPSLA 2017 [PDF] [Ext. ver.] Kiwan Maeng, Alexei Colin, and Brandon Lucia Intermittent Computing: Challenges and Opportunities SNAPL 2017 [PDF] Brandon Lucia, Vignesh Balaji, Alexei Colin, Kiwan Maeng, and Emily Ruppel Services Organizing: MICRO 2025 Student Travel Grant Co-Chair, ASPLOS 2025 Artifact Evaluation Committee Co-Chair Session Chair: ASPLOS 2024 (3D: ML Quantization and Memory Optimizations) Conference (External) Program Committee: ASPLOS (2023-2026), MLSys (2022-2025), HPCA (2024-2025), ISCA (2024), MICRO (2023, 2025), EuroSys (2022), IISWC (2022) Conference Reviewer: NeurIPS (2025; Best reviewer) Journal Revie",
  "content_length": 12186,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:13"
}