{
  "name": "Kiyoshi Kiyokawa",
  "homepage": "https://carelab.info/en",
  "status": "success",
  "content": "Cybernetics and Reality Engineering (CARE) Laboratory Upcoming News Upcoming news to be announced soon: We exhibited two projects (Anywhere Door / AR Ramen) at the EXPO 2025 Osaka-Kansai Expo We welcomed new students (6 doctoral students and 12 master’s students) We received the Gold Research Encouragement Award at the Entertainment Computing Workshop We received the DAAX Good Experience Design Student Award 2025 Our paper has been accepted to CVPR 2025. We presented an interactive Read more 12 people participated in Spring Seminar From February 26 to 28, 2025, the NAIST Spring Seminar was held, and our laboratory welcomed 12 seminar participants from various universities and technical colleges across Japan, from Tokyo to Okinawa. Four participants joined the theme \"Recognizing User States by Reading Biometric Signals\", where they worked on developing a system that recognizes hand gestures in rock-paper-scissors using electromyography (EMG) sensors. Through this, they learned about biometric Read more We will hold SIG PhysioCHI at CHI 2025 We will host a SIG PhysioCHI at ACM CHI 2025, which is held from April 26 to May 1, 2025, in Yokohama. Assistant Professor Perusquia will help the SIG as one of the organizers. Human-Centered Physiological Computing in Practice In recent years, integrating physiological signals in Human-Computer Interaction research has significantly advanced our understanding of user experiences and interactions. However, the interdisciplinary nature of this research Read more We hosted 6 interns Our lab accepts interns throughout the year. From February 17 to 21, 2025, we welcomed six interns. Five of them completed their internship on February 21, and a final presentation session was held to showcase their achievements. The interns developed high-quality systems that were impressive for just five days of work, making it a rewarding internship experience. We hope they will apply their learnings to future Read more Birthday party was held On January 31, 2025, we held a birthday party to celebrate members whose birthdays fall between October and December. Read more Spring Seminar to be held from Feb 25 to 27, 2025 The Spring Seminar will be held from Tuesday, February 25, 2025, to Thursday, February 27, 2025. If you're interested, please apply using the link below. http://isw3.naist.jp/IS/PubWG/Spring2025/index-en.html Physical and psychological state recognition using biological signals You will develop an application that recognizes a user's physical or psychological state using a myoelectric sensor. On the first day, you will learn basic development procedures and check sample programs. On Read more [Awards] We received two Human Communication Awards Our laboratory's two research projects published in 2023 have been awarded the Human Communication Award (HC Award) by the Human Communication Group (HCG) of the Institute of Electronics, Information and Communication Engineers (IEICE). The HC Award is the most prestigious award conferred by the Human Communication Group (HCG) of the Institute of Electronics, Information and Communication Engineers (IEICE). Approximately one out of every 50 technical research Read more [Award] Research presented at SIGGRAPH Asia 2024 The top conference in the field of computer graphics, ACM SIGGRAPH Asia 2024, was held in Tokyo from December 3 to 6, 2024. Assistant Professor Hirao received the Best Demo in Show Award in the Emerging Technologies category. Additionally, a group of students, including Mr. Fujiwara from Nara National College of Technology, who is a participant in the NAIST STELLA Program (JST Next Generation Science and Read more [Award] We received SIG Haptics Presentation Award The 33rd SIG Haptics Workshop of the Virtual Reality Society of Japan was held in a hybrid format at Toyama Prefectural University and online from December 5 to 6, 2024. Mr. Iwasaki (M2) presented his research, which is a collaborative work between our laboratory and Keio University. His presentation was recognized as an outstanding research contribution that promotes academic exchange in the field of haptics and Read more Research presented at OzCHI 2024 From November 30 to December 4, 2024, at the 36th Australian Conference on Human-Computer Interaction (OzCHI 2024) held in Brisbane, Australia, Adélaïde Genay (University of Melbourne) presented our research. This project was conducted as a collaborative effort between the University of Melbourne, INRIA in France, and our laboratory. Adélaïde Genay, Erika Kimura, Martin Hachet, Anatole Lécuyer, Yutaro Hirao, Monica Perusquia-Hernandez, Hideaki Uchiyama, and Kiyoshi Kiyokawa, \"Preparing Read more 3 research projects presented at ICAT-EGVE 2024 From December 1 to 3, 2024, at the joint 34th International Conference on Artificial Reality and Telexistence & the 29th Eurographics Symposium on Virtual Environments (ICAT-EGVE 2024) held at the University of Tsukuba, we presented three research projects. Commissioned faculty member Hagimori presented the research of alumnus Mr. Fujisawa, Ms. Kimura (M2) presented her own research, and Professor Kiyokawa presented the research of an intern Mr. Read more 4 research projects presented at APMAR 2024 From November 29 to 30, 2024, at Asia-Pacific Workshop on Mixed and Augmented Reality (APMAR) 2024 held at Ryukoku University, Ms. Matsuda (D2), Ms. Nakada (D1), and Ms. Kimura (M2) presented their research. Additionally, Professor Kiyokawa presented the research of alumnus Mr. Ishizuka on his behalf. Yoriko Matsuda, Yutaro Hirao, Monica Perusquía-Hernández, Hideaki Uchiyama and Kiyoshi Kiyokawa, \"Drama Therapy in Virtual Reality: A Study on Session Read more We held a Success and Resilience Party On November 27, 2024, we held a \"Success and Resilience Party\" to celebrate our paper submissions, acknowledging both our successful acceptances and the efforts behind our rejections. This gathering served as an opportunity to honor each other's dedication and rejuvenate our spirits. We reaffirmed that while success and failure are inherent aspects of paper submissions, the key is to persist in our efforts. Read more Research presented at ICMI 2024 From November 4 to 8, 2024, Mr. Otsubo (M2) presented his research at the 26th International Conference on Multimodal Interaction (ICMI 2024) held in San José, Costa Rica. Additionally, Assistant Professor Perusquía participated in a panel titled \"Multimodal Research in Latin America.\" Hiromu Otsubo, Alexander Marquardt, Melissa Steininger, Marvin Lehnort, Felix Dollack, Yutaro Hirao, Monica Perusquia-Hernandez, Hideaki Uchiyama, Ernst Kruijff, Bernhard E. Riecke, and Kiyoshi Kiyokawa, Read more [Award] Research presented at GCCE 2024 From October 29 to November 1, 2024, at the <i>2024 IEEE 13th Global Conference on Consumer Electronics (GCCE 2024)</i> held in Kitakyushu, Associate Professor Uchiyama presented the research findings of alumnus Mr. Nakamura and received the Presentation Award. Ren Nakamura, Yutaro Hirao, Monica Perusquía-Hernández, Hideaki Uchiyama and Kiyoshi Kiyokawa, \"Generalizing Listening Human Behavior: 3D Human Pose Estimation Using Music\" (Abstract): Existing methods have utilized active acoustic Read more Two research projects presented at ISMAR 2024 The 23rd IEEE International Symposium on Mixed and Augmented Reality (ISMAR), a premier conference in the AR and VR fields, was held in Seattle, USA, from October 21 to 25, 2024. Our laboratory presented two research projects at this conference. The oral presentation by Mr. Guanghan Zhao (Tohoku University) showcased collaborative research conducted by Tohoku University, Augusta University, Osaka University and our laboratory. Additionally, a poster Read more [Award] We won the IPIN 2024 competition The top conference on indoor positioning and indoor navigation, the 14th International Conference on Indoor Positioning and Indoor Navigation (IPIN), was held in Hong Kong from October 14 to 17, 2024, and SineCompass, developed by our lab’s team led by intern Theo Alric, won first place in the IPIN competition. SineCompass is an indoor positioning system that tracks pedestrians by combining WiFi and IMU sensors. IMU Read more Research presented at UIST 2024 The 37th Annual ACM Symposium on User Interface Software and Technology (UIST), a premier conference in the user interface field, was held in Pittsburgh, USA, from October 13 to 16, 2024. Assistant Professor Hirao presented research conducted in collaboration between our laboratory and the University of Tokyo. (Paper) Takeru Hashimoto and Yutaro Hirao, \"Selfrionette: A Fingertip Force-Input Controller for Continuous Full-Body Avatar Manipulation and Diverse Haptic Read more Mr. Ota (D1) to undertake short-term study at INSA Rennes We held a send-off party for Mr. Hiroki Ota, a first-year doctoral student, as he embarks on a short-term study program at INSA Rennes in France. Supported by the \"Support for Pioneering Research Initiated by the Next Generation\", the \"Support Project Ver.2 for Innovative Doctoral Students in the Field of Multi-disciplinary Research in Advanced Science and Technology (NAIST Granite Program)\", and the Japan Student Services Organization Read more Research presented at SUI 2024 On October 7-8, 2024, at the ACM Symposium on Spatial User Interaction (SUI) 2024 held in Trier, Germany, Mr. Marvin Lehnort from Bonn-Rhein-Sieg University of Applied Sciences presented the results of our collaborative research. Alexander Marquardt, Marvin Lehnort, Hiromu Otsubo, Monica Perusquia-Hernandez, Melissa Steininger, Felix Dollack, Hideaki Uchiyama, Kiyoshi Kiyokawa, and Ernst Kruijff, \"Exploring Gesture Interaction in Underwater Virtual Reality\" (Abstract) An underwater virtual reality (UVR) Read more We held the ACIMT workshop On September 30, 2024, as part of MobileHCI 2024, the Affective Computing for Mobile Technologies (ACIMT) workshop was held in Melbourne, Australia. Assistant Professor Perusquía contributed to th",
  "content_length": 14315,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:14"
}