{
  "name": "Kjetil Nørvåg",
  "homepage": "http://www.idi.ntnu.no/~noervaag",
  "status": "success",
  "content": "Kjetil Nørvåg's Home Page [About Kjetil Nørvåg] [Travel photos] [Research Interests] [Publications] [CV] Name: Kjetil Nørvåg, Dr.Ing. Position: Professor Email: noervaag at ntnu.no Mail: Dept. of Computer Science (IDI) Norwegian University of Science and Technology (NTNU) Sem Sælandsv. 7-9 N-7491 Trondheim, Norway A few words about myself... Hi! I'm working as a professor in the Department of Computer and Information Science here at NTNU. I'm affiliated with the Data and Artificial Intelligence Group, where my current main research interests include Big Data, distributed and parallel database systems, query processing, temporal information retrieval and text mining (see my publications list for more details). My interests include Latin American History and Politics (Colombia in particular), Traveling, Photography (press here for pictures from some not so recent travels), Music, Literature, Disney Comics, and Wine Tasting. Travel I love to travel, and especially backpacking! I've currently visited over 70 countries. My favorites are the Latin American countries, probably because of the music and literature from that region. I like taking photos when I'm traveling (you can browse some of them by pressing here.). Here are a few samples of the pictures (I guess you can figure out how to see a larger version :-): Rafting in Jølster, Norway (1995). Bath Nour Eddin in Damascus, Syria, the world's oldest (1997). Crac des Chevaliers, Syria (1997). Beduins, near Palmyra, Syria (1997). Kjetil and snake friend, Delhi (1996). Leticia, Department of Amazonas, Colombia (1997). Honduras (1996). Tikal, Guatemala (1996). Dal Lake, Kashmir, India (1996). Father and son, Sonamarg, Kashmir, India (1996). Young girl, Thikse, Ladakh, India (1996). Nice hotel room, Managua, Nicaragua (1996). Music I spend a lot of time listening to music. Much of what I'm listening to is ethnic music (\"world music\"), in particular Latin American and Greek. Some of the Norwegian music I listen to can also be classified as exotic, ethnic, music: Vømmøl Spellemannslag and Vestlandsfanden. :-) Literature My favorite authors are Ernest Hemingway, Gabriel Garcia Marquez, Nordahl Grieg and Jack Kerouac, but I also read books of other authors. :-) Disney Comics It seems like I never get too old to read Disney comics...guess I feel a bit too much like Donald Duck. :-) Wine Still an amateur, but \"learnin' all the time\". :-) My favorite wine area is Rioja, and I'm in particular fond of the vines from Rioja Alta (one of the areas of Rioja, as well as the name of one of the top producers in Spain).",
  "content_length": 2591,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:24"
}