{
  "name": "Klaus-Dieter Althoff",
  "homepage": "https://www.uni-hildesheim.de/fb4/institute/ifi/intelligente-informationssysteme-iis/mitglieder/prof-dr-klaus-dieter-althoff",
  "status": "success",
  "content": "Universität Hildesheim | Mathematik, Naturwissenschaften, Wirtschaft & Informatik | Intelligente Informationssysteme (IIS) | Prof. Dr. Klaus-Dieter Althoff Zur Homepage IFIMathematik, Naturwissenschaften, Wirtschaft & Informatik Intelligente Informationssysteme (IIS) Universität Hildesheim › Mathematik, Naturwissenschaften, Wirtschaft & Informatik  ›  Institute  ›  Institut für Informatik  ›  Abteilungen  ›  Mitglieder  ›  Prof. Dr. Klaus-Dieter Althoff Prof. Dr. Klaus-Dieter Althoff Institut für Informatik Bereich Intelligente Informationssysteme Universitätsplatz 1 31141 Hildesheim Besucheradresse: Institut für Informatik Samelsonplatz 1 31141 Hildesheim Sekretariat: Raum A8b Spl, Telefon +49 5121 883 -750 webmaster@iis.uni-hildesheim.de Besucheradresse: Stiftung Universität Hildesheim Institut für Informatik Samelsonplatz 1 31141 Hildesheim in Google Maps Nur Inhalt anzeigen Zum Anfang der Seite Cookie Hinweis Die Webseite der Universität Hildesheim verwendet Cookies. Cookies werden eingesetzt zur Bereitstellung, Aufrechterhaltung und Verbesserung unserer Dienste und Anzeigen. Einige Dienste erfordern es, dass der aufrufende Browser auch nach einem Seitenwechsel identifiziert werden kann (u.a. das Content-Management System für SSO Login/nach Zugang). Dazu wird in den Cookies eine eindeutige, zufällig erzeugte Identifikationsnummer für die Dauer des Besuchs der Webseiten gespeichert und übermittelt. Unter „Einstellungen“ können Sie zudem die einzelnen Cookies auswählen, welche Sie akzeptieren wollen. Das Einverständnis in die Verwendung der Cookies können Sie jederzeit, auch teilweise, widerrufen. Weitere Informationen zu Cookies auf dieser Website finden Sie in unserer Datenschutzerklärung und zu uns im Impressum. Notwendige Cookies Ablehnen Speichern Details anzeigen Details ausblenden Notwendige Cookies Notwendige Cookies Impressum | Datenschutz",
  "content_length": 1882,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:30"
}