{
  "name": "Klaus Jansen",
  "homepage": "https://www.algo.informatik.uni-kiel.de/de/team/klaus-jansen",
  "status": "success",
  "content": "Algorithmen und Komplexität Zentrum unserer Forschung ist die Entwicklung effizienter (exakter und parametrisierter) Algorithmen für Optimierungsprobleme der Informatik. Dies umfasst die tatsächliche Entwicklung der Algorithmen im theoretischen Sinne, inkl. Beweise der Korrektheit und Laufzeit, Entwicklung unterer Schranken für Laufzeit und/oder Approximationsgüte und ggf. auch Implementierung. Prof. Dr. Klaus Jansenklaus.jansen@informatik.uni-kiel.de+49 431 880-7501Christian-Albrechts-Platz 424118 KielRaum: 1007 (CAP 4) Bei Schedulingproblemen müssen Jobs Maschinen zugewiesen werden. Verschiedene Maschinenmodelle, Jobcharakteristiken und Zielfunktionen führen zu einer Vielzahl an Optimierungsproblemen, von denen die meisten NP-schwer sind. Ein klassisches Beispiel ist Job Sequencing: Gegeben ist eine Menge von Jobs (jeweils mit einer Ausführungszeit, einer Deadline und einem Gewicht) und das Ziel ist, eine Auswahl (und Anordnung) der Jobs zu finden, die maximales Gesamtgewicht haben und alle rechtzeitig fertiggestellt werden können (d.h. ohne dass einer der Jobs seine Deadline verpasst). Bei Packungsproblemen müssen Gegenstände in Containern mit begrenzter Größe zugewiesen werden. Oftmals wird dabei auch ein Profit maximiert, wie zum Beispiel beim klassischen Rucksackproblem. Dort hat man eine Menge von Gegenständen (jeweils mit Profit und Gewicht) und einen Rucksack (mit einer Kapazität) gegeben. Das Ziel ist, eine Teilmenge der Gegenstände zu finden, deren Gesamtgewicht die Kapazität nicht überschreitet und deren Gesamtprofit maximal ist. Es passiert nicht selten, dass man bei der Entwicklung von Algorithmen auf Probleme stößt. Da ist es hilfreich, wenn man zeigen kann, dass eine gewisse Laufzeit oder Güte unter plausiblen Annahmen gar nicht erreicht werden kann. Eine klassische solche Annahme ist P ungleich NP, es gibt jedoch noch andere Annahmen wie die Exponentialzeithypothese und die (min,+)-Hypothese, wodurch sich bessere untere Schranken zeigen lassen. Bei Ganzzahligen Linearen Programmen (ILPs) ist die Aufgabe, einen Vektor x zu finden, der eine lineare Zielfunktion maximiert und eine Menge an linearen Bedingungen (gegeben durch eine Matrix A und rechte Seite b) erfüllt. Diese sehr allgemeine Form ermöglicht es, unzählige Optimierungsprobleme – darunter unter Anderem auch Scheduling- und Packungsprobleme – zu modellieren. Ein Algorithmus zum Lösen von ILPs kann daher auch zum Lösen vieler anderer Probleme genutzt werden. Da dieses Problem ebenfalls NP-schwer ist, betrachtet man vor allem ILPs mit entwederwenigen Variablen (d. h. der gesuchte Vektor x hat nur wenige Einträge),wenigen Bedingungen und kleinen Einträgen in der Matrix A odereiner Matrix A, die besondere Strukturen aufweist. Viele Optimierungsprobleme kann man auch in einem Online-Kontext betrachten. Dabei ist nicht von vornherein die gesamte Eingabe bekannt, sondern es kommen stückweise weitere Informationen an. Beispielsweise kann es sein, dass beim Rucksackproblem nicht alle Gegenstände gegeben sind, sondern erst nach und nach erscheinen. Wie man sich vorstellen kann, ist es im Online-Setting oft schwieriger oder manchmal sogar unmöglich, optimale Entscheidungen zu treffen. Daher versucht man in der Regel, Algorithmen mit einer guten competitive ratio zu finden, d. h. solche, bei denen die Profitrate zwischen dem (offline) Optimum und der Ausgabe möglichst klein ist. Aktuelle Forschung im ÜberblickFein-granulare Komplexität und Algorithmen für Scheduling und PackungenStrukturaussagen für ganzzahlige lineare Programme Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 4090,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:21"
}