{
  "name": "Klaus Schmid",
  "homepage": "https://sse.uni-hildesheim.de/mitglieder/prof-dr-rer-nat-klaus-schmid",
  "status": "success",
  "content": "Universität Hildesheim | Mathematik, Naturwissenschaften, Wirtschaft & Informatik | Software Systems Engineering (SSE) | Professor Dr. Klaus Schmid Zur Homepage IFIMathematik, Naturwissenschaften, Wirtschaft & Informatik Software Systems Engineering (SSE) Universität Hildesheim › Mathematik, Naturwissenschaften, Wirtschaft & Informatik  ›  Institute  ›  Institut für Informatik  ›  Abteilungen  ›  Software Systems Engineering (SSE)  ›  Mitglieder  ›  Professor Dr. Klaus Schmid Professor Dr. Klaus Schmid Kontakt: Telefon: +49 5121 883-40332 E-Mail Kontaktformular Raum: SC.C. 2.09 Homepage: https://sse.uni-hildesheim.de/mitglieder/prof-dr-rer-nat-klaus-schmid/ Homepage Tätigkeitsbereiche: Institut für Informatik [Geschäftsf. Direktor] Inst. für Informatik - Abteilung Software Systems Engineering [Professor_innen] Ständige Kommission für das Qualitätsmanagement für Lehre und Studium im FB 4 [Stellv. Studiengangsbeauftragter - AINF B.Sc./M.Sc. & Data Analytics M.Sc. & Software Engineering M.Sc.] Prüfungsausschuss & Zulassungskommission IMIT M. Sc. / Angewandte Informatik M. Sc. [Vertreter Gruppe Professor_innen (P)] Prüfungsausschuss IMIT B. Sc. / Angewandte Informatik B. Sc. [Vertreter Gruppe Professor_innen (P)] Fachbereichsrat Fachbereich 4 (7:2:2:2) [Vertreter Gruppe Professor_innen (P)] Prüfungsausschuss & Zulassungskommission Wirtschaftsinformatik M.Sc. [Stellvertreter Gruppe Professor_innen (Stellv. P)] Prüfungsausschuss Wirtschaftsinformatik B.Sc. [Stellvertreter Gruppe Professor_innen (Stellv. P)] Forschungskommission (4:1:1:1) [Stellvertreter Gruppe Professor_innen (Stellv. P) - 1. SV FB 4] Mitglieder des XXIV. Senats (7:2:2:2) [Stellvertreter Gruppe Professor_innen (Stellv. P) - stellv. Senatsmitglied FB 4] Lfd. Nr. Publikation 2025 279. Maurice H. ter Beek, Klaus Schmid und Holger Eichelberger (2025): Comparing the Universal Variability Language with other Textual Variability Modeling Languages In: Proceedings of the 29th ACM International Systems and Software Product Line Conference - Volume B SPLC-B '25 S. 71–75. Association for Computing Machinery. New York, NY, USA. 2024 278. Leonhard Faubel und Klaus Schmid (2024): MLOps: A Multiple Case Study in Industry 4.0 In: IEEE ETFA 277. Leonhard Faubel und Klaus Schmid (2024): A MLOps Architecture for XAI in Industrial Applications In: IEEE ETFA 276. Leonhard Faubel und Klaus Schmid (2024): An MLOps Platform Comparison Hildesheimer Informatik-Berichte Heft / Ausgabe 01/2024, SSE 1/24/E. University of Hildesheim. Zusammenfassung While many companies aim to use Machine Learning (ML) models, transitioning to deployment and practical application of such models can be very time-consuming and technically challenging. To address this, MLOps (ML Operations) offers processes, tools, practices, and patterns to bring ML models into operation. A large number of tools and platforms have been created to support architects and developers in creating practical solutions. However, specific needs vary strongly in a situation-dependent manner, and a good overview of their characteristics is missing, making the architect’s task very challenging.We conducted a systematic literature review (SLR) to identify key features, patterns, and platform characteristics. As a result, we provide an overview of the technical design space of MLOps and insights into different ML platforms. Our review can help architects select MLOps components and support them in their development efforts. 275. Leonhard Faubel, Thomas Woudsma, Benjamin Klöpper, Holger Eichelberger, Bülow. Fabian, Klaus Schmid, Amir Ghorbani Ghezeljehmeidan, Leila Methnani, Andreas Theodorou und Magnus Bang (2024): MLOps for Cyber-Physical Production Systems: Challenges and Solutions In: IEEE Software. Zusammenfassung Machine Learning Operations (MLOps) involves software development practices for Machine Learning (ML), including data management, preprocessing, model training, deployment, and monitoring. While MLOps have received significant interest, much less work has been published addressing MLOps in industrial production settings lately, particularly if solutions are not cloud-based. This article addresses this shortcoming based on our and our partner’s real industrial experience in various projects. While there is a broad range of challenges for MLOps in cyber-physical production systems (CPPS), we focus on those related to data, models, and operations as we assume these will directly benefit the reader and provide solutions such as lightweight integration, integration of domain knowledge, periodic calibration, and interactive interfaces. In this way, we want to support practitioners in setting up industrial MLOps environments in CPPS. Further, we discuss explainability as an additional part of MLOps, which should be explored in more detail in the future. 274. Prankur Agarwal, Kevin Feichtinger, Klaus Schmid, Holger Eichelberger und Rick Rabiser (2024): On the Challenges of Transforming UVL to IVML In: 6th International Workshop on Languages for Modelling Variability (MODEVAR'24) 273. Leonhard Faubel und Klaus Schmid (2024): A Systematic Analysis of MLOps Features and Platforms In: WiPiEC Journal - WiPiEC Journal - Works in Progress in Embedded Computing Journal, 10 (2). Zusammenfassung While many companies aim to use Machine Learning (ML) models, transitioning to deployment and practical application of such models can be very time-consuming and technically challenging. To address this, MLOps (ML Operations) offers processes, tools, practices, and patterns to bring ML models into operation. A large number of tools and platforms have been created to support developers in creating practical solutions. However, specific needs vary strongly in a situation-dependent manner, and a good overview of their characteristics is missing, making the architect’s task very challenging. We conducted a systematic literature review (SLR) of MLOps platforms, describing their qualities, features, tactics, and patterns. In this paper, we want to map the design space of MLOps platforms. We are guided by the Attribute-Driven Design (ADD) methodology. In this way, we want to provide software architects with a tool to support their work in the platform area. 2023 272. Christian Kröher, Lea Kristin Gerling und Klaus Schmid (2023): Control Action Types – Patterns of Applied Control for Self-adaptive Systems In: 18th International Symposium on Software Engineering for Adaptive and Self-Managing Systems IEEE. Best Paper Award Zusammenfassung A Self-adaptive System (SaS) modifies its domain functionality according to changes in its environment autonomously. Distributed control and central control represent two complementary paradigms to establish this capability. The selection of one of them leads to significant trade-offs regarding certain software qualities when designing a SaS. A promising approach to minimize these trade-offs is an integration, which combines the individual benefits to achieve the best of both paradigms. However, establishing such a multi-paradigm control requires comprehensive knowledge about control options and their interactions, which is hardly available. In this paper, we present patterns for integrating distributed and central control. We introduce them by a schema of Control Action Types (CATs). Each CAT describes a unique type of interaction between a central controller and a distributed controlled SaS to achieve a desired adaptation. Further, we identify involved trade-offs between these CATs aiming at a systematic discussion of the range of multi-paradigm control for a SaS. 271. Leonhard Faubel und Klaus Schmid (2023): An Analysis of MLOps Practices Hildesheimer Informatik-Berichte Heft / Ausgabe 1/2023, SSE 1/23/E. Software Systems Engineering, Institut für Informatik, Universität Hildesheim. Universitätsplatz 1, 31134 Hildesheim. Zusammenfassung The EXPLAIN project (EXPLanatory interactive Artificial intelligence for INdustry) aims at enabling explainable Machine Learning in industry. MLOps (Machine Learning Operations) includes tools, practices, and processes for deploying ML (Machine Learning) in production. These will be extended by explainability methods as part of the project. This study aims to determine to what extent MLOps is implemented by four project partner companies. Further, the study describes the ML use cases, MLOps software architecture, tools, and requirements in the companies perspective. Besides, requirements for a novel MLOps software architecture, including explainability methods, are collected. As a result the interviews show that each of the interviewed industry partners use MLOps differently. Different tools and architectural patterns are used depending on the particular use case. Overall, most information we gathered focused on architecture decisions in the MLOps tool landscape used by the interviewed companies. 270. Christian Kröher, Moritz Flöter, Lea Kristin Gerling und Klaus Schmid (2023): Incremental Software Product Line Verification - A Performance Analysis with Dead Variable Code In: Software Engineering 2023 Bd. P-332. S. 79-80. Gesellschaft für Informatik e.V.. Bonn, Germany. Zusammenfassung In this work, we summarize our journal paper published in Empirical Software Engineering(EMSE) in 2022 [Kr22]. Verification approaches for Software Product Lines (SPL) aim at detectingvariability-related defects and inconsistencies. In general, these analyses take a significant amountof time to provide complete results for an entire, complex SPL. If the SPL evolves, these resultspotentially become invalid, which requires a time-consuming re-verification of the entire SPL foreach increment. However, in previous work we showed that variability-related changes occur rather infrequently andtypically only affect small parts of a SPL. In this paper, we utilize this observation and presentan incremental dead variable code analysis as an example for incremental SPL verification, whichachieves significant ",
  "content_length": 228478,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:25"
}