{
  "name": "Klaus Obermayer",
  "homepage": "https://www.ni.tu-berlin.de/menue/mitarbeiter/leiter_der_forschungsgruppe/obermayer_klaus/parameter/de",
  "status": "success",
  "content": "Neuronale Informationsverarbeitung - TU Berlin Neuronale Informationsverarbeitung Wir beschäftigen uns mit den Grundlagen der Informationsverarbeitung in biologischen Systemen. Einerseits möchten wir die Funktionsmechanismen unseres Gehirns verstehen, andererseits machen wir uns die Strategien biologischer Systeme in Anwendungen maschinellen Lernens zu Nutze. Unsere Forschungsinteressen sind thematisch in drei Bereiche unterteilt. © NI, TUBModelle neuronaler SystemeIn Zusammenarbeit mit Neurobiologen und Klinikern erforschen wir die Mechanismen der Informationsverarbeitung im visuellen System. Die Forschungsthemen behinhalten: Kortikale Dynamik, die Repräsentation visueller Information, Adaptation und Plastizität, sowie die Rolle von Rückkopplung. Seit jüngerer Zeit beschäftigen wir uns mit dem Zusammenhang von Wahrnehmung und kognitiven Funktionen. Hier untersuchen wir mathematische Modelle der Entscheidungsfindung in unbekannten Umgebungen hinsichtlich der Frage, wie die zugrunde liegenden Prozesse mit Wahrnehmung und Gedächtnis wechselwirken.© NI, TUBMaschinelles Lernen und neuronale NetzeHier befassen wir uns mit dem künstlichen Erlernen von Zusammenhängen anhand von Beispielen, um Vorhersagen und Entscheidungen zu treffen. Die Forschungsthemen umfassen: Lernen geeigneter Darstellungen/Abbildungen, aktive und halbüberwachte Lernverfahren, sowie Prototyp-bezogene Methoden. Inspiriert durch die Modell-basierte Erforschung jener Vorgänge, welche für die Entscheidungsfindung eine zentrale Rolle spielen, haben wir begonnen Belohnungs- bzw. Bestrafungs-Lernen zu untersuchen und erweitern. Zusammen mit Spezialisten aus verschiedenen Anwendungsbereichen setzen wir maschinelles Lernen etwa zur Wiedergewinnung von Informationen ein, für maschinelles Sehen oder in der Chemoinformatik.© NI, TUBAnalyse neuronaler DatenHier wenden wir maschinelles Lernen und statistische Verfahren zur Analyse multivariater biometrischer Daten an, insbesondere Daten, welche eine Grundlage für unsere computergestützten Studien neuronaler Systeme bilden. Die Forschungsthemen variieren und beinhalten gegenwärtig Spike-sorting und die Analyse von Multi-Tetroden Aufnahmen, Konfokalmikroskopie und 3D-Rekonstruktionsmethoden, sowie die Analyse von Daten bildgebender Verfahren. Seit Kurzem beschäftigen wir uns mit der Analyse multimodaler Daten und korrelieren beispielsweise anatomische, genetische, und Bilddatensätze. Forschungslabs der Fakultät IV Cognitive Systems Data Analytics & Cloud Future Internet & Media Technology Cyber-Physical Systems Verbundprojekte in Forschung und Lehre Bernstein Center for Computational Neuroscience Graduate School Mind and Brain International Master-Program in Computational Neuroscience Einstein Center Neurosciences SFB 910 \"Control of Self-Organizing Nonlinear Systems\" Science of Intelligence (DFG Cluster of Excellence) SFB 1315 \"Mechanisms and Disturbances in Memory Consolidation\" CRCNS (BMBF & NSF): „Language Representations in Bilinguals\" Keine Nachrichten verfügbar. 05 Dez NI group talk Adeoluwawale Adewusi & Youssef Kashef 12 Dez NI group talk Michael Scholz 16 Jan NI group talk Sambu Seo 23 Jan NI group talk Sandra Saghir 30 Jan NI group talk Georg Reich 06 Feb NI group talk Jakob MühleggerAlle anzeigen Ich bin damit einverstanden, dass mir Inhalte von OpenStreetMap angezeigt werden. © NI, TUB© TU Berlin, Abt. IV Gebäude-/DienstemanagementDie Arbeitsgruppe \"Neuronale Informationsverarbeitung\" befindet sich im Haus in der Marchstrasse 23 (MAR) im 5. Stock. Neuronale Informationsverarbeitung Einrichtung Technische Universität Berlin Sekretariat MAR 5-6 Gebäude MAR Adresse Marchstrasse 23 10587 Berlin Prof. Dr. Klaus Obermayer klaus.obermayer(at)tu-berlin.de Gebäude MAR Raum MAR 5043 Sprechstunden Fr 12:00-13:00 Camilla Groiß camilla.groiss(at)tu-berlin.de +49 30 314-73442 +49 30 314-73121 Sekretariat MAR 5-6 Gebäude MAR Raum MAR 5042 Sprechstunden Mi 9:00-11:00 Profil",
  "content_length": 3943,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:27"
}