{
  "name": "Klaus Kabitzsch",
  "homepage": "https://tu-dresden.de/cdd/leitung_und_beteiligte/mitglieder/bereich-mathematik/Kabitzsch",
  "status": "success",
  "content": "Prof. Dr. Klaus Kabitzsch — Centrum für Demografie und Diversität (CDD) — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen InhaltsverzeichnisFORSCHUNGSSCHWERPUNKTE LEBENSLAUF AKTUELLE PUBLIKATIONEN (AUSZUG) AKTUELLE FORSCHUNG (AUSZUG) © TU Dresden Professor Name Herr Prof. Dr.-Ing. habil. Klaus Kabitzsch Professur für Technische Informationssysteme (TIS) E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Adresse work Besucheradresse: Andreas-Pfitzmann-Bau, Fakultät Informatik, 1. Etage, Raum 1074 Nöthnitzer Straße 46 01187 Dresden Deutschland Zeige Karte von diesem Ort. work Tel. work Tel. fax Fax +49 351 463-28460 Sprechzeiten: Dienstag: 09:30 - 11:00 Mittwoch: 09:30 - 11:00 Donnerstag: 09:30 - 11:00 und nach Vereinbarung Zur Professur für Technische Informationssysteme FORSCHUNGSSCHWERPUNKTE Smart Home und Smart Building Assistenzsysteme für Senioren und Behinderte Vernetzte Sensoren LEBENSLAUF Hochschulstudium 1992 Habilitation (Dr.-Ing. habil.): \"Architekturen zur Kleinautomatisierung mit variierender Kosten-Stückzahl-Relation, dargestellt am Beispiel der Land- und Nahrungsgütertechnik\" Fachbuch: \"Mikrorechner in der Automatisierungspraxis\" 1982 Dissertation (Dr.-Ing.): \"Beitrag zum rechnergestützten Entwurf linearer Schaltungen, die akustoelektronische Bauelemente als wesentlichen Bestandteil enthalten\" 1972-1976 Studium an der Technischen Hochschule Ilmenau Informationstechnik (Nachrichtentechnik) mit Schwerpunkt Höchstfrequenztechnik Wissenschaftlicher Werdegang ab 1993 C4-Professur für Technische Informationssysteme an der Fakultät Informatik der TUD bis 1993 C3-Professur am Fachbereich Elektrotechnik der Hochschule für Technik, Wirtschaft und Kultur Leipzig 1989-1992 Oberassistenz am Lehrstuhl für Automatisierungssysteme der Technischen Hochschule Leipzig 1976-1981 Assistenz am Lehrstuhl elektronische Schaltungstechnik der TH Ilmenau 1989-1992 Oberassistenz am Lehrstuhl für Automatisierungssysteme der Technischen Beruflicher Werdegang 1981-1989 Industrietätigkeit Automatisierungstechnik Leipzig GmbH/Institut für Landmaschinentechnik als Mitarbeiter für Forschung/Entwicklung AKTUELLE PUBLIKATIONEN (AUSZUG) 1.  Als Herausgeber oder Mitautoren von Monografien Kozak, W., Stein, D., Felsmann, C., Hensel, B., Kabitzsch, K., Rieckhof, F., and Rösler, M., AmI-based control of ventilation and air conditioning systems and exemplary application to the phenomenon of \"dry air\". Bundesanstalt für Arbeitsschutz und Arbeitsmedizin (ed.), Dortmund, 2015. Kozak, W., Stein, D., Felsmann, C., Hensel, B., Kabitzsch, K., Rieckhof, F., und Rösler, M., AmI-basierte Regelung von Klimaanlagen und Anwendung auf das Phänomen der \"Trockenen Luft\". Bundesanstalt für Arbeitsschutz und Arbeitsmedizin (Hrsg.), Dortmund, 2014, ISBN 978-3-88261-033-8. Eichelberg, M., Kabitzsch, K., et al., Interoberabilität von AAL-Systemkomponenten. Teil 1: Stand der Technik. VDE Verlag, Berlin, 2010, ISBN 978-3-8007-3196-1. Eichelberg, M., Kabitzsch, K., et al., Interoperabilität von AAL-Systemkomponenten. Teil 2: Leitfaden interoperable Assistenzsysteme - vom Szenario zur Anforderung. VDE Verlag, Berlin, 2013, ISBN 978-3-8007-3515-0. Arbeitsgruppe „Schnittstellenintegration und Interoperabilität“ und „Kommunikation“ der BMBF/VDE Innovationspartnerschaft AAL, AAL-Anwendungsszenarien. VDE Verband der Elektrotechnik Elektronik Informationstechnik e.V. (Hrsg.), Juni 2011, ISBN 978-3-925512-22-3. Arbeitsgruppe „Bestandsaufnahme“ der BMBF/VDE Innovationspartnerschaft AAL, Ambient Assisted Living (AAL). Komponenten, Projekte, Services. Eine Bestandsaufnahme. VDE Verlag GmbH, Berlin, 2011, ISBN 978-3-8007-3328-6. Schach, R., Kabitzsch, K., Höschele, V., und Otto, J., Integriertes Facility Management. expert Verlag, Renningen, 2005, ISBN 3-8169-2467-0. 2.  Beiträge in Sammelwerken und Zeitschriften Welge, R., Busch, B., Kabitzsch, K., Laurila-Dürsch, J., Heusinger, S., Lipprandt, M., Eichelberg, M., Eichenberg, E., Engelien, H., Gök, M., Moritz, G., Hein, A., and Dutz, T., AAL-Onto - A Formal Representation of RAALI Integration Profiles. Tagungsband Wohnen - Pflege - Teilhabe - Besser leben durch Technik, 7. Deutscher AAL-Kongress mit Ausstellung, Berlin, Januar 2014, VDE Verlag, ISBN 978-3-8007-3574-7, Paper 13.1. Lipprandt, M., Welge, R., Eichelberg, M., Eichenberg, E., Engelien, H., Kabitzsch, K., Gök, M., Busch, B.-H., Laurila-Epe, J., Heusinger, S., Moritz, G., und Hein, A.: , Beschreibungsmethodik für AAL-Integrationsprofile. Lecture Notes in Informatics (LNI) - Proceedings - Series of the Gesellschaft für Informatik (GI), Vol. P-208, (2012). ISBN 978-3-88579-602-2, ISSN 1617-5468, S. 1416-1430. Ploennigs, J., Dibowski, H., Ryssel, U., und Kabitzsch, K., Ganzheitlicher, automatischer Entwurf drahtloser Gebäudeautomationssysteme. Automatisierungstechnik (at), Vol. 61, No. 6, 2013, S. 393-402. Welge, R., Busch, B.-H., Kabitzsch, K., Laurila-Epe, J., Heusinger, S., Lipprandt, M., Eichelberg, M., Eichenberg, E., Engelien, H., Gök, M., Moritz, G., und Hein, A., Ontologiebasierte Repräsentation von Integrationsprofilen. Tagungsband Ambient Assisted Living, 6. Deutscher AAL-Kongress mit Ausstellung, Januar 2013, Berlin. VDE Verlag, Berlin, ISBN 978-3-8007-3484-9, Paper 13.1. Welge, R., Busch, B.-H., Kabitzsch, K., Laurila-Epe, J., Heusinger, S., Lipprandt, M., Eichelberg, M., Eichenberg, E., Engelien, H., Gök, M., Moritz, G., und Hein, A., Representation of Integration Profiles using an Ontology. Ambient Assisted Living: Advanced Technologies and Societal Change, Springer Verlag, 2013. Clement, J., Ploennigs, J., and Kabitzsch, K., Implementation and Detection of ADL-Parallelism based on Smart meter. AAL Forum, Eindhoven, The Netherlands, September 2012. Clement, J., Plönnigs, J., und Kabitzsch, K., Intelligente Zähler: ADLs erkennen und individualisieren. 5. Deutscher AAL-Kongress, Berlin, Januar 2012, ISBN 978-3-8007-3400-9. Clement, J., Ploennigs, J., and Kabitzsch, K., Smart Meter: Detect and Individualize ADLs. 5. Deutscher AAL-Kongress, Berlin, Januar 2012, ISBN 978-3-642-27491-6. Lipprandt, M., Welge, R., Eichenberg, M., Eichenberg, E., Engelien, H., Kabitzsch, K., Gök, M., Busch, B.-H., Laurila-Epe, J., Heusinger, S., Moritz, G., und Hein, A., Beschreibungsmethodik für AAL-Integrationsprofile. 42. Jahrestagung der Gesellschaft für Informatik und 57. Jahrestagung der Deutschen Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie e.V. (GMDS), Braunschweig, September 2012. Clement, J., Plönnigs, J., and Kabitzsch, K., Characterization and Communication of an AAL-Business-Model. AAL-Forum 2011, Lecce, Italy, September 2011. Clement, J., Plönnigs, J., and Kabitzsch, K., Enhanced Inactivity Diagram to Meet Elderly Needs. AAL-Forum 2011, Lecce, Italy, September 2011. Clement, J., Plönnigs, J., und Kabitzsch, K., Lernen eines ADL-Tagesprofils menschlichen Verhaltens mittels hierarchisch aufgebautem Markov Modell. Demographischer Wandel - Assistenzsysteme aus der Forschung in den Markt (Tagungsband des 4. Deutschen AAL-Kongresses), VDE Verlag, Berlin, Januar 2011, ISBN 978-3-8007-3323-1. Schmidt, F., Kabitzsch, K., Clement, J., Hildebrandt, D., Richter, K.-P., und Hirschfeld, D., Automatisierte Assistenz in Gefahrensituationen - das Projekt AutAGef und sein Geschäftsmodell. Demographischer Wandel - Assistenzsysteme aus der Forschung in den Markt (Tagungsband des 4. Deutschen AAL-Kongresses), VDE Verlag, Berlin, Januar 2011, ISBN 978-3-8007-3323-1. AKTUELLE FORSCHUNG (AUSZUG) AmI-basierte Klimaregelung - Teil 2 AmI-basierten Regelung raumlufttechnischer Anlagen am Beispiel des Phänomens \"Trockene Luft\" zur Verbesserung von Arbeitsschutz und Arbeitssicherheit mehr ... AUTES-Home Automatisierte Einkaufs- und Entwurfsberater für das Smart-Home mehr ... ServiceFlow Dienstleistungskette zum Entwurf vernetzter Gebäudeautomation mehr AUTAGEF Lösungen zur frühzeitigen, automatischen Alarmierung bei Gefahren (Unfällen, Infarkten, Fehlbedienung technischer Geräte) in Seniorenhaushalten, um danach schnell Hilfe zu organisieren. mehr ... AUTEG Automatisierter Entwurf für die Gebäudeautomation. mehr MATI Identifikation neuer Lösungsansätze für den Bau demografisch nachhaltiger, generationengerechter Gebäude durch eine verbesserte Mensch-Architektur-Technik-Interaktion. mehr RAALI Interoperabilität, d. h. die Fähigkeit zum Zusammenspiel von AAL-Systemen und ­System-komponenten als wesentliche Voraussetzung für die erfolgreiche Einführung von AAL-Systemen am Markt. mehr Zu dieser Seite CDD Letzte Änderung: 28.08.2019 Diese Seite … … auf Facebook teilen … auf Twitter/X teilen … drucken … als E-Mail versenden",
  "content_length": 8740,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:19"
}