{
  "name": "Klaus Tochtermann",
  "homepage": "https://www.zbw.eu/en/research/klaus-tochtermann",
  "status": "success",
  "content": "Profile of Professor Klaus Tochtermann - ZBW Skip to main contentProfessor Klaus TochtermannDirectorE-mailT: +49 431 8814-333Düsternbrooker Weg 12024105 KielPositionDirectorHead of Department: Digital Information InfrastructuresCurrent areas of workOpen ScienceResearch Data ManagementDigital Information InfrastructuresProfessional backgroundSince 2010 \tDirector of the ZBW - Leibniz Information Centre for Economics and University Professor for Digital Information Infrastructures at the University of Kiel2004-2010 \tUniversity Professor in Computer Science at Graz University of Technology2002 \tHabilitation (2nd doctorate degree) in \"Applied Information Processing and Communication\", Graz University of Technology2001-2010 \tManaging Director, Austria's Competence Centre for Knowledge Management, Know-Centre Graz1997-2000 \tHead of Department, Research Institute for Applied Processing, Ulm1996 \tPostdoc, Texas A&M University, Center for the Study of Digital Libraries, USADoctorate in Computer Science, University of Dortmund1985-1991 \tDiploma in Computer Science, Universities of Kiel and DortmundFellowships / professional affiliations (selection)President of the European Open Science Cloud Association (since 2025)Member of the Scientific Senate of the German National Research Data Infrastructure (NFDI)Expert on the Styrian Research CouncilMember of the Advisory Board of the program \"Sparkling Science 2.0\" BMBWF AustriaMember of the High-Level Expert Group \"European Open Science Cloud\" of the European Commission, DG Research and Innovation (until 2018)Visiting Professor for Digital Infrastructures at the University of St. Gallen (2016)Visiting Professor at the Universiti Teknologi MARA (Malaysia) (until 2016)Member of the German Council for Scientific Information Infrastructures (until 2022)Member of the Supervisory Board of the Know-Center - Graz (Austria)Member of the Working Group Sustainability for the European Open Science Cloud (2019-2020)Chair of the Advisory Council for Digitalisation at Graz University of Technology (until 2024)President of the university council of the South East European University Tetovo/Skopje (Northern Macedonia)Member of the Advisory Board at numerous institutes of the Leibniz AssociationPublicationsArticles (peer reviewed)Hajra, Arben / Pianos, Tamara / Tochtermann, KlausMeet the Author: linking and displaying author information in EconBiz Author profilesIn: International Journal of Metadata, Semantics and Ontologies - Geneva: Inderscience, ISSN 1744-263X, Vol. 17 (2025), No. 1, pp. 40-59, doi:10.1504/IJMSO.2024.145516 Link to fulltext (PDF) Seidlmayer, Eva / Melnychuk, Tetyana / Galke, Lukas / Kühnel, Lisa / Tochtermann, Klaus / Schultz, Carsten / Förstner, Konrad U.Research topic displacement and the lack of interdisciplinarity: lessons from the scientific response to COVID‑19In: Scientometrics - Berlin: Springer Nature, ISSN 1588-2861, Vol. 129 (2024), pp. 5141-5179, doi:10.1007/s11192-024-05132-x Link to fulltext (PDF) Melnychuk, Tetyana / Galke, Lukas / Seidlmayer, Eva / Bröring, Stefanie / Förstner, Konrad U. / Tochtermann, Klaus / Schultz, CarstenDevelopment of Similarity Measures From Graph-Structured Bibliographic Metadata: An Application to Identify Scientific ConvergenceIn: IEEE Transactions on Engineering Management - Piscataway, NJ: IEEE, ISSN 1558-0040,2023, No. (early access), pp. 1-17, doi:10.1109/TEM.2023.3308008 Link to fulltext (PDF) Gehrlein, Sabine / Klein, Annette / Schumm, Irene / Tochtermann, KlausBERD@NFDI für unstrukturierte Daten in den Wirtschafts- und SozialwissenschaftenIn: Zeitschrift für Bibliothekswesen und Bibliographie (ZfBB) - Frankfurt am Main: Vittorio Klostermann, ISSN 1864-2950, Vol. 69 (2022), No. 1-2, pp. 59-67, doi:10.3196/1864295020691280 Link to fulltext (PDF) Latif, Atif / Limani, Fidan / Tochtermann, KlausOn the Complexities of Federating Research Data InfrastructuresIn: Data Intelligence - Cambridge, Mass.: MIT Press, ISSN 2641-435X, Vol. 3 (2021), No. 1, pp. 79-87, doi:10.1162/dint_a_00080 Link to fulltext (PDF) Melnychuk, Tetyana / Galke, Lukas / Seidlmayer, Eva / Förstner, Konrad U. / Tochtermann, Klaus / Schultz, CarstenFrüherkennung wissenschaftlicher Konvergenz im HochschulmanagementIn: Hochschulmanagement - Bielefeld: UniversitätsVerlagWebler, ISSN 1860-3025,2021, No. 1/2021, pp. 24-28 Link to fulltext (PDF) Limani, Fidan / Latif, Atif / Tochtermann, KlausLinks between research artefacts: use cases for digital librariesIn: International Journal of Metadata, Semantics and Ontologies (IJMSO) - Cointrin-Geneva: Inderscience, ISSN 1744-263X, Vol. 15 (2021), No. 2, pp. 133-143, doi:10.1504/IJMSO.2021.120285 Link to fulltext (PDF) Latif, Atif / Limani, Fidan / Tochtermann, KlausA Generic Research Data Infrastructure for Long Tail Research Data ManagementIn: Data Science Journal - London: Ubiquity Press, ISSN 1683-1470, Vol. 18 (2019), No. 1 (article no. 17), pp. 1-11, doi:10.5334/dsj-2019-017 Link to fulltext (PDF) Limani, Fidan / Latif, Atif / Borst, Timo / Tochtermann, KlausMetadata Challenges for Long Tail Research Data InfrastructuresIn: Bibliothek, Forschung und Praxis - Berlin: De Gruyter, ISSN 1865-7648, Vol. 41 (2019), No. 1, pp. 68-74, doi:10.1515/bfp-2019-2014 Link to fulltext (PDF) Hajra, Arben / Tochtermann, KlausLinking science: approaches for linking scientific publications across different LOD repositoriesIn: International Journal of Metadata, Semantics and Ontologies - Olney, Bucks: Inderscience, ISSN 1744-263X, Vol. 12 (2017), No. 2/3, pp. 124-141, doi:10.1504/IJMSO.2017.10011833 Link to fulltext (PDF) Linek, Stephanie B. / Tochtermann, KlausPaper Prototyping: The Surplus Merit of a Multi-Method ApproachIn: Forum Qualitative Sozialforschung / Forum: Qualitative Social Research - Berlin: Freie Universität, ISSN 1438-5627, Vol. 16 (2015), No. 3 Art. 7, Link to fulltext (PDF) Peters, Isabella / Scherp, Ansgar / Tochtermann, KlausScience 2.0 and Libraries - Convergence of two sides of the same coin at ZBW - Leibniz Information Centre for EconomicsIn: IEEE Computer Society Special Technical Community on Social Networking E-Letter - New York City: IEEE, Vol. 3 (2015), No. 1, Link to fulltext (PDF) Latif, Atif / Scherp, Ansgar / Tochtermann, KlausLOD for Library Science: Benefits of Applying Linked Open Data in the Digital Library SettingIn: KI - Künstliche Intelligenz - Berlin: Springer, ISSN 1610-1987, Vol. 30 (2015), No. 2, pp. 1-9, doi:10.1007/s13218-015-0420-x Link to fulltext (PDF) Latif, Atif / Afzal, Muhammad Tanvir / Tochtermann, Klaus / Raza, Muhammad AsifAutomating Property Binding into Informational Aspects from Linked DataIn: International Journal of Applied Mathematics, Electronics and Computers - Konya: Selcuk University, ISSN 2147-8228, Vol. 2 (2014), No. 4, pp. 31-36, doi:10.18100/ijamec.64584 Link to fulltext (PDF) Latif, Atif / Borst, Timo / Tochtermann, KlausExposing data from an Open Access repository for Economics as Linked DataIn: D-Lib Magazine: The Magazine of Digital Library Research - Reston, VA: Corporation for National Research Initiatives (CNRI), ISSN 1082-9873, Vol. 20 (2014), No. 9/10,, doi:10.1045/september2014-latif Link to fulltext (PDF) Tochtermann, KlausHow Science 2.0 will impact on scientific librariesIn: it-Information Technology - Berlin: De Gruyter, ISSN 2196-7032, Vol. 56 (2014), No. 5, pp. 224-229, doi:10.1515/itit-2014-1050 Link to fulltext (PDF) Tochtermann, KlausDer Leibniz-Forschungsverbund Science 2.0In: Zeitschrift für Bibliothekswesen und Bibliographie (ZfBB) - Frankfurt am Main: Vittorio Klostermann GmbH, ISSN 1864-2950, Vol. 61 (2014), No. 4-5, pp. 260-264, doi:10.3196/18642950146145169 Link to fulltext (PDF) Linek, Stephanie / Schafrick, Anneka / Tochtermann, KlausJust for the image? The impact of Web 2.0 for public institutionsIn: International Journal of Emerging Technologies in Learning (iJET) - Kassel: Kassel University Press, ISSN 1863-0383, Vol. 8 (2013), No. Special Issue: ICL2012, pp. 7-14 Link to fulltext (PDF) Tochtermann, KlausDer Inhalt muss zum Nutzer: Kennzeichen der zukünftigen wissenschaftlichen BibliothekIn: BuB: Forum Bibliothek und Information - Bad Honnef: Bock + Herchen, ISSN 1869-1137, Vol. 65 (2013), No. 2, pp. 115-117 Link to fulltext (PDF) Latif, Atif / Tochtermann, KlausExploring Scientific Publication and Cross Domain Linked Dataset for Similarity - A Case StudyIn: International Journal of Advancements in Computing Technology - Suwon: AICIT, ISSN 2005-8039, Vol. 5 (2013), No. 11, pp. 179-187 Link to fulltext (PDF) Stocker, Alexander / Richter, Alexander / Hoefler, Patrick / Tochtermann, KlausExploring Appropriation of Enterprise Wikis: A Multiple-Case StudyIn: Computer Supported Cooperative Work (CSCW) - Berlin: Springer, ISSN 0925-9724, Vol. 21 (2012), No. 2-3, pp. 317-356, doi:10.1007/s10606-012-9159-1 Link to fulltext (PDF) Latif, Atif / Tochtermann, KlausWebbing Semantified Scholarly Communication Datasets for Improved Resource DiscoveryIn: Journal of Digital Information Management (JDIM) - Chennai: Digital Information Research Foundation, ISSN 0972-7272, Vol. 10 (2012), No. 4, pp. 245-253 Link to fulltext (PDF) Linek, Stephanie B. / Tochtermann, KlausAssessment of usability benchmarks: Combining standardized scales with specific questionsIn: International Journal of Emerging Technologies in Learning (iJET) - Wien: International Association of Online Engineering, ISSN 1863-0383, Vol. 6 (2011), No. 4, pp. 56-64, doi:10.3991/ijet.v6i4.1832 Link to fulltext (PDF) Strohmaier, Markus / Tochtermann, KlausEditorial: Knowledge Processes and Services - Wissensprozesse und -diensteIn: it - Information Technology - München: Oldenbourg, ISSN 1611-2776, Vol. 53 (2011), No. 3, pp. 99-100, doi:10.1524/itit.2011.9069 Link to fulltext (PDF) Granitzer, Michael / Tochtermann, KlausFuture Internet und die BibliotheksweltIn: Zeitschrift für Bibliothekswesen und Bibliographie (ZfBB) - Frankfurt, M.: Klostermann, ISSN 0044-2380, Vol. 58 (2011), No. 6, pp. 324-328, doi",
  "content_length": 36932,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:31"
}