{
  "name": "Klaus Mueller 0001",
  "homepage": "http://www3.cs.stonybrook.edu/~mueller",
  "status": "success",
  "content": "Klaus Mueller's homepage Home Projects People Publications Teaching Bio Play B-Board Klaus Mueller Professor Director, Visual Analytics and Imaging (VAI) Lab Liaison, SUNY Korea CS Program Interim Chair, Department of Tech and Society Center for Visual Computing Computer Science Department Stony Brook University - State University of New York Contact: mueller@cs.stonybrook.edu Quick Bio I received a PhD in computer science from The Ohio State University in 1998. I am currently a professor in the Computer Science Department at Stony Brook University and I am also a senior scientist at the Computational Science Initiative at Brookhaven National Lab. I currently serve as the acting chair of the Department of Tech and Society. From 2012-2015, I served as the founding chair of the Computer Science Department at SUNY Korea and I was also VP for Academic Affairs and Finance at SUNY Korea for two years. My current main research interests are visual analytics, explainable AI, machine learning and data science, human-centered responsible AI, fairness, belief modeling and personalized communication, virtual and augmented reality and computational and medical imaging. I won the US National Science Foundation Early Career award in 2001, the SUNY Chancellor Award for Excellence in Scholarship and Creative Activity in 2011, and the Meritorious Service Certificate and the Golden Core Award of the IEEE Computer Society in 2016. In 2018 I was inducted into the US National Academy of Inventors. To date, I have authored more than 300 peer-reviewed journal and conference papers, which have been cited more than 15,000 times. I am a frequent speaker at international conferences, have organized or participated in 18 tutorials on various topics, chaired the IEEE Visualization Conference in 2009, was the elected chair of the IEEE Technical Committee on Visualization and Computer Graphics (VGTC) from 2012-2015, and served as the Editor-in-Chief of IEEE Transactions on Visualization and Computer Graphics from 2019-2022. I am a Fellow of the IEEE. (Please see here for a bio in the third person). Research Interests Visual analytics -- Visualization, visual data science, visual storytelling, explainable AI, infovis, HCI Human-centered responsible AI -- Fairness, bias, belief modeling, and personalized communication Computational imaging -- Computed tomography, low-dose, GAN-synthesis, GPU-acceleration Volume visualization -- Medical and scientific visualization, multivalued data w/geo-reference Virtual reality -- Virtual, augmented, mixed reality, display walls, immersive visualization Cognitive computer graphics -- Color, texture, details, points, perception, cognition, semiotics Filters and grids -- Sampling, hexagonal amd body-centerered lattices, extensions to N-D Eyetracking -- Visualization for eye tracking data, acquisition, applications Natural phenomena -- Simulation, urban security applications,GPU-acceleration Face recognition (this is no longer an active research topic) All my publications via Google Scholar Recent Developments Stars of CSE 564 Spring 2025: Check out this playlist for videos of the best projects of this year's grad visualization course Five accepted papers at IEEE VIS 2025!! MisVisFix: An Interactive Dashboard for Detecting, Explaining, and Correcting Misleading Visualizations using Large Language Models with Amit Kumar Das What is the Color of Serendipity? Investigating the Use of Language Models for Semantically Resonant Color Generation with Shahreen Salim and Tanzir Pial Charts-of-Thought: Enhancing LLM Visualization Literacy Through Structured Data Extraction with Amit Kumar Das and Mohammad Tarun Semantic Pathway: An Interactive Visualization of Hidden States and Token Influence in LLMs with Mithilesh Singh XplainAct: Visualization for Personalized Intervention Insights with Yanming Zhang and Krishnakumar Hegde Two recently accepted papers in IEEE Transactions on Visualization and Computer Graphics (TVCG) CausalChat: Interactive Causal Model Development and Refinement Using Large Language Models with Yanming Zhang, Akshith Kotha, and Eric Papenhausen Into the Void: Mapping the Unseen Gaps in High Dimensional Data with Xinyu Zhang, Tyler Estro, Geoff Kuenning. and Erez Zadok Three recent papers in human-centered responsible AI: fairness, belief modeling, and personalized communication ACM CHI 2025: Leveraging Large Language Models for Personalized Public Messaging with Amit Kumar Das and Cindy Xiong Bearfield ACM CSCW 2025: FairPlay: A Collaborative Approach to Mitigate Bias in Datasets for Improved AI Fairness with Tina Behzad, Mithilesh Singh, and Anthony Ripa ACM CSCW 2024: Belief Miner: A Methodology for Discovering Causal Beliefs and Causal Illusions from General Populations with Shahreen Salim and Naimul Hoque Teaching Portfolio CSE 332 Introduction to Visualization (undergraduate level) CSE 591 GPU Programming (Special Topics course) CSE 377 Introduction to Medical Imaging (undergraduate level) CSE 577 Medical Imaging (graduate level) CSE 323 Human Computer Interaction (co-taught at graduate level) CSE 523 Master's Projects (continued as CSE 524) CSE 564 Visualization and Visual Analytics (graduate level) CSE 648 Visual Analytics Seminar (every semester) CSE 590 Data Science Fundamentals (graduate level) More... Complete set of courses Also known as Klaus Müller (German spelling) http://www3.cs.stonybrook.edu/~mueller",
  "content_length": 5429,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:23"
}