{
  "name": "Klaus Meyer-Wegener",
  "homepage": "https://www.cs6.tf.fau.de/lehrstuhl/personen/klaus-meyer-wegener",
  "status": "success",
  "content": "Klaus Meyer-Wegener - Lehrstuhl für Informatik 6 Organisationsmenü öffnen Organisationsmenü schließen Friedrich-Alexander-Universität Lehrstuhl für Informatik 6 CS6 Lehrstuhl für Informatik 6Datenmanagement Adresse Martensstraße 391058 Erlangen Zimmer: 08.135, Geschoss: 08 Kontakt E-Mail: klaus.meyer-wegener@fau.de Telefon: +49 9131 85 – 27892 Vorzimmer Cécile Astor Teamassistenz/Sekretariat E-Mail: cs6-office@fau.deE-Mail: cecile.astor@fau.de Telefon: +49 9131 85 – 27893 Weitere E-Mail-Adressen:kmw@acm.orgK.Meyer-Wegener@computer.orgE-Mail-Adressen für private Angelegenheiten:Klaus.Meyer-Wegener@gmx.deklaus.meyer-wegener@freenet.de Von Oktober 2001 bis Mai 2020 leitete Prof. Meyer-Wegener den Lehrstuhl für Informatik 6 (Datenmanagement). Seit Oktober 2022 ist er im Ruhestand. Vorher war er an der TU Dresden. Projekte, die er dort durchgeführt hat, finden sich hier. Forschungsschwerpunkte Multimedia-Datenbanken Dokument- and Prozessverwaltung (Workflow Management) Datenstromsysteme Datenmanagement für (Big-Data-) Analyse Publikationen Lokale Publikationsliste (CRIS) 2025 Hahn T., Langohr M., Becher A., Beena Gopalakrishnan Nair L., Meyer-Wegener K., Teich J., Wildermann S.:ReProVide: Query Optimization and Near-Data Processing on Reconfigurable SoCs for Big Data AnalysisIn: Scalable Data Management for Future Hardware, 2025, S. 171-197ISBN: 9783031740961DOI: 10.1007/978-3-031-74097-8_7BibTeX: Download Hahn T., Langohr M., Meißner S., Döring B., Wildermann S., Meyer-Wegener K., Teich J.:ReProVide: Query Optimisation and Near-Data Processing on Reconfigurable SoCs for Big Data Analysis21st Conference on Database Systems for Business, Technology and Web (Bamberg, 3. März 2025 – 7. März 2025)In: Proceedings of the 21st Conference on Database Systems for Business, Technology and Web 2025DOI: 10.18420/BTW2025-57BibTeX: Download Sigl M., Meyer-Wegener K.:Towards Learning to Rank Deep-Learning Models for Multivariate Time-Series Transfer Learning9th Workshop on Data Management for End-to-End Machine Learning, DEEM 2025 – In conjunction with the 2025 ACM SIGMOD/PODS Conference (Berlin, 22. Juni 2025 – 27. Juni 2025)In: DEEM ’25: Proceedings of the Workshop on Data Management for End-to-End Machine Learning, New York, NY: 2025DOI: 10.1145/3735654.3735938BibTeX: Download 2023 Langohr M., Vogler T., Meyer-Wegener K.:SKYSHARK: A Benchmark with Real-world Data for Line-rate Stream Processing with FPGAsLernen, Wissen, Daten, Analysen (LWDA) (Marburg, 9. Oktober 2023 – 11. Oktober 2023)In: Leyer M, Wichmann J (Hrsg.): Lernen, Wissen, Daten, Analysen (LWDA) Conference Proceedings, Marburg, Germany, October 9-11, 2023 2023Open Access: https://ceur-ws.org/Vol-3630/LWDA2023-paper9.pdfURL: https://ceur-ws.org/Vol-3630/LWDA2023-paper9.pdfBibTeX: Download Rückert C., Meyer-Wegener K., Safferling C., Freiling F.:Messengerdienst-Nachrichten als Beweismittel im Strafverfahren – am Beispiel der Auswertung von WhatsApp-ChatsIn: Juristische Rundschau 2023 (2023), S. 366-378ISSN: 0022-6920DOI: 10.1515/juru-2023-2051BibTeX: Download 2022 Benenson Z., Freiling F., Meyer-Wegener K.:Soziotechnische Einflussfaktoren auf die „digitale Souveränität“ des IndividuumsIn: Glasze, Georg; Odzuck; Eva; Staples, Ronald (Hrsg.): Was heißt digitale Souveränität? Diskurse, Praktiken und Voraussetzungen „individueller“ und „staatlicher Souveränität“ im digitalen Zeitalter, Bielefeld: transcript Verlag, 2022, S. 61 – 87 (Politik in der digitalen Gesellschaft)ISBN: 978-3-8376-5827-9DOI: 10.14361/9783839458273BibTeX: Download 2021 Beena Gopalakrishnan Nair L., Becher A., Wildermann S., Meyer-Wegener K., Teich J.:Speculative Dynamic Reconfiguration and Table Prefetching Using Query Look-Ahead in the ReProVide Near-Data-Processing SystemIn: Datenbank-Spektrum (2021)ISSN: 1618-2162DOI: 10.1007/s13222-020-00363-7URL: https://rd.springer.com/article/10.1007/s13222-020-00363-7BibTeX: Download Beena Gopalakrishnan Nair L., Meyer-Wegener K.:COPRAO: A Capability Aware Query Optimizer for reconfigurable Near Data ProcessorsJoint International Workshop on Big Data Management on Emerging Hardware and Data Management on Virtualized Active Systems held in Conjunction with ICDE 2021 (Chania, Crete, Greece, 19. April 2021 – 19. April 2021)In: Proc. 37th IEEE International Conference on Data Engineering Workshops, ICDE Workshops 2021, Chania, Greece, April 19-22, 2021 2021DOI: 10.1109/ICDEW53142.2021.00017URL: http://db.ict.ac.cn/HardBD-Active-2021/papers/HardBDActive21-1.pdfBibTeX: Download Schwab P., Röckl J., Langohr M., Meyer-Wegener K.:Performance Evaluation of Policy-Based SQL Query Classification for Data-Privacy ComplianceIn: Datenbank-Spektrum (2021)ISSN: 1618-2162DOI: 10.1007/s13222-021-00385-9URL: https://link.springer.com/article/10.1007/s13222-021-00385-9BibTeX: Download 2020 Beena Gopalakrishnan Nair L., Becher A., Meyer-Wegener K.:The ReProVide Query-Sequence Optimization in a Hardware-Accelerated DBMS16th International Workshop on Data Management on New Hardware Held with ACM SIGMOD/PODS 2020 (Portland, Oregon USA, 15. Juni 2020 – 15. Juni 2020)In: DaMoN ’20: Proceedings of the 16th International Workshop on Data Management on New Hardware 2020DOI: 10.1145/3399666.3399926BibTeX: Download Beena Gopalakrishnan Nair L., Becher A., Meyer-Wegener K., Wildermann S., Teich J.:SQL Query Processing Using an Integrated FPGA-based Near-Data Accelerator in ReProVide23rd International Conference on Extending Database Technology (Copenhagen, 30. März 2020 – 2. April 2020)In: Proceedings of EDBT 2020BibTeX: Download Ripperger S., Carter G., Page R., Duda N., Kölpin A., Weigel R., Hartmann M., Nowak T., Thielecke J., Schadhauser M., Robert J., Herbst S., Meyer-Wegener K., Wägemann P., Schröder-Preikschat W., Cassens B., Dressler F., Mayer F., Kapitza R.:Thinking small: next-generation sensor networks close the size gap in vertebrate biologgingIn: Plos Biology (2020)ISSN: 1544-9173DOI: 10.1371/journal.pbio.3000655BibTeX: Download Schwab P., Langohr M., Meyer-Wegener K.:A Framework for DSL-Based Query Classification Using Relational and Graph-Based Data Models3rd Joint International Workshop on Graph Data Management Experiences & Systems (GRADES) and Network Data Analytics (NDA) (Portland, OR, 14. Juni 2020 – 14. Juni 2020)In: ACM (Hrsg.): GRADES-NDA’20: Proceedings of the 3rd Joint International Workshop on Graph Data Management Experiences & Systems (GRADES) and Network Data Analytics (NDA) 2020DOI: 10.1145/3398682.3399167URL: https://dl.acm.org/doi/abs/10.1145/3398682.3399167BibTeX: Download Schwab P., Langohr M., Meyer-Wegener K.:We Know What You Did Last Session: Policy-Based Query Classification for Data-Privacy Compliance With the DataEconomistSSDBM 2020: 32nd International Conference on Scientific and Statistical Database Management (Vienna, Virtual Conference, 7. Juli 2020 – 9. Juli 2020)DOI: 10.1145/3400903.3401692BibTeX: Download Schwab P., Meyer-Wegener K.:Towards Evolutionary, Domain-Specific Query Classification Based on Policy RulesLernen, Wissen, Daten, Analysen (LWDA) 2020 (Online, 9. September 2020 – 11. November 2020)In: Daniel Trabold, Pascal Welke, Nico Piatkowski (Hrsg.): Proceedings of the Conference „Lernen, Wissen, Daten, Analysen“ 2020URL: http://ceur-ws.org/Vol-2738/LWDA2020_paper_18.pdfBibTeX: Download Vöhringer D., Meyer-Wegener K.:Future Fetch: Towards a ticket-based data access for secondary storage in database systemsLernen, Wissen, Daten, Analysen 2020 (LWDA 2020) (Virtual, Online, 9. September 2020 – 11. September 2020)In: Daniel Trabold, Pascal Welke, Nico Piatkowski (Hrsg.): Proceedings of the Conference „Lernen, Wissen, Daten, Analysen“ 2020URL: https://ceur-ws.org/Vol-2738/LWDA2020_paper_2.pdfBibTeX: Download 2019 Matschinske JO.:Query-Driven Enforcement of Rule-Based Policies for Data-Privacy ComplianceLernen, Wissen, Daten, Analysen (LWDA) 2019 (Berlin, Germany, 30. September 2019 – 2. Oktober 2019)In: Robert Jäschke, Matthias Weidlich (Hrsg.): Proc. Conf. „Lernen, Wissen, Daten, Analysen“ 2019Open Access: http://ceur-ws.org/Vol-2454/paper_56.pdfURL: http://ceur-ws.org/Vol-2454/paper_56.pdfBibTeX: Download Meyer-Wegener K.:Wie funktioniert die Blockchain?In: Datenbank-Spektrum 19 (2019), S. 67-71ISSN: 1618-2162DOI: 10.1007/s13222-019-00311-0BibTeX: Download Schwab P., Langohr M., Röckl J., Vöhringer D., Wahl AM., Meyer-Wegener K.:Query-Driven Enforcement of Rule-Based Policies for Data-Privacy ComplianceLWDA 2019 Lernen, Wissen, Daten, Analysen (Berlin, Germany, 30. September 2019 – 2. Oktober 2019)In: Proc. Conf. „Lernen, Wissen, Daten, Analysen“ 2019Open Access: http://ceur-ws.org/Vol-2454/paper_56.pdfURL: http://ceur-ws.org/Vol-2454/paper_56.pdfBibTeX: Download Schwab P., Wahl AM., Matschinske JO., Meyer-Wegener K.:Query-Driven Data Minimization with the DataEconomistAdvances in Database Technology – 22nd International Conference on Extending Database Technology (EDBT 2019) (Lisbon, Portugal, 26. März 2019 – 29. März 2019)In: OpenProceedings.org 2019, 78457 Konstanz, Germany: 2019DOI: 10.5441/002/edbt.2019.69URL: https://openproceedings.org/2019/conf/edbt/EDBT19_paper_365.pdfBibTeX: Download 2018 Becher A., Beena Gopalakrishnan Nair L., Broneske D., Drewes T., Gurumurthy B., Meyer-Wegener K., Pionteck T., Saake G., Teich J., Wildermann S.:Integration of FPGAs in Database Management Systems: Challenges and OpportunitiesIn: Datenbank-Spektrum (2018)ISSN: 1618-2162DOI: 10.1007/s13222-018-0294-9BibTeX: Download Duda N., Nowak T., Hartmann M., Schadhauser M., Cassens B., Wägemann P., Nabeel M., Ripperger S., Herbst S., Meyer-Wegener K., Mayer F., Dressler F., Schröder-Preikschat W., Kapitza R., Robert J., Thielecke J., Weigel R., Kölpin A.:BATS: Adaptive Ultra Low Power Sensor Network for Animal TrackingIn: Sensors (2018)ISSN: 1424-8220DOI: 10.3390/s18103343BibTeX: Download 2017 Balke S., Hiemer M., Schwab P., Arifi-Müller V., Meyer-Wegener K., Müller M.:Die Oper als Multimedia Szenario: Wagners Walküren gehen onlineIn: Proceedings of the GI",
  "content_length": 44701,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:28"
}