{
  "name": "Klaus D. McDonald-Maier",
  "homepage": "https://www.essex.ac.uk/people/mcdon01907/klaus-mcdonald-maier",
  "status": "success",
  "content": "Klaus McDonald-Maier | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Klaus McDonald-Maier People Professor Klaus McDonald-Maier Professor School of Computer Science and Electronic Engineering (CSEE) Email kdm@essex.ac.uk Location 1NW.4.22, Colchester Campus Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Klaus McDonald-Maier is a Professor in the School of Computer Science and Electronic Engineering (CSEE) at the University of Essex where he leads the Embedded and Intelligent Systems (EIS) Research Laboratory, heads the Intelligent Embedded Systems and Environments Research Group and is Director of Impact. He is also the co-founder and the Chief Scientist of UltraSoC Technologies Ltd (a Venture Capital backed semiconductor startup company) and the co-founder and CEO of Metrarc Limited (a startup company commercialising cybersecurity research outcomes). Klaus McDonald-Maier studied Electronic Engineering at the University of Ulm (Germany), Cardiff University (Wales), and the École Supérieur de Chimie Physique Électronique de Lyon (CPE-Lyon, France). He completed his doctorate at the Friedrich-Schiller-University Jena (Germany) in 1999, in the area of high performance parallel Neural Network computer architectures and neural networks based control of legged robots. Following this he worked on Systems-on-Chip (SoC) at Infineon Technologies AG (formerly Siemens Semiconductors), Munich (Germany), where he was a Systems Architect for SoC platform based reusable microprocessor cores and peripheral modules as well as debug support for industrial control SoC platforms, used as the standard controller core in many automotive industrial and embedded SoCs. In 2001 he returned to academia and led significant research endeavours in the area of embedded systems, computer architecture, Systems-on-Chip and their application in robotics and intelligent systems. Initially he joined the University of Kent as Lecturer in Digital Systems, then moved to the University of Essex, as Reader in 2005, and was promoted to Professor of Embedded and Intelligent Systems in 2008. He has held visiting Professor positions at INRIA Nord and ESIGELEC. Since 2013 he is a Visiting Research Affiliate at the Advanced Robotics Group of the NASA Jet Propulsion Laboratory (JPL), California Institute of Technology (Caltech) and a Visiting Professor at the University of Kent. Research and professional activities Research interests Embedded Systems and System-on-Chip (SoC) design, development support and technology to increase performance and reliability Key words: Embedded Systems Open to supervise Advanced computer architectures offering vast processing power for robotics, image processing and other real-time critical applications Key words: computer architecture Open to supervise Application of AI for real world problems and robot control Key words: emerging technologies Open to supervise Cybersecurity Key words: ICMetrics Open to supervise Teaching and supervision Current supervision Ludovico Poli Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Xuqi Zhu Degree subject: Computer Science Degree type: Doctor of Philosophy Thanh Dat Ngo Thesis title: Novel Low-Cost and Artificial Intelligence Driven Audio Signal Processing for Respiratory Monitoring and Rehabilitation Degree subject: Computer Science Degree type: Doctor of Philosophy Huaizhi Zhang Degree subject: Computer Science Degree type: Doctor of Philosophy Tamim Degree subject: Computer Science Degree type: Doctor of Philosophy Shengyang Huang Degree subject: Computer Science Degree type: Doctor of Philosophy Nelson Tito Kimaro Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Michal Borowski Thesis title: Non-Intrusive Hardware-Enhanced Anomaly Detection Systems for Embedded Devices Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 6/10/2025 Bruno Rafael Queiros Arcanjo Thesis title: Efficient Visual Place Recognition in Changing Environments for Resource-Constrained Platforms Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 8/1/2025 Maria Waheed Thesis title: Complementarity-Based Visual Place Recognition in Changing Environments Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 23/9/2024 Issam Mohamed Amine Boukhennoufa Thesis title: Wearable Sensor-Based Rehabilitation Exercise Assessment for Post-Stroke Rehabilitation Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 26/3/2024 Mihnea-Alexandru Tomita Thesis title: Visual Place Recognition in Changing Environments Utilising Sequence-Based Filtering and Extremely Jpeg Compressed Images Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 22/9/2023 Bruno Ferrarini Thesis title: Improving Visual Place Recognition in Changing Environments Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 21/8/2023 Yucheng Wang Thesis title: Dna Methylation Analysis and Age Prediction Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 30/6/2023 Somdip Dey Thesis title: Novel Dvfs Methodologies for Power-Efficient Mobile Mpsoc Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 10/5/2023 Yufan Lu Thesis title: Adaptive Intelligent Systems for Extreme Environments Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 12/4/2023 Rose Elizabeth Power Thesis title: A Benchmark Comparison of Visual Place Recognition Techniques for Resource-Constrained Embedded Platforms Degree subject: Computer Science Degree type: Master of Science (by Dissertation) Awarded date: 20/3/2023 Saad Sajid Minhas Thesis title: Synthetic Worlds for Improving Driver Assistance Systems Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 8/12/2022 Zeba Khanam Thesis title: Coverage Path Planning for Autonomous Robots Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 16/9/2022 Mubariz Zaffar Thesis title: Visual Place Recognition for Autonomous Robots Degree subject: Computing and Electronic Systems Degree type: Master of Science (by Dissertation) Awarded date: 3/11/2020 Anca Sticlaru Thesis title: A Comprehensive Analysis of Straight Line Detection Techniques Using a Novel Noise Dataset Degree subject: Computer Science Degree type: Master of Science (by Dissertation) Awarded date: 19/3/2020 Ahmad Khaliq Thesis title: Visual Place Recognition Under Severe Viewpoint and Appearance Changes Degree subject: Computing and Electronic Systems Degree type: Master of Science (by Dissertation) Awarded date: 14/1/2020 Grigorios Kalliatakis Thesis title: Visual Recognition of Human Rights Violations Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 21/11/2019 Ruhma Tahir Thesis title: An Icmetric Based Framework for Secure End-To-End Communication Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 28/6/2018 Khattab M Ali Thesis title: An Intelligent Intrusion Detection System for External Communications in Autonomous Vehicles Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 1/12/2017 Hasan Tahir Thesis title: An Icmetric Based Multiparty Communication Framework Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 7/7/2017 Bruno Ferrarini Thesis title: An Approach to Automatic Selection of the Optimal Local Feature Detector Degree subject: Computing and Electronic Systems Degree type: Master of Science (by Dissertation) Awarded date: 23/12/2016 Shoaib Ehsan Thesis title: Improving the Effectiveness of Local Feature Detection Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 15/5/2012 Publications Publications (15) Arcanjo, B., Ferrarini, B., Milford, M., McDonald-Maier, KD. and Ehsan, S., (2024). Multi-Technique Sequential Information Consistency For Dynamic Visual Place Recognition In Changing Environments Zhu, X., Zhang, H., Lee, J., Zhu, J., Pal, C., Saha, S., McDonald-Maier, KD. and Zhai, X., (2024). Fast, Scalable, Energy-Efficient Non-element-wise Matrix Multiplication on FPGA Waheed, M., Milford, M., Zhai, X., Fasli, M., McDonald-Maier, K. and Ehsan, S., (2024). Employing Universal Voting Schemes for Improved Visual Place Recognition Performance Tomita, M-A., Ferrarini, B., Milford, M., McDonald-Maier, K. and Ehsan, S., (2023). Visual Place Recognition with Low-Resolution Images Arcanjo, B., Ferrarini, B., Milford, M., McDonald-Maier, KD. and Ehsan, S., (2023). Patch-DrosoNet: Classifying Image Partitions With Fly-Inspired Models For Lightweight Visual Place Recognition Tomita, M-A., Ferrarini",
  "content_length": 85124,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:17"
}