{
  "name": "Klaus Reinhardt",
  "homepage": "https://www.informatik.uni-halle.de/mitarbeiter/prof._klaus_reinhardt",
  "status": "success",
  "content": "Dr. habil. Klaus Reinhardt Aktuelle Sprache: Deutsch Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zu weiteren Einstellungen Themennavigation Studium Forschung Weiterbildung Karriere Presse International Hauptnavigation Die Universität Fakultäten Naturwissenschaftliche Fakultät III - Agrar- und Ernährungswissenschaften, Geowissenschaften und Informatik Institut für Informatik Arbeitsgruppen am Institut Theoretische Informatik Mitarbeiter Dr. habil. Klaus Reinhardt Publikationen International Office Zentrale Einrichtungen Graduierten-Akademie Wissenschaftliche Zentren An-Institute Universitätsklinikum Links Dr. habil. Klaus Reinhardt Theoretische Informatik Kontakt Dr. habil. Klaus Reinhardt Telefon: +49 345 5524770 Telefax: +49 345 5527009 klaus.reinhardt@informatik.... Raum 2.21 Martin-Luther-Universität Halle-Wittenberg Institut für Informatik Von-Seckendorff-Platz 1 06120 Halle Weiteres Schrift: größer , kleiner Login für Redakteure Dr. habil. Klaus Reinhardt Foto Klaus Reinhardt Short Bio February 2005, Habilitation in Computer Science, University of Tübingen Thesis: Counting as Method, Model and Task in Theoretical Computer Science Colloquium: February 16, 2005 _______ July 1994, PhD in Computer Science (Dr.rer.nat), University of Stuttgart Thesis: Priority-multicounter-automata and the synchronization of semitrace-languages [Rei94b] Date of defence: July 7, 1994 Supervisor: Prof. Dr. V. Diekert _______ October 1984 - September 1989, Computer science studies, University of Stuttgart with Linguistics and Mathematics as subsidiary subjects October 1986, Vordiplom (B.S. degree) in Computer Science' September 1989, Diploma (MSc) in Computer Science, University of Stuttgart. Thesis: Hierarchies with alternating pushdown-automata, alternating grammars and finite transducers' _______ September 1974 - June 1983, Highschool: Wilhelmsgymnasium    in Stuttgart June 1983, Abitur (university-entrance diploma) Awards Best paper award in track B of ICALP 2012 [DKRW12] National Mathematics Competition, Germany  (Bundeswettbewerb Mathematik), 1982: First price in the first round, Third price in the second round. Inaugural Lecture on 28 January 2016 Shortest Paths [ mehr ... ] Zum Seitenanfang Fußnavigation Startseite, Datenschutz, Disclaimer, Impressum, Letzte Aktualisierung: 01.05.2020 Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zum Seitenanfang",
  "content_length": 2504,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:23"
}