{
  "name": "Klaus Schöffmann",
  "homepage": "https://klausschoeffmann.com",
  "status": "success",
  "content": "Assoc. Prof. Dr. Klaus Schöffmann Skip to content Position Associate ProfessorInstitute of Information Technology (ITEC)Klagenfurt University (Austria) ORCID: 0000-0002-9218-1704 Research Interests: Medical Video Analysis Video Retrieval Computer Vision Deep Learning Research Profiles Google Scholar Profile Scopus Author Profile ACM Author Profile IEEE Author Profile ResearchGate Profile Semantic Scholar Profile dblp Short Bio Dr. Klaus Schoeffmann is an Associate Professor at the Institute of Information Technology (ITEC), Klagenfurt University, Austria, where he received his habilitation (venia docendi) in Computer Science in 2015. He holds both a PhD and an MSc in Computer Science. His research focuses on video content understanding, deep learning, computer vision, multimedia retrieval, and interactive multimedia, with a particular emphasis on applications in the medical domain — especially post-operative surgical video analysis.Prof. Schoeffmann has secured more than €2M in research funding from the Austrian Science Fund (FWF), the Carinthian Economic Promotion Fund (KWF), and industrial partners. He has supervised six PhD candidates and numerous Master’s theses. His research output has received over 4,500 citations, resulting in a Google Scholar H-index of 36. He is the founder and co-organizer of the annual Video Browser Showdown (VBS) and the Lifelog Search Challenge (LSC).He is a member of IEEE and ACM, and serves as a regular reviewer for leading international conferences and journals in multimedia and medical imaging. He has also taken on prominent organizational roles, including program co-chair of ACMMM Asia 2025, MMM 2021, CBMI 2021, ACM ICMR 2020, MMM 2018, and CBMI 2013; demo/video co-chair of ACMMM 2020; open-source software competition chair of ACMMM 2019; and general co-chair of ACMMM 2025, CBMI 2025, ACM ICMR 2024, and MMM 2012.At Klagenfurt University, he teaches a range of computer science courses, including computer vision with deep learning, multimedia technologies, and app development. Scroll Up Top Assoc. Prof. Dr. Klaus Schoeffmann",
  "content_length": 2093,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:26"
}