{
  "name": "Klaus Ostermann",
  "homepage": "https://ps.cs.uni-tuebingen.de/team/ostermann",
  "status": "success",
  "content": "Universität Tübingen - Prof. Dr. Klaus Ostermann Prof. Dr. Klaus Ostermann Klaus Ostermann Universität Tübingen WSI - Programmiersprachen Sand 13 72076 Tübingen Germany Telephone+49 - (0) 70 71 - 29 - 75457 Telefax+49 - (0) 70 71 - 29 - 50 82 E-Mailklaus.ostermann(at)uni-tuebingen.de OfficeB217/218 Office hoursby appointment Publications on Google Scholar If you want to apply for an internship, PhD position etc., please read this. If you want to do a thesis (Bsc, Msc, BEd, MEd etc.) in our group, please read this. If you want to communicate with me securely, you can find my PGP key here. Recent Community Service POPL 2026(PC), GPCE2025 (PC), ICFP 2025 (PC), POPL 2023 (PC), OOPSLA 2023 (PC), ECOOP 2022 (PC), FLOPS 2022 (PC), OOPSLA 2021 (PC), GPCE 2021 (PC), PLDI 2020 (PC), ECOOP 2020 (PC), ICFP 2019 (PC), POPL 2018 (PC), PLDI 2018 (EPC), ASE 2018 (PC), Scala 2018 (PC) Past involvements can be found here. I'm a member of IFIP WG 2.16 and 2.11 Research Interests Functional Programming Languages Design and Implementation of Programming Languages Types and Modules Software Development Tools Progam Analysis and Transformation Software Architecture und Patterns Object-Oriented Programming Publications Compiling Classical Sequent Calculus to Stock Hardware: The Duality of Compilation by Philipp Schuster, Marius Müller, Klaus Ostermann, and Jonathan Immanuel Brachthäuser In Proc. Int’l Conf. Object-Oriented Programming, Systems, Languages and Applications (OOPSLA). ACM Press, 2025. Learn More Grokking the Sequent Calculus (Functional Pearl) by David Binder, Marco Tzschentke, Marius Müller, and Klaus Ostermann In Proc. Int’l Conf. Functional Programming (ICFP). ACM Press, 2024. Learn More Back to Direct Style: Typed and Tight by Marius Müller, Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann In Proc. Int’l Conf. Object-Oriented Programming, Systems, Languages and Applications (OOPSLA). ACM Press, 2023. Learn More From Capabilities to Regions: Enabling Efficient Compilation of Lexical Effect Handlers by Marius Müller, Philipp Schuster, Jonathan Lindegaard Starup, Klaus Ostermann, and Jonathan Immanuel Brachthäuser In Proc. Int’l Conf. Object-Oriented Programming, Systems, Languages and Applications (OOPSLA). ACM Press, 2023. Learn More A Typed Continuation-Passing Translation for Lexical Effect Handlers by Philipp Schuster, Jonathan Immanuel Brachthäuser, Marius Müller, and Klaus Ostermann In Proc. Conf. Programming Language Design and Implementation (PLDI), 2022. Learn More All About That Stack: A Unified Treatment of Regions and Control Effects by Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann Technical report. University of Tübingen, Germany, 2021. Learn More Decomposition Diversity with Symmetric Data and Codata by Klaus Ostermann, Julian Jabs, David Binder, and Ingo Skupin In Proceedings of Symposium on Principles of Programming Languages (POPL 2020), 2020. Learn More Effekt: Capability-Passing Style for Type- and Effect-Safe, Extensible Effect Handlers in Scala by Jonathan Immanuel Brachthäuser, Philipp Schuster, and Klaus Ostermann In Journal of Functional Programming 30: , 2020. Learn More Compiling Effect Handlers in Capability-Passing Style by Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann In Proc. Int’l Conf. Functional Programming (ICFP). ACM Press, 2020. Learn More Effekt: Lightweight Effect Polymorphism for Handlers (Technical Report) by Jonathan Immanuel Brachthäuser, Philipp Schuster, and Klaus Ostermann Technical report. University of Tübingen, Germany, 2020. Learn More Effects as Capabilities: Effect Handlers and Lightweight Effect Polymorphism by Jonathan Immanuel Brachthäuser, Philipp Schuster, and Klaus Ostermann In Proc. Int’l Conf. Object-Oriented Programming, Systems, Languages and Applications (OOPSLA). ACM Press, 2020. Learn More Zero-cost Effect Handlers by Staging (Technical Report) by Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann Technical report. University of Tübingen, Germany, 2019. Learn More Effect Handlers for the Masses by Jonathan Brachthäuser, Philipp Schuster, and Klaus Ostermann In Proc. Int’l Conf. Object-Oriented Programming, Systems, Languages and Applications (OOPSLA). ACM Press, 2018. Learn More Dualizing Generalized Algebraic Data Types by Matrix Transposition by Klaus Ostermann and Julian Jabs In Proc. Europ. Symposium on Programming (ESOP). Lecture Notes in Computer Science, 2018. Learn More System F-Omega with Equirecursive Types for Datatype-Generic Programming by Yufei Cai, Paolo G. Giarrusso, and Klaus Ostermann In Proceedings of Symposium on Principles of Programming Languages (POPL 2016), pages 30–43, 2016. Learn More Parsing with First-Class Derivatives by Jonathan Brachthäuser, Tillmann Rendel, and Klaus Ostermann In Proc. Int’l Conf. Object-Oriented Programming, Systems, Languages and Applications (OOPSLA). ACM Press, 2016. Learn More Automatic Refunctionalization to a Language with Copattern Matching: With Applications to the Expression Problem by Tillmann Rendel, Julia Trieflinger, and Klaus Ostermann In Proceedings of International Conference on Functional Programming, pages 269–279. ACM, 2015. Learn More A Theory of Changes for Higher-Order Languages — Incrementalizing λ-Calculi by Static Differentiation by Yufei Cai, Paolo G. Giarrusso, Tillmann Rendel, and Klaus Ostermann In Proceedings of the 35th ACM SIGPLAN Conference on Programming Language Design and Implementation, 2014. Learn More Evolution of Software Systems with Extensible Languages and DSLs by Sebastian Erdweg, Stefan Fehrenbach, and Klaus Ostermann In IEEE Software 31(5): , 2014. Learn More Variability Mining: Consistent Semi-automatic Detection of Product-Line Features by Christian Kästner, Alexander Dreiling, and Klaus Ostermann In IEEE Trans. Software Eng. 40(1): , 2014. Learn More Projectional editing of variational software by Eric Walkingshaw and Klaus Ostermann In Generative Programming: Concepts and Experiences, GPCE’14, Vasteras, Sweden, September 15-16, 2014, pages 29–38, 2014. Learn More Layout-sensitive Generalized Parsing by Sebastian Erdweg, Tillmann Rendel, Christian Kästner, and Klaus Ostermann In Proceedings of Conference on Software Language Engineering (SLE). Springer-Verlag, 2013. Learn More Reify Your Collection Queries for Modularity and Speed! by Paolo G. Giarrusso, Klaus Ostermann, Michael Eichberg, Ralf Mitschke, Tillmann Rendel, and Christian Kästner In Proc. Int’l Conf. Aspect-Oriented Software Development (AOSD), pages 1–12. ACM, 2013. Learn More Variability Mining: Consistent Semiautomatic Detection of Product-Line Features by Christian Kästner, Alexander Dreiling, and Klaus Ostermann In IEEE Transactions on Software Engineering, 2013. Learn More Software Evolution to Domain-Specific Languages by Stefan Fehrenbach, Sebastian Erdweg, and Klaus Ostermann In Proceedings of Conference on Software Language Engineering (SLE), 2013. Learn More Layout-sensitive Language Extensibility with SugarHaskell by Sebastian Erdweg, Felix Rieger, Tillmann Rendel, and Klaus Ostermann In Proceedings of Haskell Symposium. ACM Press, 2012. Learn More A Variability-Aware Module System by Christian Kästner, Klaus Ostermann, and Sebastian Erdweg Technical report 01/2012. Department of Mathematics and Computer Science, Philipps University Marburg, 2012. Learn More A Variability-Aware Module System by Christian Kästner, Klaus Ostermann, and Sebastian Erdweg In Proceedings of the 27th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA). ACM Press, 2012. Learn More Toward Variability-Aware Testing by Christian Kästner, Alexander von Rhein, Sebastian Erdweg, Jonas Pusch, Sven Apel, Tillmann Rendel, and Klaus Ostermann In Proceedings of the Fourth Workshop on Feature-Oriented Software Development (FOSD), 2012. Learn More Partial Preprocessing C Code for Variability Analysis by Christian Kästner, Paolo G. Giarrusso, and Klaus Ostermann In Proceedings of the Fifth International Workshop on Variability Modelling of Software-intensive Systems (VaMoS), pages 137–140. ACM, 2011. Learn More Revisiting Information Hiding: Reflections on Classical and Nonclassical Modularity by Klaus Ostermann, Paolo G. Giarrusso, Christian Kästner, and Tillmann Rendel In Proceedings of the 25th European Conference on Object-Oriented Programming (ECOOP) 6813: . Springer-Verlag, 2011. Learn More SugarJ: Library-Based Language Extensibility by Sebastian Erdweg, Lennart C.L. Kats, Tillmann Rendel, Christian Kästner, Klaus Ostermann, and Eelco Visser In Companion of the 26th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), pages 187–188. ACM Press, 2011. Learn More Library-Based Model-Driven Software Development with SugarJ by Sebastian Erdweg, Lennart C.L. Kats, Tillmann Rendel, Christian Kästner, Klaus Ostermann, and Eelco Visser In Companion of the 26th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), pages 17–18. ACM Press, 2011. Learn More Variability-Aware Parsing in the Presence of Lexical Macros and Conditional Compilation by Christian Kästner, Paolo G. Giarrusso, Tillmann Rendel, Sebastian Erdweg, Klaus Ostermann, and Thorsten Berger In Proceedings of the 26th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), pages 805–824. ACM Press, 2011. Learn More SugarJ: Library-based Syntactic Language Extensibility by Sebastian Erdweg, Tillmann Rendel, Christian Kästner, and Klaus Ostermann In Proceedings of the 26th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), pages 391–406. ACM Press, 2011. Learn More The Road to Feature Modularity? by Christian Kästner, Sven Apel, and Klaus Ostermann In Proceedings of the Third Workshop on Feature-Oriented Sof",
  "content_length": 37753,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:24"
}