{
  "name": "Klaus Turowski",
  "homepage": "http://www.mrcc.ovgu.de/agwi/home",
  "status": "success",
  "content": "AGWI: Home ☰ MRCCHomeTeamThemenPublikationenDas MRCCAGWIHomeLehreTeamThemenPublikationenEventsDie AGWIBIRDUCCDas UCCVLBAHomeLehreTeamThemenPublikationenEventsDas VLBA Lab Direktlinks StudiendokumenteStudiengängePrüfungsamtMoodleSAP UA PortalLSFBibliothek Arbeitsgruppe WirtschaftsinformatikDie Arbeitsgruppe Wirtschaftsinformatik vertritt die gestaltungs- bzw. ingenieurwissenschaftliche Ausrichtung dieses Fachgebiets. Forschung und Lehre sind darauf ausgerichtet, Problemlösungskompetenz zu schaffen und zu vermitteln. Der Wirtschaftsinformatiker wird hier als Systemgestalter angesehen, dessen Systeme einen signifikanten Beitrag zur Sicherung bzw. Steigerung des Unternehmenserfolgs leisten. Gestaltungsobjekt sind dabei einzelne Systeme, aber vor allem auch integrierte Systemlandschaften. Der Begriff \"System\" beschränkt sich dabei nicht nur auf Anwendungssoftware, sondern auf Infrastrukturen einschließlich Hardware und Basissoftware ...Aktuelle Themen Alle Themen ... Menschen Prof. Dr. Klaus Turowski Leitung Christian Knopke Organisation, Sekretariat Abdulrahman Nahhas Wissenschaftler, Koordination Dr.-Ing. Daniel Gunnar Staegemann Wissenschaftler, Koordination Dirk Dreschel Wissenschaftler, Lehrkoordination Peter Schreiber Assoziierter Wissenschaftler Christian Daase Wissenschaftler Christian Haertel Wissenschaftler Dr. Jörg Ackermann Assoziierter Wissenschaftler Matthias Allgaier Assoziierter Wissenschaftler Manuel Arens Assoziierter Wissenschaftler Volker Derballa Assoziierter Wissenschaftler Patrick Gugel Assoziierter Wissenschaftler Dr. Robert Neumann Assoziierter Wissenschaftler Jan Oetjen Assoziierter Wissenschaftler Dr.-Ing. Matthias Volk Assoziierter Wissenschaftler Andreas Witt Assoziierter Wissenschaftler Dr.-Ing. Naoum Jamous Assoziierter Wissenschaftler Matthias Pohl Assoziierter Wissenschaftler Robert Franz Assoziierter Wissenschaftler Themen Wirtschaftsinformatik in MD Wirtschaftsinformatik in Magdeburg Enzyklopädie der Wirtschaftsinformatik PartnerImpressumImpressum Anfahrt",
  "content_length": 2019,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:29"
}