{
  "name": "Klaus David",
  "homepage": "https://www.comtec.eecs.uni-kassel.de/david",
  "status": "success",
  "content": "Prof. Klaus David HomePresseAktuellesLehrstuhlProf. Klaus DavidTeamAlumniLehreVorlesungenRechnernetzeMobile ComputingCodecamp 1 (wise)Codecamp 1 (sose)Codecamp 2 (wise)Codecamp 2 (sose)Com. Techn. 1Com. Techn. 2ArbeitenBPSDokumentvorlagenForschungVeröffentlichungenKonferenzenProjektePartnerStudienSoziale Rollen und UnterbrechbarkeitKontaktAnfahrtImpressum Prof. Dr.-Ing. Klaus David Anschrift Universität Kassel FB16, FG Kommunikationstechnik Wilhelmshöher Allee 73 34121 Kassel Deutschland Raum Raum 2408 Telefon +49 561 804-6314 E-Mail-Adresse E-Mail schreiben Sprechstunde: Donnerstags 14 bis 15 Uhr, Anmeldung per E-Mail erforderlich. Weitere Termine nach Vereinbarung. Curriculum VitaeProf. Dr.-Ing. Klaus David (geb. in Frankfurt am Main) war nach einem Studium der Physik an der Universität Siegen für vier Jahre wissenschaftlicher Mitarbeiter bei IMEC in Gent (Belgien) und promovierte zum Dr.-Ing. an der Universität Siegen. 1998 wurde er nach sechsjähriger Tätigkeit bei T-Mobile als Projekt- und Gruppenleiter auf den Lehrstuhl Mobile Systeme an der Technischen Universität Brandenburg berufen. Hier initiierte er auch die heute noch erfolgreiche lesswire AG und war Abteilungsleiter beim IHP (Leibniz Institute). Insgesamt war er rund fünf Jahre im Ausland (UK, Belgien, USA und Japan) tätig. Seit März 2000 leitet Herr Prof. David den Lehrstuhl Kommunikationstechnik (ComTec) an der Universität Kassel. Seit 2005 ist Prof. David Mitbegründer und Direktor des ITeG (Wissenschaftliches Zentrum für Informationstechnik-Gestaltung) der Universität Kassel. Im Jahr 2010 hat er das Start-Up PhoneTec mit gegründet. Von 2012 bis 2017 übernahm Prof. David zusätzlich die wissenschaftliche Leitung der Abteilung Kommunikation & Software am IdE Institut dezentrale Energiekonzepte. Prof. David hat über zehn Patente angemeldet, zwei Bücher geschrieben und mehr als 250 Publikationen veröffentlicht und ist in internationalen Organisationen aktiv wie: dem Institute of Electrical and Electronics Engineers (IEEE) 3 Jahre BoG IEEE VTS bis 2027 EIC IEEE VT Magazine (2015 – 2018, während der Zeit stieg der Impact Factor (IF) von unter 2 auf mehr als 6) Wireless World Research Forum (WWRF), 2016 – 2019 gewähltes Mitglied Steering Board 4 Jahre Academic Advisor ngmn (next generation mobile networks) Gutachter für die Deutsche Forschungsgesellschaft (DFG), das Bundesministerium für Bildung und Forschung (BMBF) und die EU Gutachter oder Hauptorganisator von beispielsweise: TPC Chair Future Network & Mobile Summit (FuNeMS), Berlin 2012, TPC IEEE PerCom 2013, 2014, 2015, 2019, 2020, 2021 General Chair IEEE PerCom (A+ Konferenz) Mehrere eingeladene Keynote Vorträge, wie: Plenary Keynote Speech by Klaus David on “The Wireless Seat Belt: An Innovative Approach for CAR2P/VRU Safety Based on 5G and Machine Learning”, IEEE pimrc 2017, Montreal, Canada, 8 – 13. Oct. 2017 oder: K. David, invited keynote, “Collaborative collision avoidance using 5G/6G: “The wireless seatbelt””, IEEE VTC, London, 27.9.2022Schwerpunkte der Forschung sind: mobile Anwendungen und Netze, Kontextsensitivität, maschinelles Lernen und KI. Anwendungsgebiete sind insbesondere: Mobilität, digitale Arbeit, 6G, Mobile – Learning, Energieeffizienz und Smart Cities. Von 2025 ist Prof. David der Sprecher des LOEWE-Forschungsexzellens-Schwerpunktes \"DyNaMo\": DyNaMo: Sichere und Nachhaltige Mobilität in der Stadt von Morgen - Wie hilft künstliche Intelligenz der Radverkehrssicherheit? © 2025 ComTec",
  "content_length": 3478,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:21"
}