{
  "name": "Kobbi Nissim",
  "homepage": "http://people.cs.georgetown.edu/~kobbi",
  "status": "success",
  "content": "Kobbi Nissim - Homepage Kobbi Nissim McDevitt Chair in Computer Science I am a Professor at the Department of Computer Science, Georgetown University and an Affiliate Professor at Georgetown Law. Prior to joining Georgetown, I was at the Department of Computer Science, Ben-Gurion University. From 2012 to 2017 I visited the Center for Research in Computation and Society (CRCS), Harvard University. I studied at the Weizmann Institute of Science, under the supervision of Prof. Moni Naor. Research: I work towards establishing rigorous practices for privacy in computation: identifying problems that result from the collection, sharing, and processing of information, formalizing these problems and studying them towards creating solid practices and technological solutions. I am particularly interested in intersection points between privacy and various disciplines within and outside computer science including cryptography, machine learning, game theory, complexity theory, algorithmics, statistics, databases, and more recently privacy law and policy. What is differential privacy? A definition of privacy (in the context of computing over personal data) introduced by 2006 by Dwork, McSherry, Smith and myself. See these documents for a gentle introduction: Differential Privacy: A Primer for a Non-technical Audience, Differential privacy: an introduction for statistical agencies, Designing Access with Differential Privacy. Current/Recent Projects: Data co-ops (see here) Towards an End-to-End Approach to Formal Privacy forSample Surveys (PI), Census funded. (see here) Co-design of law and computer science for privacy in sociotechnical software systems (PI), NSF funded. Rethinking Access Pattern Privacy: From Theory to Practice (PI) NSF funded. Formal Privacy Modeld and Title 13 (Lead PI), US Census funded, Georgetown. (see here and here) Computing over Distributed Sensitive Data (PI), NSF funded, Harvard. (see here) Privacy Tools for Sharing Research Data (Senior Researcher), NSF Funded, Harvard. (see here) Program committee and organization: Theory of Cryptography Conference. (TCC). Raleigh, NC, 2021 (co-chair). Symposium on the Foundations of Responsible Computing (FORC). Boston, MA, Jun2 9-11, 2021. 3rd International Symposium on Cyber Security Cryptology and Machine Learning (CSCML). Be'er Sheva, June 27-28, 2019. International Colloquium on Automata, Languages, and Programming (ICALP) track C. Prague, July 9-13, 2018. Data Privacy: Foundations and Applications. Simons Institute for the Theory of Computing, Berkeley, CA, Jan. 15-May 17, 2019. International Symposium on Cyber Security, Cryptography and Machine Learning (CSCML). Ben-Gurion University, Be'er Sheva, Israel. June 29-30, 2017. Data Privacy: Planning Workshop. Simons Institute for the Theory of Computing, Berkeley, May 22-24, 2017. Differential Privacy: From Theory to Practice. 7th BIU Winter School on Cryptography, Feb. 12-16, 2017. Teaching: Mathematical methods in computer science. (fall 2024) Mathematical methods in computer science. (spring 2022) Adaptive data analysis. (fall 2021) Mathematical methods in computer science. (fall 2020) Introduction to cryptography. (2019) Data privacy. (fall 2018) Introduction to theory. (spring 2018) Differential privacy. (spring 2017) Reseach Students/Postdocs/Long-term visitors who suffer(ed) working with me: Eliad Tsfadia, Postdoctoral Fellow, 2022-present. Ayelet Gordon, Postdoctoral Fellow, 2022-2023. Naty Peter, Postdoctoral Fellow, 2022-2024. Albert Cheu, Postdoctoral Fellow, 2021-2023. Prof. Eran Omri, Visiting Scholar, 2021-2022. Chao Yan, Ph.D. student, Georgetown University 2021-present. Chao Yan, M.Sc. student, Georgetown University 2020-2021. Mohammad Zaheri, Ph.D. student, Georgetown University, 2019-2020. Prof. Amos Beimel, Visiting Scholar, 2018-2020. Aloni Cohen, Visiting Graduate Student, 2017, 2018-2019. Aaron Fluitt, Computer Science & Privacy Law Fellow, 2017-2019. George Kellaris, Postdoc, Harvard 2015-2016. Uri Stemmer, Ph.D. student, Ben-Gurion University and Postdoc, Harvard 2016-2017. Dan Muise, Undergraduate intern, Harvard, 2015-2016. Eran Omri, Postdoc, Ben-Gurion University. Hai Brenner, M.Sc. student, Ben-Gurion University. Alex Kantor, M.Sc. student, Ben-Gurion University. Rennen Hallak, M.Sc. student, Ben-Gurion University. Publications: See my DBLP page and/or Google Scholar page. Recent Awards: IACR Fellow (2024). ACM Paris Kanellakis Theory and Practice Award (2021) for my work with Avrim Blum, Irit Dinur, Cynthia Dwork, Frank McSherry, and Adam Smith. Distinguished Achievement in Research Award (2020). Caspar Bowden Award for Outstanding Research in Privacy Enhancing Technologies (PETs) (2019) for my work with Aaron Bembenek, Alexandra Wood, Mark Bun, Marco Gaboardi, Urs Gasser, David R. O’Brien, Thomas Steinke, and Salil Vadhan \"Bridging the Gap Between Computer Science and Legal Approaches to Privacy\" [Harvard JOLT 2018]. TCC Test of Time Award (2018) for my work with Dan Boneh and Eu-Jin Goh \"Evaluating 2DNF Formulas on Ciphertexts\" [TCC 2005]. Aircloak Attack Challenge Hall of Fame, with Aloni Cohen, for a successful attack of the Diffix system (April 2018). Godel Prize (2017) for my work with Cynthia Dwork, Frank McSherry, and Adam Smith \"Calibrating Noise to Sensitivity in Private Data Analysis\" [TCC 2006, JPC 2017]. See also here and here. TCC Test of Time Award (2016) for my work with Cynthia Dwork, Frank McSherry, and Adam Smith \"Calibrating Noise to Sensitivity in Private Data Analysis\" [TCC 2006]. ACM PODS Alberto O. Mendelzon Test-of-Time Award (2013) for my work with Irit Dinur \"Revealing Information while Preserving Privacy\" [PODS 2003]. Other: Can you find me in IWCAT '97? My Instagram page. I made a few CD covers for my friend Doug Seidel. I highly recommend listening to his very special music. Contact information: Phone: (202) 687-0295. Electronic mail: kobbi.nissim@georgetown.edu. Office: 350 St. Mary's Hall. 3700 Reservoir Rd NW, Washington, DC 20057.",
  "content_length": 6006,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:37"
}