{
  "name": "Kok-Seng Wong",
  "homepage": "https://sail-research.com",
  "status": "success",
  "content": "Security and Artificial Intelligence Lab - Home Toggle navigation Security and Artificial Intelligence Lab (SAIL) @ VinUniversity Home Team Publications Research Vacancies (Pics) Welcome to the Security and Artificial Intelligence Lab Our research group is situated within VinUniversity’s College of Engineering and Computer Science. We specialize in the field of trustworthy AI, with a core focus on simplifying the development and deployment of machine learning models while ensuring their robustness. Our research encompasses low-complexity generative approaches, strengthening algorithmic robustness, and tackling critical challenges in machine learning and federated learning to enhance security, privacy, efficiency, and fairness. Previous Next We are looking for passionate new PhD students, Postdocs, and Master students to join the team (more info) ! News November, 2025Our paper titled Clean-Label Physical Backdoor Attacks with Data Distillation has been accepted at the main technical track of AAAI 2026. September, 2025Our paper titled Clean-Label Physical Backdoor Attacks with Data Distillation has been accepted at the Reliable ML from Unreliable Data workshop at NeurIPS 2025. September, 2025🎉 HUGE CONGRATULATIONS! 🎉 Our paper titled An Empirical Study of Federated Learning on IoT-Edge Devices: Resource Allocation and Heterogeneity has been accepted at IEEE Transactions on Neural Networks and Learning Systems (TNNLS)! This is a fantastic achievement and a significant milestone for our research team! August, 2025Our paper titled SC-GIR: Goal-oriented Semantic Communication via Invariant Representation Learning for Image Transmission has been accepted at IEEE Transactions on Mobile Computing (TMC). August, 2025HFedATM: Hierarchical Federated Domain Generalization via Optimal Transport and Regularized Mean Aggregation, pFedDSH: Enabling Knowledge Transfer in Personalized Federated Learning through Data-free Sub-Hypernetwork, and FLAT: Latent-Driven Arbitrary-Target Backdoor Attacks in Federated Learning released on arXiv. ... see all News © 2023 Security and Artificial Intelligence Lab. We are part of the College of Engineering & Computer Science at VinUniversity. Contact: G3 Building, VinUniversity Vinhomes Ocean Park, Gia Lam District, Hanoi, Vietnam (Maps).",
  "content_length": 2295,
  "method": "requests",
  "crawl_time": "2025-12-01 13:43:49"
}