{
  "name": "Kok Soon Tey",
  "homepage": "https://umexpert.um.edu.my/koksoon",
  "status": "success",
  "content": "UMEXPERT - ASSOCIATE PROF. DR. TEY KOK SOON ASSOCIATE PROF. DR. TEY KOK SOON Department of Computer System & Technology Faculty of Computer Science and Information Technology koksoonum.edu.my View CV View 1-Page CV Publons Scopus Link Biography Tey Kok Soon received his BEng degree in Electrical Engineering and PhD degree from the University of Malaya, Malaysia, in 2011 and 2014 respectively. Since 2011, he has been a Research Assistant with the Power Electronics and Renewable Energy Research Laboratory (PEARL), Department of Electrical Engineering, University of Malaya. In 2015, he joined Department of Computer System and Technology, Faculty of Computer Science and Information Technology (FCSIT) as a Senior Lecturer. His research interests include renewable energy control system, energy management, power efficiency of PV system and inverter control of PV system. Hide Collaborator zurinaosman ismailahmedy rosli_salleh chong_wentong saad adnan fidah hazli zaily harith yamani marizan sumiani abdullah noraisyah View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status Sustainable Iot Applications In Lorawan Through Optimized Photovoltaic Energy Harvesting And Hybrid Battery Management Scheme on going Battery Charging Circuit for The Scrubber Machine on going This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Proceeding 2025 A New Cross-Overlapped Decoupling Coil Structure for EV Dynamic Inductive Wireless Charging System 2024 Cognitive radio and machine learning modalities for enhancing the smart transportation system: A systematic literature review 2024 State of Health (SoH) estimation methods for second life lithium-ion battery-Review and challenges 2024 Design and performance evaluation of a solar-assisted biogas and air-source heat pump hybrid system for radiant heating applications 2021 Lithium-ion Battery Model Parameter Identification Using Modified Adaptive Forgetting Factor-Based Recursive Least Square Algorithm 2021 Modular Voltage Equalizer Topology with Reduced Number of Switch Count for Enhancing the Energy Yield During Partial Shading Conditions For PV System 2021 Lithium-ion Battery State of Energy Estimation Using Deep Neural Network and Support Vector Regression 2020 Battery State of Charge Estimation Using Adaptive Extended Kalman Filter for Electric Vehicle application",
  "content_length": 2637,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:06"
}