{
  "name": "Konstantinos Lambrinoudakis",
  "homepage": "https://www.ds.unipi.gr/en/faculty/clam-en",
  "status": "success",
  "content": "Konstantinos Lambrinoudakis - Department of Digital Systems Skip to content Konstantinos Lambrinoudakis Phone +30 210-4142720 Email clam@unipi.gr Title Professor Office Hours Thursday 12.00 - 14.00 Office 504 (150, Androutsou Str, Piraeus, 18532) Research cooperations and citations map https://researchmaps.ds.unipi.gr/citations/clam Courses Computer Architecture — 2nd semester Security Policies and Security Management — 5th semester Privacy Enhancing Technologies — 6th semester Brief CV Dr. Costas Lambrinoudakis holds a B.Sc. (Electrical and Electronic Engineering) from the University of Salford (1985), an M.Sc. (Control Systems) from the University of London (Imperial College -1986), and a Ph.D. (Computer Science) from the University of London (Queen Mary and Westfield College – 1991). From 1998 until 2009 he has held teaching position with the University of the Aegean, Department of Information and Communication Systems Engineering, Greece. Currently he is a Professor at the Department of Digital Systems, University of Piraeus, Greece. From 2015 he is Director of the Systems Security Lab, while for the period 2015-2020 he served as Head of the Department. For the period 2012-2015 he was a member of the board of the Hellenic Authority for Communication Security and Privacy, while from 2016 he serves on the board of the Hellenic Data Protection Authority. His current research interests are in the areas of Information and Communication Systems Security and of Privacy Enhancing Technologies. For many years he is working on issues related to the protection of personal data and the compliance of information systems to the National and European Legislation. He is an author of more than 120 scientific publications in refereed international journals, books and conferences, most of them on ICT security and privacy protection issues. He has served as program committee chair of 15 international scientific conferences and as a member on the program and organizing committees in more than 200 others. Also he participates in the editorial board of two international scientific journals and he acts as a reviewer for more than 35 journals. He has been involved in many national and EU funded R&D projects in the area of Information and Communication Systems Security. Publications Publications Publications 2010 – 2020 I) JOURNALS Makri E.L., Georgiopoulou Z., Lambrinoudakis C., Utilizing a privacy impact assessment method using metrics in the healthcare sector, Information & Computer Security, 2020. Kalloniatis C., Diamantopoulou V., Kotis K., Lyvas C., Maliatsos K., Gay M., Kanatas A., Lambrinoudakis C., “Towards the design of an assurance framework for increasing security and privacy in Connected Vehicles”, International Journal of Internet of Things and Cyber-Assurance, Inderscience Publishers, (to appear). Gritzalis A., Tsohou A., and Lambrinoudakis C., “Transparency-Enabling Information Systems: Trust Relations and Privacy Concerns in Open Governance”, International Journal of Electronic Governance, Vol. 11, No. 3, Inderscience Publishers, 2019. Lyvas C., Lambrinoudakis C., Geneiatakis D., “Dypermin: Dynamic Permission Mining Framework for Android Platform”, Computers and Security Journal (indexed in ISI/SCI-E), Vol. 77, pp. 472-487, Elsevier, 2018. Georgiou D., Lambrinoudakis C., “Security Policy Rules and Required Procedures for Two Crucial Threats of Cloud Computing”, International Journal of Electronic Governance, Volume Vol. 9, Nos. 3/4, pp. 385-403, Inderscience Publishers, 2017. Drogkaris P., Gritzalis S., Kalloniatis C., Lambrinoudakis C., “Hierarchical Multitier Approach for Privacy Policies in e-Government Environments”, Future Internet (indexed in ESCI), Vol. 7, pp. 500-515; DOI:10.3390/fi7040500, MDPI, 2015. Pitropakis N., Pikrakis A., Lambrinoudakis C., “Behaviour reflects personality: detecting co-residence attacks on Xen-based cloud environments”, International Journal of Information Security (indexed in ISI/SCI-E), Volume 14, Issue 4, pp 299–305, Elsevier, 2015. Pitropakis N., Anastasopoulou D., Pikrakis A., Lambrinoudakis C., “If you want to know about a hunter, study his prey: detection of network based attacks on KVM based cloud environments”, Journal of Cloud Computing: Advances, Systems and Applications, Vol.3:20, DOI: 10.1186/s13677-014-0020-6, Springer, 2014. Vrakas N., Geneiatakis D., Lambrinoudakis C., “Obscuring Users’ Identity in VoIP/IMS Environments”, Computers and Security Journal (indexed in ISI/SCI-E), Vol. 43, pp. 145-158, Elsevier, 2014. Vrakas N., Lambrinoudakis C., “An Intrusion Detection and Prevention System for IMS and VoIP Services”, International Journal of Information Security (indexed in ISI/SCI-E), Vol. 12, No.3, pp. 201-217, Springer, 2013. Drogkaris P., Gritzalis S., Lambrinoudakis C., “Employing privacy policies and preferences in modern e-government environments”, International Journal of Electronic Governance, Vol. 6, No. 2, pp. 101-116, Inderscience Publishers, 2013. Vrakas N., Geneiatakis D., Lambrinoudakis C., “Evaluating the Security and Privacy Protection Level of IP Multimedia Subsystem Environments”, IEEE Communications Surveys and Tutorials (indexed in ISI/SCI-E), Vol. 15, No.2, pp. 803-819, IEEE Press, 2013. Lambrinoudakis C., “Evaluating and Enriching Information and Communication Technologies Compliance Frameworks with Regard to Privacy”, Information Management & Computer Security, Vol.21, No.3, pp. 177-190, Emerald, 2013. Vrakas N., Lambrinoudakis C., “A Cross Layer Spoofing Detection Mechanism for Multimedia Communication Services”, International Journal of Information Technologies and the Systems Approach, 4, Issue 2, pp. 32-47, IGI Global, 2011. Terzis I., Kambourakis G., Karopoulos G., Lambrinoudakis C., “Privacy Preserving Context Transfer Schemes for 4G Networks”, Wireless Communications and Mobile Computing (indexed in ISI/SCI-E), 11, Issue 2, pp. 289-302, Wiley, 2011. Tsohou Α., Kokolakis S., Lambrinoudakis C., Gritzalis S., “A Security Standards’ framework to facilitate best practices’ Awareness and Conformity”, Information Management & Computer Security, Vol. 18, No.5, pp. 350-365, Emerald, 2010. Kambourakis G., Geneiatakis D., Gritzalis S., Lambrinoudakis C., Dagiuklas A., Ehlert S., Fiedler J., “High Availability for SIP: Solutions and Real-Time Measurement Performance Evaluation”, International Journal of Disaster Recovery and Business Continuity, 1, No.1, pp. 11-29, SERSC, 2010. Tsohou A., Lambrinoudakis C., Kokolakis S., Gritzalis S., “The Importance of Context Dependant Privacy Requirements and Perceptions to the Design of Privacy Aware Systems”, The European Journal of the Informatics Professional (UPGrade, www.upgrade-cepis.org), Special Issue: Privacy and Identity Management, Vol. xi, No. 1, pp.32-37, also in Novatica journal, Issue 202 (www.ati.es/novatica), 2010. II) CONFERENCES Georgiou D., Lambrinoudakis C., “Cloud Computing Framework for e-Health Security Requirements & Security Policy Rules Case Study: European Cloud-based Health System”, Proceedings of the 8th International Conference on e-Democracy (eDemocracy 2019), Springer, Athens, Greece, December 2019. Maliatsos K., Lyvas C., Pantazopoulos P., Lambrinoudakis C., Kanatas A., Gay M. and Amditis A., “Standardizing Security Evaluation Criteria for Connected Vehicles: A Modular Protection Profile”, Proceedings of the IEEE Conference on Standards for Communications and Networking (IEEE CSCN 2019), IEEE Xplore, Granada, October 2019. Pitropakis N., Logothetis M., Andrienko G., Stefanatos J., Karapistoli E., Lambrinoudakis C., “Towards The Creation of A Threat Intelligence Framework for Maritime Infrastructures”, Proceedings of the 5th Workshop on the Security of Industrial Control Systems & of Cyber-Physical Systems (CyberICPS 2019), in conjunction with ESORICS 2019, Luxembourg, Septemeber 2019. Makri E.L., Georgiopoulou Z., Lambrinoudakis C., “A Proposed Privacy Impact Assessment Method using Metrics based on Organizational Characteristics”, Proceedings of the 3rd International Workshop on SECurity and Privacy Requirements Engineering (SECPRE 2019), in conjunction with ESORICS 2019, Luxembourg, September 2019. Georgiopoulou Z., Makri E.L., Lambrinoudakis C., “GDPR Compliance: Proposed Technical and Organizational measures for Cloud Providers”, Proceedings of the 3rd International Workshop on SECurity and Privacy Requirements Engineering (SECPRE 2019), in conjunction with ESORICS 2019, Luxembourg, September 2019. Mykoniati M., Lambrinoudakis C., “Fault Prediction Model for Node Selection Function of Mobile Networks”, Proceedings of the 9th International Conference on Information Communication and Management (ICICM 2019), ICPS ACM, Prague, Czech Republic, August 2019, Pantazopoulos P., Haddad S., Lambrinoudakis C., Kalloniatis C., etal, “Towards a Security Assurance Framework for Connected Vehicles”, Proceedings of the 5th IEEE Workshop on Smart Vehicles: Connectivity Technologies and ITS Applications, IEEE Xplore, Chania, Greece, June 2018. Gritzalis A., Tsohou A., and Lambrinoudakis C., “Transparency-Enabling Systems for Open Governance: Their Impact on Citizens’ Trust and the Role of Information Privacy”, Proceedings of the 7th International Conference on E-Democracy – Privacy –Preserving, Secure, Intelligent E-Government Services (E-Democracy 2017), 47-63, Springer CCIS 792, Athens, Greece, December 2017. Pitropakis N., Lyvas C., Lambrinoudakis C., “The greater the power, the more dangerous the abuse: Facing Malicious Insiders in the Cloud ”, Proceedings of the 8th International Conference on Cloud Computing, GRIDs, and Virtualization, Track Security and Privacy in Cloud Computing (SEPRICC 2017), IARIA Xpert Publishing Services, Athens, February 2017. Georgiopoulou Z., Lambrinoudakis C., “Trust Management Parameters in Cloud Computing Environments”, Proceedings of the 8th International Conference on Cloud Computing, GRIDs, and Virtualization, Track Security and Privacy in Cloud Computin",
  "content_length": 18749,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:09"
}