{
  "name": "Konstantinos Mersinas",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/konstantinos-mersinas",
  "status": "success",
  "content": "Konstantinos Mersinas - Royal Holloway Research Portal Konstantinos Mersinas Dr Senior Lecturer in Information Security, Department of Information Security https://orcid.org/0000-0002-4402-2987 Phone+44 1784 443079EmailKonstantinos.Mersinasrhul.acuk TW20 0EX Personal profile Personal profileKonstantinos is a trained mathematician, information security professional, and CISSP, who moved to academia to conduct experimental research on behavioural aspects of security. His work utilises behavioural economics and psychology to examine security behaviours in various contexts, including perceptions of risk, types of 'rationality', decision-making, and human aspects of cybercrime. He supervises a group of PhD students. Konstantinos is the Director of the Distance Learning (DL) MSc programme in Information Security and has been teaching the courses: Human Aspects of Information Security and Privacy and Cybercrime for several years. He is a Program Committee Member for the Workshop on Active Defense and Deception (AD&D) with the IEEE European Symposium on Security and Privacy, the European Network Intelligence Conference, the Workshop on Applications of Social Network Analysis, the International School and Conference on Network Science and the International Conference on Signal Image Technology & Internet Based Systems. To advance interdisciplinary research, Konstantinos co-founded the research group HIVE (Hub for research into Intergenerational Exploitation to Vulnerability) amongst the Information Security Group, Law, and Psychology at Royal Holloway. Indicative HIVE projects include the protection of adolescents from cyberbullying / cyberstalking, and the elderly from financial fraud. HIVE has established collaborations with London Met Police, NCSC, and a number of financial and charity organisations. In 2021 and 2023, he provided input at the UK All-Party Parliamentary Group (APPG) on Cybersecurity on the Online Harms Bill (now Online Safety Act), and Maritime Security. He is Director at the International Cyber Security Centre of Excellence (https://incs-coe.org), an international research community founded between 6 universities: Imperial (UK), Royal Holloway (UK), Northeastern (US), UMBC (US), Kyushu (Japan), and Keio (Japan). The centre fosters research collaborations and rapidly expands globally. Konstantinos is a Visiting Professor at Keio University, Tokyo, Japan 特別 招聘 准教授   慶応 大学 東京 日本. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInformation Security, PhD, Risk Perception and Attitude in Information Security Decision-making, Information Security Group, Royal Holloway, University of LondonAward Date: 7 Mar 2017Information Security, MSc, Information Security Group, Royal Holloway, University of LondonAward Date: 1 Sept 2003Mathematics, MSci, Aristotle University of ThessalonikiAward Date: 1 Mar 2001 External positions Visiting Professor 特別 招聘 准教授 慶応 大学 東京 日本, Keio University Tokyo10 Oct 2024 → … Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 12 Conference contribution 6 Article 5 Paper 2 Newspaper article 7 More 1 Book 1 Chapter 1 Other 1 Internet publication 1 Digital or Visual Products 1 Doctoral Thesis 1 Preprint Research output per year Research output per year Cybersecurity Behavior Change: A conceptualization of Ethical Principles for Behavioral InterventionsMersinas, K., Bada, M. & Furnell, S., Jan 2025, In: Computers and Security. 148, 9 p., 104025.Research output: Contribution to journal › Article › peer-review Open Access Decomposing Culture within Threat Actor Groups – Insights from the Conti Ransomware CollectiveMersinas, K., Liu, A. & Panteli, N., 1 Sept 2025, IEEE European Symposium on Security and Privacy. Venice, Italy: IEEE, p. 103-108 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Being Responsible in Cybersecurity: A multi-layered perspectivePanteli, N., Nthubu, B. R. & Mersinas, K., 19 Feb 2025, (E-pub ahead of print) In: Information Systems Frontiers. 19 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 53 Downloads (Pure) Beyond Regulatory Compliance: Towards a multi-layered responsible cybersecurity perspectiveNthubu, B., Panteli, N. & Mersinas, K., 22 Apr 2025, Proceedings of the 30th UK Academy for Information Systems (UKAIS) International Conference: 2025, Newcastle April 22-24, 2025.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Customisable, Individualised, and Ethical Cybersecurity Behaviour Change: An Adaptive Data-Driven Computational Behavioural Science Approach Mersinas, K., Chupkemi, D. & Poriete, A., 7 Oct 2025, (Submitted) Emerging Technologies in Cybersecurity: (Jamk University of Applied Sciences, Institute of Information Technology, Finland). SpringerResearch output: Chapter in Book/Report/Conference proceeding › Chapter View all 32 research outputs Projects 1 Active 3 Finished Projects per year ResilMesh: Situation Aware enabled Cyber Resilience for Dispersed, Heterogenous Cyber SystemsHappa, J. (PI) & Mersinas, K. (CoI)UK Research and Innovation UKRI1/10/23 → 30/09/26Project: Research Behaviour Change: an AI-based approach for Information Security Mersinas, K. (PI)16/12/19 → 16/04/20Project: Research Define and deliver scoping studies for further research into securing UK HEIsMersinas, K. (PI), Watling, D. (CoI) & Durojaiye, T. (Researcher)National Cyber Security Centre1/12/19 → 31/03/20Project: Research Aspects of Attacker Economics and Industry-Specific Threat Modelling (KPMG Netherlands)Mersinas, K. (PI), Moeckel, C. (CoI) & Pan, L. (CoI)1/08/18 → 31/01/19Project: Research Activities 7 Invited talk 4 Hosting an academic visitor 2 Public engagement, outreach and knowledge exchange - Industrial engagement 2 Public engagement, outreach and knowledge exchange - Participation in interview for web based media 2 More 1 Public engagement, outreach and knowledge exchange - Public Lecture/debate/seminar 1 Oral presentation Activities per year Martin SchleperMersinas, K. (Host)11 Nov 2025Activity: Hosting a visitor › Hosting an academic visitor Constantin BlomeMersinas, K. (Host)11 Nov 2025Activity: Hosting a visitor › Hosting an academic visitor Cybersecurity for Digitized National Security, Economic Security, and Societal Security: Global Multilateral Public-Private Partnership ActionsMersinas, K. (Speaker)27 Oct 2025 → 3 Nov 2025Activity: Talk, presentation or media contribution › Invited talk 15th International Cybersecurity Symposium, Keio University, Tokyo, JapanMersinas, K. (Speaker)27 Oct 2025 → 3 Nov 2025Activity: Talk, presentation or media contribution › Invited talk File How Cybersecurity and AI can join Hands to Protect the WorldIdrees, F. (Speaker) & Mersinas, K. (Speaker)23 Oct 2025Activity: Talk, presentation or media contribution › Oral presentation View all 17 activities",
  "content_length": 7463,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:08"
}