{
  "name": "Konstantinos Psounis",
  "homepage": "https://sites.usc.edu/kpsounis",
  "status": "success",
  "content": "Konstantinos Psounis – Professor, University of Southern California Skip to content Home Konstantinos Psounis Professor Ming Hsieh department of Electrical and Computer Engineering Thomas Lord department of Computer Science School of Advanced Computing Viterbi School of Engineering University of Southern California Curriculum Vitae in pdf Bio Konstantinos Psounis is a Professor of Electrical and Computer Engineering and of Computer Science at the University of Southern California. Prior to this he was an Assistant Professor and then an Associate Professor at the same university. He graduated first in his class from the department of Electrical and Computer Engineering of National Technical University of Athens, Greece, and completed an M.S. and  a Ph.D. degree in Electrical Engineering at Stanford University, California, as a Stanford graduate fellow. Konstantinos works on performance analysis, algorithm design, and system design and implementation for efficient, AI-enabled and privacy-preserving networked, distributed systems, including the Internet and the web, data centers and cloud systems, wireless systems, virtual reality systems, and autonomous robotic/vehicle/drone systems. He also worls on multimodal large language models, robust agentic systems, and machine learning benchmarking with applications to distributed systems. He is the author of more than 120 research papers on these topics which have received more than 15000 citations. He has received faculty awards and funding from numerous governmental agencies and high-tech industry leaders. He is an IEEE Fellow and an ACM Distinguished Member. Contact Konstantinos Psounis telephone: 213-7404453 email: kpsounis at usc dot edu office: RTH 409 address: 3740 McClintock Avenue, EEB 200, Los Angeles, CA 90089, US University of Southern California Logo University of Southern California",
  "content_length": 1869,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:08"
}