{
  "name": "Konstantinos Papangelis",
  "homepage": "https://www.rit.edu/directory/kxpigm-konstantinos-papangelis",
  "status": "success",
  "content": "Konstantinos Papangelis | RIT RIT Logo with Text Konstantinos Papangelis Assistant Professor School of Interactive Games and Media Golisano College of Computing and Information Sciences kxpigm@rit.edu Office Location GOL-2521 Konstantinos Papangelis Assistant Professor School of Interactive Games and Media Golisano College of Computing and Information Sciences kxpigm@rit.edu Currently Teaching IGME-320Game Design & Development II3 CreditsThis course continues to examine the core theories of game design as they relate to the professional field. Beginning with a formalized pitch process, this course examines the design and development paradigm from story-boarding and pre-visualization through rapid iteration, refinement, and structured prototyping exercises to further examine the validity of a given design. Specific emphasis is placed on iterative prototyping models, and on methodologies for both informal and formal critique. This course also explores production techniques and life-cycle in the professional industry.IGME-580IGM Production Studio3 CreditsThis course will allow students to work as domain specialists on teams completing one or more large projects over the course of the semester. The projects will be relevant to experiences of the interactive games and media programs, but will require expertise in a variety of sub-domains, including web design and development, social computing, computer game development, multi-user media, human-computer interaction and streaming media. Students will learn to apply concepts of project management and scheduling, production roles and responsibilities, and their domain skill sets to multidisciplinary projects. Students will complete design documents, progress reports and final assessments of themselves and their teammates in addition to completing their assigned responsibilities on the main projects. In the News March 28, 2022 Sappi to work with RIT researchers to advance digital innovation Computing researchers at RIT are teaming up with Sappi, the leading global provider of sustainable woodfibre products and bio-based solutions, to improve innovation processes. Sappi is funding research to establish the Sappi–RIT Digital Innovation Lab in RIT’s Golisano College of Computing and Information Sciences. February 2, 2021 RIT researchers explore augmented reality concepts in real estate and property management Computing researchers at RITare teaming up with Fortune 500 company JLL to explore augmented reality within the commercial real estate and property management space. September 2, 2020 Niantic donates $400,000 to create Niantic x RIT Geo Games and Media Research Lab Niantic has donated $400,000 to create a new research lab at RIT that’s focused on location-based games. In the Niantic x RIT Geo Games and Media Research Lab, researchers will work to better understand how people interact with location-based games and how they can be used for good. May 30, 2024 Ph.D. student publishes paper on Human-Centered AI June 2, 2021 Papangelis named Outstanding Emerging Scholar March 30, 2021 Papangelis receives grant from health foundation More News Featured Work Computing Ph.D. Student Leads Groundbreaking Research with KAIST Interaction Lab Jiangnan Xu Jiangnan Xu travels to Korea with the School of Interactive Games and Media to study the intersection of AI and the Metaverse. View More about Computing Ph.D. Student Leads Groundbreaking Research with KAIST Interaction Lab See All Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 3677,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:08"
}