{
  "name": "Konstantinos Markantonakis",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/konstantinos-markantonakis",
  "status": "success",
  "content": "Konstantinos Markantonakis - Royal Holloway Research Portal View Scopus Profile Konstantinos Markantonakis Professor Professor of Information Security, Department of Information SecurityISG Smart Card and IoT Security CentreEngineering Research Centre Phone+44 1784 414409EmailK.Markantonakisrhul.acukWebsitehttp://www.scc.rhul.ac.uk/ TW20 0EX Personal profile Personal profileI was awarded an BSc (Hons) in Computer Science from Lancaster University in 1995. Following from that, I completed an MSc in Information Security in 1996, a PhD in Smart card Security in 2000 and an MBA in International Management in 2005, all from Royal Holloway, University of London. I joined the Information Security Group as lecturer in 2002 and I became Reader in Information Security in 2007. My main research interests include smart card security and applications, secure cryptographic protocol design, key management, embedded system security and trusted execution environments, drone and automotive security, cyber physical systems, mobile phone operating systems/platform security, NFC/RFID/HCE security, grouping proofs, electronic voting protocols and Internet-of-Things (IoT). Further details about my teaching and research activities can be obtained at http://km.isg.rhul.ac.uk/ . Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 109 Conference contribution 37 Article 24 Paper 20 Chapter 21 More 11 Other contribution 4 Chapter (peer-reviewed) 3 Book 1 Other 1 Special issue 1 Preprint Research output per year Research output per year Control-flow attestation: Concepts, solutions, and open challengesSha, Z., Shepherd, C., Rafi, A. & Markantonakis, K., Mar 2025, In: Computers and Security. 150, 23 p., 104254.Research output: Contribution to journal › Article › peer-review Open Access DECML: Distributed Edge Consensus Machine Learning FrameworkVerdeyen, C., Shepherd, C., Markantonakis, K., Akram, R. N., Milroy, R., Abu Ghazalah, S. & Sauveron, D., 14 Jan 2025, 2024 IEEE Global Conference on Artificial Intelligence and Internet of Things (GCAIoT). IEEE, 7 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 24 Downloads (Pure) CO-TSM: A Flexible Model for Secure Embedded Device Ownership and ManagementMarkantonakis, K., Arfaoui, G., Abu Ghazalah, S., Shepherd, C., Akram, R. N. & Sauveron, D., 8 Oct 2024, In: Smart Cities. 7, 5, p. 2887-2909 23 p.Research output: Contribution to journal › Article › peer-review Open Access ICT Systems Security and Privacy Protection: 39th IFIP International Conference, SEC 2024, Edinburgh, UK, June 12–14, 2024, ProceedingsPitropakis, N. (Editor), Katsikas, S. (Editor), Furnell, S. (Editor) & Markantonakis, K. (Editor), 9 Aug 2024, 496 p. Springer, [Cham].Research output: Other contribution Trusted Execution EnvironmentsShepherd, C. & Markantonakis, K., 27 Jun 2024, Springer, [Cham]. 224 p.Research output: Book/Report › Book View all 211 research outputs Projects 19 Finished Projects per year EXFILES: Extract Forensic Information for LEAs from Encrypted SmartPhonesMarkantonakis, K. (PI), Roache, R. (CoI) & Seglow, J. (CoI)European Commission1/07/20 → 30/06/23Project: Research PrineSecMarkantonakis, K. (PI)Innovate UK1/09/19 → 29/02/20Project: Research Transparent? Compliance (TC)?Markantonakis, K. (PI)Innovate UK1/04/19 → 31/07/19Project: Research Future TPM: Future Proofing the Connected World: A Quantum-Resistant Trusted Platform ModuleSgandurra, D. (PI), Markantonakis, K. (CoI) & Quaglia, E. (CoI)European Commission1/01/18 → 31/12/20Project: Research Academic Centre of Excellence in Cyber Security Research - [Royal Holloway University of London]Markantonakis, K. (PI) & Cavallaro, L. (CoI)Eng & Phys Sci Res Council EPSRC1/07/17 → 30/06/22Project: Research View all 19 projects",
  "content_length": 4391,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:09"
}