{
  "name": "Konstantinos Krampis",
  "homepage": "https://www.hunter.cuny.edu/belfer/faculty/dr.-konstantinos-krampis",
  "status": "success",
  "content": "Konstantinos Krampis Profile | Hunter College Opportunity is on the line: Support Hunter College this #CUNYTuesday and help students stay enrolled, supported, and thriving despite major funding cuts. Give now. Konstantinos KrampisAssociate ProfessorResearch InterestsBioinformatics, Artificial Intelligence, Machine LearningPublicationsPubMed ArticlesGoogle Scholar ProfileKonstantinos KrampisKonstantinos Krampis is an associate professor in the Department of Biological Sciences at Hunter College. See Contact Details ProfileKonstantinos Krampis is currently an Associate Professor in the Department of Biological Sciences at Hunter College and Faculty of the Computer Science and Biology Ph.D. programs at CUNY. In addition, he is the Director of Bioinformatics and Biostatistics Core within the Cancer Health Disparity Partnership of Hunter College with Temple University / FCCC, and Adjunct Faculty at the Institute of Computational Biomedicine at Weill Cornell Medical College. Previously, he was an Assistant Professor at the J. Craig Venter Institute, and did graduate studies at the Virginia Bioinformatics Institute at Virginia Tech. Up to now, he has funded his research with multiple awards by the National Science Foundation (NSF) and the National Institutes of Health (NIH) both as co-PI and PI. With these awards he has performed research and development of scalable bioinformatics solutions, running on compute clusters and the cloud by abstracting the underlying software complexity, enabling portability, scalability and seamless access across computing platforms. In addition, Prof. Krampis has implemented a Next-Generation Sequencing (NGS) facility and high-performance bioinformatics computing cluster at CUNY, and novel bioinformatics tools that enable broad application of genomics, in areas ranging from basic biological research to clinical genomics. His current research focuses on Large Language Models and Artificial Intelligence interpretability, deep learning and machine learning, with applications for personal genomics and broadly in the field of genomic data science. Educational Background PhD in Bioinformatics, Virginia TechMSc/BSc in Molecular Biology, University of Athens Research Research Interests Artificial Intelligence Large Language Models Interpretability Machine Learning and AI applications for Bioinformatics Computational Biology Cancer and Personal Genomics Health Disparities Research Areas High-throughput bioinformatics infrastructures for cluster and cloud computing platforms. Scalability of data analysis pipelines using distributed computing: Kubernetes, NextFlow, Docker Swarm. Cross-platform bioinformatics through Docker virtualization in clinical and basic research. Visualization of genomic data on cloud databases using HTML5 / D3.js and in-browser computing. Bioinformatics for Next Generation Sequencing (NGS) clinical and personal genomics. NGS data pipelines for QC, RNA-seq, Hi-C, metagenomics, variant discovery, genome assembly. Integrative analysis of variation, expression, chromatin and epigenetic data from TCGA, Encode, 4DN. Scalable, accessible pipelines for metagenomics, clinical samples and personal genomics on Galaxy. Interdisciplinary research and novel applications of genomic sequencing and bioinformatics. Portable NGS and bioinformatics with Nanopore Minion and Intel Next Units of Computing (NUC). Touch-enabled, mobile computing interfaces for personal genomics and clinical NGS data visualization. Metabarcoding for conservation and biodiversity monitoring using environmental DNA (eDNA). Algorithmic Information Theory, Computability, and Biologically-Inspired Computing. Emergence, complexity, information content and compressibility of epigenetic networks. Integrating DNA computing with NGS sequencing for reading molecolar output with high I/O. Computability and decidability of biologically-inspired and DNA computing models. Appointments and Affliations Academic Appointments 4/2014 - Present   City University of New York  -  Associate Professor 4/2014 - Present   Center for Translational & Basic Research  -  Director of Bioinformatics 4/2014 - Present   Weill Cornell Medical College  -  Faculty, Computational Biomedicine 5/2009 - 4/2014    J. Craig Venter Institute  -  Assistant Professor 8/2003 - 5/2009    Virginia Bioinformatics Institute  -  RA & Bioinformatics Engineer 8/2000 - 8/2003    University of Athens, Greece  -  Research Assistant (RA) Affiliations and Memberships Since 2017 NCI Containers and Workflows Interest Group - NIH Data Science Since 2016 High-performance Integrated Virtual Environment (HIVE) Consortium, FDA-GWU Since 2015 IEEE Biological Compute Objects (BCO) Working Group Since 2013 Illumina Basespace Developers Community Since 2009  Open Bioinformatics Foundation Since 2009  Galaxy Developers Community Since 2006 Bioinformatics IT World Courses Taught BIO 42500, Computational Molecular Biology, every spring semester since 2015, Hunter College. BIO 47106 / BIO 79006 Machine Learning for Bioinformatics, every fall semester since 2021, Hunter College. BIO 48001 / 2, Introduction to Experimental Biology, every spring and fall semesters since 2015, Hunter College. BIO 47105 / BIO 79005 Python for Bioinformatics, fall semesters 2014 - 2015, Hunter College. BIO 23100, Microbiology with Bioinformatics Applications, every spring semester since 2021-2022, Hunter College. BIO 79303 / CS 87100 Next-Gen Sequencing and Bioinformatics, fall semesters 2015-2020, CUNY Graduate Center. BIO 79303 Machine Learning & AI for Bioinformatics, every fall semester since 2021, CUNY Graduate Center. BIOL 89800 / CS 86190, Capstone - PhD mentoring, fall and spring semesters since 2014, CUNY Graduate Center. PublicationsSelected Publications on Machine Learning, AI and Bioinformatics: Krampis K, Ross E, Ogunwobi O, Ma G, Mazumder R, Wultsch C. 2024 Principles of Artificial Neural Networks and Machine Learning for Bioinformatics Applications. Preprints: 202306.0042 Krampis K. Democratizing bioinformatics through easily accessible software platforms for non-experts in the field. 2022 BioTechniques. Feb 1;72(2):36-8. Kim, B., T.A. Ali, C. Dong, C. Lijeron, R. Mazumder, C. Wultsch, and K. Krampis. 2019. miCloud: A Plug-n-Play, Extensible, On-Premises Bioinformatics Cloud for Seamless Execution of Complex Next-Generation Sequencing Data Analysis Pipelines. Journal of Computational Biology 26:280-284. Kim, B., T. Ali, C. Lijeron, E. Afgan, and K. Krampis. 2017. Bio-Docklets: virtualization containers for single-step execution of NGS pipelines. GigaScience 6(8):gix048. Kim, B., T. Ali, S. Hosmer, and K. Krampis. 2016. Visual Omics Explorer (VOE): a cross-platform portal for interactive data visualization. Bioinformatics 32:2050-2052. Krampis, K., and C. Wultsch. 2015. A review of cloud computing bioinformatics solutions for next-gen sequencing data analysis and research. Methods in Next Generation Sequencing 2(1):23-34. Krampis, K., T. Booth, B. Chapman, B. Tiwari, M. Bicak, D. Field, and K.E. Nelson. 2012. Cloud BioLinux: pre-configured and on-demand bioinformatics computing for the genomics community. BMC Bioinformatics 13:42. Selected Publications on Metagenomics, Cancer and Personal Genomics: Ghosh J., Schultz B.M., Chan J., … Krampis et al. 2022 Epigenome-Wide Study Identifies Epigenetic Outliers in Normal Mucosa of Patients with Colorectal Cancer. Cancer prevention research (Philadelphia, Pa.) Nov 1;15(11):755-66. Speer, K.A., Teixeira, T.S.M., Brown, A.M., Perkins, S.L., Dittmar, K., Ingala, M.R., Wultsch, C., Krampis, K., Dick, C.W., Galen, S.C. and Simmons, N.B., 2022. Cascading effects of habitat loss on ectoparasite-associated bacterial microbiomes. ISME communications, 2(1), p.67. Naidoo, M., Levine, F., Gillot, T., Orunmuyi, A.T., Olapade-Olaopa, E.O., Ali, T., Krampis, K., Pan, C., Dorsaint, P., Sboner, A. and Ogunwobi, O.O., 2021. MicroRNA-1205 Regulation of FRYL in Prostate Cancer. Frontiers in Cell and Developmental Biology, 9. Brown, S.M., H. Chen, Y. Hao, B.P. Laungani, T.A. Ali, C. Dong, C. Lijeron, B. Kim, C. Wultsch, Z. Pei, and K. Krampis. 2019. MGS-Fast: Metagenomic shotgun data fast annotation using microbial gene catalogs. GigaScience 8:giz020. Alterovitz, G., D. Dean, C. Goble, M.R. Crusoe, S. Soiland-Reyes, ..., K. Krampis, et al. 2018. Enabling precision medicine via standard communication of HTS provenance, analysis, and results. PLoS Biology 16(12):e3000099. Cole, C., K. Krampis, K. Karagiannis, J.S. Almeida, W.J. Faison, M. Motwani, Q. Wan, A. Golikov, Y. Pan, and V. Simonyan. 2014. Non-synonymous variations in cancer and their effects on the human proteome: workflow for NGS data biocuration and proteome-wide analysis of TCGA data. BMC Bioinformatics 15:28. Tyler, B. M., S. Tripathy, X. Zhang, P. Dehal, R.H. Jiang, A. Aerts,.., K. Krampis et al. 2006. Phytophthora genome sequences uncover evolutionary origins and mechanisms of pathogenesis. Science 313:1261-1266. View Full List of Publications on PubMed Awards and Grants Grants Principal Investigator Years Grants 2017 - 2018 CUNY Advanced Science Research Center (ASRC) Seed Award Program. Project Title: \"Next Generation Sequencing for environmental DNA monitoring: understanding global biodiversity through bioinformatics”. Amount: $10,000 2016 - 2017 CUNY Center for Translational and Basic Research Pilot Award. Project Title: \"Democratizing access to bioinformatics computing for health disparities research”. Amount: $78,000 2015 - 2016 National Institutes of Health. Project Title: “Expanding Infrastructure and Services of CUNY-CTBR Bioinformatics and Genomics Core”. Amount: $123,832 2015 - 2017 Weill Cornell Medical College, Clinical and Translational Science Center Pilot Award. Project Title: \"Cross-platform, scalable Science as a Service (SciaaS) infrastructures for NGS data analysis”. Amount: $110,660 2014 - 2016 City University of New York. “Faculty startup award”. Amount $100,000 2014 - 2015 National Institute",
  "content_length": 28958,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:11"
}