{
  "name": "Kopo M. Ramokapane",
  "homepage": "https://www.bristol.ac.uk/people/person/Marvin-Ramokapane-c032839d-42cf-42c0-939c-e1a2e1cc3ba0",
  "status": "success",
  "content": "Dr Marvin Ramokapane - Our PeopleBackDr Marvin RamokapaneMEng, BEng, PhDExpertiseUsable SecuritySecurity ErgonomicsHuman FactorsSmart home devicesCloud deletionCurrent positionsLecturerSchool of Computer ScienceContactmarvin.ramokapane@bristol.ac.ukMerchant Venturers BuildingWoodland RoadCliftonBristol, BS8 1UB +44 117 455 8840Press and mediaMany of our academics speak to the media as experts in their field of research. If you are a journalist, please contact the University’s Media and PR Team:+44 117 428 2489press-office@bristol.ac.ukEdit profileResearch interestsResearcher in cyber security and privacy.Leveraging on my technical and socio-technical research methods I aim to understand how users perceive and use technology with regards to security and privacy. I am particularly interested in three areas, (1) usability, (2) privacy, and (3) trust. My research on usability focuses on understanding the usability practices and the challenges faced by users and operators alike when enforcing security and privacy measures. I aim to understand the challenges and propose viable solutions. Regarding privacy, I am interested in understanding users’ perceptions and norms around the use of smartphones and smarthome devices. My research on trust focuses on understanding the factors that engender trust in various applications such as peer to peer electricity trading platforms.Projects and supervisionsResearch projectsEquitable PrivacyAwais Rashid, Genevieve Liveley, Marvin Ramokapane, Nirav Ajmeri, Rui Huan, Nikhil PatnaikPrincipal InvestigatorAwais RashidRoleCo-InvestigatorDescriptionDigital technologies are becoming pervasive in society, from online shopping and social interactions through to finance, banking, transportation. With a future vision of smart cities, driven by a real-time, data-driven,…Read more of project descriptionManaging organisational unitDates01/09/2022 to 28/02/2026RUNNINGREPHRAIN: REsearch centre on Privacy, Harm Reduction and Adversarial INfluence onlineAwais Rashid, Marvin Ramokapane, Partha Das Chowdhury, Richard Owen, Asma Vranaki, Katharina Burger, Claudia Peersman, Minhao Zhang, Erik Van De SandtPrincipal InvestigatorAwais RashidRoleResearcherDescriptionThe REsearch centre on Privacy, Harm Reduction and Adversarial INfluence online (REPHRAIN) will bring together the UK's substantial academic, industry, policy and third sector capabilities to address the current tensions…Read more of project descriptionManaging organisational unitDates01/10/2020 to 31/08/2024FINISHEDHousehold-Supplier Energy MarketRuzanna Chitchyan, Awais Rashid, Barney Craggs, Marvin RamokapanePrincipal InvestigatorRuzanna ChitchyanRoleResearcherDescriptionHave you noticed that ever more wind turbines appear in the countryside? And more and more solar panels are installed on the houses on your route from work to home?…Read more of project descriptionManaging organisational unitDates01/10/2017 to 31/03/2020FINISHEDThesis supervisionsCultivating ComplianceAsma A F AlshareefSupervisorsMarvin Ramokapane, Barney CraggsPublicationsRecent publications16/06/2025Ownership and Gatekeeping vs. Safeguarding and ConsentRui Huan, et al.2025 IEEE Symposium on Security and Privacy (SP)Conference contributionPublished15/04/2025Work in ProgressKonstantina Fotari, et al.2025 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW)Conference contributionSubmitted01/07/2025\"Erasing the Echo''Cheng Cheng, Marvin RamokapaneProceedings on Privacy Enhancing TechnologiesArticlePublished30/10/2024Community security championsPartha Das Chowdhury, et al.2024 IEEE Secure Development Conference (SecDev)Conference contributionPublished12/08/2024Unveiling the Hunter-GatherersPriyanka K Badva, et al.SEC '24Conference contributionPublishedView all publicationsRelated peopleProfessor Awais RashidProfessor of Cyber SecuritySchool of Computer ScienceDr Matthew EdwardsSenior LecturerSchool of Computer ScienceDr Claudia PeersmanResearch FellowSchool of Computer Science Dr Partha Das ChowdhuryLecturerSchool of Computer ScienceMiss Emily GodwinSenior Research AssociateUniversity of Bristol Business SchoolFeedback",
  "content_length": 4143,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:11"
}