{
  "name": "Kostas Magoutis",
  "homepage": "https://www.csd.uoc.gr/~magoutis",
  "status": "success",
  "content": "Kostas Magoutis research teaching publications students service distinctions and awards about/contact Kostas Magoutis Professor and Chair Computer Science Department University of Crete Heraklion, Crete, Greece Information for prospective MSc/PhD students: The University of Crete graduate programs in Computer Science invite applications from exceptional candidates twice a year (deadlines March 31 and October 31). Research My research interests revolve around the following areas: Distributed computer systems Autonomic service management Quantum-enhanced computing systems Scalable event-based systems, Internet of Things (IoT) Cloud computing, lifecycle management of multi-cloud applications Read more about my research This is a partial list of projects I have participated in over the years: The QUADS project (2025-2028) funded by a H.F.R.I faculty grant, aims for quantum-enhancement of adaptive computer systems at different system scales The GreenInCities project (2024-2027) funded by Horizon Europe aims for urban regeneration through participatory and sustainable greening solutions for all The STREAMSTORE project (2020-2023) funded by a H.F.R.I. faculty grant, improves the state of the art in elastic, scalable, and highly available stateful stream processing systems The Interconnected Smart Cities for Greece 2.0 (2023-2025) funded by national and EU agencies aims to develop a federated platform that interconnects IoT data silos across smart cities The SmartCityBus project (2020-2023) developed an IoT-driven intelligent public transportation platform The SocioCoast project (2021-2023) funded through Interreg V-A Greece-Cyprus contributes to better quality coasts via the use of crowdsourcing and big-data technologies The Proximiot project (2019-2023) developed a smart IoT-driven proximity marketing platform The ProxiTour project (2018-2022) developed a smart IoT-driven personalized touring platform The PaaSage European FP7 collaborative project (2012-2016) delivered an open and integrated platform to support model based lifecycle management of Cloud applications The ScaleWorks FP7 project (2009-2011) contributed to the improvement of the entire lifecycle of scalable distributed systems from design to engineering, prototyping, deployment, and operation, on contemporary cost-effective high-performance platforms The Galapagos project (2006-2009) at IBM Research contributed a model-based approach to distributed systems management with a focus on data and storage. Research on the structure and performance of the Direct Access File System at Harvard (2000-2004) received two best paper awards and helped shape industrial standardization efforts around direct-access (RDMA) interconnects Teaching (full list) University of Crete HY-452 - Introduction to the Science and Technology of Services (Fall 2025) University of Crete HY-559 - Infrastructure Technologies for Large-Scale Service-Oriented Systems (Fall 2025) University of Crete HY-590.45 - Modern Topics in Scalable Storage Systems (Spring 2026) Recent Publications (full list) Proportional Fairness and Isolation for Serverless Applications over FaaS Platforms George Kelantonakis, Fallia Kourou and Kostas Magoutis In Proceedings of the 16th ACM/SPEC International Conference on Performance Engineering (ICPE'25), May 5-9, Toronto, Canada (pdf) Model Predictive Control of Internet Servers using Quantum Annealing Efthymios Papageorgiou, George T. Stamatiou and Kostas Magoutis In Proceedings of 5th IEEE International Conference on Autonomic Computing and Self-Organizing Systems (ACSOS'24), September 16-20, 2024, Aarhus, Denmark (pdf) Amoeba: Aligning Stream Processing Operators with Externally-Managed State Antonis Papaioannou and Kostas Magoutis in Proceedings of 14th ACM/IEEE International Conference on Utility and Cloud Computing (UCC 2021), December 6-9, 2021, Leicester, UK (pdf) Decision-Making Approaches for Performance QoS in Distributed Storage Systems: A Survey Flora Karniavoura and Kostas Magoutis in IEEE Transactions on Parallel and Distributed Systems (TPDS), Volume 30, Issue 8, pp. 1906-1919, August 2019 (pdf) Incremental elasticity for NoSQL data stores Antonis Papaioannou and Kostas Magoutis in 36th IEEE International Symposium on Reliable Distributed Systems (SRDS 2017), Hong Kong, China, September 26-29, 2017 (pdf) ACaZoo: A Distributed Key-Value Store based on Replicated LSM-Trees Awarded Best Student Paper Panagiotis Garefalakis, Panagiotis Papadopoulos and Kostas Magoutis in 33rd IEEE Symposium on Reliable Distributed Systems (SRDS 2014), Nara, Japan, October 6-9, 2014 (pdf). CEC: Continuous Eventual Checkpointing for Data Stream Processing Operators Zoe Sebepou and Kostas Magoutis In Proceedings of 41st IEEE/IFIP International Conference on Dependable Systems and Networks (DSN 2011), Hong Kong, China, June 27-30, 2011 (pdf). Further information about my publications is also available online at DBLP and Google Scholar. I have also authored a number of patents. Students and Alumni I consider myself fortunate to collaborate or have collaborated with the following outstanding students Stratos Ntallaris, PhD candidate, MSc (2022) Efthimios Papageorgiou, PhD candidate, MSc (2025), BSc (2023) Petros Tsalikis, MSc candidate Alexandros Angourakis, MSc (2025) Stavros Petrakis, BSc (2025) Yannis Michelidakis, BSc (2025) Giorgos Vasarmidis, BSc (2025) Herodotos Apostolou, BSc (2023) Giorgos Kelantonakis, MSc (2023), BSc (2021) Stefanos Kalogerakis, MSc (2023) Fallia Kourou, MSc (2023) Nikos Papadakis, MSc (2022) Dimitris Kourgiantakis, BSc (2023) Kostas Agapidis, BSc (2022) Antonis Papaioannou, PhD (2021) Margianna Bofili-Arvaniti, MSc (2021) Giorgos Amiridis, BSc (2021) Aris Chronarakis, MSc (2019) Konstantinos Nakas, BSc (2019) Panagiotis Goutis, BSc (2019) Theopisti Kokoviadou, BSc (2019) Ilias Haldeakis, BSc (2019) Sotiris Lemousias, BSc (2019) Michalis Sotiriou, MSc (2019) Dimitris Valekardas, MSc (2018) Giorgos Mitaros, BSc (2018) Nikos Zois, BSc (2018) Thomas Dimos, BSc (2018) Eudoxos Bekas, MSc (2017) Eirini Micheli, PhD work (2015-2017) Orfeas-Ioannis Zafeiris, BSc (2017) Polydoros Argyrokastritis, BSc (2017) Giorgos Gremis, BSc (2017) Nikolaos Patikas, BSc (2016) Recent service (full list) 27th ACM/IFIP International Middleware Conference (MIDDLEWARE 2026) (TPC), November 30-December 4, 2026, Tarragona, Spain. 35th ACM International Symposium on High-Performance Parallel and Distributed Computing (HPDC 2026) (TPC), July 13-16, 2026, Cleveland IEEE International Conference on Big Data (IEEE BigData 2025) (TPC), December 8-11, 2025, Macau SAR, China. 25th IEEE International Conference on Data Mining (ICDM 2025) (TPC), November 12-15, 2025, Washington DC, USA. 19th ACM International Conference on Distributed and Event-based Systems (DEBS 2025) (TPC), June 10-13, 2025, Gothenburg, Sweden. IEEE International Conference on Big Data (IEEE BigData 2024) (TPC), December 15-18, 2024, Washington DC, USA. EAI International Conference on Performance Evaluation Methodologies and Tools (VALUETOOLS'23) (TPC), September 6-7, 2023, Crete, Greece. IEEE International Conference on Quantum Software (QSW 2024) (TPC), 2024, Shenzhen, China. IEEE International Conference on Big Data (IEEE BigData 2023) (TPC), December 15-18, 2023, Sorrento, Italy. 29th ACM Symposium on Operating Systems Principles (SOSP 2023) (Heavy TPC), October 23-26, 2023, Koblenz, Germany. IEEE International Conference on Quantum Software (QSW 2023) (TPC), July 2-8, 2023, Chicago, IL, USA. IEEE International Conference on Quantum Software (QSW 2022) (TPC), July 11-16 2022, Barecelona, Spain. 2nd Workshop on Quantum Software Architecture (QSA, co-located with ICSA 2022) (TPC), March 12, 2022, Hawaii, USA. 25th International Conference on Principles of Distributed Systems (OPODIS 2021) (TPC), December 13-15, 2021, Strasburg, France. 40th IEEE International Symposium on Reliable Distributed Systems (SRDS 2021) (TPC), September 20-23, 2021, Chicago, USA. 40th IEEE International Symposium on Reliable Distributed Systems (SRDS 2021) (TPC), September 20-23, 2021, Chicago, USA. 40th IEEE International Symposium on Reliable Distributed Systems (SRDS 2021) (TPC), September 20-23, 2021, Chicago, USA. ACM SIGOPS European Chapter (EuroSys), Secretary (Elected 2021 for 2022-23 term; Re-elected 2023 for 2024-25 term) 21st IFIP International Conference on Distributed Applications and Interoperable Systems (DAIS 2021) (TPC), June 14-18, 2021, Valletta, Malta 39th IEEE International Symposium on Reliable Distributed Systems (SRDS 2020) (TPC), September 21-24, 2020, Shanghai, China. 15th ACM SIGOPS European Conference on Computer Systems (EuroSys 2020) (General co-Chair), April 27-30, 2020, Heraklion, Greece. Distinctions and Awards Best Paper Award, USENIX Annual Technical Conference (2002) Best Paper Award, USENIX BSDCon Conference (2002) Best Student Paper Award, 33rd IEEE Symposium on Reliable Distributed Systems (SRDS 2014) Best Paper Runner-up Award, 14th International Conference on the Internet of Things (IoT 2024) Grand Challenge Audience Award, 16th ACM International Conference on Distributed and Event-based Systems (DEBS 2022) Best Poster Award, 17th ACM SIGOPS European Conference on Computer Systems (EuroSys 2022) EU Marie Curie Intra European (IEF) Fellow (2009-2011) Three IBM Invention Plateaus for patent activities (2003-2008) IBM Research Division Technical Group Award for Outstanding Contributions (2006, 2008) USENIX Association Scholar (Sole recipient among 50 submissions worldwide) (2002-2003) Alexander S. Onassis Public Benefit Foundation Fellow (1994-95) J. William Fulbright Scholar (1993-94) About I am a Professor with the Computer Science Department, University of Crete and collaborating researcher with FORTH-ICS in Heraklion, Greece. Previously I was an Associate Professor (tenured) with the Computer Science Department, University of Crete (2020-2024), an Assistant Professor with the Department of Computer ",
  "content_length": 10605,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:13"
}