{
  "name": "Kostas Kontogiannis",
  "homepage": "http://www.softlab.ntua.gr/~kkontog",
  "status": "success",
  "content": "Kostas Kontogiannis Kostas Kontogiannis B.Sc. University of Patras , Greece M.Sc. Katholieke Universiteit Leuven , Belgium Ph.D. McGill University , Canada Welcome to my home page. I am a Professor at the Department of Electrical and Computer Engineering at the National Technical University of Athens, and an Adjunct Professor at the Department of Electrical and Computer Engineering, University of Waterloo. Please find below information about me and the research I conduct. Research Interests Software Engineering Software Analysis, Architecture & Maintenance Dynamic Analysis Services Computing Intelligent Systems Monitoring and Root Cause Analysis System Integration and Interoperability My current research interests focus on the design and development of techniques and tools for software analysis, software maintenance and, software modeling, with particular emphasis on applications that involve legacy software systems, services computing, and intelligent systems. Specific topics of interest and current work include, techniques and tools for root cause analysis, component-based software engineering, Resource-Oriented architectures, and techniques for system integration and interoperability. Curriculum Vitae Brief CV Brief Curriculum Vitae Full CV Full Curriculum Vitae Affiliations Visiting Scientist, IBM Center for Advanced Studies Research Research Member, Consortium for Software Engineering Research Awards and Patents IBM CAS Research “IBM CAS Faculty Fellow of the Year”, (2015). IBM CAS Research \"Project of the Year Award\" for the project \"Framework for the Deployment of Legacy Enterprise Services Utilizing the REST Protocol\" (2013) Decade's High Impact Paper (period 1991- 2010) for the ACM CASCON Conference paper, K.Kontogiannis, J.Martin, K.Wong, R.Gregory*, H.Muller, J.Mylopoulos. 1998, \"Code Migration Through Transformations: An Experience Report''. Most Influential Paper Award (period 2000 – 2010) in IEEE Working Conference on Reverse Engineering for the paper, Balazinska, E. Merlo, M. Dagenais; B. Lague, K. Kontogiannis, 2000, \"Advanced Clone-analysis to Support Object-oriented System Refactoring\". IBM Fellowship Award (2004). IBM University Partnership Awards (2000, 2001, 2002) Canada Foundation for Innovation (1998, 1999, 2000). Member, IEEE Distinguished Visitors Program (2003-2005). University of Waterloo Performance Award (2000). IBM Canada Ltd. US 20080276229 A1, “INCREMENTAL MODEL REFINEMENT AND TRANSFORMATION IN GENERATING COMMERCE APPLICATIONS USING MODEL DRIVEN ARCHITECTURE” (with student I. Ivkovic* et.al). (2008). IBM Canada Ltd. CA 2465155 and US 20080147981 A1, “RECOMMENDATIONS FOR INTELLIGENT DATA CACHING”, (with student C. Mills, and D. Crick, M. Tang). (2008). Selected Recent Research Projects Jan. 2011 - Aug. 2015, \"Compliance Monitoring and Analysis Techniques for multi-tier Systems”, European Union, and GSRT Greece. (abstract) Nov. 2014 - Dec. 2015,“Framework for the Deployment and Use of Enterprise Services Utilizing the REST Protocol and Software Engineering in ROH (Resource Oriented Hypermedia) for Interaction Model” (IBM CAS Research). (abstract) Jan. 2010 - Dec. 2014 ,“Framework for the Integration of Enterprise Services Using the REST Protocol” (IBM CAS Research). (abstract) Jan. 2009 - Feb. 2012: “Software Analysis and Monitoring Techniques for Bridging the Gap Between Business Processes and Run-time Models in Service Oriented Applications”, Computer Associates (CA), UK. (abstract) Jan. 2006 - Dec. 2011: “Logging, Monitoring and Diagnosis Systems for Enterprise Software Applications”, Computer Associates (CA), US. (abstract) Jan. 2007 - Dec. 2009: “Requirements Driven Model Refactoring and Evolution for Service Oriented Systems”, IBM, Canada. (abstract) Jan. 2006 - Jan 2008: \"Service Discovery and Composition in Carrier Applications, NORTEL, (abstract) Teaching ECE 3.4.56.9 Software Engineering - NTUA ECE 3.4.57.9 Advanced Topics in Data Base Systems - NTUA ECE 3.4.27.7 Artificial Intelligence - NTUA ECE 3.4.03.2 Programming Techniques - NTUA ECE 675 DataBase Technologies and World Wide Web - NTUA ECE 687 Software Analysis and Reengineering - NTUA ECE MBA Program Enterprise Information Systems - NTUA Completed Theses Ph.D Theses Michael Athanasopoulos, Ph.D. Thesis, “Adaptation of Procedural Services to REST Architecture”, 2015. George Chatzikonstantinou, Ph.D. Thesis, “Goal-Driven Analysis and Monitoring of Multi-Layer Architecture Systems”, 2015 Hamzeh Zawawy, Ph.D. Thesis, \"Requirement-based Root Cause Analysis Using Log Data\", 2012. Ali Razavi, Ph.D. Thesis, \"Incremental Model Synchronization\", 2012. Igor Ivkovic, Ph.D. Thesis, \"Model Synchronization for Software Evolution\", 2011. Ying Zou, Ph.D. Thesis, “Migration of Procedural Systems to Object Oriented Platforms'', University of Waterloo , Department of Electrical and Computer Engineering, 2003. Ladan Tahvildari, Ph.D. Thesis, “Quality-Driven Object-Oriented Re-engineering Framework”, University of Waterloo , Department of Electrical and Computer Engineering, 2003. Kamran Sartipi, Ph.D. Thesis, “Software Architecture Recovery based on Pattern Matching”, University of Waterloo , School of Computer Science , 2003. M.A.Sc Theses 1.    Maria-Ioanna Attarian, M.A.Sc. Thesis, \"An Analysis and Reasoning Framework for Project Data Software Repositories\", 2011 2.    Tasos Livogiannis, M.A.Sc. Thesis, \"Policy-Driven Framework for Static Identification and Verification of Component Dependencies\", 2011. 3.    Ahmed Wasfy, M.A.Sc. Thesis, \"Log Event Filtering Using Clustering Techniques\", 2009 4.    Alfred Wong, M.A.Sc. Thesis, \"Policy Driven Software Monitoring\". 2007. 5.    Nikos Giannopoulos, M.A.Sc. Thesis, \"Model Driven Service Description and Discovery Framework for Carrier Applications\", 2007. 6.    Ali Razavi. M.A.Sc. Thesis, \"Quality based Orchestration of Web Services”, 2006. 7. Majed El-Shawa, M.A.Sc. Thesis, \"View-points Based, Value-driven Entreprise Knowledge Management\", 2005. 8. Yu Ping, M.A.Sc Thesis, “Migration of Legacy Web Applications to New Enterprise Java Environments”, University of Waterloo , Department of Electrical and Computer Engineering, 2004. 9.    Faryaaz Kassam: M.A.Sc Thesis, “Quality and Constraint Driven Workflow Composition”, University of Waterloo , Department of Electrical and Computer Engineering, 2004. 10. Alvin Chin: M.A.Sc Thesis, “Service Invocation and Roaming in Pervasive Computing Environments”, University of Waterloo , Department of Electrical and Computer Engineering, 2004. 11. Cyrus Mills: M.A.Sc Thesis, “Analysis of Java Server Pages Source Code to Identify Caching Opportunities”, University of Waterloo , Department of Electrical and Computer Engineering, 2004. 12. Gerard Tarcisius: M.A.Sc Thesis, “A Framework for Context-Aware and Template-Based Workflows”, University of Waterloo , Department of Electrical and Computer Engineering, 2004. 13. Reihan Al-Ekram: M.A.Sc Thesis, “Source Code Modularization Using Lattice of Concept Slices”, University of Waterloo , Department of Electrical and Computer Engineering, 2004. 14. Andrew Roszko: M.A.Sc Thesis, “A Framework for Next Generation Enterprise Application Integration”, University of Waterloo , Department of Electrical and Computer Engineering, 2004. 15. Michael Bannon: M.A.Sc Thesis, “Persona Based Data Utilization”, University of Waterloo , Department of Electrical and Computer Engineering, 2004. 16. Kelvin Cheung: M.Sc Thesis ``Design and Implementation of a Web-Service Integration System for Supporting Collaborative Activities'', University of Waterloo , Dept. of Electrical & Computer Engineering, 2002 17. Frankie Poon: M.Sc Thesis `` Approximate Matching and Structural Modeling for Web Data Integration'', University of Waterloo , Dept. of Electrical & Computer Engineering, 2001 18. Derek Rayside: M.Sc Thesis ``A Generalized delta-Wavefront Graph Traversal Algorithm for Data Flow Analysis'', University of Waterloo , Department of Electrical & Computer Engineering, 2001. 19. Evan Mamas: M.Sc Thesis ''Design and Implementation of an Integrated Software Maintenance Environment'', University of Waterloo , Department of Electrical & Computer Engineering, 2000. 20. Richard Gregory: M.Sc Thesis ''A Customizable and Extensible Distributed Service Integration Environment'', University of Waterloo , Department of Electrical & Computer Engineering, 2000. 21. Prashant Patil : M.Sc Thesis ''Migration of Procedural Systems to Object Oriented Architectures'', University of Waterloo , Department of Electrical & Computer Engineering, 1999. 22. Christy Lu: M.Sc Project ''A C to RPG Program Transformation Tool'', University of Waterloo , Department of Electrical & Computer Engineering, 1998. 23. Sridhar Muthanna: M.Sc. Research Thesis ''Assessing Maintainability of Industrial Software Systems Using Design Level Metrics'', University of Waterloo , Department of Systems Design Engineering, 1998. Selected Recent Publications Refereed Book Chapters “Mining Software Logs for Goal-Driven Root Cause Analysis”, H. Zawawy, S. Mankovskii, K. Kontogiannis, J. Mylopoulos, 2015. In book “The Art and Science of Analyzing Software Data”, eds. C. Bird, T. Menzies, T. Zimmermann, Waltham: Morgan Kaufmann, 2015, pp. 519-554. “Considerations of Adapting Service-offering Components to RESTful Architectures”, M. Athanasopoulos, K. Kontogiannis, 2012. In book “Migrating to SOA and Cloud Environments: Challenges in Service Oriented Architecture and Cloud Computing Environments”, eds. A. D. Ionita, G. Lewis and M. Litoiu, IGI Global (2013). (pdf) “Techniques for Software Maintenance”, Kontogiannis, 2011. In Encyclopedia of Software Engineering. Taylor and Francis Publishers, 2011. (pdf) “Software Architecture Analysis and Reconstruction”, K. Sartipi, K. Kontogiannis. In book \"Managing Corporate Information Systems Evolution and Maintenance\". Idea Group Publishing, Hershey , PA , USA . pp.175-183, 2004. (pdf) “Re-engineering Legacy Systems to Web-enabled Environments\", Y. Zo",
  "content_length": 33994,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:14"
}