{
  "name": "Kostas Stathis",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/kostas-stathis_7f422719-142b-409c-97a8-f3efd9113f6d.html",
  "status": "success",
  "content": "Kostas Stathis - Royal Holloway Research Portal View Scopus Profile Kostas Stathis, Professor of Artificial Intelligence Professor Professor, Department of Computer ScienceCentre for Intelligent SystemsCentre for Programming Languages and Systems https://orcid.org/0000-0002-9946-4037 Phone+44 1784 443698EmailKostas.Stathisrhul.acuk TW20 0EX Personal profile Personal profileI serve as the Vice-Dean for Research and Knowledge Exchange at the School of Engineering, Physical and Mathematical Sciences, and as the Interim Director of the new Centre for AI and Skills.Research interestsMy research lies at the intersection of artificial intelligence, distributed systems, and software engineering, with a focus on developing autonomous, cognitively capable, and socially aware systems. I study how intelligent agents reason, coordinate, and learn within complex environments - both virtual and real - to support robust, explainable, and ethically aligned decision-making. My current research interests include: Cognitive architectures and autonomous agent models for adaptive and explainable behaviour; Knowledge representation, reasoning, and cognition in distributed intelligent systems; Game-theoretic and strategic interaction models for learning and decision-making under incomplete knowledge, limited resources, and dynamic worlds; Multi-agent learning and coordination strategies for decentralised intelligence; Organisation, governance, and regulation in artificial societies and human-AI ecosystems; Programmable multi-agent environments and simulation platforms for large-scale experimentation and deployment. I apply these methods to domains such as digital markets, computational law and regulation, autonomous e-services, and game-theoretic experimentation. For more details, visit my lab's page: DICE Lab. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 57 Conference contribution 32 Article 24 Paper 6 Other contribution 13 More 4 Editorial 3 Preprint 2 Scholarly edition 2 Chapter 1 Entry for encyclopedia/dictionary 1 Doctoral Thesis Research output per year Research output per year Adaptive Strategy Templates using Deep Reinforcement Learning for Multi-Issue Bilateral NegotiationBagga, P., Paoletti, N. & Stathis, K., 28 Mar 2025, In: Neurocomputing. 623, 16 p., 129381.Research output: Contribution to journal › Article › peer-review Open Access Approximating Human Strategic Reasoning with LLM-Enhanced Recursive Reasoners Leveraging Multi-agent HypergamesTrencsenyi, V., Mensfelt, A. & Stathis, K., 23 Mar 2025, (Accepted/In press) The 26th International Workshop on Multi-Agent-Based Simulation.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 13 Downloads (Pure) DeCoRA: Definition and Context Reasoning in ArgumentationMai, N.-D., Le, X.-B., Vuong, T.-H.-Y., Nguyen, H.-T., Stathis, K. & Satoh, K., 24 Apr 2025, (Accepted/In press) The 20th International Conference on Artificial Intelligence and Law (ICAIL'25).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 39 Downloads (Pure) Explaining Teleo-reactive Strategic BehaviourShahid, N. S., Mensfelt, A. & Stathis, K., 28 Jan 2025, 2024 IEEE 36th International Conference on Tools with Artificial Intelligence (ICTAI). IEEE Computer Society, p. 905-912 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 45 Downloads (Pure) LLMs for Legal Reasoning: A Unified Framework and Future PerspectivesNguyen, H.-T., Fungwacharakorn, W., Zin, M. M., Goebel, R., Toni, F., Stathis, K. & Satoh, K., Sept 2025, In: Computer Law and Security Review. 58, 106165.Research output: Contribution to journal › Article › peer-review Open Access View all 132 research outputs Projects 13 Finished Projects per year iRealHAT-PEGA: Informed real-time human-agent teaming through patterns of eye gaze allocationDurant, S. (PI) & Stathis, K. (CoPI)Air Force Office of Scientific Research1/11/22 → 31/10/25Project: Research Attention guidance for multi-task displays using human-like cognitive assistantsDurant, S. (PI) & Stathis, K. (CoI)Imperial College London17/03/20 → 30/09/20Project: Research Justice for the Registrant: Transforming the fitness to practise process through the use of AI: Testing the modelJago, R. (PI), van der Gaag, A. (CoI) & Stathis, K. (CoI)1/02/20 → 31/03/20Project: Research An investigation into the use of artificial intelligence in regulatory decision making in complaints about nurses in the US, UK and Australia Jago, R. (PI), van der Gaag, A. (PI), Stathis, K. (CoI), Denney, D. (CoI) & Webster, M. (CoI)National Council of State Boards of Nursing1/11/19 → 1/03/21Project: Research COMMODITY12: Extension of COntinuous Multi-parametric and Multi-layered Analysis Of DIabetes TYpe 1 & 2Stathis, K. (PI)1/03/14 → 1/09/15Project: Research View all 13 projects Activities 2 Participation in a conference 2 Oral presentation 1 Peer review of manuscripts 1 Membership of public/government advisory/policy group or panel 1 More 1 Invited talk Activities per year Strategic AI: Bridging Game Theory and Multi-Agent Systems via AutoformalizationTrencsenyi, V. (Speaker), Stathis, K. (Speaker) & Mensfelt, A. (Speaker)30 Jun 2025 → 4 Jul 2025Activity: Talk, presentation or media contribution › Oral presentation Strategic AI: Bridging Game Theory and Multi-Agent Systems via AutoformalizationMensfelt, A. (Speaker), Stathis, K. (Speaker) & Trencsenyi, V. (Speaker)20 May 2025Activity: Talk, presentation or media contribution › Oral presentation The 36th International Conference on Tools with Artificial IntelligenceShahid, N. (Organiser) & Stathis, K. (Organiser)Oct 2024Activity: Participating in or organising an event › Participation in a conference Artificial Intelligence (Journal)Stathis, K. (Editor)2024 → …Activity: Publication peer-review and editorial work › Peer review of manuscripts Enabling decentralised decision-making in AI - an agent environments perspective.Stathis, K. (Speaker)12 Oct 2018Activity: Talk, presentation or media contribution › Invited talk View all 7 activities",
  "content_length": 6738,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:14"
}