{
  "name": "Kostas Daniilidis",
  "homepage": "http://www.cis.upenn.edu/~kostas",
  "status": "success",
  "content": "Kostas Daniilidis - Κώστας Δανιηλίδης - computer vision and robotics Kostas Daniilidis Ruth Yalom Stone Professor GRASP Laboratory Department of Computer and Information Science School of Engineering and Applied Science University of Pennsylvania and Archimedes, Athena Research Center, Greece. Papers: My publications in Google Scholar sorted by citation or by year, and in DBLP, my short bio, high res photo, and 2024 CV. PhD Students: Boshu Lei, Tim (Yunzhou) Song, Matthew Leonard, Ioannis Asmanis, Agelos Kratimenos, Yufu Wang, Anthony Bisulco (main advisor Pratik Chaudhari), Katrina Ashton, Stefanos Pertigkiozoglou, Evangelos Chatzipantazis, Vassiliki Vasileiou @Archimedes, Evangelos Antypas @Archimedes. Postdocs: Daniel Gehrig Alumni PhDs: Jiahui Lei (Berkeley Postdoc), Wen Jiang (Waymo), Ziyun (Claude) Wang (Johns Hopkins University faculty), Yinshuang Xu (Apple), Kenneth Chaney (UPenn PARCC), Kendall Queen (Asylon Robotics), Oleh Rybkin (Berkeley Postdoc), Bernadette Bucher (University of Michigan faculty, co-advised with Nik Matni), Karl Schmeckpeper (BDAII), Wenxin Liu (LFI, co-advised with Vijay Kumar), Nikos Kolotouros (Google) , Stephen Phillips (BDAII), Carlos Esteves (Google), Christine Allen-Blanchette (Princeton University faculty), George Pavlakos (University of Texas Austin faculty), Alex Zhu(Waymo), Spyridon Leonardos (Chicago Trading) Monroe Kennedy III (Stanford University faculty, co-advised with Vijay Kumar), Jason Owens (Aurora), Mabel Zhang (OSRF), Drew Jaegle (Captions.AI), Cody Phillips (Agile AI), Nikolay Atanasov (UC San Diego faculty, co-advised with George Pappas), Menglong Zhu (DJI), Mayank Bansal (Amazon), Roy Anati (Google). Alexander Patterson IV (SightLogix) Oleg Naroditsky (Apple), Alexander Toshev (Apple), Ankita Kumar, (Oracle), Nima Moshtagh (JHU APL, co-advised with Ali Jadbababai). Ameesh Makadia (Google), Volkan Isler (U. of. Texas Austin faculty, co-advised with Sampath Kannan), Christopher Geyer (T-Reqs), Adnan Ansar (JPL/NASA), Weichuan Yu (HKUST faculty, co-advised with Gerald Sommer at Kiel University). Alumni Postdocs: Diego Patino (UT Arlington faculty) Georgios Georgakis (NASA JPL), Marc Badger (Aescape), Bernd Pfrommer, Xiaowei Zhou (Zhejiang University, faculty), Roberto Tron (Boston University faculty), Luis Puig (Geomagical), Konstantinos Derpanis (York University faculty), Davide Scaramuzza (University of Zurich faculty), Philippos Mordohai (Stevens Inst. of Technology faculty), Jean-Philippe Tardif (CMU/NREC), Irene Cheng (U. of Alberta faculty), href=\"http://www.cis.upenn.edu/~carceron\">Rodrigo Carceroni(Google Labs), Rahul Swaminathan (Deutsche Telekom Labs), href=\"http://www.cis.upenn.edu/~zabulis\"> Xenophon Zampoulis (FORTH/CSI), Joao Barreto (University of Coimbra faculty), Thomas Buelow (Philips Research), Jane Mulligan (Context Data Analytics), Alumni Associates: Yanis Pavlidis (Google), Nikhil Kelshikar (CISCO), Teaching: Fall 2006, 2007, 2009, 2010, 2011, , 2012, 2013, 2018, 2019, 2020, 2021, 2022, 2023, 2024: CIS580 Machine Perception Spring 2021, 2022: CIS 107/VLST209: Visual Culture through the Eye of the Computer Spring 2014, 2015, 2016, 2017, 2018 MEAM 620 with Vijay Kumar, Spring 2007, 2008, Fall 2008, 2009, 2010, 2011, 2012, 2014, 2019, 2020: CIS121 Data Structures Fall 2016, 2015, 2004, Fall 2003, Spring 2002, Fall 2002, : CSE390 Robotics. Fall 2000, 1999, 1998: CSE240 Introduction to Computer Architecture. Spring 2004, 2001: CIS 700 Special Topics in Machine Perception Spring 2003, 2000, 1999: CIS 680 Advanced Topics in Machine Perception Education: PhD, 1992, University of Karlsruhe with Hans-Hellmut Nagel. My advisor's advisor was Wolfgang Paul Nobel Laureate Physics 1989 (1913-1993). Wolfgang Paul's advisor was Hans Kopfermann (1895-1963). Kopfermann's advisor was James Franck (1882-1964) Nobel Laureate 1925, Franck's advisor was Emil Warburg (1846-1931). Emil Warburg's advisor was Heinrich Gustav Magnus (1802-1870). Diploma (Integrated Master's equivalent) in EE, 1986, National Technical University of Athens Address: Department of Computer and Information Science, University of Pennsylvania, 3330 Walnut Street, Levine Hall 472, Philadelphia, PA 19104. How to reach GRASP Acknowledgments: NSF NCS-FO 2124355, NSF FRR 2220868, NSF IIS-RI 2212433, NSF TRIPODS 1934960, NSF CPS 2038873, ARL DCIST CRA W911NF-17-2-0181, ARO MURI W911NF-20-1-0080, and ONR N00014-22-1-2677.",
  "content_length": 4434,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:13"
}