{
  "name": "Koushik Sinha",
  "homepage": "https://www2.cs.siu.edu/~ksinha",
  "status": "success",
  "content": "Koushik Sinha Koushik Sinha Associate Professor School of Computing Southern Illinois University Carbondale, IL, USA 62901 Phone: +1 618-453-3922 Fax: +1 618-453-6044 E-mail: koushik.sinha@cs.siu.edu Home Page Teaching & Research Professional Activities Publications Research Projects Academic Qualification Ph. D. from Jadavpur University, India in 2007 (Major: Computer Science). MS from Clemson University, USA in 2003 (Major: Computer Science) B. Tech. from Kalyani Government Engineering College, Kalyani University, India in 2001 (Major: Computer Science) Honors and Professional Memberships Senior Member, IEEE Grand Prize Winner of 9th Open Source Software (OSS) World Challenge for AIDR, 2015 N. V. Gadadhar Memorial Award from the Institution of Electronics and Telecommunication Engineers (IETE), 2011 Young Scientist Award from the Indian Science Congress Association (ISCA), 2009 Member, ACM Short Bio Koushik Sinha is currently an Associate Professor in the School of Computing at Southern Illinois University, Carbondale. He leads the Complex Networks and Applications research group at SIU, Carbondale. He is the co-author of the book Wireless Networks and Mobile Computing published by CRC Press, Taylor and Francis Group, USA in 2015. Prior to joining SIU, he was with the Social Computing Group of Qatar Computing Research Institute, Qatar from 2013 to 2015. Previously, he was a Research Scientist at Hewlett-Packard Labs. He also spent 7 years with Honeywell as a Lead Research Scientist. He received the Young Scientist Award from the Indian Science Congress Association (ISCA) in 2009 and the N. V. Gadadhar Memorial Award from the Institution of Electronics and Telecommunication Engineers (IETE) in 2011. He was the IEEE ANTS (the only conference in India which is financially sponsored by IEEE Communications Society) TPC Co-chair in 2016 and 2017. He is also the General Co-Chair for IEEE ANTS 2018. He is a Senior Member of the IEEE. His current research focus is in the areas of 5G and Beyond 5G Networks, Challenged Networks, Wireless Sensor Networks, IoT and Edge Computing. Download CV SIU SIU Computer Science SIU Graduate School",
  "content_length": 2162,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:17"
}