{
  "name": "Kovila P. L. Coopamootoo",
  "homepage": "https://www.kcl.ac.uk/people/kovila-coopamootoo",
  "status": "success",
  "content": "Kovila Coopamootoo | King's College London Skip to main contentDr Kovila Coopamootoo Lecturer in Computer ScienceResearch interestsComputer scienceContact detailskovila.coopamootoo@kcl.ac.ukBiographyKovila is a Lecturer (Assistant Professor) in Computer Science within the Cyber Security Group at King’s College London. Her research is at the intersection of privacy, security, AI and human-computer interaction, with a keen interest in disadvantaged, vulnerable and marginalised user communities. Her research has been published at top-tier venues. Prior to joining King’s, Kovila was an Academic Track Research Fellow at the Secure & Resilient Systems Group at Newcastle University. She obtained her PhD in the area of usable privacy at Cranfield University (Defence & Security campus in Shrivenham), her MSc Information Security with distinction, at Royal Holloway University of London and her BEng Computer Science & Engineering with first class honours, at the University of Mauritius. Research interests Privacy Cybersecurity Usable privacy & security Human-centred AI Safe and equitable online experiences PhD supervision Kovila is on the lookout for PhD students across her research interests, including across user communities and technology contexts. Interested candidates are invited to email her a CV, short research proposal and previous publications. Further information Personal website Google Scholar PublicationsResearchResearchKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Security HubThe Security Hub consolidates the research related to securityHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.CybersecurityThe group studies design, modelling, analysis, verification and testing of networks and systems.NewsNews15 August 2023Online safety tech failing women – despite them being most at riskWomen are less likely to protect themselves online because current safety advice is not inclusive of their needsTechnology & Science08 March 2023International Women's Day 2023: Transforming technology for gender equalityIn recognition of the United Nation’s 2023 International Women’s Day theme celebrating innovation and technology for gender equality, we shine a light on some...Arts & CultureHealthBusiness & FinanceInternationalSocietyTechnology & Science26 August 2022\"I feel invaded, annoyed, anxious\" - internet users' tracking experience and protective actions: A Privacy Gender GapHow internet users feel about trackingTechnology & ScienceEventsEvents10DecAnnual Informatics Schools Lecture: Cybersecurity and privacy, it’s everyone’s business10 December 2025 15:15 to 18:00 An engaging computer science lecture for secondary students, by Dr Kovila Coopamootoo.FeaturesFeatures18 December 2024Unlocking a path into computer science for young women and non-binary studentsThis autumn, the Department of Informatics and the NMES Faculty Outreach Team ran a first-of-its-kind online outreach programme for female and non-binary...Technology & Science25 July 2024Students welcomed to King's for first ever STEM work experience week30 students from secondary schools across London joined the Faculty of Natural, Mathematical & Engineering Sciences (NMES,) for an interactive week exploring...Technology & Science02 August 2024Six things we can do now to keep women safe onlineDr Kovila Coopamootoo examines how online safety guidance is failing women - and how we can fix it.Technology & SciencePublicationsResearchNewsEventsFeaturesResearchKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Security HubThe Security Hub consolidates the research related to securityHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.CybersecurityThe group studies design, modelling, analysis, verification and testing of networks and systems.News15 August 2023Online safety tech failing women – despite them being most at riskWomen are less likely to protect themselves online because current safety advice is not inclusive of their needsTechnology & Science08 March 2023International Women's Day 2023: Transforming technology for gender equalityIn recognition of the United Nation’s 2023 International Women’s Day theme celebrating innovation and technology for gender equality, we shine a light on some...Arts & CultureHealthBusiness & FinanceInternationalSocietyTechnology & Science26 August 2022\"I feel invaded, annoyed, anxious\" - internet users' tracking experience and protective actions: A Privacy Gender GapHow internet users feel about trackingTechnology & ScienceEvents10DecAnnual Informatics Schools Lecture: Cybersecurity and privacy, it’s everyone’s business10 December 2025 15:15 to 18:00 An engaging computer science lecture for secondary students, by Dr Kovila Coopamootoo.Features18 December 2024Unlocking a path into computer science for young women and non-binary studentsThis autumn, the Department of Informatics and the NMES Faculty Outreach Team ran a first-of-its-kind online outreach programme for female and non-binary...Technology & Science25 July 2024Students welcomed to King's for first ever STEM work experience week30 students from secondary schools across London joined the Faculty of Natural, Mathematical & Engineering Sciences (NMES,) for an interactive week exploring...Technology & Science02 August 2024Six things we can do now to keep women safe onlineDr Kovila Coopamootoo examines how online safety guidance is failing women - and how we can fix it.Technology & Science(N)7.14Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 6147,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:19"
}