{
  "name": "Krishna Narayanan 0001",
  "homepage": "http://krishnanarayanan.wikidot.com",
  "status": "success",
  "content": "Krishna Narayanan Krishna Narayanan Eric D. Rubin '06 Professor in Electrical and Computer Engineering, Texas A&M University contact Create account or Sign in Welcome Page Contact Information Curriculum Vitae Research Group Teaching Publications Presentations Consulting edit this panel Research - My research interests are in the application of information theory, coding theory, machine learning, and signal processing broadly for enabling the vision of connected intelligence. A significant portion of my research has focused on building reliable communication networks and reliable storage systems in the presence of unreliable channels, components or physical media. I am interested both in the theoretical and applied aspects of research in this area. Some of our recent research has applications in 6G wireless communications, data science, data storage, and high-speed fiber-optic communications. A high level description of some of my current projects is available here. My current research projects include - (i) Re-engineering the uplink in wireless communications to support massive machine type communications and low-latency communications (ii) ML (Transformers and LLM) based design of communication systems (joint source-channel coding, revisiting non-linear estimation problems in communications through the lens of machine learning) (iii) signal processing for big data - exploring connections between sparse signal recovery and coding theory, fast algorithms for sparse recovery in high-dimensional spaces, Group testing for COVID detection (iv) analyzing graph structured data - graph neural networks, (v) coded distributed computing. My research has been funded through many external research grants, several of them from the National Science Foundation. Our research group's web page will give detailed information about my research interests, sponsors, students, collaborators, publications, preprints and recent presentations. Please visit our research page. Teaching - During Spring 2024, I will teaching a graduate course on Mathematical Methods in Signal Processing. This course is essentially a course on Mathematical Methods for Machine Learning as well. I will also be teaching an undergraduate course on Signals and Systems. Recently, I have taught courses on Advanced Wireless Communications, Probabilistic Graphical Models Probabilistic graphical models, Applied Data Science, Coding Theory, and Information Theory. I enjoy interacting with students both in the class room and in our research group. I have been an early adopter of the flipped style of teaching. My personal thoughts and statement about teaching can be found here. Service - I served as an Associate Editor for Coding Techniques for the IEEE Transactions on Information Theory from 2017-2019 and as one of the technical program co-chairs for the 2018 IEEE Information Theory Workshop. I was also elected to the board of governors of the Information Theory Society to serve from 2016-2018. I served as the area editor for the coding theory and applications area of the IEEE transactions on communications until 2012 and I was one of the Technical program chairs for the 2010 IEEE International Symposium on Information Theory (ISIT 2010)that was recently held in Austin, Texas. I have served on the editorial board of the IEEE Transactions on Wireless Communications and the IEEE Communications Letters. I have been on the technical program committee for several conferences in the past. At Texas A&M University, I served as the Director of Graduate Studies in the ECEN department from 2012-2014. Selected Honors- I was the recipient of the National Science Foundation career award, the 2022 Joint Communications Society and Information Theory society paper award, the 2006 and 2020 best paper awards from the IEEE data storage technical committee within COMSOC, the Association of Former Students university-level teaching award at Texas A&M University and the 2014 Professional Progress in Engineering award from the Iowa State University given to an outstanding alumnus under the age of 46 each year. I have given keynote lectures in Communications and Signal Processing conferences and I was one of the lecturers at the North American School on Information Theory, Australian School on Information Theory and the East Asian School on Information Theory. I was elected Fellow of the IEEE for contributions to coding theory and its applications to wireless communications and data storage. Recent News October 2024 (upcoming) - Keynote talk at the Wireless and Optical Communications conference in Hsinchu, Taiwan June 2024 - Plenary talk on \"Transformers and Large Language Models for Wireless Communications\" at SPCOM 2024 Spring 2024 - I was at the Simons Institute for Theoretical Computing as a long-term visitor Summer 2023 - LLMZip - Paper on compressing English text using Large Language Models Spring 2023 - I was a visiting Professor at Qualcomm Inc. June 2022 - Received the 2022 Joint Communications Society and Information Theory Society paper award for our paper - Vamsi K. Amalladinne, Jean-Francois Chamberland, and Krishna R. Narayanan, \"A Coded Compressed Sensing Scheme for Unsourced Multiple Access,\" IEEE Transactions on Information Theory, vol. 66, no. 10, pp. 6509-6533, October 2020. May 2022 - New responsibility as the Associate Director for Educational Initiatives at Texas A&M Institute for Data Science (TAMIDS) Received of the 2020 Data Storage Best Paper award from IEEE Comsoc for our paper D. Kim, K.R. Narayanan, and J. Ha, “Symmetric Block-wise Concatenated BCH Codes for NAND Flash Memories,” published in IEEE Transactions on Communications, October 2018 page revision: 174, last edited: 03 Aug 2024 10:47 Edit Tags History Files Print Site tools + Options Edit Sections Append Edit Meta Watchers Backlinks Page Source Parent Lock Page Rename Delete Help | Terms of Service | Privacy | Report a bug | Flag as objectionable | Update cookie settings Powered by Wikidot.com Unless otherwise stated, the content of this page is licensed under Creative Commons Attribution-ShareAlike 3.0 License Click here to edit contents of this page. Click here to toggle editing of individual sections of the page (if possible). Watch headings for an \"edit\" link when available. Append content without editing the whole page source. Check out how this page has evolved in the past. If you want to discuss contents of this page - this is the easiest way to do it. View and manage file attachments for this page. A few useful tools to manage this Site. See pages that link to and include this page. Change the name (also URL address, possibly the category) of the page. View wiki source for this page without editing. View/set parent page (used for creating breadcrumbs and structured layout). Notify administrators if there is objectionable content in this page. Something does not work as expected? Find out what you can do. General Wikidot.com documentation and help section. Wikidot.com Terms of Service - what you can, what you should not etc. Wikidot.com Privacy Policy.",
  "content_length": 7095,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:21"
}