{
  "name": "Kristian J. Hammond",
  "homepage": "http://www.mccormick.northwestern.edu/research-faculty/directory/profiles/hammond-kristian.html",
  "status": "success",
  "content": "Hammond, Kristian J. | Faculty | Northwestern Engineering More About Northwestern Engineering IN THIS SECTION Faculty DirectoryKristian J. HammondBill and Cathy Osborn Professor of Computer ScienceDirector, Master of Science in Artificial Intelligence ProgramDirector, Center for Advancing Safety of Machine Intelligence (CASMI)Contact2233 Tech DriveMudd Room 3109Evanston, IL 60208-3109847-467-1012Email Kristian HammondWebsiteC3 LabCentersCenter for Advancing Safety of Machine IntelligenceDepartmentsComputer ScienceAffiliationsMaster of Science in Artificial IntelligenceMBAi ProgramDownload CVEducationPhD in Computer Science, Yale University, New Haven, CT MS in Computer Science, Yale University, New Haven, CT BA in Philosophy, Yale University, New Haven, CT TedX Chicago: Humanizing the Machine with Language TedX Northwestern: Machine Consciousness AI at Northwestern: Partnerships with the Machine Video Series Exploring AI Safety and Harm: CASMI YouTube Channel Commentary on Recent News Events: Notes on the News SeriesResearch InterestsExpert AreasArtificial intelligenceNatural language generationNarrative GenerationConversational InterfacesThe Future of WorkRobots and JobsMachine LearningComputers and the lawComputers and educationComputers and JournalismEthics and RobotsEthics and Artificial IntelligenceComputational CreativityResearchDeveloping human capabilities onto machinesCo-founded Narrative Science, a startup that uses artificial intelligence and journalism to turn information from raw data into natural languageIntegrating Computer Science and Artificial Intelligent into all aspects of lifeSelected PublicationsPlease don't Hire a Chief Artificial Intelligence Officer, Harvard Business Review, March 29, 2017Why this Company will Help Change the Future of Artificial Intelligence, Computer World, February 8, 20175 unexpected sources of bias in artificial intelligence, Tech Crunch, December 10, 2016Artificial Intelligence: Transparency isnât Just a Trend, Computer World, January 12, 2017Ai and Cognitive Computing Systems in Financial Services. The International Institute for Analytics, September 20, 2016Conversation as Interface: the 5 Types of Chatbots, Computer World, July 13, 2016Choosing an Artificial Intelligence Solution: Start with the Business Challenge, The International Institute for Analytics, July 20, 2016How Artificial Intelligence Explains Analytics, The International Institute for Analytics, May 19, 2016Ethics and Artificial Intelligence: The Moral Compass of a Machine, Recode, April 13, 2016Teaching Machines To Avoid Our Mistakes, Recode, April 29, 2016The Intelligent Systems Eco-System,The International Institute for Analytics, April 21, 2016Donât Make Poets Become Programmers, Computer World, May 12, 2015Stop Drowning Your Data Scientists in Drudgery, Computer World, December 2, 2015Why Iâll Never Visit the Gym Without a Data Scientist, Computer World, November 9, 2015Top 3 Arguments for how Machines and Humans will Coexist in the Future, Computer World, October 26, 2015Why Artificial Intelligence is Succeeding: Then and Now, Computer World, September 12, 2015How Artificial Intelligence Explains Analytics, Computer World, June 19, 2015The A.I. Ecosystem, Computer World, May 11, 2015 BACK TO TOP",
  "content_length": 3280,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:26"
}