{
  "name": "Krishna K. Venkatasubramanian",
  "homepage": "https://kven.me",
  "status": "success",
  "content": "Krishna Venkatasubramanian's site Krishna Venkatasubramanian, Ph.D. Associate Professor of Computer Science Computer Science and Statistics The University of Rhode Island (URI) 9 Greenhouse Road Kingston, RI 02881 Tyler Hall 131 : krish AT uri DOT edu : 401-874-2701 : @k_deux_v Background I am an Associate Professor of Computer Science in the Department of Computer Science and Statistics at the University of Rhode Island (URI). Research Interests I direct the Accessible and Socially Aware Technologies (ASSET) lab in the Department of Computer Science and Statistics. My work is situated at the intersection of accessibility, human-computer interaction, and machine learning applied to understand and meet the needs of marginalized populations. My current research would not be possible without collaboration with these excellent institutions/groups: URI Engineering, Brigham and Women's Hospital, Fenway Institute, University of Massachusetts Medical School (Emergency Medicine), Massachusetts Disabled Persons Protection Commission (DPPC), and Massacusetts Department of Developmental Services (DDS). My CV, Google Scholar, DBLP, and Publications links. Teaching I teach/have taught undergraduate courses in Data Structures/Algorithms, Human-Computer Interaction, Social Implications of Computing, Computer Networks, Software Security, Systems Programming, and graduate courses in Human-Computer Interaction, Computer Networks, and Cyber-Physical Systems. News June 2025: Our paper “Toward a taxonomy of negative outcomes from the use of AI-driven systems for people with disabilities,” has been accepted at ACM ASSETS 2025!! April 2025: Liam Cannon successfully defended his MS thesis on designing Bodhi: a post-trauma self-regulation app for people with intellectual and developmental disabilities. Congrats, Liam!! April 2025: Priyankan's paper “Understanding the Accessibility of Single-User Virtual Reality Environments for Adults with Intellectual and Developmental Disabilities,” has been accepted at ACM DIS 2025. Congrats, Priyankan!! January 2025: Our paper “Considering Trauma in Accessible Design for People with Intellectual and Developmental Disabilities,” has been accepted at Communications of the ACM magazine. October 2024: Was awarded a new National Science Foundation (NSF) Human-Centered Computing (HCC) grant for design VR-mediated technologies that empower adults with intellectual and developmental disabilities to engage in independent post-trauma self-regulation to cope with the negative effects of trauma. March 2024: Brittany, Priyankan and Tina's paper, “A3C: An Image-Association-Based Computing Device Authentication Framework for People with Upper Extremity Impairments,” has been accepted at ACM Transactions on Accessible Computing. March 2024: Our paper, “Leveraging technology for post-abuse peer support for people with intellectual and developmental disabilities,” has been accepted at ACM CHI 2024 (LBW) July 2023: Brittany Lewis successfully defended her PhD dissertation on designing authentication solutions for people with upper extremity impairments. Congrats, Dr. Brittany Lewis!! June 2023: Was awarded a new NIH NIBIB (R01) grant for a novel, artificial-intelligence-assisted, wearable sensor system, MINDER, which will continuously monitor physiologic changes and will use machine-learning algorithms to accurately identify buprenorphine use. This work is a collaboration with Drs. Stephanie Carreiro from the University of Massachusetts Medical School and Kunal Mankodiya and Dhaval Solanki from URI Engineering. May 2023: Our app designed to help individuals with intellectual and developmental disabilities recognize and report abuse has been released on the Apple app store and Amazon app store April 2023: Brittany, Tina, Alex, and Priyankan's paper on the use of security-focused smart home devices by people with disabilities has received an ACM CHI 2023 Honorable Mention Award. Yay!!!! Feb 2023: Brittany, Tina, Alex, and Priyankan's paper, “'I... caught a person casing my house... and scared him off:' The Use of Security-Focused Smart Home Devices by People with Disabilities,” has been accepted at ACM CHI 2023. Congrats, team!! Oct 2022: Our paper, “The Design and Prototyping of an App to Teach Adults with Intellectual and Developmental Disabilities to Empower Them Against Abuse,” has been accepted at ACM Transactions on Accessible Computing. Aug 2022: Our paper, “Designing Post-Trauma Self-Regulation Apps for People with Intellectual and Developmental Disabilities,” has been accepted at ACM ASSETS 2022. April 2022: Derek Jacobs completes his MS thesis titled, \"Predicting Pain Presence in ICU Patients Using Physiological Signals.\" Congrats, Derek! Feb 2022: Brittany Lewis' paper, “'Sometimes I feel that I’m being left behind': Exploring Computing Device Use by People with Upper Extremity Impairment During the COVID-19 Pandemic,” has been accepted at ACM CHI 2022 (LBW). Congrats, Brittany!! November 2021: Received a new grant from the Massachusetts Disabled Persons Protection Commission (MA-DPPC) to design and develop a system to support dyadic peer support for people with intellectual and developmental disabilities (I/DD) to cope post trauma. October 2021: Was awarded a new National Science Foundation (NSF) Smart and Connected Health (SCH) EAGER grant for designing multimodal, smart textile, medical monitoring systems for neonatal ICUs. This work is a collaboration with Drs. Kunal Mankodiya and Yalda Shariyari from URI Engineering. June 2021: Our paper, “Designing an App to Help Individuals with Intellectual and Developmental Disabilities to Recognize Abuse,” has been accepted at ACM ASSETS 2021. Thanks to our multi-institutional team at URI, WPI, DPPC, MASS, and DDS for their hardwork to make this happen! March 2021: Our paper, “Exploring A Reporting Tool to Empower Individuals with Intellectual and Developmental Disabilities to Self-Report Abuse,” has received an ACM CHI 2021 Honorable Mention Award. January 2021: Brittany Lewis' paper, “'I... Got my Nose-Print. But it Wasn’t Accurate': How People with Upper Extremity Impairment Authenticate on their Personal Computing Devices,” has been accepted at ACM CHI 2021. Congrats, Brittany!! January 2021: Our paper, “Exploring A Reporting Tool to Empower Individuals with Intellectual and Developmental Disabilities to Self-Report Abuse,” has been accepted at ACM CHI 2021. Thanks to our multi-institutional team at URI, WPI, DPPC, MASS, and DDS for their hardwork to make this happen!",
  "content_length": 6596,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:20"
}