{
  "name": "Krishna Reddy Polepalli",
  "homepage": "http://faculty.iiit.ac.in/~pkreddy",
  "status": "success",
  "content": "Faculty IIITH- Prof. P. Krishna Reddy Prof. P. Krishna Reddy Professor Ph.D, JNU, New Delhi International Institute of Information Technology Hyderabad, IIIT-H +91 040 66531000 Ext: 1322 +91 040 66531413 pkreddy@iiit.ac.in Read More Professor P. Krishna Reddy is in IIIT, Hyderabad since 2002. During 2013 to 2015, he was a Program Director, ITRA-Agriculture & Food, Information Technology Research Academy (ITRA), Government of India. During 1997 to 2002, he was a research associate at the Center for Conceptual Information Processing Research, Institute of Industrial Science, University of Tokyo. He has received PhD degree in Computer Science from Jawaharlal Nehru University, New Delhi. His research interests include data mining, database systems and IT for agriculture. He has published about 145 refereed research papers. Bio Sketch Prof. P. Krishna Reddy is a faculty member at IIIT Hyderabad. He is the head of Agricultural Research Center and the member of Data Sciences and Analytics Center research students at IIIT Hyderabad, India. During 2013 to 2015, he has served as a Program Director, ITRA-Agriculture & Food, Information Technology Research Academy (ITRA), Government of India. From 1997 to 2002, he was a research associate at the Center for Conceptual Information Processing Research, Institute of Industrial Science, University of Tokyo. From 1994 to 1996, he was a faculty member at the Division of Computer Engineering, Netaji Subhas Institute of Technology, Delhi. During the summer of 2003, he was a visiting researcher at Institute for Software Research International, School of Computer Science, Carnegie Mellon University, Pittsburg, USA. He has received both M.Tech and Ph.D degrees in computer science from Jawaharlal Nehru University, New Delhi in 1991 and 1994, respectively. His research areas include data mining, database systems and IT for agriculture. He has published about 189 refereed research papers which include 30 journal papers, four book chapters, and eight edited books. He is a steering committee member of the pacific-asia knowledge discovery and data mining (PAKDD) conference series and Database Systems for Advanced Applications (DASFAA) conference series. He is a steering committee chair of Big Data Analytics (BDA) conference series since 2017. He was a proceedings chair of COMAD 2008, a workshop chair of KDRS 2010, media and publicity chair of KDD 2015, and general chair of BDA2017. As a general chair, he has organized the both 14th and 21th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD2010 and PAKDD2021) conferences, the Third National Conference on Agro-Informatics and Precision Agriculture 2012 (AIPA 2012) and the Fifth International Conference on Big Data Analytics (BDA 2017). He is currently organizing DASFAA2022. He has delivered several invited/panel talks at the reputed conferences and workshops in India and abroad. He has got several awards and recognitions. He has executed research projects by raising the research funding of about 80 million Indian rupees. Since 2004, he has been investigating the building efficient knowledge agricultural knowledge transfer systems by extending developments in IT. He has developed eSagu system, which is an IT-based farm-specific agro-advisory system, which has been field-tested in hundreds of villages on about 50 field and horticultural crops. He has also built eAgromet system, which is an IT-based agro-meteorological advisory system to provide risk mitigation information to farmers. He has conceptualized the notion of Virtual Crop Labs to improve applied skills for extension professionals. Currently, he is investigating the building of Crop Darpan system, which is a crop diagnostic tool for farmers, with the funding support from India-Japan Joint Research Laboratory Program. He has received two best paper awards. The eSagu system, which is an IT based farm-specific agro-advisory system, has got several recognitions including CSI-Nihilent e-Governance Project Award in 2006, Manthan Award in 2008 and finalist in the Stockholm Challenge Award in 2008. He has received PAKDD Distinguished Service Award in 2021. Talks Conferences Publications Research Projects Affiliations International Institute of Information Technology Hyderabad (IIITH), Gachibowli, India. Data Sciences and Analytics Center, Kohli Center on Intelligent Systems, IIIT Hyderabad, India. IT for Agriculture Research Center, IIITH, India. The Tenth International Conference on Big Data Analytics 2022 (BDA 2022), December 19-22, 2022, IIIT Hyderabad, India. The 27th International Conference on Database Systems for Advanced Applications (DASFAA2022), April 11-14, 2022, Hyderabad, India. Tags Aggriculture IT DSAC IIIT-H DASFAA",
  "content_length": 4756,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:22"
}