{
  "name": "Krishna M. Sivalingam",
  "homepage": "http://www.cse.iitm.ac.in/~skrishnam",
  "status": "success",
  "content": "Homepage of Prof. Krishna Moorthy Sivalingam (S. Krishnamoorthy) Indian Institute of Technology (IIT) Madras | Dept of CSE, IIT Madras Prof. Krishna Moorthy Sivalingam (S. Krishnamoorthy) Home Biography and CV Education Courses Current Research Research Group Books Edited Journal Publications Conference Publications Book Chapters Patents Journal Editorships Conference Activities Contact Information Gopalakrishnan Institute Chair Professor, Office: SSB 313; DAWNLab (SSB 422/423), Dept of CSE, IIT Madras IEEE Fellow, ACM Distinguished Scientist, INAE Fellow Google Scholar Record Scopus Record Announcements: Listed among the Top 2% of scientists worldwide, published 2020, 2021, 2022, 2023: Updated science-wide author databases of standardized citation indicators, https://doi.org/10.1371/journal.pbio.3000918. Top 2% of Scientists October 2023 data-update for \"Updated science-wide author databases of standardized citation indicators\", Oct 2023, DOI: 10.17632/btchxktzyw.6. Research Areas of Interest: Computer Networks, in general, with specific interests in: AI/ML Techniques for Networking Systems Programmable Data Plane Networking, using Tofino / other hardware Wireless Networks Former faculty positions held by Prof. Krishna Sivalingam: Professor, Dept. of Computer Science and Electrical Engineering, University of Maryland, Baltimore County, Baltimore, USA; [2002 - 2007] Associate Professor, School of Electrical Engineering and Computer Science, Washington State University, Pullman, WA, USA [1997 - 2002] Assistant Professor, Dept. of Mathematical Sciences, University of North Carolina Greensboro , Greensboro, NC, USA [1994 - 1997] IIT Madras Summer Internship Requests: Students in their SIXTH semester of B.E./Dual Degree in CSE/IT program may DIRECTLY apply to the IIT Madras Summer Internship Program. Students must have completed Data Structures, Algorithms, Operating Systems and Computer Networks to be considered in my research group. Due to the large volume of internship requests, email replies will not be sent if there is no matching interest. Undergraduate students in their fourth or earlier semester are highly unlikely to be considered for a summer internship in my research group.",
  "content_length": 2219,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:21"
}