{
  "name": "Kristian G. Olesen",
  "homepage": "http://people.cs.aau.dk/~kgo/cv.html",
  "status": "success",
  "content": "CV for Kristian G. Olesen Curriculum Vitae for Kristian G. Olesen Personal data Danish citizenship Born on 25th of september 1957 Married with Lone Andrup 23rd of december 1989 Private address Syrenvej 53 9310 Vodskov Denmark Phone +45 2567 5494 Business address Department of Computer Science Aalborg University Selma Lagerlöfs Vej 300 9220 Aalborg Øst Denmark Phone: +45 9940 9852 Fax: +45 9940 9798 E-mail: kgo@cs.aau.dk WWW: http://www.cs.aau.dk/~kgo Academic degrees B.Sc. in Mathematics from Aalborg University, 1982 M.Sc. in Computer Science from Aalborg University, 1985 Ph.D. in Computer Science from Aalborg University, 1992 Positions held November 1985 - June 1986: Teaching assistant at Aalborg University. July 1986 - January 1988: Kandidatstipendiat (research fellow) at Aalborg University. February 1988 - June 1989: Project Manager on Esprit project P599 \"An Intelligent Assistant for Electromyography\" at Nordjysk Udviklingscenter, Aalborg. July 1989 - December 1989: Kandidatstipendiat (research fellow) at Aallborg University, continued appointment. January 1990 - June 1990: Adjunktvikar (assistant professor substitute) at Aalborg University. July 1990 - May 1991: Research assistant on a project on planning in Causal Probabilistic Networks financed by the Danish Research Council for the Technical Sciences. June 1991 - July 1991: Research assistant on a project developing the course \"Expert systems in industrial and medical applications\". August 1991 - July 1995: Adjunkt (assistant professor) at Aalborg University. August 1995 - July 1996: Lektorvikar (associate professor substitute) at Aalborg University. August 1996 - February 1999: Forskningslektor (associate research professor) at Aalborg University. March 1999 - present: Lektor (Associate professor) at Aalborg University. Administration 1998-2000: Member of the network comittee of DINA, the Danish Informatics Network in the Agricultural sciences. 2000 - 2005: Head of School of Science and chairman of the board for the science educations (F-studienævnet). 2001: Member of the advisory commitee on \"Education and Competence\" under \"The Digital Northern Jutland\". 2006 - present: Head of Department of Computer Science Miscellaneous 1989: Cofounder of HUGIN Expert Ltd. 1989 - 2002: Vice Chairman of HUGIN Expert Ltd. 1995: Educator of the year at the Faculty of Technology and Science 2003: Organising chair of ECSQARU-03 (The European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty). 2005 - 2007: Member of the board of HUGIN Expert Ltd. Last modified: August 2nd, 2007.",
  "content_length": 2595,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:25"
}