{
  "name": "Kristina Vuskovic",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/249/professor-kristina-vuskovic",
  "status": "success",
  "content": "Professor Kristina Vušković | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor Kristina Vušković Position: Professor of Algorithms and Combinatorics Areas of expertise: graph theory; algorithms; combinatorial optimization Email: K.Vuskovic@leeds.ac.uk Phone: +44(0)113 343 5443 Location: Chemistry West 3.18b Computer Science Apex Website: Publications | Research group Profile Professor Vušković was awarded a BA in Mathematics and Computer Science from New York University in 1989, and a PhD in Algorithms, Combinatorics and Optimization from Carnegie Mellon University in 1994. She spent two years as an NSERC Canada International Fellow at University of Waterloo, Department of Combinatorics and Optimization, which was followed by a position at the Department of Mathematics of University of Kentucky. Since 2000 she is at the School of Computing, University of Leeds, where she is the leader of Algorithms and Complexity Research Group. Professor Vušković was awarded Chair in Algorithms and Combinatorics in 2011. See the  Algorithms and Complexity research theme page for further information. Responsibilities The Algorithms and Complexity theme leader Research groups and institutes Algorithms and Complexity Current postgraduate researchers Pedro <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Back to top",
  "content_length": 1816,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:29"
}