{
  "name": "Kristopher K. Micinski",
  "homepage": "http://kmicinski.com",
  "status": "success",
  "content": "Kristopher Micinski Kristopher Micinski Assistant Professor Syracuse University kkmicins@syr.edu krismicinski whereskris.com I love thinking about programming, exploring ways to understand programs, developing new paradigms for writing programs, and helping students understand programs. I am an assistant professor in the Electrical Engineering and Computer Science department at Syracuse University. I am always looking for motivated undergraduate, masters, and doctoral students to work on research in programming languages (specifically static analysis) and security. Feel free to email me! Research My goal is to design the most scalable logical reasoning systems in history for code analysis, analytic reasoning, and symbolic AI broadly. Over the past several years, the bulk of my interests have been focused on extensions to Datalog, where my collaborators and I have built the world’s fastest Datalog engines for CPUs (CC ‘22, OOPSLA ‘23), GPUs (ASPLOS ‘25, AAAI ‘25), and supercomputing clusters (VLDB ‘25, ICS ‘25). In my current efforts, I have been working to apply these engines to new applications in reverse engineering, static analysis, medical reasoning, and related fields. My Google Scholar profile tracks my most up-to-date submissions. Security PL Systems Areas I work in (mouse over) Security I work on both logics for security and formal methods to reason about a program's (in)security. Programming Languages I often work on programming language semantics and analysis thereof, often using techniques such as symbolic execution and abstract interpretation. Systems A key part of our methodology is that we implement our techniques at the higest-possible scale (all of GitHub, production Android apps, stripped binaries). This often requires novel systems-level innovation Sponsored Projects NSF PPoSS Large: A Full-stack Approach to Declarative Analytics at Scale. National Science Foundation. Total: $1,000,037 (5 years) NSF PPoSS Planning: A Full-stack Approach to Declarative Analytics at Scale. National Science Foundation. Total: $83,761 (1 year) DARPA V-SPELLS: Verified Security and Performance Enhancement of Large Legacy Software. Defense Advance Research Projects Agency. Total: $400k (4 years) Assemblage: Scaling Malware Analysis Pipelines. US Lab for Phys. Sciences. Total: $698k PhD Students Arash Sahebolamri (graduated PhD, May 2023) Dissertation: “Improving Logic Programming for Program Analysis.” Yihao Sun (started PhD 2020) Chang Liu (started PhD 2023) Neda Abdolrahimi (started PhD 2023) Teaching In Fall 2025 I taught CIS531, an MS-level compiler design course. I regularly teach CIS352, an undergraduate programming languages class at Syracuse: Upcoming Spring 26 course Spring 2025 Fall 2024 Spring 2024 Fall 2023 Spring 2023 Fall 2022 Spring 2022 Spring 2021 Spring 2020 Each fall I also teach a special topics seminar (CIS700 at Syracuse). During Fall 2023, I’m teaching a course on formal methods and modern symbolic AI. Undergraduate Research and Theses Note that I am particularly excited to collaborate with Syracuse students. As you can likely tell from this page, my research is generally in programming languages, but related areas (especially computer security) also appeal to me. If you would like to pursue undergraduate research, please drop me a line so we can discuss! You should also read my thoughts on goals and expectations for undergraduate research.",
  "content_length": 3420,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:31"
}