{
  "name": "Krishna V. Palem",
  "homepage": "http://www.cs.rice.edu/~kvp1",
  "status": "success",
  "content": "Krishna V. Palem Krishna V. Palem Kenneth and Audrey Kennedy Professor of Computing Department of Computer Science, Rice University - MS 132 PO Box 1892, Houston, Texas, 77251 Ph: 713-348-4664 E-mail: palem@rice.edu [ Teaching | Research Interests | Selected Talks | Students | In The Press | Resume PDF | Bio PDF ] Research Interests (back to top) Krishna V. Palem is the Kenneth and Audrey Kennedy Professor of Computing at the Department of Computer Science at the George Brown School of Engineering at Rice University. His research interests while focussed on all aspects of embedded computing, include adaptive architectures and computing, algorithms, compiler optimizations, embedded systems, low energy computing and nanoelectronics. He is the founding director of VISEN center at Rice University. The schedule for the VISEN center kickoff meeting on monday, jan 28, is here Selected Talks and Publications (back to top) Probabilistic System-on-a-Chip Architectures Lakshmi N. Chakrapani, Pinar Korkmaz, Bilge E. S. Akgul and Krishna V. Palem ACM Transactions on Design Automation of Electronic Systems, Volume 12 , Issue 3 (August 2007) Advocating Noise as an Agent for Ultra Low-Energy Computing: Probabilistic CMOS Devices and Their Characteristics Pinar Korkmaz, Bilge E. S. Akgul, Krishna V. Palem and Lakshmi N. Chakrapani Japanese Journal of Applied Physics, SSDM Special Issue Part 1, April 2006. Proof as Experimenft:Probabilistic Algorithms from a Thermodynamic Perspective Krishna V. Palem Proceedings of the Intl. Symposium on Verification (Theory and Practice), Taormina, Sicily, Italy, June 29-July 4, 2003. For a complete list of publications, click here. Students (back to top) Jason George Avinash Lingamneni Kirthi Krishna Muntimadugu Scott Novich Akshaya Srivatsa In The Press (back to top) EETimes Nanyang, Rice University to tackle IC power problems KUHF-FM, NPR Rice University and Nanyang Technological University in Singapore form $2.6 million Institute for Sustainable Nanoelectronics Straits Times $4M NTU project to develop a flawed chip Business Week Chips That Thrive on Uncertainty",
  "content_length": 2118,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:26"
}