{
  "name": "Krishnendu Chakrabarty",
  "homepage": "https://search.asu.edu/profile/4669916",
  "status": "success",
  "content": "Krishnendu Chakrabarty | ASU Search Krishnendu Chakrabarty Fulton Professor of Microelectronics, School of Electrical, Computer and Energy Engineering [email protected] Mail code: 5706 Campus: Tempe ‌ Long Bio Krishnendu Chakrabarty received the B. Tech. degree from the Indian Institute of Technology, Kharagpur, in 1990, and the M.S.E. and Ph.D. degrees from the University of Michigan, Ann Arbor, in 1992 and 1995, respectively. He is now the Fulton Professor of Microelectronics in the School of Electrical, Computer and Energy Engineering at Arizona State University (ASU). He is also the CTO of the SWAP Hub for the Department of War Microelectronics Commons (https://microelectronics.asu.edu/southwest-advanced-prototyping-hub/), and Director of the ASU Center for Semiconductor Microelectronics (ACME, http://acme.asu.edu). Before moving to ASU, he was the John Cocke Distinguished Professor and Chair of Electrical and Computer Engineering at Duke University. Prof. Chakrabarty is a recipient of the National Science Foundation CAREER award, the Office of Naval Research Young Investigator award, the Humboldt Research Award from the Alexander von Humboldt Foundation, Germany, the IEEE Transactions on CAD Donald O. Pederson Best Paper Award (2015), the IEEE Transactions on VLSI Systems Prize Paper Award (2021), the ACM Transactions on Design Automation of Electronic Systems Best Paper Award (2017), multiple IBM Faculty Awards and HP Labs Open Innovation Research Awards, and over a dozen best paper awards at major conferences.  He is also a recipient of the IEEE Computer Society Technical Achievement Award (2015), the IEEE Circuits and Systems Society Charles A. Desoer Technical Achievement Award (2017), the IEEE Circuits and Systems Society Vitold Belevitch Award (2021), the Semiconductor Research Corporation Technical Excellence Award (2018), the Semiconductor Research Corporation Aristotle Award (2022), the Semiconductor Research Corporation Innovation Award (2025), the IEEE-HKN Asad M. Madni Outstanding Technical Achievement and Excellence Award (2021), and the IEEE Test Technology Technical Council Bob Madge Innovation Award (2018). He is a Research Ambassador of the University of Bremen (Germany) and he was a Hans Fischer Senior Fellow at the Institute for Advanced Study, Technical University of Munich, Germany during 2016-2019. He is a 2018 recipient of the Japan Society for the Promotion of Science (JSPS) Invitational Fellowship in the “Short Term S: Nobel Prize Level” category. He is also a recipient of the Distinguished Alumnus Award from the Indian Institute of Technology, Kharagpur. He received the Distinguished Engineering Educator Award from the Engineers' Council in 2025. Prof. Chakrabarty’s current research projects include: design-for-testability of 3D integrated circuits; heterogenous integration; silicon lifecycle management; hardware security; AI accelerators; microfluidic biochips; AI for healthcare. His research has been supported by the National Science Foundation, DARPA, Office of Naval Research, DoD Microelectronics Commons; National Institutes of Health, Army Research Office, Semiconductor Research Corporation, and various corporations (Intel, IBM, Synopsys, NI, Cisco, HP). He has published 27 books (with one book translated into Chinese and two more books in press) and 960 peer-reviewed papers (including over 390 journal articles) on these topics. He holds 24 US patents and his research on microfluidic biochips has been licensed by Advanced Liquid Logic, Illumina, GenMark, and Baebies Inc. He has collaborated extensively with the semiconductor industry and his test technology solutions have been adopted by Intel, TSMC, Samsung, Mentor Graphics, and Qualcomm (https://www.src.org/award/tech-excellence/2018/). He was a Visiting Professor at NVIDIA from May 2022 to January 2023. He has supervised 45 PhD dissertations and 20 postdoc researchers, and his former students and postdocs are now working at leading companies such as NVIDIA, Intel, Siemens, Google, Microsoft and Apple, and tenured in research universities. Prof. Chakrabarty is a Fellow of ACM, IEEE, and AAAS, and a Golden Core Member of the IEEE Computer Society. He was a member of the DARPA Microsystems Exploratory Council for 2022-2023. He is also a member of the Scientific Advisory Board of the German Research Center for Artificial Intelligence (DFKI). He was a Distinguished Visitor of the IEEE Computer Society (2005-2007, 2010-2012), a Distinguished Lecturer of the IEEE Circuits and Systems Society (2006-2007, 2012-2013), and an ACM Distinguished Speaker (2008-2016). Prof. Chakrabarty served as the Editor-in-Chief of IEEE Design & Test of Computers during 2010-2012, ACM Journal on Emerging Technologies in Computing Systems during 2010-2015, and IEEE Transactions on VLSI Systems during 2015-2018. September 2025 Education B. Tech., Indian Institute of Technology, Kharagpur (1990) M.S.E., University of Michigan, Ann Arbor (1992) Ph.D., University of Michigan, Ann Arbor (1995) Google Scholar URL https://scholar.google.com/citations?hl=en&user=R_VPUyEAAAAJ&view_op=list_works… Research Interests Test and design-for-testability for 2.5D/3D integrated circuits, heterogeneous integration, advanced packaging; silicon lifecycle management; design of AI accelerators; hardware security; microfluidic biochips, AI for healthcare. Publications Selected Recent Publications: S.-C. Hung, A. Chaudhuri, S. Banerjee and K. Chakrabarty, “Fault diagnosis for resistive random-access memory and monolithic inter-tier vias in monolithic 3D integration”, IEEE Transactions on VLSI Systems, vol. 32, pp. 1336–1349, July 2024. A. Shafiee, S. Banerjee, K. Chakrabarty, S. Pasricha and M. Nikdast, “Analysis of optical loss and crosstalk noise in MZI-based coherent photonic neural networks”, IEEE Journal of Lightwave Technology, vol. 42, pp. 4598–4613, July 2024. C. Ogbogu, B. K. Joardar, K. Chakrabarty, J. R. Doppa and P. P. Pande, “Data pruning-enabled high performance and reliable graph neural network training on ReRAM-based processing-in-memory accelerators”, ACM Transactions on Design Automation of Electronic Systems, vol. 29, Article No. 72, pp. 1–29, August 2024. J. Chaudhuri, M. Bhattacharya and K. Chakrabarty, “DAWN: Efficient trojan detection in analog circuits using circuit watermarking and neural twins”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 43, pp. 2930–2943, October 2024. J. Talukdar, W.-H., Paik, E. Ortega and K. Chakrabarty, “ALT-Lock: Logic and timing ambiguity-based obfuscation against reverse engineering”, IEEE Transactions on VLSI Systems, vol. 32, pp. 1535–1548, August 2024. J. Talukdar, A. Chaudhuri, E. Ortega and K. Chakrabarty, “TaintLock: Hardware IP protection against Oracle-guided and Oracle-reconstruction attacks”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 44, pp. 357–370, January 2025. C. Ogbogu, G. Narang, B. K. Joardar, J. R. Doppa, K. Chakrabarty and P. P. Pande, “HuNT: Exploiting heterogeneous PIM devices to design a 3D manycore architecture for DNN training”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 43, pp. 3300–3311, November 2024. P. Domanski, A. Ray , K. Lafata, F. Firouzi, K. Chakrabarty and D. Pflueger, “Advancing blood glucose prediction with neural architecture search and deep reinforcement learning for type 1 diabetics”, Biocybernetics and Biomedical Engineering, vol. 44, pp. 481–500, July–September 2024, 2024. N. S. Baban, J. Zhou, K. Elkhoury, S. Bhattacharjee, S. Vijayavenkataraman, Y.-A. Song, K. Chakrabarty and R. Karri, “BioTrojans: Viscoelastic microvalve-based attacks in flow-based microfluidic biochips and their countermeasures”, Scientific Reports, a journal of the Nature Research family, vol. 14, Article number: 19806 (2024). J. Zhou, X. Li, D. Demeke, Y. Yang, A. R. Janowczyk, J. Zee. L. Holzman, L. Mariani, K. Chakrabarty, L. Barisoni, J. R. Hodgin and K. J. Lafata, “Characterization of arteriosclerosis based on computer-aided measurements of intra-arterial thickness”, Journal of Medical Imaging, 11(5), 057501 (2024), doi: 10.1117/1.JMI.11.5.057501. E. Ortega, F. Su, R. Chattapopadhyay and K. Chakrabarty, “Discretized-isolation forest: Memory- & Compute-efficient unsupervised anomaly detection for resourceconstrained internet-of-things edge devices”, IEEE Internet of Things Journal, vol. 12, pp. 1699–1717, January 2025. A. S. E. Manna, N. S. Baban, M. Zhang, D.Wang, H. Ma, T.-Y. Ho and K. Chakrabarty, “Optimization of droplet routing in microfluidic biochips using calibrated droplet shape morphing”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 44, pp. 2683-2696, July 2025. S. Jiang, Y. Li, F. Firouzi and K. Chakrabarty, “Federated clustered multi-domain learning for health monitoring”, Scientific Reports (Nature Portfolio), 14:903, https://doi.org/10.1038/s41598-024-51344-9, 2024. N. S. Baban, S. Saha, S. Jancheska, I. Singh, S. Khapli, M. Khobdabayev, J. Kim, S. Bhattacharjee, Y. Song, K. Chakrabarty and R. Karri, “Material-level countermeasures for securing microfluidic biochips”, Lab on a Chip, 2023, DOI: 10.1039/D3LC00335C. W.-K. Liu, B. Tan, J. M. Fung, R. Karri and K. Chakrabarty, \"Hardware-supported patching of security bugs in hardware IP blocks\",  IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 42, pp. 54-67, January 2023. P. Zhang, J. Rufo, C. Chen, J. Xia, Z. Tian, L. Zhang, N. Hao, Z. Zhong, Y. Gu, K. Chakrabarty and T. Huang, \"Acoustoelectronic nanotweezers enable dynamic and large-scale control of nanomaterials\",  Nature Communications, 23 June 2021. S. P. Zhang, C. Chen, F. Guo, Feng, J. Philippe, Y. Gu, Z. Tian, H. Bachman, L. Ren, S. Yang, Z. Zhong, P.-H. Huang, N. Katsanis, K. Chakrabarty, and T. Huang, \"Contactless, programmable acoustofluidic manipulation of objects on water'', Lab on a Chip, vo",
  "content_length": 16940,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:23"
}