{
  "name": "Krzysztof Rzadca",
  "homepage": "http://www.mimuw.edu.pl/~krzadca",
  "status": "success",
  "content": "Home Page - Krzysztof Rzadca krzysztof rzÄ dca Hi and welcome to my home page. I am an associate professor in the Institute of Informatics of the Faculty of Mathematics, Informatics and Mechanics, University of Warsaw, Poland. I am also a data science lead at Google, where I work on google cloud infrastructure. I did my habilitation (HDR) in 2015 at University of Warsaw. Before joining UW, I was working as a research fellow (post-doc) in Anwitaman Datta's SANDS working group in the School of Computer Engineering (SCE) of the Nanyang Technological University (NTU), Singapore. I did my PhD on resource management in grids jointly in Laboratoire d'Informatique de Grenoble of Institut national polytechnique de Grenoble, France and Polish-Japanese Institute of Information Technology, Warsaw, Poland, as a French government fellow (co-tutelle grant). I graduated with a MSc from the Faculty of Electronics and Information Technology, Warsaw University of Technology, Poland. My CV I'm interested in resource management and scheduling in large-scale distributed systems, such as clouds, datacenters or fogs. opal: optimization methods for of large-scale computational resources, a project founded by the Polish National Science Center (a 3-year Opus grant, October 2018-August 2022). kassate: resource management in datacenters, a project founded by the Polish National Science Center (a 4-year Sonata grant, July 2013-December 2017). Recent TPCs: IPDPS 2021; Supercomputing 2021; Euro-Par 2020 (general chair). research profiles: google scholar dblp selected publications: (see the research page for the whole list) N. Bashir, N. Deng, K. Rzadca, D. E. Irwin, S. Kodak, and R. Jnagal. Take it to the limit: peak prediction-driven resource overcommitment in datacenters. In EuroSys '21: Proceedings of the Sixteenth EuroSys Conference, pages 556-573. ACM, 2021. [ bib | DOI | http ] J. Kopanski and K. Rzadca. Plan-based job scheduling for supercomputers with shared burst buffers. In Euro-Par '21 Proceedings: 27th International European Conference on Parallel and Distributed Computing (accepted). Springer, 2021. [ bib ] A. Naruszko, B. Przybylski, and K. Rzadca. A log-linear (2+5/6)-approximation algorithm for parallel machine scheduling with a single orthogonal resource. In Euro-Par '21 Proceedings: 27th International European Conference on Parallel and Distributed Computing (accepted). Springer, 2021. [ bib ] B. Przybylski, P. Zuk, and K. Rzadca. Data-driven scheduling in serverless computing to reduce response time. In CCGrid '21 Proceedings: 21th IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing, 2021. [ bib ] K. Rzadca, P. Findeisen, J. Swiderski, P. Zych, P. Broniek, J. Kusmierek, P. Nowak, B. Strack, S. Hand, and J. Wilkes. Autopilot: workload autoscaling at google. In EuroSys'20: Proceedings of the Fifteenth EuroSys Conference. ACM, 2020. [ bib | DOI ] P. Zuk and K. Rzadca. Scheduling methods to reduce response latency of function as a service. In SBAC-PAD 2020, pages 132-140. IEEE, 2020. [ bib | DOI | http ] F. Pascual and K. Rzadca. Optimizing egalitarian performance when colocating tasks with types for cloud data center resource management. IEEE Transactions on Parallel and Distributed Systems, 30(11):2523-2535, November 2019. [ bib | DOI | http ] F. Pascual, K. Rzadca, and P. Skowron. Collective schedules: Scheduling meets computational social choice. In AAMAS'18, 2018. [ bib | http | Aussois slides ] F. Pascual and K. Rzadca. Colocating tasks in data centers using a side-effects performance model. European Journal of Operational Research, 2018. [ bib | DOI ] M. Pacholczyk and K. Rzadca. Fair non-monetary scheduling in federated clouds. In CrossCloud'18, EuroSys Workshops, 2018. [ bib | DOI | http ] P. Janus and K. Rzadca. SLO-aware colocation of data center tasks based on instantaneous processor requirements. In SoCC 2017, ACM Symposium on Cloud Computing. ACM, 2017. [ bib | DOI | http | pdf ] F. Pascual and K. Rzadca. Optimizing egalitarian performance in the side-effects model of colocation for data center resource management. In Euro-Par 2017 Proceedings, 2017. [ bib | DOI | http | pdf ] P. Skowron, K.. Rzadca, and A. Datta. Cooperation and competition when bidding for complex projects: Centralized and decentralized perspectives. IEEE Intelligent Systems, 2017. [ bib | DOI | http ] G. Milka and K. Rzadca. Dfuntest: A testing framework for distributed applications. In PPAM 2017, International Conference on Parallel Processing and Applied Mathematics, LNCS. Springer, 2017. [ bib | DOI | http ] K. Rzadca, A Datta, G. Kreitz, and S .Buchegger. Game-theoretic mechanisms to increase data availability in decentralized storage systems. ACM Transactions on Autonomous and Adaptive Systems, 2015. [ bib | DOI | pdf ] P. Skowron and K. Rzadca. Geographically distributed load balancing with (almost) arbitrary load functions. In HiPC 2015, 22nd IEEE/ACM International Conference on High Performance Computing, 2015. [ bib | DOI | pdf ] F. Pascual and K. Rzadca. Partition with side effects. In HiPC 2015, 22nd IEEE/ACM International Conference on High Performance Computing, 2015. [ bib | DOI | pdf ] Y. Georgiou, D. Glesser, K. Rzadca, and D. Trystram. A scheduler-level incentive mechanism for energy efficiency in HPC. In CCGrid 2015, 15th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, 2015. [ bib |DOI |pdf ] P. Skowron and K. Rzadca. Flexible replica placement for optimized p2p backup on heterogeneous, unreliable machines. Concurrency and Computation: Practice and Experience, 2015. [ bib | DOI | http | pdf ] P. Skowron, K Rzadca, and A Datta. People are processors: Coalitional auctions for complex projects (extended abstract). In AAMAS 2014, 13th International Conference on Autonomous Agents and Multiagent Systems, pages 1525-1526, 2014. [ bib | http | pdf ] P. Skowron and K. Rzadca. Non-monetary fair scheduling - a cooperative game theory approach. In SPAA 2013, 25th ACM Symposium on Parallelism in Algorithms and Architectures, 2013. [ bib | http | pdf ] P. Skowron and K. Rzadca. Network delay-aware load balancing in selfish and cooperative distributed systems. In HCW 2013 (in conjunction with IPDPS), 2013. [ bib | http | pdf ] P. Skowron and K. Rzadca. Exploring heterogeneity of unreliable machines for p2p backup. In HPCS 2013, International Conference on High Performance Computing & Simulation, 2013. [ bib | pdf ] J. Emeras, V. Pinheiro, K. Rzadca, and D. Trystram. Ostrich: Fair scheduling for multiple submissions. In PPAM 2013, International Conference on Parallel Processing and Applied Mathematics, LNCS. Springer, 2013. [ bib | pdf ] P. Skowron and K. Rzadca. Fair share is not enough: measuring fairness in scheduling with cooperative game theory. In PPAM 2013, International Conference on Parallel Processing and Applied Mathematics, LNCS. Springer, 2013. [ bib | pdf ] V. Pinheiro, K. Rzadca, and D. Trystram. Campaign scheduling. In IEEE International Conference on High Performance Computing (HiPC), Proceedings, 2012. [ bib | pdf ] L. Xin, A. Datta, and K. Rzadca. Trust beyond reputation: A computational trust model based on stereotypes. Electronic Commerce Research and Applications, 2012. [ bib | DOI | http ] P.-F Dutot, F. Pascual, K. Rzadca, and D. Trystram. Approximation algorithms for the multi-organization scheduling problem. IEEE Transactions on Parallel and Distributed Systems, 22:1888 - 1895, 2011. [ bib | pdf ] K. Rzadca, A. Datta, and S. Buchegger. Replica placement in p2p storage: Complexity and game theoretic analyses. In ICDCS 2010, The 30th International Conference on Distributed Computing Systems, Proceedings, 2010. [ bib | DOI | pdf ] K. Rzadca, J. Tan Teck, and A. Datta. Multi-objective optimization of multicast overlay for collaborative applications. Computer Networks, 54(12):1986-2005, 2010. [ bib | DOI | pdf ] K. Rzadca and D. Trystram. Promoting cooperation in selfish computational grids. European Journal of Operational Research, 199:647-657, 2009. [ bib | DOI | pdf ] Liu Xin, A. Datta, K. Rzadca, and Lim Ee-Peng. Stereotrust: A group based personalized trust model. In CIKM 2009, The 18th ACM Conference on Information and Knowledge Management, Proceedings, pages 7-16. ACM Press, 2009. [ bib | DOI | pdf ] teaching High Performance Computing (summer term) Parallel Programming (winter term, I teach tutorials and labs) contact Krzysztof Rzadca Institute of Informatics University of Warsaw Banacha 2 02-097 Warszawa Poland email: or: phone: (+48) 22 55 44 428 fax: (+48) 22 55 44 400 room: 4280",
  "content_length": 8589,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:40"
}