{
  "name": "Krzysztof J. Geras",
  "homepage": "https://cs.nyu.edu/~kgeras",
  "status": "success",
  "content": "Krzysztof J. Geras Krzysztof J. Geras Assistant ProfessorDepartment of RadiologyNYU Grossman School of Medicine (also affiliated at)Center for Data Science, New York University Department of Computer Science, Courant Institute of Mathematical Sciences, New York University Contact Email: k.j.geras@nyu.edu. Address (at Radiology): Office 728, 227 E 30th Street, New York, NY 10016. Address (at CDS): Office 643, 60 5th Avenue, New York, NY 10011. Frequently Asked Questions About me I am an assistant professor at the NYU Grossman School of Medicine. I previously worked as a postdoctoral researcher at the NYU Center for Data Science with Kyunghyun Cho. My main interests are unsupervised learning with neural networks, model compression, transfer learning and evaluation of machine learning models. During my PhD studies at the University of Edinburgh I was supervised by Charles Sutton. My PhD was kindly sponsored by SICSA and EPSRC. Prior to studying towards a PhD in Machine Learning, I got my BSc and MSc degrees in Computer Science from the University of Warsaw. I worked on my MSc thesis as a visiting student at the University of Edinburgh under the supervision of Amos Storkey, my second supervisor was Andrzej Szałas. My thesis was on Machine Learning Markets. I also did industrial internships in Microsoft Research (Redmond, working with Rich Caruana and Abdel-rahman Mohamed), Amazon (Berlin, Ralf Herbrich's group), Microsoft (Bellevue) and J.P. Morgan (London). Research group Jungkyu Park (PhD student at NYU Grossman School of Medicine) Taro Makino (PhD student at CDS, co-supervised with Kyunghyun Cho) Yanqi Zhu (PhD student at CDS) Jakub Chłędowski (visiting PhD student from Jagiellonian University) Amelia Dai (MS student at CDS) Pranav Singh (Research engineer at NYU Grossman School of Medicine, co-supervised with Miriam Bredella) Papers Google Scholar profile Code Meta-repository of screening mammography classifiers Weakly-supervised High-resolution Segmentation of Mammography Images for Breast Cancer Diagnosis Differences between human and machine perception in medical diagnosis Investigating and Simplifying Masking-based Saliency Methods for Model Interpretability An artificial intelligence system for predicting the deterioration of COVID-19 patients in the emergency department An interpretable classifier for high-resolution breast cancer screening images utilizing weakly supervised localization Deep Neural Networks Improve Radiologists' Performance in Breast Cancer Screening Classifier-agnostic saliency map extraction Breast density classification with deep convolutional neural networks High-Resolution Breast Cancer Screening with Multi-View Deep Convolutional Neural Networks",
  "content_length": 2723,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:35"
}