{
  "name": "Krzysztof Pawlikowski",
  "homepage": "http://www.cosc.canterbury.ac.nz/krys.pawlikowski",
  "status": "success",
  "content": "Computer Science and Software Engineering | University of Canterbury Skip to main content Use the Tab and Up, Down arrow keys to select menu items. Krzysztof Pawlikowski Professor Emeritus Qualifications Ph.D. (Distinction) in Computer Engineering and M.E. in Electronic Engineering, both from Gdansk University of Technology (Politechnika Gdańska), Poland. Contact Details krys.pawlikowski at canterbury.ac.nz Research Prof. Pawlikowski's current research interests are in the area of quantitative discrete-event simulation and credibility of its final results in particular. Special attention is given to applications of simulation in performance modelling and evaluation of telecommunication networks, including the Internet and social networks. One of goals is to extend the functionality of Akaroa2, a unique controller of quantitative stochastic simulation, designed under his leadership by the Simulation Research Group. The first version of Akaroa2 received an international commendation in Science category in the Computerworld Smithsonian Award, USA , in 1993, as Click to Enlarge the first full scale implementation of the concept of grid processing, and its documentation is kept in archives of the Smithsonian Museum of American History in Washington D.C. Possible topics of research projects at PhD, Master and Honours level include, for example: new sequential estimators for automated output data analysis during MRIP (Multiple Replications in Parallel) simulation; comparative studies of sequential estimators of mean values during steady-state simulation; sequential estimators of quantiles during steady-state simulation; sequentatial quantitative simulation of rare events; MRIP simulation and Variance Reduction; sequential analysis of heavy-tailed data and/or data from self-similar processes during steady-state simulation; Akaroa2 as an automated controller of distributed quantitative dscrete-event simulation. Background Professor K. Pawlikowski graduated from Technical University of Gdansk, Poland, with a Ph.D. (Distinction) in Computer Engineering, and was a member of academic staff there until 1984. He has been an academic member of staff in the Department of Computer Science & Software Engineering at the University of Canterbury in Christchurch, New Zealand since September 1984. He was Alexander-von-Humboldt Fellow at the Goethe University of Frankfurt an Main and at RWTH University in Aachen (1983/1994) and at Technical University of Berlin (1999). In 2014, he was awarded a title of Professor Emeritus by the Council of the University of Canterbury. As a Visiting Professor he gave lectures for postgraduate research students in Australia (University of New South Wales in Sydney, 2001), in Austria (University of Vienna in 2009) in Germany (RWTH University in Aachen in 2002 and 2006, Technical University of Berlin in 2004 and 2006, and University of Wuerzburg in 2009) in Italy (University of Genova in 2002, Technical University of Torino in 2000 and 2006) and in Sweden (Blekinge Institute of Technology in 2013). Full list of visiting appointments Prof. Pawlikowski gave over 170 invited lectures and seminar talks at over 100 universities and research institutions in New Zealand and Asia (Israel, Jordan, Malaysia, Singapore, Hong Kong, Macau and Vietnam), Australia , Europe (Austria, Denmark, France, Germany, Hungary, Italy, Latvia, Netherlands, Poland, Spain, Sweden, Switzerland and UK) and North America (Canada and USA), as well as keynote speeches, invited talks and tutorials at international conferences around the world. He is the author or co-author of over 190 peer-reviewed research publications, including 4 books on computer networks. Chairman or TPC Chair of a dozen of international conferences, member of technical program committees of over 110 international conferences. Technical editor of IEEE Network Magazine (1990-2000) and Int. J. of Communication Networks (Wiley; 2005-2006). Currently responsible for organizing ITNAC'2016 (International Telecommunication Networks and Applications Conference, Dunedin, New Zealand, Dec. 2016). At the University of Canterbury, co-founder of the Research Centre on Network Protocols, Distributed Processing and Simulation consisting of: Network Research Group, and Simulation Research Group, as well as the leader of PlanetLab NZ, on national experimental networking infrastructure within global experimental networking infrastructure/testbed PlanetLab. with members from Computer Science, Management, and Electrical & Computer Engineering. List of Publications until April 2013 Copies of Selected Publications: K. Pawlikowski. Steady state simulation of queuing processes: A survey of basic problems and solutions. ACM Computing Surveys, June 1990, 22(2): 123-170 (PDF, 1.58MB) D. McNickle, K. Pawlikowski and G. Ewing. Akaroa2: a Controller of Discrete-Event Simulation which Exploits the Distributed Computing Resources. Proc. European Conf. on Modelling and Simulation (ECMS 2010), Kuala Lumpur, Malaysia, June 2010 (PDF, 467KB) K. Pawlikowski, H.-D.J. Jeong and J.-S. Ruth Lee. On Credibility of Simulation Studies Of Telecommunication Networks (extended version). IEEE Communications Magazine, January 2002, 132-139 (PDF, 129KB) Additionally you can read Letters to the Editor of IEEE Comms. Magazine regarding this paper (PDF, 78.3KB); published in March 2003. Undergraduate and Graduate Courses taught before retirement: COSC 261: Foundations of Computer Science COSC 264: Data Communications and Networking COSC 364: Internet Technology and Engineering COSC 410: Simulation: Modelling and Analysis last time modified: 2 May 2013 Back to top",
  "content_length": 5661,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:39"
}