{
  "name": "Krzysztof R. Apt",
  "homepage": "http://www.bokus.com/bok/9780521866286/constraint-logic-programming-using-eclipse",
  "status": "success",
  "content": "Constraint Logic Programming using Eclipse - Krzysztof R Apt, Mark Wallace, Krzysztof R Apt, Mark Wallace, R Krzysztof Apt - Bok (9780521866286) | Bokus Gå till mobilversionen av bokus.com Cyber Monday - 10% på allt med kod CM25 >> : : : Fler böcker inom Programmering & programutveckling Format Inbunden (Hardback) Språk Engelska Antal sidor 348 Utgivningsdatum 2006-12-21 Förlag Cambridge University Press Dimensioner 180 x 255 x 20 mm Vikt 720 g ISBN 9780521866286 Constraint Logic Programming using Eclipse av Krzysztof R Apt, Mark Wallace, Krzysztof R Apt, Mark Wallace, R Krzysztof Apt (1 röst) | Läs 1 recension Inbunden, Engelska, 2006-12-21 994 10% rabatt på allt med kod CM25 Gäller endast idag 1/12. Villkor Köp Spara som favorit Skickas från oss inom 7-10 vardagar. Fri frakt över 249 kr för privatkunder i Sverige. Finns även som E-bok (LCP) Ladda ned och läs i Bokus Reader. 2315 Visa alla 1 format & utgåvor Constraint logic programming lies at the intersection of logic programming, optimisation and artificial intelligence. It has proved a successful tool in many areas including production planning, transportation scheduling, numerical analysis and bioinformatics. Eclipse is one of the leading software systems that realise its underlying methodology. Eclipse is exploited commercially by Cisco, and is freely available and used for teaching and research in over 500 universities. This book has a two-fold purpose. It's an introduction to constraint programming, appropriate for one-semester courses for upper undergraduate or graduate students in computer science or for programmers wishing to master the practical aspects of constraint programming. By the end of the book, the reader will be able to understand and write constraint programs that solve complex problems. Second, it provides a systematic introduction to the Eclipse system through carefully-chosen examples that guide the reader through the language and illustrate its power, versatility and utility. Visa hela texten Passar bra ihop + De som köpt den här boken har ofta också köpt Lectures in Game Theory for Computer Scientists av Krzysztof R Apt, Erich GräDel, Krzysztof R Apt, Erich Gradel, Erich Grädel (inbunden). Köp båda 2 för 2548 kr Kundrecensioner Det finns 1 recension av Constraint Logic Programming using Eclipse. Har du också läst boken? Om du har köpt den på Bokus.com vill vi gärna höra vad du tyckte om den! Sätt ditt betyg » Utmärkt bok om Constraint Logic Programming hakank (Malmö), 19 september 2011 Detta är en utmärkt bok för att lära sig Constraint Logic Programming med det Prologbaserade ECLiPSe CLP systemet. Det finns många bra exempel, och ett mycket bra kapitel om do-loop-kontruktionerna som är speciella för ECLiPSe. Tyckte du att den här recensionen var till hjälp? Ja Nej Anmäl Visa alla 1 recensioner Fler böcker av författarna Krzysztof R Apt, Mark Wallace, Krzysztof R Apt, Mark Wallace, R Krzysztof Apt Logic Programming Languages Krzysztof R Apt, J W De Bakker, J M Rutten 532 Köp Skickas inom vardagar. Getting Things Done for Teens David Allen, Mike Williams, Mark Wallace 44 Ladda ned Laddas ned direkt Green Christianity Mark Wallace 319 Köp Skickas inom vardagar. Building Decision Support Systems Mark Wallace 657 Köp Skickas inom vardagar. Du kanske gillar Edsger Wybe Dijkstra Krzysztof R Apt, Tony Hoare, Krzysztof R Apt Inbunden 1476 Edsger Wybe Dijkstra Krzysztof R Apt, Tony Hoare, Krzysztof R Apt Häftad 1027 Meta-Logics and Logic Programming Krzysztof R Apt, Franco Turini Trade Paperback 756 Logic Programming Languages Krzysztof R Apt, J W De Bakker, J M Rutten Häftad 532 Recent Advances in Constraints : Joint ERCIM/CoLogNET International Workshop on Constraint Solving and Constraint Logic Programming, CSCLP 2003, Budap Krzysztof R Apt, Francois Fages Perfect 643 Verification of Sequential and Concurrent Programs Krzysztof R Apt, Ernst-Rüdiger Olderog Perfect 643 How To Read A Church Richard Taylor, Dr Richard Taylor Häftad 160 Nexus Yuval Noah Harari Häftad 159 Minecraft: Mobs Glow-In-The-Dark Lock & Key Diary Insights Inbunden 199 Italian Brainrot: Tralalero Tralala & Friends. Francesco Memetti Book 169 Frågor & svar",
  "content_length": 4173,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:40"
}