{
  "name": "Kuan-Hao Huang",
  "homepage": "https://khhuang.me",
  "status": "success",
  "content": "Kuan-Hao Huang Kuan-Hao Huang Assistant Professor Texas A&M University Google Scholar | DBLP | Twitter | Blog | CV I am an Assistant Professor in the Department of Computer Science and Engineering at Texas A&M University, where I lead the FLAIR Lab. Before that, I was a Postdoctoral Research Associate at the University of Illinois Urbana-Champaign, working with Heng Ji. I received my Ph.D. in computer science from the University of California, Los Angeles, where I worked with Kai-Wei Chang and Nanyun Peng. My research focuses on natural language processing, aiming to develop trustworthy and generalizable language AI systems. I address fundamental challenges in robustness, reliability, safety, fairness, and adaptability to ensure that large language models (LLMs) and vision-language models (VLMs) are reliable and socially responsible. Currently, my research includes several key directions: (1) Robustness of LLMs and VLMs, (2) Multimodal Reasoning, and (3) Multilingual Understanding. I am looking for self-motivated students to join my group in Fall 2026. If you are interested in large language models, multimodal learning, or multilingual NLP, please find more information here. Office: PETR 219, Texas A&M University Phone: (979) 458-2205 Email: khhuang [at] tamu [dot] edu News [08.2025] I will be giving a talk about LLM robustness at William & Mary Data Science Colloquium in October [08.2025] We will be giving a tutorial on Robust and Trustworthy Large Language Models at ACML 2025 [07.2025] I will be giving a talk about LLM robustness at Rice AI Seminar Series in October [06.2025] Thrilled to receive the 2025 Google Research Scholar Award [05.2025] I will be giving talks at National Taiwan University, National Tsing Hua University, and Academia Sinica [05.2025] Our paper about contrastive visual data augmentation has been accepted by ICML 2025 [04.2025] I will serve as a Senior Area Chair for EMNLP 2025 [04.2025] Check out our SemEval 2025 paper about LLM unlearning [01.2025] Our paper on analyzing and mitigating position bias in LLMs has been accepted by ICLR 2025 [05.2024] Please check out our ACL 2024 Findings paper about event extraction benchmark [03.2024] Two papers have been accepted by NAACL 2024 [01.2024] Our paper about spurious correlations in text classification has been accepted by EACL-Findings 2024 [11.2023] Please check out our TextEE project about benchmakring event extraction [10.2023] Our paper about easily updated text representations has been accepted by EMNLP-Findings 2023 [09.2023] Please check out our AACL 2023 paper about zero-shot cross-lingual transfer [07.2023] Our ParaAMR paper receives ACL 2023 Area Chair Award [04.2023] Please check out our five papers accepted by ACL 2023 [10.2022] Our paper about syntactically controlled paraphrase generation has been accepted by EMNLP-Findings 2022 [04.2022] Our paper about generation-based event extraction for the low-resource setting has been accepted by NAACL 2022 [02.2022] Our paper about zero-shot cross-lingual event argument extraction has been accepted by ACL 2022 [08.2021] Our paper about zero-shot cross-lingual transfer has been accepted by EMNLP 2021 [More News] Experience Assistant Professor, Department of Computer Science and Engineering, Texas A&M University, 2024-present Postdoc, Department of Computer Science, University of Illinois Urbana-Champaign, 2023-2024 Ph.D., Computer Science, University of California Los Angeles, 2018-2023 M.S., Computer Science and Information Engineering, National Taiwan University, 2014-2016 B.S., Computer Science and Information Engineering, National Taiwan University, 2010-2014 Awards Google Research Scholar Award, 2025 Area Chair Award, ACL 2023 Thesis Honorable Mention Award, Taiwanese Association for Artificial Intelligence, 2016 Fourth Place, KDD Cup 2015, 2015 Second Place, ICASSP Signal Processing Cup, 2014 First Place, Track 1 of KDD Cup 2013, 2013 First Place, Track 2 of KDD Cup 2013, 2013 Services Senior Area Chair EMNLP (2025) Area Chair ACL Rolling Review (2024-2025), ACL (2024-2025), EMNLP (2024), NAACL (2025), EACL (2026), ICML (2026), NeurIPS (2025), ICLR (2026) Conference Program Committee/Reviewer ACL Rolling Review (2021-2023), ACL (2021-2023), EMNLP (2021-2023), NAACL (2022-2024), EACL (2023-2024), COLM (2024-2025), ICML (2020-2025), NeurIPS (2021-2024), ICLR (2021-2025), AAAI (2022-2025) Journal Reviewer Transactions on Machine Learning Research, Computational Linguistics Handbook Assistant EMNLP (2018)",
  "content_length": 4514,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:41"
}