{
  "name": "Kubra Kalkan-Cakmakci",
  "homepage": "https://faculty.ozyegin.edu.tr/kubrakalkan",
  "status": "success",
  "content": "Kübra Kalkan Kübra Kalkan Home Front Page Front Page Kübra Kalkan, PhD. Associate Professor, Department of Computer Science,Ozyegin University, Istanbul, Turkey Tel: +902165649150 Office: 103 Email: firstname.lastname@ozyegin.edu.tr Profile:Google Scholar       DBLP Biography Dr. Kübra Kalkan is a faculty  member in the Computer Science Department of Ozyegin University since 2018. She received her BSc and MSc degrees in Computer Science and Engineering department from Sabanci University in 2009 and 2011, respectively. She received her PhD degree from Bogazici University in 2016. After PhD, she worked as a post doctoral researcher in University of Oxford. She also worked as a visiting researcher at various institutions such as École Polytechnique Fédérale de Lausanne (EPFL), Microsoft Redmond WA and Northeastern University during her MSc and PhD. Her PhD thesis is rewarded IEEE Turkey PhD Thesis Award and Bogazici University BAP PhD Thesis Award. Research Interests Network Security Computer Networks Internet of Things (IoT) Peer-to-peer (P2P) Networks Software-defined Networking (SDN) Publications • Journals ZETROS: A Zero-Trust IoT Network Security Framework Using Distributed Blacklisting, Trust Scoring and Smart Contracts Cem Ata Baykara, Ilgın Şafak, Kübra Kalkan, Computer Networks (2023), 233, 109893. Details SliceScore: A Network Function Sharing Aware and Slice-Oriented DDoS Filtering Approach Ömer Zekvan Yılmaz, Kübra Kalkan, Fatih Alagöz IEEE Access  (2025), 13, 18294-18307. Details Differential Privacy Preserving Based Framework Using Blockchain for Internet of Things Muhammed Kashif, Kübra Kalkan, Peer to Peer Networking and Applications  (2025), 238, 110107. Details HostSec: A Blockchain Based Authentication Framework for SDN Hosts Majd Latah, Kübra Kalkan, Peer to Peer Networking and Applications  (2024), 17 (4), 2354-2370. Details A Systematic Mapping on Software Testing for Blockchains Anıl Elakaş, Hasan Sözer, Ilgın Şafak, Kübra Kalkan, Cluster Computing (2024), 27 (6), 7111-7126. Details EPIoT: Enhanced Privacy Preservation Based Blockchain Mechanism for Internet of Things Muhammed Kashif, Kübra Kalkan, Computer Networks (2024), 238, 110107. Details SOREC: Self-Organizing and Resource Efficient Clustered Blockchain Network Orkun Doğan, Kübra Kalkan, Computer Networks (2023), 233, 109893. Details CWT-DPA: Component-wise waiting time for BC-enabled data plane authentication Majd Latah, Kübra Kalkan, Computer Networks (2022), 219, 109423. Details When SDN and blockchain shake hands Majd Latah, Kübra Kalkan, Communications of the ACM (2022), 65 (9), 68-78. Details SUTSEC: SDN Utilized Trust based Secure Clustering in IoT Kübra Kalkan, Computer Networks (2020), 178, 107328. Details TruSD: Trust framework for service discovery among IoT devices Kübra Kalkan and Kasper Rasmussen, Computer Networks (2020), 178, 107318. Details JESS: Joint entropy-based DDoS defense scheme in SDN Kübra Kalkan, Levent Altay, Gürkan Gür, and Fatih Alagöz, IEEE Journal On Selected Areas In Communications (2018), 36(10), 2358-2372. Details Securing internet of things with software defined networking Kübra Kalkan and Sherali Zeadally, IEEE Communications Magazine (2017), 56(9), 186-192. Details Defense mechanisms against DDoS attacks in SDN environment Kübra Kalkan, Gürkan Gür, and Fatih Alagöz, IEEE Communications Magazine (2017), 55(9), 175-179. Details A distributed filtering mechanism against DDoS attacks: ScoreForCore Kübra Kalkan and Fatih Alagöz, Computer Networks (2016), 108, 199-209. Details Filtering-Based Defense Mechanisms Against DDoS Attacks: A Survey Kübra Kalkan, Gürkan Gür, and Fatih Alagöz, IEEE Systems Journal (2016), 11(4), 2761-2773. Details Privacy-preserving optimal meeting location determination on mobile devices Igor Bilogrevic, Murtuza Jadliwala, Vishal Joneja, Kübra Kalkan, Jean-Pierre Hubaux, and Imad Aad, IEEE transactions on information forensics and security (2014), 9(7), 1141-1156. Details Key distribution scheme for peer-to-peer communication in mobile underwater wireless sensor networks Kübra Kalkan and Albert Levi, Peer-to-Peer Networking and Applications (2014), 7, 698–709. Details • Conferences QupkIoT: Quic Based P2P Public Key Infrastructure for IoT In CS & IT Conference Proceedings , (15-13). Details SDN-API-Sec: A ConflictFree BC-Based Authorization for Cross-Domain SDNs Majd Latah, Kübra Kalkan, In IEEE 8th Cyber Security in Networking Conference (CSNet), (pp. 68-75). Details Genchain: A Blockchain Based Genetic Disease Prediction System Muhammed Esad Simitçioğlu, Kübra Kalkan, In IEEE 6th International Conference on Blockchain Computing and Applications (BCCA), (pp. 605-610). Details TEMBUV: Trust Ensuring Mechanism Based On Blockchain Using UAVs and VANETs İpek Motorcu, Emin Mektepli, Arda Hacıfevzioğlu, Kübra Kübra Kalkan, In IEEE 6th Conference on Blockchain Research & Applications for Innovative Networks and Services (BRAINS), (pp. 1-4). Details Towards Test Automation for Certification Tests in the Banking Domain  Anıl Elakaş, Ozan Tarlan, Ilgın Şafak, Kübra Kalkan, and Hasan Sözer In IEEE 8th International Conference on Computer Science and Engineering (UBMK) (pp. 364-369). Details IBAM: IPFS and Blockchain based Authentication for MQTT protocol in IoT Bahadır Karakaş and Kübra Kalkan In IEEE Symposium on Computers and Communications (ISCC) 2023, ( pp. 537-542).   Details DiBLIoT: a distributed blacklisting protocol for IoT device classification using the hashgraph consensus algorithm  Ozan Tarlan, Ilgın Şafak and Kübra Kalkan In 2022 International Conference on Information Networking (ICOIN), (pp. 84-89).   Details BCPriPIoT: BlockChain utilized privacy-preservation mechanism for IoT devices   Muhammed Kashif and Kübra Kalkan In 2021 IEEE International Conference on Blockchain Computing and Applications (BCCA),  ( pp. 84-89).   Details SHAPEIoT: secure handshake protocol for autonomous IoT device discovery and blacklisting using physical unclonable functions and machine learning  Cem Ata Baykara, Ilgın Şafak and Kübra Kalkan In 2021 I13th International Conference on Network and Communications Security (NCS).   Details DPSec: A blockchain-based data plane authentication protocol for SDNs Majd Latah and Kübra Kalkan, In 2020 IEEE International Conference on Blockchain Computing and Applications (BCCA), (pp. 22-29). IEEE. Details SeCaS: Secure Capability Sharing Framework for IoT Devices in a Structured P2P Network Angeliki Aktypi, Kübra Kalkan, and Kasper B. Rasmussen, In 2020 Proceedings of the Tenth ACM Conference on Data and Application Security and Privacy), (pp. 271-282). ACM. Details SDNScore: A statistical defense mechanism against DDoS attacks in SDN environment Kübra Kalkan, Gürkan Gür, and Fatih Alagöz, In 2017 IEEE Symposium on Computers and Communications (ISCC), (pp. 669-675). IEEE. Details Emailprofiler: Spearphishing filtering with header and stylometric features of emails Sevtap Duman, Kübra Kalkan, Manuel Egele, William Robertson, and Engin Kirda, In 2016 IEEE 40th Annual Computer Software and Applications (COMPSAC), (pp. 408-416). IEEE. Details Privacy in mobile computing for location-sharing-based services Igor Bilogrevic, Murtuza Jadliwala, Kübra Kalkan, Jean-Pierre Hubaux, and Imad Aad, In 2011 International Symposium on Privacy Enhancing Technologies, (pp. 77-96). Springer. Details An approach for classifying program failures Burcu Ozcelik, Kübra Kalkan, and Cemal Yilmaz, In 2010 Second International Conference on Advances in System Testing and Validation Lifecycle, (pp. 93-98). IEEE. Details A highly resilient and zone-based key predistribution protocol for multiphase wireless sensor networks Kübra Kalkan, Sinem Yilmaz, Omer Zekvan Yilmaz, and Albert Levi, In 2009 Proceedings of the 5th ACM symposium on QoS and security for wireless and mobile networks, (pp. 29-36). ACM. Details • Book Chapters Underwater and Submerged Wireless Sensor Systems: Security Issues and Solutions Kübra Kalkan, Albert Levi, and Sherali Zeadally, Wireless Sensor Systems for Extreme Environments, Chapter 15, (pp. 311-324). John Wiley & Sons, Ltd. Details Graduated Students Arda Hacıfevzioğlu (MSc 2025, Currently: PhD in University of Luxemburg) Muhammed Kashif (PhD 2024, Currently: Higher Education Commission in Pakistan) Hüseyin Tuncel (MSc 2024, Currently: working at VESTEL) Majd Latah (PhD 2023, Currently: Post-Doc in Hamburg University) Cem Ata Baykara(MSc 2023, Currently: PhD in Tubingen University) Muhammed Yasir (MSc 2023, Currently: PhD in University of Zurich) Orkun Doğan ((MSc 2023, Currently: working at ARUP) Ozan Tarlan (MSc 2022, Currently: PhD in Ozyegin University) Elnaz Dadvar (MSc 2022) Current Students Ozan Tarlan PhD candidate Yasin Ughur MSc student Emin Şahin Mektepli MSc student Hakan Karaduman MSc student İpek Motorcu Undergraduate student Copyright © 2023 – All Rights Reserved Recent Posts Hello world! Recent CommentsA WordPress Commenter on Hello world!Archives January 2021 Categories Uncategorized Meta Log in Entries feed Comments feed WordPress.org This is a personal web area hosted on an Ozyegin University web server. The university accepts no responsibility or liability for the contents of this area. Theme adapted from NeoEase.",
  "content_length": 9260,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:42"
}