{
  "name": "Kui Jia",
  "homepage": "http://kuijia.site",
  "status": "success",
  "content": "Kui Jia@CUHK-SZ JIA, Kui Professor, The Chinese University of Hong Kong, Shenzhen I am a Professor with School of Data Science, The Chinese University of Hong Kong, Shenzhen. I have been the Director of Geometric Perception and Intelligence Research Lab (Gorilla Lab) since 2017. I was previously affiliated with South China University of Technology, University of Macau, and UIUC Advanced Digital Science Center. My research interests are in computer vision and machine learning. My recent research focuses on deep learning theories and optimization, and applications of deep learning to non-Euclidean data. Email: kuijia AT gmail.com or kuijia AT cuhk.edu.cn Research  /  Students  /  Teaching  /  Publications  / Datasets / Codes / News March 24th, 2022: I start to serve as an Action Editor for the newly launched open-review journal of Transactions on Machine Learning Research (TMLR). You are welcome to try the new way of machine learning publication. March 31st, 2021: Happy to announce the release of 3D AfforanceNet, the first 3D dataset for study of visual object accordance learning. 3D AffordanceNet is a benchmark consisting of 23K object shapes annotated with 18 visual affordance categories. It supports full- or partil-view affordance estimations in different learning setups. Welcome to download and use the dataset. Feedback are welcome! March 3rd, 2021: Congratulations to Mingyue Yang, Yuxin Wen, Jiapeng Tang, Wenbin Zhao, Jiabao Lei, and Shengheng Deng for their papers accepted to CVPR 2021. September 26th, 2020: Congratulations to Chaozheng Wu and Jian Chen for their equally contributed paper accepted to NeurIPS 2020. The paper presents the first end-to-end solution of Grasp Proposal Networks for learning 6DoF robotic grasps from visual observations. Data, codes, and configuration of simulation are coming soon. September 9th, 2020: I start to serve as an Associate Editor for IEEE Trans. on Image Processing. July 3rd, 2020: Two papers accepted to ECCV 2020, including one spotlight paper. June 20th, 2020: We had a successful CVPR 2020 Worshop on Deep Learning Foundations of Geometric Shape Modeling and Reconstruction. Thanks to all invited speakers and co-organizers! Talk videos are still available on the workshop page. June 1st, 2020: Two papers accepted to ICML 2020. Congratulations to Yuxin Wen, Shuai Li, and Jiabao Lei. Lei's paper presents theoretically guaranteed mesh recovery algorithm of Analytic Marching. Wen and Li's paper explains regularization effect of adversarial training on deep networks. For prospective students Gorilla Lab is always looking for self-motivated, truly strong MPhil./Ph.D. students, research assistants/associates or postdocs. Interested candidates please email me your updated CV, and refer to here for more details. Please contact me via email if you want to have an intern at Gorilla Lab.",
  "content_length": 2867,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:42"
}