{
  "name": "Kuldeep S. Meel",
  "homepage": "https://www.cs.toronto.edu/~meel",
  "status": "success",
  "content": "Kuldeep Meel Toggle navigation Kuldeep S. Meel Stephen Fleming Early Career Associate Professor School of Computer Science Georgia Institute of Technology (On leave: Associate Professor, University of Toronto) CV: [pdf] | Bio: [txt] Research Group Office: KACB 3410 Email: meel@cs.toronto.edu Tools: Github Publications: [html] Talks/Slides: [html] External: [Scholar] [DBLP] New: Don Knuth's note on our algorithm for Distinct Element Estimation. Here is Quanta Magazine's story on the work. Read more on the events leading to Knuth's article here. About I hold Stephen Fleming Early-Career Associate Professorship in the School of Computer Science, and an Associate Professor at the University of Toronto (on leave). Prior to moving to Toronto, I held NUS Presidential Young Professorship (at the rank of Assistant Professor) in the School of Computing at the National University of Singapore. I am a recipient of the 2019 NRF Fellowship for AI, ACP 2022 Early Career Researcher Award, and was named AI's 10 to Watch by IEEE Intelligent Systems in 2020. My primary research interest is in automated reasoning. The long-term vision of my research program is to advance automated reasoning techniques to enable computing to deal with increasingly uncertain real-world environments. The core theme of my research program is the quest for scalability. Accordingly, our work straddles theory and practice, and draws upon ideas from randomized algorithms, statistical inference, formal methods, distribution testing, and software engineering. Check out Research Statement (last updated: Dec 2021) and publications for more details. Our research group is still growing. Check out Open Positions. Awards and Honors Individual Awards ACP Early Career Award, 2022 [Press1] [Press2] IJCAI-22 Early Career Spotlight, 2022 AI's 10 to Watch by IEEE Intelligent Systems, 2020 2019 NRF Fellowship for AI [Press] 2018 Ralph Budd Award for research in Engineering. Honorable mention for 2018 ACP Doctoral Dissertation Award 2014 Outstanding Masters Thesis Award from the Vienna Center for Logic and Algorithms Research Paper Recognition CAV-24 Paper received Distinguished Paper Award ICLP-24 Paper received Best Paper Award ICDT-24 Paper invited to LMCS Issue dedicated to the best papers from ICDT 2024 CACM Research Highlights (2023) CAV-23 paper received Distinguished Paper Award and invited to FMSD issue dedicated to the best papers from CAV 2023 DATE-23 paper received Best Paper Award Nomination Knuth's Note on ESA-22 Paper ACM SIGMOD Research Highlight (2022) CAV-22 Paper invited to FMSD issue dedicated to the best papers from CAV 2022 ICCAD-21 paper received Best Paper Award Nomination (6 out of 121 papers) CAV-20 Paper invited to FMSD issue dedicated to the best papers from CAV 2020 CP 2018 paper invited to IJCAI-19 Sister Conferences Best Paper Award Track Best Student Paper Award, CP 2015 CP 2013 paper selected as one of the 25 papers across 25 years of CP anniversary volume (2019) Teaching Recognition NUS (university-level) Annual Teaching Excellence Award, 2023; Recent Student Feedback: [CS4244] [CS3243] NUS (university-level) Annual Teaching Excellence Award, 2022 School of Computing Faculty Teaching Honor Roll, 2023-27 School of Computing Faculty Teaching Excellence Award, 2023 School of Computing Faculty Teaching Excellence Award, 2022 School of Computing Faculty Teaching Excellence Award, 2021 Software Recognition Model Counting Competition 2024: 1st place in All Three Tracks 2023: 1st place in Projected Model Counting Track 2022: 1st place in Model Counting Track and Projected Model Counting Track 2021: 2nd place in Model Counting Track 2020: 1st place in Model Counting Track and Projected Model Counting Track 2nd place in EDA Challenge 2021 3rd place in SAT competition 2020 Students & Postdocs Learn more at Group Website PhD Students: Md Mohimenul Kabir; Uddalok Sarkar (co-advised with Sourav Chakraborty); Arijit Shaw ; Jack Sun; Yifan Ruan; Yang Suwei; Jiong Yang Post-docs: Dr. Paulius Dilkas; PhD Graduates Yash Pote (2025) PhD Thesis:Towards Practical Distribution Testing [pdf] Next Position: Post-doc at NUS Teodora Baluta (2024), co-advised with Prateek Saxena PhD Thesis: Rigorous Security Analysis of Machine Learning Systems [pdf] Next Position: Assistant Professor, Georgia Institute of Technology Priyanka Golia (2023), co-advised with Prof. Subhajit Roy PhD Thesis: Functional Synthesis via Formal Methods and Machine Learning [pdf] ACM India Doctoral Dissertation Award 2024 Next Position: Assistant Professor, (CISPA and then IIT Delhi) Bishwamittra Ghosh (2023) PhD Thesis: Interpretability and Fairness in Machine Learning: A Formal Methods Approach [pdf] Next Position: Post-doc, Max Planck Institute for Software Systems (MPI-SWS), Saarbrucken, Germany Senior Research Fellow/Research Scientist Mate Soos, Senior Research Fellow (Mar-June 2024; Mar-June 2023; Jul-Sep 2019; Mar-June 2018) Post-doc \"Grduates\" Gunjan Kumar (March 2021-July 2024) Next Position: Assistant Professor at IIT Kanpur Timothy van Bremen (June 2022-June 2024) Next Position: Assistant Professor at Nanyang Technological University (NTU), Singapore Anna Latour (Feb 2022-Apr 2024) Next Position: Assistant Professor at Delft University of Technology Lawqueen Kanesh (Jan 2021-Dec 2021) Next Position: Assistant Professor, IIT Jodhpur Jaroslav Bendik (Jan 2021-Apr 2021) Next Position: Post-doc at MPI-SWS; Current Position: Team Lead at Certora Vignesh Sivaraman (Sep 2020-Apr 2021) Next Position: Assistant Professor at IIIT Hyderabad. Yong Lai (Aug 2019-Aug 2020) Next Position: Associate Professor at Jilin University Masters Graduates Alexis de Colnet, MComp@NUS (Graduated: Dec 2018); now post-doc at TU Wien Rahul Gupta, BTech+MTech@IITK ( co-advised with Subhajit Roy (IITK) Shubham Sharma, BTech+MTech@IITK (Graduated: May 2019), co-advised with Subhajit Roy (IITK) Delannoy Remi Christian, MComp@NUS, (Graduated: Dec 2019) Lorenzo Ciampiconi, MS@Politecnico di Milano (Graduated: Dec 2019) Publications Full publication list, organized by Research Topic Year Publication Type Teaching CSC2512: Advanced Propositional Reasoning (Fall 2023) CS3243: Introduction to Artificial Intelligence (Spring 2024; Fall 2021; Fall 2020) CS 4244: Knowledge Representation and Reasoning (Spring 2023; Spring 2021; Spring 2020; Spring 2019; Spring 2018) CS 4269/5469: Fundamentals of Logic in Computer Science (Fall 2019) CS 6283: Advanced Topics in Computer Science: Logic in AI (Fall 2018) Service Program Co-Chair: SAT 2022 Co-organizer: Beyond Satisfiability at Simons's Institute Program on Satisfiability: Theory, Practice, and Beyond (Co-chair) CP 2020 Doctoral Program Workshop on Counting and Sampling (since 2020) (Sponsorship Co-chair) KR 2021 1st Workshop on Probabilistic Reasoning and Formal Methods Indian SAT-SMT Winter School (since 2019). Recent Program Committee: SAT-22 (Program Co-chair), PODS-24, ICML-23 (AC), CAV-23, SAT-23, IJCAI-23 (SPC), AISTATS-23 (AC), FMCAD-23, AAAI-23, FoSSaCS-23, AAAI-22 (SPC),FMCAD-22, IJCAI-22 (AC), CAV-22, NeurIPS-21 (AC), IJCAI-21 (SPC), AAAI-21 (SPC), FMCAD-21 Awarded Distinguished Program Committee Member for IJCAI 2018. Selected Recorded Talks Counting, Sampling, and Synthesis: The Quest for Scalability [slides] [video](@NUS) Functional Synthesis: An Ideal Meeting Ground for Formal Methods and Machine Learning [slides] [video](@Wisconsin) Approximate Counting and Sampling [slides] [video] (@Simons Institute) The Rise of Approximate Model Counting: Beyond Classical Theory and Practice of SAT [slides] [video](@Simons Institute) A detailed list of talks (along with slides) is available [here]. News 12 November 2025 Our KR-25 paper received the Marco Cadoli Best Student Paper Award. Congratulations to my students, Arijit Shaw and Uddalok Sarkar. 23 January 2025 Our paper on computational explorations of total variation distance is accepted to ICLR-25. 22 January 2025 AISTATS-25: [Distance Estimation for High-Dimensional Discrete Distributions][paper] (Gunjan Kumar, Kuldeep S. Meel, and Yash Pote) 10 December 2024 We have three papers accepted to AAAI-25. The first paper takes a step towards real-time approximate model counting. Joint work with Jiong Yang and Yash Pote. The second paper focuses on probabilistic explanations for linear models. Joint work with Bernardo Subercaseaux and Marcelo Arenas. The third paper focuses on projected and incremental pseudo-boolean model counting. Joint work with Suwei Yang. All news…",
  "content_length": 8519,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:45"
}