{
  "name": "Kun Xie 0001",
  "homepage": "https://cskxie.github.io",
  "status": "success",
  "content": "Home · Welcome to Dr.Kun Xie's Page Home Dr. Kun Xie, Hunan University Biography Dr. Kun Xie is currently a Professor of College of Computer Science and Electronic Engineering at Hunan University, Changsha, China. She is also the Associate Dean of the Department of Computer Engineering. Her research interests include Computer Networks, Network Security, Big Data, and AI. She has co-authored 2 books, and published over 100 papers in major international journals and conference proceedings such as IEEE/ACM ToN, IEEE TMC, IEEE TC, IEEE TWC, IEEE TSC and IEEE INFOCOM，IEEE ICDCS, IEEE/IFIP DSN, IEEE SECON, IEEE/ACM IWQoS. She received Best Paper Runner from IEEE ICDCS 2016. Dr. Xie has directed and participated in many research and development projects and obtained grants from funding agencies such as National Natural Science Foundation of China (NSFC), Outstanding Youth Fund of Hunan Province, 863, 973, Defense research foundation of China, National Science and Technology Support Program of China. She has involved in the application of over 40 patents, among which 20 patents have been issued. Dr. Xie also receives the Young Excellent Teacher Award of Hunan Province, the Yuelu Scholar Award and the Research and Innovation Award of Hunan University. Research Area Computer Networks, Network Security, Big Data, and AI Contact me cskxie#gmail.com / cskxie#hnu.edu.cn For students I am currently looking for Ph.D students doing supervised research or independent study with me at CSEE, Hunan University. If you are a well-motivated and dedicated student pursuing a PH.D. degree related to the areas of AI, Big data, Network Security, Computer networks, and future network technologies, please feel free to contact at me. Related Links Selected Papers Visit my work @ HNU in Chinese (中文) results matching \"\" No results matching \"\"",
  "content_length": 1840,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:47"
}