{
  "name": "Kun Yang 0001",
  "homepage": "https://www.essex.ac.uk/people/yangk82907/kun-yang",
  "status": "success",
  "content": "Kun Yang | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Kun Yang People Professor Kun Yang Professor School of Computer Science and Electronic Engineering (CSEE) Email kunyang@essex.ac.uk Location 1NW.4.20, Colchester Campus Academic support hours 10am-12noon, Thursday during term time Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Head of the Network Convergence Laboratory (NCL) I am a Member of Academia Europaea (MAE), a Fellow of IEEE, a Fellow of IET (Institute of Engineering and Technology), a Fellow of BCS (British Computing Society) and a Distinguished Member (DM) of ACM. I serve as the Chair of IEEE ComSoc Smart Grid Communications (2024-2025) and Vice Chair of IEEE ComSoc Green Communications and Computing (2023-2024). I received my PhD degree from University College London (UCL) in the area of communication networks and services. After 3 years' post-doc research in the Department of EEE at UCL working on EU research projects such as FAIN (Future Active IP Networks), MANTRIP and CONTEXT, I moved to University of Essex at 2003 to become an academic staff. Now I am a Chair Professor in the School of Computer Science and Electronic Engineering (CSEE), University of Essex, leading the Network Convergence Laboratory (NCL). My current research activities are focused on advancing new technologies related to communication and network systems, and on the fundamentals underlying them, including communication theory, algorithms, network science, machine learning and edge intelligence. In particular I am interested in energy aspects of future communication systems such as 6G, promoting energy self-sustainability via both energy efficiency (green communications and networking) and energy harvesting (wireless charging). Now I am also researching into applying modern AI into wireless networks. I have published 500+ technical papers and 2 monographs in the above areas, winning more than 10 best paper awards by either IEEE conferences or IEEE technical committees. I have been managing research projects funded by various sources such as UK EPSRC, EU FP7/H2020 and industries (e.g., British Telecom). I coordinated one EU FP7 research project (EVANS). I have been a Judge of GSMA Global Mobile Awards (MWC-Barcelona) since 2019 and a member of UK EPSRC Peer Review College since 2008. I serve on editorial boards of both IEEE journals (e.g., IEEE TNSE, ComMag, TNB, TVT) and non-IEEE journals (e.g., Deputy EiC of IET Smart Cities). I have been actively organizing international conferences/symposia/workshops, such as IEEE ComSoc flagship conference Globecom/ICC. I was a Distinguished Lecturer of IEEE ComSoc (2020-2021) and a Recipient of the prestigious 2024 IET Achievement Medals and also 2024 IEEE CommSoft TC Technical Achievement Award. Qualifications PhD University College London (UCL), MSc Jilin University, BSc Jilin University, Appointments University of Essex Full Professor, School of Computer Science & Electronic Engineering (CSEE), University of Essex (1/10/2011 - present) Reader, Dept. of Electronic Systems Engineering, University of Essex (1/10/2008 - 30/9/2011) Lecturer, Dept. of Electronic Systems Engineering, University of Essex (1/8/2003 - 30/9/2008) Research and professional activities Research interests Wireless networks and communications, AI for Communications, UAV-enabled Wireless Communications Key words: wireless networks Open to supervise mobile edge computing, edge intelligence Key words: communication and computation cooperation Open to supervise data and energy integrated communication networks (DEIN) Key words: RF wireless energy transfer Open to supervise Teaching and supervision Current teaching responsibilities C Programming and Embedded Systems (CE243) MSc Project and Dissertation (CE901) MSc Project and Dissertation Preparation (CE997) Previous supervision Xiao Wang Thesis title: Effective Scheduling Algorithms for Cross-Interference Mitigation in Heterogenous Wireless Networks Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 7/7/2021 Yitian Zhang Thesis title: Adaptive Resource Allocation Algorithms for Data and Energy Integrated Networks Supporting Internet of Things Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 16/11/2020 Yue Sun Thesis title: Channel Modelling of Blood Capillary-Based Molecular Communication Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 6/7/2018 Yunong Han Thesis title: Load-Aware Traffic Control in Software-Defined Enterprise Wireless Local Area Networks Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 5/7/2018 Yasser Obaid H Alharbi Thesis title: A Network-Aware Virtual Machine Placement Approach for Data-Intensive Applications in a Cloud Environment. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 12/2/2018 Xuan Du Thesis title: Map-Assisted Indoor Positioning Utilizing Ubiquitous Wifi Signals Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 12/2/2018 Sahar Ahmadzadeh Ghahnaviehei Thesis title: Real-Time Pricing Algorithms with Uncertainty Consideration for Smart Grid Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 15/12/2017 Tuo Feng Thesis title: Zigbee-Based Firmware Updating Algorithms in Smart Home Environment Degree subject: Electronic Systems Engineering Degree type: Master of Science (by Dissertation) Awarded date: 24/11/2017 Junyi Wei Thesis title: Qos-Aware Joint Power and Subchannel Allocation Algorithm for Wireless Network Virtualization Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 7/8/2017 Chathura Madhusanka Sarathchandra Magurawalage Thesis title: Network-Aware Resource Management for Mobile Cloud Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 14/2/2017 Nikolaos Vastardis Thesis title: Socially-Aware Routing in Delay-Tolerant Mobile Social Networks Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 29/10/2014 Saima Abdullah Thesis title: Energy Efficient and Network-Aware Message Scheduling in Internet of Things Environment Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 28/5/2014 Andreas Bontozoglou Thesis title: Qos-Aware Resource Management for Fixed-Mobile Converged Networks Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 6/9/2013 Publications Journal articles (390) Chen, S., Wang, X., Wei, X., Sun, Y. and Yang, K., (2026). Deeply understanding features to achieve efficient remote sensing image classification. Expert Systems with Applications. 295, 128743-128743 Liao, J., Xiang, L., Zhong, S., Xiao, L., Liu, H. and Yang, K., (2025). Cooperative Base Station Assignment and Resource Allocation for 6G ISAC Network. IEEE Transactions on Vehicular Technology, 1-13 Jiang, F., Tu, S., Zhang, J., Dong, L., Wang, K., Yang, K. and Pan, C., (2025). M4SC: An MLLM-Based Multi-Modal, Multi-Task and Multi-User Semantic Communication System. IEEE Wireless Communications. 32 (5), 40-47 Yang, Z., Hu, J., Zhang, D., Zhong, S., Min, G. and Yang, K., (2025). Network-aware Distributed Learning Path Optimization via Graph-based Knowledge Tracing. IEEE Transactions on Network Science and Engineering, 1-14 Peng, Y., Jiang, F., Dong, L., Wang, K., Yang, K., Pan, C. and You, X., (2025). Large Generative Model Assisted 3D Semantic Communication. IEEE Transactions on Wireless Communications, 1-1 Luo, C., Hu, J., Xiang, L. and Yang, K., (2025). Reconfigurable Intelligent Sensing Surface enables Wireless Powered Communication Networks: Interference Suppression and Massive Wireless Energy Transfer. IEEE Transactions on Communications, 1-1 Che, C., Zheng, K., Cui, J., Xiang, L., Hu, J., Yang, K., Zhao, D. and Tong, C., (2025). Polar Coded Digital Twin Network: An End-to-End Design With GAN Prediction. IEEE Transactions on Vehicular Technology, 1-6 Yan, K., Xiang, L., Zheng, K., Hu, J., Yang, K. and Liu, J., (2025). UAV-Assisted Integrated Active and Passive Sensing with Communication: A Hybrid-SAC Approach. IEEE Transactions on Vehicular Technology, 1-12 Huang, Q., Zhao, Y., Hu, J., Yang, K. and Fang, Y., (2025). Circular Holographic MIMO Beamforming for Integrated Data and Energy Multicast Systems. IEEE Transactions on Wireless Communications, 1-1 Zhang, S., Hu, J., Zhao, Y. and Yang, K., (2025). Low Complexity Pilot Power Control for Long-Term Energy Sustainability in Cell-Free Networks. IEEE Transactions on Vehicular Technology, 1-13 Wang, Y., Hu, X., Li, A., Masouros, C., Wong, K-K. and Yang, K., (2025). ISAC Enhancement with Interference Exploi",
  "content_length": 122470,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:49"
}