{
  "name": "Kun Sun 0001",
  "homepage": "https://csis.gmu.edu/ksun",
  "status": "success",
  "content": "Dr. Kun Sun's Homepage Dr. Kun Sun Professor, Information Sciences and Technology (IST) Associate Director, Center for Secure Information Systems (CSIS) Director, Sun Security Laboratory (Sunlab) George Mason University E-Mail:  ksun3@gmu.edu Phone:  (703) 993-1715 Fax:    (703) 993-4776 Address: Research Hall, Suite 417 George Mason University 4400 University Drive Fairfax, VA 22030-4422~~ Dr. Kun Sun is a Professor at George Mason University. He received his Ph.D. in Computer Science from North Carolina State University. His research focuses on systems and network security, with more than 20 years of working experience in both industry and academia. He also serves as the Director of the Sun Security Laboratory (SunLab) and the Associate Director of the Center for Secure Information Systems (CSIS). He is the Principal Investigator for the NSF’s CyberCorps® Scholarship for Service (SFS) program at Mason. He won the Presidential Award for Faculty Excellence in Research from George Mason University in 2022. Also, he won the Distinguished Paper Awards in NDSS 2024 and NDSS 2025. What's New? [Esorics TPC Co-Chair] Invited to serve as TPC co-chair for Esorics 2026. [CCS TPC] Invited to serve in the TPC of Machine Learning and Security Track for CCS 2026. [SecDev 25] One conference paper titled \"PathFix: Automated Program Repair with Expected Path\" accepted by IEEE SecDev 2025. Congrats to Xu. [ACSAC TPC] Invited to serve in the TPC of ACSAC 2025. [AsiaCCS 25] One conference paper titled \"ChainMarks: Securing DNN Watermark with Cryptographic Chain\" accepted by ACM AsiaCCS 2025. Congrats to Shu. [CCS 25] One conference paper titled \"Training Robust Classifiers for Classfiying Encrypted Traffic under Dynamic Network Conditions\" accepted by ACM CCS 2025. Congrats to Yuqi. [CCS 25] One conference paper titled \"Off-Path TCP Exploits: PMTUD Breaks TCP Connection Isolation in IP Address Sharing Scenarios\" accepted by ACM CCS 2025. Congrats to Xuewei. [DIMVA 25] One conference paper titled \"An Empirical Study of Multi-Language Security Patches in Open Source Software\" accepted by DIMVA 2025. Congrats to Shiyu and Yunlong. [Usenix Security 25] One conference paper titled \"TYPEPULSE: Detecting Type Confusion Bugs in Rust Programs\" accepted by Usenix Security 2025. Congrats to Rafael. [Usenix Security 25] One conference paper titled \"DISPATCH: Unraveling Security Patches from Entangled Code Changes\" accepted by Usenix Security 2025. Congrats to Shiyu and Yunlong. [NDSS TPC] Invited to serve in the TPC of NDSS 2026. [CACM 25] One magazine paper titled \"Exploiting Cross-Layer Vulnerabilities: Off-Path Attacks on the TCP/IP Protocol Suite\" published in Communications of the ACM, 03/2025. [Distinguished Paper Award] Our paper titled \"ReDAN: An Empirical Study on Remote DoS Attacks against NAT Networks\" won the Distinguished Paper Award in NDSS 2025. [STS Top 40 Finalist] Our high school summer intern, Elisa Zhang, has been named a top 40 finalist in the 84th Regeneron Science Talent Search, 2025. [news1][news2] Dr. Xu He successfully defended his PhD thesis and joined Visa Inc. as a research scientist. Congrats to Xu. [NDSS 25] One paper titled \"An Empirical Study on Remote DoS Attacks against NAT Networks\" accepted by NDSS 2025. [NDSS 25] One paper titled \"Off-Path TCP Hijacking in Wi-Fi Networks: A Packet-Size Side Channel Attack\" accepted by NDSS 2025. [PatchDB] We release a large-scale security patch dataset called PatchDB that contains around 12K security patches and 24K non-security patches from the real world (Download Link). Research Interests Cyber Deception/Moving Target Defense: Against the experts in defense, the enemy does not know where to attack. -- SunTzu Software Security: software supply chain security, security patch management, automatic program repair. AI Security: adversarial machine learning, automatic speech recognition security, Graph Neural Network. Confidential Computing: TPM/SMM/TrustZone/SGX, VM/Container. Network Security: Internet security, IoT security, SDN security, wireless security. Students Current Students: Tommy Chin, PhD Shiyu Sun, PhD Rafael Chen, PhD Yunlong Xing, PhD Di Wu, PhD Shiqi Liu, PhD Noah J Korzak, MS Samuel Lee Best, BS Former PhD Students: Xu He, PhD, January 2025, Initial placement at Visa Inc. Shu Wang, PhD, November 2023, initial placement at Palo Alto Networks. Xinda Wang, PhD, April 2023, initial placement at UT Dallas. Songsong Liu, PhD, July 2022, initial placement at Security Innovation, Inc. Jie Wang, PhD, June 2021, initial placement at Huazhong University of Science and Technology. Shengye Wan, PhD, August 2020, initial placement at Facebook. Jianhua Sun, PhD, August 2019, initial placement at Facebook. Yue Li, PhD (with Prof. Haining Wang), March 2019, initial placement at Facebook. Kyle Wallace, PhD (with Prof. Gang Zhou), August 2018, initial placement at MITRE. Teaching AIT 682 Network and Systems Security (Fall 2017-2022, 2024-2025, GMU) AIT 681Secure Software Engineering (Spring 2017-2023, 2025, GMU) IT 366 Network Security (Fall 2021, GMU) CYSE 411Secure Software Engineering (Spring 2017/2018, GMU) CSCI 454/554 Computer and Network Security (Spring 2015/2016, W&M) CSCI 680 Advanced System and Network Security (Fall 2015, W&M) CSCI 780 Advanced Network Security (Fall 2014, W&M) Professional Services TPC Co-Chair: Esorics 2026. Track Chair: CCS 2025 (Network Security Track). Travel Grant Co-Chair: CCS 2025. Track Chair: ICDCS 2024. Area Chair: CNS 2024-2025. Sponsorship Chair: CCS 2024. Geneal Chair: IEEE CNS 2021, SecureComm 2020. Travel Grant Chair: RAID 2019. TPC Co-Chair: SciSec 2021, First ACM Workshop on Moving Target Defense (MTD 2014) in conjunction with ACM CCS 2014. TPC Member: CCS 2015-2017/2019-2026, NDSS 2020/2022-2026, S&P 2025, USENIX Security 2024, ASIACCS 2023-2025, DSN 2017/2020, ACSAC 2019-2025, INFOCOM 2016-2025, MTD 2015-2025, MILCOM 2021-2024, ICDCS 2019, 2024, SecureComm 2016-2018, ICICS 2018-2023, CNS 2014/2016-2020/2025. Selected Publications (More Publications) [CCS25] Yuqi Qing, Qilei Yin, Xinhao Deng, Xiaoli Zhang, Peiyang Li, Zhuotao Liu, Kun Sun, Ke Xu, and Qi Li. \"Training Robust Classifiers for Classfiying Encrypted Traffic under Dynamic Network Conditions\". To appear in the Proceedings of ACM Conference on Computer and Communications Security (CCS), Taipei, Taiwan, October 13-17, 2025. [CCS25] Xuewei Feng, Zhaoxi Li, Qi Li, Ziqiang Wang, Kun Sun, and Ke Xu. \"Off-Path TCP Exploits: PMTUD Breaks TCP Connection Isolation in IP Address Sharing Scenarios\". To appear in the Proceedings of ACM Conference on Computer and Communications Security (CCS), Taipei, Taiwan, October 13-17, 2025. [USENIX Security 25] Hung Mao Chen, Xu He, Shu Wang, Xiaokuan Zhang, and Kun Sun. \"TYPEPULSE: Detecting Type Confusion Bugs in Rust Programs\". To appear in 34th USENIX Security Symposium (USENIX Security'25), Seattle, WA, USA, August 13–15, 2025. [USENIX Security 25] Shiyu Sun, Yunlong Xing, Xinda Wang, Shu Wang, Qi Li, and Kun Sun. \"DISPATCH: Unraveling Security Patches from Entangled Code Changes\". To appear in 34th USENIX Security Symposium (USENIX Security'25), Seattle, WA, USA, August 13–15, 2025. [NDSS25] Xuewei Feng, Yuxiang Yang, Qi Li, Xingxiang Zhan, Kun Sun, Ziqiang Wang, Ao Wang,Ganqiu Du, and Ke Xu. \"ReDAN: An Empirical Study on Remote DoS Attacks against NAT Networks\". To appear in the Network and Distributed System Security Symposium (NDSS), San Diego, CA, February 23 - February 28, 2025. [Distinguished Paper Award] [pdf] [NDSS25] Ziqiang Wang, Xuewei Feng, Qi Li, Kun Sun, Yuxiang Yang, Mengyuan Li, Ganqiu Du, Ke Xu, and Jianping Wu. \"Off-Path TCP Hijacking in Wi-Fi Networks: A Packet-Size Side Channel Attack\". To appear in the Network and Distributed System Security Symposium (NDSS), San Diego, CA, February 23 - February 28, 2025. [pdf] [CCS24] Shu Wang, Kun Sun, and Yan Zhai. \"Dye4AI: Assuring Data Boundary on Generative AI Services.\" To appear in the Proceedings of ACM Conference on Computer and Communications Security (CCS), Salt Lake City, UT, October 14-18, 2024. [pdf] [CCS24] Xiyuan Zhao, Xinhao Deng, Qi Li, Yunpeng Liu, Zhuotao Liu, Kun Sun, and Ke Xu. \"Towards Fine-Grained Webpage Fingerprinting at Scale.\" To appear in the Proceedings of ACM Conference on Computer and Communications Security (CCS), Salt Lake City, UT, October 14-18, 2024. [pdf] [CCS24] Xijia Che, Yi He, Xuewei Feng, Kun Sun, Ke Xu, and Qi Li. \"BlueSWAT: A Lightweight State-Aware Security Framework for Bluetooth Low Energy.\" To appear in the Proceedings of ACM Conference on Computer and Communications Security (CCS), Salt Lake City, UT, October 14-18, 2024. [pdf] [USENIX Security 24] Yunlong Xing, Shu Wang, Shiyu Sun, Xu He, Kun Sun and Qi Li. \"What IF Is Not Enough? Fixing Null Pointer Dereference With Contextual Check\". To appear in 33rd USENIX Security Symposium (USENIX Security'24), Philadelphia, PA, August 14–16, 2024. [pdf] [USENIX Security 24] Yuhao Wu, Jinwen Wang, Yujie Wang, Shixuan Zhai, Zihan Li, Yi He, Kun Sun, Qi Li, and Ning Zhang. \"Your Firmware Has Arrived: A Study of Firmware Update Vulnerabilities\". To appear in 33rd USENIX Security Symposium (USENIX Security'24), Philadelphia, PA, August 14–16, 2024. [pdf] [NDSS24] Shiqing Luo, Anh Nguyen, Hafsa Farooq, Kun Sun, and Zhisheng Yan. \"Eavesdropping on Controller Acoustic Emanation for Keystroke Inference Attack in Virtual Reality\". To appear in the Network and Distributed System Security Symposium (NDSS), San Diego, CA, February 26 - March 1, 2024. [Distinguished Paper Award] [pdf] [NDSS24] Yue Xiao, Yi He, Xiaoli Zhang, Qian Wang, Renjie Xie, Kun Sun, Ke Xu, and Qi Li. \"From Hardware Fingerprint to Access Token: Enhancing the Authentication on IoT Devices\". To appear in the Network and Distributed System Security Symposium (NDSS), San Diego, CA, February 26 - March 1, 2024. [pdf] [NDSS24] Shu Wang, Kun Sun, and Qi Li. \"Compensating Removed Frequency Components: Thwarting Voice Spectrum Reduction At",
  "content_length": 15197,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:50"
}