{
  "name": "Kun Xu 0003",
  "homepage": "http://cg.cs.tsinghua.edu.cn/people/~kun",
  "status": "success",
  "content": "Kun Xu - Homepage Kun Xu () I am an associate professor in the Department of Computer Science and Technology of Tsinghua University. I received my doctor and bachelor degree from Department of Computer Science and Technology, Tsinghua University in 2009 and in 2005, respectively. My research interests include: real-time rendering, image/video editing, and 3D scene synthesis. My contact info: Email: xukun (at) tsinghua.edu.cn Office: Ziqiang Tech Building 1-1002, Tsinghua Univeristy, Beijing, P.R. China, P.C.: 100084 Academic Services Program Committee Member, SIGGRAPH Technical Papers 2025 Program Committee Member, SIGGRAPH Asia Technical Papers 2024 Editorial Board, Computers & Graphics (2020-present) Program Co-Chair, Pacific Graphics 2015 Awards National Science and Technology Progress Award of China (Second Class Prize, 4th Achiever), 2018 National Science Fund for Excellent Young Scholars by NSFC, 2018 Young Elite Scientists Sponsorship Program by CAST, 2016 The State Natural Science Award of China (Second Class Prize, 4th Achiever), 2015 CCF-Intel Young Faculty Researcher Program (YFRP), 2013 Outstanding Doctoral Dissertations of CCF, 2009 Microsoft Fellowship, 2008 Publications 2024 GPU Coroutines for Flexible Splitting and Scheduling of Rendering Tasks Shaokun Zheng, Xin Chen, Zhong Shi, Ling-Qi Yan, and Kun Xu ACM Transactions on Graphics, 43(6), 281:1 – 281:24, 2024 (SIGGRAPH Asia 2024) paper bibtex @article{Zheng2024GPUCoroutines, author = {Zheng, Shaokun and Chen, Xin and Shi, Zhong and Yan, Ling-Qi and Xu, Kun}, title = {GPU Coroutines for Flexible Splitting and Scheduling of Rendering Tasks}, year = {2024}, issue_date = {December 2024}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, volume = {43}, number = {6}, issn = {0730-0301}, url = {https://doi.org/10.1145/3687766}, doi = {10.1145/3687766}, journal = {ACM Trans. Graph.}, month = nov, articleno = {281}, numpages = {24}, keywords = {GPU, coroutine, rendering, program transformation, asynchronous programming, task scheduling} } Differentiable Photon Mapping using Generalized Path Gradients Jiankai Xing, Zengyu Li, Fujun Luan, Kun Xu ACM Transactions on Graphics, 43(6), 257:1 – 257:15, 2024 (SIGGRAPH Asia 2024) project page paper bibtex @article{Xing2024DPMG, title = {Differentiable Photon Mapping using Generalized Path Gradients}, author = {Xing, Jiankai and Li, Zengyu and Luan, Fujun and Xu, Kun}, year = {2024}, month = {dec}, url = {https://doi.org/10.1145/3687958}, articleno = {257}, numpages = {14}, journal = {ACM Trans. Graph.}, volume = {43}, number = {6}, publisher = {Association for Computing Machinery}, } Filtering-Based Reconstruction for Gradient-Domain Rendering Difei Yan, Shaokun Zheng, Ling-Qi Yan, Kun Xu SIGGRAPH Asia, 2024 paper bibtex @inproceedings{Yan2024Filtering, author = {Yan, Difei and Zheng, Shaokun and Yan, Ling-Qi and Xu, Kun}, title = {Filtering-Based Reconstruction for Gradient-Domain Rendering}, year = {2024}, isbn = {9798400711312}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, url = {https://doi.org/10.1145/3680528.3687568}, doi = {10.1145/3680528.3687568}, booktitle = {SIGGRAPH Asia 2024 Conference Papers}, articleno = {69}, numpages = {10}, keywords = {Gradient-Domain Rendering, Reconstruction, Optimization}, location = { }, series = {SA '24} } 2023 Extended Path Space Manifolds for Physically Based Differentiable Rendering Jiankai Xing, Xuejun Hu, Fujun Luan, Ling-Qi Yan, Kun Xu SIGGRAPH Asia, 2023 project page paper video @inproceedings{Xing2023EPSM, title = {Extended Path Space Manifolds for Physically Based Differentiable Rendering}, author = {Xing, Jiankai and Hu, Xuejun and Luan, Fujun and Yan, Ling-Qi and Xu, Kun}, year = {2023}, publisher = {ACM}, booktitle = {SIGGRAPH Asia 2023 Conference Papers}, url = {https://doi.org/10.1145/3610548.3618195}, articleno = {62}, numpages = {11} } Image vectorization and editing via linear gradient layer decomposition Zheng-Jun Du, Liang-Fu Kang, Jianchao Tan, Yotam Gingold, Kun Xu ACM Transactions on Graphics, 42(4), 97:1 – 97:13, 2023 (SIGGRAPH 2023) project page paper supplemental slides bibtex @article{Du2023Layer, author = {Du, Zheng-Jun and Kang, Liang-Fu and Tan, Jianchao and Gingold, Yotam and Xu, Kun}, title = {Image Vectorization and Editing via Linear Gradient Layer Decomposition}, year = {2023}, issue_date = {August 2023}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, volume = {42}, number = {4}, issn = {0730-0301}, url = {https://doi.org/10.1145/3592128}, doi = {10.1145/3592128}, journal = {ACM Trans. Graph.}, month = {jul}, articleno = {97}, numpages = {13}, keywords = {vectorization, compositing, layers, recoloring, gradient, color space, images, RGB} } 2022 LuisaRender: A High-Performance Rendering Framework with Layered and Unified Interfaces on Stream Architectures Shaokun Zheng, Zhiqian Zhou, Xin Chen, Difei Yan, Chuyan Zhang, Yuefeng Geng, Yan Gu, Kun Xu ACM Transactions on Graphics 41(6), 232:1 – 232:19, 2022 (SIGGRAPH Asia 2022) project page paper supplemental code bibtex @article{Zheng2022LuisaRender, title = {LuisaRender: A High-Performance Rendering Framework with Layered and Unified Interfaces on Stream Architectures}, author = {Zheng, Shaokun and Zhou, Zhiqian and Chen, Xin and Yan, Difei and Zhang, Chuyan and Geng, Yuefeng and Gu, Yan and Xu, Kun}, journal = {ACM Trans. Graph.}, volume = {41}, number = {6}, year = {2022}, issue_date = {December 2022}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, issn = {0730-0301}, url = {https://doi.org/10.1145/3550454.3555463}, doi = {10.1145/3550454.3555463}, month = {dec}, articleno = {232}, numpages = {19} } Differentiable Rendering using RGBXY Derivatives and Optimal Transport Jiankai Xing, Fujun Luan, Ling-Qi Yan, Xuejun Hu, Houde Qian, Kun Xu ACM Transactions on Graphics 41(6), 189:1 – 189:13, 2022 (SIGGRAPH Asia 2022) project page paper supplemental code bibtex @article{Xing2022drot, title = {Differentiable Rendering using RGBXY Derivatives and Optimal Transport}, author = {Xing, Jiankai and Luan, Fujun and Yan, Ling-Qi and Hu, Xuejun and Qian, Houde and Xu, Kun}, journal = {ACM Trans. Graph.}, volume = {41}, number = {6}, year = {2022}, issue_date = {December 2022}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, url = {https://doi.org/10.1145/3550454.3555479}, issn = {0730-0301}, doi = {10.1145/3550454.3555479}, month = {dec}, articleno = {189}, numpages = {13} } Unbiased Caustics Rendering Guided by Representative Specular Path He Li, Beibei Wang, Changehe Tu, Kun Xu, Nicolas Holzschuch, Ling-Qi Yan In Proceedings of SIGGRAPH Asia, 2022 project page paper supplemental bibtex @inproceedings{Li2022Pathcut, author = {He Li and Beibei Wang and Changehe Tu and Kun Xu and Nicolas Holzschuch and Ling-Qi Yan}, title = {Unbiased Caustics Rendering Guided by Representative Specular Paths}, booktitle={Proceedings of SIGGRAPH Asia 2022}, year = {2022}, publisher = {Association for Computing Machinery}, url = {https://doi.org/10.1145/3550469.3555381}, doi = {10.1145/3550469.3555381}, } Neural Color Operators for Sequential Image Retouching Yili Wang, Xin Li, Kun Xu, Dongliang He, Qi Zhang, Fu Li, Errui Ding In Proceedings of the European Conference on Computer Vision (ECCV), 2022 project page paper supplemental code bibtex @InProceedings{wang2022neurop, author = {Wang, Yili and Li, Xin and Xu, Kun and He, Dongliang and Zhang, Qi and Li, Fu and Ding, Errui}, title = {Neural Color Operators for Sequential Image Retouching}, booktitle = {Computer Vision -- ECCV 2022}, year = {2022}, } Neural Global Illumination: Interactive Indirect Illumination Prediction under Dynamic Area Lights Duan Gao, Haoyuan Mu, Kun Xu IEEE Transactions on Visualization and Computer Graphics (Early Access), 2022 paper supplemental video bibtex @article{gao2022NGL, author={Gao, Duan and Mu, Haoyuan and Xu, Kun}, journal={IEEE Transactions on Visualization and Computer Graphics}, title={Neural Global Illumination: Interactive Indirect Illumination Prediction under Dynamic Area Lights}, year={2022}, volume={}, number={}, pages={1-17}, doi={10.1109/TVCG.2022.3209963} } An Image-to-video Model for Real-Time Video Enhancement Dongyu She, Kun Xu In Proceedings of the 30th ACM International Conference on Multimedia, 2022 paper bibtex @inproceedings{she2022video, author = {She, Dongyu and Xu, Kun}, title = {An Image-to-Video Model for Real-Time Video Enhancement}, year = {2022}, isbn = {9781450392037}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, url = {https://doi.org/10.1145/3503161.3548325}, doi = {10.1145/3503161.3548325}, booktitle = {Proceedings of the 30th ACM International Conference on Multimedia}, pages = {1837–1846}, numpages = {10}, keywords = {image enhancement, image-to-video model, video enhancement, temporal consistency}, location = {Lisboa, Portugal}, series = {MM '22} } 2021 Ensemble Denoising for Monte Carlo Renderings Shaokun Zheng, Fengshi Zheng, Kun Xu, Ling-Qi Yan ACM Transactions on Graphics 40(6), 274:1 – 274:17, 2021 (SIGGRAPH Asia 2021) paper slides code bibtex @article{Zheng:2021:EnsembleDenoising, author = {Zheng, Shaokun and Zheng, Fengshi and Xu, Kun and Yan, Ling-Qi}, title = {Ensemble Denoising for Monte Carlo Renderings}, journal = {ACM Transactions on Graphics}, volume = {40}, number = {6}, year = {2021}, articleno = {274}, numpages = {17}, pages = {274:1--274:17} } Fast and Accurate Spherical Harmonics Products Hanggao Xin, Zhiqian Zhou, Di An, Ling-Qi Yan, Kun Xu, Shi-Min Hu, and Shing-Tung Yau ACM Transactions on Graphics 40(6), 280:1-280:14, 2021 (SIGGRAPH Asia 2021) paper slides code bibtex @article{Xin:2021:SHProducts, author = {Xin, Hanggao and Zhou, Zhiqian and An, Di and Yan, Ling-Qi and Xu, Kun and Hu, Shi-Min and Yau, Shing-Tung}, title = {Fast and Accurate Spherical Harmonics",
  "content_length": 26661,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:47"
}