{
  "name": "Kunpeng Liu 0001",
  "homepage": "https://www.kunpengliu.com",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationKunpeng LiuAssistant ProfessorSchool of ComputingClemson UniversityEmail: kunpenl@clemson.eduGoogle ScholarDr. Kunpeng Liu is an Assistant Professor in the School of Computing at Clemson University. Before that, he was an Assistant Professor at Portland State University. He received his Ph.D. degree from the Department of Computer Science, University of Central Florida, Orlando, FL. He received both an M.E. degree and a B.E. degree from the Department of Automation, University of Science and Technology of China (USTC), Hefei.He has broad interests in data-centric AI (DCAI), large language models (LLMs), and reinforcement learning (RL), with application to big data problems, including automated feature engineering, effective LLM reasoning, efficient LLM fine-tuning, and spatiotemporal user behavior analysis. He has published more than 80 papers in refereed journals and conference proceedings. He serves as AC/SPC/PC for various conferences, including ICML, ACL, ICLR, NeurIPS, KDD, ICDM, SDM, WWW, CIKM, IJCAI, and AAAI. He has co-organized one tutorial and five workshops on DCAI. He is the Social Media Co-Chair for ICDM 2025, Financial Chair of IEEE ICKG 2024, and Registration Co-Chair of IEEE BigData 2024. He is a recipient of the Best Paper Candidate Awards from IEEE ICDM 2021, CIKM 2025, and ICDM 2025. He is a recipient of the NSF CRII Award.News11/2025 Invited as an Area Chair for ICML 2026.11/2025 One paper was accepted by KDD 2026.11/2025 Jinghan Zhang won the Female Student Award in Data Science at ICDM 2025. Only two female students have received the honor this year. Congratulations to Jinghan!11/2025 Our paper \"Retrieval-Augmented Feature Generation for Domain-Specific Classification\" won the Best Paper Candidate Award at ICDM 2025. Congratulations to collaborators!11/2025 Our paper \"Adaptive Context-Infused Performance Evaluator for Iterative Feature Space Optimization\" won the Best Paper Candidate Award at CIKM 2025. Congratulations to collaborators!11/2025 One paper was accepted by AAAI 2026.10/2025 One paper was accepted by ACM TKDD.10/2025 One paper was accepted by IEEE TKDE.10/2025 Invited as an Area Chair for ACL Rolling Review (ARR), October 2025.08/2025 One paper was accepted by ICDM 2025.08/2025 Ruimin Dai joined our group. Welcome Ruimin!08/2025 Joined the School of Computing, Clemson University as an Assistant Professor.08/2025 Xinhao Zhang will intern at Hertz.07/2025 Served on an NSF Panel.07/2025 Jinghan Zhang received the Robert M. Geist Endowed Fellowship Award. Congratulations to Jinghan!07/2025 One paper was accepted by CIKM 2025.07/2025 One paper was accepted by ACM TKDD.06/2025 One paper was accepted by SIGdial 2025 with Henry Xie (Senior at Westview High School) as the first author. Well done, Henry!06/2025 Jinghan Zhang will intern at Accenture.05/2025 Two papers were accepted by ACL 2025.05/2025 One paper was accepted by KDD 2025.05/2025 Invited as a Social Media Co-Chair for ICDM 2025.05/2025 Our workshop proposal \"GeoGenAgent: The 1st International Workshop on Generative and Agentic AI for Multi-Modality Space-Time Intelligence\" was accepted by ACM SIGSPATIAL 2025.04/2025 Six papers were accepted by IJCAI 2025.03/2025 Our workshop proposal \"AI4DE: The 1st International Workshop on AI for Data Editing\" has been accepted by KDD 2025.03/2025 Our workshop proposal \"ADSD: The 1st Workshop on AI-Ready Data for Science Discovery\" has been accepted by ICDM 2025.01/2025 Served on an NSF Panel.12/2024 Jinghan Zhang won the Best Poster Presentation Award at the IEEE BigData 2024 PhD Forum. Congratulations to Jinghan!12/2024 Three papers were accepted by AAAI 2025.12/2024 Invited as an Area Chair for ICML 2025.11/2024 Our paper \"Scoring with Large Language Models: A Study on Measuring Empathy of Responses in Dialogues\" was accepted by the IEEE BigData 2024 Undergraduate and High School Symposium. Henry Xie is the first author and he is a junior student at Westview High School, Portland. This paper has been selected as the Best Paper and won Henry the AI Youth Star Award. Well done, Henry!10/2024 Two papers were accepted by IEEE ICKG 2024.08/2024 Our NSF proposal \"Collaborative Research: III: Small: Closing Sim-to-Real Gap in Reinforcement Learning via Randomization, Alignment, and Derivation\" (my role: Lead PI) was awarded. Thank you, NSF!07/2024 Our tutorial \"Tabular Data-centric AI: Challenges, Techniques and Future Perspectives\" was accepted by CIKM 2024.07/2024 One paper was accepted by CIKM 2024.06/2024 Honored to receive the NSF CRII Award!05/2024 Honored to receive the Wedge Award for Excellence in Graduate Advising and Mentoring!05/2024 One paper was accepted by ACL 2024.04/2024 Two papers were accepted by IJCAI 2024.04/2024 New homepage released. Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4909,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:51"
}