{
  "name": "Kurt Luther",
  "homepage": "https://www.kurtluther.com",
  "status": "success",
  "content": "Dr. Kurt Luther – Crowd Intelligence Lab at Virginia Tech Dr. Kurt Luther Email: kluther@vt.edu Office: AB1 (Alexandria) Profiles: ACM · Google Scholar Curriculum Vitae Dr. Kurt Luther is an associate professor in the Department of Computer Science and a founding core faculty member of the Institute for Advanced Computing at Virginia Tech. He is also the associate director for research in the Center for Human-Computer Interaction, director of the Crowd Intelligence Lab, and faculty co-lead for the Open-Source Intelligence Lab. His research interests include human-computer interaction (HCI), human-centered AI (HCAI), and social computing. He currently serves as papers co-chair for the 29th ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW 2026), steering committee co-chair for the Human Computation and Crowdsourcing (HCOMP) conference series, and associate editor of the journal ACM Transactions on Interactive Intelligent Systems (TiiS). He is an ACM Senior Member. Dr. Luther has been honored with the National Science Foundation CAREER Award; the Purdue University Outstanding Technology Alumni Award; and the Virginia Tech College of Engineering Dean’s Awards for Excellence in Outreach, Faculty Fellow, and Outstanding New Assistant Professor. He has published over 100 academic papers and received the ACM CSCW Best Paper Award, the AAAI HCOMP Notable Paper Award, and the ACM IUI Best Paper Award. His software has won the Microsoft Cloud AI Research Challenge Grand Prize and several HCOMP Best Demo Awards. He has secured over $6 million in external research funding from sponsors such as CCI, DoD, NEH, NHPRC, NIH, and NSF. His research has been featured by The Atlantic, CNN, The History Channel, NPR, Smithsonian, TIME, and The Wall Street Journal. He has served as general co-chair of AAAI HCOMP, papers co-chair of ACM Creativity & Cognition, and program co-chair of ACM Collective Intelligence. Previously, Dr. Luther was a postdoctoral fellow in the Human-Computer Interaction Institute at Carnegie Mellon University. He received his Ph.D. in human-centered computing from Georgia Tech, where he was a James D. Foley Scholar. He received his B.S. in computer graphics technology, with honors and highest distinction, from Purdue University. He also interned at IBM Research, Microsoft Research, and YouTube/Google. Outside of academia, Dr. Luther is the founding president of The Photo Sleuth Foundation, senior editor and columnist for Military Images magazine, and commander of the 141st Cyber Security Company, Virginia Defense Force. He is a member of the Military Cyber Professionals Association (MCPA) and the Military Writers Guild.",
  "content_length": 2697,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:04"
}