{
  "name": "Kurt Nørmark",
  "homepage": "http://people.cs.aau.dk/~normark",
  "status": "success",
  "content": "Kurt Nørmarks Homepage Kurt Nørmarks Homepage KURT NØRMARK Lektor Emeritus (på pension fra 1.8.2022). Department of Computer Science Aalborg University Selma Lagerlöfs Vej 300 DK-9220 Aalborg DENMARK E-mail: normark@cs.aau.dk Homepage: http://people.cs.aau.dk/~normark/ CV for Kurt Nørmark. My slides and notes about programming: Description Year Language Format Notes Functional Programming in Scheme 2015 English HTML Slides covering functional programming in Scheme - part of a course in programming paradigms Programming in C++ 2014 English HTML Slides covering C++ in six lectures - based on Stroustrup's book \"The C++ Programming Language\", fourth edition. Object-oriented Programming in C# - for C and Java programmers 2010 English HTML/ PDF Textbook about Object-oriented Programming in C#. Includes slides. PDF version revised February 5, 2010. Now with a single, complete PDF file of the text book. Programming in C 2005 Danish HTML/ PDF Introductory coverage of C programming. Including slides (2005 edition). Comes with a single, complete PDF file of the text book (2005 edition, in Danish). Updated 2016 version of the slides - without textbook. Functional Programming in Scheme - with web programming examples 2003 English HTML/ PDF Textbook and slides. Now with a single, complete PDF file of the text book. Object-oriented programming in Java 2001 Danish HTML Slides about OOP in Java. Object-oriented programming in Eiffel. Algorithms and datastructures. 1994 Danish PDF Annotated slides about OOP in Eiffel. Lecture notes about dynamic languages and environments 1996 Danish PDF Annotated slides. Includes coverage of Smalltalk and CLOS. Also lectures about garbage collection. Programming in Pascal 1997 Danish PDF Slides Current and recent teaching Imperativ Programmering - på Dat1 og SW1 på første studieår, efteråret 2019. Slides. Programmering Paradigms - SW7, Dat7, MI7, DE7, ESS7, Fall 2019. Slides. Research and Development Materiale om digitaliseret undervisning Et notat om digitaliseret undervisning - primært om introduktion af videolektioner til erstatning af forelæsninger. Dokumentation af mine web-baserede undervisningsværktøjer. The LAML Home Page The LAML Software home page (version 38.0, November 14, 2011) Web resourses to the paper 'Bites of Lists - Mapping and Filtering Sublists' The experimental ASL2 Programming Language The Elucidative Programming Home Page The SchemeDoc Home Page The MIDI LAML Home Page Emacs Lisp Packages. The LENO Home Page Issues and problems in Literate Programming Dynamic modelling with DYNAMO The Ginger graph editor Programming environments based on hypertext Hooks and open points Simulation of object-oriented concepts and mechanisms in Scheme Transformations and abstract presentations in a language development environment Others Sporadisk afprøvning - Unit testing - API Eksempler Last modified: Thursday, August 3, 2017 Generated: Monday, February 11, 2019, 10:45:33",
  "content_length": 2947,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:58"
}