{
  "name": "Kurt Rohloff",
  "homepage": "https://web.njit.edu/~rohloff",
  "status": "success",
  "content": "Kurt Rohloff Kurt R. Rohloff, Ph.D. rohloff@njit.edu Associate Professor of Computer Science New Jersey Institute of Technology (NJIT) Director, NJIT Cybersecurity Research Center Newark, NJ 07102 The Basics I am an associate professor of computer science at NJIT and am the recipient of a DARPA Young Faculty Award. I am the Co-Founder and CTO of a technology start-up, Duality Technologies. I am the Co-Founder of the open-source PALISADE Homomorphic Encryption Software Library. Research Overview My research interests are in encrypted computing, homomorphic encryption, lattice-based cryptography, cybersecurity, distributed information management and high-assurance software design. A major outcome of my research is the open-source PALISADE Homomorphic Encryption Software Library. This library was developed through extensive international academic and industry collaboration with extensive support from DARPA, IARPA, the Sloan Foundation and other government sponsors. I can't thank my collaborators and sponsors enough. I am the co-founding director of the NJIT Cybersecurity Research Center. Since our founding in 2015, our center has grown from $0 to $10M in external funding for cybersecurity research with support from DARPA, IARPA, AFRL, ARL, NSA, the Sloan Foundation and NSF among others. We have a staff inclusive of tenure-track faculty, research professors, professional programmers, graduate students and undergraduate programmers. I have been fortunate to have hosted many academic research visitors, both from across the US and internationally, such as from Japan, Turkey, the UK, Israel, Germany and top universities from many more countries. I'm always happy to welcome visiting research collaborators who would like to work on applied homomorphic encryption. Graduate research assistantships and post-doctoral appointments may be available, but only for dedicated students with extremely strong C/C++ or embedded systems programming skills and a strong mathematical background. If you want to work in my group, you will need to write high quality, professional-level software. CV Professional Biography Publications Patents Media Exposure PALISADE Homomorphic Encryption Software Library PALISADE Software Library A major outcome of my group's research is the PALISADE open-source library for lattice cryptography and homomorphic encryption. PALISADE is now in public release. More information on the PALISADE Lattice Encryption Software Library can be found by clicking here. In this video below, I present a vision for homomorphic encryption, as enabled by the PALISADE lattice encryption software library. Kurt Rohloff - Homomorphic Encryption from NJIT on Vimeo. Please reach out to me for details on PALISADE. You can access the public external facing PALISADE git repository here. Erdös Number: My Erdös number is 3. Me → Chris Peikert → Leonard J. Schulman → Paul Erdös Last updated: February 5, 2019",
  "content_length": 2932,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:57"
}