{
  "name": "Kurt Schneider",
  "homepage": "http://www.se.uni-hannover.de/pages/de:mitarbeiter_kurt_schneider",
  "status": "success",
  "content": "Prof. Dr. rer. nat. Kurt Schneider – Institut für Praktische Informatik – Leibniz Universität Hannover Kurt Schneider – Institut für Praktische Informatik – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik English Start Kontakt English Institut für Praktische Informatik Fachgebiet Software Engineering Team Kurt Schneider Publikationsliste Prof. Dr. rer. nat. Kurt Schneider © Fachgebiet Software Engineering Prof. Dr. rer. nat. Kurt Schneider Telefon +49 511 762 19666 E-Mail kurt.schneiderinf.uni-hannover.de Adresse Welfengarten 1 30167 Hannover © Fachgebiet Software Engineering Prof. Dr. rer. nat. Kurt Schneider Telefon +49 511 762 19666 E-Mail kurt.schneiderinf.uni-hannover.de Adresse Welfengarten 1 30167 Hannover Ämter und Funktionen RE 2023: General Chair: IEEE International Requirements Engineering Conference RE 2021: PC Co-Chair. IEEE International Requirements Engineering Conference Profes 2018 General Co-Chair SE 2017 General Chair: Software Engineering-Tagung der Gesellschaft für Informatik (GI) REFSQ 2015 Program Co-Chair der International Working Conference on Requirements Engineering: Foundation for Software Quality SE 2013 Doktorandensymposium auf der Multikonferenz Software Engineering, Aachen ICSE 2012 Proceedings Chair: International Conference on Software Engineering, Zürich RE 2012 Doctoral Symposium Co-Chair. IEEE Intnational Requirements Engineering Conference, Chicago Steering Committee Profes Conferences Leitungsgremium der SEUH: Software Engineering im Unterricht der Hochschulen (bis 2021) Steering Committee REFSQ Chair: Requirements Engineering: Foundation for Software Quality (2017-2021) Dekan der Fakultät für Elektrotechnik und Informatik  (2015-2017) Sprecher der Informatik an der Leibniz Universität Hannover (WS 2012/13) Studiendekan Informatik (April 2007- Sept. 2011) Mitglied des Fakultätsrats (2004-2007) Sprecher des Fachbereichs Softwaretechnik in der Gesellschaft für Informatik (GI, 2023-2026) Stellvertretender Sprecher des Fachbereichs Softwaretechnik in der Gesellschaft für Informatik (GI, 2017-2023) Mitglied des Leitungsgremiums der GI-Fachgruppe 2.1.6 (Requirements Engineering) Wissenschaftlicher Beirat des Know-Centers, Graz (2006-2012): Das Know-Center arbeitet auf dem Gebiet des Wissensmanagements, teilweise auch im Zusammenhang mit Software Engineering. Lebenslauf Geboren in Schwandorf/Bayern 1983 Informatikstudium an der Friedrich-Alexander-Universität Erlangen/Nürnberg Nebenfach BWL, Schwerpunktfach Datenbanken 1989 Wissenschaftlicher Mitarbeiter und Promotion in der Abteilung Software Engineering der Universität Stuttgart 1994 Forschungsaufenthalt als Postdoktorand am Center for LifeLong Learning and Design, University of Colorado at Boulder, USA 1996         DaimlerChrysler AG, Forschungszentrum Ulm, Softwaretechnologie-Labor. \t\t\t Leiter von Software-Forschungsprojekten mit bis zu 10 Forschern (z.B. Software Experience Center, zusammen mit Unternehmensbereichen. Aufbau und Leitung des Themengebiets „Erfahrungsbasierte Software-Prozessverbesserung”. Aufsetzen eines Forschungsprojekts zu agilen und leicht-gewichtigen SE-Methoden. Lehraufträge an Universitäten. Betreuung studentischer Arbeiten. seit \t\t\t2003     Leiter des FG Software Engineering im Fachbereich Informatik, Leibniz Universität Hannover. Visiting Professor an der OpenUniversity, Milton Keynes, England (2008) Visiting Professor am Technical Research Center of Finland, Oulu (2008) Visiting Professor am Blekinge Technolog. Högskola, Karlskrona, Schweden (BTH), 2014 Gastwissenschaftler an der Fondzione Bruno Kessler (FBK), Trento, Italien (2019) Betreute Promotionen (abgeschlossen) Zweitgutachter in zahlreichen Verfahren, darunter an der TU München, der RWTH Aachen, der TU Kaiserslautern, den Universitäten Oldenburg, Pottsdam, Heidelberg und Trondheim (Norwegen), Universität Malmö (Schweden), Zürich (Schweiz), Habilitationen an der TU Graz und der TU Innsbruck,  sowie Opponent an der Universität Lund (Schweden). Erstgutachter für: Dr. rer. nat. Wasja Brunotte, 2024: Von Requirements zu Privacy Explanations: Ein nutzerzentrierter Ansatz für Usable Privacy Dr.-Ing. Melanie Schmedes, 2023: Praxisorientierte Ansätze für die Erstellung und Anpassung von Vision Videos zur Unterstützung der Visionskommunikation im Requirements Engineering Dr.-Ing. Nils Prenner, 2023 Unterstützung der Balance von agiler und plan-basiertern Entwicklung durch ein Entwicklungsframework Dr. rer. nat. Larissa Chazette, 2022: Requirements Engineering for Explainable Systems Dr.-Ing. Fabian Kortum, 2021: Supporting the Understanding of Team Dynamics in Agile Software Development Through Computer-Aided Sprint Feedback Dr.-Ing. Fabien Viertel, 2021: Heuristic and Knowledge-Based Security Checks of \tSource Code Artifacts using Community Knowledge Dr. rer. nat. Oliver Karras, 2021: Supporting Requirements Communication for Shared Understanding by Applying Vision Videos in Requirements Engineering Dr.-Ing. Carolin Unger-Windeler, 2020: Supporting the Tailoring of the Product Owner Role to Hybrid Development Environments Dr. rer. nat. Jil Ann-Christin Klünder, 2019: Analyse der Zusammenarbeit in Softwareprojekten mittels Informationsflüssen und Interaktionen in Meetings Dr.-Ing. Philipp Hohl, 2019: An Assessment Model to Foster the Adoption of Agile Product Lines in the Automotive Design Dr.-Ing. Tobias Baum, 2019: Cognitive-Support Code Review Tools Dr.-Ing. Torsten Ronneberger, 2018: Durchgängige Wirkungsorientierung \tim Entwicklungsprozess von Fahrzeugfunktionen Dr.-Ing. Stephan Kiesling: Verbesserung des Requirements Engineerings mit Videos und Informationsflüssen, 2018  Dr.-Ing. Kai Niklas: Verbesserung des Entwurfs von SOA Serviceschnittstellen mit Hilfe von Erfahrungen und Heuristiken, 2016 Dr.-Ing. Olga Boruszewski: Unterstützung der Koexistanz von agilen und traditionellen Anforderungsartefakten, 2016 Dr. rer. nat. Raphael Pham: Improving the Software Testing Skills of Novices During Onboarding Through Social Transparency, 2016 Dr.-Ing. Stefan Gärtner: Heuristische und wissensbasierte Sicherheitsprüfung von Softwareentwicklungsartefaken basierend auf natürlichsprachlichen Informationen, 2016 Dr.-Ing. Anna Averbakh: Light-weight Experience Collection in Distributed Software Engineering, 2015 Dr. rer. nat. Leif Singer: Improving the Adoption of Software Engineering Practices Through Persuasive Interventions, 2013 Dr. rer. nat. Kai Stapel: Informationsflusstheorie der Softwareentwicklung, 2012 Dr.-Ing. Sebastian Meyer:Synchronisierung von Modellen mit schwach strukturierten, natürlich-sprachlichen Dokumenten, 2012 Dr.-Ing. Eric Knauss: Verbesserung der Dokumentation von Anforderungen auf Basis von Erfahrungen und Heuristiken, 2010 Dr.-Ing. Christian Allmann: Situations- und szenariobasiertes Anforderungsmanagement in der automotive Elektronikentwicklung, 2008 Dr. rer. nat. Thomas Flohr: Ein Framework als Grundlage der Ausgestaltung von Quality-Gate-Referenzprozessen für die Software-Entwicklung, 2008 Dr.-Ing. Daniel Lübke: An Integrated Approach for Generation in Service-Oriented Architecture Projects, 2008 Gutachter für Journals (Auswahl) Transactions on Software Engineering (TSE) IEEE Software Encyclopedia of Software Engineering       Information and Software Technology (IST)  Journal of Systems and Software (JSS) Transactions on Software Engineering Methodology (TOSEM) Letzte Änderung: 14.08.24 Druckversion So erreichen Sie uns Kontakt Kontakt © 2025: Leibniz Universität Hannover Impressum Datenschutz Barrierefreiheit Sitemap Kurt Schneider Allgemeine Übersicht Kurt SchneiderPublikationslisteFakultät für Elektrotechnik und InformatikKontakt",
  "content_length": 7689,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:01"
}