{
  "name": "Kurt Sandkuhl",
  "homepage": "https://www.wirtschaftsinformatik.uni-rostock.de/lehrstuhl/team/professoren/prof-dr-kurt-sandkuhl",
  "status": "success",
  "content": "Prof. Dr. Kurt Sandkuhl - Lehrstuhl für Wirtschaftsinformatik - Universität Rostock Zum Hauptinhalt Zum Footer English Anmelden Angebote für StudieninteressiertePromotionsinteressierteStudentenUnternehmenAlumni Services BibliothekITMZ (Rechenzentrum)Zugang zum InstitutsnetzStundenplänePrüfungspläneStartUp SupportErfindungen & Patente Suche Absenden StartseiteLehrstuhlTeamProfessorenProf. Dr. Kurt Sandkuhl Prof. Dr. Kurt Sandkuhl Kontakt Konrad Zuse Haus Albert-Einstein-Straße 22 Raum: 345Telefon: 0381-498 7400Telefax: 0381-498 7512E-Mail: kurt.sandkuhluni-rostockdeSprechzeiten: nach Vereinbarung Werdegang Prof. Dr. Kurt Sandkuhl, geboren 1963, ist seit 2010 Inhaber des Lehrstuhls für Wirtschaftsinformatik an der Universität Rostock. Sandkuhl ist Diplom-Informatiker, promovierte 1994 an der Technischen Universität Berlin auf dem Gebiet der Systemintegration im computergestützten Publizieren und erhielt 2005 an der Universität Linköping (Schweden) den schwedischen akademischen Grad „Docent“ (vergleichbar der Habilitation). Von 2002 bis 2010 war Prof. Sandkuhl Inhaber des Lehrstuhls für Information Engineering an der Technischen Hochschule der Universität Jönköping (Schweden), wo er heute adjungierter Professor ist. Vor seinem Wechsel nach Jönköping (2002) war er wissenschaftlicher Mitarbeiter an der Technischen Universität Berlin (1988-1994) und Abteilungsleiter (1996-2000) sowie Institutsteilleiter (2000-2002) am Fraunhofer-Institut für Software- und Systemtechnik in Berlin. 1993 wurde er von der Linotype-Hell AG mit dem “Dr.-Ing.-Rudolf-Hell-Innovationspreis” ausgezeichnet. Die derzeitigen Forschungsgebiete von Kurt Sandkuhl sind die Unternehmens- und Wissensmodellierung sowie die Informationslogistik. Er veröffentlichte 3 Bücher und über 150 wissenschaftliche Publikationen. Forschungsschwerpunkte Referenz- und UnternehmensarchitekturenCapability ManagementDigitale GeschäftsmodelleWissens- und Kontext-Basierte Systeme Publikationen Hier finden Sie eine komplette Liste der Publikationen. Nach oben",
  "content_length": 2031,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:58"
}