{
  "name": "Kwanghyun Park 0001",
  "homepage": "https://bdai.yonsei.ac.kr/faculty.html",
  "status": "success",
  "content": "Faculty - BDAI Lab Faculty Kwanghyun Park Assistant Professor Department of Computer Science, Yonsei University [Google Scholar] [Yonsei Profile] Education Ph.D. and M.Sc. in Computer Science (Database Systems Group), University of Wisconsin-Madison, USA. 2016. (#10 in Computer Systems) Advisor: Jignesh M. Patel B.S. in Computer Science and B.S. in Applied Mathematics & Statistics (Dual Degrees), Summa Cum Laude, State University of New York at Stony Brook, USA. 2010. Employment Computer Science, Yonsei University, 2023 - Present Microsoft Gray Systems Lab, Senior Research Engineer, 2016 - 2023 Samsung Research America, Research Intern, 2013, 2014 University of Wisconsin-Madison, Research Assistant, 2012 - 2016 University of Wisconsin-Madison, Teaching Assistant, 2010 - 2011 International Activities Organizer Workshop on New Generation Databases and Data-Empowering Technologies in Big Data Era In conjunction with IEEE BigData'25 International Workshop on Quantum Data and Machine Learning (QDML'25) In conjunction with IEEE ICDE'25 International Workshop on Databases and Machine Learning (DBML'23) In conjunction with IEEE ICDE'23 Program Committee/Reviewer SIGMOD'27, VLDB'26, DASFAA'26, LCTES'25, CIKM'25, BigComp'25/'26, TOS'20 Join BDAI Lab Masters/Ph.D Students BDAI Lab is accepting Masters/Ph.D students. Please send your CV and transcript to Prof. Park. Undergraduate Internship BDAI Lab has multiple openings for undergraduate research internship. Please send your CV and transcript to Prof. Park. Post-Doctoral Researcher BDAI Lab is recruiting post-doctoral researchers. Please send your CV and transcript to Prof. Park. Contact Infomation Engineering Hall4 D802/D706, 50 Yonsei-ro, Seodaemun-gu, Seoul, Republic of Korea (03722) +82-2-2123-2718 kwanghyun.park@yonsei.ac.kr Get Direction",
  "content_length": 1813,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:00"
}