{
  "name": "Kwanghoon Sohn",
  "homepage": "http://diml.yonsei.ac.kr",
  "status": "success",
  "content": "Digital Image Media Lab Welcome! Digital Image Media Lab is a research lab based in Yonsei University, Seoul, South Korea. Since the lab was founded in 1996 under supervision of Prof. Kwanghoon Sohn, we have been conducting research on diverse topics in image processing and computer vision area. Some of the selected topics we are interested and currently working on are: 3D Video Processing Deep Learning for 3D Video Processing Multi-view Video Processing Image Enhancement / Editing Intelligent Computer Vision Deep Learning for Vision ADAS(advanced driver assistance systems) Multispectral Imaging / Feature Extraction NewsRecent News Congratulations! Jungin Park (Ph.D)'s paper has been accepted in IJCV, Aug. 2025 \"Language-Guided Recursive Spatiotemporal Graph Modeling for Video Summarization,\" J. Park, J. Lee, and K. Sohn International Journal of Computer Vision (IJCV), Aug. 2025. Congratulations! Jihyun Kim (Ph.D. Student)'s paper has been accepted in ESWA, Jun. 2025 \"3D Semantic Image Synthesis with Geometric and Semantic Consistency,\" J. Kim, C. Oh, H. Do, S. Choi and K. Sohn Expert Systems with Applications (ESWA), Jun. 2025. Congratulations! Jin Kim (Ph.D. Student)'s paper has been accepted in GRSL, Apr. 2025 \"Source-Free Domain Adaptation for Remote-Sensing Object Detection Using Low-confidence Pseudo Labels\" J. Kim, J. Park, H. Jang, N. Ha, and Kwanghoon Sohn IEEE Geoscience and Remote Sensing Letters (GRSL), Apr. 2025. Congratulations! Kwonyoung Kim (Ph.D. Student)'s paper has been accepted in CVPR, FEB. 2025 \"Faster Parameter-Efficient Tuning with Token Redundancy Reduction\" K. Kim, J. Park, J. Kim, H. Kwon and K. Sohn IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), JUNE. 2025. Congratulations! Minsu Kim (Ph.D.)'s paper has been accepted in CVPR, FEB. 2025 \"Mixture of Submodule for Domain Adaptive Person Search\" M. Kim, S. Kim and K. Sohn IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), JUNE. 2025. Congratulations! Jungin Park (Ph.D.)'s paper has been accepted in CVPR, FEB. 2025 \"Bootstrap Your Own Views: Masked Ego-Exo Modeling for Fine-grained View-invariant Video Representations\" J. Park, J. Lee and K. Sohn IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), JUNE. 2025. Congratulations! Jiyoung Lee (Ph.D.) will join the faculty of Ewha Womans University, Feb. 2025 Congratulations! Hanjae Kim (Ph.D. Student)'s paper has been accepted in TPAMI, Sept. 2024 \"Prototype-guided Attention Distillation for Discriminative Person Search\" H. Kim, J. Lee and K. Sohn IEEE Transaction on Pattern Analysis and machine Intelligence. (TPAMI), Sept. 2024. Congratulations! Wonil Song (Ph.D.)'s paper has been accepted in NeurIPS, Sept. 2024 \"A Simple Framework for Generalization in Visual RL under Dynamic Scene Perturbations,\" W. Song, H. Choi, K. Sohnm and D. Min. Neural Information Processing Systems (NeurIPS), Dec. 2024. Congratulations! Ilhoon Yoon (M.S. Student)'s paper has been accepted in ECCV, July. 2024 \"Enhancing Source-Free Object Detection with Low-Confidence Pseudo-Label Distillation,\" I. Yoon, H. Kwon, J. Kim, J. Park, and K. Sohn. European Conference on Computer Vision (ECCV), Sep. 2024. Congratulations! EungBean Lee (Ph.D. Student)'s paper has been accepted in ECCV, July. 2024 \"EBDM: Exemplar-guided Image Translation with Brownian-bridge Diffusion Models,\" E. Lee, S. Jeong, and K. Sohn. European Conference on Computer Vision (ECCV), Sep. 2024. Congratulations! Hyeongjun Kwon (Ph.D. Student)'s paper has been accepted in CVPR, Feb. 2024 \"Improving Visual Recognition via Visual-Semantic Hierarchy Mapping,\" H. Kwon, J. Jang, J. Kim, K. Kim, and K. Sohn. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June. 2024. Congratulations! Jihyun Kim (Ph.D. Student)'s paper has been accepted in CVPR, Feb. 2024 \"Diffusion-driven GAN Inversion for Multi-Modal Facial Image Generation,\" J. Kim, C. Oh, H. Do, S. Kim and K. Sohn. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June. 2024. Congratulations! Jungin Park (Ph.D. Student)'s paper has been accepted in ICLR, Jan. 2024 \"Bridging Vision and Language Spaces with Assignment Prediction,\" J. Park, J. Lee, and K. Sohn. Proc. International Conference on Learning Representations (ICLR), May. 2024. Congratulations! Junyoung Park (M.S. Student)'s paper has been accepted in WACV, Oct. 2023 \"Layer-wise Auto-Weighting for Non-Stationary Test-Time Adaptation\" J. Park, J. Kim, H. Kwon, I. Yoon and K. Sohn IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), January. 2024. Congratulations! Wonil Song (Ph.D. Student)'s paper has been accepted in ESWA, Aug. 2023 \"Learning disentangled skills for hierarchical reinforcement learning through trajectory autoencoder with weak labels,\" W. Song, S. Jeon, H. Choi, K. Sohn, and D. Min Expert Systems with Applications (ESWA), Early Access. Congratulations! Yeji Choi (Ph.D. Student)'s paper has been accepted in ICIP, Aug. 2023 \"Face Photo-sketch Synthesis via Domain-invariant Feature Embedding\" Y. Choi, K. Sohn and I. Kim IEEE International Conference on Image Processing (ICIP), October. 2023. Congratulations! Sangryul Jeon (Ph.D.) will join the faculty of Pusan National University, Aug. 2023 Congratulations! Jinhyun Jang (Ph.D. Student)'s paper has been accepted in ICCV, July. 2023 \"Knowing Where to Focus: Event-aware Transformer for Video Grounding\" J. Jang, J. Park, J. Kim, H. Kwon and K. Sohn IEEE International Conference on Computer Vision (ICCV), October. 2023. Congratulations! Hanjae Kim (Ph.D. Student)'s paper has been accepted in ICCV, July. 2023 \"Contextual, Discriminative, and Unbiased Compositional Zero-Shot Learning\" H. Kim, J. Lee, S. Park and K. Sohn IEEE International Conference on Computer Vision (ICCV), October. 2023. Congratulations! Sunok Kim (Research Professor)'s paper has been accepted in TPAMI, May. 2023 \"Stereo Confidence Estimation via Locally Adaptive Fusion and Knowledge Distillation,\" S. Kim, S. Kim, D. Min, P. Frossard and K. Sohn IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI), Early Access. Congratulations! Hyeongjun Kwon (M.S. Student)'s paper has been accepted in CVPR, Feb. 2023 \"Probabilistic Prompt Learning for Dense Prediction,\" T. Song, S. Jeong, J. Kim, J. Jand, and K. Sohn. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June. 2023. Congratulations! Taeyong Song (Ph.D. Student)'s paper has been accepted in CVPR, Feb. 2023 \"Unsupervised Deep Asymmetric Stereo Matching with Spatially-Adaptive Self-Similarity,\" S. Kim, and K. Sohn. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June. 2023. Congratulations! Jungin Park (Ph.D. Student)'s paper has been accepted in CVPR, Feb. 2023 \"Dual-path Adaptation from Image to Video Transformers,\" J. Lee, and K. Sohn. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June. 2023. Congratulations! Minsu Kim (Ph.D. Student)'s paper has been accepted in CVPR, Feb. 2023 \"PartMix: Regularization Strategy to Learn Part Discovery for Visible-Infrared Person Re-identification,\" S. Kim, J. Park, S. Park, and K. Sohn. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June. 2023. Congratulations! Hyesong Choi(Ph.D. Student)'s paper has been accepted in CVPR, Feb. 2023 \"Local-guided Global: Paired Similarity Representation for Visual Reinforcement Learning,\" H. Lee, W. Song, K. Sohn, and D. Min. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June. 2023. Congratulations! Hunsang Lee (Ph.D.)'s paper has been accepted in Access, Feb. 2023 \"Cross-scale KNN Image Transformer for Image Restoration,\" H. Lee, H. Choi, K. Sohn and D. Min. IEEE Access (Access), Early access. Congratulations! Minsu Kim (Ph.D. Student)'s paper has been accepted in GRSL, Nov. 2022 \"Learning Semantic Keypoints for Object Detection in Aerial Images,\" M. Kim, S. Joung, T. Song, H. Kim and K. Sohn. IEEE Geoscience and Remote Sensing Letters (GRSL), Early access. Congratulations! Seongheon Park (M.S.)'s paper has been accepted in WACV, Nov. 2022 \"Normality Guided Multiple Instance Learning for Weakly Supervised Video Anomaly Detection,\" S. Park, H. Kim, M. Kim, D. Kim, and K. Sohn. IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), January. 2023. Congratulations! Dahye Kim (M.S.)'s paper has been accepted in WACV, Nov. 2022 \"Language-free Training for Zero-shot Video Grounding\" D. Kim, J. Park, J. Lee, S. Park, and K. Sohn. IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), January. 2023. Congratulations! Sangryul Jeon (Ph.D.)'s paper has been accepted in BMVC, Nov. 2022 \"COAT: Correspondence-driven Object Appearance Transfer\" S. Jeon, Z. Zhang, Z. Lin, S. Cohen, Z. Ding and K. Sohn British Machine Vision Conference (BMVC), November, 2022. Congratulations! Keunheun Choi (Ph.D. Student)'s paper has been accepted in GRSL, Sep. 2022 \"Deep Cascade Network for Noise-Robust SAR Ship Detection With Label Augmentation,\" K. Choi, T. Song, S. Kim, H. Jang, N. Ha, and K. Sohn. IEEE Geoscience and Remote Sensing Letters (GRSL), Early access. Congratulations! Kwonyoung Kim (Ph.D. Student)'s paper has been accepted in ECCV, July. 2022 \"PointFix: Learning to Fix Domain Bias for Robust Online Stereo Adaptation\" K. Kim, J. Park, J. Lee, D. Min, and K. Sohn European Conference on Computer Vision (ECCV), October, 2022. Congratulations! Eungbean Lee (Ph.D. Student)'s paper has been accepted in GRSL, July. 2022 \"Semantic Equalization Learning for Semi-supervised SAR Building Segmentation\" E. Lee, S. Jeong, J. Kim and K. Sohn IEEE Geoscience and Remote Sensing Letters (GRSL), Early Access. Congratulations! Taeyong Song (Ph.D.)'s paper has been accepted in GRSL, June. 2022 \"Shape-Robust SAR Ship Detection via Context-Preserving Augmentation and Deep Contrastive RoI Learning,\" T. Song, S. Kim and K. Sohn IEEE Geoscience and Remote Sensing Letters (GRSL),",
  "content_length": 37472,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:00"
}