{
  "name": "Kwang In Kim",
  "homepage": "https://sites.google.com/view/kimki",
  "status": "success",
  "content": "Kwang In KimSearch this siteEmbedded FilesSkip to main contentSkip to navigationKwang In KimHead of research group Machine Learning and VisionAssociate professor in Department of Electrical Engineering Graduate School of Artificial Intelligenceat POSTECHAddress: E2-327, POSTECH 77 Cheongam-ro, Nam-gu, Pohang, 37673 KoreaE-mail: kimkin (at) postech.ac.krMy primary research interest lies in advancing the way we explore, analyze, and interact with complex data. To this end, I develop new techniques and methodologies in machine learning and computer vision, with growing emphasis on multimodal models that connect visual and linguistic information. My current projects focus on the algorithmic foundations of machine learning, particularly in distributed learning, semi-supervised learning, active learning, multi-task learning, and transfer learning. I also investigate new methods for capturing, processing, mining, and visualizing image and video data, as well as techniques for bridging visual and textual modalities to enable robust and interpretable multimodal understanding. VitaSince 2023: Associate Professor, POSTECH, Department of Electrical Engineering and Graduate School of Artificial Intelligence2019-2023: Associate Professor & Professor, UNIST,  Artificial Intelligence Graduate School and  Department of Computer Science and Engineering2016-2019: Senior Lecturer, University of Bath, Department of Computer Science2013-2016: Lecturer, Lancaster University, School of Computing and Communications2010-2013: Post-doc, Max Planck Institue for Informatics, GVV Group and Computer Graphics Department2008-2009: Post-doc, Saarland University, Machine Learning Group2002-2004, 2005-2008: Post-doc, Max Planck Institute for Biological Cybernetics, Empirical Inference Department2000-2002, 2004-2005: Post-doc, KAIST, A. I. Lab2000: PhD, Kyungpook National University, Computer EngineeringOpen positionsI am seeking highly motivated candidates to apply for our PhD and Masters programs in Machine Learning or Computer Vision. These programs are offered by either the Department of Electronic Engineering or the Graduate School of Artificial Intelligence at POSTECH.To learn more, please visit our group website and read the note provided. PublicationsUyoung Jeong, Jonathan Freer, Seungryul Baek, Hyung Jin Chang, and Kwang In KimPoseBH: Prototypical multi-dataset training beyond human pose estimation CVPR 2025 PaperKwang In KimDiffusion-based active learning for distributed client manifolds AAAI 2025PaperKwang In KimDistributed active client selection with noisy clients using model association scores ECCV 2024PaperJunwon Seo, Sangyoon Lee, Kwang In Kim, and Jaeho LeeIn search of a data transformation that accelerates neural field training CVPR 2024Paper | Code | Web pageYunpyo An, Suyeong Park, and Kwang In KimActive learning guided by efficient surrogate learners AAAI 2024PaperKwang In KimRobust distributed gradient aggregation using projections onto gradient manifoldsAAAI 2024PaperJake Deane, Sinéad Kearney, Kwang In Kim, and Darren CoskerRGBT-dog: a parametric model and pose prior for canine body analysis data creationWACV 2024Paper | SupplementalUyoung Jeong, Seungryul Baek, Hyung Jin Chang, and Kwang In KimBoIR: box-supervised instance representation for multi-person pose estimation BMVC 2023Paper | Supplemental | Code Tze Ho Elden Tse, Zhongqun Zhang, Kwang In Kim, Ales Leonardis, Feng Zheng, and Hyung Jin ChangS2Contact: graph-based network for 3D hand-object contact estimation with semi-supervised learning ECCV 2022Paper | Web page  Kwang In KimActive label correction using robust parameter update and entropy propagationECCV 2022Paper | Supplemental Tze Ho Elden Tse, Kwang In Kim, Ales Leonardis, and Hyung Jin ChangCollaborative learning for hand and object reconstruction with attention-guided graph convolutionCVPR 2022 Paper | Supplemental Kwang In KimRobust combination of distributed gradients under adversarial perturbationsCVPR 2022 Paper | Supplemental Youssef A. Mejjati, Isa Milefchik, Aaron Gokaslan, Oliver Wang, Kwang In Kim, and James TompkinGaussiGAN: controllable image synthesis with 3D Gaussians from unposed silhouettesBMVC 2021Paper | Supplemental | Web page  Kwang In Kim and James TompkinTesting using privileged information by adapting features with statistical dependenceICCV 2021Paper | Supplemental | Web page  Dong Uk Kim, Kwang In Kim, and Seungryul BaekEnd-to-end detection and pose estimation of two interacting handsICCV 2021Paper | Supplemental Kwang In KimImproving predictors via combination across diverse task categoriesICML 2021Paper | Supplemental Kwanyoung Kim, Dongwon Park, Kwang In Kim, and Se Young ChunTask-aware variational adversarial active learningCVPR 2021Paper | Supplemental Kwang In Kim, Christian Richardt, and Hyung Jin ChangCombining task predictors via enhancing joint predictabilityECCV 2020Paper | Supplemental Youssef A. Mejjati, Celso F. Gomez, Kwang In Kim, Eli Shechtman, and Zoya BylinskiiLook here! A parametric learning based approach to redirect visual attentionECCV 2020Paper | Supplemental | Web page Seungryul Baek, Kwang In Kim, and Tae-Kyun KimWeakly-supervised domain adaptation via GAN and mesh model for estimating 3D hand poses interacting objectsCVPR 2020Paper | SupplementalSinéad Kearney, Wenbin Li, Martin Parsons, Kwang In Kim, and Darren CoskerRGBD-Dog: Predicting canine pose from RGBD sensorsCVPR 2020Paper | Supplemental | Web pageYoussef A. Mejjati, Zejiang Shen, Michael Snower, Aaron Gokaslan, Oliver Wang, James Tompkin, and Kwang In KimGenerating object stampsAI for Content Creation Workshop, CVPR 2020Paper | arXiv (long version) | Web pageDushyant Mehta, Kwang In Kim, and Christian TheobaltOn implicit filter level sparsity in convolutional neural networksCVPR 2019Paper | Supplemental Seungryul Baek, Kwang In Kim, and Tae-Kyun KimPushing the envelope for RGB-based dense 3D hand pose estimation via neural renderingCVPR 2019Paper | Supplemental Kwang In Kim and Hyung Jin ChangJoint manifold diffusion for combining predictions on decoupled observationsCVPR 2019Paper Youssef A. Mejjati, Christian Richardt, James Tompkin, Darren Cosker, and Kwang In KimUnsupervised attention-guided image-to-image translationNeurIPS 2018Paper | Web page Aaron Gokaslan, Vivek Ramanujan, Daniel Ritchie, Kwang In Kim, and James TompkinImproving shape deformation in unsupervised image-to-image translationECCV 2018Paper | Web page Yassir Saquil, Kwang In Kim, and Peter HallRanking CGANs: subjective control over semantic image attributesBMVC 2018Paper Juil Sock, Kwang In Kim, Caner Sahin, and Tae-Kyun KimMulti-task deep networks for depth-based 6D object pose and joint registration in crowd scenariosBMVC 2018Paper Kwang In Kim, Juhyun Park, and James TompkinHigh-order tensor regularization with application to attribute rankingCVPR 2018Paper Youssef A. Mejjati, Darren Cosker, and Kwang In KimMulti-task learning by maximizing statistical dependenceCVPR 2018Paper Seungryul Baek, Kwang In Kim, and Tae-Kyun KimAugmented skeleton space transfer for depth-based hand pose estimationCVPR 2018Paper Kwang In Kim, James Tompkin, and Christian RichardtPredictor combination at test timeICCV 2017Paper | Supplemental James Tompkin, Kwang In Kim, Hanspeter Pfister, and Christian TheobaltCriteria sliders: learning continuous database criteria via interactive rankingBMVC 2017PDF | Video Seungryul Baek, Kwang In Kim, and Tae-Kyun KimReal-time online action detection forests using spatiotemporal contextsWACV 2017Paper Kwang In KimSemi-supervised learning based on joint diffusion of graph functions and LaplaciansECCV 2016Web page Yanxia Zhang, Thomas Wilcockson, Kwang In Kim, Trevor Crawford, Hans Gellersen, and Pete SawyerMonitoring dementia with automatic eye movements analysisIntelligent Decision Technologies 2016Paper Kwang In Kim, James Tompkin, Hanspeter Pfister, and Christian TheobaltContext-guided diffusion for label propagation on graphsICCV 2015Web page Helge Rhodin, James Tompkin, Kwang In Kim, Edilson de Aguiar, Hanspeter Pfister, Hans-Peter Seidel, and Christian TheobaltGeneralizing wave gestures from sparse examples for real-time character controlACM Trans. Graphics (SIGGRAPH Asia) 2015Web page Ahmed Elhayek, Carsten Stoll, Kwang In Kim, and Christian TheobaltOutdoor human motion capture by simultaneous optimization of pose and camera parametersComputer Graphics Forum 2015Web page Kwang In Kim, James Tompkin, Hanspeter Pfister, and Christian TheobaltLocal high-order regularization on data manifoldsCVPR 2015Web page Kwang In Kim, James Tompkin, Hanspeter Pfister, and Christian TheobaltSemi-supervised learning with explicit relationship regularizationCVPR 2015Web page Younghee Kwon, Kwang In Kim, James Tompkin, Jin Hyung Kim, and Christian TheobaltEfficient learning of image super-resolution and compression artifact removal with semi-local Gaussian processesIEEE Trans. PAMI 2015Web page Helge Rhodin, James Tompkin, Kwang In Kim, Kiran Varanasi, Hans-Peter Seidel, and Christian TheobaltInteractive motion mapping for real-time character controlComputer Graphics Forum (Eurographics) 2014Web page Kwang In Kim, James Tompkin, and Christian TheobaltCurvature-aware regularization on Riemannian submanifoldsICCV 2013Web page Miguel Granados, Kwang In Kim, James Tompkin, and Christian TheobaltAutomatic noise modeling for ghost-free HDR reconstructionACM Trans. Graphics (SIGGRAPH Asia) 2013Web page James Tompkin, Min H. Kim, Kwang In Kim, Jan Kautz, and Christian TheobaltPreference and artifact analysis for video transitions of placesACM Trans. Applied Perception 2013Web pageFrank Lenzen, Kwang In Kim, Henrik Schäfer, Rahul Nair, Stephan Meister, Florian Becker, Christoph S. Garbe, and Christian TheobaltDenoising strategies for time-of-flight dataTime-of-Flight Imaging: Algorithms, Sensors and Applications 2013Paper Kwang In Kim, James Tompkin, Martin Theobald, Jan Kautz, and Christian TheobaltMatch graph construction for lar",
  "content_length": 14112,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:59"
}