{
  "name": "Kwan-Yee K. Wong",
  "homepage": "https://i.cs.hku.hk/~kykwong",
  "status": "success",
  "content": "ï»¿ Kenneth - Home Home Research Publications Professional Undergrad People Personal Links Prof. Kenneth K.Y. Wong BEng CUHK; MPhil, PhD Cambridge Associate Professor School of Computing and Data Science The University of Hong Kong Tel: (+852) 3917 8443Office: 323 Chow Yei Ching Bldg, Pokfulam Rd, Hong Kong Email: kykwongcs.hku.hk URL : http://www.cs.hku.hk/~kykwong [Research] [Publications] [Professional Activities] [Undergrad] [People] [Personal] [Links] Prof. Wong received the BEng degree in Computer Engineering, with first class honors, from the Chinese University of Hong Kong in 1998. From 1998 to 2001, he studied in United Kingdom at the University of Cambridge, where he was a member of the Speech, Vision and Robotics Group in the Department of Engineering. He received the MPhil and PhD degrees, both in Computer Vision (Information Engineering), from the University of Cambridge in 2000 and 2001, respectively. Since 2001, he has been with the Department of Computer Science at The University of Hong Kong, where he is now an Associate Professor. He served as the Associate Head of the Department from 2008 to 2012, and as the Programme Director of the BEng(CompSc) programme from 2008 to 2015. He has been appointed as the Deputy Director of AI Literacy Management Unit (AiLU) since April 2025, and as the Associate Head (Teaching & Learning) of the Division of AI & Data Science of the School of Computing & Data Science since June 2025. Prof. Wong's research interests are in Computer Vision and\tMachine Intelligence. He is the Director of the Computer Vision Laboratory. His research works include camera calibration, shape and motion recovery, face sketch synthesis and recognition, scene text recognition, object retrieval, medical image understanding, and generative AI. He has published over 180 peer-reviewed journal and conference papers. Many of his works appear in top venues, including CVPR, ECCV, and ICCV (top conferences in computer vision), and TPAMI, IJCV, and TIP (top journals in computer vision). He is currently an\tAssociate Editor of IJCV. He regularly serves in the program committee of all major conferences in computer vision and AI, including CVPR, ECCV, ICCV, NeurIPS, ICML, ICLR, and AAAI. He is also a regular reviewer of TPAMI, IJCV, and TIP. Selected Publications (Click here for my full publication list or here for my Google Scholar profile) LooC: Effective Low-Dimensional Codebook for Compositional Vector Quantization. Jie Li, Kwan-Yee K. Wong, and Kai Han. WACV 2026 (to appear) [BibTeX] [Paper] [Project] [Code] SPC: Evolving Self-Play Critic via Adversarial Games for LLM Reasoning. Jiaqi Chen, Bang Zhang, Ruotian Ma, Peisong Wang, Xiaodan Liang, Zhaopeng Tu, Xiaolong Li, and Kwan-Yee K. Wong. NeurIPS 2025 (to appear) [BibTeX] [Paper] [Project] [Code] DiffusionMat: Alpha Matting as Deterministic Sequential Refinement Learning. Yangyang Xu, Shengfeng He, Wenqi Shao, Yong Du, Kwan-Yee K. Wong, Yu Qiao, Jun Yu, and Ping Luo. ACM MM 2025 [BibTeX] [Paper] [Project] [Code] Rethinking Cross-Modal Interaction in Multimodal Diffusion Transformers. Zhengyao Lv, Tianlin Pan, Chenyang Si, Zhaoxi Chen, Wangmeng Zuo, Ziwei Liu, and Kwan-Yee K. Wong. ICCV 2025 [BibTeX] [Paper] [Project] [Code] Dual-Expert Consistency Model for Efficient and High-Quality Video Generation. Zhengyao Lv, Chenyang Si, Tianlin Pan, Zhaoxi Chen, Kwan-Yee K. Wong, Yu Qiao, and Ziwei Liu. ICCV 2025 [BibTeX] [Paper] [Project] [Code] ArtiFade: Learning to Generate High-quality Subject from Blemished Image. Shuya Yang, Shaozhe Hao, Yukang Cao, and Kwan-Yee K. Wong. CVPR 2025 [BibTeX] [Paper] [Project] [Code] DriveGPT4-V2: Harnessing Large Language Model Capabilities for Enhanced Closed-Loop Autonomous Driving. Zhenhua Xu, Yan Bai, Yujia Zhang, Zhuoling Li, Fei Xia, Kwan-Yee K. Wong, Jianqiang Wang, and Hengshuang Zhao. CVPR 2025 [BibTeX] [Paper] [Project] [Code] FasterCache: Training-Free Video Diffusion Model Acceleration with High Quality. Zhengyao Lv, Chenyang Si, Junhao Song, Zhenyu Yang, Yu Qiao, Ziwei Liu, and Kwan-Yee K. Wong. ICLR 2025 [BibTeX] [Paper] [Project] [Code] BiGR: Harnessing Binary Latent Codes for Image Generation and Improved Visual Representation Capabilities. Shaozhe Hao, Xuantong Liu, Xianbiao Qi, Shihao Zhao, Bojia Zi, Rong Xiao, Kai Han, and Kwan-Yee K. Wong. ICLR 2025 [BibTeX] [Paper] [Project] [Code] AvatarGO: Zero-shot 4D Human-Object Interaction Generation and Animation. Yukang Cao, Liang Pan, Kai Han, Kwan-Yee K. Wong, and Ziwei Liu. ICLR 2025 [BibTeX] [Paper] [Project] [Code] Affordances-Oriented Planning using Foundation Models for Continuous Vision-Language Navigation. Jiaqi Chen, Bingqian Lin, Xinmin Liu, Lin Ma, Xiaodan Liang, and Kwan-Yee K. Wong. AAAI 2025 [BibTeX] [Paper] [Project] [Code] VipDiff: Towards Coherent and Diverse Video Inpainting via Training-free Denoising Diffusion Models. Chaohao Xie, Kai Han, and Kwan-Yee K. Wong. WACV 2025 [BibTeX] [Paper] [Project] [Code] RIGID: Recurrent GAN Inversion and Editing of Real Face Videos and Beyond. Yangyang Xu, Shengfeng He, Kwan-Yee K. Wong, and Ping Luo. IJCV 2025 [BibTeX] [Paper] [Project] [Code] DriveGPT4: Interpretable End-to-end Autonomous Driving via Large Language Model. Zhenhua Xu, Yujia Zhang, Enze Xie, Zhen Zhao, Yong Guo, Kwan-Yee K. Wong, Zhenguo Li, and Hengshuang Zhao. IEEE Robotics and Automation Letters 2024 [BibTeX] [Paper] [Project] [Code] Bridging Different Language Models and Generative Vision Models for Text-to-Image Generation. Shihao Zhao, Shaozhe Hao, Bojia Zi, Huaizhe Xu, and Kwan-Yee K. Wong. ECCV 2024 [BibTeX] [Paper] [Project] [Code] ConceptExpress: Harnessing Diffusion Models for Single-image Unsupervised Concept Extraction. Shaozhe Hao, Kai Han, Zhengyao Lv, Shihao Zhao, and Kwan-Yee K. Wong. ECCV 2024 [BibTeX] [Paper] [Project] [Code] InsMapper: Exploring Inner-instance Information for Vectorized HD Mapping. Zhenhua Xu, Kwan-Yee K. Wong, and Hengshuang Zhao. ECCV 2024 [BibTeX] [Paper] [Project] [Code] MapGPT: Map-Guided Prompting with Adaptive Path Planning for Vision-and-Language Navigation. Jiaqi Chen, Bingqian Lin, Ran Xu, Zhenhua Chai, Xiaoodan Liang, and Kwan-Yee K. Wong. ACL 2024 [BibTeX] [Paper] [Project] [Code] Deep Variational Network Toward Blind Image Restoration. Zongsheng Yue, Hongwei Yong, Qian Zhao, Lei Zhang, Deyu Meng, and Kwan-Yee K. Wong. TPAMI 2024 [BibTeX] [Paper] [Code] DreamAvatar: Text-and-Shape Guided 3D Human Avatar Generation via Diffusion Models. Yukang Cao, Yan-Pei Cao, Kai Han, Ying Shan, and Kwan-Yee K. Wong. CVPR 2024 [BibTeX] [Paper] [Project] [Code] PLACE: Adaptive Layout-Semantic Fusion for Semantic Image Synthesis. Zhengyao Lv, Yuxiang Wei, Wangmeng Zuo, and Kwan-Yee K. Wong. CVPR 2024 [BibTeX] [Paper] [Project] [Code] CiPR: An Efficient Framework with Cross-instance Positive Relations for Generalized Category Discovery. Shaozhe Hao, Kai Han, and Kwan-Yee K. Wong. TMLR 2024 [BibTeX] [Paper] [Code] HeadSculpt: Crafting 3D Head Avatars with Text. Xiao Han, Yukang Cao, Kai Han, Xiatian Zhu, Jiankang Deng, Yi-Zhe Song, Tao Xiang, and Kwan-Yee K. Wong. NeurIPS 2023 [BibTeX] [Paper] [Project] [Code] Uni-ControlNet: All-in-One Control to Text-to-Image Diffusion Models. Shihao Zhao, Dongdong Chen, Yen-Chun Chen, Jianmin Bao, Shaozhe Hao, Lu Yuan, and Kwan-Yee K. Wong. NeurIPS 2023 [BibTeX] [Paper] [Project] [Code] RIGID: Recurrent GAN Inversion and Editing of Real Face Videos. Yangyang Xu, Shengfeng He, Kwan-Yee K. Wong, and Ping Luo. ICCV 2023 [BibTeX] [Paper] [Project] [Code] Semi-supervised Cycle-GAN for face photo-sketch translation in the wild. Chaofeng Chen, Wei Liu, Xiao Tan, and Kwan-Yee K. Wong. CVIU 2023 [BibTeX] [Paper] [Code] SeSDF: Self-evolved Signed Distance Field for Implicit 3D Clothed Human Reconstruction. Yukang Cao, Kai Han, and Kwan-Yee K. Wong. CVPR 2023 [BibTeX] [Paper] [Project] [Code] Learning Attention as Disentangler for Compositional Zero-shot Learning. Shaozhe Hao, Kai Han, and Kwan-Yee K. Wong. CVPR 2023 [BibTeX] [Paper] [Project] [Code] Deep Face Video Inpainting via UV Mapping. Wenqi Yang, Zhenfang Chen, Chaofeng Chen, Guanying Chen, and Kwan-Yee K. Wong. TIP 2023 [BibTeX] [Paper] S^3-NeRF: Neural Reflectance Field from Shading and Shadow under a Single Viewpoint. Wenqi Yang, Guanying Chen, Chaofeng Chen, Zhenfang Chen, and Kwan-Yee K. Wong. NeurIPS 2022 [BibTeX] [Paper] [Project] [Code] PS-NeRF: Neural Inverse Rendering for Mulit-view Photometric Stereo. Wenqi Yang, Guanying Chen, Chaofeng Chen, Zhenfang Chen, and Kwan-Yee K. Wong. ECCV 2022 [BibTeX] [Paper] [Project] [Code] JIFF: Jointly-aligned Implicit Face Function for High Quality Single View Clothed Human Reconstruction. Yukang Cao, Guanying Chen, Kai Han, Wenqi Yang, and Kwan-Yee K. Wong. CVPR 2022 [BibTeX] [Paper] [Project] [Code] Blind Image Super-resolution with Elaborate Degradation Modeling on Noise and Kernel. Zongsheng Yue, Qian Zhao, Jianwen Xie, Lei Zhang, Deyu Meng, and Kwan-Yee K. Wong. CVPR 2022 [BibTeX] [Paper] [Code] Deep Photometric Stereo for Non-Lambertian Surfaces. Guanying Chen, Kai Han, Boxin Shi, Yasuyuki Matsushita, and Kwan-Yee K. Wong. TPAMI 2022 [BibTeX] [Paper] [Project] [Code] HDR Video Reconstruction: A Coarse-to-fine Network and A Real-world Benchmark Dataset. Guanying Chen, Chaofeng Chen, Shi Guo, Zhetong Liang, Kwan-Yee K. Wong, and Lei Zhang. ICCV 2021 [BibTeX] [Paper] [Project] [Code] Progressive semantic-aware style transformation for blind face restoration. Chaofeng Chen, Xiaoming Li, Lingbo Yang, Xianhui Lin, Lei Zhang, and Kwan-Yee K. Wong. CVPR 2021 [BibTeX] [Paper] [Code] Grounding Physical Concepts of Objects and Events Through Dynamic Visual Reasoning. Zhenfang Chen, Jiayuan Mao, Jiajun Wu, Kwan-Yee K. Wong, Joshua B. Tenenbaum, and Chuang. Gan. ICLR 2021 [BibTeX] [Paper] [Project] [Code] Fixed Viewpoint Mirror Surface Reconstruction Under an Uncalibrated Camera. Kai Han, Miaomiao Liu, Dirk Schnieders, and Kwan-Yee K. Wong. TIP 2021 [BibTeX] [Paper] [Project] [Code]",
  "content_length": 10545,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:57"
}