{
  "name": "Kwan Hui Lim 0001",
  "homepage": "https://sites.google.com/site/limkwanhui",
  "status": "success",
  "content": "Kwan Hui LIMSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeKwan Hui LIMAssistant Professor Information Systems Technology and Design PillarSingapore University of Technology and DesignEmail: kwanhui (at) acm.orgShort BiographyKwan Hui LIM is currently an Assistant Professor of Computer Science at the Information Systems Technology and Design (ISTD) Pillar, Singapore University of Technology and Design (SUTD). At SUTD, he serves / has served as the Director of the Social and Urban Analytics Lab, Chair of the ISTD Undergraduate Committee, ISTD Lead for Engineering Accreditation, Fellow of the SUTD Academy, among other appointments. Externally, he also serves / has served on the Advisory Committee for MOE Syllabus Review Committee and IMDA Artificial Intelligence Technical Committee, AI Advisor for EdTech and TravelTech companies, as well as Associate Editor and Guest Editor for Q1 journals. Before joining SUTD in 2018, he held positions as a DSTG Postdoctoral Fellow at the University of Melbourne and a Research Engineer at the Living Analytics Research Centre, Singapore Management University. He received his PhD from the University of Melbourne, and MSc (Research) and BCompSci (1st Class Honours) from the University of Western Australia. His research expertise includes Data Mining, Artificial Intelligence, Urban Analytics, Social Computing, and Recommendation Systems, where he has published over 100 papers on these topics and been recognized among the World's Top 2% Scientists in Artificial Intelligence based on yearly research impact since 2022.Kwan Hui has established a robust research portfolio, leading impactful projects through industrial and academic collaborations. He has secured over S$11 million in competitive research funding as Principal Investigator or Co-Investigator, including grants from external sources like the Singapore’s Ministry of Education, National Research Foundation, Ministry of National Development and DSO National Laboratories. In terms of industrial impact, his work has been applied to smart estates monitoring systems and social media campaign analysis systems for various government agencies. He also frequently serves on the technical advisory boards for various government bodies and industry. In terms of research impact, he has published over 90 papers in leading international journals and conferences and earned accolades, such as the 2016 Google PhD Fellowship in Machine Learning for being among the top PhD candidates in Australia, and subsequently, being recognized among the World's Top 2% Scientists in Artificial Intelligence by Stanford University and Elsevier from 2022 to 2024 (annual impact) and 2025 (career impact).As an educator, Kwan Hui has developed and taught numerous courses in the areas of Artificial Intelligence and Data Science, across multiple levels from undergraduates to continuing education professionals. In these capacities, he has successfully delivered high-quality instructions to over 1,000 university students and working professionals, receiving high instructor ratings from 4.4/5.0 in his first year to 4.8/5.0 more recently in 2024. In terms of student mentorship, he has supervised to completion a total of 6 PhD students, 10 Masters students, and over 50 undergraduate students. He has also served as the Chair of 8 PhD Examination Committee, member of over 50 PhD Examination Committee and frequently serves as external examiner for international PhD students.Kwan Hui is actively involved in professional and community service both within SUTD and among the wider community. At the university level, he serves as the Chair of the ISTD Undergraduate Committee, ISTD Lead for Engineering Accreditation and served in numerous other university committees. In these positions, he has led numerous major initiatives, such as curriculum design, course management and successfully obtaining accreditation for SUTD’s B.Eng (CSD) programme, among others. In terms of external service to the wider community, he has held / is holding major positions, such as the Associate Editor for Social Network Analysis and Mining, Guest Editor for Journal of Mechanical Design, Industry Track Chair for the 17th International Conference on Advances in Social Network Analysis and Mining, Senior Programme Committee (PC) Member for top AI conferences like AAAI and IJCAI. In addition, he has contributed as Senior/PC member of over 50 international conferences and served as reviewer for over 30 leading journals.OpeningsPlease refer to our lab website for current openings.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4636,
  "method": "requests",
  "crawl_time": "2025-12-01 13:44:57"
}