{
  "name": "Kwangtaek Kim",
  "homepage": "https://www.kent.edu/cs/kwangtaek-kim",
  "status": "success",
  "content": "Kwangtaek Kim | Computer Science Skip to main content Live Chat Kwangtaek Kim Computer Science Associate Professor Campus: Kent Office Location: MSB 260 Contact Information Email: kkim@cs.kent.edu Phone: 330.672.9061 Personal Website: https://sites.google.com/view/ksu-ict Kwangtaek Kim has a background in computer engineering and electronic engineering and has been doing research in haptics to design/develop novel immersive user interfaces utilizing touch sensing and feedback in three main areas: (1) haptics-enhanced medical imaging systems, (2) 2D/3D haptic user interfaces, and (3) touch feedback-based rehabilitations. He has over 50 publications in the three areas and some of his work has appeared in leading journals such as Sensors, IEEE Transactions on Haptics, and IEEE Transactions on Information Forensics and Security. He is an inventor on 10 issued patents in Korea and China.  He has received multiple research grant awards as the Primary Investigator (PI) totaling more than $1.3 M from the National Science Foundation (NSF) or National Research Foundation (NRF). He has been a faculty member in the Computer Science Department since August 2019 and holds an affiliate visiting professor position at University of Paris-Est Creteil (UPEC), Paris, France. He is a former researcher at Microsoft Research Asia, LG Electronics, SUNY Downstate Medical Center, and Korea Electrotechnology Research Institute (KERI). He is currently a member of IEEE Technical Committee on Haptics, IEEE RAS (Robotics and Automation Society) Technical Committee on Cognitive Robotics, IEEE Signal Processing, and ACM. Potential applications of his research are broad such as smart biomedical devices, content-oriented security, cybernetics (cyber human interface), human computer/machine interface, cutting edge education/training technologies, immersive game interfaces, and VR/AR/MR based user interfaces. Representative research projects are haptics-enhanced human skin exam, wearable haptic orthosis for gait rehabilitation, haptic soft keyboard with piezoelectric actuators on touchscreens, haptics-assisted driver seat for the hearing impaired, haptic guidance feedback for in-air hand gestures, etc. Member, Brain Health Research Institute (BHRI) Immersive Computing for Touch Lab Education Ph.D. Electrical and Computer Engineering, Purdue University Expertise Haptics based rehabilitation, add-on haptic technologies for biomedical imaging systems, visual and touch perception (psychophysics), touchable virtual/augmented reality, tactile feedback on touchscreens, piezo actuator and tactile signal designs for wearable haptic feedback, usability study, 3D haptic watermarking. Education Ph.D. Electrical and Computer Engineering, Purdue University Computer Science Street Address241 Mathematical Sciences Building, Kent, OH 44242-0001 Mailing Address800 E. Summit St.Kent, OH 44242 Contact Us330-672-9980 office@cs.kent.edu Contact Us 330-672-3000 info@kent.edu Facebook LinkedIn Instagram QUICK LINKS Faculty Office Hours Undergraduate CS Tutoring facebook instagram youtube linkedin TikTok X snapchat ... Information Accessibility Annual Security Reports Campus Concerns Reporting For Our Alumni For the Media Jobs & Employment Privacy Statement HEERF CARES/CRRSAA/ARP Act Reporting and Disclosure Website Feedback",
  "content_length": 3324,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:01"
}