{
  "name": "Kylie Peppler",
  "homepage": "http://kpeppler.com",
  "status": "success",
  "content": "Dr. Peppler Curriculum Vitae About me Media Features Talks Highlighted Books Research Interests Education Academic Appointments Highlighted Projects Publications Honors & Awards Courses Taught Contact Info About me Media Features Talks Highlighted Books Research Interests Education Academic Appointments Highlighted Projects Publications Honors & Awards Courses Taught Contact Info Kylie Peppler Professor of Informatics & Education Director of The Creativity Labs Co-Director of The Connected Learning Lab University of California, Irvine An artist by training, Dr. Peppler is a Professor of Informatics and Professor of Education at University of California, Irvine, where she engages in research that focuses on the design of new technologies to support learning and participation within traditionally minoritized populations, particularly at the intersection of the arts and STEM learning ecosystems. Dr. Peppler earned an NSF early CAREER award for her work on how e-textiles and other computational construction kits popularized through the Maker movement can deepen learning and broaden participation across a range of STEM fields. Dr. Peppler's studies have been published in leading journals in the fields of education, technology and the arts, including Science Education; Computers & Human Behavior; Mind, Culture & Activity; British Journal of Educational Technology; Journal of Science and Educational Technology; Studies in Arts Education; Review of Research in Education; Teachers College Record; and Learning, Media & Technology, among many others. Additionally, Dr. Peppler is the author or editor of over 10 books published by a range of outlets, including MIT Press, Peter Lang, Routledge, SAGE Publications, and Teachers College Press. Through this work, Dr. Peppler has received several awards, including the Mira Tech Educator of the Year, Indiana Governor's Award for Tomorrow's Leaders, American Society for Engineering Education (ASEE) Pre-College Engineering Education Division Best Paper Award, One of 20 nominated for SIGCSE Top Ten Papers of All Time Award, Outstanding Junior Faculty Award from Indiana University, and Outstanding Alumni Early Career Award from Psychological and Brain Studies at Indiana University. Her work has been consistently supported by the National Science Foundation as well as a range of foundations, federal and industry partners, including the Gordon and Betty Moore Foundation, the Spencer Foundation, the Wallace Foundation, Google.org, Wellcome Trust, US Department of Education, Boeing, Indiana Department of Education, New York Community Trust, Chicago Community Trust, Best Buy, Fossil Foundation, GAP Inc., National Geographic, as well as the Center for Craft, Creativity, and Design. Dr. Peppler sits on the Editorial Boards for the International Journal for Computer Supported Collaborative Learning and Computer Science Education and has recently served as Guest Editor for the British Journal of Educational Technology and Sustainability. Dr. Peppler was also the lead editor of the two-volume SAGE Encyclopedia of Out-of-School Learning. Follow me Tweets by Dr. Peppler Media Features Watchworthy Wednesday Kylie Peppler is one of 10 Women Championing Connected Learning, honored during Women's History Month by Digital Media + Learning. Follow the link to DML Central to see her video and those of her distinguished colleagues! UCI School of Education: Interview with Informatics Professor Kylie Peppler Kylie Peppler sits down with Dean Richard Arum to share her views on connected learning, the intersection of new technology and the arts, and maker culture. Talks Dr. Peppler shares the latest research findings regularly, with over 100 refereed talks at conferences, such as the American Educational Research Association (AERA), Computer Supported Collaborative Learning (CSCL), International Conference of the Learning Sciences (ICLS), Connected Learning Summit (CLS), and others, in addition to over 130 invited talks around the world. Dr. Peppler has given over 15 keynote presentations--including those at the NSF CyberLearning Synthesis and Envisioning Meeting, American Library Association, FabLearn Conference, Make:Education Forum, Harvard/MIT Learning and the Brain Conference, among others--and has been invited to give presentations at several distinguished national meetings, such as speaking at the Consortium for Schools Networking (CoSN), Smithsonian, White House Champions for Computer Science, Carnegie Foundation for the Advancement of Teaching, National Academies and was the Distinguished Lecturer at the National Science Foundation on her work on new collaborative design technologies. Book Dr. Peppler Highlighted Books Research Interests Arts Education Computation Computer Science Ed Constructionism Creativity Design DIY (Do It Yourself) E-Textiles Gaming Informal Learning Interest-Driven Learning Maker Culture New Media Scratch Programming Systems Thinking Wearable Computing Future of Work For a sortable list of work related to my research interests, please see the publications section of this website. Education 2007–2008: Postdoctoral Research Associate — University of California, Irvine Uncovering Literacies, Disrupting Stereotypes: Media Arts Practices of Youth with (Dis)Abilities Supervisor: Mark Warschauer 2007: Ph.D. in Education — University of California, Los Angeles Dissertation: Creative Bytes: Literacy and Learning in the Media Arts Practices of Urban Youth Committee: James Catterall, Yasmin Kafai, Ernest Morrell, and C.E.B. Reas 2002: B.A. — Indiana University, Bloomington Psychology, French, and Studio Art Academic Appointments 2021 - now Professor: Informatics and Education University of California, Irvine 2018 - 2021 Associate Professor: Informatics and Education University of California, Irvine 2015 - 2018 Associate Professor: Learning Sciences Indiana University, Bloomington 2008 - 2015 Assistant Professor: Learning Sciences Indiana University, Bloomington 2007 UC Presidential Postdoctoral Fellow University of California, Irvine 2002 - 2007 Graduate Student Researcher UCLA Highlighted Projects from the Creativity Labs Current and prior support from: For a full list of projects, please visit the Creativity Labs website. Making Connections to Achieve for the Million Girl Moonshot Developing scalable strategies to make stronger connections between girls' STEM experiences. Connected Arts Learning Studying the impacts of community arts programs over the lifecourse and expanding the purpose and possibilities for the arts. Future of Work with AI and XR Designing XR environments and learning technologies to prepare the future workforce. Re-Crafting STEM Concretizing STEM learning through traditional fiber crafts. Maker Tools and Materials Examining the social construction of electronic tools and materials to broaden participation and deepen learning. Community Arts and STEAM Partnerships Community arts and STEAM learning partnerships to transform learning in out-of-school contexts. ← Back to Highlighted Projects List Maker Tools and Materials PI: Kylie Peppler Funders: National Science Foundation, CAREER Grant Senior Personnel: Joey Huang; Graduate Student Researchers: Lora Cawelti, Santiago Ojeda-Ramirez Funded by Dr. Peppler's Early CAREER award from NSF, this project extends her earlier work on computational textiles (e-textiles) through systematic comparisons across a variety of new tools, materials, and practices used in electronics and computing. The project fully theorizes how the social construction of various tools and materials shapes learning and STEM participation. This project includes series of systematic and crosscutting research investigations on new electronic tools and materials, such as toolkits for paper computing (i.e., paper, conductive paint, and electronics) and e-textiles, among others, that: (1) occur in the complexities of real-world settings such as schools and afterschool clubs; (2) include the development of a new set of assessments; (3) illuminate design principles for creating new tools and educational ecosystems to better support learning and equitable participation; as well as (4) the design of new toolkits and parts based on these emergent principles. The latest phase of this project focuses on robotics, integrating design, computing, arts, and computational thinking toward building kinetic sculptures. Designing and building kinetic sculptures using principles of art, block-based coding, inputs (sensors, buttons, switches), and outputs (servo motors, LEDs) furthers prior inquiry in gendered labor distribution and materials use, while expanding research on computational thinking through making, and designing new integrative learning experiences. Sample Publications Peppler, K., Sedas, M., & Thompson, N. (2023). Paper Circuits vs. Breadboards: Materializing Learners’ Powerful Ideas Around Circuitry and Layout Design. FJournal of Science Education and Technology. Peppler, K. & Wohlwend, K. (2017). Theorizing the nexus of STEAM practice. In J. Katz-Buonincontro and C. Conway (Eds.) Arts Education Policy Review Special Issue: Gathering STEAM, pages 1-12. https://doi.org/10.1080/10632913.2017.1316331 Buchholz, B., Shively, K., Peppler, K., & Wohlwend, K. (2014). Hands on, hands off: Gendered access in sewing and electronics practices. In Mind, Culture, and Activity. July 2014, 21(4) pp. 1-20. https://doi.org/10.1080/10749039.2014.939762 Peppler, K. & Glosson, D. (2013). Stitching circuits: Learning about circuitry through e-textile materials. Journal of Science Education and Technology. October 2013, 22(5), pp. 751-763. https://psycnet.apa.org/record/2013-33183-012 Re-Crafting STEM PIs: Kylie Peppler, Carolyn Rose, Melisa Orta-Martinez Funders: National Science Foundation, EHR Core Senior Personnel: Joey Huang; Graduate Student Researchers: Nickolina Yankova The NSF-funded “Re-Crafting Mathematics Education: Designing Tangible Manipulatives Rooted in Traditio",
  "content_length": 101157,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:04"
}