{
  "name": "Kyomin Jung",
  "homepage": "http://milab.snu.ac.kr/kjung/index.html",
  "status": "success",
  "content": "Kyomin Jung SNU Machine Intelligence LAB Kyomin Jung is a professor in the department of Electrical and Computer Engineering at Seoul National University (SNU). He is an adjunct professor in the department of Mathematical Sciences, SNU. He served as a vice-Chair of the ECE department for student affairs (2021-2023). He was an assistant professor in the department of Computer Science at KAIST from June 2009 to 2013, and he had joint appointments in the departments of Electrical Engineering and in the department of Mathematics KAIST. Received Ph.D. in MIT Mathematics department in June 2009, and was a member of LIDS (Laboratories for Information and Decision Systems) in MIT Electrical Engineering and Computer Science Department. Received B.S. in the Department of Mathematics, Seoul National University in August 2003. Graduated from Seoul Science High School in February 1996. Received the 2023 Sinyang Academic Award for Engineering from SNU College of Engineering. Advisor of a recipient of the Distinguished Doctoral Dissertation Award from SNU, 2022. Received the 2021 IEEE ICDM 10-Year Highest-Impact Paper Award for the paper \"IRIE:Scalable and Robust Influence Maximization in Social Networks\". Advisor of a recipient of the Distinguished Doctoral Dissertation Award from SNU, 2020. Best Paper of the Information Session, International Conference on Information and Knowledge Management (ICIKM), Jul. 2016. Advisor of a recipient of the Distinguished Master's Dissertation Award from SNU, 2015. Recipient of the Excellent New Faculty Funding from NRF Korea (2012 - 2015) on Analysis of Information Diffusion and Network Dynamics in Social Networks Based on Big Data Analytics. Honor Prizes, The 18th and 19th Samsung Electronics Humantech Thesis Prize (advisor), Feb. 2012 and Feb. 2013. Visiting professor at MIT in Summer 2013 & Fall 2016. Visiting professor at Microsoft Research Machine Learning and Perception Group Cambridge, UK in Summer 2009 & Summer 2010. In Summer 2008, he worked at Microsoft Research Machine Learning and Perception Group Cambridge, UK as a research internship. In Summer 2007, he worked at IBM T.J. Watson Research Center System Analysis and Optimization Group, Yorktown, NY, USA as a research internship. In Summer 2006, he worked at Bell Labs Department of Mathematics of networks and systems, Murray Hill, NJ, USA as a research internship. Visiting researcher in Microsoft Research Theory group Redmond, WA, USA in winter 2003-2004. Graduate study supported by Samsung Lee Kun Hee Scholarship Foundation. Gold Medalist in IMO (International Mathematical Olympiad) 1995 held in Toronto, Canada. Research Areas include Natural language processing, Deep learning algorithms, and Data analysis and web services. Academic Activities Senior Technical Program Comittee of AAAI 2022. Associate Editor of Knowledge and Information Systems (KAIS) 2022. Technical Program Committee (Reviewer) of EMNLP 2021. Technical Program Committee (Reviewer) of ICML 2021. Technical Program Committee (Reviewer) of ACL 2021. Technical Program Committee of AAAI 2021. Technical Program Committee (Reviewer) of EMNLP 2020. Technical Program Committee (Reviewer) of ICML 2020. Technical Program Committee (Reviewer) of ACL 2020. Technical Program Committee of AAAI 2020. Technical Program Committee of IEEE ICDM 2019. Gave a Tutorial Talk \"Deep Learning for the Web\" at the WWW 2015. Organizer of the International Workshop on Open Big Data Foundation at IEEE ICDE 2015. Technical Program Committee of ACM SIGMETRICS 2015. Editor in Chief, Korea Information Processing Society Review 2014-2015. Program Committee Member of WWW 2014 Demo Track. Program Committee Member of WWW 2013 Demo Track. Program Committee Member of ACM KDD workshop, Mining Data Semantics in Information Networks, 2012. Organizer of the 2012 Summer School on Social Network Analysis, KAIST, Korea, Aug 2012. Organizer of the 2012 International Social Web Workshop, Ramada hotel Jeju, Korea, Aug 2012. Program Committee Member of 22nd Joint Conference on Communications and Information, 2012. Organizer of the 2011 Summer School on Social Network Analysis, Daejeon, Korea, Aug 2011. Program Committee Member of IEEE Globecom 2010. Program Committee Member of PSIVT 2010. Organizer of the Winter School on Algorithms, Jochiwon, Korea, Jan 2010. Contact International Conference Proceedings International Journal Publications Workshops Contact E-mail: kjung@snu.ac.kr Office: Building 301 Room 1005",
  "content_length": 4490,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:03"
}