{
  "name": "Kyoung Mu Lee",
  "homepage": "https://cv.snu.ac.kr/~kmlee",
  "status": "success",
  "content": "kmlee | CVLab Faculty Kyoung Mu Lee Professor, Ph. D.Department of Electrical and Computer EngineeringCollege of Engineering, Seoul National University1 Gwanak-ro, Gwanak-gu, Seoul 151-744, Korea Phone: +82 02-880-8885 or 02-880-1743, Fax: +822-875-7144E-mail: kyoungmu(at)snu.ac.krGoogle Scholar Profile Biography Kyoung Mu Lee received the BS and MS degrees in control and instrumentation engineering from Seoul National University (SNU), Seoul, Korea, in 1984 and 1986, respectively, and the Ph.D. degree in electrical engineering from the University of Southern California in 1993. He is currently with the Department of ECE, Seoul National University as a professor. He served as vice dean (2009-2011) of Engineering School, director (2012-2014) of the Automation and Systems Research Institute (ASRI). Since 2020 he has served as the director of the Interdisciplinary Program in Artificial Intelligence in the Graduate School of SNU. He has held affiliation with the University of California, San Diego (visiting scientist, 2011-2012), His research interests are in the broad areas of Computer Vision and Machine Learning, including low-level vision, visual tracking and navigation, 3D reconstruction, human pose and shape estimation, and video analysis. He is co-author of more than 70 journal papers and 180 conference papers. Prof. Lee introduced the novel idea of the global skip (residual)-connection in designing deep CNN models for image restoration, which was first used in the VDSR (Very Deep Super-Resolution) algorithm (CVPR2016). The ‘skip connection’ concept made a huge impact and became a de facto standard technique for CNN-based methods for low-level vision problems. He further developed a much deeper and high-performing network, EDSR (Enhanced Deep Super-Resolution), and won the first NTIRE2017 Single Image Super-Resolution (SR) Challenge in all categories. EDSR became a standard benchmark algorithm in SR. Recently, Prof Lee has been working on 3D hand and 3D multi-person pose estimation problems. He won the 2017 3D Hand Pose Estimation Challenge, and the First 3D Poses in the Wild Challenge 2020. He received several awards, in particular, the prestigious 36th Samil Award, the Medal of Merit and the Scientist of Engineers of the month award from the Korean Government in 2020 and 2018, respectively, the Excellence in Research Award from SNU in 2020, MSRA Grant Award in 2016, the Most Influential Paper over the Decade Award by the IAPR Machine Vision Application in 2009, the ACCV Honorable Mention Award in 2007, the Okawa Foundation Research Grant Award in 2006, the Distinguished Professor Award from the College of Engineering of SNU in 2009, and both the Outstanding Research Award and the Shinyang Engineering Academy Award from the College of Engineering of SNU in 2010. He was a distinguished lecturer of the Asia-Pacific Signal and Information Processing Association (APSIPA) for 2012-2013. He is currently serving as the Editor in Chief (EIC) of the IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) which is the top journal in Artificial Intelligence and in all Computer Science. He has served as an Associate Editor in Chief (AEIC) (2014-2019) and an Associate Editor (AE) (2014-2014) of the IEEE TPAMI, an AE of the Machine Vision Application (MVA) Journal (2010-2015), and the IPSJ Transactions on Computer Vision and Applications (CVA) (2008-2012), the EURASIP Journal on Applied Signal Processing (2000-2004), the IEEE Signal Processing Letters (SPL) (2012-2013), and an Area Editor of the Computer Vision and Image Understanding (CVIU) (2013-2018). He also has served as General co-chair of ICCV2019, ACM MM2018, and ACCV2018, a Program co-chair of ACCV2012, a Track chair of ICPR2020 and ICPR2012, and an Area Chair of CVPR, ICCV, and ECCV many times. He is an Advisory Board Member of the Computer Vision Foundation (CVF). He is the founding member and served as a President of the Korean Computer Vision Society (KCVS). Prof. Lee is a Fellow of IEEE, a member of the Korean Academy of Science and Technology (KAST) and the National Academy of Engineering of Korea (NAEK). Professional Activities Government Service/Society Member• IEEE Fellow (2021 – present)• Member of Korean Academy of Science and Technology (KAST) (2020 – Present)• Member of the National Academy of Engineering of Korea (NAEK) (2020 – Present)• Member of the AI Education Council, Korean Ministry of Education (2020 – 2021)• Member of the AI&SW Council, Korean Ministry of Science and ICT (2020 – 2021)• Advisory Board Member of CVF (Computer Vision Foundation) (2016. 1. – 2020)• President, Korean Computer Vision Society (KCVS) (2018 – 2021)• Administrative Committee member of AFCV (Asian Federation of Computer Vision) (2010 – present) Editorial Board Member• Editor in Chief (EIC), IEEE Trans. on PAMI (Pattern Analysis and Machine Intelligence), (2021.01 – Present)• Editorial advisory board member for Academic Press/Elsevier in computer vision and pattern recognition, (2015. 8 – Present)• Associate Editor in Chief, IEEE Trans. on PAMI (Pattern Analysis and Machine Intelligence), (2014.09 – 2019.10)• Area Editor, Computer Vision and Image Understanding (CVIU), (2013.11 – Present)• Guest Editor, Special Issue on Visual Tracking, Computer Vision and Image Understanding, 2015• Guest Editor, Special Issue on Augmented Video, IEEE Trans. on Circuits and Systems for Video Technology, 2015• Associate Editor, IEEE Trans. on PAMI (Pattern Analysis and Machine Intelligence), (2014.01 – 2014. 08)• Associate Editor, IEEE Signal Processing Letters, (2012. 2 – 2013. 12)• Associate Editor, MVA (Machine Vision and Applications) journal, (2010. 1– 2015. 6)• Associate Editor, Journal of Information Hiding and Multimedia Signal Processing (JIH-MSP), (2009.3. – Present)• Associate Editor, IPSJ Transactions on Computer Vision and Applications (CVA), (2008.1. – 2012.1)• Editor, EURASIP Journal on Applied Signal Processing (2000.1 – 2004.9) Conference Chair• Area Chair, IEEE-CVF CVPR (Computer Vision and Pattern Recognition) 2022, New Orleans, LA• Area Chair, IEEE-CVF ICCV (International Conference on Computer Vision) 2021, Oct. 11-17, Montreal, Canada• Area Chair, IEEE-CVF CVPR (Computer Vision and Pattern Recognition) 2021, Nashville, TN• Area Chair, ECCV (European Conference on Computer Vision) 2020, Aug. 23-28, 2020, Glasgow, UK• Track Chair, ICPR (International Conference on Pattern Recognition) 2020, Sep. 13-18, 2020, Milan, Italy• General Chair, IEEE-CVF ICCV (International Conference on Computer Vision) 2019, Oct. 27-Nov. 3, Seoul, Korea• General Chair, ACCV (Asian Conference on Computer Vision) 2018, Dec. 4-6, Perth, Australia• General Chair, ACM MM (Multimedia) 2018, Oct. 22-26, Seoul, Korea• Area Chair, ECCV (European Conference on Computer Vision) 2018, Oct. 8-16, 2014, Munich, Germany• Area Chair, BMVC (British Machine Vision Conference) 2017, 4-7, Sept., London, England.• Area Chair, ACCV (Asian Conference on Computer Vision) 2016, Nov. 20-24, 2016, Taipei, Taiwan• Area Chair, ECCV (European Conference on Computer Vision) 2016, Oct. 8-16, 2014, Amsterdam, The Netherlands• Session Chair, IEEE-CVF CVPR (Computer Vision and Pattern Recognition) 2015, June 7-12, 2015, Boston, Massachusetts• Area Chair, IEEE-CVF CVPR (Computer Vision and Pattern Recognition) 2015, June 7-12, 2015, Boston, Massachusetts• Area Chair, ECCV (European Conference on Computer Vision) 2014, Sep. 5-12, 2014, Zurich, Switzerland• Area Chair, ACCV (Asian Conference on Computer Vision) 2014, Nov. 1-5, 2014, Singapore• Founding General Chair, KCCV (Korean Conf. on Computer Vision) 2014, Aug. 28, Seoul, Korea• Workshop Chair, IEEE-CVF ICCV (International Conference on Computer Vision) 2013, Dec. 1-8, 2013, Sydney, Australia• Area Chair, IEEE-CVF ICCV (International Conference on Computer Vision) 2013, Dec. 1-8, 2013, Sydney, Australia• General Chair, IPIU (Image Processing and Image Understanding) 2013, Feb. 18-20, 2013, Jeju, Korea• Session Chair, IEEE-CVF CVPR (Computer Vision and Pattern Recognition) 2013, June 23-28, 2013, Portland, Oregon• Area Chair, IEEE-CVF CVPR (Computer Vision and Pattern Recognition) 2013, June 23-28, 2013, Portland, Oregon• Program Chair, ACCV (Asian Conference on Computer Vision) 2012, Daejeon, Korea, 2012,• Track Chair, ICPR (International Conference on Pattern Recognition) 2012, Nov. 11-15, 2012, Tsukuba, Japan• Session Chair, IEEE CVPR (Computer Vision and Pattern Recognition) 2012, June 2012, Providence, Rhode Island• Area Chair, IEEE CVPR (Computer Vision and Pattern Recognition) 2012, June 2012, Providence, Rhode Island• Area Chair, ACCV (Asian Conference on Computer Vision) 2010, Nov. 8-12, 2010, Queenstown, New Zealand• Associate Editor, IEEE ICRA (International Conference on Robotics and Automation) 2010, May 3-8, 2010, Anchorage, Alaska• Area Chair, ACCV (Asian Conference on Computer Vision) 2009, Sep. 23-27, 2009, Xian, China• Area Chair, ACCV (Asian Conference on Computer Vision) 2007, Nov. 18-22, 2007, Tokyo Japan• General chair, FCV (Frontiers of Computer Vision) 2007, Jan. 25-27, 2007, Busan, Korea,• Program Chair, FCV (Frontiers of Computer Vision) 2006, Feb. 2-3, 2006, Tokushima, Japan Award Committee Member• Best Paper (Marr Prize) Award Committee, ICCV2021• Best Paper Award Committee, CVPR2021• PAMI TC Thomas S. Huang Memorial Award Committee, CVPR2021• PAMI TC Longuet-Higgins Prize Committee, CVPR2020• AFCV Fellow Committee, ACCV2016• Best Paper Award Committee, ACCV2014 Organizing Committee Member• Advances in Image Manipulation (AIM) workshop and challenges on image and video manipulation 2021, Oct 16, 2021, Virtual• New Trends in Image Restoration and Enhancement (NTIRE) workshop and challenge on image super-resolution 2021, June 19, 2021, Virtual• Advances in Image Manipulation (AIM) workshop and challenges on image and video manipulation 2020, Aug. 28, Virtual• New Trends in Image Restoration and Enhancement (NTIRE) workshop and chall",
  "content_length": 17502,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:05"
}