{
  "name": "Kyu-Young Whang",
  "homepage": "http://dblab.kaist.ac.kr/Prof/main_eng.html",
  "status": "success",
  "content": "Professor Whang Kyu-Young (KAIST Distinguished Professor, May 2008 - Aug. 2021) Professor  Whang, Kyu-Young (KAIST Distinguished Professor, May 2008 - Aug. 2021) School of Computing Korea Advanced Institute of Science and Technology 291, Daehak-ro, Yuseong-gu Daejeon 34141, Korea E-mail : kywhang@kaist.ac.kr, kywhang@gmail.com Lab URL: http://dblab.kaist.ac.kr [ Lab Homepage || Brief Bio || Professional Experience || Research Interests || Courses ] [ Honors || Professional Activities || Publications || Invited Talks || Research & Projects || Major Projects || Alumni ] Brief Bio Kyu-Young Whang graduated (Summa Cum Laude) from Seoul National University in 1973 and received the M.S. degrees from Korea Advanced Institute of Science and Technology (KAIST) in 1975, and Stanford University in 1982. He earned the Ph.D. degree from Stanford University in 1984. From 1983 to 1991, he was a Research Staff Member at IBM T. J. Watson Research Center, Yorktown Heights, NY. In 1990, he joined KAIST, where he currently is a KAIST Distinguished Professor and a professor emeritus at School of Computing. He is also affiliated with Daegu Gyeongbuk Institute of Science & Technology (DGIST) as a Visiting Chair Professor since 2016. He established and led Advanced Information Technology Research Center (AITrc), an engineering center of excellence (ERC) supported by National Research Foundation (NRF) of Korea, as the director from 1999 to 2016. His research interests encompass database systems/storage systems, object-oriented databases, geographic information systems (GIS), data mining/data warehouses, XML databases, search engines, and big data management platforms and analytics. Dr. Whang served as an IEEE Distinguished Visitor from 1989 to 1990, received the Best Paper Award from the 6th IEEE International Conference on Data Engineering (ICDE) in 1990, served the ICDE seven times as a program co-chair or vice chair from 1989 to 2006, and served program committees of over 110 international conferences including VLDB and ACM SIGMOD. He was the program chair (Asia and Pacific Rim) for COOPIS'98, the program chair (Asia, Pacific, and Australia) for VLDB 2000, and a program co-chair of ICDE2006. He was the general chair of VLDB2006, PAKDD 2003, and DASFAA 2004. He twice received the External Honor Recognition from IBM. Dr. Whang served as an Editor-in-Chief of the VLDB Journal from 2003-2009 (Coordinating EIC from 2007-2009) after serving the editorial board as a founding member for thirteen years. He was an associate editor of the IEEE Data Engineering Bulletin from 1990 to 1993, Distributed and Parallel Databases Journal from 1991 to 1995, Int'l J. of GIS from 1994 to 2007, and IEEE TKDE from 2002 to 2006. He is on the editorial board of the WWW Journal. He was a trustee of the VLDB Endowment from 1998 to 2004 and from 2010 to 2016 (reelected). He served as Chair, Vice Chair, Advisor, and the Awards Chair of the steering committee of DASFAA. He served as a steering committee member of the IEEE ICDE, PAKDD, APWeb, and ADMA Conferences. He served the IEEE Computer Society Asia/Pacific Activities Group as the Korean representative from 1993 to 1997. He was a member of IFIP WG 2.6 from 1994 to 2012. He served the data engineering community as the Chair/Advisor of IEEE Technical Committee on Data Engineering from 2013 to 2015/2015 to present. Dr. Whang received the ACM SIGMOD Contributions Award (2014) for his contributions and leadership in promoting database research world-wide, IEEE TCDE Service Award (2023) for his contributions to the advancement of the IEEE ICDE and TCDE and decades-long dedicated leadership and service to the data engineering community and PAKDD Distinguished Contributions Award (2014), and DASFAA Outstanding Contributions Award (2011) for his contributions to database and data mining research in the Asia-Pacific region. He is the recipient of the prestigious (Presidential) Korea Engineering Award (2012) and (Presidential) Korean Supreme Scientist/Engineer Award (2017). Dr. Whang is an ACM Fellow, an IEEE Life Fellow, and a member of prestigious The National Academy of Sciences Republic of Korea. Professional Experience 2018 - present Member, The National Academy of Sciences Republic of Korea 2008 - 2021 KAIST Distinguished Professor 2016 - present DGIST Visiting Chair Professor 2016 - present Professor Emeritus at School of Computing, KAIST 1990 - 2016 Professor, School of Computing, KAIST 1999 - 2016 Director, Advanced Information Technology Research Center(AITrc) -- an Engineering Research Center(ERC) of Excellence supported by Korea Science and Engineering Foundation(KOSEF) 1998 - 1999 Director, Academic Information Management, Computing, and Science Library, KAIST 1995 - 1997 Chairman, Computer Science Department, KAIST 1983 - 1991 IBM T.J. Watson Research Center, Research Staff Memeber 1975 - 1978 Senior Engineer, Agency for Defense Development (ADD), Korea Research Interests Object-Relational Database Systems XML and Web Databases IR and Search Engines Data Warehousing and Data Mining Advanced Storage Systems Spatial Databases and GIS Distributed Systems, P2P, Web Services Multimedia Information Systems Main-Memory Database Systems Light-weight Database Systems Sensor Networks and Stream Databases Large-Scale (Big) Data Management and Analytics Courses Details Honors International ACM Fellow, Nov. 2009 IEEE Fellow/Life Fellow, Jan. 2007/Jan. 2016 IEEE TCDE Service Award, 2023 ACM SIGMOD Contributions Award, 2014 ACM SIGMOD Distinguished Database Profile, Apr. 2007 PAKDD Distinguished Contributions Award, 2014 DASFAA Outstanding Contributions Award, 2011 Best Demonstration Award: IEEE 21st Int'l Conf. on Data Engineering (ICDE), Tokyo, Japan, Apr. 2005 Best Paper Award, IEEE 6th Int'l Conf. on Data Engineering (ICDE), LA, 1990 IEEE Distinguished Visitor, 1989-1990 Senior Member, IEEE, 1988 Certificate of Appreciation, IEEE Computer Society, 1989, 1990, 1992, 1997, 2005, 2006 IBM External Honor Recognition, 1989, 1990 Biographed in the Marquis' Who's Who in the World (from the 11th Edition, 1993) Biographed in the Marquis' Who's Who in Science & Engineering (from 1995) Biographed in the Marquis' Who's Who in Asia (from 2006) Domestic The Order of Science and Technology Merit, The Chang-jo Medal, The President of Republic of Korea, April 2025 Member, The National Academy of Sciences Republic of Korea, July 2018-present The Korean Supreme Scientist/Engineer Award, The President of Republic of Korea/The Korean Federation of Science and Technology Societies, July 2017 The Korea Engineering Award, The President of Republic of Korea/National Research Foundation, Dec. 2012 Jangyoungsil Science & Technology Main Award, Jangyoungsil Commemoration Service Association, Oct. 2017 KAIST Distinguished Professor, May 2008-Aug. 2021 KIISE Distinguished Visitor, 2008 30 Representative Basic Research Accomplishments in Korea, Korea Science and Engineering Foundation (KOSEF), Nov., 2005 Science and Technology Excellent Paper Award, Korean Federation of Science and Technology Societies, May 2005 Academic Contributions Award (Gold), Korea Institute for Information Scientists and Engineers (KIISE), July 2008 The 2003 KAIST Professor of the Year Award, KAIST, Jan. 2004 Member/Senior Member, the National Academy of Engineering of Korea, Jan. 2002-Dec.2016/Jan.2017-present Member/Life Member, the Korean Academy of Science and Technology, Nov. 2001/Jan. 2022-present Academic Excellence Award, Korea Information Science Society, Apr. 2002 Kahun Academic Excellence Award, Korea Information Science Society, Oct. 2001 100 Innovative Technologies of the 20th centry Award, Ministry of Science and Technology/Seoul Economy Daily, Dec. 1999 Information and Culture Innovative Technology Award, Prime Minister of Republic of Korea/Ministry of Information and Communications, June 1999 Scientist of the Month Award, Minister of Science and Technology of Republic of Korea, May 1998 Recognition of Contributions/Certificate of Appreciation, Korea information Science Society, 1993, 1994, 1996, 1998, 2001, 2002, 2008, 2023 Inchon Memorial Fellowship, 1970-1973 University President's Prize for being the first from the top in the graduating class of the engineering college, Seoul National University, Feb. 1973 Graduated Summa Cum Laude from Seoul National University, Feb. 1973 Graduate Fellowship from Rotary Foundation, 1978-1979 Professional Activities (Selected)    Full List International Trustee: The VLDB Endowment, 1998-2004;2010-2016 (re-elected) Editor-in-Chief: The VLDB Journal, 2003-2009 (Coordinating EIC: 2007-2009) Chair/Advisor: IEEE Technical Committee on Data Engineering (IEEE TCDE), 2013.1-2014.12/2015.1-2022.12 Executive Committee Member, IEEE TCDE, 2011-2012 Chair (Co-Founder)/Advisor: Korea-Japan Database (KJDB) Working Group, 2005-2010/2010-present Chair: IEEE TCDE Nominating Committee, 2016, 2018 Member: ACM SIGMOD Nominating Committee, 2008-2009 Editorial Board Member, The Data-Centric Systems and Applications Series, Springer, 2006-present Associate Editor: IEEE Transactions on Knowledge and Data Engineering, 2002-2005 Associate Editor (Founding): The VLDB Journal, 1990-2003 Associate Editor: Distributed and Parallel Databases: An International Journal, 1991-1995 Associate Editor: International Journal of Geographical Information Science, 1994-2007 Associate Editor: The World Wide Web Journal, 2002-present Associate Editor: The IEEE Data Engineering Bulletin, 1990-1993 Member: IEEE TCDE Awards Committee, 2015 – 2017 Advisor: IEEE TCDE Awards Committee, 2014 Chair: IEEE ICDE 2006 Best Paper Award Committee, 2006 Member: IEEE ICDE (Influential Paper) Awards Committee, 2004-2008 Member: ACM SIGMOD Jim Gray Doctoral Dissertation Award Committee, 2008-2012 Member: VLDB 2012 Ten-Year Best Paper Award Committee, 2012 Member: VLDB 2010 Ten-Year Best Paper Award Committee, 2010 Member: VLDB 2006 Ten-Year Best Paper Award Committee, 2006 Member: ",
  "content_length": 40720,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:08"
}