{
  "name": "Kyunghyun Cho",
  "homepage": "http://www.kyunghyuncho.me",
  "status": "success",
  "content": "Kyunghyun Cho Skip to content Kyunghyun Cho Glen de Vries Professor of Health StatisticsProfessor at CILVR Group, Computer Science (Courant Institute) and Center for Data ScienceCo-Director of Global Frontier AI Lab (together with Prof. Yann LeCun) New York University Co-Founder & Executive Director of Frontier Research Prescient Design in Genentech Research & Early Development (gRED) CIFAR Fellow of Learning in Machines & Brains (former CIFAR Azrieli Global Scholar) Associate Member of the National Academy of Engineering of Korea Bluesky: @kyunghyuncho.bsky.social Twitter: @kchonyc Bio: Kyunghyun Cho is a professor of computer science and data science at New York University and an executive director of frontier research at the Prescient Design team within Genentech Research & Early Development (gRED). He became the Glen de Vries Professor of Health Statistics in 2025. He is also a CIFAR Fellow of Learning in Machines & Brains and an Associate Member of the National Academy of Engineering of Korea. He served as a (co-)Program Chair of ICLR 2020, NeurIPS 2022 and ICML 2022. He was one of the three founding Editors-in-Chief of the Transactions on Machine Learning Research (TMLR) until 2024. He was a research scientist at Facebook AI Research from June 2017 to May 2020 and a postdoctoral fellow at University of Montreal until Summer 2015 under the supervision of Prof. Yoshua Bengio, after receiving MSc and PhD degrees from Aalto University April 2011 and April 2014, respectively, under the supervision of Prof. Juha Karhunen, Dr. Tapani Raiko and Dr. Alexander Ilin. He received the Samsung Ho-Am Prize in Engineering in 2021. He tries his best to find a balance among machine learning, natural language processing, and life, but almost always fails to do so. Academic Background D.Sc., Aalto UniversitySchool of Science, 2014 Thesis: Foundations and Advances in Deep Learning M.Sc. with distinction, Aalto University School of Science, 2011 Programme: Master’s Programme in Machine Learning and Data Mining (MACADAMIA) Thesis: Improved Learning Algorithms for Restricted Boltzmann Machines B.Sc., Korea Advanced Institute of Science and Technology, 2009 Major: Computer Science Search for: MenuAbout me Blog Contact Pro Bono Lecture Notes Talks Courses Research Activites Research Group Disclosure Acknowledgement Recent Posts MyChartExplorer: a vibe-coding journey toward accessing my own medical records Drug Discovery may be in the Cold War Era Global AI Frontier Lab at New York University Glen de Vries Professor of Health Statistics Softmax forever, or why I like softmax Blog Posts News Personal Research Uncategorized Meta Log in Entries feed Comments feed WordPress.org",
  "content_length": 2701,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:09"
}