{
  "name": "Kyungim Baek",
  "homepage": "http://www2.hawaii.edu/~kyungim",
  "status": "success",
  "content": "Kyungim Baek | University of Hawai`i at Manoa Kyungim Baek Associate Professor Department of Information and Computer Sciences University of Hawai'i at Manoa Pacific Ocean Science and Technology (POST) Building, Room #317 1680 East-West Road, Honolulu, HI 96822 Office: POST 303-F Phone: (808) 956-8560 Fax: (808) 956-3548 E-mail: kyungim(AT)hawaii.edu I am an Associate Professor in the Information and Computer Sciences Department at the University of Hawai'i at Manoa and a co-PI of the Bioinformatics Laboratory (BiL) in the department. During 2010-2013, I was an Associate Director of the Bioinformatics Core of COBRE, Pacific Center for Emerging Infectious Diseases Research. Prior to my current appointment, I was a Postdoctoral Research Scientist at the Laboratory for Intelligent Imaging and Neural Computing (LIINC) at Columbia University between 2002 and 2005. I received my Ph.D. in Computer Science from Colorado State University in 2002, my M.Sc. in Computer Science, and B.Sc. in Mathematics from Sogang University in 1996 and 1994 respectively. Research Interests (publications) Computer vision; Machine learning; Computational model of visual perception Pattern recognition and machine learning in Bioinformatics Teaching at UH ICS 141: Discrete Mathematics for CS I (F07, F08, S10, (F10), S11, F12 ~ F13, F14, S16, S20 ~ S22) ICS 235: Machine Learning Methods (F21, F22) ICS 241: Discrete Mathematics for CS II (F06, S08, F09, F11, S12, S14, S15, S16 ~ S17, F18 ~ F19, S23) ICS 434: Data Science Fundamentals (S23) ICS 476: Bioinformatics Algorithms and Tool Development (F12, F15 (as ICS 491)) ICS 483: Computer Vision (S07, F19, F20, F22) ICS 663: Pattern Recognition (F06 (OC & ALN), S08 (OC & ALN), F09, F11, F15) ICS 683: Advanced Computer Vision (F08 (as ICS 691), S09, F13, F18) ICS 691: Computer Vision and Applications (F07) HON 496: Senior Honors Project (Adviser) (S08, Sum08) ICS 496: Capstone Project (S21) ICS 499: Computer Projects - Independent Study (F05, S20) ICS 699: Directed Reading/Research (S08, F09 ~ F13, F14, F15 ~ S20, S22 ~ S23) ICS 700: Thesis Research (F22, S23) ICS 800: Dissertation Research (S20 ~ S22) Guest lecture in ICS 101: Digital Tools for the Information World (S10, S11, S12, S13, S14, S15, F15, F16)",
  "content_length": 2260,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:09"
}