{
  "name": "Kyungtae Kim",
  "homepage": "https://kt0755.github.io",
  "status": "success",
  "content": "Kyungtae Kim @ Dartmouth Kyungtae Kim Department of Computer Science 15 Thayer Drive Hanover, NH 03755 [Email] About me I am an assistant professor at Dartmouth College. I earned my Ph.D. from Purdue University co-advised by Prof. Dave Tian and Prof. Byoungyoung Lee. I am looking for motivated graduate students in systems and software security research. If you are interested in working with me, please drop me an email. Research Interests Systems and Software Security; Program Analysis Publications Fuzz The Power: Dual-role State Guided Black-box Fuzzing for USB Power Delivery. Kyungtae Kim, Sungwoo Kim, Kevin Buttler, Antonio Bianchi, Rick Kennell, Dave (Jing) Tian. 32nd Usenix Security Symposium (USENIX Sec 2023), August 2023. Fuzzing SGX Enclaves via Host Program Mutations. Arslan Khan, Muqi Zou, Kyungtae Kim, Dongyan Xu, Antonio Bianchi, Dave (Jing) Tian. 8th IEEE European Symposium on Security and Privacy (EuroS&P 2023), July 2023. TruEMU: An Extensible, Open-Source, Whole-System iOS Emulator. Trung Nguyen, Kyungtae Kim, Antonio Bianchi, Dave (Jing) Tian. 25th Black Hat USA, Aug 2022. FuzzUSB: Hybrid Stateful Fuzzing of USB Gadget Stacks. Kyungtae Kim, Taegyu Kim, Ertza Warraich, Byoungyoung Lee, Kevin Butler, Antonio Bianchi, Dave (Jing) Tian. 43rd IEEE Symposium on Security and Privacy (S&P 2022), May 2022. PASAN: Detecting Peripheral Access Concurrency Bugs within Bare-metal Embedded Applications. Taegyu Kim, Vireshwar Kumar, Junghwan Rhee, Jizhou Chen, Kyungtae Kim, Chung Hwan Kim, Dongyan Xu, Dave Tian. 30th Usenix Security Symposium (USENIX Sec 2021), August 2021. Vessels: Efficient and Scalable Deep Learning Prediction on Trusted Processors. Kyungtae Kim, Chung Hwan Kim, Junghwan Rhee, Xiao Yu, Haifeng Chen, Dave (Jing) Tian, Byoungyoung Lee. 11th ACM Symposium on Cloud Computing (SoCC 2020), Oct 2020. HFL: Hybrid Fuzzing on the Linux Kernel. Kyungtae Kim, Dae R. Jeong, Chung Hwan Kim, Yeongjin Jang, Insik Shin, Byoungyoung Lee. 27th Network and Distributed System Security Symposium (NDSS 2020), Feb 2020. Razzer: Finding Kernel Race Bugs through Fuzzing. Dae R. Jeong, Kyungtae Kim, Basavesh Ammanaghatta Shivakumar, Byoungyoung Lee, Insik Shin. 40th IEEE Symposium on Security and Privacy (S&P 2019), May 2019. OBLIVIATE: A Data Oblivious Filesystem for Intel SGX. Adil Ahmad, Kyungtae Kim, Muhammad Ihsanulhaq Sarfaraz, Byoungyoung Lee. 25th Network and Distributed System Security Symposium (NDSS 2018), Feb 2018. J-Force: Forced Execution on JavaScript. Kyungtae Kim, I Luk Kim, Chung Hwan Kim, Yonghwi Kwon, Yunhui Zheng, Xiangyu Zhang, Dongyan Xu. 26th International Conference on World Wide Web (WWW 2017), April 2017. LDX: Causality Inference by Lightweight Dual Execution. Yonghwi Kwon, Dohyeong Kim, William N. Sumner, Kyungtae Kim, Brendan Saltaformaggio, Xiangyu Zhang, Dongyan Xu. 21st International Conference on Architectural Support for Programming Language and Operating Systems (ASPLOS 2016), April 2016. P2C: Understanding Output Data Files via On-the-Fly Transformation from Producer to Consumer Executions. Yonghwi Kwon, Fei Peng, Dohyeong Kim, Kyungtae Kim, Xiangyu Zhang, Dongyan Xu, Vinod Yegneswaran, John Qian. 22nd Network and Distributed System Security Symposium (NDSS 2015), Feb 2015. Securing Heap Memory by Data Pointer Encoding. Kyungtae Kim, Changwoo Pyo. Future Generation Computer Systems (FGCS 2012), 28(8), 2012.",
  "content_length": 3397,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:08"
}