{
  "name": "Kyunghan Lee",
  "homepage": "http://nxc.snu.ac.kr",
  "status": "success",
  "content": "HOMESearch this siteEmbedded FilesSkip to main contentSkip to navigationNetworked Computing Lab.NXC Lab. led by Prof. Kyunghan Lee envisions and aims at realizing the future of networked computing systems for/with AI through working on broad research topics such as AI-Factory (AI Datacenter), AI-RAN, 6G Cellular Systems with Performance Guarantee, Reasoning with Agentic AI, AI-serving Systems (Network-as-a-Computer), Mobile/Wearable Computing with Thin Clients, Task-oriented Communications (Semantic Communications), Extended/Augmented Reality (Metaverse), Blockchain/Web3.0, and Internet of Things. (Check NXC Lab Overview, NXC Lab_Intro, Paper Reading List to understand more about us.) Ph.D. / Post-Doc. / Internship Opportunity at NXCNXC Lab welcomes passionate Ph.D./M.S. students, undergraduate research interns, and Post Doc. researchers, who are interested in the NXC vision above. If you are interested in working with us, please send an email with your CV to Prof. Lee.  Here, you can find a brief overview of how you can start an Internship at NXC Lab. NXC Lab. News[2025.09.13] Sunghyun and Serae's paper on serving time-sensitive AI workloads over RAN, \"End-to-End Coordination of RAN and Edge Server for Latency-Critical Inference Serving over Cellular Networks\" has been accepted to ACM CoNEXT 2025. Many congratulations!! [2025.08.28] Dr. Wooseung Nam has received his Ph.D. degree! Congratulations on his graduation and best wishes for his new career at KAIST as a Post Doc. (AI InnoCore).  [2025.07.14] Goodsol's paper on improving QoE over RAN written in collaboration with Prof. Bahk (SNU), Prof. Ha (CU Boulder), Prof. Kim, and Prof. Chiang (Purdue), \"QCON: Seamless QoE-Aware 5G Streaming via Multi-Connectivity\" has been accepted to USENIX NSDI 2026. Many congratulations! [2025.07.14] Our joint paper with Prof. Ha's group at CU Boulder on accelerating SFU server with SmartNICs, \"eXpressSFU: Toward Super-Scalable Video Conferencing with SmartNICs\" has been accepted to USENIX NSDI 2026. Many congratulations![2025.07.13] Siyavushkon's paper on realizing AI-on-RAN, \"AoRA: AI-on-RAN Architecture for Backhaul-free Edge Inference\" has been accepted to ACM SIGCOMM 2025 as a short version. Many congratulations! [2025.06.18] Prof. Lee will serve on the Technical Program Committee for IEEE INFOCOM 2026 (Tokyo, Japan). [2025.05.23] Byunggu is awarded a Student Travel Grant from ACM MobiSys 2025. Congratulations! [2024.04.04] Donggyu, Wooseung, and Byunggu's paper on parameterized 3D conferencing, \"Empilo: Realizing Immersive Mobile 3D Video Conferencing through Parameterized Communication\" has been accepted to ACM MobiSys 2025. Many congratulations![2025.03.10] Prof. Lee and our TAs received the Lee Byoungho Excellence in Teaching Award from the College of Engineering at Seoul National University for the undergraduate course, Introduction to Data Communication Networks taught in 2024 Fall. Congratulations![2025.02.26] Dr. Shinik Park, Dr. Kyungmin Bin (Ph.D), and Mr. Dongwook Choi (MS) have received their Degrees! Congratulations on their graduation and best wishes for their new career at Samsung Electronics and Samsung SDS. [2025.02.12] Daewook and Taekyoung won Bronze Prize from the 31st Samsung Humantech Paper Award in the field of communications & networks. Many congratulations!! [2025.01.20] Our joint work paper with MMLAB on designing a security oracle for the Internet, \"A Certificate-centric Security Oracle for the Trustworthy Internet\" has been accepted to ACM WWW 2025 as a short version. Congratulations![2025.01.13] Wooseung and Sungyong's paper on neural compressive transmission \"nCTX: A Neural Network-Powered Lossless Compressive Transmission using Shared Information\" has been accepted to IEEE Transactions on Mobile Computing (IF: 7.7). Many Congratulations!![2024.12.19] Kyungmin and Seyeon's paper on timely DNN processing for mobile platforms, \"NeuroBalancer: Balancing System Frequencies with Punctual Laziness for Timely and Energy-efficient DNN Inferences\" has been accepted to IEEE Transactions on Mobile Computing (IF: 7.7). Many Congratulations!![2024.12.15] Our paper \"Towards a Dynamic Future with Adaptable Computing and Network Convergence (ACNC)\" has been accepted to IEEE Network (IF: 7.61). Congratulations![2024.12.13] Wooseung, Sungyong, and Huijeong's paper on neural semantic compression technique, \"N-epitomizer: A Semantic Offloading Framework leveraging Essential Information for Timely Neural Network Inferences\" has been accepted to the most respected journal in networking, IEEE/ACM Transactions on Networking (IF: 4.00). Many congratulations!! [2024.12.04] Prof. Lee will serve IEEE ICNP 2025 as a General Co-Chair with Prof. Dongsu Han and Prof. Songmin Kim (KAIST), which will be held in Seoul.[2024.11.04] Chanjeong received the Best Presentation Award from the A3 Foresight Program 2024 (Beijing, China). Congratulations! [2024.10.16] Prof. Lee received the Sinyang Outstanding Researcher Award 2024 (신양공학학술상, 학술부문) from the College of Engineering at Seoul National University. Congratulations![2024.09.29] Dongwook's 1st research paper on efficient packet processing in mobile devices, \"ADQ: Application-aware Socket Buffer Dequeueing for Mobile Devices\" has been accepted to IEEE CCNC 2025. Many Congratulations![2024.09.27] Prof. Lee has been selected as a recipient of the Okawa Research Grant Award 2024 from the Okawa Foundation, Japan. Congratulations! [2024.08.16] Kyungmin received the Outstanding Paper Award 2024 from the Samsung DS Division. Congratulations! [2024.06.24] Dr. Jeongmin Bae (NXC postdoc) is awarded the Next-Generation Scholar Grant from the NRF of Korea. Many Congratulations! [2024.06.17] Donggyu received the Best Presentation Award from the A3 Foresight Program 2024 (Jeju, South Korea). Congratulations! [2024.06.11] Prof. Lee won the JCN Best Paper 2024 for his co-authored paper, 6G R&D Vision: Requirements and Candidate Technologies published in JCN (Journal of Communications Networks).  [2024.05.18] Prof. Lee will serve on the Technical Program Committee for IEEE INFOCOM 2025 (London, UK). [2024.05.08] Chanjeong is awarded a Student Travel Grant from ACM MobiSys 2024. Congratulations! [2024.03.07] Kyungmin, Jongseok, Chanjeong, and Seyeon's paper on coactive neural inference offloading, \"CoActo: CoActive Neural Network Inference Offloading with Fine-grained and Concurrent Execution\" has been accepted to ACM MobiSys 2024. Many congratulations![2024.02.07] NXC received 4 Prizes from the 30th Samsung HumanTech Paper Award (3 in the field of communications/networking and 1 in the field of computing). 1 Gold Prize (Jeongmin and Jongyun) and 3 Encouragement Prize (Shinik, Wooseung, and Jongseok). Outstanding! Many congratulations!![2023.12.01] Shinik, Sanghyun, Jongyun, and Junseon's paper on extremely low-latency video streaming, \"ExStream: A Delay-minimized Streaming System with Explicit Frame Queueing Delay Measurement\" has been accepted to INFOCOM 2024. Many congratulations!![2023.09.22] Jongseok, Kyungmin, and Gibum's paper on opportunistic parallelism for dynamic computation of neural networks, \"ASPEN: Breaking Operator Barriers for Efficient Parallelization of Deep Neural Networks\" has been accepted to NeurIPS 2023 with high review scores. Many many congratulations![2023.09.21] Jeongmin received the Best Presentation Award from the A3 Foresight Program 2023 (Nanjing, China). Congratulations! [2023.08.16] ORIA (Open RAN Industrial Alliance) of Korea has been launched with the support of the Korean government and major networking service and equipment companies in Korea. Prof. Lee will serve as the chair of the softwarization committee in ORIA. [2023.07.26] Seyeon, Kyungmin, and Donggyu's paper on offloaded computing, \"ENTRO: Tackling the Encoding and Networking Trade-off in Offloaded Video Analytics\" has been accepted to ACM Multimedia (MM) 2023, which is the top ACM conference on multimedia topics. Many Congratulations!![2023.05.18] Multi-path video conferencing work in collaboration with CU Boulder, \"Converge: QoE-driven Multipath Video Conferencing over WebRTC\" has been accepted to ACM SIGCOMM 2023. Congratulations!![2023.04.29] Prof. Lee will serve on the Technical Program Committee for IEEE INFOCOM 2024 (Vancouver, Canada). [2023.04.24] Jongyun and Junseon's large-scale measurement work in collaboration with CU Boulder and Purdue, \"An Empirical Study of 5G: Effect of Edge on Transport Protocol and Application Performance\" has been accepted to IEEE Transactions on Mobile Computing (IF: 6.075). Many congratulations!! [2023.04.22] Prof. Lee joins the panel discussion event at the Networking Channel organized by Prof. Jim Kurose (UMass) and Dr. Christope Diot (Google) as a panelist. Prof. Lee will discuss \"AI for Networking and Networking for AI\" in the perspective of his 6G vision. [2023.04.04] Serae, Sunghyun, and Junseon's paper on new cellular resource orchestration, \"Towards Enabling Performance-Guaranteed Slice Management and Orchestration in 6G\" has been accepted to the 2023 EuCNC & 6G Summit. Congratulations!![2023.04.02] Junseon's paper on cellular latency control, \"Enabling Delay-Guaranteed Congestion Control with One-Bit Feedback in Cellular Networks\" has been accepted to the most respected journal in networking, IEEE/ACM Transactions on Networking (IF: 3.796). Many congratulations!! [2023.02.04] Prof. Lee will serve on the Technical Program Committee for WiOPT 2023 (Singapore).[2023.02.03] Prof. Lee is honored to serve HSN 2024 (Jeju, South Korea) as the Program Chair. [2022.12.20] Junseon won NAVER Ph.D. Fellowship Award 2022 from UNIST for the second time! Many many congratulations! [2022.12.07] Many congratulations to Junseon and Sungyong for successfully defending their Ph.D. dissertation. All the best wishes to Dr. Kim and Dr. Lee! [2022.10.18] Prof. Lee will serve ACM MobiHoc 2023 as a Program Committee Member.[2022.09.29] Prof. Lee received the Best Teaching Faculty ",
  "content_length": 17039,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:08"
}