{
  "name": "Lace M. K. Padilla",
  "homepage": "http://www.lacepadilla.com",
  "status": "success",
  "content": "Lace Padilla Home Research Papers Talks Openings Lace Padilla CV 路 路 路 路 Mastodon l.padilla [at] northeastern.edu Lab Website Northeastern University Teaching DS 4200 Information Presentation & Visualization (Summer 25) CS 7250 Info Viz Theory and Application (Spring 25, Fall 23) PSYC 3466 Cognition (Spring 25) CS 7295 Visualization and HCI as decision-making aids (Fall 24) CS 5340 Human-Computer Interaction (Spring 24) Lace Padilla joined Northeastern University in 2023 as an Assistant Professor of Computer Science and Psychology, where she is a member of the Data Visualization Lab @Khoury. Her interests lie in the intersection between Information Visualization, Behavioral Decision Making, and HCI. Her research on uncertainty communication explores how to align data visualizations of future events with human decision-making capabilities. She has received numerous honors, including the IEEE VGTC Significant New Researcher Award, an NSF CAREER Award, a Best Paper Award at IEEE VIS, multiple honorable mentions [1, 2], and the APA Early Career Award. She is the PI and Co-PI on several other grants funded by NSF (#2122174, #2028374, #1810498, #2400471), NIH (#1R01AI188576-01), and DOE. Selected Publications IEEE VIS 2024: Impact of Vertical Scaling onNormal Probability Density Function Plots Fygenson, R., Padilla, L. PDF VIS 2023 (Best Paper Award Honerable Mention): Average Estimates in Line Graphs are Biased Toward Areas of Higher Variability. Moritz, D., Padilla, L., Nguyen, F., Castro, S., Bertini, E. PDF | Data + Analysis | Pre-registration | Slides VIS 2022 (Best Paper Award): Multiple Forecast Visualizations (MFVs): Trade-offs in Trust and Performance in Multiple COVID-19 Forecast Visualizations. Padilla, L., Fygenson, R., Castro, S., Bertini, E. PDF | Data + Analysis | Pre-registration The Science of Visual Data Communication: What Works. Franconeri, S. L., Padilla, L., Shah, P., Zacks, J. M., and Hullman, J. Psychological Science in the Public Interest, 2021. PDF Uncertainty Visualization (book chapter) Padilla, L.., Kay, M. and Hullman, J. Computational Statistics in Data Science, 2021 PDF . APA Early Career Award: The Powerful Influence of Marks: Visual and Knowledge-Driven Processing in Hurricane Track Displays. Padilla, L.., Creem-Regehr, S. H., & Thompson, W. Journal of Experimental Psychology: Applied, 2020. PDF | Data + Analysis Decision Making with Visualizations: A Cognitive Framework Across Disciplines Padilla, L., Creem-Regehr, S. H., Hegarty, M., & Stefanucci, J. K. Cognitive Research: Principles and Implications, 2018. PDF",
  "content_length": 2586,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:12"
}