{
  "name": "Laci Babai",
  "homepage": "http://people.cs.uchicago.edu/~laci",
  "status": "success",
  "content": "Laszlo Babai's Home Page Departments of Computer Science and Mathematics University of Chicago home research courses, REU CV, publications my students ToC BSM other links contact Graph Isomorphism update UPDATED January 9, 2017. Algorithm updated, quasipolynomial-time claim restored. Click here for details. Disclaimer: This paper has not been fully peer-reviewed Explore the world while this page is under construction Remember Yulia Zdanovska (2000-2022, Kharkiv, Ukraine) Remember Maryam Mirzakhani (1977-2017) Check the home page of the Computer Science Department at the University of Chicago. Check the schedule of the Combinatorics and Theoretical Computer Science Seminar of the Check out two of my favorite brainchildren: Contribute to Theory of Computing, a free online journal in theoretical computer science (free to readers and free to authors!), and see the number of citations to your work soar. Learn about Budapest Semesters in Mathematics, your passport to a career in mathematics. Check the schedule of seminars and colloquia at the University of Chicago Department of Mathematics. Visit the Toyota Technological Institute at Chicago right on the University of Chicago campus. Search the Electronic Journal of Combinatorics. Sample the The Chicago Journal of Theoretical Computer Science. Read my biography of Paul Erdös (1913-1996). Find just about anything via the links at CEOExpress. View 26 shades of orange. Where does orange begin/end? IF YOU MEAN BUSINESS, click the tabs on the left. Publications are organized by subject; my favorite papers are highlighted and annotated; most of the relatively recent ones, and even some of the older ones, are available online. My all-time favorite is a 1979 tech report that was the first paper to use group theory in graph isomorphism testing, initiated the polynomial-time theory of permutation groups, and introduced the term \"Las Vegas algorithm.\" Savor a 1990 fable about Merlin, Arthur, and the ethics of competition in mathematics in the age of instantaneous global communication: E-mail and the Unexpected Power of Interaction. Interested in fun math problems? Check my REU pages covering REUs held every summer since 2001 Ever heard combinatorics mentioned in pop culture? Listen to Dr. Radek Zelenka as he tells Colonel Sheppard about aliens' \"sub-space communication\" in the season-five episode \"First Contact\" of the TV series Stargate Atlantis.",
  "content_length": 2423,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:13"
}