{
  "name": "Ladislav Kavan",
  "homepage": "https://www.cs.utah.edu/~ladislav",
  "status": "success",
  "content": "Ladislav Kavan Ladislav Kavan Associate Professor (with tenure) e-mail: ladislav.kavan@gmail.com School of Computing 50 S. Central Campus Drive University of Utah Salt Lake City UT 84112-9205 Note I'm currently on leave at Facebook and I won't be able to assist with requests for internship, graduate studies or visiting professorship at the University of Utah. Publications Please see my Google Scholar profile for most recent publications. Papers published in 2019 and earlier are also listed here: Petr Kadlecek, Ladislav Kavan.Building accurate physics-based face models from data  Symposium on Computer Animation, 2019. Jing Li, Tiantian Liu, Ladislav Kavan.Fast Simulation of Deformable Characters with Articulated Skeletons in Projective Dynamics  Symposium on Computer Animation [Honorable Mention], 2019. Wenwu Yang, Nathan Marshak, Daniel Sykora, Srikumar Ramalingam, Ladislav Kavan.Building anatomically realistic jaw kinematics model from data  The Visual Computer, 2019. Zhenyu Shu, Xiaoyong Shen, Shiqing Xin, Qingjun Chang, Jieqing Feng, Ladislav Kavan, Ligang Liu.Scribble based 3D shape segmentation via weakly-supervised learning  IEEE Transactions on Visualization and Computer Graphics, 2019. Valentin Roussellet, Nadine Abu Rumman, Florian Canezin, Nicolas Mellado, Ladislav Kavan, Loic Barthe.Dynamic Implicit Muscles for Character Skinning  Computers and Graphics, 2018. Riddhish Bhalodia, Shireen Elhabian, Ladislav Kavan, Ross Whitaker.DeepSSM: A Deep Learning Framework for Statistical Shape Modeling from Raw Images  Shape in Medical Imaging, 2018. Junior Rojas, Tiantian Liu, Ladislav Kavan.Average Vector Field Integration for St. Venant-Kirchhoff Deformable Models  IEEE Transactions on Visualization and Computer Graphics, 2018. Dimitar Dinev, Thabo Beeler, Derek Bradley, Moritz Bacher, Hongyi Xu, Ladislav Kavan.User-Guided Lip Correction for Facial Performance Capture  Symposium on Computer Animation, 2018.Zhenyu Shu, Shiqing Xin, Xin Xu, Ligang Liu, Ladislav Kavan.Detecting 3D Points of Interest Using Multiple Features and Stacked Auto-encoder  IEEE Transactions on Visualization and Computer Graphics, 2018.Marek Dvoroznak, Saman Sepehri Nejad, Ondrej Jamriska, Alec Jacobson, Ladislav Kavan, Daniel Sykora.Seamless Reconstruction of Part-Based High-Relief Models from Hand-Drawn Images  Expressive, 2018.Dimitar Dinev, Tiantian Liu, Jing Li, Bernhard Thomaszewski, Ladislav Kavan.FEPR: Fast Energy Projection for Real-Time Simulation of Deformable Objects  ACM Transactions on Graphics 37(4) [Proceedings of SIGGRAPH], 2018.Dimitar Dinev, Tiantian Liu, Ladislav Kavan.Stabilizing Integrators for Real-Time Physics  ACM Transactions on Graphics 37(1) [Presented at SIGGRAPH], 2018.Jing Li, Tiantian Liu, Ladislav Kavan.Laplacian Damping for Projective Dynamics  VRIPHYS [Honorable Mention], 2018.David Pickup, Juncheng Liu, Xianfang Sun, Paul L. Rosin, Ralph R. Martin, Zhiquan Cheng, Zhouhui Lian, Sipin Nie, Longcun Jin, Gil Shamai, Yusuf Sahillioglu, Ladislav Kavan.An Evaluation of Canonical Forms for Non-rigid 3D Shape Retrieval  Graphical Models, 2018.Alexandru-Eugen Ichim, Petr Kadlecek, Ladislav Kavan, Mark Pauly.Phace: Physics-based Face Modeling and Animation  ACM Transactions on Graphics 36(4) [Proceedings of SIGGRAPH], 2017.Tiantian Liu, Sofien Bouaziz, Ladislav Kavan.Quasi-Newton Methods for Real-time Simulation of Hyperelastic Materials  ACM Transactions on Graphics 36(3) [Presented at SIGGRAPH], 2017.Emily Whiting, Nada Ouf, Liane Makatura, Christos Mousas, Zhenyu Shu, Ladislav Kavan.Environment-Scale Fabrication: Replicating Outdoor Climbing Experiences  CHI Conference on Human Factors in Computing Systems, 2017.Petr Kadlecek (*), Alexandru-Eugen Ichim (*), Tiantian Liu, Jaroslav Krivanek, Ladislav Kavan.Reconstructing Personalized Anatomical Models for Physics-based Body Animation  ACM Transaction on Graphics 35(6) [Proceedings of SIGGRAPH Asia], 2016.  (* joint first authors)Alexandru-Eugen Ichim, Ladislav Kavan, Merlin Nimier-David, Mark Pauly.Building and Animating User-Specific Volumetric Face Rigs  Symposium on Computer Animation, 2016.Zhenyu Shu, Shiqing Xin, Huixia Xu, Ladislav Kavan, Pengfei Wang, Ligang Liu.3D model classification via Principal Thickness Images  Computer-Aided Design, 2016.Yusuf Sahillioglu, Ladislav Kavan.Detail-preserving Mesh Unfolding for Non-rigid Shape Retrieval  ACM Transactions on Graphics 35(2) [Presented at SIGGRAPH], 2016.Tiantian Liu, Ming Gao, Lifeng Zhu, Eftychios Sifakis, Ladislav Kavan.Fast and Robust Inversion-Free Shape Manipulation  Computer Graphics Forum 35(2) [Proceedings of Eurographics], 2016.Shunsuke Saito, Zi-Ye Zhou, Ladislav Kavan.Computational Bodybuilding: Anatomically-based Modeling of Human Bodies  ACM Transaction on Graphics 34(4) [Proceedings of SIGGRAPH], 2015.Yu Wang, Alec Jacobson, Jernej Barbic, Ladislav Kavan.Linear Subspace Design for Real-Time Shape Deformation  ACM Transaction on Graphics 34(4) [Proceedings of SIGGRAPH], 2015.Yusuf Sahillioglu, Ladislav Kavan.Skuller: A Volumetric Shape Registration Algorithm for Modeling Skull Deformities  Medical Image Analysis, 2015.Lifeng Zhu, Xiaoyan Hu, Ladislav Kavan.Adaptable Anatomical Models for Realistic Bone Motion Reconstruction  Computer Graphics Forum 34(2) [Proceedings of Eurographics], 2015.Zhanpeng Huang, Ladislav Kavan, Weikai Li, Pan Hui, Guanghong Gong.Reducing Numerical Dissipation in Smoke Simulation  Graphical Models, 2015.Kenshi Takayama, Alec Jacobson, Ladislav Kavan, Olga Sorkine-Hornung.A Simple Method for Correcting Facet Orientations in Polygon Meshes Based on Ray Casting  Journal of Computer Graphics Techniques 3(4), 2014.Alec Jacobson, Zhigang Deng, Ladislav Kavan, J. P. Lewis.Skinning: Real-time Shape Deformation SIGGRAPH Course, 2014.Kenshi Takayama, Alec Jacobson, Ladislav Kavan, Olga Sorkine-Hornung.Consistently Orienting Facets in Polygon Meshes by Minimizing the Dirichlet Energy of Generalized Winding Numbers  arXiv, 2014.Sofien Bouaziz, Sebastian Martin, Tiantian Liu, Ladislav Kavan, Mark Pauly.Projective Dynamics: Fusing Constraint Projections for Fast Simulation  ACM Transaction on Graphics 33(4) [Proceedings of SIGGRAPH], 2014.Daniel Sýkora, Ladislav Kavan, Martin Čadík, Ondřej Jamriška, Alec Jacobson, Brian Whited, Maryann Simmons, Olga Sorkine-Hornung.Ink-and-Ray: Bas-Relief Meshes for Adding Global Illumination Effects to Hand-Drawn Characters  ACM Transactions on Graphics 33(2) [Presented at SIGGRAPH], 2014.Rajsekhar Setaluri, Yu Wang, Nathan Mitchell, Ladislav Kavan, Eftychios Sifakis.Fast Grid-Based Nonlinear Elasticity for 2D Deformations  Symposium on Computer Animation, 2014.Dan Gerszewski, Ladislav Kavan, Peter-Pike Sloan, Adam W. Bargteil.Basis Enrichment and Solid-fluid Coupling for Model-reduced Fluid Simulation  Computer Animation and Virtual Worlds, 2014.Yu Wang, Mubbasir Kapadia, Pengfei Huang, Ladislav Kavan, Norman Badler.Sound Localization and Multi-Modal Steering for Autonomous Virtual Agents  Symposium on Interactive 3D Graphics and Games, 2014.Tiantian Liu, Adam W. Bargteil, James F. O'Brien, Ladislav Kavan.Fast Simulation of Mass-Spring Systems  ACM Transaction on Graphics 32(6) [Proceedings of SIGGRAPH Asia], 2013.Ali Hamadi Dicko, Tiantian Liu, Benjamin Gilles, Ladislav Kavan, François Faure, Olivier Palombi, Marie-Paule Cani.Anatomy Transfer  ACM Transaction on Graphics 32(6) [Proceedings of SIGGRAPH Asia], 2013.Peter-Pike Sloan, Jason Tranchida, Hao Chen, Ladislav Kavan.Ambient Obscurance Baking on the GPU  ACM SIGGRAPH Asia Technical Briefs, 2013.Dan Gerszewski, Ladislav Kavan, Peter-Pike Sloan, Adam W. Bargteil.Enhancements to Model-reduced Fluid Simulation   ACM SIGGRAPH Motion in Games, 2013.Christian Schüller, Ladislav Kavan, Daniele Panozzo, Olga Sorkine-Hornung.Locally Injective Mappings  Computer Graphics Forum 32(5) [Symposium on Geometry Processing], 2013.Alec Jacobson, Ladislav Kavan, Olga Sorkine-Hornung.Robust Inside-Outside Segmentation using Generalized Winding Numbers  ACM Transaction on Graphics 32(4) [Proceedings of SIGGRAPH], 2013.Ladislav Kavan, Olga Sorkine.Elasticity-Inspired Deformers for Character Articulation  ACM Transactions on Graphics 31(6) [Proceedings of SIGGRAPH Asia], 2012.Alec Jacobson, Ilya Baran, Ladislav Kavan, Jovan Popović, Olga Sorkine.Fast Automatic Skinning Transformations  ACM Transaction on Graphics 31(4) [Proceedings of SIGGRAPH], 2012.Ladislav Kavan, Dan Gerszewski, Adam W. Bargteil, Peter-Pike Sloan.Physics-inspired Upsampling for Cloth Simulation in Games  ACM Transaction on Graphics 30(4) [Proceedings of SIGGRAPH], 2011.Ladislav Kavan, Adam W. Bargteil, Peter-Pike Sloan.Least Squares Vertex Baking  Computer Graphics Forum 30(4) [Proceedings of EGSR], 2011.Ladislav Kavan, Peter-Pike Sloan, Carol O'Sullivan.Fast and Efficient Skinning of Animated Meshes  Computer Graphics Forum 29(2) [Proceedings of Eurographics], 2010.Ladislav Kavan, Steven Collins, Carol O'Sullivan.Automatic Linearization of Nonlinear Skinning  Symposium on Interactive 3D Graphics and Games, 2009.Ladislav Kavan, Steven Collins, Jiří Žára, Carol O'Sullivan.Geometric Skinning with Approximate Dual Quaternion Blending  ACM Transaction on Graphics 27(4) [Presented at SIGGRAPH], 2008.Ladislav Kavan, Simon Dobbyn, Steven Collins, Jiří Žára, Carol O'Sullivan.Polypostors: 2D Polygonal Impostors for 3D Crowds  Symposium on Interactive 3D Graphics and Games, 2008.Ladislav Kavan, Steven Collins, Jiří Žára, Carol O'Sullivan.Skinning with Dual Quaternions  Symposium on Interactive 3D Graphics and Games, 2007.Ladislav Kavan, Rachel McDonnell, Simon Dobbyn, Jiří Žára, Carol O'Sullivan.Skinning Arbitrary Deformations  Symposium on Interactive 3D Graphics and Games, 2007.Ladislav Kavan, Steven Collins, Carol O'Sullivan, Jiří Žára.Dual Quaternions for Rigid Transformation Blending  Technical Report, Trinity College Dublin, 2006.Ladislav Kavan, Carol O'Sullivan, Jiří Žára.Efficient Collision Detection for Spherical Blend Skinning  Graphite (4t",
  "content_length": 10961,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:14"
}