{
  "name": "Lahcen Ouarbya",
  "homepage": "https://www.gold.ac.uk/computing/staff/l-ouarbya",
  "status": "success",
  "content": "Dr Lahcen Ouarbya | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Lecturer (Deputy Senior Tutor) Department Computing Email mas01lo (@gold.ac.uk) Website http://www.doc.gold.ac.uk/~mas01lo Publications and research outputs Book SectionFormalizing executable dynamic and forward slicing. Danicic, Sebastian ; Gyimóthy, Tibor; Harman, Mark; Kiss, Akos; Ouarbya, Lahcen ; and Binkley, Dave. 2004. Formalizing executable dynamic and forward slicing. In: UNSPECIFIED, ed. 4th International Workshop on Source Code Analysis and Manipulation (SCAM 04). , Los Alamitos, California, USA: IEEE Computer Society Press, pp. 43-52. ConSUS: A scalable approach to conditioned slicing Daoudi, Mohammed; Danicic, Sebastian ; Howroyd, John; Harman, Mark; Fox, Chris; Ouarbya, Lahcen ; and Ward, Martin. 2002. ConSUS: A scalable approach to conditioned slicing. In: UNSPECIFIED, ed. IEEE Working Conference on Reverse Engineering (WCRE 2002). Los Alamitos, California, USA: IEEE Computer Society Press, pp. 109-118. An interprocedural amorphous slicer for WSL Harman, Mark; Hu, Lin; Zhang, Xingyuan; Munro, Malcolm; Danicic, Sebastian ; Daoudi, Mohammed; and Ouarbya, Lahcen . 2002. An interprocedural amorphous slicer for WSL. In: UNSPECIFIED, ed. IEEE International Workshop on Source Code Analysis and Manipulation (SCAM 2002). Los Alamitos, California, USA: IEEE Computer Society Press, pp. 105-114. ISBN 978-0769517940 ArticleComparing Sampling Strategies for Tackling Imbalanced Data in Human Activity Recognition Alharbi, Fayez ; Ouarbya, Lahcen ; and Ward, Jamie A ORCID logo . 2022. Comparing Sampling Strategies for Tackling Imbalanced Data in Human Activity Recognition. Sensors, 22(4), 1373. ISSN 1424-8220 The use of sequential recurrent neural filters in forecasting the Dst index for the strong magnetic storm of autumn 2003 Ouarbya, Lahcen ; Mirikitani, Derrick Takeshi ; and Martin, Eamonn . 2012. The use of sequential recurrent neural filters in forecasting the Dst index for the strong magnetic storm of autumn 2003. Applied Mathematics Letters, 25(10), pp. 1361-1366. ISSN 0893-9659 Evolving Recurrent Neural Models of Geomagnetic Storms Mirikitani, Derrick T.; Tsui, Lisa; and Ouarbya, Lahcen . 2011. Evolving Recurrent Neural Models of Geomagnetic Storms. Intelligent Data Engineering and Automated Learning - IDEAL 2011, 6936, pp. 244-251. Show more information A trajectory-based strict semantics for program slicing Danicic, Sebastian ; Barraclough, Richard ; Binkley, David; Harman, Mark; Hierons, Robert; Kiss, Ákos; Laurence, Michael ; and Ouarbya, Lahcen . 2010. A trajectory-based strict semantics for program slicing. Theoretical Computer Science, 411(11-13), pp. 1372-1386. ISSN 0304-3975 A non-standard semantics for program slicing and dependence analysis Danicic, Sebastian ; Harman, Mark; Howroyd, John; and Ouarbya, Lahcen . 2007. A non-standard semantics for program slicing and dependence analysis. The Journal of Logic and Algebraic Programming, 72(2), pp. 191-206. ISSN 1567-8326 A formal relationship between program slicing and partial evaluation Binkley, Dave; Danicic, Sebastian ; Harman, Mark; Howroyd, John; and Ouarbya, Lahcen . 2006. A formal relationship between program slicing and partial evaluation. Formal Aspects of Computing, 18(2), pp. 103-119. ISSN 09345043 ConSUS: A lightweight program conditioner Danicic, Sebastian ; Daoudi, Mohammed; Fox, Chris; Harman, Mark; Hierons, Robert; Howroyd, John; Ouarbya, Lahcen ; and Ward, Martin. 2005. ConSUS: A lightweight program conditioner. Journal of Systems and Software, 77(3), pp. 241-262. ISSN 0164-1212 Syntax-directed amorphous slicing Harman, Mark; Hu, Lin; Munro, Malcolm; Zhang, Xingyuan; Wendell Binkley, David; Danicic, Sebastian ; Daoudi, Mohammed; and Ouarbya, Lahcen . 2004. Syntax-directed amorphous slicing. Automated Software Engineering, 11(1), pp. 27-61. ISSN 0928-8910 Conference or Workshop ItemEnhanced Solar Potential Analysis: Separating Terraced House Rooftops Using Convolutional Neural Networks Zhang, Kai ; and Ouarbya, Lahcen . 2024. 'Enhanced Solar Potential Analysis: Separating Terraced House Rooftops Using Convolutional Neural Networks'. In: 9th IEEE International Conference on Computational Intelligence and Applications (ICCIA 2024). Haikou, China 9-11 August 2024. On a Survival Gradient Boosting, Neural Network and Cox PH Based Approach to Predicting Dementia Diagnosis Risk on ADNI Musto, Henry ; Stamate, Daniel ; Logofatu, Doina; and Ouarbya, Lahcen . 2024. 'On a Survival Gradient Boosting, Neural Network and Cox PH Based Approach to Predicting Dementia Diagnosis Risk on ADNI'. In: 2023 IEEE International Conference on Bioinformatics and Biomedicine (BIBM). Istanbul, Turkey 5 - 8 December 2023. An investigation into computational methods for classifying fishing vessels to identify illegal, unreported and unregulated fishing activity Grey, Benedict ; Ouarbya, Lahcen ; and Blackwell, Tim . 2024. 'An investigation into computational methods for classifying fishing vessels to identify illegal, unreported and unregulated fishing activity'. In: 2023 8th International Conference on Computational Intelligence and Applications (ICCIA). Haikou, China 23-25 June 2023. Show more information Interpretable Anomaly Detection: A Hybrid Approach Using Rule-Based and Machine Learning Techniques Ouarbya, Lahcen ; and Rahul, Mohite . 2024. 'Interpretable Anomaly Detection: A Hybrid Approach Using Rule-Based and Machine Learning Techniques'. In: 2024 IEEE 9th International conference for Convergence in Technology (I2CT). Vivanta Pune, Hinjawadi, Hinjawadi Road Hinjawadi Village, Hinjawadi, Pune, India 5 - 7 April 2024. Empirical Study of Partitions Similarity Measures Alfalah, Abdlekrim ; Ouarbya, Lahcen ; and Howroyd, John . 2021. 'Empirical Study of Partitions Similarity Measures'. In: ICCAE 2021: International Conference on Clustering Algorithms and Evaluation. Dubai, United Arab Emirates 20-21 December 2021. Synthetic Sensor Data for Human Activity Recognition Alharbi, F ; Ouarbya, L ; and Ward, Jamie A ORCID logo . 2020. 'Synthetic Sensor Data for Human Activity Recognition'. In: International Joint Conference on Neural Networks (IJCNN). Glasgow, United Kingdom 19-24 July 2020. Sentiment and stock market volatility predictive modelling - A hybrid approach Olaniyan, Rapheal; Stamate, Daniel ; Ouarbya, Lahcen ; and Logofatu, Doina. 2015. 'Sentiment and stock market volatility predictive modelling - A hybrid approach'. In: 2015 IEEE International Conference on Data Science and Advanced Analytics (DSAA). Paris, France. Improving Forecasts of Geomagnetic Storms with Evolved Recurrent Neural Networks Mirikitani, Derrick T. ; Ouarbya, Lahcen ; Tsui, Lisa ; and Martin, Eamonn . 2012. 'Improving Forecasts of Geomagnetic Storms with Evolved Recurrent Neural Networks'. In: IEEE 10th International Conference on Cybernetic Intelligent Systems (CIS). London, United Kingdom 1 - 2 September 2011. Modeling Geomagnetospheric Disturbances with Sequential Bayesian Recurrent Neural Networks Ouarbya, Lahcen ; and Mirikitani, Derrick T. . 2009. 'Modeling Geomagnetospheric Disturbances with Sequential Bayesian Recurrent Neural Networks'. In: 16th International Conference on Neural Information Processing - ICONIP 2009. Bangkok, Thailand 1 - 5 December 2009. Modeling Dst with Recurrent EM Neural Networks Mirikitani, Derrick Takeshi ; and Ouarbya, Lahcen . 2009. 'Modeling Dst with Recurrent EM Neural Networks'. In: International Conference on Artificial Neural Networks - ICANN 2009. Limassol, Cyprus 14 - 17 September 2009. A Lazy Semantics for Program Slicing Danicic, Sebastian ; Harman, Mark; Howroyd, John ; and Ouarbya, Lahcen . 2004. 'A Lazy Semantics for Program Slicing'. In: 1st International Workshop on Programming Language Interference and Dependence. Verona, Italy 25 August 2004. A Denotational Interprocedural Program Slicer Ouarbya, Lahcen ; Danicic, Sebastian ; Daoudi, Mohammed ; Harman, Mark; and Fox, Chris. 2002. 'A Denotational Interprocedural Program Slicer'. In: Ninth Working Conference on Reverse Engineering, 2002 (WCRE 2002). Richmond, Virginia, United States 29 October - 1 November 2002.",
  "content_length": 8214,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:15"
}