{
  "name": "Laiwan Chan",
  "homepage": "http://www.cse.cuhk.edu.hk/~lwchan",
  "status": "success",
  "content": "Title CHAN, Lai-Wan Lauren B.A., M.A., Ph.D. (Cantab) Professor, Department of Computer Science and Engineering The Chinese University of Hong Kong, Hong Kong Contact Address [see more] Room 1016, Ho Sin Hang Engineering Building, Computer Science and Engineering Dept The Chinese University of Hong Kong Shatin, N.T. Hong Kong Tel: (+852) 3943 8434 Fax: (+852) 2603 5024 http:// www.cse.cuhk.edu.hk/~lwchan Email: lwchan cse.cuhk.edu.hk [hide this] Profile [see more] Laiwan Chan received her degrees of B.A., M.A. and Ph.D. from the Engineering Department of the Cambridge University in England. She was a recipient of the Prince Philip Scholarship and the King's College Studentship. She worked in the Speech, Vision and Robotics Group in Information Engineering led by late Professor Frank Fallside. She is a co-founder of IDEAL (The International Conference on Intelligent Data Engineering and Automated Learning), and was the Program Chair and Co-Chair of IDEAL'98 and IDEAL2000 respectively. She is a past Chairperson of the IEEE Hong Kong Section Computer Chapter, past chairperson of the governing board of the Asian-Pacific Neural Network Assembly. She was an associate editor of IEEE Transactions on Neural Networks, a member of the Editorial Board of the Neural Computing Surveys, and an external examiner to the Open University of Hong Kong. She has been program chair/committee member and organizing chair/committee member of a number of conferences and reviewer of several journals. She was the Head of the Division of Computer Science and Engineering from 1998 to 2002 and was the Associate Dean (Education) in the Faculty of Engineering from 2004 to 2013. [hide this] Research Interest [see more] Data mining, financial engineering, causal analysis, machine learning, big data analysis, bioinformatics, the modelling of artificial neural networks. The applications of neural networks and ICA in time series prediction, portfolio management, risk analysis, gene expression data analysis, image recognition. Previous research interest includes Cantonese speech recognition, constraint satisfaction problems and image database. [hide this] Publication List [see more] In chronical order By Research Areas [hide this] Teaching [see more] 2013-14, Term 1, CSCI5180 (ENGG5103) Techniques for Data Mining 2013-14, Term 2, CSCI4190 Introduction to Social Networks [hide this]",
  "content_length": 2384,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:13"
}