{
  "name": "Lajos Hanzo",
  "homepage": "https://www.ecs.soton.ac.uk/people/hanzo",
  "status": "success",
  "content": "Professor Lajos Hanzo | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor Lajos Hanzo FREng, FIEEE, FIET, EURASIP Fellow Professor of Communication Connect with Lajos Email: lh@ecs.soton.ac.uk Tel: +44 7979 441377 ORCID On this page Research Publications Biography Research Publications Biography Research Research groups Member of: Next Generation Wireless Research projects Active projects PerCom Researchers: Professor Lajos Hanzo Pervasive Wireless Intelligence Beyond The Generations Researchers: Professor Lajos Hanzo Professor Lie-Liang Yang Sponsor: EPSRC Robust and Reliable Quantum Computing Researchers: Professor Lajos Hanzo Sponsor: EPSRC Pervasive Wireless Intelligence Beyond the Generations Researchers: Professor Lajos Hanzo Sponsor: UKRI (Research England) - EU Horizon guarantee Scheme UK-India Future Networks Initiative Researchers: Professor Lajos Hanzo PlaTform DrIving The UltImAte CoNnectivity Researchers: Professor Mohammed El-Hajjar Professor Lajos Hanzo , Professor Periklis Petropoulos Sponsor: EPSRC Affine Frequency Division Multiplexing for 6G Communications and Sensing Researchers: Doctor Chao Xu Professor Lajos Hanzo , Professor Mohammed El-Hajjar Completed projects Sino British Fellowship Trust Award Researchers: Professor Lajos Hanzo Sponsor: Royal Society Optimising Resource Efficiency Researchers: Professor Lajos Hanzo Sponsor: EPSRC Dr Andreas Ahrens Royal Society short visit Researchers: Professor Lajos Hanzo Sponsor: Royal Society India-UK ATC Researchers: Professor Lajos Hanzo Sponsor: EPSRC UK China Sciense Bridges Awards Researchers: Professor Lajos Hanzo Sponsor: EPSRC India-UK advanced technology centre Researchers: Professor Lajos Hanzo Sponsor: EPSRC Cooperative backhaul aided next-generation digital subscriber loops Researchers: Professor Lajos Hanzo Sponsor: EPSRC Key Technology Research on mmWave MIMO Systems Researchers: Professor Lajos Hanzo Sponsor: Royal Society The Internet of Empowerment and Wealth-Creation Researchers: Professor Lajos Hanzo Sponsor: Royal Society UKRI-India Future networks initiative Researchers: Professor Lajos Hanzo Sponsor: EPSRC Phoenix Researchers: Professor Lajos Hanzo Sponsor: European Union QuantCom - Ubiquitous Quantum Communications Researchers: Professor Lajos Hanzo Sponsor: European Union Terabit mm-Wave Backbones for Integrated Space and Terrestrial Networks Researchers: Professor Lajos Hanzo Sponsor: Australian Research Council CONCERTO-EU FP7- Lajos Hanzo Researchers: Professor Lajos Hanzo Professor Michael Ng Sponsor: European Union MEDIAN Researchers: Professor Lajos Hanzo Sponsor: European Union BEAM-ME-UP - ERC Advanced - L Hanzo Researchers: Professor Lajos Hanzo Sponsor: European Union OPTIMIX Researchers: Professor Lajos Hanzo Sponsor: European Union Nexway Researchers: Professor Lajos Hanzo Sponsor: European Union H2020 MSCA IF 2017 L Hanzo - WPCN Researchers: Professor Lajos Hanzo Sponsor: European Union Key Signal Processing Technologies for 5G Milllimeter-Wave Massive MIMO with Lens Antenna Researchers: Professor Lajos Hanzo Sponsor: Royal Academy of Engineering SCOUT Researchers: Professor Lajos Hanzo Sponsor: European Union NEWCOM Researchers: Professor Lajos Hanzo Professor Lie-Liang Yang , Professor Sheng Chen Sponsor: European Union Low-cost Sensing Methods and Hybrid Learning Models - DP220101634 Researchers: Professor Lajos Hanzo Converged Optical & Wireless Access Networks (COALESCE) Researchers: Professor Periklis Petropoulos Professor Lajos Hanzo Sponsor: EPSRC New Air Interface Techniques for Future Massive Machine-Type Communications Researchers: Professor Lie-Liang Yang Professor Lajos Hanzo Sponsor: EPSRC Channel Decoder Architectures Researchers: Professor Rob Maunder Professor Sir Bashir Al-Hashimi , Professor Lajos Hanzo Sponsor: EPSRC Highly-parallel algorithms and arhitectures for high-throughput wireless receivers Researchers: Professor Rob Maunder Professor Sir Bashir Al-Hashimi , Professor Lajos Hanzo Sponsor: EPSRC Cooperative Classical and Quantum Communications Systems Researchers: Professor Michael Ng Professor Lajos Hanzo Sponsor: EPSRC Savana Researchers: Professor Rob Maunder Professor Lajos Hanzo Sponsor: Thales Publications Bayesian learning aided parameter estimation and joint beamformer design in mmWave MIMO-OFDM ISAC Systems Awadhesh Gupta, Jitendra Singh, Suraj Srivastava, Aditya K. Jagannatham & Lajos Hanzo, 2025, IEEE Transactions on Communications, 73(11), 12518-12532 DOI: 10.1109/TCOMM.2025.3578813 Type: article Iterative Soft-MMSE Detection Aided AFDM and OTFS Hugo Hawkins, Chao Xu, Lie-Liang Yang & Lajos Hanzo, 2025, IEEE Open Journal of Vehicular Technology, 6, 2944-2959 DOI: 10.1109/OJVT.2025.3623883 Type: article 1Q: first-generation wireless systems integrating classical and quantum communication Petar Popovski, Cedomir Stefanovic, Beatriz Soret, Israel Leyva-Mayorga, Shashi Raj Pandey, René B. Christensen, Jakob K. Søndergaard, Kristian S. Jensen, Thomas G. Pedersen, Angela Sara Cacciapuoti & Lajos Hanzo, 2025, IEEE Vehicular Technology Magazine, 2-17 DOI: 10.1109/MVT.2025.3622826 Type: article Two-tier frequency-domain equalization for ultra-wideband integrated sensing and communication Chao Xu, Jack Bedwell, Russel N. Torah, Stephen Wang, Shinya Sugiura, Robert G. Maunder, Lie-Liang Yang, Haas Harald & Lajos Hanzo, 2025, IEEE Transactions on Vehicular Technology DOI: 10.1109/TVT.2025.3619869 Type: article Holographic multi-user multi-stream beamforming maintaining rate-fairness W. Zhu, H.D. Tuan, E. Dutkiewicz, H.V. Poor & L. Hanzo, 2025, IEEE Transactions on Wireless Communications DOI: 10.1109/TWC.2025.3613416 Type: article Generalized spatial modulation aided affine frequency division multiplexing Zeping Sui, Zilong Liu, Leila Musavian, Lie-Liang Yang & Lajos Hanzo, 2025, IEEE Transactions on Wireless Communications DOI: 10.1109/TWC.2025.3613062 Type: article Graph neural networks for next-generation-IoT: recent advances and open challenges Nguyen Xuan Tung , Le Tung Giang, Bui Duc Son, Seon Geun-Jeong, Trinh Van Chien, Lajos Hanzo & Won Joo Hwang, 2025, IEEE Communications Surveys & Tutorials DOI: 10.1109/COMST.2025.3613845 Type: article Performance analysis of FAS-aided NOMA-ISAC: a backscattering scenario Farshad Rostami Ghadi, Kai-Kit Wong, F. Javier López-Martínez, Hyundong Shin & Lajos Hanzo, 2025, IEEE Internet of Things Journal DOI: 10.1109/JIOT.2025.3612478 Type: article Optimal hybrid transmit beamforming for mm-wave integrated sensing and communication Jitendra Singh, Banda Naveen, Suraj Srivastava, Aditya K. Jagannatham & Lajos Hanzo, 2025, IEEE Transactions on Communications DOI: 10.1109/TCOMM.2025.3610165 Type: article Adaptive FTN signaling over rapidly-fading channels Mingfei Tong, Xiaojing Huang, J. Andrew Zhang & Lajos Hanzo, 2025, IEEE Transactions on Communications, 73(9), 7166-7178 DOI: 10.1109/TCOMM.2025.3545655 Type: article Biography Lajos Hanzo (Mobile speech and data communications - Prof. Lajos Hanzo, Lajos Hanzo - Wikipedia) (FIEEE'04) received his Master degree and Doctorate in 1976 and 1983, respectively from the Technical University (TU) of Budapest. He was also awarded the Doctor of Sciences (DSc) degree by the University of Southampton (2004) and Honorary Doctorates by the TU of Budapest (2009) and by the University of Edi",
  "content_length": 31719,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:16"
}