{
  "name": "Lakshmi Subramanian",
  "homepage": "https://cs.nyu.edu/~lakshmi/Lakshmi/Home.html",
  "status": "success",
  "content": "Lakshmi Subramanian Lakshminarayanan Subramanian Professor Computer Science, Courant Institute of Mathematical Sciences Population Health, NYU Grossman School of Medicine Affiliate Faculty, Dept of Technology, Operations and Statistics, NYU Stern School of Business Toggle navigation Menu Home Papers All Publications Teaching Research Groups Open Networks and Big Data Lab NYU Systems Bio Lakshminarayanan Subramanian is a Professor of Computer Science in the Courant Institute of Mathematical Sciences at NYU. He is also a joint faculty in the Department of Population Health department, NYU Grossman School of Medicine and is an affiliate faculty in the Department of Technology, Operations and Statistics, NYU Stern School of Business. His research interests are in the areas of networked systems, machine learning and AI/ML for health, sustainability and socio-economic development. He leads the Open Networks and Big Data Lab and is a member of the NYU Systems group. He is associated with the Center for Technology and Economic Development, Center for Data Science and NYU WIRELESS. He is a Co-founder and Chief Scientist at Entrupy Inc, that uses machine vision algorithms and microscopy to authenticate physical goods and enable trustworthy commerce. He is the Co-Founder of Gaius Networks, that powers Flipped.ai, an AI driven marketplace for hiring and upskilling talent. He is also the Co-Founder of Vel.ai, a startup that focuses on Shock Resilient AI to make enterprises resilient to economic, political and natural shocks. Research group: Open Networks and Big Data Lab People: Ankit Bhardwaj (Ph.D. student), Ramakrishnan K (Ph.D. student) Alumni (PhDs, Postdocs, MS, Undergrads): Open Networks and Big Data Lab Alumni Research Networked Systems 5G and Cellular: MDI [CCR '21], ECN prediction [Mobicom mmnets ’19], ALCC [JSYS '22], Verus [SIGCOMM ’15] Mobile Web: QLUE [WWW '22], SlimWeb [ICTD '22], JSCleaner [WWW '20], GAIUS [ICTD ’19], GreenApps [COMPASS ’18], xCache [ICTD '17] Privacy and Contextual Integrity: VACCINE [WWW ’19], RECIPE [ACL MRQA ’18], Privacy Norms [HCOMP ’16] Machine Learning Fairness and Interpretability: Pareto Fairness [ICML AI4SG '19] Causal Inference: Predictive Causal Graphs [EMNLP '19], Causal Faithful Embeddings [ACL '21] Mixture Estimation: Non-Parametric Choice Models [MS '19], Customer Segmentation [OR '18] Crowds: Adversarial Inference [JMLR '18, NeurIPS '14] AI for Health Health Recommendations: Domain-Specific Concordance [WSDM '21], DICE [JAMIA '21] AI and Global Health: MERS [COMPASS '19], Dengue Outbreak Prediction [Science Advances '16], Opioid Addiction [Frontiers in AI '21], COVID-19 [JAMA '20] ML for Bioinformatics: Sepsis [Briefings in Bio '19], GWAS [ICML WCB '18] AI for Sustainability Socio-economic Inference: Targeted Policy Recommendation [COMPASS '22], Famine Forecasting [IC2S2 '21], News Analytics [KDD '16] Road Traffic: Prediction and Forecasting [ICASSP '20, KDD UMCit '18], Signal Control [DEV '12] Urban Air Quality: Air Quality Prediction from Images [IJCAI-ECAI '22] 60, 5th Ave, Room 416 New York, NY 10011 Phone: (212) 998-3485 Fax: (212) 995-4123 Email: lakshmi,cs,nyu,edu",
  "content_length": 3165,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:15"
}