{
  "name": "Lamberto Ballan",
  "homepage": "https://www.math.unipd.it/~ballan",
  "status": "success",
  "content": "Lamberto Ballan, Ph.D. Entries RSS | Comments RSS Lamberto Ballan, Ph.D.Associate Professor of Computer Science at University of Padova, Italy Home Research Exploiting semAntic and social knowledGe for visuaL rEcognition Tag refinement and localization in web videos A Context-Dependent Kernel for Logo Recognition A SIFT-based method for copy-move forgery detection Human action categorization in unconstrained videos Logo detection and recognition in sports videos Publications Activities Teaching Students About Me Comments Off on About Me By lambertoballan, November 3, 2021 I am an Associate Professor of computer science in the Dept of Mathematics “Tullio Levi-Civita” at the University of Padova, Italy, where I lead the Visual Intelligence and Machine Perception (VIMP) group. I am also affiliated faculty at the Human Inspired Technology Research Centre, and am an ELLIS member since 2021. Previously, I was a postdoctoral researcher in the AI Lab at Stanford University – working with L. Fei-Fei and S. Savarese – supported by a prestigious Marie Curie Fellowship from the European Commission. I received my Laurea (M.S.) and Ph.D. degrees in computer engineering in 2006 and 2011, both from the Univ. of Florence (Italy), advised by A. Del Bimbo. I also spent time at Telecom ParisTech (France) in 2010. My primary research area is computer vision, closely integrated with (deep) machine learning and multimedia. The main focus of my current research is on designing learning algorithms that make the most effective use of contextual knowledge in presence of sparse and noisy data. Research Group / UniPD Profile / CV / ORCID / DBLP / Google Scholar aboutme Visual Intelligence and Machine Perception (VIMP) group Comments Off on Visual Intelligence and Machine Perception (VIMP) group By lambertoballan, February 5, 2019 Finally we are online! Check the website of my group at the University of Padova. We conduct research in computer vision, applied machine (deep) learning, NLP and multimedia. We aim at developing artificially intelligent systems to help computers perform visual perception and recognition tasks. news, research Under the hood of Big Data and Artificial Intelligence Comments Off on Under the hood of Big Data and Artificial Intelligence By lambertoballan, November 12, 2018 I recently gave a talk at “The Law of Big Data” seminar series @UniPD (you can watch the video on YouTube). How AI and big data are affecting our society, culture and laws? Many are claiming that data is the “new oil”, and the data-driven / machine-learning paradigm is changing how we address many different problems. Self-driving cars, robot caregivers and chatbot platforms are really happening, while they were only popular sci-fi topics until a few years ago. The aim of this lecture is to introduce the key concepts that have led to these results, to highlight what are the main challenges and open problems, thus trying to unveil what’s in the box. news, outreach, talk, teaching Teaching machines to see: a quest to visual intelligence Comments Off on Teaching machines to see: a quest to visual intelligence By lambertoballan, May 8, 2018 I recently gave a talk on “Teaching machines to see: a quest to visual intelligence” at the “Math&CS Pride” open-day outreach event organized by the Dept of Mathematics “Tullio Levi-Civita”, for undergrad and high school students. It was super fun (at least for me :), and this are the slides of the talk. news, outreach, talk New class on cognitive computing, applied machine learning and vision Comments Off on New class on cognitive computing, applied machine learning and vision By lambertoballan, February 22, 2018 This semester, together with Alessandro Sperduti, we are teaching a new course on cognitive computing, applied machine learning and computer vision. This new class is motivated by the recent revolution of cloud-enabled artificial intelligence services. We will give an introductory overview of deep learning, the main fields of application of machine learning and representation learning, with a particular emphasis on visual recognition problems. The class is offered to master students in computer science and data science, but it is also open to others (e.g. undergrads in CS or students from the school of engineering). More info: course webpage @UniPD, course presentation. news, teaching Deep Learning, Pattern Recognition and Vision, which direction? Comments Off on Deep Learning, Pattern Recognition and Vision, which direction? By lambertoballan, January 29, 2018 I have been invited to contribute to the panel “Deep Learning, Pattern Recognition and Vision, which direction?” during the CVPL day in Modena, Italy, on “Why is Deep Learning so cool?” [slides available online]. The event has been opened by Naftali Tishby with a very interesting talk about “Information Theory of Deep Learning”. A similar talk is also available on YouTube. news, research, talk European Researchers’ Night: “Science is wonder-ful!” Comments Off on European Researchers’ Night: “Science is wonder-ful!” By lambertoballan, September 29, 2017 This 26 and 27 September 2017, I was involved in the kickoff event for European Researchers’ Night in Brussels #MSCAnight. With thousands of visitors, most of which were children, it was a smashing success! I have presented my research on machine learning and visual perception, and talked about visual illusions and teaching computers to see. More about the event: https://goo.gl/QNkxgY, more about my work and some nice pictures. news, outreach Aloha CVPR’17: I will be giving two talks on July 26 Comments Off on Aloha CVPR’17: I will be giving two talks on July 26 By lambertoballan, July 22, 2017 CVPR is growing exponentially. This year in the beautiful Honolulu there are approx. 5K attendees. First, I will present our paper on “Localization of JPEG double compression through multi-domain convolutional neural networks” (Amerini, Uricchio, Ballan, Caldelli) at the CVPR’17 Workshop on Media Forensics. Then, I will give a keynote talk on “Exploiting noisy web data for large-scale visual recognition” at the CVPR’17 Workshop on Visual Understanding by Learning from Web Data [slides available online]. news, research, talk New papers on image tagging and webly-supervised action recognition Comments Off on New papers on image tagging and webly-supervised action recognition By lambertoballan, July 21, 2017 Our paper “Automatic Image Annotation via Label Transfer in the Semantic Space”, by T. Uricchio, myself, L. Seidenari and A. Del Bimbo, has been accepted for publication in Pattern Recognition and is now available online. It is an extended version of our KCCA-based tag propagation model presented in our ICMR’14 paper, containing more experiments and a novel tag denoising procedure. A few days later, our paper “Learning without Prejudice: Avoiding Bias in Webly-Supervised Action Recognition” has been also accepted for publication in Computer Vision and Image Understanding (CVIU) and is now available online. Here we present a (fully) webly-supervised model for action recognition in videos. This is a joint work with F. Tombari and C. Rupprecht from TUM (Germany). news, papers I will be joining the University of Padova! Comments Off on I will be joining the University of Padova! By lambertoballan, February 3, 2017 Happy to share that I will join the Math & CS Department of the University of Padova as an Assistant Professor (tenure track) of Computer Science, starting in Fall 2017. The University of Padova is one of Europe’s oldest and most prestigious seats of learning. The University of Padova is ranked first among Italian universities according to most international rankings (ARWU, US-News) and research evaluation agencies (ANVUR) [UniPD at a glance]. Universa Universis Patavina Libertas. aboutme, news « Older 2017- 2014-16 2007-17 2014-17 Address/Contact Info DM – University of Padova Via Trieste 63 (Room 622, 6CD) 35121 Padova PD, Italy Phone: +39 049 827 1332 E-Mail: lamberto.ballan@unipd.it Links ELLIS Stanford AI Lab UniPD – HIT Research Centre UniPD – VIMP group Tweets Tweets by @lambertoballan Follow @lambertoballan Lamberto Ballan, Ph.D. is powered by WordPress Panorama Theme by Themocracy",
  "content_length": 8251,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:19"
}