{
  "name": "Lambros Lambrinos",
  "homepage": "https://www.cut.ac.cy/faculties/comm/cis/staff/lambros.lambrinos/?languageId=1",
  "status": "success",
  "content": "CYPRUS UNIVERSITY OF TECHNOLOGY ΕΛ EN 20 Years CUT myUni Library Faculties Faculty of Communication and Media Studies Department of Communication and Internet Studies Staff Lambros Lambrinos Faculties Faculty of Communication and Media Studies Department of Communication and Internet Studies Staff Lambros Lambrinos Lambros Lambrinos Associate Professor Department of Communication and Internet Studies lambros.lambrinos@cut.ac.cy 2500 2570, 2500 2631 Bio Publications Teaching Posts Bio Publications Teaching Posts Bio Lampros Lamprinos is a Αssistant Professor in New Communication Technologies and the Internet. He received a PhD in Computer Science from University College London and also holds a BSc in Computer Engineering from the University of Manchester. His past teaching experience includes visiting lectureships at UK universities and the University of Cyprus. He has participated in several large-scale research projects funded by the European Commission in the area of real-time multimedia communication over the Internet and served on scientific conference committees. Research work generally falls in the area of computer networks.Dr. Lambrinos is the Principal Investigator of the research program \"e-park\" (www.e-park.eu).For more detailed information on current research activities please visit the Ubiquitous Computing and Smart Living lab web page. Research InterestsDelay tolerant networkingInternet of Things and Smart CitiesReal-time multimedia conferencing over the InternetScaleable audio-video streaming architecturesVoice-over-IP over wireless networksTelematicsUtilisation of various communication technologies in telemedicineIPv6 deployment issues Publications L.Lambrinos, A.Dosis and V.Trigka, “Applying mobile and Internet of Things technologies in managing parking spaces for people with disabilities”, in ACM International Conference on Pervasive and Ubiquitous Computing (Ubicomp), Zurich, Switzerland, September 2013L.Lambrinos and K.Bechara, “Integrating modern mobile devices in emergency event reporting and notification” in Sociable Smart City Workshop, Athens, Greece, July 2013L.Lambrinos, P.Kolios and C.Djouvas, “Dimensioning VoIP capacity in maritime networks” in IEEE Conference on Communications (ICC), Budapest, Hungary, June 2013E.Polycarpou, L.Lambrinos and E.Protopapadakis, “Smart parking solutions for urban areas”, in WoWMoM workshop on Smart Cities and Ubiquitous Computing Applications (SCUCA), Madrid, Spain, June 2013L.Lambrinos, C.Djouvas and C.Chrysostomou, “Applying delay tolerant networking routing algorithms in maritime communications” in WoWMoM workshop on Autonimic and Opportunistic Communications (AOC), Madrid, Spain, June 2013N.Doulamis, E.Protopapadakis and L.Lambrinos, \"Improving Service Quality for Parking Lot Users using Intelligent Parking Reservation Policies\", in proc. of Pervasive Internet of Things and Smart Cities workshop (PITSAC), AINA Conference, Barcelona, March 2013P.Kolios and L.Lambrinos, \"Optimising file delivery in a maritime environment through inter-vessel connectivity predictions\", in proc. Special Topics in Wireless and Mobile Computing (STWiMob), Barcelona, Spain, Oct 2012C. Chrysostomou, C. Djiouvas and L.Lambrinos, \"Dynamically adjusting the min-max contetion window for providing quality of service in vehicular networks\", 11th Mediterranean Ad-hoc Networking Workshop (MedHocNet), Cyprus, June 2012F. Vannieuwenborg, Z.Kirtava, L.Lambrinos, J.V.Ooteghem and S.Verbrugge, “Implications of mHealth Service Deployments: A Comparison between Dissimilar European Countries” , Telecommunication Economics, Lecture Notes in Computer Science, Volume 7216, pp. 56-66, Springer, 2012Lambros Lambrinos, “On the Provision of Advanced Telecommunication Services in Rural Areas”, Telecommunication Economics, Lecture Notes in Computer Science, Volume 7216, pp. 209-215, Springer, 2012L. Lambrinos and C. Djouvas, “Creating a Maritime Wireless Mesh Infrastructure for Real-Time Applications”, IEEE Globecom Workshop on Mobile Computing and Emerging Communication Networks, Houston, USA, Dec. 2011 C.Djouvas L.Lambrinos and C.Chrysostomou, “A delay tolerant platform for voice message delivery\" 14th Wireless Personal Multimedia Communications Symposium (WPMC), Brest France, Oct 2011D.Karakasilis, F.Georgatos, L.Lambrinos and T.Alexopoulos, “Application of Live Video Streaming over GRID and Cloud Infrastructures”, 11th IEEE Conference on Computer and Information Technology (CIT), Paphos, Cyprus, August 2011L.Lambrinos and C.Djouvas, \"Improving Quality of Experience in wireless VoIP through novel call scheduling\", Special Issue on \"Mobile Computing and Networking Technologies\", Telecommunication Systems Journal, pp. 1-12, Springer, 2011C.Chrysostomou, L.Lambrinos and C.Djouvas, \"The Need for a System Design Methodology to Address Challenges in Wireless Access in Vehicular Ad Hoc Networks\", IEEE International Conference on Telecommunications (ICUMT 2010), Moscow, Russia, October 18-20, 2010L.Lambrinos and C.Djouvas, \"Using Location Information for Sophisticated Emergency Call Management\", in International ICST Conference on Wireless Mobile Communication and Healthcare, Mobihealth 2010, Ayia Napa Cyprus, October 18-20 2010L.Lambrinos and E.Demetriou, \"An adaptive live media streaming architecture\", 2nd International IEEE Conference on Advances in Multimedia (MMEDIA 2010), Athens, Greece, June 2010Naveen Chilamkurti, Lambros Lambrinos, Aftab Ahmad, Guest Editorial of the Special Issue on Human Centric Communications, International Journal on Semantic Computing (IJSC), September 2009L.Lambrinos and C.Djouvas. \"Applying scheduling policies to improve quality of experience in Voice over IP\", in IEEE International Performance Computing and Communications Conference (IPCCC), Phoenix, AZ, 2009J.Scholl, L.Lambrinos and A.Lindgren, \"Rural Telemedicine Networks using Store-and-forward VoIP and DTN\", in Medical Informatics Europe (MIE2009), Sarajevo, Serbia, August 2009L.Lambrinos and N.Tsapatsoulis, \"The impact of new technologies on Media Creation and Distribution\", in International Conference on New Media and Information, Athens, Greece, May 2009Lambrinos, L., Georgatos, F. (2008) ‘A case for multimedia streaming over the Grid Infrastructure’, Proceedings of International Week on Management of Networks and Services (MANWEEK 2008), Samos, Greece, SeptemberLambrinos, L. (2008) ‘Deploying Open-Source IP telephony in Rural Environments’,Proceedings of the 2nd International IEEE Conference on Next Generation Mobile Applications, Services and Technologies (NGMAST 2008), Cardiff, UK, September 2008L.Lambrinos and P.Kirstein, \"Integrating Voice over IP Services in IPv4 and IPv6 Networks\", in International IEEE Multi-Conference on Computing in the Global Information Technology (ICCGI'07), Gouadeloupe, March 2007. Teaching CIS 132 Introduction to Internet StudiesCIS 135 Introduction to Computer ApplicationsCIS 300 Object oriented programmingCIS 303 Programming Internet applications Posts 2011-PresentAssistant Professor, New Communication Media and the Internet, Department of Communication and Internet Studies, Cyprus University of Technology.2007–2011Lecturer, New Communication Media and the Internet, Department of Communication and Internet Studies, Cyprus University of Technology.2004–2006Visiting Lecturer, Department of Computer Science, University of Cyprus Lambros Lambrinos Τεχνολογικό Πανεπιστήμιο Κύπρου Associate Professor Undefined Κύπρος lambros.lambrinos@cut.ac.cy 2500 2570, 2500 2631 STAFF SEARCH Academic Staff Administrative Staff Maps University Map Sitemap Virtual Tour Quick Links Student Login eLearning (Moodle) CUT Mail (students and staff on Office365) Password Reset Multi Factor Authentication (MFA) Απομακρυσμένη Πρόσβαση (VPN) cut-radio Intent Europe Direct green@cut Learning Development Network Personal Data Protection Policy Intranet Useful Videos Contact Details ΤΕΧΝΟΛΟΓΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΥΠΡΟΥ 30 Arch. Kyprianos Str. 3036 Limassol 2500 2500 2500 2750 administration@cut.ac.cy Copyright © 2025 CYPRUS UNIVERSITY OF TECHNOLOGY Contact About this website Cookie Policy Digital Logo Files Contact About this website Cookie Policy Digital Logo Files Copyright © 2025 CYPRUS UNIVERSITY OF TECHNOLOGY × Βοηθήστε μας να γίνουμε καλύτεροι! Ποιος ο σκοπός της επίσκεψης σας στο διαδικτυακό μας χώρο;  Ενδιαφέρον για προγράμματα σπουδών Ενδιαφέρον για ερευνητικά προγράμματα Ενδιαφέρον για εκδηλώσεις/ανακοινώσεις Ενδιαφέρον για θέσεις εργασίας Γενικό ενδιαφέρον για το Πανεπιστήμιο Ποια η ιδιότητα σας;  Υποψήφιος φοιτητής Υφιστάμενος φοιτητής Πανεπιστημιακό μέλος ΤΠΚ Πιθανός εξωτερικός συνεργάτης Επισκέπτης γενικού ενδιαφέροντος Ποιο το επίπεδο μόρφωσης σας;  Απόφοιτος Λυκείου Απόφοιτος Πανεπιστημίου/Κολλεγίου Μεταπτυχιακό Διδακτορικό Ποια η εργασιακή σας κατάσταση;  Μαθητής Φοιτητής Άνεργος Δημόσιος Υπάλληλος Ιδιωτικός Υπάλληλος Ποια η ηλικία σας;  15-18 19-25 26-30 30- Ευχαριστούμε για τα σχόλια σας! Ref. 1764567917380 SUBMIT Our website uses cookies Our website uses cookies to ensure its proper functionality, as described here. Agree Required cookies Analytics cookies Disagree Required cookies Analytics cookies Boηθήστε μας να γίνουμε καλύτεροι!",
  "content_length": 9226,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:17"
}