{
  "name": "Lan Wang",
  "homepage": "https://www.memphis.edu/cs/people/faculty_pages/lan-wang.php",
  "status": "success",
  "content": "Lan Wang - Computer Science - The University of Memphis Skip to main content SearchX Safety & Security Prospective Students Current Students Parents & Family Alumni Veterans Faculty & Staff People Take Action Follow Us Online FacebookLinkedIn Home Computer Science People Faculty Pages Lan Wang Lan Wang Faudree University Professor Phone 901.678.1643 Email lanwang@memphis.edu Fax 901.678.1506 Office Dunn Hall 133 Office Hours Call for hours Degree: PhD, Computer Science, University of California, Los Angeles, 2004 Research Interests:Internet architecture, network security, wireless sensor networks Personal Website:http://www.cs.memphis.edu/~lanwang/ Google Scholar Dr. Wang joined the Department in Fall 2004 after finishing her PhD at UCLA. She was promoted to Associate Professor in 2010 and to Full Professor in 2016. She served as the department chair from Feb. 2016 to Aug. 2023. Her research focuses on improving the scalability, reliability, and security of the Internet. She has received multiple major research grants from NSF, NIST, and DoD as well as several grants from the university. Most recently, she is on a team that received over $15 million from NSF for their \"Named Data Networking\" project. At the University of Memphis, Dr. Wang has taught a variety of courses including Networking and Information Assurance, Advanced Computer Networks, Wireless and Mobile Computing, Models of Computation, Web Services and the Internet, and Data Structures. As an active member of the research community, she has served on the program committee of more than 50 conferences and workshops. She is also interested in promoting female participation in computer science, co-organizing a \"Networking Networking Women\" panel at ACM SIGCOMM 2008 and an N2Women dinner at ACM SIGCOMM 2019. She started and has been advising the Women in Computing student chapter at the university. Dr. Wang is an IEEE Senior Member.  She received the Early Career Research Award from the College of Arts and Sciences (2010), Alumni Association Distinguished Research Award in Science, Engineering, and Mathematics (2019), Dunavant Profesship (2021), and Willard R. Sparks Eminent Faculty Award (2022) from the University of Memphis.",
  "content_length": 2222,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:19"
}