{
  "name": "Lane P. Hughston",
  "homepage": "https://www.gold.ac.uk/computing/people/hughston-lane",
  "status": "success",
  "content": "Lane Palmer Hughston | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Professor of Mathematics Department Computing Email l.hughston (@gold.ac.uk) Lane is a mathematician who works on quantum informatics and mathematical finance. Lane Hughston is Professor of Mathematics in the Department of Computing at Goldsmiths. His doctorate from the University of Oxford. He has carried out work in general relativity, cosmology, quantum mechanics, statistical mechanics, and a number of different areas of mathematical finance, including interest rates, foreign exchange, inflation, and asset pricing. Lane is a member of the London Mathematical Society, the European Mathematical Society, the American Finance Association, the American Physical Society, and the Society for Industrial and Applied Mathematics (SIAM). He is a Fellow of the Institute of Mathematics and its Applications, and is a lifetime member of the American Mathematical Society, the Bachelier Finance Society, and the International Society on General Relativity and Gravitation. Portrait by Helen Hulsey Research interests Mathematical physics and mathematical finance Publications and research outputs ArticleDecoherence Implies Information Gain Brody, D C; and Hughston, L P ORCID logo . 2025. Decoherence Implies Information Gain. Physical Review Research, 7, L012040. ISSN 2643-1564 Brief Synopsis of the Scientific Career of T. R. Hurd Grasselli, M R; and Hughston, L P . 2024. Brief Synopsis of the Scientific Career of T. R. Hurd. International Journal of Theoretical and Applied Finance, 27(3,4), 2430001. ISSN 0219-0249 Valuation of a Financial Claim Contingent on the Outcome of a Quantum Measurement Hughston, L P ; and Sánchez-Betancourt, L. 2024. Valuation of a Financial Claim Contingent on the Outcome of a Quantum Measurement. Journal of Physics A: Mathematical and Theoretical, 57(28), 285302. ISSN 1751-8113 Show more information Information-Based Trading Bouzianis, G ; Hughston, L P ; and Sánchez-Betancourt, L. 2024. Information-Based Trading. International Journal of Theoretical and Applied Finance, 27(3,4), 2350030. ISSN 0219-0249 Mathematical Foundations of Complex Tonality Boland, J R; and Hughston, L P . 2024. Mathematical Foundations of Complex Tonality. Journal of Mathematics and Music, 18(2), pp. 173-202. ISSN 1745-9737 Lévy Models for Collapse of the Wave Function Brody, D CORCID logo; and Hughston, L P ORCID logo . 2023. Lévy Models for Collapse of the Wave Function. Journal of Physics A: Mathematical and Theoretical, 56, 125303. ISSN 1751-8113 Quantum Measurement of Space-Time Events Brody, D C; and Hughston, L P . 2021. Quantum Measurement of Space-Time Events. Journal of Physics A: Mathematical and Theoretical, 54(23), 235304. ISSN 1751-8113 Lévy-Ito Models in Finance Bouzianis, G ; Hughston, L P ; Jaimungal, S; and Sánchez-Betancourt, L. 2021. Lévy-Ito Models in Finance. Probability Surveys, 18, pp. 132-178. ISSN 1549-5787 Pricing with Variance Gamma Information Hughston, L P ; and Sánchez-Betancourt, L. 2020. Pricing with Variance Gamma Information. Risks, 8(4), 105. ISSN 2227-9091 Theory of Cryptocurrency Interest Rates Brody, D C; Hughston, L P ; and Meister, B. 2020. Theory of Cryptocurrency Interest Rates. SIAM Journal for Financial Mathematics, 11(1), pp. 148-168. ISSN 1945-497X Optimal Hedging in Incomplete Markets Bouzianis, G ; and Hughston, L P . 2020. Optimal Hedging in Incomplete Markets. Applied Mathematical Finance, 27(4), pp. 265-287. ISSN 1350-486X Determination of the Lévy Exponent in Asset Pricing Models Bouzianis, G ; and Hughston, L P . 2019. Determination of the Lévy Exponent in Asset Pricing Models. International Journal of Theoretical and Applied Finance, 22(1), 1950008. ISSN 0219-0249 Lévy-Vasicek Models and the Long-Bond Return Process Brody, D C; Hughston, L P ; and Meier, D M. 2018. Lévy-Vasicek Models and the Long-Bond Return Process. International Journal of Theoretical and Applied Finance, 21(3), 1850026. ISSN 0219-0249 Social Discounting and the Long Rate of Interest Brody, D C; and Hughston, L P . 2018. Social Discounting and the Long Rate of Interest. Mathematical Finance, 28(1), pp. 306-334. ISSN 0960-1627 Thermodynamics of Quantum Heat Bath Brody, D C; and Hughston, L P . 2016. Thermodynamics of Quantum Heat Bath. Journal of Physics A: Mathematical and Theoretical, 49(42), 425302. ISSN 1751-8113 Surveying Points in the Complex Projective Plane Hughston, L P ; and Salamon, S M. 2016. Surveying Points in the Complex Projective Plane. Advances in Mathematics, 286, pp. 1017-1052. ISSN 0001-8708 Fragile Entanglement Statistics Brody, D C; Hughston, L P ; and Meier, D M. 2015. Fragile Entanglement Statistics. Journal of Physics A: Mathematical and Theoretical, 48(42), 425301. ISSN 1751-8113 Universal Quantum Measurements Brody, D C; and Hughston, L P . 2015. Universal Quantum Measurements. Journal of Physics: Conference Series, 624, 012002. ISSN 1742-6588 Lévy Information and the Aggregation of Risk Aversion Brody, D C; and Hughston, L P . 2013. Lévy Information and the Aggregation of Risk Aversion. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences, 469(2154), 20130024. ISSN 1364-5021 Signal Processing with Lévy Information Brody, D C; Hughston, L P ; and Yang, X. 2013. Signal Processing with Lévy Information. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences, 469(2149), 20120433. ISSN 1364-5021 General Theory of Geometric Lévy Models for Dynamic Asset Pricing Brody, D C; Hughston, L P ; and Mackie, E. 2012. General Theory of Geometric Lévy Models for Dynamic Asset Pricing. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences, 468(2142), pp. 1778-1798. ISSN 1364-5021 Rational Term Structure Models with Geometric Lévy Martingales Brody, D C; Hughston, L P ; and Mackie, E. 2012. Rational Term Structure Models with Geometric Lévy Martingales. Stochastics, 84(5-6), pp. 719-740. ISSN 1744-2508 Conditional Density Models for Asset Pricing Filipović, D; Hughston, L P ; and Macrina, A. 2012. Conditional Density Models for Asset Pricing. International Journal of Theoretical and Applied Finance, 15(1), 1250002. ISSN 0219-0249 Pricing Fixed-Income Securities in an Information-Based Framework Hughston, L P ; and Macrina, A. 2012. Pricing Fixed-Income Securities in an Information-Based Framework. Applied Mathematical Finance, 19(4), pp. 361-379. ISSN 1350-486X Lévy Random Bridges and the Modelling of Financial Information Hoyle, E; Hughston, L P ; and Macrina, A. 2011. Lévy Random Bridges and the Modelling of Financial Information. Stochastic Processes and their Applications, 121(4), pp. 856-884. ISSN 0304-4149 Effects of Quantum Entanglement in Phase Transitions Brody, D C; Hughston, L P ; and Parry, M F. 2010. Effects of Quantum Entanglement in Phase Transitions. Physics Letters A, 374(24), pp. 2424-2428. ISSN 0375-9601 Nonlinearity and Constrained Quantum Motion Brody, D C; Gustavsson, A C T; and Hughston, L P . 2010. Nonlinearity and Constrained Quantum Motion. Journal of Physics A: Mathematical and Theoretical, 43(8), 082003. ISSN 1751-8113 Metric Approach to Quantum Constraints Brody, D C; Gustavsson, A C T; and Hughston, L P . 2009. Metric Approach to Quantum Constraints. Journal of Physics A: Mathematical and Theoretical, 42(29), 295303. ISSN 1751-8113 Informed Traders Brody, D C; Davis, M H A; Friedman, R L; and Hughston, L P . 2009. Informed Traders. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences, 465(2104), pp. 1103-1122. ISSN 1364-5021 Symplectic Approach to Quantum Constraints Brody, D C; Gustavsson, A C T; and Hughston, L P . 2008. Symplectic Approach to Quantum Constraints. Journal of Physics A: Mathematical and Theoretical, 41(47), 475301. ISSN 1751-8113 Dam Rain and Cumulative Gain Brody, D C; Hughston, L P ; and Macrina, A. 2008. Dam Rain and Cumulative Gain. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences, 464(2095), pp. 1801-1822. ISSN 1364-5021 Information-Based Asset Pricing Brody, D C; Hughston, L P ; and Macrina, A. 2008. Information-Based Asset Pricing. International Journal of Theoretical and Applied Finance, 11(1), pp. 107-142. ISSN 0219-0249 Quantum Phase Transitions Without Thermodynamic Limits Brody, D C; Hook, D W; and Hughston, L P . 2007. Quantum Phase Transitions Without Thermodynamic Limits. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences, 463(2084), pp. 2021-2030. ISSN 1364-5021 Unitarity, Ergodicity and Quantum Thermodynamics Brody, D C; Hook, D W; and Hughston, L P . 2007. Unitarity, Ergodicity and Quantum Thermodynamics. Journal of Physics A: Mathematical and Theoretical, 40(26), F503-F509. ISSN 1751-8113 On Quantum Microcanonical Equilibrium Brody, D C; Hook, D W; and Hughston, L P . 2007. On Quantum Microcanonical Equilibrium. Journal of Physics: Conference Series, 67, 012025. ISSN 1742-6588 Entanglement of Three-Qubit Geometry Brody, D C; Gustavsson, A C T; and Hughston, L P . 2007. Entanglement of Three-Qubit Geometry. Journal of Physics: Conference Series, 67, 012044. ISSN 1742-6596 Discretionary Stopping of One-Dimensional Itô Diffusions with a Staircase Reward Function Bronstein, A L; Hughston, L P ; Pistorius, M R; and Zervos, M. 2006. Discretionary Stopping of One-Dimensional Itô Diffusions with a Staircase Reward Function. Journal of Applied Probability, 43(4), 984 - 986. ISSN 0021-9002 Exactly Solvable Quantum State Reduction Models with Time-Dependent Coupling Brody, D C; Constantinou, I C; Dear, J D C; and Hughston, L P . 2006. Exactly Solvable Quantum State Reduction Models with Time-Dependent Coupling. Journal of Physics A: Mathematical and General, 39(35), pp. 11029-11051. ISSN 0305-4470 Quantum Noise and Stochastic Reduction Brody, D C; and Hughston, L P . 2006. Quantum Noise and Stochastic Reduction. Journal of Physics ",
  "content_length": 33854,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:24"
}