{
  "name": "Lap-Fai Craig Yu",
  "homepage": "https://craigyuyu.github.io/home",
  "status": "success",
  "content": "Lap-Fai (Craig) Yu Craig Yu HOME GROUP RESEARCH SERVICES TEACHING HONORS ABOUT Lap-Fai (Craig) Yu Associate Professor, Department of Computer Science Director, Design Computing and Extended Reality Group Co-Director, Center for Human-AI Innovation in Society College of Engineering and Computing George Mason University Co-Founder, Great Victory Legends, Inc. Email: craigyu [At] gmu [Dot] edu Office: Room 6327, Fuse at Mason Square (Arlington Campus) Lab: Room 6329 & 6332, Fuse at Mason Square (Arlington Campus) Google Scholar Short Bio I lead the Design Computing and Extended Reality (DCXR) Group at George Mason University. I also co-direct the Center for Human-AI Innovation in Society (CHAIS) at GMU. Before joining GMU, I was an Assistant Professor at UMass Boston, where I founded and directed the Graphics and Virtual Environments Lab. I was a visiting scientist at the International Design Center at MIT and a visiting scholar at the Computer Graphics Lab at Stanford. I received my Ph.D. degree in Computer Science from UCLA, where I was advised by Demetri Terzopoulos. I received my B.Eng. and M.Phil. degrees in Computer Science from HKUST. I also worked at the Internet Graphics Group at Microsoft Research Asia. My lab receives generous support from the National Science Foundation, Microsoft, Google, Adobe, Nvidia, Oracle, and Wayfair. I am the lead inventor of Make-it-Home (SIGGRAPH 2011), a pioneering system for automating interior design and virtual world generation. I am also a co-founder of Great Victory Legends, a technology startup focusing on extended reality innovations and consulting. I received an NSF CRII award (2016) for my work on computational design and an NSF CAREER award (2020) for my work on virtual reality. Research Interests: Mixed Reality, Computational Design, Game Design, Graphics, Vision, Human-Computer Interaction We are looking for PhD students interested in VR/AR, robotics, and HCI. *Please check this out if you are interested in joining our team. What's New? Our paper \"Dragon's Path: Synthesizing User-Centered Flying Creature Animation Paths for Outdoor Augmented Reality Experiences\" has been conditionally accepted by ACM SIGGRAPH 2024. Our paper \"PoseVEC: Authoring Adaptive Pose-aware Effects Using Visual Programming and Demonstrations\" has been conditionally accepted by UIST 2023. Our paper \"Generating Activity Snippets by Learning Human-Scene Interactions\" has been conditionally accepted by ACM SIGGRAPH 2023. Our paper \"Location-Aware Adaptation of Augmented Reality Narratives\" has been accepted by CHI 2023. Our paper \"WFH-VR: Teleoperating a Robot Arm to set a Dining Table across the Globe via Virtual Reality\" has been accepted by IROS 2022. Our paper \"Interactive Augmented Reality Storytelling Guided by Scene Semantics\" has been accepted by ACM SIGGRAPH 2022. Our paper \"Synthesizing Scene-Aware Virtual Reality Teleport Graphs\" has been accepted by ACM SIGGRAPH Asia 2021. Our paper \"Joint Computational Design of Workspaces and Workplans\" has been accepted by ACM SIGGRAPH Asia 2021. Our paper \"Designing Human-Robot Coexistence Space\" has been accepted by IEEE Robotics and Automation Letters. Our paper \"A Review on Virtual Reality Skill Training Applications\" has been accepted by Frontiers in Virtual Reality. Our paper \"Toward Automatic Audio Description Generation for Accessible Videos\" has been accepted by ACM CHI 2021. Our paper \"Scene-Aware Behavior Synthesis for Virtual Pets in Mixed Reality\" has been accepted by ACM CHI 2021. Recent Activities and Lab News Our AR fire training research is recently featured in Government Technology. I am honored to receive the Mason 2025 Innovators Award (Digital Innovation). Congratulations to Changyang for receiving the Outstanding Academic Achievement Award by the GMU CS Department. Our VR training research is recently featured on the Peggy Smedley Show. I will serve as an Associate Editor for the ACM Transactions on Graphics. Congratulations to Changyang for receiving an Outstanding PhD Student Award by the GMU CS Department. Congratulations to Liuchuan for receiving an Academic Achievement Award by the GMU CS Department. Our augmented reality dragon project was featured by the ABC news. We will organize the 1st Workshop on \"eXtended Reality Gaming\" (XR Gaming)\" at IEEE VR 2024. Call for papers (due: Jan 12, 2024) I will co-teach a course on \"Authoring Next-Generation XR Storytelling Experiences using Real-World Scene Data - from Everyday Environments to the Ocean\" at SIGGRAPH Asia 2023. Congratulations to Rawan for joining UT Dallas as a tenure-track assistant professor in CS! Quang joins NASA as an AR/VR software engineer intern. We will organize the 4th Workshop on \"3D Content Creation for Simulated Training in Extended Reality (Training XR)\" at IEEE VR 2023. Call for papers (due: Jan 12, 2023) I will serve on the Program Committee of ACM SIGGRAPH 2023. Honored to serve as a member of the Panel on the Assessment of Humans in Complex Systems of the National Academies. Our SIGGRAPH 2022 paper \"Interactive Augmented Reality Storytelling Guided by Scene Semantics\" is featured on the SIGGRAPH Blog. See the interview. Congratulations to Rawan for receiving a Distinguished Academic Achievement Award by the GMU CS Department! I received an Outstanding Research Award by the GMU CS Department. I will serve on the Program Committee of ACM SIGGRAPH 2022. Our SIGGRAPH Asia 2021 paper \"Joint Computational Design of Workspaces and Workplans\" is featured on the ITmedia News. We will organize the 3rd Workshop on \"3D Content Creation for Simulated Training in Extended Reality (Training XR)\" at IEEE VR 2022. Call for papers (due: Jan 12, 2022) I received my tenure and promotion to become an Associate Professor. I will serve on the Program Committee of ACM SIGGRAPH Asia 2021. I will serve on the Program Committee of ACM CHI 2022. I will speak at the IEEE VR 2021 Recap Experts Panel about XR Training. We have kickstarted the PatriotXR group at GMU! Join our Discord to find out more. Rawan will join Facebook Reality Lab as a summer intern. We will organize the 2nd Workshop on \"3D Content Creation for Simulated Training in Extended Reality (Training XR)\" at IEEE VR 2021. Call for papers (due: Jan 25, 2021) I received an NSF CAREER award. We started a new topic on \"Professional Training in Extended Reality: Challenges and Solutions\" at the Frontiers in Virtual Reality journal. Call for papers! Rawan will join Adobe Research as a summer intern. We will organize the 1st Workshop on \"3D Content Creation for Simulated Training in Extended Reality (Training XR)\" at IEEE VR 2020. Congratulations to Biao for being selected as a Finalist of the CRA Undergraduate Researcher Arward program. I am invited to give a Design and Computation Lecture at the MIT's Architecture Department on Nov 22, 2019. Congratulations to Kristen for receiving the prestigious JFK Award (highest honor given to UMass Boston graduates)! Congratulations to Yongqi for receiving the prestigious NSF Graduate Research Fellowship! I will serve on the Program Committee of ACM CHI 2020. Our paper \"Pose-Guided Level Design\" received a Best Paper Honorable Mention Award from CHI 2019. Congratulations to Yongqi, Biao, Haikun (Quincy), and Elisa! Four of our recent VR and CHI papers are featured by the Seamless Virtual Reality news. Congrats for the project teams. Our lab has 3 papers conditionally accepted by CHI 2019! Kudos to all students (Haikun, Rawan, Elisa, Michael, Yongqi, Biao) in our lab for their achievements. Special thanks to our collaborators for their excellent support and efforts to make this happen too. I will serve on the Program Committee of EUROGRAPHICS 2019. I will serve on the Program Committee of IEEE Virtual Reality 2019. I will co-organize a tutorial on \"Creating and Understanding 3D Annotated Scene Meshes\" at IROS 2018 Call for Participation: SHREC 2018 RGB-D Object-to-CAD Retrieval Contest. The 2nd contest based on SceneNN. I will co-chair the 4th CVPR Workshop on Vision Meets Cognition: Functionality, Physics, Intentionality and Causality (FPIC) at CVPR 2018. Congratulations to Kristen Laird for winning the Oracle Undergraduate Research Fellowship! I will co-organize a tutorial on \"Creating Annotated Scene Meshes for Training and Testing Robot Systems\" at ICRA 2018 We will present a VR game demo, IVENTURE, at the Boston Festival of Indie Games. Congratulations to the team for being selected as a finalist in the competition! I will co-teach a course on \"Modeling and Remodeling 3D Worlds\" at SIGGRAPH Asia 2017 I will serve on the Program Committee of EUROGRAPHICS 2018. I will serve on the Program Committee of IEEE Virtual Reality 2018. I will give an invited talk at the Boston Virtual Reality Meetup on July 17 (Mon), 2017 at 6pm at the Cambridge Innovation Center. I receive an NSF CRII:CHS grant on Perceptual Data-Guided Computational Design. Congratulations to Yongqi Zhang and Biao Xie for winning the Oracle Undergraduate Research Fellowship! Congratulations to Yongqi Zhang for winning the Beacon Student Success Fellowship! Congratulations to Carla Aravena for winning the Tanimoto prize and the Louis H. Bronner Scholarship! Congratulations to Carla Aravena for receiving an Honorable Mention at the NSF Graduate Research Fellowship Program! I will give an invited talk at the New England Symposium on Graphics on April 23, 2017 at MIT. Call for Participation: SHREC 2017 RGB-D Object-to-CAD Retrieval Contest (registration deadline: Feb 1, 2017). The 1st contest based on SceneNN. I will co-chair the 3rd CVPR Workshop on Vision Meets Cognition: Functionality, Physics, Intentionality and Causality (FPIC) at CVPR 2017. Congratulations to Carla Aravena and Mark Vo for being selected as McNair Fellows. I will co-chair the 1st Workshop on Virtual Reality meets Physical Reality at SIGGRAPH ASIA 2016. I will co-chair the 2nd Workshop on Physical and Social Scene Understanding at CogSci 2016.",
  "content_length": 9997,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:22"
}