{
  "name": "Lara J. Martin",
  "homepage": "https://laramartin.net",
  "status": "success",
  "content": "Lara J. Martin, PhD Skip navigation Lara J. Martin, PhD Assistant Professor in Computer Science and Electrical Engineering at the University of Maryland, Baltimore County Human-Centered AI, Neurosymbolic NLP, Automated Story Generation, AAC, Dungeons and Dragons AI Researcher How to say Lara I make systems that improve how people talk with computers and to each other through computers. Most of my career so far has been teaching computers how to tell stories (also known as automated story generation) and working my way towards an AI Dungeon Master. I also work on Augmentative and Alternative Communication (AAC) and speech technologies. I'm an affiliate in the Information Systems Department and member of UMBC's Center for AI. I run the LARA Lab and am a member of the Interactive Robotics and Language Lab (IRAL). My pronouns are she/they. CV LARA Lab UMBC Personal Page Interactive Fiction and Story Generation Resources News Skip news 12/20/2025 - Shadab Choudhury and Asha Kumar's paper \"Evaluating Human-LLM Representation Alignment: A Case Study on Affective Sentence Generation for Augmentative and Alternative Communication\" has been accepted to IJCNLP-AACL Findings 2025! – Mumbai, India 11/9/2025 - Patty Delafuente & Arya Honraopatil's paper \"Does Reasoning Help LLM Agents Play Dungeons and Dragons? A Prompt Engineering Experiment\" and Anson Huang's paper \"WHAT-IF: Exploring Branching Narratives by Meta-Prompting Large Language Models\" have both been accepted to the Wordplay Workshop at EMNLP 2025! – Suzhou, China 9/25/2025 - UMBC makes the Great Colleges to Work For list for the 14th time in a row! It's one of the very few public doctoral universities to make the list. 7/11/2025 - I was on a podcast called Tingenuity AI. You can watch the video here: Interactive Storytelling with AI – Dr. Lara Martin 6/30/2025 - The Wordplay Workshop is hosting a shared task on Common-sense Personal-Grounded Dialogue this year, in collaboration with Sony! 5/15/2025 - I attended the CCC Computing Futures Symposium. – Washington, DC 5/13/2025 - I attended the CIFellows 2025 Symposium. – Washington, DC 5/2/2025 - Arya Honraopatil won the best presentation award at the CSEE Department's Research Day event! – Baltimore, MD 4/21/2025 - Naren Sivakumar successfully defended his MS thesis! – Baltimore, MD 4/18/2025 - Shadab Choudhury successfully defended his MS thesis! – Baltimore, MD 12/16/2024 - I am a guest editor for a IEEE Transactions on Games special issue on Large Language Models and Games! Submissions are due December 1st December 16th! 9/10/2024 - I started a new language technologies seminar series called LaTeSS! Our first talk was by Dr. Jonathan K. Kummerfeld. – Baltimore, MD 8/16/2024 - Hosted the Wordplay Workshop at ACL with my co-organizers. – Bangkok, Thailand 8/16/2024 - Our paper on BERALL, the system that uses RAG to generate interactive fiction games, was accepted to the Wordplay Workshop at ACL 2024! 6/24/2024 - Foad Hamidi and I have won a COEIT Interdisciplinary Proposal award and will be working on \"Investigating the Social and Affective Aspects of Large-Language Model-based Augmentative and Alternative Communication Systems\" together. 4/18/2024 - Gave a talk at the Human Language Technology Center of Excellence – Baltimore, MD 2/16/2024 - Gave a talk at Johns Hopkins University – Baltimore, MD 10/8/2023 - CALYPSO: LLMs as Dungeon Master's Assistants was presented at AIIDE 2023 – Salt Lake City, UT 10/4/2023 - Gave a talk at the University of Maryland, College Park's Computational Linguistics and Information Processing (CLIP) Colloquium – College Park, MD 10/8/2023 - CALYPSO: LLMs as Dungeon Master's Assistants was presented at AIIDE 2023 – Salt Lake City, UT 8/19/2023 - Andrew Zhu's work on CALYPSO was featured in The Register. 7/9/2023 - A demo paper on \"Human-in-the-Loop Schema Induction\" was also published at ACL 2023! – Toronto, Canada 7/9/2023 - Two papers were published at ACL 2023! One in the main conference (FIREBALL) and one in Findings of ACL (CoRRPUS) – Toronto, Canada 6/5/2023 - Presented the paper \"Author as Character and Narrator: Deconstructing Personal Narratives from the r/AmITheAsshole Reddit Community\" at ICWSM 2023, which came out of a class project from my Spring 2022 class on Interactive Fiction and Text Generation – Limassol, Cyprus 4/21/2023 - Gave the keynote talk at Northeastern University's NULab Spring Conference on \"Digital Bards: How Dungeons & Dragons will Make for Better AI\" – Boston, MA 2/27/2023 - Gave a guest talk for UMBC's Computer Science and Electrical Engineering department – Baltimore, MD 2/15/2023 - Gave a guest talk for Drexel's Information Science department – Philadelphia, PA 12/14/2022 - Featured in a Penn Engineering Magazine article about Next-Gen Innovators. 5/5/2022 - Gave a guest talk for USC ISI's NL (Natural Language) Seminar – Los Angeles, CA 1/13/2022 - 5/10/2022 - Co-taught a graduate course on Interactive Fiction and Text Generation with Chris Callison-Burch at UPenn. 11/29/2021 - Gave a guest talk for UCSC's CM (Computational Media) Seminar – Santa Cruz, CA (Virtual) 11/30/2021 - Gave a guest lecture for UPenn's NLP class. 10/14/2021 - Arranged the Doctoral Consortium at AIIDE 2021 – Virtual 6/11/2021 - Co-organized the Third Workshop on Narrative Understanding – Virtual 4/30/2021 - Gave a guest lecture for the University of Kentucky's Interactive Narrative (Topics in AI) class – Lexington, KY (Virtual) 3/15/2021 - The corresponding podcast to the Science Focus article is out! 2/12/2021 - My profile piece with BBC Science Focus magazine is available for purchase! 1/25/2021 - Gave a talk for UPenn's CLUNCH (Computational Linguistics Lunch) group 1/11/2021 - Started working at UPenn – Philadelphia, PA 12/7/2020 - Passed my defense! 10/19/2020 - 10/23/2020 - Publicity Co-Chair for AIIDE 2020! – Virtual 9/11/2020 - Gave a talk for Georgia Tech's NLP Seminar Series – Atlanta, GA 8/11/2020 - Awarded a 2020 Computing Innovation Fellowship! 7/9/2020 - Co-organized the First Joint Workshop on Narrative Understanding, Storylines, and Events (NUSE) 4/16/2020 - Article: Meet ML@GT: Lara J. Martin Trains AI Agents to Become Storytellers 2/28/2020 - Featured in an article on Wired, where I talk about where the future of AI should be going. 2/7/2020 - Presented at AAAI – New York City, NY 2/4/2020 - Article: Changing the Conversation: Georgia Tech Researchers Provide New Approach to Automated Story Generation 11/10/2019 - Paper on \"Story Realization: Expanding Plot Events into Sentences\" has been accepted at AAAI 2020! 10/30/2019 - Won the Foley Scholar Award! 10/8/2019 - Local Arrangements Chair for AIIDE 2019 – Atlanta, GA 9/18/2019 - Attended the Tapia Doctoral Consortium and won Best Doctoral Consortium Presentation (Slides here.) – San Diego, CA 8/10/2019 - Presented at IJCAI – Macau, China 8/1/2019 - Attended the 2nd Storytelling Workshop at ACL – Florence, Italy 4/22/2019 - Passed my proposal! Contact Online Bluesky LinkedIn Email Please enable Javascript to view In Person Information Technology and Engineering (ITE) Building, Room ITE 342-A 1000 Hilltop Circle, Baltimore, MD 21250 Research Accounts Google Scholar Google Scholar Everything else Github Research Gate Semantic Scholar Academia.edu ORCID Web of Science dblp arXiv Scopus Papers with Code ACL OpenReview Biography Biography About Me My research interests include: human-AI communication/collaboration computational creativity interactive narrative narrative generation & understanding dialog systems & conversational agents cognitive systems and computer-mediated human-human communication augmentative & alternative communication (AAC) prosody & emotion (affective computing) speech synthesis (text-to-speech) social media analysis I work from a blend of research and methods from various fields: natural language processing/language technologies, linguistics, human-computer interaction, cognitive science, and artifical intelligence. Some of my non-research passions include AI equity, science communication, and educating children about computer science and technology. Check out my CV for more information. Third-Person Bio Dr. Lara J. Martin (she/they) is an assistant professor at the University of Maryland, Baltimore County in the CSEE department, researching human-centered artificial intelligence with a focus on improving natural language processing tools for various applications. They have worked in the areas of automated story generation, augmentative and alternative communication (AAC) tools, AI for tabletop roleplaying games, speech processing, and affective computing—publishing in top-tier conferences such as AAAI, ACL, EMNLP, and IJCAI. They have also been featured in Wired and BBC Science Focus magazine. Previously, Dr. Martin was a 2020 Computing Innovation Fellow (CIFellow) postdoctoral researcher at the University of Pennsylvania working with Dr. Chris Callison-Burch. She earned her PhD in Human-Centered Computing from the Georgia Institute of Technology, where she worked with Dr. Mark Riedl. She also has a MS in Language Technologies from Carnegie Mellon University and a BS in Computer Science & Linguistics from Rutgers University—New Brunswick. Teaching Teaching I have a teaching certificate from Georgia Tech, Spring 2019. CMSC 473/673 Natural Language Processing University of Maryland, Baltimore County Spring 2025 Spring 2024 CMSC 491/691 Interactive Fiction and Text Generation University of Maryland, Baltimore County Fall 2025 Fall 2024 CMSC 671 Principles of Artificial Intelligence University of Maryland, Baltimore CountyFall 2023 CIS 700 Interactive Fiction and Text Generation University of PennsylvaniaSpring 2022 Co-taught with Dr. Chris Callison-Burch CS 3790 Introduction to Cognitive Science Georgia Institute of TechnologySummer 2018 Media Media Articles Hallucinating ChatGPT finds a role playing Dungeons & Dragons by Thomas Claburn for The Register.Aug 19, 2023. Next-Gen Innovators: Pen",
  "content_length": 11875,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:22"
}