{
  "name": "Larissa Meinicke",
  "homepage": "http://researchers.uq.edu.au/researcher/644",
  "status": "success",
  "content": "Dr Larissa Meinicke | UQ Experts Skip to menu Skip to content Skip to footer Dr Larissa Meinicke Email: l.meinicke@uq.edu.au Phone: +61 7 336 53310 Positions Affiliate of UQ Cyber Research Centre UQ Cyber Research Centre Faculty of Engineering, Architecture and Information Technology Senior Lecturer School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Larissa Meinicke's research interests include mathematical notations and techniques for the formal specification and development of computing systems; probabilistic systems; computer security; abstract algebra and refinement algebra; real-time and fault-tolerant systems.Dr Meinicke is currently a lecturer in the Division of Systems and Software Engineering Research in the School of Information Technology and Electrical Engineering.She completed her PhD in the area of Computer Science at the University of Queensland in 2008 under the supervision of Professor Ian Hayes. Since then she has worked as a researcher at the Department of Information Technologies at Åbo Akademi University in Finland, both as a part of Professor Ralph-Johan Back’s Formal Methods and Programming research group, and as a member of the European Commission for Information and Communication Technologies project \"Deploy\".From 2009 to 2011 Dr Meinicke worked on the ARC Research project \"Hidden-state modelling for modular analysis of information flow, protection and risk evaluation\" in conjunction with Associate Professor Annabelle McIver and Professor Carroll Morgan at Macquarie University in Sydney. Information about this research may be found at the Specification and Development of Probabilistic Systems page (below). Read more Read less Availability Dr Larissa Meinicke is: Available for supervision Qualifications Bachelor (Honours), The University of Queensland Doctor of Philosophy, The University of Queensland Works Search Professor Larissa Meinicke’s works on UQ eSpace All (38) Journal Article (9) Other Outputs (1) Conference Publication (24) Book Chapter (4) 2024 Conference Publication Restructuring a&nbsp;concurrent refinement algebra Hayes, Ian J., Meinicke, Larissa A. and Evangelou-Oost, Naso (2024). Restructuring a&nbsp;concurrent refinement algebra. 21st International Conference, RAMiCS 2024, Prague, Czech Republic, 19-22 August 2024. Cham, Switzerland: Springer Nature Switzerland. doi: 10.1007/978-3-031-68279-7_9 Restructuring a&nbsp;concurrent refinement algebra 2024 Book Chapter Reasoning about distributive laws in&nbsp;a&nbsp;concurrent refinement algebra Meinicke, Larissa A. and Hayes, Ian J. (2024). Reasoning about distributive laws in&nbsp;a&nbsp;concurrent refinement algebra. The practice of formal methods: essays in honour of Cliff Jones, part II. (pp. 1-22) edited by Ana Cavalcanti and James Baxter. Cham, Switzerland: Springer Nature Switzerland. doi: 10.1007/978-3-031-66673-5_1 Reasoning about distributive laws in&nbsp;a&nbsp;concurrent refinement algebra 2024 Book Chapter Practical rely/guarantee verification of&nbsp;an&nbsp;efficient lock for&nbsp;seL4 on&nbsp;multicore architectures Colvin, Robert J., Hayes, Ian J., Heiner, Scott, Höfner, Peter, Meinicke, Larissa and Su, Roger C. (2024). Practical rely/guarantee verification of&nbsp;an&nbsp;efficient lock for&nbsp;seL4 on&nbsp;multicore architectures. The practice of formal methods: essays in honour of Cliff Jones, Part I. (pp. 65-87) edited by Ana Cavalcanti and James Baxter. Cham, Switzerland: Springer Nature Switzerland. doi: 10.1007/978-3-031-66676-6_4 Practical rely/guarantee verification of&nbsp;an&nbsp;efficient lock for&nbsp;seL4 on&nbsp;multicore architectures 2023 Conference Publication Using cylindric algebra to support local variables in rely/guarantee concurrency Meinicke, Larissa A. and Hayes, Ian J. (2023). Using cylindric algebra to support local variables in rely/guarantee concurrency. IEEE/ACM 11th International Conference on Formal Methods in Software Engineering (FormaliSE), Melbourne, VIC, Australia, 14-15 May 2023. Piscataway, NJ, United States: Institute of Electrical and Electronics Engineers. doi: 10.1109/formalise58978.2023.00019 Using cylindric algebra to support local variables in rely/guarantee concurrency 2023 Book Chapter Specifying and&nbsp;reasoning about shared-variable concurrency Hayes, Ian J., Jones, Cliff B. and Meinicke, Larissa A. (2023). Specifying and&nbsp;reasoning about shared-variable concurrency. Theories of programming and formal methods: essays dedicated to Jifeng He on the occasion of his 80th birthday. (pp. 110-135) edited by Jonathan P. Bowen, Qin Li and Qiwen Xu. Cham, Switzerland: Springer. doi: 10.1007/978-3-031-40436-8_5 Specifying and&nbsp;reasoning about shared-variable concurrency 2023 Book Chapter Trace Models of Concurrent Valuation Algebras Evangelou-Oost, Naso, Meinicke, Larissa, Bannister, Callum and Hayes, Ian J. (2023). Trace Models of Concurrent Valuation Algebras. Formal Methods and Software Engineering. (pp. 118-136) Singapore: Springer Nature Singapore. doi: 10.1007/978-981-99-7584-6_8 Trace Models of Concurrent Valuation Algebras 2019 Conference Publication Cylindric Kleene Lattices for Program Construction Dongol, Brijesh, Hayes, Ian, Meinicke, Larissa and Struth, Georg (2019). Cylindric Kleene Lattices for Program Construction. MPC: 13th International Conference on Mathematics of Program Construction, Porto, Portugal, 7–9 October 2019. Cham, Switzerland: Springer. doi: 10.1007/978-3-030-33636-3_8 Cylindric Kleene Lattices for Program Construction 2019 Conference Publication Developing an Algebra for Rely/Guarantee Concurrency: Design Decisions and Challenges Hayes, Ian J. and Meinicke, Larissa A. (2019). Developing an Algebra for Rely/Guarantee Concurrency: Design Decisions and Challenges. UTP: 7th International Symposium on Unifying Theories of Programming, Porto, Portugal, 8 October 2019. Cham, Switzerland: Springer. doi: 10.1007/978-3-030-31038-7_9 Developing an Algebra for Rely/Guarantee Concurrency: Design Decisions and Challenges 2018 Journal Article A synchronous program algebra: a basis for reasoning about shared-memory and event-based concurrency Hayes, Ian J., Meinicke, Larissa A., Winter, Kirsten and Colvin, Robert J. (2018). A synchronous program algebra: a basis for reasoning about shared-memory and event-based concurrency. Formal Aspects of Computing, 31 (2), 133-163. doi: 10.1007/s00165-018-0464-4 A synchronous program algebra: a basis for reasoning about shared-memory and event-based concurrency 2018 Conference Publication Encoding fairness in a synchronous concurrent program algebra Hayes, Ian J. and Meinicke, Larissa A. (2018). Encoding fairness in a synchronous concurrent program algebra. 22nd International Symposium on Formal Methods, FM 2018 Held as Part of the Federated Logic Conference, FloC 2018, Oxford, United Kingdom, 15-17 July 2018. Heidelberg, Germany: Springer. doi: 10.1007/978-3-319-95582-7_13 Encoding fairness in a synchronous concurrent program algebra 2018 Conference Publication Type capabilities for object-oriented programming languages Wu, Xi, Lu, Yi, Meiring, Patrick A., Hayes, Ian J. and Meinicke, Larissa A. (2018). Type capabilities for object-oriented programming languages. 20th International Conference on Formal Engineering Methods, ICFEM 2018, Gold Coast, QLD Australia, 12-16 November 2018. Cham, Switzerland: Springer. doi: 10.1007/978-3-030-02450-5_13 Type capabilities for object-oriented programming languages 2017 Journal Article Designing a semantic model for a wide-spectrum language with concurrency Colvin, Robert J., Hayes, Ian J. and Meinicke, Larissa A. (2017). Designing a semantic model for a wide-spectrum language with concurrency. Formal Aspects of Computing, 29 (5), 1-23. doi: 10.1007/s00165-017-0416-4 Designing a semantic model for a wide-spectrum language with concurrency 2017 Conference Publication Evaluating quality of security testing of the JDK Krishnan, Padmanabhan, O’Donoghue, Rebecca, Loh, Jerome and Meinicke, Larissa (2017). Evaluating quality of security testing of the JDK. 8th ACM SIGSOFT International Workshop on Automated Software Testing, A-TEST 2017, co-located with the International ESEC/FSE Conference, FSE 2017, Paderborn, Germany, 4-5 September 2017. New York, NY, United States: Association for Computing Machinery. doi: 10.1145/3121245.3121246 Evaluating quality of security testing of the JDK 2017 Conference Publication Capabilities for Java: Secure access to resources Hayes, Ian J., Wu, Xi and Meinicke, Larissa A. (2017). Capabilities for Java: Secure access to resources. 15th Asian Symposium on Programming Languages and Systems, APLAS 2017, Suzhou, People's Republic of China, 27-29 November 2017. Heidelberg, Germany: Springer. doi: 10.1007/978-3-319-71237-6_4 Capabilities for Java: Secure access to resources 2016 Conference Publication An algebra of synchronous atomic steps Hayes, Ian J., Colvin, Robert J., Meinicke, Larissa A., Winter, Kirsten and Velykis, Andrius (2016). An algebra of synchronous atomic steps. 21st International Symposium on Formal Methods, FM 2016, Limassol, Cyprus, 9-11 November 2016. Heidelberg, Germany: Springer. doi: 10.1007/978-3-319-48989-6_22 An algebra of synchronous atomic steps 2015 Journal Article Hidden-Markov program algebra with iteration McIver, Annabelle, Meinicke, Larissa and Morgan, Carroll (2015). Hidden-Markov program algebra with iteration. Mathematical Structures in Computer Science, 25 (S02), 320-360. doi: 10.1017/S0960129513000625 Hidden-Markov program algebra with iteration 2015 Conference Publication Designing for visually impaired developers Epifani, Andrea, Boden, Marie, Meinicke, Larissa, Matthews, Ben and Viller, Stephen (2015). Designing for visually impaired developers. World Conference of the International Association of Design Research, Brisbane, Australia, 2-5 November 2015. The International Association of Societies of Design Research. Desi",
  "content_length": 13152,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:26"
}