{
  "name": "Larry Hill",
  "homepage": "https://www.rit.edu/gccis/larry-hill",
  "status": "success",
  "content": "Lawrence Hill | Golisano College of Computing and Information Sciences | RIT RIT Logo with Text Lawrence Hill Associate Professor School of Information Golisano College of Computing and Information Sciences lwhfac@rit.edu 585-475-7064 Office Location GOL-2331 Lawrence Hill Associate Professor School of Information Golisano College of Computing and Information Sciences Education BS, MS, Rochester Institute of Technology lwhfac@rit.edu 585-475-7064 Areas of Expertise Computing Education Select Scholarship Published Conference ProceedingsHill, Lawrence. \"Information Technology and Computing Topics and Their Relevance to Medical Undergraduate and Graduate Program Curricula at RIT.\" Proceedings of the ECC 2019, Marist College, Poughkeepsie, NY, June 11 2019. Ed. Cynthia Worrad. Poughkeepsie, NY: n.p., 2019. Web.Hill, Lawrence. \"Enterprise Computing–System-Level Thinking, Much More Than an IT Data Focus, and Pedagogical and Career Imperatives to Include Such Topics in IT Curricula.\" Proceedings of the Enterprise Computing Community (ECC) 2017. Ed. MaryAnn Hoffman. Poughkeepsie, NY: Marist College, 2017. Web.Hill, Lawrence. \"Enterprise Computing Topics and Their Integration into an Established Information Technology Academic Program.\" Proceedings of the 2016 ECC (Enterprise Computing Community) Conference, June 12-14, Marist College, Poughkeepsie, NY. Ed. MaryAnn Hoffman. Poughkeepsie, NY: n.p., Web.Hill, Lawrence and Steven Ciccarelli. \"Using a Low-Cost Open Source Hardware Development Platform in Teaching Young Students Programming Skills.\" Proceedings of the SIGITE 2013. Ed. Robert. Friedman. Orlando, Florida: ACM, 2013. Web. Currently Teaching GCIS-123Software Development and Problem Solving I4 CreditsA first course introducing students to the fundamentals of computational problem solving. Students will learn a systematic approach to problem solving, including how to frame a problem in computational terms, how to decompose larger problems into smaller components, how to implement innovative software solutions using a contemporary programming language, how to critically debug their solutions, and how to assess the adequacy of the software solution. Additional topics include an introduction to object-oriented programming and data structures such as arrays and stacks. Students will complete both in-class and out-of-class assignments.NSSA-102Computer Systems Concepts3 CreditsThis course teaches the student the essential technologies needed by NSSA majors, focused on PC and mainframe hardware topics. They include how those platforms operate, how they are configured, and the operation of their major internal components. Also covered are the basic operating system interactions with those platforms, physical security of assets, and computing-centric mathematical concepts.NSSA-241Introduction to Routing and Switching3 CreditsThis course provides an introduction to wired network infrastructures, topologies, technologies, and the protocols required for effective end-to-end communication. Basic security concepts for TCP/IP based technologies are introduced. Networking layers 1, 2, and 3 are examined in-depth using the International Standards Organization’s Open Systems Interconnection and TCP/IP models as reference. Course topics focus on the TCP/IP protocol suite, the Ethernet LAN protocol, switching technology, and routed and routing protocols common in TCP/IP networks. The lab assignments mirror the lecture content , providing an experiential learning component for each topic covered.NSSA-423Scalable Computing Architectures3 CreditsThis course explores mid-range (server farms and clusters) and mainframe system architecture, hardware, configuration, and operating system concepts. Students in this course gain understanding of the reasons companies choose mid-range and large-scale systems for their computing environments and how those firms implement those architectures.NSSA-425Data Center Operations3 CreditsThis course provides students with a background in the technologies and techniques used to design, implement, and maintain a modern data center. This course will help students to see the interrelated nature of many of these topics and to gain a better understanding of the role of the following technologies in a modern data center: physical facility design, network infrastructures, power distribution, heating, ventilation and air conditioning (HVAC), storage, high-availability computing, disaster recovery, and emerging data center technologies. Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 4719,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:30"
}