{
  "name": "Larry Heck",
  "homepage": "https://ece.gatech.edu/directory/larry-p-heck",
  "status": "success",
  "content": "Larry P Heck Skip to main navigation Skip to main content Larry P Heck Personal Webpage, Google Scholar Official Job Title Professor Endowed Chair and Professorships Titles Rhesa Screven Farmer Jr., Advanced Computing Concepts Chair Georgia Research Alliance Eminent Scholar Email Address larryheck@gatech.edu Office Building TSRB Office Room Number 436B Technical Interest Group(s) Computer Systems and Software Digital Signal Processing Biography Larry P. Heck is a Professor with a joint appointment in the Schools of Electrical and Computer Engineering and Interactive Computing at the Georgia Institute of Technology. He holds the Rhesa S. Farmer Distinguished Chair of Advanced Computing Concepts and is a Georgia Research Alliance Eminent Scholar. His received the BSEE from Texas Tech University (1986), and MSEE and PhD EE from the Georgia Institute of Technology (1989,1991). He is a Fellow of the IEEE, inducted into the Academy of Distinguished Engineering Alumni at Georgia Tech and received the Distinguished Engineer Award from the Texas Tech University. He was a Senior Research Engineer with SRI (1992-98), VP of R&D at Nuance (1998-2005), VP of Search and Advertising Sciences at Yahoo! (2005-2009), Chief Scientist of the Microsoft Speech products and Distinguished Engineer in Microsoft Research (2009-2014), Principal Scientist with Google Research (2014-2017), CEO of Viv Labs and SVP at Samsung (2017-2021). Research Machine/deep learning Artificial intelligence (AI) Natural language processing (NLP) Conversational systems Speech/speaker recognition Distinctions & Awards IEEE Fellow 2020 IEEE Signal Processing Society (SPS) Best Paper Award Academy of Distinguished Engineering Alumni, Georgia Tech College of Engineering, 2017 Distinguished Engineer Award, Texas Tech University Whitacre College of Engineering, 2017 Friday, 17 May 2024 11:18 AM EDT",
  "content_length": 1877,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:26"
}