{
  "name": "Lars Oestreicher",
  "homepage": "https://katalog.uu.se/empinfo/?id=XX3662",
  "status": "success",
  "content": "Lars Oestreicher - Uppsala universitet Lars Oestreicher Universitetslektor vid Institutionen för informationsteknologi; Vi3; Människa-Maskininteraktion Telefon: 018-471 10 47Mobiltelefon: 073-469 70 71E-post: Lars.Oestreicher@it.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Lars Oestreicher vid Institutionen för informationsteknologi; Vi3; Människa-Maskininteraktion Akademiska meriter: Tekn.Dr, Excellent lärare Kort presentation Mina forskningsintressen kan exemplifieras med ett avslutat projekt vid Årsta grundsärskola, Uppsala. I projektet skapade vi förutsättningar för barn att aktivt spela musik genom användande av IT. Projektet heter MUMIn-projektet, där MUMIn står för \"Maximalt Uttryck - Minimal Interaktion\". Ett annat forskningsintresse är relationen mellan AI och konst. Utöver projektet undervisar jag i kurserna Gränssnittsprogrammering 1 och 2 samt i kursen Icke-exkluderande Design (om funktionsnedsättningar). Nyckelord artificial intelligencedisability researchnon-excluding designuniversal designusabilityuser interface programmingart generation-interpretation Media Medium En blog om diverse saker som intresserar mig. https://medium.com/@Moomindad Publikationer Urval av publikationer Human-Computer Interaction – INTERACT 2009: Part I Gross, Tom; Gulliksen, Jan; Kotzé, Paula; Oestreicher, Lars et al. 2009 Human-Computer Interaction – INTERACT 2009: Part II Gross, Tom; Gulliksen, Jan; Kotzé, Paula; Oestreicher, Lars et al. 2009 Teaching HCI from Real World Examples: Furnishing creativity? Oestreicher, Lars Ingår i Creativity 3, 2007 EISH – Exercises in Studying HCI Baumann, Konrad; Kotzé, Paula; Oestreicher, Lars; Bannon, Liam et al. Ingår i Creativity 3, 2007 User Expectations on Human-Robot Co-operation Oestreicher, Lars; Severinsson Eklundh, Kerstin Ingår i RO-Man 2006, 2006 Knowledge management for robot activites in a real world context: A case for Task Pattern Analysis (TAPAS) Oestreicher, Lars Ingår i KES 2005, 2005 Involving Users in the Design of a Mobile Office Robot Hüttenrauch, Helge; Green, Anders; Oestreicher, Lars; Norman, Mikael et al. Ingår i IEEE Transactions on Systems, Man and Cybernetics, s. 113-124, 2004 Teaching Human-Computer Interaction: Qualitative Support for an Alternative Approach Oestreicher, Lars; Kotzé, Paula Ingår i Usability, s. 267-281, 2002 Användaranpassad utformning av en Severinson Eklundh, Kerstin; Espmark, Erik; Green, Anders; Hüttenrauch, Helge et al. 2001 DESIGN VERSUS DESIGN – FROM THE SHAPING OF PRODUCT TO THE CREATION OF USER EXPERIENCES Gulliksen, Jan; Lantz, Ann; Severinsson-Eklundh, Kerstin; Oestreicher, Lars 2000 User Centered Design for Intelligent Service Robots Green, Anders; Hüttenrauch, Helge; Oestreicher, Lars; Severinson Eklundh, Kerstin Ingår i ROMAN 2000 - 9th IEEE Conference on Robot-Human Interaction, 2000 Six Golden Rules to Shake the Student's Mind Oestreicher, Lars 1999 Office Automation and Users' Need for Support Waern, Yvonne; Malmsten, Nils; Oestreicher, Lars; Hjalmarsson, Ann et al. Ingår i Behaviour and Information Technology, s. 501-514, 1991 Executable Formal Descriptions for Software Design: Logic and Logic Programming as a Design Tool Oestreicher, Lars 1991 Designing for the mental model: an interdisciplinary approach to the definition of a user interface for electronic mail systems van der Veer, Gerrit C.; Guest, Stephen; Haselager, William F.G.; Innocent, Peter et al. Ingår i Selected papers of the 6th Interdisciplinary Workshop on Informatics and Psychology, s. 253-288, North-Holland, Amsterdam, 1987 Senaste publikationer What is the problem to which AI chatbots are the solution?: AI ethics through Don Ihde's embodiment, hermeneutic, alterity, and background relationships Laaksoharju, Mikael; Lennerfors, Thomas Taro; Persson, Anders; Oestreicher, Lars Ingår i Ethics and Sustainability in Digital Cultures, s. 31-48, Routledge, 2024 DOI för What is the problem to which AI chatbots are the solution?: AI ethics through Don Ihde's embodiment, hermeneutic, alterity, and background relationships From Visual Forms to Metaphors: Targeting Cultural Competence in Image Analysis Oestreicher, Lars; von Bonsdorff, Jan Ingår i Proceedings of the 6th Digital Humanities in the Nordic and Baltic Countries Conference (DHNB 2022), s. 343-351, 2022 Ladda ner fulltext (pdf) av From Visual Forms to Metaphors: Targeting Cultural Competence in Image Analysis Cognitive Chunks as Neural Activity: Is it Possible to see What you Think? Oestreicher, Lars Ingår i Proceedings Of The 10th IEEE International Conference On Cognitive Infocommunications, s. 199-204, 2019 DOI för Cognitive Chunks as Neural Activity: Is it Possible to see What you Think? Ladda ner fulltext (pdf) av Cognitive Chunks as Neural Activity: Is it Possible to see What you Think? Future assistive devices: What's at stake for you or me? Oestreicher, Lars Ingår i XRDS, s. 46-49, 2019 DOI för Future assistive devices: What's at stake for you or me? A study protocol for applying user participation and co-learning: Lessons learned from the eBalance project Åberg, Anna Cristina; Halvorsen, Kjartan; From, Ingrid; Bergman Bruhn, Åsa et al. Ingår i International Journal of Environmental Research and Public Health, 2017 DOI för A study protocol for applying user participation and co-learning: Lessons learned from the eBalance project Ladda ner fulltext (pdf) av A study protocol for applying user participation and co-learning: Lessons learned from the eBalance project Alla publikationer Artiklar i tidskrift Future assistive devices: What's at stake for you or me? Oestreicher, Lars Ingår i XRDS, s. 46-49, 2019 DOI för Future assistive devices: What's at stake for you or me? A study protocol for applying user participation and co-learning: Lessons learned from the eBalance project Åberg, Anna Cristina; Halvorsen, Kjartan; From, Ingrid; Bergman Bruhn, Åsa et al. Ingår i International Journal of Environmental Research and Public Health, 2017 DOI för A study protocol for applying user participation and co-learning: Lessons learned from the eBalance project Ladda ner fulltext (pdf) av A study protocol for applying user participation and co-learning: Lessons learned from the eBalance project Involving Users in the Design of a Mobile Office Robot Hüttenrauch, Helge; Green, Anders; Oestreicher, Lars; Norman, Mikael et al. Ingår i IEEE Transactions on Systems, Man and Cybernetics, s. 113-124, 2004 Teaching Human-Computer Interaction: Qualitative Support for an Alternative Approach Oestreicher, Lars; Kotzé, Paula Ingår i Usability, s. 267-281, 2002 Office Automation and Users' Need for Support Waern, Yvonne; Malmsten, Nils; Oestreicher, Lars; Hjalmarsson, Ann et al. Ingår i Behaviour and Information Technology, s. 501-514, 1991 Kapitel i böcker, delar av antologi What is the problem to which AI chatbots are the solution?: AI ethics through Don Ihde's embodiment, hermeneutic, alterity, and background relationships Laaksoharju, Mikael; Lennerfors, Thomas Taro; Persson, Anders; Oestreicher, Lars Ingår i Ethics and Sustainability in Digital Cultures, s. 31-48, Routledge, 2024 DOI för What is the problem to which AI chatbots are the solution?: AI ethics through Don Ihde's embodiment, hermeneutic, alterity, and background relationships Teaching Human-Computer Interaction from Real World Examples: Furnishing Creativity? Oestreicher, Lars Ingår i Creativity and HCI:, s. 60-77, Springer, 2009 DOI för Teaching Human-Computer Interaction from Real World Examples: Furnishing Creativity? Designing for the mental model: an interdisciplinary approach to the definition of a user interface for electronic mail systems van der Veer, Gerrit C.; Guest, Stephen; Haselager, William F.G.; Innocent, Peter et al. Ingår i Selected papers of the 6th Interdisciplinary Workshop on Informatics and Psychology, s. 253-288, North-Holland, Amsterdam, 1987 Konferensbidrag From Visual Forms to Metaphors: Targeting Cultural Competence in Image Analysis Oestreicher, Lars; von Bonsdorff, Jan Ingår i Proceedings of the 6th Digital Humanities in the Nordic and Baltic Countries Conference (DHNB 2022), s. 343-351, 2022 Ladda ner fulltext (pdf) av From Visual Forms to Metaphors: Targeting Cultural Competence in Image Analysis Cognitive Chunks as Neural Activity: Is it Possible to see What you Think? Oestreicher, Lars Ingår i Proceedings Of The 10th IEEE International Conference On Cognitive Infocommunications, s. 199-204, 2019 DOI för Cognitive Chunks as Neural Activity: Is it Possible to see What you Think? Ladda ner fulltext (pdf) av Cognitive Chunks as Neural Activity: Is it Possible to see What you Think? Finding keys for people with mild dementia: Not just a matter of beeping and flashing Oestreicher, Lars Ingår i Proceedings 8th International Conference on Augmented Cognition, Foundations of Augmented Cognition, s. 315-324, 2014 DOI för Finding keys for people with mild dementia: Not just a matter of beeping and flashing Challenges from the Future: Bridging the Gaps through HCI Education Oestreicher, Lars; Silva, Paula Alexandra Ingår i Human-Computer Interaction – INTERACT 2013, s. 779-779, 2013 Using cultural analysis as a tool to increase quality in organisational ergonomics Löfström, Anette; Oestreicher, Lars 2012 Teaching HCI from Real World Examples: Furnishing creativity? Oestreicher, Lars Ingår i Creativity 3, 2007 EISH – Exercises in Studying HCI Baumann, Konrad; Kotzé, Paula; Oestreicher, Lars; Bannon, Liam et al. Ingår i Creativity 3, 2007 User Expectations on Human-Robot Co-operation Oestreicher, Lars; Severinsson Eklundh, Kerstin Ingår i RO-Man 2006, 2006 Knowledge management for robot activites in a real world context: A case for Task Pattern Analysis (TAPAS) Oestreicher, Lars Ingår i KES 2005, 2005 User Centered Design for Intelligent Service Robots Green, Anders; Hüttenrauch, Helge; Oestreicher, Lars; Severinson Eklundh, Kerstin Ingår i ROMAN 2000 - 9th IEEE Conference on ",
  "content_length": 10826,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:33"
}