{
  "name": "Lars Christian Wolf",
  "homepage": "https://www.ibr.cs.tu-bs.de/users/wolf",
  "status": "success",
  "content": "Menü Suche IBR LoginInstitut für Betriebssysteme und Rechnerverbund News Wir über uns Gesamtes Team Anreise Raumplan Projekte Veröffentlichungen Software News Archiv Connected and Mobile Systems Team Lehrveranstaltungen Abschlussarbeiten Projekte Veröffentlichungen Software Datensätze Verlässliche Systemsoftware Übersicht Team Lehre Arbeiten & Jobs Forschung Publikationen Algorithmik Team Lehrveranstaltungen Abschlussarbeiten Projekte Veröffentlichungen Mikroprozessorlabor Studium Wintersemester 2025/2026 Sommersemester 2025 Abschlussarbeiten Service Bibliothek Mailinglisten Webmail Knowledgebase Wiki Account Management Service-Status Spin-Offs Docoloc bliq (formerly AIPARK) Confidential Technologies Forschungsverbünde IST.hub Prof. Dr.-Ing. Lars WolfInstitutsleiterTechnische Universität BraunschweigInstitut für Betriebssysteme und RechnerverbundConnected and Mobile Systems (Prof. Wolf)Mühlenpfordtstraße 23, 1. OG38106 BraunschweigRaum 138+49 531 3913288wolf[[at]]ibr.cs.tu-bs.deORCID: https://orcid.org/0000-0001-9782-7765 Sprechstunde: Dienstag 12:30 PGP Schlüssel Kurzer Lebenslauf Hier finden Sie einen kurzen Lebenslauf. Lehre Eine Übersicht der Lehrveranstaltungen unserer Arbeitsgruppe findet sich auf den enstprechenden Seiten des Instituts. Aktuelle Informationen zu jedem Semester stehen unter dem jeweiligen Semestereintrag. Laufende Projekte Informationen zu den Forschungsprojekten. Veröffentlichungen Veröffentlichungen seit 2002 Publikationen bis 2002 aktualisiert am 05.05.2023, 17:52, verwaltet von Prof. Dr.-Ing. Lars Wolf Für alle Stellen der TU Braunschweig Jobbörse des Career Service Merchandising Sponsoring- & Spendenleistungen Drittmittelgeförderte Forschungsprojekte Vertrauenspersonen für Hinweisgeber Für Studierende Semestertermine Lehrveranstaltungen Studiengänge von A-Z Informationen für Erstsemester TUCard Interne Tools Status GITZ-Dienste Handbuch für TYPO3 (Intern) Corporate Design-Toolbox (Intern) Glossar (DE-EN) Meine Daten ändern Hochschulöffentliche Bekanntmachungen Kontakt Technische Universität Braunschweig Universitätsplatz 2 38106 Braunschweig Postfach: 38092 Braunschweig Telefon: +49 (0) 531 391-0 Anreise © Technische Universität Braunschweig Impressum Datenschutz Barrierefreiheit",
  "content_length": 2246,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:29"
}