{
  "name": "Lars Birkedal",
  "homepage": "http://cs.au.dk/~birke",
  "status": "success",
  "content": "Lars Birkedal / Home Lars Birkedal Professor, Villum Investigator Curriculum Vitæ Head of Logic and Semantics Group Publications birkedal@cs.au.dk Dept. of Comp. Science, Aarhus University Office: Turing 216 (building 5341, office 225) Aabogade 34 Phone: +45 2383 8546 DK-8200 Aarhus N, Denmark. Phone: +45 8715 6227 Short BIO Lars Birkedal is Professor of Computer Science at Aarhus University. He received his Ph.D. in Computer Science from Carnegie Mellon University, USA, in Dec. 1999 and until Dec. 2012 he was at the IT University of Copenhagen, Denmark. He served as Head of Department of Computer Science in Aarhus from 2014 to 2017. Lars Birkedal is a Fellow of the ACM, an elected member of the Royal Danish Academy of Sciences and Letters, recipient of an ERC Advanced Grant from the European Research Council 2023, the 2023 Alonzo Church Award for Outstanding Contributions to Logic and Computation (for the design and implementation of Iris, a higher-order concurrent separation logic framework), a Villum Investigator grant from the Villum Foundation 2019, the Danish Minister of Research Elite Research Award 2015 (\"Videnskabsministeriets EliteForsk-pris\"), a Sapere Aude Advanced Grant from the Danish National Science Research Council 2013, and the ACM SIGPLAN Milner Award 2013. He served as the Editor-in-Chief of the journal Logical Methods in Computer Science from 2014 until 2020 and is now Chairman of the board of the journal, and served as PC Chair for the POPL 2020 conference. Lars Birkedal's main research interests lie in the area of logic and semantics of programming languages and type theories. Current work focuses on program logics for reasoning about distributed, concurrent, higher-order, and imperative programs; cyber-security; and type theories with guarded recursion. Contents: Publications Talks Ph.D. students Post.Docs. Teaching Conferences Editorial Curriculum Vitæ Realizability Bibliography Current Research Projects: Compositional Higher-Order Reasoning about Distributed Systems (CHORDS) Center for Basic Research in Program Verification (CPV) Some Past Research Projects: Modular Reasoning about Concurrent Higher-Order Imperative Programs (ModuRes) Guarded Homotopy Type Theory (GHott) Tools and Methods for Scalable Software Verification (ToMeSo) Modular Reasoning about Software (MOREASO) Bigraphical Programming Languages (BPL) The ML Kit Reasoning about Resources (RaR) Tutorial Material: A Taste of Categorical Logic - Tutorial Notes Lecture Notes on Iris: Higher-Order Concurrent Separation Logic An Introduction to Logical Relations Type Safety and Logical Relations (Supplementary notes with lots of background material for the above lecture notes on logical relations) Lecture Notes on Semantics of Dependent Type Theory Solving Domain Equations using Loeb Induction Picture",
  "content_length": 2833,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:31"
}