{
  "name": "Lars Rune Christensen",
  "homepage": "https://pure.itu.dk/portal/en/persons/lars-rune-christensen(92f6c3f3-0ad2-40fc-b278-69170f87567d).html",
  "status": "success",
  "content": "Lars Rune Christensen - IT-University of Copenhagen Lars Rune Christensen PhD Associate Professor, Digitalization, Democracy, and GovernanceREFLACTCenter for Climate IT Head of Programme, Master in IT Management https://orcid.org/0000-0001-7204-465X Emaillrcitudk 20072025 Research activity per year Personal profile Research areas Research interests Digital Technologies in Work Practice, Digital Health, Global Health, Digital Transformation of Public Administration Bio Lars Rune Christensen’s research and expertise is (partly) on digital transformation for the benefit of crisis-affected populations and marginalized people in the Global South and elsewhere. The aim of this research is to increase the capacity and knowledge of how digital transformation may support innovation and sustainable development to end poverty and inequality for the world's most vulnerable. With this aim in mind, he has, for example, addressed inequality in healthcare by creating and evaluating digital health care services for Rohingya refugees in Bangladesh as well as Syrian refugees in Jordan. Furthermore, Lars has evaluated agricultural information systems for smallholder farmers in Bangladesh and Cambodia that aims to improve the livelihoods of the most vulnerable. The projects assessed used technologies ranging from simple mobile technology to comprehensive digital infrastructuring. His expertise in the context of developing countries includes (1) principles for digital development and its implementation, (2) digital transformation of service delivery, (3) support to stakeholders in their digital transformation, (4) the links between digital transformation and SDG’s such as health and well-being, climate change, gender equality, education, employment and decent work, agriculture, and trade, and (5) citizen-centred digital transformation of public services and administration. Lars holds a PhD and has published extensively on digital transformation in the Global South, focusing on the relationships between humans, their practices, and information technology. Furthermore, Lars Rune Christensen’s research is focused on the intersection between digital technologies, anthropology, and ethnography which is mostly published within the area of Computer Supported Cooperative Work (CSCW). The focus in this research is on developing a systematic, conceptual foundation for understanding, designing and implementing computational artifacts in cooperative work. The research is based on empirical studies of how practitioners understand, develop, and use digital artifacts in practices within e.g. health care and not least public administration. Lars has published extensively on the digital transformation of public administration in Denmark, then, and has foused on issues of artificial intelligence and the role of discreation. He also manages the ITUs professional masters program i.e. Head of Master in IT-Management Education PhD, Human-centered computing, IT-University of Copenhagen (2010) Cand.IT, Software development, IT-University of Copenhagen (2003) Bac. Social Anthropology and Ethnography, Aarhus University (1999) External funding and research management experience Principal Investigator: Syrian mHealth: Increasing Access to Mental Healthcare for the Syrian Refugees and their host Community in Jordan (October 2021 – April 2023). Funded by Novo Nordisk Fonden and in collaboration with JHASi (NGO). DKK 2 000 000. See: https://digitalhealth-itu.org Principal Investigator: Rohingya mHealth: Expanding Access to Healthcare for the Rohingya Community concerning Non-communicable Diseases in the Refugee Camps in Bangladesh (November 2020 – February 2022). Funded by Novo Nordisk Fonden and in collaboration with Friendship (NGO). DKK 1 000 000. Principal Investigator: Rohingya mHealth: Increasing Access to Healthcare for the Rohingya Community in the Refugee Camps in Bangladesh (June 2019 – September 2020). Funded by Novo Nordisk Fonden and in collaboration with Friendship (NGO). DKK 750 000. Co-PI: TRACE a Multicenter Open Trial of Efficacy, Safety and Feasibility of Non-Invasive Transcutan Vagus Nerve Stimulation (t-VNSTM) for Drug-Resistant Epilepsy. Funded by Inger Berthelsen Foundation in collaboration with Rigshospitalet, Denmark. DKK 750 000. Principal Investigator: Anne Sabers, Rigshospitalet. Co-PI: ECOKNOW an e-government project funded by the Danish Innovation Fund (2017 – 2022). In collaboration with Copenhagen University. Lars managed a work package on ethnographic workplace studies. www.ecoknow.org DKK 16 000 000. This multi-stakeholder project was on citizen-centered digital transformation of public services and administration.  Principal Investigator: Thomas Hildebrandt, KU. Selected publications Lars Rune Christensen & Hasib Ahsan (2022): Of Numbers and Moods: Screening for Mental Health Issues in a Rohingya Refugee Camp in Bangladesh, Medical Anthropology: Cross-Cultural Studies in Health and Illness, 41:8, 854-865 Anne Sabers, Sophia Aumüller-Wagner, Lars Rune Christensen, Oliver Henning, Konstantin Kostov, Morten Lossius, Marian Majoie, Ann Mertens, Lene Nielsen, Kristl Vonck, Louis Wagne (2021): Feasibility of Transcutaneous Auricular Vagus Nerve Stimulation in Treatment of Drug Resistant Epilepsy: A multicenter prospective study, Epilepsy Research, Volume 177, https://doi.org/10.1016/j.eplepsyres.2021.106776. Anette C. M. Petersen, Lars Rune Christensen, Richard Harper, and Thomas Hildebrandt. 2021. “We Would Never Write That Down”: Classifications of Unemployed and Data Challenges for AI. In Proceedings of the ACM on Human-Computer Interaction, Vol. 5, CSCW1, Article 102 (April 2021), 26 pages. Christensen, L.R., Ahsan, H., Mandal, S.K. (2020): Rohingya mHealth: Investigating Mental Health in Kutupalong Refugee Camp. Intervention: Journal of Mental Health and Psychosocial Support in Conflict Affected Areas. Volume 18, issue 2. The International Department of ARQ National Psychotrauma Centre in the Netherlands Petersen, A.C.M., Christensen, L.R. & Hildebrandt, T.T. The Role of Discretion in the Age of Automation. Computer Supported Cooperative Work 29, 303–333 (2020). https://doi.org/10.1007/s10606-020-09371-3 Christensen, L.R., Ahsan, H., Rashid, M. & Das, B.K. (2019). Are You Magicians? The Collaborative Work of an Agricultural Information Service, In the Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. Ahmedabad, India. ACM. Madsen, C.Ø., LR Christensen (2019): Integrated and seamless? Single Parents’ Experiences of Cross-Organizational Interaction, Information Systems Research Seminar in Scandinavia, 2019 Christensen, L. R., Ahsan, H. and Akand, E. Krishi Kontho: an agricultural information service in Bangladesh. In Proceedings of the Proceedings of the 10th Nordic Conference on Human-Computer Interaction(Oslo, Norway, 2018). ACM. Lindegaard, J.F. & Christensen, L.R. (2018) Allusive Machines: Encounters with Android Life. In the Proceedings of the 10th Nordic Conference on Human-Computer Interaction(Oslo, Norway, 2018). ACM. Lars Rune Christensen and Thomas Hildebrandt. (2017). Modelling Cooperative Work at a Medical Department. In Proceedings of the 8th International Conference on Communities and Technologies (C&T '17). Association for Computing Machinery, New York, NY, USA, 46–55. https://doi.org/10.1145/3083671.3083682 Christensen, L.R. (2016). On Intertext in Chemotherapy: An Ethnography of Text in Medical Practice. Computer Supported Cooperative Work (CSCW): The Journal of Collaborative Computing and Work Practices. 25, 1–38. https://doi.org/10.1007/s10606-015-9238-1 Christensen, L.R. & Bertelsen, O.W. (2015). A View of Causation for CSCW: Manipulation and Control in the Material Field of Work. In Wulf, V.; Randall, D.; Schmidt, K. (eds): Designing Socially Embedded Technologies in the Real-World, Springer, London, 2015. In press. Christensen, L.R. (2015). Intertext: On Connecting Text in the Building Process. In proceedings of the 14th European Conference on Computer Supported Cooperative Work (ECSCW), Oslo, 19 - 23 September, 2015, Springer, London. In press. Christensen, L.R. & Bjørn, P. (2014). Documentscape: Intertextuality, Sequentiality & Autonomy at Work. CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Toronto, Canada, April 26th – Maj 1st, 2014. Christensen, L.R. (2014). Techno-anthropology for Design, In Børsen, T. & Botin, L. (eds.) What is Techno-anthropology? Aalborg University Press. Christensen, L. R. (2014). Practices of Stigmergy in the Building Process. Computer Supported Cooperative Work (CSCW): The Journal of Collaborative Computing and Work Practices. Vol.23, Issue 1, Pages 1- 19. Christensen, L.R., Jensen, R.E. & Bjørn, P. (2014). Creating Relation Work: Characteristics for Local and Global Collaboration. COOP 14: 11th International Conference on the Design of Cooperative Systems, Nice, France, May 27th – May 30th 2014. Christensen, L. R. (2013). Coordinative Practices in the Building Process: An Ethnographic Perspective. Springer. London. Christensen, L.R. (2013). On Text in Oncology. Paper presented at The 4th international workshop on Infrastructures for Healthcare, Tromsø, Norway, 13/06/13 - 14/06/13 Bossen, C., Christensen, L.R., Grönvall, E., Vestergaard, L.S. (2013). CareCoor: Augmenting the coordination of cooperative home care work. International Journal of Medical Informatics Vol. 82, Issue 5, Pages e189-e199 Christensen, L.R. (2012). The Trouble with ‘Knowledge Transfer’: On Conduit Metaphors and Semantic Pathologies in Our Understanding of Didactic Practice. COOP 2012: 10th International Conference on the Design of Cooperative Systems, Marseille, France, May 29th – June 1st 2012. Springer, London. 111-126. Christensen, L. R. & Grönvall, E. (2011). Challenges and Opportunities for Collaborative Technologies for Home Care Work. In proceedings of the 12th European Conference on Computer-Supporte",
  "content_length": 21271,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:33"
}