{
  "name": "Lassi Paunonen",
  "homepage": "https://www.tuni.fi/en/lassi-paunonen",
  "status": "success",
  "content": "Lassi Paunonen | Tampere universitiesLassi PaunonenProfessor, matematiikkaFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universitylassi.paunonen [at] tuni.fi (lassi[dot]paunonen[at]tuni[dot]fi)phone number+358504479282Hervanta CampusOrcidhttps://orcid.org/0000-0001-6497-4718Websiteshttps://sysgrouptampere.wordpress.com/About meI am the leader of the Systems Theory Research Group (in mathematics) in the ITC faculty. My research interests especially include functional analysis, operator theory, theory of infinite-dimensional linear systems and robust control, stability of strongly continuous semigroups. The main homepages of my research group and myself, as well as the Youtube and Instagram accounts can be found in the following addresses: Research group homepage: https://sysgrouptampere.wordpress.com/ Personal homepage: https://lassipaunonen.wordpress.com/ Youtube account (teaching): Lassi Paunonen Teaching Youtube account (group): Systems Theory Research Group Instagram account (professional): https://www.instagram.com/paunonen_math/ Fields of expertiseFunctional analysis, operator theory, theory of infinite-dimensional linear systems and robust control, stability of strongly continuous semigroups. Research fieldsMathematics, Mathematical Systems Theory, Functional Analysis. Latest publicationsLimit-case admissibility for positive infinite-dimensional systemsArora, S., Glück, J., Paunonen, L. & Schwenninger, F. L., 25 Sept 2025, In: Journal of Differential Equations. 440, 113435.Research output: Contribution to journal › Article › Scientific › peer-reviewRobust output regulation for multi-dimensional heat equation under boundary controlZhao, R. X., Guo, B. Z. & Paunonen, L., Jan 2025, In: Automatica. 171, 111956.Research output: Contribution to journal › Article › Scientific › peer-reviewStability of abstract coupled systemsNicaise, S., Paunonen, L. & Seifert, D., 15 Jul 2025, In: Journal of Functional Analysis. 289, 2, 110909.Research output: Contribution to journal › Article › Scientific › peer-reviewAccelerating Neural ODEs Using Model Order ReductionLehtimäki, M., Paunonen, L. & Linne, M.-L., 2024, In: IEEE Transactions on Neural Networks and Learning Systems . 35, 1, p. 519-531 13 p., 3175757.Research output: Contribution to journal › Article › Scientific › peer-reviewNonautonomous Controllers and Output Regulation of Unknown Harmonic Signals for Regular Linear SystemsPaunonen, L. & Afshar, S., 2024, In: IEEE Transactions on Automatic Control. 69, 7, p. 4320-4335 16 p.Research output: Contribution to journal › Article › Scientific › peer-reviewPolynomial Stability of Coupled Waves with Weak Indirect DampingKosonen, J., Paunonen, L. & Vanspranghe, N., 2024, 26th International Symposium on Mathematical Theory of Networks and Systems MTNS 2024: Cambridge, United Kingdom, August 19-23, 2024. Elsevier, p. 31-36 6 p. (IFAC-PapersOnLine; vol. 58, no. 17).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewRobust controllers for a flexible satellite modelGovindaraj, T., Humaloja, J.-P. & Paunonen, L., Mar 2024, In: Mathematical Control and Related Fields. 14, 1, p. 356-385 30 p.Research output: Contribution to journal › Article › Scientific › peer-reviewNonuniform stability of damped contraction semigroupsChill, R., Paunonen, L., Seifert, D., Stahn, R. & Tomilov, Y., 2023, In: ANALYSIS AND PDE. 16, 5, p. 1089-1132 44 p.Research output: Contribution to journal › Article › Scientific › peer-reviewOn Forwarding Techniques for Stabilization and Set-Point Output Regulation of Semilinear Infinite-Dimensional SystemsVanspranghe, N., Brivadis, L. & Paunonen, L., 2023, 2023 62nd IEEE Conference on Decision and Control, CDC 2023. IEEE, p. 8149-8155 7 p. (Proceedings of the IEEE Conference on Decision and Control).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewOptimal decay for a wave-heat system with Coleman–Gurtin thermal lawDell'Oro, F., Paunonen, L. & Seifert, D., 15 Feb 2023, In: Journal of Mathematical Analysis and Applications. 518, 2, 126706.Research output: Contribution to journal › Article › Scientific › peer-reviewAll publicationsOwn linksPersonal (professional) homepageYoutube account (teaching)Youtube account (research group)Instagram account (professional)",
  "content_length": 4406,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:37"
}