{
  "name": "Lasse Natvig",
  "homepage": "https://www.ntnu.edu/employees/lasse.natvig",
  "status": "success",
  "content": "Lasse Natvig - NTNU Lasse Natvig Download press photo Download press photo Foto: Close Lasse Natvig Professor, PhD Department of Computer Science Faculty of Information Technology and Electrical Engineering lasse.natvig@ntnu.no +4773593685 +4790644580 IT-bygget, rom 404, Gløshaugen. Twitter NTNU - EECS Comp.arch lab About Research interests: Computer architecture, parallel processing, multi-core architectures and programming, chip multiprocessors and their memory systems, green computing, performance evaluation, energy-efficient computing and C++ programming. (More info at folk.idi.ntnu.no/lasse/ (in Norwegian)) Publications 2024 Bakker, Steffen Jaap Skotvoll; Ahmed, Mohamed Ben; Djupdal, Asbjørn; Natvig, Lasse; Andersson, Carl Henrik; Jahre, Magnus. (2024) FOMOsim: An open-source simulator for rigorous analysis of micromobility planning problems. Expert Systems With Applications Academic article 2019 Cebrian, Juan Manuel; Natvig, Lasse; Jahre, Magnus. (2019) Scalability analysis of AVX-512 extensions. The Journal of Supercomputing Academic article 2018 Hasib, Abdullah Al; Cebrian, Juan Manuel; Natvig, Lasse. (2018) A vectorized k-means algorithm for compressed datasets: design and experimental analysis. The Journal of Supercomputing Academic article 2017 Hasib, Abdullah Al; Natvig, Lasse; Kjeldsberg, Per Gunnar; Cebrian, Juan Manuel. (2017) Energy Efficiency Effects of Vectorization in Data Reuse Transformations for Many-Core Processors—A Case Study. Journal of Low Power Electronics and Applications Academic article 2016 Vaddina, Kameswar Rao; Cebrian, Juan; Natvig, Lasse. (2016) Transient Temperature Prediction for Aging Thermal Sensors Using Artificial Neural Network. Academic chapter/article/Conference paper Bjørnseth, Benjamin Andreassen; Meyer, Jan Christian; Natvig, Lasse. (2016) Study of Xeon Phi Performance of a Molecular Dynamics Proxy Application. PRACE - Partnership for Advanced Computing in Europe PRACE - Partnership for Advanced Computing in Europe Report Bjørnseth, Benjamin Andreassen; Djupdal, Asbjørn; Natvig, Lasse. (2016) A Systematic Approach to Automated Construction of Power Emulation Models. Academic chapter/article/Conference paper 2015 Hasib, Abdullah Al; Cebrian, Juan; Natvig, Lasse. (2015) V-PFORDelta: Data Compression for Energy Efficient Computation of Time Series. Academic chapter/article/Conference paper Hasib, Abdullah Al; Nikitin, Nikita; Natvig, Lasse. (2015) Cost-comfort balancing in a smart residential building with bidirectional energy trading. Academic chapter/article/Conference paper Iordan, Alexandru Ciprian; Jahre, Magnus; Natvig, Lasse. (2015) Tuning the victim selection policy of Intel TBB. Journal of systems architecture Academic article Cebrian, Juan; Jahre, Magnus; Natvig, Lasse. (2015) ParVec: vectorizing the PARSEC benchmark suite. Computing Academic article 2014 Cebrian, Juan; Jahre, Magnus; Natvig, Lasse. (2014) Optimized Hardware for Suboptimal Software: The Case for SIMD-aware Benchmarks. Academic chapter/article/Conference paper Iordan, Alexandru Ciprian; Jahre, Magnus; Natvig, Lasse. (2014) Victim Selection Policies for Intel TBB: Overheads and Energy Footprint. Academic chapter/article/Conference paper Eleyat, Mujahed Omar Qasim; Natvig, Lasse. (2014) Accelerating the Regina Network Flow Simulator on Multi-core Systems. Norges teknisk-naturvitenskapelige universitet Doctoral Theses at NTNU, 1503-8181 (262) Doctoral dissertation 2013 Iordan, Alexandru Ciprian; Jahre, Magnus; Natvig, Lasse. (2013) On the Energy Footprint of Task Based Parallel Applications. Academic chapter/article/Conference paper Hasib, Abdullah Al; Natvig, Lasse. (2013) Performance Optimization and Evaluation of a Data Cleansing Algorithm on Multicore Processors. Academic chapter/article/Conference paper Cebrian, Juan; Natvig, Lasse; Meyer, Jan Christian. (2013) Performance and energy impact of parallelization and vectorization techniques in modern microprocessors. Computing Academic article Meyer, Jan Christian; Cebrian, Juan; Natvig, Lasse; Karakasis, Vasileios; Siakavaras, Dimitris; Nikas, Konstantinos. (2013) Energy-Efficient Sparse Matrix Autotuning with CSX -- A Trade-off Study. Academic chapter/article/Conference paper Iordan, Alexandru Ciprian; Jahre, Magnus; Natvig, Lasse. (2013) Challenges of Reducing Cycle-Accurate Simulation Time for TBP Applications. Procedia Computer Science Academic article Cebrian, Juan; Natvig, Lasse. (2013) Temperature effects on on-chip energy measurements. Academic chapter/article/Conference paper Meyer, Jan Christian; Natvig, Lasse. (2013) Power instrumentation of task-based applications using model-specific registers on the Sandy Bridge architecture. PRACE - Partnership for Advanced Computing in Europe PRACE - Partnership for Advanced Computing in Europe Report Nikas, Konstantinos; Siakavaras, Dimitris; Karakasis, Vasileios; Meyer, Jan Christian; Natvig, Lasse. (2013) An Energy-centric Study of Conjugate Gradient Method. PRACE - Partnership for Advanced Computing in Europe PRACE - Partnership for Advanced Computing in Europe Report Meyer, Jan Christian; Martinsen, Thomas B; Natvig, Lasse. (2013) Implementation of an Energy-Aware OmpSs Task Scheduling Policy. PRACE - Partnership for Advanced Computing in Europe PRACE - Partnership for Advanced Computing in Europe Report Meyer, Jan Christian; Natvig, Lasse; Karakasis, Vasileios; Siakavaras, Dimitris; Nikas, Konstantinos. (2013) Energy-efficient Sparse Matrix Auto-tuning with CSX. PRACE - Partnership for Advanced Computing in Europe PRACE - Partnership for Advanced Computing in Europe Report Hasib, Abdullah Al; Kjeldsberg, Per Gunnar; Natvig, Lasse. (2013) Performance and Power Efficiency Analysis of Data Reuse Transformation Methodology on Multicore Processor. Lecture Notes in Computer Science (LNCS) Academic article 2012 Eleyat, Mujahed Omar Qasim; Haugland, Dag; Hetland, Magnus Lie; Natvig, Lasse. (2012) Parallel algorithms for the maximum flow problem with minimum lot sizes. Academic chapter/article/Conference paper Lien, Hallgeir; Natvig, Lasse; Hasib, Abdullah Al; Meyer, Jan Christian. (2012) Case Studies of Multi-core Energy Efficiency in Task Based Programs. Lecture Notes in Computer Science (LNCS) Academic article Eleyat, Mujahed Omar Qasim; Natvig, Lasse. (2012) IPM based sparse LP solver on a heterogeneous processor. Computational Management Science Academic article Iordan, Alexandru Ciprian; Jahre, Magnus; Natvig, Lasse. (2012) Towards Efficient Simulation of Task Based Parallel Applications. Academic chapter/article/Conference paper Cebrian, Juan; Natvig, Lasse; Meyer, Jan Christian. (2012) Improving Energy Efficiency through Parallelization and Vectorization on Intel Core i5 and i7 Processors. Academic chapter/article/Conference paper 2011 Eleyat, Mujahed; Natvig, Lasse; Amundsen, Jørn Aslak. (2011) Cache-Aware Matrix Multiplication on Multicore Systems for IPM-based LP Solvers. Academic chapter/article/Conference paper Natvig, Lasse; Iordan, Alexandru Ciprian. (2011) Green Computing: Saving Energy by Throttling, Simplicity and Parallelization. UPGRADE : The European Journal for the Informatics Professional Academic article Grannæs, Marius; Jahre, Magnus; Natvig, Lasse. (2011) Storage Efficient Hardware Prefetching using Delta-Correlating Prediction Tables. Journal of Instruction-Level Parallelism Academic article Grannæs, Marius; Jahre, Magnus; Natvig, Lasse. (2011) Exploring the Prefetcher/Memory Controller Design Space: An Opportunistic Prefetch Scheduling Strategy. Lecture Notes in Computer Science (LNCS) Academic article 2010 Grannæs, Marius; Jahre, Magnus; Natvig, Lasse. (2010) Multi-level Hardware Prefetching Using Low Complexity Delta Correlating Prediction Tables with Partial Matching. Academic chapter/article/Conference paper Eleyat, Mujahed; Natvig, Lasse. (2010) Implementation of a Linear Programming Solver on the Cell BE Processor. Procedia Computer Science Academic article Eleyat, Mujahed; Natvig, Lasse. (2010) Mixed-Precision Parallel Linear Programming Solver. Academic chapter/article/Conference paper Jahre, Magnus; Grannæs, Marius; Natvig, Lasse. (2010) DIEF: An Accurate Interference Feedback Mechanism for Chip Multiprocessor Memory Systems. Lecture Notes in Computer Science (LNCS) Academic article Iordan, Alexandru Ciprian; Natvig, Lasse. (2010) Energy Efficient Methods for Multi-Core Programming. Academic chapter/article/Conference paper Grannæs, Marius; Jahre, Magnus; Natvig, Lasse. (2010) Multi-level Hardware Prefetching Using Low Complexity Delta Correlating Prediction Tables with Partial Matching. Lecture Notes in Computer Science (LNCS) Academic article Jahre, Magnus; Natvig, Lasse. (2010) Managing Shared Resources in Chip Multiprocessor Memory Systems. Norges teknisk-naturvitenskapelige universitet Doktoravhandlinger ved NTNU, 1503-8181 (2010:159) Doctoral dissertation Jahre, Magnus; Natvig, Lasse. (2010) Computational Computer Architecture Research at NTNU. ERCIM News Article in business/trade/industry journal 2009 Natvig, Lasse; Sindre, Guttorm; Djupdal, Asbjørn. (2009) A Compulsory Yet Motivating Question/Answer Game to Teach Computer Fundamentals. Computer Applications in Engineering Education Academic article Sindre, Guttorm; Natvig, Lasse; Jahre, Magnus. (2009) Experimental Validation of the Learning Effect for a Pedagogical Game on Computer Fundamentals. IEEE Transactions on Education Academic article Jahre, Magnus; Natvig, Lasse. (2009) A High Performance Adaptive Miss Handling Architecture for Chip Multiprocessors. Lecture Notes in Computer Science (LNCS) Academic article Jahre, Magnus; Grannæs, Marius; Natvig, Lasse. (2009) A Quantitative Study of Memory System Interference in Chip Multiprocessor Architectures. Academic chapter/article/Conference paper Benkner, Siegfried; Mehofer, Eduard; Pllana, Sabri; Natvig, Lasse; Xafa, Fatos. (2009) Towards an Intelligent Environment for Programming Multi-core Computing Systems. Lecture Notes in Computer Science (LNC",
  "content_length": 30886,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:34"
}