{
  "name": "Laurence Tratt",
  "homepage": "https://www.kcl.ac.uk/people/laurence-tratt",
  "status": "success",
  "content": "Laurence Tratt | King's College London Skip to main contentProfessor Laurence Tratt Professor of Software DevelopmentResearch interestsComputer scienceContact details+44 020 7848 7997laurence.tratt@kcl.ac.ukBiographyLaurence Tratt is Professor of Software Development in the Department of Informatics at King’s College London, and is also the Shopify / Royal Academy of Engineering Research Chair in Language Engineering. His work centres around programming languages, spanning areas from optimisation to measurement to security to flexibility. His research group is known for its open-source contributions, maintaining a number of widely used libraries and utilities. Laurence maintains a widely read blog, which explains technical and research matters in an accessible manner. Research Interests Programming language design and implementation Domain specific languages PhD supervison Current PhD / job openings Public engagement Computerphile - Just In Time (JIT) Compilers Computerphile - Garbage Collection (Mark & Sweep) Computerphile - Coding a Web Server in 25 Lines Further Information Research Profile Research Funding Personal Website PublicationsResearchResearchSoftware SystemsThe group studies design, modelling and engineering of software systems.NewsNews17 May 2022Royal Academy of Engineering/Shopify Research ChairProfessor Laurence Tratt appointed as Research ChairTechnology & SciencePublicationsResearchNewsResearchSoftware SystemsThe group studies design, modelling and engineering of software systems.News17 May 2022Royal Academy of Engineering/Shopify Research ChairProfessor Laurence Tratt appointed as Research ChairTechnology & Science(N)7.05Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 1809,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:53"
}