{
  "name": "Laurent Lefèvre",
  "homepage": "http://perso.ens-lyon.fr/laurent.lefevre",
  "status": "success",
  "content": "Laurent Lefevre Page - Laurent Lefevre Web Page all pictures Laurent Lefèvre Permanent senior researcher at Inria (The French Institute for Research in Computer Science) Member of the AVALON Team of LIP Member of Inria AVALON Team of Inria Rhône-Alpes Université de Lyon UMR 5668 CNRS, ENS, Inria, UCB Address: Inria Avalon Team / LIP Laboratory Ecole Normale Supérieure de Lyon 46, allée d'Italie - 69364 Lyon Cedex 07 - France Email : laurent.lefevre@ens-lyon.fr, laurent.lefevre@inria.fr Web : http://perso.ens-lyon.fr/laurent.lefevre Research interests:Reducing environmental impacts of large scale distrbuted systems, Digital sufficiency, Green and Energy Efficient Computing and Networking, Green IT, Sustainability in IT, Cloud and Cluster computing, High performance computing, Software Defined Networks, Autonomic Networking, High Performance Networks protocols and services, Active and programmable networks and services, Disruption Tolerant Networks, Distributed shared memory systems and Data consistency EcoInfo Member \"Exploring the multiple facets of digital sufficiency for reducing direct and indirect impacts of computing and communicating infrastructures and services.\" Since 1/11/2001, I am a Permanent Researcher in computer science at Inria. I work in the AVALON (Algorithms and Software Architectures for Service Oriented Platforms) team from Inria and the LIP Laboratory in Ecole Normale Superieure de Lyon. From 1/11/01 to 31/12/12, I was member of RESO (High Performance Networks, Protocols and Services) team from Inria and the LIP Laboratory in Ecole Normale Superieure de Lyon. From 1/11/01 to 31/12/02, I was a permanent INRIA researcher in \" RESAM Laboratory (High Performance Networks and Multimedia Application Support\" in Lyon, France and also member of INRIA RESO Team. From 1/11/97 to 30/10/2001, I was assistant professor in computer science in Lyon 1 University and also member of RESAM Laboratory. How to find me ? Research activities PhD and Habilitation Research projects : current and completed projects Advising of PhD Students, Postdocs, Engineers, Graduate, Master students Software diffusion Conferences, Workshops, Schools and Booths Organization Steering Comittees and Program Comittees PhD Juries Books edition Books, Proceedings, Special Issues edition Publications : Patents, Book chapters, International Journals, International Conferences, Workshops, French Conferences, General Audience Papers and French Events, Research and technical reports, Posters Interviews for journal, radio and newsletters Portals Seminars, invited talks and panels participation Recent Teaching Activities and practical sessions",
  "content_length": 2659,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:56"
}