{
  "name": "Laurent El Ghaoui",
  "homepage": "https://vinuni.edu.vn/people/laurent-el-ghaoui-phd-2",
  "status": "success",
  "content": "Laurent El Ghaoui - VinUni Home Laurent El Ghaoui Laurent El Ghaoui, PhD VinUniversity Vice Provost of Research & Innovation Center for Environmental Intelligence Director College of Engineering and Computer Science Dean Biography Laurent El Ghaoui obtained his PhD at Stanford University in 1990, and held appointments at the Ecole National Superieure de Techniques Avancees (ENSTA, now part of Institut Polytechnique de Paris) and University de Paris La Sorbonne. In 1999, he joined the EECS department at UC Berkeley, where he became full professor, with appointments in IEOR and the Haas Business School. An expert in optimization and machine learning, he co-authored several books (including “Financial data Science” with Cambridge University Press) and more than a hundred of publications, with more than 60,000 citations on Google Scholar. In 2022, he joined VinUniversity in Vietnam, as Vice-Provost of Research and Innovation and Dean of Engineering and Computer Sciences. Laurent is also a co-founder of Kayrros SAS, which develops environmental intelligence solutions. Research Interests Operations Research, Robust Optimization, New computational models and algorithms for deep learning, Machine learning and statistics, with emphasis on sparsity issues. Selected Publications Fangda Gu, Laurent El Ghaoui, Guillaume Darmet. Grid Topology Estimation in Electrical Markets with Diagonally Dominant Laplacian. Submitted to 2021 IEEE PES Innovative Smart Grid Technologies Europe (ISGT Europe 2021), April 2021. Laurent El Ghaoui, Fangda Gu, Bertrand Travacca, Armin Askari. Implicit Deep Learning. Posted on Arxiv, and submitted to SIAM J. Mathematics of Data Science, February 2021. Armin Askari, Alexandre d’Aspremont, Laurent El Ghaoui. Naive Feature Selection: Sparsity in Naïve Bayes. Posted on Arxiv, and submitted to SIAM J. Mathematics of Data Science, March 2021. Calafiore, G.C., El Ghaoui, L., Preziosi, A. and Russo, L., 2017. Topic analysis in news via sparse learning: a case study on the 2016 US Presidential Elections. IFAC-PapersOnLine, 50(1), pp.13593-13598. Pauphilet, Jean, Diego Kiner, Damien Faille, and Laurent El Ghaoui. A tractable numerical strategy for robust MILP and application to energy management. In 2016 IEEE 55th Conference on Decision and Control (CDC), pp. 1490-1495. Mert Pilanci, Martin Wainwright, Laurent El Ghaoui. Sparse learning via Boolean relaxations. In Math Programming, Series B, (2015), 151:63-87. L. El Ghaoui, V. Pham, G.-C. Li, V.-A. Duong, A. Srivastava, and K. Bhaduri. Understanding Large Text Corpora via Sparse Machine Learning. Jour. Statistical Anal. & Data Mining, to appear. Short version in Proc. Conference on Intelligent Data Understanding, October 2011. Mert Pilanci, Laurent El Ghaoui, and Venkat Chandrasekaran. Recovery of sparse probability measures via convex programming. In Proc. Conf. Neural Information and Processing Systems, December 2012. Y. Zhang and L. El Ghaoui. Large-scale sparse principal component analysis and application to text data. Proc. NIPS, 2011. Education 1990: Doctor of Aeronautics and Astronautics, Stanford University 1986: Master of Automatic Control, Sup’Aéro, France 1985: Bachelor of Science in Maths and Physics, Ecole Polytechnique, France Selected Awards & Honors Bronze Medal for Engineering Sciences, Centre National de la Recherche Scientifique, France, 1999. Okawa Foundation Research Grant, 2001. NSF Career Award, 2002. SIAM optimization Prize for best paper in 2004-2007. Other Activities 2012-present: Development and instructor for the course “Financial Data Science” in the Master of Financial Engineering, Haas Business School, UC Berkeley. 2018-present: Principal investigator in the “Tsinghua-Berkeley Shenzhen Institute”, involving about 20 faculty from UC Berkeley; I am currently only involved in recruiting efforts by the Institute. 2017-present: Development of an interactive textbook on optimization. The platform is not active at the moment, a companion hyper-textbook is at https://inst.eecs.berkeley.edu/~ee127/sp21/livebook/. 2012: Development of a short course on Robust Optimization, presented at the workshop on advances in optimization, Zinal. 2011-2017: Founding member, Berkeley Center for New Media, UC Berkeley. Session chair at many conferences (Int. Symposium Math. Programming, CDC, ACC). Organizer, workshop on robust optimization, Institute for Pure and Applied Mathematics, UCLA, September 2010 2013-present: Invited talks at Twitter, Exxon, Walmart, EDF, GE, Google, Amazon, Bay Learn, Voleon, and many other companies and institutions. Bay Area Optimization workshop, April 2016. Plenary talk, INFORMS, July 2015.",
  "content_length": 4667,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:07"
}