{
  "name": "Laurent Itti",
  "homepage": "http://ilab.usc.edu/itti",
  "status": "success",
  "content": "Laurent Itti's Home Page Laurent Itti's Home Page Laurent Itti Professor of computer science, psychology and neuroscience University of Southern California Viterbi School of Engineering, Computer Science Department Hedco Neuroscience Building, Room 07A 3641 Watt Way Los Angeles, CA 90089-2520 - USA Tel/Fax: +1 213 740 3527 / 5687 Email: itti@pollux.usc.edu Education Ph.D., California Institute of Technology, Computation and Neural Systems, Pasadena, California - 2000 M.S., Ecole Nationale Supérieure des Télécommunications, Paris, France - 1994 B.S., Mathématiques Supérieures et Spéciales M', Tours, France - 1991 Experience Professor of Computer Science, University of Southern California, Los Angeles - 12/2013 - present Associate Professor of Computer Science, University of Southern California, Los Angeles - 5/2006 - 11/2013 Assistant Professor of Computer Science, University of Southern California, Los Angeles - 9/2000 - 5/2006 Voting faculty member, USC Neuroscience Graduate Program - 6/2002 - present Faculty member, USC Neuroscience Graduate Program - 10/2001 - 6/2002 Adjunct assistant professor of Psychology, USC - 11/2000 -- present Postdoc in Neuroimaging Research, Harbor-UCLA Medical Center, Torrance, California - 1/2000 - 8/2000 Neuroimaging Research Associate, Harbor-UCLA Medical Center, Torrance, California - 1993 - 1998 Calendar See http://iLab.usc.edu/itti/calendar.html to check my availabilities. Research See http://iLab.usc.edu/research/ Publications See http://iLab.usc.edu/publications/ Teaching See http://iLab.usc.edu/classes/ Software See http://iLab.usc.edu/toolkit/ Miscellaneous Want to get the most of your Blackberry? Check out my Blackberry+IMAP integration page. Neurobiology of Attention - everything you have always wanted to know about attention. Top 100 papers in Vision Science - everyone should read these. [Home] - [Research] - [Publications] - [People] - [Facilities] - [Classes] - [Opportunities] - [Events] Copyright © 2005 by the University of Southern California, iLab and Prof. Laurent Itti",
  "content_length": 2052,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:56"
}