{
  "name": "Laura Morán-Fernández",
  "homepage": "https://pdi.udc.es/en/File/Pdi/B439H",
  "status": "success",
  "content": "Laura Morán Fernández File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Laboratorio de Investigación y Desarrollo en Inteligencia Artificial Research lines Feature selection, Machine learning, Green Artificial Intelligence Teaching merits evaluation 1 five years period(s) Research merits evaluation 1 six years period(s) Contacto UDC directory Orcid id0000-0001-6703-1846 ResearcherIDI-7902-2018 Scopus57205359013 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 6.66 Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 42 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 28 Knowledge Representation and Reasoning Degree in Artificial Intelligence Compulsory 0 40 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 9 Large-Scale Artificial Intelligence Degree in Artificial Intelligence Optional 0 6 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 2 Programming II Degree in Computer Engineering Programa de Simultaneidad del Grado en Ingeniería Informática y Grado en Ciencia e Ingeniería de Datos Core 0 44 Subject and involved studies Type Distance hours Total hours Computer Science Automation and Industrial Electronics Engineering Degree in Electrical Engineering Industrial Engineering Core 0 30 Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 4 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 1.5 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2.5 Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 42 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 42 Knowledge Representation and Reasoning Degree in Artificial Intelligence Compulsory 0 40 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 9 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 5.5 Programming II Degree in Computer Engineering Core 0 47 Subject and involved studies Type Distance hours Total hours Computer Science Automation and Industrial Electronics Engineering Degree in Electrical Engineering Industrial Engineering Core 0 30 Computer Science Preliminaries Degree in Computer Engineering Core 0 10 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 0.5 Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 28 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 42 Knowledge Representation and Reasoning Degree in Artificial Intelligence Compulsory 0 40 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 9 Programming II Degree in Computer Engineering Core 0 48 Subject and involved studies Type Distance hours Total hours Computer Science Automation and Industrial Electronics Engineering Degree in Electrical Engineering Industrial Engineering Core 0 30 Computer Science Preliminaries Degree in Computer Engineering Core 0 10 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 49 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 6 Programming II Degree in Computer Engineering Core 0 77 Software Design Degree in Computer Engineering Compulsory 0 53 Subject and involved studies Type Distance hours Total hours Computer Science Automation and Industrial Electronics Engineering Degree in Electrical Engineering Industrial Engineering Core 0 30 Computer Science Preliminaries Degree in Computer Engineering Core 0 10 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Programming II Degree in Computer Engineering Core 0 110 Software Design Degree in Computer Engineering Compulsory 0 63 Subject and involved studies Type Distance hours Total hours Computer Science Automation and Industrial Electronics Engineering Degree in Electrical Engineering Industrial Engineering Core 0 30 Computer Science Preliminaries Degree in Computer Engineering Core 0 12 Programming II Degree in Computer Engineering Core 0 98 Software Design Degree in Computer Engineering Compulsory 0 90 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Tuesday 15:30 a 16:30 D3.12 (Área Científica) 1st quarter Wednesday 12:30 a 14:30 D3.12 (Área Científica) 1st quarter Thursday 15:30 a 16:30 D3.12 (Área Científica) EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2022/2023 2020/2021 2019/2020 Development and evaluation of AI technologies to combat hate speech and discrimination in social networks Development of a computational model to predict the toxicity of nanoparticles based on physicochemical factors Feature selection in federated environments for IoT devices Ethical and technical challenges in combating algorithmic discrimination and systemic bias Synopsis-based feature extraction for movie genre classification Distributed classification on the edge Federated feature selection based on mutual information Mutual Information and Conditional Mutual Information based low-precision feature selection on microarray and wearable data New feature selection methods for wearable devices Less is more: studying the impact of feature selection Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Papers in research journals Book chapters Conference papers 2024 2022 2019 Funding entity AEI, Agencia Estatal de Investigación Main researches Colina Garea, Rafael (IP1)/ Quintáns Eiras, María Del Rocío (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Berta Guijarro Berdiñas (IP1) / Amparo Alonso Betanzos (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Consellería de Educación Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity Ministerio de Ciencia e Innovación Main researches Francisco Javier Bellas Bouza (IP1) / Óscar Fontenla Romero (IP2) Type Proyecto Programas Nacionales Dates From 01/12/2022 to 30/11/2024 Funding entity Ministerio de Ciencia e Innovación Main researches Verónica Bolón Canedo Type Proyecto Programas Nacionales Dates From 01/12/2022 to 30/11/2024 Funding entity Red.es Main researches José Luis Calvo Rolle ; Óscar Fontenla Romero Type Proyecto Programas Nacionales Dates From 01/09/2022 to 30/04/2024 Funding entity INSTITUTO DE LA MUJER. MINISTERIO DE IGUALDAD Main researches María Teresa Piñeiro Otero Type Proyecto Otros Programas Dates From 01/01/2022 to 31/12/2023 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 2025 2024 2023 2022 2020 ... 2019 2017 Authors Javier Ortega-Morla, Antonio José Leis Iglesias, Alma Mallo, Laura Morán-Fernández, Sara Guerreiro-Santalla, Alejandro Paz-Lopez, Beatriz Pérez-Sánchez, Noelia Sánchez-Maroño, Alejandro Rodríguez-Arias, Óscar Fontenla-Romero, Francisco Bellas Journal IEEE Transactions on Learning Technologies Vol. 18 (pages 783 to 797) DOI https://doi.org/10.1109/tlt.2025.3598041 Authors Samuel Suárez-Marcote, Laura Morán-Fernández, V. Bolón-Canedo Journal EXPERT SYSTEMS Vol. 42 Authors Verónica Bolón-Canedo, Laura Morán-Fernández, B. Cancela, Amparo Alonso-Betanzos Journal Neurocomputing Authors Samuel Suárez-Marcote, Laura Morán-Fernández, V. Bolón-Canedo Journal Neurocomputing Authors Eva Blanco-Mallo, Laura Morán-Fernández, Verónica Bolón-Canedo, Beatriz Remeseiro Journal Pattern Recognition Vol. 141 (pages 109646 to 109646) DOI https://doi.org/10.1016/j.patcog.2023.109646 Authors Laura Morán-Fernández, Verónica Bolón-Canedo Journal JOURNAL OF INTELLIGENT INFORMATION SYSTEMS DOI https://doi.org/10.1007/s10844-023-00823-y Authors Laura Morán-Fernández, Verónica Bolón-Canedo, Guillermo Castillo-García Journal Neurocomputing DOI https://doi.org/10.1016/j.neucom.2023.126422 Authors Laura Morán-Fernández, Verónica Bolón-Canedo, Amparo Alonso-Betanzos Journal Neurocomputing Vol. 470 (pages 365 to 375) Authors Juan-Agustín Hitar-García, Laura Morán-Fernández, Verónica Bolón-Canedo Journal IEEE Transactions on Games DOI https://doi.org/10.1109/tg.2022.3153086 Authors Laura Morán-Fernández, Verónica Bolón-Canedo, Amparo Alonso-Betanzos Journal MEDICAL & BIOLOGICAL ENGINEERING & COMPUTING Vol. 60 (pages 1333 to 1345) DOI https://doi.org/10.1007/s11517-022-02508-0 Authors Laura Morán-Fernández, Konstantinos Sechidis, Verónica Bolón-Canedo, Amparo Alonso-Betanzos, Gavin Brown Journal Knowledge-Based Systems Vol. 197 DOI https://doi.org/10.1016/j.knosys.2020.105885 Authors Pablo Montero-Manso, Laura Morán-Fernández, Verónica Bolón-Canedo, José A. Vilar, Amparo Alonso-Betanzos Journal Information Sciences Vol. 496 (pages 431 to 450) Authors Laura Morán-Fernández, Verónica Bolón-Canedo, A",
  "content_length": 13996,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:48"
}