{
  "name": "Laura Edelson",
  "homepage": "https://lauraedelson.com",
  "status": "success",
  "content": "Laura Edelson Laura Edelson Laura Edelson is an Assistant Professor of Computer Science at Northeastern University. Her research focuses on the understanding the spread of harmful content on large online networks and using user data donation to understand social media algorithmic systems. Her work has been covered in the New York Times, the Wall Street Journal, and the Washington Post, and she has written about the need for transparency about social media algorithms in opinion writing for Scientific American and the New York Times. She is the co-Director of Cybersecurity for Democracy and the former Chief Technologist of the Antitrust Division and the Civil Rights Division of the Department of Justice. Selected Papers Into the Driver's Seat With Social Media Content Feeds Knight First Amendment Institute Occasional Paper Series. Laura Edelson, Frances Haugen, and Damon McCoy Captured Innovation: Technology Monopoly Response to Transformational Development The University of Chicago Business Law Review. Reed Showalter and Laura Edelson Audit of Facebook’s Political Ad Policy Enforcement USENIX Security 2022. Victor LePochat, Laura Edelson, Tom Van Goethem, Wouter Joosen, Damon McCoy, and Tobias Lauinger A Standard for Universal Digital Ad Transparency 2021. Knight First Amendment Institute Occasional Papers Series. Laura Edelson, Jason Chuang, Erika Franklin-Fowler, Michael Franz, and Travis Ridout. Engagement with US (Mis)information News Sources on Facebook Proceedings of the 21st ACM Internet Measurement Conference (IMC). Laura Edelson, Minh-Kha Nguyen, Ian Goldstein, Oana Goga, Damon McCoy, Tobias Lauinger. A Security Analysis of the Facebook Advertising Library IEEE Symposium on Security and Privacy (S&P) 2021, Laura Edelson, Tobias Lauinger and Damon McCoy. Selected Other Writings We Need Product Safety Regulations for Social Media Nov. 2023. Scientific American. It’s Time to Open the Black Box of Social Media Apr. 2022. Scientific American. With Reneé DiResta, Brendan Nyhan, and Ethan Zuckerman. Platform Transparency Legislation: The Whos, Whats and Hows Apr. 2022. Lawfare. We Research Misinformation on Facebook. It Just Disabled Our Accounts Aug. 2021. New York Times. With Damon McCoy. CV Download Here",
  "content_length": 2247,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:40"
}