{
  "name": "Laura M. Haas",
  "homepage": "https://www.cics.umass.edu/about/directory/laura-haas",
  "status": "success",
  "content": "Laura Haas : Manning College of Information & Computer Sciences : UMass Amherst Skip to main content The University of Massachusetts Amherst Image Laura Haas Professor (On leave through Spring 2026) Contact lmhaas [at] cs [dot] umass [dot] edu (413) 545-2572 Location Room E441 Computer Science Laboratories 130 Governors Drive Amherst, MA 01003 United States Research Areas Data Management About Laura Haas is a Professor in the Manning College of Information and Computer Sciences at the University of Massachusetts Amherst, joining the university in 2017 after a distinguished career at IBM. At IBM, she held positions including IBM Fellow and Director of IBM Research's Accelerated Discovery Lab (2011–2017), Director of Computer Science at IBM's Almaden Research Center (2005–2011), and head of IBM Research's worldwide exploratory science program (2009–2013). She led the Information Integration Solutions architecture and development teams within IBM's Software Group (2001–2005) following her service as a research staff member and manager at Almaden. Dr. Haas is renowned for her contributions to database systems, notably the Starburst query processor (the foundation for DB2 LUW), Garlic, a pioneering system for integrating heterogeneous data sources, and Clio, the first semi-automatic tool for heterogeneous schema mapping. Professor Haas served as the first permanent Dean of Manning CICS, overseeing significant growth in both size and stature, substantial increases in faculty and student diversity, the design and construction of a new academic building, and raising over $100 million in funding from government, industry, and private philanthropy, including the transformative Manning endowment. She spearheaded numerous initiatives in quantum computing, robotics, and public interest technology, as well as launching the Strategic Partnership Program and the Massenberg Summer STEM Institute. She takes particular pride in expanding student support services, student organizations, and establishing the Manning Undergraduate Student Impact Committee (MUSIC). Dr. Haas's honors include the Anita Borg Institute Technical Leadership Award, ACM SIGMOD Edgar F. Codd Innovation Award, IEEE Computer Society Computer Pioneer Award, and several prestigious IBM awards, including a Corporate Award for information integration technology. Her leadership roles include Vice President of the VLDB Endowment Board of Trustees (2004–2009), board member of the Computing Research Association (2007–2016, Vice Chair 2009–2015), and Chair of the National Academies' Computer Science and Telecommunications Board, where she has served since 2013. She is an ACM Fellow, a member of the National Academy of Engineering, a Fellow of the American Academy of Arts and Sciences, and a member of the IBM Academy of Technology. Primary research Lab DREAM Lab (Data systems Research for Exploration, Analytics, and Modeling) Education PhD, Computer Science, University of Texas at Austin, 1981 AB, Computer Science, Harvard University, 1978 Laura Haas in the News No results were found. For better results, try using different keywords, checking for typos, or adjusting your filters. Clear all filters Global footer ©2025 University of Massachusetts Amherst Site policies Privacy Non-discrimination notice Accessibility Terms of use",
  "content_length": 3327,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:45"
}