{
  "name": "Laurens Boer",
  "homepage": "https://pure.itu.dk/portal/en/persons/laurens-boer(25a5a0d6-404b-419c-9502-b246525617a2).html",
  "status": "success",
  "content": "Laurens Boer - IT-University of Copenhagen Laurens Boer public CV Laurens Boer Associate Professor, Human-Computer Interaction and DesignIxD LabHead of Programme, MSc in Digital Design and Interactive Technologies https://orcid.org/0000-0001-9723-5516 Emaillaubitudk 20112024 Research activity per year Personal profile KeywordsCritical designDesign ethnographyDesign interventionDesign researchExperience designFormgivingInteraction designMaterial computingPrototypingQualitative methodsSpeculative designWelfare technologyFuteres Fingerprint Dive into the research topics where Laurens Boer is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Interaction Design Computer Science 100% Design Researcher Computer Science 73% Design Practice Computer Science 65% Participatory Innovation Keyphrases 62% Human-Computer Interaction Computer Science 57% Design Researchers Keyphrases 54% Provotype Keyphrases 53% Design Research Computer Science 49% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2011 2011 2015 2016 2017 2019 2020 2022 2024 2024 32 Article in proceedings 7 Journal article 2 Paper 1 Conference abstract in proceedings 2 More 1 Conference article 1 PhD thesis Research output per year Research output per year A Playground for Soft Robot DesignBoer, L. & Bewley, H., 1 Jul 2024, In: Proceedings of the 2024 ACM Designing Interactive Systems Conference. p. 294-296 3 p.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open AccessFile Soft Robot 100% Robot Design 100% Design Researchers 100% Design Researcher 100% robot design 100% Exploring app-based affective interactions for people with rheumatoid arthritisKühn, L., Boer, L. & Fritsch, J., 23 Jun 2024, Proceedings of DRS2024. 27 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Healthcare Technology 100% App-based 100% Rheumatoid Arthritis 100% Human-Computer Interaction 50% Design Researcher 50% Mapping Futures and Futuring in HCI/DesignJenkins, T., Tsaknaki, V., Boer, L., Kun, P., Howell, N., Wong, R., Campo Woytuk, N. & Søndergaard, M. L. J., 1 Jul 2024, Proceedings of the Designing Interactive Systems Conference 2024. Association for Computing Machinery, p. 458-461 4 p.Research output: Conference Article in Proceeding or Book/Report chapter › Conference abstract in proceedings › Research › peer-review Open AccessFile HCI Design 100% Human-Computer Interaction 100% Design Artefacts 50% Geographical Location 50% Design Researchers 50% Fabulating Futures for Flourishing and Vibrant WorldsJenkins, T., Juul Søndergaard, M. L., Sanches, P., Tsaknaki, V., Campo Woytuk, N., Howell, N., Helms, K., Boer, L. & Tucker, J., 2023, The 10th Nordic Design Research Society (Nordes) Conference. Design Research SocietyResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Fabulation 100% Design Research 33% Feminist Technoscience 33% Exploratory Practice 33% More-than-human 33% BGM Diary: Supporting Subjective Experience in Blood Glucose Management TrainingBoer, L., Heiselberg, K. & Bewley, H., 13 Jun 2022, Designing Interactive Systems Conference. Association for Computing Machinery, p. 1849 - 1862 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Subjective Experience 100% Diary 100% Blood Glucose Management 100% Management Training 100% Blood Glucose Monitoring 100% View all 44 research outputs Projects Projects per year 2016 2016 2023 2024 2 Finished Projects per year IoT: Internet of Things i produktion og værkstedVallgårda, A. (PI) & Boer, L. (CoI)Innovationsnetværk for IT - InfinIT01/01/2016 → 31/05/2016Project: Research NORDICFAB: Speculating and intervening in Nordic Technological Wellbeing ImaginariesTsaknaki, V. (PI), Boer, L. (CoI) & Jenkins, T. (CoI)NordForsk01/01/2023 → 31/12/2024Project: Research Imaginaries 100% Well-being 100% Speculating 100% Fabulation 100% Occupational Career 100% Activities Activities per year 2024 2024 2024 1 Membership in review committee Activities per year Hiring committee for recruitment of Associate Professor in Interaction Design (Event)Malmborg, L. (Chair), Fritsch, J. (Member) & Boer, L. (Member)Feb 2024 → Jun 2024Activity: Membership types › Membership in review committee",
  "content_length": 4897,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:54"
}