{
  "name": "Laurent Doyen 0001",
  "homepage": "http://www.lsv.ens-cachan.fr/~doyen/publications.html",
  "status": "success",
  "content": "Laurent Doyen: Publications by Year Laurent Doyen: Publications by Year [ BibTex List] DBLP entries Co-authors 2025 Laurent Doyen, Pranshu Gaba, and Shibashis Guha. Expectation in Stochastic Games with Prefix-independent Objectives. To appear in Proceedings of the 36th International Conference on Concurrency Theory (CONCUR), LIPIcs, Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, vol. 348, pp. 16:1-16:19, 2025. [ pdf] Krishnendu Chatterjee, Laurent Doyen, Jean-François Raskin, Ocan Sankur. The Value Problem for Multiple-Environment MDPs with Parity Objective. Proceedings of the 52nd International Colloquium on Automata, Languages and Programming (ICALP), LIPIcs, Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, vol. 334, pp. 150:1-150:17, 2025. [ pdf] [Full version] Laurent Doyen, Pranshu Gaba, and Shibashis Guha. Stochastic Window Mean-Payoff Games. Logical Methods in Computer Science 21(2), 2025. [ pdf] Laurent Doyen. Top-Down Complementation of Automata on Finite Trees. Information Processing Letters 187:106499, Elsevier, 2025. [ pdf] 2024 Krishnendu Chatterjee and Laurent Doyen. Stochastic Processes with Expected Stopping Time. Logical Methods in Computer Science 20(4)11:1-11:34, 2024. [ pdf] Laurent Doyen and Thomas Soullard. Regular Games with Imperfect Information Are Not That Regular. Proceedings of the 35th International Conference on Concurrency Theory (CONCUR), LIPIcs, Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, vol. 311, pp. 23:1-23:19, 2024. [ pdf] Laurent Doyen, Pranshu Gaba, and Shibashis Guha. Stochastic Window Mean-Payoff Games. Proceedings of the 27th International Conference on Foundations of Software Science and Computation Structures (FoSSaCS), Lecture Notes in Computer Science 14574, Springer, 2024, pp. 34-54. [ pdf] 2023 Laurent Doyen. Stochastic Games with Synchronization Objectives. Journal of the ACM 70(3) 23:1-35, 2023. [ pdf] Dietmar Berwanger and Laurent Doyen. Observation and Distinction. Representing Information in Infinite Games. Theory of Computing Systems (ToCS) 67(1), 2023, Springer, pp. 4-27. [ pdf] 2022 Krishnendu Chatterjee and Laurent Doyen. Graph Planning with Expected Finite Horizon. Journal of Computer and System Sciences (JCSS) 129, Elsevier, 2022, pp. 1-21. [ pdf] Laurent Doyen. Stochastic Games with Synchronizing Objectives. Proceedings of the 37th Annual Symposium on Logic in Computer Science (LICS), IEEE Computer Society Press, 2022. [ pdf] [Technical report] Laurent Doyen and Marie van den Bogaard. Bounds for Synchronizing Markov Decision Processes. Proceedings of the 17th International Computer Science Symposium in Russia (CSR), Lecture Notes in Computer Science 13296, Springer, 2022, pp. 133-151. [ pdf] [Technical report] 2021 Krishnendu Chatterjee and Laurent Doyen. Stochastic Processes with Expected Stopping Time. Proceedings of the 36th Annual Symposium on Logic in Computer Science (LICS), IEEE Computer Society Press, 2021. [ pdf] [Technical report] 2020 Dietmar Berwanger and Laurent Doyen. Observation and Distinction. Representing Information in Infinite Games. Proceedings of the 37th Symposium on Theoretical Aspects of Computer Science (STACS), LIPIcs, Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, 2020, (154)48:1-48:17. [ pdf] [Full version] 2019 Krishnendu Chatterjee and Laurent Doyen. Graph Planning with Expected Finite Horizon. Proceedings of the 34th Annual Symposium on Logic in Computer Science (LICS), IEEE Computer Society Press, 2019. [ pdf] [Technical report] Laurent Doyen, Thierry Massart, and Mahsa Shirmohammadi. The Complexity of Synchronizing Markov Decision Processes. Journal of Computer and System Sciences (JCSS) 100, Elsevier, 2019, pp. 96-129. [ pdf] 2018 Laurent Doyen, Goran Frehse, George J. Pappas, and André Platzer. Verification of Hybrid Systems. Handbook of Model Checking, Springer, 2018, pp. 1047-1110. 2017 Laurent Doyen. The Multiple Dimensions of Mean-Payoff Games. Proceedings of the 11th International Workshop on Reachability Problems (RP), Lecture Notes in Computer Science 10506, Springer, 2017, pp. 1-8. [ ps] [ pdf] Krishnendu Chatterjee, Laurent Doyen, and Thomas A. Henzinger. The Cost of Exactness in Quantitative Reachability. Models, Algorithms, Logics and Tools - Essays Dedicated to Kim G. Larsen on the Occasion of His 60th Birthday, Lecture Notes in Computer Science 10460, Springer, 2017, pp. 367-381. [ ps] [ pdf] Krishnendu Chatterjee, Laurent Doyen, Emmanuel Filiot, and Jean-François Raskin. Doomsday Equilibria for Omega-Regular Games. Information and Computation 254, Elsevier, 2017, pp. 296-315. [ pdf] 2016 Krishnendu Chatterjee and Laurent Doyen. Computation Tree Logic for Synchronization Properties. Proceedings of the 43rd International Colloquium on Automata, Languages and Programming (ICALP), LIPIcs, Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, 2016, (55)98:1-98:14. [ pdf] Krishnendu Chatterjee and Laurent Doyen. Perfect-Information Stochastic Games with Generalized Mean-Payoff Objectives. Proceedings of the 31st Annual Symposium on Logic in Computer Science (LICS), IEEE Computer Society Press, 2016, pp. 247-256. [ pdf] [Technical report] 2015 Krishnendu Chatterjee, Laurent Doyen, Hugo Gimbert, and Thomas A. Henzinger. Randomness for Free. Information and Computation 245, Elsevier, 2015, pp. 3-16. [ pdf] Krishnendu Chatterjee, Laurent Doyen, and Moshe Y. Vardi. The Complexity of Synthesis from Probabilistic Components. Proceedings of the 42nd International Colloquium on Automata, Languages and Programming (ICALP), Lecture Notes in Computer Science 9135, Springer, 2015, pp. 108-120. [ ps] [ pdf] Krishnendu Chatterjee, Laurent Doyen, Mickael Randour, and Jean-François Raskin. Looking at Mean-Payoff and Total-Payoff Through Windows. Information and Computation 242, Elsevier, 2015, pp. 25-52. [ pdf] Yaron Velner, Krishnendu Chatterjee, Laurent Doyen, Thomas A. Henzinger, Alexander Rabinovich, and Jean-François Raskin. The Complexity of Multi-Mean-Payoff and Multi-Energy Games. Information and Computation 241, Elsevier, 2015, pp. 177-196. [ ps] [ pdf] 2014 Laurent Doyen, Line Juhl, Kim G. Larsen, Nicolas Markey, and Mahsa Shirmohammadi. Synchronizing Words for Weighted and Timed Automata. Proceedings of the 34h International Conference on Foundations of Software Technology and Theoretical Computer Science (FSTTCS), LIPIcs, Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, vol. 29, 2014, pp. 121-132. [ pdf] Laurent Doyen, Thierry Massart, and Mahsa Shirmohammadi. Robust Synchronization in Markov Decision Processes. Proceedings of the 25th International Conference on Concurrency Theory (CONCUR), Lecture Notes in Computer Science 8704, Springer, 2014, pp. 234-248. [ ps] [ pdf] Krishnendu Chatterjee and Laurent Doyen. Games with a Weak Adversary. Proceedings of the 41st International Colloquium on Automata, Languages and Programming (ICALP), Lecture Notes in Computer Science 8573, Springer, 2014, pp. 110-121. [ ps] [ pdf] [Technical report] Krishnendu Chatterjee and Laurent Doyen. Partial-Observation Stochastic Games: How to Win when Belief Fails. ACM Transactions on Computational Logic 15:2, 2014. [ ps] [ pdf] Laurent Doyen, Thierry Massart, and Mahsa Shirmohammadi. Limit Synchronization in Markov Decision Processes. Proceedings of the 17th International Conference on Foundations of Software Science and Computation Structures (FoSSaCS), Lecture Notes in Computer Science 8412, Springer, 2014, pp. 58-72. [ ps] [ pdf] Krishnendu Chatterjee, Laurent Doyen, Hugo Gimbert, and Youssouf Oualhadj. Perfect-Information Stochastic Mean-Payoff Parity Games. Proceedings of the 17th International Conference on Foundations of Software Science and Computation Structures (FoSSaCS), Lecture Notes in Computer Science 8412, Springer, 2014, pp. 210-225. [ ps] [ pdf] [Technical report] Krishnendu Chatterjee, Laurent Doyen, Sumit Nain, and Moshe Y. Vardi. The Complexity of Partial-Observation Stochastic Parity Games with Finite-Memory Strategies. Proceedings of the 17th International Conference on Foundations of Software Science and Computation Structures (FoSSaCS), Lecture Notes in Computer Science 8412, Springer, 2014, pp. 242-257. [ ps] [ pdf] [Technical report] Krishnendu Chatterjee, Laurent Doyen, Emmanuel Filiot, and Jean-François Raskin. Doomsday Equilibria for Omega-Regular Games. Proceedings of the 15th International Conference on Verification, Model Checking, and Abstract Interpretation (VMCAI), Lecture Notes in Computer Science 8318, Springer, 2014, pp. 78-97. [ ps] [ pdf] [Journal version (I&C 2017)] 2013 Krishnendu Chatterjee, Laurent Doyen, and Thomas A. Henzinger. A Survey of Partial-Observation Stochastic Parity Games. Formal Methods in System Design 43(2): 268-284, Springer, 2013. [ ps] [ pdf] Thomas Brihaye, Laurent Doyen, Gilles Geeraerts, Joël Ouaknine, Jean-François Raskin, and James Worrell. Time-Bounded Reachability for Monotonic Hybrid Automata: Complexity and Fixed Points. Proceedings of the 11th International Symposium on Automated Technology for Verification and Analysis (ATVA), Lecture Notes in Computer Science 8172, Springer, 2013, pp. 55-70. [ pdf] Krishnendu Chatterjee, Laurent Doyen, Mickael Randour, and Jean-François Raskin. Looking at Mean-Payoff and Total-Payoff through Windows. Proceedings of the 11th International Symposium on Automated Technology for Verification and Analysis (ATVA), Lecture Notes in Computer Science 8172, Springer, 2013, pp. 118-132. [ pdf] 2012 Krishnendu Chatterjee and Laurent Doyen. Energy Parity Games. Theoretical Computer Science 458(2): 49-60, Elsevier, 2012. [ ps] [ pdf] Krishnendu Chatterjee and Laurent Doyen. Partial-Observation Stochastic Games: How to Win when Belief Fails. Proceedings of the 27th Annual Symposium on Logic in Computer Science (LICS), IEEE Computer Society Press, 2012, pp. 175-184. [ ps] [ pdf] [Journal version (ToCL 2014)] [Technical report] Laurent Doyen. Games and Automata: From Boolean to Quantitative Verification. Habilitation Thesi",
  "content_length": 23680,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:55"
}