{
  "name": "Laura Sanità",
  "homepage": "https://laurasanita.github.io",
  "status": "success",
  "content": "Laura Sanità Home Bio Activities Publications Students Laura Sanità Full Professor Department of Computing Sciences Bocconi University Via Roentgen, 1 (2nd floor, Room 2-C1-08) 20136 Milano, Italy Research Interests: Combinatorial Optimization, Approximation Algorithms, Network Design, Algorithmic Game Theory, Operations Research Contact: laura.sanita AT unibocconi.it Short Bio July 2003: Bachelor's degree in Management Engineering, from \"Università di Roma Tor Vergata\", Italy. October 2005: Master's degree in Management Engineering, from \"Università di Roma Tor Vergata\", Italy. January 2009: Doctoral degree in Operations Research, from \"Università Sapienza di Roma\", Rome, Italy. February 2009 — August 2011: PostDoc at Discrete Optimization Group, EPFL, Lausanne, Switzerland. September 2011 — December 2011: World Trip (here is my route!) January 2012 — June 2017: Assistant Professor at C&O, University of Waterloo, Canada. July 2017 — August 2025: Associate Professor (@UWaterloo, Canada (until 2020), @TU Eindhoven, Netherlands (until 2022), @Bocconi, Italy (until 2025)) ...since September 2025: Full Professor at Bocconi University, Italy. Activities Institutional work: I am the program director of the Bocconi Master of Science in Artificial Intelligence, and the CS curriculum coordinator of the PhD Program in Statistics and Computer Science Member of the evaluation committee for the SNSF Ambizione program in theoretical computer science, Switzerland, (since 2024) Member of the selection committee for the “Trevisan Prize” (2025) Member of the selection committee for the “Tucker Prize” (2021-2024) Program Committees: ICALP 2025, IPCO 2025, SODA 2025, ESA 2024, SWAT 2024, STOC 2023, ISAAC 2023, WG 2023, SOSA 2023, IPCO 2022 (Local chair), APPROX 2021 (PC Chair), MFCS 2021, WADS 2021, CanaDAM 2021, CSR 2021, ESA 2020, APPROX 2020, WAOA 2020, SODA 2020, SODA 2019, FUN 2018, ISAAC 2017, APPROX 2017, SPAA 2017, IPCO 2017, WAOA 2015 (PC Co-chair), WAOA 2014, ESA 2014. Editorship: Associate Editor of the journals \"Mathematical Programming\", \"Mathematics of Operations Research\" and \"Operations Research Letters\". Research awards: Recipient of a NWO-VIDI award, from the Dutch Research Council, Netherlands. Recipient of a 2019 Discovery Accelerator Supplements Award, from the Natural Sciences and Engineering Research Council of Canada (NSERC). Recipient of a UWaterloo Faculty of Mathematics Golden Jubilee Research Excellence Award. Recipient of 2015 Early Researcher Award administered by the Province of Ontario. Co-recipient of the Best Paper Award at the conference STOC 2010. Recent Events: Co-organizer of the series of “Aussois Workshop in combinatorial optimization\" since 2024 Co-organizer of the series of “Cargese Workshop in combinatorial optimization” since 2021 Co-organizer of the series Bocconi Theory Day 2023, 2024, 2025 Co-organizer of the ICERM Semester Research Program in “Discrete Optimization”, Spring 2023 Co-organizer of the Hausdorff Trimester Research Program in “Discrete Optimization”, Fall 2021 Co-organizer of the Oberwolfach meeting “Combinatorial Optimization”, 2024 Co-organizer of the Dagstuhl Seminar “Graph Algorithms: Cuts, Flows, and Network Design”, 2023 Selected Publications Note: Colours distinguish Journals, Conference Proceedings, or Others. On papers authors are listed in alphabetical order. H. Angelidakis, D. Hyatt-Denesik, L. Sanità, Node connectivity augmentation via iterative randomized rounding, Mathematical Programming 199(1), pages 995-1031, 2023. D. Hyatt-Denesik, A. Jabal Ameli, L. Sanità, Finding Almost Tight Witness Trees, ICALP 2023 (2023 International Colloquium on Automata, Languages and Programming), pages 79:1-79:16. M. Gerstbrein, L. Sanità, L. Verberk, Stabilization of Capacitated Matching Games, IPCO 2023 (24th conference on Integer Programming and Combinatorial Optimization), pages 157-171. J. A. De Loera, S. Kafer, L. Sanità, Pivot Rules for Circuit-Augmentation Algorithms in Linear Optimization, SIAM Journal on Optimization 32(3), pages 2156-2179, 2022. Z. K. Koh, L. Sanità, Stabilizing weighted graphs, Mathematics of Operations Research, 45(4), pages 1318-1341, 2020. Z. K. Koh, L. Sanità, An efficient characterization of submodular spanning tree games, Mathematical Programming, 183, 1-2, pages 359-377, 2020. Z. K. Koh, L. Sanità, An efficient characterization of submodular spanning tree games, IPCO 2019 (20th conference on Integer Programming and Combinatorial Optimization), pages 275-287. S. Kafer, K. Pashkovich, L. Sanità, On the circuit diameter of some combinatorial polytopes, Siam Journal on Discrete Mathematics, 33(1): 1-25, 2019. L. Sanità, The diameter of the fractional matching polytope and its hardness implications, FOCS 2018 (59th Annual IEEE Symposium on Foundations of Computer Science), pages 910-921. S. Ahmadian, U. Bhaskar, L. Sanità, C. Swamy, Algorithms for Inverse Optimization Problems, ESA 2018 (26th Annual European Symposium on Algorithms), pages 1:1-1:14. Z. K. Koh, L. Sanità, Stabilizing weighted graphs, ICALP 2018 (45th International Colloquium on Automata, Languages, and Programming), pages 83:1-83:13. S. Fiorini, M. Gross, J. Koenemann, L. Sanità, Approximating Tree Augmentation via Chvatal-Gomory cuts, SODA 2018 (29th ACM-SIAM Symposium on Discrete Algorithms), pages 817-831. S. Ahmadian, H. Hosseinzadeh, L. Sanità, Stabilizing network bargaining games by blocking players, Mathematical Programming, 172(1): 249-275, 2018. A. Abdi, R. Fukasawa, L. Sanità, Opposite elements in clutters, Mathematics of Operations Research, Volume 43, No. 2, pages 428-459, 2018. G. Guruganesh, J. Iglesias, R Ravi, L. Sanità, Single-sink Fractionally Subadditive Network Design, ESA 2017 (25th European Symposium on Algorithms), pages 46:1-46:13. T. Rothvoss, L. Sanità, 0/1 Polytopes with quadratic Chvatal rank, Operations Research, 65(1): 212-220, 2017. A. Feldmann, J. Koenemann, K. Pashkovich, L. Sanità, Fast Approximation Algorithms for the Generalized Survivable Network Design Problem, ISAAC 2016 (International symposium on algorithms and computation), pages 33:1-33:12. S. Ahmadian, H. Hosseinzadeh, L. Sanità, Stabilizing network bargaining games by blocking players, IPCO 2016 (18th conference on Integer Programming and Combinatorial Optimization), pages 164-177. A. Feldman, J. Koenemann, N. Olver, L. Sanità, On the equivalence of the bidirected and hypergraphic relaxations for Steiner tree, Mathematical Programming, Volume 160, pages 379-406, 2016. A. Abdi, A. Feldmann, B. Guenin, J. Koenemann, L. Sanità, Lehman's Theorem and the Directed Steiner Tree Problem, SIAM Journal on Discrete Mathematics, Volume 30 Issue 1, pages 141-153, 2016. G. Guruganesh, L. Sanità, C. Swamy, Improved Region-Growing and Combinatorial Algorithms for k-Route Cut Problems, SODA 2015 (ACM-SIAM Symposium on Discrete Algorithms), pages 676-695. H. Efsandiari, M. Hajiaghayi, J. Koenemann, H. Mahini, D.L. Malec, L. Sanità, Approximate Deadline-Scheduling with Precedence Constraints, ESA 2015 (23rd European Symposium on Algorithms), pages 483-495. A. Bock, K. Chandrasekaran, J. Koenemann, B. Peis, L. Sanità, Finding small stabilizers for unstable graphs, Mathematical Programming, Volume 154, pages 173-196, 2015. Y. Faenza, L. Sanità, On the existence of compact eps-approximated formulations for Knapsack in the original space, Operations Research Letters, Volume 43 Issue 3, pages 339-342, 2015. J. Byrka, A. Karrenbauer, L. Sanità, The interval constrained 3-coloring problem, Theoretical Computer Science, Volume 593 Issue C, pages 42-50, 2015. A. Bock, L. Sanità, The capacitated orienteering problem, Discrete Applied Mathematics, Volume 195, pages 31-42, 2015. M. Di Summa, D. Pritchard, L. Sanità, Finding the closest ultrametric, Discrete Applied Mathematics, Volume 180, pages 70-80, 2015. A. Bock, K. Chandrasekaran, J. Koenemann, B. Peis, L. Sanità, Finding small stabilizers for unstable graphs, IPCO 2014 (17th Conference on Integer Programming and Combinatorial Optimization), LNCS 8494, pages 150-161, 2014. A. Feldman, J. Koenemann, N. Olver, L. Sanità, On the equivalence of the bidirected and hypergraphic relaxations for Steiner tree, APPROX and RANDOM 2014 Proceedings, pages 176-191, 2014. J. Edmonds, L. Sanità, Exponentiality of the exchange algorithm for finding another room-partitioning, Discrete Applied Mathematics, Volume 164, Part 1, Pages 86-91, 2014. J. Koenemann, Sina Sadeghian, L. Sanità, An LMP O(log n)-Approximation Algorithm for Node Weighted Prize Collecting Steiner Tree, FOCS 2013 (54th Annual IEEE Symposium on Foundations of Computer Science). T. Rothvoss, L. Sanità, 0/1 Polytopes with quadratic Chvatal rank, IPCO 2013 (16th Conference on Integer Programming and Combinatorial Optimization), LNCS Volume 7801, 2013, pages 349-361. J. Koenemann, S. Sadeghian, L. Sanità, Better Approximation Algorithms for Technology Diffusion, ESA 2013 (21st European Symposium on Algorithms). A. Bock, L. Sanità, On the approximability of two capacitated vehicle routing problems, INOC 2013 (International Network Optimization Conference), ENDS, Volume 41, Pages 519-526. J. Byrka, F. Grandoni, T. Rothvoss, L. Sanità, Steiner Tree approximation via iterative randomized rounding, Journal of the ACM, Volume 60 Issue 1, 2013. N. Haehnle, L. Sanità, R. Zenklusen, Stable routing and unique-max coloring on trees, Siam Journal on Discrete Mathematics 27(1), pages 109 - 125, 2013. G. Oriolo, L. Sanità, R. Zenklusen, Network design with a discrete set of traffic matrices, Operations Research Letters, Volume 41, Issue 4, Pages 390-396, 2013. A. Bock, E. Grant, J. Koenemann, L. Sanità, The School Bus Problem on Trees, Algorithmica, Algorithmica 67(1), Pages 49-64, 2013. A. Bock, E. Grant, J. Koenemann, L. Sanità, The School Bus Problem on Trees, ISAAC 2011 (22nd International Symposium on Algorithms and Computation). F. Eisenbrand, N. Kakimura, T. Rothvoss, L. Sanità, Set covering with ordered replacement -- A",
  "content_length": 12618,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:48"
}