{
  "name": "Laurence Duchien",
  "homepage": "http://chercheurs.lille.inria.fr/~duchien",
  "status": "success",
  "content": "Laurence Laurence Duchien is full professor at University of Lille, France since 2001, member of Faculty of Sciences and Technologies in Computer Science Department and she is research member of CRIStAL Lab in Spirals group, a join group between Inria and University of Lille. Her research is in the field of software engineering and organized in three themes: the definition of distributed software architectures, software maintenance and evolution, the variability study in the context of sensitive systems. Her main recent results concern adaptation throughout the software life cycle from design to runtime in context of cloud computing or mobile applications. Laurence Duchien was in charge of a master program on Software Engineering from 2002 to 2006 and in charge of the research program for the master of computer science at University of Lille between 2010 and 2015. From 2012 to 2018, she was also scientific leader of the department of careers and employments at Doctoral College and, from 2013 to 2018, in charge of the doctoral program for Computer Science in Doctoral School for Engineering Science. From 2018 to 2021 she was scientific advisor for the doctoral studies in the research board at the University of Lille. From 2007 to 2012, Laurence Duchien was the scientific leader of ADAM group, a joint group between University of Lille and Inria. She advised or co-advised 25 PhD students. She was reviewer of more than 90 PhD. She also involved in many national and European collaborative projects (FP6 NoE AOSD, FP7 IP PaaSage, IAP Moves, ANR TL FAROS, ANR CONTINT MOANO, ANR Emergence YourCast, ANR ARPEGE Salty, FUI PICOM Cappuccino, Macchiato, ICOM, FUI System@tic & Minalogic EconHome) and work with companies (Norsys, Orange) via CIFRE Ph.D contracts. She is author or co-author of more than 100 publications in international journals and conferences. In 2019 she was general chair for European Conference on Software Architecture (ECSA) and program committee co-Chair for Systems and Software Product Lines Conference (SPLC). Since 2021 she is Special Issue co-Editor of Journal of System and Software, Elsevier. From 2012 to 2015 Laurence Duchien was the scientific leader of GDR CNRS Génie de la Programmation et du Logiciel - a CNRS national research network on Programming and Software Engineering that includes 90 teams and over 700 people in France. From 2014 to 2016, she was member of the Scientific Advisory Board for the Certus Center, Simula Lab, Norway. From 2014 to 2019, she was president for the Scientific and Technological Council of business and research cluster in retail domain named PICOM (Pôle de compétitivité des Industries du Commerce). From 2015 to 2016 she was elected member of research council at University Lille. From 2016 to 2018, she was Elected Member-at-large for the IEEE Technical Council of Software Engineering (TCSE). From 2016 to 2021, she was elected member of National Committee for Scientific Research in Computer Science and member of the board. In March 2021, she was appointed president of the Scientific and Technological Council of SystemX IRT. In 2021-2022, she was scientific advisor in software engineering at INS2I, CNRS. Since 2019  she is Knight of the French National Order of Merit (Chevalier de l’Ordre National du Mérite). Since July 2022 Laurence Duchien is Dean of the Faculty of Science and Technology at University of Lille. Laurence Duchien graduated with a PhD degree in Computer Science from University Pierre & Marie Curie, Paris, France in 1988. She joined then the Computer Science Department at CNAM (Conservatoire National des Arts et Métiers), Paris, France as associate professor in September 1990. She graduated with a qualification to supervise research (HDR) in Computer Science from University of Joseph Fourier, Grenoble, France in 1999. Publications DBLP - HAL - Google Scholar Contact Laurence Duchien 1- Université de Lille Faculté des Sciences et Technologies Bât A18 - Room 209 Cité Scientifique 59655 Villeneuve d’Ascq Cedex - France Tel: +33 (0)3 62 26 84 09 2- Inria Lille-Nord Europe - Room B 318 Laurence.Duchien[at]univ-lille.fr My linkedin page My twitter account: @LaurenceDuchien",
  "content_length": 4197,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:54"
}