{
  "name": "Lauren Pick",
  "homepage": "https://lmpick.github.io",
  "status": "success",
  "content": "Lauren Pick Lauren Pick mail CV I am an assistant professor in the department of Computer Science and Engineering at the Chinese University of Hong Kong (CSE@CUHK), where I work on automated techniques for formally reasoning about programs. I am interested in (a) applying these techniques to help people understand and correctly interact with existing software components and (b) figuring out how to scale these techniques so that they can be usefully applied to real systems. More specific recent interests are in applications of static analysis and synthesis to LLM interpretability and automated reasoning about concurrent and distributed systems. article Publications Checking Observational Correctness of Database Systems Lauren Pick, Amanda Xu, Ankush Desai, Sanjit A. Seshia, Aws Albarghouthi. OOPSLA 2025. paper Psym: Efficient Symbolic Exploration of Distributed Systems. Lauren Pick, Ankush Desai, Aarti Gupta. PLDI 2023. paper extended version talk code Synthesizing Quantum-Circuit Optimizers. Amanda Xu, Abtin Molavi, Lauren Pick, Swamit S. Tannu, Aws Albarghouthi. PLDI 2023. paper AutoWS-Bench-101: Benchmarking Automated Weak Supervision with 100 Labels. Nicholas Carl Roberts, Xintong Li, Tzu-Heng Huang, Dyah Adila, Spencer Schoenberg, Cheng-Yu Liu, Lauren Pick, Haotian Ma, Aws Albarghouthi, Frederic Sala. NeurIPS 2022. paper Qubit Mapping and Routing via MaxSAT. Abtin Molavi, Amanda Xu, Martin Diges, Lauren Pick, Swamit S. Tannu, Aws Albarghouthi. MICRO 2022. paper Unbounded Procedure Summaries from Bounded Environments. Lauren Pick, Grigory Fedyukovich, Aarti Gupta. VMCAI 2021. paper Automating Modular Verification of Secure Information Flow. Lauren Pick, Grigory Fedyukovich, Aarti Gupta. FMCAD 2020. paper talk Exploiting Synchrony and Symmetry in Relational Verification. Lauren Pick, Grigory Fedyukovich, Aarti Gupta. CAV 2018. paper extended version slides code",
  "content_length": 1895,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:50"
}