{
  "name": "Laurent Donzé",
  "homepage": "https://www.unifr.ch/inf/en/all/people/16989/506a1",
  "status": "success",
  "content": "Laurent Donzé | Department of Informatics | University of Fribourg Laurent Donzé Head of the ASAM Group laurent.donze@unifr.ch +41 26 300 8275 +41 79 500 41 20 (private) https://orcid.org/0000-0003-3522-4672 Professor, Department of Informatics PER 21 bu. C320Bd de Pérolles 901700 Fribourg PER 21, C320 +41 26 300 8275 Statistics and Econometrics Survey Statistics Fuzzy Statistics Biography vCard  Curriculum Vitae ResearchGate Google Scholar Academia GitLab Laurent Donzé is a Professor of Applied Statistics and Modelling (ASAM) and Head of the research group in the Faculty of Economics and Social Sciences at the University of Fribourg. His teaching experience includes Mathematics and Econometrics, Introductory Statistics, Survey Statistics, Applied Econometrics, and Applied Statistics. His main research fields are survey methodology and specialized methods in Applied Statistics as wage discrimination, causal effects estimation, imputation, and matching techniques, fuzzy statistics. He has published in numerous journals and has acted as a referee or reviewer for several journals and editions. After a Ph.D. in Econometrics at the Faculty of Economics and Social Sciences of the University of Fribourg (Switzerland), Laurent Donzé worked on several SNF projects for a Research Institute in Economics of the Canton Tessin (Istituto di Ricerche Economiche (IRE)). Parallelly, he pursued his mathematical education at the Institute of Mathematics of the University of Fribourg. From 1996 to 2002, Laurent Donzé worked as a senior scientific collaborator at the KOF Swiss Economic Institute of ETH Zurich (KOF ETH Zurich), where he built, among other projects, the Swiss Firm Panel. In 2002, he obtained a position as a Professor of Statistics at the Faculty of Economics and Social Sciences of the University of Fribourg (Switzerland). He is attached to the Department of Informatics, where he teaches and does his researches. Since 2002, he is also Research Professor for the KOF ETH Zurich. And since 2016, he is a Professor of Econometrics at the University of Neuchâtel. He is a mentor at the Swiss Study Foundation. He is president of the SSS section \"Education and Research\" (Swiss Statistical Society) too. Research and publications ORCID References 251 publications Fuzzy Confidence Intervals by Bootstrapped Fuzzy Distributions (2025) | Book chapter Fuzziest Estimate by Least Squares: Another Method to Estimate Fuzzy Orthogonal Linear Regression Models Julien Rosset, Laurent Donzé (2025) | Book chapter Generalisation of the Signed Distance Mathematics\t(2024) | Journal article mathematics Special Issue \"Research and Application of Fuzzy Statistics\" (forthcoming) Donzé, L., ed. by Donzé, L. (2024) | Book Fuzzy least squares and fuzzy orthogonal least squares linear regressions Rosset, J. and Donzé, L., (2023) | Conference A Fuzzy Confidence Interval to test equality of means. Application based on the survey of Health, Ageing and Retirement in Europe (SHARE) Donzé, L. and Berkachy, R., (2023) | Conference Fuzzy Confidence Intervals by the Likelihood Ratio: Testing Equality of Means--Application on Swiss SILC Data (2022) | Journal article Probability of collapse on historical casing. Application of API 5C3 AnnexF/H Methodology Berkachy, Rédina and Donzé, Laurent , Université de Fribourg, Département d’informatique, Mandate of S&L Consulting, 1752 Villars-sur-Glânes, Switzerland (2021) | Other Organizing committee and Chairman of several sessions Donzé, L., (9.2021) | Conference Probability of collapse on historical casing. Application of API 5C3 AnnexF/H Methodology Berkachy, R. and Donzé, L. , Mandate of S & L Consulting, 1752 Villars-sur-Glânes, Switzerland (2021) | Other Probability of collapse on historical casing. Application of ISO/TR 2007 Methodology Donzé, L. and Berkachy, R. (2021) | Other Probability of collapse on historical casing. Application of API 5C3 AnnexF/H Methodology Donzé, L. and Berkachy, R. , Mandate of S&L Consulting, 1752 Villars-sur-Glânes, Switzerland (2021) | Other Bachelor en Études économiques et juridiques. Présentation de la voie d'études Donzé, Laurent, (2020) | Conference Fuzzy Confidence Intervals by the Likelihood Ratio with Bootstrapped Distribution Berkachy, R. and Donzé, L., (2020) | Conference Fuzzy Confidence Intervals by the Likelihood Ratio with Bootstrapped Distribution Berkachy, R. and Donzé, L., Proceedings of the IJJCI 2020 12th International Joint Conference on Computational Intelligence: (2020) | Conference Fuzzy Confidence Intervals by the Likelihood Ratio with Bootstrapped Distribution Berkachy, R. and Donzé, L., Proceedings of the IJJCI 2020 12th International Joint Conference on Computational Intelligence (Best Student Paper Award): (2020) | Conference FuzzySTs: Fuzzy Statistical Tools, R package Berkachy, R. and Donzé, L. (2020) | Other Defuzzification of a fuzzy p-value by the signed distance: application on real data Berkachy, R. and Donzé, L. (Studies in Computational Intelligence, 2019) | Book Central moments of a fuzzy random variable using the signed distance: A look towards the variance Berkachy, R. and Donzé, L. (Advances in Intelligent Systems and Computing, 2019) | Book De l'encouragement. Expériences en tant que mentor Donzé, Laurent, (2019) | Conference Bachelor en Études économiques et juridiques. Présentation de la voie d'études Donzé, Laurent, (2019) | Conference Meetup AdminR Donzé, Laurent, (2019) | Conference Central Moments of a Fuzzy Random Variable Using the Signed Distance: A Look Towards the Variance , in Uncertainty Modelling in Data Science Rédina Berkachy and Laurent Donzé, ed. by Sébastien Destercke and Thierry Denoeux and María Ángeles Gil and Przemyslaw Grzegorzewski and Olgierd Hryniewicz (Springer International Publishing, 2019), ISBN: 978-3-319-97546-7 | Book chapter Testing Hypotheses by Fuzzy Methods: A Comparison with the Classical Approach , in Applying Fuzzy Logic for the Digital Economy and Society Rédina Berkachy and Laurent Donzé, ed. by Meier, Andreas and Portmann, Edy and Terán, Luis (Springer Nature Switzerland AG 2019, 2019) | Book chapter Defuzzification of the fuzzy p-value by the signed distance: Application on real data , in Computational Intelligence Rédina Berkachy and Laurent Donzé, ed. by Christophe Sabourin and Juan Julian Merelo and Kurosh Madani and Kevin Warwick (Springer Nature Switzerland AG 2019, 2019), ISBN: 978-3-030-16468-3 | Book chapter Fuzzy individual and global assessments, and FANOVA. Application: Fuzzy measure of poverty with Swiss data Donzé, Laurent and Berkachy, Rédina, (2019) | Conference Fuzzy Confidence Interval Estimation by Likelihood Ratio Rédina Berkachy and Laurent Donzé, (2019) | Conference Fuzzy individual and global assessments, and FANOVA. Application: Fuzzy measure of poverty with Swiss data Donzé, Laurent and Berkachy, Rédina, Proceedings: (2019) | Conference Fuzzy Poverty Measurement. Modelling and Empirical Analysis Based on the Swiss SILC Surveys Donzé, L. and Berkachy, R., Proceedings of the ZUFE 2019, Hangzhou, China, December 8-10, 2019: (2019) | Conference De l’usage des calepins interactifs Jupyter en classe de statistique Donzé, L., (2019) | Conference Fuzzy Confidence Intervals Berkachy, R. and Donzé, L. (2019) | Other Fuzzy individual and global assessments, and FANOVA. Application: Fuzzy measure of poverty with Swiss data Donzé, Laurent and Berkachy, Rédina, Proceedings of the 62nd ISI World Statistics Congress (WSC), Kuala Lumpur, 2019: (2019) | Conference Fuzzy Confidence Interval Estimation by Likelihood Ratio Rédina Berkachy and Laurent Donzé, Proceedings of the 2019 Conference of the Intrernational Fuzzy Systems Association and the European Society for Fuzzy Logic and Technology (EUSFLAT 2019): (2019) | Conference Fuzzy Poverty Measurement. Modelling and Empirical Analysis Based on the Swiss SILC Surveys Donzé, L. and Berkachy, R., (2019) | Conference Fuzzy Confidence Interval Estimation by Likelihood Ratio Berkachy, Redina, Donze, Laurent, PROCEEDINGS OF THE 11TH CONFERENCE OF THE EUROPEAN SOCIETY FOR FUZZY LOGIC AND TECHNOLOGY (EUSFLAT): (2019) | Conference Expertise « Validierung des Modellansatzes zur Berechnung und Projektion der Einnahmen und Ausgaben der AHV » Donzé, Laurent , Université de Fribourg, Département d’informatique, Université de Fribourg (2018) | Other Mouvements migratoires en périodes d’élec­tions ou de votations à Moutier. Brève expertise concernant une étude statistique anonyme transmise au Ministère public du canton de Berne par Christoph Neuhaus, Conseiller d’État bernois, en mars 2018 Donzé, Laurent , Université de Fribourg (2018) | Other Expertise « Validierung des Modellansatzes zur Berechnung und Projektion der Einnahmen und Ausgaben der AHV ». Mandat réalisé pour le compte de l’Office fédéral des assurances sociales Donzé, Laurent , Office fédéral des assurances sociales (2018) | Other SME Competitiveness: Questionnaire, Index and Impact assessment Donzé, Laurent , International Trade Center (ITC), United Nations (2018) | Other Mouvements migratoires en périodes d’élec­tions ou de votations à Moutier Donzé, Laurent , Université de Fribourg (2018) | Other Fuzzy Multivariate Analysis of Variance using the Signed Distance. Application on Nestlé's data set. Collaborative project with a team of Nestlé's Statisticians. Berkachy, Rédina and Donzé, Laurent , Nestlé (2018) | Other Estimation of the fuzzy variance by different approximations of the fuzzy product Rédina Berkachy and Laurent Donzé, Proceedings of the 23rd International Conference on Computational Statistics COMPSTAT, Iasi, Romania: (2018) | Conference Estimation of the fuzzy variance by different approximations of the fuzzy product Rédina Berkachy and Laurent Donzé, (2018) | Conference Fuzzy one-way ANOVA using the signed distance method to approximate the fuzzy product , in Rencontres Francophones sur la Logique Floue et ses Applications 2018 Rédina Berkachy and Laurent Donzé, ed. by Collectif ",
  "content_length": 56557,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:56"
}