{
  "name": "Laurence D. Merkle",
  "homepage": "http://afit.academia.edu/xphileprof",
  "status": "success",
  "content": "Laurence D Merkle - Air Force Institute of Technology Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Laurence D MerkleAir Force Institute of Technology, Electrical and Computer Engineering, Faculty MemberaddFollowdoneFollowingFollowers60Following146Co-authors10Public ViewsRelated Authors Armando Marques-GuedesUNL - New University of Lisbon Ron WarzohaUS Naval Academy Forrest BrewerUniversity of California, Santa Barbara George HirasakiRice University Gareth McKinleyMassachusetts Institute of Technology (MIT) Sotirios XydisNational Technical University of Athens Nesar MerahKing Fahd University of Petroleum and Minerals Mojtaba DehmollaianUniversity of Tehran Andrej DujellaUniversity of Zagreb Hemin KoyiUppsala UniversityInterests UploadsPapers by Laurence D MerkleSIGCSE TS 2022 reportSIGCSE bulletin, Apr 1, 2022 SIGCSE Technical Symposium 2022 call for participationACM SIGCSE BulletinThe 2022 Technical Symposium is scheduled for March 2-5, 2022 at the Rhode Island Convention Cent... more The 2022 Technical Symposium is scheduled for March 2-5, 2022 at the Rhode Island Convention Center in Providence (RICC), RI, USA, and we are excited to offer the conference for the first time ever in a hybrid modality. The theme is computing education&#39;s role in contributing to society&#39;s hope for a better future. There are a number of hotels within 0.1 miles (160 m) of the RICC, including the Omni Providence Hotel, which has skybridge access to the convention center. What is beyond the laptop initiative? Perhaps: Tablet PCs and DyKnow Vision softwareProceedings. Frontiers in Education. 36th Annual Conference, 2006For over ten years Rose-Hulman has required all incoming students to purchase an institute-select... more For over ten years Rose-Hulman has required all incoming students to purchase an institute-selected laptop computer and an associated suite of software. Students use their laptops in classrooms on a daily basis. More recently, we have begun to ask: What is beyond the laptop initiative? One possible answer is a combination of penbased Tablet PCs and interaction-enhancing software like DyKnow Vision. This paper reports: our innovative use of DyKnow Vision software and Tablet PCs (hereafter, DyKnow/Tablets\") to promote active learning in the classroom; similarities/differences in our approach across 7 courses covering engineering, humanities and science and involving more than 20% of Rose-Hulman's students; and studies that assess how DyKnow/Tablets affect student learning. Thus, the paper presents an innovative direction that engineering education may take as well as an assessment of some aspects of that direction.Download Work in progress - assessing the impact of penbased computing and collaboration-facilitating software in the classroom2007 37th annual frontiers in education conference - global engineering: knowledge without borders, opportunities without passports, 2007Our project focuses on evaluating the impact of pen-based computing devices and collaboration-fac... more Our project focuses on evaluating the impact of pen-based computing devices and collaboration-facilitating software in the engineering, science, and technical communication classrooms. The faculty members engaged in the project are implementing pen-based devices (both HP tablet PCs and Wacom pen slates) in their courses. In order to take full advantage of the technology, these instructors are also using DyKnow Vision software to encourage students to work together, to reduce students' time spent copying notes and problems on the whiteboard, and to encourage more efficient methods of studying for exams. The assessment component of the project includes both formative and summative methods deployed throughout the 2006-07 academic year.Download Session 1447 Assessing the Impact of Pen-based Computing and Collaboration-facilitating Software in the Classroom– Our project focuses on evaluating the impact of pen-based computing devices and collaboration-f... more – Our project focuses on evaluating the impact of pen-based computing devices and collaboration-facilitating software in the engineering, science, and technical communication classrooms. The faculty members engaged in the project are implementing pen-based devices (both HP tablet PCs and Wacom pen slates) in their courses. In order to take full advantage of the technology, these instructors are also using DyKnow Vision software to encourage students to work together, to reduce students’ time spent copying notes and problems on the whiteboard, and to encourage more efficient methods of studying for exams. The assessment component of the project includes both formative and summative methods deployed throughout the 2006-07 academic year. Index Terms – Pen-based computing, DyKnow Vision software, assessment. SIGCSE 2021 technical symposiumACM SIGCSE Bulletin, 2021The 2021 Technical Symposium is quickly approaching and we could not be more excited to welcome y... more The 2021 Technical Symposium is quickly approaching and we could not be more excited to welcome you to the first-ever virtual Symposium! We are equally thrilled by the quality of the program that we have the honor to share with you. The schedule is available at https://sigcse2021.sigcse.org/schedule/. Game Development for Computer Science Education, Part IIEducators have long used digital games as platforms for teaching. Games tend to have several qual... more Educators have long used digital games as platforms for teaching. Games tend to have several qualities that aren’t typically found in homework: they situate problems within a compelling alternate reality that unfolds through intriguing narrative, they draw more upon a player’s intrinsic motivations than extrinsic ones, they facilitate deliberate low intensity practice, and they emphasize a spirit of play instead of work. At ITiCSE 2016, this working group convened to survey the landscape of existing digital games that have been used to teach and learn computer science concepts. Our group discovered that these games lacked explicitly defined learning goals and even less evaluation of whether or not the games achieved these goals. As part of this process, we identified and played over 120 games that have been released or described in literature as means for learning computer science concepts. In our report, we classified how these games support the learning objectives outlined in the ...Download SIGCSE 2021 technical symposium recapACM SIGCSE BulletinWe would like to take this opportunity to thank everyone in the community for everything that you... more We would like to take this opportunity to thank everyone in the community for everything that you did to support the 52nd SIGCSE Technical Symposium on Computer Science Education, our first (and hopefully only) fully-online Technical Symposium! From presenting papers and posters, to being session chairs, to simply participating, everyone engaged with the Symposium with a desire to make it work. And because of you - it did! SIGCSE Technical Symposium 2021 call for papersACM SIGCSE BulletinThe SIGCSE 2021 leadership team wants to express support for the movement in the United States an... more The SIGCSE 2021 leadership team wants to express support for the movement in the United States and around the world decrying racial inequality. The protests and conversations calling for reform rei... SIGCSE --- who we areACM Inroads Evaluating the Symbiosis of DyKnow Software and Pen-Based Computing in the Rose-Hulman ClassroomArchana Chidanandan, Computer Science and Software Engineering; Rebecca DeVasher, Chemistry; Patr... more Archana Chidanandan, Computer Science and Software Engineering; Rebecca DeVasher, Chemistry; Patrick Ferro, Mechanical Engineering; David Fisher, Mechanical Engineering; Sudipa Mitra-Kirtley, Physics and Optical Engineering; Laurence D. Merkle, Computer Science and Software Engineering; David Mutchler, Computer Science and Software Engineering; Mario Simoni, Electrical and Computer Engineering; Shannon Sexton, Office of Institutional Research, Planning and Assessment; Anneliese Watt, Humanities and Social Sciences; Julia M. Williams, Office of Institutional Research, Planning and AssessmentDownload What is beyond the laptop initiative? Perhaps: Tablet PCs and DyKnow Vision softwareFrontiers in Education …For over ten years Rose-Hulman has required all incoming students to purchase an institute-select... more For over ten years Rose-Hulman has required all incoming students to purchase an institute-selected laptop computer and an associated suite of software. Students use their laptops in classrooms on a daily basis. More recently, we have begun to ask: What is beyond the laptop initiative? One possible answer is a combination of penbased Tablet PCs and interaction-enhancing software like DyKnow Vision. This paper reports: our innovative use of DyKnow Vision software and Tablet PCs (hereafter, DyKnow/Tablets\") to promote active learning in the classroom; similarities/differences in our approach across 7 courses covering engineering, humanities and science and involving more than 20% of Rose-Hulman's students; and studies that assess how DyKnow/Tablets affect student learning. Thus, the paper presents an innovative direction that engineering education may take as well as an assessment of some aspects of that direction.Download Assessing the Impact of a National Cybersecurity Competition on Students' Career InterestsProceedings of the 49th ACM Technical Symposium on Computer Science Education Session details: Poster Session #3Proceedings of the 50th ACM Technical Symposium on Computer Science Education Cyberspace Odyssey: A Competitive Team-Oriented Serious Game in Com",
  "content_length": 13718,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:53"
}