{
  "name": "Laura K. Dillon",
  "homepage": "http://www.cse.msu.edu/~ldillon",
  "status": "success",
  "content": "Laurie Dillon January 2001 Laura K. Dillon Professor Office: Room 3436, Engineering Building Mail address: Department of Computer Science Michigan State University East Lansing, MI 48824 Internet: ldillon (at) cse (dot) msu (dot) edu Telephone: +1-517-353-4387 Facsimile: +1-517-432-1061 Research interests: Formal methods for specification and validation of concurrent software systems; software engineering; programming languages Teaching (AY 2017) CSE 291 Computational Thinking Lab (CTL), Fall and Spring Links Technovation Spartan Girls Who Code 42nd ACM/IEEE International Conference on Software Engineering, Seoul, South Korea, 23—29 May 2020 ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE), Sacramento, CA, USA, Nov 8—13, 2020. Grace Hopper Celebration of Women in Computing Michigan Affiliate NCWIT Aspiration in Computing Awards Michigan Celebration of Women in Computing (MICWIC 2019) TechKobwa 2014 ACM SIGSOFT MSU Women in Computing Anita Borg Institute ACM-W CRA-W NCWIT Research Projects Synchronization Units Model (Szumo) COPSE: Understanding how developers maintain concurrent software Synchronization Adorned Unified Modeling Language (saUML) RAPIDware Meridian: An Integrated Toolkit for Developing Interactive Distributed Applications Automated Suport for Testing and Debugging of Real-Time Programs Using Oracles An Integrated Toolset for Specifying, Testing and Debugging Complex Software-Intensive Systems ACM Authorizer Links (free download provided courtesy of ACM Digital Library) Increasing Diversity in the Face of Enrollment IncreasesWendy DuBow, Ignatios Vakalis, Laura Dillon, Helen HuSIGCSE '17 Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education,Â 2017 Dancing Computer: Computer Literacy though DanceCharles B. Owen, Laura Dillon, Alison Dobbins, Noah Keppers, Madeline Levinson, Matthew RhodesMoMM '16 Proceedings of the 14th International Conference on Advances in Mobile Computing and Multi Media,Â 2016 SEES Summary: Software Engineering Educators Symposium 2014Chang Xu, Laura DillonACM SIGSOFT Software Engineering Notes,Â 2015 Toward tractable instantiation of conceptual data models using non-semantics-preserving model transformationsMatthew Nizol, Laura K. Dillon, R. E. K. StirewaltMiSE 2014 Proceedings of the 6th International Workshop on Modeling in Software Engineering,Â 2014 Developing interactive multi-user VoIP applications using synchronization contracts with EChartsYi Huang, Laura K. DillonIPTcomm '11 Proceedings of the 5th International Conference on Principles, Systems and Applications of IP Telecommunications,Â 2011 Scalable analysis of conceptual data modelsMatthew J. McGill, Laura K. Dillon, R. E. K. StirewaltISSTA '11 Proceedings of the 2011 International Symposium on Software Testing and Analysis,Â 2011 Contract-based synchronization of IP telecommunication services: a case studyYi Huang, Laura K. Dillon, R. E. K. StirewaltCOMSWARE '11 Proceedings of the 5th International Conference on Communication System Software and Middleware,Â 2011 A thread synchronization model for SIP servlet containersYi Huang, Eric Cheung, Laura K. Dillon, R. E. Kurt StirewaltIPTComm '09 Proceedings of the 3rd International Conference on Principles, Systems and Applications of IP Telecommunications,Â 2009 Assessing the benefits of synchronization-adorned sequence diagrams: two controlled experimentsShaohua Xie, Eileen Kraemer, R. E. K. Stirewalt, Laura K. Dillon, Scott D. FlemingSoftVis '08 Proceedings of the 4th ACM symposium on Software visualization,Â 2008 A study of student strategies for the corrective maintenance of concurrent softwareScott D. Fleming, Eileen Kraemer, R. E. K. Stirewalt, Shaohua Xie, Laura K. DillonICSE '08 Proceedings of the 30th international conference on Software engineering,Â 2008 Using formal models to objectively judge quality of multi-threaded programs in empirical studiesLaura K. Dillon, R. E. K. Stirewalt, Eileen Kraemer, Shaohua Xie, Scott D. FlemingMiSE '08 Proceedings of the 2008 international workshop on Models in software engineering,Â 2008 Generation of visitor components that implement program transformationsR. E. Kurt Stirewalt, Laura K. DillonSSR '01 Proceedings of the 2001 symposium on Software reusability: putting software reuse in context,Â 2001 Automated support for testing and debugging of real-time programs using oraclesLaura K. DillonACM SIGSOFT Software Engineering Notes,Â 2000 Analysis of a scheduler for a CAD frameworkDavid S. Keyes, Laura K. Dillon, Moon Jung ChungICSE '99 Proceedings of the 21st international conference on Software engineering,Â 1999 Analyzing partially-implemented real-time systemsGeorge S. Avrunin, James C. Corbett, Laura K. DillonICSE '97 Proceedings of the 19th international conference on Software engineering,Â 1997 A graphical environment for the design of concurrent real-time systemsL. E. Moser, Y. S. Ramakrishna, G. Kutty, P. M. Melliar-Smith, L. K. DillonACM Transactions on Software Engineering and Methodology (TOSEM),Â 1997 Pharos: a scalable distributed architecture for locating heterogeneous information sourcesR. Dolin, D. Agrawal, A. El Abbadi, L. DillonCIKM '97 Proceedings of the sixth international conference on Information and knowledge management,Â 1997 Task dependence and termination in AdaLaura K. DillonACM Transactions on Software Engineering and Methodology (TOSEM),Â 1997 Generating oracles from your favorite temporal logic specificationsL. K. Dillon, Y. S. RamakrishnaSIGSOFT '96 Proceedings of the 4th ACM SIGSOFT symposium on Foundations of software engineering,Â 1996 Oracles for checking temporal properties of concurrent systemsLaura K. Dillon, Qing YuSIGSOFT '94 Proceedings of the 2nd ACM SIGSOFT symposium on Foundations of software engineering,Â 1994 A graphical interval logic for specifying concurrent systemsL. K. Dillon, G. Kutty, L. E. Moser, P. M. Melliar-Smith, Y. S. RamakrishnaACM Transactions on Software Engineering and Methodology (TOSEM),Â 1994 A visual execution model for Ada taskingLaura K. DillonACM Transactions on Software Engineering and Methodology (TOSEM),Â 1993 Graphical specifications for concurrent software systemsL. K. Dillon, G. Kutty, L. E. Moser, P. M. Melliar-Smith, Y. S. RamakrishnaICSE '92 Proceedings of the 14th international conference on Software engineering,Â 1992 Experiments with an improved constrained expression toolsetGeorge S. Avrunin, Ugo A. Buy, James C. Corbett, Laura K. Dillon, Jack C. WiledenTAV4 Proceedings of the symposium on Testing, analysis, and verification,Â 1991 Using symbolic execution for verification of Ada tasking programsLaura K. DillonACM Transactions on Programming Languages and Systems (TOPLAS),Â 1990 Experiments in automated analysis of concurrent software systemsG. Avrunin, J. Wileden, L. DillonTAV3 Proceedings of the ACM SIGSOFT '89 third symposium on Software testing, analysis, and verification,Â 1989 Constrained expressions: toward broad applicability of analysis methods for distributed software systemsLaura K. Dillon, George S. Avrunin, Jack C. WiledenACM Transactions on Programming Languages and Systems (TOPLAS),Â 1988 ACM Guide Author Page IEEE Explore Indexed Papers Those papers (below) that are also on the ACM Authorizer list (above) can be downloaded for free using the authorizer links (above). IEEE does not provide an authorizer service (at least not that I am aware of). If you are unable to purchase or download a free copy of any paper listed here, please send email to the L. Dillon (ldillon at msu dot edu). Dillon, L.K., \"Verifying general safety properties of Ada tasking programs,\" Software Engineering, IEEE Transactions on , vol.16, no.1, pp.51,63, Jan 1990doi: 10.1109/32.44363 keywords: {Ada;multiprocessing programs;program verification;Ada tasking programs;automating partial correctness proofs;concurrent programs;deadlock;isolation approach;mutual exclusion;safety properties verification;symbolic execution;Computer science;Concurrent computing;Interference;Interleaved codes;Logic;Mechanical factors;Software safety;System recovery},URL: http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=44363&isnumber=1685Huang, Y.; Dillon, L.K.; Stirewalt, R. E K, \"Prototyping synchronization policies for existing programs,\" Program Comprehension, 2009. ICPC '09. IEEE 17th International Conference on , vol., no., pp.289,290, 17-19 May 2009doi: 10.1109/ICPC.2009.5090062 keywords: {multi-threading;software maintenance;software prototyping;software tools;synchronisation;multi-threading;program evolution;software tool;synchronization policy prototyper;Access protocols;Computer science;Logic;Production facilities;Programming profession;Prototypes;Rendering (computer graphics);Runtime;System recovery;Yarn},URL: http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=5090062&isnumber=5090011Dillon, L.K.; Kutty, C.; Moser, L.E.; Melliar-Smith, P.M.; Ramakrishna, Y. S., \"Graphical specifications for concurrent software systems,\" Software Engineering, 1992. International Conference on , vol., no., pp.214,224, 0-0 1992doi: 10.1109/ICSE.1992.753501 keywords: {Application software;Concurrent computing;Formal specifications;Hardware;Logic;Mechanical factors;Software standards;Software systems;System testing},URL: http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=753501&isnumber=16236Avrunin, G.S.; Dillon, L.K.; Wileden, J.C.; Riddle, W.E., \"Constrained expressions: Adding analysis capabilities to design methods for concurrent software systems,\" Software Engineering, IEEE Transactions on , vol.SE-12, no.2, pp.278,292, Feb. 1986doi: 10.1109/TSE.1986.6312944 keywords: {parallel processing;software engineering;specification languages;analysis capabilities;closed-form description;concurrent software systems;constrained expression formalism;design languages;design methods;design process;semantics;software engineering;specification;system properties;Computer languages;Co",
  "content_length": 25945,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:43"
}