{
  "name": "Laura E. Brown",
  "homepage": "http://www.cs.mtu.edu/~lebrown",
  "status": "success",
  "content": "Laura E. Brown Skip to content Laura E. Brown Associate Professor, Computer Science Associate Dean, Data Science Initiatives, College of Computing Graduate Program Director, Data Science MS Program Do not go where the path may lead, go instead where there is no path and leave a trail. -Ralph Waldo Emerson Laura Brown is an Associate Professor of Computer Science and Associate Dean of Data Science Initiatives in the College of Computing at Michigan Technological University. Laura has a background in Engineering - B.S. from Swarthmore College, Computer Science - M.S.E. from University of Michigan and Biomedical Informatics - M.S. and Ph.D. from Vanderbilt University. Her broad research interests are in the areas of artificial intelligence, machine learning, and data science. Projects are aimed at both theoretical topics in these areas as well as the application of techniques to other domains (e.g., clinical medicine, biology, electrical power systems, microgrids, computer systems, etc.). She is also passionate of advancing pedagogies in the teaching of and access to computer science and data science education. Through her research activities and collaborations across campus, Laura is a member of the Institute of Computing and Cybersystems (ICC), the Ecosystem Science Center (ESC), and the Center for Agile Interconnected Microgrids (AIM). She also serves as the Director of the Data Science M.S. degree and graduate certificate program. Laura is the co-advisor for Women in Computing Science (WiCS). Recently, she coordinated a series of Carpentries workshops to introduce learners to analysis and lab skills for research computing. Additionally, she organizes Michigan Tech's participation in the ICPC programming competition (hosting a regional site every other year). Examples of other student activities supported include organizing a Google workshop for undergraduate computer science research, working with Summer Youth Program events, and others (see Student page)",
  "content_length": 1990,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:42"
}