{
  "name": "Laura Dietz",
  "homepage": "http://www.cs.unh.edu/~dietz",
  "status": "success",
  "content": "Laura Dietz ← Laura Dietz Laura Dietz Home Contact Prof.Â Dr.-Ing. Laura Dietz <lastname> at cs.unh.edu Assistant Professor at the Department of Computer Science University of New Hampshire Room N215C in Kingsbury Hall 33 Academic Way Durham, NH, 03824-2619 USA PGP ID: 0xF5F7017F Table of Contents Bio Teaching Research and Publications Students Service to the Research Community Invited Talks Recent Positions Hobbies Bio I am a tenured associate professor at the department of Computer Science at UNH with a focus on text-based machine learning and information retrieval as well as data science on watersheds. Previously I was a Post-doctoral Research Scientist at the Data and Web Science Group of Mannheim University, working with Prof.Â Simone Paolo Ponzetto. Before that I was a Research Scientist at the Center for Intelligent Information Retrieval (CIIR) working with Bruce Croft at University of Massachusetts. Before that I did a post-doc with Andrew McCallum. I graduated from Max Planck Insititute for Informatics in Saarbruecken, Germany in January 2011. Teaching See teaching page for more information about my courses offered at UNH CS 753/853 Topics/Information Retrieval Fall Semester (every odd year, e.g.Â 2019):â the course was listed as CS 780/880 in Fall 2016. CS 752/852 Topics/Foundations of Neural Networks Fall Semester (every even year, e.g.Â 2020): â the course was listed as CS 780/880 âMachine Learning for Sequencesâ in Fall 2020. CS 953 Adv Top/Data Science for Knowledge Graphs and Text Spring Semester (annually): (implementation-intensive) â the course was listed as CS 980.02 in Spring 2017. CS 758/858 Algorithms Spring Semester (annually): (theory-intensive) â the course will be taught in Fall semesters by a different instructor. I also offer thesis/projects. Anyone can attend my lab meetings. I also taught several lectures on natural language processing and knowledge graphs for information retrieval at conference tutorials and summer schools. Research and Publications Grants Northeast Big Data Innovation Hub: Forecasting Salinity in Rivers during Storm Events (January 2021 - August 2021) - Success Story NSF CAREER: Utilizing Fine-grained Knowledge Annotations in Text Understanding and Retrieval (January 2019 - December 2023) Elite Postdoc Program of the BW-Stiftung (April 2016 - March 2019) Publications See the list of my recent research publications annotated with conference ratings and links to fulltext publications in PDF. Link to my google scholar profile. Research Interests My research, mentoring, and teaching, and external service activities evolve around the following areas of interest. IR+NLP. Information Retrieval, Knowledge Graphs, and Natural Language processing. This area is related to my CAREER grant, TREC CAR competition, and the vision to automatically creating Wikipedia-like comprehensive articles for given topics. Watershed Data Science. Environmental data science for temporal sensor streams, in order to offer a better understanding of solute transport in watersheds for hydrologists and biogeochemists. Please see research project page for details. Students Recently Graduated Students Shubham Chatterjee. Shubham is working on Entity ranking and Entity-support passage retrieval with entity representations and entity aspects. (Graduated with a PhD 2022, looking for a Post-doc!) Sumanta Kashyapi. Sumanta is working on topic extraction for complex answer retrieval. (Graduated with a PhD in 2022; now working for Dell) Current PhD Students Satanu Ghosh. Satanu is working on generating suggested questions and answers for conversational search. Pooja Oza. Pooja is working on integrated entity and text ranking. She received a CEPS fellowship. Sepideh Koohfar. Sepideh is working on deep forecasting in time series, arising from solute concentration analysis in watersheds. â¦ your name here? â¦ Current Masters Students Sarah Hall (Masters Thesis): Sarah is developing data science methods for analyzing water shed data. â¦ your name here? â¦ Please see student page for list of all former students and service on PhD committees. Service to the Research Community Organized Mini-Conferences HIPstIR Laura Dietz, Bhaskar Mitra, Jeremy Pickens et al. âReport on the First HIPstIR Workshop on the Future of Information Retrieval.â ACM SIGIR Forum. Vol. 53 No. 2 December 2019. pp 62-75. 2019. pdf - www The vision of HIPstIR is that early stage information retrieval (IR) researchers get togetherto develop a future for non-mainstream ideas and research agendas inIR. Important priorresearch can be discussed in the form of reading groups. A future vision of what IR can (orshould) beâand how to get thereâmust be developed. It is like SWIRL (Moffat et al., 2005,Allan et al., 2012, Culpepper et al., 2018) in spirit but focusing ontopics that may otherwisebe considered ânicheâ, âalternativeâ, âindieâ, or âleft fieldâ. An explicit goal of this workshop isto foment collaboration and cross-group fertilization. The hopeis that participation will giverise to conference workshop topics and joint paper projects. Primaryfocus is on early stageresearchers that are anywhere between defending their PhD within one year to one year intobeing a tenured professor or a senior scientist, but few senior people may also be invited We hope more folks will branch off and organize HIPstIRâs all over the place. HIPstIR is public domain / CC0. Women in IR See Women in IR activities. Organized Shared Tasks Laura Dietz, Ben Gamari, Jeff Dalton, Manisha Verma, Prasenjit Mitra, Nick Craswell. TREC Complex Answer Retrieval at the Text REtrieval Conference. 2016â2018. - www - dataset - Mailinglist - TREC homepage TREC CAR concluded in 2019. Thanks to all the participants! â Dear Reviewers: Please keep on mind that TREC CAR offered multiple tasks whose numbers are not comparable. Organized Workshops, Keynotes, and Tutorials Keynotes Laura Dietz. ENT-Rank: Finding Relevant Entities through Text and Knowledge Graphs. Keynote at TextGraphs 15 Workshop at NAACL. Virtual, June 2021. â Slides (open in your web browser) Laura Dietz. How to Automatically Create Relevant Articles. Keynote at SPIRE 2020: 27th International Symposium on String Processing and Information Retrieval. Virtual. 2020. â Slides Laura Dietz. Retrieving Knowledge from the Web. Keynote at European Conference on Information Retrieval. 2017. Slides - References Summer School lectures Laura Dietz. Word Embeddings â Semantics: What is in my Documents? Lecture at the Computational Science Summer School, Los Angeles, CA in July 2018. (Summer School) Tutorials Laura Dietz, Alexander Kotov, and Edgar Meij. Tutorial on Utilizing Knowledge Graphs in Text-centric Information Retrieval. In Proceedings of the SIGIR â18: The 41st International ACM SIGIR Conference on Research & Development in Information Retrieval. 2018. â pdf â Slides and Bibliography - Mailinglist - Literature Overview Laura Dietz, Alexander Kotov, and Edgar Meij. Tutorial on Utilizing Knowledge Graphs in Text-centric Information Retrieval. In Proceedings of the Conference on Web Search and Data Mining (WSDM). 2017. Slides and Bibliography - Mailinglist - Literature Overview Laura Dietz, Alexander Kotov, and Edgar Meij. Tutorial on Utilizing Knowledge Bases in Text-centric Information Retrieval. Proceedings of the 2016 ACM on International Conference on the Theory of Information Retrieval. 5-5. 2016. Slides and Bibliography - Mailinglist - Literature Overview Kling, Christoph Carl; Posch, Lisa; Bleier, Arnim; Dietz, Laura. Topic model tutorial: A basic introduction on latent dirichlet allocation and extensions for web scientists. Proceedings of the 8th ACM Conference on Web Science. 10-10. 2016. paper - slides, animations and ressources Dietz, Laura: Tutorial on Entity Linking. American University of Beirut. March 21st, 2014. Watch the video: .ogv or on youtube, Slides: .svg or .pdf. Workshops Vivi Nastase, Benjamin Roth, Laura Dietz, Andrew McCallum. Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications co-located with the Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), 2019. â pdf â proceedings Laura Dietz, Chenyan Xiong, Jeff Dalton, and Edgar Meij. The Second Workshop on Knowledge Graphs and Semantics for Text Retrieval, Analysis, and Understanding (KG4IR 2018) co-located with the 41st International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2018), Ann Arbour, MI, USA, July 2018 â ACM DL â proceedings â www â Mailinglist Laura Dietz, Chenyan Xiong, and Edgar Meij. The First Workshop on Knowledge Graphs and Semantics for Text Retrieval and Analysis (KG4IR 2017) co-located with the 40th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2017), Shinjuku, Tokyo, Japan, August 11, 2017. CEUR Workshop Proceedings 1883, CEUR-WS.org 2017 â ACM DL â proceedings â contents â www â Mailinglist Invited Talks Please see list of invited talks page. Recent Positions Since August 2016: Assistant Professor (tenure-track) in the Computer Science Department at University of New Hampshire. Head of the TREMA lab. March 2015 - August 2016: Post-doctoral Research Scientist at Data and Web Science Group (DWS), Mannheim University (DWS, Simone Paolo Ponzetto) August 2012 - March 2015: Research Scientist at Center for Intelligent Information Retrieval (CIIR), University of Massachusetts (CIIR, Bruce Croft) October 2010 - August 2012: Post-doctoral researcher at University of Massachusetts (IESL, Andrew McCallum). January 2008 - January 2011: PhD Student at Max-Planck-Institute for Informatics (Databases and Information Systems, Prof Gerhard Weikum), Saarbruecken January 2007 - December 2008: PhD Student at Max-Planck-Institute for Informatics (Machine Learning, Prof.Â Tobias Scheffer), Saarbruecken Oct",
  "content_length": 11454,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:40"
}