{
  "name": "Laura Ruotsalainen",
  "homepage": "https://researchportal.helsinki.fi/en/persons/laura-ruotsalainen",
  "status": "success",
  "content": "Laura Ruotsalainen - University of Helsinki View Scopus Profile Laura Ruotsalainen Professor, Department of Computer ScienceSupervisor for doctoral programme, Doc­toral Pro­gramme in In­ter­dis­cip­lin­ary En­vir­on­mental Sci­encesSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿Helsinki Institute of Urban and Regional Studies (Urbaria)Helsinki Institute of Sustainability Science (HELSUS) https://orcid.org/0000-0002-4057-4143 Phone+358505560761, +358294151266Emaillaura.ruotsalainenhelsinkifi PL 68 (Pietari Kalmin katu 5)00014FinlandViikinkaari 1, Biocentre 300790 HelsinkiFinland 20122025 Research activity per year Personal profile Curriculum vitaeLaura Ruotsalainen is a Professor of Spatiotemporal Data Analysis for Sustainability Science at the Department of Computer Science at the University of Helsinki, Finland. She leads a research group in spatiotemporal data analysis for sustainability science (SDA) which performs research on estimation, Machine Learning and Computer Vision methods using spatiotemporal data for sustainable smart cities especially via smart mobility. She is a member of the steering group of the Finnish Center for AI (FCAI) and leads a FCAI Highlight area called AI for Sustainability. She is also a professor at the Helsinki Institute of sustainability Science (HELSUS), which is a cross-faculty research unit in sustainability science within the University of Helsinki. Fields of Science113 Computer and information sciencesEstimation algorithmsMachine LearningNavigation algorithmsError modellingSensor fusionspatio-temporal analysisSmart cities Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2012 2014 2018 2021 2022 2023 2024 2025 42 Conference contribution 32 Article 4 Conference article 2 Editorial 2 More 1 Book 1 Review Article Research output per year Research output per year Creating a Historical Migration Dataset from Finnish Church Records, 1800–1920Vesalainen, A., Kanerva, J., Nitsch, A., Korsu, K., Larkiola, I., Ruotsalainen, L. & Ginter, F., 29 Aug 2025, In: Journal of open humanities data. 11, p. 1-20 20 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile From Urban Data to City-Scale Models: A Review of Traffic Simulation Case StudiesBochenina, K., Agriesti, S., Roncoli, C. & Ruotsalainen, L., 1 Jan 2025, In: IET Intelligent Transport Systems. 19, 1, 32 p., e70021.Research output: Contribution to journal › Review Article › peer-review Open AccessFile GNSS jammer localization in urban areas based on prediction/optimization and ray-tracingYan, Z. & Ruotsalainen, L., Jan 2025, In: GPS Solutions. 29, 20 p., 47.Research output: Contribution to journal › Article › Scientific › peer-review Head and Neck Tumor Segmentation Using Pre-RT MRI Scans and Cascaded DualUNetSaukkoriipi, M., Sahlsten, J., Jaskari, J., Al-Tahmeesschi, A., Ruotsalainen, L. & Kaski, K., 2025, Head and Neck Tumor Segmentation for MR-Guided Applications. HNTSMRG 2024. . Wahid, K. A., Naser, M. A., Dede, C. & Fuller, C. D. (eds.). Springer Science and Business Media Deutschland GmbH, Vol. 15273. p. 191-203 13 p. (Lecture Notes in Computer Science; vol. 15273 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Long Short Term Memory Based Traffic Prediction Using Multi-Source DataLeinonen, M. J., Al-Tahmeesschi, A., Turkmen, B., Atashi, N. & Ruotsalainen, L., Apr 2025, In: International Journal of Intelligent Transportation Systems Research. 23, 1, p. 354-371 18 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile View all 82 research outputs Projects Projects per year 2019 2019 2020 2023 2025 2028 1 Not started 2 Active 5 Finished Projects per year UH Aalto F: AI-based optimization tool for sustainable urban planningRuotsalainen, L. (Project manager), Beimuk, V. (Participant), Gao, L. (Participant) & Pyykölä, S. M. (Participant)Suomen Akatemia Projektilaskutus01/01/2025 → 31/12/2026Project: Research Council of Finland: Targeted Academy Project Konecranes lahjoitus 13.12.2024Ruotsalainen, L. (Project manager)Konecranes Oyj Ostolaskut01/01/2025 → 31/12/2028Project: Corporate funding RAAS - Research Al­li­ance for Autonom­ous sys­temsRuotsalainen, L. (Project manager)Project: Research project MATINE Ruotsalainen 3 / 23 - 12 / 24Ruotsalainen, L. (Project manager), Joswig, N. (Participant), Ojala, K. T. (Participant), Pajula, I. A. (Participant), Pelvo, N. H. (Participant) & Saukkoriipi, M. P. (Participant)Puolustusministeriö01/03/2023 → 31/12/2024Project: Ministry funding Ar­ti­fi­cial In­tel­li­gence for In­dus­trial Vis­ionRuotsalainen, L. (Project manager)01/03/2020 → 28/02/2022Project: Research project View all 8 projects Activities Activities per year 2024 2024 2024 1 Organisation and participation in conferences, workshops, courses, seminars 1 Supervision of other thesis (Master's, Licentiate) Activities per year Satellite Positioning in Our Uncertain WorldPellikka, P. (Chair of organizing committee), Ruotsalainen, L. (Speaker: Presenter), Poutanen, M. (Speaker: Presenter), Chen, R. (Speaker: Presenter), Lahtinen, H. E. (Speaker: Presenter) & Koivula, H. (Speaker: Presenter)18 Sept 2024Activity: Participating in or organising an event types › Organisation and participation in conferences, workshops, courses, seminars Supervision of Hanna Lahtinen's MSc thesisPellikka, P. (Supervisor), Ruotsalainen, L. (Supervisor) & Poutanen, M. (Member of thesis committee / follow-up group)2024Activity: Examination types › Supervision of other thesis (Master's, Licentiate) Press/Media EUNIC AI Science Café: AI & Smart MobilityRuotsalainen, L.06/06/20211 item of Media coveragePress/Media: Press / Media -UNIVERSITY OF HELSINKI: Future search engines will help users find information they don't even know they are looking forHeljanko, K. & Ruotsalainen, L.17/06/20191 item of Media coveragePress/Media: Press / Media -UNIVERSITY OF HELSINKI: Data science may soon expose fake newsHeljanko, K. & Ruotsalainen, L.13/03/20191 item of Media coveragePress/Media: Press / Media UNIVERSITY OF HELSINKI : Data science may soon expose fake newsHeljanko, K. & Ruotsalainen, L.13/03/20191 item of Media coveragePress/Media: Press / Media Increasing masses of data may leave computers behind and cause an energy crisisHeljanko, K. & Ruotsalainen, L.31/10/20181 item of Media coveragePress/Media: Press / Media View all 6 press/media",
  "content_length": 6854,
  "method": "requests",
  "crawl_time": "2025-12-01 13:45:48"
}