{
  "name": "Lawrence Birnbaum",
  "homepage": "http://www.mccormick.northwestern.edu/research-faculty/directory/profiles/birnbaum-larry.html",
  "status": "success",
  "content": "Birnbaum, Larry | Faculty | Northwestern Engineering More About Northwestern Engineering IN THIS SECTION Faculty DirectoryLarry BirnbaumProfessor of Computer ScienceContact2233 Tech DriveMudd Room 3225Evanston, IL 60208-3109847-491-3640Email Larry BirnbaumDepartmentsComputer ScienceAffiliationsMaster of Science in Artificial IntelligenceDownload CVEducationPh.D. Computer Science, Yale University, New Haven, CT M.S. Computer Science, Yale University, New Haven, CT B.S. Computer Science, Yale University, New Haven, CTResearch InterestsLarry Birnbaum's research and teaching focus on applied AI and human-AI collaboration.Â He and his students develop, study, and apply new technologies in natural language processing (NLP), conversational interfaces, intelligent information systems, social media data analytics, machine learning, and computational journalism and media. Key areas of research include methods for the automatic generation of content by machine, including specifically the automatic generation of narratives from data, and on natural human-AI collaboration via conversational interaction. Larry's research also spans intelligent information systems, including models of automatic and contextual search and information diversity; preference predication and recommendation using social media data; and applications of AI to journalism and media.Selected PublicationsAllen, N., Templon, J., McNally, P.,Â Birnbaum, L., and Hammond, K.Â Â Statsmonkey: Automatic generation of narrative from data.Â Â Computational Models of Narrative: Papers from the 2010 AAAI Fall Symposium, Arlington, VA, 2010.Bursztyn, V., andÂ Birnbaum, L.Â Â Thousands of small, constant rallies: A large-scale analysis of partisan WhatsApp groups.Â Â Proceedings of the 2019 IEEE/ACM Conference on Advances in Social Networks Analysis and Mining, Vancouver, B.C., Canada, 2019.Bursztyn, V., Healey, J., Koh, E., Lipka, N., and Birnbaum, L.Â  Developing a conversational system for recommending limited options.Â  Proceedings of the 2021 ACM CHI Conference, Yokohama, Japan, 2021.Bursztyn, V., Healey, J., Lipka, N., Koh, E., Downey, D., and Birnbaum, L.Â  âIt doesnât look good for a dateâ: Transforming critiques into preferences for conversational recommendation systems.Â  Proceedings of the 2021 ACL Conference on Empirical Methods in Natural Language Processing, Punta Cana, Dominican Republic, 2021.Bursztyn, V., Demeter, D., Downey, D., and Birnbaum, L. Â Learning to perform complex tasks through compositional fine-tuning of language models.Â  Findings of the 2022 ACL Conference on Empirical Methods in Natural Language Processing, Abu Dhabi, UAE, 2022.Carvalho, G., Healey, J., Benigeri, S., Demeter, D., Downey, D., and Birnbaum, L. A flash in the pan: Better prompting strategies to deploy out-of-the-box LLMs as conversational recommendation systems.Â  Proceedings of the 31st International Conference on Computational Linguistics (COLING), Abu Dhabi, UAE, 2025.Cohn, J., Kuntz, A, andÂ Birnbaum, L.Â Â AttitudeBuzz: Using social media data to localize complex attitudes.Â Â Proceedings of the 2015 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining, Paris, France, 2015.DâArcy, M., Hope, T., Birnbaum, L., and Downey, D.Â  MARG: Multi-agent review generation for scientific papers.Â  arXiv 2401.04259, 2024.Gomez-Zara, D., Boon, M., andÂ Birnbaum, L.Â Â Who is the hero, the villain, and the victim? Detection of roles in news articles using natural language techniques.Â Â Proceedings of the 2018 ACM International Conference on Intelligent User Interfaces, Tokyo, Japan, 2018.Noraset, T., Liang, C.,Â Birnbaum, L., and Downey, D.Â Â Definition modeling: Learning to define word embeddings in natural language.Â Â Proceedings of the 31stÂ AAAI Conference on Artificial Intelligence, San Francisco, CA, 2017.OâBanion, S., andÂ Birnbaum, L.Â Â Using explicit linguistic expressions of preference in social media to predict voting behavior.Â Â Proceedings of the 2013 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining, Niagara Falls, Canada, 2013.Â Â (Best paper award.)Setlur, V., and Birnbaum, L. Â Can nuanced language lead to more actionable insights? Exploring the role of Generative AI in analytical narrative structure.Â  Proceedings of the CHI 2024 Workshop on Generative AI and HCI, Honolulu, HI, May, 2024. BACK TO TOP",
  "content_length": 4409,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:02"
}