{
  "name": "Lawrence Carin",
  "homepage": "https://ece.duke.edu/people/lawrence-carin",
  "status": "success",
  "content": "Lawrence Carin | Duke Electrical & Computer Engineering Lawrence Carin, Ph.D. Electrical and Computer Engineering Professor of Electrical and Computer Engineering Lawrence Carin, Ph.D. Profile Photo Research Themes Applications, Artificial Intelligence & Machine Learning Research Interests Applied statistics and machine learning Bio Lawrence Carin earned the BS, MS, and PhD degrees in electrical engineering at the University of Maryland, College Park, in 1985, 1986, and 1989, respectively. In 1989 he joined the Electrical Engineering Department at Brooklyn Polytechnic Institute (now part of NYU) as an Assistant Professor, and became an Associate Professor there in 1994. In September 1995 he joined the Electrical and Computer Engineering (ECE) Department at Duke University, where he is now a Professor. He was ECE Department Chair from 2011-2014, and Vice Provost and Vice President for Research from 2014-2020. He was the Provost at King Abdullah University of Science & Technology (KAUST) from 2020-2023, returning to Duke in 2023. From 2003-2014 he held the William H. Younger Distinguished Professorship, and since 2018 he has held the James L. Meriam Distinguished Professorship. Dr. Carin's research focuses on machine learning (ML) and artificial intelligence (AI). He publishes widely in the main ML/AI forums, and has addressed many applications of AI, including in  medicine and security. He was co-founder of the small business Signal Innovations Group, which was acquired by BAE Systems in 2014, and in 2017 he co-founded the company Infinia ML, which was acquired by Aspirion in 2023. He is an IEEE Fellow. Education B.S.E. University of Maryland, College Park, 1985 M.Sc.Eng. University of Maryland, College Park, 1986 Ph.D. University of Maryland, College Park, 1989 Positions Professor of Electrical and Computer Engineering Professor of Computer Science Awards, Honors, and Distinctions Fellows. Institute for Electrical and Electronics Engineers. 2001 Courses Taught IDS 793: Independent Study ECE 899: Special Readings in Electrical Engineering ECE 891: Internship ECE 590: Advanced Topics in Electrical and Computer Engineering ECE 495: Special Topics in Electrical and Computer Engineering ECE 493: Projects in Electrical and Computer Engineering Publications Si S, Jiang X, Su Q, Carin L. Detecting implicit biases of large language models with Bayesian hypothesis testing. Scientific reports. 2025 Apr;15(1):12415. Wang D, Yang Y, Chen L, Gan Z, Henao R, Carin L. Proactive Pseudo-Intervention: Pre-informed Contrastive Learning For Interpretable Vision Models. Proceedings of Machine Learning Research. 2025 Jan 1;281:20u201334. Cheng X, Carin L, Sra S. GRAPH TRANSFORMERS DREAM OF ELECTRIC FLOW. In: 13th International Conference on Learning Representations Iclr 2025. 2025. p. 75663u201384. Zhang H, Cong Y, Wang Z, Zhang L, Zhao M, Chen L, et al. Text Feature Adversarial Learning for Text Generation With Knowledge Transfer From GPT2. IEEE Trans Neural Netw Learn Syst. 2024 May;35(5):6558u201369. Assaad S, Dov D, Park C, Davis R, Kovalsky SZ, Lee WT, et al. A Preliminary Study Comparing the Performance of Thyroid Molecular Tests to a Deep Learning Algorithm in Predicting Malignancy in Indeterminate Thyroid Fine Needle Aspiration Biopsies. Thyroid. 2024 Apr;34(4):531u20135. Verma V, Mehta N, Liang KJ, Mishra A, Carin L. Meta-Learned Attribute Self-Interaction Network for Continual and Generalized Zero-Shot Learning. In: Proceedings 2024 IEEE Winter Conference on Applications of Computer Vision Wacv 2024. 2024. p. 2709u201319. Glass M, Ji Z, Davis R, Pavlisko EN, DiBernardo L, Carney J, et al. A machine learning algorithm improves the diagnostic accuracy of the histologic component of antibody mediated rejection (AMR-H) in cardiac transplant endomyocardial biopsies. Cardiovasc Pathol. 2024;72:107646. Dow ER, Jeong HK, Katz EA, Toth CA, Wang D, Lee T, et al. A Deep-Learning Algorithm to Predict Short-Term Progression to Geographic Atrophy on Spectral-Domain Optical Coherence Tomography. JAMA Ophthalmol. 2023 Nov 1;141(11):1052u201361. Dov D, Elliott Range D, Cohen J, Bell J, Rocke DJ, Kahmke RR, et al. Deep-Learning-Based Screening and Ancillary Testing for Thyroid Cytopathology. Am J Pathol. 2023 Sep;193(9):1185u201394. Zhang H, Wang C, Wang Z, Duan Z, Chen B, Zhou M, et al. Learning Hierarchical Document Graphs From Multilevel Sentence Relations. IEEE Trans Neural Netw Learn Syst. 2023 Aug;34(8):4273u201385. Luo D, Xu H, Carin L. Differentiable Hierarchical Optimal Transport for Robust Multi-View Learning. IEEE transactions on pattern analysis and machine intelligence. 2023 Jun;45(6):7293u2013307. Assaad S, Dov D, Davis R, Kovalsky S, Lee WT, Kahmke R, et al. Thyroid Cytopathology Cancer Diagnosis from Smartphone Images Using Machine Learning. Mod Pathol. 2023 Jun;36(6):100129. Chapfuwa P, Tao C, Li C, Khan I, Chandross KJ, Pencina MJ, et al. Calibration and Uncertainty in Neural Time-to-Event Modeling. IEEE Trans Neural Netw Learn Syst. 2023 Apr;34(4):1666u201380. Li Z, Cong Y, Chen X, Qi J, Sun J, Yan T, et al. Vision transformer-based weakly supervised histopathological image analysis of primary brain tumors. Iscience. 2023 Jan 20;26(1). Bai K, Cheng P, Hao W, Henao R, Carin L. Estimating Total Correlation with Mutual Information Estimators. In: Proceedings of Machine Learning Research. 2023. p. 2147u201364. Mariottoni EB, Datta S, Shigueoka LS, Jammal AA, Tavares IM, Henao R, et al. Deep Learning-Assisted Detection of Glaucoma Progression in Spectral-Domain OCT. Ophthalmol Glaucoma. 2023;6(3):228u201338. Xu H, Liu J, Luo D, Carin L. Representing Graphs via Gromov-Wasserstein Factorization. IEEE transactions on pattern analysis and machine intelligence. 2023 Jan;45(1):999u20131016. Verma VK, Mehta N, Si S, Henao R, Carin L. Pushing the Efficiency Limit Using Structured Sparse Convolutions. In: Proceedings 2023 IEEE Winter Conference on Applications of Computer Vision Wacv 2023. 2023. p. 6492u2013502. Zhan X, Li Y, Dong X, Liang X, Hu Z, Carin L. elBERto: Self-supervised commonsense learning for question answering. Knowledge Based Systems. 2022 Dec 22;258. Sundararaman D, Subramanian V, Wang G, Xu L, Carin L. Improving Downstream Task Performance by Treating Numbers as Entities. In: International Conference on Information and Knowledge Management Proceedings. 2022. p. 4535u20139. Draelos RL, Carin L. Explainable multiple abnormality classification of chest CT volumes. Artificial intelligence in medicine. 2022 Oct;132:102372. Xia M, Kheterpal MK, Wong SC, Park C, Ratliff W, Carin L, et al. Lesion identification and malignancy prediction from clinical dermatological images. Sci Rep. 2022 Sep 23;12(1):15836. Chapfuwa P, Rose S, Carin L, Meeds E, Henao R. Capturing Actionable Dynamics with Structured Latent Ordinary Differential Equations. In: Proc Mach Learn Res. 2022. p. 286u201395. Dov D, Kovalsky SZ, Feng Q, Assaad S, Cohen J, Bell J, et al. Use of Machine Learning-Based Software for the Screening of Thyroid Cytopathology Whole Slide Images. Arch Pathol Lab Med. 2022 Jul 1;146(7):872u20138. Dov D, Assaad S, Syedibrahim A, Bell J, Huang J, Madden J, et al. A Hybrid Human-Machine Learning Approach for Screening Prostate Biopsies Can Improve Clinical Efficiency Without Compromising Diagnostic Accuracy. Arch Pathol Lab Med. 2022 Jun 1;146(6):727u201334. Zhou L, Meng X, Huang Y, Kang K, Zhou J, Chu Y, et al. An interpretable deep learning workflow for discovering subvisual abnormalities in CT scans of COVID-19 inpatients and survivors. Nature Machine Intelligence. 2022 May 1;4(5):494u2013503. Wisely CE, Wang D, Henao R, Grewal DS, Thompson AC, Robbins CB, et al. Convolutional neural network to identify symptomatic Alzheimer's disease using multimodal retinal imaging. Br J Ophthalmol. 2022 Mar;106(3):388u201395. Gao Q, Wang D, Amason JD, Yuan S, Tao C, Henao R, et al. GRADIENT IMPORTANCE LEARNING FOR INCOMPLETE OBSERVATIONS. In: Iclr 2022 10th International Conference on Learning Representations. 2022. Yuan S, Li Y, Wang D, Bai K, Carin L, Carlson D. Learning to Weight Filter Groups for Robust Classification. In: Proceedings 2022 IEEE Cvf Winter Conference on Applications of Computer Vision Wacv 2022. 2022. p. 3321u201330. Wong SC, Ratliff W, Xia M, Park C, Sendak M, Balu S, et al. Use of convolutional neural networks in skin lesion analysis using real world image and non-image data. Front Med (Lausanne). 2022;9:946937. Liu J, Shen D, Zhang Y, Dolan B, Carin L, Chen W. What Makes Good In-Context Examples for GPT-3? In: Deelio 2022 Deep Learning Inside Out 3rd Workshop on Knowledge Extraction and Integration for Deep Learning Architectures Proceedings of the Workshop. 2022. p. 100u201314. Hao W, Mehta N, Liang KJ, Cheng P, El-Khamy M, Carin L. WAFFLe: Weight Anonymized Factorization for Federated Learning. IEEE Access. 2022 Jan 1;10:49207u201318. Guo Q, Chen J, Wang D, Wang Y, Deng X, Carin L, et al. Tight Mutual Information Estimation With Contrastive Fenchel-Legendre Optimization. In: Advances in Neural Information Processing Systems. 2022. Bai K, Wang G, Li J, Park S, Lee S, Xu P, et al. Open World Classification with Adaptive Negative Samples. In: Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing Emnlp 2022. 2022. p. 4378u201392. Chapfuwa P, Rose S, Carin L, Meeds E, Henao R. Capturing Actionable Dynamics with Structured Latent Ordinary Differential Equations. In: Proceedings of Machine Learning Research. 2022. p. 286u201395. Si S, Oates CJ, Duncan AB, Carin L, Briol FX. Scalable Control Variates for Monte Carlo Methods Via Stochastic Optimization. In: Springer Proceedings in Mathematics and Statistics. 2022. p. 205u201321. Chen J, Xiu Z, Goldstein BA, Henao R, Carin L, Tao C. Supercharging Imbalanced Data Learning With Energy-based Contrastive Representation Transfer. In: Adv Neural Inf Process Syst. 2021. p. 21229u201343. Meireles OR, Rosman G, Altieri MS, Carin L, Hager G, Madani A, et a",
  "content_length": 147971,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:03"
}