{
  "name": "Laxminarayana S. Pillutla",
  "homepage": "http://intranet.daiict.ac.in/~laxminarayana_pillutla",
  "status": "success",
  "content": "Homepage of Laxminarayana Pillutla Welcome to the Homepage of Prof. Laxminarayana Pillutla at DA-IICT Contact Address: Room # 4203, Faculty Block-4 Dhirubhai Ambani-Institute of Information and Communication Technology (DA-IICT) Post Bag 4 (Near Indroda Circle) Gandhinagar - 382007 Gujarat India. E-mail: firstname_lastname \"@\" daiict.ac.in Phone: +91-79-30510621 About me: I am currently an Assistant Professor at DA-IICT. I obtained my PhD from the University of British Columbia, Vancouver (rated as the most liveable city in the world; it has some great beaches and has nature in its most pristine form), BC, Canada in 2009. My PhD supervisor was Prof. Vikram Krishnamurthy. My PhD dissertation title was: Resource Management in Wireless Networks. Prior to that I obtained my Masters degree from Wichita State University, Wichita, KS, USA, under the guidance of Dr. Sudharman Jayaweera (currently at University of New Mexico). My Masters thesis title was: Capacity of MIMO Systems - A Theoretical and Practical Perspective. Research areas: Wireless Sensor Networks (WSNs) Cognitive Radio (CR) Vehicular Ad Hoc Networks (VANETs) Information theory Statistical Signal Processing Convex Optimization Game Theory Note: I am currently focusing on application of techniques such as Markov decision processes and game theory to the general design of wireless networks. I am also looking for a few motivated M. Tech and PhD students to work on the above mentioned research areas. Motivated B. Tech students may also contact me in case if they are interested in working on projects that involve working with embedded systems. Typical projects would involve programming of sensor nodes using TinyOS. Teaching: Autumn 2010: CT537 - Advanced Wireless Communications.course outline Winter 2010: CT517 - Statistical Estimation Theory.course outline Research Projects: Wireless Telemedicine using body area sensor networks (this project is sponsored by the Science and Engineering Research Council (SERC), Department of Science and Technology (DST) under the fast track scheme for young scientists. Total cost of the project is: Rs. 12.6 Lacs. Total duration of the project is: 3 Years). Various aspects of the project will be posted shortly. copyright notice: \"This material is presented to ensure timely dissemination of scholarly and technical work. Copyright and all rights therein are retained by authors or by other copyright holders. All persons copying this information are expected to adhere to the terms and constraints invoked by each author's copyright. In most cases, these works may not be reposted without the explicit permission of the copyright holder.\" Publications: Journals/Book chapters: L. S. Pillutla and V. Krishnamurthy, \"A Price based Decentralized Rate Adaptation for IEEE 802.11 WLANS\", (accepted with minor revisions) for publication in a special issue on Adaptive communication in wireless networks, Springer Wireless Personal Communications. (will be posted shortly). T. Issariyakul, L. S. Pillutla, and V. Krishnamurthy, \"Tuning Radio Resource in an Overlay Cognitive Radio Network for TCP: Greed Isn’t Good\", IEEE Communications Magazine, July 2009, vol. 47, no. 7, pp. 57-63. (click here for pdf file). Q. Pang, L. S. Pillutla, V. C.M. Leung, and V. Krishnamurthy, \"Impact of Cognitive Radio Links on Upper Layer Protocol Design\", in Cognitive Radio Networks, Auerbach Publications, CRC Press, Editors: Y. Xiao and F. Hu, 2008 (invited). L. S. Pillutla and V. Krishnamurthy, \"Data Gathering in Correlated Wireless Sensor Networks with Cooperative Transmission\", in Cooperative Communications for Improved Wireless Network Transmission, IGI-Global publications, Editors: M. Uysal, 2008 (invited). Conference papers: L. S. Pillutla and V. Krishnamurthy, “Game Theoretic Rate Adaptation in Spectrum-Overlay Cognitive Radio Networks,” in proceedings of IEEE Global Communications Conference (Globecom), New Orleans, LA, December 2008. (click here for pdf file). L. S. Pillutla and V. Krishnamurthy, “Mutual Information and Energy Tradeoff in Correlated Wireless Sensor Networks,” in proceedings of IEEE Conference on Communications (ICC), Beijing, China, May 2008. (click here for pdf file). L. S. Pillutla and V. Krishnamurthy, “Minimum Energy Data Gathering in Correlated Wireless Sensor Networks with Cooperative Transmission,” in proceedings of IEEE Conference on Communications (ICC), Glasgow, Scotland, June 2007. (click here for pdf file). L. S. Pillutla and V. Krishnamurthy, “Structural Results on Optimal Rate and Number of Clusters in Cooperative MIMO Sensor Networks,” in proceedings of IEEEAsilomar Conference on Signals, Systems and Computers, Monterey, CA, USA, November 2005. (click here for pdf file). L. S. Pillutla and V. Krishnamurthy, “Joint Rate and Cluster Optimization in Cooperative MIMO Sensor Networks,” in proceedings of IEEE Conference on Signal Processing Advances in Wireless Communications (SPAWC), New York, NY, USA, June 2005. (click here for pdf file). L. S. Pillutla and S. K. Jayaweera, “Capacity of MIMO Systems in Rayleigh Fading and Shadowing,” in proceedings of IEEE Asilomar Conference on Signals, Systems and Computers, Monterey, CA, USA, November 2004. (click here for pdf file). L. S. Pillutla and S. K. Jayaweera, “Capacity of MIMO Systems in Rayleigh Fading with Sub-Optimal Adaptive Transmission Schemes,\" in proceedings of IEEE International Symposium on Information Theory and its Applications (ISITA) 2004, Parma, Italy, October 2004. (click here for pdf file). L. S. Pillutla and S. K. Jayaweera, “MIMO Capacity of an OFDM-based System under Ricean Fading,” in proceedings of IEEE Vehicular Technology Conferenc (VTC), Milan, Italy, May 2004. (click here for pdf file). (website last updated on July 20, 2010)",
  "content_length": 5781,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:10"
}