{
  "name": "Lazaros F. Merakos",
  "homepage": "http://cnl.di.uoa.gr/merakos",
  "status": "success",
  "content": "Prof. Lazaros Merakos Prof. Lazaros Merakos Communication Networks Laboratory Department of Informatics and Telecommunications University of Athens Panepistimiopolis, Ilissia Athens, 15784 Greece Tel: +30 210 727 5323 Fax: +30 210 727 5601 Email: merakos@di.uoa.gr Short CV Lazaros Merakos received the Diploma in Electrical and Mechanical Engineering from the National Technical University of Athens, \t\tAthens, Greece, in 1978, and the M.S. and Ph.D. degrees in Electrical Engineering from the State University of New York, Buffalo, in 1981 and 1984, respectively. From 1983 to 1986, he was on the faculty of the Electrical Engineering and Computer Science Department, University of Connecticut, Storrs. From 1986 to 1994, he was on the faculty of the Electrical and Computer Engineering Department, Northeastern University, Boston, MA. During the period 1993–1994, he served as Director of the Communications and Digital Processing Research Center, Northeastern University. During the summers of 1990 and 1991, he was a Visiting Scientist at the IBM T. J. Watson Research Center, Yorktown Heights, NY. In 1994, he joined the faculty of the University of Athens, Athens, Greece, where he is presently a Professor in the Department of Informatics and Telecommunications, and Scientific Director of the Networks Operations and Management Center. His research interests are in the design and performance analysis of communication networks, and wireless/mobile communication systems and services. He has authored more than 200 papers in the above areas. He has served as the scientific director of the Communication Networks Laboratory of the University of Athens in numerous research projects, including the projects RAINBOW, WAND, MOBIVAS, WINE, EURO-CITI, POLOS, ANWIRE, E2R, E2RII, E3, Self-NET funded by the European Union. Dr. Merakos is chairman of the board of the Greek Schools Network, and member of the board of the National Research Network of Greece. In 1994, he received the Guanella Award for the Best Paper presented at the International Zurich Seminar on Mobile Communications. Administrative Positions Assistant Director, CDSP Research Center, Northeastern University, USA, (1990-1992). Director, CDSP Research Center, Northeastern University, USA (1992-1994). Scientific person in charge of the Network Operations and Management Center of the University of Athens (1997-Present). Director of the Communication Networks Laboratory, Department of Informatics and Telecommunications, University of Athens, (1994-Present). President of the Greek Universities Network (2000-2008). Chairman of the Executive Board of the Greek Schools Network (1999-Present) Member of the board of the National Research Network of Greece (1996-Present). Director of the Communications and Signal Procesing Sector of the Department of Informatics and Telecommunications (2006–2009). International Presence University of Connecticut Faculty Fellowship, 1985. Co-author of the publication that received the Best Paper Award in International Zurich Seminar on Mobile Communications, ETH, Zurich, Switzerland, March 1994. Co-author of the publication that received the Best Paper Award in IEEE International Symposium on Communications, Control and Signal Processing (ISCCSP 2008), March 2008. Evaluator of research proposals for the USA National Science Foundation and the European Commission. President of the Technical Committee of the Networking 2004 Conference (Wireless Networks Track). Program Chair of IFIP DAIS-FMOODS 2004. Organizer, TPC member, Session chairman and invited speaker in various international conferences. Special issue editor in IEEE Communications Magazine, IEEE Personal Communications Magazine. Author of 230 scientific publications in books, international journals, and peer-reviewed conference proceedings. Scientific person in charge and Senior Researcher in about 60 European and National research and development projects. More than 1000 citations. Reviewer in various journals, such as ΙΕΕΕ Transactions on Communications, Vehicular Technology, IEEE Journal on Selected Areas in Communications. Research Projects (Scientific Person in Charge) International Projects WAND: Wireless AΤM Network Demonstrator, 1995-1997 RAINBOW: Radio Access Independent Broadband on Wireless, 1995-1997 QoS in Wireless LANs, 1997 Wireless Internet Networks (WINE), 2000-2001 MOBIVAS: Μobile value-added-services through software radio, 2000 - 2002 EUROCITI: EUROpean CITIes platform for on-line transaction services, 2000-2002 POLOS: Ιntegrated Platform for Location -Based Services, 2002 - 2004 ANWIRE: Academic Network on Wireless Internet Research in Europe, 2002 – 2004 E2R: End-to-End Reconfigurability, 2004 – 2005 LIAISON: Location Based Services for the Enhancement of Working Environment, 2004 -2007 E2R: End-to-End Reconfigurability - Phase 2, 2006 - 2007 Enabling Grids for E-Science II (EGEE-II), 2006 - 2008 End-to-End Efficiency E3, 2008 – 2009 SELF NET: Management OF Cognitive Future Internet Elements, 2008 - 2010 PeerAssist: A P2P platform supporting virtual communities to assist independent living of senior citizens, 2010-2013 Greek Projects Networking and advanced services over a public ATM network, 1999 - 2001 Harmonization and evolution of Intelligent Network protocols, 1998-1999 Integration of DECT wireless access technologies in existing and futute OTE systems-networks, 1999 - 2000 Environment creation and software development for the control of integrated services for digital telecommunication centers of public networks for Internet use, 1999 - 2000 Video and audio transmission with guaranteed Quality of Service over IP Networks (PENED), 2000 - 2001 Study of 3G mobile systems (IMT 2000 - UMTS), 2001 - 2004 ΤΕΜΡΟ: TEchnologies and applications in Multi-PrOtocol networks, 2002 - 2003 IP over WDM - Alternative techniques for the management of IP traffic over WDM networks, 2001 Broadband Services for ADSL Networks, 2002 Methods and Tools for the Modeling of Future Mobile Communication Systems (Inter-country Collaboration between Greece and Germany), 2003 – 2004 Always Best Connected in Heterogeneous Mobile Communication Networks (PYTHAGORAS - EPEAEK II), 2004 - 2005 Design and Implementation of a User Authentication Mechanism in Wireless Local Area Networks, 2004 - 2006 Multimedia Transmission in Wireless Local Area Networks Environment (Inter-country Collaboration between Greece and Hungary), 2004 - 2006 ΙNTERWISIS: Integration of GPRS and RFID for Wide-area Wireless Security & Identification Systems (PABET), 2005 - 2007 Integrated Architecture for the provision of the \"Always Best Connected\" concept in 4th Generation Mobile Communication Networks (PENED), 2005 - 2008 Sensor Networks: Algorithm Design, Protocol Design and Performance Study (PENED), 2005 - 2008 CORINE: Support of Location Services in In-doors and Out-doors spaces, 2006 – 2008 Using broadband mesh networks to support advanced applications for intelligent traffic systems, 2006 - 2008 Design and implementation of an advanced access management mechanism in heterogeneous mobile networks, 2006 - 2007 SECURENET: Adaptable mobile Video transmission for surveillance and security services, 2006 - 2007 Cross-Layer Design for the Quality of Service improvement in heterogeneous networks, (HRAKLEITOS II) Resource Management in Opportunistic Spectrum Access Networks, (HRAKLEITOS II) Recent Publications Journals N. Houssos, A. Alonistioti, L. Merakos, \"Specification and dynamic introduction of 3rd party, service-specific adaptation policies for mobile applications\", Journal on Mobile Networks and Applications (MONET), Special Issue on Mobile Services, Vol. 10, No. 4, Jan. 2005, pp. 405-421. M. Koutsopoulou, A. Kaloxylos, A. Alonistioti and L. Merakos, \"A Platform for Charging, Billing & Accounting in Future Mobile Networks,\" Computer Communications, Elsevier, Special Issue on \"Emerging Middleware for Next Generation Networks\", to appear in Fall 2005. A. Kaloxylos, G. Lampropoulos, N. Passas and L. Merakos, \"A Flexible Handover Mechanism for Seamless Service Continuity in Heterogeneous Environments,\" Computer Communications, Elsevier Science, Special issue on \"End-to-end QoS provision advances\", 2005. V. Gazis, N. Alonistioti and L. Merakos, \"Toward a generic Always Best Connected capability in integrated UMTS/WLAN mobile networks (and beyond)\", IEEE Wireless Communications Magazine, Vol. 12, No 3, June 2005. G. Alyfantis, S. Hadjiefthymiades, and L. Merakos, \"An Overlay Smart Spaces System for Load Balancing in Wireless LANs\", Mobile Networks and Applications (MONET) Journal, Vol. 11, No. 3, 2005. G. Lampropoulos, N. Passas, L. Merakos, and A. Kaloxylos, \"Handover Management Architectures in Integrated WLAN/Cellular Networks\", IEEE Communications Surveys and Tutorials, vol. 7, no. 4, December 2005. V. Gazis, N. Alonistioti and L. Merakos, \"Metadata design for reconfigurable protocol stacks in beyond 3G\", Wireless Personal Communications, Springer Science, Vol. 36, No 1, Jan. 2006, pp. 1-28. C. Xenakis and L. Merakos, \"Alternative Schemes for Dynamic Secure VPN Deployment over UMTS,\" Wireless Personal Communications, Springer, Vol. 36, No. 2, Jan. 2006, pp. 163-194. V. Gazis, N. Alonistioti and L. Merakos, \"A generic model for reconfigurable protocol stacks in beyond 3G\", IEEE Wireless Communications Magazine, Vol. 13, No.3, 2006. C. Xenakis, N. Laoutaris, L. Merakos and I. Stavrakakis, \"A generic characterization of the overheads imposed by IPsec and associated cryptographic N. Houssos, A. Alonistioti, L. Merakos, \"Specification and dynamic introduction of 3rd party, service-specific adaptation policies for mobile applications\", Journal on Mobile Networks and Applications (MONET), Special Issue on Mobile Services, Vol. 10, No. 4, Jan. 2005, pp. 405-421. M. Koutsopoulou, A. Kaloxylos, A. Alonistioti and L. Merakos, \"A Platform for Charging, Billing & Accounting in Future Mobile Networks,\" Computer Comm",
  "content_length": 22053,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:08"
}