{
  "name": "Le Gruenwald",
  "homepage": "https://cs.ou.edu/~database/faculty",
  "status": "success",
  "content": "Faculty Sponsor Dr. Le Gruenwald Dr. Le Gruenwald is a Professor, Dr. David W. Franke Professor, and Samuel Roberts Noble Foundation Presidential Professor in the School of Computer Science at The University of Oklahoma. She received her Ph.D. in Computer Science from Southern Methodist University, MS in Computer Science from the University of Houston, and BS in Physics from the University of Saigon. She worked for National Science Foundation (NSF) as a Cluster Lead and Program Director of the Information Integration and Informatics program and a Program Director of the Cyber Trust program; for NEC America, Advanced Switching Laboratory as a Member of the Technical Staff in the Database Management Group; for Southern Methodist University as a Lecturer in the Computer Science and Engineering Department; and for WRT as a Software Engineer. Dr. Gruenwald's major research interests include Stream and Sensor Databases, Cloud Databases, Multimedia Databases, Distributed Databases, Mobile Databases, Object-Oriented Databases, Real-Time Databases, Web Databases, Data Mining, and Data Warehouse. She has received grants from National Science Foundation, NASA, Department of Defense, National Library of Medicine, Department of Homeland Security, National Institute of Justice, Oklahoma City National Memorial Institute for the Prevention of Terrorism (MIPT), Computing Research Association, Lucent Technologies, Objectivity Technologies, AT&T, Informix, Tri-Steel Structures, Northrop-Grumman, Regional AIDS Interfaith Network, Oklahoma Department of Quality Control, Oklahoma State Department of Health, Oklahoma Juvenile Affairs, and The University of Oklahoma - Vice President for Research. She has published over one hundred and eighty technical papers in books, journals, and conference proceedings. She has served as an editorial board member of the Knowledge and Information Systems Journal (KAIS), the Journal of Information Security (JIS), the EAI Endorsed Transaction on Collaborative Computing (TCC) and the Open Journal of Databases (OJDB); an area editor for Sensor Networks of the Encyclopedia of Database Systems; a review board member of the Proceedings of Very Large Databases Endowment (PVLDB); a co-organizer of the 2012 and 2013 Big Data Mining - International Workshop on Big Data, Streams and Heterogeneous Source Mining: Algorithms, Systems, Programming Models and Applications (BigMine); a program co-chair of the 2010 International Conference on Collaborate Computing (CollorateCom 2010); program co-chair of the 2009 ACM International Workshop on Data Engineering for Wireless and Mobile Access (MobiDE); Workshops co-chair of the 2009 ACM International Conference on Mobile Data Management (MDM); a chair of the 2000 ACM SIGMOD Undergraduate Scholarship committee; and an organizer, database session chair and a program committee member of many other international conferences/workshops. Among many awards and honors she has received are the Recognition for Superior Accomplishments and Valuable Services to the Directorate of Computer and Information Science and Engineering, National Science Foundation, August 2012; the Recognition for Contribution as program co-chair of the International Conference on Collaborate Computing (CollorateCom), 2010; the ACM Recognition Award for serving as Program Chair for the MobiDE workshop, 2009; the Distinguished Alumnus Honor, the 40th Anniversary of Department of Computer Science and Engineering, Southern Methodist University, November 2007; the Dr. David W. Franke Professorship, The University of Oklahoma, August 2007; the 2001-2002 National Residence Hall Awards for Outstanding Leadership, Scholarship, and Service; and the 1998 Samuel Roberts Noble Foundation Presidential Professorship Award from The University of Oklahoma. She was a visiting scholar at University of Clemont-Ferrand in France, University of Paderborn in Germany, Nanyang Technological University in Singapore and IBM India Research Lab in Delhi, India. She has graduated many Ph.D. students and Master's students. She is currently a Director of the Database Laboratory at The University of Oklahoma. She is a member of ACM, SIGMOD, and IEEE Computer Society. For problems or questions regarding this web contact database@cs.ou.edu",
  "content_length": 4287,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:07"
}