{
  "name": "Leah Findlater",
  "homepage": "http://faculty.washington.edu/leahkf",
  "status": "success",
  "content": "Leah Findlater -- Home Leah Findlater I'm an associate professor in Human Centered Design and Engineering at the University of Washington. I'm also an adjunct associate professor in Computer Science and Engineering, an affiliate professor in Disability Studies, and an associate director of UW CREATE (Center for Research and Education on Accessible Technology and Experiences). Since 2021 I have also been leading a research team in AI and accessibility at Apple. I received my PhD in Computer Science from the University of British Columbia. Before joining HCDE, I was as an assistant professor at the University of Maryland's College of Information Studies, and I spent two years as an NSERC Postdoctoral Fellow at the UW Information School. I received an NSF CAREER Award in 2014. My research has been funded by NSF, the Department of Defense, Apple, Microsoft, Google, Mozilla, Adobe, and Nokia. Research For more information on my group's research, please visit my Google Scholar page and the Inclusive Design Lab webpage. My research goal is to ensure that the next generation of computing technologies is accessible to everyone. I am interested in how to create technologies that adapt to accommodate individual user needs and preferences, whether to improve basic interactions such as touchscreen text entry or more complex tasks such as working with machine learning models. I conduct mixed methods research, from controlled lab studies to qualitative interviews and field deployments. Prospective Students I like to keep my group on the smaller side and look for about one new student per year. Ideal candidates have a technical background, some research experience, and a demonstrated commitment to accessibility and the disability community. If you apply, please make sure to address in your application why HCDE is a better target department for you than Computer Science & Engineering or the UW iSchool. I am not able to respond to all email or LinkedIn messages from prospective students. Contact Email: leahkf at uw dot edu Updated November 2024.",
  "content_length": 2063,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:08"
}