{
  "name": "Leandro Marín Muñoz",
  "homepage": "http://webs.um.es/leandro/miwiki/doku.php",
  "status": "success",
  "content": "inicio [LEANDRO MARIN MUÑOZ] Menú principal Profesor Titular de Universidad. Área de Matemática Aplicada. Departamento de Ingeniería y Tecnología de Computadores. Facultad de Informática. Universidad de Murcia Menú principal Página de Inicio Docencia Investigación Gestión CV Contacto Divulgación Main Menu Resume Contact Docencia 2024-2025 Primer Cuatrimestre Grado en Ingeniería Informática: Álgebra y Matemática Discreta. Material para clase invertida. Práctica 1 Comandos Básicos de Sage Práctica 1 Víedo 1.1 Práctica 01 Ejercicio 1 Vídeo 1.2 Práctica 01 Ejercicio 2 Vídeo 1.3 Práctica 01 Ejercicio 3 Vídeo 1.4 Práctica 01 Ejercicio 4 Semana 1 Vídeo Definición de Cuerpo y Ejemplos, pdf Vídeo Aritmética de Matrices, pdf Vídeo Aritmética Modular, pdf Vídeo Operaciones elementales por filas, pdf Vídeo Reducción por filas, pdf Vídeo Sistemas de Ecuaciones y Reducción por Filas, pdf Práctica 2 Práctica 2 Vídeo 2.1 Práctica 02 Ejercicio 1 Vídeo 2.2 Práctica 02 Ejercicio 2 Vídeo 2.3 Práctica 02 Ejercicio 3 Vídeo 2.4 Práctica 02 Ejercicio 4 Vídeo 2.5 Práctica 02 Ejercicio 5 Semana 2 Vídeo Máximo común divisor y ecuaciones diofánticas, pdf Vídeo Teorema Chino de los Restos, pdf Vídeo Unidades del anillo Zn. Fórmula de Euler, pdf Vídeo Exponenciación modular, pdf Práctica 3 Práctica 3 Vídeo 3.1 Práctica 03 Ejercicio 1 Vídeo 3.2 Práctica 03 Ejercicio 2 Vídeo 3.3 Práctica 03 Ejercicio 3 Vídeo 3.4 Práctica 03 Ejercicio 4 Vídeo 3.5 Práctica 03 Ejercicio 5 Semana 3 Vídeo Espacios Vectoriales, pdf Vídeo Representación Implícita y Paramétrica de un Espacio Vectorial, pdf Vídeo Matrices Inversas e Inversas Parciales, pdf Vídeo Conjuntos linealmente independientes y generadores, pdf Práctica 4 Práctica 4 Víedo 4.1 Práctica 04 Ejercicio 1 Víedo 4.2 Práctica 04 Ejercicio 2 Víedo 4.3 Práctica 04 Ejercicio 3 Semana 4 Vídeo Aplicaciones Lineales, pdf Vídeo Determinantes, pdf Vídeo Bases, Coordenadas y Dimensión, pdf Práctica 5 Práctica 5 Víedo 5.1 Práctica 05 Ejercicio 1 Víedo 5.2 Práctica 05 Ejercicio 2 Víedo 5.3 Práctica 05 Ejercicio 3 Semana 5 Sesiones de problemas. Examen parcial (11 de Octubre de 2024) Práctica 6 Práctica 6 Víedo 6.1 Práctica 06 Ejercicio 1 Víedo 6.2 Práctica 06 Ejercicio 2 Víedo 6.3 Práctica 06 Ejercicio 3 Víedo 6.4 Práctica 06 Ejercicio 4 Semana 6 Vídeo Inclusión e Igualdad de Subespacios, pdf Vídeo Suma e Intersección de Espacios Vectoriales, pdf Grafos, pdf Práctica 7 Práctica 7 Práctica 7 Resuelta Semana 7 Vídeo Producto Escalar y Espacio Ortogonal, pdf Práctica 8 Práctica 8 Semana 8 Vídeo Normas, Distancias y Ángulos, pdf Semana 9 Vídeo Geometría Afín, pdf Semana 10 Vídeo Transformaciones Afines, pdf Combinaciones afines, pdf Semana 11 Sesiones de problemas. Segundo Parcial (22 de Noviembre de 2024) Semanas 12, 13 y 14 Preparación del final Trabajo voluntario para subir nota Geomería Proyectiva, pdf Transformaciones Proyectivas Docencia 2023-2024 Primer Cuatrimestre Grado en Ingeniería Informática: Álgebra y Matemática Discreta. Material para clase invertida. El primer parcial será el viernes 3 de noviembre y el segundo el viernes 15 de diciembre Semana 1 Vídeo Definición de Cuerpo y Ejemplos, pdf Vídeo Aritmética de Matrices, pdf Vídeo Aritmética Modular, pdf Vídeo Operaciones elementales por filas, pdf Vídeo Reducción por filas, pdf Vídeo Sistemas de Ecuaciones y Reducción por Filas, pdf Semana 2 Vídeo Máximo común divisor y ecuaciones diofánticas, pdf Vídeo Teorema Chino de los Restos, pdf Vídeo Unidades del anillo Zn. Fórmula de Euler, pdf Vídeo Exponenciación modular, pdf Semana 3 Vídeo Espacios Vectoriales, pdf Vídeo Representación Implícita y Paramétrica de un Espacio Vectorial, pdf Vídeo Matrices Inversas e Inversas Parciales, pdf Vídeo Conjuntos linealmente independientes y generadores, pdf Semana 4 Vídeo Aplicaciones Lineales, pdf Vídeo Determinantes, pdf Semana 5 Vídeo Bases, Coordenadas y Dimensión, pdf Vídeo Cálculo de las bases de los cuatro espacios asociados a una matriz, pdf Vídeo Inclusión e Igualdad de Subespacios, pdf Vídeo Suma e Intersección de Espacios Vectoriales, pdf Semana 6 Grafos Semana 7 Sesiones de problemas. Semana 8 Sesiones de problemas. (Examen Parcial) Semana 9 Vídeo Producto Escalar y Espacio Ortogonal, pdf Vídeo Normas, Distancias y Ángulos, pdf Semana 10 Vídeo Geometría Afín, pdf Semana 11 Vídeo Transformaciones Afines, pdf Combinaciones afines, pdf Semana 12 Sesiones de problemas de giros, traslaciones, simetrías y proyecciones afines. Semanas 13 y 14 Preparación del final Trabajo voluntario para subir nota Geomería Proyectiva, pdf Transformaciones Proyectivas Docencia 2020-2021 Primer Cuatrimestre Grado en Ingeniería Informática: Álgebra y Matemática Discreta. Material para clase invertida. Vídeo Definición de Cuerpo y Ejemplos, pdf Vídeo Aritmética de Matrices, pdf Vídeo Aritmética Modular, pdf Vídeo Operaciones elementales por filas, pdf Vídeo Reducción por filas, pdf Vídeo Sistemas de Ecuaciones y Reducción por Filas, pdf Vídeo Máximo común divisor y ecuaciones diofánticas, pdf Vídeo Teorema Chino de los Restos, pdf Vídeo Unidades del anillo Zn. Fórmula de Euler, pdf Vídeo Exponenciación modular, pdf Vídeo Espacios Vectoriales, pdf Vídeo Matrices Inversas e Inversas Parciales, pdf Vídeo Conjuntos linealmente independientes y generadores, pdf Vídeo Aplicaciones Lineales, pdf Vídeo Determinantes, pdf Vídeo Representación Implícita y Paramétrica de un Espacio Vectorial, pdf Vídeo Bases, Coordenadas y Dimensión, pdf Vídeo Cálculo de las bases de los cuatro espacios asociados a una matriz, pdf Vídeo Inclusión e Igualdad de Subespacios, pdf Vídeo Suma e Intersección de Espacios Vectoriales, pdf Vídeo Producto Escalar y Espacio Ortogonal, pdf Vídeo Normas, Distancias y Ángulos, pdf Vídeo Geometría Afín, pdf Vídeo Transformaciones Afines, pdf Máster NTI: Fundamentos de Seguridad de la Comunicaciones (Algunos vídeos de criptografía correspondientes a un curso MOOC que pueden servir de introducción a este curso) Introducción Módulo 1. Alfabetos, listas y permutaciones Módulo 1. Números y su representación Módulo 1. Data Encryption Standard (DES) Módulo 1. Advanced Encryption Standard (AES) Módulo 1. Funciones de Resumen Digital (HASH) Módulo 2. Aritmética Entera Módulo 2. Aritmética Modular Módulo 2. Unidades y Cuerpos Finitos Módulo 2. El sistema RSA Módulo 2. Firmas Digitales Módulo 3. Geometría sobre cuerpos finitos Módulo 3. Curvas Elípticas Módulo 3. Operaciones con Puntos Módulo 3. Diffie-Hellman y firmas digitales Módulo 3. Cuestiones de Implementación Segundo Cuatrimestre Tecnologías Específicas de la Ingeniería Informática inicio.txt Última modificación: 2024/10/21 18:49por leandro@um.es",
  "content_length": 6654,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:11"
}