{
  "name": "Leandro Soares Indrusiak",
  "homepage": "https://www-users.cs.york.ac.uk/~lsi",
  "status": "success",
  "content": "Leandro Soares Indrusiak Dr Leandro Soares Indrusiak Honorary Visiting Professor University of York Computer Science RTS Group Home Research Teaching Supervision Curriculum Vitae Publications Blog Personal Leandro Soares Indrusiak is a visiting honorary professor at the University of York's Computer Science department. He was a full-time academic with the department from 2008 to 2023, and has since held a professorship at the University of Leeds. This website is no longer up-to-date, and only covers Leandro's tenure at York. During that period, he published more than 100 peer-reviewed papers in the main international conferences and journals on embedded and real-time computing (nine of them received best paper awards), has graduated ten PhD students, was the principal investigator in projects funded by EU, EPSRC, DFG, British Council and industry, was the director of the Doctoral Centre for Safe, Ethical and Secure Computing (SEtS) and the leader of the Real-Time and Distributed Systems Group between 2020-2023. News: Aug 2023 - Accepted a chair at the University of Leeds. Aug 2023 - Article on real-time routerless on-chip networks accepted for publication in ACM Transactions on Embedded Computing Systems. May 2023 - Invited talk on Digital Evil Twins at the Global Software Technology Summit 2023 in Edinburgh. Jan 2023 - Article on multi-communication networking for IoT accepted for publication in IEEE Transactions on Network and Service Management. Dec 2022 - Fully-funded PhD positions available on real-time networking, as part of the Doctoral Centre for Safe, Ethical and Secure Computing (SEtS). Application deadline on Feb 15 2023. July 2022 - Invited talk on university internationalisation at the 20th anniversary of TU Darmstadt's first international degree programme. June 2022 - Open PhD topics on design and optimisation of real-time networked systems (industrial, IoT, on-chip). June 2021 - PhD scholarships available as part of the Doctoral Centre for Safe, Ethical and Secure Computing (SEtS). Sep 2020 - Invited to be a keynote speaker at the X Brazilian Symposium on Computing Systems Engineering. June 2020 - One win and one nomination at the department's 2020 Teaching & Learning Awards. June 2020 - Online talk on evolutionary optimisation of Cyber-Physical Systems organised by IEEE CAS RS. Apr 2020 - Paper on a novel wormhole network control flow mechanism presented in the virtual CPS-IoT Week 2020 - RTAS conference. Presentation video available here. Sep 2019 - Papers accepted to the top journals in Cyber-Physical Systems and Industrial Informatics, and to the top conference in Real-Time Systems. Jul 2019 - Organised the 14th International Symposium on Reconfigurable Communication-centric Systems-on-Chip (ReCoSoC 2019) in York. June 2019 - Keynote speaker at the ICCST 2019 - International Conference on Computational Science and Technology. May 2019 - Position paper on evolutionary optimisation of real-time systems and networks published in arxiv. Dec 2018 - Invited speaker at the RTSS workshop on Efficient Real-time Data Network (ERDN 2018) Jul 2018 - Papers accepted to GECCO and RTCSA conferences, and to Real-Time Systems and ACM Transactions on Cyber-Physical Systems journals. Pre-prints available here: GECCO (1), GECCO (2), RTCSA, RTSJ and TCPS. Mar 2018 - Best paper award at DATE 2018: L. S. Indrusiak, A. Burns, B. Nikolic: Buffer-aware bounds to multi-point progressive blocking in priority-preemptive NoCs. Pre-print available via White Rose repository. Jan 2018 - Papers accepted to DATE, SAC and PDP conferences. Pre-prints available here: DATE, SAC, PDP (1) and PDP (2). Nov 2017 - PhD studentship available in the area of Reliable Real-Time Wireless Networking for Fractionated Autonomous Systems under my supervision. Jul 2017 - New articles published in the following journals: Real-Time Systems, Leibniz Transactions on Embedded Systems, Microprocessors and Microsystems and EURASIP Journal on Embedded Systems. Jul 2017 - Best paper award at ReCoSoC 2017: L. S. Indrusiak, J. Harbin, M. J. Sepulveda: Side-Channel Attack Resilience through Route Randomisation in Secure Real-Time Networks-on-Chip. Early version available via arxiv. Jul 2017 - Open PhD topics on: Multiprocessor platforms for embedded systems, Real-time IoT (Internet of Things), Application-specific multiprocessor, high-performance and cloud computing. Jun 2017 - Invited to be a keynote speaker at the 12th International Symposium on Reconfigurable Communication-centric Systems-on-Chip (ReCoSoC 2017). Feb 2017 - Article on multi/manycore dynamic resource allocation accepted to ACM Computing Surveys, pre-print available via White Rose repository. Feb 2017 - Invited to be a keynote speaker at the 15th International Workshop on Real-Time Networks (RTN 2017). Nov 2016 - Published a book on Dynamic Resource Allocation in Embedded, High-Performance and Cloud Computing with former postdoc researchers Piotr Dziurzanski and Amit Singh. October 2016 - Starting two new projects: EU H2020-funded SAFIRE and EPSRC-funded MCCps. October 2016 - Promoted to Reader. July 2016 - Best student paper award at SIGMAP 2016: H. R. Mendis, L. S. Indrusiak, Synthetic Workload Generation of Broadcast related HEVC Stream Decoding for Resource Constrained Systems. May 2016 - Best paper award at IEEE ISORC 2016: P. Dziurzanski, A. K. Singh, L. S. Indrusiak, Energy-Aware Resource Allocation in Multi-Mode Automotive Applications with Hard Real-Time Constraints. Feb 2016 - Paper on fast network-on-chip simulation and dynamic energy estimation published in the Journal of Systems Architecture. Jan 2016 - Organising DREAMCloud Workshop, co-located with HiPEAC Conference. July 2015 - Invited to be a keynote speaker at RTNS in Lille (Nov 2015) and EPEW in Madrid (Sep 2015). May 2015 - DreamCloud project is the cover story of May's edition of Networking+ magazine. May 2015 - Papers accepted at ECRTS, SAMOS, ReCoSoC, HPCS, INDIN and SEEA conferences, and in ACM Transactions on Design Automation of Electronic Systems. Apr 2015 - DreamCloud project covered by ComputerWorld UK. Mar 2015 - Speaker at Dagstuhl Seminar on Mixed Criticality on Multicore/Manycore Platforms. Oct 2014 - Keynote speaker at YDS 2014. Sep 2014 - Invited talk at the Brazil Korea Forum on Science, Technology and Innovation. July 2014 - Edited book on Embedded Systems Design. June 2014 - Paper on end-to-end schedulability of priority-preemptive Networks-on-Chip published in the Journal of Systems Architecture. May 2014 - Best paper award at ReCoSoC 2014: B. Sudev and L. S. Indrusiak, Low overhead predictability enhancement in non-preemptive network-on-chip routers using Priority Forwarded Packet Splitting. March 2013 - Recruiting another post-doc researcher for DreamCloud, more information here. September 2013 - EU-funded DreamCloud project started, now recruiting two postdocs. July 2013 - Serving on the Programme Committee of the 1st International Workshop on Mixed Criticality Systems (WMC). June 2013 - Papers accepted at SAMOS, EuroPar, ReCoSoC, ISVLSI and VLSI-SoC conferences, as well as the International Journal of Distributed Sensor Networks. Jan 2013 - Serving as Technical Program Chair to ISVLSI 2013 - IEEE Computer Society Annual Symposium on VLSI and SoC 2013 - International Symposium on System-on-Chip. Dec 2012 - Best paper award at IEEE NESEA 2012, with Ipek, James, Fiona, Paul and David. May 2013 - Full doctoral scholarship available on Energy-efficient Manycores, jointly supervised by myself and Andreas Hansson from ARM (EPSRC eligibility rules apply). Oct 2012 - Published proceedings of ReCoSoC 2012 on IEEE Xplore. Mai 2012 - Guest editor of a Special issue of JSA on Network-based Many-core Embedded Systems. Feb 2012 - Updated lists of open PhD, MSc, MEng and BEng projects. Oct 2011 - Invited talk and tutorial at the International Symposium on System-on-Chip 2011. Jun 2012 - Available post-doc position: Research Associate in Low Power Networks-on-Chip Jun 2011 - Blog with some views on embedded real-time systems research and education. Apr 2011 - DATE paper on fast and accurate NoC TLM simulation models - paper (at IEEE Xplore) and slides available. Mar 2011 - Paper on abstract models for MPSoC power estimation published on the March/April issue of IEEE Design & Test of Computers. Nov 2010 - Paper on fast and accurate NoC TLM simulation accepted to DATE 2011 Oct 2010 - Paper on abstract models for MPSoC power estimation accepted to IEEE Design & Test of Computers. Preprint available. Sep 2010 - Invited talk at the CREDES Project Workshop in Tallinn: Design and Validation of Application-specific Multiprocessor Platforms based on Networks-on-Chip Sep 2010 - Moving to new Computer Science Building on Sep 14 - New office: CSE/136 - New phone number: +44 1904 32 5570 Jun 2010 - Project proposal accepted by British Council: Mapping heuristics for time-predictable multi-core platforms based on Networks-on-Chip Jun 2010 - Papers accepted to FPL 2010 and INDIN 2010 May 2010 - Panel moderation at ReCoSoC 2010: Programmability of Reconfigurable and Communication-centric SoCs: are we doing any better? May 2010 - Advanced course on MPSoC Modeling at EMICRO 2010 (slides) Nov 2009 - Tutorial at IEEE IDT 2009: Application-Platform Mapping in MPSoCs (slides) Dr. Leandro Soares Indrusiak - Department of Computer Science - University of York - Deramore Lane - York - YO10 5GH - United Kingdom",
  "content_length": 9462,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:13"
}