{
  "name": "Leandros Tassiulas",
  "homepage": "http://seas.yale.edu/faculty-research/faculty-directory/leandros-tassiulas",
  "status": "success",
  "content": "Leandros Tassiulas | Professor | Yale Engineering Skip to Content Leandros Tassiulas John C. Malone Professor of Electrical & Computer Engineering Additional Appointments Computer Science Phone:(203) 436-5965 Email Room / Office:Room 336 Office Address:17 Hillhouse Avenue New Haven, CT 06511 Mailing Address:P.O. Box 208263 New Haven, CT 06520 About Leandros Tassiulas Degrees Ph.D., University of Maryland, College Park Perspectives Tassiulas's research interests are in the field of computer and communication networks with emphasis on fundamental mathematical models and algorithms of complex networks, architectures and protocols of wireless systems, sensor networks, novel internet architectures and experimental platforms for network research. His most notable contributions include the max-weight scheduling algorithm and the back-pressure network control policy, opportunistic scheduling in wireless, the maximum lifetime approach for wireless network energy management, and the consideration of joint access control and antenna transmission management in multiple antenna wireless systems. Selected Awards & Honors ACM International Symposium on Mobile AdHoc Networking and Computing, Mobihoc 2016 Best Paper Award, for the paper Throughput-optimal Broadcast in Wireless Networks with Dynamic Topology co-authored with Abhishek Sinha and Eytan Modiano from MIT. The IEEE Koji Kobayashi Computer and Communications Award 2016, for contributions to the scheduling and stability analysis of networks; IEEE Technical Field Award recognizing outstanding contributions to the integration of computers and communication. Distinguished Alumni Award 2015, Electrical and Computer Engineering, University of Maryland, College Park. IFIP Networking 2015 Best Paper Award for the paper Information Resilience Through User-Assisted Caching in Disruptive Content Centric Networks with V. Sourlas, I. Psaras G. Pavlou from University College London 8th ACM International Workshop on Wireless Network Testbeds Experimental Evaluation and Characterization, (MOBICOM 2013) Best Paper Award for the paper \"Online Energy Consumption Monitoring of Wireless Testbed Infrastructure through the NITOS EMF Framework\" 11th International Symposium on Modeling and Optimization in Mobile Ad-hoc and Wireless Networks (Wiopt) 2013 Best Paper Award for the paper An Iterative Double Auction for Mobile Data Offloading. Future Internet Assembly (FIA) 2013 Future Internet Award for the EU FP7 project \"Publish Subscribe Internet Technology\" (PURSUIT). IEEE INFOCOM Achievement award (2007) for Fundamental contributions to resource allocation in communication networks the inaugural award for lifetime achievement of INFOCOM. Fellow of IEEE (2007) for his contributions to algorithms, protocols and architectures of wireless communication networks. IBM Faculty partnership award, 2000. The \"Bodossaki Foundation Academic Prize\" in the field: Applied Science: Theories, Technologies and Applications of Parallel and Distributed Computing Systems, 1999, awarded to a scientist of Greek origin under the age of 40 for excellence in their field. Office of Naval Research Young Investigator Award for the project: Mobile Radio Network Architectures and Protocols for Reliable Information Transport in Dynamic Environment, 1997. NSF CAREER Award for the project Wireless Access Control for Optimal Spectral Efficiency, 1995. IEEE INFOCOM '94, Best Paper Award for the paper Meeting QOS Requirements in a Cellular Network with Reuse Partitioning. NSF Research Initiation Award for the project Resource Allocation Problems in Wireless Communication Networks, 1992. Selected Publications Complete publication list from Google Scholar G. Iosifidis, L. Gao, J. Huang, L. Tassiulas, \"A Double Auction Mechanism for Mobile Data Offloading Markets\", IEEE/ACM Transactions on Networking, 2015. I. Koutsopoulos, L. Tassiulas, L. Gkatzikis, \"Client-server games and their equilibria in peer-to-peer networks\", in Computer Networks, vol. 67, pp. 201-218, 2014. S. Keranidis, D. Giatsios, T. Korakis, I. Koutsopoulos, L. Tassiulas, T. Rakotoarivelo, M. Ott, T. Parmentelat, \"Experimentation on end-to-end performance aware algorithms in the federated environment of the heterogeneous PlanetLab and NITOS testbeds\" in Computer Networks, vol. 63, pp. 48-67, 2014. K. Poularakis, G. Iosifidis, L Tassiulas, \"Approximation Algorithms for Mobile Data Caching in Small Cell Networks,\" in IEEE Transactions on Communications, vol. 62, no. 10, pp. 3665-3677, 2014. V. Sourlas, L. Gkatzikis, P. Flegkas, L. Tassiulas, \"Distributed Cache Management in Information-Centric Networks\", in IEEE Transactions on Network and Service Management, vol. 10, no 3, pp. 286-299, 2013. P. Basaras, D. Katsaros, L. Tassiulas, \"Detecting Influential Spreaders in Complex, Dynamic Networks\", IEEE Computer magazine. Vol. 46(4) pp.26-31, 2013. S. Gitzenis, G. S. Paschos, L. Tassiulas \"Asymptotic Laws for Joint Content Replication and Delivery in Wireless Networks\", in IEEE Transactions on Information Theory, Vol. 59, No 12, pp. 2760-2776, 2013. G. Koutitas, L. Tassiulas, \"Periodic flexible demand: Optimization and phase management in the Smart Grid\", in IEEE Trans. on Smart Grids, vol. 4, pp. 1305-1313, 2013. M. Gatzianas, L. Georgiadis, L. Tassiulas \"Multiuser Broadcast Erasure Channel with Feedback Capacity and Algorithms\" IEEE Transactions on Information Theory, 2014. I. Koutsopoulos, L. Tassiulas, \"Optimal Control Policies for Power Demand Scheduling in the Smart Grid\", IEEE Journal on Selected Areas in Communications, Vol 30, no. 5, pp. 1049-1060, 2012. E. Matskani, N.D. Sidiropoulos, Z.-Q. Luo, L. Tassiulas, \"Convex Approximation Techniques for Joint Multiuser Downlink Beamforming and Admission Control\", IEEE Trans. on Wireless Communications, vol. 7, no. 7, pp 2682-2694 , 2008. T. Korakis, G. Jakllari, and L. Tassiulas, \"CDR-MAC: A protocol for full exploitation of directional antennas in ad-hoc wireless networks\", IEEE Transactions on Mobile Computing, Vol. 7. No. 2, pp 145-155, Feb. 2008. M. Gatzianas, L. Georgiadis and L. Tassiulas \"Control of wireless networks with rechargeable batteries\" IEEE Transactions on Wireless Communications, pp. 581-593, vol. 9, no. 2, Feb. 2010. Selected Patents US Patent Number 7,961,702 Title: Distributed bandwidth allocation and transmission coordination method for quality of service provision in wireless AD HOC networks Issue Date: June 14, 2011. US Patent Number: 6,377,812 Title: Combined power control and space-time diversity in mobile cellular communications Issue Date: April 23, 2002. Related Content Roberts Innovation Fund to support inventions in AI, environmental technology, and healthcare Sowing the seeds of a quantum revolution",
  "content_length": 6747,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:14"
}