{
  "name": "Leandro Soriano Marcolino",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/leandro-soriano-marcolino",
  "status": "success",
  "content": "Leandro Soriano Marcolino - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Leandro Soriano Marcolino Visiting Researcher Research Overview Main areas: Artificial Intelligence, Machine Learning, Multi-agent Systems Research interests: Teamwork, On-line Learning, On-line Planning Current domains: Computer Vision, Games, Arts, Robotics Show more… Profile Selected Awards Best Computer Science dissertation, University of Southern California (USC) 2016.Best research assistant, University of Southern California (USC) 2015.Best paper nominee, AAMAS 2011. 4 out of 127 full papers.Best paper, by the Sociedade Brasileira de Computação (Brazilian Society of Computer Science), 2009. Brief Biography Leandro Soriano Marcolino is a lecturer (assistant professor) at Lancaster University. He obtained his doctorate degree at University of Southern California (USC), advised by Milind Tambe. He has published in several key conferences in AI, robotics and machine learning, such as AAAI, AAMAS, IJCAI, CVPR, NeurIPS, ICRA and IROS. He received the best dissertation and the best research assistant award from the Computer Science Department at USC, had a paper nominated for best paper from the leading multi-agent conference AAMAS, and had his undergraduate work selected as the best in the nation by the Brazilian Computer Science Society. Leandro completed his masters degree in Japan (with the highly-competitive Monbukagakusho scholarship) and his undergraduate degree in Brazil at Universidade Federal de Minas Gerais (receiving a gold medal for finishing the course with the highest grades). His research interests are multi-agent teamwork, machine learning, robotics; with emphasis on coordination and collaboration. Leandro has conducted this research in the context of a variety of domains, such as swarm robotics, computer Go, video games, social networks, bioinformatics and architectural design. Curriculum Vitae Web Links http://wp.lancs.ac.uk/colab/ https://twitter.com/LeandroSMarc_AI PhD Supervision Interests My main research area is Artificial Intelligence, and Multi-agent Systems. I am interested in intelligent decision making, and machine learning. Usually my research is applied on digital games, robotics, social networks, arts/design, etc. I am happy to take PhD students, so feel free to contact me if you are interested in working together on exciting research topics!.. Show less Publications Activities PhD Students Research Groups Institute of Mathematics and Computer Science (ICMC) Visiting an external academic institution Universidade Federal de Minas Gerais Visiting an external academic institution Abdulrahman Alsaluli PhD student enable JavaScript to view email address Mohammad Alsomali PhD student enable JavaScript to view email address Pankaj Goikar PhD student enable JavaScript to view email address Lukasz Pelcner PhD student enable JavaScript to view email address Haoran Peng PhD student, Associate Lecturer enable JavaScript to view email address Artificial Intelligence DSI - Foundations Lancaster Intelligent, Robotic and Autonomous Systems Centre LIRA - Fundamentals SCC (Data Science) Back to listing Contact Details Department: Computing and Communications Office: B21, B - Floor, InfoLab21 TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 3563,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:11"
}