{
  "name": "Leana Golubchik",
  "homepage": "http://bourbon.usc.edu/leana",
  "status": "success",
  "content": "Home Leana Golubchik Stephen and Etta Varra Professor of Electrical and Computer Engineering and Computer Science Director, Women in Science and Engineering Program (WiSE) Leana Golubchik is a Professor of Electrical and Computer Engineering, with a joint appointment in Computer Science. She also currently serves as the Director of WiSE (Women in Science and Engineering Program) and is a past CS Department Associate Chair for PhD Programs. Prior to that Leana was a member of the CS faculty (and UMIACS) at the University of Maryland at College Park and a faculty member at Columbia University. She received her Ph.D. from UCLA. Leana's research interests are broadly in the design and evaluation of large scale distributed systems, including deep learning systems, hybrid clouds and data centers, and their applications in machine learning and data analytics as well as privacy and security. An overview of recent projects is on my group's - QED (Quantitative Evaluation and Design) - page. Leana is the Editor-in-Chief of the ACM Transactions on Modeling and Performance Evaluation of Computing Systems (ACM ToMPECS). She is a past Chair, Vice Chair, and Board of Directors member of ACM SIGMETRICS, and a past editor of the ACM Performance Evaluation Review. She has served as a program co-chair and general chair of ACM SIGMETRICS conference, program co-chair of MIS, a co-chair of HotMetrics, and is also on the Advisory Board of the Performance Evaluation journal and the ACM Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS). Leana received several awards, including the IBM Faculty Award, the NSF CAREER award, the Okawa Foundation award, and the IBM & NSF Doctoral Fellowships. She is a member of the IFIP WG 7.3 (elected in 2000) and a recipient of the WTS-LA Diversity Leadership Award, the USC Remarkable Women Award, and the USC Mellon Culture of Mentoring Award.",
  "content_length": 1911,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:08"
}