{
  "name": "Leandro A. Villas",
  "homepage": "http://www.ic.unicamp.br/~leandro",
  "status": "success",
  "content": "Leandro Villas Leandro Aparecido Villas é professor no Instituto de Computação da UNICAMP desde 2013. Ele recebeu em 2012 o título de Doutor em Ciência da Computação da Universidade Federal de Minas Gerais, tendo trabalhado na área de coleta de dados em redes de sensores sem fio. Passou um ano no laboratório PARADISE no SITE (School of Information Technology and Engineering) da Universidade de Ottawa, Canadá, como parte de seu doutorado sanduiche. Ele recebeu em 2007 o título de Mestre em Ciência da Computação pela Universidade Federal de São Carlos, tendo trabalhado na área de soluções de roteamento para redes de sensores sem fio. Nos últimos cinco anos, ele publicou 19 artigos em periódicos e 49 artigos em conferências, recebeu o prêmio de melhor artigo do XXV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos de 2007, e também o prêmio de pesquisador destaque de 2011 no PARADISE Lab da Universidade de Ottawa. Nos últimos dois anos, teve aprovado sete projetos de pesquisa totalizando mais de 150 mil reais.  Até o momento, ele formou um aluno de mestrado e concluiu uma orientação de iniciação científica. Além disso, está orientando cinco alunos de doutorado, quatro alunos de mestrado e supervisionando um pós-doutoramento. Em 2015, foi Program co-chair na track New Technologies and Services do 7th IFIP International Conference on New Technologies, Mobility and Security e chair das seções de poster, demos e PhD forum no 11th International Conference on Distributed Computing in Sensor Systems. Leandro é membro dos comitês de programa do GLOBECOM 2014 e 2015, SBRC 2014 e 2015, NCA 2015, DIVANet 2014, LATINCOM 2014 e 2015, WGRS 2015, P2MNET 2015, VNC 2015, WSCAR 2014 e NTMS 2015. Ele também tem revisado artigos para os seguintes periódicos Computer Networks, Ad Hoc Netwroks, Information Fusion, International Journal of Distributed Sensor Networks, Journal of Parallel and Distributed Computing e Journal of Network and Systems Management. Ensino 2017 Segundo semestre · MC001  Tecnologias da Informação · MO809  Tópicos em Sistemas Distribuídos 2016 Segundo semestre · MC001  Tecnologias da Informação Primeiro semestre · MC714  Sistemas Distribuídos 2015 Segundo semestre · MC714  Sistemas Distribuídos · MO809  Tópicos em Sistemas Distribuídos Primeiro semestre · MC102 - Algoritmos e Programação de Computadores 2014 Segundo semestre · MO809  Tópicos em Sistemas Distribuídos · MC102 - Algoritmos e Programação de Computadores Primeiro semestre · MC102 - Algoritmos e Programação de Computadores 2013 Segundo semestre · MO809  Tópicos em Sistemas Distribuídos · MC102 - Algoritmos e Programação de Computadores Primeiro semestre · MC302 - Programação Orientada a Objetos Pesquisa · 2013  Atual o iCities: Desenvolvimento de Serviços de nova Geração Inteligentes e Aplicações para Cidades Inteligentes · 2013 - Atual o Explorando a Abordagem Sensor Web e o Sensoriamento Participatório no Monitoramento de Rios Urbanos · 2013 - Atual o Algoritmos e Modelos para Redes de Sensores Sem Fio Utilizando os Conceitos de Redes Complexas · 2013 - Atual o SENUREVE: Serviços na Nuvem para Redes Veiculares · 2010 - 2012 o INCT em Sistemas Embarcados Críticos · 2010 - 2011 o   Developing Next Generation Intelligent Vehicular Networks and Applications · 2006 - 2008 o Monitoramento de Ambientes Físicos Cientes de Contexto através da Integração das Áreas de Realidade Virtual, Redes de Sensores sem Fio e Computação Ciente de Contexto Curriculum Vitae: Lattes Instituto de Computação - Universidade Estadual de Campinas Av. Albert Einstein, 1251 - CEP 13083-852 - Campinas/Brasil Sala 80 - Telefone (19) 3521-2984",
  "content_length": 3662,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:11"
}