{
  "name": "Lee A. Hollaar",
  "homepage": "http://www.cs.utah.edu/~hollaar",
  "status": "success",
  "content": "Professor Lee A. Hollaar Dr. Lee A. Hollaar Professor Emeritus School of Computing University of Utah Professor Hollaar retired in May 2014 after 34 years as a faculty member in the School of Computing (formerly the Department of Computer Science). He came to Utah in 1980 from the University of Illinois at Urbana-Champaign, where he had received his Ph.D. in 1975 and was then on the faculty. He received his B.S. degree in electrical engineering from the Illinois Institute of Technology in 1969, and has completed two years of law school at the University of Utah's College of Law. While an active faculty member, Professor Hollaar's research included software and hardware systems for text handling and retrieval (major support from the National Science Foundation and the Central Intelligence Agency), distributed systems, and data communications. He was the first Director of Campus Networking at the University of Utah and was involved in the planning of CSnet, the NSF project that led to NSFnet. He created and taught the computer networking course at Utah, as well as courses in hardware and software design and development, database systems, and operating systems. Professor Hollaar was on sabbatical leave in Washington DC during the 1996-97 academic year as a Committee Fellow in the intellectual property unit of the Committee on the Judiciary of the United States Senate, where he worked on patent reform legislation, database protection, and what eventually became the Digital Millennium Copyright Act. He was also a visiting scholar with Circuit Judge Randall R. Rader at the United States Court of Appeals for the Federal Circuit. More recently, he taught courses in intellectual property and computer law. He is the author of \"Legal Protection of Digital Information,\" published in 2002 by BNA Books and available on the Internet at no cost. The Second Edition was published in 2016. He is now working on turning the material into a self-paced online course, and developing a book on intellectual property in theater. His current papers on computer and intellectual property law are available here. In retirement, Professor Hollaar has been active as a consultant or expert in a variety of computer-related court cases, as well as a Special Master assisting judges in software discovery, determination of copyright infringement, and the construction of patent claims. He was Managing Director of Utah Repertory Theater Company (UtahRep) from June 2015 through March 2018, an advisory board member for the University of Utah's public radio station, KUER, and a board member for the Litchfield MN Opera House, where he was responsible for its stage lighting and sound systems. Currently, he is a founder and Managing Director of Umbrella Theater Company, which helps small theater companies as well as producing its own shows. He's been as technical advisor to Pioneer Theatre, helping them use low-cost microprocessors in theater, and the Utah Arts Alliance, helping them set up their new Alliance Theater. He was on the Board of Trustees for the Salt Lake School for the Performing Arts. Last updated: 08-21-2021School of Computing • 50 S. Central Campus Dr. Rm. 3190 • Salt Lake City, UT 84112 801-581-8224 • Send comments to hollaar@cs.utah.edu Disclaimer",
  "content_length": 3277,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:13"
}