{
  "name": "Lee Altenberg",
  "homepage": "https://dynamics.org/Altenberg",
  "status": "success",
  "content": "Lee Altenberg's Web Home Page Contents Papers Talks Curriculum Vitae Film Press Coverage Roger Altenberg memorial Elizabeth Lee memorial Archives: Berkeley, Stanford, NCSU, Duke Classic Papers Library (Mirror) Plus Maui Projects Alert on Chemical-Emitting Plastic from China Artificial Sand-Dune project Evolved graphics Lee Altenberg , Ph.D. Adj Full Professor, Department of Mathematics, University of Hawai`i at Mānoa Associate Professor, Department of Information and Computer Sciences, University of Hawai`i at Mānoa (2016-2020, 2002-2007). Associate Editor, BioSystems Editorial Board, Genetic Programming and Evolvable Machines Editorial Board, Artificial Life IEEE Computational Intelligence Society, Task Force on Artificial Life and Complex Adaptive Systems. Since 2007. Research Scholar, Ronin Institute. Since 2013. 2014-2016: Senior Fellow, The Konrad Lorenz Institute for Evolution and Cognition Research, Klosterneuburg, Austria 2011-2013: Board of Directors, Maui Classical Music Festival 2005-2006: Chair, Native Hawaiian Plant Society, Maui 2001-2009: Founding Board of Directors, International Society for Artificial Life 1999-2007: Associate Editor, IEEE Transactions on Evolutionary Computation Hello! E-mail: altenber@hawaii.edu Web: https://dynamics.org/Altenberg/ Office: 1680 East-West Road, P.O.S.T. 317, Honolulu, Hawai`i U.S.A. 96822 My research focuses on the dynamics of evolutionary processes. I am particularly interested in higher order phenomena, such as the evolution of evolvability, the evolution of the genotype-phenotype map, including modularity, and the evolution of genetic systems. My work also addresses theoretical problems in evolutionary computation. I have also worked in conservation on Maui as a part of what I consider to be an evolutionary biologist's professional obligation to preserve the products of evolution that bless Hawai`i so remarkably. Key Papers Altenberg, L. 2012. Resolvent Positive Linear Operators Exhibit the Reduction Phenomenon. Proceedings of the National Academy of Sciences USA 109 (10): 3705-3710. Altenberg, L. 2012. The Evolution of Dispersal in Random Environments and the Principle of Partial Control. Ecological Monographs 82(3): 297-333. Wagner, G. P. and L. Altenberg. 1996. Complex adaptations and the evolution of evolvability. Evolution 50 (3): 967-976. Altenberg, L. 1995. Genome growth and the evolution of the genotype-phenotype map. In Evolution and Biocomputation: Computational Models of Evolution, ed. Wolfgang Banzhaf and Frank H. Eeckman. Lecture Notes in Computer Science vol. 899. Springer-Verlag, pp. 205-259. Maui Sesbania tomentosa (arborea) grown from remnant 7 plants of this species.",
  "content_length": 2686,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:13"
}