{
  "name": "Leen-Kiat Soh",
  "homepage": "http://cse.unl.edu/~lksoh",
  "status": "success",
  "content": "Leen-Kiat Soh's Homepage Home About Leen-Kiat Other Interests Projects Publications UNL Orgs Courses Leen-Kiat Soh's HomepageCommentsPosts Categories Under the Sky (124) Archives May 2025 October 2024 July 2024 November 2023 September 2023 August 2023 May 2023 November 2022 June 2022 April 2022 January 2022 November 2021 August 2021 January 2020 July 2019 March 2019 August 2018 November 2017 September 2017 August 2017 July 2017 May 2017 March 2017 December 2016 October 2016 August 2016 May 2016 April 2016 November 2015 October 2015 July 2015 June 2015 April 2015 December 2014 November 2014 October 2014 September 2014 April 2011 October 2010 September 2010 August 2010 May 2010 February 2010 January 2010 December 2009 November 2009 A sample text widget Etiam pulvinar consectetur dolor sed malesuada. Ut convallis euismod dolor nec pretium. Nunc ut tristique massa. Nam sodales mi vitae dolor ullamcorper et vulputate enim accumsan. Morbi orci magna, tincidunt vitae molestie nec, molestie at mi. Nulla nulla lorem, suscipit in posuere in, interdum non magna. In December 2024, our team published a paper at the IEEE Big Data 2024 conference: Hazelwood, D. J., D. Joshi, A. Samal, and L.-K. Soh (2024). Discovering Localized Drivers of Unrest Events using Clustering and XGBoost, Proceedings of the IEEE Conference on Big Data (IEEE Big Data 2024), December 15-18, Washington, DC, pp. 2958-2966. May 18th, 2025 | Category: Under the Sky | Comments are closed With former PhD student and former post-doctoral researcher Yi Liu, we publish a new journal paper “Integrating Textual and Visual Features to Generate Pseudo-Groundtruth for Enhancing Training of Machine Learning Models in Document Image Classification” at the Journal of Electronic Imaging. May 18th, 2025 | Category: Under the Sky | Comments are closed Our team has a paper accepted at UAI’2025. Congratulations to the team with Dr. Doshi’s group at University of Georgia and Dr. Eck’s group at Oberlin College, and the research students Daniel (U. Georgia) and Ceferino (U. Nebraska)! “MOHITO: Multi-Agent Reinforcement Learning Using Hypergraphs for Task-Open Systems” May 18th, 2025 | Category: Under the Sky | Comments are closed Congratulations to Ceferino Patino for winning the School of Computing’s Annual Outstanding Undergraduate Research Student Award for 2025! May 18th, 2025 | Category: Under the Sky | Comments are closed Professor Leen-Kiat Soh received NSF IUSE funding for the CS FUTURES project, together with an interdisciplinary team (Prof. Guy Trainin, Prof. Gwen Nugent, Prof. Wendy Smith, Prof. Brian Dorn, at UNL and UNO) and partners at Southeast Community College, Metropolitan Community College, and Western Nebraska Community College. The project officially started in September 2024. October 1st, 2024 | Category: Under the Sky | Comments are closed Congratulations to Praval Sharma! Praval successfully defended his Doctoral Dissertation on July 29, 2024! July 30th, 2024 | Category: Under the Sky | Comments are closed Welcome to Ceferino Patino, Tyler Billings, and Alireza Saleh Abadi to the IAMAS group. They are part of the OASYS project with University of Georgia and Oberlin College. July 30th, 2024 | Category: Under the Sky | Comments are closed Professor Soh and his collaborators Professors Adam Eck and Prashant Doshi have published a research article on agent decision making in open environments: Eck, A., L.-K. Soh, and P. Doshi (2023). Decision Making in Open Agent Systems, AI Magazine, pp. 1-16, https://doi.org/10.1002/aaai.12131. Video: https://www.youtube.com/watch?v=vQOK3YNeTDE November 14th, 2023 | Category: Under the Sky | Comments are closed The Computational Creativity Exercises team has published the final paper documenting their work on how student learn about CS. This paper is about the relationship between implicit intelligence beliefs and self-regulation of learning. Flanigan, A. E., M. Peteranetz, D. Shell, and L.-K. Soh (2023).  Relationship between Implicit Intelligence Beliefs and Maladaptive Self-Regulation of Learning, ACM Transactions on Computing Education, 23(3):1-23, https://doi.org/10.1145/3595187 September 28th, 2023 | Category: Under the Sky | Comments are closed The Aida team that has worked on historical document analysis has published an article documenting our work: L.-K. Soh, E. Lorang, C. Pack, and Y. Liu (2023). Applying Image Analysis and Machine Learning to Historical Newspaper Collections, The American Historical Review, 128(3):1382-1389, September. September 28th, 2023 | Category: Under the Sky | Comments are closed Older Entries » Recent Posts 630 626 624 622 619 613 611 608 605 603 599 596 594 591 589 587 584 582 579 576 Meta Log in WordPress Copyright © 2025 Leen-Kiat Soh's Homepage - All Rights ReservedPowered by WordPress & Atahualpa",
  "content_length": 4817,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:15"
}