{
  "name": "Lei Sha",
  "homepage": "https://shalei120.github.io",
  "status": "success",
  "content": "Lei Sha Lei Sha Professor, Beihang University I'm always looking for highly motivated students to work with me on broad NLP research. Please feel free to reach out and apply! I am now a professor in the Artificial Intelligence Institute of Beihang University. I'm also the head of OxTium AI Research, where we work on cutting-edge research and engineering projects in LLM-for-LifeScience. If you are interested in the positions of Engineer or Researcher (Internship & Full-time Opportunities), please don't hesitate to drop me an email. Previously, I was a research associate in University of Oxford under the supervision of Prof. Thomas Lukasiewicz. I obtained my Ph.D. degree from Peking University in 2018. During my Ph.D. period, I was co-advised by Prof. Zhifang Sui, Baobao Chang and Sujian Li. Email: shalei[AT]buaa.edu.cn Home Home Group Publication Links Blogs Group The Language Computing and Sequential Data Analysis Group (LecSa Group) Current Students Hao Wang LLM safety, LLM control Beihang IAI PhD student (2023-) Hao Li LLM safety Beihang IAI Master (2024-) Sihan Fan LLM related research Beihang Shen Yuan Honors College Master (2024-) Zengqi Xiu LLM safety Beihang Shen Yuan Honors College (Cosupervised with Prof. Shaoting Tang), ZGC Lab PhD student (2024-) Jian Liu LLM hallucination mitigation Beihang IAI PhD student (2024-) Xiuping Liang Image Generation Beihang IAI, Co-supervised with Prof. Yier Jin PhD student (2024-) Yunhao Mei LLM safety Beihang IAI PhD student (2024-) Guanhua Chen LLM Hallucination Beihang IAI PhD student (2025-) Pengsheng Chen LLM Math reasoning Beihang ECPKN Master (2025-) Wenxin Wu LLM Hallucination Beihang IAI Master (2025-) Yanting Wang LLM Hallucination Beihang IAI PhD student (2025-) Research Internship Qianpu Liu LLM for cfRNA, LLM for theorem proving Beihang University (Bachelor) Duration: May 2023 - Wenhan Yu LLM for law Beihang University (Bachelor) Duration: Mar 2024 - Chen Wang LLM for Science Beihang University (Bachelor) Duration: Sep 2024 - Dayou Zhou LLM for 3D generation Beihang University (Bachelor) Duration: Nov 2024 - Tsan Ouyang LLM related research Beihang University (Bachelor) Duration: Feb 2025 - Dongze Wu LLM related research Beihang University (Bachelor) Duration: Mar 2025 - Wendi Feng LLM related research Beihang University (Bachelor) Duration: May 2025 - Jie Li LLM related research USTB (Bachelor) Duration: May 2025 - Yueran Pei LLM related research Beihang University (Bachelor) Duration: May 2025 - Wenjing Zhi LLM related research Beihang University (Bachelor) Duration: May 2025 - Xingzhou Zhang LLM related research Beihang University (Bachelor) Duration: May 2025 - Yizhuo Duan LLM related research Beihang University (Bachelor) Duration: July 2025 - Jia-Ning Zhou LLM related research Beihang University (Bachelor) Duration: July 2025 - ZhiXiang Yu LLM related research Beihang University (Bachelor) Duration: Sep 2025 - Visiting Scholar Rui Li LLM research Peking University Duration: Sep 2023 - Jingyuan Ma LLM research Peking University Duration: Sep 2023 - Han Yang LLM research Leibniz-Institute for the Social Sciences Duration: Mar 2025 - Chun Kang LLM research Beihang University Duration: Mar 2025 - Zhuang Liu LLM research Beihang University Duration: Apr 2025 - Fanhu Zeng LLM research Institute of Automation, CAS Duration: Jun 2025 - Alumni Feng Qian SRL research Peking University (Bachelor) --> Harvard University (Master) Duration: Oct 2016 - Feb 2017 Chengyue Gong ML research Peking University (Bachelor) --> University of Texas at Austin (PhD) Duration: Jun 2017 - Aug 2017 Publications (#) for corresponding author Large Language Models Struggle with Unreasonability in Math Problems Jingyuan Ma, Damai Dai, Zihang Yuan, Rui Li, Weilin Luo, Bin Wang, Qun Liu, Lei Sha, Zhifang Sui In Proceedings of AAAI 2026 Conference, 2026. (AAAI 2026). [PDF][Arxiv] Unlocking Multi-View Insights in Knowledge-Dense Retrieval-Augmented Generation Guanhua Chen, Wenhan Yu, Xiao Lu, Xiao Zhang, Erli Meng, Lei Sha(#) In IEEE/ACM Transactions on Audio, Speech, and Language Processing, 2025. (TASLP 2025). [PDF][Arxiv] DiffusionAttacker: Diffusion-Driven Prompt Manipulation for LLM Jailbreak Hao Wang, Hao Li, Junda Zhu, Xinyuan Wang, Chengwei Pan, Minlie Huang, Lei Sha(#) In Proceedings of EMNLP 2025 Conference, 2025. (EMNLP 2025). [PDF][Arxiv] Reasoning-to-Defend: Safety-Aware Reasoning Can Defend Large Language Models from Jailbreaking Junda Zhu, Lingyong Yan, Shuaiqiang Wang, Dawei Yin, Lei Sha(#) In Proceedings of EMNLP 2025 Conference, 2025. (EMNLP 2025). [PDF][Arxiv] Layer-Aware Representation Filtering: Purifying Finetuning Data to Preserve LLM Safety Alignment Hao Li, Lijun Li, Zhenghao Lu, Xianyi Wei, Rui Li, Jing Shao, Lei Sha(#) In Proceedings of EMNLP 2025 Conference, 2025. (EMNLP 2025). [PDF][Arxiv] LLMs know their vulnerabilities: Uncover Safety Gaps through Natural Distribution Shifts [outstanding paper] Qibing Ren, Hao Li, Dongrui Liu, Zhanxu Xie, Xiaoya Lu, Yu Qiao, Lei Sha, Junchi Yan, Lizhuang Ma, Jing Shao In Proceedings of ACL 2025 Conference, 2025. (ACL 2025). [PDF][Arxiv] How Far are LLMs from Being Our Digital Twins? A Benchmark for Persona-Based Behavior Chain Simulation Rui Li, Heming Xia, Xinfeng Yuan, Qingxiu Dong, Lei Sha, Wenjie Li, Zhifang Sui In Findings of ACL 2025 Conference, 2025. (ACL 2025 Findings). [PDF][Arxiv] Towards Harmonized Uncertainty Estimation for Large Language Models Rui Li, Jing Long, Muge Qi, Heming Xia, Lei Sha, Peiyi Wang, Zhifang Sui In Proceedings of ACL 2025 Conference, 2025. (ACL 2025). [PDF][Arxiv] Be a Multitude to Itself: A Prompt Evolution Framework for Red Teaming Rui Li, Peiyi Wang, Jingyuan Ma, Di Zhang, Lei Sha, Zhifang Sui In Proceedings of EMNLP 2024 Conference, 2024. (EMNLP 2024). [PDF][Arxiv] ASETF: A Novel Method for Jailbreak Attack on LLMs through Translate Suffix Embeddings Hao Wang, Hao Li, Minlie Huang, Lei Sha(#) In Proceedings of EMNLP 2024 Conference, 2024. (EMNLP 2024). [PDF][Arxiv] ATM: Adversarial Tuning Multi-agent System Makes a Robust Retrieval-Augmented Generator Junda Zhu, Lingyong Yan, Haibo Shi, Dawei Yin, Lei Sha(#) In Proceedings of EMNLP 2024 Conference, 2024. (EMNLP 2024). [PDF][Arxiv] Harnessing the Plug-and-Play Controller by Prompting Hao Wang, Lei Sha(#) In Proceedings of EMNLP 2023 WorkShop, 2023. (EMNLP-GEM 2023). [PDF][Arxiv] Correcting Flaws in Common Disentanglement Metrics Louis Mahon, Lei Sha, Thomas Lukasiewicz In Transactions of Machine Learning Research, 2024. (TMLR 2024). [PDF][Arxiv] Text Attribute Control via Closed-Loop Disentanglement Lei Sha, Thomas Lukasiewicz In Transactions of the Association for Computational Linguistics. (TACL 2024). [IF=17.59] [PDF] Rationalizing Predictions by Adversarial Information Calibration Lei Sha, Oana-Maria Camburu, Thomas Lukasiewicz In Artificial Intelligence. (AI 2023). [IF=14.05] [PDF][Arxiv] Controlling Text Edition by Changing Answers of Specific Questions Lei Sha, Patrick Hohenecker, Thomas Lukasiewicz In Finding of ACL 2021 Conference, 2021. (ACL 2021 (Finding)). [PDF][Arxiv][Data & Code] Learning from the Best: Rationalizing Predictions by Adversarial Information Calibration Lei Sha, Oana-Maria Camburu, Thomas Lukasiewicz In Proceedings of AAAI 2021 Conference, 2021. (AAAI 2021). [PDF][Arxiv][Code][BeerAdvocate] Multi-type Disentanglement without Adversarial Training Lei Sha, Thomas Lukasiewicz In Proceedings of AAAI 2021 Conference, 2021. (AAAI 2021). [PDF][Arxiv][Code] Gradient-guided Unsupervised Lexically Constrained Text Generation Lei Sha In Proceedings of EMNLP 2020 Conference, 2020. (EMNLP 2020). [PDF] Estimating Minimum Operation Steps via Memory-based Recurrent Calculation Network Lei Sha, Chen Shi, Qi Chen, Lintao Zhang, Houfeng Wang In 2020 international joint conference on neural networks. (IJCNN 2020). [PDF][Code] Order-Planning Neural Text Generation from Structured Data Lei Sha, Lili Mou, Tianyu Liu, Pascal Poupart, Sujian Li, Baobao Chang, Zhifang Sui In Proceedings of AAAI 2018 Conference, 2018. (AAAI 2018). [PDF][Arxiv] A Multi-View Fusion Neural Network for Answer Selection Lei Sha, Xiaodong Zhang, Feng Qian, Baobao Chang, Zhifang Sui In Proceedings of AAAI 2018 Conference, 2018. (AAAI 2018). [PDF] Jointly Extracting Event Triggers and Arguments by Dependency-Bridge RNN and Tensor-Based Argument Interaction Lei Sha, Feng Qian, Baobao Chang, Zhifang Sui In Proceedings of AAAI 2018 Conference, 2018. (AAAI 2018). [AAAIPDF] [PDF] Will Repeated Reading Benefit Natural Language Understanding? Lei Sha, Zhifang Sui In Proceedings of NLPCC 2017 Conference, 2017. (NLPCC 2017). [PDF] Reading and Thinking: Re-read LSTM Unit for Textual Entailment Recognition Lei Sha, Baobao Chang, Zhifang Sui, Sujian Li In Proceedings of Coling 2016 Conference, 2016. (Coling 2016). [PDF] Capturing Argument Relationship for Chinese Semantic Role Labeling Lei Sha, Tingsong Jiang, Sujian Li, Baobao Chang, Zhifang Sui In Proceedings of EMNLP 2016 Conference, 2016. (EMNLP 2016). [PDF] RBPB: Regularization-Based Pattern Balancing Method for Event Extraction Lei Sha, Jing Liu, Chin-Yew Lin, Sujian Li, Baobao Chang, Zhifang Sui In Proceedings of ACL 2016 Conference, 2016. (ACL 2016). [PDF] Joint Learning Templates and Slots for Event Schema Induction Lei Sha, Sujian Li, Baobao Chang, Zhifang Sui. In Proceedings of NAACL 2016 Conference, 2016. (NAACL 2016). [arxiv(including supplement material)][PDF] Recognizing Textual Entailment Using Probabilistic Inference Lei Sha, Sujian Li, Tingsong Jiang, Baobao Chang, Zhifang Sui. In Proceedings of the EMNLP 2015 Conference, 2015. (EMNLP 2015). [PDF] RecInDial: A Unified Framework for Conversational Recommendation with Pretrained Language Models. Lingzhi Wang, Huang Hu, Lei Sha, Can Xu, Daxin Jiang, Kam-Fai Wong In Proceedings of AACL 2022 Conference, 2022. (AACL 2022). [PDF] Small Changes Make Big Differences: Improving Multi-turn Response Selection in Dialogue Systems via Fine-Grained Contrastive Learning",
  "content_length": 13020,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:17"
}