{
  "name": "Lei Meng",
  "homepage": "https://ercdm.sdu.edu.cn/info/1013/1413.htm",
  "status": "success",
  "content": "ï»¿ Lei Meng-ERC é¦é¡µ ä¸­å¿æ¦åµ ä¸­å¿ç®ä» æºæè®¾ç½® ä¸­å¿ä¸»ä»» ææ¯å§åä¼ ç§å­¦ç ç©¶ ç ç©¶æ¹å äººæéä¼ ç§ç è®¾æ½ ç§ç é¡¹ç® ç§ç ææ åè¡¨è®ºæ è·å¾ä¸å© åºçèä½ ç§ç å¥å± è½¯ä»¶èä½æ ææ ææ¯æå¡ æçæè èç³»æä»¬ ææ°å¨æ å¾æéç¥ å­¦æ¯æ¥å Lei Meng Shandong University,School of Software PhD,Professor.Taishan Scholar Young Expert Email:lmeng@sdu.edu.cn è±æä¸»é¡µï¼https://ercdm.sdu.edu.cn/info/1013/1523.htm Personal Profile Lei Meng, professor and doctoral supervisor, has been working at the School of Software, Shandong University since 2020. He received a bachelor's degree in engineering from Shandong University in 2010, and received a scholarship from the School of Computer Science and Engineering at Nanyang Technological University (NTU), Singapore, in 2015, under the supervision of Ah-Hwee Tan. In 2015, he worked at the NTU-UBC Center of Excellence for Active Living for the Elderly (LILY) as a researcher. His mentors are Professor Miao Chunyan of Nanyang Technological University and Professor Cyril Leung of the University of British Columbia. In 2018, he worked at the NUS-Tsinghua-Southampton Extreme Search Center (NExT++) as a senior researcher. His co-supervisor is Professor Tat-Seng Chua from the National University of Singapore. Focusing on scientific issues such as multimedia computing and data mining driven by Internet big data, he has long been engaged in machine learning theory and technology research on multimedia knowledge mining and content representation. The Multimedia Mining Reasoning and Generation (MMRC) laboratory was established and selected into Jinan Cityâs â20 New Universitiesâ plan to introduce innovative teams. Carry out research on key technologies of smart homes for health big data analysis, independently build tens of millions of dietary health big data, develop and promote application systems such as aging-friendly search engines, non-intrusive risk analysis and judgment, and healthy diet management; face the modernization of national and municipal social governance Strategic needs, focus on digital perception and intelligent decision-making issues in multi-scale social governance scenarios, and carry out pioneering innovative research in multimedia understanding, cross-modal reasoning, digital twins and other directions. The main research topics include (1) self-organizing clustering algorithm based on adaptive resonance principle (ART); (2) cross-modal enhanced visual representation algorithm; (3) deep learning method for imbalanced data; (4) combination Causal feature learning method for cross-modal reasoning; (5) 3D scene generation method based on video data. Published an English monograph \"Adaptive Resonance Theory in Social Media Data Clustering\" in Springer, published more than 50 academic papers in journals and conferences in the field of artificial intelligence and multimedia such as TKDE, TNNLS, TMM, MM, AAAI, etc., applied for Or obtain eight international and invention patents. The first batch of Shandong Province Taishan Scholars Young Scholars Project, Shandong Province Outstanding Youth Science Fund Project (Overseas), Shandong University Qilu Young Scholars (level) and other talent plans. Won the honorary titles of 2021 Chinese Academy of Engineering Outstanding Young Scholars at the Frontier of Engineering in China, ACM Jinan Branch Academic Rising Star, and Shandong Province Artificial Intelligence Outstanding Youth, including the National Science and Technology Expert Database, the Chinese Academy of Engineering CAFOE Expert Database, the Shandong Province Technology R&D Expert Database and the National Graduate Education Assessment and monitoring expert database. 5 scientific research projects including National Natural Science Foundation of China Youth Science Fund and CCF-Tencent Rhino-Bird Fund, with a total of more than 5 million completed. Served as deputy editor (deputy editor) of \"Applied Soft Computing\", a journal of the Chinese Academy of Sciences SCI District 1, executive member of the Multimedia Special Committee of the China Computer Federation (CCF), and the 2023-2024 Jinan Branch of the China Computer Federation Youth Computer Science and Technology Forum (CCF YOCSEF) Term Chairman, Chairman of Shandong Artificial Intelligence Society. He has long served as a reviewer for Journal of Computer Science, Computer Science, TNNLS and other journals, and as a (senior) program/technical committee member of conferences such as MM, AAAI, IJCAI, etc. Educational Experience 1.2006.9~2010.7 Computer Science and Technology, Shandong University B.Eng 2.2010.8~2015.2 Computer Engineering, Nanyang Technological University PhD Working Experience 1.2015.1~2018.11 Joint NTU-UBC Research Center of Excellence in Active Living for the Elderlyï¼LILYï¼ï¼Research Fellow 2.2018.12~2020.9 NUS-Tsinghua-Southampton Centre for Extreme Searchï¼NExT++ï¼, Senior Research Fellow 3.2020.10~now School of Software, Shandong Universityï¼Professor Projects 1.2021.1~2023.12 Research on Personalized Diet Recommendation Methods for Health Careï¼National Natural Science Foundation of Chinaï¼PI Monograph 1. Lei Meng, Ah-Hwee Tan, and Donald C. Wunsch II, âAdaptive Resonance Theory in Social Media Data Clustering â Roles, Methodologies, and Applications,â Advanced Information and Knowledge Processing Series, Springer, 2019. Publications Journals 1. Wenya Guo, Ying Zhang, Xiangrui Cai, Lei Meng, Jufeng Yang, Xiaojie Yuan, âLD-MAN: Layout-Driven Multimodal Attention Network for Online News Sentiment Recognition,â IEEE Transactions on Multimedia, Accepted, 2020. 2. Lei Meng, Ah-Hwee Tan, Chunyan Miao, âSalience-Aware Adaptive Resonance Theory for Large-Scale Sparse Data Clustering,â Neural Networks, vol. 120, pp. 143-157, 2019. 3. Ah-Hwee Tan, Budhitama Subagdja, Di Wang, Lei Meng, âSelf-Organizing Neural Networks for Universal Learning and Multimodal Memory Encoding,â Neural Networks, vol. 120, pp. 58-73, 2019. 4. Yingjie Xia, Luming Zhang, Lei Meng, Yan Yan, Liqiang Nie, and Xuelong Li, âExploring Web Images to Enhance Skin Disease Analysis Under A Computer Vision Framework,\" IEEE Transactions on Cybernetics, vol. 48, no. 11, pp. 3080-3091, 2018. 5. Lei Meng, Chunyan Miao, and Cyril Leung, âTowards Online and Personalized Daily Activity Recognition, Habit Modeling, and Anomaly Detection for the Solitary Elderly Through Unobtrusive Sensing,â Multimedia Tools and Applications, vol. 76, no. 8, pp. 10779-10799, 2017. 6. Lei Meng, Ah-Hwee Tan and Donald C. Wunsch II, âAdaptive Scaling of Cluster Boundaries for Large-Scale Social Media Data Clustering,â IEEE Transactions on Neural Networks and Learning Systems (TNNLS), vol. 27, no. 12, pp. 2656-2669, 2016. 7. Liqiang Nie, Luming Zhang, Lei Meng, Xuemeng Song, Xiaojun Chang, and Xuelong Li, âModeling Disease Progression via Multisource Multitask Learners: A Case Study With Alzheimer's Disease,â IEEE Transactions on Neural Networks and Learning Systems (TNNLS), vol. 28, no. 7, pp. 1508-1519, 2016. 8. Lei Meng, Ah-Hwee Tan and Dong Xu, âSemi-Supervised Heterogeneous Fusion for Multimedia Data Co-clustering,â IEEE Transactions on Knowledge and Data Engineering (TKDE), vol. 26, no. 9, pp. 2293-2306, 2014. Conferences 1. Lei Meng, Fuli Feng, Xiangnan He, Xiaoyan Gao, Tat-Seng Chua, âHeterogeneous Fusion of Semantic and Collaborative Information for Visually-Aware Food Recommendation,â ACM International Conference on Multimedia (MM), accepted, 2020. 2. Chuang Lin, Sicheng Zhao, Lei Meng*, Tat-Seng Chua, âMulti-Source Domain Adaptation for Visual Sentiment Classification,â AAAI, accepted, 2020. 3. Lei Wu, Xi Chen, Lei Meng*, Xiangxu Meng, âMultitask Adversarial Learning for Chinese Font Style Transfer,â International Joint Conference on Neural Networks (IJCNN), accepted, 2020. 4. Lei Meng, Long Chen, Xun Yang, Dacheng Tao, Hanwang Zhang, Chunyan Miao, Tat-Seng Chua, âLearning Using Privileged Information for Food Recognition,â ACM International Conference on Multimedia (MM), pp. 557-565, 2019. 5. Xinjia Yu, Lei Meng, Xiaohai Tian, Simon Fauvel, Bo Huang, Frank Guan, Zhiqi Shen, Chunyan Miao, Cyril Leung, âUsability Analysis of the Novel Functions to Assist the Senior Customers in Online Shopping,â International Conference on Human Computer Interaction, pp. 173-185, 2018. 6. Xiaohai Tian, Lei Meng, Siyuan Liu, Zhiqi Shen, Eng Siong Chng, Cyril Leung, Frank Yunqing Guan, and Chunyan Miao, âNovel Functional Technologies Towards Age-friendly E-commerce,â HCI International Conference, pp.150-158, 2017. 7. Lei Meng, Quy Hy Nguyen, Xiaohai Tian, Zhiqi Shen, Eng Siong Chng, Frank Yunqing Guan, Chunyan Miao, and Cyril Leung, âTowards Age-friendly E-commerce Through Crowd-improved Speech Recognition, Multimodal Search, and Personalized Speech Feedback,â International Conference on Crowd Science and Engineering, pp. 1-8, 2016. 8. Lei Meng, Ah-Hwee Tan, Cyril Leung, Liqiang Nie, Tat-Seng Chua, and Chunyan Miao, âOnline Multimodal Co-indexing and Retrieval of Weakly Labeled Web Image Collections,â ACM International Conference on Multimedia Retrieval (ICMR), pp. 219-226, 2015. 9. Lei Meng and Ah-Hwee Tan, âCommunity Discovery in Social Networks via Heterogeneous Link Association and Fusion,â SIAM International Conference on Data Mining (SDM), pp. 803-811, 2014. 10. Lei Meng, Ah-Hwee Tan and Donald C. Wunsch II, âVigilance Adaptation in Adaptive Resonance Theory,â International Joint Conference on Neural Networks, pp. 1-7, 2013. 11. Lei Meng and Ah-Hwee Tan, âSemi-supervised Hierarchical Clustering for Personalized Web Image Organization,â International Joint Conference on Neural Networks, pp. 252-258, 2012. Patents 1.Lei Meng, Zhaoyan Ming, Tat-Seng Chua, âFood Recognition Enhanced Using Privileged Information,â ILO Ref: 2019-243-01, SG Non-Provisional Application No. 10201907991T, Singap",
  "content_length": 10335,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:16"
}