{
  "name": "Lei Xie 0001",
  "homepage": "http://lxie.nwpu-aslp.org/index.htm",
  "status": "success",
  "content": "Professor Lei Xie, Northwestern Polytechnical University Biosketch Research Interests Publications Collaborators ASLP Lab 中文版 Lab Wiki only search Dr. Lei Xie's homepage Last Modified: Dec 2022 Affiliated with Collaborators Lei Xie Ph.D, Professor, Senior Member IEEE Audio, Speech & Language Processing Group (ASLP@NPU) Shaanxi Provincial Key Laboratory of Speech & Image Information Processing (SAIIP) School of Computer Science, Northwestern Polytechnical University, Xi'an, China E-mail: lxie (at) nwpu.edu.cn, xielei21st (at) gmail.com, lxie (at) nwpu-aslp.org (Convert AT to @) Biosketch Lei Xie received the Ph.D. degree in computer science from Northwestern Polytechnical University, Xi'an, China, in 2004. From 2001 to 2002, he was with the Department of Electronics and Information Processing, Vrije Universiteit Brussel (VUB), Brussels, Belgium, as a Visiting Scientist. From 2004 to 2006, he was a Senior Research Associate with the Center for Media Technology, School of Creative Media, City University of Hong Kong, Hong Kong, China. From 2006 to 2007, he was a Postdoctoral Fellow with the Human-Computer Communications Laboratory (HCCL), The Chinese University of Hong Kong, Hong Kong, China. He is currently a Professor with School of Computer Science, Northwestern Polytechnical University, Xian, China and leads the Audio, Speech and Language Processing Group (ASLP@NPU). He has published over 280 papers in referred journals and conferences, such as IEEE/ACM Transactions on Audio, Speech and Language Processing, IEEE Transactions on Multimedia, Interspeech, ICASSP, ASRU, SLT, ACL and ACM Multimedia. His team has wide and deep collaborations with industries, including Microsoft, Alibaba, Tencent, Huawei, Xiaomi, Sogou, JD.com, Bytedance, iQiyi and Meituan. His current research interests include general topics in speech and language processing, multimedia and human-computer interaction. Dr. Xie is currently a senior area editor (SAE) of IEEE/ACM Trans. on Audio, Speech and language Processing. He is a member of IEEE Speech and Language Technical Committee (SLTC) and the Vice Chairperson of ISCA SIG-CSLP. He has actively served as Chairs in many conferences and technical committees. Research Interests Audio, Speech and Language Processing, including but not limited to: Speech Enhancement and Separation, Robust Speech Recognition, Speech Synthesis, Voice Conversion, Speaker Recognition, Keyword Spotting, Low-resource Speech Processing Multimedia/Multimodal Information Processing Machine Learning Human Computer Interaction Recent Selected Publications Yi Lei, Shan Yang, Xinsheng Wang, Qicong Xie, Jixun Yao, Lei Xie, Dan Su, UniSyn: An End-to-End Unified Model for Text-to-Speech and Singing Voice Synthesis, AAAI2023 PDF Junwen Xiong, Yu Zhou, Peng Zhang, Lei Xie, Wei Huang, Yufei Zha: Look&Listen: Multi-Modal Correlation Learning for Active Speaker Detection and Speech Enhancement, IEEE Transactions on Multimedia PDF Xinsheng Wang, Qicong Xie, Jihua Zhu, Lei Xie, Odette Scharenborg, AnyoneNet: Synchronized Speech and Talking Head Generation for Arbitrary Persons, IEEE Transactions on Multimedia, 2022 PDF Xiang Hao, Chenglin Xu, Lei Xie, Neural speech enhancement with unsupervised pre-training and mixture training, Neural Networks Volume 158, January 2023, Pages 216-227 PDF Yi Lei, Shan Yang, Xinfa Zhu, Lei Xie, Dan Su, Cross-speaker Emotion Transfer through Information Perturbation in Emotional Speech Synthesis, IEEE Signal Processing Letters, Volume 29, Page(s) 1948 - 1952, September 2022 PDF Liumeng Xue, Frank K. Soong, Shaofei Zhang, Lei Xie, ParaTTS: Learning Linguistic and Prosodic Cross-sentence Information in Paragraph-based TTS, IEEE/ACM Trans. on Audio, Speech and Language Processing, 2022 PDF Fan Yu, Shiliang Zhang, Pengcheng Guo, Yuhao Liang, Zhihao Du, Yuxiao Lin, Lei Xie, MFCCA: Multi-Frame Cross-Channel attention for multi-speaker ASR in Multi-party meeting scenario, SLT2022, January 9 to 12, 2023, Doha, Qatar PDF Shubo Lv, Yihui Fu, Yukai Jv, Lei Xie, Weixin Zhu, Wei Rao, Yannan Wang, Spatial-DCCRN: DCCRN Equipped with Frame-level Angle Feature and Hybrid Filtering for Multi-channel Speech Enhancement, SLT2022, January 9 to 12, 2023, Doha, Qatar PDF Yukai Ju , Shimin Zhang, Wei Rao, Yannan Wang, Tao Yu, Lei Xie, Shidong Shang, TEA-PSE 2.0: SUB-BAND NETWORK FOR REAL-TIME PERSONALIZED SPEECH ENHANCEMENT, SLT2022, January 9 to 12, 2023, Doha, Qatar PDF Ao Zhang, Fan Yu, Kaixun Huang, Lei Xie, Longbiao Wang, Eng Siong Chng, Hui Bu, Binbin Zhang, Wei Chen, Xin Xu ,The ISCSLP 2022 Intelligent Cockpit Speech Recognition Challenge (ICSRC): Dataset, Tracks, Baseline and Results, ISCSLP2022, December 11 to 14, 2022, Singapore PDF Yuhao Liang, Peikun Chen, Fan Yu, Xinfa Zhu, Tianyi Xu, Yingying Gao, Lei Xie, The NPU-ASLP System for The ISCSLP 2022 Magichub Code-Swiching ASR Challenge, ISCSLP2022, December 11 to 14, 2022, Singapore PDF Bowen Pang, Huan Zhao, Gaosheng Zhang, Xiaoyue Yang, Yang Sun, Li Zhang, Qing Wang, Lei Xie, TSUP Speaker Diarization System for Conversational Short-phrase Speaker Diarization Challenge, ISCSLP2022, December 11 to 14, 2022, Singapore PDF Kun Song, Heyang Xue, Xinsheng Wang, Jian Cong, Yongmao Zhang, Lei Xie, Bing Yang,Xiong Zhang, Dan Su, AdaVITS: Tiny VITS for Low Computing Resource Speaker Adaptation, ISCSLP2022, December 11 to 14, 2022, Singapore PDF Yongmao Zhang, Zhichao Wang, Peiji Yang, Hongshen Sun, Zhisheng Wang, Lei Xie , AccentSpeech: Learning Accent from Crowd-sourced Data for Target Speaker TTS with Accents, ISCSLP2022, December 11 to 14, 2022, Singapore PDF Kun Song, Jian Cong, Xinsheng Wang, Yongmao Zhang, Lei Xie, Ning Jiang, Haiying Wu, Robust MelGAN: A robust universal neural vocoder for high-fidelity TTS, ISCSLP2022, December 11 to 14, 2022, Singapore PDF Qicong Xie, Shan Yang, Yi Lei, Lei Xie, Dan Su, End-to-End Voice Conversion with Information Perturbation, ISCSLP2022, December 11 to 14, 2022, Singapore PDF Qicong Xie, Tao Li, Xinsheng Wang, Zhichao Wang, Lei Xie, Guoqiao Yu, Guanglu Wan, Multi-speaker Multi-style Text-to-speech Synthesis with Single-speaker Single-style Training Data Scenarios, ISCSLP2022, December 11 to 14, 2022, Singapore PDF Yue Li, Li Zhang, Namin Wang, Jie Liu, MSV Challenge 2022: NPU-HC Speaker Verification System for Low-resource Indian Languages, O-COCOSDA MSV Challenge, 2022 PDF Li Zhang, Yue Li, Namin Wang, Jie Liu, Lei Xie, NPU-HC Speaker Verification System for Far-field Speaker Verification, Interspeech Far-field Speaker Verification Challenge (FFSVC), 2022 PDF Jixun Yao, Qing Wang, Li Zhang, Pengcheng Guo, Yuhao Liang, Lei Xie, NWPU-ASLP System for the VoicePrivacy 2022 Challenge, Interspeech Voice Privacy Challenge Workshop, 2022 PDF Li Zhang, Yue Li, Huan Zhao, Qing Wang, Lei Xie, Backend Ensemble for Speaker Verification and Spoofing Countermeasure, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Shimin Zhang, Ziteng Wang, Yukai Ju, Yihui Fu, Yueyue Na, Qiang Fu, Lei Xie, Personalized Acoustic Echo Cancellation for Full-duplex Communications, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Liumeng Xue, Shan Yang, Na Hu, Dan Su, Lei Xie, Learning noise-independent speech representations for high-quality voice conversion for noisy target speakers, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Heyang Xue, Xinsheng Wang, Yongmao Zhang, Lei Xie, Pengcheng Zhu, Mengxiao Bi, Learn2Sing 2.0: Diffusion and Mutual Information-Based Target Speaker SVS by learning from Singing Teachers, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Zhanheng Yang, Sining Sun, Jin Li, Xiaoming Zhang, Xiong Wang, Long Ma, Lei Xie, CaTT-KWS: A Multi-stage Customized Keyword Spotting Framework based on Cascaded Transducer-Transformer, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Zhanheng Yang, Hang Lv, Xiong Wang, Ao Zhang, Lei Xie, Minimizing Sequential Confusion Error in Speech Command Recognition, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Fan Yu, Zhihao Du, Shiliang Zhang, Yuxiao Lin, Lei Xie, A Comparative Study on Speaker-attributed Automatic Speech Recognition in Multi-party Meetings, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Yu Wang, Xinsheng Wang, Pengcheng Zhu, Jie Wu, Hanzhao Li, Heyang Xue, Yongmao Zhang, Lei Xie, Mengxiao Bi, Opencpop: A High-Quality Open Source Chinese Popular Song Corpus for Singing Voice Synthesis, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Binbin Zhang, Di Wu, Zhendong Peng, Xingchen Song, Zhuoyuan Yao, Hang Lv, Lei Xie, Chao Yang, Fuping Pan, Jianwei Niu, WeNet 2.0: More Productive End-to-End Speech Recognition Toolkit, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Tao Li, Xinsheng Wang, Qicong Xie, Zhichao Wang, Mingqi Jiang, Lei Xie, Cross-speaker Emotion Transfer Based On Prosody Compensation for End-to-End Speech Synthesis, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Qijie Shao, Jinghao Yan, Jian Kang, Pengcheng Guo, Xian Shi, Pengfei Hu, Lei Xie, Linguistic-Acoustic Bimodal Shift Based Accent Recognition, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Kun Wei, Pengcheng Guo, Ning Jiang, Improving Transformer-based Conversational ASR by Inter-Sentential Attention Mechanism, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Kun Wei, Yike Zhang, Sining Sun, Lei Xie, Long Ma, Leveraging Acoustic Contextual Representation by Audio-textual Cross-modal Learning for Conversational ASR, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Shimin Zhang, Ziteng Wang, Yukai Ju, Yihui Fu, Yueyue Na, Qiang Fu, Lei Xie, Personalized Acoustic Echo Cancellation for Full-duplex Communications, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Yi Lei, Shan Yang, Jian Cong, Lei Xie, Dan Su, Glow-WaveGAN 2: High-quality Zero-shot Text-to-speech Synthesis and Any-to-any Voice Conversion, INTERSPEECH2022, September 18 to 22, 2022, Korea PDF Tao Li, Xinsheng Wang, Qicong Xie, Zhichao Wang, Lei Xie, Controllable cross-speaker emotion transfer for end-to-end",
  "content_length": 65891,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:16"
}