{
  "name": "Lei Zhang 0009",
  "homepage": "https://faculty.ecnu.edu.cn/_s43/zl2_en/main.psp",
  "status": "success",
  "content": "软件工程学院 Group 3 Created with Sketch. 教师个人主页 中文 Home Login Lei Zhang Navigation About Research Fields Enrollment and Training Course Scientific Research Academic Achievements Honor About Department: Software Engineering Institute Graduate School: Degree: PhD Academic Credentials: PostCode: Tel: Fax: Email: leizhang@sei.ecnu.edu.cn Office: Address: Education WorkExperience Resume Other Appointments The Software Engineering Institute at the East China Normal University invites applications for several faculty positions at all levels and in all areas of Computer Science. Applicants from both traditional as well as non-traditional and interdisciplinary areas of computer science are encouraged to apply. Research Fields Lei Zhang received his Ph.D. degree in computer engineering from Universitat Rovira i Virgili, Tarragona, Spain. Since then, he has been with Universitat Rovira i Virgili, Tarragona, Spain, as a Postdoctoral Researcher. He is a full Professor with the Software Engineering Institute, East China Normal University, Shanghai, China. He has been a holder/co-holder of more than 20 China/Spain-funded (key) projects. His fields of activity are information security, cryptography, VANET security, blockchain, cloud security, data privacy, and network security. He has authored over 90 publications, including: IEEE Transactions on Information Forensics and Security, IEEE Transactions on Intelligent Transportation Systems, IEEE Transactions on Vehicular Technology, IEEE Transactions on Computers, IEEE-ACM Transactions on Networking, ESORICS 2014, ASIACRYPT 2011. He is the editors of Future Generation Computer Systems, and, was the Guest Editor of several journals. He has served in the program committee of more than 80 international conferences, in the steering committee of 4 international conferences, and as a technical reviewer for over 80 major scientific journals in information security and privacy.  We are looking for PhD students to join our group. The candidate will have the opportunity of carrying out her/his PhD program around the study and development of new advanced cryptographic mechanisms with a view to applications to secure VANET systems, secure cloud /fog systems and data privacy. We welcome candidates with an MSc degree in computer science, mathematics, engineering and related areas. Good analytical skills and familiarity with mathematical reasoning are mandatory. Strong background in theoretical computer science and principles of modern cryptography are an advantage. Enrollment and Training Course Scientific Research Academic Achievements Publications    Journal Papers (Selected)Lei Zhang*, Hu Xiong, Qiong Huang, Jiguo Li, Kim-Kwang Raymond Choo, Jiangtao Li, Cryptographic Solutions for Cloud Storage: Challenges and Research Opportunities, IEEE Transactions on Services Computing, DOI: 10.1109/TSC.2019.2937764. Lei Zhang*, Key Management Scheme for Secure Channel Establishment in Fog Computing, IEEE Transactions on Cloud Computing, DOI: 10.1109/TCC.2019.2903254 Lei Zhang*, Xinyu Meng, Kim-Kwang Raymond Choo, Yuanfei Zhang, Feifei Dai, Privacy-Preserving Cloud Establishment and Data Dissemination Scheme for Vehicular Cloud, IEEE Transactions on Dependable and Secure Computing, DOI: 10.1109/TDSC.2018.2797190 Zhigang Huang, Lei Zhang*, Xinyu Meng, Kim-Kwang Raymond Choo, Key-Free Authentication Protocol Against Subverted Indoor Smart Devices for Smart Home, IEEE Internet of Things Journal, 7(2), 1039-1047, February, 2020. Lei Zhang*, Mingxing Luo, Jiangtao Li, Man Ho Au, Kim-Kwang Raymond Choo, Tong Chen, Shengwei Tian, Blockchain Based Secure Data Sharing System for Internet of Vehicles: A Position Paper, Vehicular Communications, 16 (2019), 85–93, April 2019.Jian Liu, Jiangtao Li, Lei Zhang*, Feifei Dai, Yuanfei Zhang, Xinyu Meng, Jian Shen, Secure Intelligent Traffic Light Control Using Fog Computing, Future Generation Computer Systems, 78, Part 2, 817-824, January 2018. Lei Zhang*, OTIBAAGKA: A New Security Tool for Cryptographic Mix-Zone Establishment in Vehicular Ad Hoc Networks, IEEE Transactions on Information Forensics and Security, 12(12), 2998-3010, December 2017. Jiangtao Li, Lei Zhang*, Sender Dynamic, Non-Repudiable, Privacy-Preserving and Strong Secure Group Communication Protocol, Information Sciences, 414, 187-202, November 2017. Lei Zhang*, Qianhong Wu, Bo Qin, Hua Deng, Jiangtao Li, Jianwei Liu, Wenchang Shi, Certicateless and Identity-based Authenticated Asymmetric Group Key Agreement, International Journal of Information Security, DOI: 10.1007/s10207-016-0339-8 Lei Zhang*, Qianhong Wu, Josep Domingo-Ferrer, Bo Qin, Chuanyan Hu, Distributed Aggregate Privacy-Preserving Authentication in VANETs, IEEE Transactions on Intelligent Transportation Systems, 18(3), 516–526, March 2017. Jiangtao Li, Lei Zhang*, Joseph K. Liu, Haifeng Qian, Zheming Dong, Privacy-Preserving Public Auditing Protocol for Low Performance End Devices in Cloud, IEEE Transactions on Information Forensics and Security, 11(11), 2572-2583, November, 2016 Lei Zhang*, Chuanyan Hu, Qianhong Wu, Josep Domingo-Ferrer, Bo Qin, Privacy-Preserving Vehicular Communication Authentication with Hierarchical Aggregation and Fast Response, IEEE Transactions on Computers, 65(8), 2562–2574, 2016Qianhong Wu, Bo Qin, Lei Zhang, Josep Domingo-Ferrer, Oriol Farràs, Jesús A. Manjón, Contributory Broadcast Encryption with Efficient Encryption and Short Ciphertexts, IEEE Transactions on Computers, 65(2), 466–479, 2016. Lei Zhang*, Qianhong Wu, Bo Qin, Josep Domingo-Ferrer, Bao Liu, Practical Secure and Privacy-Preserving Scheme for Value-Added Applications in VANETs, Computer Communications, 71(2015), 50–60, 2015 Lei Zhang*, Qianhong Wu, Josep Domingo-Ferrer, Bo Qin, Zheming Dong, Round-Efficient and Sender-Unrestricted Dynamic Group Key Agreement Protocol for Secure Group Communications, IEEE Transactions on Information Forensics and Security, 10(11), 2352-2364, 2015. Lei Zhang*, Certificateless One-Pass and Two-Party Authenticated Key Agreement Protocol and Its Extensions, Information Sciences, 293(2015), 182-195, 2015. Lei Zhang*, Qianhong Wu, Josep Domingo-Ferrer, Bo Qin, Peng Zeng, Signatures in Hierarchical Certificateless Cryptography: Efficient Constructions and Provable Security,   Information Sciences, 272 (2014), 223–237, 2014. Hua Deng, Qianhong Wu, Bo Qin, Josep Domingo-Ferrer, Lei Zhang, Jianwei Liu, Wenchang Shi, Ciphertext-Policy Hierarchical Attribute-Based Encryption with Short Ciphertexts, Information Sciences, 275(2014), 370–384, 2014. Lei Zhang*, Qianhong Wu, Bo Qin, Identity-Based Optimistic Fair Exchange in the Standard Model, Security and Communication Networks, 6(8), 1010–1020, 2013. Qianhong Wu, Bo Qin, Lei Zhang, Josep Domingo-Ferrer, Fast Transmission to Remote Cooperative Groups: A New Key Management Paradigm, IEEE-ACM Transactions on Networking, 21(2), 621-633, 2013. Bo Qin, Qianhong Wu, Lei Zhang, Oriol Farras, Josep Domingo-Ferrer, Provably Secure Threshold Public-Key Encryption with Adaptive Security and Short Ciphertexts, Information Sciences, 210(2012), 67–80, 2012. Lei Zhang*, Futai Zhang, Qianhong Wu, Delegation of Signing Rights using Certificateless Proxy Signatures, Information Sciences, 184(1), 298-309, 2012. Lei Zhang*, Qianhong Wu, Bo Qin, Josep Domingo-Ferrer, Úrsula González-Nicolás, Asymmetric Group Key Agreement Protocol for Open Networks and Its Application to Broadcast Encryption, Computer Networks, 55(15), 3246–3255, 2011. Lei Zhang*, Futai Zhang, Bo Qin, Shubo Liu. Provably-Secure Electronic Cash Based on Certificateless Partially-Blind Signatures, Electronic Commerce Research and Applications, 10(5), 545-552, 2011.Lei Zhang*, Qianhong Wu, Bo Qin, Josep Domingo-Ferrer. Provably Secure One-Round Identity-Based Authenticated Asymmetric Group Key Agreement Protocol, Information Sciences, 181(19), 4318-4329, 2011. Hong Yuan, Futai Zhang, Xinyi Huang, Yi Mu, Willy Susilo, Lei Zhang. Certificateless Threshold Signature Scheme from Bilinear Pairings, Information Sciences, 180(23), 4714-4728, 2010. (Lei Zhang*, Bo Qin, Qianhong Wu, Futai Zhang. Efficient Many-to-One Authentication with Certificateless Aggregate Signatures, Computer Networks, 54(14), 2482–2491, 2010. Lei Zhang*, Qianhong Wu, Agusti Solanas, Josep Domingo-Ferrer. A Scalable Robust Authentication Protocol for Secure Vehicular Communications, IEEE Transactions on Vehicular Technology, 59(4), 1606–1617, 2010. Lei Zhang*, Futai Zhang, Qianhong Wu, Josep Domingo-Ferrer. Simulatable Certificateless Two-Party Authenticated Key Agreement Protocol, Information Sciences, 180(6), 1020–1030, 2010. Lei Zhang*, Futai Zhang. A New Certificateless Aggregate Signature Scheme, Computer Communications, 32(6), 1079-1085, 2009. Lei Zhang*, Futai Zhang, Xinyi Huang. A Secure and Efficient Certificateless Signature Scheme Using Bilinear Pairing, 电子学报英文版, 18(1), 145-148, 2009.     Conference Papers (Selected)  Yunya Zhou, Jianwei Liu, Hua Deng, Bo Qin, Lei Zhang, Non-interactive Revocable Identity-based Access Control over e-Healthcare Records, The 11th Information Security Practice and Experience Conference (ISPEC 2015), Lecture Notes in Computer Science, vol. 9065, pp. 485-498, 2015.Hua Deng, Qianhong Wu, Bo Qin, Jian Mao, Xiao Liu, Lei Zhang, Wenchang Shi, Who Is Touching My Cloud, the 19th European Symposium on Research in Computer Security (ESORICS 2014), Lecture Notes in Computer Science, vol. 8712, pp. 362–379, 2014. (CCF B)Zheming Dong, Lei Zhang∗, Jiangtao Li, Security Enhanced Anonymous Remote User Authentication and Key Agreement for Cloud Computing, 17th International Conference on Computational Science and Engineering (CSE 2014), IEEE, pp. 1746-1751, 2014.Jiazhi Li, Lei Zhang, Attribute-Based Keyword Search and Data Access Control in Cloud, 2014 10th International Conference on Computational Intelligence and Security (CIS 2014), pp. 382-386, 2014.Lei Zhang*, Qianhong Wu, Bo Qin, Hua Deng, Jianwei Liu, Wenchang Shi, Provably Secure Certificateles",
  "content_length": 15231,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:18"
}