{
  "name": "Lei Zhang 0006",
  "homepage": "https://www4.comp.polyu.edu.hk/~cslzhang",
  "status": "success",
  "content": "Lei Zhang's Homepage (HK-PolyU) Lei Zhang Chair Professor of Computer Vision and Image Analysis Fellow of IEEE Department of Computing The Hong Kong Polytechnic University Hung Hom, Kowloon, Hong Kong Office: PQ816 Email: cslzhang at comp.polyu dot edu.hk I am also with OPPO Research Institute. Education 3/1998~10/2001 PhD Dept. of Automatic Control, Northwestern Polytechnical University, Xi'an, China. 9/1995~3/1998 M.Sc Dept. of Automatic Control, Northwestern Polytechnical University, Xi'an, China. 9/1991~7/1995 B.Sc Dept. of Aeronautical Engineering, Shenyang Inst. of Aeronautical Engineering, Shenyang, China. Work Experience 7/2017~present Chair Professor, Dept. of Computing, Hong Kong Polytechnic University, Hong Kong. 7/2015~6/2017 Professor, Dept. of Computing, Hong Kong Polytechnic University, Hong Kong. 9/2010~6/2015 Associate Professor, Dept. of Computing, Hong Kong Polytechnic University, Hong Kong. 1/2006~8/2010 Assistant Professor, Dept. of Computing, Hong Kong Polytechnic University, Hong Kong. 1/2003~1/2006 Postdoctoral Fellow, Dept. of Electrical and Computer Engineering, McMaster University, Canada. 1/2001~1/2003 Research Assistant/Associate, Dept. of Computing, Hong Kong Polytechnic University, Hong Kong. Visual Computing Lab (our mission): Y learning and beyond: for future visual enhancement and understanding. My Google Scholar Citation Profile: http://scholar.google.com/citations?user=tAK5l1IAAAAJ Papers&Codes News 1. Several PhD Student positions jointly trained with OPPO Research Institute are available. The research topics include Image/Video Restoration/Enhancement, Image/Video Quality Assessment, Image/Video Generation, Unified Models, Mobile MLLM, etc. Please send me your CV if you have interest. 2. Several Postdoctoral Fellow or Research Associate positions on Image/Video Generation and Restoration, Image/Video Quality Assessment, Vision-Language Models are available. Please send me your CV if you have interest. 3. Research Interns on Image/Video Enhancement, Image/Video Quality Assessment, Image/Video Generation, Unified Models, Mobile MLLM, etc., are available at OPPO Research Institute. Please send me your CV if you have interest. Newly accepted 1. Z. Zhang, R. Wu, L. Sun, L. Zhang, \"GPSToken: Gaussian Parameterized Spatially-adaptive Tokenization for Image Representation and Generation,\" in NeurIPS 2025. (paper) (code) (Break the limitation of tokenization with fixed grid!) 2. R. Wu, L. Sun, Z. Zhang, S. Wang, T. Wu, Q. Yi, S. Li, L. Zhang, \"DP2O-SR: Direct Perceptual Preference Optimization for Real-World Image Super-Resolution,\" in NeurIPS 2025. (paper) (code) (How can DPO help Real-ISR!) 3. Y. Sun, L. Sun, S. Liu, R. Wu, Z. Zhang, L. Zhang, \"One-Step Diffusion for Detail-Rich and Temporally Consistent Video Super-Resolution,\" in NeurIPS 2025. (paper) (code) (Address the dilemma of VSR in one-step diffusion via dual LoRA learning!) 4. S. Liu, J. Ma, L. Sun, X. Kong, L. Zhang, \"InstructRestore: Region-Customized Image Restoration with Human Instructions,\" in NeurIPS 2025. (paper) (code) (Restore the image as you wish!) 5. C. Xie, M. Li, S. Li, Y. Wu, Q. Yi, L. Zhang, \"DNAEdit: Direct Noise Alignment for Text-Guided Rectified Flow Editing,\" in NeurIPS 2025 (Spotlight). (paper) (code) (High quality editing with accurate background preservation!) 6. T. Wu, J. Zou, J. Liang, L. Zhang, K. Ma, \"VisualQuality-R1: Reasoning-Induced Image Quality Assessment via Reinforcement Learning to Rank,\" in NeurIPS 2025 (Spotlight). (paper) (code) (A strong no-reference quality assessment model with reasoning!) 7. B. Dong, M. Ni, Z. Huang, G. Yang, W. Zuo, L. Zhang, \"MIRAGE: Assessing Hallucination in Multimodal Reasoning Chains of MLLM,\" in NeurIPS 2025. (paper) (code) (How much hallucination in MLLM reasoning?) 8. W. Lin, X. Wei, R. An, T. Ren, T. Chen, R. Zhang, Z. Guo, W. Zhang, L. Zhang, H. Li, \"Perceive Anything: Recognize, Explain, Caption, and Segment Anything in Images and Videos,\" in NeurIPS 2025. (paper) (code) (A perceive anything model with large-scale dataset!) 9. Z. Zhao, C. Xiao, H. Lin, Q. Xie, L. Zhang, D. Meng, \"Polyline Path Masked Attention for Vision Transformer,\" in NeurIPS 2025 (Spotlight). (paper) (code) 10. L. Qu, Z. Liu, S. Zhou, Y. Luo, J. Liang, H. Zeng, L. Zhang, J. Yang, \"BurstDeflicker: A Benchmark Dataset for Flicker Removal in Dynamic Scenes,\" in NeurIPS 2025 (Datasets and Benchmarks Track). (paper) (data&ode) Preprint 1. Z. Wang, X. Wei, B. Li, Z. Guo, J. Zhang, H. Wei, K. Wang, L. Zhang, \"VideoVerse: How Far is Your T2V Generator from a World Model?\" (paper) (code) (To evaluate how strong your T2V model is!) 2. X. Kong, R. Wu, S. Liu, L. Sun, L. Zhang, \"NSARM: Next-Scale Autoregressive Modeling for Robust Real-World Image Super-Resolution,\" (paper) (code) (An efficient and robust AR model for real-world super-resolution!) 3. X. Wei, J. Zhang, Z. Wang, H. Wei, Z. Guo, L. Zhang, \"TIIF-Bench: How Does Your T2I Model Follow Your Instructions?\" preprint. (paper) (code) (To accurately evaluate T2I models' real performance!) 4. W. Zhu, Y. Zhang, X. Jin, W. Zeng, L. Zhang, \"ANTS: Shaping the Adaptive Negative Textual Space by MLLM for OOD Detection,\" preprint. (paper) (code) (Can MLLM help OOD detection?) 5. R. Cui, L. Zhang, \"UNICE: Training A Universal Image Contrast Enhancer,\" preprint. (paper) (code) (A unified model for various image contrast enhancement tasks!) 6. S. Wang, G. Chen, D. Huang, Z. Li, M. Li, G. Li, J.M. Alvarez, L. Zhang, Z. Yu, \"VideoITG: Improving Multimodal Video Understanding with Instructed Temporal Grounding,\" preprint. (paper) (code) (A plug and play approach to improve video understanding tasks!) 7. T. Yang, R. Li, Y. Shi, Y. Zhang, Q. Dong, H. Cheng, W. Feng, S. Wen, B. Peng, L. Zhang, \"Many-for-Many: Unify the Training of Multiple Video and Image Generation and Manipulation Tasks,\" preprint. (paper) (code) (One model, many tasks!) 8. X. Liang, Z. Ma, L. Sun, Y. Guo, L. Zhang, \"AlignCVC: Aligning Cross-View Consistency for Single-Image-to-3D Generation,\" preprint. (paper) (code) (A new pipeline for single-image-to-3D generation!)",
  "content_length": 6112,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:18"
}