{
  "name": "Lei Xie 0006",
  "homepage": "http://compsci.hunter.cuny.edu/~leixie",
  "status": "success",
  "content": "Data Science, Computational Biology, Systems Pharmacology Lab - Lei Xie Research Group at Hunter, CUNY Welcome Research Highlights Publications People Contact Lei Xie, Principal Investigator Ph.D. in Chemistry, Rutgers University - New Brunswick M.S. in Computer Science, Rutgers University - New Brunswick B.S. in Polymer Physics, University of Science and Technology of China 2019-, Adjunct Professor, Neuroscience, Weill Cornell Medical College, Cornell University 2017-, Professor, Computer Science, Hunter College, CUNY Ph.D program in Computer Science and Biochemistry, the Graduate Center, CUNY 2011-2017, Associate Professor, Computer Science, Hunter College, CUNY Ph.D program in Computer Science and Biochemistry, the Graduate Center, CUNY 2004-2011, Principal Scientist, San Diego Supercomputer Center 2002-2004, Senior Scientist, Eidogen Inc. 2000-2002, Associate Scientist, Columbia University and Howard Hughes Medical Institute Technology advances have generated unprecedented amounts of biomedical data. These huge, complex, heterogeneous, dynamic, and noisy data offer great opportunities for tackling unmet needs in disease prevention, diagnosis, and treatment, but impose great challenges in data management, data processing, data integration, data mining, and knowledge discovery. Our research interests are to develop novel methods in Artificial Intelligence and Machine Learning and apply them to advancing biomedicine. Our immediate aims include i) developing new machine learning algorithms for singed network, high-dimensional sparse data, recommender system, and data integration; ii) developing a structural systems pharmacology framework to model drug actions and genotype-phenotype associations on a multi-scale from atomic details of biomolecular interaction to clinical outcomes, and bridging structure-based drug design and systems biology to realize personalized medicine; iii) applying integrated computational and experimental techniques to polypharmacology, drug repurposing, biomarker identification, and the prediction of drug side effects with the focus on drug-resistant bacterial infections, Alzheimer's disease, and cancers. In these directions, a brief summary of our on-going projects is described here. Our previous works are highlighted in the press releases and in our publications.",
  "content_length": 2329,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:20"
}