{
  "name": "Lei Yang 0018",
  "homepage": "https://leiyang0416.github.io",
  "status": "success",
  "content": "Lei Yang | Home Page Lei (Lydia) Yang Assistant Professor Department of Information Sciences and Technology George Mason University Email: lyang29@gmu.edu Address: Office 413, Research Hall Building 4400 University Dr, Fairfax, VA 22030 Research Interests: System-Level Optimization for Applied Machine Learning Automated Machine Learning Embedded System High-performance Computing News: 2022/08 CFP: Dr. Yang will be the General Chair of SIGDA Student Research Forum at ASP-DAC 2023 (SRF ASP-DAC 2023). 2022/08 Dr. Yang joined IST department at George Mason Univeristy as an Assistant Professor. 2022/07 We win the Best Demonstration (Second Place) at the 32st ACM SIGDA University Demonstration. 2021/12 Proposal on Intelligent Quantum Sensing is funded by NSEC at Los Alamos. 2021/12 The first NAS-based HW/SW Co-Design Framework won the Best Paper Award of IEEE TCAD 2021! 2021/12 We win the Best Demonstration (First Place) at the 31st ACM SIGDA University Demonstration . 2021/11 Congrats. to Daniel for the work accepted by SIGDA's Student Research Forum at ASP-DAC 2022! 2021/08 Dr. Yang will serve as a TPC member in DAC 2022. 2021/07 CFP: Dr. Yang will organize E2ML workshop at ICSG'21. Please consider to submit your ML or Quantum work to the workshop! 2021/07 Several papers will be published at IEEE/ACM ICCAD 2021, Congrats. to Daniel, Junhuan, and collaborators! 2021/06 Received an Alveo U280 Data Center Accelerator ($6,495) from the Xilinx University Program. Thanks to Xilinx! 2021/06 Dr. Yang is invited to serve as Guest Editor in IET Cyber-Physical Systems: Theory and Applications. 2021/05 Dr. Yang will serve as the Registration Chair in ICCD 2021. 2021/05 Dr. Yang will serve as a TPC member in ICCAD 2021. 2021/05 Dr. Yang will organize CEDA/ACM SIGDA 2021 Early Career Workshop DAC'21. 2021/04 Dr. Yang will serve as a TPC member in IEEE SOCC 2021. 2021/03 Our two papers are accepted by GLSVLSI 2021. 2020/10 Dr. Yang will serve as a TPC member in DAC 2021. 2020/10 Dr. Yang will serve as a TPC member in SRC at ASP-DAC 2021. 2020/10 Dr. Yang will serve as a TPC member in ASP-DAC 2021. 2020/10 Dr. Yang will serve as a TPC member in SAC 2021. 2020/08 Dr. Yang joined ECE department at the University of New Mexico as an Assistant Professor. 2020/02 Our paper with the collaboration of Facebook and Georgia Tech is accepted by DAC 2020. 2020/01 Dr. Yang will serve as the TPC member in ISLVLSI'20 2020/01 Dr. Yang will serve as the TPC member in GLSVLSI'20 2019/07 Lei has obtained Ph.D. degree and will join the University of Notre Dame as a post-doctoral scholar. 2018/01 More....",
  "content_length": 2611,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:18"
}