{
  "name": "Leila De Floriani",
  "homepage": "https://www.cs.umd.edu/people/deflo",
  "status": "success",
  "content": "Leila De Floriani | UMD Department of Computer Science Skip to main content Explore People People FacultyFaculty Awards In Memoriam Staff Dept. PhonebookFaculty Staff Students As PDF University Directory Search People Overview Name Search by name Title Search by title Location Search by location Apply Reset Leila De Floriani Affiliate Professor Email: defloumd[.dot.]edu Phone: (301) 405-4391 Location: IRB 4206 Website: http://users.umiacs.umd.edu/~deflo/ Wikipedia Bio: en.wikipedia.org Appointments: UMIACS, Cfar, GEOG Research Areas: Graphics Visualization and VR AR, Information Retrieval and Geographic Information Systems (GIS), Machine Learning and Data Science Interest Areas: geometric modeling and processing, topology-based data visualization, topological data analysis Biography Leila De Floriani is a full professor at the University of Maryland with a joint appointment with the Department of Geographical Sciences and University of Maryland Institute for Advanced Computer Studies  (UMIACS).  She is also affiliated with the Department of Computer Science,  with the Center for Geospatial Information Science and with the Center for Automation Research. She has previously been a professor at the University of Genova (Italy), where she developed the first undergraduate and graduate curricula in computer graphics in Italy, and served as Director of the Ph.D. program in Computer  Science for eight years. She has also held positions at the University of Nebraska, at Rensselaer Polytechnic Institute, and at the Italian National Research Council. De Floriani was the 2020 President of the IEEE Computer Society. She is the IEEE Division VIII Director for 2023-24, and a member of the IEEE Board of Directors and of the IEEE Assembly.  Among the other involvements, she has been a member of the IEEE Conferences Committee (2021-23), and of the IEEE Publication Services and Products Board (2023). She also has been a member of the Computing Research Association (CRA) Board in 2020-23. She is currently a member of the Scientific Council of the Italian Scientists and Scholars in North America Foundation (ISSNAF). She is a Fellow of IEEE, a Fellow of the International Association for Pattern Recognition (IAPR), a Fellow of the Eurographics Association,  a Pioneer of the Solid Modeling Association and an inducted member of the IEEE Visualization Academy. She is an  IEEE Computer Society Golden Core awardee and an inducted member of the IEEE Honor Society IEEE Eta Kappa Nu. She has been the editor-in-chief of the IEEE Transactions on Visualization and Computer Graphics (TVCG) for two terms from 2015 to 2018,  and served as an associate editor for IEEE TVCG from 2004 to 2008. De Floriani is currently an  editor of ACM Transactions on Spatial Algorithms and Systems, Computers & Graphics,   Computer Science Review, GeoInformatica, Graphical Models, and International Journal of Spatial Information Science. She has served on the program committees of over 150 leading international conferences, contributing in several conferences in a leadership capacity. De Floriani has authored over 300 peer-reviewed scientific publications in data visualization, spatial data representation and processing, computer graphics, geometric modeling, shape analysis and understanding, garnering several best paper awards and invitations as a keynote speaker. Her research has been funded by numerous national and international agencies, including the European Commission, the National Science Foundation and NASA. Honors and Awards Year Type Org. Name 2020 Fellow Eurographics Eurographics Fellowfor outstanding contributions, leadership and service to the fields of Computer Graphics, Visualization & to the EA in particular, and for foundational contribution to starting up one of the most vital research communities in Geometry & Graphics in Italy 2020 Member IEEE IEEE Visualization Academy 2019 Member IEEE IEEE-HKNfor excellence in education and meritorious work in geometric modeling and scientific visualization 2018 Award IEEE IEEE Computer Society, Society of Golden Core 2017 Award Pioneer, Solid Modelling Associationfor seminal work in solid and feature-based modeling 2016 Fellow IEEE IEEE FellowFor contributions to geometric modeling and visualization 1998 Fellow IAPR IAPRFor contributions to geometric modeling and algorithm design for computer vision applications Students Advised Haoan Feng PhD Student Xiaolong Tian PhD Student Mentions 2021 Leila De Floriani Elected to Serve as IEEE Division VIII Delegate/Director 2018 Affiliate Professor of Computer Science Leila De Floriani is President-Elect of IEEE-CS",
  "content_length": 4643,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:20"
}