{
  "name": "Lejla Batina",
  "homepage": "http://www.cs.ru.nl/~lejla",
  "status": "success",
  "content": "Lejla Batina Lejla Batina Radboud University, The Netherlands Home Bio Research Talks Teaching Latest News WAIFI 2025 November 28, 2025 I am a co-chair of WAIFI 2026 (with Ferruh Ozbudak, June 3-5, 2026 in Santander, Spain. Submission deadline March 1! More AIHWS 2025 March 12, 2025 I am a co-chair of AIHWS (with Shivam Bhasin), collocated with ACNS in Munich. More Links My Google Scholar page My DBLP page Cyber security master @RU Digital Security group Welcome to my webpage We have launched our lab website CESCA I am a full professor (Hoogleraar) in the Digital Security (DiS) group and adjunct professor at the Selmer Center of University of Bergen in Norway. I joined the institute for Computing and Information Sciences (iCIS) at the Radboud University in August 2009. Before that I was PostDoc at KU Leuven Belgium where I also got my PhD in 2005. Before that I worked as a cryptographer for Pijnenburg Securealink (later SafeNet B.V.) in The Netherlands. I got my Professional Doctorate in Engineering from TU Eindhoven in 2001. I have received a VIDI grant from the Dutch government in 2014 to work on new side-channel analysis methods and countermeasures for secure embedded devices. Since 2018, I am a senior member of IEEE and an Editorial board member of ACM TECS. I served as an AE for IEEE Transactions on Information Forensics and Security. 2018-2022 and JCEN, 2012-2018. I was a program co-chair of CHES 2014 in Busan, Korea (the IACR flagship conference on crypto hardware and embedded systems) with Matt Robshaw and of Africacrypt 2022 with Joan Daemen. I also chaired ACMWiSec 2021 with Rene Mayrhofer (virtual) and ACNS2024 in Abu Dhabi with Christina Popper. With Stjepan Picek I was a general co-chair of EUROCRYPT 2020 (the first online IACR conference) and EUROCRYPT 2021 in Zagreb as the first hybrid IACR conference. I was general co-chair of Real World Crypto Symposium for 2021 (virtual) and 2022 (physical in Amsterdam) with Joan Daemen and Peter Schwabe. My research My research interests are in applied cryptography and embedded systems security. I am looking into security and privacy of embedded (crypto) devices such as smartcards, mobile phones and IoT devices. Some of the topics I work on include implementations of cryptography, both high performance and low-cost i.e. in constrained environments. I work on implementation attacks i.e. side-channel and faults and I have a preference for curve-based cryptography (both classical and post-quantum i.e. ECC and isogeny-based). Recently, I've been looking into machine/deep learning for security and privacy and how we can use it for side-channel analysis. Another direction we consider is to perform side-channel analysis on neural nets implementations. I'm also interested in low-cost countermeasures against all kinds of physical attacks, faults and side-channel. Recent publications Konstantina Miteloudi, Lejla Batina, Nele Mentens: A5/3 make or break: A massively parallel FPGA architecture for exhaustive key search. IACR Transactions on Cryptographic Hardware and Embedded Systems (TCHES), 2025(3), 361-388. Péter Horváth, Lukasz Chmielewski, Léo Weissbart, Lejla Batina, Yuval Yarom: BarraCUDA: GPUs do Leak DNN Weights. to appear at USENIX Security Simposium 2025. Vahid Jahandideh, Bart Mennink, Lejla Batina: An Algebraic Approach for Evaluating Random Probing Security With Application to AES IACR Trans. Cryptogr. Hardw. Embed. Syst. 2024(4): 657-689 (2024). Péter Horváth, Dirk Lauret, Zhuoran Liu, Lejla Batina: SoK: Neural Network Extraction Through Physical Side Channels. USENIX Security Simposium 2024. Omid Bazangani, Alexandre Iooss, Ileana Buhan, Lejla Batina: ABBY: Automating leakage modelling for side-channel analysis. AsiaCCS 2024. Lejla Batina, Lukasz Chmielewski, Bjorn Haase, Niels Samwel and Peter Schwabe: SoK: SCA-secure ECC in software  mission impossible? IACR Trans. Cryptogr. Hardw. Embed. Syst. 2023(1): 557-589 (2023). Stjepan Picek, Guilherme Perin, Luca Mariot, Lichao Wu, Lejla Batina: SoK: Deep Learning-based Physical Side-channel Analysis ACM Comput. Surv. 55(11): 227:1-227:35 (2023). Lichao Wu, Léo Weissbart, Marina Krcek, Huimin Li, Guilherme Perin, Lejla Batina, Stjepan Picek: Label Correlation in Deep Learning-Based Side-Channel Analysis IEEE Trans. Inf. Forensics Secur. 18: 3849-3861 (2023). More For a complete list of my publications check my DBLP and Google Scholar pages. Programme Committees 2026: NDSS, EUROCRYPT, TCHES 2025: NDSS, EUROCRYPT, CTRSA, RWC Upcoming events PostDocs/PhD students I am happy to work with some highly motivated PostDocs and PhD students: PostDocs: Durba Chatterjee Zhuoran Liu PhD students: Konstantina Miteloudi, PhD student (co-supervision with Nele Mentens) Azade Rezaeezade, PhD student at TU Delft (co-supervision with Stjepan Picek) Parisa Amiri Eliasi, PhD student (co-supervision with Martha Larson) Mahnaz Namazi, PhD student at Leiden University (co-supervision with Nele Mentens) Asmita Adhikary, PhD student (co-supervision with Ileana Buhan) Vahid Jahandideh, PhD student (co-supervision with Bart Mennink) Abraham Basurto, PhD student (co-supervision with Stjepan Picek) Peter Horvath, PhD student (co-supervision with Ileana Buhan) Lizzy Grootjen, PhD student (co-supervision with Stjepan Picek) External PhD students: Praveen Kulkarni, co-supervision with Stjepan Picek Hulya Evkan, co-supervision with Benjamin Smith Dirk Lauret, co-supervision with Nele Mentens Brahim Mamad, co-supervision with Stjepan Picek Past PhD students and PostDocs PostDocs: Antonio de la Piedra, PostDoc 2015-2016 Ilya Kizhvatov, PostDoc 2016-2017 Vincent Grosso, PostDoc 2016-2017, now with CNRS/Laboratory Hubert Curien, FR Veelasha Moonsamy, PostDoc 2015-2017, now faculty at Ruhr University Bochum Joost Renes, PostDoc in 2019, now with NXP Estuardo Alpirez Bock, PostDoc in 2022 Lukasz Chmielewski, PostDoc 2020-2022, now faculty at Masaryk University, Brno Silvia Mella, PostDoc 2021-2024, now faculty at Radboud University PhD students: Roel Verdult, PhD in 2015 Stjepan Picek, PhD in 2015, now faculty at Radboud University and Univ. of Zagreb Baris Ege, PhD in 2016, now with Riscure Anna Krasnova, PhD in 2017 Louiza Papachristodoulou, PhD in 2019, now with ASML Lukasz Chmielewski, PhD in 2019, now with Masaryk University, Brno Joost Renes, PhD in 2019, PostDoc until Jan. 2020, now with NXP Kostas Papagiannopoulis, PhD in 2020, now faculty at University of Amsterdam Pedro Maat Massolino, PhD in 2021, now with PQShield Unai Rioja, PhD in 2022, now with Ikerlan Niels Samwel, PhD in 2022 (co-supervised with Joan Daemen and Yuval Yarom), now with PQShield Servio Paguada, PhD in 2023 (co-supervised with Ileana Buhan), now with Ikerlan Leo Weissbart, PhD in 2025 (co-supervision with Stjepan Picek) Contact Information Office: Room 03.10, Mercator 1 building @ RU campus Phone: +31 (024) 365 2076 Email: lejla(at)cs.ru.nl Twitter: @lejla_batina Postal Address Faculty of Science Radboud University Postbus 9010 6500 GL Nijmegen The Netherlands Visiting Address (How to get there) Digital Security Group Institute for Computing and Information Sciences (ICIS) Mercator 1, Room 03.10 Toernooiveld 212 6525 EC Nijmegen The Netherlands Copyright © colour_red | HTML5 | CSS | Website Templates",
  "content_length": 7278,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:24"
}