{
  "name": "Leliane Nunes de Barros",
  "homepage": "http://www.ime.usp.br/~leliane",
  "status": "success",
  "content": "Leliane Nunes de Barros Leliane Nunes de Barros Professora Livre Docente Departamento de Ciência da Computação Instituto de Matemática e Estatística Universidade de São Paulo Associate Professor Computer Science Department Institute of Mathematics and Statistics University of São Paulo PhD in Electrical Engineering at the University of São Paulo (partially done at the University of Maryland at College Park, USA). Master in Computer Science at the University of São Paulo, Mathematics and Computer Science Institute of São Carlos. Research Groups LIAMF  - Laboratório de Lógica Inteligência Artificial e Métodos Formais Logics, Artificial Intelligence and Formal Methods Laboratory (CNPq Group) Planning, Cognitive Robotics and Applications Research Group Computer based Learning Research Group Artificial Intelligence in Education Main Research Area AI Planning and Cognitive Robotics Research Interests AI Planning Planning and Scheduling Planning in Cognitive Robotics Abductive Event Calculus Planning Library of Problem Solving Methods Knowledge Management and Knowledge Engineering Semantic Web Artificial Intelligence in Education. Research Projects FAPESP Robótica Cognitiva IBM Eclipse Plugin: ProPAT - Tutor Inteligente baseado em Padrões Pedagógicos FAPESP CCC-AHIA - Cooperação e Compartilhamento de Conhecimento entre Agentes Heterogêneos Inteligentes e Autônomos BIBO Intelligent Search Based on Ontologies NSF-CNPq Mappel - Multi-agent, Collaborative and Adversarial, Perception, Planning, Execution and Learning CNPq Laboratório de Ensino de Inteligência Artificial - Projeto de Iniciação Científica GeometrITS - Inteligent Tutoring System for Descriptive Geometry Teaching 2005 MAC 5700 - Seminários em Ciência da Computação - 1o. Semestre MAC 5701 - Tópicos em Ciência da Computação. - 1o. Semestre LISTA DE MONOGRAFIAS DO PRIMEIRO SEMESTRE DE 2005 MAC 5700 - Seminários em Ciência da Computação - 2o. Semestre MAC 5701 - Tópicos em Ciência da Computação - 2o. Semestre 2004 MAC 115  - Introdução à Computação - Física MAC 5789 - Laboratório de Inteligência Artificial. 2003 MAC 115 Introdução à Computação - Física Segundo semestre MAC 5788 - Planejamento em Inteligência Artificial MAC 5789 - Laboratório de Inteligência Artificial. MAC 2166 - Introdução à Computação (POLI) 2002 MAC115 - Introdução à Computação - Geociência Segundo semestre, 2002. MAC122 - Princípios de Desenvolvimento de Algoritmos. Segundo semestre, 2002. MAC 118 - Noções de Ensino de Matemática usando o Computador. Primeiro semestre, 2002. 2001 MAC 425 e MAC 5739 - Introdução à Inteligência Artificial. Segundo semestre, 2001. Disciplina oferecida simultaneamente para a graduação e pós-graduação. MAC 5788 - Planejamento em Inteligência Artificial Segundo semestre, 2001. MAC 122- Princípios de Desenvolvimento de Algoritmos Primeiro semestre, 2001. 2000 MAC 118 - Noções de Ensino de Matemática usando o Computador. Segundo semestre, 2000. MAC 425 e MAC 5739 - Introdução à Inteligência Artificial. Segundo semestre, 2000. Disciplina oferecida simultaneamente para a graduação e pós-graduação. MAC 2166- Introdução à Computação (POLI) Turma 13. Pimeiro semestre, 2000. Planejamento e Sistemas Tutores Inteligentes - Seminários para a pós-graduação. Primeiro semestre, 2000. Publications Leliane Nunes de Barros Work address: Departamento de Ciência da Computação Instituto de Matemática e Estatística Universidade de São Paulo Rua do Matão 1010 - Bloco C - Sala 206 São Paulo, SP, Brasil - 05508-900 Phone: 55-11-3091-9878 Fax: 55-11-3091-6134 E-Mail: leliane(a)ime,usp,br",
  "content_length": 3573,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:25"
}