{
  "name": "Lene Nielsen",
  "homepage": "https://pure.itu.dk/portal/en/persons/lene-nielsen(1052b289-f510-4c5a-9662-2db48c12ebc2).html",
  "status": "success",
  "content": "Lene Nielsen - IT-University of Copenhagen Lene Nielsen Lene Nielsen PhD Associate Professor, Digitalization, Democracy, and GovernanceREFLACT https://orcid.org/0000-0003-1768-7147 Emailleneitudk 20022025 Research activity per year Personal profile CurriculumLene Nielsen is an Associate Professor at ITU, Section for Digitalization, Democracy and Governance, member of the Reflact research group Her research focuses mainly on personas, and includes democratic businesses and service systems Lene Nielsen was the first to write a PhD about personas. Her research topics include the many aspects of the development and use of personas, such as: Global personasPersonas based on quantitative dataPersona descriptions as communication to specific and different audiencesThe relationship between persona description and dataThe use of personas in agile developmentPersonas in service designPlanetary PersonasAI generated personas Lene Nielsen har published three books, 5 chapters on personas and more than 90 papers Lene Nielsen teaches Organizing and managing services Impact More than 25 research projects with industry. Coaching companies to develop and implement personas 2022: Research input to the expert group assembled by a Danish united parliament on advancing cooperative start-ups in Denmark 2025: Development of Planetary Personas as a business case with Olivia Harre 2025: Guest Editor: Special issue on AI-Generated Personas: Representing User Needs with Generative AI Models. International Journal of Human-Computer Interaction. Nov. 2025 KeywordsPersonasScenariosHCINarrativesService systems designCooperatives Fingerprint Dive into the research topics where Lene Nielsen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Service Design Computer Science 100% Persona Description Computer Science 90% Software Development Computer Science 80% Persona Method Computer Science 75% Human-Computer Interaction Computer Science 71% Design Persona Computer Science 70% Persona Creation Keyphrases 66% User-centered Design Keyphrases 56% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2002 2006 2007 2013 2014 2017 2018 2020 2021 2022 2023 2024 2025 50 Article in proceedings 12 Journal article 6 Book chapter 3 Book 13 More 3 Report 3 Paper 2 Anthology 2 Conference abstract for conference 1 Editorial 1 PhD thesis 1 Working paper Research output per year Research output per year The design of non-human personasNielsen, L. & Neuhoff, R., 1 Mar 2025, International Conference IADIS Information Systems 2025. Nunes, M. B., Isaías, P., Powell, P. & Kommers, P. (eds.). p. 434-438 5 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Emotional Communication 100% Narrative Methods 100% Human Interest 100% Narrative 100% Empathy 100% A case of action research with a focus on collective learning about organisational challenges and solutions for democratically owned businessesNielsen, L., Nicolajsen, H. W. & Baka, V., 2024, Action Research Booklet. Wang, C. & Juncker-Jensen, L. (eds.). Copenhagen: RSS Press, p. 1-4 4 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open Access Action Research BookletWang, C. (Editor), Juncker-Jensen, L. (Editor), Wang, C., Østerlund, C. S., Nicolajsen, H. W., Christensen, L. R., Juncker-Jensen, L., Nielsen, L., Marttila, S.-M., Finken, S., Jiang, Q., Baka, V., Guo, V. & Dittrich, Y., May 2024, 1 ed. Copenhagen: Really Simple Syndication Press. 114 p.Research output: Book / Anthology / Report › Anthology › Research › peer-review Open AccessFile Action Research 100% Digital Technology 66% Intervention Research 66% Digitization 66% Organizational Context 33% A Sociotechnical Design and Evaluation Framework for Digital Democracy and Citizen Participation.Abdelnour-Nocera, J. L., Gutiérrez, J. J. G., Alvarez, M. E. P. & Nielsen, L., 9 Jul 2024, Design for Equality and Justice. Springer, Vol. 14536. p. 3-12 10 p. (Lecture Notes in Computer Science, Vol. 14536).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Citizen Participation 100% Sociotechnical Evaluation 100% Interaction Design 25% Human-Computer Interaction 25% Case Study 25% Designing IT for Governance - The Case of Employee-Owned Businesses. The Case of Employee-Owned BusinessesNielsen, L., Nicolajsen, H. W. & Baka, V., 9 Jul 2024, Design for Equality and Justice: Interact 2023. Springer, p. 13-26 14 p. (Lecture Notes in Computer Science, Vol. 14536).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Employee-owned Business 100% Group Decision-Making 100% Business Software 100% Bricolage 66% Digital Resources 66% View all 84 research outputs Projects Projects per year 2011 2012 2016 2017 2018 2025 1 Active 19 Finished Projects per year Kundeprofil MatrixNielsen, L. (PI) & Hansen, K. S. (CoI)Innovation Fund Denmark01/10/2014 → 31/03/2016Project: Research TRACE: Adjunctive Non-Invasive Vagus Nerve Stimulation in Treatment of EpilepsyNielsen, L. (CoI) & Christensen, L. R. (PI)Inge Berthelsens Fond06/05/2016 → 31/12/2021Project: Research Non-invasive Vagus Nerve Stimulation 100% BOSA: Brugerinddragelse via Online Service i Agil udviklingNielsen, L. (PI)Innovation Fund Denmark07/09/2012 → 07/09/2013Project: Research Online Services 100% Giver 100% Prostaglandin A 100% Online 50% Integrating User Experience Activities in Agile EnvironmentsNielsen, L. (PI)Innovationsnetværk for IT - InfinIT01/09/2017 → 31/03/2018Project: Research Experience Activities 100% User Experience 100% Mini 100% Agile Environments 100% Agile Environment 100% COOPs: Iværksætteri med demokratisk islæt: analyse af forholdene i DanmarkNielsen, L. (PI), Nicolajsen, H. W. (CoI), Baka, V. (CoI), Victor, F. F. (CoI), Stana, R. A. (CoI) & Sivertsen, S. (CoI)Danish Business Authority01/11/2021 → 31/12/2022Project: Research View all 20 projects Press/Media 939 forskere og akademiske medarbejdere opfordrer til våbenhvile og ende på besættelsenCarreras, B. N., Larsen, A. W., Laursen, C. S., Friis, H., Schyberg, K. A., de Neergaard, K. S. P., Sandbukt, S., Gahoonia, S. K., Ferreira, P., Hockenhull, M., Cohn, M., Rasmussen, L. & Nielsen, L.14/11/20231 Media contributionPress/Media: Press / Media Sommerskole på Bornholm lokker københavnere til Nexø: IT-studerende hjælper bornholmske virksomhederNielsen, L.18/08/20181 Media contributionPress/Media: Press / Media IT-studerende hjælper bornholmske virksomhederNielsen, L.15/08/20181 Media contributionPress/Media: Press / Media Iværksætteri skal bygges på uddannelserNielsen, L.15/06/20181 Media contributionPress/Media: Press / Media It-studerende fra København hjælper lokale virksomheder : Vi bliver så godt taget imodNielsen, L.26/08/20171 Media contributionPress/Media: Press / Media View all 15 press/media",
  "content_length": 7452,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:26"
}