{
  "name": "Lenhart K. Schubert",
  "homepage": "https://www.cs.rochester.edu/~schubert",
  "status": "success",
  "content": "Lenhart K. Schubert's Home Page Lenhart K. Schubert Professor Emeritus Computer Science Department Rochester, NY 14627-0226 Email: lastname AT cs DOT rochester DOT edu Fax: (585) 273-4556 Ph.D. (1970) University of Toronto. Assistant Professor ('73-'77), Associate Professor ('77-'84), Professor ('84-'88); University of Alberta. Professor ('88-'24) and Professor Emeritus ('24-present), University of Rochester. I am also a member of the Center for Language Sciences (CLS). My research interests center around language, dialogue agents, knowledge representation, and reasoning. These interests are tied together by the general goal of developing AGI agents -- ones with not only conversational fluency, but with common sense and human-level logistical and planning abilities, self-awareness, self-motivation, and the ability acquire knowledge through language and observation. Some specific topics my collaborators and I have worked on include speech-based animated dialogue agents for both conversation practice (in casual and medical settings) and in a physical table-top blocks world; very expressive, language-like logics to capture the content of ordinary language as directly as possible, in a way that supports reliable, explainable reasoning. A well-developed version supported by a general inference engine is Episodic Logic; this can be viewed as a formalization and generalization of natural logic. a comprehensive framework for schemas (subsuming scripts, frames, and plans) for guiding understanding and behavior (including dialogue); schema learning from text and human-computer interaction; semantics of events/situations, tense/aspect, reference, affixes, mass terms, generic sentences, belief, questions, vagueness; efficient, specialized inference techniques for taxonomies, part-structure, temporal relations, and other classes of relations that pervade commonsense knowledge and are handled effortlessly by people; high-fidelity semantic parsing, allowing for the full expressivity of natural language; natural-logic-like inference based on unscoped logical forms; see the ULF website by Gene Kim; more recent work on ULF is reported in Publications (below: look for Miles Frank and Lane Lawley); rule-based probabilistic inference using algebraic probabilities; Deriving general world knowledge from texts and taxonomies, as an attack on the \"knowledge acquisition bottleneck\" in AI; a system developed 2001-9 is called KNEXT (KNowledge EXtraction from Text). More recent work mines large language models (LLMs) for knowledge about common artifacts (below: look for Hannah Y. An); reasoning about plans and actions, in support of both language understanding (e.g., conversation planning and inferring the goals and plans of story characters) and domain reasoning (e.g., formulating plans of action in a transportation domain); automatically discovering invariants in planning domains -- see the DISCOPLAN system; solving the Frame Problem using \"explanation closure\". Some courses taught: CSC 191/291 (Topics in Computer Science): Machines and Consciousness DSC 530 (module on NLP) CSC 244/444: Machine Reasoning CSC 247/447: Natural Language Processing CSC 280: Computer Models and Limitations CSC 242: Artificial Intelligence Present/recent faculty & graduate research collaborators: Hannah An: Lexical knowledge and object schema acquisition Benjamin Kane, PhD 2024: Schema-Based Dialogue Management: From Friendly Peer to Virtual Standardized Cancer Patient; Now at OpenStream.AI. Lane Lawley,, PhD 2022: Episodic Logic Schema Learning; Now at Paychex (after Two Six Technologies and a Postdoc at Georgia Tech). Georgiy Platonov, PhD 2022: On Cognitively Informed Models for Spatial Relations; Now at Google Cloud, Sunnyvale, CA. Gene Kim, PhD 2021: Corpus Annotation, Parsing, and Inference for Episodic Logic Type Structure; Now at University of South Florida. S. Zahra Razavi, PhD 2021: Dialogue Management and Turn-Taking Automation in a Speech-Based Conversational Agent;Now at Tawheed International School, Tehran, and co-founder or Ussistant (a Farsi personal assistant). Viet Duong: Semantic parsing and ULF-based inference M. Ehsan Hoque: Virtual humans for conversation training Mohammad Rafayet Ali: Virtual humans for dialogue practice Daniel Gildea: Semantic parsing James Allen: Dialogue processing, deep understanding Greg Carlson (Linguistics): Semantics of action and event nominals Alfonso Gerevini: (U. Brescia): Efficient domain-independent planning Present/ recent Undergraduate research assistants: Miles Frank, Jiacan Yu. Nono Horiuchi, Riya Sharma; in 2021 & 2022: Muskaan Mendiratta, Benjamin Kuehnert, Marcus Hill, Mandar Juvekar, Xi (Lucy) Lu, Aaron Gindi, Benson Gathee, Yifei Yang, Jonathan Waxman, Junis Ekmekciu, Catherine Giugno, Haoyu Wu, Serena Matera, Erin Gibson, Winnie Wan, Piyush Saina, Alexa Miller Some past research collaborators (1988-2018): Adam Purtee (Ph.D. 2018, U of R), now a U of R faculty member: Knowledge representation, pattern transduction, rule-based probabilistic inference Jonathan Gordon (Ph.D. 2014, U of R), now at Vassar College: Inferential commonsense knowledge from text Daphne Liu (Ph.D. 2012, U of R), now at Sales Force: Self-motivated cognitive agent design Benjamin Van Durme (Ph.D. 2010, U of R), now at Johns Hopkins U: Extracting implicit knowledge from text Fabrizio Morbini (Ph.D. 2009, U of R), now at Tact.ai: Computational infrastructure for a self-aware agent Shuwen Zhang: Sentiment analysis in dialogue, turn-taking corpus annotation Zining Wen: Sentiment analysis system using word occurrence patterns Burkay Donderici: Logical form annotation for semantic parsing, spatial relation judging Akihiro Minami (U of R undergrad): Logical form annotation for semantic parsing corpus; spatial relation judging Tianyi Ma (U of R MS student): Dialogue turn-taking annotation; logical form annotation for semantic parsing Eric Bigelow (U of R undergrad), now M.S. grad at U of R: Imagistic modeling for story understanding Daniel Scarafoni (U of R undergrad), now MS grad at U of R: Imagistic modeling for story understanding Alex Wilson (U of R undergrad): Imagistic modeling for story understanding David Sekora (U of R undergrad), now Ph.D. candidate, UMD: Verb argument structure compilation, schema building Adina Rubinoff (U of R undergrad), now at Factset, Norwalk, CT: Acquiring lexical meaning postulates via VerbNet Ting Qian (U of R undergrad, then Ph.D.), now data scientist at The Children's Hospital of Philadelphia: Class attribute extraction, lexical semantics Henry Kyburg, Jr.: http://www.cs.rochester.edu/dept/news/kyburg_obituary.shtml Proshanto Mukherji: (Ph.D. 2006, U of R), now an Associate at Fish & Richardson in Boston, after earning a JD at Harvard Law School: Discovering Laws as Anomalies in Logical Worlds Tom Weingarten (U of R undergrad), subsequently NYU PhD, now CTO at Delve News, New York: Using pulse train to compute probabilities in Bayesian networks David Ahn: (Ph.D. 2004, U of R), now computational semanticist at Google: Semantics/pragmatics of adverbially quantified sentences Teresa Zollo: (Ph.D. 2003, U of R), now at Ithaca College: Recovery from speech recognition errors Matthew Tong: (B.Sc. 2003, U of R), now at IBM's Austin Research Lab: Mining general world knowledge from texts Amon Seagull (Ph.D. 2000, U of R), now IT and Portfolio Manager, Magic Leap, Fort Lauderdale: Well-foundedness and reliability in natural language parsing Aaron Kaplan:, (Ph.D. 2000, U of R), now lead software engineer at NewsCred, New York, after 10 years at XRCE, Grenoble: A computational model of belief Mark Core (Ph.D. 2000, U of R), now at the Institute for Creative Technologies, Playa Vista, CA: Dialog parsing: From speech repairs to speech acts Marc Light (Ph.D. 1995, U of R), now senior scientist at WindLogics, St. Paul: Morphological cues for lexical semantics Massimo Poesio (Ph.D. 1994, U of R), now at Queen Mary University, U.K.: Assigning semantic scope to operators in dialogues Chung Hee Hwang (Ph.D. 1992, U of Alberta), now retired from GE Global Research, Schenectady, NY: A logical approach to narrative understanding, Episodic Logic Alice Kyburg (Ph.D. 1994, U of R), now at U. Wisconsin at Oshkosh: Pragmatic and semantic accounts of vagueness Stephanie Schaeffer (M.S. 1988, U of Alberta), systems prog., 1988-92: Temporal reasoning, hybrid reasoning, EPILOG development Jeffry Pelletier (Professor, U. Alberta): Semantic interpretation, semantics of mass terms and generics Fahiem Bacchus (Ph.D. 1988, U of Alberta), now at U. Toronto: Representing and reasoning about probabilistic knowledge Caoan Wang (Ph.D. 1988, U of Alberta), now at Memorial U. of Newfoundland: Computational geometry Professional activities and awards KR'98 program co-chair ACL'93 program chair CSCSI'80 program chair ACM Trans. on Computational Logic editorial board (2007-2025) JAIR editorial board (1996-1999) Computational Intelligence editorial board (1985-2003) Computational Linguistics editorial board (1983-5) Fellow of the AAAI (elected in 1993 for \"fundamental contributions in NLP, esp. in the formalization, representation, and practical implementation of non-first order concepts\") Alexander von Humboldt Fellow (1978-9) Associate of the Canadian Institute for Advanced Research (1985-88) Outstanding Contribution award for the KR'89 paper (with C.H. Hwang), \"An episodic knowledge representation for narrative texts\" Publications Lenhart Schubert, \"Tackling the Pretty Hard Problem: Could robots have human-like consciousness?\", 12th Ann. Conf. on Advances in Cognitive Systems (ACS-2025), Georgia Institute of Technology, Atlanta, Georgia, October 13-15, 2025. Hannah Y. An and Lenhart Schubert, \"Large language models as a tool for mining object knowledge\", CAOS 9: Cognition and Ontologies, at Joint Ontology Workshops (JOWO), 15th Int. Conf. on Formal Ontology in Information Systems (FOIS 2025), Catania, Italy, September 8-12, 2025, 14pp. Mil",
  "content_length": 42003,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:27"
}