{
  "name": "Lenka Zdeborová",
  "homepage": "https://people.epfl.ch/lenka.zdeborova",
  "status": "success",
  "content": "EPFL - Lenka Zdeborová Données administratives Lenka Zdeborová lenka.zdeborova@epfl.ch +41 21 693 83 27 https://www.epfl.ch/labs/spoc/ vCard Professeure associée, Laboratoire de physique statistique des systèmes computationnels (IC/SB) EPFL SB IPHYS SPOC1BSP 722 (Cubotron UNIL)Rte de la Sorge1015 Lausanne +41 21 693 83 27 Office: BSP 722 EPFL › IC › IINFCOM › SPOC2 Professeure associée, Laboratoire de physique statistique des systèmes computationnels (SB/IC) EPFL SB IPHYS SPOC1BSP 722 (Cubotron UNIL)Rte de la Sorge1015 Lausanne +41 21 693 83 27 Office: BSP 722 EPFL › SB › IPHYS › SPOC1 Site web: https://www.epfl.ch/labs/spoc/ Enseignement et PhD Enseignement et PhD Current Phd Cédric Xavier Koller, Gabriele Farnè, Yizhou Xu, Yatin Dandi, Odilon Duranthon, Emanuele Troiani, Fabrizio Boncoraglio Past Phd As Director Hugo Chao Cui, Giovanni Piccioli, Lucas Andry Clarte, Freya Behrens Courses Lecture series on scientific machine learning PHYS-754 Ce cours présente des travaux sur la façon dont les questions scientifiques peuvent être abordées à l'aide de l'apprentissage automatique. L'apprentissage automatique permet d'extraire des connaissances à partir de données de manière automatisée. Nous apprendrons à partir d'exemples concrets. Machine learning for physicists PHYS-467 L'apprentissage automatique et l'analyse de données deviennent de plus en plus centraux dans les sciences, notamment en physique. Dans ce cours, les principes fondamentaux et les méthodes d'apprentissage automatique seront introduits et mis en pratique. Science des données PHYS-231 Ce cours présentera les bases de l'analyse des données et de l'apprentissage à partir des données, l'estimation des erreurs et la stochasticité en physique. Les concepts seront introduits théoriquement ainsi que via des exercices numériques réalisés en Python. Back to top",
  "content_length": 1847,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:26"
}