{
  "name": "Lenore Cowen",
  "homepage": "http://www.cs.tufts.edu/~cowen",
  "status": "success",
  "content": "Lenore J. Cowen Lenore J. Cowen Dr. Lenore J. Cowen is a Professor in the Computer Science Department at Tufts University She also has a courtesy appointment in the Tufts Mathematics Department. She received a BA in Mathematics from Yale and a Ph.D. in Mathematics from MIT. After finishing her Ph.D. in 1993, she was an NSF Postdoctoral Fellow and then joined the faculty of the Mathematical Sciences Department (now the Applied Mathematics and Statistics department) at Johns Hopkins University where she was promoted to the rank of Associate Professor in 2000. Dr. Cowen was named an ONR Young Investigator and a fellow of the Radcliffe Institute for Advanced Study. Lured by the Boston area, and the prospect of making an impact in a growing young department, she joined Tufts in September, 2001. She was named both a SIAM fellow and a fellow of the International Society for Computational Biology (ISCB) in 2023. Dr. Cowen's research interests span three areas: Discrete Mathematics (since high school), Algorithms (since 1991 in graduate school) and most recently Computational Molecular Biology, where she focuses on predicting protein function from structural and biological network information. She led a team that won the DREAM Disease Module Identification challenge in 2016. She is on the Editorial Board of the IEEE/ACM Transactions of Computational Biology and Bioinformatics (TCBB) and an Associate Editor of the journal Bioinformatics(from Oxford University press). In 2020, she was awarded both the CRA-E Undergraduate Research Faculty Mentoring Award from the Computing Research Association, and the NCWIT Undergraduate Research Mentoring Award from the National Center for Women and Information Technology. On a more personal note, she notes that she is proudly married to a computer geek, but she is still trying to get used to the fact that she is now the mother of college students! US Mail: CS Department Tufts University 161 College Avenue Medford, MA 02155 U.S.A. Email: cowen at cs.tufts.edu OR firstname.lastname at tufts.edu OR firstname.lastname at gmail.com Phone: +1-617-627-5134 (answered when I am at my desk; please don't leave a message: either send me email or call the main CS department office). Research I am interested in graphs, networks and algorithms. Lately, I have been applying my expertise in these areas to Computational Molecular Biology: we live in a golden age of exponential growth in the amount of sequence, structure, expression, network, and other types of high-throughput data that is becoming available for the study of genes, proteins and human diseases. I am interested in designing better algorithms to make functional inferences integrated across these heterogeneous data sets. You can see a current CV Here Check out the article about corals project that appeared in Tufts Now in October 2020!! I also work on: Computational Structural Biology , and Remote Sequence Homology: pre the protein language model era, my research group was probably best known for its work on recognizing beta-structural motifs, and for the Matt multiple structure alignment program. We also provided the Mattbench benchmark of protein structural alignments as a service to the community for testing your favorite protein sequence aligner. More recently, we are working on lightweight pre-trained protein language models for protein-protein interaction and drug-target interaction prediction. Biological Networks Here my training in graph theory and graph algorithms has led to new diffusion metrics for \"detangling\" PPI network hairballs, work on redundant pathways and dense bipartite structure, and also for methods to incorporate known pathways into random walk-based predictions of protein function. Together with my colleague Donna Slonim we jointly run the Tufts BCB group and welcome interested students to email one of us for an invitation to visit our weekly group meetings during the semester. New! Our project on analysis of Genetic Interaction Networks is funded by NIGMS at NIH! More info coming soon!! I recently led the Tufts effort in 2 grants that were part of the National Science Foundation's \"Harnessing the Data Revolution\" big idea: 1) T-Tripods @ Tufts Read about our NSF-funded institute for transdisciplinary research for Foundations of Data Science at Tufts 2) Synthetic Coral project I am working on the bioinformatics behind trying to understand and model Coral Reefs as a \"living 3D printer\" in the laboratory with an exciting interdisciplinary team of researchers. Prior to this research in biological networks was funded by NSF DMS-1812503, in a project joint with my math department colleague Xiaozhe Hu. 10 years ago, my research in computational structural biology was funded by NIH grant 1R01GM080330-01A1 (from 2008-2013). Even longer ago, a grant from NSF (grant CCR0208629) funded work on approximate routing, and portions of my computational biology research first funded by an NSF Large ITR grant (with PI Simon Kasif of BU). My Ph.D. advisor was Daniel J. Kleitman ; my graduated Ph.D. students to date are Christine Cheng (JHU/1999), 1/2 Christopher Wagner (JHU/1999), Adam Cannon (JHU/2000), Arthur Brady (Tufts/2008), Anoop Kumar (Tufts/2010), Noah Daniels, (Tufts/2013), Mengfei Cao (Tufts/2016) , Monsurat Olaosebikan (Tufts/2023: co-advised with Prof Orit Shaer from Wellesley College) Kapil Devkota (Tufts/2023), Nicholas Rabb (Tufts/2024: co-advised with Prof. JP de Ruiter) Polina Shpilker (Tufts/2025) Plus I co-advised Guangtao Ge's doctorate in 2009 and was on the committee for Sarah Hladikova's interdisciplinary Ph.D. doctorate in 2024. (My Erdos number is 2 (but so is everyone else's)). Teaching In academic year 2025-6, I am teaching CS 170: Theory of Computation in Fall 2025 and CS 167: Computational Biology in Spring 2026 I was on sabbatical for academic year 2023-2024. In Spring 2025, I taught 2 classes: CS 142 Network Science and CS 260 Advanced Algorithms. Spring 2023, I taught Advanced Algorithms which I last taught in Fall 2021. Fall 2022 I again taught Network Science . This is a course I created and taught for the first two times in Fall 2019 and Fall 2020; it now has moved from a Special Topics course number to its dedicated course number CS 142. Summer 2022 I taught Discrete Mathematics Spring 2022: I taught Comp 170, Theory of Computation, which I last taught in Spring 2021 and before that in Fall 2017. The information and the course website is mostly on the University Canvas site, which (sorry!) only those enrolled in the class have access to (the zoom integration was just too attractive, so I went with the centralized university solution--) Some limited information about the course is publicly accessible here: Comp 170 Fall 2018, I taught Comp 167-- Computational Biology which I last taught in Fall 2011. I am teaching it again in Spring 2026. Spring 2017 I taught Discrete Mathematics which I also taught in Fall 2008, Fall 2009, Spring 2010, Spring 2012, Fall 2012, Spring 2013, Spring 2016 and Fall 2016. Fall 2016 I also experimented with trying to teach an elective course which was an introduction to Computational Biology from the perspective of Big Data. In the past, I have also taught Protein Bioinformatics Topics (Fall 2010), , and one of my favorite classes to teach: Graph Theory (Fall 2007). Publications Selected Publications in Computational Biology (for Full list, see CV or Google Scholar) New! K. Devkota, A. Blumer, X. Hu and L. Cowen Approximate IsoRank for Scalable and Meaningful Cross-Species Alignments of Protein Interaction Networks, Journal of Computational Biology, 2024. Preliminary version appeared at Recomb 2024. New! S. Sledzieski, K. Devkota, R. Singh, L. Cowen and B. Berger TT3D: Leveraging precomputer protein 3D sequence models to predict protein-protein interactions. Bioinformatics, Vol 39 (2023), btad663. New! R. Singh, S. Sledzieski, B. Bryson, L. Cowen and B. Berger, Contrastive learning in protein language space predicts interactions between drugs and targets, PNAS, Volume 120 (2023), e2220778120. L. J. Cowen and H. M. Putnam, Bioinformatics of Corals: Investigating Heterogeneous Omics Data from Coral Holobionts for Insight Into Reef Health and Resilience Annual Reviews of Biomedical Data Science, Vol 5 (2022), 205-231 K. Devkota, H. Schmidt, M. Werenski, J.M. Murphy, M. Erden, V. Arsenscu and L. Cowen, GLIDER: Function Prediction from GLIDE-based Neighborhoods Bioinformatics, Vol 38 (2022), 3395-3406. S. Sledzieski, R. Singh, L. Cowen and B. Berger D-SCRIPT translates genome to phenome with sequence-based, structure-aware, genome-scale predictions of protein-protein interactions Cell Systems, Vol 12 (2021), 969-982.e6 V. Arsenescu, K. Devkota, M. Erden, P. Shpilker, M. Werenski and L. Cowen, MUNDO: Protein function prediction embedded in a multispecies world Bioinformatics Advances, Vol 2 (2022), vbab025. K. Devkota, J. M. Murphy, L.J. Cowen, GLIDE: combining local methods and diffusion state embeddings to predict missing interactions in biological networks Bioinformatics, Vol 36 (2020), i464-i473. J.P. Baskaran, A. Weldy, J. Guarin, G. Munoz, P. Shpilker, M. Kotlik, N. Subbiah, A. Wishart, Y. Peng, M. Miller, L.J. Cowen, M. J. Oudin, Cell shape, and not 2D migration, predicts extracellular matrix-driven 3D cell invasion in breast cancer, APL Bioengineering, Vol 4(2) (2020), 026105. S. Choobdar, M. E. Ahsen, J. Crawford, M. Tomasoni, T. Fang, D. Lamparter, J. Lin, B. Hescott, X. Hu, J. Mercer, T. Natoli, R. Narayan, The DREAM Module Identification Challenge Consortium, A. Subramanian, J. D. Zhang, G. Stolovitzky, Z. Kutalik, K. Lage, D. K. Slonim, J. Saez-Rodriguez, L. J. Cowen, S. Bergmann and D. Marbach, Assessment of Network Module Identification Across Complex Diseases Nature Methods, Vol 16 (2019), 843-852. J. Lazarsfeld, J. Rodriguez, M. Erden, Y. Liu and L. Cowen, Majority Vote Cascading: A Semi-Supervised Framework for Improving Protein Function Prediction, IEEE/ACM Tra",
  "content_length": 25118,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:28"
}