{
  "name": "Leo Porter 0001",
  "homepage": "https://leoporter.ucsd.edu",
  "status": "success",
  "content": "Leo Porter – UC San Diego Leo Porter Professor Computer Science and Engineering UC San Diego I am a Professor of Computer Science at UC San Diego interested in computer science education research and computer architecture. I co-founded the Computing Education Research Laboratory dedicated to better understanding how students learn computing and creating instructional environments where a diverse group of students can succeed. READ MORE Learn to Program in the Era of ChatGPT Dan Zingaro and I wrote the book, Learn AI-Assisted Python Programming, to help beginners learn how to write software that is meaningful to them by leveraging the power of AI tools (including GitHub Copilot and ChatGPT).  In this book, readers will learn the essential skills of writing software with an AI-Assistant, including code reading, code testing, code debugging, and problem decomposition.  We believe AI tools like GitHub Copilot have made it easier than ever to learn to program and we hope you enjoy our book. For programming instructors interested in using our book in your classes, feel free to e-mail me (leporter (at) ucsd.edu) to request an instructor review copy, peruse the class website from our offering at UC San Diego that includes our schedule and syllabus, review the course projects and slides available for your use. or read our recent experience report that includes student perceptions and lessons learned about the course. Selected Publications A Demographic Analysis on Prerequisite Preparation in an Advanced Data Structures Course. Sophia Krause-Levy, Sander Valstar, Leo Porter and William Griswold. In Proceedings of the Special Interest Group on Computer Science Education (SIGCSE) Technical Symposium, March, 2022. Best Paper Award. Understanding Sources of Student Struggle in Early Computer Science Courses. Adrian Salguero, William G. Griswold, Christine Alvarado and Leo Porter. In Proceedings of the Conference on International Computing Education Research, August, 2021. The Relationship Between Sense of Belonging and Student Outcomes in CS1 and Beyond. Sophia Krause-Levy, William G. Griswold, Leo Porter and Christine Alvarado. In Proceedings of the Conference on International Computing Education Research, August, 2021. VIEW ALL Home About Me Projects Publications Talks Teaching Online Teaching Contact",
  "content_length": 2330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:32"
}