{
  "name": "Leon Bungert",
  "homepage": "https://www.uni-wuerzburg.de/caidas/people",
  "status": "success",
  "content": "People - Center for Artificial Intelligence and Data Science Intern Animation stoppen Center for Artificial Intelligence and Data Science CAIDAS is headed by an executive board consisting of five members. One of the executive board's members acts as CAIDAS' spokeperson. The executive board is supported by an administrative office. The heads of chairs and research groups are regular members of CAIDAS. Prof. Dr. Andreas Hotho Chair for Data Science University of Würzburg Emil-Fischer-Straße 50 97074 Würzburg Gebäude: Geb. 50 Raum: 03.004 Telefon: +49 931 31 - 88453 Fax: +49 931 31 - 86732 E-Mail: hotho@informatik.uni-wuerzburg.de Google Scholar profile Prof. Dr. Ingo Scholtes Chair for Machine Learning for Complex Networks Emil-Fischer-Straße 50 97074 Würzburg Gebäude: Geb. 50 Raum: 03.030 Telefon: +49 931 31-89290 E-Mail: ingo.scholtes@uni-wuerzburg.de Google Scholar profile Twitter Prof. Dr. Carolin Biewer Chair of English Linguistics Neuphilologisches Institut University of Würzburg Am Hubland 97074 Würzburg Gebäude: Philosophie-Gebäude Raum: 5.E.22 (Bau 5) Telefon: +49 931 31 80224 E-Mail: carolin.biewer@uni-wuerzburg.de Prof. Dr. Goran Glavaš Chair for Natural Language Processing Emil-Fischer-Straße 50 97074 Würzburg Gebäude: Geb. 50 Raum: 02.004 Telefon: +49 931 31-81352 E-Mail: goran.glavas@uni-wuerzburg.de Google Scholar Profile Prof. Dr. Gunther Gust Business informatics and artificial intelligence in the company John-Skilton-Straße 8a 97070 Würzburg Gebäude: John Skilton Str. 8a Raum: 04.004 Telefon: +49 931 31-85115 E-Mail: gunther.gust@uni-wuerzburg.de Google Scholar Profile Prof. Dr. Katharina Breininger Professorship for Pattern Recognition John-Skilton-Str. 4a 97074 Würzburg Gebäude: John-Skilton-Str. 4a Raum: 04.B.03 Telefon: +49 931 31-81914 E-Mail: katharina.breininger@uni-wuerzburg.de Googe Scholar Profile Prof. Dr. Leon Bungert Professorship for Mathematics III (Mathematics of Machine Learning) Emil-Fischer-Straße 40 97074 Würzburg Gebäude: Mathematics East(40) Raum: 01.008 Telefon: +49 931 31 82849 Fax: +49 931 31 81492 E-Mail: leon.bungert@uni-wuerzburg.de Google Scholar Profile Prof. Dr. Carlo D'Eramo Professorship for Reinforcement and Computational Decision Making John Skilton Str. 8a 97074 Würzburg Gebäude: John Skilton Str. 8a Raum: 04.016 Telefon: +49 931 31-83457 E-Mail: carlo.deramo@uni-wuerzburg.de Google Scholar Profile Prof. Dr. Christoph M. Flath Chair for Information Management University of Würzburg Sanderring 2 97070 Würzburg Gebäude: Sanderring 2 Raum: 109 Telefon: +49 931 31-85128 E-Mail: christoph.flath@uni-wuerzburg.de Google Scholar Profile Prof. Dr. Damien Garreau Professorship for Theory of Machine Learning John Skilton Str. 8a 97074 Würzburg Gebäude: John Skilton Str. 8a Raum: 03.004 Telefon: +49 931 31-89206 E-Mail: damien.garreau@uni-wuerzburg.de Google Scholar Profile personal website Prof. Dr. Dominic Grün Chair for Computational Biology of Spatial Biomedical Systems Institute of Systems Immunology 97078 Würzburg Gebäude: E6 Raum: 309 Telefon: +49 931 31 - 81481 E-Mail: dominic.gruen@uni-wuerzburg.de Google Scholar profile Prof. Dr. Dr. Eric Hilgendorf Chair for Criminal Law, Criminal Justice, Legal Theory, Information and Computer Science Law Alte Universität Domerschulstraße 16 97070 Würzburg Gebäude: Domerschulstraße 16 Telefon: +49 931 31-82304 Fax: +49 931 31-82797 E-Mail: hilgendorf@jura.uni-wuerzburg.de Prof. Dr. Fotis Jannidis Chair for Computer Philology and History of Contemporary German Literature Institute for German Philology University of Würzburg Am Hubland 97074 Würzburg Gebäude: PH1 Raum: 8.E.13 Telefon: +49 931 -31 - 800 78 E-Mail: fotis.jannidis@uni-wuerzburg.de Google Scholar profile Dr. Adrian Krenzer Junior Research Group for AI in Medicine John-Skilton-Straße 4a 97074 Würzburg Gebäude: John-Skilton-Straße 4a Raum: B001 Telefon: +49 931 31-84971 E-Mail: adrian.krenzer@uni-wuerzburg.de Google Scholar Profile Prof. Dr. Marc Erich Latoschik Chair for Human-Computer Interaction University of Würzburg Emil-Fischer-Straße 50 97074 Würzburg Gebäude: M1 Raum: 1.021 Telefon: +49 931 31 85871 E-Mail: marc.latoschik@uni-wuerzburg.de Google Scholar profile Prof. Dr. Frank Puppe Chair for Artificial Intelligence and Knowledge Systems University of Würzburg Am Hubland 97074 Würzburg Gebäude: Computer Science(M2) Raum: B010 Telefon: +49 931 31 - 86730 Fax: +49 931 31 - 86732 E-Mail: puppe@informatik.uni-wuerzburg.de Google Scholar profile Prof. Dr. Ingo Scholtes Chair for Machine Learning for Complex Networks Emil-Fischer-Straße 50 97074 Würzburg Gebäude: Geb. 50 Raum: 03.030 Telefon: +49 931 31-89290 E-Mail: ingo.scholtes@uni-wuerzburg.de Google Scholar profile Twitter Prof. Dr. Hannes Taubenböck Deutsches Zentrum für Luft- und Raumfahrt e.V. (DLR) Deutsches Fernerkundungsdatenzentrum (DFD) Münchner Straße 20 82234 Wessling & Universität Würzburg Lehrstuhl für Globale Urbanisierung und Fernerkundung John-Skilton-Str. 4a 97074 Würzburg Telefon: +49 08153 28-2480 E-Mail: hannes.taubenboeck@dlr.de Google Scholar Profile Prof. Dr. Frédéric Thiesse Chair of Business Informatics and Systems Development Sanderring 2 97070 Würzburg Gebäude: Sanderring 2 Raum: 110 (EG) Telefon: +49 0931 31-80789 E-Mail: frederic.thiesse@uni-wuerzburg.de Google Scholar Profile Prof. Dr. Radu Timofte Chair for Computer Vision John-Skilton-Str. 4a 97074 Würzburg Gebäude: John-Skilton-Str. 4a Raum: 02.B.01 Telefon: +49 931 31-84169 E-Mail: radu.timofte@uni-wuerzburg.de Google Scholar profile Augmented Perception Group @ ETH Zurich Prof. Dr. Christof Weiß Professorship for Computational Humanities Am Hubland 97074 Würzburg Gebäude: M4 Telefon: +49 931 31-80528 E-Mail: christof.weiss@uni-wuerzburg.de Google Scholar Profile Prof. Dr. Carolin Wienrich Professorship for Psychology of Intelligent Interactive Systems Emil-Fischer-Straße 50 97074 Würzburg Gebäude: Geb. 50 Raum: 01.031 Telefon: +49 931 31 88051 E-Mail: carolin.wienrich@uni-wuerzburg.de Prof. Dr. Christophe Zimmer Josef-Schneider-Str. 2 97080 Würzburg Gebäude: Haus D15 Telefon: +49 931 31-80368 E-Mail: christophe.zimmer@uni-wuerzburg.de Google Scholar Profile Dr. Marianus Ifland Institute of Computer Science University of Würzburg Am Hubland 97074 Würzburg Gebäude: M4 Raum: 00.006 Telefon: +49 931 31 - 86746 E-Mail: marianus.ifland@uni-wuerzburg.de Kontakt Center for Artificial Intelligence and Data Science (CAIDAS) Campus Hubland Nord Emil-Fischer-Straße 50 97074 Würzburg E-Mail Suche Ansprechperson Hubland Nord, Gebäude 50 HomeThe UniversityStudying at JMUResearchTeachingInstitutionsInternationalThe UniversityNewsEventsDates and DeadlinesDegree Programmes and SubjectsVacanciesStaff MembersGlossary of Administrative TermsServicesUniversity LibraryIT ServicesUniversity SportAcademic Advisory ServiceExamination OfficeStudent AffairsStudent RepresentationCareer CentreYour JMUWueStudyWueCampusClass ScheduleOnline-EnrolmentLibrary CatalogueContactPhone and Address DirectoryHow to Find UsPressAcademic Advisory ServiceTechnical Maintenance ServiceNeed help quickly? Seitenoptionen Sitemap Bildnachweise Nach oben Letzte Änderung: 14.01.2025 Seite: 222612/931 Bildnachweise ImpressumDatenschutzBarrierefreiheit",
  "content_length": 7218,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:33"
}