{
  "name": "Leonardo Montecchi",
  "homepage": "https://www.ntnu.edu/employees/leonarmo",
  "status": "success",
  "content": "Leonardo Montecchi - NTNU Leonardo Montecchi Download press photo Download press photo Foto: Close Leonardo Montecchi Associate Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering leonardo.montecchi@ntnu.no 214 IT-bygget Gløshaugen, Trondheim ResearchGate Scopus Google Scholar YouTube Personal Page About I am Associate Professor at NTNU in Trondheim, working on topics related to dependability and software engineering. From 2017 to 2021 I was Assistant Professor at UNICAMP in Campinas, Brazil. I started working in research at the Resilient Computing Lab research group of University of Florence, Italy, where I also received my PhD. I work with different aspect related to the modeling of complex systems, including formal models, probabilistic models, and model-driven engineering. I am mostly interested in problems related to safety-critical and mission-critical domains. My research interests focuses on model-driven engineering tehcniques applied to the V&V systems, with a particular focus on automating quantitative performability analysis, and on formalizing system development artifacts using domain-specific languages. As part of my research background I have also gained some experience of industrial techniques and processes for V&V of safety-critical systems, including techniques like FMEA, FMECA, and Hazard Analysis. Competencies Fault tolerance Model driven engineering Modeling Petri nets Programming languages Reliability Software engineering Research I work with different aspect related to the modeling of complex systems, including formal models, probabilistic models, and model-driven engineering. I am mostly interested in problems related to safety-critical and mission-critical domains. My research interests focuses on model-driven engineering tehcniques applied to the V&V systems, with a particular focus on automating quantitative performability analysis, and on formalizing system development artifacts using domain-specific languages. I have been involved in research projects funded by different entities, including the EU, the São Paulo State Research Foundation, the Italian Ministry of Education and Research, and the Tuscany region. The Master's thesis I have supervised at NTNU are available here. You can find further details on my research activtities on my personal page. Publications You can get an overview of my publications on DBPL, Scopus or Google Scholar. If you are interested in the details, you find a summary and a PDF version of (almost) all my publications on my personal webpage. Feel free to contact me if you have questions or comments. You may also want to check my profile on Cristin; however the list there may not be particularly up to date or complete. 2025 Carnevali, Laura; Cerboni, Stefania; Montecchi, Leonardo; Vicario, Enrico. (2025) FaultFlow: an MDE Library for Dependability Evaluation of Component-Based Systems. IEEE Transactions on Dependable and Secure Computing Academic article 2024 Montecchi, Leonardo. (2024) Shaping a Modern Programming Paradigms Course for Advanced University Students. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Ceccarelli, Andrea; Montecchi, Leonardo. (2024) Better and safer autonomous driving with predicted object relevance. Academic chapter/article/Conference paper Rehman, Attiqa; Hjelsvold, Rune; Montecchi, Leonardo. (2024) A Case Study on Student Perspective of Peer Code Review (PCR). NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Journal publications Carnevali, Laura; Cerboni, Stefania; Montecchi, Leonardo; Vicario, Enrico. (2025) FaultFlow: an MDE Library for Dependability Evaluation of Component-Based Systems. IEEE Transactions on Dependable and Secure Computing Academic article Montecchi, Leonardo. (2024) Shaping a Modern Programming Paradigms Course for Advanced University Students. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Rehman, Attiqa; Hjelsvold, Rune; Montecchi, Leonardo. (2024) A Case Study on Student Perspective of Peer Code Review (PCR). NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Part of book/report Ceccarelli, Andrea; Montecchi, Leonardo. (2024) Better and safer autonomous driving with predicted object relevance. Academic chapter/article/Conference paper Teaching Courses TDT4250 - Model-Driven Software Engineering TDT4165 - Programming Languages I am currently responsible for the \"Programming Languages\" (TDT4165) and \"Advanced Software Design\" (TDT4250) courses. In the past I have taught courses on different topics, including \"Object-Oriented Programming\", \"Software Engineering\", \"Software Verification Validation and Testing\", and \"Model-Driven Software Engineering\". I have also held a course on \"Scientific Writing\" for Master's and PhD students. Supervision I supervise Master's students and PhD cadidates on different topics. Feel free to contact me for more information or for information about available Master's projects. You can also find a structured overview of my research topics on my personal page. The Master's thesis I have supervised at NTNU can be found on NTNU Open",
  "content_length": 5193,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:37"
}