{
  "name": "Leonardo Stella",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/stella-leonardo.aspx",
  "status": "success",
  "content": "Dr Leonardo Stella - School of Computer Science - University of Birmingham Dr Leonardo Stella School of Computer ScienceLecturer in Computer Science Contact details Emaill.stella@bham.ac.ukTwitter@_leonardostella View my research portal AddressUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Leonardo Stella is a Lecturer in Computer Science. His research interests are on the area of Game Theory, Multi-agent Systems, Machine Learning, Virtual Reality (VR), Optimisation and Control. Specifically, his research investigates approaches at the intersection of game theory and machine learning with applications to opinion dynamics, bio-inspired collective decision-making, material science, games and serious games. More recently, he has been the supervisor of a KTP project with Bloc Digital on Fast Deployment of Digital Twin Training Solutions in Industrial Applications. Find more about Leonardo’s research on his personal webpage. PhD in Automatic Control and Systems Engineering, The University of Sheffield (2019) Associate Fellow of the Higher Education Academy (2018) Laurea Magistrale (MSc) in Artificial Intelligence and Robotics, La Sapienza Università di Roma (2016) Laurea Triennale (BSc) in Computer Engineering, Università degli Studi di Palermo (2013) Since 2022, Dr Leonardo Stella is a Lecturer in Computer Science at the School of Computer Science, University of Birmingham. Between 2019 and 2021, he was a Lecturer in Computer Games Programming at the University of Derby, School of Computing and Engineering. His research interests are game theory and machine learning for decision-making and optimisation. His work has been published in highly-regarded international journals such as IEEE Transactions on Automatic Control (TACON), Automatica, IEEE Control Systems Letters (L-CSS), International Journal of Robust and Nonlinear Control (IJRNC) and SIAM Journal on Control and Optimization (SICON). Dr Stella is Guest Editor for the International Journal of Robust and Nonlinear Control (IJRNC). Furthermore, he has worked as ad-hoc reviewer for major journals and conferences including IEEE Transactions on Automatic Control, Automatica, IEEE Control Systems Letters, IEEE Conference in Decision and Control, American Control Conference. • BSc Computer Science• MSc Computer Science Game Theory, Evolutionary Game TheoryMachine Learning, Reinforcement LearningOptimisationNonlinear Systems, Stability Analysis Recent publications Article Faizan Mohamed, AM, Careri, F, Khan, RHU, Attallah, MM & Stella, L 2025, 'A novel porosity prediction framework based on reinforcement learning for process parameter optimization in additive manufacturing', Scripta Materialia, vol. 255, 116377. https://doi.org/10.1016/j.scriptamat.2024.116377 Stella, L, Bauso, D, Blanchini, F & Colaneri, P 2024, 'Cascading Failures in the Global Financial System: A Dynamical Model', Operations Research Letters, vol. 55, 107122. https://doi.org/10.1016/j.orl.2024.107122 Baar, W, Stella, L & Bauso, D 2023, 'Evolutionary dynamics on a regular networked structured and unstructured multi‐population', International Journal of Robust and Nonlinear Control. https://doi.org/10.1002/rnc.6987 Stella, L & Bauso, D 2023, 'The impact of irrational behaviors in the optional prisoner's dilemma with game-environment feedback', International Journal of Robust and Nonlinear Control, vol. 33, no. 9, pp. 5145-5158. https://doi.org/10.1002/rnc.5935 Palmer, C, Roullier, B, Aamir, M, McQuade, F, Stella, L & Anjum, A 2022, 'Digital twinning remote laboratories for online practical learning', Production & Manufacturing Research, vol. 10, no. 1, pp. 519-545. https://doi.org/10.1080/21693277.2022.2097140 Stella, L, Baar, W & Bauso, D 2022, 'Lower network degrees promote cooperation in the prisoner’s dilemma with environmental feedback', IEEE Control Systems Letters, vol. 6, pp. 2725-2730. https://doi.org/10.1109/LCSYS.2022.3175402 Stella, L, Mart, AP, Bauso, D & Colaneri, P 2022, 'The Role of Asymptomatic Infections in the COVID-19 Epidemic via Complex Networks and Stability Analysis', SIAM Journal on Control and Optimization, vol. 60, no. 2, pp. S119-S144. https://doi.org/10.1137/20M1373335 Stella, L, Bauso, D & Colaneri, P 2021, 'Mean-field game for collective decision-making in honeybees via switched systems', IEEE Transactions on Automatic Control. https://doi.org/10.1109/TAC.2021.3110166 Conference contribution Zhang, T & Stella, L 2025, Experience-replay Innovative Dynamics. in Experience-replay Innovative Dynamics. Proceedings of the 24th International Conference on Autonomous Agents and Multiagent Systems. Robbins, S, Giacobbe, M & Stella, L 2025, Feedback-evolving Mean-field Games. in 2025 IEEE 64th Conference on Decision and Control (CDC). IEEE Conference on Decision and Control, IEEE, 2025 IEEE 64th Conference on Decision and Control, Rio de Janeiro, Brazil, 10/12/25. Chu, Z, Jose, ST & Stella, L 2025, PrELIN: Provably Efficient Local-Information Networked Multi-Agent Reinforcement Learning. in 2025 IEEE 64th Conference on Decision and Control (CDC). Proceedings of the IEEE Conference on Decision & Control , IEEE, 2025 IEEE 64th Conference on Decision and Control, Rio de Janeiro, Brazil, 10/12/25. Zhang, T, Gupta, H, Suprabhat, K & Stella, L 2024, A Multi-Agent Reinforcement Learning Approach to Promote Cooperation in Evolutionary Games on Networks with Environmental Feedback. in 2023 62nd IEEE Conference on Decision and Control, CDC 2023. Proceedings of the IEEE Conference on Decision and Control, Institute of Electrical and Electronics Engineers (IEEE), pp. 2196-2201, 62nd IEEE Conference on Decision and Control, CDC 2023, Singapore, Singapore, 13/12/23. https://doi.org/10.1109/CDC49753.2023.10383787 Jadeja, Y, Shafik, M, Wood, P & Stella, L 2021, An industrial self-learning robotic platform solution for smart factories industrial applications using machine and deep imitation learning. in M Shafik & K Case (eds), Advances in Manufacturing Technology XXXIV: Proceedings of the 18th International Conference on Manufacturing Research, incorporating the 35th National Conference on Manufacturing Research, 7–10 September 2021, University of Derby, Derby, UK. Advances in Transdisciplinary Engineering, vol. 15, IOS Press, pp. 119-124, 18th International Conference on Manufacturing Research, Derby, United Kingdom, 7/09/21. https://doi.org/10.3233/ATDE210023 Skull, R, Kitchen, W, Phoenix, D, Mackenzie, C, Allison, N, Hunt, R & Stella, L 2021, Incorporating human behavior in VR compartmental simulation models. in Y Itoh, K Takashima, P Punpongsanon, M Sra, K Fujita, S Yoshida & T Piumsomboon (eds), VRST '21: Proceedings of the 27th ACM Symposium on Virtual Reality Software and Technology., 81, ACM proceedings, Association for Computing Machinery (ACM), New York. https://doi.org/10.1145/3489849.3489946 Paper Zhang, T & Stella, L 2025, 'Last-Iterate Guarantees in Noisy Games via BNN Dynamics', Paper presented at The Thirty-Ninth Annual Conference on Neural Information Processing Systems, San Diego, United States, 2/12/25 - 7/12/25. View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7256,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:39"
}