{
  "name": "Leonidas J. Guibas",
  "homepage": "https://profiles.stanford.edu/leonidas-guibas",
  "status": "success",
  "content": "Leonidas Guibas' Profile | Stanford Profiles Leonidas Guibas Paul Pigott Professor of Engineering and Professor, by courtesy, of Electrical Engineering Computer Science Print Profile Email Profile View Stanford-only Profile Tab Menu Bio Research & Scholarship Teaching Publications Bio Professor Guibas heads the Geometric Computation group in the Computer Science Department of Stanford University and is a member of the Computer Graphics and Artificial Intelligence Laboratories. He works on algorithms for sensing, modeling, reasoning, rendering, and acting on the physical world. Guibas interests span computational geometry, geometric modeling, computer graphics, computer vision, sensor networks, robotics, and discrete algorithms --- all areas in which he has published and lectured extensively. Current foci of interest include geometric modeling with point cloud data, deformations and contacts, organizing and searching libraries of 3D shapes and images, sensor networks for lightweight distributed estimation / reasoning, analysis of GPS traces and other mobility data, and modeling the shape and motion biological macromolecules and other biological structures. More theoretical work is aimed at investigating fundamental computational issues and limits in geometric computing and modeling. Academic Appointments Professor, Computer Science Professor (By courtesy), Electrical Engineering Member, Bio-X Faculty Affiliate, Institute for Human-Centered Artificial Intelligence (HAI) Member, Institute for Computational and Mathematical Engineering (ICME) Affiliate, Stanford Woods Institute for the Environment Honors & Awards Fellow, ACM (1999) Allen Newell Award, ACM (2008) Fellow, IEEE (2011) Member, National Academy of Engineering (2017) Member, National Academy of Arts and Sciences (2018) Member, National Academy of Sciences (2022) Professional Education PhD, Stanford University (1976) MS, California Institute of Technology (1971) BS, California Institute of Technology (1971) Contact Academic guibas@cs.stanford.edu University - Faculty Department: Computer Science Position: Professor Gates Bldg Computer Science Department 353 Serra Mall Stanford, California 94305-9010 (650) 723-0304 (office) Administrator Carrie Petersen Faculty Administrator carriep1@stanford.edu 650-498-0615 (office) Additional Info Mail Code: 9010 Links Curriculum Vitae PDF http://graphics.stanford.edu/~guibas Current Research and Scholarly Interests Geometric and topological data analysis and machine learning. Algorithms for the joint analysis of collections of images, 3D models, or trajectories. 3D reconstruction. 2025-26 Courses Geometric and Topological Data AnalysisCME 251 (Spr) Independent Studies (18) Advanced Reading and ResearchCS 499 (Aut, Win, Spr) Advanced Reading and ResearchCS 499P (Aut, Win, Spr) Biomedical Informatics Teaching MethodsBMDS 295 (Aut, Win, Spr) Curricular Practical TrainingCS 390A (Aut, Win, Spr) Curricular Practical TrainingCS 390B (Aut, Win, Spr) Curricular Practical TrainingCS 390C (Aut, Win, Spr) Directed Reading and ResearchBMDS 299 (Aut, Win, Spr) Independent ProjectCS 399 (Aut, Win, Spr) Independent ProjectCS 399P (Aut, Win, Spr) Independent WorkCS 199 (Aut, Win, Spr) Independent WorkCS 199P (Aut, Win, Spr) Medical Scholars ResearchBMDS 370 (Aut, Win, Spr) Part-time Curricular Practical TrainingCS 390D (Aut, Win, Spr) Ph.D. ResearchCME 400 (Aut, Win, Spr) Programming Service ProjectCS 192 (Aut, Win, Spr) Senior ProjectCS 191 (Aut, Win, Spr) Supervised Undergraduate ResearchCS 195 (Aut, Win, Spr) Writing Intensive Senior Research ProjectCS 191W (Aut, Win, Spr) Prior Year Courses 2024-25 Courses Geometric and Topological Data AnalysisCME 251, CS 233 (Spr) Topics in Geometric Computing - 3D and 4D Foundation ModelsCS 468 (Aut) 2023-24 Courses Geometric and Topological Data AnalysisCME 251, CS 233 (Win) 2022-23 Courses Neural Models for 3D GeometryCS 348N (Spr) Stanford Advisees Postdoctoral Faculty Sponsor Francis Engelmann, Yang You Doctoral Dissertation Co-Advisor (AC) Shengqu Cai, Boyang Deng, Lei Shu Master's Program Advisor Jimmy Chen, Maddie Fox, Karthik Jetty, Shumann Xu, Zhenyu Zhang Doctoral (Program) Hansheng Chen, Jihyeon Je, Yijia Weng, Yang Zheng Graduate and Fellowship Programs Biomedical Data Science (Phd Program) All Publications From Planes to Corners: Multi-Purpose Primitive Detection in Unorganized 3D Point Clouds RA-Letters Sommer, C., Sun, Y., Guibas, L. J., Cremers, D., Birdal, T. 2020; 5: 8 View details for DOI 10.1109/LRA.2020.2969936 Synchronizing Probability Measures on Rotations via Optimal Transport IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) Birdal, T., Arbel, M., Simsekli, U., Guibas, L. 2020: 1566–76 View details for DOI 10.1109/CVPR42600.2020.00164 Learning Multiview 3D Point Cloud Registration IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) Gojcic, Z., Zhou, C., Wegner, J. D., Guibas, L. J., Birdal, T. 2020: 1756–66 View details for DOI 10.1109/CVPR42600.2020.00183 Dirichlet Energy for Analysis and Synthesis of Soft Maps COMPUTER GRAPHICS FORUM Solomon, J., Guibas, L., Butscher, A. 2013; 32 (5): 197-206 View details for DOI 10.1111/cgf.12186 View details for Web of Science ID 000323204000020 Consistent Shape Maps via Semidefinite Programming COMPUTER GRAPHICS FORUM Huang, Q., Guibas, L. 2013; 32 (5): 177-186 View details for DOI 10.1111/cgf.12184 View details for Web of Science ID 000323204000018 Shape Matching via Quotient Spaces COMPUTER GRAPHICS FORUM Ovsjanikov, M., Merigot, Q., Patraucean, V., Guibas, L. 2013; 32 (5): 1-11 View details for DOI 10.1111/cgf.12167 View details for Web of Science ID 000323204000001 Map-Based Exploration of Intrinsic Shape Differences and Variability ACM TRANSACTIONS ON GRAPHICS Rustamov, R. M., Ovsjanikov, M., Azencot, O., Ben-Chen, M., Chazal, F., Guibas, L. 2013; 32 (4) View details for DOI 10.1145/2461912.2461959 View details for Web of Science ID 000321840100041 Building Markov state models with solvent dynamics 11th Asia Pacific Bioinformatics Conference (APBC) Gu, C., Chang, H., Maibaum, L., Pande, V. S., Carlsson, G. E., Guibas, L. J. BIOMED CENTRAL LTD. 2013 Abstract Markov state models have been widely used to study conformational changes of biological macromolecules. These models are built from short timescale simulations and then propagated to extract long timescale dynamics. However, the solvent information in molecular simulations are often ignored in current methods, because of the large number of solvent molecules in a system and the indistinguishability of solvent molecules upon their exchange.We present a solvent signature that compactly summarizes the solvent distribution in the high-dimensional data, and then define a distance metric between different configurations using this signature. We next incorporate the solvent information into the construction of Markov state models and present a fast geometric clustering algorithm which combines both the solute-based and solvent-based distances.We have tested our method on several different molecular dynamical systems, including alanine dipeptide, carbon nanotube, and benzene rings. With the new solvent-based signatures, we are able to identify different solvent distributions near the solute. Furthermore, when the solute has a concave shape, we can also capture the water number inside the solute structure. Finally we have compared the performances of different Markov state models. The experiment results show that our approach improves the existing methods both in the computational running time and the metastability.In this paper we have initiated an study to build Markov state models for molecular dynamical systems with solvent degrees of freedom. The methods we described should also be broadly applicable to a wide range of biomolecular simulation analyses. View details for PubMedID 23368418 Graph Matching with Anchor Nodes: A Learning Approach CVPR2013 Hu, N., Rustamov, Raif, M., Guibas, L. 2013 Locating Lucrative Passengers for Taxicab Drivers. Tang, H., Kerber, M., Huang, Q., Guibas, L. 2013 Large-Scale Joint Map Matching of GPS Traces Li, Y., Huang, Q., Kerber, M., Zhang, L., Guibas, L. 2013 Image Co-Segmentation via Consistent Functional Maps. Wang, F., Huang, Q., Guibas, L. 2013 Wavelets on Graphs via Deep Learning NIPS Rustamov, Raif, M., Guibas, L. 2013 Pathlet Learning for Compressing and Planning Trajectories. Chen, C., Su, H., Huang, Q., Zhang, L., Guibas, L. 2013 Guided Real-Time Scanning of Indoor Environments, Computer Graphics Forum Kim, Y., Mitra, N., Huang, Q., Guibas, Leonidas, J. 2013 Guided Real-Time Scanning of Indoor Environments Computer Graphics Forum, Pacific Graphics Kim, Y., Mitra, N., Huang, Q., Guibas, Leonidas, J. 2013 Acquiring 3D Indoor Environments with Variability and Repetition ACM TRANSACTIONS ON GRAPHICS Kim, Y. M., Mitra, N. J., Yan, D., Guibas, L. 2012; 31 (6) View details for DOI 10.1145/2366145.2366157 View details for Web of Science ID 000311298900012 Microtiles: Extracting Building Blocks from Correspondences COMPUTER GRAPHICS FORUM Kalojanov, J., Bokeloh, M., Wand, M., Guibas, L., Seidel, H., Slusallek, P. 2012; 31 (5): 1597-1606 View details for DOI 10.1111/j.1467-8659.2012.03165.x View details for Web of Science ID 000307307500004 Functional Maps: A Flexible Representation of Maps Between Shapes ACM TRANSACTIONS ON GRAPHICS Ovsjanikov, M., Ben-Chen, M., Solomon, J., Butscher, A., Guibas, L. 2012; 31 (4) View details for DOI 10.1145/2185520.2185526 View details for Web of Science ID 000308250300006 Detecting Network Cliques with Radon Basis Pursuit. Jiang, X., Yao, Y., Liu, H., Guibas, L. 2012 Supervised Earth Mover's Distance Learning and its Computer Vision Applications Wang, F., Guibas, L. 2012 Joint Shape Segmentation with Linear Programming ACM TRANSACTIONS ON GRAPHICS Huang, Q., Koltun, V., Guibas, L. 2011; 30 (6) View details for DOI 10.1145/2024156.2024159 View details for Web of Science ID ",
  "content_length": 48461,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:46"
}