{
  "name": "Leonid Sigal",
  "homepage": "https://www.cs.ubc.ca/~lsigal",
  "status": "success",
  "content": "Leonid Sigal's Personal Web Page Leonid Sigal Professor, University of British Columbia Menu Home | About | Biography | CV Students and Collaborators | Research | Teaching | Publications | Code and Data | Contact Dep. of Computer Science University of British Columbia ICCS 119 2366 Main Mall Vancouver, B.C. V6T 1Z4 CANADA Phone: 1-604-822-4368 Email: lsigal at cs.ubc.ca Links News and recent activity Press coverage Recently accepted papers Selected publications Organized workshops Organized tutorials About Me ... I am a Professor in the Department of Computer Science at the University of British Columbia. I am also an NSERC Canada Research Chair (CRC II) in Computer Vision and Machine Learning and a CIFAR AI Chair at the Vector Institute for AI in Toronto. In addition, I serve as an Academic Advisor to RBC/Borealis AI. Prior to this I was a Senior Research Scientist at Disney Research Pittsburgh and an Adjunct Faculty member at Carnegie Mellon University. My research focuses on problems of visual understanding and reasoning. This includes object recognition, scene understanding, articulated motion capture, motion modeling, action recognition, motion perception, manifold learning, transfer learning, character and cloth animation and a number of other directions on the intersection of computer vision, machine learning, and computer graphics. My full bio and CV can be found here. News and recent activity I am a recipient of Killam Accelerator Fellowship. I am a recipient of NSERC Canada Research Chair (CRC II) in Computer Vision and Machine Learning and the NSERC DAS award. I am a recipient of CIFAR AI Chair. Press coverage Our work on semantic video event representation in CVPR 2016. Our work on modeling action progression using LSTMs in CVPR 2016. Our work on zero-shot pose estimation in AAAI 2016. Our work on graph-based activity recognition in CVPR 2015. Our work on story-driven photo album curation in WACV 2015. Our work on body mounted camera motion capture in ACM SIGGRAPH 2011. Some semi-recent research highlights: (for full least see publications) CVPR'25 Black Swan: Abductive and Defeasible Video Reasoning in Unexpected Events, A. Chinchure, S. Ravi, R. Ng, V. Shwartz, B. Li and L. Sigal, IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. Project Page Paper Code NeurIPS'25 Extending video masked autoencoders to 128 frames, N. B. Gundavarapu, L. Friedman, R. Goyal, C. Hegde, E. Agustsson, S. Waghmare, M. Sirotenko, M.-H. Yang, T. Weyand, B. Gong and L. Sigal, Neural Information Processing Systems (NeurIPS), 2025. Project Page Paper ECCV'24 TIBET: Identifying and Evaluating Biases in Text-to-Image Generative Models, A. Chinchure, P. Shukla, G. Bhatt, K. Salij, K. Hosanagar, L. Sigal and M. Turk, European Conference on Computer Vision (ECCV), 2024. Project Page Paper Code ECCV'24 Preventing Catastrophic Forgetting through Memory Networks in Continuous Detection, G. Bhatt, J. Ross and L. Sigal, European Conference on Computer Vision (ECCV), 2024. Paper CVPR'24 Prompting Hard or Hardly Prompting: Prompt Inversion for Text-to-Image Diffusion Models, S. Mahajan, T. Rahman, K.M. Yi and L. Sigal, IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024. Paper Code CVPR'24 Plug-and-Play, Dense-Label-Free Extraction of Open-Vocabulary Semantic Segmentation from Vision-Language Models, L. Jiayun, S. Khandelwal, L. Sigal and B. Li, IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024. Paper CVPR'24 Visual Prompting for Generalized Few-shot Segmentation: A Multi-scale Approach, M.R.I. Hossain, M. Siam, L. Sigal and J. Little, IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024. Paper Code CVPR'23 Make-A-Story: Visual Memory Conditioned Consistent Story Generation, T. Rahman, H.-Y. Lee, J. Ren, S. Tulyakov, S. Mahajan and L. Sigal, IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2023. © 2017 Leonid Sigal | Design by Andreas Viklund",
  "content_length": 4009,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:41"
}