{
  "name": "Leonid K. Reznik",
  "homepage": "https://www.cs.rit.edu/~lr",
  "status": "success",
  "content": "LEON Reznik Home Page Welcome to Leon Reznik's Homepage I am a Professor at the Department of Computer Science at the Rochester Institute of Technology, Rochester, NY. You can find me in Room 3-521, Golisano Hall (Building 70),  or you can contact me by means given here Please, see my schedule this semester. Previously I worked at the Department of Computer Science, University of Texas at El Paso and School of Communications and Informatics at Victoria University, Melbourne, Australia. Please, see my CV for more information and the publication list. Wiley and IEEE Press released my new textbook: Leon Reznik Intelligent security systems: How artificial intelligence, machine learning and data science work for and against computer security. IEEE Press-Wiley&Sons, ISBN-13: 978-1119771531, ISBN-10: 1119771536, 2022 Please, see more information here. On this site, you can find my slides and lecture recordings for each chapter, also. Please, contact the publisher if you want to buy the book or order the evaluation copy for your class. You might like to look at the publisher book description or the flyer . We are excited to start our new (2023-2026) research project funded by NSF Collaborative research: IDEAS lab: ETAUS: Smarter Microbial Observatories for Realtime ExperimentS (SMORES) This big ($1.5M) project will be performed in collaboration between Harvard University, Rochester Institute of Technology, Florida International University and University of Georgia. It involves studies and practical work in biology, AI and engineering as well as field underwater experiments in Florida and California. The project will study marine sediments, which play a critical role in natural carbon sequestration. We propose to develop a novel seafloor sensor/sampler array to better understand how tidal pumping and subsurface currents influence seafloor oxygenation and sedimentary carbon cycling. Our team will be responsible for developing smarter control systems that use machine-learning models and techniques to understand how to make intelligent predictions about when and where to best sense/sample based on the historical and real-time data. We plan to participate in the field work too. Also, we are starting another new (2024-2026) collaborative international project IMPRESS-U: Exploratory Research in Robust Machine Learning for Object Detection and Classification (NSF award # 2415299) with the goal to design and implement a novel content-aware concept in data processing of multispectral images and object recognition by low-dimension CNNs, low-rank regularization, and information-dense eigenvector factorization on compact operator spaces. Do you want to know more about what we are doing? Thank you for your interest. Research: Please, see my key presentations about my two major current (and probably, future) areas of research. Direction 1: Security and data quality evaluation, Big Data phenomenon: see my key address From Big Data to Quality Data: What is the emerging sensor and network technology going to deliver next? to NetWare 2014 , an umbrella event incorporating a few international conferences on November 20, 2014 in Lisbon, Portugal. Also, at the same conference I chaired the panel on November 19 on the topic Information Privacy: Does it really matter? Direction 2: Intelligent systems and sensor networks design, machine learning and neural networks techniques and their implementation, Big Data analysis: see a joint presentation with my former student Dmitri Yudanov Heterogeneous Implementation of Neural Network Algorithms to the AMD Developer Summit, San Jose, November 11-13, 2013 NEW Direction 3: that advances and integrates previous two to enhance learning AND security and privacy protection with the following directions: Advanced and Secure Federated Learning, Knowledge and Metacognition Integrated into Networked Learning Systems. Here we investigate novel techniques integrating metacognitive features for distributed learning optimization, privacy protection and security enhancement: please, see my invited talk at the Workshop on Metacognitive Prediction of AI Behavior, November 13-15, 2023 at Arizona State University, Scottsdale, AZ titled mLINK: Machine Learning Integration with Network and Knowledge or An Attempt to Look at Metacognitive Prediction From a User Practice and to Offer Some Possible Solutions from our own experience and my latest publications. I recommend our paper: Data Quality & Security Evaluation Framework Development with Leon Reznik & Igor Khokhlov on the YouTube channel. You can download the corresponding slides . Please, see our publications and mobile applications for more information about our Data Quality and Security Evaluation framework and its implementations on mobile devices. Our new paper Sergei Chuprov, Raman Zatsarenko, Leon Reznik, and Igor Khokhlov (2024) Data Quality Based Intelligent Instrument Selection with Security Integration. ACM Journal of Data and Information Quality, vol. 16, iss. 3, Article 15 (September 2024), 24 pages. https://doi.org/10.1145/3695770 was just published and designated as a research paper by ACM with an open access and free download. Want to learn even more?? Please, look at my current research activities, my latest publications and other information . If you are interested in collaboration, please, contact me . Research administration: I am an Associate Editor of the ACM Journal of Data and Information Quality . If you want to discuss your possible publication in the area of data quality and security evaluation, please, contact me . Current Research Grants: 2023-26: PI: Collaborative research: IDEAS lab: ETAUS: Smarter Microbial Observatories for Realtime ExperimentS (SMORES) (NSF award # 2321652) 2024-26: Co-PI: IMPRESS-U: Exploratory Research in Robust Machine Learning for Object Detection and Classification (NSF award # 2415299) Recent Research Grants (as a PI): PI: 2020-22: Self-learning capabilities for a mission oriented data quality and security assurance in military IoT systems (US Military Academy/DoD award # W911NF2010337) PI: 2021-22: Security evaluation and improvement of the personal infrastructure with new tools and education development (CRDF Global/DoS award # G-202102-67515) PI: 2016-21: CICI: Data Provenance: Data quality and security evaluation framework for mobile devices platform (NSF award # ACI-1547301) Products:    Android applications: Igor Khokhlov, Leon Reznik System Security Evaluation - available at Google Play, ver. 1.5, February 16, 2021 Sahil Ajimera, Igor Khokhlov, Leon Reznik Sensor Quality Assessment - available at Google Play, ver. 1.1, January 20, 2020 Igor Khokhlov, Leon Reznik Smartphone Data Collection Tool- available at Google Play, ver. 1.11, December 7, 2018 Igor Khokhlov, Leon Reznik System Security Evaluation: Cloud version - available at Google Play, ver. 1, November 1, 2018 Igor Khokhlov, Milan Bhaskar, Leon Reznik Detector of Unverified Apps - available at Google Play , updated March 12, 2018 Milan Bhaskar, Igor Khokhlov, Leon Reznik Unverified App Finder - available at Google Play, updated March 2, 2018 Data Collections: Sensors incorporated in mobile devices, their characteristics and quality evaluation , 2018 - 21 Personal smartphones security evaluation , 2018-20 My publications: see the list Teaching: My  teaching areas include undergraduate and graduate courses in computer security, artificial intelligence and machine learning, programming and computer science, project design, student's project supervision (PhD, graduate, and undergraduate). Main directions for possible student projects are presented here (note, this presentation introduces directions only; I am happy to discuss with you how they could be adjusted to your interests if you might be interested in my supervision) Current Courses: CSCI-331 Introduction to Intelligent Systems - Undergraduate course for CS students CSCI-531 Introduction to Security Measurement - Undergraduate course for CS and CSec students CSCI-532 Introduction to Intelligent Security Systems - Undergraduate course for CS and CSec students CSCI-630 Foundations of Intelligent Systems - Graduate course for CS students CSCI-734 Foundations of Security Measurement and Evaluation - Graduate course for CS and CSec students CSCI-735 Foundations of Intelligent Security Systems - Graduate course for CS and CSec students CSCI-736 Neural Networks and Machine Learning - Graduate course for CS students CSCI-788 MS Capstone Project - Graduate course for CS students Courses taught previously: Data Communications and Networks I - Undergraduate/graduate course for CS students Artificial Intelligence - Undergraduate/graduate course for CS students Security Measurement and Testing - Undergraduate/graduate course for CS students Intelligent Security Systems (course information is available on mycourses) - Undergraduate/graduate course for CS students Computer Science 2 - Introductory course for CS/SE/CE students Theory of Computer Algorithms - Graduate course for CS students Neural Networks and Machine Learning - Graduate course for CS students Research Seminar II - PhD course Research Seminar III - PhD course Courses taught before at other schools: Artificial Intelligence I - Graduate Course for CS students at UTEP in 2002 Rapid Application Development - Graduate Course in Software Engineering for IT students at UTEP in 2002 Fuzzy Control and Applications - Undergraduate/Honours Course for EE/CE/CS students at VU in 1996-2001 Copyright ï¿½ 1997, 2005, 2008, 2012, 2015, 2018, 2022, 2023 Leon Reznik",
  "content_length": 9595,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:40"
}