{
  "name": "Leonardo Aniello",
  "homepage": "https://www.ecs.soton.ac.uk/people/la1e17",
  "status": "success",
  "content": "Doctor Leonardo Aniello | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Dr Leonardo Aniello Associate Professor Research interests Blockchain-based Systems Distributed Systems Machine Learning applied to Cyber Security More research Connect with Leonardo Email: L.Aniello@soton.ac.uk Tel: +44 23 8059 3271 ORCID On this page About Research Publications About Research Publications About Dr Leonardo Aniello is an Associate Professor in Cyber Security in the School of Electronics and Computer Science (ECS) at the University of Southampton. He is also Member of the GCHQ/EPSRC Academic Centre of Excellence for Cyber Security Research (ACE-CSR) SouthamptonAI & Security champion of the GCHQ/EPSRC Academic Centre of Excellence for Cyber Security Education (ACE-CSE) SouthamptonMember of the management group of the ECS Centre for Internet of Things and Pervasive Systems (C-IoT)Senior Admissions Tutor for PGR students in ECS, and manages the ECS Undergraduate Research Scholarship scheme Dr Aniello obtained a Ph.D. in Engineering in Computer Science in 2014 from \"La Sapienza\" University of Rome, with a thesis about techniques for efficient processing Big Data in large-scale collaborative environments. He has been a visiting researcher at IBM Research Lab in Haifa (Feb to Apr 2012), Department of Computer Science at Royal Hollow University of London (May 2013) and University of Southampton (Sep to Dec 2017). He started a lectureship at University of Southampton in 2018 and was promoted to Associate Professor in 2022. His research is currently focused on distributed systems and cyber security, including adaptive resource allocation strategies, blockchain-based systems and application of machine learning techniques to cyber security. He is author of more than 30 papers (h-index 16, 1759 citations, source Google Scholar), published on international conferences, journals, and books. Research Research groups Member of: Cyber Security Centre for Democratic Futures Cyber Security Academy Research interests Blockchain-based Systems Distributed Systems Machine Learning applied to Cyber Security Current research Dr Aniello started working on portscan detection and collaborative distributed computations aimed at early detection of cyber threats (106 citations in total), then focused on the distributed system aspect of computations by investigating novel techniques to enhance performance in stream and batch processing (310 citations) and to integrate elastic proactive scalability in distributed systems (47 citations). He later moved to researching on machine learning for malware analysis (158 citations) and on blockchain-based systems (351 citations). Dr Aniello investigated the integration of blockchain technology to improve IoT security within the context of peer-to-peer energy trading. This research was carried out as part of the EPSRC project Blockchain-empowered Infrastructure for IoT (BlockIT, £195K), where he worked as Co-I. He also investigated the opportunities and challenges of using blockchain to establish and manage federations of Cloud services and resources, as part of the H2020 EU project SecUre iNFormatIon SHaring in federated heterogeneous private clouds (SUNFISH, €4.5M). Dr Aniello was also involved as Co-I in the Cyber Predictive Intelligence for Asset-based Analytics (CyPrIAAn, £96K) project funded by the UK Defence and Security Accelerator (DASA) as part of Phase 1 of the Predictive Cyber Analytics competition. Furthermore, he is currently acting as PI for UoS in the Operational CyberspaCe Attack Modelling – Real-Time (OCCAM-RT, £180K) project, in partnership with Bristol-based company Riskaware. OCCAM-RT is funded as part of Phase 2 of the same competition. Within the OCCAM-RT project, Dr Aniello is overseeing two PDRAs. He is also supervising 9 PGR students (3 as primary supervisor and 6 as secondary). Furthermore, Dr Aniello oversaw two undergraduate students for their summer internship: one in 2018, funded by ECS and focused on generating a dataset for cyber-attacks against IoT networks; the other in 2020, funded by the National Cyber Security Centre (NCSC), around the topic of IoT fingerprinting using machine learning techniques. Research projects Completed projects Holistic Design of Secure Systems on Capability Hardware Researchers: Professor Michael Butler Doctor Leonardo Aniello , Professor vladi Sassone , Doctor Son Hoang Sponsor: EPSRC Publications A flying ad-hoc network dataset for early time series classification of grey hole attacks Charles Hutchins, Leonardo Aniello, Enrico Gerding & Basel Halak, 2025, Scientific Data, 12(1) DOI: 10.1038/s41597-025-05560-1 Type: review Developing safe exception recovery mechanisms for CHERI capability hardware using UML-B formal analysis Colin Snook, Asieh Salehi Fathabadi, Son Hoang, Robert H Thorburn, Michael Butler, Leonardo Aniello & vladi Sassone, 2025 Type: conference Decentralised DNS resolution based on distributed ledger technology George Giamouridis, Boojoong Kang & Leonardo Aniello, 2025 Type: conference Global supply chains security: a comparative analysis of emerging threats and traceability solutions Betul Gokkaya, Erisa Karafili, Leonardo Aniello & Basel Halak, 2025, Benchmarking: An International Journal, 32(3), 917-942 DOI: 10.1108/BIJ-08-2023-0535 Type: article Multi-transaction and carbon-aware strategies for profit-oriented FDIAs on electricity trading systems Xiaomeng Feng, Leonardo Aniello & Shiyan Hu, 2024 DOI: 10.1109/PESGM51994.2024.10688834 Type: conference ScaNeF-IoT: scalable network fingerprinting for IoT device Tadani Nasser Alyahya, Leonardo Aniello & Vladimiro Sassone, 2024 DOI: 10.1145/3664476.3670892 Type: conference Designing exception handling using Event-B Asieh Salehi Fathabadi, Colin Snook, Thai Son Hoang, Robert Thorburn, Michael Butler, Leonardo Aniello & Vladimiro Sassone, 2024 DOI: 10.1007/978-3-031-63790-2_22 Type: conference Blockchain-based DNS: Current Solutions and Challenges to Adoption George Giamouridis, Boojoong Kang & Leonardo Aniello, 2024 Type: conference Security and dependability analysis of blockchain systems in partially synchronous networks with Byzantine faults Stefano De Angelis, Federico Lombardi, Gilberto Zanfino, Leonardo Aniello & Vladimiro Sassone, 2023, International Journal of Parallel, Emergent and Distributed Systems DOI: 10.1080/17445760.2023.2272777 Type: article A methodology for cybersecurity risk assessment in supply chains Betul Gokkaya, Leonardo Aniello, Erisa Karafili & Basel Halak, 2023 Type: conference Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Pre-sessional English courses Course modules Assessment Subjects Acoustical engineering Aeronautical and astronautical engineering Ageing and gerontology Archaeology Art, design and fashion Audiology Biological sciences Biomedical and medical engineering Business, accounting, finance and marketing Chemistry Civil engineering Computer science and software engineering Economics Education Electrical and electronic engineering English",
  "content_length": 30327,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:36"
}