{
  "name": "Leszek T. Lilien",
  "homepage": "https://cs.wmich.edu/llilien",
  "status": "success",
  "content": "Leszek Lilien Leszek T. Lilien, Ph.D. Associate Professor Emeritus llilien@wmich.edu https://cs.wmich.edu/llilien Department of Computer Science College of Engineering and Applied Sciences Western Michigan University 1903 West Michigan Avenue Kalamazoo, MI 49008-5466 Main Office: 269-276-3101 [_Top_]         [_Research_]  [_Publications_]  [_Presentations _]  [_Teaching_]  [_Professional Activities_] Note: This page shows highlights of Dr. Lilien’s activities and is not a complete record of his work. Summary Last update of this section: 12 August 2024 Associate Professor Emeritus of Computer Science at Western Michigan University (WMU), retired on August 31, 2020. Adjunct Associate Professor of Computer Science at Purdue University in 2015 and 2013. Visiting Faculty in the Department of Computer Science at Purdue University (sabbatical: Fall 2012-Spring 2013), and in the Air Force Research Laboratory's Information Institute (Summer 2008). Ph.D. and M.S. in Computer Science, University of Pittsburgh. M.S. in Electronics/Computer Engineering, Wrocław University of Technology (Politechnika Wrocławska), Wrocław, Poland. Research at Western Michigan University (WMU)—as a faculty; Purdue University—as a post doctoral researcher, a sabbatical visitor and an adjunct faculty; and University of Illinois at Chicago (UIC)—as a faculty. Teaching at WMU and UIC.  Tutorial instructor for IEEE Computer Society. Diversified R&D experience at AT&T/Lucent Bell Labs. Consultant for academic and business projects. Entrepreneurial experience in the United States and Poland. Current research focused in two Areas: (1) opportunistic capability utilization networks or oppnets (a specialized kind of ad hoc networks); and (2) trust, privacy and security in open computing systems.  In Area 1, focus on primitives for oppnets; privacy and security in oppnets; and interoperability of oppnet helper networks and devices. In Area 2, concentration on privacy-preserving data dissemination (with focus on developing active data bundles a.k.a. active bundles —self-protecting software entities); the role of trust in open computing environments; analysis and development of computer privacy and security paradigms; authentication and privacy in healthcare; privacy and security in pervasive systems, including ad hoc sensor networks and embedded networks. Former areas of investigation include: (a) vulnerability analysis, threat assessment, and modeling computer fraud; (b) distributed computing systems with concentration on decentralized control; (c) distributed database systems with focus on reliability, fault tolerance, recovery, concurrency control, query optimization, and database design; and (d) semantic database integrity. Published over 20 peer-reviewed journal papers, about 60 peer-reviewed conference papers, and 10 book chapters (at least 8 peer-reviewed). Nearly 2,000 citations (h-index: 21, i10-index: 45 as of August 2024) listed by Google Scholar. Keynote and invited speaker for national and international conferences. Editorial Board member for six journals. Technical Program Committee Co-Chair for the 15th IFIPS Wireless On-demand Network Systems and Services Conference (WONS 2019) and the 31st IEEE International Symposium on Reliable Distributed Systems (SRDS 2012). Organizer and Chair of the International Workshops on Specialized Ad Hoc Networks and Systems (SAHNS 2011, SAHNS 2009 and SAHNS 2007) in conjunction with IEEE International Conference on Distributed Computing Systems (ICDCS 2011, ICDCS 2009 and ICDCS 2007). Major advisor for 5 completed Ph.D. dissertations at WMU. Member of 6 Ph.D. dissertation committees at WMU, and 3 Ph.D. dissertation committees at Purdue University. Major advisor for 3 M.S. Theses and nearly 70 M.S. Projects at WMU, as well as 4 M.S. Theses and 16 M.S. Projects at University of Illinois at Chicago. Co-PI for a Navy grant on oppnets, and an NSF grant on vulnerability analysis and threat assessment/avoidance. Consultant for Northrop Grumman Corporation (NGC) grants at Department of Computer Science at Purdue University. Collaborator of the Center for Science of Information (CSoI) at Purdue University, an NSF Science and Technology Center. Affiliated for many years with the Center for Education and Research in Information Assurance and Security (CERIAS) at Purdue University. Senior Member of the Institute of Electrical and Electronics Engineers (IEEE) and IEEE Computer Society. IEEE Golden Core Member, and recipient of the IEEE Computer Society’s Meritorious Service Award. [_Top_]         [_Research_]  [_Publications_]  [_Presentations _]  [_Teaching_]  [_Professional Activities_] Research Projects Last update of this section: 12 August 2024 Major Projects Opportunistic resource utilization networks and systems (a.k.a. Oppnets) Projects—mostly focusing on trust, privacy and security—include: Helper privacy and oppnet privacy Classic and identity-based authentication in oppnets, including authentication of helper candidates in oppnet environments, and authentication of oppnet nodes in oppnet environments Security in oppnets, including malevolent hosts masquerading as oppnet member, and malevolent helpers masquerading as helpers or oppnet members Software agents' role for security and privacy in oppnets Routing in oppnets Privacy-preserving data dissemination, including the original idea of Active Data Bundles a.k.a. Active Bundles Analysis of computer security paradigms and development of new ones Security services and privacy services Pervasive trust foundation for privacy and security services Hosting Visiting Scholars Dr. Tong Wang, Associate Professor, Network Engineering Department, School of Information Engineering, Hubei University of Economics, Wuhan, China Research on survivability enhancements of wireless network infrastructure for Oppnets. Funded by Chinese Scholarship Council, April 2017 – April 2018. Dr. Shubo Liu, Professor, Wuhan University, Wuhan, China Research on privacy and security in embedded systems and computer networks, including wireless sensor networks and Internet of Thing. Funded by Wuhan University, January 2014 – January 2015. Dr. Daisuke Kasamatsu, Assistant Professor, Soka University, Tokyo, Japan Research on oppnet use for emergency response applications. Funded by Japanese Telecommunication Advancement Foundation, March 2012 – July 2013 (visiting me at WMU, then visiting Purdue University with me during my sabbatical). Ph.D. Advisor / Ph.D. Committee Chair Ahmed A.A. Al-Gburi, “Towards an Architecture for Secure Privacy-Preserving Opportunistic Resource Utilization Networks.” Ph.D. Proposal defended in November 2017. Ph.D. degree awarded on 27 April 2019. Raed M. Salih, “Using Agent-based Active Bundle Scheme for Protecting Privacy and Confidentiality in Healthcare Information Systems.” Ph.D. Proposal defended on 11 July 2014. Ph.D. degree awarded on 28 April 2018. Mai A. Alduailij, “Design of Oppnet Virtual Machine for Opportunistic Resource Utilization Networks: A Universal Standard for Application-level Resource Sharing.” Ph.D. Proposal defended on 25 April 2014. Ph.D. degree awarded on 19 December 2015. Bilal Abu Bakr, “A Decentralized Energy-Efficient Scheme to Maximize Wireless Sensor Network Lifetime.” Ph.D. Proposal defended on 22 April  2010. Ph.D. degree awarded on 25 June 2011. Lotfi Ben-Othmane, “Protecting Sensitive Data throughout Their Lifecycle.” Ph.D. Proposal defended on 26 January 2009. Ph.D. degree awarded on 18 December 2010. Ph.D. Committee Member (at WMU and Purdue University, selected) WMU: Mohammed Aledhari, “A Deep Learning-Based Data Minimization Algorithm for Big Genomics Data in Support of IoT and Secure Smart Health Services.” Ph.D. Proposal defended on 29 June 2016. Ph.D. degree awarded on 16 December 2017. Chair: Prof. Fahad Saeed. Purdue University: Noor Ahmed, “Design, Implementation, and Experiments for Moving Target Defense.” Ph.D. Proposal defended on 29 June 2013. Ph.D. Dissertation defended on 18 April 2016. Chair: Prof. Bharat Bhargava. Purdue University: Rohit Ranchal, “Cross-Domain Data Dissemination and Policy Enforcement.” Ph.D. Dissertation defended on 5 June 2015. Chair: Prof. Bharat Bhargava. Purdue University: Ruchith U. Fernando, “Privacy in Social Messaging and Identity Management.” Ph.D. Dissertation defended on 3 July 2014. Chair: Prof. Bharat Bhargava. WMU: Jing Zhang, “Efficient Reinforcement Learning in Multiple-agent Systems and its Applica-tion in Cognitive Radio Networks,” Ph.D. Thesis defended on 10 February 2012; Ph.D. Committee Chair: Prof. D. Kountanis. WMU: Mohamed El Wakil, “Debugging Support for Message-Passing Software via SMT-Based Predictive Analysis,“ Ph.D. Thesis defended on 9 May 2011; Ph.D. Committee Chair: Prof. Z. Yang. WMU: Chaoli Cai, “Anomaly Detection Techniques for Ad Hoc Networks,” Ph.D. Thesis defended on 13 November 2009; Ph.D. Committee Chair: Prof. A. Gupta. WMU: Zille Huma Kamal, “On Implementing a Small Scale Opportunistic Network and Utilizing Its Resources with QoS Constraints,” Ph.D. Thesis defended on 9 November 2007; Ph.D. Committee Chair: Prof. A. Gupta. WMU: Vijay Bhuse, “Lightweight intrusion detection: A second line of defense for unguarded wireless sensor networks,” Ph.D. Thesis defended on 29 January 2007; Ph.D. Committee Chair: Prof. A. Gupta. M.S. Thesis Advisor (at WMU) Bhuvaneswari Rayapuri, “A Survey of Security and Privacy in Mobile Cloud Computing,” M.S. degree awarded on 15 December 2018. Ramakrishnan Krishnan, “Security and Privacy in Cloud Computing,” M.S. degree awarded on 29 April 2017. Wassnaa Al-Mawee, “Privacy and Security Issues in IoT Healthcare Applications for the Disabled Users. A Survey,” M.S. degree awarded on 19 December 2015. M.S. Project Advisor at WMU (selected) R. Alrizq, “Assessing and Evaluating the Wireless Networks on WMU Campus,” CS 5990 Independent Study, Spring 2016. P. Hassan Paramashivaiah, “New Lab Assignments for the CS 5700 Security Lab,” CS 7100",
  "content_length": 72653,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:49"
}