{
  "name": "Letha H. Etzkorn",
  "homepage": "http://www.cs.uah.edu/~letzkorn",
  "status": "success",
  "content": "index Letha Hughes Etzkorn Professor Computer Science Department University of Alabama in Huntsville List of Courses Previously and Currently Taught at UAH: Graduate Courses: CS799¾Doctoral Dissertation CS796¾Intelligent and Mobile Agents CS795¾Selected Topics in Computer Science CS699¾Masters Thesis CS695¾Selected Topics in Computer Science CS685Computer Security CS670¾Computer Networks CS668Software Studio II CS666Software Studio I CS652Object-oriented Design CS650¾The Software Engineering Process CS585Intro to Computer Security CS596Intro to Cloud Computing CS586¾Microprocessor Architecture CS570¾Intro. To Computer Networks CS554--Intro. to Cloud Computing CS553¾Client/Server Computing CS552Analysis and Design Patterns CS552¾Object-Oriented Design CS513¾Computer Architecture Undergraduate Courses: CS499¾Senior Project: Team Software Development CS495¾Selected Topics in Computer Science CS495 ¾Metrics Analysis Course CS495Secure Software CS485Intro to Computer Security CS454Introduction to Cloud Computing CS453Client/Server Computing CS490¾Introduction to Operating Systems CS490¾Systems Software CS470¾Intro. To Computer Networks CS413¾Computer Architecture (undergraduate) CS309¾Switching Theory (Digital Logic) CS308¾Computer Organization and Assembly Language Programming CS207, CS208¾Computer Science II: Data Structures (C and Pascal) CS121, CS107, CS108¾Computer Science I: Intro. to programming (C++, C, and Pascal) Ph.D. and MS Thesis Students Advised Education B.E.E., The Georgia Institute of Technology, 1980 M.S.E.E., The Georgia Institute of Technology, 1982 M.S., Computer Science, The University of Alabama in Huntsville, 1992 Ph.D., Computer Science, The University of Alabama in Huntsville, 1997 Other Credentials Professional Engineer, Georgia IEEE Senior Member Extra Class Amateur Radio License Curriculum Vitae",
  "content_length": 1862,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:49"
}