{
  "name": "Letizia Jaccheri",
  "homepage": "https://www.ntnu.edu/employees/letizia.jaccheri",
  "status": "success",
  "content": "Letizia Jaccheri - NTNU Letizia Jaccheri Download press photo Download press photo Download press photo Foto: Close Letizia Jaccheri Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering letizia.jaccheri@ntnu.no +4773593469 +4791897028 IT-bygget Gløshaugen, Trondheim office 216 Twitter Google Scholar Blog - Home Page www.letiziajaccheri.org About CV Letizia Jaccheri, Dame (Cavaliera, Order of Merit of the Italian Republic) has a Ph.D. from Politecnico di Torino, Italy. She is Professor of Software Engineering at the Department of Computer Science. Jaccheri's research is on software engineering for society with focus on inclusion. I am ACM distinguished speaker since 2018. To ask for a lecture fill the form at  ACM DSP Conferences I am currently involved in IEEE/ACM International Conference on Software Engineering https://conf.researchr.org/home/icse-2024 ACM womENcourage https://womencourage.acm.org/ Projects: Trondheim ACMs Women in Computing Chapter (2020 -) Erasmus + Women Stem Up  (2022 - 2025) Erasmus + TECHlarp (2025 - 2027) COST Action EUGAIN CA19122 (2022- 2024) Horizon e-ladda  (2020 - 2024) Horizon Craft (2022 - 2025) HK-DIR SENOBR (2021 - 2024) NFR IDUN (2019 - 2022) NFR IPIT (2018 - 2022) More Research - Software for a better society https://sbs.idi.ntnu.no/ Blog, books, podcast, thoughts https://letiziajaccheri.org/ For Industry / Public sector To propose student projects see here https://sbs.idi.ntnu.no/tdt4290 See wikipedia (norwegian) Competencies Computer games Gender equality Interaction design Software engineering Research Jaccheri's research is on software engineering for society with focus on inclusion.  Jaccheri leads the group Software for a better society Action Chair EUGAIN CA19122 - https://eugain.eu/ Project Leader IDUN https://www.ntnu.edu/idun Founder of Trondheim ACM's Women in Computing Chapter https://trondheimwomen.acm.org/home/ e-ladda https://www.ntnu.edu/e-ladda Craft https://www.ntnu.edu/smartcities/craft SENOBR https://www.ntnu.edu/idi/senobr Women Stem Up https://women-stem-up.eu Software Engineering Publications 2022 Martinez-Millana, Antonio; Michalsen, Henriette; Berg, Valter; Anke, Audny Gabriele Wagner; Martinez, Santiago; Muzny, Miroslav. (2022) Motivating Physical Activity for Individuals with Intellectual Disability through Indoor Bike Cycling and Exergaming. International Journal of Environmental Research and Public Health (IJERPH) Academic article Patón-Romero, Jose David; Vinuesa, Ricardo; Jaccheri, Maria Letizia; Baldassarre, Maria Teresa. (2022) Artificial Intelligence and Gender Equality: A Systematic Mapping Study. Academic chapter/article/Conference paper Rubegni, Elisa; Landoni, Monica; Malinverni, Laura; Jaccheri, Maria Letizia. (2022) Raising Awareness of Stereotyping Through Collaborative Digital Storytelling: Design for Change with and for Children. International Journal of Human-Computer Studies Academic article Opland, Leif Erik; Pappas, Ilias; Engesmo, Jostein; Jaccheri, Maria Letizia. (2022) Employee-driven digital innovation: A systematic review and a research agenda. Journal of Business Research Academic literature review Torrado, Juan Carlos; Jaccheri, Maria Letizia; Pelagatti, Susanna; Wold, Ida. (2022) HikePal: A mobile exergame to motivate people with intellectual disabilities to do outdoor physical activities. Entertainment Computing Academic article 2021 Jaccheri, Maria Letizia; Diaconu, Mara Gabriela. (2021) Toward understanding of Gender and Software as factors impacting sustainability of real estate sector. Academic chapter/article/Conference paper Schjølberg, Ingrid; Jaccheri, Maria Letizia; Bartnes, Maria. (2021) Vi trenger flere kvinnelige forskere. Feature article Quayyum, Farzana; Cruzes, Daniela Soares; Jaccheri, Maria Letizia. (2021) Cybersecurity awareness for children: A systematic literature review. International Journal of Child-Computer Interaction Academic article Jiang, Shanshan; Jakobsen, Kine Charlotte; Jaccheri, Maria Letizia; Li, Jingyue. (2021) Blockchain and Sustainability: A Tertiary Study. Academic chapter/article/Conference paper Mikalef, Patrick; Pappas, Ilias; Krogstie, John; Jaccheri, Maria Letizia; Rana, Nripendra P.. (2021) Editors’ reflections and introduction to the special section on ‘Artificial Intelligence and Business Value’. International Journal of Information Management Editorial Patón-Romero, Jose David; Jaccheri, Maria Letizia. (2021) hUGe2: An Interdisciplinary Research Program for Sustainability. Academic chapter/article/Conference paper Cico, Orges; Souza, Renata; Jaccheri, Maria Letizia; Duc, Anh Nguyen; Machado, Ivan. (2021) Startups Transitioning from Early to Growth Phase - A Pilot Study of Technical Debt Perception. Lecture Notes in Business Information Processing Academic article Opland, Leif Erik; Jaccheri, Maria Letizia; Pappas, Ilias; Engesmo, Jostein. (2021) EMPLOYEE-DRIVEN DIGITAL INNOVATION IN PUBLIC ORGANIZATIONS – A CASE STUDY. Academic chapter/article/Conference paper Melzer, Andreas Kristiansen; Roarsen, Anna Kristine; Hagen, Marte Hoff; Jaccheri, Maria Letizia. (2021) Towards Suitable Free-to-Play Games for Children. Academic chapter/article/Conference paper Quayyum, Farzana; Bueie, Jonas; Cruzes, Daniela Soares; Jaccheri, Maria Letizia; Torrado, Juan Carlos. (2021) Understanding parents' perceptions of children's cybersecurity awareness in Norway. Academic chapter/article/Conference paper Michalsen, Henriette; Wangberg, Silje C.; Hartvigsen, Gunnar; Jaccheri, Maria Letizia; Henriksen, André; Olsen, Monica Isabel Benedikte. (2021) E-health, physical activity and intellectual disability – protocol for a pilot study. Journal of Intellectual Disability Research Abstract Jaccheri, Maria Letizia; Morasca, Sandro. (2021) TOWARD INCLUSION OF CHILDREN AS SOFTWARE ENGINEERING STAKEHOLDERS. Academic chapter/article/Conference paper Cico, Orges; Duc, Anh Nguyen; Jaccheri, Maria Letizia. (2021) The development and validation of a framework for teaching software engineering through startup practice in higher education. Proceedings - Frontiers in Education Conference Academic article Cico, Orges; Jaccheri, Maria Letizia; Duc, Anh Nguyen. (2021) Seeing the voice of the student: A pilot study of customer-driven courses. Proceedings - Frontiers in Education Conference Academic article Cico, Orges; Jaccheri, Maria Letizia; Duc, Anh Nguyen. (2021) Software Sustainability in Customer-Driven Courses. Academic chapter/article/Conference paper Cico, Orges; Jaccheri, Maria Letizia; Duc, Anh Nguyen. (2021) Facilitating learning and startup formation in experience-based courses — A team-centered model. IEEE Global Engineering Education Conference, EDUCON Academic article 2020 Quayyum, Farzana; Bueie, Jonas; Vidal, Juan Carlos Torrado; Jaccheri, Maria Letizia. (2020) Understanding coding activities for teens: a focus on school teachers' perspectives. Academic chapter/article/Conference paper Cico, Orges; Jaccheri, Maria Letizia; Duc, Anh Nguyen. (2020) Towards Designing an Experience-based Course around Innovation Bootcamps — A Cohort Study. Proceedings - Frontiers in Education Conference Academic article Opland, Leif Erik; Jaccheri, Maria Letizia; Pappas, Ilias; Engesmo, Jostein. (2020) Utilising the innovation potential - A systematic literature review on employee-driven digital innovation. Academic chapter/article/Conference paper Cico, Orges; Duc, Anh Nguyen; Jaccheri, Maria Letizia. (2020) Software startup formation in an experiential-based course - An empirical investigation of students' motivations. IEEE Global Engineering Education Conference, EDUCON Academic article Berg, Vebjørn; Birkeland, Jørgen; Duc, Anh Nguyen; Pappas, Ilias; Jaccheri, Maria Letizia. (2020) Achieving agility and quality in product development -an empirical study of hardware startups. Journal of Systems and Software Academic article Sharma, Kshitij; Vidal, Juan Carlos Torrado; Gomez, Javier; Jaccheri, Letizia. (2020) Improving Girls’ Perception of Computer Science as a Viable Career Option through Game Playing and Design: Lessons from a Systematic Literature Review. Entertainment Computing Academic literature review Opland, Leif Erik; Jaccheri, Maria Letizia; Engesmo, Jostein; Pappas, Ilias. (2020) Toward Employee-Driven Digital Innovation in Public Organizations Through the Use of Action Design Research. Lecture Notes in Computer Science (LNCS) Academic article Li, Jingyue; Jaccheri, Maria Letizia; Dingsøyr, Torgeir; Chitchyan, Ruzanna. (2020) EASE '20: Proceedings of the Evaluation and Assessment in Software Engineering. Association for Computing Machinery (ACM) Association for Computing Machinery (ACM) Academic anthology/Conference proceedings Michalsen, Henriette; Wangberg, Silje C; Anke, Audny; Hartvigsen, Gunnar; Jaccheri, Maria Letizia; Arntzen, Cathrine. (2020) Family members and health care workers' perspectives on motivational factors of participation in physical activity for people with intellectual disability: A qualitative study. Journal of Intellectual Disability Research Academic article Michalsen, Henriette; Wangberg, Silje C; Hartvigsen, Gunnar; Jaccheri, Maria Letizia; Muzny, Miroslav; Henriksen, André. (2020) Physical Activity With Tailored mHealth Support for Individuals With Intellectual Disabilities: Study Protocol for a Randomized Controlled Trial. JMIR Research Protocols Academic article Cico, Orges; Jaccheri, Maria Letizia; Duc, Anh Nguyen. (2020) Incorporating societal topics in software engineering education: A case study of a customer-driven course. Academic chapter/article/Conference paper Cico, Orges; Jaccheri, Maria Letizia; Duc, Anh Nguyen; Zhang, He. (2020) Exploring the intersection between software industry and Software Engineering education - A systematic mapping of Software Engineering Trends. Journal of Systems and Software Academic article Cico, Orges; Duc, Anh Nguyen; Jaccheri, Maria Letizia. (2020) An Empirical Investigation on Software ",
  "content_length": 85654,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:50"
}