{
  "name": "Levent Yilmaz 0001",
  "homepage": "http://www.eng.auburn.edu/~yilmaz",
  "status": "success",
  "content": "Dr. Levent Yilmaz Dr. Levent Yilmaz Professor Computer Science and Software Engineering Ginn College of Engineering Auburn University Quote -  \"Computer Science is no more about computers than astronomy is about telescopes.\" E. W. Dijkstra Selected Activities and Awards Fellow, Society for Modeling and Simulation International (SCS). US Fulbright Scholar (2022-2023) Editor-in-Chief of the Simulation: Transactions of the Society for Modeling and Simulation International (2008 - 2016). Auburn University External Consulting Award, Auburn University, 2010. Advisory Board Member of the Journal of Simulation (2023 - present) Associate Editor of the Journal of Simulation (2021 - 2023) Editorial Board Member of the International Journal of Simulation and Process Modeling  (2004-present). Associate Editor of the International Journal of Engineering Education  (2006 - present). Associate Editor of the Springer Complex Adaptive Systems Modeling Journal (2012 - 2020). Associate Editor of the Simulation & Gaming Journal (2008 - 2016). Elected Member of the Board of Directors of Society for Modeling and Simulation International (2006 - 2008, 2009 - 2011, 2011 - 2013). Vice President for Publications of the Society for Modeling and Simulation International (2011 - 2013). Distinguished Service Award, Society for Modeling and Simulation International, 2012, 2016. Distinguished Professional Achievement Award, Society for Modeling and Simulation International, 2011. Member of Upsilon Pi Epsilon, Honor Society in Computing Sciences. Founding Organizer and General Chair of the annual Agent-directed Simulation Symposium series (2005-2014) Levent Yilmaz is the Alumni Distinguished Professor of Computer Science and Software Engineering in the Ginn College of Engineering at Auburn University. Research Interests Simulation Theory & Methodology Agent-Directed Simulation - Agent Simulation, Agent-Monitored Simulation, Agent-Supported Simulation Model-Driven Science and Engineering for Computational Discovery Self-Organizing and Adaptive Systems Multi-Agent Systems - Distributed AI, Collective Intelligence, Cognitive Architectures, Collaborative Problem Solving and Learning Complex Adaptive Systems - Computational explorations in socio-technical, cognitive, cultural systems: Science of science and innovation policy, systems models of collective creativity, computational models of scientific discovery, conflict simulation, computer simulation of projects, organizations, communities, and processes. Teaching COMP 5970/6970: Multi-Agent Systems COMP 6790: Model-Driven Engineering COMP 3270: Introduction to Algorithms COMP 3700: Software Modeling & Design Selected Publications Complete list is available here Yilmaz L. (2025). \"Toward Models of Collective Intelligence for Goal-Directed Exploratory Simulation and Analysis,\" in Proceedings of the 2025 Annual Modeling and Simulation Conference (ANNSIM'25), May 26-29, 2025. Zou G., J. Tang, J, and L. Yilmaz (2025). \"Crowdsourcing Task Design using Multi-Agent Systems and an Enhanced Genetic Algorithm,\" International Journal of Control, Automation, and Systems, vol. 23, no. 3, 1250-1261. Yilmaz L. (2024). \"A Retrospective Review and Reflection on the Alignment of SIMULATION with the Evolving Professional Realm of Modeling and Simulation,\" SIMULATION: Transactions of the Society for Modeling and Simulation. https://doi.org/10.1177/00375497241249181. Zhang, Z., L. Yilmaz, and B. Liu (2023) Critical Review of Inductive Logic Programming Techniques for Explainable AI,\" IEEE Transactions on Neural Networks and Learning Systems. https://doi.org/10.1109/TNNLS.2023.3246980 Scherer W., M. Loper, A. Tolk, P. Barry, G. Rabadi, and L. Yilmaz (2023). Chances and Challenges of ChatGPT and Similar Models for Education in M&S,\" in Proceedings of the 2023 IEEE/ACM Winter Simulation Conference, December 10-13, San Antonio, TX. Yilmaz L. and Bo Liu (2022). Model Credibility Revisited: Concepts and Considerations for Appropriate Trust,\" Journal of Simulation, vol. 16, no. 3, pp. 312-325. Yilmaz L. (2022). Understanding Narrative-driven Intergroup Conflict Dynamics using Computational Cognitive Coherence Maps,\" Social Science Computer Review, vol. 40, no. 5, pp. 1285-1301. Lyu D., F. Yang F, H. Kwon., W. Dong, L.Yilmaz, and B. Liu (2022) TDM: Trustworthy Decision-Making via Interpretability Enhancement,\" IEEE Transactions on Emerging Topics in Computational Intelligence, vol. 6, no. 3, pp. 450-461 Zou, G., J. Tang, and L. Yilmaz (2022). Online Food Ordering Delivery Strategies based on Deep Reinforcement Learning,\" Applied Intelligence, vol. 52, no. 6, pp. 6853-6865. Rodriguez B. and L. Yilmaz (2020). Learning Rule-Based Explanatory Models from Exploratory Multisimulation for Robust Decision-Support Under Uncertainty,\" in Proceedings of the 2020 IEEE/ACM Winter Simulation Conference, pp. 2293-2304. December 13-16, Orlando, Florida. Yilmaz L. (2019) A Quantum Cognition Model for Simulating Ethical Dilemmas among Multi-perspective Agents, Journal of Simulation, DOI: 10.1080/17477778.2019.1603090. O'Mahony A., P. K. Davis, S. Appling, M. E. Brashears, E. Briscoe, K. M. Carley, J. M. Epstein, [...], A. Tolk, R. Vardavas, and L. Yilmaz (2019). ``Panel Discussion: Moving Social-Behavioral Modeling Forward,\" chapter 33 in Social-Behavioral Modeling for Complex Systems, pp. 753-787. Wiley. Yilmaz L. and S. Sivaraj (2019).  \"A Cognitive Architecture for Verifiable System Ethics via Explainable Autonomy,\" in Proceedings of the 2019 Annual IEEE International Systems Conference. April 8-11, Orlando, FL. Yilmaz L., A. Franco-Watkins, and T. S. Kroecker (2017). \"Computational Models of Ethical Decision-Making: A Coherence-Driven Reflective Equilibrium Model,\" Cognitive Systems Research, vol. 46, December 2017, pp. 61-74. Yilmaz L., S. Chakladar, K. Doud, A. E. Smith, A. Teran-Somohano, H. Oguztuzun, S. Cam, O. Dayibas, and B. K. Gorur (2017). \"Models as Self-Aware Cognitive Agents and Adaptive Mediators for Model-Driven Science,\" in Proceedings of the 2017 IEEE/ACM Winter Simulation Conference, pp. 1300-1311. December 3-6, 2017. Las Vegas, NV. Doud K. and L. Yilmaz (2017). \"A Framework for Formal Automated Analysis of Simulation Experiments using Probabilistic Model Checking,\" in Proceedings of the 2017 IEEE/ACM Winter Simulation Conference, pp. 1312-1323. December 3-6, Las Vegas, NV. Yilmaz L. (2017). \"Verification and Validation of Ethical Decision-Making in Autonomous Systems,\" in Proceedings of the 2017 Modeling and Simulation of Complexity in Intelligent, Adaptive and Autonomous Systems (MSCIAAS) Symposium of the Spring Simulation Multiconference}. April 23-27, 2017, Virginia Beach, VA. Yilmaz L., A. Franco-Watkins, and T. S. Kroecker (2016). \"Coherence-Driven Reflective Equilibrium Model of Ethical Decision-Making,\" in Proceedings of the 2016 IEEE International Multi-Disciplinary Conference on Cognitive Methods in Situation Awareness and Decision Support (CogSIMA), pp. 42-48. March 21-25, 2016, San Diego, CA Yilmaz L., F. Darema, R. Fujimoto, S. J. E. Taylor (2014). \"Panel: The Future of Research in Modeling and Simulation,\" in Proceedings of the 2014 IEEE/ACM Winter Simulation Conference, pp. 2797-2811. December 7-10, Savannah, Georgia.",
  "content_length": 7264,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:52"
}