{
  "name": "Levent Burak Kara",
  "homepage": "http://vdel.me.cmu.edu",
  "status": "success",
  "content": "Visual Design and Engineering Lab - Home Toggle navigation VDEL @ Carnegie Mellon University Home Team Publications Teaching Join Visual Design and Engineering Lab We are a dynamic research group at the Mechanical Engineering Department at Carnegie Mellon University. Our aim is to develop new engineering design, analysis, and manufacturing technologies through the use of artificial intelligence, machine learning, and optimization. Previous Next To this end, our research focuses on generating new algorithmic and methodological knowledge, all demonstrated and validated through computational software. Our research projects are centered around the following core foundations and applications: Core Foundations Applications AI / ML Regression Deep Learning Reinforcement Learning Engineering Analysis and Synthesis Optimization Generative Design Solid Mechanics Physics Simulations FEA / Meshing Geometric Modeling Shape Modeling Shape Processing CAD / Shape Design Topology Optimization Additive Manufacturing Design Theory and Methodology Integrated Circuit Design Bio-engineering Fuel Cell Design Air Quality Monitoring The Word Cloud from our publications (2014 onward): We are grateful for the funding and support of these sponsors: News May 2022 We are presenting four papers at IDETC-DAC 2022. Check out our publications page! April 2022 Prof. Kara gave a talk at the Toronto Geometry Colloquium. September 2021 Hongrui (Ray) Chen joined VDEL as new PhD students. Welcome to VDEL! January 2021 Haolin Liu joined VDEL as new PhD students. Welcome to VDEL! December 2020 Three new papers accepted Journal of Mechanical Design, Journal of Applied Mechanics and Energy and AI October 2020 Four papers accepted to ML for Engineering Modeling, Simulation, and Design Workshop at NeurIPS 2020 October 2020 One paper accepted to MLCAD 2020 September 2020 Two papers accepted to MST20 September 2020 Congratulations Dr. Zhenguo Nie for starting your new position at Tsinghua University! ... see all News Levent Burak Kara Carnegie Mellon University Mechanical Engineering Department Scaife Hall 411 5000 Forbes Avenue Pittsburgh, PA 15213 (412) 268-2509 | lkara@cmu.edu (Map, Directions) Lab Address Carnegie Mellon University Wean Hall 3412 5000 Forbes Avenue Pittsburgh, PA 15213 (Map, Directions) We are part of the Mechanical Engineering at Carnegie Mellon University.",
  "content_length": 2373,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:50"
}