{
  "name": "Levin Kuhlmann",
  "homepage": "https://research.monash.edu/en/persons/levin-kuhlmann",
  "status": "success",
  "content": "Levin Kuhlmann - Monash University View Scopus Profile Levin Kuhlmann Assoc Professor Associate Professor, Department of Data Science & AIVictorian Heart Institute (VHI) https://orcid.org/0000-0002-5108-6348 Phone+61412552283EmailLevin.KuhlmannmonasheduWebsitehttp://levinkuhlmann.byethost3.com/, https://www.researchgate.net/profile/Levin_Kuhlmann, https://scholar.google.com.au/citations?user=2oIqQ_MAAAAJ&hl=en, https://www.epilepsyecosystem.org/, https://www.linkedin.com/in/levin-kuhlmann-35088a78/?originalSubdomain=au, https://expertconnect.global/expert/Levin-Kuhlmann/5b3ed0582f23b361deb1e59b, http://unimelb.academia.edu/LevinKuhlmann Room 2.73, Woodside Building, Clayton CampusMonash University VIC 3800 Accepting PhD StudentsPhD projectsSee potential projects at: http://levinkuhlmann.byethost3.com/ 1999 …2026 Research activity per year Personal profile BiographyLevin Kuhlmann, PhD, is a data scientist, computational neuroscientist and neural engineer. His research areas include data science, machine learning, signal processing, control theory and computational neuroscience applications to digital health, neural engineering and neuroimaging. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationCognitive and Neural Systems, PhD, Boston University External positionsHonorary Senior Research Fellow, University of Melbourne Research area keywordsDigital Health, Data Science, Machine Learning, Statistical Signal Processing, Stochastic Filtering, Control Theory, Computational Neuroscience, Neural Engineering, Neuroimaging, Neurology, Epilepsy, Anaesthesiology Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2019 2019 2020 2021 2026 1 Active 7 Finished Projects per year CSIRO Next Generation: Development of an AI-augmented NDIS coaching planning, content generation and reporting system and its assessment against existing manual best practicesMcNaney, R. (Primary Chief Investigator (PCI)), Olivier, P. (Chief Investigator (CI)), Kuhlmann, L. (Supervisor), Anderson, D. (Supervisor) & Khurshid, H. (Chief Investigator (CI))1/07/24 → 30/06/26Project: Research High performance computing for advanced brain imaging - MSI GeForce RTX 2060 Ventus 12G OC Graphics CardKuhlmann, L. (Primary Chief Investigator (PCI))1/10/21 → 31/12/22Project: Research Rethinking the Data-driven Discovery of Rare PhenomenaBoley, M. (Primary Chief Investigator (PCI)), Buntine, W. (Partner Investigator (PI)), Schmidt, D. (Chief Investigator (CI)), Kuhlmann, L. (Chief Investigator (CI)) & Scheffler, M. (Partner Investigator (PI))29/07/21 → 28/11/24Project: Research Apple Watch Series 6 for wearables in epilepsy monitoring researchKuhlmann, L. (Primary Chief Investigator (PCI))1/01/21 → 31/12/21Project: Research Creating subject-specific mathematical models to understand the brainGrayden, D. B. (Primary Chief Investigator (PCI)), Kuhlmann, L. (Chief Investigator (CI)), Karoly, P. (Chief Investigator (CI)) & Cook, M. J. (Chief Investigator (CI))12/03/20 → 31/12/22Project: Research View all 8 projects Research output Research output per year 1999 2018 2020 2021 2022 2023 2026 63 Article 30 Conference Paper 7 Review Article 2 Chapter (Book) 1 More 1 Editorial Research output per year Research output per year An attributed multiplex network enabled GNN-based stock predictor with observable and non-observable informationLiu, Z., Duan, P., Chu, Q., Kuhlmann, L., Zhang, C., Yue, W., Tang, X. & Zhang, B., 15 Jan 2026, In: Expert Systems with Applications. 296, Part B, 13 p., 129018.Research output: Contribution to journal › Article › Research › peer-review Cortical stability and chaos during focal seizures: insights from inference-based modelingZhao, Y., Grayden, D. B., Boley, M., Liu, Y., Karoly, P. J., Cook, M. J. & Kuhlmann, L., 27 May 2025, In: Journal of Neural Engineering. 22, 3, 23 p., 036021.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) Graceful Task Adaptation with a Bi-hemispheric RL AgentNicholas, G., Kuhlmann, L. & Kowadlo, G., 2025, AI 2024, Advances in Artificial Intelligence, 37th Australasian Joint Conference on Artificial Intelligence, AI 2024 Melbourne, VIC, Australia, November 25–29, 2024 Proceedings, Part II. Gong, M., Song, Y., Koh, Y. S., Xiang, W. & Wang, D. (eds.). Singapore Singapore: Springer, p. 26-38 13 p. (Lecture Notes in Computer Science; vol. 15443).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Left/Right Brain, Human Motor Control and the Implications for RoboticsRinaldo, J., Friedman, J., Kuhlmann, L. & Kowadlo, G., 2025, Machine Learning, Optimization, and Data Science - 10th International Conference, LOD 2024 Castiglione della Pescaia, Italy, September 22–25, 2024 Revised Selected Papers, Part III. Nicosia, G., Ojha, V., Giesselbach, S., Pardalos, M. P. & Umeton, R. (eds.). Cham Switzerland: Springer, p. 261-274 14 p. (Lecture Notes in Computer Science; vol. 15510).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Parallel boosting neural network with mutual information for day-ahead solar irradiance forecastingAhmed, U., Mahmood, A., Khan, A. R., Kuhlmann, L., Alimgeer, K. S., Razzaq, S., Aziz, I. & Hammad, A., Dec 2025, In: Scientific Reports. 15, 1, 19 p., 11642.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) View all 103 research outputs Prizes Australian Post-Graduate Award, 2001Kuhlmann, L. (Recipient), 2001Prize: Prize (including medals and awards) Best Paper Award Honorable Mention (top 3 of 300), 23rd ACM International Conference on Multimodal Interaction, 2021Kuhlmann, L. (Recipient), 2021Prize: Prize (including medals and awards) Best Poster Prize at 25th Annual Computational Neuroscience Meeting, 2016Kuhlmann, L. (Recipient), 2016Prize: Prize (including medals and awards) Boston University Cognitive and Neural Systems Doctoral Fellowship, 2001-2006Kuhlmann, L. (Recipient), 2001Prize: Prize (including medals and awards) Concours de chargés de recherche de premiere classe, INRIA Nancy (first after interview), 2015Kuhlmann, L. (Recipient), 2015Prize: Prize (including medals and awards) View all 12 prizes Activities Activities per year 2005 2014 2015 2018 2019 2022 2022 38 Peer review responsibility 23 Public lecture/debate/seminar 8 Contribution to conference 2 Editorial responsibility Activities per year Annual Computational Neuroscience Meeting (CNS 2022) Kuhlmann, L. (Organiser)2022Activity: Participating in or organising an event types › Contribution to conference The Lancet Digital Health (Journal)Kuhlmann, L. (Peer reviewer)1 Jan 2022 → …Activity: Publication peer-review and editorial work types › Peer review responsibility Automated Interictal Epileptiform Discharge Detection From Scalp EEG Using Scalable Time-series Classification ApproachesKuhlmann, L. (Contributor)2022Activity: Community Talks, Presentations, Exhibitions and Events › Public lecture/debate/seminar AI in HealthcareKuhlmann, L. (Contributor)2022Activity: Community Talks, Presentations, Exhibitions and Events › Public lecture/debate/seminar Brain Topography (Journal)Kuhlmann, L. (Peer reviewer)1 Sept 2022 → …Activity: Publication peer-review and editorial work types › Peer review responsibility View all 71 activities Press/Media The Wire - EPILEPSY WILL BE DIAGNOSED FASTER WITH AIKuhlmann, L.25/09/201 Media contributionPress/Media: Article/Feature Herald Sun - Brain waves cracked: Computer quick to find epilepsy.Kuhlmann, L.25/09/201 Media contributionPress/Media: Article/Feature ZDNet.com - Monash-university-researchers-speed-up-epilepsy-diagnosis-with-machine-learningKuhlmann, L.24/09/201 Media contributionPress/Media: Article/Feature A first for Digital Health at MonashKuhlmann, L.12/10/181 Media contributionPress/Media: Article/Feature Epilepsyecosystem.org: Crowd-Sourcing Reproducible Seizure Prediction with Long-Term Human Intracranial EEGKuhlmann, L.7/09/181 Media contributionPress/Media: Article/Feature View all 18 press/media",
  "content_length": 8667,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:52"
}