{
  "name": "Leysia Palen",
  "homepage": "http://cmci.colorado.edu/~palen",
  "status": "success",
  "content": "Biography | LEYSIA PALEN | Leysia Palen LEYSIA PALEN Distinguished ProfessorInformation Science and Computer ScienceUniversity of Colorado Boulder Site Navigation[Skip] About Crisis Informatics CV PUBLICATIONS Talk Videos Teaching Graduate Students Sidebar[Skip] palen at colorado dot edu ABOUT(One of my alma maters, Information and Computer Science at the University of California Irvine, recently published a biographical interview which provides a different kind of background.) Leysia Palen is a 2022 Distinguished Professor of Computer Science and Information Science at the University of Colorado Boulder, USA. She was the founding chair of the Department of Information Science, which lauched in 2015.  In 2016, she was elected to the ACM CHI Academy.She is a faculty fellow with the Institute of Cognitive Science. From 2012-2017, Palen was Full Adjunct Professor at the University of Agder in Norway.Prof. Palen is a leader in the area of crisis informatics, an area she forged with her graduate students and colleagues at Colorado. She brings her training in human-computer interaction (HCI), computer-supported cooperative work and social computing to bear on understanding and advancing socio-technical issues of societal import. She conducts empirical research in the interpretivist tradition. However, in the advancing arena of large-scale on-line interaction (the \"big data\" of crisis response), she adapts quantitative techniques that then allow the application of qualitative methods and the \"ethnographic eye\" to closely observe and describe social structures in such technology-mediated situations. For this work, Prof. Palen has been given the 2015 ACM Computer Human Interaction Social Impact Award. Prof. Palen is the author of over 90 articles and a co-edited book in the areas of human computer interaction, computer supported cooperative work, and crisis informatics. She has been awarded $5M as Principal Investigator in grants from the US National Science Foundation, including an NSF CAREER award in 2006. She is an Associate Editor for the Human Computer Interaction Journal (Taylor and Francis) and for the Computer-Supported Cooperative Work Journal (Springer).At the University of Colorado Boulder, Prof. Palen directs the Project EPIC (Empowering the Public with Information during Crisis) research effort, and co-directs the Center for Software & Society.Prof. Palen is a graduate of the University of California, San Diego with a BS in Cognitive Science, and of the University of California, Irvine with an MS and PhD in Information and Computer Science. As an undergraduate, she spent time at the University of Stirling, Scotland, and as a faculty member at the University of Aarhus, Denmark and the University of Agder, Norway. She has worked at Boeing Commercial, USWEST Advanced Technologies, Microsoft Commercial and Xerox PARC. [Back To Top]",
  "content_length": 2883,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:54"
}