{
  "name": "Leïla Musavian",
  "homepage": "https://www.essex.ac.uk/people/musav85708/leila-musavian",
  "status": "success",
  "content": "Leila Musavian | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Leila Musavian People Professor Leila Musavian Professor School of Computer Science and Electronic Engineering (CSEE) Email leila.musavian@essex.ac.uk Telephone +44 (0) 1206 876033 Location 1NW.4.16, Colchester Campus Academic support hours Tuesdays: 16:00-17:00 Thursdays: 14:00-15:00 If you wish to contact me to arrange a meeting, please feel free to do so at: Leila.musavian@essex.ac.uk Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Prof. Leila Musavian received her PhD degree in Telecommunications from Kings College London, UK. She is currently working as a Professor of Wireless Communications at the School of Computer Science and Electronic Engineering, University of Essex. Prior to that, she was Deputy Pro-Vice-Chancellor for Research at the University of Essex and also a Reader in Telecommunications at CSEE, University of Essex and a Senior Lecturer/Lecturer at InfoLab21, Lancaster University. She has also worked at McGill University (Canada), Loughborough University (UK) and at INRS-EMT (Canada). She has been the Deputy Director of Research of the School of Computer Science and Electronic Engineering at the University of Essex. Her research interests lie in Radio Resource Management for Low latency communications, 6G, Energy Harvesting and SWIPT, Semantic Communications, Security, Green Communications and cross-layer design for delay QoS provisioning. She is currently Editor for the IEEE Communications Surveys & Tutorials. She has been an Editor of IEEE TRANSACTIONS OF WIRELESS COMMUNICATIONS, Associate Editor of Wiley’s Internet Technology Letters, Executive Editor of Wiley's Transactions on Emerging Telecommunications Technologies. She is currently Co-chair of Track 2, IEEE WCNC 2023. She has been Workshop Co-Chair of VTC-Spring-2020 and the Wireless Communications Symposium Lead Co-Chair for IEEE ICC 2021, Montreal, Canada, lead chair UHS5G WP in IEEE GLOBECOM 2018, UHSLLS WP in IEEE WCNC 2019, lead chair for URLLC Special Session in IEEE PIMRC 2018, TPC Co-Chair of CorNer 2016 (in conjunction with ISWCS 2016) and Co-Chair of mmWave 5G (STEMCOM 2016) and TPC member of several conferences including IEEE ICC, IEEE GLOBECOM, IEEE WCNC, IEEE ICCCN, IEEE PIMRC, ChinaCom. Appointments University of Essex Professor of Wireless Communications, University of Essex (1/10/2020 - present) Deputy Pro-Vice-Chancellor Research, University of Essex (23/9/2019 - 31/12/2020) CSEE Deputy Director of Research, CSEE, University of Essex (1/10/2017 - 22/9/2019) Research and professional activities Research interests URLLC Use case Ultra Reliable Low Latency Communications are important use cases of 5G and Beyond 5G communications. Our group has a strong background and history in enabling technologies for Low latency communications. Open to supervise 6G Communications Open to supervise Massive MIMO Open to supervise Physical Layer Network Coding Open to supervise Machine Learning for Communication Open to supervise 5G/Beyond 5G Open to supervise Current research 5G and beyond radio resource allocation Multimedia Communications Delay QoS provisioning Teaching and supervision Current teaching responsibilities Fundamentals of Digital Systems (CE161) Current supervision Ishtiaque Ahmed Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Askin Altinoklu Degree subject: Computer Science Degree type: Doctor of Philosophy Yueyi Yang Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Previous supervision Dhawal Beohar Thesis title: Statistical Performance Evaluation for Energy Harvesting Communications Based on Large Deviation Theorem Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 1/9/2023 Nihan Ari Thesis title: Physical Layer Security of Short Packet Communications Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 17/5/2023 Amirul Islam Thesis title: Machine Learning Assisted Ultra Reliable and Low Latency Vehicular Optical Camera Communications Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 30/11/2022 Bismark Okyere Thesis title: Physical Layer Network Coding for M-Qam Mimo Systems Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 29/9/2022 Muhammad Amjad Thesis title: Link-Layer Rate of Multiple Access Technologies with Short-Packet Communications for Urllc Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 31/3/2022 Publications Publications (5) Sui, Z., Liu, Z., Musavian, L., Yang, L-L. and Hanzo, L., (2025). Generalized Spatial Modulation Aided Affine Frequency Division Multiplexing Altinoklu, A. and Musavian, L., (2025). Lorentzian-Constrained Holographic Beamforming Optimization in Multi-user Networks with Dynamic Metasurface Antennas Hedhly, W., Musavian, L. and Thomos, N., (2024). OTFS-NOMA System for MIMO Communication Networks with Spatial Diversity Hedhly, W., Musavian, L. and Thomos, N., (2024). Performance Analysis of OTFS-NOMA System with Fractional Doppler Altinoklu, A. and Musavian, L., (2024). Investigation of Holographic Beamforming via Dynamic Metasurface Antennas in QoS Guaranteed Power Efficient Networks Show all Journal articles (64) Ahmed, I., Sun, Y., Fu, J., Köse, A., Musavian, L., Xiao, M. and Özbek, B., Semantic Communications in 6G: Coexistence, Multiple Access, and Satellite Networks. IEEE Communications Standards Magazine Mohamed, Z., Amjad, M., Musavian, L. and Aïssa, S., (2025). Effective Capacity of Non-Orthogonal Multiple Access with Finite Blocklength for Low-Latency Communications. IEEE Transactions on Wireless Communications. 24 (10), 8267-8282 Ahmed, I. and Musavian, L., (2025). Semantic Communications in 6G: Coexistence, Multiple Access, and Satellite Networks. IEEE Communications Standards Magazine. 9 (4), 58-64 Sui, Z., Liu, Z., Musavian, L., Yang, L-L. and Hanzo, L., (2025). Generalized Spatial Modulation Aided Affine Frequency Division Multiplexing. IEEE Transactions on Wireless Communications, 1-1 Ari, N., Musavian, L. and Thomos, N., (2025). Does Semantic Similarity Provide Enhanced Physical Layer Security?. IEEE Communications Letters, 1-1 İlgüy, M., Özbek, B., Musavian, L. and Mumtaz, S., (2024). Phase Shift Optimization for RIS Enabled PNC System With Multiple Antennas. IEEE Access. 12, 62107-62117 Islam, A., Thomos, N. and Musavian, L., (2024). 5G NR Codes and Modulation Deep-RL Optimization for uRLLC in Vehicular OCC. IEEE Transactions on Intelligent Transportation Systems. 25 (12), 19592-19604 Islam, A., Thomos, N. and Musavian, L., (2024). Deep Reinforcement Learning Based Ultra Reliable and Low Latency Vehicular OCC. IEEE Transactions on Communications. 73 (5), 3254-3267 Islam, A., Thomos, N. and Musavian, L., (2023). Multi-Agent Deep Reinforcement Learning for Spectral Efficiency Optimization in Vehicular Optical Camera Communications. IEEE Transactions on Mobile Computing. 23 (5), 3666-3679 Dhawal, B., Musavian, L. and Sonia, A., (2023). Novel Mathematical Framework for Performance Analysis of Energy Harvesting Based Point-to-Point Communications. IEEE Access. 11, 118229-118240 Yilmaz, SS., Ozbek, B., Ilguy, M., Okyere, B., Musavian, L. and Gonzalez, J., (2022). User Selection for NOMA based MIMO with Physical Layer Network Coding in Internet of Things Applications. IEEE Internet of Things Journal. 9 (16), 14998-15006 Yu, W., Jia, H. and Musavian, L., (2022). Joint Adaptive M-QAM Modulation and Power Adaptation for a Downlink NOMA Network. IEEE Transactions on Communications. 70 (2), 783-796 Shuai, W., Ruihua, H., Yuncong, H., Qi, H., Miaowen, W., Musavian, L., Shahid, M. and Derrick Wing Kwan, N., (2022). Robotic Wireless Energy Transfer in Dynamic Environments: System Design and Experimental Validation. IEEE Communications Magazine. 60 (3), 40-46 Milad, A., Aissa, S., Musavian, L. and Anirban, B., (2022). Rate Splitting in the Presence of Untrusted Users: Outage and Secrecy Outage Performances. IEEE Open Journal of the Communications Society. 3, 921-935 Ari, N., Thomos, N. and Musavian, L., (2022). Performance Analysis of Short Packet Communications with Multiple Eavesdroppers. IEEE Transactions on Communications. 70 (10), 6778-6789 Goudarzi, S., Anisi, MH., Ahmadi, H. and Musavian, L., (2021). Dynamic Resource Allocation Model for Distribution Operations using SDN. IEEE Internet of Things Journal. 8 (2), 976-988 Okyere, B., Musavian, L., Ozbek, B., Busari, SA. and Gonzalez, J., (2021). The Resilience of Massive MIMO PNC to Jamming Attacks in Vehicular Networks. IEEE Transactions on Intelligent Transportation Systems. 22 (7), 1-8 Salem, A. and Musavian, L., (2021). NOMA in Cooperative Communication Systems with Energy-Harvesting Nodes and Wireless Secure Tran",
  "content_length": 32756,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:53"
}