{
  "name": "Li Chen 0009",
  "homepage": "http://www.comp.hkbu.edu.hk/~lichen",
  "status": "success",
  "content": "Prof. Li CHEN at HKBU Prof. Li CHEN at HKBU Home Awards Professional Activities Publications Teaching HCI-RecSys Group No categories Research Interests Conversational AI, Explainable AI, Recommender Systems, Human-Computer Interaction Our \"Positive Intelligence\" Lab conducts interdisciplinary research on intelligent technology for well-being. Recent Activities Program Co-Chair, 2026 31st ACM Conference on Intelligent User Interfaces (IUIâ26) Co-Editor-in-Chief, ACM Transactionsâ¯on Recommender Systems (TORS) Associate Editor, ACM Transactions on Interactive Intelligent Systems (TiiS) Editorial Board Member, User Modeling and User-Adapted Interaction: The Journal of Personalization Research (UMUAI) Executive Committee Member of ACM Conference on Recommender Systems (RecSys) ACM Senior Member More Recent Publications Causality-Inspired Fair Representation Learning for Multimodal Recommendation. ACM Transactions on Information Systems (TOIS), 2025. (to appear) DAR: Dimension-Adaptive Recommendation with Multi-Granular Noise Control. In Proceedings of the 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR'25), July 13-18, 2025. From Pairwise to Ranking: Climbing the Ladder to Ideal Collaborative Filtering with Pseudo-Ranking. In Proceedings of the 39th Annual AAAI Conference on Artificial Intelligence (AAAIâ25), February 25 - March 4, 2025. The Way You Assess Matters: User Interaction Design of Survey Chatbots for Mental Health. International Journal of Human - Computer Studies (IJHCS), 2024. CRS-Que: A User-Centric Evaluation Framework for Conversational Recommender Systems. ACM Transactions on Recommender Systems (TORS), 2024. Large Language Models for Generative Recommendation: A Survey and Visionary Discussions. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (COLINGâ24), May 20-25, 2024. More Home Prof. Li CHEN (é³é») Associate Head (Research) and Professor, Department of Computer Science Professor (Affiliate), Academy of Wellness and Human Development Hong Kong Baptist University, China Education: PhD in Computer Science (Nominee for Best PhD Thesis Award), Swiss Federal Institute of Technology in Lausanne (EPFL), Switzerland Master in Computer Software and Theory, Peking University (åäº¬å¤§å­¸), China Bachelor in Computer Science, Peking University (åäº¬å¤§å­¸), China Google scholar profile: h-index 52, i10-index 115, citations 11,488 (till June 2025) Short bio: Professor Chenâs recent research focus has mainly been on personalized conversational and explainable AI, with applications covering various domains including entertainment, digital media, education, e-commerce, and psychological well-being. She has authored and co-authored over 150 publications, most of which appear in high-impact journals (such as IJHCS, CSCW, TOCHI, TOIS, UMUAI, TIST, TIIS, KNOSYS, Behavior & Information Technology, AI Magazine, and IEEE Intelligent Systems), and key conferences in the areas of data mining (SIGKDD, WSDM, SDM), artificial intelligence (IJCAI, AAAI), information retrieval (SIGIR), recommender systems (RecSys), user modeling (UMAP), and intelligent user interfaces (CHI, IUI, Interact). Her co-authored papers have received several awards, such as the RecSysâ24 Best Student Paper Award, CHIâ22 Honourable Mention Award, UMAPâ20 Best Student Paper Award, UMUAI 2018 Best Paper Award, and UMAPâ15 Best Student Paper Award. She received the Presidentâs Award for Outstanding Performance in Teaching (Individual) 2024/25, the Presidentâs Award for Outstanding Performance in Research Supervision 2022/23, and has been included in the list of the worldâs top 2% most-cited scientists by Stanford University since 2021. She is now an ACM senior member, co-editor-in-chief of ACM Transactions on Recommender Systems (TORS), executive committee member of ACM Conference on Recommender Systems (RecSys), editorial board member of User Modeling and User-Adapted Interaction Journal (UMUAI), and associate editor of ACM Transactions on Interactive Intelligent Systems (TiiS). She also served as the general co-chair of ACM RecSysâ23, the program co-chair of ACM RecSysâ20, and the program co-chair of ACM UMAPâ18. Teaching COMP4135 Recommender Systems and Applications; COMP7240 Recommender Systems (2024-2025 second semester) Contact Email: lichen AT comp.hkbu.edu.hk Mailing address: DLB 632, Shaw Campus Hong Kong Baptist University Kowloon Tong, Hong Kong, China Links Department of Computer Science at HKBU Peking University Positive Intelligence Lab Swiss Federal Institute of Technology in Lausanne (EPFL) Copyright Â© 2025 Prof. Li CHEN at HKBU. All Rights Reserved.",
  "content_length": 4772,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:53"
}