{
  "name": "Li Liao",
  "homepage": "https://www.eecis.udel.edu/~lliao",
  "status": "success",
  "content": "Prof. Li Liao's page Li Liao Associate Professor of Computer and Information Sciences Affiliated Faculty, Delaware Biotechnology Institute Affiliated Faculty, Data Science Institute Affiliated Faculty, Quantitative Biology Ph.D., Peking University (1992) F25 Office Hours: 1:00PM-2:00PM,TR Office: 424 Smith Hall Postal Address University of Delaware Phone: 302-831-3500 101 Smith Hall Fax: 302-831-8458 Newark, DE 19716 Teaching CISC260 Machine Organization and Assembly Language Research (Publications) My research interests are in bioinformatics. I am particularly interested in developing statistical and machine learning methods that are effective, expressive and interpretable, via incorporating domain specific knowledge of biological systems. The projects include: Homology identification, protein family classification, and clustering. (Supported by DuPont Science and Engineering Award) Molecular sequence modelling and analysis. (Supported by the NIH COBRE) Comparative genomics and metabolic pathway evolution. Pattern analysis for RNAi. (Supported by UDRF) Sequence assembly of 454 and SBS data. (Supported by NSF) Service Editorial Board IEEE/ACM Transactions on Computational Biology and Bioinformatics ( TCBB) BMC Bioinformatics Frontier in Plant Science / Plant Bioinformatics Bioinformatics and Biology Insights Journal of Biostatistics and Biometric Applications Scholarena Journal of Genetics Program Committee IWBBIO 2006 The 13th International Work-Conference on Bioinformatics and Biomedical Engineering, July 15th-17th, 2025, Gran Canaria, Spain. SIMULTECH 2026 The 16th International Conference on Simulation and Modeling Methodologies, Technologies and Applications (SIMULTECH), Porto, Portugal, July 18-20, 2026. BIOINFORMATICS 2026 The 19th International Joint Conference on Biomedical Engineering Systems and Technologies, Marbella, Spain, March 2-4, 2026. Internal use (password protected) Last updated: March, 2010",
  "content_length": 1945,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:55"
}