{
  "name": "Li Li 0029",
  "homepage": "http://lilicoding.github.io",
  "status": "success",
  "content": "Li Li's Homepage - FIT, Monash University Li Li Professor of Software Engineering School of Software Beihang University, China Email: lilicoding@ieee.org You can also access my DBLP, Google Scholar Citations Github, Research Gate, LinkedIn Prospective Students: I'm actively recruiting (self-motivated and active) PhD students. Please contact me if you are a self-motivated PhD student (or graduate student interested in our PhD program) with strong programming skills and strong interests in software analysis, security and machine learning as well as deep learning. More information can be found here. Please submit your high-quality work to ICSE 2023 ESEC/FSE 2023 SANER 2023 MobileSoft 2023 AST 2023 Li is a Professor of Software Engineering at Beihang University. He was an ARC DECRA Fellow and Senior Lecturer at Monash University, where he leads the SMart software Analysis and Trustworthy computing (SMAT) research lab at the Department of Software Systems and Cybersecurity. He joined Monash University as a Lecturer on February 2018. Prior to that, he was a research associate in Software Engineering at the University of Luxembourg (UL) where he also obtained his Phd degree in November 2016 under the supervision of Prof. Yves Le Traon (IEEE Fellow) and Dr. Jacques Klein. His research interests (listed below) mainly lie in the field of Mobile Software Engineering (i.e., Mobile Security and quality assurance) and Intelligent Software Engineering (SE4AI, AI4SE), under which he is broadly interested in applying static code analysis, dynamic program testing, machine/deep learning techniques to strengthen the security and reliability of software systems. Li's research has been published in top-tier conferences and journals including ICSE, ESEC/FSE, ASE, ISSTA, POPL, PLDI, TheWebConf, ACL, TOSEM, TSE, TDSC, TIFS. He is recognised as a Rising SE Research Star and one of the Top-5 Most Impactful Early Career SE Researchers in the world (2020, 2017). His research publications have received 5 best/distinguished paper awards, including ACM SIGPLAN Distinguished Paper Award at PLDI 2021 (CORE A*), Best Student Paper Award at TheWebConf 2020 (CORE A*), ACM SIGSOFT Distinguished Paper Award at ASE 2018 (CORE A*), Free and Open-Source Software (FOSS) Impact Paper Award at MSR 2018 (CORE A), and Best Paper Award at the ERA track of SANER 2016 (CORE A). Recent Research Interests: Intelligent Software Engineering: LLM Testing, Prompt Engineering, AI Chain Trustworthy AI: Data Security, Data Watermarking, Deployment Security Software Security: Mobile Security, Software Supply Chain Security Program Analysis: Static Analysis (Java@Soot, Python@Scalpel, Javascript), Dynamic Testing Work in Progress Li Li, Jiawei Wang, Haowei Quan, Scalpel: The Python Static Analysis Framework, arXiv preprint arXiv:2202.11840, 2022 [pdf] [bib] [Source Code] Li Li, Jun Gao, Médéric Hurier, Pingfan Kong, Tegawendé F Bissyandé, Alexandre Bartel, Jacques Klein, Yves Le Traon, AndroZoo++: Collecting Millions of Android Apps and Their Metadata for the Research Community, arXiv preprint arXiv:1709.05281, 2017 [pdf] [bib] Selected Publications See this Full List page. ISSTA Pei Liu, Yanjie Zhao, Haipeng Cai, Mattia Fazzini, John Grundy, and Li Li, Automatically Detecting API-induced Compatibility Issues in Android Apps: A Comparative Analysis (Replicability Study), The ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2022), 2022 [pdf] [bib] ACL Juncai Guo, Jin Liu, Yao Wan, Li Li, Pingyi Zhou, Modeling Hierarchical Syntax Structure with Triplet Position for Source Code Summarization, The 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022), 2022 [pdf] [bib] WWW Zhensu Sun, Xiaoning Du, Fu Song, Mingze Ni and Li Li, CoProtector: Protect Open-Source Code against Unauthorized Training Usage with Data Poisoning, The ACM Web Conference (WWW 2022), 2022 [pdf] [bib] WWW Guosheng Xu, Siyi Li, Hao Zhou, Shucen Liu, Yutian Tang, Li Li, Xiapu Luo, Xusheng Xiao, Guoai Xu and Haoyu Wang, Lie to Me: Abusing the Mobile Content Sharing Service for Fun and Profit, The ACM Web Conference (WWW 2022), 2022 [pdf] [bib] ICSE Yanjie Zhao, Li Li, Kui Liu, John Grundy, Towards Automatically Repairing Compatibility Issues in Published Android Apps, The 44th International Conference on Software Engineering (ICSE 2022), 2022 [pdf] [bib] ICSE Zhensu Sun, Li Li, Yan Liu, Xiaoning Du, Li Li, On the Importance of Building High-quality Training Datasets for Neural Code Search, The 44th International Conference on Software Engineering (ICSE 2022), 2022 [pdf] [bib] ICSE Jordan Samhi, Li Li, Tegawendé F. Bissyandé, Jacques Klein, Difuzer: Uncovering Suspicious Hidden Sensitive Operations in Android Apps, The 44th International Conference on Software Engineering (ICSE 2022), 2022 [pdf] [bib] ESEC/FSE Bo Li, Qiang He, Feifei Chen, Xin Xia, Li Li, John Grundy, Yun Yang, Embedding App-Library Graph for Neural Third Party Library Recommendation, The 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2021), 2021 [pdf] [bib] PLDI Xiaolei Ren, Michael Ho, Jiang Ming, Jeff Y. Lei, Li Li, Unleashing the Hidden Power of Compiler Optimization on Binary Code Difference: An Empirical Study, The 42nd ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2021), 2021 [pdf] [bib] WWW Yuhao Gao, Haoyu Wang, Li Li, Xiapu Luo, Xuanzhe Liu and Guoai Xu, Demystifying Illegal Mobile Gambling Apps, The Web Conference 2021 (WWW 2021), 2021 [pdf] [bib] ICSE Jiawei Wang, Li Li, Andreas Zeller, Restoring Execution Environments of Jupyter Notebooks, The 43rd ACM/IEEE International Conference on Software Engineering (ICSE 2021), 2021 [pdf] [bib] ASE Jiawei Wang, Tzu-yang Kuo, Li Li, Andreas Zeller, Assessing and Restoring Reproducibility of Jupyter Notebooks, The 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020), 2020 [pdf] [bib] ASE Xin Wang, Jin Liu, Li Li, Xiao Chen, Xiao Liu, Hao Wu, Detecting and Explaining Self-Admitted Technical Debts with Attention-based Neural Networks, The 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020), 2020 [pdf] [bib] ASE Haoye Tian, Kui Liu, Abdoul Kader Kaboré, Anil Koyuncu, Li Li, Jacques Klein, Tegawendé F. Bissyandé, Evaluating Representation Learning of Code Changes for Predicting Patch Correctness in Program Repair, The 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020), 2020 [pdf] [bib] ASE Xian Zhan, Lingling Fan, Tianming Liu, Sen Chen, Li Li, Haoyu Wang, Yifei Xu, Xiapu Luo and Yang Liu, Automated Third-party Library Detection for Android Applications: Are We There Yet?, The 35th IEEE/ACM International Conference on Automated Software Engineering (ASE 2020), 2020 [pdf] [bib] ESEC/FSE Jiawei Wang, Li Li, Kui Liu, Haipeng Cai, Exploring How Deprecated Python Library APIs are (Not) Handled, The 28th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2020), 2020 [pdf] [bib] ESEC/FSE Jun Gao, Li Li, Pingfan Kong, Tegawendé F. Bissyandé and Jacques Klein, Borrowing Your Enemy’s Arrows: the Case of Code Reuse in Android via Direct Inter-app Code Invocation, The 28th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2020), 2020 [pdf] [bib] WWW Tianming Liu, Haoyu Wang, Li Li, Xiapu Luo, Feng Dong, Yao Guo, Liu Wang, Tegawendé F. Bissyandé and Jacques Klein, MadDroid: Characterising and Detecting Devious Ad Content for Android Apps, The Web Conference 2020 (WWW 2020), 2020 [pdf] [bib] WWW Yangyu Hu, Haoyu Wang, Ren He, Li Li, Gareth Tyson, Ignacio Castro, Yao Guo, Lei Wu, and Guoai Xu, Mobile App Squatting, The Web Conference 2020 (WWW 2020), 2020 [pdf] [bib] ASE Tianming Liu, Haoyu Wang, Li Li, Guangdong Bai, Yao Guo and Guoai Xu, DaPanda: Detecting Aggressive Push Notification in Android Apps, The 34th IEEE/ACM International Conference on Automated Software Engineering (ASE 2019), 2019 [pdf] [bib] ISSTA Pingfan Kong, Li Li, Jun Gao, Tegawendé Bissyandé, Jacques Klein, Mining Android Crash Fixes in the Absence of Issue- and Change-Tracking Systems, The 28th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2019), 2019 [pdf] [bib] ISSTA Haipeng Cai, Ziyi Zhang, Li Li, Xiaoqin Fu, A Large-Scale Study of Application Incompatibilities in Android, The 28th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2019), 2019 [pdf] [bib] ASE Lei Ma, Felix Juefei-Xu, Fuyuan Zhang, Jiyuan Sun, Minhui Xue, Bo Li, Chunyang Chen, Ting Su, Li Li, Yang Liu, Jianjun Zhao, and Yadong Wang, DeepGauge: Multi-Granularity Testing Criteria for Deep Learning Systems, The 33rd IEEE/ACM International Conference on Automated Software Engineering (ASE 2018), 2018 [pdf] [bib] ESEC/FSE Feng Dong, Haoyu Wang, Li Li, Yao Guo, Tegawendé F. Bissyandé, Tianming Liu, Guoai Xu, and Jacques Klein, FraudDroid: Automated Ad Fraud Detection for Android Apps, The 26th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2018) [pdf] [bib] ISSTA Li Li, Tegawendé F. Bissyandé, Haoyu Wang and Jacques Klein, CiD: Automating the Detection of API-related Compatibility Issues in Android Apps, The ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2018) [pdf] [bib] ICSE Kisub Kim, Dongsun Kim, Tegawendé F. Bissyandé, Eunjong Choi, Li Li, Jacques Klein, and Yves Le Traon, FaCoY – A Code-to-Code Search Engine, The 40th International Conference on Software Engineering (ICSE 2018) [pdf] [bib] IMC Haoyu Wang, Zhe Liu, Jingyue Liang, Narseo Vallina-Rodriguez, Yao Guo, Li Li, Juan Tapiador, Jingcun Cao, and Guoai Xu, Beyond Google Play: A Large-Scale Comparative Study of Chinese Android App Markets, The 2018 Intern",
  "content_length": 11032,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:54"
}