{
  "name": "Li Xiao 0004",
  "homepage": "https://www.abdn.ac.uk/people/xiao.li",
  "status": "success",
  "content": "Dr Xiao Li | The University of Aberdeen Dr Xiao Li Dr Xiao LiPhD (Computer Science), MSc (Artificial Intelligence)Lecturer Accepting PhDs About Email Addressxiao.li@abdn.ac.ukSchool/DepartmentSchool of Natural and Computing Sciences Google Scholar Biography I am a Lecturer (Assistant Professor) in the Computer Science department. My research focuses on Artificial Intelligence and Machine Learning models. While studying the theory of how the models work, I'm also interested in the application of these models in different domains. I don't want my students to work too hard to be tired, I want them to have fun with research. Qualifications Ph.D. in Computer Science 2019 - University of Aberdeen Natural Language Process / Natural Language Generation Research Research Overview Basically, my research includes Artificial Intelligence and Machine Learning, and I mainly focus on the time series data. The example domains are: Natural Language (understanding/generation) Music Financial Data Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Accepting PhDsView Research Area Research Specialisms Artificial IntelligenceMachine LearningNatural Language Processing Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Publications Page 1 of 2 Results 1 to 10 of 12 A Comparative Analysis of Metaphorical Cognition in ChatGPT and Human Minds 2025 - PublishedMao, R., Chen, G., Li, X., Ge, M., Cambria, E. Cognitive Computation, vol. 17, 35Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s12559-024-10393-y[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/18a716b4-a207-4fbc-ae0d-298ef8be95ac/downloadMetaPro Online:: A computational metaphor processing online system 2023 - PublishedMao, R., Li, X., Kai, H., Ge, M., Cambria, E. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18653/v1/2023.acl-demo.12[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/7dae2d54-9660-4bab-b530-708664f9360b/downloadAttractiveness analysis for health claims on food packages 2022 - PublishedLi, X., Liang, H., Ryder, C., Jones, R., Liu, Z. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1007/978-981-19-8746-5_16MetaPro:: A Computational Metaphor Processing Model for Text Pre-processing 2022 - PublishedMao, R., Li, X., Ge, M., Cambria, E. Contributions to Journals: Conference Articles[ONLINE] DOI: https://doi.org/10.1016/j.inffus.2022.06.002Improving ultrasound image classification with local texture quantisation 2022 - PublishedLi, X., Liang, H., Nagala, S., Chen, J. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1109/ICASSP43922.2022.9747883Improving Variational Autoencoder for Text Modelling with Timestep-Wise Regularisation 2020 - PublishedLi, R., Li, X., Chen, G., Lin, C. Contributions to Conferences: Oral Presentations[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/4998b7f5-bb3b-412b-906d-98ddb3ed106f/downloadLatent Space Factorisation and Manipulation via Matrix Subspace Projection 2020 - PublishedLi, X., Lin, C., Li, R., Wang, C., Guerin, F. Contributions to Journals: Conference Articles[ONLINE] https://proceedings.icml.cc/book/3538.pdf[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/f93b3cde-fde5-4d7f-9118-8efb60fe792f/download[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/4a96feb8-93ee-41eb-aff1-36020415baf1/downloadA Stable Variational Autoencoder for Text Modelling 2019 - PublishedLi, R., Li, X., Lin, C., Collinson, M., Mao, R. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18653/v1/W19-8673[ONLINE] https://aclweb.org/anthology/[ONLINE] View publication in ScopusA Stable Variational Autoencoder for Text Modelling 2019 - PublishedLi, R., Li, X., Lin, C., Collinson, M., Mao, R. Contributions to Conferences: Oral Presentations[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/71a2c7ea-dee9-4d96-aceb-f0717f8b4f90/downloadA Dual-Attention Hierarchical Recurrent Neural Network for Dialogue Act Classification 2019 - PublishedLi, R., Lin, C., Collinson, M., Li, X., Chen, G. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://www.aclweb.org/anthology/K19-1036.pdf[ONLINE] DOI: https://doi.org/10.18653/v1/K19-1036[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/8d367dfa-014a-4a2f-96a2-94f1aa4b10ae/download[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/2c4d61b7-f512-4b1d-982f-bbdb85e52c33/download[ONLINE] https://www.aclweb.org/anthology/K19-1/ Show 10 | 25 | 50 | 100 results per page Refine Chapters in Books, Reports and Conference Proceedings Conference Proceedings (7) Contributions to Conferences Oral Presentations (2) Contributions to Journals Articles (1) Conference Articles (2) Update",
  "content_length": 5107,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:57"
}