{
  "name": "Li Xiong 0001",
  "homepage": "https://cs.emory.edu/~lxiong",
  "status": "success",
  "content": "Li Xiong - Emory University Li Xiong Home Research Publications Teaching Li Xiong Samuel Candler Dobbs Professor of Computer Science Assured Information Mangement and Sharing (AIMS) Lab Department of Computer Science Department of Biomedical Informatics Emory University Address: 400 Dowman Dr, Atlanta, GA 30322 Office: Mathematics and Science Center E412 Phone: 404-727-0758, Fax: 404-727-5611 Email: lxiong AT emory.edu Google Scholar Profile | DBLP Entry News and Activities March 2025: Honored to be named an AAAS fellow! Truly grateful for my mentors, students, and collaborators who made this possible. (Emory news) October 2024: Our paper \"Cross-silo Federated Learning with Record-level Personalized Differential Privacy\" (paper link) received the distinguished paper award at ACM CCS'24! Many thanks to the students and collaborators and the CCS organizers and reviewers! November 2023: Gave an invited talk on \"Supporting pandemic preparedness with Privacy Enhancing Technology\" at IEEE TPS 2023 July 2023: Gave an invited talk on \"Federated Learning with Personalized and User-level Differential Privacy\" in FL@ICML 2023. Upcoming keynote on \"Harnessing Spatiotemporal Data for Pandemic Preparedness with Privacy-Enhancing Technologies (PETs)\" for SSTD 2023! May 2023: Starting a new project funded by the IARPA HAYSTAC program, led by Novateur and in collaboration with USC, UMN, UCSD, CMU, UCLA, and UC Berkeley. April 2023: Congratulations to Fereshteh Razmi for defending her PhD thesis and Matt Zhang, Kevin Qin, Mike Lin, Jack Wessell for defending their honor thesis's with highest honor! February 2023: Starting a new project on Understanding Bias in AI Models for the Prediction of Infectious Disease Spread funded by NSF and CSIRO, led by Prof. Andreas Zufle at Emory and Prof. Flora Salim at UNSW Sydney. [Archive of News and Activiities] Brief Bio Li Xiong is a Samuel Candler Dobbs Professor of Computer Science and Professor of Biomedical Informatics at Emory University. She held a Winship Distinguished Research Professorship from 2015-2018. She has a Ph.D. from Georgia Institute of Technology, an MS from Johns Hopkins University, and a BS from the University of Science and Technology of China. Her research lab, Assured Information Management and Sharing (AIMS), conducts research on trustworthy and privacy-enhancing AI solutions for healthcare, public health, and spatial intelligence. She is recognized as an IEEE fellow (2022) and AAAS fellow (2024) for her contributions to privacy-preserving and secure data sharing and analytics. She has published over 200 papers and received seven best paper or runner up awards. Her research has been supported by both governments (NSF, NIH, IARPA, AFOSR, PCORI) and industry/foundations (Mitsubishi, Cisco, AT&T, Google, IBM). She has served and serves as associate editor for IEEE TKDE, IEEE TDSC, and VLDBJ, general chair for ACM SIGSPATIAL 2024, CIKM 2022, program chair for IEEE BigData 2020 and ACM SIGSPATIAL 2020, 2018, and program vice-chair regularly for VLDB, SIGMOD, and ICDE.",
  "content_length": 3063,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:56"
}