{
  "name": "Li Yang 0008",
  "homepage": "https://wmich.edu/geography/directory/yang",
  "status": "success",
  "content": "Li Yang | School of Environment, Geography and Sustainability | Western Michigan University Skip to main content School of Environment, Geography, and Sustainability Skip to content School of Environment, Geography, and SustainabilityWestern Michigan UniversityKalamazoo MI 49008-5424 USA(269) 387-2716 Li Yang Li Yang Pronouns: She/Her/Hers Associate Professor Office: (269) 387-3414 Fax: (269) 387-3442 Send an email Location: 3519 Wood Hall, Mail Stop 5424 Mailing address: School of Environment, Geography, and Sustainability Western Michigan University 1903 W Michigan Ave Kalamazoo MI 49008-5424 USA View full size image Education: Ph.D., Planning, University of Waterloo, 2007M.S., Statistics, Yunnan University, 1997B.S., Statistics, Yunnan University, 1994 Teaching Interests: Tourism Planning and DevelopmentTourism GeographyHuman GeographyUrban, Regional, and Environmental Planning Research Interests: Tourism Planning and MarketingEthnic and Cultural TourismTourism Analysis and Forecasting Bio: Dr. Li Yang is an active researcher in the field of travel and tourism. Her research career has focused on tourism planning and development issues with an emphasis on ethnic tourism. Subjects have ranged from analysis of tourism impacts, destination planning and related socio-cultural issues, and tourism demand management, to rural tourism examination. She has been involved in many research projects and has obtained university and governmental grants and awards. She has published over 40 refereed articles in leading international tourism and geography journals. She has also served on the editorial board for the International Journal of Tourism Anthropology and has been invited to serve as an expert reviewer for numerous well-respected academic journals. Dr. Yang enjoys teaching and mentoring students, and considers both important components of her career. Her goal as a teacher is to provide students with a solid understanding of fundamental theories and concepts complemented by independent problem-solving and critical-thinking skills. She encourages students to learn through hands-on experience with laboratory exercises, field data collection, independent and group research projects. She has taught and developed new teaching materials and pedagogy for five major tourism courses at both the undergraduate and graduate levels at WMU.",
  "content_length": 2361,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:57"
}