{
  "name": "Li Zhang 0013",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/li-zhang",
  "status": "success",
  "content": "Li Zhang - Royal Holloway Research Portal Li Zhang Professor Centre for Intelligent SystemsCentre for Reliable Machine LearningProfessor, Department of Computer Science EmailLi.Zhangrhul.acuk TW20 0EX Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 67 Article 32 Conference contribution 4 Chapter 1 Book Research output per year Research output per year A Novel Lift Adjustment Methodology for Improving Association Rule InterpretationSowan, B., Zhang, L., Matar, N., Zraqou, J., Omar, F. & Alnatsheh, A., Jun 2025, In: Decision Analytics Journal. 15, 17 p., 100582.Research output: Contribution to journal › Article › peer-review Open AccessFile 5 Downloads (Pure) A Novel Sonar Image Preprocessing Method for AUV Positioning Based on Underwater SLAMHuang, H., Zhang, M., Zhang, L., Wang, D. & Wang, B., 4 Aug 2025, (E-pub ahead of print) In: IEEE Transactions on Instrumentation and Measurement. 74, p. 14Research output: Contribution to journal › Article › peer-review Open AccessFile 1 Downloads (Pure) Application of X-ray sorting and priming improves the germination performance of low-quality seed fractions of the Papaccella pepper landraceGranata, A., Perez , M., Steinbrecher, T., Capozzi, F., Kondrotas, K., Zhang, L., Spagnuolo, V. & Leubner-Metzger, G., 3 Sept 2025, (E-pub ahead of print) In: Scientia Horticulturae. 350, 114370.Research output: Contribution to journal › Article › peer-review Open Access Audio-Visual Emotion Classification Using Reinforcement Learning-Enhanced Particle Swarm OptimisationKondrotas, K., Zhang, L., Lim, C. P., Asadi, H. & Yu, Y., 21 Jul 2025, (E-pub ahead of print) In: IEEE Transactions on Affective Computing. p. 18Research output: Contribution to journal › Article › peer-review Open AccessFile 5 Downloads (Pure) Auxiliary Generative Adversarial Networks with Iliustration2Vec and Q-Learning based Hyperparameter Optimisation for Anime Image SynthesisSedov, V. & Zhang, L., 20 Jan 2025, IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE, p. 4396-4403 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 19 Downloads (Pure) View all 104 research outputs Projects 2 Finished 3 Active Projects per year KTP between ROYAL HOLLOWAY AND BEDFORD NEW COLLEGE and DDM HEALTH LIMITEDZhang, L. (PI) & Augustin, H. (CoI)Innovate UK1/09/25 → 31/08/27Project: Research Royal Holloway and Bedford New College and Rubberatkins Limited KTP 23_24 R1Zhang, L. (PI) & Bryan, M. (CoI)Innovate UK1/02/24 → 31/01/26Project: Research Automated Classification and Identification of Plant Specimens of the Royal Botanic Gardens Kew Using Imaging Processing, AI and Machine LearningZhang, L. (PI)23/09/22 → 30/09/26Project: Research Innovate UK KTP Capacity BuildingLynch, H. (PI), Fitzgerald, R. (CoI), Smith, M. (CoI) & Zhang, L. (CoI)1/01/23 → 31/03/23Project: Other Improving Long COVID patient recovery through voice-based AI symptom tracking and personalised rehabilitationZhang, L. (PI) & Wu, P. (CoI)Innovate UK1/10/22 → 30/09/23Project: Research",
  "content_length": 3674,
  "method": "requests",
  "crawl_time": "2025-12-01 13:46:57"
}