{
  "name": "Liam Paull",
  "homepage": "http://people.csail.mit.edu/lpaull",
  "status": "success",
  "content": "Home | Liam Paull Liam Paull Associate Professor DIRO (Computer Science) Université de Montréal Director Duckietown Foundation CIFAR AI Chair Holder Core member of Mila Office: AA3341 Ph: 514-343-6111 ext. 26949 @: paulll@iro.umontreal.ca [Google Scholar] [Twitter] [Github] [CV] About Me I am an assistant professor at the Université de Montréal. I co-lead the Montreal robotics and embodied AI lab. I am also affiliated with Mila and I hold a CIFAR AI Chair. In general, my research lab is focussed on building representations of the world (such as for simultaneous localization and mapping), modelling of uncertainty, and building better workflows to teach robotic agents new tasks (such as through simulation or demonstration). Here’s a link to my official short bio. I am also a director of the Duckietown Foundation. We are always looking for more contributors please contact us for more info. Interested to join my group? For students please apply through Mila admissions For interns/visitors, please fill out the intern application form For postdocs, please fill out the postdoc application form Previously, I was a research scientist in the Distributed Robotics Lab led by Prof. Daniela Rus where I led the CSAIL/Toyota Autonomous Car Project. Previously to that I was a Postdoc in the Marine Robotics Group headed by Prof. John J. Leonard. I completed my PhD at the University of New Brunswick under the co-supervision of Profs. Mae Seto, Liuchen Chang, Howard Li. Courses I Teach IFT 6757-Autonomous Vehicles (Duckietown) IFT 2245-Systèmes d’Exploitations (Operating Systems) Recent News Sep. 6 2022 - I don't update this very often. For up to date news please visit our group website Dec. 8, 2019 - I have received a CIFAR Canadian AI Chair Nov. 18, 2019 - I will serve as the program co-chair for the The 17th Conference on Computer and Robot Vision Oct. 20, 2019 - The AI Driving Olympics will be at NeurIPS again in 2019 Sept. 7, 2019 - Our paper Active Domain Randomization was accepted at CoRL [see all news] Copyright © 2020 All Rights Reserved.",
  "content_length": 2063,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:03"
}