{
  "name": "Liam Peyton",
  "homepage": "http://www.site.uottawa.ca/~lpeyton",
  "status": "success",
  "content": "Liam Peyton, Ph.D., P.Eng Liam Peyton, P.Eng., Ph.D. Professor Emeritus / Professeur Émérite B.Sc., McGill, 1984 M.Sc. Stanford, 1989 Ph.D. Aalborg, 1996 Retired Professor from the School of Engineering Design and Teaching Innovation at the University of Ottawa. Program Administration In the past, I was Vice-Dean Graduate Studies for the Faculty of Engineering (2018-22), Director of Graduate Programs in Digital Transformation and Innovation (2013-2016) and Associate Director for Software Engineering (2012-2016). Research Interests Here is a list of my publications as well as a link to my PhD thesis on Understanding Software Automation. My main area of interest is model-driven data integration and mobile app development to support business processes and performance management for healthcare and other industries. This includes user-experience design, cloud computing, data analytics, quality assurance, content management and privacy. I also mentor and do basic research in digital transformation, technology innovation, experiential learning, and software engineering. Affiliations Member of the Graduate Engineering Students - Professional Development Club Member of the Centre for Indigenous Community Infrastructure Member of the program committee for Health Informatics Member of the IBM-Telfer Center For Business Analytics and Performance Teaching Students are encouraged to join the Graduate Engineering Students - Professional Development Club. In the past I have taught Graduate Student Professional Development Workshops, GNG 5902 / ELG 5902, SEG4910 / SEG4911, EBC8101 / 8102, EBC6230, GNG1106, CSI1390, CSI2911, SEG4105, SEG4189, SEG4289, CSI5380, CSI5389. Industry Experience 15 years as an independent consultant with my own company, The MirrorWorks Software Inc., specializing in innovation, knowledge transfer, and mentoring. My projects addressed specific industries (government, healthcare, telecommunications, and online-retail) as they adopted new technology to automate and manage business processes. I mentored several teams in the adoption of agile development processes (Scrum.) School of Engineering Design and Teaching Innovation (SEDTI), Faculty of Engineering, University of Ottawa 801 King Edward Avenue Ottawa, Ontario, Canada, K1N 6N5 Office: Minto Sports Complex Building, Room N205 Email: lpeyton@uottawa.ca Last major modification: December 2023; minor updates regularly.",
  "content_length": 2416,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:01"
}