{
  "name": "Liang Zhao 0002",
  "homepage": "https://cs.emory.edu/~lzhao41",
  "status": "success",
  "content": "Dr. Liang Zhao – AI Researcher About Me I am an Associate Professor in the Department of Computer Science at Emory University. I obtained Ph.D. degree as an Outstanding Doctoral Student in the Department of Computer Science at Virginia Tech in 2017. My research spans machine learning and artificial intelligence for complex data including networks, spatial, temporal, and textual data. I have authored over two hundred papers in top-tier venues such as KDD, NeurIPS, ICLR, AAAI, and IJCAI. Our research is generously supported by federal agencies such as NSF (CAREER, III, IIBR, CRII, IUCRC, etc.), NIH, and industrial sponsors such as Amazon, Meta, Merck, NVidia, Cisco, NEC Lab, Oracle, and Bank of America. GraphRAG: LLMs for Networked Documents [GRAG][CG-RAG] Foundation models for geospatial reasoning [Spatial-RAG] Explanation-guided Learning [2D images, 3D images, texts, graphs, spatiotemporal] Geometric Shape Representation Learning [Spatial networks, periodic graphs, trajectories, polygon, polyhedron, geometric trees] Graph Neural Networks for Network Science [Influence Maximization, Source Localization, Network Interdiction] Accelerating Large Language Models [SparseLLM, FedSpaLLM, SpeedupLLM] News&Highlights (11/25) Our paper on Transferrable Deep Clustering has won CIKM 2025 Best Paper Runner-up Award! (08/25) Our paper on EMBERS societal event forecasting system has won KDD 2025 Test of Time Award! (06/25) Our LabBot is online, feel free to chat and know us better! (05/25) Our LLM Domain Specialization paper has been accepted by CSUR (IF: 23.2)! (05/25) Three papers in KDD 2025 and one paper in ACL 2025 (04/25) Will give a tutorial in IJCAI 2025 on Advances of RAG (03/25) Will give an invited talk in Oak Ridge National Laboratory (03/25) Will give an invited talk in INFORMS 2025 (01/25) Will serve as Area Chairs of NeurIPS'25, ICML'25, and ICLR'25 Our work can give concise textual explanations on graph predictions, see our ACL'25 paper: GraphNarrator We discovered that LLM reasoning can become faster while using, check our recent investigation: Can Practice Make LLM Reasoning Faster? We debuted the RAG for spatial databases: Spatial-RAG: Spatial Retrieval Augmented Generation for Real-World Spatial Reasoning Questions Our survey paper Domain Specialization as the Key to Make Large Language Models Disruptive: A Comprehensive Survey has been cited by Economic Report of the President of the U.S. Our survey paper about LLM efficiency: Beyond Efficiency: A Systematic Survey of Resource-Efficient Large Language Models Selected Publications (Full list in Google Scholar) 2026 TKDD Xieojie Guo, Yuanqi Du, Zheng Zhang, and Liang Zhao. Efficient Deep Generative Models for Spatial Networks via Spanning Tree Sampler. Transactions on Knowledge Discovery from Data (TKDD), accepted, to appear. [paper][code] WSDM 2026 Yuntong Hu, Junxiang Wang and Liang Zhao. Network Tomography with Path-Centric Graph Neural Network. TThe ACM Web Search and Data Mining (WSDM 2026), accepted, to appear. [paper][code] 2025 NeurIPS 2025 Zekun Cai, Yiheng Yao, Guangji Bai, Renhe Jiang, Xuan Song, Ryosuke Shibasaki, and Liang Zhao. Continuous Domain Generalization. Thirty-ninth Annual Conference on Neural Information Processing Systems (NeurIPS 2025) [paper][code] CIKM 2025 Mengdan Zhu, Raasikh Kanjiani, Jiahui Lu, Andrew Choi, Qirui Ye and Liang Zhao. LatentExplainer: Explaining Latent Representations in Deep Generative Models with Multimodal Large Language Models. The Conference on Information and Knowledge Management (CIKM 2025). [paper][code] CIKM 2025 Zheng Zhang and Liang Zhao. Transferable Deep Clustering Model. The Conference on Information and Knowledge Management (CIKM 2025). [Best Paper Runner-Up Award] [paper][code] CIKM 2025 Zheng Zhang, Yuntong Hu, Bo Pan, Chen Ling and Liang Zhao. TAGA: Text-Attributed Graph Self-Supervised Learning by Synergizing Graph and Text Mutual Transformations. The Conference on Information and Knowledge Management (CIKM 2025). [paper][code] CIKM 2025 Xiongxiao Xu, Canyu Chen, Yueqing Liang, Baixiang Huang, Guangji Bai, Liang Zhao and Kai Shu. SST: Multi-Scale Hybrid Mamba-Transformer Experts for Time Series Forecasting. The Conference on Information and Knowledge Management (CIKM 2025). [paper][code] CIKM 2025 Zhijie Lin, Zhuofeng Li, Chenglei Dai, Wentian Bao, Shuai Lin, Enyun Yu, Haoxiang Zhang and Liang Zhao. GReF: A Unified Generative Framework for Efficient Reranking via Ordered Multi-token Prediction. The Conference on Information and Knowledge Management (CIKM 2025). [paper][code] JBI Hejie Cui, Jiaying Lu, Ran Xu, Shiyu Wang, Wenjing Ma, Yue Yu, Shaojun Yu, Xuan Kan, Chen Ling, Liang Zhao, Zhaohui S. Qin, Joyce C. Ho, Tianfan Fu, Jing Ma, Mengdi Huai, Fei Wang, Carl Yang. A Review on Knowledge Graphs for Healthcare: Resources, Applications, and Promises. Journal of Biomedical Informatics (Impact Factor: 6.317) [paper][code] ACL 2025 Bo Pan, Zhen Xiong, Guanchen Wu, Zheng Zhang, Yifei Zhang, Yuntong Hu, Liang Zhao. GraphNarrator: Generating Textual Explanations for Graph Neural Networks. The 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025) - Main Track, accepted. [paper][code] CSUR Author Team. Domain Specialization as the Key to Make Large Language Models Disruptive: A Comprehensive Survey. ACM Computer Surveys (CSUR), (Impact Factor: 23.8), accepted. [paper][code] KDD 2025 Lei Zhang, Zhiqian Chen, Chang-Tien Lu, Liang Zhao. Network Interdiction Goes Neural. 31st SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2025) - Research Track, accepted. [paper][code] KDD 2025 Yifei Zhang, James Song, Siyi Gu, Tianxu Jiang, Bo Pan, Guangji Bai, Liang Zhao. Saliency-Bench: A Comprehensive Benchmark for Evaluating Visual Explanations. 31st SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2025) - Datasets and Benchmarks Track, accepted. [paper][code] KDD 2025 QAC Team. An Instructible Chemist-AI Alignment Framework for Generating Quaternary Ammonium Compound Structures. 31st SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2025) - Applied Data Science Track, accepted. [paper][code] KAIS Lei Zhang, Qisheng Zhang, Zhiqian Chen, Yanshen Sun, Chang-Tien Lu, and Liang Zhao. Implicit Graph Neural Network for Deep Graph Transformation. Knowledge and Information Systems (KAIS), (Impact Factor: 2.5), accepted. [paper][code] SIGIR 2025 Yuntong Hu, Zhihan Lei, Zhongjie Dai, Allen Zhang, Abhinav Angirekula, Zheng Zhang, Liang Zhao. CG-RAG: Research Question Answering by Citation Graph Retrieval-Augmented LLMs. The 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025), accepted. [paper][code] ICLR 2025 Dazhou Yu, Genpei Zhang, Liang Zhao. PolyhedronNet: Representation Learning for Polyhedra with Surface-attributed Graph. The International Conference on Learning Representations (ICLR 2025), accepted. [paper][code&data] TPAMI Ming Jin, Guangsi Shi, Yuan-Fang Li, Bo Xiong, Tian Zhou, Flora D Salim, Liang Zhao, Lingfei Wu, Qingsong Wen, Shirui Pan. Towards Expressive Spectral-Temporal Graph Neural Networks for Time Series Forecasting. IEEE Transactions on Pattern Analysis and Machine Intelligence (impact factor: 20.8), in press. [paper][code&data] NAACL 2025 Guangji Bai, Yijiang Li, Zilinghan Li, Liang Zhao, Kibaek Kim. FedSpaLLM: Federated Pruning of Large Language Models. The Nations of the Americas Chapter of the Association for Computational Linguistics (NAACL 2025), main track, accepted. [paper][code] NAACL 2025 Yuntong Hu, Zhihan Lei, Zheng Zhang, Bo Pan, Chen Ling, Liang Zhao. GRAG: Graph Retrieval-Augmented Generation. The Nations of the Americas Chapter of the Association for Computational Linguistics (NAACL 2025), findings track, accepted. [paper][code] TSAS Liming Zhang, Jonathan Mbuya, Liang Zhao, Dieter Pfoser, Antonios Anastasopoulos. End-to-end Trajectory Generation - Contrasting Deep Generative Models and Language Models. ACM Transactions on Spatial Algorithms and Systems [paper][code] SDM 2025 Bai, Guangji, Ziyang Yu, Zheng Chai, Yue Cheng, and Liang Zhao. \"Staleness-Alleviated Distributed GNN Training via Online Dynamic-Embedding Prediction.\" The SIAM International Conference on Data Mining (SDM25) (Acceptance rate: 26.7%), accepted. [paper][code] 2024 NeurIPS 2024 Guangji Bai, Yijiang Li, Chen Ling, Kibaek Kim, and Liang Zhao. \"SparseLLM: Towards Global Pruning of Pre-trained Language Model\", Thirty-eighth Annual Conference on Neural Information Processing Systems (NeurIPS 2024), acceptance rate: 25.8%, accepted. [paper][code] NeurIPS 2024 Zekun Cai, Guangji Bai, Renhe Jiang, Xuan Song, and Liang Zhao. \"Continuous Temporal Domain Generalization\", Thirty-eighth Annual Conference on Neural Information Processing Systems (NeurIPS 2024), acceptance rate: 25.3%, accepted. [paper][code] NeurIPS 2024 Zhuofeng Li, Zixing Gou, Xiangnan Zhang, Zhongyuan Liu, Sirui Li, Yuntong Hu, Chen Ling, Zheng Zhang, and Liang Zhao. \"TEG-DB: A Comprehensive Dataset and Benchmark of Textual-Edge Graphs\", Thirty-eighth Annual Conference on Neural Information Processing Systems (NeurIPS 2024), Datasets and Benchmark track, acceptance rate: 25.3%, accepted. [paper][code] TKDE Tanmoy Chowdhury, Yuyang Gao, Liang Zhao. Deep Multi-task Learning for Spatio-Temporal Incomplete Qualitative Event Forecasting. IEEE Transactions on Knowledge and Data Engineering (TKDE), (Impact Factor: 9.235), accepted, 2024 [paper][code] FBD Guanchen Wu, Chen Ling, Ilana Graetz, Liang Zhao. Ontology Extension by Online Clustering With Large Language Model Agents. Frontiers in Big Data (Impact Factor: 2.4), accepted. [paper][code] ICDM 2024 Mingchen Li, Chen Ling, Rui Zhang and Liang Zhao. \"Zero-Shot Link Prediction in Knowledge Graphs with Large Language Models, the 24th IEEE International Conference on Data Mining (ICDM 2024), Short Paper, (Acceptance Rate: 19.5%) accepted, 2024. [paper][code] SIGSPATIAL 2024 Zheng Zhang, Hossein Amiri, ",
  "content_length": 57540,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:04"
}