{
  "name": "Liang Wang 0001",
  "homepage": "http://www.cbsr.ia.ac.cn/users/liangwang",
  "status": "success",
  "content": "Homepage of Liang Wang Welcome to contact for any problem National Lab of Pattern Recognition Institute of Automation Chinese Academy of Sciences, Beijing 100190, China Fax: +86 (0)10 6255 1993 Email: wangliang at nlpr.ia.ac.cn Http: //www.cbsr.ia.ac.cn/users/liangwang/ Created by L. Wang on Feb. 10, 2007 Last updated on 08 Aug, 2010 Copyright © 2007, All Rights Reserved search engine optimization Liang Wang, Professor National Lab of Pattern Recognition Institute of Automation, Chinese Academy of Sciences Liang Wang received the PhD degree in Pattern Recognition and Intelligent System from the National Laboratory of Pattern Recognition (NLPR), Institute of Automation, Chinese Academy of Sciences (CAS), China, in 2004. After graduation, he has worked as a Research Assistant at the Imperial College London, United Kingdom and Monash University, Australia, and a Research Fellow at the University of Melbourne, Australia, respectively. Before he returned back to China, he was a Lecturer with the Department of Computer Science, University of Bath, United Kingdom. Currently, he is a Professor of CAS at the Institute of Automation, Chinese Academy of Sciences, P. R. China. His major research interests include machine learning, pattern recognition, computer vision, multimedia processing, and data mining. He has widely published at highly-ranked international journals such as IEEE TPAMI, IEEE TIP, IEEE TKDE, IEEE TCSVT, IEEE TSMC, CVIU, and PR, and leading international conferences such as CVPR, ICCV and ICDM. He has obtained several honors and awards such as the Special Prize of the Presidential Scholarship of CAS and the Research Commendation from University of Melbourne in recognition of Excellent Research. He is currently a Senior Member of IEEE (Institute of Electrical and Electronics Engineers), as well as a member of IEEE Computer Society, IEEE Communications Society and BMVA (British Machine Vision Association). He is serving with more than 20 major international journals and more than 40 major international conferences and workshops. He is an associate editor of IEEE Transactions on Systems, Man and Cybernetics ¨C Part B, International Journal of Image and Graphics (WorldSci), International Journal of Signal Processing (Elsevier), Neurocomputing (Elsevier), and International Journal of Cognitive Biometrics (Inderscience). He is a leading guest editor of 3 special issues appearing in PRL (Pattern Recognition Letters), IJPRAI (International Journal of Pattern Recognition and Artificial Intelligence) and IEEE TSMC-B, as well as a co-editor of 5 edited books. He has also co-chaired 8 international workshops. Detailed CV may be found here. Recruitment Detailed ads may be found here Always interested in good postdocs, PhD students, and internship students - send me an email with your CV if you think you have outstanding potential. Call for Papers/Chapters International Workshop on Sparse Representation for Event Detection in Multimedia (SRED2011) (Deadline: 06-19-2011) International Workshop on Video Event Categorization, Tagging and Retrieval (VECTaR2011) (Deadline: 07-11-2011) International Workshop on Machine Learning for Vision-based Motion Analysis (MLVMA2011) (Deadline: 03-10-2011) Image and Vision Computing Special issue on Machine learning in motion analysis (Deadline: 12-01-2011) Pattern Recognition Special issue on Sparse representation for event recognition in video surveillance (Deadline: 03-15-2012) Computer Vision and Image Understanding Special issue  on Semantic understanding of human behaviours in image sequences (Deadline: 11-01-2010) What¡¯s new Dataset Fudan pedestrian dataset is available publicly from Aug 2010 Springer Book entitled ¡°Machine learning for vision-based motion analysis¡± was released in Dec 2010 Book entitled ¡°Video search and mining¡± was released in Mar 2010 IGI Global Book entitled ¡°Machine learning for human motion analysis: theory and practice¡± was released in Dec 2009 Book entitled ¡°Behavioral biometrics for human identification: intelligent applications¡± was released in Aug 2009",
  "content_length": 4095,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:02"
}