{
  "name": "Liang Zheng 0001",
  "homepage": "https://cs.anu.edu.au/people/liang-zheng",
  "status": "success",
  "content": "Liang Zheng | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Research I have broad interest in computer vision. I am working with a group of talented students designing protocols and architectures to discover the underlying patterns and laws of data and algorithms. Biography I am a Senior Lecturer in the School of Computing, The Australian National University. I hold a Computer Science Futures Fellowship and have received an ARC DECRA Fellowship. I received my PhD (EE) from Tsinghua University in 2015, and my Bachelor of Science (Life Science) from Tsinghua University in 2010. I was/am an Area Chair for CVPR 2021, ECCV 2020, ACM Multimedia 2020-2021, etc, and an Associate Editor for IEEE T-CSVT. I am working on interesting topics in computer vision: applications including person re-identification and medical image understanding; fundamental problems including dataset-level learning, deep learning and synthetic data analysis. I am looking for PhD students with excellent English ability, coding ability, and motivation. A potential PhD student should have high GPA and rich experience in research. If you are a master student and intend to apply for a PhD, it is best you have publications in top venues like CVPR/ICCV/ECCV. If you are interested in a visiting scholar position, please be kindly reminded that I do not have funding for it. If you can secure externel funding support and if you are highly motivated and experienced in research, please drop me an email. To ANU students. If you are an ANU undergraduate or postgraduate student looking for an individual research project, please be advised that I usually have 2-3 project students each year and that 24-unit projects are preferred. Please email me to arrange a discussion beforehand. Activities & Awards Visit my personal homepage at https://zheng-lab-anu.github.io/ bars search times",
  "content_length": 1993,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:05"
}