{
  "name": "Libertario Demi",
  "homepage": "https://sites.google.com/view/drlibertariodemi/home",
  "status": "success",
  "content": "Prof. Libertario Demi personal websiteSearch this siteEmbedded FilesSkip to main contentSkip to navigationScopus - Google Scholar - IEEE Xplore - American Institute of Physics - PubMed - LinkedIn - Research Gate Since I was a kid I have been always fascinated by science. It actually all started with dinosaurs and minerals, but over the years the passion for science grew and brought me to study first telecommunication engineering and applied physics later on. I also enjoy traveling and getting in touch with new cultures very much, and found a way to combine all these interests by working in many different places around the world: at universities (in Italy, Australia, USA, South Korea, and the Netherlands), research institutes and high-tech companies (in Belgium), as well as at NPOs (in Burkina Faso, Africa). I always seek innovation and focus on achieving results that will have an impact on people and society.Over the years I successfully focused my research on ultrasound technologies; achieving more than 200 peer-reviewed publications (105 international journal papers, 2 book chapters, 97 proceedings), 2 patents, 5 international best-poster awards, and many contributions to top international conferences, including invited talks. I am Fellow of the Acoustical Society of America, IEEE Senior Member, Deputy Editor of the Ultrasound Journal (Springer Nature), Associate Editor for the Journal of the Acoustical Society of America, Editorial Board member of Ultrasonics and served (from 2021 to 2025) as member of the Medical Ultrasound Technical Program Committee of the IEEE Ultrasonics Symposium, and (from 2018 to 2023) as Biomedical Acoustics Technical Program Organizer (TPO) for the Meetings of the Acoustical Society of America.I am an Associate Professor at the University of Trento, Department of Information Engineering and Computer Science, Head of ULTRa (Ultrasound Laboratory Trento) and Adjunct Professor at the Queensland University of Technology, Australia . My research activity focuses on signal processing, image formation and image analysis of mostly medical imaging applications of ultrasound technologies. I am now particularly active on lung ultrasound imaging, focusing on the development of a  method fully dedicated to the diagnosis and monitoring of lung diseases (#lungultrasound).  Moreover I am deeply interested in ultrasonic beam-forming algorithms of new generation, and ultrasound propagation modelling. In the pandemic of respiratory disease caused by a novel coronavirus, I have led the Italian COVID-19 Lung UltraSound (ICLUS) project: an international and multidisciplinary effort focusing on the design and clinical implementation of a computer aided lung ultrasound system developed for patients affected by COVID-19.  I have been visiting professor at KAIST (in 2023) and Stanford University (in 2022). I have also been working at the Biomedical Photonic Imaging Group, at the University of Twente, as visiting scholar and university researcher, on the design, development and testing of an ultrasound scanner for breast tomography of new generation which combines photoacoustics and (LIUS) ultrasound technologies. Previously I have been working on PMUT sensor design and image-formation-algorithm development for SODAR applications in life science and integrated systems technology as R&D Engineer at IMEC and Ultrasound consultant at TMC. Also, I have worked on quantitative ultrasound imaging for prostate cancer detection and on inaccessible-environment mapping at the Eindhoven University of Technology, as a PostDoc,  completed a PhD in applied physics on ultrasound propagation modeling at the Delft University of Technology, and obtained a master degree (cum laude) in telecommunication engineering at the University of Pisa.All that is straight (linear) lies, all truth is crooked (nonlinear) Inspired by “Alles Gerade l¨ugt, ... alle Wahrheit ist krumm”. [Friedrich Nietzsche, Also sprach Zarathustra]Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4019,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:05"
}