{
  "name": "Libo Zhang 0001",
  "homepage": "http://people.ucas.ac.cn/~zhanglibo",
  "status": "success",
  "content": "张立波-中国科学院大学-UCAS [中文] [English] 招生信息 出版信息 基本信息 张立波 研究员 博士生导师长期从事人工智能算法与应用的教学和科研，研究方向包括复杂场景下的目标检测与跟踪、长视频视觉定位、医学语义信息挖掘，深入探索了视觉内部语义关联和外部信息引导下的视频理解方法，提出了一系列有效提升目标检测、目标跟踪和视频生成等基础任务的算法框架，并开展了在基础科学中的实际应用，在协和、朝阳医院、阜外等多家医院实现了通过人工智能技术进行特定领域的医学辅助诊断。发表TPAMI、IJCV、NuerIPS、CVPR、ICCV等人工智能领域国际顶级会议/期刊论文80余篇，主持国家自然科学基金、国家揭榜挂帅、院重点研究计划等项目，曾获得中国人工智能学会学术奖励、中国科学院朱李月华奖，担任The Innovation期刊信息学方向编委，中国科学院信息技术与人工智能专委会委员，同时是中国作家协会会员和中国科普作家协会会员，出版图书获得科技部全国优秀科普图书、中国科学院优秀科普作品、中国龙奖提名，入选国家农家书屋推荐书目和中国计算机学会科普阅读推荐图书。电子邮件：libo@iscas.ac.cn研究方向：人工智能，计算机视觉，代码理解通信地址： 中关村南四街4号中国科学院软件研究所​ 最新动态 2025年6月， 2篇学术论文被被ICCV 2025接收2025年3月， MMInvertFill被IJCV接收2024年10月，VastTrack for Vast Category Visual Tracking被NIPS 2024接收2024年07月，Semantic Multi-Object Tracking被ECCV 2024接收2024年06月，MGA被T-PAMI接收2024年02月，2篇学术论文被CVPR 2024接收2024年01月，MaGIC被ICLR 2024接收2023年09月，GEBD被IJCV接收2023年07月，PIDray被IJCV接收2023年07月，4篇学术论文被ICCV 2023接收2023年03月，1篇学术论文被CVPR 2023接收2022年11月，1篇学术论文被IJCV接收2022年07月，3篇学术论文被ECCV 2022接收2022年06月，CVPR'22 LOVEU Generic Event Boundary Captioning竞赛第一名2022年03月，3篇学术论文被CVPR 2022接收2021年10月，2篇学术论文被ICCV 2021接收‍​ 招生信息 本课题组招收有志于从事科研事业的硕士、博士、实习生。目前课题组项目主要为面向国家需求和国际前沿的科学研究项目，部分为大型合作企业的应用项目。主要方向为人工智能，计算机视觉，代码理解。建议联系与报考之前，通过近几年发表的论文，对组内的研究方向和内容进行简单了解。研究组会对有志于科研的同学进行1对1的科研指导，大部分学生在入学前能够投出或发表一篇顶级科研成果，但这意味着你将投入大量的时间和辛苦的汗水，选择我们，科研和学术工作将几乎占据你整个学生生涯，建议慎重考虑后联系。由于名额有限，为了节约彼此时间，将沟通和面试工作约束在合理范围内，请仔细阅读招生要求后联系报考。保研/报考学生满足中国科学院大学和中国科学院软件研究所的基本要求，参见相关网站招生简章。科研工作涉及阅读大量英文文献，撰写论文需要具备良好的写作能力，出国交流需要一定的口语能力，因此，组内要求6级英语成绩500分以上（专业技术能力特别优异者可适当放宽）。组内硕士生大多数会选择转博，由于名额极其有限，因此对于转博/普博的学生要求至少发表过一篇学生第一作者的CCF A类论文。联系时间：根据之前经验，组内名额建议在大二下学期/大三上学期进行提前联系，我们会及时组织组内的面试考核，尽早确定保研指标。当然，后续也需要顺利通过软件所组织的保研面试。工作环境：部门配备了良好的学习环境，组内具有出色的科研氛围，同时提供了充足的计算资源。关于生源：不设置本科/硕士的学校限制，也希望你相信通过自己的努力可以改变命运。认真的态度，全身心的投入，极致的热爱，都远比本科高校是哪里重要的多。关于诚信：如果明确拿到组里的保研名额，后续无论有多么优秀的学生出现，也不会对之前的同学造成影响。也希望保研同学慎重考虑，信守承诺，因为后续放弃指标会对我们造成很大的影响。通过保研的学生，组内鼓励大家提前学习相关基础知识后，一般要求提前进入实验室，且本科毕业设计需与硕士方向紧密相关。联系方式：如果读完以上信息，你依然决心从事科研事业，可以将简历发至libo@iscas.ac.cn招生指标：组内在中国科学院软件所/中国科学院大学南京学院/中国科学院杭高院均有招生指标，来信联系时请注明报考选择（报考学生会首先进行一轮计算机基础的远程笔试）。Starting from 2023, a PhD student in my group must gained at least 7 points and a master student must gained 3 points before defending his/her thesis. Following is the detailed caculation:A+（3.0 points）: T-PAMI/IJCVA  （2.5 points）: CVPR/ICCV/ECCV/NIPS/ICML/ICLR, T-IPA-（2.0 points）: AAAI/IJCAI, T-MM/T-CSVT/T-NNLS/T-ITS/PR/CVIUB  （1.5 points）: ICME/BMVC/ICRA/IROS‍​ 出版信息 2025[CCF A]Attention to Trajectory: Trajectory-Aware Open-Vocabulary Tracking.The 2025 IEEE International Conference on Computer Vision (ICCV 2025).Yunhao Li, Yifan Jiao, Dan Meng, Heng Fan, Libo Zhang*.(Corresponding Author)[CCF A]GSOT3D: Towards Generic 3D Single Object Tracking in the Wild.The 2025 IEEE International Conference on Computer Vision (ICCV 2025).Yifan Jiao, Yunhao Li, Junhua Ding, Qing Yang, Song Fu, Heng Fan, Libo Zhang*.(Corresponding Author)[CCF A]High-Fidelity Image Inpainting with Multimodal Guided GAN Inversion. International Journal of Computer Vision.Libo Zhang, Yongsheng Yu, Jiali Yao, Heng Fan.[ICLR 2025]Knowing Your Target : Target-Aware Transformer Makes Better Spatio-Temporal Video Grounding. The 13th International Conference on Learning Representations (ICLR 2025). Xin Gu, Yaojie Shen, Chenxi Luo, Tiejian Luo, Yan Huang, Yuewei Lin, Heng Fan, Libo Zhang*.(Corresponding Author)[ICLR 2025]Multi-Reward as Condition for Instruction-based Image Editing. The 13th International Conference on Learning Representations (ICLR 2025). Xin Gu, Ming Li, Libo Zhang, Fan Chen, Longyin Wen, Tiejian Luo, Sijie Zhu[ICRA 2025]LaMOT: Language-Guided Multi-Object Tracking. The 2025 IEEE International Conference on Robotics and Automation (ICRA). Yunhao Li, Xiaoqiong Liu, Luke Liu, Heng Fan, Libo Zhang*.(Corresponding Author)[ICRA 2025]CGTrack: Cascade Gating Network with Hierarchical Feature Aggregation for UAV Tracking. The 2025 IEEE International Conference on Robotics and Automation (ICRA). Weihong Li, Xiaoqiong Liu, Heng Fan, Libo Zhang*.(Corresponding Author)2024[CCF A]VastTrack: Vast Category Visual Object Tracking. Advances in Neural Information Processing Systems (NeurIPS 2024). Liang Peng, Junyuan Gao, Xinran Liu, Weihong Li, Shaohua Dong, Zhipeng Zhang, Heng Fan, Libo Zhang*.(Corresponding Author)[CCF A]Robust Domain Adaptive Object Detection with Unified Multi-Granularity Alignment. IEEE Transactions on Pattern Analysis and Machine Intelligence. Libo Zhang, Wenzhang Zhou, Heng Fan, Tiejian Luo, Haibin Ling.[CCF A]CARL: Unsupervised Code-Based Adversarial Attacks for Programming Language Models via Reinforcement Learning. ACM Transactions on Software Engineering and Methodology. Kaichun Yao, Hao Wang, Chuan Qin, Hengshu Zhu, Yanjun Wu, Libo Zhang*.(Corresponding Author)[CCF A]Context-Guided Spatio-Temporal Video Grounding. The IEEE/CVF Conference on Computer Vision and Pattern Recognition 2024 (CVPR 2024). Xin Gu, Heng Fan, Yang Huang, Tiejian Luo, Libo Zhang*.(Corresponding Author)[CCF A]Kernel Adaptive Convolution for Scene Text Detection via Distance Map Prediction. The IEEE/CVF Conference on Computer Vision and Pattern Recognition 2024 (CVPR 2024). Jinzhi Zheng, Heng Fan, Libo Zhang*. (Corresponding Author)[ICLR 2024]MaGIC: Multi-modality Guided Image Completion. The 12th International Conference on Learning Representations (ICLR 2024).Yongsheng Yu, Hao Wang, Tiejian Luo, Heng Fan, Libo Zhang*.(Corresponding Author)[CCF B]AttMOT: Improving Multiple-object Tracking by Introducing Auxiliary Pedestrian Attributes. IEEE Transactions on Neural Networks and Learning Systems. Yunhao Li, Zhen Xiao, Lin Yang, Dan Meng, Xin Zhou, Heng Fan. Libo Zhang*.(Corresponding Author)[ECCV 2024]Beyond MOT: Semantic Multi-Object Tracking. The 18th European Conference on Computer Vision (ECCV 2024). Yunhao Li, Hao Wang, Qin Li, Xue Ma, Jiali Yao, Shaohua Dong, Heng Fan, Libo Zhang*.(Corresponding Author)2023[CCF A]Local Compressed Video Stream Learning for Generic Event Boundary Detection. International Journal of Computer Vision.Libo Zhang, Xin Gu, Congcong Li, Tiejian Luo, Heng Fan.[CCF A]PIDray: A Large-scale X-ray Benchmark for Real-World Prohibited Item Detection. International Journal of Computer Vision.Libo Zhang, Lutao Jiang, Heng Fan, Ruyi Ji.[CCF A]Two Birds, One Stone: A Unified Framework for Joint Learning of Image and Video Style Transfers.The 2023 IEEE International Conference on Computer Vision (ICCV 2023).Bohai Gu, Heng Fan,Libo Zhang*.(Corresponding Author)[CCF A]Unsupervised Domain Adaptive Detection with Network Stability Analysis.The 2023 IEEE International Conference on Computer Vision (ICCV 2023).Wenzhang Zhou, Heng Fan, Tiejian Luo,Libo Zhang*.(Corresponding Author)[CCF A]Accurate and Fast Compressed Video Captioning.The 2023 IEEE International Conference on Computer Vision (ICCV 2023).Yaojie Shen, Xin Gu, Kai Xu, Heng Fan, Longyin Wen, Libo Zhang*.(Corresponding Author)[CCF A]PlanarTrack: A Large-scale Challenging Benchmark for Planar Object Tracking.The 2023 IEEE International Conference on Computer Vision (ICCV 2023).Xinran Liu, Xiaoqiong Liu, Ziruo Yi, Xin Zhou, Thanh Le,Libo Zhang*, Yan Huang, Qing Yang, Heng Fan. (Corresponding Author)[CCF A]Text with Knowledge Graph Augmented Transformer for Video Captioning.The IEEE/CVF Conference on Computer Vision and Pattern Recognition 2023 (CVPR 2023).Xin Gu, Guang Chen, Yufei Wang,Libo Zhang*, Tiejian Luo, Longyin Wen.(Corresponding Author)Visual Object Tracking: Progress, Challenge, and Future. The Innovation.Libo Zhang, Heng Fan.[CCF B]Dual Transformer with Multi-Grained Assembly for Fine-Grained Visual Classification.IEEE Transactions on Circuits and Systems for Video Technology.Ruyi Ji, Jiaying Li,Libo Zhang*, Jing Liu, Yanjun Wu.(Corresponding Author)[CCF B]Siamese Self-supervised Learning for FineGrained Visual Classification.Computer Vision and Image Understanding.Ruyi Ji, Jiaying Li, Libo Zhang*.(Corresponding Author)[CCF B]Collaborative Three-stream Transformers for Video Captioning.Computer Vision and Image Understanding.Haowang, Libo Zhang*, Heng Fan, Tiejian Luo.(Corresponding Author)2022[CCF A]AnimalTrack: A Large-scale Benchmark for Multi-Animal Tracking in the Wild.International Journal of Computer Vision.[code]Libo Zhang, Junyuan Gao, Zhen Xiao, Heng Fan.[CCF A]Multi-Granularity Alignment Domain Adaptation for Object Detection.The IEEE/CVF Conference on Computer Vision and Pattern Recognition 2022 (CVPR 2022).[code]Wenzhang Zhou, Dawei Du,Libo Zhang*, Tiejian Luo, Yanjun Wu.(Corresponding Author)[CCF A]End-to-End Compressed Video Representation Learning for Generic Event Boundary Detection.The IEEE/CVF Conference on Computer Vision and Pattern Recognition 2022 (CVPR 2022).Congcong Li, Xinyao Wang, Longyin Wen, Dexiang Hong, Tiejian Luo,Libo Zhang*.(Corresponding Author)[CCF A]LD-ConGR: A Large RGB-D Video Dataset for Long-Distance Continuous Gesture Recognition.The IEEE/CVF Conference on Computer Vision and Pattern Recognition 2022 (CVPR 2022).[code]Dan Liu,Libo Zhang*, Yanjun Wu.(Corresponding Author)[ECCV 2022]High-Fidelity Image Inpainting with GAN Inversion.The 18th European Conference on Computer Vision (ECCV 2022).[code]Yongsheng Yu,Libo Zhang*, Heng Fan, Tiejian Luo.(Corresponding Author)[ECCV 2022]Unbiased Multi-Modality Guidance for Image Inpainting.The 18th European Conference on Computer Vision (ECCV 2022).[code]Yongsheng Yu, Dawei Du,Libo Zhang*, Tiejian Luo.(Corresponding Author)[ECCV 2022]AutoTransition: Learning to Recommend Video Transition Effects.The 18th European Conference on Computer Vision (ECCV 2022).[code]Yaojie Shen#,Libo Zhang#, Kai Xu#, Xiaojie Jin.[CCF A]ROG: A High Performance and Robust Distributed Training System for Robotic IoT.The 55th IEEE/ACM International Symposium on Microarchitecture (MICRO 2022).Xiuxian Guan, Zekai Sun, Shengliang Deng, Xusheng Chen, Shixiong Zhao, Zongyuan Zhang, Tianyang Duan, Yuexuan Wang, Chenshu Wu, Yong Cui,Libo Zhang, Yanjun Wu, Rui Wang, Heming Cui.[CCF B]COORP: Satisfying Low-Latency and High-Throughput Requirements of Wireless Ne",
  "content_length": 16603,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:04"
}