{
  "name": "Lie-Liang Yang",
  "homepage": "https://www.ecs.soton.ac.uk/people/llyang",
  "status": "success",
  "content": "Professor Lie-Liang Yang | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor Lie-Liang Yang BEng MEng PhD, FIEEE, FIET Professor of Wireless Communications Connect with Lie-Liang Email: lly@ecs.soton.ac.uk Tel: +44 23 8059 3364 ORCID On this page Research Publications Biography Research Publications Biography Research Research groups Member of: Next Generation Wireless Research projects Active projects Pervasive Wireless Intelligence Beyond The Generations Researchers: Professor Lajos Hanzo Professor Lie-Liang Yang Sponsor: EPSRC Completed projects New Air Interface Techniques for Future Massive Machine-Type Communications Researchers: Professor Lie-Liang Yang Professor Lajos Hanzo Sponsor: EPSRC GR/T08593/01 Multiple-Input-Multiple-Output Researchers: Professor Lie-Liang Yang Sponsor: EPSRC Index Modulation Based NOMA Researchers: Professor Lie-Liang Yang Sponsor: Huawei Technologies Co. Ltd NEWCOM Researchers: Professor Lajos Hanzo Professor Lie-Liang Yang , Professor Sheng Chen Sponsor: European Union Publications Iterative Soft-MMSE Detection Aided AFDM and OTFS Hugo Hawkins, Chao Xu, Lie-Liang Yang & Lajos Hanzo, 2025, IEEE Open Journal of Vehicular Technology, 6, 2944-2959 DOI: 10.1109/OJVT.2025.3623883 Type: article Two-tier frequency-domain equalization for ultra-wideband integrated sensing and communication Chao Xu, Jack Bedwell, Russel N. Torah, Stephen Wang, Shinya Sugiura, Robert G. Maunder, Lie-Liang Yang, Haas Harald & Lajos Hanzo, 2025, IEEE Transactions on Vehicular Technology DOI: 10.1109/TVT.2025.3619869 Type: article Generalized spatial modulation aided affine frequency division multiplexing Zeping Sui, Zilong Liu, Leila Musavian, Lie-Liang Yang & Lajos Hanzo, 2025, IEEE Transactions on Wireless Communications DOI: 10.1109/TWC.2025.3613062 Type: article Joint user activity detection and channel estimation in MC-GFMA systems by block sparse Bayesian learning with threshold optimization Yi Zhao, Mohammed El-Hajjar & Lie-Liang Yang, 2025, IEEE Open Journal of Vehicular Technology, 6, 2441-2458 DOI: 10.1109/OJVT.2025.3603690 Type: article Wavelet transform aided single-carrier FDMA with index modulation Zhou Lu, Mohammed El-Hajjar & Lie-Liang Yang, 2025, IEEE Open Journal of Vehicular Technology, 6, 1524-1538 DOI: 10.1109/OJVT.2025.3576062 Type: article Space-air-ground integrated networks: their channel model and performance analysis Chao Zhang, Qingchao Li, Chao Xu, Lie-Liang Yang & Lajos Hanzo, 2025, IEEE Open Journal of Vehicular Technology Type: article Orbital angular momentum for wireless communications: key performance indicators and performance comparison Zihao Wang, Mohammed El-Hajjar & Lie-Liang Yang, 2025, IEEE Access, 13, 80889-80913 DOI: 10.1109/ACCESS.2025.3567732 Type: article Integrated positioning and communication relying on wireless optical OFDM Chao Xu, Christos Masouros, Shinya Sugiura, Periklis Petropoulos, Robert G. Maunder, Lie-Liang Yang, Harald Haas & Lajos Hanzo, 2025, IEEE Journal on Selected Areas in Communications, 43(5), 1721-1737 DOI: 10.1109/JSAC.2025.3543532 Type: article CDMA/OTFS sensing outperforms pure OTFS at the same communication throughput Hugo Zakaria Jose Hawkins, Lajos Hanzo, Chao Xu & Lie-Liang Yang, 2025, IEEE Open Journal of Vehicular Technology, 6, 502 - 519 DOI: 10.1109/OJVT.2025.3532848 Type: article Localization in reconfigurable intelligent surface aided mmWave systems: a multiple measurement vector based channel estimation method Kunlun Li, Mohammed El-Hajjar, Lie-Liang Yang & Jiguang He, 2024, IEEE Transactions on Vehicular Technology, 73(9), 13326-13339 DOI: 10.1109/TVT.2024.3393022 Type: article Biography Lie-Liang Yang received his M.Eng and Ph.D degrees in communications and electronics from Northern (Beijing) Jiaotong University, Beijing, China in 1991 and 1997, respectively, and his B.Eng degree in communications engineering from Shanghai Tiedao University, Shanghai, China in 1988. Additionally, he received a Postgraduate Certificate in Education from University of Southampton, Southampton, UK in 2005. From June 1997 to December 1997 he was a visiting scientist to the Institute of Radio Engineering and Electronics, Academy of Sciences of the Czech Republic. Since December 1997, he has been with the School of Electronics and Computer Science, University of Southampton, UK, where he was first a Postdoctoral Research Fellow (Dec. 1997 - Aug. 2002), then a Lecturer (Sept. 2002 - Feb. 2006), then a Reader (Mar. 2006 - June 2010) and has been the Professor of Wireless Communications since June 2010. He has research interest in a range of areas in wireless communications, wireless networks and signal processing for wireless communications, as well as molecular and nano communications. He published 400+ research papers, which include 200+ journal papers and 210+ conference papers. He authored one book entitled Multicarrier Communications, which was published by John Wiley & Sons. This book was also translated into Chinese and published by the Publishing House of Electronic Industry of China. He co-authored two books entitled Single- and Multi-Carrier DS-CDMA - Multiuser Detection, Space-Time Spreading, Synchronization and Standards and Near-Capacity Variable-Length Coding, respectively, both of which were jointly published by John Wiley & Sons and IEEE Press. Additionally, he published 10+ book chapters. For the details of my publications, please visit https://www.ecs.soton.ac.uk/people/llyang#publications. Prof. Yang is a Fellow of the IEEE in the USA, and a Fellow of the IET (previously IEE) in the UK. He was a Distinguished Lecturer of the IEEE Vehicular Technology Society. He acted as TPC/symposium/area/track/workshop chairs for various conferences and was involved in the teams of Technical Programme Committees (TPC) of many conferences. He is a subject editor to the IET Electronics Letters, served as an associate editor to the IEEE Transactions on Vehicular Technology, Journal of Communications and Networks (JCN), Security and Communication Networks (SCN) Journal, etc., and he is currently an associate editor to the IEEE Access. He was one of the guest editors for the special issues in: IEEE Journal on Selected Areas in Communications (2013), IEEE Wireless Communication Magazine (2013), IEEE Communication Magazine (2014), IEEE Systems Journal (2015), EURASIP Journal on Wireless Communications and Networking (2011), China Communications. Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Pre-sessional English courses Course modules Assessment Subjects Acoustical engineering Aeronautical and astronautical engineering Ageing and gerontology Archaeology Art, design and fashion Audiology Biological sciences Biomedical and medical engineering Business, accounting, finance and marketing Chemistry Civil engineering Computer science and software engineering Economics Education Electrical and electronic engineering English Film studies French Geography and environmental science History Languages and linguistics Law Maritime engineer",
  "content_length": 30215,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:08"
}