{
  "name": "Ligang He",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/ligang_he",
  "status": "success",
  "content": "Ligang He Skip to main content Skip to navigation Research interests I am interested in doing research on any issues in Parallel and Distributed systems or developing parallel and distributed computing techniques for any application scenarios. I have published over 190 papers in top venues such as IEEE TC, TPDS, TKDE, TCSVT, NeurIPS, SC, EuroSys, IPDPS, ICPP, HPCA, VLDB, Micro, DAC and so on. My current research is in parallelized or distributed machine/deep learning (e.g. federated learning, acceleration of Graph Neural Networks training), cluster, Cloud and edge computing (e.g., optimising workload and resource management solutions), parallelized/distributed data analytical methods (e.g., anomaly detection for time series data, deep learning methods for point clouds, pattern discovery for big data), miscellaneous issues (e.g., communication schemes and security) in parallel and distributed systems. I always look for motivated PhD or MSc-by-research students who have the interests in doing research in above areas. Research Highlight Top 2% Scientists worldwide in the field of Distributed Computing, as per composite indicators compiled by Stanford and Elsevier in 2024 and 2025 SustainAIRA6G: Energy-Efficient Sustainable AI-driven Resource Allocation for 6G-empowered Edge-Fog-Cloud Continuum, funded by EPSRC, Warwick PI, 2024 Developing Adaptive Federated Learning Frameworks for Heterogenous and Dynamic Electronic Health Records, The UK-Saudi Challenge Fund, funded by British Council, PI, 2024 National Edge AI Hub for Real Data: Edge Intelligence for Cyber-disturbances and Data Quality, funded by EPSRC, co-I, 2024 The MSc dissertation project I supervised in the 2022/23 academic year, titled \"Developing a Resource Discovery Framework in a Network of Mobile Devices\", won the Best MSc Dissertation Award in the department The paper“SAFA: A Semi-Asynchronous Protocol for Fast Federated Learning With Low Overhead”is the runner-up of the 2021 Best Paper Award for IEEE Transactions on Computers DepGraph (collaborated with Huazhong University of Science and Technology and published in HPCA-2021) is ranked No. 2 in the Big Data category in the November 2021 ranking table of Green Graph 500, and ranked No. 3 in SSSP (single-source shortest paths) performance in the November 2021 ranking table of Graph 500 Selected Publications Z. Dai, L. He, S. Yang, M. Leeke, \"SARAD: Spatial Association-Aware Anomaly Detection and Diagnosis for Multivariate Time Series\", The Thirty-Eighth Annual Conference on Neural Information Processing Systems (NeurIPS2024), 2024 D. Yan, L. He, \"DP-PINN: A Dual-Phase Training Scheme for Improving the Performance of Physics-Informed Neural Networks\", the 24th International Conference on Computational Science, 2024 (The extension of this paper has been invited to submit to the special issue of Journal of Computational Science L. Li, L. He, J. Gao, and X. Han (2022) \"PSNet : fast data structuring for hierarchical deep learning on point cloud\". IEEE Transactions on Circuits and Systems for Video Technology,2022, doi:10.1109/TCSVT.2022.3171968 Wu, L. He, W. Lin, Y. Su, Y. Cui, C. Maple, S. Jarvis, \"Developing an Unsupervised Real-time Anomaly Detection Scheme for Time Series with Multi-seasonality\", in IEEE Transactions on Knowledge and Data Engineering, vol. 34, no. 9, pp. 4147-4160, 1 Sept. 2022, doi: 10.1109/TKDE.2020.3035685 Wu, L. He, W. Lin, R. Mao, \"Accelerating Federated Learning over Reliability-Agnostic Clients in Mobile Edge Computing Systems\", IEEE Transactions on Parallel and Distributed Systems, Vol.32, no.7, pp.1539-1551, 2021 Wu, L. He, W. Lin, R. Mao, C. Maple, S. Jarvis, \"SAFA: a Semi-Asynchronous Protocol for Fast Federated Learning with Low Overhead\", IEEE Transactions on Computers, vol. 70, pp. 655-668, 2020, DOI: 10.1109/TC.2020.2994391 Zhao, Y. Zhang, X. Liao, L. He, B. He, H. Jin and H. Liu, \"LCCG: a locality-centric hardware accelerator for high throughput of concurrent graph processing\", Proceedings of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC '21), 2021 Zhang, X. LIAO, H. Jin, L. He, B. He, H. Liu, L. Gu, \"DepGraph: A Dependency-Driven Accelerator for Efficient Iterative Graph Processing\", The 27th IEEE International Symposium on High-Performance Computer Architecture (HPCA-2021), 2021 Li, L. He, S. Ren, R. Mao, \"Developing a Loss Prediction-based Asynchronous Stochastic Gradient Descent Algorithm for Distributed Training of Deep Neural Networks\", Proceedings of the 49th International Conference on Parallel Processing(ICPP2020), 2020 Office: CS2.05Phone: +44 2476573802Email: ligang.he AT warwick.ac.uk Personal homepage Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 5058,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:07"
}