{
  "name": "Lijun Chen 0001",
  "homepage": "http://spot.colorado.edu/~lich1539",
  "status": "success",
  "content": "Lijun Chen's Page Lijun Chen Department of Computer Science University of Colorado at Boulder Boulder, CO 80309-0430 Office: ECCR 1B12 Tel: 303-492-4384 Fax: 303-492-1112 Email: lijun.chen[at]colorado.edu I am an Associate Professor of Computer Science at the University of Colorado at Boulder. I received PhD in Control and Dynamical Systems from the California Institute of Technology, advised by Profs. John Doyle and Steven Low. I was a Research Scientist at the same institute before joining the University of Colorado. My research focuses on building rigorous foundations and developing new methodologies in optimization and systems theory for the control and learning of complex engineering systems. These systems are large-scale with interconnected, active, and possibly self-interested components, operate with incomplete information and in uncertain environments, and must achieve certain desired network-wide objectives or collective behaviors. Problems associated with such systems are typically large, computationally hard, and require distributed solutions; yet they are also very structured and have features that can be exploited by appropriate computational methods. My research focuses on developing optimization approaches for such problems, and brings together optimization, systems theory, and domain-specific knowledges for exploring structures of the underlying problems and systems and leveraging them for the principled design of control and learning architectures and algorithms. Research interests Optimization, control, and learning of networked systems, autonomous systems, and quantum systems Distributed optimization and algorithms Learning and sequential decision-making Game theory and its engineering applications Theoretical foundation of complex engineering systems I am looking for motivated and self-driven students with a good theory/math/physics background. home| papers| students| teaching| professional service",
  "content_length": 1952,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:10"
}