{
  "name": "Lijun Yin 0001",
  "homepage": "http://www.cs.binghamton.edu/~lijun",
  "status": "success",
  "content": "My Homepage:(Jerry) Lijun Yin Ph.D. University of Alberta, 2000 M.Sc. Shanghai Jiao Tong University, 1992 Director, Graphics and Image Computing (GAIC) Laboratory, SUNY Binghamton Co-Director, Seymour Kunis Media Core, T. J. Watson School of Engineering and Applied Science, SUNY at Binghamton Director, Organized Research Center for Imaging, Acoustics, and Perception Science (CIAPS), Binghamton University Lijun Yin SUNY Distinguished Professor School of Computing Q18, Thomas J. Watson College of Engineering and Applied Science Binghamton University State University of New York Binghamton, NY 13902 Tel: (607)-777-5484 Fax: (607)-777-4729 lijun@cs.binghamton.edu Research Interests Computer Vision, Graphics and Image Processing Face processing and animation in video Demo Some of My Publications Graphics and Image Computing Laboratory, Department of Computer Science, SUNY at Binghamton Events 2025 IEEE Conference on Automatic Face and Gesture Recognition (FG2025) in Tampa, Florida ------ Call for Papers (General Co-Chair: Shaun Canavan, Lijun Yin, and Mohamed Daoudi) 2023 IEEE Conference on Automatic Face and Gesture Recognition (FG2023) in Waikoloa, Hawaii ------ Call for Workshop and Tutorial The Third Workshop on Applied Multimodal Affect Recognition (AMAR 2022), in conjunction with 26th International Conference on Pattern Recognition (ICPR 2022), Montreal Quebec, Canada The V4V Challenge and Workshop: Vision for Vitals, in conjunction with ICCV 2021, Montreal, Canada ------ Codalab for competition The Second Workshop on Applied Multimodal Affect Recognition (AMAR 2021), in conjunction with 9th International Conference on Affective Computing and Intelligent Interaction (ACII 2021), Nara, Japan FG2020 Workshop on Applied Multimodal Affect Recognition, in conjunction with IEEE International Conference on Automatic Face and Gesture Recognition, Buenos Aires, Argentina 3DFAW-Video: 2nd 3D Face Alignment in the Wild Challenge and Workshop - Dense Reconstruction from Video, In conjunction with ICCV 2019. (\"3DFAW-Video Database\" Available) [Call For Paper] IEEE International Conference on Automatic Face and Gesture Recognition (FG 2018) Facial Expression Recognition and Analysis Challenge (FERA 2017) CFP: Special Issue on Reliable Automatic Facial Coding, International Journal on Image and Vision Computing (IVCJ) 1st Workshop on 3D Face Alignment in the Wild (3DFAW) & Challenge, In conjunction with ECCV 2016, Amsterdam, The Netherlands Doctoral Consortium of the 8th IEEE International Conference on Biometrics: Theory, Applications, and Systems (BTAS 2016), Niagara Falls, Buffalo, NY. Teaching Courses CS375: Design and Analysis of Algorithms (Fall 2025) CS455/555: Visual Information Processing (Fall 2025) Couses taught since 2001: CS375 (algorithm), CS460 (computer graphics), CS560 (computer graphics (graduate level), CS660 (advanced computer graphics), CS555 (visual information processing), CS380M/CS580M (image processing and computer vision), CS580K (advanced topics on computer graphics). Students Amanda Lennie Xiaotian Li Xiang Zhang Zhe Ge Taoyue Wang Sohini Mandal Xi Kang Nan Bi Xin Zhou Zhenhang Li Recognition of Students Awards Huiyuan Yang (Ph.D.): Univeristy Distinguished Dissertation Award (2022); Department Award for Excellence in Research in Computer Science 2021. Xiaotian Li: Graduate Student Award for Excellence in Reseaarch 2024. Umur Ciftci (Ph.D.): Graduate Student Award for Excellence in Teaching 2021. Michael Reale (Ph.D.): University Distinguished Dissertation Award (2014); Graduate Student Awards of Excellence in Research 2013 Yi Sun (Ph.D.): University Distinguished Dissertation Award 2013; Graduate Student Awards of Excellence in Research 2009 Xing Zhang (Ph.D.): Graduate Student Awards of Excellence in Research 2015; Computer Science Graduate Student Award for Distinguished Dissertation, 2016 Yi Zhang (M.Sc.): Academic Excellence Award of Graduates 2015 GAIC Alumni (gradauted): Huiyuan Yang (Tenure-track Assistant Professor, Missouri University of Science and Technology) Shaun Canavan (Tenured Associate Professor, University of South Florida at Tampa, FL); Michael Reale (Tenured Associate Professor, SUNY Polytechnic Institute (SUNY Poly); Kaoning Hu (Tenured Associate Professor, Texas A&M University - Commerce); Umur Ciftci (Research Assistant Professor, Binghamton University); Zheng Zhang (Amazon Research); Xing Zhang (Amazon.com); Zhihua Li (Amazon Research); Peng Liu (Qualcomm, San Diego, CA); Lee Seversky (Air Force Ressearch Lab); Jingwen Zhao (Epic Systems, Madison, WI); Jack Cristofoletti (Diamond Visionics Inc.); Yi Zhang (Microsoft Corp., Redmond, WA); Mike Turek (IBM); Yi Sun (Amazon Corp); Ding Ding (Penn State University at University Park, PA) James Allen (Diamond Visionics); Amanda Lannie (Air Force Research Lab); Matthew Berger (Assistant Professor, Vanderbilt University); Myung Jin Ko (Microsoft Inc.); Jun Wang (Columbia University and Google); Peter Longo (Microsoft Inc.); Matthew J. Rosato (IBM Corp.); Jason Smith (BAE Systems and Lockheed Martine Corp.); Johnny Loi (Lockeed Martine Corp.); Kenny Weiss (Lawrence Livermore National Laboratory and University of Maryland at College Park); Xiaozhou Wei (Spatial Inc. Colorado); Terry Hung (Industrial Technology Research Institute, TaiWai and Corning Inc. NY); Sean Corrigan (Lockheed Martine Corp.); Xiaochen Chen (Google); Nikhil Karkera (Microsoft Inc.); Scott Von Duhn (U of Rochester); Elliot Catalano; Vanessa Amaya; Ryan Boris; Tony Worm; Wei Xiong; Bedo Magardichian; Jingrong Jia; Wanqi Tang; John Tesoriero; Doug Kay; Sandeep R. Deshpande; Rajanikant Kuchi; Ahmad I. Zainal Abidin. Professional Membership IEEE Fellow Elected Senior Member, National Academy of Inventors Advisory Committee Member, Standards Council of Canada, CAC/JTC1/SC29 Professional Activity Member of Editorial Board: Image and Vision Computing Journal, Elsevier. Associate Editor: Pattern Recognition Letter, Elsevier. General Chair: IEEE International Conference on Automatic Face and Gesture Recognition (2025) (co-chair with Shaun Canavan and Mohamed Daoudi). Organizer and Chair: 3DFAW-Video in conjunction with ICCV 2019. Program Chair: IEEE International Conference on Automatic Face and Gesture Recognition (2018, 2013). Area Chair: IEEE International Conference on Automatic Face and Gesture Recognition (2017; 2015, 2011). Area Chair: AAAC 6th International Conference on Affective Computing and intelligent Interaction (ACII 2015). Co-Chair: 1st Workshop on 3D Face Alignment in the Wild (3DFAW) & Challenge, in conjunction with ECCV 2015. Area Chair (Associate Editor): IEEE/IAPR International Conference on Pattern Recognition (ICPR) 2016. Technical Program Committee Member: CVPR 2016-2012, ICCV 2015-2013, ICPR'10, CVPR4HB'10, BTAS 2016-2010, ECCV 2016-2010, FG 2017-2004, ICB 2016, ACCV 2016 Program Committee Member: ACM Multimedia 2016. Program Committee Member: SIGGRAPH Asia (Technical Sketches and Posters) 2011. Program Committee member: International Conference on Affective Computing and Intelligent Interaction (ACII 2009), Amsterdam. Serve on a number of NSF Panels. Program Committee Member, IEEE International Conference on Automatic Face and Gesture Recognition (2008), Amsterdam, The Netherlands. Technical Program Committee Member, IEEE International Conference on Computer Vision and Pattern Recognition (CVPR08), Anchorage, Alaska. Program Committee Member, First IEEE Workshop on CVPR for Human Communicative Behavior Analysis, 2008. Anchorage, Alaska. Program Committee Member, IEEE 11th International Conference on Computer Vision (ICCV07), Rio de Janeiro, Brazil. Program Committee Member, The 18th International Conference on Pattern Recognition (ICPR 2006), Hong Kong. Program Co-Chair, First International Workshop on Video Processing for Security in conjuction with AI/GI/CRV'06, Quebec City, Canada. Computer Graphics Chair, International Symposium on Visual Computing 2005, Lake Tahoe, Nevada/California. PC member for ISVC 2005, 2006, 2007, and 2008. Technical Program Committer Member, IEEE International Conference on Multimedia and Expo. (ICME05), Amsterdam, Netherland. Program Committee Member, Second IEEE Workshop on Face Processing in Video, in conjuction with AI/GI/CVR05 in British Columbia, Canada. Program Committee Member, First IEEE Workshop on Face Processing in Video, in conjuction with IEEE International Conference on Computer Vision and Pattern Recognition (CVPR04) Session Chair (Detecting faces in video) at IEEE FPIV, 2004, Washington, DC. Technical Program Committee Member, IEEE International Conference on Image Processing (ICIP2004, ICIP2005, and ICIP2006) Session Chair in Face Analysis I, IEEE SMC2004, Hague, The Netherlands. Invited Keynote Speaker: IEEE Workshop on Advancements in Facial Expression Analysis and Synthesis: Past, Present, and Future in FG2024, May 2024 Invited Keynote Speaker: IEEE Workshop on Automated Assessment of Pain & EmoPain Challenge in FG2020, Nov. 2020 Invited Talk: UHS Initiative-BU Research Seminar Series, July 2019 Invited Talk: Nano-STEM scholarship program, Sept, 2017 Invited Talk: CAST-USA Innovation, Entrepreneuship, & Collaboration Summit (Information Technology Forum), Columbia University, New York, NY, 2017 Invited Talk: City College, City University of New York, New York, NY, 2017 Invited Talk: Florida International University, Miami, FL, 2016 Invited Talk: Imperial College London, UK, 2015 Invited Talk: University of Albany (SUNY), 2015 Invited Talk: Selected Lectures for Presentation at Lockheed Martin, Owego, NY, 2004 Invited Talk: Kodak Research Center, Rochester, NY., and distinguished lecture of IEEE Signal Processing Section in Rochester, NY, 2007. Keynote speaker: 2010 IEEE Int'l Workshop on CVPR for Human Communicative Behavior Analysis (CVPR4HB'10) in conjuction with IEEE CVPR, San Francisco, CA, 2010 Awards Lois B. DeFleur Faculty Prize for Academic Achievment Award, 2019. Outstanding Research Ach",
  "content_length": 10409,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:12"
}