{
  "name": "Lili Qiu",
  "homepage": "https://www.cs.utexas.edu/~lili",
  "status": "success",
  "content": "Lili Qiu's homepage Lili Qiu Professor Department of Computer Science The University of Texas at Austin 2317 Speedway, Stop D9500 Austin, TX 78712-1757 Office: GDC 6.806, Email: lili AT cs.utexas.edu Phone: 512-232-7890, Fax: 512-471-8885 I am a Professor in the Computer Science Department at the University of Texas at Austin, and a member of the Wireless Networking and Communications Group. I received my Ph.D. in Computer Science from Cornell University in 2001. I spent 2001â2004 as a researcher at Microsoft Research, Redmond, and joined UT Austin in January 2005. In 2022, I joined Microsoft Research Asia as Assistant Managing Director, leading high-impact cross-disciplinary research in wireless communication, sensing, AI systems, and healthcare, and broadening collaborations across academia and industry with a strong focus on translational innovation. I am a National Academy of Inventors (NAI) Fellow, ACM Fellow, IEEE Fellow, and ACM Distinguished Scientist. I received an NSF CAREER Award and a Google Faculty Research Award, as well as Best Paper Awards at ACM MobiSys'18 and IEEE ICNP'17, and Best Paper Runner-Ups at MobiSys'17 and MobiCom'11. A Ph.D. dissertation I supervised received the SIGMOBILE Best Dissertation Award in 2020. My current research focuses on wireless and mobile systems. I have served the community as Chair, Vice Chair, and Treasurer for SIGMOBILE; General Co-Chair for ACM MobiCom 2025, IEEE ICNP 2012, and WICON 2007; and TPC Co-Chair for ACM CoNEXT 2023, IEEE ICNP 2016, ACM MobiCom 2012, IEEE SECON 2011, and WICON 2006. Looking forward, I aim to advance impactful research in sensing, communication, ML systems, and healthcare. I am grateful for the opportunity to mentor outstanding students, and welcome to reach out if you are interested in working together as students, postdocs, or research interns. é±éååå£«ç ç©¶æ¹åå æ¬æ çº¿éä¿¡ãæ çº¿åå¯ç©¿æ´æç¥ãæºå¨å­¦ä¹ åç³»ç»ãå»çå¥åº·ãé±åå£«å¨ç¾å½åº·å¥å°å¤§å­¦å åè·å¾è®¡ç®æºç¡å£«ååå£«å­¦ä½ãå¥¹æ¾å¨2001-2004å¹´ä»»å¾®è½¯é·å¾·èç ç©¶é¢ç³»ç»åç½ç»ç»ç ç©¶åã2005å¹´ï¼å¥¹å å ¥ç¾å½å¾å è¨æ¯å¤§å­¦å¥¥æ¯æ±åæ ¡ï¼UT Austinï¼ä»»è®¡ç®æºç³»å©çææååå£«çå¯¼å¸ï¼ä¹åæåä¸ºç»èº«æ­£ææãå¥¹å¨2022 å¹´å å ¥å¾®è½¯äºæ´²ç ç©¶é¢å½å¯é¢é¿ãé±éååå£«æ¯IEEE FellowãACM Fellow åNAI Fellowãåæ¶ï¼å¥¹æ¾æ ä»»å½é è®¡ç®æºå­¦ä¼æ çº¿åç§»å¨ç³»ç»ä¸å§ï¼ACM SIGMOBILEï¼çä¸»å¸­ãé±éååå£«æ¾è·å¾ACMæ°åºç§å­¦å®¶ï¼ACM Distinguished Scientistï¼ãGoogle Faculty Award, ç¾å½å½å®¶ç§å­¦åºéä¼æ°åºéå¹´å­¦è å¥ï¼NSF CAREER awardï¼ç­å¤é¡¹è£èªã Publications Patents Projects: Metasurface, sensing, LLM agents, video understanding and generation, healthcare Talks Google Scholar Profile News Nov. 2025: Honored to co-chair ACM MobiCom 2025 with Prof. Mo Li. Grateful to the Executive Committee and all volunteers for making the conference a great success. Nov. 2025: Delighted to see my former intern, Ruichun Ma, receive the SIGMOBILE Dissertation Award for his innovative work on metasurface, and my collaborator and former team member, Jie Xiong, receive the SIGMOBILE Rockstar Award. My PhD student Wenguang Mao also received the SIGMOBILE Dissertation Award in 2020. Grateful for the opportunity to work with such talented researchers. Nov. 2025: We have five papers presented at MobiCom. Nov. 2025: Welcome to submit to Nature Portforlia Journal: Wireless Sensing and Perception: Cutting-edge Innovations and Future Vision. Deadline: 5/1/2026. Oct. 2025: Happy to learn our team won the first prize in the Hackathon for wearable sensing. Sept. 2025: Honored to speak at MIT, Harvard, and TEDx on continuous sensing and machine learning for healthcare. Previously gave a virtual talk at MIT during COVID; glad to return in person. Aug. 2025: Pleased to see my 2024 interns at MSRA, Yifei Liu and Seungjoo Lee, begin their PhD studies at Carnegie Mellon University. Supporting students' growth has always been one of the most rewarding parts of my work. July 2025: Grateful that our wireless sensing research contributed to a multi-million dollar industry collaboration. Feb. 2025: Delighted that our team won the first prize in the Hackathon Grand Challenge for accelerating Pre-filling for Long-Context LLMs via Dynamic Sparse Attention. Teaching CS 378: Introduction to Wireless Networking [Spring 2006, Spring 2007, Spring 2009, Spring 2010] CS 356: Computer Networks [Fall 2010, Summer 2011] CS 395T: Wireless Networking Seminar [Fall 2005] CS 386W: Wireless Networking (graduate-level breath class) [Fall 2006, Fall 2007, Fall 2008, Fall 2009, Spring 11, Fall 11, Fall 13, Fall 14, Fall 15, Fall 17, Fall 18, Fall 19, Fall 20, Fall 21] CS 356R: Introduction to Wireless Networking [S14,S15,F15,S17,F17,F18,F19]",
  "content_length": 4858,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:12"
}