{
  "name": "Liliana Florea",
  "homepage": "http://florealab.org",
  "status": "success",
  "content": "florealab.org Our group is developing accurate and efficient algorithms and software tools to analyze next generation sequencing data and answer questions in biology and medicine. Through tool development and analyses, we work to comprehensively characterize alternative splicing landscape in different organisms and cellular conditions, and to identify markers of disease. We design tools to help discover features of pathogen virulence and adaptation and to characterize the changes in the host environment in response to infection. About us Our group is developing computational methods to model and solve problems in biology and medicine, fueled by the wealth of sequence data generated by new and evolving sequencing technologies. We design accurate and efficient algorithms and software tools to tackle current problems in genome assembly, gene and alternative splicing annotation, microRNA genomics and host-pathogen interaction, and apply them to characterize the genetic and genomic landscape of different cellular states and different organisms. Find out more about our methods at our GitHub Splicebox repository and from our Software pages. Our work is currently being supported by NIH grant R35GM156374 and NSF award DBI-2504115. Recent News 11/2025 - Our tools MntJULiP and Jutils for differential splicing detection with covariates selected as the Editor's Choice in NAR Genomics and Bioinformatics 9/2025 - Colloquium speaker at the University of Pittsburgh's DBMI (virtual) 8/2025 - We received an NSF grant to study the contribution of transposable elements to species' transcriptomes 8/2025 - Dr. Florea research spotlight on ARCH (Advanced Research Computing at Hopkins) 7/2025 - Talks on our MntJULiP tool for differential splicing detection with covariates at SPLICING2025 (Lisbon) and on deep learning correction of lrRNA-seq alignments with SpliSync at ISMBECCB2025 (Liverpool) 5/2025 - Deep learning error correction of long read spliced alignments (SpliSync) accepted at ISMB/ECCB2025 1/2025 - New NIH/NIGMS MIRA award to develop tools and models for alternative splicing characterization 1/2025 - We launched a new online Coursera course on Bioinformatics Methods for Transcriptomics 12/2024 - Zitong He has passed his GBO doctoral examination 12/2024 - Collaborative study on transposon exonization in modulating immune response published in Cell (with Giulia Pasquesi and the Chuong lab) 12/2024 - Collaborative study on multiomic analysis of breast ductal carcinoma in situ published in Breast Cancer Research (with Umbricht and Cope labs) 11/2024 - Session moderator for 'Decoding Gene Expression Cis and Trans' at ASHG2024 7/2024 - Talk on detecting Alu exonization in the human genome with our deep learning model eXAlu, at the 6th World's Aging and Rejuvenation Conference (ARC2024), Paris, France 1/2024 - Manuscript describing our new tool eXAlu, for predicting exonization of Alu elements, is on bioRxiv 1/2024 - Manuscript describing MntJULiP and Jutils, our tools for differential splicing detection in the presence of covariates, is on bioRxiv 11/2023 - Poster on the MntJULiP and Jutils tools for discovery of differential splicing events in complex data with covariates at ASHG 2023 (with Edward Wui Wang Lui and Guangyu Yang) 10/2023 - Talk on our decades-long work on splice graph-based transcript reconstruction at the SorinFest: Phase Transitions conference honoring Sorin Istrail, at Brown University (YouTube) 7/2023 - Talk on differential splicing analysis of human data with MntJULiP at SPLICING2023, Caparica, Portugal 7/2023 - Collaborative paper on the transcriptomics of the interaction of B. burgdorferi and human dendritic cells (Mark Soloski's lab) 5/2023 - Talk on our Deep Learning model of Alu exonization at WMESA2023, Penn State University 4/2023 - Collaborative paper on a mouse model of Down syndrome (Roger Reeves' lab) Read More Main menu Home News PeoplePI Current Students Alumni PublicationsSelected Publications Publications By Year Research Software Funding Teaching/Courses Consulting Core Contact Us Copyright@Florealab.org",
  "content_length": 4095,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:13"
}