{
  "name": "Lilly C. Irani",
  "homepage": "https://quote.ucsd.edu/lirani",
  "status": "success",
  "content": "Lilly Irani | Associate Professor, Communication, Science Studies, Computer Science, Critical Gender Studies, Design Lab | UC San Diego Broadly, my research investigates the cultural politics of high-tech work practices with a focus on how actors produce “innovation” cultures. I am an ethnographer of work trained to analyze interactional, organizational, and cultural dynamics as mediated by technology. I also draw on my training as a Computer Scientist and designer to develop novel technical, organizational systems for contexts I study. I specialize in the cultural politics of high-tech work in the context of global digitally-mediated economies, with a focus on the United States and India. I also build software with others to build worker power (Turkopticon, Dynamo) especially to resist and create alternatives to existing platforms. Workers have turned Turkopticon into a worker-run advocacy organization that also operates the tool and website. At UCSD, I am Faculty Director of the UC San Diego Labor Center. I co-direct the Just Transitions Initiative and am faculty in Science Studies, the Design Lab, the Institute for Practical Ethics, Critical Gender Studies. Chasing Innovation: Making Entrepreneurial Citizens in Modern India (Princeton University Press, 2019) explains the history and politics of rendering development as a call to entrepreneurship, and the pull and contradictions of this call to sort a nation into innovators and their others. The book is the winner of the 2020 International Communication Association Outstanding Book Award and 2019 Diana Forsythe Prize. Listen to an interview about the book on Against the Grain (KPFA) or Lekh South Asia. Redacted (co-authored with journalist Jesse Marx) reflects on surveillance and publicity, transparency and collective action, as well as organizations and accidents. It offers practical advice and critical and sardonic readings of redacted government documents. Redacted is published by Taller California, a small press dedicated to works that engage the border as a socio-political space. I am part of the editorial collective of Public Culture. I serve on the editorial advisory boards of Design and Culture, New Technology, Work, and Employment, and Catalyst: Feminism, Theory, Technoscience. My research has been funded by the Kauffman Foundation, Ford Foundation, Fulbright-Nehru Doctoral Fellowship, Open Society Foundation, National Science Foundation Graduate Research Fellowship, and NSF Virtual Organizations as Sociotechnical Systems Program. I have a Ph.D. in Informatics (Feminist Emphasis) from UC Irvine, an M.S. and B.S. Computer Science (Human-Computer Interaction) from Stanford University. About Projects Research Publications Teaching News Bio & CV Contact Pieces on Difference Engines Turkopticon News Research and struggling for democratic control of surveillance technology in San Diego June 15, 2022 Announcing the Just Transitions Initiative March 4, 2022 The ideology of innovation on the People and Things Podcast October 25, 2021 New talk online: Chasing Innovation: The Limits of Entrepreneurship June 9, 2021 New talk online: Claiming Democracy Over Digital Infrastructures April 28, 2021",
  "content_length": 3201,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:14"
}