{
  "name": "Liming Zhu",
  "homepage": "https://www.unsw.edu.au/staff/liming-zhu",
  "status": "success",
  "content": "Dr Liming Zhu Type in a search term Search Follow Follow LinkedIn Facebook Instagram TikTok YouTube Back to Dr Liming Zhu Adjunct Professor Engineering Computer Science and Engineering Follow me Follow me I lead the Software and Computational Systems Research Program (one of the four programs) at Data61, CSIRO. The research program has 200+ people innovating in the following (but not limited to) research areas: big data analytics infrastructure, computational and simulation sciences platforms (including verticals such as imaging processing and bioinformatics/life sciences), data integration, data platforms, trustworthy systems, distributed systems, business process management, legal informatics, provenance, behaviour analytics, blockchains, software ecosystems, software engineering/architecture, DevOps and cybersecurity. Data61 is part of The Commonwealth Scientific and Industrial Research Organisation (CSIRO) and Australia's data/ICT innovation hub. Data61 was formed bringing together CSIRO's Digital Productivity team and National ICT Australia (NICTA). I am also conjoint full professor at School of Computer Science and Engineering, University of New South Wales. I teach software architecture courses and supervise PhD students at UNSW. I have supervised 6 PhDs to completion as the primary supervisor. My personal research interests include: software architecture in enterprise systems and embedded systems dependable distributed systems dependable DevOps and continuous deployment (big) data analytics infrastructure, data analytics pipelines and data provenance data platforms blockchain-driven systems software engineering for machine-learning based systems software ecosystems, multi-sided platforms and Ultra-Large-Scale systems service/cloud engineering and RESTful services Model Driven Development(MDD) business process management system and software development processes and methodologies empirical methods in software engineering Phone +61433111052 E-mail liming.zhu@data61.csiro.au Location Australian Technology Park, Redfern Publications Publications Media Media Grants Grants Awards Awards Research Activities Research Activities Engagement Engagement Teaching and Supervision Teaching and Supervision Books Books | 2015 Bass L; Weber I; Zhu L, 2015, Devops A Software Architect's Perspective, Addison-Wesley Professional Book Chapters Book Chapters | 2025 Xu X; Pautasso C; Lo SK; Zhu L; Lu Q; Weber I, 2025, 'An Extended Pattern Collection for Blockchain-Based Applications', in Lecture Notes in Computer Science, pp. 67 - 117, http://dx.doi.org/10.1007/978-3-662-70810-1_2 Book Chapters | 2022 Zhu L; Xu X; Lu Q; Governatori G; Whittle J, 2022, 'AI and Ethics—Operationalizing Responsible AI', in Humanity Driven AI, Springer International Publishing, pp. 15 - 33, http://dx.doi.org/10.1007/978-3-030-72188-6_2 Book Chapters | 2019 Zhang S; Yao L; Sun A; Guo G; Xu X; Zhu L, 2019, 'Deep neural networks meet recommender systems', in Khalid O; Khan SU; Zomaya AY (ed.), Big Data Recommender Systems Application Paradigms, pp. 9 - 33, http://dx.doi.org/10.1049/PBPC035G_ch2 Book Chapters | 2017 Wu D; Sakr S; Zhu L, 2017, 'Big data programming models', in Handbook of Big Data Technologies, pp. 31 - 63, http://dx.doi.org/10.1007/978-3-319-49340-4_2 Book Chapters | 2017 Wu D; Sakr S; Zhu L, 2017, 'Big data storage and data models', in Handbook of Big Data Technologies, pp. 3 - 29, http://dx.doi.org/10.1007/978-3-319-49340-4_1 Book Chapters | 2012 Lu Q; Xu X; Tosic V; Zhu L, 2012, 'Application of Business-Driven Decision Making to RESTful Business Processes', in Lecture Notes in Computer Science, Springer Berlin Heidelberg, pp. 404 - 419, http://dx.doi.org/10.1007/978-3-642-34321-6_27 Book Chapters | Zhu L, 'Model-Driven Architecture', in Essential Software Architecture, Springer Berlin Heidelberg, pp. 197 - 215, http://dx.doi.org/10.1007/3-540-28714-0_11 Edited Books Journal Articles Journal articles | 2026 Lu Q; Zhao D; Liu Y; Zhang H; Zhu L; Xu X; Shi A; Tan T; Kazman R, 2026, 'AgentArcEval: An architecture evaluation method for foundation model based agents', Journal of Systems and Software, 232, http://dx.doi.org/10.1016/j.jss.2025.112656 Journal articles | 2025 Kan S; Li Y; He W; Xing Z; Zhu L; Sui Y, 2025, 'S pectre : Automated Aliasing Specifications Generation for Library APIs with Fuzzing', ACM Transactions on Software Engineering and Methodology, http://dx.doi.org/10.1145/3725811 Journal articles | 2025 Klymenko M; Hoang T; Xu X; Xing Z; Usman M; Lu Q; Zhu L, 2025, 'Architectural patterns for designing quantum artificial intelligence systems', Journal of Systems and Software, 227, http://dx.doi.org/10.1016/j.jss.2025.112456 Journal articles | 2025 Lee SU; Perera H; Liu Y; Xia B; Lu Q; Zhu L; Cairns J; Nottage M, 2025, 'Integrating ESG and AI: a comprehensive responsible AI assessment framework', AI and Ethics, 5, pp. 5121 - 5148, http://dx.doi.org/10.1007/s43681-025-00741-5 Journal articles | 2025 Lee SU; Perera H; Xia B; Liu Y; Lu Q; Zhu L; Salvado O; Whittle J, 2025, 'QB4AIRA: A Question Bank for Responsible AI Risk Assessment', IEEE Software, 42, pp. 115 - 124, http://dx.doi.org/10.1109/MS.2024.3512577 Journal articles | 2025 Liu Y; Lo SK; Lu Q; Zhu L; Zhao D; Xu X; Harrer S; Whittle J, 2025, 'Agent design pattern catalogue: A collection of architectural patterns for foundation model based agents', Journal of Systems and Software, 220, http://dx.doi.org/10.1016/j.jss.2024.112278 Journal articles | 2025 Nguyen TL; Nguyen L; Hoang T; Bandara D; Wang Q; Lu Q; Xu X; Zhu L; Chen S, 2025, 'Blockchain-Empowered Trustworthy Data Sharing: Fundamentals, Applications, and Challenges', ACM Computing Surveys, 57, http://dx.doi.org/10.1145/3718082 Journal articles | 2025 Su Y; Xing Z; Wang C; Chen C; Xu SX; Lu Q; Zhu L, 2025, 'Automated Soap Opera Testing Directed by LLMs and Scenario Knowledge: Feasibility, Challenges, and Road Ahead', Proceedings of the ACM on Software Engineering, 2, pp. 757 - 778, http://dx.doi.org/10.1145/3715752 Journal articles | 2025 Tao Z; Pan S; Xing Z; Sun X; Haggag O; Grundy J; Li J; Zhu L, 2025, 'Privacy Bills of Materials (PriBOM): A Transparent Privacy Information Inventory for Collaborative Privacy Notice Generation in Mobile App Development', Proceedings on Privacy Enhancing Technologies, 2025, pp. 392 - 409, http://dx.doi.org/10.56553/popets-2025-0136 Journal articles | 2025 Zhou G; Han Z; Chen S; Huang B; Zhu L; Liu T; Yao L; Zhang K, 2025, 'HCVP: Leveraging Hierarchical Contrastive Visual Prompt for Domain Generalization', IEEE Transactions on Multimedia, 27, pp. 1142 - 1152, http://dx.doi.org/10.1109/TMM.2024.3521719 Journal articles | 2024 Bi T; Xia B; Xing Z; Lu Q; Zhu L, 2024, 'On the Way to SBOMs: Investigating Design Issues and Solutions in Practice', ACM Transactions on Software Engineering and Methodology, 33, http://dx.doi.org/10.1145/3654442 Journal articles | 2024 Liu Y; Lu Q; Zhu L; Paik HY, 2024, 'Decentralized Governance-Driven Architecture for Designing Foundation-Model-Based Systems: Exploring the Role of Blockchain in Responsible AI', IEEE Software, 41, pp. 34 - 42, http://dx.doi.org/10.1109/MS.2024.3369551 Journal articles | 2024 Lu Q; Zhu L; Xu X; Whittle J; Zowghi D; Jacquet A, 2024, 'Responsible AI Pattern Catalogue: A Collection of Best Practices for AI Governance and Engineering', ACM Computing Surveys, 56, http://dx.doi.org/10.1145/3626234 Journal articles | 2024 Lu Q; Zhu L; Xu X; Xing Z; Whittle J, 2024, 'Toward Responsible AI in the Era of Generative AI: A Reference Architecture for Designing Foundation Model-Based Systems', IEEE Software, 41, pp. 91 - 100, http://dx.doi.org/10.1109/MS.2024.3406333 Journal articles | 2024 Zhang D; Pan S; Hoang T; Xing Z; Staples M; Xu X; Yao L; Lu Q; Zhu L, 2024, 'To be forgotten or to be fair: unveiling fairness implications of machine unlearning methods', AI and Ethics, 4, pp. 83 - 93, http://dx.doi.org/10.1007/s43681-023-00398-y Journal articles | 2024 Zhang Z; Xing Z; Zhao D; Xu X; Zhu L; Lu Q, 2024, 'Automated Refactoring of Non-Idiomatic Python Code With Pythonic Idioms', IEEE Transactions on Software Engineering, 50, pp. 2827 - 2848, http://dx.doi.org/10.1109/TSE.2024.3420886 Journal articles | 2023 Dong M; Yao L; Wang X; Xu X; Zhu L, 2023, 'Adversarial dual autoencoders for trust-aware recommendation', Neural Computing and Applications, 35, pp. 13065 - 13075, http://dx.doi.org/10.1007/s00521-021-05722-3 Journal articles | 2023 Liu Y; Lu Q; Zhu L; Paik HY; Staples M, 2023, 'A systematic literature review on blockchain governance', Journal of Systems and Software, 197, http://dx.doi.org/10.1016/j.jss.2022.111576 Journal articles | 2023 Lo SK; Liu Y; Lu Q; Wang C; Xu X; Paik HY; Zhu L, 2023, 'Toward Trustworthy AI: Blockchain-Based Architecture Design for Accountability and Fairness of Federated Learning Systems', IEEE Internet of Things Journal, 10, pp. 3276 - 3284, http://dx.doi.org/10.1109/JIOT.2022.3144450 Journal articles | 2023 Lu Q; Luo Y; Zhu L; Tang M; Xu X; Whittle J, 2023, 'Developing Responsible Chatbots for Financial Services: A Pattern-Oriented Responsible Artificial Intelligence Engineering Approach', IEEE Intelligent Systems, 38, pp. 42 - 51, http://dx.doi.org/10.1109/MIS.2023.3320437 Journal articles | 2023 Lu Q; Zhu L; Whittle J; Michael JB, 2023, 'Software Engineering for Responsible AI', Computer, 56, pp. 13 - 16, http://dx.doi.org/10.1109/MC.2023.3242055 Journal articles | 2023 Lu Q; Zhu L; Xu X; Whittle J; Zowghi D; Jacquet A, 2023, 'Operationalizing Responsible AI at Scale: CSIRO Data61's Pattern-Oriented Responsible AI Engineering Approach', Communications of the ACM, 66, pp. 64 - 66, http://dx.doi.org/10.1145/3589946 Journal articles | 2023 Lu Q; Zhu L; Xu X; Whittle J, 2023, 'Responsible-AI-by-Design: A Pattern Collection for Designing Responsible Artificial Intelligence Systems', IEEE Software, 40, pp. 63 - 71, http://dx.doi.org/10.1109/MS.2022.3233582 Journal articles | 2023 Shanmugarasa Y; Paik HY; Kanh",
  "content_length": 101965,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:15"
}