{
  "name": "Lin Wang 0004",
  "homepage": "https://linwang.ujn.edu.cn/lab/index_en.htm",
  "status": "success",
  "content": "ï»¿ index_en-æµåå¤§å­¦çç³ Home Biography Publications Grants Awards Patents Group ä¸­æ Lin Wang , Professor, School of Information Science and Engineering, University of Jinan, China. Member of IEEE, Member of ACM, Member of CCF and Member of CAA. Research Interests:  machine learning, data mining and their applications in scientific computing. Lin Wang received the Ph.D. degree in Computer Science and Technology from the School of Computer Science and Technology, Shandong University, China, in 2011. He is currently a Professor at the School of Information Science and Engineering, University of Jinan, China, and at the Shandong Provincial Key Laboratory of Network Based Intelligent Computing, University of Jinan, China. He serves as Committee Member for the ACM Special Interest Group on Computer Science Education China (SIGCSE China), Secretary-General of ACM Jinan Chapter, Deputy Secretary-General of the ShanDong Association of Artificial Intelligence, Committee Member of the Youth Working Committee of the Chinese Association of Automation, Executive Committee Member of the Artificial Intelligence and Pattern Recognition Committee of the China Computer Federation, Executive Committee Member of the Collaborative Computing Committee, and Committee Member of the ShanDong Association of Artificial Intelligence. He is a Program Committee Member or Special Session Chair of many international conferences, e.g. AAAI, SPAC, ICONIP, SIGCSE China, and IEEE PICom. He is the Winner of the ACM Jinan Rising Star Award, Winner of the Shandong Provincial Natural Science Academic Innovation Award. He has been granted the Shandong Provincial Natural Science Foundation for Distinguished Young Scholars, granted the Taishan Scholar Project of Shandong Province, China, granted the Outstanding Graduate Supervisor of Shandong Province, and granted Provincial University Excellent Young Scientists Foundation of Shandong Provincial Natural Science Foundation. Contact Information Address: School of Information Science and Engineering, University of Jinan No. 336, West Road of Nan Xinzhuang, Jinan, 250022 China Phone: +86 531 82765912 E-mail: Announcement 2017.11.13: Prof. Jeff Orchard, University of Waterloo, Canada, presented a talk at University of Jinan Publications (Journal, Conference, Chinese Articles) Journal (Reverse Chronology) [45] Xin Zhao, Lin Wang, Qinfei Li, Heng Chen, Shuangrong Liu, Pengkun Hou, Jiayuan Ye, Yan Pei, Xu Wu, Jianfeng Yuan, Haozhong Gao, Bo Yang, 3D Microstructural Generation from 2D Images of Cement Paste using Generative Adversarial Networks, Cement and Concrete Research, 2025, 187:107726. [pdf] [44] Jiahao Li, Xin Zhao, Lin Wang, Shuangrong Liu, Haozhong Gao, Zeming Cheng, Chaoran Pang, Bo Yang, MCCMS: Achieve fine-grained phase distribution design in cement microstructure using diffusion models, Computer-Aided Design, 2025, 189:103946. [pdf] [43] Jun Ma, Haoran Shan, Fengyang Sun, Lin Wang, Shuangrong Liu, Houguan Zhu, Fenghui Gao, Junteng Zheng, Bo Yang, Qinfei Li, NEEP-ADF: Neuro-encoded expression programming with automatically dÂ­efined functions, Information Sciences, 2025, 704:121957. [pdf] [42] Xu Wu, Qinfei Li, Lin Wang, Shuangrong Liu, Heng Chen, Pengkun Hou, Jiayuan Ye, Yan Pei, Xin Zhao, Yuhang Xie, Tengfei Zhang, Bo Yang, Exploring the Correlation Between Portland Cement-based MaterialsÂ Microstructure and Compressive Strength: A Deep Learning-based Comparison of Î¼CT and SEM-BSE Microstructure Images, Journal of Materials in Civil Engineering, 2025 In Press. [41] Shuangrong Liu, Sung-Kwun Oh, Witold Pedrycz, Bo Yang, Lin Wang, Kisung Seo, Fuzzy Adaptive Knowledge-Based Inference Neural Networks: Design and Analysis, IEEE Transactions on Cybernetics, 2024, 54(9):4875-4888.[pdf] [40] Shuangrong Liu, Sung-Kwun Oh, Witold Pedrycz, Bo Yang, Lin Wang, Zhen Peng, SCINN: Semantic Concept-Based Inference Neural Networks With Explainable and Deep Fuzzy Structure, IEEE Transactions on Fuzzy Systems, 2024,37(7):4133-4147.[pdf] [39] Xiaojing Zhang, Shuangrong Liu, Lin Wang, Bo Yang, Jiawei Fan, Learning Neural Network Classifiers by Distributing Nearest Neighbors on Adaptive Hypersphere, IEEE Transactions on Artificial Intelligence, 2024 In Press.[pdf] [38] Na Zhang, Ming Liu, Lin Wang, Shuangrong Liu, Runyuan Sun, Bo Yang, Shenghui Zhu, Chengdong Li, Cheng Yang, Yuhu Cheng, A Novel Grades Prediction Method for Undergraduate Students by Learning Explicit Conditional Distribution, IEEE Transactions on Artificial Intelligence, 2024, 5(9):4837-4848.[pdf] [37] Shuangrong Liu, Sung-Kwun Oh, Witold Pedrycz, Bo Yang, Lin Wang, Jin Hee Yoon, Reinforced Interval Type-2 Fuzzy Clustering-based Neural Network Realized Through Attention-based Clustering Mechanism and Successive Learning, IEEE Transactions on Fuzzy Systems, 2024, 32(3):1208-1222.[pdf] [36] Jifeng Guo, C. L. Philip Chen, Lin Wang, Bo Yang, Tong Zhang, Liangliang Zhang, Constructing Microstructural Evolution System for Cement Hydration from Observed Data using Deep Learning, IEEE Transactions on Systems, Man, and Cybernetics: Systems, 2023, 53(7):4576-4589.[pdf] [35] Jun Ma#, Jiawei Fan#, Lin Wang, C. L. Philip Chen, Bo Yang, Fengyang Sun, Jin Zhou, Xiaojing Zhang, Fenghui Gao, Na Zhang, Factorization of Broad Expansion for Broad Learning System, Information Sciences, 2023, 630:271-285.[pdf] [34] Shuangrong Liu, Lin Wang, Bo Yang, Jin Zhou, Zhenxiang Chen, Huifen Dong, Improvement of Neural-Network Classifiers using Fuzzy Floating Centroids, IEEE Transactions on Cybernetics, 2022, 52(3):1392-1404.[pdf] [33] Jiantao Wu, Lin Wang, Bo Yang, Fanqi Li, Chunxiuzi Liu, Jin Zhou, DEFT: Distilling Entangled Factors by Preventing Information Diffusion, Machine Learning, 2022, 111:2275â2295.[pdf] [32] Liangliang Zhang, Lin Wang, Bo Yang, Sijie Niu, Yamin Han, Sung-Kwun Oh, Rapid Construction of 4D High-Quality Microstructural Image for Cement Hydration Using Partial Information Registration, Pattern Recognition, 2022, 124:108471.[pdf] [31] Rongrong Wang, Shiyuan Han, Jin Zhou, Yuehui Chen, Lin Wang, Tao Du, Ke Ji, Ya-ou Zhao, Kun Zhang, Transfer-Learning-Based Gaussian Mixture Model for Distributed Clustering, IEEE Transactions on Cybernetics, 2022, 53(11):7058-7070. [pdf] [30] Rui Wangï¼Muwei Jian, Hui Yu, Lin Wang, Bo Yang, Face Hallucination using Multisource References and Cross-Scale Dual Residual Fusion Mechanism, International Journal of Intelligent Systems, 2022, 37:9982-10000. [pdf] [29] Cheng Yang, Sung-Kwun Oh, Bo Yang, Witold Pedrycz, Lin Wang, Hybrid Fuzzy Multiple SVM Classifier through Feature Fusion Based on CNNs and Its Practical Applications, Expert Systems with Applications, 2022, 202(15):117392. [pdf] [28] Bozhan Dang, Yingxu Wang, Jin Zhou, Rongrong Wang, Long Chen, C. L. Philip Chen, Tong Zhang, Shiyuan Han, Lin Wang, Yuehui Chen, Transfer Collaborative Fuzzy Clustering in Distributed Peer-to-Peer Networks, IEEE Transactions on Fuzzy Systems, 2022, 30(2):500-514.[pdf] [27] Liangliang Zhang, Sung-Kwun Oh, Witold Pedrycz, Bo Yang, Lin Wang, A Promotive Particle Swarm Optimizer with Double Hierarchical Structures, IEEE Transactions on Cybernetics, 2022, 52(12):13308-13322.[pdf] [26] Fengyang Sun, Lin Wang, Bo Yang, A Neuro-diversified Benchmark Generator for Black Box Optimization, Information Sciences, 2021, 573:475-492.[pdf] [25] Fengyang Sun, Shuo Kong, Xiaojing Zhang,Lin Wang, Bo Yang, Shuangrong Liu, Qidong Wang, Nearest Vertex Attraction for Actively Reducing Loss, Cognitive Systems Research, 2021, 70:18-28.[pdf] [24] Jifeng Guo, Zhulin Liu, C. L. Philip Chen, Tong Zhang, Lin Wang, Kaipeng Fan, An Efficient Inspection System Based on Broad Learning: Nondestructively Estimating Cement Compressive Strength with Internal Factors, IEEE Transactions on Industrial Informatics, 2021, 18(6):3787-3798.[pdf] [23] Shiyuan Han, Jin Zhou, Yuehui Chen, Yifan Zhang, Gongyou Tang, Lin Wang, Active Fault-Tolerant Control for Discrete Vehicle Active Suspension via Reduced-Order Observer, IEEE Transactions on Systems, Man, and Cybernetics: Systems, 2021, 51(11):6701-6711.[pdf] [22] Jifeng Guo, Lin Wang, Kaipeng Fan, Bo Yang, An Efficient Model for Predicting Setting Time of Cement Based on Broad Learning System, Applied Soft Computing, 2020, 96:106698. [pdf] [21] Lin Wang, Junteng Zheng, Jeff Orchard, Evolving Generalized Modulatory Learning: Unifying Neuromodulation and Synaptic Plasticity, IEEE Transactions on Cognitive and Developmental Systems, 2020, 12(4):797-808.[pdf] [20] Jifeng Guo#, Meihui Li#, Lin Wang, Bo Yang, Liangliang Zhang, Zhenxiang Chen, Shiyuan Han, Laura Garcia-Hernandez, Ajith Abraham, Estimating Cement Compressive Strength using Three-dimensional Microstructure Images and Deep Belief Network, Engineering Applications of Artificial Intelligence, 2019, 88:103378.[pdf] [19] Shuangrong Liu, Lin Wang, Bo Yang, An Improved Neural Network Classifier Using Fuzzy Nearest Neighbor Partitioning Method, International Journal of Fuzzy Systems, 2019, 21:2270-2282.[pdf] [18] Lin Wang, Jeff Orchard, Investigating the Evolution of a Neuroplasticity Network for Learning, IEEE Transactions on Systems, Man, and Cybernetics: Systems, 2019, 49(10):2131-2143.[pdf] [17] Lin Wang, Xuehui Zhu, Bo Yang, Jifeng Guo, Shuangrong Liu, Meihui Li, Jian Zhu, Ajith Abraham, Accelerating Nearest Neighbour Partitioning Neural Network Classifier Based on CUDA, Engineering Applications of Artificial Intelligence, 2018, 68:53-62.[pdf] [16] Zhenxiang Chen, Qiben Yan, Hongbo Han, Shanshan Wang, Lizhi Peng, Lin Wang, Bo Yang, Machine learning based mobile malware detection using highly imbalanced network traffic, Information Sciences, 2018, 433:346-364. [pdf] [15] Lin Wang, Bo Yang, Yuehui Chen, Xiaoqian Zhang, Jeff Orchard, Improving Neural-Network Classifiers using Nearest Neighbor Partitioning, IEEE Transactions on Neural Networks and Learning Systems, 2017, 28(10):2255-2267.[pdf] [code] [14] Lin Wang, Bo Yang, Ajith Abraham, Distilling Middle-Age Cement Hydration",
  "content_length": 60701,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:18"
}