{
  "name": "Lin Shao 0002",
  "homepage": "https://linsats.github.io",
  "status": "success",
  "content": "Lin Shao Lin Shao Assistant Professor at Department of Computer Science, School of Computing National University of Singapore Email: linshao at nus dot edu dot sg Office:COM2-03-03 [Publications] [Experiences] [Teaching] [Misc] [Google Scholar] [GitHub] About My research interests lie at the intersection of robotics and artificial intelligence. My long-term goal is to holistically build general-purpose robotic systems that intelligently perform a diverse range of tasks in a large variety of environments in the physical world. Specifically, my group is interested in developing algorithms and systems to provide robots with the abilities of perception and manipulation. I serve as a co-chair of Technical Committee on Robot Learning in the IEEE Robotics and Automation Society, and as an Associate Editor for IEEE Robotics and Automation Letters. I received my Ph.D. from Stanford University, advised by Professor Jeannette Bohg and co-advised by Professor Leonidas J. Guibas. Prior to joining Stanford, I was an undergraduate at Nanjing University. PhD Dissertation Committee Jeannette Bohg (Advisor) Leonidas J. Guibas (Co-advisor) Oussama Khatib J. Kenneth Salisbury Mark Cutkosky (Chair) News NEW [May, 2025] I will serve as an Associate Editor of IEEE Transactions on Robotics (TR-O)! NEW [May, 2025] Best Paper Award @ ICRA 2025 Workshop on Human-Centric Teleoperation! NEW [May, 2025] D(R,O) Grasp won Best Paper Award on Robot Manipulation and Locomotion at ICRA 2025! NEW [April, 2025] D(R,O) Grasp is selected as a finalist for Best Paper Award and Best Paper Award on Robot Manipulation and Locomotion at ICRA 2025! NEW [April, 2025] Manual2Skill is accepted to RSS 2025! NEW [Nov, 2024] D(R,O) Grasp won Best Robotics Paper Award at CoRL workshop NEW [Nov, 2024] Invited Talk at Stanford Vision and Learning Lab NEW [Sept, 2024] Invited Talk at CoRL 2024 Workshop on Differentiable Optimization Everywhere: Simulation, Estimation, Learning, and Control NEW [Sept, 2024] One paper was accepted to NeurIPS 2024 NEW [Sept, 2024] TieBot was accepted to CoRL 2024 as Oral [Sept, 2024] Two papers are accepted to CoRL 2024 [Aug, 2024] SAM-RL is accepted to IJRR [Aug, 2024] I serve as an Associate Editor at ICRA 2025 [July, 2024] Roller Grasper V3 was accepted to TR-O [July, 2024] Two papers were accepted to IROS 2024 Joining My Group I am looking for student researchers and postdocs to join my group at NUS. My group also has multiple positions for summer interns and visiting students. Please feel free to send me an email with your CV if you are interested in doing research with me. People Postdoc Jiajun Deng (University of Science and Technology of China) Wenqiang Xu (Shanghai Jiaotong University) PhD Students Chongkai Gao (Tsinghua University) Zhixuan Xu (Zhejiang University) Chenrui Tie (Peking University) Zixuan Liu (Tsinghua University) Junting Chen (ETH Zurich) Haonan Chen (Nanjing University) Yiwen Hou (University of Science and Technology of China) Tianrui Zhang (Tsinghua University) Fei Xin (Tsinghua University) Yuhang Zheng (Beihang University) Master's Students Debang Wang (National University of Singapore) Jiayu Luo (Beijing Institute of Technology) Zhehao Cai (Nanjing University of Aeronautics and Astronautics) Xiao Liu (Beihang University) Zeyu Liu (Tongji University) Jiayi Li (University of Nottingham) Yunfan Lou (Shandong University) Tongzhou Zhang (Tongji University) Zhewei Gui (Tongji University) Haotian Shi (Beijing University of Posts and Telecommunications) Li Zhongrui (South China University of Technology) Jinheng Li (East China Normal University) Visiting Scholar Zixuan Chen (Nanjing University, CSC funded) Research Assistants Xinyu Chen (Peking University) Jinxuan Zhu (Harbin Institute of Technology, Shenzhen) Jingxiang Guo (Harbin Institute of Technology, Shenzhen) Junxiao Li (Nanjing University) Xuanye Wu (Nanyang Technology University) Zhaoyu Mu (National University of Singapore) Xuchuan Huang (Peking University) Shengjia Zhu (Shanghai Jiaotong University) Junbo Wang (Shanghai Jiaotong University) Mohan Wang (Tongji University) Shuo Zhang (Shanghai Jiaotong University) Boren Zheng (Tsinghua University) Yixin Cao (East China Normal University) Yudi Lin (University of Southern California) Shengsong Huang (Georgia Institute of Technology) Zhenghao Chi (University of Chicago) Yiman Pang (Jilin University) Jinfeng Wang (Jilin University) Zheng Boren (Tsinghua University) Yiwei Liu (Sichuan University) Shengxiang Sun (University of Toronto) Wanqi Zhong (Harbin Institute of Technology) Huaicong Fang(Zhejiang University) Alumni Mingxin Yu (Peking University), Next Ph.D. student at MIT Yifan You (UCLA), Next Ph.D. student at Berkeley Shuo Cheng (UCSD), Next Ph.D. student at Georgia Tech Ruiqi Zhang (Tongji University), Next Ph.D. student at Berkeley Weikun Peng (Beihang University), Next Ph.D. student at Simon Fraser University Zhenyu Wei (Shanghai Jiaotong University), Next Ph.D. student at University of North Carolina at Chapel Hill Haoyu Zhou (Beihang University), Next Ph.D. student at Oxford Xunzhe Zhou (Fudan University), Next Ph.D. student at The University of Hong Kong Recent Publications T(R,O) Grasp: Efficient Graph Diffusion of Robot-Object Spatial Transformation for Cross-Embodiment Dexterous Grasping Xin Fei, Zhixuan Xu, Huaicong Fang, Tianrui Zhang, Lin ShaoArxiv paper project video VLA-OS: Structuring and Dissecting Planning Representations and Paradigms in Vision-Language-Action ModelsChongkai Gao, Zixuan Liu, Zhenghao Chi, Junshan Huang, Xin Fei, Yiwen Hou, Yuxuan Zhang, Yudi Lin, Zhirui Fang, Zeyu Jiang, Lin ShaoNeurIPS 2025 paper project video DexSinGrasp: Learning a Unified Policy for Dexterous Object Singulation and Grasping in Cluttered EnvironmentsLixin Xu*, Zixuan Liu*, Zhewei Gui, Jingxiang Guo, Zeyu Jiang, Zhixuan Xu, Chongkai Gao, Lin ShaoIEEE Robotics and Automation Letters paper project video MetaFold: Language-Guided Multi-Category Garment Folding Framework via Trajectory Generation and Foundation ModelHaonan Chen, Junxiao Li, Ruihai Wu, Yiwei Liu, Yiwen Hou, Zhixuan Xu, Jingxiang Guo, Chongkai Gao, Zhenyu Wei, Shensi Xu, Jiaqi Huang, Lin ShaoIEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2025 paper project video Manual2Skill: Learning to Read Manuals and Acquire Robotic Skills for Furniture Assembly Using Vision-Language Models Chenrui Tie, Shengxiang Sun, Jinxuan Zhu, Yiwei Liu, Jingxiang Guo, Yue Hu, Haonan Chen, Junting Chen, Ruihai Wu, Lin Shao Proceedings of Robotics: Science and Systems (RSS) 2025 paper project video TelePreview: A User-Friendly Teleoperation System with Virtual Arm Assistance for Enhanced Effectiveness Jingxiang Guo, Jiayu Luo, Zhenyu Wei, Yiwen Hou, Zhixuan Xu, Xiaoyi Lin, Chongkai Gao, Lin Shao Arxiv Best Paper Award @ ICRA 2025 Workshop on Human-Centric Teleoperation paper project video EMOS: Embodiment-aware Heterogeneous Multi-robot Operating System with LLM Agents Junting Chen, Checheng Yu, Xunzhe Zhou, Tianqi Xu, Yao Mu, Mengkang Hu, Wenqi Shao, Yikai Wang, Guohao Li, Lin Shao International Conference on Learning Representations (ICLR) 2025 paper project video FLIP: Flow-Centric Generative Planning as General-Purpose Manipulation World Model Chongkai Gao, Haozhuo Zhang, Zhixuan Xu, Zhehao Cai, Lin Shao International Conference on Learning Representations (ICLR) 2025 paper project video code D(R,O) Grasp: A Unified Representation of Robot and Object Interaction for Cross-Embodiment Dexterous Grasping Zhenyu Wei*, Zhixuan Xu*, Jingxiang Guo, Yiwen Hou, Chongkai Gao, Zhehao Cai, Jiayu Luo, Lin Shao IEEE International Conference on Robotics and Automation (ICRA) 2025 Best Robotics Paper Award at CoRL MAPoDeL Workshop Best Paper Award finalist at ICRA 2025 Best Paper Award on Robot Manipulation and Locomotion at ICRA 2025 paper project video code TieBot: Model-based Learning to Knot a Tie from Visual Demonstration via Differentiable Physics-based Simulation Weikun Peng, Jun Lv, Yuwei Zeng, Haonan Chen, Siheng Zhao, Jichen Sun, Cewu Lu, and Lin Shao Conference on Robot Learning (CoRL) 2024 (Oral) paper project video RiEMann: Near Real-Time SE(3)-Equivariant Robot Manipulation without Point Cloud Segmentation Chongkai Gao, Zhengrong Xue, Shuying Deng, Tianhai Liang, Siqi Yang, Lin Shao, Huazhe Xu Conference on Robot Learning (CoRL) 2024 paper project video Design and Control of Roller Grasper V3 for In-Hand Manipulation Shenli Yuan, Lin Shao, Yunhai Feng, Jiatong Sun, Teng Xue, Connor Yako, Jeannette Bohg, Kenneth Salisbury IEEE Transactions on Robotics paper project ManiFoundation Model for General-Purpose Robotic Manipulation of Contact Synthesis with Arbitrary Objects and Robots Zhixuan Xu*, Chongkai Gao*, Zixuan Liu*, Gang Yang*, Chenrui Tie, Haozhuo Zheng, Haoyu Zhou, Weikun Peng, Debang Wang, Tianyi Chen, Zhouliang Yu, Lin Shao IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2024 (Oral) paper project video code SoftMAC: Differentiable Soft Body Simulation with Forecast-based Contact Model and Two-way Coupling with Articulated Rigid Bodies and Clothes Min Liu, Gang Yang, Siyuan Luo, Chen Yu, and Lin Shao IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2024 paper project video Learning Reward for Robot Skills Using Large Language Models via Self-AlignmentYuwei Zeng, Yao Mu, Lin Shao International Conference on Machine Learning (ICML) 2024 paper project Generalizable Long-Horizon Manipulations with Large Language Models Haoyu Zhou, Mingyu Ding, Weikun Peng, Masayoshi Tomizuka, Lin Shao and Chuang Gan Arxiv paper project video Category-Level Multi-Part Multi-Joint 3D Shape AssemblyYichen Li, Kaichun Mo, Yueqi Duan, He Wang, Jiequan Zhang, Lin Shao, Wojciech Matusik and Leonidas J. Guibas IEEE/CVF Conference on Computer Vision and Pattern Recognition 2024 (CVPR) project video Jade: A Differentiable Physics Engine for Articulated Rigid Bodies with Intersection-Free Frictional Contact G",
  "content_length": 15856,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:18"
}