{
  "name": "Lin Tan 0001",
  "homepage": "https://www.cs.purdue.edu/homes/lintan",
  "status": "success",
  "content": "Lin Tan @ Purdue University Lin Tan home papers research software patents team teaching resources Mary J. Elmore New Frontiers Professor ELATES Fellow, ACM Distinguished Member, IEEE Senior member Department of Computer Science Purdue University Address: 305 N. University Street West Lafayette, IN 47907 Phone: 765-494-7190 Fax: 765-494-0739 Email: lintan at purdue.edu Bio: [bio] Our USEagent/USEbench paper accpeted to ICSE 2026! Unified Software Engineering Agent as AI Software Engineer [Preprint] Our CSnake: Detecting Self-Sustaining Cascading Failure via Causal Stitching of Fault Propagations paper accpeted to EuroSys 2026! Our CoRe paper accepted to NeurIPS 2025 (Spotlight)! CoRe: Benchmarking LLMs' Code Reasoning Capabilities through Static Analysis Tasks [Preprint] Check out CoRe code and data! Two papers accepted to ACL 2025 Main Conference: Can Language Models Replace Programmers for Coding? RepoCod Says 'Not Yet'. Check out our code generation benchmark RepoCod! WAFFLE: Webpage Multi-Modal Model for Automated Front-End Development. Our paper SELP: Generating Safe and Efficient Task Plans for Robot Agents with Large Language Models is an ICRA 2025 Best Paper Award Finalist, selected from 4,153 submissions! Check our SELP demo, data, and more! Our ICLR 2025 paper Nova: Generative Language Models for Assembly Code with Hierarchical Attention and Contrastive Learning is available. We have released our foundation models for binary code and fine-tuned models for binary code recovery. We have open positions for PhD and undergraduate students! Keynote speech \"Synergy of Software Reliability and Large Language Models\" at ICST 2024! Research Interests: Software-AI synergy; LLM4Code; Agentic AI; Software dependability; Software engineering; Defect detection and repair; Autoformalization; Software text analytics; Application of machine learning and natural language processing My Lab: ASSET Research Lab Preprints: Google Scholar Recent Peer-Reviewed Publications: (For a full list, click here) ICSE-26 Unified Software Engineering Agent as AI Software Engineer. Leonhard Applis, Yuntong Zhang, Shanchao Liang, Nan Jiang, Lin Tan, and Abhik Roychoudhury. [Preprint] Acceptance Rate: 24% (160/660) EuroSys-26 CSnake: Detecting Self-Sustaining Cascading Failure via Causal Stitching of Fault Propagations. Shangshu Qian, Lin Tan, and Yongle Zhang. Acceptance Rate: (79/467) 16.9%. NeurIPS-25 CoRe: Benchmarking LLMs' Code Reasoning Capabilities through Static Analysis Tasks. Danning Xie, Mingwei Zheng, Xuwei Liu, Jiannan Wang, Chengpeng Wang, Lin Tan, and Xiangyu Zhang. (Spotlight) [Preprint] Acceptance Rate: 2.8% (56/1,997) for Spotlight; 24.9% (497/1,995) for the Track. ACL-25 Can Language Models Replace Programmers for Coding? RepoCod Says 'Not Yet'. Shanchao Liang, Yiran Hu, Nan Jiang, and Lin Tan. ACL-25 WAFFLE: Webpage Multi-Modal Model for Automated Front-End Development. Shanchao Liang, Nan Jiang, Shangshu Qian, and Lin Tan. IEEE Security & Privacy-25 (Magazine) Challenges to Using Large Language Models in Code Generation and Repair. Liliana Pasquale, Antonino Sabetta, Marcelo d'Amorim, Péter Hegedüs, Mehdi Tarrit Mirakhorli, Hamed Okhravi, Mathias Payer, Awais Rashid, Joanna C. S. Santos, Jonathan M. Spring, Lin Tan, and Katja Tuma. ICRA-25 SELP: Generating Safe and Efficient Task Plans for Robot Agents with Large Language Models. Yi Wu, Zikang Xiong, Yiran Hu, Shreyash Iyengar, Nan Jiang, Aniket Bera, Lin Tan, and Suresh Jagannathan. Best Paper Award Finalist! ICSE-25/TSE (Journal First) D3: Differential Testing of Distributed Deep Learning with Model Generation. Jiannan Wang, Hung Viet Pham, Qi Li, Lin Tan, Yu Guo, Adnan Aziz, and Erik Meijer. ICLR-25 Nova: Generative Language Models for Assembly Code with Hierarchical Attention and Contrastive Learning. Nan Jiang, Chengxiao Wang, Kevin Liu, Xiangzhe Xu, Lin Tan, Xiangyu Zhang, and Petr Babkin. Acceptance Rate: 32.1% [Model] OOPSLA-25 Show Me Why It's Correct: Saving 1/3 of Debugging Time in Program Repair with Interactive Runtime Comparison. Ruixin Wang, Zhongkai Zhao, Le Fang, Nan Jiang, Yiling Lou, Lin Tan, and Tianyi Zhang. SANER-25 How Effective are Large Language Models in Generating Software Specifications? Danning Xie, Byoungwoo Yoo, Nan Jiang, Mijung Kim, Lin Tan, Xiangyu Zhang, and Judy Lee Acceptance Rate: 23% (52/225) AAAI-25 LATTE: Improving Latex Recognition for Tables and Formulae with Iterative Refinement. Nan Jiang, Shanchao Liang, Chengxiao Wang, Jiannan Wang, and Lin Tan. Acceptance Rate: 23.4% [Data] [Poster] NDSS-25 Unleashing the Power of Generative Model in Recovering Variable Names from Stripped Binary. Xiangzhe Xu, Zhuo Zhang, Zian Su, Ziyang Huang, Shiwei Feng, Yapeng Ye, Nan Jiang, Danning Xie, Siyuan Cheng, Lin Tan, and Xiangyu Zhang. CCS-24 ReSym: Harnessing LLMs to Recover Variable and Data Structure Symbols from Stripped Binaries. Danning Xie, Zhuo Zhang, Nan Jiang, Xiangzhe Xu, Lin Tan, and Xiangyu Zhang. Won Distinguished Paper Award! [Code & Data] TOSEM-24 (Journal) When Automated Program Repair Meets Regression Testing---An Extensive Study on 2 Million Patches. Yiling Lou, Jun Yang, Samuel Benton, Dan Hao, Lin Tan, Zhenpeng Chen, Lu Zhang, and Lingming Zhang. SANER-24 (Industrial) CEDAR: Continuous Testing of Deep Learning Libraries. Danning Xie, Jiannan Wang, Hung Viet Pham, Lin Tan, Yu Guo, Adnan Aziz, and Erik Meijer. [Poster] AAAI-23 DisGUIDE: Disagreement-Guided Data-Free Model Extraction. (Oral Presentation) Jonathan Rosenthal, Eric Enouen, Hung Viet Pham, and Lin Tan. Acceptance Rate: 19.6% [Code & Data] Selected Awards and Recognitions: Press: Building Sustainable Partnerships, Purdue CS News (ICRA25 Best Paper Award Finalist), Purdue CS News (University Faculty Scholar), Purdue CS News (CCS24 Best Paper Award), Purdue Science News (ELATES Fellow), Purdue CS News (AAAI23 papers), U of Illinois CS News (Alumni Awards), ACM News (Distinguished Scientists), Purdue CS News (ACM Distinguished Scientist), Purdue CS News (Alumni Award), Purdue News (Named Professorship), Purdue CS News (Named Professorship), Purdue CS News (Distinguished Paper Award), UWaterloo Cheriton CS News (Distinguished Paper Award), Purdue CS News (Facebook Award), Engineering Dimensions (Page 42), The Record (Pages 46 & 47), Marketwired, UWaterloo News (Google Award) 2025-2014 Best Paper Award Finalist, ICRA 2025 ELATES Fellow, 2024-2025 ACM SIGSAC Distinguished Paper Award, CCS 2024 J.P.Morgan AI Faculty Research Award 2022 (1 o 9 recipients worldwide in \"AI to Empower Employees\") J.P.Morgan AI Faculty Research Award 2021 (1 o 7 recipients worldwide in \"Establish Ethical and Socially Good AI\") University of Illinois, Urbana-Champaign - Academic Achievement Alumni Award, 2021 ACM SIGSOFT Distinguished Paper Award, ASE 2020 J.P.Morgan AI Faculty Research Award 2020 (1 o 5 recipients worldwide in \"Establish Ethical and Socially Good AI\") Meta/Facebook Research Award - Probability and Programming 2020 (1 of 19 recipients worldwide) Meta/Facebook Research Award - Probability and Programming 2019 (1 of 10 recipients worldwide) ACM SIGSOFT Distinguished Paper Award, MSR 2018 Canada Research Chair (CRC), 2017 ACM SIGSOFT Distinguished Paper Award, FSE 2016 Ontario Professional Engineers Awards - Engineering Medal for Young Engineer Award 2016 University of Waterloo Outstanding Performance Award 2016 Ontario Early Researcher Award (ERA) 2015 NSERC Discovery Accelerator Supplements (DAS) Award 2015 (One of 125 researchers chosen from 3,159 NSERC Discovery Grant applicants across all science and engineering fields) IBM CAS Research Project of the Year Award 2015 Google Faculty Research Award 2014 (1 of 7 recipients worldwide in Software Engineering) Google Faculty Research Award 2010 (1 of 4 recipients worldwide in Software Engineering) IBM PhD Fellowship 2008-2009 IEEE Micro Top Picks from Computer Architecture Conferences 2006 Recent Professional Service: 2026: LLM4Code'26 Co-Founder & Co-Chair SIGSOFT Impact paper Award 2026 2025: ICSE'25 Area Co-Chair SIGSOFT Senior Awards (Research, Service, and Educator) 2025 LLM4Code'25 Co-Founder & Co-Chair 2024: FSE'24 Program Co-Chair LLM4Code'24 Co-Founder & Co-Chair 2021-2024: ACM SIGSOFT Executive Committee: Member-at-Large 2023: ICSE'23 PC 2017-2022: Transactions on Software Engineering (TSE) Associate Editor 2022: FSE'22 PC 2015-2021: Empirical Software Engineering Journal Editor 2021: ASPLOS'21 PC; ISSTA'21 PC Education: PhD in Computer Science from the University of Illinois, Urbana-Champaign BS in Computer Science and Technology from Zhejiang University",
  "content_length": 8611,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:19"
}