{
  "name": "Lin Yang 0011",
  "homepage": "https://lyang36.github.io",
  "status": "success",
  "content": "LIN F. YANG 杨林 Dr. Lin Yang (杨林) is currently an Associate Professor (tenured, 2025/07-) in the Electrical and Computer Engineering Department and Computer Science Department at the University of California, Los Angeles. His research focuses on the foundations of modern machine learning and data science. He develops fast algorithms with provable guarantees, especially in reinforcement learning, large language model acceleration, non-convex optimization, and streaming algorithms. He is particularly interested in safe and efficient decision-making under uncertainty, bridging theoretical insights with real-world impact in areas such as healthcare, robotics, and scientific discovery. Dr. Yang is a recipient of an Amazon Faculty Award, the Simons Research Fellowship, Dean Robert H. Roy Fellowship, and the JHU MINDS Best Dissertation Award. Prior to joining UCLA, he was a postdoctoral researcher at Princeton University working with Prof. Mengdi Wang. He received dual Ph.D. degrees in Computer Science and in Physics & Astronomy from Johns Hopkins University, advised by Alex Szalay and Vova Braverman. [Last updated Mar. 2025] Publications Visit my Google Scholar or DBLP for a full list of publications. Service Area Chair: ICLR, AISTATS, ICML, NeurIPS Senior Program Committee: AAAI Conference Reviewing: AAAI, ICML, NeurIPS, STOC, FOCS, COLT, PODS, ITCS, ACML, AISTATS, ICALP, RANDOM, ESA, LATIN, KAIS, FSTTCS Journal Reviewing: Theoretical Computer Science, QIC, JCSS, OPRE, TMLR People Students Yunfan Li Chang Liu Lawrence Liu Alumni Osama Hanna (co-advising with Prof. Christina Fragouli. First Job: Meta) Jialin Dong (First Job: SAP Labs) Sanae Amani (First Job: Paypal) Masoud Monajatipoor (co-advising with Kai-Wei Chang, First Job: Optum) Fei Feng (co-advising with Wotao Yin) (First Job: Pintrests) Qiwen Cui (former undergraduate advisee, Ph.D. degree from UW) Kunhe Yang (former undergraduate advisee, Now Ph.D. student @ Berkerley) Junhong Shen (former undergraduate advisee, Now Ph.D. student @ CMU) Jinghan Wang (former undergraduate advisee, Now Ph.D. student @ UMD) Dingwen Kong (former undergraduate advisee, Now Ph.D. student @ MIT) Education Johns Hopkins University, Baltimore, MD Ph.D. in Computer Science, Advisors: Vladimir Braverman, Alex Szalay Ph.D. in Physics & Astronomy, Advisor: Alex Szalay MS.E. in Computer Science (GPA 4.0/4.0) Tsinghua University, Beijing, China B.S. in Math & Physics with High Honors Contact Me Email: linyang[at]ee[dot]ucla[dot]edu My middle name Forrest is a translation of my first name (林). My publication name is Lin F. Yang -- to distinguish me from many Lin Yang's. Note that my official name (Lin Yang OR 杨林) does not contain a middle name. Design: partially based on HTML5 UP Source Code",
  "content_length": 2761,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:18"
}