{
  "name": "Lin Lv",
  "homepage": "https://irc.cs.sdu.edu.cn/~lulin/index.html",
  "status": "success",
  "content": "Dr. Lin Lu's Homepage Chinese Version Prof. Dr. Lin Lu Affiliation: School of Computer Science and Technology, Shandong University Address: Room 412, Dizhou Building#C, 72 Binhai Highway, Qingdao, Shandong Province, P.R. China Zip Code: 266237 Email: llu AT sdu.edu.cn or lulin.linda AT gmail.com [Bio] [Research Interests] [Publications] [Grants] [Activities] [Teaching] [Students] [Links] [Gallery] Bio Lin Lu is a professor at the School of Computer Science and Technology, Shandong University (SDU), and a member of the Interdisciplinary Research Center (IRC). She received a Ph.D. degree in Computer Science from The University of Hong Kong in 2011. From 2007 to 2009, she visited the French National Institute for Research in Digital Science and Technology (INRIA) for one year. She received B.Eng. and M.Eng. degrees in the School of Computer Science and Technology at Shandong University in 2002 and 2005, respectively. Her research primarily revolves around computer graphics, with a particular focus on geometric computation in digital fabrication. She has published more than 80 research papers (including one highly cited ESI), one monograph, and more than 40 authorized patents. She served as the program co-chair for conferences such as GMP 2020, ICVRV 2021, and CSIAM GDC 2024. See more details in the Chinese version. Research Interests Computer Graphics Geometric Computing Computational Fabrication Professional Experiences 11/2008 - 04/2009, Research Intern, Project Alice, INRIA, Nancy, France 03/2007 - 09/2007, Research Intern, Project Evasion, INRIA, Grenoble, France Selected Publications [Google Scholar] [ResearchGate] [ORCID] [DBLP] [Scopus] Yu Xing, Yang Liu, Lipeng Chen, Huiping Tang, Lin Lu*, PCG-Informed Neural Solvers for High-Resolution Homogenization of Periodic Microstructures, preprint [ArXiv] Longdu Liu, Xiangjun Wu, Jiqiang Huang, Lingxin Cao*, Xiaokang Liu, Changhe Tu, Lin Lu*, Principal Stress Field-guided Optimization for Rib Structure Generation, Computer-Aided Design, Volume 189, December 2025, 103955. [Link] Fanchao Zhong, Zhenmin Zhang, Liyuan Wang, Xin Yan, Jikai Liu, Lin Lu, Haisen Zhao*, Waste-to-Value: Reutilized Material Maximization for Additive and Subtractive Hybrid Remanufacturing, ACM SIGGRAPH Asia 2025 (Journal track, TOG). [Project Page] Zhenmin Zhang, Shuai Feng, Hao Xu, Lujiaoyang Fu, Lin Lu, Jianwei Guo, Haisen Zhao*, Chapper: Carvable Hull-and-Pack for Subtractive Manufacturing, ACM SIGGRAPH Asia 2025 (Journal track, TOG). [Project Page] Tianyang Xue, Lin Lu*, Yang Liu, Mingdong Wu, Hao Dong, Yanbin Zhang, Renmin Han, Baoquan Chen, GFPack++: Improving 2D Irregular Packing by Learning Gradient Field with Attention, ICCV 2025 Highlight, October 2025. [ArXiv: 2406.07579][Codes and Data] Tianyang Xue, Longdu Liu, Lin Lu*, Paul Herderson, Pengbin Tang, Haochen Li, Jikai Liu, Haisen Zhao, Hao Peng, Bernd Bickel, MIND: Microstructure INverse Design with Generative Hybrid Neural Representation, SIGGRAPH 2025 Conference Paper, August 2025. [ArXiv: 2502.02607] [Link] [Project Page] (Open access) Weizheng Zhang, Hao Pan, Lin Lu*, Xiaowei Duan, Xin Yan, Ruonan Wang, Qiang Du, DualMS: Implicit Dual-Channel Minimal Surface Optimization for Heat Exchanger Design, SIGGRAPH 2025 Conference Paper, August 2025. [ArXiv: 2504.02830] [Link] [Project Page] Fanchao Zhong, Yang Wang, Peng-Shuai Wang, Lin Lu, Haisen Zhao*, DeepMill: Neural Accessibility Learning for Subtractive Manufacturing, SIGGRAPH 2025 Conference Paper, August 2025. [ArXiv: 2502.06093] [Link] [Project Page] Bingteng Sun, Xin Yan*, Yang Xia*, Xiaoping Tian, Qiang Du, Lin Lu*, Energy Absorption Optimization of Parametric Plate Lattices, Computers & Structures, Volume 316, September 2025, 107880. [Link] Haochen Li, Bingteng Sun, Lingxin Cao, Xin Yan*, Lin Lu*, A Parametric Model of Joint-Enhanced Truss Lattices with Optimization for Superior Mechanical Properties, Materials & Design, Volume 254, June 2025, 113969. [Link] (Open access) Lihao Tian, Zhongren Wang, Xiaokang Liu, Kaifeng Tian, Andrei Sharf, Lin Lu*, Fabricable Stochastic Periodic Porous Microstructures: A Wang Cube and Gaussian Kernel Approach, Additive Manufacturing, March 2025, 104739. [Link] Lingxin Cao, Xin Yan, Longdu Liu, Jikai Liu, Tengfei Jiang, Lin Lu*, Auto-Support: Traction Force Constrained Support Structures Optimization for Bottom-up Vat Photopolymerization, Virtual and Physical Prototyping, Volume 20, Issue 1, February 2025. [Link] (Open access) Shuzhi Xu, Jikai Liu*, Kentaro Yaji, Lin Lu, Topology Optimization for Hybrid Additive-Subtractive Manufacturing Incorporating Dynamic Process Planning, Computer Methods in Applied Mechanics and Engineering, Volume 431, 1 November 2024, 117270.[Link] Lihao Tian, Bingteng Sun, Xin Yan*, Andrei Sharf, Changhe Tu, Lin Lu*, Continuous Transitions of Triply Periodic Minimal Surfaces, Additive Manufacturing, Volume 84, 25 March 2024, 104105.[Link] Yu Xing, Xiaoxuan Wang, Lin Lu*, Andrei Sharf, Daniel Cohen-Or, Changhe Tu, Shell Stand: Stable Thin Shell Models for 3D Fabrication, Computational Visual Media, 2024. [Link] (Open access) Xiaokang Liu, Lin Lu*, Lingxin Cao, Oliver Deussen, Changhe Tu, Auxetic Dihedral Escher Tessellations, Graphical Models, Volume 133, June 2024, 101215. (CVM 2024) [Link][Project page] Tianyang Xue, Mingdong Wu, Lin Lu*, Haoxuan Wang, Hao Dong, Baoquan Chen, Learning Gradient Fields for Scalable and Generalizable Irregular Packing, SIGGRAPH Asia 2023 Conference Paper, December 2023, Article No.: 105, Pages 1–11. [ArXiv: 2310.19814][Project page][Link] Fanchao Zhong, Haisen Zhao*, Haochen Li, Xin Yan, Jikai Liu, Baoquan Chen, Lin Lu*, VASCO: Volume and Surface Co-Decomposition for Hybrid Manufacturing, ACM Transactions on Graphics (TOG), Volume 42, Issue 6, Article No.: 188, pp 1–17, 05 December 2023. (ACM SIGGRAPH Asia 2023).[Project page][Link] Fanchao Zhong, Yonglai Xu, Haisen Zhao*, Lin Lu*, As-Continuous-As-Possible Extrusion-based Fabrication of Surface Models, ACM Transactions on Graphics (TOG), Volume 42, Issue 3, Article No.:26, pp 1–16, 17 March 2023. [ArXiv: 2201.02374][Project page] [Link][Code Available] Peiqing Liu, Lin Lu, Jikai Liu*, Path-driven Shell Lattices Designed for Continuous Fiber Composite 3D Printing, Additive Manufacturing, Volume 78, 25 September 2023, 103838. [Link] Lingxin Cao, Lin Lu*, Xiaokang Liu, Jian Zhang, Tengfei Jiang, Changhe Tu, Baoquan Chen, Waiting Time Prediction for Bottom-up Vat Photopolymerization, Additive Manufacturing, Volume 74, 25 July 2023, 103693. [Link] Yonglai Xu, Hao Pan, Ruonan Wang, Qiang Du, Lin Lu*, New Families of Triply Periodic Minimal Surface-like Shell Lattices, Additive Manufacturing, Volume 77, 5 September 2023, 103779. [Link][Some models (more on request) ] Bingteng Sun, Xin Yan, Peiqing Liu, Yang Xia, Lin Lu*, Parametric Plate Lattices: Modeling and Optimization of Plate Lattices with Superior Mechanical Properties, Additive Manufacturing, Volume 72, 25 June 2023, 103626. [Link] Peiqing Liu, Bingteng Sun, Jikai Liu, Lin Lu*, Parametric Shell Lattice with Tailored Mechanical Properties, Additive Manufacturing, Volume 60, Part B, December 2022, 103258. [Link] [Some models (more on request) ] Hao Peng, An Liu, Jingcheng Huang, Lingxin Cao, Jikai Liu, Lin Lu*, PH-Net: Parallelepiped Microstructure Homogenization via 3D Convolutional Neural Networks, Additive Manufacturing, Volume 60, Part A, December 2022, 103237. [Link] [ArXiv: 2201.09672] [Code Available] Tianyang Xue, Lin Lu*, Andrei Sharf, Lihao Tian, Haochen Li, DancingPottery: Posture-Driven Pottery Generative Design and Fabrication, ACM SCF 2022: Symposium on Computational Fabrication. [Link] Xiaokang Liu, Chenran Li, Lin Lu*, Oliver Deussen, Changhe Tu, Fabricable Multi-Scale Wang Tiles, Computer Graphics Forum, 41: 149-159. (Eurographics Symposium on Geometry Processing (SGP) 2022) [Project page][Link] Shuangmin Chen, Rui Xu, Jian Xu, Shiqing Xin*, Changhe Tu, Chenglei Yang, Lin Lu, QuickCSGModeling: Quick CSG Operations Based on Fusing Signed Distance Fields for VR Modeling, ACM Transactions on Multimedia Computing, Communications, and Applications, May 2023. (Also appeared in I3D'22: Symposium on Interactive 3D Graphics and Games). [Link] Han Chen, Minghai Chen, Lin Lu*, 3D Printed Hair Modeling from Strand-level Hairstyles,Graphical Models, Volume 121, May 2022, 101135. [Link] Xin Yan, Lin Lu*, Andrei Sharf, Xing Yu, Yulu Sun, Man-made by Computer: On-the-Fly Fine Texture 3D Printing, ACM SCF 2021: Symposium on Computational Fabrication, October 2021, Article No.: 6, Pages 1-10. [Link] [Project page] Peiqing Liu, An Liu, Hao Peng, Lihao Tian, Jikai Liu, Lin Lu*, Mechanical Property Profiles of Microstructures via Asymptotic Homogenization, Computers & Graphics, Volume 100, November 2021, Pages 106-115. [Link] Yu Xing, Yu Zhou, Xin Yan, Haisen Zhao, Wenqiang Liu, Jingbo Jiang, Lin Lu*, Shell Thickening for Extrusion-Based Ceramics Printing, Computers & Graphics, Volume 97, June 2021, Pages 160-169. [Link] Yu Zhou, Wenqiang Liu, Fanchao Zhong, Xin Yan, Lin Lu*, Two-Scale Lofted Surfaces Modeling for Ceramic 3D Printing, Journal of Computer-Aided Design & Computer Graphics, 2021, 33 (7): 1132-1140 (in Chinese). [Link] Rui Yin, Longdu Liu, Qingjie Huang*, Lin Lu*, Hongliang Yang, et al., Integrated Ultrahigh-Sensitivity Temperature Sensor Based on Asymmetric Mach-Zehnder Interferometer and Stress Deformation of Aluminum-SiO2, IEEE Transactions on Instrumentation and Measurement, Volume 70, September 2021. [Link] Rui Yin, Lingxin Cao, Qingjie Huang*, Hongliang Yang, Lin Lu*, et al., Universal Ultra-sensitive Refractive Index Sensor based on an Integrated SiO2 Asymmetric Mach-Zehnder Interference Filter (AMZIF), Measurement, Volume 188, January 2022, 110578. [Link] Rui Yin, Qingjie Huang*, Hongliang Yang, Lin Lu*, Lingxin Cao, Wei Ji, et al., Integrated-optics Pressure Sensor with Improved Range and Sensitivity based on a SiO2 Arrayed Waveguide Grating (AWG) and a 3D Pr",
  "content_length": 26272,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:17"
}