{
  "name": "Lina Ochoa-Venegas",
  "homepage": "https://research.tue.nl/en/persons/lina-ochoa-venegas",
  "status": "success",
  "content": "Lina Ochoa Venegas - Research portal Eindhoven University of Technology View Scopus Profile Lina Ochoa Venegas, Ph.D. Assistant Professor, EAISI High Tech SystemsAssistant Professor, Mathematics and Computer Science, Software Engineering and Technology Emaill.m.ochoa.venegastuenl 452 Citations - based on content available in repository [source: Scopus] 20152025 Content available in repository Fingerprint Dive into the research topics where Lina Ochoa Venegas is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Constraint Programming Computer Science 100% Web Application Computer Science 80% Microservice Computer Science 80% Decision-Making Computer Science 80% Software Systems Computer Science 80% Static Program Analysis Computer Science 80% Nonfunctional Property Computer Science 68% Microservice Architecture Computer Science 60% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Content available in repository 2015 2017 2024 2025 2025 14 Conference contribution 5 Article 1 Paper 1 Review article 2 More 1 Phd Thesis 1 (Research TU/e / Graduation TU/e) 1 Preprint Content available in repository Content available in repository Characterising Harmful API Uses and Repair Techniques: Insights from a Systematic ReviewOchoa Venegas, L. (Corresponding author), Hammad, M., Giray, G., Babur, Ö. & Bennin, K. E., Aug 2025, In: Computer Science Review. 57, 26 p., 100732.Research output: Contribution to journal › Review article › peer-review Open AccessFile Software Development 100% Research Problem 100% Triggering Event 100% Security Vulnerability 100% Undesired Effect 100% 2 Citations (Scopus) 43 Downloads (Pure) From Expert to Novice: An Empirical Study on Software Architecture ExplanationsRukmono, S. A., Zamfirov, F., Ochoa, L. & Chaudron, M., 11 Mar 2025, arXiv.org, 22 p.Research output: Working paper › Preprint › Professional Open AccessFile Software Architecture 100% Software Development 25% Knowledge Transfer 25% Architectural Concern 25% Surrounding Context 25% 25 Downloads (Pure) \"Making Our Life Less Monotonous\" or \"Just Tick Things Off\": An Exploratory Multi-Method Study of ToilKafoe, T., Ochoa Venegas, L., Siravuru, S. & Serebrenik, A., 20 Jun 2025, (Accepted/In press) 48th IEEE/ACM International Conference on Software Engineering. Institute of Electrical and Electronics EngineersResearch output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile Service Management 100% Cost Complexity 100% DevOps 100% Semistructured Interview 100% Negative Impact 100% 19 Downloads (Pure) Personalization of Programming Education: An NLP-Based Bi-dimensional Classification of Programming ExercisesLombarts, T., Walravens, G., Seraj, M., Ochoa Venegas, L. & van den Brand, M. G. J., 9 Oct 2025, SPLASH-E'25: Proceedings of the 2025 ACM SIGPLAN International Symposium on SPLASH-E. Henz, M., Hermans, F. & Patterson, D. (eds.). New York: Association for Computing Machinery, Inc., p. 90-101 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile Natural Language Processing 100% Lexicon-Based Approach 50% 8 Downloads (Pure) Roseau: Fast, Accurate, Source-based API Breaking Change Analysis in JavaLatappy, C., Degueule, T., Falleri, J.-R., Robbes, R. & Ochoa, L., 23 Jul 2025, (Accepted/In press).Research output: Contribution to conference › Paper › Academic File Software Library 100% Static Program Analysis 50% Lines of Code 50% Analysis Capability 50% Bytecode 50% 3 Downloads (Pure) View all 23 research outputs Datasets Artifact - Roseau: Fast, Accurate, Source-based Breaking Change Analysis in JavaLatappy, C. (Creator), Degueule, T. (Creator), Falleri-Vialard, J.-R. (Creator), Robbes, R. (Creator) & Ochoa Venegas, L. M. (Creator), Zenodo, 19 Aug 2025DOI: 10.5281/zenodo.15536417Dataset: Software BreakBot: Static Reverse Dependency Compatibility Testing for Java Libraries (Artefacts)Ochoa Venegas, L. (Contributor), Degueule, T. F. (Contributor), Falleri, J.-R. (Contributor) & Vinju, J. J. (Contributor), Zenodo, 23 Dec 2022DOI: 10.5281/zenodo.7475823, https://zenodo.org/record/7475823Dataset Break the Code? Breaking Changes and Their Impact on Software Evolution (Artefacts)Ochoa, L. (Contributor), Vinju, J. J. (Supervisor), van den Brand, M. G. J. (Supervisor) & Degueule, T. F. (Supervisor), Zenodo, 23 Dec 2022DOI: 10.5281/zenodo.7466409, https://zenodo.org/record/7466409 and one more link, https://zenodo.org/record/7651509 (show fewer)Dataset Supplementary material for the paper \"Personalization of Programming Education: An NLP-based Bi-dimensional Classification of Programming Exercises\"Lombarts, T. (Creator), Walravens, G. (Creator), Seraj, M. (Creator), Ochoa Venegas, L. (Creator) & van den Brand, M. (Creator), Figshare, 14 Aug 2025DOI: 10.6084/m9.figshare.29437490Dataset: Software Prizes 2022 ICSE NIER-track Best Paper AwardOchoa Venegas, L. (Recipient), 2022Prize: Other › Career, activity or publication related prizes (lifetime, best paper, poster etc.) › Scientific 2023 MSR Distinguished Reviewer AwardOchoa Venegas, L. (Recipient), 2023Prize: Other › Career, activity or publication related prizes (lifetime, best paper, poster etc.) › Scientific 2024 EASE Distinguished Reviewer AwardOchoa Venegas, L. (Recipient), 2024Prize: Other › Career, activity or publication related prizes (lifetime, best paper, poster etc.) › Scientific 2025 ICPC Distinguished Reviewer AwardOchoa Venegas, L. (Recipient), 2025Prize: Other › Career, activity or publication related prizes (lifetime, best paper, poster etc.) › Scientific 2025 ICSME Distinguished Paper AwardOchoa Venegas, L. (Recipient), 2025Prize: Other › Career, activity or publication related prizes (lifetime, best paper, poster etc.) › Scientific Java 100% View all 8 prizes Activities Activities per year 2023 2023 2024 2025 2025 4 Invited talk Activities per year Program Analysis and AI for Legacy Code ModernisationOchoa Venegas, L. (Speaker)7 Oct 2025Activity: Talk or presentation types › Invited talk › Professional File Upgrading Without Assimilation: A Backwards Compatibility PerspectiveOchoa Venegas, L. (Speaker)23 May 2025Activity: Talk or presentation types › Invited talk › Scientific File Unveiling Software Architecture with Generative AIOchoa Venegas, L. (Speaker)26 Jan 2024Activity: Talk or presentation types › Invited talk › Professional File To Evolve or not to Evolve? The library-client co-evolution dilemmaOchoa Venegas, L. (Speaker)12 Oct 2023Activity: Talk or presentation types › Invited talk › Professional File Courses Programming1/09/12 → …Course Programming1/09/15 → …Course Programming for Applied Physics1/09/23 → …Course Software Evolution1/09/15 → …Course Press/Media Met meer tooling kan beter geanticipeerd worden op ‘breaking changes'Ochoa Venegas, L.1/06/231 Media contributionPress/Media: Public Engagement Activities Break the Code? Breaking Changes and Their Impact on Software Evolutionvan den Brand, M. G. J., Ochoa Venegas, L. & Vinju, J. J.7/04/231 item of Media coveragePress/Media: Expert Comment",
  "content_length": 7530,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:21"
}