{
  "name": "Linda R. Petzold",
  "homepage": "https://cse.cs.ucsb.edu",
  "status": "success",
  "content": "Computational Science and Engineering Research Group | UC Santa Barbara Skip to main content Welcome to the Computational Science and Engineering Research Group We focus on mathematical modeling and machine learning, applied to networked systems in biology and medicine.Current projects include development of algorithms and software for both simulation and inference of discrete stochastic systems, uses of machine learning applied to medical data to improve the care of trauma patients, mathematical modeling of brain processes in migraine, unraveling neural communication in learning, inference of network structure of communities of neurons, and mathematical modeling of the process of cell polarization. Announcements & News Yuqing Passes Proposal Exam Congratulations to Yuqing Wang for passing her Proposal Exam in Computer Science on June 8, 2022. Dengxian (Dara) Passes MAE Congratulations to Dengxian (Dara) Yang for successfully passing her Major Area Exam (MAE) in Computer Science on June 6, 2022! Richard Jiang Graduates! Richard Jiang successfully defended his PhD thesis in Computer Science in October. Richard is now a Data Science Consultant at Accenture. Congratulations, Richard! Bruno Jacob Graduates! On, Monday, August 2, 2021, Bruno successfully defended his thesis in Mechanical Engineering. Bruno is staying local and accepted a job at Carpe Data in Santa Barbara. Congratulations, Bruno! James Bird Graduates! James successfully defended his thesis on 5/12/2021. James will begin his post-PhD career at the University of Colorado at Boulder. Congratulations, James! more Recent Publications gkac331.pdf Bilal Shaikh, Lucian P Smith, Dan Vasilescu, Gnaneswara Marupilla, Michael Wilson, Eran Agmon, Henry Agnew, Steven S Andrews, Azraf Anwar, Moritz E Beber, Frank T Bergmann, David Brooks, Lutz Brusch, Laurence Calzone, Kiri Choi, Joshua Cooper, John Detloff, Brian Drawert, Michel Dumontier, G Bard Ermentrout, James R Faeder, Andrew P Freiburger, Fabian Fröhlich, Akira Funahashi, Alan Garny, John H Gennari, Padraig Gleeson, Anne Goelzer, Zachary Haiman, Jan Hasenauer, Joseph L Hellerstein, Henning Hermjakob, Stefan Hoops, Jon C Ison, Diego Jahn, Henry V Jakubowski, Ryann Jordan, Matúš Kalaš, Matthias König, Wolfram Liebermeister, Rahuman S Malik Sheriff, Synchon Mandal, Robert McDougal, J Kyle Medley, Pedro Mendes, Robert Müller, Chris J Myers, Aurelien Naldi, Tung V N Nguyen, David P Nickerson, Brett G Olivier, Drashti Patoliya, Loïc Paulevé, Linda R Petzold, Ankita Priya, Anand K Rampadarath, Johann M Rohwer, Ali S Saglam, Dilawar Singh, Ankur Sinha, Jacky Snoep, Hugh Sorby, Ryan Spangler, Jörn Starruß, Payton J Thomas, David van Niekerk, Daniel Weindl, Fengkai Zhang, Anna Zhukova, Arthur P Goldberg, James C Schaff, Michael L Blinov, Herbert M Sauro, Ion I Moraru, Jonathan R Karr (2022). BioSimulators: a central registry of simulation engines and services for recommending specific tools. Nucleic Acids Research, gkac331 doi: 10.1093/nar/gkac331 journal.pcbi_.1009830.pdf Jiang, R., Singh, P., Wrede, F., Hellander, A., & Petzold, L. (2022). Identification of dynamic mass-action biochemical reaction networks using sparse Bayesian methods. PLoS Comput. Biol. 18(1): e1009830 doi: 10.1371/journal.pcbi.1009830 | PMCID: PMC8830701 rsos.211908.pdf Doering, G. N., Drawert, B., Lee, C., Pruitt, J. N., Petzold, L. R. and Dalnoki-Veress, K. (2022). Noise resistant synchronization and collective rhythm switching in a model of animal group locomotion. R. Soc. open sci.9211908211908 doi: 10.1098/rsos.211908 an_analysis_of_relation_extraction_within_sentences_from_wet_lab_protocols.pdf Yang, X., Zhang, X., Zuo, J., Wilson, S., & Petzold, L. (2021). An Analysis of Relation Extraction within Sentences from Wet Lab Protocols. 2021 IEEE International Conference on Big Data (Big Data) Conference Proceedings. accepted_preprint.pdf Jacob, B., Drawert, B., Yi, T-M, & Petzold, L. (2021). An arbitrary Lagrangian Eulerian smoothed particle hydrodynamics (ALE-SPH) method with a boundary volume fraction formulation for fluid-structure interaction. Engineering Analysis with Boundary Elements 128, 274-289. doi: 10.1016/j.enganabound.2021.04.006 | PMCID: PMC8143034 See all publications Contact For further information, please contact: Professor Linda Petzold Dept. of Computer Science Dept. of Mechanical Engineering BioEngineering Bldg. Room 3106 University of California, Santa Barbara Santa Barbara, CA 93106-5100 email: petzold [at] cs [dot] ucsb [dot] edu phone: 805 893 5362 Links University of California - Santa Barbara Computational Science and Engineering Program Department of Computer Science Department of Mechanical Engineering Department of Mathematics",
  "content_length": 4710,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:23"
}