{
  "name": "Lingjie Liu",
  "homepage": "https://lingjie0206.github.io",
  "status": "success",
  "content": "Lingjie Liu About Me. I am the Aravind K. Joshi Assistant Professor in the Department of Computer and Information Science at the University of Pennsylvania, where I lead the Penn Computer Graphics Lab and I am also a member of the General Robotics, Automation, Sensing & Perception (GRASP) Lab. Previously, I was a Lise Meitner Postdoctoral Research Fellow at Max Planck Institute for Informatics. I received my Ph.D. degree at the University of Hong Kong in 2019. My research interests are at the interface of Computer Graphics, Computer Vision, and AI, with a focus on Neural Scene Representations, Neural Rendering, Human Performance Modeling and Capture, and 3D Reconstruction. I am especially excited about exploring a new genre of 3D reconstruction and rendering algorithms for human characters and general scenes, which combine classical computer graphics pipelines with deep learning techniques. My long-term vision is to develop AI technologies that can perceive, understand and interact with 3D objects, people, and environments. Specifically, my research will pursue three goals: (1) High-quality 3D reconstruction of real-world scenes from sparse inputs; (2) Efficient and photo-realistic image synthesis of real-world scenes with 3D control; (3) Large-scale 3D scene generation. Prospective Students. There are multiple open research positions in my Lab. Topics of interest include: Neural Representations and Rendering for 3D/4D Reconstruction Physics-Grounded 3D/4D Reconstruction 3D/Video World Simulator Physics-based Human Motion Generation Humanoid Robotics Other topics in Graphics, Vision and Robotics If you are interested in visiting or applying for a research position (e.g., intern, PhD, visiting PhD, or postdoc) in the lab, please fill in the form. We review the form submissions on a biweekly basis. You will be contacted if a fit can be found. Due to the high volume of emails regarding applications, please refrain from emailing me directly. Thank you! [For 2026 PhD Applicants] I am hiring multiple PhD students for 2026. If you’re interested, please apply directly through our Department's application system and list my name as your preferred supervisor (Deadline: December 15, 2025). Due to the high volume of emails regarding applications, I recommend refraining from emailing me directly unless you have a specific question that is not addressed in the application guidelines. We will review all applications from late December 2025 or January 2026, and if you are a good fit for my lab, we will contact you for an interview. Thank you for your interest! Group Members. PhD Students: Chen Wang (Meshy AI Fellowship 2025 Outstanding Prize Recipient) Yiming Huang Qiao Feng (Meshy AI Fellowship 2025 Finalist) Chuhao Chen Visiting PhD Students: Zhuoman Liu Xiaokun Pan Zhiyao Sun Master, Undergraduate, and Intern Students: Daniel Mika (Undergrad) Xiaoye Zuo Mutian Tong (co-advise with Jiatao Gu) Zirui Wang Boao Shi Siyu Li (Master) Yifan Li (Master) Tuen Yue Tsui (Master) Yusu Fang Xuhai Chen Abhimanyu Suthar Alumni: ▼ (expand for details) Chuhao Chen (Intern of 2025, from UCSD) -> now PhD at UPenn Qingxuan Wu (Master of 2025) -> now Machine Learning Engineer at Bytedance Jiahang (Jay) Mao (Master of 2025) -> now Co-founder of Rita.ai Xuyi Meng (Master of 2025) -> now PhD at Cornell Heguang Lin (Master of 2025) -> now PhD at Scripps Research Xiangyu Han (Master of 2025) -> now PhD at SJTU Yunzhou Song (Master of 2025) -> now PhD at UPenn Linzhan Mou (Intern of 2025) -> now PhD at Princeton Zhiyang Dou (Visiting Student of 2025, from HKU) -> now PhD at MIT Anjun Chen (Visiting Student of 2025, from Zhejiang University) -> now Assistant Professor at Xiamen University Tingyang Zhang (Intern of 2024, from Peking University) -> now Researcher at Mihoyo Libo Zhang (Intern of 2024, from Tsinghua University) -> now PhD at Tsinghua Univesity Yiming Huang (Master of 2024) -> now PhD at UPenn Professional Activities. Services: Associate Editorship: IEEE TVCG (2023 - present) Program Co-Chair: Pacific Graphics'26, Program Co-Chair 3DV'26, Program Co-Chair ICCV'25, Broadening Participation Co-Chair ACM SCA'25, Program Co-Chair Eurographics'25, Doctoral Consortium Co-Chair Eurographics'24, Posters Co-Chair Program Committee Member: ACM SIGGRAPH 2022, 2023, 2025 ACM SIGGRAPH Asia 2023 Pacific Graphics 2022, 2023 Area Chair: CVPR 2024, 2025 ICCV 2025 3DV 2024 Workshops, Tutorials, and Invited Talks: ▼ (expand for details) Organizers: Tutorial on Human Motion Generation, ICCV'25 Workshop on Wild3D: 3D Modeling, Reconstruction, and Generation in the Wild, ICCV'25 Workshop on Scalable 3D Scene Generation and Geometric Scene Understanding, ICCV'25 Workshop on 3D Digital Twin: Progress, Challenges, and Future Directions, CVPR'25 Workshop on Ind3D: Enforcing Inductive Bias in 3D Generation, CVPR'25 Workshop on Neural Fields Beyond Conventional Cameras, CVPR'25 Workshop on AI for Content Creation workshop, CVPR'25 Workshop on Neural Fields Beyond Conventional Cameras, ECCV'24 Workshop on Wild 3D: 3D Modeling, Reconstruction, and Generation in the Wild, ECCV'24 Workshop on Generative Models for Computer Vision, CVPR'24 Workshop on AI for Content Creation Workshop, CVPR'24 Workshop on Generative Models for Computer Vision, CVPR'23 Workshop on AI for Content Creation Workshop, CVPR'23 Workshop on 3D Generative Models, Banff International Research Station for Mathematical Innovation and Discovery (BIRS)'23 Courses: Neural Actor: Neural Free-view Synthesis of Human Actors with Pose Control, Tutorial in 3DV 2021 Course on Advances in Neural Rendering . Fast Rendering of Neural Radiance Fields, Tutorial in SIGGRAPH 2021 Course on Advances in Neural Rendering . Selected Invited Talks: Towards Next-Gen 3D Reconstruction and Generation: From Visual Fidelity to Multimodal and Physical Understanding, CVPR'25 Workshop on Real-to-Sim: Bridging the Gap between Neural Rendering and Robot Learning. Towards Next-Gen 3D Reconstruction and Generation: From Visual Fidelity to Multimodal and Physical Understanding, ETH Robotics, Vision, and Controls Talk Series. High-Fidelity Human Pose Tracking and Realistic Motion Synthesis in Real-World Scenes, Keynote at ACM MIG'24. Human Pose Tracking and Controllable Motion Generation, ECCV'24 workshop on Scalable 3D Scene Generation and Geometric Scene Understanding. Efficient Creation of Photo-realistic Controllable Human Characters, CVPR'24 workshop on The 1st Workshop on Neural Volumetric Video. Tracking and Segmentation for Non-Static Scene Reconstruction, CVPR'24 Workshop on ScanNet++ . Generalized 3D Reconstruction, CVPR'24 Workshop on XRNeRF: Second Workshop on Advances in Radiance Fields for the Metaverse. Generalized 3D Reconstruction, Keynote at 3DV 2024 [Recording]. Reconstruction of 3D Real-world Scenes, ICCV'23 Workshop on NeRF4ADR: Neural Fields for Autonomous Driving and Robotics. Neural Representations of 3D Real-world Scenes, IROS'23 Workshop on Robotic Perception and Mapping. Neural Representation and Neural Rendering of 3D Real-world Scenes, Toronto Geometry Colloquium [Recording]. New Methods for Reconstruction and Rendering of 3D Real-world Scenes, GAMES Webinar [Recording (Chinese)]. Awards. Meta Distinguished Faculty Award, 2025 Best Paper Honorable Mention Award of ACM SIGGRAPH, 2024 Best Paper Honorable Mention Award of ACM Symposium on Computer Animation (SCA), 2023 Aravind K. Joshi Assistant Professorship, 2023 Best Paper Award of ACM International Conference on Intelligent Virtual Agents (IVA), 2021 Publications. (* and † indicate equal contribution) Recent Preprints: Pixie: Physics from Pixels Long Le, Ryan Lucas, Chen Wang, Chuhao Chen, Dinesh Jayaraman, Eric Eaton, Lingjie Liu [Project Page] [Paper] 2025 GECO: Generative Image-to-3D within a SECOnd Chen Wang, Jiatao Gu, Xiaoxiao Long, Yuan Liu, Lingjie Liu TVCG 2025 [Project Page] [Paper] PhysCtrl: Generative Physics for Controllable and Physics-Grounded Video Generation Chen Wang*, Chuhao Chen*, Yiming Huang, Zhiyang Dou, Yuan Liu, Jiatao Gu, Lingjie Liu NeurIPS 2025 [Project Page] [Paper] PhysHMR: Learning Humanoid Control Policies from Vision for Physically Plausible Human Motion Reconstruction Qiao Feng, Yiming Huang, Yufu Wang, Jiatao Gu, Lingjie Liu SIGGRAPH Asia 2025 [Project Page] [Paper] Zero-1-to-G: Taming Pretrained 2D Diffusion Model for Direct 3D Generation Xuyi Meng*, Chen Wang*, Jiahui Lei, Kostas Daniilidis, Jiatao Gu, Lingjie Liu TMLR 2025 [Project Page] [Paper] CFC: Simulating Character-Fluid Coupling using a Hierarchical World Model Zhiyang Dou*, Chen Peng*, Xinyu Lu, Xiaohan Ye, Lixing Fang, Yuan Liu, Wenping Wang, Chuang Gan, Lingjie Liu, Taku Komura SIGGRAPH Asia 2025 (ACM Transactions on Graphics, Journal track, Conditionally Accepted) ModSkill: Physical Character Skill Modularization Yiming Huang, Zhiyang Dou, Lingjie Liu ICCV 2025 [Project Page] [Paper] DIMO: Diverse 3D Motion Generation for Arbitrary Objects Linzhan Mou, Jiahui Lei, Chen Wang, Lingjie Liu, Kostas Daniilidis ICCV 2025 (Highlight) [Project Page] [Paper] [Video] [Code] Extrapolated Urban View Synthesis Benchmark Xiangyu Han, Zhen Jia, Boyi Li, Yan Wang, Boris Ivanovic, Yurong You, Lingjie Liu, Yue Wang, Marco Pavone, Chen Feng, Yiming Li ICCV 2025 [Project Page] [Paper] [Code] Vid2Sim: Generalizable, Video-based Reconstruction of Appearance, Geometry and Physics for Mesh-free Simulation Chuhao Chen, Zhiyang Dou, Chen Wang, Yiming Huang, Anjun Chen, Qiao Feng, Jiatao Gu, Lingjie Liu CVPR 2025 [Project Page] [Paper] [Video] Ego4o: Egocentric Human Motion Capture and Understanding from Multi-Modal Input Jian Wang, Rishabh Dabral, Diogo Luvizon, Zhe Cao, Lingjie Liu, Thabo Beeler, Christian Theobalt CVPR 2025 [Paper] DICE: End-to-end Deformation Capture of Hand-Face Interactions from a Single Image Qingxuan Wu, Zhiyang Dou†, Sirui Xu, Soshi Shimada, Chen Wang, Zhengming Yu, Yuan Liu, Cheng Lin, Zeyu Cao, Taku Komura, Vladislav Golyanik, Christian Theobalt, Wenping",
  "content_length": 27843,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:27"
}