{
  "name": "Lingwei Chen",
  "homepage": "https://lgchen.org",
  "status": "success",
  "content": "Lingwei Chen, Ph.D. Lingwei Chen, Ph.D. Assistant Professor GOL-3701 RIT Rochester, NY lwcics[at]rit.edu Google Scholar DBLP I am currently a tenure-track Assistant Professor in the Golisano College of Computing and Information Sciences at Rochester Institute of Technology. Prior to that, I worked as an Assistant Professor at Wright State University and a Postdoctoral Scholar at the Pennsylvania State University. I received my Ph.D. degree in Computer Science from West Virginia University advised by Prof. Yanfang (Fanny) Ye (University of Notre Dame), and my master's degree in Computer Science from Beijing Normal University. My research interests are machine learning and security, with emphases in: Trustworthy machine learning: adversarial attacks and defenses, adversary for social good, model explanations, other trustworthy issues Cybersecurity with ML/AI: detecting security attacks (e.g., malware, fraud, bot, phishing, vulnerability) with a focus on challenging data scenarios (e.g., few-shot learning, class imbalance, heterophilic structures) using graph neural networks and language models Data mining and science: real-world applications in IoT, social networks, bioinformatics, education, information retrieval, and others For my publications and bibliometrics, please refer to Publications and Google Scholar. Openings: I am looking for self-motivated Ph.D. students to work with me on various cool projects. Please drop me an email with your CV if interested. Recent News NEW [Nov 2025] A paper about text-guided image synthesis was accepted to CVIU 2025. NEW [Oct 2025] A paper about retrieval-augmented latent diffusion was accepted to IEEE BigData 2025. NEW [Aug 2025] A paper about extreme event prediction was accepted to ICDM 2025. [Jun 2025] A paper about multi-modal vulnerability detection was accepted to Information Fusion 2025. [Jun 2025] A paper received COLA 2024 Best Paper Award. [May 2025] Received Presidential Award for Faculty Excellence: Early Career Achievement. [Apr 2025] Received CECS Early Career Achievement Award. [Apr 2025] A paper about code similarity analysis was accepted to IST 2025. [Jan 2025] A paper about cost-efficient vulnerability detection was accepted to JSS 2025. [Dec 2024] A paper about FEA automation using LLMs and GNNs was accepted to AAAI 2025. [Nov 2024] A paper about chatbots for interventions in autism was accepted to EAIT 2024. [Oct 2024] A paper about using LLMs to enhance few-shot GNNs was accepted to IEEE BigData 2024. [Oct 2024] A paper about phishing detection using LLMs was accepted to AAAI 2025 (Student Abstract). [Sep 2024] A paper about graph-based fraud detection was accepted to ACML 2024. [Aug 2024] A paper about dual-reasoning LLMs was accepted to ICONIP 2024. [Aug 2024] A paper about cross-modal adversarial reprogramming for vulnerability detection was accepted to Information Sciences 2024. [Apr 2024] Two papers were accepted to EMBS 2024. [Mar 2024] Nominated as CECS Outstanding Overall Faculty Award. [Mar 2024] A paper about energy-based bot detection was accepted to DASFAA 2024. [Mar 2024] A paper about addressing heterophily for GNNs was accepted to DASFAA 2024. [Mar 2024] A paper about class-imbalanced fraud detection was accepted to IJCNN 2024. [Dec 2023] Served on NSF Panel. [Dec 2023] A paper about enhancing CV interpretability was accepted to Sensors 2023. [Oct 2023] A paper about fooling AI explanations was accepted to EMNLP 2023. [Sep 2023] A paper about vulnerability detection was accepted to ESWA 2023. [Sep 2023] A paper about few-shot node classification was accepted to ICDM 2023. [Aug 2023] A paper about class-imbalanced bot detection was accepted to CIKM 2023. [Jul 2023] A paper about adversary for social good was accepted to TKDD 2023. [Mar 2023] My CRII proposal was funded by NSF. Thank you, NSF! [Mar 2023] A paper about cross-modal adversarial reprogramming was accepted to WWW 2023. [Feb 2023] A paper about hierarchical GNN was accepted to PAKDD 2023. [Dec 2022] A paper about code summarization was accepted to ECIR 2023. [Oct 2022] Attended DARPA Forward Conference as DARPA Riser for proposal presentation. [Jul 2022] Our propoed project was funded by TRC/NHTSA. [Jun 2022] A paper about adversarial attack on GNN was accepted to SecureComm 2022. [Jun 2022] A paper about reinforcement compiler fuzzing was accepted to ICICS 2022. [May 2022] Selected as DARPA Riser for DARPA Forward Conference. [Apr 2022] A paper about code summarization was accepted to IJCNN 2022. [Apr 2022] A paper about smart contract similarity detection was accepted to SEKE 2022. [Mar 2022] A paper about few-shot attribute inference was accepted to SIGIR 2022. [Dec 2021] A paper about adversarial reprogramming for malware detection was accepted to SDM 2022. [Nov 2021] A paper about compiler fuzzing was accepted to IAAI 2022. [Aug 2021] A paper about fraud detection was accepted to CIKM 2021. [Apr 2021] A paper about defense against adversarial attacks was accepted to IJCNN 2021. [Dec 2020] A paper about adversarial attacks for privacy protection was accepted to SDM 2021. [Jul 2020] A paper about plagiarism detection of multi-threaded programs received SEKE 2020 Best Paper Award. [Jun 2020] A paper about robustifying graph convolutional networks was accepted to ECML-PKDD 2020. [Apr 2020] Two papers about multi-threaded program plagiarism detection and compiler identification respectively were accepted to SEKE 2020. [Mar 2020] Our proposed project was funded by Seed Grant Award from Center for Security Research and Education (CSRE) at the Pennsylvania State University.",
  "content_length": 5606,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:27"
}