{
  "name": "Ling Pan",
  "homepage": "https://ling-pan.github.io",
  "status": "success",
  "content": "Ling Pan Ling Pan is a Tenure-Track Assistant Professor in the Department of Electronic and Computer Engineering and the Department of Computer Science and Engineering (by courtesy) at the Hong Kong University of Science and Technology (HKUST) from Spring 2024, leading the Intelligent Decision-Making Lab. Her research focuses on theoretical understanding, algorithmic improvements, and practical application of (reward-maximizing) deep reinforcement learning, (reward-matching) GFlowNets, and multi-agent systems, aiming to develop robust, efficient, and practical intelligent decision-making algorithms. She is also interested in the practical application of decision-making algorithms in critical problems including computational sustainability and post-training of foundation models. Before joining HKUST, she was a postdoctoral fellow at Mila supervised by Prof. Yoshua Bengio (Turing Award Laureate). She obtained her Ph.D. from the Institute for Interdisciplinary Information Sciences (IIIS) (headed by Prof. Andrew Yao), Tsinghua University in 2022, during which she visited Stanford University advised by Prof. Tengyu Ma, University of Oxford advised by Prof. Shimon Whiteson. She received her B.E. from the School of Computer Science and Engineering, Sun Yat-Sen (Zhongshan) University in 2017. Her work has been recognized by the AAAI New Faculty Highlights program, and she was awarded the Microsoft Research PhD Fellowship (Asia). She also regularly serves as Area Chair in top ML venues, e.g., ICML/NeurIPS/ICLR/RLC (Reinforcement Learning Conference). Please drop me an email if you are interested in collaborating with me. Prospective Students: I am actively looking for self-motivated students (including undergraduate/graduate students and research assistants) who are interested in the areas of artificial intelligence and machine learning. I have several PhD/MPhil/RA openings starting in Fall 2026 at HKUST. Please drop me an email with your CV (including rankings/publications) for the application. Selected Awards AAAI New Faculty Highlights, 2025 Outstanding Doctoral Thesis, by Tsinghua University, 2022 Thesis: Towards Robust, Efficient, and Practical Deep Reinforcement Learning Algorithms The only selected computer science doctoral thesis in IIIS, Tsinghua University Microsoft Research Ph.D. Fellowship (Asia), 2020 Professional Activities Organizer: Safe Generative AI Workshop @ NeurIPS 2024 Agent-based Information Retrieval Workshop @ SIGI 2024, SIGIR 2025 GFlowNet Workshop @ Mila 2023 Area Chair: International Conference on Machine Learning (ICML) Conference on Neural Information Processing Systems (NeurIPS) International Conference on Learning Representations (ICLR) Reinforcement Learning Conference (RLC) SPC Members: International Conference on Autonomous Agents and Multiagent Systems (AAMAS) PC Members: TPAMI/TMLR Selected Talks Towards Robust, Efficient, and Practical Decision-Making: From Reward-Maximizing Deep Reinforcement Learning to Reward-Matching GFlowNets RLChina 2024 Conference, October, 2024 RLChina 2023 Conference, November, 2023 Towards Robust, Efficient, and Practical Reinforcement Learning Computer Science and Artificial Intelligence Lab (CSAIL), MIT, December, 2021 Berkeley Artificial Intelligence Research (BAIR), UC Berkeley, November, 2021 Teaching Spring 2026: ELEC3350 Principles of Machine Learning Spring 2025: ELEC6910J Deep Reinforcement Learning Fall 2025/Fall 2024: ELEC2600 Probability and Random Process in Engineering",
  "content_length": 3501,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:25"
}