{
  "name": "Lingxiao Jiang",
  "homepage": "http://www.mysmu.edu/faculty/lxjiang",
  "status": "success",
  "content": "Lingxiao JIANG at Singapore Management University Contact Research Teaching Bio Welcome to Lingxiao's Home Page! LINGXIAO JIANG () Associate Professor School of Computing and Information Systems (SCIS) Singapore Management University (SMU) 80 Stamford Road Singapore 178902 Email: Phone: +65 6808 5113 Fax: +65 6828 0919 Office: SOE/SCIS2, Room 4066 Office Hours: AY 2022-2023, walk in to my office, or contact me. My research and teaching interests are mainly in software engineering, program analysis, testing & debugging, code search & reuse, and deep learning & analysis of code. My goal is to develop practical techniques and tools that can help enhance software quality, increase development productivity, reduce maintenance cost, and improve user experience. I am also interested in programming languages, systems, security & privacy, data mining, and machine learning, looking for ideas and techniques that can help solve software engineering and security problems. At SCIS, SMU, I am very fortunate to have the chance to work with these outstanding current and past graduate students: Lucia (Ph.D. in 2014), William Tan (M.S. in 2014), Shaowei Wang (Ph.D. in 2015), Joseph Chan (M.S. in 2016), Pavneet Singh (Ph.D. in 2017), Ferdian Thung (Ph.D. in 2018), Nghi Bui Duy Quoc (Ph.D. in 2020), Haoxin Tu (co-supervisor since Aug 2020), Imam Nur Bani Yusuf (co-supervisor since Aug 2020), Ting Zhang (co-supervisor since Aug 2020), Ashok Kasthuri (since Aug 2022), Xuemeng Cai (since Jan 2023), Chen Zhi (since Aug 2023), Ivan Tan Wei Han (co-supervisor since Aug 2023). I am recruiting graduate students interested in working on the areas related to software engineering, program analysis, deep learning & analysis of code, code search & reuse, software repository mining, symbolic execution, and software security. Apply to our SCIS PhD programme! Ask me or check out online for more information. Our Centre for Research on Intelligent Software Engineering (RISE) aims for high-quality and impactful research outputs. We have a few openings for research engineers and postdocs in various intelligent software engineering research topics. Email me your CV with a personal/research statement if interested. Please submit good papers to and participate in: Top Computer Science Conferences ranked by Research.com Top Computer Science Journals ranked by Research.com SMU Terms of Use | Personal Data Protection Statement Last Modified: 2 Dec 2023",
  "content_length": 2449,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:28"
}