{
  "name": "Linh Thi Xuan Phan",
  "homepage": "http://www.cis.upenn.edu/~linhphan",
  "status": "success",
  "content": "Linh Thi Xuan Phan's Home Page Linh Thi Xuan PHAN Professor University of Pennsylvania Computer and Information Science Department Levine 576 3330 Walnut Street, Philadelphia, PA 19104-6389 Phone:   +1 (215) 898-2012 Email:   linhphan AT cis.upenn.edu Teaching . Students . Honors & Awards . Publications . Service I am a professor at the University of Pennsylvania. My research interests include real-time, embedded systems, cyber-physical systems (CPS), distributed systems, robotics and security. I am especially interested in theoretical foundations and systems techniques for building cost-effective large-scale systems with provable safety, fault tolerance, security, and real-time performance. Recently, I have worked on compositional scheduling and analysis techniques, reliable real-time cloud infrastructure for safety-critical and mission-critical applications, the Internet of Things, and network function virtualization, as well as methods for diagnosing performance problems in data centers. Some of the projects I am currently working on include: efficient real-time fault tolerance techniques for distributed CPS, scalable adaptive resource allocation for modern hardware, computation-aware algorithmic design for CPS under uncertainty, fault detection, isolation and recovery strategies for distributed robotic systems, a new approach to defending cyber-physical systems and the cloud against security attacks, and a radically different architecture for large-scale data centers. I am a member of the PRECISE Center and the Distributed Systems Lab, and a co-director of the MSE in Data Science (DATS) program. I was previously a visiting researcher at Roblox Research. I am a recipient of the Lindback Award for Distinguished Teaching. Teaching CIS 5050: Software Systems (Fall 2016, Spring 2017, Fall 2017, Spring 2018, Fall 2018, Fall 2019, Fall 2020, Fall 2021, Fall 2022, Spring 2023, Spring 2024, Fall 2024, Spring 2025, Fall 2025) CIS 4550/5550: Internet and Web Systems (Fall 2023) Current PhD students Yifan Cai Abby Eisenklam Robert Gifford (co-advised with Andreas Haeberlen) Suwei Ma (co-advised with Sebastian Angel) Karan Newatia (co-advised with Andreas Haeberlen) Xian Wang Graduated PhD students Dr. Neeraj Gandhi Dr. Max Demoulin (co-advised with Boon Thau Loo) Dr. Meng Xu (co-advised with Insup Lee) Dr. Yang Li (co-advised with Sanjeev Khanna and Boon Thau Loo) Dr. Jaewoo Lee (co-advised with Insup Lee) Honors & Awards Best Paper Award, Real-time and IntelliGent Edge Computing Workshop (RAGE), 2023 Best Paper Award in Multi-Robot Systems Finalist, International Conference on Robotics and Automation (ICRA), 2021 Outstanding Paper Award, International Conference on Real-Time Networks and Systems (RTNS), 2021 Lindback Award for Distinguished Teaching, 2020 Best Paper Award, Real-Time and Embedded Technology and Applications Symposium (RTAS), 2019 Best Student Paper Award, Real-Time and Embedded Technology and Applications Symposium (RTAS), 2019 CAREER Award, National Science Foundation, 2018 Outstanding Paper Award, Real-Time and Embedded Technology and Applications Symposium (RTAS), 2018 Member of the inaugural class of the ACM Future of Computing Academy, 2017 Best Paper Award Nominee, Real-Time Systems Symposium (RTSS), 2013 Best Paper Award Nominee, International Conference on Embedded Software (EMSOFT), 2010 NUS Dean's Graduate Research Excellence, 2009 NUS Graduate Scholarship (2003 to 2007) Singapore Scholarship (1999 to 2003) Publications Rasco: Resource Allocation and Scheduling Co-design for DAG Applications on Multicore A. Eisenklam, R. Gifford, G. A. A. Bondar, Y. Cai, T. Sial, L. T. X. Phan, and A. Halder. ACM SIGBED International Conference on Embedded Software (EMSOFT), Taipei, Taiwan, Sep. 2025 Quasi-Static Scheduling for Deterministic Timed Concurrent Models on Multi-Core Hardware S. Lin, E. Jellum, M. Theile, T. Tanneberger, B. Sun, C. Jerad, Y. Xu, G. Feng, M. Mæhlum, J.-J. Chen, M. Schoeberl, L. T. X. Phan, J. Castrillon, S. A. Seshia, E. A. Lee ACM SIGBED International Conference on Embedded Software (EMSOFT), Taipei, Taiwan, Sep. 2025 A view of the sustainable computing landscape B. C. Lee, D. Brooks, A. van Benthem, M. Elgamal, U. Gupta, G. Hills, V. Liu, L. T. X. Phan, B. Pierce, C. Stewart, E. Strubell, G.-Y. Wei, A. Wierman, Y. Yao, M. Yu. Patterns, July 2025. Stochastic Learning of Computational Resource Usage as Graph Structured Multimarginal Schrodinger Bridge G.A. Bondar, R. Gifford, L.T.X. Phan and A. Halder. IEEE Transactions on Control Systems Technology, May 2025. FairDP: Achieving Fairness Certification with Differential Privacy K. Tran, F. Fioretto, I. Khalil, M. T. Thai, L. T. X. Phan, and N. Phan. Proceedings of the IEEE Secure and Trustworthy Machine Learning Conference (SaTML), Copenhagen, Denmark, Apr. 2025. RoboRebound: Multi-Robot System Defense with Bounded-Time Interaction N. Gandhi, Y. Cai, A. Haeberlen, and L. T. X. Phan. Proceedings of the 20th European Conference on Computer Systems (EuroSys), Rotterdam, Netherlands, Mar. 2025. A Convolutional Autoencoder Architecture for Robust Network Intrusion Detection in Embedded Systems N. Borgioli, F. Aromolo, L. T. X. Phan, and G. Buttazzo. Journal of Systems Architecture, 2024. Detecting and Isolation Rotor Faults in Aerial Vehicles with Dozens of Rotors N. Gandhi, J. Xu, D. Saldana, and L. T. X. Phan. Proceedings of the 21st IEEE Latin American Robotics Symposium (LARC), Arequipa, Peru, Nov. 2024. Analysis of Long-Term Average Properties of Probabilistic Task Systems Y. Cai, L. T. X. Phan, and P. S. Thiagarajan. Proceedings of the 2024 International Conference on Real-Time Networks and Systems (RTNS), Porto, Portugal, Nov. 2024. Online Rotor Fault Detection and Isolation for Vertical Takeoff and Landing Vehicles J. Lian, N. Gandhi, Y. Wang, and L. T. X. Phan. Proceedings of the 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), Abu Dhabi, UAE, Oct. 2024. Path Structured Multimarginal Schrodinger Bridge for Probabilistic Learning of Hardware Resource Usage by Control Software G. A. Bondar, R. Gifford, L. T. X. Phan, and A. Halder. Proceedings of the 2024 American Control Conference (ACC), Toronto, Canada, July 2024. Object-oriented Unified Encrypted Memory Management for Heterogeneous Memory Architectures M. Sha, Y. Cai, S. Wang, L. T. X. Phan, F. Li, and K.-L. Tan. Proceedings of the ACM SIGMOD International Conference on Management of Data (SIGMOD), Santiago, Chile, June 2024. Decntr: Optimizing Safety and Schedulability with Multi-Mode Control and Resource Allocation Co-Design R. Gifford, F. Galarza-Jimenez, L. T. X. Phan, and M. Zamani. IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), Hong Kong, May 2024. Metaverse as a Service: Megascale Social 3D on the Cloud A. Haeberlen, L. T. X. Phan, and M. McGuire. 14th ACM Symposium on Cloud Computing (SoCC), Santa Cruz, California, Oct. 2023. CrossTalk: Making Low-Latency Fault Tolerance Cheap by Exploiting Redundant Networks A. Loveless, L. T. X. Phan, L. Erickson, R. Dreslinski, and B. Kasikci ACM SIGBED International Conference on Embedded Software (EMSOFT), Hamburg, Germany, Sep. 2023. PCspooF: Compromising the Safety of Time-Triggered Ethernet A. Loveless, L. T. X. Phan, R. Dreslinski, and B. Kasikci IEEE Symposium on Security and Privacy (S&P), San Francisco, CA, May 2023. Packet-based Real-Time Intrusion Detection on Edge Devices N. Borgioli, L. T. X. Phan, A. Biondi, and G. Buttazzo. Proceedings of Real-time and IntelliGent Edge Computing Workshop (RAGE), Antonio, TX, May 2023. (Best Paper Award) Multi-mode on Multi-core: Making the best of both worlds with Omni R. Gifford and L. T. X. Phan IEEE Real-Time Systems Symposium (RTSS), Houston, TX, Dec. 2022. Mitigating Computational Constraints via Adaptive Control and Resource Allocation Co-design L. T. X. Phan and R. G. Sanfelice Workshop on Computation-Aware Algorithmic Design for Cyber-Physical Systems (CAADCPS), May 2022. When Idling is Ideal: Optimizing Tail-Latency for Highly-Dispersed Datacenter Workloads with Persephone H. M. Demoulin, J. Fried, I. Pedisich, M. Kogias, B. T. Loo, L. T. X. Phan, and I. Zhang ACM Symposium on Operating Systems Principles (SOSP), virtual conference, Oct 2021. Vision-Based Self-Assembly for Modular Multirotor Structures Y. Litman, N. Gandhi, L. T. X. Phan, and D. Saldana IEEE Robotics and Automation Letters (RA-L) and International Conference on Robotics and Automation (ICRA), Xi'an, China, June 2021. (Finalist, Best Paper Award on Multi-Robot Systems) IGOR: Accelerating Byzantine Fault Tolerance for Real-Time Systems with Eager Execution A. Loveless, R. Dreslinski, B. Kasikci, and L. T. X. Phan IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), May 2021. DNA: Dynamic Resource Allocation for Soft Real-Time Multicore Systems R. Gifford, N. Gandhi, L. T. X. Phan, and A. Haeberlen IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), May 2021. REBOUND: Defending Distributed Systems Against Attacks with Bounded-Time Recovery N. Gandhi, E. Roth, B. Sandler, A. Haeberlen, and L. T. X. Phan European Conference on Computer Systems (EuroSys), Edinburgh, Scotland, April 2021. Towards Virtualization-Agnostic Latency for Time-Sensitive Applications H. Li, M. Xu, C. Li, C. Lu, C. Gill, L. T. X. Phan, I. Lee, and O. Sokolsky International Conference on Real-Time Networks and Systems (RTNS), April 2021. (Outstanding Paper Award) Self-Reconfiguration in Response to Faults in Modular Aerial Systems N. Gandhi, D. Saldana, V. Kumar and L. T. X. Phan IEEE Robotics and Automation Letters (RA-L) and International Conference on Robotics and Automation (ICRA), Paris, France, May 2020. Bounded-Time Recovery for Distributed Real-Time Systems N. Gandhi, E. Roth, R. Gifford, L. T. X. Phan, and A. Haeberlen IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), Sydney, Australia, Apr 2020. TMC: Pay-as-",
  "content_length": 27679,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:31"
}