{
  "name": "Linhai Song",
  "homepage": "https://songlh.github.io",
  "status": "success",
  "content": "Linhai Song's Home Page Linhai Song Professor songlinhai AT ICT DOT AC DOT CN State Key Lab of Processors Institute of Computing Technology, Chinese Academy of Sciences Beijing, China CV: [pdf] About Me I am a Professor at the Institute of Computing Technology, Chinese Academy of Sciences. My research spans systems, security, and software engineering, with the overarching goal of enabling developers to build software systems that are more efficient, reliable, and secure. I earned my Ph.D. from the University of Wisconsin–Madison in 2015, where I worked with Prof. Shan Lu. I received my M.S. from the Institute of Computing Technology, Chinese Academy of Sciences in 2010, and my B.S. in Software Engineering from Huazhong University of Science and Technology in 2007. Before joining ICT@CAS in August 2025, I was a tenured Associate Professor at Pennsylvania State University. Students I am very lucky to work with outstanding students: Current Students: Shihao Xia, PhD PSU (co-advised with Hong Hu) Mengting He, PhD PSU Alumni Shuofei Zhu (2018-2024) >> Dr. Peng Liu's group Ziheng Liu (2019-2021) >> PhD at UCSD Boqin Qin (Visiting PhD from BUPT) (2018-2019) Ziyi Zhang (Visiting Undergraduate from USTC, Undergraduate Silver Medalist in SRC@SOSP'2019) (2019) >> PhD at UW-Madison Jianjun Shi (Visiting PhD from BIT) (2018-2019) Zeming Yu (2018-2019) Yongheng Chen (Visiting Undergraduate from NJU) (2019) >> PhD at Gatech Tengfei Tu (Visiting PhD from BUPT) (2017-2018) >> Faculty at BUPT Advertisement for Recruiting Looking for PhDs, masters, visiting scholars, visiting students, postdocs, and undergraduates at any time. Picture Gallery Publications S: students are advised or mentored by me at Pennsylvania State University. How to Save My Gas Fees: Understanding and Detecting Real-World Gas Issues in Solidity Programs [preprint] [code] Mengting HeS, Shihao XiaS, Boqin QinS, Nobuko Yoshida, Tingting Yu, Yiying Zhang, and Linhai Song. TSE'2025 SC-Bench: A Large-Scale Dataset for Smart Contract Auditing [preprint] [code] Shihao XiaS, Mengting HeS, Linhai Song, and Yiying Zhang. LLM4Code workshop@ICSE'2025 Understanding and Detecting Real-World Safety Issues in Rust [preprint] [code] Boqin QinS, Yilun Chen, Haopeng Liu, Hua Zhang, Qiaoyan Wen, Linhai Song, and Yiying Zhang. TSE'2024 Rust-lancet: Automated Ownership-Rule-Violation Fixing with Behavior Preservation [preprint] Wenzhang Yang, Linhai Song, and Yinxing Xue. ICSE'2024 Generic Go to Go: Dictionary-Passing, Monomorphisation, and Hybrid [preprint] Stephen Ellis*, Shuofei Zhu*S, Nobuko Yoshida, and Linhai Song. OOPSLA'2022 * both are leading authors. Beyond Bot Detection: Combating Fraudulent Online Survey Takers [preprint] Ziyi ZhangS, Shuofei ZhuS, Jaron Mink, Aiping Xiong, Linhai Song, and Gang Wang. WWW'2022 Learning and Programming Challenges of Rust: A Mixed-Methods Study [preprint] [code] Shuofei Zhu*S, Ziyi Zhang*S, Boqin QinS, Aiping Xiong, and Linhai Song. ICSE'2022 * both are leading authors. Who Goes First? Detecting Go Concurrency Bugs via Message Reordering [preprint] [code] Ziheng Liu*S, Shihao Xia*S, Yu Liang, Linhai Song, and Hong Hu. ASPLOS'2022 * both are leading authors. Algorithmic Profiling for Real-World Complexity Problems [preprint] [code] Boqin QinS, Tengfei TuS, Ziheng LiuS, Tingting Yu, and Linhai Song. TSE'2021 (accepted as a journal-first paper by ICSE'2022) Automatically Detecting and Fixing Concurrency Bugs in Go Software Systems [preprint] [code] Ziheng LiuS, Shuofei ZhuS, Boqin QinS, Hao Chen, and Linhai Song. ASPLOS'2021 VRLifeTime: An IDE Tool to Avoid Concurrency and Memory Bugs in Rust [preprint] Ziyi ZhangS, Boqin QinS, Yilun Chen, Linhai Song, and Yiying Zhang. Demo@CCS'2020 Benchmarking Label Dynamics of VirusTotal Engines [preprint] Shuofei ZhuS, Ziyi ZhangS, Limin Yang, Linhai Song, and Gang Wang. Demo@CCS'2020 Understanding Memory and Thread Safety Practices and Issues in Real-World Rust Programs [preprint] Boqin Qin*S, Yilun Chen*, Zeming YuS, Linhai Song, and Yiying Zhang. PLDI'2020 * both are leading authors. Measuring and Modeling the Label Dynamics of Online Anti-Malware Engines [preprint] [Artifact Evaluated] Shuofei ZhuS, Jianjun ShiS, Limin Yang, Boqin QinS, Ziyi ZhangS, Linhai Song, and Gang Wang. USENIX Security'2020 NFReducer: Redundant Logic Elimination in Network Functions Bangwen Deng, Wenfei Wu, and Linhai Song. SOSR'2020 Automated Finite State Machine Extraction [preprint] Yongheng ChenS, Linhai Song, Xinyu Xing, Fengyuan Xu, and Wenfei Wu. FEAST workshop@CCS'2019 Opening the Blackbox of VirusTotal: Analyzing Online Phishing Scan Engines [preprint] Peng Peng, Limin Yang, Linhai Song, and Gang Wang. IMC'2019 Understanding Real-World Concurrency Bugs in Go [preprint] [Morning Paper] [Hacker News] [Jexia] Tengfei TuS, Xiaoyu Liu, Linhai Song, and Yiying Zhang. ASPLOS'2019 (the second-most visited URL related to Golang in 2019) Fine-Grained Library Customization [preprint] Linhai Song and Xinyu Xing. SALAD workshop@ECOOP'2018 Performance Diagnosis for Inefficient Loops Linhai Song and Shan Lu. ICSE'2017 (A previous version appears as UChicago CS Technical Report TR-2016-06) Learning from Big Malware Linhai Song, Heqing Huang, Wu Zhou, Wenfei Wu, and Yiying Zhang. APSYS'2016 What Change History Tells Us About Thread Synchronization Rui Gu, Guoliang Jin, Linhai Song, Linjie Zhu, and Shan Lu. FSE'2015 COMP: Compiler Optimizations for Manycore Processors Linhai Song, Min Feng, Nishkam Ravi, Yi Yang, and Srimat Chakradhar. MICRO'2014 Best Paper Nomination (Linhai did this work during his 2013 summer intern in NEC Laboratories America) Statistical Debugging for Real-World Performance Problems Linhai Song and Shan Lu. OOPSLA'2014 (A previous version appears as UW-Madison CS Technical Report 1803) Toddler: Detecting Performance Problems via Similar Memory-Access Patterns Adrian Nistor, Linhai Song, Darko Marinov, and Shan Lu. ICSE'2013 Understanding and Detecting Real-World Performance Bugs Guoliang Jin*, Linhai Song*, Xiaoming Shi, Joel Scherpelz, and Shan Lu. PLDI'2012 * both are leading authors. Automated Atomicity-Violation Fixing Guoliang Jin, Linhai Song, Wei Zhang, Shan Lu, and Ben Liblit. PLDI'2011 ECON: An Approach to Extract Content from Web News Page Yan Guo, Huifang Tang, Linhai Song, Yu Wang, and Guodong Ding. APWEB'2010 Simultaneous Product Attribute Name and Value Extraction from Web Pages Bo Wu, Xueqi Cheng, Yu Wang, Yan Guo, and Linhai Song. WI/IAT Workshops'2009 Blog Post Extraction Using Title Finding Linhai Song, Xueqi Cheng, Yan Guo, Bo Wu, and Yu Wang. CCIR'2009 ContentEx: A Framework for Automatic Content Extraction Programs Linhai Song, Xueqi Cheng, Yan Guo, Yue Liu, and Guodong Ding. ISI'2009 Projects Beyond Compile-Time Safety: Strengthening Rust’s Ecosystem with Program Analysis and Programmability Support Talks Understanding Real-World Concurrency Bugs in Go [slides] [pdf] In ASPLOS'2019 on Apr 17, 2019 Fine-Grained Library Customization [slides] In SALAD'2018 on Jul 19, 2018 Performance Diagnosis for Inefficient Loops [slides] In ICSE'2017 on MAY 25, 2017 Learning from Big Malware [slides] In APSys'2016 on AUG 05, 2016 Statistical Debugging for Real-World Performance Problems [slides] In OOPSLA'2014 on OCT 23, 2014 Statistical Debugging for Performance Problems [slides] In WISDOM Workshop II on May 6, 2014 Understanding and Detecting Real-World Performance Bugs [slides] In PLDI'2012 on July 11, 2012 Services 2025: ATC'25, PLOS'25 2024: EuroSys'24, PPoPP'24, ATC'24, CGO'24 (ERC) 2023: PLOS'23, APSys'23 2022: ASPLOS'22 2021: ASPLOS'21 (ERC), PLOS'21 2020: ICSE'20 (Poster), ASPLOS'20 (ERC), CCS'20 (Poster and Demo) 2019: ASPLOS'19 (ERC and Program Co-Chair of SRC), ICSE'19 (SEIP), APSys'19 2018: ISSTA'18 (ERC), ASPLOS'18 (SRC), APSys'18, FSE'18 (SRC), CCS'18 (ERC) 2017: CCS'17 (ERC), USENIX ATC'17 (ERC) 2015: PLDI'15 (Artifacts) 2014: ISSTA'14 (Artifacts) Awards NSF CAREER Award, 2022 Mozilla Research Award, 2019 MICRO 2014 Best Paper Runner Up One of five papers selected from 273 MICRO 2014 submissions SIGPLAN Research Highlights Award for our AFix paper One of eight papers selected from all papers published in 13 ACM SIGPLAN conferences in 2011 Links My Academic Genealogy",
  "content_length": 8242,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:29"
}