{
  "name": "Linqi Song",
  "homepage": "https://sites.google.com/site/aisquaredlab",
  "status": "success",
  "content": "AI^2 LabSearch this siteEmbedded FilesSkip to main contentSkip to navigationAlgorithmic Information theory and Artificial Intelligence    Linqi Song    Associate Professor    Department of Computer Science    City University of Hong Kong    Office: Yeung Kin Man Academic Building, Y6425    Phone: (852) 3442-4231    Email: linqi.song@cityu.edu.hkLatest news!Prof. Song has been promoted to Associate Professor with tenure, effective July 2024. Our paper \"Energy-optimal and delay-bounded computation offloading in mobile edge computing with heterogeneous clouds,\" (with Tianchu Zhao, Sheng Zhou, Zhiyuan Jiang, Xueying Guo, and Zhisheng Niu) has received the Best Paper Award of China Communications 2023.Congratulations to Mr. Han Wu on the successful completion of his Ph.D. program.Congratulations to Ms. Tan Li on the successful completion of her Ph.D. program.Dr. Song has been serving as the Chair of IEEE ITSoc HK Chapter.Dr. Song delivered a talk entitled \"Pliable index coding and its applications\" at the Chinese Institute of Electronics, China Academic Annual Conference on Information Theory (CIEIT), the flagship conference of Information Theory in China.Our paper \"Enhancing Deep Multimedia Recommendations Using Graph Embeddings\" receives the Best Paper Award in IEEE MIPR 2020. Congratulations to Weijing!Notice!I am looking for motivated graduate students to work with me as fully-funded PhD students. Potential projects include information theory, machine learning, recommender systems, NLP, and data science. If you are interested, please contact me by email. I recently have some funding for Research Assistant (RA) for undergraduates, master students, Ph.D students, or postdocs. Please let me know if you are interested. I also welcome other undergraduates, master students, postdocs and visiting scholars.Current opening highlight: Several positions available for postdocs in Information Theory, NLP, and machine learning.Ph.D. positions for Information Theory and Machine Learning Theory are opening ALL YEAR!Ph.D. positions for NLP and AI applications are opening Every Quarter!Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2177,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:30"
}