{
  "name": "Linyi Yang",
  "homepage": "https://yanglinyi.github.io",
  "status": "success",
  "content": "Linyi Yang (杨林易) - Homepage Linyi Yang SUSTech Assistant Professor (PhD Advisor) Shenzhen, China Email ResearchGate Twitter Github Google Scholar Actively Employing 26 Fall Masters, and PhDs I am actively recruiting 26 Fall PhD students and Postdoc/RA/Visiting Students. If you are looking for research positions, please do not hesitate to contact me via email: yanglinyiucd[at]gmail[dot]com Previously, I was fortunate to be supervised by Prof. Jun Wang (UCL), Prof. Barry Smyth (UCD), and Prof. Yue Zhang (Westlake). My research interests are building AI co-scientists, enhancing LLMs’ reasoning capabilities, and designing open-ended curiosity-driven exploration-based methods. I served as an Area Chair at ICLR, ACL, EMNLP, and CIKM, a Senior Program Committee member at IJCAI, and an Associate Editor at the Special Issue on TIST with Prof. Jindong Wang and Prof. Qiang Yang. I have published more than 40 papers at top-tier conferences, such as ICLR, NeurIPS, ACL, AAAI, EMNLP, and WWW, including 11 co-leading Core A* (CCF-A) papers with a total citation: . 🏆 Honors and Awards Area Chair: ICLR 2025; ACL 2024-2025; EMNLP 2023; IJCAI 2023 (SPC); CIKM 2022; Associate Editor: TIST. Outstanding Postdoctoral Representative, 2023. Outstanding Postdoc Researcher, 2022. Outstanding Self-financed Students Abroad (Special Awards, Only 1 Winner in Ireland, 50 Winners in total), 2021. Best Paper Candidate, CCIS, 2018. Team Members PhD Students: Jiayao Chen (Shenzhen University) Jiayi Fu (Fudan University) Shi Liu (Hong Kong University) Master Students: Junhao Ma (SUSTech) Lang Yang (South China University of Technology) Research Assistants: Yuhao Wang (NUS) Guanghao Jin (LMU) Yanyun Liu (HKUST) Huichi Zhou (Impirical College London) Qi Zhang (Oxford University) Zihan Wang (Tsinghua University (Shenzhen)) Lam Nguyen (Tsinghua University (Shenzhen)) 🌱 Repository [ AgentFly | OpenR | CycleResearcher | LLM-Eval ] ⚡ GenAI Lab News 2025-Sep Three papers have been accepted to NeurIPS 2025. 2025-Aug Two papers have been accepted to EMNLP 2025, including an oral paper (ResearStudio). 2025-Aug We released Memento, the open-source framework that achieves the state-of-the-art results on GAIA. 2025-Jul Feature-level alignment (FPO) has been accepted to ICML 2025. 2025-Jan Six papers have been accepted to the main conference of ICLR 2025, including an oral paper. 2024-Dec I served as an Area Chair at ACL 2025 and ICLR 2025. 2024-Nov We gave the tutorial on LLM Evaluation at AAAI 2024 and CVPR 2025. 2024-Oct I have been invited to give a 6-hour tutorial at RL China 2024. 2024-May Two papers have been accepted to the main conference of ACL 2024. 2024-Feb One paper has been accepted to NAACL 2024 (Rationale-centric Counterfactual Data Augmentation). 2024-Jan Three papers (SuperContext, FastDetect, and PandaLM) have been accepted to ICLR 2024. 2023-Dec One paper has been accepted to EMNLP 2023. 2023-Nov Organized ACM TIST Special Issue on Evaluations of Large Language Model with Dr. Jindong Wang and Prof. Qiang Yang. 2023-May Four papers have been accepted to ACL 2023 (Three leading author papers). 2023-Apr Our paper discussing the robustness of ChatGPT has been accepted to ICLR 2023 Workshop. Area Chair / Senior Programme Committee (SPC): EMNLP-22; CIKM-22; IJCAI-23; ACL-25. PC Member/Reviewer: CIKM-20; SIGIR-21; CKIM-21; EMNLP 2021-2024; ACL 2021-2024; COLING 2022-2024; TASLP; TALLIP; TBD; TKDE. 📝 Publications * denotes equal contribution + denotes corresponding author (45) Constrain Alignment with Sparse Autoencoders Qingyu Yin, Chak Tou Leong, Hongbo Zhang, Minjun Zhu, Hanqi Yan, Qiang Zhang, Yulan He, Wenjie Li, Jun Wang, Yue Zhang, Linyi Yang Forty-Second International Conference on Machine Learning (``ICML 2025, CCF-A``). (44) DeepReview: Improving LLM-based Paper Review with Human-like Deep Thinking Process Minjun Zhu, Yixuan Weng, Linyi Yang, Yue Zhang The 62nd Annual Meeting of the Association for Computational Linguistics (``ACL 2025, CCF-A``). (43) Pre-Training a Graph Recurrent Network for Text Understanding Yile Wang, Linyi Yang, Zhiyang Teng, Ming Zhou, Yue Zhang IEEE Transactions on Pattern Analysis and Machine Intelligence 2025 (``TPAMI, CCF-A``). (42) An Empirical Analysis of Uncertainty in Large Language Model Evaluations. Qiujie Xie, Qingqiu Li, Zhuohao Yu, Yuejie Zhang, Yue Zhang, Linyi Yang+. International Conference on Learning Representations 2025 (``ICLR 2025, Tsinghua-A``). (41) CycleResearcher: Improving Automated Research via Automated Review. Yixuan Weng, Minjun Zhu, Guangsheng Bao, Hongbo Zhang, Jindong Wang, Yue Zhang+, Linyi Yang+. International Conference on Learning Representations 2025 (``ICLR 2025, Tsinghua-A``). (40) Personality Alignment of Large Language Models. Minjun Zhu, Yixuan Weng, Linyi Yang, Yue Zhang. International Conference on Learning Representations 2025 (``ICLR 2025, Tsinghua-A``). (39) MMQA: Evaluating LLMs with Multi-Table Multi-Hop Complex Questions. Jian Wu, Linyi Yang, Dongyuan Li, Yuliang Ji, Manabu Okumura, Yue Zhang. International Conference on Learning Representations 2025 (average score: 8, top 20) (``ICLR 2025, Tsinghua-A``). (38) CofCA: A STEP-WISE Counterfactual Multi-hop QA benchmark. Jian Wu, Linyi Yang, Zhen Wang, Manabu Okumura, Yue Zhang. International Conference on Learning Representations 2025 (``ICLR 2025, Tsinghua-A``). (37) Human Simulacra: Benchmarking the Personification of Large Language Models. Qiujie Xie, Qiming Feng, Tianqi Zhang, Qingqiu Li, Linyi Yang, Yuejie Zhang, Rui Feng, Liang He, Shang Gao, Yue Zhang. International Conference on Learning Representations 2025 (``ICLR 2025, Tsinghua-A``). (36) PromptBench: Towards Evaluating the Robustness of Large Language Models on Adversarial Prompts. [paper]; Kaijie Zhu, Jindong Wang, Jiaheng Zhou, Zichen Wang, Hao Chen, Yidong Wang, Linyi Yang, Wei Ye, Neil Zhenqiang Gong, Yue Zhang, Xing Xie. 1st ACM Workshop on Large AI Systems and Models with Privacy and Safety Analysis (``CCS Workshop``). (35) Detoxifying Large Language Models via Knowledge Editing. [paper] Mengru Wang, Ningyu Zhang, Ziwen Xu, Zekun Xi, Shumin Deng, Yunzhi Yao, Qishen Zhang, Linyi Yang, Jindong Wang, Huajun Chen. The 62nd Annual Meeting of the Association for Computational Linguistics (``ACL 2024, CCF-A``). (34) Deepfake text detection in the wild. [paper] Yafu Li, Qintong Li, Leyang Cui, Wei Bi, Longyue Wang, Linyi Yang, Shuming Shi, Yue Zhang. The 62nd Annual Meeting of the Association for Computational Linguistics (``ACL 2024, CCF-A``). (33) A Rationale-centric Counterfactual Data Augmentation Method for Cross-Document Event Coreference Resolution. [paper] Bowen Ding, Qingkai Min, Shengkun Ma, Yingjie Li, Linyi Yang†, Yue Zhang. Annual Conference of the North American Chapter of the Association for Computational Linguistics 2024 (``NAACL 2024``). (32) PandaLM: An Automatic Evaluation Benchmark for LLM Instruction Tuning Optimization. [paper]; Yidong Wang, Zhuohao Yu, Zhengran Zeng, Linyi Yang, Cunxiang Wang, Hao Chen, Chaoya Jiang, Rui Xie, Jindong Wang, Xing Xie, Wei Ye, Shikun Zhang, Yue Zhang. International Conference on Learning Representations 2024 (``ICLR 2024, Tsinghua-A``). (31) Supervised Knowledge Makes Large Language Models Better In-context Learners. [paper] Linyi Yang, Shuibai Zhang, Zhuohao Yu, Guangsheng Bao, Yidong Wang, Jindong Wang, Ruochen Xu, Wei Ye, Xing Xie, Weizhu Chen, Yue Zhang. International Conference on Learning Representations 2024 (``ICLR 2024, Tsinghua-A``). (30) Fast-DetectGPT: Efficient zero-shot detection of machine-generated text via conditional probability curvature. [paper] Guangsheng Bao, Yanbin Zhao, Zhiyang Teng, Linyi Yang, Yue Zhang. International Conference on Learning Representations 2024 (``ICLR 2024, Tsinghua-A``). (29) LLMs with Chain-of-Thought Are Non-Causal Reasoners. [paper] Guangsheng Bao, Hongbo Zhang, Linyi Yang, Cunxiang Wang, Yue Zhang. arXiv preprint 2024 (``COLING 2024 (Oral)``). (28) A Survey on Evaluation of Large Language Models. [paper]; Yupeng Chang, Xu Wang, Jindong Wang, Yuan Wu, Kaijie Zhu, Hao Chen, Linyi Yang, Xiaoyuan Yi, Cunxiang Wang, Yidong Wang, Wei Ye, Yue Zhang, Yi Chang, Philip S. Yu, Qiang Yang, Xing Xie. Transactions on Intelligent Systems and Technology (``TIST 2024``). (27) Out-of-Distribution Generalization in Natural Language Processing: Past, Present, and Future. [paper] Linyi Yang, Yaoxian Song, Xuan Ren, Chenyang Lyu, Yidong Wang, Jingming Zhuo, Lingqiao Liu, Jindong Wang, Jennifer Foster, Yue Zhang. The 2023 Conference on Empirical Methods in Natural Language Processing (``EMNLP 2023``). (26) Measuring Consistency in Text-based Financial Forecasting Models. [paper] Linyi Yang,Yingpeng Ma, Yue Zhang. The 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers) (``ACL 2023 (Oral)``). (25) GLUE-X: Evaluating Natural Language Understanding Models from an Out-of-distribution Generalization Perspective. [paper]; Linyi Yang, Shuibai Zhang, Libo Qin, Yafu Li, Yidong Wang, Hanmeng Liu, Jindong Wang, Xing Xie, Yue Zhang. Findings of the Association for Computational Linguistics: ACL 2023 (``ACL 2023, CCF-A``). (24) Learning to Generalize for Cross-domain QA. [paper] Yingjie Niu, Linyi Yang, Ruihai Dong, Yue Zhang. Findings of the Association for Computational Linguistics: ACL 2023 (``ACL 2023, CCF-A``). (23) Exploiting Rich Textual User-Product Context for Improving Personalized Sentiment Analysis. [paper] Chenyang Lyu, Linyi Yang, Yue Zhang, Yvette Graham, Jennifer Foster. Findings of the Association for Computational Linguistics: ACL 2023 (``ACL 2023, CCF-A``). (22) On the Robustness of ChatGPT: An Adversarial and Out-of-distribution Perspective. [paper]; Jindong Wang, Xixu Hu, Wenxin Hou, Hao Chen, Runkai Zheng, Yidong Wang, Linyi Yang, Haojun Huang, Wei Ye, Xiubo Geng, Binxin Jiao, Yue Zhang, Xing Xie. Workshop on Trustworthy and Reliable Large-Scale Machine Learning Models at ICLR 2023 (``RTML Workshop 2023``). (21) SciMine: An Efficien",
  "content_length": 13732,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:31"
}