{
  "name": "Linzhang Wang",
  "homepage": "http://cs.nju.edu.cn/lzwang",
  "status": "success",
  "content": "王林章 博士 教授、博士生导师、国家高层次人才特殊支持计划科技创新领军人才、中国计算机学会会士 软件工程组 计算机学院 计算机软件新技术全国重点实验室 联系电话：18951679130 邮箱：lzwang@nju.edu.cn 地址：南京市栖霞区仙林大道163号计算机楼717室 招生学科专业： 1. 0812 计算机科学与技术 2. 0835 软件工程 3. 0854 电子信息 研究兴趣 面向大规模复杂智能化基础软件的可信构造与保障，聚焦软件分析、符号执行、模糊测试、形式化验证、人工智能等技术，研究软件与缺陷的理解和建模，智能化缺陷检测、预测、确认与修复技术与工具。 近期科研项目 1.  国家自然科学基金重点项目：基于模糊测试的物联网设备固件漏洞检测技术研究，2021-2025，348.4万元，主持 2.  国家自然科学基金重点项目：数据驱动的编译器测试，2023-2028，284万元，参与 3.  国防项目，XXXX，2023-2025，185万元，主持 4.  国家重点研发计划项目课题，智能制造软件形式化验证和性能优化技术，2018-2023，297万元，主持 5.  国家自然科学基金面上项目，模型驱动的移动应用测试方法研究，2015-2019，80万元，主持 6.  华为，代码静态检查技术合作项目，2015-2016，93万元，主持 7.  华为，代码分析平台与缺陷自动修复技术，2019-2021，257.5万元，主持 8.  华为，性能问题检测技术，2020-2021，95.79万元，主持 9.  华为，安全与功能类问题检测技术，2020-2021，58.71万元，主持 10. 华为，数通业务新指令自动发掘技术研究，2021-2022，103万元，主持 11. 华为，可扩展的静态分析框架，2021-2022，108.15万元，主持 12. 华为，代码分析平台与缺陷自动修复技术二期，2021-2022，185.4万元，主持 13. 华为：人工智能辅助的缺陷预测演进系统，2024-2025，108.15万元，主持 14. 华为，软件前沿技术分析与洞察，2025-2026，37万元，主持 15. 十四所：嵌入式软件内存泄露缺陷检测定位与修复技术研究，2023-2025，48万元，主持 教学 1.  软件工程 2.  软件体系结构 3.  软件测试 4.  软件工程综合实验 代表论文 [1]. Jiayi Wang, Author PictureYu Wang, Author PictureKe Wang, Author PictureLinzhang Wang，SILVA: A Scalable Incremental Layered Sparse Value-Flow Analysis，ACM Transactions on Software Engineering and Methodology (TOSEM), Just Accepted https://doi.org/10.1145/3725214 [2]. Qian Chen, Chenqi Cui, Fengjuan Gao, Yu Wang, Ke Wang, and Linzhang Wang. 2025. Solving Floating-Point Constraints with Continuous Optimization. Proc. ACM Program. Lang. 9, PLDI, Article 176 (June 2025), 23 pages. https://doi.org/10.1145/3729279 [3]. Qian Chen, Chenyang Yu, Ruyan Liu, Chi Zhang, Yu Wang, Ke Wang, Ting Su, and Linzhang Wang. 2024. Evaluating the Effectiveness of Deep Learning Models for Foundational Program Analysis Tasks. Proc. ACM Program. Lang. 8, OOPSLA1, Article 112 (April 2024), 29 pages [4]. Yu Wang , Ke Wang, Linzhang Wang : An Explanation Method for Models of Code. Proc. ACM Program. Lang. 7(OOPSLA2): 801-827 (2023) [5]. Chi Zhang, Linzhang Wang, and Manuel Rigger. 2024. Finding Cross-Rule Optimization Bugs in Datalog Engines. Proc. ACM Program. Lang. 8, OOPSLA1, Article 98 (April 2024), 27 pages. [6]. Lingyun Situ , Chi Zhang , Le Guan , Zhiqiang Zuo , Linzhang Wang , Xuandong Li, Peng Liu , Jin Shi: Physical Devices-Agnostic Hybrid Fuzzing of IoT Firmware. IEEE Internet Things J. 10(23): 20718-20734 (2023) [7].    WANG, Yu & Gao, Fengjuan & Wang, Linzhang & Yu, Tingting & Zhao, Jianhua & Li, Xuandong. (2020). Automatic Detection, Validation and Repair of Race Conditions in Interrupt-Driven Embedded Software. IEEE Transactions on Software Engineering. 48( 2), Jan. 1 2022，Page(s): 346 – 363. [8]. Ling-Yun Situ, Zhi-Qiang Zuo, Le Guan, Lin-Zhang Wang, Xuan-Dong Li, Jin Shi, Peng Liu. Vulnerable Region-Aware Greybox Fuzzing[J].Journal of Computer Science and Technology, 2021, 36(5): 1212-1228. [9]. 高凤娟, 王豫, 司徒凌云, 王林章. 基于深度学习的混合模糊测试方法. 软件学报, 2021, 32(4): 988-1005. [10]. 高凤娟, 王豫, 周金果, 徐安孜, 王林章, 吴荣鑫, 张川, 苏振东. 高精度的大规模程序数据竞争检测方法. 软件学报, 2021, 32(7): 2039-2055. [11]. Fengjuan Gao, Yu Wang, Linzhang Wang, Zijiang Yang, Xuandong Li:Automatic Buffer Overflow Warning Validation. JCST，35(6): 1406-1427 (2020) [12]. Yu Wang, Ke Wang, Fengjuan Gao, Linzhang Wang:Learning semantic program embeddings with graph interval neural network. Proc. ACM Program. Lang. 4(OOPSLA): 137:1-137:27 (2020)（Distinguished Paper Award） [13]. 王豫，高凤娟，马可欣，司徒凌云，王林章，陈碧欢，刘杨，赵建华，李宣东。垂悬指针检测与防御方法。软件学报， 2020,31(6):1600−1618. DOI: 10.13328/j.cnki.jos.005994. [14]. 高凤娟，王豫，陈天骄，司徒凌云，王林章，李宣东。基于污点分析的数组越界缺陷的静态检测方法。软件学报，2020,31(10): 2983–3003。 [15]. 陆申明, 左志强, 王林章. 静态程序分析并行化研究进展[J]. 软件学报, 2020, 31(5): 1243-1254. [16]. Ling-Yun Situ, Lin-Zhang Wang, Yang Liu, Bing Mao, Xuan-Dong Li. Automatic Detection and Repair Recommendation for Missing Checks. Journal of Computer Science and Technology（JCST）, 2019, 34 (5): 972-992. [17]. 司徒凌云,王林章,李宣东,刘杨.基于应用视角的缓冲区溢出检测技术与工具.软件学报,2019,30(6):1721−1741. [18]. 朱亚伟,左志强,王林章,李宣东. C程序内存泄漏智能化检测方法.软件学报, 2019,30(5):1330−1341； [19]. 周风顺,王林章,李宣东.C/C++程序缺陷自动修复与确认方法.软件学报,2019,30(5):1243−1255. [20]. Yu Wang, Linzhang Wang, Tingting Yu, Jianhua Zhao, and Xuandong Li. 2017. Automatic detection and validation of race conditions in interrupt-driven embedded software. In Proceedings of the 26th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2017). ACM, New York, NY, USA, 113-124. [21]. Xiao Li, Nana Chang, Yan Wang, Haohua Huang, Yu Pei, Linzhang Wang and Xuandong Li. \"ATOM: Automatic Maintenance of GUI Test Scripts for Evolving Mobile Applications,\" 2017 IEEE International Conference on Software Testing, Verification and Validation (ICST), Tokyo, 2017, pp. 161-171. [22]. 李筱,周严,李孟宸,陈园军,XU Guo-Qing,王林章,李宣东.C/C++程序静态内存泄漏警报自动确认方法. 《软件学报》 2017, 28(4):827-844 [23]. Fengjuan Gao, Linzhang Wang, Xuandong Li: BovInspector: automatic inspection and repair of buffer overflow vulnerabilities. In Proceedings of the 31st IEEE/ACM International Conference on Automated Software Engineering (ASE 2016). ACM, New York, NY, USA, 786-791. DOI: http://dx.doi.org/10.1145/2970276.2970282 [24]. Tao Ye, Linzhang Wang, Lingming Zhang, Xuandong Li. An Empirical Study on Detecting and Fixing Buffer Overflow Bugs. ICST 2016：91-101. [25]. 王林章*，何剑涛，韩志雄，卜磊，赵建华，李宣东，设计模式指导的软件分簇方法，中国科学（信息科学），Vol.44，No.1，2014，pp. 37–53. [26]. You Li, Zhendong Su, Linzhang Wang*, and Xuandong Li. 2013. Steering symbolic execution to less traveled paths. SIGPLAN Notice. Vol. 48(10),pp.19-32 (In Proceedings of the 2013 ACM SIGPLAN international conference on Object oriented programming systems languages & applications (OOPSLA '13), October 2013). （Best Paper Award） [27]. Mengchen Li, Yuanjun Chen, Linzhang Wang*, and Guoqing Xu. Dynamically validating static memory leak warnings. In Proceedings of the 2013 International Symposium on Software Testing and Analysis (ISSTA 2013). ACM, New York, NY, USA, pp.112-122. 学术服务 中国计算机学会理事（2023-2027） 《电子学报》领域编委（2025-） 中国计算机学会系统软件专委会副主任（2019-2023） 中国计算机学会系统软件专委会秘书长（2016-2019） 江苏省计算机学会常务理事（2024-2028） 江苏省计算机学会软件专委会主任（2020-2028） 江苏省计算机学会软件专委会秘书长（2010-2020）",
  "content_length": 6016,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:31"
}