{
  "name": "Lionel Parreaux",
  "homepage": "https://www.cse.ust.hk/~parreaux",
  "status": "success",
  "content": "TACO LabSearchTypes, Abstraction, Compilers & OptimizationResearch group at HKUST led by Lionel Parreaux.DescriptionTACO Lab is part of the Software Engineering and Programming Languages research community at the Department of Computer Science and Engineering of the Hong Kong University of Science and Technology (HKUST).This group focuses on research related to Programming Languages, and more specifically:the formalization of advanced type systems for improving the safety, reliability, and performance of software systems;the design and implementation of novel programming language features enabling powerful abstraction capabilities;the development of new compilation and optimization techniques to execute high-level programs more efficiently.As general-purpose programming languages, we mainly use Scala and Haskell, but we are also in the process of designing and implementing several brand new programming languages! This is not just an academic effort, as we aim to make these new developments practical and useful to actual programers.Latest NewsOct 26, 2024 1 min readTwo Distinguished Papers at OOPSLA 2024We are delighted and honored to receive two distinguished paper awards at OOPSLA 2024! The papers are The Ultimate Conditional Syntax and Fast and Optimal Extraction for Sparse Equality Graphs.Sep 5, 2024 1 min readDistinguished Paper at ICFP 2024My student Anto Chen and I are honored and grateful that our paper The Long Way to Deforestation received a Distinguished Paper award at ICFP 2024! The paper is about using “type inference and elaboration”, a new compiler optimization technique, to automatically remove intermediate data structures from functional programs.Jul 3, 2024 2 min readHuaweiâTACO Lab Mini WorkshopLast week, we were delighted to receive the visit of Dr. Vladimir Rubanov and Anton Soldatov from Huawei R&D. We held an improvised mini-workshop focusing on our many common research interests, especially in the context of the OpenHarmony and ArkTS projects.Feb 8, 2024 1 min readWelcome to David MakThe TACO Lab is very glad to welcome David (Ching Hang) Mak, whose PhD is supported by M-Labs.Jan 11, 2024 1 min readFirst TACO Lab Graduates!I am delighted to announce that both Tony Chau and Ishan Bhanuka successfully defended their MPhils recently. Both joined the TACO Lab as MPhil students about two years ago. Moreover, Tony continues on as a PhD student under the prestigious Hong Kong PhD Fellowship Scheme (HKPFS).See all posts Cite × Copy Download",
  "content_length": 2501,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:31"
}