{
  "name": "Lior Wolf",
  "homepage": "http://www.cs.tau.ac.il/~wolf",
  "status": "success",
  "content": "Lior Wolf Prof. Lior Wolf I am a faculty member at the School of Computer Science at Tel Aviv University. Before, I was a postdoc working with Prof. Poggio at CBCL, MIT. I received my PhD working with Prof. Shashua at the Hebrew U, Jerusalem Address: Schreiber Building, room 212, Tel Aviv University, P.O.B. 39040, Ramat Aviv, Tel Aviv 69978 Lab: The lab located at the ICRC building. We share the building with \"the friends of TAU\", see their location in this google map email: phone: +972-3-640-6700 fax: +972-3-640-9357 Publications | Awards | Teaching | Personal Publications: G. Goren, S. Katz, L. Wolf. AlignTree: Efficient Defense Against LLM Jailbreak Attacks. Alignment Track of the AAAI Conference on Artificial Intelligence (AAAI), 2026. B. Lavon, S. Katz, L. Wolf. Execution Guided Line-by-Line Code Generation. Neural Information Processing Systems (NeurIPS), 2025. Y. Bakish, I. Zimerman, H. Chefer, L. Wolf. Revisiting LRP: Positional Attribution as the Missing Ingrediant for Transformer Explainability. Neural Information Processing Systems (NeurIPS), 2025. A. Shaulov, I. Hazan, L. Wolf, H. Chefer. FlowMo: Variance-Based Flow Guidance for Coherent Motion in Video Generation. Neural Information Processing Systems (NeurIPS), 2025. Y. Mazuz, J. Bruner, L. Wolf. ConsiStyle: Enabling Training-Free Style Diversity in Consistent T2I Generation. ACM SIGGRAPH Asia , 2025. A. Ali, S. Katz, L. Wolf, I. Titov. Detecting and Pruning Prominent but Detrimental Neurons in Large Language Models. Conference on Language Modeling (COLM), 2025. A. Ali, I. Zimerman, L. Wolf. The Hidden Attention of Mamba Models. Association for Computational Linguistics (ACL), 2025. S. Katz, L. Ringel, Y. Romano, L. Wolf. Segment-Based Attention Masking for GPTs. Association for Computational Linguistics (ACL), 2025. H. Chefer, U. Singer, A. Zohar, Y. Kirstain, A. Polyak, Y. Taigman, L. Wolf, S. Sheynin. VideoJAM: Joint Appearance-Motion Representations for Enhanced Motion Generation in Video Models. International Conference on Machine Learning (ICML), 2025. K. Cohen, L. Wolf, B. Laufer Goldshtein. Discovering Directions of Uncertainty in Speech Inpainting. Annual Conference of the International Speech Communication Association (INTERSPEECH), 2025. J. Bruner, A. Moryossef, L. Wolf. IlluSign: Illustrating Sign Language Videos by Leveraging the Attention Mechanism. IEEE International Conference on Automatic Face and Gesture Recognition (FG), 2025. Y. Benny, L. Wolf. SphereUFormer: A U-Shaped Transformer for Spherical 360 Perception. IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), 2025. An earlier version E. Shaar, A. Shaulov, G. Chechik, L. Wolf. Adapting to the Unknown: Training-Free Audio-Visual Event Perception with Dynamic Thresholds. IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), 2025.Future link S. Katz, L. Wolf. Reversed Attention: On The Gradient Descent Of Attention Layers In GPT. The Annual Conference of the Nations of the Americas Chapter of the ACL (NAACL), 2025. I. Zimerman, A. Ali, L. Wolf. Explaining Modern Gated-Linear RNNs via a Unified Implicit Attention Formulation. International Conference on Learning Representations (ICLR), 2025. Y. Tewel, R. Gal, D. Samuel, Y. Atzmon, L. Wolf, G. Chechik. Add-it: Training-Free Object Insertion in Images With Pretrained Diffusion Models. International Conference on Learning Representations (ICLR), 2025. A. Ben-Kish, I. Zimerman, S. Abu-Hussein, N. Cohen, A. Globerson, L. Wolf, R. Girys. DeciMamba: Exploring the Length Extrapolation Potential of Mamba. International Conference on Learning Representations (ICLR), 2025. A. Shaulov, T. Shaharabany, E. Shaar, G. Chechik, L. Wolf. Classifier-Guided Captioning Across Modalities. International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2025. T. Amit, T. Markovits, G. Gurevitch, T. Hendler, L. Wolf. Predicting local fMRI activations from EEG: a Feasibility Study Using Both Classical and Modern Machine Learning Pipeline. International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2025. H. Chefer, S. Zada, R. Paiss, A. Ephrat, O. Tov, M. Rubinstein, L. Wolf, T. Dekel, T. Michaeli, I. Mosseri. Still-Moving: Customized Video Generation without Customized Video Data. ACM SIGGRAPH Asia , 2024. S. Katz, Y. Belinkov, M. Geva, L. Wolf. Backward Lens: Projecting Language Model Gradients into the Vocabulary Space. Empirical Methods in Natural Language Processing (EMNLP), 2024. Best paper award. A. Rozner, B. Battash, L. Wolf, O. Lindenbaum. Knowledge Editing in Language Models via Adapted Direct Preference Optimization. Findings of Empirical Methods in Natural Language Processing (EMNLP findings), 2024. G. Rosenman, T. Hendler, L. Wolf. LLM Questionnaire Completion for Automatic Psychiatric Assessment. Findings of Empirical Methods in Natural Language Processing (EMNLP findings), 2024. Y. Choukroun, L. Wolf. Learning Linear Block Error Correction Codes. International Conference on Machine Learning (ICML), 2024. I. Zimerman, L. Wolf. Viewing Transformers Through the Lens of Long Convolutions Layers. International Conference on Machine Learning (ICML), 2024. I. Zimerman, M. Baruch, N. Drucker, G. Ezov, O. Soceanu, L. Wolf. Converting Transformers to Polynomial Form for Secure Inference Over Homomorphic Encryption. International Conference on Machine Learning (ICML), 2024. A. Rozner, B. Battash, L. Wolf, O. Lindenbaum. Anomaly Detection with Variance Stabilized Density Estimation. Uncertainty in Artificial Intelligence (UAI), 2024. I. Zimerman, L. Wolf. Multi-Dimensional Hyena for Spatial Inductive Bias. International Conference on Artificial Intelligence and Statistics (AISTATS), 2024. B. Battash, L. Wolf, O. Lindenbaum. Revisiting the noise Model of SGD. International Conference on Artificial Intelligence and Statistics (AISTATS), 2024. Y. Tewel, O. Kaduri, R. Gal, Y. Kasten, L. Wolf, G. Chechik, Y. Atzmon Training-Free Consistent Text-to-Image Generation. ACM SIGGRAPH, 2024. Y. Choukroun, L. Wolf. A Foundation Model for Error Correction Codes. International Conference on Learning Representations (ICLR), 2024. S. Lutati, E. Nachmani, L. Wolf. Separate and Diffuse: Using a Pretrained Diffusion Model for Better Source Separation. International Conference on Learning Representations (ICLR), 2024. E. Baron, I. Zimerman, L. Wolf. A 2-Dimensional State Space Layer for Spatial Inductive Bias. International Conference on Learning Representations (ICLR), 2024. H. Chefer, O. Lang, M. Geva, V. Polosukhin, A. Shocher, M. Irani, I Mosseri, L. Wolf. The Hidden Language of Diffusion Models. International Conference on Learning Representations (ICLR), 2024. T. D. Hay, L. Wolf. Dynamic Layer Tying for Parameter-Efficient Transformers. International Conference on Learning Representations (ICLR), 2024. T. Shaharabany, L. Wolf. Zero-Shot Medical Image Segmentation Based on Sparse Prompt Using Finetuned SAM. Medical Imaging with Deep Learning (MIDL), 2024. A. Dahan, T. Shaharabany, R. Girys, L. Wolf. Video Polyp Segmentation using Implicit Networks. Medical Imaging with Deep Learning (MIDL), 2024. A. Rozner, B. Battash, L. Wolf, O. Lindenbaum. Domain-Generalizable Multiple-Domain Clustering. Transactions on Machine Learning Research (TMLR), 2024. Y. Choukroun, L. Wolf. Deep Quantum Error Correction. AAAI Conference on Artificial Intelligence (AAAI), 2024. G. Yariv, I. Gat, S. Benaim, L. Wolf, I. Schwartz, Y. Adi. Diverse and Aligned Audio-to-Video Generation via Text-to-Video Model Adaptation. AAAI Conference on Artificial Intelligence (AAAI), 2024. N. Benedek, L. Wolf. PRILoRA: Pruned and Rank-Increasing Low-Rank Adaptation. Findings of the ACL: EACL, 2024. B. Battash, A. Rozner, O. Lindenbaum, L. Wolf. Efficient Verification-Based Face Identification. IEEE International Conference on Automatic Face and Gesture Recognition (FG), 2024. Y. Ger, E. Nachmani, L. Wolf, N. Shahar. Harnessing the flexibility of neural networks to predict dynamic theoretical parameters underlying human choice behavior. PLOS Computational Biology. 2024. S. Lutati, I. Zimerman, L. Wolf. Focus Your Attention (with Adaptive IIR Filters). Empirical Methods in Natural Language Processing (EMNLP), 2023. E. Gomel, T. Shaharabany, L. Wolf. Box-based Refinement for Weakly Supervised and Unsupervised Localization Tasks. IEEE International Conference on Computer Vision (ICCV), 2023. I. Schwartz, V. Snaebjarnarson, S. Benaim, H. Chefer, R. Cotterell, L. Wolf, S. Belongie. Discriminative Class Tokens for Text-to-Image Diffusion Models. IEEE International Conference on Computer Vision (ICCV), 2023. T. Shaharabany, A. Dahan, R. Giryes, L. Wolf. AutoSAM: Adapting SAM to Medical Images by Overloading the Prompt Encoder. The British Machine Vision Conference (BMVC) , 2023. Y. Tewel, Y. Shalev, R. Nadler, I. Schwartz, L. Wolf. Zero-Shot Video Captioning by Evolving Pseudo-tokens. The British Machine Vision Conference (BMVC) , 2023. Y. Choukroun, L. Golgher, P. Binder, L. Wolf. Reconstructing the Hemodynamic Response Function with Bimodal Transformer. International Conference on Medical Image Computing and Computer Assisted Interventions (MICCAI), 2023. T. Amit, S. Shichrur, T. Shaharabany, L. Wolf. Annotator Consensus Prediction for Medical Image Segmentation with Diffusion Models. International Conference on Medical Image Computing and Computer Assisted Interventions (MICCAI), 2023. M. Rotman, A. Dekel, R. Ber, L. Wolf, Y. Oz. Semi-supervised Learning of Partial Differential Operators and Dynamical Flows. Uncertainty in Artificial Intelligence (UAI), 2023. S. Lutati, L. Wolf. OCD: Learning to Overfit with Conditional Diffusion Models. International Conference on Machine Learning (ICML), 2023. H. Chefer, Y. Alaluf, L. Wolf, D. Cohen-Or Attend-and-Excite: Attention-Based Semantic Guidance for Text-to-Image Diffusion Models. ACM SIGGRAPH, 2023. G. Yariv, I. Gat, L. Wolf, Y. Adi, I. Schwartz. Adaptation of Text-Conditioned Diffusion Models for Audio-to-Image Gen",
  "content_length": 62452,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:36"
}