{
  "name": "Liqiang Wang 0001",
  "homepage": "http://www.cs.ucf.edu/~lwang/index.html",
  "status": "success",
  "content": "Liqiang Wang Homepage Liqiang Wang Professor Department of Computer Science University of Central Florida Orlando, FL 32816 HEC 332 Tel: (407) 823-3187 Fax: (407) 823-5835 E-mail: Liqiang.Wang AT ucf.edu Latest News 05/2023: Received Google Gift Grant Donation $10,000! 05/2023: Congratulations to Dongdong Wang for his paper \"On Calibrating Semantic Segmentation Models: Analyses and An Algorithm\" accepted by CVPR 2023! 05/2023: Congratulations to the graduation of Yifan Ding, Dongdong Wang, and Ehsan Kazemi! 10/2022: Congratulations to Zihang Zou for his paper \"Anti-Neuron Watermarking: Protecting Personal Data Against Unauthorized Neural Networks\" accepted by ECCV 2022! 09/2022: Received NSF Grant \"CIVIC-PG Track A: Reimagining Urban Resilience and Education Hubs Using a Community-Engaged, Equity-Centered Approach\", $50,000. Co-PI. 01/2022: Received Meta Gift Grant Donation \"Education in Advanced Artificial Intelligence\" ($50,000)! Short Bio Liqiang Wang is a professor in the Department of Computer Science at the University of Central Florida. He is the director of Big Data Lab. He was a faculty member (2006-2015) in the Department of Computer Science at the University of Wyoming . He received Ph.D. in Computer Science from Stony Brook University in 2006. He was a visiting Research Scientist in IBM T.J. Watson Research Center during 2012-2013. His research focuses on big data computing and analytics techniques in the following aspects: (1) improving accuracy and security of big data analysis models; (2) optimizing performance and scalability of big data processing and parallel computing systems, including multi-threading, HPC, Cloud and GPU platforms; (3) using program analysis and deep learning techniques to detect and prevent programming errors and execution anomaly in big data and/or parallel programs. He received NSF CAREER Award in 2011, Castagne Faculty Fellowship (2013-2015), and Mid-Career Refresh Award (UCF, 2020). Research Hightlight Enabling Multi-Pipeline Data Transfer in HDFS A Geographic Information System (GIS) on Hadoop Analyzing OpenMP programs for Concurrency Errors Accurate GPU Performance Model for Sparse Matrix A Scalable Parallel LSQR Algorithm for Solving Large-Scale Linear System Program Analysis for Atomicity Violations",
  "content_length": 2284,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:33"
}