{
  "name": "Liqun Chen 0002",
  "homepage": "https://www.surrey.ac.uk/people/liqun-chen",
  "status": "success",
  "content": "Prof Liqun Chen | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all LinkedIn Google Scholar ResearchGate ORCID Professor Liqun Chen Professor in Secure Systems +44 (0)1483 684615 liqun.chen@surrey.ac.uk05 BB 03Academic and research departments Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyLiqun joined the Department of Computer Science at the University of Surrey as Professor in Secure Systems in 2016. Prior to this appointment, she was a Principal Research Scientist at Hewlett Packard Laboratories in Bristol, UK, which she joined in 1997. Before that, she worked at Royal Holloway, University of London, the University of Oxford, and Southeast University in P.R. China. Liqun is a visiting professor at Southeast University. Expand biography PatentsDuring her 19 years working for Hewlett Packard, Liqun had a number of patents granted and more out for review. Details of her granted US patents can be obtained from “US patents granted”, and details of her other US patent applications from “US patent applications”. Details of US patents, in general, can be found at http://patft.uspto.gov/. She has also had patents granted and applied for in other countries and regions, but details of these patents are not provided here as they are mostly duplicates of the US ones. All of the patents are assigned to Hewlett Packard Enterprise or Hewlett Packard Inc. Expand about tab additional information News 08 MAR 2022Meet the academic: Professor Liqun Chen 30 SEP 2021Visa and Apple Pay vulnerabilities leaves iPhone users open to payment fraud 10 APR 2018World-leading cyber security expert moves to Surrey ResearchResearch interestsLiqun's current research interests include cryptography applied to a broad range of areas in secure systems, such as trusted computing, hardware security, 5G/6G, cloud computing, distributed ledger, and Internet of Things, and she is also interested in quantum-resistant cryptographic solutions. Expand research interests Research projects FutureTPM FutureTPM will provide a new generation of Trusted Platform Module (TPM) based solutions, incorporating robust and formally verified Quantum-Resistant (QR) cryptographic primitives.The goal is to enable a smooth transition from current TPM environments, based on existing widely used and standardised cryptographic techniques, to systems providing enhanced security through QR cryptographic functions. By designing an innovative portfolio of high-security QR algorithms for primitives such as encryption, digital signature, key exchange, cryptographic hash function, message authentication code, and Direct Anonymous Attestation (DAA). FutureTPM will fill the gaps that currently threaten its long-term security properties. This will enable FutureTPM systems to generate a secure root of trust that can be used for interacting with Cloud services, accessing corporate services, performing banking and eCommerce transactions, along with a wide range of other services. ASSURED In this EU H2020 project, we help shape the future development of secure and trustworthy Cyber-physical System of Systems and services that can greatly benefit the lifecycle of various safety-critical application domains. The core objective is to leverage and enhance runtime property-based attestation and verification techniques. The solution developed will be demonstrated in four scenarios: smart manufacturing, smart cities, smart aerospace, and smart satellite. SECANT This EU H2020 project aims to deliver a holistic framework for cyber security risk assessment in order to enhance digital security, privacy, and personal data protection in complex Information and Communication Technology (ICT) infrastructures. During the project, a toolkit and platform will be developed, demonstrated, and validated. TimeTrust This EPSEC project is using hardware roots of trust to build cyber systems which are better equipped against vulnerabilities related to distance and timing measurements. The main use-case of this project is that of contactless payments, to counter illicit payments that can be made from a distance even if touch-and-pay is supposed to disallow it. The project is looking both at the formal treatment of security (e.g. mathematical proofs) and at practical aspects. CONNECT This EU Horizon project aims to address the convergence of security and safety in Connected, Cooperative and Automated Mobility (CCAM) by assessing dynamic trust relationships and defining a trust reasoning framework based on which involved entities can establish trust for cooperatively executing safety-critical functions. REWIRE This EU Horizon project aims to safeguard the entire workflow of secure processing; from the deployment and operation of system of systems to their patch management when new exploits have been identified during run-time. The project will provide new trust management mechanisms for the auditability and certification of software/hardware open-source specifications. ENTRUST This EU Horizon project aims to develop dynamic trust assessment and reasoning for medical devices to establish security and privacy in a zero-trust paradigm. The project takes into account the latest technological advancements and connectivity expansions.  CASTORThis EU Horizon project develops and evaluates technologies to enable trustworthy continuum-wide communications, to realise an optimised, trusted communication path delivering innovation-breakthroughs to the so-far unsatisfied need: a) for distributed (composable) attestation of the continuum nodes and subsequent elevation of individual outcomes to an adaptive (to changes) continuum trust quantification; b) for the derivation of the optimal path as a joint computation of the continuum trust properties and resources; c) for continuum infrastructure vendor-agnostic trusted path establishment, seamlessly crossing different administrative domains. This 3-year project will start in October 2024. Expand research projects TeachingI teach the following MSc modules:COMM047: Secure Systems and ApplicationsCOMM048: Information and Network SecurityCOMM068: Network SecurityI teach the following undergraduate modules:COM2041: Computer SecurityCOM3009: Computer SecurityI supervise PhD projectsMSc projectsUndergraduate projects Expand my teaching PublicationsHighlightsMore recent publications can be found athttps://orcid.org/0000-0003-2680-4907",
  "content_length": 7741,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:35"
}