{
  "name": "Lirong Xia",
  "homepage": "https://people.cs.rutgers.edu/~lirong.xia",
  "status": "success",
  "content": "Lirong Xia ABOUT PUBLICATIONS GROUP TEACHING Lirong Xia Professor of Computer Science Deputy Director of DIMACS CoRE 424 lirong.xia@rutgers.edu +1-848-445-0073 CV APPOINTMENTS Professor Department of Computer Science, Rutgers University - New Brunswick, Piscataway, NJ, USA. Sep. 2024 - present Deputy Director DIMACS (the Center for Discrete Mathematics and Theoretical Computer Science), Piscataway, NJ, USA. Sep. 2024 - present DEGREES Ph.D., Computer Science Duke University, Durham, NC , USA. Aug, 2011. M.A., Economics Duke University, Durham, NC , USA. Dec., 2010. B.E., Computer Science and Technology Tsinghua university, Beijing, China. July, 2004. POSTGRADUATE TRAINING NSF CI-Fellow, Center for Research on Computation and Society Harvard University, Cambridge, MA, USA. Sep., 2011 - July 2013. RESEARCH INTERESTS Artificial intelligence, machine learning, multi-agent systems, decision-making under uncertainty, algorithm design, social choice theory, game theory, mechanism design, prediction markets, preference learning, differential privacy, blockchain. BIOGRAPHY Lirong Xia is a Professor of Computer Science at Rutgers University - New Brunswick and the Deputy Director of DIMACS (the Center for Discrete Mathematics and Theoretical Computer Science). Prior to joining Rutgers and DIMACS, he was an assistant then associate professor at RPI (2013-2024), a CRCS fellow and NSF CI Fellow at the Center for Research on Computation and Society at Harvard University (2011-2013). He received his Ph.D. in Computer Science and M.A. in Economics from Duke University. His research focuses on the intersection of computer science and microeconomics. He is an associate editor of Mathematical Social Sciences and Artificial Intelligence Journal. He is the recipient of an NSF CAREER award, a Simons-Berkeley Research Fellowship, the 2018 Rensselaer James M. Tien’66 Early Career Award, and was named as one of “AI’s 10 to watch” by IEEE Intelligent Systems. PUBLICATIONS Book and Book Chapters Lirong Xia. Learning and Decision-Making from Rank Data, Morgan & Claypool, 2019. Synthesis Lectures on Artificial Intelligence and Machine Learning. Jerome Lang and Lirong Xia. Voting in Combinatorial Domains. In Felix Brandt, Vincent Conitzer, Ulle Endriss, Jerome Lang, and Ariel Procaccia, editors, Handbook of Computational Social Choice, chapter 9. Cambridge University Press, 2016. Ongoing work Hadi Hosseini, Joshua Kavner, Samarth Khanna, Sujoy Sikdar, Lirong Xia. Bridging Theory and Perception in Fair Division: A Study on Comparative and Fair Share Notions. [arXiv] Qishen Han, Grant Schoenebeck, Biaoshuai Tao, Lirong Xia. The Art of Two-Round Voting. [arXiv] Qishen Han, Grant Schoenebeck, Biaoshuai Tao, Lirong Xia. Aggregating Information and Preferences with Bounded-Size Deviations. [arXiv] Lirong Xia. A Linear Theory of Multi-Winner Voting. [arXiv] Joshua Kavner, Lirong Xia. Average-Case Analysis of Iterative Voting. [arXiv] Zhechen Li, Zimai Guo, Lirong Xia, Yongzhi Cao, Hanpin Wang. Differentially Private Approval-Based Committee Voting. [arXiv] Inwon Kang, Sikai Ruan, Tyler Ho, Jui-Chien Lin, Farhad Mohsin, Oshani Seneviratne, Lirong Xia. LLM-augmented Preference Learning from Natural Language. [arXiv] Jui Chien Lin, Farhad Mohsin, Sahith Bhamidipati and Lirong Xia. Generating Election Data Using Deep Generative Models. To be presented at the AI for social good workshop at AAAI-23. Farhad Mohsin, Inwon Kang, Yuxuan Chen, Jingbo Shang and Lirong Xia. Dependency and Coreference-boosted Multi-Sentence Preference model. To be presented at the AAAI 2023 Workshop on Deep Learning on Graphs: Methods and Applications. Hadi Hosseini, Joshua Kavner, Sujoy Sikdar, Rohit Vaish, Lirong Xia. Hide, Not Seek: Perceived Fairness in Envy-Free Allocations of Indivisible Goods. [arXiv] Farhad Mohsin, Lei Luo, Wufei Ma, Inwon Kang, Zhibing Zhao, Ao Liu, Rohit Vaish and Lirong Xia. Making Group Decisions from Natural Language-Based Preferences. Presented at COMSOC-21. [COMSOC version] [dataset] Qishen Han, Sikai Ruan, Yuqing Kong, Ao Liu, Farhad Mohsin, Lirong Xia. Truthful Information Elicitation from Hybrid Crowds. Presented at COMSOC-21 student poster session. [arXiv] Farhad Mohsin, Inwon Kang, Pin-Yu Chen, Francesca Rossi and Lirong Xia. Learning Individual and Collective Priorities over Moral Dilemmas with the Life Jacket Dataset. Presented at MREF-22. 2026 + Ratip Emin Berker, Emanuel Tewolde, Vincent Conitzer, Mingyu Guo, Marijn J. H. Heule, Lirong Xia. On the Edge of Core (Non-)emptiness: An Automated Reasoning Approach to Approval-based Multi-winner Voting. In Proceedings of AAAI-26. Qishen Han, Biaoshuai Tao, Lirong Xia, Chengkai Zhang, Houyu Zhou.  Likelihood of the Existence of Average Justified Representation. In Proceedings of SODA-26. [arXiv] 2025 Stephanie Milani, Zhicheng Zhang, Nicholay Topin, Lirong Xia and Fei Fang. Aligning Agent Policies with Preferences: Human-Centered Interpretable Reinforcement Learning. In Proceedings of AIES-25. Hadi Hosseini, Joshua Kavner, Sujoy Sikdar, Rohit Vaish, Lirong Xia. Epistemic vs. Counterfactual Fairness in Allocation of Resources. In Proceedings of EAAMO-25. [arXiv] Ziqi Yu, Qishen Han, Chengkai Zhang, Lirong Xia. How Likely Are Two Voting Rules Different? In Proceedings of UAI-25. Zhechen Li, Ao Liu, Lirong Xia, Yongzhi Cao, Hanpin Wang. Trading Off Voting Axioms for Privacy. In Proceedings of UAI-25. [arXiv] Qishen Han, Grant Schoenebeck, Biaoshuai Tao, Lirong Xia. Strong Equilibria in Bayesian Games with Bounded Group Size. In Proceedings of WWW-25. [arXiv] 2024 Lirong Xia. Computing Most Equitable Voting Rules. In Proceedings of WINE-24. [arXiv] Hadi Hosseini, Joshua Kavner, Tomasz Wąs, Lirong Xia. Distribution of Chores with Information Asymmetry. In Proceedings of ECAI-24. [arXiv] Qishen Han, Amélie Marian, Lirong Xia. Determining Winners in Elections with Absent Votes. In Proceedings of IJCAI-24. [arXiv] Farhad Mohsin, Qishen Han, Sikai Ruan, Pin-Yu Chen, Francesca Rossi and Lirong Xia. Computational Complexity of Verifying the Group No-show Paradox. In Proceedings of IJCAI-24. (Previously appeared as a non-archival extended abstract at AAMAS-23.) 2023 Lirong Xia. Most Equitable Voting Rules. In Proceedings of WINE-23. [arXiv] Qishen Han, Biaoshuai Tao, Lirong Xia. Average Envy-freeness for Indivisible Items. In Proceedings of EAAMO-23. [arXiv] Ao Liu, Qishen Han, Lirong Xia, Nengkun Yu. Accelerating Voting by Quantum Computation. In Proceedings of UAI-23. [arXiv] Lirong Xia. The Impact of a Coalition: Assessing the Likelihood of Voter Influence in Large Elections. In Proceedings of EC-23. [arXiv] Qishen Han, Grant Schoenebeck, Biaoshuai Tao, Lirong Xia. The Wisdom of Strategic Voting. In Proceedings of EC-23. [arXiv] Xiaoxi Guo, Sujoy Sikdar, Lirong Xia, Yongzhi Cao, Hanpin Wang. First-Choice Maximality Meets Ex-ante and Ex-post Fairness. In Proceedings of IJCAI-23. [arXiv] Joshua Kavner, Reshef Meir, Francesca Rossi and Lirong Xia. Convergence of Iterative Combinatorial Voting under Uncertainty. In Proceedings of IJCAI-23. [arXiv] Hadi Hosseini, Sujoy Sikdar, Rohit Vaish, Lirong Xia. Fairly Dividing Mixtures of Goods and Chores under Lexicographic Preferences. In Proceedings of AAMAS-23. [arXiv] Inwon Kang, Qishen Han and Lirong Xia. Learning to Explain Voting Rules. AAMAS-23 (extended abstract). Lirong Xia. Semi-Random Impossibilities of Condorcet Criterion. In Proceedings of AAAI-23. [arXiv] Zhechen Li, Ao Liu, Lirong Xia, Yongzhi Cao, Hanpin Wang. Differentially Private Condorcet Voting. In Proceedings of AAAI-23. [arXiv] Reshef Meir, Ofra Amir, Gal Cohensius, Omer Ben-Porat, and Lirong Xia. Frustratingly Easy Truth Discovery. In Proceedings of AAAI-23. [arXiv] Ao Liu, Yu-Xiang Wang, Lirong Xia. Smoothed Differential Privacy. TMLR. Dec, 2023. [arXiv] Jingwen Qian, Sujoy Sikdar, Ge Wang, Lirong Xia. Anti-Collusion Dynamic Distanced Online Testing. Technology & Innovation, 2023. Qian Li, Liang Wang, Lirong Xia, Wenxun Zheng, Yuxuan Zhou. A practical multi-objective auction design and optimization framework for sponsored search. Operations Research Letters, 2023. Dorothea Baumeister, Marc Neveling, Magnus Roos, Jörg Rothe, Lena Schend, Robin Weishaupt, Lirong Xia. The Possible Winner with Uncertain Weights Problem. Journal of Computer and System Sciences, 2023. Xiaoxi Guo, Sujoy Sikdar, Lirong Xia, Hanpin Wang, Yongzhi Cao. Favoring Eagerness for Remaining Items: Achieving Efficient and Fair Assignments. Journal of Artificial Intelligence Research, 76 (2023). [arXiv] Haibin Wang, Sujoy Sikdar, Xiaoxi Guo, Lirong Xia, Yongzhi Cao, Hanpin Wang. Multi-type Resource Allocation with Partial Preferences. Artificial Intelligence, 314 (2023). 2022 Lirong Xia, Weiqiang Zheng. Beyond the Worst Case: Semi-Random Complexity Analysis of Winner Determination. In Proceedings of WINE-22. Benjamin Kelly, Inwon Kang, Lirong Xia. Crowdsourcing Perceptions of Gerrymandering. In Proceedings of HCOMP-22. Zhibing Zhao, Ao Liu, Lirong Xia. Learning Mixtures of Random Utility Models with Features from Top-l Orders. In Proceedings of IJCAI-22. Sujoy Sikdar, Sikai Ruan, Qishen Han, Paween Pitimanaaree, Jeremy Blackthorne, Bulent Yener, Lirong Xia. Anti-Malware Sandbox Games. In Proceedings of AAMAS-22. [arXiv] Ao Liu, Lirong Xia. The Semi-Random Likelihood of Doctrinal Paradoxes. In Proceedings of AAAI-22. [arXiv] Farhad Mohsin, Ao Liu, Pin-Yu Chen, Francesca Rossi and Lirong Xia. Learning to Design Fair and Private Voting Rules. Journal of Artificial Intelligence Research. 75 (2022) 1139-1176. To be presented at IJCAI-23 journal track. Ao Liu, Xiaoyu Chen, Sijia Liu, Lirong Xia, Chuang Gan. Certifiably Robust Interpretation via Renyi Differential Privacy. Artificial Intelligence. 313 (2022). Oral presentation at AAAI-23 journal track. [arXiv] Lirong Xia. Group decision making under uncertain preferences: powered by AI, empowered by AI. Annals of the New York Academy of Sciences. 2021 Lirong Xia. The Semi-Random Sat",
  "content_length": 35640,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:36"
}