{
  "name": "Lisa Singh",
  "homepage": "http://people.cs.georgetown.edu/~singh",
  "status": "success",
  "content": "Lisa Singh Georgetown University Department of Computer Science Home About me Research Teaching lisa singh hello! I am a Professor in the Department of Computer Science in the College of Arts and Science and in the McCourt School of Public Policy at Georgetown University. I am also the Director of the Massive Data Institute (MDI). My specialization is what I like to call - data-centric computing. It means that I work on lots of aspects of data driven computer science - data mining, data privacy, data science, data ethics. I also dabble in computational social science, working on problems with public policy implications. In general, I like working with noisy, messy, partial data to determine what its limitations are, what I can say about it, what I can learn from it in ethical, privacy-preserving ways, and how I can use this new found knowledge to improve outcomes for people. more > quick links research projects: - The Social Science and Social Media Collaborative (S3MC) - Measuring Online Social Attitudes and Information Collaborative (MOSAIC) - Forced Migration (w/ ISIM) - Election 2020 (w/ CNN & UM) and Election 2016 (w/ Gallup & UM) - Social Media and Gun Policy - Online Social Movements - #metoo - Animal Networks (w/ Shark Bay Dolphin Project) - Privacy and WebFootprinting outreach: - GU Women Coders (guWeCode) - Georgetown Hackathon (HoyaHacks) - ACM Capital Region Celebration of Women in Computing (2017 - at GU) - CS4HS Workshop for High School teachers (2013) - Women in Computing Luncheon (2008) meetings & workshops: - 5 meetings: Quantitative Research in Social Science (2020 & 2021) - Data Blending: Tackling the Obstacles (2019) - NSF Big Data Research and Hubs and Spokes PI Meeting (2017) - NSF Big Data PI Workshop (BDPI-2016) - NITRD Big Data Strategic Initiative Workshop (BDSI-2015) - NSF Information Integration & Informatics (III-2010) select papers & reports: Publication List (generated from BibBase years ago - dblp will be more up to date) Words That Matter: How the News and Social Media Shaped the 2016 Presidential Campaign Download MDI Data Blending Report - 2020 Download Blending Noisy Social Media Signals with Traditional Movement Variables to Predict Forced Migration (2019) ACM International Conference on Knowledge Discovery and Data Mining (KDD) Download NSF Big Data PI Meeting Final Report - 2017 Download Overlapping target event and storyline detection of online newspaper articles. (2016) IEEE International Conference on Data Science and Advanced Analytics. Received Best Paper Honorable Mention Award Download NSF Big Data PI Meeting Final Report - 2016 Download Public Information Exposure detection: Helping users understand their web footprints.(2015) IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM) Received Best Paper Runner-up Award Download Spearheading Innovation in the Face of Massive Data. (2015) NITRD Big Data Strategic Initiative Meeting Final Report - 2015 Download Stability vs. Diversity: Understanding the dynamics of actors in time-varying affiliation networks.(2012) ASE/IEEE International Conference on Social Informatics. Received Best Paper AwardDownload Social networks reveal cultural behaviour in tool-using using dolphins. (2012) Nature Communications. Download happenings Lisa's Occasional Random Thoughts 8/2023Joint appointed at the McCourt School of Public Policy 8/2023 Yaguang Liu defends disseration 12/2022 Ken Kawintiranon defends disseration 7/2022 New Director at MDI 12/2021 Rob Churchill defends disseration Spring 2021 MOSAIC project begins 10/2020 Realtime presidential debate analysis London School of Economics post Fall 2020CNN/GU/UM: Election 2020 attitude tracking 4/2020Book is out!! Words That Matter 10/2019Received IEEE Service Award Spring 2018Officially joining MDI 5/2018GU undergraduate CS graduating class 50% female!! See how we got there 4/2018Data privacy discussion with the Washington Post - Your data on Facebook 12/2017Speak about big data and forced migration at NAS Symposium 2/2017Hosted ACM CAPWIC Women's CS Conference at GU - over 200 people attended!! Hoya Article 1/2017gu-WeCode Coding Party - over 60 people coding!! Hoya Article 1/2017Reprint of Clinton topic visual analytic The Hill Article 9/2016\"Email\" Dominates What Americans Have Heard About Clinton Gallup Article 2/2016Should Computer Science Cover More than Just Coding NPR 1/2016GU's first Hackathon Hoya Hacks 9/2014Privacy Isn't Dead Yet nextGov Spring 2014CS&E Club teaches Scratch at Lab School 2/2014GU Women Coders is born! Email: first_name.last_name at georgetown.edu Research Mgr-Becky:rv444@georgetown.edu 351 St. Mary's Building 202-687-9253",
  "content_length": 4700,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:38"
}