{
  "name": "Lisa Bylinina",
  "homepage": "https://bylinina.github.io",
  "status": "success",
  "content": "Lisa Bylinina I am a linguist, interested in theoretical linguistics and in natural language processing. I am an Assistant Professor in Computational Linguistics (UD1, if you know the Dutch system) at Utrecht University, working in the Language and Communication group, part of the Institute for Language Sciences. I am also a member of the NLP@U special interest group. Before September 2024, I was an Assistant Professor at the University of Groningen, Center for Language and Cognition (CLCG), Computational Linguistics Group. In Utrecht, I teach in the Applied Data Science master program and in the bachelor program Communication and Information Science. I am open to supervise (research) master theses in data science, AI and theoretical linguistics (semantics, mostly). I wrote up a small thing that contains notes for my ‘Linguistics for Language Technology’ 2023 course at RuG. The course is over, but people seem to like the website, so if you are here for the course notes, check them out! News I gave a keynote at the SIGTYP workshop at ACL 2025. I got an Open Competition XS grant from NWO (Dutch Research Council). 47k euros to work on something I called “Interacting with AI personae” thoughout the 2025/2026 academic year! This little book came out at CUP – first publication of 2025! Preprint is up on LingBuzz. We (Yasu Sudo, Stavroula Alexandropoulou and I) presented our work on priming English and Russian NPIs at the Amsterdam Colloquium 18-20 December 2024. EMNLP/CoNLL 2024: Didn’t do anything for main sessions this time, but check out our paper for the BabyLM challenge (a CoNLL workshop) and our (other set of co-authors) paper on individuation in text-only vs multimodal models (NLP4Science workshop at EMNLP). Our BabyLM model took second place in the strict small track! I gave a talk at the first 2024/2025 meeting of the special interest group NLP@U. Check out the slides! [This is a big one] I am joining Utrecht University (Institute for Language Sciences) as Assistant Professor in September 2024! I did my PhD there, so it feels like going home (good). My short research visit to Trento in April 2024 resulted in this joint work with Jaap Jumelet, Jelle Zuidema and Jakub Szymanik: “Black Big Boxes: Do Language Models Hide a Theory of Adjective Order?” (under revision at TACL, preprint)",
  "content_length": 2324,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:35"
}