{
  "name": "Lisa Wu Wills",
  "homepage": "https://www.lisawuwills.com",
  "status": "success",
  "content": "Lisa Wu Wills I am an assistant professor in the Department of Computer Science and Electrical and Computer Engineering at Duke University. My research focuses on harnessing the unprecedented computational power and efficiency of hardware acceleration to expedite and advance research in areas related to big data, the natural sciences, healthcare, and artificial intelligence, ultimately improving human flourishing. Specifically, leverage the insights derived from a deep understanding of applications (e.g., data structures, data access patterns, computational patterns, application characteristics) to create innovative hardware and software systems to tackle impactful problems. In addition, I am improving the ecosystem to enable architects to develop and deploy accelerators more easily, and to allow non-hardware users to leverage the efficient accelerated systems with a low barrier to entry. Hiring 2 CS PhD students for Fall 2026! I am hiring two Computer Science PhD students for Fall 2026! Students who have strong computer architecture foundations and matching research interests can apply via the Duke CS PhD application portal. When your application is completed (including all the recommendation letters), please send me an email. I will be reviewing applications and scheduling Zoom interviews starting in December 2025. Recent News Google ML and Systems Junior Faculty Award 16 Jul 2025 Thank you Google for the generous gift to support our research! We will be using this award to explore hardware and software methods to accelerate vector databases and retrieval-augmented generation for large language models. Trinity College of A... Video Codecs are Secretly Tensor Codecs at MICRO 2025 14 Jul 2025 As the parameter size of large language models (LLMs) continues to expand, the need for a large memory footprint and high communication bandwidth have become significant bottlenecks for the training and inference of LLMs. To mitigate these bottlen... ISCA Tutorial for an Open-Source Accelerator Composer Beethoven 21 Jun 2025 Introducing Beethoven — an open-source full-stack framework that simplifies the development and deployment of hardware accelerators on FPGA and ASIC platforms. Come check out our inaugural Beethoven tutorial at ISCA 2025 in Tokyo, Japan! To learn... PhD Students Chris Kjellqvist 6th-year CS PhD Student Chris is the lead architect of Beethoven, an open-source accelerator development and deployment framework. His research leverages modern hardware description languages’ flexible, generative ability and programming abstraction to provide scalable and reusable SoC infrastructure for hardware accelerator development. Mason Ma 5th-year CS PhD Student Mason is the lead architect of PyTFHE, an open-source compilation and execution framework for Fully Homomorphic Encryption (FHE) applications. His research focuses on efficient software and hardware design for privacy-preserving computing, with a particular emphasis on advancing FHE through optimizations in arithmetic, compilers, and hardware accelerators. Mansi Choudhary 4th-year ECE PhD Student Mansi is the creator of COCOSSim, a cycle-accurate, offload, configurable, and open-source systolic-array-based accelerator simulator. Her research focuses on workload analysis, performance modeling, and hardware acceleration through architectural and microarchitectural enhancements for domain-speciﬁc applications, including artificial intelligence. Ning Liang 2nd-year CS PhD Student Ning's research investigates hardware and software optimizations for more efficient and accurate LLM serving systems. Specifically, his work focuses on accelerating vector databases and retrieval-augmented generations. Entropy Xu Former PhD Student. Now: Postdoc at HKUST Entropy is the lead architect of ProSE, a protein discovery engine that executes ProteinBERT inference at significantly better power and performance efficiency compared to SOTA GPU and TPU platforms. He is also the creator of fast, accurate, and transferrable synthesis predictors SNS and SNSv2. His research focuses on computer architecture for AI and AI for computer architecture.",
  "content_length": 4143,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:37"
}