{
  "name": "Lishan Yang",
  "homepage": "https://lishanyang.github.io",
  "status": "success",
  "content": "Lishan Yang's Homepage Services Teaching Students Funding Publications Home Lishan Yang (杨丽杉) Assistant Professor George Mason University Department of Computer Science Email: lyang28 AT gmu.edu Office: ENGR 4610 My research interest mainly falls in system reliability and GPU architecture. I received a Ph.D. degree in the Department of Computer Science at William & Mary in 2022, under the supervision of Prof. Evgenia Smirni. Before coming to W&M, I got my bachelor's degree in computer science from University of Science and Technology of China (USTC) in 2016. Check my CV here >>>>>>>>> Spring 2026 CS 672 Computer Systems Performance Evaluation The syllabus is here. The focus of CS 672 is Systems - and how to measure a system. We will cover the performance measurement from theory to practice, but, with an emphasize of getting your hands dirty. If you worry about math: CS 672 does have some math - limitation, probability, distributions, confidence interval, etc - That's all. No hard math... Also, when we put math into a practical problem, math might not be as difficult as you thought :P What you will learn from this course: How to measure your system, how to find bottlenecks, how to convince people your software has good performance, how to estimate the maximum possible gain of your idea, etc. To me, performance evaluation covers a lot of useful techniques that are essential to every SDE and researcher. >>>>>>>>> I am at capacity for hiring new graduate students. I am *only* looking for GMU undergraduate students who are interested in joining my lab and getting their hands dirty on system research. However, for any student from anywhere, if you want some general advices or if you have some confusions, for example, research, career path, rejected papers, not getting along with your advisor, etc, you are welcome to send an email to me and I will find some time for a quick chat. Sometimes an outsider helps; I got many help from various (random) outsiders during my PhD study. ------ I am serving as the Student Activities Co-chair for ACM SIGMETRICS 2026. This year we plan to have: 1) Student Travel Grant, 2) Student Research Competition (SRC), 3) Student Mentoring Program, 4) Student Mentoring Lunch, and 5) Shadow PC. Stay tuned for these activites :] Publications My students are highlighted. Demystifying the Resilience of Large Language Model Inference: An End-to-End Perspective SC 2025 (Acceptance rate: 21.2%) [PDF] [code] Yu Sun, Zachary Coalson, Shiyang Chen, Hang Liu, Zhao Zhang, Sanghyun Hong, Bo Fang, Lishan Yang FT2: First-Token-Inspired Online Fault Tolerance on Critical Layers for Generative Large Language Models HPDC 2025 (Acceptance rate: 18.8%) [PDF] [code] [Slides] Yu Sun, Zhu Zhu, Cherish Mulpuru, Roberto Gioiosa, Zhao Zhang, Bo Fang, Lishan Yang Safety Interventions against Adversarial Patches in an Open-Source Driver Assistance System DSN 2025, Practical Experience Report (Acceptance rate: 20.2%) Cheng Chen, Grant Xiao, Daehyun Lee, Lishan Yang, Evgenia Smirni, Homa Alemzadeh, Xugui Zhou GPU Reliability Assessment: Insights Across the Abstraction Layers CLUSTER 2024 (Acceptance rate: 28.2%, Best Paper Finalist) [PDF] Lishan Yang, George Papadimitriou, Dimitrios Sartzetakis, Adwait Jog, Evgenia Smirni, Dimitris Gizopoulos Aspis: Lightweight Neural Network Protection Against Soft Errors ISSRE 2024 (Acceptance Rate: 25.9%) [PDF] Anna Schmedding, Lishan Yang, Adwait Jog, Evgenia Smirni Strategic Resilience Evaluation of Neural Networks within Autonomous Vehicle Software SafeComp 2024 (Acceptance rate: 23.5%) Anna Schmedding, Philip Schowitz, Xugui Zhou, Yiyang Lu, Lishan Yang, Homa Alemzadeh, Evgenia Smirni Investigating the Impact of High-Level Software Design on Low-Level Hardware Fault Resilience DSN 2023, Disrupt23 track Bohan Zhang, Lishan Yang, Hui Xu, Guanpeng Li Epidemic Spread Modeling for COVID-19 Using Cross-fertilization of Mobility Data IEEE Transactions on Big Data (TBD), 2023 Anna Schmedding, Riccardo Pinciroli, Lishan Yang, Evgenia Smirni GeoSpread: an Epidemic Spread Modeling Tool for COVID-19 Using Mobility Data GoodIT 2022 Anna Schmedding, Lishan Yang, Riccardo Pinciroli, Evgenia Smirni Strategic Safety-Critical Attacks Against an Advanced Driver Assistance System DSN 2022, Practice Experience Report Xugui Zhou, Anna Schmedding, Haotian Ren, Lishan Yang, Philip Schowitz, Evgenia Smirni, Homa Alemzadeh Lifespan and Failures of SSDs and HDDs: Similarities, Differences, and Prediction Models IEEE Transactions on Dependable and Secure Computing (TDSC), 2022 Riccardo Pinciroli, Lishan Yang, Jacob Alter, Evgenia Smirni SUGAR: Speeding Up GPGPU Application Resilience Estimation with Input Sizing Sigmetrics 2021 (Fall Deadline, Acceptance Rate: 12%) [PDF] [video] [Slides] Lishan Yang, Bin Nie, Adwait Jog, Evgenia Smirni Enabling Software Resilience in GPGPU Applications via Partial Thread Protection ICSE 2021 (Acceptance Rate: 22%) [PDF] [Video] [Slides] Lishan Yang, Bin Nie, Adwait Jog, Evgenia Smirni Practical Resilience Analysis of GPGPU Applications in the Presence of Single- and Multi-bit Faults IEEE Transactions on Computers, vol. 70, no. 1, pp. 30-44, 1 Jan. 2021 [PDF] Lishan Yang, Bin Nie, Adwait Jog, Evgenia Smirni Fault Site Pruning for Practical Reliability Analysis of GPGPU Applications MICRO 2018: 749-761 (Acceptance Rate: 21%) [PDF] [Lightening Video] [Slides] [Poster] Bin Nie, Lishan Yang, Adwait Jog, Evgenia Smirni Evaluating Scalability and Performance of a Security Management Solution in Large Virtualized Environments ICPE 2018: 168-175 [PDF] [Slides] Lishan Yang, Ludmila Cherkasova, Rajeev Badgujar, Jack Blancaflor, Rahul Konde, Jason Mills, Evgenia Smirni G-NET: Effective GPU Sharing in NFV Systems NSDI 2018: 187-200 (Acceptance Rate: 16%) [PDF] Kai Zhang, Bingsheng He, Jiayu Hu, Zeke Wang, Bei Hua, Jiayi Meng, Lishan Yang Refereed Posters Probing Weaknesses in GPU Reliability Assessment: A Cross-Layer Approach ISPASS 2021, Poster [PDF] Lishan Yang, George Papadimitriou, Dimitrios Sartzetakis, Adwait Jog, Evgenia Smirni, Dimitris Gizopoulos Typhoon: Enabling GPGPU Application Resilience Estimation with Different Input Types ACM Sigmetrics Student Research Competition (SRC) 2021 [PDF] Lishan Yang Simulating COVID-19 Containment Measures Using the South Korean Patient Data Sensys 2020, COVID-19 Pandemic Research Poster Session [PDF] [Slides] [Demo] Lishan Yang, Anna Schmedding, Riccardo Pinciroli, Evgenia Smirni Students I am fortunated to work with the following students: • Rohan Mengle (Undergrad, since 2025 Fall) • Ying Tang (PhD student, since 2025 Fall) • Yu Sun (PhD student, since 2023 Fall) • Zhu Zhu (Graduate Research Assistant, 2023 Fall - 2025 Summer) • Giuseppe De Rosa (Visiting PhD student from Scuola IMT Alti Studi Lucca, 2025 March-September) • Daehyun Lee (MS student, since 2024 Fall) • Dhatri Parakal (Undergrad from UIUC, 2024 Spring - 2025 Spring, recruited from ASSIP) • Cherish Mulpuru, (Undergrad, supported by CCI NoVA-node URA program, 2024 Fall - 2025 Spring) • Sam O'Neill (Undergrad, 2025 Spring) • Sofia Francisco Skamnelos (High school student from Holton-Arms School, 2024 Fall - 2025 Spring, through an initiative of \"Directed Reading\" program with Holton-Arms School) • Grace Xiao (High school student from Holton-Arms School, 2024 Fall - 2025 Spring, through an initiative of \"Directed Reading\" program with Holton-Arms School) • Lucia M. Noto (High school student from Holton-Arms School, 2024 May-Sep, through an initiative of \"Directed Reading\" program with Holton-Arms School) • Weilon Price (Undergrad, 2022-2023) Research Funding My research group is supported by the following research grants: • NSF, #CCF-2402940, 2024-2027 Collaborative Research: SHF: Medium: End-to-End Resilience in Autonomous Driving Systems: Strategic Vulnerability Assessment and Mitigation Role: lead-PI With Dr. Homa Alemzadeh (University of Virginia) and Dr. Evgenia Smirni (William & Mary) • NSF, #OAC-2410856, 2024-2027 Collaborative Research: Elements: MELIOREM: An Integrated Evaluation Cyberinfrastructure towards Safe and Dependable Autonomous Driving Systems Role: co-PI With Dr. Guanpeng Li (lead-PI, University of Iowa) • NSF, #OAC-2417718, 2024-2028 Collaborative Research: CyberTraining: Implementation: Medium: AI4EDU: Cloud Infrastructure-Enabled Training for AI in Educational Research and Assessment Role: co-PI With Dr. Ningfang Mi (lead-PI, Northeastern University), Yu Wang (Temple University), Chiu C. Tan (Temple University), Chuang Wang (University of North Carolina at Charlotte) • Commonwealth Cyber Initiative (CCI), #HC‐3Q24‐047, Research in Supply Chain Cybersecurity, 2024. Securing the Machine Learning Components of Autonomous Systems: Risk Assessment and Mitigation Role: co-PI With Dr. Evgenia Smirni (lead-PI, William & Mary) • George Mason University startup fund, 2022-2025. Teaching CS692 Special Topics: Advanced Computer Architecture, 2025 Spring CS692 Special Topics: Reliability in Computer Systems, 2024 Fall CS692 Special Topics: Advanced Computer Architecture, 2024 Spring CS475 Concurrent & Distributed Systems, 2023 Fall CS695 Special Topics: Advanced Computer Architecture, 2023 Spring CS475 Concurrent & Distributed Systems, 2022 Fall Services Program Committees DSN 2026, Sigmetrics 2026, HPDC 2026, IPDPS2026, PPoPP 2026, EDCC 2026, PPoPP 2025, DSN 2025, Sigmetrics 2025, ICPE 2025, ICDCS 2025, SRDS 2025, EDCC 2025, U-SPACE 2025, SC 2025 SRC, Sigmetrics 2024, DSN 2024, ICPE 2024, CLUSTER 2024, SAC 2024, HiPC 2024, Cluster 2024 Poster Track, CCGrid 2024 Doctoral Symposium and Early Career Track, DSN 2023, SC 2023, IPDPS 2023, HPDC 2023, SRDS 2023, AIPerf 2023, LADC 2023 Student Forum, ESANN 2023 special session Organizing Committees Sigmetrics 2026 (Student Activities Chair), Sigmetrics 2025 (SRC Chair), ICPE 2025 (Industry Chair), DSN 2025 (Artifact Chair), SRDS 2025 (Publicity Chair), Sigmetrics 2024 (SRC Chair), DSN 2024 (Posters Track Chair), HPDC 2024 (Soci",
  "content_length": 14081,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:38"
}