{
  "name": "Lisong Xu",
  "homepage": "http://cse.unl.edu/~xu",
  "status": "success",
  "content": "Lisong Xu's Home Page Professor School of Computing University of Nebraska-Lincoln Office: 108 Schorr Center ZIP: 68588-0150 Phone: (402) 472-1053 Email: Our paper \"Toward Non-Expert Customized Congestion Control\" was accepted to IEEE ICC 2025. Congratulations, Mingrui! Our paper \"Scalable Verification of Multi-ACK Properties in Loss-Based Congestion Control Implementations\" was accepted to IEEE ICNP 2024. Congratulations, Minhi! Our CUBIC TCP specification was published as RFC 9438 by IETF in August 2023. Our paper \"Efficient Verification of Timing-Related Network Functions in High-Speed Hardware\" was accepted to IEEE INFOCOM 2023. Congratulations, Tianqi! Recognized as Excellent Editor of IEEE Transactions on Network Science and Engineering in 2022. Our paper \"Symbolic NS-3 for Efficient Exhaustive Testing: Design, Implementation, and Simulations\" was accepted to Workshop on ns-3 (WNS3) 2022. Congratulations, Jianfei! Our paper \"Auter: Automatically Tuning Multi-layer Network Buffers in Long-Distance Shadowsocks Networks\" was accepted to IEEE INFOCOM 2022. Congratulations, Xu! Recognized as Distinguished TPC Member of IEEE INFOCOM 2021. Our paper \"Efficient protocol testing under temporal uncertain events using discrete-event network simulations\" was accepted to ACM Transactions on Modeling and Computer Simulation 2021. Congratulations, Minh! New NSF grant to redesign and reimplement TCP with not only efficient performance but also verifiable correctness from 2021 to 2025. New NSF grant to efficiently test hardware-based network protocols from 2021 to 2024. Our paper \"QoS-Aware Network Energy Optimization for Danmu Video Streaming in WiFi Networks\" was accepted to IEEE IWQoS 2021. Congratulations, Nan! Our paper \"Model-Agnostic and Efficient Exploration of Numerical Congestion Control State Space of Real-World TCP Implementations\" was accepted to IEEE Transactions on Networking 2021. Congratulations, Wei! Our paper \"TCP BBR in Cloud Networks: Challenges, Analysis, and Solutions\" was accepted to IEEE ICDCS 2021. Congratulations, Phuong! IEEE ICC 2021 in Montreal Canada, June, 2021 Our paper \"QuRate: Power-Efficient Mobile Immersive Video Streaming\" was accepted to ACM Multimedia Systems 2020 and won the \"DASH Excellence Award\" and \"Best Paper Award\"! Congratulations, Nan! New NSF grant to develop a symbolic network simulator for correctness testing of network protocols from 2019 to 2021. Our paper \"A Novel Timestamping Mechanism for Clouds and Its Application on Available Bandwidth Estimation\" was accepted to IEEE ICDCS 2019. Congratulations, Phuong! Our paper \"Model-Agnostic and Efficient Exploration of Numerical State Space of Real-World TCP Congestion Control Implementations\" was accepted to USENIX NSDI 2019. Congratulations, Wei! Our paper \"Efficient systematic testing of network protocols with temporal uncertain events\" was accepted to IEEE INFOCOM 2019. Congratulations, Minh! Received UNL Course Redesign Incentive Grant to modify and make the course materials accessible to students with disabilities in 2018. Our CUBIC TCP was adopted by Microsoft as the default TCP congestion control algorithm for Windows 10 and Windows Server 2019 for \"improved performance on Windows 10 thanks to CUBIC\" and \"a faster and safer Internet\" in 2018. CUBIC has already been adopted by Linux and Apple's macOS/iOS.",
  "content_length": 3359,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:39"
}