{
  "name": "Liting Hu",
  "homepage": "https://people.ucsc.edu/~lhu82",
  "status": "success",
  "content": "Liting Hu Liting Hu I am an Associate Professor of Computer Science and Engineering at University of California Santa Cruz. I lead the Experimental and Virtualized Systems (ELVES) Research Lab. Email: liting at ucsc.edu Mail: Engineering 2, Room 239B 1156 High St Santa Cruz, CA 95064 Full CV Google Scholar DBLP I have multiple openings for Ph.D. students (starting in Fall 2026). If you are interested in building systems, feel free to contact me! News December 2025: I serve as the PC committee at OSDI 2026. Please consider submitting your work. November 2024: I serve as the PC committee at USENIX ATC 2025. Please consider submitting your work. August 2024: I serve as the Program Vice Co-Chair for the Distributed Operating Systems and Middleware track in ICDCS 2025. Please consider submitting your work. July 2024: I serve as the PC committee at SoCC 2024. Please consider submitting your work. September 2023: I serve as the PC committee at USENIX ATC 2024. Please consider submitting your work. September 2023: Our work on federated learning systems got accepted to EuroSys 2024! August 2023: I am thrilled to announce that a Lead PI grant is awarded from NSF CNS to support my research on serverless edge computing systems ($600K). Thank you NSF! January 2023: I serve as the PC committee at ICS 2023. Please consider submitting your work. December 2022: I serve as the PC committee at USENIX ATC 2023. Please consider submitting your work. June 2022: I am thrilled to announce that a Sole PI grant is awarded from NSF OAC to support my research on container orchestration systems ($320K). Thank you NSF! June 2022: I serve as the Finance Chair and the PC committee at SoCC 2022. Please consider submitting your work. April 2022: Our work on ultra-low latency SSDs got accepted to ICS 2022! December 2021: I am grateful to receive the Meta Faculty Research Award as Sole PI. Thank you Meta! December 2021: I serve as the PC committee at VEE 2022 and ICS 2022. Please consider submitting your work. April 2021: Our work on edge stream processing systems got accepted to USENIX ATC 2021! April 2021: My second Ph.D. student Pinchao Liu graduates and joins Meta as a research scientist. Congratulations, Pinchao! December 2020: I am grateful to receive the FIU Faculty Award for Excellence in Fundamental Research. November 2020: I serve as the Program Vice Co-Chair for the Distributed Operating Systems and Middleware track in ICDCS 2021. Please consider submitting your work. September 2020: Our work on failure recovery mechanism for stream processing systems got accepted to ACM/IFIP Middleware 2020. August 2020: My research on stream processing systems is featured on FIU News. June 2020: I am thrilled to announce that I receive the NSF CAREER Award from the Computer Systems Research program in the Division of Computer and Network Systems! Thanks for NSF's tremendous support! April 2020: My first Ph.D. student Hailu Xu graduates and joins California State University Long Beach as a tenure-track assistant professor. Congratulations, Hailu! February 2020: I am grateful to receive the Cyber Florida Collaborative Seed Award as Lead PI. February 2020: I serve as the PC committee at HotEdge 2020. Please consider submitting your work. December 2019: Our work on stateful stream processing systems got accepted to IPDPS 2020. July 2019: I am thrilled to announce that a Lead PI grant is awarded from NSF SPX to support my research on stateful stream processing systems ($550K). Thank you NSF! June 2019: A Co-PI grant is awarded from LYRASIS to support my research on AI ($25K). May 2019: Our work on spam detection systems received the Best Student Paper Award at Cloud 2019. Congratulations, Hailu! January 2019: I serve as the PC committee at USENIX ATC 2019. Please consider submitting your work. October 2018: I serve as the PC committee at IPDPS 2019. Please consider submitting your work. April 2018: We have two research papers accepted to Cloud 2018. August 2017: A Co-PI grant is awarded from DHS ($1200K). Brief Bio Dr. Liting Hu is currently an Associate Professor of Computer Science and Engineering at University of California Santa Cruz. She received her Ph.D. degree in Computer Science from Georgia Institute of Technology in 2016, advised by Professor Karsten Schwan; and her bachelor degree in Computer Science from Huazhong University of Science and Technology in 2007. Prior to joining UCSC, she was an Assistant Professor of Computer Science at Virginia Tech from 2021 to 2022 and an Assistant Professor of Computer Science at Florida International University from 2017 to 2021. During her Ph.D. study, Liting has been fortunate to intern at different research labs and learn from many remarkable researchers. She spent the summer of 2015 at IBM T.J. Watson Research Center working with Shu Tao, Hui Kang and Michael V. Le. She spent the summer of 2013 at Intel Science & Technology Center for Cloud Computing, Carnegie Mellon University working with Michael Kozuch. She spent the summer of 2012 at IBM T.J. Watson Research Center working with Dilma Da Silva and Kyung Ryu. She spent the fall of 2011 at Microsoft Research Asia working with Zhenyu Guo. She spent the summer of 2010 at VMware working with Ajay Gulati. Liting's research interests are in AI-driven experimental computer systems, including stream processing systems, cloud and edge computing, distributed systems, systems virtualization. Her latest interests focus on building next-generation large-scale stream processing systems for the cloud and the edge. Her work has appeared in top systems venues like USENIX ATC, EuroSys, ICS, Middleware, IPDPS, ICDCS, HPDC, ICAC, TPDS, SIGOPS. Her research is gratefully supported by NSF, Department of Homeland Security, as well as a few more industry and university grants. She has received many research awards and scholarships, including an NSF CAREER Award, a Meta Faculty Research Award, and a Cyber Florida Seed Award. Research Interests I lead the Experimental and Virtualized Systems (ELVES) Research Lab, where we conduct AI-Driven Experimental Computer Systems research in Stream Processing Systems, Cloud and Edge Computing, Distributed Systems, and Systems Virtualization. Our work lies at the intersection of AI and Systems, with recent efforts spanning: Stream Processing Systems — High-throughput, low-latency analytics across platforms such as Spark Streaming, Flink, and Storm. (Projects: DART, SR3, FP4S, Governor, ELF, Project Hoover, SpamHunter, Oases) Machine Learning Systems & Systems for ML — From federated learning frameworks to machine learning scheduling and placement. (Projects: Totoro, Max Orientation Coverage, dpSmart, XPlacer) Virtualization & Serverless Infrastructure — Lightweight container-based platforms (Docker, Kubernetes) and VM-centric systems (Xen, KVM) for scalable, elastic computing. (Projects: Capybara, Ekko, Docman, Net-Cohort, Look Who's Talking, Live Migration of VMs) Large-Scale Resource Management & Orchestration — Intelligent control planes for data centers and edge clusters. (Projects: RBay, v-Bundle, Monalytics, Magnet) Selected Awards and Grants 2024 NSF CNS Small Grant (Lead PI) 2022 NSF OAC Grant (Sole PI) 2021 Meta Faculty Research Award (Sole PI) 2021 Outstanding Service Award of IEEE ACSOS 2020 NSF CAREER Award (Sole PI) 2020 FIU Faculty Award for Excellence in Fundamental Research 2020 Cyber Florida Collaborative Seed Award (Lead PI) 2019 NSF SPX Grant (Lead PI) Publications Students advised by me are identified by \"*\" 1. Conference Papers [Middleware'25] Xin Chen*, Manoj Prabhakar Paidiparthy*, Chen Qian, Liting Hu, \" Capybara: an Edge-Friendly Distributed Object Store for Diverse Serverless Functions\", in Proceedings of the 26th ACM/IFIP International Middleware Conference (Middleware'25), Nashville, TN, December 2025. [ICNP'25] Shengze Wang, Yi Liu, Xiaoxue Zhang, Liting Hu, and Chen Qian, \" A Distributed Learned Hash Table”, in Proceedings of the 33rd International Conference on Network Protocols (ICNP'25), Seoul, South Korea, September 2025. [IPDPS'25] Xin Chen*, Manoj Prabhakar Paidiparthy*, Dilma Da Silva, Liting Hu, \" Ekko: Fully Decentralized Scheduling for Serverless Edge Computing\", in Proceedings of the 39th IEEE International Parallel & Distributed Processing Symposium (IPDPS'25), Milan, Italy, June 2025. [EuroSys'24] Cheng-Wei Ching*, Xin Chen*, Taehwan Kim*, Bo Ji, Qingyang Wang, Dilma Da Silva, Liting Hu, \" Totoro: A Scalable Federated Learning Engine for the Edge\", in Proceedings of the 19th ACM SIGOPS European Conference on Computer Systems (EuroSys'24), Athens, Greece, April 2024. Acceptance Rate: 39/244 = 16.0%. [Middleware'23] Jianshu Liu, Qingyang Wang, Shungeng Zhang, Liting Hu, Dilma Da Silva, \" Sora: A Latency Sensitive Approach for Microservice Soft Resource Adaption\", in Proceedings of the 24th ACM/IFIP International Middleware Conference (Middleware'23), Bologna, Italy, December 2023. Best Paper Award [ICS'22] Mingzhe Liu, Haikun Liu, Chencheng Ye, Xiaofei Liao, Hai Jin, Yu Zhang, Ran Zheng, Liting Hu, \" Towards Low-Latency I/O Services for Mixed Workloads Using Ultra-Low Latency SSDs\", in Proceedings of the 36th ACM International Conference on Supercomputing (ICS'22), virtual event, June 2022. [USENIX ATC'21] Pinchao Liu*, Dilma Da Silva, Liting Hu, \" DART: A Scalable and Adaptive Edge Stream Processing Engine\", in Proceedings of the 2021 USENIX Annual Technical Conference (USENIX ATC'21), virtual event, July 2021. Acceptance Rate: 64/341 = 18.8%. [Middleware'20] Hailu Xu*, Pinchao Liu*, Susana Cruz-Diaz*, Dilma Da Silva, Liting Hu, \" SR3: Customizable Recovery for Stateful Stream Processing Systems\", in Proceedings of ACM/IFIP Middleware 2020 (Middleware'20), virtual event, December 2020. [IROS'20] Xin Chen, Thomas M. Tucker, Thomas R. Kurfess, Richard W. Vuduc, Liting Hu, \" Max Orientation Coverage: Efficient Path Planning to Avoid Collisions in the CNC Milling of 3D Objects\", in 2020 IEEE/RSJ Int",
  "content_length": 24800,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:40"
}