{
  "name": "Liu Liu 0017",
  "homepage": "https://liuliu-cs.github.io",
  "status": "success",
  "content": "Liu Liu Dr. Liu Liu is an Assistant Professor in the Department of Electrical, Computer, and Systems Engineering and the Department of Computer Science at Rensselaer Polytechnic Institute (RPI). He holds a Ph.D. in Computer Science and an M.S. in Electrical and Computer Engineering from the University of California, Santa Barbara. Dr. Liu directs the Efficient, Parallel, and Intelligent Computing (EPIC) Lab at RPI, focusing the research on Elastic AI Computing systems and architecture design. His doctoral dissertation was supervised by Dr. Yuan Xie (now a Chair Professor at HKUST) and Dr. Yufei Ding (now an Associate Professor at UCSD). He holds a Bachelor’s degree from the University of Electronic Science and Technology of China (UESTC). He is a recipient of NSF CAREER Award, Samsung Global Research Outreach Award, and Peter J Frenkel Fellowship from the Institute of Energy Efficiency at UCSB. news Jun 2025 Our SAGE paper appears in ICCAD 2025. Apr 2025 Serve in the TPC of ICS 2025 and MICRO 2025. Mar 2025 Our BitWeaver paper appears in ICS 2025. Jan 2025 NSF CAREER Award Nov 2024 Our NORA paper appears in DATE 2025. selected publications TC Dynamic sparse attention for scalable transformer acceleration Liu Liu, Zheng Qu, Zhaodong Chen, and 3 more authors IEEE Transactions on Computers, 2022 ASPLOS DOTA: detect and omit weak attentions for scalable transformer acceleration Zheng Qu, Liu Liu, Fengbin Tu, and 3 more authors In Proceedings of the 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, 2022 MICRO ENMC: Extreme near-memory classification via approximate screening Liu Liu, Jilan Lin, Zheng Qu, and 2 more authors In 54th Annual IEEE/ACM International Symposium on Microarchitecture, 2021 MICRO DUET: Boosting deep neural network efficiency on dual-module architecture Liu Liu, Zheng Qu, Lei Deng, and 6 more authors In 53rd Annual IEEE/ACM International Symposium on Microarchitecture, 2020 ICLR Dynamic Sparse Graph for Efficient Deep Learning Liu Liu, Lei Deng, Xing Hu, and 4 more authors In International Conference on Learning Representations, 2019",
  "content_length": 2144,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:39"
}