{
  "name": "Liujuan Cao",
  "homepage": "https://mac.xmu.edu.cn/ljcao",
  "status": "success",
  "content": "ï»¿ æ¹åå¨ @ å¦é¨å¤§å­¦ å¦é¨å¤§å­¦äººå·¥æºè½ç ç©¶é¢ æ¹åå¨ å¦é¨å¤§å­¦ä¿¡æ¯å­¦é¢å¯é¢é¿ãææãåå£«çå¯¼å¸ ç¦å»ºçå¯ä¿¡äººå·¥æºè½åæä¸åºç¨å·¥ç¨ç ç©¶ä¸­å¿ä¸»ä»» åªä½åæä¸è®¡ç®å®éªå®¤ å°åï¼å¦é¨å¤§å­¦ç¿å®åºè¥¿é¨çåº5å·æ¥¼303 é®ç¼ï¼361100 çµå­é®ä»¶ï¼caoliujuan@xmu.edu.cn é¦é¡µ | å­¦æ¯è·å¥ | ç§ç é¡¹ç® | å­¦æ¯è®ºæ | å®éªå®¤ ä¸ªäººä¿¡æ¯ å¦é¨å¤§å­¦ä¿¡æ¯å­¦é¢å¯é¢é¿ï¼ç¦å»ºçå¯ä¿¡äººå·¥æºè½åæä¸åºç¨å·¥ç¨ç ç©¶ä¸­å¿ä¸»ä»»ï¼ææï¼åå£«çå¯¼å¸ãå ¥éå½å®¶éç¹éå¹´äººæé¡¹ç®ï¼ç¦å»ºçæ°éï¼AIåäººå¥³æ§éå¹´å­¦è ãé¿æä»äºè®¡ç®æºè§è§ãç®æ æ£æµç­äººå·¥æºè½é¢ååæ²¿ææ¯ç ç©¶ï¼ä»¥ä¸ä½/éè®¯å¨TPAMIï¼IJCVï¼CVPRï¼ICCVç­å½é é¡¶çº§æåä¼è®®ä¸åè¡¨è®ºæ60ä½ç¯ï¼ä¸»æå½å®¶èªç¶ç§å­¦åºéèååºééç¹é¡¹ç®ãæå§ãåä¸º/è ¾è®¯/ç¾åº¦ç­å¤´é¨ä¼ä¸é¡¹ç®å¤é¡¹ï¼ä»¥ç¬¬ä¸å®æäººè·2020å¹´åº¦ç¦å»ºçç§æè¿æ­¥ä¸ç­å¥ï¼2023å¹´åº¦å¦é¨å¸ç§æè¿æ­¥ä¸ç­å¥ï¼2023å¹´CSIGç³éäºå¥³ç§å­¦å®¶å¥ï¼ç¬¬äºåå «å±è¿çéå¹´ç§æå¥ï¼å¦é¨å¤§å­¦ä¸å «çº¢ææç­è£èªã ç ç©¶æ¹å ç»æè®¾è®¡ æ ·æ¬è®­ç» æ¨¡åé¨ç½² ä»£è¡¨è®ºæ J. Hu, L. Cao (éè®¯ä½è ), X. Jin, S. Zhang, R. Ji. Universal Image Segmentation with Efficiency. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025, JCR-1åºZ.Chen,  L. Cao(éè®¯ä½è ), S. Zhangï¼R. Ji, Y.Shen. CLIP-Driven Transformer for Weakly Supervised Object Localization. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025, JCR-1åºB. Chen, M. Lin, R. Ji, L. Cao (éè®¯ä½è ). Prioritized Subnet Sampling for Resource-Adaptive Supernet Training. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2023, JCR-1åºL. Huang, H. Wang, J. Zeng, S. Zhang, L. Cao(éè®¯ä½è ), J. Yan, H. Li.  Geometric-aware Pretraining for Vision-centric 3D Object Detection.  International Journal of Computer Vision (IJCV), 2025, JCR-1åºM. Lin, M. Chen, Y. Zhang, C. Shen, R. Ji, L. Cao (éè®¯ä½è ).  Super Vision Transformer. International Journal of Computer Vision (IJCV), 2023, JCR-1åºJ. Hu, Y. Lu, S. Zhang, L. Cao (éè®¯ä½è ). ISTR: Mask-Embedding-Based Instance Segmentation Transformer. IEEE Transactions on Image Processing (TIP), 2024, JCR-1åºæ¹åå¨, å¡åå³°, åå¼, çè¨, å¼ å®æ, é»é£è·, å´æ°¸å, çºªè£åµ. ãåæ ç­¾çç£çå ä½çº¦æå¯¹æè®­ç»ã. è½¯ä»¶å­¦æ¥, 2022Z. Chen, S. Wang, L. Cao (éè®¯ä½è ), Y. Shen, R. Ji. Adaptive Zone Learning for Weakly Supervised Object Localization. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2024, JCR-1åºM. Lin, L. Cao(éè®¯ä½è ), S. Li, Q. Ye, Y. Tian, J. Liu, Q. Tian, R. Ji. Filter sketch for network pruning. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2021, JCR-1åºY. Qu,  D. Chen, X. Li, X. Li, S. Zhang, L. Cao(éè®¯ä½è ), R. ji. Drag Your Gaussian: Effective Drag-Based Editing with Score Distillation for 3D Gaussian Splatting. Special Interest Group for Computer GRAPHICS(SIGGRAPH), 2025, CCF-Aç±»Y. Huang, Z. Lan, L. Cao(éè®¯ä½è ), X. Lin, S. Zhang, G. Jiang, R. Ji. FocSAM: Delving Deeply into Focused Objects in Segmenting Anything. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, CCF-Aç±»X. Fei, X. Zheng, Y. Wang, F. Chao, C. Wu, L. Cao(éè®¯ä½è ). RepAn: Enhanced Annealing through Re-parameterization. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, CCF-Aç±»J. Xie, Y. Zhang, M. Lin, Z. Lin, L. Cao(éè®¯ä½è ), R. Ji. UniPTS: A Unified Framework for Proficient Post-Training Sparsity. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, CCF-Aç±»J. Hu, L. Huang, T. Ren, S. Zhang, L. Cao(éè®¯ä½è ), R. Ji. You Only Segment Once: Towards Real-Time Panoptic Segmentation. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2023, CCF-Aç±»Z. Chen, J. Ding, L. Cao(éè®¯ä½è ), Y. Shen, S. Zhang, G. Jiang, R. Ji. Category-aware Allocation Transformer for Weakly Supervised Object Localization. IEEE International Conference on Computer Vision (ICCV), 2023, CCF-Aç±»J. Hu, C. Chen, L. Cao(éè®¯ä½è ), S. Zhang, A. Shu, G. Jiang, R. Ji. Pseudo-label Alignment for Semi-supervised Instance Segmentation. IEEE International Conference on Computer Vision (ICCV), 2023, CCF-Aç±»M. Peng, J. Lin, Y. Zhou, Y. Shen, G. Luo, X. Sun, L. Cao(éè®¯ä½è ), R. Fu, Q. Xu, R. Ji. Active teacher for semi-supervised object detection. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2022, CCF-Aç±»Z. Chen, C. Wang, Y. Wang, G. Jiang, Y. Shen, Y. Tai, C. Wang, W. Zhang, L. Cao(éè®¯ä½è ). LCTR: On awakening the local continuity of transformer for weakly supervised object localization. Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2022, CCF-Aç±»C. Zhu, Y. Zhou, Y. Shen, G. Luo, X. Pan, M. Lin, C. Chen, L. Cao(éè®¯ä½è ), X. Sun, R. Ji. SeqTR: A simple yet universal network for visual grounding. European Conference on Computer Vision (ECCV), 2022, CCF-Bç±»B. Chen, M. Lin, K. Sheng, M. Zhang, P. Chen, K. Li, L. Cao(éè®¯ä½è ), R. Ji. ARM: Any-time super-resolution method. European Conference on Computer Vision (ECCV), 2022, CCF-Bç±»Y. Shen, L. Cao(éè®¯ä½è ), Z. Chen, F. Lian, B. Zhang, C. Su, Y. Wu, F. Huang, R. Ji. Toward joint thing-and-stuff mining for weakly supervised panoptic segmentation. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2021, CCF-Aç±»J. Hu, L. Cao(éè®¯ä½è ), T. Tong, Q. Ye, S. Zhang, K. Li, F. Huang, L. Shao, R. Ji. Architecture disentanglement for deep neural networks. IEEE International Conference on Computer Vision (ICCV), 2021, CCF-Aç±»Y. Shen, L. Cao(éè®¯ä½è ), Z. Chen, B. Zhang, C. Su, Y. Wu, F. Huang, R. Ji. Parallel detection-and-segmentation learning for weakly supervised instance segmentation. IEEE International Conference on Computer Vision (ICCV), 2021, CCF-Aç±»H. Chen, Y. Luo, L. Cao(éè®¯ä½è ), B. Zhang, G. Guo, C. Wang, J. Li, R. Ji. Generalized Zero-Shot Vehicle Detection in Remote Sensing Imagery via Coarse-to-Fine Framework. International Joint Conference on Artificial Intelligence(IJCAI), 2019, CCF-Aç±» ç§ç é¡¹ç® ä¸­å ±ä¸­å¤®ç»ç»é¨, å½å®¶ç¹æ¯è®¡åéå¹´æå°äººæ, ç¬¬ä¸æ¹å½å®¶ç¹æ¯è®¡å, å¤æè¾¹ç¼åºæ¯ä¸çå¯è§£éå¼±å°ç®æ æ£æµä¸è·è¸ªï¼2022è³ 2025ï¼å¨ç ï¼ä¸»æã ç¦å»ºçæ°éé¡¹ç®, å¤æè¾¹ç¼åºæ¯ä¸å¼±å°ç®æ æ£æµä¸è·è¸ª, 2022è³ 2025, å¨ç , ä¸»æã ç¦å»ºçç§æå ï¼ç¦å»ºçç§æè®¡åå ¶ä»é¡¹ç®ï¼ç¦å¦æ³å½å®¶èªä¸»åæ°ç¤ºèåºåååæ°å¹³å°é¡¹ç®ï¼2025è³2026ï¼1000ä¸å , å¨ç ï¼ä¸»æã å½å®¶èªç¶ç§å­¦åºéå§åä¼ï¼èååºééç¹é¡¹ç®ï¼é¢åè¾¹ç¼é¨ç½²çå¼±å éªå°ç®æ è§è§æ£æµä¸è·è¸ªï¼2022è³2025ï¼255ä¸å ï¼å¨ç ï¼ä¸»æã å½å®¶èªç¶ç§å­¦åºéå§åä¼ï¼é¢ä¸é¡¹ç®ï¼åºäºå¼±çç£å­¦ä¹ çæºè½½å°/æµ·å°ç®æ æ£æµç ç©¶ï¼2021è³2024ï¼ç»é¢ï¼ä¸»æã åä¸ºææ¯æéå ¬å¸ï¼æ ¡ä¼åä½ï¼å¤æ¨¡æå¤§æ¨¡åéåææ¯åä½é¡¹ç®ï¼2024è³2025,å¨ç , ä¸»æã æå¾·ï¼ä¸­å½ï¼åè½¦æéå ¬å¸ï¼æ ¡ä¼åä½ï¼äººå·¥æºè½å¨æºè½åè½¦çç ç©¶ä¸å¼åï¼2024è³2025ï¼å¨ç ï¼ä¸»æã è ¾è®¯ç§æï¼ä¸æµ·ï¼æéå ¬å¸, æ ¡ä¼åä½, å¤åªä½ææ¯ç åå§æåè®®, 2021è³2022,ç»é¢, ä¸»æã å¦é¨ç¾å¾ä¹å®¶ç§ææéå ¬å¸, æ ¡ä¼åä½, çæç±»ç®æ³æ¸ æ°åº¦ä¼åç ç©¶, 2021è³ 2022,ç»é¢, ä¸»æã ç¾åº¦å¨çº¿ç½ç»ææ¯ï¼åäº¬ï¼æéå ¬å¸, æ ¡ä¼åä½, AutoDLä¸æ¨¡ååç¼©ææ¯, 2021è³ 2022, ç»é¢, ä¸»æã åä¸ºææ¯æéå ¬å¸ï¼æ ¡ä¼åä½ï¼åºäºè§é¢çäººè¸è¯å«ææ¯ï¼2019è³2020,ç»é¢, ä¸»æã åä¸ºææ¯æéå ¬å¸ï¼æ ¡ä¼åä½ï¼2Då¯¹è±¡è¯å«ä¸è·è¸ªææ¯ï¼2018è³2019,ç»é¢, ä¸»æã åä¸ºææ¯æéå ¬å¸ï¼æ ¡ä¼åä½ï¼åºäºæºè½åæçè§é¢å®¡æ ¸ææ¯åä½é¡¹ç®ï¼2017è³2018,ç»é¢, ä¸»æã",
  "content_length": 8028,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:39"
}