{
  "name": "Lixia Zhang 0001",
  "homepage": "http://www.cs.ucla.edu/~lixia",
  "status": "success",
  "content": "Lixia Zhang Lixia Zhang HOME PUBLICATIONS LAB TEACHING FAQ BIO AWARDS ABOUT ME I jumped into Internet research in fall 1981 when I started my PhD study at MIT, the same month that the TCP/IP specifications were published. During my eight years of graduate school, my adviser Dr. David Clark taught me how to think architecturally. After graduation I joined Xerox Palo Alto Research Center (Xerox PARC) and spent seven exciting years there (during this time the Internet went from an obscure research to its initial rollout in a global scale), before being recruited to UCLA computer science department. My original plan was to move onto something new once I got a taste of teaching, but that did not happen — it is simply too much fun working with brilliant students and inventing the future together. My mission is to help the Internet grow. See my bio for more details. WHAT'S NEW April 2025 NDN Community Meeting 2025 (NDNComm25) was hosted at UCLA April 17-18, 2025. Here is the NDNComm25 home page, with pointers to the 2-day program and presentation slides/ recordings. June 2024 This time eight years ago, Rik Farrow of ;Login wrote this report NETWORKING: Interview with Lixia Zhang and KC Claffy. It seems still highly relevant today. More → ONGOING RESEARCH PROJECT Named Data Networking How time flies, especially when one is having fun -- at 2020 NDN Community Meeting we celebrated the 10th anniversary of the NDN project which started on September 1, 2010! NDN is going ever stronger with time. We are busy developing more applications over NDN to force out architectural details to be filled in and, most importantly, verifies and shapes the architectural direction. Here is a partial collection of old papers, showing cumulations of understanding on networking over the years. Here is a partial collection of recent papers, showing the progress of the NDN development. MY RESEARCH INTERESTS Internet Architecture Design: How many necessary pieces should be in it, and how do we know we got them right? Network Protocol Designs: Let's start collecting a set of principles from past successes and lessons. Here is one of my favorite Feynman quotes. Find my publications from Google Scholar My blogs (just starting) Follow me on Twitter (Iâm not a very active tweeter )",
  "content_length": 2284,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:42"
}