{
  "name": "Liyao Xiang",
  "homepage": "http://xiangliyao.cn",
  "status": "success",
  "content": "Liyao Xiang Liyao Xiang Associate Professor John Hopcroft Center for Computer Science Shanghai Jiao Tong University Contact No. 1 Software Building (软件楼) Room 1408-2, Shanghai Jiao Tong University, 800 Dongchuan Rd., Shanghai xiangliyao08 [at] sjtu [dot] edu [dot] cn http://xiangliyao.cn Google Scholar About Me I am an Associate Professor (tenured) at John Hopcroft Center for Computer Science of Shanghai Jiao Tong University. I am also a faculty member of Intelligent Internet of Things (IIOT) Research Center. I obtained my Ph.D. and master's degrees in Department of Electrical and Computer Engineering at University of Toronto, respectively in 2018 and 2015. My advisor is Prof. Baochun Li. I received the B.S. degree from the Department of Electronic Engineering at Shanghai Jiao Tong University in 2012. My current research interests cover the intersected areas of security, privacy, machine learning, and mobile computing. Topics include data privacy, security and privacy in data mining and machine learning, intelligent edge computing, etc. Particularly, I am interested in identifying fundamental security and privacy threats in machine learning systems, and designing practical countermeasures. Prospective Students I am always looking for self-motivated students who are interested in pursuing a master's or Ph.D. degrees in the broad areas of machine learning, security, privacy, and mobile computing. Please send me an email if you are interested. Students and Alumni I am greatful to the wonderful students I have been collaborating with. It is an honor and great joy working with you😀 Ph.D. Students: Shiming Wang, Wei Li, Fupei Chen, Yutong Wu Master Students: Borui Yang, Hangyu Ye Ph.D. Alumni: Hui Xu (Alogrithm Engineer at Baidu, co-supervised), Jungang Yang (Assistant Professor at Shanghai University), Haohua Duan (TBD) Master Alumni: Shuang Zhang (Baidu), Weiting Li (Pinduoduo), Xi Yu (China Telecom), Zhe Ji (Ant Group) Undergraduate Alumni: Lingdong Wang (Ph.D. student at UMass), Shufan Wang (graduated from EPFL), Guoqing Xin (TPLink at Shenzhen), Jiayu Xu, Jiaju Chen (Huawei at Shenzhen), Ningyi Liao (Ph.D. student at NTU), Jiahao Yu (Ph.D. student at Penn. State University), Dixi Yao (Ph.D. student at the University of Toronto, supervised by Prof. Baochun Li), Qiansiqi Hu (Master student at the Chinese University of Hong Kong), Hengyuan Xu (Master student at Fudan University), Kaiyuan Shi (Master student at Shanghai Jiao Tong University), Zedong Peng (Master student at Shanghai Jiao Tong University), Yicheng Zheng (Master student at Shanghai Jiao Tong University) Teaching Spring 2021, 2023-2025: EE359 or AI3602 Data Mining Spring 2019, 2020: EE226 Big Data Mining Fall 2019-2024: CS149 or CS0501 Data Structure and Algorithms Journal Articles and Conference Proceedings Papers are organized by categories. # represents for co-first authors. * stands for corresponding author(s). Watermarking for AI [TDSC’ 25] Wei Li; Borui Yang; Yujie Sun; Suyu Chen; Yuting Chen; Liyao Xiang*; ‘‘Contextual and Natural Watermarking for Tracing Code Snippet Provenance,\" in IEEE Transactions on Dependable and Secure Computing (TDSC), Digital Object Identifier: 10.1109/TDSC.2025.3594599, 2025. (CCF-A) [ACM MM’ 24] Zhe Ji; Qiansiqi Hu; Yicheng Zheng; Liyao Xiang*; Xinbing Wang; ‘‘A Principled Approach to Natural Language Watermarking,\" in the ACM Multimedia (ACM MM), Melbourne, Australia, Oct. 28 - Nov. 1, 2024. (CCF-A) [IEEE S&P’ 24] Borui Yang; Wei Li; Liyao Xiang*; Bo Li; ‘‘SrcMarker: Dual-Channel Source Code Watermarking via Scalable Code Transformations,\" in the IEEE Symposium on Security and Privacy (IEEE S&P), San Francisco, US, May 20-23, 2024. (CCF-A, acceptance rate: 14.9%) Privacy for AI [CCS’ 24] Shiming Wang; Liyao Xiang*; Bowei Cheng; Zhe Ji; Tianran Sun; Xinbing Wang; ‘‘Curator Attack: When Blackbox Differential Privacy Auditing Loses Its Power,\" in the ACM Conference on Computer and Communications Security (CCS), Salt Lake City, U.S.A., Oct. 14-18, 2024. (CCF-A) [CVPR ’24] Hengyuan Xu; Liyao Xiang*; Hangyu Ye; Dixi Yao; Pengzhi Chu; Baochun Li; ‘‘Permutation Equivariance of Transformers and Its Applications,\" in Proceedings of the IEEE/CVF Computer Vision and Pattern Recognition Conference (CVPR), Seattle, USA, June 17-21, 2024. (CCF-A) [NDSS’24] Shiming Wang; Zhe Ji; Liyao Xiang*; Hao Zhang; Xinbing Wang; Chenghu Zhou; Bo Li; ‘‘Crafter: Facial Feature Crafting against Inversion-based Identity Theft on Deep Models,\" in Network and Distributed System Security (NDSS) Symposium, San Diego, USA, Feb.26-Mar.1, 2024. (CCF-A) [TMC’23] Liyao Xiang#*; Shuang Zhang#; Quanshi Zhang; ‘‘Learning to Prevent Input Leakages in the Mobile Cloud Inference,\" in IEEE Transactions on Mobile Computing (TMC), page(s): 1-14, Print ISSN: 1536-1233, Digital Object Identifier: 10.1109/TMC.2023.3340338, 2023. (CCF-A) [ESORICS’23] Xi Yu; Liyao Xiang*; Shiming Wang; Chengnian Long; ‘‘Privacy-Preserving Split Learning via Pareto Optimal Search,\" in the 28th European Symposium on Research in Computer Security (ESORICS), The Hague, The Netherlands, Sept.25-29, 2023. (CCF-B) [INFOCOM’23] Zhe Ji; Qiansiqi Hu; Liyao Xiang*; Chenghu Zhou; ‘‘Mixup Training for Generative Models to Defend Membership Inference Attacks,\" in Proc. IEEE International Conference on Computer Communications (INFOCOM), New York area, USA, May 17-20, 2023. Slides (CCF-A) [TIFS’22] Weiting Li; Liyao Xiang*; Bin Guo; Zhetao Li; Xinbing Wang; ‘‘DPlanner: A Privacy Budgeting System for Utility,\" in IEEE Transactions on Information Forensics & Security (TIFS), Digital Object Identifier: 10.1109/TIFS.2022.3231786, 2022. (CCF-A) [ICDM’22] Dixi Yao; Liyao Xiang*; Hengyuan Xu; Hangyu Ye; Yingqi Chen;‘‘Privacy-Preserving Split Learning via Patch Shuffling over Transformers,\" in Proc. 22nd IEEE International Conference on Data Mining (ICDM), Orlando, USA, Nov.28-Dec.1, 2022. (CCF-B) [TMC’21] Liyao Xiang*;Weiting Li; Jungang Yang; Xinbing Wang; Baochun Li; ‘‘Differentially-Private Deep Learning with Directional Noise,\" in IEEE Transactions on Mobile Computing (TMC), 2021. (CCF-A) [TMC’21] Jungang Yang#; Liyao Xiang#*; Jiahao Yu; Xinbing Wang; Bin Guo; Zhetao Li; Baochun Li; ‘‘Matrix Gaussian Mechanisms for Differentially-Private Learning,\" in IEEE Transactions on Mobile Computing (TMC), Digital Object Identifier: 10.1109/TMC.2021.3093316, 2021. (CCF-A) [TIFS’21] Jungang Yang#; Liyao Xiang#*; Ruidong Chen; Weiting Li; Baochun Li; ‘‘Differential Privacy for Tensor-Valued Queries,\" in IEEE Transactions on Information Forensics & Security (TIFS), Digital Object Identifier: 10.1109/TIFS.2021.3089884, 2021. (CCF-A) [INFOCOM’21] Weiting Li; Liyao Xiang*; Zhou Zhou; Feng Peng; ‘‘Privacy Budgeting for Growing Machine Learning Datasets,\" in Proc. IEEE International Conference on Computer Communications (INFOCOM), Virtual, May 10-13, 2021. (CCF-A) [ICDCS’20] Liyao Xiang*; Lingdong Wang; Shufan Wang; Baochun Li; ‘‘Achieving Consensus in Privacy-Preserving Decentralized Learning,\" in Proc. IEEE International Conference on Distributed Computing Systems (ICDCS), Singapore, July 8 - 10, 2020. (CCF-B) [ICLR’20] Liyao Xiang; Hao Zhang; Haotian Ma; Yifan Zhang; Jie Ren; Quanshi Zhang*; ‘‘Interpretable Complex-Valued Neural Networks for Privacy Protection,\" in Proc. International Conference on Learning Representations (ICLR), Addis Ababa, Ethiopia, April 26-30, 2020.(清华A类) [INFOCOM’19] Liyao Xiang*; Jingbo Yang; Baochun Li; ‘‘Differentially-Private Deep Learning from an Optimization Perspective,\" in Proc. IEEE International Conference on Computer Communications (INFOCOM), Paris, France, April 29-May 2, 2019. Slides (CCF-A) Trustworthy and Robust Learning [TDSC’24] Haohua Duan; Zedong Peng; Liyao Xiang*; Yuncong Hu; Bo Li; ‘‘A Verifiable and Privacy-Preserving Federated Learning Training Framework,\" in IEEE Transactions on Dependable and Secure Computing (TDSC), Digital Object Identifier: 10.1109/TDSC.2024.3369658, 2024. (CCF-A) [TIFS’23] Haohua Duan; Liyao Xiang*; Xinbing Wang; Pengzhi Chu; Chenghu Zhou; ‘‘A New Zero Knowledge Argument for General Circuits and Its Application,\" in IEEE Transactions on Information Forensics & Security (TIFS), Vol.18, Page(s)3906-3920, Digital Object Identifier: 10.1109/TIFS.2023.3288454, 2023. (CCF-A) [TDSC’23] Jungang Yang; Liyao Xiang*; Pengzhi Chu; Xinbing Wang; Chenghu Zhou; ‘‘Certified Distributional Robustness on Smoothed Classifiers,\" in IEEE Transactions on Dependable and Secure Computing (TDSC), Page(s)1-12, Digital Object Identifier: 10.1109/TDSC.2023.3264850, 2023. (CCF-A) [MLJ’21] Ningyi Liao#; Shufan Wang#; Liyao Xiang*; Nanyang Ye; Shuo Shao; Pengzhi Chu; ‘‘Achieving Adversarial Robustness via Sparsity,\" in Machine Learning, Digital Object Identifier: 10.1007/s10994-021-06049-9, 2021. (CCF-B) Graph Learning [NeurIPS’ 24] Hang Yin; Liyao Xiang∗; Dong Ding; Yuheng He; Yihan Wu; Pengzhi Chu; Xinbing Wang; Chenghu Zhou; ‘‘LAMBDA: Learning Matchable Prior For Entity Alignment with Unlabeled Dangling Cases,\" in the 38th Conference on Neural Information Processing Systems (NeurIPS), Vancouver, Dec. 10-15, 2024. (CCF-A) [KDD’23] Hui Xu; Liyao Xiang*; Femke Huang; Yuting Weng; Ruijie Xu; Xinbing Wang; Chenghu Zhou; ‘‘Grace: Graph Self-Distillation and Completion to Mitigate Degree-Related Biases,\" in the 29th SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), Long Beach, CA, US, Aug. 6-10, 2023. Slides (CCF-A) [TKDD’23] Hui Xu; Liyao Xiang*; Xiaoying Gan; Luoyi Fu; Xinbing Wang; Chenghu Zhou; ‘‘Distributional Learning for Network Alignment with Global Constraints,\" in ACM Transactions on Knowledge Discovery in Data (TKDD), Digital Object Identifier: 10.1145/3638056, 2023. (CCF-B) [TKDD’23] Hui Xu; Liyao Xiang*; Junjie Ou; Yuting Weng; Xinbing Wang; Chenghu Zhou; ‘‘Open-World Graph Active Learning for Node Classification,\" in ACM Transactions on Knowledge Discovery in Data (TKDD), Vol.18, No.2, Page(s)1-20, Digital Object Identifier: 10.1145/3607144, 2023. (CCF-B) [C",
  "content_length": 14140,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:41"
}