{
  "name": "Liyan Xie",
  "homepage": "https://mypage.cuhk.edu.cn/academics/xieliyan",
  "status": "success",
  "content": "Liyan Xie Home Biography Publications Awards Teaching Liyan Xie Liyan Xie Assistant Professor School of Data Science (SDS) The Chinese University of Hong Kong, Shenzhen (CUHK-SZ) Google Scholar CV Contact E-Mail: xieliyan@cuhk.edu.cn Address: Office 420D, Daoyuan Building, CUHK-Shenzhen Research My research interest lies in the interface of statistics and optimization inspired by important applications (sensor networks, healthcare, and industrial quality control), with a particular interest in sequential change-point detection, distributionally robust hypothesis testing, and spatio-temporal modeling. Recent News October 2023, I will give a presentation on Robust Change Detection at INFORMS Annual Meeting, Session SB31, Statistical Methods for Operations, October 15, 10:45 AM - 12:00 PM (third speaker). December 2023, I am organizing a session on ‘‘Recent advances in sequential detection’’ at CMStatistics 2023, more information to be updated soon. September 2023, Invited talk at Allerton Conference, UIUC. August 2023, Invited Plenary talk at IJCAI 2023 Workshop Bridge-AI: from Climate Change to Health Equity. July 2023, Talk at Joint Conference on Statistics and Data Science in China. June 2023, Invited Talk at 10th International Workshop on Applied Probability (IWAP), Greece. May 2023, one conference paper Improving Adversarial Robustness by Contrastive Guided Diffusion Process and one workshop paper MissDiff: Training Diffusion Models on Tabular Data with Missing Values accepted to ICML 2023. Congrats Yidong! Spring 2023, I am teaching a new undergraduate course, Mathematical Statistics, and a new graduate course, Advanced Statistics Theory, at CUHK-Shenzhen. November 2022, Invited talk at Department of Statistics and Data Science, Cornell University. October 2022, Invited Talk at SINE seminar series, Coordinated Science Laboratory, UIUC. Page generated 2023-09-26 23:01:54 CDT, by jemdoc+MathJax.",
  "content_length": 1930,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:40"
}