{
  "name": "Liyue Fan",
  "homepage": "https://webpages.charlotte.edu/lfan4/index.html",
  "status": "success",
  "content": "Liyue Fan's Homepage Liyue Fan Assistant Professor Dr. Liyue Fan is an Assistant Professor in Computer Science in the College of Computing and Informatics at the University of North Carolina at Charlotte. Her research is at the intersection of data privacy and databases. She was named one of the \"Rising Stars in EECS\" by MIT in 2015. Prior to joining UNC Charlotte, Dr. Fan was an Assistant Professor in Information Technology Management at University at Albany. She spent two years as a postdoc research associate in the Integrated Media System Center at University of Southern California, under the supervision of Prof. Cyrus Shahabi. She received a Ph.D. in Computer Science & Informatics from Emory University (with Prof. Li Xiong) and a B.S.in Mathematics from Zhejiang University (a Chu Kochen ACEE alumna). Dr. Fan serves the professional community as a PC member for SIGMOD, KDD, ICDM, AAAI, SIGSPATIAL, etc., and as a reviewer for many high impact journals, such as TKDE, TIST, TIFS, TMC, DAPD, and Computer & Security. Research themes: Dr Fan's research has three pursuits: (1) quantifying the unintended information leakage in novel data sharing applications, (2) developing rigorous privacy-enhancing methods for data sharing and analysis, e.g., by building on the differential privacy model, (3) maximizing the utility of privacy-enhancing methods in practical settings, such as in healthcare and geospatial applications. I am grateful for the support of: National Science Foundation for a CAREER award in 2022 National Science Foundation for the DeepDetect project in 2021 CCI for the Innovation Award in 2020 UNC Charlotte for a Faculty Research Grant in 2020 National Science Foundation for an EAGER award in 2019 National Science Foundation for a CRII award in 2018 University at Albany for a FRAP-A Faculty Research Award in 2017 Prospective students: see information here. News [June 2024] Our paper on generative models in medical imaging won Best Poster Award at ICHI 2024. Congrats to Ashley and Luca! [May 2024] I will co-chair the Student Research Competition (SRC) at SIGSPATIAL 2024. Participants welcome! [Apr 2024] Dr. Fan received the inaugural \"Outstanding data science junior faculty research award\". [Apr 2024] Ashley presented her research poster at the Undergraduate Research Conference. Congratulations and have a great summer! [Mar 2024] Dr. Fan was featured in \"Heavy Lifters: Women researchers who manage, interpret and apply big data\". [Oct 2023] Our paper on distributed privacy for survival analysis was accepted by BigData 2023. [Aug 2023] Our paper on differentially private spatial accessibility analysis was accepted by SIGSPATIAL 2023. When privacy meets geospatial and health... [Aug 2023] Our paper on fine-grained privacy for EHR data was accepted by CIKM 2023. more news Contact liyue.fan@charlotte.edu 9201 University City Blvd. 430D Woodward Hall Charlotte, NC 28223",
  "content_length": 2920,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:43"
}