{
  "name": "Lizhen Qu",
  "homepage": "https://research.monash.edu/en/persons/lizhen-qu",
  "status": "success",
  "content": "Lizhen Qu - Monash University View Scopus Profile Lizhen Qu Dr Senior Lecturer, Department of Data Science & AI https://orcid.org/0000-0002-7764-431X EmailLizhen.Qumonashedu 20082025 Research activity per year Personal profile BiographyDr. Lizhen Qu is a senior lecturer at the Faculty of Information Technology at Monash University, a founding member of the AIM lab, and an expert in robust and privacy-preserving neuro-symbolic methods for natural language processing (NLP) and multimodal applications. His work seamlessly integrates deep learning, logical reasoning, and causality. In particular, his team were the first to investigate the negative impact of spurious correlations in dialogue research using causality theories and proposed algorithms to improve the robustness and generalizability of models across domains. In addition, he has conducted extensive research on a wide range of NLP applications, with a special focus on legal AI, digital health, and social NLP.  Prior to his current role, he served as a research scientist at Data61/CSIRO, and completed his PhD at Saarland University and the Max-Planck-Institute for Informatics. He also actively contributes to the NLP community, serving as an Area Chair for ACL Rolling Review (ARR), OpenReview Co-Chair for ACL 2025, and Workshop Co-Chair for IJCNLP-AACL 2025. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2023 2027 1 Finished 4 Active Projects per year TMLGenAI: Trustworthy Generative AI: Towards Safe and Aligned Foundation ModelsPhung, D. (Primary Chief Investigator (PCI)), Vu, T. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Webb, G. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Ke, Q. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)) & Bui, T. (Chief Investigator (CI))11/06/24 → 10/07/26Project: Research HARNESS: Hierarchical Abstractions and Reasoning for Neuro-Symbolic SystemsRezatofighi, H. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Gutierrez, J. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Ignatiev , A. (Chief Investigator (CI)), Swiecki, Z. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))20/06/23 → 20/02/27Project: Research CSIRO Next Generation Graduates Program: AI in Mental Health McNaney, R. (Primary Chief Investigator (PCI)), Olivier, P. (Chief Investigator (CI)), Yap, M. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)), Wu, L. (Chief Investigator (CI)), Watterson, J. (Chief Investigator (CI)), Haffari, R. (Partner Investigator (PI)), Qu, L. (Partner Investigator (PI)), Wilson Rajaratnam, S. (Partner Investigator (PI)), Wang, T. (Partner Investigator (PI)), Sharp, G. (Partner Investigator (PI)), Alvarez-Jimenez, M. (Chief Investigator (CI)), D'Alfonso, S. (Chief Investigator (CI)) & Kostakos, V. (Chief Investigator (CI))Pola Practice Pty Ltd, Crank Group Pty Ltd5/04/23 → 31/12/27Project: Research Accessible Data Exploration and Analysis for Blind PeopleMarriott, K. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Zukerman, I. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)) & Lee, B. (Partner Investigator (PI))ARC - Australian Research Council28/02/23 → 27/02/27Project: Research Cross-lingual text summarisation with a planLi, Y.-F. (Primary Chief Investigator (PCI)), Haffari, R. (Chief Investigator (CI)) & Qu, L. (Chief Investigator (CI))1/06/22 → 31/08/22Project: Research Research output Research output per year 2008 2021 2023 2024 2025 55 Conference Paper 8 Article 1 Paper Research output per year Research output per year Audio Is the Achilles’ Heel: Red Teaming Audio Large Multimodal ModelsYang, H., Qu, L., Shareghi, E. & Haffari, R., 2025, NAACL 2025, Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics Proceedings of the Conference Volume 1: Long Papers. Chiruzzo, L., Ritter, A. & Wang, L. (eds.). Kerrville TX USA: Association for Computational Linguistics (ACL), p. 9292–9306 15 p. 2025.naacl-long.470Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access Automating IRAC analysis in Malaysian contract law using a semi-structured knowledge baseKang, X., Qu, L., Soon, L.-K., Li, Z. & Trakic, A., 7 Jul 2025, (Accepted/In press) In: Artificial Intelligence and Law. 44 p.Research output: Contribution to journal › Article › Research › peer-review Open Access NEUSIS: A Compositional Neuro-Symbolic Framework for Autonomous Perception, Reasoning, and Planning in Complex UAV Search MissionsCai, Z., Cardenas, C. R., Leo, K., Zhang, C., Backman, K., Li, H., Li, B., Ghorbanali, M., Datta, S., Qu, L., Gutierrez, J., Ignatiev, A., Li, Y.-F., Vered, M., Stuckey, P. J., De La Banda, M. G. & Rezatofighi, H., Sept 2025, In: IEEE Robotics and Automation Letters. 10, 9, p. 9502-9509 8 p.Research output: Contribution to journal › Article › Research › peer-review When Refreshable Tactile Displays Meet Conversational Agents: Investigating Accessible Data Presentation and Analysis with Touch and SpeechReinders, S., Butler, M., Zukerman, I., Lee, B., Qu, L. & Marriott, K., Jan 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 1, p. 864-874 11 p.Research output: Contribution to journal › Article › Research › peer-review 7 Citations (Scopus) Causal Discovery Inspired Unsupervised Domain Adaptation for Emotion-Cause Pair ExtractionHua, Y., Huang, Y., Huang, S., Feng, T., Qu, L., Bain, C., Bassed, R. & Haffari, G., 2024, EMNLP 2024, The 2024 Conference on Empirical Methods in Natural Language Processing, Findings of EMNLP 2024. Al-Onaizan, Y., Bansal, M. & Chen, Y.-N. (eds.). Kerrville TX USA: Association for Computational Linguistics (ACL), p. 8139-8156 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 1 Citation (Scopus) View all 64 research outputs",
  "content_length": 6894,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:43"
}