{
  "name": "Lizhong Chen",
  "homepage": "http://web.engr.oregonstate.edu/~chenliz",
  "status": "success",
  "content": "Lizhong Chen's Homepage (陈理中) Lizhong Chen, Ph.D. (陈理中) Professor School of Electrical Engineering and Computer Science Oregon State University Menu: Home Research People Publications Software Teaching News Miscellaneous Curriculum Vitae Short Biography Dr. Lizhong Chen is a Professor in the School of Electrical Engineering and Computer Science at Oregon State University and a core AI faculty member in the Collaborative Robotics and Intelligent Systems (CoRIS) Institute. His research interests are in the broad area of efficient computer systems (e.g., GPUs, accelerators, HPCs, IoT devices) and their applications in machine learning and natural language processing (especially large language models). Dr. Chen is a recipient of National Science Foundation (NSF) CRII Award (2016), NSF CAREER Award (2018), Best Paper Nomination at IEEE NAS (2018), Best Paper Runner-up Award at HPCA (2020), and Chu Kochen Award (the highest honor from Zhejiang University, China). He served as an Associate Editor of the IEEE Transactions on Computers, program committee members in top computer system and machine learning conferences, reviewers for a number of highly ranked journals, and panelists of multiple NSF panels related to computer systems. He is the founder and organizer of the Annual International Workshop on AIDArc (AI-assisted Design for Architecture). Dr. Chen is a Senior Member of the IEEE and ACM, and was an inductee into the IEEE HPCA Hall of Fame (2020). Prior to joining Oregon State University in 2014, Dr. Chen was a postdoc at the University of Southern California (USC). He received his Ph.D. in Computer Engineering and M.S. in Electrical Engineering from USC (advisor Dr. Timothy Pinkston) in 2014 and 2011, respectively, and B.S. in Electrical Engineering (Honors College) from Zhejiang University in 2009. Acknowledgment Our research is supported by: Recent Highlights Research positions are available (GPA >= 3.90; exceptions possible but rare). We received funding for a 5-year collaborative project from Department of Energy. Dr. Lizhong Chen has been promoted to Full Professor! We are organizing the shared task (competition) on simultaneous translation at IWSLT 2025, with a focus on using LLMs. Please consider join (details)! We released Simul-LLM, the first open-source fine-tuning and evaluation framework for applying large language model to simultaneous machine translation. Please check the Github repo and the paper. We received funding from the National Science Foundation PPoSS program. We are part of the Northwest-AI-Hub supported by the CHIPS and Science Act. Please check out our book on \"AI for Computer Architecture: Principles, Practice, and Prospects\" in the Synthesis Lectures on Computer Architecture (you might want to click \"Access via your institution\" to see if you already have free access). We received funding for a 5-year collaborative project from National Institutes of Health (NIH). We received funding for a 5-year collaborative project from Department of Energy. We received funding from the National Science Foundation MLWiNS program. Lizhong Chen, Ph.D. Professor School of Electrical Engineering and Computer Science College of Engineering Oregon State University 3113 Kelley Engineering Center Corvallis, OR 97331 chenliz@oregonstate.edu (541)737-3317",
  "content_length": 3330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:44"
}