{
  "name": "Lizhi Peng",
  "homepage": "https://mln.ujn.edu.cn/MLNBA/index.html",
  "status": "success",
  "content": "Lizhi Peng Lizhi Peng, Ph.D Professor, University of Jinan MLNBA-Machine Learning & Network Behavior Analysis Lab ä¸­æ Biography Lizhi Peng received the Ph.D. degree in Computer Science and Technology from the School of Computer Science and Technology, Harbin Institute of Technology, China, 2015. He is currently an Professor at School of Information Science and Engineering, University of Jinan, China and Shandong Provincial Key Laboratory of Network Based Intelligent Computing, University of Jinan, China. Dr.Peng is a visitor scholar at Computer Science Department, University of Otago, New Zealand. His primary interests are in machine learning, evolutionary computing, computer networks, parallel and distributed computing. He presided over and participated in many projects of the National Natural Science Foundation of China, Shandong Natural Science Foundation and Shandong Key R&D Program. He won the second prize of Shandong Science and Technology Progress, the second prize of Heilongjiang Science and Technology Progress, and the second prize of Shandong Natural Science. He has published more than 50 papers in publications or conferences such as Information Sciences, Computer Communications, Parallel Computing, Applied Soft Computing and IWQoS. Contact Information Address:     School of Information Science and Engineering, University of Jinan No. 336, West Road of Nan Xinzhuang, Jinan, 250022 China Telephone: (+86) 531-8973-6863 Email:       plz@ujn.edu.cn Lab:          MLNBA-Machine Learning & Network Behavior Analysis Lab Education 2009.09-2015.07 Ph.D, Computer Science and Technology, School of Computer Science and Technology, Harbin Institute of Technology, China 2003.09-2006.07 M.S, Computer Science and Technology, School of Information Science and Engineering, University of Jinan, China 1994.09-1998.07 Software Engineering, School of Engineering Mechanics, Xiâan Jiaotong University, China Work Experience 2019.12- Professor, University of Jinan, China 2015.01-2019.12 Associate Professor, University of Jinan, China 2008.10-2014.12 Lecturer, University of Jinan, China 2006.07-2008.09 Teaching Assistant, University of Jinan, China 1998.07-2003.08 Teaching Assistant, Jinan Pioneer Technology co.LTD, China Selected Publications An Early Stage Convolutional Feature Extracting Method Using for Mining Traffic Detection Peifa Sun,Mengda Lyu,Hui Li,Bo Yang,Lizhi Peng* In Computer Communications, 2022, accepted Similarity-evaluation-based evolving of flexible neural trees for imbalanced classification Min Qiu, Lizhi Peng*, Ying Pang,Bo Yang,Panpan Li In Applied Soft Computing, 2021, accepted A Novel Feature Method for Fast Extraction of Mining Traffic Peifa Sun, Lizhi Peng*,Bo Yang,Shuaili Liu In IEEE International Conference on High Performance Computing and Communications, 2021, accepted Flexible Neural Tree Based on Similarity Evaluation with an Application in Video Traffic Identification Min Qiu, Lizhi Peng*, Bo Yang,Lijuan Sun In Journal of Computer Research and Development, 2021, accepted Gaussian Distribution based Oversampling for Imbalanced Data Classification Yuxi Xie, Min Qiu, Haibo Zhang, Lizhi Peng*, Zhenxiang Chen In IEEE Transactions on Knowledge and Data Engineering, 2020, accepted Ranking-based Biased Learning Swarm Optimizer for Large-Scale Optimization Hanbo Deng, Lizhi Peng*, Haibo Zhang, Bo Yang, Zhenxiang Chen In (Elsevier) Information Sciences, 493(16), pp. 120-137, 2019. Generative Learning for Imbalanced Data Using the Gaussian Mixed Model Yuxi Xie, Lizhi Peng*, Zhenxiang Chen, Bo Yang, Hongli Zhang In (Elsevier) Applied Soft Computing, 79(6), pp. 439-451, 2019. Imbalanced learning based on adaptive weighting and Gaussian function synthesizing with an application on Android malware detection Ying Pang, Lizhi Peng*, Zhenxiang Chen, Bo Yang, Hongli Zhang In (Elsevier) Information Sciences, 484(1), pp. 95-112, 2019. (SCIï¼IF: 4.305) A Fast Feature Weighting Algorithm of Data Gravitation Classification Lizhi Peng, Hongli Zhang, Haibo Zhang, Bo Yang In (Elsevier) Information Sciences, 375(1), pp. 54-78, 2017. (SCIï¼IF: 4.832) Imbalanced traffic identification using an imbalanced data gravitation-based classification model, C Lizhi Peng, Haibo Zhang, Yuehui Chen, Bo Yang In Computer Communications 102(1), pp. 177â189, 2017. (SCIï¼IF: 3.338) Data Gravitation Based Classification Lizhi Peng, Bo Yang, Yuehui Chen, Ajith Abraham In (Elsevier) Information Sciences, 179(6), pp. 809-819, 2009. (SCIï¼IF: 3.643) Awards Second Prize of Heilongjiang Science and Technology Progress Award, No. 9, 2017 P2P network information security management technology Shandong Natural Science Award Third Prize, No. 5, 2015 Hybrid Computing Intelligence Theory and Its Application Shandong Province Computer Application Excellent Achievements First Prize, No. 3, 2010 Integrative Management Support System of Degree and Graduate Education in Shandong Province Second Prize of Science and Technology in Shandong Province, No. 5, 2009 Research on Key Technologies of Distributed Park Network Access Control Shandong Province Graduate Education Provincial Teaching Achievement First Prize, No. 5, 2009 Research and Application of Management Information System for Degree and Graduate Education Major academic part-time jobs Member, IEEE, IEEE Computer Society, USA Member, ACM, USA Senior Member, CCF, P.R.China Reviewers of Information Sciences, Journal of Network and Computer Applications The PC member of the 14th IEEE International Conference on Pervasive Intelligent and Computing (PICom 2016) Conference The session chair of the 2018 International Conference on Security, Pattern Analysis, and Cybernetics (SPAC 2018) Conference",
  "content_length": 5715,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:42"
}