{
  "name": "Lizzie Coles-Kemp",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/lizzie-coles-kemp",
  "status": "success",
  "content": "Lizzie Coles-Kemp - Royal Holloway Research Portal Lizzie Coles-Kemp Professor Head of Department Information Security, Department of Information Security Phone+44 1784 443084EmailLizzie.Coles-Kemprhul.acuk TW20 0EX Personal profile Personal profileLizzie Coles-Kemp is Professor of Information Security at Royal Holloway University of London and specialises in the design of accessible and inclusive security technologies, practices, and processes. She pioneered the use of creative engagement practices within the domain of information security research. In her role as Principal Fellow at the UK’s Research Institute of Sociotechnical Cyber Security, Lizzie works on the topic of digital responsibility. She has a long track record of working in partnership with the UK’s National Cyber Security Centre and with UK government departments for science, innovation, and technology (DSIT) and for culture, media and sport (DCMS). Lizzie is currently Head of Department for Information Security, is a former EPSRC research fellow, and is a member of the College of Experts for both DSIT and DCMS. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Keywordssocio-technicalprivacyinformation security trustHCIdesign Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 28 Conference contribution 13 Article 8 Chapter 4 Paper 6 More 3 Book 1 Book/Film/Article review 1 Special issue 1 Review article Research output per year Research output per year Co-creating conditions for social justice in digital societies: modes of resistance in HCI collaborative endeavors and evolving socio-technical landscapesCrivellaros, C., Coles-Kemp, L., Dix, A. & Light, A., 22 Jan 2025, (E-pub ahead of print) In: ACM Transactions on Computer-Human Interaction (TOCHI).Research output: Contribution to journal › Article › peer-review Open AccessFile 72 Downloads (Pure) Friend or Foe? Navigating and Re-configuring \"Snipers' Alley\"Dwyer, A., Coles-Kemp, L., Heath, C. P. R. & Crivellaro, C., 2025, p. 1-15. 15 p.Research output: Contribution to conference › Paper › peer-review Open Access 5 Downloads (Pure) Understanding Digital ResponsibilitiesColes-Kemp, L. & Burdon, M., 18 Dec 2025, Bristol University Press. 202 p.Research output: Book/Report › Book Navigating the Landscape of Security Modelling: The MORS GridSpencer, M., Coles-Kemp, L. & Rydhof Hansen, R., 14 Nov 2024, In: Journal of Cybersecurity. 10, 1, 17 p., tyae024.Research output: Contribution to journal › Article › peer-review Open Access Regulating Digital Security by Design? Implications of The Perspectives From DSbD Programme StakeholdersSlesinger, I., Panteli, N. & Coles-Kemp, L., 18 Jun 2024, (E-pub ahead of print) In: Information and Computer Security . 15 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 23 Downloads (Pure) View all 59 research outputs Projects 3 Active 13 Finished Projects per year Fake in the CommunityDwyer, A. (PI), Coles-Kemp, L. (CoI), Quaglia, E. (CoI) & Francati, D. (CoI)Arts & Humanities Research Council AHRC1/07/25 → 1/03/26Project: Research Equitable PrivacyColes-Kemp, L. (PI) & Dwyer, A. (CoI)1/09/22 → 28/02/26Project: Research EPSRC Centre for Doctoral Training in Cyber Security for the Everyday Martin, K. M. (PI), Cid, C. (CoI), Coles-Kemp, L. (CoI), Jensen, R. B. (CoI) & Adey, P. (CoI)1/10/19 → 31/03/28Project: Other Digital PhysioOT: a home digital physio and occupational therapy technology for reversing frailty and keeping people movingColes-Kemp, L. (PI)Eng & Phys Sci Res Council EPSRC1/09/22 → 29/02/24Project: Research Equitable privacyColes-Kemp, L. (PI)Eng & Phys Sci Res Council EPSRC1/09/22 → 28/03/25Project: Research View all 16 projects Activities 3 Public engagement, outreach and knowledge exchange - Festival/exhibition Activities per year AHRC Connected Communities ShowcaseColes-Kemp, L. (Participant)12 Mar 2013Activity: Other › Public engagement, outreach and knowledge exchange - Festival/exhibition Privacy.Co.OkColes-Kemp, L. (Participant)2011Activity: Other › Public engagement, outreach and knowledge exchange - Festival/exhibition Exploring privacy: your privacy and the internetColes-Kemp, L. (Participant)2010Activity: Other › Public engagement, outreach and knowledge exchange - Festival/exhibition",
  "content_length": 4805,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:44"
}