{
  "name": "Lodewyk F. A. Wessels",
  "homepage": "https://www.nki.nl/divisions/molecular-carcinogenesis/wessels-l-group",
  "status": "success",
  "content": "Lodewyk Wessels Group | Computational Cancer Biology | Netherlands Cancer Institute Abstract depiction of network reconstruction from data RESEARCH RESEARCH GROUPS LODEWYK WESSELS Lodewyk Wessels Computational Cancer Biology We aim to understand treatment response in model systems and patients. We focus on three themes. In Theme 1, ‘Cell decisions’ we use single cell perturbation and longitudinal profiling to infer the regulatory machinery that controls cellular state transitions. Theme 2, ‘Cell maps’, maps the regulatory circuitry in cells through network inference on large scale screens and experimental validation. Finally, in Theme 3, ‘Treatment response’, we aim to design optimal treatment (combinations) by understanding single and combination treatment response based on pre- and on-treatment measurements. More about this group Our research Cell decisions, Cell maps, Treatment design Our resources novel computational algorithms Team members Lodewyk Wessels Group leader Niek Brouwer PhD student Ewald van Dyk Postdoctoral Fellow Hamza Ali PhD student Pedro Batista Tan PhD student Chloé Bazin PhD student Vanessa Botha PhD student Lianne Bouwmeester Technician Sander Canisius Associate staff scientist Maksim Chelushkin PhD student Anne de Ruijter PhD student Duco Gaillard PhD student Guizela Huelsz Prince Postdoctoral Fellow Kathy Jastrzebski Associate staff scientist Aaron Lin PhD student Kat Moore Bioinformatician Paolo Odello PhD Student Misha Sheinman Postdoctoral fellow Tim Stohn PhD student Bram Thijssen Postdoctoral fellow Nadine van de Brug PhD student Torben van Zijp PhD student Daniel Vis Postdoctoral fellow + 4 Show more Alumni Show more alumni + 26 Marlous Hoogstraat Evert Bosdriesz Jelle ten Hoeve Nanne Aben Gergana Bounova Abhishek Singh Yongsoo Kim Elmer Stickel Julian de Ruiter Joana P. Goncalves Magali Michaut Ekaterina Nevedomskaya Fredrick Mobegi Sergio Rossell Nicola Bonzanni Andreas Schlicker Hayssam Soueidan Nicos Angelopoulos Theo Knijnenburg Guillem Rigaill Miranda Mandjes Ewald van Dyk Johann de Jong Jorma de Ronde Wouter Meuleman Chris Klijn Jeroen de Ridder Martin van Vliet Carmen Lai Publications of this group Nature medicine Preoperative ipilimumab plus nivolumab in locoregionally advanced urothelial cancer: the NABUCCO trial. 01-12-2020 Key Publication Nature communications Genomic data integration by WON-PARAFAC identifies interpretable factors for predicting drug-sensitivity in vivo. 06-11-2019 Key Publication Bioinformatics (Oxford, England) PRECISE: a domain adaptation approach to transfer predictors of drug response from pre-clinical models to tumors. 15-07-2019 Key Publication PLoS computational biology Molecular characterization of breast and lung tumors by integration of multiple data types with functional sparse-factor analysis. 01-10-2018 Key Publication Bioinformatics (Oxford, England) Comparative Network Reconstruction using mixed integer programming. 01-09-2018 Key Publication Cell Identifying Epistasis in Cancer Genomes: A Delicate Affair. 30-05-2019 More publications Bacteria in cancer unmasked 09-04-2024 New drug combinations found for resistant cancers 23-02-2022 Joris van de Haar receives Antoni van Leeuwenhoek award 2021 17-01-2022 More about our collaborations Mouse Models of Breast Cancer Jos Jonkers Human breast cancer development and progression. Host responses and personalized medicine Emile Voest Precision medicine guided by tumor organoids. Contact our group Patty Lagerweij Office Manager Phone Email Learn more about our... Facilities & Platforms Researchers Disclaimer Privacy statement Cookies This site uses cookies This website uses cookies to ensure you get the best experience on our website. Got it",
  "content_length": 3725,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:47"
}