{
  "name": "Long Chen 0016",
  "homepage": "https://zjuchenlong.github.io",
  "status": "success",
  "content": "Long Chen @ HKUST Long Chen Assistant Professor Department of Computer Science and Engineering (CSE) School of Engineering (SENG) The Hong Kong University of Science and Technology (HKUST) Email: longchen A~T ust.hk Office: CYT-3003, Cheng Yu Tung Building, HKUST, Clear Water Bay, Hong Kong Dr. Long CHEN (Chinese: 陈隆) is an assistant professor at the department of CSE, Hong Kong University of Science and Technology (HKUST). He is leading a computer vision and machine learning research group: LONG Group. His primary research directions are Computer Vision, Machine Learning, Multimedia, and Artificial Intelligence. Recent Research Directions: Foundation Models Efficient Finetuning: Parameter-efficient Tuning ([IterIS, CVPR’25], [ComPro, IJCV’24]), Memory-efficient Tuning ([UniPT, CVPR’24], [SHERL, ECCV’24]), Modality-efficient Tuning ([PathWeave, NeurIPS’24]), Reinforcment Learning with Human/AI Feedback (RLHF/RLAIF) ([B2-DiffuRL, CVPR’25], [Fast RL, EMNLP’24], [RED, EMNLP’25]). Visual Generation and Editing: Image Generation/Editing ([FlowCycle, arXiv’25], [CLIPDrag, ICLR’25], [Free-Event, ICML’25]), Concept Erasure ([ErasePro, arXiv’25]), Video Generation ([Ca2-VDM, ICML’25], [SpA2V, ACMMM’25]) Video Editing and Customization ([CoMo, arXiv’25], [DisPose, ICLR’25]), 3D Mesh Generation ([Nautilus, ICCV’25]), 3D Gaussian Editing ([VcEdit, ECCV’24]). Generative Models Helps Perception: Flow Matching for Classification ([FMA, arXiv’25]), Diffusion Model for Classification ([Diff-II, CVPR’25], [NoOp, NeurIPS’25]). Open-world/vocabulary Perception: Object Detection ([Survey, TPAMI’24], [CCKT-Det, ICLR’25]), Scene Graph Generation ([NICEST, TPAMI’24], [INOVA, NeurIPS’25], [RECORD, NeurIPS’23], Compositional Classification ([PLO, ACMMM’25]), Pose Estimation ([Di2Pose, NeurIPS’24]), Situation Recognition ([LEX, ACMMM’24]). Multimodal Understanding and Reasoning: Benchmark for Unified Model ([GIR-Bench, arXiv’25]), RL for Reasoning ([DyME, arXiv’25][Relation-R1, arXiv’25]), Interleaved Generation ([CoMM, CVPR’25]), Reasoning Segmentation ([LENS, arXiv’25]) Hallucination ([DCD, NeurIPS’25]), Multimodal Editing ([DECap, ECCV’24]), Visual Question Answering ([IdealGPT, EMNLP’23 Findings]). Services: Associate Editor: IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2025 - ) Associate Editor: IEEE Transactions on Image Processing (TIP) (2025 - ) Associate Editor: ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) (2025 - ) Action Editor: Transactions on Machine Learning Research (TMLR) (2025 - ) Action Editor: ACL Rolling Review (ARR) (2022 - ) Conference Area Chair (AC): CVPR (2026, 2025, 2024, 2023), ECCV (2024), ICLR (2026, 2025), NeurIPS (2025, 2024, 2023), ICML (2026, 2025), ACM MM (2025, 2024), AAAI (2026), BMVC (2025, 2024, 2023, 2022) Honors and Awards: IJCAI 2025 Early Career Spotlight (IJCAI, 2025) AAAI 2025 New Faculty Highlights (AAAI, 2025) World Top 2% Scientists (Single Year) (Stanford University, 2023 - ) Best Paper Award of the 2nd HUMA Workshop in ACM MM 2021 (ACM MM, 2021) 2021 Global Top 100 Chinese Rising Stars in AI (AI华人新星百强) (Baidu Scholar, 2021) CVPR 2020 Doctoral Consortium (CVPR, 2020) News Nov, 2025 I will serve as an Area Chair for ICML 2026. Nov, 2025 I will give a talk in CCBR 2025 (Nanchang): Workshop on Multimodal LLMs (多模态大模型前沿). Nov, 2025 I will serve as an Associate Editor for IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). Oct, 2025 I will serve as an Action Editor for Transactions on Machine Learning Research (TMLR). Sep, 2025 I will give a talk in ACM MM 2025 (Dublin): Multimodal Foundation Models for Spatial Intelligence workshop. Sep, 2025 We will organize a workshop in AAAI 2026: Consistency in Video Generative Models: from Clip to Wild. Aug, 2025 I will serve as an Area Chair for CVPR 2026 and ICLR 2026. Aug, 2025 I will give a talk in IJCAI 2025 Early Career Spotlight program. Jul, 2025 I will serve as a Area Chair for AAAI 2026. May, 2025 I will give a talk in VALSE 2025 (Zhuhai): Vision Foundation Model Workshop (视觉通用模型).",
  "content_length": 4104,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:47"
}