{
  "name": "Long Hoang Dang",
  "homepage": "https://longhoangdang.github.io",
  "status": "success",
  "content": "Long Hoang Dang's Portfolio About me I am Long Hoang Dang (also known as Đặng Hoàng Long). I studied for a Bachelor of Information Technology at the Posts and Telecommunications Institute of Technology (PTIT) from 2014 to 2019, graduating with distinction as the top-ranked student, under the supervision of Prof. Tu Minh Phuong. In 2020, I received a Deakin University Postgraduate Research Scholarship (DUPRS) and started my PhD at the Applied Artificial Intelligence Institute (A2I2) at Deakin University, Australia under the supervision of Prof. Truyen Tran, Dr. Thao Minh Le, Dr. Vuong Le and Prof. Svetha Venkatesh. I completed my PhD in early 2024 and have been working as a Lecture at PTIT. My research interests include Generative Models, Vision and Language Reasoning, and Domain Generalization. News 2024-2025 Intake: Currently, I am seeking undergraduate students (2nd, 3rd, and 4th year) interested in working with me on vision and language reasoning, generative model, and domain generalization. Selected students will have the opportunity to collaborate with experts in these fields and potentially submit their work to prestigious AI conferences and journals. If you are interested, please email me your CV here. 05/07/2024 My PhD thesis, \"Language-guided Visual Reasoning via Deep Neural Networks,\" has been nominated for the Alfred Deakin Medal for the Most Outstanding Doctoral Thesis. 27/06/2024 I have become an external supervisor for PhD candidate Hung Le (A2i2, Deakin University), working alongside Prof. Truyen Tran and Dr. Thao Minh Le. 17/06/2024 I accepted an invitation to serve as a reviewer for WACV-2025. 11/06/2024 I accepted an invitation to serve as a reviewer for AAAI-2025. 27/05/2024 I have become a member of the working group tasked with developing the project to establish the Faculty of Artificial Intelligence - PTIT. 16/05/2024 I have become a mentor for MSc. Quan Dinh Nguyen (PTIT), working alongside Assoc. Prof. Cuong Pham and Dr. Cong Tran. 10/05/2024 I have become a mentor for Mr. Kien Trung Bui (PTIT), working alongside Prof. Tu Minh Phuong. [Older news] [Latest news] 03/05/2024 I officially got my PhD from Deakin University. 01/05/2024 I have become a mentor for Mr. Kien Trung Tran, Mr Vinh Quang Vu, Mr. Lam Hai Nguyen, Mr Hai Duc Nguyen (PTIT), working alongside Dr. Cong Tran. 12/03/2024 I accepted an invitation to serve as a reviewer for ECAI-2024. 11/03/2024 I started working for the Faculty of Information Technology - PTIT as a Lecturer. 30/09/2023 Our paper Dynamic Reasoning for Movie QA: A Character-Centric Approach is accepted by IEEE Transactions on Multimedia. 30/09/2023 I started working for Akila - Singapore as an Applied AI Scientist. 29/06/2023 Our paper Compositional Prompting with Successive Decomposition for Multimodal Language Models is accepted by KDD@LLM4AI-2023 11/06/2023 I accepted an invitation to serve as a reviewer for AAAI-2023 and WACV-2024. 01/04/2023 I accepted an invitation to serve as a reviewer for IEEE Transactions on Circuits and Systems for Video Technology. 16/12/2022 Our paper VLSP 2021 - VieCap4H Challenge: Automatic Image Caption Generation for Healthcare Domain in Vietnamese is accepted by VNU Journal of Science: Computer Science and Communication Engineering 19/10/2022 Our paper Time-Evolving Conditional Character-centric Graphs for Movie Understanding is accepted by NeurIPS 2022 Temporal Graph Learning Workshop as Spotlight presentation 01/05/2021 Our paper Hierarchical Object-oriented Spatio- Temporal Reasoning for Video Question Answering is accepted at IJCAI'21, acceptance rate 13.9% (587/4204) 10/04/2021 Our paper Object-Centric Representation Learning for Video Question Answering is accepted at IJCNN 2021. 21/10/2020 Our paper Recurrent convolutional networks for session-based recommendations is accepted by Neurocomputing 11/08/2020 Our paper Object-Centric Relational Reasoning for Video Question Answering is accepted by ECCV@VTT2020 01/08/2020 Our paper On multi-resident activity recognition in ambient smart-homes is accepted by Artificial Intelligence Review 05/02/2020 I started my PhD at the Applied Artificial Intelligence Institute (A2I2) at Deakin University, Australia under the supervision of Prof. Truyen Tran, Dr. Thao Minh Le, Dr. Vuong Le and Prof. Svetha Venkatesh",
  "content_length": 4317,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:48"
}