{
  "name": "Longfei Shangguan",
  "homepage": "https://shanggdlk.github.io",
  "status": "success",
  "content": "Longfei Shangguan Longfei Shangguan Assistant Professor Computer Science Center for African Study (adjunct professor) University of Pittsburgh Visiting Faculty Researcher@Google I lead Pittsburgh Experimental Research Group (PERG). My group builds hardware and software systems to push the limits of computing, sensing, and communication barrier of sensor and wireless technologies. Before joining Pitt in the fall of 2022, I was a postdoctoral research associate at Princeton and later as a senior researcher at Microsoft. I earned my Ph.D. from HKUST in 2015 under Yunhao Liu and Ke Yi. My work was nominated for Best Paper Award at SenSys 2025, and was awarded Best Paper Award at MobiCom 2024, Best Paper Runner-up Award at MobiCom 2021, Distinguished Paper Award at Ubicomp 2016, and Best Paper Award at TrustCom 2014. I am a recipient of an NSF CAREER Award in 2024, a Google Research Scholar Award in 2023, and the AIoTSys Young Scientist Award in 2023. Current Project Computing - Sensor-in-the-loop AI Agent: developing personalized AI agent through multi-modal sensor technologies. Sensing - Inside-out & Outside-in: exploring various sensor modalities (acoustic, vision, and many others) for human-centric sensing. Communication - Wireless Digital Twin: understanding the wireless world through neural ray tracing. Professional Activities Editor: IEEE Pervasive Computing, ACM GetMobile PC members: MobiCom'26, MobiCom'25, NSDI'25, MobiCom'24, SenSys'24, HotMobile'24, InfoCom'24, SenSys'23, SEC'23, MobiCom'23, IPSN'23, INFOCOM'23, MobiCom'22, SenSys'22 ... TPC co-chairs: ICPADS'22, MobiQuitous'22 Co-organizers (with Xia, Marco, Haitham, Luca, and Kyle): Dagstauhl seminar on Novel Scenarios for the Wireless Internet of Things Pittsburgh Experimental Research Group (PERG) Ph.D. student: Yongjie Yang, Zhiwei Ren, Vaibhav Singh, Junbo Li, Hongbo Lan Alumni: Zhenlin An (M): Postdoc (2024-2025), next stop: assistant professor at University of Georgia. Tao Chen (M): Postdoc (2022-2025), next stop: senior research scientist at Samsung Research America. Maanya Shanker (F): master thesis on earable for health, next stop: software engineer at Bloomberg. Haoyu Li (M): master thesis on event-based Visual SLAM, next stop: RA at Duke. Yuxuan Zhang (M): master thesis on drive-by sensing, next stop: Ph.D. student at TAMU. Yujing Huang (F): undergraduate thesis on accelerating sphere decoding through ray tracing, next stop: Ph.D. student at U Buffalo. Recruiting For master students: please drop me an email if you want to do a master thesis with me. Undergraduate research opportunities: I have a few research projects for undergraduates, drop me an email if interested. Recent News [August, 2025] E-Cube accepted to Eurosys'26. [March, 2025] WellMax and LeakyFeeder accepted to SenSys'25. [February, 2025] RadioTwin accepted to DYSPAN'25. [February, 2025] awarded MassAITC Pilot Award! Thanks Massachusetts AI and Technology Center and National Institute on Aging (NIA). Recent Publications [Eurosys'26] E-Cube: Event Enhanced Efficient Video Streaming for Drones [DySPAN'25] RadioTwin: A Digital Building Material Twin for Wideband, Cross-link, Cross-band Wireless Channel Prediction [SenSys'25] Toward Sensor-In-the-Loop LLM Agent: Benchmarks and Implications [SenSys'25] LeekyFeeder: In-Air Gesture Control Through Leaky Acoustic Waves Demo [IEEE Pervasive Computing] Towards Next-Generation Human Computer Interface Based On Earables Invited Paper, Research Brief [MobiSys'24] Enabling Hands-Free Voice Assistant Activation on Earphones [CHI'24] MAF: Exploring Mobile Acoustic Field for Hand-to-Face Gesture Interactions Presentation [MobiCom'24] Exploring the Feasibility of Remote Cardiac Auscultation Using Earphones Demo Best paper Award [MobiCom'24] Exploring Biomagnetism for Inclusive Vital Sign Monitoring: Modeling and Implementation [MobiCom'24] Map++: Towards User-Participatory Visual SLAM Systems with Efficient Map Expansion and Sharing [MobiCom'23] Taming Event Cameras with Bio-Inspired Architecture and Algorithm: A Case for Drone Obstacle Avoidance Demo [MobiCom'23] APG: Audioplethysmography for Cardiac Monitoring in Hearables Google blog [MobiCom'23] Towards Spatial Selection Transmission for Low-end IoT devices with SpotSound [MobiCom'22] RF-Transformer: A Unified Backscatter Radio Hardware Abstraction Code [NSDI'22] CurvingLoRa to Boost LoRa Network Throughput Through Concurrent Transmissions Code [NSDI'22] SwarmMap: Scaling Up Real-time Collaborative Visual SLAM at the Edge Code [NSDI'22] Saiyan: Design and Implementation of a Low-power Demodulator for LoRa Backscatter Systems Code Awards Best paper award, MobiCom, 2024. NSF CAREER award, 2024. Google research scholar award, 2023. Best paper runner-up award, MobiCom, 2021. Distinguished paper award, IMWUT(Ubicomp), 2018. Best paper award, TrustCom, 2014. Contact longfei@pitt.edu 5427 Sennott Square, Pittsburgh, PA. Cite × Copy Download",
  "content_length": 4943,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:50"
}