{
  "name": "Longbing Cao",
  "homepage": "https://researchers.mq.edu.au/en/persons/longbing-cao",
  "status": "success",
  "content": "Longbing Cao - Macquarie University Longbing Cao public CV View Scopus Profile Longbing Cao Professor, Distinguished Chair in AI, ARC Future Fellow (Level 3), Director, Frontier AI Research Centre Distinguished Chair in Artificial Intelligence, School of ComputingHearing Research CentreFrontier AI Research Centre https://orcid.org/0000-0003-1562-9429 Phone+61 2 9850 9583Emaillongbing.caomq.eduau 20132025 Research activity per year Personal profile BiographyProfessor Longbing Cao is the Distinguished Chair in Artificial Intelligence, Director of the Frontier AI Research Centre, and an ARC Future Fellow (Level 3) at Macquarie University. Previously, he was the Founding Director of the UTS Advanced Analytics Institute and held a full professorship at UTS since 2009. He holds dual PhDs in Artificial Intelligence and Computing Science, an MSc in Communication, and a Bachelor's degree in Electrical Engineering. A pioneering researcher in AI, data science, and advanced analytics, Prof Cao's work spans foundational and innovative approaches to data science and analytics, AI and intelligent systems, humanoid AI, pattern recognition, machine learning (from shallow to deep), behavior informatics, social computing, alongside applied statistics. Since 2005, he has authored more than 400 publications, including numerous sole- and first-authored monographs and journal articles. His leadership in research and its demonstrated socio-economic impact have earned him multiple recognitions, including an individual Eureka Prize, the title of ACM Distinguished Scientist, and feature mentions in media coverage, government reports, and OECD whitepaper. As the Founding Director of the UTS Advanced Analytics Institute—the first data science research initiative in Australia—Prof Cao has been a long-time advocate for advancing data science and analytics across academia and industry. He initiated globally unique academic programs, including the Master of Analytics (Research) and the PhD Thesis in Analytics. In 2009, he launched Australia's first annual Big Data Summit, which has served as a vital forum for connecting researchers, industry leaders, and government stakeholders. With prior experience as a Chief Technology Officer (CTO), Prof Cao has been at the forefront of enterprise innovation, focusing on developing actionable and impactful AI and data science solutions. His research has contributed to solving real-world problems, enhancing business productivity, and delivering measurable socio-economic benefits across sectors such as government services, finance, insurance, telecommunications, transport, and e-commerce—both in Australia and internationally. Prof Cao served as General Chair of KDD 2015, the first edition of the prestigious international conference held in Australia. He has initiated several influential efforts in data science and analytics, including the IEEE International Conference on Data Science and Advanced Analytics (DSAA), the IEEE Task Force on Data Science and Advanced Analytics, the IEEE Task Force on Behavioural, Economic, and Socio-cultural Computing (BESC), and the ACM SIGKDD Chapter for Australia and New Zealand. He is/was the Founding Editor-in-Chief of the International Journal of Data Science and Analytics (Springer-Nature), Series Editor of the Springer Book Series on Data Analytics, and has held editorial leadership roles as Associate Editor-in-Chief and Editor-in-Chief of IEEE Intelligent Systems, the flagship AI magazine of the IEEE. He also serves as the Steering Committee Chair for major conferences including PAKDD and DSAA.Research interestsAI and intelligent systems (humanoid robots) Applied statistics and modeling Behavior, business, and social informatics Data science and analytics Shallow to deep machine learning Enterprise innovation and applicationResearch engagementWith the CTO experience, Prof Cao committed to enterprise innovation and applications involving domains including public sector/services, capital markets, banking, insurance, health, telcom, e-commerce, transport, smart cities, and education, etc. Prof Cao intensively collaborated with various large private and public organizations, such as Australian Taxation Office, Australian Department of Human Services/Centrelink, Australian Department of Immigration and Border Protection, IP Australia, Commonwealth Bank Australia, Westpac, AMP, IAG, HCF, SAS, Microsoft, Shanghai Stock Exchange, etc. Community engagementProf Cao initiated and chaired various ACM and IEEE chapters and task forces, served as editor-in-chiefs and associated editors of major journals and magazines, chaired major conferences including KDD. He is the Steering Committee Chair of PAKDD and IEEE DSAA. Education/Academic qualificationPattern Recognition and Intelligent Systems, PhD, Graduate University of Chinese Academy of SciencesComputing Science, PhD, University of Technology Sydney External positionsARC Future Fellow (Level 3), Australian Research Council2020 → 2024Founding Director, Advanced Analytics Institute, University of Technology Sydney2011 → 2014Professor, University of Technology Sydney2009 → 2023 Fingerprint Dive into the research topics where Longbing Cao is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Recommender System Computer Science 100% Experimental Result Computer Science 83% Categorical Data Computer Science 64% Artificial Intelligence Computer Science 58% Matrix Factorization Computer Science 57% Deep Learning Method Computer Science 55% Sequential Pattern Computer Science 49% Outlier Detection Computer Science 41% View full fingerprint Projects Projects per year 2020 2020 2023 2024 2027 4 Finished 4 Active Projects per year Google PhD FellowshipCao, L. (Primary Chief Investigator) & Li, P. (PhD Student)16/09/24 → 16/03/26Project: Research DP24: Data Complexity and Uncertainty-Resilient Deep Variational LearningCao, L. (Primary Chief Investigator) & Gama, J. (Partner Investigator)1/08/24 → 31/07/27Project: Research MQ DVC-R strategic researchCao, L. (Primary Chief Investigator)7/06/23 → 6/06/26Project: Research MQ Industry LP: Educating Retail Investors for Impact InvestingBu, D. (Primary Chief Investigator), Liao, Y. (Chief Investigator), Smith, T. (Chief Investigator), Linnenluecke, M. (Chief Investigator), Cai, C. (Chief Investigator), Mollica, V. (Chief Investigator), Singh, A. (Chief Investigator), Cao, L. (Chief Investigator) & Peng, C. (Associate Investigator)1/09/22 → 31/12/25Project: Research LE24: Federated Omniverse Facilities for Smart Digital FuturesCao, L. (Primary Chief Investigator), Davidson, P. (Chief Investigator), Varadharajan, V. (Chief Investigator), Kim, J. (Chief Investigator), Yu, P. (Chief Investigator), Beheshti, A. (Chief Investigator), Nguyen, Q. V. (Chief Investigator) & Khanna, S. (Partner Investigator)20/08/24 → 19/08/25Project: Research View all 8 projects Research Outputs Research output per year 2013 2014 2015 2016 2017 2018 2021 2022 2025 111 Article 59 Conference proceeding contribution 18 Conference paper 9 Review article 28 More 7 Editorial 6 Conference abstract 5 Preprint 3 Book 3 Comment/opinion 2 Edited Book/Anthology 1 Chapter 1 Other journal contribution Research output per year Research output per year Data science thinking: the next scientific, technological and economic revolutionCao, L., 2018, Cham: Springer, Springer Nature. 390 p. (Data Analytics)Research output: Book/Report › Book › peer-review Metasynthetic computing and engineering of complex systemCao, L., 2015, London: Springer, Springer Nature. 348 p. (Advanced Information and Knowledge Processing)Research output: Book/Report › Book › peer-review 10 Citations (Scopus) A new age of AI: features and futuresCao, L., 2022, In: IEEE Intelligent Systems. 37, 1, p. 25-37 13 p.Research output: Contribution to journal › Article › peer-review Artificial Intelligence 100% 52 Citations (Scopus) AI science and engineering: a new fieldCao, L., 2022, In: IEEE Intelligent Systems. 37, 1, p. 3-13 11 p.Research output: Contribution to journal › Review article › peer-review Artificial Intelligence 100% Education 11% Industry 4.0 5% Critical Thinking 5% Human Nature 5% 9 Citations (Scopus) View all 225 research outputs Prizes Eureka PrizeCao, L. (Recipient), 2019Prize ACM Distinguished ScientistCao, L. (Recipient), 2019Prize: Honorary award Activities Activities per year 2006 2006 2019 2019 2 Membership of an association Activities per year The Association of Computing Machinery (ACM) (External organisation)Cao, L. (Member)2019Activity: Membership › Membership of an association IEEE (External organisation)Cao, L. (Member)2006 → …Activity: Membership › Membership of an association",
  "content_length": 8775,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:50"
}