{
  "name": "Longin Jan Latecki",
  "homepage": "https://cis.temple.edu/~latecki",
  "status": "success",
  "content": "Prof. Dr. Longin Jan Latecki LONGIN JAN LATECKI PUBLICATIONS AWARDS Ph.D. STUDENTS CODE DEMOS & PHOTOS TEACHING Department of Computer and Information Sciences | Data Analytics and Biomedical Informatics Dr. Longin Jan Latecki, Professor Info OfficeRoom 378 SERC Emaillatecki 'at' temple.edu AddressCIS Dept., Temple University 1925 N. 12th St., Philadelphia, PA 19122-1801, USA Phone(215) 204-5781 Fax(215) 204-5082 Erdős Number 2 Official Functions Associate Editor in Chief of Pattern Recognition (PR) Editorial Board of Computer Vision and Image Understanding (CVIU) Advisory Board of Journal of Imaging Keynote Speaker at Asian Conf. on Pattern Recognition Kitakyushu, Japan, November 2023 Chair of PhD Track in Artificial Intelligence Chair of Future of Computing Competition 2008-2012 Research Topics in Artificial Intelligence computer vision, natural language procesing, deep learning, medical imaging, digital geometry and topology Selected Recent Publications Vivek Trivedy and Longin Jan Latecki. Image Retrieval with Self-Supervised Divergence Minimization and Cross-Attention Classification. Int. Joint Conf. on Artificial Intelligence (IJCAI), Jeju, South Korea, August 2024. pdf Qi Jia, Shuilian Yao, Youcan Xu, Yu Liu, Dehao Kong, and Longin Jan Latecki. Fuzzy Boundary-Guided Network for Camouflaged Object Detection. IEEE Int. Conf. on Multimedia and Expo (ICME), Niagara Falls, Canada, July 2024. pdf Huitong Pan, Qi Zhang, Cornelia Caragea, Eduard Dragut and Longin Jan Latecki. SciDMT: A Large-Scale Corpus for Detecting Scientific Mentions. Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING), Turin, Italy, May 2024. pdf Amani Almalki and Longin Jan Latecki. Masked Deep Embeddings of Patches for Teeth Segmentation in Cone Beam CT Images. IEEE International Symposium on Biomedical Imaging (ISBI), Athens, Greece, May 2024. pdf Amani Almalki and Longin Jan Latecki. Self-Supervised Learning with Masked Autoencoders for Teeth Segmentation from Intra-oral 3D Scans. IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), Waikoloa, Hawaii, January 2024. pdf More Publications: Google Scholar         or           Complete List of Publications (over 300) Current and past research topics include: ClimatePub4KG Shape Based Object Detection and Recognition Shape Similarity and Object Recognition Context Sensitive Shape Retrieval Results on MPEG-7 CE-Shape-1 MPEG-7 CE-Shape-1 Dataset Shape Based Image Search Engine Geometric Robot Mapping Skeleton Pruning Active Skeleton Demo Videos on Robot Mapping Video and Vision (ViVi) Lab, Video Summarization Well-Composed 3D Images Discrete Geometry and Digital Topology Data Mining Multimedia Transmission over IP Qualitative Spatial Reasoning Natural Language Semantics",
  "content_length": 2809,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:50"
}