{
  "name": "Long Lu",
  "homepage": "http://www.longlu.org",
  "status": "success",
  "content": "Long Lu Search Long Lu Associate Professor of Computer Science Northeastern University Long Lu is an Associate Professor in the Khoury College of Computer Sciences, a core faculty member of the Cybersecurity and Privacy Institute, and a co-director for the SecLab (Systems Security Lab), at Northeastern University. His research aims to secure low-level software in widely deployed or critical systems. He designs and builds novel program analysis and hardening techniques, hardware-backed primitives for security, and trusted/confidential computing environments. His recent work has focused on embedded and IoT/CPS systems. Long has won an NSF CAREER Award, an Air Force Faculty Fellowship, two Google ASPIRE Awards, etc. His research is supported by the National Science Foundation, the Office of Naval Research, the Army Research Office, etc. Interests System Software Security Program Analysis Embedded Systems, IoT/CPS Education Ph.D. in Computer Science, 2013 Georgia Institute of Technology B.S. in Information Security, 2007 Shanghai Jiao Tong University To prospective students and postdocs: I’m recruiting new Ph.D. students and postdocs. If you share my research interests, have solid experience in the related fields, and are passionate about making real impacts, please reach out. News Oct 2020 Google will sponsor our research on hardware-based memory safety via an ASPIRE Award. Sep 2020 NSF will fund our research on optimizing fuzzing for vulnerability coverage. Aug 2020 Two papers, FICS (finding bugs using your own code) and PTAuth (points-to authentication for temporal safety), are accepted by USENIX Security'21. Jun 2020 Our DICE paper, on DMA-enabled embedded firmware analysis, is accepted by S&P/Oakland'21. Jun 2020 I’m awarded (early) tenure at Northeastern. I couldn’t have done it without my students, collaborators, and family. Thank you all! See all news Recent Publications Mansour Ahmadi, Reza Mirzazade farkhani, Ryan Williams, Long Lu Aug 2021 USENIX Security Finding Bugs Using Your Own Code: Detecting Functionally-similar yet Inconsistent Code PDF Cite Code Reza Mirzazade farkhani, Mansour Ahmadi, Long Lu Aug 2021 USENIX Security PTAuth: Temporal Memory Safety via Robust Points-to Authentication PDF Cite Alejandro Mera, Bo Feng, Long Lu, Engin Kirda, William Robertson May 2021 S&P/Oakland DICE: Automatic Emulation of DMA Input Channels for Dynamic Firmware Analysis PDF Cite Bo Feng, Alejandro Mera, Long Lu Aug 2020 USENIX Security P2IM: Scalable and Hardware-independent Firmware Testing via Automatic Peripheral Interface Modeling PDF Cite Code Zhichuang Sun, Bo Feng, Long Lu, Somesh Jha May 2020 S&P/Oakland OAT: Attesting Operation Integrity of Embedded Devices PDF Cite Code See all publications Current Fundings Google Oct 2020 - Oct 2021 $130,000 Google ASPIRE Award National Science Foundation (NSF) Oct 2020 - Oct 2024 $600,000 Rethinking Fuzzing for Security Google Aug 2019 - Aug 2021 $80,000 Google ASPIRE Award PricewaterhouseCoopers (PwC) Oct 2018 - Oct 2021 $52,000 Internet-of-Things (IoT) and Cyber-Physical Systems (CPS) Security Office of Naval Research (ONR) Aug 2018 - Aug 2023 $3,496,687, incl. subcontracts Automated Protocol Specialization and Diversification for Individualized Defense See all fundings Contact l.lu@northeastern.edu (for Northeastern business) long@longlu.org (for non-Northeastern business) Public Keys 609 ISEC, 805 Columbus Ave., Boston, MA 02115 435 ISEC, 360 Huntington Ave., Boston, MA 02115 (for couriers) Cite × Copy Download",
  "content_length": 3523,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:49"
}