{
  "name": "Long-Kai Huang",
  "homepage": "https://long-kai.github.io",
  "status": "success",
  "content": "Long-Kai Huang Long-Kai Huang Google Scholar  /  Email: longkai [AT] comp.hkbu.edu.hk I am an Assistant Professor with Department of Computer Science at Hong Kong Baptist University. Previously, I was a Senior Research at Tencent AI Lab. I received my Ph.D. in Computer Science and Engineering from Nanyang Technological University (NTU) Singapore, supervised by Prof. Sinno Jialin Pan, and B.Eng. in Automation from Sun Yat-Sen University, where I did my undergraduate thesis under the supervision of Prof. Wei-Shi Zheng. My research focuses on foundational theory and applications of continual learning, meta-learning, and efficient pre-training and fine-tuning of LLMs. I am also interested in their applications to AI for science, particularly in drug discovery, protein design and single cell omics. I am looking for self-motivated PhD students for Spring/Fall 2026 and Research Assistants. If you are interested in machine learning, large language models (LLMs), or AI for scientific discovery, please feel free to email me your CV and transcript. News • [Sep 2025] One papers is accepted to NeurIPS 2025 • [May 2025] Two papers are accepted at ICML 2025! • [Jan 2025] Three papers are accepted to ICLR 2025, including one oral presentation! • [Dec 2024] One papers is accepted to AAAI 2025! • [Nov 2024] One papers is accepted to KDD 2025! • [Sep 2024] Two papers are accepted to NeurIPS 2024, including one spotlight presentation. • [May 2024] Honored to receive the ICLR 2024 Outstanding Paper Award Honorable Mention! Publications | Publications by Topic | Google Scholar * indicates equal contributions; † indicates corresponding authors. Conference Papers 29. Model Editing for Vision Transformers Xinyi Huang, Kangfei Zhao, Long-Kai Huang† In Advances in Neural Information Processing Systems (NeurIPS) , 2025 28. Steering Protein Language Models Long-Kai Huang, Rongyi Zhu, Bing He, Jianhua Yao In International Conference on Machine Learning (ICML) , 2025 27. IBCircuit: Towards Holistic Circuit Discovery with Information Bottleneck Tian Bian, Yifan Niu, Chaohao Yuan, Chengzhi Piao, Bingzhe Wu, Long-Kai Huang, Yu Rong, Tingyang Xu, Hong Cheng, Jia Li In International Conference on Machine Learning (ICML) , 2025 26. SD-LoRA: Scalable Decoupled Low-Rank Adaptation for Class Incremental Learning Yichen Wu*, Hongming Piao*, Long-Kai Huang†, Renzhen Wang, Wanhua Li, Hanspeter Pfister, Deyu Meng, Kede Ma†, Ying Wei† In International Conference on Learning Representations (ICLR) , 2025 (Oral) 25. Parameter and Memory Efficient Pretraining via Low-rank Riemannian Optimization Zhanfeng Mo, Long-Kai Huang, Sinno Jialin Pan In International Conference on Learning Representations (ICLR) , 2025 24. Atomas: Hierarchical Adaptive Alignment on Molecule-Text for Unified Molecule Understanding and Generation Yikun Zhang, Geyan Ye, Chaohao Yuan, Bo Han, Long-Kai Huang, Jianhua Yao, Wei Liu, Yu Rong In International Conference on Learning Representations (ICLR) , 2025 23. Spurious Feature Eraser: Stabilizing Test-Time Adaptation for Vision-Language Foundation Model Huan Ma, Yan Zhu, Changqing Zhang, Peilin Zhao, Baoyuan Wu, Long-Kai Huang, Qinghua Hu, Bingzhe Wu In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI) , 2025 22. Annotation-guided protein design with multi-level domain alignment Chaohao Yuan, Songyou Li, Geyan Ye, Yikun Zhang, Long-Kai Huang, Wenbing Huang, Wei Liu, Jianhua Yao, Yu Rong In Proceedings of ACM SIGKDD Conference on Knowledge Discovery and Data (KDD) , 2025 21. Learning Where to Edit Vision Transformers Yunqiao Yang, Long-Kai Huang†, Shengzhuang Chen, Kede Ma, Ying Wei† In Advances in Neural Information Processing Systems (NeurIPS) , 2024 20. Towards Understanding Evolving Patterns in Sequential Data Qiuhao Zeng, Long-Kai Huang, Xi Chen, Charles Ling, Boyu Wang In Advances in Neural Information Processing Systems (NeurIPS) , 2024 (Spotlight) 19. Mitigating Catastrophic Forgetting in Online Continual Learning by Modeling Previous Task Interrelations Via Pareto Optimization Yichen Wu*, Hong Wang*, Peilin Zhao, Yefeng Zheng, Ying Wei†, Long-Kai Huang† In International Conference on Machine Learning (ICML) , 2024 18. Meta Continual Learning Revisited: Implicitly Enhancing Online Hessian Approximation via Variance Reduction Yichen Wu, Long-Kai Huang†, Renzhen Wang, Deyu Meng, Ying Wei† In International Conference on Learning Representations (ICLR) , 2024 (Oral, Outstanding Paper Award Honorable Mention) 17. Latent Trajectory Learning for Limited Timestamps under Distribution Shift over Time Qiuhao Zeng, Changjian Shui, Long-Kai Huang, Peng Liu, Xi Chen, Charles Ling, Boyu Wang In International Conference on Learning Representations (ICLR) , 2024 (Oral) 16. Retaining Beneficial Information from Detrimental Data for Neural Network Repair Long-Kai Huang, Peilin Zhao, Junzhou Huang, Sinno Jialin Pan In Neural Information Processing Systems (NeurIPS) , 2023 15. Secure Out-of-Distribution Task Generalization with Energy-Based Models Shengzhuang Chen, Long-Kai Huang, Jonathan Richard Schwarz, Yilun Du, Ying Wei In Neural Information Processing Systems (NeurIPS) , 2023 14. Concept-wise Fine-tuning Matters in Preventing Negative Transfer Yunqiao Yang, Long-Kai Huang, Ying Wei In International Conference on Computer Vision (ICCV) , 2023 13. DrugOOD: Out-of-Distribution Dataset Curator and Benchmark for AI-Aided Drug Discovery–a Focus on Affinity Prediction Problems with Noise Annotation Yuanfeng Ji, Lu Zhang, Jiaxiang Wu, Bingzhe Wu, Lanqing Li, Long-Kai Huang, Tingyang Xu, Yu Rong, Jie Ren, Ding Xue, Houtim Lai, Wei Liu, Junzhou Huang, Shuigeng Zhou, Ping Luo, Peilin Zhao, Yatao Bian In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI) , 2023 12. Improving Task-Specific Generalization in Few-Shot Learning via Adaptive Vicinal Risk Minimization Long-Kai Huang, Ying Wei In Neural Information Processing Systems (NeurIPS) , 2022 11. Adversarial Task Up-sampling for Meta-learning Yichen Wu, Long-Kai Huang†, Ying Wei† In Neural Information Processing Systems (NeurIPS) , 2022 10. Frustratingly Easy Transferability Estimation Long-Kai Huang , Junzhou Huang, Yu Rong, Qiang Yang, Ying Wei In International Conference on Machine Learning (ICML) , 2022 9. Fine-Tuning Graph Neural Networks via Graph Topology Induced Optimal Transport Jiying Zhang, Xi Xiao, Long-Kai Huang, Yu Rong, Yatao Bian In International Joint Conference on Artificial Intelligence (IJCAI) , 2022 8. Functionally Regionalized Knowledge Transfer for Low-Resource Drug Discovery Huaxiu Yao, Ying Wei, Long-Kai Huang, Ding Xue, Junzhou Huang, Zhenhui Jessie Li In Neural Information Processing Systems (NeurIPS) , 2021 7. Improving Generalization in Meta-learning via Task Augmentation Huaxiu Yao*, Long-Kai Huang*, Linjun Zhang, Ying Wei, Li Tian, James Zou, Junzhou Huang, Zhenhui Li In International Conference on Machine Learning (ICML) , 2021 6. Communication-Efficient Distributed PCA by Riemannian Optimization Long-Kai Huang*, Sinno Jialin Pan In International Conference on Machine Learning (ICML) , 2020 5. Accelerate Learning of Deep Hashing With Gradient Attention Long-Kai Huang, Jianda Chen, Sinno Jialin Pan In International Conference on Computer Vision (ICCV) , 2019 4. Recurrent Knowledge Graph Embedding for Effective Recommendation Zhu Sun, Jie Yang, Jie Zhang, Alessandro Bozzon, Long-Kai Huang, Chi Xu In ACM Conference on Recommender Systems () (RecSys) , 2018 3. Class-Wise Supervised Hashing with Label Embedding and Active Bits Long-Kai Huang, Sinno Jialin Pan In International Joint Conference on Artificial Intelligence (IJCAI) , 2016 2. Online Hashing Long-Kai Huang, Qiang Yang, Wei-Shi Zheng In International Joint Conference on Artificial Intelligence (IJCAI) , 2013 1. Smart Hashing Update for Fast Response Qiang Yang, Long-Kai Huang, Wei-Shi Zheng In International Joint Conference on Artificial Intelligence (IJCAI) , 2013 Journal Papers 4. Improving Generalizability of Graph Anomaly Detection Models via Data Augmentation Shuang Zhou, Xiao Huang, Ninghao Liu, Huachi Zhou, Fu-Lai Chung, Long-Kai Huang† In IEEE Transactions on Knowledge and Data Engineering (TKDE) , 2023 3. Deep Domain Adversarial Neural Network for the Deconvolution of Cell Type Mixtures in Tissue Proteome Profiling Fang Wang*, Fan Yang*, Long-Kai Huang, Jiangning Song, Jiang Qian, Guohua Wang, Jianhua Yao. In Nature Machine Intelligence (Nature MI) , 2023 2. A Fast Online Spherical Hashing Method Based on Data Sampling for Large Scale Image Retrieval Zhenyu Weng, Yuesheng Zhu, Yinhe Lan, Long-Kai Huang In Neurocomputing , 2019 1. Online Hashing Long-Kai Huang, Qiang Yang, Wei-Shi Zheng In IEEE Transactions on Neural Networks and Learning Systems (TNNLS) , 2017 Awards • ICLR 2024 Outstanding Paper Award Honorable Mention • ICLR 2024 Outstanding Reviewer Source code of this website adapted from this page.",
  "content_length": 8908,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:49"
}