{
  "name": "Lonnie R. Welch",
  "homepage": "https://www.ohio.edu/engineering/about/people/profiles.cfm?profile=welch",
  "status": "success",
  "content": "Lonnie Welch | Ohio University Skip to main content Lonnie Welch Charles R. Jr. and Marilyn Stuckey Professor Stocker Center 354 Biomedical Engineering Electrical Engineering and Computer Science welch@ohio.edu 740.593.1575 Professor Lonnie R. Welch is the Stuckey Professor of Electrical Engineering and Computer Science at Ohio University, a member of the Graduate Faculties of the Biomedical Engineering Program and of the Molecular and Cellular Biology Program, director of the Bioinformatics Laboratory at Ohio University, and the founder and Chair of the Great Lakes Bioinformatics Conference (an official conference of the International Society on Computational Biology). His research has been sponsored by the National Human Genome Research Institute, the Ohio Plant Biotechnology Consortium, NASA, the National Science Foundation, the Defense Advanced Research Projects Agency, and the Ohio Board of Regents. He is the principal investigator of the $9M Bioinformatics Program of the Ohio Board of Regents. Dr. Welch is founder and co-chair of the ISMB Special Interest Group on Bioinformatics for Regulatory Genomics (BioRegSIG). Research Interests: Bioinformatics, Computational regulatory genomics, Machine learning, High performance computing All Degrees Earned: Ph.D., 1990, M.S.1987, B.S. 1985, Computer and Information Science, the Ohio State University. Patents: Program Control For Resource Management Architecture and Corresponding Programs, US patent application 09/864821, US patent no. 7,096,248, patent issued 08-2006. System for Monitoring and Reporting Performance of Hosts and Applications and Selectively Configuring Applications in a Resource Managed System, US patent application 09/864830, US patent number 7,051,098, patent issued 5-2006. Resource Allocation Decision Function for Resource Management Architecture and Corresponding Programs, US patent application 09/864825, pending approval. Awards: 2010 Alumnus of the Year, Claymont High School (for demonstrated lifetime leadership and abilities in chosen field) 2001 Stuckey Professorship, Ohio University (for outstanding accomplishments in research and teaching) 1998 Outstanding Young Faculty Member, University of Texas at Arlington 1998 Aegis Excellence Award, United States Navy (for contributions in dynamic resource management to the Navy's High Performance Distributed Computing (HiPer-D) and AdCon-21 projects) Journal Article, Academic Journal (74)Welch, L. An integrated bioinformatics approach to the discovery of cis-regulatory elements involved in plant gravitropic signal transduction, X. Liang, K. Shen, J. Lichtenberg, S.E. Wyatt, and L.R. Welch. International Journal of Computational Bioscience 1:33-54. 2010.Lichtenberg, J., Yilmaz, A., Seaman, J., Liang, X., Lee, S., Ecker, K., Grotewold, E., Welch, L. The Word Landscape of the Arabidopsis Genome. BMC Genomics.Welch, L., Welch, L., Drews, F. WordSeeker: Concurrent bioinformatics software for discovering genome-wide patterns and word-based genomic signatures. BMC Bioinformatics, 2010, 11(Suppl 12):S6.Welch, L. “Scalable parallel word search in multicore/multiprocessor systems,” Frank Drews, Jens Lichtenberg, Lonnie Welch. The Journal of Supercomputing 51(1):58-75. 2010 Jan.Welch, L. (2024). Closing the computational biology ‘knowledge gap’: Spanish Wikipedia as a case study. Bioinformatics; 40: i11-i19. https://watermark.silverchair.com/btae247.pdf?token=AQECAHi208BE49Ooan9kkhW_Ercy7Dm3ZL_9Cf3qfKAc485ysgAAA4MwggN_BgkqhkiG9w0BBwagggNwMIIDbAIBADCCA2UGCSqGSIb3DQEHATAeBglghkgBZQMEAS4wEQQMnS6FEx6qfQVF_vTYAgEQgIIDNlwGs_hL0DlrfQuJj8Tfa6uusuk_uuswFS7JIsDPht8oMcaWxIMYUEEMW3i0wOUJBm-lqO_GYg10TJAm9Sk0NU_EoxNdee_2-k8NtTDa09CqnMf57L-R8jV-SHEtoSVwyVWoS71q3zwZCKefEzRanlCVWZjhR0_LSxUza-YR8BjfTZ8GfjuL4Agp1wyDZt0kTShhOFlmqjYoVUzCC2_et0oyiqoCKU3cYMTrSbrWeIN2udOKDcaqS3cr9pFBC6SWWvY8Fo55ERA9HzJhnZ9bNsYsEBNWd1BwlYacD0M6QhPIQRH80Dcdyi1Jk0d2zi3yi-KdiJmsHjNAEe5Q2pYclKNHeuYZP31nZDBkwWsKSl2Bna6iW94x-eil61bPYtCvcjp23rH2WFjtjlGTftmpyKCqycsGoPv-ZAQRxHDUl3wtQGpXAgtREOIUiHk_vn1mCFIXdBBBiESz1CK0Zosx_iH6iSx8b8JNoBPmUIE5bY_w0kzkaJKtBO6dxm0U5P1Rmpb5XKLcK0hK4ekncq5H01FTBP6rsvxEM25L8yH_y1-J-vOH9awrGQnM7zFH1c2u9HtZAuO2y9gvPDik8iiTzJTghCy35UZHQkF1zMa3dwpzvzrfr9k0RlQBMt52tPN8pfUeVN6uj2tdiQMmNSPVw3TPBzvaEsps-doIBMZqqDWuIaJGRqyR82CRJ3YE-UHUck89gNohesM12y9OOCpm526Q47UnCZ9VpLgORDyJKjDA-sNfTwex6z-kHGXNt5A7JxsYIzFjjR6ftuziSY4MAjH_WOk9pXBAdzFB7lwGUSG5_xU2Q5n-Z8nSOeEngeQhO1jMawObCvUzhs8V7euiDFpBOZDyRz34hJ3BBZfJfZKfs-WfsPOWBIQavEyomEed9Q5h22kYMKKEBusGzvkXaIzRIqbUZSfaSyk4HShgdhgAp3Y-QDQfUVAoeQkydudhygnakaw6HBeP9SkMc3lfB2r7l3GLBdaUfBlvxInjlnuN6z-BZjCxGDZAIVCyYFX8GTPgASAf_-vAi9Fqm_5ywJn3HN-iQlpWoQ1reYOJhG10QXkYsZzvCVbVfEsZk84IISRj3aWePw.Welch, L., Baugher, C., Zhang, Y., Davis, T., Li, Y. (2023). Multiplex-GAM: genome-wide identification of chromatin contacts yields insights overlooked by Hi-C. 7. Nature Methods; 20: 1037-1047. https://www.nature.com/articles/s41592-023-01903-1.Kilpatrick, A., Rahman, F., Anjum, A., Welch, L. (2022). Characterizing domain-specific open educational resources by linking ISCB Communities of Special Interest to Wikipedia. 38. Bioinformatics; i19-i27.Winick-Ng, W., Kukalev, A., Harabula, I., Redondo, L., Szabo, D., Meijer, M., Serebreni, L., Zhang, Y., Bianco, S., Chiariello, A., others, . (2021). Cell-type specialization in the brain is encoded by specific long-range chromatin topologies. bioRxiv; 2020--04.Beagrie, R., Thieme, C., Annunziatella, C., Baugher, C., Zhang, Y., Schueler, M., Kukalev, A., Kempfer, R., Chiariello, A., Bianco, S., others, . (2021). Multiplex-GAM: genome-wide identification of chromatin contacts yields insights not captured by Hi-C. bioRxiv; 2020--07.Winick-Ng, W., Kukalev, A., Harabula, I., Zea-Redondo, L., Szabó, D., Meijer, M., Serebreni, L., Zhang, Y., Bianco, S., Chiariello, A., Irastorza-Azcarate, I., Thieme, C., Sparks, T., Carvalho, S., Fiorillo, L., Musella, F., Irani, E., Triglia, E., Kolodziejczyk, A., Abentung, A., Apostolova, G., Paul, E., Franke, V., Kempfer, R., Akalin, A., Teichmann, S., Dechant, G., Ungless, M., Nicodemi, M., Welch, L., Castelo-Branco, G., Pombo, A. (2021). Cell-type specialization is encoded by specific chromatin topologies.. 7886. Nature; 599: 684-691.Li , Y., Jaiswal, S., Kaur, R., Alsaadi, D., Liang, X., Drews, F., DeLoia, J., Krivak, T., Petrykowska, H., Gotea, V., Welch, L., Elnitski, L. (2021). Differential gene expression identifies a transcriptional regulatory network involving ER-alpha and PITX1 in invasive epithelial ovarian cancer.. 1. BMC cancer; 21: 768.Li , Y., Mullin, M., Zhang, Y., Drews, F., Welch, L., Showalter, A. (2020). Identification of Cis-Regulatory Sequences Controlling Pollen-Specific Expression of Hydroxyproline-Rich Glycoprotein Genes in Arabidopsis thaliana.. 12. Plants (Basel, Switzerland); 9.Grote, A., Li , Y., Liu, C., Voronin, D., Geber, A., Lustigman, S., Unnasch, T., Welch, L., Ghedin, E. (2020). Prediction pipeline for discovery of regulatory motifs associated with Brugia malayi molting.. 6. PLoS neglected tropical diseases; 14: e0008275.Foster, J., Grote, A., Mattick, J., Tracey, A., Tsai, Y., Chung, M., Cotton, J., Clark, T., Geber, A., Holroyd, N., Korlach, J., Li , Y., Libro, S., Lustigman, S., Michalski, M., Paulini, M., Rogers, M., Teigen, L., Twaddle, A., Welch, L., Berriman, M., Dunning Hotopp, J., Ghedin, E. (2020). Sex chromosome evolution in parasitic nematodes of humans.. 1. Nature communications; 11: 1964.Li , Y., Liu, Y., Juedes, D., Drews, F., Bunescu, R., Welch, L. (2020). Set cover-based methods for motif selection.. 4. Bioinformatics (Oxford, England); 36: 1044-1051.Liu, X., McKenna, S., Welch, L., Showalter, A. (2020). Bioinformatic Identification of Plant Hydroxyproline-Rich Glycoproteins.. Methods in molecular biology (Clifton, N.J.); 2149: 463-481.Williams, J., Drew, J., Galindo-Gonzalez, S., Robic, S., Dinsdale, E., Morgan, W., Triplett, E., Burnette, III, J., Donovan, S., Fowlks, E., Goodman, A., Grandgenett, N., Goller, C., Hauser, C., Jungck, J., Newman, J., Pearson, W., Ryder, E., Sierk, M., Smith, T., Tosado-Acevedo, R., Tapprich, W., Tobin, T., Toro-Martínez, A., Welch, L., Wilson, M., Ebenbach, D., McWilliams, M., Rosenwald, A., Pauley, M. (2019). Barriers to integration of bioinformatics into undergraduate life sciences education: A national study of US life sciences faculty uncover significant barriers to integrating bioinformatics into undergraduate instruction. 11. Public Library of Science; 14: 1-19. https://doi.org/10.1371/journal.pone.0224288.Li, Y., Liu, Y., Juedes, D., Drews, F., Bunescu, R., Welch, L. (2019). Set cover-based methods for motif selection. . Bioinformatics/Oxford University Press.Wilson Sayres, M., Hauser, C., Sierk, M., Robic, S., Rosenwald, A., Smith, T., Triplett, E., Williams, J., Dinsdale, E., Morgan, W., Burnette, III, J., Donovan, S., Drew, J., Elgin, S., Fowlks, E., Galindo-Gonzalez, S., Goodman, A., Grandgenett, N., Goller, C., Jungck, J., Newman, J., Pearson, W., Ryder, E., Tosado-Acevedo, R., Tapprich, W., Tobin, T., Toro-Martínez, A., Welch, L., Wright, R., Barone, L., Ebenbach, D., McWilliams, M., Olney, K., Pauley, M. (2018). Bioinformatics core competencies for undergraduate life sciences education. 6. PLOS ONE; 13: 1-20. https://doi.org/10.1371/journal.pone.0196878.Spiller, S., Li, Y., Blüher, M., Welch, L., Hoffmann, R. (2018). Diagnostic Accuracy of Protein Glycation Sites in Long-Term Controlled Patients with Type 2 Diabetes Mellitus and Their Prognostic Potential for Early Diagnosis. Pharmaceuticals; 11: 38.Mulder, N., Schwartz, R., Brazas, M., Brooksbank, C., Gaeta, B., Morgan, S., Pauley, M., Rosenwald, A., Rustici, G., Sierk, M., Warnow, T., Welch, L. (2018). The development and application of bioinformatics core competencies to improve bioinformatics training and education. 2. PLOS Computational Biology; 14: 1-14. https://doi.org/10.1371/journal.pcbi.1005772.Lee, K., Sharma, R., Gase, G., Ussar, S., Li , Y., Welch, L., Berryman, D., Kispert, A., Bluher, ",
  "content_length": 59609,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:50"
}