{
  "name": "Lora Oehlberg",
  "homepage": "http://cpsc.ucalgary.ca/~lora.oehlberg",
  "status": "success",
  "content": "Lora Oehlberg, University of Calgary Lora Oehlberg University of Calgary CPSC iLab Associate Professor Department of Computer Science University of Calgary Director Computational Media Design Program Contact lora.oehlberg@ucalgary.ca Publications ACM Profile Google Scholar Profile My research in Human-Computer Interaction focuses on interactive tools and technologies that support creativity, innovation, and multi-disciplinary collaboration in domains such as interaction design, maker communities, sustainable product design and health care. I also explore interaction design theory and methodology— theoretical frameworks and techniques that allow computer scientists and interaction designers to understand and empathize with end-users, express and embody design ideas, and engage with collaborators beyond computing disciplines. My main research themes are human-computer interaction, creativity & cognition, information visualization, and computer-supported cooperative work. I am a member of the iLab—a human-computer interaction research lab—and of Ward of the 21st Century (W21C)—a non-profit research and innovation initiative to design and develop better health care services. I additionally supervise students in the Computational Media Design (CMD) program. I was an INRIA Silicon Valley Post-Doctoral Researcher with Wendy Mackay in Saclay, France. I recieved my Ph.D. in Mechanical Engineering from the University of California, Berkeley where I worked with Alice Agogino, Sara Beckman, and Björn Hartmann. I also recieved a M.S. in Mechanical Engineering from Berkeley, and a B.S. in Mechanical Engineering from Stanford University. Applying for a PhD or Master's in HCI at Calgary? Interested in Undergraduate Research? Please read my Frequently Asked Questions before contacting me!",
  "content_length": 1802,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:53"
}