{
  "name": "Lorenzo Bruzzone",
  "homepage": "https://rslab.disi.unitn.it",
  "status": "success",
  "content": "RSLab :::: MENU :::: First radargram from Juice’s RIME instrument Crop mapping for food security TOP RSLab News Jing Zhang got PhD On June 18, Jing Zhang has succesfully defended her PhD Thesis on \"Semantic Change Detection in Multitemporal Remote Sensing Images Read more PhD positions @ RSLab RSLab is looking for strongly motivated candidate PhD students having excellent study career and interested in research activities in artificial Read more RIME Achieves Major Milestone with First Focused Radargram A major milestone has been reached by RIME (Radar for Icy Moon Exploration), the radar sounder aboard ESA’s JUICE (JUpiter Read more 2025 RIME Science Team Meeting On May 5–6, 2025, the RIME (Radar for Icy Moons Exploration) Science Team gathered to review progress and plan next Read more Raktim Ghosh got PhD On April 17, Raktim Ghosh has succesfully defended cum laude his PhD Thesis on \"Novel Architectures for Radar Sounder Signals Read more Best PhD Theses Khatereh Meshkini received the 2024 “Frank Marzano” award for the Best Italian PhD Theses on Geoscience and Remote Sensing by Read more Annual review of the ESA CCI + HRLC project! The HRLC CCI studies and investigates the role of the spatial resolution of land cover and land cover change in Read more RSLab numbers in 2024 The 2024 was a very dense and exciting year at RSLab UniTrento with different activities on both Earth Observation and Read more Higly Citated Researcher 2024 Lorenzo Bruzzone has been recognized for the third consecutive year as a Highly Cited Researher by Clarivariate for 2024. Each Read more 1 2 3 … 9 Next » Remote Sensing Laboratory Dipartimento di Ingegneria e Scienza dell'Informazione Università degli Studi di Trento Contact person: prof. Lorenzo Bruzzone Follow us: RSLab UniTrento @RSLabUniTrento Categories Honors and Awards News Press Uncategorized Tags AI ASI big data Change Detection climate change conference Crop type mapping deep neural network Earth Observation Envision ESA European Commission Glaciers GRSS IEEE IGARSS JUICE jupiter Land Cover moon multitemp NASA phd projects Radar RIME space SPIE Venus We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. Close GDPR Cookie Banner Accept Reject Close GDPR Cookie Banner Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Additional Cookies Powered by  GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Additional Cookies This website uses the following additional cookies: Cookie Name Default expiration time Description _ga 2 years Used to distinguish users. _gid 24 hours Used to distinguish users. _gat 1 minute Used to throttle request rate. If Google Analytics is deployed via Google Tag Manager, this cookie will be named _dc_gtm_<property- id>. AMP_TOKEN 30 seconds to 1 year Contains a token that can be used to retrieve a Client ID from AMP Client ID service. Other possible values indicate opt-out, inflight request or an error retrieving a Client ID from AMP Client ID service. _gac_<property-id> 90 days Contains campaign related information for the user. If you have linked your Google Analytics and Google Ads accounts, Google Ads website conversion tags will read this cookie unless you opt-out. Learn more. Enable or Disable Cookies Enabled Disabled Enable All Save Settings",
  "content_length": 3879,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:55"
}