{
  "name": "Lorie M. Liebrock",
  "homepage": "https://www.cs.nmt.edu/~liebrock",
  "status": "success",
  "content": "L.M. Liebrock Department of Computer Science and Engineering Dr. Lorie M. Liebrock Professor, CSE Director, Cybersecurity Centers Phone (505) 835-6729 (only during CSE Office hours; otherwise call 575-835-5481) Email lorie.liebrock at nmt.edu Travel I am frequently on travel so please contact Karen to get on my schedule. Department Computer Science & Engineering CSE Office Cramer 210B CSE Office Hours: see www.nmt.edu/nmt-grad-staff See Office Hours For an appointment call Karen at 575-835-5513. Grad Office Fidel 280 Graduate Office Hours: See Office Hours For an appointment call Karen at 575-835-5513. Research Interests Cybersecurity, Graphics and Visualization, Parallel Processing, and Well Posedness Analysis Background B.S. and M.S., Michigan Technological University M.S. and Ph.D., Rice University Recommendations Before requesting any recommendation, complete the required consent form. Selected Research Interests Lorie Liebrock's research interests focus on issues related to parallel computing. One long term focus is on using problem topology during compilation. In particular, the use of topology to automate data distribution and allow application of regular application optimizations to partially regular problems. She has developed algorithms for automatic distribution of irregularly coupled regular mesh (a.k.a. composite grid or multiblock) problems, e.g., aircraft aerodynamics and water-cooled nuclear reactor simulations, via the use of problem topology. For use with these automatic distribution algorithms, she has developed a program template and a set of style guidelines for these applications that allow automatic transformation of an application code with no notion of data distribution into a standard High Performance Fortran program with complete distribution specification. Adaptive parallelization is another aspect of her research. She is working with Pat Teller at University of Texas in El Paso to explore how to adapt parallel applications to new and/or changing parallel environments. By looking at a number of applications, tools that span a variety of uses will be developed to support building adaptive parallel applications. Well posedness is another aspect of computation that she is exploring. She has done a preliminary well posedness analysis of the automatic data distribution problem. She is also exploring sensitivity analysis (aka stability in well posedness analysis) for complex additive systems with ICASA. Selected Publications (available electronically) M. Schwartz, C. Hash, and L.M. Liebrock. Term Distribution Visualizations with a Focus+Context Model. New Mexico Institute of Mining and Technology Technical Report, May 2008. L.M. Liebrock, Y. Ye, R.N. Ande, and P.R.C. Ming. Distributing Data in Composite Grid Application for Grid Computing. International Parallel and Distributed Processing Symposium, High Performance Grid Computing Workshop, Santa Fe, NM, April 26-30, 2004. L.M. Liebrock, H. Clausen, and K. Bondili Analysis of the Security of Web Browsers via API Calls and Function Return Values , technical report, 2004 L.M. Liebrock and R.K.R. Mudhiganti. Preliminary Development of Computational Sensitivity Analysis, technical report, 2004 L.M. Liebrock and D.L. Hicks and K.W. Kennedy and J.J. Dongarra. Using Problem and Algorithm Topology in Parallelization. Technical Report, August 1991. L.M. Liebrock and K. Kennedy. Parallelization of Linearized Applications in Fortran D. Proceedings of International Parallel Processing Symposium, April 1994. (A more complete technical report is also available.) L.M. Liebrock and K. Kennedy. Modeling Parallel Computation. Technical Report, September 1994. L.M. Liebrock and K. Kennedy. Automatic Data Distribution of Large Meshes in Coupled Grid Problems. Technical Report, September 1994. L.M. Liebrock and K. Kennedy. Automatic Data Distribution of Small Meshes in Coupled Grid Problems. Technical Report, September 1994. L.M. Liebrock. Using Problem Topology in Parallelization. Technical Report, September 1994. Vitae Resume. Publications. Information Technology Program Website Computer Science Department Website Institute for Complex Additive Wood Craft of Michigan Ergonomic hardwood computer furniture. (updated Aug. 2011)",
  "content_length": 4256,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:59"
}