{
  "name": "Lori L. Pollock",
  "homepage": "https://www.eecis.udel.edu/~pollock",
  "status": "success",
  "content": "Lori L. Pollock JavaScript is required to properly view this page. Please enable JavaScript to navigate this site. My UD UDSIS-Students UDSIS-Staff People Maps Find It A-Z Z Y X W V U T S R Q P O N M L K J I H G F E D C B A UD Home CIS Pollock Lori L. Pollock Alumni Distinguished Professor Computer and Information Sciences Pollock  | Research | Teaching  | Vita • Vita • Links • Photos Fall 2020 Office Hours: Email to set up a zoom call. Lori Pollock is a Professor in the Department of Computer and Information Sciences at the University of Delaware. She was named Alumni Distinguished Professor in 2016. She earned her Ph.D. and M.S. in Computer Science at the University of Pittsburgh in 1986 and 1983, respectively, and her B.S. in Computer Science and Economics at Allegheny College in 1981. Her research currently focuses on helping software engineers maintain and test their large software systems, as well as computer science education. Her research has been continuously supported through the years by numerous grants from the National Science Foundation and the Army Research Laboratory. She is coauthor of 7 best paper awards and one influential paper award since 2010. She served as an Associate Editor for the ACM Transactions on Software Engineering and Methodology (TOSEM). She regularly serves as a program committee member and reviewer for the major conferences and journals in software engineering, programming language design and implementation, and computer science education. She served on the executive committee and as an officer of ACM SIGPLAN for several terms. Lori Pollock teaches courses primarily in compiler construction, automatic program analysis and transformation, software testing, communication skills for CS researchers, and introduction to undergraduate research. She was awarded the University of Delaware's Excellence in Teaching Award in 2001, ACM SIGSOFT Influential Educator in 2016, and 2018 NCWIT Undergraudate Research Mentoring Award. She currently serves as Cochair of the CRA Education Committee. Lori Pollock has actively worked for improving the participation of women and other underrepresented groups in computer science for many years. She was awarded the University of Delaware's E. A. Trabant Award for Women's Equity in 2004, and 2017 UD College of Engineerin Deans Award for Excellence in Service and Community Engagement. She serves on the Executive Board of the Computing Research Association's Committee on the Status of Women in Computing (CRA-W), which was honored with the National Science Board's 2005 Public Service Award to an organization for increasing the public understanding of science or engineering. Campus Voices Radio Interview Fall 2012 At the Delaware Governor's signing of CS in high schools News Journal Article ACM Tech News NSF IUSE-funded Project on Integrating Computational Thinking into UD General Education Courses Partner4CS Project Named Professor Article Some of my other fun activities: Study Abroad in New Zealand with CISC - Winter 2019 and 2017 436 Smith Hall, Computer and Information Sciences  • University of Delaware  • Newark, DE 19716  • USA Phone: 302-831-1953  •  Fax: 302-831-8458 • Email: my last name@udel.edu Comments Contact UD Legal Notices",
  "content_length": 3251,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:57"
}