{
  "name": "Lorne Olfman",
  "homepage": "https://www.cgu.edu/people/lorne-olfman",
  "status": "success",
  "content": "Lorne Olfman, Professor Emeritus, Center for Information Systems & Technology Emaillorne.olfman@cgu.edu CVDownload (PDF) DegreesPhD, Indiana University MBA, Indiana University MA, Economics, The University of Calgary B.Sc., Computing Science, The University of Calgary Research InterestsUser training, E-Learning systems, Knowledge management, Social technologies for group work Lorne Olfman is a professor emeritus in the Center for Information Systems & Technology (CISAT) at Claremont Graduate University. Olfman’s research interests included: how software can be learned and used in organizations, the impact of computer-based systems on knowledge management, and the design and adoption of systems used for group work. Olfman received his MBA and PhD from Indiana University before coming to CGU. He was on the CISAT faculty for 33 years. Along with Terry Ryan, Olfman co-directed the Social Learning Software Lab ([SL]2). Their new endeavor, along with Wallace Chipidza, is TwIST. A key component of Olfman’s teaching is his involvement with doctoral students; he has supervised 73 students to completion and has served on 100 other completed dissertation committees. As an active member of the information systems community, Olfman has co-authored 168 refereed articles, including 60 in journals, 28 as book chapters, and 80 as conference papers. He is a senior editor of the AIS Transactions on Human Computer Interaction. Olfman was also co-chair of the doctoral consortium for the 2009 Americas Conference on Information Systems. Olfman’s recent articles include “DRT – A novel tool for data archiving” in IEEE Software (2020) and “Tailored motivational messages for an mHealth Sleep Behavioral Change Support System to promote CPAP use among OSA patients: Development, content validation and testing” in JMIR Mhealth Uhealth (2020). Co-authored with Sarah Alismail. “Tailored motivational messages for an mHealth Sleep Behavioral Change Support System to promote CPAP use among OSA patients: Development, content validation and testing.” JMIR Mhealth Uhealth, (2020). Co-authored with Kevin Williams and Yan Li. “DRT – A novel tool for data archiving.” IEEE Software, (2020). Co-authored with Wallace Chipidza, et al. “All together now: A framework for research on mob programming.” Proceedings of 2020 Americas Conference on Information Systems. 2020. Co-authored with Chris Njunge, et al. “Home field advantage in Major League Soccer.” Proceedings of 2020 Americas Conference on Information Systems. 2020. Co-authored with Nimer Alrushiedat. “Experience with using anchored asynchronous online discussions in business analytics courses.” Proceedings of the 2019 Americas Conference on Information Systems. 2019. Co-authored with Pornpat Sirithumgu et al. “An ontology-based framework as a foundation of an information system for generating multiple-choice questions.” Proceedings of the 2019 Americas Conference on Information Systems. 2019. Co-authored with Daniel Firpo et al. “System design for an online social networking app with a notification and recommender system to build social capital in a university setting.” Proceedings of the Fifty-Second Annual Hawaii International Conference on System Sciences. 2019. Co-authored with Tai-Yin Chi and Dale E. Berger. “Computer skill acquisition: The effects of computer-aided self-explanation on knowledge retention and transfer.” Proceedings of the Fiftieth Annual Hawaii International Conference on System Sciences. 2017. Co-authored with Kamla Al-Busaidi. “Knowledge sharing through inter-organizational knowledge sharing systems.” VINE Journal of Information and Knowledge Management Systems 47, no. 1 (2017): 110-36. Co-authored with Victor Cordes. “Sports analytics: Predicting athletic performance with a genetic algorithm.” Proceedings of the 22nd Americas Conference on Information Systems. 2016. Co-authored with Xinwei Yuan and Jingbing Yi. “How do institution-based trust and interpersonal trust affect interdepartmental knowledge sharing.” Information Resources Management Journal 29, no. 1 (2016): 15-38.",
  "content_length": 4083,
  "method": "requests",
  "crawl_time": "2025-12-01 13:47:59"
}