{
  "name": "Lorrie Cranor",
  "homepage": "http://lorrie.cranor.org",
  "status": "success",
  "content": "Lorrie Faith Cranor's Home Page This page: Contact | News | Research | Publications | Affiliations | Teaching | Students | Consulting | Personal Elsewhere: Blog | Garment sewing blog posts | Bio | Resume | Press | Videos | Columns | Quilts | Photos | Academic genealogy | Everything else Lorrie Faith Cranor Director and Bosch Distinguished Professor in Security and Privacy Technologies, CyLab Security and Privacy Institute FORE Systems University Professor, Computer Science and Engineering & Public Policy Director, CyLab Usable Privacy and Security Laboratory Co-director, MSIT-Privacy Engineering masters program Contact mailing address: Carnegie Mellon University, CIC 2107, 4720 Forbes Avenue, Pittsburgh, PA 15213 office: CIC 2107 (4720 Forbes Ave [directions]) phone: 412-268-7534 (I rarely check voice mail) email: lorrie AT cmu DOT edu administrative assistant: Allison Fatla afatla@andrew.cmu.edu How should you address me? Professor Cranor and Dr. Cranor are both fine if this is a professional context where titles are used. Outside of professional contexts you may use Dr. Cranor or Ms. Cranor. Please do not address me as Mrs. Cranor in any context. If we're not using titles, then Lorrie is just fine. If you can't decide whether to be formal or not, Professor Lorrie will also do. I use my full name Lorrie Faith Cranor in my publications, but no need to include my middle name elsewhere. Pronouns: she/her. Important information for prospective students and visitors Research focus Usable privacy and security, technology and public policy - See the CyLab Usable Privacy and Security Laboratory website for more information or watch a short video about my research Highlights Illustrating Privacy Engineering Concepts with Potty Talk - 20-minute talk I presented at the 2021 Conference on Privacy Engineering Practice and Respect (PEPR) - See also my potty page My IEEE Security and Privacy podcast with Bob Blakely - Over the Rainbow 2019 McKelvey School of Engineering Alumni Achievement Award video Lots of videos and news articles Advice for women in computer science: An interview I did with students from the CMU women@scs organization Tales from an Accidental Computer Science Professor - 60 minute talk plus questions, Indiana University, February 8, 2018 Read about CMU research on usable and secure passwords CBS Sunday Morning video featuring me and my password dress - also text version The now-famous password dress, the companion security blanket quilt that was featured in Science Magazine, the CNET article, password chairs and more and you can order the fabric and ties and read about our passwords research My Tech@FTC blog post Time to rethink mandatory password changes Watch my 5-minute Davos video on Personal Privacy Assistants and the Internet of Things, and read my trip report Check out our Privacy Illustrated website featuring illustrations of privacy from kindergartners through adults My TEDxCMU 2014 talk on passwords (as featured on Delta Airlines Inflight Entertainment) A 60-minute presentation I gave in Fall 2013: Computers, Quilts, and Privacy Current projects usable privacy choices, Usable Privacy Policy Project, usable and secure passwords, privacy decision making, user-controllable security and privacy, usable cyber trust indicators Previous research anti-phishing, P3P, electronic voting, and security vulnerabilities in movie distribution Publications See Publications section of my resume (sorted by publication type) CUPS website publication list (sorted by topic, includes other peoples' publications as well) My CMU Scholars page My Google Scholar page My ACM Digital Library author page My dblp page CMU affiliations Software and Societal Systems Department (S3D) in the School of Computer Science Engineering and Public Policy department in the College of Engineering CyLab Usable Privacy and Security Laboratory (CUPS) (director) in CyLab MSIT-Privacy Engineering masters program (co-director) Ph.D. Program in Societal Computing Electrical & Computer Engineering Department (affiliate faculty) Human-Computer Interaction Institute (affiliate faculty) Heinz College (affiliate faculty) (former) Founding Co-Director, Collaboratory Against Hate: Research and Action Center STUDIO for Creative Inquiry (former fellow and member of Deep Lab) Other affiliations Center for Distributed Confidential Computing (CDCC) - NSF funded project with IU, Purdue, CMU, OSU, Spelman, Duke, Yale, and Penn State Center for Democracy and Technology (CDT) - Board of Directors, 2024- Electronic Privacy Information Center (EPIC) - Advisory Board Member, 2024- Aspen US Cybersecurity Group Consumer Reports Innovation - Advisor Computing Research Association Board of Directors, 2019-2025 ELATE Fellow, 2014-15 Electronic Frontier Foundation Board of Directors, 2007-2015 The Future of Privacy Forum Advisory Board, 2009-2015, 2017- Deep Lab, Founding member Wombat Security Technologies, co-founder AT&T Labs-Research, 1996 - 2003 Teaching 17-734 / 17-334 [previously 08-534 / 08-734 ] / 5-436 / 5-836 / 19-534 / 19-734 Usable Privacy and SecuritySP23, SP22, SP21, SP20, SP19, SP18, SP17, SP15, SP14, FA11, FA09, SP08, SP07, SP06 17-733 /17-333 [previously 8-533 / 8-733] / 19-608 / 95-818: Privacy Policy, Law, and Technology FA15,FA14, FA13, FA10,FA08, FA07, FA05, FA04, SP04 8-602: Current Topics in Privacy SeminarFA13, FA14, FA15, SP17, SP18 8-606 Privacy by Design Workshop / 8-607 Privacy by Design Practicum FA17, Summer15, Summer14 15-290 / 17-290 / 19-211: Special Topics: Computers and SocietySP07, SP06, SP05 EPP Undergraduate ProjectSP09 Carrying Capacity, SP10 Privacy, SP11 Green Printing, SP12 Emergency Messaging with Social Media COS PhD seminarSP06, FA05, SP05, FA04 08-709 Privacy Technology (MSIT eBusiness Program)SP15, SP14, SP13, SP12, SP11, SP10, SP09, SP08, SP07, SP06 Students Current PhD Students: Wendy Bickersteth (Societal Computing), Elijah Bouma-Sims (Societal Computing), Lily Klucinec (Societal Computing), Alexandra Li (Societal Computing), Megan Li (Societal Computing), Veronica Lin (Societal Computing), Alexandra Nisenoff (Societal Computing), Ginger Smith (EPP) Graduated PhD Students (advisor): Rebecca Balebako (EPP PhD 2014), Cristian Bravo Lillo (EPP PhD 2014), Jessica Colnago (Societal Computing PhD 2021 co-advisor with A. Acquisti), Kyle Crichton (EPP PhD 2023 co-advisor with N. Christin), Serge Egelman (COS PhD 2009), Pardis Emami-Naeini (Societal Computing PhD 2020 co-adivsor with Y. Agarwal), Andy Gallardo (Societal Computing PhD 2025 co-advisor with L. Bauer), Hana Habib (Societal Computing PhD 2021), Patrick Kelley (COS PhD 2013, co-advisor with N. Sadeh), Saranga Komanduri (Societal Computing PhD 2016), Ponnurangam Kumaraguru (COS PhD 2009), Pedro Leon (EPP PhD 2014), Abby Marsh (Societal Computing PhD 2018), Aleecia McDonald (EPP PhD 2010), Rob Reeder (CSD PhD 2008), Rich Shay (COS PhD 2015), Steve Sheng (EPP PhD 2009), Manya Sleeper (Societal Computing PhD 2016), Josh Tan (Societal Computing PhD 2020, co-advisor with L. Bauer), Janice Tsai (EPP PhD 2009), Blase Ur (Societal Computing PhD 2016), Kami Vaniea (CSD PhD 2012, co-advisor with L. Bauer) Consulting I have consulted for companies and non-profits on privacy policies, P3P, usable privacy and security, and technology policy. I have also served as an expert witness in patent litigation and in privacy cases, and in cases challenging the constitutionality of Internet harmful-to-minors laws, including the ACLU's successful challenge to the 1998 Children's Online Protection Act. I currently do expert witness consulting through Harbor Labs. Personal I walk to work, play recreational soccer, practice yoga, take lots of photos, sew clothes with pockets, and design and create quilts. I also play the bass flute in the City Flutes flute choir, serve as an Allegheny County elections poll worker, and organized the Dynamoms women's soccer club. \"I started quilting in grad school because I wanted to create something beautiful and see tangible progress when I got frustrated writing my dissertation. Thirty years later, I continue to design and sew quilts and now also clothing. Figuring out how to construct an idea I have in my mind out of fabric is a bit of an engineering challenge, but it is very different from what I do all day at work. I find it both relaxing and exciting, and I love the tactile nature of working with fabric. I enjoy designing and sewing clothing that meets all the requirements of the wearer: comfortable, perfect fit, looks great on, washable and of course it has to have functional pockets! And it is lots of fun when someone compliments me on my outfit, and I tell them I sewed it myself!\" -- (CMU Arts in Education Week 2024) Blog | Bio | Resume | Press | Quilts | Photos | Everything else",
  "content_length": 8804,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:00"
}