{
  "name": "Louise A. Dennis",
  "homepage": "https://personalpages.manchester.ac.uk/staff/louise.dennis",
  "status": "success",
  "content": "Louise Dennis Home Publications Online Talks Blue Book Notes CV Louise Dennis Louise Dennis is a Reader at the University of Manchester. Her background is in artificial intelligence and more specifically in agent and autonomous systems and automated reasoning. She has worked on the development of several automated reasoning and theorem proving tools, most notably the Agent JPF model checker for BDI agent languages; the lambda-clam proof planning system (also archived at the Theorem Prover Museum); and the PROSPER Toolkit for integrating an interactive theorem prover (HOL) with automated reasoning tools (such as SAT solvers) and Case/CAD tools. More recently she has investigated rational agent programming languages and architectures for autonomous systems, with a particular emphasis on verifiable systems and ethical reasoning. Two satellites cooperate to explore an asteroid field, using a verifiable agent architecture for decision-making. An output from the Engineering Autonomous Space Software project. Prospective PhD Students I'm happy to hear from prospective PhD students, but please note my background is not in neural networks, deep learning, LLMs or robotic control theory, so I'm not qualified to supervise students who wish to specialise in those areas. I'm primarily interested in students who want to study formal methods, verification, declarative agent programming or logic-based approaches to ethics and explainability. Address Louise Dennis Department of Computer Science Kilburn Building University of Manchester louise.dennis@manchester.ac.uk Research Groups, Centres and Labs Autonomy and Verification Group (Manchester) Autonomous and Verification Network Research Projects Centre for Robotic Autonomy in Demanding and Long Lasting Environments (CRADLE) (2023-2028) PhD Students Long Le (2025-). Verifying ROS Nodes Ben Andrew (2024 -, Second Supervisor). Developing Reliable Software for Autonomous Robots. Juel Hussain (2023 -, Third Supervisor). Security-Minded Verification for Autonomous Systems Diana Benjumea Hernandez (2023 - ). Autonomous Robotic Rules Based Reasoning System for use in UK Nuclear Environments. Xin Quan (2022 - , Second Supervisor). Ethical Natural Language Inference. Simon Kolker (2022 - ). The Effect of Uncertainty in Machine Ethics. Organisations, Networks and Conferences 25th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2026) (Programme Chair) 24th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2025) (Tutorial Chair) International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS) (Board Member) ACM SIGAI (Vice Chair) Links Lego Rovers (Public Engagement Activity) University Research Page Personal Page Mastodon Contact: Louise Dennis. Design by FreeCSSTemplates.org.",
  "content_length": 2816,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:04"
}