{
  "name": "Louis L. Whitcomb",
  "homepage": "https://dscl.lcsr.jhu.edu",
  "status": "success",
  "content": "Dynamical Systems and Control Laboratory – Department of Mechanical Engineering | Laboratory for Computational Sensing and Robotics | Johns Hopkins University Skip to content DSCL research focuses on problems in the navigation, dynamics, and control of linear and nonlinear dynamical systems, observers, nonlinear systems analysis, modeling, and sensing relevant to robots that interact dynamically in extreme environments. We focus on problems motivated by several application areas that share a common underlying mathematical framework including underwater robotics, space telerobotics, and medical robotics.  Lab Director Louis Whitcomb and his students have participated in the development of numerous underwater vehicles for oceanographic science missions including the Nereus hybrid underwater vehicle that dove to the bottom of the Mariana Trench in 2009, and Nereid Under-Ice (NUI) hybrid underwater vehicle that was deployed under Arctic sea ice at 87 degrees North in 2016. Our methodology is to address fundamental theoretical issues with concise mathematical analysis, and to experimentally validate our research results in actual working systems. Zachary J. Harris, Tyler Paine, Annie Mao, and Louis L. Whitcomb, Stable Null-Space Adaptive Parameter Identification of 6 Degree of Freedom Decoupled Plant and Actuator Models for Underactuated Vehicles: Theory and Experimental Evaluation, International Journal of Robotics Research, 2023;42(12):1070-1093. https://doi.org/10.1177/02783649231191184 Annie M. Mao, Joseph L. Moore, and Louis L. Whitcomb, Adaptive Identification of Second-Order Mechanical … Continue reading “Recent DSCL Publications” Andrew Spielvogel presented his thesis research entitled “Online Inertial Measurement Unit Sensor Bias and Attitude Estimation For The Calibration And Improved Performance Of Attitude And Heading Reference Systems” on March 6, 2020. His thesis committee included Professor Louis Whitcomb (primary advisor), Assistant Professor Marin Kobilarov, and Professor Noah Cowan. Abstract: Dynamic instrumentation and estimation of … Continue reading “Andrew Spielvogel Defended his PhD Thesis” Zachary Harris presented his thesis research entitled “Model-Based Cooperative Acoustic Navigation and Parameter Identification for Underactuated Underwater Vehicles” on August 16, 2019. His thesis committee included Professor Louis Whitcomb (primary advisor), Assistant Professor Marin Kobilarov, and Senior Scientist Dr. Dana Yoerger of the Woods Hole Oceanographic Institution. Abstract This thesis reports novel theoretical and experimental … Continue reading “Zachary Harris Defended his PhD Thesis”",
  "content_length": 2650,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:03"
}