{
  "name": "Louise Barkhuus",
  "homepage": "https://barkhu.us",
  "status": "success",
  "content": "Louise Barkhuus | Home Louise Barkhuus Researcher at New York University and Professor at the IT University of Copenhagen louise.barkhuus [AT] nyu.edu Bio I am currently a researcher at New York University, and a professor at The IT University of Copenhagen. I have been at ITU since 2016; before that I was a visiting professor at Cornell Tech for two years. I was an Associate Professor at Stockholm University from 2012-2015 and a research scientist at UC San Diego from 2007 to 2011. Research My research focuses on human-centered AI, particularly relating to privacy perceptions in AI facilitated socio-technical systems. I use qualitative and mixed methods to study human interaction and practices around AI technologies, in particular location-based technologies, in order to provide a better understanding of how to design privacy sensitive social AI technologies. Publications For a more comprehensive list of publications, see Google Scholar. Selected All Achieving Symmetry in Synchronous Interaction in Hybrid Work is Impossible Pernille Bjørn, Juliane Busboom, Melanie Duckert, Susanne Bødker, Irina Shklovski, Eve Hoggan, Kellie Dunn, Qianqian Mu, Louise Barkhuus, Nina Boulus-Rødje ACM TOCHI 2024 Paper Learning design for short-duration e-textile workshops: outcomes on knowledge and skills Andri Ioannou, Ourania Miliou, Yiannis Georgiou, Stella Timotheou, Louise Barkhuus, Jennifer Rode Educational technology research and development, Springer, 2024 Paper Collocated Distance: A Fundamental Challenge for the Design of Hybrid Work Technologies Melanie Duckert, Louise Barkhuus, Pernille Bjørn CHI 2023 Paper Designing for Shared Remote Video Experiences Anders Sundnes Løvlie, Lucas Schønrock, Jannik Bryld, Louise Barkhuus Proceedings of the 25th International Academic Mindtrek Conference. 2022. Paper You have been in Close Contact with a Person Infected with COVID-19 and you may have been Infected: Understanding Privacy Concerns, Trust and Adoption in Mobile COVID-19 Tracing Across Four Countries Oksana Kulyk, Lauren Britton-Steele, Elda Paja, Melanie Duckert, Louise Barkhuus MobileHCI 2022 Paper Protecting Personal Health Data through Privacy Awareness: A study of perceived data privacy among people with chronic or long-term illness Melanie Duckert, Louise Barkhuus ACM GROUP 2022/2023. 2022. Paper Louise's version To Use or Not to Use: Mediation and Limitation of Digital Screen Technologies within Nuclear Families Melanie Duckert, Louise Barkhuus ACM IMX 2022 Paper Louise's version The designer's body as resource in design: Exploring combinations of point-of-view and tense Dag Svanæs, Louise Barkhuus CHI 2020 Paper Mothers as Candy Wrappers: Critical Infrastructure Supporting the Transition into Motherhood Lauren Britton, Louise Barkhuus, Bryan Semaan ACM GROUP 2019 Paper Louise's version Making the City my own: Uses and Practices of Mobile Location Technologies for Exploration of a new City Louise Barkhuus and Yvette Wohn Personal and Ubiquitous Computing, 2018 Paper Louise's version Interactive Performance as a Means of Civic Dialogue Chiara Rossitto, Maria Normark, Louise Barkhuus CHI 2017 Best Paper Honorable Mention Paper Louise's version People are either too Fake or too Real: Opportunities and Challenges in Tie-based Anonymity Xiao Ma, Nazanin Andalibi, Louise Barkhuus, Mor Naaman CHI 2017 Paper Louise's version Achieving Symmetry in Synchronous Interaction in Hybrid Work is Impossible Pernille Bjørn, Juliane Busboom, Melanie Duckert, Susanne Bødker, Irina Shklovski, Eve Hoggan, Kellie Dunn, Qianqian Mu, Louise Barkhuus, Nina Boulus-Rødje ACM TOCHI 2024 Paper Learning design for short-duration e-textile workshops: outcomes on knowledge and skills Andri Ioannou, Ourania Miliou, Yiannis Georgiou, Stella Timotheou, Louise Barkhuus, Jennifer Rode Educational technology research and development, Springer, 2024 Paper Queering the Space: Location-Based Stories for Transforming Space into Place Mack Neupart, Daniel Ashbrook, and Louise Barkhuus CHI 2024 Extended Abstracts Paper Collocated Distance: A Fundamental Challenge for the Design of Hybrid Work Technologies Melanie Duckert, Louise Barkhuus, Pernille Bjørn CHI 2023 Paper Designing for Shared Remote Video Experiences Anders Sundnes Løvlie, Lucas Schønrock, Jannik Bryld, Louise Barkhuus Proceedings of the 25th International Academic Mindtrek Conference. 2022. Paper You have been in Close Contact with a Person Infected with COVID-19 and you may have been Infected: Understanding Privacy Concerns, Trust and Adoption in Mobile COVID-19 Tracing Across Four Countries Oksana Kulyk, Lauren Britton-Steele, Elda Paja, Melanie Duckert, Louise Barkhuus MobileHCI 2022 Paper Protecting Personal Health Data through Privacy Awareness: A study of perceived data privacy among people with chronic or long-term illness Melanie Duckert, Louise Barkhuus ACM GROUP 2022/2023. 2022. Paper Louise's version To Use or Not to Use: Mediation and Limitation of Digital Screen Technologies within Nuclear Families Melanie Duckert, Louise Barkhuus ACM IMX 2022 Paper Louise's version The designer's body as resource in design: Exploring combinations of point-of-view and tense Dag Svanæs, Louise Barkhuus CHI 2020 Paper Mothers as Candy Wrappers: Critical Infrastructure Supporting the Transition into Motherhood Lauren Britton, Louise Barkhuus, Bryan Semaan ACM GROUP 2019 Paper Louise's version Making the City my own: Uses and Practices of Mobile Location Technologies for Exploration of a new City Louise Barkhuus and Yvette Wohn Personal and Ubiquitous Computing, 2018 Paper Louise's version Interactive Performance as a Means of Civic Dialogue Chiara Rossitto, Maria Normark, Louise Barkhuus CHI 2017 Best Paper Honorable Mention Paper Louise's version People are either too Fake or too Real: Opportunities and Challenges in Tie-based Anonymity Xiao Ma, Nazanin Andalibi, Louise Barkhuus, Mor Naaman CHI 2017 Paper Louise's version Stephen Ricken, Louise Barkhuus, and Quentin Jones International Conference on Communities and Technologies, 2017 Paper Recent News November 2025. In November 2025, I started at a researcher at NYU, in the Department of Computer Science and Engineering (more info). June 2025. I am sub-committee chair for CHI 2026, Understanding Users, Qualitative Research (more info). July 2024. I am part of the editorial team for CSCW 2025 (more info). August 2023. From September 2023 to June 2025 I was a visiting professor at Rutgers University, in the Department of Library and Information Science (more info). September 2022. From September 2022 I was a Fulbright Scholar at Columbia University in the Department of Biomedical Informatics, working with Lena Mamykina (more info). July 1st 2021. I became a full Professor at the IT University of Copenhagen (more info). Personal I live in New York City with my two children. Website Design Website designed by Martin Saveski and forked by permission via Mor Naaman. Louise Barkhuus louise.barkhuus [AT] nyu.edu",
  "content_length": 6994,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:03"
}