{
  "name": "Louis-Noël Pouchet",
  "homepage": "https://www.cs.colostate.edu/~pouchet",
  "status": "success",
  "content": "Homepage of Louis-Noël Pouchet Louis-Noël Pouchet Dept. of Computer Science Colorado State University Fort Collins, CO tel: (+1) 614-859-5115 email: pouchet@colostate.edu office: CS-346 [News] [Position] [Software] [Lectures] [Publications] News Disclaimer: I do not regularly maintain this website, in fact, it contains only information till 2017 mostly. See instead Google Scholar or DBLP for recent publications, the CS@CSU website for funded research projects, and the sourceforge websites of PolyBench/C and PoCC for their software releases. At CSU, I teach CS453 and CS553, both in Spring. 03/01/2017: PoCC 1.4 is released. 08/16/2016: Joining Colorado State University. Position I am currently an Associate Professor of Computer Science at Colorado State University, with a joint appointment in the Electrical and Computer Engineering department. I work on a variety of topics for high-performance computing, and in particular I develop compiler technologies based on the polyhedral framework. I am a member of the Center for Domain-Specific Computing (NSF) and of the DSL Technology for Exascale Computing project (DoE). I also lead research on the enhancement and use of polyhedral compilation technologies for heterogeneous platforms (NSF and Intel ISRA). In the past I was a member of the Platform-Aware Compilation Environment project (DARPA), where I contributed a polyhedral compilation engine (PolyOpt) for the ROSE compiler. I received a Ph.D in Computer Science in Jan. 2010, for my work at the ALCHEMY group, INRIA Saclay. I was advised by Albert Cohen and Cédric Bastoul. In 2006, I graduated from EPITA (a French Engineer school specialized in Computer Science) and in parallel received a Master's degree in Computer Science (minor in Cognitive Sciences) from the University of Paris-Sud XI. I am working on several areas of high-performance computing: polyhedral compilation iterative and adaptive compilation / auto-tuning compilers performance portability machine learning performance-oriented domain-specific languages hardware-software co-design energy-aware program optimization program transformations for high-level synthesis programming languages I/O complexity models Software Compilation PoCC: the Polyhedral Compiler Collection A flexible source-to-source iterative and model-driven compiler, embedding most of the state-of-the-art tools for polyhedral compilation. Status: On development, version 1.2 available. PolyOpt/C: A Polyhedral Optimizer for the ROSE compiler A complete polyhedral framework (data dependence analysis, annotation, program transformations) accessible in the ROSE compiler. Automatic detection and optimization of polyhedral regions. Status: On development, version 0.2.1 available. LeTSeE: the LEgal Transformation SpacE Explorator Tool to build and explore systematically or heuristically the legal transformation space of a program, in the polyhedral model. Status: Version 0.2.0 available. FM: the Fourier-Motzkin library A library for manipulating Q-polyhedra. It comprises a fast and redundancy-controlled C implementation of the Fourier-Motzkin projection algorithm. Status: Version 0.5.0 available. Benchmarking PolyBench/C A set of reference C files containing Static Control Parts. Status: Version 4.1 available. PolyBench/Fortran A set of reference Fortran files containing Static Control Parts. Status: Version 1.0 available. Miscellaneous AutoSkelet A tunable project skeleton generator using Autoconf, Automake and Libtools. Status: Version 0.1 available. LoopbackPortForwarding A small Java app to forward ports between your public IP address and the loopback. Proven to be very useful to allow Internet users to connect to Google Android apps running on your PC! Status: Version 0.1 available. LetSee, PACE, AutoSkelet and LoopbackPortForwarding are released under the GNU GPL (v2) license. FM is released under the GNU Lesser GPL (v3) license starting version 0.5.0, and GPL v2 for previous versions. Lectures Part I: Theory 888.11 - Polyhedral Compilation Foundations, lecture I.1: Iteration domains and polyhedra [slides] [notes] 888.11 - Polyhedral Compilation Foundations, lecture I.2: Data dependences [slides] [notes] 888.11 - Polyhedral Compilation Foundations, lecture I.3: Scheduling and Optimization - I [slides] [notes] 888.11 - Polyhedral Compilation Foundations, lecture I.4: Scheduling and Optimization - II [slides] [notes] 888.11 - Polyhedral Compilation Foundations, lecture I.5: Scheduling and Optimization - III [slides] [notes] Part II: Practice 888.11 - Polyhedral Compilation Foundations, lecture II.1: Dependence polyhedra [notes] 888.11 - Polyhedral Compilation Foundations, lecture II.2: Dependence polyhedra, again [notes] 888.11 - Polyhedral Compilation Foundations, lecture II.3: Dependence polyhedra and program Legality [notes] 888.11 - Polyhedral Compilation Foundations, lecture II.4: Scanning Polyhedra [notes] Part III: Communication management 888.11 - Polyhedral Compilation Foundations, exercise III.1: Data space [notes] 888.11 - Polyhedral Compilation Foundations, exercise III.2: Tiling [notes] 888.11 - Polyhedral Compilation Foundations, exercise III.3: Communication generation [notes] Methodology and problem solving 888.11 - Iterator Live-out value, lecture 1: Formulating the problem [slides] [notes] 888.11 - Iterator Live-out value, lecture 2: Writing algorithms [slides] [notes] 888.11 - Iterator Live-out value, lecture 3: Solving the problem, part I [slides] [notes] 888.11 - Iterator Live-out value, lecture 4: Solving the problem, part II [slides] [notes] 888.11 - Iterator Live-out value, lecture 5: General algorithm for the Live-out Iterator Problem [slides] [notes] 888.11 - Iterator Live-out value, lecture 6: \"Proving\" your algorithm [slides] [notes] Randomly selected topics 888.11 - Vectorization in the Polyhedral Model, lecture 1: Pre-transformations for vectorizability [slides] [notes] 888.11 - Vectorization in the Polyhedral Model, lecture 2: Transformation Selection for Good Vectorization [slides] [notes] Publications Note: this list is incomplete In conferences and journals Wenlei Bao, Sriram Krishnamoorthy, Louis-Noël Pouchet, Fabrice Rastello and P. Sadayappan. PolyCheck: Dynamic Verification of Iteration Space Transformations on Affine Programs. In 43th ACM SIGACT-SIGPLAN Symposium on Principles of Programming Languages (POPL'16). ACM Press, St. Petersburg, FL, January 2016. [bibtex-entry] [pdf] [slides] Wei Zuo, Warren Kemmerer, Jong Bin Lim, Louis-Noël Pouchet, Andrey Ayupov, and Taemin Kim, Kyungtae Han and Deming Chen. A Polyhedral-based SystemC Modeling and Generation Framework for Effective Low-power Design Space Exploration. In IEEE/ACM International Conference on Computer-Aided Design (ICCAD'15). IEEE Press, Austin, TX, November 2015. [bibtex-entry] [pdf] [slides] Naser Sedaghati, Te Mu, Louis-Noël Pouchet, Srinivasan Parthasarathy and P. Sadayappan. Automatic Selection of Sparse Matrix Representation on GPUs. In ACM International Conference on Supercomputing (ICS'15). ACM Press, Newport Beach, CA, June 2015. [bibtex-entry] [pdf] [slides] Tobias Grosser, J. Ramanujam, Louis-Noël Pouchet, P. Sadayappan and Sebastian Pop. Optimistic Delinearization of Parametrically Sized Arrays. In ACM International Conference on Supercomputing (ICS'15). ACM Press, Newport Beach, CA, June 2015. [bibtex-entry] [pdf] [slides] Peng Li, Peng Zhang, Louis-Noël Pouchet and Jason Cong. Resource-Aware Throughput Optimization for High-Level Synthesis. In 23rd ACM/SIGDA International Symposium on Field-Programmable Gate Arrays (FPGA'15). ACM Press, Monterey, California, February 2015. [bibtex-entry] [pdf] [slides] Mahesh Ravishankar, Roshan Dathathri, Venmugil Elango, Louis-Noël Pouchet, Atanas Rountev, P. Sadayappan, and J. Ramanujam. Distributed Memory Code Generation for Mixed Irregular/Regular Computations. In 20th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming (PPoPP'15). ACM Press, San Francisco, CA, February 2015. [bibtex-entry] [pdf] [slides] Naznin Fauzia, Louis-Noël Pouchet and P. Sadayappan. Characterizing and Enhancing Global Memory Data Coalescing on GPUs. In 13th IEEE/ACM International Symposium on Code Generation and Optimization (CGO'15). ACM Press, San Francisco, CA, February 2015. [bibtex-entry] [pdf] [slides] Martin Kong, Antoniu Pop, Louis-Noël Pouchet, R. Govindarajan, Albert Cohen and P. Sadayappan. Compiler/Runtime Framework for Dynamic Dataflow Parallelization of Tiled Programs. In ACM Transactions on Architecture and Code Optimization (TACO). Special issue on high-performance and embedded architectures and compilers, Volume 11 Issue 4, January 2015. [bibtex-entry] [pdf] [slides] Venmugil Elango, Naser Sedaghati, Fabrice Rastello, Louis-Noël Pouchet, J. Ramanujam, Radu Teodorescu and P. Sadayappan. On Using the Roofline Model with Lower Bounds on Data Movement. In ACM Transactions on Architecture and Code Optimization (TACO). Special issue on high-performance and embedded architectures and compilers, Volume 11 Issue 4, January 2015. [bibtex-entry] [pdf] [slides] Venmugil Elango, Fabrice Rastello, Louis-Noël Pouchet, J. Ramanujam and P. Sadayappan. On Characterizing the Data Access Complexity of Programs.. In 42th ACM SIGACT-SIGPLAN Symposium on Principles of Programming Languages (POPL'15). ACM Press, Mumbai, India 2015. [bibtex-entry] [pdf] [slides] Jun Shirako, Louis-Noël Pouchet and Vivek Sarkar. Oil and water can mix: an integration of polyhedral and AST-based transformations. In IEEE Conference on Supercomputing (SC'14). New Orleans, LA, November 2014. [bibtex-entry] [pdf] [slides] Markus Schordan, Pei-Hung Lin, Dan Quinlan and Louis-Noël Pouchet. Verification of polyhedral optimizations with constant loop bounds in finite state space computations. In 6th International Symposium on Leveraging Applications of Formal Methods, Verification and Validation. Specialized Techniques and Applications (ISoLA'14). Springer Verlag, Corfu, Greece, October",
  "content_length": 24431,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:02"
}