{
  "name": "Lu Bai 0006",
  "homepage": "https://pure.qub.ac.uk/en/persons/lu-bai",
  "status": "success",
  "content": "Lu Bai - Queen's University Belfast View Scopus Profile Lu Bai Dr Senior Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0003-1242-5412 Emaill.baiqub.acuk 20152025 Research activity per year Personal profile Fingerprint Dive into the research topics where Lu Bai is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Image Earth and Planetary Sciences 100% Detection Earth and Planetary Sciences 91% Remote Sensing Earth and Planetary Sciences 70% Model Earth and Planetary Sciences 64% Oil Well Earth and Planetary Sciences 52% Models Computer Science 52% Satellite Remote Sensing Earth and Planetary Sciences 46% Remote Sensing Data Computer Science 38% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2015 2021 2023 2024 2025 31 Conference contribution 22 Article 1 Chapter 1 Abstract 2 More 1 Comment/debate 1 Review article Research output per year Research output per year A novel method for subgroup discovery in precision medicine based on topological data analysisLoughrey, C. F., Maguire, S., Dłotko, P., Bai, L., Orr, N. & Jurek-Loughrey, A., 19 Mar 2025, In: BMC Medical Informatics and Decision Making. 25, 15 p., 139.Research output: Contribution to journal › Article › peer-review Open AccessFile Research Question 100% Gene Expression Data 100% Parameter Value 100% Data Mining 100% Similarity Graph 100% 26 Downloads (Pure) A creative weak supervised semantic segmentation for remote sensing imagesWang, Z., Chang, H., Bai, L., Chen, L. & Bi, X., 24 Oct 2024, In: IEEE Transactions on Geoscience and Remote Sensing. 62, 13 p., 4708713.Research output: Contribution to journal › Article › peer-review Open AccessFile Weakly-Supervised Semantic Segmentation 100% Classification Network 74% Oil Well 74% Background Noise 49% 3 Citations (Scopus) 33 Downloads (Pure) A deep learning based platform for remote sensing images change detection integrating crowdsourcing and active learningWang, Z., Zhang, J., Bai, L., Chang, H., Chen, Y., Zhang, Y. & Tao, J., 01 Mar 2024, In: Sensors (Basel, Switzerland). 24, 5, 26 p., 1509.Research output: Contribution to journal › Article › peer-review Open AccessFile Detection 100% Annotation 100% Active Learning 100% Remote Sensing Image 100% Artificial Intelligence 16% 6 Citations (Scopus) 119 Downloads (Pure) A multimodal approach for quantifying walking pace using chest-worn wearable sensorsFahim, M., Gault, R., Ahmaderaghi, B., Bai, L. & Jurek-Loughrey, A., 06 Nov 2024, 18th International Symposium on Medical Information and Communication Technology (ISMICT 2024): proceedings. Institute of Electrical and Electronics Engineers Inc., p. 53-57 5 p. (ISMICT Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Accelerometer 100% Wearable Sensor 100% Electrocardiogram 66% Triaxial Accelerometer 50% Adverse Event 33% 13 Downloads (Pure) Attention-enhanced urban fugitive dust source segmentation in high-resolution remote sensing imagesHe, X., Wang, Z., Bai, L., Fan, M., Chen, Y. & Chen, L., 11 Oct 2024, In: Remote Sensing. 16, 20, 23 p., 3772.Research output: Contribution to journal › Article › peer-review Open AccessFile Branch Connection 100% Image Edge 100% Suspended Particulate Matter 100% high resolution remote sensing 66% 1 Citation (Scopus) 24 Downloads (Pure) View all 57 research outputs Activities Activities per year 2014 2023 2024 2025 23 Participation in conference 13 Publication peer-review 10 Oral presentation 4 Participation in workshop, seminar, course 13 More 3 Editorial activity 2 Other examination 2 Membership of national or international committees and working groups 2 Invited talk 1 PhD external examination 1 Other 1 Invited or keynote talk at national or international conference 1 Public lecture/debate/seminar Activities per year International Conference on Biomedical Engineering (ICBE2025)Bai, L. (Member of the organising committee)12 Jun 2025 → 14 Jun 2025Activity: Participating in or organising an event types › Participation in conference AI for Digital EarthBai, L. (Invited speaker)15 May 2025Activity: Talk or presentation types › Invited talk ISPRS Journal of Photogrammetry and Remote Sensing (Journal)Bai, L. (Peer reviewer)11 Apr 2025 → …Activity: Publication peer-review and editorial work types › Publication peer-review The 2nd International Conference on AI-generated Content (AIGC 2024)Bai, L. (Member of programme committee)21 Dec 2024 → 22 Dec 2024Activity: Participating in or organising an event types › Participation in conference Journal of Information and Intelligence (Journal)Bai, L. (Peer reviewer)15 Nov 2024Activity: Publication peer-review and editorial work types › Publication peer-review View all 63 activities",
  "content_length": 5212,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:07"
}