{
  "name": "Lu Feng 0001",
  "homepage": "http://www.cs.virginia.edu/~lufeng",
  "status": "success",
  "content": "Lu Feng Home Research Teaching Service Awards News Group Lu Feng Associate Professor University of Virginia I am an Associate Professor at the Department of Computer Science and the Department of Systems and Information Engineering at the University of Virginia. I am also a member of the Link Lab - the center of research excellence in Cyber-Physical Systems. Previously, I was a postdoctoral fellow at the University of Pennsylvania. I hold a D.Phil. in Computer Science from the University of Oxford, and a M.Phil. in Computer Speech, Text and Internet Technology from the University of Cambridge. I have been fortunate to receive several awards in the past, including NSF CAREER Award, NIH NHLBI Big Data Analysis Challenge Winner Award, NSF CRII Award, Rising Stars in EECS, James S. McDonnell Foundation Postdoctoral Fellowship, among others. My research focuses on assuring the safety and trustworthiness of Cyber-Physical Systems (CPS), which are engineered systems with seamless integration of computing devices, control and actuation, and sensing of the physical world. Prominent examples of CPS include automated vehicles, medical devices, and smart cities. Specifically, my current research tackles challenges such as: Safety of AI-enabled CPS: The data-rich nature of CPS has resulted in AI technologies increasingly being embedded in CPS. But many AI systems lack safety guarantees and can lead to catastrophic failures. How do we provide mathematically rigorous guarantees about the safety of AI-enabled CPS? Trust in Human-CPS: There is a growing trend toward human-CPS, where systems collaborate or interact with humans to harness complementary strengths of humans and autonomy. How do we build trustworthy human-CPS while accounting for the uncertainty of human interaction? Read more about my research here. Highlights of Recent News May 2025: Our paper “Adaptive Reward Design for Reinforcement Learning” has been accepted for publication at the 41st Conference on Uncertainty in Artificial Intelligence (UAI 2025). May 2025: Our paper “Counterfactual Explanations for Continuous Action Reinforcement Learning” has been accepted for publication at the 34th International Joint Conference on Artificial Intelligence (IJCAI 2025). May 2025: Congratulations to my Ph.D. student, Dr. Kayla Boggess, on successfully defending her dissertation and graduating! Jan. 2025: Two papers have been accepted for publication at the Thirty-Ninth AAAI Conference on Artificial Intelligence (AAAI) 2025: “Quantitative Predictive Monitoring and Control for Safe Human-Machine Interaction” and “Towards Computational Foreseeability”. Contact Office: Olsson Hall, Room 271 Phone: 434-982-2388 Email: lu.feng at virginia dot edu Page generated 2025-05-20, by jemdoc+MathJax.",
  "content_length": 2773,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:09"
}