{
  "name": "Lu Wang 0002",
  "homepage": "https://luwang-szu.github.io",
  "status": "success",
  "content": "Lu Wang - Homepage Lu Wang Associate professor College of Computer Science & Software Engineering Shenzhen University Shenzhen, Guangdong, China wanglu@szu.edu.cn Google Scholar Biography Lu Wang joined Shenzhen University in June 2015, where she is now an Associate Professor of College of Computer Science and Software Engineering. She received the B.S. degree in communication engineering from Nankai University, Tianjin, China, in 2009, and the Ph.D. degree in Computer Science and Engineering from Hong Kong University of Science and Technology, Hong Kong, in 2014, under the supervision of Prof. Mounir Hamdi. Before joining Shenzhen University, she was a postdoctoral research fellow in the Computer Science and Engineering, Hong Kong University of Science and Technology, where he worked with Prof. Qian Zhang. She has been recognized as Guangdong Special Support for Young Talent (“广东特支计划”科技创新青年拔尖人才) and Overseas High-Caliber Personnel (深圳市海外高层次人才). She has also received several academic awards for her outstanding work in the field of wireless communications and mobile computing, including Excellence Award of China Patent Awards 2022, Excellence Award of Guangdong Patent Awards 2021, the First Prize of\tGuangdong Science and Technology Progress Award 2018, and Second Prize of Guangdong Technological Invention Award 2017. She is the co-recipient of Best Paper Award of IEEE SECON 2018, IEEE MSN 2016, IEEE GlobeCom 2012 and IEEE ICPADS 2012. She was also awarded ACM SIGAPP China Rising Star in 2020 and ACM-HK Prof. Francis Chin Research Award in 2013. News [Paper] 2025/3, our paper “PIT: A Novel Toothbrush Providing Real-Time and Robust Plaque Indication During Brushing” has been accepted for publication in the 23rd ACM International Conference on Mobile Systems, Applications, and Services (MobiSys’25), 2025. [Paper] 2024/12, our paper “ContractMind: Trust-calibration Interaction Design for AI Contract Review Tools” has been accepted for publication in the International Journal of Human - Computer Studies (IJHCS’24), 2024. [Paper] 2024/10, our paper “Optical Sensing-Based Intelligent Toothbrushing Monitoring System” has been accepted to appear in IEEE Transactions on Mobile Computing (TMC), 2024. [Paper] 2023/06, our paper “LiT: Toothbrushing monitoring using blue light from toothbrush” is accepted by The 29th Annual International Conference on Mobile Computing and Networking (MobiCom ‘23), 2023. [Paper] 2023/05, our paper “Beverage Deterioration Monitoring Based on Surface Tension Dynamics and Absorption Spectrum Analysis” is accepted in IEEE Transactions on Mobile Computing (TMC) [Award] 2022/08, I have received the “Rising Star Award” from ACM SIGAPP China Chapter for my previous achievements in the areas of wireless communications. [Award] 2022/07, Our patent wins 23rd China Patent Excellence Award. [Paper] 2022/05, our paper “LiSee: A Headphone that Provides All-day Assistance for Blind and Low-vision Users to Reach Surrounding Objects” has been published in ACM international joint conference on Pervasive and Ubiquitous Computing. [Award] 2021/08, Our patent wins 8rd Guangdong Patent Excellence Award. [Paper] 2021/06, our paper “Lili: Liquid Quality Monitoring with Light Signal” has been accepted by The 27th Annual International Conference on Mobile Computing and Networking (MobiCom ‘21), 2021. [Paper] 2021/06, our paper “Power Saving and Secure Text Input for Commodity Smart Watches” has been published in IEEE Transactions on Mobile Computing. [Paper] 2020/11, our paper “Vi-Liquid: Unknown Liquid Identification with Your Smartphone Vibration” has been accepted by The 27th Annual International Conference on Mobile Computing and Networking (MobiCom ‘21), 2021. [Paper] 2021/05, 我们的论文“面向云网融合的细粒度多接入边缘计算架构” 被《计算机研究与发展》接收 [Service] 2021/03, I am serving as the Technical Program Committee Chair of EAI ICECI 2021. Please consider submitting your papers! RESEARCH Next-generation Wireless Networks Internet of Things (IoT) Mobile Computing and Sensing My research interest mainly focuses on the design and implementation of future high speed wireless networks, spanning from novel physical layer to algorithm design to the system architecture. I am also interested in Internet of Things (IoT) and Mobile Computing and Sensing, and leveraging machine learning and data analytics related techniques to deal with networking and sensing related problems. PUBLICATION Book [SpringerBriefs] L. Wang, K. Wu and M. Hamdi. Introduction to Attachment Transmission in Wireless Networks, in SpringerBriefs in Computer Science Series, Springer London Limited, 2014. Conference [MobiSys’25] Kaixin Chen, Junfan Xiang, Wanying Tan, Keyu Chen, Kaishun Wu and Lu Wang*, PIT: A Novel Toothbrush Providing Real-Time and Robust Plaque Indication During Brushing, in the 23rd ACM International Conference on Mobile Systems, Applications, and Services (MobiSys’25), 2025. [UIC’24] Arif Raza, Junfan Xiang, Salabat Khan, Shivanshu Shrivastava, Muhammad Wasim Abbas Ashraf, and Lu Wang*, Collaborative Multi-Agent Proximal Policy Based Resource Allocation in Clustered IoV Networks, in The 21st International Conference on Ubiquitous Intelligence and Computing (UIC’24) Special Session on Collaborative Edge Intelligence and Its Emerging Application (Edge AI), 2024. (PDF) [ICPADS’24] Jiayi Zhao, Yongzhi Huang, Qipeng Xie, Weizheng Wang, Lu Wang*, Kaishun Wu, Chameleon: An Adaptive System for Overlapping Keystroke Signal Separation and Identification, in the IEEE International Conference on Parallel and Distributed Systems (ICPADS’24), 2024. (PDF) [ISMIR’24] Ziya Zhou, Yuhang Wu, Zhiyue Wu, Xinyue Zhang, Ruibin Yuan, Yinghao MA, Lu Wang, Emmanouil Benetos, Wei Xue, Yike Guo, Can LLMs “Reason” in Music? An Evaluation of LLMs’ Capability of Music Understanding and Generation, in ISMIR 2024. (PDF) [MobiCom] Kaixin Chen, Lei Wang, Yongzhi Huang, Lu Wang*, and Kaishun Wu, LiT: Toothbrushing monitoring using blue light from toothbrush, accepted to appear in The 29th Annual International Conference on Mobile Computing and Networking (MobiCom ‘23), 2023. (PDF) [UbiComp] K. Chen, Y. Huang, Y. Chen, H. Zhong, L. Lin, L. Wang*, K. Wu, LiSee: A Headphone that Provides All-day Assistance for Blind and Low-vision Users to Reach Surrounding Objects. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 6(3), 1-30. 2022. (PDF) [SenSys] Aslan B. Wong , Dongliang Tu , ZiQi Huang , Xia Chen , L. Wang* , Kaishun Wu, Muscle-Mind: towards the Strength Training Monitoring via the Neuro-Muscular Connection Sensing, in SenSys ‘21: Proceedings of the 19th ACM Conference on Embedded Networked Sensor Systems, November 2021 Pages 371–372. (PDF) [MobiCom] Y. Huang, Y. Dong, K. Chen, L. Wang, Q. Huang, K. Wu, “Lili: Liquid Quality Monitoring with Light Signal”, in The 27th Annual International Conference on Mobile Computing and Networking (MobiCom ‘21), 2021. (PDF) [MobiCom] Y. Huang, K. Chen, Y. Huang, L. Wang and K. Wu, “Vi-Liquid: Unknown Liquid Identification with Your Smartphone Vibration”, in The 27th Annual International Conference on Mobile Computing and Networking (MobiCom ‘21), 2021. (PDF) [Interspeech] X. Qi and L. Wang*, Parameter-Transfer Learning for Low-Resource Individualization of Head-Related Transfer Functions, in Interspeech, 2019. (PDF) [SECON] Y. Huang, W. Chen, H. Chen, L. Wang* and K. Wu, “G-Fall: Device-free and Training-free Fall Detection with Geophones”, in the IEEE International Conference on Sensing, Communication and Networking (SECON), 2019. (PDF) [MobiCom] W. Chen, L. Chen, Y. Huang, X. Zhang, L. Wang, R. Ruby, K. Wu, “Taprint: Secure Text Input for Commodity Smart Wristbands”, in The 25th Annual International Conference on Mobile Computing and Networking (MobiCom ‘19), 2019. (PDF) [ICPADS] Y. Huang, S. Cai, L. Wang and K. Wu, Oinput: a Bone-Conductive QWERT Keyboard Recognition for Wearable Device，in the IEEE International Conference on Parallel and Distributed Systems (IEEE ICPADS), 2018. (Invited Paper) (PDF) [ICPADS] Q. Dai, Y. Huang, L. Wang, R. Ruby and K. Wu, mm-Humidity: Fine-grained Humidity Sensing with Millimeter Wave Signals, in the IEEE International Conference on Parallel and Distributed Systems (IEEE ICPADS), 2018. (PDF) [ICNP] S. Zhong, Y. Qiu, Rukhsana Ruby, L. Wang* and K. Wu, “SIDE: Semi-Distributed Mechanical Equilibrium based UAV Deployment”, in the IEEE International Conference on Network Protocols (ICNP), 2018. (PDF) [SECON] W. Chen, M. Guan, Y. Huang, L. Wang*, R. Ruby, W. Hu and K. Wu , “ViType: A Cost Efficient On-body Typing System through Vibration”, in the IEEE International Conference on Sensing, Communication and Networking (SECON) , 2018. ( Best Paper Award) (PDF) [SenSys] W. Chen, Y. Lian, L Wang, R. Ruby, W. Hu and K. Wu , “Virtual Keyboard for Wearable Wristbands”, in the 15th ACM Conference on Embedded Networked Sensor Systems (ACM SenSys), 2017. (PDF) [ICC] S. Zhong, Y. Huang, R. Ruby, L. Wang, Y. Xuan and K. Wu, “Wi-Fire: Device-free Fire Detection using WiFi Networks”, in the IEEE International Conference on Communications (IEEE ICC), 2017. (PDF) [ICC] W. Chen, M. Guan, L. Wang, R. Ruby and K. Wu, “FLoc: Device-free Passive Indoor Localization in Complex Environments”, in the IEEE International Conference on Communications (IEEE ICC), 2017. (PDF) [GLOBECOM] L. Wang, X. Qi, K. Wu and Q. Zhang, “Hash Division Multiple Access”, in the IEEE Global Communications Conference (IEEE GLOBECOM), 2016. (PDF) [ICC] L. Wang, X. Qi and K. Wu, “Embracing Adjacent Channel Interference in Next Generation Wi-Fi Networks”, in the IEEE International Conference on Communications (ICC), 2016. (PDF) [MSN] J. WANG, R. Ruby, L. Wang and K. Wu, “Accurate Combined Keystroke Detection Using Acoustic Signals”, in the 12th International Conference on Mobile Ad-hoc and Sensor Networks (MSN), 2016. (PDF) (Best Student Paper Award) [INFOCOM] W. Wang, Y. Chen, L. Wang, and Q. Zhang, “From Rateless to Sampleless: Wi-Fi Connectivity Make",
  "content_length": 25911,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:09"
}