{
  "name": "Luana Ruiz",
  "homepage": "https://luanaruiz9.github.io",
  "status": "success",
  "content": "Luana Ruiz Wyman Park Building N452 Baltimore, MD 21211 lrubini1-at-jh-dot-edu I am an assistant professor with the Department of Applied Mathematics and Statistics at Johns Hopkins University, the Mathematical Institute for Data Science (MINDS), and the Data Science and Artificial Intelligence Institute (DSAI). Before that, I was a METEOR and FODSI postdoctoral fellow working with Prof. Stefanie Jegelka at MIT, and a Google Research Fellow at the Simons Institute for the Theory of Computing. I obtained my PhD from the Electrical and Systems Engineering Department at Penn, where I was very fortunate to be advised by Prof. Alejandro Ribeiro. My research is at the intersection of machine learning, signal processing, and network science, with a focus on developing scalable algorithms for learning on non-Euclidean domains such as graphs and data manifolds. I work on large-scale graph information processing, graph neural networks (GNNs), and the theoretical limits of transferability and generalization in graph-based learning. I am also interested in physics-informed machine learning, manifold learning, and combinatorial optimization, especially as they relate to the structure and dynamics of complex systems. You can find my CV here, and a selected list of publications is included below. Selected publications 2025 Local Distance-Preserving Node Embeddings and Their Performance on Random Graphs My Le, Luana Ruiz, and Souvik Dhara arXiv preprint arXiv:2504.08216, 2025 Improved Image Classification with Manifold Neural Networks Caio F. Deberaldini Netto, Zhiyang Wang, and Luana Ruiz In 50th ICASSP, 2025 A Generative Model for Controllable Feature Homophily in Graphs H. Wang, R. Ma, G. Mateos, and L. Ruiz arXiv preprint arXiv:2509.23230, 2025 Submitted to ICASSP 2026 Graph Semi-Supervised Learning for Point Classification on Data Manifolds Caio F. Deberaldini Netto, Zhiyang Wang, and Luana Ruiz arXiv preprint arXiv:2506.12197, 2025 Submitted to IEEE TSP Subsampling Graphs with GNN Performance Guarantees M. Jain, S. Jegelka, I. Karmarkar, L.a Ruiz, and E. Vitercik arXiv preprint arXiv:2502.16703, 2025 A Local Graph Limits Perspective on Sampling-Based Graph Neural Networks Yeganeh Alimohammadi, Luana Ruiz, and Amin Saberi In 2025 IEEE International Symposium on Information Theory (ISIT), 2025 Dirichlet Meets Horvitz and Thompson: Estimating Homophily in Large Graphs via Sampling H. Ajorlou, L. Ruiz, and G. Mateos In 59th Asilomar Conf. on Sig. and Syst., 2025 To appear Graph Sampling for Scalable and Expressive Graph Neural Networks on Homophilic Graphs Haolin Li, Haoyu Wang, and Luana Ruiz In 33rd European Signal Processing Conference (EUSIPCO), 2025 2024 Stability to Deformations of Manifold Filters and Manifold Neural Networks Z. Wang, L. Ruiz, and A. Ribeiro IEEE Trans. Signal Process., 2024 Geometric Graph Filters and Neural Networks: Limit Properties and Discriminability Trade-offs Z. Wang, L. Ruiz, and A. Ribeiro IEEE Trans. Signal Process., 2024 A Poincaré Inequality and Consistency Results for Signal Sampling on Large Graphs (Spotlight) T. Le, L. Ruiz, and S. Jegelka In 12th ICLR, 7–11 may 2024 A Spectral Analysis of Graph Neural Networks on Dense and Sparse Graphs L. Ruiz, N. Huang, and S. Villar In 49th ICASSP, 14-19 apr. 2024 2023 Learning by Transference: Training Graph Neural Networks on Growing Graphs J. Cervino, L. Ruiz, and A. Ribeiro IEEE Trans. Signal Process., 14-19 apr. 2023 Transferability Properties of Graph Neural Networks L. Ruiz, L. F. O. Chamon, and A. Ribeiro IEEE Trans. Signal Process., 14-19 apr. 2023 Graph Neural Tangent Kernel: Convergence on Large Graphs S. Krishnagopal, and L. Ruiz In 40th ICML, 23-29 jul. 2023 2021 Graph Neural Networks: Architectures, Stability and Transferability L. Ruiz, F. Gama, and A. Ribeiro Proc. IEEE, 23-29 jul. 2021 Graphon Signal Processing L. Ruiz, L. F. O. Chamon, and A. Ribeiro Trans. Signal Process., 23-29 jul. 2021 Stability of Neural Networks on Riemannian Manifolds (Best Paper Award) Z. Wang, L. Ruiz, and A. Ribeiro In 29th EUSIPCO, 23-27 aug. 2021 Iterative Decoding for Compositional Generalization in Transformers L. Ruiz, J. Ainslie, and S. Ontañón arXiv:2110.04169 [cs.LG], 23-27 aug. 2021 2020 Gated Graph Recurrent Neural Networks L. Ruiz, F. Gama, and A. Ribeiro Trans. Signal Process., 23-27 aug. 2020 The Graphon Fourier Transform L. Ruiz, L. F. O. Chamon, and A. Ribeiro In 45th ICASSP, 4-8 may 2020 Graphon Neural Networks and the Transferability of Graph Neural Networks L. Ruiz, L. F. O. Chamon, and A. Ribeiro In 34th NeurIPS, 6-12 dec. 2020 2019 Gated Graph Convolutional Recurrent Neural Networks (Best Paper Award) L. Ruiz, F. Gama, and A. Ribeiro In 27th EUSIPCO, 2-6 sep. 2019",
  "content_length": 4728,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:10"
}