{
  "name": "Luc Bougé",
  "homepage": "https://team.inria.fr/kerdata/luc-bouge",
  "status": "success",
  "content": "Luc Bougé – KerData Skip to content Home Luc Bougé Luc Bougé Positions Professor of Informatics at ENS Rennes Member of the KerData Team at IRISA and Inria Rennes-Bretagne Altlantique Research Centre Research Center. On part-time leave at Agence nationale de la recherche (ANR) from September 2019 to August 2021 Contact information Preferred postal adress: IRISA Campus Universitaire de Beaulieu F-35042, Rennes, France IRISA phone contact: 02 99 84 00 00 (Entrance desk) Mobile Phone: + 33 6 88 76 xx xx Preferred mail address (in shell syntax): printf \"%s.%s@%s.%s\" \"luc\" \"bouge\" \"ens-rennes\" \"fr\" Warning: I am unfortunately difficult to join on a fixed phone, as I am working on multiple sites. To join me, please send me a mail or call me on my mobile phone number if you know it. Research Interests Programming Languages Parallel Programming High-Performance Programming Clusters, grids and clouds programming platforms Data management systems Biography I studied pure mathematics at École Normale Supérieure (ENS) in Paris, and then turned to Informatics for my PhD Thesis defended in 1982 under the supervision of Marie-Claude Gaudel. After a post-doctoral year in Aarhus, Denmark, I joined CNRS as a researcher, working at University Paris 7 and then at ENS Paris with Krzysztof Apt on the semantics of parallel programming languages (Hoare’s CSP), which was the subject of my State Thesis in 1987. I was hired on a full professor position at ENS Lyon in 1990, where I chaired the teaching department and the Informatics department of the doctoral school. At ENS Lyon, I joined the LIP laboratory. There, I worked on the semantics of high-performance data-parallel languages (C*, HPF) and their implementation on distributed clusters, and on high-performance multithreading (PM2) and zero-copy communication (Madeleine) libraries. I moved to ENS Cachan in 2001 to found the teaching department of Informatics at its Brittany extension in Rennes, now a self-running school called ENS Rennes. I have been chairing this department until 2013. In Rennes, I joined the IRISA laboratory and the local INRIA Research Center in the team of Thierry Priol. There, I worked on large-scale distributed data management. In 2009, I co-founded with Gabriel Antoniu the KerData team to work specifically on the management of very large-scale data on distributed platforms as clusters, grids and clouds. Between 2012 and 2015, I was on a part-time leave from ENS Rennes to work at the French national research agency (ANR as a scientific officer in charge of Mathematics and Fundamental Computer Science at the Numerics and Mathematics (NuMa) Department. This part-time leave to ANR has been renewed between 2019 ane 2021 to work on the National Artificial Intelligence Research Program (PNRIA). There, I am in charge of the management of research data stored at ANR, in the context of the French Open Science Initiative. A list of my publications can be found on DBLP. Community Service CNRS GDR for scientific animation I was the Vice-Chair (1995-1997), and then the Chair (1998-2001, and 2002-2006) of a national network of researchers supported by the French National Center for Scientific Research. This network was devoted to Architecture, Network and Parallelism. The current incarnation of this family of animation networks is called Netorks and Distributed Systems (RSD). In 2002-2006, I chaired the so-called inter-GDR co-ordination network at the newly-founded Computer Science (STIC) CNRS Department. Euro-Par I have been involved in the Euro-Par conference since its beginning. It is the major scientific conference in Europe for Parallel and Distributed Computing. In co-organized the 2007 edition in Rennes. I was the Vice-Chair (2000-2016) and then the Chair (since 2017) of the Steering Committee. IPDPS In 2003, I co-organize with Michel Cosnard the IEEE IPDPS Conference in Nice, France. Then, I was in charge of the PhD Forum section of the conference between 2010 and 2016. Evaluation Committees I was a member of the National Committee for Scientific Excellence Awarding (PEDR, PES) between 2009 and 2011. I chaired the committee section for Computer Science in 2010 and 2011. I was a member of the National Univerty Council in the Informatics section (CNU, 27th section) between 2011 and 2016. I was a member of a series of visiting committees for the National Evaluation Department (AERES, HCERES) since 2017. I chaired some of them. National Selection Committees: CAPES, Agregation I have been a member of the National Committee created in 2004 to set up a specific Informatics Track (option Informatique) with the Agregation of Mathematics. The track was created in 2006 and I chaired it until 2012. In 2015, I contributed to the creation of the CAPES of Informatics (CAPES NSI, Numérique et sciences informatiques). In 2020, I contributed to the creation of the Agregation of Informatics. National Scientific Society: SIF Since 2016, I have been serving as a Vice-President for Teaching Affairs of the French Scientific Society for Computer Science (SIF, Société d’informatique de France). I contributed to the creation of the French College of Scientific Societies (Collège des sociétés savantes académiques de France) in 2021. I am now serving as the General Secretary of the College. Former PhD Students Most of the PhD defended between 1995 and 2002 were co-advised with Raymond Namyst. Most of the PhD theses defended after 2002 were co-advised with Gabriel Antoniu. Tien-Dat Phan (2017): Energy-efficient Straggler Mitigation for Big Data Applications on the Clouds Radu Tudoran (2014): High-Performance Big Data Management Across Cloud Data Centers Matthieu Dorier (2014): Addressing the Challenges of I/O Variability in Post-Petascale HPC Simulations. This PhD Thesis was awarded the 2nd Prize at the ACM Student Research Competition, at the ICS 2011 conference. Houssem Eddine Chihoub (2013): Managing consistency for big data applications : tradeoffs and self-adaptiveness Viet-Trung Tran (2013): Scalable data-management systems for Big Data Diana Maria Moise (2011): Optimizing data management for MapReduce applications on large-scale distributed infrastructures Alexandra Carpen-Amarie (2011): BlobSeer as a data-storage facility for clouds : self-Adaptation, integration, evaluation Bogdan Nicolae (2010): BlobSeer: Towards efficient data storage management for large-scale, distributed systems. This PhD Thesis was awarded the 2nd Prize for the national Gilles Kahn Thesis Award, sponsored by the French Academy of Sciences. This prize awards the best PhD thesis in France in Informatics. Loïc Cudennec (2009): CoRDAGe : Un service générique de co-déploiement et redéploiement d’applications sur grilles Sébastien Monnet (2006): Gestion des données dans les grilles de calcul : support pour la tolérance aux fautes et la cohérence des données Mathieu Jan (2006): JUXMEM : un service de partage transparent de données pour grilles de calcul fondé sur une approche pair-à-pair Olivier Aumage (2002): Instruments of Productivity for High Performance Computing Gabriel Antoniu (2001): DSM-PM2 : une plate-forme portable pour l’implémentation de protocoles de cohérence multithreads pour systèmes à mémoire virtuellement partagée Alice Bonhomme (2001) Christian Pérez (1999) David Cachera (1998) Gil Utard (1995) Éric Charpentier (1993) Jean-Luc Levaire (1993) We are using cookies to give you the best experience on our website.You can find out more about which cookies we are using or switch them off in settings. Accept Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by  GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Enable All Save Settings",
  "content_length": 8205,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:13"
}