{
  "name": "Luca Saglietti",
  "homepage": "https://faculty.unibocconi.eu/lucasaglietti",
  "status": "success",
  "content": "LUCA SAGLIETTI - Universita' Bocconi Apply Discover Programs Browse News and Events Login Close menu Faculty Close Contact Us LUCA SAGLIETTI Open share Close Share Close Assistant Professor Department of Computing Sciences luca.saglietti@unibocconi.it Download the cv Courses a.y. 2025/2026 30509 COMPUTER PROGRAMMING 30537 FOUNDATIONS OF PHYSICS I Courses previous a.y. I am course director and lecturer in the first physics course encountered in the BAI bachelor program, Foundations of Physics I, which offers a broad introduction to Mechanics, Waves and Fluids, and even Special Relativity and Thermodynamics. While being exposed to the beauty of nature is certainly a plus in this course, the main goal is instead to help the students develop strong problem-solving skills. In the BEMACS bachelor program, instead, I will teach the Computer programming course. This course takes the students a step further into the realm of coding, focusing on more advanced patterns, on computational efficiency and on the relationship between theory and algorithms. Biographical note I am an Assistant Professor in the new Computing Sciences Departments of Bocconi University, Milan. I obtained my PhD in 2018 from the Polytechnic of Turin, and then spent few years abroad, at Microsoft Research in Cambridge (MA, USA), at ENS in Paris and at EPFL in Lausanne. My work lies at the interface between Machine Learning and Statistical Physics, and aims to develop simple theoretical models that allow better understanding of the complex behavior of learning algorithms. Research interestsI’m currently interested in a range of supervised/semi-supervised learning paradigms that are gaining growing interest in the ML world. For example ML problems that involve multiple learning stages (transfer learning & continual learning, self-supervised learning, distillation, stochastic optimization), multiple learners (adversarial learning, multi-headed networks) and different data subsets (curriculum learning, ML fairness). Selected PublicationsCui, Hugo; Saglietti, Luca; Zdeborovà, LenkaLarge deviations in the perceptron model and consequences for active learningMACHINE LEARNING: SCIENCE AND TECHNOLOGY., 2021 Gerace, Federica; Saglietti, Luca; Sarao Mannelli, Stefano; Saxe, Andrew; Zdeborovà, LenkaProbing transfer learning with a model of synthetic correlated datasetsMACHINE LEARNING: SCIENCE AND TECHNOLOGY., 2022 Cui, Hugo; Saglietti, Luca; Zdeborovà, LenkaLarge deviations of semisupervised learning in the stochastic block modelPHYSICAL REVIEW. E, 2022 Saglietti Luca; Mannelli Stefano Sarao; Saxe AndrewAn Analytical Theory of Curriculum Learning in Teacher-Student Networks2021 Cui, Hugo; Saglietti, Luca; Zdeborova, LenkaLarge deviations for the perceptron model and consequences for active learningProceedings of Machine Learning Research. Vol. 107: Mathematical and Scientific Machine Learning, 20-24 July 2020, Princeton University, Princeton, NJ, USA, 2020 Saglietti, Luca; Zdeborova, LenkaSolvable model for inheriting the regularization through knowledge distillationProceedings of Machine Learning Research. Vol 145: 2nd Annual Conference on Mathematical and Scientific Machine Learning, 2021 Scroll to top",
  "content_length": 3212,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:26"
}