{
  "name": "Luca Citi",
  "homepage": "https://www.essex.ac.uk/people/citil35902/luca-citi",
  "status": "success",
  "content": "Luca Citi | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Luca Citi People Professor Luca Citi Professor School of Computer Science and Electronic Engineering (CSEE) Email lciti@essex.ac.uk Location 1NW.5.3C, Colchester Campus Academic support hours (Autumn term only) Monday, 9:00-9:50am, in 1NW.5.3C; Tuesday, 2:00-2:50pm, in 1NW.5.3C. Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr Luca Citi holds a degree in Electronic Engineering with major in Biomedical Engineering from Università di Firenze (Italy). He obtained a PhD in Biorobotics Science and Engineering jointly offered by Scuola Superiore Sant'Anna and IMT Lucca (Italy) with a thesis about the decoding of neural signals for the control of robotic arm prostheses. He was a post-doc at Essex in 2008 working on the EPSRC BCI-Mouse project. From 2010, he worked for three years as post-doc at Harvard Medical School and Massachusetts Institute of Technology specializing on statistical analysis of point processes (stochastic processes representing discrete events in time) applied to heartbeat series and neural spike trains (see http://users.neurostat.mit.edu/lciti/ ). In November 2012, he joined the School of Computer Science and Electronic Engineering at the University of Essex as Lecturer. In October 2016 he become a Reader in the same School, then a Professor in 2019. Qualifications PhD Sant'Anna School of Advanced Studies (joint with IMT Lucca), (2009) BSc+MSc Università degli Studi di Firenze, (2004) Appointments University of Essex Professor, School of Computer Science and Electronic Engineering, University of Essex (1/10/2019 - present) Reader, School of Computer Science and Electronic Engineering, University of Essex (1/10/2016 - 30/9/2019) Lecturer, School of Computer Science and Electronic Engineering, University of Essex (12/11/2012 - 30/9/2016) Research and professional activities Research interests stochastic models of neural and cardiovascular signals using history-dependent point processes Open to supervise machine learning applied to biomedical signals Open to supervise statistical learning theory Open to supervise big data analytics Open to supervise invasive neural interfaces Open to supervise non-invasive Brain-Computer Interfaces (BCIs) and Event-Related Potentials (ERPs) Open to supervise Teaching and supervision Current teaching responsibilities Team Project Challenge (CE201) Machine Learning (CE802) Current supervision Vishnu Pratap Singh Kirar Degree subject: Computer Science Degree type: Doctor of Philosophy Kiana Abolfathi Thesis title: Advancements in Magnetic Steering of Soft Magnetic Continuum Robots for Medical Applications Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Previous supervision Ana-Maria Dumitrana Thesis title: Computational Design of Dnazymes Degree subject: Cell and Molecular Biology Degree type: Doctor of Philosophy Awarded date: 15/5/2023 Ekin Yagis Thesis title: Diagnosis of Neurodegenerative Diseases Using Deep Learning Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 11/8/2022 Olivier Thill Thesis title: Approximate Credibility Intervals on Electromyographic Decomposition Algorithms Within a Bayesian Framework Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 23/7/2021 Eirini Christinaki Thesis title: Bayesian Transfer Learning for Personalized Well-Being Forecasting From Scarce, Sporadic Observations Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 20/1/2021 Publications Publications (6) Pansara, Z., Navyte, G., Freitas-Mendes, T., Bottger, C., Franco, E., Citi, L., Jacobi, ES., Poerio, GL., Gillmeister, H., Cinel, C. and Feo, VD., (2025). Quantifying Emotional Arousal through Pupillary Response: A Novel Approach for Isolating the Luminosity Effect and Predicting Affective States Lai, M., Chiara, M., Citi, L. and Diciotti, S., (2024). Pacgan: A Novel Deep Learning Framework for High-Resolution Conditional Mr Image Synthesis and Classification Alfeo, AL., Catrambone, V., Valenza, G., Cimino, M. and Citi, L., (2024). A Novel Counterfactual-Based Global Feature Importance Measure to Reduce Computational Costs in Eeg-Based Explainable Ai Models Citi, L., Su, J., Huang, L. and Michaelson, JS., (2023). Counting Cells by Age Tells Us About How, and Why, and When, We Grow, and Become Old and Ill Chodrow, P., Su, J., Lee, D., Ahmed, T., He, N., Ruben, DM., Tiwari, A., Mannherz, W., Citi, L., DiCorpo, D. and Michaelson, JS., (2021). How Our Cells Become Our Selves: The Cellular Phylodynamic Biology of Growth and Development Yagis, E., Atnafu, SW., de Herrera, AGS., Marzi, C., Giannelli, M., Tessa, C., Citi, L. and Diciotti, S., (2021). Deep Learning in Brain MRI: Effect of Data Leakage Due to Slice-level Split Using 2D Convolutional Neural Networks Show all Journal articles (85) Medellin-Gasque, R., Nordmark, H., Mullen, A., Citi, L., Perperoglou, A. and Lausen, KB., Modeling retail browsing sessions and wearables data. Archives of Data Science Ferdowsi, S., Foulsham, T., Rahmani, A., Ognibene, D., Citi, L. and Li, W., (2025). Identifying the human olfactory and chemosignaling neural networks using event related fMRI and graph theory. Scientific Reports. 15 (1), 12000- Eliasson, ET., Vigna, E., Dal Bò, E., Cecchetto, C., Zurlo, L., Gentili, C., Scilingo, EP., Greco, A., Di Francesco, F., Citi, L., Vanello, N., Lundström, JN., Hadlaczky, G. and Carli, V., (2025). A quasi-randomised pilot study on the efficacy and perceived usefulness of adding chemosignals to mindfulness practice for women with social anxiety. Scientific Reports. 15 (1), 32459- Lai, M., Marzi, C., Citi, L. and Diciotti, S., (2025). High-resolution conditional MR image synthesis through the PACGAN framework. Scientific Reports. 15 (1), 34241- Gioia, F., Greco, A., Callara, AL., Vanello, N., Scilingo, EP. and Citi, L., (2024). ThermICA: Novel Approach for a Multivariate Analysis of Facial Thermal Responses.. IEEE Transactions on Biomedical Engineering. 72 (4), 1237-1247 Maddalon, L., Cervera-Torres, S., Minissi, ME., Greco, A., Citi, L., Marin-Morales, J. and Alcañiz, M., (2024). Human Body Odors Modulation on Affective Processing of Social-Emotional Virtual Environments. Annual Review of CyberTherapy and Telemedicine. 22, 125-130 Nardelli, M., Citi, L., Barbieri, R. and Valenza, G., (2023). Characterization of autonomic states by complex sympathetic and parasympathetic dynamics. Physiological Measurement. 44 (3), 035004-035004 Carli, V., Petros, NG., Hadlaczky, G., Vitcheva, T., Berchialla, P., Bianchi, S., Carletto, S., Christinaki, E., Citi, L., Dinis, S., Gentili, C., Geraldes, V., Giovinazzo, L., Gonzalez-Martinez, S., Meyer, B., Ostacoli, L., Ottaviano, M., Ouakinin, S., Papastylianou, T., Paradiso, R., Poli, R., Rocha, I., Settanta, C., Scilingo, EP. and Valenza, G., (2022). The NEVERMIND e-health system in the treatment of depressive symptoms among patients with severe somatic conditions: A multicentre, pragmatic randomised controlled trial. eClinicalMedicine. 48, 101423-101423 Tremmel, C., Fernandez-Vargas, J., Stamos, D., Cinel, C., Pontil, M., Citi, L. and Poli, R., (2022). A meta-learning BCI for estimating decision confidence. Journal of Neural Engineering. 19 (4), 046009-046009 Cinel, C., Fernandez Vargas, J., Tremmel, C., Citi, L. and Poli, R., (2022). Enhancing performance with multisensory cues in a realistic target discrimination task. PLoS One. 17 (8), e0272320-e0272320 Fairbank, M., Samothrakis, S. and Citi, L., (2022). Deep Learning in Target Space. Journal of Machine Learning Research. 23, 1-46 Fernandez-Vargas, J., Tremmel, C., Valeriani, D., Bhattacharyya, S., Cinel, C., Citi, L. and Poli, R., (2021). Subject- and task-independent neural correlates and prediction of decision confidence in perceptual decision making. Journal of Neural Engineering. 18 (4), 046055-046055 Bhattacharyya, S., Valeriani, D., Cinel, C., Citi, L. and Poli, R., (2021). Anytime collaborative brain–computer interfaces for enhancing perceptual group decision-making. Scientific Reports. 11 (1), 17008- Fanfani, V., Citi, L., Harris, AL., Pezzella, F. and Stracquadanio, G., (2021). The landscape of the heritable cancer genome. Cancer Research. 81 (10), 2588-2599 Yagis, E., Workalemahu Atnafu, S., Garcia Seco De Herrera, A., Marzi, C., Giannelli, M., Tessa, C., Citi, L. and Diciotti, S., (2021). Deep Learning in Neuroimaging: Effect of Data Leakage in Cross-validation Using 2D Convolutional Neural Networks. Scientific Reports. 11 (1), 22544- Malesevic, N., Björkman, A., Andersson, GS., Matran-Fernandez, A., Citi, L., Cipriani, C. and Antfolk, C., (2020). A database of multi-channel intramuscular electromyogram signals during isometric hand muscles contractions.. Scientific Data. 7 (1), 10- Carli, V., Wasserman, D., Hadlaczky, G., Petros, NG.",
  "content_length": 44880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:20"
}