{
  "name": "Luca Daniel",
  "homepage": "http://www.mit.edu/~dluca",
  "status": "success",
  "content": "Homepage of Luca Daniel Luca Daniel Research: Work Homepage Curriculum Vitae Short Bio Research Group Website Selected Publications on Magnetic Resonance and Biomedical Systems: I. Giannakopoulos, G D. Guryev; J. E. C. Serrallés; I. P. Georgakis; L. Daniel, J, K, White, R. Lattanzi, “Compression of volume-surface integral equation matrices via Tucker decomposition for magnetic resonance applications”, IEEE Antenna Propagation Symposium, 2023 (APS Best Paper Award) B Guerin, J Villena,  A Polimeridis, E Adalsteinsson, L Daniel, J K White, L Wald, “The ultimate signal-to-noise ratio in realistic body models”. Journal of Magnetic Resonance in Medicine, 78: C1. doi:10.1002/mrm.26449 Nov 2017 (Nov 2017 Journal Cover) J E C Serrallés, I Georgakis, A G Polimeridis, L Daniel, J K White, D K Sodickson, R Lattanzi, \"Volumetric Reconstruction of Tissue Electrical Properties from B1+ and MR Signals Using Global Maxwell Tomography: Theory and Simulation Results, ISMRM: International Society for Magnetic Resonance in Medicine, Apr 2017. (ISMRM Best Poster Award Finalist) J.E.C. Serrallés, A.G. Polimeridis, M.V. Vaidya, G. Haemer, J.K. White, D.K. Sodickson, L. Daniel, R. Lattanzi. “Global Maxwell Tomography: a novel technique for electrical properties mapping without symmetry assumptions or edge artifacts”, ISMRM Singap, May2016. (ISMRM Best Poster Award Finalist) I. Butterworth, J. Seralles, C.S. Mendoza, L. Giancardo, L. Daniel: A wearable physiological hydration monitoring wristband through multi-path non-contact dielectric spectroscopy in the microwave range. IEEE MTT-S 2015 (IMWS-BIO), Taipei, Page(s):60-61 Sep. 2015 (IMWS-BIO Best Student Paper Award) J. Fernandez Villena, A. G. Polimeridis, B. Guerin, Y. Eryaman, L. L. Wald, E. Adalsteinsson, J. K. White, and L. Daniel. “Fast Electromagnetic Analysis of Transmit RF Coils based on Accelerated Integral Equation Methods”. International Society for Magnetic Resonance in Medicine (ISMRM) 2014 Annual Meeting. Milan, Italy May, 2014. (ISMRM Summa cum Laude Merit Award) J. F. Villena, A. G. Polimeridis, B. Guerin, Y. Eryaman, L. L. Wald, E. Adalsteinsson, J. White, and L. Daniel, “Fast Electromagnetic Analysis of Transmit RF Coils based on Accelerated Integral Equation Methods”, International Society for Magnetic Resonance in Medicine (ISMRM) 2014 Annual Meeting. Milan, Italy. May 2014. (ISMRM Summa cum Laude Merit Award) Z. Mahmood, B. Guérin, B. Keil, E. Adalsteinsson, L. L. Wald and L. Daniel. “Design of a Robust Decoupling Matrix for High Field Parallel Transmit Arrays”. International Society for Magnetic Resonance in Medicine (ISMRM) 2014 Annual Meeting. Milan, Italy May, 2014. (ISMRM Magna Cum Laude Merit Paper Award). Selected Publications on System Identification: T. Bradde, S. Grivet-Talocia, G. C. Calafiore, A. Proskurnikov, Z. Mahmood, L. Daniel, On Dissipativity Conditions for Linearized Models of Locally Active Circuit Blocks, In: Electrical Performance of Electronic Packaging and Systems (EPEPS), 2020. (EPEPS Best Conference Paper Award) Z. Mahmood, S. Grivet-Talocia, G.C. Calafiore, L. Daniel (2014). Optimal passivity enforcement of state-space models via localization methods. In: Electrical Performance of Electronic Packaging and Systems (EPEPS), 2014 IEEE 23rd Conference on, Portland, OR, 26-29 Oct. 2014. pp. 89-92 (EPEPS Best student paper award) Z. Mahmood, L. Daniel, \"Guaranteed Passive Parameterized Modeling of Multiport Passive Circuit Blocks\", Proc. of TECHCON11, Austin TX, Sept. 2011. (Techcon Best Paper & Presentation Award). Z. Mahmood, B. Bond, L. Daniel, “System Level Modeling and Simulation of Analog Circuits Using Semidefinite Programming Based Compact Modeling Techniques”, Proc. of TECHCON 2010 conference, Austin, TX, 13-14 Sept. 2010. (Techcon Best Paper and Presentation Award). B. Bond, Z. Mahmood, R. Sredojevic, Y. Li, A. Megretski, V. Stojanovic, Y. Avniel, L. Daniel, “Compact Stable Modeling of Nonlinear Analog Circuits using System Identification via Semi-Definite Programming and Robustness Certification,” IEEE Trans. on Computer Aided Design of Integrated Circuits and Systems, vol. 29,no 8, p. 1149-1162, August 2010. K. C. Sou, A. Megretski, L. Daniel, \"A Quasi-Convex Optimization Approach to Parameterized Model Order Reduction\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 27, no. 3, p. 456-469, March 2008. Selected Publications on Tensors and Handling High Dimensional Data Z Zhang, T-W Weng and L Daniel, “Big-data tensor recovery for high-dimensional uncertainty quantification of process variations,” IEEE Trans. Component, Packaging and Manufacturing Technology. Page(s): 687 – 697 Volume: 7, Issue: 5, May 2017.  (Best Paper Award IEEE Trans. Components, Packaging and Manufacturing Technology) Z Zhang, K Batselier, H Liu, L Daniel, N Wong “Tensor Computation: A New Framework for High-Dimensional Problems in EDA, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems”, pp. 521-536, vol. 36, no. 4, April 2017. (IEEE Transaction Keynote Paper) Z. Zhang, T.-W. Weng, L. Daniel, \"A big-data approach to handle process variations: uncertainty quantification by tensor recovery,\" IEEE Workshop on Signal and Power Integrity, 4 pages, Turin, Italy, May 2016. (SPI Best Paper Award) H. Liu, L. Daniel, N. Wong: Model Reduction and Simulation of Nonlinear Circuits via Tensor Decomposition. IEEE Trans. on CAD of Integrated Circuits and Systems 34(7): 1059-1069 Jul 2015. Z Zhang, X Yang, I V. Oseledets, G E. Karniadakis, L. Daniel: Enabling High-Dimensional Hierarchical Uncertainty Quantification by ANOVA and Tensor-Train Decomposition. IEEE Trans. on CAD of Integrated Circuits & Systems 34(1): 63-76 (Jan 2015). (TCAD Popular Paper) Selected Publications on Model Order Reduction: Z. Zhang, I. M. Elfadel, L. Daniel, \"Model order reduction of fully parameterized systems by recursive least square optimization,\" Int. Conf. Computer-Aided Design (ICCAD), pp. 523-530, San Jose, CA, Nov. 2011. (IEEE/ACM William J. McCalla ICCAD Best Paper Award Nomination) Z. Zhang, Q. Wang, N. Wong, L. Daniel, “A moment-matching scheme for the passivity-preserving model order reduction of indefinite descriptor systems with possible polynomial parts,” in Proc. Asia and South Pacific Design Automation Conference (ASP-DAC), pp. 49-54, Yokohama, Japan, Jan. 2011. (ASP-DAC Best Paper Award Nomination) B. Bond, L. Daniel, \"Stable Reduced Models for Nonlinear Descriptor Systems Through Piecewise-Linear Approximation and Projection\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 28, no. 10, p. 1467-1480, October 2009. B. Bond and L. Daniel, \"Guaranteed Stable Projection-Based Model Reduction for Indefinite and Unstable Linear Systems\" Proceedings of the IEEE Conference on Computer-Aided Design, San Jose, p. 728-35, November 2008. (IEEE/ACM William J. McCalla ICCAD Best Paper Award). L. Daniel, C. S. Ong, S. C. Low, K. H. Lee, J. White, \"A Multiparameter Moment Matching Model Reduction Approach for Generating Geometrically Parameterized Interconnect Performance Models\", IEEE Transaction on Computer Aided Design of Integrated Circuits and Systems, vol. 23, no. 5, p. 678-93, May 2004. (More than 290 citations as of April 2016). J. Phillips, L. Daniel, L. M. Silveira, \"Guaranteed Passive Balancing Transformations for Model Order Reduction\", IEEE/ACM 39th Design Automation Conference, New Orleans, LA, p. 52-7, June 2002. (DAC Best Paper Award, More than 290 citations as of April 2016). Selected Publications on Quantification of the Lack of Robustness in Deep Neural Networks H Zhang, T-W Weng, P-Y Chen, C-J Hsieh, L Daniel, \"Efficient Neural Network Robustness Certification with General Activation Functions\" NeurIPS: Conference on Neural Information Processing Systems, p:4944-4953, Dec 2018 T-W Weng, H Zhan1, H Chen, Z Song, C-J Hsieh, D Boning, I Dhillon, Luca Daniel, “Toward Fast Computation of Robustness for ReLU Networks”, ICML: International Conference on Machine Learning, Jun 2018 T-W Weng, H Zhang, P-Y Chen, J Yi, D Su, Y Gao, C-J Hsieh, L Daniel, “Evaluating the Robustness of Neural Networks: An Extreme Value Theory Approach”, ICLR: International Conference on Learning Representations, Vancouver, May 2018 T-W. Weng, R. Mazumder, L. Daniel, “Computing Least Trimmed Squares Regression to Certifiable Optimality”, NIPS - Conf. on Neural Information Processing Systems – Women in Machine Learning Workshop, Long Beach, CA, Dec. 2017. T-W Weng, L. Daniel, \"Robust PCA through Robust Optimization, NIPS - Conf. on Neural Information Processing Systems – Women in Machine Learning Workshop, Long Beach, CA, Dec 2017. Selected Publications on Stochastic Electromagnetic Solvers: Z Zhang, S El-Henawy, A Sadun, R Miller, L Daniel, ‘Adjoint-Based Sensitivity Analysis for Silicon Photonic Variations’, IEEE MTT-S: Intl. Conf. on Numerical Electromagnetic and Multiphysics Modeling and Optimization, Cambridge, May 2019. (Invited paper). P Maffezzoni, Z. Zhang, S. Levantino, L Daniel, “Variation-Aware Modeling of Integrated Capacitors Based on Floating Random Walk Extraction,” TCAD: IEEE Transaction on Computer Aided Design of Integrated Circuits and Systems, 37(10): 2180-2184, Oct  2018. W. Yu B. Zhang, C. Zhang, H Wang, L. Daniel, “Utilizing Macromodels in Floating Random Walk Based Capacitance Extraction\", IEEE/ACM Design Automation Conference in Europe, Dresden March 2016. (IEEE DATE Best Paper Award) T. Moselhy, L. Daniel, “Variation-Aware Stochastic Extraction with Large Parameter Dimensionality: Review and Comparison of State of the Art Intrusive and Non-Intrusive Techniques”, International Symposium on Quality Electronic Design (ISQED), Santa Clara, CA March 2011. (Invited Paper) T. Moselhy, I. Elfadel, L. Daniel, “A Markov Chain Based Hierarchical Algorithm for Capacitance Extraction”, IEEE Trans. on Advanced Packaging, vol. 33,no 4,p. 818-828, Nov. 2010. (Invited Paper). T. El-Moselhy, L. Daniel, ",
  "content_length": 22941,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:20"
}