{
  "name": "Luca Deri",
  "homepage": "http://luca.ntop.org",
  "status": "success",
  "content": "Luca Deri's Home Page Luca Deri Open-Source Networking University of Pisa Computer Science Department Room 394 Largo B.Pontecorvo 3 56127 Pisa Italy Email: deri@ntop.org PGP: key Scholar: h-index LinkedIn: profile Job: Research Scientist and Network Manager. Goal: Help in making the world a better place (for programmers). Carry the flame forward! Welcome and Thanks for visiting my home page. I was born in 1968. Although I was far too young to remember, the keywords of that year were freedom, equality, free thinking, revolution. In early 70s many free radio stations had birth here in Italy because their young creators wanted to have a way for spreading their thoughts, ideas, emotions and tell the world that they were alive 'n kickin'. The Internet today represents for me what free radio represented in the 70s. This page is here because of my need to tell everybody what I think, do, create. Herein you can find all I've been able to do in the last years that is my humble and tiny contribution to computer science (r)evolution. I was not born in 1968 by coincidence! Thanks for being here. Teaching Activities Corso di Gestione di Rete [Italian] Programma Gruppo Telegram: @gestionedirete Materiale per il corso 2024/25 Progetti Studenti Corso Gestione di Rete [2001-Oggi] Supervisione Tesi di Laurea Nicolò FontanarosaGenerazione semi-automatica di regole per la classificazione del traffico di reteDicembre 2025. Francesca FunaioliA Semi-automatic Method for Mobile Application Network Traffic ClassificationDicembre 2025. Andrea LuchettiAnalisi e Mitigazione Di Scan e Abusi Nel Traffico WebLugiio 2025. Francesco Pio MagrìTecniche di Riconoscimento e Offuscamento del Traffico di ReteLugiio 2025. Alessia GaglianoMalware Classification with Markov ChainsFebbraio 2025. Lorena ModicaHoneypot per Sistemi di Controllo Industriale (ICS)Aprile 2024. Luca FerrettiIntegrazione di DPI in un IPS Open SourceAprile 2024. Francesco PisaniFuzzing of Industrial Control SystemsOttobre 2023. Filippo Boni e Giovanni BracciniDecoding the Cyber Threat Landscape: A Honeypot Data Analysis Across Cloud ProvidersOttobre 2023. Rodrigo CasellaOS fingerprinting passivo tramite clustering gerarchicoLuglio 2023. Sergio Garrido De CastroAnalysis of network traffic on the public network through a honeypotLuglio 2023. Francesco LorenzoniCorrelazione di allarmi di rete e rilevamento anomalie su serie temporaliMaggio 2023. Alberto MartinoAnalisi e caratterizzazioni del traffico di rete mediante tecniche di DPIOttobre 2022. Nicola ColtelliRilevazione di Correlazioni tra Serie TemporaliDicembre 2021. Alessio PeruginiRilevazione di malware tramite l'identificazione di comportamenti anomaliMaggio 2021. Samuele SabellaDetecting network anomalies using the feature space latent representationMarzo 2021. Francesco CarliImplementazione di un network overlay distribuito per comunicazioni sicureDicembre 2020. Matteo BiscosiDisegno ed implementazione di un IDS basato su DPIOttobre 2020. Andrea BonannoVisibilita` nei container Linux tramite eBPF e riconoscimento in tempo reale di anomalieGiugno 2020. Simone RicciRilevazione di anomalie nel traffico di rete senza lâutilizzo di tecniche di Machine LearningDicembre 2019. Marco BianucciUtilizzo degli allarmi di sicurezza nel monitoraggio del traffico di reteDicembre 2019. Alessandro CecchiScripting e patching: soluzioni per sicurezza e business continuity con Datto RMM e Autotask PSA Dicembre 2019. Marco PiangatelloTecniche per il riconoscimento di esfiltrazione di dati da sistemi informatici Luglio 2019. Salvatore CostantinoRilevazione di anomalie di rete mediante analisi su serie temporali Luglio 2019. Daniel CasenoveRilevazione di disservizi nella connettivit`a di rete [ GitHub ]Giugno 2019. Edoardo MaioneAnalisi di dispositivi connessi in rete ediante lâutilizzo di traffico Broadcast e MulticastNovembre 2018. Fulvio SchianoMonitoraggio di sistemi connessi in rete usando dati di telemetriaOttobre 2018. Riccardo ColavitaUtilizzo di eBPF per lâanalisi del traffico di rete di sistemi LinuxAprile 2018. Elif Beraat IzgorduIdentifying and removing abnormal traffic from the UCSD network telescopeDicembre 2017. Michele CampusCaratterizzazione del contenuto del traffico di reteLuglio 2017. Lorenzo VannucciIndicizzazione e compressione di flussi di reteAprile 2017. Emanuele FarandaIndentificazione Automatica di Macro-Arrività nel Traffico di ReteOttobre 2016. Lorenzo BrunettiRilevazione Automatica di Disservizi di ReteMarzo 2016. Antonino LoreficeCreazione di un sistema di reputazione per domini InternetOttobre 2013. Francesco BaldiniDPI per traffico HTTP implementato in FastFlowAprile 2013. Daniele De SensiDPI over commodity hardware: implementation of a scalable framework using FastFlowFebbraio 2013. Daniele SartianoDisegno e implementazione di un framework per la misura qualitativa dei servizi di reteMarzo 2011. Alfredo CardiglianoTowards wire-speed network monitoring using Virtual MachinesMarzo 2011. Andrea ParrellaArchitettura Distribuita per il Monitoraggio di Rete Near-RealtimeMarzo 2011. Marco CornoltiPrevenzione dello Spam via VoIP basati su Web of TrustOttobre 2009. Francesco FuscoEnterprise Voice-over-IP Traffic MonitoringLuglio 2008. Davide MariniAnalisi qualitativa di reti wifi attraverso l'individuazione di parametri significativi e la rilevazione dello spostamento degli utentiGiugno 2008. Maria TetiDisegno e validazione di un'architettura distribuita per il monitoraggio del traffico di reteAprile 2005. Gaia MaselliRiconoscimento di Comportamenti di Rete InattesiSettembre 2001. Mirko FiloniComputing Assets Categorization According to Collected Configuration and Usage InformationNovembre 2001 PhD Thesis A Component-based Architecture for Open, Independently Extensible Distributed Systems. University of Berne, Switzerland, June 1997. Papers I Have Published Recently 2024 L. Deri, A. Cardigliano, F. FuscoAdvancements in Traffic Processing Using Programmable Hardware Flow OffloadProceedings of NetAccell-AI / IEEE HPSR 2024, 2024. F. Baiardi, F. Boni, G. Braccini, E. Briganti, and L. DeriKex-Filtering: A Proactive Approach to FilteringProceedings of SECRYPT 2024, 2024. 2023 L. Deri and F. FuscoEvaluating IP Blacklists EffectivenessProceedings of 6th International Workshop on Cyber Security (CSW-2023), 2023. 2022 L. Deri and A. CardiglianoUsing CyberScore for Network Traffic MonitoringProceedings of 2022 IEEE Intl Conference on Cyber Security and Resilience, 2022. 2021 L. Deri and F. FuscoUsing Deep Packet Inspection in CyberTraffic AnalysisProceedings of 2021 IEEE Intl Conference on Cyber Security and Resilience, 2021. 2020 L. Deri and D. SartianoMonitoring IoT Encrypted Traffic withâ¨ Deep Packet Inspection and Statistical Analysis [ IEEE ]Proceedings of 15th Intl Conference for Internet Technology and Secured Transactions (ICITST-2020), 2020. L. Deri and D. SartianoUsing DPI and Statistical Analysis in Encrypted Network Traffic Monitoring Intl Journal for Information Security Research, Volume 10 Issue 1,, 2020. 2019 D. Sartiano, L. Deri, and othersSuspicious Network Event Recognition Leveraging on Machine LearningProceedings of IEEE Intl Conference on Big Data, 2019. L. Deri, S. Sabella, and M. MainardiCombining System Visibility and Security Using eBPFProceedings of ITASEC 2019, 2019. 2018 L. Deri and A. Del SoldatoAn Architecture for Distributing andâ¨ Enforcing IoT Security at the Network EdgeProceedings of iThings 2018, 2018. L. Deri and A. Del SoldatoEnforcing Security in IoT and Home NetworksProceedings of ITASEC 2018, 2018. 2017 D. Lemire, O. Kaser, N. Kurz, L. Deri and othersRoaring Bitmaps: Implementation of an Optimized Software LibrarySoftware: Practice and Experience, 2017. 2016 A. Cardigliano, L. Deri and T. LundstromCommoditising DDoS MitigationProceedings of TRAC Workshop 2016, September 2016. 2015 L. Deri and othersImplementing Web Classification for TLDsProceedings of WI-IAT 2015, December 2015. L. Deri and othersLarge Scale Web-Content ClassificationProceedings of 7th Intl Conference on Knowledge Discovery and Information Retrieval, November 2015. 2014 L. Deri, M. Martinelli, A. CardiglianoRealtime High-Speed Network Traffic Monitoring Using ntopngProceedings of LISA 2014 workshop, November 2014. L. Deri, M. Martinelli, A. CardiglianonDPI: Open-Source High-Speed Deep Packet InspectionProceedings of TRAC 2014 workshop, August 2014. 2013 Luca Deri and Alfredo Cardigliano10 Gbit Line Rate Packet-to-Disk Using n2diskProceedings of TMA 2013 workshop, April 2013. Luca Deri and othersGPUs for real-time processing in HEP trigger systemsProceedings of ACAT 2013 conference, May 2013. Luca Deri, Simone Mainardi, Maurizio Martinelli, and Enrico GregoriExploiting DNS Traffic to Rank Internet DomainsProceedings of Tricans 2013 workshop, June 2013. Luca Deri, Simone Mainardi, Maurizio Martinelli, and Enrico GregoriGraph Theoretical Models of DNS TrafficProceedings of TRAC 2013 workshop, July 2013. Luca Deri and Francesco FuscoRealtime MicroCloud-based Flow Aggregation for Fixed and Mobile Networks Proceedings of TRAC 2013 workshop, July 2013. Marco Danelutto, Deri Luca, Daniele De Sensi, Massimo TorquatiDeep Packet Inspection on Commodity Hardware using FastFlowProceedings of ParCo 2013, September 2013. Luca Deri and Francesco FuscoMicroCloud-based Network Traffic Monitoring Poster session of IM 2013, May 2013. Francesco Fusco, Michail Vlachos, Xenofontas Dimitropoulos, Luca DeriIndexing million of packets per second using GPUs [ Video ]Proceedings of IMC 2013, October 2013. 2012 Luca Deri, Lorenzo Luconi Trombacchi, Maurizio MartinelliUnveiling Interests and Trends Using The DNS (Best Paper Award) Processings of IADIS 2012, November 2012. Luca Deri, Lorenzo Luconi Trombacchi, Maurizio Martinelli, Daniele VannozziA Distributed DNS Traffic Monitoring System [IEEE]Proceedings of TRAC 2012, August 2012. Luca Deri, Lorenzo Luconi Trombacchi, Maurizio Martinelli, Daniele VannozziTowards a Passive DNS Monitoring Sy",
  "content_length": 16711,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:21"
}