{
  "name": "Luca Breveglieri",
  "homepage": "https://www.deib.polimi.it/eng/people/details/110272",
  "status": "success",
  "content": "People - DEIB People Person details BREVEGLIERI LUCA ODDONE Associate professor Campus:Building 20Floor:1°Office:005Ph.:3653 Research areas: Computer Science and Engineering Research Line: System architectures [javascript protected email address] Born in Italy on 4 april 1962. Master in Electronic Eng. (1986). Ph.D. in Electronic Eng. of Information and Systems (1991). Computer technician and network administrator (1991-1998). Associate professor from 1998 by Politecnico di Milano, Italy. Teaching: from 2001 “Computer Architecture and Operating Systems\" (previously \"Informatics II”) – basics of operating systems and computer architecture – bachelor in Computer Engineering; from 2005 “Formal Languages and Compilers” - basics of artificial languages, syntax and compiler construction – master in Computer Engineering; in previous years (from 1998) “Foundamentals of Cryptography” (principles of cryptography, algorithms and architectures), “Informatics I” (computer programming) and “Electronic Computers” (switching theory and computer architecture); various doctoral courses, as well as master courses for private companies, on cryptography and computer architecture. For more details on the institutional courses see the website of Politecnico di Milano.Research: Since the master degree he has been working mainly in the field of microelectronic VLSI architectures and applied cryptography, and partly in that of artificial languages. Specific topics: design of hardware architectures for computer arithmetic, and for signal and image processing; design of architectures (hardware and software) for complex and innovative cryptographic algorithms, and methods for securing computing devices and systems; formal languages for modelling complex systems, and syntax analysis and compilation. The research in computer arithmetic and signal-image processing has included: design of VLSI architectures for fast multiplication and fast discrete convolution (filtering).The research in applied cryptography includes: efficient VLSI architectures for innovative and computing-intensive algorithms like elliptic curves, pairing systems, and others; power and fault-based attacks to hardware and software cryptographic systems; protection methods against fault-based attacks by means of fault diagnosis and tolerance techniques. The research in formal languages includes: study of languages for modelling complex concurrent systems, and efficient syntax analysis and code generation.Since 2004 he has been organizing the workshop “Fault Diagnosis and Tolerance in Cryptography”, FDTC, in collaboration with the University of Massachusetts at Amherst (MA, USA), dedicated to applied cryptography and to the attacks to devices and systems. Since 2015 he has been organizing the workshop \"Mobile Systems Technologies\", MST, in collaboration with Micron, Inc., dedicated to the hardware architectures (processor and memory) and to the security of mobile systems. He is reviewer and has been guest editor for a few international journals, to include the IEEE Transactions on Computers. Projects:In the mid ’90 he collaborated with CERN to the FERMI project (RD-16) on the reliability issues of the data acquisition systems for high energy physics experiments for the LHC particle collider.He has carried out an european industrial research project MEDEA+ CRYPTOSOC (2002-2004) related to the methodologies for the realization of cryptography in high-end servers, in collaboration with Italian and foreign partners: Politecnico di Torino, ST Microelectronics, BULL, SAGEM, AMTEC, I2E, CEA, and others.He has carried out an european industrial reserach project JU ENIAC TOISE (2011-2014) on the realization of security in electrical smart grids, for smart metering and multimedia gateway applications, in collaboration with national and foreign partners: Università di Milano Bicocca, Università della Cantabria, ST Microelectronics, AZCOM, Thales, CEA-LETI, PWI, HAI, and others.He has a research collaboration with ST Microelectronics, related to the design of efficient VLSI architectures for cryptography, and to the protection against attacks to hardware and software cryptographic systems.Organization:He was scientific advisor at ASICT (Area Servizi ICT), Politecnico di Milano, and delegate by CINECA (previously CILEA), Italy, and currently he has the task of supervising supercomputing activities on account for Politecnico di Milano. He is member of the \"Comitato di Iniziativa e Monitoraggio\" of the co-funded supercomputing program LISA (Laboratorio Informatico di Simulazione Avanzata), Politecnico di Milano - Regione Lombardia.Publications:He is co-author of about 120 papers published on international journals and conference proceedings, on his research topics. Since 1987 to day he has made several translations (from English to Italian) of scientific textbooks on operating systems, computer architecture and computer networks, by Zanichelli, McGraw-Hill and Morgan Kaufmann publishing.He has published the international text S. Crespi Reghizzi, L. Breveglieri, A. Morzenti, \"Formal Languages and Compilation\" (2nd edition), Springer-Verlag, 2013, and the related italian translation “Linguaggi Formali e Compilazione”, Società Editrice Esculapio, 2015.",
  "content_length": 5267,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:19"
}