{
  "name": "Lucas Carvalho Cordeiro",
  "homepage": "https://ssvlab.github.io/lucasccordeiro",
  "status": "success",
  "content": "Lucas Cordeiro Lucas Cordeiro About News Grants Publications Supervisions Tools Courses Selected Papers SMT-based Bounded Model Checking for Embedded ANSI-C Software Verifying Multi-threaded Software using SMT-based Context-Bounded Model Checking Model Checking LTL Properties over ANSI-C Programs with Bounded Traces Automated Formal Synthesis of Digital Controllers for State-Space Physical Plants SMT-Based Context-Bounded Model Checking for CUDA Programs Handling Loops in Bounded Model Checking of C Programs via k-Induction DSVerifier-Aided Verification Applied to Attitude Control Software in Unmanned Aerial Vehicles Model checking C++ programs Selected Tools DSVerifier ESBMC, ESBMC-GPU and ESBMC-QtOM. JBMC Selected Talks Security of Software Systems with Applications on the Internet of Things. The video is available [here] EnnCore – Special Session. The video is available [here] Exploiting the SAT Revolution for Automated Software Verification and Synthesis. The video is available [here] Systems and Software Security (S3) Research Group The video is available [here] Lucas C. Cordeiro is a Full Professor in the Department of Computer Science (CS) at the University of Manchester (UoM), where he leads the Systems and Software Security (S3) Research Group. Prof. Cordeiro is also the Business Engagement and Innovation Director in the CS department and the Arm Centre of Excellence Director at UoM. In addition, he is affiliated with the Trusted Digital Systems Cluster at the Centre for Digital Trust and Society, the Formal Methods Group at UoM, and the Post-Graduate Programs in Electrical Engineering (PPGEE) and Informatics (PPGI) at the Federal University of Amazonas, Brazil. He is the Chief Technology Officer at VeriBee, a spinout from the University of Manchester that aims to revolutionize the software testing/verification market; he is also a member of the technical advisory board at Axiomise. Before joining the University of Manchester, he worked as a post-doctoral researcher at the University of Oxford and as a research engineer at Diffblue. In addition, Dr. Cordeiro worked for five years as a software engineer at Siemens / BenQ Mobile and CTPIM / NXP semiconductors. His work focuses on software model checking, automated testing, program synthesis, software security, embedded and cyber-physical systems. He has co-authored more than 170 peer-reviewed publications in the most prestigious venues (e.g., ICSE, CAV, TACAS, FSE, ASE, ISSTA, TSE, TR, TC). He has received various international awards, including the Most Influential Paper at ASE'23, the Distinguished Paper Award at ICSE’11 and ASE'24, and 50 awards from international competitions on software verification (SV-COMP) and testing (Test-Comp) from 2012 to 2025. He has a proven track record of securing research funding from EPSRC, Intel, Motorola, Samsung, Nokia Institute of Technology, CNPq, FAPEAM, British Council, and Royal Society (career total over USD 13M). [Full CV] Recent Papers Supporting Software Formal Verification with Large Language Models: An Experimental Study REQINONE: A Large Language Model-Based Agent for Software Requirements Specification Generation GPT, But Backwards: Exactly Inverting Language Model Outputs ESBMC v7.6: Enhanced model checking of C++ programs with clang AST CASTLE: Benchmarking Dataset for Static Code Analyzers and LLMs towards CWE Detection VO-GCSE: Verification Optimization through Global Common Subexpression Elimination ESBMC v7.7: Automating Branch Coverage Analysis Using CFG-Based Instrumentation and SMT Solving SecureFalcon: Are We There Yet in Automated Software Vulnerability Detection with LLMs? ESBMC v7.7: Efficient Concurrent Software Verification with Scheduling, Incremental SMT and Partial Order Reduction A New Era in Software Security: Towards Self-Healing Software via Large Language Models and Formal Verification How secure is AI-generated code: a large-scale comparison of large language models LLM-Generated Invariants for Bounded Model Checking Without Loop Unrolling ESBMC-Python: A Bounded Model Checker for Python Programs JCWIT: A Correctness-Witness Validator for Java Programs Based on Bounded Model Checking FuSeBMC v4: Improving Code Coverage with Smart Seeds via BMC, Fuzzing and Static Analysis Verifying components of Arm® Confidential Computing Architecture with ESBMC A Fuzzing-Based Test-Creation Approach for Evaluating Digital TV Receivers via Transport Streams Rapid Taint Assisted Concolic Execution (TACE) Revolutionizing Cyber Threat Detection With Large Language Models: A Privacy-Preserving BERT-Based Lightweight Model for IoT/IIoT Devices ESBMC v7.4: Harnessing the Power of Intervals (Competition Contribution) Counterexample Guided Neural Network Quantization Refinement His list of publications can be seen from DBLP, ACM Author Profile, ArnetMiner, SCOPUS, Web of Science, and Google Scholar. LinkedIn profile available here. News News (December-2023)! Will start a project on “AICodeRepair: Towards Self-Healing AI Code with Large Language Models and Formal Verification\" with the GCHQ Government Communications Headquarters, 2023-2024, in collaboration with Dr Mustafa Mustafa. (August-2022)Will start a project on “Bounded Model Checking for Verifying and Testing Ethereum Consensus Specifications” with the Ethereum Foundation, 2023-2024, in collaboration with Dr Youcheng Sun. (August-2022) Will start a project on “Using Artificial Intelligence/Machine Learning to assess source code in Escrow” with the UKRI/IAA, 2022-2023, in collaboration with Dr. Richard Allmendinger and Dr. Andre Freitas. (Dec-2021): FuSeBMC, our white-box fuzzer for finding security vulnerabilities in programs, won first place in the Cover-Error, Cover-Branches and Overall categories at Test-Comp 2022. JBMC, our verification tool for Java Bytecode, won second place in the Java overall category at SV-COMP 2022. ESBMC, our SMT-based model checker for C/C++ programs, has successfully participated at SV-COMP 2022. It got second place in three sub-categories, third in one sub-category, fourth in the ReachSafety category, seventh place among 40 state-of-the-art software verifiers at SV-COMP 2022! (Jun-2021): I became the new Director of the Arm Centre of Excellence at the University of Manchester. (Dec-2020): FuSeBMC, our white-box fuzzer for finding security vulnerabilities in programs, won first place in the Cover-Error category and second place in the Overall category at Test-Comp 2021. JBMC, our verification tool for Java Bytecode, won third place in the Java overall category at SV-COMP 2021. ESBMC, our SMT-based model checker for C/C++ programs, has successfully participated at SV-COMP 2021. It got first place in one sub-category, second place in four sub-categories, fourth place in the ReachSafety category, fifth place in the SoftwareSystems category. Overall, the sixth place among 25 state-of-the-art software verifiers at SV-COMP 2021! (Nov-2020): Will start a UKRI project on \"Soteria - Demonstrating the Security Capabilities of the Morello System in the ecommerce Vertical Industrial Segment\" over the call for ISCF digital security by design: technology enabled business-led demonstrator. (August-2020): Will start an EU project on \"ELEGANT: sEcure and seamLess EdGe-to-cloud ANalyTics\" over the call for Software Technologies. (Jul-2020): Will start an EPSRC project on \"SCorCH: Secure Code for Capability Hardware\" over the call for ISCF Digital Security by Design Research Projects. (Feb-2020): Will start an EPSRC project on \"EnnCore: End-to-End Conceptual Guarding of Neural Architectures\" over the call for Security for all in an AI enabled society. Grants 1. SECCOM: Securing composable hardware platforms, DSTL (Defence Science & Technology Laboratory), Engineering & Physical Sciences Research Council (EPSRC), 2023-2025, in collaboration with Prof. John Goodacre and Dr. Bernardo Magri from the University of Manchester (I am the Principal Investigator). 2. AICodeRepair: Towards Self-Healing AI Code with Large Language Models and Formal Verification, GCHQ Government Communications Headquarters, 2023-2024, in collaboration with Dr. Mustafa Mustafa from the University of Manchester (I am the Principal Investigator). 3. Using Artificial Intelligence/Machine Learning to assess source code in Escrow, UKRI Impact Acceleration Account, 2023-2024, in collaboration with Dr. Richard Allmendinger and Dr. Andre Freitas from the University of Manchester (I am the Principal Investigator). 4. Bounded Model Checking for Verifying and Testing Ethereum Consensus Specifications, Ethereum Foundation, 2023-2024, in collaboration with Dr. Youcheng Sun from the University of Manchester (I am the Co-Investigator). 5. Soteria - Demonstrating the Security Capabilities of the Morello System in the e-commerce Vertical Industrial Segment over the call for “ISCF digital security by design: technology enabled business- led demonstrator”, 2021-2024, in collaboration with Prof. Mikel Lujan, Dr. Konstantin Korovin, Dr. Giles Reger, Dr. Christos Kotselidis, Dr. Elvira Uyarra, Dr. Richard Allmendinger, and Dr. Pierre Olivier from the University of Manchester (UK) (I am the Co-Investigator). 6. ELEGANT: sEcure and seamLess EdGe-to-cloud ANalyTics, EU over the call for “Software Technologies”, 2021-2023, in collaboration with Dr. Christos Kotselidis from the University of Manchester (UK) (I am the Co-Investigator). 7. EnnCore: End-to-End Conceptual Guarding of Neural Architectures, EPSRC over the call for ``Security for all in an AI-enabled society'', 2021-2024, in collaboration with Prof. Gavin Brown, Prof. Mikel Lujan, Dr. Mustafa Mustafa, Dr. Andre Freitas from University of Manchester (UK) and Dr. Xiaowei Huang from University of Liverpool (UK) (I am the Principal Investigator). 8. SCorCH: Secure Code for Capability Hardware, EPSRC over the call for ``ISCF Digital Security by Design'', 2020-2023, in collaboration with Dr. Konstantin Korovin, Dr. Mustafa Mustafa, Dr. O",
  "content_length": 71137,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:24"
}