{
  "name": "Lucas M. Silva",
  "homepage": "https://cs.uiowa.edu/people/lucas-silva",
  "status": "success",
  "content": "Lucas Silva, Ph.D. | Computer Science - College of Liberal Arts and Sciences | The University of Iowa Skip to main content Lucas Silva, Ph.D. Assistant Professor Biography Lucas M. Silva is an Assistant Professor in Computer Science at the University of Iowa. He recently received a PhD from the Department of Informatics at University of California Irvine. Research InterestsHis research focuses on designing, developing, and evaluating systems to support health and well-being for individuals and families. He uses human-centered design approaches to understand people's perspectives and everyday experiences with technology use, including co-designing interactions and field deployment evaluations of working prototypes.Research Interests (Keywords)HCI; Health and Wellbeing; Family InformaticsSelected PublicationsCo-Designing Situated Displays for Family Co-Regulation with ADHD Children. Lucas M. Silva, Franceli L. Cibrian, Clarisse Bonang, Arpita Bhattacharya, Aehong Min, Elissa M. Monteiro, Jesus A. Beltran, Sabrina E. B. Schuck, Kimberley D. Lakes, Gillian R. Hayes, and Daniel A. Epstein. CHI 2024Unpacking the Lived Experiences of Smartwatch Mediated Self and Co-Regulation with ADHD Children. Lucas M. Silva, Franceli L. Cibrian, Elissa M. Monteiro, Arpita Bhattacharya, Jesus A. Beltran, Clarisse Bonang, Daniel A. Epstein, Sabrina E. B. Schuck, Kimberley D. Lakes, Gillian R. Hayes. CHI 2023Exploring Opportunities for Multimodality and Multiple Devices in Food Journaling. Lucas M. Silva, Elizabeth A. Ankrah, Yuqi Huai, Daniel A. Epstein. MobileHCI 2023Adapting Multi-Device Deployments During a Pandemic: Lessons Learned from Two Studies. Lucas M. Silva, Franceli L. Cibrian, Daniel A. Epstein, Arpita Bhattacharya, Elizabeth A. Ankrah, Elissa Monteiro, Jesus A. Beltran, Sabrina E. Schuck, Kimberley D. Lakes, Gillian R. Hayes. IEEE Pervasive Computing Research areas Health- and Human-Centric Computing Email lucas-silva@uiowa.edu Phone 319-467-3032 Website Personal Website, Google Scholar Contact Information Office Address 101K MacLean Hall (MLH) Iowa City, IA 52242 United States",
  "content_length": 2105,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:25"
}