{
  "name": "Luca Rossi 0003",
  "homepage": "https://pure.itu.dk/portal/en/persons/luca-rossi(1b45e3f5-b8cd-4c0d-a444-2901304f76ee).html",
  "status": "success",
  "content": "Luca Rossi - IT-University of Copenhagen Luca Rossi public CV Luca Rossi Head of Section, PhD Associate Professor, Data ScienceNEtwoRks, Data, and SocietyHDI Lab https://orcid.org/0000-0002-3629-2039 Emaillucritudk 20092025 Research activity per year Personal profile CurriculumI'm Associate Professor of Digital Media and Networks at the Department of Digital Design. I coordinate the Human-Centred Data Science research group and I'm member of the Networks Data and Society (NERDS) research group. I am currently the local PI for the EU CHANSE PolarVis research project aiming at understanding the role of visual communication in polarising the discourse around climate change. Keywords4chan/8chanAudience studiesbig data analysisbig data ethicsCommunities onlineCSCWDisinformationFake newsNetwork analysisPolitical communicationQuantitative methodsSocial mediaSocial network sitesSocial networkingData Human interactionCognitive processesOnline participation Fingerprint Dive into the research topics where Luca Rossi is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Twitter Keyphrases 100% Facebook Keyphrases 92% Social Media Keyphrases 64% Community Detection Computer Science 44% Social Network Computer Science 39% Social Media Platforms Keyphrases 39% Social Media Data Keyphrases 34% Media Platform Social Sciences 32% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2009 2013 2016 2018 2019 2021 2025 29 Journal article 25 Book chapter 10 Article in proceedings 4 Conference abstract for conference 8 More 2 Conference article 1 Anthology 1 Book 1 Report 1 Encyclopedia chapter 1 Paper 1 Computer programme Research output per year Research output per year Leveraging VLLMs for Visual Clustering: Image-to-Text Mapping Shows Increased Semantic Capabilities and InterpretabilityArminio, L., Magnani, M., Piqueras, M., Rossi, L. & Segerberg, A., 19 Sept 2025, In: Social Science Computer Review.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Visual Clustering 100% Text Mapping 100% Connotative Meaning 16% Model-based Approach 16% Semantic Validity 16% Measuring the Sociolinguistic Patterns of Climate Debate Polarization in the Facebook ContextArminio, L. & Rossi, L., 14 Jul 2025, In: Proceedings of the 16th International Conference on Advances in Social Networks Analysis and Mining.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Sociolinguistic Patterns 100% Language Codes 100% Language Code 100% Sociolinguistics 100% Facebook 100% Do You See What I See? Emotional Reaction to Visual Content in the Online Debate About Climate ChangeRossi, L. & Arminio, L., 4 Nov 2024, In: Environmental Communication. 1, 19Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Emotional Reaction 100% Visual Content 100% Climatic Change 100% Online 100% Climate Change 100% The Problems of LLM-generated Data in Social Science ResearchRossi, L., Harrison, K. & Shklovski, I., 30 Oct 2024, In: Sociologica. 18, 2, p. 145-168 24 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Social Science Research 100% Large Language Model 100% Generated Data 100% Synthetic Data 37% Synthetic Data Generator 25% Which reveals ideology better? Comparing self-presentation and public rhetoric in the Facebook climate debate via embeddings analysisArminio, L. & Rossi, L., 2 Sept 2024, Social Networks Analysis and Mining. ASONAM 2024. p. 164-178 14 p. (Lecture Notes in Computer Science).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research Facebook 100% Self-presentation 100% Public Discourse 100% Climate Debate 100% Rhetoric 100% View all 76 research outputs Projects Projects per year 2016 2016 2017 2018 2022 2023 2025 1 Active 6 Finished Projects per year DaR: Data as Relation: Governance in the age of big dataWinthereik, B. R. (PI), Gad, C. (PI), Elam, M. (CoI), Cohn, M. (CoI), Hjelholt, M. (CoI), Douglas-Jones, R. (CoI), Rossi, L. (CoI), Neumayer, C. (CoI), Jørgensen, B. (CoI), Schou, J. (CoI), Burnett, J. M. (CoI), Hockenhull, M. (CoI), Maguire, J. (CoI), Pedersen, L. R. (CoI), Papazu, I. (CoI), Salling, C. A. (CoI), Gahoonia, S. K. (CoI), Ojala, M. (CoI) & Enslev, L. (CoI)Velux Foundation11/03/2016 → 10/03/2021Project: Research Digital 100% Data Double 75% Hype 75% Data Aggregate 50% State Space 50% DEEPFAKE: Effects of deep fake design on human processingMottelson, A. (PI), Rossi, L. (CoI) & Wegmann, D. J. (CoI)Meta01/03/2023 → 01/06/2025Project: Research Deepfake 100% Social Media Posts 50% Human Computer Interaction 50% Cognitive effects 50% Online Information 50% DIGINAUTS : Migrants' digital practices in/of the European border regimeGalis, V. (PI), Rossi, L. (CoI), Kamal, A. (CoI) & Floros, K. (CoI)Velux Foundation01/03/2018 → 01/02/2022Project: Research Migrants 100% Digital 41% EU Border Regime 34% Digital Practices 32% Digital Platforms 32% PolarVis: Conflicting Visual Narratives of Climate Change Rossi, L. (PI) & Arminio, L. (CoI)Independent Research Fund Denmark01/10/2022 → 31/12/2025Project: Research Visual Content 100% Climatic Change 100% Climate Change 50% Visual Narrative 50% You See 50% VIRT-EU: Values and ethics in Innovation for Responsible Technology in EUropeShklovski, I. (PI), Rossi, L. (CoI), Douglas-Jones, R. (CoI), Fritsch, E. (CoI), Hanteer, O. (CoI), Nino Carreras, B. P. (CoI) & Memic, I. (CoI)European Commission01/01/2017 → 31/12/2019Project: Research Internet-Of-Things 100% Twitter 60% Community Detection 60% Crisis 43% Responsible Technology 40% View all 7 projects Press/Media Gorillaen tager nænsomt babyen i sine arme. Men noget er helt galtRossi, L.10/11/20251 Media contributionPress/Media: Press / Media Gorillaen tager nænsomt babyen i sine arme. Men noget er helt, helt galt - og nu advarer eksperterRossi, L.09/11/20251 Media contributionPress/Media: Press / Media Ung jubel efter drab på debattør vækker opsigtRossi, L.12/09/20251 Media contributionPress/Media: Press / Media Facebook rykker i Trumps retningRossi, L.09/01/20251 Media contributionPress/Media: Press / Media Unge mænd kan ikke undgå manosfærenRossi, L.06/08/20241 Media contributionPress/Media: Press / Media View all 23 press/media Datasets Retweets of Italian politicians and political parties during November 2017Giglietto, F. (Creator), Rossi, L. (Creator) & Giglietto, F. (Contributor), Harvard Dataverse, 2017DOI: 10.7910/dvn/qk4mjn, https://dataverse.harvard.edu/citation?persistentId=doi:10.7910/DVN/QK4MJNDataset Retweets of Italian politicians and political parties during January 2018Giglietto, F. (Contributor), Rossi, L. (Creator) & Giglietto, F. (Contributor), Harvard Dataverse, 2018DOI: 10.7910/dvn/lb01b5, https://dataverse.harvard.edu/citation?persistentId=doi:10.7910/DVN/LB01B5 and 3 more links, https://dataverse.harvard.edu/file.xhtml?persistentId=doi:10.7910/DVN/LB01B5/XAOAS6, https://dataverse.harvard.edu/file.xhtml?persistentId=doi:10.7910/DVN/LB01B5/MIOU9H, https://dataverse.harvard.edu/file.xhtml?persistentId=doi:10.7910/DVN/LB01B5/GAUYQD (show fewer)Dataset Media Partisanship Attention in 2018 Italian ElectionGiglietto, F. (Creator), Righetti, N. (Creator), Rossi, L. (Creator) & Giglietto, F. (Contributor), Harvard Dataverse, 27 Sept 2018DOI: 10.7910/dvn/eh87vl, https://dataverse.harvard.edu/citation?persistentId=doi:10.7910/DVN/EH87VLDataset Prizes Årets Forskningsmiljø 2022Szell, M. (Recipient), Sinatra, R. (Recipient), Aiello, L. M. (Recipient), Coscia, M. (Recipient), Rossi, L. (Recipient), Sekara, V. (Recipient), Cunha, T. O. (Recipient), Kostic, B. (Recipient), Sousa, S. (Recipient), Vierø, A. R. (Recipient), Vybornova, A. (Recipient), Xing, Y. (Recipient) & Zappalà, C. (Recipient), 1 Jun 2022Prize: Prizes, scholarships, distinctions Spar 100% Activities Activities per year 2013 2014 2015 2016 2016 10 Organisation and participation in conference 2 Organisation and participation in workshop, seminar, course Activities per year 27th Conference og the Nordic Sociological AssociationRossi, L. (Speaker)14 Aug 2014 → 16 Aug 2014Activity: Participating in or organising an event types › Organisation and participation in conference 3rd ISA Forum of Sociology Rossi, L. (Speaker) & Lippert, I. (Panel Chair)10 Jul 2016 → 14 Jul 2016Activity: Participating in or organising an event types › Organisation and participation in conference Annual International Conference on Democracy as Idea and PracticeRossi, L. (Participant)8 Jan 2014Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course AoIR 2016Rossi, L. (Speaker)5 Oct 2016 → 8 Oct 2016Activity: Participating in or organising an event types › Organisation and participation in conference ECREA Communication and Democracy ConferenceRossi, L. (Speaker) & Neumayer, C. (Speaker)9 Oct 2015 → 10 Oct 2015Activity: Participating in or organising an event types › Organisation and participation in conference View all 12 activities",
  "content_length": 9622,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:25"
}