{
  "name": "Luca Abeni",
  "homepage": "http://retis.sssup.it/~luca",
  "status": "success",
  "content": "Luca Abeni's Page Luca Abeni Who Luca Abeni is an Associate Professor at the ReTiS (Real Time Systems) Lab of Scuola Superiore S. Anna, Pisa. He graduated in computer engineering from the University of Pisa in 1998 and has been a PhD student at Scuola Superiore S. Anna from 1999 to 2002, carrying out research on real-time operating systems, scheduling algorithms, quality of service management, and multimedia applications. In 2000, he was a visiting student at Carnegie Mellon University, working with professor Ragunathan Rajkumar on Resource Kernels and resource reservation algorithms for real-time kernels. In 2001, he was a visiting student at Oregon Graduate Institute (Portland), working with professor Jonathan Walpole on feedback scheduling algorithms and resource allocation and on the evaluation and improvement of the real-time performance of the Linux kernel. From 2003 to 2006, Luca worked in Broadsat S.R.L., developing IPTV applications and audio/video streaming solutions over wired and satellite (DVB - MPE) networks. Then, he moved to the Dipartimento di Ingegneria e Scienza dell'Informazione (DISI) of the University of Trento as a full-time researcher, where he later became Associate Professor. Since 2017, he is back at Scuola Superiore S. Anna as Associate Professor. Personal Rants BIG NEWS: I just received the 2021 RTSS Influential Paper Award!!! The award is about an old paper I wrote in 1998... And this is what could happen when you were free to write articles looking only at their technical content without having to care about bibliometric indices and similar crap! After many years, I found a copy of my PhD thesis, and I decided to publish it. I took this decision mainly because, re-reading the thesis, I realized how much wiser (respect to now) I was when I wrote this thesis... I think I was a better person. BIG FAT WARNING: if you sent an email to my institutional email address and you did not receive any answer, there is a significant probability that I did not receive that email... The institutional email uses a broken server that randomly filters and drops emails; if you need to contact me, send me an email on gmail, which thankfully always works (I am luca.abeni.sssa on gmail). Publications I do not even try to mantain a list of my publications; check google scholar instead. Some quick links Related to research: Here are the proceedings of the First Workshop on Real-Time Cloud Computing (RT-Cloud 2022) and the proceedings of the Second Workshop on Real-Time Cloud Computing (RT-Cloud 2023) Artifact for reproducing the experiments contained in the paper \"An Experimental Analysis of the Xen and KVM Latencies\" Scripts and programs used to perform experimental validations for the paper \"Hierarchical Scheduling of Real-Time Tasks over Linux-based Virtual Machines\" Page for the TuToR 2017 tutorial about SCHED_DEADLINE Some notes I took about using DPDK in Linux containers A more-or-less-random presentation about real-time Virtal Machines Teaching (in English): Some ideas for thesis or research topics Some notes and material about hierarchical real-time scheduling, for the \"Component-Based Software Design\" course Some notes about writing makefiles The \"Kernel Programming\" course The \"Advanced Kernel Programming\" course The \"Advanced Operating Systems\" course The \"Functional Programming Techniques\" course The \"Virtualization Technologies\" course The \"Safe System Programming\" course Some notes about functional programming (and this is the italian version of the page) Teaching (in Italian): The \"Linguaggi di programmazione (modulo 2)\" course (italian only) About Programming Languages: A Brief, Incomplete, and Mostly Wrong History of Programming Languages Something about Real Programmers",
  "content_length": 3761,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:16"
}