{
  "name": "Luciana Porcher Nedel",
  "homepage": "http://www.inf.ufrgs.br/~nedel",
  "status": "success",
  "content": "Luciana Nedel - Institute of Informatics About / Short Bio Luciana Nedel is full professor at the Institute of Informatics of UFRGS. She has been teaching and doing research in virtual reality, interactive visualization, and human-computer interaction since 2002. She received her PhD in Computer Science from the Swiss Federal Institute of Technology (EPFL) in Lausanne, Switzerland, in 1998. In her research career, she has been involved in projects with industry and in cooperation with different Universities abroad. She spent a while on a sabbatical visit at Université Paul Sabatier (IRIT) in Toulouse, France. She participated as an invited professor at Université catholique de Louvain (UcL), Belgium, and Université Cotê d’Azur, in Sophia Antipolis, France. For over 15 years, she has also been working in entrepreneurship, and since June 2017, she has been the director of the business incubator CEI (Center for Entrepreneurship in Informatics at UFRGS). In CEI's direction, she supports the generation of startups in the IT and social and environmental impact business areas. She attended the ELI 2019 (Entrepreneurial Leadership & Innovation) Program at Babson College in Boston, USA, as well as several other courses on entrepreneurship, mentorship, and impact businesses. Her main research interests include: virtual reality, immersive visualization, and non-conventional interaction. In these fields, she published more than 200 scientific articles and developed projects funded by government agencies such as CNPq and CAPES and companies such as HP, Microsoft, and Petrobras. She is a member of the Institute of Electrical and Electronics Engineers (IEEE), the Association for Computing Machinery (ACM), and the Brazilian Computer Society (SBC). E-mail nedel at inf.ufrgs.br Undergraduate course INF01019 Immersive Analytics Undergraduate course INF01043 Interação Humano-Computador Virtual and Augmented Reality Immersive Analytics 3D User Interfaces",
  "content_length": 1967,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:31"
}