{
  "name": "Lucio Mauro Duarte",
  "homepage": "http://inf.ufrgs.br/~lmduarte",
  "status": "success",
  "content": "Lucio Mauro Duarte - INF/UFRGS Lucio Mauro Duarte ====== Degrees ====== B.Sc. in Informatics, Faculdade de Informática (FACIN) da Pontifícia Universidade Católica do Rio Grande do Sul (PUCRS), Brazil, 1999. Final project: \"MOOM: a Monitor of Mobile Objects\", under the supervision of Dr Fernando Luís Dotti. (in Portuguese) M.Sc. in Computer Science, Programa de Pós-Graduação em Ciência da Computação (PPGCC) da Faculdade de Informática (FACIN) da Pontifícia Universidade Católica do Rio Grande do Sul (PUCRS), Brazil, 2002. M.Sc. thesis: \"Development of Distributed Systems with Mobile Code through Formal Specification\", under the supervision of Dr Fernando Luís Dotti. Ph.D. in Computing, Department of Computing, Imperial College London, University of London, UK, 2007. Tese: \"Behaviour Model Extraction Using Context Information\", under the supervision of Prof. Jeff Kramer and Dr Sebastian Uchitel. ====== Research Group ====== VeriTes - Validation, Verification and Testing Group Labelled Transition Systems Extractor (LTSE) tool ===== Topics of Interest ===== Software Behaviour Models Software Validation, Verification, and Testing Software Evolution and Maintenance Quantitative Analysis of Systems ===== Publications =====**2018** DUARTE, Lucio Mauro; MAIA, Paulo Henrique Mendes; SILVA, Ana Carolina Sanchotene. \"Extraction of Probabilistic Behaviour Models Based on Contexts.\" In: Proceedings of the ACM/IEEE 10th International Workshop on Modelling in Software Engineering (MiSE 2018), Gothenburg, Sweden, 2018. p. 25-32. **2017** DUARTE, Lucio Mauro; RIBEIRO, Leila. \"Graph Grammar Extraction from Source Code.\" In: Cavalheiro S., Fiadeiro J. (eds) Formal Methods: Foundations and Applications. SBMF 2017. Lecture Notes in Computer Science, vol 10623, Springer, 2017. p. 52-69. DUARTE, Lucio Mauro. \"Experimentos com o Refinamento de Modelos Baseados em Contextos.\" In: Anais do IV Workshop-Escola de Informática Teórica (WEIT 2017), Santa Maria/RS, Brasil, Outubro de 2017, p. 204-211. DUARTE, Lucio Mauro; KRAMER, Jeff; UCHITEL, Sebastian. \"Using Contexts to Extract Models from Code.\" In: Software and Systems Modeling 16(2), May 2017, p. 523-557. **2016** LUMERTZ, Paulo Roberto; RIBEIRO, Leila; DUARTE, Lucio Mauro. \"User Interfaces Metamodel Based on Graphs.\" In: Journal of Visual Languages & Computing, v. 32, February 2016, p. 1–34. **2014** REIS FILHO, Heitor Boeira; CORREA, Ulisses Brisolara; DUARTE, Lucio Mauro; BECK, Antonio Carlos Schneider. \"Analysis of the Impact of Refactorings on the Performance of Embedded Systems.\" In: SBESC 2014, p. 97-102. OLIVEIRA JUNIOR, Marcos Antonio; RIBEIRO, Leila; COTA, Érika Fernandes; DUARTE, Lucio Mauro; NUNES, Ingrid; REIS, Filipe. \"Use Case Analysis Based on Formal Methods: An Empirical Study.\" In: Simpósio Brasileiro de Métodos Formais, 2014, Maceió/AL. Anais do Congresso Brasileiro de Software 2014, 2014, p. 22-27. **2013** DUARTE, Lucio Mauro. \"Behaviour Model Extraction from Software.\" In: 2nd Workshop-School on Theoretical Computer Science (WEIT), 2013, p. 1-8. OLIVEIRA JUNIOR, Marcos Antonio; RIBEIRO, Leila; DUARTE, Lucio Mauro; COTA, Érika Fernandes. \"Specification of Models Based on Contexts using Graph Grammars.\" In: 2nd Workshop-School on Theoretical Computer Science (WEIT), 2013, p. 129-134. **2011** DUARTE, Lucio Mauro. \"Integrating Software Testing and Model Checking Through Model Extraction.\" In: 14th Brazilian Symposium on Formal Methods (SBMF) : short papers, São Paulo/SP, 2011, p. 73-78. **2010** DUARTE, Lucio Mauro; FOSS, Luciana; WAGNER, Flávio Rech; HEIMFARTH, Tales. \"Model Checking the Ant Colony Optimisation.\" In: 3rd IFIP Conference on Biologically-Inspired Collaborative Computing (BICC), Brisbane, Australia, Springer, v. 329, 2010, p. 221-232. DUARTE, Lucio Mauro; FOSS, Luciana; WAGNER, Flávio Rech; HEIMFARTH, Tales. \"A Probabilistic Model Checking Technique for the Verification of Self-Organising Emergent Systems.\" In: XXXVII Seminário Integrado de Software e Hardware (SEMISH), Belo Horizonte, MG, 2010, p. 410-424. **2009** WAGNER, Flávio Rech; DUARTE, Lucio Mauro; HEIMFARTH, Tales; FOSS, Luciana; MACHADO, Rodrigo; CARRO, Luigi; LAMB, Luís da Cunha ; RIBEIRO, Leila; MOREIRA, Álvaro Freitas ; COTA, Erika F.; PEREIRA, Carlos Eduardo. \"Uma Metodologia de Engenharia de Software para o Desenvolvimento de Sistemas Emergentes Auto-organizáveis.\" In: II Seminário da SBC sobre Grandes Desafios da Computação no Brasil, 2009, Manaus, AM. Relatório do II Seminário da SBC sobre Grandes Desafios da Computação no Brasil, 2009. (in Portuguese) **2008** DUARTE, Lucio Mauro; KRAMER, Jeff; UCHITEL, Sebastian. \"Towards Faithful Model Extraction Based on Contexts.\" In: FASE 2008, Budapest, Hungary, 2008. LNCS 4961, 2008, p. 101-115. **2006** DUARTE, Lucio Mauro; KRAMER, Jeff; UCHITEL, Sebastian. \"Model Extraction Using Context Information.\" In: MoDELS/UML 2006, Genova, Italy, 2006. LNCS 4199, 2006, p. 380-394. **2005** DOTTI, Fernando Luís; DUARTE, Lucio Mauro; FOSS, Luciana; RIBEIRO, Leila; RUSSI, Daniela; SANTOS, Osmar Marchi dos. \"An Environment for the Development of Concurrent Object-Based Applications.\" ELETRONIC NOTES IN THEORETICAL COMPUTER SCIENCE, v. 127, n. 1, 2005, p. 3-13. **2002** PINHO, M.; DIAS, L.; ANTUNES MOREIRA, C.; KHODJAOGHLANIAN, E.; BECKER, G. & DUARTE, L. \"A User Interface Model for Navigation in Virtual Environments.\" CyberPsychology & Behavior, 2002, 5, p. 443-449. DOTTI, Fernando Luís; DUARTE, Lucio Mauro; SILVA, Flávio M Assis; ANDRADE, Aline M Santos. “A Framework for  Supporting  the Development of Correct Mobile Applications based on Graph Grammars.” In: INTEGRATED DESIGN AND PROCESS TECHNOLOGY 2002, Pasadena, USA. Proceedings of the Sixth Biennial World Conference on Integrated Design and Process Technology, 2002. DOTTI, Fernando Luís; DUARTE, Lucio Mauro; COPSTEIN, Bernardo; RIBEIRO, Leila. “Simulation of Mobile Applications”. In: COMMUNICATION NETWORKS AND DISTRIBUTED SYSTEMS MODELING AND SIMULATION CONFERENCE, 2002, San Antonio. Proceedings of the Communication Networks and Distributed Systems. San Diego, USA: SCS - The Society for Modeling and Simulation International, pp.261-267, 2002. RÖDEL, Eduardo Tavares; DUARTE, Lucio Mauro; SANTOS, Osmar Marchi dos; DOTTI, Fernando Luís. \"Simulation of Mobile Applications in Open Environments.\" In: III WORKSHOP DE COMUNICAÇÃO SEM FIO, 2002, São Paulo. Anais do Workshop de Comunicação Sem Fio, 2002. DUARTE, Lucio Mauro; DOTTI, Fernando Luís. \"Development of An Active Network Architecture Using Mobile Agents - A Case Study.\" Relatório Técnico TR-043, PPGCC-FACIN/PUCRS, Brazil, 2002. **2001** DUARTE, Lucio Mauro; DOTTI, Fernando Luís. \"Desenvolvimento de Aplicações Móveis Corretas.\" In: III WORKSHOP DE COMUNICAÇÃO SEM FIO, Recife, Brazil. Anais do Workshop de Comunicação Sem Fio, 2001, p. 10-17. (in Portuguese) **2000** DUARTE, Lucio Mauro. \"Estudo de Linguagens de Programação com Suporte à Mobilidade de Código.\" Relatório Técnico TR-016, PPGCC-FACIN/PUCRS, Brazil, 2000. (in Portuguese) DUARTE, Lucio Mauro. \"Uma Análise de Linguagens de Especificação para Sistemas Distribuídos.\" Relatório Técnico TR-015, PPGCC-FACIN/PUCRS, Brazil, 2000. (in Portuguese) DOTTI, Fernando Luis; DUARTE, Lucio Mauro. \"Monitoring Mobile Code.\" In: PARALLEL AND DISTRIBUTED PROCESSING TECHNIQUES AND APPLICATIONS, 2000, Las Vegas, USA. Proceedings of Parallel and Distributed Processing Techniques and Applications, v. 4, p. 2029-2034, 2000. **1999** PINHO, Márcio Serolli; DUARTE, Lucio Mauro; DIAS, Leandro L; MAZZORANI, Angela. \"Experiências do Laboratório de Realidade Virtual da PUCRS.\" In: CONGRESSO ARGENTINO DE CIÊNCIA DA COMPUTAÇÃO, Tandil, Argentina. Anais do Congresso Argentino de Ciência da Computação, 1999. (in Portuguese) PINHO, Márcio Serolli; DIAS, Leandro L; MOREIRA, Carlos G Antunes; KHODJAOGHLANIAN, Emmanuel González; BECKER, Gustavo Pizzini; DUARTE, Lucio Mauro. \"Um Modelo de Interface para Navegação em Mundos Virtuais.\" In: CONGRESSO LATINO-AMERICANO DE INFORMÁTICA, 1999, Assunción, Paraguay. Anais do 25º Congresso Latino-Americano de Informática. 1999. (in Portuguese) DOTTI, Fernando Luís; NYGAARD, Fernando; DUARTE, Lucio Mauro; REZNICEK, Roberto Domingues. \"Um Monitor de Objetos Móveis.\" In: CONGRESSO LATINO-AMERICANO DE INFORMÁTICA, 1999, Assunción, Paraguay. Anais do 25º Congresso Latino-Americano de Informática. 1999. (in Portuguese) DOTTI, Fernando Luís; NYGAARD, Fernando; DUARTE, Lucio Mauro; REZNICEK, Roberto Domingues. \"Um Monitor de Objetos Móveis: Concepção, Arquitetura e Resultados Práticos.\" In: WORKSHOP DE COMUNICAÇÃO SEM FIO, 1999, Belo Horizonte, Brazil. Anais do I Workshop de Comunicação Sem Fio, p. 113-122, 1999. (in Portuguese) PINHO, Márcio Serolli; DIAS, Leandro L; MOREIRA, Carlos G Antunes; KHODJAOGHLANIAN, Emmanuel González; BECKER, Gustavo Pizzini; DUARTE, Lucio Mauro. \"Virtual Bicycle: An User Interface Tool For Navigation In Virtual Worlds.\" In: II WORKSHOP SOBRE FATORES HUMANOS EM SISTEMAS COMPUTACIONAIS, 1999, Campinas, Brazil, 1999. **1998** DUARTE, Lucio Mauro; PINHO, Márcio Serolli. \"Criação da PUC Virtual\". In: X SALÃO DE INICIAÇÃO CIENTÍFICA DA UFRGS, 1998, Porto Alegre, Brazil. Livro de Resumos do X Salão de Iniciação Científica da UFRGS,  p. 35, 1998. ====== Contact ====== Lucio Mauro Duarte Federal University of Rio Grande do Sul (UFRGS) Institute of Informatics Campus do Vale - Bloco IV Building 73, Room 229 Av. Bento Gonçalves, 9500 Porto Alegre/RS 91501-970 - Brazil Phone: +55 (51) 3308 - 7126 lmduarte <at> inf <dot> ufrgs <dot> br Homepage: http://www.inf.ufrgs.br/~lmduarte",
  "content_length": 9586,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:35"
}