{
  "name": "Lucien Haddad",
  "homepage": "https://www.rmc-cmr.ca/en/mathematics-and-computer-science/dr-lucien-haddad",
  "status": "success",
  "content": "Dr. Lucien Haddad Skip to main content Skip to \"About this site\" Dr. Lucien Haddad Dr. Lucien Haddad Professor Office: Girouard building, room 339 Telephone: (613) 541-6000 ext 6474 Fax: (613) 541-6584 E-mail: Lucien.Haddad@rmc-cmr.ca Department of Mathematics and Computer Science College Address Royal Military College of CanadaPO Box 17000, Station ForcesKingston, Ontario, CANADAK7K 7B4 Research Interests Multiple-Valued Logic and Discrete Mathematics. Short Biography I completed my Licence ès sciences / Licence d’enseignement en mathématiques pures at the Lebanese University in 1979. I received my Master's degree in 1982 from the University of Montreal on the topic of ring theory, and I received my Ph.D. also from the University of Montreal in 1987 under the supervision of Dr. I. G. Rosenberg on the topic of Multiple-Valued Logic. I spent one year (1987–1988) as a postdoctoral fellow at the University of Waterloo, where I met several experts in discrete mathematics. I was an assistant professor of mathematics at the University of Toronto during the period 1988–1991. I came to RMC in August 1991, and I've been at RMC ever since, except for two sabbaticals where I visited the Université Claude Bernard, Lyon (France), the University of Luxembourg (Luxembourg), the University of Dresden, and the University of Rostock (Germany). Selected Publications Hereditary rigidity, separation and density: In memory of Professor IG Rosenberg, by L. Haddad, M. Miyakawa, M. Pouzet and H. Tatsumi. 2021 IEEE 51st International Symposium on Multiple-Valued Logic, pages 62-67.Bruen, A.A., Haddad, L., & Wehlau, D.L. (1998). Binary Codes and Caps. Journal of Combinatorial Designs 6, 438-450. A survey on the fine-grained complexity of constraint satisfaction problems based on partial polymorphisms, by M. Couceiro, L. Haddad and V. Lagerkvist. Journal of Multiple-Valued Logic and Soft Computing 38 (1-2), pages115-136. Hereditarily Rigid Relations: M. Couceiro, L. Haddad, M. Pouzet and K. Schölzel. 2015 IEEE International Symposium on Multiple-Valued Logic, pages 84-89. On the interval of strong partial clones of Boolean functions containing Pol ({(0, 0),(0, 1),(1, 0)}), by M. Couceiro, L. Haddad, K. Schölzel and T. Waldhauser. Algebra Universalis 77, pages 101-123. A solution to a problem of D. Lau: Complete classification of intervals in the lattice of partial Boolean clones, by M. Couceiro, L. Haddad, K. Schölzel and T. Waldhauser. Journal of Multiple-Valued Logic and Soft Computing 28 (1), pages 47-58. Intervals of Boolean partial clones, by L. Haddad and G.E. Simons. Italian Journal of Pure and Applied Mathematics, 21, pages 147-162. Maximal partial clones of 4-valued logic, by L. Haddad and G.E. Simons. Multiple-valued Logic, an International Journal, 8 no. 4 pages 531-562. A clone-theoretic formulation of the Erdös-Faber-Lovász conjecture, by L. Haddad and C. Tardif. Discuss. Math. Graph Theory 24(3), pages 545-549. 5-chromatic STS's, by J. Fugere, L. Haddad and D. Wehlau. JCD, Vol. 2, No. 5, pages 287–299. Binary Codes and Caps, by A. Bruen, L. Haddad and D. Wehlau. JCD 6, pages 438-450. Completeness theory for finite partial algebras, by L. Haddad and I.G. Rosenberg. Algebra Universalis 29, pages 378-401. More publications available on  Google Scholar Date modified: 2024-07-26",
  "content_length": 3320,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:31"
}