{
  "name": "Lucia Dettori",
  "homepage": "https://www.cdm.depaul.edu/about/Pages/People/facultyinfo.aspx?fid=203",
  "status": "success",
  "content": "Dettori, Lucia: Visual Computing (VC), High Performance and Scientific Computing - School of Computing Skip to Content CDM Students: FAQ | DePaul University: COVID-19 Updates and Guidance. Menu Jarvis College of Computing and Digital Media Search Search CDM Schools Cinematic Arts Computing Design QuickLinks Log In MyCDM Campus Connect D2L Academic Resources Academic Calendar Exam Schedule Faculty & Staff Administration & StaffFaculty A-ZFaculty Research & Creative Activity CDM Schools Cinematic Arts Computing Design Academic Resources Course Catalog Course Schedule Course Syllabi Academic Calendar Exam Schedule D2L CDM Home > Faculty & Staff > Faculty Information Page Content Lucia Dettori Interim Dean // Visual Computing (VC), High Performance and Scientific Computing School of Computing Email: ldettori@cdm.depaul.edu Office:CDM 908 Phone: Advising and Office Hours: Office hours are posted on D2L. Schedule Advising Appointments through OneDePaul. Bio and Research Information Dr. Lucia Dettori became Interim Dean of the Jarvis College of Computing and Digital Media (CDM) in July 2022. An Associate Professor in CDM’s College of Computing, she joined DePaul in 2000 and has served as an Associate Dean at CDM since 2007. Before joining CDM, Dettori held visiting positions at Brown University and Southern Methodist University. Born and raised in Italy, Dettori earned her bachelor's and master's degrees in applied mathematics from the University of Parma. She has a Ph.D. in applied mathematics from the University of Paris XI in France. Her research interests span from computational fluid dynamics to medical image processing and computer science education. She has published extensively in those areas and is the recipient of multimillion-dollar in grants from federal agencies and private companies, including the National Science Foundation, CME Foundation, IBM and Google. A recognized national leader in computer science education, Dettori has made it a priority throughout her career to make computing accessible to all. She is a co-founder of the Chicago Alliance for Equity in Computer Science, also known as CAFÉCS. This collaboration between DePaul, University of Illinois, Loyola University, Chicago Public Schools (CPS) and the Learning Partnership aims to give all Chicago students access to a high-quality computer science education. True to her passion, Dettori helped spread equity-focused, inquiry-based introductory computer science curriculum throughout the Chicago Public Schools district. In 2018, Dettori took a sabbatical from teaching at DePaul to serve as the director of the Office of Computer Science at Chicago Public Schools. In the first 10 years of the project more than 90,000 CPS high school students have taken the introductory computer science course, and more than 200 CPS teachers also have received training. As a result of CAFÉCS' efforts, computer science is now a high school graduation requirement for all CPS students. Research Area Visual Computing (VC), High Performance and Scientific Computing Specific Research Area Scientific computing, medical image processing, Computer Science education, Broadening Participation in Computer Science Professional Associations ACM, AWIS Schedule for Winter 2025-2026 Not available Courses Taught at DePaul CSC 200 Survey of Computing CSC 211 Programming in Java I CSC 212 Programming in Java II CSC 398 Internship CSC 399 Independent Study CSC 421 Applied Algorithms and Structures CSC 435 Distributed Systems I CSC 697 Graduate Internship CSEC 340 Fundamentals of Information Assurance GAM 224 Game Design for Non-Majors HCI 201 Multimedia and the World Wide Web IPD 500 Taste of Computing Professional Development IT 130 Introductory Computing for the Web IT 240 Introduction to Databases IT 398 Topics in Global Information Technology NET 468 Network Programming SE 450 Object-Oriented Software Development SE 452 Object-Oriented Enterprise Computing Course Evaluations CSC 211 - 701Programming in Java IFall 08-09 CSC 211 - 701Programming in Java IFall 07-08 HCI 201 - 902Multimedia and the World Wide WebSpring 06-07 GAM 224 - 601Game Design for Non-MajorsSpring 06-07 IT 230 - 501Building Internet ApplicationsWinter 06-07 GAM 224 - 502Game Design for Non-MajorsWinter 06-07 CSC 212 - 401Programming in Java IIFall 06-07 IT 230 - 702Building Internet ApplicationsFall 06-07 IT 430 - 702Building Internet ApplicationsFall 06-07 CSC 211 - 902Programming in Java ISpring 05-06 CSC 211 - 910Programming in Java ISpring 05-06 IT 240 - 601Introduction to DatabasesSpring 05-06 IT 240 - 501Introduction to DatabasesWinter 05-06 HCI 201 - 501Multimedia and the World Wide WebWinter 05-06 IT 240 - 701Introduction to DatabasesFall 05-06 IT 240 - 702Introduction to DatabasesFall 05-06 CNS 340 - 701Fundamentals of Information AssuranceFall 05-06 CNS 340 - 702Fundamentals of Information AssuranceFall 05-06 CSC 211 - 601Programming in Java ISpring 04-05 CSC 212 - 601Programming in Java IISpring 04-05 IPD 399 - 902Topics in Global Information TechnologySpring 04-05 IPD 499 - 902Topics in Global Information TechnologySpring 04-05 CSC 212 - 501Programming in Java IIWinter 04-05 IT 240 - 502Introduction to DatabasesWinter 04-05 CSC 211 - 401Programming in Java IFall 04-05 IT 240 - 701Introduction to DatabasesFall 04-05 IT 240 - 702Introduction to DatabasesFall 04-05 CSC 211 - 601Programming in Java ISpring 03-04 CSC 212 - 902Programming in Java IISpring 03-04 CSC 212 - 905Programming in Java IISpring 03-04 CSC 212 - 501Programming in Java IIWinter 03-04 CSC 319 - 501Database TechnologyWinter 03-04 CSC 211 - 401Programming in Java IFall 03-04 CSC 211 - 703Programming in Java IFall 03-04 CSC 415 - 301Foundations of Computer ScienceSpring 02-03 CSC 415 - 203Foundations of Computer ScienceWinter 02-03 CSC 319 - 503Database TechnologyWinter 02-03 ECT 270 - 402Introductory Computing for the WebFall 02-03 CSC 319 - 404Database TechnologyFall 02-03 ECT 270 - 601Introductory Computing for the WebSpring 01-02 ECT 270 - 603Introductory Computing for the WebSpring 01-02 ECT 270 - 604Introductory Computing for the WebSpring 01-02 ECT 250 - 501Internet, Commerce, and SocietyWinter 01-02 ECT 270 - 801Introductory Computing for the WebWinter 01-02 ECT 250 - 504Internet, Commerce, and SocietyWinter 01-02 ECT 250 - 402Internet, Commerce, and SocietyFall 01-02 ECT 250 - 101Internet, Commerce, and SocietyFall 01-02 CSC 200 - 301Survey of ComputingSpring 00-01 CSC 240 - 301Introduction to DatabasesSpring 00-01 CSC 200 - 201Survey of ComputingWinter 00-01 CSC 200 - 501Survey of ComputingWinter 00-01 CSC 240 - 402Introduction to DatabasesFall 00-01 CSC 240 - 403Introduction to DatabasesFall 00-01",
  "content_length": 6705,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:27"
}