{
  "name": "Lucia Moura",
  "homepage": "http://www.site.uottawa.ca/~lucia",
  "status": "success",
  "content": "Lucia Moura's home page Lucia Moura Professor Research Graduate Students Teaching PhD (University of Toronto, 1999) Research: Research Interests: Combinatorial Designs (Theory and Applications),Covering Arrays and Combinatorial Testing, Combinatorial Cryptography, Combinatorial Algorithms (design and analysis), Combinatorics (combinatorial designs, graphs, hypergraphs, codes). My publications, google scholar page My background Member of EECS's Algorithms research group and Theory of Computing research group. Member of The Ottawa-Carleton Discrete Mathematics Group Uottawa Cybersecurity Hub Fellow of the Institute of Combinatorics and its Applications. Graduate Students: Graduate students supervised (includes links to their theses). Graduate programs I am associated with: Computer Science (OCICS - Master's, PhD) Mathematics and Statistics (OCIMS - master's, PhD) Electrical and Computer Engineering (OCIECE - master's, PhD) Teaching: Courses in the current academic year: CSI2110 (Sections A,B,D) Data Structures and Algorithms (Fall 2025) Past courses: CSI5165 Combinatorial Algorithms (W24,W23,W22,W21,W18,F15,F14,F13,F11,F10,F09,W09,F05,F03,F02), CSI7160 Advanced Topics in the Theory of Computing - Applications of Combinatorial Designs in Computer Science (W17), CSI5126 Algorithms in Bioinformatics (F11,F10), CSI4124/SYS5110 Foundations of Modeling and Simulation (F05), CSI4150 Introduction to Optimization Methods (W19), CSI4105 Design and analysis of Algorithms II (W14,W12,W11,W10,F03,W06, F02, F01), CSI3104 Introduction to Formal Languages (W14), CSI2110 Data Structures and Algorithms (F24,F23,F22,F21,F20,F18,F17,F16,F15,F14,F13), CSI2101 Discrete Structures (W17,W12,W11,W10,W09), CSI2131 File Management (W06, W05,W04,W03,W02, W01), ITI1121 Introduction to Computing II (S15). Courses taught during academic leave 2012-2013 at INE, UFSC, Brazil: Algoritmos - Projeto e Analise, Algoritmos Combinatorios Minicourses: Minicurso, Algoritmos Combinatorios, UFSC, Florianopolis, Brasil, Feb 2010 (in portuguese) Recent Professional Activities: General Chair and Program Committee co-chair: LATIN 2026 (Florianopolis, Brazil, April 2026), latintcs.org Co-chair of Local Organizing Committee: CanaDAM 2025, Ottawa, May 20-23, 2025. Invited speaker, IWOCA 2024 International Workshop on Combinatorial Algorithms, July 1-4, 2024, Ischia, Italy. Co-organizer of Dagstuhl Seminar: Pushing the Limits of Computational Combinatorial Constructions, Wadern, Germany, April 2023. Co-organizer of Stinson66: New Advances in Designs Codes and Cryptography, Fields Institute, Toronto, June 2022. Program Committee co-chair of IWOCA2021 International Workshop on Combinatorial Algorithms, Ottawa (online), July 2021 (recorded talks available here). Program committee member: IWOCA2026, LAGOS 2025, WAIFI 2024, LAGOS 2023, LATIN 2022, CCCG 2022, IWOCA 2021, SBSEG 2021, TII Crypto Seminar 2021, WAIFI 2020, IWOCA 2019, CAI 2019, IWOCA 2018, CAI 2017, LATIN 2016, LATIN 2014, LATIN 2012. Member of the editorial board of the Journal of Combinatorial Designs, since 2019. Fellow of the Institute of Combinatorics and its Applications (ICA), since 2019. Personal links: My oldest son Natan Moura: natanmoura.com Natan was compositor for 2D award winning short film Namooo (2021) (12min) Natan was nominated for 3 Annie Awards in 2020 for work in My Moon, Sinclair Snake: Museum Mischief, and Dove Self-Esteem Project x Steven Universe: \"Social Media\". Natan was director of animation for short film: My Moon (2018) (8min) - Animated Short Film directed by Eusong Lee Natan's short animations while a student at Sheridan college: Poof (2012), Sun of a Beach (2013) (cartoon brew festival ) Natan was part of \"Canterbury Six\", an art exhibit showing the art of six Canterbury High School Students (Winter 2009) at Dale Smith Gallery. Some art by Natan when he was younger. My father Alvaro Cardoso de Moura Jr: About Alvaro Portrait Lucia Moura School of Electrical Engineering and Computer Science (EECS), University of Ottawa 800 King Edward St, P.O. Box 450, Stn A, Ottawa, Ontario, Canada, K1N 6N5 Tel: (613) 562-5800 X-6678, Fax: (613) 562-5664 Email: lmoura@uottawa.ca Contactez: École de Science Informatique et de Génie Électrique (SIGE)/ Contact: School of Electrical Engineering and Computer Science (EECS) Copyright © 2001 Université d'Ottawa / University of Ottawa Webmestre / Webmaster",
  "content_length": 4400,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:27"
}