{
  "name": "Luciano Paschoal Gaspary",
  "homepage": "http://www.inf.ufrgs.br/~paschoal",
  "status": "success",
  "content": "LUCIANO PASCHOAL GASPARY LUCIANO PASCHOAL GASPARY DEAN & FULL PROFESSOR Instituto de Informática (INF) Universidade Federal do Rio Grande do Sul (UFRGS) Av. Bento Gonçalves, 9500 Campus do Vale - Bloco IV Caixa Postal 15064 91501-970 - Porto Alegre - Brazil paschoal at inf dot ufrgs dot br +55 (51) 3308-6241 Short Bio Luciano Paschoal Gaspary holds a Ph.D. in Computer Science (UFRGS, Brazil, 2002). He is currently the Dean and a Full Professor at the Institute of Informatics, UFRGS. From 2016 to 2024, he was the Deputy Dean of the Institute. From 2019 to 2022, he served as the Editor-in-Chief for Springer’s Journal of Network and Systems Management (JNSM). From 2008 to 2014, he worked as Director of the National Laboratory on Computer Networks (LARC) and, from 2009 to 2013, was Managing Director of the Brazilian Computer Society (SBC). Prof. Gaspary has been involved in the area of network and service management for over 25 years. In 2023, he received the prestigious Dan Stokesberry Award from the IEEE Communications Society in recognition of his distinguished technical contributions to the growth of the field. In recent years, his group has worked mainly on cybersecurity and data plane programmability to solve long-standing and emerging management problems. Prof. Gaspary is the author of more than 160 full papers published in leading international peer-reviewed publications and has a history of dedication to a number of research activities. He served as General Co-Chair for LANOMS 2005, TPC Co-Chair of IFIP/IEEE DSOM 2009, TPC Co-Chair of IEEE/IFIP NOMS 2002, General Co-Chair for CNSM 2014, and in several other Organizing Committee roles of past IM, NOMS, and CNSM conferences. He also participated as an editorial board member of various journals. [DBLP] [Google Scholar] [Lattes] [LinkedIn] Dan Stokesberry Award - IEEE/IFIP NOMS 2023 - Miami, USA Research Interests My current research interests are network, service, and application management, computer system security, software-defined networking, and data plane programmability. News 22 October 2025: Talk on the intersection between data plane programmability, network management, and AI at the 10th Network Technologies Workshop (WTR), promoted by RNP. 16 August 2025: I am thrilled to receive the invitation to participate on an NSF review panel. 7 August 2025: I am truly grateful for my promotion to level A as a CNPq Research Fellow. 19 May 2025: Nostalgic panel discussion titled \"30 Years of Network Management in Brazil: Past, Present, and Future\" at the 30th SBC Workshop on Network Management (WGRS 2025). 15 May 2025: I am happy to join the panel discussion titled \"Green AI: Sustainable Strategies for Network and Operations Management\" at the 38th IEEE/IFIP Network Operations and Management Symposium (NOMS 2025), with Prof. Alberto Schaeffer-Filho, Dr. Alex Clemm, Prof. Burkhard Stiller, and Prof. Carol Fung. 17 March 2025: I am honored to deliver the talk \"The Internet Odyssey: Contrasting Its Past and Envisioning Its Future\" and join a panel at the 2025 IEEE ComSoc School Series Colombia, Medellín, Colombia. 20 December 2024: I am happy and honored to start a 4-year term with Prof. Viviane Moreira as the Dean of our Institute of Informatics at UFRGS. 11 December 2024: I am happy to join the M.Sc. dissertation jury of Santiago Rios Guiral, entitled \"Cyberattacks Mitigation by Leveraging Programmable Data Plane Capabilities\", Universidade de Antioquia, Medellín, Colombia. 27-28 November 2024: I am excited to attend the 4th Seminar on the Great Challenges in Computer Science in Brazil (2025-2025) promoted by the Brazilian Computer Society. 31 October 2024: I am thrilled to deliver the keynote \"Chasing the Finish Line: The Journey Towards Low Latency, High Throughput AI/ML for Management Using Programmable Networks\" and join the Distinguished Experts Panel (DEP) at the 20th International Conference on Network and Service Management (CNSM 2024), Prague, Czech Republic. 27 September 2024: I am delighted to deliver the talk \"Unveiling the Potential and Limits of AI/ML in Communication Networks in the Era of Programmable Data Planes\" to my fellow friends of the Institute of Computing at UNICAMP. 15 May 2024: I am happy to examine the Doctor of Philosophy thesis of Stéphanie Carlier, entitled \"Empowering Health: Personalised Serious Games and Gamification\", Ghent University - imec, Ghent, Belgium. 10 May 2024: I am honored to deliver the keynote \"AI/ML for Networking in the Era of Programmable Data Planes: Are We There Yet?\" at the 3rd International Workshop on Intelligence Provisioning for Network and Service Management in Softwarized Networks (IPSN) (in conjunction with IEEE/IFIP NOMS 2024), Seoul, South Korea. 26 April 2024: I am delighted to be appointed Doctoral Symposium Co-Chair of the 38th IEEE/IFIP Network Operations and Management Symposium (NOMS 2025), which will be held in Honolulu, Hawaii, USA, next year. 23 April 2024: I am happy to serve as Dissertation Digest Co-Chair of the 43rd SBC Brazilian Symposium on Computer Networks and Distributed Systems (SBRC 2025), which will be held in Natal, Brazil, next year. 1 March 2024: I am honored to be appointed Keynote Chair of the IEEE Latin-American Conference on Communications (LATINCOM 2024). 16 January 2024: I am delighted with the invitation to serve on an NSF review panel. 2 January 2024: I am excited to be listed as a founding member of the CNOM SIG on Sustainable Network Operations (SNO)! I look forward to contributing to the efforts of this Special Interest Group. 27 December 2023: It was a year of very hard work! I am happy to have served my research community through participation in the Technical Program Committee of IEEE/IFIP NOMS 2023, CNSM 2023, and other flagship venues. 22 December 2023: I am happy to examine the Doctor of Philosophy thesis of João Pedro Menoita Henriques, entitled \"Audit Compliance and Forensics Frameworks for Improved Critical Infrastructure Protection\", Universidade de Coimbra, Coimbra, Portugal. 13 December 2023: Honored to serve as General Chair of the 51st SBC Seminar on Integrated Development of Software and Hardware (SEMISH 2024). 9 November 2023: Excited to serve as Publicity Chair of the 10th IEEE Conference on Network Functions Virtualization and Software-Defined Networking (IEEE NFV-SDN 2024). 11 May 2023: I am honored to have been granted the Dan Stokesberry Award by the Committee on Network Operations and Management (CNOM) of the IEEE Communications Society. The award is the most prestigious of the network and service management research community and is offered to individuals with distinguished technical contributions toward the advancement of the field. Recent Awards CNPq Research Fellow - Bolsista de Produtividade em Pesquisa do CNPq A Best Paper Award at the 38th IEEE/IFIP Network Operations and Management Symposium (NOMS 2025) for the paper “RNA: Automating IDS/IPS Event Detection Offload into Programmable Forwarding Devices” Best Demo Paper Award at the 38th IEEE/IFIP Network Operations and Management Symposium (NOMS 2025) for the paper “Bringing Programmable Low-End Networks to Life: A Field Study with an Off-the-Shelf Prototype” Dan Stokesberry Award granted by the Committee on Network Operations and Management (CNOM) of the IEEE Communications Society for his distinguished technical contributions towards the advancement of the field IEEE Senior Member 2020 Best Ph.D. Thesis at the 38th Brazilian Symposium on Computer Networks and Distributed Systems (SBRC 2020) for the work by Roberto Irajá Tavares da Costa Filho entitled “Scalable Path Selection Based on QoE Prediction in Software-Defined Mobile Networks” Best Student Paper Award at the 16th IFIP/IEEE Symposium on Integrated Network and Service Management (IM 2019) for the paper “Offloading Real-time DDoS Attack Detection to Programmable Data Planes” Best Paper Award at the 36th Brazilian Symposium on Computer Networks and Distributed Systems (SBRC 2018) for the paper “Explorando Estratégias de Orquestração de Telemetria em Planos de Dados Programáveis” Honorable Mention at the Dissertation Digest of the 36th Brazilian Symposium on Computer Networks and Distributed Systems (SBRC 2018) for the Ph.D. Thesis by Marcelo Caggiani Luizelli entitled “Scalable Cost-Efficient Placement and Chaining of Virtual Network Functions” Best Reviewer Award at the 15th IEEE/IFIP Network Operations and Management Symposium (NOMS 2016) Best Student Paper Award at the 14th IFIP/IEEE Symposium on Integrated Network and Service Management (IM 2015) for the paper “Piecing Together the NFV Provisioning Puzzle: Efficient Placement and Chaining of Virtual Network Functions” Brazilian Computer Society Distinguished Member 2014 Microsoft Azure Research Award 2014 Honorable Mention at the Dissertation Digest of the 14th IEEE/IFIP Network Operations and Management Symposium (NOMS 2014) for the Ph.D. Thesis by Flávio Roberto Santos entitled “Slowing Down to Speed Up: Protecting Users Against Massive Attacks in Content Distribution Systems” Microsoft Research Latin American Ph.D. Fellowship Award 2011 granted to student Weverton Luis da Costa Cordeiro Best Student Paper Award at the 12th IEEE/IFIP Network Operations and Management Symposium (NOMS 2010) for the paper “Choking Polluters in BitTorrent File Sharing Communities” Recent Professional Activities Chair of the 56th SBC Seminar on Computing at the University (SECOMU 2026) Publicity Co-Chair of the 39th IEEE/IFIP Network Operations and Management Symposium (NOMS 2026) NSF review panelist (August 2025) Doctoral Symposium Co-Chair of the 38th IEEE/IFIP Network Operations and Management Symposium (NOMS 2025) Dissertation Digest Co-Chair of the 43rd SBC Brazilian Symposium on Computer Networks and Distributed Systems (SBRC 2025) CNOM Best Paper Award Committee member (May 2025-Present) Founding member of the CNOM SIG on Sustainable Netw",
  "content_length": 29587,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:34"
}