{
  "name": "Lucinéia Heloisa Thom",
  "homepage": "http://inf.ufrgs.br/~lucineia",
  "status": "success",
  "content": "Prof. Dr. Lucineia Heloisa Thom – Associate Professor – Institute of Informatics – Federal University of Rio Grande do Sul Skip to content linkedin Facebook Instagram Threads Associate professor (Professora Associada) with the Institute of Informatics at Federal University of Rio Grande do Sul ContactInstituto de InformáticaUniversidade Federal do Rio Grande do Sul91501-970, Porto Alegre – RS – BrazilRoom: 226 – Building: 43425Phone: +55 51 3308-7748E-mail: lucineia[at]inf.ufrgs.br From 2018 to 2019, I was on a sabbatical year at Viena University of Economy and Business (WU) with the Institute for Information Business. From 2010 to 2011, I was a Visiting Scientist at the University of Grenoble at Grenoble Informatics Laboratory. Before, I was a visiting Scientist at the University of Ulm (2007-2009) with the Institute of Databases and Information Systems (DBIS). I received my Bachelor’s in Computer Science from the Universidade de Santa Cruz do Sul, Brazil (1999); my Master’s in Computer Science from the Institute of Informatics – INF at Federal University of Rio Grande do Sul – UFRGS (2002); and my Ph.D. in Computer Science from UFRGS (2006). I developed part of my thesis research with the Institute for Parallel and Distributed Systems at the University of Stuttgart (2004-2005). My main research interests are in the area of Business Process Management (BPM), with a special focus on process model extraction from natural language text, process quality, process implementation, process visualization, healthcare process, process model adaptation, process mining, robotic process automation (RPA) and education of BPM.Related to these topics, I have published more than 80 research papers. I have also been a reviewer for many Journals and participated in several Program Committees. I was co-organizer of several events, including the Latin American School of BPM 2015, the Tutorial and Panel Section of the BPM Conference 2016, and the First Workshop on Business Process Management and Ontologies (BPMO 2016). I was co-chair of the First, Second, and Third Workshop on Academy Meets Industry in Information System Engineering (AMISE 20, AMISE 21, AMISE 22). I was guest editor of the Special Issue on Business Process Management, published in 2021 in the Revista de Informática Teórica e Aplicada (RITA). Latest news Accepeted paper for BUSINESS PROCESS MANAGEMENT JOURNAL Accepted paper for Simpósio Brasileiro de Sistemas de Informação Accepted article for BPMJ Paper accepted for SBIE 2024 Paper accepted for CENTERIS 2024 Talk in Café com Pesquisa (Coffee with Research) Accepted paper for CENTERIS 2023 Accepted paper for Information Systems Accepted papers for SBSI 2023 Palestra na ESCOLA REGIONAL DE SISTEMAS DE INFORMAÇÃO (ERSI-GO) News and Opportunities News Opportunities Collaborations Research Group in Process Mining – University of São Paulo.",
  "content_length": 2880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:35"
}