{
  "name": "Lucy Hederman",
  "homepage": "https://www.scss.tcd.ie/Lucy.Hederman",
  "status": "success",
  "content": "Home page of Lucy Hederman School of Computer Science & Statistics, Trinity College Dublin, University of Dublin Lucy Hederman, Lecturer Contacting Me Postal AddressSchool of Computer Science & Statistics, Trinity College Dublin, Dublin 2, Ireland Office LocationORI.G.13 Phone+353-1-896 2245 Email hederman@tcd.ie SkypeLucyHederman Teaching I have been lecturing in Trinity College's School of Computer Science & Statistics since October 1990. I currently teach 1E3 Introduction to Computing, to first year BAI (Engineering) students. 1E3 Handbook CS7016 A module of the MSc in Health Informatics on Clinical Decision Support Systems. Module Outline Supervision I am curently supervising PhDs: Retno Vinarti Aulia - Personalized Weather-related Infectious Diseases Adviser System and co-supervising: PJ Wall - Administrative Roles Since 2006, I am the course director of the MSc in Health Informatics. Qualifications BA, BAI, MSc (Rice), PhD. I studied Computer Engineering at Trinity College Dublin and graduated in 1985. After a year in Paris, I went to Rice University in Texas and completed my Masters degree two years later, though I didn't receive the parchment till the following Summer, 1988. The Masters was called Compile Time Garbage Collection Using Reference Count Analysis. PDF here (80 pages, 5.3Mb). I received my PhD from TCD in February 1999, supervised first by Dr. Jane Grimson and then by Dr. Padraig Cunningham. The thesis title was Pattern-based Text Analysis for Office Documents. Research Current research interests include Informatics support for clinical research The AVERT project is concerned with predicting relapses (or flares) of ANCA vasculitis, a relapsing and remitting rare autoimmune disease that results in rapidly progressive kidney impairment and destruction of other organs. Epidemiological data seem to show a strong environmental impact on relapse in ANCA vasculitis, though it is unclear which exactly environmental factors are responsible for this. The rapidly emerging discipline of data science - alongside massive increases in computing capability, machine learning and artificial intelligence - is poised to allow the incorporation of such highly complex health big data environments, and the generation of outputs with potential applicability in personalised medicine. We aim to integrate a wide array of unstructured data streams to define the signature of relapse of the disease. We believe this approach will represent a new paradigm in managing chronic conditions governed by interaction between patient-level factors and their environment, and could be scaled up if successful for use for other autoimmune diseases. Data integration for AVERT is using linked data principles. Different streams of data are combined in an RDF triple store. Clinical Decision Support Systems. I am currently focussed on CDSS in primary care. I had a small role in the EU FP7 funded TRANSFoRm project, working with colleagues at the Royal College of Surgeons in Ireland, on Workpackage 4, developing services to deliver ontologies and evidence for clinical decision making in general practice. I was the coordinator of the HEA-funded Medilink programme (2000-2004) which sought to link patient records with clinical knowledge represented in various forms. I specifically worked on its clinical guidelines and protocols component. I was one of 4 PIs on the multidisciplinary LEARN project on Organisational Learning for Irish Development Aid Organisations. The title of my PhD thesis, completed in October 1998, was \"Pattern-based text analysis for office documents\". The idea is that many office text-based tasks could be automated with pattern-based tools if these tools were provided in a convenient framework. I developed a pattern matching tool, other pattern-based text analysis tools and a computational framework for specfiyig information extraction and related tasks. Publications See details on my TCD portal page. [Computer Science & Statistics, Trinity College Dublin] Lucy Hederman, <hederman@tcd.ie> Last modified: 20 September 2017",
  "content_length": 4081,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:34"
}