{
  "name": "Ludovico Iovino",
  "homepage": "http://cs.gssi.it/ludovico.iovino",
  "status": "success",
  "content": "Ludovico Iovino Personal Website – PhD in Computer Science Ludovico Iovino PhD in Computer Science Software Engineer Associate Professor at the GSSI My CV Contact Me About Me Hello! My name is Ludovico.I have a Ph.D. in Computer Science, and I'm currently Associate Professor at the  GSSI – Gran Sasso Science Institute in L’Aquila in the Computer Science department. The GSSI is an international PhD school and a centre for advanced studies in physics, mathematics, computer science and social sciences, it has been instituted as a new Italian graduate school of advanced studies in 2016, after a three-years successful experimental period. Academic Metrics Scholar H-Index 25 Scholar Citations 2100 Scopus H-Index 19 Scopus Citations 1300 My Research Area Model Driven Engineering and Low Code Development Foundation and application of MDE in different domains. Aspects of Coupled evolution of metamodels and domain specific languages (DSLs) Smart and Sustainable Cities Urban Digital Twin Modeling of Smart Cities and KPIs assessment using DSLs and Quality Evaluation Systems Software Architectures Modeling of Software Architectures and Reference Architectures, Architecture Technical Debt, migration and evolution. Digital Twins Digital Twin modeling with Models@Runtime paradigm and software visualization techniques. Resume Experience 2024 - Present Associate Professor Gran Sasso Science Institute 2015 - 2024 Assistant Professor Gran Sasso Science Institute 2013 - 2015 Postdoc Researcher University of L'Aquila 2006 - 2008 Software Analyst Regione Abruzzo Education 2021 - 2030 National Scientific Habilitations Sector 01/B1 and 09/H1 2013 PhD in Computer Science and Applications University of L'Aquila 2009 Master Degree University of L'Aquila Master Degree in Computer Science, Maximum score 110/110 “cum laude” 2007 Master in Web Technology University of L'Aquila Awards 2023 Ten year most influential theme section paper award SoSyM Journal The paper entitled \"Managing the evolution of data-intensive Web applications by model-driven techniques\" selected to receive the The ten year most influential regular paper award. Certificate 2023 Paper selected as Journal First SoSyM Journal The paper entitled \"Reference architectures modelling and compliance checking\" has been selected among the best papers published in the SoSyM journal to be presented as journal first at MODELS 2023. 2021 Paper selected as Journal First SoSyM Journal The paper entitled \"MIKADO – A Smart City KPIs Assessment Modeling Framework\" has been selected among the best papers published in the SoSyM journal to be presented as journal first at MODELS 2021. 2019 Best Paper Award MODELS Conference Best Paper Award @ MODELS 2019 with a paper entitled \"Automated Classification of Metamodel Repositories: A Machine Learning Approach\" co-authored with Phuong Nguyen, Juri Di Rocco, Davide Di Ruscio, Alfonso Pierantonio. 2011 1st Prize Business Plan Competition University of L'Aquila 1st prize  in the Business Plan Competition 2010-2011 organized by the Technology transfer, patents, spin-offs office of the University of L’Aquila (Italy). Name of the proposed project: BusOnAir Projects All Funded RASTA – Realtà Aumentata e Story-Telling Automatizzato per la valorizzazione di Beni Culturali ed Itinerari Funded Smart, Secure and Inclusive Communities Funded COBOL – COmmunity-Based Organized Littering Funded Teaching 2022-2025 Theory and Application of Model Driven Engineering [Core - Course] Main Instructor, GSSI Main instructor of the Theory and Application of MDE, CORE course. 2022-2023 Engineering and quality management of human-centric and smart systems [Core - Course] Co-Instructor, GSSI Main instructor of the Theory and Application of MDE, CORE course. 2022-2025 Introduction to Software Engineering Course Co-Instructor, GSSI Immigration course for 1st year PhD students. 2017-2021 Software Systems and Services Course Main instructor, GSSI Immigration course for Phd students of 1st year 2016-2017 Model Driven Engineering Main Instructor, University of L'Aquila Main instructor for the MDE course, a.a. 2015-2016 Master Degree in Computer Science. PhD Supervision and Advisory Board 2023 - Now TRAN Thi Dinh Distilling Reference Architectures from Open Source Repositories 2021 - Now Pereira Rickson Automated Generation and Configuration of Domain-Specific Recommender Systems 2020 - Now Tuyishime Adiel Modeling Environment of REST APIs and Linked Open Data 2018 - 2023 Maria Teresa Rossi Supporting Smart Cities Quality Evaluation Exploiting Model-Driven Engineering Completed in March 2023 Available Thesis Transformation chaining based on domain-specific custom information loss Conventional wisdom on model transformations in Model-Driven Engineering (MDE) suggests that they are crucial components in modeling environments to achieve superior automation, whether it be refactoring, simulation, or code generation. While their relevance is well-accepted, model transformations are challenging to design, implement, and verify because of the inherent complexity that they must encode. Thus, defining transformations by chaining existing ones is key to success for enhancing their reusability. When multiple transformation chains are available to bridge a source metamodel with a target one, selecting the optimal chain could be based on quality criteria, e.g., coverage and information loss. We aim at extending the algorithms proposed in [1] and [2] to better support domain-specific importance notion that can also be extended and refined at the instance level. [1] Francesco Basciani, Daniele Di Pompeo, Davide Di Ruscio, Ludovico Iovino, and Alfonso Pierantonio. 2021. Integrating semantic reasoning in information loss-based transformation chain rankers. In Proceedings of the 36th Annual ACM Symposium on Applied Computing (SAC '21). Association for Computing Machinery, New York, NY, USA, 1494–1503. https://doi.org/10.1145/3412841.3442024[2] Basciani, Francesco, et al. \"Automated selection of optimal model transformation chains via shortest-path algorithms.\" IEEE Transactions on Software Engineering 46.3 (2018): 251-279. BOARD OF INTERNATIONAL JOURNALS 2023 - now Editorial Board Member Journal of Computer Languages (ISSN: 2590-1184) Editorial Board Member with Journal of Computer Languages. Certificate 2023 -2024 Guest Editor Model-Driven Engineering for Software Architecture Guest Editor on the Journal of Systems and Software on \"Model-Driven Engineering for Software Architecture\" See online 2022 -2023 Guest Editor Journal of Software and Systems Modeling - SoSyM Guest Editor for Theme Section on “Models and Evolution” 2022 Guest Editor Journal of Computer Languages - COLA (ISSN 2590-1184) Guest editor of the special issue \"Foundations and Practice of Visual Modeling (FPVM)\" 2022 Review Board Member IEEE Transactions on Software Engineering Review Board Member for the IEEE Transactions on Software Engineering journal 2021 Guest Editor Journal of Computer Languages - COLA (ISSN 2590-1184) Guest Editor for Special issue on “Methods, Tools and Languages for Model-driven Engineering and Low-code Development” See online 2019-2020 Guest Editor Journal of Object Technology - JOT Special Issue \"Models and evolution\" for the Journal of Object Technology. JOT is a peer-reviewed, free and open-access journal. See online Recent reviewer activities for international journals: Journal Systems Engineering (ISSN:1520-6858)The International Journal on Software and Systems ModelingACM Transactions on the WebSoftware Quality JournalIEEE Software on Collaborative Modeling in SEThe Journal of Systems and Software (JSS)Control Engineering Practice JournalThe IEEE Transactions on Software Engineering (TSE)The Journal of Internet Services and Applications – JISAThe Journal of Computer Languages Systems and Structures – CLSS Scientific and Industrial Association and memberships Get in Touch Address: GSSI, v.le Rendina Email: ludo[at]ludovicoiovino.it Phone: +39 0862 4280 250 Contact Form Send Message Δ Gestisci Consenso Per fornire le migliori esperienze, utilizziamo tecnologie come i cookie per memorizzare e/o accedere alle informazioni del dispositivo. Il consenso a queste tecnologie ci permetterà di elaborare dati come il comportamento di navigazione o ID unici su questo sito. Non acconsentire o ritirare il consenso può influire negativamente su alcune caratteristiche e funzioni. Funzionale Funzionale Sempre attivo L'archiviazione tecnica o l'accesso sono strettamente necessari al fine legittimo di consentire l'uso di un servizio specifico esplicitamente richiesto dall'abbonato o dall'utente, o al solo scopo di effettuare la trasmissione di una comunicazione su una rete di comunicazione elettronica. Preferenze Preferenze L'archiviazione tecnica o l'accesso sono necessari per lo scopo legittimo di memorizzare le preferenze che non sono richieste dall'abbonato o dall'utente. Statistiche Statistiche L'archiviazione tecnica o l'accesso che viene utilizzato esclusivamente per scopi statistici. L'archiviazione tecnica o l'accesso che viene utilizzato esclusivamente per scopi statistici anonimi. Senza un mandato di comparizione, una conformità volontaria da parte del vostro Fornitore di Servizi Internet, o ulteriori registrazioni da parte di terzi, le informazioni memorizzate o recuperate per questo scopo da sole non possono di solito essere utilizzate per l'identificazione. Marketing Marketing L'archiviazione tecnica o l'accesso sono necessari per creare profili di utenti per inviare pubblicità, o per tracciare l'utente su un sito web o su diversi siti web per scopi di marketing simili. Gestisci opzioni Gestisci servizi Gestisci {vendor_count} fornitori Per saperne di più su questi scopi Accetta Nega Visualizza le preferenze Salva preferenze Visualizza le preferenze {title} {title} {title} Gestisci consenso",
  "content_length": 9880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:41"
}