{
  "name": "Luigi Palopoli 0002",
  "homepage": "https://luigipalopoli.disi.unitn.it",
  "status": "success",
  "content": "Luigi Palopoli Skip to content Research interests AI applications to Service RoboticsDesign of Real–Time Embedded SystemsCyberphysical systems Selected recent publications [AI application to Service Robotics] P. Bevilacqua, M. Frego, D. Fontanelli, L. Palopoli, Reactive Planning for Assistive Robots. IEEE Robotics and Automation Letters 3(2): 1276-1283 (2018) RAL-ReactiveDownload Authors’ Draft [Assistive Technologies] Ferrari, F., S. Divan, C. Guerrero, F. Zenatti, R. Guidolin, L. Palopoli, and D. Fontanelli. Human–Robot Interaction Analysis for a Smart Walker for Elderly: The ACANTO Interactive Guidance System. INTERNATIONAL JOURNAL OF SOCIAL ROBOTICS 2019 (2019). [Design of Real–Time Systems] Tadeus Prastowo, Luigi Palopoli, Luca Abeni: Tice: a Real–time language Compilable using C++ compilers, Software Practice and Experience, in Press SPE2020Download Authors’ Draft [Assistive Roboticss] Marco Andreetto, Stefano Divan, Francesco Ferrari, Daniele Fontanelli, Luigi Palopoli and Fabiano Zenatti, Simulating passivity for Robotic Walkers via Authority-Sharing, IEEE Robotics and automation letters, year 2018 Main_simulated_passivity-1Download [Design of Real–TIme Systems] Bernardo Villalba Frìas, Luigi Palopoli, Luca Abeni, Daniele Fontanelli, Probabilistic Real-Time Guarantees: There Is Life Beyond the i.i.d. Assumption (Outstanding Paper). RTAS 2017: 175-186 [CyberPhysical Systems ] Daniele Fontanelli; Luca Greco,; Luigi Palopoli Optimal Resource Allocation for Stochastic Systems Performance Optimisation of Control Tasks undergoing Stochastic Execution Times, International Journal of Control, In press DraftDownload Authors’ Draft [Robot Localisation] Payam Nazemzadeh, Daniele Fontanelli, David Macii, Luigi Palopoli, Indoor localization of mobile robots through QR code detection and dead reckoning data fusion, IEEE/ASME TRANSACTIONS ON MECHATRONICS, Vol.6, year 2107 ASME-1Download [Robot Motion Planning] Marco Frego, Enrico Bertolazzi, Francesco Biral, Daniele Fontanelli Luigi Palopoli, Semi-analytical minimum time solutions with velocity constraints for trajectory following of vehicles, Automatica, Vol. 86, year 2017 manuscriptDownload [Robot Localisation] Payam Nazemzadeh, Moro Federico, Daniele Fontanelli, David Macii, Luigi Palopoli, Indoor Positioning of a Robotic Walking Assistant for Large Public Environments, IEEE Transactions on Instrumentation and Measurement, year 2015 post_print-2Download [Assistive Robotics] Luigi Palopoli et al., Navigation assistance and guidance of older adults across complex public spaces: the DALi approach, INTELLIGENT SERVICE ROBOTICS, year 2015 PalopoliEtAl15ISRDownload Professor of Robotics and Embedded Systems DISI department University of Trento Latest news Student Office Hours 8 Settembre 2022 AI Seminar Series 1 Febbraio 2021 New youtube channel for Embedded Intelligence and Robotic Systems research group 11 Gennaio 2021 Change in the schedule for Robot Planning and its Applications course 16 Settembre 2020 Links available for the Robotic Planning and Real–Time operating courses 14 Settembre 2020",
  "content_length": 3092,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:43"
}