{
  "name": "Luigia Aiello",
  "homepage": "http://www.diag.uniroma1.it/users/luigia%20carlucci-aiello",
  "status": "success",
  "content": "Luigia Carlucci Aiello | Dipartimento di Ingegneria informatica, automatica e gestionale Salta al contenuto principale Home » Users » Luigia Carlucci Aiello Luigia Carlucci Aiello Professore emeritostanza: A101telefono: +39 0677274087email uniroma1: luigia.aiello@uniroma1.it Biografia Laurea in Matematica all'Università di Pisa e Diploma della Scuola Normale Superiore di Pisa, nel 1968. Dal 1970 al 1981 ricercatrice CNR all'Istituto di Elaborazione dell'Informazione, ora ISTI, di Pisa. Negli anni settanta lavora all'Artificial Intelligence Laboratory della Stanford University diretto da J. McCarthy.      Professore Ordinario dal 1981. Dal 1982 è al DIS, ora DIAG, Sapienza Università di Roma; dal 1991 è titolare della cattedra di Intelligenza artificiale. È stata coordinatrice del Dottorato di ricerca in Ingegneria informatica e Presidente del Consiglio di area in Ingegneria informatica. Dal  2006 al 2010 ha diretto il DIS, dal 2010 al 2013 è stata preside della neo costituita Facoltà di Ingegneria dell’Informazione, Informatica e Statistica.      Nel 1988 fonda ed è primo presidente della Associazione Italiana per l'Intelligenza Artificiale, AI*IA, attualmente ne è socia onoraria. Presidente del comitato di programma di ECAI'90 e KRR'96, trustee di IJCAI dal 1995 al 2005, presidente di IJCAI'99, presidente di FoLLI nel 2004-2005; nel 2002-2003 ha diretto l' ITC-irst in Trento. Ha coordinato molti progetti nazionali, progetti, gruppi di lavoro e reti di eccellenza della Unione Europea.  Membro di comitati di valutazione nazionali e internazionali, e di numerosi comitati di redazione.      Negli anni  settanta ha lavorato su deduzione automatica e costruzione di dimostratori interattivi di teoremi, con applicazione alla verifica di proprietà di programmi.  Al DIS ha fondato un gruppo di ricerca in Intelligenza Artificiale, ha condotto ricerche su rappresentazione della conoscenza e ragionamento automatico.  In particolare, ha indagato sulle possibilità offerte da una rappresentazione esplicita della meta-conoscenza per rendere le deduzioni più efficienti, per aumentare il potere espressivo di un sistema, per dotarlo di capacità di introspezione e per permettere il ragionamento sulla conoscenza e sul ragionamento in situazioni di agenti multipli. Ha indagato le potenzialità di alcune logiche modali per la rappresentazione del ragionamento autoepistemico e in situazioni di conoscenza incompleta (default). Ha applicato tecniche di Intelligenza Artificiale alla costruzione di sistemi intelligenti e sistemi di supporto all'apprendimento umano; ha svolto ricerche su robotica cognitiva e applicazione di tecniche di pianificazione a problemi di sicurezza informatica. Dal giugno 2015 è in quiescenza. Riconoscimenti e premi Fellow dell'AAAI (1995) e dell'ECCAI, ora EurAI (1999). Donald Walker Award dell'IJCAI (2009). Laurea Honoris Causa (2002) dalla Facoltà di Tecnologia dell'Università di Linköping – Svezia. ECCAI, ora EurAI Distinguished service Award (2014) Membro dell’Accademia Europea di Scienze e Arti (2015). Membro di Ultime pubblicazioni Ekphrasis in Encyclopedia of Renaissance Philosophy in stampa Probabilistic approach in Rocking Analysis of Masonry Elements: influence of the restitution coefficient on the response. in Ricerca in Vetrina, Associazione Dottorandi e Dottori di Ricarca Italiani ADI in stampa Last 50 publications © Università degli Studi di Roma \"La Sapienza\" - Piazzale Aldo Moro 5, 00185 Roma",
  "content_length": 3468,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:39"
}