{
  "name": "Luigi Carro",
  "homepage": "http://www.inf.ufrgs.br/~carro",
  "status": "success",
  "content": "Dr. Luigi Carro Enough for evolution ... Contact Info Departamento de Informática Aplicada Instituto de Informática - UFRGS Av. Bento Gonçalves, 9500 - Campus do Vale - Bloco IV Bairro Agronomia - Porto Alegre - RS -Brasil CEP 91501-970 Po Box: 15064 Phone: +55 (51) 3308-6806 Fax: +55 (51) 3308-7308 Teaching Activities Undergraduate courses INF 113 - OrgB - Computer Organization Material available at INF Moodle Graduate courses CMP117 - VLSI Architectures II CMP 237  Computer architecture and organization CMP XXX  Low energy software Research Embedded Systems Automatic software synthesis for low energy designs. The goal of this research is to bring the software design to a high abstraction level, supporting automation, and consequently allowing a huge increase in design productivity for embedded systems development. Specifically, we aim at6 developing tools to allow low energy software development while hiding the hardware details that make it possible. Tools for embedded systems design automation. In this research we aim at the development of new tools that, while allowing design space exploration to increase productivity, reach designs with good quality. Java, Simulink and UML are design entry languages, and some tools cover communication cost optimization, Java method memory management, and NOC quality of service in real-time systems. Embedded Java processor synthesis. We support the Sashimi environment, and given a Java description, we are able to synthesize the ASIP that executes that Java code. Current examples support an MP3 player and other embedded show-cases. Reconfigurable Architectures Reconfigurable architectures with software compatibility.  The goal is to provide a reconfigurable array with a binary translation mechanism, so that we can execute code in a faster and lower energy device (the reconfigurable array), while maintaining software compatibility. Fault tolerant systems in future technologies. The objective of this research is to cope with future technologies when transistor density will be huge, but the transistors will be so small that their reliability will be too small. We propose several solutions based on algorithmic changes, minimum architecture change and radically new computing strategies. Curriculum Vitae The Brazilian government supports a standard format for CVs. Please look at Lattes CV Although in Portuguese, most data like publications is easily recognizable. Books Adaptable Embedded Systems Beck Filho, Antonio Carlos Schneider; Lang Lisbôa, Carlos Arthur; Carro, Luigi (Eds.) 1st Edition., 2012, 250 p. Hardcover, ISBN 978-1-4614-1745-3 Due: March 2012 Dynamic Reconfigurable Architectures and Transparent Optimization Techniques: Automatic Acceleration of Software Execution Luigi Carro, Antonio Carlos Schneider Beck 1st Edition., 2010, XVII, 225 p. Hardcover, ISBN 978-90-481-3912-5 Fault-Tolerance Techniques for SRAM-Based FPGAs Series: Frontiers in Electronic Testing , Vol. 32 Kastensmidt, Fernanda Lima, Carro, Luigi, Reis, Ricardo 2006, XV, 183 p., Hardcover ISBN: 978-0-387-31068-8 Projeto e Prototipação de Sistemas Digitais Luigi Carro 176 páginas, 2001. Edição com disquete. ISBN 85-7025-589-6 Editora da UFRGS (esgotado) Useful Links Embedded Systems Lab - Laboratório de Sistemas Embarcados UFRGS Graduation Program in Computer Science - PPGC Some informations for Brazilian students Propostas de trabalho de conclusão Tenho várias. Se voce se interessa pelos temas de pesquisa acima, ou se gostaria de propor algo que eu esteja apto a orientar, por favor envie um e-mail para marcarmos uma reunião. Orientação de teses e dissertações Atualmente oriento no PPGC (computação). Tenha em mente que candidatos a mestrado na Computação devem fazer poscomp. Para escolha de temas e trabalhos, após ter olhado meu CV (para ver se sou um potencial orientador na sua área de interesse), por gentileza envie um e-mail para combinarmos uma reunião.",
  "content_length": 3935,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:40"
}