{
  "name": "Luigi V. Mancini",
  "homepage": "https://sites.google.com/di.uniroma1.it/mancini",
  "status": "success",
  "content": "Luigi Vincenzo ManciniSearch this siteEmbedded FilesSkip to main contentSkip to navigationLUIGI VINCENZO MANCINIFull Professor of Computer Science at Sapienza University of Rome, ItalyResearch interests: cybersecurity, data privacy, network and information security.BiographyLuigi V. Mancini is a professor at Sapienza University of Rome.He published more than 150 scientific papers in international conferences and journals, and received more than 9500 citations. He served on the program committees of several international conferences, among which: ACM Conference on Computer and Communication Security, ACM Symposium on Access Control Models and Technology, European Symposium on Research in Computer Security, and Financial Cryptography and Data Security Conference.He has served as a partner leader in several national and international research projects, including the Gen4Olive project (EC Horizon 2020, Grant Agreement No. 101000427), the SUNFISH project (EC Horizon 2020, Grant Agreement No. 644666), and GAINS (Geopolitics Aware INternet Strategies, Ref. HOME/2013/CIPS/AG/4000005057) funded by the European Commission – Directorate-General for Home Affairs. Formerly, he has been the Vice Dean of the Facoltà di Ingegneria dell'Informazione, Informatica e StatisticaLuigi V. Mancini received the PhD degree in Computer Science from the University of Newcastle upon Tyne, UK, in 1989.Awards2020 Jean-Claude Laprie Award for the following paper:Ateniese, G., Di Pietro, R., Mancini, L. V., Tsudik, G. \"Scalable and Efficient Provable Data Possession\". In Proc. 4th Intl. Conf. on Security and Privacy in Communication Networks (SecureComm 2008), Istanbul, Turkey, pp.1-10, September 2008. https://doi.org/10.1145/1460877.1460889.Read moreResearch ProjectsProject  Gen4Olive: grant agreement No. 101000427, funded by the EC Horizon 2020 programme, 2020-25.Project  SUNFISH: grant agreement No. 644666, funded by the EC Horizon 2020 programme, 2014-17.Project GAINS: Geopolitics Aware INternet Strategies, HOME/2013/CIPS/AG/4000005057, funded by the European Commission - Directorate General Home Affairs, 2014-17.Project ExTrABIRE: Exchanged Traffic Analysis for a Better Internet Resiliency in Europe, CIPS 2009 II - JLS/2009/CIPS/AG/C2-065,  funded by the European Commission - Directorate General Home Affairs. Project Web-based management and representation of spatial and geographic data, 2004-2005Project FIRB-MIUR, WEB MINDS: Wide-scalE Broadband Middleware for Network Distributed Services, 2002-2006Project WHIPS: Windows Host Intrusion Prevention System, 2003Project REMUS: REference Monitor for Unix Systems, 1999Also recipient of funds from the Sapienza University of Rome \"Progetti Ateneo\".External Collaborations:George Mason University, Virginia, USA: Center for Secure Information System.University of Padoa, Italy: Security and Privacy Research GroupPublicationA list of publications can be found at Google Scholar and at DBLP.Former PhD StudentsA partial list of former PhD students can be found at the Mathematics Genealogy Project  ContactLUIGI VINCENZO MANCINIEmail: lv.mancini@di.uniroma1.itTelephone: +39 0649255421 Address:Dipartimento di Informatica,Università di Roma \"La Sapienza\"295 Viale Regina Elena,00161 Roma, Italy Report abuseReport abuse",
  "content_length": 3281,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:38"
}