{
  "name": "Luis Rueda 0001",
  "homepage": "http://www.uwindsor.ca/science/computerscience/1033/dr-luis-rueda",
  "status": "success",
  "content": "Dr. Luis Rueda | School of Computer Science Skip to main content University of Windsor Search Enter the terms you wish to search for. Search CLOSE QUICK LINKS Current StudentsBrightspaceUWinsite StudentCampus BookstoreFaculty + StaffUWinsite FinanceAlumni + DonorsIndustry + Community Partners Faculty of Science About Academics Research Student Experience News and Events Giving to Science EDI Alumni About About UWindsor Office of the President People, Equity and Inclusion Virtual Tour Visitor Information Campus Maps Parking VIEW Magazine Academics ProgramsUndergraduate Programs Graduate Programs International Programs Co-operative Education Continuing Education SupportOffice of the Registrar Financial Matters Office of the Provost Faculties Arts, Humanities, and Social Sciences Law Education Nursing Engineering Business Graduate Studies Human Kinetics Science Research Research & Innovation Research Partnerships Research Ethics Research Safety Animal Care Research Finance Leddy Library UWill Discover! Student Life About Student Life UWindsor Events SoCA Concerts & Events Lancers Varsity Sports Athletics + Recreation Services Student Accessibility Services Residence Food Services Student Support Back to Top FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR MENU FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR School of Computer Science School of Computer Science In this section Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us UWindsor Home School of Computer Science Dr. Luis Rueda Dr. Luis Rueda Professor 519-253-3000 ext. 3793 lrueda@uwindsor.ca Office: 8110 LT Education: B.Sc. in Computer Science (Informatics), National University of San Juan, Argentina, 1993 M.Sc. in Computer Science, Carleton University, Canada, 1998 Ph.D. in Computer Science, Carleton University, Canada, 2002 Professional Affiliations: Senior Member of the Institute of Electrical and Electronics Engineers (IEEE) Member of the Association for Computing Machinery (ACM) Member of the International Association of Pattern Recognition (IAPR) Member of the International Society for Computational Biology (ISCB) Research Interests: Machine learning, pattern recognition and deep learning Computational biology and bioinformatics Transcriptomic and Interactomic Data Analytics Biological knowledge discovery and cancer biomarkers Data security and user authentication Selected Publications: 1.      A. Vasighizaker, S. Hora, R. Zheng, L. Rueda. “SEGCECO: Subgraph Embedding of Gene expression matrix for prediction of CEll-cell Communication.” Briefings in Bioinformatics, 2024, 25(3):bbae160. 2.      S. Modak, E. Abdel-Raheem, L. Rueda. “GPD-Nodule: A Lightweight Lung Nodule Detection and Segmentation Framework on Computed Tomography Images Using Uniform Superpixel Generation”. IEEE Access. 2024, pp. 154933-154948. 3.      A. Vasighizaker, Y. Trivedi, L. Rueda. “Cell Type Annotation Model Selection: General-Purpose vs. Pattern-Aware Feature Gene Selection in Single-Cell RNA-Seq Data.” Genes, 2023, 14(3):596. DOI: 10.3390/genes14030596. 4.      S. Modak, E. Abdel-Raheem, L. Rueda. “Applications of deep learning in disease diagnosis of chest radiographs: A survey on materials and methods.” Biomedical Engineering Advances, 2023, 5(2023):100076, DOI:10.1016/j.bea.2023.100076. 5.      A. Vasighizaker, S. Danda, L. Rueda. “Discovering Cell Types Using Manifold Learning and Enhanced Visualization of Single-cell RNA-Seq Data”. Scientific Reports, Sci Rep 12, 120, 2022. DOI: 10.1038/s41598-021-03613-0. 6.      M. Naik, L. Rueda, A. Vasighizaker. “Identification of Enriched Regions in ChIP-seq Data via a Linear-time Multi-level Thresholding Algorithm”. IEEE/ACM Transactions on Computational Biology and Bioinformatics, 2021, DOI: 10.1109/TCBB.2021.3104734. 7.      N. Fatima, L. Rueda. “iSOM-GSN: An Integrative Approach for Transforming Multi-omic Data into Gene Similarity Networks via Self-organizing Maps”, Bioinformatics, Volume 36, Issue 15, 2020, Pages 4248–4254. Website: https://luisrueda.myweb.cs.uwindsor.ca/ share post share CS Events Fall 2025 Demo Day Fri, 12/05/2025 - 10:00 SCS Demo Day - Looking Forward to Seeing You Fri, 12/05/2025 - 10:00 Accelerating Image Classification with Graph Convolutional Neural Networks using Voronoi Diagrams - PhD Dissertation Proposal by: Mustafa Mohammadi Gharasuie Fri, 12/12/2025 - 13:00 WiCyS Windsor Twitter Tweets by wicyswindsor Computer Science Society Instagram View this post on Instagram A post shared by UWin Computer Science Society (@uwindsorcss) share post share",
  "content_length": 5254,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:45"
}