{
  "name": "Luis Carlos Erpen De Bona",
  "homepage": "https://web.inf.ufpr.br/bona",
  "status": "success",
  "content": "Luis C. E. Bona Pular para o conteúdo É professor associado da Universidade Federal do Paraná, possui doutorado pela UTFPR e realizou Pós-Doutorado no Barcelona Supercomputing Center (BSC).  Foi Chefe do Departamento de Informática  (DInf) entre 2008 e 2012; vice-coordenador entre 2014 e 2016 e coordenador desde 2019 do Programa de Pós-Graduação em Informática (PPGInf).  No período entre 2014 e 2016 também foi  representante da classe de professor adjuntos no COPLAD/COUN. É bolsista produtividade do CNPq  atuando na área de Ciência da Computação, com ênfase em Sistemas Distribuídos,  principalmente nos seguintes temas: Sistemas Operacionais com foco em Armazenamento, Cloud Computing, Redes Definidas por Software e Sistemas Distribuídos de Larga Escala. Participou e coordenou projetos de pesquisa e desenvolvimento tecnológico com financiamento do Ministério da Educação, Ministério da Comunicação, SETI-PR e RNP. Currículo do Sistema Lattes Research Gate Orientações e Coorientações: Dissertações Teses Alguns livros interessantes fora da computação Descartes’ Bones: A Skeletal History of the Conflict Between Faith and Reason. Russel Shorto Sapiens, Uma breve história da humanidade. Yuval Noah Harari Home deus. Yuval Noah Harari The Big Picture: On the Origins of Life, Meaning, and the Universe Itself, Sean Carrol O Capital no século XXI. Thomas Piketty The Price of Inequality: How Today’s Divided Society Endangers Our Future. Joseph Stiglitz Thinking, Fast and Slow. Daniel Kahneman Muito Além do Nosso Eu . Miguel Nicolelis A tolice da inteligencia Brasileira. Jesse de Souza Why we sleep. Matthew Walker Guns, Germs, and Steel: The Fates of Human Societies, Jared Diamond O Andar do Bêbado – Como o Acaso Determina Nossas Vidas, Leonard Mlodinow O Gene, Siddhartha Mukherjee Criação: A origem da vida/O futuro da vida , Adam Rutherford Como as democracias morrem, Steven Levitsk e Daniel Ziblatt",
  "content_length": 1917,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:43"
}