{
  "name": "Luis Gravano",
  "homepage": "http://www.cs.columbia.edu/~gravano",
  "status": "success",
  "content": "Luis Gravano Luis Gravano Professor, Computer Science Department Columbia University Areas of Research Databases, Information Retrieval, Web Search: distributed search over text databases, information extraction, event identification in social media, text mining, social media mining for public health Publications and Patents (from Google Scholar, from DBLP) CV Columbia University Database Research Group Contact Information Address: Computer Science Department Columbia University 1214 Amsterdam Avenue New York, NY 10027, USA Office: Schapiro CEPSR 706 Phone: +1-212-853-8465 Email: gravano@cs.columbia.edu Homepage: https://www.cs.columbia.edu/~gravano Pronouns: he, him, his Some Current and Past Research Projects Social media and public health: Adaptive information extraction from social media for actionable inferences in public health (TACL '24 paper, SocialNLP '21 paper, Findings of EMNLP '20 paper, LOUHI '20 paper, EMNLP '19 paper, W-NUT '19 paper, LLD '19 paper, JAMIA '18 paper, CDC MMWR '14 paper) Information extraction at Columbia (IP&M '17 paper, CIKM '15 paper, EDBT '15 paper, JCDL '14 paper, PVLDB '13 paper, DBRank '11 paper, WebDB '10 paper, ICDE '09 paper, SIGMOD Record '08 paper, ICDE '08 paper, TODS '07 paper, SIGMOD '06 paper) Event identification in social media (September '13 IEEE Data Engineering Bulletin paper, WSDM '12 paper, JASIST '11 paper, ICWSM '11 paper (a), ICWSM '11 paper (b), WSDM '10 paper, SSM '10 poster) QProber, a system for automatically classifying and searching \"hidden-web\" text databases (TOIS '08 paper, TODS '07 paper, ICDE '05 paper, SIGMOD '04 paper, TOIS '03 paper, VLDB '02 paper, March '02 IEEE Data Engineering Bulletin paper) RANK, top-k query processing (over relational databases: TODS '02 paper; over web-accessible databases: TODS '04 paper; over multimedia databases: TKDE '04 paper) Snowball and QXtract, building blocks for efficient information extraction (ICDE '03 paper [errata], WebDB '03 paper, DL '00 paper) SDARTS, a protocol and toolkit for metasearching (JCDL '02 paper, JCDL '01 paper) GeoSearch, a geographically-aware search engine (CIKM '03 paper, VLDB '00 paper) Ph.D. Students Eugene Agichtein (graduated 5/2005; first employment: Postdoc Researcher, Microsoft Research; current employment: Professor, Department of Computer Science, Emory University) Pablo Barrio (graduated 10/2015; current employment: Staff Software Engineer, Google) Hila Becker (graduated 10/2011; current employment: Director, Software Engineering, Google) Nicolás Bruno (graduated 5/2003; first employment: Researcher, Microsoft Research; current employment: Gray Systems Lab, Microsoft Research) Wisam Dakka (graduated 11/2008; first employment: Software Engineer, Google; current employment: Co-Founder, Meemo) Panagiotis Ipeirotis (graduated 9/2004; current employment: Professor, Stern School of Business, New York University) Alpa Jain (graduated 9/2008; first employment: Scientist, Yahoo! Labs; current employment: Principal Software Engineer, Google) Giannis Karamanolakis (graduated 8/2022; current employment: Applied Scientist, Amazon Alexa AI) Amélie Marian (graduated 9/2005; current employment: Associate Professor, Department of Computer Science, Rutgers University) Ioannis Paparrizos (graduated 7/2018: Honorable Mention, KDD 2019 Dissertation Award; first employment: Postdoc Scholar, University of Chicago; current employment: Assistant Professor, Department of Computer Science and Engineering, The Ohio State University) Gonçalo Simões (co-advised by Helena Galhardas) (graduated 6/2016; current employment: Senior Software Engineer, Google) Selected Professional Activities ACM Transactions on Database Systems: associate editor (2004-2010) ACM Transactions on Information Systems: associate editor (1997-2005) IEEE Data Engineering Bulletin: associate editor (2000-2002) Editor, Special Issue on \"Text and Databases,\" December 2001 Editor, Special Issue on \"Next-Generation Web Search,\" September 2000 SIGMOD 2012: program chair Teaching and Advising: On Sabbatical in 2025-26 Academic Year No office hours or new research project advising during the 2025-26 academic year Biographical Sketch Luis Gravano is a Professor of Computer Science at Columbia University. Luis joined Columbia in 1997. At Google, he was a Senior Research Scientist in 2001 and a Visiting Faculty Researcher in 2018-19. He received his Ph.D. degree in Computer Science from Stanford University in 1997, an M.S. degree from Stanford in 1994, and a B.S. degree from the Escuela Superior Latinoamericana de Informática (ESLAI), Argentina, in 1991. His research interests are in databases, information retrieval, and web search. Luis has earned an NSF CAREER award and multiple best paper awards, including at the ACM SIGMOD 2006 and IEEE ICDE 2005 conferences, and the ACM SIGMOD 2025 \"Test of Time\" award. His teaching has also been recognized at Columbia with the \"Distinguished Teacher Award\" from the Computer Science Department in 2011 and the \"Distinguished Faculty Teaching Award\" from the Columbia Engineering Alumni Association in 2012.",
  "content_length": 5109,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:43"
}