{
  "name": "Luis Antonio Brasil Kowada",
  "homepage": "http://www.professores.uff.br/kowada",
  "status": "success",
  "content": "Luis Antonio Kowada Portal do Governo Brasileiro Atualize sua Barra de Governo Luis Antonio Kowada Instituto de Computação Professor Associado do Departamento de Ciência da Computação (TCC). Doutor em Engenharia de Sistemas e Computação pela Universidade Federal do Rio de Janeiro (UFRJ). Mestre em Matemática Aplicada pela Universidade de São Paulo (USP). Bacharel em Ciência da Computação pela Universidade de Brasília (UnB). Atua em diversas áreas da Computação e da Matemática. Disciplinas Ministradas na UFF\t\t\tPara os alunos matriculados atualmente, todo material e informações sobre cada disciplina deste período encontram-se na Plataforma EAD do CEAD. 2021/2: Programação de Computadores Laboratório de Resolução de Problemas 2021/1: Programação de Computadores Computação Quântica 2020/2: Programação de Computadores 2020/1: Programação de Computadores Computação Quântica 2019/2: Teoria Computacional dos Números (pós-graduação) Análise e Síntese de Algoritmos (pós-graduação) Compiladores 2019/1: Programação de Computadores I Teoria da Computação (pós-graduação) 2018/2: Segurança da Informação Biologia Computacional (pós-graduação) 2018/1: Programação de Computadores I Laboratório de Resolução de Problemas 2017/2: Tópicos Especiais em Segurança da Informação (Criptografia Pós-quântica) Fundamentos Matemáticos para a Computação 2017/1: Segurança da Informação Compiladores 2016/2: Estrutura de Dados Programação de Computadores 2016/1: Tópicos Especiais em Inteligência Artificial (Computação Quântica) Compiladores 2015/2: Tópicos Especiais em Segurança da Informação Programação de Computadores I 2015/1: Redes de Computadores II para Sistemas de Informação Programação de Computadores I 2014/2: Educação Matemática - Geometria Geometria Básica 2014/1: Educação Matemática - Geometria Construções Geométricas 2013/2: Introdução à Criptografia Geometria Básica 2013/1: Teoria dos Números Geometria Analítica e Cálculo Vetorial Geometria Analítica Básica 2012/2: Geometria Analítica e Cálculo Vetorial - turma D1 Geometria Analítica e Cálculo Vetorial I - turma S1 2012/1: Geometria Analítica e Cálculo Vetorial - turma G1 Geometria Analítica e Cálculo Vetorial - turma H1 2011/2: Geometria Analítica e Cálculo Vetorial - turma C1 Geometria Analítica e Cálculo Vetorial I - turma G1 2011/1: Geometria Analítica e Cálculo Vetorial - turma C1 Geometria Analítica Básica - turma A1 2010/2: Tópicos em Computação I - turma A1 Introdução à Criptografia - turma M1 Geometria Analítica e Cálculo Vetorial - turma B1 Geometria Analítica e Cálculo Vetorial I - turma C1 2010/1: Geometria Analítica e Cálculo Vetorial - turma B1 Geometria Analítica e Cálculo Vetorial - turma E1 2009/2: Geometria Básica - turma A2 Geometria Analítica e Cálculo Vetorial - turma A1 2009/1: Geometria Analítica e Cálculo Vetorial - turma A1 Geometria Analítica e Cálculo Vetorial - turma B1 Introdução à Informática - turma D1 2008/2: Teoria dos Grafos e Aplicações - turma A1 Introdução à Informática Informática Básica 2008/1: Geometria Analítica Básica - turma A1 Introdução à Informática Informática Básica 2007/2: Teoria dos Número - turma A2 Introdução à Informática Informática Básica 2007/1: Geometria Analítica Básica - turma A1 Introdução à Informática Informática Básica 2002/2: Tópicos em Computação III - Introdução à Criptografia Cálculo Numérico 2002/1: Cálculo Numérico Programação de Computadores III 2001/2: Tópicos em Computação III - Introdução à Criptografia Introdução à Informática 2001/1: Cálculo Numérico Programação de Computadores III PesquisaPublicações Orientações (alunos) Currículo Lattes Grupo de Pesquisa Criptografia e Segurança da Informação Áreas de Interesse Computação Quântica Criptografia e Criptanálise Bioinformática Computação Reversível Matemática Discreta Teoria dos Grafos Computação & Música Teoria da Computação outros... Caso tenha interesse em orientação ou colaboração, entre em contato pessoalmente ou através deste formulário. Links úteis (UFF)Universidade Federal Fluminense (UFF) Instituto de Computação (IC) Plataforma EAD do CEAD Pós-graduação do IC-UFF Calendário Acadêmico UFF 2017 Calendário Administrativo UFF 2017 Banco de Ementas de Disciplinas (UFF) Endereço Profissional: Av. Gal. Milton Tavares de Souza, s/nº Prédio Administrativo do Instituto de Computação - sala 502 São Domingos - Niterói - RJ CEP: 24210-346 Copyright ©2017 - STI - Todos os direitos reservados Ir para o conteúdo",
  "content_length": 4438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:43"
}