{
  "name": "Luiz F. Bittencourt",
  "homepage": "http://www.ic.unicamp.br/~bit",
  "status": "success",
  "content": "Luiz Fernando Bittencourt - Institute of Computing - UNICAMP Luiz Fernando Bittencourt Associate Professor Research Director Institute of Computing University of Campinas Av. Albert Einstein, 1251 Cidade Universitaria 13083-852 - Campinas - SP - Brazil Office number: 10 Phone: +55 (19) 3521-2983 FAX: +55 (19) 3521-5847 I am currently an Associate Professor at the Institute of Computing - University of Campinas. My research interests are on aspects of distributed systems and computer networks, mainly in scheduling and resource allocation in grid/cloud/fog computing systems and their underlying network infrastructure. I am also interested in virtualization, future internet, green computing, and internet of things (IoT). After receiveing my Bachelor's degree in Computer Science from the Departament of Informatics at the Federal University of Parana, I have carried out research on workflow scheduling in grids and clouds during my Masters, Ph.D., and Post-doc at the Univesity of Campinas, as well as during my research period at the School of Computer Science - University of Manchester, UK. In 2016/2017, I did a post-doc at the Rutgers Discovery Informatics Institute - RDI2, at the The Rutgers Univeristy, USA, focusing on resource allocation for Fog Computing. (Clique para ver esta pagina em Portugues) Teaching: MO809 - Topics in Distributed Computing MC714 - Distributed Systems Interests: Grid, cloud, and fog computing Distributed and federated learning Scheduling on grids, clouds, and fogsWorkflow Virtualization Green Computing Future InternetInternet of Things (IoT) Quantum Computing (In portuguese) Courses (in Portuguese) Publications: Please visit my Google Scholar profile or my Curriculum Lattes for an updated publication list. Journal: BITTENCOURT, L. F.; DIAZ-MONTES, JAVIER ; RANA, O. F. ; BUYYA, R. ; PARASHAR, M. . Mobility-Aware Application Scheduling in Fog Computing. IEEE CLOUD COMPUTING, v. 4, p. 26-35, 2017. Bittencourt, Luiz F.; CALHEIROS, RODRIGO N. ; LEE, CRAIG . Middleware for Multicloud. IEEE CLOUD COMPUTING, v. 4, p. 22-25, 2017. GOMES, RAFAEL L. ; Bittencourt, Luiz F. ; MADEIRA, EDMUNDO R.M. ; CERQUEIRA, EDUARDO ; GERLA, MARIO . Two-criteria Pareto frontier for virtual network allocation on Edge-as-a-Service networks. COMPUTER COMMUNICATIONS, v. 102, p. 58-66, 2017. GOMES, R. L. ; BITTENCOURT, L. ; MADEIRA, E. ; CERQUEIRA, E. ; GERLA, M. . Management of virtual network resources for multimedia applications. MULTIMEDIA SYSTEMS (ONLINE), v. 23, p. 405-419, 2017. HIGASHINO, W. A. ; CAPRETZ, M. A. M. ; TOLEDO, M. B. F. ; BITTENCOURT, L. F. . A hybrid particle swarm optimisation-genetic algorithm applied to grid scheduling. International Journal of Grid and Utility Computing, v. 7, p. 113, 2016. GOMES, R. L. ; BITTENCOURT, L. F. ; MADEIRA, E. R. M. ; CERQUEIRA, E. C. ; GERLA, M. . Bandwidth-Aware Allocation of Resilient Virtual Software Defined Networks. Computer Networks (1999), v. 100, p. 179-194, 2016. GOMES, R. L. ; BITTENCOURT, L. F. ; MADEIRA, E. R. M. ; CERQUEIRA, E. C. ; GERLA, M. . A combined energy-bandwidth approach to allocate resilient virtual software defined networks. Journal of Network and Computer Applications, p. 98-106, 2016. GOMES, RAFAEL L. ; BITTENCOURT, L. F. ; MADEIRA, E. R. M. ; CERQUEIRA, E. C. ; GERLA, M. . Software Defined Management of Edge as a Service Networks. IEEE eTransactions on Network and Service Management, v. 13, p. 226-239, 2016. MENEGUETTE, R. I. ; ROCHA FILHO, G. P. ; BITTENCOURT, L. F. ; UEYAMA, J. ; VILLAS, L. A. . A Solution for Detection and Control For Congested Roads Using Vehicular Networks. Revista IEEE América Latina, v. 14, p. 1849-1855, 2016. ASSIS, M. R. M. ; BITTENCOURT, L. F. . A survey on cloud federation architectures: Identifying functional and non-functional properties. Journal of Network and Computer Applications, p. 51-71, 2016. HIGASHINO, W. A. ; EICHLER, C. ; CAPRETZ, M. A. M. ; BITTENCOURT, L. F. ; MONTEIL, T. . Attributed Graph Rewriting for Complex Event Processing Self-Management. ACM Transactions on Autonomous and Adaptive Systems, v. 11, p. 1-39, 2016. VIEIRA, C. C. A. ; BITTENCOURT, L. F. ; MADEIRA, E. R. M. . A Two-Dimensional SLA for Services Scheduling in Multiple IaaS Cloud Providers. International Journal of Distributed Systems and Technologies, v. 6, p. 45-64, 2015. HIGASHINO, W. A. ; CAPRETZ, M. A. M. ; BITTENCOURT, L. F. . CEPSim: Modelling and simulation of Complex Event Processing systems in cloud environments. Future Generation Computer Systems, v. online, p. 1-55, 2015. GOMES, DANIELO G. ; Bittencourt, Luiz Fernando ; TOLOSANA-CALASANZ, RAFAEL . Introduction to the Special Section on -Cloud computing: Current advances and new research trends-. Computers & Electrical Engineering, v. 47, p. 135-137, 2015. GENEZ, T. A. L. ; BITTENCOURT, L. F. ; FONSECA, N. L. S ; MADEIRA, E. R. M. . Estimation of the Available Bandwidth in Inter-Cloud Links for Task Scheduling in Hybrid Clouds. IEEE Transactions on Cloud Computing, p. 1-1, 2015. MARQUITTI, F. M. D. ; Guimarães, P.R. ; PIRES, M. M. ; BITTENCOURT, L. F. . MODULAR: Software for the Autonomous Computation of Modularity in Large Network Sets. Ecography, v. 37, n.3, p. 221-224, 2014. MENEGUETTE, R. I. ; BITTENCOURT, L. F. ; MADEIRA, E. R. M. . A seamless flow mobility management architecture for vehicular communication networks. Journal of Communications and Networks (Seoul. Print), v. 15, p. 207-216, 2013. [pdf] GENEZ, T. A. L. ; BITTENCOURT, L. F. ; MADEIRA, E. R. M. . Escalonamento de Workflows em Múltiplos Provedores de Nuvem usando Programação Linear. Revista Brasileira de Redes de Computadores e Sistemas Distribuídos, v. 1, p. 1-16, 2013.[pdf] BITTENCOURT, L. F. ; MADEIRA, E. R. M. . Scheduling in Hybrid Clouds (pre-print formatting). IEEE Communications Magazine ([pdf] - final version available at IEEEXplore http://dx.doi.org/10.1109/MCOM.2012.6295710) BITTENCOURT, L. F. ; MIYAZAWA, F. K. ; VIGNATTI, A. L. . Distributed Load Balancing Algorithms for Heterogeneous Players in Asynchronous Networks. Journal of Universal Computer Science (Print), v. 18, p. 2771-2797, 2012. ([pdf] - final version available at http://dx.doi.org/10.3217/jucs-018-20-2771) BITTENCOURT, L. F. ; MADEIRA, E. R. M. . HCOC: A Cost Optimization Algorithm for Workflow Scheduling in Hybrid Clouds (pre-print formatting). Journal of Internet Services and Applications, v. 2, p. 207-227, 2011. ([pdf] - final version available at springerlink DOI:10.1007/s13174-011-0032-0) SENNA, C. R. ; BITTENCOURT, L. F. ; MADEIRA, E. R. M. . Execution of service workflows in grid environments. International Journal of Communication Networks and Distributed Systems. v. 5, p. 88-108, 2010.[pdf] BITTENCOURT, L.F. ; MADEIRA, E. R. M. Towards the Scheduling of Multiple Workflows on Computational Grids. Journal of Grid Computing, Springer, 8(3):419-441, 2010.[pdf] BITTENCOURT, L. F. ; MADEIRA, E. R. M. . A performance oriented adaptive scheduler for dependent tasks on grids. Concurrency and Computation: Practice & Experience, John Wiley & Sons, 20(9):1029-1049, 2008.[pdf] Book Chapters Bittencourt, Luiz F.; Rana, Omer ; Petri, Ioan . Cloud Computing at the Edges. In: Markus Helfert; Víctor Méndez Muñoz; Donald Ferguson. (Org.). Communications in Computer and Information Science. 1ed.: Springer International Publishing, 2016, v. 581, p. 3-12. Assis, Marcio R. M. ; Bittencourt, Luiz Fernando ; TOLOSANA-CALASANZ, RAFAEL ; Lee, Craig A. . Cloud Federations:. In: Gabor Kecskemeti, Attila Kertesz, and Zsolt Nemeth. (Org.). Developing Interoperable and Federated Cloud Architecture. 1ed.Hershey: IGI Global, 2016, v. , p. 1-41. Bittencourt, Luiz F.; Madeira, Edmundo R. M. ; DA FONSECA, NELSON L. S. . Resource Management and Scheduling. In: Raouf Boutaba; Nelson L. S. Fonseca. (Org.). Cloud Services, Networking, and Management. 1ed.: John Wiley & Sons, Inc, 2015, v. , p. 243-267. Bittencourt, Luiz F. ; Madeira, Edmundo R. M. ; DA FONSECA, NELSON L. S. . Communication Aspects of Resource Management in Hybrid Clouds. In: Hussein T. Mouftah; Burak Kantarci. (Org.). Communication Infrastructures for Cloud Computing. 1ed.Hershey: IGI Global, 2013, v. 1, p. 409-433. Conference: Full GOMES, RAFAEL L. ; Bittencourt, Luiz F. ; Madeira, Edmundo R. M. ; CERQUEIRA, EDUARDO ; GERLA, MARIO . State-aware allocation of reliable Virtual Software Defined Networks based on bandwidth and energy. In: 2016 13th IEEE Annual Consumer Communications & Networking Conference (CCNC), 2016, Las Vegas. 2016 13th IEEE Annual Consumer Communications & Networking Conference (CCNC). p. 411. VIEIRA, C. C. A. ; BITTENCOURT, L. F. ; MADEIRA, E. R. M. . Um SLA 3D para o Escalonamento Multiusuário Sobre Múltiplos Provedores de IaaS. In: XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos, 2016, Salvador. XXXIV Simpósio Brasileiro de Redes de Computadores e Sistemas Distribuídos, 2016. GRANJA JR., E. O. ; BITTENCOURT, L. F. ; PETRI, I. ; RANA, O. F. ; MELO, C. A. V. . Managing QoS Constraints in a P2P-Cloud Video on Demand System. In: 9th IEEE International Conference on Cloud Computing (IEEE CLOUD), 2016, São Francisco. 9th IEEE International Conference on Cloud Computing, 2016. TOLOSANA-CALASANZ, RAFAEL ; DIAZ-MONTES, J. ; BITTENCOURT, L. F. ; RANA, O. F. ; PARASHAR, M. . Capacity Management for Streaming Applications over Cloud Infrastructures with Micro Billing Models. In: International Workshop on Clouds and (eScience) Applications Management, 2016, Shanghai. IEEE/ACM 9th International Conference on Utility and Cloud Computing, 2016. GENEZ, T. A. L. ; BITTENCOURT, L. F. ; Sakellariou, R. ; MADEIRA, E. R. M. . A Flexible Scheduler for Workflow Ensembles. In: IEEE/ACM 9th International Conference on Utility and Cloud Computing, 2016, Shanghai. IEEE/ACM 9th International Conference on Utility and Cloud Computing, 2016. GOMES, RAFAEL L. ; Bittencourt, Luiz F. ; Madeira, Edmundo R. M. ; CERQUEIRA, EDUARDO ; GERLA, MARIO . Energy-aware allocation of relia",
  "content_length": 24615,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:49"
}