{
  "name": "Luiz Satoru Ochi",
  "homepage": "http://www2.ic.uff.br/~satoru",
  "status": "success",
  "content": "Home | Luiz Satoru Ochi Luiz Satoru Ochi Professor Titular - IC/UFF Prof. Dr. Luiz Satoru Ochi Professor Titular do Instituto de Computação - IC/UFF & Coordenador do LabIC - Laboratório de Inteligência Computacional do IC-UFF Pesquisador-PQ com Bolsa de Produtividade do CNPq - Nível 1C, Comitê Ciência da Computação Veja Também o meu Google Scholar Prêmio & GRANT CIENTISTA DO ESTADO DO RIO DE JANEIRO - CNE pela FAPERJ desde 2008 até o momento!!!!. PRÊMIO DE EXCELÊNCIA CIENTÍFICA PELA UFF em 2020 - (honraria da área cientifica das Universidades oferecida anualmente a pesquisadores de maior destaque em pesquisas científicas), Instituto de Computação - O Programa de Pós-Graduação em Computação do IC-UFF é um dos 11 Programas de Excelência em Pós de Computação do Brasil - CAPES-2022 Venha conhecer e ser parceiro/colabordor do nosso Labs LABIC - LABORATÓRIO DE INTELIGENCIA COMPUTACIONAL DO IC UFF (Facebook) Universidade Federal Fluminense E-mail: satoru@ic.uff.br ou luiz.satoru@gmail.com Mais informações sobre Smart & Digital Cities?? clique AQUI!!!!!! Áreas de pesquisas do Prof. Luiz Satoru Ochi incluem: Inteligência Computacional - Inteligência Artificial, Smart & Digital Cities, Green Computing) - Otimização Combinatória - Otimização no setor de Petróleo & Gás - Pesquisa Operacional - Programação Matemática - Grafos e Algoritmos - Algoritmos Paralelos em Otimização - Resolução de Problemas Complexos via GPU (CUDA) - Problemas de Logística Inteligente & Tomada de Decisão - Mobilidade Urbana & Social - Segurança Pública - Defesa - Green Vehicle Routing and Scheduling - UAVs/Drones - Meio Ambiente - Sustentabilidade entre outros…. Voce está a procura de TEMAS ATUAIS para sua dissertação de mestrado ou tese de doutorado ou um Pós Doutorado?? Clique aqui para ver sugestões de pesquisas.",
  "content_length": 1809,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:51"
}