{
  "name": "Lujo Bauer",
  "homepage": "http://www.ece.cmu.edu/~lbauer",
  "status": "success",
  "content": "Lujo Bauer Home Teaching Research Students Publications Lujo Bauer [loo'yo] Professor, Electrical & Computer Engineering + Computer Science (Software and Societal Systems Department) Co-director, Future Enterprise Security Initiative (FutureEnterprise@CyLab) Coordinator, ECE and SCS undergraduate concentrations in security and privacy Director, minor in Information Security, Privacy and Policy Affiliated with: CyLab, Societal Computing Contact info Short bio Please consider submitting a paper or attending: IEEE S&P May 2026 USENIX Sec Aug 2025 Wordle representation of paper titles. Teaching Fall 2024: Privacy Policy, Law, and Technology (17-333 / 17-733 / 19-608 / 95-818) Fall 2023: Privacy Policy, Law, and Technology (17-333 / 17-733 / 19-608 / 95-818) Spring 2023: Introduction to Computer Security (15-330 / 18-330) Fall 2022: Privacy Policy, Law, and Technology (17-333 / 17-733 / 19-608 / 95-818) Previous... Spring 2022: Introduction to Computer Security (15-330 / 18-330) Fall 2021: Privacy Policy, Law, and Technology (17-333 / 17-733 / 19-608 / 95-818) Spring 2021: Introduction to Computer Security (15-330 / 18-330) Fall 2020: Privacy Policy, Law, and Technology (17-333 / 17-733 / 19-608 / 95-818) Spring 2020: Introduction to Computer Security (15-330 / 18-330) Fall 2019: Privacy Policy, Law, and Technology (17-333 / 17-733 / 19-608 / 95-818) (previously 8-533 / 8-733) Spring 2019: Secure Software Systems (18-335 / 18-732) Fall 2018: Privacy Policy, Law, and Technology (17-333 / 17-733 / 19-608 / 95-818) (previously 8-533 / 8-733) Spring 2018: Secure Software Systems (18-732) Fall 2017: Privacy Policy, Law, and Technology (8-533 / 8-733 / 19-608 / 95-818) Spring 2017: Secure Software Systems (18-732) Fall 2016: Privacy Policy, Law, and Technology (8-533 / 8-733 / 19-608 / 95-818) Spring 2016: Usable Privacy and Security (05-436 / 05-836 / 08-534 / 08-734 / 19-534 / 19-734) Spring 2016: Secure Software Systems (18-732) Fall 2015: Introduction to Computer Security (18-730) Fall 2015: Information Security & Privacy (15-421 / 08-731 / 08-761 / 45-885 / 45-985) Spring 2015: Secure Software Systems (18-732) Fall 2014: Information Security and Privacy (08-731 / 15-421 / 08-761 / 45-885 / 45-985) Spring 2014: Secure Software Systems (18-732) Spring 2013: Secure Software Systems (18-732) Fall 2011: Intro to Computer & Network Security & Applied Cryptography (18-487) Fall 2010: Secure Software Systems (18-732) Fall 2009: Introduction to Security and Policy (18-630 / 19-631 / 95-830) Fall 2008: Secure Software Systems (18-732) Fall 2007: Introduction to Computer Security (18-730) Research I do research on many aspects of computer security and privacy. I'm particularly interested in usable security and privacy, adversarial machine learning, the security of smarthomes, the risks of online tracking, and user authentication. Here are some topics that I currently research: Adversarial ML: Machine learning (ML) algorithms are becoming ubiquitous; they're used in applications from playing chess and predicting the weather to cancer diagnosis and self-driving cars. Our research attempts to discover how robust ML algorithms are in the face of an adversary. Specifically, we study whether an adversary can fool ML classifiers in practical settings without arousing the suspicion of a human. For instance, we showed that it is possible to 3d print a pair of eyeglasses that, when worn by an adversary, can cause a state-of-the-art face-recognition algorithm to identify the adversary as (a specific) someone else. We leverage what we learn of ML algorithms' weaknesses to design ML algorithms that are more resistant to attack. Publications Training robust ML-based raw-binary malware detectors in hours, not months.   [PDF, BibTeX, ]Keane Lucas, Weiran Lin, Lujo Bauer, Michael K. Reiter, and Mahmood Sharif. In Proceedings of the 31st ACM SIGSAC Conference on Computer and Communications Security, October 2024. © authors  DOI:10.1145/3658644.3690208 Group-based robustness: A general framework for customized robustness in the real world.   [PDF, BibTeX, talk video, ]Weiran Lin, Keane Lucas, Neo Eyal, Lujo Bauer, Michael K. Reiter, and Mahmood Sharif. In Proceedings of the 31st Network and Distributed System Security Symposium, February 2024. Internet Society. © authors  DOI:10.14722/ndss.2024.24084 Adversarial training for raw-binary malware classifiers.   [PDF, BibTeX, talk video and slides, ]Keane Lucas, Samruddhi Pai, Weiran Lin, Lujo Bauer, Michael K. Reiter, and Mahmood Sharif. In Proceedings of the 32nd USENIX Security Symposium, August 2023. USENIX. Constrained Gradient Descent: a powerful and principled evasion attack against neural networks.   [PDF, BibTeX, talk video, talk slides, ]Weiran Lin, Keane Lucas, Lujo Bauer, Michael K. Reiter, and Mahmood Sharif. In Proceedings of the 39th International Conference on Machine Learning, ICML 2022, July 2022. Malware makeover: breaking ML-based static analysis by modifying executable bytes.   [PDF, BibTeX, slides, talk video, code, ]Keane Lucas, Mahmood Sharif, Lujo Bauer, Michael K. Reiter, and Saurabh Shintre. In Proceedings of the ACM Asia Conference on Computer and Communications Security, June 2021. © authors  DOI:10.1145/3433210.3453086 n-ML: Mitigating adversarial examples via ensembles of topologically manipulated classifiers.   [PDF, BibTeX, project page, ]Mahmood Sharif, Lujo Bauer, and Michael K. Reiter. arXiv preprint 1912.09059, December 2019. Optimization-guided binary diversification to mislead neural networks for malware detection.   [PDF, BibTeX, project page, ]Mahmood Sharif, Keane Lucas, Lujo Bauer, Michael K. Reiter, and Saurabh Shintre. arXiv preprint 1912.09064, December 2019. A general framework for adversarial examples with objectives.   [PDF, BibTeX, project page, ]Mahmood Sharif, Sruti Bhagavatula, Lujo Bauer, and Michael K. Reiter. ACM Transactions on Privacy and Security, 22 (3). June 2019. (Revised version of arXiv preprint 1801.00349.) © authors  DOI:10.1145/3317611 On the suitability of Lp-norms for creating and preventing adversarial examples.   [PDF, BibTeX, project page, ]Mahmood Sharif, Lujo Bauer, and Michael K. Reiter. In Proceedings of The Bright and Dark Sides of Computer Vision: Challenges and Opportunities for Privacy and Security (in conjunction with the 2018 IEEE Conference on Computer Vision and Pattern Recognition), June 2018. © IEEE Adversarial Generative Nets: Neural network attacks on state-of-the-art face recognition.   [PDF, BibTeX, project page, ]Mahmood Sharif, Sruti Bhagavatula, Lujo Bauer, and Michael K. Reiter. arXiv preprint 1801.00349, December 2017. Accessorize to a crime: Real and stealthy attacks on state-of-the-art face recognition.   [PDF, BibTeX, talk video, project page, ]Mahmood Sharif, Sruti Bhagavatula, Lujo Bauer, and Michael K. Reiter. In Proceedings of the 23rd ACM SIGSAC Conference on Computer and Communications Security, October 2016.  DOI:10.1145/2976749.2978392 Secure digital home / access control for non-security-experts: This collection of projects explores architectures, mechanisms, and interfaces for helping users manage access control in the digital home of the future and on online social networks. Recent research includes new methods to discover smart-home configurations that may leak information, new ways to specify access-control policies (e.g., reactively, and via metadata-based policy rules), and using machine learning to help users specify security policies and privacy preferences. Publications Towards usable security analysis tools for trigger-action programming.   [PDF, BibTeX, talk video and slides, ]McKenna McCall, Eric Zeng, Faysal Hossain Shezan, Mitchell Yang, Lujo Bauer, Abhishek Bichhawat, Camille Cobb, Limin Jia, and Yuan Tian. In SOUPS '23: Proceedings of the 19th Symposium on Usable Privacy and Security, August 2023. USENIX. © authors “I would have to evaluate their objections”: Privacy tensions between smart home device owners and incidental users.   [PDF, BibTeX, talk video, ]Camille Cobb, Sruti Bhagavatula, Kalil Anderson Garrett, Alison Hoffman, Varun Rao, and Lujo Bauer. Proceedings on Privacy Enhancing Technologies, 2021 (4). October 2021. De Gruyter Open. © authors  DOI:10.2478/popets-2021-0060 How risky are real users' IFTTT applets?   [PDF, BibTeX, 5-min talk (+ slides), 14-min talk, ]Camille Cobb, Milijana Surbatovich, Anna Kawakami, Mahmood Sharif, Lujo Bauer, Anupam Das, and Limin Jia. In SOUPS '20: Proceedings of the 16th Symposium on Usable Privacy and Security, August 2020. © authors Some recipes can do more than spoil your appetite: Analyzing the security and privacy risks of IFTTT recipes.   [PDF, BibTeX, video from PrivacyCon, ]Milijana Surbatovich, Jassim Aljuraidan, Lujo Bauer, Anupam Das, and Limin Jia. In Proceedings of the 26th International World Wide Web Conference, April 2017. © IW3C2, CC BY 4.0  DOI:10.1145/3038912.3052709 (Do not) Track me sometimes: Users' contextual preferences for web tracking.   [PDF, BibTeX, slides, talk video, ]William Melicher, Mahmood Sharif, Joshua Tan, Lujo Bauer, Mihai Christodorescu, and Pedro Giovanni Leon. Proceedings on Privacy Enhancing Technologies (2). April 2016. De Gruyter Open. © authors  DOI:10.1515/popets-2016-0009 Sharing personal content online: exploring channel choice and multi-channel behaviors.   [PDF, BibTeX, video teaser, ]Manya Sleeper, William Melicher, Hana Habib, Lujo Bauer, Lorrie Faith Cranor, and Michelle L. Mazurek. In CHI'16: 34th Annual ACM Conference on Human Factors in Computing Systems, May 2016. ACM. © authors  DOI:10.1145/2858036.2858170 Toward strong, usable access control for shared distributed data.   [PDF, BibTeX, talk video, ]Michelle L. Mazurek, Yuan Liang, William Melicher, Manya Sleeper, Lujo Bauer, Gregory R. Ganger, Nitin Gupta, and Michael K. Reiter. In Proceedings of the 12th USENIX Conference on File and Storage Technologies (FAST '14), February 2014. USENIX. Challenges faced in working with use",
  "content_length": 32212,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:58"
}