{
  "name": "Lukasz A. Kurgan",
  "homepage": "http://biomine.cs.vcu.edu",
  "status": "success",
  "content": "(un)Structural Bioinformatics Lab - Virginia Commonwealth University Our migration to a new website platform is causing potential disruptions to services, and some information may be temporarily unavailable. We are actively working to resolve this. If you require immediate assistance, please reach out to Dr. Kurgan for support. Close Access Granted Your IP address is present on allow list, granting you access for the next 72 hours at minimum. After this period, your access may automatically expire. If you need to extend your access, please reapply. Thank you. Major News Our disorder predictors, flDPnn and flDPnn2, secured top results in the CAID1 experiment (DisProt dataset; results were published in Nature Methods) and the CAID2 experiment (Disorder-NOX dataset; results were published in Proteins journal). These accoplishements were highlighted in a commentary article in Nature Methods and press release. Our (un)structural bioinformatics lab focuses on: Structure and function prediction and modeling of proteins and small RNAs Discovery and characterization of sequence-structure/intrinsic disorder-function relationships in proteins Binding of small ligands (including drugs), proteins, RNAs and DNA to proteins Prediction and functional characterization of intrinsic disorder in proteins Target selection methods for structural genomics Our overarching aim is to improve understanding of life at the molecular level by discovering relations between sequences, structures and functions of biological macromolecules. We design and use in-silico approaches to search for patterns, generate accurate high-throughput predictive models, and interpret information encoded in proteins and small RNAs. Our research spans a wide spectrum of scales, from individual molecules to projects that span thousands of proteomes/genomes, and relies on cutting-edge advances in machine learning and data science. Our recently published models and databases include: flDPnn2 - CAID-winning webserver for accurate prediction of intrinsic disorder DescribePROT - database of amino acid-level structure and function predictions DEPICTER2 - webserver that predicts disorder and several disorder functions CONNECTOR - webserver that predicts protein-drug interactions View a full list of our webservers » “The most exciting phrase to hear in science, one that heralds the most discoveries, is not Eureka! but That's funny…” — Isaac Asimov (1920-1992)",
  "content_length": 2442,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:53"
}