{
  "name": "Lukasz Golab",
  "homepage": "https://www.engineering.uwaterloo.ca/~lgolab",
  "status": "success",
  "content": "Lukasz Golab Lukasz Golab Professor Department of Management Science and Engineering David R. Cheriton School of Computer Science (cross-appointed) University of Waterloo Email: lgolab at uwaterloo dot ca Bio: I obtained a BSc in Computer Science from the University of Toronto in 2001 (with High Distinction) and a PhD in Computer Science from the University of Waterloo in 2006 (with Alumni Gold Medal). From 2006 to 2011 I was a Senior Member of Research Staff at AT&T Labs. I joined Waterloo in 2011 and held the title of Canada Research Chair from 2014 to 2024. My long-term research agenda of Data for Good calls for building data-centric systems with societal impact. Recent projects focus on improving the performance and scalability of systems for managing high-speed data events such as blockchains and data stream systems; understanding models and the data they learn from, toward explainable AI; and data science applications such as wellness, work-integrated-learning, and sustainability. Selected projects and publications (see here for DBLP profile) 1. Explainable AI (explaining model outputs / explaining model biases / explaining the impact of training data) A. Falahati, M. Amiri, K. Larson, L. Golab, The Alignment Game: A Theory of Long-Horizon Alignment through Recursive Curation, AAAI 2026 P. Godfrey, L. Golab, D. Srivastava, J. Szlichta, Model Slicing for Responsible AI, Guide-AI workshop at VLDB 2025, 2:1-2:5 J. Rorseth, P. Godfrey, L. Golab, D. Srivastava, J. Szlichta, LADYBUG: an LLM Agent DeBUGger for data-driven applications, EDBT 2025, 1082-1085, demo paper M. Shirdel, J. Rorseth, P. Godfrey, L. Golab, D. Srivastava, J. Szlichta, ApresCoT: Explaining LLM Answers with Knowledge Graphs and Chain of Thought, EDBT 2025, 1142-1145, demo paper. A. Avksientieva, P. Godfrey, L. Golab, D. Srivastava, J. Szlichta, REACT: REcourse Analysis with Counterfactuals and Explanation Tables, EDBT 2025, 1098-1101, demo paper. Best Demo Award K. Golzadeh, L. Golab, J. Szlichta, Explaining Expert Search and Team Formation Systems with ExES, ICDE 2025, 224-237. Tech report here J. Rorseth, P. Godfrey, L. Golab, D. Srivastava, J. Szlichta, RAGE Against the Machine: Retrieval-Augmented LLM Explanations, ICDE 2024, 5469-5472, demo paper. Tech report here A. Yu, P. Godfrey, L. Golab, D. Srivastava, J. Szlichta, CAMO: Explaining Consensus Across MOdels, ICDE 2024, 5493-5496, demo paper A. Esmaeilizadeh, L. Golab, K. Taghva, InfoMoD: Information-theoretic Model Diagnostics, SSDBM 2023, 19:1-19:4. Best Short Paper Award V. Dadvar, L. Golab, D. Srivastava, POEM: Pattern-Oriented Explanations of Convolutional Neural Networks, PVLDB 16(11):3192-3200, 2023. Demo paper @ VLDB 2022 here A. Chai, A. Vezvaei, L. Golab, M. Kargar, D. Srivastava, J. Szlichta, M. Zihayat, EAGER: Explainable Question Answering Using Knowledge Graphs, GRADES-NDA@SIGMOD 2023, 4:1-4:5 J. Rorseth, P. Godfrey, L. Golab, M. Kargar, D. Srivastava, J. Szlichta, CREDENCE: Counterfactual Explanations for Document Ranking, ICDE 2023, 3631-3634, demo paper. Tech report here 2. Bringing order to data (pattern discovery / data cleaning) R. Karegar, M. Mirsafian, P. Godfrey, L. Golab, M. Kargar, D. Srivastava, J. Szlichta, Discovering Domain Orders via Order Dependencies, ICDE 2022, 1098-1110. Tech report here Z. Zheng, L. Zheng, M. Alipourlangouri, F. Chiang, L. Golab, J. Szlichta, S. Baskaran, Contextual Data Cleaning with Ontology Functional Dependencies, J. of Data and Inf. Quality, 14(3):20:1-20:26, 2022. Tech report here V. Dadvar, L. Golab, D. Srivastava, Exploring Data Using Patterns: A Survey, Information Systems 108, September 2022, 101985. Preprint here R. Karegar, P. Godfrey, L. Golab, M. Kargar, D. Srivastava, J. Szlichta, Efficient Discovery of Approximate Order Dependencies, EDBT 2021, 427-432. Tech report with proofs here H. Saxena, L. Golab, I. Ilyas, Distributed Implementations of Dependency Discovery Algorithms, PVLDB 12(11): 1624-1636, 2019 Z. Abedjan, L. Golab, F. Naumann, T. Papenbrock, Data Profiling, Morgan & Claypool Publishers, 2018 K. El Gebaly, G. Feng, L. Golab, F. Korn, D. Srivastava, Explanation Tables, IEEE Data Engineering Bulletin, 41(3):43-51, 2018 3. NLP (entity linking / hate speech detection / sentence simplification / text mining) K. Carbone, L. Hebert, R. Cohen, L. Golab, Visual Medical Entity Linking with VELCRO, ML4H 2025 L. Hebert, G. Sahu, Y. Guo, N. K. Sreenivas, L. Golab, R. Cohen, Multi-Modal Discussion Transformer: Integrating Text, Images and Graph Transformers to Detect Hate Speech on Social Media, AAAI 2024, 22096-22104 L. Hebert, L. Golab, R. Cohen, Predicting Hateful Discussions on Reddit using Graph Transformer Networks and Communal Context, WI-IAT 2022, 9-17. Tech report here M. Dehghan, D. Kumar, L. Golab, GRS: Combining Generation and Revision in Unsupervised Sentence Simplification, ACL Findings, 2022, 949-960 D. Kumar, L. Mou, L. Golab, O. Vechtomova, Iterative edit-based unsupervised sentence simplification, ACL 2020, 7918-7928 S. Bryson, H. Davoudi, L. Golab, M. Kargar, Y. Lytvyn, P. Mierzejewski, J. Szlichta, M. Zihayat, Robust Keyword Search in Large Attributed Graphs, Information Retrieval 23:502-524, 2020 L. Chen, L. Golab, Micro-Journal Mining to Understand Mood Triggers, Computing 102(5):1227-1244 (2020). Preprint here 4. Decentralized and high-speed data systems (blockchains / real-time analytics) H. Saxena, L. Golab, S. Idreos, I. Ilyas, Real-Time LSM-Trees for HTAP Workloads, ICDE 2023, 1208-1220. Tech report here L. Hebert, L. Golab, P. Poupart, R. Cohen, FedFormer: Contextual Federation with Attention in Reinforcement Learning, AAMAS 2023, 810-818. Tech report here A. Mitra, C. Gorenflo, L. Golab, S. Keshav, TimeFabric: Trusted Time for Hyperledger Fabric, FAB 2021, 4:1-4:15 R. Agarwal, D. Kumar, L. Golab, S. Keshav, Consentio: Managing Consent to Data Access using Permissioned Blockchains, ICBC 2020 C. Gorenflo, L. Golab, S. Keshav, XOX Fabric: A Hybrid Approach to Transaction Execution, ICBC 2020 C. Gorenflo, S. Lee, L. Golab, S. Keshav, FastFabric: Scaling Hyperledger Fabric to 20,000 Transactions per Second, Int. J. of Network Management 30(5): e2099, September/October 2020. Tech report here Y. Yang, L. Golab, M. T. Ozsu, ViewDF: Declarative Incremental View Maintenance for Streaming Data, Information Systems 71 (2017) 55-67. Preprint here 5. Educational data mining V. Salm, S. Chopra, L. Golab, Student success in co-operative education: A comparison of remote and in-person workplace performance evaluations, Int. J. of Work Integrated Learning 24(2):169-207, 2023 M. S. Parsa, L. Golab, Social Media Mining to Understand the Impact of Co-operative Education on Mental Health, Int. J. of Work-Integrated Learning 22(4):521-537, 2021 S. Chopra, A. Khan, M. Mirsafian, L. Golab, Gender differences in work-integrated learning experiences of STEM students: From applications to evaluations, Int. J. of Work-Integrated Learning 21(3):253-274, 2020 S. Chopra, H. Gautreau, A. Khan, M. Mirsafian, L. Golab, Gender Differences in Undergraduate Engineering Applicants: A Text Mining Approach, EDM 2018, 44-54 A. Andrade, S. Chopra, B. Nurlybayev, L. Golab, Quantifying the Impact of Entrepreneurship on Cooperative Job Creation, Int. J. of Work Integrated Learning 19(1): 51-68, 2018 6. Data analytics for sustainability S. Ghasemitaheri, A. Holcomb, L. Golab, S. Keshav, On the Data Quality of Remotely Sensed Forest Maps, QDB workshop@VLDB 2023, 3:1-3:8 M. S. Parsa, L. Golab, S. Keshav, Climate Action During COVID-19 Recovery and Beyond: A Twitter Text Mining Study, SBP-BRiMS 2021. Tech report here G. Tang, S. Keshav, L. Golab, K. Wu, Bikeshare Pool Sizing for Bike-And-Ride Multimodal Transit, Trans. on Intelligent Transportation Systems 19(7): 2279-2289, 2018. Preprint here C. Gorenflo, I. Rios, L. Golab, S. Keshav, Usage Patterns of Electric Bicycles: An Analysis of the WeBike Project, J. of Advanced Transportation 2017, Article ID 3739505 R. Miller, L. Golab, C. Rosenberg, Modelling Weather Effects for Impact Analysis of Residential Time-of-Use Electricity Pricing, Energy Policy 105 (2017) 534-546. Preprint here X. Liu, L. Golab, W. Golab, I. Ilyas, S. Jin, Smart Meter Data Analytics: Systems, Algorithms and Benchmarking, TODS 42(1): 2:1-2:39, 2017. Preprint here Y. Jiang, R. Levman, L. Golab, J. Nathwani, Analyzing the Impact of the 5CP Ontario Peak Reduction Program on Large Consumers, Energy Policy 93 (2016) 96-100. Preprint here",
  "content_length": 8484,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:52"
}