{
  "name": "Lung-Pan Cheng",
  "homepage": "https://www.lungpancheng.tw",
  "status": "success",
  "content": "Lung-Pan ChengLung-Pan ChengAssociate ProfessorComputer Science and Information EngineeringNational Taiwan UniversityMISSION & VISIONEvery person exists in three types of reality. First, people live in a physical reality where things follow the common laws of physics. Second, people have their individual imagined realities where things act as wishes. Third, using computer technologies, people can create virtual realities in which the existence and behavior of people's representations and objects is programmed and can follow arbitrary rules, defined entirely by people and not by the boundaries of physics. These three realities are highly correlated but not necessarily the same. By exploring the mismatch between these three realities, we see new concepts, new techniques, and new devices emerging, interfacing and extending these three instantiations of a reality towards one ultimate reality where creation, abstraction and embodiment are met.Featured PublicationsDaniel Ashbrook, Wei-Ju Lin, Nicholas Bentley, Diana Soponar, Zeyu Yan, Valkyrie Savage, Lung-Pan Cheng, Huaishu Peng, Hyunyoung KimOctober 2024 Proceedings of the 37th Annual ACM Symposium on User Interface Software and TechnologyRhapso: Automatically Embedding Fiber Materials into 3D Prints for Enhanced InteractivityIn UIST ‘24PDF Cite Video DOI GitHubLung-Pan Cheng, Yi Chen, Yi-Hao Peng, Christian HolzApril 2023 Proceedings of the 2023 CHI Conference on Human Factors in Computing SystemsReality Rifts: Wonder-ful Interfaces by Disrupting Perceptual CausalityIn CHI ‘23PDF Cite Video DOI TalkPublicationsBetterMinton Service: Analyzing the Badminton Service using Open Kinetic ChainIn TAICHI ‘23Eden Cong-He Xu, Lung-Pan ChengPDFFeltingReel: Density Varying Soft Fabrication with Reeling and FeltingIn TAICHI ‘23Ping-Yi Wang, Lung-Pan ChengPDF VideoPolagons: Designing and Fabricating Polarized Light Mosaics with User-Defined Color-Changing BehaviorsIn CHI ‘23Ticha Sethapakdi, Laura Huang, Vivian Chan, Lung-Pan Cheng, Fernando Dall'Agnol, Mackenzie Leake, Stefanie MuellerPDF Cite Video DOI Talk MIT NewsFlaticulation: Laser Cutting Joints with Articulated AnglesIn UIST ‘22Chiao Fang, Vivian Hsinyueh Chan, Lung-Pan ChengPDF Cite Video DOI Talk GitHubGarnish into Thin AirIn UIST ‘22 SIC People’s Choice Award 🏆Ching-Yi Tsai, Chen-Kuo Sun, Lung-Pan ChengPDF Cite Video DOIAirRacket: Perceptual Design of Ungrounded, Directional Force Feedback to Improve Virtual Racket Sports ExperiencesIn CHI ‘22 Best Paper Award 🏆Ching-Yi Tsai, I-Lun Tsai, Chao-Jung Lai, Derrek Chow, Lauren Wei, Lung-Pan Cheng, Mike Y. ChenPDF Cite Video DOI Talk New Scientist GitHubGame Illusionization: A Workflow for Applying Optical Illusions to Video GamesIn UIST ‘21Po-Yao (Cosmos) Wang, Cong-He Xu, Ping-Yi Wang, Hsin-Yu Huang, Yu-Wei Chang, Jen-Hao Cheng, Yu-Hsin Lin, Lung-Pan ChengPDF Cite Video DOI TalkPneuSeries: 3D Shape Forming with Modularized Serial-Connected InflatablesIn UIST ‘21Yu-Wen Chen, Wei-Ju Lin, Yi Chen, Lung-Pan ChengPDF Cite Video DOI TalkTexelBlocks: Dynamic Surfaces for Physical InteractionsIn CHI ‘21 LBWVivian Hsinyueh Chan, Yu-Chen Chan, Pin-Hsuan Peng, Lung-Pan ChengPDF Cite Video DOI TalkImpossible Staircase: Vertically Real Walking in an Infinite Virtual TowerIn IEEE VR ‘21Jen-Hao Cheng, Yi Chen, Ting-Yi Chang, Hsu-En Lin, Po-Yao (Cosmos) Wang, Lung-Pan ChengPDF Cite Video DOI TalkStrengthGaming: Enabling Dynamic Repetition Tempo in Strength Training-based Exergame DesignIn MobileHCI ‘20Sih-Pin Lai, Cheng-An Hsieh, Yu-Hsin Lin, Teepob Harutaipree, Shih-Chin Lin, Yi-Hao Peng, Lung-Pan Cheng, Mike Y. ChenPDF Cite DOI TalkHaptic-go-round: A Surrounding Platform for Encounter-type Haptics in Virtual Reality ExperiencesIn CHI ‘20Hsin-Yu Huang, Chih-Wei Ning, Po-Yao Wang, Jen-Hao Cheng, Lung-Pan ChengPDF Cite Video DOI TalkVRoamer: Generating On-The-Fly VR Experiences While Walking inside Large, Unknown Real-World Building EnvironmentsIn IEEE VR ‘19Lung-Pan Cheng, Eyal Ofek, Christian Holz, Andrew D. WilsonPDF Cite Video DOIiTurk: Turning Passive Haptics into Active Haptics by Making Users Reconfigure Props in Virtual RealityIn CHI ‘18Lung-Pan Cheng, Li Chang, Sebastian Marwecki, Patrick BaudischPDF Cite Video DOIVirtualSpace - Overloading Physical Space with Multiple Virtual Reality UsersIn CHI ‘18Sebastian Marwecki, Maximilian Brehm, Lukas Wagner, Lung-Pan Cheng, Florian 'Floyd' Mueller, Patrick BaudischPDF Cite Video DOI TalkMutual Human ActuationIn UIST ‘17Lung-Pan Cheng, Sebastian Marwecki, Patrick BaudischPDF Cite Video DOI TalkProviding Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle StimulationIn CHI ‘17Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, Patrick BaudischPDF Cite Video DOISparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive PropIn CHI ‘17Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, Andrew D. WilsonPDF Cite Video DOI TalkTurkDeck: Physical Virtual Reality Based on PeopleIn UIST ‘15Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, Patrick BaudischPDF Cite Video DOI TalkLevel-Ups: Motorized Stilts that Simulate Stair Steps in Virtual RealityIn CHI ‘15Dominik Schmidt, Rob Kovacs, Vikram Mehta, Udayan Umapathi, Sven Köhler, Lung-Pan Cheng, Patrick BaudischPDF Cite Video DOI TalkHaptic Turk: a Motion Platform based on PeopleIn CHI ‘14Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, Patrick BaudischPDF Cite Video DOIiGrasp: Grasp-Based Adaptive Keyboard for Mobile DevicesIn CHI ‘13Lung-Pan Cheng, Hsiang-Sheng Liang, Che-Yang Wu, Mike Y. ChenPDF Cite Video DOIiRotateGrasp: Automatic Screen Rotation based on Grasp of Mobile DevicesIn CHI ‘13Lung-Pan Cheng, Meng Han Lee, Che-Yang Wu, Fang-I Hsiao, Yen-Ting Liu, Hsiang-Sheng Liang, Yi-Ching Chiu, Ming-Sui Lee, Mike Y. ChenPDF Cite Video DOIiRotate: Automatic Screen Rotation based on Face OrientationIn CHI ‘12Lung-Pan Cheng, Fang-I Hsiao, Yen-Ting Liu, Mike Y. ChenPDF Cite Video DOITUIC: Enabling Tangible Interaction on Capacitive Multi-Touch DisplaysIn CHI ‘11Neng-Hao Yu, Li-Wei Chan, Seng Yong Lau, Sung-Sheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Fang-I Hsiao, Lung-Pan Cheng, Mike Chen, Polly Huang, Yi-Ping HungPDF Cite Video DOICite × Copy Download",
  "content_length": 6329,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:54"
}