{
  "name": "Luoyi Fu",
  "homepage": "http://www.cs.sjtu.edu.cn/~fu-ly/index.html",
  "status": "success",
  "content": "Luoyi Fu å æ´ä¼       LuoYi Fu Personal Information Associate Professor Department of Computer Science and Engineering Shanghai Jiao Tong University 1-428 SEIEE Building 800 Dongchuan Road Shanghai 200240, P. R. China Email yiluofu@sjtu.edu.cn fu-ly@cs.sjtu.edu.cn Homepage http://www.cs.sjtu.edu.cn/~fu-ly/index.html Acemap https://www.acemap.info/ Research Interest: data-driven IoT, social networking, data mining & engineering, fundamental limits. Click here to learn more about my recent research projects. Learn more about our AceKG Welcome to try our Internet of Papers (IoP) Welcome to try our DeepReport Teaching: Mobile Internet: [Website] [Material] è¯¾ä»¶ppt: é¾æ¥ æåç : rbep å®éªæå: é¾æ¥ æåç : ezja ä½ä¸åå ¶ä»èµæº: é¾æ¥ æåç : mn9a Book: ãIntroduction to Mobile Internetã has been published ! Third Edition Fourth Edition TMall: [BUY] JD: [BUY] DangDang: [BUY] Talks: (You are free to download and use for your own purposes) From IoT , IoD to IoI: They are All Graph of Things (GoT) [slides] Measuring and Analyzing Knowledge in Large Graph based Methodologies-A Case Study in Internet of Papers (IOP) [slides] Quantifying and Analyzing Knowledge: A Structurized Perspective [slides] Graph Matching Related Network De-anonymization [slides] Finding Connections in Uncertain Networks/Graphs [slides] A Brief Look into The Classic Works of Mobile Internet in Early Years [slides] Most Widely Used Math Tools in Network Analysis [slides] News: Top 10 2019 NÂ²Women Rising Stars in Computer Networking and Communications Editor of IEEE/ACM Transactions on Networking Associate Editor of ACM Transactions on Sensor Networks Associate Editor of IEEE Transactions on Network Science and Engineering TPC of ACM Sigmetrics / Performance 2022, 2023 Guest Editor of Applied Science (Special Issue: Advances in AI-Driven Data Mining) 2022 Guest Editor of IEEE Open Journal of the Communications Society Area Editor of Computer Networks Editor of China Communications (ä¸­å½éä¿¡) Selected Articles of Recent Research Focuses: Graph Entropy and Its Application: [TIT] L. Fu, J. Tang, B. Miao, X. Lin and X. Wang, \"The Effect of Symmetry on the De-anonymizability of Social Networks\", to appear in IEEE Transactions on Information Theory, 2023. [PDF] [TON] L. Fu, J. Zhang, S. Qu, H. Kang, X. Wang and G. Chen, \"Measuring Social Network De-anonymizability by Means of Morphism Property\", to appear in IEEE Transactions on Networking, 2022. [PDF] [TIT] X. Liu ,L. Fu, X. Wang, C. Zhou, \"On the Similarity between von Neumann Graph Entropy and Structural Information: Interpretation, Computation, and Applications,\" in IEEE Transactions on Information Theory, 2022. [PDF] [WWW] X. Liu, L.Fu, X. Wang, \"Bridging the Gap between von Neumann Graph Entropy and Structural Information: Theory and Applications\", to appear in WWW, 2021. [PDF] [PLOS] L. Fu, D. Lu, Q. Li, X. Wang and C. Zhou, \"Can We 'Feel' the Temperature of Knowledge? Modelling Scientific Popularity Dynamics via Thermodynamics\", in PLOS ONE, 2020. [PDF] [CIKM] C. Deng, Y. Jia, H. Xu, C. Zhang, J. Tang, L. Fu, Weinan Zhang, Haisong Zhang, Xinbing Wang, Chenghu Zhou, \"GAKG: A Multimodal GeoScience Academic Knowledge Graph\" to appear in CIKM, 2021. [PDF] [Github] [INFOCOM] C. Zhang, Q. Guo, L. Fu, X. Gan and X. Wang \"ITE: A Structural Entropy Based Approach for Source Detection\", in IEEE INFOCOM 2021, Vancouver, May, 2021. [PDF] [INFOCOM] X. Liu, L. Fu, X. Wang and J. Hopcroft, \"ProHiCo: A Probabilistic Framework to Hide Communities in Large Networks\", in IEEE INFOCOM 2021, Vancouver, May, 2021. [PDF] Graph Matching Based Social Network De-anonymizing: [TON] L. Fu, J. Zhang, S. Wang, X. Wu, X. Wang and G. Chen, \"De-anonymizing Social Networks with Overlapping Community Structure\", to appear in IEEE/ACM Transactions on Networking, 2019. [PDF] [INFOCOM] J. Zhang, L. Fu, X. Wang and G. Chen, \"De-anonymizing Social Networks Under Partial Overlap: An F-score Based Approach\", in IEEE INFOCOM 2021, Vancouver, May, 2021. [PDF] [MOBIHOC] B. Miao, S. Wang, L. Fu and X. Lin, \"De-anonymizability of Social Network: Through the Lens of Symmetry\", to appear in ACM MobiHoc, 2020. [PDF] Other Selected Articles: [TON] L. Fu, J. Xu, S. Qu, Z. Xu, X. Wang, G. Chen, Seeking the Truth in a Decentralized Manner, IEEE/ACM Transactions on Networking , 2021, 29(5): 2296-2312. [PDF] [TON]L. Fu, Jiapeng Zhang, Shuaiqi Wang, Xinyu Wu, Xinbing Wang, Guihai Chen, De-anonymizing Social Networks with Overlapping Community Structure, IEEE/ACM Transactions on Networking, 2020, 28(1): 360-375. [PDF] [TON] L. Fu, S. Ma, L. Kong, S. Shi, X. Wang, \"FINE: A Framework for Distributed Learning on Incomplete Observations for Heterogeneous Crowdsensing Networks\", to appear in IEEE/ACM Transactions on Networking, 2018. [PDF] [TON] L. Fu, X. Fu, Z. Zhang, Z. Xu, X. Wu, X. Wang and S. Lu, \"Joint Optimization of Multicast Energy in Delay-constrained Mobile Wireless Networks\", to appear in IEEE/ACM Transactions on Networking, 2018. [PDF] [TON] L. Fu, X. Fu, Z. Xu, Q. Peng, X. Wang and S. Lu, \"Determining Source-Destination Connectivity in Uncertain Networks: Modeling and Solutions,\" to appear in IEEE/ACM Transactions on Networking, 2017. [PDF] [Code on ANAP] [TON] L. Fu, Xinbing Wang, PR Kumar , Are We Connected? Optimal Determination of Source-Destination Connectivity in Random Networks, IEEE/ACM Transactions on Networking, 2017, 25(2): 751-764. [PDF] [TON] Xu Li, Feilong Tang, Yanmin Zhu, L. Fu, Jiadi Yu, Long Chen, Jiacheng Liu , Processing-while-Transmitting: Cost-Minimized Transmission in SDN-Based STINs, IEEE/ACM Transactions on Networking, 2021, DOI: 10.1109/TNET.2021.3107413, 2021. [PDF] [TON] Jiaqi Liu, L. Fu, Yuhang Yao, Xinzhe Fu, Xinbing Wang, Guihai Chen , Modeling, Analysis and Validation of Evolving Networks With Hybrid Interactions, IEEE/ACM Transactions on Networking, 2019, 27(1): 126-142. [PDF] [TON] X. Wu, L. Fu,Y. Yao, X. Fu, X. Wang and G. Chen, \"GLP: A Novel Framework for Group-level Location Promotion in Geo-social Networks\", to appear in IEEE/ACM Transactions on Networking, 2018. [PDF] [TON] J. Zhang, L. Fu, Q. Wang, L. Liu, X. Wang, Xinbing Wang,\"Connectivity Analysis in Wireless Networks with Correlated Mobility and Cluster Scalability\" to appear in IEEE/ACM Transactions on Networking, 2017. [PDF] [TON] Xuanyu Cao, Jinbei Zhang, L. Fu, Weijie Wu, Xinbing Wang , Optimal Secrecy Capacity-delay Tradeoff in Large-scale Mobile ad hoc Networks, IEEE/ACM Transactions on Networking, 2016, 24(2): 1139-1152. [PDF] [TON] Jinbei Zhang, L. Fu, Xinbing Wang , Asymptotic Analysis on Secrecy Capacity in Large-scale Wireless Networks, IEEE/ACM Transactions on Networking, 2014, 22(1): 66-79. [PDF] [TON] Xinbing Wang, L. Fu, Chenhui Hu , Multicast Performance With Hierarchical Cooperation, IEEE/ACM Transactions on Networking, 2012, 20(3): 917-930. [PDF] See full publication list for more research highlights!",
  "content_length": 6943,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:54"
}