{
  "name": "Lutz Prechelt",
  "homepage": "https://www.mi.fu-berlin.de/w/Main/LutzPrechelt",
  "status": "success",
  "content": "LutzPrechelt < Main < Foswiki You are here: Foswiki>Main Web>WikiUsers>LutzPrechelt (25 Jun 2025, PrecheltUserTopic)Edit Attach Lutz Prechelt's Homepage I am professor of Informatics and head of the software engineering research group (AG SE). Freie Universität Berlin Institut für Informatik Lutz Prechelt Takustr. 9 (How to get there) 14195 Berlin Germany Room 014 Phone: +49 / 30 / 838-75115 Email: prechelt@inf.fu-berlin.de Mastodon: @prechelt@hachyderm.io Twitter: @prechelt XING page / LinkedIn page Secretary: GesineMilde ORCID Id 0000-0001-5592-3521 Research group \"Software Engineering\" Teaching Information for students Short vita Research interests and past work Software Honorary administrative and scientific service Scientific consulting Forum for Negative Results (FNR) Bibliography Information for students Office hour / Sprechstunde To fix a date for oral examinations, please turn to my secretary. Oral exams for Bachelor/Master entail the material of one course and take 20 minutes. For courses with written exams (Klausur), oral exams are an option only if you have failed the Klausur or are unable to attend the Klausur. Prior consultation with me is required. I am the local representative of the German Informatics Society (Gesellschaft für Informatik e.V. (GI)) / GI-Botschafter. Feel free to ask about GI. Teaching of my working group: Course information General StudentInfo Short vita I was born in Bielefeld in 1965. I received the degree of Diplom-Informatiker (~M.Sc.) from Universität Karlsruhe (now Karlsruhe Institute of Technology, KIT) in 1990 with a thesis on parsing German sentences. I stayed there at the Institut für Programmstrukturen und Datenorganisation and got my Ph.D. in 1995 with a thesis revolving around constructive neural network learning algorithms and compiler construction for parallel computers. When I received an offer to found a research group on empirical software engineering, I decided to stay further. That work led to my Habilitation in 2000 based on a book on empirical methodology in software engineering. At that point I decided I needed to learn something else entirely and I applied for a job in industry. In April 2000, I joined abaXX Technology (later merged into Cordys, later merged into Crealogix), where I held various positions as a department head (Quality Assurance, Training, Process Management, Technical Documentation) and eventually became Chief Technology Officer. I left abaXX in July 2003 to become full professor at Freie Universität Berlin. Research interests and past work I started my research career in artificial intelligence (first natural language processing YAKR, then neural network learning algorithms Prune, Stopping, CasCor) and then extended it into compiler construction Cupit, reapar in the realm of parallel computing. I have left all of these fields today. I early became interested in research methodology and research quality. This first led me to create a benchmark collection called Proben1 for neural network learning algorithms in 1994 Proben1, NNbench, which still appears to be somewhat popular. The same year, I participated in an assessment of the amount of empirical evaluation performed in the software engineering literature Expeval and performed an analogous one for articles about neural network learning methods NNeval. I then switched the research area and eventually wrote a methods book on controlled experimentation in software engineering (which I was silly enough to publish in German) in 2000 experiments. More work related to research methods and research quality will follow. In 1995, I switched my field of research to empirical software engineering and performed controlled experiments on a number of topics: type-checking tcheck, inheritance depth Inherit, design pattern use PatMain, design pattern documentation PatDoc, and the Personal Software Process pspe. (Except for the one on inheritance depth, all of these experiments were the first of their kind.) I am also quite open to taking opportunities when they present themselves. Over the years, this has led to a number of interesting studies regarding for instance design pattern recovery PAT, plagiarism detection jplag, and melody recognition Tuneserver. When starting afresh after my stint in industry, I shifted to a much more qualitative research approach, because, as you might have guessed by now, I like exploratory work and quantitative methods have a dubious cost/benefit ratio for such purposes. Most of my group's work is now qualitative and revolves around Agile processes and in particular Pair Programming. However, some quantitative work is also left and concerns comparing development platforms. See ResearchHome for some more information on current work and my personal bibliography or our workgroup bibliography for publications. Software Review Quality Collector (RQC) sedrila: Tool infrastructure for building and running 'self-driven lab' courses pomalevi: Powerpoint-based maintainable lecture videos tool Saros: Distributed Party Programming a.nwesen.de: CoViD-19 contact tracing for universities argparse-subcommand: A small library to extend Python's 'argparse' stdlib with easy and uniform handling of subcommands unread-decorator: A tiny Python library for un-reading lines back into a file or un-nexting items back into an iterator Honorary administrative and scientific service Administrative: Executive Director of the Institut für Informatik Member of the erweiterter Akademischer Senat Member of the Fachbereichsrat Mathematik und Informatik Member of the Institutsrat Informatik GI-Vertrauensdozent Deputy Commissioner for assuring proper scientific conduct (Stellvertretender Beauftragter zur Sicherung guter wissenschaftlicher Praxis) Scientific: Associate Editor Journal of Universal Computer Science Editor Forum for Negative Results (FNR) Associate Editor Transactions on Pattern Languages of Programming Editorial board member ScienceOpen Reviewer for the Deutsche Forschungsgemeinschaft (DFG) Reviewer for the European Commission (EC, EU) Reviewer for the European Research Council (ERC) Reviewer for the German Federal Science Ministry (BMBF) Reviewer for the Research Council of Norway (Forskningsradet) Reviewer for the Executive Agency for Higher Education, Research, Development and Innovation Funding (UEFISCDI), Romania Reviewer for the Austrian Research Promotion Agency (FFG) Reviewer for the Christian Doppler Forschungsgesellschaft (CDG), Austria Reviewer for the Austrian Science Fund (FWF) Reviewer for IEEE Transactions on Software Engineering Reviewer for Empirical Software Engineering Reviewer for Information and Software Technology Reviewer for Journal of Systems and Software Reviewer for IEEE Software Reviewer for ACM Transactions on Software Engineering and Methodology Reviewer for ACM Transactions on Computing Education Reviever for International Journal of Human-Computer Studies Reviewer for ACM Computing Surveys Reviewer for Software: Practice and Experience Reviewer for Automated Software Engineering Reviewer for Software Process: Improvement and Practice Reviewer for Software Quality Journal Reviewer for Computer Languages, Systems & Structures Reviewer for Computers & Industrial Engineering Reviewer for Computers in Human Behavior Reports Reviewer for MDPI Computers Reviewer for MDPI Informatics Reviewer for MDPI Entropy Reviewer for IEICE Transactions on Information and Systems Reviewer for ACM Journal on Computing and Cultural Heritage Reviewer for International Journal of Machine Learning and Cybernetics Reviewer for BMC Bioinformatics Reviewer for IEEE Transactions on Information Forensics and Security Reviewer for IEEE Transactions on Neural Networks Reviewer for Neurocomputing Reviewer for Journal of Machine Learning Research Reviewer for Neural Networks Reviewer for various conferences and workshops Scientific consulting I offer consulting (Beratung) and appraisals (Gutachten) in the following topic areas: all areas of the software process: software process models, software process management, software process improvement, software development methods and methodology empirical software engineering studies and their methodology human factors in software development software architecture and design Edit  | Attach | Print version | History: r98 < r97 < r96 < r95 | Backlinks | View wiki text | Edit wiki text | More topic actionsTopic revision: r98 - 25 Jun 2025, PrecheltUserTopic Main Log In Toolbox Create New Topic Index Search Changes Notifications RSS Feed Preferences Users Groups Webs ABI AGDepSys AGGeom AgMathLife Applications ClassificationApp BeGenDiv Cluster CompMolBio CompStatPhys DILIS DiBiMath HCC IT Internal ITarchive Inf GeschichteDesComputers Main Math Mi SE Sandbox System Tec Copyright © by the contributing authors. All material on this collaboration platform is the property of the contributing authors. Ideas, requests, problems regarding Foswiki? Send feedback",
  "content_length": 8978,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:56"
}