{
  "name": "Lutz Schröder",
  "homepage": "https://www8.cs.fau.de/schroeder",
  "status": "success",
  "content": "Prof. Dr. Lutz Schröder - Lehrstuhl für Informatik 8 (Theoretische Informatik) Organisationsmenü öffnen Organisationsmenü schließen Friedrich-Alexander-Universität Lehrstuhl für Informatik 8 (Theoretische Informatik) Prof. Dr. Lutz Schröder Prof. Dr. Lutz Schröder Lutz Schröder is the head of the Chair of Computer Science 8 (Theoretical Computer Science) at the Department of Computer Science of the Friedrich-Alexander-Universität Erlangen-Nürnberg. E-mail: user Lutz.Schroeder, domain fau.de Phone: +49 9131 85-64059 Fax: +49-9131-85-64055 Office: Martensstr. 3, 91058 Erlangen, Room 11.159 Highlights Behavioural Conformances based on Lax Couplings (Paul Wild, Lutz Schröder) at LICS 2025 Relators and Notions of Simulation Revisited (Sergey Goncharov, Dirk Hofmann, Pedro Nora, Lutz Schröder, Paul Wild) at LICS 2025 Conformance Games for Graded Semantics (Jonas Forster, Lutz Schröder, Paul Wild) at LICS 2025 Alternating Nominal Automata with Name Allocation (Florian Frank, Daniel Hausmann, Stefan Milius, Lutz Schröder, Henning Urbat) at LICS 2025 Relational Connectors and Heterogeneous Simulations (Pedro Nora, Jurriaan Rot, Lutz Schröder, Paul Wild) at FoSSaCS 2025. Identity-Preserving Lax Extensions and Where to Find Them (Sergey Goncharov, Dirk Hofmaan, Pedro Nora, Lutz Schröder, Paul Wild) at STACS 2025 Quantitative Graded Semantics and Spectra of Behavioural Metrics (Jonas Forster, Lutz Schröder, Paul Wild) at CSL 2025. Nominal Tree Automata with Name Allocation (Simon Prucker, Lutz Schröder) at  CONCUR 2024 Coalgebraic Satisfiability Checking for Arithmetic mu-Calculi (Daniel Hausmann, Lutz Schröder),  Log. Methods Comput. Sci. 20(3) (2024) Expressive Quantale-Valued Logics for Coalgebras (Harsh Beohar, Sebastian Gurke, Barbara König, Karla Messing, Jonas Forster, Lutz Schröder, Paul Wild) at STACS 2024 Logical Predicates in Higher-Order Mathematical Operational Semantics (Sergey Goncharov, Alessio Santamaria, Lutz Schröder, Stelios Tsampas, Henning Urbat) at FOSSACS 2024 Generic Model Checking for Modal Fixpoint Logics in COOL-MC (Daniel Hausmann, Merlin Humml, Simon Prucker, Lutz Schröder, Aaron Strahlberger) at VMCAI 2024 Weak Similarity in Higher-Order Mathematical Operational Semantics (Henning Urbat, Stelios Tsampas, Sergey Goncharov, Stefan Milius, Lutz Schröder) at LICS 2023 Common Knowledge of Abstract Groups (Merlin Humml, Lutz Schröder) at AAAI 2023 Towards a Higher-Order Mathematical Operational Semantics (Sergey Goncharov, Stefan Milius, Stelios Tsampas, Lutz Schröder, Henning Urbat) at POPL 2023 Kantorovich Functors and Characteristic Logics for Behavioural Distances (Sergey Goncharov, Dirk Hofmann, Pedro Nora, Lutz Schröder, Paul Wild) at FOSSACS 2023 COOL 2 – A Generic Reasoner for Modal Fixpoint Logics (System Description) (Oliver Görlitz, Daniel Hausmann, Merlin Humml, Dirk Pattinson, Simon Prucker, Lutz Schröder) at CADE 2023 Stateful Structural Operational Semantics (Sergey Goncharov, Stefan Milius, Stelios Tsampas, Lutz Schröder, Henning Urbat) at FSCD 2022 Graded Monads and Behavioural Equivalence Games (Chase Ford, Harsh Beohar, Barbara König, Stefan Milius, Lutz Schröder) at LICS 2022 Research List of publications; DBLP record; Google Scholar profile. Research interests: Formal Methods Knowledge Representation Logic in Computer Science Current projects: DFG Project CoMoC – Coalgebraic Model Checking (Stefan Milius, Lutz Schröder) DFG Project SpeQT – Spectra of Behavioural Distances and Quantitative Logics (Barbara König, Lutz Schröder) Principal investigator within DFG Research Training Group 2475: Cybercrime and Forensic Computing DFG project RAND – Reconstructing Arguments from Newsworthy Debates (Stefan Evert, Lutz Schröder) within DFG SPP 1999 Robust Argumentation Machines (RATIO) Recent Professional Activities 39th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2024, PC member 33nd International Joint Conference on Artificial Intelligence, IJCAI 2024, Program Committe Board member 47th German Conference on Artificial Intelligence, KI 2024, PC member E.W. Beth Dissertation Prize 2023 and 2024, member of the prize committee 46th German Conference on Artificial Intelligence, KI 2023, PC member 32nd International Joint Conference on Artificial Intelligence, IJCAI 2023, Program Committe Board member 31st International Joint Conference on Artificial Intelligence, IJCAI-ECAI 2022 Program Committe Board member 36h AAAI Conference on Artificial Intelligence, AAAI 2022, PC member 45th German Conference on Artificial Intelligence, KI 2022, PC member 44th German Conference on Artificial Intelligence, KI 2021, PC member 18th International Colloquium on Theoretical Aspects of Computing, ICTAC 2021, PC member 37th Conference on Mathematical Foundations of Programming Semantics, MFPS 2021, PC member 25th International Conference on Foundations of Software Science and Computation Structures, FoSSaCS 2022, PC co-chair (jointly with Patricia Bouyer) 2016-2022: Co-chair (jointly with Markus Roggenbach) of IFIP WG 1.3 (Foundations of System Specification) 30th International Joint Conference on Artificial Intelligence, IJCAI 2021, PC member",
  "content_length": 5157,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:57"
}