{
  "name": "Luís Miguel Parreira Correia",
  "homepage": "https://ciencias.ulisboa.pt/perfil/lmcorreia",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo LUÍS CORREIA Contactos Departamento de Informática Sala/Gabinete 6.3.09 Ext. Principal 526309 Telefone Direto 217500124 Extensão pessoal 526309 Email lmcorreia@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Catedrático Indicadores ResearcherID Orcid Scopus Google Scholar CiênciaVitae Currículo Resumido Luís M.P. Correia is professor at the Department of Informatics of Faculdade de Ciências of Universidade de Lisboa, Portugal. He obtained an Electrical Engineering degree from Instituto Superior Técnico of Universidade Técnica de Lisboa (1982), a PhD in Informatics from Universidade Nova de Lisboa (1995), and habilitation from Universidade de Lisboa (2009). He lead the Laboratory of Agent Modelling, LabMAg (2004-2014), the Informatics Department (2012-2015), and the MAS group of BioISI (2015-2020). Currently he is a researcher at LASIGE, ULisboa. His research interests are artificial life, self-organisation, multi-agent systems, autonomous robots and data mining. He has participated in several international projects and serves as evaluator of EU, ANR (France) and other international projects, as well as in several journals and international conferences. Besides lecturing in the three cycles of informatics he has also appointments in the cognitive science and in the complexity sciences post-graduations. Interesses Científicos vida artificial, robôs móveis, auto-organização em sistemas multi-agente, aprendizagem automática Scientific Interests artificial life, autonomous robots, self-organisation in multi-agent systems, machine learning Publicações selecionadas F. Chichorro, L. Correia, P. Cardoso. Biological traits interact with human threats to drive extinctions: A modelling study. Ecological Informatics, vol. 69, 101604,2022 P. Cardoso, V. V. Branco, P. A. V. Borges, J. C. Carvalho, F. Rigal, R. Gabriel, S. Mammola, J. Cascalho, L. Correia. Automated Discovery of Relationships, Models, and Principles in Ecology. Frontiers in Ecology and Evolution, 8, 2020 F. Bonnet, R. Mills, M. Szopek, S. Schönwetter-Fuchs, J. Halloy, S. Bogdan, L. Correia, F. Mondada, T. Schmickl. Robots mediating interactions between animals for interspecies collective behaviors. Science Robotics, 4(28), 2019 F. Silva, L. Correia, and A. L. Christensen. Evolutionary online behaviour learning and adaptation in real robots. Royal Society open science, 4:160938, 2017 L. Correia, A. M. Sebastião, and P. Santana. On the role of stigmergy in cognition. Progress in Artificial Intelligence, 6:79-86, 2017 Ver todas as Publicações",
  "content_length": 2733,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:03"
}