{
  "name": "Luís Pina",
  "homepage": "https://www.luispina.me",
  "status": "success",
  "content": "Luís Pina - Homepage Luís Pina Toggle navigation Home Blog Publications Research Students Funding Teaching I am currently an Assistant Professor with the CS department at University of Illinois Chicago (UIC), since August of 2019. Previously, I was a post-doc at George Mason University’s Department of Computer Science, from 2017 to 2019. I was part of the Software Reliability Group (SRG) at Imperial College London, from 2015 to 2017, part of the Programming Languages Group (PLUM) at University of Maryland from 2012 to 2015, and part of the Software Engineering Group (ESW) at INESC-ID in Lisbon from 2009 to 2012. I hold a PhD on Information Systems and Computer Engineering from Instituto Superior Técnico, University of Lisbon, Portugal. I developed my dissertation under the supervision of Prof. Luís Veiga and Prof. Michael Hicks, focusing on making Dynamic Software Updates (DSU) practical. Contact E-mail: [ point here] Address: (CDRLC) Computer Design Research and Learning Center Room 4448 850 W. Taylor St. MC 152 / Bldg. 649 Chicago, IL 60607 USA Office: (CDRLC) Computer Design Research and Learning Center, Room 4448 Research I work in the broad areas of software systems, programming languages, and software engineering. My research interests include: Fuzz testing and property testing, Dynamic Software Updating, Concurrent Programming (Multiprocessor Programming, Lock-free/Wait-free Algorithms and Data Structures), High Level Language Virtual Machines. My full publication list is available here. Projects Multi-Version eXecution for Managed Languages Principles of Fuzz and Property Testing Reproducibility in NLP research Past Varan - Multi-version execution Rubah - Dynamic Software Updating for Java SymDroid - Symbolic Evaluation for Android Applications DuSTM - Dynamic Updates using Software Transactional Memory JVSTM - Java Versioned Software Transactional Memory Current students (PhD) Farhan Saif. Started on Fall 2024; working on Multi-Version eXecution for Managed Languages. (PhD) Joseph Wiseman. Started on Fall 2024; working on Principles of Fuzz and Property Testing. (PhD) David Schwartz. Started on Fall 2021; working on Multi-Version eXecution for Managed Languages. (PhD) Jesse Coultas. Started on Fall 2020; working on Principles of Fuzz and Property Testing. (MS with thesis) Antonio Masuric. Started on Summer 2025; working on Principles of Fuzz and Property Testing. (BS) Maaz Iqbal. Started on Summer 2025; working on Multi-Version eXecution for Managed Languages. Past students (MS with thesis) Ali Siddiqui. Started on Summer 2024, ended on Spring 2025; worked on Multi-Version eXecution for Managed Languages. Now at Oracle. (MS with thesis) David Woloch. Started on Summer 2021, ended on Spring 2022; worked on Multi-Version eXecution for Managed Languages. Now at JP Morgan Chase. (MS) Ankith Kowshik. Started on Summer 2022, ended on Fall 2023; worked on Multi-Version eXecution for Managed Languages. Now at Cisco. (MS) Jason Pereira. Started on Fall 2022, ended on Spring 2023; worked on Multi-Version eXecution for Managed Languages. (MS) Meer Shah. Started on Fall 2022, ended on Spring 2023; worked on Multi-Version eXecution for Managed Languages. Now at Actico. (MS) Ugnius Rumsevicius. Started on Fall 2021, ended on Summer 2023; worked on Multi-Version eXecution for Managed Languages. Now at EDX Markets. (MS) Maazur Rahman. Started on Fall 2022, ended on Fall 2023; worked on Multi-Version eXecution for Managed Languages. (MS) Alekh Mekka. Started on Fall 2021, ended on Summer 2023; worked on Principles of Fuzz and Property Testing. (MS) Fahad Ahmad. Started on Spring 2022, ended on Fall 2022; worked on Multi-Version eXecution for Managed Languages. Now at FastModel Sports. (MS) Linfeng Li. Started on Fall 2021, ended on Fall 2021; worked on Multi-Version eXecution for Managed Languages. Now at Google. (MS) Ellen Kidane. Started on Fall 2021, ended on Spring 2022; worked on Multi-Version eXecution for Managed Languages. Now at UIC CS department. (MS) Siddhanth Venkateshwaran. Started on Spring 2021, ended on Fall 2021; worked on Multi-Version eXecution for Managed Languages. Now at Salesforce. (BS) Lei Chen. Started on Summer 2024, ended on Fall 2025; worked on Multi-Version eXecution for Managed Languages. (BS) Spencer Hoberg. Started on Summer 2024, ended on Fall 2024; worked on Multi-Version eXecution for Managed Languages. (BS) Catherine West. Started on Summer 2024, ended on Fall 2024; worked on Multi-Version eXecution for Managed Languages. (BS) Emily Mendonza. Started on Fall 2023, ended on Spring 2024; worked on Multi-Version eXecution for Managed Languages. (BS) Luis de Santos. Started on Fall 2023, ended on Spring 2024; worked on Multi-Version eXecution for Managed Languages. Now at AtomAI Solutions. (BS) Zara Farin. Started on Spring 2022, ended on Fall 2023; worked on Principles of Fuzz and Property Testing. Now at Microsoft. (BS) Spanya Shamasa. Started on Spring 2021, ended on Spring 2021; worked on Multi-Version eXecution for Managed Languages. Now at Groupon. (BS) Vittoria Laudando. Started on Spring 2021, ended on Spring 2021; worked on Multi-Version eXecution for Managed Languages. Now at Mediaocean. (BS) Will Cygan. Started on Fall 2020, ended on Fall 2021; worked on Principles of Fuzz and Property Testing. Now at LinkedIn. Funding My research is generously supported by the following grants: NSF: SHF: Small: Multi-Version eXecution for Managed Languages Teaching Current: CS473 - Compiler Design CS361 - Systems Programming: Spring 2023 CS454 - Principles of Concurrent Programming: Spring 2025, Spring 2024, Spring 2022 CS494 - Principles of Concurrent Programming: Spring 2021, Spring 2020 CS473 - Compiler Design: Fall 2025, Fall 2024, Fall 2022 CS474 - Object-Oriented Languages and Environments: Fall 2021, Fall 2020, Fall 2019 Software Reliability (440) at Imperial College London: Fall 2016",
  "content_length": 5921,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:02"
}