{
  "name": "Luís E. T. Rodrigues",
  "homepage": "http://www.gsd.inesc-id.pt/~ler",
  "status": "success",
  "content": "Luís Rodrigues Home Page Luís E. T. Rodrigues, Professor (Professor Catedrático) Departamento de Engenharia Informática, Instituto Superior Técnico (IST), Universidade de Lisboa Distributed, Parallel and Secure Systems Group, INESC-ID Myself Short CV Online profiles: GoogleScholar, Microsoft Academic Search, ACM DL, DBLP, Researcher ID, Scopus, ORCID, ciennciavitae Papers Papers sorted by year Some relevant conference deadlines/dates Books Introduction to Reliable and Secure Distributed Programming (with C. Cachin and R. Guerraoui) 2nd Edition, Springer, 2011 Middleware for Network Eccentric and Mobile Applications, editor, (with B. Garbinato and H. Miranda), Springer 2009. Introduction to Reliable Distributed Programming, (with R. Guerraoui), Springer 2006. See new edition above. Distributed Systems for System Architects, (with P. Veríssimo), Kluwer 2001. Teaching and Supervising Students Courses (present and past) Events SSS 2020 On-Going Research Activities Research Group: Distributed, Parallel and Secure Systems Group (intranet) International research projects: ACHILLES, ACES National research projects: GLOG. Past Research Activities Research Group: Check the obsolete DIALNP: DIstributed ALgorithms and Network Protocols group for previous activities at FCUL Research Networks: Euro-TM, MiNEMA, DYNAMO (Cost 295) International Research Projects:: PCAS, CLOUD-TM, FASTFIX GORDA, GlobData National Research Projects:: DACOMICO, COSMOS, NG-STORAGE, ABYSS, PEPITA, ADAAS, HPCLSI, ARISTOS, Appia REDICO, PASTRAMY, PeerVibes, MICAS, P-SON, StrongRep, IndiQoS, Rumor, SEMP2P, SHIFT, Moosco, TOPCOM, DEAR-COTS, Micra, Older: Check also the Navigators Log Useful links FCT ACM, IEEE, and IEEE CS Google Scholar Contact INESC-ID, Lisboa, Rua Alves Redol 9, Office 508 1000-029 Lisboa Portugal Tel: +351 213 100 346 Fax: +351 213 145 843 Email: ler @ tecnico _dot_ ulisboa _dot_ pt",
  "content_length": 1893,
  "method": "requests",
  "crawl_time": "2025-12-01 13:48:57"
}