{
  "name": "Lydia E. Kavraki",
  "homepage": "http://www.cs.rice.edu/~kavraki",
  "status": "success",
  "content": "Lydia E. Kavraki: Home Page Lydia E. Kavraki Noah Harding Professor of Computer Science Professor of Bioengineering Professor of Electrical and Computer Engineering Professor of Mechanical Engineering Director, Ken Kennedy Institute Rice University Kavraki Lab This page is old and is soon going away. For updated information check Kavraki's Rice University Profile Contact Information For FEDEX please use: Dept. of Computer Science, MS 132 Rice University 6100 Main Street Houston, TX 77005 For regular mail please use: Rice University MS132 P.O. Box 1892 Houston, TX 77251-1892 Office: DH 3106. Directions to my office can be found here. Tel: (713) 348-5737 Fax: (713) 348-5930 \"my last name\"@rice.edu Bio Lydia E. Kavraki is the Noah Harding Professor of Computer Science, professor of Bioengineering, professor of Electrical and Computer Engineering, and professor of Mechanical Engineering at Rice University. She is the Director of the Ken Kennedy Institute at Rice. Kavraki received her B.A. in Computer Science from the University of Crete in Greece and her Ph.D. in Computer Science from Stanford University working with Professor Jean-Claude Latombe. Kavraki's research interests span robotics, AI, and biomedicine. In robotics and AI, she is interested in enabling robots to work with people and in support of people. Her research develops the underlying methodologies for achieving this goal: algorithms for motion planning for high-dimensional systems with kinematic and dynamic constraints, integrated frameworks for reasoning under sensing and control uncertainty, novel methods for learning and for using experiences, and ways to instruct robots at a high level and collaborate with them. Kavraki’s lab is inspired by a variety of applications: from robots that will assist people in their homes, to robots that assist in surgeries, to robots that would build space habitats. In biomedicine she develops computational methods and tools to model protein structure and function, understand biomolecular interactions, aid the process of medicinal drug discovery, analyze the molecular machinery of the cell, and help integrate biological and biomedical data for improving human health. Her work has applications, among others, in personalized immunotherapy. Kavraki’s research blends her extensive interdisciplinary background in computer science, artificial intelligence, machine learning, bioengineering and biomedical sciences promoting the convergence of these disciplines. Kavraki has authored more than 240 peer-reviewed journal and conference publications and is one of the authors of the widely used robotics textbook titled “Principles of Robot Motion” published by MIT Press. Work in her group has produced the Open Motion Planning Library (OMPL), an open-source library of motion planning algorithms. The library links directly with the Robot Operating System (ROS) and MoveIt, and it is heavily used in industry and in academia. Other widely used prototypes of the research conducted in her laboratory include DINC for molecular docking and LabelHash for matching 3D structural motifs in proteins. Her research has been funded by NSF, NIH, ARO, NASA, and the Cancer Prevention and Research Institute of Texas (CPRIT). Kavraki's more than 30 postdocs and PhD alums have gone on to faculty positions at prestigious universities, industrial research labs, startups as well as large software companies. Kavraki currently serves as an associate editor of the International Journal of Robotics Research, the ACM/IEEE Transactions on Computational Biology and Bioinformatics, the Computer Science Review, the Frontiers in Molecular Biosciences, and the Annual Reviews for Robotics, Control, and Autonomous Systems. She is also a member of the editorial advisory board of the Springer Tracts in Advanced Robotics and the IEEE Letters in Robotics and Automation. Kavraki has served as the program chair and as the general chair of “Robotics: Science and Systems,” the premier robotics conference. She leads the NIH/NLM T15 Training Program in Biomedical Informatics and Data Science under the auspices of the Keck Center of the Gulf Coast Consortia in Houston. As the director of the Ken Kennedy Institute at Rice, Kavraki provides leaderships in the areas of AI, Data and Computing. The Institute has more than 250 members and spans all Schools at Riec University. Kavraki is a member of the National Academy of Medicine (NAM), the Academy of Medicine, Engineering, and Science of Texas (TAMEST), the International Academy of Medical and Biological Engineering (IAMBE), the Academy of Athens, and Academia Europaea. She has received the Association for Computing Machinery (ACM) Grace Murray Hopper Award, ACM Athena Lecturer Award and the ACM/AAAI Allen Newell Award. Kavraki has also received the Robotics Pioneer Award from the IEEE Robotics and Automation Society. Earlier awards include an NSF CAREER award, a Sloan Fellowship, a Whitaker Investigator Award, the Early Academic Career Award from the IEEE Society on Robotics and Automation, a recognition as a top TR100 investigator from the MIT Technology Review Magazine, a recognition as a Brilliant 10 Scientist from the Popular Science Magazine, and the Anita Borg ABIE Technical Leadership Award. At Rice University, she is the recipient of the Charles Duncan Award for Excellence in Research and Teaching, the Presidential Mentorship Award and the Outstanding Faculty Research Award from the Engineering School. In Houston, she has been recognized with BioHouston’s Women in Science Award. Kavraki is a Fellow of ACM, a Fellow of IEEE, a Fellow of the American Association for the Advancement of Science (AAAS), a Fellow of the Association for the Advancement of Artificial Intelligence (AAAI), and a Fellow of the American Institute for Medical and Biological Engineering (AIMBE). At Rice, Kavraki has received the Charles Duncan Award, the Presidential Mentorship Award, the Outstanding Faculty Research Award of the Engineering School and the Faculty Award for Excellence in Research, Teaching and Service. Affiliations The Department of Computer Science at Rice University The Department of Bioengineering at Rice University The Department of Electrical and Computer Engineering at Rice University The Department of Mechanical Engineering at Rice University The W.M. Keck Center of the Gulf Coast Consortia for Quatitative Biomedical Sciences Training (Past Chair of the Executive Committee) The National Library of Medicine (NLM) Training Program in Biomedical Informatics and Data Science (PI/Program Director) The PhD Program in Systems, Synthetic, and Physical Biology at Rice University The Ken Kennedy Institute for Information Technology (Director) The Institute for Biosciences and Bioengineering The Smalley-Curl Institute The MD/PhD program at the Baylor College of Medicine Leadership Positions Ken Kennedy Institute, Director NLM Training Program in Data Science and Biomedical Informatics, PI and Program Director Research and Teaching For updated research information, visit the web page of my lab: Kavraki Lab: Computational Robotics, AI and Biomedicine. I am most proud of the accomplishments and awards of my students. A very short and old description of research activities for those who are curious on the relationship of computational robotics and computationla biomedicine that are both core research areas of my lab. For my classes check canvas.rice.edu For my on-line bioinformatics class please check Geometric Methods in Structural Computational Biology. Awards/Honors Academies Member, National Academy of Medicine, USA, 2012 Member, The Academy of Medicine, Engineering and Science of Texas (TAMEST), 2012 Corresponding Member, Academy of Athens, Greece, 2018 Member, International Academy of Medical and Biological Engineering, 2020 Member, Academia Europaea, 2020 Awards Faculty Award for Excellence in Research, Teaching and Service, Rice University, 2022 ACM-AAAI Allen Newell Award, 2020 Pioneer Award, IEEE Robotics and Automation Society, 2020 Outstanding Faculty Research Award, Engineering School, Rice University, 2020 Association for Computing Machinery (ACM) Athena Lecturer Award and video, 2017 Presidential Mentoring Award, Rice University, 2016 ABIE Technical Leadership Award, Anita Borg Institute, 2015 Fellow, American Association for the Advancement of Science (AAAS), 2012 Fellow, Institute of Electrical and Electronics Engineers (IEEE), 2012 Fellow, Association for Computing Machinery (ACM), 2010 Fellow, Association for the Advancement of Artificial Intelligence (AAAI), 2008 Fellow, American Institute for Medical and Biological Engineering (AIMBE), 2004 Fellow, The World Technology Network (WTN), 2004 BioHouston's Women in Science Award, 2012 World Open Source Software Challenge Grand Prize, OMPL (Open Motion Planning Library), 2012 Charles Duncan Award for Outstanding Academic Achievement, Rice University, 2004 100 World's Top Young Innovators by MIT's Technology Review Magazine, 2002 IEEE Robotics and Automation Society Early Academic Career Award, 2002 Brilliant 10 Scientists, Popular Science Magazine, 2002 Association for Computing Machinery (ACM) Grace Murray Hopper Award Whitaker Investigator, 2001 Fellow, Sloan Foundation, 2000 NSF CAREER Award (Early Development Career Award), 1997-2002 Activities and News (a random collection that has not been updated for a while) PI and Program Director of the NLM T15 Training Grant on Biomedical Informatics under the auspices of the Gulf Coast Consortia for Quantitative Biomedical Sciences. Check out the Open Motion Planning Library (OMPL). The library is compatible with ROS and MoveIt and has been used on many robotics platforms. OMPL was awarded the Grand Prize at the World Open Source Software Challenge in 2012. National Academy of Medicine, Vice-Chair for Section 1, 2015-2017, Chair 2017-2019. Founding Chair and Co-chair, NAM Interest Group on Health and Technology. In the 2019 Internatio",
  "content_length": 12622,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:06"
}