{
  "name": "Lydia B. Chilton",
  "homepage": "https://www.cs.columbia.edu/~chilton",
  "status": "success",
  "content": "Computational Design Lab Computational Design • Columbia • HCI • AI The Computational Design Lab is a research group in the Computer Science Department of Columbia University. Its goal is to build AI tools that enhance people's productivity. The three main approaches are to: discover principles of successful solutions design better solutions through brainstorming, synthesis, and iteration communicate complex ideas more easily with visual symbols and well-grounded prose People Lydia B. Chilton Professor, PI Vivian Liu PhD Student Sitong Wang PhD Student Tao Long PhD Student Yulun Du PhD Student Xuanming \"Billy\" Zhang PhD Student (co-advised by Zhou Yu) Jenny Ma PhD Student Karthik Sreedhar PhD Student Riya Sahni PhD Student Alumni Robert Soden Faculty at University of Toronto Katy Gero (2023) Faculty at University of Sydney Dissertation: AI and the Writer: How Language Models Support Creative Writers Savvas Petridis (2023) Google DeepMind, People and AI Research (PAIR) Dissertation: Designing Exploratory Search Systems that Stimulate Memory and Reduce Cognitive Load Daniel Li (2022) US Army Dissertation: Enabling Structured Navigation of Longform Spoken Dialog with Automatic Summarization Publications Schemex: Interactive Structural Abstraction from Examples with Contrastive Refinement Sitong Wang, Samia Menon, Dingzeyu Li, Xiaojuan Ma, Richard Zemel, Lydia B. Chilton Under submission PDF Video AgentDynEx: Nudging the Mechanics and Dynamics of Multi-Agent Simulations Jenny Ma*, Riya Sahni*, Karthik Sreedhar, Lydia B. Chilton * equal contribution Under submission PDF Video Simulating Cooperative Prosocial Behavior with Multi-Agent LLMs: Evidence and Mechanisms for AI Agents to Inform Policy Decisions Karthik Sreedhar, Alice Cai, Jenny Ma, Jeffrey V. Nickerson, Lydia B. Chilton IUI 2025 PDF Beyond AI Training: How Social and Experiential Learning Shape AI Adoption in theWorkplace Riya Sahni, Lydia B. Chilton Under submission PDF Audience Impressions of Narrative Structures and Personal Language Style in Science Communication on Social Media Grace Li, Yuanyang Teng, Juna Kawai-Yue, Unaisah Ahmed, Anatta S. Tantiwongse, Jessica Y. Liang, Dorothy Zhang, Kynnedy Simone Smith, Tao Long, Mina Lee, Lydia B Chilton Under submission PDF The Role of Human Creativity in the Presence of AI Creativity Tools at Work: A Case Study on AI-Driven Content Transformation in Journalism Sitong Wang, Jocelyn McKinnon-Crowley, Tao Long, Kian Loong Lua, Keren Henderson, Kevin Crowston, Jeffrey V. Nickerson, Mark Hansen, Lydia B. Chilton Under submission PDF AI Humor Generation: Cognitive, Social and Creative Skills for Effective Humor Sean Kim, Lydia B. Chilton Under submission PDF JumpStarter: Getting Started on Personal Goals with Adaptive Personal Context Curation Sitong Wang, Xuanming Zhang, Jenny Ma, Alyssa Hwang, Zhou Yu, Lydia B. Chilton Under submission PDF Video Copying Style, Extracting Value: Illustrators' Perception of AI Style Transfer and its Impact on Creative Labor Julien Porquet, Sitong Wang, Lydia B. Chilton CHI 2025 PDF DynEx: Dynamic Code Synthesis with Structured Design Exploration for Accelerated Exploratory Programming Jenny Ma, Karthik Sreedhar, Vivian Liu, Pedro Alejandro Perez, Sitong Wang, Riya Sahni, Lydia B. Chilton CHI 2025 PDF Video LogoMotion: Visually Grounded Code Generation for Content-Aware Animation Vivian Liu, Rubaiat Habib Kazi, Li-Yi Wei, Matthew Fisher, Timothy Langlois, Seth Walker, Lydia Chilton CHI 2025 PDF Video Project Website Seeing Science: Inquiry-Based Learning at Home Through Mobile Messaging System Tamar Fuhrmann, Marina A Lemee, Jonathan Pang, Je Seung You, Lydia B Chilton, Carl Vondrick, Paulo Blikstein IDC WIP 2024 PDF ACM DL MoodSmith: Enabling Mood-Consistent Multimedia for AI-Generated Advocacy Campaigns Samia Menon, Sitong Wang, Lydia Chilton ICCC 2024 PDF Eliciting Topic Hierarchies from Large Language Models Grace Li, Tao Long, Lydia Chilton Under submission PDF Not Just Novelty: A Longitudinal Study on Utility and Customization of AI Workflows Tao Long, Katy Ilonka Gero, Lydia B. Chilton DIS 2024 PDF Arxiv ACM PodReels: Human-AI Co-Creation of Video Podcast Teasers Sitong Wang, Zheng Ning, Anh Truong, Mira Dontcheva, Dingzeyu Li, Lydia B. Chilton DIS 2024 PDF Arxiv PDF ACM Digital \"Double Hatters\": Vivian Liu, Tao Long, Nathan Raw, Lydia Chilton HICSS 2025 PDF Video Tweetorial Code Demo BibTex Scrolly2Reel: Retargeting Graphics for Social Media Using Narrative Beats Duy K. Nguyen, Jenny Ma, Pedro Alejandro Perez, Lydia B. Chilton HICSS 2025 PDF Simulating Human Strategic Behavior: Comparing Single and Multi-agent LLMs Karthik Sreedhar, Lydia Chilton Best Paper Nomination HICSS 2025 PDF Storysumm: Evaluating faithfulness in story summarization Melanie Subbiah, F Ladhak, A Mishra, G Adams, Lydia B Chilton, Kathleen McKeown EMNLP 2024 Reading Subtext: Evaluating Large Language Models on Short Story Summarization with Writers Melanie Subbiah, Sean Zhang, Lydia B. Chilton, Kathleen McKeown TACL 2024 ReelFramer: Human-AI Co-Creation for News-to-Video Translation Sitong Wang, Samia Menon, Tao Long, Keren Henderson, Dingzeyu Li, Kevin Crowston, Mark Hansen, Jeffrey V Nickerson, Lydia B Chilton CHI 2024 PDF Video Tweet BibTeX Writing out the Storm: Designing and Evaluating Tools for Weather Risk Messaging Sophia S Jit, Jennifer Spinney, Priyank Chandra, Lydia B Chilton, Robert Soden CHI 2024 Designing with AI Lydia B. Chilton XRDS Magazine, Summer 2023 Tweetorial Hooks: Generative AI Tools to Motivate Science on Social Media Tao Long, Dorothy Zhang, Grace Li, Batool Taraif, Samia Menon, Kynnedy Simone Smith, Sitong Wang, Katy Ilonka Gero, Lydia B. Chilton ICCC 2023 PDF Video Project Website Code Demo BibTeX Metaphorian: Leveraging Large Language Models to Support Extended Metaphor Creation for Science Writing Jeongyeon Kim, Sangho Suh, Lydia B Chilton, Haijun Xia DIS 2023 PDF StoryWars: A Dataset and Instruction Tuning Baselines for Collaborative Story Understanding and Generation Yulun Du and Lydia Chilton ACL 2023 PDF How Much is Performance Worth to Users? A Quantitative Approach Adam Hastings, Lydia B. Chilton, Simha Sethumadhavan. Computing Frontiers 2023 PDF Challenges and Opportunities for the Design of Smart Speakers Language Models Tao Long, Lydia B. Chilton AAAI AI4Home 2023 PDF Video BibTeX PopBlends: Strategies for Conceptual Blending with Large Language Models Sitong Wang, Savvas Petridis, Taeahn Kwon, Xiaojuan Ma, Lydia B. Chilton CHI 2023 PDF Video AngleKindling: Supporting Journalistic Angle Ideation with Large Language Models Savvas Petridis, Nicholas Diakopoulos, Kevin Crowston, Mark Hansen, Keren Henderson, Stan Jastrzebski, Jeffrey V. Nickerson, Lydia B. Chilton CHI 2023 PDF Social Dynamics of AI Support in Creative Writing Katy Ilonka Gero, Tao Long, Lydia B. Chilton CHI 2023 PDF Video Tweet Press BibTeX Improving Automatic Summarization for Browsing Longform Spoken Dialog Daniel Li, Thomas Chen, Alec Zadikian, Albert Tung, Lydia B. Chilton CHI 2023 PDF Opal: Multimodal Image Generation for News Illustration Vivian Liu, Han Qiao, Lydia B. Chilton UIST 2022 PDF Eliciting Gestures for Novel Note-taking Interactions Katy Gero, Lydia B. Chilton, Chris Melancon and Mike Cleron. DIS 2022 PDF Sparks: Inspiration for Science Writing using Language Models Katy Gero, Vivian Liu, and Lydia B. Chilton. DIS 2022 PDF bibtex Initial Images: Using Image Prompts to Improve Subject Representation in Multimodal AI Generated Art Han Qiao, Vivian Liu, Lydia B. Chilton Creativity and Cognition 2022 Design Guidelines for Prompt Engineering Text-to-Image Generative Models Vivian Liu, Lydia B. Chilton CHI 2022 Insights and Opportunities for HCI Research into Hurricane Risk Communication Robert Soden, Lydia B. Chilton, Scott Miles, Rebecca Bicksler, Kaira Ray Villanueva, Melissa Bica CHI 2022 (Workshop) HAI-GEN 2022: 3rd Workshop on Human-AI Co-Creation with Generative Models Justin D. Weisz, Mary Lou Maher, Hendrik Strobelt, Lydia B. Chilton, David Bau, Werner Geyer, IUI 2022 https://hai-gen.github.io/2022/ SymbolFinder: Brainstorming diverse symbols using local semantic networks Savvas Petridis, Hijung Valentina Shin, Lydia B. Chilton UIST 2021 https://columbia-comp-design.github.io/symbol_finder_web/ Hierarchical Summarization for Longform Spoken Dialog Daniel Li, Thomas Chen, Albert Tung, Lydia B. Chilton UIST 2021 What Makes Tweetorials Tick: How Experts Communicate Complex Topics on Twitter Katy Gero, Vivian Liu, Sarah Huang, Jennifer Lee, and Lydia Chilton. CSCW 2021 http://language-play.com/tech-tweets/ bibtex VisiFit: AI Tools to Iteratively Improve Visual Blends Lydia B. Chilton, Ecenaz Jen Ozmen, Sam H. Ross, Vivian Liu CHI 2021 HAI-GEN 2021: 2nd Workshop on Human-AI Co-Creation with Generative Models Werner Geyer, Lydia B. Chilton, Justin D. Weisz, Mary Lou Maher IUI 2021 https://hai-gen2021.github.io/ AmbiTeam: Providing Team Awareness Through Ambient Displays Sarah Morrison-Smith, Lydia B. Chilton, Jaime Ruiz. GI 2021 AmbiTeam feature in XRDSVolume 29 Issue 4 pp 20â25 Facilitating Team Awareness through Ambient Displays. Sarah Morrison-Smith, Lydia B. Chilton, Jaime Ruiz. Microsoftâs Symposium on the New Future in Work. (2020). How Novelists Use Generative Language Models Alex Calderwood, Vivian Qiu, Katy Ilonka Gero, Lydia B. Chilton HAI-GEN Workshop Paper at IUI 2020 HAI-GEN 2020: Workshop on Human-AI Co-Creation with Generative Models Werner Geyer, Lydia B. Chilton, Ranjitha Kumar, Adam Tauman Kalai IUI 2020 https://hai-gen2020.github.io/ WordBlender: Principles and Tools for Generating Word Blends Sam H. Ross, Ecenaz Jen Ozmen, Maria Kogan, Lydia B. Chilton IUI 2020. (Workshop) Addressing the Accessibility of Social Media Cole Gleason, Patrick Harrington, Benjamin M. Gorman, Andres Monroy-Hernandez, Garreth Tigwell, Lydia B. Chilton, Hernisa Kacorri, Meredith Ringel Morris, Shaomei Wu CSCW 2019 https://socialandaccessible.wordpress.com/ Low Level Linguistic Controls f",
  "content_length": 13457,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:04"
}