{
  "name": "Lydia Yiyu Chen",
  "homepage": "https://www.lydiaychen.com",
  "status": "success",
  "content": "Lydia Y. Chen I am a professor at University of Neuchatel and TU Delft. I am the director of Distributed Learning Systems Lab. I returned to academia, after a decade of industry experience at the IBM Research Zurich Lab. My research interests lie in the distinct areas of deep learning, distributed systems, and trust worthy technology. My research is supported by the Swiss National Science Foundation, Dutch National Science Foundation, the European Union, IBM Research, ABB, TU Delft, ASM, Tata Steel, and ASML. My recent research focuses on following research questions. Generative AI systems: how to discover the unnkown via the power of generative models, ranging from tables, time series to graph? I am exploring large langague models and diffusion models in collaboration with scientiest in natural science and manufactoring. Trustworthy learning systems: how to make learning algorithms robust and verifiable against adversaries that maliciously manipulate data input? I am designing practical strategies and theories against adversaries, e.g., watermarks Try out our work News [11/25] Lydia will serve EuroSys 27 TPC co-chairs [09/25]Our paper, “TimeWak: Temporal Chained-Hashing Watermark for Time Series Data\" , as a spotlight paper at NeurIPS 25 [09/25]Our paper, “Collaborative and Confidential Junction Trees for Hybrid Bayesian Networks \" , is accepted at NeurIPS 25 [09/25]Our paper, “WaveStitch: Flexible and Fast Conditional Time Series Generation with Diffusion Models\" , is accepted at SIGMOD 26 [04/25]Our group has three papers accepted at ECML/PKDD 25 [04/25] Lydia will serve DSN 26 TPC co-chairs [04/25] Our group has three papers accepted at ARES 25 [01/25] Our paper, “TabWak: A Watermark for Tabular Diffusion Models\" , is accepted as a spotlight paper at ICLR 25 [01/25] Our paper, “GTV: Generating Tabular Data via Vertical Federated Learning\" , is accepted at DSN 25 Old News.....",
  "content_length": 1912,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:06"
}