{
  "name": "Lynne Blair",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/lynne-blair",
  "status": "success",
  "content": "Lynne Blair - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Lynne Blair Visiting Teaching Fellow Research Overview - Issues surrounding Equality, Diversity and Inclusion in Computing and Technology - a new and exciting research area that arises from Lancaster’s involvement in the Institute of Coding, including our work on building a broader participation base for computer science, and seeking to understand and reduce the inequalities both in computing education and in the computing industry. - Human aspects of Computing such as personal and social implications of our digital economy on community values and integrity, wellbeing, and environmental implications regarding sustainability in digital innovations. Show more… Profile Part-time: 50% Lynne Blair is a Senior Lecturer in the School of Computing and Communications at Lancaster University. She co-leads Lancaster's involvement in the Institute of Coding (with a focus on Theme 4: Widening Participation). She also acted as the director of Lancaster's Computing At School Regional Centre and continues these links with the National Centre for Computing Education. Her current research interests lie within the areas of Equality, Diversity and Inclusion in Computing and Technology fields, and Human Computer Interaction, particularly consideration of the human, social and environmental impact of the digital economy, as well as wider issues of sustainability. Career Details Academic Qualifications: PhD in Computer Science, Lancaster, 1995 BSc Computer Science (1st Class Hons), Lancaster, 1990 SEDA Accreditation, Staff & Educational Development Association, 2001 PG Certificate in Learning and Teaching in HE, Lancaster, 2000 MA Theology, Manchester, 2011 Employment: Senior Lecturer, School of Computing and Communications, Lancaster University, 2003 - present Research Fellow, Department of Computer Science & Mathematics, University of Stirling, 2003 – 2004 (in conjunction with Lancaster post) Lecturer, School of Computing and Communications, Lancaster University, 1999 – 2003 Visiting Lecturer: Institutt for informatikk, University of Tromsø, 2001 Professional Role Higher Education Academy Fellow, 2001 - present STEM Facilitator, 2019 - present My Role Senior Lecturer, School of Computing and Communications Computing At School - director of Lancaster's Computing At School Regional Centre prior to the transition into the National Centre for Computing Education (Autumn 2018) Instute of Coding - Theme 4 lead (Widening Participation) Athena Swan team member SCC management team member PhD Supervision Interests I am interested in supervising a range of postdoctoral research areas, including issues relating to: - Equality, Diversity and Inclusion in Computing and Technology - Computing Education - Human aspects of Computing, including values and environmental/ societal implications Please get in touch if you would like to discuss any of these areas with a view to PhD research. Show less Publications Projects Activities Research Groups Female Sense of Belonging in Computer Science Education: Cross-Strata Computer Science Projects 01/09/2020 → 31/07/2022 Research FAITH: Building Trust between Citizens, Local Authorities and Contractors 01/05/2011 → 28/02/2014 Research ICDL Family Fun Day Types of Public engagement and outreach - Festival/Exhibition \"Do we belong? An innovation workshop for fostering a sense of belonging in Computer Science education.\" workshop at UKICER 2021 Participation in workshop, seminar, course The UK and Ireland Computing Education Research Conference Participation in conference -Mixed Audience Morecambe Bay Curriculum SCC (Pervasive Systems) Back to listing Contact Details Department: Computing and Communications Office: C40, C - Floor, InfoLab21 TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 4096,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:08"
}