{
  "name": "M. Anton Ertl",
  "homepage": "http://www.complang.tuwien.ac.at/anton",
  "status": "success",
  "content": "Home Page of Anton Ertl M. Anton Ertl Contact info | Lehre | Research | Professional Activities | Other Stuff Anton Ertl anton@mips.complang.tuwien.ac.at Tel.: (+43-1) 58801 18515, Fax: (+43-1) 58801 18598 Institut für Computersprachen E185/1 Technische Universität Wien Argentinierstraße 8/4 A-1040 Wien Austria Sprechstunde Nach Vereinbarung (am besten per Email; schlagen Sie mir ein paar Termine vor, ich suche mir dann einen aus; 14h passt mir an den meisten Tagen gut). Contact info | Lehre | Research | Professional Activities | Other Stuff Lehre Effiziente Programme VU WS 2.0 Wissenschaftliche Methodik SE SS 2.0 Stackbasierte Sprachen (Forth, Postscript) VU WS 2.0 Seminar aus Programmiersprachen, SE SS 2.0 Wissenschaftliches Arbeiten SE 2.0 Übersetzerbau VL SS 3.0 Seminar für DiplomanInnen/Bachelorarbeit Praktika (vollendete Praktika) Diplomarbeiten Contact info | Lehre | Research | Professional Activities | Other Stuff Research My research interests are in the area of Compiler back-ends, in particular with respect to instruction-level parallelism Forth Interpreters Constraint Logic Programming Linux and OSs in general You can also read about these topics in my papers (BibTeX entries including abstracts). Most of the papers can be found in our group's papers page. Contact info | Lehre | Research | Professional Activities | Other Stuff Professional Activities MPLR 2024 General Chair EuroForth 2002, 2008, 2011 organizer EuroForth 2002-2023 PC chair ICOOOLPS 2009, 2010, 2011 PC member CC '08 PC member Forth-Tagung 2007 Organizer ESOP '06 PC member Interpreters, Virtual Machines and Emulators (IVME 03) PC chair PLDI '02 SRF (poster session) co-chair PLDI '99 program committee member Contact info | Lehre | Research | Professional Activities | Other Stuff Other stuff Bicycling/Radfahren und Verkehr Do recumbent bikes go mountains? Some data on how the number of meters to climb influences the average speed. Compute and display/print bicycle gear ratios; Example. Wie wirkt sich die Reifenbreite aus. V-Brakes und Rennrad-Bremshebel Radweg!, -streifen und Fahrbahn: Benutzungspflicht, Sicherheit, Radverkehrsförderung, Erfahrungsberichte, Photos. Sicherer durch Licht am Tag? Das Melkkuh-Märchen. Kosten und Finanzierung des Autoverkehrs in Österreich. Fahrradzukunft, eine online-Zeitschrift zu Fahrradthemen, gratis und werbefrei (ehrenamtlich produziert). Opinions on computing issues Don't use fake email addresses on Usenet! Common mistakes when writing email or postings. What is the PDF format good for? Nothing. Why I hate Motif Why I don't use Netscape What's wrong with synchronous metadata updates? See also File system crash consistency and performance and Ideas for a Log-Structured File System. And while you are at it, read NYKevin's succinct explanation of what's wrong with most file systems. The memory wall fallacy Peter Norvig's Teach Yourself Programming in Ten Years Janis Ian on music downloading: The Internet Debacle Linux games: First impressions of the Games Knoppix games. Other computing stuff Colors for xterm with white background What code is generated for global variables, big constants, and calls on various architectures? How much do unaligned loads and unaligned stores cost? A locale with _ (underscore) as thousands separator Zero-cycle constant adds on Golden/Raptor Cove Memory dependency microbenchmark Ryzen 3900x at 65W PPT Asus P12R-M/10G-2T experience Assembling span-dependent instructions A DRAM failure How I got xmms to work on Debian 11 External screen resolution on Ubuntu 21.04 Control-flow integrity implementations An example where avoiding undefined behaviour hurts performance Rockpro64 experiences PC Power supplies trip circuit breaker ASUS P10S-C/4L woes HP ProBook 430 G5 Mini-Review BTRFS and RAID1. A Ryzen-based server. Secrets of Athena Scrollbars (used in xterm etc.). Online LaTeX reference manual. Emacs reference card for Emacs 20 in ready-to-print three-column format. X-Mosaic stuff: Installation instructions for the source distribution and a Linux/Alpha binary. Some examples of data visualization in Postscript. Where do I find a Postscript viewer for my OS? Probably on the Ghostscript Home Page. Printing and Converting between Postscript and PDF. An experience report. How to concatenate PDFs with free software. Estimating programming language popularity by the number of Usenet postings. How much electricity does a Computer consume? CPU clock speed progress Silent 4K X-Terminal Digital video (DVI-D) on the Igel 532 X-Terminals. Viper Racing Car Setups How I installed Unreal Tournament on Linux. Doom benchmark results Some UT 2004 benchmark results Presenting game benchmark results SPEC CPU95 results for some x86s and Alphas with gcc under Linux. Our LaTeX benchmark and various results. Why \"switch\" is slow on the Pentium Instruction latencies and throughput for various IA-32 and AMD64 CPUs. Linux binary compatibility Linux Perfex, a tool for using performance counters similar to IRIX' perfex (requires the perfctr Linux kernel patch). How to build a Debian Linux Kernel with the perfctr patch. Switch the D-Cache to 16KB under Linx on the 21064A Unaligned access control utility for Linux-Alpha: uace Linux vs. Digital Unix on lmbench memory latency measurements Bplat memory latency benchmark. A test whether hard disks perform writes in-order. Recover from a RAID1 double-disk failure. Changing the hard disk on an ibook G4 12\" 1GHz My bibliography on programming languages, compilers, computer architecture, etc. Search form currently for Google Web and for Usenet Message-Ids through Google Groups. Verschiedenes/Misc Erderwärmung und Überbevölkerung Aufbau wissenschaftlicher Artikel (Zielpublikum: Seminarteilnehmer, Diplomanden); Postscript-Version. Plan TU Wien und Umgebung. Use name-based citation labels, e.g., \\bibliographystyle{alpha}. Konzert-Tagebuch. Photographs, mainly from journeys. Kameras: Erfahrungen mit der Ricoh Caplio GX100 (Kompaktkamera). Testbilder Samsung S760. Entrauschen durch Verkleinern. Objektive von Kompaktkameras. Review: Sandisk Sansa Clip 8GB Local/Internal web pages Links to pages I found interesting Contact info | Lehre | Research | Professional Activities | Other Stuff Best viewed with any browser HTML 2.0",
  "content_length": 6272,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:13"
}