{
  "name": "M. Birna van Riemsdijk",
  "homepage": "https://research.utwente.nl/en/persons/maria-birna-van-riemsdijk",
  "status": "success",
  "content": "Maria Birna van Riemsdijk - University of Twente Research Information Contact Expert View Scopus Profile Maria Birna van Riemsdijk dr. Associate Professor, Human Media InteractionAssociate Professor, Digital Society Institute https://orcid.org/0000-0001-9089-5271 20182025 Research activity per year Personal profile Personal profileDr. M. Birna van Riemsdijk is associate professor Intimate Computing in the Human-Media Interaction group at University of Twente, The Netherlands. Her research mission is to develop theory and software for creating intimate technologies that take into account our human vulnerability in supporting us in our daily lives: intimate computing is computing with vulnerability. For her research she was awarded a Vidi personal grant and the Dutch Prize for Research in ICT 2014. She serves on the editorial board of the Journal of Autonomous Agents and Multiagent Systems (JAAMAS) and was elected member (2012-2018) of the board of the International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS). She is member of the board of 4TU.NIRICT, which comprises all ICT research of the four universities of technology of the Netherlands. Artificial Intelligence ExpertKnowledge Representation and ReasoningAutonomous Agent SystemsHuman AI InteractionEthical Dimensions of AISocietal Context of AIHealth and Well-beingRobotics Expert KeywordsHealthcare and Well-beingSocial and Daily Life EthicsExoskeletonsInteraction Control Fingerprint Dive into the research topics where Maria Birna van Riemsdijk is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Social Situation Computer Science 100% User Computer Science 99% Situation Awareness Computer Science 50% Decision Making Psychology 46% Models Computer Science 43% Formal Framework Computer Science 33% Situation Social Sciences 33% Support Social Sciences 33% View full fingerprint Research output Research output per year 2018 2020 2021 2022 2023 2024 2025 2025 10 Conference contribution 8 Article 3 Paper 2 Discussion paper 4 More 2 Preprint 1 Abstract 1 Conference article Research output per year Research output per year A Social Disruptiveness-Based Approach to AI Governance: Complementing the Risk-Based Approach of the AI ActMarchiori, S., Hopster, J. K. G., Puzio, A., Riemsdijk, M. B. V., Kraaijeveld, S. R., Lundgren, B., Viehoff, J. & Frank, L. E., Oct 2025, In: Science and engineering ethics. 31, 5, 15 p., 25.Research output: Contribution to journal › Article › Academic › peer-review Open AccessFile Artificial Intelligence Governance 100% Artificial Intelligence 100% Artificial Intelligence Act 100% Law and Ethics 16% Paying Attention 16% Three Perspectives on Human Vulnerability: Enriching Responsible Computing Design Processesvan Grunsven, J., Jacobs, N., Kamphorst, B., Honauer, M., van Balen, B., Bollen, C., Dennis, M., Puzio, A. & van Riemsdijk, M. B., 25 Jul 2025, (E-pub ahead of print/First online) In: ACM Journal on Responsible Computing. 19 p.Research output: Contribution to journal › Article › Academic › peer-review Open AccessFile Philosophical Tradition 100% Disability Study 100% 7 Downloads (Pure) Why don't you do what you said you would? Conversational strategies for agents to understand users' reasons in supporting behaviorChen, P. Y., Birna van Riemsdijk, M., Heylen, D. K. J., Jonker, C. M. & Tielman, M. L., 17 Apr 2025, (E-pub ahead of print/First online) In: Behaviour and Information Technology. 20 p.Research output: Contribution to journal › Article › Academic › peer-review Open AccessFile Assistive Technology 100% Conscious Emotion 100% Open-Ended Question 100% 22 Downloads (Pure) Defining an Adaptable Framework for Behaviour Support Agents in Default LogicWolff, J., de Boer, V., Heylen, D. & van Riemsdijk, M. B., 2024, In: CEUR workshop proceedings. 3835, p. 72-82 11 p.Research output: Contribution to journal › Conference article › Academic › peer-review Open AccessFile Formal Framework 100% Agent Framework 100% Incomplete Knowledge 100% User Requirement 100% 27 Downloads (Pure) Expert Insights on Conversational AI Systems as an Information Intermediary for Patients and Healthcare Providers for Diabetes Lifestyle ChangeChen, P.-Y., van Gent, S., van Riemsdijk, M. B., Tielman, M. & Schoonderwoerd, T., 2024, The Adjunct Proceedings of the 19th International Conference on Persuasive Technology (PT’24): 1st International Workshop on Algorithmic Behavior Change Support (ALBECS’24). Oyibo, K., Xu, W. & Vlahu-Gjorgievska, E. (eds.). Aachen, Germany: CEUR, p. 8-20 13 p. (CEUR Workshop Proceedings; vol. 3728).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile Health Care Personnel 100% Artificial Intelligence 100% Lifestyle Modification 100% Non Insulin Dependent Diabetes Mellitus 20% Patient Care 20% 1 Citation (Scopus) 173 Downloads (Pure) View all 27 research outputs Datasets User study on the psychological characteristics of social situationsKola, I. (Creator), Tielman, M. (Contributor), Jonker, C. M. (Contributor) & van Riemsdijk, M. B. (Contributor), 4TU.Centre for Research Data, 1 Jan 2021DOI: 10.4121/12867041, https://data.4tu.nl/articles/_/12867041Dataset Dataset belonging to the paper: What can I do to help you?Tielman, M. (Creator), van Riemsdijk, M. B. (Creator) & Winikoff, M. (Creator), 4TU.Centre for Research Data, 24 Apr 2023DOI: 10.4121/22099832, https://data.4tu.nl/datasets/775c92a7-68ed-4b36-a851-e909e73bd3c6Dataset Data underlying the Experiment on predicting priority of Social Situations for Support AgentsTielman, M. L. (Creator), van Riemsdijk, M. B. (Contributor), Jonker, C. M. (Contributor) & Kola, I. (Contributor), 4TU.Centre for Research Data, 1 Jan 2021DOI: 10.4121/13176923, https://data.4tu.nl/articles/dataset/Data_underlying_the_Experiment_on_predicting_priority_of_Social_Situations_for_Support_Agents/13176923Dataset Acquiring Semantic Knowledge for User Model Updates via Human-Agent Alignment Dialogues: Scenarios & DialoguesChen, P.-Y. (Creator), Tielman, M. (Supervisor), van Riemsdijk, M. B. (Supervisor), Jonker, C. M. (Supervisor) & Heylen, D. K. J. (Supervisor), 4TU.Centre for Research Data, 13 Apr 2024DOI: 10.4121/b7a321df-640a-483d-8c32-a18fe21e7204, https://doi.org/10.4121/b7a321df-640a-483d-8c32-a18fe21e7204.v1 and 3 more links, https://doi.org/10.4121/b7a321df-640a-483d-8c32-a18fe21e7204.v2, https://doi.org/10.4121/b7a321df-640a-483d-8c32-a18fe21e7204.v3, https://doi.org/10.4121/b7a321df-640a-483d-8c32-a18fe21e7204.v4 (show fewer)Dataset Prizes 2020 IEEE Computer best paper awardAkata, Z. (Recipient), Balliet, D. (Recipient), de Rijke, M. (Recipient), Dignum, F. (Recipient), Dignum, V. (Recipient), Eiben, A. E. (Recipient), Fokkens, A. (Recipient), Grossi, D. (Recipient), Hindriks, K. (Recipient), Hoos, H. (Recipient), Hung, H. (Recipient), Jonker, C. (Recipient), Monz, C. (Recipient), Neerincx, M. (Recipient), Oliehoek, F. (Recipient), Prakken, H. (Recipient), Schlobach, S. (Recipient), van der Gaag, L. (Recipient), van Harmelen, F. (Recipient), van Hoof, H. (Recipient), van Riemsdijk, M. B. (Recipient), van Wynsberghe, A. A. L. (Recipient), Verbrugge, R. (Recipient), Verheij, B. (Recipient), Vossen, P. (Recipient) & Welling, M. (Recipient), 24 Jan 2022Prize Intellect 100% Research Agenda 100% Activities Activities per year 2021 2021 2022 2022 2 Organising a conference, workshop, ... Activities per year Being human in the digital society: on technology, norms and us 2022van Riemsdijk, M. B. (Chair) & Tielman, M. (Organiser)21 Nov 2022Activity: Participating in or organising an event › Organising a conference, workshop, ... 4TU Virtual Symposium on Vulnerability and Human-Computer Interaction 2021van Waterschoot, J. B. (Chair), Lee, M. (Organiser), van Maris, A. (Organiser), Kola, I. (Organiser), van Riemsdijk, M. B. (Member of programme committee), Frank, L. E. (Member of programme committee), Nyholm, S. (Member of programme committee), Siebert, L. (Member of programme committee) & Liberati, N. (Member of programme committee)2 Dec 2021Activity: Participating in or organising an event › Organising a conference, workshop, ... Press/Media In gesprek met machines: dr. Birna van Riemsdijk over machine learning en generatieve AIvan Riemsdijk, M. B.20/10/231 Media contributionPress/Media: Expert Comment In gesprek met machinesvan Riemsdijk, M. B.19/12/221 Media contributionPress/Media: Research Juist ik hou tech ver bij mijn kinderen vandaanvan Riemsdijk, M. B.10/11/221 Media contributionPress/Media: Expert Comment",
  "content_length": 8638,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:14"
}