{
  "name": "M. Eduard Gröller",
  "homepage": "https://www.cg.tuwien.ac.at/staff/EduardGroeller.html",
  "status": "success",
  "content": "Eduard Gröller | TU Wien – Research Unit of Computer Graphics Skip to main content Eduard Gröller Details TitleUniv.Prof. Dipl.-Ing. Dr.techn. Function: Professor Workgroup Visualization Group RoomHC0501 Links Phone+43-1-58801-18682 E-Mailgroeller [at] cg.tuwien.ac.at TISS Business card ORCID iD 0000-0002-8569-4149 WikidataQ1288515 Function Professor of Visualization at the Vienna University of Technology Head of the Research Unit of Computer Graphics Head of the Visualization Working Group Key Researcher at the VRVis Adjunct Professor of Computer Science at the University of Bergen, Norway Head of the OCG \"Arbeitskreis Graphische Datenverarbeitung\" Lecture Introduction to Visual Computing Lecture Visualization 1 Lecture Visualization 2 Seminars Project in Visual Computing 1 Project in Visual Computing 2 Supervision of Diploma Theses and Dissertations Research work Current research projects Publications [dplp] [Google Scholar] Interests Visual Computing Scientific Visualization Volume Visualization (Interactive Medical Visualization) Information Visualization Visual Analytics Computer Graphics Hobbies Literature, Hiking, Skiing, Table Tennis, Jax Short Bio Eduard Gröller (http://www.cg.tuwien.ac.at/staff/EduardGroeller.html) is Full Professor at the Institute of Visual Computing & Human-Centered Technology (VC&HCT), TU Wien. In 1993 he received his PhD from the same university. His research interests include computer graphics, visualization, and visual computing. He is heading the Research Unit Computer Graphics and the Visualization Group at VC&HCT. The group performs basic and applied research projects in all areas of visualization (http://www.cg.tuwien.ac.at/research/vis/). Dr. Gröller has given lecture series on visualization at various other universities (Tübingen, Graz, Praha, Bahia Blanca, Magdeburg, Bergen). He is a scientific proponent and key researcher of the VRVis research center (http://www.vrvis.at/). The center performs applied research in visualization, rendering, and visual analysis. Dr. Gröller is adjunct professor of computer science at the University of Bergen, Norway (since 2005). He co-authored more than 300 scientific publications and acted as a reviewer for numerous conferences and journals in the field. He also has served and serves on various program and paper committees. Examples include Computers&Graphics, IEEE Transactions on Visualization and Graphics, EuroVis Conference, IEEE Visualization Conference, Eurographics Conference. He has been paper co-chair of Volume Graphics 2005, IEEE Visualization 2005 and 2006, and Eurographics 2006. He has been co-chair of the VisSym 1999 Symposium, the Eurographics 2011 Conference, and the EuroVis 2012 Conference. Dr. Gröller took on the task of area co-chair for IEEE Visualization 2021 and 2022. He has been Chief Editor of the Journal Computer Graphics Forum (http://wileyonlinelibrary.com/journal/cgf) in the period 2008-2011. Dr. Gröller became a fellow of the Eurographics Association in 2009. He is the recipient of the Eurographics 2015 Outstanding Technical Contributions Award and of the IEEE VGTC 2019 Technical Achievement Award. Dr. Gröller is head of the working group on computer graphics of the Austrian Computer Society and member of IEEE Computer Society, ACM (Association of Computing Machinery), GI (Gesellschaft für Informatik), OCG (Austrian Computer Society). Research Keywords Visualisation Uncertainty visualization Visualization of Dynamical Systems Visual Analytics Information Visualization Computer Graphics Medical Visualization Dynamic Systems Rendering Visual Computing Scientific Visualization Awards IEEE VGTC Visualization Technical Achievement Award2019 / IEEE VGTC / United States of America / WebsiteEurographics 2015 Outstanding Technical Contributions Award2014 / Eurographics / Switzerland / WebsiteFellow of the Eurographics Association2008 / Eurographics / Switzerland / WebsiteWürdigungspreis des Bundesministers für Wissenschaft und Forschung1992 / Bundesministerien Attachments Scientific and Teaching Activities (Complete List) News Prof. Eduard Gröller - 2025 VGTC Visualization Lifetime Achievement Award posted on 11. Nov 2025 WWTF ICT22 Call – computer graphics receives 2 new projects posted on 2. Jan 2023 EG VCBM 2022 AWARDSposted on 30. Sep 2022 Eduard Gröller erhielt den IEEE VGTC Technical Achievement Award und wurde in die IEEE Visualization Academy aufgenommenposted on 30. Oct 2019 IEEE VIS Conference 2017: Best Paper Honorable Mention Awardposted on 11. Oct 2017 more Topics for Projects and Theses NEW: When AI Leads and Users FollowBA; 1-2 persons NEW: Enhancing Accessibility in Dashboards using MLLMsDA; 1 person NEW: Data PhysicalizationBA; 1-2 persons Student Projects and Master Theses at Siemens HealthineersBA, PR, DA; 1-3 persons Research Projects Visual Analytics und Visualisierung Jan 2025 - Dec 2025 Visual Computing-Grundlagenforschung Jan 2025 - Dec 2028 High-performance triangle-mesh streaming for unbounded datasets. Jan 2025 - Jun 2026 Climate-sensitive Adaptive Planning for Shaping Resilient Cities Jan 2024 - Dec 2027 Instant Visualization and Interaction for Large Point Clouds Jul 2023 - Jul 2026 See current and former projects of this person Courses in the current semester Ausgewählte Kapitel der Computergraphik2025WVU 186.167: TISS | History Forschungsseminar für DissertantInnen (Methodenseminar)2025WSE 193.156: TISS | History Project in Computer Science 12025WPR 193.117: TISS | History Project in Computer Science 22025WPR 193.118: TISS | History Project in Visual Computing 12025WPR 193.023: Course page | TISS | TUWEL | History Project in Visual Computing 22025WPR 193.024: Course page | TISS | TUWEL | History Projekt aus Media and Human Centered Computing 22025WPR 193.022: TISS | TUWEL | History Projekt Medizinische Informatik2025WPR 193.025: Course page | TISS | TUWEL | History Seminar aus Visualisierungplanned for allSE 186.046: Course page | TISS | History Seminar für Diplomand_innen für Visual Computing2025WSE 180.774: Course page | TISS | History Visualisierung2025WVU 193.166: TISS | TUWEL | History Wissenschaftliches Arbeiten2025WSE 193.052: Course page | TISS | TUWEL | History Wissenschaftliches Publizieren 12025WPR 186.185: TISS | History Publications 565 Publications found: Image Bib Reference Publication Type 2025 Andreas Walch, Attila Szabo, Harald Steinlechner, Thomas Ortner, Eduard Gröller, Johanna Schmidt BEMTrace: Visualization-driven approach for deriving Building Energy Models from BIM IEEE Transactions on Visualization and Computer Graphics, 31(1):240-250, January 2025. Journal Paper (without talk) Vaishali Dhanoa, Andreas Hinterreiter, Vanessa Fediuk, Niklas Elmqvist, Eduard Gröller, Marc Streit D-Tour: semi-automatic generation of interactive guided tours for visualization dashboard onboarding IEEE Transactions on Visualization and Computer Graphics, 31(1):721-731, January 2025. [paper] Journal Paper (without talk) Lorenzo Amabili, Eduard Gröller, Renata Raidou Leveraging Popular Board Games to Teach Data Visualization In Visgames 2025: EuroVis Workshop on Visualization Play, Games, and Activities. 2025. [paper] Conference Paper 2024 Eduard Gröller Certain Uncertainties in Visual Data Science, 10. December 2024, Passau Invited Talk Katarí­na Furmanová, Barbora Kozlikova, Thomas Höllt, Eduard Gröller, Bernhard Preim, Renata Raidou BioMedical Visualization : Past Work, Current Trends, and Open Challenges. Springer Nature, October 2024. Published Book Anja Heim, Alexander Gall, Manuela Waldner, Eduard Gröller, Christoph Heinzl AccuStripes: Visual exploration and comparison of univariate data distributions using color and binning COMPUTERS & GRAPHICS-UK, 119, April 2024. [paper] Journal Paper (without talk) Lukas Herzberger, Markus Hadwiger, Robert Krüger, Peter K Sorger, Hanspeter Pfister, Eduard Gröller, Johanna Beyer Residency Octree: a hybrid approach for scalable web-based multi-volume rendering IEEE Transactions on Visualization and Computer Graphics, 30(1):1380-1390, January 2024. [paper] Journal Paper with Conference Talk Lorenzo Amabili, Eduard Gröller, Renata Raidou Show Me the GIFference! Using data-GIFs as Educational Tools In Computer Science Research Notes: CSRN 3401: WSCG 2024: Proceedings, pages 57-66. 2024. Conference Paper Silvana Rauer-Zechmeister, Daniel Cornel, Bernhard Sadransky, Zsolt Horvath, Artem Konev, Andreas Buttinger-Kreuzhuber, Raimund Heidrich, Günter Blöschl, Eduard Gröller, Jürgen Waser HORA 3D: Personalized Flood Risk Visualization as an Interactive Web Service Computer Graphics Forum, 43(3), 2024. Journal Paper (without talk) Yuki Tanaka, Angeliki Grammatikaki, Henry Ehlers, Renata Raidou, Eduard Gröller, Takayuki Itoh Visualization of Relationships between Precipitation and River Water Levels In 2024 28th International Conference Information Visualisation (IV), pages 58-63. 2024. Conference Paper 2023 Eduard Gröller Scalable Interactive Visual Analysis Through Storytelling, 29. November 2023, St. Pölten Invited Talk Eduard Gröller Scalable Interactive Visual Analysis, 22. September 2023, Stuttgart Invited Talk Eduard Gröller Scalable Interactive Visual Analysis, 22. July 2023, Chongqing Invited Talk Eduard Gröller Interactive Visual Data Analysis'How to do a Successful PhD (in Visual Computing)', 18. July 2023, Peking Invited Talk Attila Szabo, Georg Haaser, Harald Steinlechner, Andreas Walch, Stefan Maierhofer, Thomas Ortner, Eduard Gröller Feature-assisted interactive geometry reconstruction in 3D point clouds using incremental region growing COMPUTERS & GRAPHICS-UK, 111:213-224, April 2023. Journal Paper (without talk) Maath Musleh, Ludvig Paul Muren, Laura Toussaint, Anne Vestergaard, Eduard Gröller, Renata Raidou Uncertainty guidance in proton therapy planning visualization Computers and Graphics, 111:166-179, February 2023. [Graphical Abstract] Journal Paper with Conference Talk Eduard Gröller The Future of Scalable Interactive Visual Analysis",
  "content_length": 18060,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:17"
}