{
  "name": "M. Frans Kaashoek",
  "homepage": "https://pdos.csail.mit.edu/archive/kaashoek",
  "status": "success",
  "content": "M. Frans Kaashoek M. Frans Kaashoek Frans Kaashoek is the Charles Piper Professor in MIT's Department of Electrical Engineering and Computer Science and a member of the MIT Computer Science and Artificial Intelligence Laboratory since January 1993. Before joining MIT, he was a student at the department of Computer Science (afdeling Informatica) at the Vrije Universiteit in Amsterdam, the Netherlands. He received a Ph.D degree ('92) from the Vrije Universiteit for his thesis Group communication in distributed computer systems, under the guidance of Andy Tanenbaum. Frans's research interest is computer systems: operating systems, networking, programming languages, compilers, and computer architecture for distributed, mobile, and parallel systems. The home page for the Parallel and Distributed Operating Systems group describes current projects. In 1998 Frans cofounded Sightpath Inc, which was acquired by Cisco Systems in 2000. He also helped found Mazu Networks Inc and served on its board until Riverbed Technology Inc acquired Mazu in 2009. Awards and Honors: NSF national young investigator award (1994) MIT EECS Spira teaching award (1997) MIT IEEE best undergraduate advisor award (2000) The inaugural ACM SIGOPS Mark Weiser Award (2001) ACM fellow (2004) Member of the National Academy of Engineering (2006) ACM-Infosys Foundation Award (2010) Member of the National Academy of Arts and Sciences (2012) Papers: Prior to joining MIT PDOS publications Books: Principles of Computer System Design: An Introduction, J.H. Saltzer and M.F. Kaashoek, 2009, ISBN: 978-01-2374957-4. xv6 and its commentary, R. Cox, M. F. Kaashoek, R.T. Morris (draft). Classes: 6.033: Computer system engineering (Spring '94-'07, '11) 6.097: Operating system engineering (Fall '02) (Now 6.828) 6.828: Operating system engineering (Fall '03-Fall '06, '09, '10) 6.894: Distributed operating systems engineering (Fall '00) (Now 6.824). 6.824: Distributed operating systems engineering (Fall '07, Spring '09-'10) 6.173: Multicore Systems Laboratory (Fall 2010) 6.853 Computer Systems (Fall '96) 6.035: Computer language engineering (Fall '94, Fall '93) If you are interested in internships or summer research positions, we don't have them for non-MIT students. If you are interested in pursuing a Ph.D., please see the EECS graduate program page. Prof. Frans Kaashoek M.I.T. CSAIL, the Stata Center Email: kaashoek@csail.mit.edu Mail: 77 Massachusetts Avenue, 32-G992 Tel: +1(617)253-7149 Location: 32 Vassar Street Cambridge, MA 02139 WWW: https://pdos.csail.mit.edu/~kaashoek",
  "content_length": 2564,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:18"
}