{
  "name": "M. Hadi Amini",
  "homepage": "https://sites.google.com/site/hadiaminihomepage/home",
  "status": "success",
  "content": "M. Hadi AminiSearch this siteEmbedded FilesSkip to main contentSkip to navigationAssociate Professor, Knight Foundation School of Computing and Information Sciences, Florida International University Director, Security, Optimization, and Learning for InterDependent networks laboratory (solid lab)Associate Director, National Center for Transportation Cybersecurity and Resiliency (TraCR), Supported by the U.S. DOTPhone: (305) 348-9936Email: [last-name] at]cs[dot]fiu[dot]edu  Hello! My name is M. Hadi Amini, and I am currently an Associate Professor at the Knight Foundation School of Computing and Information Sciences, Florida International University. I am also the Founding Director of Security, Optimization, and Learning for InterDependent networks laboratory (solid lab) at Florida International University. I received my PhD from Carnegie Mellon University in 2019, where I received my M.Sc. in 2015. I am a Senior Member of IEEE and Life Member of the IEEE-Eta Kappa Nu (IEEE-HKN) Honor society.  I am passionate about interdisciplinary research to bridge the gap between machine learning/optimization theory and its application to interdependent networks. My research interests span distributed computing, federated learning, distributed optimization/learning algorithms, interdependent networks, and cyber-physical-social resilience and security. My research at FIU, with my Ph.D. students as the lead author, has received one Best Conference Paper award for the paper on distributed sensing for federated learning and one Best Journal Paper award for the paper on topological data analysis for network resilience. I have developed three new courses on optimization for computing, distributed machine learning, and linear algebra for computer science since joining FIU. Selected Honors and Awards:FIU Knight Foundation School of Computing and Information Sciences Excellence in Applied Research Award, 2025-2026 Academic Year2025 Rising Star, Academy of Science, Engineering and Medicine of Florida, For pioneering research in bridging the gap between computing sciences (learning and optimization) and cyber-physical critical infrastructures security and resilience.2025 IEEE Big Data Security Junior Research Award for contributions to Big Data Security in Cyber-Physical SystemsFIU College of Engineering and Computing Faculty Excellence in Mentorship Award, 2025FIU Top Scholar Award, Research and Creative Activities, Junior Faculty with Significant Grants (Sciences), 2024IEEE Senior Member, 2023FIU Faculty Excellence in Teaching Award, 2023Rewarding Excellence in Teaching Incentives (RETI) Award, Florida International University, 2022 Best Journal Paper Award of \"Springer Nature Operations Research Forum Journal\", 2021Excellence in Teaching Award from FIU School of Computing and Information Sciences, 2020Best Paper Award of \"Annual Conf. on Computational Science & Computational Intelligence\" (CSCI'19), 2019Best Reviewer Award of \"IEEE Transactions on Smart Grid\", 2019    For more details please refer to the following links:List of publicationsLab homepageNewsBiographyFIU ProfileGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3158,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:18"
}