{
  "name": "M. L. Chaudhry 0001",
  "homepage": "https://www.rmc-cmr.ca/en/mathematics-and-computer-science/dr-mohan-chaudhry",
  "status": "success",
  "content": "Dr. Mohan Chaudhry Skip to main content Skip to \"About this site\" Dr. Mohan Chaudhry Dr. Mohan Chaudhry Office: Girouard building, room 317 Telephone: (613) 541-6000 ext 6460 Fax: (613) 541-6584 E-mail: Mohan.Chaudhry@rmc-cmr.ca Department of Mathematics and Computer Science College Address Royal Military College of CanadaPO Box 17000, Station ForcesKingston, Ontario, CANADAK7K 7B4 Research Interests Queueing theory: bulk and nonbulk queues; discrete-time queues. Rootfinding of polynomials and transcedental equations, eigenvalues. Short Biography After receiving his Ph.D degree from Kurukshetra University, Dr. Mohan Chaudhry moved to Canada as a senior postdoctoral fellow at the University of Toronto before moving to the Royal Military College of Canada in 1967. Since 1967, he has been in the department of Mathematics and Computer Science at the Royal Military College of Canada. He currently holds the position of a professor in the Department of Mathematics and Computer Science. He severed as the Head of the Department from 1990 to 1991, and is currently the chair of degree in Mathematics and Business Administration and the President of Graduate Committee of the Department. He has been an invited professor at George Mason University, USA in 1988; a distinguished professor both at Korea Advanced Institute of Science and Technology in 2001, Ghent University, Belgium in 2004. In addition to being a member, Dr. Chaudhry has held and continues to hold position as an associate editor for several Operational Research Journals. He organizes and chairs sessions for various organizations. In 2003, Dr. Chaudhry's contributions were recognized by the Canadian Operational Research Society that gave him the award of Merit. In 2005, he was given the service award by the same society. Also, in 2005, his paper \"An invariance relation and a unified method to derive stationary queue lengths\" was adjudged the best paper of the year (in Industrial Engineering) by the Korean Federation of Science and Technology. Teaching Graduate level courses are given in the following areas: MAE533 : Probability and Discrete-time Processes MAE535 : Stochastic Processes-I MAE537 : Stochastic Processes-II Events, organizations Events, organizations Memberships held in scholarly or professional societies Full Member, Canadian Operational Research Society Full Member, INFORMS Member, Indian Society for Probability and Statistics Editors Ex-associate Editor, Journal of Management Science and Applied Cybernetics. Ex-associate Editor, Information Systems and Operational Research. Ex-associate Editor, Queueing Systems ‑ Theory and Applications. Ex‑Fellow, American Association for the Advancement of Science. Member, Editorial Board of Computers and Operations Research. Associate Editor, International Journal of Mathematical and Statistical Sciences (IJMS). Member, International Program Committee, ISSAT International Conference on Reliability and Quality in Design. Specialist, University and Polytechnic Grants Committee, Hong Kong. Chairmanships at Conferences and Symposia Co‑ordinating chairman, 40th Ontario Mathematics Meeting, of Conferences, October 1976. Co‑ordinating chairman, Joint 62nd Ontario Mathematics Meeting and 17e Collège des Mathématiciens du Québec, April 1982. Chairman of a session at the V European congress on operational research, July 11‑14,1982. Chairman of a session at the VII European congress on operational research, June 16‑20, 1985. Chairman of a session at the TIMS XXVII conference, July 20‑23, 1986. Chairman of a session at the TIMS/ORSA Meeting, May 7‑9, 1990. Chairman of a session at the CORS conference, May 22‑25, 1990. Chairman of a session at the ORSA/TIMS Meeting, Oct 29‑31, 1990. Organized and chaired a session at the CORS 93 conference, Halifax, May 25-27, 1993. An invitation to organize a session at the 1994 ISSAT International Conference on Reliability and Quality in Design was rejected. Invitation to organize a session for the Spring 1995 Los Angeles TIMS/ORJA Meeting was rejected. Chaired a session at the CORS'94 Conference, May 29-June 1, 1994. Organized a session for the INFORMS Singapore Conference on the topic: \"On discrete-time queues,\" Singapore, 28 June, 1995. Invitation to attend and give a talk at the National Symposium: Statistics and Operations Research, 30-31 December 1995, Gauhati University, India, was rejected. Organized and chaired a session for the International Federation of Opl. Res. Societies, 8-12 July, 1996. Also presented a paper titled: Queue-length and waiting-time distributions of discrete-time GIX/Geom/1 queueing systems with early and late arrivals. Organized and chaired an invited session on applied probability at the CORS and IEEE Conference in Ottawa, May 26-28, 1997. Organized and chaired two invited sessions on (1) \"Queueing with finite waiting space\" and (2) \"Applied Probability\" at the INFORMS XXXIV International Conference and EURO XV, July 14-17, 1997. Organized and chaired an invited session on Applied Probability at the APORS Conference, Melbourne, Nov. 30 - Dec 4, 1997. Organized and chaired an invited session on applied probability at the International Conference held at McMaster University, 10-11 Oct, 1998. Organized and chaired an invited session on the topic, \"Computational problems in applied probability,\" August 16-20, 1999. Also, gave a talk on the topic, \" On steady-state distributions of numbers in the queue GeomX/G/1,\" 15th Triennial Conference of IFORS, Beijing. Acted as a member of the Advisory Committee for the International Conference on Stochastic Processes and their Applications, Cochin, 17-20 Dec 1999. Chaired a session at the International Conference on Recent Advances in Mathematical Sciences, Kharagpur, 20-22 Dec 2000. Organized and chaired a session at the INFORMS International Conference, Hawaii, June 16-20, 2001. Organized and presided over the Canadian Operational Research Society (CORS) conference March 22, 2004 (Local Section): People from RMC, Base and Queen's University participated. Venue: RMC Mess. Software packages QROOT: root-finding software package. QPACK: queuing models software packages. Selected Publications Date modified: 2022-01-19",
  "content_length": 6220,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:21"
}