{
  "name": "M. Masadeh Bani Yassein",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=masadeh",
  "status": "success",
  "content": "Muneer Oqlah Bani Yasin × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content muneer oqlah bani yasin • Cyber Security Department - Faculty Member • Department of Computer Science - Faculty Member • Faculty Of Computer And Information Technology - Dean 20000 A1L2 Department of Computer Science masadeh@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from Unversity of Glasgow, 2007 Msc. of Computer Science from Al Albayt University, 2001 Bsc. of COMPUTER SCIENCE from Yarmouk University, 1986 Publications Muneer Bani Yassein, Sanabel Fathi Nimer, Ahmed Y. Al-Dubai, \"A new dynamic counter-based broadcasting scheme for Mobile Ad hoc Networks,\" ,\" Journal of Simulation Modelling Practice and Theory, vol. 19, no. 1, pp. 553-563, 2011 Muneer Bani Yassein, M. Bani Khalaf  and A. Y. Al-Dubai, \"A performance comparison of smart probabilistic broadcasting of ad hoc distance vector (AODV),\" ,\" International Journal of Supercomputing, vol. 53, no. 1, pp. 196-2011, 2010 Muneer Bani Yassein, Mohamed Al-Maolegi, Yaser Khamayseh, Dragana Krstic, Shadi Aljawarneh, \"Smart System for Busy Roads Using Short Range Wireless Technologies,\" INTERNATIONAL JOURNAL OF MATHEMATICS AND COMPUTERS IN SIMULATION , vol. 9, no. , pp. 146-152, 2015 Dragana S. Krsti, Suad Suljovi, Mihajlo  Stefanovi, Muneer Masadeh Bani Yassein, Danijela Aleksi?, \"Level Crossing Rate of SC Receiver over Gamma Shadowed Rician Multipath Fading Environment,\" INTERNATIONAL JOURNAL OF COMMUNICATIONS , vol. 9, no. , pp. 19-27, 2015 Mohammad Al-Rousan,Muneer Bani Yassein,  Ahmed Al-Dubai,  Barraq Ghaleb, Ibrahim Mahmoud, \"A Novel Situation Specific Network Security for Wireless Sensor Networks ,\" Sensors & Transducers, vol. 186, no. 3, pp. 1-10, 2015 Yaser Khamayseh,  Wail Mardini, Shadi Aljawarneh,  Muneer Bani Yassein, , \"Integration of Wireless Technologies in Smart University Campus Environment: Framework Architecture,\" International Journal of Information and Communication Technology Education (IJICTE), vol. 11, no. 1, pp. 60-74, 2015 Athina Bourdena, Constandinos X Mavromoustakis, George Kormentzas, Evangelos Pallis, George Mastorakis, Muneer Bani Yassein, \"A Resource Intensive Traffic-Aware Scheme using Energy-Aware Routing in Cognitive Radio Networks ,\" Future Generation Computer Systems, vol. 39, no. , pp. 16-28, 2014 Wail Mardini , Muneer Bani Yassein, Yaser Khamayseh, and Barraq A. Ghaleb, \"Rotated Hybrid, Energy-Efficient and Distributed (R-HEED) Clustering Protocol in WSN,\" TRANSACTIONS on COMMUNICATIONS, vol. 13, no. , pp. 275-290, 2014 Marios Charalambous, Constandinos X. Mavromoustakis, George C. Violaris and Muneer Bani Yassein, \"On the Mobility Scenario Implementation Using a Graphical P2P Discrete Event Simulator for the Bittorrent Protoco,\" Journal of Algorithms & Computational Technology V, vol. 7, no. 4, pp. 449-487, 2013 Muneer Bani Yassein, Balqees Abd Hameed, Wail Mardini, Yaser Khamayseh , \"Performance Analysis of Adjusted Counter Based Broadcasting in Mobile Ad Hoc Networks,\" Communications and Network, vol. 5, no. 4, pp. 353-359, 2013 Yaser M Khamayseh, Muneer BaniYassein, Mariam AbdAlghani, Constandinos X Mavromoustakis, \"Network Size Estimation in VANETs,\" Network Protocols and Algorithms, vol. 5, no. 3, pp. 136-152, 2013 Sanaa A Alwidian, Ismail M Ababneh, Muneer O Bani Yassein, \"Neighborhood-based Route Discovery Protocols for Mobile Ad hoc Networks,\" International Journal of Mobile Computing and Multimedia Communications (IJMCMC), vol. 5, no. 3, pp. 68-87, 2013 Muneer Bani Yassein, Yaser Khamayseh, Al-Ameri, Wail E. Mardini, \"Routing Discovery Algorithm Using Parallel Chase Packe,\" International Journal of Advanced Computer Science and Applications, vol. 4, no. 3, pp. 104-109, 2013 Muneer O Bani Yassein, Yaser M Khamayseh, Ali M Hatamleh, \"Intelligent Randomize Round Robin for Cloud Computing,\" International Journal of Cloud Applications and Computing, vol. 3, no. 1, pp. 27-33, 2013 Muneer Bani Yassein, Zeinab Jaradat, Neveen Hijazi, Constandinos Mavromoustakis, \"New Load Balancing Algorithm for LEACH Protocol (F-VCH LEACH),\" Sensors & Transducers, vol. 145, no. 10, pp. 172-182, 2012 Muneer Bani Yassein, N Alslaity, A Alwidian, \"An Efficient Overhead-Aware Leader Election Algorithm for Distributed Systems,\" International Journal of Computer Applications (0975 ? 8887) , vol. 49, no. 6, pp. 10-15, 2012 Yaser khamayseh, Ruba Al-Salah, Muneer Bani Yassein, \"Malicious Nodes Detection in MANETs: Behavioral Analysis Approach,\" JOURNAL OF NETWORKS, , vol. 7, no. 1, pp. 116-125, 2012 Muneer O Bani Yassein, Saher S Manaseer, Ahmad A Momani, \"Adaptive Backoff Algorithm for Wireless Internet,\" JOURNAL OF EMERGING TECHNOLOGIES IN WEB INTELLIGENCE,, vol. 4, no. 2, pp. 155-163, 2012 Muneer Bani Yassein, Qusai Abuein, Deya Alzoubi, \" Dynamic Probabilistic Flooding in DSR Routing Algorithm for Wireless Network,\" JOURNAL OF EMERGING TECHNOLOGIES IN WEB INTELLIGENCE, vol. 4, no. 4, pp. 352-361, Ahmad Abed Elellah Momani, Muneer Bani Yassein, Omar Darwish, Saher Manaseer, Wail Mardini, \"Intelligent Paging Backoff Algorithm for IEEE 802.11 MAC Protocol,\" Network Protocols and Algorithms, vol. 4, no. 2, pp. 108-123, 2012 Mohammed Q Shatnawi, Muneer Bani Yassein, Reem Mahafza, \"A framework for retrieving Arabic documents based on queries written in Arabic slang language,\" ournal of Information Science, vol. 38, no. 4, pp. 350-365, 2012 Muneer Bani Yassein, Mohammed Ahmed Alomari, Constandinos X Mavromoustakis, \"Optimized Pessimistic Fibonacci Back-off Algorithm (PFB),\" ) International Journal of Advanced Computer Science and Applications, vol. 3, no. 9, pp. 254-260, 2012 Muneer O Bani Yassien, Marwa Kh Salayma, Wail E Mardini, Yaser M Khamayseh, \"Fibonacci Backoff Algorithm for IEEE 802.15.4/ZigBee,\" Network Protocols and Algorithms, vol. 4, no. 3, pp. 62-78, 2012 Muneer Bani Yassein, Safwan Omari, Enas Hassan Abu Yabes,   Shadi Aljawarneh. , \"An Energy Saving Algorithm (ESA) For Wireless Sensor Networks: Testing and Evaluation ,\" Recent Patents on Computer Science, vol. 9, no. , pp. 1-14, 2016 Muneer Bani Yassein,Yaser Khamayseh,Mai AbuJazoh, \" Feature Selection for Black Hole Attacks,\" Journal of Universal Computer Science, vol. 22, no. 4, pp. 521-536, 2016 Qusai Abuein, Mohammed Q. Shatnawi, Muneer Bani Yassein, Radwan Batiha, \"A Framework for Social Media and Text-Based Content Analysis for Event Management Purposes,\" International Review on Computers and Software (I.RE.CO.S.) , vol. 11, no. 5, pp. 388-394, 2016 Bani Yassein, Muneer and Shatnawi, Mohammed and Mardini, Wail and Al-zoubi, Dua, \"Internet of Things Business Impact and its Application Layer Protocol in Embedded Systems,\" International Journal of Intelligent Enterprise, Inderscience, Scopus[Q3]., vol. , no. , pp. 0-0, 2017, Inderscience Bani Yassein, Muneer and Khamayseh, Yaser and Al-Rousan, Mohammad and Rababah, Yazan, \"Adaptive Distance-based Broadcasting Scheme for Mobile Ad Hoc Networks,\" International Journal on Communications Antenna and Propagation (IRECAP), SCOPUS (Q1), vol. 8, no. , pp. 222-231, 2018, Praise Worthy Prize,SCOPUS (Q1) Bani Yassein, Muneer and Aljawarneh, Shadi and Al-Saad, Mohammad, \"An Efficient on-Demand Constrained Application Protocol for Internet of Things,\" International Journal on Communications Antenna and Propagation (IRECAP), SCOPUS (Q1), vol. 8, no. , pp. 232-239, 2018, Praise Worthy Prize,SCOPUS (Q1) Bani Yassein, Muneer and Khamayseh, Yaser and Mardini, Wail and Al Bataineh, Manar, \"Enhanced Home Energy Management Scheme (EHEM) in Smart Grids,\" Journal of Communication Networks and Information Security (IJCNIS),, vol. 10, no. , pp. 85-90, 2018, SCOPUS Q2 Bani Yassein, Muneer and Khamayseh, Yaser and Mardini and Wail and Al Bataineh, Manar, \"Enhanced Home Energy Management Scheme (EHEM) in Smart Grids,\" International Journal of Communication Networks and Information Security (IJCNIS),SCOPUS Q2, vol. 10, no. , pp. 0-0, 2018 Bourdena, Athina and Mavromoustakis, Constandinos X and Kormentzas, George and Pallis, Evangelos and Mastorakis, George and Bani Yassein, Muneer, \"A resource intensive traffic-aware scheme using energy-aware routing in cognitive radio networks,\" Future Generation Computer Systems,SCOPUS (Q1), Science Citation Index Expanded (SCIE)., vol. 39, no. , pp. 16-28, 2014, North-Holland,Elsevier Khamayseh, Yaser and Mardini, Wail and Aljawarneh, Shadi and BaniYassein, Muneer, \"Integration of Wireless Technologies in Smart University Campus Environment: Framework Architecture,\" International Journal of Information and Communication Technology Education (IJICTE), vol. 11, no. , pp. 60-74, 2015, IGI Global Al-Rousan, Mohammad and Yassein, Muneer Bani and Al-Dubai, Ahmed and Ghaleb, Barraq and Mahmoud, Ibrahim, \"A Novel Situation Specific Network Security for Wireless Sensor Networks,\" Sensors \\& Transducers, vol. 186, no. , pp. 33-42, 2015, Directory of Open Access Journals Dragana S. Krsti{\\'c}, Suad Suljovi{\\'c}, Mihajlo {\\v{C}}. Stefanovi{\\'c}, Muneer Masadeh Bani Yassein, Danijela Aleksi{\\'c}, \"Level crossing rate of SC receiver output signal in the presence of Gamma shadowing and k-$\\mu$ or Rician multipath fading,\" INTERNATIONAL JOURNAL OF COMMUNICATIONS, vol. 9, no. , pp. 19-27, 2015 Yassein, M Bani and Khamayseh, Yaser and Yatim, Maryan, \"NISHA: Novel Interface for Smart Home Applications for Arabic Region,\" BRIS Journal of Advances in S \\& T, vol. 3, no. , pp. 86-98, 2015 Qasem, Mamoun and Al-Dubai, Ahmed and Romdhani, Imed and Bani Yassein, Muneer, \"ATP: adaptive tuning protocol for service discovery in Internet of Things.,\" , vol. , no. , pp. 0-0, 2015, ACM Bani-Yassein, Muneer and Al-Maolegi, Mohamed and Khamayseh, Yaser and Krstic, Dragana and Aljawarneh, Shadi, \"Smart System for Busy Roads Using Short Range Wireless Technologies,\" International Journal of Mathematics and Computers in Simulation, vol. 9, no. , pp. 146-152, 2015 Bani",
  "content_length": 115566,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:30"
}