{
  "name": "M. Remzi Sanver",
  "homepage": "https://sanver.bilgi.edu.tr",
  "status": "success",
  "content": "Remzi Sanver Let no one unversed in geometry enter here I was born in 1970. I am a graduate of Galatasaray Lisesi, a high school which represents a tradition of education that is more than five centuries old. My university education was in another tradition of education, Boğaziçi University, where I received a BS degree in Industrial Engineering and a Ph.D. in Economics. My advisor was Murat Sertel, a great scientist and a friend whom I owe a lot and miss a lot. Following the completion of my Ph.D. in 1998, I developed my whole professional career at Istanbul Bilgi University, a young but distinguished higher education institution of Turkey. There, I have been the founding director of the Murat Sertel Center for Advanced Economic Studies which I beleive to be a center of excellence in mathematical social sciences. I have also served as the rector of my University between 2011 and 2015. Since October 2015, I am a director of research at CNRS, working at LAMSADE, Universite Paris Dauphine. Scientific Research of M. Remzi Sanver My scientific research can be described as the analysis of the collective decision making problem. My work is developed over four main axes which are the reflection of a coherent research agenda. The first axis is the analysis of the preference aggregation problem within the standard Arrovian framework. The second axis is the analysis of voting rules. The third axis is the particular emphasis given to the manipulability and strategy-proofness of voting rules. The fourth axis is the implementation of collective decision rules. As explained in more details below, my work contains original findings on each of these four axes, which contribute to our better understanding of the collective decision making problem, as well as helping to make better social decisions. 1 Analysis of the preference aggregation problem within the standard Arrovian framework. Most of my work on this axis is the attempt of better understanding the difficulties underlying the Arrovian preference aggregation problem. As a way of doing this, I explored the effects of weakening various conditions that lead to the Arrovian impossibility. For example, in Ozdemir and Sanver (2007), we show that the Arrovian impossibility prevails under very severe domain restrictions. A result in a similar direction is by Dogan and Sanver (2008) which considers the aggregation of preferences over sets of alternatives and show that none of the natural domain restrictions that arise in this world allows to escape the Arrovian impossibility. We also show in Cengelci and Sanver (2007) that modeling the problem for a society of variable size does not help to escape the Arrovian impossibility. On the other hand, in Coban and Sanver (2014), we establish the existence of a large family of anonymous and neutral aggregation rules that satisfy a joint weakening of the Pareto and pairwise independence conditions. As another positive result, in Sanver and Selcuk (2009), we show that extending the range of aggregation rules by allowing a kind of ambiguity in the social preference ends up in the existence of Pareto optimal, pairwise independent and non-dictatorial aggregation rule. My work on modelling various social phenomena as an aggregation problem can also be seen to stand over this axis. For example, our findings in Cengelci and Sanver (2010) contribute to the literature which conceives the collective identity determination problem as an aggregation of individual opinions. The model of Can and Sanver (2009) might be the first time where stereotype formation is treated as an aggregation problem. In fact, there are many open questions about this problem which I plan to pursue. 2 Analysis of voting rules My work on this axis contains the axiomatic analysis of various social choice rules. To cite a few results, in Sanver (2002), I show that scoring rules cannot simultaneously ensure choosing an alternative ranked best by the majority and avoid choosing an alternative ranked worst by a majority. In Ozkal Sanver and Sanver (2006a), we show under quite general conditions that when there are at least two proposals, referendum voting cannot ensure Pareto optimality. In Selcuk and Sanver (2010) we propose a new chararazterization of the Copeland rule. Nevertheless, I think that my major contributions on this axis is my work on two particular rules, namely the majority rule and approval voting. The various characterizations of the majority rule proposed in Asan and Sanver (2002, 2006) and Sanver (2009a) contribute to a better understanding of majoritarianism. In Brams and Sanver (2006), Laslier and Sanver (2010a) we establish new properties of Approval Voting and Laslier and Sanver (2010b) gives one of the most complete accounts of the literature on this rule. My work on approval voting and particularly its required informational framework paved the way to the description of a new informational framework for social choice that is formally proposed in Sanver (2010). Within this new framework, we have been able to conceive new social choice rules (Brams, Kilgour and Sanver (2006, 2007), Brams and Sanver (2009)). Moreover, various concepts of social choice theory can be revisited within this new framework (e.g., as Erdamar, García-Lapresta, Pérez-Román and Sanver (2014) do) and this is certainly an area where we still have lot to understand, which is in my future research agenda. 3 Manipulability and strategy-proofness of voting rules One focus on this axis is my analysis of the robustness of the Gibbard-Satterthwaite Theorem when multi-valued social choice rules are considered. In Ozyurt and Sanver (2008, 2009) we show that the Gibbard-Sattethwaite impossibility prevails over multi-valued social choice rules under very general conditions. As this analysis requires a well-understanding of the relationship between preferences over alternatives and preferences over sets of alternatives, I had to derive new findings in this regard which have been separately published in Kaymak and Sanver (2003), Can, Erdamar and Sanver (2009) and Erdamar and Sanver (2009). Another focus on this axis has been my analysis of the effects of domain restrictions on the strategy-proofness of collective decision making rules. As examples in this direction, I will mention Sanver (2007) showing that –contrary to the standard intuition- expanding the domains of social choice rules can help escaping the Gibbard-Satterthwaite impossibility; Sanver (2009b) characterizing the domain restrictions that render the plurality rule strategy-proof; Chatterji, Sanver and Sen (2013) establishing domains that admit strategy-proof social choice functions which do satisfy various desirable properties. My research on strategy-proofness also includes the elaboration of the various “monotonicity” conditions of the literature which are closely related to non-manipulability. In Zwicker and Sanver (2009, 2012) and Ozkal Sanver and Sanver (2010), we introduce new monotonicity conditions and establish their relevance to non-manipulability. Another direction of research into strategy-proofness has been the introduction of indices that measure the degree of manipulability of social choice rules and compute these indices for various social choice rules, as we do in Aleskerov, Karabekyan, Sanver and Yakuba (2011a, 2011b, 2012). Learning more about “how much” a social choice rule is manipulable is a topic on my future research agenda. 4 Implementation of collective decision rules My work on this axis, which is mainly on implementability via Nash equilibria, took three main directions. One direction is the design of mechanisms which weaken the necessary conditions for Nash implementability, hence expanding the set of collective decision rules that are implementable via Nash equilibria. For example, mechanisms with awards (Sanver (2006a)) or mechanisms with set-valued outcome functions (Ozkal Sanver and Sanver (2006b)) pave the way to implement via Nash equilibria certain interesting collective decision rules which are otherwise non-implementable. In a similar vein, as Ozkal Sanver and Sanver (2005) show, certain type pretension mechanisms lead to positive results regarding the implementability of matching rules. Another direction is the analysis of social choice rules that are not Nash implementable, aiming to see “how far” they are from being implementable. A way to approach this question is to compute the minimal extension that renders a social choice rule Nash implementable as Erdem and Sanver (2005) do for scoring rules and Sanver (2006b) does for the majority rule. In the same direction but with a different approach, Sanver (2008) characterizes the domain restrictions that render the plurality rule Nash implementable. Again as a contribution to this direction, in Benoit, Ok and Sanver (2007), we propose a new approach to evaluate the “closeness” of social choice rules to be Nash implementable. The third direction is to explore the “performance” of certain collective decision rules by computing the equilibrium outcomes of the preference manipulation game that they induce when instituted as the outcome function. For example, we know from we know from Sertel and Sanver (2004) that for a fairly large class of voting rules, when strong Nash equilibrium is the solution concept, the achieved outcome is the Condorcet winner or a kind of its generalization. Results of the same spirit prevail for public good economies: Sertel and Sanver (1999) show that when the Lindahl rule is instituted without knowing initial endowments, at the Nash eqilibria of the endowment-pretension game we reach the voluntary contributions solution. Sanver (2005) derives similar results for a more general class of public good allocation rules. References Aleskerov, F, D Karabekyan, M Sanver and V Yakuba (2011a), On the degree of manipulability of multi-valued social choice rules, Homo Oeconomicus, 28 (1-2), 205-216. Aleskerov, F, D Karabekyan, M Sanver",
  "content_length": 22182,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:24"
}