{
  "name": "M. Salman Asif",
  "homepage": "http://www.ece.ucr.edu/~sasif",
  "status": "success",
  "content": "Salman Asif Home Biography CV Research Publications Group News Teaching Courses Codes and supp. FlatCam L1 homotopy Dynamic MRI Salman Asif M. Salman Asif Associate Professor Department of Electrical and Computer Engineering Cooperating Faculty Department of Computer Science and Engineering University of California, Riverside Email: sasif@ucr.edu Phone: (951) 827-2385 Office: 4126 Multidisciplinary Research Building (MRB) Mail: 900 University Ave., Riverside, CA 92521 Web: www.ece.ucr.edu/~sasif Google Scholar profile I am an Associate Professor in the Department of Electrical and Computer Engineering at the University of California, Riverside. Research interests. My research interests broadly lie in the areas of computational imaging, signal/image processing, computer vision, and machine learning. I design algorithms to learn and exploit latent signal structures for fast and efficient information recovery. Current research focus is on computational imaging (physics-based and data-driven approaches), adversarial attacks and defenses for robust computer vision, multi-task and multi-modal machine learning, and wearable sensors for health monitoring and rehabilitation. Positions available Prospective PhD students: I am looking for new Ph.D. students to join my group for projects related to computational imaging and multi-modal machine learning. A successful candidate should have solid understanding of Linear Algebra, programming (Matlab and Python), basics of Convex Optimization, and interest in tinkering with hardware prototypes (no special skills needed, but should be able to assemble a lego set with or without instructions). Important: If you send me an email, please include your CV/resume and a brief statement of your research interests. I try to respond to as many emails as I can, but please do not be offended if you do not receive a response. UCR offers PhD admissions in Fall, Winter, and Spring quarters. Please look at Graduate admissions page for details. Undergraduate students: If you are at UCR and want to work on computational imaging, machine learning, or computer vision, get in touch. News and updates We received an NSF MEDIUM grant Collaborative Research: CIF: Medium: Robustness to Distribution Shifts in Computational Imaging - Inference, Sampling, and Adaptation with Ulugbek Kamilov, WashU. Excited to continue the work with our amazing team of students and collaborators. One paper on a unified framework for solving inverse problems via diffusion posterior sampling accepted to IEEE TCI. Congratulations Nebiyou! Gaussian is All You Need: A Unified Framework for Solving Inverse Problems via Diffusion Posterior Sampling More information and code available at github.com/CSIPlab/CoDPS One paper on a video benchmark dataset for 3D human pose and shape estimation accepted to ICCV 2025. Congratulations Yash! VOccl3D: A Video Benchmark Dataset for 3D Human Pose and Shape Estimation under real Occlusions Targeted unlearning with single layer unlearning gradient (SLUG) accepted to ICML. Congratulations Zikui and Yaoteng! Targeted Unlearning with Single Layer Unlearning Gradient More information and code available at csiplab.github.io/slug and github.com/CSIPlab/SLUG One paper on robust multimodal learning accepted to IEEE TPAMI. Congratulations Kaykobad! Robust Multimodal Learning with Missing Modalities via Parameter-Efficient Adaptation We received a DARPA AIE award for DISCO: Discovery of Sparsity-Constrained Optimization Algorithms with Chinmay Hegde, NYU. We received an NSF SCH grant for Comprehensive Tissue Disease Diagnosis Using a Multimodal Robotic System. This is a collaborative project across UCR (with Jun Sheng and Chen Li), UCSD (Sheng Xu), and City of Hope (Mustafa Raoof). More information can be found here. One paper on multimodal unlearning accepted to EMNLP Findings Cross-Modal Safety Alignment: Is textual unlearning all you need? One preprint on Unlearning Targeted Information via Single Layer Unlearning Gradient with Zikui Cai, Yaoteng Tan Code available at github.com/CSIPlab/SLUG Happy to serve as Area Chair for CVPR 2025, ICLR 2025, and WACV 2025; Senior Program Committee Member for AAAI 2025 One paper on transformer-based event cameras accepted to ECCV 2024. Congratulations Bin and Zhan! Transformer-Based Event Denoising Across Varied Noise Levels One paper accepted to IEEE Journal of Selected Topics in Signal Processing. DoDo: Double DOE Optical System for Multishot Spectral Imaging One paper accepted to ICML 2024 Prior Mismatch and Adaptation in PnP-ADMM with a Nonconvex Convergence Analysis One paper accepted to IEEE Open Journal on Signal Processing Multimodal Transformer for Material Segmentation One paper accepted to IEEE TCI. Congratulations Nebiyou and Bek! Domain Expansion via Network Adaptation for Solving Inverse Problems One paper accepted to CVPR 2024. Congratulations Qi and Zhan! PNeRV: Enhancing Spatial Consistency via Pyramidal Neural Representation for Videos One paper presented in AAAI 2024. Congratulations Zikui and collaborators! Disguise without Disruption: Utility-Preserving Face De-Identification One paper accepted to IEEE TPAMI. Congratulations Zhihao and Zhan! Efficient Visual Computing with Camera RAW Snapshots more news Research interests My research interests broadly lie in the areas of computational imaging, signal/image processing, computer vision, and machine learning. I design algorithms to learn and exploit latent signal structures for fast and efficient information recovery. Recently, I have been working on some projects in computational imaging, adversarial computer vision, multi-modal machine learning, and soft, wearable robotics. Computational imaging Machine learning Computer vision Compressive sensing Signal and image processing Convex optimization and numerical methods Service Area Chair NeurIPS 2025 Area Chair CVPR 2024, 2025 Area Chair ICLR 2024, 2025 Senior Program Committee AAAI 2024, 2025 Area Chair WACV 2023, 2024, 2025 Area Chair ICIP 2019, 2020, 2021, 2022, 2023, 2024, 2025 Area Chair ICASSP 2020, 2021, 2022, 2023 Senior Program Committee IJCAI 2023 Associate Editor IEEE Transactions on Computational Imaging (2022 – present) Associate Editor IEEE Transactions on Multimedia (2024 – 2025) Associate Editor IEEE Transactions on Circuits and Systems for Video Technology (2020 – 2023) Page generated 2025-07-24 15:46:46 PDT, by jemdoc.",
  "content_length": 6418,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:25"
}