{
  "name": "M. Sohel Rahman",
  "homepage": "http://msrahman.buet.ac.bd",
  "status": "success",
  "content": "Dr. M. Sohel Rahman — CV Overview Footnotes: M. Sohel Rahman, Ph.D.Fellow, Bangladesh Academy of SciencesFellow, Bangladesh Computer SocietyDistinguished Member, ACMDistinguished Contributor, IEEE Computer SocietyACM/IEEE CS Distinguished SpeakerSenior Member, IEEEMemberBangladesh Public Service CommissionAgargaon, Sher-E-Bangla Nagar, Dhaka-1207&ProfessorDepartment of Computer Science & EngineeringBangladesh University of Engineering & Technology (BUET)ECE Building, West Palasi, Dhaka-1205, Bangladeshmsrahman@cse.buet.ac.bd, sohel.kcl@gmail.comhttp://msrahman.buet.ac.bd/ Brief Highlights Currently appointed as a Member of the Bangladesh Public Service Commission (BPSC), a constitutional body in Bangladesh. Worked as Lecturer, Assistant Professor, Associate Professor, Professor and the Head of the Department of CSE at CSE, BUET; Currently a Professor at CSE, BUET; Worked as the Associate Director of System and Support wing of IICT (responsible for the whole IT Setup of BUET). Has been listed in the Stanford/Elsevier's Top 2% Scientists 2024. Current (as of June 2025) Google Scholar Citations: 8427; h-index: 40; i10-index: 112. Has been awarded the National Exemplary Teachers Award 2024 in the Engineering and Technological University Teachers category by the Ministry of Education, Bangladesh on World Teacher's Day. Had been Visiting Senior Research Fellow and Visiting Research Fellow at King's College London for a total of 4 years; Had been a Visiting Researcher (under the London Mathematical Society Grants; the Commonwealth Fellowship) there for a few times. Has taught as a Visiting Lecturer at King's College London. Has worked as a Visiting Researcher (UCI-BDI Fellowship) at University College London. Has been appointed as an ACM Distinguished Speaker (2019-2028). Was appointed as a IEEE Computer Society Distinguished Lecturer (2020-2024) Has been appointed as a Regular Associate of the Abdus Salam International Centre for Theoretical Physics (ICTP), Trieste, Italy (2020-25). Recipient of Commonwealth Scholarship, Commonwealth Fellowship (twice), UCL-BDI Fellowship, LMS Grant, ACU Titular Fellowship, Bangladesh Academy of Sciences Gold Medal (Junior Group), UGC Award. Elected a Fellow of Bangladesh Academy of Sciences. Recognized as a Distinguished Member of ACM for \"Outstanding Scientific Contributions to Computing\". Recognized as a Distinguished Contributor of IEEE Computer Society for \"immense combined technical expertise and innovation power and volunteer commitment\". Senior Member of IEEE, Member of American Mathematical Society (AMS), Member of London Mathematical Society (LMS) and Founding Vice Chairman of BUET ACM Chapter (2014-15), Chairman, BUET ACM Chapter (2018-19), Chairman of IEEE Computer Society Bangladesh Chapter. Editor of Neural Networks, BMC Bioinformatics, Academic Editor of PLOS One, Associate Editor of BMC Research Notes and Guest Editor of special issues in Theoretical Computer Science, Journal of Discrete Algorithms, Journal of Graph Algorithms and Applications and Fundamenta Informaticae. EPSRC Peer Review College Member. Engineering and Physical Sciences Research Council (EPSRC) \"is the main UK government agency for funding research and training in engineering and the physical sciences, investing more than 800 million a year in a broad range of subjects - from mathematics to materials science, and from information technology to structural engineering\" (www.epsrc.ac.uk/about/). Involved in International scientific organizations like IFIP (www.ifip.org) as a member in the Technical Committee for Foundations of Computer Science (for the Working Group of String Algorithmics & Applications). Program Committee Member in several occasions of reputed conference series' like IWOCA, COCOON, WALCOM, NSysS etc. Program Co-Chair of WALCOM 2015, 2018 and 2020. Convenor, Steering Committee, NSysS. Program Evaluator, ABET Inc., USA. The ABET is a non-governmental organization that accredits post-secondary education programs in applied and natural sciences, computing, engineering and engineering technology. Chairman of the Sectoral Committee (CSE) of Board of Accreditation for Engineering and Technical Education (BAETE), Bangladesh and hence is responsible for endorsing all accreditation for the CSE discipline of all universities of Bangladesh. Member of different committees working towards achieving full membership of Washington Accord (for Bangladesh), which was achieved in 2024. Member of many national committees taking various policy decisions. Project Director/Manager of international and national research projects like INSPIRE project, HEQEP sub-project by UGC-World Bank, Innovation project by ICT Division, AI4Earth Project by Microsoft. Given ACM Distinguished Lectures at ICCA 2022 (March 10-12, 2022); Stamford University Techno-Talk series (01 Nov 2021); ICCA 2020 (January 10-12, 2020); IJCCI 2019 (October 25-26, 2019, Dhaka); Sikkim University (June 27, 2019, Sikkim, India). Keynote Speaker at ICCA 2022 (March 10-12, 2022), ICCCSP 2021 (24-25 May 2021, India), ICCA 2020 (10-12 January 2020, Dhaka); at IJCCI 2019 (October 25-26, 2019, Dhaka); at Green University (July 10, 2019, Dhaka); IJCCI 2018 (Dec 14-15, 2018, Dhaka); at ICCDC 2019 (March 14-15, 2019, India); ISMSI 2019 (March 23-24, 2019, Maldives); Presented Invited Talks at Combinatorial Problems of Strings and Graphs Workshop at NUS, 06-07 April 2022; ICRCS 2022 (18-19 February 2022); MIST, 01 January 2022; IEEE CS R10 Webinar series, 30 July 2021; IEEE Computer Society STANDARDS ACTIVITIES BOARD WEBINAR SERIES, 13 May 2021; BPMI, 01 July 2020, 19 August 2020, 20 May 2021; at Start-up Bangladesh, 18 June 2020 (Virtual) at IEEE Computer Society Bangladesh Chapter International Lecture Series, 31 May 2020 (Virtual); at IIT Guwahati, India (March 4, 2019); at Robi Axiata Ltd. (Jan 17, 2019); at Indian Statistical Institute, Kolkata, India (july 9, 2018); at Augmedix Bangladesh, Dhaka; at Bangladesh Sheikh Mujib Medical University (BSMMU), Dhaka; at NUS School of Computing (SoC) Research Workshop 2017, Singapore. Author of 141 refereed journal papers and 105 refereed conference papers. Current notable ongoing research works include COVID-19 modeling, Agent Based Modeling of Mosquito borne diseases, Protein Folding and related problems using Metaheuristic techniques, Classification problems in Proteomics, Biomedical Signal Processing, Solving hard and real life problems in different domains of science and engineering (e.g., Transportation, Groundwater resources, Bioinformatics, Mobile Computing Technology, Parallel Computing) applying computational search techniques and solving different theoretical and combinatorial problems in Computing and Applied Mathematics (e.g., Graph Theory, String Combinatorics). Involved in organizing ICPC Programming Contests and Informatics Olympiad events and in mentoring/coaching teams and individuals for such national/international events. Coach of the BUET Potatoes team (Asia West Champion in 46th ICPC Egypt 2024) and BUET HellBent team (Asia West Champion in 44th ICPC Moscow 2021). Leader of the Bangladesh team in International Olympiad in Informatics (since 2017); in 2017 Bangladesh team won 4 Bronze medals; in 2018 Bangladesh team won 1 Silver and 1 Bronze medals; in both 2019 and 2020 Bangladesh team won 3 Bronze medals. In 2021, Bangladesh team won 2 silver and 2 Bronze medals. In 2022, Bangladesh team won 1 silver and 2 Bronze medals. In 2023, Bangladesh team won 1 silver and 2 Bronze medals. In 2024, Bangladesh team won 1 Gold and 2 Bronze medals. Advisor/Mentor of the team, BUET Synapse winning the IEEE VIP Cup Grand Prize 2023 and the team NeoScreenix winning the 2025 Johns Hopkins Healthcare Design Competition. Author of 21 reviews in Mathematical Review and 10 reviews in ACM Computing Reviews. Co-authored a textbook on ICT in Bangla for Higher Secondary level students and a textbook on System Analysis and Design in English for Undergraduate studies in Computer Science and Engineering. Author of several articles in the national dailies and news portals about contemporary issues mostly related to education and ICT. Conducted (as a member) and overseen (as the HoD) many national level consultancy services under the auspices of Bureau of Research Training and Consultation (BRTC), BUET. Education Ph.D., Computer Science, King's College, University of London, London, UK, 2008.M.Sc. Engg., Computer Science and Engineering, Bangladesh University of Engineering & Technology, 2004B.Sc. Engg., Computer Science and Engineering, Bangladesh University of Engineering & Technology, 2002 Work History MemberBangladesh Public Service CommissionAgargaon, Sher-E-Bangla Nagar, Dhaka-1207November 2024 - PresentProfessorDepartment of Computer Science & EngineeringBangladesh University of Engineering & Technology (BUET), ECE Building, West Palasi, Dhaka-1205, BangladeshJuly 2012 - PresentProject DirectorGWMap: Applying Machine Learning to map groundwater levels in BangladeshAI4Earth Grant (Microsoft Azure Credit), funded and administered by MicrosoftOctober 2019 - October 2021Project DirectorMachine intelligence aided diagnosis of cervical cancerA Research and Innovation Project administered by the ICT Division, Government of BangladeshMarch 2019 - May 2021Head of the DepartmentDepartment of Computer Science & EngineeringBangladesh University of Engineering & Technology (BUET), ECE Building, West PalasiDhaka-1205, BangladeshMarch 2016 - March 2018Project DirectorAdvances in Algorithms for Next Generation Biological SequencesAn INSPIRE Project administered by the British CouncilJanuary 2014 - December 2017Visiting Senior Research Fellow (Honourary)Department of InformaticsKing's College LondonStrand, London WC2R 2LS, UKNovember 2014 - October 2015Visiting Researcher (UCL-BDI Fellowship)Department of Geography &Big Data InstituteUniversity College LondonGower Street, London WC1E 6BTJune 2015 - August 2015Visiting Resea",
  "content_length": 111218,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:24"
}