{
  "name": "M. Tamer Özsu",
  "homepage": "https://cs.uwaterloo.ca/~tozsu",
  "status": "success",
  "content": "M. Tamer Özsu Home Personal Activities Students & Postdocs Presentations Publications Vita Teaching Research Awards M. Tamer Özsu University Professor Data Systems Research Group David R. Cheriton School of Computer Science University of Waterloo Waterloo, Ontario N2L 3G1 Canada Distinguished Visiting Professor Tsinghua University Beijing China Office: DC 3350 tamer.ozsu AT uwaterloo.ca +1 (519) 888-4043 My Calendar General Information Undergraduate internships: I am not going to be admitting any international interns for the foreseeable future. Please do not write to me about internship as I will not be able to respond to individual emails. Graduate students: I am not going to be admitting any more graduate student next academic year. I am full right now. Driving directions to waterloo Visitors: Campus map; please mark in the M lot Recent News Zeynep's work from her PhD thesis got accepted to PVLDB 2025 (will be presented at VLDB 2025 in London, UK): Korkmaz, Z. Özsu, M.T and Daudjee, K. Locality-Aware Cache Replacement Policy for Graph Traversals, Proc. VLDB Endowment, 2025. Harrum Noor graduated (MMath; April 2025) with thesis entitled \">What Do You Mean? Using Large Language Models for Semantic Evaluation of NL2SQL Queries\" Sairaj's work from his Master's thesis got accepted to SIGMOD 2025: Voruganti, S. and Özsu, M.T. MIRAGE-ANNS: Mixed Approach Graph-based Indexing for Approximate Nearest Neighbor Search, Proc. ACM Manag. Data (SIGMOD) 3(3): Article 188, 2025, https://doi.org/10.1145/3725325. Sairaj Voruganti graduated (MMath; April 2025) with thesis entitled \"MIRAGE-ANNS: Mixed Approach Graph-based Indexing for Approximate Nearest Neighbour Search\" We are organizing a Workshop on LLM+Databases at ICDE 2025. Winter 2025 course offering (only for Data Science students): Data Engineering for Data Science The following papers have appeared or have been accepted this year: Peng, P., Ji, S., Özsu, M. T., and Zou, L. Minimum motif-cut: a workload-aware RDF graph partitioning strategy. VLDB Journal, 33: 1517–1542, 2024. Zhou, A., Wang, Y., Chen, L., and Özsu, M. T. Positive Communities on Signed Graphs That Are Not Echo Chambers: A Clique-Based Approach. Proc. ICDE 2024, pages 2531-2543, 2024. Zhang, C., Bonifati, A., and Özsu, M. T. Incremental sliding window connectivity over streaming graphs. Proc. VLDB Endowment 17(10): 2473–2486, 2024. Wang, R., Gao, C., Wang, J., Kadam, P., Ozsu, M. T., and Aref, W. G. Optimizing LSM-based indexes for disaggregated memory. VLDB Journal, 2024. Accepted for publication. Ipsita Mohanty graduated (MMath; June 2024) and started working at Huawei Technologies Canada. Congratulations Ipsita. Winter 2024 course offering: Disaggregated & Heterogeneous Computing Platform for Graph Processing. Kerem Akillioglu graduated (February 2024) and will start his PhD program in Fall 2024. Congratulations Kerem. The slides of the tutorial Chao Zhang, Angela Bonifati and I gave at SIGMOD 2023 are now online here. Aida Sheshboulaiki graduated (May 2023); congratulations Dr. Sheshboulaiki. Khaled Ammar graduated (February 2023); congratulations Dr. Ammar. Anıl Paçacı graduated (July 2022); congratulations Dr. Paçacı. Visitors to this page come from: Last update:",
  "content_length": 3235,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:25"
}