{
  "name": "Maarten Marx",
  "homepage": "http://www.uva.nl/profiel/m/a/m.j.marx/m.j.marx.html",
  "status": "success",
  "content": "Dr. M.J. (Maarten) Marx - Universiteit van Amsterdam Dr. M.J. (Maarten) Marx Faculteit der Natuurwetenschappen, Wiskunde en Informatica Informatics Institute Bezoekadres Science Park 904 Kamernummer: L5.52 Postadres Postbus 94323 1090 GH Amsterdam Contactgegevens M.J.Marx@uva.nl Publicaties refereed (87) wetenschappelijk (7) vakpublicatie (2) populair wetenschappelijk (2) congresbijdragen (7) erkenning (3) working papers / preprints (1) datasets (8) 2025 Hutter, J., Rau, D., Marx, M., & Kamps, J. (2025). Lost but Not Only in the Middle: Positional Bias in Retrieval Augmented Generation. In C. Hauff, C. Macdonald, D. Jannach, G. Kazai, F. M. Nardini, F. Pinelli, F. Silvestri, & N. Tonellotto (Eds.), Advances in Information Retrieval: 47th European Conference on Information Retrieval, ECIR 2025, Lucca, Italy, April 6–10, 202 : proceedings (Vol. I, pp. 247-261). (Lecture Notes in Computer Science; Vol. 15572). Springer. https://doi.org/10.1007/978-3-031-88708-6_16 [details]Download Schellingerhout, R., Beraldo, D., & Marx, M. (2025). Accounting for Personalization in Personalization Algorithms: YouTube’s Treatment of Conspiracy Content. Digital Journalism, 13(4), 797-825. https://doi.org/10.1080/21670811.2023.2209153 [details]Download van Heusden, R., Larooij, M., Kamps, J., & Marx, M. (2025). A collection of FAIR Dutch Freedom of Information Act documents. Scientific Data, 12, Article 795. https://doi.org/10.1038/s41597-025-05052-2 2024 Heusden, R. V., Kamps, J., & Marx, M. (2024). OpenPSS: An Open Page Stream Segmentation Benchmark. In A. Antonacopoulos, A. Hinze, B. Piwowarski, M. Coustaty, G. M. Di Nunzio, & N. Vanderschantz (Eds.), Linking Theory and Practice of Digital Libraries: 28th International Conference on Theory and Practice of Digital Libraries, TPDL 2024, Ljubljana, Slovenia, September 24–27, 2024 : proceedings (Vol. I, pp. 413-429). (Lecture Notes in Computer Science; Vol. 15177). Springer. https://doi.org/10.1007/978-3-031-72437-4_24 [details]Download Viira, G., & Marx, M. (2024). Enhancing Access Across Europe for Documents Published According to Freedom of Information Act: Applying Woogle Design and Technique to Estonian Public Information Act Document. Data, 9(11), Article 125. https://doi.org/10.3390/data9110125 [details]Download van Heusden, R., & Marx, M. (2024). A sharper definition of alignment for Panoptic Quality. Pattern Recognition Letters, 185, 87-93. https://doi.org/10.1016/j.patrec.2024.07.005 [details]Download van Heusden, R., Kamps, J., & Marx, M. (2024). Bcubed revisited: elements like me. Discover Computing, 27(1), Article 5. https://doi.org/10.1007/s10791-024-09436-7 [details]Download 2023 Busch, L., van Heusden, R., & Marx, M. (2023). Using Deep-Learned Vector Representations for Page Stream Segmentation by Agglomerative Clustering. Algorithms, 16(5), Article 259. https://doi.org/10.3390/a16050259 [details]Download Erjavec, T., Ogrodniczuk, M., Osenova, P., Ljubešić, N., Simov, K., Pančur, A., Rudolf, M., Kopp, M., Barkarson, S., Steingrímsson, S., Çöltekin, Ç., de Does, J., Depuydt, K., Agnoloni, T., Venturi, G., Pérez, M. C., de Macedo, L. D., Navarretta, C., Luxardo, G., ... Fišer, D. (2023). The ParlaMint corpora of parliamentary proceedings. Language Resources and Evaluation, 57(1), 415-448. https://doi.org/10.1007/s10579-021-09574-0 [details]Download Larooij, M., Kamps, J., & Marx, M. (2023). Openbaarheid van bestuur kan vrijwel kosteloos beter. Economisch-Statistische Berichten, 108(4817), 36-39. https://esb.nu/openbaarheid-van-bestuur-kan-vrijwel-kosteloos-beter/ [details]Download Marx, M., & Kamps, J. (2023). Digitaal duurzaam publiceren van Woo-dossiers: Een onderzoek naar de stand van zaken. Archievenblad, 123(3), 20-23. [details]Download Marx, M., Larooij, M., Enthoven, G., & Kamps, J. (2023). Het Woogle Woo-dossiercorpus. Nederlands Juristenblad, 98(37), 3238-3239. https://www.inview.nl/document/id5cfdbafaf94944da82f6d54d7d946120?ctx=WKNL_CSL_85 [details]Download Marx, M., Larooij, M., Perasedillo, F., & Kamps, J. (2023). Enticing Local Governments to Produce FAIR Freedom of Information Act Dossiers. In J. Kamps, L. Goeuriot, F. Crestani, M. Maistro, H. Joho, B. Davis, C. Gurrin, U. Kruschwitz, & A. Caputo (Eds.), Advances in Information Retrieval: 45th European Conference on Information Retrieval, ECIR 2023, Dublin, Ireland, April 2–6, 2023 : proceedings (Vol. III, pp. 269-274). (Lecture Notes in Computer Science; Vol. 13982). Springer. https://doi.org/10.1007/978-3-031-28241-6_25 [details]Download van Heusden, R., Kamps, J., & Marx, M. (2023). Neural Coreference Resolution for Dutch Parliamentary Documents with the DutchParliament Dataset. Data, 8(2), Article 34. https://doi.org/10.3390/data8020034 [details]DownloadRelated datasetsvan Heusden, R., Kamps, J. & Marx, M. (2021). DutchParliament dataset annotated with coreferrence links. DANS Data Station Physical and Technical Sciences. https://doi.org/10.17026/dans-x86-adrt van Heusden, R., Ling, H., Nelissen, L., & Marx, M. (2023). Making PDFs Accessible for Visually Impaired Users (and Findable for Everybody Else). In O. Alonso, H. Cousijn, G. Silvello, M. Marrero, C. Teixeira Lopes, & S. Marchesin (Eds.), Linking Theory and Practice of Digital Libraries: 27th International Conference on Theory and Practice of Digital Libraries, TPDL 2023, Zadar, Croatia, September 26–29, 2023 : proceedings (pp. 239-245). (Lecture Notes in Computer Science; Vol. 14241). Springer. https://doi.org/10.1007/978-3-031-43849-3_21 [details]DownloadRelated datasetsvan Heusden, R., Ling, H., Marx, M. & Nelissen, L. (2023). Increasing Accessibility of Government Documents Dataset. GitHub. https://github.com/irlabamsterdam/accessibilifier van Heusden, R., de Ruijter, A., Majoor, R., & Marx, M. (2023). Detection of Redacted Text in Legal Documents. In O. Alonso, H. Cousijn, G. Silvello, M. Marrero, C. Teixeira Lopes, & S. Marchesin (Eds.), Linking Theory and Practice of Digital Libraries: 27th International Conference on Theory and Practice of Digital Libraries, TPDL 2023, Zadar, Croatia, September 26–29, 2023 : proceedings (pp. 310-316). (Lecture Notes in Computer Science; Vol. 14241). Springer. https://doi.org/10.1007/978-3-031-43849-3_28 [details]DownloadRelated datasetsvan Heusden, R., Marx, M., de Ruijter, A. & Majoor, R. (2023). Automatic Text Redaction Dataset. GitHub. https://github.com/irlabamsterdam/TPDLTextRedaction 2022 Schellingerhout, R., Medentsiy, V., & Marx, M. (2022). Explainable Career Path Predictions using Neural Models. In M. Kaya, T. Bogers, D. Graus, S. Mesbah, C. Johnson, & F. Gutiérrez (Eds.), Proceedings of the 2nd Workshop on Recommender Systems for Human Resources (RecSys-in-HR 2022): co-located with the 16th ACM Conference on Recommender Systems (RecSys 2022) : Seattle, USA, 18th-23rd September 2022 Article 7 (CEUR Workshop Proceedings; Vol. 3218). CEUR-WS. https://ceur-ws.org/Vol-3218/RecSysHR2022-paper_7.pdf [details]Download Schueler, D., & Marx, M. (2022). Speech Acts in the Dutch COVID-19 Press Conferences. Language Resources and Evaluation, 57(2), 869-892. https://doi.org/10.1007/s10579-022-09602-7 [details]DownloadsSpeech Acts in the Dutch COVID-19 Press ConferencesSupplementary filesSupplementary Information-Speech Acts in the Dutch COVID-19 Press Conferences 2021 Azarbonyad, H., Dehghani, M., Marx, M., & Kamps, J. (2021). Learning to rank for multi-label text classification: Combining different sources of information. Natural Language Engineering, 27(1), 89-111. https://doi.org/10.1017/S1351324920000029 [details]Download Heddes, J., Meerdink, P., Pieters, M., & Marx, M. (2021). The Automatic Detection of Dataset Names in Scientific Articles. Data, 6(8), Article 84. https://doi.org/10.3390/data6080084 [details]Download 2020 Kerkvliet, L., Kamps, J., & Marx, M. (2020). Who mentions whom? Recognizing political actors in proceedings. In D. Fišer, M. Eskevich, & F. de Jong (Eds.), Creating, Using and Linking of Parliamentary Corpora with Other Types of Political Discourse (ParlaCLARIN II): proceedings : LREC 2020 workshop : Language Resources and Evaluation Conference : 11-16 May 2020 (pp. 35-39). European Language Resources Association. https://aclanthology.org/2020.parlaclarin-1.7 [details]Download 2019 Azarbonyad, H., Dehghani, M., Kenter, T., Marx, M., Kamps, J., & de Rijke, M. (2019). HiTR: Hierarchical Topic Model Re-estimation for Measuring Topical Diversity of Documents. IEEE Transactions on Knowledge and Data Engineering, 31(11), 2124-2137 . https://doi.org/10.1109/TKDE.2018.2874246 [details]Download 2017 Azarbonyad, H., Dehghani, M., Beelen, K., Arkut, A., Marx, M., & Kamps, J. (2017). Words are Malleable: Computing Semantic Shifts in Political and Media Discourse. In CIKM'17 : proceedings of the 2017 ACM on Conference on Information and Knowledge Management: November 6-10, 2017, Singapore, Singapore (pp. 1509-1518). Association for Computing Machinery. https://doi.org/10.1145/3132847.3132878 [details]Download Azarbonyad, H., Dehghani, M., Kenter, T., Marx, M., Kamps, J., & de Rijke, M. (2017). Hierarchical Re-estimation of Topic Models for Measuring Topical Diversity. In J. M. Jose, C. Hauff, I. S. Altıngovde, D. Song, D. Albakour, S. Watt, & J. Tait (Eds.), Advances in Information Retrieval: 39th European Conference on IR Research, ECIR 2017, Aberdeen, UK, April 8–13, 2017 : proceedings (pp. 68-81). (Lecture Notes in Computer Science; Vol. 10193). Springer. https://doi.org/10.1007/978-3-319-56608-5_6 [details]DownloadsECIR2017-HiTRAzarbonyad2017 Chapter HierarchicalRe-estimationOfTop Dehghani, M., Jagfeld, G., Azarbonyad, H., Olieman, A., Kamps, J., & Marx, M. (2017). On Search Powered Navigation. In ICTIR'17: proceedings of the 2017 ACM SIGIR International Conference on the Theory of Information Retrieval: October 1-4, 2017, Amsterdam, the Netherlands (pp. 317-320). Association for Computing Machinery. https://doi.org/10.1145/3121050.3121105 [details]Download Dehghani, M., Jagfeld, G., Azarbo",
  "content_length": 39874,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:31"
}