{
  "name": "Maarit J. Käpylä",
  "homepage": "https://research.aalto.fi/en/persons/maarit-k%C3%A4pyl%C3%A4",
  "status": "success",
  "content": "Maarit Korpi-Lagg - Aalto University's research portal Contact expert View Scopus Profile Maarit Korpi-Lagg Prof. Doc. Dr. Professor (Associate Professor), Department of Computer ScienceProfessor (Associate Professor), Computer Science ProfessorsProfessor (Associate Professor), Computer Science - Large-scale Computing and Data Analysis (LSCA) - Research area https://orcid.org/0000-0002-9614-2200 Phone+358 50 4301059 Konemiehentie 2 1999 …2025 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationDoctoral degree, Natural Sciences, University of OuluAward Date: 22 Sept 1999 External positionsCorresponding fellow, Nordic Institute for Theoretical Physics1 Apr 2020 → 31 Mar 2025Independent Max Planck Research Group Leader, Max Planck Institute for Solar System Research1 Jun 2016 → … KeywordsHPC computingNumerical modellingAstroinformaticsSolar magnetic activity Fingerprint Dive into the research topics where Maarit Korpi-Lagg is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Magnetic Field Physics 100% Solar Cycle Physics 35% Prandtl Number Physics 21% Doppler Imaging Physics 21% Sunspot Physics 21% High Resolution Physics 21% Reynolds Number Physics 21% Convective Zones Physics 20% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1999 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2024 2025 2025 86 Article 6 Conference article in proceedings 2 Abstract 2 Review Article 3 More 1 Commissioned report 1 Other chapter contribution 1 Poster Research output per year Research output per year COSMOS-Web: Estimating Physical Parameters of Galaxies Using Self-Organizing MapsAbedini, F., Gozaliasl, G., Zonoozi, A. H., Kalantari, A., Korpi-Lagg, M., Ilbert, O., Akins, H., Allen, N., Arango-Toro, R., Casey, C., Drakos, N., Faisst, A., Flayhart, C., Franco, M., Haghi, H., Harish, S., Hatamnia, H., Kartaltepe, J., Khostovan, A. & Koekemoer, A. & 19 others, Kokorev, V., Larson, R., Leroy, G., Liu, D., McCracken, H., McKinney, J., McMahon, N., Mercier, W., Mobasher, B., Newman, S., Paquereau, L., Rhodes, J., Robertson, B., Shuntov, M., Taamoli, S., Toft, S., Valentino, F., Vardoulaki, E. & Weaver, J., 1 Jun 2025, (Accepted/In press) In: arXiv.org.Research output: Contribution to journal › Article › Scientific File Star Formation Rate 100% Parameter Estimation 50% Redshift Surveys 50% Stellar Mass 50% Active Galactic Nuclei 50% COSMOS Web: Morphological quenching and size-mass evolution of brightest group galaxies from z = 3.7Gozaliasl, G., Yang, L., Kartaltepe, J., Toni, G., Abedini, F., Akins, H., Allen, N., Arango-Toro, R., Babul, A., Casey, C., Chartab, N., Drakos, N., Faisst, A., Finoguenov, A., Flayhart, C., Franco, M., Leroy, G., Harish, S., Hasinger, G. & Hatamnia, H. & 30 others, Ilbert, O., Jin, S., Kakkad, D., Kalantari, A., Khostovan, A. A., Koekemoer, A., Korpi-Lagg, M., Laigle, C., Liu, D., Magdis, G., Maturi, M., McCracken, H. J., McKinney, J., McMahon, N., Mobasher, B., Moscardini, L., Rhodes, J., Robertson, B., Paquereau, L., Puglisi, A., Samir, R., Sargent, M., Sattari, Z., Scognamiglio, D., Scoville, N., Shuntov, M., Sanders, D., Taamoli, S., Toft, S. & Vardoulaki, E., 1 Jun 2025, (Accepted/In press) In: arXiv.org.Research output: Contribution to journal › Article › Scientific File Galactic Cluster 100% Star Formation 28% Star Formation Rate 28% Stellar Mass 14% Photometry 14% 4 Downloads (Pure) In-situ and Opportunistic Data Analysis for Exascale Astrophysics SimulationsPuro, T., Korpi-Lagg, M. & Rheinhardt, M., 7 May 2025, (In preparation) In: Computer Physics Communications. 6 p.Research output: Contribution to journal › Article › Scientific File Computer Hardware 100% Resource Utilisation 100% Graphics Processing Unit 100% Message Passing 50% Speed-up 50% 25 Downloads (Pure) Small-scale and large-scale dynamos in global convection simulations of solar-like starsWarnecke, J., Korpi-Lagg, M. J., Rheinhardt, M., Viviani, M. & Prabhu, A., 1 Apr 2025, In: Astronomy & Astrophysics. 696, p. 1-20 20 p., A93.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Reynolds' Number 100% Reynolds Number 100% Diffusivity 100% Magnetic Field 50% Convective 33% 2 Citations (Scopus) 14 Downloads (Pure) Stencil Computations on AMD and Nvidia Graphics Processors: Performance and Tuning StrategiesPekkilä, J., Lappi, O., Robertsen, F. & Korpi-Lagg, M., 25 Jun 2025, In: Concurrency and Computation: Practice and Experience. 37, 12-14, p. 1-23 23 p., e70129.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Graphics Processor 100% Computer Hardware 40% Supercomputer 20% High-Performance Computing 20% Computational Science 20% 1 Citation (Scopus) 8 Downloads (Pure) View all 99 research outputs Projects Projects per year 2017 2017 2024 2027 3 Active 4 Finished Projects per year JAES PlasmaAI/Korpi-Lagg/T31336: Next-generation AI-assisted modelling tools for magnetized plasmas (PlasmaAI)Korpi-Lagg, M. (Principal investigator), Puro, T. (Project Member) & Gozaliasl, G. (Project Member)01/07/2025 → 30/06/2027Project: Unknown Next-generation AI 100% AI-based Methods 100% Astronomy 100% Modeling Tools 100% simulation 100% Mobility COSMAGG/Korpi-Lagg: Investigating COSmic MAGnetism with GPU-accelerated codesKorpi-Lagg, M. (Principal investigator)01/04/2024 → 31/03/2026Project: RCF Researcher Mobility FIRI CDC-FI/Korpi-Lagg: Cosmology Data Center FinlandKorpi-Lagg, M. (Principal investigator), Gozaliasl, G. (Project Member), Weigt, D. (Project Member), Kotimäki, J. (Project Member) & Henriksson, N. (Project Member)01/01/2024 → 31/12/2026Project: RCF Research Infrastructure Inno4scale NEOSC/Korpi-Lagg: Novel mEthOds to resolve the data analysis bottleneck in GPU-accelerated Stencil Computations [NEOSC]Korpi-Lagg, M. (Principal investigator), Puro, T. (Project Member), Nguyen, T. (Project Member), Rantaharju, J. (Project Member), Rheinhardt, M. (Project Member) & Nguyen, A.-D. (Project Member)01/02/2024 → 31/01/2025Project: EU_HEFWP View all 7 projects Datasets Compressible test-field method and its application to shear dynamosKäpylä, M. (Creator), Rheinhardt, M. (Creator) & Brandenburg, A. (Creator), Zenodo, 2022DOI: 10.5281/zenodo.6383189Dataset Dataset for 'Rotational dependence of turbulent transport coefficients in global convective dynamo simulations of solar-like stars'Warnecke, J. (Creator) & Käpylä, M. (Creator), Zenodo, 12 Feb 2020DOI: 10.5281/zenodo.3629665Dataset Dataset for \"Helicity proxies from linear polarisation of solar active regions\"Prabhu, A. (Creator), Brandenburg, A. (Creator), Käpylä, M. (Creator) & Korpi-Lagg, A. (Creator), Zenodo, 10 Jun 2020DOI: 10.5281/zenodo.3888575Dataset CR2014/2015 Flat-fields (helioprojective)Weigt, D. (Creator), Korpi-Lagg, A. (Creator) & Korpi-Lagg, M. (Creator), Zenodo, 24 Jan 2025DOI: 10.5281/zenodo.14732035, https://zenodo.org/records/14732036Dataset Prizes Grand Challenge: Interaction of small and large scale galactic dynamosGent, F. (Recipient), Mac Low, M.-M. (Recipient), Käpylä, M. (Recipient) & Singh, N. K. (Recipient), 15 Jun 2018Prize: Award or honor granted for a specific work Rotating Generator 100% Award 50% Simulation 50% Nordiata corresponding fellowKorpi-Lagg, M. (Recipient), 2020Prize: Granted funding (personal grants) Fellowships 100% Physics 100% Research 50% Scientists 50% Candidate 50% Activities Activities per year 2013 2016 2017 2018 2020 2024 14 Hosting an academic visitor 11 Reviewer of scientific journal 11 Invited academic talk 9 Conference presentation 35 More 6 Participant of a conference, workshop, session, tutorial or event 5 Membership of an organizing committee or other positions of trust of a conference or a seminar 4 Membership of a scientific or program committee of a conference or seminar 4 Visiting an external academic institution 3 Chair or participant of a conference, workshop, panel, session, tutorial or event 3 Pre-examination of doctoral thesis or acting as opponent to doctoral students or membership of doctoral thesis committee or board 2 Organization of a workshop, panel, session, tutorial or event 2 Evaluation of funding applications 2 Position of trust in a society or network 2 Academic keynote or plenary lecture 1 Appointed supervisor or advisor of postgraduates at Higher Education Institutions. 1 Position of trust in an academic community Activities per year F-mode from 6h time seriesKorpi-Lagg, A. (Speaker), Korpi-Lagg, M. (Contributor), Weigt, D. (Contributor) & Truong, L. (Contributor)5 Nov 2024Activity: Talk or presentation types › Conference presentation A novel technique for magnetic flux emergence diagnostics on the SunWeigt, D. (Speaker), Korpi-Lagg, A. (Contributor) & Korpi-Lagg, M. (Contributor)4 Nov 2024 → 8 Nov 2024Activity: Talk or presentation types › Conference presentation A novel technique to predict magnetic flux emergence on the SunWeigt, D. (Speaker), Korpi-Lagg, M. (Contributor) & Korpi-Lagg, A. (Contributor)May 2024Activity: Talk or presentation types › Conference presentation A novel technique to predict magnetic flux emergence on the SunWeigt, D. (Speaker), Korpi-Lagg, M. (Contributor) & Korpi-Lagg, A. (Contributor)May 2024Activity: Talk or presentation types › Conference presentation PhD AdvisorGent, F. (Advis",
  "content_length": 11270,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:30"
}