{
  "name": "Maarten de Rijke",
  "homepage": "https://staff.fnwi.uva.nl/m.derijke",
  "status": "success",
  "content": "Maarten de Rijke – Information retrieval Skip to content It’s been almost a year since my daughter Emma passed away. We have migrated the “collection box” that we opened shortly after Emma’s passing to an in memoriam page, where you can still donate to EpilepsieNL (like on the original collection box page) and where you can also share memories. See https://inmemoriam.inactievoorepilepsie.nl/fundraisers/emma-de-rijke. Added (November 21,… Read more We have a vacancy for a four year research engineer position in generative information retrieval, in the context of the ERC project UNITE. Please see the University’s vacancy site at this location for all the details. Deadline: November 23, 2025. Read more I am seeking three highly motivated PhD students to work on topics in generative information retrieval. The positions are funded by a ERC grant and are part of a larger effort to advance generative information retrieval at the IRLab of the University of Amsterdam. You can find more details about the positions at this location. The… Read more We have a vacancy for a three year postdoc to work on generative information retrieval in the context of the ERC project UNITE. See the University’s vacancy site at this location for all the details. Deadline: October 5, 2025. Read more We mark 300 days without Emma by slowing down, visiting Emma’s memorial bench in the Hortus in Leiden, and experiencing the garden. Please contribute at https://inmemoriam.inactievoorepilepsie.nl/fundraisers/emma-de-rijke and share the link. Thank you! (URL and QR code updated on November 19, 2025.) Read more SIGIR 2025 is about to start. This year, IRLab has over 35 presentations at the main conference, tutorials, workshops, and satellite events. Head over to the IRLab site for details: day 1, day 2, day 3, day 4, day 5, day 6. Read more It’s been 200 days since Emma passed away. While attending NTCIR in Tokyo, I slowed down and sent her a message from the nearby Kanda Myojin Shrine. Please contribute at https://inmemoriam.inactievoorepilepsie.nl/fundraisers/emma-de-rijke and share the link. Thank you! (URL and QR code updated on November 19, 2025.) Read more We have adopted a memorial bench (“herinneringsbankje” in Dutch) for Emma in the Hortus Botanicus at Leiden University. Emma enjoyed visiting the Hortus and spending time there, both with friends and by herself. There’s a small plaque on the bench that says “Wees lief voor jezelf” (“Be kind to yourself”), a piece of advice Emma… Read more We are very grateful for the positive energy and the contributions to our daughter Emma’s collection box at  https://epilepsie.digicollect.nl/maarten-de-rijke resulting from the Zumba Charity Event for Emma that was organized by Dansstudio Rick Schmitz in Geleen on April 13. A big, big thank you to instructors Anke, Carla, Madeva, Manon, Rick, Ricky, Tofti for organizing,… Read more The web site for MANILA25, the second workshop on Information Retrieval for Climate Impact at SIGIR 2025, is live now at https://sites.google.com/view/ir-for-climate-impact/home. MANILA25 will be held as a half-day workshop on July 17, 2025 in Padova, Italy. A Call for Contributions is available at the web site for MANILA25. We are looking for technical contributions… Read more 1 2 3 4 … 21 Next University of Amsterdam • Innovation Center for Artificial Intelligence (ICAI) Search for: Maarten de Rijke, University of Amsterdam & ICAI, Science Park 900, 1098 XH Amsterdam, The Netherlands. T: +31 6 51 938 523. E: m.derijke@uva.nl",
  "content_length": 3524,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:32"
}