{
  "name": "Maaz Amjad",
  "homepage": "https://maazamjad.com",
  "status": "success",
  "content": "Maaz Amjad Maaz Amjad Assistant Prof (Teaching Track) Texas Tech University Lubbock, Texas, United States Email LinkedIn Github Google Scholar ORCID Twitter Biography I am an Assistant Teaching Professor in the Department of Computer Science at Texas Tech University. Before coming to Texas Tech, I was a Provost Early Career Fellow and Postdoctoral Fellow at The University of Texas at Austin, United States. I earned a Ph.D in Computer Science from Instituto Politécnico Nacional (2022), M.S. in Applied Mathematics and Informatics from Moscow Institute of Physics and Technology (2017), and B.S (Hons.) in Mathematics from GC University (2015). My scholarly focus is centered on AI for Social Good. I specialize in Applied Machine Learning, Large Language Models and harness the power of Natural Language Processing (NLP) and its interdisciplinary applications to address pressing societal challenges. Specifically, my work focuses on combating misinformation, detecting hate speech, and developing technologies to improve public health and well-being. By leveraging data from digital platforms, social media, and clinical sources, I develop machine learning models to extract deeper insights that pave the way for informed, data-driven decisions. I am particularly interested in exploring how AI can be utilized in Education, especially in enhancing student learning and engagement, and improving assessment methodologies. My research aims to develop innovative AI-driven solutions that transform educational experiences and student learning outcomes. In my spare time, I love to get in touch with nature because I reckon distances and differences are the secret tonics of creativity. I always try to get ready for the new experience and understand the beauty of nature. I like to develop social attraction with people and know about their valuable information. I am a very open-minded person with a positive attitude and love to meet open-minded people too. Contact Feel free to contact me at maaz.amjad@ttu.edu or h.maazamjad@gmail.com if you are interested in working with me or have any questions.",
  "content_length": 2105,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:31"
}