{
  "name": "Madhu Mutyam",
  "homepage": "http://www.cse.iitm.ac.in/~madhu",
  "status": "success",
  "content": "Madhu Mutyam Dr. Madhu Mutyam Professor & Head CSB 23 Department of Computer Science and Engineering Indian Institute of Technology Madras Chennai - 600 036 Ph: +91 44 2257 4351/79 Fax: +91 44 2257 4352 Email: madhu AT cse DOT iitm DOT ac DOT in Teaching: CS6600: Computer Architecture (Jul-Nov'(25,22,21,20,19,18), Jan-May'(12,11)) CS6640: Advanced Computer Architecture (Jan-May'25) CS6620: Advanced Computer Organization and Architecture with Lab (Jan-May'(25,24), Jul-Nov'(22,21,20,19)) CS1100: Introduction to Programming (Jan-May'(22,14,12,10), Jul-Nov'(17,15)) CS2600: Computer Organization and Architecture (Jan-May'(22,21,19)) CS2610: Computer Organization and Architecture Lab (Jan-May'(22,21,19)) CS6630: Secure Processor Microarchitecture (Jan-May'20) CS2300: Foundations of Computer Systems Design (Jul-Nov'18) CS2310: Foundations of Computer Systems Design Lab (Jul-Nov'18) CS6560: Parallel Computer Architecture (Jan-May'(18,16,14), Jul-Nov'(12,11,10)) CS4100: Computer System Design (Jul-Nov'(16,15,13,12)) CS4110: Computer System Design Lab (Jul-Nov'(16,15,13,12,11)) NPTEL-MOOC: Computer Architecture (Jul-Aug'15) CS6200: Advanced Computer Architecture (Jan-May'13) CS2600: Computer Organization (Jan-May'11) CS2610: Assembly Language Programming Lab (Jan-May'11) CS2300: Switching Theory and Digital Design (Jul-Nov'(10,09,08)) CS2310: Digital Logic and Design Lab (Jul-Nov'(10,09,08)) CS6230: CAD for VLSI (Jan-May'(10,09,08)) Research Interests: Computer Architecture Heterogeneous Computing Systems Multicore Architecture Interconnection Networks Secure Processor Microarchitecture Current Research Students: Ph.D. Rahul Anilkumar Abdun Nihaal (Co-guided by Dr. Chester Rebeiro) Ingale Kranti Bhimrao M. Praseetha S.R. Swami Saranam Chongala M.S. (Research) Harikrishnan Tanmoy Das Adhar Dua Graduated Research Students: Ph.D. Praveen Kumar Alapati (2020) (Assistant Professor, Dept. of CSE, College of Engineering, Mahindra Ecole Centrale, Hyderabad) K. Raghavendra (2017) (Assistant Professor, Dept. of CSE, IIT Tirupati) Tripti S. Warrier (2016) (Assistant Professor, Dept. of Electronics, Cochin University of Science and Technology, Kerala) T.V. Kalyan (2015) (Assistant Professor, Dept. of CSE, IIT Ropar) John Jose (2014) (Associate Professor, Dept. of CSE, IIT Guwahati) M.S. (Research) Abdun Nihaal (2023) (Ph.D. Scholar, Dept of CSE, IIT Madras) Sai Deepak Bejawada (2022) (Software Engineer, Texas Instruments, Bengaluru) Joe Augustine (2021) (Hardware Developer, IBM, Bengaluru) Puneet Saraf (2020) (Design Engineer, AMD, Bengaluru) Sayantan Ray (2019) (Staff Engineer, Samsung Semiconductor Institute of Research, Bengaluru) Sudharsan Jagathrakshakan (2017) (Software Engineer, Pure Storage, Bengaluru) Pritam Majumder (2016) (PhD (Texas A&M), Silicon Domain Architect, Altera, Texas) Prasanna Venkatesh Rengasamy (2016) (PhD (Penn State), Software Engineer, Google, California) Aditya Arvind Kajwe (2014) (Technical Lead, TrackSmart Fleet Solutions, Ontario) Arpit Joshi (2011) (PhD (Univ of Edinburgh), Tech Lead, Intel, Oregon) Nayan Mujadiya (2011) (Lead Member Consulting Staff, Siemens EDA, Bengaluru) T.V. Kalyan (2009) (PhD (IITM), Assistant Professor, Dept. of CSE, IIT Ropar) Abu Saad Papa (2008) (Flutter Trainer, Naunihal Institute of Excellence, Chennai) Md. Abid Hussain (2008) (Senior Verification Engineer, Xilinx, Hyderabad) Research Publications IITM: Our Beautiful Campus Last modified: 18th Oct 2025",
  "content_length": 3454,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:34"
}