{
  "name": "Madhu Sudan 0001",
  "homepage": "http://madhu.seas.harvard.edu",
  "status": "success",
  "content": "Madhu Sudan – Gordon McKay Professor of Computer Science Harvard John A. Paulson School of Engineering and Applied Sciences Skip to content HARVARD.EDU I am a Professor of Computer Science at Harvard. My research is in the theories of computation and communication. I am very interested in understanding the many ways in which communication or computation can go wrong (i.e., have errors), and how to correct all such errors. My Bulletin Board: • I am teaching a mini-course on coding theory at the Computer Science dept at Bocconi University in Milan. Here’s a doc with more details. For other recent mini-courses on coding theory, see my talks page. • I chaired the Trevisan Prize 2025 search committee. Here’s the announcement of the winners. • I will be on sabbatical in Fall 2025. You can still reach me by email though responses may be delayed if I am traveling. • Of interest to Harvard CS students only: A DGS FAQ related to my past role as Director of grad studies. A Quals FAQ. Madhu Sudan Gordon McKay Professor of Computer Science Harvard John A. Poulson School of Engineering and Applied Sciences Member of Theory of Computation Group Some TOC pointers : Theory of Computing Seminars Address:Harvard SEC #3.434,150 Western Ave,Boston, MA 02134.madhu at cs dot harvard dot edu Research interests Communication & Computing, Coding theory, Property Testing, Algebra in Computation. Teaching I am on sabbatical leave in Fall 2025. Here are courses I’ve taught previously. Books/Monographs Efficient checking of polynomials …, (Ph.D. Thesis) Complexity Classification of Boolean Constraint Satisfaction Problems (with Nadia Creignou and Sanjeev Khanna) Essential Coding Theory (with Venkatesan Guruswami and Atri Rudra) Course notes Algebra and Computation Approximability of Optimization Problems Coding theory PCP Other online stuff Papers Talks Professional activities Foundations and Trends in Theoretical Computer Science (Founding Editor) Theory of Computing (Editor) Electronic Colloquium on Computational Complexity (Scientific Committee) Starkware (Scientific Advisor) Students Current Students Prashanth Amireddy (co-advised with Salil Vadhan) Cassandra Marcussen Aaron (Louie) Putterman (co-advised with Salil Vadhan). Former Students Yevgeniy Dodis (2000) Venkatesan Guruswami (2001) Eric Lehman (2002) Ryan O’Donnell (2003) Misha Alekhnovich (2003) Prahladh Harsha (2004) Adam Smith (2004) April Rasala Lehman (2005) Sergey Yekhanin (2007) Victor Chen (2009) Elena Grigorescu (2010) Brendan Juba (2010) Swastik Kopparty (2010) Ben Rossman (2010) Shubhangi Saraf (2011) Alan Guo (2015) Mohammad Bavarian (2017) Badih Ghazi (2018) Pritish Kamath (2019) Preetum Nakkiran (2021) Mitali Bafna (2022) Santhoshini Velusamy (2023) Jenny Kaufmann (2025, primary advisor was Virginia Vassilevska Williams) Postdocs Luca Trevisan (1997) Salil Vadhan (1998) Lars Engebretsen (2000) Eli Ben-Sasson (2001-2003) Amir Shpilka (2002) Julia Chuzhoy (2004-2006) Tali Kaufman (2007-2009) Jakob Nordström (2008-2010) Elad Haramaty (2016-2017) Mrinal Kumar (2017-2018) Huacheng Yu (2017-2019) Omri Ben-Eliezer (2020-2021) Amirbehshad Shahrasbi (2020-2021) Sumegha Garg (2020-2022) CV+Bio Bio Short CV Long CV close menu close search Search Search Site",
  "content_length": 3250,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:35"
}