{
  "name": "Mae Milano",
  "homepage": "https://www.cs.princeton.edu/~mpmilano",
  "status": "success",
  "content": "Mae Milano Search Mae Milano PhD, Programming Languages and Systems Princeton University Hi! I’m Mae! I’m an assistant professor at Princeton University, and you’ve found my mostly-research website! My research focuses on designing new Programming Languages to solve problems in Distributed Systems. I also have active, exciting projects purely in PL or DS. My students and I are part of both the Princeton (non-ML) Systems group and Programming Languages group. PhD/MS Students Mohanna Shahrad Amelia Dobis Rupashree Rangaiyengar Liz Austell Raye Kimmerer Romina Mahinpei Close Student Collaborators Leon Schuermann Natalie Popescu Anja Kalaba Shadaj Laddad Benjamin Driscoll Selected Recent Publications Please use this link for a full list, which can be filtered to show only peer-reviewed articles appearing in journals or at major conferences. Building Bridges: Safe Interactions with Foreign Languages through Omniglot Leon Schuermann, Jack Toubes, Tyler Potyondy, Pat Pannuto, Mae Milano, Amit Levy OSDI 2025 PDF Project Flo: A Semantic Foundation for Progressive Stream Processing Streaming systems are present throughout modern applications, processing continuous data in real-time. Existing streaming languages … Shadaj Laddad, Alvin Cheung, Joseph M. Hellerstein, Mae Milano POPL 2025 PDF Project DOI Better Defunctionalization through Lambda Set Specialization Higher-order functions pose a challenge for both static program analyses and optimizing compilers. To simplify the analysis and … William Brandon, Benjamin Driscoll, Frank Dai, Wilson Berkow, Mae Milano PLDI 2023 PDF Project DOI Keep CALM and CRDT On Despite decades of research and practical experience, developers have few tools for programming reliable distributed applications … Shadaj Laddad, Conor Power, Mae Milano, Alvin Cheung, Joseph M. Hellerstein PVLDB 16.4 PDF Project Project Project DOI A flexible type system for fearless concurrency This paper proposes a new type system for concurrent programs, allowing threads to exchange complex object graphs without risking … Mae Milano, Joshua Turcotti, Andrew Myers PLDI 2022 PDF Cite Project Project DOI Projects * Bringing Fearless Concurrency to the Masses We’re building new languages for safely programming with shared mutable objects. In our work, threads can freely exchange mutable objects and manipulate state concurrently—with no possibility of a destructive data race. Hydro: Software that Runs at Every Scale The Hydro Project at UC Berkeley is developing cloud-native programming models that allow anyone to develop scalable and reslilient distributed applications that take full advantage of the elasticity of cloud infrastructure. Our research spans across databases, distributed systems, and programming languages to deliver a modern, end-to-end stack for cloud programming. Morphic: Pure Functional Code at the Speed of C Morphic is an experimental pure functional programming language designed to achieve performance competitive with imperative systems languages like C++ and Rust. Gallifrey: a New Language for Distributed Programming Gallifrey is a new programming language for distributed wide-area applications. Gallifrey programs share state via replication, granting fast access to data without introducing mandatory synchronization points, all while maintaining sequential consistency by default. Gallifrey aims to be easy-to-use, requiring a minimal annotation overhead atop an otherwise Java-like language. Programming Replicated, Distributed Systems Distributed Languages frequently either fail to capture replication, or insist in high-latency lockstep state machine replication. Storage systems which avoid both pitfalls often do so by weakening consistency. We try to rein in weak consistency and capture replication and concurrency, all while constructively avoiding races and allowing safe, loosely-synchronized replication. Derecho: Programming the Datacenter Derecho is a new framework for building replicated, fault-tolerant distributed systems within a datacenter. It provides a best-in-class consistent multicast abstraction, and is easy to use via user-defined replicated objects and RPC. Recent Talks More Talks Researching with, and as, an Undergraduate Student Building a syllabus for a semester of undergraduate research. Jan 6, 2024 9:05 AM PLMW at POPL 2024 Mae Milano Programming Distributed Systems Careful Language Design builds Better Systems Sep 21, 2023 1:40 PM — 2:20 PM Papers We Love at Strangeloop 2023 Mae Milano Project Project Project Video A New Type System for Fearless Concurrency Presenting a new type system for Fearless Concurrency May 30, 2023 12:00 AM — 12:00 AM MIT Programming Languages Review Mae Milano Project Project Researching with Undergraduates: a Curricular Approach Building a syllabus for a semester of undergraduate research. Dec 6, 2022 9:05 AM Doctoral Symposium at SPLASH 2022 Mae Milano Recent Posts Looking for new PhD students! Princeton’s CS PhD program is now open and accepting applications Mae Milano Last updated on Oct 25, 2023 3 min read My Dissertation is Now Available! My dissertation is now available here Mae Milano Last updated on Dec 31, 2021 3 min read Mixing Consistency with MixT: Technical Report Available! Presenting MixT, our language for sanely mixing distinct consistency levels within a single transaction. Now in Tech Report form! Mae Milano Last updated on Dec 31, 2021 2 min read Teaching CS 294-170: Graduate Seminar: Programming the Cloud The public clouds are the most powerful general-purpose computers ever assembled, allowing individuals to rent their power at unlimited scale, on demand. This makes “the cloud” the biggest game-changer in computing access since the adoption of the PDP-11 minicomputer in the early 1970s. However, unlike the advent of UNIX and C for PDP-11, an organic programming model has yet to emerge for the cloud. History suggests that the real innovation on new platforms comes when the right programming model is introduced. The challenge of helping developers program the cloud spans areas: Programming Languages, Distributed Systems, Databases, and Operating Systems, to name a few. In this seminar we will read research papers together, and bootstrap new efforts in this area. CS 2043: Unix Tools and Systems UNIX and UNIX-like systems are increasingly being used on personal computers, mobile phones, web servers, and many other systems. They represent a wonderful family of programming environments useful both to computer scientists and to people in many other fields, such as computational biology and computational linguistics, in which data is naturally represented by strings. This course takes students from shell basics and piping, to regular-expression processing tools, to shell scripting and Python. Other topics to be covered include handling concurrent and remote resources, manipulating streams and files, and managing software installations. CS195r: Compilers Compilers are a subject fundamental to Computer Science, helping bridge the gap between a program’s abstract semantics and the target machine’s capabilities. In this course, we follow Andrew Appel’s curriculum to design and build a compiler from scratch, in a radically collaborative and open-ended environment. Cite × Copy Download",
  "content_length": 7287,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:37"
}