{
  "name": "Magda Gregorova",
  "homepage": "https://fiw.thws.de/fakultaet/personen/dozentinnen-und-dozenten/person/prof-dr-magda-gregorova",
  "status": "success",
  "content": "Dozentinnen und Dozenten :: Technische Hochschule Würzburg-Schweinfurt Zum Inhalt wechseln Zum Hauptmenü wechseln Zum Navigationspfad wechseln Zur Suche wechseln Zur Sprachauswahl wechseln Zur Servicenavigation wechseln Dozentinnen und Dozenten Prof. Dr. Magda Gregorová Fakultät Informatik und Wirtschaftsinformatik Telefon +49 931 3511-8338 E-Mail magda.gregorova[at]thws.de Besucheranschrift Franz-Horn-Straße 2 97082 Würzburg Raum K.1.06 Aufgabenbereich(e) Professor for Representation and Learning in Artificial IntelligenceMember of CAIRO, Center for Artificial Intelligence (cairo.thws.de) Projekte Projects I'm a member of CAIRO, Center for Artifificial Intelligence. Projects:ML-EMPerform: Machine learning surrogate modeling of electrical motor performance (2025-26). This project aims to develop deep learning (DL) methods for predicting the performance of EM bypassing the FEM-based simulation methods. The surrogate DL methods shall be significantly faster than the FEM-based simulations allowing for notable speed-ups in the EM design process.PhysioInk - data analysis and active planning of an experimental study (2025-27).The overall goal of the project is the development of \"quality\" bio-ink that enables the printing of physiological tissues. The task of THWS is to support researchers and developers in the life science field by using modern methods of artificial intelligence and experimental design, employing a central database and data analysis system provided for the partners. Innovative solutions provided by THWS through data analysis should offer optimal, accelerated, and targeted methods, as well as variation possibilities for the development and production of the bio-ink.Closed projects:KI Transfer+ (2023-2025) (KIRZ) Publikationen Publications DBLPGoogle Scholar Publikationen OPUS Veröffentlichungen nach Jahren:20252024202320222021202020192018201720152025Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenVaeth, PhilippKumar, DibyanshuPaassen, BenjaminGregorova, MagdaDiffusion Classifier Guidance for Non-robust Classifiers2025BibTeXRISKumar, DibyanshuVaeth, PhilippGregorova, MagdaLoss Functions in Diffusion Models: A Comparative Study2025BibTeXRIS2024Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenHeroth, MichaelSchmid, Helmut C.Gregorová, MagdaHerrler, RainerHofmann, WilfriedVariational Autoencoder-Based Multiobjective Topology Optimization of Electrical Machines Using Vector Graphics2024BibTeXRISBenkert, MariusHeroth, MichaelHerrler, RainerGregorová, MagdaSchmid, Helmut C.Variational autoencoder-based techniques for a streamlined cross-topology modeling and optimization workflow in electrical drives2024BibTeXRISBoget, YoannGregorová, MagdaKalousis, AlexandrosDiscrete Graph Auto-Encoder2024BibTeXRISAdemola, EstherReich, MartinGregorová, MagdaAn Investigative Study Exploring Machine Learning Approaches for Optimizing Deep Brain Stimulation Programming2024BibTeXRISVäth, PhilippFrühwald, Alexander M.Paassen, BenjaminGregorová, MagdaGradCheck: Analyzing classifier guidance gradients for conditional diffusion sampling2024BibTeXRISVäth, PhilippFrühwald, Alexander M.Paassen, BenjaminGregorová, MagdaGenerative Example-Based Explanations: Bridging the Gap between Generative Modeling and Explainability2024BibTeXRIS2023Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenBoget, YoannGregorová, MagdaKalousis, AlexandrosVector-Quantized Graph Auto-Encoder2023BibTeXRISVäth, PhilippFrühwald, Alexander M.Paaßen, BenjaminGregorová, MagdaDiffusion-based Visual Counterfactual Explanations - Towards Systematic Quantitative Evaluation2023BibTeXRIS2022Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenBoget, YoannGregorová, MagdaKalousis, AlexandrosGraph annotation generative adversarial networks2022BibTeXRISBoget, YoannGregorová, MagdaKalousis, AlexandrosGrannGAN: Graph annotation generative adversarial networks2022BibTeXRIS2021Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenGregorová, MagdaDesaules, MarcKalousis, AlexandrosLearned transform compression with optimized entropy encoding2021BibTeXRISBoget, YoannGregorová, MagdaKalousis, AlexandrosPermutation Equivariant Generative Adversarial Networks for Graphs2021BibTeXRIS2020Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenLavda, FrantzeskaGregorová, MagdaKalousis, AlexandrosData-Dependent Conditional Priors for Unsupervised Learning of Multimodal Data2020BibTeXRISRamapuram, JasonGregorová, MagdaKalousis, AlexandrosLifelong generative modeling2020BibTeXRISLavda, FrantzeskaGregorová, MagdaKalousis, AlexandrosImproving VAE Generations of Multimodal Data Through Data-Dependent Conditional Priors2020BibTeXRIS2019Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenGregorová, MagdaSparse Learning for Variable Selection with Structures and Nonlinearities2019BibTeXRISLavda, FrantzeskaGregorová, MagdaKalousis, AlexandrosImproving VAE generations of multimodal data through data-dependent conditional priors2019BibTeXRIS2018Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenGregorová, MagdaRamapuram, JasonKalousis, AlexandrosMarchand-Maillet, StéphaneLarge-Scale Nonlinear Variable Selection via Kernel Random Features2018BibTeXRISGregorová, MagdaKalousis, AlexandrosMarchand-Maillet, StéphaneStructured nonlinear variable selection2018BibTeXRISGregorová, MagdaRamapuram, JasonKalousis, AlexandrosMarchand-Maillet, StéphaneLarge-scale Nonlinear Variable Selection via Kernel Random Features2018BibTeXRISGregorová, MagdaKalousis, AlexandrosMarchand-Maillet, StéphaneStructured nonlinear variable selection2018BibTeXRISLavda, FrantzeskaRamapuram, JasonGregorová, MagdaKalousis, AlexandrosContinual Classification Learning Using Generative Models2018BibTeXRIS2017Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenGregorová, MagdaKalousis, AlexandrosMarchand-Maillet, StéphaneLearning Predictive Leading Indicators for Forecasting Time Series Systems with Unknown Clusters of Forecast Tasks2017BibTeXRISGregorová, MagdaKalousis, AlexandrosMarchand-Maillet, StéphaneForecasting and Granger Modelling with Non-linear Dynamical Dependencies2017BibTeXRISRamapuram, JasonGregorová, MagdaKalousis, AlexandrosLifelong Generative Modeling2017BibTeXRISGregorová, MagdaKalousis, AlexandrosMarchand-Maillet, StéphaneForecasting and Granger Modelling with Non-linear Dynamical Dependencies2017BibTeXRIS2015Autorinnen und AutorenTitelErscheinungsjahrMetadaten exportierenGregorová, MagdaKalousis, AlexandrosMarchand-Maillet, StéphaneWang, JunLearning vector autoregressive models with focalised Granger-causality graphs2015BibTeXRIS Vita Vita Magda Gregorova comes from Prague, Czech Republic, where she obtained her Master‘s degree in Statistics (2001) from the University of Economics. She started her career as an applied statistician in the Czech National Bank, where she headed a technical unit on financial statistics and collaborated closely with the ECB and the IMF. After several years in banking she has decided to follow an international career and joined Eurocontrol, the European Organization for the Safety of Air Navigation based in Brussels, Belgium, as a statistical analyst and forecaster. She then moved to Geneva, Switzerland, where she obtained in 2018 a PhD in machine learning from the Computer Science Department of the University of Geneva. She continued as a post-doc in the Data Mining and Machine Learning group of the University of Applied Sciences of Western Switzerland. In 2021 Magda has moved to Germany, where she obtained the research professorship for “Representation and Learning in Artificial Intelligence” at the Faculty of Computer Science and Business Information Systems of the Technical University of Applied Sciences Würzburg-Schweinfurt (THWS). She is a founding member of the THWS research Center for Artificial Intelligence (CAIRO) which she has led from its beginnings in 2022 till mid 2024. Her teaching activities are mainly within the international masters on AI in the areas of deep learning and generative modelling. In her research she focuses on deep unsupervised learning methods for modelling complex high-dimensional distributions and data representations for downstream tasks (google scholar). In addition to her own research she regularly contributes to the machine learning community through reviewing service (ICML, ICLR, NeurIPS, etc.) and by active participation in outreach and educational events such as IK. Weitere Informationen Academic service BoardsFIW, THWS - member of the faculty boardFaculty of Informatics and Statistics, University of Economics and Business, Prague, Czech Republic - member of the scientific boardExecutive Committee Interdisciplinary College GI-KIConference organizing committeeKI2025 is the 48th German Conference on Artificial Intelligence - tutorial/workshop chairProgram committee / editorial boardArea ChairNeurIPS 2024, 2025Action EditorTMLR since 2024TMLR Expert Reviewer Recognition - 2025ReviewerECML-PKDD 2022ICLR 2022, 2023, 2025ICML 2021, 2022, 2023, 2024MCPR 2021, 2022NeurIPS 2021, 2022TMLR since 2022MDIS 2024FNR Core Program, Luxembourg 2021, 2022, 2023 Teaching I teach primarily in Masters Artificial IntelligenceCourses:Artificial Neural Networks and Cognitive Models (SoSe 2022-24), E-learningScientific Seminar (WiSe 2022- ), E-learningDeep Unsupervised Learning (WiSe 2024), GitHubCourse responsible:Project Module (2022- ), E-learning Master thesisEsther Ademola: Weakly Supervised Semantic Segmentation of Multispectral Satellite Images for Land Cover Mapping (2024, THWS) (GiHub)Muhammad Zakriya Shah Sarawr: Step Detection (2023, THWS) (GitHub)Marius Benkert: Cross Topology Modeling and Optimization of Electrical Drives Using Machine Learning (2023, THWS, 2nd supervisor) (journal paper)Ana Muñoz Gutiérrez: Transfer Learning in Crop Remote Sensing (2023, THWS) (GitHub)Alexander Lorz: Entwicklung eines neuronalen Netze zur gezielten Veränderung von Bil",
  "content_length": 11003,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:43"
}