{
  "name": "Magnus Lie Hetland",
  "homepage": "https://www.ntnu.edu/employees/mlh",
  "status": "success",
  "content": "Magnus Lie Hetland - NTNU Magnus Lie Hetland Download press photo Download press photo Foto: Close Magnus Lie Hetland Associate Professor Department of Computer Science mlh@ntnu.no 303 Gamle fysikk Gløshaugen, Trondheim About I work with algorithms and data structures. See hetland.org for details. Publications 2024 Hetland, Magnus Lie; Nelli, Fabio. (2024) Beginning Python: From Novice to Professional, Fourth Edition. Apress Apress Popular scientific book Hummel, Halvard; Hetland, Magnus Lie. (2024) Maximin Shares in Structured Fair Allocation. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation 2022 Hummel, Halvard; Hetland, Magnus Lie. (2022) Maximin Shares Under Cardinality Constraints. Academic chapter/article/Conference paper 2021 Hummel, Halvard; Hetland, Magnus Lie. (2021) Fair allocation of conflicting items. Autonomous Agents and Multi-Agent Systems Academic article Hetland, Magnus Lie; Hummel, Halvard. (2021) Fairest Neighbors: Tradeoffs Between Metric Queries. Academic chapter/article/Conference paper 2020 Hetland, Magnus Lie. (2020) Optimal Metric Search Is Equivalent to the Minimum Dominating Set Problem. Academic chapter/article/Conference paper Hetland, Magnus Lie. (2020) Metrics and Ambits and Sprawls, Oh My: Another Tutorial on Metric Indexing. Academic chapter/article/Conference paper 2017 Hetland, Magnus Lie. (2017) Beginning Python: From Novice to Professional, Third Edition. Apress Apress Popular scientific book 2015 Hetland, Magnus Lie. (2015) Ptolemaic Indexing. Journal of Computational Geometry Academic article 2014 Naidan, Bilegsaikhan; Hetland, Magnus Lie. (2014) Static-to-dynamic transformation for metric indexing structures (extended version). Information Systems Academic article Hetland, Magnus Lie. (2014) Python Algorithms: Python Algorithms Mastering Basic Algorithms in the Python Language, Second Edition. Apress Apress Popular scientific book 2013 Hetland, Magnus Lie; Skopal, Tomas; Lokoc, Jakub; Beecks, Christian. (2013) Ptolemaic access methods: Challenging the reign of the metric space model. Information Systems Academic article 2012 Eleyat, Mujahed Omar Qasim; Haugland, Dag; Hetland, Magnus Lie; Natvig, Lasse. (2012) Parallel algorithms for the maximum flow problem with minimum lot sizes. Academic chapter/article/Conference paper Bratsberg, Svein Erik; Hetland, Magnus Lie. (2012) Dynamic optimization of queries in pivot-based indexing. Multimedia Tools and Applications Academic article 2011 Lokoc, Jakub; Hetland, Magnus Lie; Skopal, Tomas; Beecks, Christian. (2011) Ptolemaic Indexing of the Signature Quadratic Form Distance. Academic chapter/article/Conference paper Haugland, Dag; Eleyat, Mujahed; Hetland, Magnus Lie. (2011) The maximum flow problem with minimum lot sizes. Lecture Notes in Computer Science (LNCS) Academic article 2010 Hetland, Magnus Lie. (2010) Python Algorithms: Mastering Basic Algorithms in the Python Language. Apress Apress Textbook Edsberg, Ole; Hetland, Magnus Lie. (2010) Indexing Inexact Proximity Search with Distance Regression in Pivot Space. Academic chapter/article/Conference paper Grimsmo, Nils; Bjørklund, Truls Amundsen; Hetland, Magnus Lie. (2010) Linear Computation of the Maximum Simultaneous Forward and Backward Bisimulation for Node-Labeled Trees. Lecture Notes in Computer Science (LNCS) Academic article Grimsmo, Nils; Bjørklund, Truls Amundsen; Hetland, Magnus Lie. (2010) Fast Optimal Twig Joins. Proceedings of the VLDB Endowment Academic article 2009 Hetland, Magnus Lie. (2009) The Basic Principles of Metric Indexing. Academic chapter/article/Conference paper 2008 Hetland, Magnus Lie. (2008) Beginning Python: From Novice to Professional, Second Edition. Apress Apress Popular scientific book 2005 Hetland, Magnus Lie. (2005) Beginning Python : From Novice to Professional. Apress Apress Non-fiction book Arentz, Will Archer; Hetland, Magnus Lie; Olstad, Bjørn. (2005) Methods for retrieving musical information based on rhythm and pitch correlations. Journal of New Music Research Academic article Hetland, Magnus Lie; Sætrom, Pål. (2005) Evolutionary Rule Mining in Time Series Databases. Machine Learning Academic article 2004 Hetland, Magnus Lie; Sætrom, Pål. (2004) Temporal rule discovery using genetic programming and specialized hardware. Academic chapter/article/Conference paper Hetland, Magnus Lie. (2004) A survey of recent methods for efficient retrieval of similar time sequences. Academic chapter/article/Conference paper 2003 Hetland, Magnus Lie; Sætrom, Pål. (2003) A Comparison of Hardware and Software in Sequence Rule Evolution. Academic chapter/article/Conference paper Hetland, Magnus Lie. (2003) Evolving Sequence Rules. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Sætrom, Pål; Hetland, Magnus Lie. (2003) Multiobjective Evolution of Temporal Rules. Academic chapter/article/Conference paper 2002 Hetland, Magnus Lie; Sætrom, Pål. (2002) Temporal rule discovery using genetic programming and specialized hardware. Academic chapter/article/Conference paper Hetland, Magnus Lie. (2002) Practical Python. Apress Apress Non-fiction book Journal publications Hummel, Halvard; Hetland, Magnus Lie. (2021) Fair allocation of conflicting items. Autonomous Agents and Multi-Agent Systems Academic article Hetland, Magnus Lie. (2015) Ptolemaic Indexing. Journal of Computational Geometry Academic article Naidan, Bilegsaikhan; Hetland, Magnus Lie. (2014) Static-to-dynamic transformation for metric indexing structures (extended version). Information Systems Academic article Hetland, Magnus Lie; Skopal, Tomas; Lokoc, Jakub; Beecks, Christian. (2013) Ptolemaic access methods: Challenging the reign of the metric space model. Information Systems Academic article Bratsberg, Svein Erik; Hetland, Magnus Lie. (2012) Dynamic optimization of queries in pivot-based indexing. Multimedia Tools and Applications Academic article Haugland, Dag; Eleyat, Mujahed; Hetland, Magnus Lie. (2011) The maximum flow problem with minimum lot sizes. Lecture Notes in Computer Science (LNCS) Academic article Grimsmo, Nils; Bjørklund, Truls Amundsen; Hetland, Magnus Lie. (2010) Linear Computation of the Maximum Simultaneous Forward and Backward Bisimulation for Node-Labeled Trees. Lecture Notes in Computer Science (LNCS) Academic article Grimsmo, Nils; Bjørklund, Truls Amundsen; Hetland, Magnus Lie. (2010) Fast Optimal Twig Joins. Proceedings of the VLDB Endowment Academic article Arentz, Will Archer; Hetland, Magnus Lie; Olstad, Bjørn. (2005) Methods for retrieving musical information based on rhythm and pitch correlations. Journal of New Music Research Academic article Hetland, Magnus Lie; Sætrom, Pål. (2005) Evolutionary Rule Mining in Time Series Databases. Machine Learning Academic article Books Hetland, Magnus Lie; Nelli, Fabio. (2024) Beginning Python: From Novice to Professional, Fourth Edition. Apress Apress Popular scientific book Hetland, Magnus Lie. (2017) Beginning Python: From Novice to Professional, Third Edition. Apress Apress Popular scientific book Hetland, Magnus Lie. (2014) Python Algorithms: Python Algorithms Mastering Basic Algorithms in the Python Language, Second Edition. Apress Apress Popular scientific book Hetland, Magnus Lie. (2010) Python Algorithms: Mastering Basic Algorithms in the Python Language. Apress Apress Textbook Hetland, Magnus Lie. (2008) Beginning Python: From Novice to Professional, Second Edition. Apress Apress Popular scientific book Hetland, Magnus Lie. (2005) Beginning Python : From Novice to Professional. Apress Apress Non-fiction book Hetland, Magnus Lie. (2002) Practical Python. Apress Apress Non-fiction book Part of book/report Hummel, Halvard; Hetland, Magnus Lie. (2022) Maximin Shares Under Cardinality Constraints. Academic chapter/article/Conference paper Hetland, Magnus Lie; Hummel, Halvard. (2021) Fairest Neighbors: Tradeoffs Between Metric Queries. Academic chapter/article/Conference paper Hetland, Magnus Lie. (2020) Optimal Metric Search Is Equivalent to the Minimum Dominating Set Problem. Academic chapter/article/Conference paper Hetland, Magnus Lie. (2020) Metrics and Ambits and Sprawls, Oh My: Another Tutorial on Metric Indexing. Academic chapter/article/Conference paper Eleyat, Mujahed Omar Qasim; Haugland, Dag; Hetland, Magnus Lie; Natvig, Lasse. (2012) Parallel algorithms for the maximum flow problem with minimum lot sizes. Academic chapter/article/Conference paper Lokoc, Jakub; Hetland, Magnus Lie; Skopal, Tomas; Beecks, Christian. (2011) Ptolemaic Indexing of the Signature Quadratic Form Distance. Academic chapter/article/Conference paper Edsberg, Ole; Hetland, Magnus Lie. (2010) Indexing Inexact Proximity Search with Distance Regression in Pivot Space. Academic chapter/article/Conference paper Hetland, Magnus Lie. (2009) The Basic Principles of Metric Indexing. Academic chapter/article/Conference paper Hetland, Magnus Lie; Sætrom, Pål. (2004) Temporal rule discovery using genetic programming and specialized hardware. Academic chapter/article/Conference paper Hetland, Magnus Lie. (2004) A survey of recent methods for efficient retrieval of similar time sequences. Academic chapter/article/Conference paper Hetland, Magnus Lie; Sætrom, Pål. (2003) A Comparison of Hardware and Software in Sequence Rule Evolution. Academic chapter/article/Conference paper Sætrom, Pål; Hetland, Magnus Lie. (2003) Multiobjective Evolution of Temporal Rules. Academic chapter/article/Conference paper Hetland, Magnus Lie; Sætrom, Pål. (2002) Temporal rule discovery using genetic programming and specialized hardware. Academic chapter/article/Conference paper Report Hummel, Halvard; Hetland, Magnus Lie. (2024) Maximin Shares in Structured Fair Allocation. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Hetland, Magnus Lie. (2003) Evolving Sequence Rules. N",
  "content_length": 13780,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:43"
}