{
  "name": "Magnus Själander",
  "homepage": "https://www.ntnu.edu/employees/magnus.sjalander",
  "status": "success",
  "content": "Magnus Själander - NTNU Magnus Själander Download press photo Download press photo Foto: Close Magnus Själander Professor and Head of the Computing Unit Department of Computer Science magnus.sjalander@ntnu.no IT-vest, 410, Gløshaugen Google Scholar CAL EECS About Magnus Själander is a Professor at the Department of Computer Science and has been a Visiting Senior Lecturer at the Department of Information Technology, Uppsala University (2016-2021) and Visiting Professor at the NUS School of Computing, National University of Singapore (2022). He is the coordinator of the Energy Efficient Computing Systems (EECS) strategic research initiative at NTNU, the head of the Computing unit at the Department of Computer Science, NTNU, and a member of NTNU's Literature Committee. He is a member of the National Academic Council for ICT (since 2025), which is responsible for managing the Norwegian Register for Scientific Journals, Series, and Publishers. Själander has an M.Sc. from Luleå University of Technology, a Ph.D. from Chalmers University of Technology, and a Docent from Uppsala University. Before joining NTNU, Själander worked as a Digital Design Engineer at Aeroflex Gaisler (2008-2009) and as a researcher at NXP Semiconductors (2007), Florida State University (2012-2013), and Uppsala University (2014-2015). Själander's research focuses on the design (compilers, architecture, and hardware implementation) of secure, high-performance, and energy-efficient systems at all scales. Själander is a senior member of ACM and IEEE, as well as member of the HiPEAC European Network of Excellence. Själander was an Associate Editor (2019-2024) of the Journal of Parallel and Distributed Computing (JPDC). Selected Publications See the Google Scholar profile for complete list of publications. Power Efficiency and Sustainability S. Sheikhpour, D. Metz, E. Jellum, M. Själander, and L. Eeckhout, \"Sustainable High-Performance Instruction Selection for Superscalar Processors\", Proceedings of the ACM/IEEE International Conference on Computer-Aided Design (ICCAD), Oct. 2024. M. Själander, M. Martonosi, and S. Kaxiras, \"Power-Efficient Computer Architectures: Recent Advances\", Synthesis Lectures on Computer Architecture, Morgan & Claypool, Dec. 2014. ISBN: 978-1-62705-645-8. B. Goel, S. A. McKee, and M. Själander, \"Techniques to Measurement, Model, and Manage Power\", Advances in Computers, Green and Sustainable Computing: Part I vol. 87, Nov. 2012. ISBN: 978-0-12-396528-8 Secure Speculative Execution A. Bergland Kvalsvik and M. Själander, \"ShadowBinding: Realizing Effective Microarchitectures for In-Core Secure Speculation Schemes\", Proceedings of the ACM/IEEE International Conference on Computer-Aided Design (ICCAD), Oct. 2025. P. Aimoniotis, A. Kvalsvik, M. Själander, and S. Kaxiras, \"ReCon: Efficient Detection, Management, and Use of Non-Speculative Information Leakage\" Proceedings of the ACM/IEEE International Symposium on Microarchitecture (MICRO), Oct. 2023. A. Kvalsvik, P. Aimoniotis, S. Kaxiras, and M. Själander, \"Doppelganger Loads: A Safe, Complexity-Effective Optimization for Secure Speculation Schemes\", Proceedings of the ACM/IEEE International Symposium on Computer Architecture (ISCA), June 2023. C. Sakalis, S. Kaxiras, and M. Själander, \"Delay-on-Squash: Stopping Microarchitectural Replay Attacks in Their Tracks\", ACM Transactions on Architecture and Code Optimization (TACO), vol. 20, no. 1, pp. 1-24, Mar. 2023. P. Aimoniotis, C. Sakalis, M. Själander, and S. Kaxiras, \"Reorder Buffer Contention: A Forward Speculative Interference Attack for Speculation Invariant Instructions\", IEEE Computer Architecture Letters (CAL), vol. 20, no. 2, pp. 162-165, 2021. P. Aimoniotis, A. Kvalsvik, M. Själander, and S. Kaxiras, \"Data-Out Instruction-In (DOIN!): Leveraging Inclusive Caches to Attack Speculative Delay Schemes\", IEEE International Symposium on Secure and Private Execution Environment Design (SEED), vol. 32, pp. 49-60, Sep. 2022. K.-A. Tran, C. Sakalis, M. Själander, A. Ros, S.Kaxiras, and A. Jimborean, \"Clearing the Shadows: Recovering Lost Performance for Invisible Speculative Execution through HW/SW Co-Design\", Proceedings of the ACM International Conference on Parallel Architectures and Compilation Techniques (PACT), Oct. 2020. C. Sakalis, S. Kaxiras, A. Ros, A. Jimborean, and M. Själander, \"Understanding Selective Delay as a Method for Efficient Secure Speculative Execution\", IEEE Transactions on Computers (TC), Aug. 2020. C. Sakalis, S.Kaxiras, A. Ros, A. Jimborean, and M. Själander, \"Efficient Invisible Speculative Execution through Selective Delay and Value Prediction\", Proceedings of the ACM/IEEE International Symposium on Computer Architecture (ISCA), June 2019. C. Sakalis, M. Alipour, A. Ros, A. Jimborean, S. Kaxiras, and M. Själander, \"Ghost loads: what is the cost of invisible speculation?\", Proceedings of the ACM International Conference on Computing Frontiers (CF), pp. 153-163, May 2019. Optimizing Compilers and High-Level Synthesis H. Rognebakke Krogstie, H. Bahmann, M. Själander, N. Reissmann, \"PIP: Making Andersen’s Points-to Analysis Sound and Practical for Incomplete C Programs\", Proceedings of the IEEE/ACM International Symposium on Code Generation and Optimization (CGO), Feb. 2026. D. Metz, N. Reissmann, and M. Själander, \"R-HLS: An IR for Dynamic High-Level Synthesis and Memory Disambiguation based on Regions and State Edges\", Proceedings of the ACM/IEEE International Conference on Computer-Aided Design (ICCAD), Oct. 2024. N. Reissmann, J. C. Meyer, H. Bahmann, and M. Själander, \"RVSDG: An Intermediate Representation for Optimizing Compilers\", ACM Transactions on Embedded Computing Systems (TECS), Mar. 2020. Bit-serial Matrix-matrix Multiplication D. Metz, V. Kumar, and M. Själander, \"BISDU: A Bit-Serial Dot-Product Unit for Microcontrollers\", ACM Transactions on Embedded Computing Systems (TECS), 2023. Y. Umuroglu, C. Davide, L. Rasnayake, T. B Preusser, and M. Själander, \"Optimizing Bit-Serial Matrix Multiplication for Reconfigurable Computing\", ACM Transactions on Reconfigurable Technology and Systems (TRETS), vol. 12, no. 3, pp. 1-24, Aug. 2019. Y. Umuroglu, L. Rasnayake, and M. Själander, \"BISMO: A Scalable Bit-Serial Matrix Multiplication Overlay for Reconfigurable Computing\", Proceedings of the IEEE International Conference on Field-Programmable Logic and Applications (FPL), Aug. 2018. Instruction Scheduling K.-A. Tran, A. Jimborean, T. Carlson, K. Koukos, M. Själander, and S. Kaxiras, \"SWOOP: Software-Hardware Co-Design for Non-Speculative, Execute-Ahead, In-Order Cores\", Proceedings of the ACM International Conference on Programming Language Design and Implementation (PLDI), pp. 328-343, June 2018. K.-A. Tran, T. Carlson, K. Koukos, M. Själander, V. Spiliopoilos, S. Kaxiras, and A. Jimborean, \"Clairvoyance: Look-Ahead Compile-time Scheduling\", Proceedings of the IEEE/ACM International Symposium on Code Generation and Optimization (CGO), pp. 171-184, 4-8 Feb. 2017. K.-A. Tran, T. Carlson, K. Koukos, M. Själander, V. Spiliopoulos, S. Kaxiras, and A. Jimborean, \"Static Instruction Scheduling for High Performance on Limited Hardware\", IEEE Transactions on Computers (TC), vol. 67, no. 4, pp. 513-527, Nov. 2017. B. Davis, P. Gavin, R. Baird, M. Själander, I. Finlayson, F. Rasapour, G. Cook, G.-R. Uh, D. Whalley and G. Tyson, \"Scheduling Instruction Effects for a Statically Pipelined Processor\", Proceedings of the International Conference on Compilers, Architectures, and Synthesis of Embedded Systems (CASES), pp. 167-176, 4-9 Oct. 2015. M. Thuresson, M. Själander, M. Björk, L. Svensson, P. Larsson-Edefors, and P. Stenström, \"FlexCore: Utilizing Exposed Datapath Control for Efficient Computing\", Journal of Signal Processing Systems, vol. 57, no. 1, pp. 5-19, Oct. 2009. Task Scheduling R. Nishtala, V. Petrucci, P. M. Carpenter, and M. Själander, \"Twig: Multi-Agent Task Management for Colocated Latency-Critical Cloud Services\", Proceedings of the ACM International Conference on High-Performance Computer Architecture (HPCA), Feb. 2020. M. Själander, A. Terechko, M. Duranton, \"A Look-Ahead Task Management Unit for Embedded Multi-Core Architectures\", Proceedings of Euromicro Conference on Digital System Design: Architectures, Methods, and Tools (DSD), pp. 149-157, 3-5 Sep. 2008. Multiplier Design T. Hoang-Thanh, M. Själander, and P. Larsson-Edefors, \"High-Speed, Energy-Efficient Two-Cycle Multiply-Accumulate (MAC) Architecture and Its Application to a Double-Throughput MAC Unit\", IEEE Transactions on Circuits and Systems, I: Regular papers, Invited for SOCC Special Issue (TCAS-I), vol. 57, no. 12, pp. 3073-3081, Dec. 2010 M. Själander, and P. Larsson-Edefors, \"Multiplication Acceleration through Twin Precision\", IEEE Transactions on Very Large Scale Integration (VLSI) Systems (TVLSI), vol. 17, no. 9, pp. 1233-1246, Sep. 2009. H. Eriksson, P. Larsson-Edefors, M. Sheeran, M. Själander, D. Johansson, M. Schölin, \"Multiplier Reduction Tree with Logarithmic Logic Depth and Regular Connectivity\", Proceedings of IEEE International Symposium on Circuits and Systems (ISCAS), pp. 4-8, 21-24 May 2006. Cache Optimizations A. Bardizbanyan, M. Själander, D. Whalley, and P. Larsson-Edefors, \"Designing a Practical Data Filter Cache to Improve Both Energy Efficiency and Performance\", ACM Transactions on Architecture and Code Optimization (TACO), vol. 10, no. 4, pp. 54:1--54:25, Dec. 2013. P. Gavin, D. Whalley, and M. Själander, \"Reducing Instruction Fetch Energy in Multi-Issue Processors\", ACM Transactions on Architecture and Code Optimization (TACO), vol. 10, no. 4, pp. 64:1--64:24, Dec. 2013. A. Bardizbanyan, M. Själander, D. Whalley, and P. Larsson-Edefors, \"Speculative Tag Access for Reduced Energy Dissipation in Set-Associative L1 Data Caches\", Proceedings of the IEEE International Conference on Computer Design (ICCD), pp. 302-308, 6-9 Oct. 2013. Competencies Computer Science Computer architecture Energy efficiency Research ",
  "content_length": 40354,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:45"
}