{
  "name": "Magnus Jahre",
  "homepage": "https://www.ntnu.edu/employees/magnus.jahre",
  "status": "success",
  "content": "Magnus Jahre - NTNU Magnus Jahre Download press photo Download press photo Download press photo Foto: Close Magnus Jahre Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering magnus.jahre@ntnu.no +4795222309 405 IT-bygget Gløshaugen, Trondheim Google Scholar About CV Magnus Jahre is a professor at the Norwegian University of Science and Technology (NTNU). He received his PhD degree from NTNU in 2010 and was an associate professor at NTNU from 2010 to 2021. He has a general interest in computer architecture, and his research currently focuses on performance analysis, ultra-low-power systems, spatial accelerators, Graphics Processing Units (GPUs), processing in memory, and heterogeneous systems. Jahre received a prestigious «Young Research Talents» grant from the Research Council of Norway in 2019, and he has served as member of the Program Committee or External Review Committee of the leading computer architecture conferences ISCA, MICRO and HPCA. He is a senior member of ACM and IEEE as well as member of the HiPEAC European Network of Excellence. Competencies Compilers Computer architecture Graphics processing units Multi-core architectures System Software Research The main goal of my research is to contribute to designing faster and more energy-efficient computers. More specifically, I investigate how computer hardware can specialize to the current application – to improve efficiency – while retaining sufficient generality to be efficient across diverse applications – to enable reuse. I am affiliated with the NTNU's Computer Architecture Lab (CAL) Computer Architecture Lab (CAL) Energy Efficient Computing Systems (EECS) Balancing Compute and Memory Performance in Reconfigurable Accelerators with Analytical Modeling (BAMPAM) In BAMPAM, we will improve the power-efficiency of tightly integrated reconfigurable accelerators by formulating analytical performance models that enable automatically generating accelerator instances with balanced compute and memory performance. Publications 2025 Kvalsvik, Amund Bergland; Själander, Magnus; Jahre, Magnus; Kumar, Rakesh; Kaxiras, Stefanos. (2025) Haunt Me No Longer! Finding Meaningful Solutions to Speculative Side-Channel Attacks. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Rogers, Joseph; Eeckhout, Lieven; Soliman, Taha; Jahre, Magnus. (2025) Neoscope: How Resilient Is My SoC to Workload Churn?. International Symposium on Computer Architecture Academic article Rogers, Joseph Charles Pandl; Eeckhout, Lieven; Jahre, Magnus. (2025) HILP: Accounting for Workload-Level Parallelism in System-on-Chip Design Space Exploration. IEEE Symposium on High-Performance Computer Architecture (HPCA) Academic article Liedtke, Lukas; Kjeldsberg, Per Gunnar; Kraemer, Frank Alexander; Jahre, Magnus. (2025) EStacker: Explaining Battery-Less IoT System Performance with Energy Stacks. ACM Transactions on Embedded Computing Systems Academic article SeyyedAghaei, Hossein; Naderan-Tahan, Mahmood; Jahre, Magnus; Eeckhout, Lieven. (2025) Memory-Centric MCM-GPU Architecture. IEEE computer architecture letters Academic article 2024 Gottschall, Björn; Eeckhout, Lieven; Jahre, Magnus. (2024) Per-Instruction Cycle Stacks Through Time-Proportional Event Analysis. IEEE Micro Academic article Ghasemisoumeeh, Fatemeh; Liedtke, Lukas; Jahre, Magnus. (2024) ECM: Improving IoT Throughput with Energy-Aware Connection Management. Design, Automation and Test in Europe (DATE) Academic article Cebrian, Juan Manuel; Jahre, Magnus; Ros, Alberto. (2024) Temporarily Unauthorized Stores: Write First, Ask for Permission Later. Academic chapter/article/Conference paper Gottschall, Björn; Jahre, Magnus. (2024) Time-Proportional Performance Analysis for Out-of-Order Processors. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Rogers, Joseph Charles Pandl; Soliman, Taha; Jahre, Magnus. (2024) AIO: An Abstraction for Performance Analysis Across Diverse Accelerator Architectures. International Symposium on Computer Architecture Academic article Bakker, Steffen Jaap Skotvoll; Ahmed, Mohamed Ben; Djupdal, Asbjørn; Natvig, Lasse; Andersson, Carl Henrik; Jahre, Magnus. (2024) FOMOsim: An open-source simulator for rigorous analysis of micromobility planning problems. Expert Systems With Applications Academic article 2023 Zhao, Xia; Jahre, Magnus; Tang, Yuhua; Zhang, Guangda; Eeckhout, Lieven. (2023) NUBA: Non-Uniform Bandwidth GPUs. Academic chapter/article/Conference paper Zhang, Shiqing; Naderan-Tahan, Mahmood; Jahre, Magnus; Eeckhout, Lieven. (2023) Characterizing Multi-Chip GPU Data Sharing. ACM Transactions on Architecture and Code Optimization (TACO) Academic article Badr, Charbel; Jahre, Magnus. (2023) Towards Time-Proportional Profiling of Low-Power System-on-Chips. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Zhang, Shiqing; Naderan-Tahan, Mahmood; Jahre, Magnus; Eeckhout, Lieven. (2023) Balancing Performance Against Cost and Sustainability in Multi-Chip-Module GPUs. IEEE computer architecture letters Academic article Ghasemisoumeeh, Fatemeh; Liedtke, Lukas; Jahre, Magnus. (2023) PES: An Energy and Throughput Model for Energy Harvesting IoT Systems. Academic chapter/article/Conference paper Aurud, Lars Murud; Jahre, Magnus. (2023) Improving Fetch and Issue Bandwidth in the Vortex GPU. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Nesset, Erling Feet; Jahre, Magnus; Gottschall, Björn. (2023) Improving the first-level cache bandwidth in the Berkeley Out-of-Order Machine. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Gottschall, Björn; Santana, Silvio Heverton Campelo de; Jahre, Magnus. (2023) Balancing Accuracy and Evaluation Overhead in Simulation Point Selection. Academic chapter/article/Conference paper Ghasemisoumeeh, Fatemeh; Liedtke, Lukas; Jahre, Magnus. (2023) ESS: Repeatable Evaluation of Energy Harvesting Subsystems for Industry-Grade IoT Platforms. Academic chapter/article/Conference paper Zhang, Shiqing; Naderan-Tahan, Mahmood; Jahre, Magnus; Eeckhout, Lieven. (2023) SAC: Sharing-Aware Caching in Multi-Chip GPUs. Academic chapter/article/Conference paper Gottschall, Björn; Eeckhout, Lieven; Jahre, Magnus. (2023) TEA: Time-Proportional Event Analysis. Academic chapter/article/Conference paper Koraei, Mostafa; Cebrian, Juan Manuel; Jahre, Magnus. (2023) Near-optimal multi-accelerator architectures for predictive maintenance at the edge. Future Generation Computer Systems Academic article 2022 Zhao, Xia; Eeckhout, Lieven; Jahre, Magnus. (2022) Delegated Replies: Alleviating Network Clogging in Heterogeneous Architectures. IEEE Symposium on High-Performance Computer Architecture (HPCA) Academic article Salvesen, Peter; Jahre, Magnus. (2022) LMT: Accurate and Resource-Scalable Slowdown Prediction. IEEE computer architecture letters Academic article Rekdal, Markus; Jahre, Magnus. (2022) Investigating the Performance Scalability of the Vortex GPU. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Kjeldsberg, Per Gunnar; Jahre, Magnus; Gausaker, Philip. (2022) A Coarse-Grain Reconfigurable Accelerator for Rocket. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis 2021 Gottschall, Björn; Eeckhout, Lieven; Jahre, Magnus. (2021) TIP: Time-Proportional Instruction Profiling. Academic chapter/article/Conference paper Maceiras, Mateo Vázquez; Jahre, Magnus. (2021) Accelerating LBM on a Tightly-Coupled Field Programmable Gate Array. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Ghasemisoumeeh, Fatemeh; Jahre, Magnus. (2021) Modeling Periodic Energy-Harvesting Computing Systems. IEEE computer architecture letters Academic article Yassin, Yahya Hussain; Jahre, Magnus; Kjeldsberg, Per Gunnar; Aunet, Snorre; Catthoor, Francky. (2021) Fast and Accurate Edge Computing Energy Modeling and DVFS Implementation in GEM5 Using System Call Emulation Mode. Journal of Signal Processing Systems Academic article Jahre, Magnus; Göhringer, Diana; Millet, Philippe. (2021) Towards Ubiquitous Low-power Image Processing Platforms. Springer Nature Springer Nature Academic anthology/Conference proceedings Djupdal, Asbjørn; Gottschall, Björn; Ghasemisoumeeh, Fatemeh; Jahre, Magnus. (2021) Lynsyn and LynsynLite: The STHEM Power Measurement Units. Academic chapter/article/Conference paper 2020 Salvesen, Peter; Jahre, Magnus. (2020) Predicting Interference-Free Performance with Linear Model Trees. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Smithsen, Eirik; Jahre, Magnus; Rogers, Joseph Charles Pandl; Gottschall, Björn. (2020) Fast Call Graph Profiling. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Eggen, Lasse Agentoft; Jahre, Magnus. (2020) Towards Efficiently Utilizing Coarse-Grained Reconfigurable Accelerators. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Wang, Lu; Jahre, Magnus; Adileh, Almutaz; Eeckhout, Lieven. (2020) MDM: The GPU Memory Divergence Model. Academic chapter/article/Conference paper Zhao, Xia; Jahre, Magnus; Eeckhout, Lieven. (2020) Selective Replication in Memory-Side GPU Caches. Academic chapter/article/Conference paper Zhao, Xia; Jahre, Magnus; Eeckhout, Lieven. (2020) HSM: A Hybrid Slowdown Model for Multitasking GPUs. Academic chapter/article/Conference paper 2019 Cebrian, Juan Manuel; Natvig, Lasse; Jahre, Magnus. (2019) Scalability analysis of AVX-512 extensions. The Journal of Supercomputing Ac",
  "content_length": 31015,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:42"
}