{
  "name": "Magnus Wahlström",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/magnus-wahlstroem(a0940b3f-c15b-404f-b9f6-d26cb5664829).html",
  "status": "success",
  "content": "Magnus Wahlström - Royal Holloway Research Portal View Scopus Profile Magnus Wahlström Professor Professor, Department of Computer Science Phone+44 1784 443429EmailMagnus.Wahlstromrhul.acuk TW20 0EX Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 53 Conference contribution 49 Article 4 Chapter 1 Chapter (peer-reviewed) Research output per year Research output per year Almost Consistent Systems of Linear EquationsDabrowski, K., Jonsson, P., Ordyniak, S., Osipov, G. & Wahlström, M., 9 May 2025, (E-pub ahead of print) In: ACM Transactions on Algorithms (TALG).Research output: Contribution to journal › Article › peer-review Open AccessFile 10 Downloads (Pure) Determinantal SievingEiben, E., Koana, T. & Wahlström, M., 2 Oct 2025, In: TheoretiCS. 4Research output: Contribution to journal › Article › peer-review Open Access Faster algorithms on linear delta-matroidsKoana, T. & Wahlström, M., 24 Feb 2025, Proceedings of STACS 2025.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 15 Downloads (Pure) Flow-augmentation I: Directed graphsKim, E. J., Kratsch, S., Pilipczuk, M. & Wahlström, M., 24 Jan 2025, In: Journal of the ACM. 72, 1, 38 p., 5.Research output: Contribution to journal › Article › peer-review Open Access Flow-augmentation III: Complexity dichotomy for Boolean CSPs parameterized by the number of unsatisfied constraintsKim, E. J., Kratsch, S., Pilipczuk, M. & Wahlström, M., 13 Aug 2025, (E-pub ahead of print) In: SIAM Journal on Computing. 54, 4, p. 1065-1137 73 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 13 Downloads (Pure) View all 107 research outputs Projects 1 Finished Projects per year Polytope methods in parameterized complexityWahlström, M. (PI)Eng & Phys Sci Res Council EPSRC1/12/16 → 31/12/17Project: Research",
  "content_length": 2176,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:45"
}