{
  "name": "Magy Seif El-Nasr",
  "homepage": "https://magyel-nasr.net",
  "status": "success",
  "content": "Magy Seif El-Nasr Skip to content University of California at Santa Cruz | Google Scholar | Research Gate | Academia.edu | LinkedIn | Google+ | PositionUC Presidential Chair at UCSCProfessor of Computational Media departmentDepartment Chair of Computational MediaSilicon Valley CampusJack Baskin School of EngineeringUniversity of California at Santa Cruz Research visionProblems we currently face in the areas of health, education, resilience, climate change, and cybersecurity require an interdisciplinary approach and most often require us to understand human behavior, learning, cognition, social networks, and social cognition at a deep level which we currently do not possess. My research focuses on building a framework to facilitate the use of virtual environments (e.g., games, VR, apps, social media or interactive narrative) as a methodology to understand human behavior, cognition, and social cognition with the goal of facilitating computational solutions to national problems in health, education, climate change, and security. To address this vision, I manage a lab that houses PhD students, masters’ and undergraduate students as well as post docs and research scientists. The lab engages in (a) developing tools and automated techniques to help authoring virtual environments (e.g., interactive narratives, believable characters, games, etc.), (b) developing and designing virtual environments, and (c) developing evidence-based methodologies to measure the effectiveness of these environments at solving national problems. I received several grants totaling over $6 Million to support my research. I published over 100+ international peer reviewed articles on her work. In addition, my work received several awards and recognition within multiple communities, including: Artificial Intelligence, Agents, Interactive Narrative, and Game communities. These include four best paper awards, a leadership excellence award, and research excellence award. I also have ongoing industry collaborations, including Electronic Arts, IgnitePlay, a social media and health independent company, and Benshi.ai, a new startup investigating the use of AI to create equitable health applications. I am currently the associate editor of IEEE Transactions on Affective Computing, IEEE Transactions on Games, and HCI. Interested StudentsStudents interested in joining my lab, please contact me through my email: mseifeln at ucsc dot edu. I am currently accepting applications. Speaking and Consulting I have several years of experience engaged in consulting activities as well as speaking in different companies. I provide consulting and speaking services nationally and internationally.",
  "content_length": 2683,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:48"
}