{
  "name": "Mahanth K. Gowda",
  "homepage": "http://www.cse.psu.edu/~mkg31",
  "status": "success",
  "content": "Mahanth Gowda: Penn State Mahanth Gowda Home Papers Teaching News CV Join Us Contact W314, Westgate Building 814-863-0608 mahanth.gowda@psu.edu Google Scholar Profile I am an Associate Professor in the school of EECS at Pennsylvania State University. I am looking for strongly-motivated PhD students. My areas of interest include Wireless Networking, Mobile and Wearable Computing, Machine Learning with applications to Cyber Physical Systems, IoT and human behavioral sensing. PhD Students Suryoday Basak Hao Zhou Taiting Lu Runze Liu Shawn Li Alumni Yilin Liu, Ph.D. 2023 --> Google Shijia Zhang, Ph.D. 2024 --> Google Grants PI: NSF-2046972: CAREER: Sign-to-Speech: An Edge-IoT Platform and Software Library for Real Time Sign Language Recognition PI: NSF-2333583: I-Corps: A smart ring for finger motion analytics and healthcare applications PI: NSF-1909479: CNS Core: Small: Collaborative Research: A Motion Tracking Library for Sports Analytics using Wireless Sensors PI: NSF-2008384: CNS Core: Small: Collaborative Research: IoTScope: Sensing Physical Materials via Inexpensive IoT Radios Co-PI: NSF-1956276: CNS Core: Medium: When Next Generation Wireless Networks Meet Machine Learning Co-PI: NSF-2211018: SHF: Medium: Exploring an Edge Platform Design Trajectory for Next Generation XR Applications Selected Papers SmartDampener: An Open Source Platform for Sport Analytics in Tennis Runze Liu, Taiting Lu, Shengming Yuan, Hao Zhou, Mahanth Gowda. ACM IMWUT/UbiComp, 2024 Rethinking Orientation Estimation with Smartphone-equipped Ultra-wideband Chips Hao Zhou, Kuang Yuan, Mahanth Gowda, Lili Qiu, Jie Xiong. ACM MobiCom, 2024. Temporal-Distributed Backdoor Attack Against Video Based Action Recognition Xi Li, Songhe Wang, Ruiquan Huang, Mahanth Gowda, George Kesidis. AAAI, 2024. SignQuery: A Natural User Interface and Search Engine for Sign Languages with Wearable Sensors Hao Zhou, Taiting Lu, Kristina McKinnie, Joseph Palagano, Kenneth DeHaan, Mahanth Gowda. ACM MobiCom, 2023. I am an Earphone and I can Hear my Users Face: Facial Landmark Tracking using Smart Earphones Shijia Zhang, Taiting Lu, Hao Zhou, Yilin Liu, Runze Liu, Mahanth Gowda. ACM Transactions on Internet of Things (TIOT), 2023. One Ring to Rule Them All: An Open Source Smartring Platform for Finger Motion Analytics and Healthcare Applications Hao Zhou, Taiting Lu, Yilin Liu, Shijia Zhang, Runze Liu, Mahanth Gowda. ACM/IEEE IoTDI, 2023. Best Paper Award for Edge IoT AI I Spy You: Eavesdropping Continuous Speech on Smartphones via Motion Sensors Shijia Zhang, Yilin Liu, Mahanth Gowda. ACM IMWUT/UbiComp, 2023 Leveraging the Properties of mmWave Signals for 3D Finger Motion Tracking for Interactive IoT Applications Yilin Liu, Shijia Zhang, Mahanth Gowda, Srihari Nelakuditi. ACM Sigmetrics, 2023 Let’s Grab a Drink: Teacher-Student Learning for Fluid Intake Monitoring using Smart Earphones Shijia Zhang, Yilin Liu, Mahanth Gowda. ACM/IEEE IoTDI, 2022. mmSpy: Spying Phone Calls using mmWave Radars Suryoday Basak, Mahanth Gowda. IEEE Symposium on Security and Privacy (Oakland) , 2022. LiquID: A Wireless Liquid IDentifier Ashutosh Dhekne, Mahanth Gowda, Yixuan Zhao, Haitham Hassanieh, Romit Roy Choudhury. ACM MOBISYS, 2018. Bringing IoT to Sports Analytics. [Slides] Mahanth Gowda, Ashutosh Dhekne, Sheng Shen, Romit Roy Choudhury, Xue Yang et al., NSDI, 2017. Tracking Drone Orientation with Multiple GPS Receivers [Slides] Mahanth Gowda, Justin Manweiler, Ashutosh Dhekne, Romit Roy Choudhury, Justin Weisz. ACM MOBICOM, 2016. The Case for Robotic Wireless Networks. Mahanth Gowda, Ashutosh Dhekne, Romit Roy Choudhury. WWW, 2016. Full List here",
  "content_length": 3645,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:47"
}