{
  "name": "Mahadevan Subramaniam",
  "homepage": "https://www.unomaha.edu/college-of-information-science-and-technology/about/faculty-staff/mahadevan-subramaniam.php",
  "status": "success",
  "content": "Mahadevan Subramaniam | College of Information Science & Technology | University of Nebraska Omaha Mahadevan Subramaniam Mahadevan Subramaniam, Ph.D. Department Chair Professor Charles W. and Margre H. Durham Distinguished Professor Computer Science email: msubramaniam@unomaha.edu office: PKI 282I office phone: 402.554.4984 lab room: PKI 379 fax: 402.554.3400 personal website: https://sites.google.com/view/mahadevansubramaniam/home note: This profile is pulling in data from Digital Measures. Postings on personal websites or social media do not indicate that the individual is speaking on behalf of UNO. General Information General Information Biography Mahadevan Subramaniam (Subu) is the Chairperson of the Computer Science Department in the College of Information Science and Technology in the University of Nebraska at Omaha, UNO. He is a Professor of Computer Science and the Director ofthe AI Core for Collaborative Outreach, Research and Education (AI-CCORE) as well asthe Intelligent Modeling, Simulation, and Testing (IMST) Laboratory.Prior to joining UNO, Subu obtained his PhD in Artificial Intelligence from SUNY Albany, NY, in the correct and efficient design of hardware systems. Subu worked in the high-tech industrial corridor in Silicon Valley, Bay Area, as a research scientist, computer architect, and an entrepreneur. He was a member of the team designing one of the first production quality compiler-compilers for programming language, CHILLTM. He was a founding member of the Automated Software Engineering Group at NASA Ames Research Center, architected a distributed shared memory system, and was a principal architect for one of the first InfinibandTM Target Channel adapter in a start-up company. As the chairperson, his overarching objective is to make the computer science department at UNO a welcoming space for all, fostering a positive, student-centric learning environment while promoting high quality teaching, research, and scholarship. The department consists of world class faculty in core and applied areas of computer science including artificial intelligence, computing systems, human centered computing, and computer science education. The department offers ABET/CAC accredited undergraduate program in computer science with concentration areas in artificial intelligence, internet technologies, and computer games. It also offers a Master's program in computer science with concentrations and graduate certificates in several emerging areas including an online certificate in machine learning. Department faculty also actively supervise doctoral students in the college wide doctoral program. Teaching Interests Advanced Computer Architecture, Mathematical Foundations of Computer Science, Introduction to Proofs, Formal Methods in Software Engineering, Advanced Topics in Artificial Intelligence. Research Interests Mahadevan Subramaniam's research interests are in the areas of Augmented Learning, AI in Science, Smart Digital Twins, and application of qualitative, quantitative inference for 2D Living Materials, and Clinical medical informatics. His research works on AI in Science has focused on developing new self-supervised, and super-resolution based approaches for for label-efficient, predictive analyses of growth of biofilms involving sulphur reducing bacteria on material surfaces, 2D material coating boundary detection using multi-modal microscopy and spectroscopy data, analysing lipid nanomolecule morphologies for pharmacological applications. His work on augmented learning has focused on creating adaptive serious games for quantum cryptography, development of intelligent notebooks for quantum internet and network security, as well as digital twins of networks of LLMs enabling ubiquitous 24/7 quantum education classrooms. Over the past decade, he has been collaborating with physicians and clinical researchers from the University of Nebraska Medical Center, the Beyer Eye Institute, Stanford, Ocular Imaging Research and Reading Center, and from Turkey, and Argentina to design devices, software applications, and Deep Learning methods for the diagnosis and management of retinal diseases. With colleagues, he has developed a device and a software application to measure and automatically correct the visual impairments perceived by Age-related Macular Degeneration (AMD) subjects. He is currently collaborating with Stanford, University of Cincinnati, and Utah Medical Schools developing deep and generative learning based clinical studies for uveitis. Service Summary Subu is serving as the Chair of Computer Science department. He has Chaired committees leading to successful hire of several CS faculty members, the Undergraduate, and Graduate Programs in Computer Science.",
  "content_length": 4748,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:45"
}