{
  "name": "Mahdi Khodayar",
  "homepage": "https://utulsa.edu/people/mahdi-khodayar",
  "status": "success",
  "content": "Mahdi Khodayar, Ph.D. - The University of Tulsa Skip to main content × Close Menu Academics Back to Academics Academics Overview Explore Programs Explore Programs All Programs Undergraduate Graduate Professional Studies Online Programs Colleges & Schools Colleges & Schools Arts & Sciences Business Engineering & Computer Science Health & Natural Sciences Law Graduate School Honors College Online Programs Beyond the Classroom Beyond the Classroom Jumpstart UTulsa Global Engagement Special Programs Student Research Opportunities Academic Support Academic Support Academic Advising & Enrollment Pathfinders Program Tutoring Services Academic Resources Academic Resources Academic Calendar Bulletins Undergraduate Bulletin Graduate Bulletin Law Bulletin Study Resources & Centers Academic Journals & Publications McFarlin Library Faculty Directory Request Info Apply Research Back to Research Research Overview Research Opportunities Research Opportunities Popular Research Programs Research Projects Research Colloquium Tulsa Undergraduate Research Challenge (TURC) Support & Services Support & Services Office of Research Office of Technology Commercialization Research Compliance & Training Research News Contact Research Office About Back to About Why The University of Tulsa Who We Are Who We Are About TU Strategic Plan Points of Pride UTulsa Fast Facts History & Traditions Leadership & Faculty Leadership & Faculty Office of the President Provost Executive Staff Faculty Directory Board of Trustees Working at TU Offices Directory Contact Us TU News Student Life Back to Student Life Student Life Overview Campus Living Campus Living Living on Campus Housing Residence Hall Life Apartment Life Parking Dining Facilities Facilities Student Union Bookstore Fitness Center More Facilities Clubs & Organizations Clubs & Organizations Student Organization Directory Student Government Association Student Activities Sorority & Fraternity Life Esports & Gaming Lounge Office for Resilience and Belonging Wellness & Support Wellness & Support Counseling Services Hurricane Health Center Fitness & Recreation Nutrition CaneCares Student Coaching Groups Student Accessibility D-CARES Campus Security Sexual Violence Prevention & Education Title IX Student Success Student Success Office of Student Engagement CaneCareers Tutoring Services Resources & Guides Resources & Guides Student Resource Guides Student Policies & Procedures Tuition & Aid Back to Tuition & Aid Funding Your Education Tuition & Costs Tuition & Costs Tuition & Costs Net Price Calculator Financial Aid Financial Aid Financial Aid Process Financial Aid FAQs Summer Session Aid Study Abroad Aid Other Funding Options Other Funding Options Scholarships Assistantships & Fellowships Student Employment Grants Loans Counseling & Support Admissions Back to Admissions TU Admissions Apply Apply Undergraduate Admission Graduate Admission Law Admission International Admission Online Programs Visit Visit Visit Campus Virtual Tour Video Tours Campus Maps Explore the City of Tulsa Counselors & Support Counselors & Support Undergraduate Admission Counselors Graduate Program Advisers Information for Prospective Parents Request Information Why TU Alumni Back to Alumni Alumni Home Alumni Giving Athletics Back to Athletics Athletics Home Tickets News Events Back to Events Events Calendar Submit an Event Make a Gift Back to Make a Gift Giving Opportunities Ways to Give Minds. Momentum. Mission. Campaign ×Close Menu Submit Filter Results Search within... Collins College of Business College of Engineering & Natural Sciences College of Law Graduate School Kendall College of Arts & Sciences Oxley College of Health Sciences × Close Menu Prospective Students Prospective Students Current Students Parents & Families Alumni & Friends Faculty & Staff Community & Fans More Admission Info Why UTulsa Research Opportunities Virtual Tour Explore the City of Tulsa Explore Programs Visit Apply Business, cyber security undergrads named 2025 Gilman Scholars The University of Tulsa is proud to announce two recent recipients of Benjamin A. Gilman International Scholarships: Eden Knepper and Ayden Whittaker. Each year, the U.S. Department of State awards the nationally competitive Gilman awards... More Student Info Course Bulletin IT Help Research Opportunities Student Orgs Student Hub Housing Portal Academic Calendar Cultivating cultural conversations: Meet UTulsa’s Professor Lansana Quraysh Ali Lansana, applied associate professor of English & creative writing, is a distinguished scholar of African American studies, journalist and author of 23 books including poetry, nonfiction and children’s literature. His journey as a writer led him from Enid, Oklahoma, to studying and teaching in cities like Chicago and New York. However, after 30 […] More Family Info About UTulsa UTulsa Leadership & Faculty Explore the City of Tulsa UTulsa Merchandise & Gifts Resources for Parents & Families Parent & Family Portal Get Involved New alumnus offered elite IBM cybersecurity position months before graduation Serving nontraditional students, such as military veterans, is nothing new at The University of Tulsa, and Don Cowan’s success is a prime example of how students from all backgrounds thrive on campus. Humble and soft-spoken, Cowan (B.S. ’25) graduated from Owasso High School and served eight years as a U.S. Marine before returning to Tulsa […] More Alumni Info Alumni Benefits Request Transcripts TU Merchandise & Gifts TU Alumni Association TU Alumni Events Kendall College welcomes television and film writer Taylor Chukwu to Board of Visitors The University of Tulsa Kendall College of Arts & Sciences has welcomed alumna Taylor Chukwu as the newest member of its Board of Visitors. More Employee Info Employee Benefits IT Help Applications Directory Hurricane Hub Employment Opportunities Seagraves leads national charge in AI-powered real estate innovation UTulsa assistant professor Cayman Seagraves is leading the charge toward integrating AI into the real estate and finance sectors. More Community Info TU Athletics 101 Archer Gilcrease Museum Tulsa Mayfest Calendar of Events Campus Maps Life Long Learning Mellon Foundation grants $677,000 for new UTulsa, Muscogee (Creek) Nation project UTulsa has received a $677,000 grant from the Public Knowledge program of the Mellon Foundation to support a joint effort between the university and the Muscogee (Creek) Nation’s Historic and Cultural Preservation Department. Computer Science Mahdi Khodayar, Ph.D. Assistant Professor of Computer Science Research Associate of Department of Petroleum Engineering Engineering & Computer Science: Computer Science mahdi-khodayar@utulsa.edu 2100 Rayzor Hall Google Scholar LinkedIn IEEE About Mahdi Khodayar, Ph.D., received his B.Sc. degree in computer engineering and the M.Sc. degree in artificial intelligence from K.N. Toosi University of Technology, Tehran, Iran, in 2013 and 2015, respectively, and a Ph.D. degree in electrical engineering from Southern Methodist University in 2020. He is currently an assistant professor in the department of computer science at The University of Tulsa. His main research interests include AI and machine learning. He is focused on deep learning, spatiotemporal pattern recognition, reinforcement learning, and computer vision. Khodayar serves as an associate editor for IEEE Transactions on Transportation Electrification, IEEE Transactions on Industrial Informatics, and Elsevier’s Sustainable Computing: Informatics and Systems. He has also served as a reviewer for many reputable journals and conferences, including IEEE Transactions on Neural Networks and Learning Systems, IEEE Transactions on Fuzzy Systems, IEEE Transactions on Sustainable Energy, and IEEE PES General Meeting. Khodayar’s projects are funded by the National Science Foundation (NSF), U.S. Department of Transportation (DOT), as well as the TU Cyber Fellows program. Awards and Honors National Science Foundation (NSF) – Electrical, Communications and Cyber Systems (ECCS) Division – Spring 2022 US Department of Transportation – Federal Highway Administration (FHWA) – Fall 2023 Zelimir Schmidt Award for Early Career Research (Spring 2023), The University of Tulsa, for conducting exemplary research resulting in significant scientific advances and widespread recognition. Honors Student Award of Exceptional Talents (December 2015), Khajeh Nasir Toosi University of Technology, ranked 1st among all graduate students of artificial intelligence major. Education Ph.D., Electrical Engineering, Southern Methodist University, 2020 M.S., Artificial Intelligence, Khajeh Nasir Toosi University of Technology, 2015 B.S., Software Engineering, Khajeh Nasir Toosi University of Technology, 2013 Research interests and areas of expertise Artificial intelligence Machine learning Deep neural networks Statistical pattern recognition Probabilistic graphical models Power systems Transportation systems Renewable energy Computer vision Image processing News All News Stories Professor’s NSF grant for AI, solar power integration to create more ‘prosumers’ STEM students, faculty receive college accolades Cookie settingsREJECTACCEPTWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. .Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsin",
  "content_length": 10636,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:50"
}