{
  "name": "Mahdi S. Hosseini",
  "homepage": "https://www.concordia.ca/faculty/mahdi-hosseini.html",
  "status": "success",
  "content": "Mahdi S. Hosseini - Concordia University Mahdi S. Hosseini, Department of Computer Science and Software Engineering (CSSE) at Concordia University Assistant Professor, Computer Science and Software Engineering Status: Assistant Professor Are you the profile owner? Sign in to edit Research areas: Deep Learning, Computer Vision, Computational Pathology Contact information Email: mahdi.hosseini@concordia.ca BiographyBioI am an assistant professor of computer science in department of Computer Science and Software Engineering (CSSE) at Concordia University and a faculty member of Applied AI Institute at Concordia. I received my PhD from The Edward S. Rogers Sr. Department of Electrical and Computer Engineering (ECE) at the University of Toronto (UofT) in 2016 from Multimedia Lab under the supervision of Professor Konstantinos N. Plataniotis. I continued as a postdoctoral research fellow at UofT in collaboration with Huron Digital Pathology Inc at Waterloo Ontario. During my postdoctoral study at UofT, I received two fellowship awards of MITACS-Elevate and NSERC research funding. My research is primarily advanced in foundational developments of deep learning and computer vision algorithms with focused applications in computational pathology and healthcare technologies. I am currently supervising several graduate students on related topics and my vision is to develop, in collaboration with hospitals and pathologists, meaningful computer aided diagnosis systems as assistive tools in clinical pathology for cancer diagnosis.I have published more than 30 papers and two patent applications in related fields. My reviewing services cover well-known venues in CVF foundation, ML Conferences and IEEE SPS. Currently I am serving as Area Chair (AC) for NeurIPS2023 and CVPR2023. I was a previous AC for CVPR2022. Teaching activitiesGraduateCOMP6721: Applied Artificial Intelligence (Fall2022, Winter2023, Winter2024) COMP6321: Machine Learning (Fall2023) COMP691: Deep Learning for Computational Pathology (Winter2024)UndergraduateCOMP432: Machine Learning (Fall2023) COMP499: Deep Learning for Computational Pathology (Winter2024) PublicationsGoogle ScholarPublished Papers Professional ServicesArea Chair (AC) AC for ECCV2024 AC for CVPR2024 AC for NeurIPS2023 AC for CVPR2023 AC for CVPR2022Grant ReviewCollege Reviewer - CIHR College Membership (2024-2027) ECR-Reviewer - CHIR Project Grant Peer Review Committee (2023) Grant Reviewer - NSERC Discovery (2022-2023) Conference Review Program Committee of Workshop on Visual Recognition for Medical Images (ICCV2019) Reviewer for CVPR2020, CVPR2021, CVPR2022 Reviewer for ICCV2019, ICCV2020 Reviewer for NeurIPS2020, NeurIPS2021, NeurIPS2022 Reviewer for ICML2020, ICML2023 Are you the profile owner? Sign in to edit Took 104 milliseconds Back to top © Concordia University",
  "content_length": 2836,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:51"
}