{
  "name": "Mahdi Soltanolkotabi",
  "homepage": "https://viterbi-web.usc.edu/~soltanol",
  "status": "success",
  "content": "Mahdi Soltanolkotabi's website Mahdi Soltanolkotabi Director USC Center on AI Foundations for Science (AIF4S) David and Lucile Packard Fellow Professor, Departments of Electrical and Computer Engineering, Computer Science, and Industrial and Systems Engineering University of Southern California Home Research Talks/Slides Teaching Code CV/Bio Office: EEB 430 Email: soltanol@usc.edu Tel: 213-740-4456 I am a professor in the Ming Hsieh Department of Electrical and Computer Engineering, Computer Science, and Industrial and Systems Engeineering (ISE) at the University of Southern California. I am also the inaugural director of the USC Center on AI Foundations for Science (AIF4S). Prior to joining USC I spent a year as a postdoc in the AMPLAB at UC Berkeley mentored by Ben Recht and Martin Wainwright. I obtained my Ph.D. in Electrical Engineering from Stanford in 2014 advised by Emmanuel Candes. On the theoretical side, my research focuses on developing the mathematical foundations of modern data science spanning recent developments in generative AI to more classical deep learning, machine learning, signal processing, and computational imaging. To this aim I often draw upon and develop eclectic new tools in (non)convex optimization, high-dimensional probability, statistical estimation/inference, empirical processes, and learning theory. On the applied side, my focus is on developing reliable AI for applications in science, healthcare and medicine. In colloaboration with domain scientists and physcians we aim to develop new architectures and data curation pipelines that accelarate scientific discovery, enhance mathematical and spatial reasoning capabilities of GenAI, improve their reliability, and develop rigorous evaluation and statistical uncertainty quantification techniques that truely tests their capabilities and limitations. On the weekends, you're most likely to find me cycling on the Pacific coast ranging from Malibu/Santa Monica mountains/Palos Verdes in SoCal to the Marine district in NorthCal. I'm also an amatuer artist, dabbling in Persian calligraphy. I'm very interested in coming up with creative ways to preserve this and other ancient artforms with responsible use of generative AI. All publications unless specified are based on alphabetic ordering of the names. Publications Journals Phase retrieval via Wirtinger Flow: Theory and Algorithms. (website) E. J. Candes, X. Li, and M. Soltanolkotabi. Phase retrieval from coded diffraction patterns. (website) E. J. Candes, X. Li, and M. Soltanolkotabi. Robust Subspace Clustering. (website) M. Soltanolkotabi, E. Elhamifar, and E. J. Candes. To appear in Annals of Statistics. A Geometric Analysis of Subspace Clustering with Outliers. (code) M. Soltanolkotabi and E. J. Candes. Annals of Statistics 40(4), 2195--2238, 2012. Discussion of \"Latent Variable Graphical Model Selection via Convex Optimization\". E. J. Candes and M. Soltanolkotabi. Annals of Statistics 40(2), 1997--2004, 2012. A Unified Approach to Sparse Signal Processing.(during undergrad) F. Marvasti, A. Amini, F. Haddadi, M. Soltanolkotabi, B. Khalaj, A. Aldroubi, S. Sanei and J. Chambers. EURASIP Journal on Advances in Signal Processing. Preprints From robust subspace clustering to full-rank matrix completion.(Extended abstract-complete version will be available soon as part of a review article) E. J. Candes, L. Mackey, and M. Soltanolkotabi. Conferences (during undergrad) Errorless Codes for Over-loaded Wireless CDMA with Active User Detection. P. Pad, M. Soltanolkotabi, S. Hadikhanlou, A. Enayati and F. Marvasti. Proc. of the International Conference on Communications, ICC 2009, Dresden, Germany. OFDM Channel Estimation based on Adaptive Thresholding for Sparse Signal Detection. M. Soltanolkotabi, A. Amini and F. Marvasti. Proc. of European Signal Processing Conference, EUSIPCO 2009. Throughput Capacity of a Multi-channel Multi- hop Mobile Ad-hoc Network. M. Soltanolkotabi and F. Ashtiani. Proc. of International Conference on Telecommunications, ICT 2009. A Practical Sparse Channel Estimation for Current OFDM Standards. M. Soltanolkotabi, M. Soltanalian, A. Amini and F. Marvasti. Proc. of International Conference on Telecommunications, ICT 2009. Salt and Pepper Noise Removal for Images. S. Feizi-Khankandi, S. Zahed Pour, M. Soltanolkotabi, A. Amini and F. Marvasti. Proc. of International Conference on Telecommunications, ICT 2008. Talks Robust Subspace Clustering. - Stanford Biostatistics Seminar, February 2014. - ICML Spectral Learning Workshop, June 2013. - Asilomar Conference on Signals, Systems, and Computers. - MURI annual meeting, Princeton, October 2012. - Information Theory and Applications workshop, Feb. 2013. A Geometric Analysis of Subspace Clustering with Outliers. - Berkeley Robotics Lab, Febuary 2012. - High-Dimensional Phenomena in Statistics and Machine Learning Seminar, Georgia Tech., July 2012. - Workshop on Modern Massive Data Sets (MMDS), Stanford, July 2012. Instructor: EE 364a: Convex Optimization, Summer 2011. TA: Stanford CS: - CS 229: Machine Learning, Fall 2012. Stanford EE: - EE 278: Statistical Signal Processing, Summer 2010. Stanford Math: - Math 104: Linear Algebra, Winter 2012. Stanford Statistics: I am currently collaborating with Nava College Prepatory Academy a school in Compton to help improve K-12 math/STEM education. I will be posting more details about these activities including curriculum development, lecture notes, excersize/puzzles, data modules etc. on this website (please check back for updates). I have also partnered with VAST: Viterbi Adopt-a-School Adopt-a-Teacher (VAST) and STEM educational outreach programs at USC Viterbi School of Engineering to engage in various educational outreach activities in local middle/high schools close to USC e.g. see VAST's reporting on one such activity here and stay tunned for more updates. Phase Retrieval from Coded Diffraction Patterns. Robust Subspace Clustering. support code for Geometric Analysis of Subspace Clustering with Outliers.",
  "content_length": 6040,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:51"
}