{
  "name": "Mahdi Jafari Siavoshani",
  "homepage": "http://mahdi.jafari.siavoshani.ir",
  "status": "success",
  "content": "Mahdi Jafari Siavoshani Home Assistant Professor Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran. Email: My academic email address is mjafari [at] sharif [dot] edu and my personal email address is mahdijafaris [at] gmail [dot] com. I am currently an assistant professor at the Computer Science and Engineering Department of Sharif University of Technology and I am leading the Information, Network, and Learning (INL) lab. Prior to that, I was a postdoctoral fellow at the Institute of Network Coding in The Chinese University of Hong Kong. I received my PhD and MSc degrees both in Computer Sciences and Communication Systems from the Swiss Federal Institute of Technology (EPFL), where I was working under the supervision of Prof. Christina Fragouli, as a member of the Algorithmic Research on Network Information laboratory (ARNI). I also earned my BSc degree in Electrical Engineering and Physics both from Sharif University of Technology, Tehran, Iran. Research Interests I am in general interested in various fundamental problems related to processing, manipulation, transmission, and analyzing information. My research interests mainly focus on understanding the fundamental limits of such problems as well as design of new techniques and algorithms that are suitable for practical implementation. More specifically my research interests include: Machine Learning Optimization Data Science Information and Communication Theory Computer Networks Main Home Education Research Publications Talks Teaching List of Courses Computer Networks Engineering Probability and Statistics Network Coding Stochastic Processes Reading Suggestions Miscellaneous Personal Stuff Blog (mainly written in Persian) Photo Gallery Random Links My Public Key",
  "content_length": 1786,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:54"
}