{
  "name": "Mahesh Mohan M. R.",
  "homepage": "https://maheshmohanmr.github.io",
  "status": "success",
  "content": "Mahesh Mohan M R Assistant Professor, Department of Artificial Intelligence, IIT Kharagpur Follow Kharagpur, India Email Github Google Scholar ORCIDAbout meWelcome all! I am an Assistant Professor at the Department of Artificial Intelligence, IIT Kharagpur. I am also an Affiliate Researcher at the University of Illinois Urbana-Champaign, US. In the IIT Kharagpur, I lead a “Signal Processing and Artificial Intelligence (SPAI)” group. Our SPAI group performs research in the intersection of Signal Processing with AI and Computer Vision.Previously, I was a Postdoctoral Researcher in the Coordinated Science Laboratory, University of Illinois Urbana-Champaign US, where I was advised by Prof. Narendra Ahuja. My postdoc research lies at the intersection of Signal Processing, Computer Vision and AI.Prior to that, I completed my Ph.D. in the Department of Electrical Engineering, IIT Madras, where I was advised by Prof. A. N. Rajagopalan in Image Processing and Computer Vision Lab. My Ph.D. research lies at the intersection of Image Signal Processing, Computer Vision and AI (for details, please find my dissertation). Prior to my Ph.D., I have completed Master’s (M-Tech) in Communication Engineering and Signal Processing, advised by Prof. Sheeba V. S., and Bachelor’s in Electronics and Communication Engineering, both with honours.I grew up in Kerala, India, a place adorned with lush hues of Nature. I am a nature- and art-lover, and have an interest in Philosophy of Science (some excerpts here).News:[ 2025.04 ]   Prof. Mahesh will be serving as Datathon Chair for IndoML 2025.[ 2025.03 ]   Prof. Mahesh will be serving as Technical Program Committee (TPC) Vice-Chair for IEEE INDISCON-2025.[ 2025.01 ]   Congrats Arjun for securing the IndiaAI Research fellowship for his ongoing research![ 2025.01 ]   Congrats Rahul for securing the IndiaAI Research fellowship for his ongoing research![ 2025.01 ]   Congrats Arjun for securing AI internship at Intel![ 2024.11 ]   Congrats Veer for his work accepted as poster presentation in Sensors-2024, Kerala Univ![ 2024.10 ]   Congrats Sharath for securing the IndiaAI Research fellowship for his ongoing research![ 2024.10 ]   Congrats Sayan for securing the IndiaAI Research fellowship for his ongoing research![ 2024.09 ]   IndoML 2024 Travel Grant Awarded to Gourav, Mahim, and Prakhar to present their work on LLMs. Congrats all![ 2024.07 ]   Congrats Sayan for securing the competitive on-site internship at AWL Inc., Japan![ 2024.07 ]   Congrats Sharath for securing AI internship at Google![ 2024.07 ]   Congrats Bibhabasu and Rahul for securing AI internship at Adobe![ 2024.07 ]   Congrats Manish for securing AI internship at Amazon![ 2024.07 ]   Prakhar joined the Technical Team for LLMs in Datathon, IndoML’2024.[ 2024.06 ]   Prof. Mahesh will be serving as Datathon Chair for IndoML’2024.[ 2024.06 ]   Amara joined MakeMyTrip as a Senior Data Scientist. Best Wishes Amara![ 2024.04 ]   Congrats Amara for receiving the prestigious UG Chanakya Fellowship award![ 2022.08 ]   Presented two posters on AIFARMS technical conference on AI for agriculture.[ 2022.05 ]   Two journal papers got accepted (Signal processing Letters and Computers and Electronics in Agriculture).[ 2021.08 ]   Invited reviewer for the IEEE Transactions on Image Processing.[ 2021.04 ]   One paper is accepted in IEEE Transactions on Image Processing.[ 2020.07 ]   Worked in Virtual Reality for IIT-M Convocation (Snapshot, Media, Appraisal).[ 2019.11 ]   Invited reviewer for the Int’l journal Computer Vision and Image Understanding.[ 2019.07 ]   Selected for ICCV-19 Doctoral Consortium, Seoul, S. Korea.[ 2019.06 ]   One paper is accepted as Oral in ICCV-19 (4.3% acceptance rate).[ 2018.12 ]   Invited speaker at ICVGIP-18, “Light Field Deblurring”, Hyderabad, India.[ 2018.04 ]   Two papers are accepted in CVPR-18 (29% acceptance rate).[ 2017.12 ]   Invited speaker at NCVPRIPG-17, “RS Cameras”, Himachal Pradesh, India.[ 2017.07 ]   Awarded Microsoft & ACM grants to attend ICCV-17, Venice, Italy.[ 2016-17 ]   Two papers are accepted in ECCV-16 and ICCV-17 (~28 % acceptance rate).[ 2019.07 ]   Awarded Google grant to attend ICCV-19, Seoul, S. Korea. Last Update सदाशिव समारम्भाम् शंकराचार्य मध्यमाम्       Beginning with Sada Shiva, through the Shankaracharya in between, अस्मद् आचार्य पर्यन्ताम् वंदे गुरु परम्पराम्       and up to my own teachers, I bow to the whole tradition of teachers. Mahesh Mohan M R | Mahesh Mohan M R, Assistant Professor at IIT Kharagpur",
  "content_length": 4518,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:54"
}