{
  "name": "Mahir Arzoky",
  "homepage": "https://www.brunel.ac.uk/people/mahir-arzoky",
  "status": "success",
  "content": "Dr Mahir Arzoky | Introduction | Brunel University London Skip to Content Home People Dr Mahir Arzoky Dr Mahir ArzokyLecturer in Computer Science Wilfrd Brown Building 218 Email: mahir.arzoky@brunel.ac.uk Tel: +44 (0)1895 265471 Computer Science College of Engineering, Design and Physical Sciences Summary Dr Mahir Arzoky is a Lecturer in the Department of Computer Science at Brunel University London. Prior to this he was a Post-doctoral Research Fellow working on a research project titled Assessing the Quality of Test Suites in Industrial Code (AQUATIC - EPSRC: EP/M024083/1). He was a core member of the Fault Analyses in Industry and Academic Research Network (FIAR-NET - EPSRC: EP/N011627/1), where he promoted collaborations between industry and academic research in software engineering through a series of national and international workshops. Prior to this, he was a Research Associate in Machine Learning at the Cognitive Digital System Engineering Centre, Birmingham City University, where he worked on a collaborative Data-driven Smart City project that aimed to simplify complex decision making, informing policy and strategic service developments using unified data, and state of the art machine learning simulation and modelling. He was also part of an Innovation Engine project, part-funded by the European Regional Development Fund, that aimed at stimulating demand for new or improved services, processes and products from local SME businesses and start-up companies by bringing and helping to solve existing challenges within the Life Sciences, Digital and Creative sectors. Dr Arzoky obtained his PhD from the Department of Computer Science at Brunel University London in 2015. His research interest lies in the areas of Artificial Intelligence, Intelligent Data Analysis, Data Mining and Software Engineering, in specific Search Based Software Engineering. Newest selected publications Odebode, A., Tucker, A., Arzoky, M. and Swift, S. (2022) 'Estimating the Optimal Number of Clusters from Subsets of Ensembles'.11th International Conference on Data Science, Technology and Applications. Lisbon, Portugal. 11 - 13 July. SCITEPRESS - Science and Technology Publications. pp. 383 - 391.Open Access Link Conference paper Almahri, FAAJ., Bell, D. and Arzoky, M. (2021) 'Applications of machine learning in education: Personas design for chatbots', in Gulzar, Z. and Leema, AA. (eds.) Machine Learning Approaches for Improvising Modern Learning Systems. Hershey, PA, USA : IGI Global. pp. 72 - 113. ISBN 10: 1-7998-5010-2. ISBN 13: 978-1-7998-5009-0. Book chapter Nagaria, B., Evans, BC., Mann, A. and Arzoky, M. (2021) 'Using an Instant Visual and Text Based Feedback_Tool to Teach Path Finding Algorithms A Concept'.SEENG 2021 Third International Workshop on Software Engineering Education for the Next Generation. Virtual. 1 - 24 May. IEEE. pp. 11 - 15.Open Access Link Conference paper Counsell, S., Destefanis, G., Swift, S., Arzoky, M. and Taibi, D. (2020) 'On the Link between Refactoring Activity and Class Cohesion through the Prism of Two Cohesion-Based Metrics'.2020 IEEE 20th International Conference on Software Quality, Reliability and Security (QRS). Macau, China (virtual). 11 - 14 December. IEEE. pp. 91 - 98.Open Access Link Conference paper Counsell, S., Swift, S., Arzoky, M. and Destefanis, G. (2020) 'On Clones and Comments in Production and Test Classes: An Empirical Study'.25th International Conference on Product-Focused Software Process Improvement PROFES 2020. Turin, Italy. 21 - 27 November. Springer International Publishing. pp. 304 - 311. ISSN: 0302-9743 Conference paper More publications(25)",
  "content_length": 3646,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:54"
}