{
  "name": "Mahito Sugiyama",
  "homepage": "https://mahito.nii.ac.jp",
  "status": "success",
  "content": "Home | Sugiyama Lab, NIIComputation, Structure, and Learning Our group, led by Assoc. Prof. Mahito Sugiyama, studies machine learning at National Institute of Informatics (NII) in Tokyo since 2017. Machine learning is the discipline of studying intelligent computing systems, which nowadays plays a key role in artificial intelligence (AI). To reveal the nature of learning, we focus on the relationship between computational processes, discrete structures, and machine learning models. We belong to the Department of Informatics, SOKENDAI (The Graduate University for Advanced Studies), which offers 3-year and 5-year Ph.D. courses. More information is available at the NII website. News Fabian Jogl from TU Wien joined our lab as an internship student (Nov. 18, 2025). Aaron Thomas from University of Birmingham joined our lab as an internship student (Oct. 15, 2025). Laurits Fredsgaard Larsen from Technical University of Denmark and Basile Plus-Gourdon from ENS Paris-Saclay joined our lab as internship students (Oct. 6, 2025). Andrea Carrara from Technical University of Munich joined our lab as an internship student (Sep. 1, 2025). Our paper \"Optimal Submanifold Structure in Log-linear Models\" (First author: Derun Zhou) has been accepted to UAI 2025 (May 7, 2025). [OpenReview] [Poster] Daigo Okada (Assistant Professor at Gifu University) joined our lab as a cross-appointed researcher (May 1, 2025). Profir-Petru Pârțachi was appointed Assistant Professor at the Institute of Science Tokyo. Congratulations! (May 1, 2025) Toshiya Iwamori, Teppei Eda, and Hangtian Wang joined our lab as new Ph.D. students (Apr. 1, 2025). ▶ more news... Contact National Institute of Informatics, 2-1-2 Hitotsubashi, Chiyoda-ku, Tokyo 101-8430, Japan https://www.nii.ac.jp/en/about/access/ Email: mahito (at) nii.ac.jp",
  "content_length": 1814,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:54"
}