{
  "name": "Mahmood Jasim",
  "homepage": "https://csc.lsu.edu/~mjasim",
  "status": "success",
  "content": "Mahmood Jasim Hello. I am Mahmood Jasim. I am an incoming Assistant Professor in the Division of Computer Science and Engineering at Louisiana State University. My research focuses on designing, developing, and evaluating decision-support systems to enable informed data-driven decision-making to address complex socio-technical problems and make more confident personal decisions. I combine techniques and methodologies from Human-Computer Interactions (HCI), Information Visualization, Applied Machine Learning, and Social Computing to build decision-support systems for informed data-driven decision-making. I am currently recruiting Ph.D. students. If you are a prospective student and interested in my work, please reach out to me. Featured Projects See all CommunityClick In this project, we explore how interactive systems can capture and report community feedback to increase inclusivity in public meetings. CommunityPulse In this project, we investigate how visual analytics system can surface community's reflection, priorities, and hidden insights to enable civic leaders to analyze community input. Serendyze In this project, we explore how people make decisions based on online text information and how can serendipitious information help make better decisions. Featured Publications See all [Best Paper Award] Of Course it's Political! A Critical Inquiry into Underemphasized Dimensions in Civic Text Visualization. Eric P. S. Baumer, Mahmood Jasim, Ali Sarvghad, and Narges Mahyar. 2022. Computer Graphics Forum 41, 3 (EuroVis). Supporting Serendipitous Discovery and Balanced Analysis of Online Product Reviews with Interaction-Driven Metrics and Bias-Mitigating Suggestions. Mahmood Jasim, Christopher Collins, Ali Sarvghad, Narges Mahyar. 2022. CHI Conference on Human Factors in Computing Systems. [Best Paper Honorable Mention Award] CommunityPulse: Facilitating Community Input Analysis by Surfacing HiddenInsights, Reflections, and Priorities. Mahmood Jasim, Enamul Hoque, Ali Sarvghad, Narges Mahyar. 2021. Designing Interactive Systems (DIS). [Nominated for 2020 CODAwards] RisingEMOTIONS: Bridging Art and Technology to Visualize Public's Emotions about Climate Change. Carolina Aragon, Mahmood Jasim, Narges Mahyar. 2021. Creativity & Cognition. [Best Paper Award] CommunityClick: Capturing and Reporting Community Feedback from Town Halls to Improve Inclusivity. Mahmood Jasim, Pooya Khaloo, Somin Wadhwa, Amy X. Zhang, Ali Sarvghad, Narges Mahyar. 2020. PACM on Human Computer Interaction, Computer Supported Cooperative Work and Social Computing (CSCW).",
  "content_length": 2582,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:55"
}