{
  "name": "Mahmoud Rasras",
  "homepage": "https://nyuad.nyu.edu/en/academics/divisions/engineering/faculty/mahmoud-rasras.html",
  "status": "success",
  "content": "Mahmoud Rasras - NYU Abu Dhabi Skip To All NYU Navigation Skip To Main Content To open and close this bar, use optionalt+/ Mahmoud Rasras Professor of Electrical Engineering, NYU Abu Dhabi; Global Network Professor of Electrical and Computer Engineering, NYU Tandon Affiliation: NYU Abu Dhabi Education: PhD Catholic University of Leuven mr5098@nyu.edu Research Websites: Center for Cyber Security (CCS) Photonics Research Lab Research Areas: Photonic components for next-generation optical and microwave photonic networks Mahmoud Rasras is a Professor of Electrical Engineering at New York University Abu Dhabi (NYUAD). His research focuses on silicon photonics (SiPh), integrated circuits for mode- and polarization-division multiplexing, and the hybrid integration of 2D materials on the SiPh platform to enable precise phase tuning in advanced photonic systems. He also explores innovative applications in neuromorphic computing, harnessing the unique potential of these hybrid systems. Rasras earned his PhD in Physics from the Catholic University of Leuven, Belgium, where he conducted research at the renowned Interuniversity Microelectronics Centre (IMEC). His doctoral work, which focused on a spectroscopic photon-emission microscopy technique to study CMOS device reliability, earned him the Roger A. Haken Best Student Paper Award at the 1999 International Electron Devices Meeting (IEDM). Rasras has over 11 years of industrial research experience as a Member of Technical Staff at Bell Labs, Alcatel-Lucent (now Nokia) in New Jersey, USA. His contributions there advanced the development of photonic components for next-generation optical and microwave photonic networks. He developed ultra-narrow versatile tunable optical filters in the silicon photonics platform, optical transceivers, and all-optical logic technologies for high-speed data encryption. He also pioneered a linearized optical FM discriminator for microwave photonic applications. Before joining NYUAD, Rasras served as an Associate Professor at the Masdar Institute of Science and Technology in Abu Dhabi. There, he led efforts to address high-speed communication challenges, designing transceiver circuits for 400 Gb/s links and beyond. He spearheaded the development of low-temperature germanium photodetectors on CMOS-compatible platforms. His collaborations with GlobalFoundries and A*STAR's Institute of Microelectronics in Singapore resulted in the development of multi-axis opto-MEMS accelerometers. He also directed the SRC/GlobalFoundries Center for Excellence on Integrated Photonics at Masdar Institute. Rasras has authored over 200 journal and conference papers and holds 34 US patents. He has supervised several PhD and MSc students and served on technical program committees for major conferences, including Frontiers in Optics and the Laser Science Conference. He has also served as an Associate Editor for the journal Optics Express. Rasras is a Senior Member of IEEE, a member of the Mohammed bin Rashid Academy of Scientists (MBRAS), and a member of Sigma Xi, The Scientific Research Honor Society. He is also a Fellow of the Industry Academy of the International Artificial Intelligence Industry Alliance (AIIA). Courses Taught Expand/Collapse all",
  "content_length": 3249,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:55"
}