{
  "name": "Mahsa Salehi",
  "homepage": "https://research.monash.edu/en/persons/mahsa-salehi",
  "status": "success",
  "content": "Mahsa Salehi - Monash University Mahsa Salehi public CV View Scopus Profile Mahsa Salehi Dr Senior Lecturer, Department of Data Science & AI https://orcid.org/0000-0002-2991-1612 EmailMahsa.Salehimonashedu Accepting PhD StudentsPhD projectshttps://supervisorconnect.it.monash.edu/supervisors/mahsa-salehi 20082025 Research activity per year Personal profile Research interestsMahsa's current research interests are in Data mining and Machine learning, specifically: Multi-dimensional time series analysisAnomaly detectionTime series classificationLearning from non-stationary distributionsBrain-inspired machine learningBiographyMahsa is a Senior Lecturer in the Department of Data Science and AI, Faculty of Information Technology, Monash University. She was a postdoctoral researcher at IBM Research Australia before joining Monash. She received her PhD in Computer Science from the Department of Computing and Information Systems at the University of Melbourne in collaboration with the Machine Learning research group in NICTA. Awards: SIG KDD 2025 Audience Appreciation Award ICDM 2022 best paper runner-up award (top 0.2%) Selected amongst the “Top 200 Most Qualified Young Researchers in Computer Science and Mathematics” by the Scientific Committee of the Heidelberg Laureate Forum Foundation (HLFF), 2016 IBM Manager’s Choice Award, IBM Research Australia, 2016Winner of Australian 2012 Microsoft Imagine Cup Final (our team placed the 1st in Australia and among the top 20 in the World), 2012Melbourne School of Engineering (MSE) Teaching Excellence Award, University of Melbourne, 2014Excellence in Tutoring Award in the Department of Computing and Information Systems, University of Melbourne, 2014Emotiv Founders Scholarship, Emotiv Research, 2014 Monash teaching commitmentMahsa has experience as the Chief Examiner and Lecturer for the following units in the Faculty of IT: FIT1043 Introduction to Data Science FIT2082 Computer Science ProjectFIT5145 Introduction to Data Sicnece Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, University of MelbourneAward Date: 3 Aug 2016Software Engineering, Master of Science, Amirkabir University of TechnologyAward Date: 31 Aug 2009Information Technology, Bachelor of Science, Amirkabir University of TechnologyAward Date: 31 Aug 2008Computer Engineering, Bachelor of Science, Amirkabir University of TechnologyAward Date: 31 Aug 2006 Research area keywordsTime Series AnalysisMachine LearningAnomaly DetectionDeep LearningMultidimensional/non-linear learningSpatio-Temporal Data Analysis Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2018 2018 2019 2020 2022 2023 2024 2027 2 Active 6 Finished Projects per year AI for Clean Energy and SustainabilityWang, H. (Primary Chief Investigator (PCI)), Jalili, M. (Chief Investigator (CI)), Strengers, Y. (Chief Investigator (CI)), Hill, D. (Chief Investigator (CI)), Razzaghi, R. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Liebman, A. (Associate Investigator (AI)), Pink, S. (Associate Investigator (AI)), Le Bodic, P. (Associate Investigator (AI)), Salehi, M. (Associate Investigator (AI)), Wang, T. (Associate Investigator (AI)), Vered, M. (Associate Investigator (AI)), Rong, J. (Associate Investigator (AI)), George, Y. (Associate Investigator (AI)), Song, H. (Associate Investigator (AI)), Tafakori, L. (Associate Investigator (AI)), Sajjadi, S. (Associate Investigator (AI)), Pourkhanali, A. (Associate Investigator (AI)), Moradiamani, A. (Associate Investigator (AI)) & Kamoona, A. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research CSIRO Next Generation Graduates Program: Privacy-Preserving Machine Learning: Technology Development and AdoptionYuan, X. (Primary Chief Investigator (PCI)), Liu, J. (Chief Investigator (CI)), Ge, Z. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Yang, R. (Chief Investigator (CI)), Yi, X. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Fang, Y. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Baiao Dowsley, R. (Associate Investigator (AI)), Du, X. (Associate Investigator (AI)), Salehi, M. (Associate Investigator (AI)), Han, F. (Associate Investigator (AI)), Wakefield, R. (Associate Investigator (AI)), Abuadbba, S. (Associate Investigator (AI)), Wu, T. (Associate Investigator (AI)) & Liu, X. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Natural language: Natural language listening corpus with wearable EEGSalehi, M. (Primary Chief Investigator (PCI)) & Haffari, R. (Chief Investigator (CI))Emotiv Research Pty Ltd, Monash University – Internal Faculty Contribution1/07/24 → 1/02/25Project: Research PhD top up scholarship: Deep learning for brain EEG data analysisMohammadi Foumani, N. (Primary Chief Investigator (PCI)) & Salehi, M. (Supervisor)8/07/22 → 31/10/25Project: Research Virtual Power Plant Optimisation Project - Stage 1Liebman, A. (Primary Chief Investigator (PCI)), Stuckey, P. (Partner Investigator (PI)), de Nijs, F. (Partner Investigator (PI)), Salehi, M. (Project Manager) & Bergmeir, C. (Project Manager)1/08/20 → 30/06/21Project: Research View all 8 projects Research output Research output per year 2008 2016 2018 2020 2022 2024 2025 2025 34 Conference Paper 13 Article 1 Chapter (Book) Research output per year Research output per year CARLA: Self-supervised contrastive representation learning for time series anomaly detectionDarban, Z. Z., Webb, G. I., Pan, S., Aggarwal, C. C. & Salehi, M., Jan 2025, In: Pattern Recognition. 157, 13 p., 110874.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 49 Citations (Scopus) DACAD: Domain Adaptation Contrastive Learning for Anomaly Detection in Multivariate Time SeriesDarban, Z. Z., Yang, Y., Webb, G. I., Aggarwal, C. C., Wen, Q., Pan, S. & Salehi, M., Aug 2025, In: IEEE Transactions on Knowledge and Data Engineering. 37, 8, p. 4485-4496 12 p.Research output: Contribution to journal › Article › Research › peer-review 3 Citations (Scopus) Modeling and Detecting Urinary Anomalies in Seniors from Data Obtained by Unintrusive SensorsGe, Y., Salehi, M., Vered, M. & Zukerman, I., 2025, Machine Learning and Principles and Practice of Knowledge Discovery in Databases - International Workshops of ECML PKDD 2023 Turin, Italy, September 18–22, 2023 Revised Selected Papers, Part IV. Meo, R. & Silvestri, F. (eds.). Cham Switzerland: Springer, p. 336-344 9 p. (Communications in Computer and Information Science; vol. 2136).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open-Set Graph Anomaly Detection via Normal Structure RegularisationWang, Q., Pang, G., Salehi, M., Xia, X. & Leckie, C., 2025, 13th International Conference on Learning Representations, ICLR 2025. LeCun, Y. (ed.). Portland OR USA: OpenReview, p. 52628-52651 24 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Proximity forest 2.0: a new effective and scalable similarity-based classifier for time seriesTan, C. W., Herrmann, M., Salehi, M. & Webb, G. I., 14 Feb 2025, In: Data Mining and Knowledge Discovery. 39, 2, 14.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) View all 48 research outputs Prizes Australian Microsoft Imagine Cup FinalSalehi, M. (Recipient), Chong, H. W. (Recipient), Lin, A. (Recipient) & Rajah, K. (Recipient), 2012Prize: Prize (including medals and awards) ICDM-2022 Best Paper Runner-up Award winnerManapragada, C. (Recipient), Salehi, M. (Recipient) & Webb, G. (Recipient), 2022Prize: Prize (including medals and awards) SIGKDD Audience Appreciation AwardSalehi, M. (Recipient), 2024Prize: Prize (including medals and awards) Activities Activities per year 2015 2016 2018 2020 2023 4 Contribution to conference 3 Peer review responsibility 3 Patents 1 Editorial responsibility Activities per year ACM Transactions on Knowledge Discovery from Data (Journal)Salehi, M. (Associate editor)2023 → …Activity: Publication peer-review and editorial work types › Editorial responsibility IBM - International Business Machines Corporation (United States of America) (External organisation)Chen, S. A. (Inventor), Jalali, F. (Inventor), Salehi, M. (Inventor) & Vishwanath, A. (Inventor)4 Aug 2020Activity: Industry, Government and Philanthropy Engagement and Partnerships › Patents › Patent IBM - International Business Machines Corporation (United States of America) (External organisation)Baldauf, J. (Inventor), Jalali, F. (Inventor), Mashford, B. S. (Inventor) & Salehi, M. (Inventor)16 Jun 2020Activity: Industry, Government and Philanthropy Engagement and Partnerships › Patents › Patent Pacific-Asia Conference on Knowledge Discovery and Data Mining 2018Salehi, M. (Member of programme committee)2018Activity: Participating in or organising an event types › Contribution to conference SIAM International Conference on Data Mining 2018Salehi, M. (Member of programme committee)2018Activity: Participating in or organising an event types › Contribution to conference View all 11 activities",
  "content_length": 9792,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:56"
}