{
  "name": "Maia L. Jacobs",
  "homepage": "https://www.mccormick.northwestern.edu/research-faculty/directory/profiles/jacobs-maia.html",
  "status": "success",
  "content": "Jacobs, Maia | Faculty | Northwestern Engineering More About Northwestern Engineering IN THIS SECTION Faculty DirectoryMaia JacobsAssistant Professor of Computer ScienceAssistant Professor of Preventive MedicineContactMUDD 2233 Tech Drive3rd FloorEvanston, IL 60208-3109Email Maia JacobsDepartmentsComputer ScienceDownload CVEducationPh.D. Human Centered Computing, Georgia Institute of Technology, Atlanta, GA B.S. Industrial and Systems Engineering, University of Wisconsin-Madison, Madison, WI Research InterestsHuman-computer interaction; health; behavioral science; machine learning + designMy research focuses on using human-computer interaction methods to design andÂ evaluate technologies to support longitudinal health needs. My work provides a model for using user-centered design to create personalized and adaptive interventions- tools that will adapt content, resources, and interactions to a personâs evolving health status and health questions.Selected PublicationsCruz, Stefany; Lu, Claire; Ulloa, Mara; Redding, Alexander; Hester, Josiah David; Jacobs, Maia, Perceptions of Wearable Health Tools Post the COVID-19 Emergency in Low-Income Latin Communities, JMIR mHealth and uHealth (2024).Wong, Novia; Jeong, Sooyeon; Reddy, Madhusudhana C; Stamatis, Caitlin; Lattie, Emily Gardiner; Jacobs, Maia, Voice Assistants for Mental Health Services, Association for Computing Machinery, Inc (2024).Spring, Bonnie; Garcia, Sofia F.; Daly, Elyse; Jacobs, Maia; Jayeoba, Monisola; Jordan, Neil; Kircher, Sheetal; Kocherginsky, Masha; Mazzetta, Rana; Pollack, Teresa; Scanlan, Laura; Scherr, Courtney; Hitsman, Brian; Phillips, Siobhan M., Scalable Telehealth Cancer Care, Journal of the National Cancer Institute - Monographs (2024).Kim, Taewook; Kim, Hyeok; Roberts, Angela C.; Jacobs, Maia; Kay, Matthew, Opportunities in Mental Health Support for Informal Dementia Caregivers Suffering from Verbal Agitation, Proceedings of the ACM on Human-Computer Interaction (2024).Meyerhoff, Jonah; Kornfield, Rachel; Lattie, Emily Gardiner; Knapp, Ashley Arehart; Kruzan, Kaylee P.; Jacobs, Maia Lee; Stamatis, Caitlin A.; Taple, Bayley J.; Beltzer, Miranda L.; Berry, Andrew Barnden Lewis; Reddy, Madhusudhana C; Mohr, David C.; Graham, Andrea K., From formative design to service-ready therapeutic, Internet Interventions (2023).Cruz, Stefany; Redding, Alexander; Chau, Connie W.; Lu, Claire; Persche, Julia; Hester, Josiah David; Jacobs, Maia, EquityWare, Association for Computing Machinery (2023).Ulloa, Mara; Rothrock, Blaine; Ahmad, Faraz S.; Jacobs, Maia, Invisible clinical labor driving the successful integration of AI in healthcare, Frontiers in Computer Science (2022).Burgess, Eleanor R.; Kaziunas, Elizabeth; Jacobs, Maia, Care Frictions, Proceedings of the ACM on Human-Computer Interaction (2022). BACK TO TOP",
  "content_length": 2827,
  "method": "requests",
  "crawl_time": "2025-12-01 13:49:59"
}