{
  "name": "Maike Sonnewald",
  "homepage": "https://msonnewald.com",
  "status": "success",
  "content": "Maike Sonnewald My research develops AI methods to understand ocean circulation, marine ecosystems, and climate dynamics, translating fundamental discoveries into tools for prediction and policy. I pioneer physics-informed machine learning approaches by combining algorithmic innovation with domain knowledge from theory, observations, and numerical modeling, to address grand challenges in Earth science, from elucidating global ocean and atmosphere dynamics and regime identification to improving long-range forecasts of sea level and climate modes. At UC Davis, I lead the Computational Climate and Ocean Group with a focus on trustworthy AI: developing rigorous uncertainty quantification, explainable methods, and algorithms designed for sparse, noisy real-world data. My work bridges computational innovation and Earth science insight, with applications spanning large-scale ocean circulation, marine biogeochemistry, sea ice dynamics, and atmospheric rivers, and has influenced national AI strategy, international marine policy, and modeling systems used globally. Developing trustworthy ML methods (XAI, UQ, learning strategy) that respect physical constraints with applications to circulation dynamics, regime identification, and climate mode prediction Article on automated identification Article in Science Advances (2020) Article in Earth and Space Science (2019) Mining sparse, messy observations and model outputs to discover fundamental structures in marine ecosystems, biogeochemistry, and large-scale ocean and atmosphere dynamics Article in Nat. Com. Earth and Env. (2023) Review article in ERL (2021) NEMIGithub SAGE ProvincesGithub Translating research into policy-relevant tools: Sea level forecasting, ocean heat content monitoring, and fisheries management ICML talk Article in JAMES (2021) Hybrid models perspective in Nature Machine Intelligence THORGithub \"As a community we’re still only dipping our toes into the potential benefits of machine learning, as well as learning about the inevitable pitfalls. What is abundantly clear already is that machine learning can give us answers that seem correct for entirely wrong reasons.\" -- From my contribution to a guest post in the \"Carbon Brief\" Featured in The Guardian Featured on podcast Cover of JAMES CarbonBrief NOAA Artificial Intelligence Strategic Plan 2021-2025 ECCO Media Gallery RankRed Eos Buzz News \"The Batch\" at deeplearning.ai MIT news featured on Artificial Intelligence Research, physics.org, and ECN magazine physics.org Artificial Intelligence Research Github Instagram © Maike Sonnewald. All rights reserved.Design: HTML5 UP",
  "content_length": 2619,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:00"
}