{
  "name": "Mainack Mondal",
  "homepage": "https://cse.iitkgp.ac.in/~mainack",
  "status": "success",
  "content": "Mainack Mondal, Assistant Professor, CSE, IIT Kharagpur Email: Google Scholar CV (Last updated: July 2024) Department of Computer Science and Engineering, IIT Kharagpur, Room : 316 IIT Kharagpur, West Bengal, PIN: 721302, India I am an Assistant Professor at Department of Computer Science and Engineering, IIT Kharagpur, India. Previously, I was a postdoctoral researcher at Cornell Tech and a member of the Digital Life Initiative where I worked with Prof. Helen Nissenbaum. Prior to joining Cornell Tech I spent a fantastic year as a postdoc at the University of Chicago, Department of Computer Science. There I was a member of SUPERgroup and worked with Prof. Blase Ur. I completed my Ph.D. in Computer Science on November 2017 at the Max Planck Institute for Software systems where I was advised by Prof. Krishna P. Gummadi. I am broadly interested about incorporating human factors in security and privacy, and consequently designing usable online services. My recent research focus is on developing systems to provide usable privacy and security mechanisms to online users while minimizing system abuse. I am always looking for students who are interested in human aspects of privacy/security and like to tinker with systems. If you are already a student at IIT Kgp && if you feel strongly about making the digital world private and secure for the users just drop me a mail. Also it will be beneficial for both of us if you have taken the Usable Security and Privacy course. Latest updates May 2024 Our work on understanding how we can leverage reflective learning based videos to educate used about tageted advertising on Facebook got an honourable mention in CHI 2024! Super excited. Congratulations Garett, Sarah, Rhea, Stephanie, Yun-Chieh, Rachel, Josh, Trevor, Brian, Norman, Bart and Xinru! April 2024 Our work on improving medical document summarizing using a novel method to handle out of vocabulary words is accepted in IJCAI 2024 ! Congratulations Gunjan, Soumyadeep and Niloy! March 2024 I am honored to receive the inaugural edition of the IITB Trust Lab Early Career Award! March 2024 Our work on measuring the asymmetry between the online resources available to victims and abusers of Intimate partner surveillance is accepted in Euro S&P 2024! Congratulations Majed, Mazhar, Saptarshi and Rahul! Feb 2024 Our work on investigating why end-users switch between VPN services (and what features do they want) is accepted in Usenix Security 2024! Congratulations Rohit! Feb 2024 Our preliminary work on gender bias in journal-politician interaction in Indian Twitter is accepted in WebSci 2024! Congratulations Brisha! Feb 2024 Our work on understanding how we can leverage reflective learning based videos to educate used about privacy on Facebook is accepted in CHI 2024! Congratulations Garett, Sarah, Rhea, Stephanie, Yun-Chieh, Rachel, Josh, Trevor, Brian, Norman, Bart and Xinru! Jan 2024 I am serving as PC co-chair for SOUPS 2024 with Dr. Katharina Krombholz! Please consider submitting your research on human-centered Security and Privacy. Dec 2023 Our preliminary work on understanding if defenses of backdoor attacks works on recent transformer based models is accepted in SPACE 2023! Congratulations Bipab, Rohit and Abir! Nov 2023 Our work in understanding the mental model of users regarding different cryptocurrencies is accepted in CCS 2023! Congratulations Easwar, Udit, Mohsen and Aniket! In this work we answered why users stil did not use threshold crypto wallets even though they are more secure against certain attacks. Nov 2023 Our work in understanding the difference of cultural privacy norms when social media users disclose information about their people they know is accepted in CSCW 2023! Congratulations Anju, Scott, Kenneth, Chaz, Nathan, Noah, Nathaniel, Josh, Jaden, Isha, Yao, Nancy and Xinru! August 2023 Our system MDAP which leverage module dependency for predicting anomalies is accepted in Computer Communications ! Congratulations Harsh and team! Research Interests I design, implement and analyze usable private and secure online systems. My work integrates security and privacy, human-computer interaction and systems research. Specifically, I often start from prominent privacy, security or anti-abuse norms (via examining laws or performing user studies grounded in contextual integrity of other privacy theories), audit online systems via automation if they are following those norms and finally aim to build end-to-end systems which aligns well with the identified norms. Some of my prominent ongoing research projects are below: Assisting Users to Afford Protection of Data Privacy and Security Regulations Today, data privacy regulations are being deployed in multiple different jurisdictions. GDPR is enforced in EU and CCPA is already in effect in the US. Other countries have also enforced regulations like LGPD (Brazil) and PIPEDA (Canada). However, it is not clear, if existing systems are helping end users to afford the protections offered by these laws. Our body of (ongoing) work aims to design and build automated smart assistive mechanisms for privacy and security management of user data as identified by legal regulations. The regulations we focus on span from temporal privacy to third-party tracking protection. Some specific focus of our work is: Improving usability of retrospective access management in online data archives (enabling \"Right to be forgotten\") [SEC'22][ICWSM'21][NDSS'21][CCS'19][PoPETS'19][SOUPS'18] We are investigating the effectiveness of tools (e.g., data privacy dashboard, privacy settings) which enable users to retrospectively modify (delete/edit old content or retrospectively change the audience) their past content in online archives (like social media or cloud storage). Our final goal is to design new mechanisms and systems which will let online users better manage the security and privacy of their old content. Bringing transparency and control to third-party behavior tracking (enabling \"informed consent\" in cookie-based tracking) [EuroUSEC'22][WebSci'21][CCS'19] Laws like GDPR in the EU mandated all websites operating in their jurisdiction to obtain users’ informed consent before tracking those users and collecting their data. Today, this is achieved by showing users cookie consent notices and sometimes showing users the names of the cookies used by a website. However, the cookie consent notices have multiple designs, the cookie names are often intelligible to the users and overall the end-users might not know what data is aggregated about them by correlating data from multiple websites. In this line of research we aim to give control back to users by identifying principles of designing good cookie consent management interfaces as well as informing users about the purpose of the cookies and the data they enable companies to gather about themselves. Improving Indian Unified Payment Interface (UPI) apps to enabling users fight against financial fraud [SOUPS'22 Poster] Online payment methods have gained enormous traction in India due to the launch of Unified Payment Interface (UPI), an API developed by the government-based identity National Payments Corporation of India (NPCI), to facilitate free and instant money transfers between users’ bank accounts. Multiple financial apps use this API and often enable money transfer directly from Indian bank accounts via just a click. However, this functionality also gives rise to a flurry of fraudulent transactions, often via social engineering attacks. We are investigating if the UPI app interfaces help to deter or even facilitate financial frauds. Limiting abuse in online platforms [ICWSM'23] [ICWSM'22] [THAM'18] [HT'17] [ICWSM'16] [ICWSM'15] HATESPEECH DATASET 89 MILLION ANONYMOUS WHISPER POSTS DATASET HIGH-ACCURACY AD-HOMINEM FALLACY DETECTOR COVID-19 ANTI-PRO VAX STANCE DATASET We investigate user behavior in online platforms using large-scale data and via user-studies. We identified that privacy and anonymity is a blessing to most of the user since they enable users to upheld free speech. However, a few users abuse the system (sometimes) under the veil of anonymity and take advantage of the platform in the form of posting abusive content like hatespeech, vaccine-related misinformation or using ad-hominem fallacies to silence opinions. To that end, we work on developing techniques to detect and investigate hate speech in online platforms. Managing online data privacy and security in Online Social Media Platforms [IJAESAM'17] [IC'17] [SOUPS'16] [USEC'14] [SOUPS'14] [CoNEXT'12] [EuroSys'12] We developed the model of exposure control (controlling who actually views a piece of online content), an extension of existing access control (controlling who has access to the online content) for building more secure/private systems. We apply this theory of exposure control in multiple real-world scenarios and built systems for end users. These exposure control based systems enabled us to better capture user intention and design more private and usable systems compare to the state of the art. Publications Refereed publications (updated till Mar 2025, please see google scholar for latest publications) “We Must Protect the Transformers”: Understanding Efficacy of Backdoor Attack Mitigation on Transformer Models Rohit Raj, Biplab Roy, Abir Das, Mainack Mondal. In the Proceedings of the International Conference on Security, Privacy, and Applied Cryptography Engineering (SPACE) , IIT Roorkee, India, December 2023. ABSTRACT PDF BIBTEX Abstract: Recently, Neural Network based Deep Learning (DL) backdoor attacks have prompted the development of mitigation mechanisms for such attacks. Out of them a key mitigation mechanism is Neural Cleanse, which helps in the identification and mitigation of DL backdoor attacks. It identifies the presence of backdoors in Neural Networks and constructs a reverse-engineered trigger, which is later used to mitigate the backdoor present in the infected m",
  "content_length": 87444,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:01"
}