{
  "name": "Maitraye Das",
  "homepage": "https://maitraye.github.io",
  "status": "success",
  "content": "Maitraye Das Maitraye Das . I am an Assistant Professor in the Khoury College of Computer Sciences and the College of Arts, Media and Design at Northeastern University, where I direct the Technology, Equity, and Accessibility Lab. My research in Human-Computer Interaction (HCI) focuses on making collaboration, content creation, and learning more accessible and equitable for people with disabilities. In this space, I have investigated how accessibility is created and negotiated in the contexts of collaborative writing, creative making, and remote work in ability-diverse teams. I take a community-centered research approach combining in-depth formative studies (e.g., contextual interviews, ethnographic field observations) with iterative system building and evaluation. Some examples of my recent work include developing spoken and non-speech auditory interactions for enhancing accessibility in asynchronous and synchronous collaborative writing, an audio-enhanced loom for accessible weaving, and an audio-tactile system for accessible pattern generation. I draw on Disability Studies literature to critically interrogate what roles technologies play in reshaping group dynamics and redistributing the labor of creating access in ability-diverse teams. More recently, our group has started exploring accessibility of generative AI for blind and low vision people, such as their use contexts and mental models of GenAI tools and alt text for AI-generated images. My research has been recognized with several Best Paper Awards and Honorable Mentions at premier venues including ACM CHI, CSCW, ASSETS, and IEEE COMPSAC, the Daniel H. and Carolyn E. Ecroyd Fellowship, and research grants from Northeastern, Northwestern, and UW. I was selected as a Google Research Scholar in Human-Computer Interaction in 2024 and a Rising Star in EECS in 2021. Prior to Northeastern, I was a Postdoctoral Scholar in the Center for Research and Education on Accessible Technology and Experiences (CREATE) at the University of Washington. I completed my PhD and MS in Technology and Social Behavior (dual degree in Computer Science and Communication) from Northwestern University, where I worked with Darren Gergle and Anne Marie Piper. Previously, I received a BS in Computer Science and Engineering from Bangladesh University of Engineering and Technology and worked as a research intern at Microsoft Research and a lecturer in the Department of Computer Science and Engineering at United International University, Bangladesh. Apart from academic activities, I have always been passionate about music. I also like traveling and roaming around new places. Now and then I try to get a break from my busy schedule and set out for a tour with my friends and family. Name Pronunciation Moy-trey-ee (Maitraye) Daash (Das). Maitraye means friendly in Bangla. Click the audio player below to listen to the pronunciation of my name. Pronouns: She/her Recent News Received Google Research Scholar Award 2024 in Human-Computer Interaction! Featured by Khoury News. Received CAMD Strategic Priorities Seed Grant to kickstart a new project in collaboration with Rebecca Kleinberger! Invited talk at UIUC SALT Lab! Three papers have been accepted at CHI 2025! Invited as a reviewer on three NSF panels. Paper on blind people's mental models of generative AI is accepted at ASSETS 2024! Invited talk at American Federation for the Blind Leadership Conference 2024. Invited panel discussion on \"Disability and Design Futures!\" organized by the Center for Design at Northeastern! [Medium article] Paper on accessibility in collaborative ideation is accepted at CSCW 2024! Paper on alt text for AI-generated images is published at CHI 2024! Paper on inclusive play among neurodiverse children is accepted at TOCHI! Invited guest lectures at UMich iSchool Intro to Accessibility, Northeastern MIE Engineering for Disability, and Northeastern CS Computer-Human Interaction courses! Invited talk at the CMU A11Y lunch! Paper on Simphony, an audio-tactile tool for enhancing accessible pattern generation is accepted at CHI 2023! Received a Postdoc Research Award from UW CSE! Invited talk at the DUB seminar! I'll be joining Northeastern University as an Assistant Professor! Paper on group autoethnography in an ability-diverse team is invited for publication in CACM Research Highlights! Previously it received a Best Paper Nomination at ASSETS 2021! Freshly minted Dr. Maitraye Das here — I've successfully defended my PhD dissertation! Awarded Daniel H. and Carolyn E. Ecroyd Fellowship from the Dept of Communication Studies at Northwestern! Paper on Co11ab, an accessible system for synchronous collaborative writing is accepted at CHI 2022! Paper on accessibility in remote work for neurodivergent professionals received a Best Paper Award and Diversity & Inclusion Recognition at CSCW 2021! Invited talk at MIT Visualization Group and University of Washington CREATE! Received PhD student research award from the Dept of CS at Northwestern! Paper on the design and evaluation of accessible collaborative writing techniques is published in TOCHI! Selected as a 2021 Rising Star in EECS! Paper on Melodie, an audio-enhanced loom for accessible weaving is published in TACCESS! Received a Graduate Research Grant and a Dissertation Research Grant from Northwestern University! Attending HCIC 2021 to talk about my research on ability-diverse collaboration! Received MS in Technology and Social Behavior! Submission to CSCW 2020 doctoral consortium is accepted! Working with the Ability team at Microsoft Research as research intern for Summer 2020! Paper on understanding accessible making in a community of blind weavers received a Best Paper Honorable Mention Award at CHI 2020! Selected as a Finalist for the Microsoft Research PhD Fellowship 2020! Paper on accessibility in collaborative writing received a Best Paper Honorable Mention Award at CSCW 2019! Presented paper on gender-based self-focus bias in OpenStreetMap at CHI 2019. Paper on genomic privacy received a Best Paper Award at COMPSAC 2018! Paper on autism support smart technology is accepted at CHI 2018. Received student travel grant to volunteer at UbiComp'18 in Singapore. Will talk about my research at the Broadening Participation Workshop. Will be presenting at Grace Hopper Celebration 2018 at Houston, Texas. Received Student Scholarship! Presented paper on post-partum social networking at ICCIT 2017. Recorded a song for 'Arunodoyer Usha'- a production by Kantho:BUET. Accepted PhD offer from the TSB program at Northwestern University. Got Married! Publications Please refer to my Google Scholar page for a full list with citations. Peer-Reviewed Journal and Conference Papers Maitraye Das, Megan Tran, Amanda Chih-han Ong, Julie Kientz, and Heather Feldner. 2025. Cultivating Computational Thinking and Social Play among Neurodiverse Preschoolers in Inclusive Classrooms. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '25). [ACM DL Link] [Video] Rudaiba Adnin, Atharva Pandkar, Bingsheng Yao, Dakuo Wang, and Maitraye Das. 2025. Examining Student and Teacher Perspectives on Undisclosed Use of Generative AI in Academic Work. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '25). [ACM DL Link] [Video] Aaleyah Lewis, Jesse J Martinez, Maitraye Das, and James Fogarty. 2025. Inaccessible and Deceptive: Examining Experiences of Deceptive Design with People Who Use Visual Accessibility Technology. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '25). [ACM DL Link] Rudaiba Adnin and Maitraye Das. 2024. \"I look at it as the king of knowledge\": How Blind People Use and Understand Generative AI Tools. In Proceedings of the International ACM SIGACCESS Conference on Computers and Accessibility, (ASSETS '24). [ACM DL Link] [Video] Maitraye Das, Abigale Stangl, and Leah Findlater. 2024. \"That comes with a huge career cost\": Understanding Collaborative Ideation Experiences of Disabled Professionals. In Proceedings of the ACM on Human-Computer Interaction, (CSCW '24). [ACM DL Link] Maitraye Das, Alex Fiannaca, Meredith Ringel Morris, Shaun Kane, and Cynthia Bennett. 2024. From Provenance to Aberrations: Image Creator and Screen Reader User Perspectives on Alt Text for AI-Generated Images. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI ’24). [ACM DL Link] [Video] Kiley Sobel, Maitraye Das, Sara Behbakht, and Julie Kientz. 2024. Incloodle-Classroom: Technology for Inclusive Joint Media Engagement in a Neurodiverse Kindergarten Classroom. In ACM Transactions on Computer-Human Interaction (TOCHI). [ACM DL Link] [Video] Maitraye Das, Darren Gergle, and Anne Marie Piper. 2023. Simphony: Enhancing Accessible Pattern Design Practices among Blind Weavers. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI ’23). [ACM DL Link] [Video] Maitraye Das, Thomas McHugh, Anne Marie Piper, and Darren Gergle. 2022. Co11ab: Augmenting Accessibility in Synchronous Collaborative Writing for People with Vision Impairments. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI '22). [ACM DL Link] [Video] Maitraye Das, Anne Marie Piper, and Darren Gergle. 2022. Design and Evaluation of Accessible Collaborative Writing Techniques for People with Vision Impairments. In ACM Transactions on Computer-Human Interaction (TOCHI), Vol. 29, 2, Article 9 (April 2022), 42 pages. [ACM DL link] [Video] Maitraye Das, John Tang, Kathryn E. Ringland, and Anne Marie Piper. 2021. Towards Accessible Remote Work: Understanding Work-from-Home Practices of Neurodivergent Professionals. In Proceedings of the ACM on Human-Computer Interaction, Vol. 5, CSCW1, Article 183, (April 2021), 30 pages. [ACM DL link] [Video] *Best Paper Award *Recognition for Contribution to Diversity & Inclusion Kelly Avery Mack, Maitraye Das, Dhruv Jain, Danielle Bragg, John Tang, Andrew Begel",
  "content_length": 21481,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:02"
}