{
  "name": "Maja Pantic",
  "homepage": "http://www.ibug.doc.ic.ac.uk/maja",
  "status": "success",
  "content": "Maja Pantic : Home majapantic Professor of Affective and Behavioral Computing Head of the i·bug group Scientific Research Lead Imperial College London Facebook Home / Biography / Research / Activities / Publications / Teaching / Contact With Hatice Gunes, Michel Valstar, and Antonis Oikonomopoulos in Delft in 2006 Speaking at an European Research Council event in Paris in 2008 With Marcello Mortillaro, Hatice Gunes, Michel Valstar, Mihalis Nicolaou, Stefanos Zafeiriou, Konstantinos Bousmalis and Bjoern Schuller at FG 2011 i-BUG in The Royal Society in London in 2011 Receiving Roger Needham Award 2011 from Andrew Blake in Royal Society in London Speaking at T100 event (celebrating 100 years since the birth of Alan Turing) in Edinburgh in 2012 iBUG in Thessaloniki in 2013 With FROG robot in Seville in 2014 iBUG at CVPR 2015 in Boston Speaking at World Economic Forum in Davos 2016 at Nature's Ideas Lab With Sabine Hauert and Chris Bishop in Royal Society in 2016 With Jie Shen and the robots Nao and Zeno in 2016 Explaining our research on robots for autistic children to Mr Woody Johnson, the ambassador of the USA to the UK, March 2018 Opening of the Samsung AI Centre in Cambridge in May 2018, with Mr Hyun Suk Kim, the CEO of Samsung Speaking at TEDxCERN in Geneva in 2018 Home Maja Pantic is a Professor of Affective and Behavioral Computing and leader of the i·BUG group and the AI Scientific Research Lead in Facebook London, working on machine analysis of human non-verbal behaviour and its applications to human-computer, human-robot, and computer-mediated human-human interaction. Prof. Pantic published more than 250 technical papers in the areas of machine analysis of facial expressions, machine analysis of human body gestures, audiovisual analysis of emotions and social signals, and human-centered machine interfaces. She has more than 30,000 citations to her work, and has served as the Key Note Speaker, Chair and Co-Chair, and an organization/ program committee member at numerous conferences in her areas of expertise (Google Scholar Profile) (Wikipedia).",
  "content_length": 2086,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:08"
}