{
  "name": "Majdi Sawalha",
  "homepage": "http://djasljsa.academia.edu/MajdiSawalha",
  "status": "success",
  "content": "Majdi S Sawalha - The University Of Jordan Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Majdi S SawalhaThe University Of Jordan, Computer Information systems, Faculty MemberaddFollowdoneFollowingFollowers124Following69Co-authors5Public ViewsRelated Authors Na'ama Pat-ElThe University of Texas at Austin Mark W. PostThe University of Sydney T. Florian JaegerUniversity of Rochester Louis de SaussureUniversity of Neuchâtel Armando Marques-GuedesUNL - New University of Lisbon Eitan GrossmanThe Hebrew University of Jerusalem Martin HaspelmathMax Planck Institute for Evolutionary Anthropology Walid SalehUniversity of Toronto Michael Lessard-CloustonBiola University Guillaume JacquesCentre National de la Recherche Scientifique / French National Centre for Scientific ResearchInterests UploadsPapers by Majdi S SawalhaProsody prediction for arabic via the open-source boundary-annotated qur’an corpusJournal of Speech Sciences, 2021humans or machines. To develop phrase break classifiers, we need a boundary-annotated and part-of... more humans or machines. To develop phrase break classifiers, we need a boundary-annotated and part-ofspeech tagged corpus. Boundary annotations in English speech corpora are descriptive, delimiting intonation units perceived by the listener; manual annotation must be done by an expert linguist. For Arabic, there are no existing suitable resources. We take a novel approach to phrase break prediction for Arabic, deriving our prosodic annotation scheme from Tajwid (recitation) mark-up in the Qur’an which we then interpret as additional text-based data for computational analysis. This mark-up is prescriptive, and signifies a widely-used recitation style, and one of seven original styles of transmission. Here we report on version 1.0 of our Boundary-Annotated Qur’an dataset of 77430 words and 8230 sentences, where each word is tagged with prosodic and syntactic information at two coarse-grained levels. We then use this dataset to train, test, and compare two probabilistic taggers (trigram an...Download “Arab women’s Spring” revisited: media attitudes and public opinion in GermanyFeminist Media Studies The Design and the Construction of the Traditional Arabic Lexicons Corpus (The TAL-Corpus)Modern Applied ScienceArabic lexicography is a well-established and deep-rooted art of Arabic literature. Computational... more Arabic lexicography is a well-established and deep-rooted art of Arabic literature. Computational lexicography, invests computational and storage powers of modern computers, to accelerate long-term efforts in lexicographic projects. A collection of 23 machine-readable dictionaries, which are freely available on the web, were used to build the Corpus of Traditional Arabic lexicons (the TAL-Corpus). The purpose for constructing the TAL-Corpus is to collect and organize well-established and long traditions of traditional Arabic lexicons which can also be used to create new corpus-based Arabic dictionaries. The compilation of the TAL-Corpus followed standard design and development criteria that informed major decisions for corpus creation. The corpus building process involved extracting information from disparate formats and merging traditional Arabic lexicons. As a result, the TAL-Corpus contains more than 14 million words and over 2 million word types (different words).&nbsp; The TAL-...Download Predicting phrase breaks in classical and modern standard Arabic textWe train and test two probabilistic taggers for Arabic phrase break prediction on a purpose-built... more We train and test two probabilistic taggers for Arabic phrase break prediction on a purpose-built, \"gold standard\", boundary-annotated and PoS-tagged Qur\"an corpus of 77430 words and 8230 sentences. In a related LREC paper (Brierley et al., 2012), we cover dataset build. Here we report on comparative experiments with off-the-shelf N-gram and HMM taggers and coarse-grained feature sets for syntax and prosody, where the task is to predict boundary locations in an unseen test set stripped of boundary annotations by classifying words as breaks or non-breaks. The preponderance of non-breaks in the training data sets a challenging baseline success rate: 85.56%. However, we achieve significant gains in accuracy with the trigram tagger, and significant gains in performance recognition of minority class instances with both taggers via Balanced Classification Rate. This is initial work on a long-term research project to produce annotation schemes, language resources, algorithms, and applications for Classical and Modern Standard Arabic.Download Boundary Annotated Qur'an Corpus for Arabic Phrase Break Prediction Open-Source Boundary-Annotated Corpus for Arabic Speech and Language ProcessingA boundary-annotated and part-of-speech tagged corpus is a prerequisite for developing phrase bre... more A boundary-annotated and part-of-speech tagged corpus is a prerequisite for developing phrase break classifiers. Boundary annotations in English speech corpora are descriptive, delimiting intonation units perceived by the listener. We take a novel approach to phrase break prediction for Arabic, deriving our prosodic annotation scheme from Tajwīd (recitation) markup in the Qur\"an which we then interpret as additional text-based data for computational analysis. This markup is prescriptive, and signifies a widely-used recitation style, and one of seven original styles of transmission. Here we report on version 1.0 of our Boundary-Annotated Qur\"an dataset of 77430 words and 8230 sentences, where each word is tagged with prosodic and syntactic information at two coarse-grained levels. In (Sawalha et al., 2012), we use the dataset in phrase break prediction experiments. This research is part of a larger-scale project to produce annotation schemes, language resources, algorithms, and applications for Classical and Modern Standard Arabic.arrow_back_iosarrow_forward_iosDownload Visualisation of Arabic Morphology المشاريع الحاسوبية على اللغة العربية والقرآن بجامعة ليدز \"Arabic and Quranic Computational Linguistics Projects at the University of LeedsDownload Open-source resources and standards for Arabicword structure analysis: Fine grained morphological analysis of Arabic text corporaMorphological analyzers are preprocessors for text analysis. Many Text Analytics applications nee... more Morphological analyzers are preprocessors for text analysis. Many Text Analytics applications need them to perform their tasks. The aim of this thesis is to develop standards, tools and resources that widen the scope of Arabic word structure analysis-particularly morphological analysis, to process Arabic text corpora of different domains, formats and genres, of both vowelized and non-vowelized text. We want to morphologically tag our Arabic Corpus, but evaluation of existing morphological analyzers has highlighted ... Accelerating the Processing of Large Corpora: Using Grid Computing Technologies for Lemmatizing 176 Million Words Arabic Internet CorpusDownload Modern Standard Arabic sentences: problems and pitfalls for automated processing Visualisation of Prosody in English and Arabic Speech Corpora Arabic Phonetics and Phonology for Text Analytics and Natural Language Processing ApplicationsWe plan to apply Text Analytics techniques honed on English for corpus-based exploration of Arabi... more We plan to apply Text Analytics techniques honed on English for corpus-based exploration of Arabic, for Arabic Text-to-Speech (TTS) and other applications. Such techniques depend on a corpus or sample of naturally-occurring language texts capturing empirical data on the phenomena being studied, for example prosodic-syntactic patterns at phrase juncture or perceived pauses in the speech stream. For Modern Standard Arabic, this would require a representative, multi-speaker corpus of transcribed speech with phrase break annotations and &#39;gold standard&#39; part-of-speech (POS) categories. We can then mine these annotations as well as plain text. Collaborators on this project have research interests and expertise in Corpus Linguistics, Artificial Intelligence, Text Analytics, and Lexicography for English and Arabic [1], [2], [3]. One focus area is the prosody-syntax interface: our approach builds on previous work on English prosody and Text Analytics [4] and involves mining rhythmic ...Download توظيف قواعد النحو والصرف في بناء محلل صرفي للغة العربية (Adapting Language Grammar Rules for Building Morphological Analyzer for Arabic Language) التحليل الصَّرفي لنصوص اللغة العربية الحديثة والكلاسيكية \"Morphological Analysis of Classical and Modern Standard Arabic Text Unifying linguistic annotations and ontologies for the Arabic QuranDownload Full automatic Arabic text tagging systemPart-of-Speech tagging is the process of assigning grammatical part-of-speech tags to words based... more Part-of-Speech tagging is the process of assigning grammatical part-of-speech tags to words based on their context. Many automated tagging systems have been developed for English and many other western languages, and for some Asian languages, and have achieved accuracy rates ranging from 95% to 98%. A tagged corpus has more useful information than untagged corpus; so, tagged corpus can be used to extract grammatical and linguistic information from the corpus. Then, it can be used for many applications such as creating dictionaries and grammars of a language using real language data. Tagged corpora are also useful for detailed quantitative analysis of text.Download Open-source resources and standards for Arabic word structure analysis: Fine grained morphological analysis of Arabic text corporaMorphological analyzers are preprocessors for text analysis. Many Text Anal",
  "content_length": 11388,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:09"
}