{
  "name": "Majid Komeili",
  "homepage": "http://people.scs.carleton.ca/~majidkomeili",
  "status": "success",
  "content": "Majid Komeili, PhD Majid Komeili I am an Associate Professor at the School of Computer Science and the Institute for Data Science and a faculty affiliate with the Accessibility Institute at Carleton University, and Director of the Intelligent Machines Lab (iML). I perform fundamental and applied research in machine learning. Prospective Students I have a few open positions in ML, NLP and CV for which I am looking to admit Ph.D. and Masters students. --Read more. Biography Before joining Carleton, I was a postdoctoral fellow at University of Toronto working jointly with Toronto Rehabilitation Institute and Vector Institute. I received my PhD from Department of Electrical and Computer Engineering at University of Toronto. Email firstname.lastname@carleton.ca Follow @KomeiliMJ Address 5436 Herzberg Laboratories, Carleton University 1125 Colonel By Drive, Ottawa Ontario, Canada, K1S 5B6 Phone 613-520-2600 ext. 6098 Research Research Interests My research interest is in machine learning, deep learning and related areas in computer vision and natural language processing. More specifically, I am interested in interpretable machine learning, deep neural networks and transfer learning. The goal is to create ML models with explainability in mind, or to develop methods that can decipher existing black-box ML models. I am also interested in how ML models can learn to perform new tasks with limitted amount of labeled data; a capability that human is very good at. Along this line, generative models and effective use of language models and vision-language models are crucial. Current projects Explainable AI and NLP for assessment of functional limitations and disability services for postsecondary education (collaboration with the Accessibility Institute) Explainable AI and Computer Vision for assessment of acute lung injury in histology images (Collaboration with the Ottawa Hospital) Explainable AI and NLP to help better understand issues around misinformation and vaccine hesitancy in social media (collaboration with the Department of law and Legal Studies and the School of Journalism and Communication at Carleton U) Generative models for communicating graphical information to visually impaired or blind individuals Explainable AI for predicting chronic homelessness (collaboration with the City of Ottawa) Past projects Digital tools for revitalizing endangered languages (ELK-Tech) Explainable AI for predictive analytics in employee benefits insurance Biometrics, spoofing attacks and countermeasures ML for analyzing brain signals (EEG) ML for unobtrusive monitoring of vital physiologic parameters ML for analyzing brain MRI images in patients with ASD Students Current members Abbas Akkasi, Postdoctoral Fellow (with Boris Vukovic and Kathleen Fraser) Mohammad Reza Zarei, PhD (with Frank Dehne) Adnan Khan, PhD Soroush Majd, PhD (from Fall 2025) Hoda Vafaeesefat, MCS Youssef Fahmani, MCS (with Adrian Chan) Wooseok Kim, MCS (from Fall 2025) Alireza Choubineh, RA Past Grad Students Alireza Choubineh, MCS, Fall 2024 Rakshil Kevadiya, MCS, Fall 2024 (with Boris Vukovic and Kathleen Fraser), moved on to Canada Revenue Agency Mitchell Chatterjee, MCS, Summer 2024 (with Adrian Chan), moved on to JSI Seyed Omid Davoudi, PhD, Winter 2024, (with Frank Dehne), moved on to Larus Technologies Aatreyi Pranavbhai Mehta, MCS, Winter 2023, moved on to Razor Sharp Consulting Galen O'Shea, MCS, Winter 2023, moved on to Mission Control Mohammad Mahdi Heydari Dastjerdi, MCS, Summer 2022, Paphus Solutions Mohammad Nokhbeh Zaeem, MCS, Winter 2021, moved on to SoundHound Inc Siraj Ahmed, MCS, Fall 2020, U Ottawa, Co-supervised with Prof. J. Park, moved on to Braiyt AI Inc Abhijeet Chauhan, MCS, Summer 2020, moved on to IMRSV Data Labs Past Undergrad Students Mir Hassan, Winter 2025, Honors Project Saurabh Gummaraj Kishore, Winter 2024, Honors Project David Hobson, Winter 2023, Honors Thesis Kailash Balakrishnan, Winter 2023, Honors Project Jesse Mendoza, Fall 2022, Honors Project Hilaire Djani, Winter 2022, Honors Thesis Tim Elliott, Honors Project Juntong He, Honors Project Qixiang Luan, Honors Project M. Kazman, Fall 2021, Honors Project. A. Ong, Fall 2021, Honors Project. J. Woo, Summer 2021, Honors Project. I. Nicolaev, Summer 2021, Honors Project. M. Kazman, Summer 2021, Honors Project. J. Geng, Winter 2021, Honors Project. Y. Song, Winter 2021, Honors Project. K. Zhen, Winter 2021, Honors Project. H. Le, Fall 2020, Honors Project. Y. Gao, Fall 2020, Honors Project. T. Cao, Fall 2020, Honors Project. Y. Chen, Fall 2020, Honors Project. V. Nguyen, Summer 2020, Honors Project. J. Danovitch, Winter 2020, Honors Thesis. M. Kuzmenko, Winter 2020, Honors Project. L. Wise, Winter 2020, Honors Project. L. Koftinow-Mikan, Fall 2019, Honors Project. X. Liu, Fall 2019, Honors Project. G. O'Shea, Summer 2019, Honors Project. L. Colwell, Summer 2019, DSRI internship. K. Causton, Summer 2019, Honors Project (with Oliver). Y. Yamanaka, Winter 2019, Honors Project. S. Kudolo, Winter 2019, Honors Project. L. Gruska, Winter 2019, Honors Project. L. He, Winter 2019, Honors Project. Joining/Volunteering Applying for MSc or PhD: MSc and PhD applicants who are interested in my research are encouraged to contact me via email. Prerequisites: A good candidate should have background in probability and linear algebra, and have had courses in Machine Learning or related areas including Computer Vision and Natural Language Processing. Prospective MSc and PhD students who are applying to the School of Computer Science at Carleton University and are interested in my research are encouraged to indicate my name as their preferred research supervisor. Please note that due to the volume of emails I receive, I am not able to respond to all. Undergrad students at Carleton University who are interested in doing their Honours project/thesis with me, are encouraged to contact me via email. Teaching COMP 4102: Computer Vision - Winter 2025. DATA 5000: Introduction to Data Science - Winter 2025. COMP 5801: Advanced Machine Learning - Fall 2024. COMP 4102: Computer Vision - Winter 2024. DATA 5000: Introduction to Data Science - Winter 2024. COMP 5900: Advanced Machine Learning - Fall 2023. DATA 5000: Introduction to Data Science - Winter 2023. COMP 5900: Advanced Machine Learning - Fall 2022. DATA 5000: Introduction to Data Science - Winter 2022. COMP 5900: Advanced Machine Learning - Fall 2021. COMP 4105: Introduction to Machine Learning - Fall 2021. COMP 5900V: Advanced Machine Learning - Winter 2021. DATA 5000: Introduction to Data Science - Winter 2021. COMP 4900A: Introduction to Machine Learning - Fall 2020. COMP 4900B: Introduction to Machine Learning - Winter 2020. DATA 5000: Introduction to Data Science - Winter 2020. COMP 5900X: Advanced Machine Learning - Fall 2019. COMP 5900: Machine Learning for Healthcare - Winter 2019. Publications Selected Publications M. R. Zarei, A. Akkasi, M. Komeili (2025), “Dual Adapter Tuning of Vision–Language Models Using Large Language Models”, International Journal of Computational Intelligence Systems. pdf A. Choubineh, A. Akkasi, A. Khan, M. Komeili (2025), “Text-Guided Image-to-Image Translation for Tactile Map Generation”, International Joint Conference on Neural Networks. R. Kevadiya, A. Akkasi, K. C. Fraser, B. Vukovic, J. Gunnell, S. Tanguay, M. Komeili (2025), “Generalized Follow-Up WHODAS 2.0 Assessment Through Language Models and Adaptive Clustering Ensemble in Higher Education”, The PErvasive Technologies Related to Assistive Environments (PETRA). David G Hobson, Majid Komeili (2025), “A Step towards Automated and Generalizable Tactile Map Generation using Generative Adversarial Networks”, arXiv. pdf M. R. Zarei, M. Komeili (2024), “Interpretable Few-shot Learning with Online Attribute Selection”, Neurocomputing. pdf O. Davoodi, M. Komeili (2024), “Feature-based explainable reinforcement learning in environments with multiple sources of risk”, International Conference on Pattern Recognition and Artificial Intelligence A. Akkasi, A. Khan, M. Shaaban, M. Komeili, and M. Yaqub, (2024) “iML at Semeval-2024 task 2: Safe biomedical natural language inference for clinical trials with LLM based ensemble inferencing”, 18th ACL International Workshop on Semantic Evaluation. M. A. Choukali, M. Chehel-Amirani, M. Valizadeh, A. Abbasi and M. Komeili (2024), “Pseudo-Class Part Prototype Networks for Interpretable Breast Cancer Classification”, Nature Scientific Reports. pdf A. Akkasi, K. C. Fraser, and M. Komeili (2023), “Reference-free Summarization Evaluation with Large Language Models”, IJCNLP-AACL Workshop on Evaluation and Comparison for NLP systems. M. Shaaban, A. Akkasi, A. Khan, M. Komeili, M. Yaqub (2023), “Fine-Tuned Large Language Models for Symptom Recognition from Spanish Clinical Text”, BioCreative.pdf O. Davoodi, S. Mohammadizadehsamakosh, M. Komeili (2023), “On the Interpretability of Part-Prototype Based Classifiers: A Human Centric Analysis”, Nature Scientific Reports. pdf G. O'Shea, M. Komeili (2023), “SuperVision: Self-Supervised Super-Resolution for Appearance-Based Gaze Estimation”, NeurIPS 2023 Gaze Meets ML Workshop. pdf M. R. Zarei, M. Christensen, S. Everts, M. Komeili (2023), “Vax-Culture: A Dataset for Studying Vaccine Discourse on Twitter”, International Joint Conference on Neural Networks. Preprint M.R. Zarei, M. Komeili, (2022), “Interpretable Concept-based Prototypical Networks for Few-Shot Learning”, ICIP. pdf O. Davoudi, M. Komeili, (2022), “Toward Faithful Case-based Reasoning through Learning Prototypes in a Nearest Neighbor-friendly Space”, ICLR. pdf S. Ahmed, M. Komeili, J. Park, (2022), “Predictive Modelling of Parkinson’s Disease Progression Based on RNA-Sequence with Densely Connected Deep Recurrent Neural Networks”, Nature Scientific Reports. pdf M. Nokhbeh Zaeem, M. Komeili, (2022), “Cause and Effect: Hierarchical Concept-based Explanation of Neural Networks”, arXiv:2105.07033. preprint O. Davoudi, M. Komeili,",
  "content_length": 15347,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:09"
}