{
  "name": "Maksim Serbyn",
  "homepage": "https://serbyn.github.io/site",
  "status": "success",
  "content": "Quantum Dynamics & Condensed Matter at ISTASearchMaksym SerbynProfessor of PhysicsInstitute of Science and Technology Austria (ISTA)BiographyMaksym is a professor of Physics at ISTA. Before this appointment he was Gordon and Betty Moore postdoctoral fellow at UC Berkeley. Since 2017 Maksym leads the Quantum Dynamics & Condensed Matter research group at ISTA, which develops theory of nonequilibrium quantum systems and quantum thermalization, and also works on emergent phases in condensed matter systems.Interests Quantum thermalization Entanglement dynamics Dynamical phases of matter Nonequilibrium probes of solids Tensor networksEducationPhD in Physics, 2014Massachusetts Institute of Technology (MIT)MS in Physics, 2009Moscow Institute of Physics and Technology (MIPT)BS in Physics, 2007Moscow Institute of Physics and Technology (MIPT)Meet the TeamResearchersJean-Yves DesaulesInstitute of Science and Technology Austria (ISTA)PostdocErgodicity breaking, Quantum many-body scars, Synthetic quantum matterE. Nicolau JiménezInstitute of Science and Technology Austria (ISTA)PostdocQuantum many-body physics, Nonergodic systems, Hilbert space fragmentationLucia VigliottiInstitute of Science and Technology Austria (ISTA)PostdocCondensed matter physics, Quantum transport, Superconductivity, Mesoscopic physicsRecent Publications Marko Ljubotina, Elena Petrova, Norbert Schuch, Maksym Serbyn (2024). Tangent Space Generators of Matrix Product States and Exact Floquet Quantum Scars. PRX Quantum.Cite DOI URL Benoît Vermersch, Marko Ljubotina, J. Ignacio Cirac, Peter Zoller, Maksym Serbyn, Lorenzo Piroli (2024). Many-Body Entropies and Entanglement from Polynomially Many Local Measurements. Phys. Rev. X.Cite DOI URL Raimel A. Medina, Maksym Serbyn (2024). A Recursive Lower Bound on the Energy Improvement of the Quantum Approximate Optimization Algorithm.Cite arXiv URL Serafim S. Babkin, Andrew P. Higginbotham, Maksym Serbyn (2024). Proximity-induced gapless superconductivity in two-dimensional Rashba semiconductor in magnetic field. SciPost Phys..Cite DOI URL Dmitry Abanin, Maksym Serbyn (2024). Quantum scars make their mark in graphene. Nature.Cite DOISee all publications Recent PostsPaper on Dynamical Quantum Phase Transitions Published in PRLWe construct classification of dynamical quantum phase transitions using matrix product states.Apr 3, 2021 3 min readPaper on mixed phase space appears at PRXWe show evidence of mixed phase space in TDVP projection of unitary dynamics of interacting quantum systems.Mar 6, 2020 3 min readWeak ergodicity breaking from quantum many-body scarsWe construct theory of unusual revivals observed in Rydberg atom arraysJun 5, 2018 2 min read Cite × Copy Download",
  "content_length": 2719,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:11"
}