{
  "name": "Malak Abdullah",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=mabdullah",
  "status": "success",
  "content": "Malak Abdel Ghani Abdullah × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content malak abdel ghani abdullah • Department of Computer Science - Faculty Member • Vice dean - Vice Dean 22891 A1-L3 Department of Computer Science mabdullah@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from %University of North Carolina at Charlotte%, 2018 Msc. of Computer Science from Jordan University of Science and Technology, 2007 Bsc. of Computer Science from Jordan University of Science and Technology, 2004 Publications Abdullah, Malak and Abuelrub, Emad and Mahafzah, Basel, \"The chained-cubic tree interconnection network.,\" Int. Arab J. Inf. Technol., vol. 8, no. , pp. 334-343, 2011, Citeseer ElTayeby, Omar and Eaglin, Todd and Abdullah, Malak and Burlinson, David and Dou, Wenwen and Yao, Lixia, \"A feasibility study on identifying drinking-related contents in Facebook through mining heterogeneous data,\" Health informatics journal, vol. 25, no. , pp. 1756-1767, 2019, SAGE Publications Sage UK: London, England Shatnawi, Farah and Abdullah, Malak and Hammad, Mahmoud and Al-Ayyoub, Mahmoud, \"Comprehensive study of pre-trained language models: detecting humor in news headlines,\" Soft Computing, vol. , no. , pp. 1-25, 2022, Springer Ali, Hikmat H and Abdullah, Malak and Wedyan, Musab, \"Application of machine learning techniques to predict patient?s satisfaction of indoor environmental quality in Jordanian hospitals,\" Journal of Ambient Intelligence and Humanized Computing, vol. , no. , pp. 1-9, 2022, Springer Abdullah, Malak and Al-Ayyoub, Mahmoud and AlRawashdeh, Saif and Shatnawi, Farah, \"E-learningDJUST: E-learning dataset from Jordan university of science and technology toward investigating the impact of COVID-19 pandemic on education,\" Neural Computing and Applications, vol. , no. , pp. 1-15, 2021, Springer Abedalla, Ayat and Abdullah, Malak and Al-Ayyoub, Mahmoud and Benkhelifa, Elhadj, \"Chest X-ray pneumothorax segmentation using U-Net with EfficientNet and ResNet architectures,\" PeerJ Computer Science, vol. 7, no. , pp. 0-0, 2021, PeerJ Inc. Abdullah, Malak and Shaikh, Samira, \"Teamuncc at semeval-2018 task 1: Emotion detection in english and arabic tweets using deep learning,\" , 2018, pp. 350-357 Abdullah, Malak and Hadzikadic, Mirsad, \"Sentiment analysis on arabic tweets: Challenges to dissecting the language,\" , 2017, pp. 191-202, Springer Abdullah, Malak and Hadzikadicy, Mirsad and Shaikhz, Samira, \"SEDAT: sentiment and emotion detection in Arabic text using CNN-LSTM deep learning,\" , 2018, pp. 835-840, IEEE Abdullah, Malak and Hadzikadic, Mirsad, \"Sentiment analysis of twitter data: Emotions revealed regarding donald trump during the 2015-16 primary debates,\" , 2017, pp. 760-764, IEEE Mohammed, Roweida and Rawashdeh, Jumanah and Abdullah, Malak, \"Machine learning with oversampling and undersampling techniques: overview study and experimental results,\" , 2020, pp. 243-248, IEEE Abdullah, Malak and Alnore, Dalya and Swedat, Safa and Khrais, Jumana and Al-Ayyoub, Mahmoud, \"SarcasmDet at SemEval-2022 Task 6: Detecting Sarcasm using Pre-trained Transformers in English and Arabic Languages,\" , 2022, pp. 1025-1030 Habash, Mohammad and Daqour, Yahya and Abdullah, Malak and Al-Ayyoub, Mahmoud, \"YMAI at SemEval-2022 Task 5: Detecting Misogyny in Memes using VisualBERT and MMBT MultiModal Pre-trained Models,\" , 2022, pp. 780-784 Makahleh, Mohammad and Yaseen, Naba Bani and Abdullah, Malak, \"JUST-DEEP at SemEval-2022 Task 4: Using Deep Learning Techniques to Reveal Patronizing and Condescending Language,\" , 2022, pp. 308-312 Alshare, Somaya and Abdullah, Malak and Quwaider, Muhannad, \"Increasing Accuracy of Random Forest Algorithm by Decreasing Variance,\" , 2022, pp. 232-238, IEEE Abdullah, Malak and Altiti, Ola and Obiedat, Rasha, \"Detecting Propaganda Techniques in English News Articles using Pre-trained Transformers,\" , 2022, pp. 301-308, IEEE Wedyan, Musab and Ali, Hikemt and Abdullah, Malak, \"Toward Predicting Patient?s Satisfaction of Indoor Environmental Quality in Jordanian Hospitals using SVM and K-NN Machine Learning Algorithms,\" , 2022, pp. 239-245, IEEE Abdullah, Malak and Khrais, Jumana and Swedat, Safa, \"Transformer-Based Deep Learning for Sarcasm Detection with Imbalanced Dataset: Resampling Techniques with Downsampling and Augmentation,\" , 2022, pp. 294-300, IEEE Yaseen, Tuqa Bani and Ismail, Qusai and Al-Omari, Sarah and Al-Sobh, Eslam and Abdullah, Malak, \"JUST-BLUE at SemEval-2021 Task 1: Predicting Lexical Complexity using BERT and RoBERTa Pre-trained Language Models,\" , 2021, pp. 661-666 Faraj, Dalya and Abdullah, Malak, \"SarcasmDet at SemEval-2021 Task 7: detect humor and offensive based on demographic factors using RoBERTa pre-trained model,\" , 2021, pp. 527-533 Abdullah, Malak Abdel-Ghani, Deep Learning for Sentiment and Emotion Detection in Multilingual Contexts, , 2018 \" Multi-label multi-class COVID-19 Arabic Twitter dataset with fine-grained misinformation and situational information annotations\", PeerJ Computer Science Rasha Mohammad Muhsen Obeidat, Maram Mohammed Tayel Gharaibeh, Malak Abdel Ghani Mustafa Abdullah, Yara Emad Abed Al Ghafoor Al Harahsheh 05/12/2022 \"Kidney Tumor Detection and Classification Based on Deep Learning Approaches: A New Dataset in CT Scans\", Journal of Healthcare Engineering Dalia Khaled Abedalaziz Alzu'Bi, Malak Abdel Ghani Mustafa Abdullah, Ismail Ibrahim Mefleh Hmeidi, Rami Shaker Abdel Razzaq Alazab, Maha Mohamed Faleh Gharaibeh, Mwaffaq Ali Husein El-Heis 22/10/2022 \"Comprehensive study of pre-trained language models: detecting humor in news headlines\", Soft Computing Farah Fuad Suleiman Shatnawi, Malak Abdel Ghani Mustafa Abdullah, Mahmoud Mohammed Khair Faiq Hammad, Mahmoud Abdel-Karim Mahmoud Alshbool 17/10/2022 \"Application of machine learning techniques to predict patients satisfaction of indoor environmental quality in Jordanian hospitals\", Journal of Ambient Intelligence and Humanized Computing Hikmat Hammad Mitluk Ali, Malak Abdel Ghani Mustafa Abdullah, Musab Hashem Saleh Wedyan 30/05/2022 \"E-LearningDJUST: E-Learning dataset from Jordan University of Science and Technology toward investigating the impact of COVID19 Pandemic on Education\", Neural Computing and Applications Malak Abdel Ghani Mustafa Abdullah, Mahmoud Abdel-Karim Mahmoud Alshbool, Saif Ahmad Mohammad Rawashdeh, Farah Fuad Suleiman Shatnawi 27/10/2021 \"Chest X-ray pneumothorax segmentation using U-Net with EfficientNet and ResNet architectures\", PeerJ Computer Science Ayat Abedalla Issa Abedalla, Malak Abdel Ghani Mustafa Abdullah, Mahmoud Abdel-Karim Mahmoud Alshbool 31/05/2021 \"Authorship analysis of English and Spanish tweets\", Proceedings of the Association for Information Science and Technology Mohammed Nour Monther Ahmad Al-Rashdan, Malak Abdel Ghani Mustafa Abdullah, Mahmoud Abdel-Karim Mahmoud Alshbool, Yaser Ibrahim Issa Jararweh 02/06/2020 Vice Dean, Vice dean, Sep 2025 - Present Vice Dean, Vice dean, Sep 2024 - Sep 2025 Acting Head of Department, Department of Computer Science, Sep 2023 - Sep 2024 Acting Head of Department, Department of Computer Science, Sep 2022 - Sep 2023 Deputy Head of the Center, Vice director, Sep 2019 - Sep 2020 Faculty Member, Department of Computer Science, Nov 2018 - Present Faculty member, Department of Computer Science/ Jordan Univ of Sci and Tech, Jordan, Aug 2007- Jan 2015 ADVANCED DATABASE SYSTEMS ARTIFICIAL INTELLIGENCE ARTIFICIAL INTELLIGENCE PROGRAMMING DATA ANALYTICS DATA SCIENCE DATA STRUCTURES & ALGORITHMS LAB DATA STRUCTURES AND ALGORITHMS EXPERT SYSTEMS INFORMATION RETRIEVAL SYSTEMS INTRODUCTION TO PROGRAMMING INTRODUCTION TO INFORMATION TECHNOLOGY INTRODUCTION TO OBJECT- ORIENTED PROGRAMMING INTRODUCTION TO PROGRAMMING INTRODUCTION TO PROGRAMMING (PRACTICAL) INTRODUCTION TO WEB DESIGN JAVA PROGRAMMING JAVA PROGRAMMING (LAB) MACHINE LEARNING OBJECT-ORIENTED PROGRAMMING LAB PRACTICAL TRAINING PROGRAMMING FOR ENGINEERS (LAB) PROGRAMMING IN C++ PROGRAMMING LAB SELECTED PROGRAMMING LANGUAGES (FOR NON COMPUTER SCIENCE INFORMATION STUDENTS) SPECIAL TOPICS 1 SPECIAL TOPICS IN COMPUTER APPLICATIONS Academics Academic Calendar Course Schedule Graduate Studies Resources IT Helpdesk Services Library Maharat Open Online Courses News Center Information Classification Policy Information Request Form Information & Feedback Alumni EU Projects Job Opportunities Complaints & Suggestions Newsletter Enter your email address to get the latest University news, special events and student activities delivered right to your inbox. Subscribe to JUST Newsletter ©2022, Information Technology and Communication Center. Jordan University of Science and Technology. All Rights Reserved. Contact JUST Jordan University of Science and Technology P.O.Box 3030, Irbid 22110, Jordan Tel: +962 2 7201000 Fax: +962 2 7095123 Email: public@just.edu.jo Close QS Ranking 2026 Close",
  "content_length": 8978,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:15"
}