{
  "name": "Malaya Dutta Borah",
  "homepage": "http://cs.nits.ac.in/malaya",
  "status": "success",
  "content": "Faculty Details Dr. Malaya Dutta Borah Information Designation : Assistant Professor, Grade-I Email : malayaduttaborah@cse.nits.ac.in Phone : Key Notes Conference: International - 47 , National - 4 Journals: 30 Conferences: 54 Book Chapters: 8 Books: 7 Patents: 5 PhD: Guided: 13 Post Graduates: Guided: 15 Under Graduates: Guided: 19 Cited byView allAllSince 2020Citations21041759h-index2222i10-index3330054027013540520132014201520162017201820192020202120222023202420252235336274564368150260358539369 99 PUBLICATIONS 13 DOCTORAL STUDENTS 5 PATENTS 3 PROJECTS Introduction [Biosketch] Dr. Malaya Dutta Borah received her B. Tech degree in Computer Science and Engineering from the North Eastern Regional Institute of Science and Technology (NERIST), Govt. of India in 2002, Master of Engineering with distinction from Delhi College of Engineering (DCE) in 2011, and Ph.D. from Delhi Technological University (DTU) in 2017. Dr. Malaya Dutta Borah is currently working as an Assistant Professor Grade-I in the Department of Computer Science and Engineering, National Institute of Technology Silchar, Assam, India. Her research areas include Block Chain Technology, Data Mining, Cloud Computing and e-Governance. She is the author of 98 papers including in reputed journals, Book Chapters, various National and International Conferences. 03 PhD Scholars have completed their research work under her. She is the Editor in 4 multi-authored edited books published by IGI Global, Springer and CRC Press. She has 4 granted patents. She was the Organizing chair of International Conferences (IEEE SILCON 2023, BigDML 2021, BigDML 2019 etc.). She is one of the founder members of IEEE Silchar Subsection. She has completed one Project from Council of National Institutes of Technology, Science Education and Research (NITSER), Ministry of Education, Government of India. She has received Prof. Priti Shankar Stree Shakti Samman 2022 for being feminine faculty of ICT (#girlsinICT day), awarded by ReTHINK INDIA INSTITUTE,www.rethinkindia.org on April 28, 2022. Apart from the academic duty, she is actively involved with Students related activity and Institute level administrative duty. She was Associate Dean (Students Welfare) from 30/11/2022 to 12/12/2024. She is a member of Professional bodies like IEEE and CSI. Areas of Interest Data Mining Machine Learning Cloud Computing Blockchain Technology e-Governance System EDUCATION QUALIFICATION Institution Year Degree North Eastern Regional Institute of Science and Technology, Arunachal Pradesh (Under the Ministry of Human Resource Development, Govt. of India) 2002 B. Tech. (Computer Science and Engineering) Delhi College of Engineering, Delhi ( Under the University of Delhi) 2011 M. E. (Computer Science and Engineering) Delhi Technological University (Formerly Delhi College of Engineering), Delhi 2017 Ph.D. (Computer Science and Engineering) EXPERIENCE Teaching Experience Assistant Professor (Grade - I, Level-12) 6 July 2022 - Present NIT Silchar Assistant Professor (Grade - II, Level-11) 21 November 2019 - 6 July 2022 NIT Silchar Assistant Professor (Grade - II, Level-10) 12 June 2018 - 21 November 2019 NIT Silchar Assistant Professor 15 November 2016 - 6 June 2018 Inderprastha Engineering College affiliated to Dr. A. P. J. Abdul Kalam Technical University Lecturer (On Contract)/Assistant Professor (Contractual) 30 July 2007 - 26 June 2012 Delhi Technological University ( formerly Delhi College of Engineering) Guest Lecturer 1 February 2005 - 31 July 2006 Assam Engineering College Community Information Centre (CIC) Operator 18 July 2002 - 1 February 2005 CIC Dhakuakhana, Under NIC Lakhimpur, Ministry of Communications, Govt. of India PUBLICATIONS 99 Journal International Conferences National Conferences Book Chapters Edited Book Conference proceedings All 2025 2024 2023 2022 2021 2020 2019 2018 2016 2015 2013 Pranita Baro and Malaya Dutta Borah, “GAN-based approach for Data Imputation and handling Class Imbalance using One Class Ensemble”, Applied Soft Computing, Elsevier, Volume 182, July, 2025, https://doi.org/10.1016/j.asoc.2025.113540, Indexed in SCIE, Impact Factor: 6.6 Zakir Hussain, Malaya Dutta Borah, “A Neural Network Integrated Mathematical Model to Analyse the Impact of Nutritional Status on Cognitive Development of Child. Computers in Biology and Medicine”, Elsevier, Volume 185, 109490, 2025, https://doi.org/10.1016/j.compbiomed.2024.109490, Indexed in SCIE, Impact Factor: 7.0 Yash Jakhar and Malaya Dutta Borah, “Effective Near-Duplicate Image Detection using Perceptual Hashing and Deep Learning”, Information Processing and Management, Elsevier, Volume 62, Issue 4, 2025, https://doi.org/10.1016/j.ipm.2025.104086, Indexed in SCIE, Impact Factor: 7.4 All 2025 2024 2023 2022 2021 2020 2019 2016 2015 2014 2013 2012 2011 2009 Kadambari Raghuram and Malaya Dutta Borah, “Deep Classification: Ensemble Learning Models for Multi-Plant Disease Detection”, In Proceedings 2025 International Conference on Multi-Agent Systems for Collaborative Intelligence (ICMSCI), 20-22 Jan. 2025, January 20th 2025, 2025, Erode, India, IEEE, https://ieeexplore.ieee.org/document/10894111 Sekar K, Meena R, Monisha S, Dheepa T, Niraimathi A K, Malaya Dutta Borah, “Early Detection Of Alzheimer’s Disease using Transfer Learning on MRI Data”, In Proceedings 2025 3rd International Conference on Integrated Circuits and Communication Systems (ICICACS),21-22 February, 2025, February 21st 2025 - February 22nd 2025, 2025, H.K.E. Society's Sir M Visvesvaraya College of Engineering, Raichur, IEEE, https://ieeexplore.ieee.org/document/10968359 All 2009 2008 Ganesh Ch. Deka, Malaya Dutta Borah, “Application of “Wireless Regional Area Network in creating community Network”, In Proceedings 3rd National Conference on Computing for nation Development INDIACom-2009, ISSN 0973-7529 ,pp 227, Feb. 26- 28,, February 26th 2009, Bharati Vidyapeeth’s Institute of Computer Applications and management, Rohtak Road, New Delhi-63, 2009 All 2024 2022 2021 2020 2019 Deepali Jain, Malaya Dutta Borah and Anupam Biswas, “Domain Knowledge Enriched Summarization of Legal Judgement Documents via Grey Wolf Optimization”, Applications of Nature-inspired Computing and Optimization Techniques, part of Advances in Computers, ISSN 0065-2458, 2024, Elsevier book series, https://doi.org/10.1016/bs.adcom.2023.11.005, Indexed in SCI Hussain, Z., Borah, M.D., “Genetic Algorithm in the Optimization of Infectiological Parameter Values under Different Nutritional Status”, Applications of Nature-inspired Computing and Optimization Techniques, part of Advances in Computers, ISSN 0065-2458, 2024, Elsevier book series, https://doi.org/10.1016/bs.adcom.2023.12.001, Indexed in SCI All 2023 2022 2021 Dr. Malaya Dutta Borah, Dr.Steven A. Wright, Dr.Pushpa Singh, Dr.Ganesh Chandra Deka, “Role of 6G Wireless Networks in AI and Blockchain-Based Applications”, March, 2023, IGI Global All 2023 2022 2020 Malaya Dutta Borah, Dolendro Singh Laiphrakpam, Nitin Auluck, Valentina Emilia Balas, “Big Data, Machine Learning, and Applications”, November, 2023, Lecture Notes in Electrical Engineering, Springer, https://doi.org/10.1007/978-981-99-3481-2 COURSES TAUGHT / TEACHING Sl.No Course Name Semester Course Code Duration Status 1 Introduction to Blockchain B.Tech CS 382 Jan-June 2025 Completed 2 Object Oriented Design Laboratory B.Tech CS 315 Jan-June 2025 Completed 3 Introduction to Blockchain Technology M.Tech CS 5254 Jan-June 2025 Completed 4 Software Engineering B.Tech CS 304 July-Dec 2025 Ongoing 5 Software Engineering lab B.Tech CS 314 July-Dec 2025 Ongoing STUDENT GUIDANCE 47 Undergraduate Post Graduate Ph.D. Prediction of Steering Angle for Self-driving cars using Deep learning Sohail Kazi(2212080), Jisan Gain(2212048), Sumit Singh (2212069), Purvashi Kupuli (2212067),Pranto Mollik (2212049) Ongoing Supervisor : Dr. Malaya Dutta Borah Academic Year : 2025-2026 Credit card frsud detection using Machine learning Padarthi Rahul(2212087), Nadipalli Sai Umesh(2212060), Paturu Sujan Kumar( 2212153),Hrishikesh (2112021), Masabattula Lakshmi Sri Vatsav (2212074) Ongoing Supervisor : Dr. Malaya Dutta Borah Academic Year : 2025-2026 Prediction Of Diabetes Using Machine Learning Chimron Saikia (2112002) Partho Pratim Choudhury (2112003) Upamdeep Buragohain (2112006) Dalimi Sonowal (2112028) Completed : 6 June 2025 Supervisor : Dr. Malaya Dutta Borah Academic Year : 2024-2025 Soil Type Classification Using Deep Learning Sandeep Kherkatary (2112040) Hirakjyoti Choudhury (2112042) Deepjyoti Sharma (2112073) Hrishyak Kalita (2112082) Completed : 6 June 2025 Supervisor : Dr. Malaya Dutta Borah Academic Year : 2024-2025 Hostel Management System of NIT Silchar enhancing security using Blockchain Technology Amrit Raj (17-1-5-049), Tarun Kumar (17-1-5-024), Ojasvee Chaurasia(17-1-5-036), Arpit Singh(17-1-5-060) Completed : Supervisor : Dr. Malaya Dutta Borah Academic Year : 2020-2021 Content Based Recommender System For Similar Products In E-Commerce Sandeep Kumar, 16-1-5-021; Abhijnyan Chandro, 16-1-5-014; Arif Ahmed, 16-1-5-024; Prateek Chand, 16-1-5-038 Completed : Supervisor : Dr. Malaya Dutta Borah Academic Year : 2019-2020 FARMAR: Supply Chain Management in Agriculture Using Blockchain Technology Vadithya Bharath Naik, 15-1-5-087; Barneel Phukan, 15-1-5-029; Aditya Bhargav,15-1-5-034; Basani Shiva Gnaneshwara Murthy, 15-1-5-079 Completed : Supervisor : Dr. Malaya Dutta Borah Academic Year : 2018-2019 Educational Data Mining To Measure Success Rate Of Students Shalu Choudhary, 1403010191; Shrangreela Sachan , 1403010203; Pragati Agarwal, 1403010148, Dept. of Computer Science and Engineering, Inderprastha Engineering College, U.P Completed : Supervisor : Dr. Malaya Dutta Borah Academic Year : 2017-2018 Placement Management System: Performance Measures in Higher Education Using Cloud Platform Ashish Kumar, 1403010049; Shivam Verma, 1403010197; Shubham Bansal, 1403010206; Varun Sharma, 1403010236, Dept. of ",
  "content_length": 42125,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:14"
}