{
  "name": "Malay Bhattacharyya 0001",
  "homepage": "https://www.isical.ac.in/~malaybhattacharyya",
  "status": "success",
  "content": "Homepage of Malay Bhattacharyya Resume Malay Bhattacharyya Still learning ... 01 About Malay Bhattacharyya is currently an Associate Professor of Machine Intelligence Unit, the Coordinator of Centre for Artificial Intelligence and Machine Learning, and an Associate Member of Technology Innovation Hub on Data Science, Big Data Analytics, and Data Curation at Indian Statistical Institute, Kolkata. He is a certified Design Thinker from MIT Sloan School of Management and holds a doctorate in Computer Science from Indian Statistical Institute. He has a couple of decades of teaching and research experience including short academic visits at Stanford University, University of Ljubljana, and Indian Institute of Science, Bangalore. He served in the Assessment & Search Committee, ACM Publications Board and The Lancet COVID-19 Commission: India Task Force during 2023-24 and 2021-22, respectively. His current research interests encompass Computation for Social Good and Computational Healthcare. He has published research studies in high-impact journals like Cell, Nature Medicine, The Lancet Microbe, The Lancet Regional Health - Southeast Asia, and top-notch conferences like AAAI, IEEE ICDE, ACM CHI, ACM CSCW. His research has received generous funding from DRDO, Google, DST and MeitY, Government of India, totaling about INR 4 Crores (~ USD 0.5 Million). He is a recipient of the Impact Scholars Award from Google (2021), Young Engineer Award from INAE (2018), Young Engineers Award from IEI (2016-17), BIRD Award from Bioclues Organization (2015), Young Scientist Award from ISCA (2013-14), and won several best paper and best reviewer awards. He became a Fellow of climaTRACES Lab, University of Cambridge in 2024, an INAE Young Associate in 2018, and a Sir Visvesvaraya Young Faculty Research Fellow in 2015-16. He advises NGOs like MDCRC, mentors Startups like Assessli, and reinforces Talent Development to companies like Tata Steel. 02 Career January 2023 - To date Associate Professor Machine Intelligence Unit ISI, Kolkata Courses: Computational Molecular Biology and Bioinformatics - Fall 2024, Fall 2025; Introduction to Computing - Fall 2024, Fall 2025; Introduction to Programming and Data Structures - Fall 2023; Computing Lab - Fall 2023; Management of Data - Spring 2023, Fall 2023, Spring 2024, Fall 2024, Spring 2025; Operating Systems - Spring 2023; Database Management Systems - Spring 2023, Spring 2024, Spring 2025 Computing Systems II - Spring 2025. September 2024 - To date Coordinator Centre for Artificial Intelligence and Machine Learning ISI, Kolkata Courses: Data Analytics in Python - December 2024. September 2021 - To date Associate Member Technology Innovation Hub on Data Science, Big Data Analytics, and Data Curation ISI, Kolkata Courses: Design Thinking - Fall 2024. July 2019 - September 2024 Associate Member Centre for Artificial Intelligence and Machine Learning ISI, Kolkata Courses: Data Analytics in Python - May 2024, July 2024; Business Analytics - 2022; Machine Learning for Practitioners - Fall 2019. July 2018 - December 2022 Assistant Professor Machine Intelligence Unit ISI, Kolkata Courses: Operating Systems - Spring 2022; Database Management Systems - Spring 2019, Spring 2020, Spring 2021, Spring 2022; Fundamentals of Database Systems - Fall 2019, Fall 2020, Fall 2022; Computational Molecular Biology and Bioinformatics - Fall 2021; Introduction to Programming - Fall 2020; Computing Lab - Fall 2020, Fall 2021; Data and File Structures Lab - Fall 2018, Fall 2019. May 2014 - July 2018 Assistant Professor Department of Information Technology IIEST, Shibpur Courses: Modelling and Simulation Lab - Spring 2017, Spring 2018; Bioinformatics - Spring 2015, Spring 2016, Spring 2017; Software Engineering - Spring 2015, Spring 2016, Fall 2017; Information and Coding Theory - Fall 2014, Fall 2015, Fall 2016, Fall 2017; Information and Systems Security - Fall 2014, Fall 2015, Fall 2016, Spring 2018. February 2014 - March 2014 Visiting Researcher Indo-French Centre for Applied Mathematics IISc, Bangalore 03 Education March 2018 - June 2018 Executive Education Mastering Design Thinking MIT Sloan School of Management Project Title: KeepSaker - Keeping alive and sharing the best memories of your life. August 2007 - April 2014 Doctor of Philosophy Computer Science ISI, Kolkata Dissertation Title: Mining Co-expression Networks: Applications to MicroRNA Regulation and Disease Analysis. July 2005 - June 2007 Master of Engineering Electronics & Telecommunication Engineering Jadavpur University Dissertation Title: Solving Single Courier Problem Using Genetic Algorithms August 2001 - July 2005 Bachelor of Technology Computer Science & Engineering Government College of Engineering and Textile Technology, Berhampore Dissertation Title: Implementing Fragmentation in Distributed Database. 04 Awards & Honors April 2024 - To date Fellow climaTRACES Lab University of Cambridge April 2023 - November 2024 Member Assessment & Search Committee ACM Publications Board January 2021 - October 2022 Member India Task Force The Lancet COVID-19 Commission 2021 Impact Scholars Award AI for Social Good Google 2018 Young Engineer Award Computer Science Indian National Academy of Engineering 2015 - 2016 Sir Visvesvaraya Young Faculty Research Fellow Electronics & IT Ministry of Electronics & Information Technology 05 Projects December 2021 - June 2025 Co-Principal Investigator Advanced Machine Learning Techniques for Cryptanalysis Defence Research and Development Organisation (DRDO) Project Cost: INR 192.137 Lakhs (~ USD 234.09K). June 2023 - May 2025 Co-Principal Investigator Prediction of Walking Imbalance and Performance Improvement of Designed Prosthetic Lower Limb Institute of Data Engineering, Analytics and Science Foundation (IDEAS) Project Cost: INR 30.56 Lakhs (~ USD 37.23K). February 2022 - February 2023 Principal Investigator AI-guided systematic intervention and prediction of progression in Duchenne Muscular Dystrophy Google Project Cost: USD 10K (~ INR 7.275 Lakhs). July 2020 - July 2021 Principal Investigator Network Based Prediction of COVID-19 Spread in India under Migration Science and Engineering Research Board (SERB), Department of Science and Technology, Government of India Project Cost: INR 5.5 Lakhs (~ USD 6.7K). May 2016 - April 2021 Principal Investigator Crowdsourcing, Big Data Analysis and Bioinformatics Ministry of Electronics and Information Technology (MeitY), Government of India Project Cost: INR 37 Lakhs (~ USD 45.08K). 06 Publications A Global Metagenomic Map of Urban Microbiomes and Antimicrobial Resistance Cell, 184(13):3376-3393, 2021 Cartography of opportunistic pathogens and antibiotic resistance genes in a tertiary hospital environment Nature Medicine, 26(6):941-951, 2020 COVID-19 drug practices threaten antimicrobial resistance evolution and transmission in hospitals The Lancet Microbe, 2(4):e135-e136, 2021 Prevalence of long COVID symptoms in Haryana, India: a cross-sectional follow-up study The Lancet Regional Health - Southeast Asia, 25:100395, 2024 The importance of investing in data, models, experiments, team science, and public trust to help policymakers prepare for the next pandemic PLOS Global Public Health, 3(11):e0002601, 2023 A Review of Judgment Analysis Algorithms for Crowdsourced Opinions IEEE Transactions on Knowledge and Data Engineering, 32(7):1234-1248, 2020 Judgment Analysis in a Streaming Setting Incurring Logarithmic Space of the Annotators ICPR, pp. 1-15, 2024 Leveraging Synergy to Design Neural Differential Distinguishers for Lightweight Block Ciphers IEEE Transactions on Emerging Topics in Computational Intelligence, 9(2):2001-2013, 2025 Robust and Explainable Stage Prediction in Duchenne Muscular Dystrophy AAAI Fall Symposium, pp. 1-4, 2024 07 Team Paramita Koley, NPDF Uma Maheswara Reddy, Institute JRF Rinka Ghosh, PLP ME (IISc Bangalore), PhD (IIT Kharagpur) MS (Peking University), MTech (ISI Kolkata) MSc (The LNM Institute of Information Technology) 08 Contact Voice (+91) (33) 2575 2213 Fax (+91) (33) 2578 3357 E-mail malaybhattacharyya [at] isical [dot] ac [dot] in Network Send Your message was sent successfully! I will be in touch as soon as I can. Something went wrong, try refreshing and submitting the form again. Browse more publications @Scopus @Google Scholar @DBLP @PubMed @ORCiD @ResearchGate @Nature Precedings @arXiv @bioRxiv @ACM DL @IEEE Xplore",
  "content_length": 8435,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:11"
}