{
  "name": "Malcolm A. MacIver",
  "homepage": "https://robotics.northwestern.edu/people/profiles/faculty/maciver-malcolm.html",
  "status": "success",
  "content": "Malcolm MacIver: Center for Robotics and Biosystems - Northwestern University Skip to main content HomePeopleprofilesTitleProfile Malcolm A. MacIverProfessor of Mechanical EngineeringProfessor of Neurobiology (Courtesy)Professor of Computer Science (Courtesy)Professor of Biomedical Engineering(847) 491-3540Email MalcolmResearch TopicsAlgorithmic and neural basis of naturalistic decision making Active Electrosense Bio-inspired active electrosense and underwater robotics Neuromechanics of prey capture ResearchEducationTeachingOther interestsMediaRecent PublicationsAbout Malcolm MacIver Malcolm MacIver dropped out of school at age 9, never expecting to return. He grew up off the grid in far northern Canada, where he was free to roam wherever his curiosity took him, coming close to freezing to death only once in the process. As a teenager he earned pocket money by planting 2,000 trees a day and working in log home construction. His parents wanted him to become an artist, so he disappointed them by getting more excited by philosophy and math. Using his extensive tree planting credentials, he managed to obtain entry into a community college, and then the University of Toronto where he pursued philosophy and computer science. After meandering through cognitive science, artificial intelligence, neuroscience, and robotics over the course of one masters, two doctorate programs, and a postdoctoral fellowship, he found his passion in trying to understand animal behavior from ethological, evolutionary, neuronal, robotic, and computational angles, continuing to roam where his curiosity takes him. The wishes of his parents have returned to haunt him in the form of a desire to make interactive art installations, which have exhibited in Holland, China, and the US. Curriculum vitae Google Scholar Citations Brief academic biography for talk introductions Online media for a general audience \"A robot-rodent interaction arena with adjustable spatial complexity for ethologically relevant behavioral studies.\" Cell Reports article introducing an innovative concept for conducting animal behavior research. It describes a unique setup where rodents interact with a robotic agent within an environment whose spatial complexity can be adjusted. This setup is designed to closely mimic natural conditions, making the behavioral studies conducted in this arena highly relevant from an ethological perspective. \"Gambling, literally, on climate change.\" National Public Radio's Planet Money segment covering the results of our study on how participation in climate prediction markets can affect belief about climate change. Using Prediction Markets to Raise Climate Concern/Participation in climate markets bolsters backing for anti-warming measures. Video press release from collaborators at Columbia University Business School here. New theory predicts movement of different animals using sensing to search Ars Technica coverage on why the ability to plan evolved Podcast Interview on Sean Caroll's Mindscape, on Sensing, Consciousness, and the Imagination Research highlight in Nature on work in Current Biology on hindbrain circuits mediating escape responses to looming stimuli Coverage of research on why our fish ancestors headed for terra firma 350 million years ago: in The Atlantic by Ed Yong, in Quanta by Jennifer Ouellette. How Brain Scientists Forgot That Brains Have Owners - Ed Yong at The Atlantic covers our paper \"Neuroscience Needs Behavior\" with Krakauer et al. Video on discovery of a new form of convergent evolution (2 min) (New York Times Science Take). Written synopsis here; Publication here. Talk for AAAS on Electric Fish Robotics (25 min). Shorter (3 min) overview of one of the robots. Review publication PDF. Serious Game For the Nature Communications 2020 study, we developed a browser-based interactive “serious game”  to demonstrate how different habitats make different demands on the nervous system, from ones that make high demands on rapid innate reflexes to ones that require deliberation to succeed. MacIver lab member German Espinosa wrote the code and lab member Alexander Lai did the artwork. Videos April 12 2023 The Block Art Museum. This dialogue between the scientist Malcolm MacIver and artist Dario Robleto explores how art and science both contemplate—and seek to overcome—the physical and temporal limits of human life. The discussion touches on the question of how art might provide a model for long-term thinking, especially in times of societal and ecological transformation. Presented in conjunction with the exhibition The Heart’s Knowledge: Science and Empathy in the Art of Dario Robleto. Link to short article on event here; video below. February 2 2023 Penn State Extraterrestrial Intelligence Center Seminar on the importance of terrestriality in the emergence of cognition on Earth as a possible guide to what kinds of exoplanets to focus on for intelligent life. September 27 2022 Keynote at the Conference on Cognitive Computational Neuroscience, discussing the drivers of learning across timescales: evolutionary, developmental, & computational perspectives. September 28 2022 Generative Adversarial Collaboration at the Conference on Cognitive Computational Neuroscience, discussing the place of planning in biology and AI. Presenters:  German Espinosa, Jessica Hamrick,  Jane Wang, Mark Ho,  Malcolm MacIver, David Redish, with Nathaniel Daw contributing. Animation: Our short-sighted inner fish (3:46). Our discovery on how vision dramatically changed over 300 million years ago, and implications for the shape of consciousness and where it is going. April 16 2021 Talk at the Allen Institute for Artificial Intelligence, discussing the ecological and sensory bases of plan-based action control, and new work on decision making over long time/space horizons applied to climate change. Talk on information harvesting and the emergence of planning in animals (47:30). eLife 2020 study  & Nature Communications 2020. How the geometry of life on land may have selected for planning (1:43). Nature Communications, 2020 study. \"Can We Expand Our Consciousness with Neuroprosthetics?\" 16 minute talk at the 2013 Caltech TEDx on The Brain, Pasadena, California USA Scale is an interspecies art project: an audience-interactive work that involves nocturnal electric fish from the Amazon, from localStyle. 2001 Ph.D. Neuroscience, University of Illinois and the Beckman Institute of AdvancedScience and Technology, Urbana IL 1994 (through to 1996) Course work only of dual Ph.D. in Cognitive Science andPhilosophy, Indiana University, Bloomington IN 1992 M.A. Philosophy, University of Toronto 1991 B.Sc. Double major, Philosophy and Computer Science, University of TorontoNeural engineering laboratory class: Neuromechatronics. Connecting machines to simple nervous systems. Class code: BME 464. Course Description: A core competency for neural engineering is the construction of closed loop systems that combine a biological/neural component with control of a mechatronic system. This laboratory course will do this with several simple biological systems in interaction with simple mechanical systems. Students will engage in preparation of a biological specimen for recording, data acquisition, design of simple mechatronic systems that will interact with the specimen, and the coupling of the acquired data to the mechatronic system. Early in the course, signals will be acquired with either minimal or no dissection, while later in the course dissections will be performed to obtain neural signals from animals to drive a mechatronic device. Some of the topics to be covered: Basic biological & neural signal acquisition and processing, relevant neurobiology, and mechatronics, including the use of xPC (a real time control system that interfaces with MATLAB), EMG electrodes and force transducers for doing closed-loop activation of muscle. Neural engineering lecture course: Computational Neuromechanics & Neuroethology. Class code: BME 461. Course Description: The mechanical interaction of the body with its environment is a key player in nervous system function. In this course, we will take a systems-level view of animals and explore relationships between behavior, biomechanics, and the nervous system through examples from the literature and through MATLAB projects with a classic vertebrate model system from neuroethology. Topics Include: Basic principles of evolution and development, and how this has affected sensory and motor system interactions; Whole-animal behavior modeling techniques, capture and simulation of behavior; Sensory signals, basic physics and simulation; Optimality theory in understanding animal behavior; The energetic cost of information and how this affects behavior and morphology. Other courses taught include BME 271, Introduction to Biomechanics, and ME 224, Experimental Engineering.Art and Science scale, 2010 Malcolm MacIver, Marlena Novak, and Jay Alan Yim Sponsored and funded by the National Science Foundation, the Northwestern University's Center for Interdisciplinary Research in the Arts, and the McCormick School of Engineering and Applied Science, Office of the Dean. Exhibited at Eindhoven Holland, Nov 18-28 2010, at the STRP Festival. scale was subsequently presented at the TransLife Triennial at the National Art Museum of China in Beijing, 27 July-17 August 2011 (New York Times Review). Read the News Story scale [documentation, STRP Festival 2010] from localStyle on Vimeo. Exhibit Statement scale is an interspecies collaborative audio installation that celebrates a type of fish from the Amazon River Basin. These fish continually discharge a weak electric field of constant frequency that is audible when amplified through a speaker. Similar to sonar used by bats and dolphins, the fish use this field to detect their surroundings and prey while hunting at night; they have contributed greatly to our understanding of the nervous system. Their electromagnetic discharg",
  "content_length": 14021,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:16"
}