{
  "name": "Malcolm Ryan",
  "homepage": "https://researchers.mq.edu.au/en/persons/malcolm-ryan",
  "status": "success",
  "content": "Malcolm Ryan - Macquarie University View Scopus Profile Malcolm Ryan Dr Associate Professor, School of ComputingEthics and Agency Research CentrePerformance and Expertise Research Centre https://orcid.org/0000-0002-4878-0216 Phone+61 2 9850 9512Emailmalcolm.ryanmq.eduau h-index 534 Citations 11 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1996 …2025 Research activity per year Personal profile Research interestsGame design and developmentVirtual realityGames for vision scienceCognitive decision-making and learningGames-based learningMoral psychologySystematic story generation methodsMachine Learning Fingerprint Dive into the research topics where Malcolm Ryan is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Decision Making Psychology 100% Subgraphs Computer Science 66% Cybersecurity Computer Science 66% Game Design Computer Science 61% multiple robot Computer Science 57% robot path planning Computer Science 53% Serious Game Computer Science 41% Story-Telling Psychology 40% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2017 2018 2019 2024 3 Active 6 Finished Projects per year Measuring moralityHowarth, S. (Primary Chief Investigator) & Ryan, M. (Partner Investigator)1/01/18 → …Project: Research Social Eye Gaze in Virtual AgentsRyan, M. (Primary Chief Investigator), Caruana, N. (Chief Investigator), Quinn, R. (Student) & McEwan, M. (Chief Investigator)1/01/18 → …Project: Research Videogames for Vision ScienceRyan, M. (Primary Chief Investigator), Boon, M.-Y. (Chief Investigator) & McEwan, M. (Chief Investigator)1/01/18 → …Project: Research Moral Video Games CollaborationRyan, M. (Primary Chief Investigator), Formosa, P. (Chief Investigator) & Klincewicz, M. (Partner Investigator)5/04/24 → 1/05/24Project: Research File Control and User Interface Design Factors for the Metaverse – Supporting Meaningful Social Interactions in VRMcEwan, M. (Primary Chief Investigator), Ryan, M. (Chief Investigator), Nalepka, P. (Chief Investigator), Caruana, N. (Chief Investigator), Richardson, M. (Chief Investigator), Kallen, R. (Chief Investigator) & Curby, K. (Chief Investigator)17/10/22 → 16/10/23Project: Research View all 9 projects Research Outputs Research output per year 1996 2007 2011 2012 2013 2016 2017 2019 2020 2021 2023 2025 27 Conference proceeding contribution 16 Article 3 Other Creative work 2 Paper 4 More 2 Editorial 1 Chapter 1 Digital or Visual products Research output per year Research output per year Making games to learn music: an intersection of Twine, activity-centred learning and creative peopleO'Neill, M., Ryan, M., Powell, S. & Edmond, C., 2025, Proceedings of DiGRA Australia 2025. Online: Digital Games Research Association (DiGRA), 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open Access Negotiation games with structured post-hoc intentsWarren, D., Dras, M. & Ryan, M., Sept 2025, In: Pattern Recognition Letters. 195, p. 23-29 7 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Human Language 100% Transformer Model 100% AI Agent 100% 33 Downloads (Pure) Ethical decision-making through systems-based gameplaySansare, V., Ryan, M. & McEwan, M., 2023, p. 1-4. 4 p.Research output: Contribution to conference › Paper › peer-review Open Access Modelling the ethical priorities influencing decision-making in cybersecurity contextsSadeghi, B., Richards, D., Formosa, P., McEwan, M., Bajwa, M. H. A., Hitchens, M. & Ryan, M., 24 May 2023, (E-pub ahead of print) In: Organizational Cybersecurity Journal: Practice, Process and People.Research output: Contribution to journal › Article › peer-review Open Access Cybersecurity 100% Decision-Making 100% Ethical Principle 60% Ergonomics 10% Serious Game 10% The effect of morality meters on ethical decision making in video games: a quantitative studyRyan, M., McEwan, M., Formosa, P., Messer, J. & Howarth, S., May 2023, In: Computers in Human Behavior. 142, p. 1-12 12 p., 107623.Research output: Contribution to journal › Article › peer-review Decision Making 100% Quantitative Study 100% 1 Citation (Scopus) View all 52 research outputs Prizes Highly Commended - Vice-Chancellor's Educational Leader Award 2023Ryan, M. (Recipient), 15 Nov 2023Prize: Teaching award Student Experience 100% Vice Chancellor 100% Activities Activities per year 2018 2018 2018 1 Editorial work Activities per year Games and Culture (Journal)Ryan, M. (Editor), Formosa, P. (Editor) & Tulloch, R. (Editor)2018Activity: Peer-review and editorial of research outputs › Editorial work",
  "content_length": 5055,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:11"
}