{
  "name": "Malihe Alikhani",
  "homepage": "https://www.malihealikhani.com",
  "status": "success",
  "content": "About | Mysite top of pageMalihe Alikhani I am an Assistant Professor at Northeastern University’s Khoury College of Computer Sciences. I also serve as a resident Visiting Fellow at the Brookings Institution, focusing on AI policy, the Ethics Chair of the Association for Computational Linguistics, and a member of the US Technology Policy Committee of the Association for Computing Machinery. I develop safe and fair AI systems that enhance communication, decision-making, and knowledge sharing across disciplines and populations. My work bridges academia, applied AI research, and public policy to ensure that AI serves society responsibly and effectively. I have served as a science and technology advisor in Congress and collaborated with the United Nations in Africa on initiatives using AI to support anti-violence efforts and promote equitable access to education and health. Building on this vision, as the lead of the Contextual AI Lab, where we focus on building embodied systems that operate meaningfully within context across language, embodiment, and society to support safer, fairer, and more productive interactions between humans and machines. By integrating insights from cognitive and social sciences with machine learning, our models capture the richness of human interpretation and support collaborative meaning construction. Through this work, I aim to shape a future that expands the human capabilities for learning, health, creativity, and wellbeing, a future where intelligent systems foster these as rights. email: m.alikhani AT northeastern.eduSelected Recent Publications​​Accounting for Sycophancy in Language Model Uncertainty Estimation, Anthony Sicilia, Mert Inan, Malihe Alikhani, the Association for Computational Linguistics: NAACL 2025. Evaluating Theory of (an uncertain) Mind: Predicting the Uncertain Beliefs of Others in Conversation Forecasting, Anthony Sicilia and Malihe Alikhani, 2025 Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics. Deal, or no deal (or who knows)? Forecasting Uncertainty in Conversations using Large Language Models, Anthony Sicilia, Hyunwoo Kim, Khyathi Raghavi Chandu, Malihe Alikhani, Jack Hessel, The 62nd Annual Meeting of the Association for Computational Linguistics, 2024. ​ Studying and Mitigating Biases in Sign Language Understanding Models, Katherine Atwell, Danielle Bragg, Malihe Alikhani, The 2024 Conference on Empirical Methods in Natural Language Processing. Including Signed Languages in Natural Language Processing, Kayo Yin, Amit Moryossef, Julie Hochgesang, Yoav Goldberg, and Malihe Alikhani, The Joint Conference of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing, 2021. Best  Theme Paper Award​ HumBEL: A Human-in-the-Loop Approach for Evaluating Demographic Factors of Language Models in Human-Machine Conversations, Anthony Sicilia, Malihe Alikhani, The 18th Conference of the European Chapter of the Association for Computational Linguistics, 2024. ​PAC-Bayesian Domain Adaptation Bounds for Multiclass Learners, Anthony Sicilia, Katherine Atwell, Malihe Alikhani, Seong Jae Hwang, The Conference on Uncertainty in Artificial Intelligence (UAI), 2022. Best  Paper Award ​Highlighted AI Policy ArticlesBreaking the AI mirror: Sycophancy, productivity, and the future of collaboration By Malihe Alikhani Published by BrookingsHype and harm: Why we must ask harder questions about AI and its alignment with human values Malihe Alikhani and Sabit Hassan Published by BrookingsHow are Americans using AI? Evidence from a nationwide survey By Malihe Alikhani, Ben Harris and Sanjay Patnaikbottom of page",
  "content_length": 3746,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:13"
}