{
  "name": "Malte Lochau",
  "homepage": "https://mbe.informatik.uni-siegen.de/team/malte-lochau",
  "status": "success",
  "content": "Prof. Dr. rer. nat. Malte Lochau – Modellbasierte Entwicklung Startseite Lehre Sommersemester Complex and Intelligent Software Systems Datenbanksysteme II Softwaretechnik II Proseminar/Seminar „Modellbasierte Entwicklung“ Projektgruppe / Projektarbeit „Software Engineering“ Wintersemester Datenbanksysteme I Softwaretechnik I Model Checking Software Engineering für Mechatroniker Guide to Scientific Working Softwaretechnik Praktikum Linuxkurs Abschlussarbeiten Forschung Modeling and Analyzing Configurable Software with Weighted Automata Co-InCyTe Team Prof. Dr. rer. nat. Malte Lochau Katharina Zetzsche Dipl.-Ing. Frank Schuh M. Sc. Robert Müller M. Sc. Mathis Weiß M. Sc. Evelyn Rühl M. Sc. Adrián Marín Boyero Kontakt Modellbasierte Entwicklung » Prof. Dr. rer. nat. Malte Lochau Deutsch English (Englisch) Prof. Dr. rer. nat. Malte Lochau Kontakt Prof. Dr. rer. nat. habil. Malte LochauTelefon: 0271-740-2611E-Mail: malte.lochau@uni-siegen.deBüro: H-C 8329/2 ORCID: 0000-0002-8404-753X Lehre und Administrative Tätigkeiten Die am Lehrstuhl angebotenen Lehrveranstaltungen finden Sie hier. Eine vollständige Liste meiner bisherigen Lehrtätigkeiten finden Sie hier. Offene Themen für Abschlussarbeiten finden Sie hier. Ich bin Ansprechpartner für Fachgespräche zum Hochschulzugang für Personen ohne allgemeine Hochschulreife (siehe hier). Ich bin Mitglied des Prüfungsausschusses Informatik. Ich bin Mitglied des Tenure Boards der Universität Siegen (siehe hier). Ich trage bei zur Athena European University (siehe hier), dem Schülerpraktium Berufskolleg Technik und Brücken ins Studium (siehe hier). Gesprächstermine können nach Bedarf direkt mit mir per E-Mail vereinbart werden. Forschung Einen Überblick über aktuelle Forschungsthemen und Projekte finden Sie hier. Eine vollständige Liste meiner Publikationen finden Sie hier und bei dblp. Für unser Paper: L. Luthmann, Andreas Stephan, Johannes Bürdek, M. Lochau: Modeling and Testing Product Lines with Unbounded Parametric Real-Time Constraints (SPLC 2017) haben wir den Best Paper Award der SPLC 2017 erhalten. Für unser Paper: S. Oster, I. Zorcic, F. Markert, and M. Lochau: MoSo-PoLiTe – Tool Support for Pairwise and Model-Based Software Product Line Testing (VAMOS 2011) haben wir den Most Influential Paper Award der VaMoS 2021 erhalten. Eine Liste ausgewählter eingeladener Vorträge und Tagungsvorträge finden Sie hier. Ausgewählte Programm-Komitees: SPLC, VaMoS, ASE, FormaliSE, NIER@ICSE, ICMT, ECMFA, FM. Eine vollständige Liste aller Mitgliedschaften in Programm-Komitees finden Sie hier. Ich war PC Chair der VaMoS 2018 und Tutorial Chair der Modellierung 2018. Ich bin derzeit Mitglied im Steering-Komitee der VaMoS. Ich bin Mitglied der FDO-TSIG und dem FDO-RKP Komitee (siehe hier). Ausgewählte Review-Tätigkeiten für Journals: TSE, TOSEM, EMSE, SOSYM, JSS, JLAMP, SCP. Eine vollständige Liste aller Review-Tätigkeiten finden Sie hier. Ich bin Mitglied im TOSEM Board of Distinguished Reviewers. Ich bin Co-Organisator der IoT Conference Session Defining and Standardising the Evolving Global Integrated Data Space, 2022. Ich war (Co-)Organistor des GI Dagstuhl-Seminars 19023 (2019) sowie von D-CON 2018, FOSD 2017, FOSD 2012. Meinen wissenschaftlichen CV finden Sie hier. Aktualisiert um 11:55 am 6. April 2020 von g044465 Startseite Lehre Sommersemester Complex and Intelligent Software Systems Datenbanksysteme II Softwaretechnik II Proseminar/Seminar „Modellbasierte Entwicklung“ Vorlage für die schriftliche Ausarbeitung des Seminars Projektgruppe / Projektarbeit „Software Engineering“ Wintersemester Datenbanksysteme I Softwaretechnik I Model Checking Software Engineering für Mechatroniker Guide to Scientific Working Softwaretechnik Praktikum Linuxkurs Abschlussarbeiten Forschung Modeling and Analyzing Configurable Software with Weighted Automata Co-InCyTe Team Prof. Dr. rer. nat. Malte Lochau Katharina Zetzsche Dipl.-Ing. Frank Schuh M. Sc. Robert Müller M. Sc. Mathis Weiß M. Sc. Evelyn Rühl M. Sc. Adrián Marín Boyero Kontakt Widgets Startseite Lehre Sommersemester Complex and Intelligent Software Systems Datenbanksysteme II Softwaretechnik II Proseminar/Seminar „Modellbasierte Entwicklung“ Vorlage für die schriftliche Ausarbeitung des Seminars Projektgruppe / Projektarbeit „Software Engineering“ Wintersemester Datenbanksysteme I Softwaretechnik I Model Checking Software Engineering für Mechatroniker Guide to Scientific Working Softwaretechnik Praktikum Linuxkurs Abschlussarbeiten Forschung Modeling and Analyzing Configurable Software with Weighted Automata Co-InCyTe Team Prof. Dr. rer. nat. Malte Lochau Katharina Zetzsche Dipl.-Ing. Frank Schuh M. Sc. Robert Müller M. Sc. Mathis Weiß M. Sc. Evelyn Rühl M. Sc. Adrián Marín Boyero Kontakt Widgets Startseite Lehre Sommersemester Complex and Intelligent Software Systems Datenbanksysteme II Softwaretechnik II Proseminar/Seminar „Modellbasierte Entwicklung“ Vorlage für die schriftliche Ausarbeitung des Seminars Projektgruppe / Projektarbeit „Software Engineering“ Wintersemester Datenbanksysteme I Softwaretechnik I Model Checking Software Engineering für Mechatroniker Guide to Scientific Working Softwaretechnik Praktikum Linuxkurs Abschlussarbeiten Forschung Modeling and Analyzing Configurable Software with Weighted Automata Co-InCyTe Team Prof. Dr. rer. nat. Malte Lochau Katharina Zetzsche Dipl.-Ing. Frank Schuh M. Sc. Robert Müller M. Sc. Mathis Weiß M. Sc. Evelyn Rühl M. Sc. Adrián Marín Boyero Kontakt © Universität Siegen | Datenschutzerklärung © Universität Siegen | Datenschutzerklärung",
  "content_length": 5561,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:16"
}