{
  "name": "Malvina Nissim",
  "homepage": "https://malvinanissim.github.io",
  "status": "success",
  "content": "Malvina Nissim Malvina Nissim CLCG, University of Groningen Malvina Nissim Professor of Computational Linguistics and Society at the University of Groningen. Follow Twitter GitHub Google Scholar Staff page m.nissim@rug.nl Office 1311.421Harmonie ComplexOude Kijk in 't Jatstraat 269712 EK Groningen, The Netherlands Center for Language and Cognition Groningen (CLCG) Faculty of Arts, University of Groningen I work in Natural Language Processing and its application to societally relevant problems. Besides my research activities I am particularly active in science communication and outreach, including to school children, especially towards an aware and responsible use of language technologies. I really enjoy public speaking, and once I got to give a TEDx talk. I was also invited by the European Council to give a plenary lecture on gender bias in Artificial Intelligence on International Women’s Day 2021. As a university professor I teach quite a bit, and I love it - proud to be elected as the 2016 University of Groningen Lecturer of the Year. I am the coordinator of the Sectorplan’s theme Humane AI at the University of Groningen I am a member of the ACL Ethics Committee I am a member of the Scientific Advisory Board of the Jantina Tammes School for Digital Society, Technology, and AI at the University of Groningen I am a member of the board of AILC, the Italian Association for Computational Linguistics News and Recent Events AI and freedom of speech, a short piece I wrote on writing for World Press Freedom Day, May 3rd 2025. Gosse Minnema won the Anéla/AVT Dissertation Prize, with his thesis titled Perspective matters: event framing in language and society! It makes me a really proud supervisor. Keynote at the Grote Taaldag 2025 (the Dutch Annual Linguistics Day) in Utrecht, 31 January 2025. Slides are available here as a pdf (please note that taken outside of my actual presentation’s context, the message they’re supposed to convey could be misunderstood.) Keynote at the 23rd International Conference of the Italian Association for Artificial Intelligence AIXIA 2024 in Bolzano. Slides are available here as a pdf (please note that taken outside of my actual presentation’s context, the message they’re supposed to convey could be misunderstood.) Thanks to a CLICK-NL 800K grant, we have started a collaboration with the Dagblad van het Noorden, 8D, and AI-Hub Noord-Nederland with the PAGINA project. More information at the project’s webpage. “Women and Language Technology”: Keynote at Women in Data Science Belgium, Ghent, 17 May 2024. Slides are available here (please note that taken outside of my actual presentation’s context, the message they’re supposed to convey could be misunderstood.) As a member of the UNL working group on AI I participated in a panel at the Digital Society conference in Utrecht on April 25th Watch Your Language! Interdisciplinary workshop at the Lorentz Center in Leiden, April 8-12 2024 A year with ChatGPT: Everything you need to know! Info event organised by GroNLP and the Humane AI team, in collaboration with (hosted by) the Jantina Tammes School. (Slides available at the link.) The HAICu project is funded! I’m involved as co-applicant, and we are about to open a PhD position on it. Past events Some past events are listed here Highlights Book I wrote a introductory book to Computational Linguistics (in Italian), together with Ludovica Pannitto, and with drawings by Myriam Nissim. Read TEDx Talk I gave a TEDx Talk on Language, Humans, and AI, and how machines might challenge our stereotypical thinking. Watch Podcast The most rewarding conversation I had on ChatGPT, and especially its impact on education, was on this podcast episode. Listen Enter your search term...",
  "content_length": 3747,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:16"
}