{
  "name": "Mamtaj Akter",
  "homepage": "https://site.nyit.edu/bio/Mamtaj.Akter",
  "status": "success",
  "content": "Mamtaj Akter | Bio | New York Tech Mamtaj Akter Title: Assistant ProfessorDepartment: Computer ScienceCampus: New York CityArea(s) of Expertise: Human-Computer Interaction, Usable Security and Privacy, Online Safety, Social ComputingEducation Credentials: Ph.D. Joined New York Tech: 2024 Mamtaj Akter, Ph.D., specializes in social computing, online safety, and usable privacy and security. Her research focuses on empowering individuals and their trusted communities to collaboratively manage online risks and digital privacy and security threats. Professor Akter has co-authored many peer-reviewed publications, with most published in top-tier Human-Computer Interaction venues, including the ACM's Conference on Human Factors in Computing Systems (CHI), Computer-Supported Cooperative Work and Social Computing (CSCW), and the Symposium on Usable Privacy and Security (SOUPS). She has a strong track record in mentorship, having guided over 40 students in research and senior design projects. She earned her doctoral degree in computer science from Vanderbilt University, a master's degree from the University of Oregon, and her bachelor's degree from Shahjalal University, Bangladesh. Recent Projects and Research Community Oversight for Privacy and Security Community-based Smart Home Monitoring Peer Support for Mental Health Youth's Risk Experiences on Social Media Selected Publications and Presentations Conference Proceedings/Journal Articles (Peer-Reviewed) Alluhidan, A., Akter, M., Alsoubai, A., Park, J., Wisniewski, P., \"Teen Talk: The Good, the Bad, and the Neutral of Adolescent Social Media Use\", Proc. ACM Hum.-Comput. Interact., CSCW (Oct 2024). Tanni, T., Akter, M., Anderson, J., Amon, M., Wisniewski, P., \"Examining the Unique Online Risk Experiences and Mental Health Outcomes of LGBTQ+ versus Heterosexual Youth\", In Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems (In Press). Association for Computing Machinery, New York, NY, USA. Akter, M., Tabassum, M., Miazi, N., Alghamdi, L., Kropczynski, J., Wisniewski, P., and Lipford, H., \"Evaluating Community Oversight Mechanisms in Increasing Community Collective Efficacy for Managing Mobile Privacy and Security\", In Nineteenth Symposium on Usable Privacy and Security (SOUPS '23). USENIX Association, Anaheim, CA, 437–456. Alghamdi, L., Akter, M., Kropczynski, J., Wisniewski, P., Lipford, H., \"Co-designing Community-based Sharing of Smart Home Devices for the Purpose of In-home Emergency Co-monitoring\", In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (CHI '23). Association for Computing Machinery, New York, NY, USA, Article 426. Akter, M., Godfrey, A., Kropczynski, J., Lipford, H., Wisniewski, P., \"From Parental Control to Joint Family Oversight: Can Parents and Teens Manage Mobile Online Safety and Privacy as Equals?\", Proc. ACM Hum.-Comput. Interact. 6, CSCW1, Article 57 (April 2022), 28 pages. Do, T., Akter, M., McMahan, Choudhary, Z., R., Azevedo, R., \"The Effects of a Virtual Pedagogical Agent's Synthetic Accent and Learner Gender on Learning Outcomes and Perception\", In Proceedings of the 2022 International Conference on Multimodal Interaction (ICMI '22). Association for Computing Machinery, New York, NY, USA, 198–206. Alghamdi, L., Alsoubai, A., Akter, M., Alghamdi, F., Wisniewski, P., \"A User Study to Evaluate a Web-based Prototype for Smart Home Internet of Things Device Management\", In: Moallem, A. (eds) HCI for Cybersecurity, Privacy and Trust. HCII '22. Lecture Notes in Computer Science, vol 13333. Springer, Cham. Kropczynski, J., Ghaiumy, R., Akter, M., Godfrey, A., Wisniewski, P., Lipford, H., \"Examining Collaborative Support for Privacy and Security in the Broader Context of Tech Caregiving\", Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 396 (October 2021). Akter, M., Islam, A., Rahman, A., \"Fault Tolerant Optimized Broadcast for Wireless Ad-Hoc Networks\", International Conference on Networking Systems and Security (NSysS '16), pp. Extended Abstracts and Demos (Peer-Reviewed) Park, J. K., Akter, M., Wisniewski, P., & Badillo-Urquiola, K. (2024). It's Still Complicated: From Privacy-Invasive Parental Control to Teen-Centric Solutions for Digital Resilience. IEEE Security & Privacy. Akter, M., Agha, Z., Alsoubai, A., Ali, N. S., & Wisniewski, P. (2024, March). Towards Collaborative Family-Centered Design for Online Safety, Privacy and Security. In Family-Centered Design Workshop of the 2024 CHI Conference on Human Factors in Computing Systems. Park, Jinkyung and Akter, Mamtaj and Wisniewski, Pamela, Towards Promoting Online Safety of Sexual and/or Gender Minority Youth (May 23, 2024). In The Gender, Online Safety, and Sexuality (GOSS) workshop of the 2024 Twentieth Symposium on Usable Privacy and Security. Akter, M., Alghamdi, L., Kropczynski, J., Lipford, H., and Wisniewski, P., \"It Takes a Village: A Case for Including Extended Family Members in the Joint Oversight of Family-based Privacy and Security for Mobile Smartphones\", In Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems (CHI EA '23). Association for Computing Machinery, New York, NY, USA, Article 194, 1–7. Akter, M., Alghamdi, L., Gillespie, D., Miazi, S., Kropczynski, J., Lipford, H., Wisniewski, P., \"CO-oPS: A Mobile App for Community Oversight of Privacy and Security\", In Companion Publication of the 2022 Conference on Computer Supported Cooperative Work and Social Computing (CSCW'22 Companion). Association for Computing Machinery, New York, USA. Alghamdi, L., Akter, M., Cardenas, C., Cruces, D., Wiese, J., Kropczynski, J., Lipford, H., Wisniewski, P., \"Mi Casa es Su Casa (MiSu): A Mobile App for Sharing Smart Home Devices with People Outside the Home\", In Companion Publication of the 2022 Conference on Computer Supported Cooperative Work and Social Computing (CSCW'22 Companion). Association for Computing Machinery, New York, NY, USA, 184–187. Courses Taught at New York Tech CSCI 380: Software Engineering Contact Info mamtaj.akter@nyit.edu Google Scholar X X By continuing to use the website, you consent to analytics tracking per NYIT's Privacy Statement Accept Cookies By continuing to use the website, you consent to analytics tracking per New York Tech's Privacy StatementAccept Cookies",
  "content_length": 6312,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:18"
}