{
  "name": "Man-Ki Yoon",
  "homepage": "https://mankiyoon.github.io",
  "status": "success",
  "content": "Man-Ki Yoon | Assistant Professor at NC State Man-Ki Yoon Assistant Professor at NC State Email: man-ki.yoon@ncsu.edu I am an Assistant Professor in the Department of Computer Science at NC State University. My research interests are in trustworthy and accountable computing for autonomous systems (such as autonomous vehicles and unmanned aerial vehicles), real-time embedded computing, and internet-of-things. In particular, I am interested in developing computer systems techniques that enable reasoning about why/how faulty events (e.g., accident) happened, what components are responsible, and whether evidence are trustworthy. Prior to joining NC State, I was a research scientist in Computer Science at Yale University. I received my Ph.D. degree in Computer Science from the University of Illinois at Urbana-Champaign and my Bachelor’s degree in Computer Science and Engineering from Seoul National University in Korea. Teaching NC State CSC 491/591: Self-Driving Cars: Theory and Practice (Spring 2026, Spring 2025, Spring 2024) CSC 501: Operating Systems Principles (Fall 2025, Fall 2024, Fall 2023, Spring 2023) CSC 591/791 & ECE 591 (004): Security of Cyber-Physical Systems (Fall 2022) Yale CPSC 335: Theory and Implementation of Self-Driving Cars (Spring 2021, Spring 2020) CPSC 235/EENG 245: Self-Driving Cars: Theory and Practice (Spring 2020, Spring 2019) Publications Conference/Journal [SEC 2025] FrameScope: Temporal Data Valuation for Stream Active Learning in Autonomous Vehicle Systems Yuheng Zhu, Man-Ki Yoon Proceedings of the 10th ACM/IEEE Symposium on Edge Computing, Dec. 2025 [ACSAC 2025] It’s a non-stop PARTEE! Practical multi-enclave availability through partitioning and asynchrony Richard Habeeb, Hao Chen, Man-Ki Yoon, Zhong Shao Proceedings of the 41st IEEE Annual Computer Security Applications Conference, Dec. 2025 [HPCC 2025] ClariNet: Generalized Reputation Framework for Witnessed Data in Distributed Systems Andrew Robie, Man-Ki Yoon Proceedings of the 27th IEEE International Conference on High Performance Computing and Communications, Aug. 2025 [IV 2025] Q-Loc: Visual Cue-Based Ground Vehicle Localization Using Long Short-Term Memory Cole Malinchock, Jimin Yu, Pratik Thapa, Dhruva Ungrupulitahya, Man-Ki Yoon Proceedings of the 36th IEEE Intelligent Vehicles Symposium, Jun. 2025 [TrustCom 2024] WhisperMQTT: Lightweight Secure Communication Scheme for Subscription-Heavy MQTT Network Youbin Kim, Man-Ki Yoon Proceedings of the 23rd IEEE International Conference on Trust, Security and Privacy in Computing and Communications, Dec. 2024 [VTC 2024] AdaptAV: Continuous Adaption of Vision Models for Autonomous Vehicles Using Cloud-based Oracle Yuheng Zhu, Dhruva Ungrupulithaya, Boluo Ge, Man-Ki Yoon Proceedings of the 100th IEEE Vehicular Technology Conference, Oct. 2024 [ICDCS 2023] AccountNet: Accountable Data Propagation Using Verifiable Peer Shuffling Man-Ki Yoon Proceedings of the 43rd IEEE International Conference on Distributed Computing Systems, Jul. 2023 [OOPSLA 2022] Compositional Virtual Timeline: Verifying Dynamic-Priority Partitions with Algorithmic Temporal Isolation Mengqi Liu, Zhong Shao, Hao Chen, Man-Ki Yoon, Jung-Eun Kim Proceedings of the ACM on Programming Languages (PACMPL), Volume 6, Number OOPSLA2, Article 127, Dec. 2022 [DSN 2022] TimeDice: Schedulability-Preserving Priority Inversion for Mitigating Covert Timing Channels Between Real-time Partitions Man-Ki Yoon, Jung-Eun Kim, Richard Bradford, Zhong Shao Proceedings of the 52nd IEEE/IFIP International Conference on Dependable Systems and Networks, Jun. 2022 [Security 2021] Blinder: Partition-Oblivious Hierarchical Scheduling Man-Ki Yoon, Mengqi Liu, Hao Chen, Jung-Eun Kim, Zhong Shao Proceedings of the 30th USENIX Security Symposium, Aug. 2021 [ICRA 2020] Task-Aware Novelty Detection for Visual-based Deep Learning in Autonomous Systems Valerie Chen, Man-Ki Yoon, Zhong Shao Proceedings of the IEEE International Conference on Robotics and Automation, May 2020 [DATE 2020] ABC: Abstract prediction Before Concreteness Jung-Eun Kim, Richard Bradford, Man-Ki Yoon, Zhong Shao Proceedings of the 23rd ACM/IEEE Design, Automation, and Test in Europe, Mar. 2020 [POPL 2020] Virtual Timeline: A Formal Abstraction for Verifying Preemptive Schedulers with Temporal Isolation Mengqi Liu, Lionel Rieg, Zhong Shao, Ronghui Gu, David Costanzo, Jung-Eun Kim, Man-Ki Yoon Proceedings of the 47th ACM SIGPLAN Symposium on Principles of Programming Languages, Jan. 2020 [ICDCS 2019] ADLP: Accountable Data Logging Protocol for Publish-Subscribe Communication Systems Man-Ki Yoon and Zhong Shao Proceedings of the 39th IEEE International Conference on Distributed Computing Systems, Jul. 2019 [ICCPS 2017] VirtualDrone: Virtual Sensing, Actuation, and Communication for Attack-Resilient Unmanned Aerial Systems Man-Ki Yoon, Bo Liu, Naira Hovakimyan, Lui Sha Proceedings of the 8th ACM/IEEE International Conference on Cyber-Physical Systems, Apr. 2017 [IoTDI 2017] Learning Execution Contexts from System Call Distribution for Anomaly Detection in Smart Embedded System Man-Ki Yoon, Sibin Mohan, Jaesik Choi, Mihai Christodorescu, Lui Sha Proceedings of the 2nd ACM/IEEE International Conference on Internet-of-Things Design and Implementation, Apr. 2017 [Computer 2016] Real-Time Computing on Multicore Processors Lui Sha, Marco Caccamo, Renato Mancuso, Jung-Eun Kim, Man-Ki Yoon, Rodolfo Pellizzoni, Heechul Yun, Russell Kegley, Dennis Perlman, Greg Arundale, Richard Bradford IEEE Computer, Vol. 49, no. 9, pp. 69-77, Sep. 2016 [Real-Time Syst 2016] Integrating Security Constraints Into Fixed Priority Real-Time Schedulers Sibin Mohan, Man-Ki Yoon, Rodolfo Pellizzoni, Rakesh Bobba Real-Time Syst, Vol. 52, no. 5, pp. 644-674, Sep. 2016 [SYSTOR 2016] The DragonBeam Framework: Hardware-Protected Security Modules for In-Place Intrusion Detection Man-Ki Yoon, Mihai Christodorescu, Lui Sha, Sibin Mohan Proceedings of the 9th ACM International Systems and Storage Conference, Jun. 2016 [ASPLOS 2016] PIFT: Predictive Information-Flow Tracking Man-Ki Yoon, Negin Salajegheh, Yin Chen, Mihai Christodorescu Proceedings of the 21st ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Apr. 2016 [RTAS 2016] TaskShuffler: A Schedule Randomization Protocol for Obfuscation Against Timing Inference Attacks in Real-Time Systems Man-Ki Yoon, Sibin Mohan, Chien-Ying Chen, Lui Sha Proceedings of the 22nd IEEE Real-Time and Embedded Technology and Applications Symposium, Apr. 2016 [DAC 2015] Memory Heat Map: Anomaly Detection in Real-Time Embedded Systems Using Memory Behavior Man-Ki Yoon, Sibin Mohan, Jaesik Choi, Lui Sha Proceedings of the 52nd ACM/EDAC/IEEE Design Automation Conference, Jun. 2015 [RTAS 2015] A Generalized Model for Preventing Information Leakage in Hard Real-Time Systems Rodolfo Pellizzoni, Neda Paryab, Man-Ki Yoon, Stanley Bak, Sibin Mohan, and Rakesh Bobba Proceedings of the 21st IEEE Real-Time and Embedded Technology and Applications Symposium, Apr. 2015 [COMPSAC 2014] Integrated Modular Avionics (IMA) Partition Scheduling with Conflict-Free I/O for Multicore Avionics Systems Jung-Eun Kim, Man-Ki Yoon, Richard Bradford, Lui Sha Proceedings of the 38th IEEE International Computers, Software, and Applications Conference, Jul. 2014 [ECRTS 2014] Real-Time Systems Security Through Scheduler Constraints Sibin Mohan, Man-Ki Yoon, Rodolfo Pellizzoni, Rakesh Bobba Proceedings of the 26th Euromicro Conference on Real-Time Systems, Jul. 2014 [RTAS 2013] SecureCore: A Multicore-based Intrusion Detection Architecture for Real-Time Embedded Systems Man-Ki Yoon, Sibin Mohan, Jaesik Choi, Jung-Eun Kim, Lui Sha Proceedings of the 19th IEEE Real-Time and Embedded Technology and Applications Symposium, Apr. 2013 [DATE 2013] Holistic Design Parameter Optimization of Multiple Periodic Resources in Hierarchical Scheduling Man-Ki Yoon, Jung-Eun Kim, Richard Bradford, Lui Sha Proceedings of the 16th ACM/IEEE Design, Automation, and Test in Europe, Mar. 2013 [DATE 2013] Optimized Scheduling of Multi-IMA Partitions with Exclusive Region for Synchronized Real-Time Multi-Core System Jung-Eun Kim, Man-Ki Yoon, Sungjin Im, Richard Bradford, Lui Sha Proceedings of the 16th ACM/IEEE Design, Automation, and Test in Europe, Mar. 2013 [RTSS 2011] Optimizing TunableWCET with Shared Resource Allocation and Arbitration in Hard Real-Time Multicore Systems Man-Ki Yoon, Jung-Eun Kim, Lui Sha Proceedings of the 32nd IEEE Real-Time Systems Symposium, Nov. 2011 [IEEE TC 2010] Migrating from Per-Job Analysis to Per-Resource Analysis for Tighter Bounds of End-to-End Response Times Man-Ki Yoon, Chang-Gun Lee, Junghee Han IEEE Transactions on Computers, Vol. 59, no. 7, pp. 933-942, Jul. 2010 [DCOSS 2008] Sensor Placement for 3-Coverage with Minimum Separation Requirements Jung-Eun Kim, Man-Ki Yoon, Junghee Han, Chang-Gun Lee Proceedings of the 4th IEEE International Conference on Distributed Computing in Sensor Systems, Jun. 2008 [IEEE TC 2008] A Real-Time Ubiquitous System for Assisted Living: Combined Scheduling of Sensing and Communication for Real-Time Tracking Min-Young Nam, Mhd Zaher Al-Sabbagh, Jung-Eun Kim, Man-Ki Yoon, Chang-Gun Lee, Eun-Yong Ha IEEE Transactions on Computers, Vol. 57, no. 6, pp. 795-808, Jun. 2008 Workshop [DSML 2019] Novelty Detection via Network Saliency in Visual-based Deep Learning Valerie Chen, Man-Ki Yoon, Zhong Shao Dependable and Secure Machine Learning Workshop co-located with IEEE DSN, Jun. 2019 [SENT 2014] Communication Pattern Monitoring: Improving the Utility of Anomaly Detection for Industrial Control Systems Man-Ki Yoon, Gabriela F. Ciocarlie NDSS Workshop on Security of Emerging Networking Technologies, Feb. 2014 [INFOCOM WKSHPS 2011] Scheduling and Control Co-design under End-to-end Response Time Constraints in Cyber-Physical Systems Kyung-Joon Park, Man-Ki Yoon, Kyungtae Kang, Chang-Gun Lee INFOCOM Workshop on Cyber-Physical Networking S",
  "content_length": 12731,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:17"
}