{
  "name": "Man On Pun",
  "homepage": "https://mypage.cuhk.edu.cn/academics/simonpun/index.html",
  "status": "success",
  "content": "2025 - Laboratory of Sensing and Communication for Smart City Skip to content News 2025.11 Dr. Xianping Ma was recognized with the University's highest honor, the 2025 Presidential Award for Outstanding Graduate Students. He was also invited to deliver a speech at the SSE graduation ceremony. Xianping is the second member of our team to receive this prestigious award, reflecting the outstanding quality of our students. 2025.09 Congratulations to our undergraduate research assistant, Mr. Hongrui Yin, for winning the prestigious China National Scholarship (国家奖学金). He is the second undergraduate from our lab to receive this honor. 2025.09 Congratulations to our two PhD students, Mr. Maonan Wang and Mr. Aoyu Pang, for winning the first place in the Regional Traffic Signal Collaborative Control category of the Pazhou Algorithm Competition (琶洲算法大赛). [Link] 2025.09 Our recent paper on multi-target unsupervised domain adaptation for remote sensing has been accepted by the IEEE Transactions on Geoscience and Remote Sensing (TGRS) (IF 8.6). [Paper Link] 2025.09 Our recent joint work on VLM-based traffic signal control with Bell-Labs, France and AI labs, Shanghai, has been accepted by the NeurIPS 2025 as a poster. 2025.09 Our recent paper on downstream task-aided cloud removal has been accepted by the IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing (JSTARS) (IF 5.3). [Paper Link] 2025.07 Congratulations to our three PhD students, Ms. Qianqian Wu, Mr. Ziyao Wang and Mr. Ding Ma, on being awarded the highly competitive Shenzhen Universiade International Scholarship (深圳大运留学基金). This prestigious fellowship will support their short-term research visits to leading overseas institutions. 2025.07 Our recent paper on collaborative Space-Air-Ground Earth Observation (EO) has been accepted by the IEEE Geoscience and Remote Sensing Magazine (GRSM) (IF 16.4). [Paper Link] 2025.06 Our recent paper on multimodal fine-tuning of visual foundation models for remote sensing has been accepted by the IEEE Transactions on Geoscience and Remote Sensing (TGRS) (IF 8.6). [Paper Link] 2025.05 Congratulations to Ms. Yuejiao Xie, our third-year PhD student, for receiving a highly competitive IEEE WICE student grant to attend the 2025 IEEE Conference on Communications (ICC) in Montreal, Canada. 2025.05 Congratulations to Ms. Yuejiao Xie for successfully passing her PhD Qualifying Exam (QE). 2025.05 Congratulations to Dr. Xianping Ma for successfully defending his PhD dissertation! He will join the Southwest Jiaotong University as an Assistant Professor this summer. 2025.03 Both of our submissions to the 2025 IEEE International Geoscience and Remote Sensing Symposium (IGARSS) have been accepted for publication. IGARSS is the flagship conference organized by the IEEE Geoscience and Remote Sensing Society. 2025.01 Our two recent papers on UAM trajectory planning have been accepted by the 2025 IEEE Conference on Communications (ICC). ICC is one of the two flagship annual conferences organized by the IEEE ComSoc. Back to top",
  "content_length": 3106,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:17"
}