{
  "name": "Man Hon Cheung",
  "homepage": "https://www.cs.cityu.edu.hk/~mhcheung",
  "status": "success",
  "content": "Man Hon Cheung's Homepage Man Hon Cheung Home Publications Research Man Hon Cheung (張文翰) Man Hon Cheung, Michael City University of Hong Kong Email: mhcheung at cityu dot edu dot hk Man Hon Cheung is an Assistant Professor in the Department of Computer Science at City University of Hong Kong. Formerly, he was a Research Assistant Professor in the Department of Information Engineering at the Chinese University of Hong Kong (CUHK). He received the B.Eng. and M.Phil. degrees in Information Engineering from CUHK in 2005 and 2007, respectively, and the Ph.D. degree in Electrical and Computer Engineering from the University of British Columbia (UBC) in 2012. Current Research Interests Network Economics and Optimization Wireless Networking Machine Unlearning Crowdfunding Blockchain Systems Federated Learning Unmanned Aerial Vehicles (UAVs) Mobile Crowdsensing Ph.D. student recruitment for Fall 2026 Currently, I am recruiting highly-motivated Ph.D. students, who have a strong mathematical background and a passion for developing new technologies, to join my lab. If you are interested in the above theoretical research areas related to network optimization and economics, please take a look at some of my papers to confirm your interest. An interested candidate should send the CV (including publication list, GPA, ranking, and grades of math-related courses), transcript, and a brief summary of research interests to Dr. Man Hon Cheung (mhcheung at cityu dot edu dot hk). CityU application information: https://www.cityu.edu.hk/pg/research-degree-programmes/apply-now Professional Services Associate Editor, IEEE Communications Letters (2019 – 2023) Awards Distinguished Technical Program Committee Member Award in INFOCOM (2018, 2020, 2022, 2025) International Partial Tuition Scholarship, UBC (2011 – 2012) Ph.D. Tuition Fee Award, UBC (2007 – 2011) Graduate Student International Research Mobility Award, UBC (2009) Global Scholarship Program for Research Excellence, CUHK (2009) IEEE Student Travel Grant (2009) Outstanding Teaching Assistant Award, CUHK (2006) Chung Chi Alumni Scholarship for Excellence, CUHK (2003 – 2005) Kong E Suen Memorial Scholarship, CUHK (2003) News [2021.5] The paper \"Crowdfunding with Strategic Pricing and Information Disclosure\" co-authored with Qi and Prof. Huang has been accepted in ACM MobiHoc (acceptance rate 20.1%). [2018.12] Half-day tutorial: “Optimization and Economics of Mobile Crowd Sensing”: IEEE Globecom, Abu Dhabi, UAE, Dec. 2018. [2017.03] Press release of our project on public Wi-Fi advertising: CUHK (university and department) and news agencies (e.g., Apple Daily, Computer World, Sing Tao Daily, Ta Kung Pao, Telecom Asia, Wen Wei Po, and Xinhua News Agency). Copyright (c) 2025 Man Hon Cheung. All rights reserved.",
  "content_length": 2782,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:17"
}