{
  "name": "Man Lung Yiu",
  "homepage": "https://web.comp.polyu.edu.hk/csmlyiu",
  "status": "success",
  "content": "Welcome to Ken Yiu's home page Ken M. L. Yiu Professor Department of Computing Hong Kong Polytechnic University Hung Hom, Kowloon Hong Kong Tel: +852 2766 7246 Office: PQ712 E-mail: csmlyiu AT comp DOT polyu DOT edu DOT hk I received the Bachelor Degree in Computer Engineering and the PhD Degree in Computer Science from the University of Hong Kong in 2002 and 2006, respectively. Then, I worked at Aalborg University from 2006 to 2009. I am currently a professor at Hong Kong Polytechnic University. My research focuses on databases, in particular query processing topics on spatiotemporal data and multidimensional data. Publications DBLP record To PhD applicants: please follow the procedure stated here; I do not reply to any unsolicited email. Research students Current Jiaping CAO Zheng BIAN (jointly supervised with Bo TANG) Zhengxin YOU (jointly supervised with Bo TANG) Qiao HE Qifeng SHEN Wenbo YAO Graduated Jiahao ZHANG (PhD graduated in 2023, now Senior R&D Engineer @ Huawei) Fang WANG (PhD graduated in 2022, now Senior R&D Engineer @ Huawei) Zhe LI (PhD graduated in 2022, now Senior R&D Engineer @ Alibaba) Ran BAI (PhD graduated in 2019) Tsz Nam CHAN (PhD graduated in 2019, now Professor @ Shenzhen University) Yat Fung IP (MPhil graduated in 2019) Chun Yin LIU (MPhil graduated in 2018) Wenjian XU (PhD graduated in 2018, now Associate Professor @ Zhejiang University of Science and Technology) Bo TANG (PhD graduated in 2017, now Associate Professor @ Southern University of Science and Technology) Qiang ZHANG (PhD graduated in 2016) Yu LI (PhD graduated in 2015, now Associate Professor @ Hangzhou Dianzi University) Takazumi MATSUMOTO (PhD graduated in 2015, previously Dr. Edward Hung's student, now Staff Scientist @ Okinawa Institute of Science and Technology Graduate University) Pui Hang LI (MPhil graduated in 2015, now Senior Full Stack Developer @ Convoy Financial Services Ltd.) Jeppe Rishede THOMSEN (PhD graduated in 2015) Jianguo WANG (MPhil graduated in 2013, now Assistant Professor @ Purdue University) Research projects Advancing Learned Index Structures for Databases via Non-linear Functions (PI, Hong Kong GRF 152043/23E, 2024-2026) Exploiting Smart Memory/Storage for Accelerating Data Mining on Vector Data (PI, Hong Kong GRF 152018/20E, 2021-2023) Fast Approximate Data Analytics for Analytic Databases (PI, Hong Kong GRF 152050/19E, 2020-2022) Efficient Spatial Data Management for Crowdsourced Transportation (PI, Hong Kong GRF 152196/16E, 2017-2019) Leveraging Modern CPUs for Efficient Query Processing on Time Series Data (PI, Hong Kong GRF 152043/15E, 2016-2018) Scalable Retrieval Techniques for Massive High-Dimensional Data (PI, Hong Kong GRF 152201/14E, 2015-2017) Automatic Performance Tuning of Spatial Indexes for Dynamic Workloads in Spatial Databases (PI, Hong Kong GRF 5302/12E, 2013-2015) Trustworthy Processing of Shortest Path Queries Over Online Road Network Databases (PI, Hong Kong GRF 5333/10E, 2010-2013) Award SSTD 2025 10-Year Impact Award Professional activities Reviewer for journals IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE) Very Large Data Base Journal (VLDBJ) ACM Transactions on Database Systems (ACM TODS) ACM Transactions on Spatial Algorithms and Systems (ACM TSAS) Information Systems (Inf. Syst.) Editorial advisory board Information Systems (Inf. Syst.) Area chair International Conference on Data Engineering (ICDE 2024) Program committee membership ACM SIGMOD International Conference on Management of Data (SIGMOD 2026, 2025, 2024, 2023, 2013) International Conference on Very Large Data Bases (VLDB 2026, 2025, 2020, 2013) IEEE International Conference on Data Engineering (ICDE 2026, 2025, 2022, 2021, 2020, 2016, 2014, 2013, 2010) IEEE International Conference on Big Data (BigData 2025) ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (ACM SIGSPATIAL 2025, 2024, 2023, 2022, 2021, 2020, 2019, 2018, 2017, 2016, 2015, 2014, 2013, 2012, 2011) International Symposium on Spatial and Temporal Databases (SSTD 2025, 2023, 2021, 2015, 2013, 2011, 2007) ACM International Conference on Information and Knowledge Management (CIKM 2023, 2022, 2016, 2015, 2014, 2009, 2008) ACM Symposium on Cloud Computing (SoCC 2023) International Conference on Mobile Data Management (MDM 2021, 2020, 2019, 2018, 2017, 2016, 2013, 2012) International Conference on Database Systems for Advanced Applications (DASFAA 2021, 2020, 2019, 2018, 2017, 2015, 2014, 2013, 2012, 2011) International Conference on Web Information Systems Engineering (WISE 2021, 2019) International Conference on Extending Database Technology (EDBT 2018) International Conference on Scientific and Statistical Database Management (SSDBM 2015, 2014, 2008) Conference organizer Proceedings Chair of Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD 2026) Proceedings Chair of International Symposium on Spatial and Temporal Databases (SSTD 2021) Local Arrangement Co-Chair of International Conference on Web Information Systems Engineering (WISE 2019) PC Co-Chair of International Joint Conference on Web and Big Data (APWeb-WAIM 2019) Proceedings Chair of International Conference on Mobile Data Management (MDM 2019) PC Co-Chair of International Workshop on Mobile Data Analytics (MoDA 2013) Publicity Chair of International Conference on Mobile Data Management (MDM 2013) Publication Chair of International ACM Workshop on Data Engineering for Wireless and Mobile Access (MobiDE 2012) Web Chair of International Symposium on Spatial and Temporal Databases (SSTD 2009) Local services Vice Chair of ACM Hong Kong Chapter (ACM-HK) Member of HKDSE ICT Subject Committee Teaching COMP2012. Discrete Mathematics (Fall 2025, Fall 2021, Fall 2020) COMP2013. Data Structures and Algorithms (Spring 2025, Spring 2024) COMP5112. Data Structures and Database Systems (Fall 2024, Fall 2023, Fall 2022) COMP3022. Algorithms Engineering (Spring 2023) COMP3021. Programming Language Paradigms (Spring 2022, Spring 2021, Spring 2020, Spring 2019, Spring 2018, Spring 2017) COMP1411. Introduction to Computer Systems (Spring 2020) COMP5434. Big Data Computing (Fall 2019, Summer 2019) COMP5111. Database Systems and Management (Fall 2018) COMP5151. Advanced Database Systems (Spring 2018, Spring 2017, Spring 2016, Spring 2015, Spring 2010) COMP3011. Design and Analysis of Algorithms (Fall 2016, Fall 2015) COMP6701. Advanced Topics in Computer Algorithms (Fall 2015) COMP327. Data Structures and Algorithms II (Fall 2014, Fall 2013, Fall 2012, Fall 2011, Fall 2010) COMP5324. Internet Information Retrieval (Fall 2014) COMP328. Programming Languages: Theory and Applications (Spring 2014, Spring 2013, Spring 2012, Spring 2011) COMP433. Information Retrieval (Summer 2013) COMP305P. Data Structures and Algorithms (Fall 2012, Spring 2012) COMP306. Software Engineering and User Interfaces (Fall 2009)",
  "content_length": 6906,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:17"
}