{
  "name": "Manas Ranjan Lenka",
  "homepage": "https://cse.kiit.ac.in/profiles/manas-ranjan-lenka",
  "status": "success",
  "content": "Manas Ranjan Lenka - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Manas Ranjan Lenka Manas Ranjan Lenka Manas Ranjan Lenka Associate ProfessorManas Ranjan Lenka has started his career in the software industry and worked in various telecom technologies, i.e. 4G (LTE), 3G, 2G , IPSec, SIGCOMP protocols development etc. for 9 years. Then switched to education industry in 2013 and is currently teaching the B.Tech and M. Tech students of the School of Computer Engineering, KIIT(Deemed to be University). He holds a PhD degree in Computer Science and Engineering. Profile LinksEmail :[email protected] Social LinksProfileRecent PublicationsProfileResearch Interests Wireless Network Communication Blockchain, IoT Administrative ResponsibilityAssistant Controller of ExaminationRecent PublicationsJournals/Conferences : Manas Ranjan Lenka, Amulya Ratna Swain, “An Efficient Dynamic Slot Scheduling Algorithm for WSN MAC: A Distributed Approach” in Scalable Computing: Practice and Experience, Volume 21, 2020  Subhasis Dash, Kumar Saras, Manas Ranjan Lenka, Amulya Ratna Swain, “Multi-Token Based MAC-Cum-Routing Protocol for WSN: A Distributed Approach” in Journal of Communications Software and Systems (JCOMSS), Volume:15, 2019  Manas Ranjan Lenka, Amulya Ratna Swain, Biraja Prasad Nayak, “A Hybrid based Distributed Slot Scheduling Approach for WSN MAC” in Journal of Communications Software and Systems (JCOMSS), Volume:15, 2019  Manas Ranjan Lenka, Amulya Ratna Swain and Manmath Narayanan Sahoo, “Distributed Slot Scheduling Algorithm for Hybrid CSMA/TDMA MAC in Wireless Sensor Networks”, 11 th IEEE International Conference on Networking, Architecture and Storage (NAS-2016), Long Beach, CA, USA, 2016.  Saroj Kumar Rout, Ashray Mehta, Amulya Ratna Swain, Amiya Kumar Rath, Manas Ranjan Lenka, “Algorithm aspects of dynamic coordination of beacons in localization of Wireless Sensor Networks”, Accepted for publication in 2015 International Conference on Computer Graphics, Vision and Information Security (CGVIS).  Nachiketa Tarasia, Manas Ranjan Lenka, Amulya Ratna Swain,“Energy Efficient Extended Coverage in Wireless Sensor Networks”, Accepted for publication in The 29th IEEE International Conference on Advanced Information Networking and Applications (AINA- 2015),Gwangju, Korea, 2015.  Tarini Mishra, Alok Ranjan Panda, Manas Ranjan Lenka, Debabrata Mahapatra and Amulya Ratna Swain, “Energy Efficient Coverage and Connectivity with Varying Energy Level in WSN”, Accepted for publication in The 1st conference on Computational Intelligence and Networks (CINE-2015), Bhubaneswar, India, 2015.  Hemendra Kumar Sethi, Sasmita Dash, Manas Ranjan Lenka, Amulya Ratna Swain, “Incremental Model for Complete Area Coverage in Wireless Sensor Networks” Accepted for publication in The 1st conference on Computational Intelligence and Networks(CINE- 2015), Bhubaneswar, India, 2015.Books :Satya Ranjan Dash, Manas Ranjan Lenka, Kuan-Ching Li, Esaú Villatoro-Tello, “Intelligent Technologies: Concepts, Applications, and Future Directions” in Studies in Computational Intelligence, 2022 sachi2025-05-30T13:06:28+05:30 Page load link Go to Top",
  "content_length": 3255,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:23"
}