{
  "name": "Manas Mukul",
  "homepage": "https://ksca.kiit.ac.in/profiles/manas-mukul",
  "status": "success",
  "content": "Manas Mukul – School of Computer Applications Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Manas Mukul Manas Mukul Manas Mukul Associate ProfessorManas Mukul has over 15 years of work experience out of which he has worked for 7 years in the IT Sector and the remaining in academics and research. He has worked in the field of Application Development and Maintenance performing roles of developer, project lead, onsite coordinator, business analyst, training and delivery manager. He is currently working as an Associate Professor in Kalinga Institute of Industrial Technology (KIIT), Bhubaneswar. His areas of teaching and research include Object Oriented Design and Programming, Software Engineering, Global Positioning Systems and GIS. He has numerous research publication in high impact international journals published by Springer, Elsevier and Nature. Profile LinksEmail :[email protected]Scopus Id :56800641900 Social LinksProfileRecent PublicationsProfileEducational QualificationPhDAdministrative ResponsibilityDean, International Students and Associate Dean, Training and Placement(SCA)MembershipsIndian Science CongressOutreach ActivityArt of GivingRecent PublicationsJournals/Conferences :Mukul, Manas, et al. \"\"Uncertainties in the shuttle radar topography mission (SRTM) Heights: Insights from the indian Himalaya and Peninsula.\"\" Scientific reports 7 (2017): 41672. Mukul, Manas, Vinee Srivastava, and Malay Mukul. \"\"Analysis of the accuracy of shuttle radar topography mission (SRTM) height models using international global navigation satellite system service (IGS) network.\"\" Journal of Earth System Science 124.6 (2015): 1343-1357. Mukul, Manas, Vinee Srivastava, and Malay Mukul. \"\"Accuracy analysis of the 2014–2015 Global Shuttle Radar Topography mission (SRTM) 1 arc-sec C-Band height model using international Global Navigation Satellite System Service (IGS) network.\"\" Journal of Earth System Science 125.5 (2016): 909-917. Srivastava, Vinee, Manas Mukul, and Malay Mukul. \"\"Quaternary deformation in the Gorubathan recess: Insights on the structural and landscape evolution in the frontal Darjiling Himalaya.\"\" Quaternary International 462 (2017): 138-161. Mukul, Manas, Vinee Srivastava, and Malay Mukul. \"\"Out-of-sequence reactivation of the Munsiari thrust in the Relli River basin, Darjiling Himalaya, India: Insights from Shuttle Radar Topography Mission digital elevation model-based geomorphic indices.\"\" Geomorphology 284 (2017): 229-237. Srivastava, Vinee, et al. \"\"Geometry and kinematics of Main Frontal thrust-related fault propagation folding in the Mohand Range, northwest Himalaya.\"\" Journal of Structural Geology 115 (2018): 1-18. sachi2020-05-13T13:17:27+05:30 Page load link Go to Top",
  "content_length": 2790,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:24"
}