{
  "name": "Manas Khatua",
  "homepage": "http://manaskhatua.github.io",
  "status": "success",
  "content": "Manas Khatua Dr. Manas Khatua Associate Professor Computer Science and Engineering Indian Institute of Technology Guwahati Guwahati, Assam, India - 781039. manaskhatua[at]iitg[dot]ac[dot]in manaskhatua[at]gmail[dot]com BIOGRAPHY:: Dr. Manas Khatua is working as Associate Professor in the Department of Computer Science and Engineering at Indian Institute of Technology Guwahati since 2024. Prior to this, he was an Assistant Professor in the same department from 2018 to 2024. He was also an Assistant Professor in the Dept. of CSE at Indian Institute of Technology Jodhpur from 2016 to 2018. Before joining in teaching profession, he worked as Post-Doctoral Research Fellow in Singapore University of Technology and Design, and Assistant System Engineer in Tata Consultancy Services Kolkata. He received his Ph.D. from Indian Institute of Technology Kharagpur in 2016. His primary research interests are in the domain of Networks, specifically Internet of Things, Wireless Networks, Sensor Networks, Network Security, Cloud and Edge Computing, Cyber Physical Systems and Network Performance Evaluation. He is the author of many scholarly research papers, including reputed journal papers, in the above mentioned areas. :: COURSE on Internet of Things (IoT) :: Developed an elective course on IoT at IIT Guwahati. CS578: Internet of Things SERB Karyashala IoT Project Demo in Samsung Lab IoT Class by Samsung R&D Institute Hands-on Session in IoT Workshop Lecture in IoT Workshop Project Demo: Interactive IoT Project Demo: Glucose Monitoring Guest Lecture at TIT, Agartala News 2025 2024 2023 2022 2021 2020 July ★Congratulations Karnish for receiving the PhD Degree! May ★Congratulations Soumya for paper acceptance in Ad Hoc Networks (Elsevier) and successfully completing PhD Synopsis Seminar. April ★Congratulations to Karnish for paper acceptance in Ad-Hoc Networks (Elsevier). January ★Congratulations to Soumya for receiving Best Paper Award in IEEE COMSNETS 2025 Workshop (SAMAT). December ★Congratulations to Soumya for paper acceptance in IEEE COMSNETS 2025 Workshop (SAMAT). October ★Congratulations to Soumya for paper acceptance in IEEE COMSNETS 2025. ★Congratulations to Surja for paper acceptance in IEEE ANTS 2024. ★Congratulations to Sreeparna and Pratik for paper acceptance in IEEE ANTS 2024. July ★Congratulations to Soumya for paper acceptance in IEEE Transactions on Mobile Computing. January ★Congratulations to Karnish for paper acceptance in Ad Hoc Networks journal (Elsevier). October ★Congratulations to Karnish for poster paper acceptance in Proc. of COMSNETS 2024. ★Congratulations to Karnish and Aditya for paper acceptance in Proc. of INDICON 2023. ★Congratulations to Soumya for paper acceptance In IEEE Transactions on Mobile Computing 2023. May ★Organizing Hands-on Workshop on Power Electronics Hardware Design with Microcontroller Programming sponsored by SERB (scheme: Accelerate Vigyan, Karyashala) from 24th to 30th June 2023 at IIT Guwahati. January ★Congratulations to Karnish and Priyanshu for paper acceptance In Proc. of ICSTE 2023, NIT Manipur. ★Congratulations to Alakesh for paper acceptance in IEEE Transactions on Mobile Computing, 2023. ★Congratulations to Alakesh for paper acceptance in IEEE Internet of Things Journal, 2023. ★ Congratulations to Alakesh for winning the prestigious Indian National Academy of Engineering (INAE) Innovative Student Projects Award 2022 (in Doctoral level) for his Ph.D. Thesis. August Full paper with Soumya accepted in IEEE 8th World Forum on Internet of Things 2022 May Paper with Alakesh accepted in ACM Transactions on Internet of Things Delivered guest lecture in the High-End Workshops on \"The Role of AI in IoT and WAHN\" organized by Dept. of CSE, IIT Ropar. February Paper with Alakesh accepted in IEEE Communications Letters Delivered guest lecture in the Joint FDP on IoT & Applications (Smart Systems), organized by E&ICT Academics of IIT Guwahati, NIT Patna, IIT Kanpur, MNIT Jaipur, IIT Roorkee & IIITDM Jabalpur. January Delivered guest lecture in Research & Industrial Conclave 2022, organized by IIT Guwahati. September 30 Paper with Karnish accepted in ACM ICDCN 2022 August 19 Guest Lecture in the event \"IRN 2021\" organized by Samsung R&D Institute India-Bangalore (SRI-B) as a part of SRI-B's 25 years celebrations. July 25 Paper with Alakesh accepted in IEEE Internet of Things Journal (5-Year IF: 11.7) May 3 Paper with Alakesh accepted in IEEE Internet of Things Journal (5-Year IF: 11.7) February 18 Paper with Alakesh accepted in IEEE Internet of Things Journal (5-Year IF: 11.7) October Paper with Alakesh accepted in ACM Transactions on Internet of Things March Paper with Alakesh accepted in IEEE Transactions on Mobile Computing Paper with Dipanwita accepted in Journal of Network and Computer Applications (Elsevier) February Organized an International Conference at IIT Guwahati. Third ISEA Conference on Security and Privacy 2020 January Guest lecture on \"Internet of Things - A Paradigm Shift towards Smart & Connected Things\" & hands-on demo using ESP8266 & LoRaWAN at Tripura Institute of Technology, Agartala. Research Interests Internet of Things Wireless Networks Sensor Networks Network Security Cloud and Edge Computing Cyber Physical Systems My Research Works My Present Research Wroks IoT Networks & Applications Research Lab Components of IoT Testbed in the Research Lab Work Experience Present: Associate Professor, Dept. of CSE, IIT Guwahati 2018-2024: Assistant Professor, Dept. of CSE, IIT Guwahati 2016-2018: Assistant Professor, Dept. of CSE, IIT Jodhpur 2015-2016: Post-Doctoral Research Fellow, SUTD, Singapore 2010-2013: Senior Research Fellow, SRIC, IIT Kharagpur 2008-2010: Assistant System Engineer, Tata Consultancy Services Ltd. 2008-2008: Sr. Lecturer, Dept. of IT, Dr. B.C.Roy Engineering College 2005-2008: Lecturer, Dept. of CSE, Bankura Unnayani Institute of Engg. 2003-2004: Faculty at Bakhrabad Bharati Vidyapith, West Bengal Education 2016: Ph.D. (Wireless Networks) from IIT Kharagpur 2007: M.Tech. (IT) from BESU (presently known as IIEST), Shibpur 2003: B.Tech. (CSE) from University of Kalyani, West Bengal Guest Lecture / Seminar July, 2025: Guest lecture on \"AI in Cyber Security\" in the Summer School on Language and Vision with AI / ML (LAVA) organised by Multimedia Lab, Dept. of CSE, IIT Guwahati under the IIT Guwahati Technology Innovation and Development Foundation (IITG-TIDF) (TIH Division), IIT Guwahati. February, 2025: Guest lecture on \"IoT Network and Cyber Security\" in the FDP on \"5G-V2X and Network Security\", jointly organised by Information Security Education and Awareness (ISEA) Phase-III Program and Dept. of CSE, IIT Guwahati. January, 2025: Guest lecture on \"Deep Learning in Cyber Security\" in the Winter School on Deep Learning for Vision and Language Modelling, 2025, organised by IIT Guwahati Technology Innovation and Development Foundation (IITG-TIDF). July, 2024: Guest lecture on \"IoT and Edge Intelligence – Research Road-map & Challenges\" in the Intel Unnati Ignite Online Workshop on Beyond the Cloud: Unleashing the Power of Edge Computing. November, 2022: Guest lecture on \"SCADA Security: Use Cases & Capabilities\" in the Management Development Programme on \"Industrial Artificial Intelligence in Industry 4.0\", organized by the Dept. of Mechanical Engineering, IIT Guwahati. May, 2022: Guest lecture on \"IoT Protocols : Data & Network\" in the High - End Workshop on \"The Role of Artificial Intelligence in IoT and Wireless Adhoc Networks\", organized by the Dept. of CSE, IIT Ropar. February, 2022: Guest lecture on \"IoT Protocols : Data & Network\" in the Joint FDP on IoT & Applications (Smart Systems), organized jointly by E&ICT Academics of IIT Guwahati, NIT Patna, IIT Kanpur, MNIT Jaipur, IIT Roorkee & IIITDM Jabalpur. January, 2022: Guest lecture on \"IoT and Edge Intelligence – Research Road-map & Challenges\" in the Research & Industrial Conclave 2022, organized by IIT Guwahati. November, 2021: Guest lecture on \"6TiSCH IoT Network: Formation, Challenges, and Recent Advancements\" in the CNI Lecture Series Program organized by Centre for Networked Intelligence under the divisions of EECS and RBCCPS, Indian Institute of Science, Bangalore. September, 2021: Guest lecture on \"Network Formation in 6TiSCH-based IoT Networks: Challenges, Open Issues, and Recent Advancement\" in the Faculty Development Program organized by Dept. of Electronics & Communication Engineering, North Eastern Regional Institute of Science and Technology (NERIST). August, 2021: Guest lecture on \"Research Challenges in IoT\" in the Faculty Development Program organized by Dept. of Computer Science and Engineering, National Institute of Technology Silchar. August, 2021: Guest lecture on \"Network Plug-and-Play in Industrial IoT: Network Formation Challenges and Solutions\" in the event \"IRN 2021\" organized by Samsung R&D Institute India-Bangalore (SRI-B). July, 2021: Guest lecture on \"Research Challenges in IoT\" in the Faculty Development Program organized by Dept. of Electronics & Communication Engineering, Vignan’s Institute of Engineering for Women, Visakhapatnam. March, 2021: Guest lecture on \"Research Challenges in IoT\" in the AICTE sponsored five-days online Short Term Training Program on “Internet-of-Things: Building Blocks, Enabling Technologies, and Applications” organized by National Institute of Technology Meghalaya. January, 2021: Presented a Seminar on \"IoT with Automation\" in the Research for Resurgence Virtual Seminar Series on “Robotics, Automation, & Drones” organized by R&D Section, IIT Guwahati. December, 2020: Participated as a panellist in a discussion on \"SCADA Security: Use Cases & Capabilities\" organised by NASSCOM-DSCI AISS 2020. November, 2020: Guest lecture on \"Cloud - A Ubiquitous Asset of IoT Ecosystem\" in the \"Certificate Course on Cloud Computing\" jointly organized by Rajiv Gandhi National Institute of Youth Development (RGNIYD), Tamil Nadu, and National Institute ",
  "content_length": 14682,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:19"
}