{
  "name": "Manal E. Helal",
  "homepage": "https://www.surrey.ac.uk/people/manal-helal",
  "status": "success",
  "content": "Computer science members | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all PeopleWe are a friendly group of academic staff, research staff, tutors and administrators, with additional dedicated staff within the Faculty and the University to support us.We are also proud to have strong links with people in industry who provide support for our activities through our Industrial Advisory Board or through guest lectures in our undergraduate or postgraduate modules. Our staff and studentsFind out more about our staff and students and get in contact. Academic staff Research staff Emeritus staff Postgraduate research students Visiting staff Professional services staff",
  "content_length": 1979,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:19"
}