{
  "name": "Manar Alalfi",
  "homepage": "https://www.cs.torontomu.ca/~manar.alalfi",
  "status": "success",
  "content": "Generic Research Lab Template - Home Home People Research Tools Publications Teaching Contact Ryerson's University Beautiful Campus Main Building Photo Welcome to Ryerson's CRESSET Research Laboratory Welcome to Ryerson's CRESSET Research Laboratory Welcome to Ryerson's CRESSET Research Laboratory ‹ › Creative Research in Security and Software Engineering Technology, led my Dr. Alalfi, conducts an internationally recognized research in the area of Software Quality Assurance, Software Security and Vulnerability Analysis. Software Analytics and BigData, and Model Driven Engineering. CRESSET Lab is lead by Dr. Manar H. Alalfi, an Assistant Professor in Software Engineering at Ryerson University, Computer Science Department, and an Adjunct Assistant Professor at Queen’s School of Computing, Software Technology Lab, Canada. She received her Ph.D. from Queen’s in 2010 where she was honored with the Queen’s School of Computing research achievement award for her PhD thesis work on \"A verification framework for access control in web applications\". Her PhD work was awarded the Google Community award in 2008. Dr. Alalfi has around 15 years’ experience leading research projects and training graduate students in the broad area of Software Engineering and its synergy with diverse research areas including: Data Analytics, Model Driven Engineering (MDE) for Web applications Security Analysis, MDE for Automotive Systems, Scientific Software Engineering, and Mining Software Repositories. She has published her research results in highly reputed international journals and conferences, and served as a reviewer for multiple premier conferences and journals in software engineering. Dr. Alalfi has around eight years teaching experience at the undergraduate and graduate levels and taught several courses at Queen’s University, KAUST, Alfaisal University, and the Hashemite University. She has more than ten years research and software development experience in leading roles at Queen’s University, KAUST, Alfaisal University and the University of Alberta. Prior to joining RU, she was an Assistant Professor in Software Engineering at Alfaisal university, before that, she was a senior research scientist for the Network on Engineering Complex Software Intensive Systems for Automotive Systems (NECSIS), a $16.6 million Canadian research network. The project is partnered with General Motors, IBM, Malina Software and led by eight world-leading software engineering research institutions in North America. Dr. Alalfi is a professional member of the ACM and IEEE Computer Society. I currently have several open research positions for MSc, PhD and Summer students. Interested applicants, in my area of research, may contact me with their CV and transcripts. For admission requirements and application process refer to the following page. Research Areas Model Driven Engineering CyberSecurity Software Maintenance and Evolution Models, Data, and Software Analytics Security and Privacy Testing and Verification Models and Code Clone detection",
  "content_length": 3045,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:20"
}