{
  "name": "Mandar Mitra",
  "homepage": "https://www.isical.ac.in/~mandar",
  "status": "success",
  "content": "Mandar Mitra's Home Page Mandar Mitra Professor Computer Vision and Pattern Recognition Unit Indian Statistical Institute 203 B.T. Road Kolkata 700 108. Email: my first name at isical.ac.in or my first name dot my last name at gmail dot com Content updated first on mandarm.github.io; should propagate to the mirror at ISI every hour. Teaching | Information Retrieval | Presentations | Dictionaries Information Retrieval Textbooks, etc. Introduction to Information Retrieval Manning, Raghavan and Schutze, Cambridge University Press, 2008. Search Engines Information Retrieval in Practice W. Bruce Croft, D. Metzler, T. Strohman, Pearson, 2009. Information Retrieval Implementing and Evaluating Search Engines Stefan Büttcher, Charles L. A. Clarke and Gordon V. Cormack, MIT Press, 2010. A comprehensive survey by Ed Greengrass Modern Information Retrieval Baeza-Yates and Ribeiro-Neto, Addison Wesley, 1999. Courses/Teachers James Allan, UMass, Amherst (Information Retrieval, Web Search) Jamie Callan, CMU Soumen Chakrabarti, IIT, Bombay Norbert Fuhr, University of Duisburg Essen Marti Hearst, UC, Berkeley Raymond Mooney, UT, Austin Prabhakar Raghavan, Stanford University Stephen Robertson, City University London Theo van der Weide, Nijmegen Institute for Computing and Information Sciences ChengXiang Zhai UIUC Tutorials Experimental methods for information retrieval (Donald Metzler and Oren Kurland, SIGIR 2012) Statistical Significance Testing in Theory and in Practice (Ben Carterette, SIGIR 2014) Some research groups CIIR, UMass, Amherst LTI, CMU NLP and IR group, NIST University of Glasgow Colleagues Prasenjit Majumder Sukomal Pal Dipasree Pal Ayan Bandyopadhyay Dwaipayan Roy H.B. Bij Blogs Concepts of Information Retrieval -- UT Austin INF384H (Fall 2013) Conference proceedings ACM SIGIR TREC WWW CIKM Software resources Bow Toolkit GATE Lemur MG4J Okapi Terrier Datasets Microsoft Research Open Data Misc. links WebIR www.informationretrieval.org Local events International Workshop on Research Issues in Digital Libraries (12-15 December, 2006) FIRE (Forum for Information Retrieval Evaluation) GNU/Linux tips for newbies Learning the Shell LINUX: Rute User's Tutorial and Exposition (local copy, dl-ed from here, timestamped 1999-09-22) Ubuntu Manual Unix related blog at ComputerWorld UNIX / Linux Tutorial for Beginners Spoken Tutorials Video lectures on \"Practical Unix\" @ Stanford and many more... Some files / presentations related to GNU/Linux, Latex, etc.. Feedback welcome. Development using FOSS tools Academic writing with LaTeX Preparing documents and presentations using LaTeX A latex \"header\" file that includes commonly used packages and defines some shortcuts. Online dictionaries MERRIAM-WEBSTER (adapted from B.L. Narayan's Launcher) CAMBRIDGE ONLINE DICTIONARIES (adapted from B.L. Narayan's Launcher) Enter one word that you wish to search for in the box below. For example, to search for the idiom cap in hand, type either cap or hand. Cambridge International Dictionary of English Cambridge Learner's Dictionary Cambridge Dictionary of American English Cambridge International Dictionary of Idioms Cambridge International Dictionary of Phrasal Verbs Personal Last modified: Thu Mar 28 17:03:09 IST 2024",
  "content_length": 3246,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:23"
}