{
  "name": "Maneesh Agrawala",
  "homepage": "http://graphics.stanford.edu/~maneesh",
  "status": "success",
  "content": "Maneesh Agrawala Maneesh Agrawala Stanford University Computer Science Department Brown Institute for Media Innovation Graphics | HCI | Visualization Contact Information Computation & Data Science, Room E362 Stanford, CA 94305-1248 Tel: (650) 723-2642 Admin: Andrea Brand-Sanchez Tel: (650) 723-1430 Office Hours: Thu 2-3pm (CoDa E362) Teaching Fall 2025 CS 448B: Visualization Win 2026 CS 206: Comp. Journalism Spr 2026 CS 347: HCI Foundations & Frontiers Talks & Travel Sep 17 2025 ILM, Google Meet Nov 19 2025 UC Berkeley EECS, Berkeley, CA Students, Postdocs & Visitors Maty Bohacek, Jean-Peïc Chou, Jihyeon Je, Jiaju Ma, Mia Tang, Chuan Yan, Lvmin Zhang, Sharon Zhang Alumni Sean Arietta, Adrien Bousseau, Robert Carroll, Lydia Chilton, Will Crichton, Ross Daly, Abe Davis, Ohad Fried, Shiry Ginosar, Ahna Girshick, Madeleine Grunde-McLaughlin, Alex Hall, Jonathan Harper, Jeffrey Heer, Robert Held, Enamul Hoque, Jessica Hullman, Terrell Ibanez, David Jacobs, Jennifer Jacobs, Olga Karpenko, Dae Hyun Kim, Jeongyeon Kim, Juho Kim, Kenrick Kin, Nicholas Kong, Mackenzie Leake, Janel Lee, Jingyi Li, Sean Liu, Anelise Newman, James O'Shea, Amy Pavel, Anyi Rao, Colorado Reed, Jacob Ritchie, Steve Rubin, Jason Sanders, Mira Shalah, Evan Strasnick, Anh Truong, Wesley Willett, Sofia Wyetzner, JiaXian Yao In Memoriam Floraine Berthouzoz Maneesh Agrawala is the Forest Baskett Professor of Computer Science and Director of the Brown Institute for Media Innovation at Stanford University. He is also a consulting AI Scientist at Roblox. He works on computer graphics, human computer interaction and visualization. His focus is on investigating how cognitive design principles can be used to improve the effectiveness of audio/visual media. The goals of this work are to discover the design principles and then instantiate them in both interactive and automated design tools. Honors include an Okawa Foundation Research Grant (2006), an Alfred P. Sloan Foundation Fellowship (2007), an NSF CAREER Award (2007), a SIGGRAPH Significant New Researcher Award (2008), a MacArthur Foundation Fellowship (2009), an Allen Distinguished Investigator Award (2014) and induction into the SIGCHI Academy (2021). He was named an ACM Fellow in 2022. Announcements Aug 14, 2025 FramePack is out. It's an open source video generation model that can run on 6GB GPUs and can generate thousands of frames. Oct 14, 2024 Block and Detail source code available. Sep 28, 2024 FlashTex lets you generate relightable textures for 3D models. Source code is here. Jun 21, 2024 Layer Diffuse source code released. Jointly generate transparent foreground images with corresponding backgrounds. Feb 18, 2024 Use AnimateDiff for text-to-video generation. Code available. Sep 9, 2023 ControlNet is out. Adds spatially localized control to Stable Diffusion. Version 1.0, Version 1.1, A1111 WebUI plugin. Aug 28, 2023 Released EmphasisChecker. Check if your charts and captions emphasize the same things. Mar 29, 2023 Substack post on generative AI. Unpredictable Black Boxes are Terrible Interfaces. Aug 18, 2021 Released Flipper with source code. Quilt design tool based on our foundation paper piecing project. Aug 17, 2020 Stanford Cable TV News Analyzer released. Examine who and what appears in the last decade of CNN, FOX News and MSNBC. Jan 28, 2020 Data and code for visual question answering with explanations for charts and graphs. Dec 13, 2018 Source code for dancifying video released, based on our Visual Rhythm and Beat project. Publications Efficient Autoregressive Shape Generation via Octree-Based Adaptive Tokenization Kangle Deng, Hsueh-Ti Derek Liu, Yiheng Zhu, Xiaoxia Sun, Chong Shang, Kiran Bhat, Deva Ramanan, Jun-Yan Zhu, Maneesh Agrawala and Tinghui Zhou Proc. of IEEE/CVF Int. Conf. on Computer Vision (ICCV), Oct 2025. To Appear. PDF | arXiv CineVision: An Interactive Pre-visualization Storyboard System for Director–Cinematographer Collaboration Zheng Wei, Hongtao Wu, Lvmin Zhang, Xian Xu, Yefeng Zheng, Pan Hui, Maneesh Agrawala, Huamin Qu and Anyi Rao User Interface Software and Technology (UIST), Oct 2025. To Appear. PDF | arXiv MoVer: Motion Verification for Motion Graphics Animations Jiaju Ma and Maneesh Agrawala ACM Transactions on Graphics (SIGGRAPH), 44(4), August 2025. pp. 33:1-33:17. PDF | arXiv | Source Code and Dataset | BibTeX Instance Segmentation of Scene Sketches Using Natural Image Priors Mia Tang, Yael Vinker, Chuan Yan, Lvmin Zhang and Maneesh Agrawala ACM SIGGRAPH, August 2025. pp. 96:1-96:10. PDF | arXiv | Source Code and Dataset | BibTeX Generating Past and Future in Digital Painting Processes Lvmin Zhang, Chuan Yan, Yuwei Guo, Jinbo Xing and Maneesh Agrawala ACM Transactions on Graphics (SIGGRAPH), August 2025. pp. 127:1-127:13. PDF | V1 Model | V2 Model | BibTeX VideoRepainter: Keyframe-Guided Creative Video Inpainting Yuwei Guo, Ceyuan Yang, Anyi Rao, Chenlin Meng, Omer Bar-Tal, Shuangrui Ding, Maneesh Agrawala, Dahua Lin and Bo Dai Computer Vision and Pattern Recognition (CVPR), June 2025. pp. 13009-13020. PDF | BibTeX Scaling In-the-Wild Training for Diffusion-based Illumination Harmonization and Editing by Imposing Consistent Light Transport Lvmin Zhang, Anyi Rao and Maneesh Agrawala International Conference on Learning Representations (ICLR), Apr 2025. PDF | Code | BibTeX Oral Block and Detail: Scaffolding Sketch-to-Image Generation Vishnu Sarukkai, Lu Yuan, Mia Tang, Maneesh Agrawala and Kayvon Fatahalian User Interface Software and Technology (UIST), Oct 2024. pp. 33:1-33:13. PDF | arXiv | YouTube | Source Code | Demo | BibTeX ScriptViz: A Visualization Tool to Aid Scriptwriting based on a Large Movie Database Anyi Rao, Jean-Peïc Chou and Maneesh Agrawala User Interface Software and Technology (UIST), Oct 2024. pp. 21:1-21:13. PDF | arXiv | MP4 | BibTeX FlashTex: Fast Relightable Mesh Texturing with LightControlNet Kangle Deng, Tim Omernick, Alexander Weiss, Deva Ramanan, Jun-Yan Zhu, Tinghui Zhou and Maneesh Agrawala Proc. of Eur. Conf. on Computer Vision (ECCV), Oct 2024. pp. 90-107. PDF | arXiv | Source Code | BibTeX SparseCtrl: Adding Sparse Controls to Text-to-Video Diffusion Models Yuwei Guo, Ceyuan Yang, Anyi Rao, Maneesh Agrawala, Dahua Lin and Bo Dai Proc. of Eur. Conf. on Computer Vision (ECCV), Oct 2024. pp. 330-348. PDF | arXiv | Source Code | BibTeX Transparent Image Layer Diffusion using Latent Transparency Lvmin Zhang and Maneesh Agrawala ACM Transactions on Graphics (SIGGRAPH), 43(4), July 2024. pp. 100:1-100:15. PDF | arXiv | Source Code | BibTeX A Unified Differentiable Boolean Operator With Fuzzy Logic Hsueh-Ti Derek Liu, Maneesh Agrawala, Cem Yuksel, Tim Omernick, Vinith Misra, Stefano Corazza, Morgan McGuire and Victor Zordan ACM SIGGRAPH, July 2024. pp. 109:1-109:9. PDF | Source Code | BibTeX STIVi: Turning Perspective Sketching Videos into Interactive Tutorials Capucine Nghiem, Adrien Bousseau, Mark Sypesteyn, Jan Willem Hoftijzer, Maneesh Agrawala and Theophanis Tsandilas Graphics Interface, 2024. PDF | Supplemental Material | YouTube | BibTeX Bridging the Gulf of Envisioning: Cognitive Design Challenges in LLM Interfaces Hariharan Subramonyam, Roy Pea, Christopher Pondoc, Maneesh Agrawala and Colleen Seifert ACM Human Factors in Computing Systems (CHI), 2024. pp. 1039:1-1039:19. PDF | BibTeX AnimateDiff: Animate Your Personalized Text-to-Image Diffusion Models without Specific Tuning Yuwei Guo, Ceyuan Yang, Anyi Rao, Zhengyang Liang, Yaohui Wang, Yu Qiao, Maneesh Agrawala, Dahua Lin and Bo Dai International Conference on Learning Representations (ICLR), May 2024. PDF | Code | BibTeX Spotlight Paper EmphasisChecker: A Tool for Guiding Chart and Caption Emphasis Dae Hyun Kim, Seulgi Choi, Juho Kim, Vidya Setlur and Maneesh Agrawala IEEE Trans. on Visualization and Computer Graphics (INFOVIS), 30(1), Jan 2024. pp. 120-130. PDF | MP4 (Usage Scenario) | ZIP (Supplemental) | Code | BibTeX Editing Motion Graphics Video via Motion Vectorization and Transformation Sharon Zhang, Jiaju Ma, Jiajun Wu, Daniel Ritchie and Maneesh Agrawala ACM Transactions on Graphics (SIGGRAPH Asia), 42(6), Dec 2023. pp. 229:1-229:13. PDF | YouTube | Supplemental PDF | BibTeX Adding Conditional Control to Text-to-Image Diffusion Models Lvmin Zhang, Anyi Rao and Maneesh Agrawala Proc. of IEEE/CVF Int. Conf. on Computer Vision (ICCV), Oct 2023. pp. 3836-3847. PDF | arXiv | Supplemental PDF | Code V1 | Code V1.1 | A1111 WebUI plugin | BibTeX Marr Prize (Best Paper Award) TaleStream: Supporting Story Ideation with Trope Knowledge Jean-Peïc Chou, Alexa Siu, Nedim Lipka, Ryan Rossi, Franck Dernoncourt and Maneesh Agrawala User Interface Software and Technology (UIST), Oct 2023. pp. 52:1-52:12. PDF | YouTube | BibTeX Automated Conversion of Music Videos into Lyric Videos Jiaju Ma, Anyi Rao, Li-Yi Wei, Rubaiat Habib Kazi, Hijung Valentina Shin and Maneesh Agrawala User Interface Software and Technology (UIST), Oct 2023. pp. 13:1-13:11. PDF | Vimeo | Supplemental Website | BibTeX Tree-Structured Shading Decomposition Chen Geng, Hong-Xing Yu, Sharon Zhang, Maneesh Agrawala and Jiajun Wu Proc. of IEEE/CVF Int. Conf. on Computer Vision (ICCV), Oct 2023. pp. 488-498. PDF | YouTube | BibTeX SlideSpecs: Automatic and Interactive Presentation Feedback Collation Jeremy Warner, Amy Pavel, Tonya Nguyen, Maneesh Agrawala and Björn Hartmann Intelligent User Interfaces (IUI), Mar 2023. pp. 695-709. PDF | YouTube | Demo | Code | BibTeX Sketch-Based Design of Foundation Paper Pieceable Quilts Mackenzie Leake, Gilbert Bernstein and Maneesh Agrawala User Interface Software and Technology (UIST), Oct 2022. pp. 21:1-21:11. PDF | MP4 | YouTube | Supplemental Results | BibTeX Measuring Compositional Consistency for Video Question Answering Mona Gandhi, Mustafa Omer Gul, Eva Prakash, Madeleine Grunde-McLaughlin, Ranjay Krishna and Maneesh Agrawala Computer Vision and Pattern Recognition (CVPR), 2022. pp. 5046-5055. PDF | Dataset | BibTeX Disentangled3D: Learning a 3D Generative Model with Di",
  "content_length": 47986,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:23"
}