{
  "name": "Manfred Tscheligi",
  "homepage": "https://hci.sbg.ac.at/person/tscheligi",
  "status": "success",
  "content": "Manfred Tscheligi - hci.plus Manfred Tscheligi Univ-Prof. Dr. Manfred Tscheligi is one of the key persons involved in developing the field, a distinguished speaker at conferences, workshops, tutorials and seminars, and the author of many publications. He has been initiating and managing a broad variety of research and industrial projects and initiatives within Austria and on the international level. Being a member of various national and international expert, advisory, and conference committees (e.g., CHI conference series, Mobile HCI conference series, Human-Robot Interaction conference series), his work is based mainly on the interdisciplinary synergy of different fields to enrich the interaction between humans and systems. Dr. Tscheligi holds a Master’s Degree in Business Informatics and a PhD in Social and Economic Science with a specialization in Applied Computer Science. Since coming to Salzburg he has been holding several positions in relation to the development of the research group on Human-Computer Interaction (e.g. (Co)-Director of the former ICT&S Center, Co-Head of the Department of Computer Sciences). In an established cooperation he is also heading the Center for Technology Experience at the Austrian Institute of Technology (AIT) in Vienna. Contact Univ. - Prof. Dr. Manfred Tscheligi Center for Human-Computer Interaction University of Salzburg Jakob-Haringer-Straße 8 / Techno 5 5020 Salzburg, Austria Phone: +43 662 8044 4800 E-Mail: *protected email* News MTI-Journal Special Issue 'Automotive User Interfaces' We are very happy to announce a Special Issue on Automotive User Interfaces for the MTI (Multimodal Technologies and Interaction) Open Access Journal. The overall goal of this Special Issue is to explore and evaluate automotive user interfaces, interaction design, and user experience. It targets original and scientifically-grounded research, as well as design-oriented research undertaken […] more show more news Research Activities Fabrication Experience Lab Studio 3 Human-Robot Interaction Car Interaction Lab Enhancing Life Experience Computer Supported Cooperation Embodied Interaction Material & Experiential Foundations Contextual Persuasion Publications 2024Bechinie, C., Kröninger, L., Puthenkalam, J., Tscheligi, M., & Zafari, S. (Ed.) (2024, Mar 20). Toward Human-centered Intelligent Assistance Systems in Manufacturing: Challenges and Potentials for Operator 5.0: International Conference on Industry 4.0 and Smart Manufacturing (ISM). Elsevier Procedia. https://doi.org/10.1016/j.procs.2024.01.156.Gutierrez Maquilon, R. A., Regal, G., Schrom-Feiertag, H. G., Schuster, B., Tscheligi, M., & Uhl, J. C. (Ed.) (2024, May 11). Choosing the Right Reality: A Comparative Analysis of Tangibility in Immersive Trauma Simulations: CHI 2024: ACM CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery (ACM). https://doi.org/10.1145/3613904.3641912Gutierrez Maquilon, R. A., Uhl, J. C., Schrom-Feiertag, H. G., & Tscheligi, M. (2024). Integrating GPT-Based AI into Virtual Patients to Facilitate Communication Training Among Medical First Responders: Usability Study of Mixed Reality Simulation. JMIR Formative Research, 8. https://doi.org/10.2196/58623Jaspaert, E., Murtinger, M., Kriglstein, S., Tscheligi, M., & Nguyen, H. Q. H. (Ed.) (2024, Jun). CoLEBricks: Co-Designing Virtual Reality Scenarios with Generative Building Blocks: 17th International Conference on Advanced Visual Interfaces (AVI 2024). Association for Computing Machinery (ACM). https://doi.org/10.1145/3656650.3656686Papagni, G., Zafari, S., Schrammel, J., & Tscheligi, M. (2024). Automating Logistics Operations: Qualitative Insights from Four European Sites. Logistics, 8(4). https://doi.org/10.3390/logistics8040114Pretolesi, D., Zechner, O., Garcia Guirao, D., Schrom-Feiertag, H. G., Tscheligi, M., Nakamatsu, K. (Ed.), Patnaik, S. (Ed.), & Kountchev, R. (Ed.) (2024, Mar 20). AI-Supported XR Training: Personalizing Medical First Responder Training: 2023 7th International Conference on Artificial Intelligence and Virtual Reality (AIVR 2023). Springer Singapore. https://doi.org/10.1007/978-981-99-9018-4_25Regal, G., Smit, D., França, N. C., Fuchsberger, V., & Tscheligi, M. (2024). Making It Work—Experiences of Women Who Engage in Technological Making at Home. Interacting with Computers, 36(1), 30-47. https://doi.org/10.1093/iwc/iwae011Zafari, S., Steiner, F., Huber, M., Kassem, K. K. M., Zips, P., & Tscheligi, M. (2024, Nov 24). A Gesture-based Interactive System for Automated Material Handling Vehicles: Implementation and Comparative Study: 12th International Conference on Human-Agent Interaction (HAI 2024). Association for Computing Machinery (ACM). https://doi.org/10.1145/3687272.3688304Zechner, O., Schrom-Feiertag, H. G., Tscheligi, M., & Pretolesi, D. (Ed.) (2024, Dec 24). Can I Trust You? Exploring the Impact of Misleading AI Suggestions on User’s Trust: 2024 IEEE International Conference on Metrology for eXtended Reality, Artificial Intelligence and Neural Engineering - IEEE MetroXRAINE 2024. IEEE Explore. https://doi.org/10.1109/MetroXRAINE62247.2024.10796402Zechner, O., Schrom-Feiertag, H. G., Wespi, R., Pretolesi, D., Nguyen, H. Q. H., & Tscheligi, M. (2024). Enhancing Mixed Reality Simulation Training Technology with Real-Time Performance Visualization: Mixed Methods Study with Medical First Responders. JMIR XR and Spatial Computing (JMXR), 1. https://doi.org/10.2196/576552023Anzur, Z., Fröhlich, P., Mirnig, A., Tscheligi, M., & Motnikar, L. (Ed.) (2023, Jul). Beyond Detection: Intervention Approaches in Driver State Monitoring Systems: 14th International Conference on Applied Human Factors and Ergonomics (AHFE 2023) and the Affiliated Conferences. AHFE International. https://doi.org/10.54941/ahfe1003829Fröhlich, P., Baldauf, M., Palanque, P., Roto, V., Paternò, F., Ju, W., & Tscheligi, M. (2023). Intervening, Teaming, Delegating: Creating Engaging Automation Experiences. In CHI 2023 - ACM CHI Conference on Human Factors in Computing Systems Association for Computing Machinery (ACM). https://doi.org/10.1145/3544549.3573799Gafert, M., Mirnig, A., Fröhlich, P., Kraut, V., Anzur, Z., & Tscheligi, M. (2023). Effective remote automated vehicle operation: a mixed reality contextual comparison study. PERSONAL AND UBIQUITOUS COMPUTING, 27, 2321-2338. https://doi.org/10.1007/s00779-023-01782-5Gerdenitsch, C., Bieg, T., Gaitsch, M., Schörpf, P., Tscheligi, M., & Kriglstein, S. (2023, Sept 20). Tracking to Success? A Critical Reflection on Workplace Quantified-Self Technologies from a Humanistic Perspective: CHIWORK 2023: Annual Meeting on Human-Computer Interaction for Work. Association for Computing Machinery (ACM). https://doi.org/10.1145/3596671.3597653Gerdenitsch, C., Wurhofer, D., & Tscheligi, M. (2023). Working Conditions and Cybersecurity: Time Pressure, Autonomy and Threat Appraisal Shaping Employees’ Security Behavior. Cyberpsychology: Journal of Psychosocial Research on Cyberspace, 17(4). https://doi.org/10.5817/CP2023-4-7Himmelsbach, J., Hochleitner, W., Schneider, A., Schwarz, S., Sellitsch, D., & Tscheligi, M. (2023, Apr 14). Relatedness for Moral Courage: Game Experience Dimensions as Persuasive Strategies for Moral Courage in Contrast to Other Facets of Altruistic Behavior: 18th International Conference on Persuasive Technology (PERSUASIVE 2023). Springer, Cham. https://doi.org/10.1007/978-3-031-30933-5_21Mirnig, A., Fröhlich, P., Zafari, S., Gafert, M., Kröninger, L., & Tscheligi, M. (2023). A design space for automated material handling vehicles. Frontiers Robotics AI, 10. https://doi.org/10.3389/frobt.2023.1276258Nguyen, H. Q. H., Hill, Y., Murtinger, M., Tscheligi, M., & Uhl, J. C. (Ed.) (2023, Oct). xHits: An Automatic Team Performance Metric for VR Police Training: 2023 IEEE MetroXRAINE - International Conference on Metrology for eXtended Reality, Artificial Intelligence and Neural Engineering. IEEE. https://doi.org/10.1109/MetroXRAINE58569.2023.10405600Pretolesi, D., Jaspaert, E., Garcia Guirao, D., Tscheligi, M., & Zechner, O. (Ed.) (2023, Oct). Ethical Considerations for AI-Driven Adaptive Virtual Environments in XR Training for First Responders: An Industry Perspective: 2023 IEEE MetroXRAINE - International Conference on Metrology for eXtended Reality, Artificial Intelligence and Neural Engineering. IEEE. https://doi.org/10.1109/MetroXRAINE58569.2023.10405605Pretolesi, D., Zafari, S., Tscheligi, M., & Zechner, O. (Ed.) (2023, Oct). Human in the Loop for XR Training: Theory, Practice and Recommendations for Effective and Safe Training Environments: 2023 IEEE MetroXRAINE - International Conference on Metrology for eXtended Reality, Artificial Intelligence and Neural Engineering. IEEE. https://doi.org/10.1109/MetroXRAINE58569.2023.10405775Regal, G., Gafert, M., Murtinger, M., Tscheligi, M., Uhl, J. C. (Ed.), Nocera, J. A. (Ed.), Lárusdóttir, M. K. (Ed.), Petrie, H. (Ed.), Piccinno, A. (Ed.), & Winckler, M. (Ed.) (2023, Sept). Stress Embodied: Developing Multi-sensory Experiences for VR Police Training: 19th International Conference of Technical Committee 13 (Human- Computer Interaction) (INTERACT 2023). Springer Nature Switzerland AG.Uhl, J. C., Schrom-Feiertag, H. G., Regal, G., Gallhuber, K., & Tscheligi, M. (2023, Apr 19). Tangible Immersive Trauma Simulation: Is Mixed Reality the next level of medical skills training? ACM CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery (ACM). https://doi.org/10.1145/3544548.3581292Uhl, J. C., Schrom-Feiertag, H. G., Regal, G., Hirsch, L., Weiss, Y., & Tscheligi, M. (2023). When Realities Interweave: Exploring the Design Space of Immersive Tangible XR. In 17th International Conference on Tangible Embedded and Embodied Interaction (TEI 2023) (pp. 1-4). (TEI '23). Association for Computing Machinery (ACM). https://doi.org/10.1145/3569009.3571843Uhl, J. C., Schrom-Feiertag, H. G., Murtinger, M., Tscheligi, M., & Regal",
  "content_length": 122761,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:29"
}