{
  "name": "Manik Lal Das",
  "homepage": "http://intranet.daiict.ac.in/~maniklal_das",
  "status": "success",
  "content": "HomePage of Maniklal Das Dr. Manik Lal Das PhD [ IIT Bombay ] Professor and Dean(Faculty Affairs) Office: 2103, Faculty Block 2, DA-IICT, Ganghinagar - 382007, Gujarat, India. Phone +91-79-68261617, Fax. +91-79-68261710 Email:  maniklal_das@daiict.ac.in ; maniklal@gmail.com Research Interests Publications Projects Short Bio My Resume Research Interests Cyber Security; Cryptography; Artificial Intelligence Google Scholar Profile DBLP Profile Publications Book Chapters Deepti Saraswat and Manik Lal Das and Viral A Shah. Smart Healthcare Using Evolutionary Algorithm. IoT and Smart Devices for Sustainable Environment, Springer, 155-181, 2021. Niranjan Dandekar, Amit Dua, Manik Lal Das and Viral A Shah. Supply Chain Management for Agri-Foods Using Blockchain Technology. Multidisciplinary Functions of Blockchain Technology in AI and IoT Applications, IGI Global, 46-69, 2021. Natalia Miloslavskaya, Alexander Tolstoy, Vladimir Budzko, Manik Lal Das. Blockchain Application for IoT Security Management. Essentials of Blockchain Technology, CRC Press/Taylor&Francis, 2019. Manik Lal Das, Hardik Gajera, and Viral Shah. Blockchain-powered Healthcare Insurance System. Security and Privacy of Electronic Healthcare Records Concepts, Paradigms and Solutions, IET, 2019. Manik Lal Das. Privacy and Accountability Concerns in the Age of Big Data. Big Data: Storage, Sharing, and Security, CRC Press, 2016 . Rachit Mittal, Sarita Agrawal, and Manik Lal Das. Secure Node Localization in Clustered Sensor Networks with Effective Key Revocation. Emerging Innovations in Wireless Networks and Broadband Technologies, pp.12-41, 2016. Manik Lal Das and Siva C Muraharirao. Digital Image Protection using Keyed Hash Function. Computer Vision and Image Processing in Intelligent Systems and Multimedia Technologies, pp. 203-215, 2014. Shefali Jain, Anish Mathuria, and Manik Lal Das. Misbehavior Detection in VANET: A Survey. Security, Privacy, Trust, and Resource Management in Mobile and Wireless Communications, pp. 134-147, 2014. Manik Lal Das and Aakash Joshi. Dynamic Program Update in Wireless Sensor Networks. Security in Ad-hoc and Sensor Networks, World Scientific, Vol.3, pp.369-384, 2009. V Lakshmi Narasimhan and Manik Lal Das. Security Requires Information Literacy: A Perspective on Information Security for Business, Human, Social and Systemic Security. Issues in Information and Media Literacy: Education, Practice and Pedagogy, Informing Science Press, pp. 257-286, 2009. Journals Riyanka Jena, Priyanka Singh, Manoranjan Mohanty, and Manik Lal Das. PP-PRNU: PRNU-based source camera attribution with privacy-preserving applications. Computing , Springer, 106: 3309-3333, 2024. Amit Kumar Dwivedi, Naveen Kumar, and Manik Lal Das. Edge Computing and Blockchain-Based Distributed Audit of Outsourced Dynamic Data. Wireless Personal Communications , Springer, 106: 3309-3333, 2024. Nidhi Desai, Manik Lal Das, Payal Chaudhari, Naveen Kumar. Background knowledge attacks in privacy-preserving data publishing models. Computers & Security , Elsevier, 122: 102874, 2022. Amit Kumar Dwivedi, Naveen Kumar, and Manik Lal Das. Group Data Freshness Scheme for Outsourced Data in Distributed Systems. Future Generation Computer Systems, Elsevier, 133: 141-152, 2022. Payal Chaudhari and Manik Lal Das. KeySea: Keyword-based Search with Receiver Anonymity in Attribute-based Searchable Encryption. IEEE Transactions on Services Computing, 15(2): 1036-1044, 2022. Payal Chaudhari and Manik Lal Das. Privacy Preserving Searchable Encryption with Fine-grained Access Control. IEEE Transactions on Cloud Computing, 9(2): 753-762, 2021. Nidhi Desai and Manik Lal Das Rule Based Anonymization Against Inference Attack in Social Networks. International Journal of Social Computing and Cyber-Physical Systems, Inderscience, 2(3): 212-228, 2021. Manik Lal Das, Pardeep Kumar and Andrew Martin. Secure and privacy-preserving RFID Authentication Scheme for Internet of Things Applications. Wireless Personal Communications, 110(1):339-353, 2019. Dhwani Patel and Manik Lal Das. TIDE: tampered image detection using mutual information. International Journal of Multimedia Intelligence and Security, Inderscience, 3(3): 205-220, 2019. Sarita Agrawal, Manik Lal Das, and Javier Lopez. Detection of Node Capture Attack in Wireless Sensor Networks. IEEE Systems Journal, 13(1):238-247, 2018. Ainish Dave, Hardik Gajera, and Manik Lal Das Privacy-preserving Targeted Online Advertising. International Journal of Social Computing and Cyber-Physical Systems, Inderscience, 2(2):132-145, 2018. Rahul Saranjame and Manik Lal Das. Securing Digital Image from Malicious Insider Attacks. International Journal of Computer Vision and Image Processing, 8(2):49-58, 2018. Sarita Agrawal and Manik Lal Das. Mutual Healing enabled Group-key Distribution Protocol in Wireless Sensor Networks. Computer Communications, Elsevier, 112:131-140, 2017. Manik Lal Das. Key-escrow free Multi-signature Scheme using Bilinear Pairings. Groups-Complexity-Cryptology, 7(1):47-57, 2015. Jaydeep Solanki, Aenik Shah, Manik Lal Das. Secure Patrol : Patrolling against buffer overflow exploits. Information Security Journal: A Global Perspective, 23(3):107-117, 2014. Anand Mudgerikar and Manik Lal Das. Secure Multicast using IPSec and Multi-party Key Computation. International Journal of Internet Technology and Secured Transactions , Inderscience, 5(2):149-162, 2014. Manik Lal Das and Navkar Samdaria. On the Security of SSL/TLS-enabled Applications. Applied Computing and Informatics, Elsevier, 10(2):68-81, 2014. Rachit Mittal and Manik Lal Das. Secure Node Localization in Mobile Sensor Networks. International Journal of Wireless Networks and Broadband Technologies,3(1):18-33, 2014. Chandrapal Chahar, Vishal S Chauhan and Manik Lal Das. Code Analysis for Software and System Security using Open Source Tools. Information Security Journal: A Global Perspective, 21(6):346-352, 2012. Siva C Muraharirao and Manik Lal Das. Digital Image Protection using Keyed Hash Function. International Journal of Computer Vision and Image Processing, 2(2):36-47, 2012. Anil Mundra, Anish Mathuria and Manik Lal Das. Detecting flaws in dynamic hierarchical key management schemes using specification animation. CSI Journal of Computing, 1(2):73-80, 2012. Anshul Singhal, Manik Lal Das. MPEG Video Security using Motion Vectors and Quadtrees Journal of Mobile, Embedded and Distributed Systems, 4(3):203-208, 2012. Manik Lal Das. A Key Escrow-free Identity-based Signature Scheme without using Secure Channel Cryptologia, 35(1):58-72, 2011. Manik Lal Das. Two-factor User Authentication in Wireless Sensor Networks. IEEE Transactions on Wireless Communications, 8(3):1086-1090, 2009. P. B. Reddy and Manik Lal Das. An Improved and Efficient Micro-payment Scheme. Journal of Theoretical and Applied Electronic Commerce Research, 4(1):91-100, 2009. Manik Lal Das, Ashutosh Saxena, and Deepak B Phatak. Algorithms and Approches of Proxy Signatures: A Survey. International Journal of Network Security, 9(3):264-284, 2009. G. Thulasi, Manik Lal Das, and Ashutosh Saxena. An Improved Bilinear Pairing based Remote User Authentication Scheme. Computer Standards & Interfaces, Elsevier, 31:181-185, 2009. V. L. Narasimhan and Manik Lal Das. DIS: Data and Information Security for BS and MS Program - A Proposal. ACM SIGCSE, 40(4):95-99, 2008. Manik Lal Das and Aaksh Joshi. Dynamic Program Update in Wireless Sensor Networks Using Orthogonality Principle. IEEE Communications Letters, 12(6):471-473, 2008. Vidhani Kumar and Manik Lal Das. Securing Wireless Sensor Networks With Public Key Techniques. Adhoc & Sensor Wireless Networks, 5:189-201, 2008. Manik Lal Das. Comments on \"Improved Efficient Remote User Authentication Schemes\". International Journal of Network Security, 6(3):282-284, 2008. Manik Lal Das, Ashutosh Saxena and Deepak B Phatak. Proxy Signature with Effective Revocation using Bilinear Pairings. International Journal of Network Security, 4(3):312-317, 2007. G. Raju, G. M. Chaudhary, Manik Lal Das, Ashutosh Saxena. Threshold Key Issuing in Identity based Cryptography. Computer Standards & Interfaces, Elsevier, 29(2):260-264, 2007. G. Raju, G. M. Chaudhary, Manik Lal Das, Ashutosh Saxena. Identity based Multi-signature. International Journal of INFORMATICA, 17(2):177-186, 2006. Manik Lal Das, Ashutosh Saxena, V. P. Gulati and Deepak B. Phatak. A Novel Remote User Authentication Scheme using Bilinear Pairings. Computers & Security, Elsevier, 25(3):184-189, 2006. Manik Lal Das, Ashutosh Saxena, V. P. Gulati and Deepak B. Phatak. Hierarchical Key Management Scheme Using Polynomial Interpolation. ACM System Interest Group - Operating Systems Review, 39(1):40-47, 2005. Manik Lal Das, Ashutosh Saxena and Ved. P. Gulati. An Efficient Proxy Signature Scheme with Revocation.International Journal of INFORMATICA, 15(4):455-464, 2004. Manik Lal Das, Ashutosh Saxena and V. P. Gulati. A Dynamic ID-based Remote User Authentication Scheme. IEEE Transactions on Consumer Electronics, 50(2):629-631, 2004. Conferences/Workshops Deepti Saraswat, Manik Lal Das, and Sudeep Tanwar. SeFL: A Secure Privacy-Preserving Federated Learning. In Proc. of IEEE Global Communications (GLOBECOM 2024), IEEE, Cape Town, South Africa, 2024. Dev Mehta, Akshat Jingar, Janam Patel, Rajesh Gupta, Pronaya Bhattacharya, Sudeep Tanwar, Chinmay Trivedi, and Manik Lal Das. BlockSecSDN: Blockchain and Explainable ML-based Secure Network Attack Classification in Smart Homes. In Proc. of IEEE Global Communications Workshop (GLOBECOM WC 2024), IEEE, Cape Town, South Africa, 2024. Sarvagn Pathak, Jaimin Baurasi, and Manik Lal Das. Addressing Single Point of Failure in Group Communication of Constrained Environments. In Proc. of International Symposium on Security in Computing and Communications (SSCC 2023), Springer, Bangalore, India, 2023. Ekta Tank and Manik Lal Das. On Credit Card Fraud Detection using Machine Learning Techniques . In Proc. of Internat",
  "content_length": 30817,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:31"
}