{
  "name": "Mani Golparvar Fard",
  "homepage": "http://cee.illinois.edu/directory/profile/mgolpar",
  "status": "success",
  "content": "Mani Golparvar-Fard | Civil & Environmental Engineering | Illinois Mani Golparvar-Fard Mani Golparvar-Fard Professor mgolpar@illinois.edu 3129D Newmark Civil Engineering Bldg Primary Research AreaConstruction Engineering and Management Research Areas Construction Engineering and Management Societal Risk & Hazard Mitigation Sustainable and Resilient Infrastructure Systems For More Information Link to Golparvar-Fard's research group's website Link to Golparvar-Fard's startup company launched from research group in December 2015. The company has raised $28 million dollars in venture funding putting it among the fastest ConTech companies as listed by Crunchbase. Biography Dr. Mani Golparvar is Professor of Civil Engineering, Computer Science, & Technology Entrepreneurship, Faculty Entrepreneurial Fellow, Excellence Faculty Fellow, and the director of the Real-time and Automated Monitoring and Control (RAAMAC) lab at the University of Illinois at Urbana-Champaign (UIUC). He received his Ph.D. degree in Civil Engineering and MS degree in Computer Science from UIUC in 2010, MASc in Civil Engineering from the University of British Columbia in 2006, and MS and BS in Civil Engineering from Iran University of Science and Technology in 2005 and 2002 respectively. Prior to joining the faculty at UIUC, he was an Assistant Professor in Civil Engrg at Virginia Tech. Dr. Golparvar has worked with many national and international construction companies and most extensively with Turner Construction. Dr. Golparvar-Fard has several patents and is currently involved with Reconstruct Inc., an early-stage technology company with $28 million in venture capital funding that was founded based on the outcomes of his ongoing research projects. He is the recipient of the 2018 Walter Huber Research Prize from the American Society of Civil Engineers (ASCE), 2017 Young Professional Award from Engineering News-Record (ENR), 2016 ASCE Dan H. Halpin Award for Scholarship in Construction, 2013 ASCE James R. Croes Medal for innovation in Civil Engrg, 2013 FIATECH CETI award for outstanding researcher, 2012 best paper award from the ASCE Journal of Construction Engrg and Management, and numerous conference paper awards. Dr. Golparvar serves on the editorial board of the ASCE Journal of Computing in Civil Engineering, ASCE Journal of Construction Engrg and Management, and Elsevier Journal of Automation in Construction. He is also the founder of RECONSTRUCT, a startup company that offers visual data analytics to construction projects. The underlying technology is licensed from UIUC and is recognized by several awards including an Innovation Award from Turner Construction Company in 2015 and 016 World Economic Forum's most innovative startup company. Education Bachelor of Science in Civil Engineering, Iran University of Science and Technology, 1998-2002 Master of Science in Civil Engineering, Area: Hydro Structures, Iran University of Science and Technology, 2002-2005 Master of Applied Science in Civil Engineering, Area: Project and Construction Management, University of British Columbia, 2005-2006 Master of Computer Science, Areas: Computer Vision and Machine Learning, University of Illinois at Urbana-Champaign, 2008-2010 Doctor of Philosophy in Civil Engineering, Area: Construction Engineering and Management, University of Illinois at Urbana-Champaign, 2006-2010 Academic Positions Assistant Professor, Virginia Tech, Via Department of Civil and Environmental Engineering, 2010-2012 Principal Faculty, Virginia Tech, Myers-Lawson School of Construction, 2010-2012 Assistant Professor, University of Illinois at Urbana-Champaign, Department of Civil and Environmental Engineering, 2013-2016 Assistant Professor, University of Illinois at Urbana-Champaign, Department of Computer Science, 2013-2016 Associate Professor, Faculty Entrepreneurial Fellow, and Faculty Excellence Fellow, University of Illinois at Urbana-Champaign, Department of Civil and Environmental Engineering, 2016-2022 Associate Professor, University of Illinois at Urbana-Champaign, Technology Entrepreneurship Program, 2017-2022 Associate Professor, University of Illinois at Urbana-Champaign, Department of Computer Science, 2016-2022 Faculty Affiliate, University of Illinois at Urbana-Champaign, Illinois Institute of Informatics, 2013-present Faculty Affiliate, University of Illinois at Urbana-Champaign, Computational Science and Engineering (CSE) Program, 2013-present Professor, Faculty Entrepreneurial Fellow, and Faculty Excellence Fellow, University of Illinois at Urbana-Champaign, Department of Civil and Environmental Engineering, 2022-present Professor, University of Illinois at Urbana-Champaign, Technology Entrepreneurship Program, 2022-present Professor, University of Illinois at Urbana-Champaign, Department of Computer Science, 2022-present Professor, University of Illinois System, Discovery Partners Institute, 2022-present Other Professional Employment Co-Founder and Chief Strategy Officer (CSO), Reconstruct Inc., Champaign, IL and Menlo Park, CA, 2023-present Journal Editorships Associate Editor, ASCE Open Multidisciplinary Journal of Civil Engineering, 2023-present. Associate Editor, ASCE Journal of Computing in Civil Engineering, 2012-present. Specialty Editor, Information Technology in Construction, ASCE Journal of Construction Engineering and Management, 2012-present. Editorial Board Member, ASCE Journal of Computing in Civil Engineering, 2020-present. Guest Editor, Elsevier Journal of Automation in Construction, Special issue on IoT for Smart Infrastructure, 2017. Associate Editor, Elsevier Journal of Automation in Construction, 2015-present. Editorial Review Board Member, Emerald Journal of Engineering, Construction and Architectural Management, 2015-present. Member of the Editorial Board, IPMA Journal of Construction Engineering and Project Management, 2011-present. Guest Editor, IEEE Proceedings, 102(2), Special Issue on Applications of Augmented Reality, 2014. Professional Societies Member of the International Scientific Committee, The Georg Nemetschek Institute (GNI) AI for the Built World, TU Munich, 2023-present Member of the U.S. Institute of Building Documentation (USIBD) Imagery Committee, 2022-present Member of International Task Force on BIM-Driven Estimating & Scheduling, AIA BIM Forum, 2020-present Member, Construction Industry Institute (CII) Technology Committee, 2019-present Chair, ASCE Construction Research Council (CRC), American Society of Civil Engineers (ASCE), 2018-2019 Chair, Data Sensing and Analysis (DSA) Committee, Technical Council on Computing and Information Technology (TCCIT), American Society of Civil Engineers (ASCE), 2014-2016. Chair of the Communications subcommittee, Construction Industry Institute (CII) Academic Committee, 2014-2018 Member, Construction Industry Institute (CII) Academic Committee, 2010- present Service to Federal and State Government Board Member, U.S. Institute of Building Documentation, 2024-present Research Interests Computer Vision and Machine Learning for Monitoring Construction and Operation in the Built Environment Primary Research AreaConstruction Engineering and Management Research Areas Construction Engineering and Management Societal Risk & Hazard Mitigation Sustainable and Resilient Infrastructure Systems Books Edited or Co-Edited (Original Editions) White, J., Schmidt, D.C., and Golparvar-Fard, M. (2014). \"Proceedings of the IEEE; Special Issue: Applications of Augmented Reality\", 102(2), 1-2. Chapters in Books Lin, J., and Golparvar-Fard, M. (2020) \"Construction Progress Monitoring Using Cyber-Physical Systems\" Cyber Physical Systems in the Built Environment, Chimay Anumba and Nazila Roofigari. Lin, J., and Golparvar-Fard, M. (2019) \"Computer Vision and BIM-Driven Data Analytics for Monitoring Construction and Operation in the Built Environment\" Construction 4.0: An Innovation Platform for the Built Environment; Editors: Anil Sawhney, Michael Riley, Javier Irizarry, and Cristina Toca Perez. Golparvar-Fard M., Peña-Mora F., and Savarese S. (2012). “D4AR- A 4-Dimensional Augmented Reality Model for Automating Construction Progress Data Collection, Processing and Communication.” Future IT in Construction. Peña-Mora F., Golparvar-Fard M., Aziz Z. and Roh S. (2011). “Collaborative Design Development and Progress Coordination During the Construction Phase.” A book chapter in “Collaborative Design in Virtual Environments. Editors: Zinagyu Wang and Jerry Tsai. Monographs Saidi, K., Cheok, G., Franaszek, M., Brown, C., Swerdlow, J., Lipman, R., Katz, I., Golparvar-Fard, M., Goodrum, P., Akula, M., Dadi, G., and Ghadimi, B. (2011), “Development and Use of the NIST Intelligent and Automated Construction Job Site Testbed”. NIST TN 1726, National Institute of Standards and Technology, Gaithersburg, MD, Dec. 2011. Selected Articles in Journals Asadi B., Shah V., Vyas A., Golparvar-Fard M., and Hajj, R. (2025). \"Hybrid Deep Learning Model for Predicting Failure Properties of Asphalt Binder from Fracture Surface Images\" Wiley Journal of Computer-Aided Civil and Infrastructure Engineering, https://doi.org/10.1111/mice.13447. Jung Y., Chob I., Hsu, S., and Golparvar-Fard M. (2024) \"VisualSiteDiary: A Detector-Free Vision-Language Transformer Model for Captioning Photologs for Daily Construction Reporting and Image Retrieval\", Automation in Construction 165 , 105483. Pal A, Lin JJ, Hsieh SH, Golparvar-Fard M. (2024) Activity-level construction progress monitoring through semantic segmentation of 3D-informed orthographic images. Automation in Construction. 2024 Jan 1;157:105157. Jung, Y., , Hockenmaier, J., and Golparvar-Fard, M. (2023) “A Transformer Language Model for Mapping Construction Schedule Activities to Uniformat Categories”, Elsevier Journal of Automation in Construction. Pal, A., Lin, J. Hseih, S. and Golparvar-Fard, M. (2023). \"Automated vision-based construction progress monitoring in built environment through digital t",
  "content_length": 44933,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:31"
}