{
  "name": "Manish Singh 0001",
  "homepage": "https://ruccs.rutgers.edu/manish",
  "status": "success",
  "content": "Home Home M a n i s h   S i n g h ProfessorDepartment of Psychology& Rutgers Center for Cognitive Science (RuCCS)Rutgers University– New Brunswick 152 Frelinghuysen Rd., Piscataway, NJ 08854 Email: <my first name> <DOT> <my last name> <AT> r u t g e r s <DOT> e d u Ph.D., 1998: Department of Cognitive Sciences, University of California, Irvine 1998 - 2001: Post-doctoral researcher, Department of Brain and Cognitive Sciences, Massachusetts Institute of Technology R e s e a r c h   I n t e r e s t s I’m a cognitive scientist interested in human perception. My work investigates various aspects of the visual perception of objects and surfaces — their perceived shape, visual completion, transparency, motion, prediction of their physical behavior, etc. It employs a combination of psychophysical studies and computational (especially probabilistic) models. I’m also interested in foundational issues concerning perception as a bridge between mind and world. S e l e c t e d  R e c e n t   P u b l i c a t i o n s Hoffman, D. & Singh, M. (2024). Perception, Evolution, and the Explanatory Scope of Scientific Theories. Journal of Consciousness Studies, 31(9-10), 29-41.. Choi, R., Feldman, J. and Singh, M. (2024). Perceptual Biases in the Interpretation of Non-Rigid Shape Transformations from Motion. Vision, 8(3), 43. Tanrikulu, O. D., Froyen, V., Feldman, J., & Singh, M. (2024). Interaction of contour geometry and optic flow in determining relative depth of surfaces. Attention, Perception & Psychophysics, 86, 221–236. Rubinstein, J., Singh, M., & Kowler, E. (2024). Bayesian approaches to smooth pursuit of random dot kinematograms: Effects of varying RDK noise and the predictability of RDK direction. Journal of Neurophysiology, 131(2), 394-416. Destler, N., Singh, M., & Feldman, J. (2023). Skeleton-based shape similarity. Psychological Review, 130(6), 1653-1671. Tanrikulu, O. D., Froyen, V., Feldman, J., & Singh, M. (2022). The interpretation of dynamic occlusion: Combining contour geometry and accretion/deletion of texture. Vision Research, 199, 108075. Prakash, C., Stephens, K., Hoffman, D., Singh, M., & Fields, C. (2021). Fitness Beats Truth in the Evolution of Perception. Acta Biotheoretica, 69(3), 319-341. Prakash, C., Fields, C., Hoffman, D., Prentner, R., & Singh, M. (2020). Fact, Fiction, and Fitness. Entropy, 22, 514:1-23. Singh M. (2020). Transparency and Translucency. In: Ikeuchi K. (Ed.), Computer Vision. Springer, Cham. Destler, N., Singh, M., & Feldman, J. (2019). Shape discrimination along morph-spaces. Vision Research, 158, 189-199. S e l e c t e d   O l d e r   P u b l i c a t i o n s (Or view publications on Google Scholar.) Tanrikulu, O. D., Froyen, V., Feldman, J., & Singh, M. (2018). When is accreting/deleting texture seen as in front? Interpretation of depth from texture motion. Perception, 47(7), 694-721 Jaekel F., Singh M., Wichmann F., & Herzog M. (2016). An overview of quantitative approaches in Gestalt perception. Vision Research, 126, 3-8. Froyen, V., Feldman, J., & Singh, M. (2015). Bayesian Hierarchical Grouping: Perceptual grouping as mixture estimation. Psychological Review, 122(4), 575-597. Hoffman, D., Singh, M., & Prakash, C. (2015). Interface Theory of Perception. Psychonomic Bulletin and Review, 22(6), 1480-1506. Cholewiak, S., Fleming, R. & Singh, M. (2015). Perception of physical stability and center of mass of 3-D objects. Journal of Vision, 15(2):13, 1-11. Singh, M. (2015). Visual representation of contour and shape. In J. Wagemans (Ed.), Oxford Handbook of Perceptual Organization (pp. 236-257). Oxford University Press. Froyen, V., Feldman, J., & Singh, M. (2013). Rotating columns: Relating structure-from-motion, accretion/deletion, and figure/ground.Journal of Vision, 13(10), 1-12. Cholewiak, S., Fleming, R. & Singh, M. (2013). Visual perception of the physical stability of asymmetric three-dimensional objects. Journal of Vision, 13(4):12, 1-13. Kim, S.-H., Feldman, J., & Singh, M. (2013). Perceived causality can alter the perceived trajectory of apparent motion. Psychological Science, 24(4), 575-582. Hoffman, D. & Singh, M. (2012). Computational Evolutionary Perception. Perception (Special Issue on the 30th anniversary of Marr's \"Vision\"), 41(9), 1073-1091. Kim, S.-H., Feldman, J., & Singh, M. (2012). Curved apparent motion induced by amodal completion. Attention, Perception, & Psychophysics, 74(2), 350-364. Singh, M. & Feldman, J. (2012). Principles of contour information: A response to Lim & Leek (2012). Psychological Review, 119(3), 678-683. Wagemans, J., Elder, J., Kubovy, M., Palmer, S., Peterson, M., Singh, M., & von der Heydt, R. (2012). A century of Gestalt psychology in visual perception: Perceptual grouping and figure-ground organization. Psychological Bulletin, 138(6),1172-1217.",
  "content_length": 4805,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:34"
}