{
  "name": "Manmohan Chandraker",
  "homepage": "http://cseweb.ucsd.edu/~mkchandraker",
  "status": "success",
  "content": "Manmohan Chandraker Toggle theme Light Dark Auto Vision, Graphics and Learning Professor, CSE @ UC San Diego. Visual Computing Center. Contextual Robotics Institute. Halicioglu Data Science Institute. About Manmohan Chandraker is a full professor in the CSE department of University of California, San Diego. His interests are in computer vision and machine learning, with applications in self-driving and augmented reality. His work has been recognized with the Best Paper honorable mention at ECCV 2022, Google Research Awards in 2021, 2019 and 2018, the NSF CAREER Award in 2018, the Best Paper Award at CVPR 2014, an IEEE PAMI special issue on Best Papers from CVPR 2011, the 2009 CSE Dissertation Award for Best Thesis from UCSD and the Marr Prize honorable mention at ICCV 2007. Recent news Invited talk on Scaling Autonomy at ROAD++ workshop, ECCV 2024. Invited talk on Photorealistic Digital Twins at TRICKY workshop, ECCV 2024. Congratulations Tarun Kalluri on a successful PhD defense! Two invited talks on Generative AI for Autonomous Driving at IEEE ITSC 2024. Two papers at ECCV 2024 on diffusion for trajectory generation and domain adaptation. I will serve as an Area Chair at ICLR and CVPR 2025. Paper at ICML 2024 on geographic robustness with language models. Congratulations Yu-Ying Yeh on a successful PhD defense! Three papers at CVPR 2024 on diffusion models, GANs and NeRFs for 3D generation. Two papers at CVPR 2024 on LLMs for agent workflows and autonomous driving devops. Three papers at CVPR 2024 on open vocabulary and instantaneous 3D perception. I will serve as an Area Chair at ECCV, ICLR, AAAI and NeurIPS 2024. Teaching a new CSE 252D with a focus on vision transformers, diffusion and language models. Congratulations Kunal Gupta and Ishit Mehta on the Qualcomm Innovation Fellowship! Leadership and Service Awards.  Keynotes.  Committees.  Panels. About Manmohan Chandraker is a full professor in the CSE department of University of California, San Diego. His interests are in computer vision and machine learning, with applications in self-driving and augmented reality. His work has been recognized with the Best Paper honorable mention at ECCV 2022, Google Research Awards in 2021, 2019 and 2018, the NSF CAREER Award in 2018, the Best Paper Award at CVPR 2014, an IEEE PAMI special issue on Best Papers from CVPR 2011, the 2009 CSE Dissertation Award for Best Thesis from UCSD and the Marr Prize honorable mention at ICCV 2007. Recent news Invited talk on Scaling Autonomy at ROAD++ workshop, ECCV 2024. Invited talk on Photorealistic Digital Twins at TRICKY workshop, ECCV 2024. Congratulations Tarun Kalluri on a successful PhD defense! Two invited talks on Generative AI for Autonomous Driving at IEEE ITSC 2024. Two papers at ECCV 2024 on diffusion for trajectory generation and domain adaptation. I will serve as an Area Chair at ICLR and CVPR 2025. Paper at ICML 2024 on geographic robustness with language models. Congratulations Yu-Ying Yeh on a successful PhD defense! Three papers at CVPR 2024 on diffusion models, GANs and NeRFs for 3D generation. Two papers at CVPR 2024 on LLMs for agent workflows and autonomous driving devops. Three papers at CVPR 2024 on open vocabulary and instantaneous 3D perception. I will serve as an Area Chair at ECCV, ICLR, AAAI and NeurIPS 2024. Teaching a new CSE 252D with a focus on vision transformers, diffusion and language models. Congratulations Kunal Gupta and Ishit Mehta on the Qualcomm Innovation Fellowship! Previous Next Your browser does not support the video tag. Augmented Reality Computer vision and graphics for photorealistic digital twins and 3D content creation. Learn more » Your browser does not support the video tag. Autonomous Driving Full-stack autonomy with generative AI simulations, VLM-driven devops, perception and planning. Learn more » Your browser does not support the video tag. Generative & Responsible AI LLM agents for complex workflows, embodied AI for robotics and robustness across domains. Learn more » Photorealism. Enhanced reality. Understanding 3D shape, material and lighting. Enabling applications like object insertion, material editing and full scene relighting. Full-stack autonomy. Simulation, driving, data devops. Generative AI sensor and behavior simulations. LLM-assisted planning and open vocabulary perception. VLM-driven training and verification. Your browser does not support the video tag. Generative AI. Responsible AI. Embodied LLM agents. Diffusion models for content creation. Robustness, privacy and fairness. Your browser does not support the video tag.",
  "content_length": 4605,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:35"
}