{
  "name": "Manos Athanassoulis",
  "homepage": "https://cs-people.bu.edu/mathan",
  "status": "success",
  "content": "Manos Athanassoulis homepage Manos Athanassoulis Associate Professor Boston University DiSC Lab Home Publications Courses Blog CV © 2017 — 2025 Manos Athanassoulis Manos Athanassoulis Associate Professor of Computer Science College of Arts and Sciences, Boston University CV Contact Office: CCDS 928 Center of Computing and Data Sciences 665 Commonwealth Avenue Boston, MA, 02215 mathan@bu.edu I am an Associate Professor of Computer Science at Boston University, Director and Founder of the BU Data-intensive Systems and Computing (DiSC) lab, and part of the BU MiDAS group. My research is in the area of data systems, focusing on novel cloud data management architectures, complex hybrid transactional/analytical workloads, and new hardware (like non-volatile memories and heterogeneous computation units). Before joining BU I was a Research Associate at Harvard University. From 2014-2017 I was a Postdoctoral Researcher at Harvard University in the Data Systems Lab with Stratos Idreos, where I was supported by a SNSF Postdoc Mobility Fellowship. I received my PhD (2014) from EPFL, where I worked in the Data-Intensive Applications and Systems Lab on studying data systems architectures for analytics exploiting new storage hardware with Anastasia Ailamaki. I obtained my MSc (2008) in Computer Systems Technology, and BSc (2005) in Informatics and Telecommunications from the University of Athens, Greece. I have also been at IBM Research as a PhD Intern in 2011, and a junior researcher in the University of Athens and the National Technical University of Athens. Outside of the office I enjoy biking, playing basketball, and studying history. You can download my CV here. Database Readings on Classic Research Topics and on the History (and future) of Database Research. Computer Science Writing Resources: I fully subscribe to Renée Miller's computer science writing advice. Select Honors and Awards 2025 ACM SIGMOD 2025 Distinguished PC Member EDBT 2025 Distinguished Reviewer 2024 ACM SIGMOD 2024 Distinguished PC Member 2023 VLDB 2023 Best Demo Award Our demo \"On-the-fly Data Transformation in Action\" was recognized as the \"Best Demo\" of VLDB 2023! ACM SIGMOD 2023 Distinguished PC Member RedHat Collaboratory Research Incubation Awards (received three awards) tensor data reorganization (joint work with Prof. Mancuso) relational memory controller (joint work with Prof. Mancuso) learned cost models (joint work with Prof. Terzi) 2022 NSF CAREER Award 2021 RedHat Collaboratory Research Incubation Awards (received two awards) software-hardware co-designed data systems (joint work with Prof. Mancuso) robust tuning for data systems (joint work with Prof. Terzi) 2020 Facebook Faculty Research Award 2019 NSF CRII Award 2018 Best of VLDB 2017 Our paper \"Slalom: Coasting Through Raw Data via Adaptive Partitioning and Indexing\" was recognized as one of the \"Best of VLDB 2017\" papers, and was invited for an extended journal version at VLDBJ. ACM SIGMOD 2018 Distinguished PC Member 2017 Best of ACM SIGMOD 2017 Our paper \"Monkey: Optimal Navigable Key-Value Store\" was recognized as one of the \"Best of SIGMOD 2017 papers\", and was invited for an extended journal version at ACM TODS. SIGMOD Most Reproducible Paper Award Our paper \"UpBit: Scalable In-Memory Updatable Bitmap Indexing\" was awarded the SIGMOD Most Reproducible Paper Award in SIGMOD 2017. 2016 Harvard University Certificate of Distinction in Teaching Awarded on Fall 2015, Spring 2016, & Fall 2016, by the Derek Bok Center for Teaching and Learning at Harvard University. 2014 SNSF Postdoc Mobility Fellowship 2015-16 2011 IBM PhD Fellowship 2011-12 2010 Best of VLDB 2010 Our paper \"Aether: A Scalable Approach to Logging\" was recognized as one of the \"Best of VLDB 2010\" papers, and was invited for an extended journal version at VLDBJ.",
  "content_length": 3822,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:41"
}