{
  "name": "Manos Papagelis",
  "homepage": "https://www.eecs.yorku.ca/~papaggel",
  "status": "success",
  "content": "Manos Papagelis | York University Download Curriculum Vitae Research Statement Teaching Statement Toggle navigation Manos Papagelis Home Research Publications Teaching Systems Students Home Curriculum Vitae Research Statement Teaching Statement I am an Associate Professor of Electrical Engineering and Computer Science (EECS) at the Lassonde School of Engineering, York University. I am faculty member of the Data Mining Lab. Hiring Currently looking to hire bright and hard-working domestic or international students at all levels (PhD, M.Sc, Undergrad). Read More Research Interests Graph Mining Data Mining Machine Learning Big Data & Knowledge Discovery City Science/ Urban Informatics Recent Invited/Visit Talks Dec 13th, 2023 - Trajectory Data Mining in the Age of Big Data and AI (short) (Ontario Database Day 2023 (McMaster University)) Oct 23rd, 2023 - Trajectory Data Mining in the Age of Big Data and AI (Missouri University of Science & Technology (MS&T)) Nov 25th, 2021 - Mobility-based Models of Epidemic Spreading (Laboratory of Mathematical Parallel Systems lab (LAMPS)) Dec 13th, 2020 - Large-scale Mining of Dynamic Networks (Sharif University of Technology, International Campus, Kish Island (SUTIC)) Jul 6th, 2019 - Large-scale Mining of Dynamic Networks (Google) Jun 28th, 2019 - Large-scale Mining of Dynamic Networks (Data Analytics and Visualization Summer School) May 9th, 2019 - Big Data Analytics (lecture) (Dependable Internet Of Things (Integrative Course 2019)) May 28th, 2019 - Fast and Accurate Mining of Evolving & Trajectory Networks (DOOCN-XII) Dec 17th, 2018 - Trajectory Network Mining (University of Warwick) Jul 6th, 2018 - End to end Graph Analytics (Data Analytics and Visualization Summer School) Education University of California, Berkeley (Post-doc) University of Toronto, Canada (PhD) University of Crete, Greece (M.Sc.) University of Crete, Greece (B.Sc.) Awards (teaching) Lassonde School of Engineering (2021) – Educator of the Year Award Awards (research) 31st ACM International Conference on Advances in Geographic Information Systems (ACM SIGSPATIAL 2023) – Best paper runner-up award 21st IEEE International Conference on Mobile Data Management (IEEE MDM 2020) – Best paper award 19th IEEE International Conference on Mobile Data Management (IEEE MDM 2018) – Best paper award 26th ACM International Conference on Information and Knowledge Management (ACM CIKM 2017) – Outstanding reviewer award Elsevier Journal on Engineering Applications of Artificial Intelligence (EAAI) – Top cited article 2005-2010 award Affiliations (research) Member, EECS Department Faculty, Lassonde School of Engineering, York University Member, Graduate Program in Electrical Engineering & Computer Science, York University Member/PI, Data Mining Lab, EECS Department, York University Member/Co-PI, BRAIN Alliance (Big Data Research, Analytics, Information Networks) Member/Co-PI, Data Visualization and Analytics Training Program (NSERC CREATE DAV) Member/Co-PI, Dependable Internet of Things Applications (NSERC CREATE DITA) Member/Co-PI, Center for Innovation in Computing @ Lassonde (IC@L) Teaching Fall 2021 EECS4414/5414 - Information Networks Summer 2021 EECS4415 - Big Data Systems Winter 2020 EECS6414 - Data Analytics and Visualization Summer 2020 EECS3421 - Introduction to Database Management Systems Read More Bio Sketch Before joining York University I was a postdoctoral scholar at the University of California, Berkeley and lecturer at its iSchool's professional Master of Information and Data Science (MIDS) program, delivered online. I did my PhD at the Department of Computer Science , University of Toronto  under the supervision of Prof. Nick Koudas . From 2010 to 2015, I was also a Sessional Lecturer/Course Instructor at the same department. I spent the summer of 2009 and the summer of 2010 at Yahoo! Labs, Barcelona  working with the Social Media Group and the Usage Mining and Link Analysis Group respectively. Before moving to Toronto, I received a B.Sc. and a M.Sc. from the Computer Science Department  of the University of Crete , Greece. During my graduate studies, I was also affiliated with the Institute of Computer Science , FORTH , working as a research fellow at the Information Systems Lab . There, I worked mainly with Prof. Dimitris Plexousakis  on Recommendation Algorithms and with Dr. Martin Doerr  on Heterogeneous Data Integration problems. My publications entry while at ICS-FORTH can be found here. About Me I come from Edessa , a beautiful small town located at the north-west of Greece . I love to learn, so I find research as a natural choice. Discovering something new, gaining deep understanding of problems and solving them, being able to make an impact, doing things right, being the authority in an area and working as a team to build services that engage people and fulfill their needs are aspects of life that I would like to pursue and enjoy in my career. (Not so) Recent Blog Entries EU Innovation & Competitiveness Success rates of proposals in the FP7 program Number of Researchers by World Region and in EU-27 Contact Me Department of Electrical Engineer & Computer Science Lassonde School of Engineering (Office: LAS 3050) York University 4700 Keele St, Toronto ON, M3J 1P3, Canada Email: papaggel@eecs.yorku.ca Stay Connected Last Updated 2019 © | Manos Papagelis. All Rights Reserved.",
  "content_length": 5382,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:41"
}