{
  "name": "Manolis Savva",
  "homepage": "https://msavva.github.io",
  "status": "success",
  "content": "Manolis Savva | Manolis Savva Manolis Savva Associate Professor Simon Fraser University School of Computing Science 3DLG | GrUVi | SFU AI/ML | VINCI Canada Research Chair inComputer Graphics CV/Résumé (updated 2018-10-13) Teaching Spring 2026 CMPT722: Rendering & Visual Computing for AI Spring 2025 CMPT722: Rendering & Visual Computing for AI Spring 2024 CMPT722: Rendering & Visual Computing for AI CMPT757: Frontiers of Visual Computing Spring 2023 CMPT700: Technical Writing & Research Comm. Fall 2022 CMPT985: Rendering & Visual Computing for AI Spring 2022 CMPT700: Technical Writing & Research Comm. CMPT361: Intro to Visual Computing Fall 2021 CMPT361: Intro to Visual Computing Spring 2021 CMPT700: Technical Writing & Research Comm. Fall 2019 & Fall 2020 CMPT757: Frontiers of Visual Computing Summer 2015 (Stanford) CS148: Intro to Comp. Graphics & Imaging Students & Visitors Dongchen Yang Hou In (Derek) Pun Hou In (Ivan) Tam Jiayi Liu (co-advised with Ali Mahdavi-Amiri) Reza Asad (co-advised with Sharan Vaswani) Weikun Peng Alumni Armin Kavian (next: CC&L) Changan Chen (next: PhD at UT Austin) Jiaqi Tan (next: PhD at SFU) Madhawa Vidanapathirana (next: Microsoft) Sanjay Haresh (next: Qualcomm AI) Shivansh Patel (next: PhD at UIUC) Supriya Gadi Patil Yongsen Mao (next: KuJiaLe AI) I am an Associate Professor in the School of Computing Science at Simon Fraser University, and Canada Research Chair in Computer Graphics. My research focuses on analysis, organization and generation of 3D content. The methods that I work on are stepping stones towards holistic 3D scene understanding revolving around people, with applications in computer graphics, computer vision, and robotics. Prior to my current position I was a visiting researcher at Facebook AI Research and a postdoctoral research associate at the Princeton University Computer Graphics and Vision Labs. I received my Ph.D. from Stanford University, under the supervision of Pat Hanrahan. My undergraduate degree was in Physics and Computer Science at Cornell University. News Nov 2025 Two 3DV 2026 papers and two WACV 2026 papers. Congratulations to Weikun, Derek, Ivan, Austin, Denys and Yiming! Also, congratulations to Derek for defending his MSc thesis. Mar 2025 One paper at ICLR 2025, one at 3DV 2025 (oral), and one Eurographics 2025 STAR. Congratulations to Jiayi, Denys, Ivan, Derek, and Austin! Also, congratulations to Ivan for defending his MSc thesis and starting as a PhD student in the group. May 2024 Tenured and promoted to Associate Professor! I am grateful for all the support by my students, colleagues, and collaborators. Mar 2024 Three papers at CVPR 2024, two at 3DV 2024, one at WACV 2024, and one Eurographics 2024 STAR.Congratulations to Jiayi, Ivan, Mukul, Yongsen, Sanjay, Qirui, Xiahao, Hanxiao, Han-Hung, and Sonia! Jul 2023 New paper on articulated object reconstruction at ICCV 2023. Congratulations to Jiayi! May 2023 Congratulations to Sanjay and Supriya for defending their MSc theses.\"Emergence of Maps in the Memories of Blind Navigation Agents\" receives ICLR 2023 Outstanding Paper Award. May 2022 I am honored to receive a CHCCS Early Career Researcher Award. Jan 2022 Congratulations to Jiaqi for defending her MSc thesis! More... Publications HSM: Hierarchical Scene Motifs for Multi-Scale Indoor Scene Generation Hou In (Derek) Pun, Hou In (Ivan) Tam, Austin T. Wang, Xiaoliang Huo, Angel X. Chang, Manolis Savva 3DV 2026 pdf | webpage iTACO: Interactable Digital Twins of Articulated Objects from Casually Captured RGBD Videos Weikun Peng, Jun Lv, Cewu Lu, Manolis Savva 3DV 2026 pdf | webpage SceneEval: Evaluating Semantic Coherence in Text-Conditioned 3D Indoor Scene Synthesis Hou In (Ivan) Tam, Hou In (Derek) Pun, Austin T. Wang, Angel X. Chang, Manolis Savva WACV 2026 pdf | webpage S2O: Static to Openable Enhancement for Articulated 3D Objects Denys Iliash, Hanxiao Jiang, Yiming Zhang, Manolis Savva, Angel X. Chang WACV 2026 pdf | webpage Diorama: Unleashing Zero-shot Single-view 3D Scene Modeling Qirui Wu, Denys Iliash, Daniel Ritchie, Manolis Savva, Angel X. Chang ICCV 2025 pdf | webpage Survey on Modeling of Human-made Articulated Objects Jiayi Liu, Manolis Savva, Ali Mahdavi-Amiri Eurographics STAR (State of The Art Report), CGF 2025 pdf | webpage SINGAPO: Single Image Controlled Generation of Articulated Parts in Objects Jiayi Liu, Denys Iliash, Angel X. Chang, Manolis Savva, Ali Mahdavi-Amiri ICLR 2025 pdf | webpage SceneMotifCoder: Example-driven Visual Program Learning for Generating 3D Object Arrangements Hou In (Ivan) Tam, Hou In (Derek) Pun, Austin T. Wang, Angel X. Chang, Manolis Savva 3DV 2025 pdf | webpage R3DS: Reality-linked 3D Scenes for Panoramic Scene Understanding Qirui Wu, Sonia Raychaudhuri, Daniel Ritchie, Manolis Savva, Angel X. Chang ECCV 2024 pdf | webpage DMFuser: Distilled Multi-Task Learning for End-to-end Transformer-Based Sensor Fusion in Autonomous Driving Pedram Agand, Mohammad Mahdavian, Manolis Savva, Mo Chen IROS 2024 pdf | webpage CAGE: Controllable Articulation GEneration Jiayi Liu, Hou In (Ivan) Tam, Ali Mahdavi-Amiri, Manolis Savva CVPR 2024 pdf | webpage Habitat Synthetic Scenes Dataset (HSSD-200): An Analysis of 3D Scene Scale and Realism Tradeoffs for ObjectGoal Navigation Mukul Khanna, Yongsen Mao, Hanxiao Jiang, Sanjay Haresh, Brennan Shacklett, Dhruv Batra, Alexander Clegg, Eric Undersander, Angel X. Chang, Manolis Savva CVPR 2024 pdf | webpage Ego-Exo4D: Understanding Skilled Human Activity from First- and Third-Person Perspectives Kristen Grauman, ...Sanjay Haresh, ...Yongsen Mao, ...Manolis Savva, ... CVPR 2024 pdf | webpage Text-to-3D Shape Generation Han-Hung Lee, Manolis Savva, Angel X. Chang Eurographics STAR (State of The Art Report), CGF 2024 pdf | webpage Generalizing Single-View 3D Shape Retrieval to Occlusions and Unseen Objects Qirui Wu, Daniel Ritchie, Manolis Savva, Angel X. Chang 3DV 2024 pdf | webpage OPDMulti: Openable Part Detection for Multiple Objects Xiaohao Sun, Hanxiao Jiang, Manolis Savva, Angel X. Chang 3DV 2024 pdf | webpage MOPA: Modular Object Navigation with PointGoal Agents Sonia Raychaudhuri, Tommaso Campari, Unnat Jain, Manolis Savva, Angel X. Chang WACV 2024 pdf | webpage HomeRobot: Open Vocabulary Mobile Manipulation Sriram Yenamandra, Arun Ramachandran, Karmesh Yadav, Austin Wang, Mukul Khanna, Theo Gervet, Jimmy (Tsung-Yen) Yang, Vidhi Jain, Alexander Clegg, John Turner, Zsolt Kira, Manolis Savva, Angel X. Chang, Devendra Chaplot, Dhruv Batra, Roozbeh Mottaghi, Yonatan Bisk, Chris Paxton CoRL 2023 pdf | webpage PARIS: Part-level Reconstruction and Motion Analysis for Articulated Objects Jiayi Liu, Ali Mahdavi-Amiri, Manolis Savva ICCV 2023 pdf | webpage Advances in Data-Driven Analysis and Synthesis of 3D Indoor Scenes Akshay Gadi Patil, Supriya Gadi Patil, Manyi Li, Matthew Fisher, Manolis Savva, Hao Zhang Computer Graphics Forum 2023 STAR (State of the Art Report) pdf | webpage Habitat-Matterport 3D Semantics Dataset Karmesh Yadav, Ram Ramrakhya, Santhosh Kumar Ramakrishnan, Theo Gervet, John Turner, Aaron Gokaslan, Noah Maestre, Angel X. Chang, Dhruv Batra, Manolis Savva, Alexander Clegg, Devendra Chaplot CVPR 2023 pdf | webpage 3DSSR: 3D Subscene Retrieval Reza Asad, Manolis Savva CVPR 2023 Workshop on Structural and Compositional Learning on 3D Data pdf | webpage Evaluating 3D Shape Analysis Methods for Robustness to Rotation Invariance Supriya Gadi Patil, Angel X. Chang, Manolis Savva CRV 2023 pdf | webpage Emergence of Maps in the Memories of Blind Navigation Agents Erik Wijmans, Manolis Savva, Irfan Essa, Stefan Lee, Ari Morcos, Dhruv Batra ICLR 2023, Outstanding Paper Award pdf | webpage MultiScan: Scalable RGBD scanning for 3D environments with articulated objects Yongsen Mao, Yiming Zhang, Hanxiao Jiang, Angel X. Chang, Manolis Savva NeurIPS 2022 pdf | webpage Articulated 3D Human-Object Interactions from RGB Videos: An Empirical Analysis of Approaches and Challenges Sanjay Haresh, Xiaohao Sun, Hanxiao Jiang, Angel X. Chang, Manolis Savva 3DV 2022 pdf | webpage OPD: Single-view 3D Openable Part Detection Hanxiao Jiang, Yongsen Mao, Manolis Savva, Angel X. Chang ECCV 2022 pdf | webpage Habitat 2.0: Training Home Assistants to Rearrange their Habitat Andrew Szot, Alexander Clegg, Eric Undersander, Erik Wijmans, Yili Zhao, John Turner, Noah Maestre, Mustafa Mukadam, Devendra Chaplot, Oleksandr Maksymets, Aaron Gokaslan, Vladimír Vondrus, Sameer Dharur, Franziska Meier, Wojciech Galuba, Angel X. Chang, Zsolt Kira, Vladlen Koltun, Jitendra Malik, Manolis Savva, Dhruv Batra NeurIPS 2021 pdf | webpage Habitat-Matterport 3D Dataset (HM3D): 1000 Large-scale 3D Environments for Embodied AI Santhosh Kumar Ramakrishnan, Aaron Gokaslan, Erik Wijmans, Oleksandr Maksymets, Alexander Clegg, John Turner, Eric Undersander, Wojciech Galuba, Andrew Westbury, Angel X. Chang, Manolis Savva, Yili Zhao, Dhruv Batra NeurIPS 2021 Datasets & Benchmarks Track pdf | webpage Interpretation of Emergent Communication in Heterogeneous Collaborative Embodied Agents Shivansh Patel, Saim Wani, Unnat Jain, Alexander Schwing, Svetlana Lazebnik, Manolis Savva, Angel X. Chang ICCV 2021 pdf | webpage D3D-HOI: Dynamic 3D Human-Object Interactions from Videos Xiang Xu, Hanbyul Joo, Greg Mori, Manolis Savva arXiv:2108.08420 [cs.CV] pdf | webpage Roominoes: Learning to Assemble 3D Rooms into Floor Plans Kai Wang, Xianghao Xu, Leon Lei, Selena Ling, Natalie Lindsay, Angel X. Chang, Manolis Savva, Daniel Ritchie SGP 2021 pdf | webpage Plan2Scene: Converting Floorplans to 3D Scenes Madhawa Vidanapathirana, Qirui Wu, Yasutaka Furukawa, Angel X. Chang, Manolis Savva CVPR 2021 pdf | webpage Mirror3D: Depth Refinement for Mirror Surfaces Jiaqi Tan, Weijie (Lewis) Lin, Angel X. Chang, Manolis Savva CVPR 2021 pdf | webpage LayoutGMN: Neural Graph Matching for Structural Layout Similarity Akshay Gadi Patil, Manyi Li, Matthew Fisher, Manolis Savva, Hao Zhang CVPR 2021 pdf Large Batch Simulation for Deep Reinforc",
  "content_length": 19971,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:38"
}