{
  "name": "Manos Antonakakis",
  "homepage": "https://ece.gatech.edu/directory/manos-antonakakis",
  "status": "success",
  "content": "Manos Antonakakis Skip to main navigation Skip to main content Manos Antonakakis Astrolavos Lab Official Job Title Professor Endowed Chair and Professorships Titles Dean's Professorship Email Address manos@gatech.edu Telephone 404/385-2534 Office Building Klaus Office Room Number 3366 Technical Interest Group(s) Computer Systems and Software Biography Dr. Manos Antonakakis (PhD’12) is an Associate Professor in the School of Electrical and Computer Engineering (ECE) and an adjunct faculty member in the College of Computing (CoC), at the Georgia Institute of Technology. He is responsible for the http://astrolavos.gatech.edu\">Astrolavos Lab, where students conduct research in the areas of Attack Attribution, Network Security and Privacy, Intrusion Detection, and Data Mining. In May 2012, he received his Ph.D. in Computer Science from Georgia Tech. Before joining the Georgia Tech ECE faculty ranks, Dr. Antonakakis held the Chief Scientist role at Damballa. He currently serves as the co-chair of the Academic Committee for the Messaging Anti-Abuse Working Group (MAAWG). In his tenure at Georgia Tech ECE, Dr. Antonakakis has raised several tens of millions in research funding as Primary Investigator from government agencies and the private sector. He is the author of several U.S. patents and more than 20 academic publications in top academic conferences. He has served as a program committee member for all top tier security conferences. Research Computer and network security Attack attribution and intrusion detection Data mining and machine learning Distinctions & Awards Google Research Award 2010 for the research paper under the title \"Building a Dynamic Reputation System for DNS\" Co-Chair of the academic committee at Messaging, Malware, and Mobile Anti-Abuse Working Group (M3AAWG) Author of four U.S. patents and an additional three, which are pending Program Committee member for all tier-one computer security conferences Thursday, 01 August 2024 9:05 AM EDT",
  "content_length": 1985,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:39"
}