{
  "name": "Manos Panaousis",
  "homepage": "https://www.manospanaousis.com",
  "status": "success",
  "content": "About me - Prof. Manos Panaousis Manos PanaousisProfessor of Cyber Security FollowLondon, UKUniversity of GreenwichEmailLinkedInORCIDGoogle ScholarAbout meI am a Professor of Cyber Security and Deputy Head of the Centre for Sustainable Cyber Security (CS2) at the University of Greenwich, London, UK. My research revolves around modeling, assessing and mitigating cybersecurity and privacy risks. I’m currently researching methods of assessing cyber and privacy risks posed by artificial intelligence and machine learning.ResearchI have published my research in top-tier journals including IEEE TIFS, IEEE TDSC, IEEE IoT, COSE, DSS, IEEE TII, ACM TIST, JISA, CSR, IEEE Access and at esteemed international conferences such as AAAI, IEEE DSC, IEEE SCC and GameSec. For a comprehensive list of my publications, please refer to my portfolio.I have received support for my research from the following funders: European Commission, UK Research and Innovation (UKRI), UK National Cyber Security Centre (NCSC), and the Engineering and Physical Sciences Research Council (EPSRC). I have served as the principal investigator (P.I.) or co-investigator (co-I) on the research projects that can be found here.CareerBefore my professorship appointment, I was an Associate Professor at the University of Greenwich (2019-2022), Lecturer and Senior Lecturer at the Department of Computer Science of the University of Surrey (2017-2019), Lecturer and Senior Lecturer at the University of Brighton (2014-2017). I also worked as a visiting researcher at the Institute of Security Science and Technology at the Imperial College London, UK (2013-2016), and a postdoctoral researcher at the Theory Group of Queen Mary University of London, UK (2013-2014). Prior to this, I led R&D activities in Ubitech (startup), Surrey Research Park, Guildford, UK after I completed my PhD (security for peer-to-peer mobile networks) at Kingston University London.Indicators of experienceGrant evaluator: EPSRC (since 2020); UKRI Future Leaders Fellowships (since 2022); National Research Centre on Privacy, Harm Reduction and Adversarial Influence Online (since 2021); Latvian Council of Science (since 2021); and Swiss National Science Foundation (since 2023).Advisory Groups & Memberships: Advisory Committee Member, Conference on Decision and Game Theory for Security (GameSec); Advisory board H2020 SECANT and H2020 SPIDER; Senior IEEE member (2021-2023); and fellow of the Research Institute in Science of Cyber Security (2021).Journal editorships Associate editor: IET Information Security (2021-2022). Guest editor: Hindawi, Wireless Communications and Mobile Computing (2021); MDPI Games (2020); and MDPI Sensors “Advances in Cybersecurity for the Internet of Things” (2023).EducationI received the B.Sc. in Informatics and Telecommunications from the National and Kapodistrian University of Athens (Greece) in 2006, the M.Sc. in Computer Science from the Athens University of Economics and Business (Greece) in 2008 and the Ph.D. in Computer Science from Kingston University London (UK) in 2012.",
  "content_length": 3068,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:40"
}