{
  "name": "Manoj Misra",
  "homepage": "https://iitr.ac.in/~CSE/Manoj_Mishra",
  "status": "success",
  "content": "Manoj Misra Contact Us Directory iConnect Webmail A A हिन्दी │Eng DEPARTMENT OF COMPUTER SCIENCE AND ENGINEERING INDIAN INSTITUTE OF TECHNOLOGY ROORKEE About Us Gallery History Facilities HOD's Corner Contact/ Reach Us Announcements What's New? NoticeBoard Newsroom Join Us/ Job Offers Academics Programmes Timetables Course Coordinator People Faculty Students Alumni Staff Activities Lecture Series Department Groups Research Research Area Research Lab Publications Projects Miscellaneous Committees Forms Download Faculty In-Charge Templates Faculty Advisors हिन्दी│Eng Departments Computer Science and Engineering Department People Faculty Manoj Misra Manoj Misra Professor Download Resume Manoj Mishra Professor manoj.misra[at]cs.iitr.ac.in +91-1332-285642 Research Interests Biosketch Educational Details Professional Background Research Projects Publications Patents Books Collaborations Honours and Awards Honors Memberships Teaching Engagements Teaching Engagements Students Supervisions Associate Scholars Miscellaneous Events Visits Administrative Positions Miscellaneous Research Interests Distributed Computing, Information and Network Security BioSketch Educational Details University of Roorkee 1986 M.Tech., Computer Sci. & Tech. Univ. of Newcastle, Upon Tyne 1997 Ph.D., Computer Sci. Professional Background Assistant Engineer 01 Jan 1986 - 01 Jan 1987 H.A.L. Kanpur Lecturer 01 Jan 1987 - 01 Jan 1992 H.B.T.I. Kanpur Assistant Professor 01 Jan 1998 - 01 Jan 2001 IIT Roorkee Engineer Trainee 01 Jan 1983 - 01 Jan 1983 CMC Ltd., New Delhi Research Publications Supporting Cooperative Caching in Mobile Ad Hoc Networks Using ClustersBy: Narrottam Chand, R. C. Joshi and Manoj MisraPublished in: International Journal of Ad Hoc and Ubiquitous Computing Vol: 2 (Pg 58-72) Date: 2007 Energy Efficient Cache Invalidation in a Disconnected Wireless Mobile EnvironmentBy: Narrottam Chand, R. C. Joshi and Manoj MisraPublished in: International Journal of Ad Hoc and Ubiquitous Computing Vol: 2 (Pg 83 - 91) Date: 2007 Secure authentication scheme to thwart RT MITM, CR MITM and malicious browser extension based phishing attacks.By: Gaurav Varshney, Manoj Misra, Pradeep K AtreyPublished In: J. Inf. Sec. Appl. Vol: 42 (pg 1-17) Date: 2018 Towards scalable and load-balanced mobile agents-based data aggregation for wireless sensor networks. By: Govind P Gupta, Manoj Misra, Kumkum garg Published In: Computers and Electrical Engineering. Vol. 64 (pg 262-276) Date: 2017 SmartITS: Smartphone-based identification and tracking using seamless indoor-outdoor localization.By: Tarun Kulshrestha, Divya Saxena, Rajdeep Niyogi, Vaskar Raychoudhury, Manoj MisraPublished In: J. Network and Computer Applications. Vol. 98 (pg 97-113) Date: 2017 A phish detector using lightweight search features.By: Gaurav Varshney, Manoj Misra, Pradeep K AtreyPublished In: Computers & Security. Vol. 62 (pg 213-228) Date 2016 A Survey and classification of web phishing detection schemes.By: Gaurav Varshney, Manoj Misra, Pradeep K AtreyPublished In: Security and Communication Networks 9(18). (pg 6266-6284) Date: 2016 Honors And Awards Honors H. B. T. I. Kanpur 2020 Merit Scholarship for B.Tech University of Newcastle Upon Tyne 2020 Commonwealth scholarship for doing Ph.D MemberShips IEEE 31 Aug 2020 - Present Member Students SuperVisions Efficient Checkpointing Protocols for Distributed Computing Systems 31 Aug 2020 - Present Other Supervisors: Prof. R. C. Joshi, E & CE , Scholar: Lalit Kumar Quality of Service Routing and Gateway Discovery in Mobile Ad Hoc Networks 31 Aug 2020 - Present Other Supervisors: Dr A K Sarje, Scholar: Rakesh Kumar Energy Aware fault Tolerant Data Dissemination Protocols For Wireless Sensor Networks 31 Aug 2020 - Present Other Supervisors: Dr. Kumkum Garg, Scholar: Govind Prasad Gupta Detection and Prevention of Phishing Attacks 31 Aug 2020 - Present Other Supervisors: , Scholar: Gaurav Varshney Network Forensic 31 Aug 2020 - Present Other Supervisors: , Scholar: Sanjeev Shukla Some Performance Issues in Distributed Real Time Database Systems 31 Aug 2020 - Present Other Supervisors: Prof. A. K. Sarje, Scholar: Udai Shanker Similarity analysis of Biological Sequences by alignment-free methods 31 Aug 2020 - Present Other Supervisors: Dr. Rajdeep Niyogi, Scholar: Manoj Kumar Gupta Cache Management in Mobile Computing Environment 31 Aug 2020 - Present Other Supervisors: Prof. R C Joshi, Scholar: Narottam Chand Location Dependent Data Caching in Mobile Environment 31 Aug 2020 - Present Other Supervisors: Prof. A K Sarje, Scholar: Ajey Kumar",
  "content_length": 4581,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:37"
}