{
  "name": "Manolis Koubarakis",
  "homepage": "http://cgi.di.uoa.gr/~koubarak",
  "status": "success",
  "content": "Manolis Koubarakis - Professor of Computer Science Professor in Artificial Intelligence Manolis Koubarakis Department of Informatics and Telecommunications National and Kapodistrian University of Athens Affiliated Researcher at Archimedes Unit EurAI Fellow & Board Member ELLIS Member Learn More Contact About Working in Artificial Intelligence and Data Science Professor in the Department of Informatics and Telecommunications, National and Kapodistrian University of Athens. Director of Graduate Studies (2020-2025). Recognition & Leadership Fellow of the European Association of Artificial Intelligence (EurAI) since 2015, and member of the EurAI Board since 2022. Former Vice-President and President of the Hellenic Association for Artificial Intelligence (2019-2022). Member of the Standing Scientific Committee for AI introduction in the Greek Justice system since March 2021. Academic Experience Technical University of Crete - Department of Electronic and Computer Engineering (Assistant and Associate Professor) University of Athens - Department of Informatics (Visiting Researcher) University of Manchester - Department of Computation, UMIST (now University of Manchester) (Lecturer) Imperial College London - Department of Computing (Research Associate) Education Ph.D. in Computer Science - National Technical University of Athens M.Sc. in Computer Science - University of Toronto B.Sc. in Mathematics - University of Crete Professional Affiliations Research Affiliations Archimedes Unit Athena Research Center EurAI Fellow & Board Member European Association for AI ELLIS Member European Lab for Learning & Intelligent Systems AI Team I am leading the AI team of the National and Kapodistrian University of Athens. See also the Web page of the Management of Data, Information and Knowledge Group (MaDgIK), a research group in the Department of Informatics and Telecommunications in which we participate. Our work focuses on various aspects of Artificial Intelligence and Data Science.",
  "content_length": 1997,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:40"
}