{
  "name": "Mantas Simkus",
  "homepage": "https://dbai.tuwien.ac.at/staff/simkus",
  "status": "success",
  "content": "Mantas Šimkus: Personal Page Mantas Šimkus I am an Assistant Professor in the Database and Artificial Intelligence Group at the Institute of Logic and Computation of TU Wien. Previously, I was an Associate Professor in the Department of Computing at Umeå University (Sweden). At Umeå University I was a Faculty Member in WASP Program (Wallenberg AI, Autonomous Systems and Software Program). Currently, I am a Principal Investigator in the FWF stand-alone project \"KtoAPP: Compiling Knowledge into Applications\". I am also a Key Researcher in the Cluster of Excellence âBilateral Artificial Intelligenceâ funded by FWF. Among other teaching and supervision activities, I teach Semi-structured Data and Deductive Databases at TU Wien. I am member of the Editorial Board of Artificial Intelligence Journal. In 2024, I served as a co-Chair of RuleML+RR 2024 and of the Recently Published Research Track of KR 2024. In 2020, I was an Editor of the Special Issue on Ontologies and Data Management at Künstliche Intelligenz. In 2019, I was a co-Chair of DL 2019. I am originally from the beautiful city of Vilnius, where I also did my Bachelor studies in Computer Science at Vilnius University. PUBLICATION LIST DBLP   GOOGLE SCHOLAR   LinkedIn Info for Students We are organizing The EurAI Summer School on Artificial Intelligence (ESSAI 2026) in Vienna (6 - 10 July 2026, Vienna). Consider attending! For TU Wien students: Here you can find a list of BSc/MSc thesis topics that I am offering. Among other teaching and supervision activities, I teach Semi-structured Data and Deductive Databases at TU Wien. For students interesting in a PhD: Exciting PhD Opportunities in Artificial Intelligence Across Top Austrian Institutions Are you passionate about tackling some of the most pressing challenges in Artificial Intelligence? Our consortium of six partner institutions in Austria is seeking talented and motivated PhD students to join us in cutting-edge research projects. We invite exceptional candidates to apply for fully funded PhD positions at JKU Linz, TU Wien, ISTA, TU Graz, AAU, and WU Wien. These positions are funded by the Cluster of Excellence âBilateral Artificial Intelligenceâ of the Austrian Science Fund FWF. For some concrete PhD projects at TU Wien, please click here. If you are excited about a PhD project, contact the corresponding PhD advisor (Key Researcher) to discuss the opportunities. For the general information about the Cluster of Excellence, please visit homepage of BILAI. My Research Interests Artificial Intelligence (AI) Description Logics Rule Languages Explainability in AI Decidable Fragments of First-order Logic Machine Learning for Explainable AI Transparency in Reinforcement Learning Semantic Web Languages (OWL, SHACL) Database Theory Combining Rules and Ontologies Knowledge Graphs Property Graphs Semantic Web Graph-structured Data Research Projects Ontology-mediated Queries for Graph Databases Principal Investigator Funding Agency: Austrian Science Fund (FWF) 3-year project / 351.078,00 Euros / ABSTRACT project ID: P30360-N35 People: Medina Andresel (PhD student) Labinot Bajraktari (PhD student) Shqiponja Ahmetaj (PostDoc) KtoAPP: Compiling Knowledge into Applications Principal Investigator Funding Agency: Austrian Science Fund (FWF) 4-year project / 350.910,00Â Euros / ABSTRACT project ID: P30873-N35 People: Federica Di Stefano (PhD student) Nadia Labai (PhD student) Shqiponja Ahmetaj (PostDoc) CoRec-Concept Recognition in Monitoring Data Funding Agency: Vienna Business Agency (From Science to Products 2019) Cooperation project involving Campfire Solutions, TU Wien, and the Free University of Bozen-Bolzano Principle Investigator at TU Wien 113K Euros at TU Wien People: Labinot Bajraktari (PostDoc) Logic-based Methods in Data Management Bilateral project with Poland Coordinator on the Austrian side 6.800,00 Euros from the Federal Ministry of Science, Research and Economy (Austria) Publications",
  "content_length": 3969,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:42"
}