{
  "name": "Manuel Alejandro Pajuelo Gonzalez",
  "homepage": "https://www.bsc.es/cv-mateo/8-theses",
  "status": "success",
  "content": "1. Summary | BSC-CNS Skip to main content 1. Summary Professor Mateo Valero, born in 1952 (Alfamén, Zaragoza), obtained his Telecommunication Engineering Degree from the Technical University of Madrid (UPM) in 1974 and his Ph.D. in Telecommunications from the Technical University of Catalonia (UPC) in 1980. He has been teaching at UPC since 1974; since 1983 he has been a full professor at the Computer Architecture Department. He has also been a visiting professor at ENSIMAG, Grenoble (France) and at the University of California, Los Angeles (UCLA). He has been Chair of the Computer Architecture Department (1983-84; 1986-87; 1989-90 and 2001-2005) and the Dean of the Computer Engineering School (1984-85). His research is in the area of computer architecture, with special emphasis on high performance computers: processor organization, memory hierarchy, systolic array processors, interconnection networks, numerical algorithms, compilers and performance evaluation. Professor Valero has co-authored over 700 publications: over 800 in Conferences and the rest in Journals and book chapters. He was involved in the organization of more than 300 International Conferences as General Chair (11), including ICS95, ISCA98, ICS99 and PACT01, Steering Committee member (85), Program Chair (26) including ISCA06, Micro05, ICS07 and PACT04, Program Committee member (200), Invited Speaker (70), and Session Chair (61). He has given over 400 talks in conferences, universities and companies. He has been an associate editor of IEEE Transactions on Parallel and Distributed Systems, the IEEE Micro Journal and IEEE Computer Architecture Letters, the Journal of Parallel Programming Languages, as well as guest editing several special issues of the IEEE Transactions on Computers and Computer Magazine. In the area of his research he has participated in 35 European ESPRIT, RACE and COMETT projects (for some of these projects, he was instrumental in obtaining the participation of Spanish industry), 20 Spanish CICYT projects (similar to NSF projects) and 13 projects with American companies as IBM, Intel, HP and Microsoft. From 1990 to 1995 Professor Valero created and directed the European Center for Parallelism of Barcelona (CEPBA) performing basic and applied research in parallel computing. He was also the director of C4, the Catalan Center for Computation and Communications, during 1995-2000. Since October 2000 to 2004, he has been the director of CIRI, the CEPBA-IBM Research Institute, created to conduct research on parallel computers. Since May 2004, he has been the director of Barcelona Supercomputing Center, the Spanish national supercomputing centre. From 1991 to 1993, he was the Spanish representative in the Rubbia Committee which defined the European Supercomputing Strategy. 2003 he was the Spanish Academy of Engineering representative in the EUROCASE (European Association of Academies) committee for the most prestigious awards in IT technologies in Europe. Professor Valero served on the research evaluation committee for engineering in Spain for 3 years and chaired it in 1998. For 3 years, he was a member of the committee for the Eckert-Mauchly award (the most prestigious award in Computer Architecture) and chaired this committee in 1999. Since April 2002, he has been a Member of the \"Ethics in Scientific and Technological Research\" consulting committee, and since February 2004, he has been a member of the “Science and Technology” consulting committee, both established by the Trust of the Spanish Foundation of Science and Technology. From September 2002 until May 2004, he was a member of the Advisory Board of the Intel Microprocessor Research Lab. From October 2005, he was member of the Telefonica Scientific Committee, from February 2006 spokesman of ST Microelectronics Advisory Board and from March 2006 member of the Nokia Advisory Board. He has been and is Board Advisor member for companies as ConSentry, Flowstorm and Xstream, dedicated to design processors for Internet. Since November 2008, he is the chairman for the Techical Advisory board of Telefónica and since December 2008 he is a member of the Advisory Board of the company Miraveo, oriented to the mobile market. He was awarded the Narcis Monturiol Award presented by the Generalitat (Government) de Catalunya in April 1994; the Salva i Campillo award presented by the Catalan Telecommunication Engineers Association in January 1996; Spain´s most prestigious award in recognition of outstanding basic research, the King Jaime I award presented by the Generalitat Valenciana, in July, 1997; the Spanish National Julio Rey Pastor award, in recognition of research in Mathematics and/or IT technologies presented by the Spanish Ministry of Science and Technology in October, 2001; in 2006 he was awarded with the Spanish National Award “Leonardo Torres Quevedo” that recognizes the research in engineering; the First Award “Distintion FibIT  to recognize research” presented by the Cercle FIBER, the Association of graduates students of the Computer Science Faculty  (FIB) of Barcelona in May, 2002; the Award “Distintion in recognition of research and the promotion of university research” presented by the Generalitat de Catalonia (July, 2003); and the Lifetime Award “Spanish Engineer in Telecommunications” presented by the Spanish Association of Telecommunication´s Engineers (October,  2004). In 2005, he received the Lifetime Award “Merits to Research” presented by the INP, Instituto Politécnico Nacional de Méjico and the Lifetime Award ARITMEL to the “Spanish Engineer on Computer Science”. In 2005 he also received the Premio Cambrescat for the best professional trajectory in the field on Information Technology and Communication, awarded by the Barcelona Chamber of Commerce, and was recognised as Aragon Scientist of the Year by the “Casas Regionales de Aragon”. He has also received two collective awards: as CEPBA’s Director, he received the 1994 Ciutat de Barcelona Technology Award, and as the Past Chair of the Computer Architecture Department, he received the “Fundación Universidad-Empresa” Award to the University Department with the best European research projects in 1992. In 2006 he was awarded by the Catalan Foundation for Research and Innovation as a researcher who have made a significant contribution to the development of science and technology in Catalonia. In 2007, he received the Eckert-Mauchly Award, the most important award in the world to recognize research in the field of computer architecture by the IEEE, Institute of Electrical and Electronics Engineers and the ACM, the Association for Computing Machinery, the special Award “Aragonés of the year 2007” to recognize research and he was elected knight of the “Royal Association of knights of the Monestir of Yuste”. In 2008 he was member of “Hall of fame” at ICT European Program, and selected as one of the 25 most influent european researchers in Information Technologies. In 2009, he received the Harry Goode Award from the IEEE, recognizing his contribution to vector, out-of-order, multithread and VliW processor architectures. In 2013, he received the ACM Distinguished service Award, recognizing his leadership of initiatives in high-performance computing research and education. In 2017, he received the “Charles Babbage” Award by IEEE. In December 1994, Professor Valero became a founding member of the Royal Spanish Academy of Engineering. In 2005 he was elected Correspondant Academic of the Spanish Royal Academy of Mathematics, Physics and Natural Sciences. In 2006, he was elected Academic of the Royal Academy of Science and Arts. In 2000 he became a Fellow of the IEEE, the Institute of Electrical and Electronics Engineers. In 2002, he became an Intel Distinguished Research Fellow and a Fellow of the ACM, the Association for Computing Machinery. In 1998 he won a “Favourite Son” Award of his home town, Alfamén (Zaragoza)and in 2006, his native town of Alfamén named their Public College after him. In 2008 he was awarded the “Aragón Award” , the most important award given by the Government of Aragón, he was given the Platinum Medal on occasion of the 75th Anniversary of the Guarantee of Origin of “Cariñena wines”. In 2008 he was also named Honorary Doctor by the University of Chalmers and by the University of Belgrade and in 2009, he was elected A member of the“Academia Europea”, the “Academy of Europe” and  he was named Honorary Doctor by the University of Las Palmas de Gran Canaria in Spain. In 2010, he was named Honorary Doctor by the University “Veracruzana”, in México and in 2011, he was named Honorary Doctor by the University of Zaragoza. In 2012, he was elected Correspondant Academic of the Mexican Academy of Science. In 2013, he was named Honorary Doctor by the University Complutense de Madrid and “Distinguish Service Award” for ACM. In 2014 he was receive the Honor of COEINF by the College of Computer Engineering, Barcelona and the Honor Award of the ACET, Catalan Association of Telecommunications Engineers and COEINF, College of Computer Engineering. In 2015 he received Seymour Cray Award 2015, presented by the IEEE Computer Society “in recognition of seminal contributions to vector, out-of-order, multithreaded, and VLIW architectures”. The Seymour Cray Computer Engineering award is one of the IEEE Computer Society’s highest awards, and is presented in recognition of innovative contributions to high-performance computing systems that best exemplify the creative spirit demonstrated by Seymour Cray. He also received the awards: “Euro-Par Achivement Award” in the Euro-Par conference in Vienna, Austria, FEI Award, Innovative Research Category 2015. Open Universe award, Knowdle Consortium Group, open category research 2015, Madrid. He was named Honorary Doctor by the Universities of Cantabria and Granada. In 2016, he received the Gold Medal by AMETIC (Multi-sector Association of Electronics Companies), in recognition of scientific contr",
  "content_length": 11379,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:46"
}