{
  "name": "Manuel Bodirsky",
  "homepage": "https://tu-dresden.de/mn/math/algebra/bodirsky",
  "status": "success",
  "content": "Startseite Professur für Algebra und Diskrete Strukturen — Professur für Algebra und Diskrete Strukturen — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © bodirsky Professur für Algebra und Diskrete Strukturen mehr erfahren Professur für Algebra und Diskrete Strukturen News Weitere News © ZML 01.06.2025 neu gegründet: ZML, Zeitschrift für Mathematische Logik Weiterlesen neu gegründet: ZML, Zeitschrift für Mathematische Logik © Fakultät Informatik 21.05.2025 Mitgliedschaft in der Fakultät Informatik Weiterlesen Mitgliedschaft in der Fakultät Informatik © algebra / Philipp Grzywaczyk 31.03.2025 ­POCOCOP-Meeting in Dresden Weiterlesen ­POCOCOP-Meeting in Dresden Weitere News Wichtige Themen im Überblick © privat Vorträge und Konferenzen Weiterlesen Vorträge und Konferenzen © iAlgebra Forschung Weiterlesen Forschung © Algebra/Zschalig Lehre Weiterlesen Lehre © M. Bodirsky Die Professur Weiterlesen Die Professur © M. Bodirsky Kooperatio­nen Weiterlesen Kooperationen © M. Bodirsky Professur für Algebra und diskrete Strukturen Manuel Bodirsky ist Professor für Algebra und Diskrete Strukturen am Institut für Algebra der TU Dresden. Seine Forschungsinteressensgebiete sind Universelle Algebra, klassische Modelltheorie, endliche Modelltheorie Constraint Satisfaction Probleme: Algorithmen und Komplexität Aktuelles Forschungsprojekt: POCOCOP ERC Synergy Grant, 01.03.2023--28.02.2029. Projektseite. Name Prof. Dr. Manuel Bodirsky E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Adresse work Besucheradresse: Willersbau, B 110 Zellescher Weg 12-14 01069 Dresden None Zeige Karte von diesem Ort. Name Sekretariat - Cindy Röhling E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Adresse work Besuchsadresse: Willersbau, B 110 Zellescher Weg 12-14 01069 Dresden Zeige Karte von diesem Ort. Adresse postal Postadresse: Technische Universität Dresden Fakultät Mathematik Institut für Algebra 01062 Dresden work Tel. nützliche Links Institut für Algebra Fakultät Mathematik QUANTLA © TCS4F Zur Webseite",
  "content_length": 2189,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:44"
}