{
  "name": "Manuel Álvarez Díaz",
  "homepage": "https://pdi.udc.es/es/File/Pdi/WJ6AF",
  "status": "success",
  "content": "Ficha de Manuel Álvarez Díaz Departamento Ciencias de la Computación y Tecnologías de la Información Área Ingeniería telemática Investigación Grupo de investigación Telemática Líneas de investigación Recuperación de Información Integración de Información Palabras clave Sistemas de virtualización de datos, sistemas de integración de datos, optimización de consultas en sistemas de integración de datos distribuidos, optimización en sistemas de crawling. Contacto Directorio de la UDC Orcid id0000-0001-7204-2689 ResearcherIDL-9574-2014 Scopus42960958000 Docencia impartida En este apartado se muestra la docencia impartida en grados, másteres y resto de estudios oficiales en los últimos 6 años. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Integración de Aplicaciones Grado en Ingeniería Informática Optativo 0 63 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 60 Programación Avanzada Grado en Ingeniería Informática Optativo 0 21 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 2,5 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 34 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 18,5 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 2 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Integración de Aplicaciones Grado en Ingeniería Informática Optativo 0 52 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 30 Programación Avanzada Grado en Ingeniería Informática Optativo 0 21 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 30,5 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 17,5 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 2 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Integración de Aplicaciones Grado en Ingeniería Informática Optativo 0 42 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 30 Programación Avanzada Grado en Ingeniería Informática Optativo 0 19 Redes Grado en Ingeniería Informática Obligatorio 0 15 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 2,5 Trabajo Fin de Grado. Mención en Sistemas de Información Grado en Ingeniería Informática Obligatorio 0 4 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 29 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 2 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Integración de Aplicaciones Grado en Ingeniería Informática Optativo 0 42 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 30 Prácticas en Empresa Grado en Ingeniería Informática Optativo 0 5 Programación Avanzada Grado en Ingeniería Informática Optativo 0 20,5 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 20 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 24 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Integración de Aplicaciones Grado en Ingeniería Informática Optativo 0 46 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 30 Programación Avanzada Grado en Ingeniería Informática Optativo 0 32 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 4 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 10 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Integración de Aplicaciones Grado en Ingeniería Informática Optativo 0 42 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 30 Prácticas en Empresa Grado en Ingeniería Informática Optativo 0 0 Prácticas en Empresa Grado en Ingeniería Informática Optativo 0 5 Programación Avanzada Grado en Ingeniería Informática Optativo 0 19 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 32 Tutorías 2025/2026 Tutorías definidas por el/la docente para el curso académico 2025/2026. Facultad de Informática Cuatrimestre Día Lugar Primer cuatrimestre martes 17:30 a 18:30 Despacho 0.18 / Teams Primer cuatrimestre martes 20:00 a 21:00 Despacho 0.18 / Teams Primer cuatrimestre miércoles 17:00 a 18:30 Despacho 0.18 / Teams Primer cuatrimestre miércoles 10:00 a 11:30 Despacho 0.18 / Teams Primer cuatrimestre viernes 10:30 a 11:30 Despacho 0.18 / Teams Trabajos de fin de grado y máster Dirigidos o codirigidos por el/la docente desde el año 2013. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 2017/2018 2016/2017 2015/2016 2014/2015 2013/2014 Aplicación móvil para el monitoreo emocional y seguimiento de hábitos Aplicación web destinada a la compraventa de productos de moda exclusivos de zapatería Aplicación web para competiciones basadas en dibujos Aplicación Web para Localizar Libros en Bibliotecas Cercanas Interfaz basada en Arrow Flight SQL para un sistema de integración de datos Sistema de Planificación de Guardias Médicas Aplicación Móvil para Gestión de Adicciones Aplicación para la compraventa de coches de segunda mano Aplicación web para comercializar productos hechos a mano y sus patrones Aplicación web para gestión de inscripción a eventos Diseño e implementación de una aplicación para el descubrimiento y localización de locales que proyecten deportes Gestor de notas con dictado y reproducción a través de pulsación automática de teclas Aplicación móvil para gestión de gastos personales Aplicación para coordinación de equipos para la prevención y extinción de incendios forestales Aplicación web para integración de diferentes herramientas internas de gestión de personal y proyectos Aplicación web para la organización y gestión de rutas geolocalizadas en eventos de grupos Aplicación web social LECER Desarrollo de una aplicación web para el alquiler de viviendas Aplicación web para geolocalización de elementos de una red de distribución eléctrica Componente para gestión de eventos de Apache Kafka en un software de integración de datos Componente para importar servicios web REST a partir de una especificación OpenAPI 3.0 en un sistema de integración de datos Componente para la creación de procedimientos almacenados basados en una lenguaje de scripting para un sistema de integración de datos Diseño e implementación de un sistema de pruebas de calidad para una aplicación web Diseño e Implementación de una aplicación de gestión deportiva Aplicación Web para entrenadores de equipos de baloncesto base Aplicación web para la gestión de asistencia social a domicilio en ayuntamientos Aplicación web para la gestión de reservas en hoteles de pequeño tamaño Aplicación web para la realización de pedidos y reservas de productos de alimentación en restaurantes Diseño e implementación de una aplicación de gestión de proyectos software Plataforma para la interoperabilidad de las declaraciones de IVA a nivel europeo Aplicación web para la gestión de adopción y localización de mascotas perdidas. Diseño e implementación de una aplicación para la gestión y monitorización de trabajos programados Diseño e Implementación de una aplicación web para el seguimiento de alumnos en guarderías Aplicación web de configuración y comparación de precios de ordenadores Aplicación web para aprender a programar usando la librería de Google Blockly Diseño e implementación de una aplicación web de apuestas deportivas Desarrollo de un sitio web para compra/venta de productos Diseño e implementación de un sitio web para gestión de mascotas en adopción y acogida. Diseño e Implementación de una Aplicación utilizando Tecnologías Java. Diseño e Implementación de una Aplicación de Gestión para un Albergue. Sistema para la gestión del registro público de entidades de formación. Integración en la arquitectura SOA del Servicio Público de Empleo Aplicación web de gestión de menús en una cafetería universitaria Diseño e implementación de una aplicación web para compartir imágenes geolocalizadas Diseño e implementación de una aplicación de gestión de eventos de ocio Aplicación web de gestión de experimentos de laboratorio utilizando tecnologías Java EE Diseño e implementación de una aplicación utilizando tecnologías Java EE Diseño e implementación de una web de agregación de redes sociales Puede consultar los méritos de investigación seleccionando un tipo de mérito y el año. Proyectos, contratos y convenios de I+D+I Patentes, registros y modelos de utilidad Artículos en revistas de investigación Libros completos Capítulos de libros Tésis doctorales dirigidas Comunicaciones en congresos 2025 2024 2023 2022 2021 ... 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 1999 Entidad financiadora Denodo S.L. Investigadores principales Juan Raposo Santiago Tipo Contrato Fechas Desde 16/04/2025 a 15/04/2026 Entidad financiadora Consellería de Educación, Ciencia, Universidades e Formación Profesional Investigadores principales Fidel ",
  "content_length": 33528,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:58"
}