{
  "name": "Manuel E. Bermudez",
  "homepage": "http://www.cise.ufl.edu/~manuel",
  "status": "success",
  "content": "Manuel Enrique Bermúdez Home Page Manuel Enrique Bermúdez THEN ... and NOW ... I'm a retired faculty member with the University of Florida's Computer and Information Science & Engineering Department. As of Fall 2020, I've been re-hired as a part-time Adjunct Associate Professor. Here is my RESUME (short version), in PDF format. Email address:manuel@cise.ufl.edu Office: E574 CSE Phone: 352-505-1549 Office hours: M,W,F: 7th ON LEAVE FALL 2014, as a Fulbright Scholar at the University of Costa Rica. More information about the Fulbright program HERE Two quotes from the hit TV series \"The West Wing\", in which Josh Lyman is a Fulbright Scholar: Josh: \"I'm a Fulbright Scholar, Mrs. Landingham. I don't leer\". (Season 1, Episode 6). See video clip. Danny: \"Hey, when you won a Fulbright Scholarship, you taped the letter to your face!\" (Season 4, Episode 15). See video clip. Curso de Tópicos Especiales en la Universidad de Costa Rica. Conferencia de Paradigmas en la Universidad de Costa Rica. Conferencia de Scrum en la Conferencia InNgenio, Medellín, Colombia, agosto 25, 2016, y en la Universidad Privada del Norte, Trujillo, Perú, 27 de octubre, 2016. This is my third Fulbright award. I spent the 2003-2004 academic year, and the first half of 2004-2005, as a Fulbright Scholar doing research, teaching, and writing a textbook at the Universidad de los Andes, in Merida, Venezuela. I also spent the 1996-97 academic year as a Fulbright Scholar doing research and teaching at the University of Costa Rica. Visitors to my page: I was the Program Committee Chair for the 2007 (México), 2009 (Venezuela), 2010 (Perú) and 2011 (Colombia) LACCEI (Latin American and Caribbean Consortium of Engineering Institutions) conferences. Universidad Ricardo Palma - CURSO DE COMPILADORES (OPCIONAL, 120MB) - Compiladores.Principios.Tecnicas.y.Herramientas.pdf Universidad de los Andes - SEMINARIO DE TRADUCCIÓN Universidad de los Andes - CURSO DE SINTAXIS Y SEMÁNTICA DE LENGUAJES DE PROGRAMACIÓN While in Venezuela, I found that a distant relative of mine distinguished himself in the Liberation War of 1821, under El Libertador General Simón Bolívar. El General and his Lieutenants are immortalized in this impressive monument in downtown Caracas. Click on the pictures to see larger ones. Dang, I even look like him ! A while back I hosted C++ designer Bjarne Stroustrup as a Barr Systems Distinguished Lecturer. He gave two talks: Standard-Library Exception Safety , and Multiparadigm Programming in Standard C++ . TEACHING FALL 2020: COP-4020 Programming Language Concepts (UFOnline) HERE'S MY (NOT SO) RECENT BOOK: Study Guide for C Programming, A Modern Approach. While we're at it, here are some of my favorite OBFUSCATED C programs INFORMACION PARA ESTUDIANTES EN LATINOAMERICA Para obtener informacion (en ingles) acerca del Departamento de Computacion de la Universidad de la Florida (incluyendo informacion acerca de nuestros programas de pos-grado, presione AQUI Items of interest: My friend and mentor, David Huffman (of Huffman codes fame), who died in 1999. The University of Costa Rica's home page (my alma mater!).",
  "content_length": 3125,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:48"
}