{
  "name": "Manuel Lopes 0001",
  "homepage": "http://web.tecnico.ulisboa.pt/manuel.lopes",
  "status": "success",
  "content": "Manuel LopesInstituto Superior TecnicoGAIPS - TagusParkAv. Prof. Doutor Anibal Cavaco Silva2744-016 Porto Salvo, Portugalmanuel . lopes @ tecnico . ulisboa . pt Short info: I am an associate professor at Instituto Superior Tecnico and a senior researcher at INESC-ID.I am interested in understanding artificial and natural learning. Understanding learning gives amazing insights into human nature and will allow developing technologies to improve our well-being. To this end, I develop models of learning for animals and develop new learning methodologies for machines. Topics of Interest: applied machine learning, computational sustainability, interactive systems, human-machine collaborationTeam: Ziqi Huang (phd student, jointly with Nuno Nunes) - Automatic Analysis of Soundscapes in the River Jacopo Silvestrin (phd student, jointly with Francisco Melo) - Non-stationary Reinforcement Learning Pedro Fernandes (phd student, jointly with Rui Prada) - Automatic Verification of Games Former: Carla Guerra Baptiste Busch Yoan Mollard Thibaut Munzer Jonathan Grizou Projects Carma (EU) - Collaborative Autonomous Robots for eMergency Assistance WSmart+ (PT) - WSmart Route+ : Towards a Smart Waste Collection Route Planning System Relevant (PT) - Efficient deep RL in non-stationary environments Past Projects iv4xr (EU) - iv4XR: Intelligent Verification/Validation for Extended Reality Based Systems Slice (PT) Infoocus (PT) IGLU - Interactive Grounded Language Understanding Language 3rdHand (FP7 ICT, EU - coordinator) - Semi Autonomous 3rdHand Robot Neurocuriosity (with Columbia University, USA) KidLearn (CRA, FR - coordinator) - Adaptive Online Personalization of Learning Activities ARAUI (CRA, FR - coordinator) - Apprentissage automatique en robotique pour l'adaptation aux utilisateurs a travers l'interation MACSi (FR) - Motor, Affective and Cognitive Scaffolding for iCub First-MM (EU) - First Mobile Manipulation Handle (EU) - Developmental pathway towards autonomy and dexterity in robot in-hand manipulation Modern Monte Carlo Algorithms for Computational Control (PT) Robotcub (EU) - ROBotic Open-architecture Technology for Cognition, Understanding, and Behaviours Contact (EU) - Learning and development of Contextual Action Baltazar Humanoid Torso Mirror (EU) - Mirror Neurons for Object Recognition Rescue (PT) - Cooperative Navigation for Rescue Robots ISocRob (PT) - Intelligent Society of Robots Reinforcement Learning and Toy Robots Publications Google scholar",
  "content_length": 2487,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:49"
}