{
  "name": "Manuel Gomez-Rodriguez [SWS]",
  "homepage": "https://www.mpi-sws.org/~manuelgr",
  "status": "success",
  "content": "Manuel Gomez Rodriguez Manuel Gomez Rodriguez Home News Resume Research Publications Teaching Software Talks Group Follow @autreche Manuel Gomez Rodriguez Manuel Gomez Rodriguez, Ph.D. () Faculty (W2) Max Planck Institute for Software Systems Learn about my research: Research Statement (uploaded 14.06.24) Latest News Stratis and Nina have recently obtained their PhDs and are moving to Hasso Platner Institute and the Max Planck Institute of Biochemistry as postdocs! (30.10.25) We have released a new preprint on Narrowing Action Choices with AI Improves Human Sequential Decisions (with E. Straitouri, S. Tsirtsis and A. Artola Velasco)! (21.10.25) We have released a new preprint on \"Auditing Pay-Per-Token in Large Language Models\" (with A. Artola Velasco and S. Tsirtsis)! (08.10.25) We have released a new preprint on \"Towards Human-AI Complementarity in Matching Tasks\" (with A. Arnaiz-Rodriguez, N. Corvelo Benz, S. Thejaswi and N. Oliver)! (20.08.25) Our paper \"Human-Alignment Influences the Utility of AI-assisted Decision Making\" (with N. Corvelo Benz) has been accepted at Nature Scientific Reports! (15.07.25) We have released a new preprint on \"Canonical Autoregressive Generation\" (with N. Chatzi, N. Corvelo Benz and S. Tsirtsis)! (10.06.25) We have released a new preprint on \"Is Your LLM Overcharging You? Tokenization, Transparency, and Incentives\" (with A. Artola Velasco, S. Tsirtsis and N. Okati)! (29.05.25) Our perspective \"Artificial intelligence for modelling infectious disease epidemics\" (with M. U. G. Kraemer, J. L.-H. Tsui, S. Y. Chang, S. Lytras, M. P. Khurana, S. Vanderslott, S. Bajaj, N. Scheidwasser, J. L. Curran-Sebastian, E. Semenova, M. Zhang, H. J. T. Unwin, O. J. Watson, C. Mills, A. Dasgupta, L. Ferretti, S. V. Scarpino, E. Koua, O. Morgan, H. Tegally, U. Paquet, L. Moutsianas, C. Fraser, N. M. Ferguson, E. J. Topol, D. A. Duchêne, T. Stadler, P. Kingori, M. J. Parker, F. Dominici, N. Shadbolt, M. A. Suchard, O. Ratmann, S. Flaxman, E. C. Holmes, B. Schoelkopf, C. A. Donnelly, O. G. Pybus, S. Cauchemez and S. Bhatt) has been published at Nature Magazine! (19.02.25) We have released a new preprint on \"Evaluation of Large Language Models via Coupled Token Generation\" (with N. Corvelo Benz, S. Tsirtsis, E. Straitouri, I. Chatzi, A. Artola Velasco and S. Thejaswi)! (05.02.25) Our papers \"Counterfactual Token Generation in Large Language Models\" (with I. Chatzi, N. Corvelo Benz, E. Straitouri and S. Tsirtsis) and \"Matchings, Predictions and Counterfactual Harm in Refugee Resettlement Processes\" (with S. Lee, N. Corvelo Benz and S. Thejaswi) have been accepted at CLeaR 2025! (28.01.25) We have released a new preprint on \"Human-Alignment Influences the Utility of AI-assisted Decision Making\" (with N. Corvelo Benz)! (27.01.25) I have received an ERC Consolidator Grant on Counterfactuals in Minds and Machines and I am looking for phd students and postdocs! Drop me an e-mail for informal inquiries! (03.12.24) Older news Contact mail: manuel[at]mpi-sws.org voice: +49 (631) 9303-8301 office (mpi): MPI-SWS, Paul-Ehrlich-Strasse, Building G26, D-67663 Kaiserslautern, Germany Do you like how this site look? Check out jemdoc. Imprint / Data Protection",
  "content_length": 3212,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:49"
}