{
  "name": "Manuel Campos",
  "homepage": "http://webs.um.es/manuelcampos",
  "status": "success",
  "content": "Manuel Campos Manuel Campos Manuel Campos Martinez Associate Professor Computer Science Faculty University of Murcia Contact info email: manuelcampos AT um.es phone: +34 868888521 Address: Despacho 2.25. Facultad de Informatica. Universidad de Murcia. Campus de Espinardo. CP. 30100, Murcia, SPAIN Bio & Education Short bio Manuel Campos started his research activities in the AIKE research group has been the main researchers in an European Project, in several national research projects, and contracts focused on clinical applications of the research lines, with more than 100 national and international conferences, and journals. He is focused on technology transfer of clinical decision support systems. He is the main researcher in 4 technology contracts with the public Healthcare National and Regional System. He has been Vice Dean for External Relations of the Faculty of Computer Science (2010-2012). He has been Coordinator of Internships in the Studies Vicerrectorate of the University of Murcia (2012-2017). Education 2007. PhD in Computer Sciente. Title: \"Temporal Abstraction With Fuzzy Temporal Constraints Networks\". Best PhD student award. 2001. 5-year BSc in Computer Engineering. Best BSc Student Award. Up Research Research interests Clinical intelligent systems. Data analysis and mininig. Business intelligence. Computational biology. Medical informatics. Publications Last research projects SITSUS Clinical decision support system for infection surveillance / Sistema de ayuda a la decisión clínica para la vigiliancia de infecciones. RTI2018-094832-B-I00 (2019-2021). Main researcher.See more. WASPSS Wise Antimicrobial Stewardship Program Support System. Ref: TIN2013-45491-R (2014-2017). Main researcher.See more. AI-SENIOR (2011-2014).See more. Teaching Bachelor BSc Computer Science: Software Engineering. Master MSc Big Data: Business Intelligence. MSc Computer Science: Business Intelligence in Biomedicine. Thesis Supervision Undergraduate thesis. See info. Master thesis. See info. PhD thesis. Contact me!",
  "content_length": 2039,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:46"
}