{
  "name": "Marco Di Natale",
  "homepage": "http://retis.sssup.it/~marco",
  "status": "success",
  "content": "Marco Di Natale Research   Teaching   Personal   Contact Quick links Home Courses Research Projects Publications Exams Personal Links Marco Di Natale Associate Professor of Computer Science +39 050 882020 marco@sssup.it Prof. Marco Di Natale is currently an IEEE Senior member and an Associate Professor at the Scuola Superiore SantAnna of Pisa, Italy, in which he held a position as Director of the Real-Time Systems (ReTiS) Lab from 2003 to 2006. He received his PhD from Scuola Superiore SantAnna in 1991. He was a visiting Researcher at the University of California, Berkeley in 2006 and 2008. He has been selected in 2006 by the Italian Ministry of Research as the national representative in the mirror group of the ARTEMIS European Union Technology platform. He's been a researcher in the area of real-time systems and embedded systems for more than 15 years, being author or co-author of more than 100 scientific papers. He has been winner of four best paper awards and one best presentation awards at the Design Automation Conference. He has served as Program Committee member and has been organizer of tutorials and special sessions for the main conferences in the area, including the Real-time Systems Symposium, the IEEE/ACM Design Automation Conference (DAC), the Design Automation and Test in Europe (DATE) and the Real-Time Application Symposium in which he also served as Track Chair (RTAS). He has been associate editor for the IEEE Transactions on CAD and is currently in the editorial board of the IEEE Transactions on Industrial Informatics. He started working in the automotive field in the late 90's, on the development of an OSEK-compliant real-time operating systems for muticore platforms in cooperation with Magneti Marelli and ST Microelectronics. In 2006 he worked with the General Motors bay area labs in California and then General Motors R&D in Warren (MI) where he's been technical lead in the area of architecture exploration and evaluation until 2007. He is currently a member of the EU ADAMS project automotive expert group.",
  "content_length": 2060,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:35"
}