{
  "name": "Marc Toussaint",
  "homepage": "https://www.user.tu-berlin.de/mtoussai/index.html",
  "status": "success",
  "content": "Marc Toussaint | Prof. Dr. Marc Toussaint @ TU Berlin Prof. Dr. Marc Toussaint TU Berlin Marchstr. 23, MAR 4-4 10587 Berlin, Germany toussaint@tu-berlin.de General Inquiries: office@lis.tu-berlin.de Admin: Ilaria Cicchetti-Nilsson i.cicchetti-nilsson@tu-berlin.de tel: +49 30 314 70 140 I am professor in the area of AI & Robotics at TU Berlin, lead of the Learning & Intelligent Systems Lab at the EECS Faculty, and member of the Science Of Intelligence cluster of excellence. Youâre welcome to visit my Google Scholar, GitHub, LinkedIn, ResearchGate, orcid, and arXiv sites. Please see also the Publications and Teaching material. My research interests are in the intersection of AI and robotics, namely in using machine learning, optimization, and AI reasoning to tackle fundamental problems in robotics. The integration of learning and reasoning, of data-based and model-based decision making is of particular interest to me. Concrete research topics we work on are models and algorithms for physical reasoning, task-and-motion planning (logic-geometric programming), learning heuristics, the planning-as-inference paradigm, algorithms and methods for robotic building construction, and learning to transfer model-based strategies to reactive and adaptive real-world behavior. To this end, we build on methodologies from optimization, reinforcement learning, machine learning, search, planning, and probabilistic inference. Some of my earlier work was on evolutionary algorithms (esp. evolving genetic representations and compression), relational reinforcement learning, and active learning. My physics diploma research was on gravity theory as a gauge theory. Infos Updated teaching material for the Robot Learning and Optimization Algorithms courses Robotic Python Package: I finally packaged our basic code in a bit more user-friendly way: Have a look at the robotic python package and the tutorials. I just updated a page with old projects, including on Planning-as-Inference, Sensorimotor Maps, and Evolutionary Algos List of talks on youtube Student Contact: Please contact the LIS office with any requests. Please see the LIS Teaching Page for updates on our teaching this winter term. I updated the Maths for Intelligent Systems script, which summarizes essential background for my lectures. MSc/BSc requests: Please submit your interest via ISIS. We can only offer theses projects to students enrolled at TU Berlin. We cannot help external students to enroll at TU Berlin â please see here for information on how to apply for MSc/BSc programs at TU Berlin. If you have any questions, please contact the LIS office Positions since 03/20 Full Prof. at TU Berlin; head of the Learning and Intelligent Systems Lab. 11/18-06/21 Max Planck Fellow with the MPI for Intelligent Systems 08/17-07/18 Visiting Scholar at CSAIL, MIT (LIS group) 04/17-07/17 Lead of the ML-Robotics lab at Amazon, Berlin 12/12-02/20 Full Prof. at University of Stuttgart; head of the Machine Learning and Robotics Lab. 10/10-11/12 Prof. (W1) at the Department of Math and Computer Science, FU Berlin; head of the Machine Learning and Robotics Lab at FU Berlin 3/07-10/10 Head of the Machine Learning and Robotics group (Emmy Noether Programme) at the IDA lab (Klaus-Robert Müller), TU Berlin. 8/06-2/07 Guest scientist at the Honda Research Institute, Offenbach. 6/04-6/06 Post doc at the Machine Learning group (Chris Williams) and the Statistical Machine Learning and Motor Control group (Sethu Vijayakumar), University of Edinburgh. 4/00-5/04 PhD student (& brief post doc) at the Adaptive Systems group, Institut für Neuroinformatik (Werner von Seelen), Ruhr-Universität-Bochum. 6/98-3/00 MSc student at the Cologne gravity group (Friedrich W. Hehl), Institute for Theoretical Physics, U Cologne. Enter your search term...",
  "content_length": 3813,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:07"
}