{
  "name": "Marcelo Soares Pimenta",
  "homepage": "http://inf.ufrgs.br/~mpimenta",
  "status": "success",
  "content": "Marcelo Soares PIMENTA - Instituto de Informática Sobre / Mini-Bio (English): Marcelo S. Pimenta is Full Professor at Institute of Informatics (INF), Federal University of Rio Grande do Sul (UFRGS), Porto Alegre, south of Brazil. He received his PhD in Computer Science from Université Toulouse 1 (France) in 1997 - at Laboratoire LIIHS “Logiciel Interactif et Interaction Homme-Système” (Interactive Software and Human Computer Interaction team) of University of Toulouse 1 Capitole, Toulouse, France under the supervision of Marie-France Barthet and Philippe Palanque. He is head of Laboratório de Computação Musical (LCM), the UFRGS Computer Music Laboratory. Since 1998, he is member of a multidisciplinary research group at INF/UFRGS working with topics in Human-Computer Interaction , Software Engineering and Computer Music with emphasis in the integration of these areas. Currently his research is focused on adaptive interfaces, networked music, ubiquitous music, synergistic modeling, human aspects of software development, user-centered software engineering and, more recently, new forms of governance and the delivery of public services with the support of Information Technologies. Before (from 1990 until 1998) , I was lecturer in the Departamento de Informática and Estatística (INE) of the Federal University of Santa Catarina (UFSC), Florianópolis, Brazil and vice-coordinator of LabiUtil - a Brazilian pioneer Usability Lab. (Português): É professor titular no Instituto de Informática da UFRGS onde atua desde 1998 em atividades de ensino de graduação e pós-graduação, bem como orientação de alunos de mestrado e doutorado. Graduou-se em Ciência da Computação pela UFRGS em 1988, concluiu o mestrado também em Ciência da Computação no PPGC-UFRGS em 1991 e o Doutorado em Informática na Université Toulouse 1 em Toulouse, França, em 1997, sob a orientação da Profa. Marie-France Barthet e do Prof. Philippe Palanque. Em 2002-2003, realizou estágio sabático curto (3 meses) na Université Paul Sabatier (IRIT) em Toulouse, França. Desde 1988 tem desenvolvido pesquisa multidisciplinar nas áreas de Interação Homem Computador, Engenharia de Software, Computação Musical e principalmente na integração entre estas áreas. É coordenador do LCM (Laboratório de Computação Musical) no INF-UFRGS e do Grupo de Trabalho em Governança Digital do Centro de Estudos Internacionais sobre Governo (CEGOV) na UFRGS. Endereço Instituto de Informática Universidade Federal do Rio Grande do Sul Caixa postal 15064 Av. Bento Gonçalves, 9500 91501-970 Porto Alegre, RS E-mail mpimenta at inf.ufrgs.br00071807 at ufrgs.br Skype marcelo.soares.pimenta Telefone +55 51 3308 6814 Curso de Graduação INFO1022 Laboratório de Sistemas de Software Curso de Graduação INFO1120 Técnicas de Construção de Programas Curso de Pós-Graduação CMP102 Engenharia de Software Interação Humano-Computador (Human-Computer Interaction - HCI) Computação Musical (Computer Music) Engenharia de Software (Software Engineering)",
  "content_length": 2998,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:23"
}