{
  "name": "Marcos Zampieri",
  "homepage": "http://www.marcoszampieri.com",
  "status": "success",
  "content": "Marcos Zampieri Marcos Zampieri Assistant Professor School of Computing George Mason University Fairfax, VA, USA About I am an Assistant Professor at the School of Computing at George Mason University. My research interests are in computational linguistics and natural language processing. My research aims to enhance our understanding of human language and communication while, in turn, developing more robust and safer NLP systems in various domains such as education and healthcare. Below is a list with selected publications. For a full list of publications please check Google Scholar. Recent Selected Publications mHumanEval - A Multilingual Benchmark to Evaluate Large Language Models for Code Generation Nishat Raihan, Antonios Anastasopoulos, Marcos Zampieri NAACL (2025) pdf Large Language Models in Computer Science Education: A Systematic Literature Review Nishat Raihan, Mohammed Latif Siddiq, Joanna CS Santos, Marcos Zampieri SIGCSE (2025) pdf Annotator Reliability Through In-Context Learning Sujan Dutta, Deepak Pandita, Tharindu Weerasooriya, Marcos Zampieri, Christopher Homan, Ashiqur KhudaBukhsh AAAI (2025) pdf A Survey of Multimodal Sarcasm Detection Shafkat Farabi, Tharindu Ranasinghe, Diptesh Kanojia, Yu Kong, Marcos Zampieri IJCAI (2024) pdf Language Variety Identification with True Labels Marcos Zampieri, Kai North, Tommi Jauhiainen, Mariano Felice, Neha Kumari, Nishant Nair, Yash Bangera LREC-COLING (2024) pdf Native Language Identification in Texts: A Survey Dhiman Goswami, Sharanya Thilagan, Kai North, Shervin Malmasi, Marcos Zampieri NAACL (2024) pdf Target-Based Offensive Language Identification Marcos Zampieri, Skye Morgan, Kai North, Tharindu Ranasinghe, Austin Simmmons, Paridhi Khandelwal, Sara Rosenthal, Preslav Nakov ACL (2023) pdf Vicarious Offense and Noise Audit of Offensive Speech Classifiers Tharindu Weerasooriya, Sujan Dutta, Tharindu Ranasinghe, Marcos Zampieri, Christopher Homan, Ashiqur KhudaBukhsh EMNLP (2023) pdf ALEXSIS-PT: A New Resource for Portuguese Lexical Simplification Kai North, Marcos Zampieri, Tharindu Ranasinghe COLING (2022) pdf Handling Extreme Class Imbalance in Technical Logbook Datasets Farhad Akhbardeh, Cecilia O. Alm, Marcos Zampieri, Travis Desell ACL (2021) pdf Multilingual Offensive Language Identification with Cross-lingual Embeddings Tharindu Ranasinghe, Marcos Zampieri EMNLP (2020) \t\tpdf Predicting the Type and Target of Offensive Posts in Social Media Marcos Zampieri, Shervin Malmasi, Preslav Nakov, Sara Rosenthal, Noura Farra, Ritesh Kumar NAACL (2019) pdf Books Automatic Language Identification in Texts Tommi Jauhiainen, Marcos Zampieri, Timothy Baldwin, Krister Lindén Synthetisis Lectures on Human Language Technologies Springer (2024) Similar Languages, Varieties, and Dialects: A Computational Perspective Marcos Zampieri, Preslav Nakov (Editors) Studies in Natural Language Processing Cambridge University Press (2021) Last Updated: April 2025 | Template: Plain Academic",
  "content_length": 2980,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:00"
}