{
  "name": "Marco Gaboardi",
  "homepage": "http://cs-people.bu.edu/gaboardi",
  "status": "success",
  "content": "Marco Gaboardi Marco Gaboardi Ph.D. Torino (I) - Nancy (F) I am a Professor in the Computer Science department at Boston University. My research is in computer science with a focus on Programming Languages, Formal Methods and Differential Privacy. I am a member of the Principles of Programming and Verification (POPV) and of the Boston-area Data Privacy groups. I am also Chief Scientist at DPella. Some events: ACM International Conference on Functional Programming 2024 Shonan Meeting: Differential Privacy and its Applications 2024 Oregon Programming Languages Summer School at Boston University 2024 ACM/IEEE Symposium on Logic in Computer Science 2023 Formal Structures for Computation and Deduction 2023 Boston Differential Privacy Summer School 2022 Oregon Programming Languages Summer School 2022 Theory and Practice of Differential Privacy Workshop series (TPDP) Students and Postdocs: Current Jared Pincus (PhD student - coadvised with Alley Stoughton) Connor Wagaman (PhD student - coadvised with Adam Smith) June Wunder (PhD student) Ugur Yavuz (PhD student - coadvised with Alley Stoughton) Cheng Zhang (PhD student) Former Jiawen Liu (PhD student) Arthur Azevedo de Amorim (Postdoc) Elisabet Lobo Vesga (PhD student at Chalmers, coadvised with Alejandro Russo) Snigdha Kalathur (Undergraduate student) Weihao Qu (PhD) Gian Pietro Farina (PhD) Luca Fossati (Postdoc) Charles Grellois (Postdoc) Tetsuya Sato (Postdoc) Teaching: USI short course - Summer 2024 - Formal Reasoning in Security and Privacy CS 599 G1 - Spring 2024 - Formal Methods in Security and Privacy PhD Seminar at Chalmers University - Differential Privacy: Theory and Verification in EasyCrypt CS 599 G1 - Spring 2022 - Formal Proofs about Programs CS 320 - Fall 2021 - Concepts of Programming Languages CS 591 - Spring 2021 - Formal Methods in Security and Privacy CS 697 - Spring 2021 - Graduate Initiation Seminar CS 320 - Fall 2020 - Concepts of Programming Languages CS 591 - Spring 2020 - Formal Methods in Security and Privacy CS 320 - Fall 2019 - Concepts of Programming Languages - piazza Previous teaching at the University at Buffalo and the University of Dundee Projects: Collaborative Research: SaTC: CORE: Small: Mechanized Cryptographic Reasoning in Separation Logic (NSF) DASS: Co-design of law and computer science for privacy in sociotechnical software systems (NSF) Towards an End-to-End Approach to Formal Privacy for Sample Surveys (US Census CA) CAREER: FormalDP: Formally Verified, Private, Accurate and Efficient Data Analysis (NSF) SHF: Small: Collaborative Research: Programming Tools for Adaptive Data Analysis (NSF) TWC: Large: Collaborative: Computing over Distributed Sensitive Data (NSF) PrivInfer\t- Programming Languages for Differential Privacy: Conditioning and Inference (EPSRC) Privacy Tools for Sharing Research Data (NSF)- Visiting Scholar Platform: Practical Light Types for Resource Consumption (EU) Putting Differential Privacy to Work (NSF) - Visiting Scholar INRIA ARC: Eternal INRIA EA: Cristal, Semacode CNRS Pics: Logique Lineaire et Application Contacts: Boston University Department of Computer Science 645 Commonwealth Avenue, Room 1019 Boston, MA 02215, USA e-mail: gaboardi@bu.edu phone: +1 671-353-3971 Education and Employment: Professor - Boston Univ. (2025-now) Associate Professor - Boston Univ. (2021-2025) Assistant Professor - Boston Univ. (2019-2021) Assistant Professor - Buffalo (2016-2019) Visiting Scholar - Simons@Berkeley (2019) Visiting Scholar - Harvard CRCS (2015) Lecturer and Fellow - Dundee (2013-2015) Marie Curie - Bologna, UPenn (2011-2013) Postdoc - Torino, Bologna, Paris 13 (2008-11) Ph.D. Comp. Science - Torino, Nancy (2007) MSc Comp. Science - Milano Bicocca (2004) BSc Comp. Science - Milano Bicocca (2002)",
  "content_length": 3770,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:38"
}