{
  "name": "Marco Guarnieri",
  "homepage": "https://mguarnieri.github.io",
  "status": "success",
  "content": "Marco Guarnieri Marco Guarnieri Associate professor IMDEA Software Institute Biography I am an associate professor at the IMDEA Software Institute. Before that, I completed my Ph.D. at the Institute of Information Security at ETH Zurich. My research focuses on the design, analysis, and implementation of practical systems for securely storing and processing sensitive data. Recently, I have been working on building foundations and tools for reasoning about security at the hardware-software boundary, with a specific focus on microarchitectural attacks and defenses. Interests Security and privacy Programming languages Formal methods Education PhD in Computer Science, 2017 ETH Zurich MSc in Computer Engineering, 2012 Università degli Studi di Bergamo BSc in Computer Engineering, 2010 Università degli Studi di Bergamo News 2025/02/11 - Our paper on testing secure speculation countermeasures of microarchitectural simulators has been accepted at ASPLOS 2025 2024/11/08 - Our paper on combining speculative semantics for secure compilation has been accepted at POPL 2025 2024/10/18 - Our CCS 2024 paper received a best paper award! 2024/04/04 - Our paper on testing with leakage models has been accepted at CCS 2024 2024/02/01 - New paper on testing the security guarantees of future microarchitectures with leakage models 2023/12/10 - Our paper on synthesis of leakage contracts has been accepted at DATE 2024 2023/11/30 - Our CCS 2023 paper received a distinguished paper award! 2023/07/16 - Our paper on hardware verification has been accepted at CCS 2023 2023/06/29 - New paper on hardware verification for leakage contracts! 2023/01/18 - Our paper on testing for microarchitectural leaks has been accepted at S&P 2023 2022/11/10 - Our CCS 2022 paper received a distinguished paper award! Publications Bo Fu, Leo Tenenbaum, David Adler, Assaf Klein, Arpit Gogia, Alaa R. Alameldeen, Marco Guarnieri, Mark Silberstein, Oleksii Oleksenko, Gururaj Saileshwar (2025). AMuLeT: Automated Design-Time Testing of Secure Speculation Countermeasures. ASPLOS 2025. PDF Cite Project Xaver Fabian, Marco Patrignani, Marco Guarnieri, Michael Backes (2025). Do You Even Lift? Strengthening Compiler Security Guarantees against Spectre Attacks. POPL 2025. PDF Cite Code Project arXiv version Gilles Barthe, Marcel Böhme, Sunjay Cauligi, Chitchanok Chuengsatiansup, Daniel Genkin, Marco Guarnieri, David Mateos Romero, Peter Schwabe, David Wu, Yuval Yarom (2024). Testing side-channel security of cryptographic implementations against future microarchitectures. CCS 2024. PDF Cite Code Project arXiv version Distinguished paper award Gideon Mohr, Marco Guarnieri, Jan Reineke (2023). Synthesizing Hardware-Software Leakage Contracts for RISC-V Open-Source Processors. DATE 2024. PDF Cite Code Project Project arXiv version Zilong Wang, Gideon Mohr, Klaus von Gleissenthall, Jan Reineke, Marco Guarnieri (2023). Specification and Verification of Side-channel Security for Open-source Processors via Leakage Contracts. CCS 2023. PDF Cite Code Project Extended version (arXiv) Distinguished paper award Oleksii Oleksenko, Marco Guarnieri, Boris Köpf, Mark Silberstein (2023). Hide and Seek with Spectres: Efficient discovery of speculative information leaks with random testing. S&P 2023. PDF Cite Code Project Extended version (arXiv) See all publications Projects Hardware/software co-design for secure speculation Reasoning about speculative execution attacks Automatically learning micro-architectural models Provably secure access and inference control in databases Open positions I am always looking for talented people (research interns, PhD students, and postdocs) to join my research group at IMDEA Software to work on security at the hardware-software interface. In case you are interested, contact me via email. Contact marco.guarnieri@imdea.org (+34) 91-101-2202 ext 4320 Campus Montegancedo UPM s/n, Pozuelo de Alarcón, Madrid 28223 Cite × Copy Download",
  "content_length": 3955,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:38"
}