{
  "name": "Marc-Olivier Killijian",
  "homepage": "https://kirija.github.io",
  "status": "success",
  "content": "Marc-Olivier Killijian Directeur de Recherche CNRS on secondment, Professor of Computer Science UQAM Follow UQAM, MTL Email Twitter LinkedIn Github Google Scholar Since January 1st, 2020, I have been a Professor of Computing Science at the Université du Québec a Montréal (UQAM), where I am a member of both the Département d’Informatique and of the Laboratoire de recherche sur les technologies du commerce electronique (LATECE). My primary areas of interest lie in the fields of security, privacy, and applied cryptography.HOTI am currently seeking motivated students who share a passion for these domains and are eager to join my research team. If you are interested in exploring cutting-edge security solutions, there are several opportunities available.A significant focus of my research involves leveraging recent advancements in homomorphic encryption to enhance Privacy Enhancing Technologies (PETs). My team and I have developed the NFLLib toolkit, a powerful resource designed to facilitate work in this area, as well as XPIR Private Information Retrieval, an implementation of Private Information Retrieval built on the foundation provided by NFLLib. Additionally, we have contributed to the development of RevoLUT, a Rust library that reimagines the use of Look-Up-Tables (LUT) beyond their conventional role in function encoding, as commonly used in TFHE’s programmable bootstrapping. Instead, RevoLUT leverages LUTs as direct data structures, enabling efficient operations such as sorting and elements permutation directly within the table. This approach supports oblivious algorithms, providing a secure, privacy-preserving solution for handling sensitive data in various applications. These projects exemplify our commitment to pushing the boundaries of privacy-centric cryptographic tools.GDR Previously, I served as the Deputy Director of the Groupement de Recherche (GDR) Securite Informatique, a collaborative network that unites French researchers specializing in computer security under a cohesive virtual laboratory. This role allowed me to contribute significantly to fostering research collaboration and innovation within the national community.Secondment Additionally, I hold the position of Directeur de Recherche at the Centre National de la Recherche Scientifique (CNRS) and am currently on secondment at UQAM. For those interested in my earlier work and career accomplishments, my previous professional webpage is available for reference.",
  "content_length": 2468,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:07"
}