{
  "name": "Marcus Poggi",
  "homepage": "http://www.inf.puc-rio.br/~poggi",
  "status": "success",
  "content": "index Marcus Poggi¶Associate Professor, Departamento de Informática, PUC-Rio Research Interests¶My main research is on resolution methods for Combinatorial Optimization problems, on the application of these methods and on their implementation. Linear Programming and Mixed-Integer Linear Programming play an important role in my research, as well as data structures. Im also interested in the design of heuristics to find approximate solutions to instances of combinatorial problems which are still beyond our capacity to find optimal solutions. Some keywords that often appear in my research publications are: Column Generation, Branch-and-Cut, Branch-and-Price, Metaheuristics. My applied research focus on Logistic problems involving planning and operations. The classical problems that I'm currently working on are Routing and Scheduling problems, both considering several practical applications aspects that bring elements of Lot Sizing problems into play. In particular, my interests are on Railway Optimization and Supply Chain planning. Other related topics present in my research are Combinatorial Auctions, Probabilistic Logic, Decision Support Systems, Game Theory, Simulation, Network Design, Graph Algorithms, Search Algorithms. Photo and Address¶ Google Scholar Link Curriculum Vitae Lattes (in Portuguese)¶ Curriculum Vitae Lattes(in English) Graduate Courses (in Portuguese):¶ Projeto e Análise de Algoritmos (INF2926) 2019.1 Otimização Combinatória (INF2912) 2018.2 Estudo Orientado (INF 2985) 17.2 / Otimização Combinatória (INF2912) 2018.1 Projeto e Análise de Algoritmos (INF2926) 2017.1 Otimização Combinatória (INF2912) 2016.2 Prescriptive Data Science (INF2912) 2016.1 Otimização Combinatória (INF2912) 2015.2 Projeto e Análise de Algoritmos (INF2926) 2015.1 Projeto e Análise de Algoritmos (INF2926) 2014.2 Otimização Combinatória (INF2912) 2013.2 Projeto e Análise de Algoritmos (INF2926) 2013.1 Projeto e Análise de Algoritmos (INF2926) 2012.2 Otimização Combinatória (INF2912) 2011.2 Projeto e Análise de Algoritmos (INF2926) 2011.1 Projeto e Análise de Algoritmos (INF2926) 2010.2 Otimização Combinatória (INF2912) 2009.2 Projeto e Análise de Algoritmos (INF2926) 2009.1 Introdução à Combinatória Poliédrica (INF2916) 2009.1 Projeto e Análise de Algoritmos (INF2926) 2008.2 Metaeurísticas e Heurísticas Matemáticas (INF2914) 2008.1 Otimização Combinatória (INF2912) 2007.2 Projeto e Análise de Algoritmos (INF2926) 2007.1 Modelagem e Simulação Discreta de Sistemas (INF 2509) 2007.1 Projeto e Análise de Algoritmos (INF2926) 2006.1 Algoritmos, Modelos e Otimização (INF 2914) 2005.1 Modelagem e Simulação Discreta de Sistemas (INF 2509/ INF 1805) (Graduação) 2005.1 Projeto e Análise de Algoritmos (04.2) Modelagem e Simulação Discreta de Sistemas 2004.1 Projeto e Análise de Algoritmos (01.1) Projeto e Análise de Algoritmos (00.2) Projeto e Análise de Algoritmos (99.1) Undergraduate Courses (in Portuguese):¶ Estruturas Discretas (20.1) (INF1631) Estruturas Discretas (19.2) (INF1631) Estruturas Discretas (19.1) (INF1631) Análise de Algoritmos (18.2) (INF1721) Análise de Algoritmos (18.1) (INF1721) Tópicos - Maratona de Programação (17.1) (INF1172) Estruturas Discretas (17.1) (INF1631) Análise de Algoritmos (16.2) (INF1721) Estruturas Discretas (16.1) (INF1631) Análise de Algoritmos (15.2) (INF1721) Estruturas de Dados Avançadas (15.1) (INF1010) Estruturas de Dados Avançadas (14.2) (INF1010) Estruturas Discretas (14.1) (INF1631) Estruturas de Dados Avançadas (13.2) (INF1010) Análise de Algoritmos (11.2) (INF1721) Estruturas Discretas (11.1) (INF1631) Análise de Algoritmos (10.1) (INF1721) Análise de Algoritmos (09.2) (INF1721) Estruturas Discretas (09.1) (INF1631) Estruturas Discretas (08.2) (INF1631) Análise de Algoritmos (08.1) (INF1721) Estruturas Discretas (07.2) (INF1308) Estruturas Discretas (07.1) (INF1308) Análise de Algoritmos (06.2) (INF1721) Projeto e Análise de Algoritmos (06.1) (INF1309) Análise de Algoritmos (05.2)(INF1721) Estruturas Discretas (05.1) Estruturas Discretas (04.2) Estruturas Discretas (04.1) Projeto e Análise de Algoritmos (03.2) (INF1309) Análise de Algoritmos (03.1) Análise de Algoritmos (02.2) Análise de Algoritmos (99.1) Estruturas Discretas (02.1) Estruturas Discretas (01.2) Estruturas Discretas (01.1) Estruturas Discretas (00.2) Estruturas Discretas (00.1) Estruturas Discretas (99.2) Introdução a Engenharia (33B) (2000.1) Marcus Poggi",
  "content_length": 4427,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:06"
}