{
  "name": "Marcos Ortega Hortas",
  "homepage": "https://pdi.udc.es/en/File/Pdi/ML53G",
  "status": "success",
  "content": "Marcos Ortega Hortas File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Grupo de Visión Artificial y Reconocimiento de Patrones Research lines Computer Vision, Image Processing, Medical Imaging, Medical Informatics, Pattern Recognition Teaching merits evaluation 3 five years period(s) Research merits evaluation 4 six years period(s) Contacto UDC directory Orcid id0000-0002-2798-0788 ResearcherIDA-5955-2011 Scopus24475406900 ﻿ Associate Professor at the University of A Coruña (accredited by ANECA for Full Professor) in the area of Computer Science and Artificial Intelligence in the Faculty of Computer Science where he is a member of the dean's team since 2017 as Secretary of the Faculty. Coordinator of the VARPA group at UDC, a group of competitive excellence recognised by the Xunta de Galicia. At CITIC he is part of its steering committee and is responsible for the Machine Vision area. He is also a member of the Instituto de Investigación Biomédica de A Coruña (INIBIC) with rank of Principal Investigator. Director of the Institutional Chair UDC-Instituto Técnológico de Galicia (ITG) on Unmanned Aerial Vehicles. He is a member of the Technical Committee of Standardisation of the UNE on Artificial Intelligence and Big Data as well as of the group of experts of the Computational Intelligence Society of the IEEE. Representative of the UDC in the Digital Innovation Hub DIHGIGAL of Galicia, being coordinator of its technological node of Artificial Intelligence as well as in the Health Cluster of Galicia. As for the most relevant scientific awards and prizes, the following should be highlighted: National Prize of Informatics and Health 2022 recognised by the Spanish Society of Health Informatics. Distinguished by the Royal Galician Academy of Sciences for its work in the fight against Covid-19 in 2020. PuntoGal Award for the best research group in Galicia 2020 (1st edition). Galician Health Cluster Award 2022 - in the Knowledge category for the Neuro-ICT project on the detection of neurodegenerative diseases using AI image analysis. He has received awards for the best papers (oral and poster) throughout his career both in computer science congresses and in the field of health technology, such as the International Society of Retina and Vitreous (SIREV) Accésit for the best paper 2021 or the Madrilenian Society of Ophthalmology Award for the best poster on Artificial Intelligence in Ophthalmology. Director of three doctoral theses with the highest qualification, international mention and extraordinary prizes, as well as dozens of end-of-degree projects, currently directing another six doctoral theses. Member of the PhD programmes in Computer Science and Health Sciences. He has also participated in the definition of the curriculum of the MIR training programme in digital competencies at the Hospital de A Coruña, a pioneering initiative to promote the digital transformation of the health sector in Spain. He has been awarded grants at all stages of his research career until its consolidation. He has also worked abroad on funded stays at the University of Sassari and Amsterdam. He has participated in more than 50 European, national and regional competitive projects, being PI in 8 projects, 7 of them from the National R&D Plan. As a result of these projects, he is the author of more than 70 publications indexed in the JCR, most of them in first quartile positions. He has also presented numerous papers at prestigious international conferences in his field (GGS1-2) such as MICCAI, CVPR, ICCV or ICASSP, as well as 15 book chapters. He has participated in more than 60 R&D contracts with private companies, being PI in 18 of them. In total he has raised more than €1.700.000 in research funds as Principal Investigator. He is the author of 3 patents and more than 30 intellectual property registrations, in commercial exploitation. Expert evaluator in committees of the Spanish Research Agency (AEI) and in international calls of other scientific agencies such as in Poland, Austria or Portugal as well as in international European Joint Programme programmes. Member of editorial committees, programme committees and regular reviewer in relevant international journals and congresses. Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Advanced Medical Visualization Master in Bioinformatics for Health Sciences Optional 0 10 AI in Health Master's Degree in Artificial Intelligence Optional 0 1.5 Applied Computer Vision Degree in Artificial Intelligence Optional 0 28 Audiovisual Data Analysis and Interpretation Degree in Data Science and Engineering Optional 0 7 Computer Vision Degree in Computer Engineering Optional 0 21 Computer Vision I Master's Degree in Artificial Intelligence Compulsory 0 4 Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 8 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 19.16 Human Action Recognition Master in Computer Vision Optional 0 6 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 15 Master´s Dissertation Master's Degree in Artificial Intelligence Compulsory 0 1.5 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 9.5 Work Placement Master in Bioinformatics for Health Sciences Master in Bioinformatics for Health Sciences Optional 0 0.5 Subject and involved studies Type Distance hours Total hours Advanced Medical Visualization Master in Bioinformatics for Health Sciences Optional 0 10 AI in Health Master's Degree in Artificial Intelligence Optional 0 3.5 Applied Computer Vision Degree in Artificial Intelligence Optional 0 28 Audiovisual Data Analysis and Interpretation Degree in Data Science and Engineering Optional 0 7 Computer Vision Degree in Computer Engineering Optional 0 21 Computer Vision I Master's Degree in Artificial Intelligence Compulsory 0 4 Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 4 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 16 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 4 Human Action Recognition Master in Computer Vision Optional 0 5 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 15 Master's Dissertation Master's in Computer Engineering Compulsory 0 3.3 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 2.66 Master's Dissertation Master in Computer Vision Compulsory 0 14.33 Subject and involved studies Type Distance hours Total hours Advanced Medical Visualization Master in Bioinformatics for Health Sciences Optional 0 10 AI in Health Master's Degree in Artificial Intelligence Optional 0 3.5 Audiovisual Data Analysis and Interpretation Degree in Data Science and Engineering Optional 0 7 Computer Vision Degree in Computer Engineering Optional 0 21 Computer Vision I Master's Degree in Artificial Intelligence Compulsory 0 4 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 18.67 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 5.33 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2.66 Human Action Recognition Master in Computer Vision Optional 0 11 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 15 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 9.33 Master's Dissertation Master in Computer Vision Compulsory 0 1 Work Placement Master in Bioinformatics for Health Sciences Master in Bioinformatics for Health Sciences Optional 0 1 Subject and involved studies Type Distance hours Total hours Advanced Medical Visualization Master in Bioinformatics for Health Sciences Optional 0 10 Audiovisual Data Analysis and Interpretation Degree in Data Science and Engineering Optional 0 7 Computer Vision Degree in Computer Engineering Optional 0 21 Computer Vision I Master's Degree in Artificial Intelligence Compulsory 0 2 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 9.33333333333333 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2.66666666666667 Human Action Recognition Master in Computer Vision Optional 0 11 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 20 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 8 Subject and involved studies Type Distance hours Total hours Advanced Medical Visualization Master in Bioinformatics for Health Sciences Optional 0 10 Computer Vision Degree in Computer Engineering Optional 0 21 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2.66 Human Action Recognition Master in Computer Vision Optional 0 11 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 20 Image Description and Modeling Master in Computer Vision Compulsory 0 2 Image, Video and Audio Processing Degree in Data Science and Engineering Compulsory 0 7 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 4 Subject and involved studies Type Distance hours Total hours Advanced Machine Learning for Computer Vision Master in Computer Vision Compulsory 0 3 Advanced Medical Visualization Master in Bioinformatics for Health Sciences Optional 0 9 Biomedical Image Analysis Master in Computer Vision Optional 0 16 Computer Vision Degree in Computer Engineering Optional 0 42 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 12 Human Action",
  "content_length": 93815,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:01"
}