{
  "name": "Marcello M. Bonsangue",
  "homepage": "https://liacs.leidenuniv.nl/~bonsanguemm",
  "status": "success",
  "content": "Marcello M. Bonsangue LIACS Home LIACS Marcello Bonsangue Home Education Research Activities Contact Direct links: LIACS Agenda LIACS Information Screen Webmail ICT FAQ Brightspace uSis e-Prospectus Library ISSC Helpdesk Leiden University Faculty of Science Leiden Centre of Data Science Introduction Marcello Bonsangue is full professor in Systems Modelling and Analysis at the Leiden Institute of Advanced Computer Science (LIACS) of Leiden University, The Netherlands. He studied computer science at the University of Milano, Italy and got is PhD in 1996 from the Free University of Amsterdam, The Netherlands. Currently he is member of the Algorithms and Programming research group at LIACS and of the research group Formal Methods at the Centre for Mathematics and Computer Science (CWI) in Amsterdam, The Netherlands. Marcello Bonsangue is the director of education of the LIACS, coordinator for the international students and relationships, member of the LIACS management team, and member of the Scientific Council of  LIACS. Teaching Foundation of Software Testing - Fall 2020 Research Interest Foundations of computer science: Algebra, coalgebra, automata theory, modal logic, category theory, type theory, domain theory, metric spaces, program semantics. Formal methods: program verification and specification, model checking, testing of software systems, process and object-oriented calculi, coordination languages, pi-calculus, reasoning with names. Events t.b.d. Projects Erasm+ KA2: Curriculum Development in Data Science and Artificial Intelligence (2019-2022). NWO: ECoPro: Enhanced Coinductive Proofs (2014-2018) NWO: CoRE: Coinductive Calculi of Regular Expressions (2010 - 2015) COST Action: Formal Verification of Object-Oriented Software (2010-2012). EU Artemis: SCaLoPES: SCalable LOw Power Embedded platformS (2009-2011). EU IST: CREDO Modeling and analysis of evolutionary structures for distributed services (2006-2009). NWO/DFG:  SYANCO: Synthesis and Analysis of Component Connectors (2006-2009). NWO/DFG: Mobi-J II: Assertional methods for mobile channels in Java (2005-2009). ITEA/Senter: trust4All (2005-2007). EU RTN: SeGraVis: Syntactic and Semantic Integration (2002-2006) Min. Econ. Affairs: ArchiMate: an integrated approach to architectures (2002-2004). EU IST: OMEGA: real time UML for embedded systems (2002-2005) NWO/DFG: Mobi-J I: Assertional methods for mobile channels in Java (2001-2004). KNAW: Semantic component composition (2001-2006). FSR network: WOG-EVOL: Foundation of Software Evolution (2001-2005) NWO/SION: CoLa: Formal Methods for Coordination Languages (1997-2000). Esprit wg24512: Coordina: Coordination Languages - theory and applications. (1997-2000). SCIENCE: MASK: Mathematical Structures in Semantics for Concurrency. (1992-1995). Memberships Member of the IFIP WG 1.3 \"Foundations of System Specification\". Member of the IEEE Benelux Embedded System Chapter. Associate editor for the Specialty Section Formal Methods, journal Frontiers in ICT. Member of the editorial board of the Journal of Software Academy Publisher. Member of the editorial board of Open Computer Science, De Gruyter Open. Member of the Steering Committee of CMCS Member of the steering committee and scientific advisory board of the International Joint Lab of Trustworthy Software, led by East China Normal University (China). Member of the Board of the Dutch national inter-universities research school Institute for Programming research and Algorithmics (IPA). Member of the Advisor Board of the Leiden University Honour College. PhD Students Tanjona Ralaivaosaona (with Henning Basold)Giulio Barbero (with Felienne Hermans)Jinting Bian (with Frank de Boer)Wengjing Chu (with Frank de Boer) Jana Wagemaker (with Jurriaan Rot and Alexandra Silva) Feng Hui (with Farhad Arbab) Julian Salamanca (with Jan Rutten) (completed in Mar 2018) Jurriaan Rot (with Jan Rutten)(completed in Oct 2015) Joost Winter (with Jan Rutten)(completed in Jul 2014) Georgiana Caltais (with Jan Rutten and Alexandra Silva)(completed in Dec 2013) Stijn de Gouw (with Frank de Boer)(completed in Dec 2013) Mohammad Izadi (with Farhad Arbab)(completed in Dec 2011) Alexandra Silva (with Jan Rutten)(completed in Dec 2010) Andreas Gruener (with Frank de Boer)(completed in 2010) Andries Stam (with Joost Kok)(completed 2009) Joost Jacob (with Frank de Boer)(completed 2008) Juan Guillen Scholten (completed 2007)",
  "content_length": 4418,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:13"
}