{
  "name": "Marc de Kamps",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/390/dr-marc-de-kamps",
  "status": "success",
  "content": "Dr Marc de Kamps | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Dr Marc de Kamps Position: Associate Professor Areas of expertise: Computational Neuroscience; Artificial Intelligence; Machine Learning Email: M.deKamps@leeds.ac.uk Phone: +44(0)113 343 5322 Location: 3.32c Bragg Building Website: Website Marc de Kamps Profile I studied physics and applied mathematics and then obtained a PhD in experimental particle physics. After my PhD I joined the Section Cognitive Psychology of the University of Leiden, where I worked on models of visual attention and stochastic simulation techniques for neural populations. During a postdoc at the Chair for Robotics and Embedded Systems of the Technical University of Munich I managed EU funded Network of Excellence nEUro-IT.net. In 2006, I joined the School of Computing at the University of Leeds. I was PI in the Human Brain Project from 2015 until 2020. Currently, I supervise students in the UKRI Centre for Doctoral Training in Artificial Intelligence for Medical Diagnosis and Care and I’m a part of the Leeds Institure for Data Analytics (LIDA). Responsibilities Admission Tutor Research interests I’m interested in biological intelligence and, increasingly, in machine learning. Student education Currently I teach machine learning both at undergraduate and postgraduate level Research groups and institutes Artificial Intelligence Current postgraduate researchers Andrew Broad Jason Keighley Siân Carey Emma Briggs Allan Pang <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Projects <li><a href=\"//phd.leeds.ac.uk/project/279-an-integrated-neuronal-model-for-visual-search-tasks\">An Integrated Neuronal Model for Visual Search Tasks</a></li> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 2627,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:07"
}