{
  "name": "Marc Tommasi",
  "homepage": "http://researchers.lille.inria.fr/tommasi",
  "status": "success",
  "content": "Marc Tommasi — Marc Tommasi Homepage Navigation next M. T. - Homepage » Marc Tommasi¶ Professor in Computer Science at Lille university. I am a member of CRIsTAL lab. I am the leader of the Magnet Team. Previously, I was a (founding) member of the Mostrare project team in INRIA Lille. My research interests are machine learning, structured prediction for trees and graphs. I have also studied tree automata and set constraints. Publications¶ On HAL On Google Scholar On DBLP My own list of publications (maybe not up to date) Projects¶ Pamela (2016-2020): Personalized and decentrAlized MachinE Learning under constrAint Lampada (2009-2013) : Learning Algorithms, Models and sPArse representations for structured DAta. (Scientific coordination) Crotal (2007-2009) on conditional random fields for natural language. Marmota (2005-2009) on statistical machine learning and tree structured data. (Scientific coordination) ATASH (2006-2009) on document transformations WebContent (2006-2009) on information extraction Students¶ Mahsa Asadi with Aurélien Bellet : On Decentralized Machine Learning (2018-) Brij Srivastava with Aurélien Bellet et Emmanuel Vincent: Representation Learning for Privacy-Preserving Speech Recognition. (Oct 2018-) Mathieu Dehouck with Pascal Denis: Graph-based Learning for Multi-lingual and Multi-domain Dependency Parsing. (Oct. 2015- ) Géraud Le Falher with Claudio Gentile and Fabio Vitale: on machine learning on signed graphs. (Oct. 2014-2018) Pauline Wauquier with Mikaela Keller: on Adaptive Graph Construction. (Dec. 2013-2017) David Chatel with Pascal Denis: On spectral clustering and information diffusion in graphs of texts. (Oct 2012-2017) Grégoire Laurence with Joachim Niehren: on learning tree transducers. (2008-2014) Edouard Gilbert with Rémi Gilleron: on probabilistic models from tree structured data. (Aborted) Patrick Marty: with Rémi Gilleron and Fabien Torre: on information extraction and supervised learning. (Defense on December 4, 2007) Florent Jousse: with Isabelle Tellier and Rémi Gilleron: on conditional random fields for information extraction. (Defense on October 31, 2007) Julien Carme: with Rémi Gilleron, Aurélien Lemay and Joachim Niehren: on information extraction from tree structured data and grammatical inference. (Defense on September 23, 2005) Daniela Dudau: with Rémi Gilleron and Isabelle Tellier: Machine learning and categorial grammars. (Defense on April 13, 2004). Franck Seynhaeve: with Sophie Tison Set constraints and term rewriting. (Defense on May 12, 1999). TATA¶ TATA (Tree Automata Techniques and Applications) is an online-book on tree automata writen with H. Comon, M. Dauchet, R. Gilleron, F Jacquemard, Christof Löding, D. Lugiez et S. Tison. Program Committees¶ IJCAI 2017 (SPC) EGC 2017 NIPS 2016, ICML 2016 (Rev) CAP 2015 CAP 2014 (PC) CIAA 2013 CAP 2013 ECML/PKDD 2010 LATA 2010 ATANLP workshop on tree automata and natural languages in ACL 2010 and EACL 2012 TAL journal of the ATALA for the Machine Learning for NLP, Volume 50 num 3. Teaching¶ In french… Contact¶ Location (map): INRIA Lille Bâtiment B Parc Scientifique de la Haute Borne rue Héloïse 59650 Villeneuve d'Ascq France Phone: (+33)3 59 35 87 23 Email: first.last@inria.fr Surface mail Parc scientifique de la Haute Borne 40, avenue Halley - Bât A - Park Plaza 59650 Villeneuve d'Ascq - France #http://haltools.inria.fr/Public/afficheRequetePubli.php?auteur_exp=Tommasi&labos_exp=LIFL;%20MOSTRARE;%20MAGNET&CB_auteur=oui&CB_titre=oui&CB_article=oui&langue=Francais&tri_exp=annee_publi&tri_exp2=typdoc&tri_exp3=date_publi&ordre_aff=TA&Fen=Aff&css=../css/VisuRubriqueEncadre.css Table Of Contents Marc Tommasi Publications Projects Students TATA Program Committees Teaching Contact Navigation next M. T. - Homepage » © Copyright 2012, Marc Tommasi. Created using Sphinx 1.7.9.",
  "content_length": 3832,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:08"
}