{
  "name": "Marco A. Z. Alves",
  "homepage": "https://web.inf.ufpr.br/mazalves",
  "status": "success",
  "content": "Prof. Marco Antonio Zanata Alves - Professor e Pesquisador de Arquitetura de Computadores Skip to content Prof. Marco Antonio Zanata Alves Professor e Pesquisador de Arquitetura de Computadores Início Novos Pesquisadores Iniciação Científica Projetos de Pesquisa Publicações Ensino Vídeos Idiomas Adjunct professor and researcherDepartment of InformaticsFederal University of Paraná (UFPR)Curitiba, Brazil (since 2016). – Deputy Coordinator of Undergraduate course of Computer ScienceFederal University of Paraná (UFPR)  Curitiba, Brazil (2017-2020). – Postdoctoral internship at the Informatics InstituteFederal University of Rio Grande do Sul (UFRGS)Porto Alegre, Brazil. (2014~2015)– Temporary professor at the Informatics InstituteFederal University of Rio Grande do Sul (UFRGS)Porto Alegre, Brazil. (2014~2015)– PhD at the Informatics InstituteFederal University of Rio Grande do Sul (UFRGS)Porto Alegre, Brazil. (2009~2014)– Visiting scholar at The University of Texas at Austin (UT-Austin)under advice of professor Yale N. PattTexas, United States. (2011) – MSc. at the Informatics InstituteFederal University of Rio Grande do Sul (UFRGS)Porto Alegre, Brazil. (2007~2009)– Bachelor in Computer ScienceState University of São Paulo (UNESP)Presidente Prudente, Brazil. (2002~2006) Main research areas – Computer architecture (processors, memory sub-systems, interconnections)– High performance computing (data and threads placement, parallel systems, cloud computing)– Memory systems (cache memories, memory controllers, DRAM and NVM memories)– Microarchitecture simulation (cycle accurate simulators, fast and accurate simulation)– In-memory processing (smart memories capable of performing computations) (HOT) Research Groups contact Email: ORCID: 0000-0003-2440-2664Lattes: 7011183305034415Research Gate: Marco-Alves-5Physical Address:Rua Cel. Francisco H. dos Santos, 100 Centro Politécnico, Curitiba, Paraná, Brazil – Zip Code:81531-980Department of Informatics, Office room 86. Phone: +55 41 3361 3684",
  "content_length": 2012,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:29"
}