{
  "name": "Marcelo Mendoza",
  "homepage": "https://www.ing.uc.cl/academicos-e-investigadores/marcelo-gabriel-mendoza-rocha",
  "status": "success",
  "content": "MARCELO GABRIEL MENDOZA ROCHA | Ingeniería UC Inicio Nuestra Escuela Sobre Ingeniería UC Internacionalización Retribuye Proyecto Ingeniería 2030 Código de Honor Consejo Asesor Autoridades y equipos Programas de Estudio Admisión Pregrado Postgrado Educación Profesional Acreditaciones Académicos e Investigación Académicos Ingeniería UC Publicaciones Investigación en pregrado Proyectos de investigación Concursos postdoctorales Libro de Investigación Divulgación Científica y Tecnológica Innovación y Emprendimiento Ecosistema de emprendimiento Formación académica Programas extracurriculares Emprendimiento Social Apoyo al emprendimiento Alumnos emprendedores Vida Universitaria Deporte Cultura Centro de Alumnos de Ingeniería Proyectos de Alumnos Mujeres Ingeniería UC Cuerpo de Tutores Pastoral Vinculación con el Medio Transferencia Alumni Ingeniería UC Preingeniería Atracción y desarrollo de talento Plataforma de Colocaciones Responsabilidad Social Oficina de Vinculación con la Industria Contacto Departamentos y áreas académicas SIDING English Home » Académicos e Investigadores » MARCELO GABRIEL MENDOZA ROCHA Académicos Ingeniería UC MARCELO MENDOZA Profesor Asociado Especialidad: Inteligencia artificial Departamento de Ciencia de la Computación marcelo.mendoza@uc.cl Líneas de Investigación Publicaciones Biografía Educación Premios y Distinciones Noticias Relacionadas Líneas de Investigación Natural language processing. Social network analysis. Publicaciones Garcia-Varela F., Nussbaum M., Mendoza M., Martinez C., Bekerman Z. (2025) ChatGPT as a Stable and Fair Tool for Automated Essay Scoring Education Sciences 15 8 Garcia-Varela F., Bekerman Z., Nussbaum M., Mendoza M., Montero J. (2025) Reducing interpretative ambiguity in an educational environment with ChatGPT COMPUTERS & EDUCATION 225 Mendoza, M., Providel, E., Santos, M. et al. Detection and impact estimation of social bots in the Chilean Twitter network. Sci Rep 14, 6525 (2024). https://doi.org/10.1038/s41598-024-57227-3 (2024) Detection and impact estimation of social bots in the Chilean Twitter network Scientific Reports [WoS Q1] 14 6526 Mendoza M., Providel E., Santos M., Valenzuela S. (2024) Detection and impact estimation of social bots in the Chilean Twitter network Scientific Reports 14 1 Neyem H., Rios-Letelier A., Cespedes-Arancibia K., Sandoval J., Mendoza M. (2024) Enhancing commit message quality in software capstone projects with generative AI SoftwareX 28 (2024) Enhancing commit message quality in software capstone projects with generative AI SoftwareX 28 101947 (2024) Exploring the Impact of Generative AI for StandUp Report Recommendations in Software Capstone Project Development Proceedings of the 55th ACM Technical Symposium on Computer Science Education Neyem A., Sandoval JP., Mendoza M., Centellas-Claros L., Gonzalez L., Paredes-Robles C. (2024) Exploring the Impact of Generative AI for StandUp Report Recommendations in Software Capstone Project Development Proceedings of the 55th ACM Technical Symposium on Computer Science Education Muñoz, C., Apolo, M.J., Ojeda, M., Lobel, H., Mendoza, M. (2024). News Gathering: Leveraging Transformers to Rank News. In: Goharian, N., et al. Advances in Information Retrieval. ECIR 2024. Lecture Notes in Computer Science, vol 14610. Springer, Cham. https://doi.org/10.1007/978-3-031-56063-7_41 (2024) News Gathering: Leveraging Transformers to Rank News 46th European Conference on Information Retrieval, ECIR 2024 LNCS 14610 486-493 Muñoz, C., Apolo, M.J., Ojeda, M., Lobel, H., Mendoza, M. (2024) News Gathering: Leveraging Transformers to Rank News 46th European Conference on Information Retrieval, ECIR 2024 LNCS 14610 486-493 Reyes A., Mendoza M., Vera C., Lucchini F., Dimter J., Gutierrez F., Bro N., Lobel H., Reyes A. (2024) SpatialCluster: A Python library for urban clustering SoftwareX 26 (2024) SpatialCluster: A Python library for urban clustering SoftwareX 26 101739 Nunez-Mussa E., Riquelme A., Valenzuela S., Aldana V., Padilla F., Bassi R., Campos S., Providel E., Mendoza M. (2024) The Threat of Misinformation on Journalism's Epistemology: Exploring the Gap between Journalist's and Audience's Expectations when Facing Fake Content Digital Journalism Núñez-Mussa, E., Riquelme, A., Valenzuela, S., Aldana, V., Padilla, F., Bassi, R., Mendoza, M. (2024). The Threat of Misinformation on Journalisms Epistemology: Exploring the Gap between Journalists and Audiences Expectations when Facing Fake Content. Digital Journalism, 122. https://doi.org/10.1080/21670811.2024.2320249 (2024) The Threat of Misinformation on Journalisms Epistemology: Exploring the Gap between Journalists and Audiences Expectations when Facing Fake Content Digital Journalism [WoS Q1] 1-22 Neyem A., Gonzalez L., Mendoza M., Alcocer J., Centellas L., Paredes C. (2024) Toward an AI Knowledge Assistant for Context-Aware Learning Experiences in Software Capstone Project Development IEEE Transactions on Learning Technologies 17 1639-1654 Mendoza M., Valenzuela S., Nunez-Mussa E., Padilla F., Providel E., Campos S., Bassi R., Riquelme A., Aldana V., Lopez C. (2023) A Study on Information Disorders on Social Networks during the Chilean Social Outbreak and COVID-19 Pandemic Applied Sciences-Basel 13 9 Vera C., Lucchini F., Bro N., Mendoza M., Löbel H., Gutierrez F., Dimter J., Cuchacovic G., Reyes A., Valdivieso H., Alvarado N., Toro S. (2022) Learning to cluster urban areas: two competitive approaches and an empirical validation EPJ Data Science 11 62 1-22 Vera, C., F., Lucchini, Gutierrez, F., Valdivieso, H., Lobel, H., Bro, N.Mendoza, M.: Parametric Sensitivity in Graph Neural Network for Urban Cluster Detection, a Case Study, in Proceedings of the Tenth International Conference on Complex Networks and their Applications, 2021. (2021) Parametric Sensitivity in Graph Neural Network for Urban Cluster Detection, a Case Study Proceedings of the Tenth International Conference on Complex Networks and their Applications Biografía I am an Electronics Engineer and Master in Informatics of the Universidad Técnica Federico Santa Maria, Chile. I received a Ph.D. in Computer Science from the Universidad de Chile. I did a Post Doc in Yahoo Research. I am Associate Professor at the Department of Computer Science, Pontificia Universidad Católica de Chile. I am associate researcher at the Millennium Institute for Research on Data Foundations, and principal investigator of the National Center of Artificial Intelligence CENIA. My work focuses on developing artificial intelligence methods to measure and anticipate events and processes in which humans participate. Among these events, I highlight the spread of information, the territorial disposition of humans in cities, the formation of communities, and the virtuous and destructive interactions between people. In addition, I am interested in disinformation diffusion processes, virtuous and destructive. Educación Ingeniero Civil Electrónico, Universidad Técnica Federico Santa MaríaMagíster en Ciencias de la Ingeniería Informática, Universidad Técnica Federico Santa MaríaDoctor en Computación, Universidad de Chile Premios y Distinciones Seoul Test of Time Award 2021 Noticias Relacionadas DESTACAN TRABAJOS CHILENOS SOBRE POTENCIAL DE LA IA EN LA EDUCACIÓN26 Profesores de Ingeniería UC adjudican proyectos FONDECYT CONÉCTATE CON INGENIERÍA UC Contáctate con nosotros Información sobre las distintas áreas de Ingeniería UC. Contáctanos Postula a Ingeniería UC Conoce la información relevante para postular a la carrera. Postula Concursos de Postdoctorado Descubre las ofertas de postdoctorado Postula Mapa Campus San Joaquín Retribuye a Ingeniería UC Trabaja con nosotros Error: Formulario de contacto no encontrado. Email Todo Noticias Contenido Institucional",
  "content_length": 7794,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:21"
}