{
  "name": "Marcel Worring",
  "homepage": "https://staff.fnwi.uva.nl/m.worring",
  "status": "success",
  "content": "Marcel Worring| research in Multimedia Analytics Marcel Worring | Research in Multimedia Analytics Research Publications Projects Professional Teaching Theses Biography Bookmarks Informatics Institute University of Amsterdam Conferences ICMR 2026 MMM 2026 Vacancies Currently no vacancies Research Visual data is becoming an integral part of society. For the general public visual data and its sharing through social media has become a way of living and is leading to a new digital culture. Scientists use cameras to record observations as source for scientific discoveries. Criminals have embraced the Internet to distribute illegal and disturbing content. Visual collections and their contextual data potentially contain a wealth of information which can range from scientific discoveries, image demographics, trends, or preferences, to forensic evidence and intelligence. Automatic algorithms are inferior to the human capabilities of identifying visual semantics or subtle patterns. Yet image collections are too voluminous to be processed by humans. In MultiX we research multimedia analytics by developing AI techniques for getting the richest information possible from the data (image/video/text/graphs) interactions surpassing human and machine intelligence, and visualizations blending it all in effective interfaces for applications in health, forensics and law enforcement, cultural heritage, urban livability, and social media analysis. For more information see the website of the MultiX group Group Members Full professors Zeno Geradts (NFI) Evert Haasdijk (deloitte) Associate Professors Stevan Rudinac (ABS) Assistant Professors Nanne van Noord Yen-Chia Hsu PostDocs Currently no postdocs Current Phd students under my full or partial guidance Meike Kombrink Detection of Steganography (at NFI) Shuai Wang Business Theory Driven Multimodal (Hyper)graph learning, and its applications in the Cultural Industry and Science (at ABS) Conor McCarthy Data2Activity Floris Gisolf: Interactive analysis of large scale visual incident data, (At Dutch Safety Board) Eleni Konstantina Sergidou speaker verification (at NFI) Thanos Efthimiou, Determining the value of art using graph convolutional networks (at ABS) Ujjwal Sharma Harnessing multi-modal urban data for intelligent location analytics for retail establishments (at ABS) PhD students that received their degree under my full or partial guidance: Ivona Najdenkoska , Learning from Context with Multimodal Foundation Models, November 2025 Tom van Sonsbeek , Combining Images and Text for Improved Medical Image Understanding, March 2025 Sarah Ibrahimi : Learning from Real-World Data Challenges for Similarity Search, December 2024 Maarten Sukel : Machine Learning with Geo, Temporal, Textual, and Visual Data for Real World Applications, November 2024 Jia-Hong Huang : Personalized Video Summarization using Text-Based Queries and Conditional Modeling, October 2024 Jiayi Shen , Mitigating Bias in Multi-Task Learning, October 2024 Amir Soleimani : Advances in Information Verification using Natural Language Processing, April 2024 Andrea Macarulla , Face Comparison in Forensics: A Deep Dive into Deep Learning and Likelihood Ratios (with NFI), February 2024 Devanshu Arya : Multimodal Deep Learning on Hypergraphs, June 2022 Gjorgji Strezoski : Information Sharing Methods for Multi-Task Learning, May 2022 Gosia Migut: Integration of Machine Learning and Interactive Visualizations for Cognition Friendly Decision Making, Nov 2019 (now at TU-Delft) Ork de Rooij: Interactive Content-Based Visualizations for Multimedia Search, October 2017 (now at Qualcomm) Jan Zahalka The Machine in Multimedia Analytics, July 2017 (now at Czech Technical University) Fangbin Liu: High Performance Adaptive Image Processing on Multi-Scale Hybrid Architectures, Nov 2015, (now at Park Now Group) Dang Trung Kien: Semi-interactive construction of 3D event logs for scene investigation. May 2013 Xirong Li: Content-based visual search learned from social media, March 2012, (now at Renmin University, China) Giang Nguyen \"Interactive Image Search using Similarity-Based Visualization, December 2006, (now at Track Unit, Denmark)\" Laura Hollink \"Semantic annotation for retrieval of visual resources, November 2006, (now at CWI)\" Cees Snoek \"The Authoring Metaphor to Machine Understanding of Multimedia, October 2005, (now at University of Amsterdam)\" Andy Bagdanov: \"Style Characterization of Machine Printed Text\", May 2004, (now at University of Firenze). Jeroen Vendrig, \"Interactive Exploration of Visual Content\", October 2002, (Canon, now at Prooftec). Tat Hieu Nguyen: \"Segmentation of Video Into Spatio-Temporal Objects\", march 2001, (now at Boeing) Marcel Worring | Informatics Institute, University of Amsterdam, LAB42, Science Park 900, 1098 XH Amsterdam, The Netherlands. Postal address: P.O. Box 94323, 1090 GH Amsterdam. Room: L4.40 | E-mail-: m.worring AT uva DOT nl | Tel: +31-(0)20-525-7521 | \u001a",
  "content_length": 4962,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:12"
}