{
  "name": "Marcelo Kallmann",
  "homepage": "http://graphics.ucmerced.edu/~mkallmann",
  "status": "success",
  "content": "Marcelo Kallmann - UC Merced Marcelo Kallmann School of Engineering University of California, Merced Marcelo Kallmann is Professor and Founding Faculty at the University of California, Merced. He was chair of the EECS graduate program from July 2018 to June 2020. He holds a PhD from the Swiss Federal Institute of Technology in Lausanne (EPFL), was research faculty at the University of Southern California (USC), and a research scientist at the USC Institute for Creative Technologies (ICT), before moving to UC Merced in 2005. A significant part of his research interests are on motion planning algorithms for a wide range of applications in robotics and computer graphics. He has served as program co-chair for the 5th International Conference on Motion in Games (MIG) in 2012 and as Associate Editor for ICRA in multiple years. He is also an Associate Editor for the Computer Animation and Virtual Worlds journal. At UC Merced he established the computer graphics group (http://graphics.ucmerced.edu/). He is recipient of several NSF awards and his recent work on triangulations for path planning runs inside The Sims 4, the best selling PC game of 2014 and 2015. Note: I have moved to a full time position at Amazon Robotics and will not be able to work with new PhD students. More information here. Publications List of publications available here. NEW: Our book based on our 2014 SIGGRAPH course is finally out: Geometric and Discrete Path Planning for Interactive Virtual Worlds Marcelo Kallmann and Mubbasir Kapadia Morgan & Claypool, 2016 Research Please visit the computer graphics lab and CAIS for more information on our research projects. Affiliations and Collaborations UCM graduate programs: EECS, Cognitive Science, Applied Math, MEAM. Current and past collaborators: UCM robotics lab, UCLA graphics Lab, ICT virtual humans project. Information for Students graduate students reference letters undergraduate students Contact Prof. Marcelo Kallmann School of Engineering University of California, Merced 5200 N. Lake Road - Merced CA 95343 Phone: 209 228-4168, Fax: 209 228-4047 Email: drkallmann (at) gmail (dot) com",
  "content_length": 2134,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:19"
}