{
  "name": "Marcos Sepúlveda",
  "homepage": "https://www.ing.uc.cl/academicos-e-investigadores/marcos-ernesto-sepulveda-fernandez",
  "status": "success",
  "content": "MARCOS ERNESTO SEPÚLVEDA FERNÁNDEZ | Ingeniería UC Inicio Nuestra Escuela Sobre Ingeniería UC Internacionalización Retribuye Proyecto Ingeniería 2030 Código de Honor Consejo Asesor Autoridades y equipos Programas de Estudio Admisión Pregrado Postgrado Educación Profesional Acreditaciones Académicos e Investigación Académicos Ingeniería UC Publicaciones Investigación en pregrado Proyectos de investigación Concursos postdoctorales Libro de Investigación Divulgación Científica y Tecnológica Innovación y Emprendimiento Ecosistema de emprendimiento Formación académica Programas extracurriculares Emprendimiento Social Apoyo al emprendimiento Alumnos emprendedores Vida Universitaria Deporte Cultura Centro de Alumnos de Ingeniería Proyectos de Alumnos Mujeres Ingeniería UC Cuerpo de Tutores Pastoral Vinculación con el Medio Transferencia Alumni Ingeniería UC Preingeniería Atracción y desarrollo de talento Plataforma de Colocaciones Responsabilidad Social Oficina de Vinculación con la Industria Contacto Departamentos y áreas académicas SIDING English Home » Académicos e Investigadores » MARCOS ERNESTO SEPÚLVEDA FERNÁNDEZ Académicos Ingeniería UC MARCOS SEPÚLVEDA Profesor Asociado Especialidad: Minería de Procesos; Data Science orientado a Procesos; Mejora de Procesos de Negocio; Gestión de Procesos de Negocio. Departamento de Ciencia de la Computación Director de Programa, Magister en Tecnologías de Información y Gestión marcos.sepulveda@uc.cl +562 2354 4447 Líneas de Investigación Publicaciones Biografía Educación Premios y Distinciones Noticias Relacionadas Líneas de Investigación Minería de Procesos; Data Science orientado a Procesos; Mejora de Procesos de Negocio; Gestión de Procesos de Negocio; Inteligencia de Negocios. Publicaciones de la Fuente R., Galvez-Yanjari V., Delfino A., Lira R., Hurtado C., Munoz J., Sepulveda M. (2025) Process-oriented feedback for ultrasound-guided central venous access training: a randomized controlled trial BMC Anesthesiology 25 1 Hernandez-Resendiz J., Tello-Leal E., Sepulveda M. (2024) A Data-Driven Approach to Discovering Process Choreography Algorithms 17 5 Velasquez I., Gomez-Herrera M., Sepulveda M. (2024) A Systematic Literature Review of the Analysis of Costs and Other Dimensions in Process Mining and Related Disciplines IEEE Access 12 23305-23318 Salazar-Fernandez J., Munoz-Gama J., Sepulveda M. (2024) Implications of losing a need- and merit-based scholarship on the educational trajectory: a curricular analytics approach HIGHER EDUCATION Galvez-Yanjari V., de la Fuente R., Munoz J., Sepulveda M. (2023) The Sequence of Steps: A Key Concept Missing in Surgical Training-A Systematic Review and Recommendations to Include It International Journal of Environmental Research and Public Health 20 2 González-López F., Bustos G., Muñoz-Gama J., Sepúlveda M. (2022) Domain Model Based Design of Business Process Architectures Applied Sciences-Basel 12 5 1-25 Muñoz-Gama J., Niels M., Fernández C., Johnson O., Sepúlveda M., Helm E., Gálvez V., Rojas E., Martínez A., Aloini D., Amantea I., Andrews R., Arias M., Beerepoot I., Benevento E., Burattin A., Capurro D., Carmona J., Zerbato F. (2022) Process Mining for Healthcare: Characteristics and Challenges. Journal of Biomedical Informatics 127 103994 1-15 Martínez J.J., Galvez V., de la Fuente R., Kychenthal C., Kattan E., Bravo S., Muñoz-Gama J., Sepúlveda M. (2022) Process-oriented metrics to provide feedback and assess the performance of students who are learning surgical procedures: The percutaneous dilatational tracheostomy case Medical Teacher Gonzalez-Lopez F., Martin N., de la Fuente R., Galvez-Yanjari V., Guzmán J., Kattan E., Sepúlveda M., Muñoz J. (2022) ProDeM: A Process-Oriented Delphi Method for systematic asynchronous and consensual surgical process modelling. Artificial Intelligence in Medicine 135 102426 Ultrasound-Guided Central Venous Catheter placement. Journeymen approach using Process Mining. Gisselle Poblete Ramos, Victor Galvez-Yanjari, René de la Fuente Sanhueza, Jorge Munoz-Gama, Susan Retamal Brendel, Francisco Espinoza Aguayo, Ricardo Fuentes Henriquez, Marcos Sepúlveda Fernández: 48º Congreso Chileno de Anestesiología (2022) (2022) Ultrasound-Guided Central Venous Catheter placement. Journeymen approach using Process Mining. Conferencia Chilena de Anestesia 2022 Salazar J.P., Muñoz- Gama J., Maldonado J., Bustamante D., Sepúlveda M. (2021) Backpack Process Model (BPPM): A Process Mining Approach for Curricular Analytics Applied Sciences-Basel 11(9) 4265 Gonzalez-Lopez F., Pufahl L., Muñoz-Gama J., Herskovic V., Sepúlveda M. (2021) Case model landscapes: toward an improved representation of knowledge-intensive processes using the fCM-language Software & Systems Modeling Salazar -Fernández J.P., Sepúlveda M., Muñoz-Gama J., Nussbaum M. (2021) Curricular Analytics to Characterize Educational Trajectories in High-Failure Rate Courses That Lead to Late Dropout Applied Sciences-Basel 11(4) 1436 J. Munoz-Gama, V. Galvez, R. de la Fuente, M. Sepúlveda, R. Fuentes. Interactive Process Mining for Medical Training. In Interactive Process Mining in Healthcare, C. Fernandez-Llatas (editor). Springer, Cham, Switzerland, pp. 233-242, 2021. (2021) Interactive Process Mining for Medical Training Capítulo de libro Interactive Process Mining in Healthcare 233-242 C. Fernandez-Llatas, J. Benedi, J. Munoz-Gama, M. Sepúlveda, E. Rojas, S. Vera, V. Traver. Interactive Process Mining in Surgery with Real Time Location Systems: Interactive Trace Correction. In Interactive Process Mining in Healthcare, C. Fernandez-Llatas (editor). Springer, Cham, Switzerland, pp. 181-202, 2021. (2021) Interactive Process Mining in Surgery with Real Time Location Systems: Interactive Trace Correction Capítulo de libro Interactive Process Mining in Healthcare 181-202 C. Fernandez-Llatas, J. Munoz-Gama, N. Martin, O. Johnson, M. Sepúlveda, E. Helm. Process Mining in Healthcare. In Interactive Process Mining in Healthcare, C. Fernandez-Llatas (editor). Springer, Cham, Switzerland, pp. 41-52, 2021. (2021) Process Mining in Healthcare Capítulo de libro Interactive Process Mining in Healthcare 41-52 Alvarez C., Saint-Pierre C., Herskovic V., Sepúlveda M., Prieto F. (2020) Analysis of the relationship between treatment networks and the evolution of patients with Type 2 Diabetes Mellitus Journal of Biomedical Informatics 108 103497 de la Fuente R., Fuentes R., Munoz-Gama J., Riquelme A., Altermatt F.R., Pedemonte J, . Corvetto M., Sepúlveda M. (2020) Control-flow analysis of procedural skills competencies in medical training through process mining Postgraduate Medical Journal 96 250-256 de la Fuente R., Fuentes R., Munoz-Gama J., Danino J., Sepúlveda M. (2020) Delphi Method to Achieve Clinical Consensus for a BPMN Representation of the Central Venous Access Placement for Training Purposes. International Journal of Environmental Research and Public Health 17 11 3889 de la Fuente R., Kattan E., Munoz-Gama J., Puente I., Navarrete M., Kychenthal C., Fuentes R., Bravo S., Galvez V., Sepúlveda M. (2020) Development of a comprehensive Percutaneous Dilatational Tracheostomy process model for procedural training: a Delphi?based experts consensus Acta Anaesthesiologica Scandinavica Arias M., Rojas E., Aguirre S., Cornejo F., Munoz-Gama J., Sepúlveda M., Capurro D. (2020) Mapping the Patients Journey in Healthcare through Process Mining International Journal of Environmental Research and Public Health 17 18 6586 Wai Lam J., Burattin A., Muñoz J., Sepúlveda M. (2020) Orientation and conformance: A HMM-based approach to online conformance checking Information Systems Galvez V., de la Fuente R., Meneses C., Leiva L., Fagalde G., Herskovic V., Fuentes R., Munoz-Gama J., Sepúlveda M. (2020) Process-Oriented Instrument and Taxonomy for Teaching Surgical Procedures in Medical Training. International Journal of Environmental Research and Public Health 17 11 3849 Kattan E., de la Fuente R., Putz F., Vera M., Marcia C., Oscar I., Pablo A., Munoz-Gama J., Sepúlveda J., Gálvez V., Pavez N., Retamal J., Bravo S. (2020) Simulation-Based Mastery Learning of Bronchoscopy-Guided Percutaneous Dilatational Tracheostomy: Competency Acquisition and Skills Transfer to a Cadaveric Model Simulation in Healthcare: The Journal of the Society for Simulation in Healthcare Saint-Pierre C., Prieto F., Herskovic V., Sepúlveda M. (2020) Team collaboration networks and multidisciplinarity in diabetes care: Implications for patient outcomes IEEE Journal of Biomedical and Health Informatics 24 1 319-329 E. Rojas, A. Cifuentes, A. Burattin, J. Munoz-Gama, M. Sepúlveda, D. Capurro. Analysis of Emergency Room Episodes Duration Through Process Mining. Lecture Notes in Business Information Processing, vol. 342, n. 1, pp. 251263, 2019. https://doi.org/10.1007/978-3-030-11641-5_20. (2019) Analysis of Emergency Room Episodes Duration Through Process Mining Lecture Notes in Business Information Processing 342 1 251263 C. Fernandez-Llatas, G. Ibanez-Sanchez, A. Celda, J. Mandingorra, L. Aparici-Tortajada, A. Martinez-Millana, J. Munoz-Gama, M. Sepúlveda, E. Rojas, V. Gálvez, D. Capurro, V. Traver. Analyzing Medical Emergency Processes with Process Mining: The Stroke Case. Lecture Notes in Business Information Processing, vol. 342, n. 1, pp. 214225, 2019. https://doi.org/10.1007/978-3-030-11641-5_17. (2019) Analyzing Medical Emergency Processes with Process Mining: The Stroke Case Lecture Notes in Business Information Processing 342 1 214225 W.L.J. Lee, J. Munoz-Gama, H.M.W. Verbeek, W.M.P. van der Aalst, M. Sepúlveda. Improving Merging Conditions for Recomposing Conformance Checking. Lecture Notes in Business Information Processing, vol. 342, n. 1, pp. 3143, 2019. https://doi.org/10.1007/978-3-030-11641-5_3. (2019) Improving Merging Conditions for Recomposing Conformance Checking Lecture Notes in Business Information Processing 342 1 3143 Dogan O., Martinez-Millana A., Rojas E., Sepulveda M., Munoz-Gama",
  "content_length": 31413,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:58"
}