{
  "name": "Marco Antonio Zúñiga Zamalloa",
  "homepage": "http://www.st.ewi.tudelft.nl/~marco",
  "status": "success",
  "content": "Marco Zuniga Marco AntonioZúñiga Zamalloa Associate Professor Computer Science Department Delft University of Technology (Google Scholar Profile) home team publications curriculum vitae contact Research Interests & Short Bio My research interests are broadly in the areas of the Internet of Things (IoT), visible light communication, embedded AI, mmWave radar sensing, and pervasive & mobile computing. I obtained my PhD and MSc in Electrical Engineering from the University of Southern California, and my BSc in Electronics Engineering from the Pontificia Universidad Católica del Perú. Before my appointment at TU Delft, I was a member of the research staff at Xerox Research Labs; an IRCSET fellow at the National University of Ireland, Galway; and a senior researcher at the University of Duisburg-Essen, Germany. Recent Selected Publications My full publication list is available here W. Wang, Q. Wang, M. Zuniga, \"CardioID: Mitigating the Effects of Irregular Cardiac Signals for Biometric Identification\", [pdf], EWSN 2022. Best Paper Runner Up. M. Chavez, T. Xu, Z. Wu, M. Zuniga, \"SunBox: Screen-to-Camera Communication with Ambient Light\", [pdf], ACM UBICOMP 2022. T. Xu, M. Chavez, M. Zuniga, \"Exploiting Digital Micro-Mirror Devices for Ambient Light Communication\", [pdf], USENIX NSDI 2022. S. Ghiasi, M. Zuniga, K. Langendoen, \"A Principled Design for Passive Light Communication\", [pdf], ACM MOBICOM 2021. W. Wang, Q. Wang, J. Zhang, M. Zuniga, \"PassiveVLP: Leveraging smart lights for passive positioning\", [pdf], ACM Transactions on Internet of Things 2020. R. Bloom, M. Zuniga, C. Pai, \"LuxLink: Creating a Wireless Link from Ambient Light\", [pdf], ACM SENSYS 2019. [schematics and code] Related to this concept is our Accenture Innovation Award 2017 (joint work with Dr. Wang and Dr. Giustiniano: Link and RTL Z interview) and our presentation at the Innovation Expo 2018 for using \"Sunlight for Communication\". S. Demetri, M. Zuniga, G. Picco, F. Kuipers, L. Bruzzone, and T. Telkamp, \"Automated Estimation of Link Quality for LoRa: A Remote Sensing Approach\", [pdf], ACM/IEEE IPSN 2019. H.Wu, Q. Wang, J. Xiong, M. Zuniga, \"SmartVLC: Co-designing Smart Lighting and Communication for Visible Light Networks\", [pdf], ACM Transactions on Mobile Computing 2019. R. Bloom, M. Zuniga, Q. Wang, D. Giustiniano, \"Tweeting with Sunlight: Encoding Data on Mobile Objects\", [pdf], IEEE INFOCOM 2019. J. Verhoeff, A. Srirangam, M. Zuniga, B. Humala, \"Monitoring LED Lights with Current Signatures\", [pdf], IEEE INFOCOM 2018. A. Galisteo, Q. Wang, A. Deshpande, M. Zuniga, D. Giustiniano, \"Follow that Light: Leveraging LEDs for Relative Two-Dimensional Localization\", [pdf], ACM CoNEXT 2017. Q. Wang, M. Zuniga, D. Giustiniano, \"Passive Communication with Ambient Light\", [pdf], ACM CoNEXT 2016. Best Paper Runner Up. M. Cattani, A. Loukas, M. Zimmerling, M. Zuniga, K. Langendoen, \"Staffetta: Smart Duty-Cycling for Opportunistic Data Collection\", [pdf], ACM SENSYS 2016. L. Klaver, M. Zuniga, \"Shine: A Step Towards Distributed Multi-Hop Visible Light Communication\", [pdf], IEEE MASS 2015. Schematics and firmware available [here]. Best Paper Award. Professional Service I am involved in the organization and Technical Programm Committes of various venues, including: ACM SENSYS (2022, 2021, 2019, 2017, 2016) IEEE INFOCOM (2021, 2020, 2019, 2018, 2017, 2016) IEEE PERCOM (2021, 2020, 2019, 2018, 2017, 2016, 2015, 2014) ACM/IEEE IPSN (2020, 2018, 2017, 2016, 2015, 2013) EWSN (2021: General Co-Chair, 2015, 2014) ACM MOBICOM (2018) A complete list of my professional service is available here © 2012 Marco Zuniga Template design by Andreas ViklundBest hosted at www.svenskadomaner.se",
  "content_length": 3697,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:30"
}