{
  "name": "Marco Romano",
  "homepage": "https://www.marcoromano.eu",
  "status": "success",
  "content": "Prof. Marco Romano - Computer Science Prof. Marco Romano Welcome to my academic website. I am an Associate Professor of Computer Science at the University of International Studies of Rome (UNINT). I currently serve as the President of the Bachelor's Degree Program in Political Science, International Security, and CrimeâCybersecurity Track (L-36). Additionally, I am the Director of the Postgraduate Program in Cybersecurity Risk Specialist and the scientific coordinator of Real, the research group on virtual and augmented reality. My research focuses on Human-Computer Interaction (HCI), online disinformation, artificial intelligence, and smart cities. Throughout my career, I have collaborated with international institutions such as the University of Western Sydney in Australia, Universidad Carlos III de Madrid, and the University of Salerno. My teaching activities have been recognized with several awards for excellence. I have been involved in various industrial and academic research projects, contributing to innovative developments in AI, user experience design, and immersive technologies. I am a member of the Evaluation Expert Group (GEV) for the National Agency for the Evaluation of the University and Research System (ANVUR) and I work as coordinator of a working group for ensuring the quality of PhD programs at UNINT. My institutional page Real Research Group The Real research group is dedicated to studying extended reality technologies, such as virtual and augmented reality, as well as artificial intelligence across various fields, with a particular focus on learning, mental well-being, and social robotics. Real integrates its research findings directly into university courses and has contributed to the creation of specialized virtual reality lab courses in areas such as security, interpretation, psychology, and the metaverse economy. Additionally, the group offers students the opportunity to engage in internships, guiding them in actively exploring the world of research. Finally, Real collaborates in the development and management of events and activities within the metaverse, including virtual reality film screenings, cybersecurity awareness initiatives, public demonstrations, and the organization of virtual offices that interact with students within the Unintverse. Discover more about Real ❮ ❯ Teaching Currently, my courses focus on hacking and cybersecurity risk management, technologies for inclusion, and hands-on labs in artificial intelligence, virtual reality, augmented reality, and the metaverse. In the past, I have taught robot programming, interactive product design, and introductory programming for degree programs in both scientific and humanities fields. Additionally, I have served as an Apple Mentor for multiple editions of the Apple Foundation Program at the University of Salerno. Academic Projects I am involved in various academic and professional projects related to cybersecurity, game design, and immersive technologies. Coordinator of the Real Research Group - Focused on augmented and virtual reality research. Learn more. Bachelor's Degree Program in Political Science, International Security, and Crime â Cybersecurity Track (L-36) - Academic coordinator. Learn more. Postgraduate Program in Cybersecurity Risk Specialist - Director of the first-level university master's program. Learn more. Postgraduate Program in Game Design - Director of the first-level university master's program in game design. Learn more. Professional Training Courses in Cybersecurity - Specialized training programs in cybersecurity. Learn more. Contacts Email: marco.romano@unint.eu Office Hours: Wednesday, 12:00 PM - 2:00 PM (by appointment) Website: www.marcoromano.eu University Profile: UNINT Profile LinkedIn: Marco Romano on LinkedIn",
  "content_length": 3800,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:45"
}