{
  "name": "Marc J van Kreveld",
  "homepage": "http://www.staff.science.uu.nl/~kreve101",
  "status": "success",
  "content": "Marc van Kreveld Marc van Kreveld Professor; computational geometry and its application Head of the Department of Information and Computing Sciences, Utrecht University Geometric Computing group Department of Information and Computing Sciences Utrecht University P.O. Box 80.089 3508 TB  Utrecht The Netherlands E-mail: m.j.vankreveld [curly symbol] uu [point] nl My publications according to DBLP My publications in Google Scholar Citations Geometric construction puzzles, some photos Pilogram, a tangram version with pieces spanning two layers Composable art designed and made by me Research interests: computational geometry, GIScience, graph drawing, puzzle games analysis and generation. YouTube movie: Connect-the-Dots puzzles, based on a paper presented at SIGGRAPH 2014. Spiroplots generative art: Spiroplot, with an explanantion and an app for generating them. Bridges 2020 and CG Week Media 2020. Program Committees 2024: WALCOM 2024 2023: GIScience 2023 2022: International Symposium on Computational Geometry. 2021: EuroCG, GIScience. 2020: GISTAM, IFIP International Conference on Topics in Theoretical Computer Science (TTCS 2020) 2019: GISTAM, ACM SIGSPATIAL, 1st ACM SIGSPATIAL International Workshop on Computing with Multifaceted Movement Data (MOVE++ 2019) (as chair) 2018: FUN, GIScience 2017: EGC, ISAAC, WALCOM, GISTAM, CCCG 2016: EuroCG, GIScience, Workshop on Analysis of Movement Data (AMD'16), GD 2015: EuroCG, EGC (XVI Spanish Meeting on Computational Geometry), JCDCG^2 2014: AGILE, GIScience, CCCG 2013: EuroCG, ESA - track B, AGILE, MoDA (with ICDE), GeoInformatik, SIGSPATIAL 2012: EuroCG, GeoInformatik, GIScience, Graph Drawing, AGILE, CG:YRF, SIGSPATIAL 2011: AGILE, EuroCG, SoCG (co-chair), WADS, CCCG, GeoInformatik, Graph Drawing (co-chair), ICT.OPEN (co-chair) 2010: AGILE, CCCG, GIScience (co-chair), SIGSPATIAL, DEXA, SOFSEM, SIREN//NL - ASCI (co-chair) 2009: AGILE, CCCG, SIGSPATIAL, DEXA, WALCOM 2008: AGILE, SoCG, CCCG, GIScience, SIGSPATIAL, SDH, 3D GeoInformation Earlier PC memberships are not listed. Journals Editor-in-Chief of: CGT: Computing in Geometry and Topology (diamond open access) Editorial board member of: JoCG: Journal of Computational Geometry (diamond open access) JoSIS: Journal of Spatial Information Science (diamond open access) TSAS: Transactions of Spatial Algorithms and System Scientific advisory board member of: JTACS: Journal of Theoretical and Applied Computer Science PhD students Thijs van der Horst Co-supervised by Tim Ophelders and Bettina Speckmann. Erwin Glazenburg Co-supervised by Frank Staals Sarita de Berg Co-supervised by Frank Staals Ron Vanderfeesten (started Sept. 2015). Biological dynamic skin simulation. Jerome Urhausen Thesis: On geometric measures and their computation (2023) Co-supervised by Frank Staals and Maarten Löffler. Jordi Vermeulen Thesis: Geometric similarity measures and their applications (2022) Co-supervised by Frank Staals and Amir Vaxman. Kor de Jong Thesis: A modelling framework for simulating large geographical systems of agents and fields (2022) Co-supervised with Derek Karssenberg and Deb Panja. Mees van de Kerkhof Thesis: Algorithmic and Experimental Results on Trajectory Data Processing (2022) Co-supervised by Maarten Löffler and Irina Kostitsyna. Lionov Wiratma Thesis: Computations and Measures of Collective Movement Patterns Based on Trajectory Data (2019) Co-supervised with Maarten Löffler Arthur van Goethem (at TU/e) Thesis: Algorithms for Curved Schematization (2016) Co-supervised with Bettina Speckmann Frank Staals Thesis: Geometric Algorithms for Trajectory Analysis (2015) Co-supervised with Maarten Löffler Anne Driemel Thesis: Realistic Analysis for Algorithmic Problems on Geographical Data (2013) Co-supervised with Mark de Berg Thijs van Lankveld Thesis: Large Scale Shape Reconstruction from Urban Point Clouds (2013) Co-supervsied with Remco Veltkamp Maarten Löffler Thesis: Data Imprecision in Computational Geometry (2009) Rodrigo I. Silveira Thesis: Optimization of Polyhedral Terrains (2009) Esther Moet Thesis: Computation and Complexity of Visibility in Geometric Environments (2008) Iris Reinbacher Thesis: Geometric Algorithms for Delineating Geographic Regions (2006) Sergio Cabello Thesis: Geometric Problems in Cartographic Networks (2004) Tycho Strijk Thesis: Geometric Algorithms for Geographic Label Placement (2001) René van Oostrum Thesis: Geometric Algorithms for Geographic Information Systems (1999) Textbook Computational Geometry - Algorithms and Applications. Mark de Berg, Otfried Cheong, Marc van Kreveld, and Mark Overmars, Springer-Verlag, third edition, 2008. Textbook on computational geometry with a new perspective. Each chapter starts with an example problem from an application area (like graphics, GIS, robotics) where computational geometry can be useful. Major techniques and structures are plane sweep, randomized incremental construction, and geometric data structures. Web site of the book. Ordering the book from Springer-Verlag. Course web page at Utrecht University with slides for Chapters 1 to 9. Computational Geometry Useful pointers: Computational Geometry Pages. Wolfram MathWorld. DBLP computer science bibliography. Geometry Junkyard by David Eppstein. The Open Problems Project by Erik D. Demaine, Joseph S.B. Mitchell, and Joseph O'Rourke. CGAL, Computational Geometry Algorithms Library. Ipe, a drawing program by Otfried Cheong.",
  "content_length": 5431,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:04"
}