{
  "name": "Marc Erich Latoschik",
  "homepage": "https://hci.uni-wuerzburg.de/people/marc-latoschik",
  "status": "success",
  "content": "Marc Latoschik | Human-Computer Interaction Human-Computer Interaction Prof. Dr. Marc Erich Latoschik Head of Chair Contact Details Prof. Dr. Marc Erich Latoschik Human-Computer Interaction Universität Würzburg Emil-Fischer-Straße 50 D-97074 Würzburg ✆\t+49 (0) 931 31 85871 ✉\ted.grubzreuw-inu04%kihcsotal.cram ⌂\tRoom 01.030, Building 50, Hubland North Consultation-Hourby appointment PGP Key Fingerprint08 4E 7A 2B 8E 9C FE 5E 78 A5 EA 01 67 6C 36 23 About me Marc is heading the chair for Human-Computer Interaction (HCI) of the University of Würzburg. The chair spans a broad area of HCI topics and research groups, from immersive and interactive systems, games engineering, or media informatics, to digital media processing. Research Questions How will we interact with current and future computing systems? How do design choices, implemented metaphors, and technological finesse impact users concerning individual as well as social consequences? In short: How do we build good interactive systems and how do we define good under this perspective? Details Marc works on these questions throughout his career to create technology that is helpful and enjoyable for people. He studied mathematics and computer science at the University of Paderborn, the New York Institute of Technology and the Bielefeld University. Marc has an extensive background in the computer industry where he worked on various, back then entirely novel IT topics, e.g., interfaces for optical storage media and multimedia applications for a variety of large corporations and key players in the IT business. In 1996 he finally decided to devote all his time on his research questions and joined academia. He headed the AI & VR Lab at Bielefeld University until 2007, became a professor for media informatics at the University of Applied Sciences (HTW) in Berlin, and founded the Intelligent Graphics Group at Bayreuth University in 2009 before he finally took over the HCI chair at Würzburg University in 2011. Marc’s work has a strong interdisciplinary background. He combines methods and approaches from artificial intelligence, real-time interactive systems, 3D graphics, cognitive sciences, and psychology on top of a strong engineering foundation in computer science. Since his seminal work on multimodal–gesture and speech–interaction in Virtual Reality from the late 90th, he is interested in highly interactive and immersive interfaces of Virtual, Augmented, and Mixed Reality (VR, AR, MR). Current research topics focus on embodiment, i.e., of avatars and agents, body ownership and the Proteus effect, time perception, social VR, multimodal input/output, gamification, technical characteristics of, and engineering solutions for VR/AR, and application areas for therapy (e.g., of neurological deficits or obesity disorders), training, learning, and entertainment. Marc is an active member of the scientific community. He is a co-founder and was the elected spokesman for the GI special interest group on VR/AR, member of the ACM, IEEE, and GI, and serves in numerous program and organizing committees for prestigious conferences, journals, as well as in reviewing panels for various scientific selection processes. He has published more than 160 research articles (see below) in high-ranked journals (e.g., TVCG, Frontiers) and conferences (e.g., IEEE VR, VRST, ISMAR, CHI, ICMI, SUI). Several of his works won prestigious awards and are repeatedly founded by research agencies, e.g., within the Federal State of Bavaria, the German Ministry of Science and Education (BMBF), the German organization for science and research (DFG), or the European Commission. In his ever-decreasing spare time, Marc loves all kinds of sports and enjoys reading, e.g., books by Stephenson, Stross, Boyle, Murakami, Voltaire, Melville and many more. He likes to explore new tech, and very much enjoys a good conversation on exciting and enlightening topics during a wine or cold beer. Oh, one more thing: dogs and rock’n’roll! Projects ILAST - Immersive Leg Coordination And Strength Therapy ILAST is a prototype of an immersive Virtual Reality (VR) training system for post-operative therapy treatment after knee injuries. The training system uses basic game-like experiences simulated in fully immersive virtual environments which motivate patients to perform dedicated movement tasks mobilizing and strengthening their lower limbs. Since Oct 2018 More ViTras - Virtual Reality Therapy by Stimulation of Modulated Body Perception ViTraS develops therapy methods based on controlled modulation of body perception and behaviour patterns with the help of current Virtual and Augmented Reality (VR/AR) technologies. Since Apr 2019 More ViLeArn Situated virtual learning environments based on presence and social interaction. Since Oct 2018 More VIRTUALTIMES Exploring and Modifying the Sense of Time in Virtual Environments. Since Sep 2018 More Interactive OPERA Interactive virtual environments for Objective evaluation of Psychophysical Effects based on bRain Activity. Since Jul 2018 More Digitalisierungszentrum Präzisions- und Telemedizin (DZ.PTM) This project serves to establish the structure of the DZ.PTM Würzburg–Bad Kissingen as a virtual centre with three locations designated to develop, test and implement digitization projects across Bavaria to support patient care and research. Since Jun 2018 More VRGait This project investigate how Virtual Reality can support motor-rehabilitation of patients suffering from stroke consequences. Since Jan 2018 More Homecoming An Immersive and Gamified Virtual Reality Rehabilitation System to Increase Motivation During Gait Rehabilitation Since Jan 2018 More Embodiment Lab Embodied multimodal interfaces and digital humans become increasingly interesting for novel human-computer interface paradigms. The EmbodimentLab establishes a Bavarian competence center for the creative development of related application use cases and the necessary technology involved. Since Jul 2017 Go to website Holopark - Large Scale VR Museum Investation of the oportunities of large scale VR systems with high numbers of users. Since Apr 2017 More Breaking Bad Behaviors A New Tool for Learning Classroom Management Using Virtual Reality Since Oct 2015 More Dimensions of Virtual Body Ownership Users experience the perception of virtual bodies in immersive and semi immersive virtual environments. Since Jan 2014 More Augmenting Social Behavior The project explores the plasticity of communicative social behavior and its augmentation. We aim at finding out how future interactions in social virtual- and augmented realities can be supported by technology. Since Jan 2014 More GEtiT GEtiT (Gamified Training Environment for Affine Transformations) achieves an interactive gamified 3D-training of affine transformations by requiring users to apply their affine transformation knowledge in order to solve challenging puzzles presented in an immersive and intuitive 3D environment. Since Sep 2013 More XRoads XRoads explores novel and multimodal interaction techniques for tabletop games. It focuses Mixed Reality platforms that combine touch, speech, and gestures as input modalities for turn-based and real-time strategy games. Since Jan 2012 More GIB MIR Multimodal interfaces (MMIs) are a promising alternative human-computer interaction paradigm. They are feasible for a wide rang of environments, yet they are especially suited if interactions are spatially and temporally grounded with an environment in which the user is (physically) situated, like virtual reality, mixed reality, human-robot interaction, and computer games. Since Jan 2011 More CaveUDK CaveUDK is a high-level VR middleware based on one of the most successful commercial game engines: the Unreal® Engine 3.0 (UE3). It is a VR framework implemented as an extension to the Unreal® Development Kit (UDK) supporting CAVE-like installations. Since Jan 2011 More Simulator X Simulator X is a research testbed for novel software techniques and architectures for \t\t\t\tReal-Time Interactive Systems in VR, AR, MR, and computer games. It uses the central \t\t\t\tconcept of semantic reflection based on a highly concurrent actor model to build \t\t\t\tintelligent multimodal graphics systems. Since Jun 2009 More SIRIS SIRIS (Semantic Reflection for Intelligent Realtime Interactive Systems) is a \t\t\t\tresearch project which explores novel software architectures for Virtual, Augmented, \t\t\t\tMixed Reality and computer games and similar domains. Jun 2009 – May 2012 More SCIVE SCIVE (Simulation Core for Intelligent Virtual Environments) explores software techniques combining Artificial Intelligence (AI) methods with Virtual and Augmented Reality (VR/AR). Jan 2003 – Dec 2008 More Teaching Scientific Writing & Research Visit Wuestudy Principles of Realtime Interactive Systems Visit Wuestudy Multimodal Interfaces Visit Wuestudy Machine Learning Visit Wuestudy MCS/HCI Thesis Visit GitLab Interactive Computer Graphics - Lecuture Visit Wuestudy MCS/HCI/GE Exhibition Visit GitLab Grundlagen der Mensch-Computer Systeme Visit Wuestudy Grundlagen der Human-Computer Interaction Visit Wuestudy Publications Follow our Social Media Channels Contact Lehrstuhl für Mensch-Computer-Interaktion Universität Würzburg Emil-Fischer-Straße 50 97074 Würzburg How to Find Us University Main Page About the University University Contact Legal Information",
  "content_length": 9396,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:59"
}