{
  "name": "Marco Autili",
  "homepage": "http://people.disim.univaq.it/marco.autili",
  "status": "success",
  "content": "Marco Autili Website Marco Autili Professor, Software Engineer, Researcher, Developer Department of Information Engineering Computer Science and Mathematics (DISIM) University of L'aquila (Italy) My academic background is in Computer Science and Software Engineering, with expertise in solution- and knowledge-oriented research. My primary research interests include Autonomous and Autonomic Systems, Context-Aware Systems, Distributed Systems, and Self-Adaptive Systems. My work focuses on automated approaches for developing correct-by-construction practical solutions grounded in theoretical understanding and well-established architectural principles. I have gained extensive experience working across diverse countries and contexts, actively engaging with the international research community. I also have consolidated experience in National and European Union projects and collaborate with various companies worldwide. Recently, I have focused on: Ethical-aware Autonomous Systems Automated context-aware ethics-based negotiation in the autonomous vehicle and robot domains. Self-adaptive Multi-robot Systems Automated synthesis for handling uncertainty through mission adaptation and enforcing correctly distributed coordination. Cloud-to-Autonomous-Vehicles Continuum Enabling the cloud-to-autonomous-vehicles continuum for future industrial applications. Microservice Architecture Automated migration of monoliths to scalable and correctly coordinated microservice-oriented distributed systems. Distributed Software Synthesis Automated reasoning and synthesis techniques for correct-by-construction solutions, such as fully decentralized coordination and mission/protocol adaptation. About Me I am an Associate Professor at the Department of Information Engineering, Computer Science, and Mathematics (DISIM), University of L’Aquila. I graduated with honors in Computer Science at the University of L’Aquila in April 2004, and I received my Ph.D. in April 2008 with the highest distinction. I collaborate with various companies and international research groups worldwide. I have consolidated experience in European Union and Italian research and development projects, serving as principal investigator, scientific and technical project leader, research unit coordinator, and work package leader. I am the (co-)author of approximately 120 publications in international journals, conference proceedings, book chapters, and editorials. I serve as a reviewer for several international conferences, workshops, and top-tier international journals. I am also an associate editor and a member of the editorial board for several international journals. Additionally, I act as the lead guest editor for various special issues and thematic series and am actively involved in the organization of workshops and conferences in the field of Software Engineering. My research focuses on the application of automated software engineering techniques and practical formal methods to the modeling, architecture, analysis, and automatic synthesis of complex systems, spanning from theory to practice. The overarching goal is to simplify inherent system complexity for developers by leveraging expressive yet usable specification notations and languages, enabling automated reasoning and synthesis for correct-by-construction composition, coordination, and adaptation. My primary research contributions lie in the domains of distributed self-aware systems that support autonomic self-management operations and autonomous self-adaptive behaviors, including multi-robot and (micro)service-oriented systems. These systems involve distributed computing resources endowed with self-managing and decision-making capabilities, adapting dynamically to unpredictable changes, emerging goals, changing contexts, and, more recently, end-user ethical preferences. I released a number of software tools and platforms in connection with research projects and publications. Research100% Services100% Students100% Responsibility100% SoSy Lab I serve as the head of the Software Synthesis Lab, where I coordinate all research and development activities. The Software Synthesis Lab (>>> go to Laboratory Web Site) focuses on automated software synthesis approaches for the modeling, verification, and analysis of complex self-aware distributed systems that support autonomic and autonomous self-adaptive behaviors, including multi-robot and (micro)service-oriented systems. The aim is to simplify the inherent complexity for developers through the use of practical specification formalisms, enabling automated reasoning and synthesis for correct-by-construction composition, coordination and adaptation. Targeted systems involve distributed computing resources equipped with autonomic self-management and autonomous decision-making capabilities, enabling dynamic adaptation to unforeseen goal and mission changes, evolving operational contexts, and end-user ethical preferences. Publications ORCID Scholar DBLP R. Gate Education 11-Apr-2008 Doctoral Degree Ph.D. in Software Engineering Thesis Title: Synthesis Of Distributed Adaptors To Enforce Temporal Properties Specified Through Graphical Scenarios Awarded by: University of L'Aquila Advisor: Prof.ssa Paola Inverardi 20-Apr-2004 Master Degree Laurea cum laude in Computer Science Thesis Title: Automatic synthesis of software coordinators for communication protocols enhancement Awarded by: University of L'Aquila Advisor: Prof.ssa Paola Inverardi Qualifications date from 31-Jan-2022 [ITA] Abilitazione Scientifica Nazionale (ASN) alle Funzioni di Professore di I Fascia [ENG] National Scientific Habilitation as Full Professor Released by: Ministry of University and Research (MUR) - ITALY GSD: 01/INFO-01 - INFORMATICA SSD: INFO-01/A - Informatica date from 29-Jan-2014 [ITA] Abilitazione Scientifica Nazionale (ASN) alle Funzioni di Professore di II Fascia [ENG] National Scientific Habilitation as Associate Professor Released by: Ministry of University and Research (MUR) - ITALY GSD: 01/INFO-01 - INFORMATICA SSD: INFO-01/A - Informatica date from A.Y. 2008/2009 Subject-matter Expert (SME) Programming Foundations and Java Language Granted by: Academic Council - University of L'Aquila Academic Career previous steps September 26, 2016 to September 25, 2019 Assistant Professor tenure track position DISIM, University of L’Aquila - ITALY Projects: CHOReVOLUTION H2020 EU, Leonardo, TACTICS, GAUSS Italian PRIN, ConnectPA POR FESR Abruzzo August 01, 2014 to September 25, 2016 Senior Research Associate temporary position DISIM, University of L’Aquila - ITALY Projects: CHOReOS IP EU FP7, CHOReVOLUTION H2020 EU, Learn Pad STREP EU FP7, Original in Touch, Leonardo, TACTICS July 01, 2010 to July 20, 2014 Assistant Professor temporary position DISIM, University of L’Aquila - ITALY Projects: CONNECT FET EU FP7, D-ASAP Italian PRIN, PLASTIC IST EU FP6, Learn Pad STREP EU FP7, IDEAS Italian PRIN, Ricostruire - RIDITT March 1, 2008 to June 30, 2010 Postdoctoral Research Associate DISIM, University of L’Aquila - ITALY Projects: CONNECT FET EU FP7, D-ASAP Italian PRIN, PLASTIC IST EU FP6 November 2009 to December 2009 (2 months) Visiting Research Associate Swinburne University of Technology, Melbourne - AUSTRALIA January 2007 to December 2007 (1 year) Visiting Research Fellowship INRIA Rocquencourt, Paris - FRANCE Project: PLASTIC IST EU FP6 November 2005 to December 2005 (1 month) Visiting Research Fellowship Faculty of Sciences, Technologies and Communications, University of Luxembourg - LUXEMBOURG Project: CORRECT Luxembourgish project March 2002 to October 2002 (6 month) Research Collaboration Fellowship University of L’Aquila - ITALY Project: SAILOR Satellite Integrated UMTS Emulator IST EU project January 2003 to June 2003 (6 month) Exchange Student University of British Columbia, Vancouver - CANADA Projects I have consolidated experience in EU and Italian research and development projects as principal investigator, scientific and technical project leader, research unit coordinator, and work package leader. RoboChor Robot Choreography Italian PRIN PNRR project, Call 2022 (30 November 2023 - 29 November 2025) CAVIA Enabling the Cloud-to-Autonomous-Vehicles continuum for future Industrial Applications Italian PRIN project, Call 2022 (28 September 2023 - 27 September 2025) HALO etHical-aware AdjustabLe autOnomous systems Italian PRIN project, Call 2022 (28 September 2023 - 27 September 2025) SISMA Solutions for Engineering Microservices Architectures Italian PRIN project, Call 2017 (29 August 2019 - 28 August 2023) Full list of projects >>> ConnectPA (Connect Public Administration) POR FESR Abruzzo 2014-2020 - Industrial Research and Experimental Development. Action 1.1.1: \"Support for research projects of companies that employ researchers\" - Action 1.1.4: \"Support for collaborative research and development activities for the development of new sustainable technologies, new products and services\" GAUSS (Governing Adaptive and Unplanned Systems of Systems) Italian PRIN project, Call 2015 (February 2017 - February 2020) CHOReVOLUTION (Automated Synthesis of Dynamic and Secured Choreographies for the Future Internet) H2020 EU project, Research and Innovation Actions: ICT 9 - 2014: Tools and Methods for Software Development, 2015-2018 TACTICS (TACTICal Service oriented architecture) European Defence Agency (EDA) ad hoc B Program project, 2014-2017; LeonarDO (Smart digital ecosystem for the Customer Experience Enhancement): advanced ICT technologies (social means, mobile apps and big data analytics) for Customer Services. Founded by the Italian Ministry of Economic Development, 2014 - 2017 Original in Touch (Development of a Hardware and Software System to Fight Counterfeit). Founded by the Italian Ministry of Economic Development, from 2015 Ricostruire - RIDITT (Italian Network for Innovation and Technology Transfer to Enterprises) Founded by the Italian Ministry of Economic Development, from 2012",
  "content_length": 23409,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:31"
}