{
  "name": "Marcel Turcotte",
  "homepage": "http://www.site.uottawa.ca/~turcotte",
  "status": "success",
  "content": "Marcel Turcotte Marcel Turcotte 800 King Edward · Ottawa ON Canada · K1N 6N5 · (613) 562-5800, 7441 · marcel.turcotte@uottawa.ca Marcel Turcotte is a Computer Science Professor at the University of Ottawa’s School of Electrical Engineering and Computer Science. His group applies machine learning, algorithm design, and efficient data structures to solve complex bioinformatics problems such as identifying cell type-specific DNA signatures of transcription factor binding, classifying non-coding RNA sequences, and determining RNA virus-host susceptibility. Education Université de Montréal Philosophiae doctor (Ph.D.) in Computer Science Génération et traitement de contraintes relationnelles pour la modélisation des acides nucléiques Supervisors: Guy Lapalme (Computer Science) and Robert Cedergren (Biochemistry) December 7, 1995 Université de Montréal Master of science (M.Sc.) in Computer Science Fast-Track from the Master’s to the Ph.D. Supervisors: Guy Lapalme (Computer Science) and Robert Cedergren (Biochemistry) November 4, 1993 Université de Montréal Bachelor of science (B.Sc.) in Computer Science October 18, 1989 Experience Director, Program Evaluation Office of the Vice-Provost, Academic Affairs Responsible for cyclical reviews of undergraduate and graduate programs and manages the processes; chairs both program evaluation committees; sits on both councils (undergraduate and graduate studies). July 2020 - June 2023 Vice-Dean, Undergraduate Studies Faculty of Engineering An Officer of the Faculty and is a regular member of the Faculty Executive Committee. The Vice-Dean (Undergraduate Studies) is responsible for the development and administration of the undergraduate academic programs of the Faculty of Engineering, including recruitment, admissions, and retention. The Vice-Dean (Undergraduate Studies) provides support for professional accreditation. January 2012 - June 2018 Computer Science Professor School of Electrical Engineering and Computer Science (EECS) Students often say that I am knowledgeable and have a sense of humor. I take time to answer questions inside and outside of class. My notes, homework, laboratories and solutions are very organised. I am also known to give candy while lecturing stacks. July 2000 - Present Postdoctoral fellow Imperial Cancer Research Fund (ICRF), U.K. Applied Inductive Logic Programming (ILP) to learn signatures of protein folds. Under the supervision of Michael J.E. Sternberg, in collaboration with Stephen H. Muggleton. June 1997 - June 2000 Postdoctoral fellow University of Florida, U.S.A. Worked on the development of protein secondary structure prediction methods using evolutionary information. Under the supervision of Stephen A. Benner. September 1995 - May 1997 Research Academic profile Curriculum vitæ UNIWeb Profile Google Scholar Research Gate orcid.org/0000-0002-4877-1029 Publications Papers in refereed journals Aseel Awdeh, Marcel Turcotte, and Theodore J. Perkins. Identifying transcription factors with cell-type specific DNA binding signatures. BMC Genomics 25, 957 (2024). doi: 10.1186/s12864-024-10859-1 Kevin Sutanto and Marcel Turcotte. Assessing global-local secondary structure fingerprints to classify RNA sequences with deep learning. IEEE/ACM Transactions on Computational Biology and Bioinformatics 20(5):2736-2747, doi: 10.1109/TCBB.2021.3118358, 2023. Aseel Awdeh, Marcel Turcotte, and Theodore J. Perkins. WACS: improving ChIP-seq peak calling by optimally weighting controls. BMC Bioinformatics, 22(1):69, 2021. Alexander Gawronski and Marcel Turcotte. RiboFSM: Frequent subgraph mining for the discovery of RNA structures and interactions. BMC Bioinformatics, 15 Suppl 13:S2, November 2014. Ghada Badr, Isra Al-Turaiki, Marcel Turcotte, and Hassan Mathkour. Incmd: Incremental trie-based structural motif discovery algorithm. Journal of Bioinformatics and Computational Biology, 12(05):1450027, October 2014. PMID: 25362841. Georgette Kiethega, Yifei Yan, Marcel Turcotte, and Gertraud Burger. RNA-level unscrambling of fragmented genes in Diplonema mitochondria. RNA biology, 10(2):301–313, January 2013. Georgette N Kiethega, Marcel Turcotte, and Gertraud Burger. Evolutionarily Conserved cox1 Trans-Splicing Without cis-Motifs. Molecular biology and evolution, 28(9):2425–2428, September 2011. Mikhail Jiline, Stan Matwin, and Marcel Turcotte. Annotation Concept Synthesis and Enrichment Analysis: a Logic-Based Approach to the Interpretation of High-Throughput Experiments. Bioinformatics, 27(17):2391–2398, July 2011. A. Bellamy-Royds and M. Turcotte. Can clustal-style progressive pairwise alignment of multiple sequences be applied to RNA secondary structure prediction? BMC Bioinformatics, 8:190, 2007. V.X. Jin and M. Turcotte. Detecting localized interspersed motifs in genomic sequences: Application to the mouse genome. IEEE Transactions on Instrumentation and Measurement, 56(5):1770–1775, October 2007. S.D. Baird, S. M. Lewis, M. Turcotte, and M. Holcik. A search for structurally similar cellular internal ribosome entry sites. Nucl. Acids Res., 35(14):4664–4677, 2007. S.D. Baird, M. Turcotte, R. G. Korneluk, and M. Holcik. Searching for IRES. RNA Journal, 12(10):1755–1785, 2006. M. Anwar, T. Nguyen, and M. Turcotte. Identification of consensus RNA secondary structures using suffix arrays. BMC Bioinformatics, 7:244, 2006. B. Masoumi and M. Turcotte. Simultaneous alignment and structure prediction of three RNA sequences. International Journal of Bioinformatics Research and Applications, 1(2):230–245, 2005. M. Turcotte, S.H. Muggleton, and M.J.E. Sternberg. Generating protein three-dimensional fold signatures using inductive logic programming. Computers & Chemistry, 26(1):57–64, December 2001. M. Turcotte, S.H. Muggleton, and M.J.E. Sternberg. Automated discovery of structural signatures of protein fold and function. J. Mol. Biol., 306(3):591–605, 2001. M. Turcotte, S.H. Muggleton, and M.J.E. Sternberg. The effect of relational background knowledge on learning of protein three-dimensional fold signatures. Machine Learning, 43:81 – 95, 2001. M. Turcotte, S.H. Muggleton, and M.J.E. Sternberg. Use of inductive logic programming to learn principles of protein structure. Electronic Transactions on Artificial Intelligence, ETAI, 5(39), 2000. S.A. Benner, G. Cannarozzi, D. Gerloff, M. Turcotte, and G. Chelvanayagam. Bona Fide prediction of protein secondary structure using transparent analyses of multiple sequence alignments. Chemical Review, 97(8):2725 – 2843, 1997. D.L. Gerloff, F.E. Cohen, C. Korostensky, M. Turcotte, G.H. Gonnet, and S.A. Benner. A predicted concensus for the N-terminal fragment of the heat shock protein HSP90 family. Proteins: Struct. Funct. Genet., 27:450–458, 1996. M. Turcotte, G. Lapalme, and F. Major. Exploring the conformations of nucleic acids. J. Funct. Prog., 5(3):443–460, 1995. M. Feeley, M. Turcotte, and G. Lapalme. Using Multilisp for solving constraint satisfaction problems: an application to nucleic acid 3D structure determination. LISP AND SYMBOLIC COMPUTATION, 7(2/3):232–247, 1994. F. Major, M. Turcotte, , D. Gautheret, G. Lapalme, E. Fillion, and R. Cedergren. The combination of symbolic and numerical computation for three-dimensional modeling of RNA. Science, 253:1255–1260, September 1991. Papers in referred conference proceedings Thimmappa, B. C., Salhi, L. N., Forget, L., Sarrasin, M., Villalobos, P. B., Tur- cotte, M., Lang, F. B., and Burger, G. Microbes beneficial to cranberry plants. In 13th Interna- tional Vaccinium Symposium, Dalhousie University Halifax, Nova Scotia, Canada. International Society for Horticultural Science, Dalhousie University, Halifax, Nova Scotia, Canada, August 24-29, 2024. Kevin Sutanto and Marcel Turcotte. Extracting and evaluating features from RNA virus sequences to predict host species susceptibility using deep learning. In 13th International Conference on Bioinformatics and Biomedical Technology (ICBBT 2021), Northwestern Polytechnical University, Xi’an, China, May 21-23 2021. doi: doi/10.1145/3473258.3473271 (data) Kevin Sutanto and Marcel Turcotte. Assessing the use of secondary structure fingerprints and deep learning to classify RNA sequences. In IEEE International Conference on Bioinformatics and Biomedicine (BIBM), Seoul, South Korea, December 16-19 2020. doi: 10.1109/BIBM49941.2020.9313183 (data) Manuel Belmadani and Marcel Turcotte. MotifGP: Using multi-objective evolutionary computing for mining network expressions in DNA sequences. In IEEE International Conference on Computational Intelligence in Bioinformatics and Computational Biology (CIBCB 2016), Chiang Mai, Thailand, October, 5-7, 2016 2016. 10.1109/CIBCB.2016.7758133 Isra Al-Turaiki, Ghada Badr, Marcel Turcotte, and Hassan Mathkour. Incremental structural motif discovery. In International Symposium on Bioinformatics Research and Applications (ISBRA), 2013. Alexander Gawronski and Marcel Turcotte. Novel framework for the discovery of RNA elements and its application to Euglenozoa. In International Symposium on Bioinformatics Research and Applications (ISBRA), 2013. Oksana Korol and Marcel Turcotte. Learning relationships between over-represented motifs in a set of DNA sequences. In CIBCB 2012 : IEEE Symposium on Computational Intelligence in Bioinformatics and Computational Biology, San Diego, USA, May 9–12 2012. Sandrine Moreira, Marcel Turcotte, and Gertraud Burger. NGS: Neglected genome sequencing assembly and annotation challenges in a highly divergent protozoan genome. In JOBIM 2011 : Journées Ouvertes en Biologie, Informatique et Mathématiques, Paris, France, June 28 – July 1 2011. Ghada Badr and Marcel Turcotte. Component-based matching for multiple interacting rna sequences. In Jianer Chen, Jianxin Wang, and Alexander Zelikovsky, editors, Bioinformatics Research and Applications, volume 6674 of Lecture Notes in Computer Science, pages 73–86. Springer Berlin / Heidelberg, 2011. ",
  "content_length": 43837,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:11"
}