{
  "name": "Marcelo Orenes-Vera",
  "homepage": "https://morenes.github.io",
  "status": "success",
  "content": "Marcelo Orenes-Vera - Marcelo Orenes-VeraPhD in Computer Engineering Follow Santa Clara, CaliforniaNVIDIA + UCSCEmailGoogle ScholarORCIDGithubLinkedInMediumX (formerly Twitter)Currently working on next-generation GPU clusters to drive AI innovation. Research InterestsDeep Learning Computer Architecture, Parallel Computing & HPCChiplet-based Systems, Domain-specific Architectures & Software-Hardware Co-designData-centric Computing for Memory-intensive ApplicationsAgile & AI-assisted Hardware Design & VerificationFormal Verification & SecurityEducation Ph.D., Computer Science Princeton University, NJ Adviser: Prof. Margaret Martonosi and Prof. David Wentzlaff Dissertation: Navigating Heterogeneity and Scalability in Modern Chip Design M.A., Computer Science Princeton University, NJ B.Sc., Computer Science, with Honors University of Murcia, Spain Thesis: An Indoor Location and Guidance System with Automated User Trajectory Analysis. Exchange Student, Department of Computer Science University of Hasselt, Belgium Refereed Conference PublicationsMuchisim: A Simulation Framework for Design Exploration of Multi-Chip Manycore Systems.Marcelo Orenes-Vera, Esin Tureci, David Wentzlaff, Margaret Martonosi In The International Symposium on Performance Analysis of Systems and Software (ISPASS), 2024. PDF | CodeUsing LLMs to Facilitate Formal Verification of RTL.Marcelo Orenes-Vera, Margaret Martonosi, David Wentzlaff. PDF | CodeAutoCC: Automatic Discovery of Covert Channels in Time-Shared Hardware.Marcelo Orenes-Vera, Hyunsung Yun, Nils Wistoff, Luca Benini, Gernot Heiser, David Wentzlaff, Margaret Martonosi In the 56th International Symposium on Microarchitecture (MICRO). IEEE/ACM 2023. PDF | CodeTascade: Hardware Support for Atomic-free, Asynchronous and Efficient Reduction Trees.Marcelo Orenes-Vera, Esin Tureci, Margaret Martonosi, David Wentzlaff. PDF | CodeDCRA: A Distributed Chiplet-based Reconfigurable Architecture for Irregular Applications.Marcelo Orenes-Vera, Esin Tureci, Margaret Martonosi, David Wentzlaff. PDF | CodeWafer-Scale Fast Fourier Transforms.Marcelo Orenes-Vera, Ilya Sharapov, Robert Schreiber, Mathias Jacquelin, Philippe Vandermersch, Sharan Chetlur. In the 37th International Conference in Supercomputing (ICS ‘23). PDFDalorex: A Data-Local Program Execution and Architecture for Memory-bound Applications.Marcelo Orenes-Vera, Esin Tureci, David Wentzlaff, Margaret Martonosi. In the 29th IEEE Symposium on High-Performance Computer Architecture (HPCA ‘23). PDFCohort: Software-Oriented Acceleration for Heterogeneous SoCs.Tianrui Wei, Nazerke Turteyeva, Marcelo Orenes-Vera, Omkar Lonkar, Jonathan Balkind. In Proc. of the 28th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), ACM 2023. PDF | CodeDECADES: A 67mm², 1.46TOPS, 55 Giga Cache-Coherent 64-bit RISC-V Instructions per second, Heterogeneous Manycore SoC with 109 Tiles including Accelerators, Intelligent Storage, and eFPGA in 12nm FinFET.Fei Gao, Ting-Jung Chang, Ang Li, Marcelo Orenes-Vera, Davide Giri, et al. In Proc. of the Custom Integrated Circuits Conference (CICC), IEEE 2023. PDFCIFER: A 12nm, 16mm², 22-Core SoC with a 1541 LUT6/mm², 1.92 MOPS/LUT, Fully Synthesizable, Cache-Coherent, Embedded FPGA.Ting-Jung Chang, Ang Li, Marcelo Orenes-Vera, et al. In Proc. of the Custom Integrated Circuits Conference (CICC), IEEE 2023. PDFTiny but Mighty: Designing and Realizing Scalable Latency Tolerance for Manycore SoCsMarcelo Orenes-Vera, Aninda Manocha, Jonathan Balkind, Fei Gao, Juan L. Aragón, David Wentzlaff, Margaret Martonosi In the 49th Annual International Symposium on Computer Architecture (ISCA ‘22) IEEE MICRO Top Picks honorable mention. PDF | Code | PresentationAutoSVA: Democratizing Formal Verification of RTL Module InteractionsMarcelo Orenes-Vera, Aninda Manocha, David Wentzlaff, Margaret Martonosi In the 58th ACM/IEEE Design Automation Conference (DAC 21). PDF | CodeMosaicSim: A Lightweight, Modular Simulator for Heterogeneous SystemsOpeoluwa Matthews, Aninda Manocha, Davide Giri, Marcelo Orenes-Vera, Esin Tureci, Tyler Sorensen, Tae Jun Ham, Juan L. Aragón, Luca P. Carloni, Margaret Martonosi In The International Symposium on Performance Analysis of Systems and Software (ISPASS), 2020 Nominated for Best Paper Award. PDF | CodeA Simulator and Compiler Framework for Agile Hardware-Software Co-design EvaluationTyler Sorensen, Aninda Manocha, Esin Tureci, Marcelo Orenes-Vera, Juan L. Aragón, Margaret Martonosi. In International Conference on Computer Aided Design (ICCAD), ACM/IEEE 2020. PDFJournal PublicationsCIFER: A Cache-Coherent 12nm 16mm² SoC With Four 64-Bit RISC-V Application Cores, 18 32-Bit RISC-V Compute Cores, and a 1541 LUT6/mm² Synthesizable eFPGA.Ang Li, Ting-Jung Chang, Fei Gao, Marcelo Orenes-Vera, et al. In Solid-State Circuit Letters. IEEE 2023. PDFRECITE: A Framework for User Trajectory Analysis in Cultural Sites.Marcelo Orenes-Vera, Fernando Terroso, Mercedes Valdes-Vela. In Journal of Ambient Intelligence (JAISE), 2021. PDF | Code",
  "content_length": 5069,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:18"
}