{
  "name": "Marc Mézard",
  "homepage": "https://www.marcmezard.fr",
  "status": "success",
  "content": "Marc Mézard - ENS | Directeur de l'École normale supérieure, Paris Marc Mézard Physicien, professeur à l’Université Bocconi de Milan Présentation Depuis 2022, Marc Mézard est professeur à l’Université Bocconi à Milan, dans les départements de sciences computationnelles. Il est également membre du conseil scientifique de l’ICTP (Trieste) et du board du Cyprus Insitute. Auparavant, il a été pendant dix ans directeur de l’École normale supérieure. Il a également été président par intérim de l’Université PSL de mai à novembre 2017, et a siégé aux conseils d’administration de l’Université PSL, de l’École normale supérieure de Lyon, de l’École des Hautes Études en Sciences Sociales (EHESS), et d’un certain nombre de fondations de collaboration scientifiques : l’École d’économie de Paris, la Main à la Pâte, la fondation partenariale Philippe Meyer, la Fondation de l’École normale supérieure, la fondation de droit américain Friends of École normale supérieure, ainsi qu’au conseil scientifique de l’Institut Pascal de l’Université Paris Saclay. Physicien, Marc Mézard a fait l’essentiel de sa carrière au CNRS avant de rejoindre l’Université Bocconi. Il est l’auteur de plus de 170 publications et deux livres. Outre l’École normale supérieure, il a aussi travaillé au sein de l’Université Paris Sud, où il a dirigé le Laboratoire de physique théorique et modèles statistiques (LPTMS ) et le Laboratoire d’Excellence (Labex) PALM qu’il a contribué à fonder. Il a également occupé des postes de chercheur invité pour de longues périodes  à  l’Université «La Sapienza»  (Rome), à l’Université de Californie Santa Barbara (UCSB), à l’Université de Californie Berkeley ainsi qu’à l’Université d’Oldenburg. Il est spécialiste de physique statistique des systèmes désordonnés. Ses travaux, développés à l’origine pour décrire le comportement de systèmes magnétiques désordonnés, les verres de spin, ont permis de construire un cadre conceptuel et un ensemble de méthodes (dont la méthode de cavité) qui permettent de décrire et comprendre l’émergence, à savoir les nouveaux phénomènes dus aux comportements collectifs de nombreux atomes en interaction. Généralisant les approches de physique statistique aux cas où les atomes peuvent être des entités aussi diverses que des agents sur un marché, des protéines, des neurones ou des bits d’information, Marc Mézard a ainsi été amené à travailler dans diverses branches de la science, en physique de la matière condensée bien sûr (systèmes vitreux), mais aussi à l’interface avec la biologie (propriétés des molécules biologiques, réseaux de neurones), en théorie de l’information (codes, acquisition comprimée), en informatique théorique (satisfaction de contraintes, problèmes de couplage et de voyageur de commerce), ainsi qu’en finance (allocation d’actifs, dynamique du carnet d’ordre, répartition des richesses). Ces travaux ont été reconnus par l’attribution de nombreuses distinctions dont la médaille de bronze du CNRS en 1985, de la médaille d’argent du CNRS en 1990, du Prix Ampère de  l’Académie des sciences, en 1996, le prix Anatole et Suzanne Abragam de l’Académie des Sciences ainsi que deux récompenses étrangères le Prix Humboldt en 2009, et le Prix Onsager de l’American Physical Society en 2016. Télécharger le CV (Français) Download CV (English) En poursuivant votre navigation, vous acceptez l’utilisation de cookies permettant de réaliser des mesures statistiques. En savoir plus.J'accepte",
  "content_length": 3459,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:02"
}