{
  "name": "Marc Langheinrich",
  "homepage": "http://uc.inf.usi.ch/team/langheinrich",
  "status": "success",
  "content": "Marc Langheinrich – UbiComp @ USI Lugano Skip to Main Content 18 Jan 2016 Università della Svizzera italiana (USI) Faculty of Informatics (SI-106) Via G. Buffi 13 6900 Lugano, Switzerland phone: +41 (58) 666 43 04 email: marc.langheinrich@usi.chAbout MarcMarc Langheinrich is a Full Professor for Computer Science at the Università della Svizzera italiana (USI) in Lugano, Switzerland, where he heads the Research Group for Ubiquitous Computing since September 2008. Marc received a masters degree (Diplom) in computer science from the University of Bielefeld, Germany, in 1997, and his PhD (Dr. sc.) from the ETH Zürich, Switzerland, in 2005. Starting in the fall of 1995, he spent a year as a Fulbright Scholar at the University of Washington, where he also completed his thesis work in the fields of information retrieval and software agents. In the fall of 1997 he joined NEC Research in Japan where he worked on projects involving personalization and electronic commerce. From Oct.’99 to Aug.’08 he was a researcher at the Institute for Pervasive Computing at the ETH Zürich, Switzerland.Research interestsMarc’s main research interest lies at the intersection of privacy and ubiquitous computing. It is easy to imagine that in a world full of invisible sensory systems, comprehensive digital dossiers could be easily and inconspicuously collected. This poses several challenges to the design of ubiquitous systems: Which communication protocols ensure adequate levels of privacy protection? How can user interfaces be structured to provide users with control over their personal information? And how feasible is a comprehensive protection in a world of countless “smart” devices?For more information about current projects, see the Research Overview page.TeachingSee the Course Overview page for a list of courses.Professional ServiceEditor-in-Chief, IEEE Pervasive MagazineEditor, Dagstuhl Open Access Series in Informatics (OASIcs)Member, Steering Committee, IoT Conference SeriesDirector, Master in Management and Informatics, USI LuganoDirector, Master in Financial Technology and Computing, USI LuganoProjectsSee the Project Overview page for a list of current projects.Publications2023Dario Fenoglio, Martin Gjoreski, Marc Langheinrich (2023) A Federated Unsupervised Personalisation for Cognitive Workload Estimation, Proceedings of ACM Conference (MUM Conference'23), Lugano: MDPI AG, doi:10.1145/3626705.3631796 pdfDario Fenoglio, Daniel Josifovski, Alessandro Gobbetti, Mattias Formo, Hristijan Gjoreski, Martin Gjoreski, Marc Langheinrich (2023) Federated Learning for Privacy-aware Cognitive Workload Estimation, Proceedings of ACM Conference (MUM Conference'23) 1, doi:10.1145/3626705.3627783 pdfEnqi Fu, Matias Laporte, Cindy Guerrero Toro, Martin Gjoreski, Marc Langheinrich (2023) Affect and Learning in the LAUREATE Dataset, Adjunct Proceedings of the 2022 ACM International Joint Conference on Pervasive and Ubiquitous Computing and the 2022 ACM International Symposium on Wearable Computers, p. 168-172, New York, NY, USA: Association for Computing Machinery, doi:10.1145/3544793.3563401Matias Laporte, Enqi Fu, Martin Gjoreski, Marc Langheinrich (2023) Introduction of the LAUREATE Dataset: The Longitudinal multimodAl stUdent expeRience datasEt for AffecT and mEmory Research, Adjunct Proceedings of the 2022 ACM International Joint Conference on Pervasive and Ubiquitous Computing and the 2022 ACM International Symposium on Wearable Computers, p. 67-69, New York, NY, USA: Association for Computing Machinery, doi:10.1145/3544793.3560340Matias Laporte, Daniele Gasparini, Martin Gjoreski, Marc Langheinrich (2023) Exploring LAUREATE - the Longitudinal multimodAl stUdent expeRience datasEt for AffecT and mEmory Research, Adjunct Proceedings of the 2022 ACM International Joint Conference on Pervasive and Ubiquitous Computing and the 2022 ACM International Symposium on Wearable Computers, p. 494-499, New York, NY, USA: Association for Computing Machinery, doi:10.1145/3544793.3563426Riccardo Corrias, Martin Gjoreski, Marc Langheinrich (2023) Exploring Transformer and Graph Convolutional Networks for Human Mobility Modeling, Sensors 23(10), p. 4803, doi:10.3390/s23104803Ivan Fontana, Marc Langheinrich, Martin Gjoreski (2023) GANs for Privacy-Aware Mobility Modeling, IEEE Access 11, p. 29250-29262, doi:10.1109/ACCESS.2023.32609812022Clement Guitton, Aurelia Tamò-Larrieux, Simon Mayer, Eduard Fosch-Villaronga, Irene Kamara, Dimitri Van Landuyt, Marc Langheinrich, Przemysław Pałka, Zaira Zihlmann (2022) A Framework to Determine How and Whether to Implement Automatically Processable Regulation, SSRN Electronic Journal, doi:10.2139/ssrn.4226090Marc Langheinrich (2022) Hello, Goodbye, IEEE Pervasive Computing 21(4), p. 4-5, doi:10.1109/MPRV.2022.3214247Marc Langheinrich (2022) Standing on the Platforms of Giants, IEEE Pervasive Computing 21(3), p. 4-6, doi:10.1109/MPRV.2022.3198292Marc Langheinrich (2022) Technobubble, IEEE Pervasive Computing 21(1), p. 4-6, doi:10.1109/MPRV.2022.3150187Marc Langheinrich (2022) CONFIG.SYS, IEEE Pervasive Computing 21(2), p. 4-7, doi:10.1109/MPRV.2022.3175174Castro Elizondo Jose Ezequiel, Martin Gjoreski, Marc Langheinrich (2022) Federated Learning for Privacy-Aware Human Mobility Modeling, Frontiers in Artificial Intelligence 5, Frontiers Media S.A., doi:10.3389/frai.2022.867046 pdfPiotr Romashov, Martin Gjoreski, Kacper Sokol, Maria Vanina Martinez, Marc Langheinrich (2022) BayCon: Model-agnostic Bayesian Counterfactual Generator, Proceedings of the Thirty-First International Joint Conference on Artificial Intelligence, url pdf2021Anton Fedosov, Marc Langheinrich (2021) A Note on the Emerging Landscape of the Sharing Economy in Switzerland, The Collaborative Economy in Action: European Perspectives, p. 330-339, url pdfMatias Laporte, Preety Baglat, Shkurta Gashi, Martin Gjoreski, Silvia Santini, Marc Langheinrich (2021) Detecting Verbal and Non-Verbal Gestures Using Earables, Adjunct Proceedings of the 2021 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2021 ACM International Symposium on Wearable Computers, p. 165-170, New York, NY, USA: ACM, url, doi:10.1145/3460418.3479322 pdfMarc Langheinrich (2021) Prepare for Impact!, IEEE Pervasive Computing 20(1), p. 4-6, url, doi:10.1109/MPRV.2021.3058046Marc Langheinrich (2021) The Internet of Thugs?, IEEE Pervasive Computing 20(3), p. 4-6, url, doi:10.1109/MPRV.2021.3097670Marc Langheinrich (2021) To FLoC or Not?, IEEE Pervasive Computing 20(2), p. 4-6, url, doi:10.1109/MPRV.2021.30768122020Marc Langheinrich (2020) The New Normal, IEEE Pervasive Computing 19(4), p. 4-7, url, doi:10.1109/MPRV.2020.3032048Marc Langheinrich (2020) Long Live the IoT, IEEE Pervasive Computing 19(2), p. 4-7, url, doi:10.1109/MPRV.2020.2985136Asma Almutairi, Nigel Davies, Mateusz Mikusz, Marc Langheinrich, Sarah Clinch (2020) Designing for conflict, Proceedings of the 9TH ACM International Symposium on Pervasive Displays, p. 47-54, New York, NY, USA: ACM, url, doi:10.1145/3393712.3395336Claudio Bettini, Salil Kanhere, Marc Langheinrich, Archan Misra, Delphine Reinhardt (2020) Is Privacy Regulation Slowing Down Research on Pervasive Computing?, Computer 53(6), p. 44-52, url, doi:10.1109/MC.2020.2968013Paul Davidsson, Marc Langheinrich, Per Linde, Simon Mayer, Diego Casado-Mansilla, Daniel Spikol, Frank Alexander Kraemer, Nancy L. Russo (2020) IoT '20 Companion: 10th International Conference on the Internet of Things Companion, Malmö Sweden, October 6-9, 2020. , 10th International Conference on the Internet of Things Companion, New York, NY, USA: ACMMarc Langheinrich (2020) First Contact!, IEEE Pervasive Computing 19(3), p. 4-9, url, doi:10.1109/MPRV.2020.3002116Paul Davidsson, Marc Langheinrich (2020) IoT '20: 10th International Conference on the Internet of Things, Malmö, Sweden, October 6-9, 2020., Proceedings of the 10th International Conference on the Internet of Things, New York, NY, USA: ACMAsma Almutairi, Nigel Davies, Mateusz Mikusz, Marc Langheinrich, Sarah Clinch (2020) Designing for conflict: a design space for multi-viewer support in future display networks, Proceedings of the 9TH ACM International Symposium on Pervasive Displays, p. 47-54, New York, NY, USA: ACM, url, doi:10.1145/3393712.3395336Claudio Bettini, Salil Kanhere, Marc Langheinrich, Archan Misra, Delphine Reinhardt (2020) Is Privacy Regulation Slowing Down Research on Pervasive Computing?, Computer 53(6), p. 44-52, url, doi:10.1109/MC.2020.29680132019Kathrin Bednar, Sarah Spiekermann, Marc Langheinrich (2019) Engineering Privacy by Design: Are engineers ready to live up to the challenge?, The Information Society 35(3), p. 122-142, url, doi:10.1080/01972243.2019.1583296Anton Fedosov, Bianca Stancu, Elena Di Lascio, Davide Eynard, Marc Langheinrich (2019) Movie+: Towards Exploring Social Effects of Emotional Fingerprints for Video Clips and Movies, Proceedings of the 2019 ACM annual conference on Human Factors in Computing Systems - CHI ’19, ACM Press, url, doi:10.1145/3290607.3313261Agon Bexheti, Marc Langheinrich, Ivan Elhart, Nigel Davies (2019) Securely Storing and Sharing Memory Cues in Memory Augmentation Systems: A Practical Approach, PERCOM '19: Proceedings of the 17th Annual IEEE International Conference on Pervasive Computing and Communications (PERCOM'19), p. (forthcoming) pdfAnton Fedosov, Masako Kitazaki, William Odom, Marc Langheinrich (2019) Sharing Economy Design Cards, Proceedings of the 2019 ACM annual conference on Human Factors in Computing Systems - CHI '19, New York, New York, USA: ACM Press, url, doi:10.1145/3290605.3300375 pdfSarah Spiekermann, Jana Korunovska, Marc Langheinrich (2019) Inside the Organization: Why Privacy and Security Engineering Is a Challenge for Engineers, Proceedings of the IEEE 107(3), p. 600-615, url, doi:10.1109/JPROC.2018.28667692018Marc Langheinrich, Florian Schaub (2018) Privacy in Mobile and Pervasive Computing, Synthesis Lectures o",
  "content_length": 57003,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:03"
}