{
  "name": "Marcin Dziubinski",
  "homepage": "http://www.mimuw.edu.pl/~amosild",
  "status": "success",
  "content": "Home page of Marcin Dziubiński Marcin Dziubiński Institute of Informatics Faculty of Mathematics, Informatics and Mechanics University of Warsaw tel: +48 22 5544458 m.dziubinski@mimuw.edu.pl I am associate professor at Institute of Informatics, Warsaw University. My research interests lie at the interface of computer science and economics and include social and economic networks, mechanism design and game theory. My CV is available here. Publications Game Theory, Economics, and Computation How to hide in a network. (Extended abstract published in Proceedings of the 14th Conference on Web and Internet Economics, WINE 2018, Lecture Notes in Computer Science vol. XXXXX, p. XX-XX, 2018), joint with Francis Bloch and Bhaskar Dutta Hide and Seek Game with Multiple Resources. (Extended abstract published in Proceedings of the 11th International Symposium on Algorithmic Game Theory, SAGT 2018, Lecture Notes in Computer Science vol. 11059, p. 82-86, 2018), joint with Jaideep Roy Individual Security and Network Design with Malicious Nodes. Information, 9(9), 214, joint with Tomasz Janus and Mateusz Skomra Individual Security and Network Design with Malicious Nodes. Proceedings of the 17th International Conference on Autonomous Agents and MultiAgent Systems, AAMAS 2018, p. 1968-1970, 2018, joint with Tomasz Janus and Mateusz Skomra The spectrum of equilibria in Colonel Blotto and Colonel Lotto games. Proceedings of the 10th International Symposium on Algorithmic Game Theory, SAGT 2017, Lecture Notes in Computer Science vol. 10504, p. 292-306, 2017 Individual security, contagion, and network design. Journal of Economic Theory, 170, p. 182-226, 2017, joint with Diego Cerdeiro and Sanjeev Goyal How Do You Defend A Network? Theoretical Economics, 12(1), p. 331-376, 2017, joint with Sanjeev Goyal Network elicitation in adversarial environment. Proceedings of the 7th International Conference on Decision and Game Theory for Security, GameSec 2016, Lecture Notes in Computer Science vol. 9996, p. 397-414, 2016, Joint with Piotr Sankowski and Qiang Zhang Dynamic Conflict on A Network. (Extended abstract published in EC'16 Proceedings of the Seventeenth ACM Conference on Economics and Computation p. 205-206, 2016), joint with Sanjeev Goyal and David E. N. Minarsch Individual Security and Network Design. (Extended abstract published in EC '14 Proceedings of the Fifteenth ACM Conference on Economics and Computation p. 205-206, 2014), joint with Diego Cerdeiro and Sanjeev Goyal Non-symmetric discrete General Lotto games. International Journal of Game Theory, 42(4), p. 801-833, 2013 Network design and defence. Games and Economic Behavior, 79(1), p. 30-43, 2013, joint with Sanjeev Goyal Hotelling–Downs Competition with Free Entry When Voters Have an Option to Contest. Journal of Public Economic Theory, 15(4), p. 620-653, 2013, joint with Jaideep Roy The Hotelling-Downs Model with Runoff Voting. Games and Economic Behavior, 74(2), p. 447-469, 2012, joint with Sandro Brusco and Jaideep Roy Popularity of reinforcement-based and belief-based learning models: An evolutionary approach. Journal of Economic Dynamics and Control 36(3), p. 433-454, 2012, joint with Jaideep Roy Location game on disjoint line segments. International Journal of Game Theory 40(2), p. 231-262, 2011 Electoral competition in 2-dimensional ideology space with unidimensional commitment. Social Choice and Welfare 36(1), p. 1-24, 2011, joint with Jaideep Roy A Location Game on Disjoint Circles. International Game Theory Review 11(4), p. 391-406, 2009, joint with Debabrata Datta and Jaideep Roy Multi-Agent Systems Complexity of logics for multiagent systems with restricted modal context. Logic Journal of the IGPL 21(3), p. 355- 379, 2013 Complexity of Multiagent BDI Logics with Restricted Modal Context. Proceedings LAM'11: 4th International Workshop on Logic, Agents, and Mobility, 2011 Complexity of Multiagent BDI Logics with Restricted Modal Context. Proceedings AAMAS'11: 10th International Conference on Autonomous Agents and Multiagent Systems, p. 1171-1172, IFAAMAS, 2011 Complexity issues in multiagent logics. Fundamenta Informaticae 75(1-4), p. 239-262, 2007, joint with Rineke Verbrugge and Barbara Dunin-Kęplicz Reducing the complexity of logics for multiagent systems Proceedings AAMAS'07, Honolulu, Hawai'i, USA, ACM (2007), joint with Rineke Verbrugge and Barbara Dunin-Kęplicz Complexity of the logic for multiagent systems with restricted modal context In B. Dunin-Kęplicz and R. Verbrugge, editors, Proceedings of the 3rd Workshop on Formal Approaches to Multi-agent Systems (FAMAS’007), p. 1-18, Durham, 2007 Complexity of a theory of collective attitudes in teamwork. Proceedings of International Conference on Intelligent Agent Technology (IAT 2005), p. 579-586, Los Alamitos (CA), IEEE Computer Society (2005), joint with Rineke Verbrugge and Barbara Dunin-Kęplicz Unpublished papers The Strategy of Conquest joint with Sanjeev Goyal and David Minarsch",
  "content_length": 4990,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:25"
}