{
  "name": "Marcus A. Brubaker",
  "homepage": "https://mbrubake.github.io",
  "status": "success",
  "content": "About Me - Marcus A. Brubaker Marcus A. BrubakerInterested in Computer Vision, Machine Learning, Statistics and their application to a range of problems. He/Him Follow Toronto, Canada York University Email ResearchGate Twitter Mastodon LinkedIn Github YouTube Google Scholar ORCIDI’m a Research Scientist at Google DeepMind, an Associate Professor of Computer Science at York University, a founder and director of the Computational Vision and Imaging Lab at York, a Faculty Affiliate at the Vector Institute and an Adjunct Professor in the University of Toronto Department of Computer Science. I am a member of the Centre for Vision Research and core member of the Vision: Science to Application (VISTA) program. I have served in several community editorial roles including as an Associate Editor for IET Computer Vision and an Area Chair or Senior Area Chair for a number of conferences including CVPR, ECCV, NeurIPS, AAAI.I am also a Visiting Professor at Samsung AI Center - Toronto, a co-founder and advisor of Structura Biotechnology (makers of cryoSPARC) and an Academic Advisor at Borealis AI. Previously, I was a Research Director (2018-2020) at Borealis AI, a Research Associate at Cadre Research Labs (makers of TopMatch-GS) and one of the original contributors to Stan.I studied at the University of Toronto where I received my PhD in 2011. I also did postdocs at the Toyota Technological Institute at Chicago and the University of Toronto. See my CV for more details.Research InterestsI am interested in building rich, detailed models which capture fundamental relationships between the world and our observations of it. Such models ultimately enable us to measure and predict sometimes surprising details.Most recently I have been focusing on generative models, specifically normalizing flows. My research has been exploring theoretical aspects of normalizing flows and their applications. I also have an interest on the problem of estimating the 3D structure of biological molecules such as proteins and viruses with Cryo-EM. Beyond those current focuses, I have also worked on vehicle localization for robotics, physically realistic models of human motion, probabilistic programming languages, Bayesian methods, MCMC and forensic ballistics.Prospective StudentsInterested in joining my group? More information is available here.Recent News Joining Google DeepMind August 06, 2024I am excited to share that today I started as a Research Scientist with the Google DeepMind team in Toronto. I am very honoured to join such a distinguished group of amazing researchers. As a result, starting August 1, 2024 I am officially on a leave of absence from York University and will not be accepting new students. Promotion September 22, 2023Happy to be able to finally announce that as of July 1, 2023 I have received tenure and been promoted to the rank of Associate Professor. Thanks to everyone who has helped me along the way! Launch of CVIL Website September 13, 2023Happy to announce the launch of the Computational Vision and Imaging Lab website. I am a founder and director of CVIL, along with my colleagues Kosta Derpanis and Michael Brown. Please checkout the website to learn more about our group, including how to join! Papers Accepted at ICCV 2023 July 15, 2023Happy to announce the following papers accepted at ICCV 2023:Reference-guided Controllable Inpainting of Neural Radiance Fields by Ashkan Mirzaei, Tristan Aumentado-Armstrong, Marcus A. Brubaker, Jonathan Kelly, Igor Gilitschenski Alex Levinshtein, and Konstantinos G. Derpanis.Long-Term Photometric Consistent Novel View Synthesis with Diffusion Models by Jason Yu, Fereshteh Forghani, Konstantinos G. Derpanis and Marcus A. Brubaker.Congratulations and thanks to all my wonderful collaborators on these projects.For more news see here.",
  "content_length": 3815,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:58"
}