{
  "name": "Marc Denecker",
  "homepage": "https://people.cs.kuleuven.be/~marc.denecker",
  "status": "success",
  "content": "Marc Denecker's Home Page Marc Denecker's Home Page Address: Department of Computing, Celestijnenlaan 200 A, B-3001 Heverlee, Belgium. Phone: +32-(0)16-32 75 57 Fax: +32-(0)16-32 79 96 Email: Marc (dot) Denecker (at) kuleuven (dot) be 20 years ago, courtesy of Eugenia Ternovska I am head of the Knowledge Representation and Reasoning research group, a subgroup of the Declarative Languages and Artificial Intelligence group of the Department of Computing of the Katholieke Universiteit Leuven (KU Leuven) . Here you find my Curriculum Vitae. The groups main work is currently on the the IDP-Z3 system, a knowledge base system providing multiple forms of inference and a declarative programming environment for the logic FO(.)^IDP, an extension of first order logic. A previous version is the IDP3 system. Prizes and awards: ``IJCAI 2021 Distinguished Paper Award'' for the paper ``On the relationship between Approximation Fixpoint Theory and Justification Theory'' by Simon Marynissen, Bart Bogaerts, and Marc Denecker, at the 30th International Joint Conference on Artificial Intelligence (IJCAI 2021). ( slides of the talk/ the paper ) \"The John Alan Robinson 20-Year Test of Time Award\" awarded at the '37th International Conference on Logic Programming' (ICLP 2021)' for the paper ``Ultimate Well-Founded and Stable Semantics for Logic Programs with Aggregates'' by Marc Denecker, Nikolay Pelov and Maurice Bruynooghe, International Conference on Logic Programming ICLP 2001. ( slides of the talk/ the paper ) \"The John Alan Robinson 20 Year Test of Time Award\", awarded at the '36th International Conference on Logic Programming' (ICLP 2020)' for the paper ``Extending Classical Logic with Inductive Definitions'', International Conference on Computational Logic' (CL 2000). ( slides of the talk/ the paper ) See here for other awards and prizes won in the KRR group(s). Other selected papers and presentations (TBD): In a paper The Logic of Logic Programming with David Warren, we argue that logic programming is not programming in the Horn clause sublogic of classical logic (or in some autoepistemic or default logic), but programming in a logic of (inductive) definitions. Thus, the similarity between prototypical Prolog programs (e.g., member, append, . . . ) and how inductive definitions are expressed in mathematical text, is not coincidental but essential. This provides a natural solution to the main lingering semantic questions of Logic Programming and its extensions. In particular, and to the surprise of many, negation as failure is classical negation; it is the rule operator that is non-classical!! A simplified version of this paper was published as David Scott Warren, Marc Denecker: A Better Logical Semantics for Prolog. In \"Prolog: The Next 50 Years\", Lecture Notes in Computer Science 13900, Springer 2023, ISBN 978-3-031-35253-9 The Logic Programming community has been deeply troubled by the problem of declarative nature of its language for half a century now. We have argued that the natural solution is to interpret logic programming as a logic of inductive definitions in Logic Programming Revisited: Logic Programs as Inductive Definitions by Marc Denecker, Maurice Bruynooghe and Victor Marek, ACM Transactions on Computational Logic; 2001; Vol. 2; iss. 4; pp. 623 - 654. The logic FO(ID) is an extension of predicate logic FO with a language construct of Inductive Definitoins. This logic is probably the only conservative extension of both predicate logic and (an extension of) Logic Programming (LP), taking the declarative view on LP as a logic of generalized inductive definitions. The logic was studied in A Logic of Non-Monotone Inductive Definitions by Marc Denecker and Eugenia Ternovska, ACM Transactions on Computational Logic; 2008, Vol. 9,; iss. 2; pp 1–52. This is an extension of the 20 Year Test of Time Award paper Extending Classical Logic with Inductive Definitions Inductive Situation Calculus by Marc Denecker and Eugenia Ternovska, Artificial Intelligence, 2008. This paper investigates the representation of a rich variant of situation calculus using FO(ID), predicate logic extended with inductive definitions. It defines situations by structural induction. As such, it inverses and complements the thesis of the constructivist Brouwer that our understanding of construction in mathematics is based on our temporal reasoning skills. The KB paradigm and its application to interactive configuration. by Pieter Van Hertum, Ingmar Dasseville, Gerda Janssens, Marc Denecker, Theory and Practice of Logic Programming ; 2017. In various fields of Computational Logic, there is a widely present tendency to design ``declarative formalisms'', in which theories (now called ``programs'') have procedural semantics and can be executed as a program (e.g., Logic and Functional Programming, Database query languages) or, weaker, are seen as specifications of computational problems (Constraint Programming, Answer Set Programming). This paper take a more traditional view, declarative theories as specifications of information, and demonstrates how the same information can be used to solve a range of different types of computational problems, using a range of different forms of inference. It is demonstrated using IDP, our system providing multiple forms of inference on a declarative Knowledge Base expressed in FO(.). Summer course (4h). On the informal semantics of knowledge representation languages and the case of Logic Programming, Autumn School on Logic and constraint Programming, 18-19 September 2020, Rende, Italy. Views on education I am concerned with the level of mathematical education of our children in Secondary School (SO). In the past 30 years, New Math (moderne wiskunde) was abolished from SO. Have you wondered: Why Belgium SO students are declining in the Pisa math competition in the past 20 years? Why numbers of candidates for mathematical and formal science disciplines at university (mathematics, physics, engineering, ..) have declined? Why SO students educated 20, 30, 40 years ago, were better trained to read even todays scientific papers and text books on math or formal science than contemporary students? Why nowadays math education in China is probably better than in Belgium? I conjecture this is to an important degree because some essential intellectual skills are trained less in the reformed education than with New Math education. This is what I argue in The Rise and Fall of New Math in Secondary Education In Belgium , talk at seminar Meetings in Optimization, KULAK, 24/2/2022. In Knack, 18/1/2023, staat een interview van mij door wetenschapsjournalist Dirk Draulans over de crisis in het middelbaar en de impact op het Hoger Onderwijs. Een aantal leerkrachten hebben gereageerd, zowel wiskundeleerkrachten als andere, en zowel van de eerste graad, als de tweede. Sommige leerkrachten hadden soms zorgwekkende opmerkingen. Een aantal opmerkingen is hier verzameld. De commentaren zijn anoniem, op verzoek van een sommige leerkrachten. Invited and position talks: Invited talk at CILC2020 On the informal semantics of knowledge representation languages and the case of Logic Programming. At ASPOCP 2012: The FO(.) Knowledge Base System project: an integration project (abstract). Symposium on Constructive Mathematics in Computer Science in honor of Michael Gelfond, 2010: Answer Set Programming's Contributions to Classical Logic -- An analysis of ASP methodology (abstract, paper). At NonMon@30 (and also at NMR-10): On the informal and formal semantics of Default and Autoepistemic logic -- Default logic is not a logic of defaults (abstract,paper). A position talk at LPNMR09 (with Joost Vennekens): Using lightweight inference to solve lightweight problems. A position talk at ICLP09 (with Joost Vennekens): A Knowledge Base System project for FO(.). Invited talk at ICLP08: Building a Knowledge Base System for an Integration of Logic Programming and Classical Logic . Research: My research domain is the formal empirical science of knowledge and its use for solving problems. Some things we did or do: Study of the semantics of Logic Programming (LP) (\"What does a logic program mean? What does negation as failure mean?\"). In a number of papers, I have elaborated the view that a logic program is an inductive definition. Development of expressive, user-friendly KR-languages. Classical first order logic (FO) is our base KR-language. To clarify the KR contributions of Logic Programming, to integrate them with FO, we proposed FO(ID), an extension of FO with inductive definitions and an integration of FO and LP. We continue to extend this language with other useful language constructs. The resulting language(s) is FO(.), FO extended with ... inductive and coinductive definitions, aggregates, types, partial functions, bounded arithmetic, ... Other work is on CP-logic, a causal probabilistic logic. The knowledge base system IDP . It supports a range of inferences for FO(.) knowledge bases. Suitable for finite model generation and expansion, propagation, progression, interactive configuration. The new knowledge base system IDP-Z3 for FO(.) knowledge bases. Is based on Microsofts SMT system Z3, with better support for arithmetic reasoning. The IDP-Z3 interactive configurator. For more information on these topics, see the KRR webpage . Teaching: Logica voor Informatici (Dutch) Automaten en Berekenbaarheid (Dutch) Modeling of complex systems (English) Knowledge Representation (English) Advice for Phd's in general: For good mathematical writing, see the suggestions on p. 1-6 on the document Mathematical Writing by Donald E. Knuth, Tracy Larrabee, and Paul M. Roberts. Advice on scientific terminology within the FO(.) KB-project Some pictures of the most beautiful trips and trekkings I made: Trip with my sons Sander and Rogier and Charles in the natural parks of the north-west of the US. TBD. Trip with my sons Sander and Rogier in the natural parks of the south-west of ",
  "content_length": 11415,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:59"
}