{
  "name": "Marco Russo",
  "homepage": "https://www.dfa.unict.it/faculty/marco.russo",
  "status": "success",
  "content": "Marco RUSSO | Department of Physics and Astronomy \"Ettore Majorana\" Go to main contentGo to navigation menu Go to related content Marco RUSSO Full Professor of Informatics [INFO-01/A] Contacts Office: DFA 253Email: marco.russo@dfa.unict.itPhone:  5326Web Site: superpippo.ct.infn.it/~marco/didattica Office Hours Monday, Tuesday, Wednesday, Thursday and Friday from 10:00 to 18:00 In order to ensure reception for all interested students, it is advisable to contact the teacher in advance. Location: z CURRICULUMPUBLICATIONSTEACHINGRESEARCH AREAS Marco Russo received his master's degree in Electronical Engineering in 1992. In 1996 he received his Ph.D. degree and, in the same year, he became an assistant professor at the University of Catania, Faculty of Engineering. In 1998 he became an Associate Professor at the Univ. of Messina, Faculty of Engineering. Since 2003 he is full professor of Computer Science at the University of Catania. His research interests are: Fuzzy Logic, Neural Networks, Evolutionary Computation, VLSI Desing, Parallel and Distributed Computation. He is an author of more than 100 refereed publications. He is associate with the \"National Institute of Nuclear Physics (INFN)\", Section of Catania. VIEW THE PUBLICATIONS N.B. the number of publications can affect the loading time of the information VIEW COURSES FROM A.Y. 2022/2023 TO PRESENT Academic Year 2021/2022 DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 1st YearMACHINE LEARNING FOR PHYSICS DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearCOMPUTER LAB DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearCOMPUTER SCIENCE FOR PHYSICS DEPARTMENT OF PHYSICS AND ASTRONOMYBachelor's Degree in Physics - 2nd YearINFORMATICA E LABORATORIO Academic Year 2020/2021 DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearCOMPUTER LAB DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearCOMPUTER SCIENCE FOR PHYSICS DEPARTMENT OF PHYSICS AND ASTRONOMYBachelor's Degree in Physics - 2nd YearINFORMATICA E LABORATORIO Academic Year 2019/2020 DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearCOMPUTER LAB DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearCOMPUTER SCIENCE FOR PHYSICS DEPARTMENT OF PHYSICS AND ASTRONOMYBachelor's Degree in Physics - 2nd YearINFORMATICA E LABORATORIO Academic Year 2018/2019 DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearCOMPUTER LAB DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearCOMPUTER SCIENCE FOR PHYSICS DEPARTMENT OF PHYSICS AND ASTRONOMYBachelor's Degree in Physics - 2nd YearINFORMATICA E LABORATORIO A - L Academic Year 2017/2018 DEPARTMENT OF PHYSICS AND ASTRONOMYBachelor's Degree in Physics - 2nd YearCOMPUTER SCIENCE DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearLABORATORIO DI INFORMATICA DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearMETODI INFORMATICI PER LA FISICA Academic Year 2016/2017 DEPARTMENT OF PHYSICS AND ASTRONOMYBachelor's Degree in Physics - 1st YearBASICS OF COMPUTER SCIENCE DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearINFORMATICA PER LA FISICA APPLICATA Academic Year 2015/2016 DEPARTMENT OF PHYSICS AND ASTRONOMYBachelor's Degree in Physics - 1st YearCOMPUTER SCIENCE A - L DEPARTMENT OF PHYSICS AND ASTRONOMYBachelor's Degree in Physics - 1st YearCOMPUTER SCIENCE M - Z DEPARTMENT OF PHYSICS AND ASTRONOMYMaster's Degree in Physics - 2nd YearINFORMATICA PER LA FISICA APPLICATA VIEW PAST COURSES - Soft Computing: Genetic Programming, Evolutionary Computing, Clustering, Neural Networks, Fuzzy Logic. - Paralellel and Distributed Computing - Computer Architectures -  Digital electronics Share Facebook Twitter Whatsapp Telegram Email About Administration and services Astrophysics Division Our history Phonebook Faculty Staff Research fellows PhD students Scholarship holders Search Enter your keywords",
  "content_length": 4023,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:46"
}