{
  "name": "Marcos Kalinowski",
  "homepage": "http://www.inf.puc-rio.br/~kalinowski",
  "status": "success",
  "content": "﻿ Marcos Kalinowski - Pontifical Catholic University of Rio de Janeiro Marcos Kalinowski Home Books Publications Services Awards Students Teaching CV Lattes (in Portuguese) Marcos Kalinowski Current Main Enrollment Professor of Software Engineering, Department of Informatics, Pontifical Catholic University of Rio de Janeiro (PUC-Rio) Coordinator, Software & AI Engineering Lab General Chair, International Conference on Software Engineering (ICSE) 2026 Associate Editor of Empirical Software Engineering, IEEE Software, and Journal of Systems and Software Steering Committee Member, ICSE and Ibero-American Conference on Software Engineering (CIbSE) Member, International Software Engineering Research Network (ISERN) Senior Advisor and Lead Appraiser, the Brazilian Software Quality Program (MPS.BR) Member, ACM, IEEE, and Brazilian Computer Society (SBC) Main Research Interests AI Engineering AI for Software Engineering Empirical Software Engineering Human Aspects of Software Engineering Research Agency Funding and Industry-Academia Collaborations Brazilian Coordination for the Improvement of Graduate Level Personnel (CAPES) - PROEX Brazilian Research Council (CNPq) - Reserch Fellow Distinction (level 1D) Rio State Agency (FAPERJ) - Scientist of the State Distinction Private Financial Research Support by Instituto Kunumi and Instituto Stone Projects with several industry partners (e.g., CEPEL, Eletrobras, Exa, Galp, Petrobras) Contact Information Departamento de Informática - PUC-Rio, Room RDC508 Rua Marquês de São Vicente 225, 22451-900, Gavea, Rio de Janeiro, RJ, Brazil +55 (21) 3527-1500 Extension 4337 (My Office) kalinowski [at] inf.puc-rio.br @prof_kalinowski https://www.linkedin.com/in/kalinowski/ Academic Positions Present 2017 Professor (Professor do Quadro Principal) Pontifical Catholic University of Rio de Janeiro (PUC-Rio), Department of Informatics 2023 2023 Visiting Professor (Temporary Contract) University of Bari (Italy), Department of Informatics 2022 2022 Visiting Professor (Temporary Contract) University of Bari (Italy), Department of Informatics 2017 2014 Professor (Professor Adjunto) Fluminense Federal University (UFF), Computing Institute 2014 2012 Professor (Professor Adjunto) Federal University of Juiz de Fora (UFJF), Computer Science Department Academic Degrees Ph.D. 2011 D.Sc. in Software Engineering, COPPE/UFRJ Advisor: Guilherme Travassos M.Sc.2004 M.Sc. in Software Engineering, COPPE/UFRJ Advisor: Guilherme Travassos M.Sc.2004 B.Sc. in Computer Science, UFRJ Advisor: Marcos R. S. Borges",
  "content_length": 2556,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:58"
}