{
  "name": "Marc H. Scholl",
  "homepage": "https://dbis.uni-konstanz.de/people/people/scholl",
  "status": "success",
  "content": "Prof. Dr. Marc H. Scholl | Alumni | People A–Z | People | Database and Information Systems Areas of InterestDatabase Systems Architecture and ImplementationData ModelsDatabase (Query) Languages and Query OptimizationData Stream ProcessingInteraction between Database and Programming LanguagesObject-Oriented and XML Databases Scientific Career Positions 1994-2023: Full Professor at University of Konstanz 1992-1994: Associate Professor (C3) at University of Ulm 1989-1992: Assistant Professor (Oberassistent) at Swiss Federal Institute of Technology (ETH) Zurich, Institute for Information Systems, Dept. of Computer Science 1983-1989: Teaching Assistant at Technical University of Darmstadt, Dept. of Computer Science Degrees 1988: PhD Degree (Dr.-Ing.) from TU Darmstadt in Computer Science 1982: MSc Degree (Dipl.-Inform.) from TU Darmstadt in Computer Science (Selected) Professional Activities Services at U Konstanz and U Freiburg  (on leave to U Freiburg:) 01/2022 - 09/2023: Chief Information Officer (CIO) in the Rectorate of U Freiburg 04/2019 - 03/2021: Vice President (Prorektor) Information and Communication Technology / Chief Information Officer (CIO)  since 12/2012: Chief Information Officer (CIO, \"IT-Verantwortlicher\") University of Konstanz 04/1998 - 09/2004: Vice President (Prorektor) University of Konstanz Memberships several scientific societies and their subgroups (ACM, IEEE CS, GI) EDBT association, executive board (since 2004, President 2004-2012) Scientific Committees program committee member of many major international and national conferences reviewer for major international and national journals and funding bodies General Chair of the 2006 edition of the International Conference on Extending Database Technology (EDBT'06), Munich, Germany General Chair of the IFIP WG 2.6 International Conference on Semantics of a Networked World, Munich, Germany Other Activities Co-founder of a spin-off company, BaseX GmbH, Konstanz, on the basis of the OpenSource BaseX XML DBMS  Founding Editor of OpenProceedings.org, an Open Access Publication platform for scientific conference proceedings ORCID ID: 0000-0002-4304-4092 Publications LegendHide legend Article Book Dissertation Thesis Proceedings Other Link to full text Link to original publication ...loading... \"There was an error during trying to get the publication list. Please try again or inform the admin, if it fails again.\" Contact Prof. Dr. Marc H. Scholl contact via eMail Send email Hide search Search University of Konstanz Search terms Search Results Suggestions",
  "content_length": 2559,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:01"
}