{
  "name": "Marcus Baum",
  "homepage": "https://www.uni-goettingen.de/en/523550.html",
  "status": "success",
  "content": "Prof. Dr.-Ing. Marcus Baum - Georg-August-Universität Göttingen ✖ Suchbegriff Search with Google™ Use Internal Search (limited result quality) Home People Research Teaching Publications Menü Menü Suchbegriff Suchbegriff Search with Google™ Use Internal Search (limited result Quality). Suche starten By using the Google™ Search you agree to Google's privacy policy Looking for people, classes or lecturing halls ? To eCampus Close Prof. Dr.-Ing. Marcus Baum Marcus BaumGoldschmidtstr. 737077 Göttingen Room 3.115 Tel. +49 551 39 172024Fax. +49 551 39 14415 marcus.baum@cs.uni-goettingen.de Google Scholar Profile LinkedIn Profile Karlsruhe Institute of Technology (KIT) ISAS Lab University of Connecticut Education 2013 Dr.-Ing. (summa cum laude), Karlsruhe Institute of Technology (KIT), Karlsruhe, Germany. 2007 Dipl.-Inform. degree in computer science, University of Karlsruhe (TH), Karlsruhe, Germany. Work Since 2019 Full Professor (W3), University of Göttingen, Germany. 2017 - 2019 Interim Professor (Vertretungsprofessor, W3), University of Passau, Lehrstuhl für Informatik mit Schwerpunkt Sensorik, Germany. 2015 - 2019 Juniorprofessor (W1), University of Göttingen, Germany. 2013 - 2014 Postdoctoral Fellow / Assistant Research Professor, ECE Department (Peter Willett), University of Connecticut, CT, USA. 2007 - 2013 Research Assistant and PhD Student, ISAS Lab (Uwe D. Hanebeck), Karlsruhe Institute of Technology (KIT), Germany. Awards 11/2017 Best Poster Paper Award, \"2017 IEEE International Conference on Multisensor Fusion and Information Integration (MFI 2017)\". 07/2017 ISIF Young Investigator Award for outstanding contributions to the art of information fusion sponsored by the International Society of Information Fusion (ISIF) 07/2014 Teaching award for the \"best tutorial in the summer term 2013\" for the tutorial of the lecture \"Localization of Mobile Agents\", Faculty of Informatics, KIT. 09/2012 Best Student Paper Award Finalist, \"2012 IEEE International Conference on Multisensor Fusion and Information Integration (MFI 2012)\". 07/2011 Best Student Paper Award, \"14th International Conference on Information Fusion (Fusion 2011), Chicago, Illinois\". 07/2011 Teaching award for the \"best lecture in the summer term 2011\" for the lecture \"Localization of Mobile Agents\" (together with Prof. Uwe D. Hanebeck), Faculty of Informatics, KIT. 03/2009 Teaching award for the \"best laboratory experiment in the summer term 2008\", Faculty of Informatics, KIT. Further Activities Since 2017 Associate Editor of Letters, IEEE Transactions on Aerospace and Electronic Systems. 2017 General co-chair, Clausthal-Göttingen International Workshop on Simulation Science, Göttingen, Germany. 2016 Technical program chair, 2016 IEEE International Conference on Multisensor Fusion and Integration for Intelligent Systems (MFI 2016), Baden-Baden, Germany. 2016 Local arrangements chair, International Conference on Information Fusion (FUSION 2016), Heidelberg, Germany. Since 12/2015 Member, Sino-German Institute of Social Computing (SGISC) Since 10/2015 Member, Simulation Science Center Clausthal / Göttingen (SWZ) 2015 Co-Organizer of the JAIF Special Issue on (Multi-)Object Tracking using Non-traditional Measurement Models: Extended Objects and More. Since 07/2014 Associate administrative editor, Journal of Advances in Information Fusion (JAIF). Since 2010 TPC member, International Conference on Information Fusion (FUSION). Since 2009 Co-organizer of the Special Session \"Extended Object and Group Tracking\", International Conference on Information Fusion (FUSION). Publications Please see the publications page. Data Fusion Lab Institute of Computer Science Campus Institute Data Science University of Göttingen Goldschmidtstraße 7 37077 Göttingen Germany",
  "content_length": 3775,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:59"
}