{
  "name": "Marcus Paradies",
  "homepage": "https://www.dbs.ifi.lmu.de/cms/personen/professoren/paradies/index.html",
  "status": "success",
  "content": "Persons - Data Base Systems and Data Mining AI Lab - LMU München Our Team The team belonging to the four research groups and associated staff of the MCML Skip to content Professors Secretary and System Management Scientific Personnel Alumni Job Opportunities Show more Professors Prof. Dr. Thomas Seidl Chair of Database Systems, Data Mining and AI Head of group, Director of MCML Data Mining and AI Room: 152 Send an email +49-89-2180-9191 More Prof. Dr. Marcus Paradies Database Systems, Data Mining and AI Research Group Leader Moden Database Systems Room: 158 Send an email More Prof. Dr. Volker Tresp Database Systems, Data Mining and AI Research Group Leader Multimodal and Agentic AI Room: F108 Send an email +49-173-5293072 https://www.dbs.ifi.lmu.de/~tresp/ More Prof. Dr. Matthias Schubert Database Systems, Data Mining and AI Research Group Leader Spatial AI Room: F107 Send an email +49-89-2180-9328 More Secretary and System Management Susanne Grienberger Office Management Send an email +49-89-2180-9190 More Joao Cardoso System Administration Send an email +49-89-2180-9327 More Scientific Personnel A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Dr. Elke Achtert Managing Director MCML MCML Management Room: F112 Send an email Munich Center for Machine Learning More Verena Albrecht Science Communication MCML MCML Management Room: F 111 Send an email Munich Center for Machine Learning More Mamdouh Aljoud Data Mining and AI Room: F104 Send an email More Johann Blake external PhD student Spatial AI More Walid Durani Research Assistant Data Mining and AI Room: G156 Send an email More Laura Ekes MCML Management Room: 156 Send an email More Dr. Sandra Gilhuber PostDoc Data Mining and AI Room: F 104 Send an email More Tanveer Hannan Research Assistant Data Mining and AI Room: F110 Send an email https://tanveer81.github.io/ More Philipp Jahn Research Assistant Data Mining and AI Room: 156 Send an email More Nefta Kanilmaz Research Assistant Data Mining and AI Room: F 104 Send an email More Lena Krieger external PhD student Data Mining and AI More Jian Lan Research Assistant Data Mining and AI Room: F 110 Send an email More Zongyue Li Research Assistant Spatial AI Room: F 103 Send an email More Ruotong Liao Research Assistant Multimodal and Agentic AI Room: FU107 Send an email Homepage More Tong Liu Research Assistant Multimodal and Agentic AI Room: G U104 Send an email More Dr. Thomas Meier MCML Management of Collaborations and of PhD Program MCML Management More Constantin Pestka Research Assistant Modern Database Systems Room: G U108 Send an email More Philipp Pfefferkorn Research Assistant Spatial AI Room: F 109 Send an email More Daniela Pielenhofer MCML Management Send an email More Simon Rauch Research Assistant Data Mining and AI Room: 156 Send an email More Dr. Udo Schlegel Postdoc Data Mining and AI Room: F110 Send an email Personal Web Page More Dr. Daniel Schuster PostDoc Data Mining and AI Room: F 103 Send an email More Dr. Gabriel Marques Tavares Postdoc Data Mining and AI Room: F106 Send an email More David Winkel external PhD student Data Mining and AI More Jingpei Wu Research Assistant Multimodal and Agentic AI Room: G U104 Send an email More Zhicong Xian Research Assistant Data Mining and AI Room: F 106 Send an email More Gengyuan Zhang Research Assistant Multimodal and Agentic AI Room: E U103 Send an email More Yao Zhang Research Assistant Multimodal and Agentic AI Send an email More Alumni Kai AldingerDr. Evguenia AltarevaDr. Mihael AnkerstDr. Johannes AßfalgNorbert BeckmannDr. Anna BeerDr. Stefan BerchtoldDr. Maximilian BernhardDr. Thomas BerneckerDr. Max BerrendorfProf. Dr. Christian BöhmProf. Dr. Karsten BorgwardtDr. Felix BoruttaDr. Bernhard BraunmüllerDr. Stefan BrecheisenProf. Dr. Markus BreunigProf. Dr. Thomas BrinkhoffDr. Markus BundschusDr. Julian BuschProf. Dr. Stefan ConradDr. Tobias EmrichProf. Dr. Martin EsterDr. Evgeniy FaermanGabriele FörstnerChristian FreySabrina FriedlDr. Michael FrommDr. Bertram FronhöferDr. Franz GrafMatthias GroßDr. Stephan HeepHolger HornMaximilian HünemörderMatthias JakobProf. Dr. Riko JacobEshref JanuzajDr. Gregor JosséDr. Daniel KaltenthalerDr. Karin KailingClara KaplanDaniyal KazempourProf. Dr. Daniel KeimMauritius KleinRajat KonerFlorian KrebsProf. Dr. Peer KrögerFranz KrojerDr. Peter KunathDr. Collin LeiberAndreas LohrerDr. Johannes LohrerDr. Yifeng LuDr. Yunpu MaAndrea MaldonadoDr. Markus MauderDr. Andreas MiethsamThomas RamsauerProf. Dr. Robert MüllerDr. Johannes NiedermayerProf. Dr. Eirini NtoutsiAlp ÖnalDr. Marisa PetriDr. Martin PfeifleDr. Marco PötkeJuraj PoradaEdy PrawirohardjoDr. Alexey PryakhinProf. Dr. Matthias RenzDr. Florian RichterAmeed SahakaProf. Dr. Jörg SanderDr. Michael SchiwietzDr. Klaus Arthur SchmidThomas SchmidtDr. Sebastian SchmollDr. Ralf SchneiderDr. Stefan SchönauerDr. Erich SchubertNadine SchülerProf. Dr. Bernhard SeegerSahand SharifzadehgolpayeganiJanina SontheimDr. Niklas StraußDr. Jan StutzkiDr. Florian VerheinStefanie WankaDr. Michael WeilerDavid WinkelProf. Dr. Xiaowei XuDr. Kai YuDr. Shipeng YuDr. Ludwig ZellnerProf. Dr. Arthur ZimekProf. Dr. Andreas Züfle Job Opportunities Career up What are you looking for? More information about Google data transfer in LMU's Privacy Policy. close",
  "content_length": 5287,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:02"
}