{
  "name": "Marco Canini",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/marcocanini",
  "status": "success",
  "content": "Marco Canini - Professor, Computer Science - King Abdullah University of Science and Technology Top Home Study Faculty Marco Canini Professor, Computer Science Computer, Electrical and Mathematical Science and Engineering Division marco@kaust.edu.sa SANDS lab Program Affiliations Computer Science Biography Marco Canini is a Professor of Computer Science at KAUST. He obtained his Ph.D. in computer science and engineering in 2009 from the University of Genoa, Italy, after spending the last year of his degree as a visiting student at the University of Cambridge, U.K.He holds a Laurea Degree with Honors in Computer Science and Engineering from the University of Genoa. He was a postdoctoral researcher at the École polytechnique fédérale de Lausanne (EPFL), Switzerland, from 2009 to 2012. He then worked as a senior research scientist at Deutsche Telekom's Innovation Labs and the Technical University of Berlin, Germany, for one year.Before joining KAUST, Canini was an assistant professor of computer science at the Université catholique de Louvain, Belgium. He has also held industry positions with Intel, Microsoft, and Google. Research Interests Professor Canini‘s research interests center on the principled construction and operation of large-scale networked computer systems; in particular, the development of Software-Defined Advanced Networked and Distributed Systems (SANDS).His research spans a number of areas in computer systems, including distributed systems, large-scale/cloud computing and computer networking with emphasis on programmable networks.Canini’s current work focuses on improving networked systems design, implementation and operation along several vital properties such as reliability, performance, security and energy efficiency. artificial intelligence distributed systems large-scale computing cloud computing programmable networks Education Profile Postdoctoral Researcher, EPFL, 2009-2012Ph.D., University of Genoa, 2009M.Sc. and B.Sc., University of Genoa, 2005 Publications Gupta, A. and MacDavid, R.and Birkner, R. and Canini, M. and Feamster, N. and Rexford, J. and Vanbever, L., 2016, An Industrial-Scale Software Defined Internet Exchange Point, Proceedings of 13th USENIX Symposium on Networked Systems Design and Implementation (NSDI '16), Community Award.Suresh, L. and Canini, M. and Schmid, S. and Feldmann, A., 2015, C3: Cutting Tail Latency in Cloud Data Stores via Adaptive Replica Selection, Proceedings of 12th USENIX Symposium on Networked Systems Design and Implementation (NSDI '15).Canini, M. and Venzano, D. and Perešíni, P. and Kostić, D. and Rexford, J., 2012, A NICE Way to Test OpenFlow Applications, Proceedings of 9th USENIX Symposium on Networked Systems Design and Implementation (NSDI '12).Goma, E. and Canini, M. and Lopez Toledo, A. and Laoutaris, N. and Kostić, D. and Rodriguez, P. and Stanojević, R. and Yagüe Valentín, P., 2011, Insomnia in the Access or How to Curb Access Network Related Energy Consumption, Proceedings of ACM SIGCOMM '11.Li, W. and Canini, M. and Moore, A. W. and Bolla, R., 2009, Efficient application identification and the temporal and spatial stability of classification schema, Computer Networks, 53(6), 790–809, doi:10.1016/j.comnet.2008.11.016. Show more Research Areas Computer Science Extreme Computing Multimedia - ORCID - KAUST Repository - KAUST Academic Portal",
  "content_length": 3369,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:33"
}