{
  "name": "Marcus A. Magnor",
  "homepage": "https://graphics.tu-bs.de/people/magnor",
  "status": "success",
  "content": "Prof. Dr.-Ing. Marcus Magnor - Computer Graphics Lab - TU BraunschweigProf. Dr.-Ing. Marcus MagnorDirector, ChairContactRoom G28 Institut für Computergraphik Mühlenpfordtstraße 23 38106 Braunschweig+49 531 391 2102 +49 531 391 2103magnor@cg.cs.tu-bs.deProfessor of Computer Science  TU BraunschweigAdjunct Professor  Physics and Astronomy Dept.  University of New Mexico, USA  homepage @ UNMPublications before 2006 Office hoursplease contact me to make an appointment About Marcus Magnor heads the Computer Graphics Lab of the Computer Science Department at Technische Universität Braunschweig (TU Braunschweig).He received his BA (1995) and MS (1997) in physics from Würzburg University and the University of New Mexico, respectively, and his PhD (2000) in electrical engineering from Erlangen University. For his post-graduate studies, he joined the Computer Graphics Lab at Stanford University. In 2002, he established the Independent Research Group Graphics-Optics-Vision at the Max-Planck-Institut Informatik in Saarbrücken. He completed his habilitation in 2005 and received the venia legendi for computer science from Saarland University. In addition to his full professorship at TU Braunschweig, he holds an appointment as adjunct professor at the Department of Physics and Astronomy of the University of New Mexico, USA. He is alumnus of the Alexander von Humboldt Foundation, a former Fulbright scholar, elected member of the Braunschweigische Wissenschaftliche Gesellschaft,  and laureate of the Wissenschaftspreis Niedersachsen.His research interests concern visual computing, i.e. visual information processing from image formation, acquisition, and analysis to image synthesis, display, perception, and cognition. Areas of research include, but are not limited to, computer graphics, vision, visual perception, image processing, computational photography, astrophysics, imaging, optics, visual analytics, and visualization (research). Popular science talks (selection)Über Künstliche Intelligenz und Natürliche DummheitAkademie im Schloss, Braunschweig, April 23, 2025Wie die Bilder lügen lernten - Moderne Möglichkeiten der digitalen Bild- und VideomanipulationBraunschweigische Wissenschaftliche Gesellschaft, December 16, 2022Computer-BilderKunstverein Braunschweig, January 22, 2019Das Weltall in Farbe und 3DPlanetarium Wolfsburg, February 21, 2018BIldbasiertes Messen und Modellieren der realen WeltPhysikalisch-Technische Bundesanstalt, Braunschweig, June 20, 2017Bild-AspekteBraunschweigische Wissenschaftliche Gesellschaft, June 15, 2015Wie wir räumlich wahrnehmen, oder: warum auch Piraten Auto fahren könnenAkademie im Schloss, Braunschweig, November 13, 2013Bild - WahrnehmungKunstgeschichtliches Seminar und Sammlung, Universität Göttingen, April 5, 20133D-Kino – die virtuelle Welt ist nicht genug24. Internationales filmfest Braunschweig, November 11, 2010 Conference, workshop, course & tutorial organization (selection)M. Magnor, M. Eisemann, S. Castillo,Conference \"Vision, Modeling, and Visualization (VMV) 2023,\"Braunschweig, Germany, September 27-29, 2023.M. Magnor, M. Eisemann, S. Castillo,Seminar \"New Perspectives in Visual Computing\" - cancelled due to Covid-19Dagstuhl, Germany November 1-4, 2020.M. Magnor, A. Sorkine-Hornung,Seminar \"Real VR - Importing the Real World into Immersive VR and Optimizing the Perceptual Experience of Head-Mounted Displays,\"Dagstuhl, Germany June 30- July 3, 2019.M. Magnor,Symposium on Visual Computing and Perception (SVCP) 2017Braunschweig, Germany, June 7-8, 2017.M. Magnor, O. Grau, O. Sorkine-Hornung, C. Theobalt,Seminar \"Real-World Visual Computing,\"Dagstuhl, Germany, October 20-25, 2013.M. Magnor, D. Cremers, W. Matusik, L. Zelnik-Manor,Seminar \"Computational Video,\"Dagstuhl, Germany, October 10-15, 2010.M. Magnor,Workshop \"Visual Computing,\" Braunschweig, Germany, June 10-11, 2010.A. Bartoli, M. Magnor,Conference \"3D Processing, Visualization and Transmission (3DPVT) 2010,\"Paris, France, May 17-20, 2010.A. Wilkie, M. Magnor, A. Chalmers,Course \"Predictive Rendering,\"ACM Siggraph Conference in Asia (SIGGRAPH ASIA'09), Yokohama, Japan, December 18, 2009.M. Magnor, B. Rosenhahn, H. Theisel,Conference \"Vision, Modeling, and Visualization (VMV) 2009,\"Braunschweig, Germany, November 16-18, 2009.M. Magnor, M. Teschner, H. Theisel, M. Botsch, M. StammingerWorkshop \"Junge Perspektiven in der Computergraphik,\"Braunlage, Germany, March 2-4, 2009.M. Magnor, B. Wilburn, L. Zitnick,Course \"Beyond One Perspective: Using Video Camera Arrays for Graphics,\"ACM Conference on Computer Graphics (SIGGRAPH'06), Boston, USA, July 30, 2006. Community Service (selection)Conference Co-Chair VMV 2023Technical Papers Committee Member ACM Siggraph 2021Guest Editor IEEE Computer Graphics & ApplicationsSpecial Issue on Real VR (July 2021)EXC PhoenixD Steering Committee Member2019-presentAssociate Editor Computer Graphics Forum, Wiley Pubs.2019-2021L3S Research Center Extended Directorate Board Member2019-presentTechnical Program Co-Chair \"Computational Visual Media Conference (CVM)\"Bath, UK, April 24-26, 2019CS Department Vice Chair2019-2023CS Department Chair2015-2019CS Dean of Student Affairs 2009-2015",
  "content_length": 5187,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:59"
}