{
  "name": "Marco Valtorta",
  "homepage": "http://www.cse.sc.edu/~mgv",
  "status": "success",
  "content": "Dr. Marco Valtorta I am a Professor at the Department of Computer Science and Engineering of the University of South Carolina. Here is my Curriculum Vitae in pdf (updated 2024-08-30). an NSF-style biosketch in MS-Word format, and a narrative biography in pdf. Here are my ResearchGate profile and my Google Scholar profile. Storey Innovation Center Department of Computer Science and Engineering 550 Assembly Street University of South Carolina Columbia, SC 29208 mgv@cse.sc.edu Phone: +1 (803) 777-4641; Fax: +1 (803) 777-3767; Office: 2269 Education Laurea: Electrical Engineering, Politecnico di Milano, 1980 MA: Computer Science, Duke University, 1983 PhD: Computer Science, Duke University, 1987 Research Projects, Selected Publications, Technical Reports, Talks Orientation from Fall 2021, recorded by Dr. Jijun Tang A Listing of Resources for Graduate Students (Fall 2025) Fall 2025 Courses CSCE 330 (Programming Language Structures) CSCE 390 (Professional Issues in Computer Science and Engineering Spring 2025 Courses CSCE 531 (Compiler Construction) CSCE 582 (= STAT 582) (Bayesian Networks and Decision Graphs) Fall 2024 Courses CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 330 (Programming Language Structures) Spring 2024 Courses CSCE 531 (Compiler Construction) CSCE 582 (= STAT 582) (Bayesian Networks and Decision Graphs) Fall 2023 Courses CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 330 (Programming Language Structures) Spring 2023 Courses CSCE 531 (Compiler Construction) CSCE 582 (= STAT 582) (Bayesian Networks and Decision Graphs) Fall 2022 Courses CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 330 (Programming Language Structures) Spring 2022 Courses CSCE 531 (Compiler Construction) CSCE 582 (Bayesian Networks and Decision Graphs) Fall 2021 Courses CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 590 (Topics in Information Technology: Functional Programming) Spring 2021 Courses CSCE 531 (Compiler Construction) CSCE 582 (Bayesian Networks and Decision Graphs) Fall 2020 Courses CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 590 (Topics in Information Technology: Functional Programming) Spring 2020 Courses CSCE 531 (Compiler Construction) CSCE 582 (Bayesian Networks and Decision Graphs) Fall 2019 Courses CSCE 190 (Computing in the Modern World) CSCE 390 (Professional Issues in Computer Science and Engineering) Spring 2019 Courses CSCE 790 Section 1 (Advanced Topics in Probabilistic Graphical Models) Fall 2018 Courses CSCE 190 (Computing in the Modern World) CSCE 390 (Professional Issues in Computer Science and Engineering) Spring 2018 Courses CSCE 317 (Computer Systems Engineering) Fall 2017 Courses CSCE 190 (Computing in the Modern World) CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 330 (Programming Language Structures) Spring 2017 Courses CSCE 580 (Artificial Intelligence) CSCE 317 (Computer Systems Engineering) Fall 2016 Courses CSCE 190 (Computing in the Modern World) CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 330 (Programming Language Structures) Summer 2016 Courses CSCE 390 (Professional Issues in Computer Science and Engineering) Spring 2016 Courses CSCE 582 (Bayesian Networks and Decision Graphs) CSCE 317 (Computer Systems Engineering) Fall 2015 Courses CSCE 190 (Computing in the Modern World) CSCE 330 (Programming Language Structures) CSCE 390 (Professional Issues in Computer Science and Engineering) Spring 2015 Courses CSCE 580 (Artificial Intelligence) CSCE 317 (Computer Systems Engineering) Fall 2014 Courses CSCE 190 (Computing in the Modern World) CSCE 330 (Programming Language Structures) CSCE 390 (Professional Issues in Computer Science and Engineering) Spring 2014 Courses CSCE 580 (Artificial Intelligence) CSCE 582 (Bayesian Networks and Decision Graphs): pdf flyer CSCE 582 (Bayesian Networks and Decision Graphs) Fall 2013 Courses CSCE 330 (Programming Language Structures) CSCE 390 (Professional Issues in Computer Science and Engineering) Spring 2013 Courses CSCE 531 (Compiler Construction) CSCE 781 (Knowledge Systems) Fall 2012 Courses CSCE 330 (Programming Language Structures) CSCE 580 (Artificial Intelligence) Spring 2012 Courses CSCE 190 (Computing in the Modern World) CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 582 (Bayesian Networks and Decision Graphs): pdf flyer CSCE 582 (Bayesian Networks and Decision Graphs) Fall 2011 Courses CSCE 330 (Programming Language Structures) CSCE 580 (Artificial Intelligence) Spring 2011 Courses CSCE 190 (Computing in the Modern World) CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 781 (Knowledge Systems) Fall 2010 Courses CSCE 582 (Bayesian Networks and Decision Graphs): pdf flyer CSCE 582 (Bayesian Networks and Decision Graphs) CSCE 330 (Programming Language Structures) Spring 2010 Courses CSCE 190 (Computing in the Modern World) CSCE 390 (Professional Issues in Computer Science and Engineering) CSCE 531 (Compiler Construction) Fall 2009 Courses CSCE 580 (Artificial Intelligence) CSCE 330 (Programming Language Structures) Spring 2009 Courses CSCE 211 (Digital Logic Design) CSCE 582 (Bayesian Networks and Decision Graphs) CSCE 582 (Bayesian Networks and Decision Graphs): MS-Word flyer CSCE 582 (Bayesian Networks and Decision Graphs): announcement Fall 2008 Courses CSCE 580 (Artificial Intelligence) Spring 2008 Courses CSCE 531 (Compiler Construction) Spring 2008 Bayesian Networks Reading Club Bayesian Network Reading Club Information Fall 2007 Courses CSCE 330 (Programming Language Structures) Spring 2007 Courses CSCE 531 (Compiler Construction) Fall 2006 Courses CSCE 330 (Programming Language Structures) Fall 2006 Seminar on the integration of logical and probabilistic reasoning Seminar Information Spring 2006 Courses CSCE 330 (Programming Language Structures) CSCE 582 (Bayesian Networks and Decision Graphs) Fall 2005 Courses CSCE 330 (Programming Language Structures) Spring 2005 Courses CSCE 330 (Programming Language Structures) CSCE 350 (Data Structures and Algorithms) Fall 2004 Bayesian Networks Reading Club Bayesian Network Reading Club Information Fall 2004 Courses CSCE 330 (Programming Language Structures) Spring 2004 Courses CSCE 330 (Programming Language Structures) CSCE 350 (Data Structures and Algorithms) Fall 2003 Courses CSCE 330 (Programming Language Structures) CSCE 582 (Bayesian Networks and Decision Graphs) Spring 2003 Courses CSCE 330 (Programming Language Structures) CSCE 580 (Artificial Intelligence) Fall 2002 Courses CSCE 330 (Programming Language Structures) CSCE 582 (Bayesian Networks and Decision Graphs) Spring 2002 Courses CSCE 580 (Artificial Intelligence) CSCE 531 (Compiler Construction) Fall 2001 Courses CSCE 531 (Compiler Construction) (Link to Spring 2002 edition!) Spring 2001 Courses CSCE 146 (Introduction to Algorithmic Programming II) CSCE 768 (Pattern Recognition and Classification) Fall 2000 Courses CSCE 330 (Programming Language Structures) (E-mail if interested in course materials.) CSCE 330 (Programming Language Structures) CSCE 590 (Foundations of Bayesian Networks) Fall 1999 and Spring 2000 During the Academic Year 1999-2000, I was on sabbatical. I spent October 1999, March 2000, and parts of May and June 2000 at the Department of Computer Science at the University of Aalborg, as a guest of the Decision Support Systems Unit. Notes on three lectures on data mining Spring 1999 Courses CSCI 330 (Programming Language Structures) (E-mail if interested in course materials.) Fall 1998 Courses CSCI 220 (Data Structures and Algorithms) CSCI 509 (Foundations of Bayesian Networks) Spring 1998 Courses CSCI 786 (Knowledge-Based Systems) Fall 1997 Courses CSCI 146 (Introduction to Algorithmic Design II) Spring 1997 Courses CSCI 330 (Programming Language Structures) Research Interests: Probabilistic Graphical Models (esp. Bayesian Networks) Decision Support Systems Artificial Intelligence Knowledge-based systems Heuristics Computational complexity Honors Lilly Teaching Fellow, Academic Year 1993-94 Advisor of the Year, College of Science and Mathematics, University of South Carolina, 1997 Current Research Projects Hypergraph-Based Causal Modeling Agency: Office of Naval Research (ONR). Award Amoint: $100,000. Period: September 1, 2017 to August 31, 2018 Role: co-PI (with PI Linyuan Lu, Mathematics Department). Co-Arg: Causal Argumentation System with Crowd Elicitation Agency: Intelligence Advanced Research Project Agency (IARPA); subaward through George Mason University (GMU). Award Amount: $342,331 (subaward only). Period: January 2017 to June 2021. Role: PI of the subward; Prime (GMU) PI: Gheorghe Tecuci. Recent Research Projects Integrating and extending techniques for identification of latent variables in graphical models Elisabeth S. Allman and John A. Rhodes (Dept. of Mathematics, U. Alaska, Fairbanks), Elena Stanghellini (Dept. of Statistics, U. Perugia), and Marco Valtorta. Sponsored by AIM (American Institute of Mathematics) as a SQuaRE (Structured Quartet Research Ensemble) Awarded on December 6, 2010; ended in 2014. Latent (unobservable) variables are common in statistical modeling, often representing an unknown or unmeasurable cause that affects several observable variables. If one makes no assumptions about its nature, however, even a single latent variable in a model may lead to a complete non-identifiability of the model parameters. This means that essentially nothing can be inferred quantitatively about relationships between pairs of variables. However, recent independent works of Stanghellini-Vantaggi and Allman-Matias-Rhodes have shown that for some graphical models even a seemingly mild assumption that the hidden variable be discrete, with a bounded number of states, ensures identifiability. In an extreme case, causal relationships between two observed variables may be unidentifiable wi",
  "content_length": 38746,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:50"
}