{
  "name": "Marc Stevens 0001",
  "homepage": "https://marc-stevens.nl",
  "status": "success",
  "content": "Marc Stevens - Research dr.ir. Marc Stevens Email: marc (a) marc-stevens.nl Curriculum Vitae Position: Tenured Researcher in the Cryptology Group at Centrum Wiskunde & Informatica (Dutch national research institute for Mathematics & Computer Science) Other functions: Board Member DIAMANT (dutch national cluster in discrete mathematics) News Students Publications Honors Software News Received the Frontiers of Science Award for our paper The First Collision for Full SHA-1 published at CRYPTO 2017. The prize, which includes a certificate, trophy and a monetary award of $ 25,000, honours outstanding recent research in the fundamental sciences. The award was presented during the International Congress of Basic Science (ICBS), held in Beijing, China. Each year, an international panel of leading experts selects a number of scientific publications across mathematics, physics, and chemistry for their originality and impact. The work has been previously been awarded the CRYPTO 2017 Best Paper Award and the 2017 Pwnie Award for Best Cryptographic Attack. Co-authored the revised and extended 2nd edition of the PQC Migration Handbook by AIVD, CWI and TNO. Zsolt Szabo, State Secretary for Kingdom Relations and Digitalization, was presented with the first copy during our PQC Symposium Episode VII in The Hague on the migration to post-quantum cryptography. December 3rd, 2024. News links: AIVD, CWI, TNO. Parlement & Wetenschap Minisymposium: \"Klaar voor kwantum? De gevolgen van kwantumtechnologie voor de veiligheid\". In this minisymposium, members of Parliament interact with scientists on the impact of quantum computers on the security of our information systems and what needs to happen now to be prepared for these developments. May 10, 2023. Awarded the RealWorldCrypto'20 Levchin Prize \"for groundbreaking work on the security of collision resistant hash functions\" jointly with Xiaoyun Wang. The Levchin prize honors major innovations in cryptography that have had a significant impact on the practice of cryptography and its use in real-world systems. Two awards are given every year, and each carries a cash prize of $10,000. Students Stijn Maatje (MSc, 2024) Michael Yonli (PhD, 2023-) Aron van Baarsen (PhD, 2020-2024) Kevin Witlox (MSc, 2022) Esteban Landerreche (PhD, 2017-2020) Rusydi Makarim (PhD, 2014-2019) Esteban Landerreche (MSc, 2017) Huaifeng Chen (visiting PhD, 2015) Fatemeh Sefi Shahpar (visiting PhD, 2015) Maximilian Fillenger (MSc, 2013) Publications (DBLP) (Google Scholar) Show ALL publications Selection of publications For all publications, click the button. The PQC Migration Handbook -- Revised and Extended 2nd Edition, Alessandro Amadori, Thomas Attema, Maxime Bombar, João Diogo Duarte, Vincent Dunning, Simona Etinski, Daniël van Gent, Matthieu Lequesne, Ward van der Schoot, Marc Stevens and AIVD Cryptologists & Advisors. Digital Book. December 2024. (PDF EN), (PDF NL). RADIUS/UDP Considered Harmful, Sharon Goldberg, Miro Haller, Nadia Heninger, Mike Milano, Dan Shumow, Marc Stevens, Adam Suhl, USENIX Security, 2024. (PDF). Simplified MITM Modeling for Permutations: New (Quantum) Attacks, André Schrottenloher, Marc Stevens, CRYPTO, 2022. (PDF). On Time-Lock Cryptographic Assumptions in Abelian Hidden-Order Groups, Aron van Baarsen, Marc Stevens, ASIACRYPT, 2021. (PDF). Advanced Lattice Sieving on GPUs, with Tensor Cores, Léo Ducas, Marc Stevens, Wessel van Woerden, EUROCRYPT, 2021. (PDF). The General Sieve Kernel and New Records in Lattice Reduction, Martin R. Albrecht, Léo Ducas, Gottfried Herold, Elena Kirshanova, Eamonn W. Postlethwaite, Marc Stevens, EUROCRYPT 2019. (PDF). The first collision for full SHA-1, Marc Stevens, Elie Bursztein, Pierre Karpman, Ange Albertini, Yarik Markov, CRYPTO 2017. (PDF). (Website). (– Winner of CRYPTO 2017 Best Paper Award. –) (– Winner of BlackHat USA 2017 Pwnie Award for Best Cryptographic Attack. –) Speeding up detection of SHA-1 collision attacks using unavoidable attack conditions, Marc Stevens, Dan Shumow, USENIX Security 2017. (PDF). (– Integrated among others into Git, GitHub, ... to protect against SHA-1 attacks. Effectively used by millions of software developers worldwide. –) Reverse-engineering of the cryptanalytic attack used in the Flame super-malware, Max Fillinger, and Marc Stevens, ASIACRYPT 2015, Lecture Notes in Computer Science, vol. 9453, Springer, 2015, pp. 586-611, (PDF). Counter-cryptanalysis, Marc Stevens, CRYPTO 2013, Lecture Notes in Computer Science, vol. 8042, Springer, 2013, pp. 129-146, (PDF). (– Winner of the CRYPTO 2013 Best Young Researcher Paper Award. –) Short chosen-prefix collisions for MD5 and the creation of a rogue CA certificate, Marc Stevens, Alexander Sotirov, Jacob Appelbaum, Arjen Lenstra, David Molnar, Dag Arne Osvik, Benne de Weger, CRYPTO 2009, Lecture Notes in Computer Science, vol. 5677, Springer, 2009, pp. 55-69, (PDF). (– Winner of the CRYPTO 2009 Best Paper Award. –) All publications The PQC Migration Handbook -- Revised and Extended 2nd Edition, Alessandro Amadori, Thomas Attema, Maxime Bombar, João Diogo Duarte, Vincent Dunning, Simona Etinski, Daniël van Gent, Matthieu Lequesne, Ward van der Schoot, Marc Stevens and AIVD Cryptologists & Advisors. Digital Book. December 2024. (PDF EN), (PDF NL). Quantum Procedures for Nested Search Problems, André Schrottenloher, Marc Stevens, IACR Communications in Cryptology, vol. 1, no. 3, Oct 07, 2024. (PDF). Amortizing Circuit-PSI in the Multiple Sender/Receiver Setting, Aron van Baarsen, Marc Stevens, IACR Communications in Cryptology, vol. 1, no. 3, Oct 07, 2024. (PDF). RADIUS/UDP Considered Harmful, Sharon Goldberg, Miro Haller, Nadia Heninger, Mike Milano, Dan Shumow, Marc Stevens, Adam Suhl, USENIX Security, 2024. (PDF). Cryptanalysis of SHA-1, Marc Stevens, book chapter of Symmetric Cryptography, Volume 2: Cryptanalysis and Future Directions (eds. Christina Boura, Maria Naya-Plasencia), Wiley and ISTE, November 2023. (link). Simplified Modeling of MITM Attacks for Block Ciphers: new (Quantum) Attacks, André Schrottenloher, Marc Stevens, IACR Transactions on Symmetric Cryptology, 2023. (PDF). The PQC Migration Handbook, Thomas Attema, João Diogo Duarte, Vincent Dunning, Matthieu Lequesne, Ward van der Schoot, Marc Stevens and AIVD Cryptologists & Security Advisors. Digital book. April 2023. (PDF). Simplified MITM Modeling for Permutations: New (Quantum) Attacks, André Schrottenloher, Marc Stevens, CRYPTO, 2022. (PDF). On Time-Lock Cryptographic Assumptions in Abelian Hidden-Order Groups, Aron van Baarsen, Marc Stevens, ASIACRYPT, 2021. (PDF). A Survey of Chosen-Prefix Collision Attacks, Marc Stevens, book chapter of Computational Cryptography (eds. Joppe W. Bos, Martijn Stam), Cambridge University Press, 2021. (PDF). Advanced Lattice Sieving on GPUs, with Tensor Cores, Léo Ducas, Marc Stevens, Wessel van Woerden, EUROCRYPT, 2021. (PDF). Lattice Enumeration on GPUs for fplll, Simon Pohmann, Marc Stevens, Jens Zumbragel, ePrint 2021/430. (PDF). Non-interactive Cryptographic Timestamping based on Verifiable Delay Functions, Esteban Landerreche, Christian Schaffner, Marc Stevens, Financial Crypto, 2020. (PDF). The General Sieve Kernel and New Records in Lattice Reduction, Martin R. Albrecht, Léo Ducas, Gottfried Herold, Elena Kirshanova, Eamonn W. Postlethwaite, Marc Stevens, EUROCRYPT 2019. (PDF). On Immutability of Blockchains, Esteban Landerreche, Marc Stevens, ERCIM Blockchain Workshop, 8-9 May 2018, Amsterdam. (PDF). The first collision for full SHA-1, Marc Stevens, Elie Bursztein, Pierre Karpman, Ange Albertini, Yarik Markov, CRYPTO 2017. (PDF). (Website). (– Winner of CRYPTO 2017 Best Paper Award. –) (– Winner of BlackHat USA 2017 Pwnie Award for Best Cryptographic Attack. –) M4GB: An eficient Groebner-basis algorithm, Rusydi M. Makarim, Marc Stevens, ISSAC 2017. (PDF). Speeding up detection of SHA-1 collision attacks using unavoidable attack conditions, Marc Stevens, Dan Shumow, USENIX Security 2017. (PDF). (– Integrated among others into Git, GitHub, ... to protect against SHA-1 attacks. Effectively used by millions of software developers worldwide. –) Refined Probability of Differential Characteristics Including Dependency between Multiple Rounds, Anne Canteaut, Eran Lambooij, Samuel Neves, Shahram Rasoolzadeh, Yu Sasaki, Marc Stevens, FSE 2018 / ToSC 2017. (PDF). Improved Attack on Full-round Grain-128, Ximing Fu, Xiaoyun Wang, Jiazhe Chen, Marc Stevens, Xiaoyang Dong, ePrint 2017/412. (PDF). New Second Preimage Attacks on Dithered Hash Functions with Low Memory Complexity, Muhammad Barham, Orr Dunkelman, Stefan Lucks and Marc Stevens, SAC 2016, Lecture Notes in Computer Science, Springer, 2016. (PDF). Freestart collision for full SHA-1, Marc Stevens, Pierre Karpman, Thomas Peyrin, EUROCRYPT 2016, Lecture Notes in Computer Science, vol. 9665, Springer, 2016, pp. 459-483, (PDF). Reverse-engineering of the cryptanalytic attack used in the Flame super-malware, Max Fillinger, and Marc Stevens, ASIACRYPT 2015, Lecture Notes in Computer Science, vol. 9453, Springer, 2015, pp. 586-611, (PDF). Practical free-start collision attacks on 76-step SHA-1, Pierre Karpman, Thomas Peyrin, and Marc Stevens, CRYPTO 2015, Lecture Notes in Computer Science, vol. 9215, Springer, 2015, pp. 623-642, (PDF). Counter-cryptanalysis, Marc Stevens, CRYPTO 2013, Lecture Notes in Computer Science, vol. 8042, Springer, 2013, pp. 129-146, (PDF). (– Winner of the CRYPTO 2013 Best Young Researcher Paper Award. –) New collision attacks on SHA-1 based on optimal joint local-collision analysis, Marc Stevens, EUROCRYPT 2013, Lecture Notes in Computer Science, vol. 7881, Springer, 2013, pp. 245-261, (PDF). Attacks on hash functions and applications, Marc Stevens, PhD thesis, (PDF). Defended on June 19, 2012. Stellingen (Propositions): (PDF). (– Awarded the 2013 \"Martinus van Marum\" prize by the J.C. Ruigrok Foundation and the Royal Holland Society of Sciences. –) Single-block collision attack on MD5, Marc Steven",
  "content_length": 15115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:09"
}