{
  "name": "Marcus V. dos Santos",
  "homepage": "https://www.torontomu.ca/msantos",
  "status": "success",
  "content": "Dr. Marcus Santos - Toronto Metropolitan University (TMU) Skip to Main Content Marcus Santos You are now in the main content area Dr. Marcus Santos – Executive Academic Director, Cyber Studies and Rogers Cybersecure Catalyst Welcome. I’m Marcus Santos, and it’s been my honour to serve the Toronto Met community since 1999 – first as Professor and now as Executive Academic Director, Cyber Studies and Rogers Cybersecure Catalyst. In my dual role, I’m committed to ensuring high-quality cybersecurity education, training, and research through integrated academic programming and collaboration between the RCC and the University. Contribute to society. Be a better person. The best education accomplishes both. As we move through the 21st century, education faces challenges of ever greater complexity. How can students succeed in an increasingly competitive environment? Do curriculums meet the demands of changing global realities? These are just a few of the challenges I navigate as an academic leader and educator. My overarching goal: make education truly useful to students lives both as citizens and members of the workforce. A foot in Computing. A heart in Science. My career started in Computer Engineering. Later on, I learned about the scientific method. Now, my fascination is the real science behind Computer Science, with interest centred on: Evolutionary computation Genetic programming Knowledge representation Automatic reasoning “What we have to learn to do, we learn by doing.” I believe that education needs to recalibrate its focus on the fundamentals. I champion learning that’s practical, absorbing and fun — never boring. With Toronto Met’s Experiential Learning, my Office continues to search out new ways for students to integrate learning and doing. As leaders, we need a good pulse on the student population I often mentor students. It brings tremendous satisfaction and is one way I keep in tune with the student body. I want each student to be fully engaged in their program. To that end, I am always supportive of initiatives that enrich student affairs and university life.",
  "content_length": 2105,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:07"
}