{
  "name": "Marc Pouzet",
  "homepage": "https://www.di.ens.fr/~pouzet",
  "status": "success",
  "content": "index Marc Pouzet Professor at École normale supérieure in the Computer Science department (DIENS). Director of CS studies. Junior member at Institut Universitaire de France (Sept. 2007 – Sept. 2012). Leader of the project-team PARKAS from INRIA Paris. Address: Département d’informatique, École normale supérieure, 45 rue d’Ulm, 75 230 Paris cedex 05. Office: S14, DI, Aile Rataud, passage saumon. Phone: (+33) (0) 1 44 32 21 66 Fax: (+33) (0) 1 44 32 20 75 Mail: Public key Research My research is about the design, semantics and implementation of languages that ensure strong safety properties to model, simulate and implement critical control software (e.g., fly-by-wire, engine and braking systems in planes). I have particular interest for synchronous languages, their extensions and embedding into general-purpose functional languages. With Paul Caspi and Grégoire Hamon, I developed the language Lucid Synchrone, an extension a la ML of Lustre. Several language features and compilation techniques have been integrated to the language Scade 6 developed by ANSYS. In collaboration with INRIA (Alchemy) and NXP, I worked on the N-synchronous model to program real-time video systems (e.g., TV boxes). Currently, my research is about the semantics and implementation of hybrid systems modelers (e.g., Simulink, Modelica), the design and implementation of Zelus, a synchronous language that mixes discrete and continuous time, Velus, a formally verified compiler for Lustre with Coq. Since 2019, I am involved in ProbZelus, a reactive probabilistic language built on top of Zelus. See publications and talks.Keywords: Real-time Embedded Systems; Kahn Process Networks; Synchronous and Functional Programming; Type Systems, Semantics, CompilationIn Nov. 2016, I received the Inria – French Académie des sciences – Dassault Systèmes Innovation Award. Recent Projects and Program committeePC-member of EMSOFT 2020, EMSOFT 2019, EMSOFT 2018, PPDP 2018, DAC 2015, EOOLT 2014, DAC 2014, AFADL 2014, DATE 2013, RTNS 2013, MSR 2013, EMSOFT 2012, RTNS 2012, CSDM 2012, PADL 2012, DATE 2012 (topic E3), AFADL 2012, MSR 2011, RTNS 2011, DATE 2011. External reviewer for DAC 2013, DAC 2012 and DAC 2011. 18th annual workshop SYNCHRON’2011 on synchronous programming and its applications. Action d’envergure INRIA Synchronics (2008 – 2012) EURASIP Journal on Embedded Systems (Associate editor), Hermes (Directeur de collection) ImplementationsZélus, a synchronous language with ODEs (Version 2.1 of May 2020 is on GitHub) ReactiveML, a Reactive extension of Objective Caml January 2015: “Most influential PPDP’05 paper \"ReactiveML: a reactive extension to ML\" Lucid Synchrone, an ML extension of LUSTRE (April 2006: Version 3) PhD studentsCharles de Haro (with Xavier Rival; start Sept. 2024); Grégoire Bussone (start April. 2023); Paul Jeanmaire (with Timothy Bourke; start Sept. 2020); Baptiste Pauget (with Jean-Louis Colaço; end Dec. 2023; now ANSYS); Basile Pesin (with Timothy Bourke; end Oct. 2023; now VERIMAG); Ismail Lahkim Bennani (with Goran Freshe; end May 2021); Lélio Brun (with Timothy Bourke, end July 2020; now NII, Japan); Ulysse Beaugnon (with Albert Cohen, end June 2019; now Google Paris); Guillaume Baudart (with Timothy Bourke, end March 2017, now researcher at IBM Watson); Adrien Guatto (with Albert Cohen and Louis Mandel, end Jan. 2016, now Assistant Professor at Université de Paris);Cédric Pasteur (end Nov. 2013, now ANSYS, Toulouse); Léonard Gérard (end Sept. 2013, now SRI International); Cédric Auger (end January 2013, now Prove&Run); Florence Plateau (with Louis Mandel, end January 2010, now Prove&Run); Gwenael Delaval (with Alain Girault, end June 2008, assistant professor Univ. Grenoble); Sébastien Labbé (with Jean-Pierre Galois, end Sept. 2007, now EDF R&D); Louis Mandel (end May 2006, assistant professor Univ. Paris-Sud; now researcher at IBM Watson); Grégoire Hamon (end Nov. 2002, now 3Red Trading, Chicago); Pascal Cuoq (end Oct. 2002, now at Trust in Soft). Cours (en français)Master ATIAM — IRCAM, 26 oct. 2011. Parallélisme synchrone et ReactiveML. Cours Systèmes et Réseaux, L3 de l’ENS, Printemps 2015 (avec Timothy Bourke). Cours Systèmes Synchrones au MPRI (avec Louis Mandel et Jean Vuillemin). Master Ingénierie des systèmes industriels complexes (ISIC) (École Polytechnique, INSTN, Paris-Sud 11) This document was translated from LATEX by HEVEA.",
  "content_length": 4396,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:06"
}