{
  "name": "Marco Antonio Casanova",
  "homepage": "http://www.inf.puc-rio.br/~casanova",
  "status": "success",
  "content": "Web page of Prof. Marco A. Casanova Marco A. Casanova Department of Informatics Pontifical Catholic University of Rio de Janeiro – PUC-Rio Short Bio Marco A. Casanova is Full Professor at the Department of Informatics of the Pontifical Catholic University of Rio de Janeiro – PUC-Rio. He graduated in Electronic Engineering at the Military Institute of Engineering (1974), obtained an M.Sc. in Informatics from PUC-Rio (1976), and an M.Sc. (1977) and a Ph.D. (1979) in Applied Mathematics from Harvard University. He was Graduate Program Coordinator (2005-2007) and Director (2007-2011) of the Department of Informatics, and Coordinator of the Central Planning and Evaluation Office (2012-2025) of PUC-Rio. His research interests concentrate on database conceptual modeling, construction of database management systems, and applications of Large Language Models. In July 2012, he received the Scientific Merit Award from the Brazilian Computer Society. Uniform Resource Identifiers Currículo Lattes: http://lattes.cnpq.br/0400232298849115 Google Knowledge Graph: https://g.co/kgs/8FEXUu Google Scholar Public URL: http://scholar.google.com.br/citations?user=zWh25xcAAAAJ DBLP search: http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/c/Casanova:Marco_A=.html International Standard Name Identifier (ISO 27729): http://isni.org/isni/0000000117488848 Open Researcher & Contributor ID (ORCID): http://orcid.org/0000-0003-0765-9636 Scopus Author Identifier: http://www.scopus.com/authid/detail.url?authorId=7102125708 Thomson Reuters ResearcherID: http://www.researcherid.com/rid/M-9054-2014 AuthorClaim: http://authorclaim.org/profile/pca1/ Publications 2025 Journal Articles 411.  Avila, C.V., Vidal, V.M.P., Franco, W., Casanova, M.A. (2025). An Autonomous Domain-Independent Framework Based on LLMs for Text-to-SPARQL. International Journal of Semantic Computing (IJSC) - Special Issue on Knowledge Engineering and Semantic Computing, Vol. 19, No. 02, pp. 223-246, 2025. ISSN (print) 1793-351X, ISSN (online) 1793-7108. DOI: 10.1142/S1793351X25420048 410.  Nascimento, E.R., García, G.M., Izquierdo, Y.T., Feijó, L., Coelho, G.M.C., Oliveira, A.R., Lemos, M., Garcia, R.S.L., Leme, L.A.P.P., Casanova, M.A. (2025). LLM-based Text-to-SQL for Real-World Databases. Science Nature Computer Science 6:2. Springer-Verlag, Berlin, Heidelberg. Electronic ISSN 2661-8907. DOI: 10.1007/s42979-025-03662-6 Conference Papers 409. Lemos, M., Izquierdo, Y.T., García, G.M., Nascimento, E.R., Silva, M.O., Furtado, P.H.T., Facina, M.S.P., Casanova, MA. (2025). The Quest for an LLM-Based Natural Language Interface for an Industrial Database. Frontiers in Artificial Intelligence and Applications, Volume 413: ECAI 2025, pp. 5232-5239. DOI: 10.3233/FAIA251458 408.  Nascimento, E.R., Feijó, B., Furtado, A.L., Casanova, M.A. (2025). LLM-Powered Visualizations and Narratives from Natural Language Queries. In Proc. 44th International Conference on Conceptual Modeling – Posters&Demos, 20-23 October 2025, Poitiers / Futuroscope, France. 407.  Silva, M. O., Nascimento, E. R. S., Izquierdo, Y. T., Lemos, M. and Casanova, M. A. (2025). Automated Evaluation of Database Conversational Agents. In Proc. 21st International Conference on Web Information Systems and Technologies (WEBIST 2025), pages 277-288. ISBN: 978-989-758-772-6; ISSN: 2184-3252 406.  Campos, J.G., García, G.M., de Sousa, J.A., Corseuil, E.T.L., Izquierdo, Y.T., Lemos, M., Casanova, M. A. (2025). Text-to-SQL experiments with Engineering Data Extracted from CAD Files. Proc. 27th International Conference on Enterprise Information Systems (ICEIS 2025) - Volume 1, SCITEPRESS – Science and Technology Publications, Lda. ISBN: 978-989-758-749-8; ISSN: 2184-4992, pp. 343-350. DOI: 10.5220/0013436800003929 405.  Nascimento, E.R., Avila, C.V., Izquierdo, Y.T., García, G.M., Feijó, L., Facina, M.S.P., Lemos, M., Leme, L.P.P., Casanova, M.A. (2025). On the Text-to-SQL Task Supported by Database Keyword Search. Proc. 27th International Conference on Enterprise Information Systems (ICEIS 2025) - Volume 1, SCITEPRESS – Science and Technology Publications, Lda. ISBN: 978-989-758-749-8; ISSN: 2184-4992, pp. 173-180. DOI: 10.5220/0013126300003929 404.  Avila, C.V., Vidal, V.M.P., Franco, W., Casanova, M.A. (2025). Few-shot learning or RAG in LLM-based text-to-SPARQL? Why not both?. Proc. 19th International Conference on Semantics Computing (Feb. 3-5, 2025), The Hills Hotel, Laguna Hills, California, USA, pp. 76-79. DOI: 10.1109/ICSC64641.2025.00016 Book Chapters 403.  Lima, E.S., Neggers, M., Casanova, M.A., Furtado, A.L. (2025). From Images to Stories: Exploring Player-Driven Narratives in Games. In: Marto, A., et al. Videogame Sciences and Arts. VJ 2024. Communications in Computer and Information Science, vol. 2324. Springer, Cham., Electronic ISSN 1865-0937, Print ISSN 1865-0929, pp. 1–15. DOI: 10.1007/978-3-031-81713-7_16. 402.  Nascimento, E.R., Coelho, G.M.C, Feijó, L., Izquierdo, Y.T., García, G.M., Oliveira, A.R., Pinheiro, J.P., Seabra, A., Furtado, A.L., Leme, L.A.P.P., Lemos, M., Casanova, M.A. (2025). On the Construction of Text-to-SQL Tools Based on Large Language Models for Real-World Relational Databases. In: Marchiori, M., García Peñalvo, F. (eds) Web Information Systems and Technologies. WEBIST 2023. Lecture Notes in Business Information Processing, vol 543. Springer, Cham., pp. 151-167, DOI: 10.1007/978-3-031-89621-7_8 2024 Journal Articles 401.  Lima, E.S., Neggers, M., Feijó, B., Casanova, M.A., Furtado, A.L. (2024). An AI-powered approach to the semiotic reconstruction of narratives. Entertainment Computing, Volume 52, January 2025, pp. 1-26, ISSN 1875-9521. DOI: https://doi.org/10.1016/j.entcom.2024.100810 400.  Fraga, F.P.A., Poggi, M., Casanova, M.A., Leme, L.A.P.P. (2024). Creating Automatic Connections for Personal Knowledge Management. SN Computer Science Vol. 5, article number 525, May 2024, pp. 1-27. DOI: https://doi.org/10.1007/s42979-024-02876-4 Conference Papers 399.  Yang, C., Nunes, B.P., Méndez, S.R., Chen, Y., Manrique, R., Casanova, M.A. (2025). Towards comprehensive artwork representation. Proceedings of the 24th ACM/IEEE Joint Conference on Digital Libraries (Dec. 16-20, 2024), Hong Kong, China. DOI: https://doi.org/10.1145/3677389.3702517 398.  Oliveira, A.R., Nascimento, E.R.S., Coelho, G.M.C., Avila, C.V., Feijó, L., Izquierdo, Y.T., García, G.M., Pinheiro, J.P.V., Leme, L.P.P., Lemos, M., Casanova, M.A. (2024). Small, Medium, and Large Language Models for Text-to-SQL. In: W. Maass et al. (Eds.) Proc. 43rd International Conference on Conceptual Modeling – ER 2024 (Oct. 28-31, 2024), Pittsburgh, Pennsylvania, USA. Lecture Notes in Computer Science, vol. 15238, Springer, Cham, pp. 276-294. DOI: 10.1007/978-3-031-75872-0_15 397.  Izquierdo, Y.T., Lemos, M., Oliveira, C., Novelli, B., García, G.M., Coelho, G.M.C., Feijó, L., Coutinho, B., Santana, T., Garcia, R.L.S., Casanova, M.A. (2024). Busca360: A Search Application in the Context of Top-Side Asset Integrity Management in the Oil & Gas Industry. In: Proc. 39th Brazilian Symposium on Data Bases (Oct. 14-17, 2024), Florianópolis, SC, Brazil, pp. 104-116. 396. Vidal, V.M.P., Freitas, R., Arruda Jr, N., Casanova, M.A., Renso, C. (2024). A Data Design Pattern for Building and Exploring Semantic Views of Enterprise Knowledge Graphs. In: Proc. 39th Brazilian Symposium on Data Bases (Oct. 14-17, 2024), Florianópolis, SC, Brazil, pp. 1-13. 395.  Lima, E.S., Neggers, M., Casanova, M.A., Feijo, B., Furtado, A.L. (2024). A Pattern-oriented AI-powered Approach to Story Composition. In: Figueroa, P., Di Iorio, A., Guzman del Rio, D., Gonzalez Clua, E.W., Cuevas Rodriguez, L. (eds) Entertainment Computing – ICEC 2024, (Sept. 30 - Oct. 03, 2024), Manaus, Brazil. Lecture Notes in Computer Science, vol. 15192, Springer, Cham, pp. 135-150. DOI: 10.1007/978-3-031-74353-5_10 (Best Paper Award). 394.  Coelho, G.M.C., Nascimento, E.R.S., Izquierdo, Y.T., García, G.M., Feijó, L., Lemos, M., Garcia, R.L.S., de Oliveira, A.R., Pinheiro, J.P.V., Casanova, M.A. (2024). Improving the Accuracy of Text-to-SQL Tools Based on Large Language Models for Real-World Relational Databases. In: Strauss, C., Amagasa, T., Manco, G., Kotsis, G., Tjoa, A.M., Khalil, I. (eds) Database and Expert Systems Applications. DEXA 2024. Lecture Notes in Computer Science, vol. 14910, Springer, Cham, pp. 93-107. DOI: 10.1007/978-3-031-68309-1_8 393. Lemos, M., Garcia, G.M., Isquierdo, Y.T., Novelli, B., Damasceno, C., Rezende, B.F.M., de Sousa, J.A., Casanova, M.A. (2024). A Technical/Scientific Document Management Platform. In: Rehm, G., Dietze, S., Schimmler, S., Krüger, F. (eds) Natural Scientific Language Processing and Research Knowledge Graphs. NSLP 2024. Co-located with ESWC 2024 (May 27, 2024), Hersonissos, Crete, Greece. Lecture Notes in Computer Science, vol. 14770, Springer, Cham, pp. 134-146. DOI: 10.1007/978-3-031-65794-8_9 392. Avila, C.V., Casanova, M.A., Vidal, V.M.P. (2024). A Framework for Question Answering on Knowledge Graphs Using Large Language Models. Proc. 2024 Extended Semantic Web Conference - Posters and Demos Papers (May 27, 2024), Hersonissos, Crete, Greece. 391. Nascimento, E.R., Izquierdo, Y.T., García, G.M., Coelho, G., Feijó, L., Lemos, M., Leme, L.P.P., Casanova, M. A.(2024). My Database User Is a Large Language Model.  In Proceedings of the 26th International Conference on Enterprise Information Systems - Volume 1: ICEIS; ISBN 978-989-758-692-7, SciTePress, pp. 800-806. DOI: 10.5220/0012697700003690 390. Nascimento, E.R., García, G.M., Feijó, L., Victorio, W., Izquierdo, Y.T., Oliveira, R.A., Coelho, G., Lemos, M., Garcia, R., Leme, L.P.P., Casanova, M.A. (2024). Text-to-SQL Meets the Real-World. In Proceedings of the 26th International Conference on Enterprise Information Systems - Volume 1: ICEIS; ISBN 978-989-758-692-7, SciTePress, pp. 61-72. DOI: 10.5220/0012555200003690 389. Coelho, G., Celecia, A., de Sousa, J., Lemos, M., Lima, M., Mangeth, A., Frajh",
  "content_length": 119879,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:35"
}