{
  "name": "Marcus Ritt",
  "homepage": "http://inf.ufrgs.br/~mrpritt",
  "status": "success",
  "content": "homepage [Marcus Ritt] saltar para conteúdo Marcus Ritt Ferramentas de Utilizador Iniciar sessão Ferramentas de Site Pesquisar FerramentasMostrar página fonte Revisões antigasBacklinksAlterações RecentesGestor de MediaÍndiceIniciar sessão> Alterações RecentesGestor de MediaÍndice Está em: • homepage Barra Lateral Índice Início Curriculum vitae Ensino INF 5010: Otimização combinatória INF 5016: Algoritmos avançados INF 5023: Técnicas de busca heurística. Pesquisa Publicações Sintaxe desse Wiki homepage Tabela de Conteúdos Marcus Ritt Informações Ensino Pesquisa Publicações recentes Orientações Doutorado Mestrado Graduação Miscelânia Marcus Ritt Endereço: Universidade Federal do Rio Grande do Sul Instituto de Informática Departamento de Informática Teórica Av. Bento Gonçalves, 9500 - Campus do Vale - Bloco IV Bairro Agronomia - Porto Alegre - RS - Brazil CEP 91501-970 Email: mrpritt at inf.ufrgs.br Tel: +55 (51) 3308-6818 English version Informações Sou professor adjunto no Departamento de Informática Teórica desde 2006. Concluí meu doutorado na área de computação paralela na Eberhard-Karls-Universität em Tübingen em 2003. Atualmente, trabalho com algoritmos exatos, aproximados e heurísticos para problemas de otimização combinatória com aplicações em logística, redes elétricas, bioinformática, comparação de sequências, e robótica. Veja o meu currículo Lattes para mais detalhes. Minha página na Universidade de Tübingen contém algumas informações complementares. Ensino Em 2025/2 vou ministrar INF 5010: Otimização combinatória. INF 5023: Técnicas de busca heurística. Semestres passados | Outros Pesquisa Tenho interesse em algorítmos e complexidade, em programação matemática, algoritmos de otimização, algoritmos parameterizados e heurísticas. Trabalhei com clusters e computação paralela (com aplicações na bioinformática) e simulação de sistemas físicos. Alunos interessados em iniciação científica, trabalhos de conclusão, mestrado, etc. na áreas de algoritmos e otimização, por favor entrem em contato. A página do meu grupo tem mais informações. Também mantenho uma página com material complementar para artigos publicados. Publicações recentes Alex Gliesch and Marcus Ritt. A hybrid heuristic for the maximum dispersion problem. Eur. J. Oper. Res., 2020. (doi:10.1016/j.ejor.2020.06.011) Marcus Ritt and Jorge Pereira. Heuristic and exact algorithms for minimum-weight non-spanning arborescences. Eur. J. Oper. Res., 2020. (doi:10.1016/j.ejor.2020.03.073) Wesley Kaizer, André Grahl, and Marcus Ritt. Sequencing operator counts with state-space search. In Proc. 30th Int. Conf. Autom. Plan. Sched., pages 166–174, 2017. Alex Gliesch and Marcus Ritt. A generic approach to districting with diameter or center-based objectives. In Manuel López-Ibáñez, editor, Proc. 21th Conf. Genetic Evol. Comput., pages 249–257, Prague, 2019. ACM Press. (doi:10.1145/3321707.3321874) Alexander Benavides and Marcus Ritt. Fast heuristics for minimizing the makespan in non-permutation flow shops. Comput. Oper. Res., 100:230–243, December 2018. (doi:10.1016/j.cor.2018.07.017) Jordi Pereira, Marcus Ritt, and Oscar C. Vásquez. A memetic algorithm for the cost-oriented robotic assembly line balancing problem. Int. J. Prod. Res., 99:249–261, November 2018. (doi:10.1016/j.cor.2018.07.001) Leonardo Borba, Marcus Ritt, and Cristóbal Miralles. Exact and heuristic methods for solving the robotic assembly line balancing problem. Eur. J. Oper. Res., 270(1):146–156, 2018. (doi:10.1016/j.ejor.2018.03.011) Artur F. Brum and Marcus Ritt. Automatic algorithm configuration for the permutation flow shop scheduling problem minimizing total flowtime. In Liefooghe and López-Ibáñez [Liefooghe and López-Ibáñez, 2018], pages 85–100. (doi:10.1007/978-3-319-77449-7_6) Augusto Blaas Correa, André Grahl Pereira, and Marcus Ritt. Analyzing tie-breaking strategies for the A* algorithm. In Proceedings of the 27th International Joint Conference on Artificial Intelligence, pages 4715–4721, Stockholm, 2018. (PDF, 7 pages, 227818 bytes) (doi:10.24963/ijcai.2018/655) Marcelo de Souza and Marcus Ritt. Automatic grammar-based design of heuristic algorithms for unconstrained binary quadratic programming. In Liefooghe and López-Ibáñez [Liefooghe and López-Ibáñez, 2018], pages 67–84. (doi:10.1007/978-3-319-77449-7_5) Alex Gliesch, Marcus Ritt, and Mayron C. O. Moreira. A multistart alternating tabu search for commercial districting. In Liefooghe and López-Ibáñez [Liefooghe and López-Ibáñez, 2018], pages 158–173. (doi:10.1007/978-3-319-77449-7_11) Jordi Pereira, Marcus Ritt, and Oscar C. Vásquez. A memetic algorithm for the cost-oriented robotic assembly line balancing problem. 2018. (doi:10.1016/j.cor.2018.07.001) Tadeu Zubaran and Marcus Ritt. An effective heuristic algorithm for the partial shop scheduling problem. Comput. Oper. Res., 93:51–65, May 2018. Online supplement: http://inf.ufrgs.br/algopt/pssp. (doi:10.1016/j.cor.2018.01.015) Mais... Orientações Doutorado Alex Gliesch. Districting problems. PhD thesis, Universidade Federal do Rio Grande do Sul, 2018–. Em andamento. Artur Ferreira Brum. Automatic algorithm configuration for flow shop problems. PhD thesis, Universidade Federal do Rio Grande do Sul, 2016–. Em andamento. Mestrado Gabriel Langeloh. Fast computation of Gröbner bases. Master's thesis, Universidade Federal do Rio Grande do Sul, 2017. Em andamento. Graduação Frederico Corrêa. Exact algorithms for single machine scheduling with agreeing parameters, 2015–. Em andamento. Orientações concluídas... Miscelânia Uma coleção de bibliotecas com instâncias de problemas de otimização e software de otimização. Nada a fazer? Resolve um problema ou aprende um algoritmo do \"Livro de Deus\". Por acaso é inverno agora, e a pergunta é “Como levantar-se nas manhãs frias?” Resposta aqui. Ireção Alguns acham ireita e desquerda não dá para condfunir que dengano! (em homenagem a Ernst Jandl) Mais poemas... Sobre teoria e prática (em alemão) Alias: Conserto gaitas. On Tuftefying gnuplot. homepage.txt · Esta página foi modificada pela última vez em: 2025/08/10 14:13 (Edição externa) Ferramentas de Página Mostrar página fonte Revisões antigasBacklinksVoltar ao topo Excepto menção em contrário, o conteúdo neste wiki está sob a seguinte licença: CC Attribution-Noncommercial-Share Alike 4.0 International",
  "content_length": 6330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:06"
}