{
  "name": "Marc Berges",
  "homepage": "https://ddi.cs.fau.de/staff/berges",
  "status": "success",
  "content": "Prof. Dr. Marc Berges - Professur für Didaktik der Informatik Organisationsmenü öffnen Organisationsmenü schließen Prof. Dr. Marc Berges Prof. Dr. Marc Berges KontaktE-Mail: marc.berges@fau.deTelefon: +49 9131 85 - 27922 Lehrveranstaltungen Vorlesung Didaktik der Informatik II Hauptseminar Didaktik der Informatik Praktikum Informatik in der Bildung Vorlesung mit Übung Einführung in die Fachdidaktik Informatik Seminar Forschungsseminar Projekt Projekt: WebNetSim - Eine fachdidaktische Netzwerksimulation Publikationen Alle öffnen 2025 Berges, M., Churavy, A., & Wilbers, K. (2025). Neues Studienprofil Informatik. Studiengang Berufspädagogik Technik an der FAU Erlangen-Nürnberg. VLB Akzente, 34(2), 15.BibTeX: Download Betzendahl, J., Lohr, D., Berges, M., & Kohlhase, M. (2025). Efficient Exam Correction at Scale: Streamlining Paper-Based Assessments with the VoLl-KOrN System. In Mrohs, L., Franz, J., Herrmann, D., Lindner, K., Staake, T. (Eds.), Digitales Lehren und Lernen an der Hochschule Strategien - Bedingungen - Umsetzung. Bielefeld: transcript.BibTeX: Download Grelka, F., Kruse-Kurbach, T., & Berges, M. (2025). A Framework for Evaluating AI Powered Learning Platforms in K-12 and University CS Education. In 2025 IEEE Global Engineering Education Conference (EDUCON) (pp. 1-5). London, GB: New York City: IEEE.DOI: 10.1109/EDUCON62633.2025.11016415BibTeX: Download Grelka, F., Lohr, D., & Berges, M. (2025, June). ALeA : Advancing Personalized Learning with Adaptive Assistance and Semantic Annotation. Paper presentation at Workshop KI und Bildung 2024, Bamberg, DE.DOI: 10.20378/irb-108296BibTeX: Download Händel, M., Berges, M., Gläser-Zikuda, M., Kammerl, R., Kudlich, H., Martschinke, S., & Pirner, M. (2025). Who is savvy about digital ethics? Differences between teacher education, law, and computer science students. Education and Information Technologies.BibTeX: Download Lindner, A., & Berges, M. (2025, June). Enabling the Teachers : Forschungsbasierte Konzeption einer Lehrkräfteweiterbildung zum Themenbereich Künstliche Intelligenz. Poster presentation at Workshop KI und Bildung 2024, Bamberg, DE.DOI: 10.20378/irb-108295BibTeX: Download Lindner, A., Müller-Unterweger, M., & Berges, M. (2025). Demystifying AI. An open educational resource collection of unplugged AI teaching activities. Hello World, 28, 70-73.BibTeX: Download Lohr, D., & Berges, M. (2025). Der Weg ist das Ziel – Ein skalierbarer Wechsel von summativem zu formativem Assessment in der Programmierausbildung mit Antwortklassen. In Proceedings of the Workshop Automatische Bewertung von Programmieraufgaben 2025.DOI: 10.18420/abp2025_05BibTeX: Download Lohr, D., Berges, M., Chugh, A., Kohlhase, M., & Müller, D. (2025). Leveraging Large Language Models to Generate Course-specific Semantically Annotated Learning Objects. Journal of Computer Assisted Learning, 41, e13101. https://doi.org/10.1111/jcal.13101DOI: 10.1111/jcal.13101BibTeX: Download Lohr, D., Wechsler, L., & Berges, M. (2025, June). Introducing a self-study course for learning textual programming at highschool with APFEL and ALeA. Paper presentation at Workshop KI und Bildung 2024, Bamberg, DE.DOI: 10.20378/irb-108298BibTeX: Download Müller-Unterweger, M., Lindner, A., & Berges, M. (2025). KI in der Kiste: Unterrichtsaktivitäten zum Thema Künstliche Intelligenz. Poster presentation at Workshop KI und Bildung 2024, Bamberg, DE.DOI: 10.20378/irb-108302BibTeX: Download Müller-Unterweger, M., Lindner, A., Löffler, P., & Berges, M. (2025). Das Wollperzeptron–Eine Unplugged Aktivität zum Maschinellen Lernen. Informatische Bildung in Schulen, 3(2), 35-41. https://doi.org/10.18420/ibis-03-02-07DOI: 10.18420/ibis-03-02-07BibTeX: Download 2024 Kohlhase, M., Berges, M., Grubert, J., Henrich, A., Landes, D., Leidner, J.L.,... Wolter, D. (2024). Project VoLL-KI: Learning from Learners. Künstliche Intelligenz. https://doi.org/10.1007/s13218-024-00846-9DOI: 10.1007/s13218-024-00846-9BibTeX: Download Kruse-Kurbach, T., Lohr, D., Berges, M., Kohlhase, M., Moghbeli Damaneh, H., & Schütz, M. (2024). Term Extraction for Domain Modeling. In Gesellschaft für Informatik e.V. (Hrg.), Proceedings of the 22. Fachtagung Bildungstechnologien (DELFI). Fulda, DE.DOI: 10.18420/delfi2024_33BibTeX: Download Lindner, A., & Berges, M. (2024). Reconstruction of Transformative CS Topics in Education: A Model Proposal for Artificial Intelligence. Journal of Digital Life and Learning, 4, 25-42. https://doi.org/10.51357/jdll.v4i1.274DOI: 10.51357/jdll.v4i1.274BibTeX: Download Lohr, D., Berges, M., Chugh, A., & Striewe, M. (2024). Adaptive Learning Systems in Programming Education: A Prototype for Enhanced Formative Feedback. In Gesellschaft für Informatik e.V. (Eds.), Proceedings of DELFI 2024. Fulda, DE.DOI: 10.18420/delfi2024_57BibTeX: Download Müller-Unterweger, M., & Berges, M. (2024, September). Introduction to Programming using Ozobots in an Economics Major CS-Class. Poster presentation at 19th WiPSCE Conference in Primary and Secondary Computing Education Research, WiPSCE 2024, Munich, DE.DOI: 10.1145/3677619.3678136BibTeX: Download 2023 Berges, M., Betzendahl, J., Chugh, A., Kohlhase, M., Lohr, D., & Müller, D. (2023). Learning Support Systems based on Mathematical Knowledge Management. In Lecture Notes in Computer Science. Cambridge, GB: Cham: Springer.BibTeX: Download Kruse, T., Berges, M., Betzendahl, J., Kohlhase, M., Lohr, D., & Müller, D. (2023). Learning with ALeA: Tailored experiences through annotated course material. In Maike Klein, Daniel Krupka, Cornelia Winter, Volker Wohlgemuth (Eds.), INFORMATIK 2023. Designing Futures: Zukünfte gestalten (pp. 395-398). Berlin, DE: Bonn: Köllen Druck+Verlag.DOI: 10.18420/inf2023_43BibTeX: Download Lindner, A., Berges, M., Rösch, M., & Franke, F. (2023, September). Ab an die Kiste: Konzeption eines mobilen Lernlabors zu KI. Poster presentation at INFOS 2023 - Informatikunterricht zwischen Aktualität und Zeitlosigkeit., Würzburg, DE.DOI: 10.18420/infos2023-052BibTeX: Download Lindner, A., Berges, M., Rösch, M., & Franke, F. (2023). Implementing a Portable Learning Lab on Artificial Intelligence: It’s AI in a Box! In Jean-Philippe Pellet and Gabriel Parriaux (Eds.), Informatics in Schools. Beyond Bits and Bytes: Nurturing Informatics Intelligence in Education. ISSEP 2023. (pp. 26-39). HEP Vaud, Lausanne, CH: Cham: Springer.DOI: 10.1007/978-3-031-44900-0_3BibTeX: Download Lindner, A., Müller-Unterweger, M., Berges, M., & Rösch, M. (2023). KI in der Kiste: Unterrichtsaktivitäten aus einem Lernlabor zum Thema Künstliche Intelligenz. Informatische Bildung in Schulen, 1(1). https://doi.org/10.18420/ibis-01-01-03DOI: 10.18420/ibis-01-01-03BibTeX: Download Lindner, A., Müller-Unterweger, M., Löffler, P., Lohr, D., & Berges, M. (2023). Von Autonomem Fahren bis Zahnarzt - Vorstellungen von Schüler:innen zu Künstlicher Intelligenz und ihre Integration in den Informatikunterricht. In Lutz Hellmig, Martin Hennecke (Hrg.), Informatikunterricht zwischen Aktualität und Zeitlosigkeit (S. 93-102). Würzburg, DE: Bonn: Gesellschaft für Informatik.DOI: 10.18420/infos2023-007BibTeX: Download Lohr, D., Berges, M., Kohlhase, M., Müller, D., & Rapp, M. (2023). The Y-Model - Formalization of Computer-Science Tasks in the Context of Adaptive Learning Systems. In Proceedings of the IEEE German Education Conference (GeCon). Berlin, DE.DOI: 10.1109/GECon58119.2023.10295148BibTeX: Download Lohr, D., Berges, M., Kohlhase, M., & Rabe, F. (2023). The Potential of Answer Classes in Large-scale Written Computer-Science Exams. In Desel, Jörg; Opel, Simone (Eds.), Proceedings of the Hochschuldidaktik Informatik (HDI) 2021 (pp. 179 - 190). Aachen, DE.BibTeX: Download 2022 Yadav, A., Connolly, C., Berges, M., Chytas, C., Franklin, C., Hijón-Neira, R.,... Warner, J.R. (2022). Models for Computer Science Teacher Preparation: Developing Teacher Knowledge. In Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE (pp. 568-569). Dublin, IE: Association for Computing Machinery.DOI: 10.1145/3502717.3532166BibTeX: Download Yadav, A., Connolly, C., Berges, M., Chytas, C., Franklin, C., Hijón-Neira, R.,... Warner, J.R. (2022). A Review of International Models of Computer Science Teacher Education. In Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE (pp. 65-93). Dublin, IE: Association for Computing Machinery.DOI: 10.1145/3571785.3574123BibTeX: Download 2021 Berges, M., Beyer, A., Freund, S., Losch, D., & Schulz, K. (2021). Informatische Literalität im Lehramtsstudium der Lateinischen Philologie. LOG IN - Informatische Bildung und Computer in der Schule, 197/198.BibTeX: Download Lindner, A., Berges, M., & Lechner, M. (2021). KI im Toaster? Schüler:innenvorstellungen zu künstlicher Intelligenz. In Ludger Humbert (Hrg.), Informatik - Bildung von Lehrkräften in allen Phasen. 19. GI-Fachtagung Informatik und Schule (S. 133-142). Wuppertal (virtuell), DE: Bonn: Gesellschaft für Informatik.DOI: 10.18420/infos2021_f199BibTeX: Download Lohr, D., & Berges, M. (2021). Towards Criteria for Valuable Automatic Feedback in Large Programming Classes. In Desel, Jörg; Opel, Simone (Eds.), Proceedings of the Hochschuldidaktik Informatik (HDI) 2021 (pp. 181-186). Dortmund, DE.BibTeX: Download 2020 Lindner, A., & Berges, M. (2020). Can you explain AI to me? Teachers’ pre-concepts about Artificial Intelligence. In 2020 IEEE Frontiers in Education Conference (FIE). Uppsala, SE.DOI: 10.1109/FIE44824.2020.9274136BibTeX: Download 2019 Barela, J., Gasiba, T.E., Suppan, S.R., Berges, M., & Beckers, K. (2019). When interactive graphic storytelling fails. In Proceedings - 2019 IEEE 27th International Requirements Engineering Conference Workshops, REW 2019 (pp. 164-169). Jeju Island, KR: Institute of Electrical and Electronics Engineers Inc..DOI: 10.1109/REW.2019.00034BibTeX: Download Berges, M., Ehmann, M., Hennecke, M., Heuer, U., Lindner, A., Gall, R.,... Pöhner, N. (2019). Erfahrungsbericht",
  "content_length": 34690,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:59"
}