{
  "name": "Marc Olano",
  "homepage": "http://www.csee.umbc.edu/~olano",
  "status": "success",
  "content": "Marc Olano Marc Olano Computer Science and Electrical Engineering, ITE 354 University of Maryland, Baltimore County Baltimore, MD 21250 +1-410-455-3094 olano@umbc.edu Associate Dean of Academic Programs and Learning, College of Engineering and Information Technology Associate Professor, Department of Computer Science and Electrical Engineering Affiliate Associate Professor, Imaging Research Center Director, Computer Science Game Development Track Co-director, VANGOGH lab (full calendar) Major accomplishments: Pioneered procedural shading on graphics hardware, now a standard feature on every PC and game platform. This is one of the defining features of graphics hardware today. Developed a homogeneous (clipless) rendering technique used in many generations of PC graphics processors. Did some of the key work on using normal maps on low-detail 3D models (including coming up with the name), now a common technique in games. Developed automatic shader program simplification. I did it to allow more complex hardware shaders, but has lead to work by Pixar and Industrial Light and Magic for interactive previews of movie production shaders. CV Resources For more information on UMBC's programs on Games, Animation and Interactive Media (including game development track requirements), see the GAIM page. Notes on using CVS or GIT for electronic classwork submission Scrum burndown template as an online google sheet Classes Undergraduate and graduate independent study opportunities available, contact me for details. CMSC 411: Computer Architecture CMSC 435/634: Introduction to Computer Graphics CMSC 438/491/691: Graphics for Games CMSC 491/691: Data Oriented Programming CMSC 491/691: Real-time Shading CMSC 493 / ART 485: Game Development CMSC 611: Advanced Computer Architecture CMSC 635: Advanced Computer Graphics F25 S25 F24 S24 F23 S23 F22 S22 F21 S21S21 F20 S20S20 F19 S19S19 F18 S18 F17F17 S16S16 F15 S15 F14F14 S14S14 F13 F12F12 S12S12 F11 S11S11 F10 S09S09 F08 S08S08 F07 S07 F06 S06 F05 S05 F04 S04S04 F03 S03 F02 Research My research interests are interactive 3D computer graphics, programmable shading, graphics hardware, surface appearance modeling, or almost any other combination of those words. Publications Papers Theses SIGGRAPH courses Patents Tech Reports Real-Time Shading book Lighting and Shading Procedural Shading Rendering Texture Compression Virtual Reality Visualization GPGPU Other Stuff",
  "content_length": 2427,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:07"
}