{
  "name": "Marcelo Fabian Frias",
  "homepage": "https://hb2504.utep.edu/Home/Profile?username=mfrias4",
  "status": "success",
  "content": "UTEP Faculty Profiles MinerAlert Skip to main content Search pages and people FACULTY PROFILES X Quick Links Library Parking & Maps UTEP News Events Student Affairs Business Affairs Employment Opportunities University Bookstore Technology Support Main Content UTEP Faculty Profiles UTEP Faculty Profiles Marcelo F. Frias Professor Computer Science Office Building: Chemistry and Computer Science Building Office Room: 3.1008 Phone: (915) 747-5516 Email: mfrias4@utep.edu Expertise: See Research Profile in Expertise Connector Bio Education Scholarly and Creative Activity Grants Courses Course Evaluations Bio < Dr. Marcelo Frias is a Professor in the Computer Science Department at the University of Texas at El Paso. His research interests are in the area of Automated Software Engineering, with focus on fault detection, test generation, automated program repair and synthesis of specifications. Awards and Honors Marshall of Graduate Students, School of Engineering, Commencement Ceremony - Graduate School, UTEP (12/15/2024) Amazon Research Award - Amazon Web Services (03/01/2021-03/31/2021) Best paper award - IEEE/ACM (05/23/2017) Best paper award - Brazilian Society for Computer Science (11/25/2016) Best Paper Award - European Association for Software Science and Technology (EASST) (03/28/2007) Bernardo Houssay Award to Scientific and Technological Research (young researcher in Computer Science) - Argentinean Secretary of Science and Technology (05/01/2003-05/31/2003) > Education < Ph D in Computer Science, Pontifcia Universidade Catolica in Rio de Janeiro (1998) BS in Computer Science, Universidad de Buenos Aires (1992) > Publications < An Analysis of the Impact of Field-Value Instance Navigation in Alloy’s Model Finding Rigorous State-Based Methods (ABZ 2024, Springer) LNCS 14759 (2024), Cesar Cornejo, Maria Marta Novaira, Sonia Parmigiani, Nazareno Aguirre, Marcelo Frias, Simon Gutierrez Brida, German Regis. BEAPI: A tool for bounded exhaustive input generation from APIs Science of Computer Programming (Elsevier) 238 (2024), Mariano Politano, Valeria Bengolea, Facundo Molina, Nazareno Aguirre, Marcelo Frias, Pablo Ponzio. Abstraction-Aware Inference of Metamorphic Relations Proceedings of the 32nd ACM International Conference on the Foundations of Software Engineering (FSE) 1 FSE (2024), Agustin Nolasco, Facundo Molina, Renzo Degiovanni, Alessandra Gorla, Diego Garbervetsky, Mike Papadakis, Sebastian Uchitel, Nazareno Aguirre, Marcelo Frias. Precise Lazy Initialization for Programs with Complex Heap Inputs 34th IEEE International Symposium on Software Reliability Engineering, ISSRE 2023 34th (2023), Juan M. Copia, Facundo Molina, Nazareno M. Aguirre, Marcelo Frias, Alessandra Gorla, Pablo Ponzio. A Study of the Electrum and DynAlloy Dynamic Behavior Notations IEEE Transactions on Software Engineering 49 11 (2023), Cesar Cornejo, German Regis, Nazareno M. Aguirre, Marcelo F. Frias. EvoSpex: A Search-Based Tool for Postcondition Inference Proceedings of the 32nd ACM SIGSOFT International Symposium on Software Testing and Analysis, ISSTA 2023, Seattle, WA, USA, July 17-21, 2023. ACM 2023 32nd (2023), Facundo Molina, Pablo Ponzio, Nazareno M. Aguirre, Marcelo Frias. Efficient Bounded Exhaustive Input Generation from Program APIs Fundamental Approaches to Software Engineering - 26th International Conference, FASE 2023 13991 26th (2023), Mariano Politano, Valeria S. Bengolea, Facundo Molina, Nazareno M. Aguirre, Marcelo Frias, Pablo Ponzio. Presentations No info available. > Grants < Modular Bounded Verification with Expressive Contracts (04/22/2022 - 12/31/2025) - Amazon Web Services > Current/Future Courses < Term Course Section Syllabus Fall 2025 CS 2101 - Discrete Structures I 13261 Fall 2025 CS 2202 - Discrete Structures II 13264 Fall 2025 CS 6398 - Dissertation 18552 Fall 2025 CS 6294 - Doctoral Research 17939 Fall 2025 CS 6394 - Doctoral Research 17973 Fall 2025 CS 6694 - Doctoral Research 17941 Fall 2025 CS 1301 - Intro to Computer Science 12315 Fall 2025 CS 1101 - Intro to Computer Science Lab 12328 Fall 2025 CS 1101 - Intro to Computer Science Lab 12338 Fall 2025 CS 1101 - Intro to Computer Science Lab 12625 Fall 2025 CS 1101 - Intro to Computer Science Lab 14034 Fall 2025 CS 1101 - Intro to Computer Science Lab 16620 Past Courses Select Term: All Summer 2025 Spring 2025 Fall 2024 Summer 2024 Spring 2024 Fall 2023 Apply Term Course Section Syllabus Summer 2025 CS 4371 - Computer Science Problems 33458 Spring 2025 CS 2101 - Discrete Structures I 23725 Syllabus Spring 2025 CS 2202 - Discrete Structures II 24318 Syllabus Spring 2025 CS 6394 - Doctoral Research 27997 Spring 2025 CS 6694 - Doctoral Research 27996 Spring 2025 CS 4387 - Software Integration and V&V 22050 Spring 2025 CS 5387 - Software Integration and V&V 21327 Syllabus Fall 2024 CS 2101 - Discrete Structures I 13662 Syllabus Fall 2024 CS 2202 - Discrete Structures II 13665 Syllabus Fall 2024 CS 5390 - Special Topic Computer Science 16567 Syllabus Fall 2024 CS 4390 - Special Topics in Computer Sci 16565 Syllabus Summer 2024 CS 4371 - Computer Science Problems 34224 Spring 2024 CS 2101 - Discrete Structures I 24279 Syllabus Spring 2024 CS 2202 - Discrete Structures II 25005 Syllabus Spring 2024 CS 4387 - Software Integration and V&V 22289 Spring 2024 CS 5387 - Software Integration and V&V 21481 Fall 2023 CS 2101 - Discrete Structures I 14417 Syllabus Fall 2023 CS 2202 - Discrete Structures II 14423 Syllabus > Course Evaluations < Term Course Section Evaluation Spring 2025 CS 2101 - Discrete Structures I 23725 Evaluation Spring 2025 CS 2202 - Discrete Structures II 24318 Evaluation Spring 2025 CS 4387 - Software Integration and V&V 22050 Evaluation Spring 2025 CS 5387 - Software Integration and V&V 21327 Evaluation Fall 2024 CS 2101 - Discrete Structures I 13662 Evaluation Fall 2024 CS 2202 - Discrete Structures II 13665 Evaluation Fall 2024 CS 5390 - Special Topic Computer Science 16567 Evaluation Fall 2024 CS 4390 - Special Topics in Computer Sci 16565 Evaluation Spring 2024 CS 2101 - Discrete Structures I 24279 Evaluation Spring 2024 CS 2202 - Discrete Structures II 25005 Evaluation Spring 2024 CS 4387 - Software Integration and V&V 22289 Evaluation Spring 2024 CS 5387 - Software Integration and V&V 21481 Evaluation Fall 2023 CS 2101 - Discrete Structures I 14417 Evaluation Fall 2023 CS 2202 - Discrete Structures II 14423 Evaluation > Bio Bio Dr. Marcelo Frias is a Professor in the Computer Science Department at the University of Texas at El Paso. His research interests are in the area of Automated Software Engineering, with focus on fault detection, test generation, automated program repair and synthesis of specifications. Awards and Honors Marshall of Graduate Students, School of Engineering, Commencement Ceremony - Graduate School, UTEP (12/15/2024) Amazon Research Award - Amazon Web Services (03/01/2021-03/31/2021) Best paper award - IEEE/ACM (05/23/2017) Best paper award - Brazilian Society for Computer Science (11/25/2016) Best Paper Award - European Association for Software Science and Technology (EASST) (03/28/2007) Bernardo Houssay Award to Scientific and Technological Research (young researcher in Computer Science) - Argentinean Secretary of Science and Technology (05/01/2003-05/31/2003) Education Ph D in Computer Science, Pontifcia Universidade Catolica in Rio de Janeiro (1998) BS in Computer Science, Universidad de Buenos Aires (1992) Scholarly and Creative Activity Publications An Analysis of the Impact of Field-Value Instance Navigation in Alloy’s Model Finding Rigorous State-Based Methods (ABZ 2024, Springer) LNCS 14759 (2024), Cesar Cornejo, Maria Marta Novaira, Sonia Parmigiani, Nazareno Aguirre, Marcelo Frias, Simon Gutierrez Brida, German Regis. BEAPI: A tool for bounded exhaustive input generation from APIs Science of Computer Programming (Elsevier) 238 (2024), Mariano Politano, Valeria Bengolea, Facundo Molina, Nazareno Aguirre, Marcelo Frias, Pablo Ponzio. Abstraction-Aware Inference of Metamorphic Relations Proceedings of the 32nd ACM International Conference on the Foundations of Software Engineering (FSE) 1 FSE (2024), Agustin Nolasco, Facundo Molina, Renzo Degiovanni, Alessandra Gorla, Diego Garbervetsky, Mike Papadakis, Sebastian Uchitel, Nazareno Aguirre, Marcelo Frias. Precise Lazy Initialization for Programs with Complex Heap Inputs 34th IEEE International Symposium on Software Reliability Engineering, ISSRE 2023 34th (2023), Juan M. Copia, Facundo Molina, Nazareno M. Aguirre, Marcelo Frias, Alessandra Gorla, Pablo Ponzio. A Study of the Electrum and DynAlloy Dynamic Behavior Notations IEEE Transactions on Software Engineering 49 11 (2023), Cesar Cornejo, German Regis, Nazareno M. Aguirre, Marcelo F. Frias. Presentations No info available. Grants Modular Bounded Verification with Expressive Contracts (04/22/2022 - 12/31/2025) Amazon Web Services Courses Current/Future Courses Term Fall 2025 Course CS 2101 - Discrete Structures I Section 13261 Syllabus Term Fall 2025 Course CS 2202 - Discrete Structures II Section 13264 Syllabus Term Fall 2025 Course CS 6398 - Dissertation Section 18552 Syllabus Term Fall 2025 Course CS 6294 - Doctoral Research Section 17939 Syllabus Term Fall 2025 Course CS 6394 - Doctoral Research Section 17973 Syllabus Term Fall 2025 Course CS 6694 - Doctoral Research Section 17941 Syllabus Term Fall 2025 Course CS 1301 - Intro to Computer Science Section 12315 Syllabus Term Fall 2025 Course CS 1101 - Intro to Computer Science Lab Section 12328 Syllabus Term Fall 2025 Course CS 1101 - Intro to Computer Science Lab Section 12338 Syllabus Term Fall 2025 Course CS 1101 - Intro to Computer Science Lab Section 12625 Syllabus Term Fall 2025 Course CS 1101 - Intro to Computer Science Lab Section 14034 Syllabus Term Fall 2025 Course CS 1101 - Intro to Computer Science Lab Section 16620 Syllabus Past Courses Select Term: All Summer 2025 Spring 2025 Fall 2024 Summer 2024 Spring 2024 Fall 2023 Apply Term Summer 20",
  "content_length": 12889,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:15"
}