{
  "name": "Marc Feeley",
  "homepage": "http://www.iro.umontreal.ca/~feeley",
  "status": "success",
  "content": "Marc Feeley Marc Feeley Professeur titulaire (Full professor) Université de Montréal Dépt. d'informatique et de r.o. C.P. 6128, succ. centre-ville Montréal (Québec) Canada H3C 3J7 WWW : http://www.iro.umontreal.ca/~feeley/ Email : feeley@iro.umontreal.ca Tel : (514) 343-7477 Fax : (514) 343-5834 Bureau: 2389 pavillon André-Aisenstadt Research Interests Dynamic programming languages Functional programming languages Programming language design and implementation Parallel processing and computer architecture Selected publications Olivier Melançon, Manuel Serrano, and Marc Feeley, Float Self-Tagging. In Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA'25), October 2025. [PDF] Olivier Melançon, Manuel Serrano, and Marc Feeley, Float Self-Tagging (Artifact). In Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA'25), October 2025. Artifact Frédéric Lahaie-Bertrand, Leonard Oest O'Leary, Olivier Melançon, Marc Feeley, and Stefan Monnier, Arborescent Garbage Collection: A Dynamic Graph Approach to Immediate Cycle Collection. In International Workshop on Memory Management (ISMM'25), June 2025. [PDF] [Best Paper Award of ISMM'25] Laurent Huberdeau, Cassandre Hamel, Stefan Monnier, and Marc Feeley, The Design of a Self-Compiling C Transpiler Targeting POSIX Shell. In Software Language Engineering (SLE'24), October 2024. [PDF] Laurent Huberdeau, Cassandre Hamel, Stefan Monnier, and Marc Feeley, The Design of a Self-Compiling C Transpiler Targeting POSIX Shell (Artifact). In Software Language Engineering (SLE'24), October 2024. Artifact Olivier Melançon, Marc Feeley, and Manuel Serrano, Static Basic Block Versioning. In European Conference on Object-Oriented Programming (ECOOP'24), September 2024. [PDF] [slides PDF] Leonard Oest O'Leary, Mathis Laroche, and Marc Feeley, A R4RS Compliant REPL in 7 KB. In International Workshop on Trends in Functional Programming (TFP'24), January 2024. [PDF] Olivier Melançon, Marc Feeley, and Manuel Serrano, An Executable Semantics for Faster Development of Optimizing Python Compilers. In Software Language Engineering (SLE'23), October 2023. [PDF] Leonard Oest O'Leary, Mathis Laroche, and Marc Feeley, A R4RS Compliant REPL in 7 KB. In Scheme and Functional Programming Workshop (SFPW'23), September 2023. [PDF] (preprint) Leonard Oest O'Leary and Marc Feeley, A Compact and Extensible Portable Scheme VM. In MoreVMs Workshop (MOREVMS@PROGRAMMING'23), March 2023. [PDF] (preprint) Marc-André Bélanger and Marc Feeley, Interfacing with CPython from Gambit Scheme. In Languages, Architectures, and Tools for Heterogeneous Computing Workshop (LATHC'23), February 2023. [PDF] (abstract) Marc-André Bélanger and Marc Feeley, A Foreign Function Interface between Gambit Scheme and CPython. In Scheme and Functional Programming Workshop (SFPW'22), September 2022. [PDF] Samuel Yvon and Marc Feeley, A Small Scheme VM, Compiler, and REPL in 4K. In Workshop on Virtual Machines and Intermediate Languages (VMIL@SPLASH'21), October 2021. [PDF] Ian Sabourin, Stefan Monnier, and Marc Feeley, Computation over partial information. In Symposium on Implementation and Application of Functional Languages (IFL'21), September 2021. [PDF] Marc-André Bélanger and Marc Feeley, A lightweight approach for accessing Python modules from Gambit Scheme (Lightning Talk). In Scheme and Functional Programming Workshop (SFPW'21), August 2021. [PDF] Marc-André Bélanger and Marc Feeley, A Scheme Foreign Function Interface to JavaScript Based on an Infix Extension. In European Lisp Symposium (ELS'21), May 2021. [PDF] Olivier Melançon and Marc Feeley, Teaching Programming to Novices Using the codeBoot Online Environment. In International Workshop on Trends in Functional Programming in Education (TFPIE 2021), February 2021. [PDF] Frédéric Hamel and Marc Feeley, An R7RS Compatible Module System for Termite Scheme. In European Lisp Symposium (ELS'20), April 2020. [PDF] Manuel Serrano and Marc Feeley, Property caches revisited. In International Conference on Compiler Construction (CC'19), February 2019. [PDF] Laurent Huberdeau and Marc Feeley, Tail Calling Between Code Generated by C and Native Backends. In Scheme and Functional Programming Workshop (SFPW'18), September 2018. [PDF] Baptiste Saleil and Marc Feeley, Building JIT compilers for dynamic languages with low development effort. In Workshop on Virtual Machines and Intermediate Languages (VMIL@SPLASH'18), November 2018. [PDF] Baptiste Saleil and Marc Feeley, Interprocedural Specialization of Higher-Order Dynamic Languages Without Static Analysis. In European Conference on Object-Oriented Programming (ECOOP'17), June 2017. [PDF] Maxime Chevalier-Boisvert and Marc Feeley. Interprocedural Type Specialization of JavaScript Programs Without Type Analysis. In European Conference on Object-Oriented Programming (ECOOP'16), July 2016. [PDF] Marc Feeley. Compiling for Multi-Language Task Migration. In ACM Dynamic Languages Symposium (DLS'15), October 2015. [PDF] [Most Notable Paper Award of DLS'15] Baptiste Saleil and Marc Feeley. Type Check Removal Using Lazy Interprocedural Code Versioning. In Scheme and Functional Programming Workshop (SFPW'15), September 2015. [PDF] Maxime Chevalier-Boisvert and Marc Feeley. Simple and Effective Type Check Removal through Lazy Basic Block Versioning. In European Conference on Object-Oriented Programming (ECOOP'15), July 2015. [PDF] Benjamin Cerat and Marc Feeley. Structure Vectors and their Implementation. In Scheme and Functional Programming Workshop (SFPW'14), November 2014. [PDF] Baptiste Saleil and Marc Feeley. Code Versioning and Extremely Lazy Compilation of Scheme. In Scheme and Functional Programming Workshop (SFPW'14), November 2014. [PDF] Eric Lavoie, Bruno Dufour, and Marc Feeley. Portable and Efficient Run-time Monitoring of JavaScript Applications using Virtual Machine Layering. In European Conference on Object-Oriented Programming (ECOOP'14), July 2014. [PDF] Eric Lavoie, Bruno Dufour, and Marc Feeley. Harnessing Performance for Flexibility in Instrumenting a Virtual Machine for JavaScript through Metacircularity. In Runtime Environments, Systems, Layering and Virtualized Environments (RESoLVE'13), March 2013. [PDF] Eric Thivierge and Marc Feeley. Efficient Compilation of Tail Calls and Continuations to JavaScript. In Scheme and Functional Programming Workshop (SFPW'12), September 2012. [PDF] Maxime Chevalier-Boisvert, Erick Lavoie, Marc Feeley, and Bruno Dufour. Bootstrapping a Self-Hosted Research Virtual Machine for JavaScript: An Experience Report. In Dynamic Languages Symposium (DLS'11), October 2011. [PDF] [Most Notable Paper Award of DLS'11] Etienne Bergeron, Louis-David Perron, Marc Feeley, and Jean Pierre David. Logarithmic-Time FPGA bitstream analysis: A step towards JIT hardware compilation. ACM Transactions on Reconfigurable Technology and Systems, Vol 4, No 2, Article 12 (May 2011), 27 pages. [PDF] Vincent St-Amour and Marc Feeley. PICOBIT: A Compact Scheme System for Microcontrollers. In Symposium on Implementation and Application of Functional Languages (IFL'09), pages 1-11, September 2009. [PDF] [Best Paper Award of IFL'09] Vincent St-Amour, Lysiane Bouchard, and Marc Feeley. Small Scheme stack: a Scheme TCP/IP stack targeting small embedded applications. In Scheme and Functional Programming Workshop (SFPW'08), pages 11-18, September 2008. [PDF] Etienne Bergeron, Marc Feeley, and Jean-Pierre David. Hardware JIT Compilation for Off-the-Shelf Dynamically Reconfigurable FPGAs. In International Conference on Compiler Construction (CC'08), volume 4959 of Lecture Notes in Computer Science, pages 178-192, March 2008. [PDF] Etienne Bergeron, Marc Feeley, Marc-André Daigneault, and Jean Pierre David. Using dynamic reconfiguration to implement high-resolution programmable delays on an FPGA. In International IEEE Northeast Workshop on Circuits and Systems (NEWCAS'08), pages 265-268, June 2008. [PDF] Marc Feeley. Speculative inlining of predefined procedures in an R5RS Scheme to C compiler. In Symposium on Implementation and Application of Functional Languages (IFL'07), volume 5083 of Lecture Notes in Computer Science, pages 237-253, 2008. [PDF] Etienne Bergeron, Marc Feeley, and Jean Pierre David. Toward on-chip JIT synthesis on Xilinx VirtexII-Pro FPGAs. In International IEEE Northeast Workshop on Circuits and Systems (NEWCAS'07), pages 642-645, August 2007. [PDF] Adrien Piérard and Marc Feeley. Towards a portable and mobile Scheme interpreter. In Scheme and Functional Programming Workshop (SFPW'07), pages 59-68, September 2007. [PDF] Marc Feeley. SRFI-91: Extended ports, July 2007. [LINK] Marc Feeley. SRFI-90: Extensible hash table constructor, July 2007. [LINK] Marc Feeley. SRFI-89: Optional positional and named parameters, July 2007. [LINK] Marc Feeley. SRFI-88: Keyword objects, July 2007. [LINK] Guillaume Germain, Marc Feeley, and Stefan Monnier. Concurrency oriented programming in Termite Scheme. In Scheme and Functional Programming Workshop (SFPW'06), pages 125-135, September 2006. [PDF] Xavier Saint-Mleux, Marc Feeley, and Jean-Pierre David. SHard: a Scheme to hardware compiler. In Scheme and Functional Programming Workshop (SFPW'06), pages 39-49, September 2006. [PDF] Xavier Saint-Mleux, Marc Feeley, and Jean-Pierre David. A Scheme compiler for hardware dataflow machines. In ACM SIGPLAN/SIGBED Conference on Languages, Compilers, and Tools for Embedded Systems (LCTES'06), June 2006. Poster. [PDF] Marc Feeley and Phil Trinder, editors. Proceedings of the ACM SIGPLAN Workshop on Erlang (ERLANG'06), September 2006. [LINK] Matthew Flatt and Marc Feeley. SRFI-75: R6RS Unicode data, May 2006. [LINK] Guillaume Germain, Stefan Monnier, and Marc Feeley. Termite: a Lisp for distributed computing. In 2nd European LISP and Scheme Workshop - European Conference on Object-Oriented Programming, September 2005. [PDF] Danny Dubé and Marc Feeley. BIT: A very compact Scheme system f",
  "content_length": 18518,
  "method": "requests",
  "crawl_time": "2025-12-01 13:50:59"
}