{
  "name": "Marco Zimmerling",
  "homepage": "https://nes-lab.org",
  "status": "success",
  "content": "NESLAB – Networked Embedded Systems Lab Skip to content The Networked Embedded Systems Lab is a research group in the Department of Computer Science at TU Darmstadt led by Marco Zimmerling. We are also affiliated with the Center for Advancing Electronics Dresden at TU Dresden. Our research interests lie at the intersection of embedded systems and wireless networking, with the goal of making cyber-physical systems dependable and sustainable. We are active in multiple research areas, a subset of which include: Battery-free systems: [SenSys’24], [CACM’24], [EWSN’23], [NSDI’22], [NSDI’21], [SenSys’19]Control over wireless networks: [TCPS’22], [PIEEE’21], [L-CSS’20], [TCPS’20], [ICCPS’19]End-to-end real-time guarantees: [ECRTS’20], [TCPS’17], [RTSS’16]Synchronous transmissions: [EWSN’22], [CSUR’20], [Sci. Rep.’18], [IPSN’11]Low-power wireless networking: [IPSN’23], [EWSN’23], [EWSN’22], [SenSys’18], [SenSys’17]Reproducibility and benchmarking: [JSys’21], [CPSBench’18]Energy-harvesting systems: [MobiSys’25], [IPSN’19] Please look at our research and publications for a more comprehensive list. Our work has been generously supported by the Emmy Noether program and other grants of the DFG, as well as by the LOEWE center emergenCITY and the Center for Advancing Electronics Dresden. News11/2025: Ding is joining our group as a PhD student. Welcome!10/2025: Our paper on distributed learning on ultra-low-power devices with colleagues from RWTH Aachen University will appear in TCPS.10/2025: Thomas is joining our group as a PhD student. Welcome!08/2025: Our proposal for a Special Session at EMSOFT’25 on intermittent machine learning has been accepted, and the joint overview paper is now available.08/2025: Our paper on a new swarm control methodology with long-term collaborators from RWTH Aachen University will appear in Springer Autonomous Robots.05/2025: Our joint proposal with amazing colleagues from TU Dresden for a Cluster of Excellence on REC²: Responsible Electronics in the Climate Change Era will be funded by the German Research Foundation.03/2025: Our paper on Shepherd Nova, the first public testbed for distributed energy-harvesting systems, has been accepted at MobiSys’25!03/2025: Jonas is joining our group as a PhD student. Welcome!09/2024: Our paper on Riotee, an open-source hardware and software platform for the battery-free IoT, has been accepted at SenSys’24!05/2024: Matthias is joining our group as a PhD student. Welcome!",
  "content_length": 2464,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:51"
}