{
  "name": "Marco Fyfe Pietro Gillies",
  "homepage": "https://www.gold.ac.uk/computing/staff/m-gillies",
  "status": "success",
  "content": "Professor Marco Gillies | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Professor / Academic Director of TaLIC Department Computing Email m.gillies (@gold.ac.uk) Links Blogmarcogillies.org.uk Google scholar X@marcogillies Goldsmiths Research Centres/Groups Social Empathic and Embodied Virtual Reality (SeeVR) Professor of Computing. Co-director SEEVR lab and MA/MSc V&AR Marco is co-director (with Xueni 'Sylvia' Pan) of both the Masters in Virtual and Augmented Reality and the Social, Empathic and Embodied Virtual Reality Lab. He has been researching Virtual Reality and Artificial Intelligence since the late 1990s and has particularly worked on virtual humans and movement based interaction with VR. In the past he has also been Academic Director: Distance Learning and Academic Director of Goldsmiths' Teaching and Learning Innovation Centre. He co-founded the BSc Creative Computing degree at Goldsmiths, which was a key part of establishing Goldsmiths Computing as a key centre for applying computing to the arts and creative sectors. He co-created the first MOOC from an English University and was instrumental in developing Goldsmiths' large scale online degrees: BSc Computer Science and MSc Data Science. Academic qualifications PhD in Computer Science, University of Cambridge 2001 BA in Computer Science, University of Cambridge 1997 Teaching and supervision Marco Co-directs and teaches on the Masters in Virtual and Augmented Reality. He supervises Masters and PhD projects in many areas relating to Virtual Reality and Immersive media, particularly the interface of VR and AI/Machine Learning, Movement-based and Embodied forms of interaction and social interaction in VR and AR. Masters in Virtual and Augmented Reality Research interests Marco's research covers a wide range of areas of virtual reality and immersive media, particularly in three major areas: The application of AI and Machine Learning to VR The use of full body movement for interaction with immersive media Social interaction in VR, AR and MR These three strands are tightly intertwined. Machine learning is a key technology for recognising and designing movement based interaction; body movement and body language are a vital part of what makes VR a powerful medium for social interaction, and social interaction can be with AI characters as well as real people. Marco is also interested in human-centred approaches to AI and machine learning that use HCI methods and epistemologies to enable machine learning as a creative tool. His work is highly interdisciplinary and includes applications and collaboration with fields such as dance and performance, medicine, education, games development, critical disability studies, developmental psychology and social neuroscience. Publications and research outputs ArticleAvatars in mixed-reality meetings: A longitudinal field study of realistic versus cartoon facial likeness effects on communication, task satisfaction, presence, and emotional perception Dobre, Georgiana Cristina ORCID logo ; Wilczkowiak, Marta; Gillies, Marco ; Pan, Xueni ORCID logo ; and Rintel, Sean. 2025. Avatars in mixed-reality meetings: A longitudinal field study of realistic versus cartoon facial likeness effects on communication, task satisfaction, presence, and emotional perception. International Journal of Human-Computer Studies, 205, 103632. ISSN 1071-5819 Reawakening Sensibility to the More than Human Gillies, Marco ; and Zhang, Tianyuan . 2025. Reawakening Sensibility to the More than Human. Interactions, 32(6), pp. 46-49. ISSN 1072-5520 Immersive Intergroup Contact: Using Virtual Reality to Enhance Empathy and Reduce Stigma Towards Schizophrenia Yin, Jiaqi ORCID logo ; Liu, Shihan ORCID logo ; Lee, Shao-Wen ORCID logo ; Kitsios, AndreasORCID logo; Gillies, Marco ORCID logo ; Birtel, Michèle DeniseORCID logo; Farmer, HarryORCID logo; and Pan, Xueni ORCID logo . 2025. Immersive Intergroup Contact: Using Virtual Reality to Enhance Empathy and Reduce Stigma Towards Schizophrenia. IEEE Transactions on Visualization and Computer Graphics (TVCG), 31(11), pp. 9656-9666. ISSN 1077-2626 Show more information Immersive Machine Learning for Social Attitude Detection in Virtual Reality Narrative Games Dobre, Georgiana Cristina ORCID logo ; Gillies, Marco ; and Pan, Xueni ORCID logo . 2022. Immersive Machine Learning for Social Attitude Detection in Virtual Reality Narrative Games. Virtual Reality, 26(4), pp. 1519-1538. ISSN 1359-4338 My virtual self: the role of movement in children's sense of embodiment Dewe, Hayley; Gottwald, Janna; Bird, Laura-Ashleigh; Brenton, Harry ; Gillies, Marco ; and Cowie, Dorothy . 2022. My virtual self: the role of movement in children's sense of embodiment. IEEE Transactions on Visualization & Computer Graphics, 28(12), pp. 4061-4072. ISSN 1077-2626 Developing an Evaluation Framework for Analysing Educational Simulation Games Slyman, Souad ; Gillies, Marco ; and Lytra, Vally ORCID logo . 2022. Developing an Evaluation Framework for Analysing Educational Simulation Games. Proceedings of the 16th European Conference on Games Based Learning, 16(1), pp. 526-534. ISSN 2049-0992 Nonverbal communication in virtual reality: Nodding as a social signal in virtual interactions Aburumman, Nadine; Gillies, Marco ; Ward, Jamie A. ORCID logo ; and Hamilton, Antonia F.de C.. 2022. Nonverbal communication in virtual reality: Nodding as a social signal in virtual interactions. International Journal of Human-Computer Studies, 164, 102819. ISSN 1071-5819 A Comparison of the Effects of Haptic and Visual Feedback on Presence in Virtual Reality Gibbs, Janet K. ; Gillies, Marco ; and Pan, Xueni ORCID logo . 2022. A Comparison of the Effects of Haptic and Visual Feedback on Presence in Virtual Reality. International Journal of Human-Computer Studies, 157, 102717. ISSN 1071-5819 The Impact of Self-Representation and Consistency in Collaborative Virtual Environments Collingwoode-Williams, Tara ; O'Shea, Zoe ; Gillies, Marco ; and Pan, Xueni ORCID logo . 2021. The Impact of Self-Representation and Consistency in Collaborative Virtual Environments. Frontiers in Virtual Reality, 2, 648601. ISSN 2673-4192 Thinking and Doing: Challenge, Agency, and the Eudaimonic Experience in Video Games Cole, Tom ORCID logo ; and Gillies, Marco . 2021. Thinking and Doing: Challenge, Agency, and the Eudaimonic Experience in Video Games. Games and Culture, 16(2), pp. 187-207. ISSN 1555-4120 A Discussion of the Use of Virtual Reality for Training Healthcare Practitioners to Recognize Child Protection Issues Drewett, Olivia; Hann, Gayle; Gillies, Marco ; Sher, Carmel; Delacroix, Sylvie; Pan, Xueni ORCID logo ; Collingwoode-Williams, Tara ; and Fertleman, Caroline. 2019. A Discussion of the Use of Virtual Reality for Training Healthcare Practitioners to Recognize Child Protection Issues. Frontiers in Public Health, 7(255), Understanding the role of Interactive Machine Learning in Movement Interaction Design Gillies, Marco . 2019. Understanding the role of Interactive Machine Learning in Movement Interaction Design. ACM Transactions on Computer-Human Interaction, 26(1), 5. ISSN 1073-0516 Introduction to the Special Issue on Human-Centered Machine Learning Fiebrink, Rebecca ; and Gillies, Marco . 2018. Introduction to the Special Issue on Human-Centered Machine Learning. ACM Transactions on Interactive Intelligent Systems, 8(2), ISSN 2160-6455 Designing natural gesture interaction for archaeological data in immersive environments Albertini, Niccolò; Brogni, Andrea; Olivito, Riccardo; Taccola, Emanuele; Caramiaux, Baptiste ; and Gillies, Marco . 2017. Designing natural gesture interaction for archaeological data in immersive environments. Virtual Archaeology Review, 8(16), pp. 12-21. Virtual character personality influences participant attitudes and behavior – an interview with a virtual human character about her social anxiety Pan, Xueni ORCID logo ; Gillies, Marco ; and Slater, Mel. 2015. Virtual character personality influences participant attitudes and behavior – an interview with a virtual human character about her social anxiety. Frontiers in Robotics and AI, 2, 1. ISSN 2296-9144 Fluid gesture interaction design: applications of continuous recognition for the design of modern gestural interfaces Zamborlin, Bruno ; Bevilacqua, Frédéric; Gillies, Marco ; and d'Inverno, Mark . 2014. Fluid gesture interaction design: applications of continuous recognition for the design of modern gestural interfaces. ACM Transactions on Interactive Intelligent Systems, 3(4), 22. ISSN 2160-6455 Customizing by Doing for Responsive Video Game Characters Kleinsmith, Andrea; and Gillies, Marco . 2013. Customizing by Doing for Responsive Video Game Characters. International Journal of Human-Computer Studies, 71(7-8), pp. 775-784. ISSN 1071-5819 Socially Anxious and Confident Men Interact with a Forward Virtual Woman: An Experimental Study Pan, Xueni ORCID logo ; Gillies, Marco ; Barker, Chris; Clark, David M.; and Slater, Mel. 2012. Socially Anxious and Confident Men Interact with a Forward Virtual Woman: An Experimental Study. PLoS ONE, 7(4), e32931. Comparing and Evaluating Real Time Character Engines for Virtual Environments Gillies, Marco ; and Spanlang, Bernhard. 2010. Comparing and Evaluating Real Time Character Engines for Virtual Environments. Presence: Teleoperators and Virtual Environments, 19(2), pp. 95-117. ISSN 1054-7460 Piavca: a framework for heterogeneous interactions with virtual characters Gillies, Marco ; Pan, Xueni ORCID logo ; and Slater, Mel. 2010. Piavca: a framework for heterogeneous interactions with virtual characters. Virtual Reality, 14(4), pp. 221-228. ISSN 1359-4338 Learning Finite State Machine Controllers from Motion Capture Data Gillies, Marco . 2009. Learning Finite State Machine Controllers from Motion Capture Data. IEEE Transactions on Computational Intelligence and AI in Games, 1(1), pp. 63-72. ISSN 1943-068X E-Dram",
  "content_length": 37129,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:43"
}