{
  "name": "Marco Dorigo",
  "homepage": "https://iridia.ulb.ac.be/~mdorigo/HomePageDorigo",
  "status": "success",
  "content": "Marco Dorigo Web Site Marco Dorigo's publications have been cited more than 154,000 times; his h-index is 119 (computed on Google Scholar, 03.10.2025). ORCID: 0000-0002-3971-0507 2026: Honorary Chair for ANTS 2026 - Fifthteenth International Conference on Swarm Intelligence 2024: AI Generated Podcasts from Marco Dorigo's Articles 2024: Honorary Chair for ANTS 2024 - Fourteenth International Conference on Swarm Intelligence 2022: General Chair for ANTS 2022 - Thirteenth International Conference on Swarm Intelligence 2020: Vice-general Chair for DARS 2020 - 15th International Symposium on Distributed Autonomous Robotic Systems 2020: Vice-general Chair for SWARM 2020 - The 4th International Symposium on Swarm Behavior and Bio-Inspired Robotics 2020: General Chair for ANTS 2020 - Twelfth International Conference on Swarm Intelligence 2019: Vice-general Chair for SWARM 2019 - The 3rd International Symposium on Swarm Behavior and Bio-Inspired Robotics 2016: Recipient of the IEEE Evolutionary Computation Pioneer Award 2015: Recipient of the IEEE Frank Rosenblatt Award 2015: Honorary Chair for IEEE SSCI 2015 - Symposium Series on Computational Intelligence 2015: Honorary Doctorate awarded on April 21, 2015, by University of Pretoria 2015: Elected AAAI fellow 2012: Botsker Award for Innovative Technology at the 2012 Robot Film Festival, New York, July 14, 2012 2011: AAAI Best AI Video Award for the Movie \"Swarmanoid, The Movie\" 2010: ERC Advanced Grant awarded to Marco Dorigo for the project \"E-Swarm: Engineering Swarm Intelligence Systems\" On November 27, 2007, Marco Dorigo received the \"CajAstur International Prize for Soft Computing\". Best Video Award at the AAAI-07 AI Video Competition, Vancouver, 2007. In 2007 Springer launched the new journal \"Swarm Intelligence\". Article on \"Swarm Theory\" appeared in the July 2007 issue of the National Geographic Magazine. In 2007 Marco Dorigo was named ECCAI fellow. In 2006 Marco Dorigo was named IEEE fellow. On November 22, 2005, the King of Belgium presented the \"FNRS - Dr A. De Leeuw-Damry-Bourlart award in Applied Sciences\" to Marco Dorigo for his fundamental contributions to the foundation of the swarm intelligence research field. Forthcoming invited talks. Ant Colony Optimization Home page maintained by Marco Dorigo. Swarm-bots Home page of the IST-FET project \"Swarm-bots\" coordinated by Marco Dorigo. ANTS: The International Workshop on Ant Colony Optimization and Swarm Intelligence Home page of the ANTS series of workshops founded by Marco Dorigo. In 2003 Marco Dorigo received European Commission's Marie Curie Excellence Award for his research on Ant Colony Optimization and Ant Algorithms. Swarm intelligence research and book cited in Crichton's novel Prey. Marco Dorigo Agrégé de l'Enseignement Supérieur, Université Libre de Bruxelles, Belgium, 1995. Ph.D. in System and Information Engineering, Politecnico di Milano, Italy, 1992. He is the inventor of the Ant Colony Optimization metaheuristic for combinatorial optimization problems. He is research director for the Belgian Fonds de la Recherche Scientifique. He is co-director of the IRIDIA lab at the Université Libre de Bruxelles. Curriculum Vitae Last updated July 2024 Download PDF file ← Self-organizing Nervous Systems for Robot SwarmsScience Robotics, 2024 Blockchain Technology for Mobile Multi-robot SystemsNature Reviews Electrical Engineering, 2024 Robot swarms neutralize harmful Byzantine robots using a blockchain-based token economyScience Robotics, 2023 Secure and Secret Cooperation in Robot SwarmsScience Robotics, 2021 Swarm Robotics: Past, Present, and FutureProceedings of the IEEE, 2021 Reflections on the future of swarm roboticsScience Robotics, 2020 → Ant Colony OptimizationMIT Press, 2004 Ant Colony Optimization (Chinese transalation)China-Pub.com, 2006 Swarm intelligenceOxford University Press, 1999 Robot Shaping MIT Press, 1998 Special Issue onSwarm Robotics Autonomous Robots, 17 (2-3) Special Section onAnt Colony Optimization IEEE Transactions on Evolutionary Computation, 6 (4) Special Issue onAnt Algorithms Future Generation Computer Systems, 16 (8) Special Issue onLearning Autonomous Robots IEEE Trans. on Systems, Man, and Cybernetics - Part B, 26 (3) Swarm Intelligence ANTS 2024 Springer, 2024 Swarm Intelligence ANTS 2022 Springer, 2022 Swarm Intelligence ANTS 2020 Springer, 2020 Swarm Intelligence ANTS 2018 Springer, 2018 Swarm Intelligence ANTS 2016 Springer, 2016 Swarm Intelligence ANTS 2014 Springer, 2014 Swarm Intelligence ANTS 2012 Springer, 2012 Swarm Intelligence ANTS 2010 Springer, 2010 Ant Colony Optimization and Swarm Intelligence ANTS 2008 Springer, 2008 Ant Colony Optimization and Swarm Intelligence ANTS 2006 Springer, 2006 Ant Colony Optimization and Swarm Intelligence ANTS 2004 Springer, 2004 Ant Algorithms ANTS 2002Springer, 2002 New Ideas in Optimization McGraw-Hill, 1999 Last modified: January 08 2025 12:53:22.",
  "content_length": 4928,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:36"
}