{
  "name": "Marco Aiello",
  "homepage": "https://www.iaas.uni-stuttgart.de/institut/team/Aiello-00001",
  "status": "success",
  "content": "Herr Prof. Dr. Marco Aiello | Institut für Architektur von Anwendungssystemen | Universität Stuttgart zum Inhalt springen zum Footer springen zurück Navigation schließen Für die volle Funktionalität dieser Site ist JavaScript notwendig. Hier finden Sie eine Anleitung zum Aktivieren von JavaScript in Ihrem Browser. Marco Aiello Herr Prof. Dr. AbteilungsleiterInstitut für Architektur von AnwendungssystemenService Computing Kontakt +49 711 685 88464 +49 711 685 88472 E-Mail Universitätsstraße 38 70569 Stuttgart Germany Raum: 1.359 Sprechstunde Bitte im Sekretariat anmelden. Publikationen 20251. Sha, A., Xiong, Z., Zang, X., Zhao, W., Ge, R., Yao, W., Aiello, M.: Full Life-Cycle Cost Model for Practical Application of Solar Energy System. Energy Informatics. (2025).BibTeXBibTeX@article{aiello2025lifecycle, author = {Sha, Ang and Xiong, Zhen and Zang, Xiaolin and Zhao, Wei and Ge, Ruibang and Yao, Wanxiang and Aiello, Marco}, journal = {Energy Informatics}, note = {To appear}, publisher = {Springer}, title = {Full Life-Cycle Cost Model for Practical Application of Solar Energy System}, year = 2025 }2. Li, Y., Guan, P., Li, T., Larsen, K.G., Aiello, M., Pedersen, T.B., Huang, T., Zhang, Y.: Digital Twin for Secure Peer-to-Peer Trading in Cyber-Physical Energy Systems. IEEE Transactions on Network Science and Engineering. 12, 669–683 (2025).BibTeXBibTeX@article{li2025digital, author = {Li, Yushuai and Guan, Peiyuan and Li, Tianyi and Larsen, Kim Guldstrand and Aiello, Marco and Pedersen, Torben Bach and Huang, Tingwen and Zhang, Yan}, journal = {IEEE Transactions on Network Science and Engineering}, number = 2, pages = {669-683}, publisher = {IEEE}, title = {Digital Twin for Secure Peer-to-Peer Trading in Cyber-Physical Energy Systems}, volume = 12, year = 2025 }3. Aiello, M.: A Paradigm Shift in Service Research: The Case of Service Composition. IEEE Transactions on Service Computing. (2025).BibTeXBibTeX@article{aiello2025serviceresearch, author = {Aiello, Marco}, journal = {IEEE Transactions on Service Computing}, note = {To appear}, publisher = {IEEE}, title = {A Paradigm Shift in Service Research: The Case of Service Composition}, year = 2025 }4. Liu, Y., Palmieri, L., Koch, S., Georgievski, I., Aiello, M.: DELTA: Decomposed Efficient Long-Term Robot Task Planning using Large Language Models. In: IEEE International Conference on Robotics and Automation (ICRA). IEEE (2025).BibTeXBibTeX@inproceedings{liu2025:delta, author = {Liu, Yuchen and Palmieri, Luigi and Koch, Sebastian and Georgievski, Ilche and Aiello, Marco}, booktitle = {IEEE International Conference on Robotics and Automation {(ICRA)}}, publisher = {IEEE}, title = {DELTA: Decomposed Efficient Long-Term Robot Task Planning using Large Language Models}, year = 2025 }5. Liu, Y., Lerch, L., Palmieri, L., Rudenko, A., Koch, S., Ropinski, T., Aiello, M.: Context-aware human behavior prediction using multimodal large language models: Challenges and insights. In: International Conference on Robot and Human Interactive Communication (ROMAN). IEEE (2025).BibTeXBibTeX@inproceedings{liu2025:context, author = {Liu, Yuchen and Lerch, Lino and Palmieri, Luigi and Rudenko, Andrey and Koch, Sebastian and Ropinski, Timo and Aiello, Marco}, booktitle = {International Conference on Robot and Human Interactive Communication (ROMAN)}, organization = {IEEE}, title = {Context-aware human behavior prediction using multimodal large language models: Challenges and insights }, year = 2025 }6. Zyberaj, D., Hirmer, P., Aiello, M.: Using Eclipse OpenDuT for Distributed Automotive Testing. In: International Conference on Evaluation and Assessment in Software Engineering (EASE ’25), Association for Computing Machinery, New York, NY, USA (2025).BibTeXLinkBibTeX@inproceedings{zyberaj2025:ease, author = {Zyberaj, Denesa and Hirmer, Pascal and Aiello, Marco}, booktitle = {International Conference on Evaluation and Assessment in Software Engineering (EASE '25), Association for Computing Machinery, New York, NY, USA}, title = {Using Eclipse OpenDuT for Distributed Automotive Testing}, url = {https://doi.org/10.1145/3756681.3757013}, year = 2025 }Linkhttps://doi.org/10.1145/3756681.37570137. Pesl, R.D., Mathew, J.G., Mecella, M., Aiello, M.: Advanced system integration: Analyzing OpenAPI chunking for retrieval-augmented generation. In: International Conference on Advanced Information Systems Engineering (CAiSE). pp. 130–148. Springer (2025).BibTeXBibTeX@inproceedings{pesl2025:caise, author = {Pesl, Robin D and Mathew, Jerin G and Mecella, Massimo and Aiello, Marco}, booktitle = {International Conference on Advanced Information Systems Engineering (CAiSE)}, organization = {Springer}, pages = {130--148}, title = {Advanced system integration: Analyzing OpenAPI chunking for retrieval-augmented generation}, year = 2025 }8. Georgievski, I., Aiello, M.: Initial Steps in Integrating Large Reasoning and Action Models for Service Composition. In: Service-Oriented Computing - 19th Symposium and Summer School. Springer (2025).BibTeXBibTeX@inproceedings{georgievski2025:lrm-lam-asc, author = {Georgievski, Ilche and Aiello, Marco}, booktitle = {Service-Oriented Computing - 19th Symposium and Summer School}, publisher = {Springer}, series = {Communications in Computer and Information Science}, title = {Initial Steps in Integrating Large Reasoning and Action Models for Service Composition}, year = 2025 }9. Caetano, H.d.O., Desuó Neto, L., Aiello, M., Maciel, C.D.: A probabilistic multilayer framework for electric vehicle user behavior in urban areas. In: 2025 IEEE Kiel PowerTech. IEEE (2025).BibTeXBibTeX@inproceedings{caetano2025:probabilistic, author = {Caetano, Henrique de Oliveira and Desu{\\'o} Neto, Luiz and Aiello, Marco and Maciel, Carlos Dias}, booktitle = {2025 IEEE Kiel PowerTech}, organization = {IEEE}, title = {A probabilistic multilayer framework for electric vehicle user behavior in urban areas}, year = 2025 }10. Liu, J., Sun, C.-a., Wu, T., Aiello, M.: Cross-Chain Iot Service Composition: an Adaptive QoS Constraint-Based Approach. In: International Conference on Web Services (ICWS). pp. 637–643. IEEE (2025).BibTeXBibTeX@inproceedings{liu2025:crossicws, author = {Liu, Jiamei and Sun, Chang-ai and Wu, Tong and Aiello, Marco}, booktitle = {International Conference on Web Services (ICWS)}, organization = {IEEE}, pages = {637--643}, title = {Cross-Chain Iot Service Composition: an Adaptive QoS Constraint-Based Approach}, year = 2025 }11. Pesl, R.D., Aiello, M.: Revisiting Lemos’ Taxonomy for Service Compositions with Large Language Models. In: International Conference on Web Services (ICWS). pp. 584–586. IEEE (2025).BibTeXBibTeX@inproceedings{pesl2025:revisitingicws, author = {Pesl, Robin D and Aiello, Marco}, booktitle = {International Conference on Web Services (ICWS)}, organization = {IEEE}, pages = {584--586}, title = {Revisiting Lemos' Taxonomy for Service Compositions with Large Language Models}, year = 2025 }12. Caetano, H.O., Desuó, L., Aiello, M., Maciel, C.D.: A Statistical framework for Electric Vehicle User Behavior impact in Smart Grids. In: 2025 IEEE Kiel PowerTech. pp. 1–6. IEEE (2025).BibTeXBibTeX@inproceedings{caetano2025:statistical, author = {Caetano, Henrique O and Desu{\\'o}, Luiz and Aiello, Marco and Maciel, Carlos Dias}, booktitle = {2025 IEEE Kiel PowerTech}, organization = {IEEE}, pages = {1--6}, title = {A Statistical framework for Electric Vehicle User Behavior impact in Smart Grids}, year = 2025 }13. Liu, J., Sun, C.-a., Wu, T., Aiello, M.: A Verifiable and Low-Latency Cross-Chain IoT Service Query Scheme with Collaborative Indexing. In: International Conference on Web Services (ICWS). pp. 520–530. IEEE (2025).BibTeXBibTeX@inproceedings{liu2025:icws, author = {Liu, Jiamei and Sun, Chang-ai and Wu, Tong and Aiello, Marco}, booktitle = {International Conference on Web Services (ICWS)}, organization = {IEEE}, pages = {520--530}, title = {A Verifiable and Low-Latency Cross-Chain IoT Service Query Scheme with Collaborative Indexing}, year = 2025 }14. Alnazer, E., Georgievski, I., Aiello, M.: Risk-Aware HTN Planning Domain Models for Autonomous Vehicles and Satellites. In: International Conference on AI-based Systems and Services (AISyS). pp. 36–45 (2025).BibTeXLinkBibTeX@inproceedings{alnazer2025:av-satellites, author = {Alnazer, Ebaa and Georgievski, Ilche and Aiello, Marco}, booktitle = {International Conference on AI-based Systems and Services (AISyS)}, pages = {36--45}, title = {Risk-Aware HTN Planning Domain Models for Autonomous Vehicles and Satellites}, url = {https://www.thinkmind.org/articles/aisys_2025_1_50_80022.pdf}, year = 2025 }Linkhttps://www.thinkmind.org/articles/aisys_2025_1_50_80022.pdf15. Caetano, H.d.O., Gupta, R.K., Aiello, M., Maciel, C.D.: A bayesian hierarchical model for generating synthetic unbalanced power distribution grids. In: 2025 IEEE Kiel PowerTech. IEEE (2025).BibTeXBibTeX@inproceedings{caetano2025:bayesian, author = {Caetano, Henrique de Oliveira and Gupta, Raul K. and Aiello, Marco and Maciel, Carlos Dias}, booktitle = {2025 IEEE Kiel PowerTech}, organization = {IEEE}, title = {A bayesian hierarchical model for generating synthetic unbalanced power distribution grids}, year = 2025 }16. Alnazer, E., Georgievski, I., Aiello, M.: Texas Hold’em Meets Risk-Aware HTN Planning: A Modelling and Architectural Perspective. In: Workshop on AI-based Planning for Complex Real-World Applications at the European Conference on Artificial Intelligence (CAIPI) (2025).BibTeXBibTeX@inproceedings{alnazer2025:poker, author = {Alnazer, Ebaa and Georgievski, Ilche and Aiello, Marco}, booktitle = {Workshop on AI-based Planning for Complex Real-World Applications at the European Conference on Artificial Intelligence (CAIPI)}, note = {To appear}, title = {Texas Hold'em Meets Risk-Aware HTN Planning: A Modelling and Architectural Perspective}, year = 2025 }202417. Dinesh Reddy, V., Rao, G.S.V., Aiello, M.: Energy efficient resource management in data centers using imit",
  "content_length": 181266,
  "method": "requests",
  "crawl_time": "2025-12-01 13:51:31"
}