{
  "name": "Marek Rei",
  "homepage": "https://www.marekrei.com",
  "status": "success",
  "content": "Marek Rei Marek Rei About Publications Teaching Projects Blog I am a researcher in Machine Learning and Natural Language Processing. My work investigates new architectures and optimization methods for language modelling and multimodal representations. I am an Associate Professor of Machine Learning at Imperial College London and a Visiting Researcher at the University of Cambridge. I am an AI Advisor for Locai Labs and Esgrid Technologies, and I provide consultancy services through Perception Labs. Previously, I did a post-doc in Cambridge and worked in the Research team at SwiftKey, where we developed experimental technologies for language modeling and natural language processing. One of my main projects was the neural network language model for text prediction. SwiftKey has since been acquired by Microsoft. I received my PhD at the University of Cambridge, in Churchill College, with my thesis on Minimally supervised dependency-based methods for natural language processing, under the supervision of Professor Ted Briscoe. Before that, in 2008-2009 I did an MPhil course in the Computer Lab, called Computer Speech, Text and Internet Technology. The topic of my dissertation was Adaptive Interactive Information Extraction. I also studied three years at Tallinn University of Technology where I got my bachelor's degree with the thesis Creating a Model for Audiovisual Speech in Estonian. Download: My CV Research interests My main areas of interest currently include: planning and reasoning with LLMs models explainability and uncertainty of ML models modelling of medical and healthcare data extraction and structuring of information from unstructured text grammatical error correction and essay scoring I provide consultancy services in the areas of machine learning and natural language processing. If you are interested, feel free to get in touch. Contact E-mail: marek@marekrei.com Publications Reverse Engineering Human Preferences with Reinforcement Learning [arxiv] Lisa Alazraki, Tan Yi-Chern, Jon Ander Campos, Maximilian Mozes, Marek Rei, Max Bartolo The Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS 2025) *spotlight paper* San Diego, United States, 2025 No Need for Explanations: LLMs can implicitly learn from mistakes in-context [arxiv] Lisa Alazraki, Maximilian Mozes, Jon Ander Campos, Yi Chern Tan, Marek Rei, Max Bartolo In Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025) Suzhou, China, 2025 Fine-tuning with RAG for Improving LLM Learning of New Skills [arxiv] Humaid Ibrahim, Nikolai Rozanov, Marek Rei under review 2025 The “Question Neighbourhood” Approach for Systematic Evaluation of Code-Generating LLMs [link] Shahin Honarvar, Marek Rei, Alastair Donaldson IEEE Transactions on Software Engineering 2025 Predictive Multimodal Modeling of Diagnoses and Treatments in EHR [arxiv] Cindy Shih-Ting Huang, Clarence Boon Liang Ng, Marek Rei Proceedings of the 1st Workshop on Multimodal Large Language Models (MLLMs) in Clinical Practice (MICCAI MLLMs workshop 2025) Daejeon, Republic of Korea, 2025 AgentCoMa: A Compositional Benchmark Mixing Commonsense and Mathematical Reasoning in Real-World Scenarios [arxiv] Lisa Alazraki, Lihu Chen, Ana Brassard, Joe Stacey, Hossein A. Rahmani, Marek Rei under review ArXiv, 2025 How to Improve the Robustness of Closed-Source Models on NLI [arxiv] J Stacey, L Alazraki, A Ubhi, B Ermis, A Mueller, M Rei under review ArXiv, 2025 Enhancing LLM Robustness to Perturbed Instructions: An Empirical Study [arxiv] Aryan Agrawal, Lisa Alazraki, Shahin Honarvar, Marek Rei ICLR 2025 Workshop - Building Trust in LLMs and LLM Applications: From Guardrails to Explainability to Regulation Singapore, 2025 Assessing the effectiveness of interdependent corporate sustainability choices [link] Simone Cenci, Matteo Burato, Marek Rei, Maurizio Zollo npj Climate Action (Nature) 2025 KU AIGEN ICL EDI@ BC8 Track 3: Advancing Phenotype Named Entity Recognition and Normalization for Dysmorphology Physical Examination Reports [arxiv] Hajung Kim, Chanhwi Kim, Jiwoong Sohn, Tim Beck, Marek Rei, Sunkyu Kim, T Ian Simpson, Joram M Posma, Antoine Lain, Mujeen Sung, Jaewoo Kang ArXiv, 2025 Automatic genetic phenotype normalization from dysmorphology physical examinations: an overview of the BioCreative VIII—Task 3 competition [link] Davy Weissenbacher, Xinwei Zhao, Jessica RC Priestley, Katherine M Szigety, Sarah F Schmidt, Karen O'Connor, Ekin Soysal, Kirk Roberts, Jiewei Qi, Ling Luo, Zhihao Yang, Hongfei Lin, Hajung Kim, Chanhwi Kim, Jiwoong Sohn, Tim Beck, Marek Rei, Sunkyu Kim, T Ian Simpson, Joram M Posma, Antoine Lain, Mujeen Sung, Jaewoo Kang, Areej Alhassan, Viktor Schlegel, Monira Aloud, Riza Batista-Navarro, Goran Nenadic, Ying-Jia Lin, Zhi-Quan Feng, Hung-Yu Kao, Ian M Campbell, Graciela Gonzalez-Hernandez Database 2025 High-precision Biomedical Text Corpora for Multi-Entity Recognition: A CoDiet study [biorxiv] Antoine D Lain, Stephanie Go, Alisha Mahmud, Shruti Rajendra, Ainara Cano San Jose, Katerina Loupasaki, Georgios Theodoridis, Maider Bizkarguenaga Uribiarte, Yajie Gu, Olga Deda, Ricardo Diogo Alves Conde, Nieves Embade, Angela de Diego Rodriguez, Nerea Burguera, Danai Rossiou, Ruben Gil Redondo, Domniki Gallou, Itziar Tueros, Rakesh Velmurugan, Vasiliki Gkanali, Mercedes Caro Burgos, Petros Pousinis, George Alektoridis, Sara Arranz, Nasos Nikolopoulos, Xingchen Yan, Rebeca Fernandez Carrion, Thomas Rowlands, Donghee Choi, Marek Rei, Chris Cave-Ayland, Adrian D Alessandro, CoDiet consortium, Tim Beck, Joram M Posma bioRxiv, 2025 DiffuseDef: Improved Robustness to Adversarial Attacks via Iterative Denoising [arxiv] [link] Zhenhao Li, Huichi Zhou, Marek Rei, Lucia Specia In Proceedings of the 63nd Annual Meeting of the Association for Computational Linguistics (ACL 2025) Vienna, Austria, 2025 Meta-Reasoning Improves Tool Use in Large Language Models [arxiv] [link] Lisa Alazraki, Marek Rei Findings of the Association for Computational Linguistics: NAACL 2025 Albuquerque, New Mexico, 2025 SoK: Membership Inference Attacks on LLMs are Rushing Nowhere (and How to Fix It) [arxiv] Matthieu Meeus, Igor Shilov, Shubham Jain, Manuel Faysse, Marek Rei, Yves-Alexandre de Montjoye IEEE Conference on Secure and Trustworthy Machine Learning (SaTML 2025) *Best paper award* Copenhagen, Denmark, 2025 StateAct: Enhancing LLM Base Agents via Self-prompting and State-tracking [arxiv] Nikolai Rozanov, Marek Rei In Proceedings of the Workshop for Research on Agent Language Models (REALM 2025) Vienna, Austria, 2025 Atomic Inference for NLI with Generated Facts as Atoms [arxiv] [link] [blog] [pdf] Joe Stacey, Pasquale Minervini, Haim Dubossarsky, Oana-Maria Camburu, Marek Rei In Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024) Miami, USA, 2024 Distilling Robustness into Natural Language Inference Models with Domain-Targeted Augmentation [arxiv] [link] [pdf] [video] Joe Stacey, Marek Rei In Findings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024) Bangkok, Thailand, 2024 Continuous Predictive Modeling of Clinical Notes and ICD Codes in Patient Health Records [arxiv] [link] [pdf] Mireia Hernandez Caralt, Clarence Boon Liang Ng, Marek Rei In Proceedings of the Biomedical Natural Language Processing Workshop (BioNLP 2024) Bangkok, Thailand, 2024 Predicting cell type-specific epigenomic profiles accounting for distal genetic effects [link] [biorxiv] Alan E Murphy, William Beardall, Marek Rei, Mike Phuycharoen, Nathan G Skene Nature Communications 2024 Prompting open-source and commercial language models for grammatical error correction of English learner text [arxiv] [link] [pdf] Christopher Davis, Andrew Caines, Øistein Andersen, Shiva Taslimipoor, Helen Yannakoudakis, Zheng Yuan, Christopher Bryant, Marek Rei, Paula Buttery In Findings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024) Bangkok, Thailand, 2024 Did the Neurons Read your Book? Document-level Membership Inference for Large Language Models [arxiv] Matthieu Meeus, Shubham Jain, Marek Rei, Yves-Alexandre de Montjoye The 33rd USENIX Security Symposium (2024) Philadelphia, PA, USA, 2024 The alignment of companies' sustainability behavior and emissions with global climate targets [link] Simone Cenci, Matteo Burato, Marek Rei, Maurizio Zollo Nature Communications, 2023 When and Why Does Bias Mitigation Work? [link] [pdf] Abhilasha Ravichander, Joe Stacey, Marek Rei In Findings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP 2023) Singapore, 2023 Competitive Pressure and Emission Reduction: Unravelling the Link [link] Simone Cenci, Hossein Asgharian, Lu Liu, Marek Rei, Maurizio Zollo SSRN, 2023 Climbing empirical fitness landscapes requires companies to manage interconnected sustainability choices [link] Simone Cenci, Matteo Burato, Marek Rei, Maurizio Zollo SSRN 2023 Finding the Needle in a Haystack: Unsupervised Rationale Extraction from Long Text Classifiers [arxiv] Kamil Bujel, Andrew Caines, Helen Yannakoudakis, Marek Rei ArXiv, 2023 Does competitive pressure drive effective corporate environmental actions? [link] Simone Cenci, Hossein Asgharian, Lu Liu, Marek Rei, Maurizio Zollo SSRN 2023 On the application of Large Language Models for language teaching and assessment technology [arxiv] Andrew Caines, Luca Benedetto, Shiva Taslimipoor, Christopher Davis, Yuan Gao, Oeistein Andersen, Zheng Yuan, Mark Elliott, Russell Moore, Christopher Bryant, Marek Rei, Helen Yannakoudakis, Andrew Mullooly, Diane Nicholls, Paula Buttery In Proceedings of the AIED 2023 Workshop on Empowering Education with LLMs (AIED LLM 2023) Tokyo, Japan, 2023 Modelling Temporal Document Sequences for Clinical ICD Coding [pdf] Clarence Ng, Diogo Santos, Marek Rei In Proceedings of the 17th Conference of the European Chapter of the Association for Computational Lin",
  "content_length": 24357,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:12"
}