{
  "name": "Margrit Betke",
  "homepage": "https://www.cs.bu.edu/faculty/betke",
  "status": "success",
  "content": "Margrit Betke's Homepage at Boston University PhD applicants: No new students AI & Emerging Media BU AIR @ HIC OLD Camera Mouse Website Women in CS Margrit Betke, Professor, Department of Computer Science Short Bio and Funding, Memories Long CV On Wikipedia Education: Ph.D. in Computer Science and Electrical Engineering, Massachusetts Institute of Technology Research: Computer vision, human-computer interfaces, medical image analysis, machine learning, AI. Sample projects: Exciting news: We have a new Camera Mouse!!! You can try it out by downloading the Windows executable of the Boston University Camera Mouse. More info at our GitHub page of the BU Camera Mouse, Video-based interfaces for people with disabilities. The Camera Mouse enables a person with severe disabilities to control the mouse pointer on the computer screen just by moving their head. AI for Diagnosing Infant Pneumonia in Resource Limited Settings, Summer 2025, Fri 11 am, zoom Artificial Intelligence & Emerging Media (AIEM), Group meetings, Summer 2025, Tue 9-10 EST on zoom (link managed by Ge Gao). AI-Aphasia Research, Group meetings, Spring 2025, Mon 3-4, Constant Therapy project. Pose estimation, Spring 2025, Mon noon, my zoom room. AI Research Initiative: Seminars, Spring 2025, Wed 1-2 pm. Usually CDS 1101. Publications: Recent publications and full list of publications, Google Scholar profile, Semantic Scholar, ACM Digital Library profile, DBLP profile, https://orcid.org/0000-0002-4491-6868 Students: Current PhD students: Ge Gao (co-advised with Derry Wijaya), Mahir Patel (co-advised with Bryan Plummer). My 18 graduated PhD students: Yiwen Gu, Wenda Qin, Kaihong Wang, Hao Yu, Sha Lai (Stan), (co-advised with Prakash Ishwar). Yi Zheng (co-advised with Vijaya Kolachalama). Elham Saraee, Ajjen Joshi, Wenxin Feng, Andrew Kurauchi, (co-advised with Carlos Morimoto). Mehrnoosh Sameki, Mikhail Breslav, Danna Gurari, Diane Hirshh Theriault, Zheng Wu, John Magee, William Mullally, Jingbin Wang. Recent visiting PhD student: Umair Khan. Recent MS research students: Saunak Bhattacharjee, Sarah Bonner, Srishti Jain, Alex (Hantian) Liu, and Farid Karimli. Recent UROP students: Alex Lavaee, Junyi Li, Chloe Valcourt, Jialin Yu, Student Awards. Former Postdocs: Randa Elanwar and Zheng Wu. Teaching: Artificial Intelligence (CS 640) in Fall 2024, Room CGS 516, Tue, Thu 11:00 - 12:15 pm Image and Video Computation (CS 585) in Spring 2024, Room CS 224, Tue/Thu 5-6:15 pm Geometric Algorithms (CS 132) in Fall 2010 Graduate Initiation Seminar (CS 697) in Spring 2018. In Spring 2023: Mon 10:05-10:55, CDS 701. Directed Study in Image and Video Computing: CAS CS 491, GRS CS 941, or GRS CS 979, or Directed Study in AI: GRS CS 940, ongoing. Office Hours: By arrangement. Zoom link: https://bostonu.zoom.us/my/margritbetke Honors & Awards: HERS Leadership Institute Award, Wellesley Class of 2018. Elected to Senior Member of the ACM and Senior Member of the IEEE in October 2012. One of two academics to win the \"Top 10 Women to Watch in New England\" Award in 2005. Many sponsored students and researchers have won awards. In the News: Nov. 10, 2023: 7 Investigates: Voice Cloning. Feb. 2, 2022: ML reveals new factor for predicting a stroke survivor’s ability to regain language skills Communicating COVID-19, Video of Presentation at CRA Conference 2020 (< 4 min) Can the U.S. win the A.I. arms race? Interview by Futurity, March 4, 2019. Google Award, Group Behavior Award. Camera Mouse: Video Interview, BU, Kablenet, Belfast Telegraph, MassHighTech, Bradford Telegraph & Argus Empathic Painting: BBC, ABC News, SydneyMH, The Hindu, DigitalWorld Tokyo, Inky, Canada TecChannel - München, Frontpage - Netherlands Patent: \"Method and system for the detection, comparison and volumetric quantification of pulmonary nodules on medical computed tomography scans.\" Inventors Margrit Betke and Jane P. Ko., US Patent 7,206,462, issued on April 17, 2007. Editor: Former Associate Editor, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) Book: M. Betke and Z. Wu. 2016. Data Association for Multi-Object Visual Tracking. Morgan & Claypool Lecture Series on Computer Vision. 120 pages. Recent Publications: Journal Papers: Xinyi Hu, Maria Varkanitsa, Emerson Kropp, Margrit Betke, Prakash Ishwar, and Swathi Kiran (2025). Aphasia severity prediction using a multimodal machine learning approach. NeuroImage, Volume 317, 15 August 25, 121300. DOI: 10.1016/j.neuroimage.2025.121300 Yanru Jiang, Sha Lai, Lei Guo, Prakash Ishwar, Derry Wijaya, Margrit Betke (2025). Exploring an alternative computational approach for news framing analysis through community detection in framing element networks. Journalism & Mass Communication Quarterly. Randa Elanwar and Margrit Betke (2025). Generative adversarial networks for handwriting image generation: A review. The Visual Computer 41 (4): 2299-2322. DOI: 10.1007/s00371-024-03534-9. Peer-reviewed Conference Papers: Kaihong Wang et al. LoRA-Loop: Closing the Synthtic Replay Cycle for Continual VLM Learning. To be presented at The 4th DataCV Workshop and Challenge at the International Conference on Computer Vision, Honolulu, Hawaii, October 19-23, 2025. Ge Gao, Zhengyang Shan, James Crissman, Ekaterina Novozhilova, Yu-Cheng Huang, Arti Ramanathan, Margrit Betke, and Derry Wijaya. Insights into Climate Change Narratives: Emotional Alignment and Engagement Analysis on TikTok. The 4th Workshop on NLP for Positive Impact at the 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025), July 31, 2025. Best Paper Award Farid Karimli and Margrit Betke. Enhancing Text Entry for Users with Motor Impairments: Design and Evaluation of KeyGlide. The 18th International Conference on PErvasive Technologies Related to Assistive Environments (PETRA), Corfu, Greece, June 2025. Peer-reviewed Conference Abstracts and Short Papers: Saunak Bhattacharjee, Umair Khan, Russell Thompson, Lauren P. Etter, Ingrid Camelo, Rachel C. Pieciak, Ilse Castro-Aragon, Bindu Setty, Christopher C. Gill, and Margrit Betke. Unveiling bias in AI model training data: Exploring the impact of intrinsic data variability on lung ultrasound video classification models. Oral presentation at the Conference on Machine Intelligence in Medical Imaging (CMIMI), Boston, MA, October 21-22, 2024. Short paper pdf. Srishti Jain, Umair Khan, Russell Thompson, Lauren P. Etter, Ingrid Camelo, Rachel C. Pieciak, Ilse Castro-Aragon, Bindu Setty, Christopher C. Gill, and Margrit Betke. Comparative Evaluation of Computationally Efficient and Explainable 1D Brightness Profiles From Axial Projections for Lung Ultrasound Frame Classification. Poster presentation at the Conference on Machine Intelligence in Medical Imaging (CMIMI), Boston, MA, October 21-22, 2024. Short paper pdf. Saunak Bhattacharjee, Umair Khan, Russell Thompson, Lauren P. Etter, Ingrid Camelo, Rachel C. Pieciak, Ilse Castro-Aragon, Bindu Setty, Christopher C. Gill, and Margrit Betke. Comparing Classic to State-of-the-Art Image Features: A Clustering Approach Using Local Binary Patterns and ResNet-18 Features for Lung Ultrasound Video Classification. Poster presentation at the Conference on Machine Intelligence in Medical Imaging (CMIMI), Boston, MA, October 21-22, 2024. Short paper pdf. Russell Thompson, Umair Khan, Lauren Etter, Ingrid Camelo, Rachel Pieciak, Ilse Castro-Aragon, Bindu Setty, Christopher Gill, Libertario Demi, and Margrit Betke. Anomaly Detection In Pediatric Lung Ultrasound Using Consistency BiGAN. Oral presentation at the International Lung Ultrasound Symposium (ILUS2023), Trento, Italy, 10-12 July, 2023. Technical Reports: Mahir Patel, Lucas Carstensen, Yiwen Gu, Michael E. Hasselmo, and Margrit Betke. BU-CVKit: Extendable Computer Vision Framework for Species Independent Tracking and Analysis. 5 pages. https://arxiv.org/abs/2306.04736, June 2023. Ge Gao, Jongin Kim, Sejin Paik, Ekaterina Novozhilova, Yi Liu, Sarah T. Bonna, Margrit Betke, and Derry Tanti Wijaya. Enhancing Emotion Prediction in News Headlines: Insights from ChatGPT and Seq2Seq Models for Free-Text Generation. 12 pages. https://arxiv.org/abs/2407.10091, July 2024. Zijian Chen, Maria Varkanitsa, Prakash Ishwar, Janusz Konrad, Margrit Betke, Swathi Kiran, and Archana Venkataraman. A Lesion-aware Edge-based Graph Neural Network for Predicting Language Ability in Patients with Post-stroke Aphasia. 10 pages. https://arxiv.org/abs/2409.02303, September 2024. Yiwen Gu, Mahir Patel, and Margrit Betke. ExeChecker: Where Did I Go Wrong? 18 pages. https://arxiv.org/abs/2412.10573, December 2024. Earlier Publications: Journal Articles Conference Papers Book Chapters Abstracts Technical Reports Videos Margrit Betke, Professor Computer Science Department Boston University 665 Commonwealth Ave, CDS Room 827 Boston, MA 02215 ( campus map , Fly around and through our new building ) Email: betke @ cs.bu.edu URL: http://www.cs.bu.edu/faculty/betke Phone: 617-353-8919 Zoom: https://bostonu.zoom.us/j/6510753330 Last updated: July 14, 2025",
  "content_length": 9054,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:14"
}