{
  "name": "Margaret M. Burnett",
  "homepage": "http://eecs.oregonstate.edu/~burnett",
  "status": "success",
  "content": "Margaret M. Burnett ! Margaret M. Burnett Distinguished Professor School of Electrical Engineering and Computer Science Oregon State University Corvallis, Oregon, 97331-5501, USA email: my-last-name at eecs dot oregonstate dot edu voice: 541-737-2539, FAX: 541-737-1300 office location: Kelley Engineering Center, 3051 Zoom location: https://tinyurl.com/MargaretBurnettZoom Zoom Passcode: If you're in one of my classes, see the class Canvas page for this information. If you aren't in my classes, send me email for the passcode. News Oct. 2025: Funders here in the U.S. supporting inclusivity research are now rare and overwhelmed. So the university let me add a donate button. If you want to help me enable my research students to stay in school, feel free to donate (goes to my research account at the OSU Foundation). Here's what we work on: Donate to my research & students Our initial inclusive design work resulted in GenderMag an inclusive design method that increases gender equity and cognitive style equity in technology user experiences. Now used in over 70 countries. We are now working on increasing technology's socioeconomic (SES) equity as well. First paper came out in 2025: Measuring SES-related traits relating to technology usage: Two validated surveys. We are working to make CS Education more gender-inclusive and SES-inclusive too. Most recent paper: How We Did It: Integrating Inclusive Design across the Undergraduate Computer Science Curriculum. We are interested in how techniques like GenderMag and SocioeconomicMag can contribute to intersectional HCI. First paper came out in 2025: Intersectional HCI on a budget: An analytical approach powered by types. Also working on inclusive AI. First paper: Measuring user experience inclusivity in Human-AI Interaction via five user problem-solving styles. Best Paper award! Sept. 2025: I'm back from sabbatical am proud to say my sabbatical visits helped chnge some corners of the world in large or small ways. I have several new/updated talks available through the ACM Distinguished Speakers program: https://speakers.acm.org/speakers/burnett_3543. Still happy to visit you when I can -- invite me! May 2025: Just back from a wonderful trip to Helsinki and Tampere, sponsored by the Helsinki Distinguished Lecture. One talk I gave there was Mission: To enable diverse mere mortals to assess an AI agent's \"goodness\" for their own needs. October 2024: Thanks to all my new Brazilian friends for a wonderful experience keynoting on SocioeconomicMag at the XXIII Brazilian Symposium on Human Factors in Computing Systems. The audience's genuine warmth and enthusiasm made this a joy to be part of. Thank you! September 2024: Delighted to have been awarded a Most Influential Paper award at IEEE VLHCC'24, for our jointly authored 2014 paper on Michael Lee's dissertation about Gidget. Principles of a debugging-first puzzle game for computing education by Michael Lee, Faezeh Bahmani, Irwin Kwan, Jilian Laferte, Polina Charters, Amber Horvath, Fanny Luor, Jill Cao, Catherine Law, Michael Beswetherick, Sheridan Long, Margaret Burnett, Amy Ko. Congrats to all authors, and especially to Michael for his impactful dissertation research! March 2024: I'm excited to be keynoting at ACM IUI. Looking forward to seeing everyone there in South Carolina. December 2023: I'll be keynoting at ACM ESEC/FSE in San Francisco. Sept 27, 2023: Just announced! I'm the 2023 winner of the ABIE Tech Leader Award, given by AnitaB.org at Grace Hopper! Here's an interview talking about this award. Sept 2023: I'm speaking on how Making Tech Gender-Inclusive Can Change the World at the Grace Hopper Celebration\\this week. I'll be on stage on Wednesday, Sept. 27, at 4:00 in the Chapin Theater. July 2023: Looking forward to keynoting at IEEE VL/HCC this October in Washington DC. Topic: Some outside-the-box perspectives on who/why/how of low-code programming. March 2023: Very proud to see the 2023 Microsoft Inclusive Design-for-Cognition Guidebook, which mentions how they've leveraged our inclusive design research (as in GenderMag, InclusiveMag, etc.) in their latest inclusive design process guidance. March 2023: I'm joining ACM TOSEM's Editorial Board. Please send in your research papers on human aspects of software engineering! January 2023: Thanks to enormous help from OSU's Ecampus, OSU now offers a free on-line course on GenderMag. Passing the first two modules certifies that you can use GenderMag, and passing the last two modules also certifies that you can teach/train others to use GenderMag. More info here, or jump right into the Free Canvas course. Sept 2022: Very honored to have just received the \"Most Influential Paper Award\" at IEEE VL/HCC'22, for the long-term impact of our paper from 2011: Modeling Programmer Navigation: A head-to-head empirical evaluation of predictive models, by David Piorkowski, Scott D. Fleming, Christopher Scaffidi, Liza John, Christopher Bogart, Bonnie E. John, Margaret Burnett, Rachel Bellamy. May 2022: I'm proud to have received the 2022 IEEE CS TCSE Distinguished Women in Science and Engineering (WISE) Leadership Award. The award was presented at the ACM/IEEE ICSE conference. Feb. 2022: I'm an ACM Distinguished Speaker again. If you would like me to give a talk on GenderMag, SocioEconomicMag, or the InclusiveMag family of inclusive design methods (and you meet ACM's other criteria), ACM will pay for my airfare to do so. April 2021: Honored to be receiving ACM IUI's Highest Impact Award, for our 2015 IUI paper: Principles of Explanatory Debugging to Personalize Interactive Machine Learning, by Todd Kulesza, Margaret Burnett, Weng-Keen Wong, and Simone Stumpf. Come see our talk and panel at IUI on April 17! March 2021: Presenting a keynote on March 15 at ACM SIGUCCS on how universities can improve the equity and inclusion of their own IT. Registration is free this year! August 2020: The United Nations meets GenderMag! See the August 2020 UNESCO report on Artificial Intelligence and Gender Equality. Jan. 2020: Here's the recording of the Carnegie-Mellon University colloquim on Doing Inclusive Design I gave earlier this month. Bio, Research, and Interests Margaret Burnett is a Distinguished Professor at Oregon State University. She began her career in industry, where she was the first woman software developer ever hired at Procter & Gamble Ivorydale. A few degrees and start-ups later, she joined academia, with a research focus on people who are engaged in some form of software development. She was the principal architect of the Forms/3 and FAR visual programming languaes, and co-founded the area of end-user software engineering, which aims to improve software for computer users who are not trained in programming. Her end-user software engineering work included producing seminal work in actionably explaining AI to ordinary end users. She co-leads the team that created GenderMag, a software inspection process that uncovers gender inclusiveness issues in software from spreadsheets to programming environments. Her newest projects related to GenderMag include the InclusiveMag meta-method, SocioeconomicMag, and a new analytical approach to intersectionally inclusive software. Burnett is an ACM Fellow, a member of the ACM CHI Academy, and an award-winning mentor. She has served in over 50 conference organization and program committee roles. She was recently honored with the 2022 IEEE CS TCSE Distinguished Women in Science and Engineering (WISE) Leadership Award and the Grace Hopper Conference's ABIE Tech Leader Award. Recent talks Mission: To enable diverse mere mortals to assess an AI agent's \"goodness\" for their own needs, given in May 2025. The talk concludes about 49 minutes, which is folloewed by about 25 minutes of Q&A. Here's the recording of the CMU talk on \"Doing Inclusive Design: From GenderMag to InclusiveMag\" I gave in January 2020. This is probably my favorite video on the GenderMag method. (Length: about 1 hour including Q&A). Podcast: Here's an OSU \"Engineering Out Loud\" interview on my research on gender-inclusive software. The NSF Science360 radio is featuring it. Distinguished Prof Lecture: Here's my Distinguished Professor Lecture on Gender-Inclusive Software. (The actual talk starts around 3 minutes 45 seconds in.) More Information The GenderMag method to help software developers & usability professionals find and fix software features with gender-inclusiveness “bugs”. My CV (pdf). A downloadable headshot for publicity purposes. My papers. Google Scholar profile. Upcoming Presentations and Events You can hear about some of the projects I've been working on lately at one of these events: March 2024: I'll be keynoting at ACM IUI in South Carolina. December 2023: I'll be keynoting at ACM ESEC/FSE in San Francisco. October 2023: I'm keynoting at IEEE VL/HCC in Washington DC. Topic: Some outside-the-box perspectives on who/why/how of low-code programming. September 2023: I'm speaking on how Making Tech Gender-Inclusive Can Change the World at the Grace Hopper Celebration\\ this week. I'll be on stage on Wednesday, Sept. 27, at 4:00 in the Chapin Theater. I'm an ACM Distinguished Speaker again. If you would like me to give a talk on gender-inclusive software (and you meet ACM's other criteria), ACM will pay for my airfare to do so. Teaching This year I'm teaching: Fall 2025: CS 468/568: (HCI 2) Inclusive Design with Personas. This course is offered every year. Here is the class Canvas site. Winter-Spring 2025: TBA Recently, I've also taught: CS/ECE 507: EECS Professionalism, Ethics, & Diversity (Fall 2016). CS519: Personas Methods in HCI and User-Centered Design (Winter 2015). CS 569/589: Special topics: Empirical lab studies of software development (Winter 2014). This course will cover how you go about designing, preparing for, running, analyzing, and writing-for-publication lab experiments of programming situations involving human subjects. This is an end-to-end coverage of the ",
  "content_length": 13189,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:15"
}