{
  "name": "Margaret-Anne D. Storey",
  "homepage": "https://margaretannestorey.wordpress.com",
  "status": "success",
  "content": "Margaret-Anne Storey | Professor of Computer Science, University of Victoria Home About Me Activities Prospective Students Research Talks Teaching Contact Margaret-Anne Storey Professor of Computer Science, University of Victoria Feeds: Posts Comments New website! January 9, 2017 by margaretannestorey I’m in the process of setting up a brand new website at http://margaretstorey.com/.  See http://margaretstorey.com/ for more recent content (as of November 2016)! Posted in Uncategorized | \t\t\t\t\t\t\t\t\t\t\tLeave a Comment » The Emergence of GitHub as a Collaborative Platform for Education October 28, 2014 by margaretannestorey Posted in Uncategorized | \t\t\t\t\t\t\t\t\t\t\tLeave a Comment » Visualization for Software Analytics September 28, 2014 by margaretannestorey I gave an invited talk at the Vissoft Conference in beautiful Victoria, B.C. (collocated with ICSME2014) on Sept 29th. Slides are posted here:  http://www.slideshare.net/mastorey/visualization-for-software-analytics Abstract The popularity of software visualization research over the past 30 years has led to innovative techniques that are now seeing widespread adoption by professional software practitioners. But this research has barely kept pace with some of the radical changes occurring in software engineering today. In this talk, I explore current trends in software engineering, including the prevalence of software ecosystems and software delivery as a service, and the emergence of the social coder within a participatory development culture. I will also discuss how the field of software analytics has matured and seeks to support practitioners in improving software quality, user experience and developer productivity through data-driven tasks. Finally, I suggest that software visualization should be playing a bigger role in these recent trends, emphasizing that interactive visualizations are poised to play a critical role in the field of software analytics. Posted in Uncategorized | \t\t\t\t\t\t\t\t\t\t\tLeave a Comment » Call for Papers — FSE 2014 February 3, 2014 by margaretannestorey The 22nd ACM SIGSOFT International Symposium on the Foundations of Software Engineering (FSE 2014) will be held in Hong Kong, China between November 16 and November 22, 2014. Hong Kong is a lively place with a beautiful harbor and landscape. It is a city internationally known for its finance, shopping, and food with a good mix of Eastern and Western cultures. FSE is an internationally renowned forum for researchers, practitioners, and educators to present and discuss the most recent innovations, trends, experiences, and challenges in software engineering. Papers are due March 16th!   We look forward to your submissions!   Learn more... Posted in Uncategorized | \t\t\t\t\t\t\t\t\t\t\tLeave a Comment » The love-hate relationship developers have with Twitter! November 27, 2013 by margaretannestorey We recently conducted a survey with over 1,400 developers to find out how they use Twitter or why they reject it.   The questions we asked were based on an earlier survey with 271 developers and 27 interviews.   We discovered why some love it, why some do not, and also found out what kinds of strategies developers use to improve Twitter use.  Here is a brief snapshot of the results. Why some developers love Twitter 677 DEVELOPERS SAID IT HELPS THEM LEARN ABOUT TECHNOLOGIES THEY DIDN’T PREVIOUSLY KNOW ABOUT 673 DEVELOPERS SAID IT HELPS THEM STAY CURRENT WITH THE TECHNOLOGIES AND PRACTICES THEY NEED TO USE 627 SAID IT HELPED THEM CONNECT WITH INTERESTING DEVELOPERS 541 SAID IT HELPS THEM PROMOTE PROJECTS AND TECHNOLOGIES 452 USED TWITTER TO BUILD TRUST AND RAPPORT WITH OTHER DEVELOPERS 401 USED TWITTER TO GAIN USEFUL FEEDBACK ON THEIR WORK 381 SAID IT HELPED IN COMMUNITY BUILDING and… 291 SAID TWITTER HELPED THEM TO BECOME BETTER PROGRAMMERS 260 SAID IT HELPED WITH JOB OPPORTUNITIES Why some developers resist Twitter 356 DEVELOPERS FOUND IT TO BE OVERWHELMING 110 DEVELOPERS DO NOT APPRECIATE THE 140 CHARACTER LIMIT What strategies should developers on Twitter use BUILD A RELEVANT NETWORK ORGANICALLY BY… DECIDING CAREFULLY WHO TO FOLLOW FOLLOW AND RETWEET THOUGHT LEADERS FOLLOW ON A TRIAL BASIS AND REEVALUATE FREQUENTLY SHARE WHAT YOU LEARN ABOUT TECHNOLOGY AND RELATED PRACTICES SWITCH TO OTHER CHANNELS FOR LONGER DISCUSSIONS But what do you think?  Do YOU think developers should use Twitter?  Do you love or hate Twitter? Comment below! Want to read more?  See a longer blog post here  and an even longer paper here, or participate in our latest survey about social media in software development. Posted in Uncategorized | \t\t\t\t\t\t\t\t\t\t\t2 Comments » How do YOU develop software? November 19, 2013 by margaretannestorey Posted in Uncategorized | \t\t\t\t\t\t\t\t\t\t\tLeave a Comment » Addressing Cognitive and Social Challenges in Designing and Using Ontologies in the Biomedical Domain (Keynote @SLE2012) November 14, 2012 by margaretannestorey The following show the slides and abstract for a keynote presented at SLE (Software Language Engineering) 2012 in Dresden, Germany on September 28th, 2012. KEYNOTE TITLE: Addressing Cognitive and Social Challenges in Designing and Using Ontologies in the Biomedical Domain ABSTRACT: Ontologies can provide a conceptualization of a domain leading to a common vocabulary for communities of researchers and important standards to facilitate computation, software interoperability and data reuse. Most successful ontologies, especially those that have been developed by diverse communities over long periods of time, are typically large and complex. To address this complexity, ontology authoring and browsing tools must provide cognitive support to improve comprehension of the many concepts and relationships in ontologies. Also, ontology tools must support collaboration as the heart of ontology design and use is centered on community consensus. In this talk, I will describe how standardized ontologies are developed and used in the biomedical and clinical domains to aid in scientific and medical discoveries. Specifically, I will present how the US National Center for Biomedical Ontology has designed the BioPortal ontology library (and associated technologies) to promote the use of standardized ontologies and tools. I will review how BioPortal and other ontology tools use established and novel visualization and collaboration approaches to improve ontology authoring and data curation activities. I will also discuss an ambitious project by the World Health Organization that leverages the use of social media to broaden participation in the development of the next version of the International Classification of Diseases. To conclude, I will discuss the challenges and opportunities that arise from using ontologies to bridge communities that manage and curate important information resources. Posted in Uncategorized | \t\t\t\t\t\t\t\t\t\t\t1 Comment » The Evolution of the Social Programmer (Keynote @MSR2012) May 31, 2012 by margaretannestorey The following show the slides and abstract for a keynote presented at MSR 2012 in Zurich, Switzerland on June 3rd, 2012. Also available are an audio and slide capture on https://vimeo.com/43620623 and an unedited audio track)) Abstract Social media has revolutionized how humans create and curate knowledge artifacts. It has increased individual engagement, broadened community participation and led to the formation of new social networks. This paradigm shift is particularly evident in software engineering in three distinct ways: firstly, in how software stakeholders co-develop and form communities of practice; secondly, in the complex and distributed software ecosystems that are enabled through insourcing, outsourcing, open sourcing and crowdsourcing of components and related artifacts; and thirdly, by the emergence of socially-enabled software repositories and collaborative development environments. In this talk, I will discuss how software engineers are becoming more “social” and altruistic, defying the old-fashioned stereotype of the solitary and selfish programmer. I conjecture that media literacy and networking skills will become just as important as technical skills for creating, curating and managing today’s complex software ecosystems and software knowledge. I will also discuss the influence of social media and social networks on software development environments and repositories. I propose that social media is responsible for the shift from a software repository as a “space” that stores software artifacts, to a “place” where developers learn, reuse, share and network. The convergence of software tools with social media naturally influences the information that can be mined from software repositories, challenging not only the questions that motivate these mining activities, but also the very definitions of what comprises a software repository or even a software programmer. Finally, I will suggest that it is imperative to consider both the positive and negative consequences of how programming in a socially-networked world might impact software quality and software engineering practices. As Marshall McLuhan eloquently said in 1974, “If we understand the revolutionary transformations caused by new media, we can anticipate and control them; but if we continue in our self-induced subliminal trance, we will be their slaves.” Posted in Uncategorized | \t\t\t\t\t\t\t\t\t\t\t2 Comments » ICSE 2011 Panel on “What Industry Wants from Research” August 5, 2011 by margaretannestorey Update: I presented a keynote on this topic at the CSER meeting last October in Toronto. In that talk I summarized the panel discussion for those that could not be at ICSE. The slides from this talk are posted on slideshare: http://www.slideshare.net/mastorey/research-industry-panel-review. Research industry panel review View more presentations from Margaret-Anne Storey The panel we organized at ICSE 2011 was a great success. There was apparently standing room only at the back of the room, so the topic clearly struck a chord with ICS",
  "content_length": 25313,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:12"
}