{
  "name": "Margo I. Seltzer",
  "homepage": "https://www.seltzer.com/margo",
  "status": "success",
  "content": "Margo Seltzer | MARGO I. SELTZER is the Canada 150 Research Chair in Computer Science at the University of British Columbia. Her research interests are in systems, construed quite broadly: systems for capturing and accessing data provenance, file systems, databases, transaction processing systems, storage and analysis of graph-structured data, new architectures for parallelizing execution, and systems that apply technology to problems in healthcare. Margo Seltzer Pronouns: she, her Canada 150 Research Chair in Computer Systems Cheriton Family Chair in Computer Science UBC Computer Science 313-2366 Main Mall Vancouver, BC V6T 1Z4 Voice: 604-822-6642 mseltzer@cs.ubc.ca CV (traditional) CV (form 100) CV (NSERC CCV) Announcements News I am currently a co-Head for computer science. As such, my schedule is a bit of a nightmare. If you want to schedule an appointment with me, please send mail to headsec@cs.ubc.ca and indicate the purpose of the meeting. I am honored to have been elected to the Royal Society of Canada I am grateful to my colleagues who nominated me for the 2023 ACM Athena Lecturer Award. I gave my Athena Lecture at SOSP this past November. Here is the lovely video they did for the banquet. Upcoming Travel HotOS (Banff) -- May 14-16 UBC-O (Kelowna) May 26 UPenn Workshop on Law and Technology (Philadelphia) June 3-6 BSDCan Keynote (Ottawa) June 12-13 SIGMOD Keynote (Berlin) June 24-29 REP Conference (on Campus) July 29-31 Interested in Applying? I am not currently looking for new graduate students. I am, however, looking for Postdoctoral Researchers. If you have recently completed your Ph.D. or are completing one in the next six months, please read this before sending me email. If you are interested in UBC systems, I recommend checking out the other faculty in Systopia. Undergraduates: If you are interested in a directed study or in working as an undergraduate research assist, please read this before sending me email. Looking for a Letter of Recommendation? Please read this before sending me email.",
  "content_length": 2040,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:13"
}