{
  "name": "Maria Camila Nardini Barioni",
  "homepage": "http://www.facom.ufu.br/~camila",
  "status": "success",
  "content": "Maria Camila Nardini Barioni Maria Camila Nardini Barioni Universidade Federal de Uberlândia - UFU Faculdade de Computação - FACOM Campus Santa Mônica - Bloco 1B - Sala 1B137 Av. João Naves de Avila, 2121 - Bairro Santa Mônica 38400-902 - Uberlândia/MG email: camila ponto barioni arroba ufu ponto br Links: Lattes, laboratório, FACOM, PPGCO, #include < girls >, UFU Atuações Acadêmicas Professora Titular, Universidade Federal de Uberlândia (UFU). (2012-atual) Professora Visitante, Arizona State University (ASU). (2019-2020) Professora Visitante, University of California Riverside (UCR). (2009) Professora Adjunta, Universidade Federal do ABC (UFABC). (2008-2012) Formação Pós-Doutorado: Pós-Doutorado em Ciência da Computação e Matemática Computacional na USP, campus de São Carlos, concluído em 2008 sobre o tema Desenvolvimento de Técnicas Híbridas para Identificação de Agrupamentos em Bases de Dados de Imagens Médicas: Estudo de Casos e Aplicação em um Hospital Escola. Doutorado: Doutorado em Ciência da Computação e Matemática e Computacional na Universidade de São Paulo, campus de São Carlos, concluído em 2006, sobre o tema Operações de Consulta por Similaridade em Grandes Bases de Dados Complexos. Mestrado: Mestrado em Ciência da Computação e Matemática e Computacional na Universidade de São Paulo, campus de São Carlos, concluído em 2002, sobre o tema Visualização de Operações de Junção em Sistemas de Bases de Dados para Mineração de Dados. Graduação: Graduação em Ciência da Computação pela Universidade Federal de Uberlândia (UFU), concluída em 2000. Interesses de pesquisa Integração de Mineração de Dados com SGBD Agrupamento de Dados e Agrupamento Semi-Supervisionado de Dados Banco de Dados Multimídia Recuperação de Imagens por Conteúdo Consultas por Similaridade Técnicas de Indexação de Dados Complexos Análise de Dados de Redes Sociais Publicações Lattes DBLP Google Scholar Disciplinas 2023/2 - GBC043 Sistemas Gerenciadores de Bancos de Dados (informações na turma do MS Teams) 2023/2 - GBC034 Algoritmos e Estruturas de Dados 2 (informações na turma do MS Teams) Conjuntos de dados Conjuntos",
  "content_length": 2132,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:18"
}