{
  "name": "Maria Angela Ferrario",
  "homepage": "https://pure.qub.ac.uk/en/persons/maria-angela-ferrario",
  "status": "success",
  "content": "Maria Angela Ferrario - Queen's University Belfast View Scopus Profile Maria Angela Ferrario Dr Senior Lecturer, School of Electronics, Electrical Engineering and Computer ScienceCentre for Education and Society (CES)Centre for Intelligent Sustainable Computing https://orcid.org/0000-0002-2846-1365 Phone+44 (0)28 9097 4618EmailM.Ferrarioqub.acuk Room 01.004 - Computer Science BuildingUnited Kingdom Accepting PhD StudentsPhD projectsAI Governance &amp; Design from The Ground-Up - https://www.qub.ac.uk/courses/postgraduate-research/phd-opportunities/ai-governance-and-design-from-the-ground-up--models-tools-and-practice.html 20102025 Research activity per year Personal profile Research FocusDirector of the Centre for Education and Society at EEECS (CES), Chair of EEECS Sustainability Team, and Fellow of the Centre for Sustainability Equality and Climate Action (SECA). I am interested in the long-term impact of technology (including AI) on society and the environment, and, in particular, on practice-based approaches to its governance. Join me! There are funded PhD opportunities in AI and Governance - more info & how to apply With expertise in both software engineering (SE) and human computer interaction (HCI), I adopt agile and participatory methods to software systems design, and I investigate the role of human values in computing and of digital technology in environmental and social change. Experienced research lead of large interdisciplinary projects within and outside academia, including EPSRC-funded Catalyst and Clasp, focusing respectively on digital action for social change and personalised health IoT. Marshall McLuhan Senior Fellow in digital sustainability at the DCI, University of Toronto, Canada (2017-2019). Principal Investigator of EPSRC-funded project Values-First SE and Co-investigator on Ensemble (LWEC).Before joining academia, I worked as an Internet Technology Officer at the European EEIG ERNACT, managing e-government projects focused on the social and economic development of EU crossborder regions through digital innovation. I joined QUB in 2021 from the School of Computing and Communications (SCC), Lancaster University, UK.OtherEDUCATION - AI Ethics, Regulation, and Compliance, Oxford Saïd Business School.- PhD in  On-line Intelligent Systems, Computing Dept. UCD, Dublin, Ireland.- MSc in Multimedia Systems, Engineering Dept., Trinity College, Dublin, Ireland.- BA/MA in Philosophy and Social Psychology, Universita' Cattolica, Milan, Italy. CAREER DETAILS - 2021, Senior Lecturer, EEECS, Queen's University Belfast, UK- 2016, Lecturer, SCC, Lancaster University, UK- 2014, Research Fellow, SCC, Lancaster University, UK- 2009, Snr Research Associate, SCC, Lancaster University, UKTeachingCSC3032-SEFYP - Software Engineering Final Year Projects - 2021-2025. CSC2054-UXD - User Experience Design - 2025-present Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Maria Angela Ferrario is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Design Computer Science 100% Software Engineering Computer Science 89% Decision-Making Computer Science 60% Software Social Sciences 59% Engineering Social Sciences 59% Roles Computer Science 57% Case Study Computer Science 55% User Computer Science 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2010 2014 2017 2018 2019 2025 38 Conference contribution 14 Article 1 Chapter 1 Comment/debate Research output per year Research output per year Creating sustainable solutions: An inclusive hackathon leveraging genAI in a local contextBrowning, J. W., McKeever, S., Ferrario, M. A., O'Neill, I. & Stewart, D., 03 Jun 2025, IEEE Global Engineering Education Conference (EDUCON 2025): Proceedings . Institute of Electrical and Electronics Engineers Inc., 7 p. (Proceedings of the IEEE Global Engineering Education Conference (EDUCON)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Artificial Intelligence 100% Generative Artificial Intelligence 100% Open Data 37% UK 12% Evidence-Based 12% 1 Citation (Scopus) 29 Downloads (Pure) Explainable software engineering: from state of the practice to state of the artLi, Z., Ferrario, M. A., Crossey, B. & Rainer, A., 18 Sept 2025, (Accepted) Proceedings of the 32nd Asia-Pacific Software Engineering Conference (APSEC 2025). IEEE, (Proceedings of the Asia-Pacific Software Engineering Conference (APSEC)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Getting GPT to tutor like meO'Neill, I., Ferrario, M. A. & Dore, T., 17 Sept 2025, (Early online date) In: Interacting with Computers. 11 p., iwaf041.Research output: Contribution to journal › Article › peer-review Open AccessFile Dialog System 100% Knowledge Domain 100% Generative Pre-Trained Transformer 4 100% Generative Artificial Intelligence 66% 4 Downloads (Pure) Learning to 'Think' through playful interactions: a play-kit for incoming first-year computing studentsAnderson, N., Ferrario, M. A., McGowan, A., Collins, M., Browning, J. W., Galway, L., Hanna, P., Cutting, D. & Stewart, D., 03 Jun 2025, 2025 IEEE Global Engineering Education Conference (EDUCON), Proceedings. Institute of Electrical and Electronics Engineers Inc., (IEEE Global Engineering Education Conference, EDUCON: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Computational Thinking 100% Learning Style 50% Physical Prototype 50% Technical Challenge 50% Learning Experiences 50% Applying Human Values Theory to Software Engineering Practice: Lessons and ImplicationsFerrario, M. A. & Winter, E. R., 01 Mar 2023, In: IEEE Transactions on Software Engineering. 49, 3, p. 973 - 990 18 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Software Engineering 100% Decision-Making 28% Software Practitioner 28% Case Study 14% Research Framework 14% 9 Citations (Scopus) 97 Downloads (Pure) View all 54 research outputs Prizes A Best Paper Award: CHI 2015 - ACM Conference on Human Factors in ComputingSimm, W. (Recipient), Ferrario, M. A. (Recipient), Dix, A. (Recipient), Friday, A. (Recipient), Newman, P. (Recipient) & Hazas, M. (Recipient), 18 Apr 2015Prize: Prize (including medals and awards) Renewable Energy 100% Ergonomics 100% Pulse Energy 100% Computing 100% Best Provocation Award: ACM DIS 2017 - Designing Interactive Systems Conference 2017Ferrario, M. A. (Recipient) & Forshaw, S. W. (Recipient), 10 Jun 2017Prize: Prize (including medals and awards) Interactive System 100% Tunneling 100% Distinguished Paper Award ICSE 2021: Software Engineering in SocietyAltuwaijri, F. (Recipient) & Ferrario, M. A. (Recipient), 14 May 2021Prize: Prize (including medals and awards) Society 100% Distinguished Reviewer Award - IEEE CHASE2024Ferrario, M. A. (Recipient), 19 Apr 2024Prize: Prize (including medals and awards) Activities Activities per year 2021 2021 2022 2022 4 Publication peer-review 2 Invited or keynote talk at national or international conference Activities per year Responsible Software Engineering and ‘Social Good’Ferrario, M. A. (Advisor)28 Oct 2022Activity: Talk or presentation types › Invited or keynote talk at national or international conference Is Lowcode succeeding where we are failing?Ferrario, M. A. (Advisor)27 Oct 2022Activity: Talk or presentation types › Invited or keynote talk at national or international conference Empirical Software Engineering and Measurement 2021 (Event)Ferrario, M. A. (Peer reviewer)11 Oct 2021 → 15 Oct 2021Activity: Publication peer-review and editorial work types › Publication peer-review 25th International Conference on Evaluation and Assessment in Software Engineering (Event)Ferrario, M. A. (Peer reviewer)21 Jun 2021 → 23 Jun 2021Activity: Publication peer-review and editorial work types › Publication peer-review CHI Conference on Human Factors in Computing Systems 2021 (Event)Ferrario, M. A. (Peer reviewer)13 May 2021 → 18 May 2021Activity: Publication peer-review and editorial work types › Publication peer-review View all 6 activities",
  "content_length": 8784,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:16"
}