{
  "name": "Marieke Huisman",
  "homepage": "https://mariekehuisman.personalweb.utwente.nl",
  "status": "success",
  "content": "Homepage Marieke Huisman Marieke Huisman Research Teaching Contact information Professor in Software Reliability, leading the FMT (Formal Methods and Tools) Group at the University of Twente. Research on reliability and correctness of concurrent and distributed software. Try out our verification techniques using the VerCors verifier. Chair of the Computer Science department of the University of Twente. Lecturer in the Computer Science department of the University of Twente, teaching programming, basic algorithms, the use of formal methods, and program verification. Chair of the board of IPN, the ICT-Research Platform Netherlands. Board member of the Netherlands Academy of Engineering (NAE). Associate Editor-in-Chief of the Software Track of Science in Computer Programming . Member of board of the Dutch National Association for Software Engineering VERSEN. Member Advisory Council of NlNet Labs Chair of the Steering Committee of Alice & Eve. Member of the Steering Committee of ETAPS. Member of the Steering Committee of VerifyThis. Member of the Steering Committee of iFM. Member of the Steering Committee of Forte. Editor of STTT. Editor of PeerJ Computer Science. Winner of the 2023 Athena Award. The Athena Award rewards female researchers that stand out, and because of that are role models for others. Winner of the Netherlands Prize for ICT Research 2013, worth 50,000 euros. The ICT Prize is a unique prize for a scientist, aged 40 years or younger, who carries out innovative research or is responsible for a scientific breakthrough in ICT. To find out more about me and my work, you can watch this video, which was created as part of the Alice & Eve project, a celebration of women in computing. To find out more about my activities related to Diversity and Inclusion, you can watch this video. Research Topics: Program verification Reliability of concurrent, parallel and distributed applications Software specification Formal methods Publications Ongoing projects: NWO OC M Pallas, with Alexander Stekelenburg, Robert Mensing and Vadim Zaytsev WWU Münster - UT collaboration grant Saves, with Paula Herber, Raúl Monti and Philip Tasche NWO TTW OTP project Cheops, with Ömer Şakar, Lars van den Haak, and Anton Wijs. Interreg North Sea Storm_Safe, with Annabell Petri, Marcus Gerhold, and Arnd Hartmanns. Finished projects: NWO VICI project Mercedes: Maximal reliability of concurrent and distributed software, with Pieter Bos, Mohsen Safari, Raúl Monti, Sophie Lathouwers, Bob Rubbens, Lukas Armborst and Petra van den Bos. NWO TOP project VerDi: Verification of distributed software, with Wytse Oortwijn. JML, use and semantics: with Wolfgang Ahrendt, David Cok, Nikolai Kosmatov, Mattias Ulbrich and others in the JML community. NIRICT Reconnaissance Topic: Performance and Correctness of GPGPU Applications NIRICT community funding: the Beauty and Joy of Computing in Dutch ESF COST Action ARVI: Runtime Verification beyond Monitoring 3TU.NIRICT project 3TU.BSR: Monitoring concurrent software ERC Starting Grant VerCors: Verification of concurrent data structures, with Afshin Amighi, Stefan Blom, Wojciech Mostowski, and Marina Zaharieva-Stojanovski. CARP project: Verification of GPGPU programs with Saeed Darabi and Stefan Blom. Mobius project, with Clément Hurlin and Christian Haack. Liveness and non-blocking properties of programs, with Dilian Gurov, Marina Zaharieva-Stojanovski, and Pedro de Carvalho Gomes. Compositional specification and verification of programs with procedures, with Dilian Gurov, Irem Aktug, Siavash Soleimanifard, Pedro de Carvalho Gomes and Christoph Sprenger. SlaLoM: Security by Logic: Model Checking of Security Properties for Multithreaded Programs, with Ngo Minh Tri. Persistent Functional Databases, with Lesley Wevers and Maurice van Keulen. PhD thesis Obtained from Computing Science Institute, University of Nijmegen. Download my Ph.D. thesis, entitled Java program verification in Higher-order logic with PVS and Isabelle. It describes work on verification of sequential Java programs which is done as part of the LOOP project. Supervisors: Henk Barendregt, Bart Jacobs and Hans Meijer Teaching Courses Software Diamond (1st year Bachelor) Software Systems (1st year Bachelor) System Validation (Master) Program Verification (Master) - every 2nd year Contact Address: University of Twente, Faculty EEMCS Formal Methods and Tools Building Zilverling, room 3055 P.O. Box 217 7500 AE Enschede The Netherlands Phone: +31 53 489 46 62 Secretary (Marion Steenbergen): +31 53 489 28 05 Or just send me an email... Email: M.Huisman@utwente.nl",
  "content_length": 4604,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:44"
}