{
  "name": "Maristella Matera",
  "homepage": "http://home.deib.polimi.it/matera",
  "status": "success",
  "content": "Prof. Maristella Matera Prof. Maristella Matera English Skip to content Home Human-Centric Interactive Technology Lab Home Maristella Matera – Full professor in Human-Computer Interaction Office: Politecnico di Milano – Dipartimento di Elettronica, Informazione e Bioingegneria (DEIB),Via Ponzio, 34/5, 20133, MILANO. Tel.:  ++39.02.2399.3408 – Fax: ++39.02.2399.3411 Email: maristella.matera@polimi.it Short Bio. Maristella received a “Laurea” Degree in Computer Science (cum laude) from the University of Bari in 1994 and a Ph.D. in Computer Science and Automation Engineering from Politecnico di Milano in 2000. At the beginning of her academic career, she was awarded several fellowships to support her research work at Italian and foreign institutions, in Europe and the USA. At the Politecnico di Milano, Maristella Matera leads the Human-Centric Interactive Technology lab (HINT lab – https://hintlab.polimi.it/). Her research focuses on aspects at the intersection of Human-Computer Interaction and Model-driven Web Engineering, emphasizing design methods and tools for advanced interactive systems on the Web. She is the author of about 300 papers and four books. She organized several international events related to Web Engineering and Human-Computer Interaction. She is an Associate Editor for the journal ACM Transactions on the Web. She teaches courses on Human-Computer Interaction, Human-centered AI, and Interaction Design. Maristella is vice-chair (and was previously chair) of SIGCHI Italy, the Italian chapter of the ACM Special Interest Group on Human-Computer Interaction. Search for: Recent Posts Benvenuto Recent CommentsArchives June 2014 Categories Uncategorized Meta Log in Entries feed Comments feed WordPress.org Prof. Maristella Matera Proudly powered by WordPress.",
  "content_length": 1795,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:09"
}