{
  "name": "Maribel Fernández",
  "homepage": "https://www.kcl.ac.uk/people/maribel-fernandez",
  "status": "success",
  "content": "Maribel Fernandez | King's College London Skip to main contentProfessor Maribel Fernandez Vice-Dean (People & Planning)Professor in Computer ScienceCorner editor of the International Journal on Logic and Computation, OUPExecutive Board Member – Logical Methods in Computer Science journalResearch interestsComputer scienceContact details+44 020 7848 2499maribel.fernandez@kcl.ac.ukBiographyProfessor Maribel Fernández is Vice-Dean (People & Planning) in the Faculty of Natural, Mathematical & Engineering Sciences and Professor of Computer Science in the Department of Informatics. Her research focuses on the development of tools for the specification, analysis and verification of software systems. With her collaborators, she developed an interactive graph-rewriting engine that has been used to model systems in various domains, including biology, finance and social networks. She has applied rewriting techniques also in the area of security (access control) and data privacy. In 2020, she received the IEEE Big Data Security Senior Research Award and was named Distinguished Scientist by ACM. Maribel studied Engineering at the University of the Republic (Uruguay) and Computer Science at ESLAI (Argentina). After completing a PhD at the University of Paris XI, she was a lecturer at the Ecole Normale Superieure (Paris) while preparing her Habilitation thesis, which she defended in 2000. She joined King's in 2002 as a lecturer and was promoted to Professor in 2011, serving as Head of the Systems Modelling and Applied Logic group until 2017 and then as Deputy Head of Department (Academic Planning) until 2024. Maribel is currently the President of the European Association for Computer Science Logic, a member of the Executive Board of the European Association for Programming Languages and Systems, and a member of the ACM SIGLOG Executive Committee. Research Interests Programming languages (semantics, types, security) Models of computation Security Rewriting More Information Research Profile Research Funding Personal Website PublicationsResearchResearchFinance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Security HubThe Security Hub consolidates the research related to securityHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Trusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Sustainability HubThe Sustainability Hub consolidates the research related to sustainabilityKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Software SystemsThe group studies design, modelling and engineering of software systems.NewsNews04 September 2025King's broad expertise shines through with REF 2029 panel appointmentsExperts representing a variety of subject areas across the university have been selected to help shape the Research Excellence Framework (REF) 2029.UniversityArts & CultureBusiness & FinanceHealthInternationalLawSocietyTechnology & Science09 December 2021Simplifying software verification techniquesResearchers at King’s and the University of Illinois at Urbana-Champaign (UIUC) are collaborating to develop techniques to enhance software verification...Technology & Science22 January 2021King's Professor Maribel Fernández recognised as Distinguished Member by the Association for Computing Machinery for Outstanding Scientific Contributions to ComputingThe global accolade recognises the impact and significance of Maribel’s accomplishments in computer science.Technology & Science05 August 2016Professor wins Supervisory Excellence AwardMaribel Fernandez, Professor of Computer Science in the Department of Informatics, has been awarded the King’s Supervisory Excellence Award for the Faculty of...Technology & ScienceFeaturesFeatures21 October 2024Meet Professor Maribel Fernandez – new Vice-Dean (People & Planning) in the Faculty of Natural, Mathematical and Engineering SciencesMeet Professor Maribel Fernandez, new Vice-Dean (People & Planning) in the Faculty of Natural, Mathematical and Engineering Sciences.Technology & ScienceUniversityPublicationsResearchNewsFeaturesResearchFinance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Security HubThe Security Hub consolidates the research related to securityHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Trusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Sustainability HubThe Sustainability Hub consolidates the research related to sustainabilityKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Software SystemsThe group studies design, modelling and engineering of software systems.News04 September 2025King's broad expertise shines through with REF 2029 panel appointmentsExperts representing a variety of subject areas across the university have been selected to help shape the Research Excellence Framework (REF) 2029.UniversityArts & CultureBusiness & FinanceHealthInternationalLawSocietyTechnology & Science09 December 2021Simplifying software verification techniquesResearchers at King’s and the University of Illinois at Urbana-Champaign (UIUC) are collaborating to develop techniques to enhance software verification...Technology & Science22 January 2021King's Professor Maribel Fernández recognised as Distinguished Member by the Association for Computing Machinery for Outstanding Scientific Contributions to ComputingThe global accolade recognises the impact and significance of Maribel’s accomplishments in computer science.Technology & Science05 August 2016Professor wins Supervisory Excellence AwardMaribel Fernandez, Professor of Computer Science in the Department of Informatics, has been awarded the King’s Supervisory Excellence Award for the Faculty of...Technology & ScienceFeatures21 October 2024Meet Professor Maribel Fernandez – new Vice-Dean (People & Planning) in the Faculty of Natural, Mathematical and Engineering SciencesMeet Professor Maribel Fernandez, new Vice-Dean (People & Planning) in the Faculty of Natural, Mathematical and Engineering Sciences.Technology & ScienceUniversity(N)7.19Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 6968,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:40"
}