{
  "name": "Marios Kogias",
  "homepage": "https://marioskogias.github.io",
  "status": "success",
  "content": "Marios Kogias Marios Kogias Assistant Professor (Lecturer) Department of Computing Imperial College London m.kogias@imperial.ac.uk Room 562 Huxley CV About me I'm an Assistant Professor (Lecturer in the UK system) in the Department of Computing at Imperial College London. I work at the intersection of operating systems, networking, and distributed systems and build systems that can provide tail-tolerance, fault-tolerance, and confidentiality guarantees leveraging emerging datacenter hardware. Before joining Imperial I was a researcher at Microsoft Research Cambridge. I obtained my PhD in 2020 from EPFL under the supervision of Ed Bugnion. My thesis was awarded the 2021 Dennis M. Ritchie Award and the 2021 Honourable Mention for the Eurosys Roger Needham PhD Award. My PhD was supported by an IBM Fellowship and the Microsoft Swiss JRC. I did my undergrad in Electrical and Computer Engineering at NTUA. I'm always looking for motivated PhD students and interns! If you are an Imperial student don't hesitate to reach out to me if you are interested in working on a project beyond the ones listed in the projects portal. Teaching Networked Systems (COM 60032) (Winter 2023) Computer Networks and Distributed Systems (COM 70041) (Spring 2023, Spring 2024) Object Oriented Design & Programming (COM 70036) (Winter 2022) Students Konstantinos Prasopoulos (co-advised with Ed Bugnion) Scofield Liu Farzad Mohammadi Adel Sefiane Publications SIRD: A Sender-Informed, Receiver-Driven Datacenter Transport Protocol. Konstantinos Prasopoulos, Ryan Kosta, Edouard Bugnion, Marios Kogias in NSDI 2025 Paper DORADD: Deterministic Parallel Execution in the Era of Microsecond-Scale Computing. Zhengqing Liu, Musa Unal, Matthew J. Parkinson, Marios Kogias in PPoPP 2025 Paper μBPF: Using eBPF for Microcontroller Compartmentalization Szymon Kubica, Marios Kogias in eBPF@SIGCOMM 2024 Paper Towards Functional Verification of eBPF Programs Dana Lu, Boxuan Tang, Michael Paper, Marios Kogias in eBPF@SIGCOMM 2024 Paper GuaranTEE: Towards Attestable and Private ML with CCA Sandra Deepthy Siby, Sina Abdollahi, Mohammad Maheri, Marios Kogias, Hamed Haddadi in EuroMLSys 2024 Paper Achieving Microsecond-Scale Tail Latency Efficiently with Approximate Optimal Scheduling Rishabh Iyer, Musa Unal, Marios Kogias, George Candea in SOSP 2023 Paper When Concurrency Matters: Behaviour-Oriented Concurrency Luke Cheeseman, Matthew J. Parkinson, Sylvan Clebsch, Marios Kogias, Sophia Drossopoulou, David Chisnall, Tobias Wrigstad, Paul Liétar in OOPSLA 2023 Paper HEELS: A Host-Enabled eBPF-Based Load Balancing Scheme Rui Yang, Marios Kogias in eBPF'23@SIGCOMM Paper Creating Trust by Abolishing Hierarchies Charly Castes, Adrien Ghosn, Neelu S. Kalani, Yuchen Qian, Marios Kogias, Mathias Payer, Edouard Bugnion in HotOS 2023 Paper Towards (Really) Safe and Fast Confidential I/O Hugo Lefeuvre, David Chisnall, Marios Kogias, Pierre Olivie in HotOS 2023 Paper When Idling is Ideal: Optimizing Tail-Latency for Heavy-Tailed Datacenter Workloads with Perséphone Henri Maxime Demoulin, Joshua Fried, Isaac Pedisich, Marios Kogias, Boon Thau Loo, Linh Thi Xuan Phan, Irene Zhang in SOSP 2021 Paper Harvesting Idle CPUs Safely and Efficiently in the Cloud Yawen Wang, Kapil Arya, Marios Kogias, Manohar Vanga, Aditya Bhandari, Neeraja J. Yadwadkar, Siddhartha Sen, Sameh Elnikety, Christos Kozyrakis, and Ricardo Bianchini in Eurosys 2021 Paper Enclosure: language-based restriction of untrusted libraries Adrien Ghosn, Marios Kogias, James Larus, Ed Bugnion in ASPLOS 2021 Paper Benchmarking, analysis, and optimization of serverless function snapshots Dmitrii Ustiugov, Plamen Petrov, Marios Kogias, Ed Bugnion, Boris Grot in ASPLOS 2021 Distinguished Artifact! Paper Operating System and Network Co-Design for Latency-Critical Datacenter Applications PhD Thesis link Bypassing the Load Balancer without Regrets Marios Kogias, Rishabh Iyer, Ed Bugnion in SoCC 2020 Paper Tail-Tolerance as a Systems Principle not a Metric Marios Kogias, Ed Bugnion in APNet2020 Paper HovercRaft: Achieving Scalability and Fault-tolerance for microsecond-scale Datacenter Services Marios Kogias, Ed Bugnion in Eurosys 2020 Best Student Paper Award! Paper R2P2: Making RPCs first-class datacenter citizens Marios Kogias, George Prekas, Adrien Ghosn, Jonas Fietz, Ed Bugnion in Usenix ATC 2019 Paper Lancet: A self-correcting Latency Measuring Tool Marios Kogias, Stephen Mallon, Ed Bugnion in Usenix ATC 2019 Paper Flow Control for Latency-Critical RPCs Marios Kogias, Ed Bugnion in KBNets@SIGCOMM2018 Paper ZygOS: Achieving Low Tail Latency for Microsecond-scale Networked Tasks George Prekas*, Marios Kogias*, Ed Bugnion (*equal co-authors) in SOSP 2017 Paper",
  "content_length": 4726,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:04"
}