{
  "name": "Maria-Cruz Villa-Uriol",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/mari-cruz-villa-uriol",
  "status": "success",
  "content": "Dr Mari-Cruz Villa-Uriol | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Mari-Cruz Villa-Uriol PhD School of Computer Science Senior Lecturer School Head of ED&I Member of the Complex Systems Modelling research group Open staff member portrait in a modal window m.villa-uriol@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Mari-Cruz Villa-Uriol School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-3345-539X Google Scholar Personal website Profile Dr Maria-Cruz Villa-Uriol is a Senior Lecturer in Computer Science and member of the Complex Systems Modelling research group at the University of Sheffield, UK. She is also member of the INSIGNEO institute for in silico Modelling.She holds a degree in Telecommunications and Electronics Engineering (Barcelona, Spain), and a PhD in Computer Engineering (University of California, Irvine, USA).Previously, she held a postdoctoral position (February 2006 - August 2012) at the Universitat Pompeu Fabra (Barcelona, Spain) and a Research Fellow position at the University of Sheffield (Department of Mechanical Engineering, September 2012 - January 2015). Research interests Her main research interests are the personalisation of models using computational imaging and modelling techniques, the composition of scientific workflows, and the use and development of data-driven decision-making strategies to support clinical decisions using heterogeneous data sources such as personalised VPH (Virtual Physiological Human) models, clinical databases, and mobile sensors capturing a wide variety of variables describing an individual and his/her environment.Her primary area of interest is in the cardiovascular domain with an emphasis in clinical translation. Publications Journal articles Benemerito I, Ewbank F, Narracott A, Villa-Uriol M-C, Narata AP, Patel U, Bulters D & Marzo A (2025) Computational fluid dynamics and shape analysis enhance aneurysm rupture risk stratification. International Journal of Computer Assisted Radiology and Surgery, 20(1), 31-41. View this article in WRRO Magallanes J, Stone T, Paul D M, Suzanne M, Wood S & Villa-Uriol M-C (2022) Sequen-C: A multilevel overview of temporal event sequences. IEEE Transactions on Visualization and Computer Graphics, 28(1), 901-911. View this article in WRRO Alfaidi MA, Chamberlain J, Rothman A, Crossman D, Villa-Uriol M-C, Hadoke P, Wu J, Schenkel T, Evans PC & Francis SE (2018) Dietary docosahexaenoic acid reduces oscillatory wall shear stress, atherosclerosis, and hypertension, most likely mediated via an IL-1-mediated mechanism. Journal of the American Heart Association, 7(13). View this article in WRRO Pozo Soler JM, Geeers AJ, Villa-Uriol MC & Frangi AF (2017) Flow complexity in open systems: interlacing complexity index based on mutual information. Journal of Fluid Mechanics, 825, 704-742. View this article in WRRO Luong L, Duckles H, Schenkel T, Mahmoud M, Lopez-Tremoleda JL, Wylezinska-Arridge M, Ali M, Bowden NP, Villa-Uriol M, van der Heiden K , Xing R et al (2016) Heart rate reduction with ivabradine promotes shear stress-dependent anti-inflammatory mechanisms in arteries. Thrombosis and Haemostasis, 116(1), 181-190. View this article in WRRO Sarrami-Foroushani A, Villa-Uriol M-C, Esfahany MN, Coley SC, Di Marco LY, Frangi AF & Marzo A (2015) Modeling of the Acute Effects of Primary Hypertension and Hypotension on the Hemodynamics of Intracranial Aneurysms. ANNALS OF BIOMEDICAL ENGINEERING, 43(1), 207-221. Perez F, Huguet J, Aguilar R, Lara L, Larrabide I, Villa-Uriol MC, López J, Macho JM, Rigo A, Rosselló J , Vera S et al (2013) RADStation3G: a platform for cardiovascular image analysis integrating PACS, 3D+t visualization and grid computing.. Comput Methods Programs Biomed, 110(3), 399-410. Larrabide I, Villa-Uriol M-C, Cárdenes R, Barbarito V, Carotenuto L, Geers AJ, Morales HG, Pozo JM, Mazzeo MD, Bogunović H , Omedas P et al (2012) AngioLab--a software tool for morphological analysis and endovascular treatment planning of intracranial aneurysms.. Comput Methods Programs Biomed, 108(2), 806-819. Bogunović H, Pozo JM, Cárdenes R, Villa-Uriol MC, Blanc R, Piotin M & Frangi AF (2012) Automated landmarking and geometric characterization of the carotid siphon.. Med Image Anal, 16(4), 889-903. Costalat V, Sanchez M, Ambard D, Thines L, Lonjon N, Nicoud F, Brunel H, Lejeune JP, Dufour H, Bouillot P , Lhaldky JP et al (2011) Biomechanical wall properties of human intracranial aneurysms resected following surgical clipping (IRRAs Project).. J Biomech, 44(15), 2685-2691. Morales HG, Kim M, Vivas EE, Villa-Uriol M-C, Larrabide I, Sola T, Guimaraens L & Frangi AF (2011) How do coil configuration and packing density influence intra-aneurysmal hemodynamics?. AJNR Am J Neuroradiol, 32(10), 1935-1941. Larrabide I, Villa-Uriol MC, Cardenes R, Pozo JM, Macho J, San Roman L, Blasco J, Vivas E, Marzo A, Hose DR & Frangi AF (2011) Three-dimensional morphological analysis of intracranial aneurysms: A fully automated method for aneurysm sac isolation and quantification. MED PHYS, 38(5), 2439-2449. Zhang C, Villa-Uriol M-C, De Craene M, Pozo JM, Macho JM & Frangi AF (2011) Dynamic estimation of three-dimensional cerebrovascular deformation from rotational angiography.. Med Phys, 38(3), 1294-1306. Villa-Uriol MC, Berti G, Hose DR, Marzo A, Chiarini A, Penrose J, Pozo J, Schmidt JG, Singh P, Lycett R , Larrabide I et al (2011) @neurIST complex information processing toolchain for the integrated management of cerebral aneurysms.. Interface Focus, 1(3), 308-319. Bogunović H, Pozo JM, Villa-Uriol MC, Majoie CBLM, van den Berg R, Gratama van Andel HAF, Macho JM, Blasco J, Román LS & Frangi AF (2011) Automated segmentation of cerebral vasculature with aneurysms in 3DRA and TOF-MRA using geodesic active regions: an evaluation study.. Med Phys, 38(1), 210-222. Pozo JM, Villa-Uriol M-C & Frangi AF (2011) Efficient 3D geometric and Zernike moments computation from unstructured surface meshes.. IEEE Trans Pattern Anal Mach Intell, 33(3), 471-484. Villa-Uriol MC, Larrabide I, Pozo JM, Kim M, Camara O, De Craene M, Zhang C, Geers AJ, Morales H, Bogunović H , Cardenes R et al (2010) Toward integrated management of cerebral aneurysms. Philosophical Transactions of the Royal Society A Mathematical Physical and Engineering Sciences, 368(1921), 2961-2982. Larrabide I, Kim M, Augsburger L, Villa-Uriol MC, Rüfenacht D & Frangi AF (2010) Fast virtual deployment of self-expandable stents: Method and in vitro evaluation for intracranial aneurysmal stenting. Medical Image Analysis. Singh PK, Marzo A, Coley SC, Berti G, Bijlenga P, Lawford PV, Villa-Uriol M-C, Rufenacht DA, McCormack KM, Frangi A , Patel UJ et al (2009) The role of computational fluid dynamics in the management of unruptured intracranial aneurysms: a clinicians' view.. Comput Intell Neurosci, 2009, 760364. Zhang C, Villa-Uriol M-C, De Craene M, Pozo JM & Frangi AF (2009) Morphodynamic analysis of cerebral aneurysm pulsation from time-resolved rotational angiography.. IEEE Trans Med Imaging, 28(7), 1105-1116. Montana L, Magallanes J, Juarez M, Mason S, Narracott A, van Gemeren L, Wood S & Villa-Uriol M-C () EventBox: A novel visual encoding for interactive analysis of temporal and multivariate attributes in event sequences. IEEE Transactions on Visualization and Computer Graphics. View this article in WRRO Villa-Uriol M-C () Towards Multi-Faceted Visual Process Analytics. Information Systems. Book chapters Radaelli AG, Bogunović H, Villa Uriol MC, Cebral JR & Frangi AF (2015) Image-based haemodynamics simulation in intracranial aneurysms, Handbook of Biomedical Imaging (pp. 199-217). Springer US Conference proceedings Montana L & Villa-Uriol MC (2025) Sequen-C Explorer for Process Mining. Ceur Workshop Proceedings, Vol. 4032 (pp 312-319) Turner O, Morgan J, Sun Z, Juarez M, Villa-Uriol M-C, Tchkonia T, Kirkland JL, Griffin J, Bellantuono I & Wyld L (2024) Correlating frailty & senescence: a biomarker study. FUTURE ONCOLOGY, Vol. 20 (pp 17-18) Turner O, Villa-Uriol M-C, Tchkonia T, Kirkland JL, Griffin J, Bellantuono I & Wyld L (2024) Degree of frailty impacts treatment & outcomes of breast cancer. FUTURE ONCOLOGY, Vol. 20 (pp 11-12) Clegg B, Villa-Uriol M-C, McMinn P & Fraser G (2021) Gradeer : an open-source modular hybrid grader. 2021 IEEE/ACM 43rd International Conference on Software Engineering: Software Engineering Education and Training (ICSE-SEET) (pp 60-65). Virtual conference, 25 May 2021 - 25 May 2021. View this article in WRRO Magallanes-Castaneda J, van Gemeren L, Wood S & Villa-Uriol M-C (2019) Analyzing time attributes in temporal event sequences. Proceedings of 2019 IEEE Visualization Conference (VIS). Vancouver, BC, Canada, 20 October 2019 - 20 October 2019. View this article in WRRO Morales HG, Larrabide I, Kim M, Villa-Uriol M-C, Macho JM, Blasco J, San Roman L & Frangi AF (2011) Virtual coiling of intracranial aneurysms based on dynamic path planning.. Med Image Comput Comput Assist Interv, Vol. 14(Pt 1) (pp 355-362). Germany Bisbal J, Engelbrecht G, Villa-Uriol MC & Frangi AF (2011) Prediction of cerebral aneurysm rupture using hemodynamic, morphologic and clinical features: A data mining approach. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, Vol. 6861 LNCS(PART 2) (pp 59-73) Villa-Uriol MC, Larrabide I, Pozo JM, Kim M, De Craene M, Camara O, Zhang C, Geers AJ, Bogunović H, Morales H & Frangi AF (2011) Cerebral Aneurysms: A Patient-Specific and Image-Based Management Pipeline (pp 327-349) Valencia C, Villa-Uriol MC, Pozo JM & Frangi AF (2010) Morphological descriptors as rupture indicators in middle cerebral artery aneurysms.. Annu Int Conf IEEE Eng Med Biol Soc, Vol. 2010 (pp 6046-6049). United States Villa-Uriol MC, Larrabid",
  "content_length": 13862,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:34"
}