{
  "name": "Marius Schneider",
  "homepage": "https://www.tnt.uni-hannover.de/staff/lindauer",
  "status": "success",
  "content": "Marius Lindauer – Institut für Künstliche Intelligenz – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik Start Kontakt Institut für Künstliche Intelligenz LUHAI Institut Marius Lindauer © M4 Fotostudio Mirja John Prof. Dr. rer. nat. Marius Lindauer Telefon +49 511 762 5301 E-Mail m.lindauer@ai.uni-hannover.de Adresse Welfengarten 1 30167 Hannover Gebäude 1101 Raum a419 © M4 Fotostudio Mirja John Prof. Dr. rer. nat. Marius Lindauer Telefon +49 511 762 5301 E-Mail m.lindauer@ai.uni-hannover.de Adresse Welfengarten 1 30167 Hannover Gebäude 1101 Raum a419 In recent years, AI achieved impressive results in different fields, incl. in computer vision, natural language processing and reinforcement learning. These breakthroughs show how AI will influence and change our daily lives, business and even research in many aspects. With the advent of deep learning and also traditional AI methods, such as AI planning, SAT solving or evolutionary algorithms, a multitude of different techniques are available these days. However, applying these techniques is challenging, and even experienced AI developers are faced with several difficult design decisions, making the development of new AI applications a tedious, error-prone and time-consuming task. Therefore, we develop new approaches to increase efficiency in AI application development by reducing the required expert knowledge, improving development time and reducing chances of error. We do this with democratization of AI and social responsibility in mind. Research Interests Actually, I'm interested in many topics related to AutoML, machine learning, AI and interdisciplinary applications of these. Here are some selected topics:Green-AutoML Human-centered AutoMLDynamic Algorithm ConfigurationGeneralization of Reinforcement LearningApplications to production or health/medicine Curriculum Vitae Working Experience Since 2025 Deputy Head of the Institute of AI, Leibniz University April 2023 - March 2025 Spokesperson of the Computer Science Professors, Leibniz University Hannover 2022-2024 Head of the Institute of AI, Leibniz University Hannover 2022 Co-Founder of the Institute for AI, Leibniz University Hannover since 2019 Professor of Machine Learning, Leibniz University Hannover 2017-2019 Lecturer (i.e., \"Akademischer Rat\"), University of Freiburg 2014-2017 PostDoc, University of Freiburg 2010-2014 Phd Student, University of Potsdam Education 2010-2015Phd (Dr. rer. nat), University of Potsdam 2008-2010Master of Science, Computer Science, University of Potsdam 2005-2008Bachelor of Science, Computer Science, University of Potsdam Selected Awards 2022: ERC Starting Grant on ixAutoML2020: 3rd place(*) at the official leaderboard and 1st place at the warmstart friendly leaderboard at the BBO-Challenge at NeurIPS'20 (* after fixing a minor bug)2018: Winner of 2nd AutoML challenge::PAKDD2018 with aad_freibug and PoSH Auto-sklearn2016: Winner of ChaLearn AutoML challenge \"AutoML 5\" with aad_freibug and auto-sklearn2015: Winner of ICON Challenge on algorithm selection with AutoFolio (track: Par10)2013: Winner of Configurable SAT Solver challenge 2013 with the Potassco team and clasp (tracks: crafted and random)2012: Winner of SAT Challenge 2012 with the Potassco team and clasp (track: hard combinatorial)2011: Winner of Answer Set Programming Competition with the Potassco team and claspfolio (track: NP-Problems)2009: Leopold-von-Buch-Bachelor-Award (Best Bachelor in Natural Sciences 2009 at the University of Potsdam) Memberships Co-Head AutoML.org Super Group Advisory board member and co-founder COSEAL.net L3S member of extended director board Member of Excellence Cluster PhoenixD Member and co-founder LUH Data Science Lab PI of KISSKI - AI Service Centre for Sensitive and Critical Infrastructures ELLIS Member CLAIRE supporter Partner of KI.WI - das KI-Netzwerk der Wirtschaftsregion Hannover Mentor at CAIMed  Mentor at AI-Grid Member of Working Group 1:  Technological Enablers and Data Science at Pattform Lernende Systeme Member of Benchmarking Network Member of IEEE Task Force on Automated Algorithm Design, Configuration and Selection    Previous Memberships Lecturer at xAIM (European Master Program on eXplainable Artificial Intelligence in Healthcare Management) Selected Presentations for Broader Audience Industrial AI Podcast \"AutoML: Did we promise ourselves too much?\" (2025) Ressourcenschonend und resilient: Mit KI den nachhaltigen Wandel gestalten\" Panel discussion at PLS conference (Berlin; 2023, German) \"Was geht in dem Kopf einer KI ab?\" at Medienhaus Hannover (Hannover 2023, German) Künstliche Intelligenz: Science Fiction oder harte Realität? at Science Talk Phaeno (Wolfsburg; 2022, German) Technische Möglichkeiten von KI zwischen Dystopie und Utopie at Ringvorlesung Deutsche Gesellschaft für wissenschaftliche Weiterbildung und Fernstudium (2021; German) Automation of AI Design at TEDxFreiburg (2019; English) Further more I gave invited talks at companies in all sizes, for example Vodafone, Bosch, Sparkasse Hannover, Hannover Re, qnips. If you are looking for a speaker at your event, please reach out to me. For free and open events, my talks are also free of charge. Links Google Scholar DBLP LinkedIn Youtube Funded Projects AutoML.space Publications Suchen 1 2 3 4 5 6 7 8 Last Zeige Ergebnisse 1 - 20 von 148 2026 Wever, M. D., Muschalik, M., Fumagalli, F., & Lindauer, M. (Angenommen/im Druck). HyperSHAP: Shapley Values and Interactions for Explaining Hyperparameter Optimization. In Proceedings of the Fortieth AAAI Conference on Artificial Intelligence (AAAI 2026) Mehr... 2025 Becktepe, J., Hennig, L., Oeltze-Jafra, S., & Lindauer, M. (Angenommen/im Druck). Auto-nnU-Net: Towards Automated Medical Image Segmentation. In International Conference on Automated Machine Learning 2025 https://openreview.net/pdf?id=XSTIEVoEa2 Mehr... Deng, D., & Lindauer, M. (2025). Neural Attention Search. In The Thirty-Ninth Annual Conference on Neural Information Processing Systems Vorabveröffentlichung online. https://doi.org/10.48550/arXiv.2502.13251 Mehr... Dierkes, J., Eimer, T., Lindauer, M., & Hoos, H. (2025). Performance Prediction In Reinforcement Learning: The Bad And The Ugly. In 18th European Workshop on Reinforcement Learning (EWRL) Vorabveröffentlichung online. https://openreview.net/pdf?id=L9J6Xmta4J Mehr... Fehring, L., Eimer, T., & Lindauer, M. (Angenommen/im Druck). Growing with Experience: Growing Neural Networks in Deep Reinforcement Learning. In 2025 Multi-disciplinary Conference on Reinforcement Learning and Decision Making (RLDM 2025) Mehr... Fehring, L., Wever, M., Spliethöver, M., Hennig, L., Wachsmuth, H., & Lindauer, M. (2025). Towards Dynamic Priors in Bayesian Optimization for Hyperparameter Optimization. In Workshop Track of the AutoML Conference https://openreview.net/pdf?id=mQ0IENZRx2 Mehr... Graf, H., Fehring, L., Tornede, T., Tornede, A., Wever, M. D., & Lindauer, M. (2025). Towards Exploiting Early Termination for Multi-Fidelity Hyperparameter Optimization. In Workshop Track of the AutoML Conference Vorabveröffentlichung online. https://openreview.net/pdf?id=apxqygZeFV Mehr... Henheik, M., Eimer, T., & Lindauer, M. (2025). Revisiting Learning Rate Control. In International Conference on Automated Machine Learning 2025 Vorabveröffentlichung online. Mehr... Hennig, L., & Lindauer, M. (2025). Leveraging AutoML for Sustainable Deep Learning: A MultiObjective HPO Approach on Deep Shift Neural Networks. Transactions on Machine Learning Research, 2025-July. Mehr... Hennig, L., & Lindauer, M. (2025). Leveraging AutoML for Sustainable Deep Learning: A Multi- Objective HPO Approach on Deep Shift Neural Networks. In Transactions on Machine Learning Research Vorabveröffentlichung online. https://openreview.net/pdf?id=vk7b11DHcW Mehr... Jabs, D., Mohan, A., & Lindauer, M. (Angenommen/im Druck). Moments Matter: Stabilizing Policy Optimization using Return Distributions. In 2025 Multi-disciplinary Conference on Reinforcement Learning and Decision Making (RLDM 2025) Mehr... Kocher, N., Wassermann, C., Hennig, L., Seng, J., Lindauer, M., Hoos, H., Kersting, K., & Müller, M. (2025). Guidelines for the Quality Assessment of Energy-Aware NAS Benchmarks. In Castanet 2025 Workshop on Challenges Advances and Sustainability in AI HPC Interaction: In conjunction with the 25th IEEE ACM International Symposium on Cluster Cloud and Internet Computing Vorabveröffentlichung online. https://doi.org/10.48550/arXiv.2505.15631 Mehr... Margraf, V., Lappe, A., Wever, M. D., Benjamins, C., Hüllermeier, E., & Lindauer, M. (2025). SynthACticBench: A Capability-Based Synthetic Benchmark for Algorithm Configuration. In GECCO 2025 - Proceedings of the 2025 Genetic and Evolutionary Computation Conference (ACM Conferences). Association for Computing Machinery (ACM). Vorabveröffentlichung online. Mehr... Mladenovic, S., Lindauer, M., & Doerr, C. (2025). Automated Data Preparation for Machine Learning. In 4th International Conference on Automated Machine Learning: Non-Archival Track Vorabveröffentlichung online. https://openreview.net/forum?id=qjLJgQNipN Mehr... Mohan, A., Eimer, T., Benjamins, C., Lindauer, M., & Biedenkapp, A. (2025). Mighty: A Comprehensive Tool for studying Generalization, Meta-RL and AutoRL. In 18th European Workshop on Reinforcement Learning (EWRL) Vorabveröffentlichung online. https://openreview.net/pdf?id=QlDXH5NkUx Mehr... Neutatz, F., Lindauer, M., & Abedjan, Z. (2025). How Green is AutoML for Tabular Data? In Proceedings 28th International Conference on Extending Database Technology ( EDBT 2025 ) (S. 350–363) https://openproceedings.org/2025/conf/edbt/paper-97.pdf Mehr... Rook, J., Benjamins, C., Bossek, J., Trautmann, H., Hoos, H., & Lindauer, M. (2025). MO-SMAC: Multi-objective Sequential Model-based Algorithm Configuration. Evolutionary computation, 25(1), 1-25. https://doi.org/10.1162/evco_a_00371 Mehr... Schaller, M. C., Kruse, M., Ortega, A., Lindauer",
  "content_length": 11372,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:10"
}