{
  "name": "Maria Knobelsdorf",
  "homepage": "https://informatik.univie.ac.at/Maria.Knobelsdorf",
  "status": "success",
  "content": "Fakultät für Informatik Die Fakultät für Informatik Unser Leitbild und unsere Forschungsschwerpunkte » Jetzt lesen! © Universität Wien/ Barbara Mair Unser Studienangebot Bachelorstudien, Masterstudien und Lehramt » Überblick zu allen Studien © Universität Wien/ derknopfdruecker.com Wissenschaftlerinnen* im Fokus \"Internationaler Tag der Frauen* in der Wissenschaft\": Wir stellen 13 Kolleginnen unserer Fakultät und ihre Arbeit in Forschung und Lehre vor. » Weiterlesen! UniVie Doctoral School Computer Science DoCS » Mehr zum DoCS-Forschungs- und Doktoratsprogramm 20 Jahre Fakultät | 50 Jahre Informatik An der Fakultät für Informatik wurden im Jahr 2024 gleich zwei Jubiläen gefeiert. » Zur Jubiläumsseite! Arndt von Haeseler unter den 2025 weltweit meistzitierten Forscher*innen Die Fakultät für Informatik gratuliert dem ehemaligen Professor für Bioinformatik und Fakultätsmitglied Arndt von Haeseler! Mehr © Universität Wien/ derknopfdruecker.com News Informatiker*innen der Universität Wien und von SBA Research entdecken große Sicherheitslücke in WhatsApp Eine weltweite Erfassung von Nutzer*innen war durch eine mittlerweile geschlossene Datenschutzlücke im Contact Discovery Mechanismus von WhatsApp möglich. Mehr Einladung zum ersten Talk der Vienna Circuits-Reihe: \"Understanding Transformer Generalization by Design?\" Die NLP Group der Subeinheit Data Mining and Machine Learning (DM) lädt sehr herzlich zum Talk von Yupei Du (Universität des Saarlandes) am 21. November, um 13:00 Uhr, ein. Der Vortrag findet im Rahmen der neuen Vienna Circuits-Reihe statt, einem... Mehr Ein heiterer Kulturpessimist – Porträt des musischen Informatikers Peter Reichl Leopold Federmair über den Werdegang von Prof. Peter Reichl (COSY) zwischen Mathematik, Informatik, Musik und Kulturpessimissmus: \"Die Person selbst, erkenntlich an ihrem Stil, hat etwas Heiteres. Heiter nicht im Sinn von Spassmacherei, sondern der... Mehr CISPA European Cybersecurity & AI Hackathon Championship Bachlor-, Master- und Doktoratsstudierende sind eingeladen, sich bis 21.11.2025 für den 24h-Wochenend-Hackathon zu bewerben. Die bestplatzierten Teams präsentieren ihre Lösungen einer Expert*innen-Jury und haben die Chance am Grand Finale in St.... Mehr Gratulation an Péter Ferenc Gyarmati zum Gewinn der VISxGenAI Challenge Die Workshop-Challenge auf der IEEE VIS 2025 bestand darin, vollständig autonome KI-Systeme zu entwickeln, die Daten automatisch analysieren und aussagekräftige, interaktive Berichte erstellen. Mehr AI-basierte Pilotstudie zu Hochwasserereignissen Klimawandel und damit einhergehende und ständig zunehmende Extremwetterereignisse beschäftigen seit einigen Jahren nicht nur die Wissenschaft. Hochwasser stellt dabei eine besondere Herausforderung dar, der sich die Fakultät für Informatik in einer... Mehr Distinguished Paper Award auf der ACM CCS 2025 David Schmidt, Sebastian Schrittwieser und Edgar Weippl haben auf der ACM CCS 2025 (A*-Konferenz) für ihren Beitrag \"Leaky Apps: Large-scale Analysis of Secrets Distributed in Android and iOS Apps\" den Distinguished Paper Award erhalten. Alle... Mehr » Alle News & Events ansehen Kontakt Fakultät für Informatik Universität Wien Währinger Straße 29 1090 Wien » Kontaktinformationen für Ihre Anfrage Links für Studierende Vorlesungsverzeichnis (u:find) Anmeldung zu Lehrveranstaltungen & Prüfungen Anerkennungen Jobbörse für Studierende » Parteienverkehr SSC",
  "content_length": 3416,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:27"
}