{
  "name": "Mariofanna Milanova",
  "homepage": "http://ualr.academia.edu/MariofannaMilanova",
  "status": "success",
  "content": "Mariofanna Milanova - University of Arkansas at Little Rock Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Mariofanna MilanovaUniversity of Arkansas at Little Rock, Computer Science, Faculty MemberaddFollowdoneFollowingFollowers374Following118Co-authors19Public ViewsMariofonna Milanova has been a Professor of the Computer Science Department at the University of Arkansas at Little Rock since 2001. She received a M.Sc. in Expert Systems and Artificial Intelligence in 1991. She obtained a Ph.D. in Computer Science in 1995 from the Technical University, Sofia, Bulgaria.  Dr. Milanova conducted post-doctoral research in visual perception at the University of Paderborn, Germany.  Dr. Milanova has extensive academic experience at various academic and research organizations worldwide. Dr. Milanova serves as a book editor for two books and as an associate editor for various international journals.  Her main research interests are in the areas of artificial intelligence, computer vision and communications, machine learning, privacy and security based on biometric research.  Dr, Milanova had grants from the German Research Foundation, the Brazilian FAPESP State of Sao Paulo Research Foundation, the US National Science Foundation, the European Community, NATO, the US Department of Homeland Security and the US Air Force. Dr Milanova is a Senior Member of the IEEE and Computer Society, a member of IAPR, a member of the IEEE Women in Engineering, and a member of the Cognitive Neuroscience Society. Dr. Milanova is a Fulbright U.S. Scholar, Fulbright Specialist, NVIDIA Deep Learning Instructor, and NVIDIA Deep Learning Institute University Ambassador  She has published and co-authored, over 150 publications, over 73 journal papers, 28 book chapters, and numerous conference papers and has 2 patents.Supervisors: Nikola Kasabov, Roumen Kountchev, and Adel ElmaghrabyPhone: 15019165289Address: 2801 S University Av EIT 564, Littel Rock , AR 72204lessRelated Authors David Pierre LeibovitzCarleton University David KalhousMasaryk University David SeamonKansas State University Remo CaponiUniversity of Cologne Armando Marques-GuedesUNL - New University of Lisbon Kevin G BarnhurstUniversity of Illinois at Chicago John SuttonMacquarie University Fabio CuzzolinOxford Brookes University Lev ManovichGraduate Center of the City University of New York Jasni Mohamad ZainUniversiti Teknologi MaraInterestsView All (12) CVUploadsall1 Videos261 Papers1 Conference Presentations1 BooksVideos by Mariofanna Milanova51:31Visual Intelligence and Deep Learning models: What we can learn from hierarchies in the primate's Visual Cortex?The presentation covers topics such as Biological motivated Deep learning models and activitie... more The presentation  covers topics such as Biological motivated  Deep learning models and  activities  supported by NVIDIA Deep Learning Institute97 viewsPapers by Mariofanna MilanovaGraph convolutional networks for pain detection via telehealthElsevier eBooks, 2023 Formalizing Event-Driven Behavior of Serverless ApplicationsarXiv (Cornell University), Dec 7, 2019We present new operational semantics for serverless computing that model the event-driven relatio... more We present new operational semantics for serverless computing that model the event-driven relationships between serverless functions, as well as their interaction with platforms services such as databases and object stores. These semantics precisely encapsulate how control transfers between functions, both directly and through reads and writes to platform services. We use these semantics to define the notion of the service call graph for serverless applications that captures program flows through functions and services. Finally, we construct service call graphs for eight serverless JavaScript applications, using a prototype of our call graph construction algorithm, and we evaluate their accuracy.Download Brain Tumor Segmentation Using Deep Neural Networks and Survival PredictionTransactions on computational science and computational intelligence, 2021 Multi-layer image compression algorithm for e-commerceABSTRACT Developing Secure Privacy Preserving and Causal Genetic Alteration Research in Building an Innovative Systematic Pedagogy for Integrated Research and Education: The INSPIRE ModelTo meet current keen demand for producing next-generation workforce equipped with skills and expe... more To meet current keen demand for producing next-generation workforce equipped with skills and expertise in big-data analytics, we developed an innovative systematic pedagogy for integrated research-education (INSPIRE model) that is centered around two great challenges: (1) Transforming multidisciplinary STEM training so that it enhances emerging problem-solving capacity and (2) Training STEM students how to have a bigger hand in performing large-scale scientific work. To help strengthen the problem-solving skills and leadership abilities of STEM graduates, we reform the current STEM research training in Bioinformatics and CIS (Computer and Information Sciences) so that it helps us reach the goal of catalyzing science and research training. Our main research hypothesis is that critical improvement in the way big-data scientists are trained comes not solely from large-scale data mining but, in addition, comes from developing useful machine learning and artificial intelligence techniques that automate intelligent learning derived from big-data. The INSPIRE model was built by enablers in the scientific community, and indeed, by the community at large, to help resolve the scarcity of those Professionally Skilled / Trained in Big Data analytics (PSTBD) issue by equipping students with a versatile cross-disciplinary skill set. There is a dire need for those of us in the scientific and academic community to be able to transfer our own successes into perfecting the feedback-based machine learning - cognitive science INSPIRE model, one that places a heavy emphasis on providing individualized training to individuals from all walks of life, including large populations of minorities and women, so that all efforts are made as collaboratively as possible, and the benefits of the sewn seeds may be reaped by everyone. We integrate our secure privacy preserving and causal genetic alteration research at single-cell resolution to demonstrate the model. On an even grander scale, we enhance the PSTBD research by developing the INSPIRE model so that broader social impacts can be made by such newly created fields as Systems Genomics at single-cell level and fields fostered by creative cross-disciplinary genomic big-data analytics (http://americancse.org/events/csce2017/keynotes_lectures/yang_talk) with catalyzed learning-research synergies Perception-based image/video quality metric using CIELAB color spaceProceedings of SPIE, May 13, 2011This paper addresses the problem of color image quality assessment. The paper presents a novel im... more This paper addresses the problem of color image quality assessment. The paper presents a novel image/ video quality metrics, Color-SSIM (color-based structural similarity index), based on CIELAB color model. The main drawback of the SSIM algorithm in the spatial domain ... FlowCFL: A Framework for Type-based Reachability Analysis in the Presence of Mutable DataarXiv (Cornell University), May 13, 2020Reachability analysis is a fundamental program analysis with a wide variety of applications. We p... more Reachability analysis is a fundamental program analysis with a wide variety of applications. We present FlowCFL, a framework for type-based reachability analysis in the presence of mutable data. Interestingly, the underlying semantics of FlowCFL is CFL-reachability. We make three contributions. First, we define a dynamic semantics that captures the notion of flow commonly used in reachability analysis. Second, we establish correctness of CFL-reachability over graphs with inverse edges (inverse edges are necessary for the handling of mutable heap data). Our approach combines CFL-reachability with reference immutability to avoid the addition of certain infeasible inverse edges and we demonstrate empirically that avoiding those edges results in precision improvement. Our formal account of correctness extends to this case as well. Third, we present a type-based reachability analysis and establish equivalence between a certain CFL-reachability analysis and the type-based analysis, thus proving correctness of the type-based analysis.Download Explaining Multimodal Image Retrieval Using A Vision and Language Task ModelSpringer eBooks, 2023 Deep Learning Approaches for Classroom Audio Classification Using Mel SpectrogramsSmart Innovation, Systems and Technologies, Dec 3, 2022 Identifying Non-random Patterns from Gene Expression ProfilesSpringer eBooks, 2008There has been considerable interest in identifying biologically relevant genes from temporal mic... more There has been considerable interest in identifying biologically relevant genes from temporal microarray gene expression profiles using linear and nonlinear measures. The present study uses two distinct approaches namely: classical order zero-crossing count (ZCC) and Lempel-Ziv (LZ) complexity in identifying non-random patterns from temporal gene expression profiles. While the former captures the linear statistical properties of the time series such a power-spectrum, the latter has been used to capture nonlinear dynamical properties of gene expression profiles. The results presented elucidate that ZCC can perform better than LZ in identifying biologically relevant genes. The robustness of the findings are established on the given gene expression profiles as well as their noisy ",
  "content_length": 20465,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:05"
}