{
  "name": "Maria Spichkova",
  "homepage": "http://www.spichkova.com",
  "status": "success",
  "content": "Dr. Maria SpichkovaSearch this siteEmbedded FilesSkip to main contentSkip to navigationSenior Lecturer (equiv. to Associate Professor in the North American system) School of Computing Technologies, RMIT University (Discipline of Cyber Security and Software Systems) Dr Maria Spichkova is a Senior Lecturer at the School of Computing Technologies, RMIT University. Her research interests include Human aspects of  Software Engineering (SE), Requirements Engineering, application of AI for SE, Computer science education, Formal methods and Sustainability. She has served as OC and PC member on various top-ranked conferences, such as  ICSE, RE, ICSA, MODELS, ECSA, KES, ENASE, MobiQuitous, etc.,  as well as organised several workshops and special sessions at ECSA, SEFM, and ENASE. She also was a co-Chair of MODELS’23 Poster Track, RE’22 Student Volunteers Track.Maria received a PhD in Computer Science in 2007 at the Technical University of Munich (Germany), where she worked in a Researcher and Lecturer role between 2003 and 2013.  She joined RMIT in June 2013. Since 2013, she worked each year as a PC member of more than 10 international conferences and workshops PC (overall since then she served in more than 120 PCs), where most of venues are ranked by CORE as A*/ A.  She also has served as the reviewer of journals and conferences (such as Transactions on Software Engineering and Methodology, Transactions on Industrial Informatics, Journal of Systems & Software, etc.), the Program Committee co-chair and member for international conferences and workshops (HOFM, SAGRA, RE4SuSy, MoDeVVa and IEEE APSCC). Maria has authored or co-authored over 140 publications including a monograph, journal articles, refereed conference papers, and book chapters. Fields of interest:Human-Oriented Software EngineeringFormal Methods and human aspects thereofSpecification and Verification of Real-Time and Embedded Systemsmaria.spichkova at rmit.edu.auRMIT University, Building 14, Level 10, Room 13 (414-418 Swanston Street), Melbourne, 3000, Australia Contact me if you would like to read but cannot access my papers or if you are interested in doing research with me.  I am always happy to collaborate.   I am actively looking for students interested in my research areas. Get me in touch, if you would like to write your PhD, Masters or Bachelors Thesis under my supervision. GoogleScholarLinkedInTwitterResearchGateGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2491,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:32"
}