{
  "name": "Marius Portmann",
  "homepage": "http://staff.itee.uq.edu.au/marius",
  "status": "success",
  "content": "Marius Portmann The University of Queensland HomeMarius Marius Portmann, PhD (ETH Z rich) Professor Office: 604, GP South (78) email: marius_at_eecs.uq.edu.au phone: (+61 7) 3365 1636 Dr Marius Portmann is a Professor at the School of Electrical Engineering and Computer Science on Technology, at The University of Queensland, Brisbane, Australia. Marius Portmann has an undergraduate degree (1998) and a PhD (2002) in Electrical Engineering from the Swiss Federal Institute of Technology (ETH), Z rich, Switzerland. Teaching Advanced Computer Networks Advanced Information Security Research Interests Software Defined Networks (SDN) Wireless Mesh Networks Pervasive Computing Network Security Blockchain Technology Current and Recent Professional Service Area Editor, Computer Communications Journal, Elsevier TPC Vice Chair, IEEE International Conference on Pervasive Computing and Communications (PerCom), 2013 Workshops Chair, IEEE International Conference on Pervasive Computing and Communications (PerCom), 2012 TPC Member, ACM International Symposium on Mobility Management and Wireless Access (MobiWac), 2012 TPC Member, ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems (MSWIM), 2012 TPC Member, IEEE International Workshop on Hot Topics in Mesh Networking (HotMESH), 2012 TPC Member, IEEE International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC) , 2012 Publications A list of my publications is available via Google Scholar: http://scholar.google.com.au/citations?user=hiYVpa0AAAAJ&hl=en Patents Accessing distributed proxy configurations for Internet server applications that provides automatic way to avoid failing host link, B. Landfeldt, A. Seneviratne, S. Ardon, M. Portmann, P. Gunningberg, Patent Numbers: WO200284972-A; WO200284972-A2; US2002156841-A1; AU2002246477-A1 Server-to-user delivery of data stream to create distributed proxy configurations associated with server that avoids need for user to manually configure client when connecting to network, B. Landfeldt, A. Seneviratne, P. Gunningberg, S. Ardon, M. Portmann , Patent Numbers: WO200284973-A; WO200284973-A2; US2002165928-A1; GB2390002-A; AU2002251653-A1 On This Site EmotionAI FlowMind NIDS Datasets The University of Queensland, Australia Brisbane St Lucia, QLD 4072 +61 7 3365 1111 Other Campuses: UQ Ipswich, UQ Gatton, UQ Herston Maps and Directions © 2013 The University of Queensland A Member of Terms of use | Feedback ABN: 63 942 912 684 CRICOS Provider No: 00025B Quick Links For Media Emergency Contact Social Media Facebook Twitter iTunes U YouTube Channel Explore Giving to UQ Faculties & Divisions UQ Jobs Contact UQ Services & Facilities",
  "content_length": 2709,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:09"
}