{
  "name": "Marina Madonia",
  "homepage": "https://web.dmi.unict.it/docenti/maria.serafina.madonia",
  "status": "success",
  "content": "Maria Serafina MADONIA | Dipartimento di Matematica e Informatica Vai al contenuto principaleVai al menu di navigazione Vai ai contenuti correlati Maria Serafina MADONIA Professoressa associata di Informatica [INFO-01/A] Contatti Email: madonia@dmi.unict.itTelefono: 095 7383003 Orario di ricevimento Mercoledì dalle 09:00 alle 11:00 controllare sempre http://www.dmi.unict.it/madonia/ ENGLISH VERSIONSTUDIUMAREA RISERVATA BIOGRAFIACURRICULUMPUBBLICAZIONIINSEGNAMENTIATTIVITÀ DI RICERCAAVVISI Maria Serafina Madonia, nata a Palermo il 31 dicembre 1962, è professore associato (S.S.D. INF/01) presso il Dipartimento di Matematica e Informatica (DMI) dell'Università degli Studi di Catania dall’1gennaio 2022. Dal maggio 1996 al dicembre 2021 è stata ricercatore confermato (S.S.D. INF/01) presso lo stesso dipartimento. Nel 1985, si è laureata in Matematica (Indirizzo Applicativo), presso l’Università degli Studi di Palermo e, nel 1991, ha conseguito il titolo di Dottore di Ricerca in Matematica (III ciclo - Università consorziate di Palermo, Catania e Messina). Insegna nei corsi di Laurea di Informatica Triennale e Magistrale e svolge attività di ricerca nell’ambito dell’informatica teorica. Scarica il file VISUALIZZA LE PUBBLICAZIONI N.B. l'elevato numero di pubblicazioni può incidere sul tempo di caricamento della pagina VISUALIZZA GLI INSEGNAMENTI DALL'A.A. 2022/2023 AD OGGI Anno accademico 2021/2022 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 1° annoFONDAMENTI DI INFORMATICA A - L DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 1° annoFONDAMENTI DI INFORMATICA M - Z DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoLINGUAGGI FORMALI Anno accademico 2020/2021 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 1° annoFONDAMENTI DI INFORMATICA M - Z DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoLINGUAGGI FORMALI Anno accademico 2019/2020 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 1° annoFONDAMENTI DI INFORMATICA M - Z DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoLINGUAGGI FORMALI Anno accademico 2018/2019 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 1° annoFONDAMENTI DI INFORMATICA M - Z DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoLINGUAGGI FORMALI Anno accademico 2017/2018 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 1° annoFONDAMENTI DI INFORMATICA M - Z DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoLINGUAGGI FORMALI Anno accademico 2016/2017 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoLINGUAGGI FORMALI Anno accademico 2015/2016 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoLINGUAGGI FORMALI E APPLICAZIONI VISUALIZZA GLI INSEGNAMENTI PRECEDENTI ATTIVITA’ DI RICERCA Svolge attività di ricerca nel campo della teoria dei linguaggi formali e, più esattamente, si interessa di problemi algebrici e combinatori delle teorie degli automi, dei linguaggi bidimensionali e dei codici. In particolare ha  affrontato le seguenti tematiche: -              Linguaggi bidimensionali riconoscibili -              Codici di picture -              Automi su alfabeti unari -              “Covering” di parole -              Z-monoidi e z-codici -              Relazioni razionali -              Riducibilità di alberi binari L'elenco completo delle pubblicazioni è disponibile al link http://www.dmi.unict.it/madonia/ricerche.html. Ha svolto, e tuttora svolge, attività di revisore scientifico per numerose riviste internazionali e per numerosi convegni nazionali ed internazionali. Dal 1998 ad oggi ha partecipato a diversi Progetti di ricerca finanziati dal MIUR, dall’INDAM e dall'Ateneo di Catania. 26/11/2025 Linguaggi Formali: calendario lezioni mese di Dicembre 2025Si ricorda agli studenti del Corso di Linguaggi Formali che le lezioni saranno sospese per le prime due settimane di dicembre: dall’1 al 6 per la pausa didattica, l’8 per festività, il 10 per le prove di accesso a Medicina.Le lezioni proseguiranno poi secondo il seguente calendario:lunedì 15                    ore 10-13   mercoledì 17             ore 11-13   Si precisa che la lezione di mercoledì 17 sarà dedicata LEGGI TUTTO ARCHIVIO Condividi Facebook Twitter Whatsapp Telegram Email Storia del DMI Regolamenti Organi e Commissioni Personale del DMI Docenti Personale Tecnico/Amministrativo Assegnisti di ricerca Dottorandi Coordinamento dipartimentale Amministrazione, Uffici e Servizi Guide Procedure e moduli Assicurazione della Qualità DMI sui social Aule Link utili Cerca nel sito Termini da ricercare",
  "content_length": 4883,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:49"
}