{
  "name": "Maria Eichlseder",
  "homepage": "https://eichlseder.at",
  "status": "success",
  "content": "Maria Eichlseder – ISEC Maria Eichlseder Assoc.Prof. Dipl.-Ing. Dr.techn. BSc BSc Cryptology & Privacy, Associate Professor Maria Eichlseder is an associate professor at Graz University of Technology. Her research interests include the design and cryptanalysis of symmetric cryptographic algorithms, such as hash functions and authenticated encryption algorithms and their underlying primitives. She co-designed Ascon, a lightweight authenticated cipher that was selected by NIST as new standard for lightweight cryptography in 2023. She defended her Ph.D. sub auspiciis praesidentis in 2018 and visited Ruhr-Universität Bochum and Radboud University Nijmegen as a guest researcher. Prior, she studied Computer Science and Technical Mathematics at Graz University of Technology. She has received several awards for her work, including an ERC Starting Grant in 2025. +43 316 873 - 5503 maria.eichlseder@tugraz.at https://www.isec.tugraz.at/eichlseder/ IF01104 TUGRAZ online Research My research interests include the design and cryptanalysis of symmetric cryptographic algorithms, such as hash functions and authenticated encryption algorithms and their underlying primitives: permutations, (tweakable) block ciphers, etc. In my research, I am particularly interested in their \"practical security\", which includes robustness against misuse and implementation attacks in addition to cryptanalytic security. I enjoy exploring mathematical aspects of cryptanalysis, useful tools and heuristics, and connections between cryptanalytic and physical attacks. I currently have an open PhD position starting 2026 - apply until 30 Nov 2025! Current team members: Marcel Nageler, PhD candidate Simon Gerhalter, PhD student Markus Schiffermüller, PhD student Alumni: Debasmita Chakraborty, Postdoc 2025. Hosein Hadipour, PhD January 2025. Now at Ruhr University Bochum. Online resources on selected research topics: Ascon, a family of authenticated ciphers and hash functions selected in the NIST lightweight crypto standardization process (NIST SP 800-232) and winner in the \"lightweight\" category of the CAESAR competition ISAP, a lightweight authenticated cipher designed for robustness against side-channel attacks and finalist in the NIST lightweight crypto standardization process CASTLE tools, some of my research team's cryptanalysis tools and source code for our papers Malicious SHA-1 Teaching I teach cryptography as part of several undergraduate and graduate courses (see TUGRAZonline): Information Security (lecture: winter term 2024/25, 2023/24, 2022/23, 2021/22, 2020/21, 2019/20) Cryptography (lecture and practicals: winter term 2024/25, 2023/24, 2022/23 (awarded the Prize for Excellence in Teaching), 2021/22, 2020/21) Cryptanalysis (lecture/seminar and practicals: summer term 2024/25, 2023/24, 2022/23, 2021/22 2020/21) Introduction to Scientific Working (seminar: winter term 2024/25, 2023/24, 2020/21–2022/23) You can find many of my lectures on Youtube. Looking for a bachelor's thesis, master's thesis, or project in symmetric crypto, cryptanalysis, and practical security? Let me know, I’m always happy to discuss open topics! Previously offered courses: Applied Cryptography (lecture and practicals: 2014/15–2019/20, see \"Cryptography\") Applied Cryptography 2 (lecture/seminar and practicals: 2014/15–2019/20, see \"Cryptanalysis\") Computermathematik (lecture with integrated practicals: 2013/14, 2014/15, 2015/16) Diskrete Stochastik und Informationstheorie (practicals: 2013/14) Erstellung wissenschaftlicher Arbeiten mit LaTeX (Interne Weiterbildung: 2014/15–2017/18) Service Reviewing Peer-reviewing as a Program Committee or Editorial Board member: 2026: EUROCRYPT 2026, FSE 2026 / ToSC 25/26, 2025: CRYPTO 2025, ACM CCS 2025, FSE 2025 / ToSC 24/25, CT-RSA 2025, SAC 2025, IWSEC 2025, DCC 2024: Eurocrypt 2024, FSE 2024 / ToSC 23/24, DCC; co-chair of SAC 2024 2023: Eurocrypt 2023, Asiacrypt 2023, DCC, CT-RSA 2023, SAC 2023; organizer of Austrian Computer Science Day 2023 2022: Asiacrypt 2022, FSE 2022 / ToSC 21/22, DCC, SAC 2022, PQCifris 2022; co-organizer of Frisiacrypt 2022 2021: ToSC 20/21, SAC 2021, CFail 2021 2020: Eurocrypt 2020, FSE 2020 / ToSC 19/20, SAC 2020, Indocrypt 2020, IWSMR 2020 2019: FSE 2019 / ToSC 18/19, Latincrypt 2019 2018: FSE 2018 / ToSC 17/18, SAC 2018 LaTeX Templates TikZ: Cryptographic circuits (git) TU Graz Corporate Design (restricted access): Thesis titlepage and affidavit (TU4U, git), Presentations (TU4U, git), Documents and reports (TU4U, git) ISEC Templates: Presentations and posters (git - restricted), Master's theses/projects, bachelor's theses, ISW reports (git - restricted), Student project topics (git - restricted) Publications BEANIE – A 32-bit Cipher for Cryptographic Mitigations against Software Attacks Gerhalter S., Hodžić S., Medwed M., Nageler M., Folwarczny A., Nikov V., Hoogerbrugge J., Schneider T., McConville G., Eichlseder M.IACR Transactions on Symmetric Cryptology, Vol. 2025(4), 2025 Preimage-type Attacks for Reduced Ascon-Hash: Application to Ed25519 Nageler M., Schmid L., Eichlseder M.Selected Areas in Cryptography – SAC 2025 AutoDiVer: Automatically Verifying Differential Characteristics and Learning Key Conditions Nageler M., Ghosh S., Jüttler M., Eichlseder M.IACR Transactions on Symmetric Cryptology, Vol. 2025(1), 2025 Selected Areas in Cryptography - SAC 2024, Part II Eichlseder M., Gambs S.Springer, 2025 Selected Areas in Cryptography - SAC 2024, Part I Eichlseder M., Gambs S.Springer, 2025 More Publications Scroll to top Subscribe News & Events Email By continuing, you accept the privacy policy ×",
  "content_length": 5607,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:21"
}