{
  "name": "Marina De Vos",
  "homepage": "http://www.bath.ac.uk/comp-sci/contacts/academics/marina_de_vos",
  "status": "success",
  "content": "Marina De Vos - the University of Bath's research portal View Scopus Profile Marina De Vos Dr Senior Lecturer, Department of Computer ScienceCentre for Mathematical BiologyUKRI CDT in Accountable, Responsible and Transparent AICentre for Therapeutic InnovationArtificial Intelligence and Machine LearningInnovation Bridge https://orcid.org/0000-0003-3583-7671 Phone+44 (0) 1225 385053EmailM.D.Vosbath.acuk 1 WEST 3.61 Accepting Doctoral Students Personal profile Research interestsMy main research interests focus on knowledge representation and reasoning, with an emphasis on but not limited to answer set programming  and normative multi-agent systems. Answer set programming (ASP) is a declarative programming paradigm. Programs are written in AnsProlog, a logic programming language using the answer set semantics. AnsProlog is a knowledge representation language that allows the programmer to describe a problem and the requirements on its solutions in an intuitive way, rather than the algorithm to find the solutions to the problem. Normative multi-agents systems offer a human society-like approach to govern open distributed systems where the norms regulate the behaviour of the various components. I am in interested in the theory, implementation and application of ASP and normative systems. Previous application areas (in no particular order) include: structural engineering, music composition, legal reasoning, business rules and policy modelling. I am also interest in inductive machine learning, explainable and verifiable AI, hybrid AI (combining knowledge-driven and data-driven AI techniques), legal reasoning, argumentation and game theory.Willing to supervise doctoral studentsDeclarative programming, Answer Set programming  Theory, Methodology, ApplicationExplainable AIHybrid AINormative multi-agent systems: Norm Emergence, Norm Change, ApplicationsPolicy ModellingLegal Reasoning Education/Academic qualificationEducation, Postgraduate Certificate in Learning and Teaching in Higher Education, University of Bath2010Award Date: 7 Oct 2010Computer Science, Doctor of Science, Logic Programming, Decisions and Games, Vrije Universiteit Brussel1998 → 2002Award Date: 1 Jan 2002Computer Science, Master of Computing, Disjunctive Logic Programming, Vrije Universiteit BrusselOct 1994 → Jul 1998Award Date: 7 Jul 1998Education, Aggregaat: Post gradudate certificate in Learning and Teaching, Vrije Universiteit Brussel1996 → 1998Award Date: 7 Jul 1998 Fingerprint Dive into the research topics where Marina De Vos is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Answer Set Programming Computer Science 100% Logic Programming Computer Science 61% Multi Agent Systems Computer Science 44% Case Study Computer Science 37% Normative Framework Computer Science 36% Routing Protocol Computer Science 21% Decision-Making Computer Science 18% Computational Modeling Computer Science 15% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects 6 Finished Projects per year A model and architecture for multi-context, value-aware agentsDe Vos, M. (PI) & Padget, J. (PI)1/06/23 → 1/03/24Project: Other Explicit Representation 100% Decision-Making 100% Decision-Making Process 100% KTP with Altran Praxis LtdDe Vos, M. (PI) & ffitch, J. P. (CoI)Innovate UK, Innovate UK Business Connect1/09/10 → 31/08/11Project: Central government, health and local authorities Using Audience Response Systems to Improve Student LearningDe Vos, M. (PI) & Davenport, J. (CoI)Advance HE1/12/09 → 30/08/10Project: Central government, health and local authorities EUMAS08: EUMAS08 - Sixth European Multi-Agent Systems MeetingPadget, J. (PI) & De Vos, M. (CoI)Engineering and Physical Sciences Research Council1/09/08 → 28/02/09Project: Research council Leading Country 100% Student Research 100% UK 100% Barcelona 100% Tendering 100% ALIVEPadget, J. (PI) & De Vos, M. (CoI)European Commission1/01/08 → 31/10/10Project: EU Commission Software Systems 100% Organization Theory 66% Service Design 66% Software Service 66% Information Service 33% View all 6 projects Research output 49 Chapter in a published conference proceeding 20 Book chapter 20 Article 16 Paper 17 More 8 Editorial 4 Other report 2 Conference article 1 Book 1 Other 1 Other contribution Research output per year Research output per year Context Matters: Contextual Value-Based Deliberation in Water Consumption ScenariosOliva-Felipe, L., Lobo, I., McKinlay, J., Dignum, F., De Vos, M., Cortés, U. & Cortés, A., 2025, Value Engineering in Artificial Intelligence - 2nd International Workshop, VALE 2024, Revised Selected Papers. Osman, N. & Steels, L. (eds.). Germany: Springer Science and Business Media Deutschland GmbH, p. 208-222 15 p. (Lecture Notes in Computer Science; vol. 15356 LNAI).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Water Consumption 100% Decision-Making 100% Socio-Technical System 100% Decision-Making Process 50% Socio-technical systems 50% Joint Postproceedings for the Workshops and Tutorials at the Third International Conference on Hybrid Human-Artificial Intelligence (HHAI) (preface)Ericson, P., Khairova, N. & De Vos, M., 11 Jun 2024, In: CEUR Workshop Proceedings. 3825, p. I-IIIResearch output: Contribution to journal › Conference article › peer-review Open Access Artificial Intelligence 100% Agent-directed runtime norm synthesisMorris-Martin, A., De Vos, M., Padget, J. & Ray, O., 2 Jun 2023, Proceedings of the 22nd International Conference on Autonomous Agents and Multiagent Systems. International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS), Vol. 2023. p. 2271-2279 9 p. (Proceedings of the International Joint Conference on Autonomous Agents and Multiagent Systems, AAMAS).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open Access Case Study 100% Machine Learning 100% Specification Language 100% Special Purpose 100% Technical System 100% 2 Citations (SciVal) Preface to International Workshop on Coordination, Organizations, Institutions, Norms, and Ethics for Governance of Multi-Agent Systems, COINE 2021De Vos, M., Nieves, J. C. & Theodorou, A., 2022, In: Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). 13239 LNAI, p. v-viiResearch output: Contribution to journal › Editorial › peer-review A Norm Emergence Framework for Normative MAS – Position PaperMorris-Martin, A., De Vos, M. & Padget, J., 2 Apr 2021, Coordination, Organizations, Institutions, Norms, and Ethics for Governance of Multi-Agent Systems XIII - International Workshops COIN 2017 and COINE 2020, Revised Selected Papers. Aler Tubella, A., Cranefield, S., Frantz, C., Meneguzzi, F. & Vasconcelos, W. (eds.). Cham, Switzerland: Springer Nature Switzerland, p. 156-174 19 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 12298 LNAI).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Normativity 100% Decision Making 100% Change Request 16% 5 Citations (SciVal) View all 122 research outputs Activities 3 Keynote presentation or prestigious invited talk 2 Conference or panel chair 1 Major conference organising role 1 External examination Activities per year European Conference on Artificial IntelligenceDe Vos, M. (Chair)2014Activity: Academic conferences and events (excluding conference publications) › Conference or panel chair External PhD examinerDe Vos, M. (Examiner)14 Jan 2015Activity: External examination and supervision › External examination International Conference on Logic Programming Doctoral Consortium De Vos, M. (Chair)2015Activity: Academic conferences and events (excluding conference publications) › Conference or panel chair 16th International Conference on Deontic Logic and Normative SystemsDe Vos, M. (Speaker)6 Jul 2023Activity: Academic conferences and events (excluding conference publications) › Keynote presentation or prestigious invited talk International Workshop on Coordination, Organizations, Institutions, Norms and Ethics for Governance of Multi-Agent SystemsDe Vos, M. (Speaker)29 May 2023Activity: Academic conferences and events (excluding conference publications) › Keynote presentation or prestigious invited talk View all 7 activities",
  "content_length": 8892,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:46"
}