{
  "name": "Maritta Heisel",
  "homepage": "https://www.uni-due.de/swe/marittaheisel.php",
  "status": "success",
  "content": "Maritta Heisel Maritta Heisel Kontaktdaten Forschung Vita Projekte Abschlussarbeiten Publikationen Lehre Prof. Dr. rer. nat. Maritta Heisel Anschrift      Bismarckstr. 90 Raum             BC 307 Telefon          +49 203 379 3465 Fax                 +49 203 379 4490 Email             maritta.heisel[at]uni-duisburg-essen.de Forschungsschwerpunkte Security Risikomanagement Anforderungsanalyse Model-basiertes Software Engineering Web-Engineering Vita seit 2004 Professorin für Software Engineering an der Universität Duisburg-Essen Projekte Werkzeuggestütze Bedrohungsanalyse von Software: Forschungskooperation mit Siemens RestAssured PDP4E 2025 Leicht, Jens; Lukasewycz, Julien; Heisel, Maritta PriPoCoG : Empowering End-Users’ Data Protection Decisions In: Proceedings of the 27th International Conference on Enterprise Information Systems: Volume 2 / 27th International Conference on Enterprise Information Systems (ICEIS 2025), April 4-6, 2025, in Porto, Portugal / Filipe, Joaquim; Śmiałek, Michał; Brodsky, Alexander; Hammoudi, Slimane (Hrsg.). Setúbal: SciTePress, 2025, S. 668 – 679 DOI Pampus, Julia; Heisel, Maritta A Delimitation of Data Sovereignty From Privacy In: Empowering Digital Sovereignty: Balancing Privacy and Global Connectivity. Hershey: IGI Global, 2025, S. 1 – 24 DOI Leicht, Jens; Heisel, Maritta Management of Customized Privacy Policies In: Proceedings of the 11th International Conference on Information Systems Security and Privacy: Volume 2 / 11th International Conference on Information Systems Security and Privacy (ICISSP 2025), February 20-22, 2025, in Porto, Portugal / Di Pietro, Roberto; Renaud, Karen; Mori, Paolo (Hrsg.). Setúbal: SciTePress, 2025, S. 385 – 396 DOI 2024 Díaz Ferreyra, Nicolás E.; Vidoni, Melina; Heisel, Maritta; Scandariato, Riccardo Cybersecurity discussions in Stack Overflow : a developer-centred analysis of engagement and self-disclosure behaviour In: Social Network Analysis and Mining, Jg. 14, 2024, 16 DOI (Open Access) Leicht, Jens; Heisel, Maritta Extending PriPoCoG : A Privacy Policy Editor for GDPR-Compliant Privacy Policies In: Proceedings of the 19th International Conference on Evaluation of Novel Approaches to Software Engineering - Volume 1: ENASE: SciTePress, 2024, S. 307 – 318 DOI Leicht, Jens; Wagner, Marvin; Heisel, Maritta Creating Privacy Policies from Data-Flow Diagrams In: Computer Security. ESORICS 2023 International Workshops: Revised Selected Papers Part I / CyberICS, DPM, CBT, and SECPRE, The Hague, The Netherlands, September 25–29, 2023 / Katsikas, Sokratis; Cuppens, Frédéric; Cuppens-Boulahia, Nora (Hrsg.). Berlin: Springer Science and Business Media Deutschland GmbH, 2024, S. 433 – 453 DOI, Online Volltext (Open Access) 2023 Leicht, Jens; Heisel, Maritta P2BAC: Privacy Policy Based Access Control Using P-LPL In: Proceedings of the 9th International Conference on Information Systems Security and Privacy ICISSP: Volume 1 / 9th International Conference on Information Systems Security and Privacy (ICISSP 2023): 22 - 24 February 2023; Lisbon, Portugal. Setúbal: SciTePress, 2023, S. 686 – 697 DOI Heisel, Maritta; Wagner, Marvin Pattern-Based Risk Identification for Model-Based Risk Management In: Applicable Formal Methods for Safe Industrial Products. Berlin: Springer Science and Business Media Deutschland GmbH, 2023, S. 114 – 129 DOI 2022 Borchert, Angela; Ferreyra, Nicolás E. Díaz; Heisel, Maritta Meeting Strangers Online : Feature Models for Trustworthiness Assessment In: Human-Centered Software Engineering: Proceedings / 9th IFIP WG 13.2 International Working Conference, HCSE 2022, Eindhoven, The Netherlands, August 24–26, 2022, / Bernhaupt, Regina; Ardito, Carmelo; Sauer, Stefan (Hrsg.). Cham: Springer Science and Business Media Deutschland GmbH, 2022, S. 3 – 22 DOI Leicht, Jens; Heisel, Maritta; Gerl, Armin PriPoCoG : Guiding Policy Authors to Define GDPR-Compliant Privacy Policies In: Trust, Privacy and Security in Digital Business: Proceedings / Katsikas, Sokratis; Furnell, Steven; 19th International Conference (TrustBus 2022): Vienna, Austria; August 24, 2022. Cham; Berlin; Heidelberg; New York, NY: Springer, 2022, S. 1 – 16 DOI Díaz Ferreyra, Nicolás E.; Hecking, Tobias; Aïmeur, Esma; Heisel, Maritta; Hoppe, Heinz Ulrich Community detection for access-control decisions : Analysing the role of homophily and information diffusion in Online Social Networks In: Online Social Networks and Media, Jg. 29, 2022, 100203 DOI (Open Access) Díaz Ferreyra, Nicolás E.; Ostendorf, Sina; Aïmeur, Esma; Heisel, Maritta; Brand, Matthias ENAGRAM: An App to Evaluate Preventative Nudges for Instagram In: Proceedings of the 2nd European Symposium on Usable Security, EuroUSEC 2022 / EuroUSEC '22: 2nd European Symposium on Usable Security; 29 - 30 September 2022; Karlsruhe, Germany. New York: Association for Computing Machinery (ACM), 2022, S. 53 – 63 DOI, Online Volltext (Open Access) Borchert, Angela; Heisel, Maritta The Role of Trustworthiness Facets for Developing Social Media Applications : A Structured Literature Review In: Information, Jg. 13, 2022, Nr. 1, 34 DOI, Online Volltext (Open Access) Borchert, Angela; Wainakh, Aidmar; Krämer, Nicole; Mühlhäuser, Max; Heisel, Maritta The Relevance of Privacy Concerns, Trust, and Risk for Hybrid Social Media In: Evaluation of Novel Approaches to Software Engineering: 16th International Conference, ENASE 2021, Virtual Event, April 26-27, 2021 ; Revised Selected Papers / 16th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE) ; April 26-27, 2021, Virtual Event / Ali, Raian; Kaindl, Hermann; Maciaszek, Leszek A. (Hrsg.). Cham: Springer, 2022, S. 88 – 111 DOI 2021 Wirtz, Roman; Heisel, Maritta Risk Treatment : An Iterative Method for Identifying Controls In: Evaluation of Novel Approaches to Software Engineering: Revised Selected Papers / 15th International Conference, ENASE 2020, Prague, Czech Republic, May 5–6, 2020 / Ali, Raian; Kaindl, Hermann; Maciaszek, Leszek A. (Hrsg.). Cham: Springer, 2021, S. 283 – 310 DOI Leicht, Jens; Gerl, Armin; Heisel, Maritta Technical Report on the Extension of the Layered Privacy Language Duisburg, Essen, 2021 DOI, Online Volltext (Open Access) Borchert, Angela; Heisel, Maritta Conflict identification and resolution for trust-related requirements elicitation a goal modeling approach In: Journal of Wireless Mobile Networks, Ubiquitous Computing, and Dependable Applications, Jg. 12, 2021, Nr. 1, S. 111 – 131 DOI (Open Access) Sabani, Lirijan; Wirtz, Roman; Heisel, Maritta P2P Frames : Pattern-based Characterization of Functional Requirements for Peer-to-peer Systems In: ENASE 2021: Proceedings of the 16th International Conference on Evaluation of Novel Approaches to Software Engineering : online streaming, April 26-27, 2021 / 16th International Conference on Evaluation of Novel Approaches to Software Engineering; 26-27 April 2021; Virtual / Ali, Raian; Kaindl, Hermann; Maciaszek, Leszek (Hrsg.). Setúbal: SCITEPRESS, 2021, S. 239 – 250 Maidl, Monika; Münz, Gerhard; Seltzsam, Stefan; Wagner, Marvin; Wirtz, Roman; Heisel, Maritta Model-Based Threat Modeling for Cyber-Physical Systems : A Computer-Aided Approach In: Software Technologies: Revised Selected Papers / 15th International Conference, ICSOFT 2020, Online Event, July 7–9, 2020 / van Sinderen, Marten; Maciaszek, Leszek A.; Fill, Hans-Georg (Hrsg.). Cham: Springer, 2021, S. 158 – 183 DOI Heisel, Maritta; Omerovic, Aida Risk Identification Based on Architectural Patterns In: Quality of Information and Communications Technology: Proceedings / 14th International Conference, QUATIC 2021, Algarve, Portugal, September 8–11, 2021 / Paiva, Ana C. R.; Cavalli, Ana Rosa; Ventura Martins, Paula; Pérez-Castillo, Ricardo (Hrsg.). Cham: Springer, 2021, S. 341 – 355 DOI 2020 Borchert, Angela; Díaz Ferreyra, Nicolas E.; Heisel, Maritta Balancing trust and privacy in computer-mediated introduction : Featuring risk as a determinant for trustworthiness requirements elicitation In: ARES 2020: 15th International Conference on Availability, Reliability and Security / International Conference on Availability, Reliability and Security (ARES) ; 3rd Interdisciplinary Privacy and Trust Workshop (iPAT) ; August 25 – August 28, 2020, All-digital Conference / Volkamer, Melanie; Wressnegger, Christian (Hrsg.). New York: Association for Computing Machinery (ACM), 2020, 84 DOI Díaz Ferreyra, Nicolás E.; Aímeur, Esma; Hage, Hicham; Heisel, Maritta; Van Hoogstraten, Catherine García Persuasion meets AI : Ethical considerations for the design of social engineering countermeasures In: Proceedings of the 12th International Joint Conference on Knowledge Discovery, Knowledge Engineering and Knowledge Management: Vol. 3 / 12th International Joint Conference on Knowledge Discovery, Knowledge Engineering and Knowledge Management ; KMIS 2020 ; 2 - 4 November 2020, online: SciTePress, 2020, S. 204 – 211 Gol Mohammadi, Nazila; Leicht, Jens; Goeke, Ludger; Heisel, Maritta Assisted generation of privacy policies using textual patterns In: Proceedings of the 15th International Conference on Evaluation of Novel Approaches to Software Engineering / ENASE 2020; Virtual, Online; 5 - 6 May 2020. Setúbal: SciTePress, 2020, S. 347 – 358 Wirtz, Roman; Heisel, Maritta; Wagner, Marvin Distributed frames : Pattern-based characterization of functional requirements for distributed systems In: Software Technologies / 14th International Conference, ICSOFT 2019, Prague, Czech Republic, July 26–28, 2019 / van Sinderen, Marten; Maciaszek, Leszek A. (Hrsg.). Cham: Springer, 2020, S. 81 – 107 DOI Wirtz, Roman; Heisel, Maritta Risk Identification : From Requirements to Threat Models In: Proceedings of the 6th International Conference on Information Systems Security and Privacy (ICISSP 2020): Volume 1 / Furnell, Steven; 6th International Conference on Information Systems Security and Privacy (ICISSP 2020): 25 - 27 February 2020; Valletta, Malta / Mori, Paolo; Weippl, Edgar;",
  "content_length": 63043,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:07"
}