{
  "name": "Mario Romero Vega",
  "homepage": "https://www.kth.se/profile/marior",
  "status": "success",
  "content": "KTH | Mario Romero Vega Skip to main content Mario Romero VegaVisiting researcherKungliga Tekniska Högskolanhttps://www.kth.se/profile/mariorDetailsWorks for Division of Computational Science and TechnologyUnit address Lindstedtsvägen 5E-mail marior@kth.seRoom4417ResearcherResearcher IDORCID IDWeb of Science ResearcherIDScopus IDGoogle Scholar IDResearchGateAbout me Mario Romero is a guest researcher at KTH and a Senior Associate Professor leading the Immersive Visualization Unit at the Media and Information Technology Department at Linköping University in its Norrköping campus. He is the national technical manager of the Swedish Research Council's (Vetenskapsrådet) national research infrastructure for data analysis and visualization, InfraVis. He is a Fulbright Scholar from Ecuador and a postdoc at Uppsala University, a doctoral graduate of Georgia Tech (PhD Computer Science, 2009), University of Illinois at Urbana-Champaign (Master Computer Science, 2001), and Universidad San Francisco de Quito (BS Industrial Engineering and BS Construction Engineering , 1996). He is also a technical co-founder of BrailleTouch, a smartphone keyboard for blind users, and Anymaker, a tablet application for sketching in 3D. Dr. Romero's research centers in Human-Computer Interaction, Visualization, and Ubiquitous and Accessible Computing. Email: mario.romero@liu.se Zoom: https://liu-se.zoom.us/my/marioromero CV: http://www.linkedin.com/in/marioromero. Calendar: my calendar to find free slots to book a meeting. Projects and Activities Updated on July 14, 2025 by Mario Romero. Mario Romero now has the position of Head of Unit at the Immersive Visualization Group and Senior Associate Professor at LiU. January 1, 2025. New paper: A. Wrife, Guarese R, Iop A &Romero M, \"Comparative analysis of spatiotemporal playback manipulation on virtual reality training for External Ventricular Drainage,\"Computers and Graphics,vol. 124, November 2024. New paper: Ali Buwaider, Victor Gabriel El-Hajj, Omar Ali Mahdi, Alessandro Iop, Maria Gharios, Andrea de Giorgio,Mario Romero, Paul Gerdhem, Walter C Jean, Erik Edström & Adrian Elmi-Terander. Extended reality in cranial and spinal neurosurgery – a bibliometric analysis.Acta Neurochirurgica166, 194 (2024). April 25, 2024. The students of Information Visualization DH2321 2024 present their final projects. We held InfraVis Days at Umeå on March 18-20, 2024. Homo Colossus at Tekniska Museet, February 24, 2024 from 13:00 to 18:00. I am teaching Information Visualization DH2321 and FDK3260 for PhD students. I lead 17 innovative student projects between January and June 2024. I served as Chair of Yue Liu's Defense on January 18, 2024. To read her thesis, follow this link. InfraVis Newsletter: Explore InfraVis.se regularly to stay informed with developments and opportunties to participate,  Dec 2023. DH2413 Open House 2023: Our Advanced Graphics and Interaction students present their augmented and mixed reality projects, December 15, 2023. Performance metrics for XR in training: Iop, Alessandro, Olga Viberg, Adrian Elmi-Terander, Erik Edström, and Mario Romero. \"On Extended Reality Objective Performance Metrics for Neurosurgical Training.\" InEuropean Conference on Technology Enhanced Learning, pp. 573-579. Cham: Springer Nature Switzerland, 2023, (HTML, PDF). Adopting extended reality?: de Giorgio, Andrea, Fabio Marco Monetti, Antonio Maffei, Mario Romero, and Lihui Wang. \"Adopting extended reality? A systematic review of manufacturing training and teaching applications.\"Journal of manufacturing systems 71 (2023): 645-663, (HTML, PDF). IVIS23 Online Open House: Students of Information Visualization 2023 present their final projects to an open audience, including InfraVis application experts. Review of XR in neurosurgical training: Iop, Alessandro, Victor Gabriel El-Hajj, Maria Gharios, Andrea de Giorgio, Fabio Marco Monetti, Erik Edström, Adrian Elmi-Terander, and Mario Romero. \"Extended reality in neurosurgical education: A systematic review.\"Sensors 22, no. 16 (2022): 6067, (HTML, PDF). Digital Twins in Airports: Conde, Javier, Andres Munoz-Arcentales, Mario Romero, Javier Rojo, Joaquín Salvachúa, Gabriel Huecas, and Álvaro Alonso. \"Applying digital twins for the management of information in turnaround event operations in commercial airports.\"Advanced Engineering Informatics 54 (2022): 101723, (HTML, PDF). DH2413 Open House 2022: Our Advanced Graphics and Interaction students present their augmented and mixed reality projects, December 16, 2021. DH2413 Open House 2021: Our Advanced Graphics and Interaction students present their augmented and mixed reality projects, December 17, 2021. IVA100 2021: The Royal Swedish Academy of Engineering Sciences (IVA) has selected our project VisBaC to the List of 100 research2business projects with a focus on sustainable crisis preparedness. May 11, 2021. KTH EECS Profile Pages: KTH EECS Communication 3-minute video where I chat about how to improve your profile pages. May 4, 2021. Eurographics 2021: Education Track Session 1 Chair and Session 3 panelist on May 6, 2021. Final projects Information Visualization: The students of Information Visualization present their 9 final group projects. Please, join me in congratulating their effort by interacting with their work. March 13, 2021. A/RporTWIN: FIWARE powered AR visualization tools created for airport operations. In the News: 2021-03-17. DH2321 Information Visualization: Leading innovative projects as part of the first online Information Visualization IVIS21 course at KTH between January and March 2021. AGI20 Digital Open House: Our Advanced Graphics and Interaction students present their augmented and mixed reality projects, December 16, 2020. Live Webinar: Fluid Dynamics for understanding aerosol transport with relevance to respiratory disorders and treatment; a research-driven education live webinar. Nov 11-12, 2021. KTH Intra: In the news 2020-06-11: how to create an effective webpage for researchers at KTH. DDS EEC: Energy Effective Care aims to improve hospital care with IoT sensing, machine learning and visualization. Funding: ViableCities. In the news 2020-06-26. VisBac: Visualizing airborne bacteria in operating rooms using computational fluid dynamics in virtual reality. Funding: FORMAS. In the news 2020-03-16. Homo Colossus: From Homo Sapiens to Homo Colossus: Visualizing our energy footprint. Funding: FORMAS. In the news 2020-01-02. Eurographics 2020: Chair of the Education track at Eurographics 2020. May 2020. Visit to Paris 8: Thanks to a research exchange grant from the French-Swede Instute I visited Paris 8, Fall 2019. Visualization Retreat: We planned the next year's educational, research, funding, and administrative activities at KTH Visualization Group. PCAT: Prostate Cancer Analysis Tool in collaboration with Karolinska Institutet Department of Urology and Janssen Sweden. VRTS2017: I am the International Publicity Chair at the 2017 Symposium on Virtual Reality Software and Technology. H2020Viz: Visualization of the funded projects in the European Research Council ERC -Horizon 2020. Partner: Vinnova. 2016-2018 IVIS17 CAwards: The students in Information Visualization 2017 participate in the C-Awards with 9 projects. Mixed Reality Stockholm:BFUF awarded 1.7M Kr toContext-Aware Augmented Reality Experiences In and Beyond the Museum.To press release. Docent Lecture: What can Human-Centered Visualization do for you? AGI16 Comic Con Stockholm: My students of Advanced Graphics and Interaction present their projects at Comic Con Gamex Stockholm. C-Awards 2016: My students won six out of eight total categories at the C-Awards 2016. Congratulations! Mixed Reality: Invited Lecture on mixed-reality whole-body interactions for healthy living. Forma i Luften @MegaMind: Exhibit at Tekniska Museet inviting people to shape the air in front of them and see, hear and feel the sculpture. 2016-2023 (present) Tidebanan: Exhibit at Spårvägsmuseet interactively visualizing the history of the city's metro system. To working project. 2015-2018. Anymaker 3D: A KTH master thesis turned into a startup for 3D finger sketching on iPads sponsored by KTH's Student Inc. 2014-2017. Areas of interest: #informationtechnology, #IT, #visualization, #informationvisualization, #datavisualization, #computergraphics, #hci, #human-computer interaction, #vr, #ar, #xr, #virtualreality, #augmentedreality, #mixedreality, #computervision, #data, #highereducation, #ubicomp, #education, #research, #science, #eng, #engineering, #design, #evaluation, #ux , #userstudies, #innovation, #mediatechnology, #graphics, #interaction, #interactiondesign, #ui, #uxdesign, #dataanalytics #research2business. PublicationsPublication listPortfolioPublications in DiVACurrent Research ActivitiesTENT Technology-Enhanced Neurosurgical TrainingHumanIC - Human-centric Indoor Climate for healthcare facilitiesSupervision and Examination ActivitiesTeaching ActivitiesExpert AssignmentsHomo Colossus at Tekniska MuseetPast ProjectsLinksLinkedInGoogle Scholar ProfileACM Digital Library Author ProfileEurographics ProfileResearchGateORCIDSCOPUSAcademiaSlide ShareX",
  "content_length": 9168,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:03"
}