{
  "name": "Maria Garcia de la Banda",
  "homepage": "https://research.monash.edu/en/persons/maria-garcia-de-la-banda",
  "status": "success",
  "content": "Maria Garcia De La Banda Garcia - Monash University Maria Garcia De La Banda public CV View Scopus Profile Maria Garcia De La Banda Garcia Professor Professor, Department of Data Science & AI https://orcid.org/0000-0002-6666-514X EmailMaria.GarciadelaBandamonashedu 1993 …2025 Research activity per year Personal profile BiographyMaria Garcia de la Banda is a Professor at the Faculty of Information Technology with more than 25 years of experience as an academic. She is currently a member of the ARC College of Experts, the Co-Chair of the Monash-Woodside FutureLab and until July 2022 the Deputy Dean Research of the Faculty. Prior to that she was overall Deputy Dean of the Faculty (2013-2016) and the Head of the Caulfield School of Information Technology (2009-2011). Her research interests include Combinatorial Optimisation, Program analysis and Transformation, Declarative Programming Languages and Bioinformatics. Since 2010 she has been Area Editor of the Journal of Theory and Practice of Logic Programming, and since 2019 member of the Editorial Board of the Constraints journal. She has attracted more than $20M in industry funding and $14M in nationally competitive funding, including $8M as CI in 11 ARC grants (5 as lead). Maria's PhD, awarded in 1994, won the Universidad Politecnica de Madrid's Best PhD Award. In 1997 she was awarded the first and only prestigious Logan Fellowship in the Faculty of Information Technology a role she held for 6 years. In 2005 she won, with Peter Stuckey, the International Constraint Modelling Challenge. She has been an elected member of the Executive Committee of the Association of Logic Programming (2005-2008) and of the Executive Committee of the Association of Constraint Programming (2017-2020), of which she was also elected as President (2019-2020). In 2021 she was inducted into the Monash Honour Roll.Monash teaching commitmentProfessor Maria Garcia de la Banda has experience as the Chief Examiner for the following units in the Faculty of IT: FIT1008/FIT1015 Introduction to computer scienceFIT3082 Programming Languages and Paradigms She has also experience as the Lecturer for the following units in the Faculty of IT: FIT1008/FIT1015 Introduction to computer scienceFIT3082 Programming Languages and ParadigmsCSE3301 Computer Science ProjectCSE1303 Computer ScienceCSE5340 Programming Language Concepts and SemanticsCSE2393/CSE3393/CSC/3930 Prolog Programming Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Universidad Politecnica de Madrid (Polytechnic University of Madrid)Award Date: 7 Jul 1994Computer Science, Ingeniero Informatico, Universidad Politecnica de Madrid (Polytechnic University of Madrid)Award Date: 1 Mar 1992 Research area keywordsProgram Analysis and TransformationConstraint ProgrammingCombinatorial OptimisationProblem Modelling And SolvingBioinformatics Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2000 2002 2008 2012 2015 2020 2021 2023 2027 1 Curtailed 4 Active 18 Finished Projects per year HARNESS: Hierarchical Abstractions and Reasoning for Neuro-Symbolic SystemsRezatofighi, H. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Gutierrez, J. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Ignatiev , A. (Chief Investigator (CI)), Swiecki, Z. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))20/06/23 → 20/02/27Project: Research Quantum Information Technology: Quantum Information Technology: Industry Readiness & ApplicationsSteinfeld, R. (Primary Chief Investigator (PCI)), simmons, M. (Chief Investigator (CI)), Usman, M. (Chief Investigator (CI)), Phung, D. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)), Pas, E. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Aleti, A. (Associate Investigator (AI)), Garcia De La Banda Garcia, M. (Associate Investigator (AI)), Nakashima, P. (Associate Investigator (AI)), Schmidt, D. (Associate Investigator (AI)), Esgin, M. (Associate Investigator (AI)) & Fay, J. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research ARC Training Centre in Optimisation Technologies, Integrated Methodologies, and Applications (OPTIMA)Smith-Miles, K. (Primary Chief Investigator (PCI)), Stuckey, P. (Chief Investigator (CI)), Taylor, P. G. (Chief Investigator (CI)), Ernst, A. (Chief Investigator (CI)), Aickelin, U. (Chief Investigator (CI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Pearce, A. (Chief Investigator (CI)), Wallace, M. (Chief Investigator (CI)), Bondell, H. (Chief Investigator (CI)), Hyndman, R. (Chief Investigator (CI)), Alpcan, T. (Chief Investigator (CI)), Thomas, D. A. (Chief Investigator (CI)), Anjomshoa, H. (Chief Investigator (CI)), Kirley, M. G. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)), Costa, A. (Chief Investigator (CI)), Fackrell, M. (Chief Investigator (CI)), Zhang, L. (Chief Investigator (CI)), Glazebrook, K. (Partner Investigator (PI)), Branke, J. (Partner Investigator (PI)), O'Sullivan, B. (Partner Investigator (PI)), O'Shea, N. (Partner Investigator (PI)), Cheah, A. (Partner Investigator (PI)), Meehan, A. (Partner Investigator (PI)), Wetenhall, P. (Partner Investigator (PI)), Bowly, D. (Partner Investigator (PI)), Bridge, J. (Chief Investigator (CI)), Faka, S. (Partner Investigator (PI)), Mareels, I. (Partner Investigator (PI)), Coleman, R. A. (Partner Investigator (PI)), Crook, J. (Partner Investigator (PI)), Liebman, A. (Chief Investigator (CI)) & Aleti, A. (Chief Investigator (CI))Equans Services Australia Pty Limited, Anonymous Donation Gift23/09/21 → 23/09/26Project: Research Building 4.0 CRC: Better buildings, new efficiencies through technology and collaborationAitchison, M. (Primary Chief Investigator (PCI)), Ngo, T. D. (Chief Investigator (CI)), Maxwell, D. (Chief Investigator (CI)), Couper, R. (Chief Investigator (CI)), Breen Lovett, S. (Chief Investigator (CI)), Cumarasamy, S. (Project Manager), Blue, K. (Project Manager), Laverty, C. (Project Manager), Gerber, P. (Chief Investigator (CI)), Merkoulova, Y. (Chief Investigator (CI)), Sohal, A. (Chief Investigator (CI)), Dare, R. (Chief Investigator (CI)), Moehler, R. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Grundy, J. (Chief Investigator (CI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), McCormack, J. (Chief Investigator (CI)), Vu, L. H. (Chief Investigator (CI)), Dwyer, T. (Chief Investigator (CI)), Murray, S. (Chief Investigator (CI)), Kulic, D. (Chief Investigator (CI)), Bai, Y. (Chief Investigator (CI)), Davies, C. (Chief Investigator (CI)), Zhou, J. (Chief Investigator (CI)), Duffield, C. (Chief Investigator (CI)), Singh, P. J. (Chief Investigator (CI)), Bridge, A. (Chief Investigator (CI)), Erol, I. (Chief Investigator (CI)), Drogemuller, R. (Chief Investigator (CI)) & Mahendran, M. (Chief Investigator (CI))10/09/20 → 30/06/27Project: Research WMEP-IT-2A-017 Hydrogen Value Chain DesignGarcia De La Banda Garcia, M. (Primary Chief Investigator (PCI)), Belov, G. (Chief Investigator (CI)), Czauderna, T. (Chief Investigator (CI)), Palmer, G. (Chief Investigator (CI)), Wang, C. (Chief Investigator (CI)) & Honnery, D. (Chief Investigator (CI))2/08/21 → 30/09/21Project: Research View all 23 projects Research output Research output per year 1993 1999 2004 2005 2007 2008 2009 2014 2017 2020 2023 2025 59 Conference Paper 44 Article 4 Book 4 Other 8 More 3 Chapter (Book) 2 Foreword / Postscript 1 Abstract 1 Editorial 1 Letter Research output per year Research output per year NEUSIS: A Compositional Neuro-Symbolic Framework for Autonomous Perception, Reasoning, and Planning in Complex UAV Search MissionsCai, Z., Cardenas, C. R., Leo, K., Zhang, C., Backman, K., Li, H., Li, B., Ghorbanali, M., Datta, S., Qu, L., Gutierrez, J., Ignatiev, A., Li, Y.-F., Vered, M., Stuckey, P. J., De La Banda, M. G. & Rezatofighi, H., Sept 2025, In: IEEE Robotics and Automation Letters. 10, 9, p. 9502-9509 8 p.Research output: Contribution to journal › Article › Research › peer-review PhiSiCal-Checkup: A Bayesian framework to validate amino acid conformations within experimental protein structuresAmarasinghe, P. R., Allison, L., Morton, C. J., Stuckey, P. J., de la Banda, M. G., Lesk, A. M. & Konagurthu, A. S., 2 Jan 2025, In: Proceedings of the National Academy of Sciences of the United States of America. 122, 1, 9 p., e2416301121.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Automatic core-guided reformulation via constraint explanation and condition learningLeo, K., Gange, G., Garcia de la Banda, M. & Wallace, M., 2024, Thirty-Eighth AAAI Conference on Artificial Intelligence. Wooldridge, M., Dy, J. & Natarajan, S. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 8065-8072 8 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 38, no. 8).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 1 Citation (Scopus) SuperStack: Superoptimization of Stac",
  "content_length": 12537,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:20"
}