{
  "name": "Maria Kyropoulou",
  "homepage": "https://www.essex.ac.uk/people/kyrop21400/maria-kyropoulou",
  "status": "success",
  "content": "Maria Kyropoulou | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Maria Kyropoulou People Dr Maria Kyropoulou Faculty Director of Partnerships - Senior Lecturer (R) School of Computer Science and Electronic Engineering (CSEE) Email maria.kyropoulou@essex.ac.uk Location 1NW.3.13, Colchester Campus Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I am a Senior Lecturer at the School of Computer Science and Electronic Engineering, University of Essex since October 2020. I was a lecturer in the same department since August 2017. Prior to this, I was a postdoctoral researcher at the University of Oxford, and a stipendiary lecturer for Computer Science at Hertford College, University of Oxford. I received my PhD in Computer Science from the University of Patras in 2014, and I hold an MSc in \"Computer Science and Technology\" and a (5-year) degree in \"Computer Engineering and Informatics\" from the same institution. During my PhD studies, I was a junior researcher at the Computer Technology Institute \"Diophantus\", an R&D centre with strong ties to the academia. Research and professional activities Research interests Algorithmic Game Theory; Algorithmic Mechanism Design; Blockchain; Design and Analysis of Algorithms Teaching and supervision Current supervision Raghav Sharma Degree subject: Computational Finance Degree type: Doctor of Philosophy Mohammad Lotfi Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Hao Zhou Thesis title: A Study on the Impact of Strategic Behaviour in Financial Networks Degree subject: Computational Finance Degree type: Doctor of Philosophy Awarded date: 28/11/2023 Chen Chen Thesis title: Stock Market Investment Using Machine Learning Degree subject: Computational Finance Degree type: Doctor of Philosophy Awarded date: 23/12/2022 Publications Journal articles (21) Caragiannis, I., Kanellopoulos, P. and Kyropoulou, M., (2025). On interim envy-free allocation lotteries. Mathematics of Operations Research. 50 (4), 3257-3282 Christodoulaki, E., Kampouridis, M. and Kyropoulou, M., (2025). A novel strongly-typed Genetic Programming algorithm for combining sentiment and technical analysis for algorithmic trading. Knowledge-Based Systems. 311, 113054-113054 Kyropoulou, M. and Ventre, C., (2025). Obviously Strategyproof Mechanisms without Money for Scheduling. SIAM Journal on Discrete Mathematics. 39 (2), 1102-1122 Kyropoulou, M. and Voudouris, A., (2025). The Price of EF1 for Few Agents with Additive Ternary Valuations. Operations Research Letters. 63, 107351-107351 Qi, J., Woolway, M., Kyropoulou, M., Kanellopoulos, P. and Steele, D., (2025). Telematics in Insurance: Challenges and Limitations. IEEE Access. 13, 147449-147466 Kyropoulou, M. and Voudouris, AA., (2025). The Price of EF1 for Few Agents with Additive Ternary Valuations.. CoRR. abs/2508.09869 Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2025). Optimal Bailouts and Strategic Debt Forgiveness in Financial Networks. Artificial Intelligence. 349, 104424-104424 Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2024). On priority-proportional payments in financial networks. Theoretical Computer Science. 1014, 114767-114767 Kanellopoulos, P., Kyropoulou, M. and Voudouris, A., (2023). Not all Strangers are the Same: The Impact of Tolerance in Schelling Games. Theoretical Computer Science. 971, 114065-114065 Kyropoulou, M., Ortega, J. and Segal-Halevi, E., (2022). Fair Cake-Cutting in Practice. Games and Economic Behavior. 133, 28-49 Kampouridis, M., Kanellopoulos, P., Kyropoulou, M., Melissourgos, T. and Voudouris, A., (2022). Multi-Agent Systems for Computational Economics and Finance. AI Communications: the European journal on artificial intelligence. 35 (4), 369-380 Kanellopoulos, P., Kyropoulou, M. and Voudouris, AA., (2021). Modified Schelling games. Theoretical Computer Science. 880, 1-19 Kyropoulou, M., Suksompong, W. and Voudouris, AA., (2020). Almost Envy-Freeness in Group Resource Allocation. Theoretical Computer Science. 841, 110-123 Yiannis, G., Koutsoupias, E. and Kyropoulou, M., (2019). The Anarchy of Scheduling Without Money. Theoretical Computer Science. 778, 19-32 Giannakopoulos, Y. and Kyropoulou, M., (2017). The VCG Mechanism for Bayesian Scheduling. ACM Transactions on Economics and Computation. 15 (4), 1-16 Caragiannis, I., Kaklamanis, C. and Kyropoulou, M., (2016). Limitations of Deterministic Auction Design for Correlated Bidders. ACM Transactions on Computation Theory. 8 (4), 1-18 Caragiannis, I., Kaklamanis, C., Kanellopoulos, P., Kyropoulou, M., Lucier, B., Paes Leme, R. and Tardos, É., (2015). Bounding the inefficiency of outcomes in generalized second price auctions. Journal of Economic Theory. 156, 343-388 Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Kyropoulou, M., (2014). Revenue Guarantees in the Generalized Second Price Auction. ACM Transactions on Internet Technology. 14 (2-3), 1-19 Caragiannis, I., Kaklamanis, C. and Kyropoulou, M., (2013). Tight approximation bounds for combinatorial frugal coverage algorithms. Journal of Combinatorial Optimization. 26 (2), 292-309 Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Kyropoulou, M., (2012). The Efficiency of Fair Division. Theory of Computing Systems. 50 (4), 589-610 Karanikolas, N., Kyropoulou, M. and Sørensen, TB., (2011). Solution to Exchanges 9.1 puzzle: borrowing as cheaply as possible. ACM SIGecom Exchanges. 10 (2), 51-52 Show all Books (2) Kanellopoulos, P., Kyropoulou, M. and Voudouris, AA., (2022). Preface (2022). Algorithmic Game Theory - 15th International Symposium, SAGT 2022, Colchester, UK, September 12-15, 2022, Proceedings. Springer. 3031157133. 978-3-031-15713-4 Conferences (24) Kanellopoulos, P., Kyropoulou, M. and Zhou, H., Forgiving Debt in Financial Network Games: Extended Abstract Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2023). Debt Transfers in Financial Networks: Complexity and Equilibria Christodoulaki, E., Kampouridis, M. and Kyropoulou, M., (2023). Enhanced Strongly typed Genetic Programming for Algorithmic Trading Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2022). Forgiving Debt in Financial Network Games Kanellopoulos, P., Kyropoulou, M. and Voudouris, A., (2022). Not all Strangers are the Same: The Impact of Tolerance in Schelling Games Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2021). Financial network games Caragiannis, I., Kanellopoulos, P. and Kyropoulou, M., (2021). On Interim Envy-Free Allocation Lotteries De Keijzer, B., Kyropoulou, M. and Ventre, C., (2020). Obviously Strategyproof Single-Minded Combinatorial Auctions Kanellopoulos, P., Kyropoulou, M. and Voudouris, A., (2020). Modified Schelling Games Kyropoulou, M., Suksompong, W. and Voudouris, AA., (2019). Almost Envy-Freeness in Group Resource Allocation Kyropoulou, M., Ventre, C. and Zhang, X., (2019). Mechanism Design for Constrained Heterogeneous Facility Location Kyropoulou, M., Ortega, J. and Segal-Halevi, E., (2019). Fair Cake-Cutting in Practice Kyropoulou, M. and Ventre, C., (2019). Obviously strategyproof mechanisms without money for scheduling Giannakopoulos, Y., Koutsoupias, E. and Kyropoulou, M., (2016). The anarchy of scheduling without money Kiayias, A., Koutsoupias, E., Kyropoulou, M. and Tselekounis, Y., (2016). Blockchain Mining Games Giannakopoulos, Y. and Kyropoulou, M., (2015). The VCG mechanism for Bayesian scheduling Caragiannis, I., Kaklamanis, C. and Kyropoulou, M., (2013). Limitations of Deterministic Auction Design for Correlated Bidders Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Kyropoulou, M., (2012). Revenue Guarantees in Sponsored Search Auctions Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Kyropoulou, M., (2011). On the efficiency of equilibria in generalized second price auctions Caragiannis, I., Kaklamanis, C. and Kyropoulou, M., (2011). Tight Approximation Bounds for Greedy Frugal Coverage Algorithms Caragiannis, I., Kaklamanis, C., Kanellopoulos, P., Kyropoulou, M. and Papaioannou, E., (2010). The Impact of Altruism on the Efficiency of Atomic Congestion Games Athanassopoulos, S., Caragiannis, I., Kaklamanis, C. and Kyropoulou, M., (2009). An Improved Approximation Bound for Spanning Star Forest and Color Saving Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Kyropoulou, M., (2009). On Low-Envy Truthful Allocations Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Kyropoulou, M., (2009). The Efficiency of Fair Division Show all Grants and funding 2025 Blockchain incentives: consensus and fairness Engineering and Physical Sciences Research Council 2023 University of Essex and Ticker Limited KTP 23_24 R1. Project aim: 'To revolutionise the collection and utilisation of driver performance behaviour data through application of leading-edge game theory and artificial intelligence approaches'. Innovate UK (formerly Technology Strategy Board) 202",
  "content_length": 11673,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:26"
}