{
  "name": "Mario Berta",
  "homepage": "http://marioberta.info",
  "status": "success",
  "content": "Mario Berta | Quantum Information at RWTH Aachen University Skip to content I am a Professor of Physics at the Institute for Quantum Information RWTH Aachen University. I hold an honorary position as a Visiting Reader at the Department of Computing Imperial College London. Previously, I was a Senior Research Scientist at the Amazon Web Services Center for Quantum Computing and a Postdoctoral Researcher at the Institute for Quantum Information and Matter Caltech. I obtained my PhD degree from the Institute for Theoretical Physics at ETH Zurich. The research in our group at RWTH Aachen is on mathematical questions in quantum information science, focusing on quantum communication theory, theoretical quantum cryptography, and the theory of quantum algorithms. News QIP26: Our group will present 3 contributed talks at QIP 2026 in Riga next year. Quantum algorithms: New preprint “Rapid mixing of quantum Gibbs samplers for weakly-interacting quantum systems“. Information theory: New preprint “Routed Bell tests with arbitrarily many local parties“ Information theory: New preprint “Fundamental quality bound on optical quantum communication“. Information theory: New preprint “Strong converse exponent of channel interconversion“. Review article: Quantum algorithms: A survey of applications and end-to-end complexities appeared with Cambridge University Press (2025). BeyondIID13: Our group presented 6 contributed talks at Beyond IID 13 in Munich this year. Workshop: We organizsed Mathematics of Quantum Information at RWTH Aachen from July 10 – July 12 at Forum M Veranstaltungsforum. QIP25: Our group presented 3 contributed talks at QIP 2025 in Raleigh this year. Popular article: Algorithmen für neue Hardware (in German) [open access] We acknowledge funding from the European Research Council (ERC), the Cluster of Excellence Matter and Light for Quantum Computing (ML4Q), the Bundesministerium für Bildung und Forschung (BMBF), the RWTH Exploratory Research Space (ERS), and the Engineering and Physical Sciences Research Council (EPSRC).",
  "content_length": 2054,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:52"
}