{
  "name": "Mario Linares-Vásquez",
  "homepage": "https://profesores.virtual.uniandes.edu.co/mlinaresv",
  "status": "success",
  "content": "Mario Linares Vásquez Mario Linares Vásquez Profesor Asistente Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Contacto: Oficina: Office: ML 652 Correo: Email: Extensión: Extension: 1674 ResearchGate GoogleScholar DPLB Formación Investigación Publicaciones Cursos Dictados Premios Servicio Proyectos Ph.D Ciencias de la Computación, College of William and Mary, USA Master Ingeniería de Sistemas y Computación, Universidad Nacional, Colombia Ingeniero de Sistemas y Computación, Universidad Nacional, Colombia Intereses y líneas de Investigación: Evolución y mantenimiento de software (énfasis en aplicaciones Android) Minería de repositorios de software Generación automática de resúmenes de código Pruebas automáticas de aplicaciones móviles Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar A comparative study of GUI testing for mobile android applications Tesis 2025 .(2025). A comparative study of GUI testing for mobile android applications.Trabajo Dirigido por: Linares-Vásquez M - 2025 ANTARES: A Software-Based Tool for Simulating Naval Radar Operations Capítulo en Memoria 2025 Urrea J, Barreto C, Linares-Vásquez M. (2025) ANTARES: A Software-Based Tool for Simulating Naval Radar Operations. 2025 IEEE International Conference on Military Technologies (ICMT) 2025 International Conference on Military Technologies (ICMT) (ISBN 979-8-3315-2338-1) Brno, República Checa. - 2025 ANTARES: simulador de radar de vigilancia en entornos navales Tesis 2025 .(2025). ANTARES: simulador de radar de vigilancia en entornos navales.Trabajo Dirigido por: Linares-Vásquez M - 2025 APOLO Sistema de administración de actividades para los Profesionales Oficiales de Reserva de la Fuerza Aeroespacial Colombiana Tesis 2025 .(2025). APOLO Sistema de administración de actividades para los Profesionales Oficiales de Reserva de la Fuerza Aeroespacial Colombiana.Trabajo Dirigido por: Linares-Vásquez M - 2025 An analytical approach to named entity recognition for military aerospace intelligence Artículo 2025 Zabala-lópez A, Linares-Vásquez M, Haiduc S, Donoso Y. (2025) An analytical approach to named entity recognition for military aerospace intelligence. Decision Analytics Journal (ISSN 2772-6622) 16 (N/A), pp. 1-15. - 2025 Answering Aerospace Military Doctrinal and Regulatory Questions with RAG and LLMs Tesis 2025 .(2025). Answering Aerospace Military Doctrinal and Regulatory Questions with RAG and LLMs.Trabajo Dirigido por: Linares-Vásquez M - 2025 Circular Economy in the Armed Forces: Systematic Literature Review and Case Analysis in the Colombian Army Artículo 2025 Meza C, Linares-Vásquez M, Donoso Y. (2025) Circular Economy in the Armed Forces: Systematic Literature Review and Case Analysis in the Colombian Army. Circular Economy and Sustainability (ISSN 27305988) 5 (4), pp. 1-24. - 2025 Development of a Test Bench for Fault Diagnosis in the Caution and Warning Panels of the UH-60 Helicopter Artículo 2025 Saenz C, CUADROS R, RATIVA E, Linares-Vásquez M, Donoso Y, LOZANO C. (2025) Development of a Test Bench for Fault Diagnosis in the Caution and Warning Panels of the UH-60 Helicopter. ENG (ISSN 2673-4117) 6 (5), pp. 1-20. - 2025 Exploring agile methodologies in aerospace software development: a preliminary literature review Tesis 2025 .(2025). Exploring agile methodologies in aerospace software development: a preliminary literature review.Trabajo Dirigido por: Linares-Vásquez M - 2025 From Triumph to Uncertainty: The Journey of Software Engineering in the AI Era Artículo 2025 Mastropaolo A, Escobar-Velásquez C, Linares-Vásquez M. (2025) From Triumph to Uncertainty: The Journey of Software Engineering in the AI Era. ACM Trans. Softw. Eng. Methodol. (ISSN 1049-331X) 34 (5), pp. 1-34. - 2025 A Survey of data-centric technologies supporting decision-making before deploying military assets Artículo 2024 Zabala A, Linares-Vásquez M, Haiduc S, Donoso Y. (2024) A Survey of data-centric technologies supporting decision-making before deploying military assets. Defence Technology (ISSN 2096-3459) 1 (1), pp. 1-49. - 2024 Desarrollo web de sistema de historias clínicas de la Universidad de los Andes Tesis 2024 .(2024). Desarrollo web de sistema de historias clínicas de la Universidad de los Andes.Trabajo Dirigido por: Linares-Vásquez M - 2024 Diámetro: aplicación móvil para la protección de periodistas en campo Tesis 2024 .(2024). Diámetro: aplicación móvil para la protección de periodistas en campo.Trabajo Dirigido por: Linares-Vásquez M - 2024 Management innovation and analytics to support the decision-making process in the information analysis phase before using air power in Colombia Tesis 2024 .(2024). Management innovation and analytics to support the decision-making process in the information analysis phase before using air power in Colombia.Trabajo Dirigido por: Linares-Vásquez M, Donoso Y - 2024 Mindfulness en la universidad: un puente hacia menor deserción y mayor bienestar Artículo 2024 Arias A, Linares-Vásquez M. (2024) Mindfulness en la universidad: un puente hacia menor deserción y mayor bienestar. Imprenta - Publicación divulgativa de la Facultad de Ciencias Sociales - Universidad de los Andes (ISSN 11111111) 4 (-), pp. 94-100. - 2024 Preliminary Design of Satellite Systems Through the Integration of Model-Based System Engineering and Agile Methodologies: Application to the 3ColStar Mission Artículo 2024 Buitrago-Leiva J, Puerta J, Mejia J, Acero I, Guarnizo A, Rodríguez J, Rojas L, Hernández F, Arango C, Salazar J, Herrera M, Linares-Vásquez M, Jimenez J, Espíndola J, Montañez O, Camps A. (2024) Preliminary Design of Satellite Systems Through the Integration of Model-Based System Engineering and Agile Methodologies: Application to the 3ColStar Mission. Aerospace (ISSN 2226-4310) 11 (09), pp. 1-52. - 2024 Prototype of pharmacogenomics software for informed decision-making in Colombia Tesis 2024 .(2024). Prototype of pharmacogenomics software for informed decision-making in Colombia.Trabajo Dirigido por: Linares-Vásquez M - 2024 The Rise and Fall(?) of Software Engineering Capítulo en Memoria 2024 Escobar-Velásquez C, Linares-Vásquez M. (2024) The Rise and Fall(?) of Software Engineering. 2030 Software Engineering at the ACM International Conference on the Foundations of Software Engineering (FSE'24) Brasil. - 2024 A Pilot Study to Assess the Effects of Guided Voice-Synthesized Mindfulness Meditation on University Students through EEG Measurement Capítulo en Memoria 2023 Arias A, Juárez-Varón D, Linares-Vásquez M. (2023) A Pilot Study to Assess the Effects of Guided Voice-Synthesized Mindfulness Meditation on University Students through EEG Measurement. IEEE Colombian Caribbean Conference Colombia. - 2023 Automated Surface Threat Evaluation on Naval Vessels with Limited Capabilities Capítulo en Memoria 2023 Barreto-Reyes C, Linares-Vásquez M, Barreto C. (2023) Automated Surface Threat Evaluation on Naval Vessels with Limited Capabilities. IV Congreso Iberoamericano de Ingeniería Naval España. - 2023 2016 2016-20 LAB. ESTRUCTURAS DATOS ESTRUCTURAS DE DATOS PROGR CON TECNOLOGIAS WEB 2017 2017-10 LAB. CONSTR. APLICAC. MOVILES ESTRUCTURAS DE DATOS LAB. ESTRUCTURAS DATOS CONSTR. APLICACIONES MÓVILES 2017-20 PRUEBAS AUTOMÁTICAS LAB. CONSTR. APLICAC. MOVILES CONSTR. APLICACIONES MÓVILES 2018 2018-10 CONSTR. APLICACIONES MÓVILES PRUEBAS AUTOMÁTICAS 2018-19 PROYECTO DIRIGIDO 2018-20 LAB. ESTRUCTURAS DATOS CONSTR. APLICACIONES MÓVILES ESTRUCTURAS DE DATOS PRUEBAS AUTOMÁTICAS 2019 2019-10 CONSTR. APLICACIONES MÓVILES PRUEBAS AUTOMÁTICAS M-HEALTH 2019-20 CONSTR. APLICACIONES MÓVILES PRUEBAS AUTOMÁTICAS 2020 2020-10 CONSTR. APLICACIONES MÓVILES PRUEBAS AUTOMÁTICAS 2020-19 M-HEALTH 2020-20 CONSTR. APLICACIONES MÓVILES PRUEBAS AUTOMÁTICAS M-HEALTH 2021 2021-10 CONSTR. APLIC.MÓVILES (INGLÉS) 2021-11 PRUEBAS AUTOMATIZADAS 2021-12 PRUEBAS AUTOMATIZADAS 2021-15 ING. SW APLICACIONES MÓVILES 2021-20 M-HEALTH CONSTR. APLIC.MÓVILES (INGLÉS) 2022 2022-10 PROYECTO DE GRADO PRUEBAS AUTOMATIZADAS CONSTR. APLIC.MÓVILES (INGLÉS) INTROD. INGENIERÍA DE SISTEMAS M-HEALTH 2022-12 PRUEBAS AUTOMATIZADAS 2022-15 ING. SW APLICACIONES MÓVILES PRUEBAS AUTOMATIZADAS 2022-20 CONSTR. APLIC.MÓVILES (INGLÉS) M-HEALTH PROYECTO DE GRADO 2023 2023-10 CONSTR. APLIC.MÓVILES (INGLÉS) PROGR CON TECNOLOGÍAS WEB PRUEBAS AUTOMATIZADAS PROYECTO DE GRADO 2023-12 PRUEBAS AUTOMATIZADAS ING. SW APLICACIONES MÓVILES 2023-15 ING. SW APLICACIONES MÓVILES PRUEBAS AUTOMATIZADAS 2023-20 CONSTR. APLIC.MÓVILES (INGLÉS) PRUEBAS AUTOMATIZADAS PROYECTO DE GRADO DESARROLLO DE SW EN EQUIPO 2024 2024-10 CONSTR. APLIC.MÓVILES (INGLÉS) DESARROLLO DE SW EN EQUIPO PRUEBAS AUTOMATIZADAS PROYECTO DE GRADO M-HEALTH 2024-12 ING. SW APLICACIONES MÓVILES PRUEBAS AUTOMATIZADAS 2024-15 PRUEBAS AUTOMATIZADAS ING. SW APLICACIONES MÓVILES 2024-18 AI FOR SOFTWARE ENGINEERING 2024-20 INTROD. INGENIERÍA DE SISTEMAS PRUEBAS AUTOMATIZADAS CONSTR. APLIC.MÓVILES (INGLÉS) PROYECTO DE GRADO 2025 2025-10 INV. CUALITATIVA-CUANTITATIVA PRUEBAS AUTOMATIZADAS INTROD. INGENIERÍA DE SISTEMAS SEMINARIO DOCTORAL I PROYECTO DE GRADO CONSTR. APLIC.MÓVILES (INGLÉS) 2025-12 PRUEBAS AUTOMATIZADAS ING. SW APLICACIONES MÓVILES 2025-15 PRUEBAS AUTOMATIZADAS ING. SW APLICACIONES MÓVILES 2025-20 PROYECTO DE GRADO CONSTR. APLIC.MÓVILES (INGLÉS) PRUEBAS AUTOMATIZADAS PROYECTO II Best/D",
  "content_length": 13269,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:03"
}