{
  "name": "Maria Luísa Torres Ribeiro Marques da Silva Coheur",
  "homepage": "https://www.l2f.inesc-id.pt/wiki/index.php/Lu%C3%ADsa_Coheur",
  "status": "success",
  "content": "Luísa Coheur - HLT@INESC-ID Luísa Coheur From HLT@INESC-ID Luísa CoheurProfessor Associado | SA-HLT E019-3D83-3793 0000-0002-2456-5028 A-7554-2012 +351213100300     234A luisa.coheur@inesc-id.pt www.hlt.inesc-id.pt/~lcoheur/ Luísa Coheur was born in Lisbon, is married and has three children. She holds a degree in Applied Mathematics and Computer Science from the Instituto Superior Técnico (IST) and a Ph.D. from IST and Université Blaise-Pascal in the field of Natural Language Processing. In 2023, she completed a one-year postgraduate program in \"Higher Education Pedagogy,\" offered by the Institute of Education at the University of Lisbon. She is an Associate Professor at the Department of Computer Science and a Researcher at INESC-ID, in the \"Human Language Technologies\" group. Her preferred research topics focus on Dialogue Systems, Question/Answer, and Machine Translation (including for Portuguese Sign Language). She has supervised over 80 master's theses and 10 doctoral students (some of whom named their daughters Luísa). She was a member of the Management Committee of IST-Taguspark (20-23), being responsible for the beautiful library and pedagogical organization. She has participated in 17 projects, both national and international, has more than 120 peer-reviewed articles published, and has been recognized as an Excellent Professor more than 20 times according to the IST QUC classification. In 2023, she was recognized with the IST Outstanding Teaching Award from IST's Pedagogic Council. Luísa Coheur loves teaching and is passionate about good stories. She has few certainties in life, but there are three things she firmly believes in: 1) a motivated student can work wonders; 2) with hard work, we can overcome our limitations (not that she has any); 3) we can do very serious and rigorous work and still be extremely fun. Therefore, she tries to make each class and each article good stories and introduces playful elements and narratives in teaching whenever they make sense (which is often). Virtual escape games and characters like Inspector Morcela and Karen help her convey knowledge in her classes. She won a pedagogical innovation project in 2019 with a physical \"Escape Game\" on the Taguspark campus, which ran that year for the Logic for Programming course and later, with the help of her colleague Ana Moura Santos, for Linear Algebra (students had to solve challenges related to these subjects to \"escape\").When she has time (unfortunately almost never), she writes. She has three books and two (non-scientific) short stories published, with two of them receiving awards. She is restoring what she considers to be a true palace in Ferreira do Zêzere, proudly embracing roles as a bricklayer, carpenter, etc., on weekends. She considers herself an expert in plasterboard, OSB boards, and hydraulic lime.Dialogue systems, Machine Translation, Question/Answer Total Publications: 159Article (Author)Artificial intelligence in smartphone video analysis for equine asthma diagnostic supportCarolina da Silva Gomes, Luísa Coheur, Paula Tilley, Equine Veterinary Journal, DOI https://doi.org/10.1111/evj.14559, July 2025Towards cyberbullying detection: Building, benchmarking and longitudinal analysis of aggressiveness and conflicts/attacks datasets from TwitterPaula Ferreira, Nádia Pereira, Hugo Rosa, Sofia Oliveira, Luísa Coheur, Joao P. Carvalho, Ricardo Ribeiro, Paula Paulino, Isabel Trancoso, Ana Margarida Veiga Simão, IEEE Transactions on Affective Computing, vol. 16, n. 3, pages 1473 - 1487, DOI 10.1109/TAFFC.2024.3518587, July 2025A Review of Multimodal AI in Veterinary Diagnosis: Current Trends, Challenges, and Future DirectionsCarolina da Silva Gomes, Luísa Coheur, Paula Tilley, IEEE Access, vol. 13, pages 97846 - 97858, DOI 10.1109/ACCESS.2025.3575343, May 2025xcomet: Transparent Machine Translation Evaluation through Fine-grained Error DetectionNuno Guerreiro, Ricardo Rei, Dan Daan van Stigt, Luísa Coheur, Pierre Colombo, André F. T. Martins, Transactions of the Association for Computational Linguistics, vol. 12, pages 979–995, DOI 10.1162/tacl_a_00683, January 2024Onception: Active Learning with Expert Advice for Real World Machine TranslationVânia Mendonça, Ricardo Rei, Luísa Coheur, Alberto Sardinha, Computational Linguistics, DOI https://doi.org/10.1162/coli_a_00473, June 2023PE2LGP: tradutor de português europeu para língua gestual portuguesa em glosasMatilde do Carmo Lages Gonçalves, Luísa Coheur, Ana Mineiro, Hugo Nicolau, Linguamática, vol. 13, n. 1, pages 3-21, DOI https://doi.org/10.21814/lm.13.1.338, July 2021Towards the benchmarking of question generation: introducing the Monserrate corpusHugo Rodrigues, Eric Nyberg, Luísa Coheur, Language Resources and Evaluation, pages 1-19, DOI https://doi.org/10.1007/s10579-021-09545-5, June 2021Prosociality in Cyberspace: Developing Emotion and Behavioral Regulation to Decrease Aggressive CommunicationAna Margarida Veiga Simão, Paula Ferreira, Nádia Pereira, Sofia Oliveira, Paula Paulino, Hugo Rosa, Ricardo Ribeiro, Luísa Coheur, Joao P. Carvalho, Isabel Trancoso, Cognitive Computation, vol. 13, n. 3, pages 736–750, DOI 10.1007/s12559-021-09852-7, May 2021Avaliação de recursos computacionais para o portuguêsMatilde do Carmo Lages Gonçalves, Luísa Coheur, Jorge Baptista, Ana Mineiro, Linguamática, vol. 12, n. 2, pages 51-68, DOI https://doi.org/10.21814/lm.12.2.331, December 2020Benchmarking Natural Language Inference and Semantic Textual Similarity for Portuguese.Pedro Fialho, Luísa Coheur, Paulo Quaresma, Information, n. 11, November 2020The B-Subtle framework: tailoring subtitles to your needsMiguel Ventura, Jéssica Cristina Azevedo Veiga, Luísa Coheur, Sandra Gama, Language Resources and Evaluation, DOI 10.1007/s10579-020-09507-3, October 2020Automatic cyberbullying detection: A systematic reviewHugo Rosa, Nádia Pereira, Ricardo Ribeiro, Paula da Costa Ferreira, Joao P. Carvalho, Sofia Oliveira, Luísa Coheur, Paula Paulino, Ana Margarida Veiga Simão, Isabel Trancoso, Computers in Human Behavior, vol. 93, pages 333-345, DOI https://doi.org/10.1016/j.chb.2018.12.021, January 2019MUSED: A multimedia multi-document dataset for topic segmentationPedro Mota, Maxine Eskenazi, Luísa Coheur, Natural Language Engineering, vol. 24, n. 6, pages 921–946, DOI 10.1017/S1351324918000359, November 2018INESC-ID@ASSIN: Medição de Similaridade Semântica e Reconhecimento de Inferência Textual}Pedro Fialho, Ricardo Miguel Machado Marques, Bruno Martins, Luísa Coheur, Paulo Quaresma, Linguamática, pages 33-42, December 2016A linguistically motivated taxonomy for Machine Translation error analysisAngela Costa, Wang Ling, Tiago Luís, Rui Correia, Luísa Coheur, Machine Translation, vol. 29, pages 127-161, DOI 10.1007/s10590-015-9169-0, June 2015Projetos sobre Tradução Automática do Português no Laboratório de Sistemas de Língua Falada do INESC-IDAnabela Barreiro, Wang Ling, Luísa Coheur, Fernando Batista, Isabel Trancoso, Linguamática, vol. 6, n. 2, pages 75-85, December 2014Just Ask – A Multi-Pronged Approach to Question AnsweringAna Cristina Mendes, Luísa Coheur, João Pedro Carlos Gomes da Silva, Hugo Rodrigues, International Journal on Artificial Intelligence Tools, vol. 22, n. 1, pages 34, DOI 10.1142/S0218213012500364, February 2013Do tópico às respostas: do processo humano à sua simulaçãoLuísa Coheur, Angela Costa, Linguamática, vol. 4, n. 1, April 2012Question Generation based on Lexico-Syntactic Patterns Learned from the WebSérgio dos Santos Lopes Curto, Ana Cristina Mendes, Luísa Coheur, Dialogue & Discourse, vol. 3, n. 2, pages 147-175, DOI 10.5087/dad, March 2012When the answer comes into question in question-answering: survey and open issuesAna Cristina Mendes, Luísa Coheur, Natural Language Engineering, DOI 10.1017/S1351324911000350, January 2012Controlling Complexity in Part-of-Speech InductionJoão Graça, Kuzman Ganchev, Luísa Coheur, Fernando Pereira, Ben Taskar, Journal of Artificial Intelligence Research (JAIR), vol. 41, pages 527-551, September 2011From symbolic to sub-symbolic information in question classificationJoão Pedro Carlos Gomes da Silva, Luísa Coheur, Ana Cristina Mendes, Andreas Wichert, Artificial Intelligence Review, vol. 35, n. 2, pages 137-154, DOI 10.1007/s10462-010-9188-4, November 2010Tradução Automática EstatísticaJoão Graça, Diamantino António Caseiro, Luísa Coheur, 3Ts - Revista de Tradução, Terminologia e Tecnologias, n. 0, pages 91-102, December 2009Uma Interface Sintaxe-Semântica no Quadro do Paradigma 5PLuísa Coheur, Nuno J. Mamede, Gabriel Bès, Palavra, vol. 12, pages 75-90, December 2004In Proceedings (Author)Diving into gender translation bias for the Portuguese languageSofia Bonifácio, Helena Moniz, Luísa Coheur, ECAI 2025, October 2025Evaluating Asthma in Equines with Video RecordingsCarolina da Silva Gomes, Paula Tilley, Luísa Coheur, Progress in Artificial Intelligence, LNAI, Springer Nature Link, vol. 14968, pages 38–49, November 2024Information retrieval using fuzzy fingerprintsGonçalo Raposo, Joao P. Carvalho, Luísa Coheur, Bruno Martins, Information Processing and Management of Uncertainty in Knowledge-Based Systems, LNNS, Springer Nature, vol. 1174, pages 99–112, July 2024Leveraging Fuzzy Fingerprints from Large Language Models for Authorship AttributionRui Orlando Magalhães Ribeiro, Joao P. Carvalho, Luísa Coheur, 2024 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE), June 2024A Rewriting Approach for Gender Inclusivity in PortugueseLeonor Veloso, Rui Orlando Magalhães Ribeiro, Luísa Coheur, Findings of the Association for Computational Linguistics: EMNLP 2023, Association for Computational Linguistics, pages 8747–8759, December 2023Towards Realistic Sign Language AnimationsInês Lacerda, Hugo Nicolau, Luísa Coheur, IVA '23: Proceedings of the 23rd ACM International Conference on Intelligent Virtual Agents, IVA, Association for Computing Machinery, vol. 55, pages 1-4, December 2023Enhancing Accessible Communication: from Eur",
  "content_length": 71942,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:31"
}