{
  "name": "Maribel Acosta",
  "homepage": "https://www.ini.rub.de/the_institute/people/maribel-acosta",
  "status": "success",
  "content": "Prof. Dr. Maribel Acosta | People | Institut für Neuroinformatik RUB INI Alumni Prof. Dr. Maribel Acosta maribel.acosta@ini.rub.de (+49) 234-32-19612 Prof. Dr. Maribel Acosta Databases and Information Systems Databases and Information Systems maribel.acosta@ini.rub.de (+49) 234-32-19612 About Me Curriculum Vitae Publications Teaching Supervised Theses Blog Projects Research My research lies in the areas of Databases, Semantic Web, and Artificial Intelligence, where I have extensively investigated novel techniques to query Knowledge Graphs efficiently and effectively. More recently, I have studied the application of Machine Learning approaches to solve diverse problems in the management of Knowledge Graphs. Data Engineering and Management Databases Semantic Web Knowledge Representation Applications of Machine Learning Affiliations at the Ruhr-University Bochum Faculty of Computer Science Machine Learning and Artificial Intelligence @ RUB (ML&AI) Awards Nomination for Best Paper Award, The ACM Web Conference (WWW), 2022 Top-100 Most Influential Scholars in the field of AI Knowledge Engineering (ranked 17) by Aminer, 2021 Top-100 Most Influential Scholars in the field of AI Knowledge Engineering (ranked 51) by Aminer, 2020 Teaching Excellence Award, Department of Economics and Management, Karlsruhe Institute of Technology, 2020 Best Student Paper Award, Extended Semantic Web Conference (ESWC), 2019 Best Dissertation Award in Informatics, Department of Economics and Management, KIT, 2018 Teaching Excellence Award, Department of Economics and Management, Karlsruhe Institute of Technology, 2017 Nominee for Best Resource Paper Award, International Semantic Web Conference (ISWC), 2017 Best Paper Award, International Workshop on Dataset Profiling and Federated Search for Web Data (PROFILES), 2017 Best Student Paper Award, ACM SIGAI International Conference in Knowledge Capture (K-CAP), 2015 Best Reviewer Award (Research Track), International Semantic Web Conference (ISWC), 2015 Winner of the Challenge for Crowdsourcing for Social Multimedia, Benchmarking Initiative for Multimedia Evaluation (MediaEval), 2013 Best Demo Paper Award, Extended Semantic Web Conference (ESWC), 2012 Honour Recognition of Master Thesis, Computer Science Dept., Universidad Simon Bolivar, 2012 Best B.Sc. Thesis in Computer Science, IEEE-INELECTRA Contest, 2009 Profile Picture License: ©RUB, Marquard Since 10.2020 Junior Professor, Databases and Information Systems, RUB 2017-2022 Assistant Lecturer, Department of Computational Linguistics, Heidelberg University SoSe 2020 Deputy Professor (W3), Web Science, Karlsruhe Institute of Technology (KIT) 2019-2020 Lecturer (Akademische Rätin), Web Science, Karlsruhe Institute of Technology (KIT) 2017-2019 Postdoctoral Researcher, Web Science, Karlsruhe Institute of Technology (KIT) 2017 Dissertation on \"Query Processing over Graph-structured Data on the Web\" (Summa Cum Laude)Supervised by Prof. Dr. Rudi Studer. 2012-2017 Associate Researcher, Knowledge Management, Karlsruhe Institute of Technology (KIT) 2012 Master in Computer Science, Universidad Simon Bolivar 2025 Effects of Distributional Biases on Gradient-Based Causal Discovery in the Bivariate Categorical CaseSchwabe, T., Lange, M., Wiskott, L., & Acosta, M. Bibtex APA @misc{SchwabeLangeWiskottEtAl2025, author\t\t=\t{Schwabe, Tim and Lange, Moritz and Wiskott, Laurenz and Acosta, Maribel}, title\t\t=\t{Effects of Distributional Biases on Gradient-Based Causal Discovery in the Bivariate Categorical Case}, month\t\t=\t{September}, year\t\t=\t{2025}, } Schwabe, T., Lange, M., Wiskott, L., & Acosta, M.. (2025, September 1). Effects of Distributional Biases on Gradient-Based Causal Discovery in the Bivariate Categorical Case. Retrieved from https://arxiv.org/abs/2509.01621 2023 Parker: Data Fusion through Consistent Repairs using Edit Rules under Partial KeysBronselaer, A., & Acosta, M.Information Fusion Bibtex APA @article{BronselaerAcosta2023, author\t\t=\t{Bronselaer, Antoon and Acosta, Maribel}, title\t\t=\t{Parker: Data Fusion through Consistent Repairs using Edit Rules under Partial Keys}, journal\t\t=\t{Information Fusion}, year\t\t=\t{2023}, } Bronselaer, A., & Acosta, M.. (2023). Parker: Data Fusion through Consistent Repairs using Edit Rules under Partial Keys. Information Fusion. Retrieved from https://arxiv.org/abs/2202.12184 Cardinality Estimation over Knowledge Graphs with Embeddings and Graph Neural NetworksSchwabe, T., & Acosta, M. arXiv Bibtex APA @misc{SchwabeAcosta2023, author\t\t=\t{Schwabe, Tim and Acosta, Maribel}, title\t\t=\t{Cardinality Estimation over Knowledge Graphs with Embeddings and Graph Neural Networks}, year\t\t=\t{2023}, doi\t\t=\t{10.48550/ARXIV.2303.01140}, } Schwabe, T., & Acosta, M.. (2023). Cardinality Estimation over Knowledge Graphs with Embeddings and Graph Neural Networks. arXiv. http://doi.org/10.48550/ARXIV.2303.01140 2022 Uncertainty in coupled models of cyber-physical systemsAcosta, M., Hahner, S., Koziolek, A., Kühn, T., Mirandola, R., & Reussner, R. H.In Proceedings of the 25th International Conference on Model Driven Engineering Languages and Systems: Companion Proceedings, MODELS 2022, Montreal, Quebec, Canada, October 23-28, 2022 (pp. 569–578) ACM Bibtex APA @inproceedings{AcostaHahnerKoziolekEtAl2022, author\t\t=\t{Acosta, Maribel and Hahner, Sebastian and Koziolek, Anne and Kühn, Thomas and Mirandola, Raffaela and Reussner, Ralf H.}, title\t\t=\t{Uncertainty in coupled models of cyber-physical systems}, booktitle\t=\t{Proceedings of the 25th International Conference on Model Driven Engineering Languages and Systems: Companion Proceedings, MODELS 2022, Montreal, Quebec, Canada, October 23-28, 2022}, pages\t\t=\t{569–578}, publisher\t=\t{ACM}, year\t\t=\t{2022}, doi\t\t=\t{10.1145/3550356.3561539}, } Acosta, M., Hahner, S., Koziolek, A., Kühn, T., Mirandola, R., & Reussner, R. H. (2022). Uncertainty in coupled models of cyber-physical systems. In Proceedings of the 25th International Conference on Model Driven Engineering Languages and Systems: Companion Proceedings, MODELS 2022, Montreal, Quebec, Canada, October 23-28, 2022 (pp. 569–578). ACM. http://doi.org/10.1145/3550356.3561539 Robust Query Processing for Linked Data FragmentsHeling, L., & Acosta, M.Semantic Web Bibtex APA @article{HelingAcosta2022, author\t\t=\t{Heling, Lars and Acosta, Maribel}, title\t\t=\t{Robust Query Processing for Linked Data Fragments}, journal\t\t=\t{Semantic Web}, year\t\t=\t{2022}, } Heling, L., & Acosta, M.. (2022). Robust Query Processing for Linked Data Fragments. Semantic Web. Retrieved from http://semantic-web-journal.net/content/robust-query-processing-linked-data-fragments-0 Federated SPARQL Query Processing over Heterogeneous Linked Data FragmentsHeling, L., & Acosta, M.In WWW ′22: The ACM Web Conference 2022, Virtual Event, Lyon, France, April 25 - 29, 2022 (pp. 1047–1057) ACM Bibtex APA Downloads Federated SPARQL Query Processing over HeterogeneousLinked Data Fragments @inproceedings{HelingAcosta2022b, author\t\t=\t{Heling, Lars and Acosta, Maribel}, title\t\t=\t{Federated SPARQL Query Processing over Heterogeneous Linked Data Fragments}, booktitle\t=\t{WWW ′22: The ACM Web Conference 2022, Virtual Event, Lyon, France, April 25 - 29, 2022}, pages\t\t=\t{1047–1057}, publisher\t=\t{ACM}, year\t\t=\t{2022}, doi\t\t=\t{10.1145/3485447.3511947}, } Heling, L., & Acosta, M.. (2022). Federated SPARQL Query Processing over Heterogeneous Linked Data Fragments. In WWW ′22: The ACM Web Conference 2022, Virtual Event, Lyon, France, April 25 - 29, 2022 (pp. 1047–1057). ACM. http://doi.org/10.1145/3485447.3511947 Utility-aware Semantics for Alternative Service Expressions in Federated SPARQL QueriesHeling, L., & Acosta, M.In 2022 IEEE International Conference on Web Services, ICWS IEEE Bibtex APA Downloads pdf @inproceedings{HelingAcosta2022c, author\t\t=\t{Heling, Lars and Acosta, Maribel}, title\t\t=\t{Utility-aware Semantics for Alternative Service Expressions in Federated SPARQL Queries}, booktitle\t=\t{2022 IEEE International Conference on Web Services, ICWS}, publisher\t=\t{IEEE}, year\t\t=\t{2022}, doi\t\t=\t{10.1109/ICWS55610.2022.00042}, } Heling, L., & Acosta, M.. (2022). Utility-aware Semantics for Alternative Service Expressions in Federated SPARQL Queries. In 2022 IEEE International Conference on Web Services, ICWS. IEEE. http://doi.org/10.1109/ICWS55610.2022.00042 AFRNN: Stable RNN with Top Down Feedback and AntisymmetrySchwabe, T., Glasmachers, T., & Acosta, M.In Proceedings of the 14th Asian Conference on Machine Learning (ACML). To Appear Bibtex APA Downloads AFRNN: Stable RNN with Top Down Feedback and Antisymmetry @inproceedings{SchwabeGlasmachersAcosta2022, author\t\t=\t{Schwabe, Tim and Glasmachers, Tobias and Acosta, Maribel}, title\t\t=\t{AFRNN: Stable RNN with Top Down Feedback and Antisymmetry}, booktitle\t=\t{Proceedings of the 14th Asian Conference on Machine Learning (ACML). To Appear}, pages\t\t=\t{}, year\t\t=\t{2022}, } Schwabe, T., Glasmachers, T., & Acosta, M.. (2022). AFRNN: Stable RNN with Top Down Feedback and Antisymmetry. In Proceedings of the 14th Asian Conference on Machine Learning (ACML). To Appear. 2021 Pay-as-you-go Population of an Automotive Signal Knowledge GraphSvetashova, Y., Heling, L., Schmid, S., & Acosta, M.In The Semantic Web - 18th International Conference, ESWC 2021, Virtual Event, June 6-10, 2021, Proceedings (Vol. 12731, pp. 717–735) Springer Bibtex APA @inproceedings{SvetashovaHelingSchmidEtAl2021, author\t\t=\t{Svetashova, Yulia and Heling, Lars and Schmid, Stefan and Acosta, Maribel}, title\t\t=\t{Pay-as-you-go Population of an Automotive Signal Knowledge Graph}, booktitle\t=\t{The Semantic Web - 18th International Conference, ESWC 2021, Virtual Event, June 6-10, 2021, Proceedings}, pages\t\t=\t{717–735}, publisher\t=\t{Springer}, volume\t\t=\t{12731}, series\t\t=\t{Lecture Notes in Computer Science}, year\t\t=\t{2021}, doi\t\t=\t{10.1007/978-3-030-77385-4_43}, } Svetashova, Y., Heling, L., Schmid, S., & Acosta, M.. (2021). Pay-as-you-go Population of an Automotive Signal Knowledge Graph. In The Semant",
  "content_length": 24121,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:38"
}