{
  "name": "Maria Kallia",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/mariakallia",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Maria Kallia Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Maria KalliaMr Ethan KellyZhen Tian Dr Maria Kallia Lecturer in Computing Science Education (School of Computing Science) email: Maria.Kallia@glasgow.ac.uk Import to contacts https://orcid.org/0000-0002-8591-9651 Biography Maria Kallia is an Assistant Professor within the school of Computing Science (Centre for Computing Science Education) at the University of Glasgow. Previously, she worked as postdoc in Computing Education at the University of Glasgow and Radboud University in the Netherlands. She has obtained her PhD at the School of Education at King's College London. Maria has also worked as a computer science teacher for six years in Greece. Her previous studies include a Master's in Education at the University of Roehampton, a Master's in Information Systems, and a BSc in Informatics at Athens University of Economics and Business. Research interests Main research interests - pedagogy of computer programming - cognitive and affective aspects of learning programming - problem-solving and reasoning - AI in Education and SE - gender inequalities, students’ aspirations and participation in computer science - behavioural aspects of SE Research groupsGlasgow Interactive Systems Publications List by: Type | Date Jump to: 2025 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2010Number of items: 25.2025 Kunkeler, Thom, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Li, Xiaohan, Muncey, Andrew, Nylén, Aletta and Venn-Wycherley, Megan (2025) Same Structures, Different Settings: Exploring Computing Capital and Participation across Cultural Contexts. In: Koli Calling '25: 25th Koli Calling International Conference on Computing Education Research, Koli, Finland, 12-16 Nov 2025, (Accepted for Publication) Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 (2025) To Be, or to Be Otherwise? Silicon Souls in Search of Dasein and Authentic Human Engagement in the Age of Generative AI. In: 21st ACM Conference on International Computing Education Research (ICER 2025), Charlottesville, Virginia, United States, 3-6 Aug 2025, pp. 240-255. ISBN 9798400713408 (doi: 10.1145/3702652.3744223) (Accepted for Publication) 2023 Cutts, Q. et al. (2023) Arguments for and Approaches to Computing Education in Undergraduate Computer Science Programmes. In: ITiCSE 2023: Innovation and Technology in Computer Science Education, Turku, Finland, 07-12 Jul 2023, pp. 160-195. ISBN 9798400704055 (doi: 10.1145/3623762.3633494) Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 and Cutts, Quintin ORCID: https://orcid.org/0000-0002-6368-9912 (2023) Conceptual development in early-years computing education: a grounded cognition and action based conceptual framework. Computer Science Education, 33(4), pp. 485-511. (doi: 10.1080/08993408.2022.2140527) Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 (2023) The Search for Meaning: Inferential Strategic Reading Comprehension in Programming. In: 19th ACM Conference on International Computing Education Research (ICER) 2023, Chicago, IL, United States, 8-10 Aug 2023, pp. 1-14. ISBN 9781450399760 (doi: 10.1145/3568813.3600135) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 and Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 (2023) Widening access to higher education through degree-level apprenticeships in software engineering. In: IEEE ASEE Frontiers in Education Conference (FIE 2023), College Station, Texas, 18–21 October 2023, ISBN 9798350336429 (doi: 10.1109/FIE58773.2023.10343199) 2022 Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 and Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 (2022) Why students drop computing science: using models of motivation to understand student attrition and retention. In: Koli Calling '22: 22nd Koli Calling International Conference on Computing Education Research (Koli 22), Koli, Finland, 17-20 November 2022, p. 17. ISBN 9781450396165 (doi: 10.1145/3564721.3564733) Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651, Cutts, Quintin ORCID: https://orcid.org/0000-0002-6368-9912 and Looker, Nicola (2022) When Rhetorical Logic Meets Programming: Collective Argumentative Reasoning in Problem-Solving in Programming. In: ACM Conference on International Computing Education Research 2022 (ICER 2022), Lugano, Switzerland, 7-10 August 2022, pp. 120-134. ISBN 9781450391948 (doi: 10.1145/3501385.3543975) 2021 Morrison, B. B. et al. (2021) Evidence for Teaching Practices that Broaden Participation for Women in Computing. In: 2021 Working Group Reports on Innovation and Technology in Computer Science Education (ITiCSE-WGR '21), 26 Jun - 01 Jul 2021, pp. 57-131. ISBN 9781450392020 (doi: 10.1145/3502870.3506568) Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 and Cutts, Quintin ORCID: https://orcid.org/0000-0002-6368-9912 (2021) Re-Examining Inequalities in Computer Science Participation from a Bourdieusian Sociological Perspective. In: 17th ACM Conference on International Computing Education Research (ICER 2021), 16-19 Aug 2021, pp. 379-392. ISBN 9781450383264 (doi: 10.1145/3446871.3469763) van Borkulo, S.P., Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651, Drijvers, Paul, Barendsen, Erik and Tolboom, Jos (2021) Computational Practices in Mathematics Education: Experts’ Opinion. In: 14th International Congress on Mathematical Education, Shanghai, China, 11-18 Jul 2021, Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651, van Borkulo, Sylvia Patricia, Drijvers, Paul, Barendsen, Erik and Tolboom, Jos (2021) Characterising computational thinking in mathematics education: a literature-informed Delphi study. Research in Mathematics Education, 23(2), pp. 159-187. (doi: 10.1080/14794802.2020.1852104) Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 and Sentance, Sue (2021) Threshold concepts, conceptions and skills: teachers' experiences with students' engagement in functions. Journal of Computer Assisted Learning, 37(2), pp. 411-428. (doi: 10.1111/jcal.12498) Brown, Neil C.C., Cutts, Quintin ORCID: https://orcid.org/0000-0002-6368-9912, Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651, Maguire, Joseph ORCID: https://orcid.org/0000-0002-3718-7679, McNeill, Fiona and Porter, Leo (2021) Supporting Computing Educators to Create a Cycle of Teaching and Computing Education Research. In: United Kingdom and Ireland Computing Education Research (UKICER) conference 2021, Glasgow, United Kingdom, 2-3 September 2021, ISBN 9781450385688 (doi: 10.1145/3481282.3483527) 2020 Weeda, Renske, Izu, Cruz, Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 and Barendsen, Erik (2020) Towards an Assessment Rubric for EiPE Tasks in Secondary Education: Identifying Quality Indicators and Descriptors. In: 20th Koli Calling International Conference on Computing Education Research (Koli Calling '20), 19-22 Nov 2020, p. 30. ISBN 9781450389211 (doi: 10.1145/3428029.3428031) 2019 van Borkulo, Sylvia Partricia, Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651, Drijvers, Paul, Barendsen, Erik and Tolboom, Jos (2019) Computational Thinking and Mathematical Thinking: Digital Literacy in Mathematics Curricula. In: 14th International Conference on Technology in Mathematics Teaching (ICTMT 14), Essen, Germany, 22-25 Jul 2019, pp. 383-385. (doi: 10.17185/duepublico/70781) Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 and Sentance, Sue (2019) Learning to Use Functions: the Relationship Between Misconceptions and Self-Efficacy. In: SIGCSE '19: The 50th ACM Technical Symposium on Computer Science Education, Minneapolis, MN, USA, 27 Feb - 02 Mar 2019, pp. 752-758. ISBN 9781450358903 (doi: 10.1145/3287324.3287377) Sentance, Sue, Waite, Jane and Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 (2019) Teachers' Experiences of Using PRIMM to Teach Programming in School. In: SIGCSE '19: The 50th ACM Technical Symposium on Computer Science Education, Minneapolis, MN, USA, 27 Feb - 02 Mar 2019, pp. 476-482. ISBN 9781450358903 (doi: 10.1145/3287324.3287477) Sentance, Sue, Waite, Jane and Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 (2019) Teaching computer programming with PRIMM: a sociocultural perspective. Computer Science Education, 29(2-3), pp. 136-176. (doi: 10.1080/08993408.2019.1608781) 2018 Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 and Sentance, Sue (2018) Are Boys More Confident Than Girls? The Role of Calibration and Students' Self-Efficacy in Programming Tasks and Computer Science. In: 13th Workshop in Primary and Secondary Computing Education (WiPSCE '18), Potsdam, Germany, 04-06 Oct 2018, p. 16. ISBN 9781450365888 (doi: 10.1145/3265757.3265773) Sentance, Sue, Selby, Cynthia and Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 (2018) Assessment in the computing classroom. In: Sentance, Sue, Barendsen, Erik and Schulte, Carsten (eds.) Computer Science Education: Perspectives on Teaching and Learning in School. Bloomsbury Academic",
  "content_length": 24898,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:25"
}