{
  "name": "Mario Botsch",
  "homepage": "https://cg.cs.tu-dortmund.de/people/botsch_mario.html",
  "status": "success",
  "content": "Graphics & Geometry Prof. Dr. Mario Botsch Office: OH16, Room 119 Phone: +49 231 755-6324 Email: Address: TU Dortmund Lehrstuhl Informatik 7 Otto-Hahn-Str. 16 44227 Dortmund Germany About me I’m a full professor in the Computer Science Department at TU Dortmund University, where I’m heading both the Chair of Computer Graphics and the Computer Graphics & Geometry Processing Group. Since 2025 I’m also a PI in the Lamarr Institute. Before joining TU Dortmund in fall 2020, I was professor for Computer Graphics at Bielefeld University (2008–2020). I studied mathematics and received my M.Sc. from the University of Erlangen-Nürnberg (1999). After that I started my PhD at the Max Planck Institute for Informatics, before moving to RWTH Aachen and finishing my PhD in computer science (2005). Afterwards I was PostDoc at ETH Zurich (2005–2008). The focus of my research is the efficient acquisition, discretization, optimization, animation, and visualization of three-dimensional geometric objects. On the more theoretical side, we are investigating flexible, non-standard geometry discretizations and the involved differential operators. On the more practical side, we are working on 3D-scanning and motion capturing of humans, modelling and animation of virtual characters, and real-time visualization in VR scenarios. I regularly teach courses on Computer Graphics, Computer Animation, Geometric Modeling, and Mathematics for Computer Science. For all my teaching I’m an avid user (and developer) of Decker, a cool tool for interactive HTML-based lecture slides. More details here: Curriculum Vitae PhD Thesis High Quality Surface Generation and Efficient Multiresolution Editing Based on Triangle Meshes Mario Botsch PhD Thesis, RWTH Aachen PDF Most Recent Publications Compensating Motion-Induced Errors in Smartphone-Based VR Avatar Reconstruction Friedemann Runte, Timo Menzel, Ulrich Schwanecke, Mario Botsch ACM Symposium on Virtual Reality Software and Technology, 2025 PDF Supp. Mat. Video DOI Robust Discrete Differential Operators for Wild Geometry Sven Wagner, Mario Botsch Vision, Modeling, Visualization, 2025 PDF Data Code DOI Eye-to-Eye or Face-to-Face? Face and Head Substitution for Co-Located AR Peter Kullmann, Theresa Schell, Mario Botsch, Marc Erich Latoschik Frontiers in Virtual Reality 6, 2025 Video DOI NePHIM: A Neural Physics-Based Head-Hand Interaction Model Nicolas Wagner, Ulrich Schwanecke, Mario Botsch Computer Graphics Forum 44(2), (Proc. Eurographics), 2025 PDF Video Code DOI Avatars for the Masses: Smartphone-Based Reconstruction of Humans for Virtual Reality Timo Menzel, Erik Wolf, Stephan Wenninger, Niklas Spinczyk, Lena Holderrieth, Carolin Wienrich, Ulrich Schwanecke, Marc Erich Latoschik, Mario Botsch Frontiers in Virtual Reality 6, 2025 Page PDF Supp. Mat. Video Demo DOI Virtual Body Image Exercises for People With Obesity – Results on Eating Behavior and Body Perception of the ViTraS Pilot Study Kathrin Gemesi, Nina Döllinger, Natascha-Alexandra Weinberger, Erik Wolf, David Mal, Sebastian Keppler, Stephan Wenninger, Emily Bader, Carolin Wienrich, Claudia Luck-Sikorski, Marc Erich Latoschik, Johann Habakuk Isral, Mario Botsch, Christina Holzapfel BMC Medical Informatics and Decision Making 25(176), 2025 DOI The Buffering of Autonomic Fear Responses Is Moderated by the Characteristics of a Virtual Character Martin Weiß, Philipp Krop, Lukas Treml, Elias Neuser, Mario Botsch, Martin J. Herrmann, Marc Erich Latoschik, Grit Hein Computers in Human Behavior 168, 2025 DOI Minimalism or Creative Chaos? On the Arrangement and Analysis of Numerous Scatterplots in Immersive 3D Knowledge Spaces Melanie Derksen, Torsten Kuhlen, Mario Botsch, Tim Weissker IEEE Transactions on Visualization and Computer Graphics 31(5), (Proc. VR), 2025 PDF Supp. Mat. Video DOI Self-Similarity Beats Motor Control in Augmented Reality Body Weight Perception Marie Luisa Fiedler, Mario Botsch, Carolin Wienrich, Marc Erich Latoschik IEEE Transactions on Visualization and Computer Graphics 31(5), (Proc. VR), 2025 Best Paper Honorable Mention PDF Supp. Mat. Video DOI Coverage of Facial Expressions and Its Effects on Avatar Embodiment, Self-Identification, and Uncanniness Peter Kullmann, Theresa Schell, Timo Menzel, Mario Botsch, Marc Erich Latoschik IEEE Transactions on Visualization and Computer Graphics 31(5), (Proc. VR), 2025 PDF Video DOI",
  "content_length": 4403,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:51"
}