{
  "name": "Maria Liakata",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/maria_liakata",
  "status": "success",
  "content": "Maria Liakata Skip to main content Skip to navigation TITLES AND AFFILIATIONS Associate Professor, University of Warwick Exchange Associate Professor Centre for Urban Science and Progress (CUSP), New York University Core member of the Warwick Institute for the Science of Cities Alan Turing Institute Faculty Fellow CONTACT Room 232 Department of Computer Science University of Warwick Tel: +44 (0) 24 7652 3681 RESEARCH INTERESTS text mining, natural language processing (NLP), biomedical text mining, sentiment analysis, NLP for social media, machine learning for NLP and biomedical applications, computational semantics, scientific discourse analysis RESEARCH PROFILE Maria has a DPhil from the University of Oxford on learning pragmatic knowledge from text and her research interests include text mining, natural language processing (NLP), related social and biomedical applications, analysis of multi-modal and heterogeneous data (text from various sources such as social media, sensor data, images) and biological text mining. Her work has contributed to advances in knowledge discovery from corpora, automation of scientific experimentation and automatic extraction of information from the scientific literature. She has published widely both in NLP and interdisciplinary venues. Maria is researching NLP for social science. She holds an IBM Faculty Award for studying “Emotion sensing using heterogeneous mobile phone data” and is a co-investigator on the EU Project PHEME, which studies the spread of rumours in social media. She is also a co-I on an IBM Faculty award for developing a course on Big Data ethics. Maria is leading a project funded by the Warwick Innovation Fund to diagnose and monitor dementia using text analysis. She has been recently appointed Faculty Fellow at the Alan Turing Institute where she plans to work on methods for combining heterogenenous textual and non-linguistic data for understanding mental health. Previously she held an Early Career Fellowship from the Leverhulme Trust (2010-2013) on reasoning with scientific articles RESEARCH GROUPS Intelligent and Adaptive Systems Computational Biology SELECTED PUBLICATIONS Liakata Maria, Saha Shyamasree, Dobnik Simon and Batchelor Colin and Dietrich Rebholz-Schuhmann. (2012). Automatic recognition of conceptualization zones in scientific articles and two life science applications. Bioinformatics 2012 28: 991-1000 Liakata Maria, Jee-Hyub Kim, Shyamasree Saha, Janna Hastings, and Dietrich Rebholz-Schuhmann.(2012). Three Hybrid Classifiers for the Detection of Emotions in Suicide Notes. Biomedical Informatics Insights 2012:5 (Suppl. 1) 175-184 Guo Y., Korhonen A., Liakata M., Silins I., Hogberg J. and Stenius U. (2011). A comparison and user-based evaluation of models of textual information structure in the context of cancer risk assessment. In BMC Bioinformatics 2011 12:69 Liakata M., Teufel S., Siddharthan A., Batchelor C. (2010). Corpora for conceptualisation and zoning of scientific papers. In Proceedings of the Seventh conference on International Language Resources and Evaluation (LREC10), May 2010. Scott IM, Vermeer CP, Liakata M, Corol DI, Ward JL, Lin W, Johnson HE, Whitehead L, Kular B, Baker JM, Walsh S, Dave A, Larson TR, Graham IA, Wang TL, King RD, Draper J, Beale MH. (2010). Enhancement of plant metabolite fingerprinting by machine learning. Plant Physiology. 2010 Aug;153(4):1506-20. Epub 2010 Jun 21. King, R. D., Rowland, J., Oliver, S. G., Young, M., Aubrey, W., Byrne, E., Liakata, M., Markham, M., Pir, P., Soldatova, L. N., Sparkes, A., Whelan, K. E., Clare, A. (2009) The Automation of Science. Science 324(5923):85-89, 3rd April 2009. QUICK LINKS Projects Publications Software CUSP Supervision Current Teaching CS909: Data mining CS918: Natural Language Processing Past Teaching CS131: Maths for Computer Scientists II Other activities Applications Area Chair for COLING 2016 Publications Chair for EACL 2017. Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 4308,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:28"
}