{
  "name": "Marijn J. H. Heule",
  "homepage": "https://www.cs.cmu.edu/~mheule",
  "status": "success",
  "content": "Marijn Heule Marijn J.H. HeuleAssociate Professor at Carnegie Mellon University Short Bio I am an Associate Professor in the Computer Science Department at Carnegie Mellon University and received my PhD at Delft University of Technology in the Netherlands. My research focuses on solving hard-combinatorial problems in areas such as formal verification, number theory, and extremal combinatorics. Most of my contributions are related to theory and practice of satisfiability (SAT) solving. I have developed award-winning SAT solvers, and my preprocessing techniques are used in state-of-the-art SAT solvers. My current research focusses on two major challenges for SAT solving: 1) exploiting the potential of high-performance computing; and 2) validating the results of SAT solvers and related tools. I have been developing a novel parallel SAT solving paradigm, called cube-and-conquer, which enables linear time speedups on many hard problems. The first publication on cube-and-conquer won the best paper award at HVC 2011. The increasing complexity of SAT solvers and related tools makes it more likely that these tools contain bugs. I designed a new proof format and implemented a fast, corresponding proof checker for SAT and QBF solvers. Proof-logging in this format has been mandatory for the SAT Competitions since 2013, thereby increasing the confidence that tools produce correct results. By constructing and validating a proof for the Boolean Pythagorean Triples problem (200 TB in size), I showed that proof logging and verification is even possible for the hardest problems. I am one of the editors of the Handbook of Satisfiability. This 900+ page handbook has become a standard for the SAT community, and it is a tremendous resource for future scientists. I am an Associate Editor of the Journal on Satisfiability, Boolean Modeling and Computation and was a co-chair of the SAT 2015 conference in Austin. My research statement and resume offer more details. Contact Information Gates-Hillman Complex 9107 School of Computer Science Carnegie Mellon University 5000 Forbes Avenue Pittsburgh, PA 15213-3891 email (work): marijn@cmu.edu email (personal): marijn@heule.nl homepage: http://www.cs.cmu.edu/~mheule Citations source: Google Scholar Citations Team Emre Yolcu (PhD) Joseph Reeves (PhD, together with Randy Bryant) Bernardo Subercaseaux (PhD) Cayden Codel (PhD, together with Jeremy Avigad) James Gallicchio (PhD, together with Jeremy Avigad) Amar Shah (PhD, together with Bryan Parno) Benjamin Przybocki (PhD) Zach Battleman (PhD, together with Randy Bryant) Teaching Spring 2026: 15-311 Logic and Mechanized Reasoning Spring 2025: 15-311 Logic and Mechanized Reasoning Fall 2024: 15-816 Advanced Topics in Logic: Automated Reasoning and Satisfiability Spring 2024: 15-311 Logic and Mechanized Reasoning Fall 2023: 15-816 Advanced Topics in Logic: Automated Reasoning and Satisfiability Fall 2022: 15-217 Logic and Mechanized Reasoning Fall 2022: 15-816 Advanced Topics in Logic: Automated Reasoning and Satisfiability Spring 2022: 15-210 Parallel and Sequential Datastructures and Algorithms Fall 2021: 15-217 Logic and Mechanized Reasoning Fall 2021: 15-816 Advanced Topics in Logic: Automated Reasoning and Satisfiability Spring 2021: 15-210 Parallel and Sequential Datastructures and Algorithms Fall 2020: 15-816 Advanced Topics in Logic: Automated Reasoning and Satisfiability Spring 2020: 15-210 Parallel and Sequential Datastructures and Algorithms Fall 2019: 15-816 Advanced Topics in Logic: Automated Reasoning and Satisfiability In the Media Recent articles on automated reasoning and mathematics Quanta Magazine November 10, 2025 To Have Machines Make Math Proofs, Turn Them Into a Puzzle [online] New York Times July 2, 2023 A.I. Is Coming for Mathematics, Too [online] Quanta Magazine April 20, 2023 The Number 15 Describes the Secret Limit of an Infinite Grid [online] Quanta Magazine August 26, 2020 Computer Scientists Attempt to Corner the Collatz Conjecture [online] Quanta Magazine August 19, 2020 Computer Search Settles 90-Year-Old Math Problem [online] Selected articles on the \"largest math proof ever\", check out Everything's Bigger in Texas for a complete list. Nature Volume 543: 17-18 Maths proof smashes size record [pdf, url] Reddit offers a discussion on this article with 250+ comments I Programmer May 10, 2016 A Mathematical Proof Takes 200 Terabytes To State This is the first article on the Pythagorean Triples proof Azimuth May 27/28, 2016 The world's most long-winded proof and Very Long Proofs The first article has 75+ comments including messages by Timothy Gowers Der Spiegel May 30, 2016 Zahlenrätsel: Der längste Mathe-Beweis der Welt The article includes 60+ comments Phys.org May 30, 2016 Computer generated math proof is largest ever at 200 terabytes Slashdot offers a discussion on this article with 140+ comments Appearences in Dutch media: EenVandaag June 8, 2016 Nederlandse wetenschapper lost wiskundig probleem op Dutch news show item on the Pythagorean triples proof including a Skype interview with Ronald Graham. Volkskrant June 6, 2016 Bewijs dat nét op 200 laptops past Interview in a Dutch newspaper on the \"largest math proof ever\". NRC Handelsblad September 5, 2015 Op vleugels van vervulbaarheid Article in a Dutch newspaper on computer-generated proofs for math problems. Appearence on YouTube: Numberphile May 17, 2018 The Problem with 7825 Viewed 1,409,359 times (November 7, 2025). PurpleMind March 7, 2025 The Mysterious Number That Took 100 Years To Compute Viewed 173,349 times (November 7, 2025). PurpleMind October 8, 2025 The Puzzle That Fights Back Viewed 6,825 times (November 7, 2025). Numberphile November 3, 2025 Schur Numbers (the world's biggest proof) Viewed 112,931 times (November 7, 2025). Publications 2026 Ratip Emin Berker, Emanuel Tewolde, Vincent Conitzer, Mingyu Guo, Marijn J. H. Heule, and Lirong Xia (2026). On the Edge of Core (Non-)emptiness: An Automated Reasoning Approach to Approval-based Multi-winner Voting. To appear in AAAI-26. 2025 Long Qian, Eric Wang, Bernardo Subercaseaux, and Marijn J. H. Heule (2025). Unfolding Boxes with Local Constraints. To appear in Conference on Automated Deduction - CADE 2025. [arXiv, preprint] Bernardo Subercaseaux, Ethan Mackey, Long Qian, Marijn J. H. Heule (2025). Automated Symmetric Constructions in Discrete Geometry. In Conference on Intelligent Computer Mathematics - CICM 2025. Lecture Notes in Computer Science 16136, Springer. Best paper award [arXiv, doi] Yi Zhou, Amar Shah, Zhengyao Lin, Marijn J.H. Heule, and Bryan Parno (2025). Cazamariposas: Automated Instability Debugging in SMT-based Program Verification. To appear in Conference on Automated Deduction - CADE 2025. [preprint] Randal Bryant, Yong Kiam Tan, and Marijn J.H. Heule (2025). Certifying Projected Knowledge Compilation. In Theory and Practice of Satisfiability Testing - SAT 2025, pp. 8:1-8:22. Leibniz International Proceedings in Informatics (LIPIcs) 341, Dagstuhl. [preprint, doi] Aeacus Sheng, Joseph Reeves, and Marijn J.H. Heule (2025). Reencoding Unique Literal Clauses. In Theory and Practice of Satisfiability Testing - SAT 2025, pp. 29:1-29:21. Leibniz International Proceedings in Informatics (LIPIcs) 341, Dagstuhl. [preprint, doi] Zachary Battleman, Joseph Reeves, and Marijn J.H. Heule (2025). Problem Partitioning via Proof Prefixes. In Theory and Practice of Satisfiability Testing - SAT 2025, pp. 3:1-3:18. Leibniz International Proceedings in Informatics (LIPIcs) 341, Dagstuhl. [preprint, doi] Amar Shah, Twain Byrnes, Joseph Reeves, and Marijn J. H. Heule (2025). Learning Short Clauses via Conditional Autarkies. To appear in Formal Methods in Computer-Aided Design - FMCAD 2025. Dawn Michaelson, Dominik Schreiber, Marijn J.H. Heule, Benjamin Kiesl-Reiter, and Mike Whalen (2025). Producing Proofs of Unsatisfiability with Distributed Clause-Sharing SAT Solvers. Journal of Automated Reasoning 69, Article 12. [doi] Randal E. Bryant, Wojciech Nawrocki, Jeremy Avigad, and Marijn J. H. Heule (2025). Certified Knowledge Compilation with Application to Verified Model Counting. Under submission. [arXiv] Joseph E. Reeves, Joao Filipe, Min-Chien Hsu, Ruben Martins, and Marijn J. H. Heule (2025). The Impact of Literal Sorting on Cardinality Constraint Encodings. The Annual AAAI Conference on Artificial Intelligence - AAAI 2025 39(11): 11327-11335. [preprint, doi] Amar Shah, Yi Zhou, Marijn J.H. Heule, and Bryan Parno (2025). Instability Track for SMT-COMP. To appear in the SMT Workshop 2025. Florian Pollitt, Mathias Fleury, Armin Biere, Marijn J. H. Heule, Karem Sakallah, Jiawei Chen, and Yonathan Fisseh (2025). Revisiting Clause Vivification. To appear in the Pragmatics of SAT - PoS 2025. [preprint] 2024 Cayden R. Codel, Jeremy Avigad, and Marijn J. H. Heule (2024). Verified Substitution Redundancy Checking. In Formal Methods in Computer-Aided Design - FMCAD 2024, pp. 186-196. [preprint, doi, slides] Yi Zhou, Jay Bosamiya, Jessica Li, Marijn J. H. Heule, and Bryan Parno (2024). Context Pruning for More Robust SMT-based Program Verification. In Formal Methods in Computer-Aided Design - FMCAD 2024, pp. 59-69. [preprint, doi] Karthik V. Nukala, Soumyaditya Choudhuri, Randal E. Bryant, and Marijn J. H. Heule (2024). Translating Pseudo-Boolean Proofs into Boolean Clausal Proofs. In Formal Methods in Computer-Aided Design - FMCAD 2024, pp. 175-185. [preprint, doi] Jiong Yang, Yaroslav A. Kharkov, Yunong Shi, Marijn J. H. Heule, and Bruno Dutertre (2024). Quantum Circuit Mapping Based on Incremental and Parallel SAT Solving. In Theory and Practice of Satisfiability Testing - SAT 2024, pp. 29:1-29:18. Leibniz International Proceedings in Informatics (LIPIcs) 305, Dagstuhl. [preprint, doi] Bernardo Subercaseaux and Marijn J. H. Heule (2024). A proof long enough to stump Leonhard Euler. Nieuw Archief voor Wiskunde 5/25(1): 11-17. [pdf] Joseph E. Reeves, Marijn Heule and Randal E. Bryant (2024). From Clauses to Klau",
  "content_length": 49256,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:44"
}