{
  "name": "Maria da Graça Campos Pimentel",
  "homepage": "http://conteudo.icmc.usp.br/pessoas/mgp",
  "status": "success",
  "content": "Maria da Graca Campos Pimentel Home Page Maria da Graça Campos Pimentel Professor mgp at icmc dot usp dot br Departamento de Ciencias de Computacao (SCC) Universidade de Sao Paulo (USP) Caixa Postal 668 - Av. Trabalhador Saocarlense, 400 13560-970 - Sao Carlos, SP - BRAZIL phone: +55 16 3373.9657, Intermidia lab: +55 16 3373.9668, fax: +55 16 3373.9751 Education Full Professor (2011): Instituto de Ciências Matemáticas e de Computacão - Universidade de Sao Paulo Livre Docente/Habilitation (2001): Instituto de Ciências Matemáticas e de Computacão - Universidade de Sao Paulo PhD (1994): University of Kent at Canterbury MSc (1989): Instituto de Ciências Matemáticas e de Computacão - Universidade de Sao Paulo BSc (1986): Universidade Federal de São Carlos My CV is available in the Plataforma Lattes from CNPq: http://lattes.cnpq.br/4962820320879891 Research Interests: Ubiquitous computing as a platform for modeling, designing and implementing interactive multimedia documents. Current research is related to the investigation of distributed multimodal multimedia systems and their relation to capture-based systems in general, and exploited in the context of Interactive TV in particular. This research is under development in the context of: A collaborative project funded by FINEP: Evaluation of the GINGA Middleware for the Brazilian Digital TV System (SBTVD). Partners: UFSCar, ICMC-USP-São Carlos, UNICAMP, CENPRA, PUC-RIO, UFPB, C.E.S.A.R., Instituto Genius. In the context of an international collaboration involving research groups from France, Argentina, Chile and Brazil (funded by Stic-Amsud/FAPESP): Semantic-based Support for Collaborative Design Activity The Collaborative TIDIA-Ae Project funded by FAPESP since 2004: http://tidia-ae.incubadora.fapesp.br. In this project, 20 groups of the São Paulo State are involved in Both research and development in collaboration and distance learning supported by high-speed networks. From 2003 to 2005, I coordinated the Project Hewlett-Packard Project Applied Mobile Technology Solutions in Learning Environments funded by HP. From 2001 to 2004, I coordinated the the InCA-SERVE Project, which investigated the use of ubiquitous infrastructures, augmented with multimedia document engineering, in learning environments. The project was supported by an international cooperation effort involving ProTeM-CC/CNPq in Brazil and NSF/CISE in the U.S., ans is also supported by FAPESP and CAPES in Brazil. ACM SIGWEB, DOCENG and ACM SAC I have been a ACM SIGWEB from 2006 Nominated Vice-Chair in 2007 Ellected Vice-chair for July 2007-June 2011 Ellected Secretary for July 2011- June 2013. www.sigweb.org I was the general chair of the Eight ACM Symposium on Document Engineering 2008 DocEng'08, in Sao Paulo-SP, Brazil, September 16-19 http://acmdoceng.icmc.usp.br/doceng2008 I was co-chair of the Multimedia and Visualization Track (MMV) of the ACM Symposium on Applied Computing: ACM SAC'12: http://www.acm.org/conferences/sac/sac2012 Multimedia and Visualization (MMV) Track: http://acmsac.icmc.usp.br/mmv12 ACM SAC'11: http://www.acm.org/conferences/sac/sac2011 Multimedia and Visualization (MMV) Track: http://acmsac.icmc.usp.br/mmv11 ACM SAC'10: http://www.acm.org/conferences/sac/sac2010 Multimedia and Visualization (MMV) Track: http://acmsac.icmc.usp.br/mmv10 ACM SAC'09: http://www.acm.org/conferences/sac/sac2009 Multimedia and Visualization (MMV) Track: http://acmsac.icmc.usp.br/mmv09 SBC Webmedia Series: I am a member of the the Steering Committee of the Brazilian Special Interest Group on Web and Multimedia Systems, which promotes the Brazilian Symposium on Multimedia and the Web (Webmedia Series) since 1995. I was the Chair of the Steering Committee from 2004 to 2006. I was the General Chair of Webmedia in 1997, in São Carlos-SP, Brazil, and Co-chair of the Program Committe in 2004. 2011 - Florianópolis - SC - WebMedia - XVII Simpósio Brasileiro de Sistemas Multimídia e Web - 3 a 6 de outubro 2010 - Belo Horizonte - MG - WebMedia - XVI Simpósio Brasileiro de Sistemas Multimídia e Web - 3 a 5 de outubro 2009 - Fortaleza - CE - WebMedia - XV Simpósio Brasileiro de Sistemas Multimídia e Web - 5 a 7 de outubro 2008 - Vila Velha - ES - WebMedia - XIV Simpósio Brasileiro de Sistemas Multimídia e Web - 26 a 29 de outubro 2007 - Gramado - RS - WebMedia - XIII Simpósio Brasileiro de Sistemas Multimídia e Web - 21 a 24 de outubro 2006 - Natal - RN - WebMedia - XII Simpósio Brasileiro de Sistemas Multimídia e Web - 19 a 22 de novembro 2005 - Poços de Caldas - MG - WebMedia - XI Simpósio Brasileiro de Sistemas Multimídia e Web - 5 a 7 de dezembro 2004 - Ribeirão Preto - SP - WebMedia - X Simpósio Brasileiro de Sistemas Multimídia e Web 2003 - Salvador - BA - WebMedia - IX Simpósio Brasileiro de Sistemas Multimídia e Web - 3 a 6 de novembro 2002 - Fortaleza - SBMIDIA - VIII Simpósio Brasileiro de Sistemas Multimídia e Hipermídia - 7 a 10 de outubro 2001 - Florianópolis - SC - SBMIDIA - VII Simpósio Brasileiro de Sistemas Multimídia e Hipermídia - 15 a 19 de outubro 2000 - Natal - RN - SBMIDIA - VI Simpósio Brasileiro de Sistemas Multimídia e Hipermídia - 14 a 16 de junho 1999 - Goiânia - GO - SBMIDIA - V Simpósio Brasileiro de Sistemas Multimídia e Hipermídia - 15 a 17 de junho 1998 - Rio de Janeiro - RJ - SBMIDIA - IV Simpósio Brasileiro de Sistemas Multimídia e Hipermídia - 29 a 31 de maio 1997 - São Carlos - SP - WOMH - III Workshop de Sistemas Multimídia e Hipermídia 1996 - Fortaleza - CE - WOMH - II Workshop de Sistemas Multimídia e Hipermídia 1995 - São Carlos - SP - WOMH - I Workshop de Sistemas Multimídia e Hipermídia",
  "content_length": 5630,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:37"
}