{
  "name": "Marina Denise Jirotka",
  "homepage": "http://www.cs.ox.ac.uk/marina.jirotka",
  "status": "success",
  "content": "Marina Jirotka | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyMarina JirotkaMarina Jirotka Professor Marina Jirotka BSc MA DPhil MBCS MACM CITPProfessor of Computer Science (Human Centred Computing)Governing Body Fellow, St Cross CollegeThemes:Human Centred ComputingSecurityCompleted Projects:Embedding e-Science ApplicationseHorizonsOxford eSocial Sciencemore…Interests Throughout my career I have been concerned with bringing a richer comprehension of socially organised work practices and interaction into the process of engineering technological systems. My expertise involves producing user and community requirements and human computer interaction, particularly for collaborative systems. My recent work in Responsible Innovation in the UK and the European Union concentrates on: leading an interdisciplinary team of researchers, building a creative and robust community to discuss and develop culturally nuanced approaches to responsibility and responsible innovation as director of the one of a kind Responsible Technology Institute co-designing a digital framework and toolbox to promote responsible and sustainable innovation practices and engaging with industry, policy and professional bodies to disseminate findings developing an ‘Ethical Black Box’ (similar to those in aircrafts) for use in social robots to aid incident investigations digital risk on adolescent mental health and how responsible innovation can be used in the development of preventative and personalised digital interventions promoting responsible innovation approach in developing autonomous systems the theoretical and conceptual underpinnings of new forms of governance for RI; new methods for the dissemination of materials and innovative ways of engaging the public in debates on RI in ICT unpacking the practices and concepts of innovation of digital systems in the context of professional organisations developing new and enhancing existing methods for RI practice for digital system developers BiographyAs Professor of Human Centred Computing in the Department of Computer Science at the University of Oxford I lead interdisciplinary research that combines both social and computer science approaches to the design of technology – we research methods and approaches for building and evaluating technology responsibly in ways that may enhance individual autonomy, wellbeing and promote and protect human values. I am the Director of the newly established Responsible Technology Institute, an international and interdisciplinary hub for responsible innovation focusing on a range of ICT areas including robotics, AI and the digital economy. I hold an EPSRC Established Career Fellowship called RoboTIPS (Developing Responsible Robots for the Digital Economy) funding a five-year investigation into the development of an ‘Ethical Black Box’, whereby robots using AI are fitted with a type of inflight recorder to aid in post-accident investigations. I am also Co-I on RAILS (Responsible AI for Long-term Trustworthy Autonomous Systems), bringing expertise in responsible innovation and socio-technical systems; I co-lead on PARIS-DE (Design Principles and Responsible Innovation for a Sustainable Digital Economy) co-designing digitals tool for sustainable and responsible innovation; and the MRC-funded Adolescent Mental Health and Development in the Digital World. I am also the co-director of ORBIT, a leading provider of RRI (Responsible Research and Innovation) training across academia and industry. My recently concluded projects include a range of topics in RI: trust in algorithms, responsible AV data, responsible social media, trusted digital economy. Appointments 2004: Elected Governing Body Fellow of St Cross College 2006: James Martin Research Fellow, seconded to the Oxford eResearch Centre. 2006: Associate Director of the Oxford e-Research Centre 2006: Associate Researcher of the Oxford Internet Institute 2007: ESRC/SSRC Visiting Fellowship to UCLA, and PARC to develop a systematic understanding of data sharing to inform design of e-Research systems. 2009: Deputy Director of ESRC's National Strategic Directorate of the eSocial Science Programme. 2011: Chartered IT Professional of the BCS sitting on the ICT Ethics Specialist Group committee 2018: Elected to UK Computing Research Community 2018: EPSRC Established Career Fellowship 2018: Board Member of the Society for Computers and Law Member of the EPSRC’s Programme Advisory Board for the Digital Economy Invited to sit on EPSRC ICT Strategic Advisory Team I sit on the Steering Committee for the All Party Parliamentary Group on Data Analytics I was specialist advisor to the House of Lords Select Committee on Communications for their inquiry into Children and the Internet. Expert opinion As part of the Digital Wildfire project I have given evidence to the House of Lords Select Committee on Artificial Intelligence and also the All-Party Parliamentary Group on Artificial Intelligence I was an Expert Witness to assist the Open Innovation meets Big Data consortium (Nissan, GE, Airbus, Ordnance Survey, Ferroviale ++) who are working together to generate new revenues from data I am a working group member of the IEEE P7000 standard Model Process for Addressing Ethical Concerns During System Design I am a member of the Steering Committee for the Society for Computers and Law I am a member of the UK Committee for IIASA (International Institute for Applied Systems Analysis) Fellowships and Awards 2006: Excellence in Teaching Award from Oxford University that recognizes and rewards excellence in college and university teaching, the organisation of teaching, and the support of student learning. 2007: ESRC/SSRC Fellowship Award to visit UCLA's Department of Information Studies and PARC. 2011: UCLA Center for European and Eurasian Studies Scholar Award. 2019: EPSRC Established Career Fellowship. RoboTIPS: Developing Responsible Robots for the Digital Economy. 2020: Vice Chancellor’s Innovation Awards Highly Commended Policy Engagement 2020 ‘Putting Out Digital Wildfires Before They Take Hold. See alsoResponsible Technology InstituteSelected PublicationsView AllManage publications Human involvement in autonomous decision−making systems. Lessons learned from three case studies in aviation‚ social care and road vehicles Pericle Salvini‚ Tyler Reinmund‚ Benjamin Hardin‚ Keri Grieman‚ Carolyn Ten Holter‚ Aaron Johnson‚ Lars Kunze‚ Alan Winfield and Marina Jirotka In Frontiers in Political Science. 2023. Details about Human involvement in autonomous decision−making systems. Lessons learned from three case studies in aviation‚ social care and road vehicles | BibTeX data for Human involvement in autonomous decision−making systems. Lessons learned from three case studies in aviation‚ social care and road vehicles | DOI (10.3389/fpos.2023.1238461) | Link to Human involvement in autonomous decision−making systems. Lessons learned from three case studies in aviation‚ social care and road vehicles Navigating the labyrinth of RI through a practical application — A case study in a cross−disciplinary research project Jun Zhao‚ Menisha Patel‚ Philip Inglesant‚ Virgina Portillo‚ Helena Webb‚ Liz Dowthwaite‚ Paula Fiddi‚ Bénédicte Legastelois‚ Elvira Perez Vallejos‚ Michael Rovatsos and Marina Jirotka In Journal of Responsible Technology. Vol. 15. 2023. Details about Navigating the labyrinth of RI through a practical application — A case study in a cross−disciplinary research project | BibTeX data for Navigating the labyrinth of RI through a practical application — A case study in a cross−disciplinary research project | DOI (10.1016/j.jrt.2023.100064) | Link to Navigating the labyrinth of RI through a practical application — A case study in a cross−disciplinary research project Digitally Un/Free: the everyday impact of social media on the lives of young people Roxanne Ellen Bibizadeh‚ Rob Procter‚ Carina Girvan‚ Helena Webb and Marina Jirotka In Learning‚ Media and Technology. 2023. Details about Digitally Un/Free: the everyday impact of social media on the lives of young people | BibTeX data for Digitally Un/Free: the everyday impact of social media on the lives of young people | DOI (10.1080/17439884.2023.2237883) | Link to Digitally Un/Free: the everyday impact of social media on the lives of young people ActivitiesResponsible Research and InnovationSoftware EngineeringCyber Security OxfordRequirements EngineeringProjectsRoboTIPSPARIS-DECompleted ProjectsEmbedding e-Science ApplicationseHorizonsOxford eSocial Sciencee-Infrastructure Use Cases and Usage ModelsVREFRRIICTGREATRESPONSIBILITYSmartSocietyDigital WildfireNQITRRIUnBiasLabHackathon ZimbabweReEnTrustResponsible Technology InstituteRoADAMHDMRAILSResQCComAdolescent Mental Health and Development in the Digital WorldMinderoo Current Students Sumaya AdanJumana  BaghabrahBenjamin  HardinTyler ReinmundSydney ReisVarad Vishwarupe (Trinity College, University of Cambridge) Research Josimar De Alcantara MendesResearch AssociateCarolyn Ten HolterSenior Researcher Past Students Jan AhrendLize Alberts (Stellenbosch University) Deena AlghamdiPeter DarchPaula FiddiRoss GalesAnthony MasihDavid MellorTowera MoyoFernando MuradasKevin PatelSimon SmithMatteo TurilliAnna Zawilska Past Researchers Steven AlburyResearch AssistantGrace EdenBarbara GrimpeMark HartswoodChris HindsResearch AssistantLewis HylandPhilip InglesantDaniel OmeizaMenisha PatelPericle SalviniEwan  SoubuttsAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 9748,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:45"
}