{
  "name": "Marius Zimand",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/mzimand.html",
  "status": "success",
  "content": "Marius Zimand | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Marius Zimand Professor Contact Info Phone: 410-704-4967 Office: YR-497 Email: mzimand@towson.edu Education Ph.D., Computer Science, University of Rochester \t\t\t\t\t\t\t\t\tPh.D., Mathematics, University of Bucharest Areas of Expertise computational complexity, algorithmic information theory, cryptography Professional Service: Member of the Editorial Board of Journal of Universal Computer Science, an international journal published by Springer Verlag. Grant Reviewer for the National Science Foundation,  National Research Council Canada, National Research Agency of France, US-Israel Binational Science Foundation. Selected Publications and Presentations: Bruno Bauwens and Marius Zimand, ``Linear list-approximation for short programs (or the power of a few random bits),â  29-th IEEE Conference on Computational Complexity, pp. 241-247, June 2014, Vancouver, Canada. Bruno Bauwens, Anton Makhlin, Nikolay Vereshchagin, and Marius Zimand, ``Short lists with short programs in short time, â 28-th IEEE Conference on Computational Complexity, June 5-7, 2013, Stanford, California, US Marius Zimand, ``Two sources are better than one for increasing the Kolmogorov complexity of infinite sequences,â Theory of Computing Systems, 46(4), pp. 707-722, 2010 (Best Paper Award at CSR'2008). Marius Zimand, ``Simple extractors via cryptographic pseudo-random generators,â Theoretical Computer Science, vol. 411(10), pp. 1236--1250 (March 2010) (Best Paper Award at ICALP 2005, Track C). Marius Zimand,  ``Exposure-Resilient Extractors and the Derandomization of Probabilistic Sublinear Time,â Computational Complexity, vol. 17, no. 2 (May 2008), pp. 220--253. (Special issue with selected papers from 22nd Annual IEEE Conference on Computational Complexity (CCC 2007)) Research: My research is in the area of randomness extraction, especially in the framework of algorithmic information theory (also known as Kolmogorov complexity). Recently my research has been supported by the grants NSF 0634830, 2006 -2009, and  NSF 1016158, 2010-2014. The main objectives are  on one hand to design efficient algorithms that transform objects with low-quality randomness into objects with high-quality randomness, or, on the other hand, to establish the impossibility of such constructions. The objects (usually called sources) can be finite probability distributions, finite binary strings, and infinite binary sequences and the randomness quality is measured, respectively, by min-entropy, Kolmogorov complexity, and constructive Hausdorff dimension.  Randomness extractors have direct applications in cryptography and they are also connected to other areas of great interest such as error-correcting codes and data structures. In addition, randomness extraction is an area that is of great mathematical interest. Memberships / Affiliations: ACM, SIGACT Service: Chair of the P & T Committee, Dept. of Computer and Information Sciences Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 6138,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:09"
}