{
  "name": "Maria C. Yuang",
  "homepage": "http://rowan634.wixsite.com/mcyuang",
  "status": "success",
  "content": "Home | mcyuang top of page This website was built on Wix. Create yours today.Get StartedProfessor Dept. of Computer Science and Information Engineering, National Yang Ming Chiao Tung University Hsinchu, Taiwan 30050Contact Information EM: mcyuang@cs.nctu.edu.tw Phone: +886-3-5731937 Fax: +886-3-5718876 Biography ​ Maria C. Yuang received the B.S. degree in Applied Mathematics from the National Chiao Tung University, Taiwan, in 1978; the M.S. degree in Computer Science from the University of Maryland, College Park, Maryland, in 1981; and the Ph.D. degree in Electrical Engineering and Computer Science from the Polytechnic Institute of New York University (NYU), New York, in 1989. From 1981 to 1990, she was with AT&T Bell Laboratories and Bell Communications Research (Bellcore), where she was a member of technical staff working on Broadband networks and protocol engineering. In 1990, she joined National Chiao Tung University (NCTU), Taiwan, where she is currently a Professor of the Department of Computer Science and Information Engineering. Prof. Yuang served as a Guest Editor for the Special Issue of IEEE Journal on Selected Areas in Communications (JSAC) on Next-Generation Broadband Optical Access Network Technologies in 2010. She also served as a Guest Editor for the Special issue of IEEE Transaction on Industrial Electronics on Multimedia and Communications in 1998. From 2001 to 2008, she has led the largest collaborative government-funded project on the research and experimentation of optical packet switching networks and next-generation optical metro/ access networks. She has served on the technical program committee of many technical conferences including IEEE ICC and GLOBECOM, and has been invited to give invited talks at numerous technical conferences. Her main research interests include optical and broadband networks, optical switching systems, datacenter networks, wireless access networks, and performance modeling and analysis. She is a senior member of IEEE, and a member of OSA. She holds 55 patents (22 USA patents, 23 ROC patents, 8 CN patents, and 2 Japan patents) in the field of optical and wireless networking, and has over 120 publications, and two book chapters.bottom of page",
  "content_length": 2228,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:16"
}