{
  "name": "Marinos Themistocleous",
  "homepage": "https://www.ds.unipi.gr/en/faculty/mthemist-en",
  "status": "success",
  "content": "Marinos Themistocleous - Department of Digital Systems Skip to content Marinos Themistocleous Email mthemist@unipi.gr Title Professor Office - Courses Brief CV Marinos Themistocleous is a Professor at the Department of Digital Systems at University of Piraeus, Greece. He holds a B.Sc. in Computer Science, a Postgraduate Degree in Teaching and Learning in Higher Education, a M.Sc. in Information Systems Management and Ph.D. in Informatics. Before joining University of Piraeus, he worked as a Lecturer and a Senior Lecturer at Brunel University, UK. He has close relationships with industry and has worked as a consultant for the Greek Ministry of Finance, the Greek Standardization body, the Greek Federation of SMEs, the Bank of Greece, ORACLE UK, Havering Council, etc. He has authored several teaching textbooks, internationally refereed journal papers and conference articles and has received many citations and awards of excellence. His research has attracted funding from various funding bodies. He acts as an international reviewer for research proposals submitted to the European Union and other funding bodies. His current research interests include Information Systems, Information Systems Management, Service-Oriented Architectures, e-business and Net-Centric Information Systems. Publications Publications Publications 2010 – 2015 I) JOURNALS Mantzana, V.M Themistocleous, M., Morabito, V. 2010. ‘Healthcare IS and Older Employees Training’ Journal of Enterprise Information Management, 23(6): 680-693. Morabito, V., Themistocleous, M., Serrano, A., 2010. ‘A Survey on Integrated IS and Competitive Advantage’ Journal of Enterprise Information Management, 23(2):201-214. II) CONFERENCES Tsaravas, C.. Themistocleous, M. 2011, ‘Cloud Computing and eGovernmen: A Literature Review’, In the Proceedings of the European and Mediterranean and Middle East Conference on Information Systems 2011 (EMCIS2011) Athens, Greece, May 30-31 2011. Koumaditis, K. Themistocleous, M. Byrne, P. Ross, D. Cromie, S. Corrigan, S. 2011, ‘Investigating Human Factors in Biotechnology and Pharmaceutical Manufacturing Industries’, In the Proceedings of the European and Mediterranean and Middle East Conference on Information Systems 2011 (EMCIS2011) Athens, Greece, May 30-31 2011. Koumaditis, K. Themistocleous, M. 2011, ‘The Importance of SOA Governance in HIS Integration: A Literature Review’, In the Proceedings of the European and Mediterranean and Middle East Conference on Information Systems 2011 (EMCIS2011) Athens, Greece, May 30-31 2011. Tsaravas, H. Themistocleous, M. 2011, ‘Cloud Computing & E-Government: Myth or Reality?’, Transforming Government Workshop 2011 London, UK, [CD Proceedings], March 17-18, 2011. Mantzana, V. Koumaditis, K. Themistocleous, M.  2011, ‘Healthcare IS Interoperability: Challenges and Solutions’, In the Proceedings of International Conference of Health Informatics (HEALTHINF 2011), Rome, Italy, January 26-29 2011. Soja, P. Themistocleous, M., Rupino, P., 2011,  ‘Playing Catch up: How Different is Large Scale Enterprise Systems Implementation in Transition Countries and Organizations?’ In Sprague, R. J. (Eds), Proceedings of Forty fourth Annual Hawaii International Conference on System Sciences, (Hicss 40), Kauai Island, Hawaii, USA, IEEE Computer Society, Los Alamitos, California, USA., [CD-Proceedings]. January 4-7. Mantzana, V. Themistocleous, M. Koumaditis, K. 2010, ‘Is SOA a solution to Healthcare Information Systems Interoperability?’ In the proceedings of the tenth IEEE International Conference on Information Technology and Applications in Biomedicine (ITAB 2010), Corfu, Greece, November 2010. Ferreira, C. Rupino, P. Melo, P. Themistocleous, M. 2010, ‘Semantics Take the SOA Registry to the Next Level: an Empirical Study in a Telecom Company’, In the proceedings of the Sixteenth Americas Conference on Information Systems (AMCIS 2010), Lima, Peru,  August 12-15, 2010. Themistocleous, M. Koumaditis, K. Mantzana, V. Morabito, V. 2010, ‘An Empirical Study on Older Employees Training on ICT’ In the Proceedings of the European and Mediterranean Conference on Information Systems 2010 (EMCIS2010) Abu Dhabi UAE, April 12-13 2010. III) BOOKS Themistocleous M., Mantzana, V., 2010, ‘Web Services and SOA’, In Press. Recent announcements 2nd Application Submission period for the M.Sc. Program “E-Learning” until Monday 16 June 2025 May 30, 2025 Call for Applications for the M.Sc. Program “Information Systems & Services” (Extended until 21/07/2025) May 30, 2025 Announcement of Extension for the Distribution of Textbooks May 30, 2025 Extension of the deadline for applications for free student meals for the Academic Year 2024-2025 until Wednesday 4 June 2025 May 28, 2025 Announcement of the MSc in “Health Services Organisation and Management – Health Informatics” for the Academic Year 2025 – 2026 May 27, 2025 Start of course/teaching evaluations for the spring semester 2024-2025 May 20, 2025 Searching for students for Internship May 12, 2025 Update on the Entrepreneurship & Career Panorama 2025 May 12, 2025 Useful LinksInstitute of Electrical and Electronics Engineers (IEEE) The British Computer Society (BCS) Workflow Management Coalition (WfMC) International Medical Informatics Association (IMIA) The American Medical Informatics Association (AMIA) European Federation For Medical Informatics (EFMI) Hellenic Society of Computer and Information Scientists and Professionals Evdoxos Alumni Site We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok",
  "content_length": 5623,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:51"
}