{
  "name": "Marianne Maertens",
  "homepage": "https://www.psyco.tu-berlin.de/people.html",
  "status": "success",
  "content": "Computational Psychology at TU Berlin – People ComputationalPsychology at TU Berlin Prof. Dr. Marianne Maertens Principal Investigator. My research bridges the areas of computer science and psychology. My key competencies are in experimental research methods and the study of human vision. Dr. Guillermo Aguilar Post-doc. I study visual perception in humans. I'm particularly interested in our perception of lightness, depth and transparency. I'm also interested in the evaluation and development of psychophysical methods that can reliably measure appearance. Dr. Joris Vincent Post-doc. I study visual perception in humans. I'm particularly interested in the perceptual representation of chromatic information in natural scenes. Ideally, I am looking to develop an (image computable) model for transforming chromaticity information to a representation that more accurately reflects human color perception. Inés Schönmann Ph.D. student. I focus on studying human visual perception in a way that it reflects the realities of biological and behavioural data while also relating meaningfully to the human experience. Furthermore, I am interested in the role predictive processes play when processing language in naturalistic settings. Bianca del Mestre Administrative Assistant of Prof. Dr. Marianne Maertens Students Lennart Lottermoser Bachelor Student. In my Bachelor thesis, I study how edge perception in real three-dimensional scenes differs from edge perception in two-dimensional photographic representations of a scene, using drawing tasks. Matheo Möbis Bachelor Student. In my Bachelor thesis, I am testing an algorithm that detects T-Junctions in images and examine how it behaves when confronted with noise. Jannis Röhl Bachelor Student. In my Bachelor thesis, I relate discrimination with perceived magnitude on simultaneous brightness contrast displays in an experimental approach. Jessica Schilling Bachelor Student. In my Bachelor thesis, I examine the minimum number of pixels required for letters to be identifiable and to what extent contrast polarity influences this. Alumni Dr. Torsten Betz Currently working at the Deutsche Bahn. Carolin Brunn B.Sc. Caro finished her Bachelor thesis in our group and worked with us as a student research assistant for 2 years. Jakob Grünwald B.Sc. Jakob explored how scale's variability in MLDS is influenced by how the underlying statistical model is parametrized, and he also evaluated possible ways of optimizing data acquisition for MLDS. Minjung Kim, Ph.D. Currently at University of Cambridge. Bernhard Lang Bernhard worked with us as a Ph.D. student for 9 months. Matko Matic B.Sc. Matko worked with us as a student research assistant for 1 year. Thomas Otto, Ph.D. Currently at University of St. Andrews. Maximilian Pohlmann B.Sc. Maximilian worked with us as a student research assistant for 6 months and finished his Bachelor thesis in Computer Science at Faculty IV. Lynn Schmittwilken, Ph.D. Lynn worked with us as a Ph.D. student for 5 years and finished her Ph.D. in our group. Lynn is currently working at TU Darmstadt. Dr. Christiane Wiebel Currently at Honda Research, Frankfurt. Dr. Katharina Zeiner Currently at Stuttgart Media University. Alumni - Bachelor students Anas Allaham Hafidz Arifin Yury Besiakov Marcus Bindermann Hannah Boldt Filipe Borges Philip Brozicevic Daniel Castro Sanchez Sam Chamani Yasin Mehmet Cifci Felix Dexel Savas Großmann Christian Haase Tom Ravid Hausmann Tim Henze Navdha Jain Sebastian Keil Nico Kestel Burak Kiran Marius Krause Duc Phan Anh Le Azer Mahjoub Marie-Elisabeth Makohl Iris Özkaya Clara Ollech Ji Hyea Park Eduardo Luiz Rhein Karol Rogoza Lisa Scheibner Annalena Katharina Schillen Tim Schlesier Hendrik Schulze Bröring Enis Can Simsek Jarl-Sebastian Soerensen Ori Toledo Cohen Marc Tukendorf Rhea Widmer Christian Wohlhaupt Jan Zabel Konstantinos Zamanis Wenwen Zhang Matti Zinke Alumni - Master students Poulami Ghosh Anna Haverkamp Shaohan Li Amanda Maiwald Yiqun Xiao Computational Psychology Prof. Dr. Marianne Maertens Room: MAR 5.018 +49 (0)30/314-24478 marianne.maertens@tu-berlin.de Office hours: on appointment Administration Bianca del Mestre Room: MAR 5.019 +49 (0)30 314-75771 bianca.delmestre@tu-berlin.de Office hours: Mon-Wed 10 a.m.-12 p.m. Address Technische Universität Berlin Institute of Computer Engineering and Microelectronics Dept. Computational Psychology Sek. MAR 5-5 Marchstr. 23, 10587 Berlin Germany",
  "content_length": 4446,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:39"
}