{
  "name": "Marine Carpuat",
  "homepage": "http://www.cs.umd.edu/~marine",
  "status": "success",
  "content": "Marine Carpuat Marine Carpuat Associate Professor Computer Science University of Maryland I am an Associate Professor in Computer Science at the University of Maryland, with a joint appointment at the University of Maryland Institute for Advanced Computer Studies (UMIACS). I am a member of the CLIP lab. My research aims to advance Human-Centered Natural Language Processing to help people communicate no matter what language they speak. Recent News 11/25 This year I plan to recruit 1-2 PhD students in Computer Science with background and interests in multilingual AI with a focus on multimodal approaches and/or bridging HCI and NLP. 11/25 We presented several papers at EMNLP 2025 in Suzhou on the themes of AI trustworthiness and literacy 08/25 I am back at UMD and looking forward to presenting recent work on \"Human-Centered Approaches to Trustworthy Machine Translation\" at UPenn on Sep 9 and at the UMD CS department seminar on Sep 19. 09/24 I am excited to join the ALMAnaCH team at INRIA in Paris as a visiting researcher this year! 09/24 I am incredibly proud of Dr Eleftheria Briakou for receiving the first ever Best Thesis Award from AMTA, the Association for Machine Translation in the Americas. 07/24 We are kicking off \"Lost in Translation\" a study of trust in Machine Translation at the Planet Word Museum in Washington DC! This is a big team effort made possible by the TRAILS Institute on Trustworthy AI at the University of Maryland, with Ge Gao, Charlotte Vaughn, Yimin Xiao, Calvin Bao, Zoey Ki, Yongle Zhang, and Marianna Martindale. 12/23 We received an Outstanding Paper Award at EMNLP 2023 for \"Physician Detection of Clinical Harm in Machine Translation: Quality Estimation Aids in Reliance and Backtranslation Identifies Critical Errors\". Congratulations to Nikita Mehandru, Sweta Agrawal, Elaine Khoong, Niloufar Salehi for making this interdisciplinary collaboration a success! 12/23 We are presenting 8 papers at EMNLP 2023. Key themes: reliance and trust, explainability, building common ground across cultural differences, measuring harms. 07/22 I am a program co-chair of NAACL 2022 with Marie Catherine de Marneffe and Ivan Vladimir Meza Ruiz Contact Department of Computer Science University of Maryland Brendan Iribe Center for Computer Science and Engineering 8125 Paint Branch Dr. College Park, MD 20742 Office: IRB 4130 Email: marine@umd.edu Web Accessibility \"",
  "content_length": 2404,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:50"
}