{
  "name": "Maria Halkidi",
  "homepage": "https://www.ds.unipi.gr/en/faculty/mhalk-en",
  "status": "success",
  "content": "Maria Halkidi - Department of Digital Systems Skip to content Maria Halkidi Phone +30 210-4142748 Email mhalk@unipi.gr Title Professor Office Hours Tuesday 10:00-11:00, Friday 11:00-12:00 Links http://www.unipi.gr/faculty/mhalk Office 205 (150, Androutsou Str, Piraeus, 18532) wp_statistics_words_count 308 Courses Data Warehouses and Data Mining — 8th semester Database Systems — 5th semester Advanced Topics in Data Analytics — 7th semester Database Systems Design — 4th semester Brief CV Maria Halkidi is currently Professor at the Department of Digital Systems, University of Piraeus. She obtained her degree in Informatics from University of Piraeus in 1997 and her M.Sc. and PhD degrees from Athens University of Economics & Business (AUEB) in 1999 and 2003, respectively. She has conducted research in AUEB participating in several National and European-funded projects and in University of California at Riverside as a Marie-Curie fellow funded by EU. Her research interests include Learning and Data Mining Techniques, Data Mining in Distributed environments (P2P systems, Sensor networks), WWW & Databases (web documents clustering, web content management). She has also participated in many program committees of international conferences in the areas of Data Mining and Machine Learning. She is member of IEEE and ACM. More information and a list of available publications are available at http://www.unipi.gr/faculty/mhalk. Publications Publications 2014 – 2019 I) JOURNALS Merkourios Karaliopoulos, Leonidas Tsolas , Maria Halkidi, Iordanis Koutsopoulo, Stephanie Van, Peter Conradie. “Beyond clustering: rethinking the segmentation of energy consumers when nudging them towards energy-saving behavior”, accepted to Energy Informatics Review, 2022 Halkidi, I. Koutsopoulos. “Recommender systems with Selfish Users“. Knowledge and Information Systems, Springer, 2020. II) CONFERENCES Koutsopoulos, M. Halkidi. “Optimization of Multi-Stakeholder Recommender Systems for Diversity and Coverage”. AIAI 2021. Maria Halkidi, Ι Koutsopoulos. “QGraph: A quality assessment index for graph clustering”.  European Conference on Information Retrieval (ECIR), 2019. Iordanis Koutsopoulos, Maria Halkidi. “Efficient and Fair Item Coverage in Recommender Systems”. IEEE Intl Conf on Big Data Intelligence and Computing (DataCom’2018), 2018. III)Book Chapters Maria Halkidi, Michalis Vazirgiannis, and Christian M. Hennig. Cluster Validation and Further General Issues: Method-Independent Indices for Cluster Validation and Estimating the Number of Clusters. Handbook of Cluster Analysis. 2015 by Chapman and Hall/CRC Books M. Vazirgiannis, M. Halkidi. “Data Mining”, Gutenberg publishers, 2003 (in Greek) M. Vazirgiannis, M. Halkidi, D. Gunopulos, “Quality Assessment and Uncertainty Handling in Data Mining”, Springer-Verlag, LNAI Series, 2003 Recent announcements 2nd Application Submission period for the M.Sc. Program “E-Learning” until Monday 16 June 2025 May 30, 2025 Call for Applications for the M.Sc. Program “Information Systems & Services” (Extended until 21/07/2025) May 30, 2025 Announcement of Extension for the Distribution of Textbooks May 30, 2025 Extension of the deadline for applications for free student meals for the Academic Year 2024-2025 until Wednesday 4 June 2025 May 28, 2025 Announcement of the MSc in “Health Services Organisation and Management – Health Informatics” for the Academic Year 2025 – 2026 May 27, 2025 Start of course/teaching evaluations for the spring semester 2024-2025 May 20, 2025 Searching for students for Internship May 12, 2025 Update on the Entrepreneurship & Career Panorama 2025 May 12, 2025 Useful LinksInstitute of Electrical and Electronics Engineers (IEEE) The British Computer Society (BCS) Workflow Management Coalition (WfMC) International Medical Informatics Association (IMIA) The American Medical Informatics Association (AMIA) European Federation For Medical Informatics (EFMI) Hellenic Society of Computer and Information Scientists and Professionals Evdoxos Alumni Site We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok",
  "content_length": 4193,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:25"
}