{
  "name": "Marin Litoiu",
  "homepage": "http://www.yorku.ca/mlitoiu",
  "status": "success",
  "content": "Marin Litoiu, PhD, PEng, FCAE Bitnobi Inc. has reached an exciting milestone! Co-founded by Marin Litoiu and former postdoctoral fellows Mark Shtern, Mike Smit, and Brad Simmons, Bitnobi originated from research conducted in Litoiu’s lab at York University. With support from York Innovation, TIAP, NSERC, and OCI, Bitnobi developed an innovative data-sharing platform and has since grown into an award-winning […] Marin Litoiu  has been inducted as a Fellow of the Canadian Academy of Engineering. The Canadian Academy of Engineering is a founding member of the Council of Canadian Academies, along with the Royal Society of Canada and the Canadian Academy of Health Sciences. Professor Marin Litoiu inducted as a Fellow of the Canadian Academy of […] The 2020 Faculty of the Year Award is awarded to Prof. Marin Litoiu, York University! \"The deliberate energy of Marin’s consistent involvement and advocacy over decades has helped to shape the IBM Center for Advanced Studies, and has powered an incredible number of successful projects. His past role as a CAS Research Staff Member, and […] CASCON 2019 recognizes Ye Hu, Marin Litoiu, Johnny Wong and Gabriel Iszlai  with \"The Most Influential Paper Award\" for their paper, \"Resource Provisioning for Cloud Computing,\" published at CASCON 2009.[...] More info here... The Natural Sciences and Engineering Research Council announced $1.65 million in funding for the Dependable Internet-of-Things Applications (DITA) program, which will be led by Marin Litoiu, a professor in both the School of Information Technology in the Faculty of Liberal Arts and Professional Studies and the Department of Electrical Engineering and Computer Science, Lassonde School of […] Professor Marin Litoiu, Post Doctoral Fellows Marios Fokaefs and Cornel Barna, MAIST student Rodrigo Veleda  and IBMers Radu Mateescu and Joe Wigglesworth received the Best Paper Award at the 26th Conference on Computer Science and Software Engineering  for \"Enabling DevOps for Containerized Data-Intensive Applications: An Exploratory Study\". Search Search site search button Marin Litoiu, PhD, PEng, FCAEProfessor and Fellow of Canadian Academy of Engineering Electrical Engineering and Computer Science, Lassonde School of Engineering School of Information Technology, LAPS Office DB 3047 Tel: 416-736-2100 x20987 mlitoiu at yorku dot ca Keele, Glendon and Markham Campus Contact (416) 736-2100 Campus Maps Community Safety Privacy & Legal Accessibility Careers",
  "content_length": 2480,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:47"
}