{
  "name": "Marinho Barcellos",
  "homepage": "http://www.inf.ufrgs.br/~marinho",
  "status": "success",
  "content": "marinho.barcellos Search Marinho Barcellos Senior Lecturer My Profile at University of Waikato I am a Senior Lecturer at the University of Waikato 2019–now. In the past, I have worked for different academic institutions: INF/UFRGS in Brazil 2010–2019, PUC-RS University in Brazil 2008–2009, University of Manchester/BT Labs 2003-2004 in the UK, UNISINOS University in Brazil 1993–2008. My research has addressed a range of challenges as technology evolved, covering the non-functional properties of performance, security and resilience of networked systems and their underlying protocols (see research outputs). My key research interest has been on Internet measurements and network security. I have regularly contributed to the scientific community by serving in multiple committees. I am fortunate to have supervised many bright students. Contact me if you are interested, but to be sure I am a good fit for you, please first read my recent work. Interests Internet measurements Network security Education PhD in Computer Science, 1998 Newcastle University, UK MSc in Computer Science, 1993 Federal University of Rio Grande do Sul (UFRGS), Brazil BSc in Computer Science, 1989 Federal University of Rio Grande do Sul (UFRGS), Brazil News Fresher ACM IMC 2024 in Madrid is coming up. Happy to be able to attend it this time. The program is here, which includes our paper on DDoS here Older AINTEC'24 was a huge success thanks to all the OC team. The event was co-located with SIGCOMM in Sydney. new measurement paper about remote peering appearing in IEEE/ACM Transactions on Networking. congratulations, Fabricio! contributed to ACM SIGCOMM 2024 PC, in Sydney talk on remote peering presented in APRICOT 54 peering forum Philipp and Bajpai organised a great PAM 2024 (Passive and Active Measurement Conference). happy to contribute to its success in the pc happy to contribute to AINTEC'24 as a PC co-chair (with Polly Huang) our paper exploring the use of NLP to characterise amplification DDoS from flow samples was accepted at PACMNET journal and will be presented in CoNEXT'23 in Paris. well done, Rav! best reviewer award received from SBSeg 2023 (the Brazilian Symposium on Information and Systems Security) congratulations, Felipe, who successfully defended his PhD thesis (LiU, Sweden). Thanks Mikael for the opportunity to co-supervise Felipe. got a taste of Thailand as a keynote in the BKNIX Peering Forum. the event organisation was spotless, in May. helping as Advisory PC member for IEEE INFOCOM 2024 busy teaching two full papers right now (July-November): COMPX204 Practical Networking and Cyber Security and COMPX515 Security of Advanced Networks. happy to contribute to ACM IMC 2023 as a TPC member. the cfp is here new paper with Felipe and Mikael to appear on ACM WiSec'23, Provable Non-Frameability for 5G Lawful Interception expanding admin duties, starting Dec 2022, as Deputy Head of Department, Computer Science, UoW Christopher Lorier, a co-supervision with Richard and Matthew, has defended his PhD at UoW, with the thesis title Algorithmic Mapping of Software-Defined Networking Pipelines. happy to chair the Advisory Board of the new ACM PACMNET journal, along with a great committee (Jia Wang, Morley Mao, Olivier Bonaventure, and Joerg Ott) the list of papers accepted at CoNEXT 2022 is available. Congratulations to all authors! to Fabricio and Pedro too, for our paper on BGP communities! contributed to a panel on internationalisation of the measurement community in Brazil, during the 4th measurement workshop organised by RNP chairing the best paper award committee of IEEE ICNP 2022 Fabricio presented our remote peering work in APNIC 54 the notification for CoNEXT 2022 has been sent. congratulations to authors of accepted papers! the conference happens 6-9 December, in Rome very happy to team with Justine Sherry for CoNEXT 2022 congrats Fabricio for the PAM 2022 paper on assessing the impact of remote peering (with Pedro, Ignacio and Matthew helping IEEE ICNP 2022 as pc member helping IFIP Networking 2022 as pc member chairing SIGCOMM CARES with Jen Rexford reviewing work as PC member of IEEE ICNP 2022 and IFIP Networking 2022 ACM SIGCOMM Lifetime Award 2021 committee, with Phillipa Gill, Anja Feldmann, and Craig Partridge. congrats Hari Balakrishnan (MIT) leaving the ACM SIGCOMM Executive Committee after four years mandate. thanks Roch and my former colleagues in the EC ( Sujata, Steve, Lars, Christophe, Anduo, Dina and Keshav). I’ll miss you all. I wish I had done more. best of luck to Ellen, Matt, Jia and the rest of the EC. helping with CoNEXT'21 (Publicity co-chair with Marwan and Jia). we attracted roughly the same number of submissions as last year, despite being a virtual conference helping with the organisation of SIGCOMM'21 (Demos co-chair with Marco, also with David and Athina for posters) constructive feedback to authors of CoNEXT 2021, ICNP 2021 and TMA 2021 happy to learn that our paper “Dynamic Property Enforcement in Programmable Data Planes” has been accepted at IEEE/ACM Transactions on Networking. Congrats Miguel! happy to get one the few awards as Distinguished Member of the 2021 INFOCOM TPC chairing the best paper award committee for CoNEXT 2020 nice presentation by Pedro during IMC 2020. the videos are here 5min and 20min joining the ACM SIGCOMM 2021 Organisation Committee as a demo-chair with Chiesa, hopefully in Netherlands contributing to IEEE INFOCOM 2022 as a pc member our work “AS-Path Prepending: there is no rose without a thorn”, with Pedro, Lars, Leal, Alberto and Anja has been accepted at ACM IMC 2020 congrats Lucas for the Spoofing paper accepted at Computer Networks Journal, with Matthew, Bradley, and kc, expanding the work on CoNEXT 2019 helping in the committee to choose the best paper award for IFIP Networking 2020 Leal has been accepted to a Ph.D. in Waikato, with a grant provided by the University, to work with me and Matthew Luckie on Internet measurements and cyber-security working for Anja and Dongsu as an ACM CoNEXT 2020 pc member. working for Roch and Peter as a IEEE ICNP 2020 pc member congratulations Miguel for successfully defending his PhD on p4box. thanks Theo, Richard, Christian and Luciano for serving as examiners. congrats Lucas for defending his PhD thesis (Spoofing-IX) with a distinction award. examiners were Renata, Artur and Jefferson. thanks kc, Matthew and Bradley for supporting Lucas. People PhD Students Atthapan Daramas UoW PhD 2020-… Dimeji Fayomi UoW PhD 2019-… Ravjot Singh Samra UoW MCS 2022, UoW PhD 2023-… Master Students Amith Sankar UoW MCS 2024 Bhim Rai UoW MCS 2024 Chumao Wu UoW MCS 2024 Kevin Han UoW MCS 2024 Peter Wanyonyi UoW MCS 2024 Xiaoye Hua UoW MCS 2024 Graduation Projects Logan Cook UoW COMPX520 2024 Alumni Fabricio Mazzola UFRGS PhD 2019-2023 Felipe Boeira UFRGS MSc 2017-2018, LiU PhD 2019-2023 Pedro Marcos UFRGS PhD 2016-2019, now an Adjunct Professor at FURG University Christopher Lorier UoW PhD 2019-2023 Miguel Neves UFRGS PhD 2015-2020, now Lead AI/ML Researcher, Samsung Research Lucas Muller UFRGS MSc 2012-2014, UFRGS PhD 2015-2020, now a Senior Technical Lead at Cisco, San Francisco Lucas Freire UFRGS MSc 2016-2018, now at Banrisul Bank Matheus Lehmann UFRGS PhD 2012-2017, now a Software Engineer at Siemens, Austria Rodolfo Antunes UFRGS PhD 2010-2016, now an Adjunct Professor at UNISINOS University Rodrigo Mansilha UFRGS MSc 2009-2012, UFRGS PhD 2012-2017, now an Adjunct Professor at UNIPAMPA University Flavio Santos UFRGS MSc 2008-2010, UFRGS PhD 2010-2013, now a Data Infrastructure Engineer at Spotify, Sweden Tobias Petry UFRGS MSc 2013-2015, now a Systems Programmer at Conectivida Daniel Marcon UFRGS MSc 2011-2013, UFRGS PhD 2013-2017, now a Professor at UNISINOS University Akhil Chandel UoW MCS 2021, now with Gallagher Security Bruce Parkinson UoW MCS 2022 Florin Zaicu UoW PhD 2019-2022 Leandro Mondin UFRGS MSc 2018-2022 (part-time), now Head of R&D at the National Academic Network RNP Rodrigo Oliveira UFRGS MSc 2011-2013, UFRGS PhD 2013-2018 (inc), now a Software Development Lead at Nelogica Samuel Davies UoW MCS 2022 Sergio Gutierrez UNAL PhD 2013-2018, now a Research Lecturer and Postdoc at UNAULA, Medellin. Public service Editorial Committees Proceedings of the ACM on Networking (PACMNET) Advisory Board Chair, 2022-… Steering Committees ACM CoNEXT 2019-2021 PAM Passive & Active Measurement Conference 2019-2023 Program Chair AINTEC 2023 (with Polly Huang) CoNEXT 2022 (with Justine Sherry) PAM 2019 Passive & Active Measurement Conference (with David Choffnes) IEEE P2P 2015 IEEE Peer-to-Peer Conference PC chair (with Jay Lorch) SBC SBRC 2016 Computer Networks Symposium PC chair (with Antonio Loureiro) SBC SBSeg 2014 Systems & Information Security Symposium PC chair (with Diego Aranha) ACM SIGCOMM/IEEE Committees IEEE Internet Award 2026 committee SIGCOMM CARES committee Co-Chair 2019-2022 ACM SIGCOMM Lifetime Award 2021 committee, with Phillipa Gill, Anja Feldmann, and Craig Partridge ACM SIGCOMM EC 2017-2021. Director of Diversity & Outreach Program Committees ACM IMC: 2025, 2023, 2017 ACM CoNEXT: 2025, 2024, 2021, 2020, 2019 IEEE INFOCOM: 2025 Advisory, 2024 Advisory, 2023 Advisory, 2022 (reviewer award), 2021(reviewer award), 2019 ACM SIGCOMM: 2024 IFIP TMA: 2021 IEEE ICNP: 2022, 2021, 2020 PAM: 2020- 2019 IFIP Networking: 2022-…-2014 ACM HotNets: 2019 ITC: 2017 IEEE P2P: 2014, 2013, 2012 (reviewer award), 2011, 2010 SBC SBRC: 2019-…-2003 SBC SBSeg: 2023-…-2008 IEEE LATINCOM: 2017- 2015 IEEE ISCC 2019 Organisation Committees Travel Grant Co-Chair ACM CoNEXT 2023 Publicity Co-Chair ACM CoNEXT 2021 Demo Co-Chair ACM SIGCOMM 2021 (with Marco Chiesa) Publication Co-Chair ACM CoNEXT 2019 (with Idilio Drago) General Co-Chair ACM LANCOMM 2019 (with Pedro Casas, Oscar Caicedo, and J. Ignacio Alvarez-Hamelin) General Co-Chair ACM SIGCOMM 2016 ⭐ (with Jon Crowcroft) Other ACM SIGCOMM 2018 posters Publications Google Scholar profile. Raphael Hiesgen, Marcin",
  "content_length": 34787,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:50"
}