{
  "name": "Marius Kloft",
  "homepage": "https://ml.informatik.uni-kl.de",
  "status": "success",
  "content": "ML@RPTU Welcome to the Machine Learning Group at Rheinland-Pfälzische Technische Universität Kaiserslautern-Landau The Machine Learning Group at RPTU (formerly 'TU Kaiserslautern') was established in 2017. The group currently comprises professors, postdocs, PhD students, administrative / technical support staff and student assistants. The group is interested in theory and algorithms of statistical machine learning (especially deep learning) and its applications. Our research covers a broad range of topics and applications, where we try to unify theoretically proven approaches (e.g., based on learning theory) with recent advances (e.g., in deep learning or reinforcement learning). Topics we have been working on include unsupervised deep learning (particularly, anomaly detection), multi-modal learning, extreme classification, adversarial learning, explainable AI, and applications of ML in the life sciences, mechanical and chemical process engineering, and text analysis. Members of the group have received various awards, including the Google Most Influential Papers Award, the ICML and NIPS Best Reviewer Awards, the ANDEA Test-of-time Award, and the Emmy-Noether Career Award (DFG). The group contributes the community with helpful service. Members of the group have been reviewing for more than 50 conferences and 30 journals. They have been serving as associate editors for journals (TTPAMI, JMLR, TNNLS) and area chairs of conferences (NeurIPS, ICLR, ICML, AAAI, AISTATS, ECML, ECAI). The group is committed to improving the diversity, equity, and inclusion in the field of ML. This is evidenced by the high percentage of women in the group, on all levels of academic qualification. Research Group Faculty Jun.-Prof. Dr. Sophie Fellenz (née Burkhardt) Junior Professor E-mail=YWZsxWZupHQjNnL15WatsGbuQWZ More info Prof. Dr. Marius Kloft Professor E-mailrx2bmRHQjNnL15WatsGbuQWZ More info Administration Heike Neu Secretary E-mail==gblVHQjNnL15WatsGbuQWZ More info Steffen Reithermann Technician & administrative assistant (ML lab & project management, authorized signatory for the working group leaders) E-mailyVWa0hWZy1WYu5GQjNnL15WatsGbuQWZ More info N.N. Contact person for HiWi contract matters E-mail ==Qbs1CapdXat0WY0RXZyNHQjNnL15WatsGbuQWZ More info Postdocs Dr. Puyu Wang Alexander-von-Humboldt Research Fellow E-mail=cXYudmLwVXe1B0Yz5icwRXduQWZ More info Boris Ndjia Njike Postdoc E-mail==gYl5mbql2allDQn1WYpxmLj9Wb More info PhD students advised by Sophie Fellenz Jephte Abijuru PhD Student E-mail==galBHa0VmLhJWaqVnc1B0Yz5icwRXduQWZ More info Charu Karakkaparambil James PhD student E-mailjhWYyVHQjNnL15WatsGbuQWZ More info WeiChen Li PhD student E-mail=cXZpNGal5GQjNnL15WatsGbuQWZ More info Marcio Monteiro PhD student E-mail=0WYyNWav5Sbv5GdllmcvB0Yz5icwRXduQWZ More info Mayank Nagda PhD student E-mailt5WYnRWYAJHaytmL15WatsGbuQWZ More info Phil Ostheimer PhD student E-mail==wbzRHallWblJHQjNnL15WatsGbuQWZ More info Saurabh Varshneya PhD student E-mail==gdhJ3co5WZ5FGQjNnL15WatsGbuQWZ More info PhD students advised by Marius Kloft Andriy Balinskyy PhD student E-mail==gYhxWauN3a5lHQjNnL15WatsGbuQWZ More info Billy Franks PhD student E-mail==gZyFmbrNHQjNnL15WatsGbuQWZ More info Naghmeh Ghanooni PhD student E-mailnhWYu92bulGQjNnL15WatsGbuQWZ More info Fabian Hartung PhD student E-mailmFmYpFmbugWYyRXdudGQ3VmYuQWZ More info Nabeel Hussain Syed PhD student E-mail==wc5VGZAJHaytmL15WatsGbuQWZ More info Philipp Liznerski PhD student E-mail==AbppnblJ3crlGQjNnL15WatsGbuQWZ More info Waleed Mustafa PhD student E-mail=0WdzRXYmFGQjNnL15WatsGbuQWZ More info Denys Senkin PhD student E-mail==AZzVmbrlmbAJHaytmL15WatsGbuQWZ More info Dennis Wagner PhD student E-mail==wdhdmblJHZAJHaytmL15WatsGbuQWZ More info Student assistants Abhijith Asokan Student Assistant E-mailhN3brFmbAJHaytmL15WatsGbuQWZ More info Anosh Billimoria Student Assistant E-mail=IWasxWat9mcAJHaytmL15WatsGbuQWZ More info Tim Burchert Student Assistant E-mail ==gY1J3YoVmc0BkcwRXduQWZ More info Eric Dortmann Student Assistant E-mail==QZfR2byRXbh5mbxgDQjNnL15WatsGbuQWZ More info Aditya Eranki Student Assistant E-mail=AXdoBDN4V3aAJHaytmL15WatsGbuQWZ More info Lawanya Damroo Priya Student Assistant E‑mail=gWZ3hzN3VHeAJHaytmL15WatsGbuQWZ More info Pouya Jafari Student Assistant E-mailqFmZhJXauA3b1lXYAVGZ15icwRXduQWZ More info Anuj Thareja Student Assistant E-mail==gcltmMx0Wd2BkcwRXduQWZ More info Ehsan Espandar Student Assistant E-mail=UGazFmbuU2cwFmbkFmcAVGZ15icwRXduQWZ More info Grigory Grechkin Student Assistant E-mail=c2cnJXZjh2ap5GQn1WYpxmLj9Wb More info Rohan Gadgil Student Assistant E-maily9Gah5mLnFGZnlGbAVGZ15icwRXduQWZ More info Zeveldin Gabriel Resch Research Assistant E-mail =IXZzNGaAJHaytmL15WatsGbuQWZ More info Muhammad Sadiq Vayani Student Assistant E-mail==wchRWax1WdoFWbtFGZnJDQn1WYpxmLj9Wb More info Abishek Thirupathi Student Assistant E-mail=EmYpNHaltGdolmc1BXY0hWa2YDQn1WYpxmLj9Wb More info Muhammad Umer Student Assistant E-mail==Qb1hWYt1WYk5SdtVmcAVGZ15icwRXduQWZ More info Gabriel Vicente Rodrigues Student Assistant E-mail =cmdpNWZuRXZ1MDQn1WYpxmLj9Wb More info Vaishnavi Shirbhate Student Assistant E‑mail==gcpxGNysWZxBkcwRXduQWZ More info Aniket Sunil Shinde Student Assistant E‑mail==wcpp3MxI3bqBkcwRXduQWZ More info Chhaya Tamang Student Assistant E‑mailjhGahlXY0FWbzMDQn1WYpxmLj9Wb More info Huy Thai Student Assistant E-mail=M2byVDNnlHcAJHaytmL15WatsGbuQWZ More info Muhammad Waasif Nadeem Student Assistant E-mail==wdhF2cpZmLuFGZlVWbAVGZ15icwRXduQWZ More info Till Werner Student Assistant E-mail=Q3X3VmcuVmcxcDQjNnL15WatsGbuQWZ More info Alumni Prof. Dr. Rodrigo Alves - PhD student, 2018-2022; then: Assistant Professor, Czech Technical University Dr. Matthias Kirchler - PhD student, 2019-2024; then: Tech lead, Floy Prof. Dr. Antoine Ledent - Postdoc, 2018-2022; then: Assistant Professor, Singapore Management University (SMU) Prof. Yunwen Lei, PhD - Alexander-von-Humboldt Fellow, 2019-2020; then: Lecturer, University of Birmingham, UK; Assistant Professor, U Hong Kong Chen Qiu, PhD - PhD student, 2019-2024; then: Research Scientist at Bosch Center for Artificial Intelligence Robert Vandermeulen, PhD - PostDoc, 2017-2020; then: PostDoc, TU Berlin Dr. Florian Wenzel - PhD student, 2015-2019; then: PostDoc, Google Brain; Applied Researcher, Amazon; Founder, Mirelo AI Projects coordinated by ML Group AI4ChemRisk: AI for Chemical Risk Prediction in Aquatic Environments. Carl-Zeiss Foundation, starting in 2026 FOR 5359: Deep Learning on sparse chemical process data. Deutsche Forschungsgemeinschaft (DFG), since 2025 PIAD: Physics-informed Anomaly Detection. Federal Ministry of Research, Technology and Space (BMFTR), since 2025 MLKL: Machine Learning Kaiserslautern-Landau. State Ministry of Science and Health, since 2024 VT 4.0: Machine Learning and Physical Modeling. Carl-Zeiss Foundation, 2020-2026 DeepIntegrate: Integration of Heterogenous Data Sources in Deep Learning. Federal Ministry of Science and Education (BMBF), 2019-2021 Only projects in which we act as coordinator or spokesperson are listed here, not all of our numerous research projects. Publications Read more 2026 W. Li, W. Mustafa, M. Monteiro, P. Wang, M. Kloft, and S. Fellenz. TORA: Train Once, Realign Anytime for Offline Multi-Objective Reinforcement Learning. Proceedings of the AAAI Conference on Artificial Intelligence, (to appear) 2026. P. Liznerski, S. Varshneya, E. Calikus, P. Wang, A. Bartscher, S. Vollmer, S. Fellenz, and M. Kloft. Reimagining Anomalies: What If Anomalies Were Normal?. Proceedings of the AAAI Conference on Artificial Intelligence, (to appear) 2026. Z. Shi, P. Wang, C. Zhang, and Y. Cao. Towards Understanding Generalization in DP-GD: A Case Study in Training Two-Layer CNNs. Proceedings of the AAAI Conference on Artificial Intelligence, (to appear) 2026. 2025 D. Wagner, F. Hartung, J. Arweiler, A. Muraleedharan, I. Jungjohann, A. Nair, S. Reithermann, R. Schulz, M. Bortz, D. Neider, H. Leitte, J. Pfeffinger, S. Mandt, S. Fellenz, T. Katz, F. Jirasek, J. Burger, H. Hasse, and M. Kloft. NoBOOM: Chemical Process Datasets for Industrial Anomaly Detection. Advances in Neural Information Processing Systems (NeurIPS) 39, 2025. N. Ghanooni, D. Wagner, W. Mustafa, S. Fellenz, A. W. Lin, and M. Kloft. Mitigating Spurious Features in Contrastive Learning with Spectral Regularization. Advances in Neural Information Processing Systems (NeurIPS) 39, 2025. C. Qiu, M. Kloft, S. Mandt, and M. Rudolph. Self-supervised Anomaly Detection with Neural Transformations. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 47:3, 2170-2185, 2025. M. Nagda, P. Ostheimer, and S. Fellenz. Tethering Broken Themes: Aligning Neural Topic Models with Labels and Authors. Findings of the Association for Computational Linguistics: NAACL, 2025. L. Manduchi, K. Pandey, R. Bamler, R. Cotterell, S. Däubener, S. Fellenz, A. Fischer, T. Gärtner, M. Kirchler, M. Kloft, Y. Li, C. Lippert, G. de Melo, E. Nalisnick, B. Ommer, R. Ranganath, M. Rudolph, K. Ullrich, G. van den Broeck, J. Vogt, Y. Wang, F. Wenzel, F. Wood, S. Mandt, and V. Fortuin. On the Challenges and Opportunities in Generative AI. Transactions on Machine Learning Research (TMLR), 2025. B. Franks, M. Eliasof, S. Cantürk, G. Wolf, C.-B. Schönlieb, S. Fellenz, and M. Kloft. Towards Graph Foundation Models: A Study on the Generalization of Positional and Structural Encodings. Transactions on Machine Learning Research (TMLR), 2025. N. Ghanooni, W. Mustafa, Y. Lei, A. Lin, and M. Kloft. Generalization Bounds with Logarithmic Negative-Sample Dependence for Adversarial Contrastive Learning. Transactions on Machine Learning Research (TMLR), 2025. K. Bykov, M. M.-C. Höhne, A. Creosteanu, K.-R. Müller, F. Klauschen, S. Nakajima, and M. Kloft. Explaining Bayesian Neural Networks. Transactions on Machine Learning Research (TMLR), 2025. P. Wang, Y. Lei, M. Kloft, and Y. Ying. Optimal Utility Bounds for Differentially Private Gradient Descent in Three-Layer Neural Networ",
  "content_length": 63544,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:08"
}