{
  "name": "Mariana Bento",
  "homepage": "https://profiles.ucalgary.ca/mariana-bento",
  "status": "success",
  "content": "Mariana Pinheiro Bento | UCalgary Profiles | University of Calgary Skip to main content Dr. Mariana Pinheiro Bento PhD Are you the profile owner? Login to edit. Positions Assistant Professor Schulich School of Engineering, Department of Biomedical Engineering Assistant Professor Schulich School of Engineering, Department of Electrical and Software Engineering Full Member Hotchkiss Brain Institute Child Health & Wellness Researcher Alberta Children's Hospital Research Institute Contact information Email mariana.pinheirobent@ucalgary.ca Web presence Google Scholar Phone number Office: 403.220.7073 Location Office: CCIT016 For media enquiries, contact Joe McFarland Media Relations and Communications Specialist Cell: +1.403.671.2710 Email: Joe.Mcfarland@ucalgary.ca Background Educational Background PhD Computer Engineering, University of Campinas (UNICAMP), 2016, MSc Computer Engineering, University of Campinas (UNICAMP), 2012, BSc Teleinformatics Engineering, Federal University of Ceara (UFC), 2010, Biography My name is Mariana Bento, a full-time, tenure-track Assistant Professor in the Department of Biomedical Engineering in the Schulich School of Engineering at the University of Calgary. I have joint appointment in the Department of Electrical and Software Engineering (ESE), where I started my first independent academic position (July 1, 2021), before moving my primary appointment to the newly formed Biomedical Engineering Department (BME) in January 2022. I have masters and doctoral degrees computer engineering at the University of Campinas in Brazil, and postdoctoral fellowship in Radiology and Clinical Neuroscience at UCalgary. My research focus on Artificial Intelligence (AI) for Healthcare applications, considering key aspects like responsibility, trustworthiness, fairness, and bias mitigation. We consider biases related to varying demographics and heterogeneous data (variability related to acquisition protocols). I also developed research considering heterogeneous multi-modal data, created by combining (or aggregating) datasets from multiple scanners and sites. The study and development of AI models with such datasets improve reliability, generalization and, importantly, accelerate their translation to multiple domains. Research Areas of Research Biomedical Engineering Artificial Intelligence AI for social good, Fairness and Privacy in Machine Learning, Responsible AI, Trustworthy ML Computer Vision Brain Magnetic Resonance Imaging Participation in university strategic initiatives Child Health and Wellness (2020-2025) Engineering Solutions for Health (2015-2021) Health and Life Publications Alzheimer Disease Detection Studies: Perspective on Multi-Modal Data. F. Dehghani, R. Derafshi, J.Lin, S. Bayat and Mariana Bent0. Digital Health for Precision in Prevention, International Medical Informatics Association (IMIA) Yearbook of Medical Informatics. (2024) Detecting Prenatal Alcohol Exposure in Pediatric Brain MRI: A Transfer Learning Approach with Explainability Insights.. A. Das, K. Duarte, C. Lebel, M. Bento.. Frontiers in Computational Neuroscience: Deep Learning and Neuroimage Processing in Understanding Neurological Diseases. (2024) Detecting Prenatal Alcohol Exposure in Pediatric Brain MRI: A Transfer Learning Approach with Explainability Insights.. A. Das, K. Duarte, C. Lebel, M. Bento.. Frontiers in Computational Neuroscience: Deep Learning and Neuroimage Processing in Understanding Neurological Diseases. (2024) Comparative Skull Stripping Techniques on Pediatric Magnetic Resonance Imaging. A. Das, K. Duarte, S. Wong, Y. Mamoun and M. Bento. The 19th International Symposium on Medical Information Processing and Analysis. (2023) Automatic MR image quality evaluation using a Deep CNN: A reference-free method to rate motion artifacts in neuroimaging. Fantini, I., Yasuda, C., Bento, M., et al. Computerized Medical Imaging and Graphics. (2021) Dual-domain Cascade of U-nets for Multi-channel Magnetic Resonance Image Reconstruction. Souza, R., Bento, M., et al.. Elsevier Magnetic Resonance Imaging Access. (2020) Automatic Identification of Atherosclerosis Patients in a Heterogeneous MR Brain Imaging Dataset. Bento, M., et al.. Magnetic Resonance Imaging. (2021) Standardized Assessment of Automatic Segmentation of White Matter Hyperintensities; Results of the WMH Segmentation Challenge. Kuijf, H., Biesbroek, J., Bresser, J., Heinen, R., Andermatt, S., Bento, M., et. al.. IEEE Transactions on Medical Imaging. (2019) Reliability of Computer-Aided Diagnosis Tools with Multicenter MR Datasets: Impact of Training Protocol . Bento, M., Souza, R. and Frayne, R. . Oral presentation in SPIE Medical Imaging. (2019) Multicenter Imaging Studies: Automated Approach to Evaluating Data Variability and the Role of Outliers. Bento, M., Souza, R. and Frayne, R. . Oral presentation in 31st Conference on Graphics, Patterns and Images. (2018) Are you the profile owner? Login to edit.",
  "content_length": 4958,
  "method": "requests",
  "crawl_time": "2025-12-01 13:52:36"
}