{
  "name": "Marjan Sirjani",
  "homepage": "https://marjansirjani.github.io/Marjan-Sirjani",
  "status": "success",
  "content": "Marjan Sirjani - Professor of Software Engineering Bio Marjan Sirjani is a Professor at School of Innovation, Design and Engineering at Malardalen University (MDH), Vasteras, Sweden. Her main research interest is applying formal methods in Software Engineering. She works on modeling and verification of concurrent, distributed, timed, and self-adaptive systems. Marjan and her research group are pioneers in building model checking tools, compositional verification theories, and state-space reduction techniques for actor-based models. She has been working on analyzing actors since 2001 using the modeling language Rebeca. Rebeca and its extensions are designed to bridge the gap between model-based software development and formal analysis, and have been used for analyzing different network and system applications. She has also worked on coordination languages and is the co-author of the paper proposing Constraint Automata as the compositional formal semantics for the coordination language Reo. Her research is now focused on safety and security assurance and performance evaluation of cyber-physical and autonomous systems. Marjan is the founder and leader of the Cyber-Physical Systems Analysis research group at MDH. She was a co-founder of the Icelandic Center for Research on Software Engineering at Reykjavik University and the founder of the Formal Methods Laboratory at the University of Tehran. She has been a member of the expert panel on Engineering and Physical Sciences at RANNÍS, The National Icelandic Centre for Research. Marjan has been a PC member and PC chair of several international conferences including SEFM, iFM, Coordination, FM, FMICS, SAC, FSEN, and DATE. She is an editor of the journal Science of Computer Programming. Before joining academia as a full-time faculty, she was the managing director of Behin System Company for more than ten years, developing software and providing system services. Marjan served as the head of the Software Engineering Department of the School of Electrical and Computer Engineering at the University of Tehran from 2005 to 2008 prior to joining the School of Computer Science at Reykjavik in 2008. She established the FSEN conference series in 2005 with the help of the Steering Committee and support of the School of Computer Science at IPM. FSEN has been supported by IFIP WG2.2 and ACM SigSoft. Full CV Research Research interests: Formal Methods in Software Engineering Modeling Reactive and Concurrent Systems Actor Model Component-based Modeling Formal Verification Model Checking and Reduction Techniques Applying Formal Methods in System Design Analyzing Self-Adaptive Systems I am the Steering Committee Chair of FSEN and a member of Steering Committees of DisCoTec and COORDINATION. Currently, or in the past I have been a PC member of MEMOCODE, SEFM, ACM SAC-Verification and Testing, ACM SAC-Coordination Models, TTCS, AGERE@Splash, ICSSEA, FOCLASA, FACS, and Coordination. I have served as the PC chair of FSEN, SEFM, COORDINATION, and FOCLASA. CV (PDF) | Rebeca Homepage Research Projects ASSURE: Human-centric Safety and Security for Cyber-Physical Systems (2025-2026) - PI. MDU Research Initiative on Human-centred Multi-disciplinary research. EASCO: Empirical Analysis of Success Factors in Collaborative Swedish Research Projects in Engineering and Computer Science (2025)- PI MDU Initiative on Research on Collaboration – RoC. ARAS: Assured Reasoning for Autonomous Cyber-Physical Systems (2024-2025) - Co-PI. AI@MDU SACSys: Safe and Secure Adaptive Collaborative Systems (2019-2024) - PI. Synergy project grant from the Knowledge Foundation Sweden (KKS). Serendipity: Safe and Reliable Platforms for Autonomy (2018-2024) - Co-PI. Framework project grant from Swedish Foundation for Strategic Research (SSF). MACMa: Modeling and Analyzing Cyber-Physical Systems (2016-2023) - PI. Software Center, Sweden. SEADA: Self-Adaptive Actors - Safety Assurance (2016-2020) - PI. Icelandic National Research Institute (Rannis). TARO: Timed Asynchronous Reactive Objects in Distributed Systems (2011-2015) - PI. Icelandic National Research Institute (Rannis). See the ongoing projects at Rebeca Homepage News & Events Rebeca for Actor Analysis in Action - Festschrift dedicated to Marjan Sirjani 2025 2025-04-09: Marjan's Festschrift, April 9, 2025. Marjan's FEST 2025-04-09: The Festschrift is published: Rebeca for Actor Analysis in Action, Essays Dedicated to Marjan Sirjani on the Occasion of Her 60th Birthday, Editors: Edward A. Lee, Mohammad Reza Mousavi, Carolyn Talcott. Springer Show more events Maghsood's PhD Report in June 2024 Fereidoun Moradi PhD Defense in June. 2023 ASSURE: Human-centric Safety and Security for Cyber-Physical Systems, At TSS Steering Committee, Nov. 15, 2023, Sweden Actors Upgraded for Variability, Adaptability, and Determinism, State-of-the-Art of Active Objects, Fifth International ABS Workshop, Lyon, France, 4-6 Oct. 2023 Timed Actors and their Formal Verification, Keynote Talk, Combined 30th International Workshop on Expressiveness in Concurrency and 20th Workshop on Structural Operational Semantics, affiliated with CONCUR, Sept. 18, Antwerp, Belgium 2023 Dependability, Cyber-security, and Beyond, DPAC Summit, Haga Castle, March 8-9, 2023 How Can We Trust Self-Driving Cars? Using Robust Techniques in Modern Software System Design, Invited Talk, Fackförbundet för ingenjörer, Union for Engineers in Sweden, Stockholm, Feb. 23, 2023 SACSys: Safe and Secure Adaptive Collaborative Systems, 2nd Steering Committee and Advisory Board Meeting, KKS Synergy Project, 8-9 Feb., MDU, 2023 Modeling and Analysis of Cyber-Physical Systems Using Actors, Challenges and Questions, Dagstuhl Seminar 23041, Integrated Rigorous Analysis in Cyber-Physical Systems Engineering, Jan 22 – Jan 27, 2023 2022 Keynote Talk, Anomaly Detection for Cyber-Physical Systems using Tiny Digital Twins, NWPT 2022, 33rd Nordic Workshop on Programming Theory, Bergen, Norway, 2-4 November 2022 Keynote Talk, Anomaly Detection for Cyber-Physical Systems using Tiny Digital Twins, AVL ITS R&T Research Networking Day, Leibnitz, Austria, Oct. 17, 2022 Resilient Cyber-Physical Systems: Safety, Security and beyond, Seminar with Bran Selic, MDU, Oct. 6, 2022 Integrating Design-time and Run-time Methods for Detecting Cyber-Attacks, Reykjavik, Iceland, Sept. 26, 2022 Integrating Design-time and Run-time Methods for Detecting Cyber-Attacks, 2nd Mälardalen University/ Software Center workshop on Cyber-Security, MDU, Sept. 7, 2022 Keynote Talk, Analysis of Timing Properties in Networked Systems, RTEST, May 2022, Iran Cybersecurity, Safety and Resilience, Software Center – MDU Cybersecurity Workshop, April 27, 2022 2021 2021-05-07: Invited Talk: \"Two Decades of Analysing Real-time Distributed Systems\" at Leicester University Weekly Seminar (Online). 2021-03: Talk: \"Analysis of Cyber-Physical Systems\" for Software Center, Sweden. 2021-01-19: PI talk: \"Safe and Secure Adaptive Collaborative Systems\" at SACSys Reporting Workshop. 2020 2020-06-11: Talk: \"Agile Verification-Driven Development of Cyber-Physical Systems\" at Software Center, Sweden. 2020-03-10: Talk: \"Modelling and Formal Analysis for Security and Safety\" at Serendipity Reporting Workshop, MDH, Sweden. 2019 2019-12-04: PI talk: \"Safe and Secure Adaptive Collaborative Systems\" at SACSys Kickoff, Skövde, Sweden. 2019-11: Talk: \"Model Checking Tool for Rebeca: Afra\" at Dagstuhl Seminar. 2019-10-27: Talk: \"Debugging of Actor Programs using Rebeca Model Checking Tool\" at Programming Languages for Distributed Systems and Distributed Data Management, Dagstuhl Seminar 19442. 2019-10-07: Invited Paper: \"Reactive Actors: Isolation for Efficient Analysis of Distributed Systems\" at IEEE/ACM DS-RT 2019, Cosenza, Italy. 2019-10-07: Keynote Talk: \"Analyzing Real-time Distributed Systems using Timed Actors\" at IEEE/ACM DS-RT 2019, Cosenza, Italy. 2019-09-16: Invited Talk: \"Reactive Systems: From Requirements to Verifiable Models to Code\" at ASYDE 2019, Oslo, Norway. 2019-07-17: Invited Talk: \"Actor-based Design Platform for System of Systems\" at COMPSAC 2019, CAP: Computer Architecture & Platforms, Milwaukee, US. 2019-06-12: Talk: \"Designing Actor Languages for Model Checking and Performance Evaluation\" at Programming Language Research Meetup, Oracle, Stockholm, Sweden. 2019-05-27: Talk: \"Actors for Analysis\" at Shonan School, Japan. 2019-04: Talk: \"A Formal Model to Integrate Behavioural and Structural Adaptations in Self-Adaptive Systems\" at FSEN, Tehran, Iran. 2019-04-22: Talk: \"Dependable Cyber-Physical Systems\" at Iran Academy of Science, Tehran, Iran. 2019-04-12: Talk: \"MACMa: Modeling and Analyzing Event-based Autonomous Systems (Project #29)\" at Software Center, Ericsson, Sweden. 2019-04-10: Talk: \"Modeling, Formal Verification and Analysis of Distributed Systems\" at DPAC summit. 2019-04-04: Inauguration Lecture: \"Trusting Autonomous Systems\" at MDH, Sweden. 2019-03-08: Talk: \"Timed Rebeca: From Requirement to Design to Code\" at Bombardier, Sweden. 2016 2016-06-01: Joined Mälardalen University as Chair of Software Engineering. 2016-06: General Chair of iFM 2016, Reykjavik University. 2016-06: Prof. Edward Lee visited Reykjavik University. Check Edward's talk. 2016-04-05: Visit Professor Edward Lee at School of EECS at UC Berkeley, April-May 2016. 2016-01: On the occasion of its 50th anniversary, Sharif University of Technology selected 50 individuals out of 48,000 graduates in the last 50 years to receive its distinguished alumni award. Marjan was one of them! 2016-01: SEADA project approved by RANNIS, the Icelandic national research funding agency. Marjan is the PI. 2015 2015-05: Visit Ptolemy Group at School of EECS at UC Berkeley on a Fulbright Scholar Grant from May to August 2015. Teaching Teaching at Reykjavik University: Software Engineering II Advanced Software Engineering Research Methodology Teaching at University of Tehran: Software Engineering 1 (System Analysis and Design) Pr",
  "content_length": 10221,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:10"
}