{
  "name": "Marjo Kauppinen",
  "homepage": "https://people.aalto.fi/new/marjo.kauppinen",
  "status": "success",
  "content": "People | Aalto University People People and contact information Aalto University has six schools with nearly 12 000 students and 4 200 employees, including 400 professors. Get to know our experts in research, art, technology and business. Contact information and how to navigate at the campus Addresses and contact info Campus maps and opening hours Schools, departments and units Contact Information for Aalto University Admission Services Read more Find people and research Delve into our research – find the people behind it! (external link) You can find publications, research units and departments in the research information portal. Management The executive bodies of the university are the Board (AUFB), the President, and the University Academic Affairs Committee (AAC). The President's Management Team (PMT) coordinates the daily work at the university and the preparation of pre-decision motions. The Aalto Management Team (AMT) furthers transparency and open dialogue in decision-making regarding university development. Aalto University Anything else you are looking for? Study at Aalto Study in Finland at Aalto University, where science and art meet technology and business. Join a top-ranked, multidisciplinary community! For the media Aalto University Communications helps media representatives in all questions related to the university. Careers at Aalto Aalto University is where science and art meet technology and business. We are an international community of 20,000 bold thinkers who shape a sustainable future with education, research breakthroughs and innovative ideas and solutions. Join us in changing the world – we have many attractive career opportunities to offer. Collaboration Aalto University offers numerous opportunities for collaboration and networking. How would you like to collaborate with us? Meet our people Appointments See all Appointments, Cooperation Published: 27.11.2025 Aalto academics begin Unite! visiting professorships at TU Darmstadt As part of the Unite! Visiting Professorship Programme, TU Darmstadt welcomed six visiting professors from Aalto University for the winter semester 2025/2026. Appointments Published: 24.11.2025 Miklu Silvanto, who has worked with the world's most well-known brands, how do you nurture creativity? Oura’s Chief Design Officer and Professor of Practice at Aalto University's Department of Design Miklu Silvanto talks about creativity. Appointments Published: 14.11.2025 Meet Hannah Hook, assistant professor of sustainable land use and transport planning Hannah Hook explores the ways everyday travel shapes happiness and satisfaction. Appointments Published: 6.11.2025 Professor Max Finne appointed Associate Dean of MBA Education at the School of Business The creation of the Associate Dean position aims to further enhance our internationally accredited MBA, EMBA, and DBA programs at both national and global levels See all People stories See all University Published: 11.4.2024 Olli Ikkala and Esa Saarinen found a common thread in baroque music and lecturing Olli Ikkala will continue his research on nature-inspired materials and will find himself again as an organist after his busy research career. Esa Saarinen, on the other hand, continued to lecture the Philosophy and Systems Thinking (Filosofia ja systeemiajattelu) course to packed halls this spring. When they met, they discussed the organ and the atmosphere of the lectures. Cooperation, Research & Art, University Published: 9.2.2024 An entrepreneurial researcher takes action and creates something new When a researcher thinks like an entrepreneur, they can create something truly groundbreaking. Cooperation, University Published: 18.12.2023 Experimentation, risk-taking, seeking the new – entrepreneurial mindset permeates Aalto For Aalto University employees, entrepreneurial mindset means daring to try something new Research & Art Published: 15.11.2023 Koos Zevenhoven: The scientific world doesn't know this kind of unusual path very well 'There have also been PhD students in my group, and I haven’t been able to officially act as their advisor. Some of my students have finished their PhD before me.' See all Updated: 11.4.2025 Published: 8.5.2018 Share URL copied!",
  "content_length": 4227,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:13"
}