{
  "name": "Marko C. J. D. van Eekelen",
  "homepage": "http://www.cs.ru.nl/~marko",
  "status": "success",
  "content": "Marko van Eekelen Marko van Eekelen, formally Prof.dr. M.C.J.D. van Eekelen. Affiliations: As of January 1, 2020 I am appointed as Dean of the new Beta-faculty of the Open University. I am a full Professor in Software Technology (70% of my time) at the Open University (OU; my Open University testimonial short video). I am universitair hoofddocent (Senior Lecturer/Associate Professor; 30%) at the research section Digital Security of the Institute for Computing and Information Sciences within the Faculty of Science of the Radboud University Nijmegen (RU). Onderzoek/Research: There is a separate site of my research activities. This site includes a list of my publications with on-line copies. Als je geïnteresseerd bent in een populair wetenschappelijke uitwijding over een deel van mijn onderzoek, Verificatie van Safety-critical Systems, kijk dan op 'De Universiteit van Nederland' (in Dutch). Onderwijs/Teaching: As teacher since 1981 within the Radboud University Nijmegen, now within the Onderwijsinstituut voor Informatica en Informatiekunde I give courses on Software Analysis as part of the Master track Software Science. Software Engineering in the RU Bachelor curriculum and System Development and System Development Research within the Computer Science, Information Science and Artifical Intelligence Master Curricula. The latter three courses use a joint practical lab (GipHouse). I coordinate the other courses that use this joint lab: Architectural New  Challenges, Business Process Architecture in Practice and System development Management. At the Open University I am responsible for the 60 ec Master Sofware Engineering. I supervise Master Theses in Software Engineering, and Computer Science on a regular basis. There is a separate site of my teaching activities with suggestions for Master and Bachelor thesis subjects under my supervision. Organisation: I am quite active in this field. Proud to have been from 2012-2019 for 8 years the programmeleader of the Master Software Engineering at Open University since the judgments on that Master lead to the Computable award of \"ICT- educator of the year 2017\" for the Open University. Also proud of 5 years in a row 'Topopleiding\" for Master Software Engineering in Keuzegids Hoger Onderwijs. From 2005 to 2019 for 15 years I have been Scientific Director of the Nijmegen part of LaQuSo: for concrete applications of research in commercial and industrial contexts. At the Open University I was (from June 2014 upto December 2019 for 6 years) head of the Computer Science Department within the Faculty of Management, Science and Technology, holding the Chair in Software Technology (since January 2009). At the Radboud University Nijmegen I am since september 2004 part of the section Digital Security of the Institute for Computing and Information Sciences. I am a member of the security and program correctness research group lead by Prof. Bart Jacobs. There is a separate site of my organisational activities. OU: Email: marko.vaneekelen ‘at’ ou.nl       Tel: : Secr: +31 45 576 2828; Direct: +31 45 576 2573    Fax: +31 45 576 2115 RUN: Email: marko at cs.ru.nl      Tel:: +31 24 365 3410    Fax: +31 24 365 2298 Skype: markovaneekelen Twitter: @MarkoVanEekelen Office (on Mondays and Tuesdays I am usually at the OU premises in Heerlen): ·     Radboud University Nijmegen: office 3.05, third floor in the Mercator 1 building, Toernooiveld 212, 6525 EC Nijmegen. It is just across the Huygens building (P11, the parking garage underneath the Huygens building is the closest place to park your car, see parking-information) (see also the general guidelines to get to the Nijmegen University Campus). Post: Institute for Computing and Information Sciences, Mailbox 47, Faculty of Science, Postbus 9010, 6500 GL Nijmegen, The Netherlands. ·       Open Universiteit Nederland: office MK3.71, third floor in the Milton Keynes building, Valkenburgerweg 177, 6419 AT Heerlen. Post: Faculteit Management, Science & Technology, P.O.Box 2960, 6401 DL  Heerlen, The Netherlands. WorkedThere: Over the years, I have been at lots of places for doing my work. I tried to make a summary of the places where I worked. Background: For more background information I refer to my Curriculum Vitae (as it was a long time ago, in 2009). Personal activities: In 1980 I got acquainted with Dutch folk dancing and with the Rubiks Cube (in 1981 I was Dutch Champion and holder of the World Speed Cube Record). Both Dutch folk dancing and the Rubik's Cube are still personal hobbys. I made a separate page on my activities (lectures, material)with respect to the Rubik's Cube and Mathematics (in Dutch): de kubus van Rubik en Wiskunde. I am the longest lasting member of the Dutch folk dancing group De Pierewaaiers. Since 2011, I am actively involved in the Gebroeders van Limburg Festival as re-enactor of Marsilius van Inghen. I was the initiator of naming a Radboud University campus road to Marsilius van Inghen: the Marsilius van Inghenpad.",
  "content_length": 4999,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:48"
}