{
  "name": "Mark C. Jeffrey",
  "homepage": "https://www.eecg.utoronto.ca/~mcj",
  "status": "success",
  "content": "Mark C. Jeffrey | University of Toronto I am an Assistant Professor in the Edward S. Rogers Sr. Department of Electrical and Computer Engineering and am cross-appointed to the Department of Computer Science at the University of Toronto. I work on computer architecture and computer systems. My goal is to enable software engineers to easily harness the full potential of parallel systems with many thousands of cores. My current research focuses on (i) new programming models and compilers that easily express challenging types of parallelism and (ii) new large-scale multicore and accelerator architectures that extract the parallelism. Before joining the University of Toronto, I was a Research Scientist in the Systems group at Facebook AI Research. I earned a PhD from the Massachusetts Institute of Technology, where I worked with Daniel Sanchez in the Computer Science and Artificial Intelligence Laboratory. Previously, I was a software engineer at AeroFS, a Y combinator startup, working on distributed file sharing. I earned an MASc while working with Greg Steffan and a BASc in Engineering Science from the University of Toronto. Publications [DBLP] [Scholar] Fusing adds and shifts for efficient dot products. Pavel Golikov, Karthik Ganesan, Gennady Pekhimenko, and Mark C. Jeffrey. IEEE Computer Architecture Letters (CAL). 2026. [text] IEEECAL2026 A performance model for disintegrated manycores. Jiaxiang Li, Mark C. Jeffrey, and Natalie Enright Jerger. IEEE Computer Architecture Letters (CAL). 2026. [text] [doi] IEEECAL2026 Symbiotic task scheduling and data prefetching. Gilead Posluns and Mark C. Jeffrey. In Proc. of the 58th IEEE/ACM international symposium on Microarchitecture (MICRO-58). October 2025. [text] [doi] [slides] MICRO2025 Attention-level speculation. Jack Cai, Ammar Vora, Randolph Zhang, Mark O'Connor, and Mark C. Jeffrey. In Proc. of the 42nd International Conference on Machine Learning (ICML). July 2025. [text] [pmlr] [talk] [code] ICML2025 MultiQueue-based FPGA routing: relaxed A* priority ordering for improved parallelism. Alexandre Singer, Hang Yan, Guozheng Zhang, Mark C. Jeffrey, Mirjana StojiloviÄ, and Vaughn Betz. In Proc. of the 23rd IEEE international conference on Field Programmable Technology (FPT). December 2024. (Best Paper Nominee) [text] [doi] [slides] [talk] [code] FPT2024 Multi bucket queues: efficient concurrent priority scheduling. Guozheng Zhang, Gilead Posluns, and Mark C. Jeffrey. In Proc. of the 36th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA). June 2024. [text] [doi] [slides] [thesis] [code] SPAA2024 When is parallelism fearless and zero-cost with Rust? Javad Abdi, Gilead Posluns, Guozheng Zhang, Boxuan Wang, and Mark C. Jeffrey. In Proc. of the 36th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA). June 2024. [text] [doi] [slides] [thesis] [code] SPAA2024 Intergenerational embodied carbon. Aster Plotnik, Karthik Ganesan, Natalie Enright Jerger, and Mark C. Jeffrey. In Proc. of the workshop on Hot Topics in Ethical Computer Systems (HotEthics). April 2024. [text] [slides] HotEthics2024 Disintegrating manycores: which applications lose and why? Isidor R. Brkić and Mark C. Jeffrey. In Proc. of the 16th international workshop on Network on Chip Architectures (NoCArc). October 2023. (Best Paper Award) [text] [doi] [slides] [thesis] NoCArc2023 Brief announcement: is the problem-based benchmark suite fearless with Rust? Javad Abdi, Guowei Zhang, and Mark C. Jeffrey. In Proc. of the 35th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA). June 2023. [text] [doi] [slides] [code] SPAA2023 Altocumulus: Scalable scheduling for nanosecond-scale remote procedure calls. Jiechen Zhao, Iris Uwizeyimana, Karthik Ganesan, Mark C. Jeffrey, and Natalie Enright Jerger. In Proc. of the 55th IEEE/ACM international symposium on Microarchitecture (MICRO-55). October 2022. [text] [doi] MICRO2022 A scalable architecture for reprioritizing ordered parallelism. Gilead Posluns, Yan Zhu, Guowei Zhang, and Mark C. Jeffrey. In Proc. of the 49th ACM/IEEE International Symposium on Computer Architecture (ISCA-49). June 2022. [text] [doi] [slides] [talk] [thesis] ISCA2022 Understanding and improving failure tolerant training for deep learning recommendation with partial recovery. Kiwan Maeng, Shivam Bharuka, Isabel Gao, Mark C. Jeffrey, Vikram Saraph, Bor-Yiing Su, Caroline Trippel, Jiyan Yang, Mike Rabbat, Brandon Lucia, and Carole-Jean Wu. In Proc. of the 4th Conference on Machine Learning and Systems (MLSys). April 2021. [text] [talk] MLSys2021 T4: Compiling sequential code for effective speculative parallelization in hardware. Victor A. Ying, Mark C. Jeffrey, and Daniel Sanchez. In Proc. of the 47th ACM/IEEE International Symposium on Computer Architecture (ISCA-47). June 2020. [text] [doi] [slides] [talk] [code] ISCA2020 A hardware and software architecture for pervasive parallelism. Mark C. Jeffrey. PhD Thesis, Massachusetts Institute of Technology. 2019. (George M. Sprowls PhD thesis award in computer science, 2nd place) [text] PhDThesis Harmonizing speculative and non-speculative execution in architectures for ordered parallelism. Mark C. Jeffrey, Victor A. Ying, Suvinay Subramanian, Hyun Ryong Lee, Joel Emer, and Daniel Sanchez. In Proc. of the 51st IEEE/ACM international symposium on Microarchitecture (MICRO-51). October 2018. [text] [doi] [slides] [lightning] MICRO2018 SAM: optimizing multithreaded cores for speculative parallelism. Maleen Abeydeera, Suvinay Subramanian, Mark C. Jeffrey, Joel Emer, and Daniel Sanchez. In Proc. of the 26th international conference on Parallel Architectures and Compilation Techniques (PACT-26). September 2017. [text] [doi] [slides] PACT2017 Fractal: an execution model for fine-grain nested speculative parallelism. Suvinay Subramanian, Mark C. Jeffrey, Maleen Abeydeera, Hyun Ryong Lee, Victor A. Ying, Joel Emer, and Daniel Sanchez. In Proc. of the 44th ACM/IEEE International Symposium on Computer Architecture (ISCA-44). June 2017. [text] [doi] [slides] [press: MIT News] ISCA2017 Data-centric execution of speculative parallel programs. Mark C. Jeffrey, Suvinay Subramanian, Maleen Abeydeera, Joel Emer, and Daniel Sanchez. In Proc. of the 49th IEEE/ACM international symposium on Microarchitecture (MICRO-49). October 2016. (Honorable mention for IEEE Micro's Top Picks) [text] [doi] [slides] MICRO2016 Unlocking ordered parallelism with the Swarm architecture. Mark C. Jeffrey, Suvinay Subramanian, Cong Yan, Joel Emer, and Daniel Sanchez. IEEE Micro's Top Picks from the Computer Architecture Conferences, 36(3). May/June 2016. [text] [doi] [press: MIT News, EEJournal, TOP500, HPCwire] IEEEMicro2016 A scalable architecture for ordered parallelism. Mark C. Jeffrey, Suvinay Subramanian, Cong Yan, Joel Emer, and Daniel Sanchez. In Proc. of the 48th IEEE/ACM international symposium on Microarchitecture (MICRO-48). December 2015. (Selected for IEEE Micro's Top Picks issue of \"most significant papers in computer architecture based on novelty and long-term impact\") [text] [doi] [slides] MICRO2015 Understanding and improving Bloom filter configuration for lazy address-set disambiguation. Mark C. Jeffrey. MASc Thesis, University of Toronto. 2011. [text] [slides] [code] MAScThesis Application-specific signatures for transactional memory in soft processors. Martin Labrecque, Mark C. Jeffrey, and J. Gregory Steffan. ACM Transactions on Reconfigurable Technology and Systems, 4(3). August 2011. [doi] ACMTRETS2011 Understanding Bloom filter intersection for lazy address-set disambiguation. Mark C. Jeffrey and J. Gregory Steffan. In Proc. of the 23rd ACM Symposium on Parallelism in Algorithms and Architectures (SPAA). June 2011. [text] [doi] [slides] [code] SPAA2011 Application-specific signatures for transactional memory in soft processors. Martin Labrecque, Mark C. Jeffrey, and J. Gregory Steffan. In Proc. of the 6th international symposium on Applied Reconfigurable Computing (ARC). March 2010. (Best paper award) [doi] ARC2010 Teaching Fall 2025 ECE552 Computer Architecture and ECE253 Digital and Computer Systems Winter 2025 ECE1755 Parallel Computer Architecture and Programming Winter 2024 ECE1755 Parallel Computer Architecture and Programming Fall 2023 ECE552 Computer Architecture and ECE253 Digital and Computer Systems Winter 2023 ECE1755 Parallel Computer Architecture and Programming Fall 2022 ECE552 Computer Architecture and ECE253 Digital and Computer Systems Winter 2022 ECE1755 Parallel Computer Architecture and Programming Fall 2021 ECE552 Computer Architecture Winter 2021 ECE1755 Parallel Computer Architecture and Programming Fall 2020 ECE552 Computer Architecture",
  "content_length": 8714,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:16"
}