{
  "name": "Mark A. Davenport",
  "homepage": " https://mdav.ece.gatech.edu/index.html",
  "status": "success",
  "content": "﻿ Mark A. Davenport MARK A. DAVENPORT Research Students Papers Code Teaching Travel Mark A. Davenport Professor and Associate Chair for Graduate Affairs School of Electrical & Computer Engineering Center for Signal and Information Processing Center for Machine Learning Georgia Institute of Technology Contact information CV || Biography || Academic genealogy I am a Professor and the Associate Chair for Graduate Affairs in the School of Electrical & Computer Engineering at the Georgia Institute of Technology. I am a member of the Center for Machine Learning and the Center for Signal and Information Processing. My research interests lie in the intersection of the fields of signal processing, high-dimensional statistics, and machine learning. I am particularly interested in the fundamental role that low-dimensional models and optimization play in these fields. News Received the Richard M. Bass Outstanding Teacher Award in 2022 Received the 2020 Outstanding Young Engineering Alumni Award from Rice University Santhosh Karnik's paper “Fast multitaper spectral estimation” wins Best Student Paper Award at SampTA 2019 Received the 2019 Presidential Early Career Award for Scientists and Engineers (PECASE) Selected recent papers A. D. McRae, J. Romberg, and M. A. Davenport, “Optimal convex lifted sparse phase retrieval and PCA with an atomic matrix norm regularizer,” to appear in IEEE Trans. on Information Theory, 2023. [arXiv] N. Ahad, M. A. Davenport, and Y. Xie, “Data-adaptive symmetric CUSUM for sequential change detection,” arxiv:2210.17353, October 2022. C. DeLude, R. S. Sharma, S. Karnik, C. Hood, M. A. Davenport, and J. Romberg, “Iterative broadband source localization” arxiv:2210.11669, October 2022. P. Guan, J. Jin, J. Romberg, and M. A. Davenport, “Loop unrolled shallow equilibrium regularizer (LUSER): A memory-efficient inverse problem solver” arxiv:2210.04987, October 2022. M. R. O'Shaughnessy, D. S. Schiff, L. R. Varshney, C. J. Rozell, and M. A. Davenport, “What governs attitudes toward artificial intelligence adoption and governance?” to appear in Science and Public Policy, 2023. S. Karnik, J. Romberg, and M. A. Davenport, “Thomson’s multitaper method revisited.” IEEE Trans. on Information Theory, 68(7), pp. 4864-4891, July 2022. C. DeLude, S. Karnik, M. A. Davenport, and J. Romberg, “Broadband beamforming via linear embedding,” arXiv:2206.07143, June 2022. A. D. McRae, S. Karnik, M. A. Davenport, and V. Muthukumar, “Harmless interpolation in regression and classification with structured features,” in Proc. Int. Conf. on Artificial Intelligence and Statistics (AISTATS), Online, March 2022. N. Ahad, E. L. Dyer, K. B. Hengen, Y. Xie, and M. A. Davenport, “Learning Sinkhorn divergences for supervised change point detection,” arXiv:2202.04000, February 2022. N. Nadagouda, A. Xu, and M. A. Davenport, “Active metric learning and classification using similarity queries,” arXiv:2202.01953, February 2022.",
  "content_length": 3001,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:12"
}