{
  "name": "Mark Perry",
  "homepage": "https://www.brunel.ac.uk/people/mark-perry",
  "status": "success",
  "content": "Professor Mark Perry | Introduction | Brunel University London Skip to Content Home People Professor Mark Perry Professor Mark PerryProfessor Wilfred Brown Building 215 Email: mark.perry@brunel.ac.uk Tel: +44 (0)1895 266008 Personal Website Computer Science College of Engineering, Design and Physical Sciences Summary Interdisciplinary ‘user studies’ researcher, focused on human-computer interaction and computer supported co-operative work. Extensive experience managing research projects, investigating and designing mobile, ubiquitous, distributed and collaborative technologies from a user-centred perspective. Leading research projects as Principal Investigator and Co-investigator. Experienced educator in Computer Science, teaching across a range of topics and ability levels for over 25 years, and contributor to QAA Subject Benchmark Statement for Computing (2022). Research community building, including reviewing and committee work, ACM CHI Associate Chair 2007, 2009, 2012-14, Subcommittee Chair 2010 and 2015, and Technical Programme Chair, 2018. ACM SIGCHI Executive Committee member (2019-21). Senior committee member, MobileHCI 2012. Senior member of the ACM. Previous holder of the Royal Society Kan Tong Po International Fellowship (2018). Qualifications PhD (1997) Computer Science (Human-Computer Interaction) Brunel University London MSc in Cognitive Science (1993) University of Wales, College of Cardiff BA (Hons.) Psychology - 2:1 (1992) University of Wales, College of Cardiff Responsibility Senior Tutor, Department of Computer Science Department Management Board PhD Research Methods (cs2003) module leader Mark has been involved in the supervison of over 250 undergraduate and postgraduate research projects during his academic career, and the sucessful graduation of 12 PhDs. Newest selected publications Perry, M., Greiffenhagen, C. and Li, R. (2025) 'Disconnected Platforms, Networked Lives. Social bridging across fragmented payment systems in China'. ACM Transactions on Computer - Human Interaction, 0 (ahead of print). pp. 1 - 23. ISSN: 1073-0516 Open Access Link Journal article Perry, M. (Accepted) 'Designing Financial Interactions [pre-print](', inHandbook of Human Computer-Interaction. Open Access Link Book chapter Li, S., Greiffenhagen, C. and Perry, M. (2024) 'A retail perspective on China’s CBDC: Differences that don’t make a difference?'.17th Behavioural Finance Working Group conference. London. Conference paper Koumpounis, S. and Perry, M. (2023) 'Blockchain-based electronic health record system with patient-centred data access control'.45th ACM/IEEE International Conference on Software Engineering. Melbourne, Australia. 14 - 20 May. IEEE. pp. 17 - 24.Open Access Link Conference paper Perry, M., Destefanis, G. and Neykova, R. (2023) 'Non-fungible tokens (NFTs) and the blockchain (NFT0049)'. Place of publication: United Kingdom. Parliament. Available at: https://committees.parliament.uk/writtenevidence/115647/pdf/.Open Access Link Report More publications(100)",
  "content_length": 3022,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:36"
}