{
  "name": "Mark A. Finlayson",
  "homepage": "http://cs.fiu.edu/~markaf",
  "status": "success",
  "content": "Mark A. Finlayson Last Updated August 23, 2025 Mark A. Finlayson I am a tenured Associate Professor of Computer Science in FIU's Knight Foundation School of Computing and Information Sciences (KFSCIS). Email: markaf@fiu.edu Phone: +1 (305) 348-7988 Fax: +1 (305) 348-3549 Mail: 11200 S.W. 8th Street CASE Building Room 362 Miami, FL 33199 Google Scholar In Memoriam: Patrick H. Winston (1943–2019): MIT News, Memorial, Two Reflections Research Interests I study the science of narrative, including understanding the relationship between narrative, cognition, and culture, developing new methods and techniques for investigating questions related to language and narrative, and endowing machines with the ability to understand and use narratives for a variety of applications. Key problems I have addressed so far include: extracting high-level narrative structure from sets of stories [O8,J4,W25]; techniques for discourse processing [C7,C8,W22]; temporal information extraction [C9]; general natural language processing [W4,W5,W9]; the creation, annotation, and manipulation of language resources [W1,W7]; and collecting richly annotated corpora of stories [C2,C3,J3]. My research intersects computational linguistics, artificial intelligence, cognitive science [C1,R1,A3], computational social science, and the digital humanities [J3,E7,E11]. Brief Bio I received my Ph.D. in Computer Science from MIT in 2012 under the supervision of Professor Patrick H. Winston. Following that, I was a Research Scientist in the MIT Computer Science and Artificial Intelligence Laboratory for 2½ years. I joined FIU as an Assistant Professor in 2014, and was tenured and promoted to Associate Professor in 2020. I received my M.S. in 2001 from MIT, and the B.S.E. in 1998 from the University of Michigan, both in Electrical Engineering. While at FIU my work has been funded by NSF, NIH, ONR, DARPA, DHS, DOT, MITRE, and IBM. Courses 2023 FallIDC 2002: AI for All IDC 5007: Concepts of Artificial Intelligence 2020 FallIDC 5007: Concepts of Artificial Intelligence 2019 FallCAP 5602: Graduate Introduction to Artificial Intelligence 2019 SpringCAP 5640/CAP 4641: Natural Language Processing 2018 FallCAP 5602: Graduate Introduction to Artificial Intelligence 2018 Spring CAP 5640/CAP 4641/LIN 5934: Natural Language Processing 2017 Fall COT 3100: Discrete Structures 2017 Spring CAP 5640/CAP 4641/LIN 5934: Natural Language Processing COT 3993: Discrete Structures 2016 Fall CAP 5602: Graduate Introduction to Artificial Intelligence 2016 Spring CAP 5993/CAP 4993: Natural Language Processing 2015 Fall CAP 5602: Graduate Introduction to Artificial Intelligence 2015 Spring CIS 6930: Advanced Special Topics: Natural Language Processing Notable Awards, Fellowships, & Appointments 2025 Spring Presidential Early Career Award for Scientists and Engineers (PECASE) 2021–2024 DARPA Young Faculty Award D21AP10117-01 2019–2024 Eminent Scholar Chaired (Assistant/Associate) Professor of Computer Science 2019–2024 Edison Fellow for AI, US Patent and Trademark Office 2021 Fall Excellence in Mentoring, Faculty Award, SCIS 2019 Fall Excellence in Fundamental Research, Faculty Award, SCIS 2019 Fall FIU Faculty Award for Excellence in Research and Creative Activities 2019 Spring IBM Faculty Award ($40,000) 2018 Fall Excellence in Teaching, Faculty Award, SCIS 2018–2023 NSF CAREER Award IIS-1749917 2018 Spring FIU Top Scholar for Teaching and Mentoring 2016 Fall Excellence in Service, Faculty Award, SCIS Administrative Appointments 2025–present Associate Director for Research & Academic Affairs, KFSCIS 2024–2025 Graduate Program Director, KFSCIS 2020–2022 Interim Associate Director, KFSCIS Selected Public Media [U5] Islam, A.A. & Finlayson, M.A. (2025) Weaponized storytelling: How AI is helping researchers sniff out disinformation campaigns. The Conversation: May 29, 2025. [U4] McMorris, E. (2025) Viewpoints Explained: Why Deepseek is Shaking Up Artificial Intelligence. Viewpoints Radio: February 12, 2025. [U3] McCarty Carino, M. & Alvarado, J. (2023) Top AI expert explains DeepSeek’s global impact. NPR Marketplace Tech: January 18, 2023. [U2] Parker, L., Greene, C., Acuña, D., Tomyama, K., & Finlayson, M.A. (2023) AI and the future of work: 5 experts on what ChatGPT, DALL-E and other AI tools mean for artists and knowledge workers. The Conversation: January 11, 2023. [U1] Delgado, J. (2015) The mystery of Owa Ehan building solved. FIU News: June 23, 2015. Graduated Students (Note: Only the first job after graduation is listed.) Doctoral Advisees [D9] Mustafa Ocal (September, 2022) Temporal Analysis of Narratives: Timelines, TimeML Evaluation, and Durations, Doctor of Philosophy in Computer Science. (google-scholar)   →   Assistant Teaching Professor, Knight Foundation School of Computing and Information Sciences, FIU, Miami, FL. [D8] Mireya Jurado (June, 2022) Applications of Quantitative Information Flow to Property-Revealing Encryption and Differential Privacy, Doctor of Philosophy in Computer Science. Co-advised with Prof. Geoffrey Smith.   →   Program Analyst, Presidential Management Fellow (PMF), Office of the Secretary of Defense, Cost Assessment and Program Evaluation (OSD CAPE), Washington, DC. [D7] Anurag Acharya (May, 2022) Integrating Cultural Knowledge into Artificially Intelligent Systems: Human Experiments and Computational Implementations, Doctor of Philosophy in Computer Science. (google-scholar)   →   Research Scientist, Pacific Northwest National Lab (PNNL), Richland, WA. [D6] Samira Zad (March, 2022) Detecting the Emotion of Animate Beings in Narrative, Doctor of Philosophy in Computer Science. (google-scholar)   →   Teaching Assistant Professor, Florida Atlantic University, Boca Raton, FL. [D5] Victor Yarlott (March, 2022) Communicating with Culture: How Humans and Machines Detect Narrative Elements, Doctor of Philosophy in Computer Science. [D4] Labiba Jahan (June, 2021) Inducing Stereotypical Character Roles from Plot Structure, Doctor of Philosophy in Computer Science. (google-scholar)   →   Assistant Professor of Computer Science, Augustana College, Rock Island, IL. [D3] Mohammad Aldawsari (October, 2020) Understanding Event Structure in Text, Doctor of Philosophy in Computer Science. (dissertation, google-scholar)   →   Assistant Professor of Computer Science, Prince Sattam Bin Abdulaziz University, Al-Kharj, Saudi Arabia [D2] Deya Banisakher (July, 2020) Automatic Learning of Document Section Structure for Ontology-Based Semantic Search, Doctor of Philosophy in Computer Science. Co-advised with Prof. Naphtali Rishe. (dissertation, google-scholar)   →   Postdoctoral Scholar, Defense Threat Reduction Agency, Fort Belvoir, VA. [D1] Joshua D. Eisenberg (November, 2018) Automatic Extraction of Narrative Structure from Long Form Text, Doctor of Philosophy in Computer Science. doi:10.25148/etd.FIDC006995 (website, google-scholar, linked-in)   →   Lead Scientist in NLU, Artie, Los Angeles, CA. Masters Advisees [M1] Andres Cremisini (December, 2019) New Insights into Cross-Document Event Coreference: Simplified Approaches, Computed Triggers, and Document Clustering (see W21), Masters of Science in Data Science. (web, linked-in)   →  Data Scientist, Catalist, LLC, Fargo, ND. All Citable Works By Type By Topic By Year If you're seeing this message, Javascript is turned off and the buttons above will not work. Main Conference Papers [C16] Islam, A.A. & Finlayson, M.A. (2024) A Semantic Interpreter for Social Media Handles. In Proceedings of the 18th International AAAI Conference on Web and Social Medica (ICWSM 2024), Buffalo, NY. 679–690. doi:10.1609/icwsm.v18i1.31343 (bib, web, code) [C15] Yarlott, W.V.H., Acharya, A., Castro Estrada, D., Gomez, D., & Finlayson, M.A. (2024) GOLEM: Gold standard for Learning and Evaluation of Motifs. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024), Turin, Italy. 7801–7813. (bib, web, code) [C14] Ocal, M., Radas, A., Hummer, J., Megerdoomian, K. & Finlayson, M.A. (2022) A Comprehensive Evaluation and Correction of the TimeBank Corpus. In Proceedings of the 13th Language Resources and Evaluation Conference (LREC 2022), Marseille, France. 2919–2927. (bib, web, code) [C13] Ocal, M., Perez, A., Radas, A., & Finlayson, M.A. (2022) Holistic Evaluation of Automatic TimeML Annotators. In Proceedings of the 13th Language Resources and Evaluation Conference (LREC 2022), Marseille, France. 1444–1453. (bib, web, code) [C12] Jahan, L., Mittal, R., & Finlayson, M.A. (2021) Inducing Stereotypical Character Roles from Plot Structure. In Proceedings of the 25th Conference on Empirical Methods in Natural Language Process (EMNLP 2021), Punta Cana, Dominican Republic (Online). 492–497. doi:10.18653/v1/2021.emnlp-main.39 (bib, web, code) [C11] Jahan, L., Mittal, R., Yarlott, W.V.H. & Finlayson, M.A. (2020) A Straightforward Approach to Narratologically Grounded Character Identification. In Proceedings of the 28th International Conference on Computational Linguistics (COLING 2020), Barcelona, Spain (Online). 6089–6100. doi:10.18653/v1/2020.coling-main.536 (bib, web, code) [C10] Aldawsari, M., Perez, A., Banisakher, D. & Finlayson, M.A. (2020) Distinguishing Between Foreground and Background Events in News. In Proceedings of the 28th International Conference on Computational Linguistics (COLING 2020), Barcelona, Spain (Online). 5171–5180. doi:10.18653/v1/2020.coling-main.453 (bib, web, code) [C9] Ocal, M. & Finlayson, M.A. (2020) Evaluating Information Loss in Temporal Dependency Trees. In Proceedings of the 12th Language Resources and Evaluation Conference (LREC 2020), Marseille, France. 2148–2156. (bib, web, code) [C8] Aldawsari, M. & Finlayson, M.A. (2019) Detecting Event Hierarchies using Discourse and Narrative Features. In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics (ACL 2019), Florence, Italy. 4780–4790. doi:10.18653/v1/P",
  "content_length": 40928,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:15"
}