{
  "name": "Mark Roman Miller",
  "homepage": "https://www.iit.edu/directory/people/mark-miller",
  "status": "success",
  "content": "Mark Roman Miller | Illinois Institute of Technology Skip to main site navigation Skip to main content Mark Roman Miller Assistant Professor of Computer Science Tags: Faculty Computer Science Home Office and Department Directory Directory Mark Roman Miller Mark Roman Miller is an Assistant Professor at the Illinois Institute of Technology specializing in virtual and augmented reality through the lenses of communication, security, and data science. He studies the evolving communication landscape within augmented reality, addressing both its potential and challenges. Additionally, Mark investigates the vast data generated by virtual and augmented reality devices, uncovering scientific insights into emotions and nonverbal communication while recognizing the privacy risks associated with this data.Research InterestsVirtual and Augmented RealityHuman-Computer InteractionCybersecurity Contact Information mmiller30@illinoistech.edu Website SB 209C Media Appearances February 21, 2024 Assistant Mark Roman Miller Reveals What Apple's New Vision Pro Headset Might Do to Our Brain Scientific American Mark Roman Miller, an assistant professor at Illinois Institute of Technology, sees augmented reality devices as extraordinary tools, but he warns that they also carry enormous potential for counterproductive distraction. He says he “treats his smartphone like his shoes” by leaving it at the door when he comes home. Augmented and mixed-reality devices could further exacerbate the problem of divided attention that many smartphone users already encounter, he says. Learn more... Illinois Tech welcomes you to join our community of people who discover, create, and solve. Apply today, visit us in Chicago, and contact us for more information. Request Info Visit Apply",
  "content_length": 1773,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:37"
}