{
  "name": "Mark Walkley",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/189/dr-mark-walkley",
  "status": "success",
  "content": "Dr Mark Walkley | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Dr Mark Walkley Position: Lecturer Areas of expertise: computational modelling; finite element methods; time integration; mesh generation; parallel computing Email: M.A.Walkley@leeds.ac.uk Phone: +44(0)113 343 5684 Location: 3.40a Sir William Henry Bragg Building Profile I began by studying for a BSc Engineering Mathematics in the Civil Engineering Department at Univeristy of Swansea. This was followed by an MSc in Computational Fluid Dynamics at Imperial College. I studied for a PhD in the School of Computing at University of Leeds. My thesis was on computational modelling of nonlinear, dispersive water waves in near-shore regions. Since then I have worked at Leeds on a range of applications of the finite element method to challenges in computational science and engineering. Responsibilities MSc Advanced Computer Science Programme Lead MSc Advanced Computer Science (Data Analytics) Programme Lead Research interests Mark is a member of the Computational Science and Engineering research theme. Qualifications BSc Engineering Mathematics MSc Computational Fluid Dynamics PhD Computer Science Student education I have taught at every year of study on our taught programmes. My areas of teaching range from introductory programming to computer networks and parallel computing. Related to my research interests I have taught introductory and advanced scientific computing topics including adaptive and parallel algorithms. I have supervised projects in a wide range of topics in computer science, from client-focused software engineering projects delivering products to theoretical studies of parallel performance and accuracy of scientific simulations. Research groups and institutes Computational Science and Engineering Current postgraduate researchers Evangelia Antonopoulou Gregory Walton <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Back to top",
  "content_length": 2420,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:44"
}