{
  "name": "Mark Campbell 0001",
  "homepage": "https://campbell.mae.cornell.edu/mark-campbell",
  "status": "success",
  "content": "Mark Campbell – Campbell Research Group Skip to content Mark Campbell Professor Campbell is interested in control and autonomy for systems such as robotics, aircraft and spacecraft. Research areas include autonomous robotics, human decision modeling, sensor fusion, nonlinear and hybrid estimation theory, integrated estimation and control, formation flying satellites, and structural dynamics and control. Educational areas focus on control systems, estimation, space systems and control, with an emphasis on experiential learning projects. Mark Campbell joined the Sibley School faculty at Cornell in 2001, and is currently a full Professor serving as S.C. Thomas Sze Director of the Sibley School. He was an Assistant Professor at the University of Washington from 1997-2001. A graduate of Carnegie Mellon University (B.S.) and MIT(M.S., Ph.D.), Professor Campbell worked on MACE, a dynamics and control laboratory flown on Space Shuttle Endeavour in 1995. For the mission, his responsibilities involved the design of many of the 500 multivariable control experiments implemented on-orbit. Professor Campbell spent his 2005-06 sabbatical year as a Visiting Scientist at the Insitu group, maker of small autonomous UAV’s for commercial and defense applications, and as an Australian Research Council (ARC) International Fellow, working at the ARC Centre of Excellence for Autonomous Systems in Sydney Australia.  In 2019-20, he spent his sabbatical as a Distinguished Visiting Scientist at Draper Labs. Professor Campbell was selected to participate in the Defense Science Study group, which led to his appointment on the Air Force Science Advisory Board (SAB), for which he received the U.S. Air Force Chief of Staff Award for Exceptional Public Service. Professor Campbell has been the recipient of several teaching awards including Cornell’s College of Engineering Stephen Miles ’57 Award (2004) and the Douglas Whitney Award (2010), the American Society of Engineering Education Teaching Award (2007), and the University of Washington Aeronautics and Astronautics Professor of the Year award (1999). Professor Campbell has delivered several keynote addresses at conferences, and received best paper awards from the AIAA (2004) and Frontier’s in Education conference (1999); he also received the Bennet Prize and is an Andrew Carnegie Scholar. He is a Fellow of the AIAA, IEEE and ASME. Mark Campbell CV (abbreviated) Education BS (Mechanical Engineering), Carnegie-Mellon University, 1990MS (Aeronautics and Astronautics), Massachusetts Institute of Technology, 1993PhD (Control and Estimation), Massachusetts Institute of Technology, 1996",
  "content_length": 2645,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:18"
}