{
  "name": "Mark Hancock",
  "homepage": "https://markhancock.ca",
  "status": "success",
  "content": "Mark Hancock : Home Page Mark Hancock Home Page Home Page Courses MSCI 343 MSCI 720-T27 (S&P Games) MSCI 720-T37 (GUR) MSCI 630/730 Publications About Me Contact Info I am Chair and Professor in the Department of Management Science and Engineering in the Faculty of Engineering, where I direct the Touchlab, and the Associate Director of the Games Institute at the University of Waterloo. I am also cross-appointed in the Department of Systems Design Engineering and the Cheriton School of Computer Science. I graduated with a Ph.D. from the University of Calgary in the department of Computer Science. I completed my Ph.D. under the supervision of Dr. Sheelagh Carpendale and was a member of InnoVis in the Interactions Lab. Research Goals My research goal is to design, develop and evaluate technology that can support new ways of interacting with computers and information. A central part of this goal is my interest in providing the ability for richer and faster interaction through the use of one~Rs body, hands, and fingers. The demand for effective interaction is increasing in response to the recent surge in commercial and research hardware that supports the sensing of more and more information about human movement in and around the surfaces ubiquitous in our everyday environment. While this technology has made it possible to interact in interesting and new ways, and even to carry this technology with us everywhere that we go, we have only begun to scratch the surface of what is possible and tend to rely on simple interaction, such as buttons and menus to interact with these new devices. My primary motivation is to harness some of the richness of interaction that is possible with our hands and bodies in how we interact with computers. In my research, I consider the fundamental nature of human movement and perception to help inform the design of interaction for new media. Research Interests Human-computer interaction, collaboration, computer-supported cooperative work, tabletop displays, large-screen displays, smartphones, multi-touch interaction, 3D interaction, direct vs. indirect pen-input, narrative, games. © Mark Hancock, 2007 - 2025 Colophon",
  "content_length": 2175,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:27"
}