{
  "name": "Markus Hadwiger",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/markus-hadwiger",
  "status": "success",
  "content": "Markus Hadwiger - Professor, Computer Science - King Abdullah University of Science and Technology Top Home Study Faculty Markus Hadwiger Professor, Computer Science Computer, Electrical and Mathematical Science and Engineering Division markus.hadwiger@kaust.edu.sa Program Affiliations Computer Science Biography A founding member of KAUST, Hadwiger has published numerous scientific papers and books, including \"Real-Time Volume Graphics.\" He has been an Assistant Professor of Computer Science from 2009 to 2014, an Associate Professor of Computer Science from 2014 to 2021, and a Full Professor of Computer Science since 2021. Research Interests Professor Markus Hadwiger’s research interests are in scientific visualization and visual computing.Hadwiger’s investigations span a wide range of topics, including the visualization of extreme-scale data, volume visualization, flow visualization, differential geometry and mathematical physics in visualization, medical visualization, large-scale image and volume processing, multi-resolution and out-of-core techniques, domain-specific languages for visualization, interactive segmentation and feature identification and GPU algorithms and architecture. visualization visual computing Education Profile Ph.D. Computer Science, Vienna University of Technology, Austria, 2004Dipl.-Ing., Computer Science, Vienna University of Technology, Austria, 2000 Awards and Recognitions Honorable Mention for Best Paper Award (top four papers), IEEE Information Visualization, 2014Best Poster Award, Symposium on Biological Data Visualization (BioVis 2014), 2014Honorable Mention for Best Paper Award (top five papers), IEEE Pacific Visualization 2013, 2013Honorable Mention for Best Paper Award (top three papers), IEEE Scientific Visualization 2012, 2012Best Application Paper Award, IEEE Visualization 2007, 2007 Show more Publications W. Jeong, J. Beyer, M. Hadwiger, R. Blue, C. Law, A. Vasquez, C. Reid, J. Lichtman, H. Pfister. \"SSECRETT and NeuroTrace: Interactive visualization and analysis tools for large-scale neuroscience datasets\". IEEE Computer Graphics and Applications, 2010.W. Jeong, J. Beyer, M. Hadwiger, A. Vasquez, H. Pfister, R. Whitaker. \"Scalable and interactive segmentation and visualization of neural processes in EM datasets\". IEEE Transactions on Visualization and Computer Graphics, 2009.J. Klein, O. Friman, M. Hadwiger, B. Preim, F. Ritter, A. Vilanova, G. Zachmann, D. Bartz. \"Visual computing for medical diagnosis and treatment\". Computers & Graphics, Vol.33, No.4; pp. 554-565, 2009.L. Fritz, M. Hadwiger, G. Geier, G. Pittino, E. Gröller. \"A visual approach to efficient analysis and quantification of ductile iron and reinforced sprayed concrete\". IEEE Transactions on Visualization and Computer Graphics, 2009.S. Lindholm, P. Ljung, M. Hadwiger, A. Ynnerman. \"Fused multi-volume DVR using binary space partitioning\". Computer Graphics Forum, 2009. Show more Research Areas Computer Science Visual Computing Multimedia - ORCID - KAUST Repository - KAUST Academic Portal - Scopus",
  "content_length": 3056,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:55"
}