{
  "name": "Mark McGill",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/markmcgill",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Mark McGill Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Mark McGillMr Ethan KellyZhen Tian Dr Mark McGill Senior Lecturer (School of Computing Science) email: Mark.McGill@glasgow.ac.uk SAWB 407, School of Computing Science, Sir Alwyn Williams Building Import to contacts Biography I'm a Lecturer in Extended Reality (XR) and Human Computer Interaction (HCI) in the School of Computing Science, and part of the Multimodal Interaction Group within the GIST research section. Research interests My research spans work at the intersection of XR, HCI, and the anticipated future of spatial computing, including: Future XR-enabled passenger experiences, as a founding part of ERC ViAjeRo project ( https://viajero-project.org/ ), examining key problems around motion sickness, interaction in constrained spaces, social acceptability, telepresence/communication, reality awareness and more. Future productivity experiences, and the benefits to mobility and ergonomics posed by XR The societal opportunities and challenges posed by mass adoption of XR (and in particular everyday Augmented Reality as pursued by every major tech company) around privacy, freedom of expression and more. My work has involved both industry partners (Logitech, Bang & Olufsen, Meta) and a number of EPSRC/UKRI projects (e.g. funded by REPHRAIN, EPSRC IAA, SPRITE+ and others). I'm always on the look out for promising students with intersectional interests in XR, so do drop me an email if you want to collaborate or be supervised here! Fore more details on talks, funding, publications etc. see www.markmcgill.co.uk and http://mig.dcs.gla.ac.uk Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014Number of items: 85.2025 Pohlmann, Katharina M.T., Wilson, Graham, Bajorunaite, Laura ORCID: https://orcid.org/0000-0002-8572-2955, McGill, Mark and O'Hagan, Joseph (2025) \"Everyone Knows You’re Watching P*rn\": Reflecting on First-hand User Accounts on the Use and Public Perception of In-Transit Passenger XR. In: 24th IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2025), Daejeon, South Korea, 8-12 Oct 2025, (Accepted for Publication) Wilson, Graham, Russell, Harvey, O'Hagan, Joseph and McGill, Mark (2025) Big Frog Vibes: Jumping Superhuman Distances Forward, Vertically and Sideways in VR Using Comfortably High Translational Gain. In: IEEE ISMAR 2025, Daejeon, South Korea, 08-12 Oct 2025, (Accepted for Publication) Macdonald, Shaun ORCID: https://orcid.org/0000-0001-6519-318X, ElSayed, Salma and McGill, Mark (2025) AZRA: Extending the Affective Capabilities of Zoomorphic Robots using Augmented Reality. In: Companion of the 2025 IEEE International Conference on Human-Robot Interaction (RO-MAN 2025), Eindhoven, The Netherlands, 25-29 August 2025, (Accepted for Publication) Fiani, Cristina, Bretin, Robin ORCID: https://orcid.org/0000-0003-2918-1901, McGill, Mark and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2025) “Abracadabra, Block the Bullies!”: Child Perceptions of Manual, Semi-Automated and Automated Interventions against Group Harassment in Social VR. In: 24th annual ACM Interaction Design and Children Conference (IDC 2025), Reykjavík, Iceland, 23-26 Jun 2025, pp. 314-339. ISBN 9798400714733 (doi: 10.1145/3713043.3728850) Li, Gang ORCID: https://orcid.org/0000-0002-5251-7445, McGill, Mark, Grant, Alana, Pohlmann, Katharina, Holden, Rory, Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 and Pollick, Frank ORCID: https://orcid.org/0000-0002-7212-4622 (2025) Reduced motion sickness using vestibular EEG-guided tACS under mismatched physical rotation and VR visual motion. IEEE Transactions on Intelligent Transportation Systems, (doi: 10.1109/tits.2025.3578521) (Early Online Publication) Christie, Iain ORCID: https://orcid.org/0009-0008-5487-9176, Wilson, Graham, McGill, Mark and Brewster, Stephen Anthony ORCID: https://orcid.org/0000-0001-9720-3899 (2025) Winter is Coming... To Your Commute: Adapting Passenger ARTV Ornamentations to Match On-screen Visuals For Enhanced Immersion in Fantasy Drama TV Content. In: ACM International Conference on Interactive Media Experiences (IMX '25), Niterói, Brazil, 03-06 June 2025, pp. 275-293. ISBN 9798400713910 (doi: 10.1145/3706370.3727854) Krauß, Veronika, McGill, Mark, Kosch, Thomas, Thiel, Yolanda, Schön, Dominik and Gugenheimer, Jan (2025) “Create a Fear of Missing Out” — ChatGPT Implements Unsolicited Deceptive Designs in Generated Websites Without Warning. In: ACM CHI 2025, Yokohama, Japan, 26 April - 1 May 2025, ISBN 9798400713941 (doi: 10.1145/3706598.3713083) O'Hagan, Joseph, Medeiros, Daniel, Wilson, Graham, McDermid, Robert and McGill, Mark (2025) Improving Ergonomic Viewing of Spatial XR Workspaces Through 2D Rotational Assistance. In: 2025 Conference on Human Factors in Computing Systems, Yokohama, Japan, 26 Apr - 01 May 2025, ISBN 9798400713958 (doi: 10.1145/3706599.3719920) Waugh, Kieran ORCID: https://orcid.org/0000-0002-3748-4905, McGill, Mark and Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 (2025) Everything to Gain: Combining Area Cursors with Increased Control-Display Gain for Fast and Accurate Touchless Input. In: ACM CHI conference on Human Factors in Computing Systems (CHI 2025), Yokohama, Japan, 26 Apr - 01 May 2025, p. 726. ISBN 9798400713941 (doi: 10.1145/3706598.3714021) Wilson, Graham, McCready, Jamie, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Mathis, Florian, Russell, Harvey and McGill, Mark (2025) InterFACE: Establishing a Facial Action Unit Input Vocabulary for Hands-Free Extended Reality Interactions, From VR Gaming to AR Web Browsing. In: ACM CHI 2025, Yokohama, Japan, 26 April - 1 May 2025, p. 607. ISBN 9798400713941 (doi: 10.1145/3706598.3713694) Wilson, Graham, Pöhlmann, Katharina Margareta Teresa, Al Baiaty Suarez, David, McGill, Mark and Brewster, Stephen Anthony ORCID: https://orcid.org/0000-0001-9720-3899 (2025) The Spin Doctor: Leveraging Insensitivity to Passive Rotational & Translational Gain For Unbounded Motion-Based VR Experiences. In: 2025 Conference on Human Factors in Computing Systems, Yokohama, Japan, 26 Apr - 01 May 2025, p. 811. ISBN 9798400713941 (doi: 10.1145/3706598.3713455) Weerasinghe, Maheshya, Macdonald, Shaun ORCID: https://orcid.org/0000-0001-6519-318X, Fiani, Cristina, O'Hagan, Joseph, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, McGill, Mark and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2025) Beyond mute and block: adoption and effectiveness of safety tools in social VR, from ubiquitous harassment to social sculpting. IEEE Transactions on Visualization and Computer Graphics, 31(5), pp. 3275-3284. (doi: 10.1109/TVCG.2025.3549860) (PMID:40067706) 2024 Li, G. et al. (2024) Detecting in-car VR Motion Sickness from Lower Face Action Units. In: 2024 IEEE International Symposium on Mixed and Augmented Reality (ISMAR), Seattle, WA, USA, 21-25 October 2024, pp. 1019-1028. ISBN 9798331516475 (doi: 10.1109/ISMAR62088.2024.00118) Bustoni, Isna Alfi, McGill, Mark and Brewster, Stephen Anthony ORCID: https://orcid.org/0000-0001-9720-3899 (2024) Exploring the Alteration and Masking of Everyday Noise Sounds using Auditory Augmented Reality. In: ICMI '24: 26th International Conference on Multimodal Interaction, San Jose, Costa Rica, 04-08 Nov 2024, pp. 154-163. ISBN 9798400704628 (doi: 10.1145/3678957.3685750) Pöhlmann, Katharina M. T., Li, Gang ORCID: https://orcid.org/0000-0002-5251-7445, Wilson, Graham, McGill, Mark, Pollick, Frank ORCID: https://orcid.org/0000-0002-7212-4622 and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2024) Is video gaming a cure for cybersickness? Gamers experience less cybersickness than non-gamers in a VR self-motion task. IEEE Transactions on Visualization and Computer Graphics, 30(11), pp. 7225-7233. (doi: 10.1109/tvcg.2024.3456176) Abraham, Melvin, Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 and McGill, Mark (2024) Don’t Record My Private pARts: Understanding The Role of Sensitive Contexts and Privacy Perceptions in Influencing Attitudes Towards Everyday Augmented Reality Sensor Usage. In: 23rd IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2024), Greater Seattle Area, USA, 21-25 Oct 2024, pp. 749-758. ISBN 9798331516475 (doi: 10.1109/ISMAR62088.2024.00090) Ruocco, Martina, Saeghe, Pejman, Kerber, Frederic, Gugenheimer, Jan, McGill, Mark and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2024) From Redirected Navigation to Forced Attention: Uncovering Manipulative and Deceptive Designs in Augmented Reality through Retail Shopping. In: IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2024), Greater Seattle Area, USA, 21-25 Oct 2024, pp. 720-729. ISBN 9798331516475 (doi: 10.1109/ISMAR62088.2024.00087) Medeiros, Daniel, Wilson, Graham, Sousa, Mauricio, Pantidi, Nadia, McGill, Mark, Drago, Diego and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2024) Exploring User Placement for VR Remote Collaboration in a Constrained Passenger Space. In: VRST '24: 30th ACM Symposium on Virtual Reality Software and Technology, ",
  "content_length": 74113,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:35"
}