{
  "name": "Markus Nebel",
  "homepage": "https://ekvv.uni-bielefeld.de/pers_publ/publ/PersonDetail.jsp?personId=71594916&lang=en",
  "status": "success",
  "content": "Markus Nebel - PEVZ - Bielefeld University Skip to Main Content Universität Bielefeld Play rectangle-plus PEVZ Staff and Department Search Other Links Home Page Tasks My personal data Integrate Department Meine Uni app History Nebel, Markus, Prof. Dr. BIS Links Help & Contact To the BIS Homepage Staff and Department Search Other Links Home Page Tasks My personal data Integrate Department Meine Uni app History Nebel, Markus, Prof. Dr. BIS Links Help & Contact To the BIS Homepage Staff and Department Search Prof. Dr. Markus Nebel Contact 1. Faculty of Technology / Arbeitsgruppen / Algorithmics and Bioinformatics E-Mail nebel@tf.unibi.de Phone +49 521 106-2913 Office CITEC 0-107 − Locations Map Add to address-book 2. Faculty of Technology / Promotionen / Koordination Promotion Koordination freie Promotion E-Mail markus.nebel@uni-bielefeld.de Add to address-book 3. Faculty of Technology / Kommissionen und Ausschüsse / Habilitationsausschuss Mitglied E-Mail markus.nebel@uni-bielefeld.de Add to address-book 4. Research Center for Mathematical Modelling (RCM) / Members E-Mail nebel@tf.unibi.de Phone +49 521 106-2913 Office CITEC 0-107 − Locations Map Add to address-book 5. Faculty of Technology / Kommissionen und Ausschüsse / Prüfungsausschüsse / Informatik (Bachelor) MitgliedGruppe der Hochschullehrer*innen E-Mail markus.nebel@uni-bielefeld.de Add to address-book 6. Faculty of Technology / Kommissionen und Ausschüsse / Prüfungsausschüsse / Naturwissenschaftliche Informatik (Master) Vorsitz E-Mail markus.nebel@uni-bielefeld.de Phone +49 521 106-2913 Add to address-book 7. Faculty of Technology / Kommissionen und Ausschüsse / Lenkungsausschuss Promotionsstudiengang Bioinformatik MitgliedGruppe der Hochschullehrer*innen E-Mail markus.nebel@uni-bielefeld.de Add to address-book Module Designee for 39-Inf-1 Algorithms & Datastructures 39-Inf-AD Introduction to Algorithms and Data Structures 39-Inf-PP Principles of Programming 39-Inf-WP-AP Algorithms & Programming (Basis) 39-Inf-WP-AP-x Algorithms & Programming (Focus) 39-Inf-WP-NWS Networks & Security (Basis) 39-Inf-WP-NWS-x Networks & Security (Focus) 39-M-Inf-TA Theory and Algorithms (Basis) 39-M-Inf-TA-x Theory and Algorithms (Focus) Sidebar Research My research profile Publications Teaching Courses Course Schedule Module Designee Error found? Contacts for correction requests My PEVZ Set up call forwarding Enter Curriculum Vitae Add photo Enter current research topics, memberships and functions My Electronic Mailing Lists Business cards and doorplates Quick Links Linking / Integration Send page to mobile Scan QR code: Top of page",
  "content_length": 2617,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:57"
}