{
  "name": "Mark Rouncefield",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/mark-rouncefield",
  "status": "success",
  "content": "Mark Rouncefield - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Mark Rouncefield Emeritus Reader Profile Career details Mark Rouncefield is a Reader in Social Informatics in the School of Computing and Communications, Lancaster University and recent Microsoft European Research Fellow. His qualifications include: BA (Soc St) (Exeter), MA (Ed) (Durham), MA (Soc) (Lancaster), Ph.D. (Soc) (Lancaster), PGCE, PGCIT, RSA, Salsa Level 1 (with merit) (Daniel James School of Dance). You can probably guess which qualification he is most proud of.. Mark's research covers various different aspects of the empirical study of work, organisation, human factors and interactive computer systems design. This work is strongly inter-disciplinary in nature and has led to extensive and continuing collaborations with colleagues in Sociology, Computing, Informatics and Management departments both in the UK and abroad. His empirical studies of work and technology have contributed to critical debates concerning the relationship between social and technical aspects of IT systems design and use. He is particularly associated with the development of ethnography as a method for informing design and evaluation. Mark has jointly written or edited six books and over 100 journal and conference papers. He has been a panelist at CSCW and ECSCW conferences and has organised workshops on Dependability in Healthcare Informatics; Ubiquitous Computing in Domestic Environments; Open Source Software Development; Inter-disciplinary Approaches to the Design of Dependable Computer Systems and Social Interaction and Mundane Technology. He has served on the programme committee of Chi, OzCHI, CSCW and ECSCW and on the editorial board of the International Journal of Organisational Transformation and Social Change (OTSC), Sociological Research Online and the Health Informatics Journal. Five significant publications 1. Randall, D., Harper, R. and Rouncefield, M., 2007. Fieldwork for design: theory and practice. Springer Science & Business Media. - now a standard textbook on ethnographic approaches to design – cited 311 times. – review – “\"As an HCI researcher and practitioner, I am delighted to see, at last, a balanced view about the practice of ethnography within our field. This book presents an informative balance between the theory and practice of fieldwork methods, allowing researchers to conduct trials with confidence and understand the scope of the results that can be gained from these trials. At last, some of the most pre-eminent people in their field show computer scientists and HCI researchers that it is valid to use ethnographic techniques without doing \"proper\" Sociology and Anthropology.\" Professor Gary Marsden, professor of HCI, University of Cape Town, South Africa 2. Hartswood, M., Procter, R., Rouncefield, M. and Slack, R., 2003. Making a case in medical work: implications for the electronic medical record. Computer Supported Cooperative Work (CSCW), 12(3), pp.241-266. – cited 238 times - the beginning of several papers on electronic patient records and the reform of the NHS – pointing to important human and organizational issues highlighted by the DIRC project that formed the basis for a letter from the DIRC project concerning the likely failure of the NpFIT programme. 3. Crabtree, A., Hemmings, T., Rodden, T., Cheverst, K., Clarke, K., Dewsbury, G., Hughes, J. and Rouncefield, M., 2003, November. Designing with care: Adapting cultural probes to inform design in sensitive settings. In Proceedings of the 2004 Australasian Conference on Computer-Human Interaction (OZCHI2004)(pp. 4-13).- documents our use of the relatively novel technique 'cultural probes' and won the best paper award 4. Dewsbury, G., Clarke, K., Randall, D., Rouncefield, M. and Sommerville, I., 2004. The anti‐social model of disability. Disability & Society, 19(2), pp.145-158. – critiqued the standard model for understanding disability and highlighted its failure in terms of design interests – became quoted in government policy on telecare and assistive technology. A reviewer wrote; “Dewsbury et al. offer a powerful reminder that there are alternative and grounded routes into disability praxis that can deliver real positive benefits for disabled people. Importantly, they also critique the dangers of sociological hyperbole and the rabbit hole of theory .. Dewsbury et al., manifest an engineering perspective, seeking routes into design, and testing disability theory at the same time, proffering significant food for thought for all in the process. 5. Rouncefield, M. and Tolmie, P., 2011. Ethnomethodology at work. Ashgate Publishing Ltd. – very well reviewed this book introduces designers to important social and organizational features of the working environments they are designing. – review: “'Pugnacious yet inviting, this book will be an invaluable guide for those interested in the ethnomethodological perspective on work, but also why it has proven to be so influential in the study and design of technology. The book expertly balances empirical study with theoretical sophistication.' Barry Brown, University of California, San Diego, USA Show more… Research Overview Mark's research covers various different aspects of the empirical study of work, organisation, human factors and interactive computer systems design. This work is strongly inter-disciplinary in nature. His empirical studies of work and technology have contributed to critical debates concerning the relationship between social and technical aspects of IT systems design and use. Topics of interest include: Computer Supported Cooperative Work; Computer Human Interaction; Qualitative User studies; technology in workplace and domestic settings; ethnographic methods in design and evaluation; social media use; healthcare and technology; ‘smartworking’ and the Internet of Things; empirical evaluations of model driven engineering; Trust and Technology; Human and Organisational Factors in Resilience; empirical evaluations of model driven engineering; AI and work; Current Teaching SCC 140 Creative Technology SCC 205 Social, Ethical and Professional Issues in Computing SCC 300 Final Year Project - 'Inside the Virtual Museum' SCC 360 Computer Science Seminars Career Details 1994 - 1997 Research Associate SYCOMT Project, Lancaster University. P/TLecturer - BA. Health Studies Degree: Community & Youth Studies and Applied Community Studies St. Martins College Lancaster 1997 - 2000Research Fellow, Evolving Centralised Legacy Systems to Intranet-based Architectures Project, Lancaster University. P/T Lecturer St. Martin’s College, Lancaster - Community & Youth Studies and Applied Community Studies degrees Visiting lecturer Viktoria Institute, University of Gothenburg 2000 - 2002 Research Fellow - Dependability Inter-Disciplinary Research Collaboration. Also involved in the Digital Care project in the Equator IRC Researcher on the HTA Mammography project with Edinburgh University Consultant Researcher for the Digital World Research Centre, Surrey University Visiting lecturer, University of Karlskrona/Ronneby, Sweden. 2002 - 2013 Senior Research Fellow 2006-2008Microsoft European Research Fellow 2013 Senior Lecturer, School of Computing and Communications 2016 Reader in Social Informatics, School of Computing and Communications Research Grants Funded research projects as principal investigator at Lancaster. Funder Project name % of your time Start date End date Total valueof grant Total value[1]of grant to SCC ESRC Sustainable Carbon Calculators 10% 2012 2012 £39,414 £39,414 Microsoft Research Touchless Interaction in Medical Settings 10% 2011 2013 $250,000 $250,000 EPSRC Mapping the Digital Economy 5% 2012 2013 £24,612 £24,612 EPSRC Ethical issues of research in a \"living lab\" 5% 2012 2012 £5,000 £5,000 Microsoft Research Social Interaction and Mundane Technologies 50% 2006 2008 £249,000 £249,000 Xerox Research Europe Technologies of Leadership 10% 2006 2008 £60,000 £60,000 EPSRC Ethnography and software testing 10% 2005 2008 £233,416 £233,416 CEL/DfES 'Explicating Leadership Skills and Learning Cultures 105 2005 2008 £277,000 £277,000 Funded research projects as co-investigator at Lancaster Funder Project name PI % of your time Start date End date Total value1 of grant Total value22 above of grant to SCC EPSRC Low Carbon Food Shopping Adrian Friday 10% 01/07/2013 30/04/2015 £214,455 £214,455 EU EINS David Hutchinson 5% 01/12/2011 31/05/2015 £101,868 EU H2020: MPAT Nick Race 4% 01/12/2015 30/11/2017 £222,480 EU FI-CONTENT 2 Nick Race 12% 01/04/2013 31/03/2015 £486,310 EU HyRIM David Hutchinson 5% 2013 2017 €3,387,085 €512,221 EPSRC EDDI - Informing Energy choices using Ubiquitous Sensing Adrian Friday 10% 2011 2013 £371,245 £371,245 EPSRC Tales of Engagement: The Wray broadband Project Nick Race 10% 2012 2013 £9500 £9500 Nokia Mobile Phones as Props, Probes and Prototypes for Life Change Connor Graham 10% 2008 2008 £10000 £10000 Microsoft Research Developing a tablet-based games platform for elders: a socio-technical approach Ian Sommerville 10% 2007 2007 £54,350 £54,350 EPSRC CASIDE - Investigating Cooperative Applications in SItuated Display Environments Keith Cheverst 10% 2005 2008 £360,510 Professional Role Academic Leadership and Engagement I have carried out a broad range of day-to-day administrative and citizenship activities in the School. My current academic and leadership roles include that of Academic Officer (Plagiarism) for the Department as well as representing the School on the Faculty Research Ethics Committee. In the past I have also acted as Convenor for taught modules including SCC202 HCI, SCC412 Advanced HCI, EBIN 526 /SCC445 System Dependability. Service activities for",
  "content_length": 13430,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:37"
}