{
  "name": "Markus Dürmuth",
  "homepage": "https://www.itsec.uni-hannover.de/de/usec/team/duermuth",
  "status": "success",
  "content": "Prof. Dr. Markus Dürmuth – Institut für IT-Sicherheit – Leibniz Universität Hannover Markus Dürmuth – Institut für IT-Sicherheit – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik Start Kontakt Institut für IT-Sicherheit Fachgebiet Usable Security and Privacy Team Markus Dürmuth Prof. Dr. Markus Dürmuth © Julian Martitz Prof. Dr. Markus Dürmuth Telefon +49 511 762 16411 E-Mail markus.duermuthitsec.uni-hannover.de Adresse Lange Laube 6 30159 Hannover Gebäude 1926 Raum A102 Sprechzeiten Mi. 10:00 - 11:00 Uhr nur in der VorlesungszeitAnmeldung per E-Mail © Julian Martitz Prof. Dr. Markus Dürmuth Telefon +49 511 762 16411 E-Mail markus.duermuthitsec.uni-hannover.de Adresse Lange Laube 6 30159 Hannover Gebäude 1926 Raum A102 Sprechzeiten Mi. 10:00 - 11:00 Uhr nur in der VorlesungszeitAnmeldung per E-Mail Funktionen Vertretung der Professorinnen und Professoren Fakultätsrat der Fakultät für Elektrotechnik und Informatik Vertretung der Professorinnen und Professoren Prüfungsausschuss Informatik Professorinnen und Professoren Sprechzeiten Mi. 10:00 - 11:00 Uhr nur in der VorlesungszeitAnmeldung per E-Mail Fachgebiet Usable Security and Privacy Schwerpunkte in Forschung und Lehre IT-Sicherheit, insbesondere Usable Security und Privacy Mensch-zentrierte IT-Sicherheit User authentication Lebenslauf Beruflicher Werdegang seit 2022Leibniz University Hannover, Professur Usable Security und Privacy 2017 - 2022 Ruhr University Bochum, Professur Mobile Security 2014 - 2017 Ruhr University Bochum, Juniorprofessur Mobile Security 2011 - 2014 Ruhr University Bochum, Post-Doctoral Researcher 2010Stanford University, Post-Doctoral Researcher 2005 - 2010Saarland University, PhD Student 2005McKinsey & Company, Business Technology Office, Associate Intern 2004IBM Research Lab, Research Student 2003 IBM Research Lab, Research Student Mitgliedschaften und Ämter Recent reviewing activitiesPrivacy Enhancing Technologies Symposium (PETS) 2021, 2022, 2023 IEEE Symposium on Security and Privacy 2021, 2022 European Conference for Cognitive Science 2019 European Workshop on Usable Security 2017, 2018Adventures in Authentication: WAY Workshop 2016, 2017New Security Paradigms Workshop 2015, 2016Regularly reviewing for journals (JCSS, COSE, TIFS,...)Regularly reviewing for funding agencies (Bundesministerium für Gesundheit, Werner-Siemens-Stiftung, Israel Science Foundation, Bundesministerium für Bildung und Forschung,...) Publikationen 2025 Balancing Privacy and Data Utilization: A Comparative Vignette Study on User Acceptance of Data Trustees in Germany and the US. / Lassak, Leona; Püschel, Hanna; Reithmaier, Oliver David et al. Proceedings 2025 Network and Distributed System Security Symposium. The Internet Society, 2025.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Vision: Retiring Scenarios: Enabling Ecologically Valid Measurement in Phishing Detection Research with PhishyMailbox. / Reithmaier, Oliver David; Thiel, Thorsten; Vonderheide, Anne et al. Proceedings 2025 Symposium on Usable Security. San Diego, CA, USA: The Internet Society, 2025.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Authenticate as You Go: From Exploring Smart Home Authentication with Daily Objects to Authenticating with Primary Tasks. / Zimmermann, Verena; Schäfer, Stina; Dürmuth, Markus et al. in: ACM Transactions on Computer-Human Interaction, Jahrgang 32, Nr. 2, 13, 19.04.2025.Publikation: Beitrag in Fachzeitschrift › Artikel › Forschung › Peer-Review 2024 A Representative Study on Human Detection of Artificially Generated Media Across Countries. / Frank, Joel ; Herbert, Franziska ; Ricker, Jonas et al. Proceedings 45th IEEE Symposium on Security and Privacy. 2024. S. 55-73 (Proceedings - IEEE Symposium on Security and Privacy).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Digital Security: A Question of Perspective. A Large-Scale Telephone Survey with Four At-Risk User Groups. / Herbert, Franziska; Becker, Steffen; Buckmann, Annalina et al. Proceedings - 45th IEEE Symposium on Security and Privacy, SP 2024: Conference Proceedings. 2024. S. 697-716 (Proceedings - IEEE Symposium on Security and Privacy).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review A Comparative Long-Term Study of Fallback Authentication Schemes. / Lassak, Leona; Markert, Philipp; Golla, Maximilian et al. CHI '24: Proceedings of the CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, 2024. 970.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Understanding Users' Interaction with Login Notifications. / Markert, Philipp; Lassak, Leona; Golla, Maximilian et al. CHI '24: Proceedings of the CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, 2024. 853.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Batman Hacked My Password: A Subtitle-Based Analysis of Password Depiction in Movies. / Raphael, Maike Magdalena; Kanta, Aikaterini ; Seebonn, Rico et al. Proceedings of the 20th Symposium on Usable Privacy and Security, SOUPS 2024. 2024. S. 199-218.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review 2023 A World Full of Privacy and Security (Mis)conceptions? Findings of a Representative Survey in 12 Countries. / Herbert, Franziska; Becker, Steffen; Schaewitz, Leonie et al. CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery (ACM), 2023. 582 (Conference on Human Factors in Computing Systems - Proceedings).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review 52 Weeks Later: Attitudes Towards COVID-19 Apps for Different Purposes Over Time. / Kowalewski, Marvin; Utz, Christine; Degeling, Martin et al. in: Proceedings of the ACM on Human-Computer Interaction, Jahrgang 7, Nr. CSCW2, 251, 04.10.2023.Publikation: Beitrag in Fachzeitschrift › Konferenzaufsatz in Fachzeitschrift › Forschung › Peer-Review 2022 Exploring User Authentication with Windows Hello in a Small Business Environment. / Farke, Florian M.; Lassak, Leona; Pinter, Jannis et al. Proceedings of the Eighteenth Symposium on Usable Privacy and Security (SOUPS 2022) : August 7-9, 2022, Boston, MA, USA. [Berkeley, CA]: USENIX Association, 2022. S. 523-540.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review \"Fast, Easy, Convenient.\" Studying Adoption and Perception of Digital Covid Certificates. / Herbert, Franziska; Kowalewski, Marvin; Schnitzler, Theodor et al. Proceedings of the Eighteenth Symposium on Usable Privacy and Security (SOUPS 2022) : August 7-9, 2022, Boston, MA, USA. [Berkeley, CA]: USENIX Association, 2022. S. 463-482.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review \"It's Just a Lot of Prerequisites\" A User Perception and Usability Analysis of the German ID Card as a FIDO2 Authenticator. / Keil, Markus; Markert, Philipp; Dürmuth, Markus. Proceedings of the 2022 European Symposium on Usable Security: EuroUSEC '22. New York, NY, United States: Association for Computing Machinery (ACM), 2022. S. 172-188.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review \"As soon as it's a risk, i want to require MFA\" How Administrators Configure Risk-based Authentication. / Markert, Philipp; Schnitzler, Theodor; Golla, Maximilian et al. Proceedings of the Eighteenth Symposium on Usable Privacy and Security (SOUPS 2022) : August 7-9, 2022, Boston, MA, USA. [Berkeley, CA]: USENIX Association, 2022. S. 483-501.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Letzte Änderung: 23.07.24 Druckversion So erreichen Sie uns Kontakt Kontakt © 2025: Leibniz Universität Hannover Impressum Datenschutz Barrierefreiheit Sitemap Menü×Fachgebiet Usable Security and PrivacyFachgebiet Empirical Information SecurityFakultät für Elektrotechnik und InformatikKontakt",
  "content_length": 8509,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:51"
}