{
  "name": "Mark Pauly",
  "homepage": "http://lgg.epfl.ch/people.php",
  "status": "success",
  "content": "Geometric Computing Laboratory ‐ EPFL Skip to content Geometric Computing Laboratory Our research aims at empowering creators. We develop efficient simulation and optimization algorithms to build computational design methodologies for advanced material systems and digital fabrication technologies. Mathematical reasoning, geometric abstractions, and powerful numerical methods are key ingredients in our work. We pursue a holistic approach in that we design and fabricate functional physical prototypes, collaborate with artists and designers, and engage in industry collaborations to validate and inspire our research. Join GCM – Open Positions Upcoming Events No scheduled eventsSee all events Past Events Kinetic Grid Structures 11.11.2024   12:0013:00Speaker: Eike SchlingLocation:  GC B1 10 &  OnlineCategory: Conferences – SeminarsTarget audience: Informed publicDouble exhibition of artists in residence at EPFL: Aetherocohedron and el.ba 17.10.202409.11.2024   18:0020:00Speaker: Josua Putzke and Alison MartinLocation:  EPFL Pavilions ACategory: ExhibitionsTarget audience: General publicMesh-Based Freeform Lens Optimization for Light Control 05.09.2024   11:0012:00Speaker: Bailin DengLocation:  BC 229Category: Conferences – SeminarsTarget audience: Informed publicActuation of Elastic Tensegrity Knots 24.06.2024   10:0012:00Speaker: Liliane-Joy DandyLocation:  BC 233Category: Conferences – SeminarsTarget audience: General publicA few issues in intersections beyond triangle meshes 18.06.2024   11:0012:00Speaker: Zoë MarschnerLocation:  BC 329Category: Conferences – SeminarsTarget audience: Informed publicSee all events News Elegant Mathematics Bending the Future of DesignPublished:14.08.25 — EPFL researchers have developed a new way to design complex, curved three-dimensional shapes using flat materials such as paper, aluminum sheets or plastic, combining creative thinking with a new computational algorithm.Engineering meets art at the Technical Workshops PlatformPublished:06.03.25 — The School of Engineering’s Technical Workshops Platform has recently showcased its technical expertise and versatility through two installations, merging engineering precision with creative artistry.The geometries around us sublimated by art and sciencePublished:05.02.25 — The exhibition Shapes: Patterns in Art and Science, on view at EPFL Pavilions until 9 March, invites the public to discover the richness of natural and artificial geometries through a visual and interactive journey.“We want to create something together that neither of us could alone”Published:16.10.24 — In 2023 and 2024, EPFL Professor Mark Pauly welcomed two artists in his lab, providing them with the opportunity to draw inspiration from his research, while he gained insights from their creativity. Starting on October 17, their works will be displayed at EPFL Pavilions.Squeezing the Geometric OrangePublished:14.05.24 — Talk by Oded Stein, Thursday, May 30th, 11am, BC 229Talk by Oliver GrossPublished:08.11.23 — Oliver Gross of TU Berlin gives a talk on Variational Energies for Curves with Variable Thickness on Thursday, Nov. 16th, 11am in BC 329.All news Follow us in social networks Follow us on X Follow us on Instagram Follow us on YouTube Follow us on LinkedIn Contact [email protected] BC 347Station 14 CH-1015 Lausanne Access map Back to top",
  "content_length": 3345,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:39"
}