{
  "name": "Mark S. Nixon",
  "homepage": "https://www.ecs.soton.ac.uk/people/msn",
  "status": "success",
  "content": "Mark Nixon | Electronics and Computer Science | University of Southampton Electronics and Computer Science Email: msn@ecs.soton.ac.ukMark Nixon Personal homepage http://users.ecs.soton.ac.uk/msn/band/I am currently the President of the IEEE Biometrics Council and Vice Chair IEEE PSPB. I am a Fellow of the IET, Fellow of the IAPR (for services to biometrics and computer vision) and am the Distinuished Fellow of the BMVA 2015. I chaired the British Machine Vision Conference BMVC'98 held at Southampton in September '98 for the the British Machine Vision Association. Apart from being a programme member/ reviewer for other conferences, Josef Kittler and I chaired IAPR International Conference Audio Visual Biometric Person Authentication (AVBPA 2003) and was Publications Chair for the International Conference on Pattern Recognition (ICPR 2004) at Cambridge UK with Josef Kittler, I co-chaired the  IEEE 7th International Conference on Face and Gesture Recognition FG2006 held at Southampton, UK in 2006. More recently I have been program co-chair at many of the top biometrics conferences (IEEE BTAS, IEEE/IAPR IJCB, IAPR ICB) and general chair BTAS 2010, ISBA 2016 (Japan), IJCB 2017 (USA), and track chair ICPR 2016 (Mexico). I chaired MIUAwhen it came to Southampton in 2018 and then it was ICB 2019 in Crete. I'm the Professor in Computer Vision at the School of Electronics and Computer Science. My research interests are in image processing and computer vision. I have helped to develop new techniques for static and moving shape extraction (both parametric and non-parametric) which have found application in automatic face and automatic  gait  recognition and in medical image analysis. We were early workers in face recognition, later came to pioneer gait  recognition and later joined the pioneers of ear biometrics, and currently we're working on soft biometrics where we recognise people by human attributes. Amongst previous research contracts, I was Principal Investigator with John Carter on the DARPA supported project Automatic Gait Recognition for Human ID at a Distance, on the General Dynamics Defence Technology Centre's program on data fusion (biometrics, naturally), on the MoD/ARL (US) IBM-led Information Technology Alliance and projects supporteed by the EPSRC, NERC, and the EU. I've written a heck of a lot of papers and supervised a heck of a lot of (great) PhD students. As I enter retirement, I'm writing books. Research Research interestsIf you'd like to hear about our new work in soft biometrics, I and Arun Ross presented a tutorial at BTAS 2016 and talked at Biosig 2017. Previously I have talked on gait and on ear at IEEE Face and Gesture 2004, EUSIPCO 2004, IEEE ISBAST 2008, the International Conference on Information Security and Digital Forensics, on Biometrics and Forensics, at IEEE BTAS 2009 and on Semantic Biometrics at IEEE BiDS 2009, at  IEEE International Joint Conference on Biometrics (USA, 2011) (a History of Biometrics) and at the 15th Sanken International Symposium (Japan, 2012) and on gait and soft at IEEE AVSS 2013. Next up I'm talking on gait and soft biometrics at the IEEE Winter and Summer Schools on Biometrics (Shenzen, Cagliari). Our work on biometrics has attracted quite a lot of press interest. Here we are on  ABC (Good Morning America) News, on BBC 40 Years of Surveillance, and later on BBC1  Bang Goes the Theory, and most recently concerning our work on a murder in Australia 60 Minutes Australia. We have shown the first try at gait spoofing on Discovery's Planet Earth(about time 6:20). Even better, there was a full article in the Times and even a leading article. There's been coverage on ear biometrics too: here we are on ITV Meridian, 2010, (gait) and on BBC1 in 2010 (more for juniors this) Newsround  (ear - use VLC to open this one). If you have codec problems, try VLC or GOM as one or other usually works. Teaching I currently lecture on Computer Vision and Digital Electronics and have written textbooks to support all courses I lecture. Our vision book, co-written with Dr. Alberto Aguado, entitled Feature Extraction and Image Processing for Computer Vision is currently in its Fourth Edition, published by Academic Press/ Elsevier in 2019. My first book,  Introductory Digital Design - a programmable approach , was published by MacMillan, July 1995 and there's a new version Digital Electronics: a Primer, published by Imperial College Press 2015.  With Tieniu Tan and Rama Chellappa, we wrote Human ID based on Gait  which is part of the Springer Series on Biometrics, and was published late 2005. I co-edited the first book on Biometrics Spoofing Handbook of Biometric Anti-Spoofing,with Springer 2014 and the Second Edition (on Presentation Attack Detection); We wrote the survey on Gait Biometrics in the first text on Biometrics: Personal ID in Networked Society, and the Ear Biometrics Chapter in The Handbook of Biometrics. Excellent books indeed. For a bit of R&R, I play in a folk band Forest Folk Publications Zheng, Y., Nixon, M.S. and Allen, R. (2000) Lumbar spine location by evidence gathering. In Proceedings of Medical Image Understanding and Analysis (MIUA2000). Medical Image Understanding and Analysis 2000. pp. 45-48 . Tatem, A.J., Lewis, H.G., Atkinson, P.M. and Nixon, M.S. (2001) Dealing with uncertainty in super-resolution land cover mapping. In Proceedings of the RSPSoc 2001 Conference on Geomatics, Earth Observation and the Information Society. RSPSoc.. Tatem, Andrew J., Lewis, Hugh G., Atkinson, Peter M. and Nixon, Mark S. (2001) Multiple-class land-cover mapping at the sub-pixel scale using a Hopfield neural network. International Journal of Applied Earth Observation and Geoinformation, 3 (2), 184-190. (doi:10.1016/S0303-2434(01)85010-8). Lewis, H.G., Brown, M., Tatnall, A.R.L., Nixon, M.S. and Manslow, J.F. (1998) Data analysis and empirical classification in FLIERS (ISIS Technical Report) Southampton, UK. Department of Electronics and Computer Science, University of Southampton Tatem, A.J., Lewis, H.G., Atkinson, P.M. and Nixon, M.S. (1999) Land cover mapping at the sub-pixel scale using a Hopfield neural network. 25th Conference of the Remote Sensing Society, Leicester, Leicester, United Kingdom. 07 - 09 Sep 1999. Yam, ChewYean, Nixon, Mark S. and Carter, John N. (2004) Automated person recognition by walking and running via model-based approaches. Pattern Recognition, 37 (5), 1057-1072. (doi:10.1016/j.patcog.2003.09.012). Cunado, David, Nixon, Mark S. and Carter, John N. (2003) Automatic extraction and description of human gait models for recognition purposes. Computer Vision and Image Understanding, 90 (1), 1-41. (doi:10.1016/S1077-3142(03)00008-0). Grant, Michael G., Nixon, Mark S. and Lewis, Paul H. (2002) Extracting moving shapes by evidence gathering. [in special issue: Handwriting processing and applications] Pattern Recognition, 35 (5), 1099-1114. (doi:10.1016/S0031-3203(01)00078-4). Gething, Peter, Noor, Absilan, Gikandi, Priscilla, Hay, Simon, Nixon, Mark and Atkinson, Peter (2008) Developing geostatistical space–time models to predict outpatient treatment burdens from incomplete national data. Geographical Analysis, 40 (2), 167-188. (doi:10.1111/j.1538-4632.2008.00718.x). Huang, P.S., Harris, C.J. and Nixon, M.S. (1998) Recognising Humans by Gait via Parametric Canonical Space. Proc. of International Symposium on Engineering of Intelligence Systems. pp. 384-389 . Huang, P.S., Harris, C.J. and Nixon, M.S. (1998) Canonical Space Representation for Recognizing Humans by Gait and Face. Proc. of IEEE Southwest Symposium on Image Analysis and Interpretation. pp. 180-185 . Chen, Y.Q., Nixon, M.S. and Thomas, D.W. (1997) On Texture Classification. International Journal of Intelligent Systems, 28 (7), 669--682. Nixon, M.S. (1997) On a Programmable Approach to Introducing Digital Electronics. IEEE Transactions on Education, 40 (3), 195--206. Chen, Y.Q., Damper, R.I. and Nixon, M.S. (1997) On neural network implementations of k-nearest neighbour pattern classifiers. IEEE Transactions on Circuits and Systems Part 1: Fundamental Theory and Applications, 44 (7), 622--629. Aguado, A.S., Nixon, M.S. and Montiel, M.E. (1998) Parameterising Arbitrary Shapes via Fourier Descriptors for Evidence-Gathering Extraction. CVGIP: Image Understanding, 69 (2), 202-221. Aguado, A.S., Montiel, M.E. and Nixon, M.S. (1997) Arbitrary shape Hough transform by invariant geometric features. IEEE International Conference on Systems, Man, and Cybernetics. Computational Cybernetics and Simulation, , Orlando, FL, United States. 12 - 15 Oct 1997. pp. 2661-2664 . (doi:10.1109/ICSMC.1997.635337). Gunn, S.R. and Nixon, M.S. (1997) A Robust Snake Implementation: A Dual Active Contour. IEEE Trans. on Pattern Analysis and Machine Intelligence, 19 (1), 63--68. Benn, D.E., Nixon, M.S. and Carter, J.N. (1997) Robust Eye Centre Extraction using the Hough Transform. Bigun, J., Chollet, G. and Borgefors, G. (eds.) Proceedings of 1st Int. Conf. on Audio- and Video-Based Biometric Person Authentication. 3--9 . Cunado, D., Nixon, M.S. and Carter, J.N. (1997) Using gait as a biometric, via phase-weighted magnitude spectra. Bigun, J., Chollet, G. and Borgefors, G. (eds.) Proceedings of 1st Int. Conf. on Audio- and Video-Based Biometric Person Authentication. 95--102 . Davies, C.J. and Nixon, M.S. (1996) Sensing Surface Discontinuities via Coloured Spots. Proc. International Workshop on Image and Signal Processing. 573--576 . Aguado, A.S., Montiel, M.E. and Nixon, M.S. (1996) Improving Parameter Space Decomposition for the Generalised Hough Transform. Proc. IEEE International Conference on Image Processing ICIP '96. 627--630 . Runnacles, B.S. and Nixon, M.S. (1996) Texture extraction, Classification and Segmentation using Statistical Geometric Features. Proc. IEEE International Conference on Image Processing ICIP '96. 129--132 . Gunn, S.R. and Nixon, M.S. (1996) Snake Head Boundary Extraction using Local and Global Energy Min",
  "content_length": 92533,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:39"
}