{
  "name": "Markus Wagner 0007",
  "homepage": "https://research.monash.edu/en/persons/markus-wagner",
  "status": "success",
  "content": "Markus Wagner - Monash University XView Scopus Profile Markus Wagner Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0002-3124-0061 EmailMarkus.Wagnermonashedu Accepting PhD Students 20012025 Research activity per year Personal profile BiographyMarkus Wagner is an Associate Professor at the Department of Data Science and AI, Faculty of Information Technology, Monash University, Australia. He has conducted his PhD studies at the Max Planck Institute for Informatics in Saarbruecken, Germany and at the University of Adelaide, Australia. His research topics range from mathematical runtime analysis of heuristic optimisation algorithms and theory-guided algorithm design to applications of heuristic methods to software engineering and renewable energy production. While his research is fundamental at times, he is no stranger to industry-funded research; some of his translational projects are funded by Google, Facebook, and by several companies in defence and mining. Markus has been deeply passionate about sustainability since his high-school days… and still is. He served as the first ever Sustainability Officer at the ACM Special Interest Group on Genetic and Evolutionary Computation and now is the SIG's Treasurer; he founded the IEEE CIS Task Force on Computational Intelligence in the Energy Domain, and he is Senior Advisor to the Monash Energy Institute. Using further, “raw” academic performance indicators: Markus has written about 200 articles with about 250 co-authors, his h-index is 43 (5.6k citations), and he has attracted over AUD 14M in funding (AUD 3M as lead). To date, his results have been recognised with one best poster award, one best presentation award, four best paper awards, one medal, one HUMIES Gold Award, and the 2024 Biannual German IT Security Award. He served as General Chair of the 1000-attendee GECCO’22, he founded the IEEE CIS Task Force on Benchmarking and the IEEE CIS Task Force on Benchmarking, and he is co-founder of the area of Data-Driven Search-Based Software Engineering (2017/2018). Markus has all his papers available on his website: https://www.acrocon.com/~wagner/ Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, PhD, Theory and Applications of Bio-Inspired Algorithms, University of AdelaideAward Date: 31 Jul 2013Computer Science: Artificial Intelligence and Theoretical Computer Science, Diplom, Testing a Verification System, University of Koblenz and LandauAward Date: 30 Nov 2009Artificial Intelligence, Master program (one-year, DAAD-funded exchange program), one-year exchange program, University of Georgia2006 → 2007 External positionsActing Head of School, University of AdelaideFeb 2022 → Jul 2022Discovery Early Career Researcher Award (DECRA), ARC - Australian Research Council2016 → 2018 Research area keywordsClimate ChangeOptimisationHeuristicsMulti-Objective OptimisationSearch Based Software EngineeringDesign OptimisationWind FarmsWave Farms Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2021 2021 2023 2024 2025 2027 1 Not started 2 Active 3 Finished Projects per year Grid Guru: Grid Guru - Leveraging AI-Driven Grid OptimisationWagner, M. (Primary Chief Investigator (PCI)), Abbasnejad, E. (Chief Investigator (CI)), Mak, T. (Chief Investigator (CI)), Shareghi Nojehdeh, E. (Chief Investigator (CI)), Wang, H. (Chief Investigator (CI)), Cui, H. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)) & Lipscombe, S. (Project Manager)Monash University – Internal Faculty Contribution, GridGuru Solutions Pty Ltd, Electricity Transmission Ministerial Holding Corporation (trading as Transgrid)16/07/25 → 15/07/26Project: Research future- proofing software reputation and skills development: Automating software violation detection and repair: future- proofing software reputation and skills developmentLicorish, S. (Primary Chief Investigator (PCI)), Wagner, M. (Chief Investigator (CI)), Meek, J. (Chief Investigator (CI)) & MacDonell, S. (Chief Investigator (CI))MBIE - Ministry of Business, Innovation and Employment (New Zealand)1/10/24 → 30/09/27Project: Research Fair Energy Allocation and Dynamic Pricing for Smart Charging of Electric VehiclesWagner, M. (Primary Chief Investigator (PCI)) & Hematiboroujeni, M. (Chief Investigator (CI))Project: Research Digital Twin: Digital Twin Enabled Sustainable Sunshine Precinct DevelopmentYang, R. (Primary Chief Investigator (PCI)) & Wagner, M. (Chief Investigator (CI))1/03/24 → 1/04/25Project: Research Collaboration with RedGrid’: Collaboration to enhance RedGrid’s a software modelling and planning algorithmsWagner, M. (Primary Chief Investigator (PCI)), Liebman, A. (Chief Investigator (CI)), Wang, H. (Chief Investigator (CI)) & Mak, T. (Chief Investigator (CI))1/11/23 → 30/09/24Project: Research View all 6 projects Research output Research output per year 2001 2013 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 122 Conference Paper 48 Article 5 Editorial 4 Review Article 4 More 2 Chapter (Book) 2 Foreword / Postscript Research output per year Research output per year Cumulative Step Size Adaptation for Adaptive SEMO in Integer SpaceRudolph, G. & Wagner, M., 2025, Evolutionary Multi-Criterion Optimization - 13th International Conference, EMO 2025 Canberra, ACT, Australia, March 4–7, 2025 Proceedings, Part I. Singh, H., Ray, T., Knowles, J., Li, X., Branke, J., Wang, B. & Oyama, A. (eds.). Singapore Singapore: Springer, p. 118-131 14 p. (Lecture Notes in Computer Science; vol. 15512).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) Future schools and the energy implications of AI in education: A review of scenarios and method for engaging young people in futures thinkingKaviani, F., Selwyn, N., Strengers, Y., Dahlgren, K., Cumbo, B. & Wagner, M., Sept 2025, In: Policy Futures in Education. 23, 6, p. 1067-1085 19 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Information-theoretic detection of unusual source code changesTorres, A., Baltes, S., Treude, C. & Wagner, M., 8 Aug 2025, In: Empirical Software Engineering. 30, 5, 45 p., 153.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) PrefaceKrejca, M. S. & Wagner, M., 2025, Evolutionary Computation in Combinatorial Optimization: 25th European Conference, EvoCOP 2025, Held as Part of EvoStar 2025, Trieste, Italy, April 23–25, 2025, Proceedings. S. Krejca, M. & Wagner, M. (eds.). Cham Switzerland: Springer, p. v-vii 3 p. (Lecture Notes in Computer Science; vol. 15610).Research output: Chapter in Book/Report/Conference proceeding › Foreword / Postscript › Other Open Access The role of surprisal in issue trackersCaddy, J., Treude, C., Wagner, M. & Barr, E. T., 23 Nov 2025, In: Empirical Software Engineering. 30, 1, 34 p., 30.Research output: Contribution to journal › Article › Research › peer-review View all 183 research outputs Activities Activities per year 2024 2024 2024 2 Contribution to workshop, seminar, course Activities per year AIM Day: Maths AI and Energy meet Industry @ MonashCollevecchio, A. (Organiser), Garoni, T. (Organiser), Goodwin, S. (Organiser), Hamza, K. (Organiser) & Wagner, M. (Organiser)3 Jun 2024Activity: Participating in or organising an event types › Contribution to workshop, seminar, course AIM Day: Maths AI and Energy meet Industry @ MonashCollevecchio, A. (Organiser), Dargaville, R. (Organiser), Garoni, T. (Organiser), Goodwin, S. (Organiser), Hamza, K. (Organiser), Lilley, B. (Organiser), Wagner, M. (Organiser) & Xie, Y. (Organiser)14 Nov 2024Activity: Participating in or organising an event types › Contribution to workshop, seminar, course Press/Media Reimagining the future of AI in the education ecosystemKaviani, F., Selwyn, N., Strengers, Y., Cumbo, B., Wagner, M. & Dahlgren, K.10/10/241 Media contributionPress/Media: Article/Feature",
  "content_length": 8588,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:59"
}