{
  "name": "Mark Liberman",
  "homepage": "http://www.ling.upenn.edu/~myl",
  "status": "success",
  "content": "Mark Liberman's Home Page Mark Liberman Director Linguistic Data Consortium Christopher H. Browne Distinguished Professor of Linguistics Department of Linguistics Faculty Director Ware College House Professor Department of Computer and Information Science Office hours: (by appointment) Email: myl@cis.upenn.edu Some courses: LING 0001: Introduction to Linguistics LING525/CIS558 Computational Analysis and Modeling of Biological Signals and Systems LING521: Corpus Phonetics LING 052: Big Data in Linguistics (Freshman Seminar) LING 005: The Landscape of Research and Innovation at Penn COGS 501 / COGS 502 Mathematical Foundations of Language and Communication Sciences Linguistics 520: Phonetics I Cognitive Science 001: Introduction to Cognitive Science (with Lyle Ungar) COLL002: Biology, Language and Culture (with Alan Mann and Greg Urban) Humanities 100: Human Nature (with Wendy Steiner) Linguistics 620, 2021: Prosody/Syntax Relations Linguistics 620, 2018: Research Topics in Clinical Linguistics Linguistics 2900/5900: Deep Learning and Large Language Models in Linguistic Research Linguistics 502/202: Field Linguistics Recent research areas: corpus-based phonetics legal, medical and political applications of linguistic analysis the phonology and phonetics of lexical tone, and its relationship to intonation formal models for linguistic annotation A few papers: Wieling, M., J. Grieve, G. Bouma, J. Fruehwald, J. Coleman and M. Liberman, \"Variation and Change in the Use of Hesitation Markers in Germanic Languages\", Language Dynamics and Change, 2016. Parish-Morris, J., M. Liberman, N. Ryant, C. Cieri, L. Bateman, E. Ferguson, and R. Schultz, \" Exploring Autism Spectrum Disorders Using HLT\", CL-Psych 2016. Ryant, N., M. Slaney, M. Liberman, E. Shriberg, and J. Yuan, \"Highly Accurate Mandarin Tone Classification in the Absence of Pitch Information\", Speech Prosody 2014. Yuan, J., and M. Liberman, \"F0 Declination in English and Mandarin Broadcast News Speech\", Speech Communication 2014. Yuan, J. and M. Liberman, \" Investigating /l/ Variation in English through Forced Alignment \", InterSpeech 2009. Bird, S. and M. Liberman, \"A Formal Framework for Linguistic Annotation\". Speech Communication 2001. Akinlabi, A. and M. Liberman, \"Tonal Complexes and Tonal Alignment\". NELS 31. Akinlabi, A. and M. Liberman, \"The Tonal Phonology of Yoruba Clitics\". In B. Gerlach and J. Grijzenhout, eds., Clitics in Phonology, Morphology and Syntax. John Benjamins (2000). Full CV here. Erdös number: 3 Language Log",
  "content_length": 2524,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:34"
}