{
  "name": "Markus Nüttgens",
  "homepage": "https://www.bwl.uni-hamburg.de/harcis/01-zentrum/01-team/chair/markus-nuettgens.html",
  "status": "success",
  "content": "Prof. Dr. Markus Nüttgens : Lehrstuhl für Wirtschaftsinformatik : Universität Hamburg Zur MetanavigationZur HauptnavigationZur SucheZum InhaltZur SubnavigationZum SeitenfußFoto: UHHProf. Dr. Markus NüttgensFoto: Markus NüttgensLehrstuhlinhaberAnschriftUniversität HamburgUniversity of Hamburg Business SchoolWirtschaftsinformatikVon-Melle-Park 520146 HamburgBüroRaum: 3130KontaktTel.: +49 40 42838-2792E-Mail: markus.nuettgens\"AT\"uni-hamburg.deWerdegangseit 2005: Professur für Wirtschaftsinformatik, Universität Hamburg2004 - 2005: Professur für Wirtschaftsinformatik, Hamburger Universität für Wirtschaft und Politik2001 - 2003: Lehrstuhlvertreter, Wirtschaftsinformatik II, Universität Trier1995 - 2001: Wissenschaftlicher Assistent und Stellvertreter des Institutsdirektors (Prof. Dr. Dr. h.c. mult. A.-W. Scheer), Institut für Wirtschaftsinformatik (IWi), Universität des Saarlandes (C1-Stelle)1995: Promotion an der Rechts- und Wirtschaftswissenschaftlichen Fakultät, Universität des Saarlandes (Dr. rer. oec.)1989 - 1995: Wissenschaftlicher Mitarbeiter, CIM-Technologie-Transferzentrum (CIM-TTZ), Institut für Wirtschaftsinformatik (IWi), Universität des Saarlandes1985 - 1989: Studium der Betriebswirtschaftslehre (Universität des Saarlandes) Download CVForschungAllgemeine Wirtschaftsinformatik und WissenschaftstheorieInformations- und GeschäftsprozessmanagementBetriebswirtschaftliche StandardsoftwareInformationssysteme in Industrie, Dienstleistung und VerwaltungOpen Source / Open AccessIT-Governance / Compliance / Outsourcing / EntrepreneurshipLehreIT-Entrepreneurship (BA-WI-ITE) (Bachelor)Allgemeine Wirtschaftsinformatik & Wissenschaftstheorie (WI-MA-G1 AWW) (Master)Business Process Management (WiWi-MA-WI-BPM) (Master)IT- und Business Process Sourcing (WiWi-MA-WI-ITBPS) (Master) Seminar zur Wirtschaftsinformatik (BA-WI-SEM) (Bachelor)Projekt Wirtschaftsinformatik (WI-MA-P) (Bachelor)Studie Wirtschaftsinformatik (WI-MA-S) (Master)Projekt Wirtschaftsinformatik (InfB-WI-Proj) (Master)Projektebflow* Toolbox - Open Source Werkzeugkasten für das Geschäftsprozessmanagement, 01/2008 - open endKMU 2.0 - Selbstorganisation für innovative KMU-Netzwerke, BMBF/DLR, 05/2008 - 06/2011Web 2.0 in KMU - Management von Web 2.0 in KMU, 07/2010 - 12/2011Wirtschaftsportal - Wissenschaftliche Begleitforschung, 09/2010 - 05/2011Screencast-basiertes SAP Lernen - E-Learning für betriebswirtschaftliche Standardsoftware, 10/2010 - 03/2011 EMOTEC - Empower Technical Customer Services, 11/2010-10/2013Virtual Acounting Worlds - Methoden zur Softwareunterstützung der Revision bei der Prüfung von Geschäftsprozessen, 11/2010-07/2013smartTCS (Smart Technical Customer Service Platform 4.0)SAMPL  (Secure additive Manufacturing Platform, 1.11.2016 - 31.10.2019)PublikationenVHB-WI = WI-Journalliste 2008 und WI- Liste der Konferenzen, Proceedings und Lecture Notes 2008 | VHB-JQ = VHB-JOURQUAL 3 (2012) Bücher Thomas, O.; Nüttgens, M.; Fellmann, M. (Hrsg.): Smart Service Engineering - Konzepte und Anwendungsszenarien für die digitale Transformation, SpringerGabler, Heidelberg 2016. ISBN 9783658162610 Thomas, O.; Nüttgens, M. (Hrsg.): Dienstleistungsmodellierung 2014 - Vom Servicemodell zum Anwendungssystem, SpringerGabler, Heidelberg 2014. ISBN 9783658068912 Nüttgens, M.; Thomas, O.; Fellmann, M. (Hrsg.): Dienstleistungsproduktivität - Mit mobilen Assistenzsystemen zum Unternehmenserfolg, SpringerGabler, Heidelberg 2014. ISBN 9783658053017 Thomas, O.; Nüttgens, M. (Hrsg.): Dienstleistungsmodellierung 2012 - Product-Service Systems und Produktivität. Springer Gabler, Berlin 2012. ISBN 9783658008635 (312 Seiten) Böhmann, T.; Knackstedt, R.; Leimeister, J. M.; Nüttgens, M.; Thomas, O. (Hrsg.): Service Engineering & Management, Proceedings der Teilkonferenz Service Engineering & Management im Rahmen der Multi-Konferenz Wirtschaftsinformatik, 29.02-02.03.2012 in Braunschweig, BoD, Norderstedt 2012. ISBN 9783848221097 Nüttgens, M.; Gadatsch, A.; Kautz, K.; Schirmer, I.; Blinn, N. (Hrsg.): Governance and Sustainability in Information Systems. Managing the Transfer and Diffusion of IT, IFIP WG 8.6 International Working Conference, Hamburg, Germany, September 22-24, 2011, IFIP AICT, Vol. 366, Springer, Heidelberg 2011. ISBN 9783642241475 Nüttgens, M.; Thomas, O.; Weber, B. (Hrsg.): Enterprise Modelling and Information Systems Architectures (EMISA 2011), Proceedings of the 4th International Workshop on Enterprise Modelling and Information Systems Architectures, Hamburg, Germany, September 22-23, 2011. LNI Vol. P-190, Köllen, Bonn 2011. ISSN 16175468, ISBN 9783885792840 [VHB-WI: B, VHB-JQ: C] v. Kortzfleisch, H. F. O., Jung, R. H., Nüttgens. M. (Hrsg.): Web 2.0 in KMU-Netzwerken: Ein gestaltungsorientierter Ansatz zur Steigerung der Innovation und Selbstorganisation von Unternehmensverbünden, EUL, Lohmar 2011 Thomas, O.; Nüttgens, M. (Hrsg.): Dienstleistungsmodellierung 2010 - Interdisziplinäre Konzepte und Anwendungsszenarien, Physica, Heidelberg 2010. ISBN: 9783790826203 Thomas, O.; Nüttgens, M. (Hrsg.): Diskussionsbeiträge des 2. Workshops Dienstleistungsmodellierung (DLM) 2010 im Rahmen der Modellierung 2010 (Klagenfurt, Österreich, 24.03.2010). CEUR-WS Vol-577. ISSN: 16130073 Thomas, O.; Loos, P.; Nüttgens: Hybride Wertschöpfung: Mobile Anwendungssysteme für effiziente Dienstleistungsprozesse im technischen Kundendienst, Springer, Berlin et al. 2010. ISBN: 9783642118548 Nüttgens, M.; Rump, F. J.; Mendling, J.; Gehrke, N. (Hrsg.): EPK 2009 - Geschäftsprozessmanagement mit Ereignisgesteuerten Prozessketten, Proceedings 8. GI-Workshop und -Arbeitskreistreffen (Berlin, 26.-27.11.2009), CEUR-WS Vol-554, GI e.V., Bonn 2009. ISSN: 16130073 Thomas, O.; Nüttgens, M. (Hrsg.): Dienstleistungsmodellierung, Methoden – Werkzeuge und Branchenlösungen, Physica, Heidelberg 2009. ISBN: 9783790820980 Loos, P.; Nüttgens, M.; Turowski, K.; Werth, D. (Hrsg.): MobIS 2008 - Modellierung betrieblicher Informations­systeme: Modellierung zwischen SOA und Compliance Management, Proceedings GI-Tagung (Saarbrücken, 27.-28. November 2008), LNI Vol. P-141, GI e.V., Bonn 2008. ISSN: 1675468, ISBN: 9783885792352 [VHB-WI: B, VHB-JQ: C] Loos, P.; Nüttgens, M.; Turowski, K.; Werth, D. (Hrsg.): MobIS 2008 Workshops - Proceedings of the Workshops colocated with the MobIS2008 conference: including EPK2008, KobAS2008 and ModKollGP2008 (Saarbrücken, 27.-28. November 2008), CEUR-WS Vol-420. ISSN: 16130073 Nüttgens, M.; Rump, J.F.; Gadatsch A. (Hrsg.): EPK 2007 - Geschäftsprozessmanagement mit Ereignisgesteuerten Prozessketten, Proceedings 6. GI-Workshop und -Arbeitskreistreffen (St. Augustin, November 2007), CEUR-WS Vol-303, St. Augustin 2007. ISSN: 16130073 Nüttgens, M.; Rump, J.F. ; Mendling J. (Hrsg.): EPK 2006 - Geschäftsprozessmanagement mit Ereignisgesteuerten Prozessketten, Proceedings 5. GI-Workshop und -Arbeitskreistreffen (Wien, Dezember 2006), CEUR-WS Vol-224, Wien 2006. ISSN 16130073 Weske, M.; Nüttgens, M. (Hrsg.): EMISA 2006 - Methoden, Konzepte und Technologien für die Entwicklung von dienstebasierten Informationssystemen, Proceedings GI-Workshop (Hamburg, Oktober 2006), LNI Vol. P-95, GI e.V., Bonn 2006. ISSN 16175468, ISBN 9783885791898 [VHB-WI: B, VHB-JQ: C] Mendling, J.; Nüttgens, M. (Hrsg.): XML4BPM 2006 - XML Integration and Transformation for Business Process Management, Proceedings 3. GI-Workshop im Rahmen der MKWI 2005 (Passau, Februar 2006), in: Lehner, F.; Nösekabel, H.; Kleinschmidt, P.: Multikonferenz Wirtschaftsinformatik 2006, Band 2, XML4BPM Track, GITO-Verlag, Berlin 2006, S. 265-344. ISBN 3936771626 [VHB-WI: C; VHB-JQ: D] Nüttgens, M.; Rump, J.F. (Hrsg.): EPK 2005 - Geschäftsprozessmanagement mit Ereignisgesteuerten Prozessketten, Proceedings 4. GI-Workshop und -Arbeitskreistreffen (Hamburg, Dezember 2005), CEUR-WS Vol-167, Hamburg 2005. ISSN 16130073 Kindler, E.; Nüttgens, M. (Hrsg.): BPRM 2005 - Business Process Reference Models, Proceedings, Satellite workshop of the Third International Conference on Business Process Management (BPM) (Nancy, Frankreich, September 2005), Nancy 2005. Nüttgens, M.; Mendling, J. (Hrsg.): XML4BPM 2005 - XML-Interchange formats for BPM, Proceedings 2. GI-Workshop im Rahmen der GI-Fachtagung BTW 2005 (Karlsruhe, März 2005), CEUR-WS Vol-145, Karlsruhe 2005. Nüttgens, M.; Rump, J.F. (Hrsg.): EPK 2004 - Geschäftsprozessmanagement mit Ereignisgesteuerten Prozessketten, Proceedings 3. GI-Workshop und -Arbeitskreistreffen (Luxemburg, Oktober 2004), Luxemburg 2004. Nüttgens, M.; Mendling, J. (Hrsg.): XML4BPM - XML-Interchange formats for BPM, Proceedings 1. GI-Workshop im Rahmen der GI-Konferenz Modellierung 2004 (Marburg, März 2004), Marburg 2004. Nüttgens, M.; Rump, J.F. (Hrsg.): EPK 2003 - Geschäftsprozessmanagement mit Ereignisgesteuerten Prozessketten, Proceedings 2. GI-Workshop und -Arbeitskreistreffen (Bamberg, Oktober 2003), Bamberg 2003. Nüttgens, M.; Rump, J.F. (Hrsg.): EPK 2002 - Geschäftsprozessmanagement mit Ereignisgesteuerten Prozessketten, Proceedings 1. GI-Workshop und Arbeitskreistreffen (Trier, November 2002), Trier 2002. Scheer, A.-W.; Nüttgens, M. (Hrsg.): Electronic Business Engineering, Proceedings 4. Internationale Tagung Wirtschaftsinformatik (WI) 1999 (Saarbrücken, März 1999), Physica, Heidelberg 1999. [VHB-WI: A; VHB-JQ: C] Elsner, T.; Nüttgens, M.: Skomputeryzowane Systemy Informacyjne, Uniwersytet Warszawski, Studia Informatyki Gospodarczej, Warzawski 1995. Nüttgens, M.: Koordiniert-dezentrales Informationsmanagement: Rahmenkonzept - Koordinationsmodelle - Werkzeug-Shell, Gabler, Dissertationsschrift, Wiesbaden 1995. ISBN: 9783409121507 Bücherbeiträge Brinker, J; Kammler, F.; Hagen, S.; Remark, F.; Rebstadt, J.; Jasper, M.; Dollmann, D.; Nüttgens, M.; Thomas, O.: smartTCS – Eine Plattform zur flexiblen Einbindung von Kunden in technische Dienstleistungen für den Maschinen- und Anlagenbau, in: Beverungen, D.; Schumann, J. H.; Stich, V.; Strina, G. (Hrsg.): Dienstleistungsinnovation durch Digitalisierung, Band 2: Prozesse – Tr",
  "content_length": 78588,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:58"
}