{
  "name": "Mark H. Chignell",
  "homepage": "https://www.mie.utoronto.ca/mie/faculty/chignell",
  "status": "success",
  "content": "Mark H. Chignell - Department of Mechanical & Industrial Engineering Posted June 24th, 2019 by Oscar del Rio Mark H. Chignell PhD Professor, Industrial Engineering Email: chignell@mie.utoronto.ca Tel: 416-978-8951 Office: BA8171A Research Group: Interactive Media Lab Research Areas Human Factors Information Engineering Research Interests Human factors approaches to information technology; mobile computing; healthcare ergonomics; social computing; advanced user interface design; smart internet and personal web. Applications to healthcare and e-commerce. Bio Mark Chignell has been a member of the Mechanical & Industrial Engineering faculty since 1990. Prior to that he was an Assistant Professor in Industrial and Systems Engineering at the University of Southern California from 1984 to 1990. Professor Chignell taught in the Psychology Department at Monash University in Melbourne, Australia from 1980 to 1982. He has a PhD in Psychology (University of Canterbury, New Zealand, 1981), and an MS in Industrial and Systems Engineering (Ohio State, 1984). He was formerly (2013-2017) the Director of the Knowledge Media Design Institute at the University of Toronto, and the BUL Chair in Human Computer Interaction. He has been a visiting scientist at the IBM Centre for Advanced Studies in Toronto since 2002 and he was a visiting scientist at Keio University from 2005 to 2010. Professor Chignell has co-authored books on expert systems and intelligent databases (published by John Wiley & Sons) and he has co-edited three books. He has many journal and conference papers on topics such as hypertext and information retrieval, user interface design and healthcare applications. His research has been funded by the Bell University Laboratories, the National Sciences and Engineering Research Council (NSERC), IBM, the Ontario Centres of Excellence (OCE), the Japan Society for the Promotion of Science, TELUS, Oki Corporation, Ricoh Corporation, and Apple Computer. He has founded two start-up companies, both of which received funding. His latest startup is Centivizer Inc. which is a University of Toronto startup that has been funded by the AGEWELL National Centre of Excellence. Centivizer creates exergaming and cognitive assessment products to support healthy aging. © 2025 Faculty of Applied Science and Engineering",
  "content_length": 2328,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:27"
}