{
  "name": "Mark-Jan Nederhof",
  "homepage": "https://mjn.host.cs.st-andrews.ac.uk",
  "status": "success",
  "content": "Mark-Jan Nederhof Mark-Jan Nederhof Graduated in Computer Science in 1990 at the University of Nijmegen. OIO (PhD-student) at the University of Nijmegen, at the Computer Science Department from 1990 till 1994. From February 1995 till March 1998, post-doc researcher involved in the OVIS-project (Openbaar Vervoer Informatie Systeem), at the department of Humanities Computing of the University of Groningen. From March 1998 till July 2000, senior researcher at DFKI, Saarbr체cken, involved in the Verbmobil-project. From November 1999 till March 2000, on leave from DFKI, consultant at AT&T Shannon Laboratory. From July 2000 till July 2003, KNAW fellowship at the department of Humanities Computing of the University of Groningen. From August 2003 till September 2005, lecturer at the department of Humanities Computing of the University of Groningen, and affiliated to the Pionier project Algorithms for Linguistic Processing. From October 2005 till October 2006, senior researcher at the Max Planck Institute for Psycholinguistics. From July 2006 till September 2006, on leave from MPI, sabbatical with the Research Group on Mathematical Linguistics at the Rovira i Virgili University. From November 2006, lecturer at the School of Computer Science of the University of St Andrews. Address Dr. Mark-Jan Nederhof School of Computer Science University of St Andrews North Haugh, St Andrews, Fife KY16 9SX UK @st-andrews.ac.uk Tel: +44 (0)1334 461638 Fax: +44 (0)1334 463278 Research interests in general Context-free, tree-adjoining and regular languages Probabilistic parsing Parsing with unification grammars Error correction ... Publications Presentations Teaching CS3302 (2015-2016) CS5012 (2016-2017) Potential student projects that I might supervise involve: probabilistic grammatical formalisms, and possibly machine learning, preferably with applications in natural language processing parsing of programming languages Conferences Reviewer for EMNLP 2018, Brussels, Belgium, October 31 - November 4, 2018. Reviewer for COLING 2018, Santa Fe, New Mexico, USA, August 20-26, 2018. Member of programme committee of Formal Grammar 2018, Sofia, Bulgaria, August 11-12, 2018. Member of programme committee of IJCNLP 2017, Taipei, Taiwan, Nov 27 - Dec 1, 2017. Member of programme committee of IWPT 2017, Pisa, Italy, September 20-22, 2017. Member of programme committee of EMNLP 2017, Copenhagen, Denmark, September 7-11, 2017. Member of programme committee of RANLP 2017, Varna, Bulgaria, September 4-6, 2017. Member of programme committee of FSMNLP 2017, Ume책, Sweden, September 4-6, 2017 Member of programme committee of TAG+13, Ume책 University, Sweden, September 4-6, 2017 Member of programme committee of ACL 2017, Vancouver, Canada, July 30 - August 4, 2017. Member of programme committee of Formal Grammar 2017, Toulouse, France, July 22-23, 2017. Member of programme committee of EMNLP 2016, Austin, Texas, USA, November 2-6, 2016. Member of programme committee of Formal Grammar 2016, Bozen-Bolzano, Italy, August 20-21, 2016. Member of programme committee of ACL 2016, Berlin, Germany, Aug 7-12, 2016. Member of programme committee of StatFSM 2016: ACL Workshop on statistical NLP and weighted automata, at ACL 2016, Berlin, August 12, 2016. Member of programme committee of TAG+12, D체sseldorf, Germany, June 29 - July 1, 2016. Member of programme committee of NAACL HLT 2016, San Diego, California, Jun 12-17, 2016. Member of programme committee of Workshop on Discontinuous Structures in Natural Language Processing, at NAACL HLT 2016, San Diego, California, Jun 17, 2016. Past conferences Other activities Developing software for processing Ancient Egyptian and studying ancient writing systems in general.",
  "content_length": 3721,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:47"
}