{
  "name": "Marko Nieminen",
  "homepage": "https://users.aalto.fi/~mhtn/home",
  "status": "success",
  "content": "Professor Marko Nieminen Ease-of-use is nowadays a baseline business factor. Without good usability and user experience the developed applications and services will not make the real markets and generate revenue. Industrial activities are nowadays carried out in operative business networks. A single company seldom produces the whole of the product or a service by itself. ICT is extensively used for human coordination and collaboration. The effectiveness and efficiency of ICT-supported collaboration depends on the interplay and usability of the ICT applications. Mobile phones are used even in the most rural and distant locations of the world. People living in these areas can benefit from the financial and healthcare services brought to them via their mobile phones. User studies about the needs, requirements, contexts, and forms of service help in developing these basic services of modern society. This work enables the inclusion and participation of all people in important societal activities. Marko Nieminen D.Sc.(Tech.) Professor of Usability and User Interfaces Aalto University, School of Science Department of Computer Science Work I am the professor of Usability and User Interfaces at Aalto University School of Science, Department of Computer Science. Our research group Strategic Usability Research Group STRATUS is doing research and providing teaching in strategic user-centred design. In general, my approach to the research and development of ICT (Information and communication technology) arises from the usability origin: How to make computers and other interactive systems (e.g. mobile devices) both easy-to-use and valuable for the user? Usability and user experience research and development takes place in several different application and solution domains that are of great interest to me. I consider relevant industrial and real-life questions and problems a great origin for academic basic and applied research. Good results in this work can improve our everyday life. Research Interests and Domains You may look at my Aalto researcher profile. HCI, User-Centred Design: Human aspects in digital service design, human-computer interaction, user experience (UX), usability engineering, usability for business, user-centred product development, user-centred service development Collaborative ICT in Industry: Collaborative ICT for industrial ecosystems, Computer-Supported Co-operative Work CSCW, Shop-floor usability: Information support for assembly tasks, Computer-aided learning Finance and Healthcare: Research and development on mobile payments and other financial services, ICT for Collaborative Healthcare: User-centred design of healthcare ICT ICT4D: Information and communication technology for development, human-centred ICT for improving livelihood in emerging economies. Contact information IMPORTANT! Please note: Unfortunately, email has become sort of obsolete for me nowadays: I keep receiving quite an amount of email daily. Together with my constantly overflowing calendar, I am unfortunately not anymore able to respond to most of the email messages. My apologies for that. Email just does not seem work for me that well anymore with timely issues or even raising attention. Using other - perhaps more traditional - ways and channels may be more effective. However, I have some special means available for managing the overload of information. Sending \"high importance\" messages does not help in my case. However, I do have a special \"rush\" or \"ping\" processing for those who will put a little bit more effort on their messaging: I have reserved a little bit of special time for processing messages that are considered as important so that they need to be rushed forward. All messages that contain a hashcode #rush or #ping in the Subject line will be forwarded to a special folder. I will process this folder at designated times usually at least twice a week. The #ping hashtag will also be resent to my messaging app. I aim at processing rush messages as quickly as possible unless the amount of those messages exceeds the time designated to process them. Furthemore, I have also implemented special filtering for messages with the intentional tag \"#RFC863\", which will be processed according to the functional definition of, well, RFC863. Perhaps that may be tried, even. If you want to meet with me and query about my next free slot during my office hours, you may use my office hours web service (link) or send me an email message with following text in the Subject line of the message: #query #officehours (not a realtime service, wait for a reply for a while!). My Outlook will process that message automatically and provide an answer about free office hour meeting times to you as soon as I receive the message (and my Outlook processes it; this may take some time if my computer is not online!). If you need just a brief (less than 15 minutes) discussion with me (or a telephone conversation), you may request a time slot by sending an email message with following Subject line: #query #15min. Please, be prepared with focused questions for such a short and efficient meeting. A final word, though: Despite all the verbose explanation here, I am not saying all this to keep you away from me, just trying to lower the annoyance if you do not get a prompt email answer from me. E-mail: Send e-mail to me using address in the form FirstName.LastName@aalto.fi (i.e. FirstName: Marko, Lastname: Nieminen. Please note the restriction in answering email messages above!) Phone (mobile): +358-50-3684763 Visiting address: Tietotekniikan talo (T-talo / Computer Science building), room A229, Konemiehentie 2, Espoo Mailing address: Aalto University Marko Nieminen Department of Computer Science P.O. Box 15400 FIN-00076 Aalto FINLAND Office Hours / Vastaanotto NOTICE! Pre-booking is required to my office hours! You may request information about the next free meeting time during my office hours by using my office hours web service (link) or sending an email to me with Subject line #query #officehours. Vastaanottoaikani ovat kovin varattuja, siksi on syytä varata aika etukäteen. Seuraavan vapaan vastaanottoaikani saat selville joko käyttämällä internetissä olevaa vastaanottoaikapalveluani (linkki) tai lähettämällä minulle sähköpostiviestin, jonka otsikkorivinä on #query #officehours. Research Projects Past and ongoing research projects in which I and our research group participate and have taken part in are following: PROGE - Prosumer-driven green and digital transition towards de-centralized peer-to-peer energy communities. A consortium research project with LUT University funded by the Research Council of Finland. (2023-2027) FINEST Twins - An EU teaming project to develop a cross-border recearch centre focusing on sustainable and smart cities (2019-2023/2026) AIXCon - Transforming construction with data-driven intelligent processes (2022-2024) Fusion Grid - Digital services and electricity for emerging markets (2018-2020) DIPCEM - Digital Infrastructure Platform for Communities in Emerging Markets (2016) Living Lab Bus - Älykkäiden palveluiden, käyttökokemusten ja teknologioiden kehitysympäristö - liikkuminen palveluna (\"MaaS2015 - Mobility as a Service\"; VTT:n koordinoima yhteisprojekti) (2015-2018) Lapsus - Lapsiperheiden uudistuva sairaala − Potilaskokemus palvelupolkujen arvon kehittäjänä (The Renewing Children's Hospital - Patient Experience in the Improvement of Patient Journeys) (2015-2017) UFISA - User Centered Design for Innovative Services and Applications (Student and teacher exchange project between Finnish and Southern African universities. Supported by CIMO, the Center for International Mobility / North-South-South programme) (2012-2015) Qualidat - Quality of Data for Valid Decisions (2012-2014) FlowIT - Virtaa IT-hankintoihin (2012-2014) (a joint research project with Finnish Institute of Occupational Health) DiWa - Digital War Room (Novel concepts and tools for co-located team collaboration with digital artifacts) (2011-2013) MONA/ARVI - Moniaistinen asuinympäristökokemus (2011-2013) (a collaborative project with SOTERA, [link]) UXtools - User Experience Tools (a joint research project with Nokia Research Center and Aalto University, 2009-2011) Coprod - Yhteisöllinen tuotannonohjaus verkostoituvassa liiketoiminnassa (Collaborative Production Control in Networked Business, 2009-2011) MoFS - Mobile Financial Services (Part I: 2008-2010, Part II: 2012-2015) Extreme Design (2008-2010) Digital dictation in hospitals, a project in cooperation with HUS (1-3/2008) Tervesysteemi.info - An open internet forum to support the development of information systems in healthcare (2007) PRIMA - Privacy in the Making (2006-2010) Intact - Industrial Interaction through Open Service Platforms (2006-2009) FC-ICT - ICT in the New Business and Service Concepts of Foundry Industry (2005-2009) TechMedia - Technology Mediated Knowledge Services for Distributed Work Environments (2003-2006) MC2 - Mobile Content Communities (2004-2006) VIKSU - Virtual Project Room for Distributed Product Development Teams (2000-2003) WISE - Web-based Information Services for Engineering (2000-2003) MOBIX - Mobile Contexts of Use (2001-2003) AMIRE - Authoring Mixed Reality (2001-2004) Proakt - Proaktiivisen tietotekniikan vaikutukset huoltotyöhön (The Effect of Proactive Information Technology to Maintenance Work) (2002) ProKM - Kokemusperäinen tieto henkilöstön tueksi prosessiteollisuudessa (Knowledge Management Practices and Tools in Process Industry) (2002) KATTI - Käyttäjäkeskeisen tuotekehityksen tietotuki (Information Support for User-Centred Product Development) (1997-2000). Smart Products II Usability of Smart Products in Information Society (1997-2001) Smart Products - A multi-disciplinary approach to user interface design (1995-1999) ISAD - Information System for Assembly and Disassembly. 1997-1999. COGIS - Cognitive Requirements and Usability of In",
  "content_length": 11781,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:49"
}