{
  "name": "Mark D. Ryan 0001",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/ryan-mark.aspx",
  "status": "success",
  "content": "Professor Mark Ryan - School of Computer Science - University of Birmingham Professor Mark Ryan School of Computer ScienceProfessor in Computer Security Contact details Emailm.d.ryan@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Mark Ryan is a Professor in Computer Security for the School of Computer Science and the lead for the Centre of Security and Privacy at the University of Birmingham. For more information, please see Mark's homepage. Staff detailsMedia informationPolicy information Recent publications Article Zhang, M, Wang, C, Jiang, W, Oswald, D, Murray, T, Marin, E, Wei, J, Ryan, M & Kostakos, V 2025, 'Using Vibration for Secure Pairing with Implantable Medical Devices: Development and Usability Study', JMIR Biomedical Engineering, vol. 10, e57091. https://doi.org/10.2196/57091 Conference article Li, R, Wang, Q, Wang, Q, Galindo, D & Ryan, M 2022, 'SoK: TEE-assisted confidential smart contract', Proceedings on Privacy Enhancing Technologies, vol. 2022, no. 3, pp. 711-731. https://doi.org/10.56553/popets-2022-0093 Conference contribution Spielman, J, Oswald, D, Ryan, M & Van Bulck, J 2025, Activation Functions Considered Harmful: Recovering Neural Network Weights through Controlled Channels. in 28th International Symposium on Research in Attacks, Intrusions and Defenses (RAID 2025). IEEE, 28th International Symposium on Research in Attacks, Intrusions, and Defenses, Gold Coast, Australia, 19/10/25. Zhang, C, Yang, X, Oswald, D, Ryan, M & Jovanovic, P 2025, Eva: Efficient Privacy-Preserving Proof of Authenticity for Lossily Encoded Videos. in 2025 IEEE Symposium on Security and Privacy (SP)., 11023495, IEEE Symposium on Security and Privacy, IEEE, pp. 4643-4662, 46th IEEE Symposium on Security and Privacy, San Francisco, California, United States, 12/05/25. https://doi.org/0.1109/SP61157.2025.00237 Zhang, M, Marin, E, Ryan, M, Kostakos, V, Murray, T, Tag, B & Oswald, D 2024, OOBKey: Key Exchange with Implantable Medical Devices Using Out-Of-Band Channels. in ARES '24: Proceedings of the 19th International Conference on Availability, Reliability and Security., 191, Association for Computing Machinery (ACM), 19th International Conference on Availability, Reliability and Security, Vienna, Austria, 30/07/24. https://doi.org/10.1145/3664476.3670876 Moreira-Sanchez, J, Ryan, M & Garcia, F 2022, Protocols for a two-tiered trusted computing base. in V Atluri, R Di Pietro, C D. Jensen & W Meng (eds), Computer Security – ESORICS 2022: 27th European Symposium on Research in Computer Security, Copenhagen, Denmark, September 26–30, 2022, Proceedings, Part III. 1 edn, Lecture Notes in Computer Science, vol. 13556, Springer, Cham, pp. 229–249, 27th European Symposium on Research in Computer Security, Copenhagen, Denmark, 26/09/22. https://doi.org/10.1007/978-3-031-17143-7_12 Laing, T, Marin, E, Ryan, MD, Schiffman, J & Wattiau, G 2022, Symbolon: Enabling Flexible Multi-device-based User Authentication. in 2022 IEEE Conference on Dependable and Secure Computing (DSC)., 9888854, IEEE Conference on Dependable and Secure Computing, Institute of Electrical and Electronics Engineers (IEEE), 5th IEEE Conference on Dependable and Secure Computing, DSC 2022, Edinburgh, United Kingdom, 22/06/22. https://doi.org/10.1109/DSC54232.2022.9888854 Fotiadis, G, Moreira-Sanchez, J, Giannetsos, T, Chen, L, Ronne, PB, Ryan, M & Ryan, PYA 2021, Root-of-trust abstractions for symbolic analysis: application to attestation protocols. in R Roman & J Zhou (eds), Security and Trust Management: 17th International Workshop, STM 2021, Darmstadt, Germany, October 8, 2021, Proceedings. 1 edn, Lecture Notes in Computer Science, vol. 13075, Springer, Cham, pp. 163-184. https://doi.org/10.1007/978-3-030-91859-0_9 Singh, RR, Moreira-Sanchez, J, Chothia, T & Ryan, M 2020, Modelling of 802.11 4-Way Handshake Attacks and Analysis of Security Properties. in STM 2020: Security and Trust Management . Springer, pp. 3. https://doi.org/10.1007/978-3-030-59817-4_1 Oxford, M, Parker, D & Ryan, M 2020, Quantitative Verification of Certificate Transparency Gossip Protocols. in Proceedings of 6th International Workshop on Security and Privacy in the Cloud (SPC'20). IEEE Computer Society Press, 6th International Workshop on Security and Privacy in the Cloud (SPC'20), Virtual event, 29/06/20. Ordean, M, Ryan, M & Galindo Chacon, D 2019, CAOS: Concurrent-Access Obfuscated Store. in Proceedings of the 24th ACM Symposium on Access Control Models and Technologies (SACMAT 2019). Proceedings of ACM Symposium on Access Control Models and Technologies, SACMAT, Association for Computing Machinery (ACM), pp. 13-24, 24th ACM Symposium on Access Control Models and Technologies, Toronto, Ontario, Canada, 4/06/19. https://doi.org/10.1145/3322431.3325101 Denzel, M, Ryan, M & Ritter, E 2018, A Malware-Tolerant, Self-Healing Industrial Control System Framework. in S De Capitani di Vimercati & F Martinelli (eds), ICT Systems Security and Privacy Protection: 32nd IFIP TC 11 International Conference, SEC 2017, Rome, Italy, May 29-31, 2017, Proceedings. IFIP Advances in Information and Communication Technology , vol. 502, Springer, pp. 46-60, 32nd International Conference on ICT Systems Security and Privacy Protection (IFIP SEC 2017), Rome, Italy, 29/05/17. https://doi.org/10.1007/978-3-319-58469-0_4 Preprint Spielman, J, Oswald, D, Ryan, M & Van Bulck, J 2025 'Activation Functions Considered Harmful: Recovering Neural Network Weights through Controlled Channels' arXiv. <https://arxiv.org/abs/2503.19142> Zhang, C, Yang, X, Oswald, D, Ryan, M & Jovanovic, P 2024 'Eva: Efficient IVC-Based Authentication of Lossy-Encoded Videos' Cryptology ePrint Archive. <https://eprint.iacr.org/2024/1436> Cheval, V, Moreira, J & Ryan, M 2023 'Automatic verification of transparency protocols (extended version)' arXiv. https://doi.org/10.48550/arXiv.2303.04500 View all publications in research portal Computer security, cloud computing, electronic voting, TPM, trusted computing, hardware-based security, Google, Linux, software security, privacy, mobile security, wireless communication, online privacy, privacy protection. Computer security; cloud computing, electronic voting; TPM, trusted computing; hardware-based security; Google; Linux; software security; privacy; mobile security; wireless communication; online privacy; privacy protection; and crypto-currencies in which there are several mutually-distrusting parties web-based systems. Recent policy experience includes producing the technical report for the UK Government's Electronic balloting for industrial action: Knight review. The technical report constitutes an appendix of the review. Related Research Offensive cyber research Related News and Events Privacy versus security – how to minimize the access to our personal dataNew e-voting system to flag up coercionOnline voting a step closer thanks to breakthrough in security technology Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7120,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:20"
}