{
  "name": "Mark Alexander Connell Snoeren",
  "homepage": "http://cseweb.ucsd.edu/~snoeren",
  "status": "success",
  "content": "Alex C. Snoeren Alex C. Snoeren Professor Computer Science & Engineering Dept. University of California, San Diego EBU3B 3114 9500 Gilman Drive, M/C 0404 La Jolla, CA 92093-0404 (858) 822-2289 | (858) 534-7029 fax I am a member of the Systems and Networking Research Group, the Security and Cryptography Research Group, and the Center for Networked Systems. Recent papers Cuckoo for Clients: Disaggregated Cuckoo Hashing S. Grant and A. C. Snoeren ATC, Boston, MA, July 2025. Eden: Developer-Friendly Application-Integrated Far Memory A. Yelam, S. Grant, S. Deshpande, N. Amit, R. N. Mysore, A. Ousterhout, M. K. Aguilera, and A. C. Snoeren NSDI, Philadelphia, PA, April 2025. Full list » Google Scholar Classes CSE 8B Introduction to Computer Science: Java (II) Spring '19 CSE 120 Principles of Computer Operating Systems Spring '08 Fall '06 Fall '05 CSE 121 Operating Systems: Architecture and Implementation Winter '10 Winter '09 Winter '07 Winter '06 Winter '05 Fall '03 CSE 123 Computer Networks Fall '24 Fall '23 Winter '22 Winter '21 Fall '19 Fall '18 Fall '17 Winter '17 Spring '16 Fall '15 Fall '14 Fall '13 Fall '10 CSE 221 Graduate Operating Systems Fall '16 Winter '16 Winter '11 Fall '08 Fall '07 CSE 222A Computer Communication Networks Winter '19 Winter '18 Winter '15 Winter '14 Winter '13 CSE 223B Distributed Computing and Systems Spring '25 Spring '22 Spring '21 Spring '20 Spring '18 Spring '17 Spring '15 Spring '14 Spring '13 Spring '11 Spring '10 Spring '09 Winter '08 Spring '06 Spring '05 Spring '04 Spring '03 (CSE 291D) CSE 224 Graduate Networked Systems Spring '24 CSE 291 Topics in Mobile & Wireless Networking Spring '07 Winter '03 CSE 294 Systems and Networking Research Seminar Fall '25 Winter '25 Winter '24 Spring '22 Spring '20 Fall '19 Fall '18 Winter '18 Winter '17 Winter '16 Fall '15 Spring '15 Winter '15 Spring '14 Spring '10 Winter '08 Winter '07 Winter/Spring '06 Winter '05 Fall '04 Spring '04 Winter '04 Students Current Liam Arzola Ryan Kosta Alisha Ukani Graduated Mikhail Afanasyev, PhD Jeannie Albrecht, PhD (joint w/Amin Vahdat) Alvin AuYoung, PhD Karyn Benson, PhD (joint w/k claffy) Rajdeep Das, PhD Joe DeBlasio, PhD Ben Du, PhD (joint w/k claffy) Alex Gamero Garrido, PhD (joint w/Alberto Dainotti) Stewart Grant, PhD Danny Huang, PhD (joint w/Kirill Levchenko) Ramana Kompella, PhD (joint w/George Varghese) Feng Lu, PhD (joint w/Geoff Voelker & Tara Javidi) John McCullough, PhD Barath Raghavan, PhD Arjun Roy, PhD (joint w/Ken Yocum) Daniel Turner, PhD (joint w/Stefan Savage) Bhanu Vattikonda, PhD Patrick Verkaik, PhD Kevin Webb, PhD (joint w/Ken Yocum) Anil Yelam, PhD Jay Chen Shaan Mahbubani Chris Tuttle Erik VandeKieft Sen Zhang Weiyang \"Frank\" Wang",
  "content_length": 2713,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:14"
}