{
  "name": "Mark A. Neerincx",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/interactive-intelligence/people/current-group-members/mark-a-neerincx",
  "status": "success",
  "content": "Personal page of Mark A. Neerincx Zoeken Sluit zoek Mark A. Neerincx Mark Neerincx is full professor Human-Centered Computing at the Delft University of Technology and principal scientist Perceptual & Cognitive Systems at TNO (Netherlands organisation of applied research).  Recent projects focus on the socio-cognitive engineering of artificial –virtual or physical– agents (ePartners) that show social, cognitive and affective behaviours to enhance performance, resilience, health and/or wellbeing. In the safety and security domain, the ePartners entail methods and prototypes for sharing situation awareness, harmonizing workload distributions, and supporting stress-coping to enhance performance and resilience (e.g. in robot-assisted disaster response teams). In the health domain, examples are robotic and virtual assistants that help patients to cope with their chronic disease (e.g., diabetics) in different self-managements activities, and robots that help older adults with dementia and care givers to establish positive experiences of life in the care centers.  Important results of Mark’s  research on computer support for professionals and citizen are: (1) cognition and emotion models for performance and health support, (2) models of human-robot partnership for attuning assistance to the individual user and momentary usage context, (3) prototypes of social robots for self-efficacy and behavioral change, (4) cognitive engineering methods and tools, and (5) a diverse set of usability “best practices”. Projects 2018-2021: Hybrid Artificial Intelligence (HAI): A TNO Early Research Programme (ERP) that develops models and methods for controllable, explainable and responsible AI (steering scientist), crossing domains with use cases on healthy living, autonomous driving and human-agent teams in defence. 2015-current: ReJAM: Robots engaging elderly in Joint Activities with Music. 2014-2017: Human Enhancement, a TNO project on adaptive automation and human resilience in different domains (lead scientist), e.g., automotive, maritime and police. 2015-2018: PAL, Personal Assistant for healthy Lifestyle (overall project coordinator), an EU Horizon2020 project, in which the support of the physical and virtual robot will be harmonized to the social support of family and caregivers (over extended periods of time and diverse environments). 2014-2017: TRADR, Long-Term Human-Robot Teaming for Robot-Assisted Disaster Response (supervisor), an EU-FP7 project in which rescue robots are being developed to become collaborative team-members for the enhancement of complex and dynamic disaster response missions  The Quick Results program “Better decision-making under high pressure” develops a tool—the Synthetic Emotion Mediator (SEM) —which monitors situated emotional responses and provides corresponding personalized feedback. This tool can be used for both training purposes and for real-time support of professionals who have to make emotion arousing decisions.  The Innovative Program “Resilience and vulnerability after stress” aims at the development and empirical evaluation of preventive and therapeutic interventions for professionals who have higher risks for exposure to traumatic events. This intervention consists of (1) improving the activation of the traumatic memory or mental representation with Virtual Reality exposure and (2) supporting systematic desensitization with bio-neuro feedback. 2011-2015: national (FES) research programme  COMMIT (supervisor). In project “P2 IUALL”, we integrate an inclusive design approach into the situated Cognitive Engineering method and develop ePartners that enhance citizens’ participation in the (local) society. In project “P7 SWELL”, we develop sensing, modelling and support techniques for stress self-management. 2005-2015: Mission Execution Crew Assistant (MECA) (overall project leader). European projects for the European Space Agency (ESA) with several (inter)national partners to establish the requirements and a prototype of an electronic Partner (ePartner) system that supports astronauts’ operations during exploration missions to the Moon or Mars. The objective of MECA is to empower the cognitive capacities of human-machine teams during planetary exploration missions in order to cope autonomously with unexpected, complex and potentially hazardous situations. A number of PhD-projects in the Defence, Security and Health domains. 2010-2015: FES Brain and Cognition (coordinator of two national Safety programmes): Deel deze pagina: Facebook Linkedin Twitter Email WhatsApp Deel deze pagina +31 15 27 87106 M.A.Neerincx@tudelft.nl Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands Room 4W.900",
  "content_length": 4690,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:14"
}