{
  "name": "Mark John Batty",
  "homepage": "https://www.cs.kent.ac.uk/people/staff/mjb211",
  "status": "success",
  "content": "Mark Batty - School of Computing - University of Kent Jump to content design1 Mark Batty Professor Email m.j.batty@kent.ac.uk Telephone +44 (0)1227 82 7688 More information ORCID iD: 0000-0001-7053-4364 Location Room 213 Kennedy Building University of Kent Canterbury Kent CT2 7FS On this page About Research interests Professional About I develop rigorous mathematical specifications, testing tools, and verification techniques for real-world concurrent systems, focusing on established interfaces (e.g. C, C++ and, OpenCL) and concrete testable artefacts (e.g. x86, Power, ARM CPUs, and Nvidia, AMD GPUs). My interests span a variety of complementary topics including: empirical testing of the behaviour of hardware and compilers, building formal models of parts of the system, the development of algorithms and data-structures that use fine-grained concurrency, and the verification of those pieces of concurrent code. For my latest direction, see this Royal Society position paper. Research interests I belong to the following research groups:Programming Languages and Systems GroupI am currently recruiting for a fully-funded 3.5 year PhD studentship (details here) provided by the UK Research Institute in Verified Trustworthy Software Systems. Please do get in touch if you are interested. Professional I am coinvestigator on an EPSRC Standard Grant, Verifiably Correct transactional memory, starting 2018.I have been awarded a VeTTS Grant, Specification and verification of C++ data structure libraries, starting 2018.I have been awarded an EPSRC First Grant, Compositional, dependency-aware C++ concurrency, starting 2018.I have been awarded a VeTTS Grant, PrideMM web interface, starting 2017.Kent hosted the Kent Concurrency Workshop on the 21st and 22nd of July 2016. This was the next in the series held previously at Imperial, York, Oxford, Dublin, Cambridge, Newcastle, and Queen Mary. Attendance can be judged by inspecting the Doodle poll.Kent hosted the 3rd South of England Regional Programming Language Seminar on the 21st of April 2016, with invited speaker Derek Dreyer talking about Rust, together with many other excellent speakers.In 2016, I spoke at a specialist scientific discussion meeting at the Royal Society on verified trustworthy software systems. Find the slides here.I have been awarded a Lloyds Register Foundation and Royal Academy of Engineering Research Fellowship, running for 5 years, starting January 2016.In December 2015, I was awarded a UK Government Communications Headquarters (GCHQ) Small Grant for travel and equipment.The Association of Computing Machinery Special Interest Group on Programming Languages (ACM SIGPLAN) has chosen me as the winner of the John C. Reynolds Doctoral Dissertation Award, 2015.The Council of Professors and Heads of Computing (CPHC) and British Computing Society (BCS) have given me their Distinguished Dissertation Award, 2015.For more details, see my CV and my thesis. Last updated 20 March 2025",
  "content_length": 2976,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:32"
}