{
  "name": "Mark Hepple",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/mark-hepple",
  "status": "success",
  "content": "Dr Mark Hepple | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Mark Hepple MSc, PhD School of Computer Science Reader Member of the Natural Language Processing (NLP) research group Open staff member portrait in a modal window m.hepple@sheffield.ac.uk +44 114 222 1829 Regent Court (DCS) Full contact details Dr Mark Hepple School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0003-1488-257X Mark Hepple personal website Mark Hepple Google Scholar Profile Mark Hepple is a Reader in Computer Science. He studied Psychology at Sheffield University (BSc, 1986), and Cognitive Science at Edinburgh University (MSc, 1987; PhD, 1990). Thereafter, he was a Research Associate at Cambridge University (1990-92), and a Postdoctoral Research Fellow at the University of Pennsylvania (1992-93).He joined the Department of Computer Science at Sheffield University in 1993, as a Lecturer, and as a member of the Natural Language Processing group. Research interests Dr Hepple has wide-ranging interests across Computational Linguistics and Natural Language Processing, and has published on many topics, including formal grammar and parsing, information extraction, clinical text mining, temporal information processing, robust dialogue processing, and efficient storage of large-scale linguistic data. Publications Journal articles Onyenwe IE, Hepple M, Chinedu U & Ezeani I (2019) Toward an effective Igbo part-of-speech tagger. ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP), 18(4). View this article in WRRO Onyenwe IE, Hepple M, Chinedu U & Ezeani I (2018) A Basic Language Resource Kit Implementation for the IgboNLP Project. ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP) , 17(2). View this article in WRRO Srijith PK, Hepple M, Bontcheva K & Preotiuc-Pietro D (2017) Sub-story detection in Twitter with hierarchical Dirichlet processes. Information Processing & Management, 53(4), 989-1003. View this article in WRRO Verhagen M, Gaizauskas RJ, Schilder F, Hepple M, Moszkowicz J & Pustejovsky J (2009) The TempEval challenge: identifying temporal relations in text.. Lang. Resour. Evaluation, 43, 161-179. Roberts A, Gaizauskas R, Hepple M & Guo Y (2008) Mining clinical relationships from patient narratives.. BMC Bioinformatics, 9 Suppl 11(Suppl 11), S3. Roberts A, Gaizauskas R, Hepple M, Davis N, Demetriou G, Guo Y, Kola J, Roberts I, Setzer A, Tapuria A & Wheeldin B (2007) The CLEF corpus: semantic annotation of clinical text.. AMIA Annu Symp Proc, 2007, 625-629. Harkema H, Roberts I, Gaizauskas R & Hepple M (2005) A web service for biomedical term look-up.. Comp Funct Genomics, 6(1-2), 86-93. Krotov A, Hepple M, Gaizauskas RJ & Wilks Y (1999) Evaluating two methods for Treebank grammar compaction.. Nat. Lang. Eng., 5, 377-394. Pulman SG & Hepple MR (1993) Feature-based formalism for two-level phonology: A description and implementation. Computer Speech and Language, 7(4), 333-358. Book chapters Setzer A, Gaizauskas, R & Hepple M (2005) Using Semantic Inferences for Temporal Annotation Comparison, The Language Of Time (pp. 575-584). Oxford University PressOxford Wilks Y, Webb N, Setzer A, Hepple M & Catizone R (2005) Machine Learning Approaches to Human Dialogue Modelling, Text, Speech and Language Technology (pp. 355-370). Springer Netherlands Hepple M (2001) Two Functional Approaches For Interpreting D-Tree Grammar Derivations, Studies in Linguistics and Philosophy (pp. 185-204). Springer Netherlands Hepple M (1996) Grammatical relations and the Lambek calculus, Discontinuous Constituency (pp. 255-278). DE GRUYTER Conference proceedings Ezeani I, Hepple M, Onyenwe I & Enemuo C (2018) Multi-task projected embedding for Igbo. Text, Speech, and Dialogue : 21st International Conference, Proceedings (pp 285-294). Brno, Czech Republic, 11 September 2018 - 11 September 2018. View this article in WRRO Ezeani I, Hepple M, Onyenwe I & Chioma E (2018) Igbo Diacritic Restoration using Embedding Models. Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Student Research Workshop (pp 54-60), June 2018 - June 2018. Ezeani I, Hepple M, Onyenwe I & Enemuo C (2018) Transferred Embeddings for Igbo Similarity, Analogy and Diacritic Restoration Tasks. Coling 2018 3rd Workshop on Semantic Deep Learning Semdeep 2018 Proceedings (pp 30-38) Funk A, Aker A, Barker E, Paramita ML, Hepple M & Gaizauskas R (2017) The SENSEI Overview of Newspaper Readers’ Comments. Advances in Information Retrieval. ECIR 2017. Lecture Notes in Computer Science, vol 10193. Springer (pp 758-761) Aker A, Paramita M, Kurtic E, Funk A, Barker E, Hepple M & Gaizauskas R (2016) Automatic Label Generation for News Comment Clusters. Proceedings of the 9th International Natural Language Generation Conference (pp 61-69). Edinburgh, UK, 5 September 2016 - 5 September 2016. View this article in WRRO Ezeani I, Hepple M & Onyenwe I (2016) Automatic Restoration of Diacritics for Igbo Language. Text, Speech, and Dialogue, Vol. 9924 (pp 198-205). Brno, CzechRepublic, 12 September 2016 - 12 September 2016. View this article in WRRO Onyenwe IE & Hepple M (2016) Predicting Morphologically-Complex Unknown Words in Igbo. Text, Speech, and Dialogue, Vol. 9924 (pp 206-214). Brno, CzechRepublic, 12 September 2016 - 12 September 2016. View this article in WRRO Barker E, Paramita ML, Aker A, Kurtic E, Hepple M & Gaizauskas R (2016) The SENSEI Annotated Corpus: Human Summaries of Reader Comment Conversations in On-line News. Proceedings of the 17th Annual Meeting of the Special Interest Group on Discourse and Dialogue (pp 42-52). Los Angeles, USA, 13 September 2017 - 13 September 2017. View this article in WRRO Barker E, Paramita M, Funk A, Kurtic E, Aker A, Foster J, Hepple M & Gaizauskas R (2016) What's the issue here?: Task-based evaluation of reader comment summarization systems. Proceedings of LREC 2016, Tenth International Conference on Language Resources and Evaluation (pp 2094-3101). Portorož, Slovenia, 23 May 2016 - 23 May 2016. View this article in WRRO Preoţiuc-Pietro D, Srijith PK, Hepple M & Cohn T (2016) Studying the temporal dynamics of word co-occurrences: An application to event detection. Proceedings of the 10th International Conference on Language Resources and Evaluation Lrec 2016 (pp 4380-4387) Onyenwe I, Hepple M & Uchechukwu C (2016) Améliorer la précision d’annotation d’un corpus Igbo parreconstruction morphologique et l’apprentissage basé sur latransformation. Proceedings of TALAf 2016 - Traitement automatique des langues africaines (pp 1-10). Paris, France View this article in WRRO Aker A, Kurtic E, Balamurali AR, Paramita M, Barker E, Hepple M & Gaizauskas R (2016) A Graph-Based Approach to Topic Clustering for Online Comments to News. Advances in Information Retrieval, Vol. 9626 (pp 15-29). Padua, Italy, 20 March 2016 - 20 March 2016. View this article in WRRO Aker A, Celli F, Funk JA, Kurtic E, Hepple M & Gaizauskas R (2015) Sheffield-Trento System for Sentiment and Argument Structure Enhanced Comment-to-Article Linking in the Online News Domain (Ahmet Aker, Fabio Celli, Adam Funk, Emina Kurtic, Mark Hepple and Rob Gaizauskas). MultiLing 2015 in SIGDIAL. Prague, 2 September 2015 - 4 September 2015. Onyenwe I, Hepple M, Uchechukwu C & Ezeani I (2015) Use of Transformation-Based Learning in Annotation Pipeline of Igbo, an African Language. Proceedings of the Joint Workshop on Language Technology for Closely Related Languages, Varieties and Dialects (pp 24-33). Hissar, Bulgaria View this article in WRRO Aker A, Kurtic E, Hepple M, Gaizauskas R & Di Fabbrizio G (2015) Comment-to-Article Linking in the Online News Domain. Proceedings of the SIGDIAL 2015 Conference (pp 245-249). Prague, 2 September 2015 - 2 September 2015. View this article in WRRO Onyenwe IE, Uchechukwu C & Hepple M (2014) Part-of-speech Tagset and Corpus Development for Igbo, an African. Proceedings of LAW VIII - The 8th Linguistic Annotation Workshop (pp 93-98). Dublin, Ireland View this article in WRRO Rout D, Bontcheva KL & Hepple M (2013) Reliably evaluating summaries of twitter timelines. AAAI 2013 Spring Symposium on Analyzing Microtext. Stanford Guthrie D & Hepple M (2010) Storing the Web in Memory: Space Efficient Language Models with Constant Time Retrieval.. EMNLP (pp 262-272) Jabbari S, Hepple M & Guthrie L (2010) Evaluating Lexical Substitution: Analysis and New Measures. LREC 2010 - SEVENTH INTERNATIONAL CONFERENCE ON LANGUAGE RESOURCES AND EVALUATION (pp 3250-3254) Jabbari S, Hepple M & Guthrie L (2010) Evaluation Metrics for the Lexical Substitution Task.. HLT-NAACL (pp 289-292) Guthrie D, Hepple M & Liu W (2010) Efficient Minimal Perfect Hash Language Models.. LREC Jabbari S, Hepple M & Guthrie L (2010) Evaluating Lexical Substitution: Analysis and New Measures.. LREC Roberts A, Gaizauskas RJ, Hepple M, Demetriou G, Guo Y, Roberts I & Setzer A (2009) Building a semantically annotated corpus of clinical texts.. J. Biomed. Informatics, Vol. 42 (pp 950-966) Webb N, Liu T, Hepple M & Wilks Y (2008) Cross-Domain Dialogue Act tagging. Proceedings of the 6th International Conference on Language Resources and Evaluation Lrec 2008 (pp 1969-1976) Webb N, Liu T, Hepple M & Wilks Y (2008) Cross-Domain Dialogue Act Tagging.. LREC Roberts A, Gaizauskas RJ, Hepple M & Guo Y (2008) Combining Terminology Resources and Statistical Methods for Entity Recognition: an Evaluation.. LREC Verhagen M, Gaizauskas R, Schilder F, Hepple M, Katz G & Pustejovsky J (2007) SemEval-2007 task 15. Proceedings of the 4th International Workshop on Semantic Evaluations - SemEval '07 (pp 75-80), 23 June 2007 - 24 June 2007. Verhagen M, Gaizauskas R, Schilder F, Hepple M, Katz G & Pustejovsky J (2007) SemEval-2007 task 15: TempEval temporal relation identification",
  "content_length": 16706,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:29"
}