{
  "name": "Markus Kuhn 0001",
  "homepage": "https://www.cl.cam.ac.uk/~mgk25",
  "status": "success",
  "content": "Department of Computer Science and Technology: Dr Markus Kuhn skip to primary navigationskip to content Study at Cambridge About the University Research at Cambridge Search site HomeStudy at Cambridge Undergraduate Courses Applying Events and open days Fees and finance Student blogs and videos Graduate Why Cambridge Course directory How to apply Fees and funding Frequently asked questions International students Continuing education Executive and professional education Courses in education About the University How the University and Colleges work History Visiting the University Term dates and calendars Map For media Video and audio Find an expert Publications Global Cambridge News Events Public engagement Jobs Give to Cambridge Research at Cambridge For staff For current students For alumni For business Colleges & departments Libraries & facilities Museums & collections Email & phone search Computer LaboratoryDr Markus KuhnDepartment of Computer Science and TechnologyComputer LaboratoryHomeThe departmentOverviewPeopleOverviewAcademic staffSupport staffContract researchersFellows & affiliatesPhD studentsVisitorsSeminarsOverviewWednesday Seminar SeriesWheeler Lectureswomen@cl 10th AnniversaryComputer Laboratory 75th AnniversaryHistoryFacilitiesOverviewReceptionFoodShopping and leisureCyclingLibrary resourcesOverviewLibrary inductionGuidesCataloguesElectronic resourcesVirtual journals shelfLocal servicesLab technical reportsExternal technical reportsResource listsReading listsArchivesMaps and directionsContact informationResearchOverviewArtificial IntelligenceOverviewPeopleGroup MeetingsProject ideas for current studentsComputer ArchitectureOverviewProjects and research topics[no title found]PeopleSelected PublicationsOpen source componentsGroup MeetingsContact DetailsGraphics & InteractionOverviewResearchMembersProjectsApplying to do a PhDProject suggestionsOther informationReading ClubNatural Language ProcessingOverviewPeoplePublicationsProjectsPostgraduate opportunitiesResourcesProgramming, Logic, SemanticsSecurityOverviewPeoplePublicationsProjects and topicsSecurity Seminar SeriesMeetingsCoursesPostersJournalsMailing listsblogSystemsOverviewResearch ProjectsMembersSeminarsStudent ProjectsFormer research groupsOverviewDigital Technology GroupResearch AdminAdmissionsOverviewUndergraduate Computer Science at CambridgeOverviewCourseOpen DaysApplyCSATFAQContactMPhil ACSOverviewModulesPhD applicationsResearchGraduate Admissions ProspectusFunding deadlinesPhD degreeOverviewResearchGraduate Admissions ProspectusFunding deadlinesMPhil in Advanced Computer ScienceCPGSPremium Research StudentshipStudent AdministrationTeachingOverviewPart IAPart IBPart IIMasters coursesOverviewInduction for M.Phil and Part III studentsACS FormsPart III and ACS projectsPhD studentsFreshersCourses 2024–25OverviewPart IA CSTPart IB CSTPart II CSTPart IIIMPhil ACSLecturer indexInstructions for lecturersCourses 2025–26OverviewPart IA CSTPart IB CSTPart II CSTPart IIIMPhil ACSLecturer indexInstructions for lecturersExamsOverviewExamination datesExamination resultsExaminers' reportsPlagiarism and collusionPurchase of calculatorsData Retention PolicyPast exam papersGuidance on deadlinesPart III AssessmentMPhil AssessmentStudent Complaint ProcedureLecture timetablesOverviewShort form timetableSupervisionsOverviewPart II supervisions overviewPart II sign-up datesNotes on supervisingSupervisor supportAcademic exchangesOverviewAdvice for students visiting CambridgeUROP internshipsPart IB group projectsOverviewTimetablePhotosPrevious yearsPart II projectsOverviewBriefing document (Pink Book)Important datesOverseersPhase 1 reportBack-up adviceResources DeclarationStudies Involving Human ParticipantsFailure to submit proposalSelection TipsDeclaration of originalitySubmission of dissertationIP ownershipDiploma model projectsOlder project suggestionsSupervising NotesOverseer Briefing NotesDirectors of StudiesResourcesOverviewManaged Cluster ServicePart III and MPhil machinesOnline servicesInstalling LinuxMATLABMicrosoft Azure for Education MembershipMiscellaneousOverviewNewsHonoursObituariesOverviewNeil Wiseman, 1934–1995Roger Needham, 1935–2003David Wheeler, 1927–2004Karen Spärck Jones, 1935–2007Judith Ann Bailey, 1934–2008Robin Milner, 1934–2010Sir Maurice Wilkes, 1913–2010Michael JC Gordon, 1948–2017Richard Gibbens, 1962–2018Ross J Anderson, 1956–2024John Daugman, 1954–2024Internal informationOverviewNew arrivalsOverviewAn introduction to our computing facilitiesInformation for new PhD studentsInformation for new staffInformation for visitorsInformation for hosts of visitorsGeneral informationInduction GuidelinesSpecialist resourcesSystem administrationOverviewEmailPrinting and scanningFilespaceThe CL networkSSH access to the CL systemsSupported platformsGeneric Unix/Linux informationWeb servers and sitesThe RT ticketing systemSpecialist resourcesLecture theatre AVSitemapFrequently asked questionsRoles and responsibilitiesOverviewPeopleHistoryInformation for staffOverviewAccountingParkingCyclingDepartmental policiesInformation for hosts of visitorsMeeting roomsPersonnel informationReceptionStaff trainingStoresUROP internshipsWiseman prizeHealth and safetyOverviewEmergencyFirst aidGeneral health and safetyEnvironmentFitnessH&S policies & committeesRisk assessmentLaser safetyUseful linksIndex of Health & Safety pagesCommitteePhD resourcesOverviewInductionPhD supervisorsGraduate AdvisersCPGSFirst Year Report: PhD ProposalSecond Year Report: Dissertation ScheduleThird Year Report: Progress StatementFourth Year Report: the last yearPapers and conferencesWriting upThesis formattingSubmitting your dissertationExemption from University Composition FeesLeave to work away, holidays and intermissionResearcher DevelopmentApplication deadlinesList of PhD thesisGraduate Students' ForumPAT, recycling and Building ServicesTypographic resourcesOverviewThesis formattingPreparing Tripos exam questions in LaTeXTeaching resourcesOverviewInformation for CST examinersInformation for Directors of StudiesACS module definitionProviding advice to incoming ACS studentsACS interviewing and admissionsOutreach materialCommitteesOverviewFaculty BoardDegree CommitteeGraduate EducationTripos ManagementOutreachHealth & SafetyIT StrategyEquality and DiversityResearch StaffStaff–StudentDirectors of StudiesWorkloadWellbeingGraduate StudentsEthicsBuildings and EnvironmentSelectionExternalDiscontinued committeesWilliam Gates BuildingOverviewBuilding ServicesAccess and securityCare of the WGBFacilities in officesEnergy & EnvironmentMeeting roomsStoresWest Cambridge SiteLeaving the departmentDr Markus Kuhn Associate Professor at the University of Cambridge Department of Computer Science and Technology (the former “Computer Laboratory”) and a Fellow of Wolfson College. PhD, University of Cambridge (2002),Marie Curie scholarship MSc, Purdue University (1997),Fulbright scholarship Diplom-Informatiker, University of Erlangen (1996),Studienstiftung des deutschen Volkes Research interests: computer security, in particular hardware and signal-processing aspects, including in particular compromising emanations, RFID security, and the security of positioning systems (distance-bounding protocols, authentication of navigation signals), hardware tamper resistance, smartcards, network security, intellectual-property protection technology and software-defined radio applications. Publications Information for local students: project ideas, supervisions Consulting services Security Group web pages Contact information Dr Markus Kuhn University of Cambridge Computer Laboratory 15 JJ Thomson Avenue Cambridge CB3 0FD United Kingdom Phone: +44 1223 3-34676  (09:30–18:30) MS-Teams:mgk25 (internal) Github: mgkuhn Email: [Javascript required] (50 MB max, spam-filter delays possible) Gmail: markus.kuhn Time zone: UTC+1h in summer (last Sun Mar – last Sun Oct) UTC in winter Meetings: If you would like to meet, best use the following links to pick and book a time slot: book an in-person meeting slot (Room GE16) book a video chat (Google Meet) Reachability status: Back in Cambridge, catching up with email. Internships and visits: Since I quite regularly get email applications for internships: please note that I do not usually have any funding available for internships. Publications Eric Chun-Yu Peng, Markus G. Kuhn: Adaptive Template Attacks on the Kyber Binomial Sampler. IACR Transactions on Cryptographic Hardware and Embedded Systems (TCHES), Vol. 2025, No 3, pp 470–492. June 2025. (data set and code, archived artifact) Dimitrije Erdeljan, Markus G. Kuhn: Multiband pixel colour classification from HDMI emissions. EMC Europe 2025, 1–5 September 2025, Paris, France. (slides) Dimitrije Erdeljan, Markus G. Kuhn: Benefits of coherent demodulation for eavesdropping on HDMI emissions. EMC Europe 2024, 2–5 September 2024, Bruges, Belgium. (slides) Shih-Chun You, Markus G. Kuhn, Sumanta Sarkar, Feng Hao: Low trace-count template attacks on 32-bit implementations of ASCON AEAD. IACR Transactions on Cryptographic Hardware and Embedded Systems (TCHES), Vol. 2023, No 4, pp 344–366, August 2023. Shih-Chun You, Markus G. Kuhn: Single-trace fragment template attack on a 32-bit implementation of Keccak. CARDIS 2021, 11–12 November 2021, Lübeck, Springer, LNCS 13173, pp 3–23, 2022. DOI: 10.1007/978-3-030-97348-3_1 Shih-Chun You, Markus G. Kuhn: A template attack to reconstruct the input of SHA-3 on an 8-bit device. Presented at COSADE 2020, 5–7 October 2020, Springer, LNCS 12244, pp 25-42. DOI: 10.1007/978-3-030-68773-1_2 Marios O. Choudary, Markus G. Kuhn: Efficient, portable template attacks. IEEE Transactions on Information Forensics and Security, Vol 13, No 2, February 2018, pp 490–501, DOI 10.1109/TIFS.2017.2757440. (data set) Khaled Baqer, Johann Bezuidenhoudt, Ross Anderson, Markus Kuhn: SMAPs: Short Message Authentication Protocols. Security Protocols XXIV, LNCS 10368, pp 119-132, 2016. DOI: 10.1007/978-3-319-62033-6_15 Marios O",
  "content_length": 12150,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:55"
}