{
  "name": "Mark Dras",
  "homepage": "https://mark-dras.github.io",
  "status": "success",
  "content": "Mark Dras's Home Page Mark Dras's Home Page These photos are from 2024, visiting Khiva, Uzbekistan. This is celebrated as the birthplace of Muhammad ibn Musa al-Khwarizmi (Al-Xorazmiy in the Uzbek latin script of the lower pic's map, next to my shoulder), polymath and eponym of algorithms. Workwise, I'm a professor in the School of Computing of Macquarie University, in Sydney, Australia. (Here's my official university page.) Before Macquarie, I was a research fellow at the University of Pennsylvania's Institute for Research in Cognitive Science. Here is how ChatGPT described me on 10 Feb 2023 based on a colleague's prompt. It contains some of the sorts of hallucinations that neural language models are prone to (see also discussions of possible reasons for these, and a survey of research on the issue); I'll leave it open as to what ChatGPT has hallucinated about me. RESEARCH I work in natural language processing (NLP) / language technology / computational linguistics, and am a member of the Natural Language Processing research group. Specifically, I've worked on (among other things) privacy and NLP, native language identification, machine translation, natural language generation, and sentiment analysis (with a focus on how sentiment affects language choices). Some related info: publications; funding; my students. Service activities related to research: I'm Treasurer on the executive board of the Asia-Pacific Chapter of the Association for Computational Linguistics. I'm on the Australian Research Council's College of Experts, from 2025. I'm a director of Macquarie's Performance and Expertise Research Centre. I'm deputy director of the Faculty of Science and Engineering's Centre for Frontier AI Research. I'm the School of Computing's director of research training (i.e. covering PhD and research masters) students. I was until the end of 2024 the chair of Macquarie's Research Compute Allocation Committee. TEACHING In semester 1, 2025, I'll be teaching COMP2010 Algorithms and Data Structures [Handbook | Unit Guide] In semester 2, 2025, I'll be teaching. COMP8240 Algorithms and Data Structures [Handbook | Unit Guide] I've taught a range of units over the years. I also think it's useful for students to know something about what their teachers are likely to be like. As one source of information, there's the sporadic appearance of the Alternative Calendar, but computing units are hardly ever mentioned there, and it usually sounds as if there's only ever a couple of (disgruntled) respondants. So, in case you're thinking of taking a class with me, here's a link to evaluations for several of my units. OTHER Some non-work things. I'm a member of Macquarie's Ally Network. CONTACT DETAILS addr: School of Computing Macquarie University North Ryde NSW 2109 Australia email: mark.dras AT mq . edu . au room: 4 Research Park Drive (also known as the BD building), level 2, room 208 phone: +61 2 9850 9580 Last updated 28 February 2025",
  "content_length": 2964,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:19"
}