{
  "name": "Markus Kroetzsch",
  "homepage": "https://iccl.inf.tu-dresden.de/web/Markus_Kr%c3%b6tzsch/en",
  "status": "success",
  "content": "Markus Krötzsch - International Center for Computational Logic TU Dresden / TU Dresden / InformatikComputer Science / ICCL / TU Dresden / Fakultät InformatikFaculty of Computer Science / International Center For Computational Logic Account Log in Edit tools Discussion View source View history Refresh Internal SucheSearch Deutsch Markus Krötzsch From International Center for Computational Logic Jump to:navigation, search Prof. Dr. Markus Krötzsch ProfessorTechnische Universität Dresdenhttp://www.tu-dresden.deInternational Center for Computational Logichttps://iccl.inf.tu-dresden.de Knowledge-Based Systems DBLPGoogle Scholar markus.kroetzsch@tu-dresden.de  Secretary: secretary_wbs@mailbox.tu-dresden.de  Chat (Matrix ): @kroetzsc:tu-dresden.de  +49 351 463 38486  +49 351 463 37959  APB 3033  Consultation hour for students: Thu, 8:30 am – 9:30 am I am professor for Knowledge-Based Systems at the Institute for Theoretical Computer Science of the Faculty of Computer Science at TU Dresden. The professorship is also part of TUD's Center for Advancing Electronics. My scientific interests are, broadly speaking, in the area of intelligent knowledge management systems. I have made contributions to lightweight and rule-based ontology languages, query answering, reasoning complexity, and content management and integration platforms for the Web of Data. This has led to many publications, but also to introductory texts (including two textbooks) and other teaching materials. I also co-edited the W3C Web Ontology Language standard OWL 2. My most important applied work at the moment is Wikidata. Other projects I have contributed to include the semantic content management system Semantic MediaWiki and the highly efficient ELK ontology reasoner. Behind each of these projects are a number of truly outstanding people with whom I have had (and still have) the pleasure to work. Publications Activities Teaching Active Projects Newest Publications View full publication list Markus Krötzsch Modern Datalog: Concepts, Methods, Applications In Alessandro Artale, Meghyn Bienvenu, Yazmı́n Ibáñez Garcı́a, Filip Murlak, eds., Joint Proceedings of the 20th and 21st Reasoning Web Summer Schools (RW 2024 & RW 2025), volume 138 of OASIcs, 2025. Dagstuhl Publishing Details DownloadJohannes Tantow, Lukas Gerlach, Stephan Mennicke, Markus Krötzsch Verifying Datalog Reasoning with Lean (Extended Abstract) KR 2025 - Recently Published Research Track, November 2025 Details DownloadPiotr Gorczyca, Dörthe Arndt, Martin Diller, Jochen Hampe, Georg Heidenreich, Pascal Kettmann, Markus Krötzsch, Stephan Mennicke, Sebastian Rudolph, Hannes Straß Supporting Risk Management for Medical Devices via the Riskman Ontology and Shapes Proceedings of the 21st International Conference on Semantic Systems (SEMANTiCS 2025), to appear Details DownloadJohannes Tantow, Lukas Gerlach, Stephan Mennicke, Markus Krötzsch Verifying Datalog Reasoning with Lean In Yannick Forster, Chantal Keller, eds., 16th International Conference on Interactive Theorem Proving (ITP 2025), volume 352 of Leibniz International Proceedings in Informatics (LIPIcs), 36:1-36:19, September 2025. Schloss Dagstuhl - Leibniz-Zentrum für Informatik Details DownloadLukas Gerlach, Alex Ivliev, Julián Méndez, Simon Meusel, Raimund Dachselt, Markus Krötzsch EvonNemo - A Symbiosis of Datalog Tracing and Proof Tree Visualization The Fifth Workshop on Explainable Logic-Based Knowledge Representation (XLoKR 2024), November 2024 Details DownloadNils Küchenmeister, Alex Ivliev, Markus Krötzsch Towards Mass Spectrum Analysis with ASP In Carmine Dodaro, Gopal Gupta, Maria Vanina Martinez, eds., Proc. of the 17th International Conference on Logic Programming and Nonmonotonic Reasoning (LPNMR 2024), volume 15245 of LNCS, 200-214, October 2024. Springer Details DownloadAlex Ivliev, Lukas Gerlach, Simon Meusel, Jakob Steinberg, Markus Krötzsch Nemo: Your Friendly and Versatile Rule Reasoning Toolkit In Pierre Marquis,Magdalena Ortiz,Maurice Pagnucco, eds., Proceedings of the 21st International Conference on Principles of Knowledge Representation and Reasoning (KR 2024), 743-754, 2024. IJCAI Organization Details DownloadAlex Ivliev, Lukas Gerlach, Simon Meusel, Jakob Steinberg, Markus Krötzsch Nemo: A Scalable and Versatile Datalog Engine In Mario Alviano, Matthias Lanzinger, eds., Proceedings of the 5th International Workshop on the Resurgence of Datalog in Academia and Industry (Datalog-2.0 2024), volume 3801 of CEUR Workshop Proceedings, 43-47, November 2024. CEUR-WS.org Details DownloadPhilipp Hanisch, Markus Krötzsch Chase Termination Beyond Polynomial Time Proc. ACM Manag. Data, 2(2):93, May 2024 Details DownloadAlex Ivliev, Stefan Ellmauthaler, Lukas Gerlach, Maximilian Marx, Matthias Meißner, Simon Meusel, Markus Krötzsch Nemo: First Glimpse of a New Rule Engine In Enrico Pontelli, Stefania Costantini, Carmine Dodaro, Sarah Gaggl, Roberta Calegari, Artur D'Avila Garcez, Francesco Fabiano, Alessandra Mileo, Alessandra Russo, Francesca Toni, eds., Proceedings 39th International Conference on Logic Programming (ICLP 2023), volume 385 of EPTCS, 333--335, September 2023 Details Download View full publication list Head of the Examination Boards for Computer Science (BSc, MSc, Diploma)Area Editor of Transactions on Graph Data and Knowledge (TGDK)Member of the Program Committee Board of the International Joint Conference on Artificial Intelligence, IJCAI (2022-2024)Director of the School of Embedded Composite AI (SECAI)Member of the Faculty Council Computer Science, TU Dresden (2022-2027)Wikidata Workshop 2025 (Co-Chair)Member of the Steering Committee der International Conference on Web Reasoning and Rule Systems (RR)Study program coordinator Computational LogicCoordinator Track \"Logical Modeling\" in the MSc program Computational Modeling and SimulationPresident of the Open Semantic Data Association (OSDA) Courses Knowledge Graphs (WS 2025) Formale Systeme (WS 2025) Complexity Theory (WS 2025) Database Theory (SS 2025) Complexity Theory (WS 2024)show further courses Student projects Projects and Theses in Knowledge-Based Systems (WS 2025) Completed Theses Reliance-Based Optimization of Existential Rule Reasoningby Alex Ivliev (9 Dezember 2021)Supervisor: Markus Krötzsch Chase-Based Computation of Cores for Existential Rulesby Lukas Gerlach (29 August 2021)Supervisor: Markus Krötzsch Evaluating the Generality of Disjunctive Model Faithful Acyclicity on OWL ontologiesby Lukas Gerlach (31 März 2021)Supervisor: Markus Krötzsch, David Carral Don’t Repeat Yourself: Termination of the Skolem Chase on Disjunctive Existential Rulesby Lukas Gerlach (30 September 2020)Supervisor: Markus Krötzsch, David Carral Software Implementation for Taxonomy Browsing and Ontology Evaluation for the case of Wikidataby Serghei Stratan (7 März 2016)Supervisor: Markus Krötzsch Visualization of spacio-temporal data from Wikidataby Georg Wild (4 September 2014)Supervisor: Markus Krötzsch cfaed CENTER FOR ADVANCING ELECTRONICS DRESDEN https://cfaed.tu-dresden.de/ CPEC Center for Perspicuous Computing https://perspicuous-computing.science/ CeTI Centre for Tactile Internet with Human-in-the-Loop https://ceti.one/ InnoSale Innovating Sales and Planning of Complex Industrial Products Exploiting Artificial Intelligence https://www.innosale.eu/ KIMEDS AI Assisted Certification of Medical Software Nemo A fast, scalable, and reliable rule engine https://knowsys.github.io/nemo-doc/ SECAI School of Embedded Composite Artificial Intelligence https://secai.org ScaDS.AI Center for Scalable Data Analytics and Artificial Intelligence https://scads.ai/ Semantic MediaWiki Popular open-source software for collaborative data management http://semantic-mediawiki.org Wikidata Wikipedia's free, collaborative knowledge base http://www.wikidata.org/ Wikidata SPARQL Logs Access logs from the Wikidata SPARQL Query Service Retrieved from \"https://iccl.inf.tu-dresden.de/w/index.php?title=Markus_Krötzsch/en&oldid=2447\" This page was last edited on 9 October 2014, at 20:31. Privacy policy About International Center for Computational Logic Disclaimers Accessibility",
  "content_length": 8145,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:55"
}