{
  "name": "Markus Schedl",
  "homepage": "https://www.jku.at/en/institute-of-computational-perception/about-us/people/markus-schedl",
  "status": "success",
  "content": "Markus Schedl | Institute of Computational Perception Skip to content (access key: 1) Skip to Search (access key: 2) Markus Schedl Full Professor Science Park 3 - 4 - S3 407 +43 732 2468 4716 +43 732 2468 4705 markus.schedl(at)jku.at Additional Information For most up-to-date information about me, please consider www.mschedl.eu, opens an external URL in a new window. Curriculum Vitae Current position Full Professor at the Institute of Computational Perception, opens in new window of the Johannes Kepler University, opens in new window Linz, Austria. Show More scroll to top Johannes Kepler University Linz Altenberger Straße 69 4040 Linz, Austria T Telephone +43 732 2468 0 Contact Use of cookies Our website uses cookies to ensure you get the best experience on our website, for analytical purposes, to provide social media features, and for targeted advertising. This it is necessary in order to pass information on to respective service providers. If you would like additional information about cookies on this website, please see our data privacy policy . Settings Required cookies These cookies are required to help our website run smoothly. Name Purpose Lifetime Provider CookieConsent This cookie saves your settings about cookie-handling at this website. 1 year JKU Web statistics cookies These cookies help us to continuously improve our services and adapt our website to your needs. We statistically evaluate the pseudonymized data collected from our website. Name Purpose Lifetime Provider _ga This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors. 2 years Google _gid This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the website is doing. The data collected including the number visitors, the source where they have come from, and the pages visited in an anonymous form. 1 day Google _gat_UA-112203476-1 This is a pattern type cookie set by Google Analytics, where the pattern element on the name contains the unique identity number of the account or website it relates to. It appears to be a variation of the _gat cookie which is used to limit the amount of data recorded by Google on high traffic volume websites. 1 minute Google __Secure-ENID Used for Google services. The cookie is primarily used for security and authentication. 13 months Google AEC Is used to prevent unauthorized access and cross-site request forgery (CSRF) attacks. 6 months Google SOCS Is used to save the user's cookie settings. 13 months Google _pk_id This cookie is used to store a few details about the user such as the unique visitor ID. 13 months JKU _pk_ses This cookie is a short lived cookie used to temporarily store data for the visit. 30 minutes JKU _pk_ref This cookie is used to store the attribution information, the referrer initially used to visit the website. 6 months JKU Marketing cookies These cookies help us make our services more attractive to you as well as optimize our advertising and website content. We analyze and evaluate pseudonymised data collected from our website. Name Purpose Lifetime Provider _ga This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors. 2 years Google _gid This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the website is doing. The data collected including the number visitors, the source where they have come from, and the pages visited in an anonymous form. 1 day Google _gcl_au This cookie is used by Google Analytics to understand user interaction with the website. 3 months Google _gac_UA-112203476-1 Contains campaign related information for the user and measures the AdWords campaign success. 90 days Google test_cookie This cookie is set to determine if the website visitor's browser supports cookies. Doesn't contain personal identifier. 15 minutes Google IDE This cookie carries out information about how the end user uses the website and any advertising that the end user may have seen before visiting the said website. 1 year Google _gcl_aw This cookie is set when a user clicks an ad to reach our website. It informs about the success of campaigns and allows to connect ads to conversion targets. 3 months Google AMCV_xx This is a pattern type cookie name associated with Adobe Marketing Cloud. It stores a unique visitor identifier, and uses an organisation identifier to allow a company to track users across their domains and services. 3 years LinkedIn bcookie Contains a browser ID. 2 years LinkedIn bscookie Contains a browser ID for a secure connection. 2 years LinkedIn lang This cookie is used to store the language preference of our visitors Session LinkedIn lidc This cookie carries out information about how the end user uses the website and any advertising that the end user may have seen before visiting the said website. 1 day LinkedIn lissc This cookie is used to analyze how a visitor interacts with embedded services. 1 year LinkedIn UserMatchHistory This cookie is set when a user clicks an ad to reach our website. It informs about the success of campaigns and allows to connect ads to conversion targets. 30 days LinkedIn fr This cookie is set when a user clicks an ad to reach our website. It informs about the success of campaigns and allows to connect ads to conversion targets. 90 days Facebook fbp This cookie is used to display advertisings, for example third-party real time offers. 90 days Facebook sc_at This cookie is used to identify a visitor across multiple domains. 1 year Snap sc-country This cookie is used to determine a visitor's country. 1 day Snap uid This cookie sets a random User-ID and helps at real time bidding for display advertising to targeted audiences. 60 days Adform C This cookie identifies if user’s browser accepts cookies. 1 – Cookies are allowed, 3 – Opt-out. 30 days Adform _scid_r Is used to identify users by a unique ID and deliver customized advertising based on user activity. It is used to optimize advertising content and campaigns. 13 months Snapchat _scid Is used to identify users by a unique ID and track them across different websites and display targeted advertising based on user behavior. 13 months Snapchat X-AB Cookie associated with content from Snapchat. 1 day Snapchat _ScCbts Is used to optimize advertisements, personalize content, improve security measures and analyze usage. 7 days Snapchat li_gc Is used to save the cookie settings for users without LinkedIn registration. 6 months LinkedIn Save your selection and agree Agree to all cookies",
  "content_length": 7069,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:58"
}