{
  "name": "Mark Handley",
  "homepage": "http://www0.cs.ucl.ac.uk/staff/M.Handley",
  "status": "success",
  "content": "Professor Mark Handley, FRS Mark Handley Professor of Networked Systems. Email: Phone: None Room: MPEB 6.21 Google Scholar publication listing PGP key Please note that I'm only one day a week at UCL this days. The rest of the time I'm doing networks at OpenAI. Research Interests Internet Architecture Space Internet Multipath TCP (MP-TCP). AI Training and Datacenter networks: NDP, EQDS Routing protocols. Architectural mechanisms to limit denial-of-service attacks. Congestion Control ( Multipath TCP, TFRC, TFMCC, XCP, DCCP). Peer-to-peer systems. Biography Mark Handley FRS is Professor of Networked Systems at UCL in the Networks Research Group, which has a long history dating back to 1973 when UCL became the first site outside the United States to join the ARPAnet, which was the precursor to today's Internet. Prior to joining UCL, Professor Handley was based at the International Computer Science Institute in Berkeley, California, where he co-founded the AT&T Center for Internet Research at ICSI (ACIRI). Professor Handley has been very active in the area of Internet Standards, and has served on the Internet Architecture Board, which oversees much of the Internet standardisation process. He is the author of 33 Internet standards documents (RFCs), including the Session Initiation Protocol (SIP), which is the principal way telephony signalling is performed in Internet-based telephone networks. He came up with the concept and co-authored the standard for Multipath TCP, which allows connections to move seamlessly between networks, such as when a phone moves from WiFi to 5G. More recently he devised NDP and EQDS to allow datacenter networks to operate at high capacity. His startup developing EQDS was acquired by Broadcom in 2022, and the key elements from EQDS are now being standardized in the Ultra Ethernet Consortium to drive the next generation of very large AI networks. In Oct 2024 he joined OpenAI to work on very large scale AI clusters. Professor Handley's research interests include the Internet architecture (how the components fit together to produce a coherent whole), congestion control (how to match the load offered to a network to the changing available capacity of the network), Internet routing (how to satisfy competing network providers' requirements, while ensuring that traffic takes a good path through the network), and defending networks against denial-of-service attacks. He founded the XORP project to build a complete open-source Internet routing software stack. More recently he has worked on networking in megaconstellations such as SpaceX's Starlink network, and on large-scale high-performance datacenter networks for the most demanding AI workloads. Awards Elected Fellow of the Royal Society, 2019 ACM SIGCOMM Award, 2019, \"For fundamental contributions to Internet multimedia, multicast, congestion control, and multi-path networks, and the standardization of Internet protocols in these domains.\" USENIX NSDI Test of Time Award, 2022, for Design, Implementation and Evaluation of Congestion Control for Multipath TCP, published in 2011. ACM SIGCOMM Test of Time Award, 2014, for Internet Congestion Control for High Bandwidth-Delay Product Environments, published in 2002. IEEE Internet Award, 2012, for \"For contributions to Internet multicast, telephony, congestion control and the shaping of open Internet standards and open-source systems in all these areas.\" ACM SIGCOMM Test of Time Award, 2011, for \"A Scalable Content Addressable Network\", published in 2001 and one of the all-time top 20 most cited paper in Computer Science. BCS Roger Needham Award, 2007. Royal Society-Wolfson Research Merit Award, 2003. Professional Activities Member of the IETF Transport Area Directorate. I also served on the Routing Area Directorate from 2000-2009. Previously I was a member of the Internet Architecture Board (IAB). I chaired the IETF Multiparty Multimedia Session Control working group and the IRTF Reliable Multicast Research Group. Teaching Current teaching: ENGF0002 Design and Professional Skills COMP0023 Networked Systems COMP0019 Computer Systems Past teaching: 1010: Robotics Programming (login as Guest if you're not registered). Here's a video of the finals of the UCL 2012 Robot Races. GZ05: Multimedia Systems Programme Director for the Advanced MSc in Networked Computer Systems 3C03: Concurrency 3005: Operating Systems Internet Protocols Session Initiation Protocol (SIP, RFC 2543, RFC 3261), Session Description Protocol (SDP, RFC 2327), Session Announcement Protocol (SAP, RFC 2974), Protocol Independent Multicast-Sparse Mode (PIM-SM, RFC 2362), TCP-Friendly Rate Control (TFRC, RFC 3448), Multicast-Scope Zone Announcement Protocol (MZAP, RFC 2776), Multicast Address Allocation (RFC 2908, RFC 2909), TCP Congestion Window Validation ( RFC 2861), Reliable Multicast ( RFC 3451, RFC 3452, RFC 3453, RFC 3048), Datagram Congestion Control Protocol ( RFC 4340, RFC 4336), Multipath TCP ( RFC 6824, RFC 6356, RFC 6182). In real life... My interests are travel, mountains, skiing, sailing, mad science, most especially my wife and sons, and generally doing things that don't involve a computer. In a past life, I spent a lot of time riding motorcycles and flying gliders. Pictures of before breakfast at Sigcomm Vancouver, after dinner at the Oslo IETF, a little stroll after Sigcomm Kyoto.",
  "content_length": 5365,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:28"
}