{
  "name": "Markus Bohlin",
  "homepage": "http://www.ipr.mdh.se/staff/58-Markus_Bohlin",
  "status": "success",
  "content": "IDT - IPR MDH | IDT | ES | IPR | Admin HomePeoplePublicationsOrganizationProjectsOpen PositionsAbout IPRContactEventsNews MDH Home IDT Home IDT Education Markus Bohlin, Docent, Professor E-mail: markus.bohlin@mdh.se Phone: +46 16 15 32 95 Divisions: Division of Computer Science and Software Engineering Division of Networked and Embedded Systems Division of Product Realisation Research groups: Digital and Circular Industrial Services Industrial AI Systems Product and Production Development Software Testing Laboratory Web: Linkedin page BiographyResearchPublicationsProjectsPhD studentsMSc thesesMarkus is an experienced (20+ years) leader (14+ years) in in academia and industrial research with a background in leading and managing R&D groups, teams, portfolios, projects, bids, strategies, proposals and project sales, and experience from budgeting, recruiting, staffing and team development. His academic background is from applied AI in production systems, transportation, logistics, power generation and cyber-physical systems development. He defended his doctoral thesis in 2009 and was appointed as associate professor (docent) in 2013, both at Mälardalen University. Between 2012 and 2016 he served as president of the Swedish Operations Research Association. In 2014 he was appointed as adjunct professor in analysis of rail traffic systems at KTH Royal Institute of Technology, and served on the Trafikverket Board on Capacity in Railways. In 2019 he was appointed full professor in Computer Science with a focus on Applied Artificial Intelligence at Mälardalen University. He has acted as program chair and main organizer for several national and international conferences and workshops, including the 8th International Conference on Railway Operations Modelling and Analysis (ICROMA), the bi-annual Swedish Operations Research Conference (twice) and the annual Industrial Efficiency conference (four times). He serve as reviewer and PC member for several scientific journals and conferences. His work has been presented in more than 75 peer-reviewed papers in international journals, conferences and workshops. He serve on several national and international research boards and councils, and have participated as expert advisor in recruitments of senior faculty both nationally and internationally. He has leadership experience from organisations with up to 60 employees and more than 40 projects, including several H2020 and cluster projects, involving up to 20 people. He has supervised four PhD students until their PhD defence, 9 until their licentiate defense, and currently supervises five Ph.D. students. He currently serves as division manager for Product Realization at Mälardalen University, and as School Director for the INDTECH Industrial Graduate School.Research interests:Planning and schedulingMachine learningOptimization [Show all publications] [Google Scholar author page] Latest publications: Requirements Ambiguity Detection and Explanation with LLMs: An Industrial Study (Sep 2025) Sarmad Bashir, Alessio Ferrari , Muhammad Abbas Khan, Per Erik Strandberg, Zulqarnain Haider, Mehrdad Saadatmand, Markus Bohlin 41st International Conference on Software Maintenance and Evolution (ICSME 2025) Exploring Dynamic Map Validation at Construction Sites: A Case Study and Feasibility Analysis (Dec 2024) Anas Fattouh, Sara Afshar, Markus Bohlin 27th IEEE International Conference on Intelligent Transportation Systems (ITSC 2024) A Multilevel Modelling Framework for Quarry Site Operations (Apr 2024) Abdulkarim Habbab, Anas Fattouh, Bobbie Frank , Elianne Lindmark , Koteshwar Chirumalla, Markus Bohlin 12th ACM/IEEE International Workshop on Software Engineering for Systems-of-Systems and Software Ecosystems (SESoS 2024) Adopting a Digital Twin Framework for Autonomous Machine Operation at Construction Sites (Oct 2023) Philip Wickberg, Anas Fattouh, Sara Afshar, Markus Bohlin The 7th CAA International Conference on Vehicular Control and Intelligence (CVCI 2023) Mapping simulation optimization requirements for construction sites: A study in the heavy-duty vehicles industry (Oct 2023) Abdulkarim Habbab, Anas Fattouh, Bobbie Frank , Koteshwar Chirumalla, Markus Bohlin 64th International Conference of Scandinavian Simulation Society (SIMS 2023) Machine Learning Testing in an ADAS Case Study Using Simulation-Integrated Bio-Inspired Search-Based Testing (Jun 2023) Mahshid Helali Moghadam, Markus Borg , Mehrdad Saadatmand, Seyed Jalaleddin Mousavirad , Markus Bohlin, Björn Lisper Journal of Software: Evolution and Process (JSEP)Project TitleStatus AIDOaRt - AI-augmented automation for efficient DevOps, a model-based framework for continuous development At RunTime in cyber-physical systems finished ATAC - Advanced Test Automation for Complex Software-Intensive System (ITEA2/Vinnova) finished Global Constraints in Constraint Programming and Local Search finished IndTech Industrial Technology Graduate School active MITC - Mälardalen Industrial Technology Center active PG-Pla-OSC – Optimization, Synthesis and Configuration finished PROMPT - Professional Master’s in Software Engineering (step II) finished TOCSYC - Testing of Critical System Characteristics (KKS) finished TRUST-SOS - TRUSTed Site Optimisation Solutions finished TRUSTCM - TRUSTed decision-making system for Cognitive Manufacturing finished PhD students supervised as main supervisor: Abdulkarim Habbab Aleksandar Bajceta Ingrid Johansson (former) Jennifer Warg (former) Johan Högdahl (former) Kivanc Doganay Philip Wickberg Sara Gestrelius (former) Sarmad Bashir MSc theses supervised (or examined):Thesis TitleStatus Simulation-based optimization of dual non-crossing stacking cranes on-hold ﻿We are using cookies to give you the best experience on our site. Cookies are files stored in your browser and are used by most websites to help personalise your web experience.By continuing to use our website without changing the settings, you are agreeing to our use of cookies. close Mälardalen University | Box 325, 631 05 Eskilstuna | Box 883, 721 23 Västerås | +46-21-10 13 00, +46-16-15 36 00",
  "content_length": 6110,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:52"
}