{
  "name": "Mark Hoogendoorn",
  "homepage": "http://www.few.vu.nl/~mhoogen",
  "status": "success",
  "content": "Mark Hoogendoorn About me I am a Full Professor of Artificial Intelligence at the Department of Computer Science of the Vrije Universiteit Amsterdam and chair of the Quantitative Data Analytics group. My research focuses on machine learning and its applications, the latter primarily applied in the domain of health and wellbeing. The research ranges from more fundamental machine learning research (including efficiency, explainability, safety, incorporating domain knowledge, and hybrid intelligence) to application driven research focusing on for instance predictive modeling for diseases, personalized therapies and support systems, and eHealth and mHealth systems. My inaugural speech provides more detail, you can find it here. I am involved in a variety of research projects and teach several courses related to Artificial Intelligence and Machine Learning. In addition, I am the chair of the Examination Board (for the subcommittee for the Department of Computer Science) of the Faculty of Science. Next to my academic work, I have also founded the company PersonalAIze together with three colleagues to bring academic insights in the area of Machine Learning into practice. Before starting in the Quantitative Data Analytics group, I have been an Associate Professor in the Computational Intelligence group. I have also been a Visiting Scientist within the Clinical Decision Making Group headed by Peter Szolovits at MIT (CSAIL) during the Summer of 2015 and a PostDoc at the Department of Computer Science and Engineering at the University of Minnesota in the group of Maria Gini (Fall 2007). Before 2012 I was part of the Agent Systems Group at the VU. I obtained my PhD degree in 2007 from the Vrije Universiteit Amsterdam as well. Quantitative Data Analytics team Current QDA Team Emma Beauxis-Aussalet (Assistant Professor) Frank Bennis (PostDoc @ Amsterdam UMC) Elena Beretta (Assistant Professor) Laurens Biesheuvel (PhD student @ Amsterdam UMC) Bob Borsboom (Junior Lecturer) Tariq Dam (PhD student @ Amsterdam UMC) Anne Fischer (PhD student) Vincent Francois Lavet (Assistant Professor) Paul Hilders (PhD student @ Amsterdam UMC) Simon Ilic (PhD student @ CWI) Joshua Jaeger (PhD student @ University of Bern) Ameet Jagesar (PhD student @ Amsterdam UMC) Jacob Kooi (PhD student) Rutger van der Linden (PhD student) Aneta Lisowska (Assistant Professor) Current QDA Team (cont.) Andrei Lixandru (PhD student) Moos Middelkoop (PhD student @CWI) Olivier Moulin (PhD student) William Nkhono (PhD student) Martijn Otten (PhD student @ Amsterdam UMC) Luca Roggeveen (PhD student @ Amsterdam UMC) Louk Smalbil (PhD student) Luis Silvestrin (PhD student) Shahab Ud Din (PhD student) Bülent Ündes (PhD student) Floris de Vries (PhD student @ Amsterdam UMC) Tristan Warren (PhD student @ Radboud UMC) Zhao Yang (PostDoc) Shujian Yu (Assistant Professor) Xinrui Zu (PhD student) Former PhD students Arwin Gansekoele (PhD planned 17-09-2025) David Romero (PhD received 10-09-2024) Leonardos Pantiskas (PhD received 04-09-2024) Floris den Hengst (PhD received 14-11-2023) Jan Klein (PhD received 07-09-2023) Lucas Fleuren (PhD received 16-02-2023) Ali el Hassouni (PhD received 18-01-2022) Eoin Grua (PhD received 03-12-2021) Ward van Breda (PhD received 23-06-2020) Giorgos Karafotias (PhD received 24-02-2016) Robbert-Jan Merk (PhD received 06-02-2013) Fiemke Both (PhD received 05-06-2012) Rianne van Lambalgen (PhD received 03-04-2012) Muhammad Umair (PhD received 06-02-2012) Syed Waqar Jaffry (PhD received 09-09-2011) Research Projects Machine learning for intensive care (Amsterdam UMC) - improving treatments at the ICU using reinforcement learning Machine learning for the safety domain (Ministry of the Interior) - using machine learning techniques in the safety domain COCOON (HealthHolland) - prediction of pre-term birth with a variety of data sources IMPALA (EDCTP) - development of innovative sensors with machine learning algorithms timely detect and predict critical illness in low resource settings ICARE4OLD (H2020) - develop high quality decision support for better prognostication of health trajectories of elderly using machine learning Stress in Action (NWO) - understanding real life stress using state-of-the-art measurement devices and machine learning RECONNECTED (Horizon Europe) - improving resilience through digital interventions that are personalized through machine learning DESTRESS (NWO) - signaling stress in a work context using machine learning techniques CAREPATH (Horizon Europe) - improving medication adherence through personalized support using machine learning AIDA (ZonMW) - using machine learning techniques to increase the adherence and effectiveness of online self-help for alcohol abuse Teaching I teach several courses. Information regarding the courses I teach can be found on Canvas. I'm currently involved in teaching/coordinating the following courses: Data Mining Techniques Machine Learning for the Quantified Self Bedrijfscase Mini Master Project (coordinator) Committees/Network Organizations Management team member Amsterdam Medical Data Science Management team member VU Campus Center for AI & Health Chair of the Special Interest Group on Data Standards and Sharing in ISRII Senior Fellow of the Amsterdam Institute for Global Health (AIGHD) Member of Amsterdam Data Science Member of the Network Institute Member of Amsterdam Center for Business Analytics Program and Senior program committee member of a variety of AI conferences Contact details Address Vrije Universiteit Amsterdam Faculty of Science Department of Computer Science De Boelelaan 1111, (NU VU, room 10A87) 1081 HV Amsterdam The Netherlands Phone +31 20 5987772 Email m.hoogendoorn@vu.nl For publications, see Google Scholar",
  "content_length": 5757,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:29"
}