{
  "name": "Mark Manulis",
  "homepage": "http://manulis.eu",
  "status": "success",
  "content": "Prof. Dr. Mark Manulis Mark Manulis Home About me Research Teaching Projects Contact Welcome I am Full Professor at the Universität der Bundeswehr München in its Department of Computer Science and Research Institute Cyber Defence (CODE), where I head the Privacy and Applied Cryptography (PACY) Lab. This is my private website. My research and projects are on privacy-enhancing technologies underpinned by modern cryptographic methods and techniques. I am focusing on the design and analysis of cryptographic protocols and on their use to protect security and privacy in data processing, authentication, secure communications, and in decentralized, multi-party applications in the domains of social media, IoT, and blockchain. I am also teaching some of these topics on our Cyber Security MSc programme and supervising researchers. Feel free to contact me if you are interested in collaboration or professional advice. For open positions in PACY Lab check here. mark.manulis (at) unibw.de News 26.09.2025 I will be serving as PC Area Chair for Advanced Constructions at PKC 2026. 26.08.2025 \"Attribute-based Key Exchange with Optimal Efficiency\" accepted at CANS 2025. 09.07.2025 I gave invited talk \"Secure Cloud through Cryptography: Research Approaches to Encryption and Authentication\" at RI CODE Annual Conference 2025. 03.01.2025 \"Fast SNARK-based Non-Interactive Distributed Verifiable Random Function with Ethereum Compatibility\" accepted at ACM ASIACCS 2025. 11.11.2024 \"Distributed Asynchronous Remote Key Generation\" accepted at ACNS 2025. 01.09.2024 I was appointed as Visiting Professor at the University of Surrey from September 2024. 01.08.2024 \"FABESA: Fast (and Anonymous) Attribute-Based Encryption under Standard Assumption\" accepted at ACM CCS 2024. 05.06.2024 I gave invited talk \"Asynchronous Remote Key Generation (ARKG) and its Applications\" at SKECH 2024 in Bertinoro, Italy. 10.03.2024 I will be serving as Workshop Chair of ACNS 2025. 06.02.2024 \"Fully Homomorphic Encryption beyond IND-CCA1 Security: Integrity through Verifiability\" accepted at EUROCRYPT 2024. 10.01.2024 \"FEASE: Fast and Expressive Asymmetric Searchable Encryption\" accepted at Usenix Security Symposium 2024. 19.05.2023 IEEE Spectrum's article \"Satellite Signal Jamming Reaches New Lows\" features my comments. 10.05.2023 I am co-chairing PC of SECITC 2023. Submission deadline: 20.09.2023. 26.04.2023 I gave invited talk on \"Asynchronous Remote Key Generation and its Applications\" at the ASSURED Scientific Workshop. 03.04.2023 \"Asynchronous Remote Key Generation for Post-Quantum Cryptosystems from Lattices\" accepted at EuroS&P 2023. 03.04.2023 \"Generalised Asynchronous Remote Key Generation for Pairing-based Cryptosystems\" accepted at ACNS 2023. 23.01.2023 I am co-chairing PC of NSS 2013. Submission deadline: 03.03.2023. 23.01.2023 This year I am serving on the PCs of ACNS 2023, ACM ASIACCS 2023, and ESORICS 2023. 23.08.2022 \"Unlinkable Delegation of WebAuthn Credentials\" accepted at ESORICS 2022. 01.04.2022 \"Revocable Hierarchical Attribute-based Signatures from Lattices\" accepted at ACNS 2022. 01.03.2022 I joined Universität der Bundeswehr München as Professor in the Department of Computer Science and RI CODE. 06.09.2021 I gave a talk at IEEE EuroS&P's FoPI 2021 workshop on account recovery and delegation in FIDO2/WebAuthn. 18.03.2021 I gave invited talk at CYSAT 2021 on the security challenges for satellite constellations. Watch on [YouTube] 02.12.2020 A talk based on our work with Yubico has been accepted to Real World Crypto 2021. 22.11.2020 \"Password-Authenticated Searchable Encryption\" published in International Journal of Information Security. 16.11.2020 Yubico's blog article explains our joint work on the new protocol for WebAuthn credentials backup. 01.09.2020 I am now Head of Department of Computer Science at the University of Surrey. 26.08.2020 I joined the Editorial Board of IEEE Transactions on Information Forensics and Security\" (IEEE TIFS), IF 6.2 11.08.2020 \"An Interoperable Architecture for Usable Password-less Authentication\" accepted at ETAA@ESORICS2020 03.08.2020 \"Asynchronous Remote Key Generation: An analysis of Yubico’s proposal for W3C WebAuthn\" accepted at ACM CCS 2020 14.05.2020 \"Cyber Security in New Space\" appeared in International Journal of Information Security (Open Access) 13.05.2020 \"TAPESTRY: A De-centralized Service for Trusted Interaction Online\" appeared in IEEE Trans. on Services Computing 13.05.2020 I am co-chairing DETIPS 2020 workshop affiliated with ESORICS 2020. 13.05.2020 I'll be serving on the PCs of ACNS 2020, ESORICS 2020, and ISC 2020. Archive 26.12.2019 \"KYChain: User-Controlled KYC Data Sharing and Certification\" accepted at ACM SAC 2020 23.12.2019 I am chairing ESORICS 2020 Workshops. Call for Workshops is open! 11.11.2019 \"Biometric-Authenticated Searchable Encryption\" accepted at ACNS 2020. 24.06.2019 \"Enhancing Security and Dependability of Industrial Networks with Opinion Dynamics\" accepted at ESORICS 2019. 13.04.2019 \"pRate: Anonymous Star Rating with Rating Secrecy\" accepted at ACNS 2019. 13.04.2019 \"Hierarchical Attribute-based Signatures: Short Keys and Optimal Signature Length\" accepted at ACNS 2019. 13.04.2019 \"Bootstrapping Online Trust: Timeline Activity Proofs over Public Ledgers\" accepted at PENCIL@EUROCRYPT 2019. 05.02.2019 I'll be serving on the PCs of ACNS 2019, ACISP 2019, PENCIL, ISC 2019, and CANS 2019. 23.10.2018 I have been invited to join the Editorial Board of Springer's International Journal of Information Security. 25.07.2018 \"Hierarchical Attribute-based Signatures\" accepted at CANS 2018. 25.07.2018 \"Bootstrapping Online Trust: Timeline Activity Proofs\" accepted at DPM 2018 (co-located with ESORICS). 04.12.2017 I will be co-charing ISC 2018. 12.06.2017 \"Password Authenticated Keyword Search\" accepted at IEEE PAC 2017. 08.06.2017 Two new research projects have started: TAPESTRY (funded by EPSRC) and ABS4Cars (funded by NCSC). 21.09.2016 \"Secure Modular Password Authentication for the Web using Channel Bindings\" accepted by Springer's IJIS journal. 09.09.2016 Best Paper Award at ISC 2016 for our paper with Franziskus Kiefer from Mozilla. 27.06.2016 I gave invited talk on \"Authentication with Privacy for Connected Cars\" @ Connected Cars'16. 19.06.2016 ACNS 2016 proceedings appeared in Springer's LNCS 9696. 16.05.2016 \"Universally Composable Two-Server PAKE\" accepted at ISC 2016. 16.05.2016 \"Blind Password Registration for Two-Server Password Authenticated Key Exchange ...\" accepted at ISC 2016. 09.03.2016 \"Blind Password Registration for Verifier-based PAKE\" accepted at ACM ASIAPKC 2016. 13.01.2016 I'll be serving on the PC of ISC 2016. 10.12.2015 \"Public Key Encryption with Distributed Keyword Search\" accepted at InTrust 2015. 21.06.2015 \"Oblivious PAKE: Efficient Handling of Password Trials\" accepted at ISC 2015. 25.03.2015 SCCS becomes an Academic Centre of Excellence for Cyber Security Research. 17.03.2015 I'll be serving on the PCs of IMA Cryptography and Coding 2015 and WEWoRC 2015. 10.02.2015 I joined the Editoral Board of IET Information Security. 27.01.2015 I'll be serving on the PCs of ACISP 2015 and ProvSec 2015. 17.12.2014 Best Paper Award for \"Rerandomizable Threshold Blind Signatures\" at InTrust 2014. 05.09.2014 \"Secure Modular Password Authentication for the Web using Channel Bindings\" accepted at SSR 2014. 05.09.2014 \"A Modular Framework for Multi-Factor Authentication and Key Exchange\" accepted at SSR 2014. 01.08.2014 Our MSc Information Security degree receives GCHQ certification. Related media links: a| b| c| d| e 01.08.2014 \"Privacy-Enhanced Participatory Sensing with Collusion Resistance and Data Ag...\" accepted at CANS 2014. 01.07.2014 Our Surrey Centre for Cyber Security (SCCS) was officially launched today. 25.06.2014 \"Zero-Knowledge Password Policy Checks and Verifier-Based PAKE\" accepted at ESORICS 2014. 05.06.2014 Our department has an open tenure position in security. Application deadline: 30.06.2014. 15.04.2014 My comments for BBC News on the Heartbleed security bug in SSL. 16.03.2014 \"Distributed Smooth Projective Hashing and its Application to Two-Server Pass...\" accepted at ACNS 2014. 12.03.2014 My comments for Turkish Press on phone tapping in the UK. 18.02.2014 My comments for BBC News on the European data network proposal. 13.02.2014 University of Surrey launches a new \"MSc Information Security\". 03.12.2013 I'll be serving on the PC of ESORICS 2014. 19.11.2013 My comments for BBC News on the Yahoo's announcement to deploy encryption. 03.11.2013 \"Plaintext Awareness in Identity-Based Key Encapsulation\" accepted at Int. J. of Information Security. 26.10.2013 An interview with me on BBC News on the role of encryption in the modern world. 14.10.2013 \"Formalising Human Recognition: a Fundamental Building Block ...\" accepted at ACSW-AISC 2014. 23.09.2013 \"Publicly Verifiable Ciphertexts\" accepted at Journal of Computer Security. 02.09.2013 \"Unique Aggregate Signatures with Applications to Distributed Verifiable ...\" accepted at CANS 2013. 15.04.2013 \"Relations among Privacy Notions for Signcryption and Key Invisible ...\" accepted at ACISP 2013. 13.03.2013 I'll be serving on the PC of PKC 2014. 10.03.2013 Edited issue on \"Security and Privacy for Digital Ecosystems\" appeared in the ISTR journal. 26.02.2013 Journal article \"Forward-Secure Hierarchical Predicate Encryption\" accepted by The Computer Journal. 25.01.2013 \"Pseudorandom Signatures\" accepted at ACM ASIACCS 2013. 16.12.2012 Journal article \"Private Discovery of Common Social Contacts\" published in IJIS. 10.12.2012 I'll be serving on the PC of ACNS 2013. 17.06.2012 \"Publicly Verifiable Ciphertexts\" accepted at SCN 2012. 12.06.2012 Submission server of CANS 2012 is online. Submission date is 02.07.2012. 28.05.2012 I'll be serving on the PC of FC 2013. 13.05.2012 \"Topology-Driven Secure Initialization in Wireless Sensor Networks: A Tool-...\" accepted at ARES 2012 03.05.2012 I'll be serving on the ",
  "content_length": 16231,
  "method": "requests",
  "crawl_time": "2025-12-01 13:53:33"
}