{
  "name": "Martha White",
  "homepage": "https://webdocs.cs.ualberta.ca/~whitem",
  "status": "success",
  "content": "Martha White Martha White Home Research Teaching Code Calendar Contact Info Associate Professor Department of Computing Science University of Alberta Member of the Reinforcement Learning and AI Lab (RLAI) and of the Alberta Machine Intelligence Institute (Amii, pronounced like the name Amy) Canada CIFAR AI Chair (CIFAR pronounced See-Far) CEO of RLCore, a start-up developing RL for industrial automation (see https://rlcore.ai/) Office: UCOMM 7-243 Email: whitem at ualberta.ca Curriculum Vitae Bio and Photo Google scholar About My Research The objective of my research program is to develop prediction and control systems that learn and adapt during deployment. For example, consider an agent whose goal is to improve efficiency of a water treatment plant. One of the primary costs is in the operation of mixers. The agent is constantly making decisions about mixing speeds, and receiving feedback about energy use and clean water production rates. We want this agent to be sample efficient, meaning that, with minimal interaction, it can learn about how to modulate mixing speeds appropriately. We additionally want the agent to continually learn (improve) during operation. Towards this goal, I work in reinforcement learning. Specifically, my team focuses on: representation learning (sparse representations, recurrent architectures), planning with models based on options and value functions, off-policy learning to learn those model components, and better online control algorithms based on sound approximate policy iteration and action-value methods. See here for a list of relevant presentations. My Group Picture from 2019 Picture from 2020 Farzane Aminmansour (PhD) Brett Daley (PhD, co-supervised Marlos Machado) Esraa Elelimy (PhD) Eric Graves (PhD, co-supervised Rich Sutton) Anna Hakhverdyan (MSc) Jiamin He (PhD) Ehsan Imani (PhD) Andrew Jacobsen (PhD, co-supervised Ashok Cutkosky) Scott Jordan (Postdoc) Olya Mastikhina (MSc) Golnaz Mesbahi (MSc, co-supervised Adam White) Prabhat Nagarajan (PhD, co-supervised Marlos Machado) Kevin Roice (MSc, co-supervised Adam White) Haseeb Shah (PhD) Han Wang (PhD, co-supervised with Adam White) Lingwei Zhu (Postdoc) Alumni Zaheer Abbas (MSc 2020, now a Research Engineer at DeepMind) Farzane Aminmansour (MSc 2019, now PhD at UofA) Alvina Awwal (MSc 2023) Kirby Banman (MSc 2021, now Research Associate at UofA) James Bell (MSc 2019, now at Meta) Alan Chan (MSc 2020, now PhD at McGill) Wesley Chung (MSc 2019, now PhD at McGill) Dhawal Gupta (MSc 2021, now PhD at UMass) Shivam Garg (MSc, co-supervised Rupam Mahmood) Esraa Elelimy (MSc, 2023) Ehsan Imani (MSc 2019, now PhD at UofA) Andrew Jacobsen (MSc 2019, now PhD at UofA) Khurram Javed (MSc 2020, now PhD at UofA) Taher Jaferjee (MSc 2019) Maryam Hashemzadeh (MSc 2021, now PhD student at Mila) Kamran Janjua (MSc 2023, now ML Engineer at Huawei) Lei Le (PhD, now an Applied Scientist at Linkedin) Tadashi Kozuno (Postdoc, 2022, now Research Scientist at Omron Sinic X) Raksha Kumaraswamy (PhD, 2021, now Researcher at Sony AI) Sungsu Lim (MSc, 2019, now Senior Data Scientist at Tonal) Vincent Liu (MSc, 2019, and PhD 2023) Chunlok Lo (MSc, 2022, now Software Engineer at Riot Games) Erfan Miahi (MSc, 2022, cosupervised with Marlos Machado) Gabor Mihucz (MSc, now PhD at UofA) Somjit Nath (MSc, 2019, now a Researcher at TCS Research and Innovation) Ajin George Joseph (Post Doc, 2018-2019, now an Assistant Professor at IIT Tirupati) Omid Namaki (Research Associate, 2017-2019, now a Researcher at Amii) Ndidi Obinwanne (MSc, 2024) Yangchen Pan (PhD, 2021, co-supervised Amir massoud Farahmand, now Departmental Lecturer at Oxford) Andrew Patterson (PhD 2023, now ML Scientist at Amii) Yash Satsangi (Post Doc 2020, now an Assistant Professor at Tilburg University) Matthew Schlegel (PhD) Haseeb Shah (MSc, 2023) Hugo Luis Silva (MSc, 2023) Abdul Wahab (MSc, 2023) Sam Sokota (MSc, 2020, now PhD at CMU) Han Wang (MSc, 2020, now PhD at UofA) Niko Yasui (MSc, 2020, now PhD at UofA) About Me I love soccer, volleyball, snowboarding, snorkelling, outdoor activities, cooking, (board) games and, especially, reading sci-fi and fantasy.",
  "content_length": 4154,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:10"
}