{
  "name": "Martin Fränzle",
  "homepage": "https://uol.de//hs/mitarbeiterinnen-und-mitarbeiter/prof-dr-martin-fraenzle",
  "status": "success",
  "content": "Prof. Dr. Martin Fränzle // Universität Oldenburg Fk. II Department für Informatik Foundations and Applications of Systems of Cyber-Physical Systems Prof. Dr. Martin Fränzle Leitung Prof. Dr. M. Fränzle D122 (OFFIS) +49-441-9722 500 Sekretariat Kathrin Kuper D121 (OFFIS) +49-441-9722 501 Fax: +49-441-9722 502 Prof. Dr. Martin Fränzle Carl von Ossietzky Universität Oldenburg FK II - Department für Informatik Abteilung Foundations and Applications of Systems of Cyber-Physical Systems Escherweg 2 D - 26121 Oldenburg Raum: OFFIS D122 Tel.: + 49 441 9722 500 Fax: + 49 441 9722 502 E-Mail: martin.fraenzle@informatik.uni-oldenburg.de Hochschulausbildung 1983-1991: Studium der Informatik, Mathematik und Logik an der Christian-Albrechts-Universität Kiel; zeitglich Berufsausbildung und Tätigkeit im Rettungsdienst 1997: Promotion an der Technischen Fakultät der Christian-Albrechts-Universität Kiel (Preis für beste Dissertation der Technischen Fakultät der CAU Kiel Wissenschaftlicher Werdegang und berufliche Laufbahn 1989-1991: Wissenschaftliche Hilfskraft, Christian-Albrechts-Universität Kiel 1991-1997: Wissenschaftlicher Mitarbeiter am Institut für Informatik der Christian-Albrechts-Universität Kiel 1997-2000: Wissenschaftlicher Mitarbeiter (Post-Doc) am Department für Informatik der Carl von Ossietzky Universität Oldenburg, Mitglied der Forschungsgruppe Computerarchitekturen 2000-2002: Hochschulassistent (C1) am Department für Informatik der Carl von Ossietzky Universtität Oldenburg 2002-2004: Associate Professor am Department of Informatics and Mathematical Modelling der Dänischen Technischen Universtität in Kgs. Kyngby 03-04/2002: Gastprofessor an der Technischen Universität Tallinn, Estland 2004-03/2022: Professor am Department für Informatik der Carl von Ossietzky Universität Oldenburg und Leiter der Abteilung Hybride Systeme 2004-2015: Mitglied des Vorstands und Projektbereichskoordinator für den Projektbereich Hybride Systeme im Sonderforschungsbereich Transregio AVACS (SFB / TR 14 Automatische Verifikation und Analyse komplexer Systeme) 2004-2019: Vorstandsmitglied des Interdisziplinären Forschungszentrums Sicherheitskritische Systeme an der Carl von Ossietzky Universität Oldenburg 2006-2008: Velux-Gastprofessor an der Dänischen Technischen Universität seit 2011: regelmäßige Gastaufenthalte an der Chinesischen Akademie der Wissenschaften 2012-2021: Co-Sprecher des DFG geförderten Graduiertenkollegs SCARE (System Correctness under Adverse Conditions) an der Carl von Ossietzky Universität Oldenburg 2013-2015: Dekan der Fakultät II Informatik, Wirtschaft und Recht an der Carl von Ossietzky Universität Oldenburg 2016-2017: Gastaufenthalt an der Universität Oxford 2018-2021: Sprecher des F&E-Bereichs Verkehr des An-Instituts OFFIS e.v. 2020-2021: Vizepräsident für Forschung, Transfer und Digitalisierung der Carl von Ossietzky Universität Oldenburg seit 04/2022: Professor am Department für Informatik der Carl von Ossietzky Universität Oldenburg und Leiter der Abteilung Foundations and Applications of Systems of Cyber-Physical Systems Ein vollständiger Lebenslauf ist hier verfügbar. M. Fränzle’s research interests are in modelling, verification, and synthesis of reactive, real-time, and hybrid dynamics in embedded and cyber-physical systems. He has worked on the semantics of high-level modelling and specification languages and on decision problems and their application to verifying and synthesizing real-time and hybrid discrete-continuous systems including settings subject to stochastic disturbances. The complexity barrier rapidly hit by such automated verification and synthesis procedures has been attacked through extending bounded model checking to very expressive temporal logics, branching-time abstractions, and by developing SAT-modulo-theory techniques for arithmetic constraint solving and tailoring them to the specific formulae structures arising in different verification domains and in synthesis. Furthermore, SAT-modulo-theory techniques for arithmetic constraint solving have been extended to the undecidable domain of arithmetic constraints involving transcendental functions and ordinary differential equations as well as to stochastic variants facilitating the fully symbolic analysis of probabilistic hybrid systems. Another major line of research deals with robust notions of system correctness, i.e. with the construction of correctness certificates which remain valid under the ubiquitous kinds of disturbances like, e.g., manufacturing tolerances or incomplete information. Fundamental research on these topics has mostly been pursued within large collaborative research projects, like the Transregional Collaborative Research Center SFB-TR 14 AVACS (Automatic Verification and Analysis of Complex Systems) or recently the Research Training Group DFG GRK 1765 SCARE (System Correctness under Adverse Conditions). Applied research within, a.o., the recent projects IMoST (Integrated Modelling for Safe Transportation), SaLsA (Sichere autonome Logistik- und Tranportfahrzeuge im Außenbereich), and MoVeS (Modeling, Verification and Control of Complex Systems), as well as within two industrial research contracts with DENSO Automotive and Volkswagen addresses industrial application domains, which range from advanced driver assistance systems (IMoST) via self-driving transportation systems (SaLsA) to demand-response schemes in power supply networks (MoVeS). These lines of applied research are now extended within the Interdisciplinary Research Center Critical Systems Engineering for Socio-Technical Systems, where the safety impact of operator assistance both for maritime and road-bound transportation is investigated in cooperation with the pertinent industry within dedicated living labs. A recorded talk explaining some of my research interests can be found here. Most of my recent publications can be found in the AVACS publications database or, if not AVACS-related, on the group's own page. An (at least almost, perhaps missing recent additions)  complete list is available from here. Webmaster (Stand: 29.07.2024) |  Kurz-URL:Shortlink: https://uol.de/p35984 Zum Seitananfang scrollen Scroll to the top of the page",
  "content_length": 6206,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:23"
}