{
  "name": "Martin Burtscher",
  "homepage": "http://www.cs.txstate.edu/~mb92",
  "status": "success",
  "content": "Martin Burtscher / Home MARTIN BURTSCHER Professor 2015-present, ECL, CS, TX State Associate Professor 2010-2015, ECL, CS, TX State Research Scientist 2007-2010, ISS, ICES, UT Austin Assistant Professor 2000-2007, CSL, ECE, Cornell PhD (2000), Computer Science, CU Boulder MS (1996), Computer Science, ETH Zurich BS (1994), Computer Science, ETH Zurich Recent Research Highlights We just released our high-speed guaranteed-error-bounded lossy PFPL compressor for single- and double-precision floating-point data that is fully compatible between CPUs and GPUs. We released our fast and effective lossless compressors for single- and double-precision floating-point data that are fully compatible between CPUs and GPUs. LC, our tool for automatically generating high-performance data compressors, is now publicly available on GitHub. Follow the tutorial to try it out! We released the Indigo3 benchmark suite. It contains over 30,000 labeled buggy and bug-free parallel C, C++, OpenMP, and CUDA codes with lots of inputs. The suite is described in our TOPC'24 paper. Short Biography Martin Burtscher is a Professor in the Department of Computer Science at Texas State University. He received the BS/MS degree from ETH Zurich and the PhD degree from the University of Colorado at Boulder. Martin's current research focuses on the parallelization of graph algorithms and complex programs for GPUs as well as on the synthesis of high-speed lossy and lossless data-compression algorithms. He has co-authored nearly 150 peer-reviewed scientific publications, which have been cited over 7400 times. Martin is a distinguished member of the ACM and a senior member of the IEEE. Martin is among the top 2% of scientists worldwide in his field according to a study from Stanford. He has obtained millions of dollars in research funding from the DOE, NSF, DARPA, NVIDIA, Intel, and Microsoft. He has published papers in top venues like ASPLOS, HPDC, ICS, IPDPS, MICRO, PLDI, PPOPP, SC, and SIGMETRICS. He has received 2 best-paper awards and 4 research awards. He has presented 3 keynotes. He consistently receives some of his department's highest course evaluations. He has received 3 teaching awards, 3 favorite professor awards, and the university-wide 2025 Mariel M. Muir Excellence in Mentoring Award. He has served as faculty mentor for 4 assistant professors. He has co-founded and organized 17 workshops and tutorials. He served on the advisory board of 2 companies and has consulted for 6 companies. Current Research High-Performance Computing (HPC): GPU computing, parallel algorithm design, data compression, graph analytics, algorithm synthesis, performance optimization, energy efficiency The CS department at Texas State ranks in the top 25 nationally and the top 40 worldwide in HPC. If you are a interested in joining my research team, please follow the instructions here. Efficient Computing Laboratory Martin directs the Efficient Computing Laboratory (ECL). Its research goals are developing general strategies for parallelizing complex and irregular programs, creating techniques to automatically synthesize high-performance data-compression algorithms, and designing optimizations to improve performance and energy efficiency. Animations and more information are available here. Faster computations and better algorithms can help save lives, solve health problems, increase safety, improve the environment, and keep us connected. At this point, parallelization is the primary way to make more powerful and energy-efficient computers possible. As we are reaching the limits of human ability, automatic synthesis is the most promising avenue for creating new and improved algorithms. Projects LC (high-speed lossy data compression framework) [DOE/ASCR - DRS] PECOS (simulation of inductively coupled plasma torch) [DOE/NNSA - PSAAP III] CIVIC (verification of irregular parallel programs) [NSF/CCF - SHF] Publications GPU computing (graph analytics, recurrences, prefix scans, n-body, TSP) [IPCCC'25a] [SC'25a] [IA^3'25a] [IA^3'25b] [ICS'25] [IPDPS'25b] [SC'24] [IISWC'24a] [TOPC'24] [SC'23b] [SC'23c] [MCHPC'22] [TOPC'22] [PDSEC'22] [SC'21] [PPoPP'20] [TOPC'18] [HPDC'18] [ASPLOS'18] [AGRP'16a] [AGRP'16b] [PLDI'16] [HPPAC'16] [HCW'16] [Cluster'15] [PDPTA'15] [GPGPU'15a] [GPGPU'15b] [GPCDP'14] [IISWC'14] [NAS'14] [SAC'14] [GPGPU'14] [HPCwire'14] [IPCCC'13] [PASA'13] [PDPTA'13] [IPDPS'13b] [GPGPU'13] [PPoPP'13] [IISWC'12] [PPoPP'12] [PDPTA'11b] [GPGPU'11] [GCG'11] Parallel computing (parallelization, irregular programs, verification suite, tracing, race tolerance, HPC) [SOCC'25] [ICPP'25] [IJPP'25] [IISWC'24b] [EDULEARN'24] [IPDPSW'24] [SC'23a] [SC'22] [ISPASS'22] [PPoPP'21] [ICCAD'19] [Cluster'19] [ESPT'18] [EduHPC'18] [WOSET'18] [SIGCSE'15] [EduPDHPC'13] [IPDPS'13a] [ICS'12] [TC'12] [PPoPP'12] [PLDI'11] [LCPC'10] [PPoPP'10] [ISPASS'09] [PPoPP'09a] [PPoPP'09b] [LCPC'08] [EUROPAR'05] [PDPTA'05] [SC'04] [PDPTA'02] Data compression (homomorphic, progressive, floating-point data, execution traces, mobile data) [IPCCC'25b] [SC'25b] [DRBSD'25a] [DRBSD'25b] [DRBSD'25c] [ISPASS'25] [IPDPS'25a] [ASPLOS'25] [CoDaC'24] [ESSA'24] [DCC'24a] [DCC'24b] [IA^3'22] [DCC'18] [ACCN'17] [SC'16] [SPACE'16] [ICCCN'15] [TC'14] [MASCOTS'13] [TC'11] [CASES'10] [WebApps'10] [DCC'10] [ICCD'09] [DCC'09] [TC'09] [DCC'07a] [DCC'07b] [CAN'06] [DCC'06] [TC'05] [CGO'05] [SIGMETRICS'04] [PACT'03] Performance optimization, recommendation systems, classification, phase detection [CVIU'15] [DMIN'14] [3DOR'14] [PDPTA'11a] [ISPASS'11] [SC'10] [JPCS'09] [TG'09] [ISPASS'08] [IISWC'06] [MICRO'04] [PLDI'02] Prefetching and caching (multicore architectures, helper threading, 3D architectures) [HPCC'15] [TACO'06] [PACT'06] [D&T'05] [PACT'05] [TECHCON'05] [MSP'05] Computational brain-injury modeling (bioengineering, visualization, BIC) [BIOCOMP'12] [BIOCOMP'11] [BIOCOMP'08] [MSV'07] [SBC'07] [MSV'06] [SBC'05] [METMBS'05] [SBC'03] Value prediction (value predictors, energy/complexity efficient design, confidence estimators) [WISA'06] [CAN'05] [WDDD'05] [CF'05] [VPW'04] [TC'02] [CAN'02] [ICCD'00] [DISS'00] [PACT'99] [JILP'99] [PFDC'98] Software and Data CPU code: F-Diam (graph diameter) GPU code: ECL-MaxFlow (maximum flow), Fringe-SGC (subgraph counting), MG-MIS (maximal independent sets), ECL-MM (maximum matching), ECL-MST (minimum spanning tree), ECL-SCC (strongly connected components), MPLG (compressed in-memory graphs), SFP (VLSI routing), ECL-APSP (all pairs shortest paths), graphB+ (signed social network balancing), ECL-MIS (maximal independent sets), ECL-GC (graph coloring), ECL-CC (connected components), PLR (linear recurrences), SAM (prefix sums), MPC and GFC (compression), TSP_GPU (TSP), ECL-BH (n-body), FSM_GA (finite state machines) Benchmark suites: ECL-Suite (data-race-free GPU graph analytics), Indigo3 (parallel buggy and bug-free benchmarks), Indigo2 (parallel benchmarks), Indigo (parallel microbenchmarks), LonestarGPU (irregular GPU code), Lonestar (irregular CPU code) Energy/Performance: SyncPerformance (synchronization primitives), Bit-Flips (bit-flip minimization), K20Power (GPU power profiler), PerfExpert/AutoSCOPE (bottleneck diagnosis) FP compression: PFPL (lossy), FPcompress (lossless), FPcrush, SPDP (tool), SPDP (HDF5), MPC, GFC, gFPC, pFPC, FPC, DP data, SP data Lossless compression: LICO (image compression) Parallelization systems: Parla (heterogeneous tasking system), ILCS (iterative local searches) Sequence mining: CBBT (phase detection), patterns (frequent subsequences) Trace compression: TCgen (compressor generator), VPC3 (compression algorithm) Brain-injury modeling: TBI (model, BIC, animations) Teaching Material Lecture slides: Teaching modules (introduction to parallel programming for undergraduates) Programming projects: Peachy assignments (computing a movie of zooming into a fractal) Professional Activities Committee Member: ICS'26, ASPLOS'26, HPCA'26, IWBDR'25, IA^3'25, MICRO'25, ICS'25, ASPLOS'25, DRBSD'24, IA^3'24, HPCBugsFest'24, IISWC'24, CoDaC'24, IISWC'23, DRBSD'23, ISCA'23, HPCA'23, DRBSD'22, IISWC'22, ISCA'22, IWBDR'21, DRBSD'21, MICRO'21, ISCA'21, ISPASS'21, DRBSD'20, IWBDR'20, DRBSD'19, GPGPU'19, DRBSD'18b, DRBSD'18a, GPGPU'18, PPoPP'18, DRBSD'17b, EuroPar'17, DRBSD'17a, GPGPU'17, PPoPP'17, EduHPC'16, GPGPU'16, Cluster'15, PLDI'15, PPoPP'15, PLDI'14, PPoPP'14, GPGPU'13, PPoPP'13, GPGPU'12, PPoPP'12, PACT'11, ICSEC'11, PLDI'11, HPCA'11, PPoPP'10, ISCA'09, PPoPP'09, IISWC'08, MSPC'06, IISWC'05, CGO'05, ICS'02 Workshops & Tutorials: TUES1, COT5, COT4, PET5, COT3, PET4, PET3, COT2, PET2, COT1, PET1, VPW2, VPW1 Distinguished Member of the ACM; Senior Member of the IEEE and IEEE CS; Member of the NCWIT Current ECL members Martin Burtscher: Director Cameron Bradley: Parallel graph analytics (PhD) Brandon Burtchell: Adaptive data compression (PhD) Alex Fallin: Lossy data compression (PhD) Andres Gonzalez: Parallel graph algorithms (PhD) Jim McArdle: Parallel programming (PhD) Andrew Rodriguez: High-speed data compression (PhD) Bishal Sharma: Parallelizing irregular codes (PhD) Andrew Solis: Parallel graph algorithms [TACC] Avery Vanausdal: Parallel benchmarks (PhD) A few words from former ECL members Yiqian Liu: PhD researcher [video] Kristi Belcher: undergraduate researcher [video] Sindhu Devale: graduate researcher [video] Andres Gonzalez: graduate researcher [video] Sepideh Maleki: graduate researcher [video] Arthi Nagarajan: graduate researcher [video] Jarim Seo: graduate researcher [video] Dean Terrell: undergraduate researcher [video] Aarti Kothari: graduate researcher [video] Former thesis/dissertation students Marco Franzreb: Wavelet trees on GPUs (MS'25) [University of Stuttgart] Mackenzie Toliver: Small-file data compression (BS'24) Noushin Azami: Lossless parallel data compression (PhD'24) Yiqian Liu: Benchmark suites of irregular parallel programs (PhD'24) Ghadeer Alabandi: Parallel graph analytics (PhD'23) Kian ORyan: Multi-GPU clustering (MS'23) Benila Jerald: Optimal TSP solv",
  "content_length": 12971,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:20"
}