{
  "name": "Martin Vingron [MG]",
  "homepage": "https://www.molgen.mpg.de/93952/vingron-lab",
  "status": "success",
  "content": "Vingron Lab Regulatory Genomics Vingron Lab If you are interested in pursuing a Ph.D. with us, please consider applying to our Internationational Max Planck Research School Biology And Computation (IMPRS-BAC).The transcriptional regulation group pursues methods development and collaborative data analysis in the fields of transcription factor-based and epigenetic gene regulation, and works on analysis of genomic sequences in search for regulatory effects of mutations. We try to closely integrate theoretical efforts with applications in a tight feedback loop, where concrete data analysis projects suggest methodical developments and new methods get tested in our collaborations. We develop methods for construction of biological networks and apply statistical and machine learning methods to a variety of data analysis and data integration tasks. Research Our projects Team The people behind the science Martin Vingron Group Leader Selected Publications Our top publications All Publications Our publications with Max Planck affiliation and outside the Max Planck Society PhD Theses Completed PhD theses Vingron Lab Research Team Martin Vingron Selected Publications All Publications PhD Theses Contact Foto: D. Ausserhofer Prof. Dr. Martin Vingron Scientific member, Director (030) 8413 1150 vingron@... Martina Lorse (030) 8413 1151 +49 30 8413 1152 vinoffic@... Vingron Lab Arndt Lab Herwig Lab Recent Publications 1. Aksu, E. D.; Vingron, M.: Context-aware sequence-to-function model of human gene regulation. (2025) MPG.PuRe DOI pre-print 2. Schwämmle, T.; Noviello, G.; Kanata, E.; Froehlich, J. J.; Bothe, A. M.; Martitz, A.; Altay, A.; Scouarnec, J.; Feng, V.-Y.; Mallie, H. et al.; Vingron, M.; Schulz, E. G.: Reporter CRISPR screens decipher cis-regulatory and trans-regulatory principles at the Xist locus. Nature Structural & Molecular Biology (2025) MPG.PuRe DOI publisher-version 3. Schindler, M.; Feregrino, C.; Aldrovandi, S.; Lo, B.-W.; Monaco, A. A.; Ringel, A. R.; Morales, A. E.; Zehnder, T.; Behncke, R. Y.; Glaser, J. et al.; Barclay, A.; Andrey, G.; Kragesteen, B. K.; Hägerling, R.; Haas, S.; Vingron, M.; Ulitsky, I.; Marti-Renom, M. A.; Hechavarria, J.; Fasel, N.; Hiller, M.; Lupiáñez, D. G.; Mundlos, S.; Martinez Real, F.: Comparative single-cell analyses reveal evolutionary repurposing of a conserved gene programme in bat wing development. Nature Ecology & Evolution (2025) MPG.PuRe DOI publisher-version Web-View Print Page Open in new window Estimated DIN-A4 page-width Go to Editor View",
  "content_length": 2526,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:46"
}