{
  "name": "Martin Radetzki",
  "homepage": "https://www.iti.uni-stuttgart.de/en/chairs/embedded-systems/people/martin-radetzki.html",
  "status": "success",
  "content": "Prof. Dr.-Ing. Martin Radetzki | Institute of Computer Architecture and Computer Engineering | University of Stuttgart jump to content jump to footer back close navigation For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Martin Radetzki Prof. Dr.-Ing. Chair of Embedded SystemsInstitute of Computer Architecture and Computer EngineeringEmbedded Systems Contact +49 711 685 88270 +49 711 685 88287 Email Pfaffenwaldring 5b D-70569 Stuttgart Deutschland Room: 1.004 Office Hours Thursdays: 14:00 - 15:00 Publications 2024Synergistic Floorplanning and Routing Topology Co-design for Application-Specific NoC Synthesis. Shuang Liu and Martin Radetzki. In 2024 IEEE 17th International Symposium on Embedded Multicore/Many-core Systems-on-Chip (MCSoC), 2024, pp. 179–186. DOI: https://doi.org/10.1109/MCSoC64144.2024.00039AbstractBibTeXDOIAbstractNetwork-on-Chip (NoC) offers a promising solution for on-chip communication in highly integrated System-on-Chips (SoCs). NoCs can be designed with either regular or application-specific network topologies. While regular topologies are easy to design, they are not ideal for systems with heterogeneous processing elements (PEs) that vary in size. The design of application-specific NoCs, however, involves several interrelated problems that impact each other. This work addresses the challenges in the synthesis of application-specific NoCs by proposing an Integer Linear Programming (ILP) framework. This framework enables the co-design of major problems, including floorplanning, routing topology generation, routing path construction, and application mapping. Although the ILP framework can be applied to each problem individually or in a stepwise manner, the co-design of these interconnected problems allows synthesis steps to interact, enabling designers to explore the entire design space. Using this framework, we have analyzed various design configurations in the synthesis of application-specific NoCs.BibTeX@inproceedings{10819523, abstract = {Network-on-Chip (NoC) offers a promising solution for on-chip communication in highly integrated System-on-Chips (SoCs). NoCs can be designed with either regular or application-specific network topologies. While regular topologies are easy to design, they are not ideal for systems with heterogeneous processing elements (PEs) that vary in size. The design of application-specific NoCs, however, involves several interrelated problems that impact each other. This work addresses the challenges in the synthesis of application-specific NoCs by proposing an Integer Linear Programming (ILP) framework. This framework enables the co-design of major problems, including floorplanning, routing topology generation, routing path construction, and application mapping. Although the ILP framework can be applied to each problem individually or in a stepwise manner, the co-design of these interconnected problems allows synthesis steps to interact, enabling designers to explore the entire design space. Using this framework, we have analyzed various design configurations in the synthesis of application-specific NoCs.}, abteilung = {es}, author = {Liu, Shuang and Radetzki, Martin}, booktitle = {2024 IEEE 17th International Symposium on Embedded Multicore/Many-core Systems-on-Chip (MCSoC)}, doi = {10.1109/MCSoC64144.2024.00039}, issn = {2771-3075}, month = {12}, pages = {179-186}, publisher = {IEEE}, title = {Synergistic Floorplanning and Routing Topology Co-design for Application-Specific NoC Synthesis}, year = 2024 }DOI10.1109/MCSoC64144.2024.00039Integer Linear Programming Based Design of Deadlock-Free Routing for Chiplet-Based Systems. Shuang Liu and Martin Radetzki. In 2024 IEEE 37th International System-on-Chip Conference (SOCC), 2024, pp. 1–6. DOI: https://doi.org/10.1109/SOCC62300.2024.10737713AbstractBibTeXDOIAbstractChiplet-based systems have become prominent in large Systems-on-Chips (SoCs) as a means to mitigate increasing design costs. However, the integration of multiple chiplets introduces new challenges in the interconnection network, potentially leading to deadlocks. In this paper, we propose an Integer Linear Programming (ILP) based design approach to address this issue. Our method considers various design factors for deadlock-free routing, such as topology, latency, load balancing, path diversity, and fault tolerance, applicable to both general-purpose chiplets and application-specific chiplets. It facilitates the determination of optimal turn restrictions for general-purpose chiplets or constructs optimal deadlock-free routing paths for application-specific chiplets if the communication patterns are known. The results demonstrate the capability of the method to find optimal solutions under various design considerations.BibTeX@inproceedings{10737713, abstract = {Chiplet-based systems have become prominent in large Systems-on-Chips (SoCs) as a means to mitigate increasing design costs. However, the integration of multiple chiplets introduces new challenges in the interconnection network, potentially leading to deadlocks. In this paper, we propose an Integer Linear Programming (ILP) based design approach to address this issue. Our method considers various design factors for deadlock-free routing, such as topology, latency, load balancing, path diversity, and fault tolerance, applicable to both general-purpose chiplets and application-specific chiplets. It facilitates the determination of optimal turn restrictions for general-purpose chiplets or constructs optimal deadlock-free routing paths for application-specific chiplets if the communication patterns are known. The results demonstrate the capability of the method to find optimal solutions under various design considerations.}, abteilung = {es}, author = {Liu, Shuang and Radetzki, Martin}, booktitle = {2024 IEEE 37th International System-on-Chip Conference (SOCC)}, doi = {10.1109/SOCC62300.2024.10737713}, issn = {2164-1706}, month = {09}, pages = {1-6}, publisher = {IEEE}, title = {Integer Linear Programming Based Design of Deadlock-Free Routing for Chiplet-Based Systems}, year = 2024 }DOI10.1109/SOCC62300.2024.107377132023Systematic Construction of Deadlock-Free Routing for NoC Using Integer Linear Programming. Shuang Liu and Martin Radetzki. In 2023 IEEE 16th International Symposium on Embedded Multicore/Many-core Systems-on-Chip (MCSoC), Singapore, 2023, pp. 332–339. DOI: https://doi.org/10.1109/MCSoC60832.2023.00056BibTeXDOIBibTeX@inproceedings{liu2023systematic, abteilung = {es}, affiliation = {Liu, S (Corresponding Author), Univ Stuttgart, Inst Comp Architecture \\& Comp Engn, Embedded Syst, Stuttgart, Germany. Liu, Shuang; Radetzki, Martin, Univ Stuttgart, Inst Comp Architecture \\& Comp Engn, Embedded Syst, Stuttgart, Germany.}, author = {Liu, Shuang and Radetzki, Martin}, booktitle = {2023 IEEE 16th International Symposium on Embedded Multicore/Many-core Systems-on-Chip (MCSoC)}, doi = {10.1109/MCSoC60832.2023.00056}, eventdate = {2023-12-18/2023-12-21}, eventtitle = {2023 IEEE 16th International Symposium on Embedded Multicore/Many-core Systems-on-Chip (MCSoC)}, isbn = {{979-8-3503-9361-3} and {979-8-3503-9362-0}}, language = {eng}, pages = {332-339}, publisher = {IEEE}, research-areas = {Computer Science}, title = {Systematic Construction of Deadlock-Free Routing for NoC Using Integer Linear Programming}, unique-id = {WOS:001190988000048}, venue = {Singapore}, year = 2023 }DOI10.1109/MCSoC60832.2023.000562021Comprehensive modeling and evaluation of Network-on-Chip performability. Jie Hou and Martin Radetzki. In Methods and Description Languages for Modelling and Verification of Circuits and Systems, MBMV 2021, 24th Workshop, Virtual Event, Germany, 2021, pp. 1–12.BibTeXLinkBibTeX@inproceedings{DBLP:conf/mbmv/HouR21, abteilung = {es}, address = {Virtual Event, Germany}, author = {Hou, Jie and Radetzki, Martin}, bibsource = {dblp computer science bibliography, https://dblp.org}, booktitle = {Methods and Description Languages for Modelling and Verification of Circuits and Systems, {MBMV} 2021, 24th Workshop}, day = {18-19}, eventdate = {March 18-19}, month = {03}, pages = {1--12}, publisher = {{VDE/IEEE}}, title = {Comprehensive modeling and evaluation of Network-on-Chip performability}, url = {https://ieeexplore.ieee.org/document/9399719}, year = 2021 }Linkhttps://ieeexplore.ieee.org/document/93997192019Combined MPSoC Task Mapping and Memory Optimization for Low-Power. Manuel Strobel; Gereon Führ; Martin Radetzki and Rainer Leupers. In Proc. IEEE Asia Pacific Conference on Circuit and Systems (APCCAS), Bangkok, Thailand, 2019.BibTeXBibTeX@inproceedings{StrobeFRL2019, abteilung = {es}, address = {Bangkok, Thailand}, author = {{Strobel}, Manuel and {Führ}, Gereon and {Radetzki}, Martin and {Leupers}, Rainer}, booktitle = {Proc. IEEE Asia Pacific Conference on Circuit and Systems (APCCAS)}, day = {11--14}, location = {Bangkok, Thailand}, month = {11}, title = {Combined MPSoC Task Mapping and Memory Optimization for Low-Power}, year = 2019 }Design-Time Memory Subsystem Optimization for Low- Power Multi-Core Embedded Systems. Manuel Strobel and Martin Radetzki. In Proceedings of the 2019 IEEE 13th International Symposium on Embedded(MCSoC), Singapore, 2019. DOI: https://doi.org/10.1109/MCSoC.2019.00056BibTeXDOIBibTeX@inproceedings{StrobeR2019a, abteilung = {es}, address = {Singapore}, author = {{Strobel}, Manuel and {Radetzki}, Martin}, booktitle = {Proceedings of the 2019 IEEE 13th International Symposium on Embedded(MCSoC)}, day = {1--4}, doi = {10.1109/MCSoC.2019.00056}, location = {Singapore}, month = {10}, title = {Design-Time Memory Subsystem Optimization for Low- Power Multi-Core Embedded Systems}, year = 2019 }DOI10.1109/MCSoC.2019.00056A Machine Learning Enabled Long-Term Performance Evaluation Framework for NoCs. Jie Hou; Q. Han and Martin Radetzki. In Proceedings of the 2019 IEEE 13th International Sy",
  "content_length": 93946,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:43"
}