{
  "name": "Martin Erwig",
  "homepage": "http://eecs.oregonstate.edu/~erwig",
  "status": "success",
  "content": "Martin Erwig's Home Page Martin Erwig Stretch Professor of Computer Science School of Electrical Engineering and Computer Science Oregon State University Corvallis, Oregon 97331-3202 Email: erwig [at] oregonstate.edu Phone: Fax: (541) 737-8893 (541) 737-1300 Office: Kelley Engineering Center 3045 (Map) Research My research interests are centered around the following topics: Language Design and Domain-Specific Languages Functional Programming Visual Languages CS Education An overview of some of my research projects can be found here. Activities I am an Editorial Board Member of the Journal of Computer Languages, an Associate Editor of the Journal of Visual Language and Computing, and a member of the SLE steering committee. Previously, I have been General Chair of DMSVIVA 2025, GPCE 2020, VL/HCC 2009 and and Program (Co-)Chair of the following conferences: DMSVIVA 2024, PEPM 2016, SLE 2013, VL/HCC 2012, VL/HCC 2005, FOS 2004, HCC/VMPSE 2002, ASDM 2000. I have also been a member of the program committees for the following conferences and workshops: VL/HCC 2025, SLE 2025, DMSVIVA 2025, VL/HCC 2024, GPCE 2024, VL/HCC 2023, GPCE 2023, DMSVIVA 2023, PADL 2022, DMSVIVA 2022, GPCE 2021, VL/HCC 2021, DMSVIVA 2021, IFL 2020, VL/HCC 2020, DMSVIVA 2020, VL/HCC 2019, DMSVIVA 2019, POPL 2019, SNAPL 2019, VL/HCC 2018, SEMS 2018, DMSVIVA 2018, ICFP 2017, Haskell Symposium 2017, DMSVLSS 2017, SEMS 2017, GPCE 2016, SLE 2016, FOSD 2016, VaMoS 2016, ECOOP 2016, VL/HCC 2016, SEMS 2016. FMSPLE 2016, IFL 2015, VaMoS 2015, GPCE 2014, SLE 2014, VL/HCC 2014, DSLDI 2014, FOSD 2014, VaMoS 2014, FOSD 2013, GPCE 2013, VL/HCC 2013, VaMoS 2013, FOSD 2012, PPDP 2012, PEPM 2012, VaMoS 2012, VL/HCC 2011, IFL 2011, FOSD 2011, PADL 2011, VaMoS 2011, TFP 2010, VL/HCC 2010, GPCE 2009, DSL 2009, SEEUP 2009, VL/HCC 2008, IFL 2008, VL/HCC 2007, RULE 2006, VL/HCC 2006, VL/HCC 2004, VLFM 2003, VDB 2002, COSIT 2001, IFL 1999, COSIT 1999, IFL 1997. Publications List of Papers List of Abstracts Books Find it on Amazon: Once Upon an Algorithm: How Stories Explain Computing MIT Press Home Page (contains additional teaching material) Get the Audiobook Haskell code plus introduction with exercises (currently for the first 5 chapters) Free teaching material Spanish, Korean, Japanese, Polish, Russian, Portuguese, and Chinese translation. A short video review by Steve Donoghue (book reviewer for the Washington Post) Review in Times Higher Education London School of Economics Business Review An SMBC comic based on the book My Chatham House talk on algorithms My The World Today article on algorithms My TV interview on the \"Afternoon Live\" show on KATU My radio interview on XRAY FM (starts at 1:51:33) My interview with Chris Richardson on the \"This is not a pipe\" podcast (YouTube version) American Book Fest Award Winner: 2017 Best Book Award in the category Education/Academic 2018 PROSE Award Honorable Mention in the category Computing and Information Sciences Find it on Amazon: Programming Language Fundamentals - A Metalanguage Approach in Elm Wiley Home Page (contains additional teaching material) Grundlagen funktionaler Programmierung (in German) Übersetzerbau: Techniken, Werkzeuge, Anwendungen (in German) (Mostly Older) Projects ... Software The Functional Graph Library The Discrete Interval Encoding Tree Probabilistic Functional Programming in Haskell The Variation Programming DSL (as part of the Choice Calculus project) Embedding Rule Systems in Haskell A Recursion and Traversal Library for Haskell Search Programming in Haskell Parametric Fortran Metamorphic Programming in Haskell FoXQ - A Form-Based Visual XQuery Office Hours (Fall 2025) Mondays: 2:00 p.m. - 3:00 p.m. (Zoom) Wednesdays: 11:00 a.m. - noon (KEC 3045) Or by appointment",
  "content_length": 3751,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:23"
}