{
  "name": "Martin Ding Fat Wong",
  "homepage": "https://www.hkbu.edu.hk/en/about/university-officers/professor-martin-wong.html",
  "status": "success",
  "content": "Professor Martin WONG Close Search Search ideas Internship Campus Map Scholarships Financial Assistance Library Alumni Giving to HKBU Art Tech BUhub Close University Officers Professor Martin WONG Provost Professor Martin DF Wong received his BSc degree in Mathematics from the University of Toronto in 1979 and his MS degree in Mathematics from the University of Illinois at Urbana-Champaign (UIUC) in 1981. He obtained his PhD degree in Computer Science from UIUC in 1987. In August 1987, he joined the University of Texas at Austin (UT-Austin) as a faculty member in the Department of Computer Science. He was Assistant Professor from 1987 to 1993, Associate Professor from 1993 to 1999, and Full Professor from 1999 to 2002. He was the holder of the endowed chair appointment as the David Bruton Jr. Centennial Professor of Computer Science until he left UT-Austin for UIUC in August 2002. Professor Wong returned to UIUC as a Full Professor in the Department of Electrical and Computer Engineering. He later was appointed as the Executive Associate Dean of the College of Engineering and the Edward C. Jordan Professor of Electrical and Computer Engineering, and stayed at UIUC until he joined The Chinese University of Hong Kong in January 2019 as the Dean of the Faculty of Engineering and the Choh-Ming Li Professor of Computer Science and Engineering. Professor Wong joined Hong Kong Baptist University (HKBU) in August 2023 as the Provost of HKBU and a Chair Professor of Computer Science. Professor Wong is a world-renowned scholar in the area of Electronic Design Automation (EDA) where he has made significant contributions in the algorithmic aspects of the physical design of silicon chips. A prolific scholar, he has published over 500 technical papers at top EDA journals and conferences. He has supervised and graduated over 50 PhD students, and many of them now hold leadership positions in the industry and academia. Professor Wong has won many best paper awards and EDA software contests at premier Association for Computing Machinery (ACM)/Institute of Electrical and Electronic Engineers (IEEE) journals/conferences. He also supervised four PhD dissertations that won major best PhD dissertation awards from the European Design and Automation Association or ACM/SIGDA. At the 50th anniversary of the ACM/IEEE Design Automation Conference in 2013, he was given two major awards recognising him as one of the most prolific authors in the 50 years’ history of the conference, ranking top 10 both in terms of the number of papers published and the number of consecutive years of publication at the conference. At the 20th anniversary (2015) and the 25th anniversary (2020) of the IEEE Asia and South Pacific Design Automation Conference, he was given the Most Prolific Author Award, recognising him as one of the top three authors who had published the highest number of papers in the history of the conference. In 2018 and 2019, his open-source software DtCraft, Cpp-Taskflow, and OpenTimer were separately recognised as the best open-source software at three major international conferences. Professor Wong has served on numerous steering/technical programme committees of leading EDA conferences. He has also served on the editorial boards of IEEE Transactions on Computers and Computer-Aided Design, and ACM Transactions on Design Automation of Electronic Systems. In 2011, he received an ACM SIGDA Distinguished Service Award. He was an IEEE Distinguished Lecturer from 2005-2006. In 2015, he was given the inaugural Synopsys EDA Research Award. In 2017, he was given the Distinguished Alumni Educator Award in Computer Science at UIUC. Professor Wong is a Fellow of ACM and a Fellow of IEEE for his contributions to the algorithmic aspects of EDA. In December 2019, he was elected as Fellow of the Hong Kong Academy of Engineering Science. prov@hkbu.edu.hk Back We use Cookies to give you a better experience on our website. By continuing to browse the site without changing your privacy settings, you are consenting to our use of Cookies. For more information, please see our Privacy Policy Statement and Personal Information Collection Statement. Accept ✕",
  "content_length": 4181,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:17"
}