{
  "name": "Martin Grohe",
  "homepage": "https://www.lics.rwth-aachen.de/cms/LICS/Der-Lehrstuhl/Team/Dozierende/~ocwf/Martin-Grohe",
  "status": "success",
  "content": "Martin Grohe | LICS | RWTH Aachen University | DE Prof. Dr. rer. nat. Martin Grohe Universitätsprofessor Bild © Martin Braun Lehrstuhl für Logik und Theorie diskreter Systeme (Informatik 7) Gebäude: E1, 1. Etage Raum: 4116a Ahornstraße 55 52074 Aachen Work Telefon: +49 241 80-21700 Work grohe@informatik.rwth-aachen.de Sprechstunde Dienstags 14:00 - 15:00 Es ist normalerweise eine gute Idee, sich vorher kurz per Email anzumelden, weil ich manchmal verhindert bin (z. B. auf Dienstreisen). Im Semester bin ich aber in der Regel zur Sprechstunde in meinem Büro, und Sie können gerne auch einfach unangekündigt vorbeikommen. Forschungsinteressen Algorithmen und Komplexität, Logik, Datenbanktheorie, Graphentheorie, Maschinelles Lernen Bücher Titel Autor(en) Erschienen Descriptive Complexity, Canonisation, and Definable Graph Structure Theory Martin Grohe Lecture Notes in Logic, Volume 47. Cambridge University Press, 2017 Preliminary draft, 2013 Model Theoretic Methods in Finite Combinatorics Martin Grohe, Janos Makowsky (Ed.) Contemporary Mathematics 558, American Mathematical Society, 2011 Parameterized Complexity Theory Martin Grohe, Jörg Flum Springer-Verlag, 2006 Einleitung Inhaltsverzeichnis Kapitel 1 Publikationen Titel Autor(en) Erschienen in Automorphism groups of graphs of bounded Hadwiger number M. Grohe, P. Schweitzer, and D. Wiebking Advances in Combinatorics, 2025:9 arXiv:2012:14300 Compressing CFI Graphs and Lower Bounds for the Weisfeiler-Leman Refinements Martin Grohe, Moritz Lichter, Daniel Neuen, and Pascal Schweitzer Journal of the ACM 72(3), 2025 Conference version in Proceedings of the 64th Annual IEEE Symposium on Foundations of Computer Science, 2023 arXiv:2308.11970 Homomorphism Tensors and Linear Equations Martin Grohe, Gaurav Rattan and Tim Seppelt Advances in Combinatorics, 2025 Conference version in Proceedings of the 49th International Colloquium on Automata, Languages, and Programming, 2022 arxIv:2111.11313 Exploring data augmentation: multi-task methods for molecular property prediction Muhammad Bin Javaid, Timo Gervens, Alexander Mitsos, Martin Grohe, Jan G. Rittig Computers and Chemical Engineering 201, 2025 Query Languages for Neural Networks Martin Grohe, Christoph Standke, Juno Steegmans, Jan van den Bussche Proceedings of the 28th International Conference on Database Theory, 2025 arXiv:2408.10362 GraphXForm: Graph transformer for computer-aided molecular design with application to extraction Jonathan Pirnay, Jan G. Rittig, Alexander B. Wolf, Martin Grohe, Jakob Burger, Alexander Mitsos, Dominik G. Grimm Digital Discovery 4:1052-1065, 2025 arXiv:2411.01667 The Iteration Number of the Weisfeiler-Leman Algorithm Martin Grohe and Moritz Lichter and Daniel Neuen ACM Transactions on Computational Logic, 26(1):2025 Conference Version in Proceedings of the 38th Annual ACM/IEEE Symposium on Logic in Computer Science, 2023 arXiv:2301.13317 The Parameterized Complexity of Learning Monadic Second-Order Logic Steffen van Bergerem, Martin Grohe, and Nina Runde Proceedings of the 33rd EACSL Annual Conference on Computer Science Logic, 2025 arXiv:2309.10489 End-to-End Reinforcement Learning of Curative Curtailment with Partial Measurement Availability Hinrikus Wolf, Luis Böttcher, Sarra Bouchkati, Philipp Lutat, Jens Breitung, Bastian Jung, Tina Möllemann, Viktor Todosijević, Jan Schiefelbein-Lach, Oliver Pohl, Andreas Ulbig, and Martin Grohe Proceedings of IEEE PES Innovative Smart Grid Technologies Europe, 2024 arXiv:2405.03262 The Descriptive Complexity of Graph Neural Networks Martin Grohe TheoretiCS 3(25): 1-93, 2024 Conference version in Proceedings of the 38th Annual ACM/IEEE Symposium on Logic in Computer Science, 2023 arXiv:2303.04613 Where did the gap go? reassessing the long-range graph benchmark Jan Tönshoff, Martin Ritzert, Eran Rosenbluth, and Martin Grohe Transactions of Machine Learning Research 2024 arXiv:2309.00367 Database repairing with soft functional dependencies Nofar Carmeli, Martin Grohe, Benny Kimelfeld, Ester Livshits, and Muhammad Tibi ACM Transactions on Database Systems 49(2): 1-34, 2024 Conference version in Proceedings of the 24th International Conference on Database Theory, 2021. arXiv:2009.13821 Some Thoughts on Graph Similarity Martin Grohe In: Principles of Verification: Cycling the Probabilistic Landscape: Essays Dedicated to Joost-Pieter Katoen on the Occasion of His 60th Birthday, Part I arXiv:2411.10182 Distinguished in uniform: self attention vs. virtual nodes Eran Rosenbluth, Jan Tönshoff, Martin Ritzert, Berke Kisin, and Martin Grohe Proceedings of the 12th International Conference on Learning Representations, 2024 arXiv:2405.11951 Are Targeted Messages More Effective? Martin Grohe and Eran Rosenbluth Proceedings of the 39th Annual ACM/IEEE Symposium on Logic in Computer Science, 2024 arXiv:2403.06817 Position: Future Directions in the Theory of Graph Machine Learning Christopher Morris, Nadav Dym, Haggai Maron, İsmail İlkan Ceylan, Fabrizio Frasca, Ron Levie, Derek Lim, Michael Bronstein, Martin Grohe, and Stefanie Jegelka Proceedings of the 41st International Conference on Machine Learning, 2024 arXiv:2402.02287 Isomorphism for Tournaments of Small Twin Width Martin Grohe and Daniel Neuen Proceedings of the 51st International Colloquium on Automata, Languages, and Programming, 2024 arXiv:2312.02048 The Importance of Parameter Values in Database Queries Martin Grohe, Benny Kimelfeld, Peter Lindner, and Christoph Standke Proceedings of the 27th International Conference on Database Theory, 2024 arXiv:2401.04606 A Faster Isomorphism Test for Graphs of Small Degree Martin Grohe, Daniel Neuen, and Pascal Schweitzer SIAM Journal on Computing 52(6), 2023 Conference version in Proceedings of the 59th Annual IEEE Symposium on Foundations of Computer Science, 2018 arXiv:1802,04659 Weisfeiler and Leman go Machine Learning: The Story so far Christopher Morris, Yaron Lipman, Haggai Maron, Bastian Rieck, Nils M. Kriege, Martin Grohe, Matthias Fey, and Karsten M. Borgwardt Journal of Machine Learning Research 24(133), 2023 arXiv:2112.09992 Walking Out of the Weisfeiler Leman Hierarchy: Graph Learning Beyond Message Passing Jan Tönshoff, Martin Ritzert, Hinrikus Wolf, and Martin Grohe Transactions on Machine Learning Research, September 2023 arXiv:2102:08786 Selecting Walk Schemes for Database Embedding Yuval Lubarsky, Jan Tönshoff, Martin Grohe, and Benny Kimelfeld Proceedings of the 32nd ACM International Conference on Information & Knowledge Management, 2023 One Model, Any CSP: Graph Neural Networks as Fast Global Search Heuristics for Constraint Satisfaction Jan Tönshoff, Berke Kisin, Jakob Lindner, and Martin Grohe Proceedings of the 32nd International Joint Conference on Artificial Intelligence, 2023 arXiv:2208.10227 Some Might Say All You Need Is Sum Eran Rosenbluth and Jan Tönshoff and Martin Grohe Proceedings of the 32nd International Joint Conference on Artificial Intelligence, 2023 arXiv:2302.11603 WL meets VC Christopher Morris, Floris Geerts, Jan Tönshoff, and Martin Grohe Proceedings of the International Conference on Machine Learning, 2023 arXiv:2301.11039 Simulating Logspace-Recursion with Logarithmic Quantifier Depth Steffen van Bergerem, Martin Grohe, Sandra Kiefer, and Luca Oeljeklaus Proceedings of the 38th Annual ACM/IEEE Symposium on Logic in Computer Science, 2023 arXiv:2304.12948 Solving AC Power Flow with Graph Neural Networks under Realistic Constraints Luis Böttcher, Hinrikus Wolf, Bastian Jung, Philipp Lutat, Marc Trageser, Oliver Pohl, Xiaohu Taoi, Andreas Ulbig, and Martin Grohe Proceedings of IEEE Belgrade PowerTech, 2023 arXiv:2204.07000 Stable Tuple Embeddings for Dynamic Databases Jan Tönshoff and Neta Friedman and Martin Grohe and Benny Kimelfeld Proceedings of the 39th IEEE International Conference on Data Engineering, 2023 arXiv:2103.06766 Probabilistic Query Evaluation with Bag Semantics Martin Grohe, Peter Lindner, and Christoph Standke Proceedings of the 26th International Conference on Database Theory, 2023. arXiv:2201.11524 Isomorphism Testing for Graphs Excluding Small Minors Martin Grohe, Daniel Neuen, and Daniel Wiebking SIAM Journal on Computing 52(1), 2023. Conference version in Proceedings of the 61st IEEE Symposium on Foundations of Computer Science, 2020. arXiv:2004.07671 Graph Machine Learning for Design of High-Octane Fuels Jan G. Rittig, Martin Ritzert, Artur M. Schweidtmann, Stefanie Winkler, Jana M. Weber, Philipp Morsch, K. Alexander Heufer, Martin Grohe, Alexander Mitsos, and Manuel Dahmen AIChe Journal 69(4), 2023. arxiv:2206.00619 Physical Pooling Functions in Graph Neural Networks for Molecular Property Prediction Artur M. Schweidtmann, Jan G. Rittig, Jana M. Weber, Martin Grohe. Manuel Dahmen, Kai Leonhard, and Alexander Mitsos Computers and Chemical Engineering 172, 2023. arxiv:2207.13779 Canonisation and Definability for Graphs of Bounded Rank Width Martin Grohe and Daniel Neuen ACM Transaction on Computational Logic 24(1), 2023. Conference version in Proceedings of the 34th ACM-IEEE Symposium on Logic in Computer Science, 2019. arXiv:1901.10330 Classification of material properties and their relation to chemical bonding: Essential steps towards the inverse design of materials with tailored functionalities Carl-Friedrich Schön, Steffen van Bergerem, Christian Mattes, Aakash Yadav, Martin Grohe, Leif Kobbelt und Matthias Wuttig Science Advances 47(8), 2022. Generative Datalog with Continuous Distributions Martin Grohe, Benjamin Lucien Kaminski, Joost-Pieter Katoen, Peter Lindner Journal of the ACM 69(6), 2002. Conference Version in Proceedings of the 39th ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, 2020. arXiv:2001:06358 Independence in Probabilistic Databases Martin Grohe and Peter Lindner Journal of the ACM 69(5), 2022. arXiv:2011.00096 Graph Similarity Based on Matrix Norms Timo Gervens and Martin Grohe Proceedings of the 47th International Symposium on Mathematical Foundations of",
  "content_length": 40874,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:27"
}