{
  "name": "Martin Buss",
  "homepage": "https://www.professoren.tum.de/buss-martin",
  "status": "success",
  "content": "Buss_Martin Prof. Dr.-Ing./Univ. Tokio Martin Buss Professur Steuerungs- und Regelungstechnik School TUM School of Computation, Information and Technology Kontakt Visitenkarte in TUMonline Wissenschaftliche Laufbahn und Forschungsgebiete Prof. Buss forscht an Methoden der Regelungs-, Steuerungs- und Systemtheorie, insbesondere hybride (diskret-kontinuierliche), schaltende, nichtlineare dynamische Systeme, zur Anwendung in der Mechatronik, Robotik, Medizintechnik, Kommunikationstechnik, Telepräsenz-/Teleaktions- und Mensch-Maschine-Systeme. Prof. Buss studierte Elektrotechnik an der TH Darmstadt und promovierte an der University of Tokyo (1994). Im Jahr 2000 habilitierte er an der TUM und wurde auf den Lehrstuhl für Regelungssysteme an die TU Berlin berufen. Seit 2003 ist er Ordinarius für Steuerungs- und Regelungstechnik an der TUM. 2014 wurde er Fellow des Institute of Electrical and Electronics Engineers (IEEE). Wichtigste Auszeichnungen Bundesverdienstkreuz am Bande (2011)ICMA 2009 - Toshio Fukuda Best Paper Award in Mechatronics (2009)Shakey - Most Innovative Video Award“, (2009) Best Journal Paper Award, at–Automatisierungstechnik (2006) Hugo Schuck Best Paper Award, American Control Conference (ACC) (2001) Schlüsselpublikationen (alle Publikationen)Dang, Ni; Brüdigam, Tim; Zhang, Zengjie; Liu, Fangzhou; Leibold, Marion; Buss, Martin: Distributed Stochastic Model Predictive Control for a Microscopic Interactive Traffic Model. Electronics (12(6), 1270), 2023.Abstract Li, Cong; Wang, Yongchao; Liu, Fangzhou; Liu, Qingchen; Buss, Martin: Model-free Incremental Adaptive Dynamic Programming based Approximate Robust Optimal Regulation. International Journal of Robust and Nonlinear Control 32 (5), 2022, 2662-2682.Abstract Liu, Tong; Buss, Martin: Model Reference Adaptive Control of Piecewise Affine Systems with State Tracking Performance Guarantee. International Journal of Robust and Nonlinear Control 32 (7), 2022, 4129-4148.AbstractWang, Yongchao; Zhang, Zengjie; Li, Cong; Buss, Martin: Adaptive Incremental Sliding Mode Control for a Robot Manipulator. Mechatronics 82, 2022, 102717.Abstract Du, Yingwei; Liu, Fangzhou; Qiu, Jianbin; Buss, Martin: Online Identification of Piecewise Affine Systems Using Integral Concurrent Learning. IEEE Transactions on Circuits and Systems I: Regular Papers 68 (10), 2021, 4324-4336.Abstract Bei Änderungs- oder Aktualisierungswünschen wenden Sie sich bitte an Franz Langer. Achtung: JavaScript im Browser deaktiviert Bitte aktivieren Sie JavaScript um alle Funktionen der Website (u.a. Suche) im vollen Umfang nutzen zu können!",
  "content_length": 2599,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:17"
}