{
  "name": "Martin Leucker",
  "homepage": "https://www.isp.uni-luebeck.de/staff/martin",
  "status": "success",
  "content": "Prof. Dr. Martin Leucker Jump to navigation Search form Search My accountImpressum University of Lübeck Institute for Software Engineering and Programming Languages You are hereHome › Staff › Prof. Dr. Martin Leucker staff Director E-mail: leucker [at] isp.uni-luebeck.deAddress: Institute for Software Engineering and Programming Languages Building MFC II Maria-Goeppert-Str. 3 23562 Lübeck GermanyPhone: +49 451 3101 6500Room: 4. Floor, Building MFC II Office hours on appointment Functions director of ISP CEO of UniTransferKlinik editorial member of Formal Aspects of Computing editorial member of STTT - Explain SC chair of ICTAC SC member of RV member of  IFIP WG 1.3 board member of the LSN eV. head of vocational master programme https://ai-master.org Fields of interest software engineering: correct and reliable systems formal methods theoretical computer science verification, especially model checking, runtime verification, and testing message sequence charts model learning AI medical informatics energy informatics Activities: EDTConf 2026 member of PC CGO 2026 (member of PC) ERTS2026 (member of PC) OVERLAY 2025 (member of PC) RVmeetsMBD 2025 (PC Chair) RV 2025 (member of PC) BLOCKCHAIN'25 (member of PC) HEDA 2025 (member of PC) SAC 2025 (member of PC) RV 2024 (member of PC) Further Information: Selected Presentations Model Checking Software Product Lines, Dagstuhl, February 25th, 2013 Links CV Visits NewsResearchProjectsPublicationsPartnersTeachingThesesFAQTemplatesCoursesStaffMartin LeuckerDiedrich WolterUlrike Schräger-AhrensMahmoud AbdelrehimAliyu AliChristopher WaltherPhillip BendeMoritz BayerkuhnleinMarc BätjeTobias BraunGerhard BuntrockRaik DankworthAnja GrotrianRaik HiplerElaheh HosseinkhaniFrauke KerlinKaram KharrazMohammad KhodayganiLudwig PechmannWaqas RehanMartin SachenbacherAndreas SchuldeiMahdi PourghasemManuel HerbstInger StruveAnnette StümpelGesina SchwalbeTobias SchwartzDaniel ThomaSparsh TiwariLars VosteenOpen PositionsContact StaffMartin LeuckerActivities Publications Diedrich Wolter Ulrike Schräger-Ahrens Mahmoud Abdelrehim Aliyu Ali Marc Bätje Moritz Bayerkuhnlein Tobias Braun Gerhard Buntrock Raik Dankworth Enno Friedl Manuel Herbst Raik Hipler Elaheh Hosseinkhani Frauke Kerlin Karam Kharraz Mohammad Khodaygani Ludwig Pechmann Mahdi Pourghasem Waqas Rehan Andreas Schuldei Inger Struve Annette Stümpel Gesina Schwalbe Tobias Schwartz Daniel Thoma Sparsh Tiwari Lars Vosteen Christopher Walther Complete List Open Positions © ISP - Institute for Software Engineering and Programming Languages 1996-2025",
  "content_length": 2562,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:34"
}