{
  "name": "Martin M端ller 0003",
  "homepage": "https://webdocs.cs.ualberta.ca/~mmueller",
  "status": "success",
  "content": "Martin M端ller Martin M端ller Professor, Dept. of Computing Science, University of Alberta Canada CIFAR AI Chair at Amii Amii Fellow New Office: 6-190 University Commons Email (in domain ualberta.ca): mmueller Activities and Interests I am not accepting new students. For applying to our department, please see Applications & Admissions on the Department of Computing Science web site. Research - main active area: algorithms in combinatorial game theory. Research Group, current and previous members and visitors Publications of my research group. Open source software developed by my research group. Some recent Talks from my group, on planning and games topics. Teaching - List of Courses I have taught. Where I have lived and my work experience. 2025 News Sep 15: Two papers accepted for Advances in Computer Games: MCGS: A Minimax-based Combinatorial Game Solver, and SEGClobber - A Linear Clobber Solver. Congratulations Taylor, Henry, Zahra and Fatemeh! Sep-Dec: Teaching a grad course CMPUT 657 - Algorithms for Combinatorial Games. Aug 29: Taylor released Version 1.3 of MCGS! Aug 23-30: Ti-Rong Wu of Academia Sinica visited our group, and gave the AI Seminar on Aug 29. Topic: Exploring Game AI through Planning. Aug 10: Submitted two papers for Advances in Computer Games, on Clobber and MCGS. Jun 2-12: our department moved to University Commons. My new office is 6-190. Jun 9: Taylor released Version 1.2 of MCGS! May 8: Visiting Ting-han Wei in Kochi, Japan. I gave a talk on Game Tree Search, Combinatorial Games, and Go. May 1: Owen received the President's Doctoral Prize of Distinction from our university! Congratulations Owen! Apr 24: Hongming Zhang passed his PhD exam. Congratulations Dr. Hongming!!! Apr 23: Our journal paper ETGL-DDPG: A Deep Deterministic Policy Gradient Algorithm for Sparse Reward Continuous Control was accepted for TMLR. Congratulations Ehsan! Mar 23: Taylor released Version 1.1 of MCGS! Mar 15: Calgary - Edmonton Team Go match in SUB, on eight boards. Edmonton won 5:3! Mar 10: Henry Du passed his MSc exam. Congratulations Henry!!! Feb 22/23: visiting my diploma thesis supervisor Dr. Peter Lipp and his wife Michaela in Graz, Austria. Feb 7: Announcing MCGS Version 1, our Minimax-based Combinatorial Game Solver. Congratulations Taylor and Henry! Feb 1: I gave a short overview talk about our MCGS software, A Search-based Approach for Solving Sum Games at CGTC V, Lisbon 2025. Jan 30: Timo Bertram passed his PhD exam at JKU Linz. Congratulations Timo!!! Jan - Jun: I'm on a six months sabbatical! Old news (up to 2024) Funded by: Created: Aug 7, 2000 Last modified: see above Martin M端ller",
  "content_length": 2642,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:37"
}