{
  "name": "Marti Hearst",
  "homepage": "http://people.ischool.berkeley.edu/~hearst",
  "status": "success",
  "content": "Marti A. Hearst: Home page Marti A. Hearst Professor University of California, Berkeley Home Publications Research Teaching Bio and CV About I am professor in the UC Berkeley School of Information; I was interim Dean and Head of School from 2022-2024. I am also a professor in Berkeley CS. Contact: hearst@berkeley.edu 212 South Hall 510-642-1464 Office hours Fall 2025: Tues 3:30-4:30pm and by appt. To those interested in doing research with me, please read this page. Research My research is focused in the following areas: Information Visualization Scholarly Document Reading and Search Computational Linguistics Search Engines and their User Interfaces Information-Rich User Interface Design Teaching at Scale Read More Online Book! Check out Search User Interfaces, the first academic book on this topic (Cambridge University Press, Fall 2009). On the web site, you can Read the Full Text! Teaching Current and past courses include: Information Visualization and Presentation Applied Natural Language Processing User Interface Design Analyzing Big Data with Twitter Information Organization and Retrieval Read More Recent Highlights Tutorial on Human-AI Interaction in the Age of LLMs, with Diyi Yang and Sherry Wu at NAACL 2024. My slides on Designing Human-LLM Interations. Video of entire tutorial. I've posted my MIDS Immersion'23 talk. slides I've posted my ICDAR'23 keynote Bringing Scientific Documents to Life. slides If you missed my keynote Show It or Tell It? at IEEE Vis 2022, you can now watch the video or read the slides with notes. Read the CACM paper. Thank you to Allen Instititue for AI (AI2) for another generous gift as well as a key\tcollaboration! Congratulations to Dr. Katie Stasaski on your new job as Applied Scientist at Salesforce! Congratulations to Dr. Philippe Laban on your new job as Research Scientist at Salesforce! Congratulations to Andrew Head for taking a faculty job at U Penn! Congratulations to Dongyeop Kang for taking a faculty job at U Minnesota! ScholarPhi project presented at CHI 2021! Keynote talk at the HCI + NLP workshop at EACL slides Keynote talk at the KDD Data Science with Human in the Loop (DaSH) workshop. slides Thank you to Allen Instititue for AI (AI2) for two generous gifts supporting our augmented reader project, as well as key collaboration! Thank you to Sloan for the grant for the augmented reader project! Thank you to Amazon for two AWS ML Research Awards! Thank you to the Bloomberg for Data Science Research grant! How to fix word clouds (Medium) as well as the IEEE TVCG journal paper. ACL Presidential Address (with notes) pdf video Academics and industry research on learning technology at the Baylan conference in Berkeley! Keynote at IJCAI in Melbourne video slides Interested in teaching infoviz? Check out the Innovations in Pedagogy Workshop at Viz 2017! First time in Korea; keynote at Computing in the 21st Century conference. Fantastic final projects posted for Infoviz course. Congrats to Kyle Booten on best paper runner up for NAACL 2016! Posted slides on Teaching as Coaching from our IEEE Infoviz panel on Teaching Across the Researcher-Practioner Divide. Thank you iSchool students for the honor of the 2015 Excellence in Teaching Award! ACL 2015 Keynote talk: slides and paper now available. Keynote talk at ECIR in Vienna, March 2015. Keynote talk at the Society for Computers in Psychology, Nov 2014. I'm honored to have received the 2014 iSchool student-initiated teaching award. Keynote talk at ACM SIGIR 2014: Seeking Simplicity in Search User Interfaces. Social Interactions Grant to study subgroups with online learning environments. Thank you to Google for supporting our and others' research! Twitter Big Data course high-fived by All Things D, Center for Digital Education, and, of course, Twitter.",
  "content_length": 3805,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:12"
}