{
  "name": "Marta Kwiatkowska",
  "homepage": "http://www.cs.ox.ac.uk/marta.kwiatkowska",
  "status": "success",
  "content": "Marta Kwiatkowska | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyMarta KwiatkowskaMarta Kwiatkowska Professor Marta Zofia Kwiatkowska Professor of Computer Science (Computing Systems)Fellow, Trinity CollegeE: Marta.Kwiatkowska@cs.ox.ac.ukT: +44 (0)1865 283509Themes:Automated VerificationCompleted Projects:Automated quantitative software verification with PRISMUbiValPredictable Software Systemsmore…InterestsMy research is concerned with modelling and analysis methods for complex systems, such as those arising in computer networks, electronic devices and biological organisms. The analysis methods that I investigate include simulation and formal verification, with particular emphasis on quantitative verification of probabilistic systems. My work spans the whole spectrum, from theory, through algorithms to software implementation and applications. [more details...]BiographyMarta Kwiatkowska is Professor of Computing Systems and Fellow of Trinity College, University of Oxford. Prior to this she was Professor in the School of Computer Science at the University of Birmingham, Lecturer at the University of Leicester and Assistant Professor at the Jagiellonian University in Cracow, Poland. She holds a BSc/MSc in Computer Science from the Jagiellonian University, MA from Oxford and a PhD from the University of Leicester. [more details...] Doctoral study in computer science I welcome applications for doctoral study and postdoctoral visitors in areas relevant to my research interests. Possible research topics are described here, but I am happy also to consider students' own proposals. If you are interested in a D.Phil. position (this is what PhD is called at Oxford) please email me. [more details...] Publications See here for an online list of publications. Links Research Projects Talks & Tutorials People Professional Activities Teaching Availability ActivitiesProbabilistic Verification for Systems BiologyProbabilistic Model CheckingSoftware Model CheckingQuantitative Analysis and VerificationPRISMProjectsFUN2MODELFAIRCompleted ProjectsAutomated quantitative software verification with PRISMUbiValPredictable Software SystemsUbiquitous ComputingCancerGridIntegrative BiologyCONNECT-IPVERIWAREPRISMATICAutonomous Ubiquitous SensingVERIPACEMobile RoboticsAFFECTechELSA Current Students Charlie GriffinBill Daqian ShaoMatthew Yuan Research Minghao LiuResearch Associate Past Students Elias BenussiChris ChiltonFrits DannenbergMarco DiciollaAndrei  DraghiciRhiannon Falconmore (née Michelmore)Lu FengMatthias FruthPascale GourdeauKarolis KusasEmanuele La MalfaClare LyleMaciej OlejnikAleksandar  PetrovAistis SimaitisMateusz UjmaBenjie WangMax WhitbyHannes WijkClemens Wiltsche Past Researchers Mark KattenbeltLuca LaurentiGethin NormanAndrea PataneRadek PiórkowskiFrancesco QuinzanRajarshi RoyWenjie Ruan (Lecturer at Lancaster University) Gabriel SantosMin WuFormer Member, Research Associate, Doctoral StudentRui YanPian YuResearch AssociateAgnieszka ZbrzeznyXiyue  ZhangAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3296,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:04"
}