{
  "name": "Marta L. Queiros Mattoso",
  "homepage": "http://cos.ufrj.br/~marta",
  "status": "success",
  "content": "Marta Mattoso's home page Marta Mattoso D.Sc., COPPE/UFRJ, Rio de Janeiro Full Professor - COPPE / Computer Science Federal University of Rio de Janeiro Rio de Janeiro, Brazil (Department's home page) VLDB 2018 in Rio !!!! Research interests Scientific Data Management in High Performance Computing Scientific Workflows Data Provenance Query Processing: Sequential, Distributed and Parallel Publications · CV at CNPq (National Council for Scientific and Technological Development) · Papers at DBLP Computer Science Bibliography server Thanks to Michael Ley · Papers at BDBComp - digital library for the Brazilian computer science community Thanks to Alberto Laender · Papers at Google Scholar Download (for free) my following publications from ACM <-- ACM Publications on Scientific Workflows, Provenance, Clouds - Human in the Loop --> User-steering of HPC workflows: state-of-the-art and future directionsMarta Mattoso, Kary Ocaña, Felipe Horta, Jonas Dias, Eduardo Ogasawara, Vitor Silva, Daniel de Oliveira, Flavio Costa, Igor AraújoSWEET '13 Proceedings of the 2nd ACM SIGMOD Workshop on Scalable Workflow Execution Engines and Technologies, 2013 Capturing and querying workflow runtime provenance with PROV: a practical approachFlavio Costa, Vítor Silva, Daniel de Oliveira, Kary Ocaña, Eduardo Ogasawara, Jonas Dias, Marta MattosoEDBT '13 Proceedings of the Joint EDBT/ICDT 2013 Workshops, 2013 Dimensioning the virtual cluster for parallel scientific workflows in cloudsDaniel de Oliveira, Vitor Viana, Eduardo Ogasawara, Kary Ocana, Marta MattosoScience Cloud '13 Proceedings of the 4th ACM workshop on Scientific cloud computing, 2013 Supporting dynamic parameter sweep in adaptive and user-steered workflowJonas Dias, Eduardo Ogasawara, Daniel de Oliveira, Fabio Porto, Alvaro L.G.A. Coutinho, Marta MattosoWORKS '11 Proceedings of the 6th workshop on Workflows in support of large-scale science, 2011 Database Courses COS601 COS111 COS733 COS833 Database Tutorials Scientific Cloud Computing for E-Science The Role of Databases - 28th SBBD Scientific Workflow Management - 23rd SBBD Web Services Technology - 18th SBBD OO&OR DBMS - 18th SBBD From UML to ODMG - 14th SBBD Parallel Database Systems - 12th SBBD Object-Oriented Database Systems - 1st ERI SBC Journal - Career in Computer Science SBC HORIZONTES Thesis Thesis Guidelines - slides or handouts 6 (in portuguese - SBBD 2004) slides (in portuguese 2007 ) Prof. Marta Mattoso Programa de Sistemas, COPPE/UFRJ P.O. Box 68511 21941-972 Rio de Janeiro - RJ Brazil marta [AT] cos.ufrj.br http://www.cos.ufrj.br/~marta +55-21-2562-8694 (voice) +55-21-2290-6626 (fax) Updated May, 2015",
  "content_length": 2648,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:06"
}