{
  "name": "Martina Zitterbart",
  "homepage": "http://telematics.tm.kit.edu/staff_zitterbart.php",
  "status": "success",
  "content": "KIT - TM - Über uns - Mitarbeiter Lehrstuhl Prof. Zitterbart - Institut für Telematik StartseiteÜber unsMitarbeiter Karlsruher Institut für Technologie (KIT) - Institut für Telematik - Lehrstuhl Prof. ZitterbartHomeÜber unsForschungStudium und LehreOffene StellenÜber unsMitarbeiterSekretariatAnfahrtMitarbeiter Prof. Dr. Martina Zitterbart InstitutsleitungSprechstunden: Mittwochs 13 - 14 Uhr (Voranmeldung nicht erforderlich)Raum: 4.07Tel.: +49 721 608-46400Fax: +49 721 608-46789zitterbart ∂does-not-exist.kit edu Forschungsbereich Telematik Institut für Telematik Karlsruher Institut für Technologie (KIT) Gebäude 01.99 Kaiserstraße 40 D-76133 Karlsruhe Zur Person Publikationen Lehre Projekte Prof. Dr. habil. Martina ZitterbartMartina Zitterbart ist Professorin für Informatik am Karlsruher Institut für Technologie (ehemals Universität Karlsruhe, TH). Von 1987 bis 1995 war sie wissenschaftliche Mitarbeiterin in Karlsruhe, wo sie 1990 promoviert wurde. In den Jahren 1991 und 1992 war sie als Gastwissenschaftlerin am IBM T.J. Watson Research Center, in Yorktown-Height, NY tätig. Ferner war sie als Gastprofessorin an der Universität Magdeburg und der Universität Mannheim und als Professorin an der TU Braunschweig (1995 bis 2001) tätig.   Ihr berufliches Interesse gilt vorrangig Multimedia-Kommunikationssystemen, mobiler und ubiquitärer Kommunikation, ambient technologies und drahtlosen Sensornetzen. Sie ist Mitglied der IEEE, ACM und der Deutschen Gesellschaft für Informatik. 2002 wurde Martina Zitterbart mit dem Alcatel SEL Forschungspreis für technische Kommunikation ausgezeichnet. 2003 war sie General Co-Chair der ACM SIGCOMM Konferenz, die in Karlsruhe ausgerichtet wurde. Akademischer Werdegang Seit März 2001 C4-Professorin für Informatik, Institut für Telematik, KIT 1998 Gastwissenschaftlerin am IBM T.J. Watson Research Laboratory, New York, USA 1995 Gastwissenschaftlerin am IBM T.J. Watson Research Laboratory, New York, USA 1995-2001 C4-Professorin für Informatik, TU Braunschweig WS 1994/95 C4-Vertretungsprofessur, Universität Mannheim SS 1994 C4-Vertretungsprofessur, Universität Magdeburg 1993 Lehrauftrag Technische Universität Ilmenau „Hochgeschwindigkeitsnetze“ 1991 und 1992 Gastwissenschaftlerin am IBM T.J. Watson Research Laboratory, New York, USA 1989 Gastwissenschaftlerin am IBM Forschungslabor, Rüschlikon, Schweiz 1987-1995 Wissenschaftliche Mitarbeiterin, Institut für Telematik, Universität Karlsruhe (TH) Auszeichnungen 2008 Beste Wahlpflichtvorlesung, Kommunikation und Datenhaltung 2008 Fernsehsendung zu virtuellen Kraftwerken des 3SAT Wissenschaftsmagazins nano (www.3sat.de/mediathek/?obj=7303) – Ergebnisse des interdisziplinären Projekts SESAM (Selbstorganisation und Spontaneität in liberalisierten und harmonisierten Märkten) 2003 Beste Wahlpflichtvorlesung, Kommunikation und Datenhaltung 2002 Alcatel-SEL Forschungspreis „Technische Kommunikation“ 1996 Ruf an die Otto-von-Guericke Universität Magdeburg, abgelehnt 1992 Verleihung des FZI-Preises für die beste Doktorarbeit in Informatik, Universität Karlsruhe 1991 Bundesweit beste Doktorarbeit im Bereich Kommunikation und Verteilte System, ausgezeichnet durch die GI-Fachgruppe KuVS (Kommunikation und Verteilte Systeme) 1990 Auszeichnung für Doktorarbeit 2025 Proceedingsbeiträge Feedback-driven Autonomous Data Set Labeling for Denial-of-Service Attack TrafficKopmann, S.; Lachos, D.; Zitterbart, M.2025. 2025 IEEE 50th Conference on Local Computer Networks (LCN), Sydney, Australia, 13-16 October 2025, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/LCN65610.2025.11146338 Portest: Port Scan Detection on Non-Programmable Switches using TCAM and Randomized AlgorithmKrack, T.; Zitterbart, M.2025. Proceedings of the 1st Workshop on Next-Generation Network Observability, SIGCOMM 2025, 51–57, Association for Computing Machinery (ACM). doi:10.1145/3748496.3748988 Insights into BBRv3’s Performance and Behavior by Experimental EvaluationBless, R.; Lihotzki, L.; Zitterbart, M.2025. 2025 IFIP Networking Conference (IFIP Networking), Limassol, 26th-29th May 2025, Institute of Electrical and Electronics Engineers (IEEE) Scheduling Electric Currents in Converter-Dominated Power Grids with Time-Slotted Energy PacketsSchneider, K.; Schulz, D.; Helmig, D.; Wiegel, F.; Hagenmeyer, V.; Hiller, M.; Zitterbart, M.2025. Energy Informatics – 4th Energy Informatics Academy Conference, EI.A 2024, Kuta, Bali, Indonesia, October 23–25, 2024, Proceedings, Part I. Ed.: B. Jørgensen, 3–20, Springer Nature Switzerland. doi:10.1007/978-3-031-74738-0_1 Proceedingsbände Insights and Lessons Learned from a Realistic Smart Grid Testbed for Cybersecurity ResearchElbez, G.; Sanchez, G.; Canbolat, S.; Corallo, S.; Fruböse, C.; Lanzinger, F.; Kellerer, N.; Keppler, G.; Neumeister, F.; Beckert, B.; Koziolek, A.; Zitterbart, M.; Hagenmeyer, V.2025. 805–812, Association for Computing Machinery (ACM). doi:10.1145/3679240.3734649 Poster FENCE: Future ENergy Cybersecurity EvaluationAlberto, H. da C.; Canbolat Kaya, S.; Corallo, S.; Elbez, G.; Fruböse, C.; Hetzel, E.; Kellerer, N.; Keppler, G.; Lanzinger, F.; Neumeister, F.; Sánchez, G.; Beckert, B.; Koziolek, A.; Müller-Quade, J.; Zitterbart, M.; Hagenmeyer, V.2025, Mai 27. Evaluation Helmholtz Information (2025), Karlsruhe, Deutschland, 26.–28. Mai 2025 2024 Zeitschriftenaufsätze Importance Analysis of Micro-Flow Independent Features for Detecting Distributed Network AttacksKopmann, S.; Zitterbart, M.2024. IEEE Transactions on Network and Service Management, 21 (6), 5947–5957. doi:10.1109/TNSM.2024.3460082 Proceedingsbeiträge Demo: Testing AI-driven MAC Learning in Autonomic NetworksPaeleke, L.; Keshtiarast, N.; Seehofer, P.; Bless, R.; Karl, H.; Petrova, M.; Zitterbart, M.2024. 32nd IEEE International Conference on Network Protocols (ICNP), Charleroi, 28.10-31.10.2024, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/ICNP61940.2024.10858521 Dynamic Spectrum Management for 6G Network-in-Network ConceptsLindenschmitt, D.; Seehofer, P.; Schmitz, M.; Mertes, J.; Bless, R.; Klar, M.; Zitterbart, M.; Schotten, H. D.; Aurich, J. C.2024. 15th International Conference on Network of the Future (NoF), Castelldefels, 2nd-4th October 2024, Castelldefels, Spain, 02-04 October 2024. Ed.: T. Mahmoodi, 151–153, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/NoF62948.2024.10741442 ReP2P Matrix: Decentralized Relays to Improve Reliability and Performance of Peer-to-Peer MatrixSchichtholz, B. D.; Bless, R.; Jacob, F.; Hartenstein, H.; Zitterbart, M.2024. Proceedings of the ACM Conext-2024 Workshop on the Decentralization of the Internet (DIN ’24), Los Angeles, CA, USA, December 9–12, 2024, 8–14, Association for Computing Machinery (ACM). doi:10.1145/3694809.3700741 Evaluating Drill-Down DDoS Destination DetectionKrack, T.; Kopmann, S.; Zitterbart, M.2024. 2024 IEEE 49th Conference on Local Computer Networks (LCN), Normandy, France, 08-10 October 2024, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/LCN60385.2024.10639629 7D: Demonstrating Drill-Down DDoS Destination DetectionKopmann, S.; Krack, T.; Zitterbart, M.2024. 2024 IEEE International Conference on Machine Learning for Communication and Networking (ICMLCN), Stockholm, 5th-8th May 2024, 1–2, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/ICMLCN59089.2024.10624795 Line Management in the Energy Packet GridWeßbecher, M.; Wiegel, F.; An, S. X.; Schneider, K.; Schulz, D.; Zitterbart, M.; Hiller, M.; Hagenmeyer, V.2024. Proceedings of the 15th ACM International Conference on Future and Sustainable Energy Systems (e-Energy ’24), 182–191, Association for Computing Machinery (ACM). doi:10.1145/3632775.3661954 TRUST Issues: Multicast and Integrity Protection for the TRUST Redundancy MechanismNeumeister, F.; Zitterbart, M.2024. 2024 IEEE International Conference on Industrial Technology (ICIT), 1–6, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/ICIT58233.2024.10540910 Forschungsberichte/Preprints Dynamic Spectrum Management for 6G Network-in-Network ConceptsLindenschmitt, D.; Seehofer, P.; Schmitz, M.; Mertes, J.; Bless, R.; Klar, M.; Zitterbart, M.; Aurich, J. C.; Schotten, H. D.2024. arxiv. doi:10.5445/IR/1000175527 Vorträge Sustained Throughput Performance of QUIC ImplementationsKönig, M.; Waldhorst, O. P.; Zitterbart, M.2024, April 9. BelWü TechDay (2024), Karlsruhe, Deutschland, 9. April 2024 2023 Zeitschriftenaufsätze Toward Joining DDoS Mitigation and Image Segmentation – Leveraging Computer Vision for Network SecurityKopmann, S.; Heseding, H.; Zitterbart, M.2023. Datenschutz und Datensicherheit - DuD, 47 (8), 475–477. doi:10.1007/s11623-023-1801-1 Proceedingsbeiträge Composing Power Flow Patterns through Coordinated Dispatch of Energy PacketsSchulz, D.; Schneider, K.; Weßbecher, M.; Hagenmeyer, V.; Zitterbart, M.; Hiller, M.2023. 2023 8th IEEE Workshop on the Electronic Grid (eGRID), Karlsruhe, Germany, 16-18 October 2023, 1–6, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/eGrid58358.2023.10380818 Modes of Energy Packets in the Energy Packet GridSchneider, K.; Weßbecher, M.; Schulz, D.; Hagenmeyer, V.; Hiller, M.; Zitterbart, M.2023. 2023 8th IEEE Workshop on the Electronic Grid (eGRID), Karlsruhe, Germany, 16-18 October 2023, 1–7, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/eGrid58358.2023.10380897 Reducing memory footprints in purity estimations of volumetric DDoS traffic aggregatesHeseding, H.; Krack, T.; Zitterbart, M.2023. M. Seufert, A. Blenk & O. Landsiedel (Hrsg.), 2nd Workshop on Machine Learning & Netwoking (MaLeNe) Proceedings. Co-located with the 5th International Conference on Networked Systems (NetSys 2023), Potsdam, Germany. Ed.: . Seufert, Universität Augsburg Scalable and Efficient Link Layer Topology Discovery for Autonomic NetworksSeehofer, P.; Bless, R.; Mahrt, H.; Zitterbart, M.2023. 2023 19th International Confe",
  "content_length": 77124,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:53"
}