{
  "name": "Martin Storath",
  "homepage": "https://fang.thws.de/en/faculty/staff/professors-and-lecturers/person/prof-dr-martin-storath",
  "status": "success",
  "content": "Professors and lecturers :: Technical University of Applied Sciences Würzburg-Schweinfurt Zum Inhalt wechseln Zum Hauptmenü wechseln Zum Navigationspfad wechseln Zur Suche wechseln Zur Sprachauswahl wechseln Zur Servicenavigation wechseln Professors and lecturers Prof. Dr. Martin Storath Phone +49 9721 940-8584 E-Mail martin.storath[at]thws.de Visiting Address Ignaz-Schön-Straße 11 97421 Schweinfurt Room 5.E.15 Office Hours Winter semester 25/26: Tuesdays, 10–11 a.m., Room 5.E.15. Please register in advance by email!Lecture-free period: By appointment via email Function(s) Head of Mathematical Methods for Computer Vision and Machine Learning Lab Dean of Studies FANG Faculty Council FANG Coordination of the Marketing Working Group News News Feature der Region Mainfranken über DIBCODie Fachzeitschrift \"Logistik heute\" berichtet hier über das Forschungsprojekt DIBCO.Das Forschungsprojekt \"DIBCO - Digitales Behältermanagement mit der Anwendung von Computer Vision\" wird ab 1.1.2022 für drei Jahre gefördert (zusammen mit Prof. Dobhan von FWI und Industriepartnern). Für Studierende besteht die Möglichkeit, mit Praktika und Abschlussarbeiten im Bereich Computer Vision am Projekt teilzunehmen. Voraussetzung sind gute Kenntnisse in Mathematik und Programmierung. Bei Interesse bitte einfach kurze Email schreiben. Teaching Areas Teaching WT 2023/24Mathematisches SeminarMathematische Methoden des maschinellen LernensST 2023Mathematical Foundations of AIApproximationsmethoden Informatik 2 Lab Lab for Mathematical Methods in Computer Vision and Machine Learning Bachelor- und Masterarbeiten Betreuung von Bachelor- und Masterarbeiten in den Bereichen:Computer VisionMaschinelles LernenDigitale Signal- und Bildverarbeitung Data ScienceBei Interesse bitte per Email Kontakt aufnehmen. Publications Recent Publications Vincent Wahyudi, Cedric C. Ziegler, Matthias Frieß, Stefan Schramm Constantin Lang, Lars Eberhardt, Fabian Freund, Alexander Dobhan, Martin Storath. A Computer Vision System for Recognition and Defect Detection for Reusable Containers, to appear in Machine Vision and ApplicationsM. Storath, A. Weinmann. Smoothing splines for discontinuous signals. Journal of Computational and Graphical Statistics. 2023C. Ziegler, J. Ising, A. Dobhan, M. Storath. Computer Vision in Reusable Container Management – Requirements, Conception, and Data Acquisition, Mobility in a Globalised World 2022M. Storath, A. Weinmann. Variational regularization of inverse problems for manifold-valued data. Information and Inference: A Journal of the IMA, 2021L. Kiefer, S. Petra, M. Storath, A. Weinmann. Multi-channel Potts-based reconstruction for multi-spectral computed tomography. Inverse Problems, 2021L. Kiefer, M. Storath, A. Weinmann. An algorithm for second order Mumford-Shah models based on a Taylor jet formulation. SIAM Journal on Imaging Sciences, 2020L. Kiefer, M. Storath, A. Weinmann. PALMS Image Partitioning - A New Parallel Algorithm for the Piecewise Affine-Linear Mumford-Shah Model. Image Processing Online, 2020L. Kiefer, M. Storath, A. Weinmann. Iterative Potts minimization for the recovery of signals with discontinuities from indirect measurements -- the multivariate case. Foundations of Computational Mathematics, 2020M. Storath, A. Weinmann. Wavelet sparse regularization for manifold-valued data. Multiscale Modeling and Simulation: A SIAM Interdisciplinary Journal, 18(2):674–706, 2020L. Kiefer, M. Storath, A. Weinmann. An efficient algorithm for the piecewise affine-linear Mumford-Shah model based on a Taylor jet splitting. IEEE Transactions on Image Processing, 29:921–933, 2019M. Storath, L. Kiefer, A. Weinmann. Smoothing for signals with discontinuities using higher order Mumford-Shah models. Numerische Mathematik, 143(2):423-460, 2019M. Esposito, C. Hennersperger, R. Göbl, L. Demaret, M. Storath, N. Navab, M. Baust, A. Weinmann. Total variation regularization of pose signals with an application to 3D freehand ultrasound. IEEE Transactions on Medical Imaging, 38(10):2245–2258, 2019A. Bendinger, C. Debus, C. Glowa, C. Karger, J. Peter, M. Storath. Bolus arrival time estimation in dynamic contrast-enhanced MRI of small animals based on spline models. Physics in Medicine and Biology, 64(4):045003, 2019D. Fortun, M. Storath, D. Rickert, A. Weinmann, M. Unser. Fast piecewise-affine motion estimation without segmentation. IEEE Transactions on Image Processing, 27(11):5612–5624, 2018L. Kiefer, S. Petra, M. Storath, A. Weinmann. Direct MRI segmentation from k-space data by iterative Potts minimization. International Conference on Scale Space and Variational Methods (SSVM), 2019M. Weiler, F. Hamprecht, M. Storath. Learning steerable filters for rotation equivariant CNNs. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pp. 849–858, 2018K. Bredies, M. Holler, M. Storath, A. Weinmann. Total generalized variation for manifold-valued data. SIAM Journal on Imaging Sciences, 11(3):1785–1848, 2018W. Erb, A. Weinmann, M. Ahlborg, C. Brandt, G. Bringout, T. Buzug, J. Frikel, C. Kaethner, T. Knopp, T. März, M. Möddel, M. Storath, A. Weber. Mathematical Analysis of the 1D Model and Reconstruction Schemes for Magnetic Particle Imaging. Inverse Problems, 34(5):055012, 2018M. Kiechle, M. Storath, A. Weinmann, M. Kleinsteuber. Model-based learning of local image features for unsupervised texture segmentation. IEEE Transactions on Image Processing, 27(4):1994–2007, 2018M. Storath, A. Weinmann. Fast median filtering for phase or orientation data. IEEE Transactions on Pattern Analysis and Machine Intelligence, 40(3):639–652, 2018Full list here: Google Scholar Open Source Software CSSD - Cubic smoothing splines for discontinuous signalsPottslab - Multilabel image segmentation (color/gray/multichannel) based on the Potts model (aka piecewise constant Mumford-Shah model) DCEBE - Estimation of bolus arrival times for DCE-MRI signalsCircleMedianFilter - Fast median filter for circle-valued data, for example signals or images describing phase or orientationL1TV - Denoising/reconstruction of piecewise constant signals using the L1TV model MumfordShah2D - Algorithms for edge preserving smoothing based on the Mumford-Shah modelPALMS Image Partitioning - A New Parallel Algorithm for the Piecewise Affine-Linear Mumford-Shah Model Career Short CV Since 2023: Research Professor for Computer Vision and Machine Learning, Technische Hochschule Würzburg-SchweinfurtSince 2018: Professor of Mathematics, Technische Hochschule Würzburg-Schweinfurt2016 - 2018: Researcher at the Image Analysis and Learning Group, Universität Heidelberg2013 - 2016: Researcher at the Biomedical Imaging Group, EPFL in Lausanne2013: PhD in Applied Mathematics, TU München2010 - 2013: Researcher at Helmholtz Zentrum München GmbH2008 - 2010: Scientific assistant, TU München2009 Honors degree in Technology Management, TU München and LMU München2008 Diplom in Mathematics with Computer Science, TU München Additional Information Links Brücken schlagen: Von der Schulmathematik zur Hochschulmathematik",
  "content_length": 7052,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:43"
}