{
  "name": "Martijn Wieling 0001",
  "homepage": "http://www.martijnwieling.nl",
  "status": "success",
  "content": "Martijn Wieling - personal page Martijn Wieling University of Groningen About me Publications Presentations Outreach Download CV © Martijn Wieling, 2025 Martijn Wieling Martijn Wieling is Professor by special appointment of Low Saxon / Groningen Language and Culture at the Center for Groningen Language and Culture and an Associate Professor (UHD1) at the University of Groningen. His research focuses on investigating language variation and change quantitatively, with a specific focus on the Low Saxon language. He uses both large digital corpora of text and speech, as well as experimental approaches to assess differences in the movement of the tongue and lips during speech. More information about the research conducted in his group can be found on the website of the Speech Lab Groningen. +31 6 3198 4084 m.b.wieling@rug.nl Room nr.: 1311.434 @wieling.bsky.social Academic positions Present 2018 Professor by special appointment of Low Saxon / Groningen Language and Culture Center for Groningen Language and Culture Present 2018 Associate Professor University of Groningen, Department of Information Science 2018 2015 Assistant Professor (with tenure) University of Groningen, Department of Information Science 2015 2013 Post-doctoral researcher (NWO Veni) University of Groningen, Department of Information Science 2013 2012 Post-doctoral researcher (NWO Rubicon) University of Tübingen, Department of Quantitative Linguistics Education & Training Ph.D. 2012 Ph.D. in Linguistics (cum laude) University of Groningen, Faculty of Arts M.Sc.2007 Master (research) of Science in Behavioural and Cognitive Neurosciences (cum laude) University of Groningen, Faculty of Science and Engineering M.Sc.2007 Master of Science in Computing Science(cum laude) University of Groningen, Faculty of Science and Engineering B.Sc.2005 Bachelor of Science in Computing Science(cum laude) University of Groningen, Faculty of Science and Engineering Publications Key (7) All (136) Journal (68) Proceedings (50) Chapters (14) Books (1) R packages (1) Theses (2) (h: 39) SPRAAKLAB - Mobile laboratory for speech recorded acoustically and kinematically Rebernik, T., Jacobi, J., Buurke, R., Tienkamp, T., Abur, D., & Wieling, M. (forthcoming, 2025) Journal paper Behavior Research Methods. Abstract Data collection in experimental linguistics is frequently conducted in laboratory rooms within a research institute, which can be difficult to reach for some participants, for example those with mobility issues or living further away and in remote areas. This article presents SPRAAKLAB, a mobile laboratory that facilitates the collection of high-quality acoustic and articulatory data outside of university walls, thus bringing the laboratory environment closer to the participants. We present an acoustic analysis of recordings collected inside and outside of the SPRAAKLAB, including transmission loss, signal-to-noise ratio and harmonics-to-noise ratio. All three measures reveal that the SPRAAKLAB is suitable for collecting consistent high-quality speech data even in loud environments. Finally, we discuss how the SPRAAKLAB allows us to collect data more easily and facilitates public outreach activities. Associations between acoustic, kinematic, self-reported and perceptual measures of speech in individuals surgically treated for oral cancer Tienkamp, T., Rebernik, T., Halpern, B., van Son, R., Wieling, M., Witjes, M., de Visscher, S., & Abur, D. (forthcoming, 2025) Journal paper Journal of Speech, Language, and Hearing Research. Abstract Purpose: The purpose of this study was to assess differences between individuals treated for oral squamous cell carcinoma (ITOC) and control speakers on acoustic, kinematic and perceptual measures of speech. Furthermore, this study aimed to assess the interrelatedness of these speech domains alongside self-reported speech outcomes in order to inform clinically relevant measures of speech in ITOC. Method: Simultaneous acoustic and kinematic data (via electromagnetic articulography sensors on the tongue) were collected from 9 ITOC, who received treatment for either a tumour located on the tongue or jaw, and 8 age- and sex-matched control speakers. All participants were native speakers of Dutch and read the North Wind and the Sun passage. We calculated the articulatory-acoustic vowel space (AAVS) from the acoustic data and the articulatory-kinematic vowel space (AKVS) from the tongue tip and tongue back sensor data. Inexperienced listeners (n=35) provided intelligibility and listening effort ratings using a visual analogue scale rating procedure. Self-reported speech problems were assessed using the Speech Handicap Index (SHI). Results: Compared to an age- and sex-matched control group, ITOC demonstrated significantly worse speech outcomes across all speech domains. A principal component analysis of all speech outcome measures within the ITOC group showed that the acoustic, perceptual, and self-reported measures were most strongly associated with each other, and that acoustic and kinematic measures were not strongly associated with each other. Conclusions: This study demonstrates the multifaceted nature of the speech problems in ITOC, as deficits were found across all speech domains. Acoustic and kinematic measures seem to provide disparate and complementary information considering the absence of a strong relationship between them. Our results thus underscore the importance of assessing the speech outcomes of ITOC across the acoustic, kinematic, perceptual, and self-reported domains to inform rehabilitation strategies. Combining topic modelling and citation network analysis to study case law from the European Court on Human Rights on the right to respect for private and family life Mohammadi, M., Bruijn, M., Wieling, M., & Vols, M. (2025) Journal paper Artificial Intelligence and Law, https://doi.org/10.1007/s10506-025-09471-9. Abstract As legal case law databases such as HUDOC continue to grow rapidly, it has become essential for legal researchers to find efficient methods to handle such large-scale data sets. Such case law databases usually consist of the textual content of cases together with the citations between them. This paper focuses on case law from the European Court of Human Rights on Article 8 of the European Convention of Human Rights, the right to respect private and family life, home and correspondence. In this study, we demonstrate and compare the potential of topic modelling and citation network to find and organize case law on Article 8 based on their general themes and citation patterns, respectively. Additionally, we explore whether combining these two techniques leads to better results compared to the application of only one of the methods. We evaluate the effectiveness of the combined method on a unique manually collected and annotated dataset of Aricle 8 case law on evictions. The results of our experiments show that our combined (text and citation-based) approach provides the best results in finding and grouping case law, providing scholars with an effective way to extract and analyse relevant cases on a specific issue. Using electromagnetic articulography to investigate tongue, lip and jaw tremor associated with Parkinson's disease. Rebernik, T., Jacobi, J., Tiede, M., & Wieling, M. (2025) Journal paper Clinical Linguistics & Phonetics, https://doi.org/10.1080/02699206.2025.2501072. Abstract Tremor in Parkinson's disease is most frequently studied in the limbs, even though it also occurs in the vocal tract. In the current study, we assessed the presence of tongue, lip and jaw tremor in 34 individuals with Parkinson's disease (IwPD) and 25 controls (CS). We used electromagnetic articulography sensors attached to the tongue, the lips, and the jaw to measure orolingual tremor while the participants were performing a series of tasks. Additionally, we acoustically measured frequency and amplitude tremor of the voice in a sustained phonation task. Our findings revealed that IwPD showed significantly more tongue, lip, and jaw tremor than CS. Kinematic tremor frequency and RMS amplitude did not differ between IwPD and CS. We found no group difference in voice tremor prevalence or frequency in our acoustic analysis. While intensity and power indices seemed stronger in IwPD compared to CS, these differences were not significant. We show that electromagnetic articulography is suited for identifying orolingual tremor. While kinematic tremor was more prevalent in IwPD, it also appeared in CS, underlining the importance of including control participants in this type of study. Articulatory clarity and variability before and after surgery for tongue cancer Tienkamp, T., van Ast, F., van der Veen, R., Rebernik, T., Buurke, R., Hoekzema, N., Polsterer, K., Sekeres, H., van Son, R., Wieling, M., Witjes, M., de Visscher, S., & Abur, D. (2025) Proceedings paper Proceedings of Interspeech. Relationship between objective and subjective perceptual measures of speech in individuals with head and neck cancer Halpern, B., Tienkamp, T., Rebernik, T., van Son, R., Wieling, M., Abur, D., & Toda, T. (2025) Proceedings paper Proceedings of Interspeech. An interpretable approach to detect case law on housing and eviction issues within the HUDOC database Mohammadi, M., Wieling, M., & Vols, M. (2025) Journal paper Artificial Intelligence and Law, https://doi.org/10.1007/s10506-025-09439-9. Abstract Case law plays a critical role in shaping our understanding of human rights, including the right to adequate housing. However, analyzing large legal databases like HUDOC, which contains over 40,000 cases, is a challenging task that requires automated solutions. This study focuses on detecting cases related to housing - a topic encompassing issues such as eviction, access to adequate housing and etc. - from the HUDOC database. For this, we developed classifiers to identify cases related to both housing and eviction issues. We first constructed a dataset usin",
  "content_length": 148533,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:12"
}