{
  "name": "Martin Leopold Kersten",
  "homepage": "http://homepages.cwi.nl/~mk",
  "status": "success",
  "content": "In Memoriam Martin Kersten Skip to main content In Memoriam Martin Kersten Sadly, Prof. Dr. M.L. (Martin) Kersten (1953-2022), fellow of CWI and emeritus professor of computer science at the University of Amsterdam, passed away on 6 July 2022 Publication date 12 jul 2022 Share this page Share on LinkedIn Share on Bluesky Share on Facebook Share on Twitter/X Sadly, Prof. Dr. M.L. (Martin) Kersten (1953-2022), Fellow of Centrum Wiskunde & Informatica (CWI), the national research center for mathematics and computer science in Amsterdam, and emeritus professor of computer science at the University of Amsterdam, passed away on 6 July 2022. His more than 40-year career was characterized by pioneering fundamental research and by the further development of his research results into software systems of which the architecture is now widely applied in many fields of science, by industry and government organizations. In 2020 he received a royal decoration for his exceptional achievements, he was appointed Knight of the Order of the Dutch Lion during the CWI lectures. Career in a nutshellMartin Kersten, born on 25 October 1953 in Amsterdam, went on to study mathematics at the Vrije Universiteit (VU) after HBS-B, where he obtained his doctorate in mathematics in 1979, extended with computer science and with a minor in administrative computer science. He obtained his doctorate on 6 June 1985 - also at the VU- and then joined the national research institute CWI in Amsterdam. There he became a chief scientific officer and started setting up a Database research group. Doing research and leading a research group has remained his main activity throughout his career, but he also always stayed connected to a university for one day a week. In addition to his appointment at CWI, he remained employed at the VU as well until mid-1994. In 1992 he also began lecturing as an associate professor at the University of Amsterdam (UvA), and there he was appointed professor of Information Systems, in particular Multimedia Databases, as of January 1994. He had an organizational role in major national research projects such as MultimediaN, Bricks and COMMIT.Pioneering science, vision and leadershipAt CWI, Martin Kersten explored new topics and entirely new areas in data-intensive computer science and led a large group of researchers from 1985 to 2011. In addition, as one of the prominent senior researchers, he was part of the management team from the first year CWI established it a in 1996. In particular, CWI's informatics research policy was largely shaped by his input. CWI appointed him as a Fellow with effect from 1 January 2011. A CWI Fellow is given a free role as a researcher without supervisory or management obligations. It was a token of appreciation for Martin Kersten's long-term scientific and managerial commitment to computer science and the institute.Surveying his entire career, two aspects of Martin Kersten's achievements and contributions to science particularly stand out. First, he has always demonstrated a long-term vision for fundamental research in the field. Second, he has succeeded in translating decades of constant and consistent research into open source products and systems that have truly great impact and are used worldwide in business and public organizations. His best-known brainchild is the open-source system MonetDB, which is further developed and commercially supported by CWI spin-off MonetDB Solutions. Friend and foe agree that he was one of the most creative and influential scientists worldwide in data-intensive computing. His methods have been transferred to later generations of CWI scientists and have thus led to further CWI systems and spin-offs.Distinctions and AwardsMartin Kersten's research and developmental work has also gained international recognition and emulation, and he has received multiple awards for the great impact and significance of his work for the science community and the computer science community. For example, in 2012 he received the Very Large Databases (VLDB) 10-year Best Paper Award together with colleagues Peter Boncz and Stefan Manegold, in 2014 the SIGMOD Edgar F. Codd Innovations Award. In 2016, he was presented with the ACM SIGMOD Systems Award for MonetDB, and was also named an ACM Fellow.Martin Kersten further received Best Paper Awards in SIGMOD 2009 and in EDBT (Extending Database Technology) 2010, Best Visionary Paper Award VLDB 2011, and Best Challenges Award CIDR (Conference on Innovative Data Systems Research) in 2013 and 2015.Board work conferences, journals, and professional organizationsOver the past 15 years, Martin Kersten has served on more than 50 program committees of conferences such as VLDB, EDBT, International Conference on Data Engineering (ICDE), SIGMOD, Scientific and Statistical Database Management Conference (SSDBM), International World Wide Web Conference (WWW). He served on editorial boards of international journals, for example: ACM Transactions on Database Systems and the VLDB Journal. He also served on the boards of the VLDB Endowment and the EDBT Association, and has taken a leadership role in a number of conferences, including the first database conference in the Netherlands (VLDB 1989). At his suggestion and others, the VLDB conference was transformed in 2008 into a hybrid between a conference and a journal, combining continuous submissions and a revision process with an annual conference in which all papers from a volume are presented.More informationCWI fellow Martin Kersten receives royal decorationMartin Kersten appointed acm fellowMartin Kersten receives 2016 Sigmod Systems awardInternational innovation award big data research Martin KerstenMartin Kersten appointed CWI fellow Cookies We use cookies. You can read more about this in our cookie statement. Reject Accept",
  "content_length": 5836,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:38"
}