{
  "name": "Martin Henze",
  "homepage": "https://www.martinhenze.de",
  "status": "success",
  "content": "Martin Henze – Security and Privacy in Industrial Cooperation Skip to content © Heidelberg Laureate Forum Foundation I am a tenure track assistant professor at the Faculty of Computer Science at RWTH Aachen University where I head the Security and Privacy in Industrial Cooperation (SPICe) group. My research focuses on security and privacy challenges of industrial networks and industrial data sharing, especially in the energy and production sectors. I continue to be affilliated with the Cyber ​​Analysis & Defense (CA&D) department at the Fraunhofer Institute for Communication, Information Processing and Ergonomics FKIE. Before, I headed the Security and Privacy research group at the chair of Communication and Distributed Systems (COMSYS) at RWTH Aachen University. I was a research intern at the Interdisciplinary Centre for Security, Reliability and Trust (SnT) at the University of Luxembourg. I studied computer science at RWTH Aachen University, where I obtained a Diploma degree (equiv. M.Sc.) and a PhD (Dr. rer. nat.). My advisor was Klaus Wehrle. My academic achievements were awarded with the Nachwuchsförderpreis Verbraucherforschung NRW, the Borchers-Plakette and the ICT Young Researcher Award. News 2025-07: Serving on the TPCs of ACM CCS 2026 and USENIX Security 2026. 2025-06: Honored to be shortlisted (Top 3) for the teaching award of the computer science department for my lecture on industrial network security. 2025-03: Joining the TPCs of IEEE S&P (Oakland) 2026 and NDSS 2026. 2025-02: I have been (again) recognized as a distinguished reviewer at NDSS 2025. 2025-02: Upcoming IEEE EuroS&P 2025 paper on multicast source authentication for CAN bus communication. Stay tuned! 2025-02: Congratulations to my student Laurenz for being awarded the ICT Young Researcher Award 2024! 2025-01: Paper on generalizable and comprehensible industrial intrusion detection accepted at USENIX Security 2025! 2024-08: We received a Distinguished Artifact Award at USENIX Security 2024 for our work on detecting evasions of SIEM rules. 2024-07: Serving on the TPC of USENIX Security 2025. 2024-05: Humbled to be invited to serve on the TPC of IEEE S&P (Oakland) 2025! 2024-04: Joining the TPCs of NDSS 2025 and RAID 2024. 2024-03: Awarded as a distinguished reviewer at NDSS 2024. 2024-01: Serving on the TPC of ACM CCS 2024. 2023-11: My student Olav was awarded the ICT Young Researcher Award 2023. Congratulations! 2023-10: Honored to be named an especially noteworthy reviewer (top 20% of reviewers) at RAID 2023. 2023-08: Papers accepted for publication at ESORICS 2023 and USENIX Security 2024, stay tuned! Trivia My Erdős number is (at most) four. Please let me know if you know about any shorter path. Some notable paths of length four include: Martin Henze → Thomas Engel → Gianluca Rizzo → Shmuel Zaks → Paul Erdős Martin Henze → Bernhard Rumpe → Alan Hartman → Ronald C. Mullin → Paul Erdős Martin Henze → Oliver Hohlfeld → Bruce M. Maggs → D. Frank Hsu → Paul Erdős Martin Henze → Nils Rothaug → Christof Paar → Israel Koren → Paul Erdős Four papers I co-authored are listed in Free Haven’s Selected Papers in Anonymity I won the inaugural Hüttengolf tournament of the Fraunhofer Center Digital Energy (with only 18 strokes)",
  "content_length": 3249,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:27"
}