{
  "name": "Martin Ziegler 0001",
  "homepage": "http://m.zie.de",
  "status": "success",
  "content": "Martin Ziegler Martin Ziegler (CV) Research Area: Computer Science for Continuous Data Email: rk.ca.tsiak@relgeiz; public PGP key Office: KAIST School of Computing, N1 #506 Phone: +82-42-350-3568 Short CV: 11.11.2002: PhD defense in Computer Science at Paderborn University 2003-2004: Post-doc in DFG Graduiertenkolleg 693   \"PaSCo\" 2005: Guest lecturer at the University of Southern Denmark; host: Klaus Meer 2006: von Humboldt fellow (JSPS scholarship) at Japan Advanced Institute of Science and Technology; host: 石原 哉 2007: visiting scholar at the Korea Institute for Advanced Study; host: 박형주 2008: Habilitation at the University of Paderborn 2008: Visiting Associate at the Korea Advanced Institute of Science and Technology (KAIST); host: 정지원 2009: DFG Heisenberg-Scholar at the Technical University of Vienna, Department of Theoretical Physics; host: Karl Svozil 2010-2015: Associate Professor (W2) at the Department of Mathematics, Technische Universität Darmstadt 2011-2015: elected member of the Faculty Council (re-elected 2013) 2012-2015: Speaker of IANUS: Interdisziplinäre Arbeitsgruppe Naturwissenschaft und Sicherheit Feb+Mar.2013: Visiting Researcher at the Graduate School of Information Science and Technology, University of Tokyo; host: 河村彰星 Oct.2013: elected to the university convention (\"Universitätsversammlung\" plus \"Senatsausschuß Lehre\") 2014~2021: steering committee of the Deutsche Vereinigung för Mathematische Logik und für Grundlagenforschung der Exakten Wissenschaften (DVMLG) Programme committee chair of the 12th International Conference on Computability and Complexity in Analysis (Tokyo'15) since 2015: professor of theoretical computer science at KAIST 2016~2024: council of the Association Computability in Europe 2020~2021: KAIST International Faculty Council See below for Awards, Projects, Publications, Group, Teaching, Memberships, Service Talks, and Miscellaneous. Honours and Awards: Preis für herausragende Abschlußarbeiten 1996/97 der Uni-GH Paderborn for the Diploma Thesis \"Eine alternative Formulierung der Quantenmechanik\". Multimedia Award 1998 founded by the German Ministry of Economy and Technology (BMWi) (jointly with Matthias Fischer and Tamás Lukovszki) for project Multimediale Entdeckungsreisen unserer Welt mit dem Internet Forschungspreis 2006 (jointly with Dr. Matthias Fischer) Best Paper at the 32nd Annual Conference on Artificial Intelligence (2009) for joint work with Florentin Neumann and Andrea Reichenberger: \"Variations of the Turing Test in the Age of Internet and Virtual Reality\" Athene Fachbereichspreis für Gute Lehre und Sonderpreis für Interdisziplinäre Lehre 2011 (gem. mit Gerd Buntkowsky und Hans-Jürgen Bär) JSPS BRIDGE Fellow 2013 (held 9 lectures at 4 academic institutions within 1 month in Japan) Report on Science Circle (Wissenschaftlicher Gesprächskreis, WGK), pp.144-146 in Festschrift on the occasion of the 20th Anniversary of German-Japanese Scientific Exchange (2015) Computer Science Colloquium Organizer (fall 2016) Projects Real Hypercomputation (DFG, full position, 2005-2009) Computability and Computational Complexity of Physical Theories (DFG, Heisenberg Fellowship, 2009-2010) German counterpart to Royal Society International Exchange Grant IE111233 (2012-2014) Host of TSUKAMOTO Yasuyuki (DAAD, 2014) Quantitative uniforme Komplexitätstheorie mehrwertiger reeller Funktionen und Operatoren in Analysis, DFG Zi 1009/4 funding Carsten Rösnick (Apr.2013-Feb.2015) and Matthias Schröder (Dez.2014-Jan.2016) German-Japanese Workshop on Theory and Practice of Real Computation supported in part by the German Research and Innovation Forum - Tokyo. PI in COMPUTAL, EU PIRSES 294962 (Feb.2012-Jan.2016) PI in Mathematical Fluid Dynamics, DFG IRTG 1529 funding Florian Steinberg (Sep.2013-Aug.2016) Research Collaborator in ELC: Exploring the Limits of Computation Leader of KAIST Seed Grant (Sep.2015-Dec.2018) Principal Investigator in Computing with Infinite Data, EU H2020 MSCA IRSES #731143 cofunding by NRF #2016K1A3A7A03950702 Project leader in Errorless Computing over Continuous Structures in Linear Algebra and Analysis, Korean Ministry of Science and ICT grant NRF-2017R1E1A1A03071032 Computer Science for Continuous Data Recent (2012ff) fully-reviewed journal publications: M. Ziegler: \"Real Computation with Least Discrete Advice: A Complexity Theory of Nonuniform Computability with Applications to Effective Linear Algebra\", pp.1108-1139 in Annals of Pure and Applied Logic vol.163 (2012) A.M. Pauly, M. Ziegler: \"Relative Computability and Uniform Continuity of Relations\", in the Journal of Logic and Analysis vol.5 (2013). A. Kawamura, H. Ota, C. Rösnick, M. Ziegler: \"Computational Complexity of Smooth Differential Equations\", Logical Methods in Computer Science vol.10:1 (2014). A. Kawamura, N. Müller, C. Rösnick, M. Ziegler: \"Computational Benefit of Smoothness: Parameterized Bit-Complexity of Numerical Operators on Analytic Functions and Gevrey's Hierarchy\", pp. 689-714 in Journal of Complexity vol.31:5 (2015). C. Herrmann and M. Ziegler: \"Computational Complexity of Quantum Satisfiability\", Journal of the ACM article 19 vol 63:2 (2016). C. Herrmann, Yasuyuki Tsukamoto (塚本 靖之), M. Ziegler: \"On the Consistency Problem for Modular Lattices and Related Structures\", pp.1573-1595 in the International Journal of Algebra and Computation vol.26:8 (2016). A. Kawamura, F. Steinberg, M. Ziegler: \"On the Computational Complexity of the Dirichlet Problem for Poisson's Equation, pp.1437-1465 in Mathematical Structures in Computer Science vol.27:8 (2017). C. Herrmann and M. Ziegler: \"Definable Relations in Finite-Dimensional Subspace Lattices with Involution\" article #68 in Algebra Universalis vol.79 (2018). I. Koswara, G. Pogudin, S. Selivanova, M. Ziegler: \"Bit-complexity of classical solutions of linear evolutionary systems of partial differential equations\", Journal of Complexity vol.76 (2023). See also the full list of publications in MathReviews, according to Google, DBLP, and my own record as well as preprints. Group members: BSc. Sehun Park BSc. Jaden Jorradol MSc. Donghyun Lim (임동현) Dr. Alexander Stoimenov, external consultant Eunhee Seong, administrative assistant Main Collaborators: 河村彰星 Holger Thies 이계식 Klaus Meer Norbert Preining Michal Konecny Pieter Collins Participants in EU H2020 PIRSES 731143 Former group members (reverse chronologically) Dr. Svetlana Selivanova MSc. Hyunwoo Lee (이현우), now working at Craft Technologies Dr. Sewon Park (박세원), now postdoc at Kyoto University BSc. Jiman Hwang (황지만) MSc. Ivan Koswara, now PhD student at NUS BSc Seokbin Lee (이석빈), now graduate student at Georgia Tech TAs Seungwoo Lee, Namjo Ahn, Nguyen Viet Dung, Talipov Anuar Dongseong Seon (선동성), now working for KRAFTON Game Union Chansu Park (박찬수), now working for Skelter Labs Seungwoo Schin (신승우), founder of 미국주식사관학교 Junhee Cho (조준희), now working for Google Jaewoong Han (한재웅), Waterloo University Bastian Dörig, TU Darmstadt Dr. Matthias Schröder Dr. Florian Steinberg Dipl.-Math. Robin Hesse Dr. Hugo Férée Dr. Carsten Rösnick-Neugebauer MSc. TSUKAMOTO Yasuyuki (塚本 靖之) Eike Neumann Dr. Stéphane Le Roux Prof. 森 隆一 and wife (visiting TUD from April to September 2012) 河村彰星 (Ph.D), visiting TUD from August to September 2011 Many, many interesting theses have been completed under my supervision; further topics are available on request. (Prospective) students may consider advice by Sue Moon, by Sir Michael Atiyah, Béla Bollobás, Alain Connes, Dusa McDuff, Peter Sarnak, by the late Greg Hjorth and by the later Gian-Carlo Rota, as well as from Jorge Cham's online comic series and another graduate. Teaching since Fall 2022: Introduction to Algorithms (CS300) with 200 students Foundation of VR/AI/MMORPG (CS492G) flipped learning Theory of Computation (CS422) with 60 students Future(s) of the World (CS492F) Design and Analysis of Algorithms (CS500) with 100 students Unconventional Computing (CS492A) Design and Analysis of Algorithms (CS500) with 100 students Full teaching history... Professional Memberships: Deutsche Mathematiker Vereinigung (DMV) Societe Mathematique de France (SMF) Mathematical Society of Japan (MSJ) Korean Mathematical Society (KMS) Deutsche Vereinigung für Mathematische Logik und für Grundlagenforschung der Exakten Wissenschaften (DVMLG) Association for Symbolic Logic (ASL) Society for Industrial and Applied Mathematics (SIAM, lifetime) Association for Computing Machinery (ACM lifetime) European Association for Theoretical Computer Science (EATCS) European Association for Computer Science Logic (EACSL) Forum InformatikerInnen für Frieden und gesellschaftliche Verantwortung (FIfF) Gesellschaft für Informatik (GI) + Fachbereich Grundlagen + Fachgruppe Computeralgebra Institute for Electrical and Electronics Engineers (IEEE) Deutsche Physikalische Gesellschaft (DPG) Conference Organization/Programme Committee Memberships 51st International Colloquium on Automata, Languages and Programming (ICALP 2024, PC Member) 47th International Colloquium on Automata, Languages and Programming (ICALP 2020, PC Member) 37th Symposium on Theoretical Aspects of Computer Science (PC Member) 16th Annual Conference on Theory and Applications of Models of Computation (PC Member) 13th Annual International Conference on Combinatorial Optimization and Applications (PC Member) 22nd Korea-Japan Joint Workshop on Algorithms and Computation (WAAC 2019), local co-organizer 25th International Computing and Combinatorics Conference (PC Member) 12th Annual International Conference on Combinatorial Optimization and Applications (PC Member) 15th Int. Conf. on Computability and Complexity in Analysis (CCA 2018, PC Chair) Second Workshop on Mathematical Logic and its Application (JAIST, PC Member) 28th International Symposium on Algorithms and Computation (ISAAC, PC Member) CCC 2017 (PC Member) Colloquium Logicum (PC Member) PhDs in Logic 2016 (PC Member) 6th Int. Conf. on Mathematical Aspects of Computer and Information Sc",
  "content_length": 15917,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:49"
}