{
  "name": "Martin Pinzger 0001",
  "homepage": "https://pinzger.github.io",
  "status": "success",
  "content": "Martin Pinzger Toggle navigation Martin Pinzger @ SERG Publications Teaching Students Wanted Service Highlights Personal Info Martin Pinzger, Prof. Dr. Professor of Software Engineering Software Engineering Research Group Universität Klagenfurt Universitätsstraße 65-67 9020 Klagenfurt, Austria E-mail: martin.pinzger (atDomain) aau (dot) at Phone: +43 463 2700 3513 Office: S.2.79 I am a Full Professor of Software Engineering at the Universität Klagenfurt, Austria. I am leading the Software Engineering Research Group and heading the Department of Informatics Systems. I received a MSc (Dipl. Ing.) in 2001 and PhD (Dr. techn.) in 2005 in informatics from the Vienna University of Technology. I was a Postdoc in the Software Evolution and Architecture Lab at the University of Zurich and an Assistant Professor in the Software Engineering Research Group at the Delft University of Technology from which I received tenure in 2012. In 2012, I won a prestigious NWO Vidi grant for my research proposal on recording and analysis of fine-grained code changes. In 2013, I received an ICSE 2013 ACM SIGSOFT distinguished paper award for our work on data clone detection in spreadsheets and the ICSM 2013 most influential paper award for our work on the release history database. In 2014, I received the ICSME 2014 best paper award for our work on a genetic algorithm to refactor fat Java interfaces. In 2025, our work on ChangeDistiller got selected by TSE as one of the most influential papers of IEEE TSE’s 4th decade. I am a member of ACM and a senior member of IEEE. My research focuses on investigating methods, techniques, and tools to support the development and evolution of software systems. My current topics of interest are: AI for Software Engineering Mining Software Repositories Software Testing Program Analysis Software Visualization For more details, see my recent publications and wanted. I am always on the lookout for PhD and Master’s Students with strong technical and research skills to do a PhD or Master’s Thesis with me. See wanted for more information or drop me an email. Open positions At the moment, we do not have any open positions. News June 2025 Joined the PC of MSR 2026 co-located with ICSE 2026 in Rio de Janeiro, Brazil. May 2025 Feeling very honored. Received my third FSE 2025 Distinguished Reviewer Award. May 2025 Joined the PC of FSE 2026 in Montreal, Canada. January 2025 Got invited by the IEEE Transactions on Software Engineering to write a retrospective of our work on ChangeDistiller that was selected as one of the most influential papers of IEEE TSE’s 4th decade. Early Access Version. ... see all News Upcoming Conferences ICSME 2025 ASE 2025 FSE 2026 SANER 2026 ICSE 2026 MSR 2026 © 2018-2025 by Martin Pinzger",
  "content_length": 2758,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:37"
}