{
  "name": "Martin Nöllenburg",
  "homepage": "https://www.ac.tuwien.ac.at/people/noellenburg",
  "status": "success",
  "content": "Martin Nöllenburg – Algorithms and Complexity Group Martin Nöllenburg » Univ.Prof. Dipl.-Inform. Dr.rer.nat. contact | research | cv | activities | teaching | publications Address: Martin Nöllenburg Technische Universität Wien Institute of Logic and Computation Favoritenstraße 9–11, E192-01 1040 Wien Austria Room: HC0405 Phone: +43(1)58801–192120 Email: noellenburg@ac.tuwien.ac.at Web: http://www.ac.tuwien.ac.at/people/noellenburg/ orcid.org/0000-0003-0454-3937 Research Interests graph algorithms, in particular for graph drawing and network visualization computational geometry, in particular algorithms for cartography and geovisualization algorithm engineering and combinatorial optimization Group Members Thomas Depian, PhD student Sara Di Bartolomeo, Postdoc Alexander Dobler, PhD student Simon Dominik Fink, Postdoc Alexander Firbas, PhD student Manuel Sorge, Postdoc Alumni Sujoy Bhore, Assistant Professor at IIT Bombay, India Andreas Gemsa, research engineer at Zalando Martin Gronemann Fabian Klute, Postdoc at UPC Guangping Li, Postdoc at TU Dortmund Roman Prutkin, engineer at Google Benjamin Niedermann, Postdoc at Universität Bonn Soeren Terziadis, Postdoc at TU Eindhoven Anaïs Villedieu, engineer at NanoXplore Markus Wallinger, Postdoc at TU Munich/Heilbronn Jules Wulms, Postdoc at TU Eindhoven Open positions For individual postdoc opportunities in our group funding through external fellowships may be possible, e.g., from FWF, MSCA European Fellowships, or the Humboldt Foundation. You are welcome to contact me and discuss your ideas. Currently, we do not have open PhD positions. We do not offer paid undergrad summer internships. Short CV 2020 Full Professor at TU Wien, Vienna, Austria 2017-2020 Associate Professor at TU Wien, Vienna, Austria 2015-2017 Tenure-Track Assistant Professor at TU Wien, Vienna, Austria 02/2015 Habilitation in Computer Science at Karlsruhe Institute of Technology, Germany 2010-2015 Head of Young Investigator Group at Karlsruhe Institute of Technology, Germany 2010 Postdoctoral researcher (DFG fellowship) at UC Irvine, California, USA 2005-2009 PhD student (Dr. rer. nat.) at Universität Karlsruhe, Germany 2002-2003 Visiting student and DAAD scholar at McGill University, Montreal, Canada 1999-2005 Studies of Computer Science at Universität Karlsruhe, Germany Activities co-editor in chief of the Journal of Graph Algorithms and Applications (JGAA) chair of the steering committee of the International Symposium on Graph Drawing and Network Visualization (GD) 2024-2026 Bachelor with Honors program coordinator guest editor of the special issue Experimental Aspects of Computational Geometry in Computational Geometry: Theory and Applications associate guest editor of the special issue Perception in Network Visualization in Journal of Perceptual Imaging program co-chair of the Computational Geometry Media Exposition at CG Week 2025 program co-chair of IEEE Pacific Vis (Conference Track) 2024 program co-chair of IEEE Pacific Vis (VisNotes) 2021 program co-chair of the International Symposium on Graph Drawing and Network Visualization (GD) 2016 steering committee of the International Symposium on Graph Drawing and Network Visualization (GD), elected member 2015-2017, 2018-2020, 2024-2026 program committees of the conferences ALENEX (2017), BDVA (2015), BigVis (2019, 2020, 2021, 2024), CG:MM (2016), COCOON (2021, 2022, 2026), DIAGRAMS (2021, 2022), ESA (2017), EuroCG (2019, 2021), EuroVis STAR (2024, 2026), FAW (2010), GD (2011, 2013, 2015, 2017, 2020, 2023), GraphViP (2014), ICCG (2019, 2020), IISA (2015, 2016), IVAPP (2020), IWOCA (2023), PacificVis (2012, 2013, 2014), PacificVis Notes (2015, 2016, 2017), SKILL (2015), SMW (2022), WADS (2025), WALCOM (2017, 2019, 2026) organizing committee co-chair of GD 2024, the Workshop on Computational Cartography 2022, the Schematic Mapping Workshop 2019, and ALGO 2017. co-organizer of Dagstuhl seminars 13151 (Drawing Graphs and Maps with Curves), 15052 (Empirical Evaluation for Graph Drawing), 17332 (Scalable Set Visualizations), 21062 (Parameterized Complexity in Graph Drawing), 23162 (New Frontiers of Parameterized Complexity in Graph Drawing), and 26442 (Parameterized Complexity in Graph Drawing: Challenges and Perspectives). co-organizer of art exhibition Bending Reality: Where arc and science meet (Dagstuhl, 2013) Teaching Theses and Projects Please contact me if you are interested in writing your Bachelor/Master thesis or doing a project course in an area related to my research interests. Some general thesis topics are listed here and in TISS. Winter Term 2025/26 Lecture Algorithmic Geometry Lecture Algorithmics Seminar Graph Algorithms and Computational Geometry Seminar Wissenschaftliches Arbeiten PROLOG Informatik (TISS page) Summer Term 2025 Lecture Algorithmen und Datenstrukturen Lecture Graph Drawing Algorithms Publications Most of the publications are also listed at DBLP and Google Scholar. 219 results 2025 [219]Bundling-Aware Graph Drawing RevisitedMarkus Wallinger, Tommaso Piselli, Alessandra Tappini, Daniel Archambault, Giuseppe Liotta, Martin NöllenburgIEEE Trans. Vis. Comput. Graph., volume 31, number 12, pages 10828–10839, 2025. [bibtex] [doi] [218]Passenger Decision-Making in Mass Transit Systems: Insights From Dual-Process TheoriesArchana Prabhakar, Elise Grison, Simone Morgagni, Martin Nöllenburg, Valérie GyselinckApplied Cognitive Psychology, volume 39, number 5, pages e70112, 2025. [bibtex] [doi] [217]Planarizing Graphs and their Drawings by Vertex SplittingMartin Nöllenburg, Manuel Sorge, Soeren Terziadis, Anaïs Villedieu, Hsiang-Yun Wu, Jules WulmsJ. Computational Geometry, volume 16, number 1, pages 333–372, 2025. [bibtex] [doi] [216]Introducing Fairness in Network VisualizationPeter Eades, Seok-Hee Hong, Giuseppe Liotta, Fabrizio Montecchiani, Martin Nöllenburg, Tommaso Piselli, Stephen WismathInformation Sciences, volume 691, pages 121642, 2025. [bibtex] [doi] [215]An Introduction to and Survey of Biological Network VisualizationHenry Ehlers, Nicolas Brich, Jiacheng Yu, Michael Krone, Martin Nöllenburg, Hiroaki Natsukawa, Xiaoru Yuan, Hsiang-Yun WuComputers & Graphics, volume 126, pages 104115, 2025. [bibtex] [doi] [214]Optimizing Staircase Motifs in Biofabric Network LayoutsSara Di Bartolomeo, Markus Wallinger, Martin NöllenburgComput. Graph. Forum, pages e70139, 2025. [bibtex] [doi] [213]Constrained Boundary LabelingThomas Depian, Martin Nöllenburg, Soeren Terziadis, Markus WallingerComput. Geom. Theory Appl., volume 129, pages 102191, 2025. [bibtex] [doi] [212]Transitions in Dynamic Point LabelingThomas Depian, Guangping Li, Martin Nöllenburg, Jules WulmsCartography and Geographic Information Science, pages 1–26, 2025. [bibtex] [doi] [211]On Minimizing Wiggle in Stacked Area ChartsAlexander Dobler, Martin NöllenburgAlgorithms and Data Structures (WADS'25) (Pat Morin, Eunjin Oh, eds.), volume 349 of LIPIcs, pages 22:1–22:14, 2025, Schloss Dagstuhl – Leibniz-Zentrum für Informatik. [bibtex] [doi] [210]Representing Hypergraphs by Point-Line IncidencesAlexander Dobler, Stephen G. Kobourov, Debajyoti Mondal, Martin NöllenburgTheory and Practice of Computer Science (SOFSEM'25) (Rastislav Královic, Vera Kurková, eds.), volume 15538 of LNCS, pages 241–254, 2025, Springer. [bibtex] [doi] [209]Optimizing Wiggle in StorylinesAlexander Dobler, Tim Hegemann, Martin Nöllenburg, Alexander WolffGraph Drawing and Network Visualization (GD'25) (Vida Dujmović, Fabrizio Montecchiani, eds.), volume 357 of LIPIcs, pages 39:1–39:17, 2025, Schloss Dagstuhl – Leibniz-Zentrum für Informatik. [bibtex] [doi] [208]On Planar Unit-Length Linear Linkages in Polygonal DomainsThomas Depian, Carolina Haase, Martin Nöllenburg, André SchulzEuropean Workshop on Computational Geometry (EuroCG'25) (Jan Kratochvíl, Giuseppe Liotta, eds.), pages 55:1–55:9, 2025. [bibtex] [207]Geometry Matters in Planar StoryplansAlexander Dobler, Maximilian Holzmüller, Martin NöllenburgGraph Drawing and Network Visualization (GD'25) (Vida Dujmović, Fabrizio Montecchiani, eds.), volume 357 of LIPIcs, pages 27:1–27:9, 2025, Schloss Dagstuhl – Leibniz-Zentrum für Informatik. [bibtex] [doi] [206]Partial Level Planarity Parameterized by the Size of the Missing GraphThomas Depian, Simon D. Fink, Boris Klemz, Robert Ganian, Martin Nöllenburg, Marie Diana SieperEuropean Workshop on Computational Geometry (EuroCG'25) (Jan Kratochvíl, Giuseppe Liotta, eds.), pages 50:1–50:10, 2025. [bibtex] [205]The Peculiarities of Extending Queue LayoutsThomas Depian, Simon D. Fink, Robert Ganian, Martin NöllenburgGraph-Theoretic Concepts in Computer Science (WG'25) (Henning Fernau, Philipp Kindermann, eds.), 2025, Springer.Note: To appear. [bibtex] [doi] [204]Pathways to Tractability for Geometric ThicknessThomas Depian, Simon D. Fink, Alexander Firbas, Robert Ganian, Martin NöllenburgTheory and Practice of Computer Science (SOFSEM'25) (Rastislav Královic, Vera Kurková, eds.), volume 15538 of LNCS, pages 209–224, 2025, Springer. [bibtex] [doi] [203]Visualizing TreewidthAlvin Chiu, Thomas Depian, David Eppstein, Michael T. Goodrich, Martin NöllenburgGraph Drawing and Network Visualization (GD'25) (Vida Dujmović, Fabrizio Montecchiani, eds.), volume 357 of LIPIcs, pages 17:1–17:20, 2025, Schloss Dagstuhl – Leibniz-Zentrum für Informatik. [bibtex] [doi] [202]Quantum Speedups for Polynomial-Time Dynamic Programming AlgorithmsSusanna Caroppo, Giordano Da Lozzo, Giuseppe Di Battista, Michael Goodrich, Martin NöllenburgAlgorithms and Data Structures (WADS'25) (Pat Morin, Eunjin Oh, eds.), volume 349 of LIPIcs, pages 14:1–14:22, 2025, Schloss Dagstuhl – Leibniz-Zentrum für Informatik. [bibtex] [doi] 2024 [201]Computing Hive Plots: A Combinatorial FrameworkMartin Nöllenburg, Markus WallingerJ. Graph Algorithms Appl., volume 28, number 2, pages 101–129, 2024. [bibtex] [doi] [200]Computing Data-driven Multilinear Metro MapsMartin Nöllenburg, Soeren TerziadisThe Cartographic Journal, pages 1–16, 2024. [bibtex] [doi] [",
  "content_length": 62862,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:39"
}