{
  "name": "Martine Ceberio",
  "homepage": "http://utep.academia.edu/MartineCeberio",
  "status": "success",
  "content": "Martine Ceberio - University of Texas at El Paso (UTEP) Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Martine CeberioUniversity of Texas at El Paso (UTEP), Computer Science, Faculty MemberaddFollowdoneFollowingFollowers15Following1Public ViewsRelated Authors Chitta BaralArizona State University Scott Ferson Troy Tucker Nicholas Del RioAir Force Research Laboratory Claude Langrand Scot Ferson Scott StarksUniversity of Texas at El Paso (UTEP) Vladik Kreinovich Paulo Pinheiro da SilvaUniversity of Texas at El Paso (UTEP) Raul TrejoInterestsView All (7) UploadsPapers by Martine CeberioTaylor model-type techniques for handling uncertainty in expert systems, with potential applications to geoinformaticsProceedings of the 17th …, Jan 1, 2005Download Towards combining probabilistic and interval uncertainty in engineering calculationsProceedings of the …, Jan 1, 2004In many engineering applications, we have to combine probabilistic and interval errors. For examp... more In many engineering applications, we have to combine probabilistic and interval errors. For example, in environmental analysis, we observe a pollution level x(t) in a lake at different moments of time t, and we would like to estimate standard statistical characteristics such as mean, variance, autocorrelation, correlation with other measurements. In environmental measurements, we often only know the values with interval uncertainty. We must therefore modify the existing statistical algorithms to process such interval data. Such modification are described in this paper.Download An interval-valued 2-additive choquet integral for multicriteria decision makingProceedings of the 10th Conference …, Jan 1, 2004The aim of this paper is to show how fuzzy measures and intervals can be combined in order to pro... more The aim of this paper is to show how fuzzy measures and intervals can be combined in order to provide a simple and accurate practical solution to multi-criteria decision making problems. More specifically, we construct an interval-based Choquet integral in order to derive preferences over a set of multidimensional alternatives.Download Propagation and provenance of probabilistic and interval uncertainty in cyberinfrastructure-related data processing and data fusionProceedings of the …In the past, communications were much slower than computations. As a result, researchers and prac... more In the past, communications were much slower than computations. As a result, researchers and practitioners collected different data into huge databases located at a single location such as NASA and US Geological Survey. At present, communications are so much faster that it is possible to keep different databases at different locations, and automatically select, transform, and collect relevant data when necessary. The corresponding cyberinfrastructure is actively used in many applications. It drastically enhances scientists' ability to discover, reuse and combine a large number of resources, e.g., data and services.Download How to take into account dependence between the inputs: from interval computations to constraint-related set computations, with potential applications to …Journal of Uncertain …, Jan 1, 2007In many real-life situations, in addition to knowing the intervals x i of possible values of each... more In many real-life situations, in addition to knowing the intervals x i of possible values of each variable x i , we also know additional restrictions on the possible combinations of x i ; in this case, the set x of possible values of x = (x 1 , . . . , x n ) is a proper subset of the original box x 1 × . . . × x n . In this paper, we show how to take into account this dependence between the inputs when computing the range of a function f (x 1 , . . . , x n ).Download Computing population variance and entropy under interval uncertainty: linear-time algorithmsReliable computing, Jan 1, 2007In statistical analysis of measurement results it is often necessary to compute the range [V , V ... more In statistical analysis of measurement results it is often necessary to compute the range [V , V ] of theDownload Interval-based robust statistical techniques for non-negative convex functions, with application to timing analysis of computer chipsProceedings of the 2006 …, Jan 1, 2006In chip design, one of the main objectives is to decrease its clock cycle. On the design stage, t... more In chip design, one of the main objectives is to decrease its clock cycle. On the design stage, this time is usually estimated by using worst-case (interval) techniques, in which we only use the bounds on the parameters that lead to delays. This analysis does not take into account that the probability of the worst-case values is usually very small; thus, the resulting estimates are over-conservative, leading to unnecessary over-design and under-performance of circuits. If we knew the exact probability distributions of the corresponding parameters, then we could use Monte-Carlo simulations (or the corresponding analytical techniques) to get the desired estimates. In practice, however, we only have partial information about the corresponding distributions, and we want to produce estimates that are valid for all distributions which are consistent with this information.Download Greedy algorithms for optimizing multivariate Horner schemesACM SIGSAM Bulletin, Jan 1, 2004 Solving nonlinear systems by constraint inversion and interval arithmeticArtificial Intelligence and Symbolic …, Jan 1, 2001A reliable symbolic-numeric algorithm for solving nonlinear systems over the reals is designed. T... more A reliable symbolic-numeric algorithm for solving nonlinear systems over the reals is designed. The symbolic step generates a new system, such the formulas are different but the solutions are preserved, through partial factorizations of polynomial expressions, and constraint inversion. The numeric step is a branch-and-prune algorithm based on interval constraint propagation to compute a set of outer approximations of the solutions. The processing of the inverted constraints by interval arithmetic provides a fast and efficient method to contract the variables' domains. A set of experiments for comparing several constraint solvers is reported.Download Towards combining probabilistic and interval uncertainty in engineering calculations: algorithms for computing statistics under interval uncertainty, and their …Reliable …, Jan 1, 2006In many engineering applications, we have to combine probabilistic and interval uncertainty. For ... more In many engineering applications, we have to combine probabilistic and interval uncertainty. For example, in environmental analysis, we observe a pollution level x(t) in a lake at different moments of time t, and we would like to estimate standard statistical characteristics such as mean, variance, autocorrelation, correlation with other measurements. In environmental measurements, we often only measure the values with interval uncertainty. We must therefore modify the existing statistical algorithms to process such interval data.Download ×CloseLog InLog in with GoogleorEmailPasswordRemember me on this computeror reset passwordEnter the email address you signed up with and we'll email you a reset link. Need an account? Click here to sign up AboutPressPapersTopicsAcademia.edu Journals We're Hiring! Help CenterFind new research papers in:PhysicsChemistryBiologyHealth SciencesEcologyEarth SciencesCognitive ScienceMathematicsComputer ScienceTermsPrivacyCopyrightContent PolicyAcademia ©2025",
  "content_length": 7814,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:52"
}