{
  "name": "Martin D. Flintham",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/martin.flintham",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Martin FlinthamAssociate Professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom C02 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/amartin.flintham@nottingham.ac.ukhttps://www.cs.nott.ac.uk/~mdf/ Recent Publications BACHOUR, KHALED, WETZEL, RICHARD, FLINTHAM, MARTIN, HUYNH, TRUNG DONG, RODDEN, TOM A and MOREAU, LUC, 2015. Provenance for the People: A User-Centered Look at the W3C PROV Standard through an Online Game In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. FLINTHAM, MARTIN, VELT, RAPHAEL, WILSON, MAX, ANSTEAD, EDWARD, BENFORD, STEVE, BROWN, ANTHONY, PEARCE, TIMOTHY and PRICE, DOMINIC, 2015. Run Spot Run : Capturing and Tagging Footage of a Race by Crowds of Spectators In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. DARZENTAS, DIMITRIOS, BROWN, MICHAEL and FLINTHAM, MARTIN, 2015. The Data Driven Lives of Wargaming Miniatures In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. REEVES, STUART, GREIFFENHAGEN, CHRISTIAN, FLINTHAM, MARTIN, BENFORD, STEVE, ADAMS, MATT, ROW-FARR, JU and TANDAVANITJ, NICK, 2015. I’d Hide You: Performing Live Broadcasting in Public In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. View all publications BACHOUR, KHALED, WETZEL, RICHARD, FLINTHAM, MARTIN, HUYNH, TRUNG DONG, RODDEN, TOM A and MOREAU, LUC, 2015. Provenance for the People: A User-Centered Look at the W3C PROV Standard through an Online Game In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. FLINTHAM, MARTIN, VELT, RAPHAEL, WILSON, MAX, ANSTEAD, EDWARD, BENFORD, STEVE, BROWN, ANTHONY, PEARCE, TIMOTHY and PRICE, DOMINIC, 2015. Run Spot Run : Capturing and Tagging Footage of a Race by Crowds of Spectators In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. DARZENTAS, DIMITRIOS, BROWN, MICHAEL and FLINTHAM, MARTIN, 2015. The Data Driven Lives of Wargaming Miniatures In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. REEVES, STUART, GREIFFENHAGEN, CHRISTIAN, FLINTHAM, MARTIN, BENFORD, STEVE, ADAMS, MATT, ROW-FARR, JU and TANDAVANITJ, NICK, 2015. I’d Hide You: Performing Live Broadcasting in Public In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. KHER HUI NG, VICTORIA SHIPP, RICHARD MORTIER, STEVE BENFORD, MARTIN FLINTHAM and TOM RODDEN, 2015. Understanding Food Consumption Lifecycles Using Wearable Cameras Personal and Ubiquitous Computing. 19(7), 1183-1195NG, KHER HUI, SHIPP, VICTORIA, MORTIER, RICHARD, BENFORD, STEVE, FLINTHAM, MARTIN and RODDEN, TOM, 2015. Understanding food consumption lifecycles using wearable cameras Personal and Ubiquitous Computing. 19(7), 1183-1195EVANS, ELIZABETH, FLINTHAM, MARTIN and MARTINDALE, SARAH, 2014. The Malthusian Paradox: Performance in an Alternate Reality Game Pervasive Ubiquitous Computing. BLUM, J, KEFALIDOU, G, HOUGHTON, RJ, FLINTHAM, M, ARUNCHALAM, U and GOULDEN, M, 2014. Majority Report: Citizen Empowerment through Collaborative Sensemaking In: The 11th International Conference on Information Systems for Crisis Response and Management - ISCRAM 2014. CHOWANDA, A., BLANCHFIELD, P., FLINTHAM, M. and VALSTAR, M., 2014. ERiSA: Building Emotionally Realistic Social Game-Agents Companions In: Proceedings 14th International Conference, IVA 2014. 134-143BROWN, MICHAEL, PINCHIN, JAMES, BLUM, JESSE, SHARPLES, SARAH, SHAW, DOMINIC, HOUSLEY, GEMMA, HOWARD, SAM, JACKSON, SUSAN, FLINTHAM, MARTIN, BENNING, KELLY and OTHERS, 2014. Exploring the Relationship between Location and Behaviour in Out of Hours Hospital Care. In: HCI International 2014-Posters’ Extended Abstracts Springer. 395-400ANSTEAD, EDWARD, FLINTHAM, MARTIN and BENFORD, STEVE, 2014. Studying MarathonLive: consent for in-the-wild research In: Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. 665-670TOLMIE, P., BENFORD, S., FLINTHAM, M., BRUNDELL, P., ADAMS, M., TANDAVANITJ, N., ROW-FARR, J. and GIANNACHI, G., 2012. “Act Natural”: instructions, compliance and accountability in ambulatory experiences In: CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Austin, May 5-12, ACM. 1519-1528CHAMBERLAIN, A., OPPERMANN, L., FLINTHAM, M., BENFORD, S., TOLMIE, P., ADAMS, M., FARR, J.R., TANDAVANITJ, N., MARSHALL, J. and RODDEN, T., 2011. Locating experience: touring a pervasive performance Personal and Ubiquitous Computing. 15(7), 717-730OPPERMANN, L., FLINTHAM, M., REEVES, S., BENFORD, S., GREENHALGH, C., MARSHALL, J., ADAMS, M., FARR, J. and TANDAVANITJ, N., 2011. Lessons from touring a location-based experience. In: LYONS, K., HIGHTOWER, J. and HUANG, E.M., eds., Pervasive computing: 9th international conference, Pervasive 2011, San Francisco, USA, June 12-15, 2011 Springer. 232-249FLINTHAM, M., REEVES, S., BRUNDELL, P., GLOVER, T., BENFORD, S., ROWLAND, D., KOLEVA, B., GREENHALGH, C., ADAMS, M., TANDAVANITJ, N. and ROW FARR, J., 2011. Flypad: designing trajectories in a large-scale permanent augmented reality installation In: ECSCW 2011: Proceedings of the 12th European Conference on Computer Supported Cooperative Work, 24-28 September 2011, Aarhus Denmark. 233-252FLINTHAM, M., GREENHALGH, C., LODGE, T., CHAMBERLAIN, A., PAXTON, M., JACOBS, R., WATKINS, M. and SHACKFORD, R., 2011. A case study of exploding places, a mobile location-based game In: ACE '11: Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology. n/aSCHNÄDELBACH, H., GALANI, A. and FLINTHAM, M., 2010. Embedded Mixed Reality Environments: The Engineering of Mixed Reality Systems The Engineering of Mixed Reality Systems. 57-78FLINTHAM, M., PRICE, D., ROWLAND, D., BENFORD, S., ADAMS, M., FARR, J.R. and TANDAVANITJ, N., 2010. From Consumer to Producer: Ubiquitous Technologies for Outside Broadcast ROWLAND, D., FLINTHAM, M., OPPERMANN, L., MARSHALL, J., CHAMBERLAIN, A., KOLEVA, B., BENFORD, S. and PEREZ, C., 2009. Ubikequitous computing: designing interactive experiences for cyclists In: MobileHCI '09: proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services. n/aBENFORD, S., DROZD, A., GREENHALGH, C., FRASER, M., SCHNÄDELBACH, H., KOLEVA, B., ANASTASI, R., FLINTHAM, M., HEMMINGS, T. and CRABTREE, A., 2008. Orchestrating Real-Time Participatory Experiences FLINTHAM, M, 2007. Supporting Mobile Mixed-Reality Experiences GREENHALGH, C., BENFORD, S., DROZD, A., FLINTHAM, M., HAMPSHIRE, A., OPPERMANN, L., SMITH, K. and VON TYCOWICZ, C., 2007. Addressing mobile phone diversity in ubicomp experience development: UbiComp 2007: Ubiquitous Computing UbiComp 2007: Ubiquitous Computing. 447-464FLINTHAM, M., SMITH, K., BENFORD, S., CAPRA, M., GREEN, J., GREENHALGH, C., WRIGHT, M., ADAMS, M., TANDAVANITJ, N. and ROW-FARR, J., 2007. Day of the figurines: A slow narrative-driven game for mobile phones using text messaging: Proc. PerGames Proc. PerGames. FLINTHAM, M., GIANNACHI, G., BENFORD, S. and ADAMS, M., 2007. Day of the figurines: supporting episodic storytelling on mobile phon CRABTREE, A., BENFORD, S., CAPRA, M., FLINTHAM, M., DROZD, A., TANDAVANITJ, N., ADAMS, M. and ROW FARR, J., 2007. The cooperative work of gaming: orchestrating a mobile SMS game: Computer Supported Cooperative Work (CSCW) Computer Supported Cooperative Work (CSCW). 16(1), 167-198BENFORD, S., CRABTREE, A., FLINTHAM, M., DROZD, A., ANASTASI, R., PAXTON, M., TANDAVANITJ, N., ADAMS, M. and ROW-FARR, J., 2006. Can you see me now? ACM Transactions on Computer-Human Interaction. 13(1), 100-133BENFORD, S., CRABTREE, A., FLINTHAM, M., DROZD, A., ANASTASI, R., PAXTON, M., TANDAVANITJ, N., ADAMS, M. and ROW-FARR, J., 2006. Can you see me now?: ACM Transactions on Computer-Human Interaction (TOCHI) ACM Transactions on Computer-Human Interaction (TOCHI). 13(1), 100-133BENFORD, S., CRABTREE, A., REEVES, S., SHERIDAN, J., DIX, A., FLINTHAM, M. and DROZD, A., 2006. The frame of the game: Blurring the boundary between fiction and reality in mobile experiences BENFORD, S., FLINTHAM, M., DRODZ, A., TANDAVANITJ, N., ADAMS, M. and FARR, J.R., 2006. The design and experience of the location-based performance uncle roy all around you: Leonardo Electronic Almanac Leonardo Electronic Almanac. 14(3), SHERIDAN, J., DIX, A., CRABTREE, A., BENFORD, S., REEVES, S. and FLINTHAM, M., 2006. The frame of the game: blurring the boundary between fiction and reality in mobile experiences BENFORD, S., ROWLAND, D., FLINTHAM, M., DROZD, A., HULL, R., REID, J., MORRISON, J. and FACER, K., 2005. Life on the edge: supporting collaboration in location-based experiences FLINTHAM, M., 2005. Painting the town red: configuring location-based games by colouring maps CAPRA, M., RADENKOVIC, M., BENFORD, S., OPPERMANN, L., DROZD, A. and FLINTHAM, M., 2005. The multimedia challenges raised by pervasive games CRABTREE, A., BENFORD, S.D., RODDEN, T.A., GREENHALGH, C.M., FLINTHAM, M., ANASTASI, R., DROZD, A., ADAMS, M., ROW-FARR, J., TANDAVANITJ, N. and STEED, A., 2004. Orchestrating a mixed reality game 'on the ground' In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Vienna, Austria, 24-29 April 2004. 391-398BENFORD, S.D., SEAGAR, W., F",
  "content_length": 17332,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:18"
}