{
  "name": "Martin Wollschläger",
  "homepage": "https://tu-dresden.de/ing/informatik/institut-fuer-angewandte-informatik/professur-fuer-prozesskommunikation/die-professur/inhaber?set_language=en",
  "status": "success",
  "content": "Prof. Dr.-Ing. habil. Martin Wollschlaeger — Chair of Industrial Communications — TU Dresden Skip to main navigation Skip to main navigation Skip to search Skip to content © Martin Wollschlaeger Martin Wollschlaeger studied Electrical Engineering at Otto-von-Guericke University Magdeburg. He received his Ph.D. in 1991 and Habilitation degree in 2001 for research in automation and control systems. From 2000 to 2003 he worked as a researcher at ifak Institut für Automation und Kommunikation e.V., Magdeburg. Since November 2003 he is full professor at TU Dresden, chair of Industrial Communications, and director of the Institute of Applied Computer Science, Faculty of Computer Science at TU Dresden. His research topics are industrial communication systems and automation networks. This includes fieldbuses and industrial Ethernet, information modeling, middleware concepts, management of heterogeneous networks, life cycle management, and semantic descriptions. The main goal of this work is to support and to enhance integration processes in manufacturing. Prof. Wollschlaeger has published more than 150 papers in international and national journals and conference proceedings. He also works in several program and organizational committees of international and national conferences (IEEE ETFA, IEEE WFCS, IEEE INDIN, VDI/GMA Automation, KommA, etc.) and as reviewer for journals (e.g. IEEE Transactions on Industrial Informatics (TII), Transactions on Industrial Electronics (TIE), atp). He is involved in standardization activities at DKE (DKE 9.31.0.2 Unternehmensmodelle (MES), DKE 9.31.0.12 Life Cycle Management) and IEC TC65 (IEC TC65 / WG19 Life Cycle Management, Convener of IEC TC65E / WG11 Condition Monitoring). He and his group actively contribute to working groups at PROFIBUS International, ZVEI (German association of vendors in Electrical and Electronic Industry), and VDI/GMA (German association on Measurement and Control), VDMA (German association of machine vendors). The topics covered by these activities range from dedicated communication technologies, engineering approaches, condition monitoring and predictive maintenance, up to CPS and CPS applications in Industrie 4.0. Prof. Wollschlaeger has been leading and taking part in several nationally or European funded projects and is supporting roadmapping activities in EU and German contexts, including 5G PPP. About this page Frank Hilbert Last modified: Apr 12, 2022 Page Actions Share on Facebook Share on Twitter/X Print Page Send Page Via Email",
  "content_length": 2534,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:48"
}