{
  "name": "Martin Kellogg",
  "homepage": "https://web.njit.edu/~mjk76",
  "status": "success",
  "content": "Martin Kellogg Martin Kellogg Office: GITC 4314 (calendar) martin.kellogg@njit.edu GitHub I’m an assistant professor at the New Jersey Institute of Technology, in the Department of Computer Science. You can find me most days in my office: GITC 4314; feel free to come by any time that my calendar says that I’m free. My research focuses on making software verification practical for every developer: that is, on making verification a standard part of every developer’s toolkit, in the way that techniques like unit testing or code review are today. My focus is primarily on two approaches to making verification more practical: improving the expressivity of simple verification technologies: making it possible to prove more facts about a program within the constraints that developers actually work under. Examples of this approach include my work on accumulation analysis for resource leaks (ESEC/FSE 2021) and for initialization (ICSE 2020). convincing developers of the benefits of verification: by deploying verification technologies in new domains, and by improving the usability of verification. An example of this approach is my work on compliance verification (ASE 2020). I completed my Ph.D. at the University of Washington Paul G. Allen School of Computer Science & Engineering. I worked in the PLSE group under the supervision of Michael Ernst. Outside of work, I enjoy playing all kinds of games—video, tabletop, board, etc.—skiing, watching baseball and soccer, reading, and a little bit of tea snobbery. Some of my favorite games include Civilization, Dungeons and Dragons, and Dominion. I’m a big fan of the Washington Nationals and of the Seattle Sounders. I’ve made my academic job market materials publicly available: CV Research statement Teaching statement Diversity and Inclusion statement Job Talk: “Verification for working developers” News Jun 25 I was honored to receive a Distinguished Reviewer award at FSE this year. Reviewing takes a lot of time, but I think it’s important for us all to do our part to help our community stay healthy. May 9 I’m extremely honored to have won the 2024-25 James A. McHugh Excellence in Teaching for Faculty award. Thanks to YWCC’s selection committee and to my students, without whom there would be no teaching :) Apr 28 Heading to ICSE 2025 in Ottawa, where I’ll be helping to run the new STATIC workshop tomorrow. If you’ll be around at ICSE and want to chat, send me an email! Mar 31 I’m super excited that our paper “Static Program Reduction via Type-Directed Slicing” will appear at ISSTA this year! I’m especially proud that this is my first paper without any other senior authors - just my students and I! I think this work has the potential to be really cool, and I’m excited to continue to build on it. You can also check out the implementation, which we’re still continuing to improve! Feb 11 I’m delighted that our paper “A New Approach to Evaluating Nullability Inference Tools” will appear at FSE this year! Congratulations to my student Erfan Arvan for his hard work on this paper, and to my collaborators Nima Karimipour and Manu Sridharan at UC Riverside. We couldn’t have done it without you :) Papers Repairing Leaks in Resource Wrappers Sanjay Malakar Michael D. Ernst Martin Kellogg Manu Sridharan Automated Software Engineering (ASE), November 2025 [bibtex] [implementation] [artifact] Static Program Reduction via Type-Directed Slicing Loi Ngo Duc Nguyen Tahiatul Islam Theron Wang Sam Lenz Martin Kellogg International Symposium on Software Testing and Analysis (ISSTA), June 2025 [bibtex] [implementation] [artifact] A New Approach to Evaluating Nullability Inference Tools Nima Karimipour Erfan Arvan Martin Kellogg Manu Sridharan Foundations of Software Engineering (FSE), June 2025 [bibtex] [slides] [artifact] Lightweight and Modular Resource Leak Checking (Extended Version) Narges Shadab Pritam Gharat Shrey Tiwari Michael D. Ernst Martin Kellogg Shuvendu Lahiri Akash Lal Manu Sridharan International Journal on Software Tools for Technology Transfer (SOAP 2024 edition), April 2025 [bibtex] On the Relationship Between Code Verifiability and Understandability Kobi Feldman Martin Kellogg Oscar Chaparro European Software Engineering Conference/Foundations of Software Engineering (ESEC/FSE), December 2023 [bibtex] [artifact] [slides] [talk video] Inference of Resource Management Specifications Narges Shadab Pritam Gharat Shrey Tiwari Michael D. Ernst Martin Kellogg Shuvendu Lahiri Akash Lal Manu Sridharan Proceedings of the ACM on Programming Languages (OOPSLA), October 2023 [bibtex] [artifact] Pluggable Type Inference for Free Martin Kellogg Daniel Daskiewicz Loi Ngo Duc Nguyen Muyeed Ahmed Michael D. Ernst Automated Software Engineering (ASE), September 2023 [bibtex] [scripts and data] [slides] [implementation] Accumulation Analysis Martin Kellogg Narges Shadab Manu Sridharan Michael D. Ernst European Conference on Object-Oriented Programming (ECOOP), June 2022 [bibtex] [artifact (data for literature survey)] [slides (pdf)] [slides (pptx)] Lightweight Verification via Specialized Typecheckers Martin Kellogg PhD Thesis, University of Washington, Seattle, USA, June 2022 [bibtex] Lightweight Verification via Specialized Typecheckers Martin Kellogg doctoral symposium at ESEC/FSE 2021, August 2021 [bibtex] [slides] Lightweight and Modular Resource Leak Verification Martin Kellogg Narges Shadab Manu Sridharan Michael D. Ernst European Software Engineering Conference/Foundations of Software Engineering (ESEC/FSE), August 2021 (note that this version of the paper has been updated to correct a minor error in table 3) [bibtex] [artifact (scripts and data)] [slides (pdf)] [talk recording] Continuous Compliance Martin Kellogg Martin Schäf Serdar Tasiran Michael D. Ernst Automated Software Engineering (ASE), August 2020 [bibtex] [artifact (scripts and data)] [slides (pdf)] [slides (pptx)] [key-length checker] [crypto-policy checker] [bucket-compliance checker] [no-literal checker] Verifying Object Construction Martin Kellogg Manli Ran Manu Sridharan Martin Schäf Michael D. Ernst International Conference on Software Engineering (ICSE), May 2020 [bibtex] [code] [artifact (VM image)] [talk video] [slides (pdf)] [slides (pptx)] Compile-time Detection of Machine Image Sniping Martin Kellogg ASE 2019 Student Research Competition, Graduate Division, November 2019 Won 1st place at ASE ‘19’s Student Research Competition [bibtex] [slides (PDF)] [poster (PDF)] Lightweight Verification of Array Indexing Martin Kellogg Vlastimil Dort Suzanne Millstein Michael D. Ernst International Symposium on Software Testing and Analysis (ISSTA), July 2018 [bibtex] [slides (PDF)] [slides (PPTX)] [artifact] [docker image] Combining Bug Detection and Test Case Generation Martin Kellogg FSE 2016 Student Research Competition, Undergraduate Division, November 2016 Won 1st place at FSE ‘16 and 3rd place in the SRC Grand Finals [bibtex] Combining Bug Detection and Test Case Generation Martin Kellogg Benjamin Floyd Stephanie Forrest Wes Weimer Technical Report, September 2016 [bibtex] Teaching Spring 2026: CS 485/698: AI-Assisted Software Engineering (Under Construction) Fall 2025: CS 490: Guided Design in Software Engineering Spring 2025: CS 485: Compilers Fall 2024: CS 490: Guided Design in Software Engineering Spring 2024: CS 684: Testing and Quality Assurance Fall 2023: CS 490: Guided Design in Software Engineering Spring 2023: CS 490: Guided Design in Software Engineering Fall 2022: CS 785: Practical Program Analysis Students and Alumni This section lists all of the past and present PhD students that I've supervised, and a selection of past undergraduate and masters students who have stayed in academia after working with me. If you're a past undergraduate or masters student and you think you should be on this list, send me an email. Kazi Amanul Islam Siddiqui, PhD student, 2023-present Erfan Arvan, PhD student, 2023-present Loi Nguyen, undergraduate student, 2022-2024 (PhD at UC Riverside since Fall 2024) Professional Service Program Committee member, PLDI 2026 Program Committee member, FSE 2025-6 Sponsorship Co-chair, SPLASH 2024-5 Program Committee member, ISSTA 2023-25 Student Research Competition judge, ESEC/FSE 2023 Co-chair for Student Volunteers, ISSTA 2023 Student Research Competition judge, PLDI 2023 External Review Committee member, OOPSLA 2022-23 Artifact Evaluation Committee member, PLDI 2020 Program Committee member, testing tools track, ICST 2020 Artifact Evaluation Committee member, VMCAI 2020 Funding Collaborative Research: SHF: Small: Verification-guided Assessment and Reduction of Code Complexity Martin Kellogg Oscar Chaparro $600,000 from the NSF CCF over 3 years (my share $300,000), July 2024 Collaborative Research: SHF: MEDIUM: General and Scalable Pluggable Type Inference Martin Kellogg Manu Sridharan $900,000 from the NSF CCF over 4 years (my share $450,000), June 2023",
  "content_length": 8936,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:32"
}