{
  "name": "Martin Mauve",
  "homepage": "https://www.cn.hhu.de/unser-team/team/mauve.html",
  "status": "success",
  "content": "Mauve Zum Inhalt springen Zur Suche springen de |Intranet|Portale|ULB-Katalog Rechnernetze Unser Team Mauve Lehrstuhlinhaber Prof. Dr. Martin Mauve Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 02.41 40225 Düsseldorf Nordrhein-Westfalen 0211 - 811 1636 E-Mail senden CV From late 1991 to early 1997 I studied computer science and business administration at the University of Mannheim. At the end of that time I had a one year stay at the International Computer Science Institute in Berkeley, USA. From mid 1997 on I worked on my Ph.D. Thesis in Computer Science on \"Distributed Interactive Media\". My work was supported through a Ph.D. grant by Siemens. I completed my thesis at the University of Mannheim by mid 2000. From fall 2000 until summer 2003 I was an assistant professor at the University of Mannheim, leading projects in the area of wireless ad-hoc networking and vehicular ad-hoc networks. In summer 2003 I completed my Habilitation on \"Algorithms and Protocols for Distributed Multimedia Systems\". In august 2003 I joined the computer science department at the Heinrich-Heine University in Düsseldorf as a full professor, heading the chair for Computer Networks and Communication Systems. From 2005 to 2010 I was head of the department for computer science at the Heinrich-Heine University. In 2013 I decided to focus my research on Internet-based functionality that can support and improve democracy. Since 2014 I am heading an interdisciplinary graduate school on online-participation. I became dean of the faculty for mathematics and natural sciences in 2015 and vice spokesperson of the Düsseldorf Institut for Internet and Democracy (DIID) in 2016. I am currently a member of the advisory board of the Center for Advanced Internet Studies (CAIS). Publications Personal publications page. Interests Current research interests:Internet & DemocracyOnline ParticipationOnline Argumentation and DeliberationFormer research interestes:Wireless and Ad-Hoc NetworkingInter-Vehicle CommunicationsMultimedia Transport ProtocolsCongestion Control and TCP-friendliness for Multimedia FlowsConsistency in Replicated Multimedia SystemsNetworked Games (in particular for wireless networks)Visiting hours Whenever I am present or by arranging a meeting via email. Startseite Lehrstuhl Unser Team Lehre und Abschlussarbeiten Unsere Forschung Aktuelles / Termine Serviceseite Verantwortlichkeit: Sekretariat Rechnernetze : Per E-Mail kontaktieren Nach oben Open search Close search Search",
  "content_length": 2488,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:36"
}