{
  "name": "Martin Henz",
  "homepage": "https://www.comp.nus.edu.sg/~henz",
  "status": "success",
  "content": "Martin Henz: scalable experiential learning [ Bio | Research | Teaching | Life | Publications] Martin Henz Associate Professor in the School of Computing (SoC) at the National University of Singapore (NUS) Office: COM3, 02-05, 11 Research Link, Singapore 119391 (make an apointment via email) Mobile: +65 Email: GitHub: https://github.com/martin-henz Linkedin: https://www.linkedin.com/in/martin-henz researchr.org: https://conf.researchr.org/profile/martinhenz J15N blog: https://martin-henz.github.io/martin-henz The guiding motivation for my work is the scalability of experiential learning. With my colleagues at the NUS School of Computing (SoC), I have scaled the experiential introductory course CS1101S from 48 students in 2012 to 750 students in 2022. I'm also teaching the experiential course CS4215 Programming Language Implementation, and subscribe to SoC's project-based course CP3108 for experiential learning projects. The work on CS1101S culminated in the textbook Structure and Interpretation of Computer Programs, JavaScript Edition, by Harold Abelson and Gerald J. Sussman, adapted to JavaScript by Martin Henz and Tobias Wrigstad, with Julie Sussman, published by MIT Press in April 2022. CS1101S also motivated the development of the Source Academy, an immersive online experiential environment for learning programming used in CS1101S, at University of San Francisco, and at Uppsala University. I co-founded the software company Workforce Optimizer Pte Ltd with Alan Sevugan, and supervised Rahul Singhal's PhD, which led to the formation of the education company Cerebry. Some multidisciplinary experiential initiatives: NUS Seafarers, a programme for maritime exploration that was active 2017-2020, FrogWorks, a prototyping studio at the iDP in the NUS Faculty of Engineering that was active 2011-2016, and The Physics of Sailing, a collaboration with NUS physics professors that was active 2011-2017. [ Bio | Research | Teaching | Life | Publications] I obtained a Masters in Computer Science from Stony Brook University in 1993 and a Dr.rer.nat. in Computer Science from Saarland University in 1997. I joined NUS in 1997. Computer Science was at the time part of the Department of Information Systems and Computer Science in the Faculty of Science. (SoC was formed in 1998.) From 2012 to 2015, I served the University Scholars Programme (USP) as Deputy Director for Residential Life. I was jointly appointed with the Innovation & Design Programme of the Faculty of Engineering from 2016 to 2018. Before my doctorate, I worked as research scientist at Saarland University and German Research Center for Artificial Intelligence. I worked as a nursing assistant in the mental asylum Landeskrankenhaus Merzig from 1987 to 1989, before the asylum was abolished in 1998. My research has spanned combinatorial optimisation, FPGAs, programming tools and languages, electric vehicles, and most recently education and with publications in IJCAI, AAAI, ICTAI, CP, Operations Research, CSEDU, AIED, EVS, EVER, ETOP, SPLASH-E, and SIGCSE TS. I teach programming, programming languages and logic, and supervise design projects. Together with Dr Jörg Weigl and Brian Teo, I initiated the FrogWorks design and prototyping studio at the iDP in FoE at NUS (green vehicles on land, at sea and in the air). Together with Alan Sevugan, I founded the software company Workforce Optimizer Pte Ltd, where I serve as nonexecutive director. My former students Rahul Singhal and Shubham Goyal have spun off the AI startup Cerebry in 2016 where I served as advisor from 2016 to 2018. In 2022, I spent a semester at MIT (CSAIL) as a Visiting Scholar and a semester at Uppsala University (Department of Information Technology) as a Visiting Professor. Professional activities 2022: Scheme and Functional Programming Workshop, member of Program Committee 2022: SPLASH-E 2022 Symposium, Program Co-Chair Recent talks and demos March 2023: Source Academy: A Web-based Environment for Learning Programming with SICP, Demo at SIGCSE TS 2023 (PDF abstract and video available) March 2023: 'Early X or Late X' Questions for Discussing Curricular Practices in CS1 and CS2, Lightning Talk at SIGCSE TS 2023 December 2022: Xtreme Shrinking of JS for Teaching at XtremeJS 2022 (slides with links and video available) June 2022: Meaningful online learning experiences with Source Academy, Experiential Learning Seminar Series, Centre for the Enhancement of Teaching and Learning, University of Hong Kong (slides available) March 2022: Shrinking JavaScript for an SICP-based First-Year Course, CSAIL Seminar, MIT (slides and video available) Awards NUS Annual Digital Education Award, 2021 (team leader) NUS geNiUSbooks People's Choice Award, 2021 (with Samuel Fang) NUS Annual Teaching Excellence Award, Academic Year 2016/17 Startup @ Singapore and Startup @ Asia, entrepreneurship competitions, Champion, 2001, with Alan Sevugan for work on FriarTuck Pte Ltd, now Workforce Optimizer Pte Ltd Fulbright Scholarship, 1990-1991 [ Bio | Research | Teaching | Life | Publications] Education: I'm interested in the scalability of experiential learning. With NUS students and colleagues, I have developed the immersive online experiential environment for learning programming Source Academy, which is covered in four papers at the SPLASH-E Symposium in 2021. With Aquinas Hobor, I have explored the use of proof assistants in teaching formal methods; with Koh, Duran-Novoa and Weigl, I've been involved in a study on change propagation in engineering projects; with Danner and Teo, I've explored employing engineering challenges for experiential learning; and with Rahul Singhal and Shubham Goyal, I have invented automated reasoning techniques for question generation in mathematics and the sciences. Electric vehicles: I was guiding students in the design of novel electric vehicles on land, at sea and in the air (twice) in the design and prototyping studio FrogWorks in the iDP. Combinatorial optimization: I've solved combinatorial search and optimization problems such as timetabling, sports tournaments, Sudoku and SRAT puzzles, and approached music composition as a combinatorial search problem. Field-programmable Gate Arrays: With Roland Yap, Edgar Tan, and Stella Wang, I investigated ultra-fast implementations of local search algorithms. Programming tools and languages: I was part of the group around Gert Smolka that developed the programming language Oz in the 1990s, and my doctoral dissertation, published with Kluwer as a monograph covered object-oriented aspects of the language. We also explored the use of Oz for multi-agent systems. With my Master students Kevin Ng and Jeff Choi, I explored software components for constraint-based search. Term rewriting: In a previous life, I worked on term rewriting modulo AC1. [ Bio | Research | Teaching | Life | Publications] I currently teach CS1101S Programming Methodology, a rigorous, thorough and immersive introduction to programming and programming methodology. The course follows the pedagogic strategy of the classic textbook Structure and Interpretation of Computer programs, which I have adapted to JavaScript with Tobias Wrigstad. I have established the experiential course CS4215 Programming Language Implementation in 2009 and taught the course four times including 2020 and 2021. With Aquinas Hobor, I transformed CS3234 Logic and Formal Systems into an experiential course, using the theorem prover Coq. In the USP, I have taught UIT2206 The Importance of Being Formal. In the FrogWorks prototyping studio at iDP in the NUS Faculty of Engineering, I have led some interesting projects: FWi: Our converted electric motorcycle that came 3rd in the WAVE 2014 rally after a 1600km course that included five alpine passes. Some alpine footage of FWi. See also publications and press. FW2: Singapore's only carbon-neutral motorized vessel. Here is some footage of FW2 reaching Pedra Branca during the North-East Monsoon, and here more peaceful scenery silently e-motoring out of Tanjung Piayu on Batam, Indonesia. See also publications and press. Snowstorm: NUS personal flying machine. Yes, it can fly! See also publication and press. The Delta: FrogWorks' take on the \"flying car\" meme. Yes, this one flies, too! See also publication and press. I facilitate outdoor education and experiential learning. I have conducted student sailing voyages in Singapore in 2013 and 2014 and to Bintan, Indonesia, in 2015. In 2016, I organized a paragliding course in Thailand, as part of the engineering project The Delta. In late 2016, I initiated NUS Seafarers, a framework for experiential seafaring voyages. The NUS Seafarers have conducted fifteen voyages from 2017 to 2020, each between 8 and 14 days long and with a total around 180 students and 14 alumni on board, reaching the Philippines and Thailand, and many destinations in Indonesia, including Borneo, Java, Bangka, Belitung, Krakatoa, Karimata and many islands of the Riau Islands Province (the Anambas Islands, Batam, Bintan, Lingga, the Pekajiang Islands, the Tambelan Islands and the Badas Islands). [ Bio | Research | Teaching | Life | Publications] Family: My wife Kelly Reedy is an artist and art therapist. Our son Jakob lives in Johannesburg, South Africa, and our daughter Luisa in Vancouver, Canada. Swimming: I like swimming in the University Sports Complex but love swimming in the ocean, with three participations in the Kapas-Marang International Swimmathon (6.5 km open sea). Sailing: I love sailing my masthead sloop Bo Bo Cha Cha, a Maxi 77 pocket cruiser built in Singapore in 1980. Here is what it's like on board when there's a fresh breeze, and this is serious sailing reaching Horsburgh Lighthouse in the South China sea during the North-East Monsoon. Bo Bo Cha Cha is Singapore's only carbon-neutral motorized vessel. Riding: This is my first real bike, a Yamaha XJR400, just before it was scrapped. After that, I was riding a BMW R1100R and a Honda ST1300. Yoga: daily.",
  "content_length": 10517,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:36"
}