{
  "name": "Martin J. Lercher",
  "homepage": "https://www.cs.hhu.de/lehrstuehle-und-arbeitsgruppen/computational-cell-biology/unser-team/team.html",
  "status": "success",
  "content": "Team Zum Inhalt springen Zur Suche springen de/en |Intranet|Portale|ULB-Katalog HHU Math.-Nat. Fakultät Informatik Lehrstühle und Arbeitsgruppen Computational Cell Biology Universitätsprofessor Prof. Dr. Martin Lercher Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.36 0211 - 811 0546 E-Mail senden Sekretariat Anja Walge Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.35 0211 - 811 2163 E-Mail senden Sprechzeiten Mo. - Do. 10 - 12 Uhr Administrator Thomas Spitzlei Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 02.48 0211 - 811 1632 E-Mail senden Junior Group Leader Dr. Adélaïde Raguin Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.31 0211 - 81 13185 E-Mail senden wissenschaftlicher Mitarbeiter Dr. Partho Sakha De Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.31 +49 211 81-15771 E-Mail senden wissenschaftlicher Mitarbeiter Dr. Hugo Dourado Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.33 +49 211 81-11651 E-Mail senden wissenschaftlicher Mitarbeiter Dr. Xiao-Pan Hu Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.33 +49 211 81 11651 E-Mail senden wissenschaftlicher Mitarbeiter Dr. Alexander Kroll Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.33 +49 211 81-11651 E-Mail senden wissenschaftlicher Mitarbeiter Dr. Chilperic Armel Foko Kuate Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.38 +49 211 81-11358 E-Mail senden wissenschaftlicher Mitarbeiter Dr. Tin Yau Pang Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.33 +49 211 81-11651 E-Mail senden wissenschaftlicher Mitarbeiter Dr. Charles Rocabert Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.33 0211 - 81 11651 E-Mail senden Academic Teacher Dr. Mayo Röttger Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.34 0211 - 81 12162 E-Mail senden wissenschaftlicher Mitarbeiter Yvan Rousset Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.33 0211 - 81 11651 E-Mail senden wissenschaftlicher Mitarbeiterin Dr. Diana Széliová Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.31 E-Mail senden Doktorand Jonas Brass Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: 02.38 +49 211 81-11358 E-Mail senden Doktorand Sajjad Ghaffari Nasab Sharabiani Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.38 +49 211 / 81 13716 E-Mail senden Doktorandin Lea Kloss Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.33 +49 211 / 81 11651 E-Mail senden Doktorand Antonio Rigueiro Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.38 0211 - 811 3716 E-Mail senden Doktorand Swastik Mishra Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.38 +49 211 / 81 11358 E-Mail senden Doktorand Jérémie Muller-Prokob Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.38 +49 211 / 81 13716 E-Mail senden Doktorand Peter Schubert Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.33 0211 - 81 11651 E-Mail senden Masterstudentin Asma Ben Janete Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.31 0211 - 81 15771 E-Mail senden WHB Torben Glass Universitätsstr. 1 Gebäude: 25.02 Etage/Raum: O2.31 0211 - 81 15771 E-Mail senden Alumni Alumni Bild vergrößern Startseite Lehrstuhl Team Lehre und Abschlussarbeiten Software Contributions Publikationen Offene Stellen Kontakt Wiki Verantwortlichkeit: WE Informatik (Mail an die Webredaktion) : Per E-Mail kontaktieren Nach oben Open search Close search Search",
  "content_length": 3247,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:29"
}