{
  "name": "Martin Neil",
  "homepage": "http://www.eecs.qmul.ac.uk/~martin",
  "status": "success",
  "content": "Professor Martin Neil Toggle navigation Professor Martin Neil About Me Research Applications Publications About School of Electronic and Electrical Engineering and Computer Science Queen Mary, University of London, UK m.neil@qmul.ac.uk Agena Ltd Cambridge,UK martin@agenarisk.com I am a (full) Professor in Computer Science and Statistics at Queen Mary, University of London. My research interests cover Bayesian modeling and risk quantification in diverse areas. My experience in applying Bayesian methods to real problems has convinced me that intelligent risk assessment and decision analysis requires knowledge and data. Not just \"Big Data\". I am also a joint founder of Agena Ltd. We develop and distribute agena.ai, a software product for Bayesian AI modelling and cloud deployment of Bayesian AI applications. At Queen Mary I teach decision and risk analysis. I was invited to the Fields Institute for Research in Mathematical Sciences, University of Toronto, Canada in 2010. I was also a fellow at the Isaac Newton Institute for Mathematical Sciences, Cambridge University in 2016 on Probability and Statistics in Forensic Science. Research I am interested in intelligent risk assessment and decision analysis using knowledge and data. Typically this involves analysing and predicting the probabilities of unknown events using Bayesian statistical methods including causal, probabilistic models (Bayesian networks). In addition to working on theoretical and algorithmic foundations, this work covers a wide range of application domains such as medical analytics, legal reasoning, embedded software, operational risk in finance, systems and design reliability (including software), project risk,commercial risk, decision support, cost benefit analysis, AI and personalization, machine learning, legal argumentation, cyber security and football prediction. My involvement in funded research projects, as principal or co-investigator includes: Funded Projects PAMBAYESIAN: PAtient Managed decision-support using Bayesian networks. EPSRC project EP/E033954/1, July 2017 - June 2020. Funded by EPSRC (£1,583,497), Partners: Be More Digital Ltd, Mediwise Ltd, uMotif Limited, Hasiba Medical GmbH, Rescon Technologies, IBM, SMART Medical Limited Decision Support for the Management of Traumatically Injured Limbs. Funded by EPSRC Impact QM Programme (£143,102), The Barts and the London Hospital Trust, QMUL (£30,000) and Agena Ltd (£32,500). May 2010-April 2012.Partners:·Trauma Care Unit, Royal London Hospital; Agena Ltd. DIADEM (Data Information and Analysis for clinical Decision Making) Digital Economy Research Cluster EP/G001987/1. April 2008-March 2009. Funding to QMUL: £196,425. DyFUSION: Towards a Novel Universal tool for Modelling and Reasoning under Uncertainty. EPSRC project EP/E033954/1, Jan 2007 – Jan 2010. Funding to QMUL: £478,352. Partners are Agena, QinetiQ and Motorola. Role in Project: Co- investigator eXdecide: Quantified Risk Assessment and Decision Support for Agile Software Projects. EPSRC project EP/C005406/1, March 2005 - Feb 2008.Funding to QMUL: £181,353,Partners: Agena Ltd. Role in Project: Principal investigator SCORE: Sensing Changes in Operational Risk Exposure May 2001 - May 2004, EPSRC Project GR/R24197/01 (Critical Systems Programme) Partners: Liverpool University, NATS, ERA, CAA, Agena. Funding to QMUL: £421,093 Role in Project: Co-investigator EPSRC funded project on “Machine Learning and Causal Analysis for Improved Clinical Performance”. A 3 month funded project started in June 2010 in collaboration with cancer specialists at Queen Mary School of Medicine and Dentistry. £9636. PDecision Support for Component-Based Software Testing. Partly Sponsored by Motorola Research Labs under the EPSRC Collaborative Training Accounts Scheme. Funding to QMUL: £36,000. MODIST: Models of Uncertainty and Risk for Distributed Software Development.Sept 2001 - Feb 2004, EC Framework 5 Project IST-2000-28749. Partners: Agena, QinetiQ, Israel Aircraft Industries, Philips Digital Systems Laboratory, Philips Semiconductors (Eindhoven) IMPRESS: (IMproving the software PRocESS using bayesian nets). 1997 - 2000, EPSRC Project GR/L06683. Partners: Hugin A/S (Denmark) Funding: £221,000. TRACS (Transport Reliability Assessment Calculation System). Aug 1997 - March 1999, funded by Defence Evaluation Research Agency (Chertsey), Project LSF/E20262. Partners: DERA. Funding £125,000. SERENE (SafEty and Risk Evaluation using bayesian Nets).1 June 1996 - 1 June 1999, ESPRIT Framework IV Collaborative Project 22187.Partners: ERA Technology, HUGIN Expert A/S (Denmark), TüV Nord (Germany) Electricité de France, Objectif Technologie (France). 265,000 ECU Applications Most of my technology transfer and applications activity is pursued through Agena Ltd. For the last 20 years I have been instrumental in developing agena.ai software. I have consulted or given training to many organisations including General Electric, Milliman, Mastercard, AIB bank, Philips, NATS, QinetiQ, Advantica, Motorola, DSTL (UK MOD), ABSA, AON, Ericsson, Royal Bank of Canada, TNO (the Netherlands), BHP Billiton and ICRAF (The World Agroforestry Centre) and more. agena.ai Bayesian AI model This screen shot shows a Bayesian Network running in agena.ai modeller software. The nodes represent uncertain variables with probability distributions. The arcs represent functional or causal interactions. Building a model like this takes minutes compared to attempting it in MatLab or any other environment, and agena.ai is the only Bayesian application that can handle continuous variables properly, meaning you can build hybrid Bayesian networks. The great thing about this approach is that we can combine machine/statistical learning with subject matter expertise about the way the world works. Once the model is built it can be deployed as a web application or via our cloud services API. Publications The first edition of my book Risk Assessment and Decision Analysis with Bayesian Networks , co-authored with Norman Fenton, covers the majority of my work on Bayesian networks theory and applications. It was picked up some rather good reviews. The second edition of the book was published in September 2018 and is available here: Risk Assessment and Decision Analysis with Bayesian Networks Second Edition Risk Assessment and Decision Analysis with Bayesian Networks … although there have been several excellent books dedicated to Bayesian networks and related methods, these books tend to be aimed at readers who already have a high level of mathematical sophistication … . As such they are not accessible to readers who are not already proficient in those subjects. This book is an exciting development because it addresses this problem. … it should be understandable by any numerate reader interested in risk assessment and decision making. The book provides sufficient motivation and examples (as well as the mathematics and probability where needed from scratch) to enable readers to understand the core principles and power of Bayesian networks. However, the focus is on ensuring that readers can build practical Bayesian network models … readers are provided with a tool that performs the propagation, so they will be able to build their own models to solve real-world risk assessment problems. From the Foreword by Judea Pearl, UCLA Computer Science Department and 2011 Turing Award winner So, I must admit. This book is nothing like what I expected when I ordered it. Having a background in engineering, many statistics classes (some graduate level), and experience with other types of \"networks,\" I was expecting a fairly tough book filled with theorems, equations, and trivial first-principle examples. Was I ever wrong. Instead, this book discusses Bruce Willis blowing up a meteor, game shows, the author sleeping too long and missing work, and scenarios in Agatha Christie novels. In my stuffy statistics classes, Bayesian statistics was explained as something not short of gnosticism - that if you didn't get it already, it was not worth explaining. I used Bayes' Theorem for simple problems, but for nothing very practical - practical implementation was too difficult. It is a sign that someone knows a complex subject very well: Explain it simply enough (and still be correct) so that a bright grade-school child would understand. This is exactly that the authors have done. The appealing and simple approach to this book hides the fact that they to an amazingly good job at explaining Bayesian statistics. The light subjects I mentioned in the paragraph above should be taken that these authors do a tremendous job at explaining themselves, not that this book is a pushover, or is simple or pedestrian. If you, like me, have always wished that someone would have taken the time to explain Bayesian statistics to you, or if you are somewhat experienced in statistics but feel like you need more (or see the holes that these authors point out), then this book is for you. If you are looking for a book filled with proofs and theorems, or if you like authors that make themselves sound smart by intimidation and shock-and-awe, then skip this book. This book is the real deal. Amazon Review by Serac You can find out more and buy it at Amazon or from the publisher: CRC Press. Here are some selected publications to indicate my range of interests. Google scholar does a reasonable job of keeping a complete publications list. QMUL also keep a list of publications. Selected Publications Neil M., Tailor M., Marquez D.. Inference in Hybrid Bayesian networks using Dynamic Discretization. Statistics and Computing, 2007 Neil M., Fenton N. E., Nielson L. Building large-scale Bayesian networks. The Knowledge Engineering Review, 2000 Lin, P., Neil, M., & Fenton, N. E. (2014). \"Risk Aggregation in the presence of Discrete Causally Connected Random Variables\". Annals of Actuarial Science, Volume 8, Issue 2, September 2014, pp 281-297. Fenton N. E., Neil M. A critique ",
  "content_length": 10432,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:38"
}