{
  "name": "Martin J. Reed",
  "homepage": "https://www.essex.ac.uk/people/reedm58703/martin-reed",
  "status": "success",
  "content": "Martin Reed | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Martin Reed People Professor Martin Reed Professor School of Computer Science and Electronic Engineering (CSEE) Email mjreed@essex.ac.uk Location 1NW.4.18, Colchester Campus Academic support hours During Autumn Term my Academic Support Hours are 12:00-13:00 on Thursday or 12:00-13:00 on Fridays. I will be in my office, 1NW.4.18. I can also meet on zoom by request at these times (I will check email during these support hours and respond with a link). Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Martin is a Professor in, and Deputy Head of, the School of Computer Science and Electronic Engineering. His research interests include computer networking and network security, in particular, recent work is the area of security for IoT, SDN security, information/content centric networking, software defined networking and the transmission of multimedia over networks. He has been involved in a number of EU, EPSRC and Industrially funded projects (see below). He has led the curriculum in the school, including merging the curriculum of the two former departments that formed the current school. He has acted as an external examiner for undergraduate and postgraduate programmes for a number of UK universities. Qualifications PhD University of Essex, (1997) BEng (1st Class) with Industrial Year at BBC Research Department University of Surrey, (1989) Research and professional activities Research interests Information Centric Networking Open to supervise Network security Open to supervise quality of Service mechanisms for Internet protocol networks Open to supervise management and control of optical and core networks Open to supervise multimedia Internet applications Open to supervise Teaching and supervision Current teaching responsibilities Network Engineering (CE321) Network Security (CE324) Network Security (CE823) Current supervision Douglas John Millward Degree subject: Computer Science Degree type: Doctor of Philosophy Rifqy Hakimi Thesis title: Anomaly Detection in Internet Routing Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Adisaya Charoenphol Degree subject: Computer Science Degree type: Doctor of Philosophy Aminu Mahmoud Wali Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Vijaya Nirmala Mitnala Thesis title: Seamless Handover for Pervasive Speech Communication Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 17/9/2024 Edita Gashi Thesis title: Path Protection Switching in Information Centric Networking Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 12/3/2024 Perekebode Amangele Thesis title: Efficient Malicious Packet Detection in Software Defined Networks Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 22/12/2022 Miroslav Georgiev Mitev Thesis title: Physical Layer Security for Iot Applications Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 22/12/2020 Karis Louise Bailey Thesis title: Measuring Interactivity in Audio Teleconferencing Using Conversation Analysis Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 31/7/2020 Mohammed Qasim Shawkat Al-Khalidi Thesis title: Anchor Free Mobility Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 9/9/2019 Hildebrand Jacobus Weisenborn Thesis title: Video Popularity Metrics and Bubble Cache Eviction Algorithm Analysis Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 11/7/2018 Paul Farrow Thesis title: Optimising Networks for Ultra-High Definition Video Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 29/4/2016 Bander Ahmad Alzahrani Thesis title: Securing the Forwarding Plane of Mediated Information Centric Networks Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 12/5/2015 Mohammed Alhomidi Thesis title: Managing Information Security Risk Through Attack Graph Analysis Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 5/11/2014 Rajasekhar Sadda Thesis title: Securing Networks From Layer 2 Attacks Degree subject: Computing and Electronic Systems Degree type: Master of Science (by Dissertation) Awarded date: 5/11/2014 Mohammed NMF Alenezi Thesis title: Detecting, Tracing and Mitigating Against Denial of Service in Ip Networks Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 29/8/2014 Karis Louise Bailey Thesis title: Comparing Narrowband and Wideband Speech Communication Degree subject: Computer Science Degree type: Master of Science (by Dissertation) Awarded date: 23/12/2013 Okung-Dike Ntofon Thesis title: Controlling Beyond High Definition Media in Future Networks Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 4/9/2013 Laura Carrea Thesis title: Optimised Probabilistic Data Structures for Forwarding in Information Centric Networking Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 26/7/2013 Ian Paul Mothersole Thesis title: Optimising Network Layer Firewalls Using Rule Manipulation Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 5/7/2013 Publications Journal articles (47) Mitnala, V., Reed, M., Bicknell, J. and Chakraborty, J., (2025). Intelligent speech handover for smart speakers through deep learning: a custom loss function approach. IEEE Transactions on Consumer Electronics. 71 (2), 3143-3155 Chakraborty, J., Reed, M., Thomos, N., Pratt, G. and Wilson, N., (2025). Neuro-Fuzzy voice quality improvement for low-power, half-duplex, communication. IEEE Transactions on Audio, Speech and Language Processing. 33, 3609-3622 Hu-Bolz, J., Reed, M., Zhang, K., Liu, Z. and Hu, J., (2024). Federated Data Acquisition Market: Architecture and a Mean-Field Based Data Pricing Strategy. High-Confidence Computing. 5 (1), 100232-100232 Baker, B., Woods, J., Reed, M. and Afford, M., (2024). A Survey of Short-Range Wireless Communication for Ultra-Low-Power Embedded Systems. Journal of Low Power Electronics and Applications. 14 (2), 27-27 Crawford, D., Foss, J., Lambert, N., Reed, M. and Kriebel, J., (2024). Preface. Lecture Notes of the Institute for Computer Sciences Social Informatics and Telecommunications Engineering Lnicst. 575 LNICST, v-vi Assis, KDR., Almeida, RC., Reed, MJ., Santos, AF., Dinarte, HA., Chaves, DAR., Li, H., Yan, S., Nejabati, R. and Simeonidou, D., (2023). Protection by diversity in elastic optical networks subject to single link failure. Optical Fiber Technology. 75, 103208-103208 Al-Naday, M., Dobre, V., Reed, M., Toor, S., Volckaert, B. and De Turck, F., (2023). Federated deep Q-learning networks for service-based anomaly detection and classification in edge-to-cloud ecosystems. Annals of Telecommunications. 79 (3-4), 165-178 Reed, M., Thomos, N., Al-Khalidi, M. and Al-Zaidi, R., (2023). Intelligent Seamless Handover in Next Generation Networks. IEEE Transactions on Consumer Electronics. 70 (1), 1566-1579 Hidalgo, C., Vaca, M., Nowak, MP., Frölich, P., Reed, M., Al-Naday, M., Mpatziakas, A., Protogerou, A., Drosou, A. and Tzovaras, D., (2022). Detection, control and mitigation system for secure vehicular communication. Vehicular Communications. 34, 100425-100425 Hu, J., Reed, M., Thomos, N., Al-Naday, M. and Yang, K., (2022). A Dynamic Service Trading in a DLT-Assisted Industrial IoT Marketplace. IEEE Transactions on Network and Service Management. 19 (4), 4691-4705 Mitev, M., Shakiba-Herfeh, M., Chorti, A., Reed, M. and Baghaee, S., (2022). A Physical Layer, Zero-round-trip-time, Multi-factor Authentication Protocol. IEEE Access. 10, 74555-74571 AL-Naday, M., Thomos, N., Hu, J., Volckaert, B., de Turck, F. and Reed, MJ., (2022). Service-based, Multi-Provider, Fog Ecosystem with Joint Optimization of Request Mapping and Response Routing. IEEE Transactions on Services Computing. 16 (3), 1-15 Hu, J., Reed, M., Thomos, N., Al-Naday, MF. and Yang, K., (2021). Securing SDN controlled IoT Networks Through Edge-Blockchain. IEEE Internet of Things Journal. 8 (4), 2102-2115 Zhang, Y., Nie, X., Jiang, J., Wang, W., Xu, K., Zhao, Y., Reed, MJ., Chen, K., Wang, H. and Yao, G., (2021). BDS+: An Inter-Datacenter Data Replication System With Dynamic Bandwidth Separation. IEEE ACM Transactions on Networking. 29 (2), 918-934 Hu, J., Reed, MJ., Al-Naday, M. and Thomos, N., (2021). Hybrid Blockchain for IoT—Energy Analysis and Reward Plan. Sensors. 21 (1), 305-305 Mitev, M., Chorti, A., Reed, M. and Musavian, L., (2020). Authenticated secret key generation in delay-constrai",
  "content_length": 31490,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:30"
}