{
  "name": "Martín Hötzel Escardó",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/escardo-martin.aspx",
  "status": "success",
  "content": "Professor Martin Escardo - School of Computer Science - University of Birmingham Professor Martin Escardo Bsc MSc PhD School of Computer ScienceProfessor of Theoretical Computer Science Contact details Emailm.escardo@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Martin Escardo is a Professor of Theoretical Computer Science at the University of Birmingham. His first degree was from the Universidade Federal Do Rio Grande Sul where he also obtained an MSc degree by research. During his undergraduate and MSc studies, he worked in industry. He then went to Imperial College of the University of London in October 1993 for his PhD under the supervision of Mike.B.Smyth. After completing this in April 1997, he was a postdoc for one year at Imperial, a lecturer at the University of Edinburgh for two years, and then at the University of St Andrews for one year before joining the University of Birmingham. For more information, please see Martin's Computer Science profile. BSc Computer Science – UFRGS MSc by research, Computer Science - UFRGS PhD in Theoretical Computer Science – Imperial College Homotopy type theory Univalent mathematics Martin-Loef type theory Constructive mathematics Domain theory Topology in the theory of computation Recent publications Article de Jong, T & Escardó, MH 2025, 'Continuous and algebraic domains in univalent foundations', Journal of Pure and Applied Algebra, vol. 229, no. 10, 108072. https://doi.org/10.1016/j.jpaa.2025.108072 Arrieta, I, Escardó, MH & Tosun, A 2025, 'The patch topology in univalent foundations', Mathematical Structures in Computer Science, vol. 35, e18. https://doi.org/10.1017/s0960129525000088 Escardó, M & Oliva, P 2023, 'Higher-order games with dependent types', Theoretical Computer Science, vol. 974, 114111. https://doi.org/10.1016/j.tcs.2023.114111 De Jong, T & Escardó, MH 2023, 'On small types in univalent foundations', Logical Methods in Computer Science, vol. 19, no. 2, pp. 8:1-8:33. https://doi.org/10.46298/LMCS-19(2:8)2023 Escardo, MH 2021, 'Injective types in univalent mathematics', Mathematical Structures in Computer Science, vol. 31, no. 1, pp. 89-111. https://doi.org/10.1017/S0960129520000225 Bezem, M, Coquand, T, Dybjer, P & Escardo, M 2021, 'On generalized algebraic theories and categories with families', Mathematical Structures in Computer Science. https://doi.org/10.1017/S0960129521000268 Escardo, M 2021, 'The Cantor–Schröder–Bernstein Theorem for ∞-groupoids', Journal of Homotopy and Related Structures, vol. 16, no. 3, pp. 363-366. https://doi.org/10.1007/s40062-021-00284-6 Kraus, N, Escardo, M, Coquand, T & Altenkirch, T 2017, 'Notions of anonymous existence in Martin-Löf type theory', Logical Methods in Computer Science, vol. 13, no. 1, 15, pp. 1-36. https://doi.org/10.23638/LMCS-13(1:15)2017 Conference article Tosun, A & Escardo, M 2023, 'Patch locale of a spectral locale in univalent type theory', Electronic Notes in Theoretical Informatics and Computer Science, vol. 1, 16. https://doi.org/10.46298/entics.proceedings.mfps38 Conference contribution Escardo, M, Da Rocha Paiva, B, Rahli, V & Tosun, A 2025, Internal Effectful Forcing in System T. in 10th International Conference on Formal Structures for Computation and Deduction (FSCD 2025). Schloss Dagstuhl, 10th International Conference on Formal Structures for Computation and Deduction, Birmingham, United Kingdom, 14/07/25. Bezem, M, Coquand, T, Dybjer, P & Escardó, M 2023, Type Theory with Explicit Universe Polymorphism. in D Kesner & P-M Pedrot (eds), 28th International Conference on Types for Proofs and Programs, TYPES 2022., 13, Leibniz International Proceedings in Informatics, LIPIcs, vol. 269, Schloss Dagstuhl, pp. 13:1-13:16, 28th International Conference on Types for Proofs and Programs, TYPES 2022, Nantes, France, 20/06/22. https://doi.org/10.4230/LIPIcs.TYPES.2022.13 De Jong, T & Escardo, M 2021, Domain theory in constructive and predicative univalent foundations. in C Baier & J Goubault-Larrecq (eds), 29th EACSL Annual Conference on Computer Science Logic, CSL 2021., 28, Leibniz International Proceedings in Informatics, LIPIcs, vol. 183, Schloss Dagstuhl, 29th EACSL Annual Conference on Computer Science Logic , Ljubljana, Slovenia, 25/01/21. https://doi.org/10.4230/LIPIcs.CSL.2021.28 De Jong, T & Escardo, M 2021, Predicative aspects of order theory in univalent foundations. in N Kobayashi (ed.), 6th International Conference on Formal Structures for Computation and Deduction (FSCD 2021)., 8, LIPIcs: Leibniz International Proceedings in Informatics, vol. 195, Schloss Dagstuhl, 6th International Conference on Formal Structures for Computation and Deduction, 17/07/21. https://doi.org/10.4230/LIPIcs.FSCD.2021.8 Booij, A, Escardo, M, Lumsdaine, PL & Shulman, M 2018, Parametricity, automorphisms of the universe, and excluded middle. in H Geuvers, J Ivetic & S Ghilezan (eds), Proceedings of 22nd International Conference on Types for Proofs and Programs, TYPES 2016. Leibniz International Proceedings in Informatics (LIPIcs), Schloss Dagstuhl, 22nd International Conference on Types for Proofs and Programs, TYPES 2016, Novi Sad, Serbia, 23/05/16. https://doi.org/10.4230/LIPIcs.TYPES.2016.7 Escardo, M & Knapp, C 2017, Partial Elements and Recursion via Dominances in Univalent Type Theory. in V Goranko & M Dam (eds), Proceedings of 26th EACSL Annual Conference on Computer Science Logic (CSL2017)., 21, Leibniz International Proceedings in Informatics (LIPIcs), vol. 82, Schloss Dagstuhl, 26th EACSL Annual Conference on Computer Science Logic (CSL 2017), Stockholm, Sweden, 20/08/17. https://doi.org/10.4230/LIPIcs.CSL.2017.21 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 5875,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:55"
}