{
  "name": "Martin Glinz",
  "homepage": "http://www.ifi.uzh.ch/~glinz",
  "status": "success",
  "content": "Prof. Dr. Martin Glinz | Department of Informatics | UZH Skip navigation Prof. Dr. Martin Glinz Martin Glinz Full professor emeritus, Dr. rer. nat. Head, Requirements Engineering Research Group (RERG)* Department head, Department of Informatics (2007-2016) Planner and coordinator of IfI relocation to a new building (2023–now) Professional activities *Since July 2022, RERG has ceased to exist as a group of people. Currently, RERG forms an umbrella for the ongoing  research, teaching, and service activities of Martin Glinz. Contact University of Zurich, Department of Informatics Binzmühlestrasse 14, CH-8050 Zurich, Switzerland Room: BIN 2.B.23 Phone: +41 44 63 - 54570 Fax: +41 44 63 - 56809 Email: glinz@ifi.uzh.ch Curriculum Vitae Martin Glinz is a full professor emeritus and head of the Requirements Engineering Research Group at the Department of Informatics, University of Zurich. He received a diploma in Mathematics and a Dr. rer. nat. in Computer Science, both from RWTH Aachen University, Germany, in 1977 and 1983, respectively. From 1983 to 1993, he was with BBC/ABB in Baden, Switzerland. There he was active in research, development, training, and consulting in the field of software engineering. His work was focussed especially on methods and tools for specification and design of systems. Additionally, he was a lecturer in computer science at ETH Zurich and at the University of Basel for several years. From 1993-2017 he was a professor of Informatics at the University of Zurich. His research interests include requirements and software engineering, in particular modeling, validation, and quality -- and software engineering education. He was vice-dean of the Faculty of Business, Economis and Informatics and director of academic studies in Informatics from 2000-2006 and department head of the Department of Informatics from December 2007 to January 2016. He is on editorial boards and program committees of major journals and conferences in software and requirements engineering and held key roles (general chair, program chair, steering committee chair) in major international conferences. He is a member of the International Requirements Engineering Board (IREB), where he chairs the IREB Council. In Switzerland, he was on the board of the Swiss Informatics Society SI from 2018-2024, and is president of the Swiss Informatics Research Association (SIRA). Professional Activities",
  "content_length": 2412,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:28"
}