{
  "name": "Martine Bellaïche",
  "homepage": "https://www.polymtl.ca/expertises/bellaiche-martine",
  "status": "success",
  "content": "Bellaïche, Martine | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Bellaïche, Martine Poly Bottin Cours English Répertoire des expertises Bellaïche, Martine Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Martine Bellaïche B.Sc., M.Sc. (Montréal), Ph.D (Montréal) Publications Professeure titulaire Département de génie informatique et génie logiciel Tél. : (514) 340-4711 poste 4679 Téléc. : (514) 340-5139 Local : M-3414 martine.bellaiche@polymtl.ca Domaines d'expertise Systèmes de télécommunications Réseaux de télécommunications Algorithmes Cybersécurité Intérêts de recherche et affiliations Intérêts de recherche Sécurité des réseaux Prévention et détection d'attaques Évaluation et mesures  de performance des systèmes de défense contre les attaques Défense des attaques de dénis de service (DDoS) Sécurité dans les réseaux de capteurs et les réseaux véhiculaires (VANET) Sécurité dans l'infonuagique Sécurité de l'internet des objets Affiliation(s) Laboratoire de recherche en réseautique et informatique mobile (LARIM), Membre Type(s) d'expertises (sujets CRSNG) 2507 Systèmes de télécommunications 2508 Réseaux de télécommunications 2713 Algorithmes Publications Publications récentes Article de revue Alfalqi, K., & Bellaïche, M. (2025). An Automated Mapping Approach of Emergency Events and Locations Based on Object Detection and Social Networks. International Journal of Advanced Computer Science and Applications, 16(2), 20-35. Communication de conférence Erfan, F., Yahyatabar Arabi, M. E., Bellaïche, M., & Halabi, T. (décembre 2024). Advanced Smart Contract Vulnerability Detection Using Large Language Models [Communication écrite]. 8th Cyber Security in Networking Conference (CSNet 2024), Paris, France. Communication de conférence Toko, T. M. N. N., Bellaïche, M., & Halabi, T. (mai 2024). A Game-theoretic Approach for DDoS Attack Mitigation in IIoT Deterministic Networking [Communication écrite]. 2024 IEEE Network Operations and Management Symposium (NOMS 2024), Seoul, Republic of Korea (5 pages). Communication de conférence Erfan, F., Bellaïche, M., & Halabi, T. (juillet 2024). Efficient Detection of Selfish Mining Attacks on Large-Scale Blockchain Networks [Communication écrite]. IEEE 24th International Conference on Software Quality, Reliability, and Security Companion (QRS-C), Cambridge, United Kingdom. Voir toutes les publications (53) Enseignement INF 1005C: Programmation procédurale INF1005B:  Programmation procédurale en VBA INF 1010: Programmation orientée objet INF 1600: Architecture  des micro-ordinateurs INF 2010:  Structures de données et algorithmes Encadrement à Polytechnique TERMINÉ Thèse de doctorat (6) Erfan, F. (2025). Securing Blockchain Networks and Applications Against DoS Attacks and Smart Contract Vulnerabilities [Thèse de doctorat, Polytechnique Montréal]. Alfalqi, K. (2022). Mapping Approach of Emergency Events and Locations Based on Social Networks and Machine Learning [Thèse de doctorat, Polytechnique Montréal]. Alghamdi, R. (2022). Intrusion Detection System for Internet of Things with Deep Learning [Thèse de doctorat, Polytechnique Montréal]. Abusitta, A. (2018). Theoretical and Applied Foundations for Intrusion Detection in Single and Federated Clouds [Thèse de doctorat, École Polytechnique de Montréal]. Halabi, T. (2018). Security in Cloud Computing: Evaluation and Integration [Thèse de doctorat, École Polytechnique de Montréal]. Benbrahim, S.-E. (2016). Migrations en temps réel des machines virtuelles interdépendantes [Thèse de doctorat, École Polytechnique de Montréal]. Mémoire de maîtrise (6) Abbasi, H. (2015). Detecting Specific Types of DDoS Attacks in Cloud Environment by Using Anomaly Detection [Mémoire de maîtrise, École Polytechnique de Montréal]. Bonguet, A. (2015). Déni-de-service: Implémentation d'attaques XML-DOS et évaluation des défenses dans l'infonuagique [Mémoire de maîtrise, École Polytechnique de Montréal]. Adegbindin, M. M. A. (2013). Un algorithme constructif efficace pour le problème de coloration de graphe [Mémoire de maîtrise, École Polytechnique de Montréal]. Engoulou, R. (2013). Sécurisation des VANETS par la méthode de réputation des noeuds [Mémoire de maîtrise, École Polytechnique de Montréal]. Benbrahim, S.-E. (2011). Défense contre l'attaque d'analyse de trafic dans les réseaux de capteurs sans fil (WSN) [Mémoire de maîtrise, École Polytechnique de Montréal]. Ben Amor, H. (1997). Résolution du problème de découpe unidimensionnelle par une méthode de génération de colonnes [Mémoire de maîtrise, École Polytechnique de Montréal]. Nouvelle(s) concernant Martine Bellaïche NOUVELLES | 22 juin 2021 Subventions à la découverte: Polytechnique Montréal obtient près de 3,9 millions $ pour des programmes de recherche | Lire NOUVELLES | 1 juin 2018 Promotions du corps professoral 2018 à Polytechnique Montréal | Lire MAGAZINE POLY | 6 novembre 2017 De l’IdO vers l’IdT | Lire Futur étudiantZone étudianteZone employéMédiasFondation et AlumniRetraitésUrgenceOffres d'emploi Études Études (Registrariat)Programmes d'études offertsRépertoire des cours et horairesBibliothèqueDépartementsAide financière et boursesSociétés techniquesStages et emploisServices aux étudiantsGo-Poly Recherche Informations généralesRépertoire des expertisesChaires, laboratoires et groupesProjets de recherche pour étudiants aux études supérieuresSoutien aux chercheursProjets de recherche en partenariatStagiaires postdoctoraux Entreprises Embaucher un stagiaire ou recruter un étudiantFaire de la recherche en partenariatAcquisition d'une technologieAccéder à notre infrastructure de rechercheFormation continue À propos Renseignements générauxDocuments officielsInternationalFemmes et génieDéveloppement durablePropolys (soutien à l'entrepreneuriat)Direction et gouvernanceServicesAvis de confidentialité et conditions d’utilisationAccessibilitéNous joindre 2500, chemin de Polytechnique Montréal (Québec) H3T 1J4 (514) 340-4711 Suivez-nous! Faire un don",
  "content_length": 6724,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:53"
}