{
  "name": "Martin A. Rohrmeier",
  "homepage": "https://people.epfl.ch/martin.rohrmeier",
  "status": "success",
  "content": "EPFL - Martin Alois Rohrmeier Données administratives Martin Alois Rohrmeier martin.rohrmeier@epfl.ch +41 21 693 23 18 vCard Professeur associé, Digital and Cognitive Musicology Lab EPFL CDH DHI DCMLINN 136 (Bâtiment INN)Station 141015 Lausanne +41 21 693 23 18 Office: INN 136 EPFL › CDH › DHI › DCML Membre, Commission doctorale EPFL AVP-DLE CDOCTCE 1 631 (Centre Est)Station 11015 Lausanne +41 21 693 23 18 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › CDOCT Directeur de programme doctoral, Programme doctoral Humanités digitales EPFL AVP-DLE-EDOC EDDH-GEINN 136 (Bâtiment INN)Station 141015 Lausanne +41 21 693 07 82 +41 21 693 23 18 Office: INN 136 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDDH-GE Site web: https://go.epfl.ch/phd-eddh Professeur associé, SODH - Enseignement +41 21 693 23 18 EPFL › CDH › CDH-SODH › SODH-ENS Professeur associé, SHS - Enseignement +41 21 693 23 18 EPFL › CDH › CDH-SHS › SHS-ENS Professeur associé, EDDH - Enseignement +41 21 693 23 18 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDDH-ENS Enseignement et PhD Enseignement et PhD Current Phd Joris Monnet, Marina Borsodi-Benson, Xinyi Guan, Shuxin Meng, Xiaoxuan Wang, Zeng Ren Past Phd As Director Fabian Claude Moss, Daniel Harasim, Christoph Finkensiep, Johannes Hentschel, Gabriele Cecchetti Courses Digital musicology DH-401 Ce cours a pour but de familiariser les étudiants avec les thèmes principaux en musicologie digitale, ainsi que les approches et méthodes théoriques essentielles. Dans la partie pratique, les étudiants feront un projet. Musical theory and creativity HUM-274 Ce cours propose une introduction à la théorie et à l'analyse de la musique; à la composition et à la créativité. Il combine l'enseignement théorique avec des exercices pratiques et de la création musicale. Back to top",
  "content_length": 1790,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:12"
}