{
  "name": "Marta Rukoz",
  "homepage": "https://www.lamsade.dauphine.fr/en/people/detail-cv/profile/marta-rukoz.html",
  "status": "success",
  "content": "Rukoz Marta | Laboratoire d’Analyse et de Modélisation de Systèmes d’Aide à la Décision (LAMSADE) Menu Content Search HomePeople Curriculum vitae Rukoz Marta Full Professor LAMSADE marta.rukozping@lamsade.dauphinepong.fr Phone : 01 44 05 44 05 Latest publications ArticlesBen Hamida S., Hmida H., Borgi A., Rukoz M. (2021), Adaptive sampling for active learning with genetic programming, Cognitive Systems Research, vol. 65, p. 23-39 Ben M’Barek M., Hmida H., Borgi A., Rukoz M. (2021), GA-PPI-Net Approach vs Analytical Approaches for Community Detection in PPI Networks, Procedia Computer Science, vol. 192, p. 903-912 Cardinale Y., El Haddad J., Manouvrier M., Rukoz M. (2019), Fuzzy ACID properties for self-adaptive composite cloud services execution, Concurrency and Computation, vol. 31, n°2, p. e4360 Hmida H., Ben Hamida S., Borgi A., Rukoz M. (2018), Scale Genetic Programming for large Data Sets: Case of Higgs Bosons Classification, Procedia Computer Science, vol. 126, p. 302-311 Angarita Arocha R., Rukoz M., Cardinale Y. (2016), Modeling dynamic recovery strategy for composite web services execution, World Wide Web, vol. 19, n°1, p. 89-109 Cardinale Y., Angarita Arocha R., Rukoz M. (2014), Reliable Composite Web Services Execution: Towards a Dynamic Recovery Decision, Electronic Notes in Theoretical Computer Science, vol. 302, p. 5-28 Angarita Arocha R., Cardinale Y., Rukoz M. (2012), FACETA*: Checkpointing for Transactional Composite Web Service Execution based on Petri-Nets, Procedia Computer Science, vol. 10, p. 874-879 Cardinale Y., Manouvrier M., Rukoz M., El Haddad J. (2011), CPN-TWS: A Coloured Petri-Net Approach for Transactional-QoS Driven Web Service Composition, International Journal of Web and Grid Services, vol. 7, n°1, p. 91-115 Rukoz M., Hoang N., Gouet-Brunet V., Manouvrier M. (2010), Embedding spatial information into image content description for scene retrieval, Pattern Recognition, vol. 43, n°9, p. 3013-3024 El Haddad J., Manouvrier M., Rukoz M. (2010), TQoS: Transactional and QoS-Aware Selection Algorithm for Automatic Web Service Composition, IEEE Transactions on Services Computing, vol. 3, n°1, p. 73-85 Gouet-Brunet, V., Manouvrier M., Rukoz M. (2008), Synthèse sur les modèles de représentation des relations spatiales dans les images symboliques, Revue des nouvelles technologies de l'information, vol. vol. RNTI-E-14, p. 18-52Leon C., Naacke H., Rukoz M., Gançarski S., Santini P. (2006), Integrity Constraint Checking in Distributed Nested Transactions over a Database Cluster, CLEI Electronic Journal, vol. 9, n°2, p. 13Jomier G., Manouvrier M., Rukoz M. (2006), Delta-distance: A family of dissimilarity metrics between images represented by multi-level feature vectors, Information Retrieval Journal, vol. 9, n°6, p. 633-655 Manouvrier M., Jomier G., Rukoz M. (2002), Quadtree representations for storage and manipulation of clusters of images, Image and Vision Computing, vol. 20, n°7, p. 513--527 Jomier G., Manouvrier M., Rukoz M. (2000), Storage and Management of Similar Images, Journal of the Brazilian Computer Society, vol. 3, n°6, p. 13--26 Chapitres d'ouvrageEl Haddad J., Manouvrier M., Rukoz M. (2019), Construction Automatique d'Applications Internet Complexes, in Isabelle Huault, Bruno Bouchard, 50 ans de Recherche à Dauphine : HIer, Aujourd'hui et Demain, Paris: Université Paris-Dauphine, p. 184-186Abdessalem T., Bauzer-Medeiros C., Cellary W., Manouvrier M., Rukoz M., Zamfiroiu M. (2019), Les Versions de Bases de Données, in Isabelle Huault, Bruno Bouchard, 50 ans de recherche à Dauphine : Hier, Aujourd'hui et Demain, Paris: Université Paris-Dauphine, p. 44-48Cardinale Y., El Haddad J., Manouvrier M., Rukoz M. (2011), Transactional-Aware Web Service Composition: A Survey Transactional-Aware Web Service Composition: A Survey, in Stephan Reiff-Marganiec and Marcel Tilly, Handbook of Research on Service-Oriented Systems and Non-Functional Properties: Future Directions IGI Global, p. 116-141 Jomier G., Manouvrier M., Rukoz M. (2005), Quadtree-Based Image Representation and Retrieval, in Vassilakopoulos, M., Spatial Databases: Technologies, Techniques and Trend, Hershey: IGI Global, p. 81-106 Communications avec actesBraikia H., Ben Hamida S., Rukoz M. (2024), Random Forest Classifier for Marine Biodiversity Analysis, in , 2024 International Conference on Intelligent Systems and Computer Vision (ISCV), IEEE - Institute of Electrical and Electronics Engineers, 1-8 p. Ben M'barek M., Ben Hamida S., Borgi A., Rukoz M. (2024), Evolutionary Graph-Clustering vs Evolutionary Cluster-Detection Approaches for Community Identification in PPI Networks, in Inès Saad ; Camille Rosenthal-Sabroux ; Faiez Gargouri ; Salem Chakhar ; Nigel Williams ; Ella Haig, Advances in Information Systems, Artificial Intelligence and Knowledge Management, Springer Nature Switzerland, 98-113 p. Ben M'barek M., Hmida H., Borgi A., Rukoz M. (2024), Evolutionary Graph-Clustering vs Evolutionary Cluster-Detection Approaches for Community Identification in PPI Networks, in Inès Saad ; Camille Rosenthal-Sabroux ; Faiez Gargouri ; Salem Chakhar ; Nigel Williams ; Ella Haig, Advances in Information Systems, Artificial Intelligence and Knowledge Management, Berlin Heidelberg, Springer International Publishing, 98-113 p. Ben M'barek M., Ben Hamida S., Borgi A., Rukoz M. (2021), GA-PPI-Net Approach vs Analytical Approaches for Community Detection in PPI Networks, in , Amsterdam, Elsevier, 903-912 p. Bousselmin K., Ben Hamida S., Rukoz M. (2020), Bi-objective CSO for Big Data ScientificWorkflows scheduling in the Cloud: case of LIGO workflow, in , 15th International Conference on Software Technologies (ICSOFT 2020), SciTePress, 615-624 p.Ben M'barek M., Borgi A., Ben Hmida S., Rukoz M. (2020), Generic GA-PPI-Net: Generic Evolutionary Algorithm to Detect Semantic and Topological Biological Communities, in Marten van Sinderen, Hans-Georg Fill, Leszek Maciaszek, 15th International Conference on Software Technologies (ICSOFT 2020), SciTe Press, 295-306 p. Manouvrier M., Pautasso C., Rukoz M. (2020), Microservice Disaster Crash Recovery: A Weak Global Referential Integrity Management, in Valeria V. Krzhizhanovskaya, Gábor Závodszky, Michael H. Lees, Computational Science – ICCS 2020, Springer International Publishing, 482-495 p. Ben M'barek M., Borgi A., Ben Hmida S., Rukoz M. (2020), GA-PPI-Net: A Genetic Algorithm for Community Detection in Protein-Protein Interaction Networks, in Marten van Sinderen, Leszek A. Maciaszek, Software Technologies, 14th International Conference, ICSOFT 2019, Springer International Publishing, 133-155 p. Hmida H., Ben Hamida S., Borgi A., Rukoz M. (2019), Genetic Programming over Spark for Higgs Boson Classification, in W. Abramowicz, R. Corchuelo, Business Information Systems, 22nd International Conference, BIS 2019, Paris, Springer, 300-312 p. Hmida H., Ben Hamida S., Borgi A., Rukoz M. (2019), A new adaptive sampling approach for Genetic Programming, in Plamen Angelov, Jaouad Boumhidi, Hani Hagras, 2019 Third International Conference on Intelligent Computing in Data Sciences (ICDS), Marrakech, IEEE - Institute of Electrical and Electronics Engineers, 1-8 p. Ben M'barek M., Borgi A., Ben Hamida S., Rukoz M. (2019), Genetic Algorithm to Detect Different Sizes’ Communities from Protein-Protein Interaction Networks, in M. van Sinderen, L. Maciaszek, Proceedings of the 14th International Conference on Software Technologie, SciTe Press, 359-370 p. Soltane M., Cardinale Y., Angarita Arocha R., Rosse P., Rukoz M., Makhlouf D. (2018), A Self-adaptive Agent-based System for Cloud Platforms, in Mohammed Amroune, 3rd International Conference on Pattern Analysis and Intelligent Systems (PAIS 2018), Tebessa, IEEE - Institute of Electrical and Electronics Engineers, 1-8 p. Cardinale Y., Guehis S., Rukoz M. (2017), Classifying Big Data Analytic Approaches: A Generic Architecture, in Enrique Cabello, Jorge Cardoso, Leszek A. Maciaszek, Marten van Sinderen, Software Technologies,12th International Joint Conference (ICSOFT 2017), Berlin Heidelberg, Springer International Publishing, 268-295 p. Hmida H., Ben Hamida S., Borgi A., Rukoz M. (2017), Sampling Methods in Genetic Programming Learners from Large Datasets: A Comparative Study, in Plamen Angelov, Yannis Manolopoulos, Lazaros Iliadis, Asim Roy, Marley Vellasco, Advances in Big Data : Proceedings of the 2nd INNS Conference on Big Data, October 23-25, 2016, Thessaloniki, Greece, Springer International Publishing, 50-60 p. Cardinale Y., Guehis S., Rukoz M. (2017), Big Data Analytic Approaches Classification, in Jorge Cardoso; Leszek Maciaszek; Marten van Sinderen; Enrique Cabello, Proceedings of the 12th International Conference on Software Technologies 2017, SciTePress, 151-162 p. Angarita R., Rukoz M., Manouvrier M., Cardinale Y. (2016), A Knowledge-based Approach for Self-healing Service-oriented Applications, in Richard Chbeir, Rajeev Agrawal, Ismail Biskri, 8th International ACM Conference on Management of Digital EcoSystems (MEDES'16), New York, Association Française de Marketing, 1-8 p. Cardinale Y., El Haddad J., Manouvrier M., Rukoz M. (2016), Measuring Fuzzy Atomicity for Composite Service Execution, in Irfan Awan and Muhammad Younas, OBD 2016 : The 2nd International Conference on Open and Big Data. Proceedings, IEEE - Institute of Electrical and Electronics Engineers, 62-71 p. Angarita Arocha R., Manouvrier M., Rukoz M. (2016), An Agent Architecture to Enable Self-healing and Context-aware Web of Things Applications, in Muthu Ramachandran ; Gary Wills; Robert Walters ; Víctor Méndez Muñoz and Victor Chang, Proceedings of the International Conference on Internet of Things and Big Data (IoTBD 2016), SciTePress, 82-87 p. Hmida H., Ben Hamida S., Borgi A., Rukoz M. (2016), Sampling Methods in Genetic Programming Learners from Large Datasets: A Comparative Study, in Plamen Angelov, Yannis Manolopoulos, Lazaros Iliadis, Asim Roy, Marley Vellasco, Advances in Big Dat",
  "content_length": 19480,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:06"
}