{
  "name": "Martin Loebl",
  "homepage": "https://kam.mff.cuni.cz/~loebl",
  "status": "success",
  "content": "Professor's Discrete Mathematics Page Welcome to Professor Loebl's Discrete Mathematics Page Exploring the beauty of discrete mathematics together. I am affiliated with the Department of Applied Mathematics, Charles University, Prague. Teaching Vyucovane prednasky najdete na stránce katedry. Konzultace: dohoda e-mailem. Diskretni a spojita optimalizace 2024 Diskretni a spojita optimalizace 2025 Discretni cast. Literatura: lecture notes and Cook, Cunningham, Pulleyblank, Schrijver, Combinatorial Optimisation, Wiley 1998. Cviceni: Je nutne absolvovat diskretni i spojitou cast. Pro zapocet z diskretni casti je nutne jedno z nasledujicich: a. pisemny test nebo b. tymova prezentace zajimaveho tematu souvisejiciho s prednaskou, nebo c. tymova prezentace vypoctovych experimentu souvisejicich s prednaskou. Unor 22: uvod, opakovani zakladnich pojmu teorie grafu, eulerovska prochazka, prostor cyklu grafu, Hamiltonovska kruznice, kostra grafu, rovinne grafy. Unor 23 cviceni: opakovani zakladnich pojmu teorie grafu. Unor 29: matroidy: zakladni definice, radova funkce, submodularita a jeji vyznam v modelovani utility. Brezen 1 cviceni: basic notions of matroids, prove that vectorial and graphic \"matroids\" are indeed matroids. Prove that U(2,4) is not representable over F2. Brezen 7: matroidy: hladovy algoritmus, dualni matroid, grafovy matroid Brezen 8 cviceni: Let G be an embedded planar graph. Proof that the dual of its graphic matroid is isomorphic to the graphic matroid of its geometric dual. skripta Matroidy1 skripta Matroidy2 skripta Matroidy3 Brezen 14: parovani v grafech, Tutte-Berge Theorem, Edmonds algorithm skripta Parovani Brezen 22: parovani a hranove rezy v rovinnych grafech, Isingova particni funkce skripta Kasteleynova teorie Brezen 29: Chinese postman problem a Problem obchodniho cestujiciho (TSP) skripta czech Cinsky.postak.Obchodni.cestujici skripta english Chinese.Postman.Travelling.Salesman Exam topics (discrete part): (1) Matroids: basic examples and definitions (2) matroid rank function and submodularity (3) duality of matroids (4) greedy algorithm (5) Tutte theorem for matching (6) Chinese postman and Travelling salesman problems Linearni Programovani 2024 Cviceni: pravidla na udeleni zapoctu stanovena cvicicimi. 23. unora: uvod, uloha linerniho programovani, priklady, opakovani linearni algebry skripta Uvod_do_LP skripta Prostor cyklu grafu 1. brezna: uloha linerniho programovani, standardni tvar, simplexova metoda 8. brezna: simplexova metoda, pivotovaci pravidla 15. brezna: pivotovaci pravidla, Blamdovo pravidlo skripta Simplexova metoda skripta Blandovo pravidlo 22. brezna: dualita 5. dubna: dualita, Fourier-Motzkinova eliminace skripta Dualita LP skripta FM eliminace, v. oddelovani 12. dubna: uloha diskretni optimalizace, Minkowski-Weylova veta; skripta dole do str. 6 vcetne skripticka Diskretni optimalizace 19. dubna: uloha diskretni optimalizace; skripta do str. 12 vcetne 26. dubna: uloha diskretni optimalizace; skripta do konce 3. kvetna: primarni dualni algoritmy, vazene parovani v bipartitnich grafech, stabilni parovani skripticka Primarni-dualni algoritmy skripticka Stabilni parovani 10. kvetna: primarni dualni algoritmy, vazene parovani v obecnych grafech skripticka Primarni-dualni algoritmy 17. kvetna: primarni dualni algoritmy dokonceni zkusebni okruhy: (1) Standardni tvar LP, vrchol, steny, bazicka reseni (2) Simplexova metoda (3) Pivotovaci pravidla geometricky (4) Blandovo pravidlo (5) Dualita: zneni, slaba a silna veta, podminky komplementarity (6) Farkasovo lemma a dualita (7) Dukaz vety o dualite (8) Fourier-Motzkinova eliminace (9) Veta o oddelovani (10) Minkowski-Weylova veta (11) Racionalni a celociselne mnohosteny (12) TU matice a Hoffman-Kruskalova veta (13) Chvatalovy rezy (14) Primarni dualni algoritmy Zaklady Nelinearni Optimalizece 2024 Zaklady Nelinearni Optimalizece 2024 Ucim druhou polovinu semestru Max Cut na plochach a Semidefinitni Programovani. Uvod do problemu maximalniho rezu, maximalni rez na plochach, maximalni rez jako semidefinitni program. 10.12.: Semidefinitni programovani 17.12.: Lovaszova Theta funkce 5.1.: Lovaszova Theta funkce skripta Nelinearni programovani Diskretni a spojita optimalizace 2025 Discrete and Continuous Optimisation 2025 Discrete part. Literature: lecture notes and Cook, Cunningham, Pulleyblank, Schrijver, Combinatorial Optimisation, Wiley 1998. Tutorials: It is necessary to pass both discrete and continuous part of the tutorial. For the discrete part, in order to pass you need one of the following: a. pass a test or b. make a team presentation of an interesting topic related to the lecture or c. make a team presentation of computer experiments related to topics of the lecture. I need to approve the teams and topics for b., c. February 19: introduction, repetition of basic notions of the graph theory, euler tour, cycle space of a graph, Hamiltoniam cycles, Sperner trees, min spanning tree, planar graphs and their geometric duals. February 26: matroids: basic definitions, rank function, submodularity and its significance for modelling utility February 25 tutorial: basic notions of graph theory related to matroids March 5: matroids: greedy algorithm, dual matroid, graphic matroid, independent and dependent set of a matroid March 4 tutorial: Prove that vectorial and graphic \"matroids\" are indeed matroids. Prove that U(2,4) is not representable over F2.Let G be an embedded planar graph. Proof that the dual of its graphic matroid is isomorphic to the graphic matroid of its geometric dual. skripta Matroidy1 skripta Matroidy2 skripta Matroidy3 March 12: matching in graphs, Tutte-Berge Theorem, Edmonds algorithm skripta Parovani March 19: matchings and edge-cuts in planar graphs, Ising partition function skripta Kasteleynova teorie March 26:Chinese postman and Travelling salesman problem skripta czech Cinsky.postak.Obchodni.cestujici skripta english Chinese.Postman.Travelling.Salesman April 2: repetition Exam topics (discrete part): (1) Matroids: basic examples and definitions (2) matroid rank function and submodularity (3) duality of matroids (4) greedy algorithm (5) Tutte theorem for matching (6) Chinese postman and Travelling salesman problems Teorie her pro inteligentni site 2021 NOPT057 Teorie her pro inteligentní sítě 2021 ZOOM Meeting ID: 984 1389 7116 Passcode: 990697 Úterý 9.00 Webová stránka přednášky: https://kam.mff.cuni.cz/~cerny/teach/seminar.html Linearni Algebra 2021 30.3.: Determinanty: úvod, příklady, základní pozorování, Gaussova eliminace The video is available at https://kam.mff.cuni.cz/~loebl/video/zoom_12.mp4 Lecture notes Determinanty 6.4.: Determinanty: Cramerovo pravidlo, aplikace determinantu The video is available at https://kam.mff.cuni.cz/~loebl/video/zoom_13.mp4 Lecture notes Determinanty 11.5.: Pozitivně definitní a pozitivně semidefinitní matice The video is available at https://kam.mff.cuni.cz/~loebl/video/zoom_14.mp4 Lecture notes Pozitivně (semi)definitní matice 18.5.: Pozitivně definitní a pozitivně semidefinitní matice The video is available at https://kam.mff.cuni.cz/~loebl/video/zoom_15.mp4 Lecture notes Pozitivně (semi)definitní matice 25.5.: Bilineární a kvadratické formy The video is available at https://kam.mff.cuni.cz/~loebl/video/zoom_16.mp4 Lecture notes Bilineární a kvadratické formy 1.6.: Bilineární a kvadratické formy The video is available at https://kam.mff.cuni.cz/~loebl/video/zoom_17.mp4 Lecture notes Bilineární a kvadratické formy Linearni Programovani 2020 Cviceni: pravidla na udeleni zapoctu stanovena cvicicimi. 18. unora: uvod, uloha linerniho programovani, priklady, opakovani linearni algebry 25. unora: standardni tvar ulohy LP, prevody na standardni tvar. Bazicke pripustne reseni 3. brezna: simplexova metoda, neomezenost, degenerace, jak najit pocatecni pripustna reseni, pivotovaci pravidla skripticka Simplexova metoda skripticka Blandovo pravidlo 10. brezna: pivotovaci pravidla, konecnost Blandova pravidla 17. brezna: dualita 24. brezna: dualita skripticka Dualita LP 1. dubna: uloha diskretni optimalizace, Minkowski-Weylova veta; skripta dole do str. 4 vcetne skripticka Diskretni optimalizace 8. dubna: uloha diskretni optimalizace; skripta do str. 8 vcetne 15. dubna: uloha diskretni optimalizace; skripta do str. 12 vcetne 22. dubna: uloha diskretni optimalizace; skripta do konce 29. dubna: opakovani cele diskretni optimalizace 29. dubna: pravidelne konzultace v 10.00. NAVIC konzultace v 18.00 6. kvetna: algoritmy primal-dual; skripta Primal Dual do str.5 vcetne 13. kvetna: algoritmy primal-dual; skripta Primal Dual do str. 8 vcetne 20. kvetna: algoritmy primal-dual; skripta Primal Dual cele; celkove opakovani; max parovani v obecnych grafech se nebude zkouset. !!!! Zoom meeting: konzultace Martin Loebl (jmeno ale je Martin Mares) Time: May 13, May 20, 2020 10:00 Join Zoom Meeting https://matfyz.zoom.us/j/93913950385Meeting ID: 93913950385 Diskretni a spojita optimalizace 2018 Cviceni: pravidla na udeleni zapoctu stanovena cvicicim. 21. unora: uvod, ulohy optimalizace, priklady 28. unora: parovani skripticka Parovani 7. brezna: matroidy skripticka Matroidy 14. brezna: problem obchodniho cestujiciho skripticka Problem obchodniho ceastujiciho 21. brezna: optimalizace enumeracemi skripticka Optimalizace enumeracemi 28. brezna: kvantove pocitani skripticka Kvantove pocitani Témata diplomových prací Optimization in Sociology: Median of partitions. The aim is to study the problem to find a median of given set-partitions, with respect to a given distance. Such problems appear in Sociology and Biology, but it turns out that some natural graph theoretic and matroidal questions can be formulated in this language (1 student). Discrete Applied Mathematics: Theory of Kasteleyn orientations. This theory started in the 1960's by a seminal result of Kasteleyn about enumeration of perfect matchings of planar graphs. At present, this theory is applied in many diverse areas, e.g., statistical physics, ",
  "content_length": 23862,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:35"
}