{
  "name": "Martin Takác 0001",
  "homepage": "http://mtakac.com",
  "status": "success",
  "content": "Martin Takac - personal page Martin Takáč Mohamed bin Zayed University of Artificial Intelligence (MBZUAI) News About Me Research Projects Research Team Join Publications CV News 2025-09-29 How MedNNS picks the right AI model for each type of hospital scan --- check the full article here . ------ 2025-07-28 Overcoming the ‘reversal curse’ in LLMs with ReCall --- check the full article here . ------ 2024-02-26 Keynote at AAAI 2024 Workshop on Artificial Intelligence for Operations Research I gave a keynote about about \"Beyond Conventional Boundaries: RL’s Leap in Solving Optimization Problems\" at the AAAI 2024 Workshop on Artificial Intelligence for Operations Research at Vancouver, Canada. ------ 2021-05-05 I joined MBZUAI in Fall 2021! Starting Fall 2021 I moved to MBZUAI in Abu Dhabi, UAE. If you want to join me at MBZUAI I have multiple openings in my research lab. ------ 2021-04-28 Majid Jahani successfully defended his Ph.D. dissertation! My PhD student Majid Jahani defended his Ph.D. dissertation. His doctoral committee members included Prof. Luis Nunes Vicente, Prof. Frank E. Curtis, Prof. Katya Scheinberg, Prof. Aryan Mokhtari, and Prof. Albert S. Berahas and of couse me. ------ 2019-11-11 An article in Resolve Magazine --- check the full article here . ------ 2019-10-15 I was invited speaker at the Robot Learning Workshop Video from my presentation \"Image Classification using Deep Reinforcement Learning\" is here . ------ 2019-10-05 I had a brief discussion in Slovak National Radio check more here . ------ 2019-07-25 I was a guest in Slovak national TV Check 43:19 here . ------ 2019-07-23 I was a guest in discussion in TA3 (Slovak national TV) I had an oportunity to discuss about the fugure of AI with Prof. Farkašom and Vladimír Šucha (Director-General of the Joint Research Centre, the European Commission\\'s science and knowledge service) here . ------ 2019-07-13 My interview in Slovak national TV news Check 21:01 here and more info on Lehigh\\'s website here ------ 2019-05-13 Youtube video about our recent work. A video explaining our recent paper by is available here . ------ 2019-05-08 Lam won Dissertation Award for his PhD thesis! I am extremely happy to inform that Lam has won the 2019 P.C. Rossin College of Engineering and Applied Science Elizabeth V. Stout Dissertation Award. The title of his thesis was \"A Service System with On-Demand Agents, Stochastic Gradient Algorithms and the SARAH Algorithm\". ------ 2019-04-25 I was the recipient of the 2019 edition of the Richard P. Vinci Award for Educational Excellence of the RCEAS. The prize was awarded today at the Rossin College Award Ceremony: \"Educational Excellence - This award recognizes a Rossin College faculty member who has demonstrated effective teaching AND/OR enhanced the student learning experience by introducing innovative teaching methods into the classroom AND shows an outstanding commitment to the success of their students.\" https://engineering.lehigh.edu/news/article/rossin-awards-celebrate-excellence-across-lehighs-engineering-college ------ 2019-02-28 New paper: Quasi-Newton Methods for Deep Learning: Forget the Past, Just Sample With Albert S. Berahas and Majid Jahani we posted a new paper about Sampled Quasi-Newton method for training Deep Neural Networks! arxiv ------",
  "content_length": 3308,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:44"
}