{
  "name": "Martina Maggio",
  "homepage": "http://www.martinamaggio.com/main",
  "status": "success",
  "content": "Martina Maggio I am a Professor at the Computer Science Department, Saarland University since March 2020 and at the Department of Automatic Control, Lund University (at the moment 20%) since 2023. I completed my Ph.D. at Politecnico di Milano, working with Alberto Leva on the applications of control-theoretical tools for the design of computing systems. During my Ph.D. I spent one year as a visiting graduate student at the Computer Science and Artificial Intelligence Laboratory at MIT, working with Anant Agarwal and Hank Hoffmann on the Self-Aware Computing project. I joined Lund University in 2012 as a postdoctoral researcher, working with Karl-Erik Årzén on resource allocation for cloud infrastructures and real-time systems. I became an Assistant Professor in 2014, and then Docent and Associate Professor in 2017. In 2019 I spent a sabbatical year at Bosch Corporate Research in Renningen, Germany, working with Dirk Ziegenbein and Arne Hamann on the verification and validation of control systems in presence of deadline misses and computational faults. Group Clara Rubeck (Phd supervisor, Saarland University, 2025-now) Robert Pietsch (Phd supervisor, Saarland University, 2024-now) Melanie Gallant (Phd academic supervisor, Saarland University & Bosch, 2023-now) Yde Sinnema (Phd main supervisor, Lund University, 2023-now) Talitha Nauta (Phd assistant supervisor, Lund University, 2023-now) Alumni Dr. Nils Vreman (PhD main supervisor, Lund University, 2018-2023, thesis) Dr. Claudio Mandrioli (PhD main supervisor, Lund University, 2018-2022, thesis) Dr. Paolo Pazzaglia (Postdoctoral researcher, Saarland University, 2020-2022) Dr. Tommi Berner (née Nylander) (Phd assistant supervisor, Lund University, 2016-2022, thesis) Dr. Alexandre Martins (PhD assistant supervisor, Lund University; 2016-2022, thesis) Dr. Gautham Nayak Seetanadi (PhD main supervisor, Lund University; 2015-2021, thesis) News September 2025: Our paper “Jitter Propagation in Task Chains” was accepted and will be presented at RTSS 2025. July 2025: Our paper “Soft-Constrained Stochastic MPC of Markov Jump Linear Systems: Application to Real-Time Control with Deadline Overruns” was accepted in the IEEE Control Systems Letters and will be presented at CDC 2025. An early-access publication is already available in the IEEE Xplore library. May 2025: Our 2015 SEAMS paper “Software Engineering Meets Control Theory” was selected as the most influential paper. Thanks to all the co-authors who have contributed to a great Dagstuhl seminar back then, and then did a lot of exciting work on topics at the intersection between control theory and software. February 2025: Our papers “Analysis of Control Systems under Sensor Timing Misalignments” and “Stealthy Computational Delay Attacks on Control Systems” were accepted respectively at RTAS 2025 and ICCPS 2025. December 2024 and January 2025: Our paper “Structure-Exploiting Distributionally Robust Control of Non-Homogeneous Markov Jump Linear Systems” was accepted in the IEEE Control Systems Letters and will be presented at ACC 2025. An early-access publication is already available in the IEEE Xplore library. Older news Affiliation Professor Department of Computer Science Saarland University Professor Department of Automatic Control Lund University Contactsemail: maggio [at] cs.uni-saarland.de - PGP (server) martina.maggio [at] control.lth.se Copyright © 2025 | WordPress Theme by MH Themes",
  "content_length": 3440,
  "method": "requests",
  "crawl_time": "2025-12-01 13:54:58"
}