{
  "name": "Marvin K. Nakayama",
  "homepage": "https://web.njit.edu/~marvin",
  "status": "success",
  "content": "Marvin K. Nakayama -- Home Page Marvin K. Nakayama Professor Computer Science Department College of Computing Sciences Guttenberg Information Technology Center, Room 4312 (GITC is Building 31 on this campus map) 218 Central Avenue New Jersey Institute of Technology Newark, NJ 07102, U.S.A. Phone:  (973) 596-3398 Fax:    (973) 596-5777 E-mail: marvin@njit.edu URL:  web.njit.edu/~marvin Office Hours for Fall 2025 · Tuesday, Thursday: 10:15am – 11:15am · Or by appointment Course Materials · CS 103: Computer Science With Business Problems. · CS 341: Foundations of Computer Science II. · CS 478: Software Tools for Solving Industrial Problems. · CS 661: Systems Simulation (username and password are given in the syllabus). Click here and here for information about the course. Education · Ph.D. in Operations Research, Stanford Univ., 1991.   Advisor: Peter W. Glynn · M.S. in Operations Research, Stanford Univ., 1988. · B.A. in Mathematics-Computer Science, UC San Diego, 1986. Professional Experience · Professor (Assistant, Associate, Full), 1994-present, Computer Science Department, New Jersey Institute of Technology, New Jersey. · Visiting Assistant Professor, 1998-1999, Division of Management Science and Operations Management, Columbia Business School, Columbia University, New York. · Visiting Assistant Professor, 1993-1994, Department of Management Science and Information Systems, Rutgers School of Management, Rutgers University, New Jersey. · Post-Doctoral Fellow, 1991-1993, IBM Thomas J. Watson Research Center, Hawthorne, New York. Honors and Awards · Plenary speaker, 13th International Conference in Monte Carlo & Quasi-Monte Carlo Methods in Scientific Computing, 2018. · Best Theoretical Paper, 2014 Winter Simulation Conference. · NJIT Excellence in Teaching Award, Upper Division Undergraduate Instruction, 2013-2014. · CAREER Award, National Science Foundation, 1996-2000. · Second Prize in the 1992 George E. Nicholson Student Paper Competition (Organized by the Institute for Operations Research and the Management Sciences \"to honor outstanding papers in the field of operations research and the management sciences written by a student\"). Grants · National Science Foundation, “CAREER: Comparing Alternative System Designs Using Simulation,” Grant No. DMI-9624469, 1996-2002, $210,000. ·       National Science Foundation, “Efficient Simulation of Large-Scale Systems,” (with J. M. Calvin), Grant No. DMI-9900117, 1999-2004, $189,406. ·       National Science Foundation, “Modeling and Simulation of Complex Stochastic Systems and Cascading Failures, with Applications to the Electric Power Grid,” (with J. M. Calvin), Grant No. CMMI-0926949, 2009-2014, $356,000. ·       National Science Foundation, “Efficient Simulation of Risk and Performance Measures, With Applications to the Design and Operation of Nuclear Power Plants,” Grant No. CMMI-1200065, 2012-2016, $205,000. ·       National Science Foundation, “EXTREEMS-QED: Research and training in computational and data-enabled science and engineering for undergraduates in the mathematical sciences at NJIT,” (with M. Siegel, Z.-H. Michalopoulou, D. Horntrop and J. M. Loh), Grant No. DMS-1331010, 2013-2020, $874,946. ·       National Science Foundation, “Efficient Monte Carlo Methods for Characterization of Safety Margins of Nuclear Power Plants,” Grant No. CMMI-1537322, 2015-2019, $270,000. ·       National Science Foundation, “Estimating Risk Measures, with Applications to Finance and Nuclear Safety,” Grant No. CMMI-2345330, 2024-2027, $457,667. Some Professional Activities Editorial Board, ACM Transactions on Modeling and Computer Simulation, 1998-present. Editorial Board, INFORMS Journal on Computing, 2000-2007 (Associate Editor), 2007-2016 (Simulation Area Editor). Coordinator of the Ph.D. Student Colloquium, Winter Simulation Conference, 1997-1998. Track Coordinator of the Advanced Tutorials track, Winter Simulation Conference, 2003, 2004, 2011. Track Coordinator of the Introductory Tutorials track, Winter Simulation Conference, 2015. Track Coordinator of the Cross Fertilization track, Winter Simulation Conference, 2007. Member, INFORMS Simulation Society Distinguished Service Award Committee, 2008-2009 (chair, 2009). Member, INFORMS Simulation Society Outstanding Simulation Publication Award Committee, 2012-2014 (chair, 2013). Member, INFORMS Simulation Society Lifetime Professional Achievement Award Committee, 2016-2018 (chair, 2017). Some Research Interests · Simulation modeling and analysis · Evaluating risk in finance, business and engineering · Reliability theory and fault-tolerant systems · Probabilistic safety assessments of nuclear power plants · Computer performance analysis · Applied probability · Statistics Selected Papers and Publications · V. F. Nicola, M. K. Nakayama, P. Heidelberger, and A. Goyal, “Fast Simulation of Highly Dependable Systems with General Failure and Repair Processes,” IEEE Transactions on Computers, 42 (1993), 1440-1452. (PDF file) · M. K. Nakayama, A. Goyal and P. W. Glynn “Likelihood Ratio Sensitivity Analysis for Markovian Models of Highly Dependable Systems,” Operations Research, 42 (1994), 137-157. (PDF file) · M. K. Nakayama, “A Characterization of the Simple Failure Biasing Method for Simulations of Highly Reliable Markovian Systems,” ACM Transactions on Modeling and Computer Simulations, 4 (1994), 52-88. (PDF file) · M. K. Nakayama, “Two-Stage Stopping Procedures Based on Standardized Time Series,” Management Science, 40 (1994), 1189-1206. (PDF file) · M. K. Nakayama, “Asymptotics of Likelihood Ratio Derivative Estimators in Simulations of Highly Reliable Markovian Systems,” Management Science, 41 (1995), 524-554. (PDF file without the figures) Awarded 2nd Prize for the George E. Nicholson Student Paper Competition by INFORMS. · M. K. Nakayama, “General Conditions for Bounded Relative Error in Simulations of Highly Reliable Markovian Systems,” Advances in Applied Probability, 28 (1996), 687-727. (PDF file) · M. K. Nakayama, “Multiple-Comparison Procedures for Steady-State Simulations,” Annals of Statistics, 25 (1997), 2433-2450. (PDF file) · M. K. Nakayama, “On Derivative Estimation of the Mean Time to Failure in Simulations of Highly Reliable Markovian Systems,” Operations Research, 46 (1998), 285-290. (PDF file) · J. M. Calvin and M. K. Nakayama, “Using Permutations in Regenerative Simulations to Reduce Variance,” ACM Transactions on Modeling and Computer Simulations, 8 (1998), 153-193. (PDF file) · M. K. Nakayama and P. Shahabuddin, “Likelihood Ratio Derivative Estimation for Finite-Time Performance Measures in Generalized Semi-Markov Processes,” Management Science, 44 (1998), 1426-1441. (PDF file) · H. Damerdji and M. K. Nakayama, “Two-Stage Multiple-Comparison Procedures for Steady-State Simulations,” ACM Transactions on Modeling and Computer Simulations, 9 (1999), 1-30. (PDF file) · S. H. Jacobson, J. Kobza, and M. K. Nakayama, “A Sampling Procedure to Estimate Risk Probabilities in Access-Control Security Systems,” European Journal of Operational Research, 122, 1 (2000), 123-132. · M. K. Nakayama, “Multiple Comparisons with the Best Using Common Random Numbers in Steady-State Simulations,” Journal of Statistical Planning and Inference, 85 (2000), 37-48. (PDF file) · J. M. Calvin and M. K. Nakayama, “Simulation of Processes with Multiple Regeneration Sequences,” Probability in the Engineering and Informational Sciences, 14 (2000), 179-201. (PDF file) · J. M. Calvin and M. K. Nakayama, “Central Limit Theorems for Permuted Regenerative Estimators,” Operations Research, 48 (2000), 776-787. (PDF file) · M. K. Nakayama and B. Yener, “Optimal Information Dispersal for Probabilistic Latency Targets,” Computer Networks, Vol. 36, Issue 5-6 (August 2001), 695-707. · V. Nicola, P. Shahabuddin, and M. K. Nakayama, “Techniques for Fast Simulation of Models of Highly Dependable Systems,” IEEE Transactions on Reliability, 50 (2001), 246-264. · M. K. Nakayama and P. Shahabuddin, “Quick Simulation Methods for Estimating the Unreliability of Regenerative Models of Large Highly Reliable Systems,” Probability in the Engineering and Informational Sciences, vol. 18 (2004), 339–368.  (PDF file) · J. M. Calvin and M. K. Nakayama, “Permuted Derivative and Importance-Sampling Estimators for Regenerative Simulations,” European Journal of Operational Research, 156, 2 (2004), 390-414. (postscript file) · M. K. Nakayama, P. Shahabuddin, and K. Sigman, “On Finite Exponential Moments for Branching Processes and Busy Periods for Queues,” Journal of Applied Probability, 41A (2004), 273-280. (PDF file) · J. M. Calvin and M. K. Nakayama, “Permuted Standardized Time Series for Steady-State Simulations,” Mathematics of Operations Research, 31 (2006), 351-368. (PDF file) · J. M. Calvin, P. W. Glynn, and M. K. Nakayama, “The Semi-Regenerative Method of Simulation Output Analysis,” ACM Transactions on Modeling and Computer Simulation, 16 (2006), 280-315. (PDF file) · M. K. Nakayama, “Fixed-Width Multiple-Comparison Procedures Using Common Random Numbers for Steady-State Simulations,” European Journal of Operational Research, vol. 182, no. 3 (2007), 1330–1349. · M. K. Nakayama, “Asymptotically Valid Single-Stage Multiple-Comparison Procedures,”  Journal of Statistical Planning and Inference, vol. 139 (2009), 1348-1356.  (PDF file) · S. M. Iyer, M. K. Nakayama, and A. V. Gerbessiotis “A Markovian Dependability Model With Cascading Failures,” IEEE Transactions on Computers, vol. 58 (2009), 1238-1249. (PDF file) · J. Nzouonta, M. K. Nakayama, and C. Borcea “On Deriving and Incorporating Multi-hop Path Duration Estimates in VANET Protocols,” ACM Transactions on Modeling and Computer Simulation, vol. 21 (2011), article 14.  (PDF file) · M. K. Nakayama, “Asymptotically Valid Confidence Intervals for Quantiles and Values-at-Risk When Applying Latin Hypercube Sampling,” International Journal on Advances in Systems and Measurements, vol. 4, no. 1 & 2 (2011), 86-94.  (PDF fi",
  "content_length": 14053,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:00"
}