{
  "name": "Marwa Mahmoud",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/marwamahmoud",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Marwa Mahmoud Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffMarwa MahmoudMr Ethan KellyZhen Tian Dr Marwa Mahmoud Senior Lecturer (School of Computing Science) email: Marwa.Mahmoud@glasgow.ac.uk office number: S101C Import to contacts https://orcid.org/0000-0002-5932-9113 Biography Marwa Mahmoud is a Senior Lecturer (Associate Professor) in Socially Intelligent Technologies in the School of Computing Science at University of Glasgow, and a Visiting Fellow in the Department of Computer Science and Technology at University of Cambridge, UK. Prior to joining University of Glasgow, she spent 10 years at University of Cambridge, where she obtained her PhD in 2015, held a postdoctoral researcher post from 2015-2016, then got awarded the prestigious King’s College Junior Research Fellowship (JRF) from 2016-2021. Her research interests focus on computer vision for social signal processing, multimodal perception and behavioural modelling, especially within the context of aﬀective computing, behaviour analytics, human behaviour understanding and animal behaviour understanding. She applied her research in the areas of automotive applications, mental healthcare, and animal welfare. She pioneered research directions on affective gestures analysis (especially hand-over-face gestures and self-adaptors/ fidgeting behaviour) as well as vision-based AI for automatic detection of signs of pain in the facial expressions of sheep for early diagnosis of disease. As the director of “Behavioural AI Lab – for human and animal behaviour modelling”, her current research vision is to build technologies for ‘AI for Social Good’, combining computer vision research and multimodal machine learning for human well-being and animal welfare applications. She is the President of the Association for the Advancement of Affective Computing (AAAC), Network Member of Cambridge Trust & Technology Initiative and a member of Cambridge Neuroscience. She has previously served as topic editor for \"Multimodal Behavioural AI for Wellbeing\" issue in Frontiers in Computer Science and the special issue “AI and Interaction Technologies for Social Sustainability” in the Journal of Sustainability. Research interests - Computer vision for behaviour understanding - Multimodal representation learning - Social signal processing - Digital HealthResearch groupsGlasgow Interactive Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2009Number of items: 39.2025 Valerio, Rebecca and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2025) A Multimodal Framework for Exploring Behavioural Cues in Automatic Stress Detection. In: 27th ACM International Conference on Multimodal Interaction (ICMI 2025), Canberra, Australia, 13-17 Oct 2025, pp. 535-539. ISBN 9798400714993 (doi: 10.1145/3716553.3750797) 2024 Li, Xinyu and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2024) Unlocking the Black Box: Concept-Based Modeling for Interpretable Affective Computing Applications. In: The 18th IEEE International Conference on Automatic Face and Gesture Recognition, Istanbul, Turkey, 27-31 May 2024, (doi: 10.1109/FG59268.2024.10581918) Feng, Zejian, Karaskova, Martina and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2024) Open-Sheep-Face: A Comprehensive Application for Sheep Face Analysis and Pain Estimation. In: ACII 2023, MIT Media Lab, Cambridge, MA, USA, 10-13 September 2023, ISBN 9798350327458 (doi: 10.1109/ACIIW59127.2023.10388128) 2023 Tafur, Bruno, Weiss, Staci and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2023) Towards Early Prediction of Neurodevelopmental Disorders: Computational Model for Face Touch and Self-adaptors in Infants. In: ICMI 2023 Workshop on Bridging Social Sciences and AI for Understanding Child Behavior, Paris, France, 9-13 October 2023, pp. 426-434. ISBN 9798400703218 (doi: 10.1145/3610661.3616238) Lin, Weizhe, Orton, Indigo, Li, Qingbiao, Pavarini, Gabriela and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2023) Looking at the body: automatic analysis of body gestures and self-adaptors in psychological distress. IEEE Transactions on Affective Computing, 14(2), pp. 1175-1187. (doi: 10.1109/TAFFC.2021.3101698) Broomé, Sofia, Feighelstein, Marcelo, Zamansky, Anna, Carreira Lencioni, Gabriel, Haubro Andersen, Pia, Pessanha, Francisca, Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113, Kjellström, Hedvig and Salah, Albert Ali (2023) Going deeper than tracking: a survey of computer-vision based recognition of animal pain and emotions. International Journal of Computer Vision, 131(2), pp. 572-590. (doi: 10.1007/s11263-022-01716-3) 2022 Ceccarelli, Francesco and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2022) Multimodal temporal machine learning for bipolar disorder and depression recognition. Pattern Analysis and Applications, 25(3), pp. 493-504. (doi: 10.1007/s10044-021-01001-y) 2021 Danial, John S. H., Shalaby, Raed, Cosentino, Katia, Mahmoud, Marwa M. ORCID: https://orcid.org/0000-0002-5932-9113, Medhat, Fady, Klenerman, David and Garcia Saez, Ana J. (2021) DeepSinse: deep learning-based detection of single molecules. Bioinformatics, 37(21), pp. 3998-4000. (doi: 10.1093/bioinformatics/btab352) (PMID:33964131) 2020 Lin, Weizhe, Orton, Indigo, Liu, Mingyu and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2020) Automatic Detection of Self-Adaptors for Psychological Distress. In: 2020 15th IEEE International Conference on Automatic Face and Gesture Recognition (FG 2020), Buenos Aires, Argentina, 16-20 Nov 2020, pp. 371-378. ISBN 9781728130798 (doi: 10.1109/FG47880.2020.00032) Pessanha, Francisca, McLennan, Krista and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2020) Towards Automatic Monitoring of Disease Progression in Sheep: a Hierarchical Model for Sheep Facial Expressions Analysis from Video. In: 2020 15th IEEE International Conference on Automatic Face and Gesture Recognition (FG 2020), Buenos Aires, Argentina, 16-20 Nov 2020, pp. 387-393. ISBN 9781728130798 (doi: 10.1109/FG47880.2020.00107) Yuan, Xinhui and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2020) ALANet:Autoencoder-LSTM for Pain and Protective Behaviour Detection. In: 2020 15th IEEE International Conference on Automatic Face and Gesture Recognition (FG 2020), Buenos Aires, Argentina, 16-20 Nov 2020, pp. 824-828. ISBN 9781728130798 (doi: 10.1109/FG47880.2020.00063) Zhang, Ziheng, Lin, Weizhe, Liu, Mingyu and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2020) Multimodal Deep Learning Framework for Mental Disorder Recognition. In: 2020 15th IEEE International Conference on Automatic Face and Gesture Recognition (FG 2020), Buenos Aires, Argentina, 16-20 Nov 2020, pp. 344-350. ISBN 9781728130798 (doi: 10.1109/FG47880.2020.00033) 2019 Hewitt, Charlie and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2019) Pose-Informed Face Alignment for Extreme Head Pose Variations in Animals. In: 2019 8th International Conference on Affective Computing and Intelligent Interaction (ACII), Cambridge, UK, 3-6 Sept 2019, pp. 22-27. ISBN 9781728138886 (doi: 10.1109/ACII.2019.8925472) Marchi, E. et al. (2019) The ASC-inclusion perceptual serious gaming platform for autistic children. IEEE Transactions on Games, 11(4), pp. 328-339. (doi: 10.1109/TG.2018.2864640) Pavarini, Gabriela, Sun, Rui, Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113, Cross, Ian, Schnall, Simone, Fischer, Agneta, Deakin, Julia, Ziauddeen, Hisham, Kogan, Aleksandr and Vuillier, Laura (2019) The role of oxytocin in the facial mimicry of affiliative vs. non-affiliative emotions. Psychoneuroendocrinology, 109, 104377. (doi: 10.1016/j.psyneuen.2019.104377) (PMID:31493677) Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113, Lu, Yiting, Hou, Xijie, McLennan, Krista and Robinson, Peter (2019) Estimation of pain in sheep using computer vision. In: Moore, Rhonda J. (ed.) Handbook of Pain and Palliative Care: Biopsychosocial and Environmental Approaches for the Life Course. Springer: Cham, pp. 145-157. ISBN 9783319953687 (doi: 10.1007/978-3-319-95369-4_9) McLennan, Krista and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2019) Development of an automated pain facial expression detection system for sheep (Ovis Aries). Animals, 9(4), 196. (doi: 10.3390/ani9040196) (PMID:31027279) (PMCID:PMC6523241) Khan, Akbir and Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113 (2019) Considering Race a Problem of Transfer Learning. In: 2019 IEEE Winter Applications of Computer Vision Workshops (WACVW), Waikoloa, HI, USA, 07-11 Jan 2019, pp. 100-106. ISBN 9781728113920 (doi: 10.1109/WACVW.2019.00022) 2018 Wang, Bihao, Mahmoud, Marwa ORCID: https://orcid.org/0000-0002-5932-9113, Cuesta, Javier Echevarría, Close, Hannah, Stafford-Fraser, Quentin and Robinson, Peter (2018) Enhanced Traffic Simulation for Improved Realism in Driving Simulators. In: Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomativeUI '18), Toronto, ON, Canada, 23-",
  "content_length": 35082,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:00"
}