{
  "name": "Marwan M. Fayed",
  "homepage": "https://mf208.host.cs.st-andrews.ac.uk",
  "status": "success",
  "content": "Dr Marwan Fayed - School of Computer Science Breadcrumbs navigation Dr Marwan Fayed Senior Lecturer Researcher profile Email Marwan.Fayed@st-andrews.ac.uk Selected publications Topaz: declarative and verifiable authoritative DNS at CDN-scaleLarisch, J., Thijm, T. A., Ahmad, S., Wu, P., Arnfeld, T. & Fayed, M., Aug 2024, ACM SIGCOMM '24: proceedings of the ACM SIGCOMM 2024 Conference. New York: ACM, p. 891-903 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Towards re-architecting today's internet for survivability: NSF workshop reportBustamante, F. E., Doyle, J., Willinger, W., Fayed, M., Alderson, D. L., Low, S., Savage, S. & Schulzrinne, H., 6 Aug 2024, In: Computer Communication Review. 54, 2, p. 36-47 12 p.Research output: Contribution to journal › Article Open access Evaluating practical QUIC website fingerprinting defenses for the massesSiby, S., Barman, L., Wood, C., Fayed, M., Sullivan, N. & Troncoso, C., 2023, In: Proceedings on Privacy Enhancing Technologies.Research output: Contribution to journal › Article › peer-review Global, passive detection of connection tamperingSundara Raman, R., Merino, L.-H., Bock, K., Fayed, M., Levin, D., Sullivan, N. & Valenta, L., 10 Sept 2023, ACM SIGCOMM '23: proceedings of the ACM SIGCOMM 2023 conference. Schulzrinne, H. & Misra, V. (eds.). New York, NY: ACM, p. 622-636 15 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open access Let the right one in: attestation as a usable CAPTCHA alternativeWhalen, T., Meunier, T., Kodali, M., Davidson, A., Fayed, M., Faz-Hernández, A., Ladd, W., Maram, D., Sullivan, N., Wolters, B. C., Guerreiro, M. & Galloni, A., 2022, Proceedings of the 18th Symposium on Usable Privacy and Security, SOUPS 2022. USENIX Association, p. 599-612 14 p. (Proceedings of the 18th Symposium on Usable Privacy and Security, SOUPS 2022).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open access Respect the ORIGIN! a best-case evaluation of connection coalescing in the wildSinganamalla, S., Paracha, M. T., Ahmad, S., Hoyland, J., Valenta, L., Safronov, Y., Wu, P., Galloni, A., Heimerl, K., Sullivan, N., Wood, C. A. & Fayed, M., 25 Oct 2022, Proceedings of the 2022 ACM Internet Measurement Conference. Barakat, C. & Pelsser, C. (eds.). New York, NY: ACM, p. 664-678 15 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution You get PADDING, everybody gets PADDING! You get privacy? evaluating practical QUIC website fingerprinting protections for the massesSiby, S., Barman, L., Wood, C., Fayed, M., Sullivan, N. & Troncoso, C., 15 Mar 2022, (Submitted) arXiv, 17 p.Research output: Working paper › Preprint Open access Oblivious DNS over HTTPS (ODoH): a practical privacy enhancement to DNSSinganamalla, S., Chunhapanya, S., Hoyland, J., Vavruša, M., Verma, T., Wu, P., Fayed, M., Heimerl Kurtis, S. N. & Wood, C., 28 Aug 2021, Proceedings on Privacy Enhancing Technologies (PoPETs). PoPETs, Vol. 4. p. 575-592 18 p. (Proceedings on Privacy Enhancing Technologies).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open access The ties that un-bind: decoupling IP from web services and sockets for robust addressing agility at CDN-scaleFayed, M., Bauer, L., Giotsas, V., Kerola, S., Majkowski, M., Odintsov, P., Sitnicki, J., Chung, T., Levin, D., Mislove, A., Wood, C. A. & Sullivan, N., 9 Aug 2021, SIGCOMM'21: Proceedings of the ACM SIGCOMM 2021 Conference. Kuipers, F. & Caesar, M. (eds.). New York, NY: ACM, p. 433-446 14 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open access Quality of experience in ICN: keep your low-bitrate close, and high-bitrate closerLi, W., Oteafy, S. M. A., Fayed, M. & Hassanein, H. S., 29 Dec 2020, (E-pub ahead of print) In: IEEE/ACM Transactions on Networking. Early access, p. 1-14Research output: Contribution to journal › Article › peer-review See more publications",
  "content_length": 4046,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:01"
}