{
  "name": "Mary-Anne Hartley",
  "homepage": "https://www.light-laboratory.org",
  "status": "success",
  "content": "Home | LiGHT Laboratory top of pageHealth Equity= (data) We make useful data-driven toolsWe make useful data-driven toolsused and prove their utility at scaleused and prove their utility at scale INTERNATIONALLABORATORYRwanda | Switzerland | USA Harvard Chan School of Public Health & Brigham and Women's Computer Science INTERNATIONALLABORATORYRwanda | Switzerland | USASchool of Computer ScienceSchool of Public HealthAriadne LabsKoita Center for Digital HealthAfrica AI Scaling HubBuilding MULTIDISCIPLINARY expertise at the intersection of Global Health, Data Science, Clinical Medicine, Humanitarian Response, Refugee Wellness, Implementation Research, and User-Centered Design to resolve simple problems in complex environments. Sustainable innovationthrough co-development with NGO, humanitarian and frontline actorsCiGHT [Collaborative for intelligent Global Health and Humanitarian Response Technologies] is the Collaborator network of LiGHT. OPEN &IMPLEMENTABLE AI​for provable equitable accuracyA suite of medical LLMs adapted to low-resource & humanitarian contextsGitHub DIStributed COllaborative learning: a code-free, web-based platform to collaboratively train AI without sharing any dataDISCO website Massive Multimodal Open RAG & Extraction pipeline to personalize LLMs with a diverse corpus of multimodal inputsGitHub We are OPEN SOURCE. Safe AI is scrutable, accessible and representative Student LedJoin Us! +52Students6MDs20Nationalities+100KDownloads of MEDITRON+20Organizations on MOOVE+18KExperts evaluationFromResearchToDirect ImpactTraining and capacity building are integral into our projects allowing a direct and provable impact on patient outcomes during and through research. ClinicalResearchLarge-scale international clinical trials in complex environments to evaluate real-world implementability of AI tools Massive Open Online Validation & Evaluation An Embedded Adaptive Platform Randomized Controlled Trial to Evaluate the Safety and Efficacy of Medical LLMs 🇹🇿🇰🇪🇳🇬🇪🇹🇷🇼MOOVE website Integrated Management of Childhood Illness using Pulmonary Lung Ultrasound An international RCT evaluating the safety of ultrasound for the management of pediatric respiratory illness 🇸🇳🇹🇿🇿🇦 IMCI+ website Computer-Assisted Diagnosis with Lung Ultrasound for the detection of pulmonary TB An international RCT 🇧🇯🇲🇱🇿🇦Coming Soon bottom of page",
  "content_length": 2361,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:04"
}