{
  "name": "Marynel Vázquez",
  "homepage": "https://seas.yale.edu/faculty-research/faculty-directory/marynel-vazquez",
  "status": "success",
  "content": "Marynel Vázquez | Professor | Yale Engineering Skip to Content Marynel Vázquez Assistant Professor of Computer Science Phone:(203) 432-1741 Email Room / Office:AKW 402 Office Address:51 Prospect Street New Haven, CT 06511 Mailing Address:P.O. Box 208285 New Haven, CT 06520 Website: Research Website About Marynel Vázquez Degrees Ph.D., Carnegie Mellon University M.S., Carnegie Mellon University B.Eng., Universidad Simón Bolívar, Venezuela Perspectives Marynel Vázquez is a computer scientist and roboticist. Her research focuses on Human-Robot Interaction (HRI), specially in multi-party settings. For instance, her work investigates social group phenomena in HRI, like spatial patterns of behavior and group social influence. Also, her work aims to advance perception and decision making algorithms to enable autonomous, social robot behavior in multi-party settings. A key idea that has driven her recent work is abstracting human-robot interactions as graphs. This allows robots to reason about individual, relationship and group factors in unison. Marynel enjoys building systems to demonstrate ideas in practice, including new robots and infrastructure that can facilitate HRI research. Marynel's research approach is interdisciplinary: it combines elements of computer science (especially artificial intelligence), behavioral science, and design. Selected Awards & Honors NSF CAREER Award 2022-2027 Four best paper nomination awards (at HRI'21, IROS'18 and two nominations at RO-MAN'16) One best poster nomination award (HAI'20) 2020 Amazon Research Award Selected Publications Pose Generation for Social Robots in Conversational Group Formations. Vázquez, M., Lew, A., Gorevoy, E., and Connolly, J. Frontiers in Robotics and AI, 2022. Learning Gaze Behaviors for Balancing Participation in Group Human-Robot Interactions. S Gillet, MT Parreira, M Vázquez, I Leite. Proceedings of the 2022 ACM/IEEE International Conference on Human-Robot Interaction, 2022. An Approach to Deploy Interactive Robotic Simulators on the Web for HRI Experiments: Results in Social Robot Navigation. Tsoi, N., Hussein, M., Fugikawa, O., Zhao, J.D., and Vázquez, M. Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2021. Prompting Prosocial Human Interventions in Response to Robot Mistreatment. Connolly, J., Mocz, V., Salomons, N., Valdez, J., Tsoi, N., Scassellati, B., and Vázquez, M. Proceedings of the 2020 ACM/IEEE International Conference on Human-Robot Interaction (HRI), 2020. Deep Local Trajectory Replanning and Control for Robot Navigation. A. Pokle, R. Martín-Martín, P. Goebel, V. Chow, H. M. Ewald, J. Yang, Z. Wang, A. Sadeghian, D. Sadigh, S. Savarese, M. Vázquez. Proceedings of the 2019 IEEE International Conference on Robotics and Automation (ICRA), 2019. Spatial and Other Social Engagement Cues in a Child-Robot Interaction: Effects of a Sidekick. M. Vázquez, A. Steinfeld, S. E. Hudson, J. Forlizzi. Proc. of the 2014 ACM/IEEE International Conference on Human-Robot Interaction (HRI), 2014. Related Content When machines join the team What would a robot teammate be like?",
  "content_length": 3130,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:07"
}