{
  "name": "Maryam Mehrnezhad",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/maryam-mehrnezhad",
  "status": "success",
  "content": "Maryam Mehrnezhad - Royal Holloway Research Portal © C Maryam Mehrnezhad Dr Reader in Information Security, Department of Information Security https://orcid.org/0000-0002-4223-6885 EmailMaryam.Mehrnezhadrhul.acuk TW20 0EX Personal profile Personal profileDr Maryam Mehrnezhad is a Reader in Information Security Department, Royal Holloway University of London (RHUL), UK, joined in September 2022. Before that, she was a Senior Lecturer (Associate Professor) in the Secure and Resilient Systems (SRS) group, Newcastle University, UK, and a Visiting Professor at ETH Zurich, Switzerland, in 2022. Between 2016 and 2022, she was a tenured track Research Fellow (Research Assistant), at Newcastle University, UK. For more information, please visit her homepage:  https://sites.google.com/view/maryammjd/home Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 23 Conference contribution 19 Article 2 Editorial Research output per year Research output per year Measuring Online Hate on 4chan Using Pre-Trained Deep Learning ModelsBermudez Villalva, A., Mehrnezhad, M. & Toreini, E., 27 Mar 2025, In: IEEE Transactions on Technology and Society. 6, 2, p. 200-209 10 p.Research output: Contribution to journal › Article › peer-review Open Access PhotonKey: A key pairing system for IoT resource and input constrained devices using light sensorsGray, D. & Mehrnezhad, M., Mar 2025, In: Journal of Information Security and Applications. 89, 14 p., 103926.Research output: Contribution to journal › Article › peer-review Open Access Bluetooth security analysis of general and intimate health IoT devices and apps: the case of FemTechCook, S., Mehrnezhad, M. & Toreini, E., Dec 2024, In: International Journal of Information Security. 23, 6, p. 3547-3567 21 p.Research output: Contribution to journal › Article › peer-review Open Access Fairness as a Service (FaaS): verifiable and privacy-preserving fairness auditing of machine learning systemsToreini, E., Mehrnezhad, M. & van Moorsel, A., Apr 2024, In: International Journal of Information Security. 23, 2, p. 981-997 17 p.Research output: Contribution to journal › Article › peer-review Open Access Invisible, Unreadable, and Inaudible Cookie Notices: An Evaluation of Cookie Notices for Users with Visual ImpairmentsClarke, J. M., Mehrnezhad, M. & Toreini, E., 18 Mar 2024, In: ACM Transactions on Accessible Computing. 17, 1, p. 1-39 1.Research output: Contribution to journal › Article › peer-review Open AccessFile 38 Downloads (Pure) View all 44 research outputs Projects 2 Finished Projects per year Cyber Security and Privacy in Fertility Technologies (CyFer)Mehrnezhad, M. (PI)Eng & Phys Sci Res Council EPSRC1/09/22 → 30/06/23Project: Research AGENCY: Assuring Citizen Agency in a World with Complex Online HarmsMehrnezhad, M. (PI)Eng & Phys Sci Res Council EPSRC1/09/22 → 31/03/25Project: Research",
  "content_length": 3444,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:06"
}