{
  "name": "Mary Lou Soffa",
  "homepage": "http://www.cs.virginia.edu/~soffa/index.html%3Fp=6.html",
  "status": "success",
  "content": "Mary Lou Soffa Skip to content HomePublicationsResearch StudentsProfessional ActivitiesDiversity ActivitiesTeaching Mary Lou Soffa Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â Â  Mary Lou Soffa Owens R. Cheatham Professor Department of Computer Science Â The University of Virginia 151 Engineer’s Way P.O. Box 40074 Charlottesville, VA 22904-4740 Â Â Â Â Â  email:Â  soffa “at” virginia Â Â VoiceÂ  434-982-2277 Â  FaxÂ  434-982-2214 Â BIO: Mary Lou Ehnot Soffa is the Owen R. Cheatham Professor of Sciences at the Computer Science Department at the University of Virginia. From 2004 to 2012, she served as the Department Chair at UVA.Â  From 1977 to 2004, she was a Professor of Computer Science at the University of Pittsburgh and also served as the Dean of Graduate Studies in the College of Arts and Sciences from 1991 to 1996. Her research interests include optimizing compilers, virtual execution environments, software testing, program analysis, software security,Â  and software systems for multi-core architectures.Â  She has published over 175 articles andÂ  has directed 32 Ph.D. students to completion, half of whom are women. In 2020, Mary Lou was awarded the School of Engineering Distinguished Faculty Award. She received the Distinguished Alumni Award at the 50th Celebration of the Department of Computer Science, University of Pittsburgh in 2017. Â She was awarded the IEEE 2015 TCSE Software Engineering Women in Science and Engineering Leadership Award (WISE).Â  She received theÂ  SIGSOFT Influential Educator Award in 2014 and theÂ  Ken Kennedy Award in 2012 for contributions to compiler technology and software engineering, exemplary service to the profession, and lifelong dedication to mentoring and improving diversity in computing.Â  Mary Lou is bothÂ  an IEEE Fellow andÂ  an ACM Fellow. SheÂ  received the Anita Borg Technical Leadership Award in 2011 and was selected for the White House’s Presidential Award for Excellence in Science, Mathematics and Engineering Mentoring the same year. She received the Computing Research Association (CRA) Nico Habermann Award in 2006Â  and was selected as a Girl Scout Woman of Distinction in 2003 . She has received both the SIGPLAN and SIGSOFT Service Awards.Â  She has served as conference chair, program chair or program committee member forÂ  numerous conferences in programming languages and software engineering. Â  She currently serves on the ACM Publication Board and was elected in 2008 and 2012 to serve on the ACM Council. VITAE Â Comments are closed. Mary Lou Soffa Proudly powered by WordPress. karaman escort",
  "content_length": 2655,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:04"
}