{
  "name": "Marzyeh Ghassemi",
  "homepage": "http://www.marzyehghassemi.com",
  "status": "success",
  "content": "Healthy ML Search Overview The “Healthy ML” group at MIT, led by Dr. Marzyeh Ghassemi, focuses on creating and applying machine learning to understand and improve health in ways that are robust, private and fair. Health is important, and improvements in health improve lives. However, we still don’t fundamentally understand what it means to be healthy, and the same patient may receive different treatments across different hospitals or clinicians as new evidence is discovered, or individual illness is interpreted. Unlike many problems in machine learning - games like Go, self-driving cars, object recognition - disease management does not have well-defined rewards that can be used to learn rules. Models must also be “healthy”, in that they should not learn biased rules or recommendations that harm minorities or minoritized populations. The Healthy ML group tackles the many novel technical opportunities for machine learning in health, and works to make important progress with careful application to this domain. Read more about our Research Directions and Publications. The Healthy ML group is also affiliated with the AI for Society group at MIT. News December 2025 - Congratulations to Vinith, Sana, Lena, Wale, Haoran, Kumail, and Yuxin, whose work has been published in NeurIPS 2025! Learning the Wrong Lessons: Syntactic-Domain Spurious Correlations in Language Models [Paper] Chantal Shaib*, Vinith Suriyakumar*, Byron Wallace, Marzyeh Ghassemi An Investigation of Memorization Risk in Healthcare Foundation Models [Paper] Sana Tonekaboni*, Lena Stempfle*, Adibvafa Fallahpour, Walter Gerych, Marzyeh Ghassemi Aggregation Hides Out-of-Distribution Generalization Failures from Spurious Correlations [Paper] Olawale Salaudeen, Haoran Zhang, Kumail Alhamoud, Sara Beery, Marzyeh Ghassemi On Group Sufficiency Under Label Bias [Paper] Haoran Zhang, Olawale Salaudeen, Marzyeh Ghassemi KScope: A Framework for Characterizing the Knowledge Status of Language Models [Paper] Yuxin Xiao, Shan Chen, Jack Gallifant, Danielle Bitterman, Tom Hartvigsen, Marzyeh Ghassemi November 2025 - Congratulations to Alice and Haoran, whose work has been published in Nature Scientific Reports! Opportunistic screening of type 2 diabetes with deep metric learning using electronic health records [Paper] Qixuan Jin, Haoran Zhang, Lukasz Szczerbinski, Jiacheng Zhu, Walter Gerych, Xuhai Xu, Kai Wang, Sarah Hsu, Ravi Mandla, Aaron J. Deutsch, Alisa Manning, Josep M. Mercader, Thomas Hartvigsen, Miriam S. Udler, Marzyeh Ghassemi February 2025 - Congratulations to Dr. Ghassemi for being named a Sloan Research Fellow! December 2024 - Congratulations to Dr. Ghassemi for being named a AI2050 Fellow! Joining the Lab If you are interested in doing an UROP, SUROP, or MEng, please review the lab’s research page, and talk to a graduate student or postdoc who might be closest to your research interest. It is important that all undergraduate students have a graduate or postdoctoral scholar who is close to their research area for advice. If you are interested in doing a PhD with the Healthy ML group, Dr. Ghassemi admits PhD students from the MIT EECS, IDSS, and HST pools. Please plan to apply to any or all of these programs, and indicate in your application that you would be interested in working with her. Unfortunately, MIT does not allow for direct admission from an individual PI to the institution. For postdoctoral fellows, please send your resume and a short statement of what work you would plan to do for your time with the lab (with references to relevant content from the lab). Katie O’Reilly (oreilly1@mit.edu) can schedule a 30-minute review meeting once an assessment of a good fit has been made. Cite × Copy Download",
  "content_length": 3730,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:08"
}