{
  "name": "Masahiro Takinoue",
  "homepage": "http://www.takinoue-lab.jp/en",
  "status": "success",
  "content": "HOME | Takinoue Lab., Institute of Science Tokyo (former name: Tokyo Institute of Technology) Laboratory for Intelligent Living Soft Matter Physics and Molecular Computing Laboratory for Chemistry and Life Science, Institute of Integrated Research;Living Systems Materialogy (LiSM) Research Group, Institute of Integrated Research;Department of Life Science and Technology, School of Life Science and Technology;Department of Computer Science, School of Computing;Institute of Science Tokyo*, Japan[*former name is Tokyo Institute of Technology] [Postdoc and Ph.D. student positions available, as of October 1st, 2025] Life is a kind of autonomous computational system using chemical energy. We pioneer molecular computing and biophysics for intelligent soft matter and artificial cells. Pioneering new science through the fusion of information science, life science, and physics Introduction of our lab Using bio-nanotechnology and computational simulations, our laboratory conducts research on (1) Information science for novel computation with materials, (2) Bottom-up synthetic biology for adaptable and evolvable artificial cells, and (3) Physics for information biopolymers and autonomous, intelligent materials. Living organisms are anomalous matter with information, autonomy, and intelligence. It is necessary to construct novel science and technology that can deal with such an anomalous matter because this is an integrated theme that cannot be handled by conventional divisions such as information science, life science, physics, etc. Through the research described above, we will pioneer a new science related to autonomous and intelligent matter, such as living organisms. The results obtained will be applied to the development of highly functional biological informational systems like living organisms, such as intelligent molecular systems and nanorobots that adapt and evolve. In addition, the fundamental question, “What is life?” from the standpoints of physics and information will be revealed through the research. In the future, we will develop molecular computers, molecular robots, operating systems for artificial cells, artificial cells for in vivo therapy, drug delivery nanomachines, micro soft molecular robots that can repair themselves like living organisms, and computers based on new principles, and so on. 物質を使った新しい計算原理に関する情報科学 自然現象は、自由エネルギー最小化の問題を解いて平衡状態を実現したり、化学エネルギーを使った非平衡状態において自発パターンを形成したりしますが、これらの現象は、ある種の自律的な計算プロセスであるととらえることができます。そこで、分子、粒子、流体、量子、生物などの物質、物理系、自然現象を使った新しい計算手法である「ナチュラルコンピューティング」の研究を進めています。ナノサイズの分子コンピュータの開発や分子プログラミング手法など新しい計算原理を探求しています。また、物質、物理系、自然現象を電子計算機上でシミュレーションする「物理・化学シミュレーション」の研究も進めています。[詳細はこちら…] 適応・進化する人工細胞の合成生物学 私たち生命システムが非生命の物質からどのようにできているか、どのように知性を発揮しているかを理解することは、生命科学だけでなく物理科学や情報科学においても、未解明の重要な問いとして存在しています。そこで、生物の最小単位である細胞を模倣した人工細胞や環境に適応し進化する人工生命システムの構築を通し、物質としてあり得る生命を探求し本質を抽出する非天然生物物理学（天然にないものの生物物理学）を開拓して、「生命とは何か？」の問いに迫ります。たとえば、DNAや脂質膜を利用して、小胞型の人工細胞やコアセルベート型（液-液相分離型）の人工細胞などを構築しています。さらに、DNAナノテクノロジーやマイクロ流体工学を利用して、細胞模倣型の分子ロボットも目指します。[詳細はこちら…] 自律的な計算能力を持つソフトマターに関する物理学 エネルギー・物質・情報の出入りがある非平衡開放系における、情報を持ったソフトマターの自己秩序化現象を探求しています。まさにこれは生命システムを物理学的に捉えた描像と言えます。ここでは、電場・光等による非平衡場のエネルギーや、化学反応による分子の自由エネルギーの変換によって、計算・記憶・自律運動・集団挙動などの動的な現象を示す知的なアクティブマターを実現し、その物理的なメカニズムの解明に関して研究を行っています。また、これを応用したマイクロマシンやソフトロボットの構築も行っています。[詳細はこちら…] Join our laboratory A postdoc position for the Human Frontier Science Program (HFSP) A JSPS postdoc position Ph.D. student positions for International Graduate Program (A) and (C), Tokyo Tech . ページトップPage Top",
  "content_length": 3502,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:11"
}