{
  "name": "Masashi Toyoda",
  "homepage": "https://www.iis.u-tokyo.ac.jp/en/research/staff/masashi-toyoda",
  "status": "success",
  "content": "TOYODA Masashi Professor - Institute of Industrial Science, the University of Tokyo Research Research Find Labs View list of research Departments and Research Centers Interdisciplinary Group Research List of Emeritus Professors Find Labs Find Labs Find Labs View list of research Departments and Research Centers Interdisciplinary Group Research List of Emeritus Professors Find Labs Profile Profile TOYODA Masashi Professor Website Special Field of Study Interactive Data Analysis Departments and Research Centers Department of Informatics and Electronics Large-Scale Experiment and Advanced-Analysis Platform(LEAP) Center for Dependable Socio-information Platform（DSiP） Harmonic Mobility Research Center Educational Systems Information and Communication Engineering : Graduate School of Information Science and Technology Posters Keywords Web, Multimedia Related Articles 2025.05.16 Topics Visualizing the Present and Future Using the Vast Amount of Data in Digital Space The digital world is filled with information being transmitted by individuals and sensors connected to the internet, offering valuable insights into the state of the world at any given moment. This information serves as a mirror of the real world, and within this vast amount of digital data lie valuable clues that make it possible to analyze and visualize social trends and forecast the future. Building on this concept, Professor Masashi Toyoda of the Institute of Industrial Science, The University of Tokyo is exploring methods to harness the ever-growing volume of data that accumulates daily in digital space. Toyoda has proposed methods using data from social media to estimate various figures, such as the number of positive COVID-19 cases that will arise and the degree of attendance at various types of events, as well as techniques for visualizing the results of data analyses. How are such estimates made possible? And how will visualizing these various forms of data contribute to society? We spoke with Toyoda to find out. Website Prospective Students at IIS Contact about Joint Research Contact Website Prospective Students at IIS Contact about Joint Research",
  "content_length": 2153,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:12"
}