{
  "name": "Masahiro Furukawa",
  "homepage": "https://sites.google.com/site/masahirofurukawa",
  "status": "success",
  "content": "Masahiro FURUKAWASearch this siteEmbedded FilesSkip to main contentSkip to navigation[Japanese]Masahiro FURUKAWA, Ph.D.Associate Professor, Maeda Laboratory Department of Bioinformatic Engineering, Graduate School of Information Science & Technology, Osaka University [Osaka University - Researchers]CiNet (Room #3A1, 1-4, Yamadaoka, Suita, Osaka 565-0871, Japan)m.furukawa [at] ist.osaka-u.ac.jp / ORCID / Facebook / Twitter / YoutubeNewsCo-author work has been published. Extrapolation of Thermal Sensation: Warm-cold Stimulus Pair Elicits a Sense of Warmth Outside the Stimulus, in IEEE Access (Apr 30th, 2024)I've done \"Tutorial Talk\" in IROS 2022. Co-author work has been published. Robustness of Rhythmic-Based Dynamic Hand Gesture with Surface Electromyography (sEMG) for Authentication (Dec 14th, 2020)Academic EducationMay 2010, The University of Electro-Communications (at Department of Mechanical Engineering and Intelligent Systems) Ph.D.in Engineering Title of  Dissertation: \"The Study of Information Media with Using Whisker Structured User Interface\"Apr. 2009, Graduate School of Media Design, Keio University, Inami Group, Visiting Researcher Apr. 2007, The University of Electro-Communications, Doctoral Course Student(at Department of Mechanical Engineering and Intelligent Systems) May 2007, The University of Electro-Communications (at Department of Mechanical Engineering and Intelligent Systems) Master of Engineering May 2005, The University of Electro-Communications (at Department of Mechanical Engineering and Intelligent Systems) Bachelor of Engineering Professional CareerOct. 2015, JST PRESTO Researcher (concurrently) Apr. 2014, Osaka University, Assistant ProfessorApr. 2011, Keio University, Graduate School of Media Design (KMD), Project Assistant Professor, Tachi Laboratory, JST-CREST \"Haptic Media\" Project (~ Mar. 2014)Apr. 2010, Research Fellow of the Japan Society for the Promotion of Science(PD) as Post Doctor (Kajimoto Laboratory, at Graduate School of Informatics and Engineering, Department of Informatics,  The University of Electro-Communications)Apr. 2009, Research Fellow of the Japan Society for the Promotion of Science(DC2) as Doctoral Student (Inami Group, Graduate School of Media Design, Keio University)Membership of Academic Societies ACM / IEEE / Virtual Reality Society of Japan / Robotics Society of Japan / Human Interface SocietyReviewerIEICE / IEEE VR / World Haptics / 3DUI / VRSJ / RSJ / HISResearch InterestTelexistence / Human Perception / Haptic Interface / VectionFlying TELUBee (2014-) TEST FLIGHT SHOWREEL.2014/4/21 addedHiyoshi Jump (2014-) Collaborated with UnityAvailable from Oculus VR Share (March 15, 2014~) 2014/4/21 addedHaptic Tele-existence System TELESAR V (2011-)Latest News about TELESAR V is here (Google Search in News Category)2012/12/04 addedVection Field (2010-)  2011/05/05 16:45 addedTactile Proximity Sensation Induced by Other’s Finger Movement above One’s Palm (2010)It is widely known that tickle sensation is not only induced by direct contact but also induced by the gesture near the body surface. This phenomenon can be utilized for the remote communication as a way to present pseudo haptic sensation with visual cue. In this paper, this pseudo haptic sensation was combined with vibration and tickle sensation was evaluated. The result revealed that combination of vibration and the visual cue presenting the gesture near the body surface induces as strong tickle sensation as the real tickle.see also [Project Page] 2011/05/13 13:30 addedPedestrian Collision Prevention System (2010-)  2011/03/11 16:50 addedFur Display (2009)Wearable computing technology is one of the methods that can augment the information processing ability of humans. However, in this area, a soft surface is often necessary to maximize the comfort and practicality of such wearable devices. Thus in this paper, we propose a soft surface material, with an organic bristling effect achieved through mechanical vibration, as a new user interface. We have used fur in order to exhibit the visually rich transformation induced by the bristling effect while also achieving the full tactile experience and benefits of soft materials. Our method needs only a layer of fur and simple vibration motors. The hairs of fur instantly bristle with only horizontal mechanical vibration. The vibration is provided by a simple vibration motor embedded below the fur material. This technology has significant potential as garment textiles or to be utilized as a general soft user interface.Sensitivity of Human Hairy Skin with Vibrotactile Stimulation through Body Hair (2007)This paper reports the detection threshold of human hairy skin with the use of a direct vibrotactile stimulus to the hair on human hairy skin. We designed an experimental method to quantify the psychological effect and developed a stimulation instrument to directly stimulate the hair. This vibrotactile stimulation was provided from the tip of tweezers which traveled horizontally or vertically against the human skin. The stimulation point was the approximate middle region of the hair on the middle finger and forearm. A psychological experiment was conducted based on the hypothesis that a frequency characteristic exists on hairy skin with direct stimulus to the hair. As a result, a significant difference depends on frequency was obtained with ANOVA. It was described that the vibrotactile stimulus was conducted to Pacinian by the body hair on the middle finger which has so small section area. This is conflicting finding concerning the size of the contactor which can conduct the stimulus into the lower layer of skin. However, this thresholdcurve and also the introspection reports of participants support this novel finding.AwardsTadatoshi Kurogi, Masano Nakayama, Katsunari Sato, Sho Kamuro, Charith Lasantha Fernando, Masahiro Furukawa, Kouta Minamizawa, Susumu Tachi:Haptic Transmission System to Recognize Differences in Surface Textures of Objects for Telexistence, Proceedings of IEEE Virtual Reality 2013, PO-042, Orlando, Florida, pp.137-138 (2013.3) [Best Poster Award]Charith Lasantha Fernando, Masahiro Furukawa, Tadatoshi Kurogi,Sho Kamuro, Katsunari Sato, Kouta Minamizawa, Susumu Tachi:Design of TELESAR V for Transferring Bodily Consciousness in Telexistence,in Proc. of IEEE/RSJ International Conference on Intelligent Robots and Systems(IROS2012), Vilamoura, Algarve, Portugal (2012.10) [web] [ICROS Best Application Paper Award Finalist]Masahiro Furukawa, Hiromi Yoshikawa, Taku Hachisu, Shogo Fukushima, Hiroyuki Kajimoto, “Vection Field” for Pedestrian Traffic Control, Augmented Human international conference, 2011 (Tokyo, March 12-14 2011) [web][web] [Best Paper Award] (Refereed, Oral Presentation)Erika SAWADA, Tatsuhito AWAJI, Keisuke MORISHITA, Masahiro FURUKAWA, Tomohisa ARUGA, Ryuta TAKEICHI, Tomoko FUJII, Hidetoshi KIMURA, Noriyoshi SHIMIZU, Shinya IDA, Takuji TOKIWA, Maki SUGIMOTO, Masahiko INAMI, BYU-BYU-View: A Wind Communication Interface，Laval Virtual 2008，Laval France，April 9-13.2008. (Refereed Exhibition) [web] [Interfaces et Materiels Award]Journal (International only)Hua, Junjie and Furukawa, Masahiro and Maeda, Taro, \"Extrapolation of Thermal Sensation: Warm-cold Stimulus Pair Elicits a Sense of Warmth Outside the Stimulus,\" in IEEE Access, doi: https://doi.org/10.1109/ACCESS.2024.3392276Aoyama, Kazuma and Miyamoto, Nobuhisa and Sakurai, Satoru and Iizuka, Hiroyuki and Mizukami, Makoto and Furukawa, Masahiro and Maeda, Taro and Ando, Hideyuki, \"Electrical Generation of Intranasal Irritating Chemosensation,\" in IEEE Access, vol. 9, pp. 106714-106724, 2021, https://doi.org/10.1109/ACCESS.2021.3100851Alex Ming Hui Wong, Masahiro Furukawa, Taro Maeda, Robustness of Rhythmic-Based Dynamic Hand Gesture with Surface Electromyography (sEMG) for Authentication, MDPI, Electronics 2020, 9(12), 2143; https://doi.org/10.3390/electronics9122143 Ming Chang , Hiroyuki Iizuka, Hideki Kashioka, Yasushi Naruse, Masahiro Furukawa, Hideyuki Ando, Taro Maeda, Unconscious improvement in foreign language learning using mismatch negativity neurofeedback: A preliminary study, PlosOne, 2017, https://doi.org/10.1371/journal.pone.0178694Mashiro Furukawa, Hiroyuki Kajimoto, Susumu Tachi, SHARED PALM FOR REMOTE TICKLING, Vol 3, No 2 (2013): IJACSci, Vol. 3, No. 2, February, 2013 [web]Conference Paper (International only)Claudio Feliciani*, Sakurako Tanida, Masahiro Furukawa, Hisashi Murakami, Xiaolu Jia, Dražen Brščić and Katsuhiro Nishinari.,Nudging” crowds: When it works, when it doesn't and why., in proc of Traffic & Granular Flow 2022, https://link.springer.com/chapter/10.1007/978-981-99-7976-9_2, https://tgf.iitd.ac.in/09-10-2022-Intro%20for%20Abstracts%20Booklet(Final).pdfJunjie Hua, Masahiro Furukawa, Taro Maeda, The central Mechanism Underlying Extrapolation of Thermal Sensation, Asia Haptics2022Junjie Hua, Masahiro Furukawa, Taro Maeda, Extrapolation of Thermal Sensation and A Neuron-Like Model Based on Distribution Difference and Interactions of Thermoreceptors, World Haptics 2021, https://doi.org/10.1109/WHC49131.2021.9517264Masahiro Furukawa, Teppei Matsuoka, Taro Maeda, The effect of high fps on vision in visual presentation under active motion, Journal of Vision, Vol.21, 2387, https://doi.org/10.1167/jov.21.9.2387Akiyoshi Hara, Taro Maeda, Yasuto Tanaka, Hiroyuki Fujie, Masahiro Furukawa, Does the difference in cranial current path change the torsional impression and behavior Galvanic Vestibular Stimulation?, Journal of Vision Vol.21, 2937, https://doi.org/10.1167/jov.21.9.2937Miyamoto, Hiroki and Hara, Akiyoshi and Furukawa, Masahiro and Ando, Hideyuki and Maeda, Taro, Mismatch Negativity for Visuo-Tactile Inconsistency in Rubber Hand Illusion Paradigm, Proceedings of the 11th Augmented Human International Conference, 2020, https://doi.org/10.1145/3396339.3396391 (short paper)Alex Ming, Hui Wong, Masahiro Furukawa, Hideyuki Ando, Taro Maeda, Dynamic Hand Gesture Authen",
  "content_length": 26389,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:09"
}