{
  "name": "Masamichi Shimosaka",
  "homepage": "http://www.miubiq.cs.titech.ac.jp",
  "status": "success",
  "content": "Shimosaka Research Group Monday, 2025/12/01 CS/AI C TITECH Switch Language日本語 (Japanese)English Shimosaka Research Group pursuing MIUBIQ (machine intelligence in UbiComp Research) Home Members Location News Projects Publications Awards Archives Codes Datasets Navigation How to drive safely & defensively? Learning from experts. Check out our project Urban Dynamics Location data from smartphones help us understand demographics of cities. Check out our project You're not alone. Collective Activity Recognition with Fully Connected CRFs Check out our project Steered CrowdSensing You're more valuable than you think. Help people with your palm. Check out our project Pedometers see through the deep inside of your community. Working-Relationship Detection from Fitbit Sensor Data Check out our project Introduction Welcome to Shimosaka Research Group. This laboratory pursues innovative machine intelligence in ubiquitous and pervasive computing. Research topics include deployments of wearable or ambient sensors for pervasive sensing, intelligent data analytics for modeling human behavior, and lifelog (quantify-self-technology). The lab. is led by Masamichi Shimosaka who collaborate with graduate students in Dept of Computer Science in ISE/TITECH. Towards succeeds on next level applications in ubiquitous computing, we collaborate with companies and governmental organizations as well as national scientific foundation in Japan. Masamichi Shimosaka has moved to CS/ISE/TITECH from IMI/IST/UTokyo since July 2015. The group has restarted as lab. at TITECH! Tweet Our Projects Forecasting Crowded Events using Public Announcements with Large Language Models 2024/10/15 | Forecasting Lifespan of Crowded Events Inspired by Acoustic Synthesis Technique 2024/07/04 | Device-Free Multi-Person Indoor Localization Using the Change of ToF 2023/03/03 | Adaptive incremental beacon placement optimization for crowd density monitoring applications 2021/11/01 | Fine-grained Urban Dynamics Prediction using Large-Scale Mobile Phone Location Data 2021/10/05 | Robustifying Wi-Fi localization by Between-Location data augmentation 2021/09/28 | Driving behavior modeling at un-signalized intersection with inverse reinforcement learning on sequential MDPs 2021/07/12 | Construction vehicle activity recognition based on sensor data 2021/03/16 | Multi-Task Multi-Order Poisson Regression for urban dynamics prediction 2021/03/15 | Fast and stable IRL based driving behavior modeling in continuous state space 2021/03/15 | Predicting anomalous crowds with anomaly score-matching-based regression using transit search logs and GPS mobility logs 2021/02/24 | GroupWiLo: Accurate and Low-cost Wi-Fi-based Localization with Minimization of Parameter Total Variation 2020/11/10 | Adaptive driving behavior modeling towards diverse driving situations using inverse reinforcement learning 2020/11/02 | Robust indoor localization across smartphone models with ellipsoid features from multiple RSSIs 2017/10/23 | Early destination prediction by mobile phone sensing 2017/02/04 | Irregularity prediction based on transit app logs 2017/02/04 | Working-Relationship Detection from Fitbit Sensor Data 2015/10/05 | Urban dynamics analysis with large-scale Location data from smartphones 2015/10/05 | Modeling risk anticipation and defensive driving on residential roads using inverse reinforcement learning 2015/08/17 | Consistent collective activity recognition with fully connected CRFs 2014/09/01 | Social Networks twitter rss Recent News Omni-CityMood: Vision-based Urban Atmosphere Perception from Every Angle at SIGSPATIAL2025 2025/11/04 Presenting our paper on Continuous Inverse Reinforcement Learning with State-wise Safety Constraints for Stable Driving Behavior Prediction at ITSC2025 2025/10/30 Presenting our paper on Exploiting Periodic UWB CIRs for Robust Activity Recognition with Attention-aware Multi-level Wavelet at PerCom2025 2025/02/15 Presenting our paper on revealing Universities’ Atmosphere from Visitor Interests has been presented at IEEE BigData 2024 2024/12/16 Our paper on adaptive incremental-decremental BLE placement optimization for accurate indoor positioning has been presented at IPIN2024. 2024/10/23 Presenting two papers at SIGSPATIAL 2024 2024/10/23 Forecasting Crowded Events using Public Announcements with Large Language Models 2024/10/15 Forecasting Lifespan of Crowded Events Inspired by Acoustic Synthesis Technique 2024/07/04 Our paper on forecasting lifespan of crowded events has been published in IEEE Access 2024/07/04 Presenting our paper on Stable IRL from failed demonstrations at IV2024 2024/05/30 Tweet Search Copyright 2015 · Shimosaka Research Group at TITECH",
  "content_length": 4695,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:12"
}