{
  "name": "Masayuki Fujita",
  "homepage": "http://www.fl.ctrl.titech.ac.jp",
  "status": "success",
  "content": "Home | hatanaka_lab top of pageFacultyTakeshi HatanakaProfessor Vice Dean of WISE SSSwebResearch InterestOur group is working on cyber-physical-social/human systems, interconnected systems of mutually interacting cyber, physical and human components, for a variety of large-scale systems. In particular, we study in an effort to work out fundamental principles to coordinate human/society and highly-networked control systems to ensure optimality and robustness via distributed decision-makings. The main target application fields include smart agriculture, smart sky/ocean, and energy management. Beyond theory-oriented work, we are also addressing social implementation of networked robotics and human-robot collaborations, and plant phenotyping and control in plant factories through interdisciplinary collaborative research projects.Cyber-Physical-Social SystemsCyber-Physical-Human SystemsNetworked RoboticsPV for Robot Zoo AquaPlay VideoFacebookTwitterPinterestTumblrCopy LinkLink CopiedPV for Robot Zoo SkyPlay VideoFacebookTwitterPinterestTumblrCopy LinkLink CopiedMulti-drone persistent coverage control over a farmPlay VideoFacebookTwitterPinterestTumblrCopy LinkLink Copiedfirst experiment of coverage control over a vineyardPlay VideoFacebookTwitterPinterestTumblrCopy LinkLink CopiedMore movies are found here:Promotion Videos for SSS Research & Education Fields are here. News09/2025Hanif completed WISE-SSS and had a Representative Speech in the ceremony09/20251 PhD, 2 Master, and 2 Bachelor students completed their degrees ​​09/2025Y. Toyomoto won Dept. SCE Outstanding Presentation Award09/2025T. Abe won Dept. SCE Outstanding Presentation Award09/2025Our chapter has been published in Springer Book ​​08/2025Our paper won Outstanding Paper Award from SICE ​06/2025Our paper won Outstanding Paper Award from ISCIE ​06/2025E. Abe won Best Seed Award at SSS Matching Workshop ​​03/2025Y. Okada completed WISE-SSS Program ​ 03/2025T. Oshima won JSME Miura Award ​03/2025M. Suenaga won JSME Miura Award ​03/20251 PhD and 3 master students completed their degrees ​03/2025E. Abe won SICE MSCS Outstanding Poster  Award ​03/2025Commemorative Lecture​ for SICE Control Division Pioneer Technology Award​12/2024Y. Takizawa won Outstanding Presentation Award at 67th JJACC12/2024Y. Toyomoto won Best Seed Award at SSS Matching Workshop12/202415th TFST Conference has been finished with success ​ 2025 Aug.      Open Invited Track on CPHS at IFAC World Congress 2026 2025 Aug.      Publication of our chapter in Nonlinear and Constrained Control (Springer Nature) 2025 Aug.      Our paper won Outstanding Paper Award from SICE 2025 Sep.      Our chapter has been published in Springer Book 2025 Sep.      T. Abe won Dept. SCE Outstanding Presentation Award 2025 Sep.      Y. Toyomoto won Dept. SCE Outstanding Presentation Award 2025 Sep.      1 PhD, 2 Master, and 2 Bachelor students completed their degrees 2025 Oct.       New members (1 master, 2 bachelor and 1 visiting student) have joined 2025 Oct.       Exhibition at J-AGRI 2025 Oct.       Our paper with Toyota Central Lab has been published in IFAC Journal of Systems and Control 2025 Oct.       Graduate Major in Super Smart Society 2026 Feb.      3rd BrIAS Conference on Smart Agriculture 2026 Dec.      IFAC CPHS 2026S. Otsuki, N. Hatta, M. Hanif, R. Funada, K. Nakashima, and T. Hatanaka Hierarchical Vessel Safe Operation in A Port through CBF, MPC and RRT-like Spatiotemporal Path Planning Nonlinear and Constrained Control - Applications, Synergies, Challenges and Opportunities E. Garone, I.V. Kolmanovsky, and T.W. Nguyen (eds) Lecture Notes in Control and Information Sciences, Springer Nature, pp. 407-441, 2025T. Hatanaka, J. Yamauchi, M. Fujita, and H. Handa Contemporary Issues and Advances in Human-Robot Collaborations Cyber-Physical-Human Systems: Fundamentals and Applications A. Annaswamy, P. P. Khargonekar, F. Lamnabhi-Lagarrigue and S. K. Spurgeon (eds.) Wiley-IEEE Press, pp. 365-400, July, 2023T. Hatanaka, Y. Wasa and K. Uchida (eds.) Economically-enabled Energy Management: Interplay between Control Engineering and Economics Springer Nature, Apr., 2020 (ISBN: 978-981-15-3575-8)T. Hatanaka, N. Chopra, M. Fujita and M. W. Spong Passivity-Based Control and Estimation in Networked Robotics Communications and Control Engineering Series, Springer-Verlag, May, 2015 (Book Announcement in CSM, Book Review in Automatica)T. Hatanaka, N. Chopra, J. Yamauchi and M. Fujita A Passivity-Based Approach to Human-Swarm Collaborations and Passivity Analysis of Human Operators Trends in Control and Decision-Making for Human-Robot Collaboration Systems Y. Wang and F. Zhang (eds.), Springer-Verlag, pp. 325-355, Feb., 2017T. Ibuki, J. Ymauchi, T. Hatanaka, and M. Seto, Basic Functional Analysis for Machine Learning Uchida Rokakuho Publishing Co. Ltd., 2023 (in Japanese)M. Seto, T. Ibuki, and T. Hatanaka Basic Functional Analysis for Machine Learning Uchida Rokakuho Publishing Co. Ltd., 2021 (in Japanese)Y. Nakamura (eds.), H. Chiba, J. Satsuma, N. Yamashita, T. Hatanaka, H. Shimotaira, and K. Takeyasu The World of Applied Mathematics & Physicss Nippon Hyoron sha Co., LTD, 2019 (in Japanese)S. Azuma, M. Nagahara, H. Ishii, N. Hayashi, K. Sakurama and T. Hatanaka Control of Multi-agent Systems Systems Control Engineering Series Vol. 22, Corona Publishing Co., LTD, 2015 (in Japanese)Books/Book ChaptersJ.M. Maestre, F.L. Rodriguez, P. Chanfreut, and T. Hatanaka On Feedback Design for Systems with Agents in the Loop Special section on: Safety, Robustness, and Effectiveness in Human-Machine Teaming IEEE Control Systems Letters, to appear, 2025 ​（10.1109/LCSYS.2025.3586635）Y. Toyomoto, T. Oshima, K. Oishi, J.M. Maestre, and T. Hatanaka Constraint-driven Multi-USV Coverage Path Generation for Aquatic Environmental Monitoring IEEE Transactions on Control Systems Technology, to appear as a regular paper, 2025. ​（10.1109/TCST.2025.3572776）M. Li, K. Laib, T. Hatanaka, and I. Lestas Convergence Rate Bounds for the Mirror Descent Method: IQCs, the Popov Criterion and Bregman Divergence Automatica, vol. 171, 111973, 2025. (10.1016/j.automatica.2024.111973)A.D. Carenero, T. Tanaka, M. Li, T. Hatanaka, Y. Wasa, K. Hirata,Y. Ushifusa, and T. Ida ZEH-oriented Linear Programming for the Sizing Problem of Photovoltaic Panels and Batteries IEEE Access, vol. 12, pp. 80429-80441, 2024. (10.1109/ACCESS.2024.3410369)T. Hatanaka, T. Mochizuki, T. Sumino, J.M. Maestre, and N. Chopra Human Modeling and Passivity Analysis for Semi-autonomous Multi-robot Navigation in Three Dimensions IEEE Open Journal of Control Systems, Special section on Modeling, Control, and Learning Approaches for Human-Robot Interaction Systems, vol. 3, pp. 45-57, 2024. (10.1109/OJCSYS.2023.3343598)J. G. Martin, M. Hanif, T. Hatanaka, J.M. Maestre, and E.F. Camacho Predictive Receding-Horizon Multi-Robot Task Allocation Applied to the Mapping of Direct Normal Irradiance in a Thermosolar Power Plant Solar Energy, vol. 263, 111911, 2023 (10.1016/j.solener.2023.111911)S. Yamashita, K. Irifune, T. Hatanaka, Y. Wasa, K. Hirata, and K. Uchida Passivity-based Analysis and Design for Population Dynamics with Conformity Biases Automatica, vol. 158, 111300, 2023 ​(10.1016/j.automatica.2023.111300)P. Chanfreut, J.M. Maestre, T. Hatanaka, and E.F. Camacho Fast Clustering for Multi-agent Model Predictive Control IEEE Transactions on Control of Network Systems, vol. 9, no. 3, pp. 1544-1555, 2022 （10.1109/TCNS.2022.3158745）T. Shimizu, S. Yamashita, T. Hatanaka, K. Uto, M. Mammarella, and F. Dabbene Angle-aware Coverage Control for 3D Map Reconstruction with Drone Networks IEEE Control Systems Letters, vol. 6, pp. 1831-1836, 2022 (10.1109/LCSYS.2021.3135466)M. Li, S. Yamashita, T. Hatanaka, and G. Chesi Smooth Dynamics for Distributed Constrained Optimization with Heterogeneous Delays IEEE Control Systems Letters, vol. 4, no. 3, pp. 626-631, 2020 (DOI: 10.1109/LCSYS.2020.2989372)T. Miyano, S. Yamashita, T. Hatanaka, K. Shibata, T. Jimbo and M. Fujita Continuous-time Optimization Dynamics Mirroring ADMM Architecture and Passivity-Based Robustification against Delays IEEE Transactions on Control of Network Systems, vol. 7, no. 3, pp. 1296-1307, 2020 ​(DOI: 10.1109/TCNS.2020.2972590)T. Hatanaka, R. Funada and M. Fujita Visual Surveillance of Human Activities via Gradient-based Coverage Control on Matrix Manifolds IEEE Transactions on Control Systems Technology, vol. 28, no. 6, pp. 2220-2234, 2020 (DOI: 10.1109/TCST.2019.2935063)T. Hatanaka, T. Ikawa and N. Li A Passivity-Based Design of Cyber-Physical Building HVAC Energy Management Systems Integrating Optimization and Physical Dynamics Economically-enabled Energy Management: Interplay between Control Engineering and Economics, T. Hatanaka, Y. Wasa and K. Uchida(eds.), Springer Nature, pp. 309-341, 2020 (DOI: 10.1007/978-981-15-3576-5_12)S. Yamashita, T. Hatanaka, J. Yamauchi and M. Fujita Passivity-Based Generalization of Primal-Dual Dynamics for Non-Strictly Convex Cost Functions Automatica, vol. 112, no. 2, 108712, 2020 (DOI: 10.1016/j.automatica.2019.108712)K. Yoshida, M. Inoue, and T. Hatanaka Instant MPC for Linear Systems and Dissipativity-Based Stability Analysis IEEE Control Systems Letters, Vol. 3, No. 4, pp. 811-816, 2019 (DOI: 10.1109/LCSYS.2019.2918095)T. Hatanaka, N. Chopra, T. Ishizaki and N. Li Passivity-Based Distributed Optimization with Communication Delays Using PI Consensus Algorithm IEEE Transactions on Automatic Control,  Vol. 63, No. 12, pp. 4421-4428, 2018 (DOI:10.1109/TAC.2018.2823264)T. Hatanaka, N. Chopra, J. Yamauchi, M. Doi, Y. Kawai and M. Fujita A Passivity-Based System Design of Semi-autonomous Cooperative Robotic Swarm ASME Dynamic Systems and Control Magazine, Vol. 5, No. 2, also in Mechanical Engineering, Vol. 139, No. 6, pp. 14-18, 2017 (DOI:10.1115/1.2017-Jun-6)Selected Recent Publicationsbottom of page",
  "content_length": 9900,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:22"
}