{
  "name": "Masoud Seddighin",
  "homepage": "https://teias.institute/~seddighin",
  "status": "success",
  "content": "Masoud Seddighin [email protected] Peronal Website >> Assistant Professor Bio Masoud Seddighin received his Ph.D. from Sharif University in 2019. He was a postdoc at Institute for Research in Fundamental Sciences (IPM). His Research Interests include Algorithms and Complexity, Algorithmic Game Theory, and Computational Social Science. Download CV Research Interests Algorithms Algorithmic Game Theory Computational Social Science Education Research Teaching Ph.D. from Sharif University in 2019 Publications: Masoud Seddighin, Saeed Seddighin, \"Improved Maximin Guarantees for Subadditive and Fractionally Subadditive Fair Allocation Problem. AAAI 2022\" Masoud Seddighin, Saeed Seddighin, \"3 + Îµ Approximation of Tree Edit Distance in Truly Subquadratic Time. ITCS 2022\" Amin Ghiasi, Masoud Seddighin, \"Approximate Competitive Equilibrium with Generic Budget. SAGT 2021\" Alireza Farhadi, MohammadTaghi Hajiaghayi, Mohammad Latifian, Masoud Seddighin, Hadi Yami, \"Almost Envy-freeness, Envy-rank, and Nash Social Welfare Matchings. AAAI 2021\" Mahdi Boroujeni, Masoud Seddighin, Saeed Seddighin, \"Improved Algorithms for Edit Distance and LCS: Beyond Worst Case. SODA 2020\" Mohammad Ghodsi, Mohammad Latifian, Masoud Seddighin, \"On the Distortion Value of Elections with Abstention. AAAI 2019. JAIR.\" Masoud Seddighin, Hamed Saleh, Mohammad Ghodsi \"Externalities and Fairness. WWW 2019. Social Choice and Welfare.\" MohammadTaghi Hajiaghayi, Masoud Seddighin, Saeed Seddighin, Xiaorui Sun, \"Approximating LCS in linear time: Beating the sqrt(n) Barrier. SODA 2019\" Mohammad Ghodsi, MohammadTaghi Hajiaghayi, Masoud Seddighin, Saeed Seddighin, Hadi Yami, \"Fair Allocation of Indivisible Goods: Improvements and Generalizations. EC 2018. Math of OR, AIJ.\" Mohammad Ghodsi, Mohammad Latifian, Arman Mohammadi, Sadra Moradian, Masoud Seddighin, \"Rent division among groups. COCOA 2018\" Mohammad Ghodsi, Hamid Homapour, Masoud Seddighin, \"Approximate minimum diameter. COCOON 2017\" Alireza Farhadi, Mohammad Ghodsi, MohammadTaghi Hajiaghayi, David Pennock, Sebastien Lahaie, Masoud Seddighin, Saeed Seddighin, Hadi Yami, \"Fair Allocation of Indivisible Goods to Asymmetric Agents. AAMAS 2017. JAIR.\" Reza Alijani, Majid Farhadi, Mohammad Ghodsi, Masoud Seddighin, Ahmad Shahab Tajik, \"Envy-free Mechanisms with Minimum Number of Cuts. AAAI 2017. Algorithmica.\"\" Ehsan Emamjome Zadeh, Mohammad Ghodsi, Hamid Homapour, Masoud Seddighin, \"Unit covering in color-spanning set model. WALCOM 2015\" Fall 2021 Data Structures and Algorithms Spring 2021 Algorithm Design Fall 2020 Data Structures and Algorithms Fall 2019 Data Structures and Algorithms Spring 2019 Algorithmic Game Theory Fall 2017 Algorithmic Game Theory Fall 2016 Fundamentals of Data structures and Algorithms Spring 2016 Fundamentals of Data structures and Algorithms Spring 2014 Fundamentals of Data structures and Algorithms",
  "content_length": 2883,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:24"
}