{
  "name": "Masoud Mansoury",
  "homepage": "https://masoudmansoury.github.io",
  "status": "success",
  "content": "Masoud Mansoury Masoud MansouryOffice 5.E.240Van Mourik Broekmanweg 62628 XE Delft, The Netherlandsm.mansoury@tudelft.nl Follow Masoud Mansoury is an Assistant Professor in Multimedia Computing Group (MMC) at Delft University of Technology (TU Delft), the Netherlands. Before joining TU Delft, he was a Postdoctoral researcher at Amsterdam Machine Learning Lab (AMLab) at University of Amsterdam where he worked on interactive and online learning-to-rank recommendation models like those based on contextual bandits. Also, in this position, he was a memeber of Elsevier Discovery Lab where he worked on various aspects of the recommendation systems at Elsevier.In 2021, Masoud obtained his PhD in Computer and Information Science at Eindhoven University of Technology under supervision of Bamshad Mobasher, Robin Burke, and Mykola Pechenizkiy. The topic of his PhD was on understanding and mitigating unfairness and algorithmic bias in recommender systems. In particular, he studied the negative impacts of unfair recommendation on different stakeholders in the system and proposed solutions to tackle them. He also completed his M.Sc. degree in Information Technology (IT) at Amirkabir University of Technology, Iran, where for his M.Sc. thesis he worked on the application of trust and reputation methods for improving the peroformance of recommender systems. Upon completion of his M.Sc. degree and prior to starting his PhD program, Masoud worked in industry for 5 years on various software engineering projects.Masoud’s broad research interests lie in the area of Trustworthy and Explainable Recommender Systems. More specifically, he conducts research on the following topics: 1) Algorithmic bias: tackling bias issue in recommendation models to improve the business aspects and accuracy of the recommendation systems and mitigating the unfairness issue that may raise due to algorithmic bias, 2) Explainability and Transparency: understanding the logic behind the recommendation process, explaining the factors causing/leading to the recommendation outputs, 3) Robustness: detecting the malicious behavior and patterns in recommendation process to avoid unwanted manipulation of this process.News7 August 2025: A workshop paper “Using LLMs to Capture Users’ Temporal Context for Recommendation” accepted at CARS@RecSys.4 August 2025: Two LBR papers “Opening the Black Box: Interpretable Remedies for Popularity Bias in Recommender Systems” and “Mitigating Popularity Bias in Counterfactual Explanations using Large Language Models” accepted at RecSys.11 July 2025: A full paper “RaMen: Multi-Strategy Multi-Modal Learning for Bundle Construction” accepted at ECAI.3 July 2025: A reproducibility paper “A Reproducibility Study of Product-side Fairness in Bundle Recommendation” accepted at RecSys.28 April 2025: A paper “Towards Explainable Temporal User Profiling with LLMs” accepted at Explainable User Models and Personalized Systems (ExUM) workshop at UMAP.23 April 2025: A paper “Towards Carbon Footprint-Aware Recommender Systems for Greener Item Recommendation” accepted at ACM Journal on Recommender Systems (TORS).18 December 2024: Accepted papers at our SURE@RecSys2024 are published at CEUR.16 July 2024: A full paper “Mitigating Exposure Bias in Online Learning to Rank Recommendation: A Novel Reward Model for Cascading Bandits” accepted at CIKM 2024.30 May 2024: I am invited to give a lecture on the topic of recommender system in European Summer School in Information Retrieval (ESSIR) at University of Amsterdam, Amsterdam, Netherlands.24 May 2024: I’ll be giving an invited talk in the doctoral consortium at the Universidad Nacional de Educación a Distancia (UNED), Madrid, Spain.10 May 2024: A LBR paper “Beyond Static Calibration: The Impact of User Preference Dynamics on Calibrated Recommendation” accepted at UMAP 2024.6 May 2024: Our workshop website is available at: SURE@RecSys2024.1 April 2024: Started an assistant professor position on trustworthy and explainable recommender systems at Delft University of Technology.25 March 2024: A full paper “Going Beyond Popularity and Positivity Bias: Correcting for Multifactorial Bias in Recommender Systems” accepted at SIGIR 2024.25 March 2024: Our workshop on “Strategic and Utility-aware REcommendations (SURE)” accepted at RecSys 2024.14 December 2023: A reproducibility paper “Measuring Item Fairness in Next Basket Recommendation: A Reproducibility Study” accepted at ECIR 2024.",
  "content_length": 4463,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:20"
}