{
  "name": "Masoud Makrehchi",
  "homepage": "https://engineering.ontariotechu.ca/people/ecse/masoud.makrehchi.php",
  "status": "success",
  "content": "Dr. Masoud Makrehchi | Faculty of Engineering and Applied Science About Us Mission and Vision Dean's Welcome Technology-Enriched Learning Environment (TELE) Health and safety Administrative Code Governance Alumni Profiles Natalie Prole (Maheu) Mohamd Imad Mert Temiz Mert Temiz Mert Temiz Mert Temiz Ignite Magazine Letters to a Young Engineer Future Students Explore Undergraduate Labs Women in Engineering Campus Services Undergraduate Admission information Tuition information Undergraduate Programs Engineering Co-Op Pre-Engineering Graduate Admission Information Tuition Information Financial Aid Graduate Programs Your Main Points of Contact Frequently Asked Questions Graduate Faculty Current Students First-Year zone First-Year Engineering Success Program Peer Mentorship Program GEARS First-Year FAQ Engineering Orientation Survival Guide Undergraduate Academic Advising Program Maps Electives List Frequently Asked Questions (FAQ) Registration Guidelines Specializations Minors Capstone Design 2025 Capstone Projects 2024 Capstone Projects 2023 Capstone Projects 2022 Capstone Projects 2021 Capstone Projects 2020 Capstone Projects 2019 Capstone Projects Clubs and Societies ASME Engineering Students' Society IEEE Student Branch Ontario Tech Racing Ri3D (Robot in 3 Days) Women in Engineering Sub-Society RoboMaster Ontario Tech Space and Rocketry NAYGN Canadian Nuclear Society Ontario Tech Branch Engineering Co-Op Program Details Job Search Assistance Registration Information Frequently Asked Questions Employer Information Reverse Career Fair Engineering Co-op Annual Report Experiential Learning Innovation and Design Studio Experiential Learning Workshop Series Student Competitions Women in Engineering About Us Women in Engineering Sub-Society Scholarships Women in Engineering Peer Mentoring Career Mentorship Events Volunteer Opportunities Future Students Campus Services Graduate Your Main Points of Contact Deadlines and Procedures MEng Project MASc Thesis Thesis Deadlines Thesis Procedures Important Graduate Resources Seminar Courses & Workshops Graduate Academic Calendar Important Dates Student Forms FEAS Graduate Student Forms Registration Guides Student Finances Frequently Asked Questions Campus Services Departments Automotive, and Mechatronics Engineering Electrical, Computer, and Software Engineering Energy and Nuclear Engineering Mechanical and Manufacturing Engineering Research The Research Rundown Podcast Research Labs Aerodynamic & Energy Research Group (AER) Aerodynamic and Climatic Adaptation Research (AeroClimar) Centre Automotive Centre of Excellence Borehole Thermal Energy Storage System Energy Research Centre Power Electronics and Drives Applications Laboratory (PEDAL) Weather Adaptation Lab Research Day Automotive Systems Communications and Signal Processing Electric Power Systems and Smart Electric Grid Internet of Things Manufacturing and Materials and Mechanics of Solids and Structures Noise, Vibration, and Harshness Nuclear and Energy Systems Robotics, Automation and Controls Software Systems Thermo-fluids and Heat Transfer Speaker Spotlight People Dean's Office Department of Automotive, and Mechatronics Engineering Dr. Greg Rohrauer Dr. Haoxiang Lang Dr. Jaho Seo Dr. Moustafa El-Gindy Dr. Nasim Moallemi Dr. Scott Nokleby Dr. Xianke Lin Dr. Yuping He Dr. M. Aydin Dr. Zeinab El-Sayegh Dr. Meaghan Charest-Finn Dr. Shabnam Pejhan Dr. Aaron Yurkewich Dr. Mitchell Rushton Department of Electrical, Computer and Software Engineering Dr. Akramul Azim Dr. Anwar Abdalbari Dr. Jing Ren Dr. Khalid Abdel Hafeez Dr. Khalid Elgazzar Dr. Masoud Makrehchi Dr. Mikael Eklund Dr. Min Dong Dr. Mohamed El-Darieby Dr. Mohamed Youssef Dr. Namdar Saniei Dr. Nasim Beigi-Mohammadi Dr. Qusay Mahmoud Dr. Ramiro Liscano Dr. Ruth Milman Dr. Sanaa Alwidian Dr. Shahram ShahbazPanahi Dr. Sheldon Williamson Dr. Tarlochan Sidhu, PEng, CEng Dr. Vijay K. Sood Dr. Walid Morsi Ibrahim Dr. Ying Wang Department of Energy and Nuclear Engineering Dr. Akira Tokuhiro Dr. Anthony Waker Dr. Brian Ikeda Dr. Daniel Hoornweg Dr. Edward Waller Dr. Eleodor Nichita Dr. Filippo Genco Dr. George Bereznai Dr. Glenn Harvel Dr. Hossam Gaber Dr. Igor Pioro Dr. Jennifer McKellar Dr. Kirk Atkinson Dr. Lixuan Lu Dr. Matthew Kaye Dr. Rachid Machrafi Department of Mechanical and Manufacturing Engineering Dr. Jana Abou-Ziki Dr. Martin Agelin-Chaab Dr. Eda Aydin Dr. Ahmad Barari Dr. Ibrahim Dincer Dr. Naglaa Elagamy Dr. Horia Hangan Dr. Ali Hosseini Dr. Dima Jawad Dr. Amirkianoosh Kiani Dr. Hossam Kishawy Dr. Tao Liu Dr. Brendan MacDonald Dr. Atef Mohany Dr. Remon Pop-Iliev Dr. Bale Reddy Dr. Ghaus Rizvi Dr. Marc Rosen Dr. Ebrahim Esmailzadeh Dr. Zia Saadatnia Samuel Yousefi Administrative Services Personnel Stephan Anthonipillai Janette Banga Zahraa Bassyouni Candace Chard Michelle Cholak Kelly Crocker Hunter Johnson David Kim Cherry Lam Shari Martin Nicole Mullins Alex Piliounis Nabil Saleh Sydney Smith Melanie Stryde Laura Thursby Kailey Tinline Sarah Wedge Teaching Faculty, Laboratory and Technical Services Hidayat Shahid Govind Rehal Peter Kahr Russell Papadimitriou Ali Ismail Masoud Farzam Qi Shi Leon Wu Sharman Perera Robert Ulrich Megha Verma Engineers in Residence Outreach Experiential Learning Skip to main content Home People Department of Electrical, Computer and Software Engineering Dr. Masoud Makrehchi Masoud Makrehchi BSc, MSc, PhD (Waterloo), PEng Associate Professor Department of Electrical, Computer and Software Engineering Faculty of Engineering and Applied Science Contact information 2000 Simcoe Street North Oshawa, Ontario L1G 0C5 Office: SIR 3385 905.721.8668 ext. 5387 905.721.3370 (fax) masoud.makrehchi@ontariotechu.ca Research topics Natural Language Processing Artificial Intelligence Machine Learning Text and Data Mining Social Computing Mining Social Networks and Complex Systems Network Science Moral AI Education PhD (Electrical and Computer Engineering), University of Waterloo, Canada, 2007; MSc (Computer Engineering), Shiraz University, Iran, 1994; BSc (Electrical Engineering), Iran University of Science and Technology, Iran, 1991. Research and expertise Work experience Honours and awards Industrial: Thomson Reuters, Senior Research Scientist, 2008 to 2012. Academic: Postdoctoral fellow, University of Waterloo, 2007 to 2008. NSERC Postgraduate Scholarship (PGS-B), 2003 to 2004; University of Waterloo President's Graduate Scholarship, 2003 to 2004; Ontario Graduate Scholarship, 2003; Ontario Graduate Scholarship in Science and Technology, 2006; University of Waterloo Alumni Scholarship, 2006; University of Waterloo Graduate Scholarship, 2005; University of Waterloo Faculty of Engineering Graduate Scholarship, 2003, 2004; International Conference on Social Computing, Behavioural-Cultural Modeling, and Prediction (SBP) Challenge Award, Apr. 2012. Publications and presentations Selected publications and presentations Journal publications M. Ahmadalinezhad, M. Makrehchi. “Edge-centric multi-view network representation for link mining in signed social networks”. Expert Systems with Applications, Vol. 170, pp. 1–11, 2021; M. Ahmadalinezhad, M. Makrehchi. “Basketball Lineup Performance Prediction Using Edge-Centric Multi-View Network Analysis”. Social Network Analysis and Mining, Vol. 10, No. 1, pp. 1–10, 2020; E. Gultepe, M. Kamkarhaghighi, M. Makrehchi, “Document classification using convolutional neural networks with small window sizes and latent semantic analysis”, Web Intelligence Journal, Vol. 18, No. 3, pp. 239–248, 2020; S. Aghababaei, M. Makrehchi. “Interpolative Self-Training Approach for Link Prediction”, Intelligent Data Analysis, vol. 23, no. 6, pp. 1379–1395, 2019; E. Gultepe, M. Makrehchi. “Improving clustering performance using independent component analysis and unsupervised feature learning”, Human-centric Computing and Information Sciences, Vol. 8, No. 25, pp. 1–19, 2018; A. M. Karimi-Majd, M. Fathian, M. Makrehchi, “Consensus-based methodology for detection communities in multilayered networks”, Physica A, Vol. 494, pp. 547–558, 2018; and S. Aghababaei, M. Makrehchi. “Mining Twitter Data for Crime Trend Prediction”, Intelligent Data Analysis, Vol. 22, No. 1, pp. 117–141, 2018; E. Gultepe, T. Conturo, M. Makrehchi, “Predicting and grouping digitized paintings by style using unsupervised feature learning”, Journal of Cultural Heritage, Vol. 31, pp. 13–23, 2017; M. Kamkarhaghighi, M. Makrehchi. “Content Tree Word Embedding for Document Representation”, Expert Systems With Applications, Vol. 90, pp. 241–249, 2017; S. Aghababaei, M. Makrehchi. “Activity-based Twitter Sampling for Content-based and User-centric Prediction Models”, Human-centric Computing and Information Sciences, Vol. 7, No. 3, pp. 1–20, 2017; M. Makrehchi, M. S. Kamel. “Extracting Domain-Specific Stopwords for Text Classifiers”, Intelligent Data Analysis Journal, Vol. 21, No. 1, pp. 39–62, 2017; M. Makrehchi. “Predicting Political Conflicts from Polarized Social Media ”, Web Intelligence Journal. Vol. 14, no. 2, pp. 85–97, 2016; M. Makrehchi. “Evaluating Feature Ranking Methods in Text Classifiers”, Intelligent Data Analysis Journal. Vol. 19, no. 5, pp. 1151-1170, 2015. Book chapters A. Towhidi, M. Kamkarhaghighi, M. Makrehchi, ”Acquisitive Information Extraction Framework for Legal Domain” In ”The LegalTech Book: The Legal Technology Handbook for Investors, Entrepreneurs and FinTech Visionaries”: June 2020; M. Kamkarhaghighi, E. Gultepe, M. Makrehchi, ”Deep Learning for Document Representation” In ”Handbook of Deep Learning Applications”: Springer, 2018, pp. 101– 110; M. Makrehchi, M. S. Kamel, “Aggressive Feature Selection by  Feature Ranking,\" in Computational Methods of Feature Selection,” Huan Liu and Hiroshi Motoda, Eds.; Chapman and Hall/CRC Press, pp. 313--333, 2007. Conferences A. Maraj, M. Martin, M. Makrehchi. “A More Effective Sentence-Wise Text Segmentation Approach using BERT”. Accepted in ICDAR-2021; J. Gillett, S. Rahnamayan, M. Makrehchi, A. Asilia",
  "content_length": 12323,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:21"
}