{
  "name": "Masoud Daneshtalab",
  "homepage": "http://www.idt.mdh.se/~md",
  "status": "success",
  "content": "Masoud Daneshtalab / Department of Embedded Systems, MDH Masoud Daneshtalab, PhD, Docent Full Professor News Position Education Research Areas and Interest Teaching Experiences Project Evaluation Project Funding Professional Experiences Publications Students Awards Contact News To follow the news and job vacancies, please check the group webpage: HERO Research Group. Back to top Positions 2020 - present: Full-Professor, Intelligent Future Technology, University of Mälardalen, Sweden. 2016 - 2020: Associate Professor, Intelligent Future Technology, University of Mälardalen, Sweden. 2014 - 2016: EU Marie Curie Fellow, Department of Electronic Systems, \tKTH Royal Institute of Techonology, Sweden. 2011 - 2014: Assistant Professor, Embedded Computer and Electronic Systems, Department of IT, \tUniversity of Turku, Finland. 2008 - 2011: Researcher , Embedded Computer and Electronic Systems, Department of IT, \tUniversity of Turku, Finland. 2006 - 2008: Researcher , Low-Power High-Performance Nanosystems Lab., \tSchool of Electrical and Computer Engineering, Univ. of Tehran, Iran. 2006 - 2008: Lecturer, Department of Electrical and Computer Engineering\tTechnical College of Shariaty, Tehran, Iran. Back to top Education 2014 - 2017: Docent, Embedded Systems, University of Mälardalen, Sweden 2008 - 2011: PhD., ICT, Dept. of IT, University of Turku, Finland 2009 - 2010: MBA, Faculty of\tEconomy, University of Turku, Finland 2004 - 2006: Master., Computer Architecture, School of ECE, University of Tehran, Tehran, Iran. 1998 - 2002: BS., Computer Hardware Engineering, Shahid Bahonar University, Kerman, Iran. Back to top Research Areas/Interest Brain-inspired/Neuromorphic Computing Architectures (SNN, ANN, accelerators, etc.) Many/Multi-core Systems-on-Chip (Mapping & scheduling, memory and utilization wall, etc.) Bio-Inspired Computing & Machine Learning (Ant colony, genetic, Q-learning, etc.) Reliability in Embedded Systems (Fault tolerance, testing, aging, etc.) Reconfigurable Architectures (FPGA, DRRA, CGRA, etc.) Interconnection Networks (time-aware, multicasting, adaptive routing, etc) Dynamic Power Management (Dark silicon, low power design etc.) Parallel Computing/Programming (openMP, MPI, openCL, cuda, etc.) Back to top Project Funding GreenDL (Green Deep Learning for Edge Devices, 2022-2026, Swedish Research Council (VR), 6M-SEK), Rule: Principal Investigator. SafeAI (Dependable AI in Safe Autonomous Systems, 2022-2026, Swedish Foundation for Strategic Research (SSF), 2.5M-SEK), Rule: Principal Investigator, Industrial partner: SAAB AutoDeep (Automatic Design of Safe, High-Performance and Compact Deep Learning Models for Autonomous Vehicles, 2020-2023, VINNOVA, 1.2 M-SEK), Rule: Principal Investigator, Industrial partner: Volvo and ZenseAct. SafeDeep (Dependable Deep Learning for Safety-Critical Airborne Embedded Systems, 2019-2022, VINNOVA, 600K-SEK), Rule: Co-Principal Investigator, Industrial partner: SAAB. DeepLeg (Energy-Efficient Hardware Accelerator for Embedded Deep Learning, 2019-2020, STINT, 150K-SEK), Rule: Principal Investigator. DESTINE (Developing Predictable Vehicle Software Utilizing Time Sensitive Networking, 2019-2022, VINNOVA, 6M-SEK), Rule: Co- Principal Investigator, Industrial partners: Volvo-CE and Arcticus. HERO (Heterogeneous systems: software-hardware integration, 2018-2022, Knowledge Foundation (KKS), 25M-SEK/2.5M-Euro), Rule: Co-Principal Investigator, Industrial partners: ENEA, Volvo-CE, Arcticus, Alten, and UniBap.. DeepMaker (Deep Learning Accelerator on Commercial Programmable Devices, 2018-2021, Knowledge Foundation (KKS), 6M-SEK/600K-Euro), Rule: Principal Investigator, Industrial partners: SAAB, UniBap, and Kiwok. CUBRIC (CUstom designed BRain-Inspired integrated Circuit, 2014-2016, EU, KTH, UTU, and VINNOVA (Swedish Governmental Agency for Innovation Systems), 3.9M-SEK/400K-Euro), Rule: Principal Investigator. uBrain (Custom Design Brain-Inspired Computing Platform, 2015-2016, funded by Kaute Foundation in Finland, 18K-Euro), Rule: Principal Investigator. ERoT (Efficient, Robust, and Trustable Embedded Systems, 2014-2017, EU, VINNOVA, KTH and UTU, 4.5M-SEK/500K-Euro), Rule: co-investigator. CRS (Towards Reliable Many-Core Embedded Systems from Unreliable Components, 2014-2017, funded by Academy of Finland, 230K-Euro), Rules: co-investigator. MANAGE (Data Management of 3D Systems for the Dark Silicon Age, 2013-2017, a consortium between UTU and VTT, funded by Academy of Finland, 1.5M-Euro), Rules: co-Investigator. AGENT (Agent-Based Management of CMOS Hyper Cores, 2011-2013, a consortium between UTU, VTT, and Aalto University, funded by Academy of Finland, 1M-Euro), Rules: co-Investigator. AMEBA (Agent-based Management of Embedded Data Reserves, 2012-2014, a consortium between UTU and ÅBO Akademi, funded by Academy of Finland, 600K-Euro), Rule: co-Investigator. Back to top Teaching Experiences/Courses Design of Autonomous Systems (Mälardalen University, Sweden) (2019-present) Autonomous Vehicle (Mälardalen University, Sweden) (2017- present) Programming of Reliable Embedded Systems (Mälardalen University, Sweden) (2016--present) Embedded Systems (KTH Royal Institute of Technology, Stockholm, Sweden) (2015) Digital Logic Lab. (KTH Royal Institute of Technology, Stockholm, Sweden)(2014-2015) FPGA Prototyping (University of Turku, Turku, Finland) (2013-14) Data Communication (University of Turku, Turku, Finland) (2013-14) Seminar on Embedded Computing (University of Turku, Turku, Finland) (2012-14) MultiProcessor Architectures (University of Turku, Turku, Finland) (2013-14) Digital Communication Systems (University of Turku, Turku, Finland) (2013-14) HDL-based Design (University of Turku, Turku, Finland) (2011-13) Computer Architecture (Technical College of Shariaty, Tehran, Iran) (2005-2008) Digital Circuit Design (Technical College of Shariaty, Tehran, Iran) (2005-2008) Advanced Programming with C++ (Technical College of Shariaty, Tehran, Iran) (2005-2008) Computer Architecture (Azad University of Parand, Parand, Iran) (2005-2008) Advanced Programming (Azad University of Parand, Parand, Iran) (2005-2008) Back to top Professional Experiences Technical Activities: Supported full chip layout and verification from synthesis to tape-out using Cadence tools (Encounter and Virtuoso) and Synopsis tools (Design Compiler & Prim power). Tape-out experience: Agent-based Network-on-Chip including DVFS and agent monitoring is taped-out in 2011. Academic Activities: Editor Activities for Journals - Associate Editor of Elsevier Journal of Microprocessors and Microsystems (MICPRO) - Since 2015 - Associate Editor of Elsevier Journal of Computers & Electrical Engineering (CAEE) - Since 2014 - Associate Editor of World Research Journal of Computer Architecture (JCA) - Since 2012 - Editorial Board of the International Journal of Embedded and Real-Time Communication Systems - (IJERTCS) - Since 2013 - Editorial Board of the International Journal of Adaptive, Resilient and Autonomic Systems (IJARAS) - Since 2012 - Editorial Boardof the International Journal of Distributed Systems and Technologies (IJDST) - Since 2012 - Guest Editor, Elsevier Journal of Integration, VLSI, On-Chip Parallel and Network-Based Systems, (2014) CfP - Guest Editor, Elsevier Journal of Microprocessors and Microsystems, Manycore Embedded Systems, (2014) CfP - Guest Editor, Journal of IET (Computers and Digital Techniques), Emerging On-Chip Networks and Architectures, (2013) CfP - Guest Editor, Springer Journal of Computing, Special Issue on On-Chip Parallel and Network Systems, (2013) CfP - Guest Editor, ACM Transactions on Embedded Computing Systems, Special Issue on Design Challenges for Manycore Processors, (2013) CfP - Guest Editor, Elsevier Journal of System Architecture, Special Issue on Network-based Manycore Embedded Systems, (2012) CfP Conference and symposium Organizer - Track Co-Chair, Network-on-Chip  DATE, in IEEE Design, Automation & Test in Europe Conference, 2019. - Program Chair, 25th IEEE Inter. Conf. on Parallel, Distributed, and Network-Based Processing  PDP, Russia, 2017. - Program Chair, 11th IEEE Symp. on Reconfigurable Communication-centric SoC  ReCoSoC, Tallinn, Estonia, 2016. - Program Chair, 24th IEEE Inter. Conf. on Parallel, Distributed, and Network-Based Processing  PDP, Greece, 2016. - General Chair, 23rd IEEE Inter. Conf. on Parallel, Distributed, and Network-Based Processing  PDP, Finland, 2015. - Track Co-Chair, Network on Chip (NoC), Interconnects, and 3D-IC SOCC, in IEEE System-on-Chip Conference, 2014. Workshop/Special-Session Organizer - General Chair, 9th ACM International Workshop on Network on Chip Architectures NoCArc, in conj. with Micro, 2016. - General Chair, 4th ACM International Workshop on Manycore Embedded system  MES, in conj. with ISCA, 2016. - General Chair, 8th ACM International Workshop on Network on Chip Architectures NoCArc, in conj. with Micro, 2015. - General Chair, 3rd ACM International Workshop on Manycore Embedded system  MES, in conj. with ISCA, 2015. - General Chair, IEEE International Workshop on High Performance Interconnection Networks  HPIN, in conj. with HPCS, Italy, 2014. - General Chair, 7th ACM International Workshop on Network on Chip Architectures NoCArc, in conj. with Micro, 2014. - General Chair, IEEE Special Session on On-Chip Parallel and Network-Based Systems  OCPNBS, in conj. with PDP, 2015. - General Chair, IEEE International Workshop on Parallel Computations for Neural Networks  PCNN, in conj. with HPCS, Italy, 2014. - General Chair, IEEE International Workshop on High Performance Interconnection Networks  HPIN, in conj. with HPCS, Italy, 2014. - General Chair, IEEE International Workshop on Dynamic Reconfigurable Network-on-Chip  DRNoC, in conj. with HPCS, Italy, 2014. - General Chair, 2nd ACM International Workshop on Manycore Embedded system  MES, in conj. with ISCA, 2014. - General Chair, IEEE Speci",
  "content_length": 18464,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:20"
}