{
  "name": "Massimiliano de Leoni",
  "homepage": "https://www.math.unipd.it/~deleoni",
  "status": "success",
  "content": "Home Prof. Ing. Massimiliano de Leoni Office +390498271432 email deleoni [at] math.unipd.it Home \"The Process Science Research Group at UniPd Publications Teaching Research Interests Associate Professor of Computer Science Affiliation Department of Mathematics University of Padova Via Trieste, 63 35121 Padua (Italy) Tel.: +390498271432 \"... to talk every day about virtue and the other things about which you hear me talking and examining myself and others is the greatest good to man, and that the unexamined life is not worth living\" (Plato. Plato in Twelve Volumes, Vol. 1) Biographical sketch Italian Citizen, born in Naples on March, 18th, 1980. Member of the IEEE Task Force on Process Mining. Italian Habilitation to the rank of Full Professor in Computer Science and in Computer Engineering (Abilitazione Scientifica Nazionale 01/B1 e 09/H1 - 1° Fascia) July 2024 Director of the 12th European Big Data Management & Analytics Summer School (eBISS 2024) Autumn 2022 Guest Editor of the Special Issue on \"Artificial Intelligence for Process Mining\" for Journal Engineering Applications of Artificial Intelligence Oct. 2022 Demonstration Chair of the 26th International Conference on Enterprise Design, Operations and Computing (EDOC 2022), Bolzano, Italy Sept. 2021 Industry Chair of the 19th International Conference on Business Process Management (BPM 2021), Rome, Italy. From Aug. 2021 Associate Professor of Computer Science at University of Padua Oct. 2020 General Chair of the Second International Conference on Process Mining (ICPM 2020), Padua, Italy. Jan. 2019 - Jul. 2021 Assistant Professor (in Italian \"Ricercatore a Tempo Determinato di tipo B\") of Computer Science at University of Padua. Sep. 2018 Chair of the Demonstration Track of 16th International Conference on Business Process Management (BPM 2018), Sydney, Australia. Oct. 2014 - Dec. 2018 Assistant Professor (in Dutch \"Universitair Docent\") of Computer Science at Eindhoven - University of Technology Jun. 2013 - Sept. 2014 Postdoctoral Researcher in the AIS Group of the Department of Mathematics and Computer Science at Eindhoven - University of Technology and in the Department of Mathematics at University of Padua Jun. 2010 - May 2013 Postdoctoral Researcher in the AIS Group of the Department of Mathematics and Computer Science at Eindhoven - University of Technology Oct. 2009 - May 2010 Postdoctoral Researcher at the Department of Computer Engineering at SAPIENZA - University of Roma Sept. 2008 Co-chair of the Workshop on Process Management for Highly Dynamic and Pervasive Scenarios at BPM 2008, Milan, Italy 2005 - 2009 Ph.D Degree in Computer Engineering [Corso di Dottorato di Ricerca in Ingegneria Informatica - Roma], SAPIENZA University of Rome, earned on September 30th, 2009 2003 - 2005 Master Degree in Computer Engineering [Corso di Laurea Specialistica in Ingegneria Informatica], SAPIENZA University of Rome, earned on July 18th, 2005 1999-2002 Bachelor Degree in Computer Engineering [Corso di Laurea Triennale in Ingegneria Informatica], SAPIENZA University of Rome, earned on December 18th, 2002 Last Update: 26/01/2024 Click here for information about cookies",
  "content_length": 3171,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:23"
}