{
  "name": "Massimo Donelli",
  "homepage": "https://webapps.unitn.it/du/en/Persona/PER0002394/Curriculum",
  "status": "success",
  "content": "Massimo Donelli | CV | University of Trento Massimo Donelli Associate professor Department of Civil, Environmental and Mechanical Engineering Via Mesiano, 77 - 38123 Trento tel. 0461 282063 massimo.donelli[at]unitn [dot] it Expertise: Biomedical imaging Coding theory Cryptography Electromagnetic inverse scattering Evolutionary algorithms Information & Communication Technology (ICT) Optimization Pattern recognition Radars Radio communication Satellite communication Software-defined radio Unmanned aerial vehicle Wireless networks Wireless power transmission Education First Professional Degree High School Degree in Industrial Electronic from the Industrial Technical Institute “Italo Calvino”, Genova Sestri Ponente, Italy 1990/1991 (Grade 60/60). Master Master Degree in Electronic Engineering from the University of Genoa, Italy Thesis discussed on December 22th, 1998 (Grade 103/110), on \"Spice Electromagnetic Models for the Interactions between External Electromagnetic Field and Multi-conductors Transmission Lines\" (“Modelli Elettromagnetici per Simulazione Spice dell’Interazione tra Campi Elettromagnetici Esterni e Linee Multiconduttore”) Supervisor: Prof. Matteo Pastorino. National Licensing Exam National Licensing Exam for Electronic Engineers obtained on July 1999 (Grade 247/260). Doctorate/Ph.D.    Ph.D. in Science and Space Engineering from the Doctoral School of the University of Genoa (Italy). Thesis discussed on June 2003, on ”Methods and Measurements System for Electromagnetic Compatibility in Spatial Application“. Post Doctorate Post Doctorate in Telecommunication from the University of Trento (Italy) March 2003 (two years) on “Propagation models for WLAN communications”, supervisors Prof. R. Battiti and Prof. A. Massa. Academic Position Assistant Professor of electromagnetic field at the Department of Information Engineering and Computer Science of the University of Trento March 2005. Present Occupation From October 2014, Massimo Donelli is an Associate Professor of electromagnetic field at the Department of Information Engineering and Computer Science of the University of Trento. Academic career and teaching activities 3. Teaching Activity Massimo Donelli has been a Teaching Assistant since the academic year 2000-2001 of master degree courses in Electronic Engineering offered by the University of Genoa. More in detail: Academic Year  2000-2001 Electromagnetic Fields (Campi Elettromagnetici) - Teaching Assistant - Master Degree in Electronic Engineering, University of Genoa, Italy. Electromagnetic Fields 1 (Campi Elettromagnetici 1) - Teaching Assistant - Bechelor Degree in Electronic Engineering, University of Genoa, Italy. Remote Sensing and Electromagnetic Diagnostic (Telerilevamento e Diagnostica Elettromagnetica) - Teaching Assistant - Master Degree in Electronic Engineering, University of Genoa, Italy. Academic Year  2001-2002 Electromagnetic Fields  1 (Campi Elettromagnetici 1) - Teaching Assistant - Master Degree in Electronic Engineering, University of Genoa, Italy. Remote Sensing and Electromagnetic Diagnostic (Telerilevamento e Diagnostica Elettromagnetica) - Teaching Assistant - Master Degree in Electronic Engineering, University of Genoa, Italy. Antennas (Antenne) - Teaching Assistant - Master Degree in Electronic Engineering, University of Genoa, Italy. Then Massimo Donelli has been a Teaching Assistant since the academic year 2001-2002 of the bachelor degree and master degree courses in Telecommunication Engineering and Information and Organization Engineering offered by the University of Trento. More in detail: Academic Year  2001-2002 Electromagnetic Fields  2 (Campi Elettromagnetici 2) - Teaching Assistant - Master Degree in Telecommunication, University of Trento, Italy. Academic Year  2002-2003 Antennas and Mobile Communications (Antenne e comunicazioni mobili) - Teaching Assistant - Master Degree in Telecommunication Engineering, University of Trento Electromagnetic Fields  2 (Campi Elettromagnetici 2) - Teaching Assistant - Master Degree in Telecommunication, University of Trento, Italy. Mobile Communications 2 (Comunicazioni mobili 2) - Teaching Assistant - Master Degree in Telecommunication Engineering, University of Trento, Italy. Advanced Techniques for Industrial Diagnostic (Tecniche Avanzate di Diagnostica Industriale) - Teaching Assistant - Master Degree in Telecommunication Engineering, University of Trento, Italy. Laboratory of Advanced Techniques for Industrial Diagnostic (Laboratorio di Tecniche Avanzate di Diagnostica Industriale) - Teaching Assistant - Master Degree in Telecommunication Engineering, University of Trento, Italy. Academic Year  2003-2004 Introduction to Electromagnetic Propagation (Introduzione alla Propagazione Elettromagnetica) - Teaching Assistant - Master Degree in Information and Organization Engineering, University of Trento, Italy. Advanced Techniques for Industrial Diagnostic (Tecniche Avanzate di Diagnostica Industriale) - Teaching Assistant - Master Degree in Telecommunication Engineering, University of Trento, Italy. Laboratory of Advanced Techniques for Industrial and Biomedical Diagnostic (Laboratorio di Tecniche Avanzate di Diagnostica Biomedicale ed Industriale) - Teaching Assistant - Master Degree in Telecommunication Engineering, University of Trento, Italy. From March 2005 as Assistan Professor of Electromagnetic Fields he has been teacher of the following bechelor degree and master degree courses: Academic Year  2005-2006 Introduction to Electromagnetic Propagation (Introduzione alla Propagazione Elettromagnetica) - Teacher - Master Degree in Information and Organization Engineering, University of Trento, Italy (6 CFU). Electromagnetic Propagation (Propagazione Elettromagnetica) - Teacher -  Bechelor Degree in Telecommunication Engineering, University of Trento, Italy (6 CFU). Laboratory of Techniques for Industrial and Biomedical Diagnostic (Laboratorio di Tecniche di Diagnostica Biomedicale ed Industriale) - Teacher - Master Degree in Telecommunication Engineering, University of Trento, Italy, (3 CFU). Academic Year  2006-2007 Electromagnetic Propagation (Propagazione Elettromagnetica) - Teacher -  Bechelor Degree in Telecommunication Engineering, University of Trento, Italy (6 CFU). Systems and Devices for Satellite Communications (Sistemi e Dispositivi per Comunicazioni Satellitari) - Teacher -  Master Degree in Telecommunication Engineering, University of Trento, Italy (6 CFU). Laboratory of Techniques for Industrial and Biomedical Diagnostic (Laboratorio di Tecniche di Diagnostica Biomedicale ed Industriale) - Teacher - Master Degree in Telecommunication Engineering, University of Trento, Italy, (3 CFU). Laboratory of Techniques for wireless communications (Laboratorio di Tecniche per comunicazioni wireleless) - Teacher - Bechelor Degree in Telecommunication Engineering, University of Trento, Italy, (3 CFU). Academic Year 2007-2008 Systems and Devices for Satellite Communications (Sistemi e Dispositivi per Comunicazioni Satellitari) - Teacher -  Master Degree in Telecommunication Engineering, University of Trento, Italy (6 CFU). Electromagnetic Propagation (Propagazione Elettromagnetica) - Teacher -  Bechelor Degree in Telecommunication Engineering, University of Trento, Italy (6 CFU). Telecommunication radio systems design (Progettazione Sistemi Radiofrequenza per le Telecomunicazioni) - Teacher -  Master Degree in Telecommunication Engineering, University of Trento, Italy (6 CFU). Safely use of electromagnetic power (Uso in Sicurezza dell’Energia Elettromagnetica)  - Teacher -  Master in Electronic Defense,  Telecommunication School of Italian Army IIFF Chiavari. Academic Year  2008-2009 Systems and Devices for Satellite Communications (Sistemi e Dispositivi per Comunicazioni Satellitari) - Teacher -  Master Degree in Telecommunication Engineering, University of Trento, Italy (6 CFU). Laboratory of Techniques for Industrial and Biomedical Diagnostic (Laboratorio di Tecniche di Diagnostica Biomedicale ed Industriale) - Teacher - Master Degree in Telecommunication Engineering, University of Trento, Italy, (3 CFU). Advanced Techniques for Industrial Diagnostic (Tecniche Avanzate di Diagnostica Industriale) - Teacher - Master Degree in Telecommunication Engineering, University of Trento, Italy, (6 CFU). Academic Year  2009-2010 Satellite Communications Systems and Devices - Teacher - Master Degree in Telecommunication Engineering, University of Trento, Italy, (6 CFU). Wired Communications Systems and Devices”  - Teacher - Master Degree in Telecommunication Engineering, University of Trento, Italy, (9 CFU). Optimization Techniques for TLC - Teacher - Master Degree in Telecommunication Engineering, University of Trento, Italy, (3 CFU). Optimization Techniques (Algoritmi e tecniche di ottimizzazione) - Teacher - Master Degree in Information and Organization Engineering, University of Trento, Italy, (9 CFU). Electromagnetic Fields (Campi Elettromagnetici) - Teacher - Master degree in Prevention Techniques for the job (Tecniche  della prevenzione nell’ambiente e nei luochi del lavoro)  University of Verona, Italy – Faculty of Medicines and Surgery, and University of Trento, Italy (2 CFU). Academic Year  2010-2011 Wired Communications Systems and Devices  - Teacher - Master Degree in Information and Organization Engineering, University of Trento, Italy, (9 CFU). Optimization Techniques (Algoritmi e tecniche di ottimizzazione) - Teacher - Master Degree in Information and Organization Engineering, University of Trento, Italy, (9 CFU). Academic Year  2011-2012 Wired Communications Systems and Devices - Teacher - Master Degree in Telecommunication Engineering, University of Trento, Italy, (9 CFU). Optimization Techniques (Algoritmi e tecniche di ottimizzazione) - Teacher - Master Degree in Information and Organization Engineering, University of Trento, Italy, (9 CFU). Electromagnetic Propagation (Propagazione Elettromagnetica) - Teacher -",
  "content_length": 42129,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:26"
}