{
  "name": "Matej Hoffmann",
  "homepage": "https://sites.google.com/site/matejhof",
  "status": "success",
  "content": "Matej Hoffmann - Research, Publications, ContactSearch this siteEmbedded FilesSkip to main contentSkip to navigationMatej Hoffmann, Ph.D. Associate Professor at Department of Cybernetics, Faculty of Electrical Engineering, CTU Prague. Coordinator of Humanoid and cognitive robotics team.    [2pg CV from 2024]Matej currently serves as Associate Professor at the CTU in Prague, coordinating the Humanoid and Cognitive Robotics group. With multiple humanoid robot platforms, including the iCub baby robot, he established Prague as an important center or research in cognitive developmental robotics worldwide. He employs the so-called synthetic methodology, or \"understanding by building\", with two main goals. The first goal is to understand cognition and its development. In particular, Matej is interested in the \"body in the brain\": how babies learn to represent their bodies and the space around it (peripersonal space) and what are the mechanisms in the brain. Matej's group builds embodied computational models on humanoid robots to uncover how these representations operate.  (see Modeling development for more details)The second goal are robots that safely and naturally interact with humans. Matej's group develops robots that exploit multimodal information (mostly vision and touch) to share space with humans. Research covers both physical and social human-robot interaction.  (see Co-bots and physical HRI) Matej and his group specialize in the sense of touch for robots. While for humans, touch is the first sense to develop and most of the time, we are barely aware of it, robots were lacking this sense until recently. Matej's group studies how robots can exploit large area sensitive skin array on their bodies. (see Artificial touch and self-calibration) Matej's team is also researching  Active perception for robot manipulation, started in the context of the European project IPALM.  Matej received his MSc degree in Computer Science, Artificial Intelligence from Faculty of Mathematics and Physics, Charles University in Prague, Czech Republic, in 2006. Between 2006 and 2013 he completed the PhD degree and then served as Senior Research Associate at the Artificial Intelligence Laboratory, University of Zurich, Switzerland (Prof. Rolf Pfeifer). In 2013 he joined the iCub Facility of the Italian Institute of Technology (Prof. Giorgio Metta), supported by a Marie Curie Intra-European Fellowship (iCub Body Schema, 2014-2016). In 2017, he joined the Department of Cybernetics, Faculty of Electrical Engineering, Czech Technical University in Prague where he is currently serving as Associate Professor and leading a group focused on cognitive, neuro-, collaborative, and humanoid robotics. See also the News page.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2808,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:27"
}