{
  "name": "Matei A. Zaharia",
  "homepage": "https://people.eecs.berkeley.edu/~matei",
  "status": "success",
  "content": "Matei Zaharia I’m an associate professor at UC Berkeley (previously Stanford), where I work on computer systems and AI in the Sky Lab. I’m also co-founder and CTO of Databricks. Interests: I’m interested in computer systems for large-scale workloads such as AI, data analytics and cloud computing. In 2016, I co-started the Stanford DAWN lab to work on infrastructure for usable machine learning. My recent projects include programming models for LLM applications, efficient runtimes for ML and analytics, quality assurance tools and AI-based data analytics systems. I am also interested in data privacy, and have worked on systems that can provide scalable privacy for communication, Internet queries and SaaS applications. Open Source: Most of my research work is open source. During my PhD, I started the Apache Spark project, which is now one of the most widely used frameworks for distributed data processing, and co-started other datacenter software such as Apache Mesos and Spark Streaming. At Stanford, we developed DAWNBench, a machine learning performance competition that drew submissions from the top industry groups and influenced the industry-standard MLPerf, and we are developing a wide range of open source software including Weld, NoScope, FlexFlow, ColBERT and DSPy. I was also involved in Databricks’ work to release open source LLMs like DBRX and Dolly. Some of my group’s past work has been featured in Wired (1/2/3), Fortune, TechCrunch, The Wall Street Journal, The Register, Ars Technica, Motherboard, ZDNet, The Economist, and Forbes. Teaching CS 294-162: AI Systems, Fall 2024. CS 294-162: AI Systems LLM Edition, Fall 2023. CS 194/294-196: Responsible GenAI and Decentralized Intelligence, Fall 2023. PhD Students and Postdocs Dev Bali (with Scott Shenker) Jared Quincy Davis (with Jure Leskovec) Jiwon Park Karim Elmaaroufi (with Sanjit Seshia) Lakshya Agarwal (with Dan Klein) Liana Patel (with Carlos Guestrin) Melissa Pan Negar Arabzadeh Parth Asawa Shangyin Tan (with Koushik Sen) Tyler Griggs (with Ion Stoica) Wenjie Ma (with Sewon Min) Yichuan Wang (with Joey Gonzalez) Past PhD Students and Postdocs Cody Coleman (with Peter Bailis) Daniel Kang (with Peter Bailis) Deepak Narayanan Deepti Raghavan (with Phil Levis) Fiodar Kazhamiaka (with Peter Bailis) Firas Abuzaid (with Peter Bailis) Gina Yuan (with David Mazieres) James Thomas (with Pat Hanrahan) Keshav Santhanam Lingjiao Chen (with James Zou) Omar Khattab (with Chris Potts) Peter Kraft (with Peter Bailis) Pratiksha Thaker Shoumik Palkar Trevor Gale Zhihao Jia (with Alex Aiken) Publications Recent Preprints 2025 World Model on Million-Length Video And Language With Blockwise RingAttention. H. Liu, W. Yan, M. Zaharia, and P. Abbeel. ICLR 2025. (preprint) ElasticTok: Adaptive Tokenization for Image and Video. W. Yan, V. Mnih, A. Faust, M. Zaharia, P. Abbeel, and H. Liu. ICLR 2025. (preprint) MoE-Lightning: High-Throughput MoE Inference on Memory-constrained GPUs. S. Cao, S. Liu, T. Griggs, P. Schafhalter, X. Liu, Y. Sheng, J.E. Gonzalez, M. Zaharia, and I. Stoica. ASPLOS 2025. (preprint) ColBERT-Serve: Efficient Multi-stage Memory-Mapped Scoring. K. Huang, O. Khattab, A. Potamias, S. Angelidis, and M. Zaharia. ECIR 2025. (preprint) Blink Twice - Automatic Workload Pinning and Regression Detection for Versionless Apache Spark using Retries. J. Breese, V. Prabhakaran, M. Grund, S. Leone, A. Shukla, M. Armbrust, R. Xin, M. Zaharia, L. Kats, S. Chiu, T. Romanova, P. Nord, M. Webster, C. Munson, B. Pang, and D. Ma. SIGMOD 2025. Unity Catalog: Open and Universal Governance for the Lakehouse and Beyond. R. Chandra, H. Chen, R. Matharu, S. Cai, J. Chen, P. Dutta, B. Ghita, T. Greenstein, G. Holla, P. Huang, Y. Huo, A. Ionescu, A. Ispas, T. Januschowski, V. Karajgaonkar, S. Leone, D. Lewis, A. Li, N. Li, C. Lian, S. Link, Q. Lu, Y. Ma, C. Pettitt, V. Prabhakaran, B. Raducanu, K. Rong, P. Roome, S. Shetty, S. Smith, X. Sun, Y. Tang, W. Wen, L. Xia, J. Zeng, B. Zhang, R. Xin, and M. Zaharia. SIGMOD 2025. Databricks Lakeguard: Supporting Fine-grained Access Control and Multi-user Capabilities for Apache Spark Workloads. M. Grund, S. Leone, H. van Hövell, S. Wagner-Boysen, S. Hillig, H. Kwon, D. Lewis, J. Mund, P.-F. Poli, L. Montrieux, O. Crelier, X. Li, R. Xin, M. Zaharia, M. Petropoulos, and T. Papathanasiou. SIGMOD 2025. DBOS: Three Years Later. Q. Li, P. Kraft, C. Kozyrakis, M. Zaharia, and M. Stonebraker. VLDB Journal 2025. Identification of Cardiac Wall Motion Abnormalities in Diverse Populations by Deep Learning of the Electrocardiogram. A.J. Rogers, F. Abuzaid, A. Alhusseini, L. Deng, A. Haimovich, P. Clopton, D. Krummen, P. Bailis, M. Zaharia, and S.M. Narayan. npj Digital Medicine 2025. 2024 Are More LLM Calls All You Need? Towards the Scaling Properties of Compound AI Systems. L. Chen, J.Q. Davis, B. Hanin, P. Bailis, I. Stoica, M. Zaharia, and J. Zou. NeurIPS 2024. (preprint) Optimizing Instructions and Demonstrations for Multi-Stage Language Model Programs. K. Opsahl-Ong, M.J. Ryan, J. Purtell, D. David Broman, C. Potts, M. Zaharia, and O. Khattab. EMNLP 2024. (preprint) Adaptive and Robust Query Execution for Lakehouses at Scale. M. Xue, Y. Bu, A. Somani, W. Fan, Z. Liu, S. Chen, H. Van Hovell, B. Samwel, M. Mokhtar, R.K. Korlapati, A. Lam, Y. Ma, V. Ercegovac, J. Li, A. Behm, Y. Li, X. Li, S. Krishnamurthy, A. Shukla, M. Petropoulos, S. Paranjpye, R. Xin, and M. Zaharia. VLDB 2024. RAFT: Adapting Language Model to Domain Specific RAG. T. Zhang, S.G. Patil, N. Jain, S. Shen, M. Zaharia, I. Stoica, and J.E. Gonzalez. COLM 2024. (preprint) ScenicNL: Generating Probabilistic Scenario Programs from Natural Language. K. Elmaaroufi, D. Shankar, A. Cismaru, M. Vazquez-Chanlatte, A. Sangiovanni-Vincentelli, M. Zaharia and S.A. Seshia. COLM 2024. ACORN: Performant and Predicate-Agnostic Search Over Vector Embeddings and Structured Data. L. Patel, P. Kraft, C. Guestrin and M. Zaharia. SIGMOD 2024. (preprint) How Is ChatGPT’s Behavior Changing Over Time? L. Chen, M. Zaharia and J. Zou. Harvard Data Science Review, 2024. (preprint) Image and Data Mining in Reticular Chemistry Powered by GPT-4V. Z. Zheng, Z. He, O. Khattab, N. Rampal, M. Zaharia, C. Borgs, J.T. Chayes, and O.M. Yaghi. Digital Discovery, 2024. (preprint) ARES: An Automated Evaluation Framework for Retrieval-augmented Generation Systems. J. Saad-Falcon, O. Khattab, C. Potts and M. Zaharia. NAACL 2024. (preprint) Exploiting Programmatic Behavior of LLMs: Dual-use Through Standard Security Attacks. D. Kang, X. Li, I. Stoica, C. Guestrin, M. Zaharia, and T. Hashimoto. IEEE Security and Privacy Workshops 2024. (preprint) DSPy: Compiling Declarative Language Model Calls into Self-Improving Pipelines. O. Khattab, A. Singhvi, P. Maheshwari, Z. Zhang, K. Santhanam, S. Vardhamanan, S. Haq, A. Sharma, T. Joshi, H. Moazam, H. Miller, M. Zaharia and C Potts. ICLR 2024. Spotlight. (preprint) Ring Attention with Blockwise Transformers for Near-Infinite Context. H. Liu, M. Zaharia and P. Abbeel. ICLR 2024. (preprint) Data Management for ML-based Analytics and Beyond. D. Kang, J. Guibas, P. Bailis, T. Hashimoto, Y. Sun and M. Zaharia. ACM/JMS Journal of Data Science, 2024. 2023 Analyzing ChatGPT’s Behavior Shifts Over Time. L. Chen, M. Zaharia and J. Zou. NeurIPS 2023 R0-FoMo Workshop. (longer preprint) Cornflakes: Zero-Copy Serialization for Microsecond-Scale Networking. D. Raghavan, S. Ravi, G. Yuan, P. Thaker, S. Srivatsava, M. Murray, P.H. Penna, A. Ousterhout, P. Levis, M. Zaharia and I. Zhang. SOSP 2023. Implementing Block-sparse Matrix Multiplication Kernels Using Triton. P. Mishra, T. Gale, M. Zaharia, C. Young and D. Narayanan. ICML 2023 Workshop on Efficient Systems for Foundation Models. MegaBlocks: Efficient Sparse Training with Mixture-of-Experts. T. Gale, D. Narayanan, C. Young and M. Zaharia. MLSys 2023. (preprint) Epoxy: ACID Transactions Across Diverse Data Stores. P. Kraft, Q. Li, X. Zhou, P. Bailis, M. Stonebraker, M. Zaharia and X. Yu. VLDB 2023. Optimizing Video Analytics with Declarative Model Relationships. F. Romero, J. Hauswald, A. Partap, D. Kang, M. Zaharia and C. Kozyrakis. VLDB 2023. R3: Record-Replay-Retroaction for Database-Backed Applications. Q. Li, P. Kraft, M. Cafarella, C. Demiralp, G. Graefe, C. Kozyrakis, M. Stonebraker, L. Suresh, X. Yu, and M. Zaharia. VLDB 2023. Parallelism-Optimizing Data Placement for Faster Data-Parallel Computations. N. Baruah, P. Kraft, F. Kazhamiaka, P. Bailis and M. Zaharia. VLDB 2023. HAPI Explorer: Comprehension, Discovery, and Explanation on History of ML APIs (demo). L. Chen, Z. Jin, S. Eyuboglu, H. Qu, C. Ré, M. Zaharia, and J. Zou. AAAI 2023. Moving Beyond Downstream Task Accuracy for Information Retrieval Benchmarking. K. Santhanam, J. Saad-Falcon, M. Franz, O. Khattab, A. Sil, R. Florian, M.A. Sultan, S. Roukos, M. Zaharia and C. Potts. ACL Findings 2023. (preprint) Transactions Make Debugging Easy. Q. Li, P. Kraft, M. Cafarella, C. Demiralp, G. Graefe, C. Kozyrakis, M. Stonebraker, L. Suresh and M. Zaharia. CIDR 2023. Analyzing and Comparing Lakehouse Storage Systems. P. Jain, P. Kraft, C. Power, T. Das, I. Stoica and M. Zaharia. CIDR 2023. 2022 HAPI: A Large-scale Longitudinal Dataset of Commercial ML API Predictions. L. Chen, Z. Jin, S. Eyuboglu, C. Re, M. Zaharia and J. Zou. NeurIPS 2022. Estimating and Explaining Model Performance When Both Covariates and Labels Shift. L. Chen, M. Zaharia and J. Zou. NeurIPS 2022. Advances, Challenges and Opportunities in Creating Data for Trustworthy AI. W. Liang, G.A. Tadesse, D. Ho, L. Fei-Fei, M. Zaharia, C. Zhang, J. Zou. Nature Machine Intelligence, 2022. PLAID: an Efficient Engine for Late Interaction Retrieval. K. Santhanam, O. Khattab, C. Potts and M. Zaharia. CIKM 2022. ColBERTv2: Effective and Efficient Retrieval via Lightweight Late Interaction. K. Santhanam, O. Khattab, J. Saad-Falcon, C. Potts and M. Zaharia. NAACL 2022. Overlook: Differentially Private Exploratory Visualization. M.",
  "content_length": 28485,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:27"
}