{
  "name": "Mathieu Chollet",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/mathieuchollet",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Mathieu Chollet Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffMathieu CholletMr Ethan KellyZhen Tian Dr Mathieu Chollet Senior Lecturer (School of Computing Science) email: Mathieu.Chollet@glasgow.ac.uk Office 321a, Sir Alwyn Williams Building, 18 Lilybank Gardens, Glasgow, UK, G12 8RZ Import to contacts https://orcid.org/0000-0001-9858-6844 Biography Mathieu Chollet is a Lecturer in Healthcare Technologies in the School of Computing Science of the University of Glasgow. His research is focused on social virtual agents – virtual characters capable of interacting with users through dialogue and non-verbal behaviour – and social signal processing – the application of signal processing and artificial intelligence techniques to understanding facial, bodily, and vocal behaviour. In particular, his work deals with the generation of virtual humans’ socio-emotional behaviour and the assessment of their impact on users’ cognitive and emotional states, and the automatic assessment of users’ performances during human-agent interaction through multimodal machine learning. His research has a strong experimental focus, with application domains in social skills training, remote collaboration, and healthcare. His background is in Computer Science and particularly Human-Computer Interaction, with a PhD at Telecom Paris (France) on socio-emotional behaviour planning models for embodied conversational agents funded as part of the EU FP7 TARDIS project. Before joining the University of Glasgow, he was an assistant professor in Computer Science at IMT Atlantique in the LS2N laboratory (Nantes, France), after post-doctoral appointments at the University of Glasgow’s Institute of Neuroscience and Psychology, the USC Institute for Creative Technologies, and a fellowship at the Tokyo National Institute of Informatics. His current research themes include the understanding of psychosocial stress during virtual social interactions, and the design and evaluation of pedagogical approaches for public speaking training based on virtual reality and artificial intelligence. Research interests Research groupsGlasgow Interactive Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2011Number of items: 51.2025 Al Dossary, Alia Ahmed, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844 and Vinciarelli, Alessandro ORCID: https://orcid.org/0000-0002-9048-0524 (2025) From Speech and PPG to EDA: Stress Detection Based on Cross-Modal Fine-Tuning of Foundation Models. In: 27th International Conference on Multimodal Interaction (ICMI ’25), Canberra, ACT, Australia, 13-17 October 2025, pp. 87-95. ISBN 9798400714993 (doi: 10.1145/3716553.3750753) Almutairi, M. and Chollet, M. ORCID: https://orcid.org/0000-0001-9858-6844 (2025) Automatic Detection of Public Speaking Anxiety Through Linguistic Analysis. In: AI-2025: The 45th SGAI International Conference on Innovative Techniques and Applications of Artificial Intelligence, Cambridge, UK, 16-18 December 2025, (Accepted for Publication) Bian, Tongfei, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844 and Guha, Tanaya ORCID: https://orcid.org/0000-0003-2167-4891 (2025) Robust Understanding of Human-Robot Social Interactions through Multimodal Distillation. In: ACM Multimedia, Dublin, Ireland, 27-31 Oct 2025, (Accepted for Publication) Barkar, Alisa, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, Labeau, Matthieu, Biancardi, Beatrice and Clavel, Chloe (2025) Décoder le pouvoir de persuasion dans les concours d’éloquence : une étude sur la capacité des modèles de langues à évaluer la prise de parole en public. EvalLLM2025 : Atelier sur l'évaluation des modèles génératifs (LLM) et challenge, Marseille, France, 30 June 2025. (Accepted for Publication) Léchappé, Aurélien, Milliat, Aurélien, Kabil, Alexandre, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844 and Dumas, Cédric (2025) System As A Collaborator (SAAC): a Framework for Modeling, Capturing and Augmenting Collaborative Activities in Extended Reality. In: IEEE 21st International Conference on Automation Science and Engineering (CASE 2025), Los Angeles, California, USA, 17-21 August 2025, (Accepted for Publication) Léchappé, Aurélien, Fleury, Cédric, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844 and Dumas, Cédric (2025) How to Categorize Collaboration During a Collaborative Puzzle-solving Task? Validation of Collaboration Profiles Using Multimodal Data in Virtual Reality Context. In: 28th ACM SIGCHI Conference on Computer-Supported Cooperative Work and Social Computing, 18 — 22 Oct 2025, Léchappé, Aurélien, Johnstone, Ross, Milliat, Aurélien, Williamson, John H. ORCID: https://orcid.org/0000-0001-8085-7853, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844 and Williamson, Julie R. ORCID: https://orcid.org/0000-0002-1816-1393 (2025) Understanding Social Interactions in Reality Versus Virtuality. In: CHI 2025, Yokohama, Japan, 26 Apr-01 May 2025, p. 41. ISBN 9798400713941 (doi: 10.1145/3706598.3713628) Bian, Tongfei, Ma, Yiming, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, Sanchez, Victor and Guha, Tanaya ORCID: https://orcid.org/0000-0003-2167-4891 (2025) Interact with Me: Joint Egocentric Forecasting of Intent to Interact, Attitude and Social Actions. In: IEEE International Conference on Multimedia & Expo (ICME) 2025, Nantes, France, 30 June-4 July 2025, (Accepted for Publication) Barkar, Alisa, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, Labeau, Matthieu, Biancardi, Beatrice and Clavel, Chlo´e (2025) Decoding Persuasiveness in Eloquence Competitions: An Investigation into the LLM’s Ability to Assess Public Speaking. In: 17th International Conference on Agents and Artificial Intelligence (ICAART 2025), Porto, Portugal, 23-25 February 2025, pp. 538-546. ISBN 9789897587375 (doi: 10.5220/0013158400003890) Weerasinghe, Maheshya, Macdonald, Shaun ORCID: https://orcid.org/0000-0001-6519-318X, Fiani, Cristina, O'Hagan, Joseph, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, McGill, Mark and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2025) Beyond mute and block: adoption and effectiveness of safety tools in social VR, from ubiquitous harassment to social sculpting. IEEE Transactions on Visualization and Computer Graphics, 31(5), pp. 3275-3284. (doi: 10.1109/TVCG.2025.3549860) (PMID:40067706) Biancardi, Beatrice, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844 and Clavel, Chloe (2025) Introducing the 3MT_French dataset to investigate the timing of public speaking judgements. Language Resources and Evaluation, 59(1), pp. 371-390. (doi: 10.1007/s10579-023-09709-5) Luo, Lin ORCID: https://orcid.org/0000-0002-0310-3158, Nakao, Yuri, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, Inakoshi, Hiroya and Stumpf, Simone ORCID: https://orcid.org/0000-0001-6482-1973 (2025) EARN Fairness: Explaining, Asking, Reviewing, and Negotiating Artificial Intelligence Fairness Metrics Among Stakeholders. In: 28th ACM SIGCHI Conference on Computer-Supported Cooperative Work & Social Computing (CSCW), Bergen, Norway, 18-22 Oct 2025, (Accepted for Publication) 2024 Elfleet, Morad and Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844 (2024) Investigating the Impact of Multimodal Feedback on User-Perceived Latency and Immersion with LLM-Powered Embodied Conversational Agents in Virtual Reality. In: 24th ACM International Conference on Intelligent Virtual Agents (IVA '24), 16-19 Sep 2024, ISBN 9798400706257 (doi: 10.1145/3652988.3673965) Kessassi, Celia, Dumas, Cédric, Cao, Caroline G.L. and Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844 (2024) You're Hired! Effect of Virtual Agents' Social Status and Social Attitudes on Stress Induction in Virtual Job Interviews. In: 2024 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW), Orlando, FL, USA, 16-21 March 2024, pp. 869-870. ISBN 9798350374490 (doi: 10.1109/vrw62533.2024.00231) Allemang--Trivalle, Arnaud, Donjat, Jérémie, Bechu, Gaëlic, Coppin, Gilles, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, Klaproth, Oliver W., Mitschke, Andreas, Schirrmann, Arnd and Cao, Caroline G.L. (2024) Modeling fatigue in manual and robot-assisted work for operator 5.0. IISE Transactions on Occupational Ergonomics and Human Factors, 12(1-2), pp. 135-147. (doi: 10.1080/24725838.2024.2321460) (PMID:38441578) Allemang-Trivalle, Arnaud, Donjat, Jérémie, Bechu, Gaëlic, Coppin, Gilles, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, Klaproth, Oliver W., Mitschke, Andreas, Schirrmann, Arnd and Cao, Caroline G.L. (2024) Modelling fatigue in manual and robot-assisted work for operator 5.0. IISE Transactions on Occupational Ergonomics and Human Factors, 12(1-2), pp. 135-147. (doi: 10.1080/24725838.2024.2321460) (PMID:38441578) Kessassi, Celia, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, Dumas, Cédric and Cao, Caroline G.L. (2024) Social Presence Mediates Audience Behavior Effects on Social Stress in Virtual Public Speaking. In: 11th International Conference on Affecti",
  "content_length": 45517,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:34"
}