{
  "name": "Mathias Niepert",
  "homepage": "http://www.matlog.net",
  "status": "success",
  "content": "Mathias Niepert Mathias Niepert Professor, University of Stuttgart Universitätsstraße 32 70569 Stuttgart mathias dot niepert at simtech dot uni-stuttgart dot de Chief Scientific Advisor, NEC Labs Europe mathias dot niepert at neclab dot eu Mathias Niepert is a professor (W3) at the University of Stuttgart and a faculty member of the International Max Planck Research School for Intelligent Systems (IMPRS-IS). He leads the Machine Learning and Simulation Lab, with affiliations to the Cluster of Excellence for the Simulation Sciences (SimTech), the Department of Computer Science, and the European Laboratory for Learning and Intelligent Systems (ELLIS). In addition to his academic roles, he serves as Chief Scientific Advisor at NEC Laboratories Europe, where he previously held positions as Chief Research Scientist and Manager of the Machine Learning Group. Before joining NEC Labs, Mathias was a postdoctoral researcher at the Paul G. Allen School of Computer Science at the University of Washington, Seattle. He received his Ph.D. in Computer Science and Scientific Computing from Indiana University, USA. His research focuses on efficient and controllable generative AI, geometric and physics-aware deep learning, probabilistic graphical models, and the intersection of machine learning, the natural sciences, and engineering. His group develops methods for learning and leveraging physical and geometric structure, with applications spanning computational chemistry, fluid dynamics, and biomedical research. His work is regularly published in top-tier conferences such as NeurIPS, ICML, ICLR, AAAI, and UAI, and has received several best paper awards. Mathias is also a recipient of the Google Faculty Research Award and serves as Area Chair for leading conferences, including NeurIPS, ICML, and ICLR. If you are interested in his group's work please take a look at the publication section of this website and visit our video channel. Follow @mniepert News The MLS lab has seven workshop papers accepted at NeurIPS 2025: 3 at the AI4Science, 2 at the New Perspectives in Graph Machine Learning (NPGML), one at the Constrained Optimization for Machine Learning (COML); and one at the Differentiable Learning of Combinatorial Algorithms (DiffCoALG). The MLS lab has seven papers accepted at NeurIPS 2025, including one oral and one spotlight paper. The MLS lab has five papers accepted at ICML 2025. The machine learning and simulation lab has three papers accepted at ICLR 2025. Three workshop papers accepted on ML for molecules, PDEs, and active learning at NeurIPS. Four papers accepted from the MLS group on graph neural networks, equivariant neural networks, and accelerating transformer models at NeurIPS 2024. One paper on distribution-aware prompt learning for large vision-language models accepted at ACML 2024. One paper on physics-informed interatomic potentials accepted at the AI for Science workshop at ICML 2024. Our paper on explaining GNNs was accepted for publication by the Machine Learning journal and for presentation at ECML 2024. Two papers on ML for science and simulations accepted at ICML 2024. A paper on uncertainty-driven active learning for intelligent data generation for machine learned interatomic potentials with colleagues at the University of Stuttgart and NEC Labs Europe accepted at the journal NPJ Computational Materials. The machine learning and simulation lab (MLS) and collaborators have three full and two workshop papers accepted at ICLR 2024. One paper about large vision models for medical images accepted at NeurIPS 2023. We are orgnizing the workshop Differentiable almost Everything at ICML 2023. Please consider submitting your work. One paper on learning discrete disentangled representations accepted at ECML 2023. One paper on learning neural PDE solvers that generalize accepted at ICML 2023. Keynote at the NeSy-GeMs (Neurosymbolic Generative Models) workshop at ICLR 2023. One paper with colleagues from UCLA accepted at ICLR 2023. Peru Bhardwaj, a postdoc in the Machine Learning and Simulation Lab, was awared a prestigous Alexander von Humboldt postdoctoral fellowship. One paper accepted at the 37th Conference on Artificial Intelligence (AAAI) 2023. One paper accepted to the IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). Two papers accepted at the Machine Learning and the Physical Sciences Workshop (ML4PS) at NeurIPS 2022. One paper accepted at Conference on Empirical Methods in Natural Language Processing (Findings of EMNLP 2022). Two papers accepted at the 36th Conference on Neural Information Processing Systems (NeurIPS 2022). Mathias will serve as area chair for AAAI 2022 and ICLR 2022. Two long papers and one demo paper accepted to ACL 2022. Best paper award at the International Conference on Automated Knowledge Base Construction (AKBC) 2021. Two papers accepted at the 35th Conference on Neural Information Processing Systems (NeurIPS 2021). A paper on using behavioral analysis from software engineering for knowledge graph embedding methods accepted at AKBC 2021. A paper on profiling users from the perspective of network operators accepted at CoNext 2021. The paper \"VEGN: Variant Effect Prediction with Graph Neural Networks\" was accepted at the ICML Workshop on Computational Biology (WCB). Best reviewer award at the International Conference on Uncertainty in Artificial Intelligence (UAI) 2021. Best reviewer award at the International Conference on Learning Representations (ICLR) 2021. The paper \"Uncertainty Quantification and Calibration with Finite-State Probabilistic RNNs\" was accepted at the International Conference on Learning Representations (ICLR) 2021. The machine learning group has three of its papers accepted at the Conference on Artificial Intelligence (AAAI) 2021. One paper accepted to the European Conference on Information Retrieval (ECIR) 2020. Contributed several chapters to the book Introduction to Lifted Probabilistic Inference from MIT press. Invited talks at Twitter research, SMiLE workshop, Multi-Modal Knowledge graphs @ AKBC. Two papers accepted at EMNLP 2019: Attending to Future Tokens For Bidirectional Sequence Generation and Cross-Sentence N-ary Relation Extraction using Lower-Arity Universal Schemas Two papers accepted at ICML 2019: State-Regularized Recurrent Neural Networks and Learning Discrete Structures for Graph Neural Networks One paper accepted to IJCAI 2019: A comparative study of distributional and symbolic paradigms for relational learning I am an invited speaker at the IPAM workshop \"Geometric Deep Learning for Big Data and Applications\" in LA, the Karlsruhe.AI and Heidelberg.AI speaker series, the RIKEN AI Insitute in Tokyo, and the ECML workshop \"New Trends in Representation Learning with Knowledge Graphs\"",
  "content_length": 6796,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:32"
}