{
  "name": "Mathias Unberath",
  "homepage": "https://mathiasunberath.github.io",
  "status": "success",
  "content": "Mathias Unberath Computer VisionMachine LearningExtended Realty and Robotics Mathias Unberath John C. Malone Associate Professor Johns Hopkins University Biography I am the John C. Malone Associate Professor of Computer Science at Johns Hopkins University, core faculty in the Malone Center for Engineering in Healthcare and the Laboratory for Computational Sensing and Robotics, and affiliate faculty in the Institute for Assured Autonomy. I hold secondary appointments in the School of Medicine. With my group, the ARCADE research group on Advanced Robotics and Computationally AugmenteD Environments, I build the future of computer-assisted medicine. Through synergistic research on imaging, computer vision, machine learning, and interaction design, we build human-centered solutions that are embodied in emerging technology such as mixed reality and robotics. Previously, I was an Assistant Research Professor in Computer Science and postdoctoral fellow in the Laboratory for Computational Sensing and Robotics at Hopkins, and completed my PhD in Computer Science at the Friedrich-Alexander-Universität Erlangen-Nürnberg from which I graduated summa cum laude in 2017. While completing a Bachelor’s in Physics and Master’s in Optical Technologies at FAU Erlangen, I studied at the University of Eastern Finland as ERASMUS scholar in 2011 and joined Stanford University as DAAD fellow throughout 2014. I have published more than 175 journal and conference articles, and have received numerous awards, grants, and fellowships, including the NSF Career, NIH NIBIB R21 Trailblazer and Google Research Scholar Award, and more than 20 international paper awards. For a comprehensive list of publications, among other things, please refer to either my CV or Google Scholar. I teach CS482/682 Machine Learning: Deep Learning, CS486/686 Artificial Intelligent System Design and Development, and CS486/686 Interpretable Machine Learning Design. More information on my teaching is available at deep.cs.jhu.edu/. Interests Computer Vision, Machine Learning, Human-computer Interaction, Augmented and Virtual Reality, and Robotics for clinical decision support. Education PhD in Computer Science, 2017 FAU Erlangen MSc in Optical Technologies, 2014 FAU Erlangen and Stanford University BSc in Physics, 2012 FAU Erlangen and University of Eastern Finland × Cite Copy Download",
  "content_length": 2366,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:32"
}