{
  "name": "Mathy Vanhoef",
  "homepage": "https://www.mathyvanhoef.com",
  "status": "success",
  "content": "Mathy Vanhoef Pages Home Publications Tools About Wednesday, 7 August 2024 The SSID Confusion Attack: Common Misconceptions We've spotted some confusion about the SSID confusion attack. First, it's by no means something to panic about, but it's nice research to make one think about threat models. To address some common misconceptions:The adversary doesn't need to know the pre-shared secret. The SSID Confusion attack can cause a victim to connect to a different SSID, as long as that SSID uses the same credentials as another SSID. However, the adversary doesn't need to know these credentials. After all, if the adversary, for instance, already has access to the password of a home network, they could simply perform a generic man-in-the-middle attack by spoofing the real SSID.The adversary doesn't need access to the RADIUS server. To execute this attack against an Enterprise network, the adversary doesn't require any access to the RADIUS server. The attack doesn't require any Enterprise network credentials—no usernames, passwords, certificates, or RADIUS access. The adversary is always an outsider. Having some kind of additional access can increase the impact of the attack though. For example, in Section 4.3, the adversary is also assumed to have the capability to obtain the Wi-Fi decryption keys from a hotspot. However, even in this scenario, direct access to the RADIUS server is not required—only access to the Pairwise Master Key (PMK) is needed.The attack applies to most, if not all, EAP methods. The attack isn't limited to MS-CHAPv2; it applies to all EAP methods. In the paper, we mentioned MS-CHAPv2 and EAP-PWD because they are often used by eduroam networks. Note that based on scraped public configuration profiles, MS-CHAPv2 is still the most common EAP method for eduroam networks.The 2.4 GHz band can support management frame protection. Previous surveys (i.e., wardrives) of over 250,000 networks have found that, on average, 2.4 GHz networks are less likely to use management frame protection. So 2.4 GHz networks can certainly support management frame protection, but it's less common in practice compared to 5 GHz networks, especially on networks that only broadcast on the 2.4 GHz band. Typically, the same equipment advertises 2.4 and 5 GHz SSIDs. Usually, the same router or access point advertises both the 2.4 and 5 GHz SSIDs. As we'll further discuss below, it's therefore less common for the 2.4 and 5 GHz SSIDs to have different security settings. However, previous research has found that this does occasionally occur. In particular, a separate SSID for the 2.4 GHz band can be created for backwards compatibility, in which case management frame protection is then also disabled to further enhance backwards compatibility.Security of 2.4 vs. 5 GHz networks. The attack can make a client connect to the 2.4 GHz SSID of a network, even if the client is configured to connect only to the 5 GHz SSID. This might not seem useful, but real-world measurements have shown that the 2.4 GHz SSID is often less secure and more vulnerable to older attacks. That being said, due to the point discussed above, this difference in security is lower for networks that support both the 2.4 and 5 GHz band. Nevertheless, even for networks that support both 2.4 and 5 GHz, it does occasionally occur that the 2.4 GHz band is less secure, as mentioned above.What's the real lesson? The most interesting part of the paper is not its practical impact. Given the specific threat model, I don't expect many real-world attacks. However, it highlights the importance of considering threat models. In particular, it shows that only verifying credentials without checking the SSID can impact security. Additionally, it highlights that some Enterprise networks with different purposes and different SSIDs, may actually share the same RADIUS server and security configuration. These scenarios may not be typical, but they represent how some use Wi-Fi in practice. We should consider these use cases or at least warn about their potential insecurity! Geplaatst door Mathy op 00:44 Email ThisBlogThis!Share to XShare to FacebookShare to Pinterest Thursday, 10 August 2023 Making the Cloudflare WARP VPN leak DNS requests Cloudflare offers a free VPN client called Cloudflare WARP. I found that its Windows client can be tricked into leaking all DNS requests. The adversary can then spoof DNS responses and intercept nearly all traffic.To exploit the vulnerability, the adversary needs to create a rogue Wi-Fi or Ethernet network that supports IPv6. When the local network supports IPv6, all DNS requests are leaked.Why are DNS requests leaked?When you enable the VPN tunnel, the Cloudflare WARP client will configure a local DNS server. This can be seen when executing ipconfig:Ethernet adapter Ethernet:   Connection-specific DNS Suffix  . : cs.kuleuven.be.   [..]   DNS Servers . . . . . . . . . . . : fd01:db8:1111::2                                       fd01:db8:1111::3                                       127.0.2.2                                       127.0.2.3   NetBIOS over Tcpip. . . . . . . . : EnabledThe idea is that the Cloudflare WARP client will act as a local DNS server. This local DNS server will perform the actual DNS requests in a secure manner. For IPv4, the special IP addresses 127.0.2.2 and 127.0.0.3 are configured as the DNS server. These IP addresses refer to the Windows computer itself (they're called loopback addresses). So when the network only supports IPv4, these loopback IP addresses are used for the DNS server, and all DNS requests are handled by the Cloudflare WARP client. The WARP client will then securely handle the DNS requests. So everything works as expected when using IPv4.The Cloudflare WARP client also configures the IPv6 addresses fd01:db8:1111::2 and fd01:db8:1111::3 as DNS servers. When the local network supports IPv6, these addresses will be used. But these are not loopback addresses referring to the Windows machine itself! These special are Unique Local Addresses (ULAs). This means they behave the same as private IPv4 address of the form 192.168.x.y. In other words, these two IPv6 addresses represent random computers in the local network. They don't represent the Windows computer itself.All combined, the Cloudflare WARP client is configuring two random IPv6 computers in the local network as DNS servers. Namely, the computers fd01:db8:1111::2 and fd01:db8:1111::3 are configured as DNS servers. So a rogue Wi-Fi network simply needs to advertise support for IPv6, assign itself the IPv6 address fd01:db8:1111::2, and then it will receive all DNS requests:The leakage of DNS requests has a direct impact on the user's privacy: you can now see which websites the victim is visiting, which apps are being used, and so on.But there's more: once the adversary can intercept DNS requests, they can also spoof DNS responses. And by doing so, the adversary can easily intercept nearly all IP-based traffic of the victim! For instance, if the victim is looking up the IP address of website.com the adversary can return the IP address of their own server. When the victim now visits this website, all traffic will be sent to the adversary's server (and the adversary can forward it to the real server and back). If the website uses HTTPS then traffic is still protected, but the VPN itself is now completely bypassed, and all unprotected protocols can be subsequently attacked.The severity was rated as High. This matches the CVSS score of 7.4: it doesn't require user interaction and has a high attack complexity. Intuitively, I would actually say it has a low attack complexity. But CVSS has the following example for high attack complexity: \"The attacker must inject themselves into the logical network path [..] e.g., a man in the middle attack\". And exploiting the vulnerability essentially requires a MitM position.Another harder-to-exploit flawA second issue was that the Clouldflare WARP client only updated the DNS servers of the first two network interfaces. If you have more than two network interfaces, the DNS servers associated to these extra network interfaces didn't get changed. This means a rogue Wi-Fi network could assign itself as the DNS server, and if the victim has more than two network interfaces, Windows would use the adversary's Wi-Fi router as the DNS server! This happened even when the local network only supported IPv4.Having multiple network interfaces can occur more often than you think. For instance, if the victim installed VirtualBox, then a virtual network interface is created and the attack becomes possible.To patch this initial vulnerability, the Windows client was updated to assign the DNS servers 127.0.2.2 and 127.0.0.3 to all network interfaces. Interestingly, it was no longer assigning IPv6 addresses for the DNS server. So that patch, without us really realizing it yet, also prevented the above IPv6-based attack.All combined, these two vulnerabilities were fixed in beta build 2023.5.170.1 which was made available on May 12, 2023. The first official release that included the fix was version 2023.7.7.0 which was released on July 7, 2023.DiscussionI first noticed the \"multiple-interfaces DNS leakage\" flaw and immediately reported that. While doing so, I already saw some weird IPv6 behavior, but I didn't have time to investigate it. Afterwards I also checked the IPv6 issue and also discovered this more impactful attack.Finally, I'd like to thank Cloudflare for the smooth handling of this vulnerability and disclosure. Geplaatst door Mathy op 18:26 Email ThisBlogThis!Share to XShare to FacebookShare to Pinterest Tuesday, 18 May 2021 FragAttacks: Clarifying Some Aspects If you haven't yet read about this research then watch my USENIX Security presentation: In this blog post I'll discuss some aspects in more detail than I could in the paper. Addressing general misconceptions None of the flaws are in the cryptographic primitives used by Wi-Fi. In other words,",
  "content_length": 23250,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:35"
}