{
  "name": "Mathias Ekstedt",
  "homepage": "https://www.kth.se/profile/mekstedt",
  "status": "success",
  "content": "KTH | Mathias Ekstedt Skip to main content Mathias EkstedtProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/mekstedtDetailsWorks for Division of Network and Systems EngineeringTelephone +46 8 790 68 67Unit address Teknikringen 33E-mail mekstedt@kth.seResearcherResearcher IDORCID IDWeb of Science ResearcherIDScopus IDGoogle Scholar IDResearchGateAbout meMathias Ekstedt is Professor of Industrial Information and Control Systems at KTH Royal Institute of Technology in Stockholm, Sweden. He received his M.Sc. and Ph.D. from the Royal Institute of Technology in 1999 and 2004 respectively. Mathias' research interests include information security and cybersecurity in combination with software and systems architecture modeling and analysis. Much of the research revolves around developing formalisms for analyzing security vulnerabilities of system-of-systems architectures trough the means of probabilistic attack/defense graphs. A corenerstone in this work is the Meta Attack Language (MAL). He has long history of collaborating with the power industry and apply the research to information systems related to physical process monitoring and control, such as SCADA and Industrial Control Systems. Mathias is the co-founder and director of KTH's Master programme in Cybersecurity, a member of the Trust Working Group in the Digital Futures research center, and a faculty member of the Center for Cyber Defense and Information Security (CDIS). Mathias is a co-founder of foreseeti, a company developing a cybersecurity analysis software product, that was acquired by Google in 2022. Organizationally he is a member of the Software Systems Architecture and Security (SSAS) research group within the Division of Network and Systems Engineering (NSE) at the Department of Computer Science in the School of Electrical Engineering and Computer Science (EECS) at KTH. Commitment in larger projects Ongoing Co-PI in the SSF project CHAINS (Consistent Hardening and Analysis of Software Supply Chains) Supervisor for two projects within the Centre for Cyber Defence and Information Security (CDIS) Finished CO-PI in the Swedish Civil Contingencies Agency (MSB) centre RICS (Resilient Information and Control Systems) Work pacakge leader in the EU ERA-Net project HONOR (Holistic flexibility market integration of cross sectoral energy sources) Co-inititator of the EU H2020 project SOCCRATES (SOC & CSIRT Response to Attacks & Threats based on attack defense graphs Evaluation Systems) Project leader for Threat modeling for digitalized power systems within the Swedish Centre for Smart Grids and Energy Storage (SweGRIDS) Work package leader in EU FP7 project SEGRID (Security of smart electricity grids) Project supervisor for Cybersecurity for future Power System Operation within the Swedish Centre for Smart Grids and Energy Storage (SweGRIDS) Work package leader in EU ERA-Net project SALVAGE (Cyber-phySicAl security for Low-VoltAGE grids) Technical coordinator EU FP7 project VIKING (Vital Infrastructure, Networks, Information and Control Systems Management) Manger of the program IT Applications in Power System Operation and Control within the Swedish Centre of Excellence in Electric Power Engineering (EKC2) Ph.D. student supervison Ongoing Sandor Berglund. Main supervisor Yekatierina Churakova. Main supervisor Viktor Engström. Main supervisor Zeshan Naseer. Co-supervisor Nikolaos Kakouros. Co-supervisor Finished Engla Rencelj Ling. Main supervisor Waldo Rocha-Flores. Main supervisor. Hannes Holm. Main supervisor Teodor Sommestad. Main supervisor. Per Närman. Main supervisor. Margus Välja. Co-supervisor Markus Buschle. Co-supervisor. Johan König. Co-supervisor. Zhu Kun. Co-supervisor. Enrique Silva. Co-supervisor. Leonel Plazaola. Co-supervisor. Magnus Gammelgård. Co-supervisor. Post Docs Ongoing Yacine Anser Finished Zeeshan Afzal Ashish Dwivedi Giuseppe Nebbione Wojciech Widel Preetam Mukheerje CoursesCyber Security Analysis (EP279V), examiner, course responsibleCybersecurity in a Socio-Technical Context (DD2510), teacher, course responsible, examinerDegree Project in Computer Engineering, First Cycle (II142X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA239X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA250X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA231X), examinerDegree Project in Computer Science and Engineering, specialising in Communication Systems, Second Cycle (DA246X), examinerDegree Project in Computer Science and Engineering, specialising in Cybersecurity, Second cycle (DA237X), examinerDegree Project in Computer Science and Engineering, specializing in Industrial Management, Second Cycle (DA235X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Systems, Control and Robotics, Second Cycle (DA236X), examinerDegree Project in Electrical Engineering, Second Cycle (EA250X), examinerDegree Project in Electrical Engineering, Second Cycle (EA238X), examinerDegree Project in Electrical Engineering, specialising in Embedded Systems, Second Cycle (EA248X), examinerDegree Project in Electrical Engineering, specializing in Information and Network Engineering, Second Cycle (EA260X), examinerDegree Project in Electronics and Computer Engineering, First Cycle (IL142X), examinerDegree Project in Information and Communication Technology, First Cycle (IA150X), examinerDegree Project in Information and Communication Technology, First Cycle (II143X), examinerSecurity Analysis of Large-Scale Computer Systems (EP2790), teacher, course responsible, examinerSeminar on Advanced Topics in Communication Networks 1 (FEP3316), examinerSeminar on Advanced Topics in Communication Networks 2 (FEP3317), examinerThe Cybersecurity Engineer's Role in Society (DD2303), teacherPublicationsPublication listLinksLinkedIn",
  "content_length": 6006,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:31"
}