{
  "name": "Mathieu Barthet",
  "homepage": "http://www.eecs.qmul.ac.uk/profiles/barthetmathieu.html",
  "status": "success",
  "content": "Dr Mathieu Barthet - School of Electronic Engineering and Computer Science Skip to main content School of Electronic Engineering and Computer Science School of Electronic Engineering and Computer SciencePeopleProfiles Dr Mathieu BarthetSenior Lecturer in Digital MediaEmail: m.barthet@qmul.ac.ukTelephone: +44 20 7882 7518Room Number: Engineering, Eng 111TeachingResearchTeachingDigital Media and Social Networks (Postgraduate) Content description: ------- How does the way we feel and express emotional behaviour affect our interaction with technology? What if we could use a ''head nod'' for ''liking'' things on Facebook? Can we create assistive technology to help people suffering from social disorders (e.g., autism)? Affective and Behavioural Computing is a multidisciplinary field of research and practice concerned with these questions, and understanding, recognizing and utilizing human emotions and communicative behaviour in the design of computational systems. ----- The following list aims to clarify the content and provides a representative list of topics: ¿ Overview: affective and behavioural computing; ¿ Theories in psychology, cognitive science and neuroscience: affect, emotion and social signal processing; ¿ Computational models; ¿ Emotion, affect and social signals in Human-Computer Interaction (HCI); ¿ Sensing: vision, audio, bio signals, text; data acquisition and annotation, databases and tools; ¿ Processing: extracting meaningful information and features; ¿ Recognition: applying machine learning techniques; ¿ Programming refresher: Hands-on lecture on programming for affective and behavioural computing using relevant libraries; ¿ Evaluation: automatic analysers, and emotionally and socially intelligent systems; ¿ Affect and social signal expression and generation (virtual characters, robots, etc.); ¿ Affect and social signals for Mobile HCI; ¿ Applications (entertainment technology/gaming/arts; clinical and biomedical studies, e.g., autism, depression, pain; etc.; implicit (multimedia) tagging; affective wearables); ¿ Ethical issues. Digital Media and Social Networks (Undergraduate) Introduction to Online Social Networks (OSN) Characteristics of OSNs Basic Graph Theory Small World Phenomenon Information propagation on OSNs Influence and Content Recommendation Sentiment Analysis in Social Media Privacy and ethics Sound Recording and Production Techniques (Postgraduate/Undergraduate) The module develops the students' skills and understanding of contemporary audio production techniques. It will give the students a good grounding in the theoretical aspects of audio production, from the functionality of audio interfaces to the signal processing within audio effects, as well as providing practical experience in the use of all audio equipment to which the theory applies. The students will learn the implications of audio digitisation, through which they will gain an understanding of the various means by which digital media is disseminated in the modern age.ResearchResearch Interests:See Mathieu Barthet’s research profile pages including details of research interests, publications, and live grants. Back to top",
  "content_length": 3166,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:33"
}