{
  "name": "Matluba Khodjaeva",
  "homepage": "https://www.jjay.cuny.edu/faculty/matluba-khodjaeva",
  "status": "success",
  "content": "Matluba Khodjaeva | John Jay College of Criminal Justice Skip to main content Matluba Khodjaeva Associate Professor Phone number (212)237-8087 Room number New Building 6.65.19 Email mkhodjaeva@jjay.cuny.edu Download CV File C.V. Education Ph.D., The Graduate Center, CUNY (2017,  Computer Science / Cryptography)M.Phil., The Graduate Center, CUNY (2017,  Computer Science)M.S., City College of New York, CUNY (2017,   Computer Science)M.A., Hunter College, CUNY (2011, Mathematics)B.A., Hunter College, CUNY (2011, Mathematics) Bio Matluba Khodjaeva is an Associate Professor in the Department of Mathematics and Computer Science at John Jay College of Criminal Justice, a member of the Graduate Faculty in the Digital Forensics and Cyber Security program, and a Doctoral Faculty member in Computer Science at the CUNY Graduate Center. She earned her Ph.D. in Computer Science from the CUNY Graduate Center in 2017.Her primary research interests lie in cryptography, with a particular focus on secure outsourcing of computations to the cloud and the design and implementation of efficient, secure cryptographic protocols for computationally constrained devices, such as RFID tags and other embedded systems. Her work bridges theoretical security guarantees with practical, real-world applications, aiming to protect sensitive information in environments where computational resources are limited.In addition to her research, Dr. Khodjaeva is dedicated to teaching and mentoring students at both undergraduate and graduate levels, fostering the next generation of experts in cryptography, cybersecurity, and computer science. Courses Taught CSCI 360 : Cryptography and CryptanalysisMAT 460: Mathematical CryptographyCSCI 489: Independent Study in CryptographyFCM 741: Applied CryptographyCSC 79000: Independent Study in Research Project (at the Graduate Center) Scholarly Work Conference Papers:   G. Di Crescenzo, M. Khodjaeva, D. Morales*, D. Kahrobaei, “Single-Server Delegation of NTT with Application to Crystals-Kyber”. In Proceedings of the 2024 on Cloud Computing Security Workshop (pp. 29-42). M. Khodjaeva, G. Di Crescenzo. (2024). “An Efficient Small Modulus Test and Its Applications to Delegated Computation without Preprocessing”. In: Innovative Security Solutions for Information Technology and Communications. SecITC 2023. Lecture Notes in Computer Science, vol 14534. Springer, Cham. LINK. (pdf LINK)G. Di Crescenzo, M. Khodjaeva, D. Morales Caro*. (2024). “Single-Server Batch Delegation of Variable-Input Pairings with Unbounded Client Lifetime”. In: Computer Security. ESORICS 2023 International Workshops. ESORICS 2023. Lecture Notes in Computer Science, vol 14399. Springer, Cham. LINK (pdf  LINK).M. Khodjaeva, G. Di Crescenzo. (2023) “On Single-Server Delegation Without Precomputation”. In: Proceedings of 20th International Conference on Security and Cryptography, SECRYPT, pp. 540-547. Rome, Italy, July 10-12, 2023. (LINK).G. Di Crescenzo, M. Khodjaeva, T. Chen, R. Krishnan, D. Shur, D. Kahrobaei, V. Shpilrain. (2022). “On Single-Server Delegation of RSA”. In: Innovative Security Solutions for Information Technology and Communications. SecITC 2022. Lecture Notes in Computer Science, vol 13809. Springer, Cham. LINK (pdf LINK).G. Di Crescenzo, M. Khodjaeva, R. Krishnan, D. Shur. (2022). “Single-Server Delegation of Small-Exponent Exponentiation and Sum-Homomorphic Encryption from Quasilinear-time Clients”. In: Proceedings of the 4th Workshop on CPS&IoT Security and Privacy, pp. 15-26, 2022. (Voted as the second-best paper in that workshop), LINK. (pdf  LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2022). “On Single-Server Delegation of RSA Decryption”. In: CFail 2022, the Conference for Failed Approaches and Insightful Losses in Cryptology, affiliated workshop of CRYPTO 2022 LINK. (pdf LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2022). “A Survey on Delegated Computation”. In: Developments in Language Theory. DLT 2022. Lecture Notes in Computer Science, vol 13257. Springer, Cham. LINK. (pdf  LINK).G. Di Crescenzo, M. Khodjaeva, V. Shpilrain, D. Kahrobaei, R. Krishnan. (2021). \"Single-Server Delegation of Ring Multiplications from Quasilinear-time Clients”. In: 2021 14th International Conference on Security of Information and Networks (SINCONF 2021), Edinburgh, United Kingdom, 2021, pp. 1-8, LINK, (pdf   LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2021). “Secure and Efficient Delegation of Pairings with Online Inputs”. In: Smart Card Research and Advanced Applications. CARDIS 2020. Lecture Notes in Computer Science, vol 12609. Springer, Cham. LINK, (LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2020). “Secure and Efficient Delegation of Elliptic-Curve Pairing”. In: Applied Cryptography and Network Security. ACNS 2020. Lecture Notes in Computer Science, vol 12146. Springer, Cham, Research Impact Score 4.46, LINK, (LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2019). “Delegating a Product of Group Exponentiations with Application to Signature Schemes”. In: Conference Proceedings of the Number-Theoretic Methods in Cryptology Conference, (NuTMiC 2019), University of Sorbonne, Paris, 1- 23 (2019), (LINK).M. Obaidat, M. Khodjaeva, S. Obeidat, D. Salane and J. Holst*. (2019). “Security Architecture Framework for Internet of Things (IoT)”. In: 2019 IEEE 10th Annual Ubiquitous Computing, Electronics & Mobile Communication Conference (UEMCON), New York, NY, USA, 2019, pp. 0154-0157, LINK. (pdf  LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2019). “Secure Delegation to a Single Malicious Server: Exponentiation in RSA-type Groups”. In: 2019 IEEE Conference on Communications and Network Security (CNS), Washington, DC, USA, 2019, pp. 1-9. LINK (pdf  LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2018). “Efficient and Secure Delegation to a Single Malicious Server: Exponentiation over Non-Abelian Groups”. In: Mathematical Software – ICMS 2018. ICMS 2018. Lecture Notes in Computer Science, vol 10931. Springer, Cham. LINK. (pdf LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2017). “Computing Multiple Exponentiations in Discrete Log and RSA Groups: From Batch Verification to Batch Delegation”. In: 2017 IEEE Conference on Communications and Network Security (CNS), Las Vegas, NV, USA, 2017, pp. 531-539. LINK. (pdf  LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2017). “Practical and Secure Delegation of Exponentiations over Discrete-Log Groups to a Single Malicious Server”. In: CCSW’17: Proceeding of the 2017 on Cloud Computing Security Workshop, 2017, pp 17-28, LINK. (pdf  LINK).Journal Papers:G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2020). “Delegating a Product of Group Exponentiations with Application to Signature Schemes”. In: Journal of Mathematical Cryptology, De Gruyter 14, no. 1, 438-459, (2020), Impact Factor 1.59, LINK (pdf  LINK).G. Di Crescenzo, M. Khodjaeva, D. Kahrobaei, V. Shpilrain. (2020). “Efficient and Secure Delegation of Exponentiation in General Groups to a Single Malicious Server”. In: Mathematics in Computer Science Journal, Springer 14, no. 3, 641-656 (2020), Impact Factor 1.15,  LINK (pdf  LINK).M. Obaidat, I. Shahwan, A. Hassebo, S. Obeidat, M. Ali, M. Khodjaeva. (2020). “SNR-Based Early Warning Message Scheme for VANETs”. In: Journal of Mobile Multimedia, Impact Factor 1.11, pp. 163-190 (2020), LINK. (Awarded as the best paper in Journal of Mobile Multimedia LINK) (pdf  LINK).Article:M. Maras, S. Jain, H. Johnson, M. Khodjaeva. (2022). “How Educational Institutions Can Help Fill the Cybersecurity Workforce Gap”. In: Security Management, Cybersecurity Talent Development Article, American Society for Industrial Security (ASIS 2022), September 16 2022, LINK.Edited Book:D. Kahrobaei, M. Khodjaeva, Mathematical Aspects of Cryptography and Coding Theory, La Matematica, Springer Nature (2024), LINK.Book Chapters:M. Obaidat, M. Khodjaeva, J. Holst*, M. Ben Zid*. (2020). “Security and Privacy Challenges in Vehicular Ad Hoc Networks”. In: Mahmood Z. (eds) Connected Vehicles in the Internet of Things, Springer, Cham (2020), LINK (pdf  LINK).M. Khodjaeva, M. Obaidat, D. Salane. (2019). “Mitigating Threats and Vulnerabilities of RFID in IoT Through Outsourcing Computations for Public Key Cryptography”. In: Mahmood Z. (eds) Security, Privacy and Trust in the IoT Environment. Springer, Cham (2019), LINK (pdf  LINK). Honors and Awards PSC-CUNY- Grant 56, July 1, 2025 – June 30, 2026, “Efficient and Secure Delegation of Polynomial Multiplications”, CUNY Research Foundation Grant, $6,000. Role: PI.Department nomination to 2023 The Feliks Gross and Henry Wasser Awards.Departmental nomination to 2023 Sloan Research Fellowship.PSC-CUNY- Grant 54, July 1, 2023 – June 30, 2024, “Secure and Efficient Delegation of Multiple Pairings”, CUNY Research Foundation Grant, $6,000. Role: PI.PSC-CUNY- Grant 53, July 1, 2022 – June 30, 2023, “Secure and Efficient Delegation of Pairing with Membership Verification Test”, CUNY Research Foundation Grant, $6,000. Role: PI.Advancement of Research (OAR) Faculty Scholarship Award, project name: Secure and Efficient Delegation of Pairings and Algebraic Functions, March 2022, $1,500. Role: PI.NSF CISE-MSI: RCBP-ED: SaTC, Cultivating and Developing Research Talent to Support Research in Cyber-Security, with S. Jain (PI), M. Khodjaeva (Co-PI), M. Maras, H. Johnson, S. Graff (Co-PI), 2021-2023, $299,993. Role: Co-PI.NSF 21-528 Campus Cyberinfrastructure, CC* Planning: Undertaking a Process that will Create a Comprehensive Blueprint for Improving Cyber-Infrastructure at John Jay College, CUNY, Member for application, with Anthony Carpi (PI), Shweta Jain (Co-PI), Marie-Helen Maras (Co-PI), , 2021-2022, $100,000. Role: Faculty Advisor, co-chair in the Software, Database and Simulation Applications Assessment Committee.PSC-CUNY- Grant ",
  "content_length": 10413,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:37"
}