{
  "name": "Matloob Khushi",
  "homepage": "https://www.brunel.ac.uk/people/matloob-khushi",
  "status": "success",
  "content": "Dr Matloob Khushi | Introduction | Brunel University London Skip to Content Home People Dr Matloob Khushi Dr Matloob KhushiSenior Lecturer in Computer Science Email: matloob.khushi@brunel.ac.uk Google Scholar Dr. Khushi on Youtube Computer Science College of Engineering, Design and Physical Sciences Summary Dr Matloob Khushi is an Associate Professor in the Department of Computer Science, with over 25 years of combined academic and industry experience. His research excellence has been recognised globally, placing him in the Stanford/Elsevier list of the world’s top 2 % of AI scientists. He earned his PhD in AI and Data Science from the University of Sydney, where he developed novel algorithms to analyse large-scale genomic datasets. During his postdoctoral research at the Children’s Medical Research Institute (2014–2017), he pioneered AI-based diagnostic tools to accelerate the detection of medical conditions. More recently, under a UKRI NEC grant, he has developed bioinformatics tools for assessing environmental and aquatic bio-sensitivity. Dr Khushi has supervised six PhD candidates to completion and over 100 postgraduate dissertations across diverse domains of AI, data science, and computational finance. He continues to welcome exceptional PhD candidates, particularly those eager to push the boundaries of AI innovation. Dr Khushi’s research portfolio spans FinTech AI, bioinformatics, and machine learning for complex data environments. His work bridges theory and application, attracting collaborations from international banks, healthcare institutions, and technology start-ups. He has published over 85 peer-reviewed papers in leading journals and conferences, earning thousands of citations and prestigious best paper awards from outlets such as IEEE Transactions on Computational Social Systems and PeerJ. Recent Publications of Interest Leveraging BiLSTM-GAT for Enhanced Stock Market Prediction: A Dual-Graph Approach to Portfolio Optimization X. Lu, J. Poon, M. Khushi, Applied Intelligence, 2025 — Introduces a hybrid BiLSTM and Graph Attention Network model to improve portfolio returns through advanced temporal and relational learning. Bridging the Gap Between Machine and Human in Stock Prediction: Addressing Heterogeneity in Stock Market X. Lu, J. Poon, M. Khushi, IEEE Access, 2025 — Proposes models that align AI market predictions with human decision-making behaviour, increasing explainability and trust in trading systems. Examples of some of his significant FinTech work are as follows: He has implemented innovative financial models to improve decision-making. One such example is his work with an international bank where Dr. Khushi developed a cutting-edge portfolio management model using reinforcement learning that optimizes cumulative returns and the Sharpe Ratio [1]. This model has been instrumental in refining the bank's investment strategies and risk management practices, leading to significantly more informed and profitable decisions. Dr. Khushi's research for a major international bank addressed its need for robust risk assessment tools. He created sophisticated models that simulate realistic financial scenarios, including market crashes, empowering fund managers with deeper insights into risk dynamics. This allows them to make more resilient investment decisions during turbulent market periods [2]. Dr. Khushi's impact transcends specific projects. He has made significant strides in developing algorithms for modelling non-stationary time-series data. This work has not only advanced academic understanding but also provided practical tools for financial analysts and economists to better predict and respond to market changes [3, 4]. Dr. Khushi's impact on quantitative finance extends beyond existing metrics. He identified limitations in popular risk-adjusted return measures like the Sharpe Ratio (sensitive to high volatility) and Sterling Ratio (punishes large drawdowns). To address these shortcomings, he invented the SS Ratio, incorporating both volatility and drawdown sensitivities. His research demonstrates that investment strategies optimized using the SS Ratio outperform those based on traditional metrics, showcasing its potential for superior returns [5]. He has also made significant contributions in applying AI to stock selection for financial institutions. He has developed various models leveraging diverse approaches, including: Text-mining sentiment analysis: This model analyzes textual data to identify stocks with promising sentiment, aiding investment decisions [6]. Graph Laplacian-Based Multi-task Learning: This model exploits the interconnectedness of various stocks to recommend promising investment targets [7]. Predictor and historical probability-based performance: This model utilizes fundamental and technical indicators along with historical trends to identify potentially lucrative stocks [8]. Dr. Khushi's innovation extends beyond investment selection. developed proprietary algorithms for generating synthetic data [9], a valuable tool for various applications: Fraud detection: Identifying fraudulent activities within financial systems. Credit default prediction: Anticipating potential loan defaults for improved risk management [10]. Corporate bankruptcy: Predicting corporate bankruptcy before it occurs, mitigating financial risks [11]. His expertise expands even further to derivative markets. He has developed models for complex financial instruments like CFDs, Options and Futures, facilitating informed trading decisions in these markets [5, 12-14]. Cited Publications: Kim, T.W. and M. Khushi. Portfolio Optimization with 2D Relative-Attentional Gated Transformer. in 2020 IEEE Asia-Pacific Conference on Computer Science and Data Engineering (CSDE), Gold Coast, QLD, Australia, 16–18 December 2020. 2020. Huang, A., M. Khushi, and B. Suleiman, Regime-Specific Quant Generative Adversarial Network: A Conditional Generative Adversarial Network for Regime-Specific Deepfakes of Financial Time Series. Applied Sciences, 2023. 13(19): p. 10639. Wang, X., et al., Learning Non-Stationary Time-Series with Dynamic Pattern Extractions. IEEE Transactions on Artificial Intelligence, 2021. He, J., et al. Robust Dual Recurrent Neural Networks for Financial Time Series Prediction. in Proceedings of the 2021 SIAM International Conference on Data Mining (SDM). 2021. SIAM. Zhang, Z. and M. Khushi. GA-MSSR: Genetic Algorithm Maximizing Sharpe and Sterling Ratio Method for RoboTrading. in 2020 International Joint Conference on Neural Networks (IJCNN). 2020. Jaggi, M., et al., Text Mining of Stocktwits Data for Predicting Stock Prices. Applied System Innovation, 2021. 4(1): p. 13. He, J., N.H. Tran, and M. Khushi. Stock Predictor with Graph Laplacian-Based Multi-task Learning. in International Conference on Computational Science. 2022. Springer International Publishing Cham. Singh, J. and M. Khushi, Feature Learning for Stock Price Prediction Shows a Significant Role of Analyst Rating. Applied System Innovation, 2021. 4(1). Mukherjee, M. and M. Khushi, SMOTE-ENC: A Novel SMOTE-Based Method to Generate Synthetic Data for Nominal and Continuous Features. Applied System Innovation, 2021. 4(1): p. 18. Alam, T.M., et al., An Investigation of Credit Card Default Prediction in the Imbalanced Datasets. IEEE Access, 2020. 8: p. 201173-201198. Alam, T.M., et al., Corporate bankruptcy prediction: An approach towards better corporate world. The Computer Journal, 2021. 64(11): p. 1731-1746. Zhao, Y. and M. Khushi. Wavelet Denoised-ResNet CNN and LightGBM Method to Predict Forex Rate of Change. in 2020 IEEE International Conference on Data Mining Workshops (ICDMW), Sorrento, Italy, 11–17 November 2020. 2020. Zeng, Z. and M. Khushi. Wavelet Denoising and Attention-based RNN- ARIMA Model to Predict Forex Price. in 2020 International Joint Conference on Neural Networks (IJCNN). 2020. Qi, L., M. Khushi, and J. Poon. Event-Driven LSTM For Forex Price Prediction. in 2020 IEEE Asia-Pacific Conference on Computer Science and Data Engineering (CSDE), Gold Coast, QLD, Australia, 16–18 December 2020. 2020. Newest selected publications Lu, X., Poon, J. and Khushi, M. (2025) 'Leveraging BiLSTM-GAT for enhanced stock market prediction: a dual-graph approach to portfolio optimization'. Applied Intelligence, 55 (7). pp. 1 - 18. ISSN: 0924-669X Open Access Link Journal article Lu, X., Poon, J. and Khushi, M. (2024) 'Bridging the Gap between Machine and Human in Stock Prediction: Addressing Heterogeneity in Stock Market'. IEEE Access, 12. pp. 186171 - 186185.Open Access Link Journal article Naseem, U., Dunn, AG., Khushi, M. and Kim, J. (2024) 'Vaccine Misinformation Detection in X using Cooperative Multimodal Framework'.MM '24: The 32nd ACM International Conference on Multimedia. Melbourne, Australia. 28 - 1 November. ACM. pp. 4034 - 4042.Open Access Link Conference paper Zhou, F., Khushi, M., Brett, J. and Uddin, S. (2024) 'Graph neural network-based subgraph analysis for predicting adverse drug events'. Computers in Biology and Medicine, 183. pp. 1 - 13. ISSN: 0010-4825 Open Access Link Journal article He, J., Tran, NH. and Khushi, M. (2022) 'Stock Predictor with Graph Laplacian-Based Multi-task Learning'.The International Conference on Computational Science ICCS 2022. London, United Kingdom. 21 - 23 June. Springer International Publishing. pp. 541 - 553. ISSN: 0302-9743 Open Access Link Conference paper More publications(9)",
  "content_length": 9469,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:37"
}