{
  "name": "Matthias Wählisch",
  "homepage": "https://tu-dresden.de/inf/sya/netd/about/mw?set_language=en",
  "status": "success",
  "content": "Prof. Dr. Matthias Wählisch — Chair of Distributed and Networked Systems — TU Dresden Skip to main navigation Skip to main navigation Skip to search Skip to content Head of Group Name Prof. Dr. Matthias Wählisch Send email Send encrypted email via the SecureMail portal (for TUD external users only). Contact Information Organization Name Chair of Distributed and Networked Systems Chair of Distributed and Networked Systems Address work Visiting address: Andreas-Pfitzmann-Bau, Room 3111 Nöthnitzer Straße 46 01187 Dresden Show map of this location. Address postal Postal address: TUD Dresden University of Technology Faculty of Computer Science Institute of Systems Architecture Chair of Distributed and Networked Systems Helmholtzstr. 10 01069 Dresden work Tel. work Tel. Office hours: Stop by, or write an email to make an appointment. I hold the Chair of Distributed and Networked Systems at the Faculty of Computer Science at TU Dresden, and I am a Research Fellow of the Barkhausen Institut. Since 2025, I have been Vice Dean of the Faculty. More details in the complete CV. What I do. My research and teaching focus on scalable, reliable, and secure Internet communication. This includes the design and evaluation of networking protocols and architectures, as well as Internet measurements and analysis. My mission is to advance distributed and networked systems to positively impact the lives of people. The Internet is particularly important to me. I want to keep the Internet, its services, and applications open but secure, convinced that all pieces of the puzzle should be accessible to everyone. Beyond research. I'm actively involved in the IETF since 2005 and co-founded multiple successful open source projects such as RIOT and RTRlib. I am a co-founder of DD-IX, the Dresden Internet Exchange e.V. , a member of the Advisory Board of BCIX, the Berlin Internet Exchange Point, and INSO, the Internet Namespace Security Observatory supported by the Internet Society (ISOC). Where I publish. My work is published at conferences such as ACM CoNEXT, ACM IMC, USENIX Security, ACM SIGCOMM, and in journals such as ACM CCR, IEEE TNSM. I explicitly support reproducible research. Awards. My research has been awarded multiple times, e.g., the Best Paper Award and Best Community Award of ACM CoNEXT 2022, the Best of ACM SIGCOMM CCR 2019 and 2018. I'm the recipient of the Young Talents Award for Outstanding Achievements in Advancing the Internet and its Applications and the Chester W Sall Memorial Award. What I did before. I studied Computer Science and Contemporary German Literature at Freie Universität Berlin. I received my PhD in Computer Science with highest honors from FU Berlin and led the Internet Technologies Lab there. Furthermore, I am an associated member of the Internet Technologies (INET) research group at HAW Hamburg, and a co-founder of link-lab. You want to work with me, either in my group or writing your thesis? Please, consider this advice. Table of contentsPublications Invited Talks (Selection) Publications Note: The following content is from https://netd.cs.tu-dresden.de. Invited Talks (Selection) 11 Entries 2025 RIOT: The friendly open source IoT operating system Wählisch, M. (Speaker) 11 Mar 2025 Activity: Talk or presentation at external institutions/events > Talk/Presentation > Invited 2024 A Security and Reliability Perspective on FANETs Wählisch, M. (Speaker) 10 Oct 2024 Activity: Talk or presentation at external institutions/events > Talk/Presentation > Invited The Age of DDoScovery: An Empirical Comparison of Industry and Academic DDoS Assessments Wählisch, M. (Speaker) 19 Sep 2024 → 20 Sep 2024 Activity: Talk or presentation at external institutions/events > Talk/Presentation > Invited RIOT and DNS for a Resilient Smart Urban Infrastructure Wählisch, M. (Speaker) 22 Feb 2024 Activity: Talk or presentation at external institutions/events > Talk/Presentation > Invited 2023 QUIC, when transport evolves but security deployment does not Wählisch, M. (Speaker) 4 Dec 2023 Activity: Talk or presentation at external institutions/events > Talk/Presentation > Invited Currently on page 1 1 2 3 next This information is provided by the FIS. About this page Matthias Wählisch Last modified: Oct 13, 2025 Page Actions Share on Facebook Share on Twitter/X Print Page Send Page Via Email",
  "content_length": 4344,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:20"
}