{
  "name": "Matthias Mnich",
  "homepage": "https://www.tuhh.de/algo/homepage.html",
  "status": "success",
  "content": "ALGO: Homepage Institute for Algorithms and Complexity (E-11) Institute for Algorithms and Complexity (E-11) EN EN ALGO > Homepage Welcome to the Institute for Algorithms and ComplexityThe Institute for Algorithms and Complexity is a research institute of TUHH - Hamburg University of Technology. It researches the design and development of efficient algorithmic methods for the solution of important computational problems with impact in business, engineering, the social sciences, and beyond. It offers undergraduate and graduate education in the fields of algorithms, computational complexity, and mathematical optimization to the students of TUHH. Computer Science UnpluggedHier geht's zu Computer Science Unplugged. Job opportunities - we are hiring!We offer fully-funded PhD positions (salary level E13); check here for details. Institute missionInstitute visionInformation for TUHH studentsInformation for ERASMUS/international students Upcoming and recent activities2025October: Matthias Mnich is PC member of the 28th European Conference on Artificial Intelligence in Bologna, Italy.August: Matthias Mnich is PC member of the 31st International Computing and Combinatorics Conference in Chengdu, China.July: Paper accepted at Computer Science Review:  A survey on graph problems parameterized above and below guaranteed values (joint work by Gregory Gutin and Matthias Mnich).June: We participated at the MINT Experience Day to promote algorithmic foundations of computer science to 350 highschool kids.June: At the annual EIM Day of the School of Electrical Engineering, Computer Science and Mathematics, our PhD students presented their latest research to the local student and research community.March: Paper accepted at the ACM Transactions on Computation Theory: Space-efficient parameterized algorithms on graphs of low shrubdepth (joint work by Benjamin Bergougnoux, Vera Chekan, Mamadou Moustapha Kanté, Matthias Mnich, Sang-il Oum, Michał Pilipczuk and Erik Jan van Leeuwen).2024December: PhD student Matthias Kaul successfully defended his PhD thesis Parameterized Approximation Algorithms for Optimization Problems on Graphs. Congratulations, Matthias, and best wishes for your future academic journey!December: Paper accepted at the 42nd International Symposium on Theoretical Aspects of Computer Science (STACS) in Jena, Germany: Approximate minimum tree cover in all symmetric monotone norms simultaneously (joint work by Matthias Kaul, Kelin Luo, Matthias Mnich and Heiko Röglin).December: Paper accepted at the 42nd International Symposium on Theoretical Aspects of Computer Science (STACS) in Jena, Germany: Generalized Arrival for tree-like multigraphs (joint work by Ebrahim Ghorbani, Jonah Hoff and Matthias Mnich).December: Matthias Mnich is PC member of the 35th International Symposium on Algorithms and Computation, to be held in Sydney, Australia.October: Matthias Mnich is PC member of the 7th Creative Mathematical Sciences Conference, to be held in Trier, Germany.September: Matthias Mnich is PC member of the 32nd European Symposium on Algorithms, to be held at Royal Holloway, United Kingdom.August: Paper accepted at the Journal of Scheduling: Serial batching to minimize the weighted number of tardy jobs (joint work by Danny Hermelin, Matthias Mnich and Simon Omlor).August: Paper accepted at the 19th International Symposium on Parameterized and Exact Computation (IPEC) in Egham, United Kingdom: Single-machine scheduling to minimize the number of tardy jobs with release dates (joint work by Matthias Kaul, Matthias Mnich and Hendrik Molter).July: Paper accepted at the 27th International Conference on Approximation Algorithms for Combinatorial Optimization Problems (APPROX) in London, United Kingdom: A (3/2+1/e)-approximation algorithm for Ordered TSP (joint work by Susanne Armbruster, Matthias Mnich and Martin Nägele).July: We are now part of hqic (Hamburg Quantum Innovative Capital), which was officially kicked-off by the Second Mayor and Senator for Science, Research and Equality.May: We showcased our research activities at the EIMDay 2024 of the School of Electrical Engineering, Computer Science and Mathematics, where we showcase our research and teaching activities.April: Paper accepted at the 33rd International Joint Conference on Artificial Intelligence (IJCAI) in Jeju, South Korea: Efficient cost-minimization schemes for electrical energy demand satisfaction by prosumers in microgrids with battery storage capabilities (joint work by Laura Codazzi, Gergely Csaji and Matthias Mnich).April: Paper accepted at the 51st EATCS International Colloquium on Automata, Languages and Programming (ICALP) in Tallinn, Estonia: No polynomial kernels for knapsack (joint work by Klaus Heeger, Danny Hermelin, Matthias Mnich and Dvir Shabtay).For older news, check our list of past activities. ⇒ Recent Publications of the Institute for Algorithms and Complexity TU Hamburg Institute for Algorithms and Complexity Blohmstr. 15 21079 Hamburg E-mail : algo@tuhh.de Phone : +49 (40) 42878-4907 Links Contact Sitemap Activities",
  "content_length": 5079,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:15"
}