{
  "name": "Matthias Englert",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/matthias_englert",
  "status": "success",
  "content": "Matthias Englert Skip to main content Skip to navigation Matthias Englert email: M.Englert at warwick.ac.uk Office: University of Warwick Department of Computer Science Coventry CV4 7AL, United Kingdom Room: CS2.23 Phone: +44 24 7657 3784 See here for office hours. I am also affiliated with DIMAP. For students outside of Warwick, I do not offer any kind of internships at this time. Please excuse if I do not respond to such email requests. Program Committees ESA 2022, ICALP 2020, MFCS 2020, HALG 2020, SODA 2018, ESA 2017, SODA 2016, FUN 2016, STACS 2015, WAOA 2013, MedAlg 2012, ESA 2012 Publications The downloadable version of a publication is some version of the work. For the original publication see, for example, the publishers website or your favorite library. Adversarial Reprogramming Revisited Matthias Englert, Ranko Lazić In Proc. of the 36th NeurIPS (New Orleans, USA, 2022). To appear. [PDF | ©] Improved Approximation Guarantees for Shortest Superstrings using Cycle Classification by Overlap to Length Ratios Matthias Englert, Nicolaos Matsakis, Pavel Veselý In Proc. of the 54th STOC (Rome, Italy, 2022). [PDF | ©] Breaking the Barrier Of 2 for the Competiveness of Longest Queue Drop Antonios Antoniadis, Matthias Englert, Nicolaos Matsakis, and Pavel Veselý In Proc. of the 48th ICALP (Glasgow, Scotland, 2021). Pages 17:1-17:20. [PDF | ©] A Lower Bound for the Coverability Problem in Acyclic Pushdown VAS Matthias Englert, Piotr Hofman, Slawomir Lasota, Ranko Lazić, Jérôme Leroux, and Juliusz Straszyński Information Processing Letters, 167: 106079, 2021. [PDF | ©] Polylogarithmic Guarantees for Generalized Reordering Buffer Management Matthias Englert, Harald Räcke, and Richard Stotz In Proc. of the 60th FOCS (Baltimore, USA, 2019). Pages 38-59. [PDF | ©] Online Makespan Scheduling with Job Migration on Uniform Machines Matthias Englert, David Mezlaf, and Matthias Westermann In Proc. of the 26th ESA (Helsinki, Finland, 2018). Pages 26:1-26:14. Algorithica 83(12): 3537-3566, 2021. [PDF | ©] Reordering Buffers with Logarithmic Diameter Dependency for Trees Matthias Englert, and Harald Räcke In Proc. of the 28th SODA (Barcelona, Spain, 2017). Pages 1224-1234. [PDF | ©] Reachability in Two-Dimensional Unary Vector Addition Systems with States is NL-Complete Matthias Englert, Ranko Lazić, and Patrick Totzke In Proc. of the 31st LICS (New York, USA, 2016). Pages 477-484. [PDF | ©] Online Packet Scheduling for CIOQ and Buffered Crossbar Switches Kamal Al-Bawani, Matthias Englert, and Matthias Westermann In Proc. of the 28th SPAA (Asilomar State Beach, USA, 2016). Pages 241-250. [PDF | ©] Comparison-based FIFO Buffer Management in QoS Switches Kamal Al-Bawani, Matthias Englert, and Matthias Westermann In Proc. of the 12th LATIN (Ensenada, Mexico, 2016). Pages 27-40. [PDF | ©] Generalized Reordering Buffer Management Yossi Azar, Matthias Englert, Iftah Gamzu, and Eytan Kidron In Proc. of the 31st STACS (Lyon, France, 2014). Pages 87-98. [PDF | ©] New Bounds for Online Packing LPs Matthias Englert, Nicolaos Matsakis, and Marcin Mucha In Proc. of the 11th LATIN (Montevideo, Uruguay, 2014). Pages 318-329. [PDF | ©] Catch Them If You Can: How to Serve Impatient Users Marek Cygan, Matthias Englert, Anupam Gupta, Marcin Mucha, and Piotr Sankowski In Proc. of the 4th ITCS (Berkeley, USA, 2013). Pages 485-494. [PDF | ©] Multiple-Choice Balanced Allocation in (almost) Parallel Petra Berenbrink, Artur Czumaj, Matthias Englert, Tom Friedetzky, and Lars Nagel In Proc. of the 16th RANDOM (Cambridge, USA, 2012). Pages 411-422. [PDF | ©] Optimal Online Buffer Scheduling for Block Devices Anna Adamaszek, Artur Czumaj, Matthias Englert, and Harald Räcke In Proc. of the 44th STOC (New York, USA, 2012). Pages 589-598. [PDF | ©] An O(log k)-competitive Algorithm for Generalized Caching Anna Adamaszek, Artur Czumaj, Matthias Englert, and Harald Räcke In Proc. of the 23rd SODA (Kyoto, Japan, 2012). Pages 1681-1689. [PDF | ©] ACM Transactions on Algorithms, 15(1):6:1-6:18, 2019. Almost Tight Bounds for Reordering Buffer Management Anna Adamaszek, Artur Czumaj, Matthias Englert, and Harald Räcke In Proc. of the 43rd STOC (San Jose, USA, 2011). Pages 607-616. [PDF | ©] SIAM Journal on Computing 51(3): 701-722, 2022. Vertex Sparsifiers: New Results from Old Techniques Matthias Englert, Anupam Gupta, Robert Krauthgamer, Harald Räcke, Inbal Talgam-Cohen, and Kunal Talwar In Proc. of the 13th APPROX (Barcelona, Spain, 2010). Pages 152-165. [PDF | ©] SIAM Journal on Computing 43(4): 1239-1262, 2014. Oblivious Routing for the L_p-norm Matthias Englert and Harald Räcke In Proc. of the 50th FOCS (Atlanta, USA, 2009). Pages 32-40. [PDF | ©] Economical Caching with Stochastic Prices Matthias Englert, Berthold Vöcking, and Melanie Winkler In Proc. of the 5th SAGA (Sapporo, Japan, 2009). Pages 179-190. [PDF | ©] Economical Caching Matthias Englert, Heiko Röglin, Jacob Spönemann, and Berthold Vöcking In Proc. of the 26th STACS (Freiburg, Germany, 2009). Pages 385-396. [PDF | ©] ACM Transactions on Computation Theory 5(2): 4, 2013. The Power of Reordering for Online Minimum Makespan Scheduling Matthias Englert, Deniz Özmen, and Matthias Westermann In Proc. of the 49th FOCS (Philadelphia, USA, 2008). Pages 603-612. [PDF | ©] SIAM Journal on Computing 43(3): 1220-1237, 2014. Sensitivity of Wardrop Equilibria Matthias Englert, Thomas Franke, and Lars Olbrich In Proc. of the 1st SAGT (Paderborn, Germany, 2008), Pages 158-169. [PDF | ©] Theory of Computing Systems (special issue SAGT 2008), 47(1): 3-14, 2010. Reordering Buffers for General Metric Spaces Matthias Englert, Harald Räcke, and Matthias Westermann In Proc. of the 39th STOC (San Diego, USA, 2007), Pages 556-564. [PDF | ©] Theory of Computing, 6: 27-46, 2010. Worst Case and Probabilistic Analysis of the 2-Opt Algorithm for the TSP Matthias Englert, Heiko Röglin, and Berthold Vöcking In Proc. of the 18th SODA (New Orleans, USA, 2007), Pages 1295-1304. [PDF | ©] Algorithmica, 68(1):190-264, 2014. Considering Suppressed Packets Improves Buffer Management in Quality of Service Switches Matthias Englert and Matthias Westermann In Proc. of the 18th SODA (New Orleans, USA, 2007), Pages 209-218. [PDF | ©] SIAM Journal on Computing, 41(5): 1166-1192, 2012. Lower and Upper Bounds on FIFO Buffer Management in QoS Switches Matthias Englert and Matthias Westermann In Proc. of the 14th ESA (Zürich, Switzerland, 2006), Pages 352-363. [PDF | ©] Algorithmica (special issue ESA 2006), 53(4): 523-548, 2009. Evaluation of Online Strategies for Reordering Buffers Matthias Englert, Heiko Röglin, and Matthias Westermann In Proc. of the 5th WEA (Menorca Island, Spain, 2006), Pages 183-194. [PDF | ©] ACM Journal of Experimental Algorithmics (special issue WEA 2006), 14: 3.3-3.14, 2009. Reordering Buffer Management for Non-Uniform Cost Models Matthias Englert and Matthias Westermann In Proc. of the 32nd ICALP (Lisboa, Portugal, 2005), Pages 627-638. [PDF | ©] The Ising Model: Simple Evolutionary Algorithms as Adaptation Schemes Patrick Briest, Dimo Brockhoff, Bastian Degener, Matthias Englert, Christian Gunia, Oliver Heering, Thomas Jansen, Michael Leifhelm, Kai Plociennik, Heiko Röglin, Andrea Schweer, Dirk Sudholt, Stefan Tannenbaum, and Ingo Wegener In Proc. of the 8th PPSN (Birmingham, UK, 2004), Pages 31-40. [PDF | ©] Experimental Supplements to the Theoretical Analysis of EAs on Problems from Combinatorial Optimization Patrick Briest, Dimo Brockhoff, Bastian Degener, Matthias Englert, Christian Gunia, Oliver Heering, Thomas Jansen, Michael Leifhelm, Kai Plociennik, Heiko Röglin, Andrea Schweer, Dirk Sudholt, Stefan Tannenbaum, and Ingo Wegener In Proc. of the 8th PPSN (Birmingham, UK, 2004), Pages 21-30. [PDF | ©] Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 8116,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:06"
}