{
  "name": "Matthias Thimm",
  "homepage": "https://west.uni-koblenz.de/de/about-us/team/dr-matthias-thimm",
  "status": "success",
  "content": "Institute for Web Science and Technologies | Universität KoblenzZum Hauptinhalt springenZur Navigation springenZum Fußbereich springenMenüAnmelden ImpressumDatenschutzBarrierefreiheitGleichstellungsvertretungAnmeldenENFachbereich 4Institute for Web Science and TechnologiesPeople and Knowledge NetworksThe Institute for Web Science and Technologies (WeST) conducts research on many topics related to modern Web technologies and publishes research papers at leading conferences and high-ranking journals. We pursue foundational and technical advancements in fields such as data science, information access, and computational social science with the aim of better understanding the Web's impact on our society.Our mission statementInternet users discuss, communicate, search, rate and buy on the World Wide Web (WWW). Our mission at WeST is to contribute to a better understanding of the technical and human behavioural dimensions of the WWW. We see the web as a complex, distributed, networked, and heterogeneous system of information technologies and services. Understanding the interplay of all these dimensions involves a multi-disciplinary view and a sound knowledge of methods, tools, and applications related to web technologies. Thus, our aim is to develop tools, methods, and applications that advance scientific and societal understanding of the web and contribute to its design and evolution.At WeST we are committed to high-class research with high academic and practical impact. We maintain a culture that is conducive to external exploitation of generated knowledge, for example, in the form of spin-offs. We are internationally oriented and retain multiple close research collaborations with various public and private research institutions.Students at WeST obtain knowledge of the technical and relational functioning of the Web and gain a sound knowledge about methods and techniques to analyse the Web. Successful students will be able to apply these methods and techniques in different contexts such as government, private companies or research institutions.Doctoral researchers will find a research-driven environment with a plethora of support options. We are internationally oriented and facilitate frequent exchanges with partner institutions. Moreover, we support and demand participations at highly-ranked conferences for which researchers will find assistance at Post-Doc and Professor levels.Our research is characterised by intense research collaborations with domestic and international research partners. We are concerned with up-to-date research questions and challenges and committed to practical solutions. Privately and governmentally funded research projects provide us with the resources necessary to reach our goal of high-class research.Interested industry partners will find a valuable and trustworthy partner in WeST. We are interested in long-lasting relationships and offer a number of different services concerning the Web.TeamThe WeST Institute consists of an international team of professors, experienced researchers, doctoral students, and professional services staff. We are supported by student assistants who contribute to research and teaching. Institute MembersResearchWeST members perform research on a large number of topics that evolve around the World Wide Web and how people use it. The web is a virtual space for people to interact and share experiences. A core focus is on the analysis of data-driven applications, their application in the context of digital transformation, and their wide ranging and often disruptive impact on society.The WeST Institute has a strong record of collaborations with national and international partners from the scientific community and industry. These fruitful collaborations allow us to bring our cutting-edge technologies into the world.For our research, we can rely on an IaaS cloud infrastructure capable of handling big data. In addition, we are in progress of setting up a state-of-the-art usability lab to enable further research on data-driven applications.Transparency, reproducibility, and open access are at the core of our work. Most of our research papers can be downloaded from open access repositories. In addition, we have made available various research prototypes and datasets under open licenses. Researchers all over the world use resources that got prepared and published by WeST.Research ProjectsStudyWe coordinate the MSc in Web and Data Science and BSc in Computational Social Science programmes. The objective of these programmes is to achieve a foundational understanding of Web and data-intensive systems and how they relate to techno-sociological interactions. Our core modules focus on data science, machine learning, web science, network theory, and big data. In addition, we offer elective modules on human-centered artificial intelligence, foundation models, information retrieval, and recommender systems , as well as research labs and seminars. These modules are also open to students of other programmes.We supervise Bachelor and Master theses in which students independently explore research questions, e.g., to gain a quantitative understanding of the world or to shed light on the impact of Web and data-intensive systems on society. Modules offeredActivitiesMembers of WeST engage in the organisation of many international conferences and workshops as well as in events for the regional and wider public. Some highlights are listed below.Academic conferences (selection)ACM SIGIR International Conference on Human Information Interaction and Retrieval, 2024ACM International Conference on Information and Knowledge Management, 2023Int. Semantic Web Conference, 201543. Jahrestagung der Gesellschaft für Informatik, 2013Int. Semantic Web Conference, 2011ACM Web Science Conference, 2011European Conference on Information Retrieval, 2011European Summer School on Information Retrieval, 2011Dissemination activities (selection)Search Solutions, London (2022)Nacht der InformatikNewsJobsContactProf. Dr. Frank HopfgartnerZum ProfilAddress for visitorsUniversität KoblenzCampus KoblenzGebäude BUniversitaetsstrasse 156070 KoblenzGermanySocial mediaTwitterFacebookLinkedInSilke WergerZum ProfilPostal addressUniversität KoblenzInstitute for Web Science and TechnologiesPostfach 201 60256016 KoblenzGermanyFACHBEREICHEBildungswissenschaftenPhilologie / KulturwissenschaftenMathematik / NaturwissenschaftenInformatikSCHNELLEINSTIEGOnline DiensteTermine und FristenStudierendenwerkKarriereFOLGE UNS Newsroom / PresseCorporate DesignUNIVERSITÄT KOBLENZUniversitätsstraße 156070 KoblenzAnfahrt und Campusplan+49 261 287 - 0 service@uni-koblenz.de Meine UniImpressumDatenschutzBarrierefreiheitGleichstellungsvertretung© Universität Koblenz",
  "content_length": 6755,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:20"
}