{
  "name": "Matthew D. Sinclair",
  "homepage": "http://pages.cs.wisc.edu/~sinclair",
  "status": "success",
  "content": "Homepage of Matt Sinclair Skip to main content University of Wisconsin–Madison Menu Matt Sinclair Assistant Professor, Computer Sciences Department Affiliate, Electrical & Computer Engineering Department Affiliate, Teaching Academy My Work: Modern computing systems are becoming increasingly heterogeneous, a trend that is likely to continue in the coming years. My research focuses on how to design, program, and optimize these future systems. Most of my work thus far has focused on designing tools, writing efficient software, and proposing efficient architectural changes to general-purpose accelerators like GPUs. In 2018, I joined the University of Wisconsin-Madison as an Assistant Professor in the Computer Sciences Department, where I lead the Heterogeneous Architectures Lab (HAL) research group. Recent News: June 2025: Akanksha, Matt, & Vishnu present at the 2025 SRC AIHW Review! June 2025: Matt & Yu present three talks at the 6th gem5 Users' Workshop! June 2025: Matt co-hosts the 6th gem5 Users' Workshop at ISCA 2025! News Archive Bio: I am an Assistant Professor in the Computer Sciences Department, an affiliate faculty member of the Electrical & Computer Engineering Department, and an affiliate of the Teaching Academy at the University of Wisconsin-Madison. I am primarily a computer architect, although my work also includes other areas such as operating systems and parallel programming. Moreover, I am also passionate about designing the tools used to study future heterogeneous systems, including serving as a member of the gem5 Project Management Committee. As an instructor at UW-Madison, I am currently part of the Excel Initiative, and was previously a Madison Teaching & Learning Fellow. I also am the current steward for the ISCA Hall of Fame. My research has been recognized several times, including with an NSF CAREER award, a 2018 ACM Doctoral Dissertation Award nomination, a Qualcomm Innovation Fellowship, the 2018 David J. Kuck Outstanding PhD Thesis Award, an ACM SIGARCH - IEEE Computer Society TCCA 2018 Outstanding Dissertation Award Honorable Mention, two Mavis Future Faculty Fellowships, a Feng Chen Memorial Award, and W.J. Poppelbaum Award, and Saburo Muroga Fellowship. Previously, I completed my PhD in Computer Architecture in the Computer Science Department at the University of Illinois at Urbana-Champaign under the supervision of Sarita Adve. During my PhD I interned at NVIDIA Research and after my PhD I was a postdoc at AMD Research; at both AMD and NVIDIA my work focused on optimizing future GPU memory systems. Interested Students: Although my website updates sometimes lag, usually I am recruiting strong students -- if you are interested in writing high performance software or designing efficient hardware for future heterogeneous systems, please contact me and include your CV! Moreover, in the email please describe an instance where you optimized something (hardware, software, algorithms, etc.), and what you liked and disliked about the process. Contact: Email (preferred): sinclair 'at' cs 'dot' wisc 'dot' edu On-Campus: 6369 Computer Sciences Computer Sciences Department University of Wisconsin-Madison",
  "content_length": 3177,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:50"
}