{
  "name": "Matthew O'Toole",
  "homepage": "https://www.ri.cmu.edu/ri-faculty/matthew-otoole",
  "status": "success",
  "content": "Warning: You are viewing this site with an outdated/unsupported browser. Please update your browser or consider using a different one in order to view this site without issue. For a list of browsers that this site supports, see our Supported Browsers page. Matthew O'Toole - The Robotics Institute - CMU Skip to content Matthew O’Toole Associate Professor Home Department: RI Office: 215 Elliot Dunlap Smith Hall Personal Homepage Administrative Assistant: Christine Downey Lab: Computational Imaging at CMU Statement Research Publications Students/Affiliates I am an Assistant Professor with the Robotics Institute and Computer Science Department in the School of Computer Science at Carnegie Mellon University. My research interests span many topics across computer graphics and computer vision, but I’m particularly interested in computational imaging: a field that combines optics, electronics, and computational processing to capture or display new forms of visual information. Prior to joining CMU, I was a Banting Postdoctoral Fellow with Gordon Wetzstein‘s Computational Imaging group at Stanford University. Before that, I received my Ph.D. in Computer Science at the University of Toronto under the supervision of Kyros Kutulakos in 2016, along with an M.Sc. in 2009. I took a break from Toronto in 2011 to be a visiting student with the MIT Media Lab’s Camera Culture group led by Ramesh Raskar. I also completed an undergraduate degree in honours Computer Science and Mathematics from the University of British Columbia in 2007 under the supervision of Abhijeet Ghosh and Wolfgang Heidrich, and worked for various companies including NVIDIA, EA, and MDA. I spend a lot of time thinking about computational imaging, a field that combines optics, electronics, and processing in new and interesting ways to capture and display visual information. In particular, I’m interested in using programmable lights and cameras to analyze the world around us. My work was the recipient of a couple of runner-up best paper awards at ICCV 2007 and CVPR 2014, best demo awards at CVPR 2015 and ICCP 2015, and a runner-up dissertation award at SIGGRAPH 2017. I was also a co-oraganizer of the CVPR workshop on Computational Cameras and Displays in 2016 and 2017, and taught a course on the subject at SIGGRAPH 2014. My research is supported by the Banting Postdoctoral Fellowships program administered by the Government of Canada. Research Topics Imaging 3-D Vision and Recognition Sensing and Estimation Computer Vision Rendering Multisensor Data Fusion Graphics & Creative Tools Sensing & Perception Robotics Foundations Displaying 29 Publications current phd students Sally Chen current masters students Shengxi Wu current affiliates Jack Naylor past phd students Benjamin Attal past masters students Shirsendu Halder Aarrushi Shandilya",
  "content_length": 2834,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:01"
}