{
  "name": "Matthew Lentz",
  "homepage": "http://www.cs.umd.edu/~mlentz",
  "status": "success",
  "content": "Matthew Lentz - Duke University - Home Matthew Lentz Assistant Professor Duke Systems Group Department of Computer Science Duke University mlentz@cs.duke.edu I'm an Assistant Professor of Computer Science at Duke University. Before joining Duke in Fall 2021, I was a Postdoctoral Researcher in the VMware Research Group; since then, I've continued my collaborations with VMware as an Affiliated Researcher. I received my PhD in Computer Science from University of Maryland, advised by Bobby Bhattacharjee. I enjoy working broadly at the intersection of systems, networking, and security. My current research focuses on two directions: 1) introducing new abstractions and tools for building (and reasoning about) secure, trustworthy software systems, 2) building systems that improve performance for modern networking and machine learning applications. While those are my main directions, I have other ongoing projects that range from network performance measurement to security threat analytics. I'm always looking for interested students. Look here for how to get in touch with me. Recent Teaching See here for a complete list. Spring 2026 - Introduction to Computer Systems (CPS 210) Fall 2025 - Operating Systems (CPS 510) Spring 2025 - Introduction to Operating Systems (CPS 310) Spring 2024 - Secure Software Systems (CPS 585) Students Current PhD Alexander Du (with Danyang Zhuo) PhD Chenyang Liu (with Kartik Nayak) PhD Luka Duranovic Recently Graduated PhD Yongji Wu (with Danyang Zhuo) → Postdoc at UC Berkeley Selected Publications See here for a complete list. LLM.265: Video Codecs are Secretly Tensor Codecs Ceyu Xu, Yongji Wu, Xinyu Yang, Beidi Chen, Matthew Lentz, Danyang Zhuo, Lisa Wu Wills MICRO 2025 - Best Paper Award articlePaper Can Large Language Models Verify System Software? A Case Study Using FSCQ as a Benchmark Jianxing Qin, Alexander Du, Danfeng Zhang, Matthew Lentz, Danyang Zhuo HotOS 2025 articlePaper slideshowTalk codeCode Plato: Plan to Efficient Decode for Large Language Model Inference Shuowei Jin, Xueshen Liu, Yongji Wu, Haizhong Zheng, Qingzhao Zhang, Atul Prakash, Matthew Lentz, Danyang Zhuo, Feng Qian, Zhuoqing Mao COLM 2025 articlePaper DrSec: Flexible Distributed Representations for Efficient Endpoint Security Mahmood Sharif, Pubali Datta, Andy Riddle, Kim Westfall, Adam Bates, Vijay Ganti, Matthew Lentz, David Ott IEEE S&P 2024 articlePaper MCCS: A Service-based Approach to Collective Communication for Multi-Tenant Cloud Yongji Wu, Yechen Xu, Jingrong Chen, Zhaodong Wang, Ying Zhang, Matthew Lentz, Danyang Zhuo SIGCOMM 2024 articlePaper slideshowTalk codeCode homeProject Remote Procedure Call as a Managed System Service Jingrong Chen*, Yongji Wu*, Shihan Lin, Yechen Xu, Xinhao Kong, Thomas Anderson, Matthew Lentz, Xiaowei Yang, Danyang Zhuo NSDI 2023 articlePaper slideshowTalk codeCode homeProject Serving and Optimizing Machine Learning Workflows on Heterogeneous Infrastructures Yongji Wu, Matthew Lentz, Danyang Zhuo, Yao Lu VLDB 2023 articlePaper codeCode Dissecting Overheads of Service Mesh Sidecars Xiangfeng Zhu, Guozhen She, Bowen Xue, Yu Zhang, Yongsu Zhang, Xuan Kelvin Zou, XiongChun Duan, Peng He, Arvind Krishnamurthy, Matthew Lentz, Danyang Zhuo, Ratul Mahajan SoCC 2023 articlePaper slideshowTalk codeCode Acknowledgements I'd like to thank the following organizations for their support of my research:",
  "content_length": 3380,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:58"
}