{
  "name": "Matt Lease",
  "homepage": "https://mattlease.com",
  "status": "success",
  "content": "Matthew Lease Matthew Lease Professor School of Information University of Texas at Austin 1616 Guadalupe Ste 5.202 Austin, TX 78701-1213 Location & Directions • Parking map Voice: (512) 471-9350 • Fax: (512) 471-3971 Office: UTA 5.536 • Lab: UTA 5.520 Campus box: D8600 • Lab: Artificial Intelligence and Human-Centered Computing (AI&HCC) Papers • Talks (Videos & Slides) • Data & Software Google Scholar • CV • LinkedIn • bsky • Twitter/X • UT Experts Affiliations (Professional): ACM Distinguished Member • AAAI Senior Member Affiliations (UT Academics): Information • Computer Science Affiliations (UT Research): Texas AI and Machine Learning • Natural Language Processing • Oden Institute • Texas Computing Advisory Boards: JASIS&T • Texas Advanced Computing Center (TACC) • UT Austin-Amazon Science Hub (launch) Co-Director: NSF-Simons AI Institute for Cosmic Origins (CosmicAI, launch, 2024-2029) Leadership Team: Good Systems, a UT Austin Grand Challenge to design responsible AI technologies (2019-2027) PI: Designing Responsible AI Technologies to Protect Information Integrity, a Good Systems 6-year research project (2021-2027) Teaching INF385T.03/CS395T (Human Computation and Crowdsourcing) (Fall 2025) Research Areas (broad): Artificial Intelligence (AI) • Human-Computer Interaction (HCI) Areas (specific): Crowdsourcing & Human Computation (HCOMP) • Fair & Explainable AI • Information Retrieval (IR) • Natural Language Processing (NLP) Overview: My lab creates novel datasets, builds AI models, and evaluates model performance and end-user impacts, predominantly on natural language tasks. When automated AI falls short, we design human-in-the-loop approaches supported by AI model explanations and creative user interfaces. To promote fair AI, we design better ways to annotate data without bias and modeling techniques to mitigate dataset biases. We conduct fundamental research, applied to real-world problems that matter, as part of UT Austin's Good Systems Grand Challenge to design responsible AI technologies. One theme of ongoing work is automated, human-in-the-loop, and human-safe practices to safeguard the information environment online against threats such as hate speech, extremism, and foreign influence. Brief Biography. Matthew Lease is a Distinguished Member of the Association for Computing Machinery (ACM), a Senior Member of the Association for the Advancement of Artificial Intelligence (AAAI), and an Amazon Scholar. Lease co-directs the $20M NSF-Simons AI Institute for Cosmic Origins (CosmicAI) and is a faculty founder and leader of UT's Good Systems, an eight-year, $20M university-wide Grand Challenge aimed at designing responsible AI technologies. In 2023-2024, Lease was invited four times to address the Texas Legislature on responsible AI. His recent awards include the 2024 Inaugural Test of Time Paper Award at the AAAI Conference on Human Computation and Crowdsourcing (HCOMP), the 2024 Most Influential Paper Award at the IEEE/ACM International Conference on Automated Software Engineering (ASE), 2024 Best Paper Honorable Mention at the ACM Conference on Computer Supported Cooperative Work (CSCW), Best Student Paper at the 2022 Conference on Information Systems and Technology (CIST), the Conference Award Track in the Journal of Artificial Intelligence Research (JAIR, 2020), and Best Student Paper at the 2019 European Conference for Information Retrieval (ECIR). Lease is also the recipient of three Early Career awards: from the Defense Advanced Research Projects Agency (DARPA), the National Science Foundation (NSF), and the Institute for Museum and Library Sciences (IMLS). Lease received degrees in Computer Science from Brown University (PhD, MSc) and the University of Washington (BSc). HISTORICAL CONTENT SELECTED PAST RESEARCH EVENTS HCOMP 2014 Doctoral Consortium (with Loren Terveen) TREC 2011-2013 Crowdsourcing Track (with Gabriella Kazai & Mark Smucker) HCOMP 2013 Workshop: CrowdScale: accepted papers & shared task challenge (with Tatiana Josephy & Praveen Paritosh) CrowdConf 2013 Research Track (with Paul Bennett) -- see brief interview Springer Information Retrieval: April 2013 Special Issue on Crowdsourcing (volume 16 no. 2) SWIRL 2012: Second Strategic Workshop on Information Retrieval in Lorne SIGIR 2011 Workshop on Crowdsourcing for Information Retrieval (July 28, 2011) WSDM 2011 Workshop on Crowdsourcing for Search and Data Mining (CSDM 2011), with Vitor Carvalho and Emine Yilmaz (February 9, 2011) TREC 2010 Relevance Feeback Track, with Chris Buckley and Mark Smucker (November 17-19, 2010) SIGIR 2010 Workshop on Crowdsourcing for Search Evaluation (CSE2010), with Vitor Carvalho and Emine Yilmaz (July 23, 2010) SELECTED PAST TALKS (slides on SlideShare, some videos on lab webpage) Panel Talk at Microsoft Faculty Summit: Video · Abstract (July 15, 2014) Tutorial at SIAM 2013 Data Mining Conference on Crowdsourcing & Human Computation (May 3) Invited Talk at ID360 Conference: Amazon's Mechanical Turk is Not Anonymous (May 1, 2013) 2012 Frontiers of Information Science and Technology (FIST) Invited Talk (December 12) MetroCon 2012 (IEEE) Invited Talk: The Rise of Crowd Computing (October 11) SIGIR 2012 Tutorial: Crowdsourcing for Search Evaluation and Social-Algorithmic Search (with Omar Alonso) SBP 2012 Invited Talk for Challenge Award (April 3, slides) IJCNLP 2011 Invited Keynote Crowd Computing: Opportunities and Challenges (Nov 10, slides) CrowdConf 2011 Tutorial: Crowdsourcing for Research & Engineering (with Omar Alonso, Nov 1, press, slides) SIGIR 2011 Tutorial on Crowdsourcing for Information Retrieval: Principles, Methods, and Applications (with Omar Alonso, July 24, slides) UT Austin School of Information Advisory Council talk: Crowdsourcing & Human Computation (April 15, 2011) UT Austin Linguistics Colloquium: Crowdsourcing for Natural Language Processing (February 28, 2011, slides) WSDM 2011 Tutorial: Crowdsourcing 101: Putting the WSDM of Crowds to Work for You (with Omar Alonso, February 9, slides) SELECTED PAST NEWS Two papers presented at ACL 2017; read the story (August 3, 2017) Using Crowds to Teach AI How to Search Smarter (August 16, 2017) Grant for developing Arabic Websearch technologies (November 4, 2015) Version 2.0 released of SQUARE: benchmarking Software for aggregating crowd responses (October 26, 2015) We have two papers appearing at AAAI HCOMP 2015 (June 17, 2015) Hyun Joon Jung Receives 2015 Samsung Human-Tech Paper Award (Feburary 11, 2015) Amazon's Mechanical Turk is Not Anonymous: Blog 3/6/13 · Paper 3/7/13 · TheVerge 3/7/13 · Press Release 3/27/13 · Talk 5/1/13 The Future of Crowd Work: Paper 12/12/12 · Blog 2/6/13 · Press Release 2/7/13 · New Scientist 2/7/13 · New York Times 3/18/13 Quoted in TechTarget: Predictive coding plus crowdsourcing could cure e-discovery challenges (September 24, 2015) MIT Technology Review: Baiduâs Duer Joins the Virtual Assistant Party (September 10, 2015) Speech Technology: Siri-ous Influence: Enterprise Virtual Assistants Have Arrived (November 10, 2012) Austin American Statesman: Digital Savant: Sensors bringing technology ever nearer (October 23, 2012) (UT Research Alert coverage) Science News: Digital bounty hunters unleashed (October 31, 2011) Data Breach Examiner: Privacy Without Borders: The Ins and Outs of Outsourcing (August 2011) SELECTED PAST FUNDING IMLS LB21CL Early Career ONR Yahoo! Faculty Research Award Amazon New York Community Trust (August 2, 2012) LIFT award: announcement (August 4, 2010) and follow-on article (March 11, 2011) Amazon sponsorship for TREC Crowdsourcing Track (August 31, 2010) Portugal FCT (July 26, 2010) Android.edu (April 23, 2010) Amazon (March 23, 2010) SELECTED PAST UT AUSTIN EVENTS Yahoo! - UT Austin iSchool Seminar Series UT Austin iSchool Open House: 2013 · 2012 · 2011 · 2010 UT Austin Workshop on Student Research in Information Retrieval and Web Search (May 7 & 13, 2010) PAST AFFILIATIONS Brown Laboratory for Linguistic Information Processing (BLLIP), Department of Computer Science, Brown University Center for Intelligent Information Retrieval (CIIR), Department of Computer Science, University of Massachusetts Amherst (lab reunion at SIGIR'09) Spoken Language Systems Laboratory (LSV), Saarland University Institute of Formal and Applied Linguistics (UFAL), Charles University Intel Research Seattle at the University of Washington My Ph.D./M.D. brother Kevin Lease makes iPhone applications for doctors, particularly for geriatrics Information Science involves a surprising amount of flexibility Thanks to Vance Faber I have a pseudo Erdös number of 2. Nothing more to accomplish, right?",
  "content_length": 8660,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:41"
}