{
  "name": "Matthew S. Goodwin",
  "homepage": "http://www.northeastern.edu/bouve/directory/matthew-goodwin",
  "status": "success",
  "content": "Matthew Goodwin - Bouvé College of Health Sciences Skip to main content View all people Matthew Goodwin PhD Professor; Associate Chair for Research, Department of Public Health and Health Sciences; Chair, College Research Committee Public Health and Health Sciences 312E RB [email protected] Curriculum Vitae Education and Degrees Postdoc, Media Lab, Massachusetts Institute of Technology, Cambridge, MAPhD, Behavioral Science, Department of Psychology, University of Rhode Island, South Kingston, RIMA, Experimental Psychology, Department of Psychology, University of Rhode Island, South Kingston, RIBA, Psychology, Wheaton College, Norton, MADepartment of PsychologyCertificate, Psychology and Philosophy, St. Clare’s College, Oxford, EnglandCurrent Academic Appointments and Affiliations Interdisciplinary Associate Professor with Khoury College of Computer ScienceCo-Founder, Personal Health Informatics Doctoral ProgramDirector, Computational Behavioral Science LaboratoryAffiliationsResearch Development Lead, Roux InstituteHonors and AwardsMatilda White Riley Early-Stage Investigator, National Institutes of HealthAspen Institute Health ScholarCareer Contribution Award, Princeton Autism Lecture SeriesHariri Award for Transformative Computational ScienceBest Paper Award, 11th International Conference on Ubiquitous Computing (Ubicomp) Research Interests Personal health informatics, computational behavioral assessment, ambulatory psychophysiology, machine learning Overview Dr. Matthew S. Goodwin is jointly appointed in the Bouvé College of Health Sciences and the Khoury College of Computer Sciences, where he is a founding member of the Personal Health Informatics doctoral program and Directs the Computational Behavioral Science Laboratory. Goodwin has held appointments at Harvard Medical School as a Visiting Associate Professor in the Department of Biomedical Informatics (2018-2020), Brown University as an Adjunct Associate Professor of Psychiatry and Human Behavior (2008-2018), and the MIT Media Lab as Director of Clinical Research (2008-2011). He has also served on the Executive Board of the International Society for Autism Research (2005-2008) and the Scientific Advisory Board for Autism Speaks (2014-2017). He has over 25 years of research and clinical experience working with children and adults on the autism spectrum and developing and evaluating innovative technologies for behavioral assessment and intervention, including video and audio capture, telemetric physiological monitors, accelerometry sensors, and digital video/facial recognition systems. Goodwin has received several honors, including a dissertation award from the Society of Multivariate Experimental Psychology, Peter Merenda Prize in Statistics and Research Methodology, Hariri Award for Transformative Computational Science, a career contribution award from the Princeton Autism Lecture Series, and named an Aspen Ideas Scholar by the Aspen Institute and Matilda White Riley Early-Stage Investigator by the National Institutes of Health. He has obtained research funding from a variety of sources, including the National Institutes of Health, National Science Foundation, National Endowment for the Arts, Defense Advanced Research Project Agency, Department of Defense, Simons Foundation, Nancy Lurie Marks Family Foundation, and Autism Speaks. Recent Publications Goodwin, MS, Mazefsky, CA, Ioannidis, S, Erdogmus, D, Siegel, M (2019). Predicting aggression to others in youth with autism using a wearable biosensor. Autism Research, 12, 1286-1296* Use of machine learning to improve autism screening and diagnostic instruments: Effectiveness, efficiency, and multi-instrument fusion Journal of Child Psychology and Psychiatry, January 1, 2016 Bone, D, Bishop, S, Black, M, Goodwin, MS, Lord, C, & Narayanan, S Applying machine learning to facilitate autism diagnostics: Pitfalls and promises Journal of Autism and Developmental Disorders, January 1, 2015 Bone, D, Goodwin, MS, Black, M, Lee, C, Audhkhasi, K, & Narayanan, S Automated detection of stereotypical motor movements Journal of Autism and Developmental Disorders, January 1, 2011 Goodwin, MS, Intille, SS, Albinali, & Velicer, WF Enhancing and accelerating the pace of autism research and treatment: The promise of developing innovative technology Focus on Autism and Other Developmental Disabilities, January 1, 2008 Goodwin, MS Currently Funded Projects “Predicting Situational Onset of Aggression in Minimally Verbal Youth with Autism Using Biosensor Data & Machine Learning Algorithms.” Department of Defense, Autism Research Program, Idea Development Award. Goodwin PI. Sep 2018 – Aug 2021. “Developing Novel Analytics for Ambulatory Electrodermal Activity Data.” Simons Foundation for Autism Research Initiative. Goodwin PI. Dec 2017 – Nov 2018. “Development and Evaluation of a Simulated Prototype to Dynamically Adjust Ambient Environments to Promote Affective Regulation in Individuals with Autism Spectrum Disorder.” ACL National Institute on Disability, Independent Living, and Rehabilitation Research, SBIR Phase I. Goodwin Subcontract PI, Spacefactory PI. Jul 2017- Dec 2017. “Developing and Implementing a Framework for Evidence-Based Practice for Technology Relevant for Autism.” FIRAH, Foundation Orange, UEFA Foundation for children. Grynszpan PI, Université Pierre et Marie Curie, M. Brosnan PI, University of Bath, Goodwin Co-PI, Northeastern University, Fletcher-Watson Co-PI, University of Edinburgh, Hererra Co-PI, University of Valencia. May 2017 – Apr 2019. Consulting on Active Grants “Attentional, temperamental, and physiological process underlying anxiety in preschoolers with ASD.” NICHD (1RO1MH111652-01). Chawarska PI, Yale University. Mar 2017 – Jan 2022. “UCLA Center for Translational Research in Neurodevelopment: UC-TRaN.” NICHD (1 U54 HD087101-01). Bookheimer PI, University of California Los Angeles. Nov 2015 – May 2020. “Biomarkers of Emotion Regulation, Social Response & Social Attention in ASD.” Clinical Research Associates/Simons Foundation for Autism Research Initiative. Sheinkopf PI, Brown University. Sep 2015 – Sep 2018. “Clinical and Behavioral Phenotyping of Autism and Related Disorders.” NIMH (1ZIAMH002868-09). Swedo PI, National Institute of Mental Health. Sep 2015 – Aug 2020. “Change-Sensitive Measurement of Emotion Dysregulation in ASD.” NICHD (R01-HD079512). Mazefsky PI, University of Pittsburgh. Sep 2014 – May 2019. “The Autism Inpatient Collection: Developing a Unique, Severely Affected Cohort to Accelerate Discovery and Targeted Treatment of Autism Subtypes.” Simons Foundation and Nancy Lurie Marks Family Foundation. Siegel PI, Maine Medical Center. Oct 2013 – Sep 2018. Selected Public Service NIH Loan Repayment Program AmbassadorThree Dot Dash Mentor Courses Theoretical Foundations in Personal Health InformaticsEvaluating Scientific EvidenceHealthcare ResearchPrinciples of Epidemiology GOOGLE SCHOLAR LINK IN THE MEDIA YOU ARE BOUVÉ Connect with us Have more questions about Bouvé? We’re here to help. Apply now Want to take the next step and start your journey at Bouvé? Apply Request more information Interested in learning more about what Bouvé has to offer? Get more info",
  "content_length": 7216,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:03"
}