{
  "name": "Matthew Brian Blaschko",
  "homepage": "https://homes.esat.kuleuven.be/~mblaschk",
  "status": "success",
  "content": "Personal Page of Matthew Blaschko Prof. dr. Matthew B. Blaschko Center for Processing Speech & Images KU Leuven Room: 01.05 Kasteelpark Arenberg 10 - box 2441 3001 Leuven Belgium +32 16 37 44 11 Visitor Directions, Short Bio, Vacancies I am director of the KU Leuven ELLIS unit and a fellow in the ELLIS Health program, part of the European Laboratory for Learning and Intelligent Systems. I am a Core PI in the Flanders AI Research Program, and workpackage lead for (i) Decision Support Systems and (ii) Medical Imaging. I am a member of the KU Leuven Institute for Artificial Intelligence and one of the leaders of the working group on Machine Learning and Data Science. If you are interested in a PhD position, please email your CV and a short motivation. I am co-organizer of the \"Another Brick in the AI Wall: Building Practical Solutions from Theoretical Foundations\" workshop at CVPR 2025. Technology developed in my research is incorporated into MONA, software for ophthalmic image analysis. I co-organized the Commands 4 Autonomous Vehicles workshop and challenge at ECCV 2020. I co-organized the 2nd Learning from Limited Labeled Data (LLD) Workshop: Representation Learning for Weak Supervision and Beyond at ICLR 2019. I co-organized the NIPS 2017 workshop on Learning with Limited Labeled Data: Weak Supervision and Beyond. Education: (Mathematics Genealogy) Habilitation (HDR)École Normale Supérieure de Cachan Newton International FellowUniversity of Oxford Dr. rer. nat.Max Planck Institutes Tübingen, awarded by the Technische Universität Berlin M.S.University of Massachusetts Amherst B.S.Columbia University I would like to thank the following funding sources for supporting my research: Teaching: Statistische methoden voor biomedische signaal- en beeldanalyse (B-KUL-H0H61A). Course material is available via TOLEDO. Multimedia Technology and Coding (B-KUL-H09P9A). All course material is available via TOLEDO. CVIT 6th Summer School on AI, 2022. Computer Vision (B-KUL-H02A5A) - Spring 2020. All course material is available via TOLEDO. Data Science Summer School, École Polytechnique, 2019. Studium Generale 2018 - Artificial Intelligence. All course material is available via TOLEDO. International Summer School on Data Science, Split, Croatia, September 25-29, 2017. Students and researchers: Deniz Soysal, KU Leuven, Ph.D. student. Claire Marchal, KU Leuven, Ph.D. student. Dongli Xu, KU Leuven, Ph.D. student. Sebastian Gruber, KU Leuven, Postdoc. Jiameng Li, KU Leuven, Ph.D. student. Marco Mezzina, KU Leuven, Ph.D. student. Mingshi Li, KU Leuven, M.Sc. 2022, Ph.D. student. Wangduo Xie, KU Leuven, Ph.D. student. Karel Moens, KU Leuven, Ph.D. student. Margot Verhulst, KU Leuven, Ph.D. student. Huy Hoang Nguyen, University of Oulu, Ph.D. student. Teodora Popordanoska, KU Leuven, Ph.D. 2025. Postdoc.Thesis: Advancing Calibration in Deep Learning: Theory, Methods, and Applications. Han Zhou, KU Leuven, Ph.D. 2025.Thesis: Estimation and Optimization Under Uncertainty. Chang Tian, KU Leuven, Ph.D. 2025.Thesis: Deep Learning for Human Computer Communication. Klara Gawor, KU Leuven, Ph.D. 2025.Thesis: Heterogeneity of Alzheimer’s disease: co-pathologies, APOE ε4, and hippocampal degeneration. Christos Theodoropoulos, KU Leuven, Ph.D. 2025.Thesis: Deep Learning Models for Extraction of Knowledge from Text. Zifu Wang, KU Leuven, Ph.D. 2025.Thesis: On Neural Architectures, Loss Functions, Evaluation Metrics for Semantic Segmentation. Junyi Zhu, KU Leuven, Ph.D. 2024. Thesis: Privacy-Preserving and Distributed Machine Learning. Enrique Dorado Gil, KU Leuven, M.Sc. 2024. Janpieter Van Lierde, KU Leuven, M.Sc, 2024. Zohreh Azari, KU Leuven, M.Sc. 2024. Yorne Van Praet, KU Leuven, M.Sc. 2024. Ruben Ponsaers, KU Leuven, M.Sc. 2024. Jordy Van Landeghem, KU Leuven, Ph.D. 2024.Thesis: Intelligent Automation for AI-driven Document Understanding. Dušan Grujičić, KU Leuven, M.Sc. 2018, Ph.D. 2022, Postdoc 2022-2023.Thesis: Spatial Representation in Models of Images and Text with Applications to Medical Document Indexing and Autonomous Driving. Wim Looijmans, KU Leuven, M.Sc. 2023. Andrei Dragomir, KU Leuven, M.Sc. 2023. Yingshuo Xi, KU Leuven, M.Sc. 2023. Rik Bossuyt, KU Leuven, M.Sc. 2023. Ciem Cornelissen, KU Leuven, M.Sc. 2023. Zhongxi Li, KU Leuven, M.Sc. 2023. Xingchen Ma, KU Leuven, Ph.D. 2023.Thesis: Uncertainty Estimation in Machine Learning: Applications in Neural Network Compression and Calibration Giorgia Milli, KU Leuven, M.Sc. 2022. An Elen, KU Leuven, M.Sc. 2022. Arno Leenknegt, KU Leuven, M.Sc. 2022. Mahmoud Ibrahim, KU Leuven, M.Sc. 2022. Roberto Hernández Ruiz, KU Leuven, M.Sc. 2022. Raphael Sayer, KU Leuven, Research Assistant 2021-2022. Charalampos Kalavrytinos, KU Leuven, M.Sc. 2022. Ruben Hemelings, KU Leuven, M.Sc. 2017 [video], Ph.D. 2021.Thesis: Deep Learning in Glaucoma. Jonathan Lowe, KU Leuven, M.Sc. 2021. Gwenaël Van Looveren, KU Leuven, M.Sc. 2021. Joeri Jessen, KU Leuven, M.Sc. 2021. Stijn Jansen, KU Leuven, M.Sc. 2021. Aleksei Tiulpin, KU Leuven, Postdoc 2020-2021. Aida Ashrafi, KU Leuven, Research Assistant 2018-2020. Maxim Berman, KU Leuven, Ph.D. 2020.Thesis: Tractable Approximations for Achieving Higher Model Efficiency in Computer Vision Guojun Wu, KU Leuven, M.Sc. 2020. Guillaume Lamine, KU Leuven, M.Sc. 2020. Roshni Kamath, KU Leuven, M.Sc. 2020. Andreas Smolders, KU Leuven, M.Sc. 2020. Gaspar Pizarro, KU Leuven, M.Sc. 2020. Niels Verleysen, KU Leuven, M.Sc. 2020. Anthoula Mountzouri, KU Leuven, M.Sc. 2020. Toon Vanderschueren, KU Leuven, M.Sc. 2020. Marthe Vanhulst, KU Leuven, M.Sc. 2020. Amal Rannen Triki, KU Leuven, Ph.D. 2020.Thesis: Function Norms for Neural Networks: Theory and Applications Sinnu Thomas, KU Leuven, Postdoc 2018-2020. Ricardo Elizondo, KU Leuven, M.Sc. 2020. Dávid Kerekes, KU Leuven, M.Sc. 2020. Swarnalata Patra, KU Leuven, M.Sc. 2020. Shivangi Srivastava, Wageningen University, visiting Ph.D. student, 2018-2019. Axel-Jan Rousseau, KU Leuven, M.Sc. 2019. Hendrik Motmans, KU Leuven, M.Sc. 2019. Eugene Belilovsky, Université Paris-Saclay & KU Leuven, Ph.D. 2018.Thesis: Structured Sparse Learning on Graphs in High-Dimensional Data with Applications to Neuroimaging Alexander Van Rompaey, KU Leuven, M.Sc. 2018. Gilles Robijns, KU Leuven, M.Sc. 2018. Thomas Strypsteen, KU Leuven, M.Sc. 2018. Thomas Verelst, KU Leuven, M.Sc. 2018. Nick Seeuws, KU Leuven, M.Sc. 2018. Mathijs Schuurmans, KU Leuven, M.Sc. 2018. José Ignacio Orlando, Universidad Nacional del Centro de la Provincia de Buenos Aires, Ph.D. 2017.Thesis: Machine learning for ophthalmic screening and diagnostics from fundus images Arthur Talbot, ENS Paris-Saclay, visiting student 2017. Nele Gerrits, KU Leuven, M.Sc. 2017. Jiaqian Yu, Université Paris-Saclay, Ph.D. 2017.Thesis: Empirical risk minimization with non-modular loss functions Wacha Bounliphone, Université Paris-Saclay & KU Leuven, Ph.D. 2017.Thesis: Statistically and computationally efficient hypothesis tests for dependency and similarity Katerina Gkirtzou, École Centrale Paris, Ph.D. 2013.Thesis: Sparsity regularization and graph-based representation in medical imaging Wojciech Zaremba, École Polytechnique, M.Sc. 2012. Thesis: Modeling the variability of EEG/MEG data through statistical machine learning Ben Mather, University of Oxford, MEng 2011. Shah Ruhul Amin, University of Oxford, MEng 2010. Jacquelyn A. Shelton, Universität Tübingen, M.Sc. 2010. Thesis: Semi-supervised Subspace Learning and Application to Human Functional Magnetic Brain Resonance Imaging Data Publications: (Google Scholar Profile) Marco Mezzina, Tom Vercauteren, Tinne Tuytelaars, Matthew B. Blaschko: A framework for real-time Surgical Phase Recognition with application to Robot-Assisted Partial Nephrectomy. IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2026. [bibtex] Junyi Zhu, Ruicong Yao, Taha Ceritli, Savas Ozkan, Matthew B. Blaschko, Eunchung Noh, Jeongwon Min, Cho Jung Min, Mete Ozay: Guided Model Merging for Hybrid Data Learning: Leveraging Centralized Data to Refine Decentralized Models. IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2026. [bibtex] Konstantinos Kontras, Thomas Strypsteen, Christos Chatzichristos, Paul P. Liang, Matthew Blaschko, Maarten De Vos: Balancing Multimodal Training Through Game-Theoretic Regularization. Neural Information Processing Systems (NeurIPS), 2025. [bibtex; Note: Spotlight presentation, top 3.5% of submissions] Gorjan Radevski, Teodora Popordanoska, Matthew B. Blaschko, Tinne Tuytelaars: DAVE: Diagnostic benchmark for Audio Visual Evaluation. Neural Information Processing Systems (NeurIPS), 2025. [bibtex] Teodora Popordanoska, Jiameng Li, Matthew B. Blaschko: CLASH: A Benchmark for Cross-Modal Contradiction Detection. arXiv:2511.19199, 2025. [bibtex] Dongli Xu, Aleksei Tiulpin, Matthew B. Blaschko: SoftCFG: Uncertainty-guided Stable Guidance for Visual Autoregressive Model. arXiv:2510.00996, 2025. [bibtex] Chang Tian, Matthew B. Blaschko, Mingzhe Xing, Xiuxing Li, Yinliang Yue, Marie-Francine Moens: Large Language Models Reasoning Abilities Under Non-Ideal Conditions After RL-Fine-Tuning. arXiv:2508.04848, 2025. [bibtex] Han Zhou, Sebastian G.Gruber, Teodora Popordanoska, Matthew B. Blaschko: Revisiting Reweighted Risk for Calibration: AURC, Focal Loss, and Inverse Focal Loss. arXiv:2505.23463, 2025. [bibtex] Zifu Wang, Junyi Zhu, Bo Tang, Zhiyu Li, Feiyu Xiong, Jiaqian Yu, Matthew B. Blaschko: Jigsaw-R1: A Study of Rule-based Visual Reinforcement Learning with Jigsaw Puzzles. Transactions on Machine Learning Research, 2025. [bibtex] Han Zhou, Jordy Van Landeghem, Teodora Popordanoska, Matthew B. Blaschko: A Novel Characterization of the Population Area Under the Risk Coverage Curve (AURC) and Rates of Finite Sample Estimators. Internation Conference on Machine Learning (ICML), 2025. [bibtex; code] Huy Hoang Nguyen, Han Zhou, Matthew B. Blaschko, and Aleksei Tiulpin: Bayesian Optimization over Bounded Domains with the",
  "content_length": 52003,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:46"
}