{
  "name": "Matthew C. Turner",
  "homepage": "https://www.ecs.soton.ac.uk/people/mct1d19",
  "status": "success",
  "content": "Professor Matthew Turner | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff MT Professor Matthew Turner BEng, PhD, MIEEE Professor in Cyber-Physical Systems Research interests Adaptive control systems and how they can be made robust and function in situations not origi… Anti-windup algorithms for systems with control signal constraints - retro fits to existing c… Absolute stabilty of systems containing static, isolated nonlinearities - especially efficien… More research Accepting applications from PhD students. Connect with Matthew Email: M.C.Turner@soton.ac.uk Tel: +44 23 8059 2227 Google Scholar On this page Research Publications Teaching External roles and responsibilities Biography Research Publications Teaching External roles and responsibilities Biography Research Research groups Member of: Cyber Physical Systems Centre for Robotics Research interests Adaptive control systems and how they can be made robust and function in situations not originally envisaged Anti-windup algorithms for systems with control signal constraints - retro fits to existing controllers to enable them to function well when actuator position/rate-limits are present Absolute stabilty of systems containing static, isolated nonlinearities - especially efficient, convex algorithms for their analysis The cross-over between control and artificial intelligence Current research Dr. Turner's research interests are currently focused on robust control, adaptive control and absolute stability analysis of nonlinear control systems, and the application of these topics to various physical systems. He has worked with various aerospace companies and institutions in the UK and elsewhere and has experience designing and implementing advanced control systems for a number of different aerospace systems. His research has been funded by both government agencies and industry. He is currently particularly interested in Adaptive control systems and how they can be made robust and function in situations not originally envisagedAnti-windup algorithms for systems with control signal constraints - retro fits to existing controllers to enable them to function well when actuator position/rate-limits are presentAbsolute stabilty of systems containing static, isolated nonlinearities - especially efficient, convex algorithms for their analysisThe cross-over between control and artificial intelligence Dr. Turner's up-to-date publications are best found via the Google Scholar link. Research projects Active projects Enhanced Anti-windup Compensation Design Methods for Nonlinear Rigid Body Dynamics with Constrained Inputs Researchers: Professor Matthew Turner Sponsor: EPSRC Structured adaptive estimation: reliable \"greybox\" adaptation Researchers: Professor Matthew Turner Sponsor: EPSRC Publications Lurie networks with robust convergent dynamics Carl R. Richardson, Matthew C. Turner & Steve R. Gunn, 2025, TMLR: Transactions on Machine Learning Research, 4/2025 Type: article Lurie networks with k-contracting dynamics Carl R. Richardson, Matthew C. Turner & Steve R. Gunn, 2025 Type: conference Strengthened stability analysis of discrete-time Lurie systems involving ReLU neural networks Carl R. Richardson, Matthew C. Turner & Steve R. Gunn, 2024 Type: conference Strengthened Circle and Popov Criteria and the analysis of ReLU neural networks Carl R. Richardson, Matthew C. Turner & Steve R. Gunn, 2024 DOI: 10.1109/CONTROL60310.2024.10531900 Type: conference Two-stage anti-windup compensation for systems subject to actuator quantization and saturation M.C. Turner & C.M. Richards, 2024, International Journal of Control, 98(2), 333-346 DOI: 10.1080/00207179.2024.2337228 Type: article Strengthened Circle and Popov Criteria for the stability analysis of feedback systems with ReLU neural networks Carl Richardson, Matthew Turner & Stephen Gunn, 2023, IEEE Control Systems Letters, 7, 2635-2640 DOI: 10.1109/LCSYS.2023.3287494 Type: article Anti-windup compensation for a class of iterative learning control systems subject to actuator saturation Matthew Turner, Eric Rogers & Jorge Sofrony, 2023 DOI: 10.23919/ACC55779.2023.10156468 Type: conference Aizerman conjectures for a class of multivariate positive systems Ross Drummond, Matthew Turner, Chris Guiver & Matthew C. Turner, 2022, IEEE Transactions on Automatic Control, 68(8), 5073-5080 DOI: 10.1109/TAC.2022.3217740 Type: article Reduced-order neural network synthesis with robustness guarantees Ross Drummond, Matthew C. Turner & Stephen R. Duncan, 2022, IEEE Transactions on Neural Networks and Learning Systems, 1-10 DOI: 10.1109/TNNLS.2022.3182893 Type: article Zames-Falb Multipliers: don't panic Matthew Turner, 2021 Type: workingPaper Teaching Dr. Turner currently teaches the following modules ELEC3201 Robotic SystemsELEC2210/2211/2219 - Vector Calculus partELEC6260 - Nonlinear Control of Aerospace Systems Dr. Turner supervises projects in the general area of control systems, particularly, but not limited to, those pertaining to aerospace systems. External roles and responsibilities Name: Lurie Networks with k-contracting Dynamics Role: Co-author Year: 2025 Biography Matthew Turner received the BEng degree in Electrical and Electronic Engineering from the University of Surrey in 1996 and the PhD in Control Engineering from the University of Leicester in 2000. After a post-doc he continued at Leicester for several years becoming lecturer, then senior lecturer and then professor. At Leicester he served in various leadership capacities including Deputy Head of Research (Engineering) and Head of the Aerospace and Computational Engineering Research Group.  He joined the Cyber-Physical-Systems Research Group in ECS in March 2020. Internationally, he is best known for his contributions to anti-windup control - algorithms which augment standard control systems so that they retain stability and functionality in the presence of input constaints (ubiquitous in control systems). His ideas on anti-windup have been applied to various practical control systems and, together with DLR Braunschweig, he was part of several flight test campaigns examining the efficacy of anti-windup compensators for the alleviation of pilot-induced-oscillations (PIO's) in highly augmented aircraft. For serveal years he served as an associate editor for the International Journal of Control (under the editorship of Prof. Eric Rogers) and has served in various editorial and programme committee capacities for a number of international conferences. Prizes Best Paper Award (2018) Best Paper Award (2018) Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Pre-sessional English courses Course modules Assessment Subjects Acoustical engineering Aeronautical and astronautical engineering Ageing and gerontology Archaeology Art, design and fashion Audiology Biological sciences Biomedical and medical engineering Business, accounting, finance and marketing Chemistry Civil engineering Computer science and software engineering Economics Education Electrical and electronic engineeri",
  "content_length": 30337,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:51"
}