{
  "name": "Matthew McGinity",
  "homepage": "https://tu-dresden.de/ing/informatik/smt/im/ixlab/team/matthew-mcginity",
  "status": "success",
  "content": "Matthew McGinity — Juniorprofessur für Gestaltung immersiver Medien — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen Junior Professor for Immersive Media Design InhaltsverzeichnisContact Research Priorities Education Professional Experience Publications Contact © McGinity Inhaber der Professur Name Herr Prof. Matthew McGinity E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen work Tel. Sprechzeiten: Montag bis Freitag: 09:00 - 18:00 Research Priorities Virtual reality and immersive media technologies Perceptual and cognitive foundations of immersion Applications of immersive media to psychotherapy, museums, education and AI Immersive art and creative computing Education 1992-1996 Bachelor of Arts / Science, University of Melbourne (Philosophy, Literature, Mathematics, Physics) 1997 Bachelor of Computing Honours (1st), Monash University 2014 PhD , “Presence, immersion and the panorama - a theoretical, technical and artistic inquiry”, University of New South Wales, doi.org/10.26190/unsworks/17099 Professional Experience 2020- Junior Professor for Immersive Media Design, TU Dresden (DE) 2016-2018 Research Associate, Julius-Maximilians University, Würzbug (DE) 2003-2011 Computer Scientist / Lecturer, iCinema Centre for Interactive Cinema, University of New South Wales, Sydney (AU) 2002-2003 Media Artist, ZKM Zentrum für Kunst und Medien, Karlsruhe (DE) 2001-2002 VR Engineer, Silicon Worlds, Paris (FR) 1999-2001 VR Engineer, European Space Agency, Noordwijk (NL) 1998-1999 Game Developer, Perfect Entertainment, London (UK) 1998 Animation Developer, Beam International, Melbourne (AU) Publications 30 Einträge 2025 Iguana: Immersive Guidance, Navigation, and Control for Consumer UAVVictor, V., Krisanty, T., McGinity, M., Gumhold, S. & Aßmann, U., 8 Okt. 2025Elektronische (Volltext-)VersionPublikation: Vorabdruck/Dokumentation/Bericht > Vorabdruck (Preprint) Spatial Exploration of Melodic Topologies in Indian Classical Music using XRChandran, K., Engeln, L. & McGinity, M., 30 Sept. 2025, Mensch und Computer 2025 - Workshopband. Gesellschaft für Informatik e.V., 4 S.Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Material Studies For Digital Heritage: Comparative Analysis of Geometric and Photometric 3D RepresentationsTöpfer, F., Christ, E., Yu, Z., Engeln, L. & McGinity, M., 15 Sept. 2025, Digital Heritage - Digital Heritage International Congress 2025. The Eurographics AssociationElektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Evoking Emotions in Virtual Reality: A Comparative Study of Simulation MethodsSchier, F., Senechal, N., Badeja, D. & McGinity, M., 30 Aug. 2025, S. 560-564, 5 S.Elektronische (Volltext-)VersionPublikation: Beitrag zu Konferenzen > Paper Attitudes towards virtual reality usage in exposure treatment: Data from German practitioners and how a demonstration changes themBadeja, D., Schier, F., McGinity, M. & Hoyer, J., 31 Juli 2025, in: Psychotherapy ResearchElektronische (Volltext-)VersionPublikation: Beitrag in Fachzeitschrift > Forschungsartikel The Worry Gallery: Feasability trial of an anxiety induction method applying generative artificial intelligence and mixed realityBadeja, D., Schier, F., McGinity, M. & Hoyer, J., 8 April 2025Publikation: Beitrag zu Konferenzen > Poster Attitudes towards virtual reality usage in exposure treatment: Data from German practitioners and how a demonstration changes themBadeja, D., Schier, F., McGinity, M. & Hoyer, J., 27 Jan. 2025Elektronische (Volltext-)VersionPublikation: Vorabdruck/Dokumentation/Bericht > Vorabdruck (Preprint) Immersive In Situ Visualizations for Monitoring Architectural-Scale Multiuser MR ExperiencesYu, Z., Zeidler, D., Chandran, K., Engeln, L., Mende, K. & McGinity, M., 2025, 16th International Conference on Information Visualization Theory and Applications. Band 1. S. 895-902, 8 S.Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Spatial Audio Paths – Spatial Expressiveness of Immersive 3D Audio Trajectory EditingEngeln, L., Georgi, L., Ludwig, R., Chandran, K., Töpfer, F. & McGinity, M., 2025, Proceedings of the 20th International Audio Mostly Conference, AM 2025Publikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Toward an All-in-One Platform for Mixed Reality ExhibitionsYu, Z., Töpfer, F., Christ, E. & McGinity, M., 2025, KUI 2025 – Proceedings Publikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Seite 1, aktuell ausgewählt 1 2 3 weiter Diese Informationen werden durch das FIS bereitgestellt. Zu dieser Seite Matthew McGinity Letzte Änderung: 26.06.2024 Diese Seite … … auf Facebook teilen … auf Twitter/X teilen … drucken … als E-Mail versenden",
  "content_length": 5054,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:59"
}