{
  "name": "Matthew Stone",
  "homepage": "https://www.cs.rutgers.edu/~mdstone",
  "status": "success",
  "content": "Matthew Stone Information Contact Bio Archives Affiliations Computer Science Cognitive Science Perceptual Science Semantics Rutgers Research I work toward computer systems that talk—that mean what they say to you and understand what you say to them. Publications Natural Language Generation Computational Semantics Knowledge Representation Conversational Agents RUTH Teaching In Spring 2013, I'm teaching CS 195: Honors Seminar in CS, a lightweight exploration of CS project work, and CS 504: Computational Modeling, an exploration of real-world inference for perceptual science students and other interdisciplinary graduate students. In Fall 2013, I'll be teaching CS 440: Introduction to AI, and CS 503: Computational Thinking. Links are to previous year's schedules for prospective students. Contact me for guest access to Rutgers's sakai site to see additional materials. Computer science has succeeded beyond its wildest dreams. We can all remember when computers were specialized tools for business and government. Yet nowadays everyone puts that same power to use all the time, and not just in our laptops, but in our cameras and mobile phones, our music players and entertainment consoles. We can all remember when computer applications meant complex number-crunching on valuable and meticulously hand-processed data. Nowadays, the software we run is just as likely to put all the information of the world at our fingertips, to connect us with our longstanding friends and with like-minded strangers, and to let us express ourselves not just in words and numbers but through sound and sight, through relationships, interaction and design. It is a whole new world. For all computing has changed, academia has unique strengths that mean it can and will continue to shape the future of computers in society. Universities can give their technologists unparalleled freedoms: like nobody else, we can make connections among different ideas and perspectives, and pursue radical new opportunities to develop meaningful contributions. But universities also offer institutional support to critical practice in the humanities, arts and social sciences, and thereby create a distinctive context of engagement, reflection, and historical perspective to inform all academic work. And universities direct this intellectual foment at a new generation of students—brand-new minds that leave college inspired not only with the latest scientific ideas and most powerful technical skills, but with anger and hope to struggle against injustice and for a better society, and with the insight, confidence, and determination and to carry it off. As a computer science professor, I combine technical contributions to research practice with efforts that aim to create new communities, to contribute intuitive ideas and challenging demonstrations to public debate, and to unleash the unpredictable energy of new technologists who can go on to make the world they want to live in.",
  "content_length": 2960,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:03"
}