{
  "name": "Matthias Boehm 0001",
  "homepage": "https://mboehm7.github.io",
  "status": "success",
  "content": "Matthias Boehm Matthias Boehm Technische Universität Berlin Faculty IV - Electrical Engineering and Computer Science Berlin Institute for the Foundations of Learning and Data (BIFOLD) Big Data Engineering (DAMS Lab) Group Office: Room FR-771, Franklinstraße 28, 10587 Berlin matthias.boehm@tu-berlin.de Matthias Boehm is a full professor for large-scale data engineering at Technische Universität Berlin and the BIFOLD center of excellence for AI research. His research group focuses on high-level, data science-centric abstractions as well as systems and tools to execute these tasks in an efficient and scalable manner. From 2018 through 2022, Matthias was a BMK-endowed professor for data management at Graz University of Technology, Austria, and a research area manager for data management at the co-located Know-Center GmbH. Prior to joining TU Graz in 2018, he was a research staff member at IBM Research - Almaden, CA, USA, with a major focus on compilation and runtime techniques for declarative, large-scale machine learning in Apache SystemML. Matthias received his Ph.D. from Dresden University of Technology, Germany in 2011 with a dissertation on cost-based optimization of integration flows. His previous research also includes systems support for time series forecasting as well as in-memory indexing and query processing. Current Projects: Apache SystemDS (An open source ML system for the end-to-end data science lifecycle), , and FONDA II (Foundations of Workflows for Large-Scale Scientific Data Analysis; w/ BAM, Charite, FU Berlin, GFZ, HU Berlin, MDC, TU Darmstadt, Uni Potsdam, Zuse-Institut) Completed Projects: ExDRa (06/2019-08/2022, exploratory data science and federated ML over raw data; w/ Siemens, DFKI, TU Berlin, and TU Graz), ReWaste F (04/2021-08/2022, digital platform for austrian recycling economy; w/ 4 scientific and 14 industrial partners), DAPHNE (12/2020-11/2024, an open and extensible system infrastructure for integrated data analysis pipelines; w/ AVL, DLR, ETH Zurich, HPI Potsdam, ICCS, Infineon, Intel, ITU Copenhagen, KAI, TU Dresden, Uni Maribor, Uni Basel) Current Additional Roles: PMC Chair Apache SystemDS (since 09/2020) Member of Central Election Committee of TU Berlin (since 04/2023) Member of Fak IV AwAn Team at TU Berlin (since 04/2024) Team The DAMS Lab (data management for data science laboratory) is a cross-organizational research group uniting the chair for big data engineering at TU Berlin and external members from multiple universities and industry. Secretary: Sarah Hashmi (since 09/2023): N/A Postdocs: Patrick Damme (since 01/2021): https://pdamme.github.io/ PhD students: Christina Dionysio (since 10/2023): https://christinadionysio.github.io/ Jannik Lindemann (since 10/2025): https://www.janniklindemann.com/ Philipp Ortner (since 10/2023, CRC FONDA II): https://philipportner.github.io/ David Justen (since 03/2023, BIFOLD doctoral school): https://d-justen.github.io/ Grigorii Turchenko (since 10/2024, BIFOLD doctoral school): https://gaturchenko.github.io/ Carlos E. Muniz Cuza (since 02/2023, BIFOLD agility project): https://vbn.aau.dk/en/persons/149858 Ramon Schöndorf (since 12/2023, BIFOLD project LungCAIRE): https://ramon-sc.github.io/ Saeed Fathollahzadeh (since 04/2021, external Concordia University): https://fathollahzadeh.github.io/ Martin Seyferth (since 01/2025, external PTB): N/A Alexander Wolotschai (since 02/2025, external Mercedes): N/A Martin Moesmann (since 04/2025, external Aalborg University): N/A Undergrad research assistants: Elias Strauß (since 05/2024): N/A Jessica Eva Sophie Priebe (since 06/2025): N/A Hatice Kübra Aksu (since 11/2025): N/A PhD Theses (completed): Dr. techn. Shafaq Siddiqi (09/2019-06/2024, defense Jun 21, 2024; now postdoc at TU Graz/Know-Center): https://shafaq-siddiqi.github.io/ Dr.-Ing. Arnab Phani (04/2019-12/2024, defense Dec 16, 2024; now postdoc at TU Berlin): https://phaniarnab.github.io/ Dr. rer. nat. Haralampos Gavriilidis (co-supervised 06/2024-07/2025, defense Jul 22, 2025; now on the job market): https://www.user.tu-berlin.de/harry_g/ Dr.-Ing. Sebastian Baunsgaard (01/2020-08/2025, defense Aug 13, 2025; now at Databricks): https://baunsgaard.github.io/ Master Theses (completed): Svetlana Sagadeeva (2020), Simon Kysela (2021), Florijan Klezin (2022), Florian Lackner (2022), Pooja Veeresh Yeli (2022), Mito Kehayov (2022), Michael Hofer (2023), Vlad-Andrei Dumitru (2023), Christina Dionysio (2023), Philipp Ortner (2023), Damian Dinoiu (2024), Marlon Adam (2024), Moneer Martini (2024), Obeidah Awni Salim Smadi (2024), Linus Bruckner (2024), Pablo Uxo Castillo (2024), Louis Le Page (2024), Ann-Sophie Messerschmid (2024), Lotta Fagel (2024), Sujitkumar Suresh Gavali (2024), Ahmed Boulila (2024), Lachezar Nikolov (2024), Niklas Andres (2024), Niklas Ventker (2025), Jannik Lindemann (2025), Daniel Richter (2025), Niklas Lohmann (2025), Wen Zhang (2025), Dario Klepoch (2025), Till Hecht (2025), Rebekka Teuta Murati (2025), Cordelia Mena Hernandez (2025), Hasib Ul Alam (2025) Bachelor Theses (completed): Benjamin Rath (2019), Sandro Letter (2020), Valentin Edelsbrunner (2021), Tobias Rieger (2021), Kevin Innerebner (2021), Thomas Krametter (2022), Thomas Wedenig (2022), Jonathan Resch (2022), Olga Ovcharenko (2022), David Weissteiner (2022), Dževad Ćoralić (2022), Lukas Erlbacher (2022), Jonathan Haberl (2023), Gabriel Alexandru Muresan (2023), Emil Winterleitner (2023), Mario Schwaiger (2023), Richard Bendler (2023), Mark Paranskij (2023), Fares Kataf (2023), Danial Alnicola (2023), Elias Strauß (2024), Andreas Kreppold (2024), Kubilay Eren (2024), Kristiyan Blagov (2024), Maltrim Ebipi (2024), Tessa Heidkamp (2024), Marvin Seidel (2024), Eduard Chalovski (2024), Kasem Celebi (2024), Cenk Özdaglar (2024), Thanh Nguyen (2024), Frederic Caspar Zoepffel (2024), Paul Olaf Theodor Pohlitz (2024), Anton Simon Horeis (2024), Marcel Scholand (2024), Yoana Tsoneva (2024), Simon Kraus (2024), Anton Erik Uwe Pötzsch (2025), Anuun Chinbat (2025), Anton Noah Saatz (2025), Mohamed Atabay (2025), Julius Stöber-Olsen (2025), Andre Jansen (2025), Luis Tugend (2025), Laura Knorr (2025), Levin Tugrul (2025), Helena Karielle Ballent (2025), Injun Park (2025), Tomoki Kai Mengel (2025), Timo Simon Gutsche (2025), Harun Demir (2025), Desara Hoxha (2025), Sabina Bakhtiiarova (2025) We're looking for motivated PhD, master, and bachelor students to join our team. Our research focuses on building ML systems and tools for simplifying the data science liefecycle – from data integration over model training to deployment and scoring – via high-level language abstractions and specialized compiler and runtime techniques. If you're interested in working with us, please contact us directly via email to jobs@dams.tu-berlin.de. New Master/Bachelor Theses: The DAMS Lab currently receives a large number of requests for supervising master and bachelor theses. In order to make the process of matching topics to students more scalable, while ensuring a high-quality of supervision, as of Jan 2024, we are introducing the following process: Open thesis topics are listed at TU Berlin (I)STROD (direct link) If interested in a particular topic, contact the listed supervisor (PhD student, postdoc, or me) directly. We are also open to joint topics with industrial partners or your own project proposal, but note that TU Berlin Faculity IV does not allow confidential tags (Sperrvermerke). For such projects, please directly contact me. Basic administrative aspects of writing a thesis with us include: (1) the thesis must be written in English language and using LaTeX, (2) you need to agree to defend the thesis between thesis submission and grading (but without major impact on grading) in front of the DAMS Lab (30min talk, 15min Q&A), (3) we usually have regular one-on-one meetings (~ every three weeks) to talk about progress and problems, and (4) the thesis is officially registered about 1-2 months after starting the project (once there is mutual agreement about the scope and approach for addressing the given problem or research question). If you successfully completed other courses of our group, please indicate that in your application because we preferrably accept students with matching background. You may use our thesis template (which is regularly updated). Publications This publication list covers the time after my PhD and postdoc. For a full list see DBLP and Google Scholar. My ORCID is 0000-0003-1344-3663. For additional interactive rankings see CSRankings and Influential DB Papers. 2026 Sebastian Baunsgaard, Matthias Boehm: Morphing-based Compression for Data-centric ML Pipelines, PVLDB 2026 19(?). Shafaq Siddiqi, Arnab Phani, Roman Kern, Matthias Boehm: Saga++: A Scalable Framework for Optimizing Data Cleaning Pipelines for Machine Learning Applications, TODS 2026. Carlos Enrique Muñiz-Cuza, Matthias Boehm, Torben Bach Pedersen: CAMEO: Autocorrelation-Preserving Line Simplification for Lossy Time Series Compression, EDBT 2026. [paper] 2025 David Justen, Matthias Boehm: Join Cardinality Estimation with OmniSketches, CoRR 2025 abs/2508.17931. [paper] Benedikt Didrich, Haralampos Gavriliidis, Vasilis Gkolemis, Matthias Boehm, Volker Markl: Learning to Accelerate: Tuning Data Transfer Parameters, AIDB@PVLDB 2025. [paper] Haralampos Gavriilidis, Joel Ziegler, Midhun Kaippillil Venugopalan, Benedikt Didrich, Matthias Boehm, Volker Markl: Enter the Warp: Fast and Adaptable Data Transfer with XDBC (Demo), PVLDB 2025. [paper] Saeed Fathollahzadeh, Essam Mansour, Matthias Boehm: CatDB: Data-catalog-guided, LLM-based Generation of Data-centric ML Pipelines, PVLDB 2025 18(12). [paper] Saeed Fathollahzadeh, Essam Mansour, Matthias Boehm: Demonstrating CatDB: LLM-based Generation of Data-centric ML Pipelines (Demo), SIGMOD 2025. [paper] Haralampos Gavriilidis, Kaustubh Beedkar, Matthias Boehm, Volker Markl: Fast and Scalable Data Transfer across Data Systems, SIGMOD 2025. [paper] Matthias Boehm: ",
  "content_length": 29244,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:04"
}