{
  "name": "Matthias Riebisch",
  "homepage": "https://www.inf.uni-hamburg.de/en/inst/ab/swk/team/riebisch.html",
  "status": "success",
  "content": "Matthias Riebisch : SWK : University of Hamburg Zur MetanavigationZur HauptnavigationZur SucheZum InhaltZur SubnavigationZum SeitenfußPhoto: UHH/DenstorfSWKMatthias Riebisch Chair of the Working Group SWK Univ.-Prof. Dr.-Ing. habil. Matthias RiebischProfessor https://orcid.org/0000-0001-9956-5949https://scholar.google.com/citations?hl=de&user=HSDLZtkAAAAJhttps://dblp.uni-trier.de/pid/20/2574.html?q=Matthias%20Riebisch With great sadness, we report the loss of Matthias Riebisch, who passed away on January 11th, 2023. → Mourning the death of Matthias Riebisch Short Biography1984-1988 Diploma Studies: Automation Engineering at IFA, Dresden University of Technology (IFA Institut für Automatisierungstechik, Technische Universität Dresden) 1988-1992  PhD Studies at Ilmenau University of Technology, Dept. Computer Science, Thesis: \"Reusablity of Process Control Software Based on Semi-Formal Descriptions\" (Wiederverwendung prozeßnaher Software auf der Basis halbformaler Beschreibungsmittel) - available from the Ilmenau library 1993-1996  Research Assistant at Ilmenau University of Technology, Dept. Process InformaticsWorking areas: object-oriented technologies, software quality management 1996-1998  Project leader and chief architect in large industrial software projects for Deutsche Post AG Informationstechologie, Düsseldorf; Working areas: project management, software & systems architectures, software quality management 1999-2012  Assistant Professor at Ilmenau University of Technology, Dept. Software Systems/Process Informatics 2004  Habilitation Thesis \"Evolution and Composition of Software Systems\" (Evolution und Komposition von Softwaresystemen) - online publication Since March 2012  Full Professor at the University of Hamburg, Department of Informatics, Software Development and Software Construction Methods Group (SWK)Research InterestsEnabling Change in Complex Software Systems: Complex software systems have to follow constantly changing requirements. Their dependability and reliability has to be maintained over long periods. In practice, software changes often lead to a decline of quality characteristics such as maintainability, flexibility, clarity, reliability and efficiency. Incomplete an inadequate changes lead to damages of the structure. Such effects are also known as architectural decay or entropy loss. A close linkage between forward and reverse engineering methods and techniques, and an enforced use of models should help to avoid such effects. By maintaining the evolvability of the software systems, a permanent further development can be achieved. Furthermore, the methods enable an improved tool support and an increased efficiency of the software development. The evolutionary development of software systems requires models as the basis for the development activities. Linking the models of requirements, architectures and implementation are particularly essential to solve complex tasks. Traceability links have proved to be an important means to maintain the consistency of the models of different views, which are necessary to manage the complexity. The descriptions used must be based on a sound basis, and they have to be supported by adequate development methods. The bridging of the transition between requirements specification and architectural models which is often referred to as a semantic gap, demands for special methods and models, as well as for an explicit representation of traceability links and dependency relationships. The research is applied the domains of embedded systems, especially for production, automotive and telecommunication systems, for logistics as well as for high-performance compting and data-intensive applications. The following, partially overlapping, fields of Software Engineering  are targets of my research: Model Driven Development Model Driven Architectures MDA Domain-Specific Languages DSL Software Architectures Architectural Decisions Impact Analysis Software Reusability Domain Engineering Components, Frameworks & Patterns Product Lines Evolvability of Software Traceability Versioning Software Development Processes Reengineering Program Comprehension Certification Requirements Engineering Goal Oriented Requirements Engineering Domain Engineering Formalization of Requirements Languages Domain Specific Languages Modelling Languages Model Integration & Semantics Metadata - Thesauri - Taxonomies - Ontologies Information Integration Architecture & Modelling of Information Systems Process Management & Organization Maturity of Software Development Processes, Methods and Organizations Coordination of Development Processes Product Line Processes Distributed Development Software Quality Management Test Automation Performance Engineering in Software Development Processes Software Certification Best Practice Management Information Security Security by Design PublicationsPublications of my work are listed together with most PDFs on the publications website of the research groupResponsibilitiesWithin University of Hamburg, Faculty Mathematics, Informatics and Natural Sciences MIN and Department of Informatics (in German to avoid ambiguities): Vorstand des FB Informatik - verantwortlich für SachmittelFachbereichsrat Informatik - MitgliedMIN-Fakultätsrat - stellv. MitgliedMIN-Promotionsausschuss - stellv. MitgliedFach-Promotionsausschuss Informatik - stellv. VorsitzenderAusschuss zur Förderung des wissenschaftlichen Nachwuchses (Graduiertenförderungsausschuss) - stellv. MitgliedGemeinsame Kommission Wirtschaftsinformatik - stellv. MitgliedPrüfungsausschuss BSc Informatik - stellv. VorsitzenderPrüfungsausschuss MSc Informatik - stellv. VorsitzenderPrüfungsausschuss Diplom Informatik - stellv. MitgliedDezentraler Prüfungsausschuss Lehramt Informatik - stellv. MitgliedERASMUS programme - Departmental Coordinator for Cooperation with INSA ToulouseInformatisches Kolloquium - Informatics Colloquium - Co-organizer Related to Research Data Science in Hamburg HELMHOLTZ Graduate School for the Structure of the Matter DASHH - Principal Investigator (PI)Steering Committee of the IEEE International Conference on Software Architecture ICSA - member Within German Computer Society - Gesellschaft für Informatik Department Software Engineering - Fachbereich Softwaretechnik - Member of BoardSpecial Interest Group on Software Architectures - Fachgruppe Architekturen - Member of BoardJoint Group on Modeling - Querschnittsfachausschuss Modellierung - Member of BoardWorking group on Traceability / Evolution - Arbeitskreis Traceability / Evolution - Leader Other Initiative arbeiterkind.de - MentorAddressUniversität HamburgFakultät für Mathematik, Informatik und NaturwissenschaftenFachbereich InformatikArbeitsbereich SWKVogt-Kölln-Str. 30D-22527 Hamburg Tel  +49 40 42883-2312 (SWK team assistant)Fax +49 40 4273 14630 see team page for further contacts Directions and map",
  "content_length": 6897,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:15"
}