{
  "name": "Matthew T. Fluet",
  "homepage": "https://www.cs.rit.edu/~mtf",
  "status": "success",
  "content": "Matthew Fluet Matthew Fluet Associate Professor and Graduate Program Director Department of Computer Science Golisano College of Computing and Information Sciences Rochester Institute of Technology Email: mtf@cs.rit.edu WWW: http://www.cs.rit.edu/~mtf Office: GOL(70)-3017 Address: Rochester Institute of Technology Department of Computer Science 102 Lomb Memorial Dr. Rochester, NY 14623-5608 Schedule Semester 20251: August 25, 2025 to December 8, 2025 Monday Tuesday Wednesday Thursday Friday 9:00 AM MS CS Office HoursSchedule via Starfish CS Council Meeting Not available Not available Office Hours 10:00 AM GCCIS Curriculum Committee Prog. Lang. Reading GroupCYB-3710 11:00 AM Office Hours PSR (CSCI-541/641)11:00–12:15LBR-A201 MS CS Office HoursWalk-in PSR (CSCI-541/641)11:00–12:15LBR-A201 MS CS Office HoursSchedule via Starfish 12:00 PM T. Schollenberger(MS Project) CS Curriculum Committee CS Faculty Meeting12:30–1:45 (monthly) GCCIS PhD Faculty Meeting12:30–1:30 (monthly) 1:00 PM K. Tidwell(MS Project) M. Ko(MS Project) X. Shi(MS Project) CS MS Coffee Hour1:30–2:30 (monthly)CS Grad Lab (GOL-3660) 2:00 PM MSP (CSCI-788)2:00–2:50WAL-3520 MSP (CSCI-788)2:00–2:50WAL-3520 MSP (CSCI-788)2:00–2:50WAL-3520 CS MS Team Meeting 3:00 PM RIT Grad Council MS CS Office HoursWalk-in J. Quinn(MS Thesis) MS CS Office HoursSchedule via Starfish 4:00 PM M. Saldanha(MS Thesis) For appointments outside of office hours, please contact me by email to make arrangements. Teaching Rochester Institute of Technology Resources for Students S20251: CSCI 541/641: Programming Skills — Safe and Secure Systems Programming in Rust; CSCI 788: Computer Science MS Project S20245: CSCI 541/641: Programming Skills — Safe and Secure Systems Programming in Rust; CSCI 742: Compiler Construction S20241: CSCI 344: Programming Language Concepts; CSCI 788: Computer Science MS Project S20235: CSCI 344: Programming Language Concepts; CSCI 541/641: Programming Skills — Safe and Secure Systems Programming in Rust S20231: CSCI 541/641: Programming Skills — Functional Programming and Haskell; CSCI 788: Computer Science MS Project …more… S20225: CSCI 344: Programming Language Concepts; CSCI 541/641: Programming Skills — Safe and Secure Systems Programming in Rust; Mechanized Meta-Theory for Programming Languages (IS) S20221: CSCI 541/641: Programming Skills — Functional Programming and Haskell; CSCI 740: Programming Language Theory S20215: CSCI 541/641: Programming Skills — Safe and Secure Systems Programming in Rust; CSCI 742: Compiler Construction; CSCI-799: Mechanized Meta-Theory for Programming Languages (IS) S20211: CSCI 740: Programming Language Theory; CSCI 788: Computer Science MS Project S20205: CSCI 541/641: Programming Skills — Safe and Secure Systems Programming in Rust; CSCI 742: Compiler Construction S20201: CSCI 740: Programming Language Theory; CSCI 788: Computer Science MS Project S20195: CSCI 344: Programming Language Concepts; CSCI-799: Mechanized Meta-Theory for Programming Languages (IS) S20191: CSCI 541/641: Programming Skills — Functional Programming and Haskell; CSCI 740: Programming Language Theory S20185: CSCI 344: Programming Language Concepts; CSCI-799: Mechanized Meta-Theory for Programming Languages (IS) S20181: CSCI 541/641: Programming Skills — Functional Programming and Haskell; CSCI 740: Programming Language Theory S20175: CSCI 344: Programming Language Concepts S20165: CSCI 788: Computer Science MS Project; CSCI-799: Mechanized Meta-Theory for Programming Languages (IS) S20161: CSCI 344: Programming Language Concepts; CSCI 740: Programming Language Theory S20155: CSCI 742: Compiler Construction; CSCI-799: Software Foundations (IS) S20151: CSCI 344: Programming Language Concepts; CSCI 740: Programming Language Theory S20145: CSCI 344: Programming Language Concepts; CSCI 742: Compiler Construction S20141: CSCI 740: Programming Language Theory S20135: CSCI 742: Compiler Construction S20131: CSCI 251: Concepts of Parallel and Distributed Systems; CSCI 740: Programming Language Theory Q20123: 4003-561/4005-714: Programming Skills — Functional Programming and Haskell Q20122: 4005-711: Compiler Construction Q20121: 4003-450: Programming Language Concepts; 4005-710: Programming Language Theory Q20113: 4003-561/4005-714: Programming Skills — Functional Programming and Haskell/Standard ML Q20112: 4003-242: Data Structures for Problem Solving; 4005-711: Compiler Construction Q20111: 4003-241: A Problem-Based Introduction to Computer Science; 4005-710: Programming Language Theory Q20103: 4003-450: Programming Language Concepts Q20102: 4003-450/4003-709: Programming Language Concepts; 4003-531/4005-735: Parallel Computing I Q20101: 4003-450: Programming Language Concepts; 4005-710: Programming Language Theory Q20093: 4003-243: Object-Oriented Programming in Java Q20092: 4003-233: Computer Science 3 Q20091: 4003-450/4003-709: Programming Language Concepts University of Chicago Winter 2009: CMSC 22610: Implementation of Computer Languages-1 Cornell University Spring 2003: CS486: Applied Logic (teaching assistant) Fall 2000: CS611: Advanced Programming Languages (teaching assistant) …less… Research My main research interests lie with programming languages, including compiler technology, parallelism and concurrency, type systems, and program semantics. Curriculum Vitae Publications (fluetbib.bib) Type- and Control-Flow Analysis MLton: whole-program, optimizing Standard ML compiler MaPLe (MPL): a functional language for provably efficient and safe multicore parallelism (joint project with Sam Westrick, Mike Rainey, Umut Acar) …more… Manticore: a Heterogeneous-Parallel Functional Programming Language (joint project with Sven Auhagen, Lars Bergstrom, Mike Rainey, John Reppy, Adam Shaw) Fairness for Transactional Events (joint work with Edward Amsden) Compiling Self-Adjusting Programs with Continuations (joint work with Ruy Ley-Wild and Umut Acar) Monadic and Substructural Type Systems for Region-Based Memory Management (PhD thesis) Transactional Events (joint work with Kevin Donnelly) Linear Regions Are All You Need (joint work with Greg Morrisett and Amal Ahmed) Practical Datatype Specializations (joint work with Riccardo Pucella) A Step-Indexed Model of Substructural State (joint work with Amal Ahmed and Greg Morrisett) L3: A Language with Linear Locations (joint work with Amal Ahmed and Greg Morrisett) Monadic Regions (joint work with Greg Morrisett) A Safe Runtime System in Cyclone (joint work with Dan Wang) Computational Content of Boolean Valuations (joint work with Stuart Allen and Bob Constable) Phantom Types and Subtyping (joint work with Riccardo Pucella) Contification Using Dominators (joint work with Stephen Weeks) …less… Professional Activities The 2024 ACM SIGPLAN ML Family Workshop (ML'24) — Program Committee September 6, 2024; Milan, Italy (co-located with ICFP'24) The 2023 ACM SIGPLAN ML Family Workshop (ML'23) — Program Committee September 8, 2023; Seattle, Washington, USA (co-located with ICFP'23) The 34th Symposium on Implementation and Application of Functional Languages (IFL'22) — Program Committee August 31 – September 2, 2022; Copenhagen, Denmark The 25th ACM SIGPLAN International Conference on Functional Programming (ICFP'20) — Program Committee August 24 – 26, 2020; Virtual The 2019 ACM SIGPLAN ML Family Workshop (ML'19) — Program Committee August 22, 2019; Berlin, Germany (co-located with ICFP'19) The ACM Special Interest Group on Programming Languages (SIGPLAN) — Information Director (Steering Committee member) September 2015 — December 2018 The ICFP Programming Contest 2018 — Organizing Committee Chair July 20 – 23, 2018 (sponsored by ICFP'18) The 23rd ACM SIGPLAN International Conference on Functional Programming (ICFP'18) — External Review Committee September 24 – 26, 2018; St. Louis, Missouri, USA …more… The 39th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI'18) — External Review Committee June 20 – 22, 2018; Philadelphia, Pennsylvania, USA The 18th Symposium on Trends in Functional Programming (TFP'17) — Program Committee June 19 – 21, 2017; University of Kent at Canterbury, United Kingdom The 21st ACM SIGPLAN International Conference on Functional Programming (ICFP'16) — Program Committee September 19 – 21, 2016; Nara, Japan The 25th European Symposium on Programming (ESOP'16) — Program Committee April 2 – 8, 2016; Eindhoven, The Netherlands The 26th International Symposium on Implementation and Application of Functional Languages (IFL'14) — Program Committee October 1 – 3, 2014; Boston, Massachusetts, USA The 2014 ACM SIGPLAN ML Family Workshop (ML'14) — Program Committee September 4, 2014; Gothenburg, Sweden (co-located with ICFP'14) The 16th Symposium on Trends in Functional Programming (TFP'14) — Program Committee May 26 – 28, 2014; Soesterberg, The Netherlands The First International Workshop on Cross-model Language Design and Implementation (XLDI'12) — Program Committee September 9, 2012; Copenhagen, Denmark (co-located with ICFP'12) The Ninth Asian Symposium on Programming Languages and Systems (APLAS'11) — Program Committee December 5 – 7, 2011; Kenting, Taiwan The 37th ACM SIGACT-SIGPLAN Symposium on Principles of Programming Languages (POPL'11) — Program Committee January 26 – 28, 2011; Austin, Texas, USA The 2010 ACM SIGPLAN Workshop on ML (ML 2010) — Program Chair September 26, 2010; Baltimore, Maryland, USA (co-located with ICFP'10) The 22nd International Symposium on Implementation and Application of Functional Languages (IFL'10) — Program Committee September 1 – 3, 2010; The Netherlands The 21st International Symposium on Implementation and Application of Functional Languages (IFL'09) — Program Committee September 23 – 25, 2009; South Orange, New Jersey, USA Summer School on Theory and Practice of Language Implementation — Co-organizer July 23 – 31, 2009; Eugene, Oregon, USA The International Symposium on Memory Management (ISMM'09) — Review Committee June 19 – 20, 200",
  "content_length": 11582,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:02"
}