{
  "name": "Matthias Jarke",
  "homepage": "https://dbis.rwth-aachen.de/dbis/index.php/user/jarke",
  "status": "success",
  "content": "Prof. i.R. Dr. Matthias Jarke | DBIS DBIS Home Information Systems & Databases News Projects Staff Job Offers Academics Courses Thesis Projects Research Publications Resources Log in Categories Pages - - Courses i5 Jobs Labs Lectures News Projects Research Fields RFC Seminars Theses Uncategorized Working Groups - Home Information Systems & Databases News Projects Staff Job Offers Academics Courses Thesis Projects Research Publications Resources Log in DBIS Prof. i.R. Dr. Matthias Jarke This user account status is Approved This user has not added any information to their profile yet.Contact Information:AddressLehrstuhl Informatik 5 2nd floor, building: E2 Ahornstr. 55 52056 Aachen DE E-mail Addresssekris+jarke@dbis.rwth-aachen.deLinkedInhereResearch GatehereShort BioSince March 2021, Prof. i.R. Prof. (OM) Dr. Matthias Jarke is professor em. at the chair Informatik 5 (Information Systems and Databases) of RWTH Aachen University. He founded the chair in 1991 and served as Chairman of the Computer Science Department from 1992-2000. His research areas include database query optimization and data space architectures, requirements engineering and meta modeling for applications in engineering, business, and culture. During his tenure as executive director of the Fraunhofer Institute for Applied Information Technology (FIT) from 2000-2021, he also chaired the Fraunhofer ICT Group from 2010-2015, with 19 institutes and over 6.000 employees the largest applied ICT research organization in Europe. Prof. Jarke was founding director of the Bonn-Aachen International Graduate Center for Information Technology (B-IT) , and was Inaugural Dean of Engineering and Computer Science at the German University of Technology in Oman (GUTech). As President of the German Informatics Society (GI) from 2004-2007, he was also scientific coordinator of the 2006 Year of Informatics of the German BMBF in which Chancellor Merkel started the annual IT summit (now digitalization summit). Since 2018, Prof. Jarke chairs the Board of Governors (Hochschulrat) of TH Köln and serves as advisor to private and public organizations, e.g. in the steering boards of the Excellence Cluster \"Internet of Production\" and the national lighhouse project \"Culture Dataspace\". Jarke is Fellow of the ACM and the GI, and elected member of the acatech National Academy of Engineering and Sciences. Curriculum Vitae List of Publications at DBLP Contact hours by appointment.Projects:Cluster of Excellence Internet of ProductionTheses:Utilizing Chatbots to Gamify Learning Activities and Their Effect on Motivation (Finished)A Web Frontend for Blockchain-based Proofs of Qualification (Finished)A Unified Bot Modeling Language (Finished)Building a MediaBase for Future Computer Science Research (Finished)Web-based Cluster Deployment for a Large-Scale Distributed Infrastructure (Finished)Chat Assessments with Social Bots (Finished)Versioning and Access Management in Web-Based Collaborative Model-Driven Web Engineering (Finished)Blockchain-based Verification of Learning Analytics Data (Finished)Secure and User-friendly Authentication for a Decentralized Service Platform (Finished)A Multimodal Mentoring Cockpit for Tutor Support (Finished)Chat Interfaces for Social Bots in a Peer-to-Peer Environment (Finished)Integrating End Users Into Service Success Evaluation Processes (Finished)Transformation of Knowledge Graph Elements into Real-World Objects (Finished)Chatbot-assisted Community Analysis (Finished)Publications: Loading publications Entries Comments SearchSearch Quick Links News Staff Job Offers Thesis Projects Resources Featured Videos How to find us ContactProf. Dr. S. DeckerRWTH Aachen UniversityLehrstuhl Informatik 5Ahornstr. 5552074 AachenTel +49/241/80-21509Fax +49/241/80-22321 Recent News Inaugural Meeting of the JUPITER AI Factory (JAIF) Call for Papers: Semantics in Dataspaces (SDS25) @ESWC 2025 Best Academic Reviewer Award at the iLRN 2024 Call for Papers: LLMs4MI2024 Workshop in Dubai Nachruf auf Prof. Dr. rer.pol. Matthias Jarke Recent Publications Loading publications top RWTH Main Page Faculty of Mathematics, Computer Science and Natural Sciences Department of Computer Science Knowledge-Based Systems Group Fraunhofer FIT",
  "content_length": 4242,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:13"
}