{
  "name": "Matthew Hague",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/matthew-hague(c4baa4a0-192e-49c8-a699-feda6a04a583).html",
  "status": "success",
  "content": "Matthew Hague - Royal Holloway Research Portal Matthew Hague Professor Professor, Department of Computer ScienceCentre for Programming Languages and Systems Phone+44 1784 443673EmailMatthew.Haguerhul.acuk TW20 0EX Personal profile Personal profileI am interested in theoretical and practical/implementational aspects of infinite-state verification, with a focus on higher-order recursion and counter systems. Please see my personal homepage for up-to-date information and paper/software downloads. KeywordsVerificationHigher-OrderAutomataCountersModel-CheckingSoftwareInfinite-State Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 31 Conference contribution 6 Article 2 Paper 1 Chapter (peer-reviewed) 3 More 1 Internet publication 1 Doctoral Thesis 1 Master's Thesis Research output per year Research output per year OSTRICH2: Solver for Complex String ConstraintsHague, M., Hu, D., Jeż, A., Lin, A., Markgraf, O., Rümmer, P. & Wu, Z., 1 Jul 2025, (Accepted/In press) Formal Methods in Computer-Aided Design (FMCAD).Research output: Chapter in Book/Report/Conference proceeding › Chapter (peer-reviewed) › peer-review Open AccessFile 8 Downloads (Pure) The Power of Regular Constraint PropagationHague, M., Jeż, A., Lin, A., Markgraf, O. & Rümmer, P., 9 Oct 2025, Proceedings of the ACM on Programming Languages (PACMPL): Object-Oriented Programming, Systems, Languages & Applications (OOPSLA). 2025 ed. ACM, Vol. OOPSLA. p. 3203-3231 29 p. 387Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Parikh's Theorem Made SymbolicHague, M., Jeż, A. & Lin, A., 5 Jan 2024, Principles of Programming Languages. p. 1945-1977 33 p. 65Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 66 Downloads (Pure) Solving String Constraints With Regex-Dependent Functions Through Transducers With Priorities And VariablesChen, T., Flores Lamas, A., Hague, M., Han, Z., Hu, D., Kan, S., Lin, A., Ruemmer, P. & Wu, Z., 12 Jan 2022, (E-pub ahead of print) Principles of Programming Languages 2022. ACM, Vol. 6. p. 1-31 31 p. 45Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access 8 Downloads (Pure) Collapsible Pushdown Parity GamesHague, M., Serre, O., Carayol, A., Ong, C.-H. L., Murawski, A. & Broadbent, C., 22 Jul 2021, In: ACM Transactions on Computational Logic. 22, 3, p. 1 51 p., 16.Research output: Contribution to journal › Article › peer-review Open AccessFile 57 Downloads (Pure) View all 43 research outputs Projects 2 Finished Projects per year String Constraint Solving with Real-World Regular ExpressionsHague, M. (PI)Eng & Phys Sci Res Council EPSRC1/07/19 → 30/06/22Project: Research Verification of Concurrent and Higher-Order Recursive ProgramsHague, M. (PI)Eng & Phys Sci Res Council EPSRC1/05/13 → 30/04/18Project: Research Activities 19 Participation in a conference 11 Workshop, seminar, course or webinar. Activities per year International Colloquium on Automata, Languages and Programming and ACM Symposium on Principles of Distributed Computing and ACM Symposium on Parallelism in Algorithms and ArchitecturesHague, M. (Organiser)6 Jul 2026 → 10 Jul 2026Activity: Participating in or organising an event › Participation in a conference Principles of Programming LanguagesHague, M. (Member of programme committee)11 Jan 2026 → 17 Jan 2026Activity: Participating in or organising an event › Participation in a conference Meeting on String Constraints and ApplicationsHague, M. (Organiser), Lengál, O. (Organiser) & Day, J. (Organiser)22 Jul 2025Activity: Participating in or organising an event › Workshop, seminar, course or webinar. ACM/IEEE Symposium on Logic in Computer ScienceHague, M. (Member of programme committee)2 Aug 2023 → 5 Aug 2023Activity: Participating in or organising an event › Participation in a conference Principles of Programming LanguagesHague, M. (Member of programme committee)16 Jan 2022 → 22 Jan 2022Activity: Participating in or organising an event › Participation in a conference View all 30 activities Datasets OSTRICH: String Constraint SolverHague, M. (Creator) & Ruemmer, P. (Creator), Royal Holloway, University of London, 2018https://github.com/pruemmer/ostrichDataset Data and source code for SatCSSHague, M. (Creator), Lin, A. (Creator) & Hong, C.-D. (Creator), Royal Holloway, University of London, 5 Dec 2018https://royalholloway.figshare.com/articles/Data_and_Source_Code_for_Sat_CSS/7277324Dataset",
  "content_length": 4827,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:55"
}