{
  "name": "Matti Järvisalo",
  "homepage": "https://www.cs.helsinki.fi/u/mjarvisa",
  "status": "success",
  "content": "Matti Järvisalo Matti Jarvisalo Matti Järvisalo [News and Highlights] [Research] [Publications] [Activities] [Teaching] Professor of Computer Science Principal Investigator Constraint Reasoning and Optimization Docent Department of Computer Science Faculty of Science University of Helsinki D.Sc.(Tech.), Lic.Sc.(Tech.), M.Sc.(Tech.) Helsinki University of Technology (today Aalto U.) Postal Address: Department of Computer Science / HIIT P.O. Box 68 FI-00014 University of Helsinki Finland Office:Room A312, 3rd floor of Exactum, wing A Pietari Kalmin katu 5 Telephone: +358 50 3199 248 Email: matti.jarvisalohelsinki.fi I lead the Constraint Reasoning and Optimization Group at the University of Helsinki. News See also recent work for new publications. In 2026 on the Senior PC of AAAI and on the PCs of CPAIOR, FoIKS, ICAPS, SAC KRR track, and SAT. Organizing the 2025 Dagstuhl Seminars Interactions in Constraint Optimization (as main organizer) and Competitions and Empirical Evaluations in Automated Reasoning (as co-organizer). Co-chairing the 1st Workshop on Explanations with Constraints and Satisfiability (ExCoS 2025) together with Bart Bogaers, Tias Guns and Jussi Rintanen. In 2025 on the Senior PC of IJCAI and the PCs of AAMAS, CP, CP/SAT DP, CPAIOR, ECAI, ESSAI, ICAPS, KR: In the Wild Track, KR: KR and Constraints Track , SAT, SAC and SoCS. I am Associate Editor of Journal of Artificial Intelligence Research as well as Editor of Journal of Automated Reasoning and Journal on Satisfiability, Boolean Modeling and Computation. My current research project Next-generation Unsatisfiability-based Declarative Optimization (9/2013-8/2027) is funded by Research Council of Finland. Further activities are listed here. Research Research Interests Automated reasoning, decision procedures, Boolean satisfiability (SAT) and generalizations, combinatorial/discrete optimization, operations research, knowledge representation, complexity of reasoning, computational aspects of argumentation, probabilistic graphical models, structure discovery, ... Awards, Honors and Invited Talks CP 2025 Best Student Paper Award to my PhD student Hannes Ihalainen for our joint paper 1st place in tracks 1 and 2 (unweighted and weighted model counting) in Model Counting Competition 2023 1st (track 2) and 2nd (track 1) places in Model Counting Competition 2022 University of Helsinki Outstanding Thesis Award of the Doctoral School in Natural Sciences 2022 Award to my PhD student Kari Rantanen 1st place in tracks 1, 2 and 4 in Model Counting Competition 2021 Best Finnish PhD Thesis in Computer Science Award 2021 (by Finnish Information Processing Association) to my PhD student Andreas Niskanen Vienna Center of Logic and Algorithms (VCLA) Outstanding Master Thesis Award 2021 to my MSc student Tuukka Korhonen Invited talk at the 4th Workshop on Advances in Argumentation In Artificial Intelligence, Italy/Online, 2020. Association for Constraint Programming (ACP) Doctoral Research Award 2020 to my PhD student Jeremias Berg 2019 IJCAI-JAIR Best Paper Prize Keynote talk at AI Day 2019, Finland ICCMA 2019 Best Solver (both main track and dynamic track) University of Helsinki 2019 Doctoral Dissertation Award to my PhD student Jeremias Berg Keynote talk at2nd International Workshop on Systems and Algorithms for Formal Argumentation (SAFA 2018), Poland PGM 2018 Best Student Paper Award to my PhD student Kari Rantanen for our joint paper CP 2017 Distinguished Paper Award IJCAI 2016 Early Career Spotlight as one of 22 (6 within Europe) most active early career researchers in all representative areas of AI. Invited talk at 1st International Workshop on Argumentation in Logic Programming and Non-Monotonic Reasoning (at IJCAI 2016), USA ECAI 2016 Runner-Up Best Student Paper Award to my PhD student Andreas Niskanen for our joint paper Best solver at MaxSAT Evaluation 2015 on industrial and crafted weighted partial MaxSAT instances ICCMA 2015 Honorary Mention KR 2012 Distinguished Student Paper Prize 2011 Best Researcher Award at Department of Computer Science, University of Helsinki. Runner-up for the CP 2007 Best Paper Award ICLP 2007 Best Student Paper Award Projects Next-generation Unsatisfiability-based Declarative Optimization (9/2023-8/2027; PI) funded by Research Council of Finland Declarative Boolean Optimization: Pushing the Envelope (9/2019-8/2023; PI) funded by Academy of Finland (Academy project funding for early-career researchers) Symbolic Reasoning for Formally Verified and Explainable AI (2020-2022; PI) funded by Academy of Finland (ICT 2023 Autonomous Everything) Decision Procedures for the Polynomial Hierarchy, Boolean Optimization, and Model Counting (9/2014-8/2019; PI), funded by Academy of Finland (Academy Research Fellow funding scheme) Harnessing Constraint Reasoning for Structure Discovery (2015-2018; PI), Research Funds of the University of Helsinki (Three-year Research Projects funding scheme) Extending the Reach of Boolean Constraint Reasoning (1/2010-4/2013; PI), Academy of Finland (Postdoctoral Project funding scheme) Finnish Centre of Excellence in Computational Inference Research COIN (2012-2017), Academy of Finland (member) Lightweight Formal Methods for Distributed Component-based Embedded Systems (2009), Tekes (member) Methods for Constructing and Solving Large Constraint Models (2008-2009), Academy of Finland (member) Advanced Constraint Programming Techniques for Large Structured Problems (2005-2007), Academy of Finland (member) Applications of Rule-Based Constraint Programming (2002-2005), Academy of Finland (member) Publications A complete list of my publications with downloadable papers and bibtex entries is available both by year and by type. External sources: DBLP entry, Google Scholar profile, Semantic Scholar, Orcid ID 0000-0003-2572-063X, Scopus Author ID 23397451200. Some recent work Ordered Objectives in Maximum Satisfiability, AAAI 2026 [pdf] Symmetry Breaking for Inductive Logic Programming, AAAI 2026 [pdf] Efficient and Reliable Hitting-Set Computations for the Implicit Hitting Set Approach, AAAI 2026 [pdf] Cost-Optimal Delete-Free Classical Planning via Maximum Satisfiability, KR 2025 [pdf] Reasoning in Assumption-Based Argumentation via SAT, KR 2025 [pdf] Engineering and Evaluating Multi-objective Pseudo-Boolean Optimizers, JELIA 2025 [pdf] Symmetric Core Learning for Pseudo-Boolean Optimization by Implicit Hitting Sets, CP 2025 [pdf] Computing Efficient and Envy-Free Allocations under Dichotomous Preferences using SAT, AAMAS 2025 [pdf] Certifying Pareto-Optimality in Multi-Objective Maximum Satisfiability, TACAS 2025 [pdf] Argumentative Reasoning in ASPIC+ under Incomplete Information, J. Artif. Intell. Res. (2025) [pdf] ICCMA 2023: 5th International Competition on Computational Models of Argumentation, Artif. Intell. (2025) [pdf] Declarative Approaches to Outcome Determination in Judgment Aggregation, J. Artif. Intell. Res. (2024) [pdf] Unifying SAT-Based Approaches to Maximum Satisfiability Solving, J. Artif. Intell. Res. (2024) [pdf] From Single-Objective to Bi-Objective Maximum Satisfiability Solving, J. Artif. Intell. Res. (2024) [pdf] Complexity Results and Algorithms for Manipulation and Bribery in Judgment Aggregation, ECAI 2024 [pdf] SAT-Based Approaches to Reasoning in Choice Logics, ECAI 2024 [pdf] Complexity Results and Algorithms for Preferential Argumentative Reasoning in ASPIC+, KR 2024 [pdf] Certified MaxSAT Preprocessing, IJCAR 2024 [pdf] Learning Big Logical Rules by Joining Small Rules, IJCAI 2024 [pdf] Core Boosting in SAT-Based Multi-Objective Optimization, CPAIOR 2024 [pdf] Learning MDL Logic Programs from Noisy Data, AAAI 2024 [pdf] Unifying Core-Guided and Implicit Hitting Set based Optimization, IJCAI 2023 [pdf] SAT-based Judgment Aggregation, AAMAS 2023 [pdf] Preprocessing in SAT-Based Multi-Objective Combinatorial Optimization, CP 2023 [pdf] Oracle-Based Local Search for Pseudo-Boolean Optimization, ECAI 2023 [pdf] MaxSAT-Based Inconsistency Measurement, ECAI 2023 [pdf] Argumentative Reasoning in ASPIC+ under Incomplete Information, KR 2023 [pdf] Computing MUS-Based Inconsistency Measures, JELIA 2023 [pdf] Research-Related Software See here. Professional Activities Editorial Board Memberships Journal of Artificial Intelligence Research, 2025- Journal of Automated Reasoning, 2021- Journal of Satisfiability, Boolean Modeling and Computation, 2018- Steering Committee Memberships and Related PoS: International Workshops on Pragmatics of SAT, 2023- ICCMA: International Competitions on Computational Models of Argumentation, 2023- PB Comp: Pseudo-Boolean Competitions, 2024 SAT Test-of-Time Award Committee, 2022- SAT: International Conferences on Theory and Applications of Satisfiability Testing, 2013-2017. Organization Competitions: Co-organizer, SAT Competition 2024, 2023, 2022, 2021, 2020, 2018, 2017, 2016, 2014, 2013, 2011 Co-organizer, MaxSAT Evaluation 2024, 2023, 2022, 2021, 2020, 2019, 2018, 2017 Co-organizer, ICCMA 2023: 5th International Competition on Computational Models of Argumentation Co-organizer, SAT Race 2019 Co-organizer, SAT Challenge 2012 Conferences: Local Chair, FoIKS 2022: 12th International Symposium on Foundations of Information and Knowledge Systems , June 20-23, 2022, Helsinki, Finland Local Chair, SAT 2013: 16th International Conference on Theory and Applications of Satisfiability Testing, July 8-12, 2013, Helsinki, Finland Co-organizer, SAT-SMT Summer School 2013 Local organizer, SWAT 2012: 13th Scandinavian Symposium and Workshops on Algorithm Theory, July 4-6, 2012, Helsinki, Finland Local Chair, JELIA 2010: 12th European Conference on Logics in Artificial Intelligence, September 13-15, 2010, Helsinki, Finland Program Committee Chairing, Guest Editorials, Senior PC Memberships Senior PC member, AAAI 2026: 40th Annual AAAI Conference on Artificial Intelligence PC Chair, ExCoS 2025: 1st Workshop on Explanations with Constraints and Satisfiability Senior PC member, IJCAI 2",
  "content_length": 23813,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:21"
}