{
  "name": "Matthew D. Green",
  "homepage": "https://isi.jhu.edu/~mgreen",
  "status": "success",
  "content": "Matthew D. Green Matthew D. Green Associate Professor Department of Computer Science Johns Hopkins University I am an Associate Professor at the Johns Hopkins Information Security Institute. My research includes techniques for privacy-enhanced information storage, anonymous payment systems, and bilinear map-based cryptography. I am one of the creators of the Zerocash protocol, which is used by the Zcash cryptocurrency, and a founder of Sealance, which enables regulatory compliance for digital assets.   I was formerly a partner in Independent Security Evaluators, a custom security evaluation and design consultancy and I currently consult independently. From 1999-2003, I served as a senior technical staff member at AT&T Laboratories/Research in Florham Park, NJ. Research Interests My research focus is in the area of applied cryptography. My recent work includes developing privacy-preserving cryptographic protocols for implementing anonymous electronic cash and identification. I have also developed protocols that allow users to access databases without revealing which data they're accessing. Additionally, I have been working on new automation techniques to assist in the design and deployment of advanced cryptographic protocols. I also work in the area of cryptographic engineering. This work involves understanding the practical aspects of cryptographic systems, implementing cryptographic protocols, and in some cases reverse-engineering deployed systems. I teach an introductory course on this subject. Additionally, I've designed several cryptographic tools, including Charm, a framework for rapidly prototyping cryptosystems, and a Functional Encryption library that provides implementations of several new Attribute Based Encryption schemes. Teaching 601.741: Advanced Topics in Secure and Censorship-Resistant Communications.   Spring 2021. 601.445, 601.645: Practical Cryptographic Systems.   Fall 2021. Previously: Spring 2021, Fall 2018, Fall 2017, 2016, Spring 2015, 2014, 2013. Fall 2012. Spring 2011, 2010, 2009. 601.641/601.441: Blockchains and Cryptocurrencies.   Fall 2020, Spring 2019. 601.745: Advanced Topics in Applied Cryptography.   Spring 2018. 600.444: Computer Networks.   Spring 2017. 600.443: Security and Privacy in Computing.   Fall 2015. 600.642: Advanced Topics in Cryptography.   Fall 2011. My Blog A Few Thoughts on Cryptographic Engineering. Started as a lazy man's attempt to write a book on practical crypto topics, this has gradually taken on a life of its own. Conference Papers \"Squint Hard Enough: Evaluating Perceptual Hashing with Machine Learning\". J. Prokos, T. M. Jois, N. Fendley, R. Schuster, M. Green, E. Tromer, and Y. Cao   To appear in Usenix Security 2023.  (ePrint PDF) \"One-Time Programs from Commodity Hardware\".  H. Eldridge, A. Goel, M. Green, A. Jain, and M. Zinkus   To appear in TCC 2022. \"Stacking Sigmas: A Framework to Compose Sigma-Protocols for Disjunctions\". A. Goel, M. Green, M. Hall-Andersen, G. Kaptchuk  In EUROCRYPT 2022.  (ePrint PDF) \"Efficient Set Membership using MPC-in-the-head\".  A. Goel, M. Green, M. Hall-Andersen, G. Kaptchuk  In PoPETS 2022.  (ePrint PDF) \"SoK: Cryptographic Confidentiality of Data on Mobile Devices\".  M. Zinkus, T. M. Jois, M. Green  In PoPETS 2022.  (ePrint PDF), (full version arXiv) \"Fluid MPC: Secure Multiparty Computation with Dynamic Participants\".  A. R. Choudhuri, A. Goel, M. Green, A. Jain, G. Kaptchuk  In CRYPTO 2021.  (ePrint PDF) \"Fuzzy Message Detection\".  G. Beck, J. Len, I. Miers, M. Green  To appear in ACM CCS 2021.  (ePrint PDF) \"Meteor: Cryptographically Secure Steganography for Realistic Distributions\".  G. Kaptchuk, T. Jois, M. Green, A. Rubin  In ACM CCS 2021.  (ePrint PDF) \"Abuse-Resistant Law Enforcement Access Systems\".  M. Green, G. Kaptchuk, G. van Laer  To appear in EUROCRYPT 2021.  (ePrint PDF) \"KeyForge: Non-Attributable Email from Forward-Forgeable Signatures\".  M. A. Specter, S. Park, M. Green.  To appear in Usenix Security 2021.  (Usenix preprint), (ePrint PDF) \"Using SMT Solvers to Automate Chosen Ciphertext Attacks\".  G. Beck, M. Zinkus, M. Green.  In Usenix Security 2020.  (ePrint PDF) \"ZEXE: Enabling Decentralized Private Computation\".  S. Bowe, A. Chiesa, M. Green, I. Miers, P. Mishra, H. Wu.  In IEEE Symposium on Security & Privacy 2020.  (ePrint PDF) \"Giving State to the Stateless: Augmenting Trustworthy Computation with Ledgers\".  G. Kaptchuk, M. Green, I. Miers.  In NDSS 2019.  (ePrint PDF) \"Practical state recovery attacks against legacy RNG implementations\".  S. Cohney, M. Green, N. Heninger.  In ACM CCS 2018.  (PDF) \"How to Squeeze a Crowd: Reducing Bandwidth in Mixing Cryptocurrencies\".  A. Chator and M. Green.  In IEEE S&P On the Blockchain.  (PDF) \"Fairness in an Unfair World: Computation from Append-only Ledgers\".  A. Choudhuri, M. Green, A. Jain, G. Kaptchuk, I. Miers.  In ACM CCS 2017.  (ePrint PDF) \"Verified Correctness and Security of mbedTLS HMAC-DRBG\".  K. Ye, M. Green, N. Sanguansin, L. Beringer, A. Petcher, A. Appel.  In ACM CCS 2017.  (PDF) \"Bolt: Anonymous Payment Channels for Decentralized Currencies\".  M. Green, I. Miers  In ACM CCS 2017.  (ePrint PDF) \"Outsourcing Medical Dataset Analysis: A Possible Solution\".  G. Kaptchuk, M. Green, A. Rubin  In Financial Cryptography 2017. (PDF) \"Decentralized Anonymous Micropayments\".  A. Chiesa, M. Green, J. Liu, P. Miao, I. Miers, P. Mishra.  In EUROCRYPT 2017. (PDF) \"A Systematic Analysis of the Juniper Dual EC Incident\".  S. Checkoway, J. Maskiewicz, C. Garman, J. Fried, S. Cohney, M. Green, N. Heninger, R.P. Weinmann, E. Rescorla, H. Shacham.  In ACM CCS 2016. (PDF) \"A Protocol for Privately Reporting Ad Impressions at Scale\".  M. Green, W. B. Ladd, I. Miers.  In ACM CCS 2016. (PDF) \"A Unified Approach to Idealized Model Separations via Indistinguishability Obfuscation\".  M. Green, J. Katz, A. Malozemoff, H-S. Zhou.  To appear in Security and Cryptography for Networks (SCN) 2016.  (ePrint PDF) \"Dancing on the Lip of the Volcano: Chosen Ciphertext Attacks on Apple iMessage\".  C. Garman, M. Green, G. Kaptchuk, I. Miers, M. Rushanan.  To appear in Usenix Security 2016.  (PDF) \"Downgrade Resilience in Key-Exchange Protocols\".  K. Bhargavan, C. Brzuska, C. Fournet, M. Green, M. Kohlweiss, S. Zanella-Béguelin.  In IEEE Symposium on Security and Privacy (Oakland) 2016.  (PDF) \"Accountable Privacy for Decentralized Anonymous Payments\".  C. Garman, M. Green, I. Miers.  In Financial Cryptography 2016.  (PDF) \"Imperfect Forward Secrecy: How Diffie-Hellman Fails in Practice\".  D. Adrian, K. Bhargavan, Z. Durumeric, P. Gaudry, M. Green, J. A. Halderman, N. Heninger, D. Springall, E. Thomé, L. Valenta, B. VanderSloot, E. Wustrow, S. Zanella-Béguelin, P. Zimmermann.  In ACM CCS 2015. (Site) (PDF) \"Forward Secure Asynchronous Messaging from Puncturable Encryption\".  M. Green, I. Miers.  In IEEE Symposium on Security and Privacy (Oakland) 2015.  (PDF) \"Secure Sampling of Public Parameters for Succinct Zero Knowledge Proofs\".  E. Ben-Sasson, A. Chiesa, M. Green, E. Tromer, M. Virza.  In IEEE Symposium on Security and Privacy (Oakland) 2015.  (PDF) \"On the Practical Exploitability of Dual EC in TLS Implementations\".  S. Checkoway, M. Fredrikson, R. Niederhagen, M. Green, T. Lange, T. Ristenpart, D. J. Bernstein, J. Maskeiwicz, H. Shacham.  In Usenix Security 2014. (Website) (PDF) \"Automated Analysis and Synthesis of Block-Cipher Modes of Operation\".  M. Green, J. Katz, A. Malozemoff.  In CSF 2014. (PDF) \"Zerocash: Practical Decentralized Anonymous E-Cash from Bitcoin\".  E. Ben-Sasson, A. Chiesa, C. Garman, M. Green, I. Miers, E. Tromer, M. Virza.  In IEEE Symposium on Security and Privacy (Oakland) 2014. \"Rational Zero: Economic Security for Zerocoin with Everlasting Anonymity\".  C. Garman, M. Green, I. Miers, A. Rubin.  In First Workshop on Bitcoin Research (BITCOIN '14). (PDF) \"Decentralized Anonymous Credentials\".  C. Garman, M. Green, I. Miers.  In NDSS 2014. \"Using SMT Solvers to Automate Design Tasks for Encryption and Signature Schemes\".  A. Akinyele, M. Green, S. Hohenberger.  In ACM CCS 2013. \"Zerocoin: Anonymous Distributed e-Cash from Bitcoin\".  I. Miers, C. Garman, M. Green, A. Rubin.  In IEEE Symposium on Security and Privacy (Oakland) 2013. (PDF) \"Machine-Generated Algorithms, Proofs and Software for the Batch Verification of Digital Signature. Schemes\".  A. Akinyele, M. Green, S. Hohenberger, M. Pagano.  In CCS 2012. (Springer) (ePrint PDF) \"Vis-a-Vis Cryptography: Private and Trustworthy In-Person Certifications\".  I. Miers, M. Green, C. Lehman, A. Rubin.  In Healthsec 2012. (PDF) \"New Definitions and Separations for Circular Security\".  D. Cash, M. Green, S. Hohenberger.  In PKC 2012 (ePrint PDF) \"Self-Protecting Electronic Medical Records Using Attribute-Based Encryption\".  J. A. Akinyele, C. Lehmann, M. Green, M. Pagano, Z. Peterson, A. Rubin.  In ACM CCS SPSM 2011 (ePrint PDF) \"Outsourcing the Decryption of ABE Ciphertexts\".  M. Green, S. Hohenberger, B. Waters. In Usenix Security 2011. \"A Research Roadmap for Healthcare IT Security Inspired by the PCAST Health Information Technology Report\".  M. Green, A. Rubin. In HealthSec 2011. (PDF) \"Practical Oblivious Transfer from Simple Assumptions\".  M. Green, S. Hohenberger. In TCC 2011. (ePrint draft, PDF) \"Secure Blind Decryption\".  M. Green. In PKC 2011. (ePrint PDF). \"Synchronized Aggregate Signatures\".  J. H. Ahn, M. Green, S. Hohenberger. In ACM CCS 2010. (eprint PDF) \"On the Practicality of Short Signature Batch Verification\".  A. L. Ferrara, M. Green, S. Hohenberger, M. O. Pedersen. In CT-RSA 2009. (ePrint PDF) \"Securing Medical Records on Smart Phones\".  R. W. Gardner, S. Garera, M. W. Pagano, M. Green and A. Rubin. In SPIMACS 2009. \"Controlling Access to an Oblivious Database using Stateful Anonymous Credentials\".  S. Coull, M. Green, S. Hohenberger.  In PKC 2009.  (ePrint PDF) \"Universally Composable Adaptive Oblivious Transfer\".  M. Green, S. Hohenberger.  In ASIACRYPT 2008.  (ePrint PDF) \"B",
  "content_length": 19688,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:50"
}