{
  "name": "Matthijs van Leeuwen",
  "homepage": "https://patternsthatmatter.org",
  "status": "success",
  "content": "Matthijs van Leeuwen ~ Patterns that Matter Patternsthat Matter Matthijs van Leeuwen News and updates 10.07.2023 Our paper titled A Survey on Explainable Anomaly Detection, with Zhong Li and Yuxuan Zhu, got accepted for publication in Transactions on Knowledge Discovery from Data. Congratulations Zhong and Yuxuan! 06.07.2023 Our paper titled WEARDA: recording wearable sensor data for human activity monitoring, with Richard van Dijk and Daniela Gawehns, got accepted for publication in the Journal of Open Research Software. Congratulations Richard and Daniela! 21.06.2023 Our paper titled Explainable Contextual Anomaly Detection using Quantile Regression Forests, with Zhong Li, got accepted for publication in Data Mining and Knowledge Discovery. Congratulations Zhong! 23.01.2023 Our paper titled Discovering Rule Lists with Preferred Variables, with Ioanna Papagianni, got accepted at IDA 2023. Congratulations Ioanna! 23.01.2023 Our paper titled Discovering diverse top-k characteristic lists, with Antonio Lopez-Martinez-Carrasco, Hugo M. Proença, Jose M. Juarez, and Manuel Campos, got accepted at IDA 2023. Congratulations Antonio! 14.12.2022 Our paper titled Feature Selection for Fault Detection and Prediction based on Event Log Analysis, with Zhong Li, got accepted for publication in the ACM SIGKDD Explorations Newsletter. Congratulations Zhong! 09.12.2022 Our paper titled Unsupervised Discretization by Two-dimensional MDL-based Histogram, with Lincen Yang and Mitra Baratchi, got accepted for publication in Machine Learning. Congratulations Lincen! 14.09.2022 Our paper titled Generating synthetic mixed discrete-continuous health records with mixed sum-product networks, with Shannon Kroes, Rolf Groenwold, and Mart Janssen got accepted for publication in the Journal of the American Medical Informatics Association. Congratulations Shannon! 01.09.2022 I am now Director of Education of LIACS' Master's programmes, and in that role also a member of the institute's management team. 01.09.2022 Francesco Bariatti has joined the EDA group as a postdoctoral researcher. Welcome Francesco! 14.08.2022 Our paper titled Explainable hemoglobin deferral predictions using machine learning models: interpretation and consequences for the blood supply, with Marieke Vinkenoog et al. got accepted for publication in Vox Sanguinis. Congratulations Marieke! 22.07.2022 Our paper titled Feature Selection for Fault Detection and Prediction based on Log Analysis, with Zhong Li, got accepted at the AI for manufacturing workshop at ECML PKDD 2022. Congratulations Zhong! 21.07.2022 Our paper titled Histogram-based Probabilistic Rule Lists for Numeric Targets, with Lincen Yang and Tim Opdam, got accepted at the KDID 2022 workshop at ECML PKDD 2022. Congratulations Lincen and Tim! 14.06.2022 Our paper titled Truly Unordered Probabilistic Rule Sets for Multi-class Classification, with Lincen Yang, got accepted at ECML PKDD 2022. Congratulations Lincen! 14.03.2022 Our paper titled Robust Subgroup Discovery, with Hugo Proença, Peter Grünwald, and Thomas Bäck, got accepted for publication in Data Mining and Knowledge Discovery. Congratulations Hugo! 03.02.2022 Our paper titled Associations between symptoms, donor characteristics and IgG antibody response in 2082 COVID-19 convalescent plasma donors, with Marieke Vinkenoog et al. got accepted for publication in Frontiers in Immunology. Congratulations Marieke! 27.01.2022 I received the Senior Teaching Qualification (SKO) certificate! Read the news article. 20.01.2022 Our paper titled Finding Efficient Trade-offs in Multi-Fidelity Response Surface Modeling, with Sander van Rijn, Sebastian Schmitt, and Thomas Bäck got accepted for publication in Engineering Optimization. Congratulations Sander! I am associate professor and director of education at the Leiden Institute of Advanced Computer Science (LIACS), the computer science institute of Leiden University. I am group leader of the Explanatory Data Analysis group. My primary research interest is exploratory data mining: how can we enable domain experts to explore and analyse their data, to discover structure and—ultimately—novel knowledge? For this it is important that methods and results are explainable to domain experts, who may not be data scientists. My signature approach is to define and identify patterns that matter, i.e., succinct descriptions that characterise relevant structure present in the data. Which patterns matter strongly depends on the data and task at hand, hence defining the problem is one of the key challenges of exploratory data mining. Information theoretic concepts such as the Minimum Description Length (MDL) principle have proven very useful to this end. I am also interested in interactive data mining, i.e., involving humans in the loop. Finally, I am interested in fundamental data mining research for real-world applications, both in science (e.g., life sciences, social sciences) and industry (e.g., manufacturing and engineering, aviation), as this is the best way to show that the theory works in practice. I am affiliated with SAILS, the university-wide research programme for artificial intelligence. Broadly speaking, my research can be situated in the fields of data mining, machine learning, data science, and artificial intelligence (AI). see all Selected recent publications 2026 Yang, L, Li, Z, van Leeuwen, M & Salehkaleybar, S Learning Subgroups with Maximum Treatment Effects without Causal Heuristics. In: Proceedings of the AAAI Conference on Artificial Intelligence (AAAI 2026), 2026. 2025 Li, Z, Huang, Q, Zhu, Y, Yang, L, Mohammadi Amiri, M, van Stein, N & van Leeuwen, M Scalable, Explainable and Provably Robust Anomaly Detection with One-Step Flow Matching. In: Proceedings of the Conference on Neural Information Processing Systems (NeurIPS 2025), 2025. Yang, L, van der Meijden, S, Arbous, S & van Leeuwen, M Interpretable Machine Learning for Identifying ICU Readmission Risk in Subgroups with Probabilistic Rules. Journal of the American Medical Informatics Association, Oxford Journals van Leeuwen, M & Vreeken, J Challenges and Algorithms for Knowledge Discovery from Data - Essays Dedicated to Arno Siebes on the Occasion of His 67th Birthday. Springer, 2025. van Leeuwen, M & Vreeken, J Snor: Simpler Descriptions Through Overlapping Patterns. In: van Leeuwen, M & Vreeken, J (eds) Challenges and Algorithms for Knowledge Discovery from Data, pp 56-74, Springer, 2025. Lopez-Martinez-Carrasco, A, Proença, HM, Juarez, JM, van Leeuwen, M & Campos, M Discovering multiple antibiotic resistance phenotypes using diverse top-k subgroup list discovery. Artificial Intelligence In Medicine vol.167, Elsevier, 2025. Li, Z, Wang, Y & van Leeuwen, M Towards Automated Self-Supervised Learning for Truly Unsupervised Graph Anomaly Detection. Data Mining and Knowledge Discovery vol.39(44), Springer, 2025. Gawehns, D, Portegijs, S, van Beek, APA & van Leeuwen, M Using consumer wearables to estimate physical activity of nursing home residents with dementia. Exploration of Digital Health Technologies vol.3, Open Exploration, 2025. 2024 Yang, L & van Leeuwen, M Conditional Density Estimation with Histogram Trees. In: Proceedings of the Conference on Neural Information Processing Systems (NeurIPS 2024), 2024. Lenz, O & van Leeuwen, M Directional Anomaly Detection. In: Proceedings of BNAIC/BeNeLearn 2024, 2024. Li, Z, Liang, S, Shi, J & van Leeuwen, M Cross-Domain Graph Level Anomaly Detection. Transactions on Knowledge and Data Engineering vol.36(12), ACM, 2024. Li, Z, Zhu, Y & van Leeuwen, M A Survey on Explainable Anomaly Detection. Transactions on Knowledge Discovery from Data vol.18(1), ACM, 2024. Yang, L & van Leeuwen, M Human-guided Rule Learning for ICU Readmission Risk Analysis. In: Proceedings of the Workshop on AI and Data Science for Healthcare (AIDSH) at KDD 2024, 2024. Li, Z, Shi, J & van Leeuwen, M Graph Neural Networks based Log Anomaly Detection and Explanation. In: Proceedings of the 2024 IEEE/ACM 46th International Conference on Software Engineering: Companion Proceedings, pp 306-307, ACM, 2024.",
  "content_length": 8119,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:26"
}