{
  "name": "Matteo Magnani",
  "homepage": "https://katalog.uu.se/empinfo/?id=N13-1077",
  "status": "success",
  "content": "Matteo Magnani - Uppsala universitet Matteo Magnani Professor vid Institutionen för informationsteknologi; Datalogi Telefon: 018-471 40 21E-post: matteo.magnani@it.uu.seBesöksadress: Lägerhyddsvägen 2, hus 1752 37 UppsalaPostadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Matteo Magnani vid Institutionen för informationsteknologi; Datalogi Akademiska meriter: Docent , Excellent lärareORCID: 0000-0002-3437-9018 Nyckelord artificial intelligencedata sciencenetwork sciencesocial network analysiscomputational social sciencesocial data mining Publikationer Senaste publikationer Climate Clash: A Multimodal Analysis of Movement–Countermovement Interactions in the Digital Sphere Uba, Katrin; Segerberg, Alexandra; Magnani, Matteo Ingår i American Behavioral Scientist, 2025 DOI för Climate Clash: A Multimodal Analysis of Movement–Countermovement Interactions in the Digital Sphere Ladda ner fulltext (pdf) av Climate Clash: A Multimodal Analysis of Movement–Countermovement Interactions in the Digital Sphere Leveraging VLLMs for Visual Clustering: Image-to-Text Mapping Shows Increased Semantic Capabilities and Interpretability Arminio, Luigi; Magnani, Matteo; Piqueras, Matias; Rossi, Luca et al. Ingår i Social science computer review, 2025 DOI för Leveraging VLLMs for Visual Clustering: Image-to-Text Mapping Shows Increased Semantic Capabilities and Interpretability Anatomy of a Swedish population-scale network Panayiotou, Georgios; Wohlert, Inga K.; Bask, Miia; Bask, Mikael et al. Ingår i Scientific Reports, 2025 DOI för Anatomy of a Swedish population-scale network Ladda ner fulltext 1 (pdf) av Anatomy of a Swedish population-scale network Ladda ner fulltext 2 (pdf) av Anatomy of a Swedish population-scale network Towards intersectional fairness in community detection Panayiotou, Georgios; Magnani, Matteo; Calikus, Ece Ingår i Workshop Proceedings of the 19th International AAAI Conference on Web and Social Media, 2025 DOI för Towards intersectional fairness in community detection Improved Visual Saliency of Graph Clusters with Orderable Node-Link Layouts Al-Naami, Nora; Médoc, Nicolas; Magnani, Matteo; Ghoniem, Mohammad Ingår i IEEE Transactions on Visualization and Computer Graphics, s. 1028-1038, 2025 DOI för Improved Visual Saliency of Graph Clusters with Orderable Node-Link Layouts Ladda ner fulltext (pdf) av Improved Visual Saliency of Graph Clusters with Orderable Node-Link Layouts Alla publikationer Artiklar i tidskrift Climate Clash: A Multimodal Analysis of Movement–Countermovement Interactions in the Digital Sphere Uba, Katrin; Segerberg, Alexandra; Magnani, Matteo Ingår i American Behavioral Scientist, 2025 DOI för Climate Clash: A Multimodal Analysis of Movement–Countermovement Interactions in the Digital Sphere Ladda ner fulltext (pdf) av Climate Clash: A Multimodal Analysis of Movement–Countermovement Interactions in the Digital Sphere Leveraging VLLMs for Visual Clustering: Image-to-Text Mapping Shows Increased Semantic Capabilities and Interpretability Arminio, Luigi; Magnani, Matteo; Piqueras, Matias; Rossi, Luca et al. Ingår i Social science computer review, 2025 DOI för Leveraging VLLMs for Visual Clustering: Image-to-Text Mapping Shows Increased Semantic Capabilities and Interpretability Anatomy of a Swedish population-scale network Panayiotou, Georgios; Wohlert, Inga K.; Bask, Miia; Bask, Mikael et al. Ingår i Scientific Reports, 2025 DOI för Anatomy of a Swedish population-scale network Ladda ner fulltext 1 (pdf) av Anatomy of a Swedish population-scale network Ladda ner fulltext 2 (pdf) av Anatomy of a Swedish population-scale network Improved Visual Saliency of Graph Clusters with Orderable Node-Link Layouts Al-Naami, Nora; Médoc, Nicolas; Magnani, Matteo; Ghoniem, Mohammad Ingår i IEEE Transactions on Visualization and Computer Graphics, s. 1028-1038, 2025 DOI för Improved Visual Saliency of Graph Clusters with Orderable Node-Link Layouts Ladda ner fulltext (pdf) av Improved Visual Saliency of Graph Clusters with Orderable Node-Link Layouts Do You See What I See?: Emotional Reaction to Visual Content in the Online Debate About Climate Change Rossi, Luca; Segerberg, Alexandra; Arminio, Luigi; Magnani, Matteo Ingår i Environmental Communication, s. 449-467, 2025 DOI för Do You See What I See?: Emotional Reaction to Visual Content in the Online Debate About Climate Change Ladda ner fulltext (pdf) av Do You See What I See?: Emotional Reaction to Visual Content in the Online Debate About Climate Change INet for network integration Policastro, Valeria; Magnani, Matteo; Angelini, Claudia; Carissimo, Annamaria Ingår i Computational statistics (Zeitschrift), s. 1517-1539, 2025 DOI för INet for network integration Ladda ner fulltext (pdf) av INet for network integration On the accurate computation of expected modularity in probabilistic networks Shen, Xin; Magnani, Matteo; Rohner, Christian; Skerman, Fiona Ingår i Scientific Reports, 2025 DOI för On the accurate computation of expected modularity in probabilistic networks Ladda ner fulltext (pdf) av On the accurate computation of expected modularity in probabilistic networks Visual digital intermediaries and global climate communication: Is climate change still a distant problem on YouTube? Segerberg, Alexandra; Magnani, Matteo Ingår i PLOS ONE, 2025 DOI för Visual digital intermediaries and global climate communication: Is climate change still a distant problem on YouTube? Ladda ner fulltext (pdf) av Visual digital intermediaries and global climate communication: Is climate change still a distant problem on YouTube? Current challenges in multilayer network engineering Panayiotou, Georgios; Magnani, Matteo; Pinaud, Bruno Ingår i Applied Network Science, 2024 DOI för Current challenges in multilayer network engineering Ladda ner fulltext (pdf) av Current challenges in multilayer network engineering Immigrant-critical alternative media in online conversations Yantseva, Victoria; Vega D'Aurelio, Davide; Magnani, Matteo Ingår i PLOS ONE, 2023 DOI för Immigrant-critical alternative media in online conversations Ladda ner fulltext (pdf) av Immigrant-critical alternative media in online conversations Deep neural networks for social visuals: studying climate communication on YouTube Magnani, Matteo; Segerberg, Alexandra Ingår i Selected Papers of Internet Research, SPIR, 2021 DOI för Deep neural networks for social visuals: studying climate communication on YouTube Probabilistic network sparsification with ego betweenness Kaveh, Amin; Magnani, Matteo; Rohner, Christian Ingår i Applied Network Science, 2021 DOI för Probabilistic network sparsification with ego betweenness Ladda ner fulltext (pdf) av Probabilistic network sparsification with ego betweenness Community Detection in Multiplex Networks Magnani, Matteo; Hanteer, Obaida; Interdonato, Roberto; Rossi, Luca et al. Ingår i ACM Computing Surveys, 2021 DOI för Community Detection in Multiplex Networks Analysis of Multiplex Social Networks with R Magnani, Matteo; Rossi, Luca; Vega, Davide Ingår i Journal of Statistical Software, s. 1-30, 2021 DOI för Analysis of Multiplex Social Networks with R Ladda ner fulltext (pdf) av Analysis of Multiplex Social Networks with R Defining and measuring probabilistic ego networks Kaveh, Amin; Magnani, Matteo; Rohner, Christian Ingår i Social Network Analysis and Mining, 2021 DOI för Defining and measuring probabilistic ego networks Observing the tech, using meetup data to observe the evolution of the discourse around IoT Rossi, Luca; Magnani, Matteo; Vega D'Aurelio, Davide; Hanteer, Obaida Ingår i Selected Papers of Internet Research, SPIR, 2020 DOI för Observing the tech, using meetup data to observe the evolution of the discourse around IoT Unspoken Assumptions in Multi-layer Modularity maximization Hanteer, Obaida; Magnani, Matteo Ingår i Scientific Reports, 2020 DOI för Unspoken Assumptions in Multi-layer Modularity maximization Ladda ner fulltext (pdf) av Unspoken Assumptions in Multi-layer Modularity maximization A Twitter-Based Study of the European Internet of Things Ustek-Spilda, Funda; Vega, Davide; Magnani, Matteo; Rossi, Luca et al. Ingår i Information Systems Frontiers, s. 135-149, 2020 DOI för A Twitter-Based Study of the European Internet of Things Ladda ner fulltext (pdf) av A Twitter-Based Study of the European Internet of Things An Analysis of the Consequences of the General Data Protection Regulation on Social Network Research Kotsios, Andreas; Magnani, Matteo; Vega, Davide; Rossi, Luca et al. Ingår i ACM Transactions on Social Computing, 2019 DOI för An Analysis of the Consequences of the General Data Protection Regulation on Social Network Research Ladda ner fulltext (pdf) av An Analysis of the Consequences of the General Data Protection Regulation on Social Network Research Comparing node degrees in probabilistic networks Kaveh, Amin; Magnani, Matteo; Rohner, Christian Ingår i Journal of Complex Networks, s. 749-763, 2019 DOI för Comparing node degrees in probabilistic networks Foundations of Temporal Text Networks Vega, Davide; Magnani, Matteo Ingår i Applied Network Science, 2018 DOI för Foundations of Temporal Text Networks Ladda ner fulltext (pdf) av Foundations of Temporal Text Networks Quantifying layer similarity in multiplex networks: a systematic study Brodka, Piotr; Chmiel, Anna; Magnani, Matteo; Ragozini, Giancarlo Ingår i Royal Society Open Science, 2018 DOI för Quantifying layer similarity in multiplex networks: a systematic study Ladda ner fulltext (pdf) av Quantifying layer similarity in multiplex networks: a systematic study Shortest Paths in Multiplex Networks Ghariblou, Saeed; Salehi, Mostafa; Magnani, Matteo; Jalili, Mahdi Ingår i Scientific Reports, 2017 DOI för Shortest Paths in Multiplex Networks Ladda ner fulltext (pdf) av Shortest Paths in Multiplex Networks Introduction to the special issue on multilayer networks Magnani, Matteo; Wasserman, Stanley Ingår i NETWORK SCIENCE, s. 141-143, 2017 DOI för Introduction to the",
  "content_length": 20720,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:45"
}