{
  "name": "Matteo Fontana",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/matteo-fontana",
  "status": "success",
  "content": "Matteo Fontana - Royal Holloway Research Portal Matteo Fontana Dr Lecturer in Computer Science (NLP/ML), Department of Computer ScienceCentre for Reliable Machine Learning https://orcid.org/0000-0002-2775-1862 EmailMatteo.Fontanarhul.acuk TW20 0EX Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 6 Article 3 Book 3 Other contribution Research output per year Research output per year Global Sensitivity and Domain-Selective Testing for Functional-Valued Responses: An Application to Climate Economy ModelsFontana, M., Tavoni, M. & Vantini, S., 18 Jun 2024, (E-pub ahead of print) In: Environmetrics. 17 p., e2866.Research output: Contribution to journal › Article › peer-review Open AccessFile 36 Downloads (Pure) Towards a taxonomy for Business-to-Government data sharingSignorelli, S., Fontana, M., Vespe, M., Gabrielli, L. & Bertoni, E., 27 Aug 2024, In: Statistical Journal of the IAOS. 40, 3, p. 713-726 14 p.Research output: Contribution to journal › Article › peer-review Open Access Conformal prediction: A Unified Review of Theory and New ChallengesFontana, M., Zeni, G. & Vantini, S., 1 Feb 2023, In: Bernoulli. 29, 1Research output: Contribution to journal › Article › peer-review Handbook of Computational Social Science for PolicyBertoni, E. (Editor), Fontana, M. (Editor), Gabrielli, L. (Editor), Signorelli, S. (Editor) & Vespe, M. (Editor), 2023, Springer.Research output: Book/Report › Book conformalInference: R Software tools for conformal predictionTibshirani, R. J., Vergottini, P., Fontana, M., Diquigiovanni, J. & Solari, A., 2022Research output: Other contribution View all 12 research outputs",
  "content_length": 2230,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:41"
}