{
  "name": "Matthew Louis Mauriello",
  "homepage": "https://www.eecis.udel.edu/~mlm",
  "status": "success",
  "content": "Matthew Louis Mauriello Contact Matthew Louis Mauriello Assistant Professor Computer & Information Sciences College of Engineering University of Delaware mlm@udel.edu @mattm401 Scholar Linkedin ABOUT I am an Assistant Professor and Human-Computer Interaction researcher (HCI/CS) in the Department of Computer & Information Sciences at the University of Delaware as well as the director of the Sensify Lab. My research interests center around designing better user experiences with technology and tackling societal problems in the areas of: sustainability, human-building interactions, wearables, personal informatics, education, health & wellness, and games. I am open to working with talented high school, undergraduate, master's, and Ph.D students as well as postdoctoral scholars who want to develop cyber-physical and software systems in these areas. If you are interested in exploring potential opportunities to work together, please email me (mlm@udel.edu) and include your CV/Resume, unofficial transcript, as well as a brief statement about how we might collaborate. If you are not a University of Delaware student then you will also need to apply and be accepted to one of our programs (e.g., undergraduate, graduate, UD K-12 Engineering) or another formal channel (e.g., REUs). Background My undergraduate and early graduate work in Computer Science and Applied Mathematics was completed at the University at Albany in upstate New York. I received my PhD from the Department of Computer Science at the University of Maryland in August of 2018. My research was advised by Dr. Jon E. Froehlich and I was an early student member of the Makeability Lab —a lablet of the Human-Computer Interaction Lab that focused on \"Making with a Social Purpose\". I contributed to a number of projects including the design of wearbles devices, early education technologies, and tools for DIY thermographic energy auditing which was the focus of my dissertation (see \"Pervasive Thermography\"). Before joining the University of Delaware, I was a postdoctoral scholar at Stanford University in the School of Medicine where I worked on stress and wellbeing interventions in the Pervasive Wellbeing Technology Lab with Dr. Pablo E. Paredes. I also collaborated with Stanford HCI and numerous other groups through various interdisciplinary projects. In my free time, I like to travel, hike, and contribute to indie video game projects via The Dirigiballers, LLC. Selected Publications 2025Chandrasekaran, A., Bielicke, L., Shah, D., Janakiraman, H., and Mauriello, M.L., (2025). \"I spent 14 hours debugging just one assignment: Toward Computer-Mediated Personal Informatics for Computer Science Student Mental Health.â In Proceedings of ACM CHI 2025 Conference on Human Factors in Computing Systems [Acceptance Rate: 25% (1249/4524)] (To Appear)[Paper (PDF)] | [Video (YouTube)] 2024Chandrasekaran, A., Currano, R., Batool, V., Chen, K., Murnane, M.L., Sirkin, D., and Mauriello, M.L., (2024). âTherapy for Therapists: Design Opportunities to Support the Psychological Well-being of Mental Health Workers.â In Proceedings of ACM Human-Computer Interaction. 8, CSCW2, Article 418 (November 2024). [Paper (PDF)] 2024*Khan, Y., *Mauriello, M.L., Nowruzi, P., Motani, A., Hon, G., Vitale, N., Li, J., Kim, J., Foudeh, A., Duvio, D., Shols, E., Chesnut, M., Landay, J., Liphardt, J., Williams, L., Sudheimer, K.D., Murmann, B., Bao, Z., and Paredes, P.E., (2024). \"On Stress: Combining Human Factors and Biosignals to Inform the Placement and Design of a Skinâlike Stress Sensor.\" In Proceedings of ACM CHI 2024 Conference on Human Factors in Computing Systems [Acceptance Rate: 26% (1060/4028)][Paper (PDF)] | [Video (YouTube)] 2023Tong, X., Mauriello, M.L., MoraâMendoza, M.A., Prabhu, N., Kim, J.P., and Paredes, P.E. (2023). âJust Do Something: Comparing Selfâproposed and Machineârecommended Stress Interventions among Online Workers with Home Sweet Office.â In Proceedings of ACM CHI 2023 Conference on Human Factors in Computing Systems [Acceptance Rate: 28% (879/3182)][Paper (PDF)] | [Video (YouTube)] 2021Dasler, P., Malik, S., and Mauriello, M.L., (2021). \"'Just Follow the Lights': A Ubiquitous Framework for Low-Cost, Mixed Fidelity Navigation in Indoor Built Environments.â International Journal of Human-Computer Studies, 2021, 102692, ISSN 1071-5819. [Paper (PDF)] 2019Mauriello, M.L., McNally, B., and Froehlich, J.E. (2019). \"Thermporal: An Easy-to-Deploy Temporal Thermographic Sensor System to Support Residential Energy Audits.\" In Proceedings of ACM CHI 2019 Conference on Human Factors in Computing Systems [Acceptance Rate: 24% (705/2960)].[Paper (PDF)] 2016Mauriello, M.L., Shneiderman, B., Du, F., Malik, S., and Plaisant, C., (2016). \"Simplifying Overviews of Temporal Event Sequences.\" In Proceedings of ACM CHI 2016 Conference on Human Factors in Computing Systems. Extended Abstract [Acceptance Rate: 43% (281/647)].Best Paper Honorable Mention | [Paper (PDF)] | [Poster (PDF)] 2015Mauriello, M.L., Norooz, L., and Froehlich, J.E., (2015). \"Understanding the Role of Thermography in Energy Auditing: Current Practices and the Potential for Automated Solutions.\" In Proceedings of ACM CHI 2015 Conference on Human Factors in Computing Systems [Acceptance Rate: 23% (495/2150)].Best Paper Honorable Mention | [Paper (PDF)] | [Supplemental Video (YouTube)] 2015Norooz, L., Mauriello, M.L., Jorgensen, A., McNally, B., and Froehlich, J.E., (2015). \"BodyVis: A New Approach to Body Learning through Wearable Sensing and Visualization.\" In Proceedings of ACM CHI 2015 Conference on Human Factors in Computing Systems [Acceptance Rate: 23% (495/2150)].Best Paper Honorable Mention | [Paper (PDF)] 2014Mauriello, M.L., Gubbels, M., Froehlich, J.E., (2014). \"Social Fabric Fitness: The Design and Evaluation of Wearable E-Textile Displays to Support Group Running.\" In Proceedings of ACM CHI 2014 Conference on Human Factors in Computing Systems. [Acceptance Rate: 23% (464/2034)] [Paper (PDF)] | [Poster (PDF)] | [Supplemental Video (YouTube)] | [Slides (PDF)] | [Talk (YouTube)] PUBLICATIONS Conference Publications 2025Karwankar, A., Ruggiero, E., Iyer, M.K., Brugel, S., Khatiwada, P., Stevens, D.B., and Mauriello, M.L., (2025). âuCue: An Interactive Musical Interface to Enhance Formative Listening Experience for Children with ASD.â In Proceedings of ACM IDC 2025 Conference on Interaction Design and Children [Acceptance Rate: XX% (####/####)] (Conditionally Accepted)[Paper (PDF)] 2025*Wang Q., *Erqsous, M., Khatiwada, P., Karwankar, A., Alhassan, F. M., Chandrasekaran, A., Abraham, B., Lovell, F., Ngo, A.A., and Mauriello, M.L., (2025). âLeveraging Large Language Models for Review Classification and Rating Estimation of Mental Health Applications.â In Proceedings of the AAAI ICWSM 2025 International Conference on Web and Social Media [Acceptance Rate: XX% (####/####)] (To Appear)[Paper (PDF)] 2025Chandrasekaran, A., Bielicke, L., Shah, D., Janakiraman, H., and Mauriello, M.L., (2025). \"I spent 14 hours debugging just one assignment: Toward Computer-Mediated Personal Informatics for Computer Science Student Mental Health.â In Proceedings of ACM CHI 2025 Conference on Human Factors in Computing Systems [Acceptance Rate: 25% (1249/4524)] (To Appear)[Paper (PDF)] | [Video (YouTube)] 2024Kong, M., He, O., Mauriello, M.L., and Pollock, L., (2024). âAnything That Can Be Streamlined Would Be Great: Validating Elementary School Teachersâ Preferences for a Block-Based Programming Teaching Augmentation System.â In Proceedings of Koli Calling 2024. [Acceptance Rate: 21% (20/95)][Paper (PDF)] | [Video (YouTube)] 2024*Khan, Y., *Mauriello, M.L., Nowruzi, P., Motani, A., Hon, G., Vitale, N., Li, J., Kim, J., Foudeh, A., Duvio, D., Shols, E., Chesnut, M., Landay, J., Liphardt, J., Williams, L., Sudheimer, K.D., Murmann, B., Bao, Z., and Paredes, P.E., (2024). \"On Stress: Combining Human Factors and Biosignals to Inform the Placement and Design of a Skinâlike Stress Sensor.\" In Proceedings of ACM CHI 2024 Conference on Human Factors in Computing Systems [Acceptance Rate: 26% (1060/4028)][Paper (PDF)] | [Video (YouTube)] 2023Tong, X., Mauriello, M.L., MoraâMendoza, M.A., Prabhu, N., Kim, J.P., and Paredes, P.E. (2023). âJust Do Something: Comparing Selfâproposed and Machineârecommended Stress Interventions among Online Workers with Home Sweet Office.â In Proceedings of ACM CHI 2023 Conference on Human Factors in Computing Systems [Acceptance Rate: 28% (879/3182)][Paper (PDF)] | [Video (YouTube)] 2022Kong, M., Mauriello, M.L., and Pollock, L. (2022). âExploring Kâ8 Teachersâ Preferences in a Teaching Augmentation System for BlockâBased Programming Environments. In Proceedings of Koli Calling 2022. [Acceptance Rate: 17% (18/105)][Paper (PDF)] | [Video (YouTube)] 2019Mauriello, M.L., McNally, B., and Froehlich, J.E. (2019). \"Thermporal: An Easy-to-Deploy Temporal Thermographic Sensor System to Support Residential Energy Audits.\" In Proceedings of ACM CHI 2019 Conference on Human Factors in Computing Systems [Acceptance Rate: 24% (705/2960)].[Paper (PDF)] 2018Mauriello, M.L., McNally, B., Buntain, C., Bagalkotkar, S., Kushnir, S., and Froehlich, J.E. (2018). \"A Large-Scale Analysis of YouTube Videos Depicting Everyday Thermal Camera Use.\" In Proceedings of ACM MobileHCI 2018 Conference on Human-Computer Interaction with Mobile Devices & Services in Computing Systems [Acceptance Rate: 24% (50/213)].[Paper (PDF)] 2018Golbeck, J., Mauriello, M.L., Auxier, B., Bhanushali, K.H., Bonk, C., Bouzaghrane, M.A., Buntain, C., et al., (2018). \"Fake News vs Satire: A Dataset and Analysis.\" In Proceedings of the 10th ACM Conference on Web Science [Acceptance Rate: 27% (30/113)].Best of WebSci'18 | [Paper (PDF)] | [Dataset (GitHub)] 2018McNally, B., Kumar, P., Hordatt, C., Mauriello, M.L., Naik, S., Norooz, L., Shorter, A., Golub, E., and Druin, A., (2018). \"Co-Designing Mobile Online Safety Applicatio",
  "content_length": 39097,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:59"
}