{
  "name": "Matthew Barr",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/matthewbarr",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Matthew Barr Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Matthew BarrMr Ethan KellyZhen Tian Dr Matthew Barr Senior Lecturer (Computing Science) telephone: 01413303016 email: Matthew.Barr@glasgow.ac.uk Sir Alwyn Williams Building, F113 Lilybank Gardens, University of Glasgow, Glasgow G12 8RZ Import to contacts https://orcid.org/0000-0002-5147-0673 Biography Dr Matthew Barr is a Senior Lecturer at the University of Glasgow. He is head of the Education and Practice (EAP) section in the School of Computing Science, where he leads the Graduate Apprenticeship in Software Engineering programme and chairs the School's Industry Advisory Board. Matt is also co-director of the University’s Games and Gaming Lab, a Senior Fellow in Recognising Excellence in Teaching (RET), and a member of the University’s Teaching Excellence Network. He previously convened the University’s first game studies course and founded the international student game studies journal, Press Start. He was appointed Director of Education for SICSA (the Scottish Informatics & Computer Science Alliance) in 2021, and is a founding editor of the journal, Open Scholarship of Teaching and Learning. Matt is the founder of the Ada Scotland Festival, which aims to improve gender balance in Computing Science education across Scotland. He also champions inclusion and diversity through his membership of several Scotland-wide groups, including the Scottish Apprenticeship Advisory Board Equalities Group, and the Scottish Government’s Digital Economy Skills Group and National Digital Ethics Expert Group. He is also involved in related work through Skills Development Scotland, including the Tackling the Technology Gender Gap Together (TTGGT) workstream, the Neurodiversity Steering Group, and the Women into Tech Steering Group. Matt previously served as Vice Chair of British DiGRA (the Digital Games Research Association) and as a Trustee and Director of the Scottish Game Developers Association. Until 2022, Matt was a member of the BAFTA Scotland Committee, where he acted as the Games Jury Chair. Matt’s games research, which has attracted significant media attention, examines how video games may be used to develop skills and competencies such as critical thinking, adaptability, and communication skills. This work received the Association for Learning Technology’s inaugural Research Project of the Year award in 2018 and forms the basis of his first book, Graduate Skills and Game-Based Learning, published with Palgrave in 2019. An edited volume, Approaches to Work-Based Learning in Higher Education: Improving Graduate Employability, was published with Taylor & Francis in 2024. Research interests Equality, diversity, and inclusion in higher education Learning and Teaching Work-based Learning Student Employability Graduate Attributes and Meta-skills Game-based Learning Research groupsEducation & Practice Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2008Number of items: 89.2025 Dimache, Aurora, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Gorman, David, Courtney, Anne Marie, Malik, Ali Ahmad and Ahmad, Ayyaz (2025) Applying lean six sigma and industry 4.0 concepts to enhance higher education. Frontiers in Education, 10, 1730531. (doi: 10.3389/feduc.2025.1730531) Kunkeler, Thom, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Li, Xiaohan, Muncey, Andrew, Nylén, Aletta and Venn-Wycherley, Megan (2025) Same Structures, Different Settings: Exploring Computing Capital and Participation across Cultural Contexts. In: Koli Calling '25: 25th Koli Calling International Conference on Computing Education Research, Koli, Finland, 12-16 Nov 2025, (Accepted for Publication) Grande, Virginia, Kinnunen, Päivi, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Peters, Anne-Kathrin, Sabin, Mihaela, Sánchez-Peña, Matilde and Tshukudu, Ethel (2025) From disciplinary enthusiasm to soulless tasks: norms behind computing educators' emotion display. European Journal of Engineering Education, (doi: 10.1080/03043797.2025.2525314) (Early Online Publication) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2025) The Development of Reflective Practice on a Work-Based Software Engineering Program: a Longitudinal Study. In: 37th IEEE Conference on Software Engineering Education and Training (CSEE&T), Ottowa, Canada, 27 April - 3 May 2025, pp. 53-61. ISBN 9798331537098 (doi: 10.1109/CSEET66350.2025.00012) Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Cutts, Quintin ORCID: https://orcid.org/0000-0002-6368-9912, Maguire, Joseph ORCID: https://orcid.org/0000-0002-3718-7679, Morrison, Alistair, Parkinson, Jack ORCID: https://orcid.org/0000-0001-6175-7638, Somerville, Derek and Storer, Tim ORCID: https://orcid.org/0000-0002-4026-097X (2025) Assessing Work-Based Learning in the Senior Years of a Software Engineering Graduate Apprenticeship Program. In: IEEE Conference on Software Engineering Education and Training (CSEE&T), Ottawa, Ontario, Canada, 28-29 April 2025, pp. 30-40. ISBN 9798331537098 (doi: 10.1109/CSEET66350.2025.00010) Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Morrison, Alistair (2025) Understanding Skill Transfer Between University and Workplace Through Reflective Practice: A Software Engineering Work-Based Learning Experience. In: 30th ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE ’25), Nijmegen, Netherlands, 30 June- 2 July 2025, pp. 368-374. ISBN 9798400715679 (doi: 10.1145/3724363.3729119) Sabin, Mihaela, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Clear, Tony and Raj, Rajendra J. (2025) Preparing Professionally Competent Computing Graduates: The Role of Work Experiences. In: 30th ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE ’25), Nijmegen, Netherlands, 30 June- 2 July 2025, pp. 707-708. ISBN 9798400715693 (doi: 10.1145/3724389.3730764) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 (2025) Can Video Games Play a Role in Supporting Students' Wellbeing and Development? Advance HE Mental Wellbeing in HE Conference 2025, Sheffield, UK, 14 May 2025. (Accepted for Publication) Almuadi, Mona Mohammed A and Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 (2025) Gender Differences in Self-Efficacy and Motivation in Online Peer Assessment. In: 11th International Workshop on Peer Review, Peer Assessment, and Self Assessment in Education (PRASAE 2025), Lille, France, 25-27 June 2025, (Accepted for Publication) Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 and Petrovska, Olga (2025) Integrating Socially Responsible Computing Competencies in Computer Science and Software Engineering Education. 9th Conference on Computing Education Practice (CEP 2025), Durham, UK, 07 Jan 2025. pp. 36-37. ISBN 9798400711725 (doi: 10.1145/3702212.3702225) 2024 Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Binnie, Lewis, Jacobs, Elizabeth, Pavlou, Kristina and West, Kathleen ORCID: https://orcid.org/0009-0001-4820-7241 (2024) Understanding the Role Models that Inspire Women to Study Computing Science. In: United Kingdom and Ireland Computing Education Research (UKICER 2024), Manchester, UK, 5-6 September 2024, ISBN 9798400711770 (doi: 10.1145/3689535.3689557) Almuadi, Mona and Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 (2024) Exploring gender disparities in online peer feedback system: an analysis of feedback levels and quality. In: Kubincová, Zuzana, Hao, Tianyong, Capuano, Nicola, Temperini, Marco, Ge, Shili, Mu, Yuanyuan, Fantozzi, Paolo and Yang, Jing (eds.) Emerging Technologies for Education: 8th International Symposium, SETE 2023, Sydney, Australia, November 26–28, 2023, Revised Selected Papers. Series: Lecture notes in computer science, 14607 (2). Springer: Singapore, pp. 232-248. ISBN 9789819742455 (doi: 10.1007/978-981-97-4246-2_19) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Morrison, Alistair and Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 (2024) The Development of Students' Professional Competencies on a Work-Based Software Engineering Program. In: 55th ACM Technical Symposium on Computer Science Education (SIGCSE TS), Portland, OR, USA, 20-23 March 2024, pp. 81-87. ISBN 9798400704239 (doi: 10.1145/3626252.3630944) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 ed. (2024) Approaches to Work-Based Learning in Higher E",
  "content_length": 76763,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:47"
}