{
  "name": "Matthew Kay 0001",
  "homepage": "http://www.mjskay.com",
  "status": "success",
  "content": "Matthew Kay / mjskay.com I am an Associate Professor in CS and Communication at Northwestern. I work in humanâcomputer interaction and information visualization. My research includes work on visualizing uncertainty, usable statistics, and visualization literacy. I tackle problems using a multi-faceted approach, including qualitative and quantitative analysis of behavior, building and evaluating interactive systems, and designing and testing visualization techniques. I co-direct the Midwest Uncertainty Collective (MU collective), and I am the author of the tidybayes and ggdist R packages for uncertainty visualization. Previously, I was an Assistant Professor at UMSI. For an up-to-date picture of my work, see the MU collective website. Some areas of my work (not necessarily current) include: Communicating uncertainty: We are increasingly exposed to sensing and prediction in our daily lives (âhow many steps did I take today?â, âhow long until my bus shows up?â, âhow much do I weigh?â). Uncertainty is both inherent to these systems and usually poorly communicated. To build understandable data presentations, we must study how people interpret their data and what goals they have for it. This informs the way that we should communicate results from our models, which in turn determines what models we must use in the first place. Moreâ¦ Usable statistics: Science is failing all around us! Nothing replicates! Things may not be as dire as all that, but in fields like HCI and psychology, the statistical tools we use are failing us: these tools let users wander around without guidance and produce results without assisting users in interpretation. What would usable statistical tools look like? Moreâ¦ Selected publications See my C.V. or Google Scholar for a complete listing. In dice we trust: Uncertainty displays for maintaining trust in election forecasts over time Fumeng Yang, Chloe Rose Mortenson, Erik Nisbet, Nicholas Diakopoulos, and Matthew Kay CHI 2024Best paper award (top 1%)PDF Watching the election sausage get made: How data journalists visualize the vote counting process in U.S. elections Mandi Cai and Matthew Kay CHI 2024Honorable mention (top 5%)PDF Odds and insights: Decision quality in exploratory data analysis under uncertainty Abhraneel Sarma, Xiaoying Pu, Yuan Cui, Eli T Brown, Michael Correll, and Matthew Kay CHI 2024Honorable mention (top 5%)PDF Swaying the public? Impacts of election forecast visualizations on emotion, trust, and intention in the 2022 U.S. midterms Fumeng Yang, Mandi Cai, Chloe Rose Mortenson, Hoda Fakhari, Ayse Deniz Lokmanoglu, Jessica Hullman, Steven L Franconeri, Nicholas Diakopoulos, Erik Nisbet, and Matthew Kay VIS 2023Best paper award (top 1%)PDF ggdist: Visualizations of distributions and uncertainty in the grammar of graphics Matthew Kay VIS 2023PDFR package Subjective probability correction for uncertainty representations Maryam Hedayati, Fumeng Yang, and Matthew Kay CHI 2023Honorable mention (top 5%)PDF multiverse: Multiplexing alternative data analyses in R notebooks Abhraneel Sarma, Alex Kale, Michael Jongho Moon, Nathan Taback, Fanny Chevalier, Jessica Hullman, and Matthew Kay CHI 2023Honorable mention (top 5%)PDFR package A probabilistic grammar of graphics Xiaoying Pu and Matthew Kay CHI 2020Honorable mention (top 5%)PDFBibTeXR package Visual reasoning strategies for effect size judgments and decisions Alex Kale, Matthew Kay, and Jessica Hullman InfoVis 2020Best paper award (top 1 paper)PDFBibTeXData & code Increasing the transparency of research papers with Explorable Multiverse Analyses Pierre Dragicevic, Yvonne Jansen, Abhraneel Sarma, Matthew Kay, and Fanny Chevalier CHI 2019Best paper award (top 1%)PDFBibTeXDemoCode The garden of forking paths in visualization: A design space for reliable exploratory visual analytics Xiaoying Pu, Matthew Kay BELIV 2018PDFBibTeX Uncertainty displays using quantile dotplots or CDFs improve transit decision-making Michael Fernandes, Logan Walls, Sean Munson, Jessica Hullman, and Matthew Kay CHI 2018Honorable mention (top 5%)PDFBibTeXData & code Imagining replications: Graphical prediction & discrete visualizations improve recall & estimation of effect uncertainty Jessica Hullman, Matthew Kay, Yea-Seul Kim, and Samana Shrestha InfoVis 2017PDFBibTeXData & code Researcher-centered design of statistics: Why Bayesian statistics better fit the culture and incentives of HCI Matthew Kay, Gregory Nelson, and Eric Hekler CHI 2016Honorable mention (top 5%)PDFBibTeXData & code When (ish) is my bus? User-centered visualizations of uncertainty in everyday, mobile predictive systems Matthew Kay, Tara Kola, Jessica Hullman, and Sean Munson CHI 2016PDFBibTeXData & code Beyond Weberâs Law: A second look at ranking visualizations of correlation Matthew Kay and Jeffrey Heer InfoVis 2015Honorable mention (top 2 papers)PDFDOIBibTeXData & code Unequal representation and gender stereotypes in image search results for occupations Matthew Kay, Cynthia Matuszek, and Sean Munson CHI 2015Best paper award (top 1%)PDFBibTeXData & code How good is 85%? A survey tool to connect classifier evaluation to acceptability of accuracy Matthew Kay, Shwetak N. Patel, and Julie A. Kientz CHI 2015PDFBibTeXData & code Challenges in personal health tracking: The data isnât enough Matthew Kay XRDS 21(2), Winter 2014ACM DLBibTeX Thereâs no such thing as gaining a pound: Reconsidering the bathroom scale user interface Matthew Kay, Dan Morris, mc schraefel, and Julie A. Kientz Ubicomp 2013Best paper award (top 1%)PDFBibTeX PVT-Touch: Adapting a reaction time test for touchscreen devices Matthew Kay, Kyle Rector, Sunny Consolvo, Ben Greenstein, Jacob O. Wobbrock, Nathaniel F. Watson, and Julie A. Kientz PervasiveHealth 2013PDFBibTeX Lullaby: A capture & access system for understanding the sleep environment Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A. Kientz Ubicomp 2012Best paper award (top 1%)PDFBibTeX Textured agreements: Re-envisioning electronic consent Matthew Kay and Michael Terry SOUPS 2010PDFBibTeX Communicating software agreement content using narrative pictograms Matthew Kay and Michael Terry alt.chi 2010PDFBibTeX Perceptions and practices of usability in the Free/Open Source Software (FOSS) community Michael Terry, Matthew Kay, and Ben Lafreniere CHI 2010PDFBibTeX Ingimp: Introducing instrumentation to an end-user open source application Michael Terry, Matthew Kay, Brad Van Vugt, Brandon Slack, and Terry Park CHI 2008PDFBibTeX",
  "content_length": 6574,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:57"
}