{
  "name": "Matthew Butler 0002",
  "homepage": "https://research.monash.edu/en/persons/matthew-butler",
  "status": "success",
  "content": "Matthew Butler - Monash University Matthew Butler public CV View Scopus Profile Matthew Butler Assoc Professor Associate Professor, Department of Human Centred Computing https://orcid.org/0000-0002-7950-5495 EmailMatthew.Butlermonashedu 20032025 Research activity per year Personal profile BiographyMatthew is an Associate Professor within the Faculty of Information Technology at Monash University in Melbourne, Australia. Working within the Department of Human-Centred Computing, he has a research focus on Inclusive Technologies. Matthew has been a teaching and research academic at Monash University for over 20 years, and has held several leadership positions including a recent tenure as Deputy Dean (Education) within the faculty. He is also a Senior Fellow of the Higher Education Academy, demonstrating his commitment to not only quality research but also quality education.Research interestsMatthew's primary research focus is on improving access to visual information for those who are blind or have low vision (BLV). In particular his work explores the use of emerging technologies such as 3D printing, electronics and conversational agents to produce accessible, multi-sensory, objects and experiences for the BLV community. These include innovative new representations of graphics for education, exploring new ways of undertaking data exploration and analysis, supporting orientation and mobility, and improving access to arts and culture. This work is highly participatory with the BLV community and other stakeholder organisations, and seeks to not only have impact within the HCI research community, but also very practical outcomes for improving lived experiences.Monash teaching commitmentAssociate Professor Butler has experience as the Chief Examiner in numerous units relating to programming as well as games development. These include: FIT1048 Foundations of C++FIT1051 Programming Fundamentals in JavaFIT2073 Game Design Studio 1FIT3145 Game Design Studio 2Final Year Capstone StudioCommunity serviceRecent Faculty and University Service Roles include: Monash Assistive Technology and Society centre, Education Pillar co-lead - 2023 to dateDeputy (Equity, Diversity and Inclusion) - 2024 to dateDeputy Dean (Education) - 2020 to 2022Associate Dean (Learning and Teaching) - 2018 to 2020 Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputing Education, Doctor of Philosophy, A Framework for the Effective Learning of High Concept - Low Feedback Programming Curriculum, MONASH UNIVERSITYAward Date: 14 Oct 2010Education, Graduate Certificate of Higher Education, MONASH UNIVERSITYAward Date: 1 Feb 2006Electronic and Computer Engineering, Bachelor of Engineering, MONASH UNIVERSITYAward Date: 1 May 1996 Research area keywordsAccessible GraphicsAssistive TechnologiesInformation Visualisation and Interaction Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2014 2014 2018 2028 3 Active 9 Finished Projects per year Accessible Mathematics for Students: Accessible Mathematics for Students who are Blind or have Low VisionMarriott, K. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Fanshawe, M. (Chief Investigator (CI)), Wybrow, M. (Chief Investigator (CI)), Hayman, S. (Partner Investigator (PI)), Rodda, M. (Partner Investigator (PI)) & Jardine, A. (Partner Investigator (PI))ARC - Australian Research Council29/09/25 → 28/09/28Project: Research Enabling Accessible, Inclusive Playgrounds for Children and Carers with Vision ImpairmentReinhardt, D. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Marriott, K. (Chief Investigator (CI)), Holloway, L. (Partner Investigator (PI)), Loke, L. (Chief Investigator (CI)), Silveira, S. (Partner Investigator (PI)) & Tait, K. (Chief Investigator (CI))1/07/24 → 30/06/27Project: Research Accessible Data Exploration and Analysis for Blind PeopleMarriott, K. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Zukerman, I. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)) & Lee, B. (Partner Investigator (PI))ARC - Australian Research Council28/02/23 → 27/02/27Project: Research STEMMing Effective Study StrategiesYuriev, E. (Primary Chief Investigator (PCI)), Larson, I. (Chief Investigator (CI)), Vu, T. (Chief Investigator (CI)), Sarkar, M. (Chief Investigator (CI)), Kyne, S. (Chief Investigator (CI)), Danczak, S. (Chief Investigator (CI)), Li, J. (Chief Investigator (CI)) & Butler, M. (Chief Investigator (CI))1/01/20 → 31/12/21Project: Research Inclusive Gallery Experiences: Creating an Accessible Bendigo Art Gallery for Blind and Low Vision VisitorsButler, M. (Primary Chief Investigator (PCI)), Marriott, K. (Chief Investigator (CI)), Ellis, K. (Chief Investigator (CI)), Holloway, L. (Chief Investigator (CI)) & Dziekan, V. (Chief Investigator (CI))Trustee for Helen Macpherson Smith Trust1/11/19 → 30/04/22Project: Research View all 12 projects Research output Research output per year 2003 2015 2017 2018 2019 2020 2021 2023 2025 2025 56 Conference Paper 6 Article Research output per year Research output per year 3D Printing for Accessible Education: A Case Study in Assistive Technology AdoptionHolloway, L., Butler, M., Waddell, A. & Marriott, K., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 19 p. 273Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Enhancing Tactile Learning: A Co-Designed System for Supporting Speech Interaction with Multi-Part 3D Printed Models by Students who are BlindNagassa, R. G., Pham, A. K., Butler, M., Holloway, L., Stefanov, K., De Vent, S. & Marriott, K., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 18 p. 294Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 1 Citation (Scopus) \"It Brought the Model to Life\": Exploring the Embodiment of Multimodal I3Ms for People who are Blind or have Low VisionReinders, S., Butler, M. & Marriott, K., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 19 p. 367Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Sensing Movement: Contemporary Dance Workshops with People who are Blind or have Low Vision and Dance TeachersDe Silva, M. T., Smiley, J., Goodwin, S., Holloway, L. M. & Butler, M., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 19 p. 1063Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 2 Citations (Scopus) When Refreshable Tactile Displays Meet Conversational Agents: Investigating Accessible Data Presentation and Analysis with Touch and SpeechReinders, S., Butler, M., Zukerman, I., Lee, B., Qu, L. & Marriott, K., Jan 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 1, p. 864-874 11 p.Research output: Contribution to journal › Article › Research › peer-review 7 Citations (Scopus) View all 62 research outputs Activities Activities per year 2013 2013 2016 4 Committees and working groups Activities per year Major Lead (Games Develpoment) - Bachelor of Information Technology - Faculty of Information Technology, Monash UniversityButler, M. (Chair/ Co-Chair)1 Jan 2016Activity: External Academic Engagement › Committees and working groups Chair - Undergraduate Programs Committee - Faculty of Information Technology, Monash UniversityButler, M. (Chair/ Co-Chair)1 Apr 2013 → 31 Mar 2016Activity: External Academic Engagement › Committees and working groups Member (Elected Senior Lecturer Representative) - Faculty Board - Faculty of Information Technology, Monash UniversityButler, M. (Member)1 Apr 2013 → 1 Dec 2014Activity: External Academic Engagement › Committees and working groups Member - Faculty Education Committee - Faculty of Information Technology, Monash UniversityButler, M. (Member)1 Apr 2013 → 31 Mar 2016Activity: External Academic Engagement › Committees and working groups",
  "content_length": 9132,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:47"
}