{
  "name": "Matteo Cimini",
  "homepage": "http://cimini.info",
  "status": "success",
  "content": "Matteo Cimini Matteo Cimini Assistant Professor Miner School of Computer & Information Sciences Kennedy College of Sciences University of Massachusetts Lowell Address: Miner School of Computer & Information Sciences University of Massachusetts Lowell 1 University Ave. Lowell, MA 01854 Office: Dandeneau Hall, office 324 Phone: 978-934-3682 Email: matteo_cimini [A_T] uml [DOT] edu Research Interests Programming languages, formal methods, type systems, programming language validation and verification, gradual typing, interactive theorem proving, concurrency theory, process algebra, bisimulation and coinductive techniques. Publications Recent News New! Oct. 2025, CongruenceTool is out! Based on the work of my (former) students Merlyn and Nikolaos. New! Aug. 2025, Paper accepted at ICTAC 2025. New! Aug. 2025, my Ph.D. student Joan and I have a paper accepted in Science of Computer Programming. March. 2025: I am part of the organization of NEPLS, the New England Programming Languages and Systems Symposium at UMass Lowell in May 2025. In 2025: Joined the PC of FORTE 2026. In 2025: PC member of IFL 2025, SLE 2025, FORTE 2025, and ICE 2025. Nov. 2024: Nico, Eswar, and I have a paper accepted at Marjan Sirjani's Festschrift. Nov. 2024: My master's student Eswar successfully defended a master's thesis on Lang-n-Prove, congrats! Current Work: Lang-n-X series of systems: You can watch overview videos of the systems in this series below. (Videos assume familiarity with Programming Language Theory.) You can also read an overview of the series here (pdf, 4 pages + references). (Most recent tool is Lang-n-Assert.) Lang-n-Play: A Programming Language with Languages as First-class Citizens. video (~12 mins), slides. Lang-n-Send: Processes That Send Languages. video (~10 mins), slides. Lang-n-Change: A DSL for Language Transformations. video (~10 mins), slides. Lang-n-Check: (Extrinsic) Type Systems for Language Definitions. video (~10 mins), slides. Lang-n-Prove: A Proof Language for Language Proofs. video (~10 mins), slides. Lang-SQL (or Lang-n-Query): A Query Language for Querying Languages. video (~12 mins), slides. Lang-n-Assert: From Program Logics to Language Logics. video, coming soon. If you think that a talk about the Lang-n-X series can be a nice keynote speech, please contact me. Teaching Comp.3010 Organization of Programming Languages: Fall 2025, Spring 2024, Fall 2023, Summer II 2023, Spring 2023, Fall 2022, Fall 2021, Spring 2021, Spring 2020. Comp.5310 Design of Programming Languages: Fall 2023, Fall 2022, Fall 2021, Fall 2019, Spring 2019, Spring 2018. Comp.4040 Analysis of Algorithms: Spring 2023, Fall 2020. Comp.5020 Foundations of Computer Science: Spring 2025, Fall 2018, Fall 2017. Comp.3040 Foundations of Computer Science: Spring 2020. Events FORTE 2026. (Int. Conference on Formal Techniques for Distributed Objects, Components, and Systems). PC Member. NEPLS 2025 At UMass Lowell! (New England Programming Languages and Systems Symposium). Part of the organization. IFL 2025. (Symposium on Implementation and Application of Functional Languages). PC Member. SLE 2025. (Int. Conference on Software Language Engineering). PC Member. FORTE 2025. (Int. Conference on Formal Techniques for Distributed Objects, Components, and Systems). PC Member. ICE 2025 (Interaction and Concurrency Experience, workshop). PC Member. FLOPS 2024. (Int. Symposium on Functional and Logic Programming). PC Member. EXPRESS/SOS 2024. (Int. Workshop on Expressiveness in Concurrency + Int. Workshop on Structural Operational Semantics). PC Member. OOPSLA 2023. External Review / Artifact Evaluation Committee Member. EXPRESS/SOS 2023. (Int. Workshop on Expressiveness in Concurrency + Int. Workshop on Structural Operational Semantics). PC Member. FLOPS 2022. (Int. Symposium on Functional and Logic Programming). PC Member. ICFP 2021. PC Member. ICE 2021 (Interaction and Concurrency Experience, workshop). PC Member. POPL 2020. PC Member. ICE 2020 (Interaction and Concurrency Experience, workshop). PC Member. SLE 2019. (Int. Conference on Software Language Engineering). PC Member. TFP 2019. (Symposium on Trends in Functional Programming). PC Member. EXPRESS/SOS 2019. (Int. Workshop on Expressiveness in Concurrency + Int. Workshop on Structural Operational Semantics). PC Member. ICE 2019 (Interaction and Concurrency Experience, workshop). PC Member. IFL 2018. Co-Chair. The 30th Symposium on Implementation and Application of Functional Languages took place at UMass Lowell! SBMF 2018 (21st Brazilian Symposium On Formal Methods). PC Member. PLDI 2018 (ERC). External Review Committee Member. ICE 2018 (Interaction and Concurrency Experience, workshop). PC Member. POPL 2017 SRC (POPL Student Research Competition). Evaluation Committee Member. ICE 2017 (Interaction and Concurrency Experience, workshop). PC Member. EXPRESS/SOS 2016 (Int. Workshop on Expressiveness in Concurrency + Int. Workshop on Structural Operational Semantics). PC Member. PrePost 2016 (Int. Workshop on Pre- and Post-Deployment Verification Techniques, workshop). PC Member. ICE 2016 (Interaction and Concurrency Experience, workshop). PC Member. YR-CONCUR 2015 , satellite workshop of CONCUR 2015. Organizer and PC Chair. EXPRESS/SOS 2015 (Int. Workshop on Expressiveness in Concurrency + Int. Workshop on Structural Operational Semantics). PC Member. ICE 2015 (Interaction and Concurrency Experience, workshop). PC Member. EXPRESS/SOS 2014, (Int. Workshop on Expressiveness in Concurrency + Int. Workshop on Structural Operational Semantics). PC Member. PACO 2011 (Int. Workshop on Process Algebra and Coordination), satellite workshop of DisCoTec 2011. Organization Chair and website maintainer. Artifact evaluation is a great idea! I am happy to have contributed as evaluator to PLDI Artifact Evaluation 2018. Evaluation Committee Member. OOPSLA Artifact Evaluation 2018. Evaluation Committee Member. OOPSLA Artifact Evaluation 2017. Evaluation Committee Member. My previous affiliations and education Research Associate/Postdoc at Indiana University, Bloomington, USA. Postdoctoral researcher at INRIA - Saclay, France. Ph.D. in Computer Science, Reykjavik University, Iceland. Ph.D. advisors: Luca Aceto and Anna Ingólfsdóttir. I also had a 9-month period as a postdoc at Reykjavik University after graduation. Master's degree in Computer Science, University of Bologna, Italy. Master's thesis supervisors: Davide Sangiorgi and Claudio Sacerdoti Coen. Bachelor's degree in Computer Science, University of Bologna, Italy. Bachelor's thesis supervisor: Maurizio Gabbrielli.",
  "content_length": 6590,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:42"
}