{
  "name": "Matthew Dunbabin",
  "homepage": "https://research.qut.edu.au/qcr/people/matthew-dunbabin",
  "status": "success",
  "content": "Matthew Dunbabin - QUT Centre for Robotics Skip to content Prof Matthew Dunbabin Home Our People Prof Matthew Dunbabin Please enable JavaScript Please enable JavaScript Find Matthew Dunbabin onMatthew Dunbabin's full profile, contact information and publications are available on: Professor (Environment Robotics, Marine Robotics, Autonomous Systems) PhD (Queensland University of Technology), BEng(hon)(Aerospace) (Royal Melbourne Inst. of Tech)Matthew conducts transdisciplinary research into environmental robotics focusing on advanced perception-to-action solutions with application to large-scale management and monitoring challenges. He currently holds the position of Professor at the Queensland University of Technology as well as Chief Investigator at the Australian Centre for Robotic Vision (ACRV). An experienced researcher and robotics specialist, Matthew has a proven track record in the research, development, field evaluation and operational use of vision-enabled autonomous systems for performing unsupervised monitoring and management tasks in complex environments. His wide research interests include vision-based perception and classification, vision-based navigation, adaptive sampling and path planning, and cooperative robotics. Through application to large-scale marine habitat restoration, marine pest identification and control, conservation, greenhouse gas mapping and utility compliance monitoring, his research has received numerous national and international R&D and engineering awards. Matthew received his Bachelor of Engineering in Aerospace Engineering from the Royal Melbourne Institute of Technology and his PhD from the Queensland University of Technology. He started his professional career in 1995 as a project engineer at Roaduser Research International, and following his PhD joined the Commonwealth Scientific and Industrial Research Organisation (CSIRO) in the Autonomous Systems Laboratory. At CSIRO he held various roles including Principal Research Scientist, project leader and the Robotics Systems and Marine Robotics team leader before moving to QUT in 2013. A strong advocate of robotic systems in civilian applications, Professor Dunbabin is involved in a number of initiatives aimed at promoting, educating and demonstrating autonomous systems to a range of interest groups nationally and internationally. Awards and recognitions2019: Australian Water Association Award (Program Innovation Award for over 250,000 end users – SAMMI: Chief Investigator)2019: Good Design Award - Sustainability Award (RangerBot: Chief Investigator)2018: Out of the Blue Box Challenge (Tiffany & Co Foundation, GBRF – Mass coral reseeding: Matthew Dunbabin and Peter Harrison).2016: Google Impact Challenge – People’s Choice Award (Great Barrier Reef Foundation – RangerBot AUV: Chief investigator)2016: Eureka Prize Finalist (research and innovation in environmental science), COTSBot team – Chief Investigator2010: Australian ICT Industry Association (AIIA) National iAward for Research & Development (iSnet – Chief Investigator)2007: Australasian Hydrographic Society Award of Recognition for Scientific & Technical Achievement.2006: Australian Engineering Excellence Award, Engineers Australia (Starbug – Chief Investigator).2006: Innovation Award, Queensland Engineering Excellence Awards, Engineers Australia (Queensland Division).Career history 2018 - Present: Professor: Institute for Future Environments, and School of Electrical Engineering and Computer Science, Queensland University of Technology.2017 - Present: Chief Investigator, ARC Centre of Excellence for Robotic Vision (ACRV).2013-2018: Principal Research Fellow: Institute for Future Environments, and School of Electrical Engineering and Computer Science, Queensland University of Technology.2009-2013: Principal Research Scientist, Team Leader and Project Leader: Autonomous Systems Laboratory, CSIRO ICT Centre.2007-2009: Stream Leader, Wealth from Oceans Flagship, CSIRO.2001-2007: Senior Research Scientist and Project Leader, Autonomous Systems Laboratory, CSIRO ICT Centre.1995-1998: Project Engineer, Roaduser Research International Pty Ltd. Projects (Chief investigator)Coordinated control of multi-robot systems for dynamic task executionPerception-to-action for collision avoidance using robotic boats ProjectsAntarctic Science for a Sustainable FutureCOTSbot eliminating invasive reef speciesEco robots – smart solutions to protect our environmentLunaRoo - A hopping Lunar science platformRangerBot Additional information Awards TypeAcademic Honours, Prestigious Awards or PrizesReference year2010DetailsNational iAward for Research & Development (iSnet - Chief Investigator)TypeAcademic Honours, Prestigious Awards or PrizesReference year2007DetailsAward of Recognition for Scientific & Technical AchievementTypeAcademic Honours, Prestigious Awards or PrizesReference year2018DetailsAustralian Engineering Excellence Award (Starbug - Chief Investigator)TypeAcademic Honours, Prestigious Awards or PrizesReference year2018DetailsInnovation award, Queensland Engineering Excellence Awards (Starbug Project - Chief Investigator) Research Projects TitleARC Centre of Excellence for Robotic Vision (ACRV)Primary fund typeCAT 1 - Australian Competitive GrantProject IDCE140100016Start year2014KeywordsRobotic Vision; Robotics; Computer VisionTitleRevolutionising protection against air pollutionPrimary fund typeCAT 1 - Australian Competitive GrantProject IDDP150101828Start year2015Keywordspersonal exposure monitoring; air pollution exposure; exposure risk managementTitleEstablishing Advanced Networks for Air Quality Sensing and AnalysesPrimary fund typeCAT 1 - Australian Competitive GrantProject IDLP160100051Start year2017Keywords NewsDr Fernando Vanegas Alvarez awarded Advanced Queensland Industry Research Fellowship Grant!Posted: September 19, 2024QCR CI Aaron McFadyen Wins 2024 Australian Museum Eureka Prize!Posted: September 8, 2024From PhD to Lecturer: Dr Jasmin Martin's JourneyPosted: August 18, 2024Recent TweetsFollow @QUTRobotics",
  "content_length": 6060,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:52"
}