{
  "name": "Matthew A. Turk",
  "homepage": "https://home.ttic.edu/~mturk",
  "status": "success",
  "content": "Matthew Turk Matthew Turk President and Professor, Toyota Technological Institute at Chicago Professor Emeritus, University of California, Santa Barbara Fellow of the ACM, IEEE, IAPR, AAIA, AIIA Member, Computing Community Consortium 6045 S. Kenwood Ave., Chicago, IL 60637 president@ttic.edu | (773) 834-2493 | LinkedIn, Bluesky, Twitter Assistant: Brandie Jones (bjones@ttic.edu) I am a professor and the President of the Toyota Technological Institute at Chicago (TTIC), an independent, philanthropically endowed graduate academic institution that focuses on computer science theory and artificial intelligence, particularly machine learning and optimization, algorithms and complexity, computer vision and computational photography, speech and language technologies, robotics, and computational biology. My main research interests are in computer vision and imaging, machine learning, multimodal interaction, augmented and virtual reality, and related areas. I co-founded a startup company in 2016 to commercialize augmented reality for remote telecollaboration, which was acquired by PTC and became part of their Vuforia augmented reality platform. In recent years, I've been keenly interested in legal and ethical matters relating to AI and computing. I'm currently an Associate Editor for the ACM Transactions on Interactive Intelligent Systems (TiiS). Prior to TTIC, I was at UC Santa Barbara, where I was Chair of the Computer Science Department and the Media Arts and Technology Graduate Program, and had additional appointments in Electrical and Computer Engineering and the Dynamical Neuroscience Graduate Program. I was also on steering committees for the Center for Information Technology and Society, the Cognitive Science Program, the Sage Center for the Study of the Mind, the Center for Spatial Studies and Data Science, and the Center for Digital Games Research. Learn Computer Science. Change the world. Publications Google Scholar Books Visual Sensing and Ubiquitous Computing [Coming] Applied Machine Learning on Sensing Technologies [Coming] Computer Vision: Challenges, Trends, and Opportunities with Md. A. R. Ahad, U. Mahbub, and R. Hartley (eds.) Chapman and Hall / CRC Press 2024 Advanced Methods and Deep Learning in Computer Vision with E.R. Davies (eds.) Elsevier 2021 Vision-Based Interaction with Gang Hua Morgan & Claypool Synthesis Lectures on Computer Vision 2013 Teaching At TTIC Independent Research - TTIC 55000 Research at TTIC (lectures) - TTIC 31000 At UCSB A History of Computing [INT 94BI] Advanced Topics in Computer Vision [CS/ECE 281B] Advanced Topics in Machine Intelligence [CS 265] Advanced Topics in Machine Intelligence - Bayesian Networks [CS 265] Cognitive Science Seminar [INT 200B] Cognitive Science Seminar on Human-Computer Interaction [CS 595A/INT200B] Computer Graphics [CS 180] Computer Imaging [MAT 235/CS 291A] Computer Vision [CS/ECE 181B] Computer Vision Seminar [CS 595I] Foundations of Computer Science [CS 40] Freshman Seminar on Media Arts and Technology [INT 94JT] Human Computer Interaction [CS/MATP 290A] Introduction to Artificial Intelligence [CS 165A] Introduction to C, C++ and Unix [CS 60] Machine Learning [CS 165B] Media Arts and Technology Seminar [MAT 595M/CS 595I] Mobile Imaging [CS 290I/MAT 235] Multimodal Interaction on Mobile Computing Platforms [CS 290I] Seminar on Topics and Trends in Computing [CS 595M] Statistical Models and Methods in Computer Science [CS 290I] Visualization Seminar [CS 595B] Brief Bio Matthew Turk is the President of the Toyota Technological Institute at Chicago (TTIC) and an emeritus professor in computer science at the University of California, Santa Barbara, where he co-directed the UCSB Four Eyes Lab, focused on the \"four I's\" of Imaging, Interaction, and Innovative Interfaces. He received a BS from Virginia Tech, an MS from Carnegie Mellon University, and a PhD from the Massachusetts Institute of Technology. He has worked at Martin Marietta Aerospace, LIFIA/ENSIMAG (Grenoble, France), Teleos Research, and Microsoft Research, where he was a founder of the Vision Technology Group. He has served as General or Program Chair of several major conferences, including the ACM Multimedia Conference, the IEEE Conference on Automatic Face and Gesture Recognition, the ACM International Conference on Multimodal Interaction, the IEEE Conference on Computer Vision and Pattern Recognition, and the IEEE Winter Conference on Applications of Computer Vision. He co-founded an augmented reality startup company in 2014 that was acquired by PTC Vuforia in 2016. Dr. Turk has received several best paper awards, and he is an ACM Fellow, an IEEE Fellow, an IAPR Fellow, an APAIA Fellow, and the recipient of the 2011-2012 Fulbright-Nokia Distinguished Chair in Information and Communications Technologies. Miscellaneous Links TTIC TTIC partners: TTI in Nagoya, Japan | University of Chicago (CS) (Data Science) Computing Research Association (CRA) UCSB Four Eyes Lab",
  "content_length": 4979,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:45"
}