{
  "name": "Matthias Becker 0002",
  "homepage": "https://hci.uni-hannover.de/people/matthias",
  "status": "success",
  "content": "Prof. Dr.-Ing. Matthias Becker – Institut für Praktische Informatik – Leibniz Universität Hannover Professor Matthias Becker – Institut für Praktische Informatik – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik Start Kontakt Institut für Praktische Informatik Fachgebiet Mensch-Computer-Interaktion Personenverzeichnis Professor Matthias Becker Prof. Dr.-Ing. Matthias Becker Prof. Dr.-Ing. Matthias Becker Telefon +49 511 762 2394 E-Mail beckerhci.uni-hannover.de Adresse Appelstraße 4 30167 Hannover Gebäude 3703 Raum 018 Prof. Dr.-Ing. Matthias Becker Telefon +49 511 762 2394 E-Mail beckerhci.uni-hannover.de Adresse Appelstraße 4 30167 Hannover Gebäude 3703 Raum 018 Funktionen Ansprechperson Praktikumsbeauftragte für Informatik und Technische Informatik Vertretung der wissenschaftlichen Mitarbeiterinnen und Mitarbeiter Prüfungsausschuss Informatik Vertretung der wissenschaftlichen Mitarbeiterinnen und Mitarbeiter Auswahlkommission Informatik Professorinnen und Professoren Fachgebiet Mensch-Computer-Interaktion Publikationen Akademischer Verlauf 2019 - now:Joined Human-Computer Interaction Group at Leibniz University Hannover2013:Habilitation (venia legendi in computer science)2000 - 2019:Postdoctoral permanent position at Leibniz University Hannover in the Modelling and Simulation Group2000:Associated Assistant professor in Nante, France. 'maitre d'assitant associé' at 'École des Mines de Nantes'2000:Selfemployed, Verification of UMTS implementation of Bosch1996 - 2000:PHD Studies at University Bremen supported by DFG grant 'Graduiertenkolleg Sichere Systeme' Letzte Änderung: 15.11.22 Druckversion So erreichen Sie uns Kontakt Kontakt © 2025: Leibniz Universität Hannover Impressum Datenschutz Barrierefreiheit Sitemap Menü×Fachgebiet Mensch-Computer-InteraktionFachgebiet Software EngineeringFakultät für Elektrotechnik und InformatikKontakt",
  "content_length": 1900,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:07"
}