{
  "name": "Matt Bishop",
  "homepage": "http://nob.cs.ucdavis.edu/~bishop",
  "status": "success",
  "content": "Matt Bishop’s Home Page My Links My Home Page Books Classes Papers Reports and Notes Research Security in Programming Service Students Talks Miscellaneous My Family About Me (CV and such) Other Links Cybersecurity Club Computer Security Lab Dept. of Computer Science College of Engineering University of California, Davis City of Davis County of Yolo State of California United States of America Me This Quarter’s Classes Office Hours for This Quarter Contacting Me My Personal Blog (Last Entry September 4, 2020; “Don’t Vote Twice”) Current Time in Davis, CA, USA WARNING!!! Ignore any email about hiring purportedly from me, please! There are emails going around asking people if they want temporary, internship, or research assistantships with me. They are fake! If you get one, someone is trying to scam you. Matt Bishop Department of Computer Science University of California, Davis One Shields Ave. Davis, CA 95616-8562 United States of America Office: 2209 Watershed Sciences Telephone: +1 (530) 752-8060 Fax: +1 (530) 752-4767 Email: mabishop at ucdavis dot edu Office Co-ordinates: Latitude: N 38° 32' 5'' Longitude: W 121° 45' 10'' For graduate admissions, click here PGP key information here I am a Distinguished Professor in the Department of Computer Science at the University of California at Davis. I am one of the co-directors of the Computer Security Laboratory here. I’m also the faculty advisor to the UC Davis Cyber Security Club. The picture above is me in the dining hall of the Cumberland Lodge at Great Windsor Park in the United Kingdom during the New Security Paradigms Workshop in 2018, of which I was the chairperson. I do research in computer security. Currently, my interests seem to focus on election processes, data sanitization, and the insider problem. I also like teaching. A second edition of my book Computer Security: Art and Science was published in November 2018. Another version of the first edition, Introduction to Computer Security, was published in 2004, again by Addison-Wesley Professional. Check them out and see which you prefer. Graduate Admissions. Click here for information on being admitted to do graduate work in information assurance or computer security, including a link to the on-line application. Please do not write me asking about your chances of getting in, or if I will admit you. I get too many such letters to answer them, and my answers are the same for everyone: I don’t know, and I do not have the authority to, respectively. There once was an old man from Esser, Whose knowledge grew lesser and lesser. It at last grew so small, He knew nothing at all, And now he’s a college professor. Last updated on Friday, October 18, 2024 10:58:20 AM PDT",
  "content_length": 2713,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:39"
}