{
  "name": "Matthew G. Liptrot",
  "homepage": "http://ku-dk.academia.edu/MatthewLiptrot",
  "status": "success",
  "content": "Matthew G Liptrot - University of Copenhagen Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Matthew G LiptrotUniversity of Copenhagen, Department of Computer Science (DIKU), Assistant ProfessorTechnical University of Denmark (DTU), DTU Compute, Post-DocaddFollowdoneFollowingFollowers25Following9Co-author1Public ViewsWorking to develop methodological improvements in tractography of diffusion MRI, with the aim of being able to successfully map the network of white-matter fibre tracts that form the connections between the brain's cortical processing areas.lessRelated Authors Cyril GoutteNational Research Council Canada Kristoffer Hougaard MadsenCopenhagen University Hospital Hvidovre Sidse ArnfredUniversity of Copenhagen Maria Rosa Christophe PhillipsUniversité de Liège Ranganatha Sitaram Clara DongMacquarie University Mohit RanaUniversity of Florida Lotfi ChaariUniversity of Toulouse David RottenbergInterestsView All (17) UploadsPapers by Matthew G LiptrotLYNGBY -- Matlab toolbox for functional neuroimaging analysisLyngby has been designed and implemented by a modeling group at Informatics and Mathematical Mode... more Lyngby has been designed and implemented by a modeling group at Informatics and Mathematical Modelling (IMM, formerly called Department of Mathematical Modelling), Technical University of Denmark (DTU). The head of this group is Lars Kai Hansen. The programming has been carried out mainly by FinnÅrup Nielsen, Peter Toft and Matthew Liptrot as well as Carsten Helbo. Peter Toft and Carsten Helbo are now involved in other work. 1.7.1 Acknowledgments Furthermore, Cyril Goutte, Lars Kai Hansen, Ulrik Kjems, and the student Pedro Højen-Sørensen have supplied methods and code for the package. Jan Larsen should also be mentioned for his long-term support and discussions.Download Collocation for Diffeomorphic Deformations in Medical Image RegistrationIEEE transactions on pattern analysis and machine intelligence, Jan 21, 2017Diffeomorphic deformation is a popular choice in medical image registration. A fundamental proper... more Diffeomorphic deformation is a popular choice in medical image registration. A fundamental property of diffeomorphisms is in vertibility, implying that once the relation between two points A to B is found, then the relation B to A is given per definition. Consistency is a measure of a numerical algorithm&#39;s ability to mimic this invertibility, and achieving consistency has proven to be a challenge for many state-of-the-art algorithms. Training shortest-path tractography: Automatic learning of spatial priorsNeuroImage, 2016Tractography is the standard tool for automatic delineation of white matter tracts from diffusion... more Tractography is the standard tool for automatic delineation of white matter tracts from diffusion weighted images. However, the output of tractography often requires post-processing to remove false positives and ensure a robust delineation of the studied tract, and this demands expert prior knowledge. Here we demonstrate how such prior knowledge, or indeed any prior spatial information, can be automatically incorporated into a shortest-path tractography approach to produce more robust results. We describe how such a prior can be automatically generated (learned) from a population, and we demonstrate that our framework also retains support for conventional interactive constraints such as waypoint regions. We apply our approach to the open access, high quality Human Connectome Project data, as well as a dataset acquired on a typical clinical scanner. Our results show that the use of a learned prior substantially increases the overlap of tractography output with a reference atlas on both populations, and this is confirmed by visual inspection. Furthermore, we demonstrate how a prior learned on the high quality dataset significantly increases the overlap with the reference for the more typical yet lower quality data acquired on a clinical scanner. We hope that such automatic incorporation of prior knowledge and the obviation of expert interactive tract delineation on every subject, will improve the feasibility of large clinical tractography studies. Long-term diffusion changes in the corpus callosum of patients with severe traumatic brain injuryIntroduction: Diffuse axonal injury (DAI) is the dominating type of primary neuronal injury in pa... more Introduction: Diffuse axonal injury (DAI) is the dominating type of primary neuronal injury in patients with severe blunt head trauma. DAI is produced by sudden acceleration/deceleration/rotation that causes shear of the axons and immediate or delayed axonal disruption. The predominant sites of DAI are the subcortical gray-white matter junction, the corpus callosum and the dorsolateral upper brain stem. Structural MRI is known to underestimate the extent of DAI. Diffusion tensor imaging (DTI) allows for quantitative measurements of the degree and directionality (anisotropy) of water diffusion that reflect white matter architecture. Previous studies of DTI in patients with DAI have found decreased fractional anisotropy (FA) in the corpus callosum [1,2], but no long-term follow-up studies are presently available. We performed a longitudinal follow-up study on patients with severe head injury, aiming to investigate the long-term changes of diffusion parameters following DAI. Methods: F...Download lyngby\" -- a modeler's Matlab toolbox for spatio-temporal analysis of functional neuroimagesIntroduction Functional mapping by fMRI and PET provides unique access to spatio-temporal pattern... more Introduction Functional mapping by fMRI and PET provides unique access to spatio-temporal patterns of activity in the working human brain. However, the intricate combination of biological and engineering mechanisms involved in the acquission of functional brain images gives room for rich and expanding modeling research activity (see e.g. [1] for a recent review of modeling tools). To further this research we have developed a software toolbox based on the popular Matlab platform. Our toolbox, lyngby, provides multiple models for spatio-temporal analysis of image sets including: ffl Single pixel activity maps: t, F, and KS tests. ffl Single pixel hemodynamic response models: LangeZeger [2], FIR filter [3], and artificial neural networks. ffl Clustering: time series, correlation [4], feature [5]. ffl Multivariate models: CVA [6], CRA [7], artificial neural networks [8]. The figure shows an example Matlab toolbox for functional neuroimaging analysisLyngby has been designed and implemented by a modeling group at Informatics and Mathematical Mode... more Lyngby has been designed and implemented by a modeling group at Informatics and Mathematical Modelling (IMM, formerly called Department of Mathematical Modelling), Technical University of Denmark (DTU). The head of this group is Lars Kai Hansen. The programming has been carried out mainly by FinnÅrup Nielsen, Peter Toft and Matthew Liptrot as well as Carsten Helbo. Peter Toft and Carsten Helbo are now involved in other work. 1.7.1 Acknowledgments Furthermore, Cyril Goutte, Lars Kai Hansen, Ulrik Kjems, and the student Pedro Højen-Sørensen have supplied methods and code for the package. Jan Larsen should also be mentioned for his long-term support and discussions.Download The CONNECT project: Combining macro- and micro-structureNeuroImage, 2013In recent years, diffusion MRI has become an extremely important tool for studying the morphology... more In recent years, diffusion MRI has become an extremely important tool for studying the morphology of living brain tissue, as it provides unique insights into both its macrostructure and microstructure. Recent applications of diffusion MRI aimed to characterize the structural connectome using tractography to infer connectivity between brain regions. In parallel to the development of tractography, additional diffusion MRI based frameworks (CHARMED, AxCaliber, ActiveAx) were developed enabling the extraction of a multitude of micro-structural parameters (axon diameter distribution, mean axonal diameter and axonal density). This unique insight into both tissue microstructure and connectivity has enormous potential value in understanding the structure and organization of the brain as well as providing unique insights to abnormalities that underpin disease states. The CONNECT (Consortium Of Neuroimagers for the Non-invasive Exploration of brain Connectivity and Tracts) project aimed to combine tractography and micro-structural measures of the living human brain in order to obtain a better estimate of the connectome, while also striving to extend validation of these measurements. This paper summarizes the project and describes the perspective of using micro-structural measures to study the connectome.Download Brede ToolboxThe Brede Toolbox is a neuroinformatics toolbox primarily written in Matlab and it contains funct... more The Brede Toolbox is a neuroinformatics toolbox primarily written in Matlab and it contains functions for handling bibliographic structures (such as PubMed/MEDLINE structure), volumes, sets of locations (3D Talairach coordinates), with transformation/analysis functions suchs as HTML and VRML generation, statistical analysis, affine transformations, functional volumes modeling with, eg, independent component analysis, Corner Cube visualizations,... It also contains the Brede Database distributed as XML, see also the web-pages for the ... lyngby 2.0 — A modeler's matlab tool☐ for spatio-temporal analysis of functional neuroimagesNeuroImage, 2000Download Validation of tractography: Comparison with manganese tracingHuman brain mapping, Jan 14, 2015In this study, we used invasive tracing to eval",
  "content_length": 25743,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:54"
}