{
  "name": "Matthew Groh",
  "homepage": "https://mattgroh.com",
  "status": "success",
  "content": "Matt Groh Hi, I'm Matt Groh Hi, I'm Matt Groh. Bio - Publications - Recorded Talks - Podcasts - Essays - Art I am an assistant professor at Northwestern University in the Management and Organizations department at the Kellogg School of Management and by courtesy in the Computer Science department at the McCormick School of Engineering. I am also the principal investigator of the Human-AI Collaboration Lab. My research examines the dynamics of human-AI collaboration with a focus on deepfake detection, medical diagnosis, and empathic communication. Bridging methods from social science and machine learning, I build large-scale digital experiments to study questions around when, where, why, and how the combination of human problem solving and AI systems leads to hybrid systems that surpass (or fail to surpass) the performance of either humans or the machine alone. You can find my CV here, research on Google Scholar and latest thoughts on X, BSky, and LinkedIn. I am accepting new PhD students in the Management & Organizations (MORS) department at Northwestern Kellogg. Please apply through the Fall 2025 cycle and mention my name in your application if you are interested in working with me. Due to the high volume of inquiries, I am unable to respond to individual emails about PhD applications. 2025 Papers When Large Language Models are Reliable for Judging Empathic Communication Aakriti Kumar, Nalin Poungpeth, Diyi Yang, Erina Farrell Bruce Lambert, Matthew Groh arXiv [replication code + data] CleanPatrick: A Benchmark for Image Data Cleaning Fabian Gröger, Simone Lionetti, Philippe Gottfrois, Alvaro Gonzalez-Jimenez, Ludovic Amruthalingam, Elisabeth Victoria Goessinger, Hanna Lindemann, Marie Bargiela, Marie Hofbauer, Omar Badri, Philipp Tschandl, Arash Koochek, Matthew Groh, Alexander A. Navarini, Marc Pouly arXiv Characterizing Photorealism and Artifacts in Diffusion Model-Generated Images Negar Kamali, Karyn Nakamura, Aakriti Kumar, Angelos Chatzimparmpas, Jessica Hullman, Matthew Groh ACM CHI 2025 [pdf] [replication code + data] [stimuli] Deceptive Explanations by Large Language Models Lead People to Change their Beliefs About Misinformation More Often than Honest Explanations Valdemar Danry, Pat Pataranutaporn, Ziv Epstein, Matthew Groh, Pattie Maes ACM CHI 2025 2024 Papers Human Detection of Political Speech Deepfakes across Transcripts, Audio, and Video Matt Groh, Aruna Sankaranarayana, Nikhil Singh, Dong Young Kim, Andy Lippman, Rosalind Picard Nature Communications [pdf] [replication code + data] [stimuli] Deep Learning-aided Decision Support for Diagnosis of Skin Disease across Skin Tones Matt Groh, Omar Badri, Roxana Daneshjou, Arash Koochek, Caleb Harris, Luis Soenksen, P. Murali Doraiswamy, Rosalind Picard Nature Medicine [ pdf ] [ research briefing] Intrinsic Self-Supervision for Data Quality Audits Fabian Gröger, Simone Lionetti, Philippe Gottfrois, Alvaro Gonzalez-Jimenez, Ludovic Amruthalingam, Labelling Consortium, Matt Groh, Alexander Navarini, Marc Pouly NeurIPS [pdf] Deepfake Detection in Super-Recognizers and Police Officers Meike Ramon, Matthew Vowels, Matthew Groh IEEE Security & Privacy [ pdf ] How to Distinguish AI-generated Images from Authentic Photographs Negar Kamali, Karyn Nakamura, Angelos Chatzimparmpas, Jessica Hullman, Matthew Groh arXiv [ pdf ] [experiment] 2023 Papers Art and the Science of Generative AI Ziv Epstein, Aaron Hertzmann, Investigators of Human Creativity, Memo Akten, Hany Farid, Jessica Fjeld, Morgan R Frank, Matt Groh, Laura Herman, Neil Leach, Robert Mahari, Alex Pentland, Olga Russakovsky, Hope Schroeder, Amy Smith Science (2023) [pdf with additional details] Augmenting Medical Image Classifiers with Synthetic Data from Latent Diffusion Models Luke Sagers, James Diao, Luke Melas-Kyriazi, Matt Groh, Pranav Rajpurkar, Adewole Adamson, Veronica Rotemberg, Roxana Daneshjou, Arjun Manrai preprint (under submission) [pdf] Towards Reliable Dermatology Evaluation Benchmarks Fabian Gröger, Simone Lionetti, Philippe Gottfrois, Alvaro Gonzalez-Jimenez, Matt Groh, Roxana Daneshjou, Labelling Consortium, Alexander Navarini, Marc Pouly Proceedings of Machine Learning Research - ML4Health Symposium (2023) [pdf] 2022 Papers Deepfake Detection by Human Crowds, Machines, and Machine-informed Crowds Matt Groh, Ziv Epstein, Chaz Firestone, and Rosalind Picard Proceedings of the National Academy of Science (2022) [pdf] [experiment] [replication code and data] Computational Empathy Counteracts the Effects of Anger on Human Creative Problem Solving Matt Groh, Craig Ferguson, Rob Lewis, Rosalind Picard 10th International Conference on Affective Computing and Intelligent Interaction (ACII) (2022) [pdf] [experiment] [replication code and data] Towards Transparency in Dermatology Image Datasets with Experts, Crowds, and an Algorithm Matt Groh, Caleb Harris, Roxana Daneshjou, Omar Badri, Arash Koochek Proceedings of the ACM on Human-Computer Interaction (CSCW) (2022) [pdf] [replication code and data] Context Shift from Test Benchmarks to Real-World Production Performance Matt Groh ICML Workshop on Principles of Distribution Shift (2022) [pdf] Improving Dermatology Classifiers across Populations using Images Generated by Large Diffusion Models Luke Sagers, James Diao, Matt Groh, Pranav Rajpurkar, Adewole Adamson, Arjun Manrai NeurIPS Workshop Synthetic Data for Machine Learning (2022) [pdf] 2021 Papers Context in Automated Affect Recognition Matt Groh, Rosalind Picard NeurIPS Workshop Meaning in Context (2021) [pdf] Evaluating Deep Neural Networks Trained on Clinical Images in Dermatology with the Fitzpatrick 17k Dataset Matt Groh, Caleb Harris, Luis Soenksen, Felix Lau, Rachel Han, Aerin Kim, Arash Koochek, and Omar Badri Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (2021) [pdf] [replication code and data] Human detection of machine-manipulated media Matt Groh, Ziv Epstein, Nick Obradovich, Manuel Cebrian, Iyad Rahwan Communications of the ACM (2021) [pdf] [replication code and data] Social influence leads to the formation of diverse local trends Ziv Epstein, Matt Groh, Abhimanyu Dubey, Alex 'Sandy' Pentland Proceedings of the ACM on Human-Computer Interaction (CSCW) (2021) [pdf]",
  "content_length": 6252,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:52"
}