{
  "name": "Matthias Renz",
  "homepage": "https://www.ai.informatik.uni-kiel.de/ai/team/prof-dr-matthias-renz",
  "status": "success",
  "content": "Archäoinformatik - Data Science Data Mining, Machine Learning, Knowledge Discovery und effiziente Suchmethoden mit Fokus auf räumlichen und raumzeitlichen Daten bilden die Grundlage unserer Forschung. In einem  interdisziplinären Umfeld erforschen, entwickeln und nutzen wir Methoden, um Muster, Trends und Beziehungen zwischen Objekten in großen, potenziell unstrukturierten und heterogenen Datensammlungen zu entdecken. Diese ermöglichen es uns beispielsweise, komplexe Prozesse zu modellieren und zu untersuchen, wie intelligente Verkehrs- und Transportsysteme, geophysikalische und biologische Prozesse in der Ozeanforschung oder sozio-ökologische Veränderungen in der Geoarchäologie. Abschlussarbeiten Zur Team-Übersicht Prof. Dr. Matthias RenzMatthias.Renz@informatik.uni-kiel.de+49 431 880-7272Christian-Albrechts-Platz 4D-24118 KielRaum: 708 (CAP 4) Ulrike PollakowskiUlrike.Pollakowski@informatik.uni-kiel.de+49 431 880-7270Christian-Albrechts-Platz 4D-24118 KielRaum: 707 (CAP 4) Der Kompromiss zwischen Geschwindigkeit und Energieverbrauch ist ein zentrales Problem bei der umweltfreundlichen Routenplanung. Neben anderen limitierenden Faktoren wächst die Anzahl möglicher Routen exponentiell.Mit welchen Methoden kann die Suche nach pareto-optimalen Routen auf dynamischen Multigraphen effizienter gestaltet werden?Wie können wir dynamische Umgebungsfaktoren nutzen, um umweltfreundliches Routing zu ermöglichen?Welche besonderen Herausforderungen ergeben sich bei der Übertragung moderner Methoden der Straßennetz-Navigation auf das offene Meer und wie können wir diese meistern? In heterogenen Graphen werden den Knoten (und Kanten) verschiedene Typen zugewiesen, wodurch eine reichere Semantik modelliert werden kann als in herkömmlichen, nicht-typisierten (homogenen) Netzwerken.Was sind die Grundbausteine eines heterogenen Netzes?Wie können wir effizient bedeutsame Muster in einem Netzwerk mit Milliarden von Knoten und Kanten finden?Wie können wir Methoden für herkömmliche Graphen auf getypte Netzwerke generalisieren? Wie können wir leicht verzerrte Partikelwirbel in großen räumlichen Datenbanken effizient aufspüren?Wo bilden sich Cyanobakterienblüten und was sind die treibenden Kräfte für die Entwicklung der Blüte?Wie kann die Informatik verschiedene meereswissenschaftliche Datenprodukte fusionieren, um neue Erkenntnisse in den Meereswissenschaften zu gewinnen? Inwieweit erlauben uns Oberflächenprospektionen (Radar, Lidar, Magnetik), prähistorische Landschaften zu rekonstruieren?Welche Parameter beschreiben am besten die ideale geographische Lage eisenzeitlicher Befestigungsanlagen?Wie können Daten aus verschiedenen Disziplinen und Perspektiven effektiv integriert und verwaltet werden? NFDI4Objects ist ein Konsortium der National Research Data Infrastructure Association (NFDI), das sich auf die Entwicklung einer Forschungsdateninfrastruktur für das materielle Erbe der Menschheit konzentriert. Es hat zum Ziel, die Erforschung und Dokumentation von Artefakten, Gebäuden, archäologischen Funden und Landschaften durch die Bereitstellung interoperabler und nachhaltiger Datendienste zu verbessern. Dies geschieht in Übereinstimmung mit den FAIR-Prinzipien (Findable, Accessible, Interoperable, Reusable) und den CARE-Prinzipien (Collective Benefit, Authority to Control, Responsibility, Ethics).Die Arbeitsgruppe Archäoinformatik-Data Science ist an der Task Area „Analyse und Experimente“ beteiligt. Der Schwerpunkt liegt auf der Entwicklung von Datenstrukturen zur skalierbaren Verwaltung und Analyse von Wissensgraphen. Ein erster Anwendungsfall sind Daten aus dem Poseidon Framework. Darüber hinaus beschäftigt sich die Arbeitsgruppe mit einer Neuimplementierung des archäobotanischen Datenbankprogramms ArboDat, um dessen Etablierung in der nationalen und internationalen Community voranzutreiben. Wir arbeiten an einer neuen Implementierung des archäobotanischen Datenbankprogramms ArboDat mit dem Ziel, dessen Etablierung in der nationalen und internationalen Gemeinschaft zu fördern. Zu diesem Zweck wird die Software als leichter zugängliches, betriebssystemunabhängiges Datenbanksystem neu implementiert. Außerdem wird sie zu einer vereinfachten, flexiblen und mehrsprachigen Web-Anwendung weiterentwickelt.ArboDat ist ein Softwarepaket zur Erfassung und zum Import von Daten aus archäobotanischen Analysen, einschließlich der Kontexte der Proben sowie der Auswertungswerkzeuge. Das frühere ArboDat wurde seit 1997 entwickelt und basiert auf MS Access. ArboDat+ ist eine Weiterentwicklung des Programms ArboDat und wird als Kooperationsprojekt zwischen NFDI for Objects (NFDI4O), dem Niedersächsischen Institut für historische Küstenforschung (NIhK) und dem Institut für Ur- und Frühgeschichtliche Archäologie (UFG) sowie dem Institut für Informatik (IfI) der Universität Kiel durchgeführt. Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 5372,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:18"
}