{
  "name": "Matt Huenerfauth",
  "homepage": "http://huenerfauth.ist.rit.edu",
  "status": "success",
  "content": "Matt Huenerfauth, Dean and Professor, Rochester Institute of Technology (RIT) Matt Huenerfauth Dean and Professor Golisano College of Computer and Information SciencesRochester Institute of Technology - RIT Skip to Main Content Navigation Menu Home Research Teaching CV and Bio Resources Contact Info Matt Huenerfauth at RIT Matt Huenerfauth is a Professor and Dean of the Golisano College of Computer and Information Sciences at the The Rochester Institute of Technology (RIT). Huenerfauth and his students conduct research on computer accessibility for people who are Deaf or Hard of Hearing, assistive technology for people with disabilities, human computer interaction, and computational linguistics. co-Director of the Center for Accessibility and Inclusion Research (CAIR) and Director of the Linguistic and Assistive Technologies Lab (LATLab) Chair of the ACM’s Special Interest Group on Accessible Computing (SIGACCESS) as of July 2021. Distinguished Member of the Association for Computing Machinery. Recipient of RIT's Trustees Scholarship Award, the university's highest honor for faculty research. Five-time winner of the Best Paper Award at the ACM SIGACCESS Conference on Computers and Accessibility (most frequent winner in the history of the ASSETS conference, which has a 25% acceptance rate and is the leading computing research venue in the field of accessibility) Former Editor-in-Chief of the ACM Transactions on Accessible Computing (TACCESS) journal (maximum two terms, 2013-2019) RIT is a private, doctoral research university in the Finger Lakes region of New York. RIT was ranked #98 among National Universities in the U.S. News and World Reports Best Colleges Rankings 2024, and it is the second largest producer of undergraduate STEM degrees among private U.S. universities. RIT is home to the National Technical Institute for the Deaf, with over 1,000 Deaf and Hard of Hearing students. This website contains information about his Research and his background and experience (Curriculum Vitae).   Information about courses is available on the Teaching page, and links to other resources appear on the Interests page.   A listing of Contact Information is also included on this site. © 2009-2023 Matt Huenerfauth",
  "content_length": 2239,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:42"
}