{
  "name": "Matthias Müller-Hannemann",
  "homepage": "https://www.informatik.uni-halle.de/arbeitsgruppen/datenstrukturen/mitarbeiter/muellerh",
  "status": "success",
  "content": "Prof. Dr. Matthias Müller-Hannemann Aktuelle Sprache: Deutsch switch to english version Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zu weiteren Einstellungen Themennavigation Studium Forschung Weiterbildung Karriere Presse International Hauptnavigation Die Universität Fakultäten Naturwissenschaftliche Fakultät III - Agrar- und Ernährungswissenschaften, Geowissenschaften und Informatik Institut für Informatik Arbeitsgruppen am Institut Datenstrukturen und effiziente Algorithmen Mitarbeiter Prof. Dr. Matthias Müller-Hannemann Publikationen Forschung Projekte Mitarbeiter International Office Zentrale Einrichtungen Graduierten-Akademie Wissenschaftliche Zentren An-Institute Universitätsklinikum Kontakt Prof. Dr. Matthias Müller-Hannemann Telefon: +49-345-5524729 Telefax: ++49-345-5527039 Raum 4.19 Institut für Informatik Martin-Luther-Universität Halle-Wittenberg Von-Seckendorff-Platz 1 06120 Halle (Saale) Email: matthias.mueller-hannemann AT informatik.uni-halle.de Sprechstunde: nach Vereinbarung Weiteres Sprache: English Schrift: größer , kleiner Login für Redakteure Prof. Dr. Matthias Müller-Hannemann Matthias Müller-Hannemann Prof. Dr. Matthias Müller-Hannemann studierte Wirtschaftsmathematik an der Technischen Universität Berlin (Diplom 1994, Promotion zum Dr. rer.nat. 1997, Habilitation in Mathematik 2001). Nach seinem Diplom arbeitete er als wissenschaftlicher Mitarbeiter (1994-2000) in DFG-Projekten zur Netzgenerierung bei Finite-Elemente-Methoden. Im Jahr 2000 wechselte er an das Forschungsinstitut für Diskrete Mathematik der Universität Bonn und war dort für zwei Jahre Vertretungsprofessor für Mathematische Optimierung. Danach folgte in 2003 ein Wechsel an den Fachbereich Informatik der Technischen Universität Darmstadt mit einem weiteren Jahr Vertretungsprofessur für das Gebiet Algorithmik und einer anschließenden Tätigkeit als wissenschaftlicher Assistent  (C1) in der Arbeitsgruppe von Prof. Dr. Karsten Weihe.  Seit 2007 hat Prof. Dr. Müller-Hannemann einen Lehrstuhl für Praktische Informatik (Datenstrukturen und effiziente Algorithmen) an der Martin-Luther-Universität Halle-Wittenberg inne. Seit Dezember 2010 ist er Geschäftsführender Direktor des Universitätszentrums Informatik, von November 2015 bis April 2017 war er Studiendekan der Fakultät, im Mai 2017 wurde er zum Dekan gewählt. Aktuelles BMBF-Projekt (2024-2028): DiP: SMART-Agroforst - Digitalisierung zur Förderung der Etablierung von Agroforstsystemenauf der Landschaftsebene als Beitrag zur Klimaresilienz Süd-Sachsen-Anhalts und Dekarbonisierung seiner chemischen Industrie Übersichtsartikel zu Route Planning in Transportation Networks   , arXiv:1504.05140. LNCS 5971 Algorithm Engineering Matthias Müller-Hannemann und Stefan Schirra (Eds.) Algorithm Engineering - Bridging the gap between algorithm theory and practice LNCS 5971, Springer-Heidelberg, XVI, 513 p., Softcover, 2010 ISBN: 978-3-642-14865-1 Zum Seitenanfang Fußnavigation Startseite, Datenschutz, Disclaimer, Impressum, Letzte Aktualisierung: 23.05.2025 Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zum Seitenanfang",
  "content_length": 3222,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:15"
}