{
  "name": "Matthew Johnson-Roberson",
  "homepage": "https://news.vanderbilt.edu/tag/matthew-johnson-roberson",
  "status": "success",
  "content": "Archive | Matthew Johnson-Roberson | Vanderbilt University Matthew Johnson-Roberson Decoding Vanderbilt’s New College of Connected Computing In this conversation with Vanderbilt Magazine, Dean Matthew Johnson-Roberson discusses his vision for the new College of Connected Computing, the integration of AI across disciplines and why “connected computing” represents the future of technology education. Read More Nov 6, 2025 Annual Postdoc Symposium provides career guidance, shows breadth of research at Vanderbilt The 19th annual Vanderbilt Postdoctoral Association Symposium on Oct. 14, 2025, brought together postdoctoral scholars from across Vanderbilt University and Vanderbilt University Medical Center for a day of research, professional development and community building.   Read More Nov 3, 2025 Vanderbilt University expands public programming in NYC with Fall 2025 Faculty Lecture Series Building on the success of its inaugural public programming in Chelsea, Vanderbilt University today announced the next chapter of its faculty lecture series at Vanderbilt University - New York City. This fall, the university will invite New Yorkers and the Vanderbilt community to explore the intersections of music and spirituality and the mutual influence of technology and education through two public events: “Divine Rhythms: Jazz and the Sacred” on September 25 and “AI and the Future of the American University” on November 13. Read More Aug 14, 2025 Registration now open for the 19th annual Vanderbilt Postdoc Symposium, faculty judges needed Registration is open for the 19th annual Vanderbilt Postdoctoral Association Symposium on Tuesday, Oct. 14, at the Student Life Center, starting at 9 a.m. Faculty members from all disciplines are invited to participate as judges for the poster presentations. Read More Jul 23, 2025 Vanderbilt names technology visionary Matthew Johnson-Roberson as its first dean of the College of Connected Computing Matthew Johnson-Roberson, a visionary technology scholar and highly accomplished academic leader, will be the inaugural dean of Vanderbilt University’s College of Connected Computing, the university’s first new college to be established in more than 40 years, C. Cybele Raver, provost and vice chancellor for academic affairs, announced today. His appointment begins May 1, 2025.  Read More Mar 20, 2025",
  "content_length": 2353,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:55"
}