{
  "name": "Matthew Giamou",
  "homepage": "https://mattgiamou.ca",
  "status": "success",
  "content": "Matt Giamou Matt Giamou Home Research Teaching Software Blog CV Matt Giamou Hello! I am an Assistant Professor at McMaster University's Department of Computing and Software, where I lead the Autonomous Robotics and Convex Optimization Laboratory (ARCO Lab). I recently worked as a postdoctoral researcher at the Northeastern University Robust Autonomy Laboratory (NEURAL), where I developed global polynomial optimization techniques for robust machine perception. I received my PhD with Prof. Jonathan Kelly's Space and Terrestrial Autonomous Robotic Systems (STARS) at the University of Toronto. I received my SM in aerospace engineering with the Aerospace Controls Lab at MIT in 2017, and my BASc in engineering science from UofT in 2015. ARCO Lab is hiring! I am recruiting graduate students for 2025. Please fill out this short form if you are interested in and have experience in any of the following areas: theory and implementation of optimization algorithms; perception and state estimation for mobile robots; probability, statistics, and machine learning; motion planning and control for robot manipulators; and experiments involving software and hardware integration for autonomous ground vehicles and manipulator robots. I am eager to form a diverse team that will tackle core theoretical problems at the heart of safe and effective autonomy while simultaneously building a world-class laboratory for experiments on real robots. Research Interests My research focuses on convex optimization for fast and provably globally optimal or robust solutions to geometric problems in robotics. This approach has yielded results in multi-sensor calibration, supervised deep learning for rotations, and inverse kinematics. I believe that developing a mathematically rich and clearly articulated science of robotics is just as important as design and engineering, and hope to contribute to the safe and socially responsible deployment of robots and other autonomous systems. I am currently seeking opportunities to work with companies applying autonomous systems to applications in the geosciences, environmental science, space exploration, medicine, transportation, and manufacturing. © Matt Giamou. Last modified: July 26, 2024. Website built with Franklin.jl and the Julia programming language.",
  "content_length": 2296,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:52"
}