{
  "name": "Matthew Collinson",
  "homepage": "https://www.abdn.ac.uk/people/matthew.collinson",
  "status": "success",
  "content": "Dr Matthew Collinson | The University of Aberdeen Dr Matthew Collinson Dr Matthew CollinsonBSc. MSc. PhD.Senior Lecturer Accepting PhDs About Email Addressmatthew.collinson@abdn.ac.ukOffice AddressComputing Science, Meston Building, Meston Walk, University of Aberdeen, AB24 3UESchool/DepartmentSchool of Natural and Computing Sciences Personal WebsiteLinkedinGoogle ScholarORCiD Biography Previously: - Research Scientist, HP Labs, Bristol, UK (2006-2010) - Head of Computing Science (2021-2024) Qualifications BSc Mathematics 1997 - University of Edinburgh MSc Mathematical Logic 1998 - University of Manchester PhD - 2003 - University of Manchester Research Research Overview Logic, mathematical foundations of computer science, information security. I keep more information on my personal web pages. I may be found by search engine. http://homepages.abdn.ac.uk/matthew.collinson/pages/ Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Supervising Accepting PhDsView Research Area Research Specialisms Computer ScienceComputer and Information Security Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Teaching Teaching Responsibilities These change frequently. The relevant content is hosted on the myAberdeen Blackboard \"Virtual Learning Environment.\" If you are enrolled on a course that I am teaching, then you will see this in the VLE course area. I have taught a wide range of subjects at a wide range of levels, and both undergraduates and postgraduates. Some courses in which I have been involved in teaching: CS552N Security Management CS552F Information Governance, Data Security and Privacy CS502M Security Analytics with Artificial Intelligence CS502L Cybersecurity Fundamentals CS502D Artificial Intelligence, Privacy and Security CS502C Enterprise Security Architecture CS5099 Information Security CS5095 Data Management and Security CS4028 Security CS30/35.. Distribute Systems and Security CCS3518 languages and Computability CS30../CS3523 AI for Computer Games CS2013 Mathematics for Computer Science CS25.. Algorithmic Problems Solving CS2009/CS5038 The Electronic Society CS1029 Modelling and Problem Solving for Computing. Supervision of projects as part of taught degree programmes: CS5... MSc Cybersecurity Project CS5... MSc Artificial intelligence Project CS5... MSc Information Technology Project CS5... MEng informatics (Computing Science) Project CS45.. Single Honours Computing Project (BSc, MA) CS45.. Joint Honours Computing project (BSc, MA) CS30/35.. Software Engineering team projects Publications Page 1 of 3 Results 1 to 10 of 24 A Quantitative Field Study of a Persuasive Security Technology in the Wild 2022 - PublishedVargheese, J. P., Collinson, M., Masthoff, J. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1007/978-3-031-19097-1_13[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/852231db-c60d-448f-b5bd-5ab52a4a0a9a/download[ONLINE] http://www.dcs.gla.ac.uk/socinfo2022/papers.html[ONLINE] Provided by the Springer Nature SharedIt content-sharing initiative Modelling Security Risk Scenarios Using Subjective Attack Trees 2021 - PublishedAl-Hadhrami, N., Collinson, M., Oren, N. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1007/978-3-030-68887-5_12[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/1aa2f78f-1da8-497c-866b-8b8b9ea4e66e/download[ONLINE] View publication in ScopusSecurity Analysis Using Subjective Attack Trees 2021 - PublishedAl-Hadhrami, N., Collinson, M., Oren, N. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1007/978-3-030-69255-1_19[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/672a77fa-2e4b-425c-9385-6db58deb6c96/download[ONLINE] View publication in ScopusA Subjective Network Approach for Cybersecurity Risk Assessment 2020 - PublishedAl-Hadhrami, N., Collinson, M., Oren, N. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1145/3433174.3433175Exploring Susceptibility Measures to Persuasion 2020 - PublishedVargheese, J., Collinson, M., Masthoff, J. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1007/978-3-030-45712-9_2[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/49dfe7d5-928d-40d5-88a7-d558ae75eeb4/download[ONLINE] View publication in ScopusA Stable Variational Autoencoder for Text Modelling 2019 - PublishedLi, R., Li, X., Lin, C., Collinson, M., Mao, R. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18653/v1/W19-8673[ONLINE] https://aclweb.org/anthology/[ONLINE] View publication in ScopusA Stable Variational Autoencoder for Text Modelling 2019 - PublishedLi, R., Li, X., Lin, C., Collinson, M., Mao, R. Contributions to Conferences: Oral Presentations[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/71a2c7ea-dee9-4d96-aceb-f0717f8b4f90/downloadA Dual-Attention Hierarchical Recurrent Neural Network for Dialogue Act Classification 2019 - PublishedLi, R., Lin, C., Collinson, M., Li, X., Chen, G. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://www.aclweb.org/anthology/K19-1036.pdf[ONLINE] DOI: https://doi.org/10.18653/v1/K19-1036[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/8d367dfa-014a-4a2f-96a2-94f1aa4b10ae/download[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/2c4d61b7-f512-4b1d-982f-bbdb85e52c33/download[ONLINE] https://www.aclweb.org/anthology/K19-1/A logic of hypothetical conjunction 2019 - PublishedCollinson, M. Journal of Logic and Computation, vol. 29, no. 6, pp. 975–1009Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1093/logcom/exz018[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/296a8b38-a68c-4cb8-84a0-558654b23980/downloadCaught by phishing emails? How can argumentation schemes be used to protect users? 2018 - PublishedThomas, R. J., Collinson, M., Masthoff, J. Contributions to Conferences: Papers[ONLINE] View publication in Scopus Show 10 | 25 | 50 | 100 results per page Refine Books and Reports Books (1) Chapters in Books, Reports and Conference Proceedings Chapters (3) Conference Proceedings (8) Contributions to Conferences Papers (2) Oral Presentations (1) Contributions to Journals Articles (9) Update",
  "content_length": 6661,
  "method": "requests",
  "crawl_time": "2025-12-01 13:55:49"
}