{
  "name": "Matías Toro",
  "homepage": "https://pleiad.cl/people/mtoro",
  "status": "success",
  "content": "people:mtoro - PLEIAD Home Research Teaching People Location Matías Toro Ipinza Assistant Professor mtoro@dcc.uchile.cl PLEIAD Lab Blanco Encalada 2120, of 325 Computer Science Department (DCC) Santiago, Chile University of Chile phone: +56 2 29867692 Research Interests Programming Languages Type-and-effect systems Gradual Typing Security Typing Substructural Type Systems Abstracting Gradual Typing Differential Privacy News I'm on the PC of ICFP 2025 I'm on the PC of PLDI 2025 Gradual Sensitivity Typing accepted at CSF 2025 Elucidating Type Conversions in SQL Engines accepted at ESOP 2025 Publications The following documents are included by the contributing authors as a means to ensure timely dissemination of scholarly and technical work on a non-commercial basis. Copyright and all rights therein are maintained by the authors or by other copyright holders, notwithstanding that they have offered their works here electronically. It is understood that all persons copying this information will adhere to the terms and constraints invoked by each author's copyright. These works may not be reposted without the explicit permission of the copyright holder. Loading bibtex info... PC membership AND journal reviews 2025 ICFP 30th ACM SIGPLAN International Conference on Functional Programming Program committee of ICFP papers. PLDI 46th ACM SIGPLAN Conference on Programming Language Design and Implementation Program committee of PLDI papers. 2022 ICFP 27th ACM SIGPLAN International Conference on Functional Programming Program committee of ICFP papers. 2021 ML’21 ML Family 2021 workshop Program committee of ML’21 papers. COLA Journal of Computer Languages Reviewer of two journal articles. 2020 POPL 47th ACM SIGPLAN Symposium on Principles of Programming Languages Artifact Evaluation Committee 2019 OOPSLA Proceedings of the 35th ACM SIGPLAN Conference on Object-Oriented Programming Systems, Lan- guages and Applications Artifact Evaluation Committee Funding 2025 FONDECYT DE INICIACIÓN Fondo Nacional de Desarrollo Científico y Tecnológico Funding for three years. 2024 PROYECTO DE COLABORACIÓN INTERNACIONAL DFG-ANID Fondo Nacional de Desarrollo Científico y Tecnológico Funding for three years. 2020 FONDECYT Fondo Nacional de Desarrollo Científico y Tecnológico Funding for three years for a postdoc in the University of Chile. 2015 CONICYT Comisión Nacional de Investigación Científica y Tecnológica Funding for four years to complete the PhD studies. 2013 CONICYT Comisión Nacional de Investigación Científica y Tecnológica Funding for two years to complete the Master studies. [ Back to top | Sitemap ] [ Log In | Old revisions | New posting ] mnml-blog on DW under the hood",
  "content_length": 2697,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:30"
}