{
  "name": "Maunendra Sankar Desarkar",
  "homepage": "http://www.iith.ac.in/~maunendra",
  "status": "success",
  "content": "Maunendra-Homepage I am an Associate Professor at the Computer Science and Engineering Department at IIT Hyderabad, India. I am also associated with the Department of the AI Department at IIT Hyderabad as an affiliated faculty member. My main research areas are Natural Language Processing, Information Retrieval, and Machine Learning. We work towards advancing AI, and specifically NLP algorithms, to be robust, responsible, and respectful to a diverse audience who speak different languages and follow different cultures. We consider how NLP techniques (foundational/applied) can excel even in scenarios with limited volume of labeled data, can include desirable properties such as non-toxicity, empathy, groundedness etc. More details about our work can be found at the website of our lab called Natural Language and Information Processing (NLIP). Recent News Aishwarya's work titled \"Probing the Inherent Ability of Large Language Models for Generating Empathetic Responses\" is accepted at IEEE Swiss Conference on Data Science | SDS 2025. It was a great experience to present the work at SDS, an event organized in fully physical mode. Debolena's work on hallucinations in LVLM-based captioning for drone-captured data is accepted in WACV 2025. Congratulations, Debolena. Suvodip's work on titled \"BoK: Introducing Bag-of-Keywords Loss for Interpretable Dialogue Response Generation\" is accepted in SIGDIAL 2024. This is the 25th edition of the conference focused on the theme of dialog systems. Suvodip Dey defends his PhD Thesis, in the area of Conversational AI/Dialog Systems. The title of his thesis is \"Towards Scalable and Interpretable Dialogue Systems and their Evaluation\". We have our work on non-toxic autosuggest generation accepted at SIGIR 2024. It is one of the topmost conference in the Information Retrieval field. This is another publication from our MAPG work in collaboration with Microsoft. Two papers accepted at PAKDD 2024. One is on non-toxic autosuggest generation - A joint work with Manish Gupta (Microsoft). This is the first publication from Aishwarya's PhD work. The other paper is from Debolena's PhD work on Image captioning. Again, first publication. Congratulations, Aishwarya and Debolena. We are working on improving zero-short MT for extremely low resource languages, using noise injection techniques. Two papers on this theme are acceptted, in EMNLP (Findings) and EACL. congratulations Kaushal. Also, congratulations to Maharaj on his first publication from PhD. More news →",
  "content_length": 2519,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:35"
}