{
  "name": "Mauro Conti",
  "homepage": "https://www.math.unipd.it/~conti",
  "status": "success",
  "content": "Mauro Conti, PhD - IEEE Fellow - Full Professor - EU Marie Curie Fellow Alumni Home | Short Bio | Research | Publications | Talks | Activities | Students | Teaching \"You cannot hope to build a better world without improving the individuals. To that end each of us must work for his own improvement, and at the same time share a general responsibility for all humanity, our particular duty being to aid those to whom we think we can be most useful.\" ---Marie Curie Mauro Conti Full Professor, University of Padua, Italy IEEE Fellow | Young Academy of Europe Fellow Editor-in-chief, IEEE TIFS UniPD Academic Advisor for Entrepreneurship Development Study Program Coordinator of MSc degree in Cybersecurity Head of SPRITZ Security and Privacy Research Group Director of UniPD node of CINI Cybersecurity National Lab Also affiliated with TU Delft (NL) and UW (USA) CEO and co-funder of CHISITO | Co-funder of DYALOGHI EU Marie Curie Fellow Alumni | DAAD Fellow Alumni Contact: University of Padua - Dep. of Mathematics and HIT Center Via Trieste, 63 - 35121, Padua, Italy Room 526 - Phone +39 049 827 1488 - Fax +39 049 827 1479 - Project Assistant Contact: Media Coverage (check also the full list) Positions/Grants (please drop an email to contiprj@math.unipd.it if interested) News For Students I am always enthusiastic to supervise strongly motivated MSc and PhD students that are willing to work with me in my research area (in brief: security and privacy). If you are interested, please drop me an email (with CV). I am ERASMUS Academic Coordinator for students exchange with: TU Darmstadt; VU Amsterdam; KU Leuven; U. of Helsinki; IPB Bordeaux. If you are interested in an international experience for your BSc/MSc/PhD, please contact me (projects available with several top universities worldwide and with companies and institutions such as Intel, CISCO, IBM, Dropbox, SAP, NEC, and NATO). If you are from China and interested in a PhD, PostDoc, or visiting research under my supervision, I strongly advise you to apply for Scholarship from CSC and its special scholarship program with the University of Padua (more info here). Selected/Recent Publications (check also the full list) Francesco Marchiori, Mauro Conti. Your Battery Is a Blast! Safeguarding Against Counterfeit Batteries with Authentication. In ACM CCS 2023. Marco Arazzi, Mauro Conti, Antonino Nocera, Stjepan Picek. Turning Privacy-preserving Mechanisms against Federated Learning. In ACM CCS 2023. Jelle Vos, Mauro Conti, Zekeriya Erkin. SoK: Collusion-resistant Multi-party Private Set Intersections in the Semi-honest Model In S&P 2024. Elisa Sartori, Luca Pajola, Giovanni Da San Martino, Mauro Conti. The Impact of Covid-19 on Online Discussions: the Case Study of the Sanctioned Suicide Forum. In The WWW 2023. Xiuzhen Cheng, Mauro Conti, Hao Liu, Riccardo Spolaor, Federico Turrin. Plug and Power: Fingerprinting USB Powered Peripherals via Power Side-channel. In INFOCOM 2023. Ruotong Yu, Francesca Del Nin, Yuchen Zhang, Shan Huang, Pallavi Kaliyar, Sarah Zakto, Mauro Conti, Georgios Portokalidis, Jun Xu. Building Embedded Systems Like It's 1996. In NDSS 2022. Jinwoo Kim, Eduard Marin, Mauro Conti, Seungwon Shin. EqualNet: A Secure and Practical Defense for Long-term Network. In NDSS 2022. Matteo Cardaioli, Stefano Cecconello, Mauro Conti, Simone Milani, Stjepan Picek, Eugen Saraci. Hand Me Your PIN! Inferring ATM PINs of Users Typing with a Covered Hand. In USENIX 2022. Selected/Recent Professional Activities (check also the full list) Editorial Board: IEEE COMST, IEEE TIFS, IEEE TDSC, IEEE TNSM, Elsevier ComNet Program Chair: WISTP '20, ACNS '20 General Chair: Springer SSCC '18. Program Committee Member: NDSS '20, ACM AsiaCCS '20, ACM WiSec '20, ACM SACMAT '20, IEEE INFOCOM '20, IEEE CNS '20, ESORICS '20. My Book on Sensor Networks Security",
  "content_length": 3838,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:39"
}