{
  "name": "Mauro Pezzè",
  "homepage": "http://search.usi.ch/people/4fcdc3b7f6e5a58050ee5b3a2b530ad6/Pezze-Mauro",
  "status": "success",
  "content": "Pezzè, Mauro | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Mauro Pezzè http://usi.to/f6u Biography Mauro Pezzè is professor of software engineering at the University of Lugano and at the University of Milano Bicocca. Prof. Pezzè is interested in software engineering and in particular insoftware test and analysis. Before joining the Faculty of Informatics of the University of Lugano Mauro Pezzè was professor at the University of Milan Bicocca, associate professor at Politecnico di Milano and visiting scientists at the University of California Irvine and at the University of Edinburgh. Mauro Pezzè holds a laurea degree from the University of Pisa and a PhD from Politecnico di Milano. He is member of ACM and senior member of IEEE. He serves asassociate editor of ACM Transactions of Software Engineering and Méthodologies (TOSEM), he served as executive chair of the Technical Committee onComplexity in Computing (TCCX). He served as chair and member of program committees of many international conferences. He is co-author of a book on\"Software Testing and Analysis: Process, Principles and Techniques\" publishedby John Wiley in 2007. Competence areas Cloud Systems Pervasive software systems Self adaptive systems Self healing systems Software testing and analysis Ultra large software systems Contact mauro.pezze@usi.ch tel +41 58 666 4658 East Campus, Sector D, Office D2.20 (Level P2) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Full Professor Links Website or personal page Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2264,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:49"
}