{
  "name": "Max L. Wilson 0001",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/max.wilson",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Max L. WilsonAssociate Professor of Human-Computer Interaction, Director of Student Experience, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom C33 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/aMax.Wilson@nottingham.ac.ukhttp://cs.nott.ac.uk/~pszmw BiographyMax L. Wilson is an Associate Professor of Human-Computer Interaction, in the Mixed Reality Lab, and Director of Student Experience in the School of Computer Science. His EPSRC, European, and Google funded research is focused on the use of fNIRS brain data, about mental workload and other cognitive activity, as a form of personal data, that can be used to evaluate technology and work tasks. This work has emerged from his earlier research on the evaluation of user interfaces for interacting with information. Max is on the steering committees of both ACM CHI and ACM CHIIR conferences, as well as a member of the SIGCHI Conferences Working Group, and a Deputy Editor at the International Journal of Human-Computer Studies.Selected Publications WILSON, MAX L., 2017. The Tetris Model of Resolving Information Needs Within the Information Seeking Process In: Proceedings of the 2017 Conference on Conference Human Information Interaction and Retrieval. 147-154PAUL BRINDLEY, JAMES GOULDING and MAX L. WILSON, 2017. Generating Vague Neighbourhoods through Data Mining of Passive Web Data International Journal of Geographical Information Science. 32(3), pp. 498-523HUGO C. HUURDEMAN, MAX L. WILSON and JAAP KAMPS, 2016. Active and passive utility of search interface features in different information seeking task stages In: 1st ACM SIGIR Conference on Human Information Interaction and Retrieval (CHIIR'16). MATTHEW PIKE, RICHARD RAMCHURN, STEVE BENFORD and MAX L. WILSON, 2016. #Scanners: exploring the control of adaptive films using brain-computer interaction In: 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16). 5385-5396 View all publications RAMCHURN, RICHARD, WILSON, MAX L., MARTINDALE, SARAH and BENFORD, STEVE, 2018. #Scanners 2 - The MOMENT: A New Brain-Controlled Movie In: Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. D210:1-D210:4MAIOR, H. A., WILSON, M. L. and SHARPLES, S., 2018. Workload alerts-using physiological measures of mental workload to provide feedback during tasks: ACM Transactions on Computer-Human Interaction ACM Transactions on Computer-Human Interaction. 25(2), ALSURAYKH, N. H., MAIOR, H. A., WILSON, M. L., TENNENT, P. and SHARPLES, S., 2018. How stress affects functional near-infrared spectroscopy (fNIRS) measurements of mental workload WILSON, MAX L., 2017. The Tetris Model of Resolving Information Needs Within the Information Seeking Process In: Proceedings of the 2017 Conference on Conference Human Information Interaction and Retrieval. 147-154PAUL BRINDLEY, JAMES GOULDING and MAX L. WILSON, 2017. Generating Vague Neighbourhoods through Data Mining of Passive Web Data International Journal of Geographical Information Science. 32(3), pp. 498-523MATTHEW PIKE, RICHARD RAMCHURN, STEVE BENFORD and MAX L. WILSON, 2016. #Scanners: exploring the control of adaptive films using brain-computer interaction In: 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16). 5385-5396HUGO C. HUURDEMAN, MAX L. WILSON and JAAP KAMPS, 2016. Active and passive utility of search interface features in different information seeking task stages In: 1st ACM SIGIR Conference on Human Information Interaction and Retrieval (CHIIR'16). KRISTIYAN EMILOV LUKANOV, HORIA A. MAIOR and MAX L. WILSON, 2016. Using fNIRS in usability testing: understanding the effect of web form layout on mental workload In: Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems. 4011-4016PIKE, MATTHEW, WILSON, MAX L., BENFORD, STEVE and RAMCHURN, RICHARD, 2016. #Scanners: A BCI Enhanced Cinematic Experience In: Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 293-296FLINTHAM, MARTIN, VELT, RAPHAEL, WILSON, MAX, ANSTEAD, EDWARD, BENFORD, STEVE, BROWN, ANTHONY, PEARCE, TIMOTHY and PRICE, DOMINIC, 2015. Run Spot Run : Capturing and Tagging Footage of a Race by Crowds of Spectators In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. HORIA A. MAIOR, MATTHEW PIKE, SARAH SHARPLES and MAX L. WILSON, 2015. Examining the Reliability of Using fNIRS in Realistic HCI Settings for Spatial and Verbal Tasks In: CHI2015: Proceedings of the 33rd annual ACM conference on Human factors in computing systems. Seoul, South Korea, 18 - 23 Apr 2015. 3039-3042MATTHEW PIKE, RICHARD RAMCHURN and MAX L. WILSON, 2015. #Scanners: integrating physiology into cinematic experiences In: 2015 ACM SIGCHI Conference on Creativity and Cognition. 151-152M. ATAUR RAHMAN and MAX L. WILSON, 2015. Exploring opportunities to facilitate serendipity in search In: 38th International ACM SIGIR Conference on Research and Development in Information Retrieval. 939-942MATTHEW PIKE, RICHARD RAMCHURN and MAX L. WILSON, 2015. Two-way Affect Loops in multimedia experiences In: British HCI 2015. 117-118GWIZDKA, JACEK, JOSE, JOEMON, MOSTAFA, JAVED and WILSON, MAX, 2015. NeuroIR 2015: Neuro-Physiological Methods in IR Research In: Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval. 1151-1153BRINDLEY, P, GOULDING, J and WILSON, M L, 2014. A Data Driven approach to mapping urban neighbourhoods In: ACM International Conference on Advances in GIS (SIGSPATIAL),. 437-440PIKE, MATTHEW F, MAIOR, HORIA A, PORCHERON, MARTIN, SHARPLES, SARAH C and WILSON, MAX L, 2014. Measuring the Effect of Think Aloud Protocols on Workload using fNIRS In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 3807-3816MAIOR, HORIA A, PIKE, MATTHEW, WILSON, MAX L and SHARPLES, SARAH, 2014. CONTINUOUS DETECTION OF WORKLOAD OVERLOAD: AN FNIRS APPROACH Contemporary Ergonomics and Human Factors 2014: Proceedings of the international conference on Ergonomics & Human Factors 2014, Southampton, UK, 7-10 April 2014. 450WILSON, MAX L, ALI, SUSAN and VALSTAR, MICHEL F, 2014. Finding information about mental health in microblogging platforms: a case study of depression In: Proceedings of the 5th Information Interaction in Context Symposium. 8-17YE, CHAOYU and WILSON, MAX L, 2014. A user defined taxonomy of factors that divide online information retrieval sessions In: Proceedings of the 5th Information Interaction in Context Symposium. 48-57MEIER, FLORIAN, ELSWEILER, DAVID and WILSON, MAX L, 2014. More than Liking and Bookmarking? Towards Understanding Twitter Favouriting Behaviour In: Eighth International AAAI Conference on Weblogs and Social Media. WILSON, M.J. and WILSON, M.L., 2013. A comparison of techniques for measuring sensemaking and learning within participant-generated summaries Journal of the American Society for Information Science and Technology. 64(2), 291-306WILSON, M.L., 2012. Search user interface design Morgan & Claypool. ELSWEILER, D, WILSON, M L and KIRKEGAARD-LUNN, B, 2011. Understanding Casual-leisure Information Behaviour. In: SPINK, A and HEINSTROM, J, eds., New Directions in Information Behaviour Emerald Group Publishing Limited. 211-241MAX L. WILSON, 2011. Interfaces to Information Retrieval. In: IAN RUTHVEN and DIANE KELLY, eds., Interactive Information Seeking, Behaviour and Retrieval Facet Publishing. WILSON, M.L., KULES, B., SCHRAEFEL, M.C. and SHNEIDERMAN, B., 2010. From keyword search to exploration: designing future search interfaces for the web Foundations and Trends in Web Science. 2(1), 1-97WILSON, M.L. and SCHRAEFEL, M.C., 2010. Evaluating collaborative information-seeking interfaces with a search-oriented inspection method and re-framed information seeking theory Information Processing & Management. 46(6), 718-732WILSON, M.L., SCHRAEFEL, M.C. and WHITE, R.W., 2009. Evaluating advanced search interfaces using established information-seeking models Journal of the American Society for Information Science and Technology. 60(7), 1407-1422OLEKSIK, G., WILSON, M.L., TASHMAN, C., RODRIGUES, E.M., KAZAI, G., SMYTH, G., MILIC-FRAYLING, N. and JONES, R., 2009. Lightweight tagging expands information and activity management practices In: CHI '09: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 2009, Boston, MA, USA. 279-288 Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 9446,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:44"
}