{
  "name": "Max H. Garzon",
  "homepage": "https://www.memphis.edu/cs/people/faculty_pages/max-garzon.php",
  "status": "success",
  "content": "Max Garzon - Computer Science - The University of Memphis Skip to main content SearchX Safety & Security Prospective Students Current Students Parents & Family Alumni Veterans Faculty & Staff People Take Action Follow Us Online FacebookLinkedIn Home Computer Science People Faculty Pages Max Garzon Max H. Garzon Professor Phone 901.678.3136 Email mgarzon@memphis.edu Fax 901.678.1506 Office Dunn Hall 325 Office Hours Call for hours Degree: PhD, Theoretical Computer Science, University of Illinois, Urbana-Champaign, 1984 Teaching Interests:Data science, biomolecular and distributed computing, human-computer interaction, foundations of computing Research Interests:Biomolecular and distributed computing, data science Google Scholar Dr. Garzon joined the Department of Mathematical Sciences in Fall 1984 after finishing his PhD at the University of Illinois. In his early career, he did research on the complexity of symmetric computational memory structures for sequential computers and separation of sequential complexity classes, mostly with funding with NSF. He was a three-time recipient of the SPUR award for Superior Performance in University Research. Dr. Garzon served as the Director of the UofM's Computer Science Division during its fledgling years, helping to establish its Web presence and early infrastructure. He developed the interdisciplinary MS in eCommerce degree in 2001, later Applied Computer Science, and has coordinated the program since then. He received the College of Arts and Sciences Meritorious Faculty Award in 2002. Dr. Garzon's current research focuses on interactive and computing, particularly in the emerging areas of biomolecular programming, bioinformatics, and data science. In addition to over 180 books, journals, and conference publications in these areas, he has developed or been instrumental in developing software products for complex systems, such as Edna (a virtual test tube), REM (Resource Elicitation Memory for management of small to medium software projects), early versions of Autotutor (an intelligent computer-based tutoring system for instruction in computer literacy and conceptual physics), an online election system for student governments, and a variety of software solutions for local industries and businesses as part of internships and outreach projects.",
  "content_length": 2323,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:43"
}