{
  "name": "Max A. Little",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/little-max.aspx",
  "status": "success",
  "content": "Dr Max A. Little - School of Computer Science - University of Birmingham Dr Max A. Little School of Computer ScienceSenior Lecturer Contact details Emaillittlemz@bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Max Little is a world-leading expert in signal processing and machine learning. His research in machine learning for digital health is highly influential and is the basis of advances in basic and applied research into quantifying neurological disorders such as Parkinson's disease. He has published over 60 articles in the scientific literature on the topic, two patents, and a textbook. He is an advisor to government and leading international corporations in topics such as machine learning for health. Please follow the link below to find out more information about Max's work: Dr Little's personal web page Fellow of the Higher Education Academy D.Phil. (Oxon) in Applied Mathematics, University of Oxford B.Sc. (Honours) in Mathematics, Open University TED Talk Ugur Kayas, The mathematical structure of deep learning (provisional title), University of Birmingham, UK, 2018 – present (primary supervisor) Yazan Qarout, Identifying surprising user behavior from wearable devices (provisional title), Aston University, UK, 2018 – present (co-supervisor) Adam Farooq, Bayesian nonparametrics for high dimensional signals (provisional title), Aston University, UK, 2018 – present (co-supervisor) Anna Beukenhorst, Wearable devices for digital epidemiological study of musculosketal diseases (provisional title), University of Manchester, 2017 – present (co-supervisor) Alex Oldroyd, Title TBA, University of Manchester, 2017 – present (co-supervisor) Katy Weihrich, Identifying patterns of physical activity in musculoskeletal disease (provisional title), University of Manchester, 2017 – present (co-supervisor) Reham Badawy, Detection of pre-clinical Parkinson’s disease using smartphones (provisional title), University of Birmingham, UK, 2014 – present (primary supervisor) Jordan Raykov, A deterministic inference framework for discrete nonparametric latent variable models, Aston University, UK, 2013 – 2017 (primary supervisor) Paul Moore, Mathematical modelling, forecasting and telemonitoring of mood in bipolar disorder, University of Oxford, UK, 2008 – 2014 (primary supervisor) Ben Fulcher, Highly comparative time-series analysis, University of Oxford, UK, 2009 – 2012 (co-supervisor) Athanasios Tsanas, Accurate telemonitoring of Parkinson’s disease symptom severity using nonlinear speech signal processing and statistical machine learning, University of Oxford, UK, 2008 – 2012 (co-supervisor) Causal inference in machine learning, statistical machine learning in signal processing, wearable devices for neurological disorders. National and international steering committees, advisory roles: Parkinson’s UK College of Experts, UK, 2019 (by invitation) Data Science Prize Review Panel, Michael J Fox Foundation for Parkinson’s Research, NY, USA, 2017 Udall Center P20 External Advisory Board Member, Rochester University Medical Center, NY, USA, 2015 – present Nesta Health Lab “NHS in 2030” Report, Nesta, UK, 2015 (advisor) Wearable Technology Research Committee, Michael J Fox Foundation for Parkinson’s Research, NY, USA, 2016 – present National Institute on Aging Alzheimer’s Disease Summit 2015, National Institutes of Health, MD, USA, 2014 – 2015 X-Prize Foundation, CA, USA, 2014 Accelerometry Data Steering Group, UK Biobank, Wellcome Trust, UK, 2014 – present Data Sharing Steering Group, Parkinson’s UK, 2014 – present Dementia Innovation Unit Citizen Science Platform, Department of Health, UK, 2014 Reviewer, national funding bodies: Health Research Council, New Zealand, 2019 MRC, UK, 2018 National Institutes for Health, USA, 2017 Networks of Centers of Excellence, Canada, 2013 EPSRC, UK, 2009 Organization for Scientific Research (NWO), Netherlands, 2014, 2019 National Science Centre, Poland, 2013, 2016, 2017 Czech Science Foundation, 2016 Icelandic Research Fund, Iceland, 2011 Michael J. Fox Foundation for Parkinson’s Research, USA, 2016 – present Parkinson’s UK, 2014 Recent publications Article Evers, LJW, Raykov, YP, Heskes, TM, Krijthe, JH, Bloem, BR & Little, MA 2025, 'Passive Monitoring of Parkinson Tremor in Daily Life: A Prototypical Network Approach', Sensors, vol. 25, no. 2, 366. https://doi.org/10.3390/s25020366 Post, E, Laarhoven, TV, Raykov, YP, Little, MA, Nonnekes, J, Heskes, TM, Bloem, BR & Evers, LJW 2025, 'Quantifying arm swing in Parkinson’s disease: a method accounting for arm activities during free-living gait', Journal of neuroengineering and rehabilitation, vol. 22, no. 1, 22. https://doi.org/10.1186/s12984-025-01578-z Farooq, A, Raykov, YP, Raykov, P & Little, MA 2024, 'Adaptive Latent Feature Sharing for Piecewise Linear Dimensionality Reduction', Journal of Machine Learning Research, vol. 25, no. 135, pp. 1-42. <http://jmlr.org/papers/v25/21-0146.html> Little, MA, He, X & Kayas, U 2024, 'Polymorphic dynamic programming by algebraic shortcut fusion', Formal Aspects of Computing, vol. 36, no. 2, 11. https://doi.org/10.1145/3664828 Little, MA 2022, 'GRAPL: A computational library for nonparametric structural causal modelling, analysis and inference', Journal of Open Source Software, vol. 7, no. 76, 4534. https://doi.org/10.21105/joss.04534 Omberg, L, Chaibub Neto, E, Perumal, TM, Pratap, A, Tediarjo, A, Adams, J, Bloem, BR, Bot, BM, Elson, M, Goldman, SM, Kellen, MR, Kieburtz, K, Klein, A, Little, MA, Schneider, R, Suver, C, Tarolli, C, Tanner, CM, Trister, AD, Wilbanks, J, Dorsey, ER & Mangravite, LM 2022, 'Remote smartphone monitoring of Parkinson's disease and individual response to therapy', Nature Biotechnology, vol. 40, no. 4, pp. 480-487. https://doi.org/10.1038/s41587-021-00974-9 Oldroyd, A, Little, MA, Dixon, W & Chinoy, H 2019, 'A review of accelerometer-derived physical activity in the idiopathic inflammatory myopathies', BMC Rheumatology, vol. 3, 41. https://doi.org/10.1186/s41927-019-0088-1 Beukenhorst, AL, Parkes, MJ, Cook, L, Barnard, R, van der Veer, SN, Little, MA, Howells, K, Sanders, C, Sergeant, JC, O'Neill, TW, McBeth, J & Dixon, WG 2019, 'Collecting symptoms and sensor data with consumer smartwatches (the Knee OsteoArthritis, Linking Activity and Pain Study): protocol for a longitudinal, observational feasibility study', JMIR Research Protocols, vol. 8, no. 1, pp. e10238. https://doi.org/10.2196/10238 Wang, H, Lane, JM, Jones, SE, Dashti, HS, Ollila, HM, Wood, AR, van Hees, VT, Brumpton, B, Winsvold, BS, Kantojärvi, K, Palviainen, T, Cade, BE, Sofer, T, Song, Y, Patel, K, Anderson, SG, Bechtold, DA, Bowden, J, Emsley, R, Kyle, SD, Little, MA, Loudon, AS, Scheer, FAJL, Purcell, SM, Richmond, RC, Spiegelhalder, K, Tyrrell, J, Zhu, X, Hublin, C, Kaprio, JA, Kristiansson, K, Sulkava, S, Paunio, T, Hveem, K, Nielsen, JB, Willer, CJ, Zwart, JA, Strand, LB, Frayling, TM, Ray, D, Lawlor, DA, Rutter, MK, Weedon, MN, Redline, S & Saxena, R 2019, 'Genome-wide association analysis of self-reported daytime sleepiness identifies 42 loci that suggest biological subtypes', Nature Communications, vol. 10, 3503. https://doi.org/10.1038/s41467-019-11456-7 Dashti, HS, Jones, SE, Wood, AR, Lane, JM, Van Hees, VT, Wang, H, Rhodes, JA, Song, Y, Patel, K, Anderson, SG, Beaumont, RN, Bechtold, DA, Bowden, J, Cade, BE, Garaulet, M, Kyle, SD, Little, MA, Loudon, AS, Luik, AI, Scheer, FAJL, Spiegelhalder, K, Tyrrell, J, Gottlieb, DJ, Tiemeier, H, Ray, DW, Purcell, SM, Frayling, TM, Redline, S, Lawlor, DA, Rutter, MK, Weedon, MN & Saxena, R 2019, 'Genome-wide association study identifies genetic loci for self-reported habitual sleep duration supported by accelerometer-derived estimates', Nature Communications, vol. 10, no. 1, 1100. https://doi.org/10.1038/s41467-019-08917-4 Badawy, R, Hameed, F, Bataille, L, Little, MA, Claes, K, Saria, S, Cedarbaum, JM, Stephenson, D, Neville, J, Maetzler, W, Espay, AJ, Bloem, B, Simuni, T & Karlin, DR 2019, 'Metadata concepts for advancing the use of digital health technologies in clinical research', Digital Biomarkers, vol. 3, no. 3, pp. 116-132. https://doi.org/10.1159/000502951 Arora, S, Baig, F, Lo, C, Barber, TR, Lawton, MA, Zhan, A, Rolinski, M, Ruffmann, C, Klein, JC, Rumbold, J, Louvel, A, Zaiwalla, Z, Lennox, G, Quinnell, T, Dennis, G, Wade-martins, R, Ben-shlomo, Y, Little, MA & Hu, MT 2018, 'Smartphone motor testing to distinguish idiopathic REM sleep behavior disorder, controls, and PD', Neurology, vol. 91, no. 16, pp. e1528-e1538. https://doi.org/10.1212/WNL.0000000000006366 Raykov, YP, Boukouvalas, A & Little, MA 2016, 'Simple approximate MAP inference for Dirichlet processes mixtures', Electronic Journal of Statistics, vol. 10, no. 2, pp. 3548-3578. https://doi.org/10.1214/16-EJS1196 Conference contribution Eryilmaz, O, Katar, C & Little, M 2025, Ellipsoidal Filtration for Topological Denoising of Recurrent Signals. in Institute of Electronics, Information and Communication Engineers (IEICE). The 2025 International Symposium on Nonlinear Theory and Its Applications , Okinawa, Japan, 27/10/25. Poster Eryilmaz, O, Katar, C & Little, M 2025, 'Ellipsoidal Filtration for Topological Denoising of Quasi-Periodic Signals', Dynamics Days Europe 2025, Thessaloniki, Greece, 23/06/25 - 27/06/25. View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 9540,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:43"
}