{
  "name": "Max Garagnani",
  "homepage": "https://www.gold.ac.uk/computing/people/garagnani-max",
  "status": "success",
  "content": "Dr Max Garagnani | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Senior Lecturer in Computer Science Department Computing Email M.Garagnani (@gold.ac.uk) Links Websiteen.wikipedia.org/wiki/Max_Garagnani Google scholar LinkedInlinkedin.com/in/max-garagnani-phd-phd-6932011 Research gate Academia.edu Lab/researchgeisteswissenschaften.fu-berlin.de/v/brainlang/Team/MGaragnani.html Websiteloop.frontiersin.org/people/3125/overview Max uses computer modelling and simulations to explore how we learn to speak and how the mind works. Max is a Senior Lecturer in Computer Science and co-director of the MSc in Computational Cognitive Neuroscience programme. He holds a PhD in Computational Cognitive Neuroscience from the University of Cambridge, UK (2009) and a PhD in Artificial Intelligence from the University of Durham (1999). Max's research focuses on building and applying biologically realistic, deep neural networks (mimicking structural and functional features of the cortex) to study the spontaneous emergence of cognitive functions, with a particular focus on natural language processing and acquisition, and spontaneous decisions. His previous posts include Postdoctoral Researcher at the Centre for Robotics & Neural Systems (University of Plymouth), Investigator Scientist at MRC Cognition & Brain Sciences Unit (Cambridge, UK), and Visiting Scholar at the International Computer Science Institute (Berkeley, CA). He is also visiting researcher at the Brain Language Lab of the Free University of Berlin (Germany). Academic qualifications PhD in Computational Cognitive Neuroscience 2009 PhD in Artificial Intelligence 1999 PG Certificate in Teaching and Learning in Higher Education 2023 Laurea (BSc + MSc) in Computer Science 1994 Teaching and supervision I supervise projects in my areas of interest (see \"Research Interests\" below). I teach on the following programmes: MSc Computational Cognitive Neuroscience BSc Computer Science (Integrated Degree) Foundation Year in Computing Research interests My research centres on building and applying biologically realistic neural networks. Specifically, I model the neural mechanisms underlying the emergence of cognitive functions (in particular, language acquisition and processing, spontaneous decision making) in the brain. I simulate the emergence of such higher-level functions starting from an initially randomly connected uniform neural substrate, and by means of unsupervised learning mechanisms closely mimicking synaptic plasticity processes known to exist in the cortex. In parallel to the computational modelling, I also collaborate with experimentalists to apply brain imaging and behavioural methods to test and validate the predictions emerging from the computational models. Unlike most of the modelling work in this area, the neural architecture I have developed over the past two decades adopts a \"first principles\" approach, i.e., it is not designed to explain a specific dataset or cognitive function. In fact, while it was originally applied mainly to simulate spoken language acquisition processes, its generality later allowed its successful application to explain the emergence of (and the mechanisms underlying) a range of other cognitive phenomena. These include, prediction error and automatic change-detection responses, attention, the emergence of memory cells and working memory processes, the recruitment of visual cortex in blind individuals, and the emergence of spontaneous (or \"free\") decisions to act (see list of publications below). I have worked closely and for several years with the Brain Language Lab at the Freie Universität Berlin (Germany), directed by Prof. Friedemann Pulvermüller, and was co-PI and staff member of the jointly EPSRC/BBSRC-funded interdisciplinary project BABEL, which investigated the neural mechanisms underlying embodied word learning by joint use of neuroimaging, brain-inspired modelling, neuromorphic engineering and real-time implementation on the humanoid robot iCub. Featured publications 2023: Influence of language on perception and concept formation in a brain-constrained deep neural network model. Philosophical Transactions of the Royal Society B, 378: 20210373. 2023: Breakdown of category-specific word representations in a brain-constrained neurocomputational model of semantic dementia. Scientific Reports 13:19572. 2017: Neurocomputational Consequences of Evolutionary Connectivity Changes in Perisylvian Language Cortex The Journal of Neuroscience, 37(11), pp. 3045-3055 2016: Conceptual grounding of language in action and perception: a neurocomputational model of the emergence of category specificity and semantic hubs. European Journal of Neuroscience, 43(6), pp. 721-737. 2014: Thinking in circuits: toward neurobiological explanation in cognitive neuroscience. Biological Cybernetics, 108(5), pp. 573-593. Publications and research outputs Book SectionPerception-action circuits for word learning and semantic grounding: a neurocomputational model and neuroimaging study Garagnani, M. ; Kirilina, E.; and Pulvermüller, F.. 2020. Perception-action circuits for word learning and semantic grounding: a neurocomputational model and neuroimaging study. In: Maria Raposo; Paulo Ribeiro; Susanna Sério; Antonino Staiano and Angelo Ciaramella, eds. Computational Intelligence Methods for Bioinformatics and Biostatistics: 15th International Meeting, CIBB 2018, Caparica, Portugal, September 6–8, 2018, Revised Selected Papers. Cham, Switzerland: Springer International Publishing. ISBN 9783030345846 A Diagrammatic Inter-Lingua for Planning Domain Descriptions Garagnani, M. ORCID logo . 2005. A Diagrammatic Inter-Lingua for Planning Domain Descriptions. In: Luis Castillo; Daniel Borrajo; Miguel A. Salido and Angelo Oddi, eds. Planning, Scheduling and Constraint Satisfaction: From Theory to Practice. 117 Amsterdam: IOS Press, pp. 129-138. ISBN 9781586034849 A Framework for Hybrid and Analogical Planning Garagnani, M. ORCID logo . 2005. A Framework for Hybrid and Analogical Planning. In: Ioannis Vlahavas and Dimitris Vrakas, eds. Intelligent Techniques for Planning. Hershey, Pennsylvania: Idea Group Publishing, pp. 35-89. ISBN 9781591404507 Show more information A Framework for Hybrid Planning Garagnani, M. . 2005. A Framework for Hybrid Planning. In: Max Bramer; Frans Coenen and Tony Allen, eds. Research and Development in Intelligent Systems XXI: Proceedings of AI-2004, the Twenty-fourth SGAI International Conference on Innovative Techniques and Applications of Artificial Intelligence. London: Springer, pp. 214-227. ISBN 9781852339074 Model-based Planning in Physical domains using SetGraphs Garagnani, M. . 2004. Model-based Planning in Physical domains using SetGraphs. In: Frans Coenen; Alun Preece and Ann L. Macintosh, eds. Research and Development in Intelligent Systems XX: Proceedings of AI2003, the Twenty-third SGAI International Conference on Innovative Techniques and Applications of Artificial Intelligence. London: Springer, pp. 295-308. ISBN 9781852337803 A Correct Algorithm for Efficient Planning with Preprocessed Domain Axioms Garagnani, M. ORCID logo . 2001. A Correct Algorithm for Efficient Planning with Preprocessed Domain Axioms. In: Max Bramer; Alun Preece and Frans Coenen, eds. Research and Development in Intelligent Systems XVII: Proceedings of ES2000, the Twentieth SGES International Conference on Knowledge Based Systems and Applied Artificial Intelligence, Cambridge, December 2000. London: Springer, pp. 363-374. ISBN 9781852334031 Persuasion as a form of inter-agent negotiation Reed, C.; Long, D.; Fox, M.; and Garagnani, M. . 1997. Persuasion as a form of inter-agent negotiation. In: Chengqi Zhang and Dickson Lukose, eds. Multi-Agent Systems Methodologies and Applications: Second Australian Workshop on Distributed Artificial Intelligence Cairns, QLD, Australia, August 27, 1996 Selected Papers. Berlin: Springer, pp. 120-136. ISBN 9783540634126 ArticleOn the ability of standard and brain-constrained deep neural networks to support cognitive superposition: a position paper Garagnani, M. ORCID logo . 2024. On the ability of standard and brain-constrained deep neural networks to support cognitive superposition: a position paper. Cognitive Neurodynamics, 18, pp. 3383-3400. ISSN 1871-4080 Distributed representations of prediction error signals across the cortical hierarchy are synergistic Gelens, Frank; Aijala, Julio; Roberts, Louis; Komatsu, Misako; Uran, Cem; Jensen, Michael A.; Miller, Kai J.; Ince, Robin A.A.; Garagnani, M. ORCID logo ; Vinck, Martin; and +1 more...Canales-Johnson, Andres. 2024. Distributed representations of prediction error signals across the cortical hierarchy are synergistic. Nature Communications, 15, 3941. ISSN 2041-1723 Breakdown of category-specific word representations in a brain-constrained neurocomputational model of semantic dementia Shtyrov, Y.; Efremov, A.; Kuptsova, A.; Wennekers, T.; Gutkin, B.; and Garagnani, M. . 2023. Breakdown of category-specific word representations in a brain-constrained neurocomputational model of semantic dementia. Scientific Reports, 13, 19572. ISSN 2045-2322 Show more information Influence of language on perception and concept formation in a brain-constrained deep neural network model Henningsen-Schomers, Malte R.; Garagnani, M. ; and Pulvermüller, Friedemann. 2023. Influence of language on perception and concept formation in a brain-constrained deep neural network model. Philosophical Transactions of the Royal Society B: Biological Sciences, 378(1870), 20210373. ISSN 0962-8436 Semantic grounding of novel spoken words in the primary visual cortex Garagnani, M. ORCID logo ; Kirilina, E.; and Pulvermüller, F. 2021. Semantic grounding of novel spoken words in the primary visual cortex. Frontiers in Human Neuroscience, 15, 581847. ISSN 1662-5161 Visual cortex recruitment during language processing in blind individuals is explained by Hebbian learni",
  "content_length": 24391,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:45"
}