{
  "name": "Maximilian Eibl",
  "homepage": "https://www.tu-chemnitz.de/informatik/Medieninformatik",
  "status": "success",
  "content": "Professur Medieninformatik | Fakultät für Informatik | TU Chemnitz Professur Medieninformatik | Fakultät für Informatik | TU Chemnitz Professur Medieninformatik Prof. Dr. Maximilian Eibl Sekretariat E-Mail: mi@informatik.tu-chemnitz.de Tel: 0371/531-25780 Fax: 0371/531-25719 Raum 1/188B (neu: A10.188.2) Öffnungszeiten: Mo-Do 12:30-15:30 Besucheradresse Technische Universität Chemnitz Professur Medieninformatik Straße der Nationen 62 09111 Chemnitz Lage bei Google Maps anzeigen Postadresse Technische Universität Chemnitz Professur Medieninformatik 09107 Chemnitz Veranstaltungshinweise 578310 Methodenseminar Informatik für Geistes- und Sozialwissenschaftler Die Veranstaltung beginnt am 13.10.2025 in Raum A10.368.1. Melden Sie sich bitte über die Kursseite an. Zur Kursseite 578090 Mensch-Computer-Interaktion I Die Veranstaltung beginnt am 17.10.2025 in Raum A10.201. Melden Sie sich bitte über die Kursseite an. Zur Kursseite 578170 Medienretrieval Die Veranstaltung beginnt am 14.10.2025 in Raum A10.204. Melden Sie sich bitte über die Kursseite an. Zur Kursseite 578330 Medientechnik / 578190 Medientools Die Veranstaltung findet online statt. Melden Sie sich bitte über die Kursseite an. Zur Kursseite 500270 Hauptseminar Medieninformatik (für Bachelorstudiengänge) Die Veranstaltung beginnt am 22.10.2025 in Raum A10.208.1. Melden Sie sich bitte über die Kursseite an. Zur Kursseite 500070/500090/578210 Haupt-/Forschungsseminar Medieninformatik (Master) Das Seminar beginnt am 16.10.2025 in Raum A11.006 (1/B006). Melden Sie sich bitte über die Kursseite an. Zur Kursseite 500290/500170/522010 Teamorientiertes Praktikum/Forschungspraktikum Praktika werden semesterübergreifend durchgeführt. Melden Sie sich bitte bei Dr. Thomas Wilhelm-Stein oder einem anderen Mitarbeiter der Professur. Vorschaltseite",
  "content_length": 1817,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:51"
}