{
  "name": "Maxim V. Rakhuba",
  "homepage": "https://www.hse.ru/en/org/persons/407666970",
  "status": "success",
  "content": "Staff - Maxim Rakhuba – HSE University В старых версиях браузеров сайт может отображаться некорректно. Для оптимальной работы с сайтом рекомендуем воспользоваться современным браузером.AAAABCABCABCАААААRegular version of the siteCampus in MoscowNizhny NovgorodSaint PetersburgPermRUENFor visually-impairedFor visually-impairedUser profile (HSE staff only)SearchSearchAdvanced searchMenuHSE UniversityHSE UniversityAbout HSEFaculty and StaffMaxim RakhubaRUENUser profile (HSE staff only)SearchAdvanced search  HomeTeachingResearch and PublicationsIn HSE news Language ProficiencyRussianEnglishContactsPhone:15707Address: 11 Pokrovsky Bulvar, Pokrovka Complex, room T918TimetableSPIN-RSCI: 8816-5681ORCID: 0000-0001-7606-7322ResearcherID: Q-6210-2016Scopus AuthorID: 55631908800Google ScholarSupervisorsN. VereshchaginE. SokolovPrintable versionwith publicationswith newsPrintHave you spotted a typo?Highlight it, click Ctrl+Enter and send us a message. Thank you for your help!To be used only for spelling or punctuation mistakes.Maxim RakhubaLaboratory Head: Faculty of Computer Science / AI and Digital Science Institute / Laboratory for Matrix and Tensor Methods in Machine LearningDeputy Department Head, Associate Professor: Faculty of Computer Science / Big Data and Information Retrieval School / Joint Department with the Marchuk Institute of Numerical Mathematics of the Russian Academy of Sciences (INM RAS)Programme Scientific Supervisor: Applied Mathematics and Information ScienceMaxim Rakhuba has been at HSE University since 2020.  HomeTeachingResearch and PublicationsIn HSE newsEducation and Degrees2017Candidate of Sciences* (PhD)2014Master'sMoscow Institute of Physics and Technology2012Bachelor'sMoscow Institute of Physics and Technology* Candidate of SciencesAccording to the International Standard Classification of Education (ISCED) 2011, Candidate of Sciences belongs to ISCED level 8 - \"doctoral or equivalent\", together with PhD, DPhil, D.Lit, D.Sc, LL.D, Doctorate or similar. Candidate of Sciences allows its holders to reach the level of the Associate Professor.Continuing education / Professional retraining / Internships / Study abroad experiencePostdoc at ETH Zurich, 2018-2020 Professional Interestsartificial intelligencetensor methodsmatrix analysisdeep learningnumerical mathematicsAwards and Accomplishments Best Teacher — 2021–2025Young Faculty Support Programme (Group of Young Academic Professionals)Category \"New Lecturers\" (2021–2022)Courses (2025/2026)Foundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)RusFoundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)RusFundamentals of Matrix Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 2 year, 3, 4 module)RusFundamentals of Matrix Computations (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 3, 4 module)RusFundamentals of Matrix Computations (Mago-Lego; Faculty of Computer Science; 3, 4 module)RusPast CoursesCourses (2024/2025)Foundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)RusFoundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)RusFoundations of Tensor Computations (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 2 year, 1, 2 module)RusFoundations of Tensor Computations (Mago-Lego; 1, 2 module)RusFundamentals of Matrix Computations (Bachelor’s programme; Faculty of Economic Sciences field of study Applied Mathematics and Information Science, Economics; 2 year, 3, 4 module)RusFundamentals of Matrix Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 2 year, 3, 4 module)RusFundamentals of Matrix Computations (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 3, 4 module)RusFundamentals of Matrix Computations (Mago-Lego; 3, 4 module)RusCourses (2023/2024)Foundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)RusFoundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)RusFundamentals of Matrix Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 2 year, 3, 4 module)RusFundamentals of Matrix Computations (Mago-Lego; 3, 4 module)RusFundamentals of Matrix Computations (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 3, 4 module)RusFundamentals of Matrix Computations (Bachelor’s programme; Faculty of Economic Sciences field of study Applied Mathematics and Information Science; 2 year, 3, 4 module)RusCourses (2022/2023)Foundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)RusFoundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)RusFundamentals of Matrix Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 2 year, 3, 4 module)RusFundamentals of Matrix Computations (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 3, 4 module)RusCourses (2021/2022)Foundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)RusFoundations of Tensor Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)RusFundamentals of Matrix Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 2 year, 3, 4 module)RusCourses (2020/2021)Fundamentals of Matrix Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 2 year, 3, 4 module)RusMatriх Computations (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)RusTimetable for todayFull timetableGrants2021 - present: PI for the grant 21-71-00119 (Russian Science Foundation), “Adaptive tensor methods for partial differential equations”. 2016 - 2017: PI for the grant 16-31-00372 (Russian Fund for Basic Research), “Fast tensor approach to electronic structure calculation”. 25Nov2025HSE Lecturers Awarded Yandex ML Prize 2025The Yandex ML Prize is awarded to lecturers and heads of educational programmes who contribute to the development of artificial intelligence in Russia. This year, 10 laureates were selected from 300 applicants, including three members of the HSE Faculty of Computer Science (FCS). A special Hall of Fame award was also presented for contributions to the establishment of machine learning as an academic field. One of the recipients was Dmitry Vetrov, Research Professor at the HSE FCS. 24Nov2025Technological Breakthrough: Research by AI and Digital Science Institute Recognised at AI Journey 2025Researchers from the AI and Digital Science Institute (part of the HSE Faculty of Computer Science) presented cutting-edge AI studies, noted for their scientific novelty and practical relevance, at the AI Journey 2025 International Conference. A research project by Maxim Rakhuba, Head of the Laboratory for Matrix and Tensor Methods in Machine Learning, received the AI Leaders 2025 award. Aibek Alanov, Head of the Centre of Deep Learning and Bayesian Methods, was among the finalists. 15Sep2025Global AI Trends Discussed at International Foresight Workshop at HSE UniversityAt an international foresight workshop on artificial intelligence held at HSE University, Russian and foreign scholars discussed the trends and challenges arising from the rapid development of AI. 3Jul2025Recommender Systems: New Algorithms and Current PracticesThe AI and Digital Science Institute at the HSE Faculty of Computer Science hosted a conference focused on cutting-edge recommender system technologies. In an atmosphere of active knowledge sharing among leading industry experts, participants were introduced to the latest advancements and practical solutions in recommender model development. 9Jan2025New Joint Department with RAS Marchuk Institute of Numerical Mathematics Opens at HSE UniversityA new joint department with the Marchuk Institute of Numerical Mathematics (INM RAS) has been established at the HSE Faculty of Computer Science. This collaboration promises to combine the scientific and educational resources of two leading research centres, enabling the training of highly qualified specialists. The department is headed by Dr Andrey Bogatyrev, a professor and Doctor of Physics and Mathematics. 11Jan2024The Secret to Success: How Recommender Systems Are Changing IndustryA scientific conference dedicated to the young and actively developing field of recommender systems was held at HSE University. Representatives of the scientific community and industry gathered at the site to exchange cutting-edge ideas and best practices, as well as discuss opportunities to implement new technologies in real-life business scenarios. 27Sep2023N",
  "content_length": 12349,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:48"
}