{
  "name": "Maximus Van Kleek",
  "homepage": "http://www.cs.ox.ac.uk/people/max.vankleek",
  "status": "success",
  "content": "Max Van Kleek | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyMax Van KleekMax Van Kleek Professor Max Van Kleek Associate Professor of Computer ScienceGoverning Body Fellow, Kellogg CollegeE: emax@cs.ox.ac.ukE: emax@alum.mit.eduE: max@hip.catWolfson Building, Parks Road, Oxford OX1 3QD Themes:Human Centred ComputingCompleted Projects:SOCIAMReTiPSFoSH - Future of Smart HomesInterestsTopics: Personal Information Management, Long-term Data Management, Data-driven Personalised Medicine. Fields: Human-Computer Interaction, Artificial Intelligence, Distributed and Decentralised Systems, Neuroeconomics, Behavioural Psychology.BiographyMax Van Kleek is Associate Professor of Human-Computer Interaction with the Department of Computer Science, at the University of Oxford.  He works in the Software Engineering Programme, to deliver course material related to interaction design, the design of secure systems, and usability.  He also leads (as Co-Investigator) the EPSRC PETRAS project: ReTIPS, or Respectful Things in Private Spaces.  Until 2017, he was interaction research theme in the EPSRC Project SOCIAM, and leads several SOCIAM projects at the intersection of personal and social data systems and architectures.  His current project is designing new Web-architectures to help people re-gain control of information held about them \"in the cloud\", from fitness to medical records.  He received his Ph.D. from MIT CSAIL in 2011.See alsoPersonal Home PageGoogle Scholar PageSelected PublicationsView AllManage publications Trouble in Paradise? Understanding Mastodon Admin's Motivations‚ Experiences‚ and Challenges Running Decentralised Social Media Zhilin Zhang‚ Jun Zhao‚ Ge Wang‚ Samantha−Kaye Johnston‚ George Chalhoub‚ Tala Ross‚ Diyi Liu‚ Claudine Tinsman‚ Rui Zhao‚ Max Van Kleek and Nigel Shadbolt In 27th ACM Conference on Computer−Supported Cooperative Work and Social Computing (CSCW 2024). 2024. Details about Trouble in Paradise? Understanding Mastodon Admin's Motivations‚ Experiences‚ and Challenges Running Decentralised Social Media | BibTeX data for Trouble in Paradise? Understanding Mastodon Admin's Motivations‚ Experiences‚ and Challenges Running Decentralised Social Media | Download (pdf) of Trouble in Paradise? Understanding Mastodon Admin's Motivations‚ Experiences‚ and Challenges Running Decentralised Social Media | DOI (10.1145/3687059) \"You are you and the app. There’s nobody else.\": Building Worker−Designed Data Institutions within Platform Hegemony Jake Stein‚ Vidminas Vizgirda‚ Max Van Kleek‚ Reuben Binns‚ Jun Zhao‚ Rui Zhao‚ Naman Goel‚ George Chalhoub‚ Wael Albayaydh and Nigel Shadbolt. In 2023 CHI Conference on Human Factors in Computing Systems (CHI 2023). April, 2023. Details about \"You are you and the app. There’s nobody else.\": Building Worker−Designed Data Institutions within Platform Hegemony | BibTeX data for \"You are you and the app. There’s nobody else.\": Building Worker−Designed Data Institutions within Platform Hegemony | Download (pdf) of \"You are you and the app. There’s nobody else.\": Building Worker−Designed Data Institutions within Platform Hegemony | DOI (10.1145/3544548.3581114) I Want My App That Way: Reclaiming Sovereignty Over Personal Devices Konrad Kollnig‚ Siddhartha Datta and Max Van Kleek Pages 8. 2021. Details about I Want My App That Way: Reclaiming Sovereignty Over Personal Devices | BibTeX data for I Want My App That Way: Reclaiming Sovereignty Over Personal Devices | DOI (10.1145/3411763.3451632) | Download (pdf) of I Want My App That Way: Reclaiming Sovereignty Over Personal Devices ActivitiesSoftware EngineeringProjectsEWADA Current Students Sarah  AldaweeshBotao 'Amber' HuNimisha Karnatak (The World Bank in Washington, D.C., USA and Google DeepMind, London) Christina LuAbraham NashHayoun  NohTala  RossJake SteinSruthi  Viswanathan Past Students Lize Alberts (Stellenbosch University) Anirudh  EkambaranathanJack JacksonWilliam SeymourClaudine TinsmanThomas Serban von DavierAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 4281,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:50"
}