{
  "name": "Maxime Lamothe",
  "homepage": "https://www.polymtl.ca/expertises/en/lamothe-maxime",
  "status": "success",
  "content": "Lamothe, Maxime | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Lamothe, Maxime Poly Directory Courses Français Directory of Experts Lamothe, Maxime Directory of Experts Back to search results Edit my profileHelp Publications Link(s) Maxime Lamothe Ph.D. (Concordia), M.Eng. (Concordia), B.Eng. (McGill) Publications Link(s) Assistant Professor Department of Computer Engineering and Software Engineering Phone: Ext. 7140 Fax: (514) 340-5139 Room: M-4115 maxime.lamothe@polymtl.ca Areas of expertise Logic programming Other computing methods Information systems design Software engineering Computer systems software Software and development Primary sphere of excellence in research New Frontiers in Information and Communication Technologies Secondary sphere(s) of excellence in research Modeling and Artificial Intelligence Industry of the Future and Digital Society Research interests and affiliations Research interests Empirical software engineering Mining software repositories Software APIs Software build systems Software performance Software bug-detection Expertise type(s) (NSERC subjects) 2705 Software and development 2706 Software engineering Publications Recent publications Dataset Qin, Q., Li, H., Merlo, E., & Lamothe, M. (2025). Automated, Unsupervised, and Auto-parameterized Inference of Data Patterns and Anomaly Detection [Dataset]. Conference paper Qin, Q., Li, H., Merlo, E., & Lamothe, M. (2025, April). Automated, Unsupervised, and Auto-Parameterized Inference of Data Patterns and Anomaly Detection [Paper]. 47th International Conference on Software Engineering (ICSE 2025), Ottawa, ON, Canada. Conference paper Ekhlasi, M., Prakash, A., Lamothe, M., & Dagenais, M. (2025, April). InsightAI: Root Cause Analysis in Large Log Files with Private Data Using Large Language Model [Paper]. 4th International Conference on AI Engineering – Software Engineering for AI (CAIN 2025), Ottawa, ON, Canada. Conference paper Kazemi, F., Lamothe, M., & McIntosh, S. (2025, September). Interrogative Comments Posed by Review Comment Generators: An Empirical Study of Gerrit [Paper]. International Symposium on Empirical Software Engineering and Measurement (ESEM 2025), Honolulu, HI, USA (12 pages). See all publications (30) Biography Maxime Lamothe is an assistant professor at Polytechnique Montreal and is currently looking for master’s and Ph.D. students. Maxime studied software build systems as a postdoctoral researcher in the Software REBELs Lab at the University of Waterloo. His doctoral thesis, conducted in the SENSE Lab at Concordia University, focused on reducing knowledge gaps between the users and developers of software APIs. He obtained his Ph.D. from Concordia University (2020), M. Eng. degree from Concordia University (2017), and B. Eng. from McGill University (2013). Teaching LOG3430 - Méthodes de test et de validation du logiciel LOG6305 - Techniques avancées de test du logiciel Supervision at Polytechnique COMPLETED Ph.D. Thesis (2) Darche, S. (2025). Profiling and Tracing Tools for General-Purpose Computing on Graphics Processing Units (GPGPU) [Ph.D. thesis, Polytechnique Montréal]. Ekhlasi, M. (2025). Diagnostic automatisé des performances dans les systèmes distribués à l'aide de traces, de métriques système et de modèles de langage de grande taille [Ph.D. thesis, Polytechnique Montréal]. Master's Thesis (3) Nouriinanloo, B. (2024). Improving Information Retrieval and Recommender Systems with Contextual Data and Re-Ranking [Master's thesis, Polytechnique Montréal]. Bouziane, A. (2023). On-Demand Health Data Provisioning with Custom Temporary Data Views for Big Data Platforms [Master's thesis, Polytechnique Montréal]. Ghadesi, A. (2023). An Empirical Study of the Causes and Symptoms of Machine Learning Exceptions [Master's thesis, Polytechnique Montréal]. Propective StudentStudent ZoneEmployee ZoneMediaFondation & AlumniEmergencyJobs Offers Studies Studies (Registrar)Programs of StudiesSchedule and Courses DirectoryLibraryDepartmentsFinancial Assistance & Bursaries*Technical Societies*Internships & JobsOffice of Student Affairs*Go-Poly Research General Informations*Directory of ExpertsChairs, Groups & LaboratoriesResearch Projects for Graduate Students Company Hiring an Intern or a GraduateAcquiring a TechnologyConducting Partnered Research*Accessing our Research Infrastructure#Develop your Employees About Us General InformationsOfficial DocumentsInternationalWomen & EngineeringSustainable Development*Propolys (Entrepreneuship Support)*GouvernanceDirectories & ServicesPrivacy Notice and Terms of useAccessibilityContact Information & Campus Maps 2500, chemin de Polytechnique Montréal (Québec) H3T 1J4 (514) 340-4711 Follow us! Make a donation",
  "content_length": 5342,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:50"
}