{
  "name": "Maxim A. Babenko",
  "homepage": "https://www.hse.ru/org/persons/7103512",
  "status": "success",
  "content": "Сотрудники - Бабенко Максим Александрович – Национальный исследовательский университет «Высшая школа экономики» В старых версиях браузеров сайт может отображаться некорректно. Для оптимальной работы с сайтом рекомендуем воспользоваться современным браузером.AAAАБBАБBАБBАААААОбычная версия сайтаКампус в МосквеСанкт-ПетербургНижний НовгородПермьВышка ОнлайнRUENВерсия для слабовидящихВерсия для слабовидящихЛичный кабинет сотрудника ВШЭПоискПоискРасширенный поискМенюВысшая школа экономикиНациональный исследовательский университет «Высшая школа экономики»О ВышкеПреподаватели и сотрудникиБабенко Максим АлександровичRUENЛичный кабинет сотрудника ВШЭНайтиРасширенный поиск по сайту  Домашняя страницаПреподаваниеПубликации и исследованияОпыт работыВ новостях Владение языкамианглийскийКонтактыТелефон:27269Адрес: АУК \"Покровский бульвар\", Покровский б-р, д. 11, каб. S829Время работы: По расписанию занятийРасписаниеSPIN РИНЦ: 7781-4816ORCID: 0000-0003-2877-9725ResearcherID: L-6043-2015Scopus AuthorID: 36928337300Google ScholarРуководительСоколов Е. А.Версия для печатис публикациямис новостямиРаспечататьНашли опечатку?Выделите её, нажмите Ctrl+Enter и отправьте нам уведомление. Спасибо за участие!Сервис предназначен только для отправки сообщений об орфографических и пунктуационных ошибках.Бабенко Максим Александровичзаведующий кафедрой, Доцент: Факультет компьютерных наук / Департамент больших данных и информационного поиска / Базовая кафедра Яндекс Начал работать в НИУ ВШЭ в 2009 году.Научно-педагогический стаж: 19 лет.  Домашняя страницаПреподаваниеПубликации и исследованияОпыт работыВ новостяхOбразование и учёные степени2007Кандидат физико-математических наук: специальность 01.01.06 «Математическая логика, алгебра и теория чисел», тема диссертации: Сложность некоторых алгоритмических проблем для кососимметрических графов2004Специалитет: Московский государственный университет им. М.В. Ломоносова, специальность «Математика, прикладная математика», квалификация «Математик»Профессиональные интересыкомбинаторная оптимизациястроковые алгоритмыприкладные задачи программирования Комбинаторная оптимизация Строковые алгоритмы Прикладные задачи программирования Достижения и поощрения Надбавка за статью в зарубежном рецензируемом научном издании (2016–2018)Группа высокого профессионального потенциала (кадровый резерв НИУ ВШЭ)Категория \"Будущие профессора\" (2015)Учебные курсы (2025/2026 уч. год)Алгоритмы и структуры данных 1 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русАлгоритмы и структуры данных 1 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русАлгоритмы и структуры данных 1 (Маго-лего; где читается: Факультет компьютерных наук; 1, 2 модуль)русАлгоритмы и структуры данных 2 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 3, 4 модуль)русАлгоритмы и структуры данных 2 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 3, 4 модуль)русАлгоритмы и структуры данных 2 (Маго-лего; где читается: Факультет компьютерных наук; 3, 4 модуль)русАрхив учебных курсовУчебные курсы (2024/2025 уч. год)Алгоритмы во внешней памяти (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русАлгоритмы во внешней памяти (Маго-лего; 1, 2 модуль)русАлгоритмы и структуры данных 1 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русАлгоритмы и структуры данных 1 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русАлгоритмы и структуры данных 1 (Маго-лего; 1, 2 модуль)русАлгоритмы и структуры данных 2 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 3, 4 модуль)русАлгоритмы и структуры данных 2 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 3, 4 модуль)русАлгоритмы и структуры данных 2 (Маго-лего; 3, 4 модуль)русУчебные курсы (2023/2024 уч. год)Алгоритмы и структуры данных 1 (Маго-лего; 1, 2 модуль)русАлгоритмы и структуры данных 1 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика, направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русАлгоритмы и структуры данных 2 (Маго-лего; 3, 4 модуль)русАлгоритмы и структуры данных 2 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика, направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 3, 4 модуль)русУчебные курсы (2022/2023 уч. год)Алгоритмы и структуры данных 1 (Маго-лего; 1, 2 модуль)русАлгоритмы и структуры данных 1 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика, направление: 01.04.02. Прикладная математика и информатика, направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русАлгоритмы и структуры данных 2 (Маго-лего; 3, 4 модуль)русАлгоритмы и структуры данных 2 (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика, направление: 01.04.02. Прикладная математика и информатика, направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 3, 4 модуль)русУчебные курсы (2021/2022 уч. год)Алгоритмы и структуры данных (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика, направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русУчебные курсы (2020/2021 уч. год)Алгоритмы и структуры данных (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика, направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1, 2 модуль)русРасписание занятий на сегодняРасписание занятий по физической культуре в спортивных секцияхПолное расписаниеКонференции и другие научные мероприятия Computer Science in Russia (2006) Computer Science in Russia (2007) Computer Science in Russia (2008) The 19th International Symposium on Algorithms and Computation (2008) Workshop on Experimental Algorithms (2007) European Symposium on Algorithms (2008) Опыт работыапреля 2008 - настоящее время, Яндекс январь 2009 - настоящее время, НИУ ВШЭ 11авг.2015CSR 201513-17 июля прошла 10-я международная конференция CSR 2015 – Computer Science in Russia. Эта крупнейшая в России конференция по теоретической информатике была организована при поддержке Иркутского государственного университета, НИУ ВШЭ и компании «Яндекс». В качестве приглашенного докладчика в конференции принял участие доцент Владимир Подольский. Также с докладом выступил доцент Максим Бабенко.Национальный исследовательский университет «Высшая школа экономики» → О Вышке → Преподаватели и сотрудники → Бабенко Максим АлександровичО ВЫШКЕЦифры и фактыРуководство и структураУстойчивое развитие в НИУ ВШЭПреподаватели и сотрудникиКорпуса и общежитияЗакупкиОбращения граждан в НИУ ВШЭФонд целевого капиталаПротиводействие коррупцииСведения о доходах, расходах, об имуществе и обязательствах имущественного характераСведения об образовательной организацииЛюдям с ограниченными возможностями здоровьяЕдиная платежная страницаРабота в ВышкеОБРАЗОВАНИЕЛицейДовузовская подготовкаОлимпиадыПрием в бакалавриатВышка+Прием в магистратуруАспирантураДополнительное образованиеЦентр развития карьерыБизнес-инкубатор ВШЭОбразовательные партнерстваОбратная связь и взаимодействие с получателями услугНАУКАНаучные подразделенияИсследовательские проектыМониторингиДиссертационные советыЗащиты диссертацийАкадемическое развитиеКонкурсы и грантыВнешние научно-информационные ресурсыРЕСУРСЫБиблиотекаИздательский дом ВШЭКнижный магазин «БукВышка»ТипографияМедиацентрЖурналы ВШЭПубликацииПолезные ссылкиМинистерство науки и высшего образования РФМинистерство просвещения РФФедеральный портал «Российское образование»Массовые открытые онлайн-курсыРедактору©  НИУ ВШЭ 1993–2025 Адреса и контакты Условия использования материалов Политика конфиденциальности Карта сайтаШрифты HSE Sans и HSE Slab разработаны в Школе дизайна НИУ ВШЭ",
  "content_length": 8583,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:48"
}