{
  "name": "Mayank Varia",
  "homepage": "https://www.bu.edu/cds-faculty/profile/mayank-varia",
  "status": "success",
  "content": "Mayank Varia | Faculty of Computing & Data Sciences Mayank VariaAssociate Professor of Computing & Data Sciences Director of PhD Admissions and of the Hub for Civic Tech Impact Title Associate Professor of Computing & Data Sciences Director of PhD Admissions and of the Hub for Civic Tech ImpactOffice CDS 1343Email varia@bu.eduWebsite View WebsiteEducation PhD, MITRoles, Faculty & AppointmentFacultyFaculty DirectorFaculty Leadership Mayank Varia is an Associate Professor in the Faculty of Computing & Data Sciences at Boston University. He also serves as the Director of Admissions for the PhD program in CDS and leads the Hub for Civic Tech research, which is focusing on advancing computing and data science technologies in the public interest. His research explores the computational and social aspects of cryptography, and his work has been featured in media outlets like CNET, The Hill, and ZDNet. His designs for accessible, equitable, and socially-responsible data analysis have been used to determine the gender wage gap, subcontracting to minority-owned businesses, and repeat offenders of sexual assault inspired by the #MeToo movement. He serves on the United States Advisory Committee on Data for Evidence Building and the United Nations Privacy-Preserving Techniques Task Team to promote the use of cryptographically protected data analysis and shape the laws and policies surrounding its use. He received a PhD in mathematics from MIT in 2010. Research Interests Cryptography and its applications to Privacy-Respecting Data Science Google Scholar Read More Personal Website View all profiles More about Faculty of Computing & Data Sciences Computing + Data Science In Your Inbox We’ll keep you updated on the latest news and events happening at Computing & Data Sciences. Subscribe BU Spark! In Your Inbox We’ll keep you updated on the latest news and events happening with BU Spark! Subscribe",
  "content_length": 1911,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:53"
}