{
  "name": "Mayank Goel",
  "homepage": "https://www.hcii.cmu.edu/people/mayank-goel",
  "status": "success",
  "content": "Mayank Goel | Human-Computer Interaction Institute Skip to main content Search Expand Menu Close Menu Mayank Goel Associate Professor Software and Societal Systems Department (S3D) and Human-Computer Interaction Institute Faculty Email mayankgoel@cmu.edu Campus Address TCS Hall 340 Links Website Smash Lab Google Scholar Research Areas AR / VR / XR Ubiquitous Computing Physical Interfaces – Sensing, Haptics, Fabrication Healthcare + HCI Human-Centered AI Advisees Riku Arakawa My research focuses on designing, implementing, and testing new sensing systems. I typically focus on repurposing and extending the capabilities of sensors and devices around us. This approach allows us to add various functionalities to our daily-use devices with negligible hardware modifications. I am interested in solving problems in various domains, including health sensing, technologies for global development, and novel interactions. Many times solutions in such domains need to be used and evaluated by the end user in their daily lives. Consequently, I collaborate closely with medical professionals, bio-engineers, and designers to develop end-to-end solutions that can be immediately used and evaluated outside the lab environment. In the News HCII at UIST 2025 What’s next in the future of user interfaces? Look no further for some possibilities. Faculty and students from the Human-Computer Interac... View Details CMU Technology Helps People Maintain Health at Home An app designed by Carnegie Mellon University researchers uses artificial intelligence to assess depression and fatigue. The goal? To bett... View Details Protecting Audio Privacy at the Source Sound is a powerful source of information. By training algorithms to identify distinct sound signatures, sound can reveal what a person is... View Details Mayank Goel Presents at World Economic Forum Summer Gathering in China Mayank Goel, an associate professor in the Software and Societal Systems Department and Human-Computer Interaction Institute, recently att... View Details Related Projects Project PrISM: Procedural Interaction from Sensing Module There are numerous complex tasks in everyday life, from cooking to medical self-care, that involve a series of atomic steps. Properly executing these step There are numerous complex tasks in everyday life, from cooking to medical self-care, that involve a series of atomic steps. Properly executing these steps can be challenging, particularly for novices ... View Details Back to Top",
  "content_length": 2495,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:51"
}