{
  "name": "Mayra Donaji Barrera Machuca",
  "homepage": "https://www.mayradonaji.net",
  "status": "success",
  "content": "Mayra Barrera, HCI researcher I'm an assistant professor at the Department of Computer Science at the University of Calgary, and my research is on HCI, VR, and 3DUI design. I also research the challenges people from LATAM face when working as HCI researchers. I lead the VERTEX Lab, which focuses on understanding how people think when working in a 3D virtual environment. The lab's current projects involve: designing new 3DUIs for 3D sketching, understanding perception issues in virtual environments and studying skills transfer between VR and real life, and vice versa. I was born in Mexico City. I got a BA in Animation and Digital Art at the Tec de Monterrey and an MSc in Creative Media Technologies from the University of Tasmania. I completed a PhD at SIAT, Simon Fraser University (2020) under Dr. Wolfgang Stuerzlinger's supervision. I also worked as a postdoctoral fellow at the iVizLab and Virtro. Outside academia, I have worked as a web developer, videogame designer and producer. CURRENT GRANTS MITACS Accelerate. Future Leaders in Canadian Brain Research Grant 2023-2025 (co-applicant). JELF CFI Grant. NSERC Discovery Grant. AWARDS 2024 Dean's Research Excellence Award. 2021 IEEE VGTC Best VR Doctoral Dissertation Award. Dalhousie Belong Research Fellowship 2021/22. MITACS Postdoctoral Accelerate Grant 2021. SFU Presidents PhD Scholarship. SIAT, Travel Award Fall 2016, Spring 2018, Fall 2018, Spring 2019, Summer 2019. SFU Provost International Fellowship 2015. CONACYT Scholarship for Postgraduate Studies 2015. CONACYT Scholarship for Postgraduate Studies 2012. Producer of âNo Chicken Soup Todayâ â Dev Hour Student Showcase 2011. Production assistant of âHubieraâ â Honorific Mention in Animasivo 2011. Producer and animator of âRadioterapiaâ â Best Animation in Radio UNAM 2010. Producer of âVida Congeladaâ â Best Comedy in Campus Movie Fest Mexico 2010. Download CV Copyright © Mayra Barrera 2021",
  "content_length": 1950,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:53"
}