{
  "name": "Mays F. Al-Naday",
  "homepage": "https://www.essex.ac.uk/people/alned81405/mays-al-naday",
  "status": "success",
  "content": "Mays Al-Naday | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Mays Al-Naday People Dr Mays Al-Naday Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email mfhaln@essex.ac.uk Location 1NW.4.8, Colchester Campus Academic support hours My Academic Support Hours will be 12-13 on Thursday via zoom. The zoom link for this is available from my profile on my CE155 course MOODLE page. Please wait in the waiting room until I can admit you. Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I am a lecturer in cyber security at the School of Computer Science and Electronic Engineering (CSEE). Prior to this, I worked as a senior research officer in the Communications group of CSEE, contributing to a number of national and European projects. Further, I worked as a graduate DevOps engineering in BSkyB. I Received my PhD in Electronic and Computing Systems from the University of Essex in 2015; and, my MSc in Computer and Information Networks from the University of Essex in 2010. My research interests focus on future networking architecutres, including Information-Centric Networking (ICN), Fog Computing, Serverless Computing, Cyber Security, Content Distribution Networks and Intelligent Optical Networks. I'm also interested in networking problems associated with health and wellbeing applications. Qualifications PhD in Electronic and Computing Systems, 2015 MSc in Computer and Information Networks, 2010 BSc in Information and Communication Engineering, 2006 Research and professional activities Research interests Information-Centric Networks Context-aware Communications Cyber Security Internet of Things Network Function Virtualisation Software-Defined Networks Mobile Edge Computing Fog Computing Resource management and QoS in ICN Serverless Computing Conferences and presentations AI in Energy AIOTI White paper, Brussels, Belgium, 3/12/2024 Edge driven Digital Twins in distributed energy systems AIOTI Energy WG, Brussels, Belgium, 31/1/2024 session 4, Vertical 05: Energy power and sustainability IoT World Forum 2023, Aveiro, Portugal, 26/10/2023 International workshop on Information Centric Fog Computing (ICFC), IFIP NETWORKING 17, Stockholm Stockholm, Sweden, 2017 I have organised two workshops International workshop on Mobile Edge Communications (MECOMM), SIGCOMM 17, LA I have published papers in: Teaching and supervision Current teaching responsibilities Computer and Data Networks (CE231) Programmable Networks and Services (CE709) Current supervision Rawaa Abdulhussein Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Rawaa Mohammed Abdulhussein Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Rawaa Mohammed Abdulhussein Al-Wani Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Bushra Mohammed M Al Sullayyim Degree subject: Computer Science Degree type: Doctor of Philosophy Bara MoUSA Khalil Hamadeh Degree subject: Computer Science Degree type: Doctor of Philosophy Weilin Zhang Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Publications Journal articles (17) Santos, J., Ninan, BV., Volckaert, B., Turck, FD. and Al-Naday, M., (2025). A Comprehensive Benchmark of Flannel CNI in SDN/non-SDN Enabled Cloud-Native Environments. IEEE Transactions on Network and Service Management, 1-1 Goethals, T., Al-Naday, M., Volckaert, B. and Turck, FD., (2024). Warrens: Decentralized Connectionless Tunnels for Edge Container Networks. IEEE Transactions on Network and Service Management. 21 (4), 4282-4296 Al-Naday, M., Dobre, V., Reed, M., Toor, S., Volckaert, B. and De Turck, F., (2023). Federated deep Q-learning networks for service-based anomaly detection and classification in edge-to-cloud ecosystems. Annals of Telecommunications. 79 (3-4), 165-178 Hidalgo, C., Vaca, M., Nowak, MP., Frölich, P., Reed, M., Al-Naday, M., Mpatziakas, A., Protogerou, A., Drosou, A. and Tzovaras, D., (2022). Detection, control and mitigation system for secure vehicular communication. Vehicular Communications. 34, 100425-100425 Sebrechts, M., Volckaert, B., De Turck, F., Yang, K. and Al-Naday, M., (2022). Fog Native Architecture: Intent-Based Workflows to Take Cloud Native toward the Edge. IEEE Communications Magazine. 60 (8), 44-50 Hu, J., Reed, M., Thomos, N., Al-Naday, M. and Yang, K., (2022). A Dynamic Service Trading in a DLT-Assisted Industrial IoT Marketplace. IEEE Transactions on Network and Service Management. 19 (4), 4691-4705 AL-Naday, M., Thomos, N., Hu, J., Volckaert, B., de Turck, F. and Reed, MJ., (2022). Service-based, Multi-Provider, Fog Ecosystem with Joint Optimization of Request Mapping and Response Routing. IEEE Transactions on Services Computing. 16 (3), 1-15 Hu, J., Reed, M., Thomos, N., Al-Naday, MF. and Yang, K., (2021). Securing SDN controlled IoT Networks Through Edge-Blockchain. IEEE Internet of Things Journal. 8 (4), 2102-2115 Hu, J., Reed, MJ., Al-Naday, M. and Thomos, N., (2021). Hybrid Blockchain for IoT—Energy Analysis and Reward Plan. Sensors. 21 (1), 305-305 Hu, J., Reed, MJ., Al-Naday, MF. and Thomos, N., (2020). Blockchain-Aided Flow Insertion and Verification in Software Defined Networks.. CoRR. abs/2006.14513 Al-Khalidi, MQ., Thomos, N., Reed, M., Al-Naday, M. and Trossen, D., (2019). Anchor Free IP Mobility. IEEE Transactions on Mobile Computing. 18 (1), 56-69 AL-Naday, MF., Thomos, N. and Reed, MJ., (2017). Information-Centric Multilayer Networking: Improving Performance Through an ICN/WDM Architecture. IEEE/ACM Transactions on Networking. 25 (1), 83-97 Reed, MJ., Al-Naday, M., Thomos, N., Trossen, D., Petropoulos, G. and Spirou, S., (2016). Stateless multicast switching in software defined networks. 2016 IEEE International Conference on Communications, ICC 2016. abs/1511.06069 Al-Khalidi, M., Thomos, N., Reed, MJ., Al-Naday, MF. and Trossen, D., (2016). Network Controlled Mobility Management using IP over ICN Architecture.. CoRR. abs/1610.09011 Al-Naday, MF., Thomos, N. and Reed, MJ., (2015). Information-centric Multilayer Network: ICN/WDM.. CoRR. abs/1511.04698 Al-Naday, MF., Reed, MJ., Trossen, D. and Yang, K., (2014). Information resilience: Source recovery in an information-centric network. IEEE Network. 28 (3), 36-42 AL-Naday, MF., Almeida, RC., Guild, KM. and Reed, MJ., (2012). Design proposal of a photonic multicast Bloom filter node. Photonic Network Communications. 24 (2), 132-137 Show all Conferences (26) Whitaker, M., Bruno, V. and Al-Naday, M., (2025). Idempotency in Service Mesh: for Resiliency of Fog-Native Applications in Multi-Domain Edge-to-Cloud Ecosystems Al-Wani, R. and Al-Naday, M., (2025). Intelligent Anomaly Detection for Context-Oriented Data Brokerage Systems Amangele, P., Ahmad, S., Al-Naday, M., Thomos, N. and Reed, MJ., (2025). Two-stage machine learning for efficient network intrusion detection in software defined networks Ejaz, S. and Al-Naday, M., (2024). FORK: A Kubernetes-Compatible Federated Orchestrator of Fog-Native Applications Over Multi-Domain Edge-to-Cloud Ecosystems Zhang, W., Toor, S. and Al-Naday, M., (2024). Federated Machine Learning for Resource Allocation in Multi-domain Fog Ecosystems Birtane, S., Al-Naday, M., Paolucci, F., Bakar, RA., Lefebvre, V., Passas, V., Kalafatidis, S., Lalas, A., Drosou, A., de Oca, EM., Cavalli, AR., Vörös, P., Alshawki, M., Stiller, B., Soussi, W., Cantali, G. and Gür, G., (2024). Footprint-Optimized Orchestration and Management of Secure Complex Services over 6G Continuum Al-Naday, M., Reed, M., Dobre, V., Toor, S., Volckaert, B. and De Turck, F., (2023). Service-based Federated Deep Reinforcement Learning for Anomaly Detection in Fog Ecosystems Al-Naday, M., Karagiannis, V., De Block, T. and Volckaert, B., (2023). Federated Scheduling of Fog-native Applications over Multi-Domain Edge-to-Cloud Ecosystem Karagiannis, V., Al-Naday, M. and De Block, T., (2023). The Blue Dataverse: A System for Marine Data Sovereignty Al-Naday, M., Goethals, T. and Volckaert, B., (2022). Intent-based Decentralized Orchestration for Green Energy-aware Provisioning of Fog-native Workflows Goethals, T., Sebrechts, M., Al-Naday, M., Volckaert, B. and De Turck, F., (2022). A Functional and Performance Benchmark of Lightweight Virtualization Platforms for Edge Computing Al-Naday, M. and Macaluso, I., (2021). Flexible Semantic-based Data Networking for IoT Domains Hu, J., Reed, M., Al-Naday, M. and Thomos, N., (2020). Blockchain-Aided Flow Insertion and Verification in Software Defined Networks Amangele, P., Reed, MJ., Al-Naday, M., Thomos, N. and Nowak, M., (2019). Hierarchical Machine Learning for IoT Anomaly Detection in SDN Hernandez-Ramos, JL., Baldini, G., Neisse, R., Al-Naday, M. and Reed, MJ., (2019). A Policy-based Framework in Fog enabled Internet of Things for Cooperative ITS Frotscher, A., Monschiebl, B., Drosou, A.,",
  "content_length": 14347,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:53"
}