{
  "name": "Maziar Ghorbani",
  "homepage": "https://www.brunel.ac.uk/people/maziar-ghorbani1",
  "status": "success",
  "content": "Dr Maziar Ghorbani | Introduction | Brunel University London Skip to Content Home People Dr Maziar Ghorbani Dr Maziar GhorbaniAssociate Lecturer (Education) in Computer Science Wilfred Brown 313 Email: maziar.ghorbani@brunel.ac.uk Tel: +44 (0)1895 268677 Computer Science College of Engineering, Design and Physical Sciences Summary As an FHEA-accredited Associate Lecturer with a multidisciplinary background in Electronics Engineering, Microelectronics System Design, Experimental Physics, and Computer Science, Dr Maziar Ghorbani is committed to fostering academic excellence and nurturing the next generation of innovators. With a strong passion for interdisciplinary teaching and research, Dr Ghorbani specialises in Modelling and Simulations, Large-scale High-performance Distributed Computing,  and Sensor Instrumentation and IoT. His dedication to student engagement and experiential learning drives the creation of cutting-edge projects designed to challenge and inspire future computer scientists. Dr Ghorbani is focused on exploring the limitless possibilities at the intersection of technology, science, and education. Qualifications Doctor of Philosophy (PhD) in Experimental Physics, Brunel University London, UK Master of Science (MSc) in Microelectronics System Design, Westminster University, UK Bachelor of Science (BSc) in Electronics Engineering, Westminster University, UK Responsibility Dr Maziar Ghorbani is responsible for delivering engaging lectures and leading interactive workshops, ensuring that students are actively involved in the learning process. He mentors and guides students through their academic projects, providing support and expertise to help them succeed. In collaboration with colleagues, Dr Ghorbani contributes to the development of innovative curriculum and course materials, ensuring they reflect the latest advancements in technology and research. His academic responsibilities also include contributing to research and publications within his areas of expertise. Moreover, Dr Ghorbani is dedicated to fostering a supportive and inclusive learning environment that encourages all students to thrive.",
  "content_length": 2148,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:53"
}