{
  "name": "Md. Osman Gani",
  "homepage": "https://mogani.umbc.edu",
  "status": "success",
  "content": "Causal Artificial Intelligence Lab (CAIL) – UMBC Skip to main content Causal Artificial Intelligence Lab (CAIL) Menu Apply Search Search Context This Site All of UMBC Emam Hossain presented our paper “Time Series Classification of Supraglacial Lakes Evolution over the Greenland Ice Sheet” at ICMLA 2024 Uzma Hasan presented our work at Causal AI for Robust Decision Making (CARD) workshop at PerCom 2025. Fourkanul Islam presented his poster titled “Crowd-Sensed Accessible Navigation for Wheelchair Users at UMBC Poster Session 2022 Slide 0 Slide 1 Slide 2 Location ITE 461 1000 Hilltop Circle, Baltimore, MD 21250 The Causal AI Lab at UMBC advances the foundations and applications of causal inference and machine learning to build reliable, interpretable, and generalizable AI systems. Our research focuses on uncovering and leveraging causal structure in data to move beyond correlation-driven prediction toward causally grounded reasoning and decision-making. We build Level-2 and Level-3 AI systems in Pearl’s Causal Hierarchy (see Figure — Causal Hierarchy). We develop novel methods for causal discovery, counterfactual estimation, and causal representation learning, integrating domain knowledge, human feedback, and data-driven inference. These approaches enable robust generalization across contexts and support trustworthy, policy-relevant decision systems. Our applied research spans healthcare analytics, climate adaptation modeling, and accessible mobility, where causal modeling offers new insights into intervention effects, system dynamics, and fairness in algorithmic outcomes. By bridging theoretical causal modeling with real-world deployment, we aim to advance AI systems that is not only powerful but also interpretable and socially beneficial. Research Philosophy Our research is guided by three principles: From Data to Decisions: Uncovering the mechanisms driving observable phenomena to enable stronger generalization, reliable decision-making, and effective interventions. Real-World Impact: Applying causal AI where better decisions matter most — from healthcare and climate adaptation to accessible mobility. Interdisciplinary Approach: Combining machine learning with insights from statistics, computer science, healthcare, and climate science. Research Focus Areas Causal Discovery & Inference: Scalable, knowledge-guided approaches for learning causal relationships from observational and time-series data. Explainable AI: Designing interpretable, transparent AI systems aligned with societal needs. Applications: Deploying causal AI in healthcare, climate science, and accessible transportation. News & Updates [Sept 2025] Invited talk on Causal Representation Learning for Dynamical Systems at the Climate-ML Workshop. [July 2025] Release of the Greenland Supraglacial Lake Time Series (SGL-TS) dataset for causal modeling. [May 2025] Undergraduate interns joined the lab through UMBC’s summer research programs. More News » Prospective Students I am currently looking for motivated Ph.D. students to join the Causal Artificial Intelligence Lab (CAIL). If you are interested, please reach out at mogani@umbc.edu. Collaborators & Sponsors Location ITE 461 1000 Hilltop Circle, Baltimore, MD 21250 © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 3573,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:57"
}