{
  "name": "Md. Rezaul Karim 0002",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1763",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Md. Rezaul Karim (Professor) Department of Computer Science and Engineering Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Computer Science and Engineering Bangladesh University of Engineering and Technology Bangladesh 2008 Masters Computer and Information Technology Indian Institute of Technology, Kharagpur India 1998 Masters Computer Science University of Dhaka Bangladesh 1991 Bachelor Applied Physics and Electronics University of Dhaka Bangladesh 1990 Title Organization Location From Date To Date Visiting Researchers Gunma University, Japan Department of Computer Science and Engineering 30, Jan 2011 10-02-2011 Professor University of Dhaka Dept. of Computer Science and Engineering 13, Oct 2010 Currently Working Associate Professor University of Dhaka Dept. of Computer Science and Engineering 06, Jan 2003 12-10-2010 Assistant Professor University of Dhaka Dept. of Computer Science and Engineering 04, Oct 1998 05-01-2003 Lecturer Islamic University, Kushtia Dept. of Applied Mathematics and Computer Science 04, Oct 1995 03-11-1998 Research Interest Subject Description Research Interest (Goal, Target Indicator) Project Management Dataminig Graph Drawing Algorithms Digital Forensic Information Security Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Masters A layered Malware Detection Architecture for Enhance Threat Recall Md. Rezaul Karim Jawad Alam Cyber Scurity 2025 Masters An efficient dynamic superset bit-vector approach for mining frequent closed item sets and their lattice structure Dr. Md. Rezaul Karim Tahrima Hashem Data Mining 2015 Masters Mining non-redundant closed flexible periodic patterns Dr. Md. Rezaul Karim Sayama Akhter Data Mining 2015 Research Project Report/Other Pentesting with a custom portable WiFi scanner Dr. Syed Faisal Hasan Dr. Md. Rezaul Karim Mahmudul Hasan Imaran Hossain Cyber Security 2018 Research Project Report/Other Fake News Detection on Social Media Dr. Md. Rezaul Karim Pranto Hasan Parves Mosharoof Cyber Security Current Year Research Project Report/Other Fault tolerant network design with SDN Fast-failover Dr. Syed Faisal Hasan Dr. Md. Rezaul Karim Md. Asraful Islam Cyber Security Current Year Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration NLP Speech Synthesis in Bangla UGC, Bangladesh 22-04-2023 30-04-2024 ICT Development of a Robust Banlga Language Model and a NLP Server Centennial Research Grant, University of Dhaka 15-06-2021 25-09-2022 ICT Crowdsourcing approach to ensure travel safety in a city ICT Division, Govt. of the People's Republic of Bangladesh Bangladesh 01-01-2021 30-06-2022 Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year No Collaboration & Membership is found Book 1 Md. Rezaul Karim Straight-Line Grid Drawings of Planar Graphs with Sub-Quadratic Area,. Germany: VDM Verlag, 2009 . Journal Article 1 Jesan Ahammed Ovi, Md. Ashraful Islam and Md. Rezaul Karim : BaNeP: An End-to-End Neural Network Based Model for Bangla Parts-of-Speech Tagging, IEEE Access (impact factor:3.367) , vol.10 IEEE , pp.102753-102769 , 2022 . View More 2 Ekram Hossain, Md. Rezaul Karim, Mir Hasan, Syeed Abrar Jaoad, Tauhid Tanjim and Md. Mosadek Khan : SPaFE : A Crowdsourcing and Multimodal Recommender System to Ensure Travel Safety in a City, IEEE Access (impact factor:3.367) , vol.10 IEEE , pp.12 , 2022 . View More 3 Sayma Akther, Md. Rezaul Karim, Md. Samiullah and Chowdhury Farhan Ahmed : Mining non-redundant closed flexible periodic patterns, Journal of Engineering Applications of Artificial Intelligence (impact factor:3.526) , vol.69 , pp.1-23 , 2018 . 4 Tahrima Hashem, Md. Rezaul Karim, Md. Samiullah and Chowdhury Farhan Ahmed : An efficient dynamic superset bit-vector approach for mining frequent closed item sets and their lattice structure, Journal of Expert Systems with Applications (impact factor:4.292) , vol.67 , pp.252-271 , 2017 . 5 Md. Rezaul Karim, Md. Jawaherul Alam and Md. Saidur Rahman : On some properties of doughnut graphs, AKCE International Journal of Graph Algorithms and Combinatorics , vol.13 , no.2 , pp.130-139 , 2016 . 6 Md. Manzurul Hasan, Md. Saidur Rahman and Md. Rezaul Karm : Box-rectangular drawing of planar graphs, Journal of Graph Algorithms and Applications. , vol.17 , no.6 , pp.629-646 , 2013 . 7 Md. Rezaul Karm, Md. Jawaherul Alam and Md. Saidur Rahman : Straight-line grid drawings of label-constrained outerplanar graphs with O(n logn) area, Journal of Graph Algorithms and Applications, , vol.15 , no.3 , pp.437-456 , 2011 . 8 Md. Jawaherul Alam, Mashfiqui Rabbi, Md. Saidur Rahman and Md. Rezaul Karim : Upright drawings of graphs on three layers, Journal of Applied Mathematics and Informatics , vol.28 , no.5-6 , pp.1347-1358 , 2010 . 9 Md. Rezaul Karim and Md. Saidur Rahman : On a class of planar graphs with straight-line grid drawing with linear area, Journal of Graph Algorithms and Applications , vol.13 , no.2 , pp.153-177 , 2009 . 10 Md. Rezaul Karim, Md. Nahiduzzaman and Md. Saidur Rahman : A linear-lime algorithm for k-partitioning doughnut graphs, INFOCOMP- Journal of Computer Science , vol.8(1) , pp.8-13 , 2009 . 11 Shah Mostafa Khaled, Md. Rezaul Karim and Md. Akhtaruzzaman : Security system based on embedded internet control,, Dhaka University Journal of Science , vol.56 , no.2 , pp.147-152 , 2008 . 12 Shah Mostafa Khaled, Md. Rezaul Karim, Ashis Kumer Biswas and M. A. Qayum : Optimization of reliability in a real time security system controlled by embedded internet technology, Asian Journal of Information Technology , vol.6 , no.10 , pp.1050-1056 , 2007 . 13 Md. Mamun-or-Rashid and Md. Rezaul Karim : Predictive item pruning FP-Tree algorithm, Dhaka University Journal of Science , vol.52 , no.1 , pp.39-43 , 2003 . 14 Md. Rafiqul Islam and Md. Rezaul Karim : Improved techniques for query optimization using eliminating duplicates generated in transformation-based join enumeration, Dhaka University Journal of Science , vol.51 , no.1 , pp.67-75 , 2003 . 15 Lutful Karim and Md. Rezaul Karim : Complexity analysis of symmetrical multiprocessor and multi-purpose parallel computers, Dhaka University Journal of Science , vol.51 , no.1 , pp.51-57 , 2003 . 16 Lutful Karim and Md. Rezaul Karim : , Reliability, Availability, and Serviceability (RAS) enhancement of supercomputers, especially in RS/6000 SP, Dhaka University Journal of Science, , vol.51 , no.1 , pp.59-65 , 2003 . 17 M. Tariqul Islam, M. Atiqur Rahman, Zahid Hasan Mahmood, Md. Rezaul Karim, Mashur Rafique and Shahida Rafique : , An approach to solve real-time problem applying semaphore, Dhaka University Journal of Science , vol.49 , no.2 , pp.117-121 , 2001 . Conference Proceedings 1 Md. Saidur Rahman and Md. Rezaul Karim \"Drawing Planar Graphs.\" WALCOM 2020 , pp. 3-14. Singapore: LNCS, 2020 . 2 Imran Hossain, M M Hasan, S. Faisal Hasan and Md. Rezaul Karim \"A study of security awareness in Dhaka city using a portable WiFi pentesting device.\" 2nd International Conference on Innovation in Engineering and Technology (ICIET) 2019 . 3 Md. Manzurul Hasan, Md. Saidur Rahman and Md. Rezaul Karim \"Box-rectangular drawing of planar graphs(Extended Abstract).\" WALCOM 2013 , pp. 334-345. Kharagpur, Westbengal: Lecture Notes in Computer Science, 7748, Springer, 2013 . 4 Md. Rezaul Karm, Md. Jawaherul Alam and Md. Saidur Rahman \"On some properties of doughnut graphs (Extended Abstract).\" IWOCA , pp. 60-64. Bangalore: Lecture Notes in Computer Science, 7643, Springer, 2012 . 5 Md. Rezaul Karm, Md. Jawaherul Alam and Md. Saidur Rahman \"Straight-line grid drawings of label-constrained outerplanar graphs with O(n logn) area (Extended Abstract).\" WALCOM , pp. 310-321. Kolkata: Lecture Notes in Computer Science, 5431, Springer, 2009 . 6 Md. Rezaul Karim and Md. Saidur Rahman \"Four-connected spanning subgraphs of doughnut graphs, Proc. of WALCOM 2008,.\" WALCOM , pp. 132-143. Dhaka: Lecture Notes in Computer Science, 4921, Springer, 2008 . 7 Md. Rezaul Karim and Md. Saidur Rahman \"Straight-line grid drawings of planar graphs with linear area.\" Asia-Pacific Symposium on Visualization (APVIS) , pp. 109-112. Sydney, Australia: IEEE, 2007 . 8 Syed Miraj Momin, Md. Rafiqul Islam and Md. Rezaul Karim \"An Approved Algorithm for Query Optimization using Generalized Outer-Join and Operator Selection in Bottom-up Trees,.\" International Conference on Computer and Information Technology (ICCIT) , pp. 77-82. Dhaka: 2001 . 9 Saifuddin Md. Tareeq, Md. Rafiqul Islam and Md. Rezaul Karim \"Improved techniques for query optimization using eliminating duplicates generated in transformation-based join enumeration.\" International Conference on Computer and Information Technology (ICCIT) , pp. 83-88. Dhaka: 2001 . 10 Md. Rezaul Karim, Pallab Dasgupta, P. P. Chakraborty and Dipankar Sarkar \"A Prolog Program for Sliding Window Protocol Analysis.\" National Conference on Computer and Information Technology , pp. 198-2003. Dhaka: 1997 . Award Type Title Year Country Description Local Dean's Award - 2017 2020 Bangladesh Authority: Faculty of Engineering and Technology, University of Dhaka Domain: In recognition of the outstanding achievement in research. Category: Professor/Associate Professor Paper Title: An efficient dynamic superset bit-vector approach for mining frequent closed itemset and their lattice structure Journal: Expert Systems with Applications, Vol. 67, January 2017 Dr. Md. Rezaul Karim Professor Department of Computer Science and Engineering Faculty of Engineering and Technology Email: rkarim@du.ac.bd Phone: 880-2-9661900/7424",
  "content_length": 9951,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:56"
}