{
  "name": "Md. Ashraful Islam 0001",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/4168",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Md. Ashraful Islam (Assistant Professor (Study Leave)) Department of Computer Science and Engineering Research Profile Personal Website & CV Social Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Masters CSE University of Dhaka Bangladesh 2016 Bachelor CSE University of Dhaka Bangladesh 2015 Title Organization Location From Date To Date Assistant Professor University of Dhaka Dhaka,Bangladesh 28, Jun 2022 Currently Working Lecturer University of Dhaka Dhaka, Bangladesh 03, Sep 2019 27-06-2022 Lecturer East west University Dhaka, Bangladesh 30, Apr 2018 02-09-2019 Research Interest Subject Description Research Interest (Goal, Target Indicator) Natural Language Processing Speech Recognition, Speech Synthesizer, Seq2Seq Models, Lemmatiation, POS Tagger Machine Learning Incremental Learning Pattern Mining Graph mining, Weighted Pattern Mining, Sequential Pattern Mining, Data Stream Mining Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Masters Weighted Graph Mining from Transnational Graph Database Prof. Dr. Chowdhury Farhan Ahmed Md. Ashraful Islam Graph Mining 2016 Research Project Report/Other BaNeL: An Encoder-Decoder Based Bangla Neural Lemmatizer Jesan Ahammed Ovi Md Ashraful Islam Md. Towhiduzzaman, Md.Tauhidul Islam Bhuiyan, Abdullah Al Maruf Recurrent Neural Network 2020 Research Project Report/Other eLearn++: An effective Incremental Learning Approach for Brain Tumor Detection Jesan Ahammed Ovi Md Ashraful Islam Sofiul Azam Sony, Tasfi Zaman, Md. Kamrul Islam Machine Learning 2020 Research Project Report/Other Weighted Clickstream Mining Using Pre-order Linked Web-Access Pattern Tree Jesan Ahammed Ovi Md Ashraful Islam Abu Naser, Muhammad Islam, Nusrat Sultana Sequential Pattern Mining 2020 Research Project Report/Other Neural Network Based Bangla Text to Speech System Md. Ashraful Islam Tanvir Siddique and Miltan Mridha Natural Language Processing 2020 Research Project Report/Other Bangla Speech Recognition Md Ashraful Islam Sihan Tawsik and Md. Jahid Hasan Natural Language Processing 2020 Research Project Report/Other Weighted Sequential Pattern Mining Md Ashraful Islam Jesan Ahammed Ovi Mahfuzur Rahman Rafi and Al-Amin Azad Sequential Pattern Mining 2019 Research Project Report/Other Utility Based Graph Mining Prof. Dr. Chowdhury Farhan Ahemd Md. Ashraful Islam Md. Tanvir Alam & Amit Roy Graph Mining 2019 Research Project Report/Other Dristributed Hierarchical Incremental Clustering Prof. Dr. Md. Rezaul Karim Md. Ashraful Islam and Jesan Ahammed Ovi Machine Learning 2015 Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration No project/research work is found Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year No Collaboration & Membership is found Journal Article 1 Jesan Ahammed Ovi, Md Ashraful Islam and Md Rezaul Karim : BaNeP: An End-to-End Neural Network Based Model for Bangla Parts-of-Speech Tagging, IEEE Access IEEE , 2022 . 2 Md. Ashraful Islam, Md Towhiduzzaman, Md Bhuiyan, Tauhidul Islam, Abdullah Al Maruf and Jesan Ahammed Ovi : BaNeL: an encoder-decoder based Bangla neural lemmatizer, SN Applied Sciences , vol.4 , no.5 Springer International Publishing , pp.1--15 , 2022 . 3 Md. Tanvir Alam, Amit Roy, Chowdhury Farhan Ahmed, Md. Ashraful Islam and Carson K. Leung : UGMINE: Utility Based Graph Mining, Applied Intelligence Springer , 2022 . 4 Md Ashraful Islam, Mahfuzur Rahman Rafi, Al-amin Azad and Jesan Ahammed Ovi : Weighted frequent sequential pattern mining, Applied Intelligence Springer , pp.1--28 , 2021 . Conference Proceedings 1 Md Tanvir Alam, Amit Roy, Chowdhury Farhan Ahmed, Md Ashraful Islam and Carson K Leung \"Mining High Utility Subgraphs.\" 2021 International Conference on Data Mining Workshops (ICDMW) , pp. 566--573. IEEE: 2021 . 2 Md Asiful Haque, Shamima Sultana, Md Jayedul Islam, Md Ashraful Islam and Jesan Ahammed Ovi \"Factoid Question Answering over Bangla Comprehension.\" International Symposium on Multidisciplinary Studies and Innovative Technologies Tokat, Turkey: IEEE, 2020 . 3 Shah Mohammed Nuruddin, Md Didarul Islam, Md Shafiqul Alam, Jesan Ahammed Ovi and Md Ashraful Islam \"An Efficient Approach for Sequential Pattern Mining on GPU Using CUDA Platform.\" International Symposium on Multidisciplinary Studies and Innovative Technologies Tokat, Turkey: IEEE, 2020 . 4 Nahian Ashraf, Riddho Ridwanul Haque, Md Ashraful Islam, Chowdhury Farhan Ahmed, Carson K. Leung, Jiaxing Jason Mai and Bryan H. Wodi \"WeFreS: Weighted Frequent Subgraph Mining in a Single Large Graph.\" Industrial Conference on Data Mining ibai publishing, 2019 . 5 Md Ashraful Islam, Chowdhury Farhan Ahmed, Carson K Leung and Calvin SH Hoi \"WFSM-MaxPWS: an efficient approach for mining weighted frequent subgraphs from edge-weighted graph databases.\" Pacific-Asia Conference on Knowledge Discovery and Data Mining , pp. 664--676. Melbourne, VIC, Australia: Springer, 2018 . 6 Sofiul Azam Sony, Tasfi Zaman, Md Kamrul Islam, Jesan Ahammed Ovi and Md Ashraful Islam \"eLearn++: An effective Incremental Learning Approach for Brain Tumor Detection.\" 2021 2nd International Conference for Emerging Technology (INCET) , pp. 1--8. IEEE: 2021 . 7 Jesan Ahammed Ovi, Md Ashraful Islam and Jannatul Ferdosh Nima \"An Efficient Approach for Mining Weighted Frequent Patterns from Data Stream.\" 2021 2nd International Conference for Emerging Technology (INCET) , pp. 1--10. IEEE: 2021 . 8 Abu Naser, Nusrat Sultana, Md Ashraful Islam and Jesan Ahammed Ovi \"Weighted Clickstream Mining Using Pre-order Linked Web-Access Pattern Tree.\" 2021 2nd International Conference for Emerging Technology (INCET) , pp. 1--11. IEEE: 2021 . Award Type Title Year Country Description Local Dean's Award, Faculty of Engineering and Technology, University of Dhaka 2015 Bangladesh Md. Ashraful Islam Assistant Professor (Study Leave) Department of Computer Science and Engineering Faculty of Engineering and Technology Email: ashraful@du.ac.bd",
  "content_length": 6335,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:54"
}