{
  "name": "Md. Saidur Rahman 0001",
  "homepage": "http://saidurrahman.buet.ac.bd",
  "status": "success",
  "content": "Md Dr. Md. Saidur Rahman Education CV ACM Distinguished Speaker (To request a lecture, please click here) Present Position Professor Department of Computer Science and Engineeing Bangladesh University of Engineering and Technology (BUET) Contact Address Employment  at Tohoku University Associate Professor (April 1, 2003 to July 16, 2004) Graduate School of Information Sciences Notice A Note for Prospective M.Sc. Engg.  Students of CSE BUET Upcoming Keynote Speech ICCA 2024  September 5-6, Bangladesh CoMSO 2024  November 16-18, 2024, India Books Research Interest Graph Drawing Graph Algorithms VLSI Layout Algorithms Network Routing Protocols Bioinformatics Data Clustering Network Science Algorithmic Data Science Big Data Analytics and Visualization On-line Algorithms List of Publications Ongoing Research Publications in DBLP database Awards Wilkes 2025 Award UGC Award BAS Gold Medal for Junior Scientists Funai Information Technology Award Fellowship JSPS Postdoctoral Fellowship (Nov 2001 to March 2003) Scholarship MONBUSHO (April 1993 to March 1999) Involvements Teaching Administrative Responsibilities Professional Activities Graph Drawing Research Group Handbook of Graph Drawing and Visualization International Conference and Workshops on Algorithms and Computation (WALCOM) WALCOM 2007 WALCOM 2008 WALCOM 2010 WALCOM 2012 WALCOM 2017 WALCOM 2022 Edited Books LNCS Vols. 4921, 5942, 7157 and 10167, Springer Research Grants Received Research on Graph Drawing and Information Visualization (FY 2009-2010, BDT 8,80,000) HEQEP Subproject (2012-2014) CASR, BUET Projects (2008-2009, 2010-2011) Useful Links DBLP Database Pictures at some Conferences Picture Gallery Editorial Board Member Journal of Graph Algorithms and Applications (JGAA) International Journal of Foundations of Computer Science (IJFCS) AKCE International Journal of Graphs and Combinatorics Guest Editor Algorithmica Theoretical Computer Science International Journal of Foundation of Computer Science Journal of Graph Algorithms and Applications Journal of Combinatorial Optimization Discrete Mathematics, Algorithms and Applications Ph. D Students Supervised Dr. Md. Rezaul Karim , Professor, CSE, University of Dhaka, Bangladesh Dr. Md. Iqbal Hossain, Director, Research Data Science, University of Arizona, USA Dr. Shaheena Sultana, Professor, Notre Dame University, Bangladesh Dr. Md. Manzurul Hasan, Associate Professor, American International University, Bangladesh",
  "content_length": 2457,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:57"
}