{
  "name": "Md. Haider Ali",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1762",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Md. Haider Ali (Professor (Deputation)) Department of Computer Science and Engineering Research Profile Personal Website & CV Short Biography: Md. Haider Ali (also Mohammad Haider Ali) has completed his Doctor of Engineering from the dept. of Electronics and Information Engineering, Toyohashi University of Technology, Japan in the field of Computer Graphics. His research interest includes Computer Graphics and Image Processing. He is currently working as a professor in the ... Show more Md. Haider Ali (also Mohammad Haider Ali) has completed his Doctor of Engineering from the dept. of Electronics and Information Engineering, Toyohashi University of Technology, Japan in the field of Computer Graphics. His research interest includes Computer Graphics and Image Processing. He is currently working as a professor in the dept. of Computer Science and Engineering, University of Dhaka. Dr. Mohammad Haider Ali is the fellow of Bangladesh Computer Society, and former Student Member of Institute of Electronics, Information and Communication Engineering (IEICE), Japan. Show less Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Computer Graphics Toyohashi University of Technology Japan 2001 Masters Applied Physics & Electronics (EEE) University of Dhaka Bangladesh 1989 Bachelor Applied Physics & Electronics (EEE) University of Dhaka Bangladesh 1987 Title Organization Location From Date To Date Professor Dept of Computer Science & Engineering, University of Dhaka Dhaka 1000, Bangladesh 25, Jun 2007 Currently Working Associate Professor Dept of Computer Science & Engineering, University of Dhaka Dhaka 1000, Bangladesh 09, Jan 2003 24-06-2007 Assistant Professor Dept of CSE, Shah Jalal University of Science and Technology Sylhet, Bangladesh 19, Apr 1995 08-01-2003 Scientific Officer Bangladesh Atomic Energy Commission Savar, Dhaka 11, Apr 1990 19-04-1995 Research Interest Subject Description Research Interest (Goal, Target Indicator) Computer Graphics and Image Processing Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Ph.D. Optimal Algorithms for Stereo Correspondence Estimation Dr. Md. Haider Ali Md. Abdul Mannan Mondal Computer Vision Current Year Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration No project/research work is found Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year 1 Student Member Institute of Electronics, Information and Communication Engineering (IEICE), Japan 1997 2001 2 Life Member Dhaka University Alumni Association. 2008 Life Time 3 Life Member APECE (Applied Physics, Electronics and Communication Engineering Alumni Association, University of Dhaka 2005 Life Time 4 Member JUAAB (Japanese University Alumni Association in Bangladesh 2010 Life Time 5 Member Bangladesh Electronic Society 1992 1995 6 Life Fellow Bangladesh Computer Society 1993 Life Time Book 1 Dr. Md. Haider Ali and Ahmed Samsul Arefin Fundamentals of Computer and Information Technology. Dhaka, Bangladesh: Gyankosh Prokashoni, ISBN 984-70277-0041-1, 2009 . Book Section 1 Karishma Mohiuddin, Mirza Mohtashim Alam, Amit Kishor Das, Md. Tahsir Ahmed Munna, Shaikh Muhammad Allayear and Md. Haider Ali \"Haar Cascade Classifier and Lucas–Kanade Optical Flow Based Realtime Object Tracker with Custom Masking Technique.\" Advances in Information and Communication Networks, ISBN 978-3-030-03404-7. Kohei Arai, Supriya Kapoor and Rahul Bhatia Springer, Cham, 2018 . View More Journal Article 1 Hasin Rehana, Muhammad Ibrahim and Md. Haider Ali : Plant Disease Detection using Region-Based Convolutional Neural Network, Preprint submitted to Elsevier , 2023 . 2 Muhammad Aminur Rahaman, Md. Haider Ali and Md. Hasanuzzaman : Real-time computer vision-based gestures recognition system for bangla sign language using multiple linguistic features analysis, Multimedia Tools and Applications , vol.83 , no.8 Springer Nature , pp.22261-22294 , 2023 . View More 3 Md. Abdul Mannan Mondal and Mohammad Haider Ali : Disparity of Stereo Images by Self-Adaptive Algorithm, International Journal of Advanced Computer Science and Applications (IJACSA) , vol.11 , no.5 , pp.441-454 , 2020 . View More 4 Md. Abdul Mannan Mondal and Mohammad Haider Ali : Stereo Correspondence Estimation by Two Dimensional Real Time Spiral Search Algorithm, International Journal of Engineering and Advanced Technology (IJEAT) , vol.9 , no.5 , pp.96-103 , 2020 . View More 5 Md. Abdul Mannan Mondal and Mohammad Haider Ali : Self-Guided Stereo Correspondence Estimation Algorithm, International Journal of Image and Graphics, World Scientific Publishing Company, USA , vol.21 , 2020 . View More 6 Muhammad Aminur Rahaman, Mahmood Jasim, Md Haider Ali and Md Hasanuzzaman : Bangla Language Modeling Algorithm for Automatic Recognition of Hand-Sign-Spelled Bangla Sign Language, Front. Comput. Sci., (Higher Education Press and Springer-Verlag GmbH Germany, part of Springer Nature, 2019) , vol.14 , no.3 , 2019 . View More 7 Muhammad Aminur Rahaman, Mahmood Jasim, Md Haider Ali, Tao Zhang and Md Hasanuzzaman : A real-time hand-signs segmentation and classification system using fuzzy rule based RGB model and grid-pattern analysis, Front. Comput. Sci., (Higher Education Press and Springer-Verlag GmbH Germany, part of Springer Nature) , vol.12 , no.6 , pp.1258-1260 , 2018 . View More 8 Md. Abdul Mannan Mondal and Md. Haider Ali : Performance Review of the Stereo Matching Algorithms, American Journal of Computer Science and Information Engineering , vol.4 , no.1 , pp.7-17 , 2017 . View More 9 Md. Haider Ali, Israt Rahman Sami, Mahzabeen Islam and Mohammad Shahiduzzaman : Mathematical Morphology Based Automated Control Point Detection from Human Facial Image, International Journal of Machine GRAPHICS and VISION (MGV), Institute of Fundamental Technological Research, Poland Academy of Science, Warsaw, Poland , vol.16 , no.1/2 , pp.153-170 , 2017 . View More 10 Muhammad Aminur Rahaman, Mahmood Jasim, Md. Haider Ali and Md. Hasanuzzaman : A Real-Time Appearance-Based Bengali Alphabet and Numeral Signs Recognition System, Dhaka University Journal of Applied Science & Engineering , vol.4 , no.1 , pp.19-26 , 2017 . 11 Md. Abdul Mannan Mondal and Md. Haider Ali : Disparity Estimation by a Real Time Approximation Algorithm, International Journal of Image Processing (IJIP) , vol.10 , no.3 , 2016 . View More 12 Emon Kumar Dey, Mohsin Khan and Md. Haider Ali : Computer Vision-Based Gender Detection from Facial Image, International Journal of Advanced Computer Science , vol.3 , no.8 , pp.428-433 , 2013 . View More 13 Sheikh Mohammad Sarwar, Md. Mustafizur Rahman, Md. Haider Ali and Ashique Mahmood Adnan : A Scalable Image Snippet Extraction Framework for Integration with Search Engines, Computer and Information Science (Published by Canadian Center of Science and Education) , vol.6 , no.1 , pp.89-99 , 2013 . View More 14 Md. Safiuddin Sheikh and Md. Haider Ali : Straight Polygon Simplification of 3D Graphical Models, International Journal of Pure and Applied Sciences and Technology , vol.13 , no.2 , pp.26-31 , 2012 . View More 15 Nurul Ahad Tawhid, Nasir Uddin Laskar and Md. Haider Ali : A Vision-based Facial Expression Recognition and Adaptation System from Video Stream, International Journal of Machine Learning and Computing , vol.2 , no.5 , pp.535-539 , 2012 . View More 16 Shuvra Chakraborty and Md. Haider Ali : Iris Texture Recognition with DCT Compression for Small Scale System, Journal of Computing , vol.4 , no.11 , pp.20-27 , 2012 . View More 17 Md. Aktaruzzaman, Bulbul Ahmed and Md. Haider Ali : Rotation Invariant Object Detection Using Circular Features, Jahangirnagar University Journal of Science , vol.35 , no.1 , pp.23-39 , 2012 . 18 A S Md. Mokarrom Hossain, Shaily Kabir and Md. Haider Ali : Video Conferencing over Very Narrow Band Internet Using Image Metamorphosis, Dhaka University Journal of Applied Science & Engineering, University of Dhaka , vol.1 , no.2 , pp.147-150 , 2011 . 19 Md. Saiful Islam and Md. Haider Ali : A Miniature-Based Image Retrieval System, Dhaka University Journal of Science, University of Dhaka , vol.57 , no.2 , pp.187-191 , 2009 . 20 Md. Alamgir Hossain and Md. Haider Ali : Three-Dimensional Shape Reconstruction in Medical Imaging, Dhaka University Journal of Science, University of Dhaka , vol.57 , no.1 , pp.7-10 , 2009 . 21 Shaily Kabir and Md. Haider Ali : A Heuristic Approach of Establishing the Relationship between Full Width Half Maximum (FWHM) and Human Facial Shape Distortion in Image Metamorphosis, Dhaka University Journal of Science, University of Dhaka , vol.56 , no.1 , pp.51-56 , 2008 . 22 Md. Haider Ali : Optimized Camera Positioning Technique in Human Facial Texture Mapping, Dhaka University Journal of Science, University of Dhaka , vol.56 , no.1 , pp.39-44 , 2008 . 23 Pushpita Nomani Tumpi, Wahid Raihanur Rahman and Md. Haider Ali : An Efficient Facial Expression Detection System, International Journal of Machine GRAPHICS and VISION (MGV), Institute of Fundamental Technological Research, Poland Academy of Science, Warsaw, Poland , vol.16 , no.3/4 , pp.377-399 , 2007 . View More 24 Md. Saiful Islam and Md. Haider Ali : Content Based Image Indexing for Sub-Image Retrieval, Journal of Computer Science, Faculty of Computer Science, IBAIS University of Bangladesh , vol.1 , no.2 , pp.67-76 , 2007 . 25 S.M. Ashraful Kadir, Tazrian Khan and Md. Haider Ali : Human Facial Soft-Tissue Modeling using Finite Element Method, Dhaka University Journal of Science, University of Dhaka , vol.55 , no.2 , pp.237-242 , 2007 . 26 Syed Monowar Hossain and Md. Hai",
  "content_length": 19845,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:54"
}