{
  "name": "Md. Endadul Hoque",
  "homepage": "https://users.cs.fiu.edu/~ehoque",
  "status": "success",
  "content": "Endadul Hoque - Syracuse University About Me I am an Assistant Professor in the Department of Electrical Engineering and Computer Science at Syracuse University (SU). I am leading the SYNE lab. Before joining SU, I was an Assistant Professor in the School of Computing and Information Sciences at Florida International University (FIU) . I received my Ph.D. in Computer Science from from the Department of Computer Science at Purdue University under the supervision of Prof. Cristina Nita-Rotaru in 2015. During 2016, I was a Postdoctoral Research Associate at Northeastern University (Host: Prof. Cristina Nita-Rotaru). Academic positions Education Awards and Grants Announcements Fall 2024 I am currently looking for motivated graduate students for PhD positions (applicants with an MS degree is preferred) and undergraduate students who are interested in security of computer networks and systems, IoT security, vulnerability detection, and program analysis. If interested, please contact me through email. Latest News Apr 2025 Received Best Paper Award for our FuzzEval paper at 18th Intl. Workshop on Search-Based and Fuzz Testing (SBFT 2025), co-located with IEEE/ACM ICSE 2025 Aug 2024 Our paper \"iConPAL\" will appear in IEEE SecDev 2024 Apr 2024 Received the NSF CAREER Award Context-Sensitive Fuzzing for Networked Systems. Thanks NSF! Aug 2023 Our paper \"VetIoT\" will appear in IEEE CNS 2023 May 2023 Our paper \"Maverick\" has been published in ACM WiSec 2023 Mar 2023 Congratulations to Akib Nafis for winning the 2nd place in the Oral Presentation Competition at 2023 ECS Research Day Apr 2022 Received Google Research Scholar Award 2022 Nov 2021 Two papers published in ACM CCS 2021 Aug 2020 Our project Retrofitting IoT Ecosystems with a Software-defined Overlay to Enforce Safety, Security, and Privacy Policies (in collaboration with Omar Chowdhury) has been funded under the NSF CNS Core program. Thanks NSF! Jul 2019 I will join EECS@Syracuse as an Assistant Professor from Fall 2019 Feb 2018 Received Cisco Network Security Distinguished Paper Award for our TCPwn paper at NDSS 2018 (one of the top security conferences) Oct 2017 Our paper \"TCPwn\" has been accepted in NDSS 2018 (one of the top security conferences) Our paper titled \"Automated Attack Discovery in TCP Congestion Control Using a Model-guided Approach\" has been accepted at NDSS Symposium 2018. Many congratulations to Samuel Jero and the rest of the team. We received excellent reviews; here is an excerpt: \"This is a really cool paper -- One of those that make you wish you had thought of the idea! It takes a classical problem and presents a refreshing new take on it [...]\" Oct 2017 Our SymCerts paper has been selected as a finalist for the CSAW’17 Applied Research Competition Mar 2017 Our paper \"CHIRON\" has been accepted in DSN 2017 Our paper titled \"Analyzing Operational Behavior of Stateful Protocol Implementations for Detecting Semantic Bugs\" has been accepted at IEEE/IFIP International Conference on Dependable Systems and Networks (DSN) 2017. Many congratulations to Sze Yiu Chau and Omar Chowdhury Feb 2017 Our paper \"SymCerts\" has been accepted in IEEE S&P 2017 (the top security conference, also known as Oakland) Our paper titled \"SymCerts: Practical Symbolic Execution For Exposing Noncompliance in X.509 Certificate Validation Implementations\" has been accepted at IEEE Symposium on Security and Privacy (S&P) 2017. [Acceptance rate: 13%] Many congratulations to Sze Yiu Chau and Omar Chowdhury Positions 2019 present Assistant professor Syracuse University 2017 2019 Assistant professor Florida International University 2016 2017 Postdoctoral Research Associate Northeastern University Close window Education 2015 PhD in Computer Science Dept. of Computer Science Purdue University 2010 MS in Computer Science Dept. of MSCS Marquette University 2008 BSc in Computer Science and Engineering Dept. of Computer Science and Engineering Bangladesh University of Engineering and Technology (BUET) Close window Awards and Grants Awards Apr 2025 Received Best Paper Award for our FuzzEval paper at 18th Intl. Workshop on Search-Based and Fuzz Testing (SBFT 2025), co-located with IEEE/ACM ICSE 2025 Apr 2024 Received NSF CAREER Award for Context-Sensitive Fuzzing for Networked Systems. Apr 2022 Received Google Research Scholar Award Feb 2018 Received Cisco Network Security Distinguished Paper Award for our TCPwn paper at NDSS 2018 (one of the top security conferences) Mar 2015 Bilsland Dissertation Fellowship Award in 2015 from the Graduate School at Purdue University for outstanding academic record About this award: The Bilsland Dissertation Fellowship provides support to outstanding Ph.D. candidates in their final year of doctoral degree completion. Bilsland Fellows are expected to devote full-time effort to the completion of all doctoral degree requirements to receive the doctoral degree at the conclusion of the fellowship tenure. April 2014 Graduate Teaching Fellowship award in 2014 from Dept. of Computer Science at Purdue University Grants Jul 2024 The project Context-Sensitive Fuzzing for Networked Systems has been funded under the NSF CAREER program. Thanks NSF! Aug 2020 Our project Retrofitting IoT Ecosystems with a Software-defined Overlay to Enforce Safety, Security, and Privacy Policies (in collaboration with Omar Chowdhury) has been funded under the NSF CNS Core program. Thanks NSF! Close window Research My research is highly concentrated on cybersecurity, particularly at the intersection of computer networks, systems, and security. Within this broad domain, my particular emphasis is on automated detection of vulnerabilities as well as creating resilient, user-friendly defenses. My work spans several areas of computing, including network communication protocols, operating systems, distributed systems, Internet-of-Things (IoT) systems, and embedded devices. I often draw inspiration from automated reasoning techniques such as SMT solving and model checking, as well as methods in runtime verification, program analysis, and software engineering, including symbolic execution and fuzz testing. Recently, I am also interested in developing LLM-driven security analysis techniques as well as creating automated techniques to improve the robustness of LLMs. For more information, please visit the SYNE lab. Publications For full publication list, click Latest Publications SeQR: A User-Friendly and Secure-by-Design Configurator for Enterprise Wi-Fi S Mahmudul Hasan, Che Wei Tu, Endadul Hoque, Omar Chowdhury, and Sze Yiu Chau Conference ACM CHI Conference on Human Factors in Computing Systems (CHI), Yokohama, Japan, April 2025. On Evaluating Fuzzers with Context-Sensitive Fuzzed Inputs: A Case Study on PKCS#1-v1.5 S Mahmudul Hasan, Polina Kozyreva, and Endadul Hoque Workshop 8th International Workshop on Search-Based and Fuzz Testing (SBFT 2025), co-located with IEEE/ACM International Conference on Software Engineering (ICSE 2025), Ottawa, Ontario, Canada, April 2025. Best Paper Award iConPAL: LLM-guided Policy Authoring Assistant for Configuring IoT Defenses Mahbub Alam, Siwei Zhang, Eric Rodriguez, Akib Nafis, and Endadul Hoque Conference IEEE Secure Development Conference (SecDev), PA USA, Oct 2024. VetIoT: On Vetting IoT Defenses Enforcing Policies at Runtime Akib Jawad Nafis, Omar Chowdhury, and Endadul Hoque Conference IEEE Conference on Communications and Network Security (CNS), FL USA, Oct 2023. Maverick: An App-independent and Platform-agnostic Approach to Enforce Policies in IoT Systems at Runtime M. Hammad Mazhar, Li Li, Endadul Hoque, and Omar Chowdhury Conference ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec), United Kindom, May 2023. All your Credentials are Belong to Us: On Insecure WPA2-Enterprise Configurations Man Hong Hue, Joyanta Debnath, Kin Man Leung, Li Li, Mohsen Minaei, M. Hammad Mazhar, Kailiang Xian, Endadul Hoque, Omar Chowdhury, and Sze Yiu Chau Conference ACM SIGSAC Conference on Computer and Communications Security (CCS), Korea, Nov 2021. Morpheus: Bringing The (PKCS) One To Meet the Oracle Moosa Yahyazadeh, Sze Yiu Chau, Li Li, Man Hong Hue, Joyanta Debnath, Sheung Chiu Ip, Li Chun Ngai, Endadul Hoque, and Omar Chowdhury Conference ACM SIGSAC Conference on Computer and Communications Security (CCS), Korea, Nov 2021. PatrIoT: Policy Assisted Resilient Programmable IoT System Moosa Yahyazadeh, Syed Rafiul Hussain, Endadul Hoque, and Omar Chowdhury Conference International Conference on Runtime verification (RV), Los Angeles, CA, USA, Oct 2020. aBBRate: Automating BBR Attack Exploration Using a Model-Based Approach Anthony Peterson, Samuel Jero, Endadul Hoque, Dave Choffnes, and Cristina Nita-Rotaru Conference International Symposium on Research in Attacks, Intrusions and Defenses (RAID), San Sebastian, Spain, Oct 2020. A Formal Security Analysis of ZigBee (1.0 and 3.0) Li Li, Proyash Podder, and Endadul Hoque Conference Hot Topics in the Science of Security Symposium (HotSoS), Lawrence, KS, USA, Sep 2020. Expat: Expectation-based Policy Analysis and Enforcement for Appified Smart-Home Platforms. Moosa Yahyazadeh, Proyash Podder, Endadul Hoque, and Omar Chowdhury Conference ACM Symposium on Access Control Models and Technologies (SACMAT), Toronto, ON, Canada, Jun 2019. This paper focuses on developing a security mechanism geared towards appified smart-home platforms. Such platforms often expose programming interfaces for developing automation apps that mechanize different tasks among smart sensors and actuators (e.g., automatically turning on the AC when the room temperature is above 80 F). Due to the lack of effective access control mechanisms, these automation apps can not only have unrestricted access to the user's sensitive information (e.g., the user is not at home) but also violate user expectations by performing undesired actions. As users often obtain these apps from unvetted sources, a malicious app can wreak havoc on a sma",
  "content_length": 33463,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:55"
}