{
  "name": "Md. Abdur Razzaque",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1768",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Md. Abdur Razzaque (Professor & Chairman) Department of Computer Science and Engineering Research Group Research Profile Personal Website & CV Short Biography: Md. Abdur Razzaque (M'08, SM'12) is a Professor of the Dept. of Computer Science and Engineering, University of Dhaka and he is the current chairman of the Department. He chaired 2021 and 2020 Executive Committees for IEEE Computer Society Bangladesh Chapter. He received his BS in Applied Physics and Electronics ... Show more Md. Abdur Razzaque (M'08, SM'12) is a Professor of the Dept. of Computer Science and Engineering, University of Dhaka and he is the current chairman of the Department. He chaired 2021 and 2020 Executive Committees for IEEE Computer Society Bangladesh Chapter. He received his BS in Applied Physics and Electronics and MS in Computer Science from University of Dhaka, Bangladesh in 1995 and 1996, respectively. He obtained a PhD in Computer Engineering from Kyung Hee University, South Korea in 2009. He worked for Green University of Bangladesh for different periods as Pro Vice Chancellor, Dean of Faculty of Science and Engineering and Chairperson, Dept of CSE during 2016-2021. He was a research professor at Kyung Hee University, South Korea during 2010-2011. He worked as a visiting professor in Stratford University, Virginia, USA in 2017. He is the director of Green Networking Research Group of the Dept. of CSE, DU. He has been promoting Outcome Based Education for Science and Engineering Faculties of leading universities of the country. He lead many national and international funded research projects. His research interest is in the area of modeling, analysis and optimization of wireless networking protocols and architectures, Mobile Crowdsourcing, Sensor Data Clouds, Internet of Things, Edge Computing, etc. He has published 190+ research papers in peer-reviewed conferences and journals. He has been recognized as the top 2% scientists of the world (2025), published by Stanford University and Elsevier. He is offering editorial services to reputed journals and contributing to numerous international conferences at different capacities. He is a senior member of IEEE, member of IEEE Computer Society, Internet Society (ISOC), etc. Show less Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Computer Engineering Kyung Hee University South Korea 2009 Masters Computer Science University of Dhaka Bangladesh 1996 Bachelor Applied Physics and Electronics University of Dhaka Bangladesh 1995 Title Organization Location From Date To Date Chairman University of Dhaka Department of Computer Science and Engineering 19, Feb 2024 Currently Working Pro Vice Chancellor Green University of Bangladesh Dhaka, Bangladesh 01, Oct 2019 20-09-2021 Dean, Faculty of Science & Engineering Green University of Bangladesh Dhaka, Bangladesh 10, Jan 2019 20-09-2021 Visiting Professor Stratford University Falls Church Campus, Virginia, USA 06, Jan 2017 17-03-2017 Chairman Department of Computer Science and Engineering, Green University of Bangladesh Dhaka, Bangladesh 21, Sep 2016 30-09-2019 Professor Department of Computer Science and Engineering, University of Dhaka Dhaka, Bangladesh 27, Oct 2014 Currently Working Associate Professor Department of Computer Science and Engineering, University of Dhaka Dhaka, Bangladesh 14, Jan 2012 26-10-2014 Research Professor Kyung Hee University South Korea 01, Feb 2010 31-01-2011 Post Doctoral Fellow Kyung Hee University South Korea 01, Sep 2009 31-01-2010 Assistant Professor Department of Computer Science and Engineering, University of Dhaka Dhaka, Bangladesh 26, Sep 2005 13-01-2012 Lecturer Department of Computer Science and Engineering, University of Dhaka Dhaka, Bangladesh 26, Apr 2004 25-09-2005 Lecturer Department of Computer Science and Information Technology, Islamic University of Technology Board Bazar, Gazipur, Bangladesh 22, Jan 2001 25-04-2004 IT Lecturer Australasia Institute of Business and Technology, Dhaka, Bangladesh. 15, May 2000 21-01-2001 Research Interest Subject Description Research Interest (Goal, Target Indicator) Green Networking and Sustainable Internet Energy Optimization AI and ML in UAV Networks AI for Internet of Things Edge Intelligence Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Ph.D. An Efficient Worker Selection and Task Allocation Scheme for Mobile Crowdsourcing System Prof. Dr. Md. Abdur Razzaque Farhan Huq Mobile Crowdsourcing System 2025 Ph.D. Quality of Service Aware Data Delivery Protocol in Narrowband Internet of Things Enabled Healthcare Systems Prof. Dr. Md. Abdur Razzaque Prof. Dr. Md. Mustafizur Rahman Nahar Sultana Narrow Band Internet of Things for Healthcare Applications 2025 Ph.D. Lifetime Maximization of Sensor Networks Through Optimal Data Collection Scheduling of Mobile Sink Prof. Dr. Md. Abdur Razzaque Prof. Dr. Md. Mamun-Or-Rashid Dr. Md. Ahsan Habib Tareque Lifetime Maximization of Wireless Sensor Network 2022 Ph.D. Quality-of-Experience-Aware Incentive Mechanism for Workers in Mobile Device Cloud Prof. Dr. Md. Abdur Razzaque Prof. Dr. Md. Mustafizur Rahman Dr. Sajeeb Saha Incentive Aware Code Offloading in Mobile Device Cloud 2021 Ph.D. Maximizing Coverage Quality Using Minimum Number of Nodes in Clustered Directional Sensor Networks Prof. Dr. Md. Abdur Razzaque Prof. Dr. Md. Mustafizur Rahman Dr. Selina Sharmin Directional Sensor Network 2018 Ph.D. Collaborative neighbor discovery in directional wireless sensor networks: algorithm and analysis Prof. Dr. Md. Abdur Razzaque Dr. Fernaz Narin Nur Directional Sensor Networks 2018 Ph.D. Congestion and Rate Control Issues in Wireless Mesh Networks Prof. Dr. Md. Abdur Razzaque Prof. Dr. Md. Mamun-Or-Rashid Dr. Maheen Islam Wireless Mesh Networks 2017 Ph.D. Deep Learning Enabled Semantic Communication for Reliable Text Transmission Md. Abdur Razzaque Md. Mustafizur Rahman Sumaiya Kabir Semantic Communication Current Year Masters Dynamic Task Prioritization and Fair Resource Allocation in Vehicular Edge Computing Md. Abdur Razzaque Shabab Murshed Internet of Vehicles 2025 Masters Digital Twin Edge Network Intelligence Prof. Dr. Md. Abdur Razzaque Sadia Jahangir Safa Digital Twin 2025 Masters Mobile Crowdsourcing Applications Prof. Dr. Md. Abdur Razzaque Md. Tanvir Arafat Data Distribution Aware Parallel Split Learning for Healthcare Applications 2024 Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration Consultant Design and Development of Precision Agriculture Information System Using Sensor Data Cloud King Abdul Aziz University, KSA 30-06-2019 31-10-2021 Dr. Mostafa Monowar Consultant Mitigating Road Accidents in Kingdom of Saudi Arabia Using Sensor Data Cloud Technologies King Saud University 01-06-2019 31-12-2021 Dr. Mehedi Hasan Principal Investigator Information and Communication Technology Assisted Safe Driving for Mitigating Road Accidents in Bangladesh Ministry of Post, Tel & ICT of Bangladesh 01-07-2014 30-06-2015 NA Principal Investigator Development of Efficient Algorithms for Stemming in Bengali Code Crafters International 01-09-2013 28-02-2014 NA Principal Investigator Driver Distraction Management Using Sensor Data Cloud ISIF, Brisbane, Australia 01-07-2013 30-06-2014 NA Principal Investigator Real Time Detection of Crop Diseases and Pests Using Image Sensor Network Technology Ministry of Science and Technology, GoB 01-07-2013 30-06-2014 NA Principal Investigator Design and Development of Precision Agriculture Information System for Bangladesh Ministry of Science and Technology, GoB 01-07-2012 30-06-2013 NA Project Director Reducing Energy Costs in Mobile Cellular Networks” – Funded by University Grants Commission, Bangladesh UGC, Bangladesh 01-07-2010 30-06-2011 NA Invited Talk SL Invited Talk 1 Presented a Keynote talk on “Introduction to Outcome Based Education (OBE) and Curriculum Design” in Jagannath University, Dhaka, 11 September 2025. 2 Presented a Keynote speech on “How to Write a Funded Research Project Proposal” in Bangladesh University of Business and Technology (BUBT), Mirpur, Dhaka, 28 August 2025. 3 Presented a Keynote speech on “Effective Use of AI Tools in Teaching Learning and Research” in Jagannath University, Dhaka, 25 June 2025. 4 Presented an invited talk on “Cross Regional Online Food Delivery: Optimizing User QoE and Rider Incentives”, in School of Computing, Engineering, and Technologies, Teesside University, United Kingdom, 23 May 2025. 5 Presented a keynote talk on “Quality of Service Aware Data Collection in Smart Healthcare Systems”, in IEEE Computer Society Bangladesh Chapter Winter Symposium, Dhaka, Bangladesh, 22-23 Dec 2024. 6 Presented a keynote talk on “Cross Regional Online Food Delivery: Challenges and Opportunities\", in IEEE International Conference on Machine Intelligence and Emerging Technologies, Noakhali Science and Technology University, Bangladesh, 8-9 Nov 2024. 7 Presented a keynote talk on “Parallel Split Learning for Healthcare Applications”, IEEE Conference on Computing, Applications, and Systems, CUET, Chittagong, Bangladesh, 25-26 Sep 2024. 8 Presented an invited talk on “Industry 5.0: Towards a sustainable, human-centric and resilient industry”, Faculty of Engineering, Dhaka University of Engineering and Technology (DUET), Dhaka, Bangladesh, 11 June 2024. 9 Presented a keynote on “Quality of Service-Aware Execution of Big Data Tasks in Smart City Applications”, BCSIR Conference, Dhaka, Bangladesh, 1-3 December 2022. 10 Presented a keynote on “Quality of Service-Aware Execution of Big Data Tasks in Smart City Applications”, BCSIR Conference, Dhaka, Bangladesh, 1-3 December 2022. SL Collaboration & Member",
  "content_length": 21209,
  "method": "requests",
  "crawl_time": "2025-12-01 13:56:54"
}