{
  "name": "Megan Kelly Hofmann",
  "homepage": "https://www.khoury.northeastern.edu/people/megan-hofmann",
  "status": "success",
  "content": "Megan Hofmann - Khoury College of Computer Sciences All People Megan Hofmann Assistant Professor, Jointly Appointed with College of Engineering Research interests Research interests Human–computer interaction Personal health informatics Accessibility Digital fabrication Education Education PhD in Human–Computer Interaction, Carnegie Mellon University MS in Human–Computer Interaction, Carnegie Mellon University BS in Computer Science, Colorado State University Biography Biography Megan Hofmann is an assistant professor in the Khoury College of Computer Sciences and the College of Engineering at Northeastern University, based in Boston. Hofmann teaches accessibility for people with disabilities, human–computer interaction, digital fabrication, and rapid prototyping methods. Her research areas include human–computer interaction and personal health informatics. Hofmann has published in and presented at CHI, UIST, ASSETS, and CSCW and has received multiple awards, including MIT EECS Rising Star, Siebel Fellow, CMLH Fellow, NSF GRFP Fellow, ACM SIGCHI CHI Conference best paper awards and honorable Mentions, and an ACM SIGACCESS Assets Conference best paper award. Labs and groups Labs and groups ACT (Accessible Creative Technologies) Lab Recent publications Recent publications Published: September 27, 2025 QUILT: Supporting Modular Design of Machine-Knitting Programs Citation: Jack Hester, Sebastian Law, Megan Hofmann. (2025). QUILT: Supporting Modular Design of Machine-Knitting Programs UIST, 101:1-101:26. https://doi.org/10.1145/3746059.3747608 Published: October 11, 2024 KODA: Knit-program Optimization by Dependency Analysis Citation: Megan Hofmann. (2024). KODA: Knit-program Optimization by Dependency Analysis UIST, 64:1-64:15. https://doi.org/10.1145/3654777.3676405 Published: April 29, 2022 Maptimizer: Using Optimization to Tailor Tactile Maps to Users Needs Citation: Megan Hofmann, Kelly Mack, Jessica Birchfield, Jerry Cao, Autumn G Hughes, Shriya Kurpad, Kathryn J Lum, Emily Warnock, Anat Caspi, Scott E Hudson, and Jennifer Mankoff. (2022). \"Maptimizer: Using Optimization to Tailor Tactile Maps to Users Needs\". In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI '22). Association for Computing Machinery, New York, NY, USA, Article 592, 1–15. DOI: 10.1145/3491102.3517436 Published: April 7, 2022 Making a Medical Maker’s Playbook: An Ethnographic Study of Safety-Critical Collective Design by Makers in Response to COVID-19 Citation: Megan Hofmann, Udaya Lakshmi, Kelly Mack, Rosa I. Arriaga, Scott E. Hudson, and Jennifer Mankoff. (2022). \"Making a Medical Maker's Playbook: An Ethnographic Study of Safety-Critical Collective Design by Makers in Response to COVID-19\". Proc. ACM Hum.-Comput. Interact. 6, CSCW1, Article 101 (April 2022), 26 pages. DOI: 10.1145/3512948 Published: May 7, 2021 The Right to Help and the Right Help: Fostering and Regulating Collective Action in a Medical Making Reaction to COVID-19 Citation: Megan Hofmann, Udaya Lakshmi, Kelly Mack, Scott E Hudson, Rosa I. Arriaga, and Jennifer Mankoff. (2021). \"The Right to Help and the Right Help: Fostering and Regulating Collective Action in a Medical Making Reaction to COVID-19\". In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI '21). Association for Computing Machinery, New York, NY, USA, Article 654, 1–13. DOI: 10.1145/3411764.3445707 Published: October 29, 2020 Living Disability Theory: Reflections on Access, Research, and Design Citation: Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L Bennett. (2020). \"Living Disability Theory: Reflections on Access, Research, and Design\". In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '20). Association for Computing Machinery, New York, NY, USA, Article 4, 1–13. DOI: 10.1145/3373625.3416996 Published: October 20, 2020 KnitGIST: A Programming Synthesis Toolkit for Generating Functional Machine-Knitting Textures Citation: Megan Hofmann, Jennifer Mankoff, and Scott E. Hudson. (2020). \"KnitGIST: A Programming Synthesis Toolkit for Generating Functional Machine-Knitting Textures\". In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (UIST '20). Association for Computing Machinery, New York, NY, USA, 1234–1247. DOI: 10.1145/3379337.3415590 Published: November 7, 2019 “Point-of-Care Manufacturing”: Maker Perspectives on Digital Fabrication in Medical Practice Citation: Udaya Lakshmi, Megan Hofmann, Stephanie Valencia, Lauren Wilcox, Jennifer Mankoff, and Rosa I. Arriaga. (2019). \"'Point-of-Care Manufacturing': Maker Perspectives on Digital Fabrication in Medical Practice\". Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 91 (November 2019), 23 pages. DOI: 10.1145/3359193 Published: October 17, 2019 KnitPicking Textures: Programming and Modifying Complex Knitted Textures for Machine and Hand Knitting Citation: Megan Hofmann, Lea Albaugh, Ticha Sethapakadi, Jessica Hodgins, Scott E. Hudson, James McCann, and Jennifer Mankoff. (2019). \"KnitPicking Textures: Programming and Modifying Complex Knitted Textures for Machine and Hand Knitting\". In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST '19). Association for Computing Machinery, New York, NY, USA, 5–16. DOI: 10.1145/3332165.3347886 Published: May 2, 2019 “Occupational Therapy is Making”: Clinical Rapid Prototyping and Digital Fabrication Citation: Megan Hofmann, Kristin Williams, Toni Kaplan, Stephanie Valencia, Gabriella Hann, Scott E. Hudson, Jennifer Mankoff, and Patrick Carrington. (2019). \"'Occupational Therapy is Making': Clinical Rapid Prototyping and Digital Fabrication\". In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 314, 1–13. DOI: 10.1145/3290605.3300544 Published: April 21, 2019 Greater than the Sum of its PARTs: Expressing and Reusing Design Intent in 3D Models Citation: Megan Hofmann, Gabriella Hann, Scott E. Hudson, and Jennifer Mankoff. (2018). \"Greater than the Sum of its PARTs: Expressing and Reusing Design Intent in 3D Models\". In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Paper 301, 1–12. DOI: 10.1145/3173574.3173875 Published: May 7, 2016 Helping Hands: Requirements for a Prototyping Methodology for Upper-limb Prosthetics Users Citation: Megan Hofmann, Jeffrey Harris, Scott E. Hudson, and Jennifer Mankoff. (2016). \"Helping Hands: Requirements for a Prototyping Methodology for Upper-limb Prosthetics Users\". In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). Association for Computing Machinery, New York, NY, USA, 1769–1780. DOI: 10.1145/2858036.2858340 Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://www.megan-hofmann.com/ Google Scholar See Citations Areas of Interest Human-Centered Computing Robotics Contact m.hofmann@northeastern.edu Related news CHI 2025: Khoury researchers publish record-high papers for second straight year April 22, 2025 NGN: A Northeastern dean wore an AI-knitted shawl to her Academy of Arts and Sciences induction. Here’s the story behind its creation October 24, 2024 The programming behind machine-powered knitting is getting a much-needed rewrite January 17, 2024 Explore all news Current PhD students Amanda Shayna Ahteck PhD Student Read bio Locations Close this dialog window Boston John Hester PhD Student Read bio Locations Close this dialog window Boston Jay Rodolitz PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 7735,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:02"
}