{
  "name": "Megumi Kaneko",
  "homepage": "http://research.nii.ac.jp/~megkaneko",
  "status": "success",
  "content": "Megumi Kaneko - Professor at National Institute of Informatics, Japan About me I am a Professor at the National Institute of Informatics (NII), at the University of Tokyo, Dept. of Computer Science, and at the Graduate Institute for Advanced Studies (Sokendai), in Tokyo, Japan (photo left corner: NIIâs mascot). I am a Senior Member of IEEE and serving as a Senior Editor of IEEE Communications Letters, and as Associate Editor for IEEE Transactions on Wireless Communications and IEEE Wireless Communications Letters. I received the IEEE Communications Letters Exemplary Editor distinction in December 2020. On September 1st 2020, I was nominated as a Member of the Advisory Board for Promoting Science and Technology Diplomacy, at the Ministry of Foreign Affairs of Japan (MOFA). Currently, my main research interests are: 5G and Beyond radio access design (Terahertz and mmWave networks, RIS networks, drone networks), Machine learning-based spectrum and energy resource allocation optimization, Machine-to-Machine (M2M) and Internet of Things (IoT) communications (LPWAN, LoRa), Integrated terrestrial-satellite communication systems (LR-FHSS), Energy-efficiency of wireless communication systems. News Jan. 2025 Appointed as a Senior Editor of IEEE Communications Letters (Wireless Networks I). Oct. 2024 Appointed Professor (jointly with my current position at NII) at the Department of Computer Science, The University of Tokyo April 2024 Appointed Full Professor, Information Systems Architecture Science Research Division, NII Dec. 2023 Our large-scale international project JST ASPIRE for future communications, for which I am serving as one of the main collaborators, has been accepted: “Open Digital Infrastructure through the Convergence of Telecommunications and AI” (PIs: Prof. H. Esaki at the University of Tokyo, Prof. T. Taleb at Oulu University in Finland, main members from UTokyo, NII, UEC, TUS, Aalto Univ., VTT Finland, Univ. Murcia, Politec. Valencia,IMT Atlantique, Paris-Saclay Univ., Univ. Clermont Auvergne, Univ. Roma, Nova Univ. Lisbon, 2024-2028). Nov. 2023 Our Japan-France bilateral project JST/ANR SICORP Edge AI project for which I am serving as PI on Japan side, has been accepted: LIGHT-SWIFT project (LIGHTweight edge artificial intelligence for Sensing and WIreless communications in connected FacTories), 2023-2027, JP members: NII and NTT, FR members: CNRS/IRISA (PI on French side : Prof. Olivier Berder), Wavely. July 2023 Our paper “User Grouping and Switch Network Optimization for Energy-Efficient Multi-User Terahertz Communications”, authored by Jiali Wang and M. Kaneko, has been accepted in IEEE Globecom 2023, Kuala Lumpur, Malaysia. 10 July 2023 I gave an invited talk at the University of Tokyo, Graduate School of Information Science and Technology (Colloquium on Mathematical Informatics), “Spectrum and Energy Efficiency Optimization for Next Generation Wireless Communications Systems”. 17 June 2023 I gave an invited seminar at Kyoyukai Association (diffusion of scientific knowledge to broad public), “5G and Beyond 5G for Future Society”. 3 Feb. 2023 I gave an invited talk at Keio University, Faculty of Science and Technology, “Spectrum- and Energy Efficiency Optimization for Next Generation Wireless Communication Systems”. Jan. 2023 Our paper “An Auction-based Assignment Method for LoRa Multi-Gateway Networks”, authored by J.T. Chen, M. Kaneko, A. Guitton (Clermont-Auvergne University, France), has been accepted in IEEE ICC 2023, Rome, Italy. Jan. 2023 Our paper “Deep Reinforcement Learning-based Uplink Power Control in Cell-Free Massive MIMOâ, authored by X. Zhang, M. Kaneko, V.A. Le, Y. Ji (NII), has been awarded The Best Paper Runner-Up Award at IEEE CCNC 2023 (2nd among 271). Oct. 2022 Our Kakenhi Project for International Collaboration Kokusai B, funded by the Ministry of Education, Culture, Sports, Science and Technology (MEXT), has been accepted (ç§ç è²» å½éå ±åç ç©¶å¼·å(B), 2022-2027, PI: M. Kaneko) Sept. 2022 Thi Ha Ly Dinh successfully defended her Ph.D. at Sokendai, congratulations! She started as a lecturer at Hanoi University of Science and Technology (HUST) in October 2022. Links NIIâs homepage Sokendaiâs homepage My NII general homepage (English) My NII general homepage (Japanese)",
  "content_length": 4298,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:01"
}