{
  "name": "Mehdi Tarrit Mirakhorli",
  "homepage": "https://mehdimirakhorli.github.io",
  "status": "success",
  "content": "Mehdi Tarrit Mirakhorli | Contact Me Personal Web page of Mehdi Tarrit Mirakhorli Mehdi Tarrit Mirakhorli Professor | Director of Indo-Pacific Cybersecurity & Software Assurance Laboratory University of Hawaii at Manoa | Information and Computer Sciences (ICS) 1680 East-West Road Honolulu, HI 96822 USA Email: mehdi23 -at- Hawaii.edu Home Curriculum Vitae Publications Research Projects Teaching Personal Mehdi Tarrit Mirakhorli is a full professor in the department of Information and Computer Sciences at University of Hawaii at Manoa. Prior to that Dr. Mirakhorli served as Kodak Endowed Chair, Associate Professor and Director of Research at ESL Global Cybersecurity Institute and Software Engineering Department at Rochester Institute of Technology. Mirakhorli is also the director of Software Assurance Laboratory. His research is the broad area of software engineering, he has carried out various projects of national importance in the areas of trustworthy software, software assurance, cybersecurity, AI, scientific software development, and software enabled sustainable disposal. Additionally, Dr. Mirakhorli has supported the implementation of the White House Executive Order on Improving the Nation’s Cybersecurity. His team has developed techniques based on program analysis, software verification and custom artificial intelligence, machine learning algorithms to solve software engineering problems at scale in the areas such as software architecture analysis, requirements engineering, software security, software compliance and verification, and source code comprehension. Mirakhorli has led several large fundamental research and technology transition projects with the Department of Defense, U.S. Air Force, U.S. Department of Homeland Security and National Science Foundation (NSF). He has more than a decade of experience as a software architect and tech-lead on large, complex and multi-stakeholder projects such as AI-enabled automation, cyber-threats and intelligence, data-intensive meteorological systems, and health care. In 2017, he has worked at the Air Force Research Laboratory as a faculty fellow. Currently, he serves on the advisory board of two leading software companies in the technology development sector. Mirakhorli is a recipient of the NSF CAREER Award. His paper \"A Tactic-Centric Approach for Automating Traceability of Quality Concerns\" received ACM SIGSOFT Distinguished Paper Award at ICSE'2012. Mirakhorli's paper \"Understanding Software Vulnerabilities Related to Architectural Security Tactics: An Empirical Investigation of Chromium, PHP and Thunderbird\" received the Best Paper Award at the 2017 IEEE International Conference on Software Architecture. Mirakhorli served as associated editor for IEEE Transaction on Software Engineering (TSE) and Empirical Software Engineering (EMSE) Journals. He is a public speaker in the area of software architecture and application security. He is also an ACM Distinguished Speaker, has been ALTA Distinguished Speaker at Alcatel-Lucent, and given several technical briefings. Last Updated February 1st, 2018  | 2018 © copyright <div class=\"statcounter\"><a title=\"free web stats\" href=\"http://statcounter.com/free-web-stats/\" target=\"_blank\"><img class=\"statcounter\" src=\"http://c.statcounter.com/9623175/0/9028568b/1/\" alt=\"free web stats\"></a></div>",
  "content_length": 3341,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:02"
}