{
  "name": "Mehdi Kharrazi",
  "homepage": "http://sharif.edu/~kharrazi",
  "status": "success",
  "content": "I am an associate professor with the department of Computer Science and Engineering at Sharif University of Technology. I obtained my B.E. in Electrical Engineering from the City College of New York in 1999, and my M.S. and Ph.D. in Electrical Engineering from the Polytechnic University, Brooklyn, New York, in 2002 and 2006 respectively. Before joining Sharif University I was at at&t labs. My current research interests are in computer and system security and I am currently the Director of S4 Lab. Student Supervision: I am always looking for motivated students with a strong background to work with. If you are interested drop me an email. For PhD, students from the Software group are mainly considered for supervision, but students from other groups could potentially be accepted as well, for MS and BS, students from all groups are considered.Recommendation Letter: I get asked a lot if I am willing to write a recommendation letter. Please read this before asking me to write you one!Quick Links:   Projects   Services   Courses   Publications   Talks   StudentsProjects:You could follow up on our open source projects here.Experience/Services and University Positions:Director, S4 Lab [2017-Present].Director, Co-Op Program, Sharif University of Technology [2019-Present] Associate Editor, ACM Computing Surveys [2019-Present]Vice Chair for Research and Int. Affairs, Department of Computer Engineering [2019-2021]Director, IT Center, Sharif University of Technology [2015-2017].Co-Director, DNS Lab [2010-2017].\"Data\" Talks: I managed the bi-weekly \"Data\" talks at the department from 1398 to 1399. You could find a partial list of talks here.Courses:CE 40-815 Secure Software Systems [F04]CE 40-441 Data & Network Security [course material on CW] Previous Semesters:CE 40-442/40-441 Data & Network Security [F90Kish]  [S96]  [F96]  [F97]  [F98]  [F99]  [F00]  [F01]  [S01]  [S02]CE 40-815 Secure Software Systems   [S98]  [F98]  [F99]  [F00]  [F01]  [F02]  [F03]CE 40-876 Information Security Eng. and Mng. [S00]  [S01]  [S02]  [S03]CE 40-424 Operating Systems   [F96]  [F97]  [S99]  [S00]  [S01]  [S02]CE 40-443 Computer Networks [F87]  [88]  [89]  [90]  [91]  [92]  [93]  [S94]  [95]  [S96]   [S97]  [S98]CE 40-817 Advanced Network Security [F87]  [S88]  [S89]  [S90]   [F90Kish]   [S91]   [92]   [93]  [F94]CE 40-693 Advanced Computer Networks [F88]  [F89]   [F90]   [F91]CE 40-416 Computer Networks Lab [F89]  [S90]  [F90]   [S91]Publications:    Journal:VulSlicer: Vulnerability Detection Through Code Slicing, S. Salimi, M. Kharrazi, Journal of Systems and Software, 2022.Blue-Pill Oxpecker: a VMI Platform for Transactional Modification, S. M. AghamirMohammadAli, B. Momeni, S. Salimi, M. Kharrazi, IEEE Transactions on Cloud Computing, 2021.Twinner: A Framework for Automated Software Deobfuscation, B. Momeni, M. Kharrazi, Scientia Iranica, Transactions D: Computer Science & Engineering and Electrical Engineering, 2019.LDMBL: An Architecture for Reducing Code Duplication in Heavy Weight Binary Instrumentations, B. Momeni, M. Kharrazi, Software: Practice and Experience, 2018.Partov: A Network Simulation and Emulation Tool, B. Momeni, M. Kharrazi, Journal of Simulation, 2016.Detection of Fast-Flux Botnets Through DNS Traffic Analysis, E. Soltanaghaei, M. Kharrazi, Scientia Iranica, Transactions D: Computer Science & Engineering and Electrical Engineering, 2015.A Composite-Metric Based Path Selection Technique for the Tor Anonymity Network, S. Momeni Milajerdi, M. Kharrazi, Journal of Systems and Software, 2015.Back to Static Analysis for Kernel-Level Rootkit Detection, S.A. Musavi, M. Kharrazi, IEEE Transactions on Information Forensics and Security, 2014.Payload Attribution via Character Dependent Multi-Bloom Filters, M.H. Haghighat, M. Tavakoli, M. Kharrazi, IEEE Transactions on Information Forensics and Security, Volume 8, Issue 5, 2013.[BibTex]Improving Computer Networks Course Using the Partov Simulation Engine, B. Momeni, M. Kharrazi, IEEE Transactions on Education, Volume 55, Issue 3, August 2012.[BibTex]The partov source code is being released under GPLv3. If you are interested in obtaining the code, please contact me.Performance Study of Common Image Steganography and Steganalysis Techniques, M. Kharrazi, H. T. Sencar, N. Memon, Journal of Electronic Imaging, Volume 15, Issue 4, October-December 2006. [BibTex]Improving Steganalysis by Fusion Techniques: A Case Study with Image Based Steganography, M. Kharrazi, H. T. Sencar, N. Memon, LNCS Transactions on Data Hiding and Multimedia Security I, Volume 4300, 2006. [BibTex] Image Steganalysis with Binary Similarity Measures, I. Avcibas, M. Kharrazi, N. Memon, B. Sankur, EURASIP Journal on Applied Signal Processing, vol. 2005, no. 17, 2005. [BibTex]Data Masking: A New Approach for Steganography?, R. Radhakrishnan, M. Kharrazi, N. Memon, The Journal of VLSI Signal Processing, Volume 41, Number 3, November 2005. [BibTex]Image Steganography: Concepts and Practice, M. Kharrazi, H. T. Sencar, N. Memon, Lecture Notes Series, Institute for Mathematical Sciences, National University of Singapore, 2004. [BibTex]    Conference:Improving Real-World Vulnerability Characterization with Vulnerable Slices, Solmaz Salimi, Maryam Ebrahimzadeh, and Mehdi Kharrazi, Promise 2020.Inferring API Correct Usage Rules: A Tree-based Approach, Majid Zolfaghari, Solmaz Salimi, M. Kharrazi, 16th International ISC Conference on Information Security and Cryptology (ISCISC), 2019.An Anomaly-based Botnet Detection Approach for Identifying Stealthy Botnets, S. Arshad, M. Abbaspour, M. Kharrazi, H. Sanatkar, International Conference on Computer Applications and Industrial Electronics (ICCAIE), 2011.Passive Worm and Malware Detection in Peer-to-Peer Networks, S. Fahimian, A. Movahed, M. Kharrazi, IEEE/IFIP International Symposium on Trusted Computing and Communications (Trustcom10), 20102PLoc: Preserving Privacy in Location-Based Services, A. Salar Amoli, M. Kharrazi, R. Jalili, IEEE International Conference on Privacy, Security, Risk and Trust (PASSAT10), 2010Towards Real-Time Performance Monitoring for Encrypted Traffic, M. Kharrazi, S. Sen, O. Spatscheck, ACM SIGCOMM Workshop on Internet Network Management (INM), 2007Cover Selection for Steganographic Embedding, M. Kharrazi, H. T. Sencar, N. Memon, IEEE International Conference on Image Processing, 2006Improving Steganalysis by Fusion Techniques: A Case Study with Image Based Steganography, M. Kharrazi, H. T. Sencar, N. Memon, SPIE Symposium on Electronic Imaging, 2006Benchmarking steganographic and steganalysis techniques, M. Kharrazi, H. T. Sencar, N. Memon, SPIE Symposium on Electronic Imaging, 2005PSteg: steganographic embedding through patching, K. Petrowski, M. Kharrazi, H. T. Sencar, N. Memon, IEEE International Conference on Acoustics, Speech, and Signal Processing, 2005Nabs: A System for Detecting Resource Abuses via Characterization of Flow Content Type, K. Shanmugasundaram, M. Kharrazi, N. Memon, Annual Computer Security Applications Conference, 2004Blind source camera identification, M. Kharrazi, H. T. Sencar, N. Memon, IEEE International Conference on Image Processing, 2004Network Abuse Detection via Flow Content Characterization, M. Kharrazi, K. Shanmugasundaram, N. Memon, 5th Annual IEEE Information Assurance Workshop, 2004Image Steganography and Steganalysis: Concepts and Practice, R. Chandramouli, M. Kharrazi, N. Memon, International Workshop on Digital Watermarking, 2003ODISSEA: A Peer-to-Peer Architecture for Scalable Web Search and Information Retrieval, M. Kharrazi, T. Suel, A. Delis, et. al., Sixth International Workshop on Web and Databases (WebDB), 2003    Misc.:اقتصاد امنیت در فضای مجازی، مهدی خرازی، روزنامه دنیای اقتصاد، ۴ اردیبهشت ۱۳۹۸Talks:- Reviewing a few attacks on android, Invited talk @ ISCISC 2014 [pdf]- Economics of Security, Keynote @ ISCISC 2018Students:Mohammad Hadadian (PhD)Zahra Fazli (PhD)AmirMahdi Kousheshi (BS) Past:Solmaz Salimi (PhD)Seyedeh Atefeh Musavi PhD (PostDoc)Hossein Moghaddas (BS)Maryam EbrahimZadeh (MS)Mohammad Hadadian (MS)Parisa Ezzatpanah (MS)Hooman Shahrokhi (MS)Behnam Momeni (PhD) Parsa Morsal (BS) Iman Hosseini (BS)Majid Zolfaghari (MS) Seyed Mohammad Aghamir (MS)Shervin Khastoo (BS)Maryam Sadaat Masoudian (MS)Zeynab Sasan (MS)Majid Salehi (MS)Shahrooz Pouryousef (MS)Zahra Fazli (MS)Farhad Arambam (MS)Mohammad Reza Razian (MS)Fereshteh Razmi (MS)Shahriar Baki (MS)Elahe Soltanaghaei (MS)Seyedeh Atefeh Mousavi (MS)Amir Hossein Alikabarian (MS)Sadegh Momeni (MS)Behnam Momeni (MS)Mohammad Jafari Dehkordi (MS)Amir Reza Nazari Pooya (BS)Ashkan Nikravesh (BS)Setareh Roshan (BS)Farzaneh Moghadam (BS)Elham Akbari (BS)Fereshteh Razmi (BS)Fatemeh Kamali (BS)Hamed Ghasemzadeh (MS)Farzad Momeni Boroojeni (MS)Hamed Ghavamnia (MS)Mehdi Tavakkoli (MS)Maliheh Monshizadeh (MS)Ahmad Boorghani (BS)Maryam Heidari Bisafar (MS)Hoda Rohani (MS)Ali FattaholmananSajjad Khajouie (BS)Abdolmajid Aghamohammadi (BS) Elahe Ghalebi (BS)Anahita Falahat Nejad (BS)Amir Aminifar (BS)Behnam Momeni (BS)Hemad Afzali (BS)Maryam Bagheri (BS)Safoora Bahrami (BS) Mahsa Haeri (BS)Ziba Delavari (BS)",
  "content_length": 9126,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:04"
}