{
  "name": "Mehdi B. Tahoori",
  "homepage": "http://cdnc.itec.kit.edu/21_54.php",
  "status": "success",
  "content": "KIT - Chair of Dependable Nano Computing - Staff Chair of Dependable Nano Computing (CDNC) StartpageStaff StartseiteResearchEducationStaffPublicationsCDNC SoftwareJobs and Thesis OffersEventsContactInternStaff Prof. Dr. Mehdi B. Tahoori office hours: Wednesday, 13:00 - 14:00, weeklyroom: B2-307.1phone: +49 721 608 47778fax: +49 721 608 43962mehdi tahoori ∂does-not-exist.kit edu Short BioMehdi Tahoori is a full professor and Chair of Dependable Nano-Computing (CDNC) at the Institute of Computer Science & Engineering (ITEC), Department of Computer Science, Karlsruhe Institute of Technology (KIT), Germany. He received his PhD and M.S. degrees in Electrical Engineering from Stanford University in 2003 and 2002, respectively, and a B.S. in Computer Engineering from Sharif University of Technology in Iran, in 2000. In 2003, he joined the Electrical and Computer Engineering Department at the Northeastern University as an assistant professor where he promoted to the rank of associate professor with tenure in 2009. From August to December 2015, he was a visiting professor at VLSI Design and Education Center (VDEC), University of Tokyo, Japan. From 2002 to 2003, he was a Research Scientist with Fujitsu Laboratories of America, Sunnyvale, CA, in the area of advanced computer-aided research, engaged in reliability issues in deep-submicrometer mixed-signal very large-scale integration (VLSI) designs. He holds several pending and granted U.S. and international patents. He has authored over 400 publications in major journals and conference proceedings on a wide range of topics, from dependable computing and emerging nanotechnologies for computing to system biology. His current research interests include emerging technologies and computing paradigms for reliable, secure, and energy-efficient computing. He is currently the deputy editor-in-chief of IEEE Design and Test Magazine. He was the editor-in-chief of Elsevier Microelectronic Reliability journal (2018-2021). He was the coordinating editor for Springer Journal of Electronic Testing (JETTA), associate editor of VLSI Integration Journal, and associate editor of IET Computers and Digital Techniques, and associate editor of ACM Journal of Emerging Technologies for Computing. He is the general chair of IEEE VLSI Test Symposium in (VTS) 2023 and was its program chair in 2021 and 2018, and General Chair of IEEE European Test Symposium (ETS) in 2019. He is currently the chair of IEEE European Test Technologies Technical Council (eTTTC). Prof. Tahoori received a number of best paper nominations and awards at various conferences and journals, including ICCAD 2015, FPL 2017, TODAES 2017, and TVLSI 2021, as well as two Top Picks in Hardware and Embedded Security. He was a recipient of the US National Science Foundation Early Faculty Development (CAREER) Award in 2008 and European Research Council (ERC) Advanced Grant in 2022. He is a fellow of the IEEE. Education June 2003 Ph.D. in Electrical Engineering, Stanford University, Stanford, CA, USA Advisor: Prof. Edward J. McCluskey, Co-Advisor: Prof. Giovanni DeMicheli Thesis topic: \"Testing FPGAs\" April 2002 M.S. in Electrical Engineering, Stanford University, Stanford, CA, USA Sept. 2000 B.S. Double Major in Computer Engineering and Computer Science, Sharif University of Technology (with Honors), Teheran, Iran. Thesis topic: \"Testability Considerations during High-Level Synthesis\" Employments 2009-now Chaired Full Professor, Faculty of Informatik, Karlsruhe Institute of Technology (KIT), Karlsruhe, Germany 2008-2009 Associate Professor, Electrical and Computer Engineering, Northeastern University, Boston, MA, USA 2003-2008 Assistant Professor, Electrical and Computer Engineering, Northeastern University, Boston, MA, USA 2002-2003 Research Scientist, Fujitsu Labs of America (FLA), Sunnyvale, CA, USA Mixed-signal SoC CAD and reliability issues in DSM VLSI, including substrate noise and cross talk. 2002 CAD Consultant, Tavanza Inc., Sunnyvale, CA, USA Design, development and implementation of a physical layout editor tool for VLSI chips. 2001 Summer Intern, Xilinx Inc., San Jose, CA, USA Design, development of high-resolution fault diagnosis techniques for interconnect faults in FPGAs. 2000 Senior CAD Engineer, EMAD Semicon Corp., Teheran, Iran Design and implementation of a switch-level Verilog compiler and simulator engine.",
  "content_length": 4379,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:03"
}