{
  "name": "Mehdi Jazayeri",
  "homepage": "http://search.usi.ch/persone/414fbe48da94f28c810b0e4f1890647f/Jazayeri-Mehdi",
  "status": "success",
  "content": "Jazayeri, Mehdi | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Mehdi Jazayeri http://usi.to/evd Biography Mehdi Jazayeri is professor of computer science and founding dean of the Faculty of Informatics at the University of Lugano. From 1994 through 2007, he was also professor of computer science and head of the Distributed Systems Group at the Technical University of Vienna. He has worked at both technical and management capacities at Hewlett-Packard Laboratories, Palo Alto, Synapse Computer Corporation, Ridge Computers, and TRW Vidar. From 1990 to 1992, he set up and managed a joint research project on parallel systems between Hewlett-Packard and the University of Pisa. He has been an assistant professor of computer science at the University of North Carolina at Chapel Hill, adjunct professor at Georgia Institute of Technology, University of Santa Clara, and San Jose State University. He was a Fulbright Scholar at the University of Helsinki (1979) and a visiting professor at the Politecnico di Milano(1988). Mehdi Jazayeri was named an IEEE Fellow in 2007. He is co-author of Programming Language Concepts (John Wiley & Sons), and Foundations of Software Engineering (Prentice-Hall). Mehdi Jazayeri was named an IEEE Fellow in 2007. On 1 January 2015, he became an IEEE Life Fellow. He was honored with the ACM SIGSOFT's Influential Educator Award in 2012 for his work on software engineering and informatics education, and curriculum development. He received the Distinguished Educator Award from the IEEE TCSE in 2013 for \"outstanding and sustained contributions to software engineering education. He holds degrees from Massachusetts Institute of Technology (SB, 1971) and Case Western Reserve University (MS, 1973; PhD, 1975). Competence areas Distributed Systems End-User Software Engineering Software Composition Contact Da definire mehdi.jazayeri@usi.ch Roles Faculty of Informatics Professor emeritus Links Website or personal page Social media X Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2723,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:09"
}