{
  "name": "Mehdi Dastani",
  "homepage": "https://www.uu.nl/medewerkers/MMDastani",
  "status": "success",
  "content": "Prof. dr. M.M. (Mehdi) Dastani - Universiteit Utrecht search English Bewerken search EN Prof. dr. M.M. (Mehdi) Dastani Hoogleraar Bètawetenschappen Informatica AI & Data Science Intelligent Systems Intelligent Systems 030 253 3599 m.m.dastani@uu.nl Buys Ballotgebouw Princetonplein 5 Kamer BBL-521 3584 CC Utrecht Prof. dr. M.M. (Mehdi) Dastani Hoogleraar Intelligent Systems 030 253 3599 m.m.dastani@uu.nl Profiel CV Publicaties Activiteiten Onderzoek Onderwijs Nevenwerkzaamheden Contact Profiel CV Publicaties Activiteiten Onderzoek Onderwijs Nevenwerkzaamheden Contact Expertises Kunstmatige intelligentie Informatica Logica Algoritmen Autonoom rijden Emotie Kunstmatige intelligentie en de wet Smart Urban Governance Filosofie van de informatica Onderzoeksthema's Applied Data Science Foundations of Complex Systems Game Research Governing the Digital Society Human-centered Artificial Intelligence Institutions for Open Societies (IOS) IOS - Future of Work IOS â Futures of Democracy IOS â Open Cities PtS - Towards a Circular Economy and Society PtS - Transforming Cities “Kunstmatige intelligentie is inherent een interdisciplinaire wetenschap.” Onderzoeksfocus: Kunstmatige intelligentie, Informaticafilosofie, Informatie- en Informaticawetenschappen Computerwetenschapper Mehdi Dastani is hoogleraar en voorzitter van de groep Intelligent Systems van de afdeling Informatie- en Computingwetenschappen van de Universiteit Utrecht en programmaleider van het masterprogramma Kunstmatige Intelligentie. Focus op kunstmatige intelligentie Zijn onderzoek richt zich op formele en computermodellen in de kunstmatige intelligentie. Geïnspireerd door kennis en inzichten uit andere wetenschappelijke disciplines zoals filosofie, psychologie, economie en recht, onderzoekt en ontwikkelt Dastani computermodellen voor autonome agenten waarvan het gedrag wordt bepaald op basis van redeneringen over sociale en cognitieve concepten zoals kennis, verlangens, normen, verantwoordelijkheid en emoties. Theorieën en toepassingen van multi-agent systemen Zijn huidige onderzoek richt zich op theorieën en toepassingen van multi-agent systemen, in het bijzonder specificatie- en programmeertalen voor autonome agenten en multi-agent systemen, logica om te redeneren over (multi-)agent specificaties en programma's, agent-based sociale simulatie, en formele modellering van sociale en cognitieve fenomenen zoals autonomie, normhandhaving, monitoring en controle, en besluitvorming. Dastani heeft verschillende subsidies ontvangen voor zijn onderzoek, zowel voor theoretische als voor toegepaste projecten. Inaugural lecture: Controllable Artificial Intelligence: A Human-centered Approach Video: A different state of mind (Studium Generale) Leeropdracht Intelligente Systemen Footer menu (NL) Direct naar Een studie kiezen Studenteninformatie Onderzoeksgebieden Vacatures Doneren Diensten Studentenportal Alumni-portal Intranet voor medewerkers Cursusplanner My Timetable Over de UU Contact Plattegrond Adresboek Disclaimer",
  "content_length": 3018,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:02"
}