{
  "name": "Mehdi Bagherzadeh 0001",
  "homepage": "https://oakland.edu/secs/directory/bagherzadeh",
  "status": "success",
  "content": "Mehdi Bagherzadeh, Ph.D. - School of Engineering and Computer Science - Oakland University Mehdi Bagherzadeh, Ph.D. Associate ProfessorComputer Science and Engineering Department(248) 370-2208[email protected]Ph.D., Iowa State University Teaching CSE 231/506: Object Oriented Computing II Research Making engineering of correct software easier for concurrent, secure, mobile and big data software Selected Publications Modular reasoning in the presence of event subtyping. In Transactions on Modularity and Composition 1, special edition: Best papers of Modularity’ 15, pages 167-223, 2016. On ordering problems in message passing software. In Proceedings of the 15th International Conference on Modularity, MODULARITY 2016, pages 54-65, New York, NY, USA, 2016. Panini: A concurrent programming model for solving pervasive and oblivious interference. In Proceedings of the 14th International Conference on Modularity, MODULARITY 2015, pages 93-108, New York, NY, USA, 2015. ACM. AspectJML: Modular specification and runtime checking for crosscutting contracts. In Proceedings of the 13th International Conference on Modularity, MODULARITY ’14, pages 157-168, New York, NY, USA, 2014. On exceptions, events and observer chains. In Proceedings of the 12th Annual International Conference on Aspect-oriented Software Development, AOSD ’13, pages 185-196, New York, NY, USA, 2013. ACM. Translucid contracts: Expressive specification and modular verification for aspect-oriented interfaces. In Proceedings of the Tenth International Conference on Aspect-oriented Software Development, AOSD ’11, pages 141-152, New York, NY, USA, 2011. ACM. School of Engineering and Computer Science Engineering Center, Room 301 115 Library Drive Rochester , MI 48309-4479 (location map) Dean's Office (248) 370-2217 Academic Advising (248) 370-2201 [email protected] School of Engineering and Computer Science Engineering Center, Room 301 115 Library Drive Rochester , MI 48309-4479 (location map) Dean's Office (248) 370-2217 Academic Advising (248) 370-2201 [email protected] LCME Accreditation Policies and Guidelines GDPR Policy Consumer Information ©2025 Oakland University William Beaumont School of Medicine✎ Connect with Us Oakland University All Rights Reserved ✎",
  "content_length": 2252,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:02"
}