{
  "name": "Mehdi Norouzi",
  "homepage": "https://researchdirectory.uc.edu/p/norouzmi",
  "status": "success",
  "content": "Expert Profile: Mehdi Norouzi | Research Directory Mehdi Norouzi Associate Professor Educator 513-549-3435EmailDownload V-Card Video Structure Analysis - Deep Video Understanding: 1) Video Temporal segmentation, Video Chaptering, Video Scene Detection 2) Video Summarization, Key-frame/Key-shot extraction 3) Dense Caption Generation, Language-guided video summarization Methods: Supervised sequence modeling using BiLSTMs and Transformers, Unsupervised modeling using VAE-GANs and Diffusion Models Applications: Medical Video Processing - Endoscopic Surgeries. Generic or Query based Video Summarization Grant: #OU UT17790 sub FHA 25160B Investigators:Helmicki, Arthur; Hunt, Victor; Norouzi, Mehdi 10-26-2015 -10-26-2016 Federal Highway Administration Preliminary Measurement and Analysis of Flexure and shear Strain for a Carbon Fiber- Wrapped Pier Cap Bridge No. FRA-071-1835L Role:Collaborator $46,110.28 Awarded Level:Federal Grant: #ODOT Teaming Agrmt sub USDOT Investigators:Cohen, Kelly; Helmicki, Arthur; Hunt, Victor; Kumar, Manish; Norouzi, Mehdi 01-02-2018 -10-24-2020 Department of Transportation State of Ohio UAS Integration Pilot Program Role:Collaborator $.00 Active Level:Federal Investigators:Norouzi, Mehdi; Zhou, Xuefu 05-24-2021 -08-21-2021 Medical Interface Solutions, LLC Skeletal and Facial Tracking and Labeling Role:PI 7092.00 Hold Level:Industry Investigators:Norouzi, Mehdi; Zhou, Xuefu 05-24-2021 -05-16-2022 Medical Interface Solutions, LLC Facial and Skeletal Tracking and Labeling (Phase 2) Role:Collaborator 19001.00 Hold Level:Industry Grant: #TBD Investigators:Norouzi, Mehdi; Zhou, Xuefu 05-16-2022 -08-21-2022 Parallax Advanced Research Corporation Facial and Skeletal Tracking and Labeling for Automated Stroke Screening (Phase III) Role:Collaborator 0.00 Hold Level:Non Profit Grant: #21000375-134 / SPR-4714 Investigators:Khoshnevisan, Sara; Norouzi, Mehdi 10-01-2022 -03-31-2024 Department of Transportation Use of Machine Learning Methods to Obtain a Reliable Predictive Model for Resilient Modulus of Soil Role:Collaborator 63841.00 Hold Level:Federal Grant: #21000418-151 Investigators:Khoshnevisan, Sara; Norouzi, Mehdi; Wang, Lei 08-01-2023 -07-31-2025 Purdue University Non-destructive roller integrated acoustic wave detection technique for continuous subgrade soil compaction evaluation Role:Collaborator 260298.00 Hold Level:Higher Education Investigators:Anand, Sam; Norouzi, Mehdi 05-01-2024 -12-31-2024 Siemens Corporation Optimal Routing of Wiring Harnesses using Siemens NX Open Role:Collaborator 25000.00 Hold Level:IndustryPeer Reviewed Publications Haji Agha Mohammad Zarbaf S.;Norouzi M.;Allemang R.;Hunt V.;Helmicki A.;Venkatesh C. (12-15-2018. ) Vibration-based cable condition assessment: A novel application of neural networks.Engineering Structures, , 177 ,291-305 More Information Zarbaf S.;Norouzi M.;Allemang R.;Hunt V.;Helmicki A.;Venkatesh C. (06-01-2018. ) Ironton-Russell Bridge: Application of Vibration-Based Cable Tension Estimation.Journal of Structural Engineering (United States), , 144 (6 ) , More Information Haji Agha Mohammad Zarbaf S.;Norouzi M.;Allemang R.;Hunt V.;Helmicki A. (10-01-2017. ) Stay Cable Tension Estimation of Cable-Stayed Bridges Using Genetic Algorithm and Particle Swarm Opt.Journal of Bridge Engineering, , 22 (10 ) , More Information Haji Agha Mohammad Zarbaf S.;Norouzi M.;Allemang R.;Hunt V.;Helmicki A.;Nims D. (09-01-2017. ) Stay Force Estimation in Cable-Stayed Bridges Using Stochastic Subspace Identification Methods.Journal of Bridge Engineering, , 22 (9 ) , More Information Dalvi A.;Norouzi M.;Hunt V.;Helmicki A. (01-01-2016. ) Structural health monitoring system of Ironton-Russell bridge during substructure construction.Proceedings of SPIE - The International Society for Optical Engineering, , 9805 , More Information Norouzi M.;Zarbaf S.;Dalvi A.;Hunt V.;Helmicki A. (01-01-2016. ) A study of thermal response of concrete towers employing linear regression.Proceedings of SPIE - The International Society for Optical Engineering, , 9804 , More Information Zhang F.;Norouzi M.;Hunt V.;Helmicki A. (01-01-2015. ) Structural health monitoring system for Ironton-Russell Bridge, Ohio and Kentucky: Phase 1. Substruc.Transportation Research Record, , 2504 ,159-167 More Information Zhang F.;Norouzi M.;Hunt V.;Helmicki A. (01-01-2015. ) A novel approach for detection of anomalies using measurement data of the Ironton-Russell bridge.Proceedings of SPIE - The International Society for Optical Engineering, , 9437 , More Information Norouzi M.;Cormier K.;Aydemir M.;Hashtroodi S.;Hunt V.;Nims D.;Helmicki A. (01-01-2014. ) Measuring displacement of tall concrete columns during construction.Transportation Research Record, , (2408 ) ,97-100 More Information Norouzi M.;Hunt V.;Helmicki A. (06-10-2013. ) Abnormal behavior detection in the Jeremiah Morrow Bridge based on the long term measurement-data pa.Proceedings of SPIE - The International Society for Optical Engineering, , 8695 , More Information Norouzi M.;Adediji A.;Hunt V.;Helmicki A. (06-05-2013. ) An integrated monitor and warning system for the Jeremiah morrow bridge.Proceedings of SPIE - The International Society for Optical Engineering, , 8694 , More Information Shu-Ming Tseng, Zhi-Ting Yeh, Chia-yang Wu, Jia-bin Chang, and Mehdi Norouzi (2023. ) Video scene detection using transformer encoding linker network (telnet).Sensors, , 16 , More Information Jenq-Haur Wang, Chin-Wei Huang, and Mehdi Norouzi (2022. ) Improving rumor detection by image captioning and multi-cell bi-rnn with self-attention in social networks.International Journal of Data Warehousing and Mining (IJDWM), , 18 , More Information",
  "content_length": 5691,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:04"
}