{
  "name": "Mehmet Esat Belviranli",
  "homepage": "https://mehmet.belviranli.com",
  "status": "success",
  "content": "Mehmet E. Belviranli -- Assistant Professor -- Colorado School of Mines Mehmet Esat Belviranli Assistant Professor Computer Science Department Colorado School of Mines Mail: 1500 Illinois St. Golden, CO 80401 E-Mail: belviranli@mines.edu CV: About I am an assistant professor and the director of the High Performance Systems and Software Lab in the Computer Science Department of Colorado School of Mines. My research group focuses creating ecosystems to increase performance and utilization of heterogeneous systems. My research interests span: Diversely heterogeneous architectures Analytical performance & resource modeling Autonomous computing Cyber-physical systems Deep learning acceleration Parallel programming paradigms Runtime systems Edge-cloud platforms Please check 𝕙𝘆𝕡𝗲𝕤𝘆𝕤 (High Performance Systems and Software Lab) web page, to learn more about our team, projects and publications. Prospective students for research: I am always interested in doing research with self-motivated Ph.D., M.S., and U.G. students. If you are interested in doing research please fill out the research interest form to contact me. Recent [Funding] -- Oct'25 -- I and my colleagues (Zafer Mutlu and Brian Kim from University of Arizona) are awarded a workforce development grant from ASU SWAPHub funded by DoD The Microelectronics Commons. This project, named SMILE, provides a scalable and interactive training module delivery framework for semiconductor manufacturing education [Graduation] -- Jun'25 -- My first Ph.D. student Ismet Dagli has successfully defended his thesis titled \"Enabling Collaborative, Efficient, and Scalable Resource Management for Heterogeneous Edge Computing Architectures\" [Graduation] -- Jun'25 -- M.S. student Ryan Marsala has successfully defended his thesis titled \"End-to-end Architectural Simulation Framework for Hybrid SFQ/CMOS-Memory Compute Systems\" [Publication] -- Apr'25 -- Our paper is accepted to appear in ICS'25. The paper proposes HARNESS, a holistic resource management for diversely scaled edge cloud systems. [Publication] -- Nov'24 -- Our paper is accepted to appear in DATE'25. The paper unveils a novel memory-contention based covert communication attack which targets the shared system memory in mobile SoCs. [Funding] -- Jun'24 -- I and my colleagues (Selcuk Kose from University of Rochester and Yuanchao Xu from UC Santa Cruz) are awarded an NSF-SaTC grant , titled \"Exploration of Shared Memory Related Security Challenges in Mobile Computing Platforms\". This project unveils a new critical side-channel leakage when multiple applications execute together in a shared memory multi-processor system. [Award] -- May'24 -- My Ph.D. student Ismet Dagli has been selected for the prestigious MLCommons ML and Systems Rising Stars 2024 Cohort. [Publication] -- Apr'24 -- Our paper is accepted to appear in ICS'24. The paper proposes a novel scheduling technique for cyber-physical systems with heterogeneous processing units under real-world constraints [Award] -- Mar'24 -- My Ph.D. student Justin Davis has won the outstanding paper award at DATE'24 Autonomous Systems Desigin Initiative. [Award] -- Mar'24 -- My Ph.D. student Ismet Dagli was a finalist in CGO'24 SRC (student research competition). [Publication] -- Dec'23 -- Our paper is accepted to appear in DATE'24. The paper proposes multi network and multi accelerator object detection for aerial drones. [Publication] -- Nov'23 -- Our paper is accepted to appear in PPoPP'24. The paper proposes to increase throughput of concurrently running DNNs on resource-limited SoCs. [Funding] -- Aug'23 -- I and my colleagues (Selcuk Kose and Eby Friedman from University of Rochester, and Adwait Jog from University of Virginia) are awared a DoE grant, titled \"Modeling the Memory-Compute Gap in Large-scale Superconductive Systems\". This project aims to model the performance of DoE applications on future's large-scale SFQ-based compute systems with CMOS based memory . [Funding] -- Apr'23 -- I and my colleagues (Zafer Mutlu from University of Arizona, Selcuk Kose from University of Rochester, Mike Chrommie from UC Berkeley and Ulya Karpuzcu from University of Minnesota) are awared an NSF Future of Semiconductors (FuSe) Program teaming grant (TG) . This project aims to assemble a multidisciplinary team of experts from different institutions to identify and investigate the challenges facing graphene nanoribbon-based field effect transistor (GNRFET) computing system at the material, device, circuit, and system levels. [Donation] -- Feb'23 -- Google Coral.ai equipment donation. Thanks Google! [Funding] -- Jan'23 -- I and my colleagues (Zafer Mutlu from University of Arizona, Selcuk Kose from University of Rochester and Mike Chrommie from UC Berkeley) are awared a Semiconductor Research Cooperation (SRC) grant on \"Smarter Nanoelectronics with Atomically Precise Graphene Nanoribbons\". In this project we will be exploring the promising potential of Graphene Nanoribbons as tomorrow's leading transistor technology. [Award] -- Oct'22 -- My Ph.D. student Ismet Dagli has won the third place in MICRO'22 SRC (student research competition). [Publication] -- Jul'22 -- Our paper is accepted to appear in PACT'22. The paper proposes an approach to optimize regular expressions via rewrite-guided synthesis. [Award] -- Mar'22 -- I have been granted U.S. Air Force Research Lab Summer Faculty Fellowship Award for Summer'22. [Publication] -- Feb'22 -- Our paper is accepted to appear in DAC'22. The paper proposes an energy-aware neural network inference execution scheme on multi-accelerator heterogeneous SoCs. [Funding] -- Aug'21 -- I and my colleagues, Jedidiah McClurg and Neil Dantam, at Colorado School of Mines were awarded an NSF grant. We will be developing synthesis based solutions to enable resource-aware execution on diversely heterogeneous architectures. [Publication] -- Jul'21 -- Our paper is accepted to appear in MICRO'21. The paper builds a shared memory contention slowdown model for diversely heterogeneous SoCs. [Publication] -- May'21 -- Our paper is accepted to appear in PARCO. The paper proposes an automatic, generic, and non-intrusive partitioning strategy for DNNs that are represented as computational graphs. [Organization] -- Apr'21 -- Our workshop is accepted for the SC'21 program: RSDHA: Redefining Scalability for Diversely Heterogeneous Architectures. [Award] -- Mar'21 -- I have been granted U.S. Air Force Research Lab Summer Faculty Fellowship Award for Summer'21. [Donation] -- Sep'20 -- Xilinx equipment and license donation. Thanks Xilinx! . [Publication] -- Jul'20 -- Our paper is accepted to appear in PACT'20. The paper is authored by my former mentee, Mohammad Monil, and develops a smart dial for energy/performance tradeoff for diversely heterogeneous systems. [Award] -- Oct'19 -- I was honored with Oak Ridge National Laboratory (ORNL) Significant Event Award for my contributions on the renovation of the ExCL laboratory Organization Committees: IISWC'25 - Registrations Chair ICS'25 - Workshops and Tutorials Chair RSDHA'23 @ SC'23 - Workshop Organizer/General Co-Chair RSDHA'22 @ SC'22 - Workshop Organizer/General Co-Chair RSDHA'21 @ SC'21 - Workshop Organizer/General Co-Chair ISES'21 - Track Chair for ardware/Software for Vehicular Intelligent Systems PPoPP'20 - PC meeting local arrangement Co-Chair Program Committees: ASAP'25 ISCA'25 IPDPS'25 SC'24 IPDPS'24 SC'23 ISC'23 DAC'23 IPDPS'23 DAC'22 ISC'22 IPDPS'22 SC'21 - BoF SC'21 - Grad. Poster NAS'21 ICPP'21 IPDPS'21 EuroPar'21 - PhD Sym. ICPP'20 SC'20 - Workshops PACT'20 - SRC PPoPP'20 Selected Publications (Full list) [ICS'25] HARNESS: Holistic Resource Management for Diversely Scaled Edge Cloud Systems Dagli, Ismet; Davis, Justin; Belviranli, Mehmet E Proceedings of the 2025 International Conference on Supercomputing [DATE'25] MC3: Memory Contention-based Covert Channel Communication on Shared DRAM System-on-Chips Dagli, Ismet, Crea, James; Seckiner, Soner; Xu, Yuanchao; Köse, Selçuk; Belviranli, Mehmet E 2025 Design, Automation & Test in Europe Conference & Exhibition [ICS'24] Scheduling for Cyber-Physical Systems with Heterogeneous Processing Units under Real-World Constraints McGowen, Justin; Dagli, Ismet; Dantam, Neil T.; Belviranli, Mehmet E Proceedings of the 2024 International Conference on Supercomputing [PPoPP'24] Shared Memory-contention-aware Concurrent DNN Execution for Diversely Heterogeneous SoCs Dagli, Ismet;Belviranli, Mehmet E Proceedings of ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming. [DATE'24] Context-aware Multi-Model Object Detection for Diversely Heterogeneous Compute Systems Davis, Justin; Belviranli, Mehmet E; (Outstanding Paper Award in Autonomous Systems Design) 2024 Design, Automation & Test in Europe Conference & Exhibition [PACT'22] Optimizing Regular Expressions via Rewrite-Guided Synthesis Jedidiah McClurg; Miles Claver; Jackson Garner; Jake Vossen; Jordan Schmerge; Belviranli, Mehmet E 31st International Conference on Parallel Architectures and Compilation Techniques [DAC'22] AxoNN: Energy-Aware Execution of Neural Network Inference on Multi-Accelerator Heterogeneous SoCs Ismet Dagli; Alexander Cieslewicz; Jedidiah McClurg; Belviranli, Mehmet E 59th ACM/IEEE Design Automation Conference [MICRO'21] PCCS: Processor-Centric Contention-aware Slowdown Model for Heterogeneous SoCs Yuanchao Xu; Belviranli, Mehmet E; Xipeng Shen; Vetter, Jeffrey S; 54th Annual IEEE/ACM International Symposium on Microarchitecture [PARCO] A computational-graph partitioning method for training memory-constrained DNNs Fareed Qararyah, Mohamed Wahib, Doğa Dikbayır, Mehmet Esat Belviranli , Didem Unat Parallel Computing, 2021, 102792, ISSN 0167-8191 [PACT'20] MEPHESTO: Modeling Energy-Performance in Heterogeneous SoCs and Their Trade-Offs Monil, Mohammad; Belviranli, Mehmet E; Lee, Seyong; Vetter, Jeffrey S; Malony, Allen; 2020 International Conference on Parallel Architectures and Compilation Techniques",
  "content_length": 13309,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:06"
}