{
  "name": "Mehmet Burak Akgün",
  "homepage": "https://www.etu.edu.tr/en/bolum/computer-engineering/akademik-kadro?l=1#mehmet-burak-akgun",
  "status": "success",
  "content": "Computer Engineering / Academic Staff - TOBB ETÜ EN TR Corporate Tuition Fees International Library Careers Academic Calendar Homepage Academics Faculties and Institutes Computer Engineering Academic Staff Computer Engineering Share Linkedin Share on Twitter! CONTACT T: +90 (312) 292 4177 F: +90 (312) 292 4180 bil@etu.edu.tr Academic Staff Sort By Name (A-Z) Sort By Last Name (A-Z) Sort By Title Toygar Akgün, Asst. Prof. Education Doctorate Georgia Institute of Technology Electrical and Computer Engineering Master’s Degree Georgia Institute of Technology Electrical and Computer Engineering Bachelor’s Degree Bilkent University Electrical and Electronics Engineering Research Fields Image/Video Processing Computer Vision GPGPU Machine Learning Deep Learning Work Experience ASELSAN A.Ş. Senior Lead Systems Engineer NVIDIA Corp. Software Engineer Qualcomm Interim Engineering Intern Get In Touch Office Z57 T: 4078 E: takgun@etu.edu.tr Google Scholar Mehmet Burak Akgün, Asst. Prof. Education Doctorate University of Nevada Computer Science and Engineering Master’s Degree TOBB University of Economics and Technology Electrical and Electronics Engineering Bachelor’s Degree Middle East Technical University Electrical and Electronics Engineering Research Fields Distributed Computing Network Science Graph Neural Networks, Artificial Intelligence Distributed Machine Learning Big Data Analytics Work Experience Apple Big Data Engineer Verizon Labs Software Development Engineer Yahoo Software Development Engineer Riverbed Technologies (OPNET) Software Development Engineer Get In Touch Office 129 T: 4622 E: m.akgun@etu.edu.tr Linkedin: /@mburakgun Google Scholar Betül Atalay Satoğlu, Prof. Visiting Professor Education Doctorate University of Maryland, College Park Computer Science Master’s Degree University of Maryland, College Park Computer Science Bachelor’s Degree Bilkent University Computer Engineering Research Fields Computational Geometry Mesh Generation Computer Graphics Work Experience Saint Joseph’s University, Philadelphia Assistant Prof., Associate Prof. Get In Touch Office 131/A T: 4710 E: fatalay@etu.edu.tr Çiğdem Avcı, Asst. Prof. Education Work Experience Get In Touch Office Z60 T: 4388 E: cigdemavci@etu.edu.tr Buğra Çaşkurlu, Asst. Prof. Head of Department Education Doctorate Rensselaer Polytechnic Institute (USA) Computer Science Master’s Degree Rensselaer Polytechnic Institute (USA) Computer Science Bachelor’s Degree Bilkent University Computer Engineering Research Fields Algorithm Design and Analysis Algorithmic Game Theory Approximation Algorithms Computer Security and Risk Management Graph Theory Network Design Work Experience West Virginia University (USA) Post. Doc. Researcher Get In Touch Office 144 T: 4075 E: bcaskurlu@etu.edu.tr http://bugracaskurlu.etu.edu.tr/ Google Scholar GCRIS Yücel Çimtay, Assoc. Prof. Education Doctorate Ankara University Electrical-Electronics Eng. Master’s Degree Eskişehir Osmangazi University Electrical-Electronics Eng. Bachelor’s Degree Bilkent University Electrical-Electronics Eng. Research Fields Signal Processing, Image Processing, Computer Vision, Machine Learning, Deep Learning, Natural Language Processing Work Experience TED University Assistant Professor Loughborough University, London Postdoctoral Research Associate Havelsan A.Ş. Systems Engineer, RD Engineer Ministry of Justice, Information Technologies Systems Egineer Get In Touch Office 130 T: 4741 E: ycimtay@etu.edu.tr Linkedin: /@https://www.linkedin.com/in/do%C3%A7-dr-y%C3%BCcel https://ycimtay.etu.edu.tr/ Google Scholar Ayşe Mutlu Derya, Asst. Prof. Education Doctorate Bilkent University Mathematics Master’s Degree University of Massachusetts, Amherst (USA) Mathematics Master’s Degree Bilkent University Mathematics Bachelor’s Degree Bilkent University Mathematics Research Fields Game Theory Social Choice Theory Economic Design Cooperative Game Theory Network Games Work Experience Bilkent Üniversitesi Teaching Assistant, Instructor University of Massachusetts, Amherst Teaching Assistant, Instructor İstanbul Bilgi Üniversitesi Full-time Lecturer Abdullah Gül Üniversitesi Faculty Member TED Üniversitesi Faculty Member Get In Touch Office 144 T: 4297 E: aysederya@etu.edu.tr Bahaeddin ERAVCI, Asst. Prof. Education Doctorate Bilkent Üniversitesi Computer Engineering Master’s Degree Bilkent University Electrical and Electronics Engineering Bachelor’s Degree Hacettepe University Electrical and Electronics Engineering Research Fields Machine Learning Data Science Data Engineering Artificial Intelligence Digital Health Work Experience Work Experience Heqa AI Founder ASELSAN Senior Engineer Get In Touch Office 130 T: 4088 E: beravci@etu.edu.tr Linkedin: /@/beravci/ Google Scholar Oğuz Ergin, Prof. Education Doctorate State University of New York - Binghamton (USA) Computer Science Master’s Degree State University of New York - Binghamton (USA) Computer Science Bachelor’s Degree Middle East Technical University Electrical and Electronics Engineering Work Experience Intel Barcelona Research Center Senior Research Engineer University of Notre Dame (USA) Visiting Faculty University of Edinburgh (Scotland) Researcher Get In Touch Office 138 T: 4149 E: oergin@etu.edu.tr Twitter: /@oguzergin Linkedin: /@oguzergin http://oergin.etu.edu.tr/ Google Scholar Mücahid Kutlu, Asst. Prof. Education Doctorate Ohio State University Computer Science and Engineering Master’s Degree Bilkent University Computer Engineering Bachelor’s Degree Bilkent University Computer Engineering Research Fields Information Retrieval Natural Language Processing Social Computing Work Experience Qatar University Post-doctorate Researcher Get In Touch Office T: E: m.kutlu@etu.edu.tr Google Scholar Ahmet Murat Özbayoğlu, Prof. Education Doctorate The University of Missouri-Rolla (USA) Engineering Management Master’s Degree The University of Missouri-Rolla (USA) Engineering Management Bachelor’s Degree Middle East Technical University Electrical and Electronics Engineering Research Fields Artificial Intelligence, Machine Learning Artificial Neural Networks Biometrics Recogniton Applications Computer Vision, Image Processing Financial Forecast Pattern Recognition Work Experience Akıllı Müh. Sistemleri Lab. Researcher Beyond INC. Product Development Engineer MEMC Electronics Design and Software Engineer Get In Touch Office Z-68 T: 4073 E: mozbayoglu@etu.edu.tr http://mozbayoglu.etu.edu.tr/ Google Scholar Ali Aydın Selçuk, Prof. Education Doctorate University of Maryland Baltimore County Computer Science Master’s Degree Bilkent University Industrial Engineering Bachelor’s Degree Middle East Technical University Industrial Engineering Research Fields Block Encryption Cloud Security Multi-Secure Computation Network and Commuication Security Virtual Network Security Work Experience RSA Data Security Inc. Intern Novell Intern University of Maryland (USA) Assistant Purdue University Post. Doc. Researcher Bilkent University Faculty Get In Touch Office 133 T: 4382 E: aselcuk@etu.edu.tr http://aselcuk.etu.edu.tr/ Google Scholar Researchers Uğur Şahin, Research Assistant Education Master’s Degree TOBB University of Economics and Technology Computer Science Bachelor’s Degree TOBB University of Economics and Technology Computer Science Research Fields Machine Learning AI Applications in Finance Algorithm Design and Analysis Work Experience Get In Touch Office 145/A T: 4666 E: ugursahin@etu.edu.tr Linkedin: /@u%C4%9Fur-%C5%9Fahin-1b53368a/ Google Scholar Electrical and Electronics Engineering Electrical and Electronics Engineering Check Over Mechanical Engineering Mechanical Engineering Check Over Mechatronics Engineering Minor Program Mechatronics Engineering Minor Program Check Over Biomedical Engineering Biomedical Engineering Check Over Industrial Engineering Industrial Engineering Check Over Material Science and Nanotechnology Engineering Material Science and Nanotechnology Engineering Check Over Artificial Intelligence Engineering Artificial Intelligence Engineering Check Over",
  "content_length": 8066,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:05"
}