{
  "name": "Mehmet Fatih Aktas",
  "homepage": "https://w3.cs.bilkent.edu.tr/tr/ogretim-uyeleri",
  "status": "success",
  "content": "Öğretim Üyeleri – Bilkent University Computer Engineering Department Öğretim Üyeleri Prof. Dr. Selim Aksoy E-posta: Ofis: EA 422Telefon: (312) 290 3405Kişisel SayfasıBilgisayarla görü, istatistiksel ve yapısal örüntü tanıma, makine öğrenmesi, veri madenciliği Doç. Dr. Can Alkan E-posta: Ofis: EA 509Telefon: (312) 290 2912Kişisel SayfasıBiyoenformatik ve genomiks için tümleşik algoritmalar, donanım/algoritma eşdizaynı Dr. Öğr. Üyesi Shervin R. Arashloo E-posta:  Ofis: EA 429Tel: (312) 290 3440Kişisel SayfasıBilgisayarla görü, örüntü tanıma, makine öğrenmesi Prof. Dr. Cevdet Aykanat E-posta: Ofis: EA 520Telefon: (312) 290 1039Kişisel SayfasıYüksek başarımlı hesaplama (YBH), makine öğrenmesi uygulamaları için YBH, tensör ayrışımı, matris tamamlama, stokastik gradyan inişi, grafik sinir ağı eğitimi, karmaşık hedefler için çizge/hiperçizge bölütleme Prof. Dr. Fazlı Can E-posta: Ofis: EA 511Telefon: (312) 290 2613Kişisel SayfasıBilgi arama, veri madenciliği Doç. Dr. A. Ercüment Çiçek E-posta: Ofis: EA 514Telefon: (312) 290 6941Kişisel SayfasıHesaplamalı biyoloji, biyoenformatik, makine öğrenmesi, gen keşif algoritmaları Dr. Öğr. Üyesi Hamdi Dibeklioğlu E-posta: Ofis: EA 512Telefon: (312) 290 1187Kişisel Sayfasıİnsan davranış analizi, duygusal hesaplama, bilgisayarla görü, örüntü tanıma, derin öğrenme Prof. Dr. Uğur Doğrusöz E-posta: Ofis: EA 522Telefon: (312) 290 1612Kişisel SayfasıBüyük veri analitiği ve görüntüleme, biyoenformatik, çizge algoritmaları, ve makine öğrenmesi Dr. Öğr. Üyesi Ayşegül Dündar E-posta: Ofis: EA 412Tel: (312) 290 1258Kişisel SayfasıBilgisayarla görü, yapay zeka ve makine öğrenmesi, otonom sürüş Prof. Dr. Uğur Güdükbay E-posta: Ofis: EA 403Telefon: (312) 290 1386Kişisel SayfasıBilgisayar grafikleri, görselleştirme, sanal gerçeklik, artırılmış gerçeklik, çoklu ortam veritabanları, hesaplamalı geometri Prof. Dr. H. Altay Güvenir E-posta: Ofis: EA 414Telefon: (312) 290 1252Kişisel SayfasıYapay zeka, makine öğrenmesi, veri madenciliği, akıllı veri analizi Dr. Öğr. Üyesi Anıl Koyuncu E-posta: Ofis: EA 423Telefon: (312) 290 3443Kişisel SayfasıYazılım mühendisliği, otomatik program onarımı, otomatik hata lokalizasyonu, sabit örüntü madenciliği, makine öğrenimi ve doğal dil işleme için yazılım mühendisliği, deneysel yazılım mühendisliği Prof. Dr. İbrahim Körpeoğlu E-posta: Ofis: EA 401Telefon: (312) 290 2599Kişisel SayfasıBilgisayar ağları, mobil ve kablosuz ağlar, bilgisayar sistemleri Dr. Öğr. Üyesi Özgür S. Öğüz E-posta: Ofis: EA 529Tel: (312) 290 3398Kişisel SayfasıYapay zeka ve makine öğrenmesi ile robotikteki uygulamaları Dr. Öğr. Üyesi Doruk Öner E-posta: Ofis: EA 521Tel: (312) 290 1981Kişisel SayfasıBilgisayarla görü, derin öğrenme, güçlendirmeli öğrenme, güvenilir yapay zeka, topoloji Dr. Öğr. Üyesi Sinem Sav E-posta: Ofis: EA 523Telefon: (312) 290 1267Kişisel SayfasıUygulamalı güvenlik, gizlilik arttırıcı teknolojiler, güvenlik kuruyucu makine öğrenmesi, homomorfik şifreleme Dr. Öğr. Üyesi Abdullah Talayhan E-posta: Ofis: EA 503Telefon: (312) 290 2917Kişisel SayfasıKuantum sonrası kriptografi, sıfır bilgi ispatı, sibergüvenlik Doç. Dr. Eray Tüzün E-posta: Ofis: EA 501Telefon: (312) 290 3426Kişisel SayfasıYazılım mühendisliği, yazılım analitiği, yazılım ürün hattı mühendisliği, yazılım süreci iyileştirmesi ve oyunlaştırma Prof. Dr. Özgür Ulusoy E-posta: Ofis: EA 402Telefon: (312) 290 15 77Kişisel SayfasıVeritabanı sistemleri, ağda bilgi arama, mobil ve eşler arası sistemler",
  "content_length": 3456,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:08"
}