{
  "name": "Mehmet Can Vuran",
  "homepage": "http://cse.unl.edu/~mcvuran",
  "status": "success",
  "content": "Mehmet Can Vuran Mehmet Can Vuran Dale M. Jensen Chair Professor in Computing Daugherty Water for Food Global Institute (WFI) Fellow National Strategic Research Institute (NSRI) Fellow 214 Schorr Center Computer Science and Engineering University of Nebraska-Lincoln Phone: (402) 472-5019 E-mail: [First Name Initial][Middle Name Initial][Last Name Initial]@unl.edu Ph.D., Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, 2007. M.S., Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, 2004. B.S., Electrical and Electronics Engineering, Bilkent University, Ankara, Turkey, 2002. BIOGRAPHY Mehmet Can Vuran was born in Istanbul, Turkey. He received his B.Sc. degree in Electrical and Electronics Engineering from Bilkent University , Ankara, Turkey in 2002. He received his M.S. and Ph.D. degrees in Electrical and Computer Engineering from Georgia Institute of Technology, Atlanta, GA. in 2004 and 2007, respectively. Currently, he is the Dale M. Jensen Chair Professor in Computing at School of Computing in the University of Nebraska-Lincoln. Dr. Vuran is recognized as a Highly Cited Researcher three years in a row by Thomson Reuters \"in recognition of ranking among the top 1% of researchers for most cited documents in Computer Science\". Dr. Vuran was awarded an NSF CAREER award for the project ``Bringing Wireless Sensor Networks Underground''. He is a Daugherty Water of Food Institute Fellow and a National Strategic Research Institute Fellow. RESEARCH Wireless Underground Communications Agricultural Internet of Things (Ag-IoT) Dynamic spectrum access in 6G networks (See our recent results and testbed development as a part of an NSF SpecEES and SWIFT project here). Wearable embedded systems Connected autonomous systems Cyber-physical networking HONORS & AWARDS Dale M. Jensen Chair Professorship, University of Nebraska-Lincoln, 2022. Susan J. Rosowski Professorship, University of Nebraska-Lincoln, 2019. Certificate of Recognition for Contributions to Students, UNL Parents Association, 2016. Highly Cited Researcher, Thomson Reuters/Clarivate Analytics, 2016. Highly Cited Researcher, Thomson Reuters/Clarivate Analytics, 2015. Highly Cited Researcher, Thomson Reuters/Clarivate Analytics, 2014. Fellow, Daugherty Water for Food Institute, 2014-present. Innovators Under 35 Turkey, MIT Technology Review, 2014. NSF CAREER Award, Bringing Wireless Sensor Networks Underground, 2010. PUBLICATIONS An up-to-date list with full papers can be downloaded from CPN Lab webpage. BOOK Wireless Sensor Networks, I. F. Akyildiz and M. C. Vuran, John Wiley & Sons, August 2010. JOURNAL Shades of White: Impacts of Population Dynamics and TV Viewership on Available TV Spectrum, Z. Zhao, M. C. Vuran, D. Batur, and E. Ekici, IEEE Transactions on Vehicular Technology, 2019. Dynamic Pricing for Wireless Internet Based on Changing Capacity and Usage, D. Batur, J. Ryan, Z. Zhao, and M. C. Vuran, Manufacturing and Service Operations Management Journal, 2019. Di-Sense: In Situ Real-Time Permittivity Estimation and Soil Moisture Sensing using Wireless Underground Communications, A. Salam, M. C. Vuran, and S. Irmak, Computer Networks Journal (Elsevier), 2019. Internet of Underground Things in Precision Agriculture: Architecture and Technology Aspects, M. C. Vuran, A. Salam, and R. Wong, Ad Hoc Networks Journal, vol. 81, pp. 160-173, Dec. 2018. Vehicle-to-Barrier Communication During Real-world Vehicle Crash Tests, S. Temel, M. C. Vuran, M. M. R. Lunar, Z. Zhao, A. Salam, R. K. Faller, and C. Stolle, Computer Communications Journal, vol. 127, pp. 172-186, Sept. 2018. Collective Sensing of Worker's Gait Patterns to Identify Fall Hazards in Construction, K. Yang, C. R. Ahn, M. C. Vuran, and H. Kim, Automation in Construction, vol. 82, pp. 166-178, Oct. 2017. Semi-supervised Near-miss Fall Detection for Ironworkers with a Wearable Intertial Measurement Unit, K. Yang, C. R. Ahn, M. C. Vuran, and S. S. Aria, Automation in Construction, in press, May 2016. Cooperative Spectrum Sensing in Cognitive Radio Networks using Multidimensional Correlations, D. Xue, E. Ekici, and M. C. Vuran, IEEE Transactions on Wireless Communications, vol. 13, no. 4, pp. 1832-1843, Apr. 2014. Autonomous Precision Agriculture through Integration of Wireless Underground Sensor Networks with Center Pivot Irrigation Systems, X. Dong, M. C. Vuran, and S. Irmak, Ad Hoc Networks Journal, Special Issue on Theory, Algorithms, and Applications of Wireless Networked Robotics, vol. 11, no. 7, pp. 1975-1987, Sep. 2013. Cross-layer Analysis of Error Control in Underwater Wireless Sensor Networks, M. C. Domingo and M. C. Vuran, Computer Communications Journal, vol. 35, no. 17, pp. 2162-2172, Oct. 2012. Cross-layer Analysis of End-to-end Delay Distribution in Wireless Sensor Networks, Y. Wang, M. C. Vuran, and S. Goddard, IEEE/ACM Transactions on Networking, vol. 20, no. 1, pp. 305-318, Feb. 2012. SDRCS: A Service-Differentiated Real-time Communication Scheme for Event Sensing in Wireless Sensor Networks, Y. Xue, B. Ramamurthy, and M. C. Vuran, Computer Networks Journal, vol. 55, no. 15, pp. 3287-3302, Oct. 2011. Distributed Vision Graph Construction in Wireless Multimedia Sensor Networks, X. Dong and M. C. Vuran, IEEE COMSOC MMTC E-Letter, vol. 6, no. 3, pp. 37-39, March 2011. A Reliable Energy-Efficient Multi-Level Routing Algorithm for Wireless Sensor Networks Using Fuzzy Petri Nets, Z. Yu, X. Fu, Y. Cai, M. C. Vuran, Journal of Sensors, vol. 11, no. 3, pp. 3381-3400, March 2011. Channel Model and Analysis for Wireless Underground Sensor Networks in Soil Medium, M. C. Vuran and I. F. Akyildiz, Physical Communication Journal (Elsevier), vol. 3, no. 4, pp. 245-254, Dec. 2010. XLP: A Cross Layer Protocol for Efficient Communication in Wireless Sensor Networks, M. C. Vuran and I. F. Akyildiz, IEEE Transactions on Mobile Computing, vol. 9, no. 11, pp. 1578-1591, Nov. 2010. Development of a Testbed for Wireless Underground Sensor Networks, A. Silva and M. C. Vuran, EURASIP Journal on Wireless Communications and Networking special issue on \"Simulators and Experimental Testbeds Design and Development for Wireless Networks\", vol. 2010, Article ID 620307, 14 pages, 2010. Special Issue of ``Computer Communications'' on Cognitive Radio and Dynamic Spectrum Sharing Systems, A. Benslimane, C. Assi, E. Hossain, M. C. Vuran, Guest Editorial in Computer Communications (Elsevier), vol. 32, no. 18, pp. 1903-1904, Dec. 2009. Signal Propagation Techniques for Wireless Underground Communication Networks, I. F. Akyildiz, Z. Sun, M. C. Vuran, Physical Communication Journal (Elsevier), vol. 2, no. 3, pp. 167-183, Sept. 2009. Error Control in Wireless Sensor Networks: A Cross Layer Analysis, M. C. Vuran and I. F. Akyildiz, IEEE/ACM Transactions on Networking, vol. 17, no. 4, pp. 1186-1199, Aug. 2009. A Survey on Spectrum Management in Cognitive Radio Networks, I. F. Akyildiz, W. Y. Lee, M. C. Vuran, and S. Mohanty, IEEE Communications Magazine, , vol. 46, no. 4, April 2008. [123 Citations *] (Among the 10 most downloaded articles in IEEE ComSoc.) A-MAC: Adaptive Medium Access Control for Next Generation Wireless Terminals, M. C. Vuran and I. F. Akyildiz, IEEE/ACM Transactions on Networking, vol. 15, no. 3, pp. 574-587, June 2007. On the cross-layer Interactions between Congestion and Contention in Wireless Sensor and Actor Networks, V. C. Gungor, M. C. Vuran, and O. B. Akan, Ad Hoc Networks Journal (Elsevier), vol. 5, no. 6, pp. 897-909, August 2007. NeXt Generation / Dynamic Spectrum Access / Cognitive Radio Wireless Networks: A Survey, I. F. Akyildiz, W. Y. Lee, M. C. Vuran, and S. Mohanty, Computer Networks Journal (Elsevier), vol. 50, pp. 2127-2159, September 2006. [998 Citations*] (Among the 10 most downloaded articles in Computer Networks Journal for 2 years since September 2006.) Spatial Correlation-based Collaborative Medium Access Control in Wireless Sensor Networks, M. C. Vuran and I. F. Akyildiz, IEEE/ACM Transactions on Networking, vol. 14, no. 2, pp. 316 -329, April 2006. [130 Citations *] Spatio-Temporal Correlation: Theory and Applications for Wireless Sensor Networks, M. C. Vuran, O. B. Akan, and I. F. Akyildiz, Computer Networks Journal (Elsevier), vol. 45, no 3, pp. 245 -259, June 2004. [169 Citations *] BOOK CHAPTER Communication through Soil in Wireless Underground Sensor Networks - Theory and Practice, M. C. Vuran and A. R. Silva, in Sensor Networks: Where Theory Meets Practice, Edited by G. Ferrari, Springer, 2009. Future Trends in Wireless Sensor Networks, M. C. Vuran, D. Pompili, and T. Melodia, in Wireless Sensor Networks: A Networking Perspective, Edited by J. Zheng and A. Jamalipour, Wiley-IEEE Press, May 2009. Spectrum Sensing Algorithms for Cognitive Radio Networks, W.-Y. Lee, K. R. Chowdhury, and M. C. Vuran, in Cognitive Radio Networks, Edited by Y. Xiao and F. Hu, CRC Press, 2008. Cross-layer Design in Wireless Sensor Networks, D. Pompili, M. C. Vuran, and T. Melodia, in Sensor Network and Configuration: Fundamentals, Techniques, Platforms, and Experiments, Edited by M. P. Mahalik, Springer-Verlag, August 2006. Reliable Transmission and Congestion Control in Wireless Sensor Networks, O. B. Akan and M. C. Vuran, in Wireless Sensor Networks: A Systems Perspective, Edited by N. Bulusu and S. Jha, Artech House, August 2005. CONFERENCE Pulses in the Sand: Impulse Response Analysis of Wireless Underground Channel, A. Salam, M. C. Vuran, and S. Irmak, to appear in IEEE INFOCOM '16, San Francisco, CA, Apr. 2016. Threshold-Based Approach to Detect Near-Miss Falls of Iron-Workers Using Inertial Measurement Units. K. Yang, H. Jebelli, C.R. Ahn, M. C. Vuran, in Proc. ASCE Int. Workshop on Computing in Civil Engineering, Austin, TX, June 2015. Stochastic Performance Trade-offs in the Design of Real-Time Wireless Sensor Networks, Y. Wang, M. C. Vuran, and S. Goddard, in Proc. Int. Conf. on Computing, Networking, and Communications (ICNC '15), Ana",
  "content_length": 20972,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:06"
}