{
  "name": "Mehrdad Nojoumian",
  "homepage": "http://faculty.eng.fau.edu/nojoumian",
  "status": "success",
  "content": "Mehrdad Nojoumian's Homepage Main Education Students Teaching/Outreach Publications Invited Talks Honors/Awards Service Mehrdad Nojoumian Associate Professor Electrical Engineering and Computer Science Florida Atlantic University, EE 429 Boca Raton, FL 33431 Office: (561) 297-3411 mnojoumian (at) faudotedu I received my PhD from the Cheriton School of Computer Science at University of Waterloo, and my MSc from the School of Electrical Engineering and Computer Science at University of Ottawa. My research interests lie on privacy, security, and trust in autonomy/AI, and cross-disciplinary research on the intersections of computer science and other disciplines. If you are interested in conducting research in our Lab, please contact me. Considering merit-based criteria, consideration is given to underrepresented students, including Hispanics, students of color, and women in engineering/computer science. We also thank our research sponsors: ARO-AFOSR, NSF, AFRL, FC2, and I-Sense. Highlights: Recipient of the Excellence and Innovation in Undergraduate Teaching Award 2023, Office of the Provost. Recipient of the Faculty Service and Outreach Award 2023, College of Engineering and Computer Science. Recipient of the Senior Faculty Teaching Award 2023, College of Engineering and Computer Science. Inducted into the FAU Chapter of the National Academy of Inventors (NAI), USA, 2022. Should AVs mimic human driving behaviors? received the Best Paper Award in HCII-MobiTAS'21: FAU News. Our 2nd patent, adaptive driving mode in autonomous vehicles, was issued by USPTO: FAU News. Our research and technology development related to autonomous vehicles was animated and featured by FAU. Our 1st patent, adaptive mood control in autonomous vehicles, was issued by USPTO: FAU News, CBS12 News. Efficient implementation of privacy-preserving auction protocols received the Best Paper Award in FICC'20. Recipient of the Excellence in Teaching 2020, Junior Faculty, College of Engineering and Computer Science. Our research on human-autonomy interactions was featured by IEEE Xplore Innovation Spotlight & FAU News. $45K was awarded by AFRL for our project on private planning among drones using combinatorial auctions. $300K was awarded by ARO-AFOSR to study Bitcoin, dishonest mining strategies and countermeasures. Updated: Jan 31, 2025 - Views:",
  "content_length": 2348,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:14"
}