{
  "name": "Mehran Mozaffari Kermani",
  "homepage": "https://www.cse.usf.edu/~mehran2",
  "status": "success",
  "content": "Mehran Mozaffari Kermani Skip over navigation Home Research Publications Research Group Teaching Honors and Awards Professional Activities Outreach Home Mehran Mozaffari Kermani Associate ProfessorBellini College of Artificial Intelligence, Cybersecurity and ComputingOffice: ENB 338Lab: Cryptographic Engineering and Hardware Security (ENB 217)University of South FloridaEmail: mehran2 (@usf.edu) Starting 2026, I am going to be an Associate Editor of the IEEE Transactions on Circuits and Systems II (TCAS II), (2026-present). I am an Associate Editor of the IEEE Transactions on Industrial Informatics (TII)- CPS Security, (2025-present). I have served multiple times and it is ongoing as the Associate Editor of the ACM Transactions on Embedded Computing Systems (TECS), (2015-present). I served multiple times as the Associate Editor of the IEEE Transactions on VLSI Systems (TVLSI), (2016-2025) and the IEEE Transactions on Circuits and Systems I (TCAS I), (2016-2023). I was the Guest Editor of the IEEE Transactions on Dependable and Secure Computing, the IEEE/ACM Transactions on Computational Biology and Bioinformatics, and the IEEE Transactions on Emerging Topics in Computing for special issues on cryptographic Engineering and Hardware Security. I have been part of steering committee for HOST 2017-2024 (8 years as Publications Chair) GLSVLSI 2024 (Local Committee Chair) CCS 2020 (Publications Chair) ISVLSI 2021 (Finance Chair)Currently, I am part of technical program committee forINFOCOM 2025 (Workshop TPC member) CCS 2025 (Workshop TPC member)VLSI-D 2023, 2022 (TPC member) LightSec 2025 GLSVLSI 2024, 2023, 2022, 2021 (TPC member, track: hardware security session chair) ISCAS 2020 (TPC member) ISQED 2026, 2025, 2024, 2023, 2022, 2021, 2020 (TPC member) PAINE 2025, 2024, 2023, 2022, 2021, 2020 (TPC member) DATE 2017 (TPC member, track: secure systems) FDTC 2025, 2024, 2023, 2022, 2021 (TPC member) DFT 2025, 2024, 2023, 2022, 2021 (TPC member) HOST 2019 and 2018 (TPC member) DAC 2019, 2018, and 2017 (TPC member, track: embedded and cross-layer security) and in the past years for: GLSVLSI 2020-2016, SECRYPT 2015, ISVLSI 2017-2015, FDTC 2020-2014, DFT 2020-2014, LightSec 2015-2014, RFIDSec 2014, SPACE 2014, and WAIFI 2014. Biography Dr. Mehran Mozaffari Kermani received the B.Sc. degree in electrical and computer engineering from the University of Tehran, Tehran, Iran, in 2005, and the M.E.Sc. and Ph.D. degrees from the Department of Electrical and Computer Engineering, University of Western Ontario, London, Canada, in 2007 and 2011, respectively, under the supervision of Prof. Arash Reyhani-Masoleh. He joined the Advanced Micro Devices as a senior ASIC/layout designer, integrating sophisticated security/cryptographic capabilities into a single accelerated processing unit. In 2012, he joined the Electrical Engineering Department, Princeton University, New Jersey, as an NSERC post-doctoral research fellow, having the pleasure of working with Prof. Niraj K. Jha. From 2013-2017 he was an Assistant Professor with the Department of Electrical and Microelectronic Engineering, Rochester Institute of Technology, Rochester, NY. Currently, he is an Associate Professor and the Director of Graduate Programs with the Bellini College of Artificial Intelligence, Cybersecurity and Computing at University of South Florida, where he is the PI for the Cryptographic Engineering and Hardware Security Lab. He has served and is serving as an Associate Editor for the IEEE TVLSI (2016-2025), the IEEE TCAS I (2016-2023), the ACM TECS (2015-present), the IEEE TII (2025-present), and the IEEE TCAS II (2026-present). He has been Guest Editing (Cryptographic Engineering and Hardware Security) special issues for the IEEE TCBB, the IEEE TETC, and the IEEE TDSC. He has served as the technical committee member for a number of related conferences on embedded systems security and reliability including HOST (Publications Chair), CCS (Publications Chair), DAC, DATE, INFOCOM, FDTC, GLSVLSI, DFT, ISCAS, ISQED, RFIDSec, LightSec, and WAIFI. He was a recipient of the prestigious Natural Sciences and Engineering Research Council of Canada Post-Doctoral Research Fellowship in 2011, the Texas Instruments Faculty Award (Douglas Harvey) in 2014, outstanding research award at College of Engineering, USF, in 2018, Nexus Initiative Global Award, in 2019, and USF university-wide Faculty Outstanding Research Achievement Award in 2021. He is a Senior Member of the IEEE, Member of the IEEE CS, Member of the IEEE CASS, and Member of the ACM. Moreover, he is the Director of Graduate Programs with the Bellini College of Artificial Intelligence, Cybersecurity and Computing at University of South Florida (2025-present), an Associate Director for the Master's in Cybersecurity at USF, and a co-director for the Center for Cryptographic Research (CCR) including the annual outreach \"CodeBreakHERS\" workshop for high school girls at USF since 2020 till present: 2025. Note: There will be Ph.D. positions available. Interested applicants are advised to contact me and attach their CV and transcripts to proceed. Bellini College of Artificial Intelligence, Cybersecurity and Computing University of South Florida 4202 East Fowler Avenue, Tampa, Florida 33620 Updated: Sep. 2025",
  "content_length": 5293,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:15"
}