{
  "name": "Mehrdad Dianati",
  "homepage": "https://pure.qub.ac.uk/en/persons/mehrdad-dianati",
  "status": "success",
  "content": "Mehrdad Dianati - Queen's University Belfast View Scopus Profile Mehrdad Dianati Professor Professor, School of Electronics, Electrical Engineering and Computer Science Emailm.dianatiqub.acuk 20252025 Research activity per year Fingerprint Dive into the research topics where Mehrdad Dianati is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Anomaly Detection Engineering 100% Particle Filter Engineering 100% Kalman Filtering Mathematics 100% Control Function Mathematics 50% Interpretability Mathematics 50% Kalman Filter Engineering 28% Technical Requirement Computer Science 22% Automotive Application Computer Science 16% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2025 2025 2025 1 Conference contribution 1 Article 1 Review article Research output per year Research output per year Comparative evaluation of pseudonym-based anonymisation techniques for connected autonomous vehicles (CAVs)Sheik, A. T., Liu, J., Dianati, M. & Maple, C., 25 Feb 2025, (Early online date) In: Frontiers in Future Transportation. 6, 1519759.Research output: Contribution to journal › Article › peer-review Open AccessFile Technical Requirement 100% group signature 50% 28 Downloads (Pure) Robust cybersecurity for autonomous vehicles using particle filter based anomaly detectionThomas, R. K., Van, M., Dianati, M., Olayemi, K. & Ding, W., 06 Nov 2025, IECON 2025 – 51st Annual Conference of the IEEE Industrial Electronics Society: Proceedings. Institute of Electrical and Electronics Engineers Inc., 6 p. (Annual Conference of the IEEE Industrial Electronics Society (IECON): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Particle Filter 100% Anomaly Detection 100% Kalman Filtering 100% State Estimation 100% Control Function 50% 3 Downloads (Pure) State-of-the-art virtualisation technologies for the centralised automotive E/E architectureGuo, Z., Koufos, K., Dianati, M. & Woodman, R., 17 Feb 2025, In: Frontiers in Future Transportation. 6, 1519390.Research output: Contribution to journal › Review article › peer-review Open AccessFile Automotive Application 100% 39 Downloads (Pure)",
  "content_length": 2608,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:14"
}