{
  "name": "Mehran Sahami",
  "homepage": "https://profiles.stanford.edu/mehran-sahami",
  "status": "success",
  "content": "Mehran Sahami's Profile | Stanford Profiles Mehran Sahami Tencent Chair of the of the Computer Science Department, James and Ellenor Chesebrough Professor and Senior Fellow, by courtesy, at the Freeman Spogli Institute for International Studies Print Profile Email Profile View Stanford-only Profile Tab Menu Bio Teaching Publications Bio Mehran Sahami is Tencent Chair of the Computer Science Department and the James and Ellenor Chesebrough Professor in the School of Engineering. As a Professor (Teaching) in the Computer Science department, he is also a Bass Fellow in Undergraduate Education and previously served as the Associate Chair for Education in Computer Science. Prior to joining the Stanford faculty, he was a Senior Research Scientist at Google. His research interests include computer science education, artificial intelligence, and ethics. He served as co-chair of the ACM/IEEE-CS joint task force on Computer Science Curricula 2013, which created curricular guidelines for college programs in Computer Science at an international level. He has also served as chair of the ACM Education Board, an elected member of the ACM Council, and was appointed by California Governor Jerry Brown to the state's Computer Science Strategic Implementation Plan Advisory Panel. Academic Appointments Professor (Teaching), Computer Science Senior Fellow (By courtesy), Freeman Spogli Institute for International Studies Faculty Affiliate, Institute for Human-Centered Artificial Intelligence (HAI) Administrative Appointments Chair, Computer Science Department (2023 - Present) Associate Chair for Education, Computer Science Department (2007 - 2022) Boards, Advisory Committees, Professional Organizations Co-Chair, ACM Education Board (2014 - 2018) Advisory Board, Code.org (2013 - Present) Program Affiliations Symbolic Systems Program Professional Education PhD, Stanford University, Computer Science (1999) Contact Academic sahami@cs.stanford.edu University - Faculty Department: Computer Science Position: Professor-Teaching Computation and Data Science Building, Room E124 Computer Science Department Stanford University Stanford, California 94305 Additional Info Mail Code: 9015 2025-26 Courses Ethics, Public Policy, and Technological ChangeCOMM 180, CS 182, PHIL 82, POLISCI 182, PUBLPOL 182 (Win) Ethics, Public Policy, and Technological Change (WIM)CS 182W (Win) Programming MethodologyCS 106A (Spr) Independent Studies (16) Advanced Reading and ResearchCS 499 (Aut, Win, Spr) Advanced Reading and ResearchCS 499P (Aut, Win, Spr) Curricular Practical TrainingCS 390A (Aut, Win, Spr) Curricular Practical TrainingCS 390B (Aut, Win, Spr) Curricular Practical TrainingCS 390C (Aut, Win, Spr) Independent ProjectCS 399 (Aut, Win, Spr) Independent ProjectCS 399P (Aut, Win, Spr) Independent StudySYMSYS 196 (Aut, Win, Spr) Independent StudySYMSYS 296 (Aut, Win, Spr) Independent WorkCS 199 (Aut, Win, Spr) Independent WorkCS 199P (Aut, Win, Spr) Master's Degree ProjectSYMSYS 290 (Aut, Win, Spr) Part-time Curricular Practical TrainingCS 390D (Aut, Win, Spr) Programming Service ProjectCS 192 (Aut, Win, Spr) Senior ProjectCS 191 (Aut, Win, Spr) Writing Intensive Senior Research ProjectCS 191W (Aut, Win, Spr) Prior Year Courses 2024-25 Courses Ethics, Public Policy, and Technological ChangeCS 182 (Win) Ethics, Public Policy, and Technological ChangeLAW 4047 (Win) Ethics, Public Policy, and Technological ChangePHIL 82, PUBLPOL 182 (Win) Ethics, Public Policy, and Technological Change (WIM)CS 182W (Win) Programming MethodologyCS 106A (Spr) 2023-24 Courses Computational Decision MakingCS 29N (Win) Programming MethodologyCS 106A (Spr) 2022-23 Courses Additional Topics in Teaching Computer ScienceCS 198B (Win, Spr) Ethics, Public Policy, and Technological ChangeCOMM 180, CS 182, ETHICSOC 182, PHIL 82, POLISCI 182, PUBLPOL 182 (Win) Ethics, Public Policy, and Technological Change (WIM)CS 182W (Win) Programming MethodologyCS 106A (Spr) Teaching Computer ScienceCS 198 (Aut, Win, Spr) Stanford Advisees Doctoral Dissertation Reader (AC) Ali Malik Orals Evaluator Ali Malik Master's Program Advisor Jesus Ballesteros, Nomin-Erdene Bayarsaikhan, Peter Benitez, Kris Jeong, Jasmyn Lopez, Jonathan Lutch, Zane Sabbagh, Brian Wu, Patrick Ye, Belinda Yeung, Elizabeth Zhu All Publications Should the AP Computer Science A Exam Switch to Using Python Sahami (Moderator), M., Astrachan, O., Czajka, S., Decker, A., Rosato, J., ACM ASSOC COMPUTING MACHINERY. 2022: 1015-1016 View details for DOI 10.1145/3478432.3499230 View details for Web of Science ID 000947124200002 Wrestling with Retention in the CS Major: Report from the ACM Retention Committee Miller, A., Alvarado, C., Sahami, M., Villa, E., Zweben, S., Assoc Comp Machinery ASSOC COMPUTING MACHINERY. 2019: 807–8 View details for DOI 10.1145/3287324.3287326 View details for Web of Science ID 000575321600137 Challenges and Approaches for Data Collection to Understand Student Retention Walker, H. M., Sahami, M., Alvarado, C., Assoc Comp Machinery ASSOC COMPUTING MACHINERY. 2018: 1062 View details for DOI 10.1145/3159450.3162169 View details for Web of Science ID 000481890100237 Five Slides About: Abstraction, Arrays, Uncomputability, Networks, Digital Portfolios, and the CS Principles Explore Performance Task Lewis, C. M., Aaronson, L., Allatta, E., Dodds, Z., Forbes, J., McMullen, K., Sahami, M., Assoc Comp Machinery ASSOC COMPUTING MACHINERY. 2018: 269–70 View details for DOI 10.1145/3159450.3159645 View details for Web of Science ID 000481890100052 TMOSS: Using Intermediate Assignment Work to Understand Excessive Collaboration in Large Classes Yan, L., McKeown, N., Sahami, M., Piech, C., Assoc Comp Machinery ASSOC COMPUTING MACHINERY. 2018: 110–15 View details for DOI 10.1145/3159450.3159490 View details for Web of Science ID 000481890100020 Programming Pluralism: Using Learning Analytics to Detect Patterns in the Learning of Computer Programming JOURNAL OF THE LEARNING SCIENCES Blikstein, P., Worsley, M., Piech, C., Sahami, M., Cooper, S., Koller, D. 2014; 23 (4): 561-599 View details for DOI 10.1080/10508406.2014.954750 View details for Web of Science ID 000344060800004 Reflections on Stanford's MOOCs COMMUNICATIONS OF THE ACM Cooper, S., Sahami, M. 2013; 56 (2): 28-30 View details for DOI 10.1145/2408776.2408787 View details for Web of Science ID 000314178900011 Special Session: The CS2013 Computer Science Curriculum Guidelines Project 43rd Annual Frontiers in Education Conference (FIE) Roach, S., Sahami, M., LeBlanc, R., Seker, R. IEEE. 2013 View details for Web of Science ID 000330839100276 The 'Big Tent' of Computer Science: Curricula for the Coming Decade. Journal of Computing Sciences in Colleges Sahami, M. 2012; 27 (4) Computer Science: Update on the Strawman Report from the ACM/IEEE-CS Task Force. Sahami, M., Roach, S., Cuadros-Vargas, E., Reed, D. 2012 Special Session -- The CS2013 Computer Science Curriculum Guidelines Project. Roach, S., Sahami, M., LeBlanc, R. 2012 EAAI-10: The First Symposium on Educational Advances in Artificial Intelligence AI MAGAZINE desJardins, M., Sahami, M., Wagstaff, K. 2011; 32 (1): 91-92 View details for Web of Science ID 000288973900009 Computer Science Curriculum 2013: Reviewing the Strawman Report from the ACM/IEEE-CS Task Force 43rd ACM Technical Symposium on Computer Science Education (SIGCSE 2012) Sahami, M., Roach, S., Cuadros-Vargas, E., Reed, D. ASSOC COMPUTING MACHINERY. 2011: 3–4 View details for Web of Science ID 000304130200002 Setting the Stage for Computing Curricula 2013: Computer Science - Report from the ACM/IEEE-CS Joint Task Force 42nd ACM Technical Symposium on Computer Science Education Sahami, M., Guzdial, M., McGettrick, A., Roach, S. ASSOC COMPUTING MACHINERY. 2011: 161–162 View details for Web of Science ID 000289490900033 Modeling How Students Learn to Program 43rd ACM Technical Symposium on Computer Science Education (SIGCSE 2012) Piech, C., Sahami, M., Koller, D., Cooper, S., Blikstein, P. ASSOC COMPUTING MACHINERY. 2011: 153–158 View details for Web of Science ID 000304130200031 Special Session - The CS2013 Computer Science Curriculum Guidelines Project 41st Annual Frontiers in Education Conference (FIE) Sahami, M., Roach, S., LeBlanc, R. IEEE. 2011 View details for Web of Science ID 000300879800408 A Course on Probability Theory for Computer Scientists 42nd ACM Technical Symposium on Computer Science Education Sahami, M. ASSOC COMPUTING MACHINERY. 2011: 263–268 View details for Web of Science ID 000289490900054 Educational Advances in Artificial Intelligence 42nd ACM Technical Symposium on Computer Science Education Sahami, M., desJardins, M., Dodds, Z., Neller, T. ASSOC COMPUTING MACHINERY. 2011: 81–82 View details for Web of Science ID 000289490900017 Expanding the Frontiers of Computer Science: Designing a Curriculum to Reflect a Diverse Field 41st ACM Technical Symposium on Computer Science Education Sahami, M., Aiken, A., Zelenski, J. ASSOC COMPUTING MACHINERY. 2010: 47–51 View details for Web of Science ID 000281141300010 Nifty assignments. Parlante, N., Murtagh, T., P., Sahami, M., Astrachan, O., L., Reed, D., Stone, C., A. 2009 Reports of the AAAI 2008 Spring Symposia AI MAGAZINE Balduccini, M., Baral, C., Brodaric, B., Colton, S., Fox, P., Gutelius, D., Hinkelmann, K., Horswill, I., Huberman, B., Hudlicka, E., Lerman, K., Lisetti, C., McGuinness, D., Maher, M. L., Musen, M. A., Sahami, M., Sleeman, D., Thoenssen, B., Velasquez, J., Ventura, D. 2008; 29 (3): 107-115 View details for Web of Science ID 000260368400009 Google TV search: dual-wielding search and discovery in a large-scale product. Patel, M., Gossweiler, R., Sahami, M., Blackburn, J., Brown, D., Knight, A. 2008 A Web-based Kernel Function for Measuring the Similarity of Short Text Snippets. Sahami, M., Heilman, T., D. 2006 Combinatorial Markov Random Fields. Bekkerman, R., Sahami, M., Learned-Miller, E. 2006 Semi-supervised Clustering using Combinatorial MRFs. Bekkerman, R., Sahami, M. 2",
  "content_length": 14227,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:12"
}