{
  "name": "Mehrdad Moharrami",
  "homepage": "https://cs.uiowa.edu/people/mehrdad-moharrami",
  "status": "success",
  "content": "Mehrdad Moharrami, Ph.D. | Computer Science - College of Liberal Arts and Sciences | The University of Iowa Skip to main content Mehrdad Moharrami, Ph.D. Assistant Professor Biography Moharrami is an Assistant Professor in Computer Science at the University of Iowa. Previously, he was a TRIPODS Postdoctoral Research Fellow at UIUC, working with Prof. R. Srikant. He earned his BSc in Mathematics and Electrical Engineering from the Sharif University of Technology, Iran, and holds MSc degrees in Electrical Engineering and Mathematics from the University of Michigan. In Winter 2020, he received his PhD in Electrical Engineering, earning the prestigious Rackham Predoctoral Fellowship for his exceptional dissertation.Research InterestsMy research so far spans two areas: (1) reinforcement learning and MDPs, and (2) computationally efficient algorithms for learning and economics in societal systems modeled as random graphs. (1) I study data-driven algorithms modeling the underlying environment as an MDP. My main focus is to develop robust algorithms against distributional shifts and model uncertainties. (2) I study the impact of structural properties of real-world networks on interactions of individuals with fixed behavior, modeling the networks as a family of parameterized random graphs. My main focus is to understand and predict the results of interactions when the underlying parameter, and hence the structural properties of the network, varies.Research Interests (Keywords)Markov Decision Processes, Reinforcement Learning, Random GraphsSelected PublicationsReinforcement Learning and MDPs:A policy gradient algorithm for the risk-sensitive exponential cost MDP.  Moharrami, M., Murthy, Y., Roy, A., & Srikant, R. Mathematics of Operations Research (2024)Performance bounds for policy-based average reward reinforcement learning algorithms. Murthy, Y., Moharrami, M., & Srikant, R. Advances in Neural Information Processing Systems, 36, 19386-19396. (2023).Modified Policy Iteration for Exponential Cost Risk Sensitive MDPs. Murthy, Y., Moharrami, M., & Srikant, R. In Learning for Dynamics and Control Conference (pp. 395-406). PMLR. (2023)Economics, Computation, and Learning in Random Graphs:The Erlang weighted tree, a new branching process. Moharrami, M., Subramanian, V., Liu, M., & Sundaresan, R. Random Structures & Algorithms, 64(3), 537-624. (2024)The planted matching problem: Phase transitions and exact results. Moharrami, M., Moore, C., & Xu, J. The Annals of Applied Probability, 31(6), 2663-2720. (2021)Impact of community structure on cascades. Moharrami, M., Subramanian, V., Liu, M., & Lelarge, M. In Proceedings of the 2016 ACM Conference on Economics and Computation (pp. 635-636). (2016) Research areas Algorithmic Foundations Artificial Intelligence, Machine Learning, and Pattern Recognition Email mehrdad-moharrami@uiowa.edu Website Personal Website, Google Scholar Contact Information Office Address 257 Macbride Hall (MH) Iowa City, IA 52242 United States",
  "content_length": 3001,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:14"
}