{
  "name": "Mehran Alidoost Nia",
  "homepage": "https://facultymembers.sbu.ac.ir/alidoost",
  "status": "success",
  "content": "Mehran Alidoost Nia - Home Mehran Alidoost Nia Assistant Professor of Computer Engineering at Shahid Beheshti University PhD in Software Engineering from the University of Tehran, Tehran, Iran Former Assuring Autonomy International Programme (AAIP) Fellow at the University of York, York, UK Chief Technology Officer, IT Strategist, Software Architecture An Expreienced Software Engineer with Background in Leading Major Software Projects. \"I'm striving to transfer software industry experiences to the university and students.\" You are always welcome to contact me! Email: x@y (x=alidoostnia, y=sbu.ac.ir) Email: x@y (x=nnmehran, y=gmail.com) Short Bio Mehran Alidoost Nia currently is an Assistant Professor in the Faculty of Computer Science and Engineering at Shahid Beheshti University of Tehran, and has a PhD in Software Engineering from the University of Tehran. His research interests include Self-Adaptive and Autonomous Systems, Information Security, Formal Verification and Software Engineering. His research in PhD program was about probabilistic analysis of self-adaptive and autonomous systems entitled \"Runtime Probabilistic Analysis of Self-Adaptive Systems via Formal Approximation Techniques\", that was supervised by Mehdi Kargahi (University of Tehran) and Alessandro Abate (University of Oxford). He was a Programme Fellow at the University of York, and collaborated on Assuring Autonomy International Programme (AAIP) from 2020 to 2023. Mehran Alidoost Nia is also an IT Strategist, Chief Technology Officer and Software Architecture in major software/technology-based projects. He has deep experience in providing high-level IT solutions for business/industrial projects, development of advanced web technologies, a secure implementation of software systems, architectural design, advanced techniques in software engineering, major software productions, implementation of network/software infrastructures, and software technology development in the automotive industry. Recent PC Member of International Conferences: SEAMS 2026 (PC) PLDI 2025 (AEC) ARTMAN 2024 @ACSAC 2024 (PC) ECOOP 2024 (ERC) CyberC 2024 (PC) PLDI 2023 (AEC) ECOOP 2023 (AEC and ERC) PLDI 2022 (AEC) International Journal Referring: Computers & Security (Top Reviewer) IEEE Transactions on Dependable and Secure Computing (Actively Reviewing) IEEE Transactions on Information Forensics and Security (Actively Reviewing) Systems and Software (Actively Reviewing) IET Software Journal of Network and Computer Applications Sustainable Computing-Elsevier Wiley Security and Privacy IEEE Security & Privacy IET Generation, Transmission & Distribution The Journal of Supercomputing Security and Communication Networks Information Systems Frontiers Journal of Theoretical and Applied Electronic Commerce Research My Favorite Quotes \"In God We Trust; All Others Must Bring Data\" \"Don't let the noise of others' opinions drown out your own inner voice. And most important, have the courage to follow your heart and intuition.\"",
  "content_length": 3009,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:12"
}