{
  "name": "Meikang Qiu",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=MQIU",
  "status": "success",
  "content": "Meikang Qiu - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Meikang Qiu Professor Meikang Qiu Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber Sciences BioI have published extensively in AI, Cyber Security, Cloud Computing, Embedded Systems, IoT., and Bioinformatics. MQIU@augusta.edu UH 112 General Credentials Instruction Scholarship Service Education Ph.D., Computer Science. University of Texas Dallas, 2007 MSCS, Computer Science. University of Texas Dallas, 2003 Awards & Honors Life-Career Award IEEE Bio-inspired Computing Special Technical Community, 2023 Courses Taught Most Recent Academic Year CSCI 8940 Dissertation Research CSCI 8510 Independent Study: AI Cyber Security CSCI 7340 Machine Learning CSCI 7580 Computer Architecture Teaching Interests AI, Cyber Security, ML, Cloud Computing, Embedded Systems, IoT., and Quantum Computing. Scholarship Selected Recent Publications A Novel Sparse Active Online Learning Framework for Fast and Accurate Streaming Anomaly Detection Over Data Streams, 2025 Conference Proceeding Differentially Private Low-Rank Adaptation of Large Language Model Using Federated Learning, 2025 Journal Article, Academic Journal FLGuardian: Defending Against Model Poisoning Attacks via Fine-Grained Detection in Federated Learning, 2025 Journal Article, Academic Journal GraphFI: An Efficient Fault Injection Framework for Graph Processing on GPGPUs., 2025 Conference Proceeding Hierarchical Features Matter: A Deep Exploration of Progressive Parameterization Method for Dataset Distillation, 2025 Conference Proceeding Research Interests AI, Cyber Security, Cloud Computing, Embedded Systems, IoT., and Bioinformatics. Professional Service IEEE Internet of Things Journal 2022 - 2024 Role: Editor, Associate Editor IEEE Medical AI International Conference. 2022 - 2024 Role: Committee Chair Journal of Signal Processing Systems, Springer 2022 - 2024 Role: Editor, Associate Editor IEEE Transactions on System, Man, and Cybernetics: System 2020 - 2024 Role: Editor, Associate Editor 22nd International Conference on Cryptology and Network Security (CANS) 2023 - 2023 Role: Committee Member",
  "content_length": 2295,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:15"
}