{
  "name": "Meina Kan",
  "homepage": "http://vipl.ict.ac.cn/homepage/mnkan/index.html",
  "status": "success",
  "content": "Meina Kan----Visual Information Processing and Learning (VIPL) éç¾å¨ å¯ç ç©¶å çµå­é®ç®±: kanmeina@ict.ac.cn éè®¯å°å: åäº¬å¸æµ·æ·åºä¸­å ³æç§å­¦é¢åè·¯6å· ç ç©¶å ´è¶£: Computer Vision and Pattern Recognition Personal profile Meina Kan (éç¾å¨) is an Associate Professor with the Institute of Computing Technology (ICT), Chinese Academy of Sciences (CAS). She received the Ph.D degree in computer vision from the Institute of Computing Technology of the Chinese Academy of Sciences (ICT, CAS) under the supervision of Prof. Xilin Chen and Prof. Shiguang Shan in 2013, and the B.S. degree in computer science from Shandong University in 2007. During 2011, She has studied in Centre for Multimedia and Network Technology of School of Computer Engineering Nanyang Technological University, under the supervision of Prof. Dong Xu. Publication MORE Shuzhe Wu, Meina Kan, Shiguang Shan, and Xilin Chen. Hierarchical Attention for Part-Aware Face Detection. International Journal of Computer Vision (IJCV), vo. 127, no. 6-7, pp 560â578, June 2019. [PDF] Zhenliang He, Wangmeng Zuo, Meina Kan, Shiguang Shan, Xilin Chen. AttGAN: Facial Attribute Editing by Only Changing What You Want. IEEE Trans. on Image Processing (TIP), vol. 28, no. 11, pp. 5464 â 5478, 20 May 2019.. [PDF] Meina Kan, Shiguang Shan,Haihong Zhang, Shihong Lao, and Xilin Chen. Multi-view Discriminant Analysis. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), Jan, 2016. [PDF] [PDF] Chunrui Han, Shiguang Shan, Meina Kan, Shuzhe Wu, and Xilin Chen, \"Personalized Convolution for Face Recognition,\" International Journal of Computer Vision (IJCV), Accepted. Xuyang Guo, Meina Kan, Zhenliang He, Xiguang Song, Shiguang Shan. Image style disentangling for instance-level facial attribute transfer. Computer Vision and Image Understanding (CVIU), 2021. Nan Lai, Meina Kan, Chunrui Han, Xingguang Song, Shiguang Shan. Learning to Learn Adaptive Classifier-Predictor for Few Shot Learning. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 05 Aug. 2020. [PDF] Mingjie He, Jie Zhang, Shiguang Shan, Meina Kan, Xilin Chen. Deformable Face Net for Pose Invariant Face Recognition. Pattern Recognition (PR), vol.100, April. 2020. [PDF] Yuhao Ma, Meina Kan, Shiguang Shan, Xilin Chen. Learning deep face representation with long-tail data: An aggregate-and-disperse approach. Pattern Recognition Letters, 2020 [PDF]",
  "content_length": 2439,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:14"
}