{
  "name": "Meishan Zhang",
  "homepage": "https://zhangmeishan.github.io",
  "status": "success",
  "content": "张梅山 (Meishan Zhang) Meishan Zhang(张梅山) 更多信息(包括招生)，请参考中文主页 Harbin Institute of Technology (Shenzhen), China Associate Professor Contact: mason.zms (at) gmail.com google scholar Research Interest Parsing: Syntax Parsing, Semantic Parsing Large Language Model: Optimization, Inference Information Extraction: Event Analysis, Relation Extraction, Sentiment Analysis Intelligent Semantic Assistant: Domain-Specific(code, technology, etc.), Multimodal Interaction, etc Eduction Experience 2010.03--2014.10, SCIR, Harbin Institute of Technology, Computer Science and Technology, Doctoral Degree, Supervisor: Wanxiang Che, Ting Liu. 2005.09--2008.07, Graduate University of the Chinese Academy of Sciences, Computer Science and Technology, Master Degree, Supervisor: Lixiang Liu 2000.09--2004.07, China University of Geosciences(Wuhan), Physics, Bachelor Degree Research Experience 2019.04 -- 2023.08, Tianjin University, China, Associate Professor 2015.12 -- 2019.03, Heilongjiang University, China, Associate Professor 2014.11 -- 2015.11, SUTD, Postdoctoral Research Fellow, under the guide of Yue Zhang Academic Activities Senior Area Chair：ACL 2025, AACL-IJCNLP 2025, EMNLP 2022 Area Chair：ACL (2023-2024), EMNLP (2019,2021-2025), COLING (2022,2024), IJCAI 2021(SPC), AAAI 2023(SPC), NAACL 2024 Publications Preprints On The Role of Pretrained Language Models in General-Purpose Text Embeddings: A Survey Meishan Zhang, Xin Zhang, Xinping Zhao, Shouzheng Huang, Baotian Hu, Min Zhang. Language Models are Universal Embedders. Xin Zhang, Zehan Li, Yanzhao Zhang, Dingkun Long, Pengjun Xie, Meishan Zhang and Min Zhang. Towards general text embeddings with multi-stage contrastive learning. Zehan Li, Xin Zhang, Yanzhao Zhang, Dingkun Long, Pengjun Xie and Meishan Zhang. ChatIE: Zero-shot information extraction via chatting with ChatGPT Xiang Wei, Xingyu Cui, Ning Cheng, Xiaobin Wang, Xin Zhang, Shen Huang, Pengjun Xie, Jinan Xu, Yufeng Chen, Meishan Zhang, Yong Jiang and Wenjuan Han. 2025 When Words Smile: Generating Diverse Emotional Facial Expressions from Text. Haidong Xu, Meishan Zhang, Hao Ju, Zhedong Zheng, Erik Cambria, Min Zhang, Hao Fei In Proceedings of EMNLP 2025. Phased Training for LLM-powered Text Retrieval Models Beyond Data Scaling. Xin Zhang, Yanzhao Zhang, Wen Xie, Dingkun Long, Mingxin Li, Pengjun Xie, Meishan Zhang, Wenjie Li, Min Zhang In Proceedings of COLM 2025. SSRB: Direct Natural Language Querying to Massive Heterogeneous Semi-Structured Data. Xin Zhang, Mingxin Li, Yanzhao Zhang, Dingkun Long, Yongqi Li, Yinghui Li, Pengjun Xie, Meishan Zhang, Wenjie Li, Min Zhang, Philip S. Yu In Proceedings of NeurIPS 2025. Atomic Thinking of LLMs: Decoupling and Exploring Mathematical Reasoning Abilities. Jiayi Kuang, Haojing Huang, Yinghui Li, Xinnian Liang, Zhikun Xu, Yangning Li, Xiaoyu Tan, Chao Qu, Meishan Zhang, Ying Shen, Philip S. Yu In Proceedings of NeurIPS 2025. VimoRAG: Video-based Retrieval-augmented 3D Motion Generation for Motion Language Models. Haidong Xu, Guangwei Xu, Zhedong Zheng, Xiatian Zhu, Wei Ji, Xiangtai Li, Ruijie Guo, Meishan Zhang, Min zhang, Hao Fei In Proceedings of NeurIPS 2025. Adaptive Detoxification: Safeguarding General Capabilities of LLMs through Toxicity-Aware Knowledge Editing. Yifan Lu, Jing Li, Yigeng Zhou, Yihui Zhang, Wenya Wang, Xiucheng Li, Meishan Zhang, Fangming Liu, Jun Yu, Min Zhang In Proceedings of ACL Findings 2025. BrainECHO: Semantic Brain Signal Decoding through Vector-Quantized Spectrogram Reconstruction for Whisper-Enhanced Text Generation. Jilong Li, Zhenxi Song, Jiaqi Wang, Meishan Zhang, Honghai Liu, Min zhang, Zhiguo Zhang In Proceedings of ACL Findings 2025. Reflection on Knowledge Graph for Large Language Models Reasoning. Yigeng Zhou, Wu Li, Yifan Lu, Jing Li, Fangming Liu, Meishan Zhang, Yequan Wang, Daojing He, Honghai Liu, Min Zhang In Proceedings of ACL Findings 2025. Speed Up Your Code: Progressive Code Acceleration Through Bidirectional Tree Editing. Longhui Zhang, Jiahao Wang, Meishan Zhang, GaoXiong Cao, Ensheng Shi, mayuchi, Jun Yu, Honghai Liu, Jing Li, Min Zhang In Proceedings of ACL 2025. Contrastive Learning on LLM Back Generation Treebank for Cross-domain Constituency Parsing. Peiming Guo, Meishan Zhang, Jianling Li, Min Zhang, Yue Zhang In Proceedings of ACL 2025. Towards Text-Image Interleaved Retrieval. Xin Zhang, Ziqi Dai, Yongqi Li, Yanzhao Zhang, Dingkun Long, Pengjun Xie, Meishan Zhang, Jun Yu, Wenjie Li and Min Zhang. In Proceedings of ACL 2025. LLMs Can Also Do Well! Breaking Barriers in Semantic Role Labeling via Large Language Models. Xinxin Li, Huiyao Chen, Chengjun Liu, Jing Li, Meishan Zhang, Jun Yu, Min Zhang In Proceedings of ACL Findings 2025. Function-to-Style Guidance of LLMs for Code Translation. Longhui Zhang, Bin Wang, Jiahao Wang, Xiaofeng Zhao, Min Zhang, Hao Yang, Meishan Zhang, Yu Li, Jing Li, Jun Yu, Min Zhang In Proceedings of ICML 2025. Forecasting automobile sales with social media information under pandemic emergencies: evidence from Chinese automobile industry. Dian Huang, Zhaofang Mao, Kan Fang, Subodha Kumar, Meishan Zhang Annals of Operations Research 2025. Neural Chinese silent speech recognition with facial electromyography. Liang Xie, Yakun Zhang, Hao Yuan, Meishan Zhang, Xingyu Zhang, Changyan Zheng, Ye Yan, Erwei Yin Speech Communication 2025. Grammar Induction from Visual, Speech and Text. Yu Zhao, Hao Fei, Shengqiong Wu, Meishan Zhang, Min Zhang and Tat-seng Chua Artificial Intelligence 2025. An End-to-End Model for Photo-Sharing Multi-Modal Dialogue Generation. Peiming Guo, Sinuo Liu, Yanzhao Zhang, Dingkun Long, Pengju Xie, Meishan Zhang and Min Zhang In Proceedings of ICME 2025. GME: Improving Universal Multimodal Retrieval by Multimodal LLMs. Xin Zhang, Yanzhao Zhang, Wen Xie, Mingxin Li, Ziqi Dai, Dingkun Long, Pengjun Xie, Meishan Zhang, Wenjie Li and Min Zhang In Proceedings of CVPR 2025. Complex Open Information Extraction with Heterogeneous Syntax Forests. Meishan Zhang, Peiming Guo, Hao Fei and Min Zhang In Proceedings of ICASSP 2025. LaERC-S: Improving LLM-based Emotion Recognition in Conversation with Speaker Characterist. Yumeng Fu, Junjie Wu, Zhongjie Wang, Meishan Zhang, Lili Shan, Yulin Wu and Bingquan Liu In Proceedings of COLING 2025. 2024 The ACM Multimedia 2024 Viual Spatial Description Grand Challenge. Yu Zhao, Hao Fei, Bobo Li, Meishan Zhang, Min Zhang Proceedings of the 32nd ACMMM 2024, Workshop. mGTE: Generalized Long-Context Text Representation and Reranking Models for Multilingual Text Retrieval. Xin Zhang, Yanzhao Zhang, Dingkun Long, Wen Xie, Ziqi Dai, Jialong Tang, Huan Lin, Baosong Yang, Pengjun Xie, Fei Huang, Meishan Zhang, Wenjie Li and Min Zhang In Proceedings of EMNLP 2024, Industry Track. Cross-domain Constituency Parsing by Leveraging Heterogeneous Data. Peiming Guo, Meishan Zhang, Yulong Chen, Jianling Li, Min Zhang and Yue Zhang Journal of Artificial Intelligence Research (JAIR) 2024. AutoSurvey: Large Language Models Can Automatically Write Surveys. Yidong Wang, Qi Guo, Wenjin Yao, Hongbo Zhang, Xin Zhang, Zhen Wu, Meishan Zhang, Xinyu Dai, Min zhang, Qingsong Wen, Wei Ye, Shikun Zhang and Yue Zhang In Proceedings of NeurIPS 2024. Synergistic Dual Spatial-aware Generation of Image-to-text and Text-to-image. Yu Zhao, Hao Fei, Xiangtai Li, Libo Qin, Jiayi Ji, Hongyuan Zhu, Meishan Zhang, Min Zhang and Jianguo Wei In Proceedings of NeurIPS 2024. XNLP: An Interactive Demonstration System for Universal Structured NLP. Hao Fei, Meishan Zhang, Min Zhang and Tat-Seng Chua In Proceedings of ACL 2024, System Demostration Track (SDT). Holistic Exploration on Universal Decompositional Semantic Parsing: Architecture, Data Augmentation, and LLM Paradigm. Hexuan Deng, Xin Zhang, Meishan Zhang, Xuebo Liu and Min Zhang In Proceedings of SIGHAN-10, 2024. SpeechEE: A Novel Benchmark for Speech Event Extraction. Bin Wang, Meishan Zhang, Hao Fei, Yu Zhao, Bobo Li, Shengqiong Wu, Wei Ji and Min Zhang In Proceedings of ACM Multimedia 2024. LLM-Driven Multimodal Opinion Expression Identification. Bonian Jia, Huiyao Chen, Yueheng Sun, Meishan Zhang and Min Zhang In Proceedings of Interspeech 2024. Retrieval-style In-Context Learning for Few-shot Hierarchical Text Classification. Huiyao Chen, Yu Zhao, Zulong Chen, Mengjia Wang, Liangyue Li, Meishan Zhang and Min Zhang In Transactions of the Association for Computational Linguistics (TACL), 2024. Semantic Role Labeling from Chinese Speech via End-to-End Learning. Huiyao Chen, Xinxin Li, Meishan Zhang and Min Zhang In Proceedings of ACL Findings 2024. A Two-Stage Adaptation of Large Language Models for Text Ranking. Longhui Zhang, Yanzhao Zhang, Dingkun Long, Pengjun Xie, Meishan Zhang and Min Zhang In Proceedings of ACL Findings 2024. Towards Demonstration-Aware Large Translation Models. Chen Li, Meishan Zhang, Xuebo Liu, Zhaocong Li, Derek F. Wong and Min Zhang In Proceedings of ACL Findings 2024. Recognizing Everything from All Modalities at Once: Grounded Multimodal Universal Information Extraction. Meishan Zhang, Hao Fei, Bin Wang, Shengqiong Wu, Yixin Cao, Fei Li and Min Zhang In Proceedings of ACL Findings 2024. Video-of-Thought: Step-by-Step Video Reasoning from Perception to Cognition. Hao Fei, Shengqiong Wu, Wei Ji, Hanwang Zhang, Meishan Zhang, Mong Li Lee and Wynne Hsu In Proceedings of ICML 2024. Enhancing Video-Language Representations with Structural Spatio-Temporal Alignment. Hao Fei, Shengqiong Wu, Meishan Zhang, Min Zhang, Tat-Seng Chua and Shuicheng Yan IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2024. LLM-Assisted Data Augmentation for Chinese Dialogue-Level Dependency Parsing. Meishan Zhang, Gongyao Jiang, Shuang Liu, Jing Chen and Min Zhang. Computational Linguistics. 2024. Chinese Sequence Labeling with Semi-Supervised Boundary-Aware Language Model Pre-training. Longhui Zhang, Dingkun Long, Meishan Zhang, Yanzhao Zhang, Pengjun Xie and Min Zhang In Proceedings of LREC-COLING 2024. In-Context Learning ",
  "content_length": 28294,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:15"
}