{
  "name": "Melanie E. Moses",
  "homepage": "https://www.cs.unm.edu/~melaniem",
  "status": "success",
  "content": "Moses Biological Computation Lab We live in a complex world. Many of the greatest challenges in science and engineering require understanding how complex systems evolve, what makes them efficient, scalable and robust, and why they fail. Our highly interdisciplinary research in the Moses Biological Computation lab seeks to understand complexity in natural and engineered systems: we develop computational and mathematical models of biological systems (particularly ant colonies and immune systems) and we apply what we learn in biologically-inspired computation (particularly swarm robotics). I am/have been the PI on many programs that seek to diversify computer science, these programs I have trained over 3000 students, 75% of them women and/or students of color. These students have been historically underrepresented in STEM, particularly in Computer Science. Our team is changing that NOW! I am a Professor in UNM Computer Science with a secondary appointment in the UNM Department of Biology and am External Faculty of The Santa Fe Institute. - Melanie E. Moses These are some of the projects in the Moses lab: VolCAN SimCov Swarmathon MARIAM NASA Minds: Project ChiliHouse Lab Research Projects VolCAN NRI: INT: Adaptive Bio-inspired Co-Robot algorithms for volcano monitoring. This team is made of members from Computer Science, Biology, Electrical & Mechanical Engineering and Earth & Planetary Sciences. SimReef Creating a software model called SIMReef that represents millions of fish foraging for algae on coral reefs. Seeking to understand how fish, coral and algae interact in a changing ocean to predict how coral can best be protected in increasingly inhospitable conditions. SimCov Creating a software model simulating the response of the immune system to infections in the lungs. Swarmathon UNM-NASA Swarmathon was a competition that ran between 2015 and 2019 designed to engage students from Minority Serving Institutions to develop algorithms for cooperative robotics to revolutionize space exploration in development of algorithms for robotic resource collection to support human space exploration. Multi-Agent Robust Intelligent Autonomous Manipulation (MARIAM) Developing robust autonomous manipulation with multi-agent systems. The project is developing the algorithmic framework, simulations and physical robots to demonstrate autonomous cooperative transport of objects. NASA Minds: Project ChiliHouse Successful long-term missions to the moon and Mars will depend upon a robust food and medicine supply. However, material delivery and plant cultivation would be costly in fuel and personnel hours. CHILIHOUSE is a transdisciplinary team dedicated to developing autonomous plant cultivation systems with in-situ resources in support of Artemis. Our goals are to develop a planting design suited to fully autonomous cultivation in an extra-terrestrial environment. To accomplish this we will add support for ROS2, machine learning, and dexterous arms to the current robot design; explore pest control, determine minimum plant water requirements, and improve plant nutritional uptake while reducing reliance on soil. Astronauts reported that living plants benefited their quality of life by providing fresh flavors and reminders of home. Made with Templated.",
  "content_length": 3284,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:19"
}