{
  "name": "Melanie Volkamer",
  "homepage": "https://secuso.aifb.kit.edu/english/Staff_Volkamer.php",
  "status": "success",
  "content": "KIT - Secuso Staff Research Group Security • Usability • Society (SECUSO) StartpageStaff Main PageNewsEventsJob OffersStaffResearchTeachingSECUSO for CitizensStaffHead of the research groupAdministrative staffPostdoctoral researchersResearch associatesStudent assistants Prof. Dr. Melanie Volkamer Head of the research groupGroup: SECUSOOffice Hours: n.V.Room: 3A-27CS 05.20Phone: +49 721 608-47362melanie volkamer ∂does-not-exist.kit edu ContactPGP-Key: Key Fingerprint: CB10 B22F E66F 67CB CEA7 ED61 70CB 0F34 BBFE D447 S/MIME-Certificate: Certificate Curriculum VitaeProf. Dr. Melanie Volkamer is a full professor at KIT in the Department of Economics and Management. She leads the SECUSO research group. From August 2016 until March 2018 she was a Professor (Kooperationsprofessur) at the Department of Computer Science of Technische Universität Darmstadt (Germany). From December 2015 until December 2018, she has been appointed Full Professor for Usable Privacy and Security at Karlstad University (Sweden). Before she was an Assistant Professor at TU Darmstadt. Prof. Volkamer has been heading the research group \"SECUSO - Security, Usability and Society\" since 2011. From May 1st to August 31st 2011, she worked as a visiting researcher at CMU/CUPS. Research Interests Human factors in security and privacy Mental models Usable security and privacy Awareness Security education Electronic voting Education Human factors in security and privacy Mental models Usable security and privacy Awareness Security education Electronic voting Academic Work Experiences Since 01/2018 Professor (W3) for Security Engineering Karlsruhe Institute of Technology 08/2016-03/2018 Professor (W3 Kooperationsprofessur) for Security, Usability, and Society Technische Universität Darmstadt 12/2015-12/2017 Full Professor for Usable Privacy and Security (till end of March 2016 part time): Karlstad University, Sweden Privacy and Security Research Group 01/2012-08/2016 Assistant Professor (since April 2016 part time): Research Group SECUSO (Security, Usability and Society) at the Technische Universitat Darmstadt (TU Darmstadt) - successfully evaluated in 2014; Head of the Usable Security Lab at the Center for Advanced Security Research Darmstadt (CASED) 12/2008-01/2012 Post Doctoral Researcher: TU Darmstadt / Research Area Coordinator: CASED 05/2011-07/2011 Guest Researcher: Carnegie Mellon University 03/2007-11/2008 Research Assistant: University of Passau Research Manager: Institute of IT-Security and Security Law 01/2007-02/2007 Guest Researcher: TU Eindhoven 05/2004-12/2006 Research Assistant: German Research Center for Artificial Intelligence Awards and Distinctions 2022 Federal Consumer Protection Award from the German Consumer Protection Foundation (“Deutsche Stiftung Verbraucherschutz”, DSV) 2022 Digital Autonomy Award: Privacy Friendly Apps 2020 Facebook Research Award: Secure and usable authentication for AR & VR Head-Mounted Displays 2019 Google Faculty Research Award: Link-centric Phishing Warnings for Online Email Clients 2018 Best Paper Award ACM SAC 2012 / 2013 Best Paper Awards: TRUST 2013, ICIMP 2012, and EVOTE 2012 2011 Assistant Professorship: University of Bonn (rejected) DAAD (German Academic Exchange Service) Post Doctoral Scholarship: Carnegie Mellon University (Cylabs for Usable Privacy and Security, Prof. L. F. Cranor) ERCIM Post Doctoral Scholarship at NTU und SBA Research (rejected) 2009 Winner: Ph.D. Award from the University of Koblenz-Landau Nominated and citation: Ph.D. Award - German computer science society (GI) 2008 Invited Expert: German Federal Constitutional Court - evoting concerns Invited Expert: Council of Europe - development of evoting recommendations 2007 Invited Expert: OSCE - election observation mission to Estonia (Internet voting) Invited Expert: City of Hamburg - evoting concerns (digital election pen) Invited Expert: Council of Europe - development of evoting recommendations DAAD Ph.D. Scholarship: Technical University Eindhoven (Prof. B. Schoenmakers) 2006 TED Scholarship: National University of Ireland (Prof. P. Gibson, Dr. M. McGaley) 2004 Diploma Thesis Award of the Federal Office for Information Security (BSI) Projects Current projects Previous projects TeachingInformation about current and past teaching activites is provided here. 2014/2015 Lecturer: Einführung in Trusted Systems (TU Darmstadt) 2014 Lecturer: Human Centered Security Experimentation (TU Darmstadt) 2014 Lecturer: Security, Usability and Society (TU Darmstadt) 2013/2014 Lecturer: Electronic Voting (TU Darmstadt) 2012 Lecturer: Usable Security: Sozio-technische Aspekte der Informationssicherheit (TU Darmstadt) 2012/2013 Seminar (as Conference Seminar): Usable Security and Electronic Voting (TU Darmstadt) 2012 Lecturer: Electronic Voting: 3ETCS (TU Darmstadt) 2012 Programming Course: Several topics in the context of Usable Security and Electronic Voting (TU Darmstadt) 2011/2012 Seminar (as Conference Seminar): Usable Security (TU Darmstadt) 2011/2012 Crypto Programming Course: Several topics in the context of Usable Security and Electronic Voting (TU Darmstadt) 2010/2011 Seminar (as Conference Seminar): Usable Security (TU Darmstadt) 2010 Lecturer: Electronic Voting: 3 ECTS (TU Darmstadt) 2005 Seminar Organization: Electronic Voting (Saarland University) 2004-2006 Lecture Assistance: IT-Security (Saarland University) Supervision Current supervisions Past supervisions Scientific Services Conference/ Workshop Organization EuroUSEC 2016 & 2022, E-Vote-ID 2016-2022, ARES 2020; Dagstuhl Seminar “Biggest Failures in Security”; USEC 2017, Innovations in Mobile Privacy and Security (ESSoS Workshop) 2016, STAST (CSF Workshop) 2015, Usable Security Day , EVOTE 2012-2014, E-Voting 2013, RiskCom 2011, TRUST 2011, Usable Security and Privacy 2011; Re-Vote 2011; eVoting Ph.D. Workshop 2006, 2008, 2009, and 2011; CAST Workshop eVoting 2008 - 2010; VOTE-ID 2007. PC Membership/ Editorial Board ACM Journal „Transaction on Privacy and Security”(TOPS) since 2021; CHI 2020, 2023; EIS 2022; SAC 2020; Sicherheit 2020; SPOSE 2019-2022; STAST 2019; WI 2019; USEC 2016 and 2015; FC EVoting workshop 2016; IFIP SEC 2016, 2015 and 2011; TRUST COM 2015, 2012, and 2011; JETS – The USENIX Journal of Election Technology and Systems 2013 - 2015; VOTE-ID 2007-2015; SOUPS 2014 and 2012; HICSS 2014; HCI International 2013 and 2014 ’Human Aspects of Information Security, Privacy, and Trust’; GI Security 2016, 2014, and 2010; STAST 2011 - 2014; EGOVIS & EDEM 2012 and 2014; TRUST 2012 and 2013; IRIS 2006 - 2013; Book ’Design, development, and use of secure electronic voting Systems’ 2013; EVT/WOTE 2011 and 2012; IWSSI 2012; British HCI 2011; CeDem 2011; ARES 2006 - 2011; EDem 2007 - 2011; Re-Vote 2009 and 2011; EVOTE 2006, 2008, and 2010; E-Voting 2008 - 2010; CAST Award 2006 - 2009. Reviewer CHI 2014 - 2016; Journal of Cybersecurity 2015; TDSC (IEEE Transactions on Dependable and Secure Computing Journal) 2014; IJHCS (International Journal of Human-Computer Studies) 2014; Computer & Security 2014; IEEE Security & Privacy 2013 and 2014; and JISA (Journal of Information Security and Applications) 2013. Membership ACM since 2014-2022, GI since 2005; election oﬃcial (GI elections 2005 and 2007); Head of GI group ECOM 2010-2016; GI working group (WG) CC-Schutzproﬁle 2007-2010; FIDIS Ph.D. consortium 2005 - 2007; IFIP WG ’Research on Information Systems in Public Administration’ since 2007 and ’Human Aspects of Information Security and Assurance’ since 2012; Deutscher Hochschulverband (DHV) since 2011. Publikationen 2026 Voting Under Pressure: Perceptions of Counter-Strategies in Internet VotingNissen, C.; Hilt, T.; Budurushi, J.; Volkamer, M.; Kulyk, O.2026. Electronic Voting – 10th International Joint Conference, E-Vote-ID 2025, Nancy, France, October 1–3, 2025, Proceedings. Ed.: D. Duenas-Cid, 158–174, Springer Nature Switzerland. doi:10.1007/978-3-032-05036-6_10 Development and Expert Evaluation of an Informative Video Concerning Verifiable Internet VotingHilt, T.; Moser, F.; Matheis, P.; Volkamer, M.2026. Electronic Voting – 10th International Joint Conference, E-Vote-ID 2025, Nancy, France, October 1–3, 2025, Proceedings. Ed.: D. Duenas-Cid, 107–123, Springer Nature Switzerland. doi:10.1007/978-3-032-05036-6_7 2025 RFC 9116 („security.txt“) an deutschen HochschulservernEckstein, F.; Rosenauer, R.; Huppert, P.; Volkamer, M.; Herrmann, D.2025. Datenschutz und Datensicherheit, 49 (8), 522–526. doi:10.1007/s11623-025-2132-1 Restricting the Link: Effects of Focused Attention and Time Delay on Phishing Warning EffectivenessPetelka, J.; Berens, B.; Sugatan, C.; Volkamer, M.; Schaub, F.2025. 2025 IEEE Symposium on Security and Privacy (SP), San Francisco, CA, 12-15 May 2025, 55–73, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/SP61157.2025.00007 Project Report HSF Research Area 4 -Graphical Authentication on Augmented RealityVolkamer, M.2025. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000179759 SoK: The past decade of user deception in emails and today’s email clients’ susceptibility to phishing techniquesVeit, M. F.; Wiese, O.; Ballreich, F. L.; Volkamer, M.; Engels, D.; Mayer, P.2025. Computers & Security, 150, 104197. doi:10.1016/j.cose.2024.104197 Manuelles Löschen von Phishing-Nachrichten aus Mitarbeiterpostfächern : Rechtliche und technische GrenzenHunter, J. C.; Ballreich, F. L.; Kemmler, K. J.; Volkamer, M.2025. Zeitschrift für Digitalisierung und Recht (ZfDR), 5 (1), 23–43 Voting and verification process using a cast-as-intended verifiability approach with a second deviceHilt, T.; Berens, B.; Truderung, T.; Udovychenko, M.; Neumann, S.; Volkamer, M.2025. doi:10.5445/IR/1000178558 Interim Report of the Leibniz Science Campus \"Digital Transformation of Research\" (DiTraRe) | Version v1Jacyszyn, A. M.; Bach, F.; Sack, H.; Noe, C.; Albiez, M.; Barthlott, S.; Becker, S.; Boehm, F.; Bonatto Minella, C.; Dähms, A. S.; Eberhardt, T.; Jung, N.; Ke",
  "content_length": 99426,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:19"
}