{
  "name": "Melissa R. Ho",
  "homepage": "http://www.melissadensmore.com",
  "status": "success",
  "content": "Melissa R. Densmore Melissa R. Densmore Associate Professor, University of Cape Town Department of Computer Science Director, Human-Computer Interaction Lab Coordinator, Hasso Plattner Institute Research School at UCT Treasurer and Founder, ACM SIGCHI ProteaCHI Chapter Information, Communications Technology, and Development (ICTD) Content and Service Innovation in Bandwidth-constrained Communities Family-centered Maternal and Child Health iNethi Project: Fostering Conent and Services for Community Wireless Networks I am a human-computer interaction for development (HCI4D) researcher, with a specific focus on the uses of new information technology and interfaces for healthcare in Africa. Actually, I've also dabbled in solar powered lighting for hospitals in rural Nigeria and Uganda, done some IT for education in Mexico, and helped out with wireless deployments in India, so I've been known to think about other problems as well, but my primary focus (i.e. my dissertation) is on information technology for healthcare in Africa. My motivation runs something like this: (A) I'm pretty good (compared to some, not so much compared to a lot of my colleagues ) at computers and actually get pretty obsessed with them at times. (B) God has placed a special and specific compassion in my heart for the needs of Africa. Since I'm absolutely sure that (A) is not a coincidence, and because God has managed to do a lot of things in my life to make this possible, I'm using (A) to address (B). Prior to joining UCT, I completed a post-doc in the Technology for Emerging Markets group at Microsoft Research in Bangalore, India. I did my PhD at the University of California, Berkeley School of Information, where my dissertation committee was Dean AnnaLee Saxenian (co-chair), Prof. John Chuang (co-chair), Prof. Eric Brewer and Prof. Jenna Burrell. My work experience is in user interface and web application design, so my research also involves human-computer interaction, participatory design, and action research. By combining a theoretical approach with an experiential interaction, my work most closely approaches applied anthropology. My dissertation was primarily ethnographic - as part of my work I traveled five times to Uganda, with my main fieldwork occuring during a 15 month stay from January 2009 to the beginning of April 2010. While this work included the deployment of technology, my primary work was observation and inquiry, and my study was structured to enable me to deliberately step back from my role as a technologist, both to ensure sustainability of the deployment in my absence, but also so I would have the time to observe social dynamics as they emerged around the deployment over time. During my stay in Uganda volunteered as a lecturer teaching Object-Oriented Programming in Java to 225+ first year students at the Mbarara University of Science and Technology Institute of Computer Science. I know this page is sort of 1995, but that's the easiest way to make lots of info available in the lowest number of bytes on the web (without compressing the text). If you are a prospective PhD or MSc student, please read my Guide for prospective graduate students prior to contacting me. Please note: publications prior to 2010 have been published under my previous name of Melissa R. Ho. My full list of projects and publications can be found on my Google Scholar profile. University of Cape Town, South Africa   Aug 2014  Present Associate Professor, Department of Computer Science Coordinator, Hasso-Plattner Institute Research School at UCT in Information and Communications Technology for Development Director, Human Computer Interaction Lab Member, Telkom Centre of Excellence in Broadband Networks and Applications Chair, Faculty of Science Research Ethics Committee Deputy Chair, Inter-faculty Human Research Ethics Committee Member, Innovation Builder Fund Steering Committee Member, Adult Teaching and Learning Subcommittee Member, Ethics in Research Committee Student Advisor Current Projects in ICTD, Human-Computer Interaction, and Networking SmartHydro  co-designing applications of AI-enabled hydroponics in marginalized communities. Gender Just Co-Design (GeJuSTA)  investigating community-centered gender analysis tools, and gender-just co-design methods. ParentCoach  participatory design of a chatbot for parenting advice. Inethi Community Wireless Co-Design  partnering with community members to co-create new interactions enabled by localized wireless infrastructure for townships and other communities in Cape Town. Speculating AI Futures in Communities  using speculative and co-design approaches to work with community members and artists to articulate visions for inclusive artificial intelligence futures. Secret History Mobile Application  supporting empathy training of midwives through digital interactive branching stories. Teaching Mobile Design and Development (2nd yr); Advanced Software Development (3rd yr); Postgraduate Research Methods; Software Engineering (MSc IT); Human Computer Interaction (MSc IT, Honours, Masters); Intro to ICT4D (Masters) Course Convenor for Conversion Masters in Information Technology Postdoctoral Fellows               Topic/Project                         Years Ben Akhigbe (w/HS)              Usability of Digital Libraries       2021  2022 Hafeni Mthoko (w/TD)          Inethi (social), MCH                  2018  2019 indicated fellows were co-supervised with Hussein Suleman (HS) and Tania Douglas (TD) PhD Students                          Topic/Project                         Years Rachel Oluwatuyi               Co-Design of IoT Hydroponics 2024  Present Tochukwu Egesi (1st w/JA)     Fibre Landings in Nigeria          2024  Present Sarina Till (1st w/AH)              IoT in Rural Settings                  2020  Present Jaydon Farao                       Digital Storytelling                     2020  Present Sarah Dsane-Nsor (1st w/YJ)   Health Info Seeking                  2019  Present Natasha Zlobinsky (2nd w/DJ) Inethi (wireless)                         2017  2023 C Wanjiru Mburu (1st w/YJ)    Design for Neonatal ICUs         2017  2022 Amreesh Phokeer (2nd w/DJ)   Inethi (architecture)                   2016  2021 Richard Maliwatu (2nd w/DJ)  Inethi (wireless)                         2015  2021 Yamiko Msosa (2nd w/MK)      Medical Guidelines                    2015  2018 Fiona Ssozi (1st w/UR, EB)        Participatory Design for Water   2014  2024 Ntwa Katule (1st w/UR)           intermediated health                  2014  2018 Josiah Chavula (2nd w/HS)       African NRENs                        2014  2017 Maletabisa Molapo           Co-Design                               2014  2018 indicated students were co-supervised with Alastair van Heerden (AH), David Johnson (DJ), Maria Keet (MK), Hussein Suleman (HS), Ulrike Rivett (UR), Edwin Blake (EB), Jessica Auerbach Jahajeeah (JA), and Yaseen Joolay (YJ) Masters Students                     Degree    Topic/Project          Year Vimo Pillay                         MSc IT    Speculative AI            2024  Present Sierra Van Riel                    MSc CS    GeJUSTA                 2023  Present Diana Rangel Lopes De Campos MSc IT    chatbot usage             2023  2024 Deborah Talbot                   MSc IT    Milk Matters              2023  2024 Leina Meoli                         MSc CS    chatbot co-design      2022  Present Sharifa Negesa                    MSc CS    interactive stories        2022  2024 Toshka Coleman                 MSc CS    CoMaCH                  2021  2023 Ndinelao Iitumba               MSc CS    Network Mgmt UX   2021  2024 Masharty Tembo                 MSc IT    Stokvel App              2021  2024 Dominique Oosthuizen       MSc IT    Data Constraints        2020  2022 Maxine Mathijssen              MSc IT    Safety Mobile App     2020  2021 June Jian                             MSc IT    Co-Design                2019  2021 Ntsako Mgiba                     MSc IT    mobile design            2019  Present Sarina Till                            MSc IT    mobile security           2018  2019 Chelsea-Joy Wardle             MSc CS    Design for Mothers    2017  2019 Michael Graaf                     MPhil IT  Wikipedia                  2017  2018 Grace Jegede                       MSc CS    Co-Design                2016  Present Magdalene Lamola (2nd w/DJ) MSc CS    Inethi (wireless)          2016  2020 indicated students are co-supervised with David Johnson (DJ) External Examinations and Dissertation Committees Moreblessing Ngwenya       MSc CS NMMU, South Africa    2022 Lindokhule Sindiso Duma   MSc CS UWC, South Africa        2017 Ariel Schwartz                     PhD     UT Austin, USA            2015 Genevieve Chang                 MSc IT UCT, South Africa         2015 Education University of California, Berkeley                             Aug 2005  May 2012 PhD in Information, Management, and Systems Research Interests: Human-Computer Interaction for Development, Health Informatics, Mixed Methods Research, Mobile Technology for Development Thesis Title: The Evolving Braid: An Ethnography of Technology Change in Developing Regions Committee: AnnaLee Saxenian, co-chair (School of Information) John Chuang, co-chair (School of Information) Eric Brewer (Computer Science Division) Jenna Burrell (School of Information) University College London, United Kingdom             Sept 2002  Sept 2003 M.Sc. Data Communications, Networks, and Distributed Systems Thesis Title: Improving Resource Consumption for Epidemic Routing in Intermittently Connected Networks Advisor: Stephen Hailes (Computer Science) Cornell University, Ithaca, New York, United States     Aug 1995  January 1999 Bachelor in Computer Science Related Research Experience Microsoft Research India, Bangalore, India Aug 2012  June 2014 Postdoctoral Researcher, Technology for Emerging Markets ASHA-Assist: quantitatively evaluating persuasive",
  "content_length": 47646,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:19"
}