{
  "name": "Melvin A. Breuer",
  "homepage": "http://ee.usc.edu/faculty_staff/faculty_directory/breuer.htm",
  "status": "success",
  "content": "CILQ People - USC Viterbi | Ming Hsieh Department of Electrical and Computer Engineering CILQ People CILQ Staff John Diaz Administrative Assistant Office: EEB 500 (213) 740-4450 johnd@usc.edu Corine Wong Budget Business Analyst Office: EEB 500 (213) 740-4685 corinewo@usc.edu Susan Wiedem Budget Business Analyst Office: EEB 500 (213) 740-7875 wiedem@usc.edu CILQ Faculty Salman AvestimehrDean's Professor of Electrical and Computer Engineering and Professor of Electrical and Computer Engineering and Computer Science Todd Andrew BrunProfessor of Electrical and Computer Engineering, Computer Science, and Physics and Astronomy Keith Michael ChuggProfessor of Electrical and Computer Engineering Brandon FranzkeSenior Lecturer of Electrical and Computer Engineering Daniel Amihud LidarViterbi Professorship in Engineering and Professor of Electrical and Computer Engineering, Chemistry, and Physics and Astronomy William Clyde LindseyProfessor Emeritus of Electrical and Computer Engineering Urbashi MitraGordon S. Marshall Chair in Engineering and Professor of Electrical and Computer Engineering and Computer Science Andreas MolischSolomon Golomb - Andrew and Erna Viterbi Chair, and Professor of Electrical and Computer Engineering Michael James NeelyProfessor of Electrical and Computer Engineering Benjamin W. ReichardtAssociate Professor of Electrical and Computer Engineering and Computer Science Alan E. WillnerAndrew and Erna Viterbi Professorial Chair and Distinguished Professor of Electrical and Computer Engineering test Published on May 22nd, 2018Last updated on October 6th, 2025 About← BackAbout ECEDepartment LeadersChair’s WelcomeAwards and HonorsVisit UsJoin Us← BackOpen PositionsOpen Faculty PositionsAcademics← BackBachelor of Science ProgramsMaster of Science ProgramsDoctor of Philosophy ProgramsAdmissionResearchPeople← BackStaffFacultyAlumniMing HsiehGroups← BackGroupsCenters← BackAmazon CenterMeta CenterCapital One CenterFaculty StartupsMing Hsieh Institute (MHI)Student Resources← BackBachelor of ScienceMaster of ScienceDoctor of PhilosophyStudent Services FAQsFaculty Office HoursEvents← BackEvents CalendarLectures & SeminarsNews← BackECE NewsMedia CoverageAbout ECEBest Paper AwardsChair’s WelcomeThe Shannon CentenaryNewsLectures & SeminarsFaculty HonorsStudent Awards",
  "content_length": 2304,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:22"
}