{
  "name": "Mengfei Ren 0001",
  "homepage": "https://mengfei-ren.github.io",
  "status": "success",
  "content": "Mengfei RenMengfei RenAssistant ProfessorDepartment of Computer ScienceBaylor UniversityAbout MeI am an Assistant Professor in the Department of Computer Science at Baylor University. I received my Ph.D. degrees in Computer Science from The University of Texas at Arlington. Prior to joining Baylor, I was an Assistant Professor in the Dept. of Electrical and Computer Engineering at University of Alabama in Huntsville.My research focuses on Software Engineering. Specifically, I am dedicated to developing comprehensive analysis and testing frameworks to enhance correctness and robustness of IoT ecosystems, modern compilers and ad-hoc ecosystems. Download CVInterestsIoT Wireless Protocol TestingModern Compilers/Decompilers AnalysisAd-hoc Ecosystems TestingEducationPhD in Computer Science - 2023University of Texas at ArlingtonMSc in Computer Science - 2013University of Texas at ArlingtonBSc in Computer Science - 2011China Univeristy of Petroleum🧑‍🎓 Prospective StudentsI am continuously seeking proactive Ph.D. candidates interested in advancing research in Software Testing. Prospective candidates should possess a strong foundation in computer science or software engineering, with a focus on program analysis, testing, operating systems, and proficient programming skills (C, C++, Python, Java). If this opportunity aligns with your interests, please reach out to me. See current openings in here.Recent News🧑‍🏫 Join Baylor UniversityAug 1, 2025I will join the Computer Science Department at Baylor University in Fall 2025.Read moreAug 1, 2025🎉 New Paper AcceptedApr 5, 2025One collaborative paper has been accepted by FSE 2025Read moreApr 5, 2025🎉 New Paper AcceptedFeb 17, 2025One collaborative paper has been accepted by HOST 2025Read moreFeb 17, 2025See allFeatured PublicationsSoftware Engineering[FSE '25] Revisiting Optimization-Resilience Claims in Binary Diffing Tools: Insights from LLVM Peephole Optimization AnalysisApr 7, 2025Hardware Security[HOST '25] Low-entropy Packed Binary Detection via Accurate Hardware Events ProfilingFeb 17, 2025Software SecuritySoftware Vulnerability Analysis Across Programming Language and Program Representation Landscapes: A SurveyFeb 17, 2025IoT Security[ESORICS '23] Intelligent Zigbee Protocol Fuzzing via Constraint-Field Dependency InferenceSep 25, 2023Systems[ASPLOS '22] One Size Does Not Fit All: Security Hardening of MIPS Embedded Systems via Static Binary Debloating for Shared Libraries🏆 Artifact Badges: Available, Functional, Reproduced. 🏅 Shortlisted for IEEE Top Picks in Hardware and Embedded Security 2023Feb 22, 2022See all publicationsRecent PublicationsSee All Publications » Abdullah Al Noman, Samson Olugbenga Idowu, Rolly Davany Mougoue Kakanou, Paolo Ciancarini, Mengfei Ren (2025). An AI-based Security Solution for DevSecOps. In Proceedings of the 2025 International Symposium on Intelligent Computing and Networking (ISICN 2025). Cite DOI Mengfei Ren, Xiaolei Ren, Huadong Feng, Jiang Ming, Yu Lei (2022). Security Analysis of Zigbee Protocol Implementation via Device-Agnostic Fuzzing. In ACM Journal Digital Threats Research and Practice (DTRAP). Cite DOITeaching & ServicesTeaching Courses[Baylor] CSI 3373: Software Assurance and Testing[UAH] CPE 212: Fundamental of Software Engineering[UAH] CPE 645/CS 685: Applied Cryptography[UTA] CSE 4380/5380 Lab: Information Secuirty IProfessional ServicesTechnical Program Committee[SoutheastCon] IEEE SourtheastCon: 2024, 2025[JSS] The Journal of Systems & SoftwareContact✉ Email: Mengfei_Ren[AT]baylor[dot]edu📫 Address: Department of Computer Science, One Bear Place #97141, Waco, TX 76798-7141",
  "content_length": 3628,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:23"
}