{
  "name": "Meng Li 0004",
  "homepage": "https://mengli.me",
  "status": "success",
  "content": "Meng Li's Homepage Search Meng Li Assistant Professor Institute for Artificial Intelligence School of Integrated Circuits Peking University Biography I am currently a tenure-track assistant professor jointly affiliated with Institute for Artificial Intelligence and School of Integrated Circuits in Peking University. Before joining Peking University, I was a staff research scientist and tech lead in Meta On-Device AI team with a focus on researching and productizing efficient AI algorithms and hardwares for next generation AR/VR devices. I received my Ph.D. degree in the Department of Electrical and Computer Engineering, University of Texas at Austin under the supervision of Prof. David Z. Pan and my bachelor degree in Peking University under the supervision of Prof. Ru Huang and Prof. Runsheng Wang. My research interests focus on efficient and secure multi-modality AI acceleration algorithms and hardwares. I am always looking for creative and self-motivated students and post docs who are interested in co-designing the future AI acceleration algorithm and system for efficiency and privacy. Please contact me via email with the subject line “Prospective Student from [Your Institute]” and your CV. (I have finished the Ph.D. student recruiting for 2024. If you are interested in applying for 2025, contact me early.) Download my resumé. Interests Efficient and Secure Multi-Modality Artificial Intelligence Algorithm/Hardware Co-Design/Co-Optimization Education PhD in Computer Engineering, 2018 University of Texas at Austin, Austin, Tx, USA MS in Computer Engineering, 2015 University of Texas at Austin, Austin, Tx, USA BS in Microelectronics, 2013 Peking University, Beijing, China Research Focus Efficient AI Algorithm Multi-Modal AI AI/HW Co-Design News Zizhuo Won ACM/SIGDA SRC First Place Congratulations to Zizhuo Fu (senior student in the SEC Lab) for winning the first place in ACM/SIGDA Student Research Competition (Undergraduate Category). Zizhuo joined the SEC Lab since his sophomore year and will continue to pursue his PhD degree under the joint supervision of Prof. Runsheng Wang and me. Last updated on Nov 5, 2025 One Paper Accepted by ASPLOS'2026 One paper on efficient embodied AI system is accepted by ASPLOS'2026 as a regular paper. The title of the paper is “CREATE: Cross-Layer Resilience Characterization and Optimization for Efficient yet Reliable Embodied AI Systems”. Last updated on Nov 4, 2025 One Paper Accepted by ASSCC'2025 One paper on efficient embodied AI is accepted by ASSCC'2025 as regular papers. In the paper, we designed and taped out a 28nm 534.6TOPS/W edge accelerator for embodied AI using stochastic computing, which supported mixed precision and sparsity. Last updated on Nov 6, 2025 Three Papers Accepted in NeurIPS 2025 We have 3 papers accepted by NeurIPS'2025 on privacy-preserving AI (PPAI) and efficient embodied AI. The 2 papers on PPAI are “CryptoMoE: Privacy-Preserving and Scalable Mixture of Experts Inference via Balanced Expert Routing” and “MPCache: MPC-Friendly KV Cache Eviction for Efficient Private LLM Inference”. The paper on embodied AI is “EfficientNav: Towards On-Device Object-Goal Navigation with Navigation Map Caching and Retrieval”. Last updated on Sep 19, 2025 One Survey Paper on PPML posted on Arxiv Our latest survey paper on privacy-preserving ML (PPML) is posted on Arxiv. The paper summarizes the recent progress on efficient PPML across algorithm, protocol, and system levels. The title of our paper is “Towards Efficient Privacy-Preserving Machine Learning: A Systematic Review from Protocol, Model, and System Perspectives”. We also prepare a Github repo to continue tracking all the relevant papers in the field “https://github.com/PKU-SEC-Lab/Awesome-PPML-Papers”. Last updated on Aug 11, 2025 See all Experience Tenure-Track Assistant Professor Peking University Jul 2022 – Present Beijing Institute of Artificial Intelligence Staff Research Scientist Meta Sep 2018 – Jul 2022 California Experience: 2018.09 - 2020.01 Research Scientist 2020.01 - 2021.06 Senior Research Scientist 2021.06 - 2022.07 Staff Research Scientist Responsibilities include: Tech Lead, On-Device AI, Meta Reality Lab Efficient NN for AR Glasses Efficient NN/HW Co-Design/Co-Optimization Research Intern arm May 2017 – Aug 2017 California Privacy-preserving neural network training, including federated learning with non-IID data and PrivyNet with split network architectures Research Intern arm May 2016 – Aug 2016 California Cross-level monte carlo framework for system vulnerability evaluation against fault attack Research & Design Intern Cadence Design System May 2014 – Aug 2014 California Static timing analysis acceleration Recent Talks Efficient Private Transformer Inference through Network/Protocol Co-optimization Discuss the recent NeurIPs'2024 paper from our lab on joint network/protocol optimization to enable efficient private Transformer inference. Oct 19, 2024 11:00 AM — 12:00 PM Efficient Private Inference through Network/Protocol Co-optimization Discuss the recent works from our lab on joint network/protocol optimization to enable more efficient privacy-preserving AI. Jan 24, 2024 11:00 AM — 12:00 PM Neural Acceleration with Full Stack Optimization Discuss the recent works from our lab on full stack optimization to enable accurate yet efficient AI acceleration for multi-modal applications. Jan 20, 2024 11:00 AM — 12:00 PM Efficient Multi-Modal AI Acceleration Discuss the recent works from our lab on full stack optimization to enable accurate yet efficient AI acceleration for multi-modal applications. Jun 7, 2023 11:00 AM — 12:00 PM Efficient Audio-Visual Understanding on AR Devices Discuss full stack techniques from training, optimization, hardware, etc perspectives to enable efficient audio-visual understanding on AR devices Nov 5, 2021 11:00 AM — 12:00 PM See all events Recent Publications More detailed publication lists available through Google Scholar Quickly discover relevant content by filtering publications. Tong Xie, Yijiahao Qi, Jinqi Wen, Zishen Wan, Yanchi Dong, Zihao Wang, Shaofei Cai, Yitao Liang, Tianyu Jia, Yuan Wang, Runsheng Wang, Meng Li (2026). CREATE: Cross-Layer Resilience Characterization and Optimization for Efficient yet Reliable Embodied AI Systems. In International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS) 2026. Yifan Zhou, Tianshi Xu, Jue Hong, Ye Wu, Meng Li (2025). CryptoMoE: Privacy-Preserving and Scalable Mixture of Experts Inference via Balanced Expert Routing. In Conference on Neural Information Processing Systems (NeurIPs) 2025. Zebin Yang, Sunjian Zheng, Tong Xie, Tianshi Xu, Bo Yu, Fan Wang, Jie Tang, Shaoshan Liu, Meng Li (2025). EfficientNav: Towards On-Device Object-Goal Navigation with Navigation Map Caching and Retrieval. In Conference on Neural Information Processing Systems (NeurIPs) 2025. Wenxuan Zeng, Ye Dong, Jinjin Zhou, Jin Tan, Lei Wang, Tao Wei, Runsheng Wang, Meng Li (2025). MPCache: MPC-Friendly KV Cache Eviction for Efficient Private LLM Inference. In Conference on Neural Information Processing Systems (NeurIPs) 2025. Tengyu Zhang, Chenqi Lin, Jiangrui Yu, Shuwen Deng, Meng Li (2025). FENIX: Flexible and Efficient Hybrid HE/MPC Acceleration with Near-Memory Processing. In International Conference on Computer-Aided Design (ICCAD) 2025. Zizhuo Fu, Xiaotian Guo, Wenxuan Zeng, Shuzhang Zhong, Yadong Zhang, Peiyu Chen, Runsheng Wang, Le Ye, Meng Li (2025). H2EAL: Hybrid-Bonding Architecture with Hybrid Sparse Attention for Efficient Long-Context LLM Inference. In International Conference on Computer-Aided Design (ICCAD) 2025. Haochen Huang, Shuzhang Zhong, Zhe Zhang, Shuangchen Li, Dimin Niu, Hongzhong Zheng, Runsheng Wang, Meng Li (2025). HD-MoE: Hybrid and Dynamic Parallelism for Mixture-of-Expert LLMs with 3D Near-Memory Processing. In International Conference on Computer-Aided Design (ICCAD) 2025. Linye Wei, Jiajun Tang, Fan Fei, Boxin Shi, Runsheng Wang, Meng Li (2025). No Redundancy, No Stall: Lightweight Streaming 3D Gaussian Splatting for Real-time Rendering. In International Conference on Computer-Aided Design (ICCAD) 2025. PDF Linfeng Zhong, Songqiang Xu, Huifeng Wen, Tong Xie, Qingyu Guo, Yuan Wang, Meng Li (2025). SpecMamba: Accelerating Mamba Inference on FPGA with Speculative Decoding. In International Conference on Computer-Aided Design (ICCAD) 2025. Chenqi Lin, Kang Yang, Tianshi Xu, Ling Liang, Yufei Wang, Zhaohui Chen, Runsheng Wang, Mingyu Gao, Meng Li (2025). Ironman: Accelerating Oblivious Transfer Extension for Privacy-Preserving AI with Near-Memory Processing. In MICRO 2025. PDF Tengyu Zhang, Tong Xie, Haoyang Luo, Yixuan Hu, Yaoyu Tao, Xiyuan Tang, Yuan Wang, Runsheng Wang, Meng Li (2025). A 28nm 534.6TOPS/W Mixed-Precision Edge Accelerator for Embodied AI Using Stochastic Computing. In Asian Solid-State Circuits Conference (A-SSCC) 2025. Tianshi Xu, Wenjie Lu, Jiangrui Yu, Chenqi Lin, Yi Chen, Runsheng Wang, Meng Li (2025). Breaking the Layer Barrier: Remodeling Private Transformer Inference with Hybrid CKKS and MPC. In Usenix Security Symposium 2025. Yu Fu, Yu Tong, Yijing Ning, Tianshi Xu, Meng Li, Jingqiang Lin, Dengguo Feng (2025). Swift: Fast Secure Neural Network Inference with Fully Homomorphic Encryption. In IEEE Transactions on Information Forensics and Security (TIFS) (2025). Shuzhang Zhong, Yanfan Sun, Ling Liang, Runsheng Wang, Ru Huang, Meng Li (2025). HybriMoE: Hybrid CPU-GPU Scheduling and Cache Management for Efficient MoE Inference. In Design Automation Conference (DAC) 2025. PDF Project Slides Tong Xie, Jiawang Zhao, Zishen Wan, Zuodong Zhang, Yuan Wang, Runsheng Wang, Ru Huang, Meng Li (2025). ReaLM: Reliable and Efficient Large Language Model Inference with Statistical Algorithm-Based Fault Tolerance. In Design Automation Conference (DAC) 2025. PDF Project Slides Linye Wei, Shuzhang Zhong, Songqiang Xu, Runsheng Wang, Ru Huang, Meng Li (2025). SpecASR: Accele",
  "content_length": 28177,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:21"
}