{
  "name": "Mengjia Xu",
  "homepage": "https://gracexu182.github.io",
  "status": "success",
  "content": "Welcome to Xu Lab - Xu Lab 🏆 OPENING 🏆 : We are always seeking highly motivated PhD students, visiting students, and summer interns to join us. If you're interested in working with us, please email us directly with your resume. About Welcome to Xu Lab, where innovation meets precision, and interdisciplinarity drives discovery in the realm of artificial intelligence (AI) and data science. Our research tackles challenges through foundational studies and diverse real-world applications, spanning geometry-aware deep learning, state-space models, and generative models to address various scientific problems in neuroscience, healthcare, and earth system modeling. By combining expertise in algorithm design, applied research, and interdisciplinary collaboration, we are dedicated to pushing the boundaries of intelligent systems in AI, driving advancements that impact both theory and practice. Recent News Defense April 29, 2025 Thesis Defense by Ashish Pandey Ashish successfully defended his Master's Thesis titled \"A novel framework for .\" project1 Ashish Pandey Publication February 5, 2025 New paper on \"Brain Age Prediction with MEG Brain Networks\" accepted for Publication Paper titled \"Fully Hyperbolic Neural Networks -- A Novel Approach to Studying Aging Trajectories\" got accepted by IEEE JHBI. project2 Hugo Ramirez Publication December 15, 2024 New Preprint on \"Transformers vs Mamba for Temporal Graph Embedding\" Paper titled \"A Comparative Study on Dynamic Graph Embedding based on Mamba and Transformers\" can be downloaded from arXiv. project1 Ashish Pandey Sarang Patil Active Projects A Comparative Study on Dynamic Graph Embedding based on Mamba and Transformers This project investigates dynamic graph embedding techniques utilizing transformer models and the Mamba architecture. It introduces innovative models that improve performance and efficiency in temporal... Recent News Fully Hyperbolic Neural Networks - A Novel Approach to Studying Aging Trajectories This study uses a Fully Hyperbolic Neural Network (FHNN) to embed MEG brain networks, uncovering age-related hierarchical changes and highlighting the superiority of hyperbolic features... Recent News",
  "content_length": 2184,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:22"
}