{
  "name": "Mengye Ren",
  "homepage": "https://mengyeren.com",
  "status": "success",
  "content": "Mengye Ren Â Mengye Ren Assistant Professor Department of Computer Science Courant Institute of Mathematical Sciences Center for Data Science (joint) New York University Email: mengye@nyu.edu Tel: +1 (212) 992-7547 Office: 60 5th Ave, Rm 508, New York, NY, 10011 LinkedInÂ BskyÂ CVÂ GScholarÂ Lab WebpageÂ Bio | Research | Teaching | News | Group | Papers | Talks Bio Mengye Ren is an assistant professor of computer science and data science at New York University (NYU). He runs the Agentic Learning AI Lab. Before joining NYU, he was a visiting faculty researcher at Google Brain Toronto working with Prof.Â Geoffrey Hinton. From 2017 to 2021, he was a senior research scientist at Uber Advanced Technologies Group (ATG) and Waabi, working on self-driving vehicles. He received Ph.D.Â in Computer Science from the University of Toronto, advised by Prof.Â Richard Zemel and Prof.Â Raquel Urtasun. His research focuses on making machine learning more natural and human-like, in order for AIs to continually learn, adapt, and reason in naturalistic environments. Research General areas: machine learning, computer vision, representation learning, continual learning, meta-learning, few-shot learning, artificial intelligence. My key research question is: how do we enable human-like, agent-based machine intelligence to continually learn, adapt, and reason in naturalistic environments? I am interested in the emergence of intelligence by learning from a point-of-view experience. Current research topics in my lab are: Visual representation learning and planning in the wild Adaptive agents and foundation models Few-shot concept learning, reasoning, and abstraction I am also looking for motivated students at all levels in the following areas: Continual learning for LLMs, VLMs, and agents Machine creativity for vision, language, and planning Teaching NYU DS-GA 3001: Advanced Topics in Embodied Learning and Vision [2025 spring] NYU DS-GA 1008 / CSCI-GA 2572: Deep Learning [2024 spring] NYU CSCI-GA 2565: Machine Learning [2023 fall] [2024 fall] NYU DS-GA 1003: Machine Learning [2023 spring] Vector Institute: Deep Learning II [2020 fall] UofT CSC 411: Machine Learning and Data Mining [2019 winter] News 2025/08: I will serve as an area chair for ICLR 2026. 2025/06: Two papers [1, 2] are accepted at ICML 2025 workshops. 2025/05: Two papers [1, 2] are accepted at CoLLAs 2025. 2025/05: Two papers [1, 2] are accepted at ICML 2025. 2025/03: I will serve as a communications chair for NeurIPS 2025. 2025/01: I will serve as an area chair for COLM 2025. 2025/01: One paper is accepted at ICLR 2025. 2024/12: I will teach a new course on Embodied Learning and Vision in Spring 2025 at NYU. 2024/10: I will serve as an associate program chair for CoLLAs 2025. Group Chris Hoang (2023-) Jack Lu (2023-) Ryan Teehan (2022-) Ying Wang (2024-) Yanlai Yang (2022-) Recent Papers [Full List] [Google Scholar] [dblp] Opinion: Learning intuitive physics may require more than visual data. Ellen Su, Solim LeGris, Todd M. Gureckis, Mengye Ren. NeurIPS 2025 Workshop on Embodied World Models for Decision Making, 2025. [open review] In-context clustering with large language models. Ying Wang, Mengye Ren, Andrew Gordon Wilson. arXiv preprint arXiv:2510.08466, 2025. [webpage] [arxiv] Local reinforcement learning with action-conditioned root mean squared Q-functions. Frank Wu, Mengye Ren. arXiv preprint arXiv:2510.06649, 2025. [webpage] [arxiv] Midway Network: Learning representations for recognition and motion from latent dynamics. Christopher Hoang, Mengye Ren. arXiv preprint arXiv:2510.05558, 2025. [webpage] [arxiv] StreamMem: Query-agnostic KV cache memory for streaming video understanding. Yanlai Yang, Zhuokai Zhao, Satya Narayan Shukla, Aashu Singh, Shlok Kumar Mishra, Lizhu Zhang, Mengye Ren. arXiv preprint arXiv:2508.15717, 2025. [webpage] [arxiv] Context tuning for in-context optimization. Jack Lu, Ryan Teehan, Zhenbang Yang, Mengye Ren. Workshop on Test-Time Adaptation at ICML, 2025. [webpage] [arxiv] [code] Discrete JEPA: Learning discrete token representations without reconstruction. Junyeob Baek, Hosung Lee, Christopher Hoang, Mengye Ren, Sungjin Ahn. WoTok: Workshop on Tokenization at ICML, 2025. [arxiv] Memory Storyboard: Leveraging temporal segmentation for streaming self-supervised learning from egocentric videos. Yanlai Yang, Mengye Ren. CoLLAs, 2025. [webpage] [arxiv] [code] Replay can provably increase forgetting. Yasaman Mahdaviyeh, James Lucas, Mengye Ren, Andreas S. Tolias, Richard Zemel, Toniann Pitassi. CoLLAs, 2025. [arxiv] Are LLMs prescient? A continuous evaluation using daily news as the oracle. Hui Dai, Ryan Teehan, Mengye Ren. ICML, 2025. [webpage] [arxiv] [code] [dataset] PooDLe: Pooled and dense self-supervised learning from naturalistic videos. Alex N. Wang*, Christopher Hoang*, Yuwen Xiong, Yann LeCun, Mengye Ren. ICLR, 2025. [webpage] [arxiv] [code] [dataset] [pdf] [html] Reawakening knowledge: Anticipatory recovery from catastrophic interference via structured training. Yanlai Yang, Matt Jones, Michael C. Mozer, Mengye Ren. NeurIPS, 2024. [webpage] [arxiv] [code] [pdf] [html] CoLLEGe: Concept embedding generation for large language models. Ryan Teehan, Brenden M. Lake, Mengye Ren. COLM, 2024. [webpage] [arxiv] [code] [pdf] [html] ProCreate, donât reproduce! Propulsive energy diffusion for creative generation. Jack Lu, Ryan Teehan, Mengye Ren. ECCV, 2024. [webpage] [arxiv] [code] [pdf] [html] Integrating present and past in unsupervised continual learning. Yipeng Zhang, Laurent Charlin, Richard Zemel, Mengye Ren. CoLLAs, 2024. [arxiv] [pdf] [html] Self-supervised learning of video representations from a childâs perspective. Emin Orhan, Wentao Wang, Alex N. Wang, Mengye Ren, Brenden M. Lake. CogSci, 2024. [arxiv] [pdf] [html] Recent Talks [Full List] Lifelong concept learning. Global AI Frontier Symposium. Seoul, Korea. 2025/10. [slides] [video] Lifelong and human-like learning in foundation models. Columbia University. New York, NY, USA. 2024/09. [slides] Flatiron Institute. New York, NY, USA. 2024/04. [slides] German Consulate General in New York. New York, NY, USA. 2024/04. [slides] American Statistical Association. Statistical Learning and Data Science Webinar. 2023/10. [slides] [video] Visual learning in the open world. NeurIPS 2022 MetaLearn. New Orleans, LA, USA. 2022/12. [slides] [video] University of Oxford. Oxford, UK. 2021/11. [slides] Google Brain. Toronto, ON, Canada. 2021/11. [slides] Stanford University. Stanford, CA, USA. 2021/10. [slides]",
  "content_length": 6550,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:25"
}