{
  "name": "Mengke Li 0001",
  "homepage": "https://keke921.github.io",
  "status": "success",
  "content": "李梦柯(Mengke Li)的学术主页 - Mengke Li Mengke Li (李梦柯)Assistant Professor Follow Shenzhen, Guangdong, ChinaShenzhen UniversityWebsiteEmailGoogle ScholarGithub李梦柯中文简介I’m now an Assistant Professor in Visual Computing Research Center (VCC) (headed by Prof. Hui Huang) at the College of Computer Science & Software Engineering, Shenzhen University. I received my PhD degree in computer science from Hong Kong Baptist University in 2022 supervised by Prof. Yiu-ming Cheung, received my master degree in signal and information processing from Xidian University in 2018, supervised by Prof. LI Ming, and received my bachelor degree in communication engineering from Hanhong College (The Department for Innovative Talents Training), Southwest University in 2015. My research direction is optimization analysis of deep learning in practical application, including long-tail learning, continual learning, noisy lable learning, and multimodal Learning.For postgraduate students, please check 硕士招生简章.There are a few postgraduate quotas in Fall 2025. If you are interested in Long tail learning and want to have fun with research, please contact me. Recent NewsJune 13 2025: szu email is available. Pleas contact me at mengkeli@szu.edu.cn.June 9 2025: One TNNLS paper is accepted! Congrats to Prof. Lu!May 01 2025: One ICML paper is accepted! Congrats to Chong and Prof. Zhang!Dec 10 2024: One AAAI paper is accepted! Congrats to Yunfan and Prof. Zhang!Sep 26 2024: One NeurIPS paper is accepted! Congrats to Ye!Aug 17 2024: Win the best paper award on DOCS 2024! Congrats to all of our colleagues!Research InterestsLong-tail/Imbalance LearningContinual LearningSemi-Supervised LearningMultimodal Learning3D point cloud AnalysisSupervised StudentsYe Liu (2023-): Long-tail learningHaiquan Ling (2024-): Long-tail noisy label learningLihao Chen (2024-): 3D point cloud analysis",
  "content_length": 1857,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:23"
}