{
  "name": "Mengyue Wu",
  "homepage": "https://myw19.github.io",
  "status": "success",
  "content": "Homepage of Mengyue Wu Basics Associate Professor, PhD Supervisor X-LANCE LAB Department of Computer Science and Engineering Shanghai Jiao Tong University Address : 3-543 SEIEE Building, 800 Dongchuan Road, Shanghai 200240, China Email : mengyuewu@sjtu.edu.cn Research SJTU X-LANCE Lab 上海交通大学跨媒体语言智能实验室丰富音频研究组 Environment Sound Sound event and scene detection, generation (!almost every student interested in genreation now..) Audio caption, bridging the gap between audio analysis and natural language description Audio-visual event detection Animal language decoding, now puppy language, in expansion Human Speech: Medical Application Speech emotion analysis Depression/Parkinson’s/Alzheimer’s disease detection Acoustic-based disease diagnosis, e.g. coughing, voice, heartsound… Digital Mental Health: Text and Dialogue Large Language Model for mental health Social media based disease detection and causal mining Dialogue based depression/anxiety diagnosis and therapy - building psychiatrist and therapist bots! Fun! Open-Sourced Data and Models CogBench: A Cognitive Evaluation Benchmark of Image Reasoning and Description for LLM PsySym: An Interpretable Mental Health Symptom Detection Dataset and Model. ( EMNLP'22 ) PsyEx: Detection of Multiple Mental Disorders from Social Media with Two-Stream Psychiatric Experts. ( EMNLP'23 ) PsyEval: A Comprehensive Large Language Model Evaluation Benchmark for Mental Health PsyDial: LLM-empowered chatbots for psychiatrist and patient simulation: application and evaluation D4: A Chinese Dialogue Dataset for Depression-Diagnosis-Oriented Chat ( EMNLP'22 ) - we built a system supporting spoken dialogue for depression diagnosis on this! Publications Selected Papers. Full list please see my Google Scholar Siyu Lou, Xuenan Xu, Mengyue Wu and Kai Yu. Audio-Text Retrieval in Context. ICASSP'22, syl92-lou-icassp22.pdf Xuenan Xu, Mengyue Wu and Kai Yu. Diversity-controllable and Accurate Audio Captioning Based on Neural Condition. ICASSP'22, xnx98-xu-icassp22.pdf Wen Wu, Mengyue Wu and Kai Yu. Climate and Weather: Inspecting Depression Detection via Emotion Recognition. ICASSP'22, myw19-wu-icassp22-1.pdf Zhiling Zhang, Siyuan Chen, Mengyue Wu, Kenny Zhu. Psychiatric Scale Guided Risky Post Screening for Early Detection of Depression. IJCAI'22, syc20-chen-ijcai22.pdf Pingyue Zhang, Mengyue Wu, Heinrich Dinkel and Kai Yu. DEPA: Self-Supervised Audio Embedding for Depression Detection. ACM-MM'21, myw19-wu-mm2021.pdf Heinrich Dinkel, Mengyue Wu and Kai Yu. Towards Duration Robust Weakly Supervised Sound Event Detection. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 2021, hedi7-dinkel-taslp2021.pdf Mengyue Wu, Heinrich Dinkel and Kai Yu. Audio Caption: Listen and Tell. ICASSP'19, myw19-wu-icassp2019.pdf Teaching AI3611 Deep Learning: A Practical Course on Perception and Cognition CS3309 Computer Ethics - A newly-designed course covering AI ethics, fairness, bias, etc. GE6001 Scientific Writing, Integrity and Ethics - A compulsory course for graduate students, I renovated the course and basically talked about how academia works. Comment from students:\" thought would be boring, but turned out super practical and fun\" Students(Booming in progress) Current Students Xuenan Xu, PhD Candidate, graduate in 2025. Audio understanding and generation. Kunyao Lan, PhD Candidate. Digital mental health. Xiujie Song, Co-advised PhD Candidate. Cognitive function evaluation and its application in LLM. Jiaming Luo, Co-advised PhD Candidate. Multimodal imagination. Zeyu Xie, Master Candidate, graduate in 2025. Audio generation. Siyuan Chen, Master Candidate. Digital mental health. Fei Yang, Master Candidate. Pathological speech detection. Xiaohang Xu, Master Candidate. Emotion speech analysis and generation. Minghao Lv, Master Candidate. Causal relations. Haoan Jin, Master Candidate. Mental and ancient Chinese decoding. Hao Tang, Master Candidate. Agents and so on. Xingyuan Li, Master Candidate. Animal language decoding. Chunhao Zhang, Master Candidate. Cognitive reasoning. Yufei Wang, Master Candidate. Multimodal emotion recognition. Zhige Huang, Master Candidate. Ancient language decoding. Jiaxi Liu, Master Candidate to be. Pathological speech. Baihan Li, Master Candidate to be. Audio generation. Alumni Heinrick Dinkel, Co-advised PhD, 2020. Senior Algorithm Researcher at Xiaomi Binwei Yao, B.Eng, 2022. Current PhD candidate at the Univeristy of Wisconsin-Madison. Guangwei Li, Master, 2023. Algorithm researcher at Ant Group. Pingyue Zhang, Master, 2024. Pursue PhD overseas. Dengdeng Huang, B.Eng, 2024. PhD at SJTU.",
  "content_length": 4614,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:25"
}