{
  "name": "Meng Tang 0001",
  "homepage": "http://www.mengtang.org",
  "status": "success",
  "content": "Meng Tang, University of California Merced Meng Tang Meng Tang Assistant Professor Department of Computer Science and Engineering University of California, Merced Email: mtang4 AT ucmerced.edu Office: SE2 279 I work on generative models and related problems. What's new? [Apr. 2025] One paper accepted to TMLR. [Feb. 2025] One paper accepted to CVPR 2025. [Aug. 2024] Received funding from Department of Defense (DoD). [June 2024] Received funding from Google through CAHSI-Google Institutional Research Program. [Apr. 2024] One paper accepted to SyntaGen workshop at CVPR 2024. [Dec. 2023] One paper accepted to AAAI 2024. GoogleScholar   GitHub   CV Teaching EECS 242 Advanced Topics in Deep Learning, Fall 2025 CSE 176 Introduction to Machine Learning, Fall 2024 EECS 230 Deep Learning, Spring 2024 CSE 185 Introduction to Computer Vision, Fall 2023 Students Current: Fang Chen, PhD student since Fall 2023 Weimin Qiu, MS student since Spring 2024, PhD student since Spring 2025 Shangjie Du, MS student since Spring 2025 Past: Jieke Wang, MS student, Fall 2023 to Fall 2025 Alex Villa, Undergraduate student, 2025 Jacob Schnell, Undergraduate visiting student in Summer 2023 Jieyu Weng, Undergraduate visiting student in Summer 2025 Yejie Guo,Undergraduate visiting student in Summer 2025 Preprint Pursuing Minimal Sufficiency in Spatial Reasoning Yejie Guo, Yunzhong Hou, Wufei Ma, Meng Tang, Ming-Hsuan Yang arXiv preprint 2510.16688, Oct. 2025. [PDF] [Code] Contrastive Conditional-Unconditional Alignment For Long-tailed Diffusion Model Fang Chen, Alex Villa, Gongbo Liang, Xiaoyi Lu, Meng Tang arXiv preprint 2507.09052, July 2025. [PDF] Training Class-Imbalanced Diffusion Model Via Overlap Optimization Divin Yan, Lu Qi, Vincent Tao Hu, Ming-Hsuan Yang, Meng Tang arXiv preprint 2402.10821, Feb. 2024. [PDF] Publication Recent paper (2023 - ) ReDistill: Residual Encoded Distillation for Peak Memory Reduction of CNN Fang Chen, Gourav Datta, Mujahid Al Rafi, Hyeran Jeon, Meng Tang Transactions on Machine Learning Research (TMLR), 2025. [arxiv] [Code] [PDF] Self-Cross Diffusion Guidance for Text-to-Image Synthesis of Similar Subjects Weimin Qiu, Jieke Wang, Meng Tang IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [PDF][Code][Prject Page] ScribbleGen: Generative Data Augmentation Improves Scribble-supervised Semantic Segmentation Jacob Schnell, Jieke Wang, Lu Qi, Vincent Tao Hu, Meng Tang Workshop on SyntaGen at IEEE Conference on Computer Vision and Pattern Recognition (CVPR-W), June 2024. [PDF][Code] Latent Space Editing in Transformer-Based Flow Matching Vincent Tao Hu, David W Zhang, Pascal Mettes, Meng Tang, Deli Zhao, Cees G.M. Snoek Annual AAAI Conference on Artificial Intelligence (AAAI), 2024. [PDF] [Code]  [Poster] Decepticon: Understanding Vulnerabilities of Transformers Mujahid Al Rafi, Yuan Feng, Fan Yao, Meng Tang, Hyeran Jeon IEEE International Symposium on Workload Characterization (IISWC), 2023. [PDF] Earlier paper FroDO: From Detections to 3D Objects M. Rünz, K. Li, M. Tang, L. Ma, C. Kong, T. Schmidt, I. Reid, L. Agapito, J. Straub, S. Lovegrove, R. Newcombe IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2020. [PDF] [Video] Beyond Gradient Descent for Regularized Segmentation Losses Dmitrii Marin, Meng Tang, Ismail Ben Ayed, Yuri Boykov IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2019. [PDF] [Code] Kernel Cuts: Kernel and Spectral Clustering meet Regularization Meng Tang, Dmitrii Marin, Ismail Ben Ayed, Yuri Boykov International Journal of Computer Vision (IJCV), 2019. [PDF] [arXiv] Constrained-CNN losses for weakly supervised segmentation Hoel Kervadec, Jose Dolz, Meng Tang, Eric Granger, Yuri Boykov, Ismail Ben Ayed Medical Image Analysis (MedIA), 2019. [PDF] [Code] [MIDL 2018 version] On Regularized Losses for Weakly-supervised CNN Segmentation Meng Tang, Federico Perazzi, Abdelaziz Djelouah, Ismail Ben Ayed, Christopher Schroers, Yuri Boykov European Conference on Computer Vision (ECCV), 2018. [PDF] [Slides] [Code] [arXiv] Size-constraint loss for weakly supervised cnn segmentation Hoel Kervadec, Jose Dolz, Meng Tang, Eric Granger, Yuri Boykov, Ismail Ben Ayed Medical Imaging with Deep Learning (MIDL), 2018. [PDF] (oral) Normalized Cut Loss for Weakly-supervised CNN Segmentation Meng Tang, Abdelaziz Djelouah, Federico Perazzi, Yuri Boykov, Christopher Schroers IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2018. [PDF] [Poster] Kernel Clustering: Density Biases and Solutions Dmitrii Marin, Meng Tang, Ismail Ben Ayed, Yuri Boykov IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), 2017. [PDF] Normalized Cut Meets MRF Meng Tang, Dmitrii Marin, Ismail Ben Ayed, Yuri Boykov European Conference on Computer Vision (ECCV), 2016. [PDF] [Code] [Poster] [Slides] [Video](oral) Secrets of GrabCut and Kernel K-means Meng Tang, Ismail Ben Ayed, Dmitrii Marin, Yuri Boykov IEEE International Conference on Computer Vision (ICCV), 2015. [PDF] [Code] [Poster] Pseudo-Bound Optimization for Binary Energies Meng Tang, Ismail Ben Ayed, Yuri Boykov European Conference on Computer Vision (ECCV), 2014. [PDF] [Code] [Poster] [Slides] [Video](oral) GrabCut in One Cut Meng Tang, Lena Gorelick, Olga Veksler, Yuri Boykov IEEE International Conference on Computer Vision (ICCV), 2013. [PDF] [Code] [Poster] Improved delay-range-dependent stability criteria for linear systems with interval time-varying delays Meng Tang, Yan-Wu Wang, Changyun Wen IET Control Theory & Applications, 2012. [PDF]",
  "content_length": 5563,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:22"
}