{
  "name": "Mengnan Du",
  "homepage": "https://mengnandu.com",
  "status": "success",
  "content": "Mengnan DuSearchMengnan DuAssistant ProfessorNew Jersey Institute of TechnologyBiographyHe is an assistant professor in the Department of Data Science, New Jersey Institute of Technology (NJIT), with a joint appointment in the Department of Computer Science. Before that, he earned the Ph.D. in Computer Science from Texas A&M University, under the supervision of Dr. Xia Hu. He has previously worked with leading tech companies including Microsoft Research, Adobe Research, Intel, and Baidu Research. Currently, he lead the Trustworthy Machine Learning Research Lab (TMLR lab). He serves as a Senior Area Chair for EMNLP, and as an Area Chair for NeurIPS, ICML, ICLR, ACL, and AISTATS. He also serves as Action Editor for TMLR and Associate Editor for Applied AI Letters.His research interests lie within the domain of trustworthy machine learning, with a particular emphasis on the intersection of trustworthy machine learning with large language models (LLMs), particularly explainability of LLMs. His recent efforts in trustworthy LLMs can be found here. He is also increasingly interested in exploring the application of LLMs to real-world domains such as law, finance, and bioinformatics. The ultimate goal of his research is to improve the usefulness and trustworthiness of LLMs in practical and impactful applications.I am actively seeking motivated PhD students and interns. If you are interested in working with me, please feel free to email me. Please check here for more details.News11/2025: Serving as Action Editor for TMLR and Area Chair for ICML 202610/2025: Two papers accepted by AAAI 2026 Demo and AISI track09/2025: Serving as Area Chair for ICLR 2026 and AISTATS 202608/2025: Six papers accepted by EMNLP 2025 (3 main and 3 findings)08/2025: One paper accepted by Artificial Intelligence05/2025: We will oraganize COLM 2025 workshop on LLM Explainability05/2025: Two papers accepted by ICML 202504/2025: Invited to serve as EMNLP 2025 Senior Area Chair04/2025: Invited to serve as NeurIPS 2025 Area Chair03/2025: One paper accepted by Cell Patterns02/2025: One paper accepted by CVPR 202502/2025: One paper accepted by SIGKDD Explorations02/2025: Invited to serve as Area Chair for ACL Rolling Review02/2025: Invited to serve as Associate Editor for Applied AI Letters01/2025: Two papers accepted by ICLR 202501/2025: One paper accepted by NAACL Findings 202512/2024: One paper accepted by AAAI 2025 (Social Impact Track)12/2024: Invited to serve as ICML 2025 Area Chair11/2024: Invited to serve as a Senior Program Committee Member for IJCAI-2511/2024: One paper accepted by AAAI-25 Student Abstract10/2024: Two papers accepted by IEEE BigData 202410/2024: Invited to serve as AISTATS 2025 Area Chair10/2024: Invited to serve as MIDL 2025 Area Chair09/2024: One paper accepted by EMNLP 202408/2024: One paper accepted by IEEE TSC07/2024: Papers accepted by COLM, CIKM and TKDD06/2024: Grateful to receive the Cisco Research Award05/2024: Two papers accepted by ACL Findings 202405/2024: Grateful to receive Outstanding Achievement in Research Award of NJIT Ying Wu College of Computing05/2024: One paper accepted by ICML 202404/2024: Grateful to receive NJIT Faculty Seed Grant Award03/2024: One paper accepted by NAACL Findings 202402/2024: Two papers accepted by COLING 202402/2024: Check preprint about our position on LLM explainability01/2024: Papers accepted by TPAMI, TAI and ICLR11/2023: Our survey paper on LLM Explainability gets accepted by ACM TIST11/2023: Invited to serve as a Senior Program Committee Member for IJCAI-2411/2023: One workshop proposal gets accepted by WWW 202409/2023: One paper accepted by NeurIPS 202309/2023: One paper accepted by NeurIPS 2023 Datasets & Benchmarks track09/2023: Our workshop proposal on “Responsible Language Models” has been accepted by AAAI 202408/2023: Grateful to receive an NSF III medium grant as NJIT PI08/2023: Two papers accepted by CIKM 202307/2023: Invited to be a reviewer for Nature Communications07/2023: One paper accepted by ECAI 202306/2023: Two papers accepted by ECML-PKDD 202305/2023: One paper on shortcut learning of large language models (LLMs) gets accepted by Communications of the ACM05/2023: One paper on LLMs fairness accepted by ACL 202304/2023: Grateful to receive one NJIT Faculty Seed Grant Award04/2023: One paper accepted by ICML 202304/2023: One paper accepted by IJCAI 202303/2023: Serving as Editorial Board Member of Journal of Information Analysis01/2023: One paper on LLMs robustness accepted by EACL 202310/2022: Invited to serve on the Senior program committee at IJCAI 202310/2022: Invited to the TWEB Distinguished Reviewer Board09/2022: Hosted MLNLP seminar on Trustworthy AI08/2022: Invited to be a reviewer for Nature Machine Intelligence05/2022: Invited to give a talk on GNN explainability at DataFun on June 2505/2022: One paper accepted by KDD 202205/2022: One paper accepted by ICML 202201/2022: One paper accepted by ICLR 2022Cite ×Copy Download",
  "content_length": 4972,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:24"
}