{
  "name": "Metin Sitti [IS]",
  "homepage": "http://pi.is.mpg.de",
  "status": "success",
  "content": "Physical Intelligence – Max Planck Institute for Intelligent Systems Institute Homepage Institute Homepage Sign In Physical Intelligence Department aims to understand the principles of design, locomotion, control, and physical intelligence of small-scale mobile robots. The department aims to understand the underlying principles of physical intelligence of single and collectives of biological organisms at milli- and micrometer length scales, and realize advanced physical intelligence capabilities on small-scale mobile robots using such principles. As the societal and translational research mission, the team aims to apply these tiny robots as minimally invasive and implantable wireless medical robots inside our body to revolutionize medicine and healthcare. The highly interdisciplinary team has expertise in robotics, micro/nanotechnology, materials science, engineering, physics, biology, chemistry, and medicine. Until 2023, Metin Sitti headed the Physical Intelligence Department. He is now President of Koç University and a Guest Scientists at MPI-IS Admin Team Anke Geigle Administrative Staff +49 711-689-3401 pi-admin@is.mpg.de Physical Intelligence Highlights Blog Post Physical Intelligence 2025-11-03 BLOG: Active Droplets Get a Magnetic Upgrade: Controlling Self-propelling Droplets and Their Collectives Press Release Physical Intelligence 2025-09-15 Matryoshka doll-like robot changes its shape in real time and in situ News Physical Intelligence 2025-07-29 EndoSurge wins 3rd place in Science2Start competition Article Physical Intelligence 2025-06-10 Surface Rolling Active Magnetic Emulsions News Physical Intelligence 2025-04-13 Ren Hao Soon named 2025 Schmidt Science Fellow News Physical Intelligence 2025-03-17 Magnetic microalgae on a mission to become robots News Physical Intelligence CELLnROLL 2024-04-11 Cyber Valley grants 500K to CELL’n’ROLL via 2023 Innovation Fellowship Program Article Physical Intelligence 2024-01-01 Artificial-goosebump-driven microactuation Article Physical Intelligence 2024-01-01 Capillary trapping of various nanomaterials on additively manufactured scaffolds for 3D micro-/nanofabrication Article Physical Intelligence 2024-01-01 Individual and collective manipulation of multifunctional bimodal droplets in three dimensions Article Physical Intelligence 2024-01-01 Perturbing Dynamics of Active Emulsions and Their Collectives Article Physical Intelligence 2024-01-01 Micro- and nanofabrication of dynamic hydrogels with multichannel information Talk Physical Intelligence 2023-07-04 Collective Dynamics: from natural to artificial systems News Robotic Materials Physical Intelligence 2023-04-25 Jellyfish-like robots could one day clean up the world’s oceans Article Robotic Materials Physical Intelligence Bioinspired Autonomous Miniature Robots 2023-04-01 A Versatile Jellyfish-Like Robotic Platform for Effective Underwater Propulsion and Manipulation Talk Physical Intelligence 2023-01-24 Next-generation Fiber-based Biomedical, Neural, and Robotic Interfaces Article Physical Intelligence 2023-01-01 Hydrogel muscles powering reconfigurable micro-metastructures with wide-spectrum programmability Article Physical Intelligence 2023-01-01 Machine Learning-Based Shear Optimal Adhesive Microstructures with Experimental Validation Article Physical Intelligence 2023-01-01 Bioinspired self-assembled colloidal collectives drifting in three dimensions underwater Talk Physical Intelligence 2022-09-26 Ultrafast, Miniature Soft Actuators Talk Physical Intelligence 2022-09-22 Towards robust and autonomous locomotion in cluttered terrain using insect-scale robots Talk Physical Intelligence 2022-07-07 Soft Materials Innovation for Health and Sustainability Talk Physical Intelligence 2022-05-31 Multifunctional magnetic origami robots Talk Physical Intelligence 2022-04-11 Microrobotics to Micro Aerial Vehicles: Robots Interacting with the Environment Article Physical Intelligence 2022-04-01 Microrobot collectives with reconfigurable morphologies, behaviors, and functions Article Dynamic Locomotion Physical Intelligence 2022-03-01 BirdBot achieves energy-efficient gait with minimal control using avian-inspired leg clutching Technical Report Dynamic Locomotion Physical Intelligence 2022-03-01 Data for BirdBot Achieves Energy-Efﬁcient Gait with Minimal Control Using Avian-Inspired Leg Clutching Article Physical Intelligence 2022-01-01 Order and Information in the Patterns of Spinning Magnetic Micro-disks at the Air-water Interface This website uses cookies to ensure you get the best experience. Learn more. Accept More information Download QR Code",
  "content_length": 4626,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:29"
}