{
  "name": "Mi Zhang 0002",
  "homepage": "https://engineering.osu.edu/people/mizhang.1",
  "status": "success",
  "content": "Zhang, Mi | College of Engineering Skip to main content Mi Zhang Associate Professor, Computer Science and Engineering Dreese Laboratories2015 Neil Ave Columbus, OH 43210-1210 zhang.13664@osu.edu Personal Website OSU AIoT and MLSys Lab OSU AIoT Seminar Series Biography Short Bio: Mi Zhang is an Associate Professor and the Director of AIoT and Machine Learning Systems Lab in the Department of Computer Science and Engineering at The Ohio State University (OSU). He received his Ph.D. degree from University of Southern California (USC) and B.S. from Peking University, and spent one year as a postdoctoral scholar at Cornell University. He is a senior member of ACM, IEEE, and National Academy of Inventors. Research Areas: The key mission of Dr. Zhang's research lab is to Empower Billions of Everyday Devices with AI to realize the vision of Artificial Intelligence of Things (AIoT). To achieve such mission, his group focuses on its core challenges related to sensing, intelligence, connectivity, efficiency as well as its real-world applications. Achieving such goal requires a combination of approaches. His work draws insights from a broad set of disciplines including mobile/edge computing, AI/machine learning, distributed systems, computer networks, and human-centered computing. Honors and Awards: Dr Zhang's work has been recognized by seven best paper awards and nominations, NSF CRII Award, Facebook/Meta Faculty Research Award, Amazon Research Award, and MSU Innovation of the Year Award. He is the 4th Place Winner of Google MicroNet Challenge, the Third Place Winner of NSF Hearables Challenge, and the champion of NIH Pill Image Recognition Challenge. He is also the recipient of the inaugural USC ECE SIPI Distinguished Alumni Award in the Junior/Academia category for my contributions to mobile computing, edge AI, and AIoT in his early career. Recent Talks: Stanford University: Empowering the Next Billion Devices with Deep Learning, 2021. Expertise Efficient Generative AI (multimodal large language models, diffusion models, mixture of experts (MoE), state space models (SSM)) Edge AI for mobile, AR, wearables, robots, IoT as well as networked cloud-edge systems Systems for Generative AI and AI Agents Spatial Computing and Physical AI Foundation Models for IoT Human-Centered Computing and Mobile Health",
  "content_length": 2331,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:28"
}