{
  "name": "Mia Minnes",
  "homepage": "https://cseweb.ucsd.edu/~minnes",
  "status": "success",
  "content": "Mia Minnes Mia Minnes minnes@ucsd.edu EBU3b (CSE) 4206 Computer Science and Engineering University of California, San Diego 9500 Gilman Drive, La Jolla, CA 92093-0404 Welcome! I am a Teaching Professor and the Vice Chair for Undergraduate Education in the Computer Science and Engineering Department. At UC San Diego, I primarily teach discrete math for CS and introduction to computability, as well as the TA training classes. My research interests are in Automata Theory and Computability education, along with SoTL and projects that support professionalization pathways for students, including industry internships, professional development of peer mentors and teachers, and ethics and communication. Grants and Awards NSF Grant DUE-2337253 (2024-2027), PI in collaboration with Union College (DUE-2337251), Bard College (DUE-2337252), and Furman University (DUE-2337254) UC San Diego Assessment Grant (2023-2025), PI (Inaugural) UC San Diego Student Centeredness Award (2023-2024) NSF Grant CNS-2137928 (2021-2025), PI Course Development and Instructional Improvement Program (CDIIP) Grant (2021-2022), PI UC San Diego Academic Senate Distinguished Teaching Award (2020) Teaching+Learning Commons Faculty Fellow (2018-2019) Course Development and Instructional Improvement Program (CDIIP) (2017-2018), PI AVC Academic Advising Innovation Grant (2015-2017), PI NSF Grant DUE-1451521 (2014-2016), co-PI Jacobs School of Engineering Teacher of the Year - by student ballot (2013-2014) NSF Grant DMS-1060351 (2010-2014), PI NSF Grant DMS-0901005 (2009-2010), PI Projects Connecting academics and professional goals: Internships and Peer teaching I work with students to develop professional skills outside the context of core classes. I teach a companion class for CSE majors taking industry internships. In this class, students work to identify and deepen the connections between their UCSD studies and real-world problems presented in off-campus internships. Students reflect on the growth of their professional, problem-solving, and technical skills over the internship, as well as the ethical and societal impact of their work. At the culmination of this course, students present posters at the Summer Internship Symposium early in the Fall Quarter. The Symposium celebrates our students' accomplishments and strengthens the ties between the CSE department and our alumni and industry colleagues. The Summer Internship Symposium was featured in the UCTV CSE Channel https://youtu.be/wYV-ixiwE6E. I also teach the professional development classes taken by all first-time CSE tutors and all first-time CSE teaching assistants. This hands-on class builds on educational literature and gives many opportunities for role playing, skill building, and feedback. My role: Founder and CSE197/CSE191 Faculty Sponsor (2014-present); Class websites; Symposium website. Co-curriculum developer for CSE95 and CSE599 (2014-present). TA/tutor training related publications: \"Designing TA Training for Computer Science Graduate Students: Remote and Self-paced Options for A Supported Introduction to Reflective Teaching\". Mia Minnes. SIGCSE 2022, pp. 752-758 https://doi.org/10.1145/3478431.3499342 Industry internship related publications: Poster analyzing who obtains industry internships, by undergraduate researchers Bradley Chester, Anthony Hernandez, Jose Salazar, Abel Seyoum through UC San Diego's Early Research Scholars Program ERSP group poster, 2022. \"What Do CS Students Value in Industry Internships?\" Mia Minnes, Sheena Ghanbari Serslev, Omar Padilla. ACM Transactions on Computing Education (Volume 21, Issue 1) https://doi.org/10.1145/3427595, March 2021. \"Attitude shifts and transformation during Computer Science and Engineering Student Internships\" Mia Minnes, Sheena Ghanbari Serslev, Madison Edwards. ASEE's Virtual Conference (Paper ID #30094) https://drive.google.com/open?id=1d4oNyNTC5ZksnMugL0cH0A9tVhA7mSU9, 2020. \"Practice Makes Deeper? Regular Reflective Writing during Engineering Internships\" Mia Minnes, John Mayberry, Melissa Soto, Jace Hargis. Journal of Transformational Learning (Volume 4, Number 2) https://jotl.uco.edu/index.php/jotl/article/view/195\", 2017. Student experiences of a large computing program We study ways to improve the experiences and outcomes for students in large undergraduate computing programs. The NSF-funded Peer-led Academic Cohort Experiences program: CSE-PACE focuses on the experiences of incoming students. In older work, NSF-funded Micro-Classes project researched emulating the community and academic support of small classes within a large lecture setting. My role: PI (2021-2025), co-PI (2014-2017) CSE-PACE related publications: \"Welcoming Students to Undergraduate Computer Science Programs: On-ramps, Rest Areas, and Lane Changes\" Niharika Bhaskar, Amari N. Lewis, Rona Darabi, Joana Fang, Jingting Liu, Kristen Vaccaro, Joe Gibbs Politz, Mia Minnes. 2024 SIGCSE TS. ACM Digital Library entry. \"Comparing Student Social Networks and Academic Experiences in Computing and Biology Courses\" Amari N. Lewis, Kristin Tenney, Kristen Vaccaro, Joe Gibbs Politz, Mia Minnes. 2023 Conference on Research in Equitable and Sustained Participation in Engineering, Computing, and Technology (RESPECT) Slides. \"Taking the Next Course: Facilitators and Barriers Reported by Computer Science Majors\" Amari N. Lewis, Joe Gibbs Politz, Kristen Vaccaro, Mia Minnes. ASEE '23 https://drive.google.com/file/d/1C0bJVvTNRr8Zxr9lgzB2LA_oepkEdJme/, Slides. \"Lost in the crowd, rising above it, or somewhere in the middle?\" Invited talk at: Illinois Computer Science Summer Teaching Workshop, June 5-6, 2023. Slides \"Learning about the Experiences of Chicano/Latino Students in a Large Undergraduate CS Program\" Amari N. Lewis, Joe Gibbs Politz, Kristen Vaccaro, Mia Minnes. ITISCE '22 https://dl.acm.org/doi/abs/10.1145/3502718.3524780 Micro-Classes related publications: \"Micro-Classes: A Structure for Improving Student Experience in Large Classes\" Christine Alvarado, Mia Minnes, and Leo Porter. SIGCSE '17 Pages 21–26. 2017. https://doi.org/10.1145/3017680.3017727 \"Lightweight Techniques to Support Students in Large Classes\" Mia Minnes, Christine Alvarado, Leo Porter. SIGCSE '18 Pages 122–127. https://dl.acm.org/citation.cfm?id=3159601 Interactive visualization of formal computation Online tool to build, simulate, and test automata and other formal models of computation. This student-built product is being piloted for use by CSE 105 students and is inspired by JFLAP. Try out the app https://flapjs.web.app/ and see the GitHub Repo https://github.com/flapjs. The project was kick-started with the CSE Undergraduate Summer Research program, featured on UC TV: https://www.youtube.com/Ac2juu3VrAE. My role: Faculty mentor (2018-present) Computing Paths and OCCTIVE ComputingPaths hosts resources and advising for undergraduate UC San Diego students interested in career paths related to computing. Video interviews with current students, alumni, faculty, and advisers, as well as highlighted projects and student organizations on ComputingPaths. Supported by an Advising Innovation grant from the Vice Chancellor-Student Affairs and Associate Vice Chancellor for Academic Affairs and Dean of Undergraduate Education, and by the CSE Department. OCCTIVE is a multi-institutional, NSF supported project to support introductory programming and computational problem solving instruction in non-CS courses. OCCTIVE videos are hosted at https://occtive.github.io/www/index.html, and the new site being developed by the student team: https://melvyn9.github.io/OCCTIVE/#/ Student team developing, curating, and maintaining the ComputingPaths content: Melvyn Tan (2022-present). Nicole Go and Tanvi Vidyala (2025). Zhiying Guan, Tyler Lo, Yash Potdar, Melvyn Tan, Catherine Tang, Cindy Wang (2022). Daphne Nong, Joey Dang, Steven Steiner, Ronak Shah (2021-2022). Gary Xie, Peter Phan, Shawn Gao, Olivia Miano, Andrea Sudharta, Alex Yang (2018, 2019). Kimberly Au, Justin Cai, David Duplantier, Oliver Engel, Shawn Gao, Andy Hwang, Catherine Kim, Paul Llanura, Vylana Trang, Caris Wei (2017) Huang Li, Kitty Qiu, Nicolette Valicenti, David Lai, Jill Zhang, Yash Rathi, Jiaying He, Dorothy Yen (2015-2016) My role: PI (2015-present); http://computingpaths.ucsd.edu. UCSD PI (2024-present); https://melvyn9.github.io/OCCTIVE/#/. Related presentations: UC Academic Advising Conference 2018, annual Admissions Team presentations. Grading: Adaptive rubrics and oral exams Grading serves an important pedagogical role, both in giving feedback to students to support their learning and in certifying this learning. Effective and efficient grading at scale presents multiple challenges. The adaptive rubrics project is joint work with Marco Carmosino, proposing a new framework for grading based on exploratory data analysis to mine insights on population statistics of learning outcome achievements across the class, along with efficient and consistent grading at scale. Drawing lessons from emergency remote instructions, colleagues and I explored oral exams as a modality for authentic, integrous evaluation of student learning. Across multiple projects, we explored different instantiations of oral exams, designing for scale, student sense of belonging, and academic integrity. My role: Co-author/co-lead (2019-2023) Oral exams related publications: \"Stream Your Exam to the Course Staff: Asynchronous Assessment via Student-Recorded Code Trace Videos\" R.S. Lim, M. Minnes, J.G. Politz. SIGCSE 2023, pp. 144–150. https://doi.org/10.1145/3545945.3569803, 2023. \"Oral exams for large-enrollment engineering courses to promote academic integrity and student engagement during remote instruction\" M. Lubarda, N. Delson, C. Schurgers, M. Ghazinejad, S. Baghdadchi, A. Phan, M. Minnes, J. Relaford-Doyle, L. Klement, C. Sandoval, H. Qi. IEEE FiE https://dl.acm.org/doi/abs/10.1145/3328778.3366946, 2021. Adaptive rubrics related publications: \"Adaptive Rubrics\" Marc",
  "content_length": 42254,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:29"
}