{
  "name": "Miaohui Wang",
  "homepage": "https://charwill.github.io",
  "status": "success",
  "content": "Miaohui Wang Miaohui Wang Ph.D. 中文主页 Miaohui Wang (Senior Member, IEEE) received the Ph.D. degree from the Department of Electronic Engineering, The Chinese University of Hong Kong (CUHK), Hong Kong, China. From 2014 to 2015, he was a Researcher working on the standardization of video coding with the Innovation Laboratory, InterDigital Inc., San Diego, CA, USA. From 2015 to 2017, he was a Senior Research Staff working on computer vision and machine learning with The Creative Life Research Institute of Hong Kong, Hong Kong, China. He is currently a tenured Associate Professor with the College of Electronics and Information Engineering, Shenzhen University, Shenzhen, China. He has authored or coauthored more than 100+ peer-reviewed papers in top-tier international journals and conferences. Dr. Wang was the recipient of the Best Thesis Awards of Ministry of Education of Shanghai City and Fudan University (FDU), respectively. He received the Best Paper Award from International Conference on Advanced Hybrid Information Processing (2018), and received the Outstanding Reviewer Award from International Conference on Multimedia & Expo (2021). He has authored or co-authored over 90 peer-reviewed papers in top-tier international journals (e.g.,T-PAMI, IJCV, T-IP, T-MI, T-II, etc.) and conferences (e.g., CVPR, ICCV, AAAI, IJCAI, etc.). He serves as an Associate Editor for IEEE SIGNAL PROCESSING LETTERS, IEEE SENSORS LETTERS, and IEEE ACCESS. Scientometrics ORCID Google Scholar DBLP News！！！！！！ New!!! One paper has been accepted by IEEE T-PAMI. New!!! I serve as an Area Chair in ICASSP 2026. New!!! I serve as a Session Chair in International Joint Conference on Artificial Intelligence (IJCAI), Guangzhou 2025. New!!! One paper has been accepted by IJCAI 2025. New!!! One paper has been accepted by IEEE T-IP. New!!! One paper has been accepted by IEEE T-MM. New!!! One paper has been accepted by IEEE T-CSVT. New!!! One paper has been accepted by IEEE T-IM. New!!! One paper has been accepted by ACM T-OMM. New!!! One paper has been accepted by IEEE T-II. New!!! Two papers have been accepted by AAAI 2025. One paper has been accepted by Springer IJCV. One paper has been accepted by NeurIPS 2024. One paper has been accepted by IEEE SPL. One paper has been accepted by IEEE T-II. I serve as a Session Chair in International Joint Conference on Artificial Intelligence (IJCAI), JEJU 2024. One paper has been accepted by IJCAI 2024. One paper has been accepted by IEEE T-II. One paper has been accepted by IEEE SPL. One paper has been accepted by IJCNN 2024. Two papers have been accepted by AAAI 2024. One paper has been accepted by IEEE T-II. Three papers have been accepted by ACM MM 2023. One paper has been accepted by IEEE T-PAMI. One paper has been accepted by ICCV 2023. One paper has been accepted by IJCAI 2023. One paper has been accepted by IEEE T-ITS. Two papers have been accepted by IEEE ICME 2023. One paper has been accepted by AAAI 2022. One paper has been accepted by IEEE T-II. One paper has been accepted by NeurIPS 2022. One paper has been accepted by IEEE T-CE. One paper has been accepted by IEEE T-ETCI. One paper has been accepted by ACM MM 2022. One paper has been accepted by IEEE T-II. One paper has been accepted by IEEE T-MM. One paper has been accepted by CVPR 2022. One paper has been accepted by IEEE T-II. One paper has been accepted by IEEE J-BHI. One paper has been accepted by IEEE T-IM. Outstanding reviewer award for ICME 2021. One paper has been accepted by IEEE SPL. One paper has been accepted by IEEE T-MI. One paper has been accepted by IEEE T-CSVT. Two papers have been accepted by IEEE ICME 2021. One paper has been accepted by IEEE T-GRS. Two papers have been accepted by ACM MM 2020. Our team wins the Second Place in The 9th International Conference on Virtual Reality and Visualization \"3D Reconstruction Challenge\", (ICVRV), 2019. Our team wins the Second Runner-up in ICME 2019 Grand Challenges \"Learning-Based Image Inpainting\" [Second Runner-up (SSIM) ][implementation],(ICME), 2019. I serve as a Session Chair in International Conference on Multimedia & Expo (ICME), 2019. Publication List New!!! 2022-2023 International Conferences on Artificial Intelligence, Machine Learning, Computer Vision, Data Mining, Natural Language Processing and Robotics Last Update: 2025. WANG MIAOHUI All rights reserved.",
  "content_length": 4372,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:30"
}