{
  "name": "Micah Corah",
  "homepage": "https://www.micahcorah.com",
  "status": "success",
  "content": "Micah Corah I am an Assistant Professor in Computer Science at the Colorado School of Mines and director of the Navigation, Aerial-robots, and Perception Planning Laboratory (NAPPLab) (full website forthcoming). My group studies aerial robotics, active perception, and multi-robot systems with applications to aerial videography, infrastructure inspection, and physical search (mine safety, search and rescue). Previously, I was a Postdoctoral Fellow in the Robotics Institute at Carnegie Mellon University, in the AirLab where I focuse on filming and reconstruction moving agents with groups of aerial robots. This work is relevant to applications such as sports cinematography, biomechanics, study of animal groups, and filming improvisational performations. Before that I was a postdoc at the NASA Jet Propulsion Laboratory and competed with team CoSTAR in the DARPA Subterranean Challenge where I focused on aerial navigation in challenging, underground environments. I received my Ph.D. also from CMU in 2020, working in RISLab. My thesis proposed RSP (Julia, C++) a scalable, distributed submodular maximization algorithm for perception planning with teams of robots with applications to autonomous exploration for mapping of three-dimensional environments as well as perception planning with multi-robot teams. As for myself, I enjoy outdoor activities such as cycling, rock climbing, and an occasional round of disc golf. I am also an avid music listener. I attend concerts when I can, and while metal is central to my taste, I also enjoy a variety of rock, pop, hip-hop, and experimental artists. Feel free to discuss to discuss any of these with me if we meet! Prospective students: *Please feel free to reach out directly if you would be interested in working with me at a graduate or undergraduate level or otherwise. I expect to be involved with students in Computer Science, Robotics, and Mechanical Engineering (pending a courtesy appointment); and I would encourage students to consider the robotics program and our other excellent faculty! I am looking for students a variety of backgrounds in areas such as computer science, engineering, physics, or applied mathematics. Depending on your background and interests, we might work primarily with math and theory, with aerial and mobile robots in lab settings (motion capture), or eventually toward field deployments such as at the Edgar Experimental Mine.",
  "content_length": 2421,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:32"
}