{
  "name": "Micah Beck",
  "homepage": "http://web.eecs.utk.edu/~mbeck",
  "status": "success",
  "content": "Micah Beck Micah Beck Min Kao Building, Room 433 1520 Middle Drive Knoxville, TN 37996-225 Email: mbeck at utk.edu Office: (865) 974-3548 Fax: (865) 974-5483 My vita. Associate Professor Dept. of Electrical Eng. and Computer Sci. University of Tennessee, Knoxville Why Computer Science Is No Good, Redux \"Why Computer Science Is No Good\" was a 1982 paper authored by Danny Hillis, the architect of the Connection Machine supercomputer and founder of Thinking Machines when he was an MIT graduate student. Hillis' provocative title is a reference to the way that certain simplifying assumptions that underpin the formal models on which Computer Science is based stood in the way of obtaining the greatest possible performance from available hardware resources. In particular, Hillis took issue with some aspects of the foundational work of Claude Shannon (who was on his doctoral committee) on the equivalence of digital circuits and Boolean logic. Hillis' insight enabled the development of SIMD supercomputers that dominated the field of high performance computing for a decade. Understanding the impact of this mismatch between the formal model and implementations based on it led me to seek to apply this same concept to other aspects of the field. Why Computer Science Is No Good, Redux. We're Reaping Just What We've Sowed The language of formal reasoning is often used in applied Computer Science to characterize the properties of engineered systems. In a recent article I described how the Internet's Transport Control (TCP) Protocol is typically described as \"reliable\" when in fact it only reduces the occurrence of certain kinds of error. Treating TCP as if it were completely reliable simplifies network programming by ignoring the consequences of error. This is just one example of the widespread use of the reassuring but misleading formal language. Any formal proof tells us that, if its assumptions are valid, and the rules of the logic are sound, then its consequences will hold. Since any engineered system will differ from the formal model on which such a proof is based, direct application of its predictions in the real world is necessarily fallacious. To understand the fallacy, we must find which element of the proof fails. ReapWhatWeSowed Bandwidth Is Dead. Long Live Data Logistics End users (and endpoints) don't care where the response comes from. What they do care about is low interaction response times (of which transmission latency is just one component). And the availability of rich services that meet their needs at a low cost with integrity. It doesn't matter to them if they are communicating with Cloud servers over an ultra-low latency network connection or if they are communicating with a proxy in their end network or integrated with the core network. Bandwidth Is Dead. Long Live Data Logistics Letting GenAI Take The Wheel Sound reasoning is increasingly the exclusive domain of those who aspire to move human knowledge and capabilities forward, rather than to exploit the comforts bequeathed to us by the past. This is not a wrong turn - it is where we have been headed all along. TakeTheWheel Hit the Goalie / With the Puck / In the Neck The language of formal reasoning is often used in applied Computer Science to characterize the properties of engineered systems. In a recent article I described how the Internet's Transport Control (TCP) Protocol is typically described as \"reliable\" when in fact it only reduces the occurrence of certain kinds of error. Treating TCP as if it were completely reliable simplifies network programming by ignoring the consequences of error. This is just one example of the widespread use of the reassuring but misleading formal language. Any formal proof tells us that, if its assumptions are valid, and the rules of the logic are sound, then its consequences will hold. Since any engineered system will differ from the formal model on which such a proof is based, direct application of its predictions in the real world is necessarily fallacious. To understand the fallacy, we must find which element of the proof fails. HitTheGoalie Read me on BLOG@CACM The Minimal Sufficiency Principle (31 Oct 2025) Bandwidth Is Dead. Long Live Data Logistics (29 Sept 2025) Why Computer Science Is No Good, Redux (5 Aug 2025) Accept The Consequences (29 May 2025) Hit the Goalie / With the Puck / In the Neck (9 April 2025) We're Reaping Just What We Sowed (8 Jan 2025) Datagram Delivery Considered Harmful (2 Dec 2024) Increasing Web Resilience (23 Aug 2024) Minimal Sufficiency and AI Governance (17 July 2024) The Fire Down Below (5 June 2024) How We Lost The Internet (10 May 2024) All of my CACM articles Follow on LinkedIn How We Ruined The Internet In this paper we examine an assumption that underpinned the development of the Internet architecture, namely that a loosely synchronous point-to-point datagram delivery service could adequately meet the needs of all network applications, including those which deliver content and services to a mass audience at global scale. We examine how the inability of the Networking community to provide a public and affordable mechanism to support such asynchronous point-to-multipoint applications led to the development of private overlay infrastructure, namely CDNs and Cloud networks, whose architecture stands at odds with the Open Data Networking goals of the early Internet advocates. We argue that the contradiction between those initial goals and the monopolistic commercial imperatives of hypergiant overlay infrastructure operators is an important reason for the apparent contradiction posed by the negative impact of their most profitable applications (e.g., social media) and strategies (e.g., targeted advertisement). How We Ruined The Internet Micah Beck, Terry Moore arXiv:2209.03482306.01101, June 2023 A keynote talk at the JDD 2025 Java Developers Conference in Krakow, Poland presenting this paper: Ed Burns: JDD Keynote Address Breaking Up A Digital Monopoly The dominating power of today's global data monopolies - most prominently Google, Facebook, and Amazon - has alarmed people around the world. Governments have been moved to seek ways to rein in such monopolies and establish reasonable conditions for competition in the services they offer. Their business models (e.g., targeted advertising) also raise major issues of personal security and privacy, so measures that control their tendencies toward monopoly may also help to address the threats they pose to civil and political liberties. We propose a regulatory strategy that addresses the naturally monopolistic nature of these services by isolating the core acquired data collection and management functions. Acquired data is derived from the discourse of society at large and so the public retains a legitimate ownership interest in it. Our proposal requires companies to compete by innovation rather than through monopolistic control over data. Breaking Up A Digital Monopoly Micah Beck and Terry Moore Communications of the ACM, June 2023, Vol. 66 No. 6, Pages 38-41. News & Information Was the Internet A Mistake? In 2021 a group of 18 emminent network researchers put their names on a white paper, the topic of which was how to add new services to the public Internet. The approach they championed made this fundamental assumption: \"... we should focus on what other services the Internet should offer besides packet delivery, and those services should be deployed on top of packet delivery.\" It would be hard to find a less controversial assumption these days. Yet in this response I argue that the Internet architecture's choice of global datagram forwarding as its defining common service may be making extensability impossible. How do you pass a test on a computer if you've never used a computer before? To get into university, Nigerian students must take an entrance test. Since 2015, this test has been computer-based, locking out hundreds of thousands of rural and urban students who have never used computers in school or at home. A group of volunteers is trying to bring some of those candidates back. Abdullahi D. Hassan in The Continent Issue 157, 13 April 2024. The Hedge Podcast Episode 150: Universal Broadband A discussion of whether a less synchronous form of broadband connectivity be more cheaply and easily deployed to the entire world. https://rule11.tech/hedge-150 Recent Publications Is Universal Broadband Service Impossible? Micah Beck, Terry Moore IEEE 19th International Conference on Mobile Ad Hoc and Smart Systems (MASS 2022). Denver, CO. Oct 19-21, 2022. Compact unary coding for bosonic states as efficient as conventional binary encoding for fermionic states Hatem Barghathi, Caleb Usadi, Micah Beck, and Adrian Del Maestro Physiscs Review B 105 - L121116, 29 March 2022 Deployment Scalability in Exposed Buffer Processing Micah Beck 17th IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2020) Delhi NCR, India, December 10-13, 2020 (Virtual conference) Sorry, your browser doesn't support embedded videos. IEEE MASS 2020 presentation, December 2020 \"On The Hourglass Model\" Micah Beck Communications of the ACM, July 2019, Vol. 62 No. 7, Pages 48-57. Communications of the ACM, July 2019 \"Interoperable Convergence of Storage, Networking and Computation\" Micah Beck, Terry Moore, Piotr Luszczek, Anthony Danalis Future of Information and Communication Conference, 14-15 March 2019, San Francisco. \"Data Logistics: Toolkit and Applications\" Micah Beck, Nancy French, Ezra Kissel, Terry Moore, Martin Swany GOODTECHS 2019 - 5th EAI International Conference on Smart Objects and Technologies for Social Good, 9/25-27/2019, Valencia. White Papers and Presentations Exposed Buffer Architecture Micah Beck arXiv:2209.03488, September 2022 Universal Digital Services Through Basic Broadband Micah Beck, Terry Moore arXiv:2107.12269, July 2021 Cybercosm: New Foundations for a Converged Science Data Ecosystem Mark Asch, Francois Bodin, Micah Beck, ",
  "content_length": 12537,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:33"
}