{
  "name": "Michele Sevegnani",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/michelesevegnani",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Michele Sevegnani Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Michele SevegnaniMr Ethan KellyZhen Tian Dr Michele Sevegnani Senior Lecturer (Computing Science) telephone: 01413301621 email: Michele.Sevegnani@glasgow.ac.uk Room S144, Computing Science, Sir Alwyn Williams Bldg Import to contacts https://orcid.org/0000-0001-6773-9481 Biography I am Senior Lecturer at the School of Computing Science. I received a PhD in Computing Science from the University of Glasgow and an MSc in Bioinformatics jointly from the universities of Edinburgh and Trento (Italy). I previously held positions at the University of Glasgow as Research Fellow in the Science of Sensor Systems Software (S4) EPSRC programme grant and as EPSRC Doctoral Prize Fellow. My research is within the field of formal modelling and verification with a particular focus on spatial and probabilistic aspects. My main contribution to date is bigraphs with sharing, a novel mathematical formalism that encapsulates both dynamic and spatial behaviour. Find out more on my personal website. Research interests My research focusses on the theory of bigraphs and how to use it to reason about safety, reliability and predictability of location-aware, event-based, software systems, particularly complex systems that are already deployed. I currently lead FARM, a PETRAS research projects on formal methods for resiliance modelling in Agritech and MAGIC, a PETRAS project on modelling perspectives in autonomous aerial and ground vehicles. I have also recently received an Amazon Research Award on Automated Reasonig for the project “From Whiteboards to Models: Diagrammatic Formal Modelling for Everyone”. In the past, I have lead a research programme on formal methods for IoT device management platforms, with the Royal Society of Edinburgh and the Taiwan Ministry of Science and Technology, and was visiting researcher at UC Berkeley, modelling autonomous swarm systems. I am the lead developer of BigraphER, a suite of open-source tools for rewriting, simulation and visual display of bigraphs. Recent research includes estimation techniques for networks of sensors with overlapping ranges, digital twinning for Mixed-Reality systems, and human-autonomy teaming in connected vehicular systems. Keywords New computational models: Bigraphs with sharing (time & space) Modelling & verification (Digital Twin) Probabilistic model-checking Event-based systems Systems that evolve in multiple dimensions (location, bandwidth, signal, connectivity, etc.) Experience & applications Mixed-reality systems Networking - IoT - Communication protocols System monitoring, management & deployment Connected and autonomous vehicles Research groupsFormal Analysis, Theory & Algorithms Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2016 | 2015 | 2014 | 2012Number of items: 51.2025 Das, Susmoy ORCID: https://orcid.org/0000-0001-9118-7402, Almeida, Ricardo, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Formal Analysis of Resilience in Transport Systems with Bigraphs. In: 2nd International Workshop on Safety/Reliability/Trustworthiness of Intelligent Transportation Systems (SRToITS 2025) in conjunction with SAFECOMP 2025, Stockholm, Sweden, 09-12 September 2025, ISBN 9783032020178 (doi: 10.1007/978-3-032-02018-5_31) Phetmanee, Surasak ORCID: https://orcid.org/0000-0002-8913-1124, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2025) Rational Verification in Repeated Security Games. 4th International Workshop on Safety and Security Interactions (SENSEI 2025), Stockholm, Sweden, 9 Sept 2025. ISBN 9783032020178 (doi: 10.1007/978-3-032-02018-5_23) Jabbar, Abdul, Azam, Naila, Ishabakaki, Prisila, Ur Rehman, Masood ORCID: https://orcid.org/0000-0001-6926-7983, Imran, Muhammad Ali ORCID: https://orcid.org/0000-0003-4743-9136, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481, Larijani, Hadi, Shah, Syed Aziz, Abbasi, Qammer ORCID: https://orcid.org/0000-0002-7097-9969 and Usman, Muhammad (2025) Millimeter-wave contactless vital sign monitoring using dynamic metasurface antenna. IEEE Antennas and Wireless Propagation Letters, (doi: 10.1109/LAWP.2025.3597972) (Early Online Publication) Almeida, Ricardo, Das, Susmoy ORCID: https://orcid.org/0000-0001-9118-7402, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Calder, Muffy ORCID: https://orcid.org/0000-0001-5033-7232 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Modelling Railway Networks with Bigraphs: Electrification, Failures, and Optimisation. In: 6th International Conference on Reliability, Safety, and Security of Railway Systems (RSSRail), Pisa, Italy, 26-28 Nov 2025, (Accepted for Publication) Althubiti, Ebtihal, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Formalising privacy regulations with bigraphs. Software and Systems Modeling, (doi: 10.1007/s10270-025-01293-2) (Early Online Publication) Mitchell, Daniel ORCID: https://orcid.org/0000-0002-9390-4150, Gu, Yue ORCID: https://orcid.org/0000-0002-8134-5822, Blanche, Jamie, Harper, Samuel, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Flynn, David ORCID: https://orcid.org/0000-0002-1024-3618 (2025) A cyber physical architecture for symbiotic multi-robot fleet management. In: Virtual and Augmented Reality Technology-Enhanced Learning. Series: Gaming media and social effects. Springer, pp. 379-421. ISBN 9789819623327 (doi: 10.1007/978-981-96-2332-7_17) Burns, Kyle ORCID: https://orcid.org/0000-0003-4812-0098, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481, Mccreesh, Ciaran ORCID: https://orcid.org/0000-0002-6106-4871 and Trimble, James (2025) Introducing The Maximum Common Bigraph Problem. In: 16th International Workshop on Graph Computation Models (GCM 2025), Koblenz, Germany, 10-13 June 2025, (Accepted for Publication) Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Xu, Mengwei (2025) Modelling and verifying BDI agents under uncertainty. Science of Computer Programming, 242, 103254. (doi: 10.1016/j.scico.2024.103254) Metere, Roberto, Ye, Kangfeng, Gu, Yue ORCID: https://orcid.org/0000-0002-8134-5822, Zhang, Zhi, Alrajeh, Dalal, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Yadav, Poonam (2025) Towards Achieving Energy Efficiency and Service Availability in 6G O-RAN via Formal Verification. In: 12th International Symposium DataMod 2024: From Data to Models and Back, Aveiro, Portugal, 4-5 November 2024, ISBN 9783031879074 (doi: 10.1007/978-3-031-87908-1_9) Marcon, Cécile, Allignol, Cyril, Picard, Celia, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Thirioux, Xavier (2025) BiCoq : Bigraphs Formalisation with Coq. In: SAC '25: 40th ACM/SIGAPP Symposium on Applied Computing, New York, USA, 31 Mar - 04 Apr 2025, pp. 1982-1989. ISBN 9798400706295 (doi: 10.1145/3672608.3707824) Abioye, Ayodeji O., Hunt, William, Gu, Yue ORCID: https://orcid.org/0000-0002-8134-5822, Schneiders, Eike, Naiseh, Mohammad, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481, Ramchurn, Sarvapali D., Fishcer, Joel E. and Soorati, Mohammad (2025) A user study evaluation of predictive formal modelling at runtime in human-swarm interaction. ACM Transactions on Human-Robot Interaction, (doi: 10.1145/3727989) (Early Online Publication) Xu, Mengwei ORCID: https://orcid.org/0000-0003-4978-3061, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) CAN-Verify: automated analysis for BDI agents. Science of Computer Programming, 241, 103233. (doi: 10.1016/j.scico.2024.103233) Albalwe, Maram, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Modelling Real-time Systems with Bigraphs. In: 15th International Workshop on Graph Computation Models, Enschede, Netherlands, 09 Jul 2024, pp. 96-116. (doi: 10.4204/EPTCS.417.6) Althubiti, Ebtihal and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Modelling Privacy Compliance in Cross-border Data Transfers with Bigraphs. In: 15th International Workshop on Graph Computation Models (GCM 2024), Enschede, Netherlands, 9 July 2024, (doi: 10.4204/EPTCS.417.2) Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Calder, Muffy ORCID: https://orcid.org/0000-0001-5033-7232 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Practical modelling with bigraphs. Formal Aspects of Computing, (doi: 10.1145/3721142) (Early Online Publication) 2024 Phetmanee, Surasak ORCID: https://orcid.org/0000-0002-8913-1124, Sevegnani, Michele ORCID: htt",
  "content_length": 45013,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:21"
}