{
  "name": "Michael Guthe",
  "homepage": "https://www.ai5.uni-bayreuth.de/de/team/michael-guthe/index.php",
  "status": "success",
  "content": "Michael Guthe Druckansicht der Internetadresse: Team > Prof. Dr. Michael Guthe zurück zur Übersicht zurück zur Übersicht Prof. Dr. Michael Guthe Person Publikationen Kontakt Fakultät für Mathematik, Physik und InformatikLehrstuhl für Angewandte Informatik V ArbeitsgebietGeometrische ModellierungVisualisierungVirtuelle RealitätArbeitsschwerpunkteComputer Aided DesignEchtzeitgrafikMensch-Maschine InteraktionComputer Aided DesignDie zunehmende Komplexität industrieller CAD Modelle stellt immer größere Anforderungen an CAD Systeme. Daher werden neue Verfahren benötigt, die die wachsenden Datenmengen verwalten können und so die interaktive Modellierung erlauben.EchtzeitgrafikDer Schwerpunkt auf dem Gebiet der Echtzeitgrafik liegt in der Erzeugung fotorealistischer Bilder unter Verwendung aktueller Grafikhardware. Dabei ist insbesondere die Ausnutzung der Fähigkeiten und Einschränkungen der menschlichen Wahrnehmung von Interesse, um möglichst real wirkende Bilder in Echtzeit zu erzeugen.Mensch-Maschine InteraktionIn in der Virtuellen Realität ist eine möglichst natürliche Mensch-Maschine Interaktion wünschenswert, wozu möglichst nicht-invasive, also kamerabasierte, Verfahren benötigt werden. Fakultät für Mathematik, Physik und InformatikLehrstuhl für Angewandte Informatik V Publikationen Referierte Beiträge in Zeitschriften (begutachtet) Reischl, Maximilian; Knauer, Christian; Guthe, Michael Parallel near-optimal pathfinding based on landmarks In: Computers & Graphics Bd. 102 (2022) . - S. 1-8doi:10.1016/j.cag.2021.11.007 ... Lobachev, Oleg; Funatomi, Takuya; Pfaffenroth, Alexander; Förster, Reinhold; Knudsen, Lars; Wrede, Christoph; Guthe, Michael; Haberthür, David; Hlushchuk, Ruslan; Salaets, Thomas; Toelen, Jaan; Gaffling, Simone; Mühlfeld, Christian; Grothausmann, Roman Evaluating Registrations of Serial Sections With Distortions of the Ground Truths In: IEEE Access Bd. 9 (2021) . - S. 152514-152535doi:10.1109/ACCESS.2021.3124341 ... Steiniger, Birte S.; Pfeffer, Henriette; Guthe, Michael; Lobachev, Oleg Exploring human splenic red pulp vasculature in virtual reality : details of sheathed capi ... In: Histochemistry and Cell Biology Bd. 155 (2021) Heft 3. - S. 341-354doi:10.1007/s00418-020-01924-3 ... Lobachev, Oleg; Berthold, Moritz; Pfeffer, Henriette; Guthe, Michael; Steiniger, Birte S. Inspection of Histological 3D Reconstructions in Virtual Reality In: Frontiers in Virtual Reality Bd. 2 (2021) doi:10.3389/frvir.2021.628449 ... Jakob, Johannes; Guthe, Michael Optimizing LBVH‐Construction and Hierarchy‐Traversal to accelerate kNN Queries on Point Cl ... In: Computer Graphics Forum Bd. 40 (2021) Heft 1. - S. 124-137doi:10.1111/cgf.14177 ... Meister, Daniel; Ogaki, Shinji; Benthin, Carsten; Doyle, Michael J.; Guthe, Michael; Bittner, Jiří A Survey on Bounding Volume Hierarchies for Ray Tracing In: Computer Graphics Forum Bd. 40 (2021) Heft 2. - S. 683-712doi:10.1111/cgf.142662 ... Jakob, Johannes; Buchenau, Christoph; Guthe, Michael Parallel Globally Consistent Normal Orientation of Raw Unorganized Point Clouds In: Computer Graphics Forum Bd. 38 (2019) Heft 5. - S. 163-173doi:10.1111/cgf.13797 ... Steiniger, Birte S.; Ulrich, Christine; Berthold, Moritz; Guthe, Michael; Lobachev, Oleg Capillary networks and follicular marginal zones in human spleens : Three-dimensional mode ... In: PLoS One Bd. 13 (2018) Heft 2doi:10.1371/journal.pone.0191019 ... Steiniger, Birte S.; Wilhelmi, Verena; Berthold, Moritz; Guthe, Michael; Lobachev, Oleg Locating human splenic capillary sheaths in virtual reality In: Scientific Reports Bd. 8 (2018) doi:10.1038/s41598-018-34105-3 ... Selgrad, Kai; Lier, Alexander; Martinek, Magdalena; Buchenau, Christoph; Guthe, Michael; Kranz, Franziska; Schäfer, Henry; Stamminger, Marc A Compressed Representation for Ray Tracing Parametric Surfaces In: ACM Transactions on Graphics Bd. 36 (2017) Heft 4doi:10.1145/3072959.2953877 ... Lobachev, Oleg; Ulrich, Christine; Steiniger, Birte S.; Wilhelmi, Verena; Stachniss, Vitus; Guthe, Michael Feature-based multi-resolution registration of immunostained serial sections In: Medical Image Analysis Bd. 35 (2017) . - S. 288-302doi:10.1016/j.media.2016.07.010 ... Jakob, Johannes; Buchenau, Christoph; Guthe, Michael A Parallel Approach to Compression and Decompression of Triangle Meshes using the GPU In: Computer Graphics Forum Bd. 36 (2017) Heft 5. - S. 71-80doi:10.1111/cgf.13246 ... Schmidt, Martin; Lobachev, Oleg; Guthe, Michael Coherent metropolis light transport on the GPU using speculative mutations In: Journal of WSCG Bd. 24 (2016) Heft 1. - S. 1-8https://otik.uk.zcu.cz/bitstream/11025/21640/1/Sch ... Steiniger, Birte S.; Stachniss, Vitus; Wilhelmi, Verena; Seiler, Anja; Lampp, Katrin; Neff, Andreas; Guthe, Michael; Lobachev, Oleg Three-Dimensional Arrangement of Human Bone Marrow Microvessels Revealed by Immunohistolog ... In: PLoS One Bd. 11 (2016) Heft 12doi:10.1371/journal.pone.0168173 ... Lobachev, Oleg; Guthe, Michael; Loogen, Rita Estimating Parallel Performance In: Journal of Parallel and Distributed Computing Bd. 73 (2013) Heft 6. - S. 876-887doi:10.1016/j.jpdc.2013.01.011 ... Steiniger, Birte S.; Bubel, Simon; Böckler, Werner; Lampp, Katrin; Seiler, Anja; Jablonski, Boris; Guthe, Michael; Stachniss, Vitus Immunostaining of Pulpal Nerve Fibre Bundle/Arteriole Associations in Ground Serial Sectio ... In: Cells Tissues Organs Bd. 198 (2013) Heft 1. - S. 57-65doi:10.1159/000351608 ... Lobachev, Oleg; Schmidt, Martin; Guthe, Michael Optimizing Multiple Camera Positions for the Deflectometric Measurement of Multiple Varyin ... In: Journal of WSCG Bd. 21 (2013) Heft 2. - S. 145-152https://pdfs.semanticscholar.org/d579/d2ec1de10ee6 ... Auzinger, Thomas; Guthe, Michael; Jeschke, Stefan Analytic Anti-Aliasing of Linear Functions on Polytopes In: Computer Graphics Forum Bd. 31 (2012) Heft 2. - S. 335-344doi:10.1111/j.1467-8659.2012.03012.x ... Derzapf, Evgenij; Guthe, Michael Dependency-Free Parallel Progressive Meshes In: Computer Graphics Forum Bd. 31 (2012) Heft 8. - S. 2288-2302doi:10.1111/j.1467-8659.2012.03154.x ... Derzapf, Evgenij; Ganster, Björn; Guthe, Michael; Klein, Reinhard River Networks for Instant Procedural Planets In: Computer Graphics Forum Bd. 30 (2011) Heft 7. - S. 2031-2040doi:10.1111/j.1467-8659.2011.02052.x ... Menzel, Nicolas; Guthe, Michael Towards perceptual simplification of models with arbitrary materials In: Computer Graphics Forum Bd. 29 (2010) Heft 7. - S. 2261-2270doi:10.1111/j.1467-8659.2010.01815.x ... Guthe, Michael; Müller, Gero; Schneider, Martin; Klein, Reinhard BTF‐CIELab : A Perceptual Difference Measure for Quality Assessment and Compression of BTF ... In: Computer Graphics Forum Bd. 28 (2009) Heft 1. - S. 101-113doi:10.1111/j.1467-8659.2008.01299.x ... Menzel, Nicolas; Guthe, Michael g‐BRDFs : An Intuitive and Editable BTF Representation In: Computer Graphics Forum Bd. 28 (2009) Heft 8. - S. 2189-2200doi:10.1111/j.1467-8659.2009.01432.x ... Guthe, Michael; Balázs, Ákos; Klein, Reinhard GPU-based Appearance Preserving Trimmed NURBS Rendering In: Journal of WSCG Bd. 14 (2006) Heft 1-3. - S. 1-8https://pdfs.semanticscholar.org/0106/8d38fa87dcd8 ... Greß, Alexander; Guthe, Michael; Klein, Reinhard GPU-based Collision Detection for Deformable Parameterized Surfaces In: Computer Graphics Forum Bd. 25 (2006) Heft 3. - S. 497-506doi:10.1111/j.1467-8659.2006.00969.x ... Guthe, Michael; Borodin, Pavel; Klein, Reinhard Fast and accurate Hausdorff distance calculation between meshes In: Journal of WSCG Bd. 13 (2005) Heft 2. - S. 41-48https://pdfs.semanticscholar.org/427d/c0d9ed6fd8f0 ... Guthe, Michael; Balázs, Ákos; Klein, Reinhard GPU-based trimming and tessellation of NURBS and T-Spline surfaces In: ACM Transactions on Graphics Bd. 24 (2005) Heft 3. - S. 1016-1023doi:10.1145/1073204.1073305 ... Meseth, Jan; Guthe, Michael; Klein, Reinhard Interactive Fragment Tracing In: The Visual Computer Bd. 21 (2005) Heft 8-10. - S. 591-600doi:10.1007/s00371-005-0322-2 ... Balázs, Ákos; Guthe, Michael; Klein, Reinhard Efficient trimmed NURBS tessellation In: Journal of WSCG Bd. 12 (2004) Heft 1-3. - S. 27-33https://pdfs.semanticscholar.org/0543/c019d4815453 ... Balázs, Ákos; Guthe, Michael; Klein, Reinhard Fat Borders : Gap Filling For Efficient View-dependent LOD NURBS Rendering In: Computers & Graphics Bd. 28 (2004) Heft 1. - S. 79-85doi:10.1016/j.cag.2003.10.007 ... Wahl, Roland; Massing, Manuel; Degener, Patrick; Guthe, Michael; Klein, Reinhard Scalable Compression and Rendering of Textured Terrain Data In: Journal of WSCG Bd. 12 (2004) Heft 1-3. - S. 521-528https://pdfs.semanticscholar.org/ed90/b6f93901039c ... Guthe, Michael; Klein, Reinhard Streaming HLODs : An out-of-core viewer for network visualization of huge polygon models In: Computers & Graphics Bd. 28 (2004) Heft 1. - S. 43-50doi:10.1016/j.cag.2003.10.016 ... Guthe, Michael; Klein, Reinhard Automatic texture atlas generation from trimmed NURBS models In: Computer Graphics Forum Bd. 22 (2003) Heft 3. - S. 453-461doi:10.1111/1467-8659.00693 ... Guthe, Michael; Klein, Reinhard Efficient NURBS Rendering using View-Dependent LOD and Normal Maps In: Journal of WSCG Bd. 11 (2003) Heft 1-3https://pdfs.semanticscholar.org/4605/0b38cf5c2403 ... WSCG' 2003, 11th International Conference in Central Europe on Computer Graphics, Visualization and Computer Vision, Plzen, Czech Republic Beiträge in Zeitschriften (nicht begutachtet) Reischl, Maximilian; Derzapf, Evgenij; Guthe, Michael Physically Based Real‐Time Rendering of Teeth and Partial Restorations In: Computer Graphics Forum Bd. 39 (2020) Heft 1. - S. 106-116doi:10.1111/cgf.13665 ... Beiträge in Sammelbänden (begutachtet) Abou Akar, Chafic; Tekli, Jimmy; Jess, Daniel; Khoury, Mario; Kamradt, Marc; Guthe, Michael Synthetic Object Recognition Dataset for Industries 2022 35th SIBGRAPI Conference on Graphics, Patterns and Images (SIBGRAPI) : Proceedings - Piscataway, NJ: IEEE, 2022. - S. 150-155 doi:10.1109/SIBGRAPI55357.2022.99917",
  "content_length": 21103,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:06"
}