{
  "name": "Michael Schröder 0002",
  "homepage": "https://www.bsdlab.uni-freiburg.de/people/michael_tangermann",
  "status": "success",
  "content": "Michael Tangermann — Brain State Decoding Lab Search Site only in current section Advanced Search… You are here: Home › People › Michael Tangermann Info Michael Tangermann Dr. rer. nat. Michael Tangermann Since July 2013, I am the head of the Brain State Decoding Lab at the University of Freiburg, Germany. The lab is part of the cluster of excellence BrainLinks-BrainTools and most of my projects are funded by the German excellence initiative. From 2007 to 2013, I was a postdoc researcher at the Machine Learning / Intelligent Data Analysis group at the Technical University of Berlin, Germany and member of the Berlin Brain-Computer Interface group (BBCI). From 2005 to 2017, I joined the Intelligent Data Analysis Group at the Fraunhofer FIRST, Berlin (now Fraunhofer FOKUS). From 2000 to 2005, I conducted the research for my PhD at the University of Tübingen, Germany, in the Department of Computer Engineering. My research focus is on machine learning problems, which arise during the single-trial decoding of mental states from neuronal signals. Brain data is specifically challenging due to its low signal-to-noise ratio, high dimensionality, and -- as brain signals change over time -- its non-stationary characteristics. Algorithmically, these challenges can be tackled by the subject-specific optimization of spatial filters, an adaptive classification/decoding strategy capable to track non-stationary distributions of data, by high-performing yet robustly regularized decoding methods, and by transfer learning methods. As the future availability of continuous data streams from implanted neurotechnological devices can be expected, machine learning methods which can profit from and deal with large data sets are explored, such as convolutional neural networks.I study these data analysis problems in the context of my application field, non-invasive and invasive Brain-Computer Interfaces (BCI). It comprises BCI paradigms for patients in order to improve rehabilitation after stroke, closed-loop deep brain stimulation, communication applications and control of external devices, new auditory BCI paradigms which allow tapping into single-trial language processing, passive mental state monitoring of workload, listening effort, attentional- and learning processes, and the BCI-supported interaction between humans and robots e.g. in collaborative tasks and autonomous driving scenarios. These topics are studied in real-time applications, which are set up with healthy subjects in our labs, as well as with patients at their bedsides. My publication list gives a more detailed picture of my research activities. My Google scholar account provides an overview, how well my publications are considered in the research community. For some research topics, you may find short overviews. My contributions for student education are listed in the teaching section. Quelle: Michael Tangermann — Brain State Decoding Lab https://www.bsdlab.uni-freiburg.de/people/michael_tangermann ( Dec 01, 2025 )",
  "content_length": 3009,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:54"
}