{
  "name": "Michael Nowatkowski",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=MNOWATKOWSKI",
  "status": "success",
  "content": "Michael Nowatkowski - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Michael Nowatkowski Professor Michael Nowatkowski Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesAdministrationDepartment of Cyber Science/EngineeringSchool of Computer and Cyber SciencesDepartment of Computer & Cyber SciencesJames M. Hull College of BusinessDepartment of Hull College of BusinessAdministrationDepartment of The Graduate School BioDr. Michael Nowatkowski is a Professor with the School of Computer and Cyber Sciences and the Cyber Institute Director. He also serves as the Head of the Cyber Programs of Study and the National Centers of Academic Excellence (NCAE) Point of Contact, MNOWATKOWSKI@augusta.edu (706) 721-0549 RV1 1606 General Credentials Instruction Scholarship Service Education Ph.D., Electrical and Computer Engineering Georgia Institute of Technolog, 2010 MS, Electrical and Computer Engineering Georgia Institute of Technolog, 2000 BS, Electrical Engineering Rose - Hulman Institute of Tec, 1990 Certifications GIAC Response and Industrial Defense (GRID) Global Information Assurance Certification (GIAC), 2017 Certified Information Systems Security Professional (CISSP) International Information System Security Certification Consortium, 2013 GIAC Information Security Professional (GISP) Global Information Assurance Certification (GIAC), 2013 GIAC Certified Incident Handler (GCIH) Global Information Assurance Certification (GIAC), 2012 GIAC Certified Intrusion Analyst (GCIA) Global Information Assurance Certification (GIAC), 2011 Awards & Honors 2024 Outstanding Faculty Award Augusta University, 2024 Outstanding Faculty Member School of Computer and Cyber Sciences, 2022 High Five My Faculty Award •\tAugusta University Center for Undergraduate Research and Scholarship, 2021 Courses Taught Most Recent Academic Year CSCI 8940 Dissertation Research CSCI 7440 Evaluating Cybersecurity CSCI 8720 Problems in Computer & Cyber AIST 4960 Undergraduate Internship: Security + Bootcamp CENG 4100 Cyber-Physical Systems CSCI 6100 Cyber-physical Systems Teaching Interests Dr. Nowatkowski enjoys teaching courses related to networking, operational technology and critical infrastructure security, and electronics. Additionally, he teaches courses on both offensive and defensive cybersecurity. Scholarship Selected Recent Publications Developing a Framework for Hardware Security, 2025 Conference Proceeding Medical Devices, 2024 Conference Proceeding Jack Voltaic Critical Infrastructure and Public-Private Partnerships, 2019 Journal Article, Academic Journal Hardware Reverse Engineering Tools and Techniques, 2019 Conference Proceeding The Unforeseen in Unmanned Vehicles, 2018 Conference Proceeding Research Interests His research interests include industrial control system security, medical device security, electronics, and cyber operations education. College Service Director, Cyber Institute 2023 - Present Head of the Cyber Programs of Study 2021 - Present Faculty and Staff Interviewer 2016 - Present Role: Committee Member Faculty Affairs Committee 2017 - 2021 Role: Committee Member Academic Affairs Committee 2017 - 2019 Role: Committee Member University Service Strategic Enrollment Management 2021 - 2022 Role: Committee Member Provost's Task Force on Faculty Workload 2019 - 2021 Role: Committee Member Georgia Cyber Innovation and Training Center 2017 - 2018 Professional Service Infragard Augusta Chapter 2017 - Present Role: Committee Member Public Service GenCyber Camp 2017 - 2017 Role: Guest Speaker Greenbrier Middle School 2017 Role: Guest Speaker US Army Cyber School 2016 - 2017 Role: Guest Speaker Richmond County Medical Society 2017 Role: Guest Speaker",
  "content_length": 3784,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:42"
}