{
  "name": "Michael Rung-Tsong Lyu",
  "homepage": "http://www.cse.cuhk.edu.hk/lyu",
  "status": "success",
  "content": "home [Michael R. Lyu] Michael R. Lyu Trace: » home MAIN MENU Home News My Weekly Schedule My Fellow Students Ph.D. Students M.Phil. Students M.Sc. Students FYP Students Previous Students Group Photos My Research Staff Postdoctoral Fellows Research Assistants Visiting Professors Visiting Students Publications All by Year Book Conference Journal Google Scholar Teaching ARISE Lab TIIC Lab Login Digg this! Del.Icio.Us Google bookmark Michael R. Lyu 呂榮聰 B.Sc. (National Taiwan University), M.Sc. (UC Santa Barbara), Ph.D. (UCLA) IEEE Fellow (2004) AAAS Fellow (2007) Croucher Senior Research Fellow (2008) IEEE Reliability Society Engineer of the Year (2010) ACM Fellow (2015) China Computer Federation (CCF) Overseas Outstanding Contributions Award (2018) Choh-Ming Li Professor of Computer Science and Engineering (2020, 2024) The 13th Guanghua Engineering Science and Technology Award (2020) HKAES Fellow (2021) RGC Senior Research Fellow (2024) IEEE Life Fellow (2025) Office: +(852) 3943 8429 Fax: +(852) 2603 5024 Email: lyu@cse.cuhk.edu.hk Prof. Michael R. Lyu is currently a Professor of the Computer Science and Engineering department in the Chinese University of Hong Kong. He worked at the Jet Propulsion Laboratory as a Technical Staff Member from 1988 to 1990. From 1990 to 1992 he was with the Electrical and Computer Engineering Department at the University of Iowa as an Assistant Professor. From 1992 to 1995, he was a Member of the Technical Staff in the Applied Research Area of the Bell Communications Research, Bellcore. From 1995 to 1997 he was a research Member of the Technical Staff at Bell Laboratories, which was first part of AT&T, and later became part of Lucent Technologies. Prof. Lyu's research interests include software engineering, dependable computing, distributed systems, cloud computing, mobile networking, big data, and machine learning. He has participated in more than 30 industrial projects in these areas, and helped to develop many commercial systems and software tools. He has been frequently invited as a keynote or tutorial speaker to conferences and workshops in U.S., Europe, and Asia. Prof. Lyu has published over 700 refereed journal and conference papers in his research areas. He initiated the first International Symposium on Software Reliability Engineering (ISSRE) in 1990. He was the Program Chair for ISSRE'96, Program co-Chair for WWW'10, General Chair for ISSRE'01, General co-Chair for PRDC'05, and has served in program committees for many conferences. He is the editor for two book volumes: Software Fault Tolerance, published by Wiley in 1995 and the Handbook of Software Reliability Engineering, published by IEEE and McGraw-Hill in 1996. These books have received an overwhelming response from both the academia and the industry. He was an Associate Editor of IEEE Transactions on Reliability, IEEE Transactions on Knowledge and Data Engineering, IEEE Transactions on Services Computing, and Journal of Information Science and Engineering. He is currently on the editorial board of IEEE Access, Wiley Software Testing, Verification and Reliability Journal (STVR), and ACM Transactions on Software Engineering Methodology (TOSEM). He was elected to IEEE Fellow (2004), AAAS Fellow (2007), and ACM Fellow (2015) for his contributions to software reliability engineering and software fault tolerance. He was also named Croucher Senior Research Fellow in 2008 and IEEE Reliability Society Engineer of the Year in 2010. He was granted with China Computer Federation (CCF) Overseas Outstanding Contributions Award in 2018, The 13th Guanghua Engineering Science and Technology Award in 2020, and Fellow of the Hong Kong Academy of Engineering Sciences (HKAES) in 2021. Prof. Lyu received his B.S. in Electrical Engineering from National Taiwan University in 1981, his M.S. in Computer Science from University of California, Santa Barbara, in 1985, and his Ph.D. in Computer Science from University of California, Los Angeles in 1988. Books Handbook of Software Reliability Engineering Software Fault Tolerance QoS Management of Web Services DSN2011Proceedings Sparse Learning Under Regularization Framework More Than Semi-supervised Learning Machine Learning: Modeling Data Locally and Globally QoS Prediction in Cloud and Service Computing Recent Paper Awards * [ACM SIGSOFT Distinguished Paper Award (2025)] Search-Based LLMs for Code Optimization (ICSE'25) * [ACM SIGSOFT Distinguished Paper Award (2025)] PerfCodeGen: Improving Performance of LLM Generated Code with Execution Feedback (FORGE'25) * [ACM SIGSOFT Distinguished Paper Award (2023)] Generative Type Inference for Python (ASE'23) * [WSDM Test of Time Award (2022)] Recommender systems with social regularization (WSDM'11) * [SIGIR Test of Time Award (2020)] Learning to Recommend with Social Trust Ensemble (SIGIR'09) * [CIKM Test of Time Award (2019)] SoRec: Social Recommendation Using Probabilistic Matrix Factorization (CIKM'08) * [Highlights from 30 years of ISSRE (2019)] Experience Report: System Log Analysis for Anomaly Detection (ISSRE'16) * [Highlights from 30 years of ISSRE (2019)] A Novel Method for Early Software Quality Prediction Based on Support Vector Machine (ISSRE'05) * [Highlights from 30 years of ISSRE (2019)] A Coverage Analysis Tool for the Effectiveness of Software Testing (ISSRE'93) * [Vannevar Bush Best Paper Award (2012)] Modeling and Exploiting Heterogeneous Bibliographic Networks for Expertise Ranking (JCDL'12) * [ACM SIGSOFT Distinguished Paper Award (2010)] Collaborative Reliability Prediction for Service-Oriented Systems (ICSE'10) home.txt · Last modified: 2025/09/16 20:23 by lyu Back to top",
  "content_length": 5660,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:49"
}