{
  "name": "Michael Curtis Mozer",
  "homepage": "http://www.cs.colorado.edu/~mozer",
  "status": "success",
  "content": "Michael C. Mozer Michael C. Mozer Professor Department of Computer Science and Institute of Cognitive Science University of Colorado, Boulder Professor Mozer has moved to Google DeepMind. He maintains an affiliation with the University but he will no longer be available for University committees and service. About Me Research and Teaching Overview Curriculum Vitae Affiliations Contact Information Office Hours Research Selected Publications Projects Prospective PhD Students Opportunities for Current Students Workshops, Meetings, and Seminars Teaching My Current Courses My Past Courses Machine Learning At CU Computational Modeling Prelim Random Photos Bizarre Research and Teaching Interests Research Interests Cognitively informed artificial intelligence: Incorporating insights from human perception and cognition into the design of AI architectures and machine learning methods. For example, I have proposed recurrent neural network models motivated by properties of human long-term memory. Here's a symposium talk on early work. Human optimization: Developing software tools to improve how people learn, remember, and make decisions. Much of my present work is aimed at determining the most effective means of teaching and the manner in which to best present information for human consumption. We're just starting a project to instrument smart digital textbooks to boost student learning. We also developed the Colorado Optimized Language Tutor, which helps students learn facts (e.g., foreign language vocabulary) by scheduling study to promote long-term retention. Here's a recent talk on this project. Cognitive modeling: Building psychologically grounded models of human cognition that allow us to predict and understand behavior. I have worked in the areas of selective attention, awareness, memory, learning, executive control, decision making, and neuropsychological disorders. Intelligent environments: Designing computer interfaces that are smarter, anticipatory, and easier to use. A past project that achieved some notoriety was the adaptive house, a control system that learns to manage energy resources (air heat, water heat, lighting, and ventilation) in an actual residence to maximize the satisfaction of the inhabitants and minimize energy consumption. Recent interview about my group's work Longer description of research interests See old people reminiscing about the history of neural networks and idly speculating about the future Teaching Interests Machine learning and big data analytics Neural networks and deep learning Bayesian models Cognitive science and cognitive neuroscience Computational modeling of human cognition",
  "content_length": 2657,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:50"
}