{
  "name": "Michael J. Watts",
  "homepage": "http://www.rle.mit.edu/pmg/people",
  "status": "success",
  "content": "People - Photonic Microsystems Group Photonic Microsystems Group Prof. Mike Watts Home News Research Publications People Contact People - Photonic Microsystems Group June 2015 Fishing Trip at Cape Cod January 2017 Ski Trip to Vermont Faculty: Michael Watts Associate Professor mwatts-at-mit-dot-edu Room 26-343 RLE Bio | Google Scholar Professor Michael R. Watts is a principal investigator in the Research Laboratory of Electronics (RLE) and a member of the Electrical Engineering and Computer Science Department (EECS) at the Massachusetts Institute of Technology. He received his Bachelor of Science in Electrical Engineering from Tufts University in 1996. He then joined Draper Laboratory as a Member of Technical Staff in their Fiber Optics Group. In 1999 he became a Draper Fellow and received his SM and PhD degrees from MIT in 2001 and 2005, respectively. In 2005 he joined Sandia National Labs where he led their silicon photonics effort as a Principal Member of Technical Staff. In 2010 he returned to MIT as an Associate Professor. Professor Watts' research focuses on photonic microsystems for low-power communications, sensing, and microwave-photonics applications. His current interests include the modeling, fabrication, and testing of large-scale implementations of microphotonic circuits, systems, and networks that are being integrated, directly or through hybrid techniques, with CMOS electronics for high-speed transmitting, switching, and routing applications of digital signals. Additional interests include large-scale microphotonic sensing and imaging arrays, along with optical phased arrays, nanophotonic antennas, nonlinear optics, and manipulations of optical-electromagnetic fields on-chip. Previous Current Group Members: Previous Alumni: Anna Baldycheva Postdoctoral Associate Sasha Biberman Postdoctoral Associate Jonathan Bradley Research Scientist Matthew Byrd Graduate Student Matteo Cherchi Postdoctoral Associate David Cole Graduate Student Brad Cordova Graduate Student Ehsan Shah Hosseini Research Scientist Harneet Singh Khurana Graduate Student Nanxi Li Graduate Student E. Salih Magden Graduate Student Michele Moresco Postdoctoral Associate Ben Moss Postdoctoral Associate Jelena Notaros Graduate Student Homepage Milica Notaros Graduate Student Christopher Poulton Graduate Student Purnawirman Graduate Student Manan Raval Graduate Student Alfonso Ruocco Postdoctoral Associate Katia Shtyrkova Graduate Student Gurpreet Singh Postdoctoral Associate Neetesh Singh Postdoctoral Associate Cheryl Sorace Graduate Student Zhan Su Graduate Student Jie Sun Postdoctoral Associate Erman Timurdogan Graduate Student Diedrik Vermeulen Research Scientist Tsui-Wei (Lily) Weng Graduate Student Ami Yaacobi Graduate Student Jerry Zhou Graduate Student Previous Home News Research Publications People Contact Publications – MIT Copyright © Massachusetts Institute of Technology",
  "content_length": 2907,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:23"
}