{
  "name": "Michael J. Rosulek",
  "homepage": "http://eecs.oregonstate.edu/~rosulekm",
  "status": "success",
  "content": "Mike Rosulek ☰ Mike Rosulek Professor, School of EECS Oregon State University Research Joy of Cryptography Students Publications MPC Resources Miscellany 2023 Kelley Engineering Center rosulekm@eecs.oregonstate.edu Mike Rosulek Professor, School of EECS Oregon State University I am a computer scientist interested in cryptography, and the only faculty member at Oregon State University whose name contains the substring “OSU”. All other boring achievements are listed in my CV. Research I am interested in cryptography generally, but most of my research is on secure multi-party computation (MPC), a technique for computing on private data. Using MPC, participants learn only the outcome of some agreed-upon computation and nothing else about the inputs. Under the broad umbrella of MPC, I have worked extensively on the following topics: Private set intersection is a special case of MPC, where the participants each hold a set of items and want to identify all common items, without revealing anything else. Garbled circuits are a fundamental technique for MPC of arbitrary functions. I’m interested in improvements to and applications of garbled circuits. The Joy of Cryptography I am author of The Joy of Cryptography, an undergraduate-level textbook introducing students to the fundamentals of provable security. The book will be published by MIT Press in January 2026, and will also be available in an open-access web edition. You can pre-order on Amazon (affiliate link) or check out the table of contents. An older version of the book is available online. Please don’t get too attached! This version will soon be deprecated, since the newer one will be better in every conceivable way. Students Current students: David Richardson (PhD, co-advised with Jiayu Xu) Alice Murphy (PhD) Junxin Liu (PhD) Aditya Damodhar Dhanapal (PhD, co-advised with Jiayu Xu) Alumni: Perry Hooker (MS 2012) → Oracle Zhangxiang Hu (MS 2015) → PhD U Oregon Morgan Shirley (MS 2017) → PhD Toronto Peter Rindal (PhD 2018) → Visa Research Brent Carmer (PhD 2018) → Galois Naimisha Saireddy (MS 2019) Tommy Hollenberg (MS 2019) Ni Trieu (PhD 2019) → Berkeley postdoc → Arizona State faculty Lawrence Roy (PhD 2022) → Aarhus postdoc Gayathri Garimella (PhD 2023) → Brown postdoc Jaspal Singh (PhD 2023) → Purdue postdoc Ian McQuoid (PhD 2023) → MIT Lincoln Labs Jake Januzelli (MS 2025JX) → Columbia PhD program Naman Kumar (MS 2025JX) → CNRS/IRIF PhD program Prospective students: My research group is at full capacity, so I am not seeking new grad students in the upcoming admissions cycle (i.e., for Fall 2026). Advice for new grad students (and their advisors). Publications Additional info can be found on my Google Scholar and DBLP pages. Lower Bounds for Garbled Circuits from Shannon-Type Information Inequalities Jake Januzelli, Mike Rosulek, Lawrence Roy Crypto 2025 docs folder_code How to Tolerate Typos in Strong Asymmetric PAKE Ian McQuoid, Mike Rosulek, Jiayu Xu Crypto 2025 docs Malicious Secure, Structure-Aware Private Set Intersection Gayathri Garimella, Mike Rosulek, Jaspal Singh Crypto 2023 docs Verifiable Distributed Aggregation Functions Hannah Davis, Christopher Patton, Mike Rosulek, Phillipp Schoppmann PETS 2023 docs How to Obfuscate MPC Inputs Ian McQuoid, Mike Rosulek, Jiayu Xu TCC 2022 docs Structure-Aware Private Set Intersection, with Applications to Fuzzy Matching Gayathri Garimella, Mike Rosulek, Jaspal Singh Crypto 2022 docs live_tv animated_images Finding One Common Item, Privately Tyler Beauregard, Janabel Xia, Mike Rosulek SCN 2022 docs Practical Privacy-Preserving Authentication for SSH Lawrence Roy, Stanislav Lyakhov, Yeongjin Jang, Mike Rosulek USENIX Security 2022 docs animated_images folder_code A Complete Characterization of Security for Linicrypt Block Cipher Modes Tommy Hollenberg, Mike Rosulek, Lawrence Roy CSF 2022 docs Batching Base Oblivious Transfers Ian McQuoid, Mike Rosulek, Lawrence Roy Asiacrypt 2021 docs Compact and Malicious Private Set Intersection for Small Sets Mike Rosulek, Ni Trieu CCS 2021 docs live_tv animated_images Three Halves Make a Whole? Beating the Half-Gates Lower Bound for Garbled Circuits trophy Mike Rosulek, Lawrence Roy Crypto 2021 docs Oblivious Key-Value Stores and Amplification for Private Set Intersection Gayathri Garimella, Benny Pinkas, Mike Rosulek, Ni Trieu, Avishay Yanai Crypto 2021 docs Private Set Operations from Oblivious Switching Gayathri Garimella, Payman Mohassel, Mike Rosulek, Saeed Sadeghian, Jaspal Singh PKC 2021 docs On the (Im)Practicality of Adversarial Perturbation for Image Privacy Arezoo Rajabi, Rakesh Bobba, Mike Rosulek, Charles V. Wright, Wu-Chi Feng PETS 2021 docs Minimal Symmetric PAKE and 1-out-of-N OT from Programmable-Once Public Functions Ian McQuoid, Mike Rosulek, Lawrence Roy CCS 2020 docs Fast Database Joins and PSI for Secret Shared Data Payman Mohassel, Peter Rindal, Mike Rosulek CCS 2020 docs Practical Privacy-Preserving K-means Clustering Payman Mohassel, Mike Rosulek, Ni Trieu PETS 2020 docs PSI from PaXoS: Fast, Malicious Private Set Intersection Benny Pinkas, Mike Rosulek, Ni Trieu, Avishay Yanai Eurocrypt 2020 docs live_tv animated_images Scalable Private Set Union from Symmetric-Key Techniques Vladimir Kolesnikov, Mike Rosulek, Ni Trieu, Xiao Wang Asiacrypt 2019 docs Characterizing Collision and Second-Preimage Resistance in Linicrypt Ian McQuoid, Trevor Swope, Mike Rosulek TCC 2019 docs Secure Data Exchange: A Marketplace in the Cloud Ran Gilad-Bachrach, Kim Laine, Kristin Lauter, Peter Rindal, Mike Rosulek CCSW 2019 docs SpOT-Light: Lightweight Private Set Intersection from Sparse OT Extension Benny Pinkas, Mike Rosulek, Ni Trieu, Avishay Yanai Crypto 2019 docs folder_code Cheaper Private Set Intersection via Differentially Private Leakage Adam Groce, Peter Rindal, Mike Rosulek PETS 2019 docs Balancing Image Privacy and Usability with Thumbnail-Preserving Encryption Kimia Tajik, Akshith Gunasekaran, Rhea Dutta, Brandon Ellis, Rakesh B. Bobba, Mike Rosulek, Charles V. Wright, Wu-Chi Feng NDSS 2019 docs On the Structure of Unconditional UC Hybrid Protocols Mike Rosulek, Morgan Shirley TCC 2018 docs TACHYON: Fast Signatures from Compact Knapsack Rouzbeh Behnia, Muslum Ozgur Ozmen, Attila A Yavuz, Mike Rosulek CCS 2018 docs Optimizing Authenticated Garbling for Faster Secure Two-Party Computation Jonathan Katz, Samuel Ranellucci, Mike Rosulek, Xiao Wang Crypto 2018 docs PIR-PSI: Scaling Private Contact Discovery Daniel Demmler, Peter Rindal, Mike Rosulek, Ni Trieu PETS 2018 docs SWiM: Secure Wildcard Pattern Matching From OT Extension Vladimir Kolesnikov, Mike Rosulek, Ni Trieu FC 2018 docs folder_code Improvements for Gate-Hiding Garbled Circuits Mike Rosulek Indocrypt 2017 docs animated_images Approximate Thumbnail Preserving Encryption Byron Marohn, Charles V Wright, Wu-chi Feng, Mike Rosulek, Rakesh Bobba MPS Workshop 2017 docs Malicious-Secure Private Set Intersection via Dual Execution Peter Rindal, Mike Rosulek CCS 2017 docs folder_code Practical Multi-party Private Set Intersection from Symmetric-Key Techniques Vladimir Kolesnikov, Naor Matania, Benny Pinkas, Mike Rosulek, Ni Trieu CCS 2017 docs folder_code DUPLO: Unifying Cut-and-Choose for Garbled Circuits Vladimir Kolesnikov, Jesper Buus Nielsen, Mike Rosulek, Ni Trieu, Roberto Trifiletti CCS 2017 docs folder_code Improved Private Set Intersection against Malicious Adversaries Peter Rindal, Mike Rosulek Eurocrypt 2017 docs folder_code Non-Interactive Secure 2PC in the Offline/Online and Batch Settings Payman Mohassel, Mike Rosulek Eurocrypt 2017 docs Sublinear Zero-Knowledge Arguments for RAM Programs Payman Mohassel, Mike Rosulek, Alessandra Scafuro Eurocrypt 2017 docs Reconciling Non-malleability with Homomorphic Encryption Manoj Prabhakaran, Mike Rosulek J. Cryptology 2017 docs Efficient Batched Oblivious PRF with Applications to Private Set Intersection Vladimir Kolesnikov, Ranjit Kumaresan, Mike Rosulek, Ni Trieu CCS 2016 docs folder_code Garbling Gadgets for Boolean and Arithmetic Circuits Marshall Ball, Tal Malkin, Mike Rosulek CCS 2016 docs animated_images Linicrypt: A Model for Practical Cryptography Brent Carmer, Mike Rosulek CRYPTO 2016 docs animated_images folder_code Faster Malicious 2-party Secure Computation with Online/Offline Dual Execution Peter Rindal, Mike Rosulek USENIX Security 2016 docs animated_images folder_code Fast and Secure Three-party Computation: The Garbled Circuit Approach Payman Mohassel, Mike Rosulek, Ye Zhang CCS 2015 docs Efficient Zero-Knowledge Proofs of Non-Algebraic Statements with Sublinear Amortized Cost Zhangxiang Hu, Payman Mohassel, Mike Rosulek CRYPTO 2015 docs Two Halves Make a Whole: Reducing Data Transfer in Garbled Circuits using Half Gates Samee Zahur, Mike Rosulek, David Evans Eurocrypt 2015 docs How to Efficiently Evaluate RAM Programs with Malicious Security Arash Afshar, Zhangxiang Hu, Payman Mohassel, Mike Rosulek Eurocrypt 2015 docs animated_images Vamonos: Embeddable Visualizations of Advanced Algorithms Brent Carmer, Mike Rosulek FIE 205 docs folder_code Richer Efficiency/Security Tradeoffs in 2PC Vladimir Kolesnikov, Payman Mohassel, Ben Riva, Mike Rosulek TCC 2015 docs animated_images FleXOR: Flexible garbling for XOR gates that beats free-XOR Vladimir Kolesnikov, Payman Mohassel, Mike Rosulek CRYPTO 2014 docs live_tv animated_images Multi-Party Computation for Polynomials and Branching Programs without Simultaneous Interaction Dov Gordon, Tal Malkin, Mike Rosulek, Hoeteck Wee Eurocrypt 2013 docs Characterizing the Cryptographic Properties of Reactive 2-Party Functionalities R. Amzi Jeffs, Mike Rosulek TCC 2013 docs A Unified Characterization of Completeness and Triviality for Secure Function Evaluation Hemanta Maji, Manoj Prabhakaran, Mike Rosulek Indocrypt 2012 docs Must you know the code of f to securely compute f? Mike Rosulek CRYPTO 2012 docs live_tv animated_images Universal Composability from Essentially Any Trusted Setup Mike Rosulek CRY",
  "content_length": 14527,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:23"
}