{
  "name": "Michael W. Totaro",
  "homepage": "http://www.ucs.louisiana.edu/~mwt3774",
  "status": "success",
  "content": "Homepage of Michael W. Totaro, Ph.D. Michael W. Totaro, Ph.D. Associate Professor Associate Director for Academic Affairs and Undergraduate Education Graduate Coordinator, Informatics Masters Program School of Computing and Informatics Ray P. Authement College of Sciences University of Louisiana at Lafayette Ph.D., Computer Science, May 2007 - University of Louisiana at Lafayette Master of Science, Telecommunications, December 1999 - University of Louisiana at Lafayette Master of Business Administration (MBA), December 1988 - University of Louisiana at Lafayette Bachelor of Science, Computer Science, December 1982 - University of Louisiana at Lafayette Office: James R. Oliver Hall, Room 203 Phone: (337) 482-5697 e-mail: miket@louisiana.edu Information is the resolution of uncertainty. -- Claude Shannon Homepage revised: 5 July 2017 My Curriculum Vita is available here. My doctoral dissertation is available here. My Teaching Philosophy is available here. Click here to visit the School of Computing and Informatics webpage. Click here to visit the Ray P. Authement College of Sciences webpage. Refereed Journal Publications: Computing and Network Systems Administration, Operations Research, and System Dynamics Modeling: A Proposed Research Framework by Michael W. Totaro Journal of Systemics, Cybernetics and Informatics (JSCI), Volume 14, Number 6, 2016, pp. 83 88. SSN: 1690-4524 (Online) http://www.iiisci.org/journal/sci/issue.asp?is=ISS1606 (Two-Tier: Traditional Double-Blind Review/Non-Blind Review; Acceptance rate: Best 20%-25% from Proceedings of IMCIC-2016) Business Students Performance in Undergraduate Business Statistics: Is There Really A Connection to Mathematical Skills? by John R. Tanner, Thomas C. Noser, Michael W. Totaro, and Thanh-Ngoc Pham. Journal of Business and Economic Perspectives (JBEP), Volume XLIII, Number 2, Fall/Winter 2016 (Listed in Cabells; Blind review; Acceptance rate: 25%) The Advanced Database Course and the IS 2010 Model Curriculum: An Experiential Approach to Learning, by Michael W. Totaro and Brandi N. Guidry. International Journal of Information and Operations Management Education (IJIOME), Volume 5, Number 2, 2013 (Listed in Cabells; Blind review; Acceptance rate: 11-20%) MIS Students and the Systems Analysis and Design Course Project: A Proposed Experiential Approach, by Brandi Guidry and Michael W. Totaro. International Journal of Innovation and Learning, Volume 13, Number 2, 2013 (Listed in Cabells; Blind review; Acceptance rate: 11-20%) The Systems Analysis and Design Course: An Educators Assessment of the Importance and Coverage of Topics by Brandi Guidry, David Stevens, and Michael Totaro. Journal of Information Systems Education, Volume 22, Number 4, Winter, 2012 (Listed in Cabells; Blind review; Acceptance rate: 20%) Business Simulation Games: Effective Teaching Tools or Window Dressing? by John R. Tanner, Geoffrey Stewart, Michael W. Totaro, and Melissa Hargrave. American Journal of Business Education, Volume 5, Number 2, March/April 2012 (Listed in Cabells; Blind review; Acceptance rate: 11-20%) MIS Students and the Systems Analysis and Design Course Project: A Proposed Experiential Approach, by Brandi Guidry and Michael Totaro. Accepted September 21, 2011 for publication in a forthcoming issue of: International Journal of Innovation and Learning (Listed in Cabells; Blind review; Acceptance rate: 11-20%). Status: Revise (minor) and Resubmit. High School Students Academic Performance and Internet Usage, by Wesley Austin and Michael W. Totaro, Journal of Economics and Economic Education Research, Volume 12, Number 1, 2011, pp. 41-54 (Listed in Cabells; Blind review; Acceptance rate: 21-30%) Convention Center Management: A Systems Analysis & Design Course Project (Teaching Case), by Brandi N. Guidry and Michael W. Totaro, Journal of Information Systems Education, Volume 22, Number 1, Spring, 2011, pp. 15-17 (Listed in Cabells; Blind review; Acceptance rate: 20%) Assessing IT Critical Skills and Revising the MIS Curriculum, by David Stevens, Michael Totaro, and Zhiwei Zhu, Journal of Computer Information Systems, Volume 51, Number 3, Spring 2011, pp. 85-95 (Listed in Cabells; Blind review; Acceptance Rate: 10-15%) Gender Differences in the Effects of Internet Usage on High School Absenteeism, by Wesley Austin and Michael Totaro, Journal of Socio-Economics, Volume 40, 2011, pp. 192-198 (Listed in Cabells; Blind review; Acceptance rate: 25%) The SOA Platform for Small and Medium Businesses: A Conceptual Framework, by Michael W. Totaro, Sonya H.Y. Hsu, and Zhiwei Zhu, International Journal of Business and Systems Research, Volume 5, Number 1 (January, 2011) (Listed in Cabells; Blind review; Acceptance Rate: 11  20%) \"Math Skills and Undergraduates' Performance in Business Statistics: A Relationship Analysis,\" by John Tanner, Michael W. Totaro, Thanh-Ngoc Pham, and Thomas Noser, International Journal of Education Research, Volume 4, Number 3, Fall 2009. (Listed in Cabells; Blind review; Acceptance Rate: 15%) \"Business School Administrators and Faculty Perceptions of Online Learning: A Comparative Study,\" by John R. Tanner, Thomas C. Noser, and Michael W. Totaro, Issues in Innovation, Volume 3, Issue 1, 2009, pp. 102-124. (Listed in Cabells; Blind review; Acceptance Rate: 21  30%) \"Business Faculty and Undergraduate Students Perceptions of Online Learning: A Comparative Study,\" by John R. Tanner, Thomas C. Noser, and Michael W. Totaro, Journal of Information Systems Education, Volume 20, Number 1, 2009 (Spring Issue). (Listed in Cabells; Blind review; Acceptance Rate: 21  30%) \"Business School Administrators Perceptions of Online Learning,\" by John R. Tanner, Thomas C. Noser, Michael W. Totaro, and Markashia Bruno, International Journal of Education Research, Volume 4, Number 1, 2009 (Winter). (Listed in Cabells; Blind review; Acceptance Rate: 15%) \"How Business Students Spend Their TimeDo They Really Know?\" by John R. Tanner, Geoffrey Stewart, Glenn Maples, and Michael W. Totaro, Research in Higher Education Journal, Volume 3, May 2009. (Listed in Cabells; Blind review; Acceptance Rate: less than 25%) \"MIS Faculty Perceptions of IT Certifications,\" by John Tanner, Michael W. Totaro, and Patricia A. Lanier, Business Research Yearbook: Global Business Perspectives, Volume XVI 2009, Number 1. (Listed in Cabells; Blind review; Acceptance Rate: 40%) \"Student Perceptions of the Online Classroom: An Update,\" by John R. Tanner, Thomas C. Noser, Michael W. Totaro, and Rachelle Birch, International Business & Economics Research Journal, Volume 5, Number 10 (October 2006). (Listed in Cabells; Blind Review; Acceptance Rate: 11  20%) \"Faculty Perceptions of Distance Education Courses: A Survey,\" by Michael W. Totaro, John R. Tanner, Thomas Noser, Jeanne Fuselier Fitzgerald, and Rachelle Birch, Journal of College Teaching & Learning, Volume 2, Number 7 (July 2005). (Listed in Cabells; Blind Review; Acceptance Rate: 11  20%) \"Factors Associated With Faculty Perceptions of MIS and IT Journal Quality,\" by Daniel G. Hotard, John Tanner, Stanley J. Smits, and Michael W. Totaro, Journal of Business and Economic Perspectives, Volume XXX, Number 2, Fall/Winter 2004. (Listed in Cabells; Blind Review; Acceptance Rate: 21  30%) \"Differing Faculty Perceptions of Research and Teaching Emphasis,\" by Dan Hotard, John Tanner, and Michael W. Totaro, Educational Research Quarterly, Volume 27, No. 4, June 2004. \"The Online Classroom: Differences in Perception Between Business Students and Non-Business Students,\" by John Tanner, Thomas Noser, Jeanne Fuselier, and Michael W. Totaro, Journal of College Teaching & Learning, Volume 1, Number 3 (March 2004). (Listed in Cabells; Blind Review; Acceptance Rate: 11  20%) \"The Online Classroom: What Do Students Think?\" by John R. Tanner, Thomas Noser, Jeanne Fuselier, and Michael W. Totaro, Journal of Informatics Education Research, Volume 6, Number 1 (Spring 2004). (Listed in Cabells; Blind review; Acceptance rate: 25%) \"Effects of Information Technology on the Business World,\" by Ihssan Alkadi, Ghassan Alkadi, and Michael W. Totaro, Human Systems Management, Volume 22, Number 3 (2003). (Listed in Cabells; Editorial review; Acceptance rate: 21-30%)) \"CPAs and Electronic Survey Media,\" by Marc A. Giullian, Marcus D. Odom, and Michael W. Totaro, The Review of Business Information Systems, Volume 7, Number 1 (Winter 2003). (Listed in Cabells; Blind Review; Acceptance Rate: 11  20%) \"Developing Essential Skills For Success In The Business World: A Look At Forecasting,\" by Marc A. Giullian, Marcus D. Odom, and Michael W. Totaro., The Journal of Applied Business Research, Volume 16, Number 3, Summer 2000. (Listed in Cabells; Blind Review; Acceptance Rate: 6  10%) \"Accounting Students' Preparation and Skills: A Faculty Perspective,\" by John R. Tanner, Michael W. Totaro, and Thomas E. Wilson, Jr., Journal of Accounting and Finance Theory, Volume 7, Number 2, Fall 1999. \"Research Productivity and Teaching Effectiveness: MIS Faculty,\" by John Tanner , Michael Totaro, and Dan Hotard, The Journal of Computer Information Systems, Volume XXXIX, Number 4, Summer 1999. (Listed in Cabells; Blind review; Acceptance rate: 10-15%) \"Faculty Perspectives of Accounting Students: How Have They Changed Over the Past Decade?,\" by John R. Tanner, Michael W. Totaro, and Thomas E. Wilson, Jr., The Journal of Accounting and Finance Research, Volume 7, Number 1, Summer 1999. \"New Technology in Survey Research: Does It Improve Response Rates?\" by Marcus D. Odom, Marc Guillian, and Mike Totaro, The Review of Accounting Information Systems, Volume 3, Number 1, Winter 1998/1999. \"Accounting Educators' Perceptions of Accounting Students' Preparation and Skills: A 10-Year Update,\" by John R. Tanner, Michael W. Totaro, and Thomas E. Wilson, Jr., The Journal of Education for Business, Volume 74, Number 1, September/October 1998. (Blind review) \"Inf",
  "content_length": 20489,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:04"
}