{
  "name": "Michael W. Godfrey",
  "homepage": "http://plg.uwaterloo.ca/~migod",
  "status": "success",
  "content": "Michael W. Godfrey @ UWaterloo Michael W. Godfrey @ UWaterloo [Contact information is at the bottom of the page.] Awards and honours Senior Member of the ACM and IEEE David R. Cheriton Faculty Fellow, Univ. of Waterloo, 2014-2017 NSERC Assoc. Industrial Research Chair (Nortel Networks), 2001-2006 Best/Distinguished Paper Awards: WCRE 2006, WCRE 2011, WCRE 2013 Most Influential Paper Award: SANER 2016 (for the WCRE 2006 paper) Distinguished Reviewer Awards: ICSME 2019, 2020 Research Teaching Papers and a few talks SWAG: Our research group I am also a member of the SE and PLG research groups, but those websites are painfully out-of date Graduate supervision My little UML page Kent Beck's advice on paper writing My Google Scholar page CS846  Topics in Software Evolution and Empirical Studies I am teaching this course in Fall 2025 See this video for an overview of what to expect CS138  Introduction to Data Abstraction and Implementation I am teaching this course in Winter 2026 Course designer/co-ordinator since 2009 CS246  Software Abstraction and Specification I last taught this course in Fall 2024 Course co-ordinator 2000-2004 CS445  Software Requirements and Specification (aka SE463 / CS645 / ECE451) I last taught this course in Fall 2010 JDuck (old but it was fun) Upcoming conferences etc. I'm on the Program Committee for (or have some other interesting role) Conferences I was on the Program Committee for, but are now over I'm on the program committee of ICSME 2024 Doctoral Symposium I'm General Chair for the 33rd IEEE Intl. Conf. on Program Comprehension (ICPC 2025), to be held in April 2025 in Ottawa. I sit / have sat / did sit on the following steering committees: IEEE Intl. Conference on Program Comprehension (ICPC) 2007-2010, 2017-2020 (SC chair 2017-2019) IEEE Intl. Conference on Software Maintenance and Evolution (ICSME) 20122015 IEEE Intl. Working Conference on Mining Software Repositories (MSR) 2009-2015 IEEE Intl. Working Conference on Source Code Analysis and Manipulation (SCAM) 20072010 Intl. Workshop on Software Analytics (SWAN), 2014?? Seminar Series on Advanced Techniques & Tools for Software Evolution (SATToSE) 20122017 ICSE: 2021 (posters), 2020 (tutorials), 2019 (main track), 2015, 2013, 2010 (NIER track), 2001 (OC) ICSME (formerly ICSM): 2021, 2019 (also J1C2 track co-chair), 2017, 2015, 2014, 2013, 2011 (also DC, again), 2010 (also TC), 2008, 2007, 2006 (also DC) ICPC: 2023, 2021, 2017, 2016, 2015, 2012 (PC), 2010, 2009, 2008, 2007, 2006, 2005, 2004, 2003, 2002 MSR: 2020, 2019, 2016, 2015, 2013, 2012, 2011, 2010, 2009 (PC), 2008 (PC), 2007, 2006 SCAM: 2017, 2015 (GC), 2014, 2010, 2009, 2008, 2007 (PC), 2006, 2005, 2004, 2003, 2002, 2001 SANER (formerly CSMR): 2018, 2017, 2016 (DC), 2015, 2008, 2005, 2004 WCRE (merged with SANER in 2015): 2010, 2009, 2008, 2007, 2006, 2005, 2004, 2003, 2002 IWSC: 2018, 2017 (PC), 2016, 2014, 2012, 2011, 2010, 2009 VoSE: 2019 ateM (now called SLE): 2007, 2006, 2004 (CO), 2003 (CO) IWPSE: 2015, 2009, 2007, 2005, 2004, 2003 (PC), 2002 CASCON: 2009, 2008, 2006 ECASE: 2019, 2017 ITSLE track at OOPSLA: 2016 EOSESE: 2015 DAPSE: 2013 RelEng: 2013 MODELS educators' symposium: 2011 RSSE: 2010, 2008 QTAP: 2008 (CO) LATE: 2008, 2007 ETX: 2007 Evol: 2008, 2007 FLOSS: 2007 SEAMS: 2007 ASE: 2006 ELISA: 2003 (CO) CoSET: 2000 PC = Program co-chair, GC = General chair, CO = Co-organizer, OC = Org. committe, TC = Tutorials chair, DC = PhD dissertation/symposium co-chair Service and external relations Trivia As of September 2025, I am Director of Undergraduate Studies in the School of Computer Science; among other duties, I chair UAPC (see below) I have chaired the CS Undergraduate Recruiting Committee (UGREC) on and off (currently, \"off\"), starting in 2016 From July 2013 to July 2015, I was the SCS Director of Student Engagement Between 2006 and 2011 I served on the SCS Undergraduate Academic Plans Committee (UAPC, formerly known as the Curriculum Committee) I have served on the Software Engineering Curriculum Committee 2009-11, 2012-13, 2022-23 My Erdos number is no worse than 3 (Gauss is a 4) Erdos → Jeff Shallit → Andrew Malton → Me Anagrams of \"Michael Godfrey\": Feel my dog chair! [thx MCB] Fierce, godly ham Chiefly, mad ogre Hey! decimal frog Grey, modal chief The past During the 2011-12 academic year, I was on sabbatical at CWI in Amsterdam, with the RASCAL group (aka SEN-1, aka SWAT), led by Jurgen Vinju and Paul Klint. I learned a lot about programming, practical language design, DSLs, and the sheer joy of building something that works. I really enjoyed my time there, and the great people I got to work with, including Mark Hills, Davy Landman, Atze van der Ploeg, Tijs van der Storm, Jeroen van den Bos, Anastasia Izmaylova, and Vadim Zaytsev. During the 2003-04 academic year, I was on sabbatical at Sun Microsystems Research Lab in Mountain View, CA. I worked on two research projects involving static analysis tools, Jackpot and Salsa, and I got to work with a number of really sharp tool developers, including Michael Van De Vanter, Tom Ball, Tim Prinzing, and James Gosling (all Jackpot), as well as John Crupi, Deepak Alur, Yury Kamen, and Syed Ali (all Salsa). I was a faculty member at Cornell University between 1996 and 1998; I taught the software engineering course and some others, and I was the associate director of their M.Eng. program. I also did some work with the Predator / Jaguar object-relational database project, which led to a paper at SIGMOD-98. Before that, I was a graduate student and occasional full-time lecturer at the University of Toronto. Michael W. Godfrey PhD, Professor David R. Cheriton School of Computer Science, University of Waterloo Waterloo, Ontario, N2L 3G1, CANADA Office: DC2340 email: Twitter: @migod, Mastodon: @migod@mstdn.ca URL: http://plg.uwaterloo.ca/~migod",
  "content_length": 5847,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:02"
}