{
  "name": "Michael Everett",
  "homepage": "https://www.khoury.northeastern.edu/people/michael-everett",
  "status": "success",
  "content": "Michael Everett - Khoury College of Computer Sciences All People Michael Everett Assistant Professor, Jointly Appointed with College of Engineering Research interests Research interests Robotics Motion planning Reinforcement learning Neural network verification Control theory Education Education PhD in Mechanical Engineering, Massachusetts Institute of Technology MS in Mechanical Engineering, Massachusetts Institute of Technology BS in Mechanical Engineering, Massachusetts Institute of Technology Biography Biography Michael Everett is an assistant professor in the Khoury College of Computer Sciences and the College of Engineering at Northeastern University, based in Boston. Everett focuses on the intersection of robotics, deep learning, and control theory, with the aim of developing certifiable learning machines in which robots can safely, reliably, and efficiently perform tasks. Some specific techniques of interest are reinforcement learning, model predictive control, and navigation in challenging environments. Everett works as a visiting faculty researcher with Google’s People + AI Research team. Previously, he was a research scientist and postdoctoral associate at the MIT Department of Aeronautics and Astronautics. Outside of the lab, Everett enjoys scuba diving and playing frisbee with his dog, Holly. Recent publications Recent publications Published: September 2, 2025 LiDAR Inertial Odometry and Mapping Using Learned Registration-Relevant Features Citation: Zihao Dong, Jeff Pflueger, Leonard Jung, David Thorne, Philip R. Osteen, Christa S. Robison, Brett Thomas Lopez, Michael Everett. (2025). LiDAR Inertial Odometry and Mapping Using Learned Registration-Relevant Features ICRA, 359-366. https://doi.org/10.1109/ICRA55743.2025.11127666 Published: December 6, 2021 Reachability analysis of neural feedback loops Citation: M. Everett, G. Habibi, C. Sun and J. P. How. \"Reachability Analysis of Neural Feedback Loops.\" In IEEE Access, vol. 9, pp. 163938-163953, 2021. DOI: 10.1109/ACCESS.2021.3133370. Published: January 8, 2021 Collision avoidance in pedestrian-rich environments with deep reinforcement learning Citation: M. Everett, Y. F. Chen and J. P. How. \"Collision Avoidance in Pedestrian-Rich Environments With Deep Reinforcement Learning.\" In IEEE Access, vol. 9, pp. 10357-10377, 2021. DOI: 10.1109/ACCESS.2021.3050338. Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://mfe7.github.io/ Google Scholar See Citations Area of Interest Robotics Contact m.everett@northeastern.edu Related news NGN: Robotaxis in Boston? Waymo’s test run impresses Northeastern autonomous driving expert May 29, 2025 NGN: Northeastern robotics researchers develop algorithms that make mobile robot navigation more efficient May 1, 2025 NGN: Will robotaxis ever go mainstream? Self-driving companies have made advancements, but technology is still lacking, expert says May 16, 2024 Explore all news Current PhD students Zihao Dong PhD Student Read bio Locations Close this dialog window Boston Alexander Estornell PhD Student Read bio Locations Close this dialog window Boston Jeffrey Pflueger PhD Student Read bio Locations Close this dialog window Boston Alenna Spiro Phd Student Read bio Locations Close this dialog window Boston Hanna Zhang PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 3352,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:56"
}