{
  "name": "Michele Coscia",
  "homepage": "https://pure.itu.dk/portal/da/persons/michele-coscia(90b501a9-4d44-460b-b193-4d7d524bb21b).html",
  "status": "success",
  "content": "Michele Coscia - IT-Universitetet i København Michele Coscia Lektor, Data ScienceNEtwoRks, Data, and Society Co-Uddannelsesleder, Kandidat i Data Science https://orcid.org/0000-0001-5984-5137 E-mailmcositudk 20182025 Publikationer pr. år Personlig profil EmneordNetwork AnalysisSocial NetworksData MiningHuman MobilityComplex SystemsEconomic DevelopmentMemetics Fingeraftryk Dyk ned i forskningsemnerne, hvor Michele Coscia er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 6 Lignende profiler Network Science Computer Science 100% Misinformation Computer Science 83% Complex Networks Computer Science 75% Euclidean Measure Keyphrases 66% Network Sampling Keyphrases 66% Distance Vector Computer Science 66% Online Social Media Keyphrases 61% Vector Distance Keyphrases 58% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Publikation Publikationer pr. år 2018 2018 2019 2020 2021 2022 2024 2025 2025 17 Tidsskriftartikel 5 Konferencebidrag i proceedings Publikationer pr. år Publikationer pr. år Estimating affective polarization on a social networkHohmann, M. & Coscia, M., 24 sep. 2025, I: PLOS ONE. 20Publikation: Artikel i tidsskrift og konference artikel i tidsskrift › Tidsskriftartikel › Forskning › peer review Åben adgangFil Social Distance 100% Affective Polarization 100% Distance Component 50% COVID-19 50% Defining Feature 50% “A Network of Mutualities of Being”: Socio-material Archaeological Networks and Biological Ties at ÇatalhöyükMazzucato, C., Coscia, M., Küçükakdağ Doğu, A., Haddow, S., Sıddık Kılıç, M., Yüncü, E. & Somel, M., 1 mar. 2025, I: Journal of Archaeological Method and Theory.Publikation: Artikel i tidsskrift og konference artikel i tidsskrift › Tidsskriftartikel › Forskning › peer review Fil Network Ties 100% Mutuality of Being 100% Archaeological Networks 100% Biological Ties 100% Mutuality 100% Node attribute analysis for cultural data analytics: a case study on Italian XX–XXI century musicCoscia, M., 5 sep. 2024, I: Applied Network Science.Publikation: Artikel i tidsskrift og konference artikel i tidsskrift › Tidsskriftartikel › Forskning › peer review Åben adgangFil Node Attributes 100% Attribute Analysis 100% Cultural Data 100% Cultural Expression 50% Consistent Patterns 20% Traces Of Unequal Entry Requirement For Illustrious People On Wikipedia Based On Their GenderKrivaa, L. & Coscia, M., 14 jun. 2024, I: Advances in Complex Systems. s. 1-17 17 s.Publikation: Artikel i tidsskrift og konference artikel i tidsskrift › Tidsskriftartikel › Forskning › peer review Åben adgangFil Paramount Importance 100% Natural Language Processing 100% Network Science 100% Multiple Language 100% Wikipedia 100% Which sport is becoming more predictable? A cross-discipline analysis of predictability in team sportsCoscia, M., 29 jan. 2024, I: EPJ Data Science. s. 1-20 20 s.Publikation: Artikel i tidsskrift og konference artikel i tidsskrift › Tidsskriftartikel › Forskning › peer review Åben adgang North America 100% Home Advantage 100% Outcome Predictability 100% Team Sports 100% Predictive Model 100% Se alle 22 publikationer Projekter Projekter pr. år 2021 2024 2034 5 Igangværende Projekter pr. år ROMNET: Past social network reconstruction from material culture dataCoscia, M. (PI) & Salamanos, N. (Samarbejdspartner)Villum Fonden11/03/2024 → 31/12/2026Projekter: Projekt › Forskning Network Reconstruction 100% Material Culture 100% Social Networks 100% Social Network 100% Network Data 19% Work2VecCoscia, M. (PI)Det National Forskningscenter for Arbejdsmiljø (NFA)01/11/2024 → 31/10/2027Projekter: Projekt › Forskning Deep Learning 100% Health Care Costs 100% Working Hours 100% Samfinansieret ph.d. PolitietCoscia, M. (PI)National Enhed for Særlig Kriminalitet15/08/2024 → 14/08/2028Projekter: Projekt › Forskning P1: Pioneer Centre for Artificial IntelligenceSestoft, P. (PI), Plank, B. (CoI), Hansen, D. W. (CoI), Larsen, A. W. (CoI), Bogers, T. (CoI), Madsen, I. J. W. (CoI), Dixen, L. (CoI), Trinhammer, M. L. (CoI), Iarygina, O. (CoI), Grasshof, S. (CoI), Mottelson, A. (CoI), Burelli, P. (CoI), Risi, S. (CoI), Rogers, A. (CoI), Goot, R. V. D. (CoI), Coscia, M. (CoI), Hardmeier, C. (CoI), Heinrich, S. (Samarbejdspartner) & Güven, A. B. (Samarbejdspartner)Danish National Research Foundation01/07/2021 → 30/06/2034Projekter: Projekt › Forskning Pre-registered Replication 100% Registered Report 100% Body Attitude 100% Body Perception 100% Experimental Psychology 100% FRAME : Femicide Risk Assessment and Mitigation through Evidence Coscia, M. (PI)Center for Voldsforebyggelse01/09/2025 → 31/08/2028Projekter: Projekt › Forskning Femicide 100% Risk Assessment 100% Risk Mitigation 100% Risk Identification 33% High-risk Cases 33% Presse/medier When knowledge flows both ways: Focus on data visualisationCoscia, M.22/11/20211 MediebidragPresse/medie Fake news: Serveres der virkelig menneskekød på en restaurant i London?Coscia, M.22/07/20201 MediebidragPresse/medie Forsvaret mod fake news er ikke effektivt nokCoscia, M.21/07/20201 MediebidragPresse/medie Forskningsdatasæt Italian XX-XXI Century MusicCoscia, M. (Ophavsmand), ZENODO, 13 aug. 2024DOI: 10.5281/zenodo.13309793, https://zenodo.org/records/13309793Datasæt Danish and Italian Band-Artist NetworksCoscia, M. (Ophavsmand), Lisandro Marco, B. (Bidrager) & Daniel, F.-Q. (Bidrager), ZENODO, 14 aug. 2025DOI: 10.5281/zenodo.16870758Datasæt Priser Årets Forskningsmiljø 2022Szell, M. (Modtager), Sinatra, R. (Modtager), Aiello, L. M. (Modtager), Coscia, M. (Modtager), Rossi, L. (Modtager), Sekara, V. (Modtager), Cunha, T. O. (Modtager), Kostic, B. (Modtager), Sousa, S. (Modtager), Vierø, A. R. (Modtager), Vybornova, A. (Modtager), Xing, Y. (Modtager) & Zappalà, C. (Modtager), 1 jun. 2022Pris: Priser, stipendier, udnævnelser Spar 100%",
  "content_length": 6126,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:20"
}