{
  "name": "Michael Schatz",
  "homepage": "https://www.cs.jhu.edu/faculty/michael-schatz",
  "status": "success",
  "content": "Michael Schatz - Department of Computer Science Contact 703-966-1987 mschatz@jhu.edu Location 323 Malone Hall Connect Google Scholar Twitter Website Research Areas Computational biology Genomics DNA sequencing & analysis Scalable computing Michael Schatz, the Bloomberg Distinguished Professor of Computational Biology and Oncology at the Johns Hopkins University, is among the world’s foremost experts in solving computational problems in genomics research. His innovative biotechnologies and computational tools for studying the sequence and function of genomes are advancing our understanding of the structure, evolution, and function of genomes in medicine—particularly for autism spectrum disorders, cancer, and other human diseases—and agriculture. Schatz, who founded and directs the Schatz Lab, has created many of the most widely used methods and software for assembling the full genetic material for a single person or a species, including: NGMLR and Sniffles, long-read sequencing analysis methods to study longer fragments of DNA that may yield critical information about how cancer genomes evolve. Genomes in malignant tumors often house sections of chromosomes that are deleted, duplicated, or fused together; by examining an unstable genome, Schatz identified almost 20,000 structural alterations—changes previously missed by other researchers when examining shorter DNA fragments. Scalpel, the leading genetic variants discovery tool, which identifies and analyzes mutations in autism spectrum disorders and somatic mutations (or DNA alterations that occur post-conception) in cancer genomes, including pancreatic cancers. Genomic Enrichment Computational Clustering Operation (GECCO), a novel algorithm to study complex non-coding and structural variations in genomes. Using GECCO, the Schatz Lab identified recurrent non-coding somatic mutations of pancreatic cancer, including some that substantially changed survival outcomes. Ginkgo, a computational tool for single-cell copy number profiling in heterogeneous tumors to study the progression of primary and metastatic breast tumors and adult acute myeloid leukemia. FALCON and Assemblytics, new computational methods for assembling and analyzing the genomes of different species—especially plant and animal species—using single molecule-sequencing to study their evolution and adaption. CloudBurst and Crossbow, the first published algorithms to use cloud computing technologies in genomics for mapping and variant discovery. In addition to his faculty appointments in the Department of Computer Science at the Whiting School of Engineering and in the Department of Biology at the Krieger School of Arts and Sciences, Schatz serves as a member of the Cancer Prevention and Control Program at Johns Hopkins’ Sidney Kimmel Comprehensive Cancer Center. His recent awards include the 2015 Alfred P. Sloan Foundation Fellowship for Computational and Evolutionary Molecular Biology and an NSF CAREER Award in 2014. Schatz’s earlier honors include being named Genome Technology’s Young Investigator of the Year in 2010 and the twice-awarded Winship Herr Award for Excellence in Teaching from the Watson School for Biological Science. His leadership in the computational biology field includes founding a new, interdisciplinary Cold Spring Harbor Laboratory (CSHL) conference on biological data science in 2012, as well as regularly serving on the program committees of venues such as CSHL’s Genome Informatics conference, Research in Computational Molecular Biology, the International Society for Computational Biology, the Workshop on Algorithms in Bioinformatics, and several other top conferences. Schatz serves on the editorial boards of Genome Biology, GigaScience, and Cell Systems, and has served as a reviewer for Nature, Cell, Science, Nature Biotechnology, Nature Methods, Genome Research, Genome Medicine, and Bioinformatics. His innovative discoveries have been featured in The New York Times, The Washington Post, and Wired. Schatz holds a BS in computer science from Carnegie Mellon University (2000) and an MS (2008) and PhD (2010), both in computer science, from the University of Maryland, College Park. Prior to joining the Johns Hopkins University in 2016, Schatz spent six years at the CSHL, where he co-led the Cancer Genetics and Genomics Program in the CSHL Cancer Center. He remains a CSHL adjunct associate professor of quantitative biology. Related News View All News Putting our pieces together Categories Department News Research For more than half a century, Johns Hopkins has been a leader in converting federal support into tangible benefits for the American people—such as correcting maps of the human genome. Johns Hopkins researchers to present at Genome Informatics 2025 Categories Department News Students from the Department of Computer Science will give talks and present posters on their research in genome informatics. Researchers build a smarter tool for reading genetic code Categories Research The Hopkins team’s new, open-source software dramatically improves scientists’ ability to detect genetic modifications that control gene activity. Site Menu Close ﻿",
  "content_length": 5165,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:54"
}