{
  "name": "Michalis Faloutsos",
  "homepage": "http://www.cs.ucr.edu/~michalis",
  "status": "success",
  "content": "Michalis Faloutsos home page The Homepage of Michalis Faloutsos (In case the world turns upside down) Contact Information Professor Engineering Building II, Rm 337 Member of the Networks and Communications Lab Computer Science Department University of California, Riverside. Riverside, California, 92521, USA Office: (951) 827-2480 Fax: (951) 827-4643 E-mail:  my first name all lowercase @cs.ucr.edu The Rest of My Web-Site Interests Resume: Extended resume , one short bio, and a research statement (pdf) Paperwork (Electronic copies of many of my publications for uptodate information check out DBLP or GoogleScholar) Projects and Grants Not uptodate: for more accurate information see my CV above. Teaching and stuff: Courses, our new Graduate Program, etc. Interesting and Miscellaneous Links Fun pictures Other Faloutsos on the web The Teach-To-Learn Initiative: Volunteer to teach and make a difference. Some of my talks. Technical Writing, Presentations and Graduate Resources. Useful suggestions and pointers. \"You must be joking...\": the column at ACM SIGCOMM CCR (some columns downloaded as many as 35,000 times!) It has been a blast, although, for every column, I fear it will be my last. I have not been able to contribute to the column since 2009, due to the startup. News and exciting stuff A new endeavor: I am thrilled to be a co-founder of programize.com. An old friend and I created this Research and Development software company focusing on sophisticated software solutions and upscale outsourcing services. We are working with venture backed startups in Sillicon Valley, Israel and Europe, with large companies like Deloitte, Sunpower, Palo Alto Networks and Eurobank, and research institutions like UCLA Medical School and NYU Stern. We also work and partner with young startups. To the fellow entrepreneurs: My friend Christos Kritikos is an excellent startup coach with vast knowledge in startup coaching and funding for early-stage startups. Check out his website for many excellent free resources. In 2008, UCR PhD Anirban Banerjee and I founded a web-security startup: www.stopthehacker.com: it was a wild ride with a fortunate conclusion (acquired by Cloudflare). Check out our news, press releases, successes and interesting things",
  "content_length": 2260,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:10"
}