{
  "name": "Michel Chaudron",
  "homepage": "https://research.tue.nl/en/persons/michel-rv-chaudron",
  "status": "success",
  "content": "Michel R.V. Chaudron - Research portal Eindhoven University of Technology Michel R.V. Chaudron public CV View Scopus Profile Michel R.V. Chaudron prof.dr. Full Professor, Mathematics and Computer Science, Engineering of Software-Intensive SystemsFull Professor, EAISI FoundationalFull Professor, EAISI High Tech Systems https://orcid.org/0000-0001-7517-6666 Emailm.r.v.chaudrontuenl 1281 Citations - based on content available in repository [source: Scopus] 1999 …2025 Content available in repository Personal profile Research profileMichel Chaudron is Full Professor and Chair of the Software Engineering group at the TU Eindhoven which is part of the Department of Mathematics and Computer Science Prior to this, he worked at Universities in Gothenburg (Chalmers|GU), Leiden and Eindhoven in the Netherlands. He obtained his Ph.D. in the area of formal methods and programming calculi for parallel computing. His research interests are in software architecture, software design, software modeling with a special focus on UML, software composition and knowledge sharing. Recently, use of AI (Artificial Intelligence) for Software Development. He has an interest in empirical studies in software engineering esp in the aforementioned areas and preferably in industrial contexts. He supports several conferences and journals including (Conf:) ICSE, MODELS and Euromicro SEAA, FAMECSE and (Jnl:) SoSyM and Empirical Studies in Software Engineering (EMSE).He has given tutorials and guest lectures on Software Architecture Design and Modeling as well as on Empirical Software Engineering Research Methods as guest lecturer in (o.a.) Spain, Tunesia, France, Finland, Slovakia and The Netherlands. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsAdjoint Professor, Bandung Institute of Technology1 Jan 2021 → …Chalmers University of Technology… → 31 Aug 2022 Fingerprint Dive into the research topics where Michel R.V. Chaudron is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Software Systems Computer Science 100% Software Design Computer Science 93% Software Development Computer Science 60% Machine Learning Computer Science 47% Software Engineering Computer Science 47% Case Study Computer Science 29% Open Source Project Computer Science 27% Maintainability Computer Science 27% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2005 2005 2021 2027 1 Finished 1 Active Projects per year Conformance Managment of Architecture and Implementation of Complex softwareChaudron, M. R. V. (Project Manager), Zamfirov, F. (Project member) & Wijekoon Bandara Mudiyanselage, S. (Project member)1/01/21 → 31/08/27Project: Third tier \"Trust4All\"Lukkien, J. J. (Project member), Verhoeven, P. H. F. M. (Project member), Bondarau, Y. (Project member) & Chaudron, M. R. V. (Project Manager)1/07/05 → 1/10/07Project: Research direct Research output Content available in repository 1999 2004 2005 2006 2007 2025 90 Conference contribution 21 Article 10 Report 4 Chapter 12 More 3 Book editing 2 Foreword/editorial 2 Other 1 Inaugural/farewell speech 1 Abstract 1 Poster 1 Software 1 Preprint Content available in repository Content available in repository From Expert to Novice: An Empirical Study on Software Architecture ExplanationsRukmono, S. A., Zamfirov, F., Ochoa, L. & Chaudron, M., 11 Mar 2025, arXiv.org, 22 p.Research output: Working paper › Preprint › Professional Open AccessFile Software Architecture 100% Software Development 25% Knowledge Transfer 25% Architectural Concern 25% Surrounding Context 25% 25 Downloads (Pure) Towards Low-code Architecture and Development of Embedded SystemsXavier, F., Cleophas, L. G. W. A. & Chaudron, M. R. V., 30 May 2025, 2025 IEEE 22nd International Conference on Software Architecture Companion, ICSA-C 2025. Institute of Electrical and Electronics Engineers, p. 358-363 6 p. 11015058Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile Embedded System 100% Reference Architecture 33% Embedded Software 33% Software Development 33% Formal Verification 33% Arvisan: an Interactive Tool for Visualisation and Analysis of Low-Code Architecture LandscapesKakkenberg, R., Rukmono, S. A., Chaudron, M. R. V., Gerholt, W., Pinto, M. & de Oliveira, C. R., 31 Oct 2024, MODELS Companion '24: Proceedings of the ACM/IEEE 27th International Conference on Model Driven Engineering Languages and Systems. New York: Association for Computing Machinery, Inc., p. 848-855 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile Dependency Cycle 100% Architectural Rule 100% 2 Citations (Scopus) 41 Downloads (Pure) Collaborative software design and modeling in virtual realityStancek, M., Polasek, I. (Corresponding author), Zalabai, T., Vincur, J., Jolak, R. & Chaudron, M., Feb 2024, In: Information and Software Technology. 166, 17 p., 107369.Research output: Contribution to journal › Article › Academic › peer-review Open AccessFile Software Design 100% Virtual Reality 100% Groupware 100% Design Information 18% Keyboard 9% 6 Citations (Scopus) 33 Downloads (Pure) Deductive Software Architecture Recovery via Chain-of-thought PromptingRukmono, S., Ochoa Venegas, L. & Chaudron, M. R. V., 24 May 2024, ICSE-NIER'24: Proceedings of the 2024 ACM/IEEE 44th International Conference on Software Engineering: New Ideas and Emerging Results. Association for Computing Machinery, Inc., p. 92-96 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile Architecture Definition 100% 9 Citations (Scopus) 358 Downloads (Pure) View all 137 research outputs Datasets Lindholmen Dataset of UML ModelsChaudron, M. R. V. (Creator), Hebig, R. (Creator), Robles, G. (Creator) & Ho-Quang, T. (Creator), Personal, 2017http://models-db.comDataset Replication Package for \"Evaluating the layout quality of UML class diagrams using machine learning\"Chaudron, M. R. V. (Creator), Rukmono, S. A. (Creator), Bergström, G. (Creator), Hujainah, F. (Creator), Ho-Quang, T. (Creator) & Jolak, R. (Creator), Zenodo, 15 Jun 2022DOI: 10.5281/zenodo.6645685Dataset Anonymized dataset of an OutSystems application landscape to be used in ArvisanKakkenberg, R. (Contributor), Rukmono, S. A. (Contributor) & Chaudron, M. R. V. (Contributor), Zenodo, 4 Jul 2024DOI: 10.5281/zenodo.12645566, https://zenodo.org/records/12645566Dataset UML class diagrams for layout quality checkingChaudron, M. R. V. (Contributor), Bergström, G. (Contributor), Hujainah, F. (Contributor), Ho-Quang, T. (Contributor) & Jolak, R. (Contributor), Zenodo, 14 Jul 2021DOI: 10.5281/zenodo.5037744, https://zenodo.org/record/5037744Dataset Code for the paper \"Collaborative software design and modeling in virtual reality\"Stancek, M. (Contributor), Polásek, I. (Contributor), Zalabai, T. (Contributor), Vincur, J. (Contributor), Jolak, R. (Contributor) & Chaudron, M. (Contributor), Zenodo, 20 Nov 2023DOI: 10.5281/zenodo.10706815, https://zenodo.org/records/10706815Dataset View all 7 datasets Activities Activities per year 1999 1999 2005 2018 2020 2020 3 Workshop, seminar, course or exhibition 2 Contributed talk Activities per year Second International Workshop on Analytics and Mining of Model Repositories (AMMoRe)Babur, Ö. (Chair), Cleophas, L. G. W. A. (Chair), Chaudron, M. R. V. (Chair), Iovino, L. (Chair) & Kolovos, D. (Chair)16 Oct 2020Activity: Participating in or organising an event types › Workshop, seminar, course or exhibition › Scientific International Workshop on Analytics and Mining of Model Repositories (AMMoRe)Babur, Ö. (Organiser), Chaudron, M. R. V. (Organiser), Cleophas, L. (Organiser), Di Ruscio, D. (Organiser) & Kolovos, D. (Organiser)16 Oct 2018Activity: Participating in or organising an event types › Workshop, seminar, course or exhibition › Scientific Jacquard 2005, Zeist, The NetherlandsChaudron, M. (Speaker)3 Feb 2005Activity: Talk or presentation types › Contributed talk › Scientific Jacquard 2005, Zeist, The NetherlandsChaudron, M. (Speaker)3 Feb 2005Activity: Talk or presentation types › Contributed talk › Scientific 4th International ERCIM Workshop on Formal Methods for Industrial Critical Systems (FMICS 1999)Chaudron, M. (Organiser)11 Jul 1999Activity: Participating in or organising an event types › Workshop, seminar, course or exhibition › Scientific Courses Advanced Software Engineering1/09/22 → 31/08/26Course Design and Use of Software Architecture1/09/24 → …Course Software Engineering Project1/09/24 → …Course Press/Media Inaugural lecture prof.dr. Michel ChaudronChaudron, M. R. V.24/03/231 item of Media coveragePress/Media: Expert Comment Nine AI projects funded to improve the quality of life and healthcareVeta, M., Chaudron, M. R. V. & de Campos, C. P.13/09/221 item of Media coveragePress/Media: Expert Comment",
  "content_length": 9547,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:16"
}