{
  "name": "Michael Hatzopoulos",
  "homepage": "http://cgi.di.uoa.gr/~mike",
  "status": "success",
  "content": "UNIVERSITY OF ATHENS Professor Michael    HATZOPOULOS Department of Informatics and Telecommunications Division of Computer Systems and Applications E.mail: mike@di.uoa.gr Tel: + (30) 2107275203 Fax: + (30) 2107275214 Sec: + (30) 2107275200 Mob: + (30) 6977609916 Go to the top of the page Education Employment Publications Projects Teaching this semester (in Greek) Go to the top of the page Education B.Sc in Mathematics University of Athens (1971) M.Sc in Computer Science, Loughborough University of Technology (1972) Ph.D in Computer Science, Loughborough University of Technology (1974) Go to the top of the page Employment 1974-1976:Research Associate, Department of Mechanical Engineering, Loughborough University of Technology. 1977-1981: Lecturer, Dept. of Mathematics, University of Athens. 1981-1984:Visiting Associate Professor, Dept. of Computer Science, Michigan Technological University. 1984-1989:Assistant Professor, Dept. of Mathematics, University of Athens. 1989-1991: Associate Professor, Dept. of Informatics and Telecommunications, University of Athens. 1991- today :Professor, Dept. of Informatics and Telecommunications, University of Athens. Go to the top of the page Projects 1)Open-Connect: H2020 starting in 2017 2)OpenMinTed \"Open Minining INfrastructure for TExt and Data\" (June 2015-June 2018) H2020. Project Coordinator. 3)OpenAire2020 \"Open Access Infrastructure for Research in Europe 2020\", (January 2015- June 2018) H2020. Project Coordinator. 4)ESPAS \"European Strategy and Policy Analysis System\" (Jamuary 2013-June 2016) FP7 Infrastructures, partner manager. 5)OpenAirPlus \"2nd-Generation Open Access Infrastructure for Research in Europe\" (January 2013-June 2015) FP7 Infrastructures. Project Coorfinator. 6)OpenAire Open Access Infrastructure for Research in Europe (December 2009 until November 2012) FP7 Infrastructures. Project Coordinator 7)DRIVER II Digital Repository Infrastructure Vision for European Research II (December 2007 until November 2009) FP6 Infrastructures. Project coordinator. 8)DRIVER: Digital Repository Infrastructure Vision for European Research (June 2006 until November 2007). Project coordinator. 9)DIAS: Digital upper Atmosphere Server (February 2004 until February 2006) Project manager of the University of Athens group. 10)COSMOS: Cluster of Systems of Metadata for Official Statistics (IST-2000-26050). (September 2001 until September 2002). Project manager of the University of Athens group. 11)MISSION: Multi-agent Integration of Shared Statistical Information over the (inter)Net. (IST-1999-10655). (January 2000 until December 2002). Project manager of the University of Athens group. 12)ADDSIA: Access to Distributed Databases for Statistical Information and Analysis, ESPRIT project 22950. Project manager of the University of Athens group. 13)MEMOIR: Managing Enterprise-scale Multimedia using Open framework for Information Reuse, ESPRIT project 22153. Project manager of the University of Athens group. 14)HILDE: Creation of a platform for the development of educational software using multimedia technologies. Project manager of the University of Athens group. (ESPRIT II). 15)'ORES-Towards the first generation of database management systems', ESPRIT III 7224. Project manager of the University of Athens group. The project lasted from 1992 until 1994. 16)ILDIC a CEC project within DELTA program (D2012). Project manager of the University of Athens group. A three year project that finished on December 1994. 17)'Open Standards for Multimedia Optical Storage Environment', OSMOSE  (6788) project within ESPRIT II. Project manager of the University of Athens group. The project finished 1st November 1994. 18)'Office Automation in the Greek PTT', a project supported by the Greek PTT. Member of the research team of the University of Athens (1990-1993). 19)'Parallel Computing Action'. Under this EEC program a proposal was made (based on the results of SPAN) for developing a parallel SQL processor to run on a Transputer based system. The proposal was accepted by the EEC and the University of Athens has been awarded a grant to buy a parallel system. The system was installed in January 1991. 20)'Open Standards for Multimedia Optical Storage Environment', OSMOSE I (5656) project within ESPRIT II. The project lasted from October 1990 till October 1991 and our group developed a multimedia data handler on top of UNIX (1990-1991). 21)'European Declarative Systems', EDS (EP 2025) tip project within the ESPRIT II program. Member of the research group of the University of Athens. The group  worked in the development of applications using parallel PROLOG on architectures examined in the EDS environment (1989-1992). 22)'BIOLAB-Biomedical Laboratory' an AIM project. The project lasted from 1989 until 1991 and I was project manager. 23)'Standard Authoring facilities Environment' SAFE project (D1014) in the EEC program DELTA Manager of the University of Athens research group. Under this program we developed a Hypermedia database (1989-1991). 24)'Interoperability of Heterogeneous Information Systems', project supported by the EEC program COST 11ter. Manager of the participation of the University of Athens (1986-1988). 25)'Parallel Computing Systems for Integrated Symbolic and Numeric Processing' SPAN ESPRIT 1588 project. Participation in the team of the University of Athens for the development of a database management system for the architectures supported by the SPAN environment (1987-1990). 26)'Design and Evaluation of Parallel Algorithms', program supported by the Greek Ministry of Research. Manager of the project in collaboration with N.Missirlis (1985-1987). 27)Algorithms Architectures and their Classification', ESPRIT pilot program 0144528, in collaboration with the Research Institute of Ireland (1982-1984). Go to the top of the page",
  "content_length": 5851,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:12"
}