{
  "name": "Michael Shieh",
  "homepage": "https://www.comp.nus.edu.sg/cs/people/mshieh",
  "status": "success",
  "content": "Michael SHIEH Qizhe - NUS Computing Skip to content No results COM2-03-34 651 66581 michaelshieh.com Michael Shieh Assistant Professor PhD, Carnegie Mellon University, Machine Learning Department, 2020 Master, Carnegie Mellon University, Language Technologies Institute, 2018 Bachelor, Shanghai Jiao Tong University, ACM Class, 2016 Michael Qizhe Shieh is an assistant professor in the Department of Computer Science, National University of Singapore. He obtained his Master's and PhD from Carnegie Mellon University and his bachelors' degree from Shanghai Jiao Tong University, ACM Class. He conducted research at Google DeepMind (previously Google Brain) for two years. His research interests include Large Language Models, Deep Learning and Natural Language Processing. He worked on semi-supervised learning and published Noisy Student and UDA. He also contributed to the RACE benchmark, the first large-scale reading comprehension benchmark with its emphasis on human-level reasoning problems. He has been an area chair for machine learning and AI conferences such as the Neural Information Processing Systems (NeurIPS), the International Conference on Machine Learning (ICML) and International Conference on Learning Representations (ICLR). RESEARCH AREAS Artificial Intelligence Machine Learning Natural Language Processing RESEARCH INTERESTS RESEARCH PROJECTS RESEARCH GROUPS TEACHING INNOVATIONS SELECTED PUBLICATIONS AWARDS & HONOURS COURSES TAUGHT CS6216 Advanced Topics in Machine Learning Knowledge@Computing Knowledge@Computing 21 July 2025 How AI Models Learn to Read – and Learn From – Unnatural Language Explore how scalable collaborative zk-SNARKs enable fast, secure zero-knowledge proofs across multiple servers. This breakthrough improves privacy and scalability for ... Artificial Intelligence, Department of Computer Science, LLM, Research",
  "content_length": 1861,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:55"
}