{
  "name": "Michael C. Gastpar",
  "homepage": "https://people.epfl.ch/michael.gastpar",
  "status": "success",
  "content": "Michael Gastpar — People - EPFL Michael Gastpar Editer le profil michael.gastpar@epfl.ch +41 21 693 75 23 http://ic-people.epfl.ch/~gastpar Professeur ordinaire, Laboratoire d'information dans les systèmes en réseaux EPFL IC IINFCOM LINX INR 130 (Bâtiment INR) Station 14 1015 Lausanne +41 21 693 75 23 Local: INR 130 EPFL > IC > IINFCOM > LINX Web site: Site web: https://linx.epfl.ch/ Professeur ordinaire, EDIC - Enseignement EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDIC-ENS Membre, Comité d'évaluation académique EPFL EPFL > VPA > VPA-FAC > CEAE vCard Données administratives Domaines de compétences Information Theory, Signal Processing, Communications, Systems NeuroscienceResearch page Biographie Michael Gastpar is a (full) Professor at EPFL. From 2003 to 2011, he was a professor at the University of California at Berkeley, earning his tenure in 2008.   He received his Dipl. El.-Ing. degree from ETH Zürich, Switzerland, in 1997 and his MS degree from the University of Illinois at Urbana-Champaign, IL, USA, in 1999. He defended his doctoral thesis at EPFL on Santa Claus day, 2002. He was also a (full) Professor at Delft University of Technology, The Netherlands.   His research interests are in network information theory and related coding and signal processing techniques, with applications to sensor networks and neuroscience.   He is a Fellow of the IEEE. He is the co-recipient of the 2013 Communications Society & Information Theory Society Joint Paper Award. He was an Information Theory Society Distinguished Lecturer (2009-2011). He won an ERC Starting Grant in 2010, an Okawa Foundation Research Grant in 2008, an NSF CAREER award in 2004, and the 2002 EPFL Best Thesis Award. He has served as an Associate Editor for Shannon Theory for the IEEE Transactions on Information Theory (2008-11), and as Technical Program Committee Co-Chair for the 2010 International Symposium on Information Theory, Austin, TX. Show more Enseignement & Phd Enseignement Communication Systems Computer Science Doctorants Bondaschi Marco, Kanabar Millen Bharat, Vandenbroucque Adrien, Yadav Anuj Kumar, Yao Yunzhen, Çadir Cemre, A dirigé les thèses EPFL de Esposito Amedeo Roberto , Li Su , Op 't Veld Guillaume Jean , Pradeep Aditya , Sahraei Saeid , Sula Erixhen , Wang Chien-Yi , Zhu Jingge , close Liste complète des adresses et fonctions EPFL IC IINFCOM LINX Professeur ordinaire Statut:  Personnel EPFL IC IINFCOM LINX INR 130 (Bâtiment INR) Station 14 1015 Lausanne +41 21 693 75 23 Local: INR 130 EPFL > IC > IINFCOM > LINX EPFL IC IC-SSC SSC-ENS Professeur ordinaire Statut:  Personnel EPFL > IC > IC-SSC > SSC-ENS EPFL IC IC-SIN SIN-ENS Professeur ordinaire Statut:  Personnel EPFL > IC > IC-SIN > SIN-ENS EPFL VPA-AVP-DLE AVP-DLE-EDOC EDIC-ENS Professeur ordinaire Statut:  Personnel EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDIC-ENS EPFL VPA VPA-FAC CEAE Membre Statut:  Personnel EPFL > VPA > VPA-FAC > CEAE",
  "content_length": 2914,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:47"
}