{
  "name": "Michal Pechoucek",
  "homepage": "http://cs.fel.cvut.cz/en/people/pechouce",
  "status": "success",
  "content": "Department of Computer Science Home Department of Computer Science People PROFESSORS PROF. DR. MICHAL PĚCHOUČEK, MSC. Praha 2, Karlovo náměstí 13, E-333c | Praha 2, Karlovo náměstí 13, E-201 +420 224 357 355 pechouce@fel.cvut.cz Teaching activities (6) Publications (420) FEL Timetable Publications (420) Teaching activities (6) Čermák, J., Bošanský, B., Horák, K., Lisý, V., Pěchouček, M. 2018 Approximating Maxmin Strategies in Imperfect Recall Games Using A-loss Recall Property, detail Bošanský, B., Čermák, J., Horák, K., Pěchouček, M. 2017 Computing Maxmin Strategies in Extensive-form Zero-sum Games with Imperfect Recall, detail Čermák, J., Bošanský, B., Pěchouček, M. 2017 Combining Incremental Strategy Generation and Branch and Bound Search for Computing Maxmin Strategies in Imperfect Recall Games, detail Bošanský, B., Čermák, J., Horák, K., Pěchouček, M. 2017 Computing Maxmin Strategies in Extensive-form Zero-sum Games with Imperfect Recall, detail Čermák, J., Bošanský, B., Pěchouček, M. 2017 Combining Incremental Strategy Generation and Branch and Bound Search for Computing Maxmin Strategies in Imperfect Recall Games, detail Horák, K., Bošanský, B., Pěchouček, M. 2017 Heuristic Search Value Iteration for One-Sided Partially Observable Stochastic Games, detail Kiekintveld, C., Durkota, K., Durkota, K., Lisý, V., 2Pěchouček, M., Bošanský, B. 2016 Case Studies of Network Defense with Attack Graph Games, detail García, S., Pěchouček, M. 2016 Detecting the Behavioral Relationships of Malware Connections, detail Durkota, K., Lisý, V., Kiekintveld, C., Bošanský, B., Pěchouček, M. 2016 Case Studies of Network Defense with Attack Graph Games, detail Vaněk, O., Kopřiva, Š., Hrstka, O., Pěchouček, M. 2016 ARETHUS - A Decision Support Platform for Reasoning About Security, detail Vaněk, O., Kopřiva, Š., Ondráček, J., Hrstka, O., Pěchouček, M. 2016 Modeling Maritime Contraband Trafficking Activities with the Agent-Based Approach, detail Kopřiva, Š., Pěchouček, M. 2016 Next generation services XPlanning 3, detail Kopřiva, Š., Pěchouček, M. 2016 Next generation services XPlanning 2, detail Kopřiva, Š., Pěchouček, M. 2016 Next generation services XPlanning 1, detail García, S., Pěchouček, M. 2016 Detecting the Behavioral Relationships of Malware Connections, detail Tožička, J., Jakubův, J., Komenda, A., Pěchouček, M. 2016 Privacy-Concerned Multiagent Planning, detail Komenda, A., Novák, P., Pěchouček, M. 2015 Multiagent Plan Repair by Combined Prefix and Suffix Reuse, detail Komenda, A., Štolba, M., Kovacs, D.L., Pěchouček, M. 2015 Proceedings of the 3rd Workshop on Distributed and Multi - Agent Planning, detail Vaněk, O., Hrstka, O., Kopřiva, Š., Faigl, J., Pěchouček, M. 2015 Bi-objective maritime route planning in pirate-infested waters, detail Hrstka, O., Vaněk, O., Kopřiva, Š., Zelinka, J., Faigl, J., Pěchouček, M. 2015 Agent-based Approach to Illegal Maritime Behavior Modeling, detail Ondráček, J., Vaněk, O., Pěchouček, M. 2015 Solving Infrastructure Monitoring Problems with Multiple Heterogeneous Unmanned Aerial Vehicles, detail Komenda, A., Štolba, M., Domshlak, C., Pěchouček, M. 2015 Towards Robust Multiagent Plans: Final Report, detail Vaněk, O., Hrstka, O., Pěchouček, M. 2014 Improving Group Transit Schemes to Minimize Negative Effects of Maritime Piracy, detail Volf, P., Jakubův, J., Koranda, L., Šišlák, D., Pěchouček, M., Mereu, S., Hilburn, B., Nguyen, D.N. 2014 Validation of an Air-Traffic Controller behavioral model for fast time simulation, detail Ondráček, J., Vaněk, O., Pěchouček, M. 2014 Monitoring Oil Pipeline Infrastructures with Multiple Unmanned Aerial Vehicles, detail Tožička, J., Šišlák, D., Pěchouček, M. 2014 Diverse Planning for UAV Trajectories, detail Bošanský, B., Kiekintveld, C., Lisý, V., Pěchouček, M. 2014 An Exact Double-Oracle Algorithm for Zero-Sum Extensive-Form Games with Imperfect Information, detail Komenda, A., Novák, P., Pěchouček, M. 2014 Domain-independent multi-agent plan repair, detail Tožička, J., Jakubův, J., Durkota, K., Komenda, A., Pěchouček, M. 2014 Multiagent Planning Supported by Plan Diversity Metrics and Landmark Actions, detail Komenda, A., Lass, R.N., Novák, P., Regli, W.C., Pěchouček, M. 2013 Scalable and Robust Multi-agent Planning with Approximated DCOP, detail Komenda, A., Novák, P., Pěchouček, M. 2013 How to Repair Multi-agent Plans: Experimental Approach, detail Novák, P., Komenda, A., Čáp, M., Vokřínek, J., Pěchouček, M. 2013 Simulated Multi-robot Tactical Missions in Urban Warfare, detail Komenda, A., Vokřínek, J., Čáp, M., Pěchouček, M. 2013 Developing Multiagent Algorithms for Tactical Missions Using Simulation, detail Tožička, J., Šišlák, D., Pěchouček, M. 2013 Planning of Diverse Trajectories., detail Selecký, M., Štolba, M., Meiser, T., Čáp, M., Komenda, A., Rollo, M., Vokřínek, J., Pěchouček, M. 2013 Deployment of Multi-agent Algorithms for Tactical Operations on UAV Hardware, detail Čáp, M., Novák, P., Vokřínek, J., Pěchouček, M. 2013 Multi-agent RRT*: sampling-based cooperative pathfinding, detail Čáp, M., Novák, P., Vokřínek, J., Pěchouček, M. 2013 Multi-agent RRT*: Sampling-based Cooperative Pathfinding, detail Vokřínek, J., Čáp, M., Horký, A., Pěchouček, M. 2013 Research for Applying Multi-Agent Techniques towards Onboard Automobile Purposes, detail Vaněk, O., Jakob, M., Hrstka, O., Pěchouček, M. 2013 Agent-based model of maritime traffic in piracy-affected waters, detail Bošanský, B., Lisý, V., Čermák, J., Vítek, R., Pěchouček, M. 2013 Using Double-Oracle Method and Serialized Alpha-Beta Search for Pruning in Simultaneous Move Games, detail Tožička, J., Šišlák, D., Pěchouček, M. 2013 Planning of diverse trajectories for UAV control displays, detail Bošanský, B., Kiekintveld, C., Lisý, V., Čermák, J., Pěchouček, M. 2013 Double-Oracle Algorithm for Computing an Exact Nash Equilibrium in Zero-Sum Extensive-Form Games, detail Vaněk, O., Pěchouček, M. 2013 Dynamic group transit scheme for corridor transit, detail Vaněk, O., Jakob, M., Pěchouček, M. 2013 Using Data-Driven Simulation for Analysis of Maritime Piracy, detail Jakob, M., Pěchouček, M., Čáp, M., Novák, P., Vaněk, O. 2012 Mixed-Reality Testbeds for Incremental Development of HART Applications, detail Čáp, M., Novák, P., Vokřínek, J., Pěchouček, M. 2012 Asynchronous decentralized algorithm for space-time cooperative pathfinding, detail Štolba, M., Selecký, M., Meiser, T., Čáp, M., Rollo, M., Komenda, A., Vokřínek, J., Pěchouček, M. 2012 AgentFly-In-Air: HW deployment, experimentation and testing of the results from the Tactical AgentFly and AgentScout projects, detail Vaněk, O., Yin, Z., Jain, M., Bošanský, B., Tambe, M., Pěchouček, M. 2012 Game-theoretic Resource Allocation for Malicious Packet Detection in Computer Networks, detail Kopřiva, Š., Šišlák, D., Pěchouček, M. 2012 Sense and Avoid Concepts: Vehicle-Based SAA Systems (Vehicle-to-Vehicle), detail Vaněk, O., Bošanský, B., Jakob, M., Lisý, V., Pěchouček, M. 2012 Extending Security Games to Defenders with Constrained Mobility, detail Šišlák, D., Volf, P., Kopřiva, Š., Pěchouček, M. 2012 AgentFly: Scalable, High-Fidelity Framework for Simulation, Planning and Collision Avoidance of Multiple UAVs, detail Bošanský, B., Vaněk, O., Pěchouček, M. 2012 Strategy Representation Analysis for Patrolling Games, detail Kopřiva, Š., Šišlák, D., Pěchouček, M. 2012 Towards Parallel Real-Time Trajectory Planning, detail Píbil, R., Lisý, V., Kiekintveld, C. D., Bošanský, B., Pěchouček, M. 2012 Game Theoretic Model of Strategic Honeypot Selection in Computer Networks, detail Tožička, J., Benvegnu, E., Šišlák, D., Pěchouček, M., Suri, N. 2012 Autonomous UCAV Coordination in Dynamic Search and Destroy Missions, detail Bošanský, B., Kiekintveld, C., Lisý, V., Pěchouček, M. 2012 Iterative Algorithm for Solving Two-player Zero-sum Extensive-form Games with Imperfect Information, detail Šišlák, D., Volf, P., Pavlíček, D., Pěchouček, M. 2012 Nas-wide en-route air-traffic controller modeling, detail Lisý, V., Bošanský, B., Pěchouček, M. 2012 Anytime Algorithms for Multi-agent Visibility-based Pursuit-evasion Games, detail Jakob, M., Vaněk, O., Hrstka, O., Pěchouček, M. 2012 Agents vs. Pirates: Multi-Agent Simulation and Optimization to Fight Maritime Piracy, detail Šišlák, D., Volf, P., Pěchouček, M., Cannon, C.T., Nguyen, D.N., Regli, W.C. 2012 Multi-Agent Simulation of En-Route Human Air-Traffic Controller, detail Lisý, V., Píbil, R., Stiborek, J., Bošanský, B., Pěchouček, M. 2012 Game-theoretic Approach to Adversarial Plan Recognition, detail Šišlák, D., Volf, P., Pavlíček, D., Pěchouček, M. 2012 AGENTFLY: Multi-Agent Simulation of Air-Traffic Management, detail Novák, P., Komenda, A., Lisý, V., Bošanský, B., Čáp, M., Pěchouček, M. 2012 Tactical Operations of Multi-Robot Teams in Urban Warfare (Demonstration), detail Jakob, M., Volf, P., Semsch, Eduard, Pavlíček, D., Pěchouček, M. 2012 Agent-based Control for Multi-UAV Information Collection, detail Komenda, A., Novák, P., Pěchouček, M. 2012 Decentralized Multi-agent Plan Repair in Dynamic Environments (Extended Abstract), detail Pěchouček, M., Vaněk, O. 2012 Agent Technology for Safety, Security and Efficiency of Critical Infrastructures, detail Jakob, M., Moler, Z., Komenda, A., Yin, Z., Jiang, A.X., Johnson, M. P., Pěchouček, M., Tambe, M. 2012 AgentPolis: towards a platform for fully agent-based modeling of multi-modal transportation, detail Pěchouček, M., Jakob, M., Novák, P. 2012 Towards Simulation-Aided Design of Multi-Agent Systems, detail Komenda, A., Čáp, M., Pěchouček, M. 2012 Multi-agent Simulation Approach to Development of Applications for Decentralized Tactical Missions, detail Vaněk, O., Jakob, M., Lisý, V., Bošanský, B., Pěchouček, M. 2011 Iterative Game-theoretic Route Selection for Hostile Area Transit and Patrolling, detail Vaněk, O., Pěchouček, M., Jakob, M., Bošanský, B., Lisý, V. 2011 Agentni simulaci proti somalskym piratum, detail Šišlák, D., Volf, P., Pěchouček, M. 2011 Agent-Based C",
  "content_length": 50935,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:24"
}