{
  "name": "Michael N. Huhns",
  "homepage": "http://www.cse.sc.edu/~huhns",
  "status": "success",
  "content": "Prof. Michael N. Huhns Distinguished Professor Emeritus Michael N. Huhns NCR Chair Emeritus of Computer Science and Engineering Detailed Resume | Research Interests | Publications Dr. Michael N. Huhns is the NCR Distinguished Professor Emeritus of Computer Science and Engineering at the University of South Carolina. Prior to this, he was the Chair of the Department of Computer Science and Engineering. He is a Fellow of the IEEE, a Fellow of the Asia-Pacific Artificial Intelligence Association, a Fellow of the Association for the Advancement of Artificial Intelligence, and a Senior Member of the ACM. CONTACT INFORMATION Department of Computer Science and Engineering Storey Innovation Center 550 Assembly Street University of South Carolina Columbia, SC 29201 huhns@sc.edu Phone: +1 (803) 777-5921 BRIEF BIOGRAPHY (a detailed resume is here) Dr. Huhns received the B.S.E.E. degree in 1969 from the University of Michigan, Ann Arbor, and the M.S. and Ph.D. degrees in electrical engineering in 1971 and 1975, respectively, from the University of Southern California, Los Angeles. Before becoming a professor of computer science and engineering at the University of South Carolina, he conducted research on the Argo, Antares, RAD, Carnot, and InfoSleuth projects at the Microelectronics and Computer Technology Corporation as a Senior Member of the Research Division. He was also an adjunct professor in computer sciences at the University of Texas. Prior to joining MCC, he was an associate professor at the University of South Carolina, a research assistant in image processing at the University of Southern California, and a radar systems engineer at Hughes Aircraft Company. Besides being a Fellow of the IEEE, APAIA, and AAAI, Dr. Huhns is a member of Sigma Xi, Tau Beta Pi, Eta Kappa Nu, ACM, and Upsilon Pi Epsilon. He is the author of over 250 technical papers in machine intelligence and an editor of the books Distributed Artificial Intelligence, Volumes I and II and Readings in Agents. With Prof. Munindar P. Singh of North Carolina State University, he has authored the textbook Service-Oriented Computing: Semantics, Processes, Agents for John Wiley Publishing Co. Dr. Huhns is an associate editor for IEEE Internet Computing. He was on the editorial boards for over a dozen technical journals. He is a founder and board member for the International Foundation for Cooperative Information Systems and the International Foundation for Autonomous Agents and Multiagent Systems. He has chaired and served on the advisory boards and program committees for numerous international conferences and workshops. As an educator, he has introduced into the USC curriculum 12 new courses and has supervised 12 Ph.D. dissertations and more than 40 M.S. theses. He has also given 25 tutorials on multiagent systems and service-oriented computing at professional meetings. RESEARCH INTERESTS (a complete list of publications is here) My research has ranged broadly over many areas of information technology, including service-oriented computing, distributed artificial intelligence and multiagent systems, machine learning, computer vision, enterprise integration, and computational sociotechnical systems. Its focus, however, has been on the three complementary themes of (1) distributing the loci of computational intelligence, (2) enhancing the intelligence of the distributed computations, and (3) increasing the effectiveness of the interactions among the loci. The themes are evident in the following ontology of my publications: Multiagent Systems (including negotiation and communication): LIST Key Publication: Michael N. Huhns, editor, Distributed Artificial Intelligence, Pitman Publishing Ltd., London, England, 1987. Service-Oriented Computing (including workflows, ontologies, and semantics): LIST Key Publication: Munindar P. Singh and Michael N. Huhns, Service-Oriented Computing: Semantics, Processes, Agents, John Wiley & Sons, Ltd, West Sussex, England, 2005. Cooperative Information Systems (including enterprise integration): LIST Key Publication: Michael N. Huhns, Larry M. Stephens, and Nenad Ivezic, \"Automating Supply-Chain Management,\" in Proceedings First International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS), Bologna, Italy, pp. 1017-1024, July 2002. Computational Social Systems (including commitments, ethics, and emotions): LIST Key Publication: Munindar P. Singh and Michael N. Huhns, \" Social Abstractions for Information Agents,\" in Intelligent Information Agents, Matthias Klusch, editor, Kluwer Academic Publishers, Boston, MA, 1999. Software Engineering (including autonomy and robustness): LIST Key Publication: Michael N. Huhns, \" Consensus Software: Robustness and Social Good via Widespread Multiagent Development,\" in Proc. 17th International Conference on Software and Systems Engineering and their Applications (ICSSEA), Paris, France, vol. 2, session 7, pp. 37-48, November 2004. Knowledge Representation and Reasoning (including ontologies): LIST Key Publication: Michael N. Huhns and Larry M. Stephens, \" Semantic Bridging of Independent Enterprise Ontologies,\" in Inter- and Intra-Organizational Integration: Building International Consensus, Kurt Kosanke et al., editors, Kluwer Academic Publishers, Boston, MA, 2002. Applications and Infrastructure: LIST Key Publication: Kuhanandha Mahalingam and Michael N. Huhns, \"An Ontology Tool for Distributed Information Environments,\" IEEE Computer, vol. 30, no. 6, pp.80-83, June 1997. Computer Architecture: LIST Key Publication: Charles F. Summer, Jr., Robert O. Pettus, Ronald D. Bonnell, Michael N. Huhns, and Larry M. Stephens, \"Multiple-Microcomputer Processing,\" United States Patent No. 4,414,624, 8 November 1983. Computer Vision and Pattern Recognition: LIST Key Publication: Qi Tian and Michael N. Huhns, \" Algorithms for Subpixel Registration,\" Computer Vision, Graphics, and Image Processing, vol. 35, pp. 220-233, August 1986. My DBLP Entry",
  "content_length": 5980,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:41"
}