{
  "name": "Michael Hitchens",
  "homepage": "https://researchers.mq.edu.au/en/persons/michael-hitchens",
  "status": "success",
  "content": "Michael Hitchens - Macquarie University View Scopus Profile Michael Hitchens Associate Professor Associate Professor, School of Computing https://orcid.org/0000-0001-6320-9184 Phone+61 2 9850 9538Emailmichael.hitchensmq.eduau h-index 2203 Citations 24 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1992 …2024 Research activity per year Personal profile BiographyResearch Interests:  Access Control, network security, cyber security, trust and privacy in computer security, Video Games, computer games, player-avatar relationship, role-playing games. Videogames are the new media of the 21st century, ranging from simple but enthralling games that can be played a few minutes at time on hand-held devices to epic adventures in virtual worlds that can take hundreds of hours to play.  Of particular interest to me is the relationship between players and their representations in virtual worlds, player experience and the study of roleplaying games.  Roleplaying games present a fascinating example of games, being large in scale, inviting players to identify deeply with their characters and challenging our notions of what a game is and how games and stories relate. Within the broad area of Computer Security most of my work concentrates on authorisation/access control, trust and network security protocols. Authorisation/access control involves the policies settings that specify what a user or other entity is able to do within a system and the mechanisms that enforce these settings. Trust examines issues of how confident one entity should be in whether another will carry out an action. Network security protocols provide the structure for communication between entities. Education and Work Experience:  Dr. Hitchens is an associate professor in the Department of Computing at Macquarie University.  He received his PhD in Operating Systems from the University of Newcastle in 1991.  Before joining Macquarie he has worked at Western Sydney University (1991-1995,2000) and the University of Sydney (1996-1999). Fingerprint Dive into the research topics where Michael Hitchens is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 8 Similar Profiles Role-Based Access Control Computer Science 100% Game Playing Computer Science 86% Internet-Of-Things Computer Science 79% Access Control Computer Science 72% Access Control Policy Computer Science 56% Trust Management Computer Science 52% Information Storage Computer Science 45% Web Service Computer Science 44% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2007 2007 2014 2016 2019 2028 2 Active 12 Finished Projects per year Welcoming Trans and Gender Diverse PlayersWhitehouse, K. (Primary Chief Investigator), Hitchens, M. (Supervisor) & McEwan, M. (Supervisor)2/02/22 → 1/02/28Project: Research The science of human responsibility: An interdisciplinary approach to understanding the sense of agencyPolito, V. (Primary Chief Investigator), Klein, C. (Chief Investigator), Kaplan, D. M. (Chief Investigator), Langdon, R. (Associate Investigator), Hitchens, M. (Associate Investigator), Zopf, R. (Associate Investigator), Carruthers, G. (Associate Investigator) & Woody, E. (Associate Investigator)1/01/16 → …Project: Research Cybersecurity ethics training simulations for values-based decision-makingRichards, D. (Primary Chief Investigator), Ryan, M. (Chief Investigator), Formosa, P. (Chief Investigator), Hitchens, M. (Chief Investigator), Dignum, V. (Associate Investigator) & McEwan, M. (Associate Investigator)1/12/19 → 30/06/23Project: Research Trans* and Gender Diverse Players, Avatars and the Performance of GenderWhitehouse, K. (Primary Chief Investigator), Hitchens, M. (Supervisor) & Matthews, N. (Supervisor)2/02/19 → 11/10/22Project: Research Sustainable and programmatic assessment in science and engineeringDownes, J. (Primary Chief Investigator) & Hitchens, M. (Other)1/01/16 → 30/06/17Project: Teaching View all 14 projects Research Outputs Research output per year 1992 2001 2005 2007 2008 2009 2012 2014 2018 2019 2020 2021 2022 2023 2024 2024 90 Conference proceeding contribution 46 Article 14 Chapter 2 Review article 3 More 1 Conference abstract 1 Paper 1 Digital or Visual products Research output per year Research output per year A blockchain-based approach for parametric insurance under multiple sources of truthRabehaja, T., Pal, S., Hill, A. & Hitchens, M., 2024, In: IEEE Transactions on Services Computing. 17, 3, p. 718-732 15 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Product Offering 100% Policyholder 100% Contract Terms 100% Blockchain Technology 100% Blockchain 100% 1 Citation (Scopus) 9 Downloads (Pure) Experiential learning or direct training: fostering ethical cybersecurity decision-making via serious gamesSadeghi, B., Richards, D., Formosa, P. & Hitchens, M., 2024, Persuasive Technology: 19th International Conference, PERSUASIVE 2024, Wollongong, NSW, Australia, April 10–12, 2024, proceedings. Baghaei, N., Ali, R., Win, K. & Oyibo, K. (eds.). Cham: Springer, Springer Nature, p. 262–272 11 p. (Lecture Notes in Computer Science; vol. 14636).Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Cybersecurity 100% Decision-Making 100% Serious Game 100% Decision Making 100% Ethics 100% 1 Citation (Scopus) Exploring the impact of tailored game content on ethical decision-making competence in cybersecuritySadeghi, B., Richards, D., Formosa, P. & Hitchens, M., 4 Dec 2024, ACIS 2024 Proceedings: Digital Futures for a Sustainable Society. Canberra: AIS Electronic Library (AISeL), p. 1-14 15 p. 145Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open AccessFile Cybersecurity 100% Decision-Making 100% Ethical Principle 50% Ergonomics 33% Serious Game 33% Live-action role-playing gamesHarviainen, J. T., Bienia, R., Bowman, S. L., Brind, S., Hitchens, M., Kot, Y. I., MacCallum-Stewart, E., Simkins, D. W., Stenros, J., Sturrock, I. & Xiong, S., 2024, The Routledge handbook of role-playing game studies. Zagal, J. P. & Deterding, S. (eds.). New York, US ; Oxon, UK: Routledge, Taylor and Francis Group, p. 92-114 23 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter › peer-review Role-Playing 100% live-action 100% Game Playing 100% Role Playing 100% Interactive 50% Poster: zero trust driven architecture for blockchain-based access control delegationMukta, R., Pal, S., Hitchens, M., Paik, H. Y. & Kanhere, S. S., 4 Aug 2024, SIGCOMM Posters and Demos 2024 - proceedings of the 2024 SIGCOMM Poster and Demo Sessions: SIGCOMM 2024. New York, NY: Association for Computing Machinery, p. 48-50 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference abstract Open Access Blockchain 100% Access Control 100% Access Rights 100% Driven Architecture 100% System Dynamic 33% 1 Citation (Scopus) View all 155 research outputs",
  "content_length": 7409,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:11"
}