{
  "name": "Michael A. DeVito",
  "homepage": "https://www.khoury.northeastern.edu/people/michael-ann-devito",
  "status": "success",
  "content": "Michael Ann DeVito - Khoury College of Computer Sciences All People Michael Ann DeVito (she/her) Assistant Professor, Jointly Appointed with College of Arts, Media and Design Education Education PhD in Media, Technology, and Society, Northwestern University MA in Media and Public Affairs, George Washington University BA in Journalism and Mass Communication, George Washington University Biography Biography Michael Ann DeVito is an assistant professor in the Khoury College of Computer Sciences and the College of Arts, Media and Design at Northeastern University, based in Boston. DeVito is dedicated to addressing inequalities and unfairness toward marginalized populations that are caused or exacerbated by AI- and machine-learning-driven sociotechnical systems. Inspired by her own experiences, she positions herself as a member-researcher and aims to use folk theorization and her expertise in user understanding to return agency to marginalized users. DeVito believes that equitable design and AI can only be achieved by holistically accounting for these communities, including sapphics, transfeminine people, and neurodivergent folks. Before joining Khoury College, DeVito wore many hats, from Northwestern University instructor to University of Colorado Boulder postdoctoral fellow to managing editor and producer for Planet Forward, George Washington University’s environment-focused science communication institute. She has published regularly at CSCW and CHI, and her work has been recognized by the former with diversity-related and “best paper” honors. DeVito joined Khoury College in 2023 with the goal of continuing her work with marginalized communities, as well as training, funding, and supporting junior researchers from those communities. In the classroom, she teaches ethical AI and machine learning, user understanding, and qualitative and community-focused research methods, firmly believing that a good computer scientist requires both technical skill and deep context on users and communities to avoid creating harmful tech. Outside of academia, DeVito is an avid video game player and modifier, a casual bass guitarist, and a mom to cats Julian and Jadzia. Labs and groups Labs and groups Sociotechnical Equity and Agency Lab Recent publications Recent publications Published: October 14, 2025 Transphobia Is in the Eye of the Prompter: Trans-Centered Perspectives on Large Language Models Citation: Morgan Klaus Scheuerman, Katy Weathington, Adrian Petterson, Dylan Thomas Doyle, Dipto Das, Michael Ann DeVito, Jed R. Brubaker. (2025). Transphobia Is in the Eye of the Prompter: Trans-Centered Perspectives on Large Language Models ACM Trans. Comput. Hum. Interact., 32, 52:1-52:42. https://doi.org/10.1145/3743676 Published: May 2, 2025 “A Blocklist is a Boundary”: Tensions between Community Protection and Mutual Aid on Federated Social Networks Citation: Erika Melder, Ada Lerner, Michael A. DeVito. (2025). \"A Blocklist is a Boundary\": Tensions between Community Protection and Mutual Aid on Federated Social Networks Proc. ACM Hum. Comput. Interact., 9, 1-30. https://doi.org/10.1145/3710919 Published: April 25, 2025 Why Can’t Black Women Just Be?: Black Femme Content Creators Navigating Algorithmic Monoliths Citation: Gianna Williams, Natalie Chen, Michael Ann DeVito, Alexandra To. (2025). Why Can't Black Women Just Be?: Black Femme Content Creators Navigating Algorithmic Monoliths CHI, 108:1-108:14. https://doi.org/10.1145/3706598.3713842 Published: November 8, 2024 Moving Towards Epistemic Autonomy: A Paradigm Shift for Centering Participant Knowledge Citation: Leah Hope Ajmani, Talia Bhatt, Michael Ann DeVito. (2025). Moving Towards Epistemic Autonomy: A Paradigm Shift for Centering Participant Knowledge CoRR, abs/2501.14648. https://doi.org/10.48550/arXiv.2501.14648 Published: April 26, 2024 Safety and Community Context: Exploring a Transfeminist Approach to Sapphic Relationship Platforms Citation: Michael Ann DeVito, Jessica L. Feuston, Erika Melder, Christen Malloy, Cade Ponder, Jed R. Brubaker. (2024). Safety and Community Context: Exploring a Transfeminist Approach to Sapphic Relationship Platforms Proc. ACM Hum. Comput. Interact., 8, 1-34. https://doi.org/10.1145/3653694 Published: March 23, 2024 Content Moderation Folk Theories and Perceptions of Platform Spirit among Marginalized Social Media Users Citation: Samuel Mayworm, Michael Ann DeVito, Daniel Delmonaco, Hibby Thach, Oliver L. Haimson. (2024). Content Moderation Folk Theories and Perceptions of Platform Spirit among Marginalized Social Media Users ACM Trans. Soc. Comput., 7, 1-27. https://doi.org/10.1145/3632741 Published: January 1, 2024 Whose Knowledge is Valued? Epistemic Injustice in CSCW Applications Citation: Leah Hope Ajmani, Jasmine C. Foriest, Jordan Taylor, Kyle Pittman, Sarah A. Gilbert, Michael Ann DeVito. (2024). Whose Knowledge is Valued? Epistemic Injustice in CSCW Applications Proc. ACM Hum. Comput. Interact., 8, 1-28. https://doi.org/10.1145/3687062 Published: May 8, 2021 Queer in HCI: Strengthening the Community of LGBTQIA+ Researchers and Research Citation: Michael Ann DeVito, Caitlin Lustig, Ellen Simpson, Kimberley R. Allison, Tya S. Chuanromanee, Katta Spiel, Amy J. Ko, Jennifer Ann Rode, Brianna Dym, Michael J. Muller, Morgan Klaus Scheuerman, Ashley Marie Walker, Jed R. Brubaker, Alex A. Ahmed. (2021). Queer in HCI: Strengthening the Community of LGBTQIA+ Researchers and Research CHI Extended Abstracts, 159:1-159:3. https://doi.org/10.1145/3411763.3450403 Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://michaelanndevito.com Google Scholar See Citations Areas of Interest Human-Centered Computing Cybersecurity and Privacy Contact m.devito@northeastern.edu Related news Research that hits home: Leah Rosenbloom fights to balance privacy and activism online November 24, 2025 Research that hits home: Erika Melder’s community-based push for user-friendly social media November 10, 2025 Research that hits home: Michael Ann DeVito and the case for a more just research approach November 3, 2025 Explore all news Current PhD students Julia Husar PhD Student Read bio Locations Close this dialog window Boston Ashutosh Kshirsagar PhD Student Read bio Locations Close this dialog window Boston Jiaqi Li PhD Student Read bio Locations Close this dialog window Boston Erika Melder PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 6440,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:34"
}