{
  "name": "Michael Ferdman",
  "homepage": "http://compas.cs.stonybrook.edu/~mferdman",
  "status": "success",
  "content": "Mike Ferdman's Home Page Mike Ferdman Associate Professor, CS, Stony Brook University home cv publications teaching personal contact I am an Associate Professor of Computer Science at Stony Brook University. I direct the Computer Architecture Stony Brook (COMPAS) Lab. Prior to joining Stony Brook, I completed my Ph.D. at Carnegie Mellon University (CMU) under the supervision of Babak Falsafi. While completing my dissertation, I spent several years working remotely from Ecole Polytechnique Fédérale de Lausanne (EPFL). My research interests are in the area of computer architecture, with emphasis on the design of server systems. I work on the entire computing stack, from server software and operating systems, to networks and processor microarchitecture. My current research projects include FPGA accelerator integration into server environments (e.g., Intel HARP, Microsoft Catapult, and Amazon F1), FPGA programmability (e.g., virtual memory and high-level synthesis), accelerators for machine learning (e.g., transformers and convolutional neural networks), efficient network processing and software-defined networking, speculative performance and energy-enhancing techniques for high-performance processors, and programming models and mechanisms for emerging memory technologies (e.g., HBM and 3D XPoint). If you are a PhD student at Stony Brook and want to work with me, please send me email to arrange an appointment. publications 2025 [64] What Gets Measured Gets Managed: Mitigating Supply Chain Attacks with a Link Integrity Management System Johnny So, Michael Ferdman, Nick Nikiforakis, In Proceedings of the 2025 ACM SIGSAC Conference on Computer and Communications Security (CCS '25), Association for Computing Machinery, 2025. (To appear) [bib] 2024 [63] Server Architecture From Enterprise to Post-Moore Babak Falsafi, Michael Ferdman, Boris Grot, In IEEE Micro, volume 44, 2024. [bib] [pdf] [62] NUCAlloc: Fine-Grained Block Placement in Hashed Last-Level NUCA Caches Raveendra Soori, Shreyas Prabhu, Harpreet Singh Chawla, Michael Ferdman, In International Conference on Supercomputing (ICS'24), 2024. [bib] [pdf] [61] A Case for Hardware Memoization in Server CPUs Farid Samandi, Natheesan Ratnasegar, Michael Ferdman, In Computer Architecture Letters (CAL), volume 23, 2024. [bib] [pdf] 2023 [60] The More Things Change, the More They Stay the Same: Integrity of Modern JavaScript Johnny So, Michael Ferdman, Nick Nikiforakis, In Proceedings of the ACM Web Conference (WWW), Association for Computing Machinery, 2023. [bib] [pdf] [59] TailCheck: A Lightweight Heap Overflow Detection Mechanism with Page Protection and Tagged Pointers Amogha Udupa Shankaranarayana Gopal, Raveendra Soori, Michael Ferdman, Dongyoon Lee, In 2023 USENIX Symposium on Operating Systems Design and Implementation (OSDI), USENIX Association, 2023. [bib] [pdf] [58] Waverunner: An Elegant Approach to Hardware Acceleration of State Machine Replication Mohammadreza Alimadadi, Hieu Mai, Shenghsun Cho, Michael Ferdman, Peter Milder, Shuai Mu, In 20th USENIX Symposium on Networked Systems Design and Implementation (NSDI), USENIX Association, 2023. [bib] [pdf] 2022 [57] Domains Do Change Their Spots: Quantifying Potential Abuse of Residual Trust Johnny So, Najmeh Miramirkhani, Michael Ferdman, Nick Nikiforakis, In 2022 IEEE Symposium on Security and Privacy (Oakland), IEEE Computer Society, volume , 2022. [bib] [pdf] [56] AppBastion: Protection from Untrusted Apps and OSes on ARM Darius Suciu, Michael Ferdman, Radu Sion, In Computer Security - ESORICS 2022 - 27th European Symposium on Research in Computer Security, Copenhagen, Denmark, September 26-30, 2022. [bib] [pdf] [55] An Incrementally Updatable and Scalable System for Large-Scale Sequence Search using the Bentley-Saxe Transformation Fatemeh Almodaresi, Jamshed Khan, Sergey Madaminov, Michael Ferdman, Rob Johnson, Prashant Pandey, Rob Patro, In Bioinformatics, 2022. [bib] [pdf] 2021 [54] Practical Model Checking on FPGAs Shenghsun Cho, Mrunal Patel, Michael Ferdman, Peter Milder, In ACM Transactions on Reconfigurable Technology and Systems (TRETS), Association for Computing Machinery, volume 14, 2021. [bib] [pdf] [53] Leveraging FPGA Layout to Minimize Jitter in Statistical Time-to-Digital Converters Farid Samandi, Tianchu Ji, Shenghsun Cho, Michael Ferdman, Peter Milder, In 29th IEEE International Symposium on Field-Programmable Custom Computing Machines (FCCM, withdrawn due to IP dispute), 2021. [bib] [52] On the Distribution, Sparsity, and Inference-time Quantization of Attention Values in Transformers Tianchu Ji, Shraddhan Jain, Michael Ferdman, Peter Milder, H. Andrew Schwartz, Niranjan Balasubramanian, In Findings of the Association for Computational Linguistics: ACL-IJCNLP 2021, Association for Computational Linguistics, 2021. [bib] [pdf] 2020 [51] Swarm Model Checking on the GPU Richard DeFrancisco, Shenghsun Cho, Michael Ferdman, Scott A. Smolka, In International Journal on Software Tools for Technology Transfer (Thomas Given-Wilson, Axel Legay, eds.), 2020. [bib] [pdf] [50] A Scheduling Approach to Incremental Maintenance of Datalog Programs Shikha Singh, Sergey Madaminov, Geoffrey Washburn, Ryan Johnson, Hung Ngo, Dung Nguyen, Soeren Olesen, Kurt Stirewalt, Michael A. Bender, Michael Ferdman, Benjamin Moseley., In 2020 IEEE International Parallel and Distributed Processing Symposium (IPDPS), 2020. [bib] [pdf] [49] An Efficient, Scalable, and Exact Representation of High-Dimensional Color Information Enabled Using de Bruijn Graph Search Fatemeh Almodaresi, Prashant Pandey, Michael Ferdman, Rob Johnson, Rob Patro, In Journal of Computational Biology, volume 27, 2020. [bib] [doi] [48] Flick: Fast and Lightweight ISA-Crossing Call for Heterogeneous-ISA Environments Shenghsun Cho, Han Chen, Sergey Madaminov, Michael Ferdman, Peter Milder, In 47th International Symposium on Computer Architecture (ISCA), 2020. [bib] [pdf] [47] FPGA-Accelerated Samplesort For Large Data Sets Han Chen, Sergey Madaminov, Michael Ferdman, Peter Milder, In 2020 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays (FPGA), 2020. [bib] [pdf] 2019 [46] x86-64 Instruction Usage Among C/C++ Applications Amogh Akshintala, Bhushan Jain, Chia-Che Tsai, Michael Ferdman, Donald E. Porter, In 12th ACM International Conference on Systems and Storage (SYSTOR), 2019. [bib] [pdf] [45] Swarm Model Checking on the GPU Richard DeFrancisco, Shenghsun Cho, Michael Ferdman, Scott A. Smolka, In 26th International SPIN Symposium on Model Checking of Software, Springer International Publishing, 2019. [bib] [pdf] [44] Sorting Large Data Sets with FPGA-Accelerated Samplesort Han Chen, Sergey Madaminov, Michael Ferdman, Peter Milder, 27th Annual International Symposium on Field-Programmable Custom Computing Machines (FCCM poster), 2019. [bib] [pdf] [43] An Efficient, Scalable and Exact Representation of High-Dimensional Color Information Enabled via de Bruijn Graph Search Fatemeh Almodaresi, Prashant Pandey, Michael Ferdman, Rob Johnson, Rob Patro, In 22nd Annual International Conference on Research in Computational Molecular Biology (RECOMB), 2019. [bib] [pdf] [42] Massively Parallel Server Processors Varun Agrawal, Mina Abbasi Dinani, Yuxuan Shui, Michael Ferdman, Nima Honarmand, In Computer Architecture Letters (CAL), 2019. [bib] [pdf] [41] Argus: an End-to-End Framework for Accelerating CNNs on FPGAs Yongming Shen, Tianchu Ji, Michael Ferdman, Peter Milder, In IEEE Micro, volume , 2019. [bib] [pdf] [40] Runtime-Programmable Pipelines for Model Checkers on FPGAs Mrunal Patel, Shenghsun Cho, Michael Ferdman, Peter Milder, In 29th International Conference on Field Programmable Logic and Applications (FPL), 2019. (nominated for the Best Paper award) [bib] [pdf] 2018 [39] Panning for gold.com: Understanding the dynamics of domain dropcatching Najmeh Miramirkhani, Timothy Barron, Michael Ferdman, Nick Nikiforakis, In Proceedings of the ACM Web Conference (WWW), 2018. [bib] [pdf] [38] Mantis: A Fast, Small, and Exact Large-Scale Sequence Search Index Prashant Pandey, Fatemeh Almodaresi, Michael A. Bender, Michael Ferdman, Rob Johnson, Rob Patro, In 21st Annual International Conference on Research in Computational Molecular Biology (RECOMB), 2018. [bib] [pdf] [37] Taming the Killer Microsecond Shenghsun Cho, Amoghavarsha Suresh, Tapti Palit, Michael Ferdman, Nima Honarmand, In 51st Annual IEEE/ACM International Symposium on Microarchitecture (MICRO), 2018. [bib] [pdf] [36] Impact of Device Parameters on Internet-based Mobile Applications Mallesham Dasari, Santiago Vargas, Arani Bhattacharya, Aruna Balasubramanian, Samir Das, Mike Ferdman, In 2018 Conference on Internet Measurement Conference (IMC), 2018. [bib] [pdf] [35] Medusa: A Scalable Memory Interconnect for Many-Port DNN Accelerators and Wide DRAM Controller Interfaces Yongming Shen, Tianchu Ji, Michael Ferdman, Peter Milder, In 28th International Conference on Field Programmable Logic and Applications (FPL), 2018. [bib] [pdf] [34] FPGASwarm: High Throughput Model Checking Using FPGAs Shenghsun Cho, Michael Ferdman, Peter Milder, In 28th International Conference on Field Programmable Logic and Applications (FPL), 2018. [bib] [pdf] [33] A Full-System VM-HDL Co-Simulation Framework for Servers with PCIe-Connected FPGAs Shenghsun Cho, Mrunal Patel, Han Chen, Michael Ferdman, Peter Milder, In 2018 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays (FPGA), 2018. [bib] [pdf] 2017 [32] A VM-HDL Co-Simulation Framework for Systems with PCIe-Connected FPGAs Shenghsun Cho, Mrunal Patel, Basavaraj Kaladagi, Han Chen, Tapti Palit, Michael Ferdman, Peter Milder, Technical report #839, Stony Brook CEAS, 2017. [bib] [pdf] [31] Maximizing CNN Accelerator Efficiency Through Resource Partitioning Yongming Shen, Michael Ferdman, Peter Milder, In 44th International Symposium on Computer Architecture (ISCA), 2017. [bib] [pdf] [30] Escher: A CNN Accelerator with Flexible Buffering to Minimize",
  "content_length": 40034,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:00"
}