{
  "name": "Michael S. Lew",
  "homepage": "https://press.liacs.nl/mlew",
  "status": "success",
  "content": "Prof. dr. Michael S. Lew Prof. dr. Michael S. Lew Professor, Hoogleraar Deep Learning Head, Deep Learning Research Group Head, Machine Learning Cluster (40+ members) co-Director, LIACS Media Lab co-Head, Computational Imaging and Deep Learning Research Group Computer Science Department (LIACS) Leiden University lewmsk@gmail.com My Positions, Education and Research Full Professor, Hoogleraar Deep Learning at LIACS, Leiden University Head, Machine Learning Cluster (30+ members) Co-head of the LIACS Computer Systems, Imagery and Media Research cluster (70+ members), which is one of the two main research divisions at the computer science department at Leiden University. PhD, University of Illinois Urbana-Champaign (UIUC) Research - short version My research lies in the field of artificial intelligence with a primary focus on the area of deep learning. I develop new deep learning algorithms toward understanding large databases and libraries of information by learning synergistic methods using multiple modalities within multimedia including but not limited to vision, audio and text. The goal is to bring to light all of the information in the world and at the same time automatically be able to detect misinformation (e.g. fake news). Research - longer version My research is toward developing artificial intelligence (AI) and currently focuses on the paradigm of deep learning. Artificial Intelligence is the most promising paradigm to help society. Major breakthroughs are expected in the near future in a numerous important areas of society (e.g. medicine, automatic self-driving vehicles, fake news detection, robotics, etc.) but only with access to very large datasets. In many areas, the datasets exist but scientists do not have access. An example I am often asked by medical researchers: what it would take to have expert level classifiers for well known diseases and cancers. My reply is usually that one needs access to a very large dataset of examples. These datasets exist already at many research hospitals around the world. However, the datasets can not be used for training the deep classifiers due to privacy reasons. In my opinion, while it is important to develop AI to detect diseases and cancers, it is even more important to protect human privacy rights. Currently, there is no easy answer for the dataset access issue and each country is wrestling with the tradeoff of privacy vs scientific advances in their own way. My current research is exploring how to both find information and also how to detect false information. Both are necessary to a modern information retrieval system. Because humans want to express their search queries using high level human concepts, the grand challenge in multimedia retrieval has been \"bridging\" the semantic gap which is the gap between the high level concepts of humans and the low level features from multimedia. For a specific example, the problem of image classification is especially important because it can bridge the semantic gap by taking an input image and outputting human level concepts. If we can solve the semantic gap, then it would make all of the collected art/heritage, scientific, WWW and personal images searchable and accessible. Furthermore, there is major interest in explanation based modeling which seeks to give better understanding of the underlying reasons and causes involved in deep network decisions. Misinformation is one of the key 21st century problems and manifests in many different ways. \"Fake News\" is perhaps the most well known type and has affected areas from medicine (dangerous treatments for COVID) to politics (unfounded claims of election fraud). Misinformation also occurs in more subtle ways such as intentionally misrepresenting someone's viewpoints such as taking a small part of a discussion and presenting it as the main viewpoint. The context is important. Other modern ways in which misinformation is happening is with misrepresentation of authorship (see ChatGPT) and plagiarism. Part of my current research examines methods of detecting fake information using deep learning. Teaching/Courses Computer Graphics , Multimedia Systems , LIACS Research Seminar Seminar Multimedia and Deep Learning, Tuesday, 13:15 Multimedia Information Retrieval Chair, LIACS MSc Programme Committee CS and MT LIACS Education Office (who is charge of what) Computer Science Committees Exam Rules and Guidelines LIACS Curriculum CS TimeTables 2023-24 LIACS Thesis Repository (with students and supervisors index) LIACS News Opening Keynote Speaker at the 10th IAPR Neural Networks and Pattern Recognition Meeting, 2022   (IAPR is the largest pattern recognition scientific society worldwide) Named in the Stanford List of Top 2% World Scientists (project led by John P.A. Ioannidis and his team from Stanford University. It uses the c-score which focuses on impact (citations) rather than productivity (number of publications) and it also incorporates information on co-authorship and author positions (single, first, last author). FAIR-ASSESS started! webpage Leiden University Wins Northwestern Europe Regional Programming Contest (out of 123 teams) Leiden University Wins Benelux Programming Contest (out of 50 teams) Leiden Computer Science Masters Education Ranked Best in 2018 (Keuzegids Universiteiten) Leiden Computer Science Masters Education Ranked Best in 2015 (Elsevier) Leiden student teams took 1st and 3rd place at the Catalysts international programming competition (605 teams worldwide), April 2017 LIACS student team took 2nd place (of 85 teams) at ACM Regional Programming Contest: NWERC2012 [Scoreboard] | [Scoreboard mirror] LIACS student team took 5th place (of 96 teams) at ACM Regional Programming Contest: NWERC2014 [Scoreboard] | [Scoreboard mirror] Globe4D from LIACS Multimedia Systems Course won several international awards Current Website | [Archive - Founders, Original Site] Research Grants (ongoing as of December 2020) Computer Aided Medical Diagnosis Using Big Data - NVIDIA, CSC, 1 PhD Data Mining on High Volume Simulation Output - NWO, 3 PhDs Deep Visual Understanding of Paintings and Pictures - NVIDIA, CSC, 1 PhD Making Sense of Illustrated Handwritten Archives - NWO, 2 PhDs, 1 postdoc Influential People Tom Huang on Wikipedia - also see Google Scholar and IEEE PAMI Lifetime Achievement Award and Ranking in CS or Guide to CS Ramesh Jain on Wikipedia - also see Google Scholar and ACM SIGMM Achievement Award Activities (selected) Opening Keynote Speaker at the 10th IAPR Neural Networks and Pattern Recognition Meeting, 2022   (IAPR is the largest pattern recognition scientific society worldwide) One of the 10 most cited papers in the history (out of 18 thousand papers) of the ACM SIG Multimedia, [weblink] (ACM SIGMM Digest, Sept. 2017), The MIR flickr retrieval evaluation, [ACM SIGMM PDF screenshot], December 2019 Editor-in-Chief of the International Journal of Multimedia Information Retrieval (IJMIR), Springer, London | IJMIR homepage Additional info for IJMIR is also here Best Paper Award: 23rd International Conference on MultiMedia Modeling, On the Exploration of Convolutional Fusion Networks for Visual Recognition, 2017 [link] Best Teacher in Computer Science at Leiden University - this is voted by students and then nominated also for best teacher in the Faculty of Science, 2018, [Nomination for Faculty of Science - I represented the CS dept.] Most cited deep learning research paper in the journal, Neurocomputing [Archive link] (2nd highest Google Scholar Impact over all neural network journals worldwide), 2018 Best Paper on List of 100 Top Multimedia Papers of the ACM SIG-Multimedia, 2008 (ACM SIGMM Record) Most cited multimedia research paper worldwide in the highest impact multimedia journal (from ISI Web of Science, Thomson-Reuters), 2009 Most cited multimedia research paper in the 2008 ACM International Conference on Multimedia Information Retrieval, The MIR flickr retrieval evaluation, 2008 Most cited multimedia research paper in the 2010 ACM International Conference on Multimedia Information Retrieval, New Trends and Ideas in Visual Concept Detection, 2010 co-General Chair (with Kiyo Aizawa and Shinichi Satoh) of the ACM International Conference on Multimedia Retrieval (ICMR) | Archive, Japan, 2018     one of the top conferences in graphics and multimedia worldwide - CCF ranking Member of the ACM SIGMM Retreat (planning future of SIGMM) Published over a dozen books and 190 peer-reviewed scientific articles ACM SIGMM Executive Committee Member, 2013-2016 [Archive] Most downloaded paper in Neurocomputing Journal. Deep learning for visual understanding: A review, June 19, 2016 [Archive] 3rd most downloaded paper from ACM SIGMM. DeepIndex for Accurate and Efficient Image Retrieval, March 2016 [Archive] ACM SIGMM Multimedia Steering Committee Member (1 of 6 members), 2011-2013 [Report at SIGMM] | [Archive] General Co-Chair of the IEEE Pacific-Rim Conference on Multimedia, Shanghai, 2010 Invited Speaker, ACM International Workshop on Connected Media, Florence, 2010 Invited Speaker and Panelist, ACM Multimedia Information Retrieval Conference, Philadelphia, 2010 Chair of the Steering Committee for ACM International Conference on Multimedia Retrieval, 2009- [cached] Keynote speaker for the 9th International Conference on Visual Information Systems - VISUAL 2007, 28-29 June 2007, Shanghai, China [Archive.org cache] General Chair of the ACM International Conference on Multimedia Information Retrieval, Vancouver, Canada, October 30-31, 2008 Chair of the Steering Committee for International Conference on Image and Video Retrieval - CIVR (jointly held by ACM, IEEE & IEE), 2007- - co-chair with John Eakins, 2002-2006 Chair of the ACM SIGMM Multimedia Information Retrieval Steering Committee, 2003- Advisory Committee Member for TRECVID 2003-2006. TRECVID was founded as an independent evaluation in 2003. Co-Chair of the ACM Multimedia Technical Awards Committee, 2005 Chair Professor at T",
  "content_length": 33924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:52"
}