{
  "name": "Michael W. Otte",
  "homepage": "http://ottelab.com",
  "status": "success",
  "content": "Michael W. Otte Home Lab and Group Research Publications Fun Stuff Policies Code Links CV Michael W. Otte Neural networks across robot swarms RRT-X replanning algorithm Mo-T Lab netted flight arena Mo-T Lab robot swarm Mo-T Lab robot testbed Sailing a boat through a smart-fluid composed of a robot swarm Neural networks across robot swarms RRT-X replanning algorithm I am an Associate Professor (effective Aug'25) at the University of Maryland College Park. My home department is the Department Aerospace Engineering, and I am also affiliated with the Department of Computer Science by courtesy appointment, and a member of the Maryland Robotics Center. I am the Director of the Motion and Teaming Laboratory. Research Overview My lab does research on the design and analysis of algorithms, methods, and behaviors for autonomous robots and multi-agent systems. The core of our work has focused on finding answers to five overlapping research questions. These appear below, ordered by increasing generality. Each link will take you to a summary of our work in that area. How can multiple robots pool their computational resources to collectively solve their common problems? How can autonomous robots/vehicles efficiently replan in response to changes in the environment, robot, or mission objectives? How can multiple robots work together when communication is limited? How can swarms of autonomous agents collaborate to achieve a complex goal? What are new fun/interesting/useful path and motion planning problems, and how can they be solved? We are particularly interested in application domains where the environment is hazardous and/or changing, and/or where communication is unreliable. Our work combines elements of robotics, multi-agent systems, autonomy, artificial intelligence, planning, control, distributed systems, collective intelligence, emergent behavior, graph theory, information theory, machine learning, Gaussian processes, stochastic processes, and computational geometry. Student Recruiting I am always on the lookout for students that share my interests. If you are interested in joining our lab and doing research in some or all of the areas listed above, then that is wonderful and we should chat! However, please read our recruiting policies before getting in touch. Biography Before joining to UMD in 2018 I held a number of research related positions at a variety of institutions, including: A National Research Council (NRC) Postdoctoral Associate at the U.S. Naval Research Laboratory (NRL). A Research Associate with the Department of Aerospace Engineering Sciences at the University of Colorado at Boulder; in residence at the Control Science Center of Excellence, within the Air Force Research Laboratory. A Postdoctoral Associate with Aerospace Robotics and Embedded Systems Laboratory and the Laboratory for Information and Decision Systems at the Massachusetts Institute of Technology. I received my PhD at the University of Colorado at Boulder, with Correll Lab in the Department of Compute Science and the College of Engineering and Applied Science. Updates and News Oct. 2023: The 2024 Distributed Autonomous Robotic Systems DARS Conference will be held next year on October 28-30, 2024 at Cornell Tech on Roosevelt Island in Manhattan, New York City, USA. It is being organized by Kirstin H. Petersen, Tin Lun Lam, Amanda Prorok, Michael Rubenstein, Petras Swissler, and Nils Napp. I am the Program Chair. Oct. 2023: Sharan Nayak and George Kontoudis are each presenting their work at IEEE/RSJ International Conference on Intelligent Robots and Systems IROS. Sep. 2023: Sharan Nayak has successfully defended his PhD dissertation titled \"Fast Feasible Motion Planning Without Two-Point Boundary Value Solution.'' Congratulations Sharan! Jun. 2023: Ramviyas Parasuraman, Karthik Dantu, Geoffery Hollinger, Robert Fitch, Donald Sofge, and I are organizing a full-day ICRA workshop called Communication Challenges in Multi-Robot Systems: Perception, Coordination, and Learning. May. 2023: Our work by Jae-Kyung Cho et al in collaboration with Seong-Woo Kim is being presented at IEEE International Conference on Robotics and Automation ICRA. May. 2023: Our work by Sharan Nayak et al, which has been accepted to IEEE Transactions on Robotics T-RO, is also being presented at IEEE International Conference on Robotics and Automation ICRA. May. 2023: Our work by George Kontoudis, is being presented at American Controls Conference ACC. May. 2023: I have been awarded the Best Faculty Advisor Award in the Departement of Aerospace Engineering, University of Maryland, 2023. Thanks Everybody! May. 2023: I am the General Chair of the Maryland Robotics Center Research Symposium. This year we have two awesome keynote speakers: Spring Berman from Arizona State University and Pratik Chaudhari from University of Pennsylvania. May. 2023: This year the Maryland Robotics Center Research Symposium will also include an Industry Night with talks and a panel featuring local roboticists. Feb. 2023: Our work by Sharan Nayak is accepted to IEEE Robotics and Automation Letters RA-L. Nov. 2022: Alkesh K. Srivastava and George P. Kontoudis represent the MO-T Lab at the 16th International Symposium on Distributed Autonomous Robotic Systems DARS held in Montbéliard, France. Alkesh and George are coauthors on a paper that was accepted. Jun. 2022: Mohamed Khalid and Mitali Gandhe represent the MO-T Lab at the 15th International Workshop on the Algorithmic Foundations of Robotics WAFR held in College Park, USA. Khalid and Mitali each have a paper accepted. Jun. 2022: Our work by Sharan Nayak is accepted to IEEE Transactions on Robotics T-RO. Jun. 2022: Our work by Loy Mcguire et al, which has been accepted to IEEE Robotics and Automation Letters RAL, is also being presented at IEEE International Conference on Robotics and Automation ICRA. May. 2022: Loy McGuire passes the Aerospace Comprehensive Exam and advances to PhD candidacy. Apr. 2022: Ollie Rodriguez passes the Aerospace Comprehensive Exam and advances to PhD candidacy. Jan. 2022: The 15th International Workshop on the Algorithmic Foundations of Robotics WAFR will be held on June 22-24, 2022 at the University of Maryland, College Park. I am a Co-Chair. Nov. 2021: Sharan Nayak and Paul Motter represent the MO-T Lab at the International Symposium on Experimental Robotics ISER held in La Valletta, Malta. Sharan and Paul each have a paper accepted. The conference has been held a year late due to the Covid-19 Pandemic. Nov. 2021: I am appearing on an invited panel at the IEEE International Symposium on Multi-Robot and Multi-Agent Systems MRS held at the University of Cambridge, United Kingdom. Jun. 2021: Alkesh Kumar Srivastava will begin work in colaberation with U.S. Naval Research Lab. Jun. 2021: Alex Mendelsohn will begin work in colaberation with U.S. Naval Research Lab. May. 2021: Our work by Loy McGuire is accepted to IEEE Robotics and Automation Letters RAL. May. 2021: Dalan Loudermilk will begin work in colaberation with NASA Langley Research Center. May. 2021: Sharan Nayak begins an internship with NASA Jet Propulsion Laboratory. Dec. 2020: Mohamed Khalid passes the Aerospace Comprehensive Exam and advances to PhD candidacy. Dec. 2020: Sharan Nayak passes the Aerospace Comprehensive Exam and advances to PhD candidacy. Dec. 2020: Sharan Nayak wins the Graduate School's Outstanding Research Assistant Award. Dec. 2020: Mo-T Lab exchange student Aditya Savio Paul presents work at International Astronautical Congress IAC, held virtually this year due to Covid-19. Jun. 2020: Our work by Sharan Nayak, Mohamed Khalid, et al, which has been accepted to IEEE Robotics and Automation Letters RAL, is also being presented at IEEE International Conference on Robotics and Automation ICRA. This year the conference is virtual due to Covid-19. Aug. 2020: Dalan Lourdermilk begins working on our Northrop Grumman project. Jun. 2020: Summer interns begins working on our Northrop Grumman project. May. 2020: Mo-T Lab exchange student Aditya Savio Paul successfully defends his M.S. Thesis at the University of Tartu, Estonia. I am Aditya's external advisor. Apr. 2020: Sharan Nayak wins the UMD Clark Fellowship. Aug. 2020: Ryan Ernandis successfully defends his M.S. Thesis and is moving on to a new job at Astrobotic. Jan. 2020: My research group at UMD is named the Motion and Teaming Laboratory (Mo-T Lab). Aug. 2019: Manas Gupta represents our lab by presenting our paper at IEEE International Symposium on Multi-Robot and Multi-Agent Systems MRS, held virtually this year due to Covid-19. Our paper was one of three papers nominated for a best paper award. Jun. 2019: Ryan Ernandis is spending another summer in residence at NASA Langley Research Center. Sep. 2018: Sharan Nayak, Mohamed Khalid, et al begin work on our U.S. Air Force Research Lab project. Jun. 2018: Ryan Ernandis is spending a summer in residence at NASA Langley Research Center. Mar. 2018: Manas Gupta, Shivang Patel, Pranav Dhulipala , et al begin working on our DARPA project. Check out the YouTube Video describing our work with Group Mind Neural Networks on Robotic Swarms. I was guest editor of the Autonomous Robots (Springer) journal special issue titled: Robot Communication in the Wild: Real-World Problems, Systems, and Methods. This is now published, here is my editorial. Check out the workshop we organized at Robots Science and Systems (RSS 2017): Robot Communication in the Wild: Meeting the Challenges of Real-World Systems It was on the interesting problems at the intersection of robotics/autonomy and communication! Contact Information Michael Otte Department of Aerospace Engineering 3179 Glenn L. Martin Hall Bldg 4298 Campus Drive University of Maryland College Park, MD 20742 {my last name} @umd.edu Copyright 2008-2025, Michael W. Otte",
  "content_length": 9851,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:02"
}