{
  "name": "Michael A. Specter",
  "homepage": "https://mikespecter.com",
  "status": "success",
  "content": "Michael A. Specter Office: 1007 CODA Assistant Professor, Computer Science Assistant Professor, Cybersecurity & Privacy Georgia Tech Senior Research Scientist, Google My research focuses on systems security and applied cryptography, particularly in areas relevant to public policy. Topics that interest me include surveillance, cryptographic accountability, content moderation, misinformation, and elections security. Check out my publications page, or the course I teach to learn more. I have a PhD in Electrical Engineering and Computer Science from MIT, where I was lucky to be advised by Gerry Sussman and Danny Weitzner. My thesis committee included Matthew D. Green, Joan Feigenbaum, and Ron Rivest. Prior to becoming a graduate student, I was research staff at MIT’s Lincoln Laboratory. I am looking for PhD students to join my lab! In general, I work best with those that are security researchers first (applied cryptography and systems security), but have a demonstrable interest in some form of public policy. Please apply to Georgia Tech’s Computer Science PhD program and list me as an advisor! I assure you, I will see any candidate that applies and lists my name. If you are a current Georgia Tech student, or have interest in joining as a postdoc, please fill out this form! teaching GT CS8803, Spring 2025: Intro to Information Security GT CS8803, Spring 2024: Security, Privacy, and Democracy GT CS8803, Fall 2023: Security, Privacy, and Democracy MIT 6.885, Spring 2022: Critical Perspectives on Security and Privacy Architectures program committees NDSS: 2026 ACM CS&LAW: 2025 IEEE S&P: 2023, 2022 Usenix Security: 2023, 2022 Euro S&P: 2021 press, awards, & other work Selected Press: My research on elections security has been featured in the New York Times (twice), the New Yorker, CNN, Vice, Bloomberg, Fortune, The Economist, and others. Awards: I earned a research award from the Elections Verification Network, and an EFF Pioneer Award for my joint work on encryption policy, which has been used in congressional testimony on surveillance and law enforcement. Outside of my academic work, I’ve written for Lawfare, and coauthored the EFF’s Brief to the Supreme Court on the need to reform the Computer Fraud and Abuse Act. I enjoy finding bugs in my spare time, and am a contributor to Google’s Linux kernel fuzzer Syzkaller. news Mar 30, 2025 Published an open dataset of FTC Privacy actions, and the FTC’s reliance on independent security research. Mar 30, 2025 Joined the PC of NDSS 2026! Jan 06, 2024 Published a refresh of the Android security threat model paper, the official source from Google on how Android security works. Aug 01, 2023 I have joined Georgia Tech full time as a new Assistant Professor! Sep 16, 2020 Our work on deniability in email “Keyforge: Mitigating Email Breaches with Forward-Forgeable Signatures” was accepted to Usenix Security ‘21 (Blogpost, Paper) Sep 15, 2020 Our security analysis of OmniBallot was accepted to Usenix Security ‘21 (Blogpost, Paper) Aug 10, 2020 I presented our security analysis of Voatz at Defcon! (Presentation, Usenix Paper) Jul 20, 2020 I coauthored an EFF-led amicus brief to the U.S. Supreme Court in the Van Buren case describing the need to limit the Computer Fraud and Abuse Act (Press Release, Brief) Jul 14, 2020 Our security analysis of Voatz was accepted to Usenix Security 2020! latest posts Sep 15, 2020 KeyForge & TimeForge: Fixing Email Deniability Jan 24, 2017 On Deniability and Duress selected publications This is only a small subset, see my Google Scholar for more up-to-date details, or my full CV. ACM CCS Fingerprinting SDKs for Mobile Apps and Where to Find Them: Understanding the Market for Device Fingerprinting Michael A. Specter, Mihai Christodorescu, Abbie Farr, Bo Ma, and Robin Lassonde In Proceedings of the 2025 ACM SIGSAC Conference on Computer and Communications Security (ACM CCS ‘25) , 2025 Bibtex PDF @inproceedings{specter2025fingerprintingsdksmobileapps, title = {Fingerprinting SDKs for Mobile Apps and Where to Find Them: Understanding the Market for Device Fingerprinting}, author = {Specter, Michael A. and Christodorescu, Mihai and Farr, Abbie and Ma, Bo and Lassonde, Robin}, year = {2025}, eprint = {2506.22639}, publisher = {Association for Computing Machinery}, booktitle = {Proceedings of the 2025 ACM SIGSAC Conference on Computer and Communications Security (ACM CCS `25)}, archiveprefix = {arXiv}, primaryclass = {cs.CR}, url = {https://arxiv.org/abs/2506.22639}, selected = true, options = {extsym={*}}, keywords = {peer} } USENIX Security Analysis of the Democracy Live Online Voting System Michael A. Specter, and J. Alex Halderman In 30th USENIX Security Symposium (USENIX Security 21) , 2021 Press: The New York Times, Ars Technica, Ars Technica (again), AAAS Abstract Bibtex PDF Democracy Live’s OmniBallot platform is a web-based system for blank ballot delivery, ballot marking, and online voting. Three states—Delaware, West Virginia, and New Jersey—recently announced that they would allow certain voters to cast votes online using OmniBallot, but, despite the well established risks of Internet voting, the system has never before undergone a public, independent security review. We reverse engineered the client-side portion of OmniBallot, as used in Delaware, in order to detail the system’s operation and analyze its security. We find that OmniBallot uses a simplistic approach to Internet voting that is vulnerable to vote manipulation by malware on the voter’s device and by insiders or other attackers who can compromise Democracy Live, Amazon, Google, or Cloudflare. In addition, Democracy Live, which had no privacy policy prior to our work, receives sensitive personally identifiable information—including the voter’s identity, ballot selections, and browser fingerprint—that could be used to target political ads or disinformation campaigns. Even when OmniBallot is used to mark ballots that will be printed and returned in the mail, the software sends the voter’s identity and ballot choices to Democracy Live, an unnecessary risk that jeopardizes the secret ballot. We recommend changes to make the platform safer for ballot delivery and marking. However, we conclude that using OmniBallot for electronic ballot return represents a severe risk to election security and could allow attackers to alter election results without detection. In response to our findings, Delaware and New Jersey have halted use of OmniBallot, but it remains available in other jurisdictions, as do similar online voting methods that are likely to face the same serious risks. @inproceedings{specterSecurityAnalysisDemocracy2020, title = {Security {Analysis} of the {Democracy} {Live} {Online} {Voting} {System}}, author = {Specter, Michael A. and Halderman, J. Alex}, selected = true, booktitle = {30th USENIX Security Symposium (USENIX Security 21)}, year = {2021}, note = { Press: <a href=\"https://www.nytimes.com/2020/06/07/us/politics/remote-voting-hacking-coronavirus.html\">The New York Times</a>, <a href=\"https://arstechnica.com/tech-policy/2020/06/researchers-say-online-voting-tech-used-in-5-states-is-fatally-flawed\">Ars Technica</a>, <a href=\"https://arstechnica.com/tech-policy/2020/09/why-experts-are-overwhelmingly-skeptical-of-online-voting/\">Ars Technica (again)</a>, <a href=\"https://www.aaas.org/news/scientific-experts-delaware-internet-voting\">AAAS</a> } } USENIX KeyForge: Mitigating Email Breaches with Forward-Forgeable Signatures Michael A. Specter, Sunoo Park, and Matthew Green In 30th USENIX Security Symposium (USENIX Security 21) , 2021 Abstract Bibtex PDF Email breaches are commonplace, and they expose a wealth of personal, business, and political data whose release may have devastating consequences. Such damage is compounded by email’s strong attributability: today, any attacker who gains access to your email can easily prove to others that the stolen messages are authentic, a property arising from a necessary anti-spam/anti-spoofing protocol called DKIM. This greatly increases attackers’ capacity to do harm by selling the stolen information to third parties, blackmail, or publicly releasing intimate or sensitive messages — all with built-in cryptographic proof of authenticity. This paper introduces non-attributable email, which guarantees that a wide class of adversaries are unable to convince discerning third parties of the authenticity of stolen emails. We formally define non-attributability, and present two system proposals — KeyForge and TimeForge — that provably achieve non-attributability while maintaining the important spam/spoofing protections currently provided by DKIM. Finally, we implement both and evaluate their speed and band- width performance overhead. We demonstrate the practicality of KeyForge, which achieves reasonable verification overhead while signing faster and requiring 42% less bandwidth per message than DKIM’s RSA-2048. @inproceedings{specterKeyForgeMitigatingEmail2019a, selected = true, title = {{KeyForge}: {Mitigating} {Email} {Breaches} with {Forward}-{Forgeable} {Signatures}}, shorttitle = {{KeyForge}}, booktitle = {30th USENIX Security Symposium (USENIX Security 21)}, author = {Specter, Michael A. and Park, Sunoo and Green, Matthew}, url = {https://www.usenix.org/conference/usenixsecurity21/presentation/specter-keyforge}, publisher = {USENIX Association}, isbn = {978-1-939133-24-3}, pages = {1755--1773}, year = {2021} } USENIX The Ballot is Busted Before the Blockchain: A Security Analysis of Voatz, the First Internet Voting Application Used in US Federal Elections Michael A. Specter, James Koppel, and Daniel Weitnzer In 29th USENIX Security Symposium (USENIX Security 20) , 2020 Acceptance Rate: 16.1% Press: The New York Times, The Verge, Vice, Vice (again), CNN, Fortune, The Economist, FiveThirtyEight, Commended in Senator Ron Wyden’s Keynote at DEFCON 🏆 2023 EVN Research Award Abstract Bibtex PDF 2023 Research Award from the Election Verification Network",
  "content_length": 17139,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:36"
}