{
  "name": "Michael Brünig",
  "homepage": "http://researchers.uq.edu.au/researcher/5052",
  "status": "success",
  "content": "Professor Michael Bruenig | UQ Experts Skip to menu Skip to content Skip to footer Professor Michael Bruenig Email: m.bruenig@uq.edu.au Positions Head of School of Information Technology and Electrical Engineering School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Head of School, School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Professor Michael Brünig is the Head of School of Electrical Engineering and Computer Science (EECS) at The University of Queensland (UQ), a role he took over in 2016 but with an interruption from 2019-2021 to lead UQ’s Business School. Prof Brünig is a strategic thinker, an innovation expert, and an experienced change manager with international experience from Europe, the United States, and Australia. He is passionate about building strong performing teams and has experience in bringing large projects with substantial funding to fruition, igniting entrepreneurial spirit in students and staff, and driving impact from research through partnering, commercialisation and spin-off companies. Before joining UQ, Prof Brünig worked with the CSIRO. As an executive manager with the organisation, he led an initiative to establish a $140m National Research Flagship on Digital Productivity and later guided the business through a merger to create Data61, a national research powerhouse focusing on data innovation. Professor Brünig started his career in research and development in the automotive industry in Germany and Silicon Valley in the United States after completing his PhD at RWTH Aachen, Germany. Prof Brünig is a sought-after expert with respect to research translation. He sits on multiple boards as non-executive director, is technical advisor to start-up companies in Australia and is frequently consulted as a subject matter expert. Within UQ, Prof Brünig has helped to create UQ Ventures and UQ Innovate, units that foster entrepreneurship among students and academics and provide the creative environment to be successful. Under Prof Brünig’s leadership, UQ started multiple significant initiatives, including UQ Cyber, the National Industry 4.0 Energy Testlab, the AI Initiative and with partners the QLD Government AI Hub. He is also highly influential in shaping UQ’s curriculum. He initiated the Bachelor of Computer Science, the Master of Cyber Security that is modelled using the US National Initiative for Cybersecurity Education framework and UQ’s first full online Master of Business Analytics. He also was a key contributor to creating the Graduate Certificate in Clinical Informatics and Digital Health. Read more Read less Availability Professor Michael Bruenig is: Not available for supervision Media expert Qualifications Masters (Coursework) of Science, Rheinisch Westfalische Technische Hochschule Aachen Doctor of Philosophy, Rheinisch Westfalische Technische Hochschule Aachen Works Search Professor Michael Bruenig’s works on UQ eSpace All (50) Journal Article (16) Other Outputs (5) Conference Publication (29) 2024 Journal Article Under-canopy navigation using aerial lidar maps de Lima, Lucas Carvalho, Lawrance, Nicholas, Khosoussi, Kasra, Borges, Paulo and Brünig, Michael (2024). Under-canopy navigation using aerial lidar maps. IEEE Robotics and Automation Letters, 9 (8), 7031-7038. doi: 10.1109/lra.2024.3417115 Under-canopy navigation using aerial lidar maps 2024 Journal Article Terahertz nanoscopy: advances, challenges, and the road ahead Guo, Xiao, Bertling, Karl, Donose, Bogdan C., Brünig, Michael, Cernescu, Adrian, Govyadinov, Alexander A. and Rakić, Aleksandar D. (2024). Terahertz nanoscopy: advances, challenges, and the road ahead. Applied Physics Reviews, 11 (2) 021306. doi: 10.1063/5.0189061 Terahertz nanoscopy: advances, challenges, and the road ahead 2024 Journal Article Terahertz in vivo imaging of human skin: toward detection of abnormal skin pathologies Qi, X., Bertling, K., Torniainen, J., Kong, F., Gillespie, T., Primiero, C., Stark, M. S., Dean, P., Indjin, D., Li, L. H., Linfield, E. H., Davies, A. G., Brünig, M., Mills, T., Rosendahl, C., Soyer, H. P. and Rakić, A. D. (2024). Terahertz in vivo imaging of human skin: toward detection of abnormal skin pathologies. APL Bioengineering, 8 (1) 016117, 016117. doi: 10.1063/5.0190573 Terahertz in vivo imaging of human skin: toward detection of abnormal skin pathologies 2023 Journal Article Air-ground collaborative localisation in forests using lidar canopy maps de Lima, Lucas Carvalho, Ramezani, Milad, Borges, Paulo and Brunig, Michael (2023). Air-ground collaborative localisation in forests using lidar canopy maps. IEEE Robotics and Automation Letters, 8 (3), 1818-1825. doi: 10.1109/lra.2023.3243498 Air-ground collaborative localisation in forests using lidar canopy maps 2022 Conference Publication Adaptive Sequential Composition for Robot Behaviours Tam, Benjamin, Kottege, Navinda, Hudson, Nicolas and Brunig, Michael (2022). Adaptive Sequential Composition for Robot Behaviours. 2022 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), Kyoto, Japan, 23-27 October 2022. Piscataway, NJ United States: Institute of Electrical and Electronics Engineers. doi: 10.1109/iros47612.2022.9982012 Adaptive Sequential Composition for Robot Behaviours 2022 Journal Article Melimine-modified 3D-printed polycaprolactone scaffolds for the prevention of biofilm-related biomaterial infections Cometta, Silvia, Jones, Robert T., Juárez-Saldivar, Alfredo, Donose, Bogdan C., Yasir, Muhammad, Bock, Nathalie, Dargaville, Tim R., Bertling, Karl, Brünig, Michael, Rakić, Aleksandar D., Willcox, Mark and Hutmacher, Dietmar W. (2022). Melimine-modified 3D-printed polycaprolactone scaffolds for the prevention of biofilm-related biomaterial infections. ACS Nano, 16 (10), 16497-16512. doi: 10.1021/acsnano.2c05812 Melimine-modified 3D-printed polycaprolactone scaffolds for the prevention of biofilm-related biomaterial infections 2022 Other Outputs Force sensing device Pounds, Pauline, Davis, Edwin and Bruenig, Michael (2022). Force sensing device. AU2017365703B2. Force sensing device 2021 Other Outputs Force sensing device Pounds, Pauline, Davis, Edwin and Bruenig, Michael (2021). Force sensing device. CN110023730B. Force sensing device 2021 Journal Article Observation of optical feedback dynamics in single-mode terahertz quantum cascade lasers: Transient instabilities Qi, Xiaoqiong, Bertling, Karl, Taimre, Thomas, Agnew, Gary, Lim, Yah Leng, Gillespie, Tim, Robinson, Ashley, Brünig, Michael, Demić, Aleksandar, Dean, Paul, Li, Lian He, Linfield, Edmund H., Davies, A. Giles, Indjin, Dragan and Rakić, Aleksandar D. (2021). Observation of optical feedback dynamics in single-mode terahertz quantum cascade lasers: Transient instabilities. Physical Review A, 103 (3) 033504, 033504-1-033504-7. doi: 10.1103/physreva.103.033504 Observation of optical feedback dynamics in single-mode terahertz quantum cascade lasers: Transient instabilities 2020 Other Outputs Force sensing device Pounds, Pauline, Davis, Edwin and Bruenig, Michael (2020). Force sensing device. EP3545277A4. Force sensing device 2019 Other Outputs Force sensing device Pounds, Pauline, Davis, Edwin and Bruenig, Michael (2019). Force sensing device. 16463110. Force sensing device 2018 Other Outputs Force sensing device Pounds, Pauline, Davis, Edwin and Bruenig, Michael (2018). Force sensing device. WO2018094454A1. Force sensing device 2014 Journal Article Estimating fire weather indices via semantic reasoning over wireless sensor network data streams Gao, Lianli, Bruenig, Michael and Hunter, Jane (2014). Estimating fire weather indices via semantic reasoning over wireless sensor network data streams. International Journal of Web and Semantic Technology, 5 (4), 1-20. doi: 10.5121/ijwest.2014.5401 Estimating fire weather indices via semantic reasoning over wireless sensor network data streams 2014 Conference Publication Radio diversity for reliable communication in sensor networks Kusy, Branislav, Abbott, David, Richter, Christian, Huynh, Cong, Afanasyev, Mikhail, Hu, Wen, Bruenig, Michael, Ostry, Diethelm and Jurdak, Raja (2014). Radio diversity for reliable communication in sensor networks. New York, NY United States: ACM Special Interest Group. doi: 10.1145/2530291 Radio diversity for reliable communication in sensor networks 2013 Journal Article DTLS based security and two-way authentication for the Internet of Things Kothmayr, Thomas, Schmitt, Corinna, Hu, Wen, Bruenig, Michael and Carle, Georg (2013). DTLS based security and two-way authentication for the Internet of Things. Ad Hoc Networks, 11 (8), 2710-2723. doi: 10.1016/j.adhoc.2013.05.003 DTLS based security and two-way authentication for the Internet of Things 2013 Conference Publication Semantic-based detection of segment outliers and unusual events for wireless sensor networks Gao, Lianli, Bruenig, Michael and Hunter, Jane (2013). Semantic-based detection of segment outliers and unusual events for wireless sensor networks. ICIQ 2013: 18th International Conference on Information Quality, Little Rock, AR, USA, 7-9 November, 2013. Cambridge, MA, USA: Massachusetts Institute of Technology. Semantic-based detection of segment outliers and unusual events for wireless sensor networks 2012 Conference Publication Low power or high performance? A tradeoff whose time has come (and nearly gone) Ko, Jeonggil, Klues, Kevin, Richter, Christian, Hofer, Wanja, Kusy, Branislav, Bruenig, Michael, Schmid, Thomas, Wang, Qiang, Dutta, Prabal and Terzis, Andreas (2012). Low power or high performance? A tradeoff whose time has come (and nearly gone). doi: 10.1007/978-3-642-28169-3_7 Low power or high performance? A tradeoff whose time has come (and nearly gone) 2012 Conference Publication A DTLS based end-to-end security architecture for the Internet of Things with two-way authentication Kothmayr, Thomas",
  "content_length": 13390,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:47"
}