{
  "name": "Michaël Hauspie",
  "homepage": "https://pro.univ-lille.fr/michael-hauspie",
  "status": "success",
  "content": "Michaël HAUSPIE - Université de Lille Maître de conférences-HDR CNU : SECTION 27 - INFORMATIQUE Laboratoire / équipe UMR 9189 - CENTRE DE RECHERCHE EN INFORMATIQUE, SIGNAL ET AUTOMATIQUE DE LILLE Page Orcid du membre (Ouverture dans une nouvelle fenêtre) HAL michael-hauspie (Ouverture dans une nouvelle fenêtre) michael.hauspie[chez]univ-lille[point].fr 03.62.53.15.49 (IRCICA) - 03.59.63.22.38 (IUT) IRCICA 226 - IUT 4A49 Composantes, facultés INSTITUT UNIVERSITAIRE DE TECHNOLOGIE A Spécialité Informatique Domaines de recherche Systèmes embarqués, sécurité Présentation Je suis maître de conférences depuis 2006, habilité à diriger des recherches depuis 2014. Ma thèse était consacrée aux réseaux sans fil auto-organisés et aux réseaux de capteurs. Depuis, je me suis plus particulièrement intéressé à la conception et à la sécurité des systèmes, en particulier des systèmes embarqués. Mes activités de recherche actuelles portent sur la conception de systèmes de détection d'intrusions réseau, sur la co-conception logicielle/matérielle et sur la conception de systèmes dont les caractéristiques peuvent faire l'objet de preuve de bon fonctionnement. Mes activités d'enseignements sont centrées sur la programmation et l'administration système, en BUT Informatique, principalement en 2ième et 3ième année. Je suis, depuis 2022, responsable de l'axe \"Objets Connectés\" de l'IRCICA (UAR CNRS 3380) ; mes communications sont généralement signées avec PGP. L'empreinte de ma clé est:  \t 9A33 192E 0B7F 6AC4 DCDB EC11 E10C 62E9 75B4 06A8 mon éditeur de prédilection est GNU Emacs, ma configuration est disponible sur l'instance Gitlab de l'université ; je suis également présent sur Mastodon. J'y parle principalement sécurité, enseignement et vélo. Enfin... en réalité, je relaie surtout des messages de gens plus intéressants que moi.",
  "content_length": 1836,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:12"
}