{
  "name": "Michael Bowling",
  "homepage": "https://webdocs.cs.ualberta.ca/~bowling",
  "status": "success",
  "content": "Michael Bowling's Webpage Michael Bowling Professor Department of Computing Science University of Alberta Edmonton, Alberta Canada T6G 2E8 Office: 339 Athabasca Hall Email: mbowling *AT* ualberta.ca » Main Page › Publications › Research › Calendar › CV › Personal About Me I am a full professor at the University of Alberta. My research focuses on machine learning, games, and robotics, and I'm particularly fascinated by the problem of how computers can learn to play games through experience. I am the leader of the Computer Poker Research Group, which has built some of the best poker playing programs on the planet. The programs have won international AI competitions as well as being the first to beat top professional players in a meaningful competition. I am also a principal investigator in the Reinforcement Learning and Artificial Intelligence (RLAI) group and the Alberta Ingenuity Centre for Machine Learning (AICML). I completed my Ph.D. at Carnegie Mellon University, where my dissertation was focused on multiagent learning and I was extensively involved in the RoboCup initiative. My research has been featured on the television programs Scientific American Frontiers, National Geographic Today, and Discovery Channel Canada, as well appearing in the New York Times, Wired, on CBC and BBC radio, and twice in exhibits at the Smithsonian Museums in Washington, DC. top Students Current Students and Post-Docs John Martin (PDF) Anna Koop (PhD) Matej Moravcik (PhD) Trevor Davis (PhD; MSc, 2015) Zaheen Ahmad (PhD) Montaser Mohammadelamen (PhD) Fatima Gallardo Deavelouis (MSc) Alexander Trudeau (MSc) Bradley Burega (MSc) Esra'a Saleh (MSc) Former Students and Post-Docs Dustin Morrill (PhD 2022; MSc, 2016) Martin Schmid (PhD, 2021) Yash Satsangi (PDF, 2019-2021) Paniz Behboudian (MSc, 2020) Arash Pourzarabi (MSc, 2020) Marlos C. Machado (PhD, 2019) Taher Jafferjee (MSc, 2019) Fushan Li (MSc, 2019) Zach Holland (MSc, 2018) Neil Burch (PhD, 2017) Viliam Lisy (PDF, 2015-2017) Michael Johanson (PhD, 2016; MSc, 2007) James Neufeld (PhD, 2016; MSc, 2008) Nolan Bard (PhD 2016; MSc, 2008) Martha White (PhD, 2014; MSc, 2009) Srinivasan Sriram (MSc, 2014) Ujjwal Das Gupta (MSc, 2014) Chris Rayner (PhD, 2014) Joshua Davidson (MSc, 2014) Marc Bellemare (PhD, 2013) Mostafa Vafadoost (MSc, 2013) Chris Archibald (PDF, 2012-2013) Joel Veness (PDF, 2011-2012) Arash Afkanpour (PhD, 2013) Marc Lanctot (PhD, 2012) Parisa Mazrooei (MSc, 2012) Michael Joya (MSc, 2012) Yavar Nadaf (MSc, 2010) Kevin Waugh (MSc, 2009) Dave Schnizlein (MSc, 2009) Martin Zinkevich (PDF, 2005-2007) Yaakov Engel (PDF, 2005-2007) Dana Wilkinson (PhD, 2007) Tao Wang (PhD, 2007) Armita Kaboli (MSc, 2007) Alborz Geramifard (MSc, 2006) Peter McCracken (MSc, 2005) Valid XHTML 1.0 Strict Valid CSS 2 Website design adapted from Blue Haze by haran Thanks to Open Source Web Development",
  "content_length": 2868,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:44"
}