{
  "name": "Michael Szell",
  "homepage": "http://michael.szell.net",
  "status": "success",
  "content": "Michael Szell's professional homepage Michael Szell Publications Activities Projects Media Teaching Hi! I am associate professor at NERDS (ITU Copenhagen) researching sustainable mobility and bicycle networks through network analysis, data science, and data visualization. Curriculum Vitae News 2025-07-01Paper published in Environment and Planning B on BikeNodePlanner: A data-driven decision support tool for bicycle node network planning. See also the project page. 2025-06-19Book chapter published in Compendium of Urban Complexity (Springer) on Urban Mobility. 2025-05-22My PhD student Ane Rahbek Vierø defended her thesis Network analysis of Denmark’s bicycle infrastructure. See also the NERDS News. 2025-05-19Paper published in Geographical Analysis on Network Analysis of the Danish Bicycle Infrastructure. See also the project page. Toggle all news 2025-04-28Paper published in Scientific Reports on CoolWalks for active mobility in urban street networks. 2025-03-31My PhD student Anastassia Vybornova defended her thesis Urban Data Science for Sustainable Mobility. See also the NERDS News. 2025-03-04Paper published in PNAS on Urban highways are barriers to social ties. 2025-02-05Paper published in Journal of the Royal Society Interface on Cohesive urban bicycle infrastructure design through optimal transport routing in multilayer networks. 2024-12-19Paper published in Geoforum Perspektiv on Teaching spatial data science. See also: Course materials 2024-10-22Correspondence published in Nature on explaining AI's Physics Nobel prize with data. 2024-08-14Paper published in Journal of Open Source Software (JOSS) superblockify: A Python Package for Automated Generation, Visualization, and Analysis of Potential Superblocks in Cities. See also: superblockify.city 2024-04-05Paper published in Geographical Analysis on How Good Is Open Bicycle Network Data? A Countrywide Case Study of Denmark. 2024-01-22I won the EU Horizon grant JUST STREETS together with 31 partners. See also the NERDS News. 2023-09-15Review paper published in Computers, Environment and Urban Systems on Sidewalk networks. 2023-06-21Paper published in Environment and Planning B on BikeDNA: A tool for bicycle infrastructure data and network assessment. See also the project page. 2023-04-19Paper published in EPJ Data Science on Revealing the determinants of gender inequality in urban cycling with large-scale data. 2023-02-21New affiliation at AI Pioneer Centre 2022-12-01Paper published in Transport Findings on Computational Desire Line Analysis of Cyclists on the Dybbølsbro Intersection in Copenhagen. 2022-11-18Mastodon instance datasci.social set up, to provide a platform for researchers in human-centric data science. 2022-11-03GrowBike.Net was shortlisted at the 2022 CityVis competition, category \"Research\". 2022-10-22Paper published in Environment and Planning B on Data-driven micromobility network planning for demand and safety. See also the project page. 2022-07-20Paper published in Environment and Planning B on Multimodal urban mobility and multilayer transport networks. 2022-06-02Our research group NERDS won the Research Environment of the Year 2022 award. See also the Forskerforum article (in Danish). 2022-04-28Paper published in EPJ Data Science on Identifying urban features for vulnerable road user safety in Europe. See also the blog post. 2022-04-26Paper published in Scientific Reports on Growing urban bicycle networks. See also the project page. 2022-03-22Paper published in Geographical Analysis on Automated Detection of Missing Links in Bicycle Networks. See also the project page. 2021-11-01New affiliation at ISI Foundation 2021-07-07GrowBike.Net released 2021-06-07Paper published in ICWSM 2021 on Multilayer Graph Association Rules for Link Prediction. 2021-05-26Paper published in Nature on The universal visitation law of human mobility. See also the project page. 2021-01-06Taxonomy of Urban Bicycle Network Approaches released 2020-12-16Paper published in Royal Society Open Science on Data-driven strategies for optimal bicycle network growth 2020-10-01Promotion to associate professor at ITU Copenhagen 2020-06-10Paper published in Transport Findings on multiplex transport networks 2019-12-12Published editorial and completed Special Issue in International Journal of Geo-information:Human-Centric Data Science for Urban StudiesEditors: Resch, Szell 2019-09-05What the Street?! added to Futurium's permanent exhibition 2019-08-07Joined editorial board of International Journal of Geo-information 2019-08-01New affiliation at ISI Foundation 2019-05-09Postdoc wanted at NERDS 2019-04-24New research group founded: NEtwoRks, Data, and Society (NERDS) at ITU Copenhagen 2019-02-01New position at ITU Copenhagen 2019-01-08Paper published in Nature Reviews Physics on taking census of physics 2019-01-07Call for papers at PLOS ONE:Science of StoriesSubmission deadline: 2019-06-14 2018-11-01Paper published in Nature Physics on interdisciplinarity and the Nobel Prize 2018-10-17What the Street!? visualization won the City Vis 2018 competition in Art & Advocacy 2018-03-29Paper published in Urban Planning 2018-03-14Tribute to Stephen Hawking published 2018-01-09Joined Editorial Board of Complex Systems 2017-12-15Joined Editorial Board of PLOS ONE 2017-12-05Call for papers at International Journal of Geo-information:Human-Centric Data Science for Urban StudiesEditors: Resch, SzellSubmission deadline: 2019-04-30 2017-05-04Call for papers at EPJ Data Science:Individual and Collective Human Mobility:Description, Modelling, PredictionEditors: Simini, Ghoshal, Pappalardo, Szell, HövelSubmission deadline (extended): 2018-01-31 Current research Watch my keynote to learn about my current research: Bio Michael Szell is associate professor in Data Science at the NEtwoRks, Data, and Society (NERDS) research group which he co-founded at IT University of Copenhagen. He is also external faculty at the Complexity Science Hub and affiliate at the Pioneer Centre for Artificial Intelligence. With an interdisciplinary background in network science and complex systems, Michael is quantitatively researching bicycle networks and sustainable mobility following an urban/geospatial data science approach. Along the way he develops methods and open-source tools for sustainable transport planning. His research is motivated by transport justice, rejecting car-centrism, towards a human-centric, livable future. For that goal, Michael is also co-developing interactive data visualization platforms such as What the Street!?. Apart from these efforts, he is co-developer of the award-winning massive multiplayer online game Pardus. Research interests Primary: Urban/Geospatial Data Science, Sustainable mobility, Bicycle networks Secondary: Network science, Complex systems, Social networks, Data visualization Research highlights HighwayBarriers2025 BicycleNetworks2022 HumanMobility2021 NobelPrizes2018 CitationNetworks2015 TaxiSharing2014 SocialNetworks2010 Data visualization highlights Education 2012 / 03Ph.D. in Physics, University of Vienna Ph.D. Thesis Advisors: Stefan Thurner, Christoph Dellago 2007 / 10M.Sc. in Technical Mathematics with focus on computer science, Vienna University of Technology M.Sc. Thesis Current positions since2020 / 10Associate professor, Data Science Section, IT University of Copenhagen since2023 / 02Affiliate, Pioneer Centre for Artificial Intelligence since2017 / 04External faculty, Complexity Science Hub since2006 / 09Founder and manager of Bayer & Szell OG since2004 / 07Developer and administrator of the Massive Multiplayer Online Game Pardus Past positions 2024 / 102021 / 11External researcher, ISI Foundation 2020 / 092019 / 02Assistant professor, Computer Science Department, IT University of Copenhagen 2020 / 072019 / 08External researcher, ISI Foundation 2019 / 012017 / 10Assistant professor, Department of Network and Data Science, Central European University 2019 / 012017 / 09Researcher, Centre for Economic and Regional Studies, Hungarian Academy of Sciences 2019 / 012016 / 09Adjunct visiting professor, Center for Complex Network Research, Northeastern University 2017 / 092016 / 10Visiting research fellow, Center for Network Science, Central European University 2017 / 092016 / 09Research fellow, Centre for Social Sciences, Hungarian Academy of Sciences 2016 / 122016 / 09Researcher in residence, moovel lab 2016 / 092014 / 07Postdoctoral research associate, Center for Complex Network Research, Northeastern University 2014 / 072012 / 04Postdoctoral research fellow, Senseable City Laboratory, Massachusetts Institute of Technology 2011 / 122009 / 01Research assistant, Section for Science of Complex Systems, Medical University of Vienna michael.szell.net  |  Last update 2025-11-28  |  Source code ITU Copenhagen, Rued Langgaards Vej 7, 2300 København, DK",
  "content_length": 8849,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:57"
}