{
  "name": "Michael S. Kearns",
  "homepage": "http://www.cis.upenn.edu/~mkearns",
  "status": "success",
  "content": "Home Page for Professor Michael Kearns, University of Pennsylvania MICHAEL KEARNS Professor and National Center Chair Department of Computer and Information Science at the University of Pennsylvania Founding Director, Warren Center for Network and Data Sciences Founder and former Director, Penn program in Networked and Social Systems Engineering Secondary Appointments in Economics, Statistics and Data Science (Wharton) and Operations, Information and Decisions (Wharton) Mailing Address: 509 Amy Gutmann Hall, 3317 Chestnut Street, Philadelphia, PA 19104 Phone: 215.898.7888 (rarely answered, prefer email) Email: mkearns@cis.upenn.edu Amazon Email: kearmic@amazon.com Twitter: @mkearnsupenn Admin Support, Warren Center and NETS Program Manager and Social Media Outreach: Lily Hoot Phone: 215.573.0861 Email: lhoot@seas.upenn.edu RESEARCH INTERESTS My research interests include topics in machine learning, artificial intelligence, algorithmic game theory and microeconomics, computational social science, and quantitative finance and algorithmic trading. I often examine problems in these areas using methods and models from theoretical computer science and related disciplines. While much of my work is mathematical in nature, I also often participate in empirical and experimental projects, including applications of machine learning to problems in algorithmic trading and quantitative finance, and human-subject experiments on strategic and economic interaction in social networks. SITE DIRECTORY For (in)convenience, most of this site is organized as a single flat html file. The links below let you navigate directly to the various subsections. Publications Research Group Members Teaching and Tutorial Material Professional Bio Educational Background Editorial and Professional Service Press Aaron Roth and I have written a general-audience book about the science of designing algorithms that embed social values like privacy and fairness; here is the publisher's description: Over the course of a generation, algorithms have gone from mathematical abstractions to powerful mediators of daily life. Algorithms have made our lives more efficient, more entertaining, and, sometimes, better informed. At the same time, complex algorithms are increasingly violating the basic rights of individual citizens. Allegedly anonymized datasets routinely leak our most sensitive personal information; statistical models for everything from mortgages to college admissions reflect racial and gender bias. Meanwhile, users manipulate algorithms to \"game\" search engines, spam filters, online reviewing services, and navigation apps. Understanding and improving the science behind the algorithms that run our lives is rapidly becoming one of the most pressing issues of this century. Traditional fixes, such as laws, regulations and watchdog groups, have proven woefully inadequate. Reporting from the cutting edge of scientific research, The Ethical Algorithm offers a new approach: a set of principled solutions based on the emerging and exciting science of socially aware algorithm design. Michael Kearns and Aaron Roth explain how we can better embed human principles into machine code - without halting the advance of data-driven scientific exploration. Weaving together innovative research with stories of citizens, scientists, and activists on the front lines, The Ethical Algorithm offers a compelling vision for a future, one in which we can better protect humans from the unintended impacts of algorithms while continuing to inspire wondrous advances in technology. Here are links to some media related to the book: A review in Nature. A review/summary in strategy+business. A policy briefing for the Brookings Institution on technology regulatory implications. A talk video filmed at the Carnegie Council for Ethics in International Affairs in NYC, along with a full transcript and slides. A Penn podcast in which we discuss some of the book's topics. A piece on the book on NPR Marketplace Morning Report. Interview on WHYY's Radio Times (at 32 minute mark) November 2019. An excerpt from the book in Penn Today. An opinion piece adapted from book themes in Scientific American. QUICK LINKS Teaching Fall 2025: CIS 6250, Theory of Machine Learning. Teaching Spring 2025: CIS 4230/5230, Ethical Algorithm Design. Warren Center for Network and Data Sciences Networked and Social Systems Engineering (NETS) Program Penn undergraduate course Networked Life (NETS 112), Fall 2019 and a condensed video version. Penn-Lehman Automated Trading Project (inactive) Tribute Day for Les Valiant, May 2009 Videos of some miscellaneous talks: \"The Ethical Algorithm\" (University of Washington, 2019 Taskar Memorial Lecture, general audience) \"The Ethical Algorithm\" (Centre for Ethics, University of Toronto 2019, general audience) \"Machine Learning and Social Norms\" (Santa Fe Institute 2017, general audience) Panel discussion on privacy policy and regulation (AT&T Forum 2017, general audience) \"Fair Algorithms for Machine Learning\" (ACM EC 2017, technical) \"Games, Networks and People\" (NIPS 2014, technical) \"The Complexity of Economics\" (Santa Fe Institute 2017; general audience) \"Algorithmic Trading: The Machine Learning Approach\", (Quantcon 2015, technical) BRIEF PROFESSIONAL BIO Current: Since 2002 I have been a professor in the Computer and Information Science Department at the University of Pennsylvania, where I hold the National Center Chair. I have secondary appointments in the department of Economics, and in the departments of Statistics and Data Science and Operations, Information and Decisions (OID) in the Wharton School. I am the Founding Director of the Warren Center for Network and Data Sciences, where my Co-Director is Rakesh Vohra. I am the faculty founder and former director of Penn Engineering's Networked and Social Systems Engineering (NETS) Program, whose current directors are Andreas Haeberlen and Aaron Roth. I am a faculty affiliate in Penn's Applied Math and Computational Science graduate program. Until July 2006 I was the co-director of Penn's interdisciplinary Institute for Research in Cognitive Science. Since June 2020, I have been an Amazon Scholar, focusing on fairness, privacy and other \"responsible AI\" topics within Amazon Web Services. I have worked extensively in quantitative and algorithmic trading on Wall Street (including at Lehman Brothers, Bank of America, SAC Capital and Morgan Stanley; see further details below). I often serve as an advisor to technology companies and venture capital firms, and sometimes invest in early-stage technology startups. I occasionally serve as an expert witness or consultant on technology-related legal and regulatory cases. I am an elected Member/Fellow of the National Academy of Sciences, the American Academy of Arts and Sciences, the Association for Computing Machinery, the Association for the Advancement of Artificial Intelligence, and the Society for the Advancement of Economic Theory. The Past: I spent the decade 1991-2001 in machine learning and AI research at AT&T Bell Labs. (Here is an epic photo of Labs staff from 1995, there are many famous scientists peppered throughout.) During my last four years there, I was the head of the AI department, which conducted a broad range of systems and foundational AI work; I also served briefly as the head of the Secure Systems Research department. The AI department boasted terrific colleagues and friends that included Charles Isbell (now at Georgia Tech), Diane Litman (now at University of Pittsburgh), Michael Littman (later at Rutgers, now at Brown), David McAllester (now at TTI-Chicago), Satinder Singh (now at University of Michigan), Peter Stone (now at University of Texas), and Rich Sutton (now at University of Alberta). Prior to my time as its head, the AI department was shaped by the efforts of a number of notable figures, including Ron Brachman (who originally founded the department; now at Cornell Tech), Henry Kautz (who led the department before heading to the University of Washington; now at the University of Rochester), and Bart Selman (now at Cornell). Before leading the AI group, I was a member of the closely related Machine Learning department at the labs, which was headed by Fernando Pereira (later at Penn, now at Google), and included Michael Collins (later at MIT and Columbia, now at Google), Sanjoy Dasgupta (now at UCSD), Yoav Freund (now at UCSD), Rob Schapire (later at Princeton, now at Microsoft Research), William Cohen (now at CMU), and Yoram Singer (later at Hebrew University and Google, now at Princeton). Other friends and colleagues from Labs days include Sebastian Seung (later at MIT, now at Princeton), Lawrence Saul (later at Penn, now at UCSD), Yann LeCun (now at Facebook and NYU), Roberto Pieraccini (now at Jibo), Esther Levin (now at Point72), Lyn Walker (now at UC Santa Cruz), Corinna Cortes (now at Google), and Vladimir Vapnik (now at Facebook). I spent 2001 as CTO of the European venture capital firm Syntek Capital, and joined the Penn faculty in January 2002. From June 2018 to June 2020, I led applied research in the AI Center of Excellence at Morgan Stanley, along with Yuriy Nevmyvaka (with whom I have also collaborated on a number of papers on algorithmic trading ). From June 2016 to March of 2018, I was the Chief Scientist of MANA Partners, a trading, technology and asset management firm based in NYC. From early 2014 to June 2016, I led a quantitative portfolio management team with Yuriy Nevmyvaka at Engineers Gate. From June 2009 through September 2013, we were PMs in the MultiQuant division of SAC Capital in New York City. From May 2007 through April 2009, we led a quantitative trading team at Bank of America in New York City, working on both proprietary and algorithmic trading strategies within BofA's Electronic Trading Services division. From the Spring of 2002 through May 2007, I was first a consultant to, and later the head of, a quant prop trading tea",
  "content_length": 62758,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:53"
}