{
  "name": "Michele Lanza 0001",
  "homepage": "http://search.usi.ch/persone/8b4717057b3c2d30a3b28425aa4e29d5/Lanza-Michele",
  "status": "success",
  "content": "Lanza, Michele | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Michele Lanza http://usi.to/ev4 Biography Michele Lanza is full professor at the Faculty of Informatics, which he co-founded in 2004. His doctoral dissertation, completed in 2003 at the University of Bern, received the prestigious European Ernst Denert award for best thesis in software engineering of 2003. Prof. Lanza received the Credit Suisse Award for best teaching in 2007 and 2009. Prof. Lanza leads the REVEAL research group since 2004. REVEALers work in the areas of software visualization, evolution, and analytics. Prof. Lanza co-authored more than 200 peer-reviewed articles and the book \"Object-Oriented Metrics in Practice\". Prof. Lanza is involved in a number of scientific communities, and has served on more than 100 program committees. He is president of CHOOSE (the Swiss Object-Oriented Software Engineering society). His professional service includes serving on the steering committees of the IEEE International Conference of Software Maintenance and Evolution (ICSME) and of the IEEE International Conference on Mining Software Repositories (MSR). He was Program co-chair of SANER 2016, ICSME 2010, MSR 2007/2008, VISSOFT 2009, and IWPSE 2007. Prof. Lanza has graduated 13 awesome PhD students so far, some of whom have become internationally well-known academics. At USI Prof. Lanza directs the Software Institute, which he founded in 2017. Competence areas Data Engineering Mining Software Repositories Software Engineering Software Evolution Software Visualization Contact michele.lanza@usi.ch tel +41 58 666 4659 East Campus, Sector D, Office D3.07 (Level P3) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Full Professor Software Institute Links Website or personal page Social media X Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2548,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:22"
}