{
  "name": "Michail N. Giannakos",
  "homepage": "https://www.ntnu.edu/employees/michailg",
  "status": "success",
  "content": "Michail Giannakos - NTNU Michail Giannakos Download press photo Download press photo Download press photo Foto: Close Michail Giannakos Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering michailg@ntnu.no +4773590731 +4794118108 PTS2, 308, S. P. Andersens veg 15B, 7031 Trondheim ResearchGate Scopus Google Scholar Research.com About Michail (Michalis) Giannakos is a professor of interaction design and learning technologies at the Department of Computer Science of NTNU, and Head of the Learner-Computer Interaction lab. His research focuses on the design and study of emerging technologies in online and hybrid education settings, and their connections to student and instructor experiences and practices. Giannakos has co-authored more than 150 manuscripts published in peer-reviewed journals and conferences (including Computers & Education, Computers in Human Behavior, IEEE TLT, Behaviour & Information Technology, BJET, ACM TOCE, CSCL, Interact, C&C, IDC to mention few) and has served as an evaluator for the EC and the US-NSF. He has served/serves in various organization committees (e.g., general chair, associate chair), program committees as well as editor and guest editor on highly recognized journals (e.g., BJET, Computers in Human Behavior, IEEE TOE, IEEE TLT, ACM TOCE). He has worked at several research projects funded by diverse sources like the EC, Microsoft Research, The Research Council of Norway (RCN), US-NSF, the German agency for International Academic Cooperation (DAAD), and Cheng Endowment; Giannakos is also a recipient of a Marie Curie/ERCIM fellowship, and the prestigious «Young Research Talents» grant from the Research Council of Norway. He was one of the outstanding academic fellows of NTNU (2017-2021). Current and previous positions 2020–present     Professor/Head of the Learner–Computer Interaction Lab, Dept. of Computer Science, Norwegian University of Science and Technology, Norway 2023–2024     EAISI Visiting Professor, Eindhoven AI Systems Institute, Eindhoven University of Technology (TU/e), the Netherlands 2022–2023     Honorary Professor, UCL Knowledge Lab, University College London (UCL), The UK 2017–2020     Associate Professor, Dept. of Computer Science, Norwegian University of Science and Technology, Norway 2014–2017     Senior Lecturer (førstelektor in Norwegian), Dept. of Computer Science, Norwegian University of Science and Technology, Norway 2013–2014     Assistant Professor, Dept. of Computer Science, Old Dominion University (ODU), Norfolk, VA, USA 2013          Marie Curie/ERCIM Fellow (1 year), Dept. of Computer Science, Norwegian University of Science and Technology, Norway 2012.         Richard T. Cheng Research Fellow (visiting research fellowship - 6 Months), Centre for Real-Time Computing, VA, USA Competencies Design research Human-Computer Interaction Learning analytics Learning technology User Experience Research Awards and Recognition: 2023 EAISI Visiting Professor, Eindhoven AI Systems Institute, Eindhoven University of Technology (TU/e), the Netherlands 2022 Honorary Professor, UCL Knowledge Lab, University College London (UCL), The UK 2022 IDC Best Paper Award 2020 ITiCSE Top 5 papers in 25 Years Award (1 of the top 5 WG papers on the 25 years of ACM ITiCSE’s life) 2019 Best Paper Award Nominee at EC-TEL’19 2018 Best Demo Award at LAK’18 2018 ACM Recognition of Service Award 2018 2017 Outstanding Academic Award (NTNU’s promising young scientists 2017-2020) 2017 Best Paper Award at IEEE ICALT’17 2016 RCN Young Research Talent grant, The Research Council of Norway (RCN) 2013 ERCIM “Alain Bensoussan” Fellow 2012 Richard T. Cheng Research Fellow My major recent research projects include: International Empowering Children’s STEM Learning Through Embodied Interaction, A Research Collaboration between UC Berkeley and NTNU, Role: PI for NTNU (managing the project together with Prof. Abrahamson from UC Berkeley), funded by Peder Sether Center (2023-2024). STEAM Learning Ecologies (SLEs), Role: PI for NTNU, funded by Horizon Europe (2022-2025). Surrounded by Science: Learning paths towards science proficiency (SURROUNDEDbySCIENCE), Role: PI for NTNU, funded by Horizon 2020 Science with and for Society (SwafS) programme (2021-2025). Learning science the fun and creative way: coding, making, and play as vehicles for informal science learning in the 21st century (COMnPLAY-Science), Role: Coordinator,  funded by Horizon 2020 Science with and for Society (SwafS) programme (2018-2021). “Learn to Machine Learn” (LearnML), Role: PI for NTNU, funded by Erasmus + (2019-2022). An Academia-Industry Knowledge Alliance for enhancing Online Training Professionals’ Competences in Educational Data Analytics (Learn2Analyze), Role: PI for NTNU, funded by Erasmus + (2018-2021). National Cross-Analytics Driven Design to Enhance Learning Experience (Xdesign), Role: PI, funded by the Norwegian Research Council (2018-2019). Future Learning: Orchestrating 21st Century Learning Ecosystems using Analytics, Role: PI, funded by the Norwegian Research Council (2016-2020). Institutional SWELL – Sustainable Built Environments for better Health and WELL-being, Role: WP leader, funded by the Interdisciplinary Sustainable Initiatives at NTNU (2022-2025). Learning technologies and analytics research, Role: PI, funded by NTNU's Outstanding Academic Fellows Programme (2017-2021). Adaptive Learning Analytics to Support Information Technology Education (Adapt-IT), Role: PI, funded by NTNU’s Excellent Education program (NTNU Toppundervisning) (2017-2021). Publications Updated track record and bibliometric indicators of my work can be found in my scholar profile; downloadable ePrints of my publications can be found in both my RG profile and my national CRISTIN profile. Below you can find some recent indicative publications of my work. 2025 Cosentino, Giulia; Gelsomini, Mirko; Kshitij, Kshitij; Giannakos, Michail. (2025) Students’ experience and learning outcomes in multisensory environments: the moderating role of interaction modalities. Smart Learning Environments Academic article Cosentino, Giulia; Anton, Jacqueline; Kshitij, Kshitij; Gelsomini, Mirko; Giannakos, Michail; Abrahamson, Dor. (2025) Exploring children's embodied interactions through digitally facilitated enactment: A case study when math education MOVES. International Journal of Human-Computer Studies Academic article Cosentino, Giulia; Anton, Jacqueline; Kshitij, Kshitij; Gelsomini, Mirko; Giannakos, Michail; Abrahamson, Dor. (2025) Generative AI and multimodal data for educational feedback: Insights from embodied math learning. British Journal of Educational Technology (BJET) Academic article Giannakos, Michail; Horn, Michael; Cukurova, Mutlu. (2025) Learning, design and technology in the age of AI. Behaviour and Information Technology Editorial Kshitij, Kshitij; Lee-Cultura, Serena Glyn; Papavlasopoulou, Sofia; Giannakos, Michail. (2025) Multimodal Effort Profiles and Children's Performance: Cognitive, Physiological and Physical Dimensions. Journal of Computer Assisted Learning (JCAL) Academic article 2024 Giannakos, Michail; Azevedo, Roger; Brusilovsky, Peter; Cukurova, Mutlu; Dimitriadis, Yannis; Hernandez-Leo, Davinia. (2024) The promise and challenges of generative AI in education. Behaviour and Information Technology Academic article Chatzidaki, Eleni; Papavlasopoulou, Sofia; Gijlers, Hannie; Eysink, Tessa, H.S.; Giannakos, Michail. (2024) Science Chaser app: A gamified learning journey into STEM activities. Academic chapter/article/Conference paper Shemy, Ibrahim El; Jaccheri, Maria Letizia; Giannakos, Michail; Vulchanova, Mila Dimitrova. (2024) Participatory design of augmented reality games for word learning in autistic children: the parental perspective. Entertainment Computing Academic article Błachnio, Agata; Przepiórka, Aneta; Gorbaniuk, Oleg; Abreu, Ana Maria; Bendayan, Rebecca; Ben-Ezra, Menachem. (2024) Measurement invariance of the Facebook intrusion questionnaire across 25 countries. International Journal of Psychology (IJP) Academic article Niforatos, Evangelos; He, Tianhao; Vourvopoulos, Athanasios; Giannakos, Michail. (2024) Democratizing EEG: Embedding Electroencephalography in a Head-Mounted Display for Ubiquitous Brain-Computer Interfacing. International Journal of Human-Computer Interaction Academic article Di Mitri, Daniele; Limbu, Bibeg; Schneider, Jan; Iren, Deniz; Giannakos, Michail; Klemke, Roland. (2024) Multimodal and immersive systems for skills development and education. British Journal of Educational Technology (BJET) Editorial Zhang, Feiran; Papavlasopoulou, Sofia; Motland, Julie Holte; Giannakos, Michail. (2024) A Review of Empirical Studies on Gamification in K-12 Environmental Education: Is This Chocolate-Covered Broccoli?. Academic chapter/article/Conference paper Lee-Cultura, Serena Glyn; Kshitij, Kshitij; Giannakos, Michail. (2024) Multimodal Teacher Dashboards: Challenges and Opportunities of Enhancing Teacher Insights Through a Case Study. IEEE Transactions on Learning Technologies Academic article Zhang, Feiran; Brynildsrud, Hanne; Papavlasopoulou, Sofia; Kshitij, Kshitij; Giannakos, Michail. (2024) Where inquiry-based science learning meets gamification: a design case of Experiverse. Behaviour and Information Technology Academic article Cosentino, Giulia; Anton, Jacqueline; Kshitij, Kshitij; Gelsomini, Mirko; Giannakos, Michail; Abrahamson, Dor. (2024) Hybrid teaching intelligence: Lessons learned from an embodied mathematics learning experience. British Journal of Educational Technology (BJET) Academic article Lillehaug, Barbara Wasson; Giannakos, Michail; Blikstad-Balas, Marte; Uppstad, Per Henning; Langford, Malcolm; Bøhn, Einar Duenger. (2024) Implementing Learning Analytics in Norway: Four Central Dilemmas. Journal of Learning Analytics Academic article 2023 Cosentino, Giulia; Giannakos, Michail. (2023) Multisensory Interaction and Analytics to Enhance",
  "content_length": 24437,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:08"
}