{
  "name": "Michael Granitzer",
  "homepage": "http://www.fim.uni-passau.de/medieninformatik",
  "status": "success",
  "content": "Prof. Dr. Michael Granitzer - Universität Passau Informationen für... Informationen für... Studierende Studien­interessierte Wissen­schaftler­innen und Wissen­schaftler Nachwuchs­förderung Unternehmen Netzwerke Schülerinnen, Schüler und Lehrkräfte Beschäftigte Presse Fakultäten & Einrichtungen Verwaltung Zentrale Einrichtungen Fakultäten Juristische Fakultät Sozial- und Bildungs­wissen­schaft­liche Fakultät Geistes- und Kultur­wissen­schaft­liche Fakultät Wirtschafts­wissen­schaft­liche Fakultät Fakultät für Informatik und Mathematik Zentrale Einrichtungen Graduiertenzentrum PICAIS Sportzentrum Sprachenzentrum Universitätsbibliothek ZIM ZLF Zentrale Einrichtungen Geschäftsstelle Forschung Stabsstelle Arbeitssicherheit Stabsstelle Diversity und Gleichstellung Stabsstelle Kompetenz­entwicklung in Studium und Lehre Stabsstelle Prozessmanagement Geschäftsstelle Digitalverbund Bayern Entwicklung der Universitätsverwaltung Universitätssteuerung Kommunikation und Marketing Forschungsförderung Transfer und Qualifizierung Studierenden- und Rechtsangelegenheiten Internationales und Studierendenservice Finanzen Personal Facility Management Graduiertenzentrum PICAIS Sportzentrum Sprachenzentrum Universitätsbibliothek ZIM ZLF Heading Informationen für... Fakultäten & Einrichtungen Login Direkt zu... Bewerbung und Einschreibung Studienangebot Studienberatung Vorlesungsverzeichnis Auslandsamt Karriere und Kompetenzen Prüfungssekretariat Graduiertenzentrum Studierendenwerk Universitätsbibliothek de en Informationen für... Fakultäten & Einrichtungen Direkt zu... Bewerbung und Einschreibung Studienangebot Studienberatung Vorlesungsverzeichnis Auslandsamt Karriere und Kompetenzen Prüfungssekretariat Graduiertenzentrum Studierendenwerk Universitätsbibliothek Hilfe Login de en Lehrstuhl für Data Science Lehrstuhl für Data Science Wir erforschen Methoden zur Erschließung und Bereitstellung web-basierter Medien. Unser Schwerpunkt liegt dabei auf der Nutzung maschineller Lerntechniken und intelligenter Mensch-Maschine Schnittstellen. Knowledge Discovery in Medien Visual Analytics Analyse von Nutzer- und Nutzungsdaten Personalisierte Informationssuche Data Mining und Maschinelles Lernen Web Mining und Analyse sozialer Medien Visual Analytics Medientechnik Prof. Dr. Michael Granitzer Mittwoch 16:00 bis 18:00 Uhr Anmeldung über das Sekretariat Sekretariat Stephanie Pauli Raum: ITZ 166 Telefon: 0851 / 509 - 5066 Telefax: 0851 / 509 - 3308 E-Mail: Stephanie.Pauli@uni-passau.de Sprechzeiten: Montag und Mittwoch 9:00 - 11:00 Uhr Zuletzt aktualisiert: | Seiten-ID: 16098 Seite teilen Seite drucken Modal Inhalte teilen via Facebook LinkedIn E-Mail Ich bin damit einverstanden, dass beim Abspielen des Videos eine Verbindung zum Server von Vimeo hergestellt wird und dabei personenbezogenen Daten (z.B. Ihre IP-Adresse) übermittelt werden. Ich bin damit einverstanden, dass beim Abspielen des Videos eine Verbindung zum Server von YouTube hergestellt wird und dabei personenbezogenen Daten (z.B. Ihre IP-Adresse) übermittelt werden. Video anzeigen",
  "content_length": 3060,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:06"
}