{
  "name": "Michael Winter 0001",
  "homepage": "http://www.cosc.brocku.ca/~mwinter",
  "status": "success",
  "content": "Michael Winter Professor Department of Computer Science Brock University St. Catharines, Ontario, Canada, L2S 3A1 eMail: [email protected] Phone: +1 (905) 688-5550 ext. 3355 Managing Editor of Journal on Relational Methods in Computer Science - An electronic Journal - ISSN 1439-2275 (founded 04/17/00) Research Interests Fundamentals of programming languages Semantics of programming languages Program verification Program development Relational methods in computer science and mathematics Theory of relational structures (Allegories, Dedekind/Schröder categories, Relation Algebras) Theory of fuzzy relations Relational models of processes Qualitative spatial reasoning Mathematical Logic and Category Theory Publications Teaching Fall 2024 sick leave Winter 2025 COSC 2P05 - Programming Languages COSC 3P91 - Advanced Object-Oriented Programming COSC 5P02 - Logic in Computer Science sabbatical Current/Recent Student Projects Antwi, Robert: Compilation of a Functional Programming Language using Combinators, 2024-2026 (M.Sc. Thesis). Ansar, Fahad: Teaching Proof by Induction, 2023-2025 (M.Sc. Thesis). Akter, Sumaia: A combinator based compiler for an extension of PCF (tentative title), 2023-2025 (M.Sc. Thesis). Osei, Frimpong: L-Fuzzy social choice theory (tentative title), 2022-2024 (M.Sc. Thesis). Hu, Maka: Automatic generation of human readable proofs (tentative title), 2021-2023 (M.Sc. Thesis). Izadpanahi, Anahita: L-Fuzzy Concept Analysis, 2020-2022 (M.Sc. Thesis). Ansar, Fahad: Online teaching tool for Proof by Induction, 2022 (COSC 4F90). Collings A, McCart R, Simpson M, Sparaga J: 5Parsecs – A Game using Procedural Generated Quests, 2021-2022 (COSC 4F90/IASC 3P98/9). Wang, Yi: An implementation of separation logic in COQ, 2019-2021 (M.Sc. Thesis). Simpson, Madison: Management System for a Food Bank, 2020 (COSC 3P99). Gao, Dazho: Serialization using XML in Java, 2020 (COSC 4F90). Asif, Abdullah: Automatic Generation of Natural Deduction Proofs, 2020 (COSC 3P99). Kargil, Kindeep: Efficient Simulation of a Quantum Programming Language, 2020 (COSC 4F90). Suryapally, Vamshi: Concept Lattices – Computational Aspects, 2018-2019 (M.Sc. project). Addison, George: Object Classification using L-Fuzzy Concept Analysis, 2018-2020 (M.Sc. Thesis). Saha, Sajal: Datamining using L-Fuzzy Concept Analysis, 2018-2020 (M.Sc. Thesis). Imangazin, Nurbek: A Relation-Algebraic Approach to L-Fuzzy Topology, 2017-2019 (M.Sc. Thesis). Ansar, Fahad: A Quantum Programming Language, 2019 (COSC 3P99). Tonet, Adam: Verification of Protocols using the SPI-Calculus and Coq, 2016-2018 (M.Sc. Thesis). Ghosh, Pranab: Modal Logics for Qualitative Spatial Reasoning, 2016-2018 (M.Sc. Thesis). Alkhulaif, Shams: A Functional Programming Language with Patterns and Copatterns (tentative title), 2016-2018 (M.Sc. Thesis). Santos Teixeira, Milene: An Implementation of an L-Fuzzy Controller, UFSM Brazil, 2016-2017 (M.Sc. Thesis). Al Jumaily, Maysara: Analyzing Soccer Data using Graphs, 2017 (COSC 4F90). Simonits, Alexander: Automatic Quest Generation, 2017 (COSC 3P99). Caven, Nichole and Miskimin, Mathew: 3D Virtual Tour of MIWSFPA, 2016 (IASC 3P99). Kurylovich, Anton: Development of an animated geometry learning platform, 2015-2017 (Project). Kazemi, Yosra and DeForest, Amber: Interactive Induction for High School Students, 2015-2017 (Project). Chowdhury, Durjay: Approximation Algorithms using Allegories and Coq, 2015-2017 (M.Sc. Thesis). Killingbeck, Dylan: A Generic Matrix Manipulator. Brock University, 2015-2016 (M.Sc. Thesis). Owen, Scott: Interactive Proofs in Natral Deduction Style, 2015 (COSC 3P99). Adjei, Evans: L-Fuzzy Structural Query Language. Brock University, 2013-2015 (M.Sc. Thesis). Chowdhury, Abdul Wazed: An Abstract Algebraic Theory of L-Fuzzy Relations for Relational Databases. Brock University, 2013-2015 (M.Sc. Thesis). Jones, Alec: Dante’s Inferno. Brock University, 2014 (COSC 3P99). Santos Teixeira, Milene: A Generic Matrix Manipulator. Brock University, 2014 (COSC 3P99). Jackson, Ethan: Fuzzy Controller in Arrow Categories, 2012-2014 (M.Sc. Thesis) Ghosh, Manas: Region Connection Calculus: Composition Tables and Extensional Models, 2011-2013 (M.Sc. Thesis) Atampore, Francis Kwesi: A Library for Relations based on Heterogeneous OMDDs, Brock University, 2010-2012 (M.Sc. Thesis) Das, Tuhin Kanti: A System for First-Order Dynamic Logic, Brock University, 2010-2012 (M.Sc. Thesis) Pascuzzi, Vince: Simulating Quantum Computing in Haskell. Brock University, 2012 (COSC 3P99) Stinson, Christopher: Operation Olympic - A history simulation, Brock University, 2012 (COSC 4F90) Bond, Ron: Translation of first-order properties into relational equations, Brock University, 2011-2012 (COSC 3P99) Jackson, Ethan: An UNITY Interpreter suitable for Genetic Programming, Brock University, 2011-2012 (COSC 4F90) Lenarcic, Adam: Formalizing Affordances in Situation Theory, 2010-2011 (M.Sc. Thesis) Mahmood, Shahid: Efficient Computation of Reducts in Rough Set based Data Mining, 2010-2011 (M.Sc. Thesis) Abdalbari, Anwer: A System for Models of First-order Theories, 2009-2011 (M.Sc. Thesis) Hossain, MD Nour: Equational Reasoning about Object-Oriented Programs, 2009-2011 (M.Sc. Thesis) Sidavaatam, Prathap: Generating Relation Algebras for Qualitative Spatial Reasoning, 2009-2011 (M.Sc. Thesis) Aameri, Bahar: Extending RelAPS to first-order logic, 2008-2010 (M.Sc. Thesis) Zhang, Si: Generating finite integral Relation Algebras, 2008-2010 (M.Sc. Thesis) Glanfield, Joel: Computational Aspects of the Theory of Allegories. Brock University, 2006-2008 (M.Sc. Thesis) Foy, Grant: A new Object-Oriented Programming Language and Interactive Development Environment. Brock University, 2006-2009 (M.Sc. Thesis) Ahmed, Zafor: Computation and Visualization of Finite Relation Algebras. Brock University, 2006-2009 (M.Sc. Thesis) Dalcourt, Greg: The Reference Manager. Brock University, 2008 (COSC 3P99) Zhang, Si: XML Serialization. Brock University 2007-2008 (COSC 3P99) Griffiths, Bryan: Rulebased Emergent Behavior. Brock University, 2006-2007 (COSC 4F90) Skacal, Michael: Comparison of rulebased real-time Warfare Simulations. Brock University, 2006-2007 (COSC 4F90) © Michael Winter",
  "content_length": 6220,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:04"
}