{
  "name": "Michael L. Best",
  "homepage": "http://mikeb.inta.gatech.edu",
  "status": "success",
  "content": "Dr. Michael L. Best Skip to primary navigation Skip to content Skip to primary sidebarInformation Technologies & International DevelopmentMy research focuses on the promise, and the peril, of information and communication technologies (ICTs) in social, economic, and political development. In particular, I study mobile phones, the internet, and internet-enabled services and their design, impact, and importance – their risks and rewards – for people and communities especially in Africa and Asia. I research engineering, public policy, hci/usability, and sustainability issues as well as methods to assess and evaluate social, economic, and political development outcomes. I also explore issues of rights and justice in a digital age and hope to create new forms for inclusive innovation and social entrepreneurship enhanced through digital systems. I am also interested in the impact of information and communication technologies on the development-security nexus and in post-conflict peace and reconciliation. QUICK BIOGRAPHY Dr. Michael L. Best is Executive Director of the Institute for People and Technology (IPaT) and Professor with the Sam Nunn School of International Affairs and the School of Interactive Computing at Georgia Institute of Technology where he directs the Technologies and International Development Lab. He was founding director of the United Nations University Institute on Computing and Society (UNU-CS) in Macau SAR, China. He holds a Ph.D. from MIT and has served as director of Media Lab Asia in India and head of the eDevelopment group at the MIT Media Lab. Professor Best is Associate Editor for Global Computing with Communications of the ACM and co-founder and Editor-in-Chief Emeritus of the journal Information Technologies and International Development. Best has published over 150 peer-reviewed papers in books, journals, and conferences, and since joining Georgia Tech offered more than 150 invited and keynote lectures across the USA and internationally. Primary Sidebar Michael L. Best Sam Nunn School of International Affairs School of Interactive Computing Georgia Institute of Technology Atlanta GA  USA sites.gatech.edu/inta-mikeb mikeb at gatech.edu",
  "content_length": 2196,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:31"
}