{
  "name": "Michael Goldsmith",
  "homepage": "https://www.cs.ox.ac.uk/people/michael.goldsmith",
  "status": "success",
  "content": "Michael Goldsmith | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleResearchMichael GoldsmithMichael Goldsmith Professor Michael Goldsmith Senior Research FellowAssociate Professor of Computer Science Department of Computer Science, Robert Hooke BuildingDirections Postal AddressThemes:SecurityCompleted Projects:EnCoReSponstaneous Securitymore…Selected PublicationsView AllManage publications The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance Ioannis Agrafiotis‚ Sadie Creese‚ Michael Goldsmith‚ Jason R.C. Nurse and David Upton No. RR−17−01. DCS. Oxford‚ UK. 2017. Details about The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance | BibTeX data for The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance | Download (pdf) of The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance Reflecting on the Use of Sonification for Network Monitoring Louise Axon‚ Sadie Creese‚ Michael Goldsmith and Jason R.C. Nurse In 10th International Conference on Emerging Security Information‚ Systems and Technologies. Pages 254–261. 2016. Details about Reflecting on the Use of Sonification for Network Monitoring | BibTeX data for Reflecting on the Use of Sonification for Network Monitoring | Download (pdf) of Reflecting on the Use of Sonification for Network Monitoring Identifying attack patterns for insider threat detection Ioannis Agrafiotis‚ Jason R. C. Nurse‚ Oliver Buckley‚ Phil Legg‚ Sadie Creese and Michael Goldsmith In Computer Fraud & Security. No. 7. Pages 9–17. July, 2015. Details about Identifying attack patterns for insider threat detection | BibTeX data for Identifying attack patterns for insider threat detection | DOI (10.1016/S1361-3723(15)30066-X) | Link to Identifying attack patterns for insider threat detection ActivitiesCybersecurity AnalyticsCyber Security OxfordProjectsGCSCCSCULICompleted ProjectsEnCoReSponstaneous SecurityTEASESATURNCyberVisSecurity Protocols for Ad Hoc NetworksNoninterference and covert channel analysisRefinement-friendly bigraphsIdentity Security in CyberspaceCorporate Insider Threat DetectionAnalysing Cyber Value-at-RiskIdentity Security in CyberspaceFly2Plan Current Student Ahmed  Salman Research Louise Axon-JonesSenior Research Associate Past Students Mary BisphamRodrigo CarvalhoFaisal HameedMariam NouhElizabeth PhillipsHugo SbaiArianna Schuler ScottMarcel Stolz (Armasuisse Science and Technology; Swiss Armed Forces; Konrad Adenauer Stiftung) Fatima Zahrah Past Researcher Alastair Janse van RensburgAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2890,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:03"
}