{
  "name": "Michael E. Tipping",
  "homepage": "http://www.miketipping.com",
  "status": "success",
  "content": "miketipping.com :: homepage of Mike Tipping miketipping[.com] HomeRVMPapersAbout MeDownloadsContact Welcome to the personal\tweb-site of Mike Tipping Who…? I am Professor of Machine Learning within the Department of Computer Science at the University of Bath, working primarily in the areas of Machine Learning and Artificial Intelligence. My early research interests focused on neural computation and probabilistic methods for data visualisation, and later broadened to include more general machine learning methodology and, in particular, Bayesian statistical inference. Between spells in academia, and before joining the University of Bath in early 2016, I spent several years in industry: eight years at Microsoft Research (Cambridge), six years running an independent statistical consultancy and two years as Director of Science at Cambridge analytics start-up Featurespace. More recently, I have worked with and/or consulted for a range of high-tech businesses, including Babylon Healthcare, Homelink Technologies, 90POE, and Propflo. Over the years I have worked on diverse topic areas within AI, both fundamental and applied, the best-known examples of which are the Probabilistic PCA (PPCA) framework, the relevance vector machine (Sparse Bayesian) predictive model and the \"Drivatar AI\" system for Microsoft Xbox franchise \"Forza Motorsport\". If you'd like to know more, there exists: a profile page at the University of Bath a LinkedIn profile a Google scholar page Why…? I maintain this site for three principal reasons: to make available many of the scientific research papers that I've published to host a page dedicated to sparse Bayesian learning and the \"relevance vector machine\" (including a software implementation) My social media activity is best described as \"limited\" Anything else…? Everything of interest should be available via the main menu above. If you spot any errors, omissions, or have any other general queries, please feel free to contact me. Site content copyright © 2006–2023 Mike Tipping",
  "content_length": 2024,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:54"
}