{
  "name": "Michael Franz",
  "homepage": "http://www.michaelfranz.com",
  "status": "success",
  "content": "michaelfranz.comSearch this siteEmbedded FilesSkip to main contentSkip to navigationHello, and Welcome!I am an ICS Alumni Professor in the Donald Bren School of Information and Computer Sciences at UC Irvine.  I am also a Distinguished Professor in the Department of Computer Science in the Donald Bren School of Information and Computer Sciences, a Professor (by courtesy) in the Department of Electrical Engineering and Computer Science in the Henry Samueli School of Engineering, and the director of UCI's Secure Systems and Software Laboratory. I am a Fellow of AAAS, ACM, IEEE and an Inaugural Fellow of IFIP. The purpose of this web page is to give a short overview of my research group's activities.I greatly welcome feedback. However, if you are a prospective graduate student, please read the specific information page before sending me any email. I am afraid that we do not offer \"internship\" opportunites, so please do not send emails asking if we do.Sincerely, Michael FranzQuick BiographyProf. Michael Franz was an early pioneer in the areas of mobile code and dynamic compilation. He created an early just-in-time compilation system, contributed to the theory and practice of continuous compilation and optimization, and co-invented the trace compilation technology that eventually became the JavaScript engine in Mozilla's Firefox browser.His current research emphasis lies in the area of Software Systems, particularly focusing on compiler, virtual machine, and related system-level techniques for making software either safer, or faster, or both. Some of this research also falls under the labels Computer Security, Trustworthy Computing, and Software Engineering.Dr. Franz has graduated 40 Ph.D. students as their primary advisor and has published more than 150 peer-reviewed research papers. He is the Principal Investigator on many competitive grants from the federal government, totaling over $24M (of which more than $16M as sole PI), and has received more than a million dollars in unrestricted gifts from industry in appreciation of the research innovations he has contributed.Franz received a Dr. sc. techn. degree in Computer Science (advisor: Niklaus Wirth) and a Dipl. Informatik-Ing. ETH degree, both from the Swiss Federal Institute of Technology, ETH Zurich. He is a Fellow of the Americal Association for the Advancement of Science (AAAS), a Distinguished Scientist and a Fellow of the Association for Computing Machinery (ACM), a Fellow of The Institute of Electrical and Electronics Engineers (IEEE), and an Inaugural Fellow of the International Federation for Information Processing (IFIP).(link to full CV)Contact InformationSecure Systems and Software LaboratoryDepartment of Computer ScienceDonald Bren School of Information & Computer SciencesUniversity of California, IrvineIrvine, CA 92697-3435office: CS Building, Suite 444email: michael @ michaelfranz.com or franz @ uci.eduOffice HoursI am in my office on most days and am also happy to meet via video. Please send me an email to make an appointment.Administrative ContactMariko Waltonphone: (949) 824-6753fax: (949) 824-4056Selected Recent PublicationsA. Rösti, S. Volckaert, M. Franz, and A. Voulimeneas; \"I'll Be There For You! Perpetual Availability in the A8 MVX System;” in 2024 Annual Computer Security Applications Conference (ACSAC 2024), Honolulu, Hawaii; December 2024. Distinguished Paper with Artifact Award (83 papers accepted out of 424 total papers submitted to the conference / 381 strictly reviewed papers after what the program committee called \"aggressive desk rejects\" = 21.8% of the actually reviewed papers).A. Rösti, A. Voulimeneas, and M. Franz; \"The Astonishing Evolution of Probabilistic Memory Safety: From Basic Heap-Data Attack Detection Toward Fully Survivable Multivariant Execution;\" in IEEE Security and Privacy, Vol. 22, No. 4, pp. 66-75; July/August 2024.F. Parzefall, C. Deshpande, F. Hetzelt, and M. Franz; \"What You Trace is What You Get: Dynamic Stack-Layout Recovery for Binary Recompilation;\" in 2024 ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2024), San Diego, California; April 2024. (170 papers accepted out of 912 submissions, with 33 revisions still outstanding = expected acceptance rate of 20-21%)C. Deshpande, F. Parzefall, F. Hetzelt, and M. Franz; \"Polynima–Practical Hybrid Recompilation for Multithreaded Binaries;\" in EuroSys 2024, Athens, Greece; April 2024. (71 papers accepted out of 484 submissions = 14.6%)M.-Y. Hsu, F. Hetzelt, D. Gens, M. Maitland, and M. Franz; \"A Highly Scalable, Hybrid, Cross-Platform Timing Analysis Framework Providing Accurate Differential Throughput Estimation via Instruction-Level Tracing;\" in 2023 ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2023), San Francisco, California; December 2023. SIGSOFT Distinguished Paper Award (60 papers accepted out of 473 submissions = 12.6%; an additional 82 papers were sent back for a major revision. The second round of reviews resulted in 67 more papers being accepted and 12 rejected, with the final tally being 127 accepted papers = 27%.)G. Kim, M. Franz, and J. Kim; \"The Ticket Price Matters in Sharding Blockchain;\" 6th International Workshop on Cryptocurrencies and Blockchain Technology (CBT 2022); published as J. Garcia-Alfaro, G. Navarro-Arribas, H. Hartenstein, and J. Herrera-Joancomarti (Eds.), Data Privacy Management, Cryptocurrencies and Blockchain Technology: ESORICS 2022 International Workshops, DPM 2022 and CBT 2022, Copenhagen, Denmark, September 26–30, 2022, Revised Selected Papers, Springer Lecture Notes in Computer Science, 2023.G. Kim, S. Hong, M. Franz, and D.K. Song; \"Improving Cross-Platform Binary Analysis using Representation Learning via Graph Alignment;\"' in ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2022), Seoul, South Korea; July 2022. (61 papers accepted out of 250 submissions = 25.6%)P. Kirth, M. Dickerson, S. Crane, P. Larsen, A. Dabrowski, D. Gens, Y. Na, S. Volckaert, and M. Franz; \"PKRU-Safe: Automatically Locking Down the Heap Between Safe and Unsafe Languages;\" in EuroSys 2022, Rennes, France; April 2022. Best Paper Award (45 papers accepted out of 161 submissions = 27.6%)C. Deshpande, D. Gens, and M. Franz; \"StackBERT: Machine Learning Assisted Static Stack Frame Size Recovery On Stripped and Optimized Binaries;\" in 14th ACM Workshop on Artificial Intelligence and Security (AISec 2021), Seoul, South Korea; November 2021.A. Dabrowski, K. Pfeffer, M. Reichel, A. Mai, E. Weippl, and M. Franz; \"Better Keep Cash in Your Boots – Hardware Wallets Are the New Single Point of Failure\"' in 2021 ACM Workshop on Decentralized Finance and Security (DeFi21), Seoul, South Korea; November 2021. K. Pfeffer, A. Mai, A. Dabrowski, M. Gusenbauer, P. Schindler, E. Weippl, M. Franz, and K. Krombholz; \"On the Usability of Authenticity Checks for Hardware Security Tokens;\" in USENIX Security 2021, Vancouver, British Columbia; August 2021 (248 papers accepted out of 1,319 submissions = 18.8%)A. Voulimeneas, D. Song, P. Larsen, M. Franz, and S. Volckaert, \"dMVX: Secure and Efficient Multi-Variant Execution in a Distributed Setting;\" in 14th European Workshop on Systems Security (EuroSec 2021), Edinburgh, Scotland; April 2021.P. Larsen and M. Franz; \"Adoption Challenges of Code Randomization,\" in Proceedings of the 7th ACM Workshop on Moving Target Defense (MTD 2020); November 2020.D. Song, F. Hetzelt, J. Kim, B. Kang, J. Seifert, and M. Franz; \"Agamotto: Accelerating Kernel Driver Fuzzing with Lightweight Virtual Machine Checkpoints;\" in USENIX Security 2020, Boston, Massachusetts; August 2020. (157 papers accepted out of 977 submissions = 16%)Z. Kenjar, T. Frassetto, D. Gens, M. Franz, and A. Sadeghi; \"V0LTpwn: Attacking x86 Processor Integrity from Software;\" in USENIX Security 2020, Boston, Massachusetts; August 2020. (157 papers accepted out of 977 submissions = 16%)P. Rajasekaran, S. Crane, D. Gens, Y. Na, S. Volckaert, and M. Franz; \"CoDaRR : Continuous Data Space Randomization against Data-Only Attacks;\" to appear in 15th ACM ASIA Conference on Computer and Communications Security (ACM ASIACCS 2020), Taipei, Taiwan; October 2020. (67 papers accepted out of 308 submissions = 22%) A. Voulimeneas, D. Song, F. Parzefall, Y. Na, P. Larsen, M Franz, and S. Volckaert; \"Distributed Heterogeneous N-Variant Execution;\" in 17th International Conference on Detection of Intrusions and Malware, and Vulnerability Assessment (DIMVA 2020), Lisbon, Portugal; June 2020. (13 papers accepted out of 45 submissions = 28.9%) A. Altinay, J. Nash, T. Kroes, P. Rajasekaran, D. Zhou, A. Dabrowski, D. Gens, Y. Na, S. Volckaert, C. Giuffrida, H. Bos, and M. Franz ;\"BinRec: Dynamic Binary Lifting and Recompilation — The Best Thing Since Sliced Binaries;\" in EuroSys 2020, Heraklion, Greece; April 2020. (43 papers accepted out of 234 submissions = 18%) T. Park, K. Dhondt, D. Gens, Y. Na, S. Volckaert, and M. Franz; \"NoJITsu: Locking Down JavaScript Engines;\" in 2020 Network and Distributed Systems Security Symposium (NDSS 2020), San Diego, California; February 2020. (88 papers accepted out of 506 submissions = 17%) B. Belleville, W. Shen, S. Volckaert, A.M. Azab, and M. Franz; \"KALD: Detecting Direct Pointer Disclosure Vulnerabilities;\"  IEEE Transactions on Dependable and Secure Computing (TDSC); 2019.D.K. Song, J. Lettner, P. Rajasekaran, Y. Na, S. Volckaert, P. Larsen, and M. Franz; \"SoK: Sanitizing for Security;\" in 40th IEEE Symposium on Security and Privacy (IEEE S&P 2019), San Francisco, California; May 2019. (84 papers accepted out of 673 submissions + 10 revised paper from the previous year = 12.5%)D.K. Song, F. Hetzelt, D. Das, Ch. Spensky, Y. Na, S. Volckaert, G. Vigna, Ch. Kruegel, J.-P. Seifert, and M. Franz; \"PeriScope: An Effective Probing and Fuzzing Framework for the Hardware-OS Boundary;\" in 2019 Network and",
  "content_length": 38891,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:59"
}