{
  "name": "Michel Barbeau",
  "homepage": "https://carleton.ca/scs/people/michel-barbeau",
  "status": "success",
  "content": "Michel Barbeau - School of Computer Science Skip to Main Content Home / PeopleMichel BarbeauProfessor Michel BarbeauProfessorDegrees:Ph.D. Computer Science Universite de Montreal (1991), M.Sc. Computer Science Universite de Montreal (1987), B.Sc. Computer Science Universite de Sherbrooke (1985)Phone:613-520-4333Email:barbeau@scs.carleton.caOffice:HP5336Website:Michel Barbeau HomepageResearch Interests Wireless Communications and Networking Specific Research Interests Wide area ad hoc networks, underwater communications and networks, quantum communications and networks, software defined radio. Current Research Dr. Barbeau’s research specializes in non classical wireless networks. His current research has involved developing an acoustic network for underwater communication to aid in water based surveillance in areas ranging from coastal navigation to environmental monitoring. Working alongside a team of undergraduate, master’s and doctoral students, Dr. Barbeau is testing ways to use mechanical vibrations to send encoded messages between underwater nodes. His team has worked to find ways to deal with challenges like multipath propagation of underwater acoustic waves – when signals are received by more than one path – influenced by reflection at sea surface and seabed, and refraction due to factors like water temperature, depth and surface waves, among other. His team tested their prototype in Ottawa’s Rideau Canal. Biography Dr. Barbeau received both his Master’s and Ph.D. from Universite de Montreal. He then returned to Universite de Sherbrooke, where he had completed his undergraduate degree in Computer Science in 1985, to join the faculty as a professor. Teaching at Universite de Sherbrooke from 1991 to 1999, Dr. Barbeau spent his last academic year as a visiting researcher at the University of Aizu, Japan. He joined the School of Computer Science at Carleton University in 2000. YouTube Michel Barbeau’s YouTube channel Twitter Michel Barbeau’s Twitter feed ORCID orcid.org/0000-0003-3531-4926 Share: Twitter, Facebook Short URL: https://carleton.ca/scs/?p=630 Close the search modal Search Search Search Magnifying glass",
  "content_length": 2155,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:14"
}