{
  "name": "Michael Backes 0001",
  "homepage": "https://cispa.de/en/people/backes",
  "status": "success",
  "content": "Michael Backes Send email Copy Email Address Faculty Michael Backes Founding Director and CEO Research Group AI Security and Privacy Android Artificial Intelligence Deep Generative Models Deep Learning Machine Learning Mobile Security Anonymity Assessment and Protection Privacy of Medical Data Secure and Privacy Preserving Machine Learning Software Security and Defenses Privacy Preserving Machine Learning Privacy Email Address Stuhlsatzenhaus 5 66123 Saarbrücken (Germany) Awards (selection) 2023: ACM Fellow 2019: Karl-Heinz Beckurts Prize 2018: IEEE Fellow 2018: Honorary Doctorate 2017: NSA Cybersecurity Research Award 2017: IEEE Golden Core Award 2017: CNIL-INRIA Privacy Award 2014: ERC Synergy Grant 2014: IEEE Outstanding Community Service Award 2011: IEEE Outstanding Community Service Award 2009: MIT TR35 2009: ERC Starting Grant 2008: IBM Faculty Award 2007: Fellow of the German Max Planck Society 2005: IBM Outstanding Achievement Award for Linking Formal Verification and Cryptography 2005: IBM Research Division Award for contributions to Web Services Security 2004: Microsoft Award for outstanding research in privacy enhancing technologies 2004: IBM Outstanding Achievement Award for contributions to Enterprise Privacy Architectures 2002: VDI Diploma Thesis Award 2001: Scholarship of the DFG graduate studies program ”Quality Guarantees for Computer Systems” Further Information https://michaelbackes.eu Michael Backes on Facebook Michael Backes on Instagram Michael Backes on LinkedIn Michael Backes on profiles.cispa Short Bio Michael Backes is the founding director and CEO of the CISPA Helmholtz Center for Information Security. In his research, Prof. Backes focuses primarily on trustworthy methods for machine learning, on novel approaches for protecting personal data, and on universal solutions for software and system security. His research results have shaped these scientific fields internationally, as is evidenced by over 300 peer-reviewed and highly cited publications in renowned international journals and conference proceedings. His research has earned him internationally renowned scientific awards and honors, in particular the ERC Synergy Grant, which is Europe's most highly endowed EU group research award, the Karl Heinz Beckurts Prize, an ERC Starting Grant, the Caspar Bowden Privacy Award, the IEEE and ACM Fellowship, as well as various Career Awards and Best Paper Awards. His research results have regularly been translated into highly innovative applications that have brought him widespread attention beyond the scientific community. In particular, Prof. Backes was the first German to receive the MIT TR35 Award, which recognized him as one of the top 35 researchers and innovators in the world under the age of 35 (across disciplines) whose “accomplishments are poised to have a dramatic impact on the world as we know it”. Michael Backes is regularly listed in rankings as one of Germany's most important IT personalities. He holds an honorary doctorate from the Université de Lorraine and is both honorary citizen and future ambassador of the city of St. Ingbert. CV: Last stations Since 2017 CISPA Helmholtz Center for Information Security - Founding Director and Chairman (CEO) Since 2005 Saarland University - Professor 2011-2018 CISPA, Saarland University - Scientific Director 2007 - 2017 Max Planck Institute for Software Systems - Max Planck Fellow Download CV Publications by Michael Backes Year 2025 2025-11-04 Breaking Agents: Compromising Autonomous LLM Agents Through Malfunction Amplification Conference / Medium Conference on Empirical Methods in Natural Language Processing (EMNLP) Tags Trustworthy Information Processing Authors Boyang Zhang Yicong Tan Yun Shen Ahmed Salem Michael Backes Savvas Zannettou Yang Zhang Full Paper Visit Detail Page 2025-10-21 Hate in Plain Sight: On the Risks of Moderating AI-Generated Hateful Illusions Conference / Medium IEEE International Conference on Computer Vision (ICCV) Tags Trustworthy Information Processing Authors Yiting Qu Ziqing Yang Yihan Ma Michael Backes Savvas Zannettou Yang Zhang Full Paper Visit Detail Page 2025-10-15 UnsafeBench: Benchmarking Image Safety Classifiers onReal-World and AI-Generated Images Conference / Medium ACM Conference on Computer and Communications Security (CCS) Tags Trustworthy Information Processing Authors Yiting Qu Xinyue Shen Yixin Wu Michael Backes Savvas Zannettou Yang Zhang Full Paper Visit Detail Page 2025-10-13 DivTrackee versus DynTracker: Promoting Diversity in Anti-Facial Recognition against Dynamic FR Strategy Conference / Medium ACM Conference on Computer and Communications Security (CCS) Tags Trustworthy Information Processing Authors Wenshu Fan Minxing Zhang Hongwei Li Wenbo Jiang Hanxiao Chen Xiangyu Yue Michael Backes Xiao Zhang Full Paper Visit Detail Page 2025-10-06 Revealing the Risk of Hyper-parameter Leakage in Deep Reinforcement Learning Models Article IEEE Transactions on Dependable and Secure Computing Tags Trustworthy Information Processing Authors Linkang Du Zhikun Zhang Min Chen Mingyang Sun Shouling Ji Peng Cheng Jiming Chen Michael Backes Yang Zhang Full Paper Visit Detail Page 2025-09-16 Revisiting Transferable Adversarial Images: Systemization, Evaluation, and New Insights Article IEEE Transactions on Pattern Analysis and Machine Intelligence Tags Trustworthy Information Processing Authors Zhengyu Zhao Hanwei Zhang Renjue Li Ronan Sicre Laurent Amsaleg Michael Backes Qi Li Qian Wang Chao Shen Full Paper Visit Detail Page 2025-08-14 Bridging the Gap in Vision Language Models in IdentifyingUnsafe Concepts Across Modalities Conference / Medium Usenix Security Symposium (USENIX-Security) Tags Trustworthy Information Processing Authors Yiting Qu Michael Backes Yang Zhang Full Paper Visit Detail Page 2025-08-14 Synthetic Artifact Auditing: Tracing LLM-Generated Synthetic Data Usage in Downstream Applications Conference / Medium Usenix Security Symposium (USENIX-Security) Tags Authors Yixin Wu Ziqing Yang Michael Backes Yang Zhang Full Paper Visit Detail Page 2025-08-13 On the Proactive Generation of Unsafe Images From Text-To-Image Models Using Benign Prompts Conference / Medium Usenix Security Symposium (USENIX-Security) Tags Authors Yixin Wu Ning Yu Michael Backes Yun Shen Yang Zhang Full Paper Visit Detail Page 2025-07-27 JailbreakRadar: Comprehensive Assessment of Jailbreak Attacks Against LLMs Conference / Medium Annual Meeting of the Association for Computational Linguistics (ACL) Tags Trustworthy Information Processing Authors Junjie Chu Yugeng Liu Ziqing Yang Xinyue Shen Michael Backes Yang Zhang Full Paper Visit Detail Page",
  "content_length": 6661,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:39"
}