{
  "name": "Michael J. Black [IS]",
  "homepage": "https://ps.is.tuebingen.mpg.de/person/black",
  "status": "success",
  "content": "Michael Black | Perceiving Systems – Max Planck Institute for Intelligent Systems Institute Homepage Institute Homepage Sign In Back Michael Black Perceiving Systems Director Office: N3.019 Germany +49 7071 601 1801 arXiv Google Scholar GitHub Linkedin X Download CV Biography Research Students PostDocs Affiliations Contact Talks Workshops Publications Curriculum Vitae [pdf] wikipedia Conflict of Interest Disclosure This includes any corporate activity within the last 5 years involving more than $5000 where I have a personal or professional interest or any role in which I have corporate responsibility. Corporate research funding (unrestricted): Intel, NVIDIA, Meta/Facebook, and Amazon. Financial interests (e.g. stock): Meshcapade. Commercial licensing of MPI technology where I am a co-inventor. Side employment: Meshcapade (19%, Dec. 2022-present), Amazon (20%, 2017-2021). Citations Google Scholar citations Research Gate Semantic Scholar DBLP ORCHID ID Blog Perceiving-Systems.blog On Medium Video YouTube bilibili (China) Social Media X BlueSky LinkedIn Biography Short Michael Black is one of the founding directors at the Max Planck Institute for Intelligent Systems in Tübingen, Germany, where he leads the Perceiving Systems department. He is also an Honorarprofessor at the University of Tübingen and serves as the Speaker of Cyber Valley, Europe’s leading AI research consortium. Black received his B.Sc. from the University of British Columbia (1985), his M.S. from Stanford (1989), and his Ph.D. from Yale University (1992). He has held positions at the University of Toronto, Xerox PARC, and Brown University. He was also a Distinguished Amazon Scholar (2017-2021). He is a recipient of the PAMI Distinguished Researcher Award, the 2025 Mark Everingham Prize, and five \"test of time\" awards including the 2024 ACM SIGGRAPH Asia “test of time” award, the 2022 and 2010 Koenderink Prize, the 2020 Longuet-Higgins Prize, and the 2013 Helmholtz Prize. He is a member of the German National Academy of Sciences Leopoldina and a foreign member of the Royal Swedish Academy of Sciences. In 2013 he co-founded Body Labs Inc., which was acquired by Amazon in 2017. He is a co-founder and the Chief Scientist of Meshcapade GmbH. Shorter (100 words) Michael Black is a founding director at the Max Planck Institute for Intelligent Systems and an Honorarprofessor at the University of Tübingen. He received his B.Sc. from the University of British Columbia (1985), M.S. from Stanford (1989), and Ph.D. from Yale (1992). He held positions at the University of Toronto, Xerox PARC, Brown, and Amazon. He received the PAMI Distinguished Researcher Award, the Everingham Prize, the 2022 and 2010 Koenderink Prize, the 2020 Longuet-Higgins Prize, and the 2013 Helmholtz Prize. He is a member of two national academies (Germany and Sweden). He has co-founded two companies: Body Labs and Meshcapade. Head shot white background (11MB) black background (337KB) Education Yale University, New Haven, CT Ph.D., Computer Science, 1992. Stanford University, Stanford, CA M.S., Computer Science, 1989. The University of British Columbia, Vancouver, BC B.Sc., Honours Computer Science, 1985. Selected Awards/Honors 2025 Mark Everingham Prize To the SMPL Body Model Team for the family of foundation models that have enabled body pose reserach. Co-authors: Matthew Loper, Naureen Mahmood, Javier Romero and Gerard Pons-Moll. 2024 ACM SIGGRAPH Asia Test-of-Time Award For the paper \"MoSh: Motion and shape capture from sparse markers\", published at SIGGRAPH Asia 2014. Co-authors: Matthew Loper, Naureen Mahmood, Michael J. Black. 2023 PAMI Distinguished Researcher Award. 2022 Koenderink Prize for Fundamental Contributions in Computer Vision, for the paper \"A naturalistic open source movie for optical flow evaluation\", by Butler, D. J. and Wulff, J. and Stanley, G. B. and Black, M. J. Best Paper Award, German Conference on Pattern Recognition, GCPR 2022, for the paper \"InvGAN: Invertible GANs\", by Partha Ghosh, Dominik Zietlow, Michael J. Black, Larry S. Davis, Xiaochen Hu. Max-Planck-Gründungspreis des Stifterverbandes, Science Prize 2022 in the Entrepreneurship category, to Naureen Mahmood, Talha Zaman, and Michael J. Black for the Meshcapade GmbH team, in recognition of this successful spin-off and the particularly high impact on society. Berlin, June 21, 2022. German National Academy of Sciences Leopoldina Member since May 2021. 2020 Longuet-Higgins Prize for the paper Sun, D., Roth, S., Black, M. J., “Secrets of optical flow estimation and their principles,” In IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), pages: 2432–2439, IEEE, June 2010. Alumni Research Award University of British Columbia, Department of Computer Science, 2018. Royal Swedish Academy of Sciences Foreign member, Class for Engineering Sciences, since June 2015. 2013 Helmholtz Prize for the paper: Black, M. J., and Anandan, P., \"A framework for the robust estimation of optical flow,'' IEEE International Conference on Computer Vision, ICCV, pages 231-236, Berlin, Germany. May 1993. 2010 Koenderink Prize for Fundamental Contributions in Computer Vision, with Sidenbladh, H. and Fleet, D. J. for the paper \"Stochastic tracking of 3D human figures using 2D image motion,'' European Conference on Computer Vision, 2000. Best Paper Award, Eurographics 2017, for the paper \"Sparse Inertial Poser: Automatic 3D Human Pose Estimation from Sparse IMUs\", by von Marcard, T., Rosenhahn, B.,  Black, M. J., Pons-Moll, G. \"Dataset Award\" at the Eurographics Symposium on Geometry Processing 2016, with F. Bogo, J. Romero, and M. Loper,  for the paper \"FAUST: Dataset and evaluation for 3D mesh registration,\" CVPR 2014. Best Paper Award, International Conference on 3D Vision (3DV), 2015, with A. O. Ulusoy and A. Geiger,  for the paper \"Towards Probabilistic Volumetric Reconstruction using Ray Potentials.\" Best Paper Award, INI-Graphics Net, 2008, First Prize Winner of Category Research, with S. Roth for the paper  \"Steerable random fields.\" Best Paper Award, Fourth International Conference on Articulated Motion and Deformable Objects (AMDO-e 2006), with L. Sigal for the paper \"Predicting 3D people from 2D pictures.'' Marr Prize, Honorable Mention, Int. Conf. on Computer Vision, ICCV-2005, Beijing, China, Oct. 2005 with S. Roth for the paper \"On the spatial statistics of optical flow.'' Marr Prize, Honorable Mention, Int. Conf. on Computer Vision, ICCV-99, Corfu, Greece, Sept. 1999 with D. J. Fleet for the paper \"Probabilistic detection and tracking of motion discontinuities.'' IEEE Computer Society, Outstanding Paper Award, Conference on Computer Vision and Pattern Recognition, Maui, Hawaii, June 1991 with P. Anandan for the paper \"Robust dynamic motion estimation over time.'' Commendation and Chief's Award, Henrico County Division of Police, County of Henrico, Virginia, April 19, 2007. University of Maryland, Invention of the Year, 1995, \"Tracking and Recognizing Facial Expressions,'' with Y. Yacoob. University of Toronto, Computer Science Students' Union Teaching Award for 1992-1993. Employment and Positions Held Max Planck Institute for Intelligent Systems Tübingen, Germany Director, 1/11 - present Managing Director,  7/23 - 12/25, 2/13 - 6/15, 3/18 - 11/18 Meshcapade Tübingen, Germany Chief Scientist (Dec. 2022-present) and co-founder. Eberhard Karls Universität Tübingen, Faculty of Science, Department of Computer Science Tübingen, Germany Honorarprofessor, 05/22/12 - present Amazon Tübingen, Germany Distinguished Amazon Scholar (VP Technology - Software Dev), 11/17 - 12/21 Body Labs Inc. New York, NY, USA Co-founder, Science Advisor, Member of the Board, 01/13 - 10/2017 ETH Zürich, Dept. of Information Technology and Electrical Engineering Zürich, Switzerland Visting Professor, 04/2014 - 04/2016 Stanford University, Electrical Engineering Stanford, CA Visiting Professor, 5/11-4/12, 7/12-7/13 Brown University, Department of Computer Science, Providence, RI Adjunct Professor (Research), 1/11-present Professor, 7/04-12/10 Associate Professor, 7/00-6/04 My research addressed the problem of estimating and explaining motion in image sequences. I developed methods detecting and tracking 2D and 3D human motion including the introduction of particle filtering for 3D human tracking and belief propagation for 3D human pose estimation.  I worked on probabilistic models of images include the high-order Field of Experts model.  I worked on 3D human shape estimation from images and video and developed applications of this technology.  I also developed mathematical models for decoding neural signals.  This included the first uses of particle filtering and Kalman filtering for decoding motor cortical neural activity and the first point-and-click cortical neural brain-machine-interface for people with paralysis. Xerox Palo Alto Research Center, Palo Alto, CA Area Manager, Image Understanding Area, 1/96-7/00 Member of Research Staff, 9/93-12/95 Research included modeling image changes (motion, illumination, specularity, occlusion, etc.) in video as a mixture of causes. I developed methods of motion explanation; that is, the extraction of mid-level or high-level concepts from motion. This included the modeling and recognition of motion \"features\" (occlusion boundaries, moving bars, etc.), human facial expressions and gestures, and motion \"texture\" (plants, fire, water, etc.).  I applied these methods to problems in video indexing, motion for video annotation, teleconferencing, and gestural user interfaces. Other research included robust learning of image-based models, regularization with transparency, anisotropic diffusion, and the recovery of multiple shapes from transparent textures. University of Toronto, Toronto, Ontario Assistant Professor, Department of Computer Science, (8/92 - 9/93). Research included the application of mixture models to optical flow, detection and tracking of surface discontinuities using motion information, a",
  "content_length": 11685,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:18"
}