{
  "name": "Michael Fisher 0001",
  "homepage": "https://research.manchester.ac.uk/en/persons/michael.fisher",
  "status": "success",
  "content": "Michael Fisher - Research Explorer The University of Manchester Michael Fisher Royal Academy of Engineering Chair in Emerging Technologies, Prof Professor of Computer Science, Autonomy and Verification https://orcid.org/0000-0002-0875-3862 Personal profile OverviewFor up to date information, see here Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsHonorary Professor, University of Liverpool2020 → 2023Chair in Emerging Technology, The Royal Academy of Engineering2019 → 2029 Areas of expertiseQA76 Computer softwareBC LogicResearch Beacons, Institutes and PlatformsSustainable Futures Fingerprint Dive into the research topics where Michael Fisher is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Temporal Logic Computer Science 100% Formal Verification Computer Science 84% Robot Computer Science 72% Autonomous System Computer Science 61% Model Checking Computer Science 39% Case Study Computer Science 31% Robotic System Engineering 28% Decision-Making Computer Science 25% View full fingerprint Research output 62 Article 61 Conference contribution 7 Chapter 5 Book 13 More 4 Other contribution 3 Paper 2 Other chapter contribution 2 Preprint 1 Other report 1 Data set/Database Research output per year Research output per year Trustworthy AIChatila, R., Dignum, V., Fisher, M., Giannotti, F., Morik, K., Russell, S. & Yeung, K., 2021, Reflections on Artificial Intelligence for Humanity. Braunschweig, R. & Ghallab, M. (eds.). Springer Nature, p. 13-39 27 p. (Lecture Notes in Computer Science; vol. 12600)(Lecture Notes in Artificial Intelligence; vol. 12600).Research output: Chapter in Book/Conference proceeding › Chapter A corroborative approach to verification and validation of human–robot teamsWebster, M., Western, D., Araiza-Illan, D., Dixon, C., Eder, K., Fisher, M. & Pipe, A. G., 1 Jan 2020, In: The International Journal of Robotics Research. 39, 1, p. 73-99 27 p.Research output: Contribution to journal › Article › peer-review Open Access Validation Technique 100% Robot 40% Interaction Task 40% Formal Verification 20% Iterative Process 20% Towards a framework for certification of reliable autonomous systemsFisher, M., Mascardi, V., Rozier, K. Y., Schlingloff, B.-H., Winikoff, M. & Yorke-Smith, N., 1 Apr 2021, In: Autonomous Agents and Multi-Agent Systems. 35, 1, 8.Research output: Contribution to journal › Article › peer-review Open Access Frame-work 100% Capabilities 100% Action 100% Verification 100% Civilians 100% On Proactive, Transparent, and Verifiable Ethical Reasoning for RobotsBremner, P., Dennis, L. A., Fisher, M. & Winfield, A. F., Mar 2019, In: IEEE. Proceedings. 107, 3, p. 541-561Research output: Contribution to journal › Article › peer-review Open Access Robot 100% Formal Verification 33% Internal Model 33% Logic Structure 33% Case Study 33% Formal specification and verification of autonomous robotic systems: A surveyLuckcuck, M., Farrell, M., Dennis, L. A., Dixon, C. & Fisher, M., 13 Sept 2019, In: ACM Computing Surveys. 52, 5, 100.Research output: Contribution to journal › Article › peer-review Open Access Formal Verification 100% Formal Specification 100% Sufficient Evidence 33% View all 148 research outputs Projects 1 Not started 2 Finished 2 Active Projects per year CRADLE: CRADLE - Centre for Robotic Autonomy in Demanding and Long-lasting EnvironmentsFisher, M. (PI), Adorno, B. (CoI), Cangelosi, A. (CoI), Dennis, L. (CoI), Dixon, C. (CoI), Groves, K. (CoI), Lennox, B. (CoI) & Watson, S. (CoI)1/09/23 → 31/08/28Project: Research Autonomous System 100% Robot 57% Dynamic Environment 42% Unexpected Event 42% Agent-Oriented 42% Centre for Digital Trust and SocietyBarrett, E. (PI), Allmendinger, R. (Researcher), Elliot, M. (Researcher), Lord, N. (Researcher), Cordeiro, L. (Researcher), Gibson, R. (Researcher), Papamarkou, T. (Researcher), Dresner, D. (Researcher), Aldridge, J. (Researcher), Duncan, P. (Researcher), Banach, R. (Researcher), Brown, G. (Researcher), Dennis, L. (Researcher), Fisher, M. (Researcher), Korovin, K. (Researcher), Kotselidis, C.-E. (Researcher), Luján, M. (Researcher), Mustafa, M. (Researcher), Olivier, P. (Researcher), Reger, G. (Researcher), Zhang, N. (Researcher), Hodgkinson, G. (Researcher), Gulati, S. (Researcher), Ainsworth, J. (Researcher), Chen, Y.-W. (Researcher), Green, B. (Researcher), Healey, M. (Researcher), Uyarra, E. (Researcher), Zachariadis, M. (Researcher), Little, C. (Researcher), Mackey, E. (Researcher), Nenadic, G. (Researcher), Keane, J. (Researcher), Shlomo, N. (Researcher), Graff, N. (Researcher), Jarwar, M. A. (Researcher), Shariati Samani, S. (Researcher), Smith, D. (Researcher), Kambites, M. (Researcher), Thorpe, M. (Researcher), Rowley, P. (Researcher), Flynn, S. (Researcher), Turner, P. (Researcher), Wainwright, V. (Researcher), Czerwinsky, A. (PGR student), Nini, A. (Researcher), Broad, R. (Researcher), Shute, J. (Researcher), Deakin, J. (Researcher), Taboada, P. (PGR student), Knight, P. (Researcher), Hutchings, S. (Researcher), Whyte, J. (Researcher), Tolz-Zilitinkevic, V. (Researcher), Pilkington, H. (Researcher), Guharoy, S. (Researcher), Nicolo, A. (Researcher), Reggiani, C. (Researcher), Garcia Oliva, J. (Researcher), Van Someren, A. (Researcher), Bon, E. (Researcher), Cantijoch Cunill, M. (Researcher), Koch, D. (Researcher) & Chen, Y.-W. (Researcher)11/05/21 → …Project: Other Social Statistics 100% Computer Science 100% Interdisciplinary Research 100% Social Research 100% Business School 100% RAI: Centre for Robotics and Artificial IntelligenceCangelosi, A. (PI), Lennox, B. (PI), Weightman, A. (CoI), Dennis, L. (CoI), Dixon, C. (CoI), Fisher, M. (CoI), Herrmann, G. (CoI), Dickson, A. (CoI), Lanzon, A. (CoI), Stancu, A. (CoI), Miller, A. (CoI), Freitas, A. (CoI), Nini, A. (CoI), Voronkov, A. (CoI), Brass, A. (CoI), Vijayaraghavan, A. (CoI), Parslew, B. (CoI), crowther, W. (CoI), Grieve, B. (CoI), Adorno, B. (CoI), Jay, C. (CoI), Wang, C. C. L. (CoI), Todd, C. (CoI), Soutis, C. (CoI), Arsene, C. (CoI), Dresner, D. (CoI), Barrett, E. (CoI), Gowen, E. (CoI), Arvin, F. (CoI), Podd, F. (CoI), Brown, G. (CoI), Reger, G. (CoI), Cooper, G. (CoI), Mairs, H. (CoI), Yin, H. (CoI), Kinloch, I. (CoI), Eleftheriou, I. (CoI), Li, J. (CoI), Carrasco Gomez, J. (CoI), Ainsworth, J. (CoI), Sinha, J. (CoI), Ozanyan, K. (CoI), Smith, K. (CoI), Twomey, K. (CoI), Margetts, L. (CoI), Ren, L. (CoI), Zhang, L. (CoI), Cordeiro, L. (CoI), Rattray, M. (PI), Bissett, M. (CoI), Elliot, M. (CoI), Alvarez, M. (CoI), Luján, M. (CoI), Nabawy BSc, MSc, PhD, MRAeS, SMAIAA, FHEA, M. (CoI), Peek, N. (CoI), Marjanovic, O. (CoI), Dorn, O. (CoI), Dudek, P. (CoI), Green, P. (CoI), Connolly, P. (CoI), Da Silva Bartolo, P. J. (CoI), Gardner, P. (CoI), Martin, P. (CoI), Potluri, P. (CoI), Curtis, R. (CoI), Schmidt, R. (CoI), Banach, R. (CoI), Batista-Navarro, R. T. (CoI), Kaski, S. (CoI), Midson, S. (CoI), Watson, S. (CoI), Holm, S. (CoI), Furber, S. (CoI), Schlegel, V. (CoI), Mirihanage, W. (CoI), Mansell, W. (CoI), Pan, W. (CoI), Sampson, B. (CoI), Sellers, W. (CoI), Yang, W. (CoI), Cai, P. (CoI), Sun, Y. (CoI), Alharthi, A. (Researcher), Macario Rojas, A. (Researcher), Serhan, B. (Researcher), Yu, C. (Researcher), Abara, D. (Researcher), Lopez Pulgarin, E. (Researcher), Faruq, F. (Researcher), Tavella, F. (Researcher), Semeraro, F. (Researcher), Liu, G. (Researcher), Fang, G. (Researcher), Niu, H. (Researcher), Taylor, H. (PI), Zhu, H. (PGR student), Collenette, J. (Researcher), Amano, K. (Researcher), Lo, K. C. J. (PGR student), Raggioli, L. (Researcher), Romeo, M. (Researcher), Ruocco, M. (PGR student), Ghaffari Saadat, M. (Researcher), Walmsley, M. (Researcher), Mubarik, A. (Researcher), Vinanzi, S. (Researcher), Su, Y.-H. (PGR student), McAleese, H. (PGR student), Stringer, P. (PGR student), Stoican, R. (PGR student), Ye, R. (PGR student), Kurawa, S. S. (PGR student), Zhang, T. (PGR student), Krywonos, W. (PGR student), Xu, Y. (PGR student), Tian, Y. (PGR student), Henderson, A. (Technical team), Morley, D. (Support team), Tallentire, J. (Support team), Smith, J. (Support team), Hawthornthwaite, S. (Support team), Carlson, J. (Support team) & Baniqued, P. D. (Researcher)Project: Research Robot 100% Human Robot Interaction 22% Digital Twin 20% Cognitive Architecture 17% Autonomous System 17% FAIR-SPACE: Future AI and Robotics Hub for Space (FAIR-SPACE) Fisher, M. (PI), Dennis, L. (CoI) & Dixon, C. (CoI)13/07/20 → 31/03/22Project: Research Robotics 100% S4: Science of Sensor System Software Fisher, M. (PI) & Dixon, C. (CoI)12/07/20 → 31/12/21Project: Research System Software 100% Sensor System 100% Sensor 100% Software 100% Transferring 100% Prizes Best Paper AwardGainer, P. (Recipient), Linker, S. (Recipient), Dixon, C. (Recipient), Hustadt, U. (Recipient) & Fisher, M. (Recipient), Nov 2018Prize: Prize (including medals and awards) Springer Best Paper AwardDixon, C. (Recipient), Webster, M. P. (Recipient), Saunders, J. (Recipient), Fisher, M. (Recipient) & Dautenhahn, K. (Recipient), 2014Prize: Prize (including medals and awards) Impacts Centre for Robotic Autonomy in Demanding and Long Lasting Environments (CRADLE)Baniqued, P. D. (Participant), Lennox, B. (Participant), Fisher, M. (Participant), Watson, S. (Participant), Flint, S. (Participant), Khan, D. (Participant), Tse, K. W. (Participant), Adorno, B. (Participant), Groves, K. (Participant), Atia, M. (Participant), Leslie-Dalley, S. (Participant), Dennis, L. (Participant), Zheng, S. (Participant), Limarga, R. (Participant), Farrell, M. (Collaborator), Cangelosi, A. (Participant), Dixon, C. (Participant), Collins, E. (Collaborator), Tavella, F. (Participant), Bolarinwa, J. (Participant), Chi, X. (Participant), Rolph, M. (Partic",
  "content_length": 10351,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:00"
}