{
  "name": "Michael S. Horn",
  "homepage": "http://tidal.northwestern.edu",
  "status": "success",
  "content": "TIDAL Lab TIDAL Lab is a team of designers, artists, learning scientists, and computer scientists at Northwestern University. Our research creates and studies innovative technology-based learning experiences. We take a cautious but optimistic stance towards technology in a process that tightly couples research and design. Museum Exhibits Build-a-Tree Exhibit Build-a-Tree is a multi-level puzzle game designed to help people learn about evolution and phylogenetic trees. Through game play people can learn about relationships between different organisms as well as the traits that help define those relationships. Build-a-Tree is on display at the California Academy of Sciences in San Francisco. Grant: NSF DRL-1010889 DeepTree Exhibit DeepTree is a multi-touch museum exhibit that visualizes the evolutionary history of all of life on earth. Containing over 70,000 species, DeepTree allows people to fly through a vast tree of life starting 3.5 billion years ago. Any two species in the tree can be compared to understand the key evolutionary landmarks that define their relationship. Grant: NSF DRL-1010889 Frog Pond Exhibit Frog Pond is an interactive exhibit that we are developing in partnership with the Computer History Museum in Mountain View, California. The exhibit features an interactive tabletop with a graphical computer programming language. Visitors create simple computer programs to control the actions of many colorful frogs that hop around a lily pond. Robot Park Exhibit Robot Park is an exhibit on robotics and computer programming at the Museum of Science, Boston. Robot Park was launched in 2007 and features the Tern tangible programming language. Visitors create simple computer programs using chains of wooden blocks that control the actions of an iRobot Create. Grant: NSF IIS-0414389 Recent Research Projects TunePad TunePad is a free, online platform for creating digital music with Python code. TunePad has been used with hundreds of students from 3rd grade to college in a wide range of informal and formal education spaces. TunePad features an innovative computational notebook structure that we call Playbooks. Grant: NSF 1612619, 1451762, 1837661 Strawbies Strawbies is an open ended coding game for the iPad and Osmo. Players ages 5 and up use wooden coding blocks to guide Awbie through a fun and engaging world. Tern Tern is a tangible computer language designed to provide an easy introduction to programming. Tern combines inexpensive materials and reliable computer vision to offer a portable and flexible programming environment. Tern was featured at the Boston Museum of Science and the Tangible Kindergarten project at the Tufts University. Grant: NSF IIS-0414389, NSF DRL-0735657 Green Home Games Green Home Games creates playful activities for families to learn about energy consumption in homes. Through this project we have developed a board game called Turn Up the Heat! designed to help parents and children think about tradeoffs related to comfort, energy, and the environmental sustainability. Grant: NSF IIS-1123574 Roberto Roberto is a computational literacy stickerbook. The design combines a physical children's storybook with embedded sticker activities. Chains of stickers form simple computer programs that control an digital version of Roberto animated on a smartphone or tablet computer. Spark Spark is an interactive learning environment in which users interact with electrical circuits at two levels. Users can create and test a variety of circuits and simultaneously inspect agent-based computational models of circuit components. These models show interactions between electrons and ions as they move through circuit components. BioMap BioMap is an interactive visualization of all of life on earth. BioMap uses a Voronoi Treemap algorithm to organize hundreds of thousands of species into nested clades. Users can drill down into nested levels to learn more about the diversity of life on earth. Sickle Cell Station This research focuses on the development of educational material for children in waiting areas at clinics for Sickle Cell Disease treatment. We have developed a variety of educational material including a augmented reality of hemoglobin structure inside red blood cells, a virtual model of blood flow, and an oversized tangible replica of a blood vessel. Affiliated Research Labs Center for Connected Learning and Computer-Based Modeling (CCL) http://ccl.northwestern.edu Scientists' Discovery Room (SDR) Lab Harvard University http://sdr.seas.harvard.edu Learning, Interaction, and Media in the Everyday (LIME) Northwestern University The Collaborative Technology Laboratory (CollabLab) Northwestern University http://collablab.northwestern.edu Delta Lab Northwestern University http://delta.northwestern.edu Office of STEM Education Partnerships (OSEP) Northwestern University http://osep.northwestern.edu Museum Collaborators",
  "content_length": 4913,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:52"
}