{
  "name": "Michael C. Ferris",
  "homepage": "http://pages.cs.wisc.edu/~ferris",
  "status": "success",
  "content": "Michael C. Ferris My UW | UW Search Computer Science Home Page Biography Contact  Information Teaching Research Software Recent talks Books Publications PhD Students Professional Activities UW Optimization  Home Page Michael C. Ferris John P. Morgridge Chair in Computer Sciences & Jacques-Louis Lions Professor of Computer Sciences, and (by courtesy) Mathematics and Industrial and Systems Engineering Director, Hub Central, Wisconsin Institutes for Discovery Research Interests: Algorithms, environments, theory and applications of optimization. PhD: University of Cambridge, 1989 A brief history of some of the contributions to complementarity, games and equilibria from Wisconsin can be found here Details of work on covid vaccine planning is summarized in a panel discussion at the University of Wisconsin: Crossroads of ideas: Getting Wisconsin vaccinated (YouTube) a talk at American Family Insurance: (Using Optimization in planning problems: a Covid case (mp4)) a podcast from the Tommy Thompson Center on Public Leadership: (Podcast: Covid vaccines and Werewolf (html)) Dr. Ferris' research is concerned with algorithmic and interface development for large scale problems in mathematical programming, including links to the GAMS and AMPL modeling languages, and general purpose software such as PATH, NLPEC and EMP. He has worked on many applications of both optimization and complementarity, including cancer treatment planning, energy modeling, economic policy, traffic and environmental engineering, video-on-demand data delivery, structural and mechanical engineering. Ferris is a SIAM fellow, an INFORMS fellow, received the Beale-Orchard-Hays prize from the Mathematical Programming Society and is a past recipient of a NSF Presidential Young Investigator Award, and a Guggenheim Fellowship. He serves on the editorial boards of INFORMS Journal on Computing and Optimization Methods and Software. Curriculum Vitae (pdf) Recent talks Books Publications Computer Sciences | UW Home Feedback or content questions: send email to \"ferris\" at the cs.wisc.edu server Technical or accessibility issues: lab@cs.wisc.edu Copyright © 2002, 2003 The Board of Regents of the University of Wisconsin System.",
  "content_length": 2209,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:45"
}