{
  "name": "Michael Milford",
  "homepage": "https://research.qut.edu.au/qcr/people/michael-milford",
  "status": "success",
  "content": "Michael Milford - QUT Centre for Robotics Skip to content Prof Michael Milford Home Our People Prof Michael Milford Please enable JavaScript Please enable JavaScript Find Michael Milford onMichael Milford's full profile, contact information and publications are available on: Centre Director, Program Lead (Perception & Localisation), Professor, ARC Laureate Fellow (SLAM, positioning, navigation, mapping, bio-inspired) PhD (University of Queensland)I conduct interdisciplinary research at the boundary between robotics, neuroscience and computer vision and am a multi-award winning educational entrepreneur. My research models the neural mechanisms in the brain underlying tasks like navigation and perception to develop new technologies in challenging application domains such as all-weather, anytime positioning for autonomous vehicles. I am also passionate about engaging and educating all sectors of society around new opportunities and impacts from technology including robotics, autonomous vehicles and artificial intelligence. I currently hold the positions of Australian Research Council Laureate Fellow, Director of the QUT Centre for Robotics, QUT Professor, Microsoft Research Faculty Fellow and am a Fellow of the Australian Academy of Technology and Engineering.I have or am leading or co-leading projects totalling more than 48 million dollars in research and industry funding for fellowships and team grants. My papers have won (6) or been finalists (9) for 15 best paper awards including the 2012 ICRA Best Vision paper. My citation h-index is 50, with 13,182 citations as of November 2023. Awards include a Microsoft Research Faculty Fellowship, the ATSE Batterham Medal and Queensland Young Tall Poppy of the Year. I was named top robotics researcher in Australia by citation impact by The Australian Research Magazine (2023, 21, 19) and was a top 3 finalist for the Australian Museum Eureka Prize for Outstanding Early Career Researcher and the APEC ASPIRE Prize. I have dual Australian-US citizenship and have lived and worked in locations including Boston, Edinburgh and London. I have collaborated with organizations including Harvard University, Boston University, Oxford University, MIT, Google Deepmind, Amazon, Ford, Intel, NVIDIA, Caterpillar, the US Air Force Office of Scientific Research and NASA’s Jet Propulsion Laboratory.As a lifelong educational entrepreneur, I have created innovative educational resources for students for 20 years, with customers across 35 countries. My company Math Thrills combines mass market entertainment and STEM education to create math-filled young adult fiction and movie-inspired education. Math Thrills has received funding from Kickstarter, QUTBluebox and the AMP Foundation, honours including the Queensland Young Tall Poppy of the Year Award, finalist at the Reimagine Education awards, a TedXQUT talk and a World Science Festival event. We have over 20 titles including The Complete Guides to AI, and Autonomous Vehicles, for Kids, the STEM Storybook and Rachel Rocketeer. Projects (Chief investigator)Active, adaptive & predictive robot localizationAdversity‐ and Adversary‐Robust Adaptive Positioning Systems with IntegrityContextually Informed Joint Perception and Localization for Autonomous VehiclesContinously updating place descriptorsCut Deep: Cutting the Deep network layers for Efficient Representation LearningEvent-based localisation for ultra-fast systemsMining RoboticsNeuro-Autonomy: Neuroscience-Inspired Perception, Navigation, and Spatial Awareness for Autonomous Robots: AUSMURI projectNeuromorphic computingNeuromorphic sensors and engineering for place recognitionOut of Line: Sequence Processing and Learning for LocalizationPlace-informed Robotics and Autonomous VehiclesRe-Evolving Nature’s Best Positioning Systems for People and Their Machines: Australian Research Council Laureate Fellowship 2022-2027Reinforcement Learning for Robot Navigation and InteractionSee 3D: Bridging the Appearance-Geometry gap for 6-DoF, cm-precise visual localizationSemantic based onboard UAV navigationSpace Robotics: Scene Understanding for Lunar/Mars RoverTerrain Traversability Projects[COMPLETED] ARC Future Fellowship: Superhuman place recognition[COMPLETED] Automation-enabling positioning for underground mining[COMPLETED] Contextual Hazard Detection[COMPLETED] Evaluating the effect of illumination on the performance of visual odometry in underground mining environments[COMPLETED] HD maps for automated driving[COMPLETED] How automated vehicles will interact with road infrastructure[COMPLETED] Mini Autonomous Vehicles[COMPLETED] US AFOSR / AOARD: An infinitely scalable learning and recognition networkAUSMURI: Neuro-Autonomy: Neuroscience-Inspired Perception, Navigation, and Spatial Awareness for Autonomous RobotsAustralian Research Council Industrial Transformation Training Centre for Joint BiomechanicsAutomated Early-Detection of the Invasive Grass African LovegrassComplementarity-Aware Multi-Process Fusion for Long Term LocalizationNVIDIA Applied Research Accelerator ProgramRe-Evolving Nature’s Best Positioning Systems for People and Their MachinesReliability in Deep Machine Learning and Uncertainty for Object DetectionRheinmetall Defence Australia: Advanced Terrain Detection (ATD)Scene Understanding and Semantic SLAMSpike-based Visual Place Recognition using Intel’s LoihiVisual Place Recognition for Robotics in Extreme Environments Additional information Experience I conduct interdisciplinary research at the boundary between robotics, neuroscience and computer vision and am a multi-award winning educational entrepreneur. My research models the neural mechanisms in the brain underlying tasks like navigation and perception to develop new technologies in challenging application domains such as all-weather, anytime positioning for autonomous vehicles. I am also passionate about engaging and educating all sectors of society around new opportunities and impacts from technology including robotics, autonomous vehicles and artificial intelligence. I currently hold the positions of Australian Research Council Laureate Fellow, Director of the QUT Centre for Robotics, QUT Professor, Microsoft Research Faculty Fellow and am a Fellow of the Australian Academy of Technology and Engineering.I have or am leading or co-leading projects totalling more than 48 million dollars in research and industry funding for fellowships and team grants. My papers have won (6) or been finalists (9) for 15 best paper awards including the 2012 ICRA Best Vision paper. My citation h-index is 50, with 13,182 citations as of November 2023. Awards include a Microsoft Research Faculty Fellowship, the ATSE Batterham Medal and Queensland Young Tall Poppy of the Year. I was named top robotics researcher in Australia by citation impact by The Australian Research Magazine (2023, 21, 19) and was a top 3 finalist for the Australian Museum Eureka Prize for Outstanding Early Career Researcher and the APEC ASPIRE Prize. I have dual Australian-US citizenship and have lived and worked in locations including Boston, Edinburgh and London. I have collaborated with organizations including Harvard University, Boston University, Oxford University, MIT, Google Deepmind, Amazon, Ford, Intel, NVIDIA, Caterpillar, the US Air Force Office of Scientific Research and NASA’s Jet Propulsion Laboratory.As a lifelong educational entrepreneur, I have created innovative educational resources for students for 20 years, with customers across 35 countries. My company Math Thrills combines mass market entertainment and STEM education to create math-filled young adult fiction and movie-inspired education. Math Thrills has received funding from Kickstarter, QUTBluebox and the AMP Foundation, honours including the Queensland Young Tall Poppy of the Year Award, finalist at the Reimagine Education awards, a TedXQUT talk and a World Science Festival event. We have over 20 titles including The Complete Guides to AI, and Autonomous Vehicles, for Kids, the STEM Storybook and Rachel Rocketeer. Awards TypeAcademic Honours, Prestigious Awards or PrizesReference year2019Details2019 Batterham Medal for Engineering Excellence awarded by the Australian Academy of Technology and EngineeringTypeFellowshipsReference year2013DetailsMicrosoft Research Faculty Fellowship, $110,000TypeMembership of Review Panels on Prestigious Grant ApplicationsReference year2016DetailsAustralian Research Council for Discovery Projects and Discovery Early Career Outstanding Researcher FellowshipsTypeAcademic Honours, Prestigious Awards or PrizesReference year2013DetailsBest Paper Finalist\"Towards Condition-Invariant, Top-Down Visual Place Recognition,\" Michael Milford, Walter Scheirer, Eleonora Vig and David CoxTypeAcademic Honours, Prestigious Awards or PrizesReference year2013DetailsRay Jarvis Best Paper Award\"Towards Bio-inspired Place Recognition over Multiple Spatial Scales,\" Zetao Chen, Adam Jacobson, Ugur Murat Erdem, Michael Hasselmo and Michael MilfordTypeAcademic Honours, Prestigious Awards or PrizesReference year2016DetailsBest Paper Finalist Robotics Science and Systems Conference: Milford, M., \"Visual Route Recognition with a Handful of Bits\", Sydney, Australia, 2012.TypeMembership of Review Panels on Prestigious Grant ApplicationsReference year2013DetailsIsraeli Ministry of Science & Technology reviewer for Brain Research Infrastructure program grant reviewerTypeAcademic Honours, Prestigious Awards or PrizesReference year2012DetailsBest Robot Vision Paper Award at the 2012 International Conference on Robotics and AutomationTypeMembership of Review Panels on Prestigious Grant ApplicationsReference year2012DetailsCanadian Natural Sciences and Engineering Research Council Reviewer for Discovery GrantsTypeAcademic Honours, Prestigious Awards or PrizesReference year2006DetailsQueensland Young Achiever of the Year (Science and Technology)The aims are objectives of the program are to:Acknowledge & highlight ",
  "content_length": 12369,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:41"
}