{
  "name": "Michael M. Zavlanos",
  "homepage": "https://www.michaelmzavlanos.org",
  "status": "success",
  "content": "Michael M. Zavlanos top of pageMichael M. Zavlanos, Ph.D.Yoh Family Professor, Duke University Amazon Scholar, Amazon RoboticsBio​Michael M. Zavlanos is the Yoh Family Professor in the Department of Mechanical Engineering and Materials Science at Duke University. He also holds a secondary appointment in the Department of Electrical and Computer Engineering and the Department of Computer Science. He currently serves as the Director of the Healthcare Systems Optimization program with Duke AI Health and is also an Amazon Scholar with Amazon Robotics. His research focuses on control theory, optimization, machine learning, and AI with applications in robotics and autonomous systems, cyber-physical systems, and healthcare/medicine. He is a recipient of various awards including the Office of Naval Research Young Investigator Program (YIP) Award and the National Science Foundation Faculty Early Career Development (CAREER) Award. ​ Michael M. Zavlanos received the Diploma in mechanical engineering from the National Technical University of Athens (NTUA) in Greece, in 2002, and the M.S.E. and Ph.D. degrees in electrical and systems engineering from the University of Pennsylvania, in 2005 and 2008, respectively.Learn MoreRecent NewsOct. 2024. Michael M. Zavlanos joins Duke AI Health as Director of Healthcare Systems Optimization. ​ Sep. 2024. NeurIPS paper accepted on a new Distributionally Robust Optimization (DRO) framework that employs a new distance metric inspired by unbalanced optimal transport for enhanced outlier and missing data resilience.​ Jun 2024. New preprint on learning transferrable robot policies under large changes in visual observations. ​ Feb 2024. New preprint on learning from time-series data on graphs by integrating path signatures and GNNs. Sep 2023. New preprint on distributionally robust policy evaluation and learning.View All NewsContactbottom of page",
  "content_length": 1898,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:35"
}