{
  "name": "Michael L. Scott",
  "homepage": "https://www.cs.rochester.edu/~scott",
  "status": "success",
  "content": "Michael L. Scott's Home Page Michael L. Scott Arthur Gould Yates Professor of Engineering Department of Computer Science Hajim School of Engineering and Applied Sciences Rochester, NY 14627-0226 3401 Wegmans Hall phone (585) 275-5671, 5478; fax 273‑4556 URCS @ 50: remarks from the department’s 50th anniversary, September, 2024. (My portion starts at 3:01:40.) 2006 Dijkstra Prize in Distributed Computing Press release — Award citation — Acceptance speech Press Release for the Java 6 SynchronousQueue ACM Fellow listing — UR press release IEEE Life Fellow listing AAAS Fellow listing — UR press release Commencement addresses: 2003 URCS; 2021 AS&E+SMD Master’s degrees; 2021 URCS 2001 Goergen Teaching Award Acceptance speech — “How I Teach” essay 2010 “Last Lecture” 2020 Riker Teaching Award (p. 8) Named Professorship 2018 HSEAS Lifetime Achievement Award 2022 IEEE TCCA/HPCA Test of Time Award Bio & Research Summary Publications Courses Students Personal Links Research Projects Concurrency and Synchronization Montage:  a fast, general system for buffered persistent data structures.  Code to accompany the 2021 ICPP paper and 2021 DISC paper. Ralloc:  a fast, lock-free allocator for persistent memory. Code to accompany the 2020 ISMM paper. Interval-based memory reclamation:  fast support for nonblocking concurrent data structures.  Code to accompany the 2018 PPoPP paper. Release 7 of the RSTM Transactional Memory System for C++ pthreads programs. First-Class Operating System Management of Computational Accelerators DPR/TARDIS: Deterministic Parallel Ruby InterWeave: A Middleware System for Distributed Shared State CASHMERe: Coherent Shared Memory for Next-Generation Networks and Multiprocessors Programming Language Pragmatics, Fifth Edition Shared-Memory Synchronization, Second Edition Click here for a list of known errata. Available January, 2025 Co-authored by Joanathan Aldrich of Carnegie-Mellon University Fourth edition copyright © 2016 Third edition copyright © 2009 Second edition copyright © 2006 First edition copyright © 2000 Click here for a list ofknown errata. Published February, 2024 Co-authored by Trevor Brown of the University of Waterloo First edition copyright © 2013; Morgan & Claypool Publishers Download the book from Springer Nature, or check your library for a series subscription. Click here for a list of 1e errata. Courses CSC 2/454: Programming Language Design and Implementation (Fall 2025) CSC 400: Problem Seminar (Introduction to Graduate Study; Spring 2021) CSC 573: Persistent Memory (graduate seminar, Spring 2020) CSC 2/458: Parallel and Distributed Systems (Spring 2019) CSC 299: Social Implications of Computing (Spring 2018) CSC 252: Computer Organization (Spring 2014) CSC 162: The Art of Data Structures (Spring 2010) CSC 200: Undergraduate Problem Seminar (Introduction to Research) (Spring 2004) CSC 173: Computation and Formal Systems (Fall 2001) CSC 2/456: Operating Systems (Spring 2000) Current Graduate Students Mingzhe Du, Ph.D. Graduates Alan Beadle, “Operating System Services as Protected Libraries,” 2025. Alfred University (tenure-track faculty). Spyridoula Gravani (primary advisor John Criswell), “Efficient and Secure Intra-Address Space Isolation Using Memory Protection Keys,” 2025. VMware (Broadcom). Wentao Cai, “Nonblocking Data Structures on Persistent Memory,” 2022. Nvidia (formerly with Google Seattle). Hensen Wen, “Memory Management and Persistency of Multithreaded Applications,” 2022. StackAdapt, Toronto (formerly with Huawei Canada). Ryan Yates, “Improving Haskell Transactional Memory,” 2019. Groq, Inc. (formerly tenure-track faculty at Houghton College). Mohammad Hedayati-Goudarzi (co-supervised with Kai Shen), Fair OS management of very fast devices (ABD), 2019.  Google Seattle. Joseph Izraelevitz, “Concurrency Implications of Nonvolatile Byte-Addressable Memory,” 2017. University of Colorado, Boulder (tenure-track faculty; previous postdocs at the University of California, San Diego, and the IMDEA Software Institute, Madrid, Spain). Lingxiang Xiang, “Compiler Assisted Speculation for Multithreaded Systems,” 2015. Intel Labs, Santa Clara. Li Lu, “Designing for the Simple Case in a Parallel Scripting Language,” 2014.  Meta Platforms (formerly with Hortonworks and LaiOffer). lilu9.cn@gmail.com Konstantinos Menychtas (co-supervised with Kai Shen), “Fair, Protected OS-level Scheduling for Fast Computational Accelerators,” 2014.  Google. Luke D'Alessandro, “Preserving the Appeal of Transactional Programming,” 2013.  Nvidia Corp. (formerly at Univ. of Washington and Indiana Univ.). Michael F. Spear, “Fast Software Transactions,” 2009. Lehigh University (tenure-track faculty). Virendra Marathe, “Enhancing the Performance and Usability of Software Transactional Memory,” 2008. Oracle (formerly Sun) Laboratories. William N. Scherer III, “Synchronization and Concurrency in User-level Software Systems,” 2005.  Hewlett Packard Enterprise, Houston (formerly research faculty at Rice University). Athanasios Papathanasiou, “Power Efficiency through I/O Access Pattern Reshaping,” 2005.  Databricks (formerly with Intel Corp, Teradata Aster, Guavus, and Amazon Web Services). Grigorios Magklis, “Increasing Energy Efficiency in Adaptive Architectures,” 2005. Barcelona, Spain (formerly with Intel Corp., Arm, Esperanto Tech., and AMD). Robert Stets, “Leveraging Symmetric Multiprocessors and System Area Networks in Software Distributed Shared Memory,” 1999.  Glean, Inc. (formerly with HP [Compaq] Western Research Lab and Google). Galen C. Hunt, “Automatic Distributed Partitioning of Component-Based Applications,” 1998.  Microsoft Research. Maged Michael, “Reducing the Overhead of Sharing in Shared-Memory Multiprocessors,” 1997. Category Labs, Boston (formerly at IBM's T. J. Watson Research Center and at Meta Platforms). Robert Wisniewski (primary advisor Chris Brown), “Systems Support for Real-World AI Applications,” 1996. Hewlett Packard Enterprise (formerly with Silicon Graphics, IBM, Intel, and Samsung). Leonidas Kontothanassis, “Architectural and Operating System Support for Inexpensive, Efficient Shared Memory,” 1995. Boston University (formerly with DEC/Compaq/HP Labs, Akamai, Google, and Meta). Bill Bolosky, “Software Coherence in Multiprocessor Memory Systems,” 1993.  Retired from Microsoft Research. Ken Yap, “PENGUIN: A Language for Reactive Graphical User Interfaces,” 1990. Retired consultant, Sydney, Australia (formerly with CSIRO and CISRA). Peter Dibble, “A Parallel Interleaved File System,” 1989.  Retired from Google Pittsburgh (formerly with TimeSys Corp., Microware Systems Corporation, and the Iowa State University). (Picture courtesy of Erin Scott) Personal Links A “Last Lecture,” in the style of Randy Pausch, delivered in Dec. 2010. Personal reflections on the “Florian Jaeger affair,” gleaned from long-term participation in the College’s program of restorative practice. The Unitarian Universalist Association (UUA), representing over 1,000 liberal congregations in North America.  Affirming the inherent worth and dignity of every person. In July 2011 I was interviewed for public radio's Interfaith Voices on the occasion of the UUA's 50th anniversary. Click here for audio (13 min): Your browser does not support the <audio> tag. Or check out the slightly longer backstory. In June of 2004 the UUA General Assembly passed a Statement of Immediate Witness on Electronic Voting. I made a brief statement in support of this resolution on the floor of the assembly. Rochester's First Universalist Church: a community of reason, love, and faith, since 1846. My grandfather, the Rev. Dr. Clinton Lee Scott. My older daughter, Erin, Ministerial Intern of the Unitarian Universalist Church of Nashua, NH. The New York State Convention of Universalists: a state-level Unitarian Universalist charitable foundation, which I served as Secretary from 1991 to 1999, as President from 2001 to 2005, and as webmaster since 2004. The Union of Concerned Scientists: rigorous scientific analysis, innovative thinking, and citizen advocacy for a healthier environment and a safer world. The American Civil Liberties Union: defending the Bill of Rights. The American Association of University Professors and its U of R chapter: advancing academic freedom and shared institutional governance. The Religious Community for Reproductive Choice: pro-faith, pro-family, pro-choice. Amnesty International: working to protect human rights worldwide.  See also AI-USA. My pages at Wikipedia, Facebook, and LinkedIn. URCS Home Page Last Change: 26 September 2025 /",
  "content_length": 8595,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:32"
}