{
  "name": "Michael S. Waterman",
  "homepage": "https://dornsife.usc.edu/labs/msw",
  "status": "success",
  "content": "USC Dana and David Dornsife College of Letters, Arts and Sciences Skip to Content Pause Background Video Play Background Video Stand Out Research Spotlight Thinking Ahead At USC Dornsife, “What if?” becomes what’s next. Our researchers take the lead in fields that are just beginning to reveal tremendous promise. By investing in emerging areas of scholarship — from quantum computing to climate change communication to the frameworks for developing ethical A.I. — new possibilities become more than aspirations; they unfold in real-time, right here. Read More Sustainability LA’s Shade Gap Nearly half of Angelenos say their block has enough shade even though most live on tree-sparse streets. A new LABarometer report also reveals how race, politics and education shape support for greening the city. Read More JEP’s Enduring Multigenerational Legacy For more than 50 years the Joint Educational Project has been serving USC’s surrounding neighborhoods. The impact of JEP, based at USC Dornsife, spans generations — both for USC student volunteers and those in the community. Read More JEP’s Enduring Multigenerational Legacy JEP’s Enduring Multigenerational Legacy For more than 50 years the Joint Educational Project has been serving USC’s surrounding neighborhoods. The impact of JEP, based at USC Dornsife, spans generations — both for USC student volunteers and those in the community. Read More Social Impact Teaching Teens to Understand a Changing World For 25 years, the Center for Active Learning in International Studies at USC Dornsife has taught local high schoolers how to look beyond the headlines and examine the forces shaping global events. Read More Artificial Intelligence Harnessing AI for Good Humankind has arrived at an exciting moment: The intersection of the physical world with both human and artificial intelligence. But while AI increasingly affects our way of living, who determines how the future plays out? Technology is only part of this story. Deeper questions — questions that will define our relationship with AI — call for a wide range of expertise. At USC Dornsife, researchers refine AI while interrogating it. From drug discovery to systems optimization to AI ethics and safety, our challenge is to make sure that what comes next reflects the best of who we are. Learn More USC Dornsife News Curiosity at Work How young Angelenos come to understand and shape their city How climate finance to help poor countries became a global shell game Training the minds behind the AI algorithm A path to safer painkillers – revealed by freezing opioids and their protein receptors in motion Public Exchange expands from USC to Washington University in St. Louis Bad Bunny and Puerto Rican Muslims: How both remix what it means to be Boricua What can simulate nature, aid blockbuster drugs, and get Congress to agree? Two brain scans are better than one in predicting teen anxiety, study finds Two iconic coral species are now functionally extinct off Florida, study finds USC Dornsife spatial sciences professor wins Nobel Sustainability Trust Award New AI tool will automate cancer detection in blood samples Is it wrong to have too much money? Your answer may depend on deep-seated values – and your country’s economy Baseball returns to a Japanese American detention camp after a historic ball field was restored $3M NSF grant funds new USC Dornsife mathematics research and training program USC Dornsife psychologist co-leads $39M push to detect Alzheimer’s earlier $5M grant strengthens USC Equity Research Institute’s mission for climate and economic justice Stand Out, Together At USC Dornsife you’ll study the things you love the most. You’ll explore ideas that you’ve never thought about before. You’ll learn how to make sense of the world from all different angles. And, as part of our community, you will help to define a dynamic academic environment focused on improving lives and the world around us. Meet the Students USC Dornsife students demonstrate an impressive combination of academic excellence, accomplishment, creativity, and hard work. Each and every student is hand-selected because they bring something special and unique to our community. Discover what makes our USC Dornsife community strong A Brighter Future Isabella Pangilinan Environmental Studies major The Power of “And” Joshua Senior Biological Sciences major, East Asian Languages and Cultures minor A Trojan Family Like No Other Victoria Quon-Chow Human Biology major, Nutrition and Health Promotion minor A Brighter Future Isabella Pangilinan Environmental Studies major USC Dornsife student Isabella Pangilinan is passionate about finding solutions to some of our world’s most pressing challenges. The multidisciplinary courses offered through her major are preparing her for a career in environmental law. The Power of “And” Joshua Senior Biological Sciences major, East Asian Languages and Cultures minor USC Dornsife student Joshua Senior is studying to become a neurosurgeon. He explains how his liberal arts education at USC Dornsife prepares him for his career goals – and for life. A Trojan Family Like No Other Victoria Quon-Chow Human Biology major, Nutrition and Health Promotion minor As a student at USC Dornsife, Victoria Quon-Chow is bouyed by the support of the Trojan Family as she prepares to become a doctor. Public Exchange Unprecedented Access to Academic Expertise Public Exchange fast-tracks collaboration between academic researchers and the public and private sectors to define, analyze, and solve complex problems that organizations face. Through our first-of-kind model, we amplify social impact by making academic expertise more easily accessible than ever before. Partner with Public Exchange Stand Out With Purpose Life in L.A. Undergraduate Research Experiential Learning News and Events @USCDornsife “In this place of sadness, injustice, and pain, we will do something joyous, righteous, and healing. We will play baseball.” At a former Japanese American incarceration camp in California, descendants returned to play on a restored ball field — reclaiming memory through the game. Read More on X @USC No one knows what the world will look like 15 years from now. New dean of @USCDornsife, James Bullock, says that’s exactly why liberal arts matter — they give students skills that never expire. Read More on X USC Dornsife honors 104-year-old alumnus, veteran and former Secretary of the Navy Paul Ignatius, a 1942 USC Dornsife graduate and World War II veteran, leaves a legacy that spans public service, journalism and philanthropy. Dec 1 Film Screening of “The Cats of Gokogu Shrine: Gokogu no Neko” and Q&A with Director Kazuhiro Soda 5:00 pm Ronald Tutor Campus Center, TTC 227 Join the USC Dornsife Shinso Ito Center for Japanese Religions and Culture for a special screening of The Cats of Gokogu Shrine, a documentary that explores the unique world of Gokogu, a small, ancient Shinto shrine in Ushimado, Japan, also known as the Cat Shrine. USC Dornsife Dornsife professors are very committed to the job 🔭🚀 Prof. Nick Warner’s popular GE course is often the last science class many USC students take, and he wants it to be memorable. Watch as he demonstrates Newton’s Third Law. View on Instagram",
  "content_length": 7253,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:53"
}