{
  "name": "Michael Beyeler",
  "homepage": "https://cs.ucsb.edu/people/faculty/michael-beyeler",
  "status": "success",
  "content": "Michael Beyeler | UCSB Computer Science Michael Beyeler Associate Professor He/Him/His mbeyeler@ucsb.edu BioEngineering 3201B Lab Website Education Ph.D in Computer Science, 2016, University of California, Irvine MSc in Biomedical Engineering, 2011, ETH Zurich, Switzerland BSc in Electrical Engineering, 2009, ETH Zurich, Switzerland Campus Affiliations Associate Professor, Psychological & Brain Sciences (PBS) Associate Director, Research Center for Virtual Environments and Behavior (ReCVEB) Dynamical Neuroscience (DYNS) Institute for Collaborative Biotechnologies (ICB) Neuroscience Research Institute (NRI) External Publications UCSB Publications Awards 2024 Harold J. Plous Memorial Award (UC Santa Barbara) 2022 DP2 New Innovator Award (National Institutes of Health) 2018 K99/R00 Pathway to Independence Award (National Institutes of Health) Research Areas Computational Science and Engineering Human Centered and Social Computing Machine Learning and Data Mining Visual Computing and Interaction Bio Dr. Michael Beyeler is Associate Professor of Computer Science and Psychological & Brain Sciences at UC Santa Barbara, where he directs the Bionic Vision Lab. His research combines computational neuroscience, AI, and immersive technology to advance sight restoration for people with incurable blindness. Prior to joining UCSB in 2019, he completed a postdoctoral fellowship at the University of Washington and earned his PhD in Computer Science from UC Irvine. He also holds degrees in Electrical and Biomedical Engineering from ETH Zurich. Dr. Beyeler serves as Associate Director of UC Santa Barbara’s Center for Virtual Environments and Behavior (ReCVEB). His work has been recognized by the National Institutes of Health (K99/R00 and DP2 New Innovator Award) and by UC Santa Barbara with the 2024-2025 Harold J. Plous Memorial Award for exceptional contributions to research, teaching, and service. Research The Bionic Vision Lab builds intelligent vision systems to advance the future of extended reality (XR) and neurotechnology. We use machine learning and computer vision to model how biological and artificial vision systems perceive and act in complex environments, applying these insights to design next-generation visual prostheses for people living with incurable blindness. Our work includes developing biophysically informed models that predict neural responses to visual input, creating algorithms that optimize stimulation strategies for retinal and cortical implants, and building real-time VR/AR testbeds for evaluating new visual accessibility tools. This involves integrating multimodal data from head, eye, and body tracking, and exploring how AI-driven scene understanding can support navigation and interaction in dynamic environments. CS students in our lab lead the computational side of this work, from designing novel learning algorithms and simulation frameworks to deploying models in real-time XR environments. They collaborate closely with students from Psychological & Brain Sciences (PBS) and Dynamical Neuroscience (DYNS), gaining experience in interdisciplinary research while building technologies at the interface of vision, AI, and human-computer interaction.",
  "content_length": 3209,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:42"
}