{
  "name": "Michael D. Bailey",
  "homepage": "https://faculty.cc.gatech.edu/~mbailey",
  "status": "success",
  "content": "Michael Bailey Michael Donald Bailey Professor School of Cybersecurity and Privacy (SCP) College of Computing Georgia Institute of Technology About Me I am a profesor in the School of Cybersecurity and Privacy (SCP) at the Georgia Institute of Technology. Until recently I was part of a large cohort of faculty, staff, and students at UIUC that do great work in security called the Security and Privacy Research Group at Illinois (SPR@I). If you are interested in what I have done professionally, you are welcome to read my CV. Teaching Spending Fall '25 in Metz, France at Georgia Tech-Europe. There I am teaching: Fall 2025, Special Topics - CS-8803-R Fall 2025, Computer Networks - CS-6250-R (with the truely amazing Cecilia Testart who is teaching in the Atlanta campus) Last semester I was honored to be teach with the really awesome Ryan Shandler: Spring 2025, CS 3237 Human Dimension of Cybersecurity In the past I have taught a variety of systems classes including Operating Systems, Networking, Distributed Systems, and Security. The most recent classes included: Spring 2022, ECE 422 Computer Security I, Course Website Fall 2021, ECE 391 Computer Systems Engineering, Course Website Collaborators Before coming to GaTech, I was blessed to have had an incredible cohort of UIUC Ph.D. students who have graduated and moved on to do some amazing things: Dr. Paul Murley, Argonne National Laboratory, Capital One Prof.Joshua Reynolds, New Mexico State University, Walmart Prof. Deepak Kumar, Univesity of California, San Diego Prof. Zane Ma, Oregon State University Seoung Kyun Kim, National Renewable Energy Laboratory (NREL) I was super grateful to have had the chance to work with Dr. Joshua Mason while at UIUC. At Michigan, I had an opportunity to co-advise (as research faculty), several amazing students: Dr. Jakub Czyz, Quadmetrics, FICO, Blumira, CrowdStrike Dr. Jing Zhang, Composite Capital Management Dr. Yunjing Xu, Square, Smyte, Cruise, DiDi Research My interets lie in exploring the security, performance, and availability properties of computing systems. My work seeks to both inform the development of these systems to address immediate, important societal problems as well as to fundementially enhance our understanding of the sciences underlying computing subfields including computer systems organization, networks, and security and privacy. Papers (my Google Scholar Citations) Vinny Adjibi, Athanasios Avgetidis, Manos Antonakakis, Alberto Dainotti, Michael Bailey, Fabian Monrose. Repairing Trust in Domain Name Disputes Practices: Insights from a Quarter-Century’s Worth of Squabbles. The Network and Distributed System Security Symposium 2026 (NDSS '26). San Diego, California, February 23-27, 2026. Boladji Vinny Adjibi, Athanasios Avgetidis, Manos Antonakakis, Michael Bailey, Fabian Monrose. The Guardians of Name Street: Studying the Defensive Registration Practices of the Fortune 500. The Network and Distributed System Security Symposium 2025 (NDSS '25). San Diego, California, February 24-28, 2025 Zane Ma, Aaron Faulkenberry, Thomas Papastergiou, Zakir Durumeric, Michael D. Bailey, Angelos D. Keromytis, Fabian Monrose, Manos Antonakakis. Stale TLS Certificates: Investigating Precarious Third-Party Access to Valid TLS Keys. 2023 Internet Measurement Conference (IMC 2023), Montréal, Canada, October 24-26, 2023. Joshua Reynolds, Adam Bates and Michael Bailey. Equivocal URLs: Understanding the Fragmented Space of URL Parser Implementations. 27th European Symposium on Research in Computer Security (ESORICS 2022), Copenhagen, Denmark, September 26-30, 2022. Zane Ma, James Austgen, Joshua Mason, Zakir Durumeric, and Michael Bailey. Tracing Your Roots: Exploring the TLS Trust Anchor Ecosystem. In ACM Internet Measurement Conference 2021 (IMC 2021), (Virtual event), November 2-4, 2021. Rishabh Chhabra, Paul Murley, Deepak Kumar, Michael Bailey, and Gang Wang. Measuring DNS-over-HTTPS Performance Around the World. In ACM Internet Measurement Conference 2021 (IMC 2021), (Virtual event), November 2-4, 2021. Deepak Kumar, Patrick Kelley, Sunny Consolvo, Joshua Mason, Elie Bursztein, Zakir Durumeric, Kurt Thomas, and Michael Bailey. Designing Toxic Content Classification for a Diversity of Perspectives. In Seventeenth Symposium on Usable Privacy and Security (SOUPS '21), (virtual event), August 8-10, 2021. Paul Murley, Zane Ma, Joshua Mason, Michael Bailey and Amin Kharraz. WebSocket Adoption and the Landscape of the Real-Time Web. In The Web Conference 2021 (WWW '21), Ljubljana, Slovenia, April 19 - 23, 2021. [pdf] [bib] Zane Ma, Manos Antonakakis, Joshua Mason, Zakir Durumeric, and Michael Bailey. What's in a Name? Exploring CA Certificate Control. In 30th USENIX Security Symposium (USENIX Security '21), (virtual event), August 11 - 13, 2021. [pdf] [bib] Kurt Thomas, Devdatta Akhawe, Michael Bailey, Elie Bursztein, Dan Boneh, Sunny Consolvo, Nicki Dell, Zakir Durumeric, Patrick Gage Kelley, Deepak Kumar, Damon McCoy, Sarah Meiklejohn, Thomas Ristenpart, and Gianluca Stringhini. SoK: Hate, Harassment, and the Changing Landscape of Online Abuse. In IEEE Security & Privacy (Oakland) 2021 (S&P '21), San Francisco, California, May 23 - 27, 2021. [pdf] [bib] Joshua Reynolds, Nikita Samarin, Joseph Barnes, Taylor Judd, Joshua Mason, Michael Bailey, and Serge Egelman. Empirical Measurement of Systemic 2FA Usability. In the 29th USENIX Security Symposium (USENIX Security '20), Boston, MA, USA, August 12 - 14, 2020. [pdf] [bib] Joshua Reynolds, Deepak Kumar, Zane Ma, Rohan Subramaniam, Meishan Wu, Martin Shelton, Joshua Mason, Emily Stark, and Michael Bailey. Measuring Identity Confusion with Uniform Resource Locators. 2020 ACM Conference on Human Factors in Computing Systems (CHI '20), Honolulu, Hawai'i, April 25 - 30, 2020. [pdf] [bib] Deepak Kumar, Riccardo Paccagnella, Paul Murley, Eric Hennenfent, Joshua Mason, Adam Bates, and Michael Bailey. Emerging Threats in IoT Voice Services. IEEE Security and Privacy 17(4):18-24, 2019. [pdf] [bib] Zane Ma, Joshua Reynolds, Joseph Dickinson, Kaishen Wang, Taylor Judd, Joseph D. Barnes, Joshua Mason, and Michael Bailey. The Impact of Secure Transport Protocols on Phishing Efficacy. USENIX Workshop on Cyber Security Experimentation and Test (CSET) 2019, Santa Clara, CA, August 12, 2019. [pdf] [bib] Amin Kharraz, Zane Ma, Paul Murley, Charles Lever, Joshua Mason, Andrew Miller, Nikita Borisov, Manos Antonakakis and Michael Bailey. OUTGUARD: Detecting In-Browser Covert Cryptocurrency Mining in the Wild. In the Web Conference 2019 (formally WWW), San Francisco, CA, May 13 - 17, 2019. (Best Paper) [pdf] [bib] Seoung Kim, Zane Ma, Siddharth Murali, Joshua Mason, Andrew Miller, and Michael Bailey. Measuring Ethereum Network Peers. In the 2018 ACM Internet Measurement Conference (IMC '18), Boston, MA, October 31 - November 2, 2018. [pdf] [bib] Yi Zhou, Deepak Kumar, Surya Bakshi, Joshua Mason, Andrew Miller, and Michael Bailey. Erays: Reverse Engineering Ethereum's Opaque Smart Contracts. In 27th USENIX Security Symposium (USENIX Security '18), Baltimore, MD, August 15-17, 2018. [pdf] [bib] Deepak Kumar, Riccardo Paccagnella, Paul Murley, Eric Hennenfent, Joshua Mason, Adam Bates, and Michael Bailey. Skill Squatting Attacks on Amazon Alexa. In 27th USENIX Security Symposium (USENIX Security '18), Baltimore, MD, August 15-17, 2018. [pdf] [bib] Dave (Jing) Tian, Nolen Scaife, Deepak Kumar, Michael Bailey, Adam Bates, and Kevin R. B. Butler. \"Plug & Pray\" Today Understanding USB Insecurity in Versions 1 through C. In IEEE Security & Privacy (Oakland) 2018 (S&P '18), San Francisco, California, May 21-23, 2018. [pdf] [bib] Deepak Kumar, Zhengping Wang, Matthew Hyder, Joseph Dickinson, Joshua Mason, Michael Bailey, Gabrielle Beck, David Adrian, Zakir Durumeric, and J. Alex Halderman. Tracking Certificate Misissuance in the Wild. In IEEE Security & Privacy (Oakland) 2018 (S&P '18), San Francisco, California, May 21-23, 2018. [pdf] [bib] Manos Antonakakis, Tim April, Michael Bailey, Matt Bernhard, Elie Bursztein, Jaime Cochran, Zakir Durumeric, J. Alex Halderman, Luca Invernizzi, Michalis Kallitsis, Deepak Kumar, Chaz Lever, Zane Ma, Joshua Mason, Damian Menscher, Chad Seaman, Nick Sullivan, Kurt Thomas, Yi Zhou. Understanding the Mirai Botnet. In 26th USENIX Security Symposium (USENIX Security '17), Vancouver, Canada, August 16-18, 2017. [pdf] [bib] Deepak Kumar, Zane Ma, Zakir Durumeric, Ariana Mirian, Joshua Mason, Michael Bailey and J. Alex Halderman. Security Challenges in an Increasingly Tangled Web. In 26th International World Wide Web Conference (WWW '17), Perth, Australia, April 3-7, 2017. [pdf] [bib] Zakir Durumeric, Zane Ma, Drew Springall, Richard Barnes, Nick Sullivan, Elie Bursztein, Michael Bailey, J. Alex Halderman, and Vern Paxson. The Security Impact of HTTPS Interception. In the Network and Distributed System Security Symposium 2017 (NDSS '17), San Diego, California, February 2017. [pdf] [bib] Ariana Mirian, Zane Ma, David Adrian, Matthew Tischer, Thasphon Chuenchujit, Tim Yardley, Robin Berthier, Josh Mason, Zakir Durumeric, J. Alex Halderman and Michael Bailey. An Internet-Wide View of ICS Devices. In 2016 Privacy, Security and Trust Conference, Auckland, New Zealand, December 2016. [pdf] [bib] Benjamin VanderSloot, Johanna Amann, Matthew Bernhard, Zakir Durumeric, Michael Bailey, and J. Alex Halderman. Towards a Complete View of the Certificate Ecosystem. In ACM Internet Measurement Conference 2016 (IMC '16), Santa Monica, California, November 14-16, 2016. [pdf] [bib] Zhuotao Liu, Hao Jin, Yih-Chun Hu, and Michael Bailey. MiddlePolice: Toward Enforcing Destination-Defined Policies in the Middle of the Internet. In Proceedings of 23rd ACM Conference on Computer and Communications Security (CCS '16), Hofburg Palace, Vienna, Austria, October 24-28, 2016. [pdf] [bib] Kurt Thomas, Rony Amira, Adi Ben-Yoash, Ari Berger, Ori Folger, Amir Hardon, Elie Bursztein, and Michael Bailey. The Abuse Sharing Eco",
  "content_length": 25993,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:50"
}