{
  "name": "Michael A. Langston",
  "homepage": "http://web.eecs.utk.edu/~langston",
  "status": "success",
  "content": "Michael A. Langston, University of Tennessee Dr. Michael A. Langston Professor Department of Electrical Engineering and Computer Science Tickle College of Engineering University of Tennessee Suite 401, Min H. Kao Building 1520 Middle Drive Knoxville, TN 37996-2250 USA Phone: (865) 974-3534; Fax: (865) 974-4404 Email: langston \"at\" tennessee \"dot\" edu Core Faculty UT Graduate School in Genome Science and Technology Data Science Faculty UT Bredesen Center for Interdisciplinary Research and Graduate Education Collaborating Scientist Oak Ridge National Laboratory Langston Lab News An Open Note to Prospective Students Blurb on UTHSC Collaborations Cheng Chen Graduates Grady and Niu Accept Postdoc Appointments Lab Wins Award for Multidisciplinary Research Langston Named Senior Associate Editor at ACM Computing Surveys New R Package Released Paper Published on Network Controllability Paper Published on Transcriptomic Thresholding Recent Team Photo Science Fiction Meets Science Fact - Fungal Infections and Renal Disease Information for Scientific Reviewers An Enumeration of my Contributions to Science, Including Research Papers in Fields not Covered by Pubmed Research and Software Current Research Concentrations Big Data Analytics, Combinatorial Optimization, Computer and Data Science, Graph Theoretical Algorithms, High Performance Implementations, Life Science Applications, Machine Learning, Statistical Software Unclassified Research Projects Analytics for Atmospheric Radiation Measurement Augmenting Social Determinants of Health Climate Change and Human Health Chronic Kidney Disease End-Stage Renal Disease Mycobacterium Tuberculosis Dissemination Pregnancy-Associated Mortality Recently Completed Projects Air Pollution and Cardiovascular Disease Advanced Machine Design Bioinformatics Centre Biomarker Elucidation Cerebellar Development Efficient Pre-Processing High Throughput Data Analysis HPC and FPT Interpreting Health Disparities Low-Dose Radiation Genetics Mouse Phenotype Analysis Multi-Layer Network Modules Multilevel Omics Data Analysis Neurogenetics of Addiction North Sea Historical Analysis Ontological Discovery Optimization and Metaheuristics Reconfigurable Computing Scalable Computing for Biology Software Correctness Systems Biology for R. Palustris Unraveling Complex Diseases Recent Software Releases Biclique Enumeration ClustalXP EntropyExplorer Gene Weaver GrAPPA Teaching and Service Mentoring Current Students Recent Graduates Current Course CS 580, Foundations of Computer Science Recent Courses CS 312, Algorithm Analysis and Automata CS 380, Theory of Computation CS 581, Algorithms CS 594, Algorithmic Methods for Bioinformatics CS 594, Computation for Systems Biology CS 594, Experimental Algorithmics CS 594, Extremal Graph Theory CS 594, Fixed-Parameter Tractability CS 594/690, Graph Algorithms, Applications, and Implementations CS 594/690, Graph Theory CS 680, Special Topics in Graph Algorithms LFSC 695, Journal Club in Computational Biology Recent Service Bertinoro Systems Biology Workshops Math & Science Center Ronald McNair Achievement Program Additional Information Biographical Data Faculty Focus Article Not So Recent Travel Photos Selected Recent Publications UT COE Annual Report 2013 Prized Quotes \"The hardest thing of all is to find a black cat in a dark room. Especially if there is no cat.\" --- Confucius, 551BC - 479BC \"Too much sanity may be madness. And maddest of all: to see life as it is, and not as it should be.\" --- Don Quixote, from The Ingenious Gentleman Don Quixote of La Mancha, by Miguel de Cervantes Saavedra, 1547 - 1616 \"There are more things in heaven and earth, Horatio, than are dreamt of in your philosophy.\" --- Hamlet, from The Tragedy of Hamlet Prince of Denmark, by William Shakespeare, 1564 - 1616 \"All things are ready, if our mind be so.\" --- King Henry V, from Henry V, by William Shakespeare, 1564 - 1616 \"Our doubts are traitors, and make us lose the good we oft might win, by fearing to attempt.\" --- Lucio, from Measure for Measure, by William Shakespeare, 1564 - 1616 \"Rejecting theory as useless in order to work only on everyday things is like proposing to cut the roots of a tree because they do not carry fruit.\" --- Marquis de Condorcet, 1743 - 1794 \"If you pick up a starving dog and make him prosperous, he will not bite you. That is the principal difference between a dog and a man.\" --- Mark Twain, 1835 - 1910 \"Diplomacy is the art of telling people to go to hell in such a way that they ask for directions.\" --- Winston Churchill, 1874 - 1965 \"If at first the idea is not absurd, then there is no hope for it.\" --- Albert Einstein, 1879 - 1955 \"If everything isn't black and white, I say 'Why the hell not?'\" --- John Wayne, 1907 - 1979 \"Baseball is 90 percent mental. The other half is physical.\" --- Yogi Berra, 1925 - 2015 \"A man is never too old to learn, is it, Mr. Jonas?\" --- Rhys Williams as Dai Bando in How Green Was My Valley, 1941 \"How can a guy get so low?\" \"He reached too high.\" --- Roy Roberts as Carnival Owner in Nightmare Alley, 1947 \"Why do you make me do it? Why do you make me do it? You know you're gonna talk. I'm gonna make you talk. I always make you punks talk. Why do you do it? Why? Why?\" --- Robert Ryan as Jim Wilson in On Dangerous Ground, 1952 \"A little humor, my dear Zilkov, always with a little humor.\" --- Khigh Dhiegh as Yen Lo in The Manchurian Candidate, 1962 \"Mathematics. That was a mistake. I should have made the whole thing a little easier.\" --- George Burns as God in Oh, God! Book II, 1980 Michael A. Langston Last updated on 20 January 2025",
  "content_length": 5610,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:37"
}