{
  "name": "Michael Dondrup",
  "homepage": "https://www.uib.no/en/persons/Michael.Dondrup",
  "status": "success",
  "content": "Michael Dondrup | UiB Skip to main content Edit Photo: Randi Herggernes Eilertsen Michael Dondrup Position Researcher, Researcher Affiliation Computational Biology Unit Department of Informatics E-mail michael.dondrup@uib.no Phone number 55584354 Postal address P.O. Box 7803 NO-5020 Bergen Norway Michael Dondrup Position Researcher, Researcher Affiliation Computational Biology Unit Department of Informatics Teaching BINF301 - Genome scale algorithms V'21 (Course responsible) Publications 2024 Slinning, Malene Skuseth; Nthiga, Thaddaeus Mutugi; Eichner, Christiane et al. (2024). Major vault protein is partof an extracellular cement materialin the Atlantic salmon louse(Lepeophtheirus salmonis). (external link) Midtbø, Helena Marie Doherty; Eichner, Christiane; Hamre, Lars Are et al. (2024). Salmon louse labial gland enzymes: implications for host settlement and immune modulation. (external link) 2022 Dondrup, Michael; Eichner, Christiane; Dalvin, Sussie et al. (2022). LiceBase- An organism-Specific Database for Functional Genomics of Salmon Louse. (external link) Øvergård, Aina-Cathrine; Midtbø, Helena Marie Doherty; Hamre, Lars Are et al. (2022). Small, charged proteins in salmon louse (Lepeophtheirus salmonis) secretions modulate Atlantic salmon (Salmo salar) immune responses and coagulation. (external link) 2021 Zhou, Zhaoran; Eichner, Christiane; Nilsen, Frank et al. (2021). A novel approach to co-expression network analysis identifies modules and genes relevant for moulting and development in the Atlantic salmon louse (Lepeophtheirus salmonis). (external link) Skern-Mauritzen, Rasmus; Malde, Ketil; Eichner, Christiane et al. (2021). The salmon louse genome: Copepod features and parasitic adaptations. (external link) Dalvin, Sussie; Eichner, Christiane; Dondrup, Michael et al. (2021). Roles of three putative salmon louse (Lepeophtheirus salmonis) prostaglandin E2synthases in physiology and host–parasite interactions. (external link) 2020 Braden, Laura; Michaud, Dylan; Igboeli, Okechukwu O. et al. (2020). Identification of critical enzymes in the salmon louse chitin synthesis pathway as revealed by RNA interference-mediated abrogation of infectivity. (external link) 2019 Øvergård, Aina-Cathrine; Hamre, Lars Are; Grotmol, Sindre et al. (2019). Lusespytt modulerer laksens immunrespons. (external link) Øvergård, Aina-Cathrine; Nilsen, Frank; Nuñez-Ortiz, Noelia et al. (2019). THE SALMON LOUSE (LEPEOPHTHEIRUS SALMONIS) SALIVARY GLAND SECRETES IMMUNE REGULATORY PROTEINS. (external link) Heggland, Erna Irene; Eichner, Christiane; Støve, Svein Isungset et al. (2019). A scavenger receptor B (CD36)-like protein is a potential mediator of intestinal heme absorption in the hematophagous ectoparasite Lepeophtheirus salmonis. (external link) Hardardottir, Hulda; Male, Rune; Nilsen, Frank et al. (2019). Chitin synthesis and degradation in Lepeophtheirus salmonis: Molecular characterization and gene expression profile during synthesis of a new exoskeleton. (external link) 2018 Agusti-Ridaura, Celia; Dondrup, Michael; Horsberg, Tor Einar et al. (2018). Caligus rogercresseyi acetylcholinesterase types and variants: a potential marker for organophosphate resistance. (external link) Dondrup, Michael; Zhang, Wei; Nilsen, Frank et al. (2018). LiceBase – genom-data som kan bidra til kontroll av lakselus. (external link) 2017 Heggland, Erna Irene; Eichner, Christiane; Dondrup, Michael et al. (2017). Heme absorption in the salmon louse. (external link) Heggland, Erna Irene; Nilsen, Frank; Eichner, Christiane et al. (2017). Functional study of a putative heme receptor in the salmon louse (Lepeophtheirus salmonis) intestine. (external link) Eichner, Christiane; Dondrup, Michael; Nilsen, Frank (2017). RNA-sequencing reveals distinct gene expression patterns during the development of parasitic larval stages of the salmon louse (Lepeophtheirus salmonis). (external link) Eichner, Christiane; Grammes, Fabian; Dondrup, Michael et al. (2017). The salmon louse (Lepeophtheirus salmonis) transcriptome is affected by the host resistance. (external link) Øvergård, Aina-Cathrine; Hamre, Lars Are; Harasimczuk, Ewa et al. (2017). Exocrine glands of Lepeophtheirus salmonis and secretion of possible immune regulatory proteins.. (external link) 2016 Eichner, Christiane; Dondrup, Michael; Kongshaug, Heidi et al. (2016). RNA-sequencing reveals distinct gene expression patterns during the development of parasitic larval stages of the salmon louse (Lepeophtheirus salmonis). (external link) Eichner, Christiane; Dondrup, Michael; Nilsen, Frank (2016). RNA-sequencing reveals distinct gene expression patterns during the development of parasitic larval stages of the salmon louse (Lepeophtheirus salmonis). (external link) Dondrup, Michael; Zhang, Wei; Zhou, Zhaoran et al. (2016). Licebase-a species focused resource for sea lice including an RNAi LIMS andtools for data analysis and genome annotation. (external link) 2015 Trösse, Christiane; Kongshaug, Heidi; Dondrup, Michael et al. (2015). Characterisation of iron regulatory protein 1A and 1B in the blood-feeding copepod Lepeophtheirus salmonis. (external link) 2012 Christoforou, Andrea; Dondrup, Michael; Mattingsdal, Morten et al. (2012). Linkage-disequilibrium-based binning affects the interpretation of GWASs. (external link) Ray, Jessica Louise; Dondrup, Michael; Modha, Sejal et al. (2012). Finding a needle in the virus metagenome haystack - micro-metagenome analysis captures a snapshot of the diversity of a bacteriophage armoire. (external link) See a complete overview of publications in Cristin. Projects LiceBase - A functional genomics resouce for sea lice and related organismsLiceVault - Unraveling the function of vaults in the Atlantic salmon louse Lepeophtheirus salmonis",
  "content_length": 5785,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:54"
}