{
  "name": "Michael N. Gubanov",
  "homepage": "http://www.mgubanov.com",
  "status": "success",
  "content": "Michael Gubanov Michael Gubanov Assistant Professor News: Three more papers accepted by ACM CIKM 2024, EDBT 2025, and ICDE 2025! Awarded a grant from FL Department of Health Casey DeSantis Florida Cancer Innovation Fund as a PI for constructing a hybrid Polystore/LLM simplifying access to Cancer Data Lakes! Awarded an NSF grant as a PI for constructing Web-scale Knowledge Graphs and LLMs for Data Science! Received the AWS AI Amazon Research Award (ARA)! Thanks to Amazon for supporting BigLab! research! One more paper by BigLab! accepted to The Web Conference (WWW) 2023, held in Austin, TX this year! Two more papers accepted, total 3 papers presented at EDBT by BigLab! this year!! Our COVIDKG.ORG paper was accepted by EDBT 2023! Our COVID-19 Web-scale vizualization paper was accepted to ACM CIKM 2022! Our tabular profiling paper was accepted to ACM SIGMOD 2022! Launched COVIDKG.ORG and AGINGGRAPH.ORG Our New Data Science courses approved by FSU and State of Florida! Elected to Sigma Xi, 2021 Communications of the ACM 2020 Research Highlight Award! Communications of the ACM (CACM) 2020 published our \"Scalable Linear Algebra\" paper! PG 2020 Award! Thank you to FSU! Congratulations to the award-winning teams from my FSU Data Science course this year! Team1, Team2, Team3 FYAP 2019 Award! Thank you to FSU! ACM SIGMOD Research Highlight Award, 2018! ICDE 2017 award paper invited to a special issue of ACM SIGMOD Record ICDE 2017 award paper invited to publication in \"Best of ICDE\" issue of TKDE 2018 ICDE 2017 Best Paper Award! Watch my talk at MIT on our Hybrid Linear Relational Engine Florida State University Computer Science Department 1017 Academic Way Tallahassee, FL 32304 gubanov at cs.fsu.edu Publications in DBLP(external publication tracking system) Home Publications Teaching/Service Funding Invited Talks/Presentations Awards/Honors Photos Openings BigLab! About I am an Assistant Professor at Florida State University and a founder of BigLab!, where we do research in AI, LLMs and Large-scale Data Management with applications in Healthcare. We actively collaborate with Moffitt Cancer Center and Research Institute in Tampa, FL as a lead in the consortsium FL DOH grant. Our recent projects are CancerKG.ORG, CovidKG.ORG, and AgingGraph.ORG I earned my Ph.D. and M.Sc. in Computer Science from the University of Washington. I did my Postdoc at Computer Science and Artificial Intelligence Laboratory (CSAIL) of M.I.T.. I completed my undergraduate education at St. Petersburg ITMO University (ACM-ICPC World Champions 7 times). Before that I graduated from the Presidential Physics/Mathematics Lyceum #239. I was also a member of the Russian National Team in Physics. I spent some time working in industry to apply my research - At IBM Almaden Research Center on Data Integration (project Clio, productized as a part of IBM Infosphere); at Google on Web-search and Large-scale Machine Learning (productized as parts of SETI and Froogle); at Microsoft Research on Natural Language Processing (productized as a part of Bing!). Selected Funding Florida Department of Health (DOH) (PI, $1,200,000) Casey DeSantis Florida Cancer Innovation Fund; Constructing a hybrid Polystore/LLM simplifying access to Cancer Data Lakes, 2024-current National Science Foundation (NSF) (PI, $550,000) Search for the Unknown - A Hybrid Scalable Data Management System Providing Deep Access to the Scientific Knowledge in Data Science, 2024-current AWS AI Amazon Research Award (PI, $70,000), 2022-2024 National Science Foundation (NSF) I-CORPS (PI, $50,000), COVIDKG.ORG, 2022-2023 Selected Awards/Honors IEEE ICDE Outstanding Program Committee Member Award, 2025 AWS AI Amazon Research Award, 2023 Communications of the ACM (CACM) Research Highlight Award, 2020. ACM SIGMOD Research Highlight Award, Houston, TX, 2018. IEEE ICDE Best Paper Award, San Diego, CA, 2017. Selected Publications \"Scalable Tabular Hierarchical Metadata Classification in Heterogeneous Structured Large-scale Datasets using Contrastive Learning\" Bhim Kandibedala, Gyanendra Shrestha, Anna Pyayt, Todor Ivanov, Michael Gubanov, in ICDE, 2025[pdf] \"Tabular Embeddings for Tables with Bi-Dimensional Hierarchical Metadata and Nesting\" Gyanendra Shrestha, Chutian Jiang, Sai Akula, Vivek Yannam, Anna Pyayt, Michael Gubanov, in EDBT, 2025 [pdf] \"CancerKG.ORG - a Web-scale, Interactive, Verifiable Knowledge Graph-LLM Hybrid for Assisting with Optimal Cancer Treatment and Care\" Michael Gubanov, Anna Pyayt, Aleksandra Karolack, in ACM CIKM, 2024 [pdf] \"Learning Topical Structured Interfaces from Medical Research Literature\" Maitry Chauhan, Anna Pyayt, Michael Gubanov, in The Web Conference (WWW), 2023[pdf] \"Leveraging Scalable Profiling to Learn and Visualize the Latest Trustworthy COVID-19 Medical Research Findings\" Michael Gubanov, Sophie Pavia, Anna Pyayt, William Goble, in ACM CIKM, 2022[pdf] \"Simplifying Access to Large-scale Structured Datasets by Meta-Profiling with Scalable Training Set Enrichment\" Sophie Pavia, Rituparna Khan, Anna Pyayt, Michael Gubanov, in ACM SIGMOD, 2022[pdf] Scalable Linear Algebra on a Relational Database System Shangyu Luo, Zekai Gao, Michael Gubanov, Christopher Jermaine, Luis Perez, in the Communications of the ACM (CACM), 08/2020, Research Highlight[html] Hybrid.Poly: A Consolidated Interactive Analytical Polystore System Maksim Podkorytov, Michael Gubanov, in ICDE 2019, Macao, China SAR [pdf] DataXFormer: Leveraging the Web for Semantic Transformations [bib] [pdf] Zia Abedjan, John Morcos, Michael Gubanov, Ihab Ilyas, Michael Stonebraker, Paolo Papotti, Mourad Ouzanni, in CIDR 2015, Asilomar, California Large-scale Semantic Profile Extraction [bib] [pdf] Michael Gubanov, Michael Stonebraker EDBT 2014, Athens, Greece Text and Structured Data Fusion in DataTamer at Scale [bib] [pdf] Michael Gubanov, Michael Stonebraker, Daniel Bruckner, IEEE ICDE 2014, Chicago, Illinois ReadFast: High-relevance Search-engine for Big Text  [bib] [pdf] Michael Gubanov, Anna Pyayt. ACM CIKM 2013, San Francisco, California \"Much have I learned from my teachers, more from my colleagues, but from my students, most of all.\"--Rabbi Hanina (b. Ta'anit 7a) Postdocs Dr. Todor Ivanov Graduate students(advice by Jason Eisner,Kevin Gimpel,David Peterson) Gyanendra Shrestha Chutian Jiang Sai Ganesh Mamatha Edivelli Nilkod Yashaswini Kartik Vemireddy Ishitha Yarlagada Kalyan Kadari Shardha Hirve Ruchita Munugala BigLab! Alumni Manju Krishnan, US Bank, TX, Full Stack Software Engineer; Amazon Alexa, WA, Software Engineer Anusha Kola, HCL America, TX, Software Engineer Sai Amirishetty, Walmart, AR, Software Engineer Yuqi Li Maxim Podkorytov, Facebook, CA, Research Scientist Bhim Kandibedala, Builder Homesite, TX, Software Engineer Sophie Pavia William Goble, Dickinson College, PA, Visiting Assistant Professor Maitry Chauhan, Bank of America, NJ, Software Engineer Links Courses and Dorms Reviews by Students Download the source code related to all our ML/DL models released into the public domain here Download the datasets related to all our ML/DL models released into the public domain here",
  "content_length": 7123,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:40"
}