{
  "name": "Michael Herczeg",
  "homepage": "https://www.imis.uni-luebeck.de/de/institut/team/michael-herczeg",
  "status": "success",
  "content": "Univ.-Prof. i.R. Dr. rer. nat. Michael Herczeg Dipl.- Inform. | IMIS - Universität zu Lübeck Direkt zum Inhalt Institut Professuren Team IMIS Kontakt Anfahrt Forschung Forschungsschwerpunkte Forschungsthemen Forschungsprojekte Publikationen Lehre Lehrbereiche Bachelorarbeiten Masterarbeiten Sonstige Arbeiten Transfer Transferbereiche Wissenstransfer Transferprojekte Weiterbildung Aktuelles News Stellenangebote Search Univ.-Prof. i.R. Dr. rer. nat. Michael Herczeg Dipl.- Inform. Professor für Mensch-Computer-Systeme Institut für Multimediale und Interaktive Systeme Universität zu Lübeck Ratzeburger Allee 160 D-23562 Lübeck Tel: +49 451 3101 5101 (Sekr.) Fax: +49 451 3101 5104 E-Mail: Michael.Herczeg [at] uni-luebeck.de ResearchGate Google Scholar Allgemeines Zur Person Univ.-Prof. i.R. Dr. rer. nat. Michael Herczeg ist Professor für Mensch-Computer-Systeme an der Universität zu Lübeck und leitete vom 1.2.1997 bis 31.3.2022 das Institut für Multimediale und Interaktive Systeme (IMIS) als Gründer und Geschäftsführender Direktor. Er forscht und lehrt vor allem in den Bereichen Mensch-Maschine-Systeme, Mensch-Computer-Interaktion, Medieninformatik sowie Digitalisierung in Bildung und Kultur. Er berät Unternehmen sowie öffentliche Verwaltungen und Aufsichtsbehörden in Fragestellungen des Zusammenwirkens von Mensch, Technik und Organisation. Neben vielen wissenschaftlichen Fachpublikationen ist er ist Herausgeber und Autor einer Reihe von Fachbüchern zu Software-Ergonomie, Interaktionsdesign, Medieninformatik und Prozessführungssystemen. Prof. Herczeg ist seit 40 Jahren Mitglied der Gesellschaft für Informatik (GI), Gründer diverser GI-Fachgruppen und war von 2010 bis 2016 Sprecher des Fachbereiches Mensch-Computer-Interaktion und Mitglied des Präsidiums der GI. Über viele Jahre war er persönliches Mitglied des Technologie- und Innovationsrats des Landes Schleswig-Holstein und hat 2018 Joint Innovation Lab für E-Government und Open Data Ecologies (JIL) mitbegründet. Von 2021 bis 2023 war er Präsidiumsbeauftragter der Universität zu Lübeck für Digitalisierung in Bildung und Kultur. Seit 1.4.2022 ist er im Ruhestand, forscht, publiziert und berät aber weiterhin in seinem Fachgebiet. Professur Professur für Mensch-Computer-Systeme Curriculum Vitae 1976-1982 Studium der Informatik mit Studienschwerpunkten Mensch-Maschine-Systeme und Künstliche Intelligenz an der Universität Stuttgart 1982 Diplom in Informatik (Dipl.-Inform.) an der Universität Stuttgart 1986 Promotion in Informatik (Dr. rer. nat.) an der Universität Stuttgart zum Thema \"Architektur wissensbasierter Benutzungsschnittstellen\" 1983 - 1988 wissenschaftlicher Mitarbeiter im BMFT-Forschungsprojekt INFORM zur nutzergerechten Mensch-Maschine-Kommunikation am Institut für Informatik der Universität Stuttgart 1988 - 1992 Projektleiter für Künstliche Intelligenz, Wissensbasierte Systeme und Expertensysteme bei Bosch Telecom in Backnang 1988 - 1996 Lehrbeauftragter für Software-Ergonomie und Interaktive Systeme an der Universität Stuttgart 1992 - 1996 Fachabteilungsleiter in der Softwareentwicklung für Netzmanagement- und Breitbandsysteme bei der Alcatel SEL AG in Stuttgart 1996 - 1997 Professor (C3) für Softwaretechnik und Mensch-Maschine-Kommunikation im Fachbereich Informatik an der FH Gelsenkirchen seit 1.2.1997 Professor (C4) für Informatik (Multimediale und Interaktive Systeme) an der Universität zu Lübeck 1.2.1997 - 31.3.2022 Gründer und Geschäftsführender Direktor des IMIS 1997 Gründer des Multimedia-Entwicklungszentrums Schleswig-Holstein (MESH) 1998-2001 Berater und Aufsichtsrat der AVECS Corporation AG (maritime Sicherheits- und QS-Systeme) 1999-2005 persönliches Mitglied des Technologie- und Innovationsrats der Landesregierung Schleswig-Holstein 2001 - 2011 Initiator, Mitbegründer, wiss. Leiter und Aufsichtsrat der Media Docks Lübeck und der ISNM International School of New Media Lübeck 2001 - 2020 Berater und Aufsichtsrat der MACH AG 2001-2022 Projektleitungen für ArtDeCom (Informatik und Kunst), ALS (Ambient Learning Spaces), KiMM (Kids in Media and Motion), LIaS (Lübecker Informatik an Schulen) für Digitalsierung in Bildung und Kultur 2007-2013 Gründer und Sprecher der Fachgruppe \"Medieninformatik\" der Gesellschaft für Informatik 2010-2016 Sprecher des Fachbereichs \"Mensch-Computer-Interaktion\" und Mitglied des Präsidiums der Gesellschaft für Informatik 2015 Gründer der Fachgruppe \"Mensch-Maschine-Interaktion in sicherheitskritischen Systemen\" der Gesellschaft für Informatik 2018 Mitbegründer des Joint Innovation Lab für E-Government und Open Data Ecologies in Lübeck seit 2008 Projektleiter für das Forschungs- und Transferprojekt ALS (Ambient Learning Spaces) für Digitalsierung in Bildung und Kultur 2021-2023 Präsidiumsbeauftragter für Digitalisierung in Bildung und Kultur seit 1.4.2022 im Ruhestand, aber weiterhin aktiv in Forschung und Unternehmensberatung Projekte Geleitete Projekte Medin Multimediales Fernstudium Medizinische Informatik Fernstudienprojekt: Nebenfach Medizinische Informatik im Informatikstudium der Fernuniversität ArtDeCom Theorie und Praxis ästhetischer und informatischer Aus- und Fortbildung ALS Ambient Learning Spaces TaBeL Tablet-basierte Erfassung funktioneller Beeinträchtigungen und Lebensqualität bei Patienten/innen mit Kopf-Hals-Tumoren – eine kontrollierte Versorgungsstudie NetzDatenStrom Standardkonforme Integration quelloffener Big Data-Lösungen in existierende Netzleitsysteme LIaS Lübecker Informatik an Schulen KiMM Kids in Media and Motion Koordinierte Projekte VFH Virtuelle Fachhochschule Medin Multimediales Fernstudium Medizinische Informatik Fernstudienprojekt: Nebenfach Medizinische Informatik im Informatikstudium der Fernuniversität Laufende Projekte MANV Mobile elektronische Datenerfassung bei einem Massenanfall von Verletzten ALS Ambient Learning Spaces Abgeschlossene Projekte Ecstasy-Online VR-Fahrsimulator Medical Navigator LIaS Lübecker Informatik an Schulen Virtueller Druck- und Medienverbund Publikationen Publikationen Herczeg, M. (2024)Roles of Digital Technologies in Education: From Computers in Classrooms to Digital Knowledge-Building EnvironmentsProceedings of ICERI2024 Conference, 2422-2431. https://doi.org/10.21125/iceri.2024.0654Publikation herunterladenZitieren Herczeg, M. (2024)Ambient Learning Spaces (ALS): Interactive Learning Environments and Knowledge Media Machines for Post-Constructivist Teaching and Learning in the 21st CenturyIMIS Technical Reports. Publikation herunterladenZitieren Herczeg, M. (2024)The Role of Digital Technologies and Human-Computer Interaction for the Future of Educationi-com: Journal of Interactive Media, 23(2). https://doi.org/10.1515/icom-2024-0008Zitieren Herczeg, M. (2023)Ambient Learning Environments – Multimodal Interactive Teaching and Learning Environments with low Threshold, wide Walls, and high CeilingProceedings of ICERI2023 Conference, 8250-8260. https://doi.org/10.21125/iceri.2023.2113Publikation herunterladenZitieren Herczeg, M. (2023)Ambient Learning Spaces: The Role of Distributed Knowledge Media Management Systems for Computer-Supported Teaching and LearningProceedings of INTED 2023, 820-830. https://doi.org/10.21125/inted.2023.0258Publikation herunterladenZitieren Herczeg, M. (2022)Ambient Learning Spaces: Chances and Challenges of Interactive Knowledge Media Platforms for Schools and MuseumsProceedings of ICERI2022 Conference, 2378-2388. https://doi.org/10.21125/iceri.2022.0601Publikation herunterladenZitieren Herczeg, M. (2021)Education in the Digital Age: A Driving Force or a Lost Placei-com, 20(3), 263-277. https://doi.org/10.1515/icom-2021-0031Zitieren Herczeg, M. , Ohlei, A. , Reins, T. ,  & Schumacher, T. (2021)Ambient Learning Spaces - Constructing Timelines through Distributed Collaborative LearningProceedings of ICERI2021 Conference, 3972-3981. https://doi.org/10.21125/iceri.2021.0942Publikation herunterladenZitieren Herczeg, M. , Ohlei, A. , Schumacher, T. ,  & Willer, L. (2021)Context and Size Matters - Integrated Ambient Learning Spaces from Mobile to Immersive MediaProceedings of ICERI2021 Conference, 3945-3955. https://doi.org/10.21125/iceri.2021.0939Publikation herunterladenZitieren Berndt, H. ,  & Herczeg, M. (2021)Stufenbasierte Automation für Aufgaben der Leitungskräfte des Rettungsdienstes Mensch und Computer 2021 - Workshopband. https://doi.org/10.18420/muc2021-mci-ws08-375Publikation herunterladenZitieren Herczeg, M. , Ohlei, A. , Schumacher, T. ,  & Winkler, T. (2021)Ambient Learning Spaces: Systemic Learning in Physical-Digital Interactive Spaces In Algorithmic and Aesthetic Literacy: Emerging Transdisciplinary Explorations for the Digital Age (pp. 97-115). Verl. Barbara Budrich. https://doi.org/10.3224/84742428.06Publikation herunterladenZitieren Herczeg, M. , Ohlei, A. ,  & Schumacher, T. (2021)Ambient Learning Spaces: A Connecting Link between Digital Technologies and Computer-supported PedagogyProceedings of INTED2021 Conference 8th-9th March 2021, 6011-6021. https://doi.org/10.21125/inted.2021.1201Publikation herunterladenZitieren Ohlei, A. , Schumacher, T. ,  & Herczeg, M. (2021)VideoEdit: an easy-to-use web-based Video Creation Tool for the ClassroomProceedings of INTED2021 Conference 8th-9th March 2021, 6076-6085. https://doi.org/10.21125/inted.2021.1216Publikation herunterladenZitieren Ohlei, A. , Schumacher, T. ,  & Herczeg, M. (2020)An Analytics System for the Evaluation of Interactions of Museum Visitors in Augmented Reality ToursMensch und Computer 2020, Workshop on Virtual and Augmented Reality in Everyday Context (VARECo). https://doi.org/10.18420/muc2020-ws122-270Publikation herunterladenZitieren Herczeg, M. , Schumacher, T. ,  & Ohlei, A. (2020)Ambient Learning Spaces: Discover, Explore and Understand Semantic CorrelationsProceedings of ICERI2020 Conference 9th-10th November 2020, 7990-7999. https://doi.org/10.21125/iceri.2020.1771Publikation herunterladenZitieren Herczeg, M. , Ohlei, A. ,  & Schumacher, T. (20",
  "content_length": 98171,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:11"
}