{
  "name": "Michele Caprio",
  "homepage": "https://research.manchester.ac.uk/en/persons/michele-caprio",
  "status": "success",
  "content": "Michele Caprio - Research Explorer The University of Manchester Michele Caprio Dr Senior Lecturer in Machine Learning, Machine Learning and Robotics https://orcid.org/0000-0002-7569-097X Accepting PhD StudentsPhD projectsMultimodal Credal Learning Theory (CDT Project, joint with Tingting Mu) Personal profile BiographyMichele is a Lecturer (Assistant Professor) in Machine Learning and Artificial Intelligence at The University of Manchester. He obtained his PhD in Statistics from Duke University, and worked as a postdoctoral researcher in the Department of Computer and Information Science of the University of Pennsylvania. His general interest is probabilistic machine learning, and in particular the use of imprecise probabilistic techniques to investigate the theory and methodology of uncertainty quantification in Machine Learning and Artificial Intelligence. Recently, he won the IJAR Young Researcher and the IMS New Researcher Awards, and he was elected member of the London Mathematical Society. Education/Academic qualificationDoctor of Philosophy, Advances in Choquet Theories, Duke UniversityAward Date: 8 May 2022 Areas of expertiseQA75 Electronic computers. Computer scienceImprecise Probabilistic Machine LearningUncertainty QuantificationApplied Probability Fingerprint Dive into the research topics where Michele Caprio is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Probability Measure Mathematics 100% Epistemic Uncertainty Mathematics 74% Lower and upper bounds Mathematics 74% Probability Distribution Mathematics 56% Training Set Mathematics 37% Error Bound Mathematics 37% Kullback-Leibler Divergence Mathematics 37% Optimal Number Mathematics 37% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 11 Conference contribution 8 Article 1 Chapter 1 Paper 1 More 1 Preprint Research output per year Research output per year Conformalized Credal Regions for Classification with Ambiguous Ground TruthCaprio, M., Li, S., Stutz, D. & Doucet, A., 3 Feb 2025, In: Transactions on Machine Learning Research .Research output: Contribution to journal › Article › peer-review Open Access Conformal Prediction 100% Conformal Prediction Regions are Imprecise Highest Density RegionsCaprio, M., Sale, Y. & Hüllermeier, E., 2025, International Symposium on Imprecise Probabilities: Theories and Applications 2025.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Distributionally Robust Statistical Verification with Imprecise Neural NetworksDutta, S., Caprio, M., Lin, V., Cleaveland, M., Jang, K. J., Ruchkin, I., Sokolsky, O. & Lee, I., 21 May 2025, Hybrid Systems: Computation and Control 2025.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile System Black Box 100% 4 Downloads (Pure) Epistemic Errors of Imperfect Multitask Learners When Distributions ShiftSloman, S. J., Caprio, M. & Kaski, S., 29 May 2025, arXiv, p. 1-23, 23 p.Research output: Preprint/Working paper › Preprint File Transfer Learning 100% Multitask Learning 100% Multiple Task 100% Error Bound 100% Epistemic Uncertainty 100% 4 Downloads (Pure) Finite Admixture Models: a Bridge with Stochastic Geometry and Choquet TheoryCaprio, M. & Mukherjee, S., 29 Aug 2025, In: Statistics .Research output: Contribution to journal › Article › peer-review Open Access View all 22 research outputs Projects 1 Active Projects per year MCAIF: Centre for AI FundamentalsKaski, S. (PI), Alvarez, M. (Researcher), Pan, W. (Researcher), Mu, T. (Researcher), Rivasplata, O. (PI), Sun, M. (PI), Mukherjee, A. (PI), Caprio, M. (PI), Sonee, A. (Researcher), Leroy, A. (Researcher), Wang, J. (Researcher), Lee, J. (Researcher), Parakkal Unni, M. (Researcher), Sloman, S. (Researcher), Menary, S. (Researcher), Quilter, T. (Researcher), Hosseinzadeh, A. (PGR student), Mousa, A. (PGR student), Glover, E. (PGR student), Das, A. (PGR student), DURSUN, F. (PGR student), Zhu, H. (PGR student), Abdi, H. (PGR student), Dandago, K. (PGR student), Piriyajitakonkij, M. (PGR student), Rachman, R. (PGR student), Shi, X. (PGR student), Keany, T. (PGR student), Liu, X. (PGR student), Jiang, Y. (PGR student), Wan, Z. (PGR student), Harrison, M. (Support team), Machado, M. (Support team), Hartford, J. (PI), Kangin, D. (Researcher), Harikumar, H. (PI), Dubey, M. (PI), Parakkal Unni, M. (PI), Dash, S. P. (PGR student), Mi, X. (PGR student) & Barlas, Y. (PGR student)1/10/21 → 30/09/26Project: Research Reinforcement Learning 100% Neural Network 71% Approximation (Algorithm) 62% Machine Learning 61% Artificial Intelligence 56% Prizes Aleane Webb Dissertation Research FellowshipCaprio, M. (Recipient), 2021Prize: Prize (including medals and awards) Research Grants 100% Theses 100% Graduate Student 100% Research Project 100% School Graduate 50% First Place at the IROS 2025 Quadruped Robot ChallengeMousa, A. (Recipient) & Caprio, M. (Recipient), 2025Prize: Prize (including medals and awards) Contrastive Learning 100% IJAR Young Researcher AwardCaprio, M. (Recipient), 2023Prize: Prize (including medals and awards) Occupations 100% Occupational Career 100% IMS Hannan Travel AwardCaprio, M. (Recipient), 2022Prize: Prize (including medals and awards) IMS New Researchers Travel AwardCaprio, M. (Recipient), 2023Prize: Prize (including medals and awards) Expenditure 100%",
  "content_length": 5768,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:19"
}