{
  "name": "Michael Yacci",
  "homepage": "https://www.rit.edu/gccis/michael-yacci",
  "status": "success",
  "content": "Michael Yacci | Golisano College of Computing and Information Sciences | RIT RIT Logo with Text Michael Yacci Senior Associate Dean for Academic Affairs Dean’s Office Golisano College of Computing and Information Sciences mayici@rit.edu 585-475-5416 Office Location GOL-1024 Michael Yacci Senior Associate Dean for Academic Affairs Dean’s Office Golisano College of Computing and Information Sciences Education BS, Ithaca College; MS, Rochester Institute of Technology; Ph.D., Syracuse University mayici@rit.edu 585-475-5416 Areas of Expertise Computing Education Human-Computer Interaction Select Scholarship Invited Keynote/PresentationYacci, Michael and James Foley. \"Exploring the Computing Exploration Program.\" Assessment Network of New York, Second Annual Conference. Assessment Network of New York (ANNY). Rochester, NY. 28 Apr. 2014. Conference Presentation.Published Conference ProceedingsStoll, Steven, Michael Yacci, and Evelyn P. Rozanski. \"A Contextual Inquiry into Information Trails for Transactive Memory Systems.\" Proceedings of the EdMedia 2013 - World Conference on Educational Media and Technology, 2013 Victoria, BC. Ed. Jan Herrington; Alec Couros; Valerie Irvine. Victoria, British Columbia: n.p., 2013. Print.Yacci, Michael and Evelyn P. Rozanski. \"Student Information Consumption Strategies: Implications of the Google Effect.\" Proceedings of the iConference 2012: Culture, Design, Society. Ed. iConference. Toronto, Canada: ACM, 2012. Print.Yacci, Michael and Evelyn P. Rozanski. \"Technology and Cognitive Load of the Student-Task.\" Proceedings of the CHI \\\\\\'12 EA. Ed. CHI. Austin, TX: ACM, 2012. Print.Yacci, Michael and Evelyn Rozanski. \"Lookup or Learn: A Grounded Theory Approach to the Student-Task.\" Proceedings of the 9th International Conference on Education and Information Systems, Technologies and Applications: EISTA 2011, July 19-22, 2011. Ed. Nagib Callaos and Andres Tremante. Orlando, FL: EISTA, 2011. Web.Yacci, Michael and Mark Marcello. \"Personification and Practical Dialogues in a Kiosk Agent.\" Proceedings of the Ed-Media: World Conference on Educational Multimedia, Hypermedia, and Telecommunications. Ed. Jan Herrington. Toronto, Canada: AACE, 2010. Print. In the News January 10, 2022 NSF-funded study creates scholarships to help computing scholars find success RIT received a nearly $1 million National Science Foundation grant that will provide scholarships for computing students and help researchers explore new ways to improve computing education. Sharon Mason, a professor in RIT’s School of Information, is principal investigator of the project. More News Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 2820,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:08"
}