{
  "name": "Michael Gelfond",
  "homepage": "http://redwood.cs.ttu.edu/~mgelfond",
  "status": "success",
  "content": "Michael Gelfond Michael Gelfond Professor of Computer Science Texas Tech University email: michael.gelfond@ttu.edu address: Department of Computer Science Texas Tech University College of Engineering Box 43104 Lubbock, TX 79409 Education Areas of Interest Summary of Research Selected Publications Teaching Professional Service Honors and Awards Selected Talks Knowledge Representation Lab Texas Action Group Education M.S. in Mathematics (1968), St. Petersburg University, St. Petersburg, Russia Ph.D. in Mathematics (1974), Steklov Mathematical Institute, St. Petersburg, Russia Areas of Interest Knowledge Representation, Logic Programming, Answer Set Programming Summary of Research I am interested in the development of languages for representing commonsense knowledge and investigating their mathematical and computational properties. My recent work deals with the semantics of logic programs and their extensions, logic programming and non-monotonic reasoning, the formal representation of properties of actions and their effects, and the development of software components for intelligent agents. Selected Publications My recent papers can be found in the Papers section of the Knowledge Representation Lab website M. Balduccini and M. Gelfond: Diagnostic Reasoning with A-Prolog - Theory and Practice of Logic Programming, 3(4-5):425-461, Jul. 2003 M. Gelfond and N. Leone: Logic Programming and Knowledge Representation – A-Prolog Perspective - Artificial Intelligence, 2002 M. Gelfond: Representing Knowledge in A-Prolog - Volume 2408 of Computational Logic: Logic Programming and Beyond, Essays in Honour of Robert A. Kowalski, Part II, pages 413-451, 2002 M. Gelfond, M. Balduccini, J. Galloway: Diagnosing Physical Systems in A-Prolog - Proceedings of the 6th International Conference on Logic Programming and Nonmonotonic Reasoning, pages 213-225, Sep. 2001 M. Balduccini, M. Gelfond, M. Nogueira, R. Watson, M. Barry: An A-Prolog Decision Support System for the Space Shuttle - AAAI Spring Symposium, Mar. 2001 M. Balduccini, M. Gelfond, M. Nogueira: A-Prolog as a Tool for Declarative Programming - Proceedings of the 12th International Conference on Software Engineering and Knowledge Engineering (SEKE'2000) C. Baral and M. Gelfond: Reasoning Agents in Dynamic Domains - Logic Based Artificial Intelligence, edited by J. Minker, Kluwer 2000 M. Gelfond and T.C. Son: Reasoning with Prioritized Defaults - Lecture Notes in Artificial Intelligence, 1471, edited by J. Dix, L. M. Pereira, T. Przymusinski, pages 164-224, 1998 M. Gelfond and A. Gabaldon: From Functional Specifications to Logic Programs - Proceedings of the International Logic Programming Symposium, pages 355-371, 1997 (this version contains the proofs of the theorems from the ILPS'97 paper) C. Baral, M. Gelfond, A. Provetti: Reasoning About Actions: Laws, Observations, and Hypotheses - Journal of Logic Programming volume 31, pages 201-244, 1997 C. Baral and M. Gelfond: Reasoning About Effects of Concurrent Actions - Journal of Logic Programming volume 31, pages 85-118, 1997 M. Gelfond and H. Przymusinska: Towards a Theory of Elaboration Tolerance: Logic Programming Approach - Journal on Software and Knowledge Engineering, volume 6, number 1, pages 89-112, 1996 C. Baral and M. Gelfond: Logic Programming and Knowledge Representation - Journal of Logic Programming, 19, 20:73-148, 1994 (survey paper) M. Gelfond and V. Lifschitz: Representing Actions and Change by Logic Programs - Journal of Logic Programming, volume 17, number 2,3,4, pages 301-323, 1993 M. Gelfond: Logic Programming and Reasoning with Incomplete Information - Annals of Mathematics and Artificial Intelligence, 12, pages 89-116, 1994 M. Gelfond and H. Przymusinska: Reasoning in Open Domains - Logic Programming and Nonmonotonic Reasoning, edited by L. Pereira and A. Nerode, pages 397-413, MIT Press, 1993 M. Gelfond, V. Lifschitz, A. Rabinov: What Are the Limitations of the Situation Calculus? - Automated Reasoning, Essays in Honor of Woody Bledsoe, edited by S. Boyer, pages 167-181, Kluwer 1991 M. Gelfond and V. Lifschitz: Classical Negation in Logic Programs and Disjunctive Databases - New Generation Computing, volume 9, pages 365-385, 1991 M. Gelfond and V. Lifschitz: The Stable Model Semantics for Logic Programming - Proceedings of the Fifth International Conference on Logic Programming (ICLP), pages 1070-1080, 1988 Back to Top Teaching CS3383 Theory of Automata (Spring 2017) Syllabus: PDF CS3364 Design and Analysis of Algorithms (Fall 2017) Syllabus: PDF Slides: PDF CS 3368 Artificial Intelligence (Fall 2015) Syllabus: PDF FirstLecture: PDF Textbook: Knowledge Representation, Reasoning, and the Design of Intelligent Agents CS 5368 Intelligent Systems (Fall 2015) Syllabus: PDF FirstLecture: PDF Textbook: Knowledge Representation, Reasoning, and the Design of Intelligent Agents Back to Top Professional Service Area Editor in Knowledge Representation and Nonmonotonic Reasoning for the Journal of Theory and Practice of Logic Programming Executive Editor of the Journal of Logic and Computation Co-founder and co-head of the Knowledge Representation Lab Co-organizer of the Texas Action Group Co-Chair of the 27th International Conference on Logic Programming, 2011 Co-Chair of the 5th International Conference on Logic Programming, 1999 Logic Programming and Nonmonotonic Reasoning Conference (LPNMR'99) Back to Top Honors and Awards Received a number of awards for my work on Answer Set Programming including two “Most Influential Paper in 20 Years Awards” from the Association for Logic Programming (awarded in 2004 and 2012) Two scientific symposiums were organized to honor my 50th and 65th birthdays, the proceedings of which were published as Festschrifts in 1997 and 2011 Elected a member of European Academy of Sciences, 2002 Elected a fellow of the Association for the Advancement of Artificial Intelligence, 2002, “for significant contributions to the development of the stable model semantics, answer set semantics, and work in cognitive robotics, logic programming, and nonmonotonic reasoning” The Burlington Northern Distinguished Acievement Award in Research, 1994 Received a numbers of awards for excellence in teaching Back to Top Selected Talks Scientific Presentations \"Policies,\" \"Modular Action Language ALM,\" KRlab, 2015 \"Combining Probabilistic and Logical Reasoning,\" Judea Pearl Symposium, 2010 \"Personal Perspective on the Development of Logic Programming Based KR Languages,\" Lexington, 2010 \"Some Thoughts on the Development of Action Theories\" \"Knowledge Representation and Logic Programming,\" First Compulog Americas Summer School on Constraint Logic Programming \"ALOG\" \"P-log\" \"Logic Programming and Reasoning about Actions and Time\" \"Logic Based Approach to AI\" Thoughts on Teaching (by me and others) \"Some Thoughts on Teaching Computer Science\" by Michael Gelfond \"On Learning History\" by Michael Gelfond \"Welcome to Computer Science\" from Nelson Rushton's upcoming book \"Science and Human Freedom\" by Judea Pearl Back to Top",
  "content_length": 7047,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:02"
}