{
  "name": "Michal Derezinski",
  "homepage": "https://users.soe.ucsc.edu/~mderezin",
  "status": "success",
  "content": "Baskin School of Engineering – Baskin Engineering provides unique educational opportunities, world-class research with an eye to social responsibility and diversity. Skip to content ucsc.edu BE News Students Current Undergraduate Students Prospective Undergraduate Students Undergraduate Student Newsletter Current Graduate Students Prospective Graduate Students Graduate Student Newsletter Student Organizations Student Employment Staff & Faculty Home » Home Be bold Inspiring engineers to elevate the world through bold and socially responsible innovation Apply now Be boundless Inspiring engineers to elevate the world through bold and socially responsible innovation Apply now Be a Baskin Engineer Inspiring engineers to elevate the world through bold and socially responsible innovation Apply now #2top public colleges for engineering salaries (Wall Street Journal, 2023)3Baskin Engineering alumni named in Forbes 30 Under 30 (Forbes, 2024)#5best game/simulation development program in the nation (U.S. News & World Report, 2024)ASEEBronze-level recognition by the American Society for Engineering Education, Diversity Recognition Program (2023-2025)#13best public school for making an impact (Princeton Review, 2025)AAUUCSC joined just 65 other universities in the Association of American Universities in 2019#12national public university for excellence in undergraduate teaching (U.S. News & World Report, 2025)HSRUmember of the Alliance of Hispanic Serving Research Universities#7best applied mathematics bachelor's program in California (College Factual, 2025)#8best computer engineering bachelor's degree schools in the far Western US region (College Factual, 2025) Overview A campus of exceptional beauty in coastal Santa Cruz is home to a community of people who are problem solvers by nature: Baskin Engineers. Founded in 1997 alongside the expanding internet, our school is uniquely positioned to address the challenges of the modern world. At the Baskin School of Engineering, faculty and students collaborate to create technology with a positive impact on society, in the dynamic atmosphere of a top-tier research university. Recent News WiFi signals can measure heart rate—no wearables needed UC Santa Cruz engineers have shown that low-cost household WiFi devices can achieve clinical-level heart rate monitoring without the need for wearable devices. Read more Evidence suggests early developing human brains are preconfigured with instructions for understanding the world Assistant Professor of Biomolecular Engineering Tal Sharf’s lab used organoids to make fundamental discoveries about human brain development. Students develop AI solutions for wildfire mitigation at Reboot the Earth hackathon Student hackers tackled California’s wildfire crisis at the event co-hosted by the United Nations and the Baskin School of Engineering Inspiring Change: UC Santa Cruz launches $750M campaign The campaign is a collective effort to raise funding to accelerate the campus’s groundbreaking discoveries, create real, lasting solutions to some of the world’s most consequential challenges, and amplify the next generation of leaders and scholars. See all news Celebrating 25 years of genomics innovation July 2025 will mark the 25th anniversary of the UC Santa Cruz Genome Browser, one of the most widely used resources for genomics worldwide. Genomics for all Bold new solutions to society’s most complex issues Explore research by impact areas. Climate Solutions Virtual Environments Robotics Welcome to Baskin Engineering An exciting academic life awaits you Join a vibrant community of students, faculty, and researchers committed to building a better future. With a focus on socially responsible innovation in areas such as health engineering, climate and sustainability, machine learning, artificial intelligence, games, and human computer interaction, there are endless possibilities to make a positive impact. We can’t wait to see what you will accomplish here. Our locations Baskin Engineering Buildings The Baskin Engineering Buildings are located on the main UCSC Campus and serve as a thriving space for innovation, collaboration, and academic life. Here, faculty and students develop bold solutions to society’s most pressing challenges – from climate change and disease prevention to developing sustainable AgTech solutions, and engineering socially responsible technology. Get directions and more information. Westside Research Park Westside Research Park (WRP) fosters groundbreaking research in genomics, neuroscience, energy, robotics, and more — bringing scientists together to develop novel solutions to complex challenges across disciplines. WRP is home to the UCSC Genome Browser, one of the most widely used tools in genomics worldwide, and hosts many cutting-edge labs. UCSC Silicon Valley Campus The Silicon Valley Campus (SVC) is a hub for high-impact research, technological innovation, and interdisciplinary learning. Our faculty and students conduct innovative research relevant to the local tech field, leveraging close ties with Silicon Valley industry partners to extend the impact of their work. Baskin Engineering at SVC is advancing knowledge across three industry-relevant areas, including games and playable media, human computer interaction, and natural language processing. Upcoming Events Western Regional Hub: Undergraduate Success Group Meeting December 2, 2025 NLP MS Virtual Information Session December 2, 2025 When Less is More: Applications of Type-Based Underapproximate Reasoning December 3, 2025 Engineering 2 See all events Inclusion at Baskin Engineering UC Santa Cruz and Baskin Engineering are committed to creating educational equity that will lead to real, transformative change. We are one of only two institutions in the nation that holds the honor of being a Hispanic Serving Institution, an Asian American Native American Pacific Islander Serving Institution, and member of the Association of American Universities. Read More Genomics for everyone UCSC researchers release the first human ‘pangenome,’ better representing our genetic diversity and setting the stage for new discoveries. Read More Shaping the future of health technology Cutting-edge approaches to disease detection are enabling faster, more accurate diagnostics—led by Distinguished Professor of Electrical and Computer Engineering Holger Schmidt. @BaskinEngineering View this profile on Instagram Baskin Engineering at UCSC (@baskinengineering) • Instagram photos and videos Follow us on Instagram Facebook Bluesky X LinkedIn Our innovative research creates positive social impact across communities, industries, and the world. Explore more Baskin School of Engineering1156 High StreetSanta Cruz, CA 95064 Contact Us Careers Make a Gift Online Store",
  "content_length": 6789,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:12"
}