{
  "name": "Michael Bedford Taylor",
  "homepage": "http://cseweb.ucsd.edu/~mbtaylor",
  "status": "success",
  "content": "ASIC Clouds, Dark Silicon, Tiled Processors, Specialization, Vision and Bitcoin Professor Michael B. Taylor Bespoke Silicon Group Center for Dark Silicon Paul Allen School of Computer Science and Engineering Dept of Electrical Engineering University of Washington, Seattle professional correspondence official UW business (course-related, funding, admin, rec letters, etc) CSE 564 (Paul Allen Center) office +1 use email phone Research Team Teaching Service Programming Team NEWSFLASH: I am recruiting heavily for both graduate students and postdocs for my team at UW. Interested PhD/MS students and Postdocs should apply to either or both departments and drop me a note (2 chances, 1 great advisor!) Bio I have been a professor in the Paul Allen School of Computer Science and Engineering and Dept. of Electrical Engineering at the University of Washington, Seattle since September 2017. I was a Visiting Research Scientist at Google and YouTube, working on datacenter accelerators, and before that I was a tenured professor at the University of California San Diego Computer Science and Engineering Department from 2005 to 2016. I received a PhD in Electrical Engineering and Computer Science from MIT, and my research centers around computer architecture but spans the stack from VLSI to compilers. I was lead architect of the 16-core MIT Raw tiled multicore processor, one of the earliest multicore processors, which was commercialized into the Tilera TILE64 architecture. Recently, in 2017, Intel Skylake SP has adopted our scalable mesh of cores architecture that we proposed. I co-authored the earliest published architecture research on dark silicon, the result of the end of Dennard scaling, including a paper that derives the utilization wall that causes dark silicon, and in that paper proposed specialization as the primary way this probably would be attacked. To demonstrate these ideas, we proposed a prototype massively specialized processor called GreenDroid, and in that work claimed that the future chips would start incorporating exponentially growing numbers of accelerators, a hypothesis which has come true for Apple iPhone chips, as shown in this innovative study by David Brooks's team at Harvard. I also wrote a paper that establishes the definitive taxonomy, the Four Horsemen, for the semiconductor industry's approaches to dealing with the problem, and a follow-on paper on the Landscape of the Dark Silicon Design Regime. My research on dark silicon fed into the ITRS 2008 report that led Mike Mueller of ARM to coin the term \"dark silicon\". More recently, I wrote the first academic paper on Bitcoin mining chips and in this paper proposed that this was evidence of a totally new model for chip development: rather than the old model of traditional chip companies figuring and selling general-purpose compute chips that were targeted to a wide audience and not specific to a particular application domain; we would have \"a new age of hardware innovation tailored to emerging application domains—an Age of Bespoke Silicon\". Effectively their former customers would drive the creation of \"bespoke silicon chips\" for their specific application needs. This prediction has since come true; every hyperscale datacenter company (i.e. Facebook, Alibaba, Google, Microsoft, ...) has their own domain specific chips under development. Immediately after that paper, from 2013-2016, we worked on the concept of ASIC Clouds. In 2016, my team published the first paper on ASIC Clouds. We make the case that datacenters full of ASICs are in our near future, and show a prototypical ASIC Cloud architecture, how they should be designed, and how they save TCO. We proposed neural network ASIC Clouds before Google announced their TPU, and also proposed the use of video transcoding clouds for YouTube, an approach which Google adopted subsequent to the publication of our paper and disclosed in ASPLOS 2021. This paper has a nice overview and retrospective of the work Communications of the ACM ASIC Cloud paper. This paper was also selected to be a ACM Research Highlight; on average only two papers per year out of all of computer architecture publications in the world! In 2017, we published the first architecture paper on NRE, non-recurring engineering expense. We show how minimizing NRE can be more important for ASIC Cloud feasibility than optimizing accelerator speedup or energy efficiency. We present the first ever architect's model for NRE, using current industry parameters (paper) (youtube talk), and opening up a new area of research. With the rise of specialization and the end of Moore's law, driving down the cost of design will surely be an important driver of future research. Also in 2017, we designed the architecture and wrote the RTL for the open source 511-core RISC-V compatible Celerity chip, and together with Michigan taped it out in TSMC 16nm technology. The chip broke the world record for all silicon chips on the planet for Coremark performance and also beat the world record for single-chip RISC-V chip performance by over 100X. Returning the favor for Michigan, we taped out and brought up the Michigan OuterSpace sparse matrix chip, in TSMC 40nm technology. More recently, at UW my team taped out and brought up two complex Global Foundries 12nm chips -- on the same day! This is unprecedented for a university. One is for the DARPA POSH BlackParrot RISC-V multicore project. The other is for the DARPA SDH-funded HammerBlade RISC-V GP-GPU project. Both designs are fully open source. I occasionally help companies and other legal professionals evaluate their patent portfolios, and provide advice to companies leveraging the Tilera TILE64 architecture, or that are developing cryptocurrency hardware. I have broad expertise in hardware and software, and on the Bitcoin cryptocurrency. My research is funded primarily by the National Science Foundation (NSF), including the Secure and Trustworthy Cyberspace Program, and DARPA/SRC's C-FAR and ADA centers. Between the gaps at school, I worked on Apple's NuKernel microkernel, and co-wrote the first version of Connectix Virtual PC, an x86-to-PowerPC dynamic translation engine, which was acquired by Microsoft. I also contributed to the ChipWrights Visual Signal Processor in its earliest stages. I received the NSF CAREER Award in 2009 and tenure in 2012. My research sponsors: UW Center for Dark Silicon I direct the UW Center for Dark Silicon and the Bespoke Silicon Group. My colleagues and I were among the first to demonstrate the existence of a utilization wall which says that with the progression of Moore's Law, the percentage of a chip that we can actively use within a chip's power budget is dropping exponentially! The remaining silicon that must be left unpowered is now referred to as Dark Silicon. Our research on Conservation Cores and GreenDroid proposes new architectures that exploit dark silicon. Our paper on the The Four Horsemen (slides) overviews the landscape of architectural approaches to addressing dark silicon. In addition to researching architectures for dark silicon, I look more broadly at sources of under-utilization in current day chips, spanning from a) power limitations because of poor CMOS scaling, b) overly large software engineering costs for parallelizing programs for multicore chips, and c) lack of parallel application domains. My research attacks each of these problems by 1) reinventing processor design to make use of dark silicon, 2) utilizing existing cores better through better parallel software engineering tools and 3) finding new parallel application classes to put cores to work: The GreenDroid Mobile Applications Processor, which employs Conservation Cores to fight dark silicon. Our ASPLOS 2010 paper is one of the earliest peer-reviewed architecture papers to have a cogent description of the utilization wall that causes the Dark Silicon problem, and to propose specialization as an architectural solution. Our Hotchips 2010 work GreenDroid: A Mobile Application Processor for a Future of Dark Silicon flushes out this proposal, and is quite possibly the first published academic use of the term Dark Silicon. This was followed up with this March 2011 IEEE Micro paper. (Here is the Hotchips talk on youtube.) Our work, Is Dark Silicon Useful? Harnessing the Four Horsemen of the Coming Dark Silicon Apocalypse, which appeared in DAC and DaSi 2012, and is followed by a paper in IEEE Micro 2013, is the first paper to overview the landscape of architectural approaches that try to address the dark silicon problem. We describe the four horsemen -- four approaches to dealing with dark silicon, each with deep-seated challenges but also unique capabilities. See the slides for a very entertaining presentation on the shrinking, dim, specialized, and deux ex machina horsemen. Kremlin, a tool that, given a serial program, tells you which regions to parallelize. To create Kremlin, we developed a novel dynamic analysis, hierarchical critical path analysis, to detect parallelism across nested regions of the program, which connects to a parallelism planner which evaluates many potential parallelization to figure out the best way for the user to parallelize the target program. the San Diego Vision Benchmark Suite, which distills the emerging computer vision application class into a collection of nine benchmarks written in a research-friendly style. This work was co-advised by Prof. Serge Belongie, a member of UC San Diego's top-notch vision faculty. More recently, we have developed CortexSuite, which extends SD-VBS with a large suite of machine learning and other applications that traditionally the brain has been better at that computers. Greatest Hits (Click to view all publications) ReaLLM: A Trace-Driven Framework for Rapid Simulation of Large-Scale LLM Inference Huwan Peng, Scott Davidson, C.-J. Richard Shi and Michael Taylor. In ASAP 2025. Evaluating Ruche Networks: Physically Scalable, Cost-Effective, Bandwidth-Fle",
  "content_length": 32642,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:41"
}