{
  "name": "Michael Rabinovich",
  "homepage": "http://engr.case.edu/rabinovich_michael",
  "status": "success",
  "content": "Michael (Misha) Rabinovich Michael (Misha) Rabinovich Case Western Reserve University Electrical Engineering & Computer Science 10900 Euclid Avenue Cleveland, OH 44106-7071 full first name (not nickname).family name at case period edu Voice: (216) 368-4559 FAX: (216) 368-6888 Research Interests (see my CV for more details) I am a professor in the EECS department at Case Western Reserve University, which I joined after spending 11 years with AT&T Labs - Research. My interests include World-Wide Web, Internet, and distributed systems. In particular, my current research concerns performance and scalability issues of the Web and Internet, Internet measurements, utility computing, overlay networks, and Internet security. News: Our work on using content delivery networks as conduit for denial of service attacks was the topic of an IEEE Spectrum article in its February'2011 issue. Alumni: Abhijit Jejurkar (MS'2007 -> Medtronics) Michael Jolson (MS'2007 -> Microsoft) Maaz Khan (MS'2011-> Bloomberg Financial Services) Eamon Johnson (MS'2011 -> Case PhD student) Song Zhao (MS'2013 -> Cisco) Fajar Sudrajat (MS'2017 -> Bank Rakyat Indonesia -- the firm that funded his MS study) Stephen Brennan (MS'2017 -> Yelp) Junbo Xu (MS'2017 -> AMD) Yaokai Yang (MS'2018 -> Amazon) Brian Pollack (MS'2019 -> Amazon) Yinhang Cheng (MS'2019 -> Alibaba) Zakaria Al-Qudah (PhD'2009 -> Yarmouk University, Jordan) Zhihua Wen (PhD'2009 -> Microsoft) Hangwei Qian (PhD'2012 -> VMWare) Sipat Triukose (PhD'2013 -> NICTA (National ICT Australia)) Tom Callahan (PhD'2013 -> Explorys) Hussein Alzoubi (PhD'2014 -> Bloomberg Financial Services) Kyle Schomp (PhD'2016 -> Akamai) Rami Al-Dalky (PhD'2019 -> Microsoft) Tu Ouyang (PhD'2022; first job, while still a PhD student, -- Twitter) Our research has been supported by NSF, AT&T, and Lockheed Martin Corp. Book M. Rabinovich and O. Spatscheck. Web Caching and Replication. Addison Wesley; 2002. ISBN: 0201615703. Table of Contents. Publications Web and Internet Workflow Management Distributed Transactions Editorials",
  "content_length": 2053,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:48"
}