{
  "name": "Michael W. Berry",
  "homepage": "http://web.eecs.utk.edu/~mberry",
  "status": "success",
  "content": "Home - Michael W. Berry Skip to content Skip to main navigation Report an accessibility issue Michael W. Berry Min H. Kao Department of Electrical Engineering & Computer Science Professor Berry is the co-author and editor of eighteen books covering topics in scientific computing, information retrieval, text/data mining, and data science.  His most recent edited volume entitled Data Science and Emerging Technologies is based on papers recently presented at the 2024 International Conference on Data Science and Emerging Technologies. That volume was published in 2025 by Springer Singapore.  He is co-editor of the Soft Computing in Data Science volumes from 2015-2021 published by Springer and is the co-author of popular books published by SIAM (Society for Industrial and Applied Mathematics): Understanding Search Engines: Mathematical Modeling and Text Retrieval, Second Edition and Computational Information Retrieval.  He has published over 115 refereed journal and conference publications. He has organized numerous workshops on Text Mining and was Conference Co-Chair of the 2003 SIAM Third International Conference on Data Mining in San Francisco, CA. He was also Program Co-Chair of the 2004 SIAM Fourth International Conference on Data Mining in Orlando, FL and is currently an honorary Co-Chair of the International Conference on Soft Computing in Data Science (SCDS) series (2015-present).  He is a member of SIAM, ACM, MAA, ASEE, and the IEEE Computer Society and is currently on the editorial board of Foundations of Data Science (AIMS).  He served ten years (2015-2024) on the editorial board of the SIAM Journal on Matrix Analysis and Applications (SIAM).  Professor Berry is also a Commissioner and Program Evaluator for the Computing Accreditation Commission (CAC) of the Accreditation Board for Engineering and Technology, Inc (ABET). Areas of Interest Scientific computing Information retrieval Data Science/Analytics Augmented Intelligence Education Ph.D. in Computer Science, University of Illinois at Urbana-Champaign M.S. in Applied Mathematics, North Carolina State University B.S. in Mathematics, University of Georgia The flagship campus of the University of Tennessee System and partner in the Tennessee Transfer Pathway.",
  "content_length": 2254,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:04"
}