{
  "name": "Michael L. Overton",
  "homepage": "https://cs.nyu.edu/overton",
  "status": "success",
  "content": "Michael L. Overton Michael L. Overton Silver Professor of Computer Science and Mathematics Courant Institute of Mathematical Sciences New York University New York, NY 10012 The best way to reach me is to send me email. New: the second edition of my book on floating point arithmetic was recently published. Education B.Sc.(honors), Computer Science, University of British Columbia, 1974 M.S., Computer Science, Stanford University, 1977 Ph.D., Computer Science, Stanford University, 1979 Activities Research: Papers Teaching: Undergraduate and Graduate Courses Software: Control, Optimization and Linear Algebra Software Graduate Student Advising: PhD Students, MS Students Honors: Fellow of SIAM, Fellow of IMA Book: Numerical Computing with IEEE Floating Point Arithmetic Book Translation: Cómputo Numérico con Aritmética de punto flotante IEEE Senior Fellow: Society of Fellows, Simons Foundation Recent Journal Editorial Boards: IMA Journal of Numerical Analysis, Numerische Mathematik, Foundations of Computational Mathematics, Calcolo Boards of Organizations : SIAM (Council 1991-1996, Board of Trustees 1997-2005, Chair of Board 2004-2005), FoCM (Council), Fields Institute (Scientific Advisory Board 2001-2004), CMS (Board of Directors 2001-2005), PIMS (Scientific Advisory Board 2010-2014), Simons Foundation (MPS Scientific Advisory Board 2019-2022) Selected Lectures: MSRI (Berkeley, 2002), SIAM Appl. Lin. Alg. (Williamsburg, 2003), MODE (Le Havre, 2004), MTNS (Leuven, 2004), Wisconsin (2004), Singapore (2006), Berlin (2006), Beijing (2006), IMA (Birmingham, 2007), Seattle (2007), Simon Stevin Lecture (Leuven, 2008), Warwick (2009), Louvain-La-Neuve (2010), FoCM (Budapest, 2011), XIX Householder Symposium (Spa, Belgium, 2014), SIAM Conference on Applied Linear Algebra (Atlanta, 2015). Conference Organizing Committees: FoCM'02 Optimization Workshop, Householder Symposium XV, IMA Workshop on Semidefinite Programming, Householder Symposium XVI, Stanford 50, Householder Symposium XVII, IPAM Workshop on Numerical Methods for Continuous Optimization, Householder Symposium XVIII (Chair), Workshop on Nonlinear Optimization Algorithms and Industrial Applications. Tribute: To Margaret Wright, on the Occasion of her Election to the National Academy of Sciences Remembrance:Gene Golub Around the World Workshop: Modern Nonsmooth Optimization, in Honor of the 60th Birthday of Adrian Lewis",
  "content_length": 2404,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:31"
}