{
  "name": "Michael A. Bender",
  "homepage": "http://www3.cs.stonybrook.edu/~bender",
  "status": "success",
  "content": "Michael A. Bender's Homepage Note: an internet scammer is sending emails spoofing my email address. If you get any emails about internship offers (or other emails that seem off in some way), they aren't from me. They are from this scammer. Monteverde Cloud Forest, Costa Rica Michael A. Bender John L. Hennessy Chaired Professor of Computer Science Department of Computer Science Stony Brook University Stony Brook, NY 11794-2424 USA Tel.: +1 631-632-7835 Fax: +1 631-632-8334 E-mail: bender@cs.stonybrook.edu Short Biography Vita Bibtex Files of Publications Company Teaching Awards Program Committees Patents Journal Publications Conference Publications Selected Talks Education Harvard University.  PhD 1998 and SM 1995 in Computer Science. Advisor: M. Rabin. Thesis: New Algorithms and Metrics for Scheduling. Ecole Normale Supérieure de Lyon, France.  Diplôme d'Etudes Approfondies (DEA) d'Informatique Fondamentale and Magistère d'Informatique et de Modelisation. Mention bien, 1993. Harvard University. BA Magna Cum Laude with Highest Honors in Applied Mathematics, 1992. Computer Science Honors Program I run the Computer Science Honors Program. Here are some instructions about Senior Honors Projects on the webpage for CSE 495/496. Teaching Office Hours (Spring 2025) CSE 385 Analysis of Algorithms: Honors (Spring 2025) CSE 495/496 Senior Honors Research Projects I and II CSE 642 Algorithms Reading Group Past Teaching CSE 150 Honors Foundations of Computer Science (Fall 2019, Fall 2016, Fall 2014, Fall 2012, Fall 2010, Fall 2007, Fall 2006, Fall 2005) CSE 303 Introduction to the Theory of Computation (Spring 2005) CSE 350 Theory of Computation: Honors (Fall 2020, Spring 2019, Spring 2018, Spring 2016, Spring 2014, Spring 2007, Spring 2006) CSE 373 Undergraduate Analysis of Algorithms (Spring 2017, Spring 2005,Spring 2002, Spring 2001, Spring 1999) CSE 385 Analysis of Algorithms: Honors (Spring 2025, Spring 2024, Spring 2023, Spring 2022, Spring 2021) CSE 548 Graduate Analysis of Algorithms  (Fall 2024, Fall 2021, Fall 2018, Spring 2013, Spring 2012, Fall 2011, Fall 2010, Fall 2002, Fall 2001, Fall 2000, Fall 1999, Fall 1998) CSE 638 Advanced Graduate Analysis of Algorithms  (Spring 2012, Spring 2011, Spring 2010, Spring 2007, Fall 2006, Spring 2005; as CSE 648: Spring 2003, Spring 2002, Spring 2000) CSE 642 Algorithms Reading Group (Spring 2010-present, Spring 2007, Spring 2005; as CSE 652: Spring 2003, Fall 2003, Spring 2002, Fall 2001, Spring 2001, Fall 2000, Spring 2000, Fall 1999) MIT 6.895 Theory of Parallel Systems (Fall 2003) MIT 6.896 Theory of Parallel Hardware (Spring 2004) Awards PODS Best Paper Award. ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, 2024. Fellow of the European Association of Theoretical Computer Science, 2023. ASPLOS Distinguished Paper Award, 2023. SPAA Best Paper Runner-up Award, 2022. USENIX FAST Best Paper Runner-up Award, 2018. USENIX FAST Best Paper Award, 2016. USENIX FAST Best Paper Runner-up Award, 2015. Chancellors Award for Excellence in Teaching, Stony Brook University, 2015. IPDPS Best Paper Award, 2015. Major Contributions to Graduate Education and Research, Dept of Computer Science, Stony Brook University, 2012. Imre Simon Test-of-Time Award, 2012. Undergraduate Teaching Award, Dept of Computer Science, Stony Brook University, 2006. R&D 100 Award for Compute Process Allocator, 2006. Joint award with V. J. Leung (Sandia Labs), D. P. Bunde (UIUC), K. Pedretti (Sandia Labs), C. A. Phillips (Sandia Labs). PODS Best Newcomer Award, 2006. Dean's Award for Excellence in Graduate Teaching by a Faculty Member, Stony Brook University, 2005. Graduate Teaching Award, Dept of Computer Science, Stony Brook University, 2000. Company I founded a company called Tokutek, along with Martín Farach-Colton and Bradley Kuszmaul. Tokutek was acquired by Percona in 2015. Program Committees 10th Annual Fall Workshop on Computational Geometry 2000 Genetic and Evolutionary Computation COnference (GECCO) 2001 1st International Workshop on Efficient Algorithms (WEA) 2001 Latin American Theoretical INformatics (LATIN) 2002 Genetic and Evolutionary Computation COnference (GECCO) 2002 5th Workshop on Algorithm Engineering and Experiments (ALENEX) 2003 15th ACM-SIAM Symposium on Discrete Algorithms (SODA) 2003 10th International Conference on High Performance Computing (HiPC) 2003 Latin American Theoretical INformatics (LATIN) 2004 3rd International Conference on FUN with Algorithms (FUN) 2004 11th International Conference on High Performance Computing (HiPC) 2004 Genetic and Evolutionary Computation COnference (GECCO) 2004 15th Annual International Symposium on Algorithms and Computation (ISAAC) 2004 10th Annual International Computing and Combinatorics Conference (COCOON) 2004 13th Annual European Symposium on Algorithms (ESA) 2005 2nd Multidisciplinary International Conference on Scheduling (MISTA) 2005 12th International Conference on High Performance Computing (HiPC) 2005 (Vice-Chair, Algorithms Track) 11th European Conference on Parallel Processing (Euro-Par) 2005 (Vice-Chair, Scheduling and Load Balancing) 20th IEEE International Parallel and Distributed Processing Symposium (IPDPS) 2006 12th International Conference on Parallel and Distributed Systems (ICPADS), 2006 18th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA) 2006 13th String Processing and Information Retrieval (SPIRE) 2006 21st IEEE International Parallel and Distributed Processing Symposium (IPDPS) 2007 Workshop on Programming Models for Grid Computing (PMGC) 2007 Latin American Theoretical Informatics (LATIN) 2008 9th Workshop on Algorithm Engineering and Experiments (ALENEX) 2008 35th International Colloquium on Automata, Languages, and Programming (ICALP) 2008 4th International Workshop on Algorithmic Aspects of Wireless Sensor Networks 2008 21st ACM Symposium on Parallelism in Algorithms and Architectures (SPAA) 2009 (Program Committee Chair) 24th IEEE International Parallel and Distributed Processing Symposium (IPDPS) 2010 29th Annual ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing (PODC) 2010 17th International Conference on High Performance Computing (HiPC) 2010 31st International Conference on Distributed Computing Systems (ICDCS) 2011 (Vice Chair, Algorithms Track) 19th European Symposium on Algorithms (ESA), Engineering and Applications track 10th Latin American Theoretical Informatics (LATIN) 2012. 27th IEEE International Parallel and Distributed Processing Symposium (IPDPS) 2013. 25th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA) 2013. ASE/IEEE International Conference on Big Data 2013. 11th Latin American Theoretical Informatics (LATIN) 2014. 26th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA) 2015. 12th Latin American Theoretical Informatics (LATIN) 2016. 28th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA) 2016. Eighth International Conference on Fun with Algorithms (FUN) 2016. 36th ACM SIGACT-SIGOPS Symposium on the Principles of Distributed Computing (PODC) 2017. 46th International Conference on Parallel Processing (ICPP) 2017. Algorithms Track Co-Chair. 13th Latin American Symposium on Theoretical INformatics (LATIN) 2018. PC Chair. 30th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA). 38th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems (PODS) 2019. 27th Annual European Symposium on Algorithms (ESA) Track B, 2019. PC Chair. 23rd International Conference on Principles of Distributed Systems (OPODIS) 2019. 32nd ACM Symposium on Parallelism in Algorithms and Architectures (SPAA) 2020. 1st SIAM Conference on Applied and Computational Discrete Algorithms (ACDA) 2021. PC Chair. 50th International Conference on Parallel Processing (ICPP) 2021. 35th International Symposium on Distributed Computing (DISC) 2021. 30th Annual European Symposium on Algorithms (ESA Track S) 2022. 37th IEEE International Parallel & Distributed Processing Symposium (IPDPS) 2023 2nd SIAM Conference on Applied and Computational Discrete Algorithms (ACDA) 2023. 1st Workshop on Highlights of Parallel Computing (HOPC) 2023. Selected Conference Organization Publicity Chair. Symposium on Parallelism in Algorithms and Architectures (SPAA), 2000-2007. Co-organizer. Dagstuhl Seminar 04301: Cache-Oblivious and Cache-Aware Algorithms, July 18-23, 2004. Co-organizer. CIRM Center at Marseille-Luminy: Scheduling Algorithms for New Emerging Applications, May 29-June 2, 2006. Co-organizer. CIRM Center at Marseille-Luminy: New Challenges in Scheduling Theory, 2008. Program Committee Chair. 21st ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), 2009. Co-organizer. Centre CNRS \"La Villa Clythia,\" Frejus, France. New Challenges in Scheduling Theory, 2010. Co-organizer. 44th ACM Symposium on Theory of Computing (STOC), Tutorial on Algorithms for Memory-Sensitive Computing, 2012. Program Committee Chair (joint with Miguel Mosteiro). 13th Latin American Symposium on Theoretical INformatics (LATIN), 2018. Program Committee Chair Track B. 27th Annual European Symposium on Algorithms (ESA), 2019. Program Committee Chair (joint with J. Gilbert) 1st SIAM Conference on Applied and Computational Discrete Algorithms (ACDA), 2021. Co-organizer. Centre CNRS ``Paul-Langevin'', Aussois, France. New Challenges in Scheduling Theory, May 2022. Co-organizer. Centre CNRS ``Paul-Langevin'', Aussois, France. 1st ACDA Workshop in Aussois, September, 2022. Selected Patents United States Patent 6,112,221. A System and Method for Scheduling Webservers with a Quality-of-Service Guarantee for Each User. Michael A. Bender, Soumen Chakrabarti, and Shanmugavelayutham Muthukrishnan. Awarded August 29, 2000. United States Patent 7,565,657. Allocating Application to Group of Consecutive Processors in Fault-Tolerant Deadlock-Free Routing Path Defined by Routers Obeying Same Rules for Path Selection. Vitus Leung, Michael A. Bender, David Bunde",
  "content_length": 64064,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:33"
}