{
  "name": "Michael A. E. Wright",
  "homepage": "http://bath.academia.edu/MichaelWright",
  "status": "success",
  "content": "Michael Wright - University of Bath Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Michael WrightUniversity of Bath, Department of Computer Science, Teaching Associate and Research AssistantaddFollowdoneFollowingFollowers31Following25Co-authors3Public ViewsI am a researcher in Human Computer Interaction with a particular interest in understanding the user experience of interaction across devices, application and contexts.lessRelated Authors Stamatina Anastopoulou Mike SharplesThe Open University Eileen ScanlonThe Open University Ann JonesThe Open University Jocelyn WishartUniversity of Bristol Phil MarstonUniversity of Leicester Nicola Louise Beddall-HillCity, University of London Trevor Collins Claudio Alvarez Matilda WiklundInterests UploadsPapers by Michael WrightA “Laboratory of Knowledge-Making” for Personal Inquiry Learningby Paul Mulholland and Michael WrightLecture Notes in Computer Science, 2011This paper describes the development of nQuire, a software application to guide personal inquiry ... more This paper describes the development of nQuire, a software application to guide personal inquiry learning. nQuire provides teacher support for authoring, orchestrating and monitoring inquiries as well as student support for carrying out, configuring and reviewing inquiries. nQuire allows inquiries to be scripted and configured in various ways, so that personally relevant, rather than off-the-shelf inquiries, can be created and used by teachers and students. nQuire incorporates an approach to specifying learning flow that provides flexible access to current inquiry activities without precluding access to other activities for review and orientation. Dependencies between activities are automatically handled, ensuring decisions made by the student or teacher are propagated through the inquiry. nQuire can be used to support inquiry activities across individual, group and class levels at different parts of the inquiry and offers a flexible, web-based approach that can incorporate different devices (smart phone, netbook, PC) and does not rely on constant connectivity.Download Guess a who, why, where, when?: the visualization of context data to aid the authoring and orchestration of a mobile pervasive gameby Alan Chamberlain and Michael WrightACM Proceedings of the 2007 OTM confederated international conference on the move to meaningful internet systems , Jan 1, 2007As part of the mobile pervasive game, Professor Tanda's 'Guess A Where' [1] there was a need to a... more As part of the mobile pervasive game, Professor Tanda's 'Guess A Where' [1] there was a need to allocate pre-authored content for the game on a daily basis to provide an enjoyable and engaging experience. To aid this allocation of content we collected and visualized context information about each player during the course of the game. The aim of these visualizations was to provide a method through which an author/orchestrator could retrospectively view a player's current total and daily context data gathered by the game. Observations made about this data could then be used to, not only allocate appropriate content but, to tailor the content to a specific player. This paper presents the data that was gathered and the visualizations created to achieve this process.Download Hitchers: designing for cellular positioningby Alan Chamberlain and Michael WrightUbiComp 2006, Jan 1, 2006Hitchers is a game for mobile phones that exploits cellular position-ing to support location-base... more Hitchers is a game for mobile phones that exploits cellular position-ing to support location-based play. Players create digital hitch hikers, givingthem names, destinations and questions to ask other players, and then drop theminto their current phone cell. Players then search their current cell for hitchers,pick them up, answer their questions, carry them to new locations and drop them again, providing location-labels as hint to where they can be found. In thisway, hitchers pass from player to player, phone to phone and cell to cell, gather-ing information and encouraging players to label cells with meaningful placenames. A formative study of Hitchers played by 47 players over 4 monthsshows how the seams in cellular positioning, including varying cell size, densityand overlap, affected the experience. Building on previous discussions of designing for uncertainty and seamful design, we consider five ways of dealingwith these seams: removing, hiding, managing, revealing and exploiting them.This leads us to propose the mechanism of a dynamic search focus, to explore new visualization tools for cellular data, and to reconsider the general relation-ship between ‘virtual’ and ‘physical’ worlds in location-based games. Keywords: Mobile games, cellular positioning, ubiquitous computing, seamful designDownload 3D Gesture Recognition: An Evaluation of User and System Performanceby Michael Wright and Darren CoskerLecture Notes in Computer Science, 2011We report a series of empirical studies investigating gesture as an interaction technique in perv... more We report a series of empirical studies investigating gesture as an interaction technique in pervasive computing. In our first study, participants generated gestures for given tasks and from these we identified archetypal common gestures. Furthermore, we discovered that many of these usergenerated gestures were performed in 3D. We implemented a computer vision based 3D gesture recognition system and applied it in a further study in which participants used the common gestures generated in the first study. We investigated the trade off between system performance and human performance and preferences, deriving design recommendations. We achieved 84% recognition accuracy by our prototype 3D gesture recognition system after tuning it through the use of simple heuristics. The most popular gestures from Study 1 were regarded by participants in Study 2 as best matching the task they represented, and they produced the fewest recall errors.arrow_back_iosarrow_forward_iosDownload A Framework for Generating Gesture Sets for Mobile Pervasive ComputingThis paper presents a framework for generating gesture sets for interaction in mobile pervasive c... more This paper presents a framework for generating gesture sets for interaction in mobile pervasive computing. The framework centers around consensus building between gestures proposed by individual users, designers and groups of users. The framework specifies four phases; (1) user generation of gestures, (2) an analysis of these generated gestures resulting in a grouping based on the level of consensus between users, (3) where there is an average or low level of level of consensus, one or more alternative gestures are proposed and users are users asked to rank these gestures in order to find the highest overall level of consensus and (4) a proposed gesture set is then validated through follow up studies with new users external to the initial generation study. Identifying, Applying and Evaluating Gestural Interaction in Ubiquitous and Pervasive ComputingWe describe our ongoing research into gesture as an interaction technique for ubiquitous and perv... more We describe our ongoing research into gesture as an interaction technique for ubiquitous and pervasive computing. We report our previous work where a series of linked empirical studies and system development enabled us to gain an insight into the identification, application and evaluation of gesture. Furthermore, we report our ongoing and future research which aims to propose two complementary frameworks. The first aims to identify gestures based on end user consensus and preference. The second is to enable data regarding user and system performance and preference to be used to evaluate the identified gestures taking into account, 1. the trade off between the need for high system performance and high user performance and preference and 2. the co-adaptation of the user and the system over time. A \"Laboratory of Knowledge-Making\" for Personal Inquiry LearningArtificial Intelligence in …, Jan 1, 2011We describe nQuire, a constraint-based learning toolkit to support a continuity of inquiry based ... more We describe nQuire, a constraint-based learning toolkit to support a continuity of inquiry based learning between classroom and non-formal settings. The paper proposes design requirements for personal inquiry learning environments that support learning of personally meaningful science topics with development of metacognitive understanding and self-regulation of the scientific process through situated practice. It introduces a generic implementable model of the inquiry process, and describes an instantiation in the nQuire learning environment. An example of the use of the toolkit for a Healthy Eating inquiry with 28 Year 9 students concludes with results of the trial, design issues and recommendations.Download Personal Inquiry: Lessons LearnedProceedings of 8th …, Jan 1, 2009The paper describes a school trial in secondary to school to explore how version 1 of the PI Tool... more The paper describes a school trial in secondary to school to explore how version 1 of the PI Toolkit helped students to perform a personally relevant scientific inquiry in a science classroom and at home. Over a three-week period (nine lessons), twenty one 13-14 year old students in an inner city school participated in an inquiry to answer the question “how healthily do I eat?”. The lessons were structured around an Inquiry Guide, reflected in the design of the toolkit and the lesson plans. The Inquiry Guide designed to align with the aims of the inquiry, shaped by the teacher’s need to work within a specific vocabulary and by the styl",
  "content_length": 21476,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:36"
}