{
  "name": "Michela Taufer",
  "homepage": "https://eecs.utk.edu/people/michela-taufer",
  "status": "success",
  "content": "Michela Taufer | Min H. Kao Department of Electrical Engineering and Computer Science Skip to content Skip to main navigation Report an accessibility issue Michela Taufer Dongarra Professor Contact Biography Research Contact Information Office Address: Min H. Kao Building, Room 620Phone: 865-974-9952Fax: 865-974-5483E-mail: taufer@utk.eduGCLabEducation PhD in Computer Science, Swiss Federal Institute of Technology, Zurich, Switzerland, 2000 MS in Computer Engineering, University of Padua, Italy, 1996 Biography Michela Taufer is an ACM Distinguished Scientist. She was a J.P. Morgan Chase Scholar at the University of Delaware where she led the Global Computing Lab to promote the use of high performance computing to advance sciences. Michela Taufer joined the University of Delaware in 2007 where she was promoted to associate professor with tenure in 2012 and full professor in 2017. She earned her MS in computer engineering from the University of Padova and her PhD in computer science from the Swiss Federal Institute of Technology (ETH). She was a post-doctoral research supported by the La Jolla Interfaces in Science Training Program (also called LJIS) at UC San Diego and The Scripps Research Institute. Before she joined the University of Delaware, Taufer was faculty in computer science at the University of Texas at El Paso. Taufer has a long history of interdisciplinary work with high-profile computational biophysics groups in several research and academic institutions. Her research interests include software applications and their advance programmability in heterogeneous computing (i.e., multi-core platforms and GPUs); cloud computing and volunteer computing; and performance analysis, modeling and optimization of multi-scale applications. She has been serving as the principal investigator of several NSF collaborative projects. She also has significant experience in mentoring a diverse population of students on interdisciplinary research. Her training expertise includes efforts to spread high-performance computing participation in undergraduate education and research as well as efforts to increase the interest and participation of diverse populations in interdisciplinary studies. Taufer has served on numerous IEEE program committees (SC and IPDPS among others) and has reviewed for most of the leading journals in parallel computing. She served as the IEEE Cluster 2015 General co-Chair and the IEEE IPDPS 2017 General Chair. She is the ACM/IEEE SC19 General Chair. Research High Performance Computing Scientific Applications And Their Programmability On Multi-Core And Many-Core Platforms Numerical Reproducibility And Stability Of Multithreaded Applications Performance Analysis, Modeling, And Optimization Of Multi-Scale Applications Cloud Computing And Volunteer Computing Big Data Analytics And MapReduce Google Scholar The flagship campus of the University of Tennessee System and partner in the Tennessee Transfer Pathway.",
  "content_length": 2966,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:19"
}