{
  "name": "Michael Sheng",
  "homepage": "http://web.science.mq.edu.au/~qsheng",
  "status": "success",
  "content": "Prof. Quan Z. (Michael) Sheng's Home Page Distinguished Professor Michael Sheng School of Computing Faculty of Science and Engineering   Macquarie University Sydney, NSW 2109, Australia Office: Room 233, 4 Research Park Drive Email: michael[DOT]sheng[AT]mq[DOT]edu[DOT]au All things are difficult before they are easy, just do it! Please check out our exciting 2024 achievements. Dr. Michael Sheng is a Distinguished Professor and Head of School of Computing at Macquarie University. Before moving to Macquarie, Michael spent 10 years at School of Computer Science, the University of Adelaide (UoA), serving in a number of senior leadership roles including interim Head and Deputy Head of School of Computer Science. Michael holds a PhD degree in computer science from the University of New South Wales (UNSW) and did his post-doc as a research scientist at CSIRO ICT Centre. From 1999 to 2001, Michael worked at UNSW as a visiting research fellow. Prior to that, he spent 6 years as a senior software engineer in industries. Dr. Michael Sheng is ranked by Microsoft Academic as one of the Most Impactful Authors in Services Computing (ranked Top 5 All Time) and in Web of Things (ranked Top 20 All Time) in 2021. He is ranked as one of the Highly Ranked Scholars (Top 5 both Lifetime and Prior 5 Years) in Web Information System by ScholarGPS. He is the recipient of the 2018 AMiner Most Influential Scholar Award on IoT (2007-2017), ARC Future Fellowship (2014), Chris Wallace Award for Outstanding Research Contribution (2012), and Microsoft Research Fellowship (2003). Prof Michael Sheng is a member of the Advisory Committee of the IEEE Technical Community on Services Computing (IEEE TCSVC) and a member of the ACS Technical Advisory Board on IoT. He is a Deputy Director of the ARC Research Hub in the IoT for Water. Dr. Michael Sheng's research team, funding, publications, research profile and professional activities. Media 1 Distinguished Professors (This Week Macquarie University), Media 2 10 Questions with Michael Sheng (This Week Macquarie University), Media 3 on improvement of trustworthiness of online information (The Lighthouse), Media 4 on trust management research (ACM TechNews), Media 5 on smart cities (MQ News, Video). Media 5 on aging population research (The Australian). Main external profiles: Research Interests Internet of Things, Big Data Analytics, Machine Learning, Intelligent Computing, Web Science, Service Computing. Selected Publications   [More publications can be found from ] Harnessing Artificial Intelligence and Pervasive Internet of Things for an Empowered Aging. Quan Z. Sheng, Yao Liu, and Lina Yao. Springer, 2026 (to appear). Managing the Web of Things: Linking the Real World to the Web. Michael Sheng, Yongrui Qin, Lina Yao, and Boualem Benatallah (Eds.), Morgan Kaufmann, Elsevier, February 2017. Amazon US, Amazon Japan, Amazon UK Managing Data from Knowledge Bases: Querying and Extraction. Wei Emma Zhang and Quan Z. Sheng, Springer, July 2018. Amazon US, eBay, Amazon Japan Enabling Context-Aware Web Services: Methods, Architectures, and Technologies. Quan Z. Sheng, Jian Yu, Schahram Dustdar (Eds.), Chapman and Hall/CRC. February 2010. Amazon US, Amazon Japan, Amazon UK State of the Art and Potentialities of Graph-level Learning. Zhenyu Yang, Ge Zhang, Jia Wu, Jian Yang, Quan Z. Sheng, Shan Xue, Chuan Zhou, Charu Aggarwal, Hao Peng, Wenbin Hu, Edwin Hancock, and Pietro Lio. ACM Computing Surveys (CSUR), Vol 57, No 2, Article No 28, pp 1-40, 2025. [PDF] Deep Learning Meets Bibliometrics: A Survey of Citation Function Classification. Yang Zhang, Yufei Wang, Quan Z. Sheng, Lina Yao, Haihua Chen, Kai Wang, Adnan Mahmood, Wei Emma Zhang, Munazza Zaib, Subhash Sagar, and Rongying Zhao. Journal of Informetrics, Elsevier, Vol 19, Issue 1, Article 101608, 2025. [PDF] TROPICAL: Transformer-based Hypergraph Learning for Camouflaged Fraudster Detection. Venus Haghighi, Behnaz Soltani, Nasrin Shabani, Jia Wu, Yang Zhang, Lina Yao, Quan Z. Sheng, and Jian Yang. The 24th IEEE International Conference on Data Mining (ICDM 2024), Abu Dhabi, UAE, 9-12 December 2024. [PDF] Distractor Generation in Multiple-Choice Tasks: A Survey of Methods, Datasets, and Evaluation. Elaf Alhazmi, Quan Z. Sheng, Wei Emma Zhang, Munazza Zaib, and Ahoud Alhazmi. The 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024). Miami, Florida, USA, 12-16 Novemeber 2024. [PDF] A Comprehensive Survey on Graph Summarization with Graph Neural Networks. Nasrin Shabani, Jia Wu, Amin Beheshti, Quan Z. Sheng, Jin Foo, Venus Haghighi, Ambreen Hanif, and Maryam Shahabikargar. IEEE Transactions on Artificial Intelligence (TAI), Vol 58, No 8, pp 3780-3800, 2024. [PDF] A Comprehensive Survey on Graph Anomaly Detection with Deep Learning. Xiaoxiao Ma, Jia Wu, Shan Xue, Jian Yang, Chuan Zhou, Quan Z. Sheng, Hui Xiong, and Leman Akoglu. IEEE Transactions on Knowledge Discovery and Engineering (TKDE), Vol 35, No 12, pp11585-11598, 2023. [PDF] Multi-document Summarization via Deep Learning Techniques: A Survey. Congbo Ma, Wei Emma Zhang, Mingyu Guo, Hu Wang, and Quan Z. Sheng. ACM Computing Surveys (CSUR), Vol 55, No 5, Article No: 102, pp 1-37, 2023. [PDF] A Survey on Session-based Recommender Systems. Shoujin Wang, Longbing Cao, Yan Wang, Quan Z. Sheng, Mehmet A. Orgun, and Defu Lian. ACM Computing Surveys (CSUR), Vol 54, No 7, Article No: 154, 2022. [PDF] Swift and Sure: Hardness-aware Contrastive Learning for Low-dimensional Knowledge Graph Embeddings. Kai Wang, Yu Liu, and Quan Z. Sheng. The 31st Web Conference 2022 (TheWebConf 2022). Lyon, France, 25-29 April 2022. [PDF] MulDE: Multi-Teacher Knowledge Distillation for Low-Dimensional Knowledge Graph Embeddings. Kai Wang, Yu Liu, Qian Ma, and Quan Z. Sheng. The 30th Web Conference 2021 (TheWebConf 2021). Ljubljana, Slovenia, April 19-23, 2021. [PDF] An Internet of Things Service Roadmap. Athman Bouguettaya, Quan Z. Sheng, Boualem Benatallah, Azadeh Ghar-Neiat, Sajib Mistry, Aditya Ghose, Surya Nepal, and Lina Yao. Communications of the ACM (CACM), Vol 64, No 9, pp 86-95, 2021. [PDF] (Featured Cover Article) A Comprehensive Survey on Community Detection with Deep Learning. Xing Su, Shan Xue, Fanzhen Liu, Jia Wu, Jian Yang, Chuan Zhou, Wenbin Hu, Cecile Paris, Surya Nepal, Di Jin, Quan Z. Sheng, and Philip S. Yu. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), Vol 35, No 4, pp 4682-4702, 2024. [PDF] Deep Conversational Recommender Systems: Challenges and Opportunities. Dai Hoang Tran, Quan Z. Sheng, Wei Emma Zhang, Salma Abdalla Hamad, Nguyen Lu Dang Khoa, and Nguyen H. Tran. IEEE Computer, Vol 55, No 4, pp 30-39, 2022. [PDF] (Featured Cover Article) Design Architectures for Energy Harvesting in the Internet of Things. Sherali Zeadally, Faisal Karim Shaikh, Anum Talpur, and Quan Z. Sheng. Renewable & Sustainable Energy Reviews, Elsevier, Vol 128, Article 109901, 2020. [PDF] Understanding the Hierarchical Structural Evolution in a Scientific Discipline: A Case Study of Artificial Intelligence. Yue Qian, Yu Liu, and Quan Z. Sheng. Journal of Informetrics, Elsevier, Vol 14, Issue 3, Article 101047, 2020. [PDF] Adversarial Attacks on Deep Learning Models in Natural Language Processing: A Survey. Wei Emma Zhang, Quan Z. Sheng, Ahoud Alhazmi, and Chenliang Li. ACM Transactions on Intelligent Systems and Technology (TIST), Vol 11, No 3, p24, 2020. [PDF] (EiC's Pick as Five Outstanding TIST Articles in Jan 2022) Internet of Things Search Engine. Nguyen Khoi Tran, Quan Z. Sheng, M. Ali Babar, Lina Yao, Wei Emma Zhang, and Schahram Dustdar. Communications of the ACM (CACM), Vol 62, No 7, pp 66-73, 2019. [PDF] [Video] (Featured Cover Article) Searching the Web of Things: State of the Art, Challenges and Solutions. Nguyen Khoi Tran, Quan Z. Sheng, M. Ali Babar, and Lina Yao. ACM Computing Surveys (CSUR), Vol 50, No 4, p55, 2017. [PDF] A Service Computing Manifesto: The Next 10 Years. Athman Bouguettaya, Munindar Singh, Michael Huhns, Quan Z. Sheng, Hai Dong, Qi Yu, Azadeh Ghari-Neiat, Sajib Mistry, Boualem Benatallah, Brahim Medjahed, Mourad Ouzzani, Fabio Casati, Xumin Liu, Hongbing Wang, Dimitrios Georgakopoulos, Liang Chen, Surya Nepal, Zaki Malik, Abdelkarim Erradi, Yan Wang, Brian Blake, Schahram Dustdar, Frank Leymann, and Mike Papazoglou. Communications of the ACM (CACM), Vol 60, No 4, pp 64-72, 2017. [PDF] (Featured Cover Article) Things of Interest Recommendation by Leveraging Heterogeneous Relations in the Internet of Things. Lina Yao, Quan Z. Sheng, Anne H.H. Ngu, and Xue Li. ACM Transactions on Internet Technology (TOIT), Vol 16, No 2, p9, 2016. [PDF] Web-based Management of the Internet of Things. Lina Yao, Quan Z. Sheng, and Schahram Dustdar. IEEE Internet Computing, Vol 19, No 4, pp 60-67, July/August, 2015. \t[PDF] Web Services Composition: A Decade's Overview. Quan Z. Sheng, Xiaoqiang Qiao, Athanasios V. Vasilakos, Claudia Szabo, Scott Bourne, and Xiaofei Xu. Information Sciences, Vol 280, pp 218-238, October 2014. [PDF] Trust Management of Services in Cloud Environments: Obstacles and Solutions. Talal H. Noor, Quan Z. Sheng, Sherali Zeadally, and Jian Yu. ACM Computing Surveys, Vol 46, No 1, p 12, 2013. [PDF] Semantic-based Mashup of Composite Applications. Anne H.H. Ngu, Michael P. Carlson, Quan Z. Sheng, and Hye-young Paik. IEEE Transactions on Services Computing (TSC), Vol 3, No 1, pp 2-15. January-March 2010. [PDF] Configurable Composition and Adaptive Provisioning of Web Services. Quan Z. Sheng, Boualem Benatallah, Zakaria Maamar, Anne H.H. Ngu. IEEE Transactions on Services Computing (TSC), Vol 2 No 1. pp 34-49. January-March 2009 [PDF]. RFID Infrastructure Design: A Case Study of Two Australian RFID Projects. John P.T. Mo, Quan Z. Sheng, Xue Li, Sherali Zeadally. IEEE Internet Computing, Vol 13 No 1. pp 14-21. Jan/Feb 2009. [PDF] Enabling Next-Generation RFID Applications: Solutions and Challenges. Quan Z. Sheng, Xue Li, Sherali Zeadally. IEEE Computer, Vol 4",
  "content_length": 12088,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:59"
}