{
  "name": "Michael Buro",
  "homepage": "https://skatgame.net/mburo",
  "status": "success",
  "content": "Michael Buro's Homepage Michael Buro Contact Fields of Interest Teaching/Students Publications Quotes Research/Thesis Topics CV Short Bio I am currently not looking for new graduate students. So, please don't send me your application - it will be ignored. Some stuff I found interesting throughout the years Disclaimer: follow links below at your own discretion as some of the material is controversial or might not align with your views. Also, I am not neccessarily sharing views presented here Hans Berliner on AI trends (IEEE Intelligent Systems, Jan/Feb-2000): \"I consider the most important trend was that computers got considerably faster in these last 50 years. In this process, we found that many things for which we had at best anthropomorphic solutions, which in many cases failed to capture the real gist of a human's method, could be done by more brute-forcish methods that merely enumerated until a satisfactory solution was found. If this is heresy, so be it.\" Jonathan Haidt on confirmation bias in \"Why the Past 10 Years of American Life Have Been Uniquely Stupid\" (The Atlantic, 2022): \"People who think differently and are willing to speak up if they disagree with you make you smarter, almost as if they are extensions of your own brain. People who try to silence or intimidate their critics make themselves stupider, almost as if they are shooting darts into their own brain.\" [2010] xkcd describes my work area [2011] Measuring code quality [2012] Is voting weakening America? (Good Magazine) [2012] FAQ related to Carl Sagan's \"Extraordinary claims require extraordinary evidence\" [2012] Age of ignorance (from The New York Review) [2012] Leave your cellphone at home ... (nplusonemag.com) [2012] NICE logic puzzle: identify gods, and as a bonus, make their heads explode! [2012] Another nice problem (meant to be be solved by 14 year old top 40% math students in Singapore) [2013] Did the bomb or Stalin defeat Japan? (foreignpolicy.com) [2013] Neil deGrasse Tyson on intelligent design (youtube.com) [2013] Why tough teachers get good results (Wall Street Journal) [2014] Neil deGrasse Tyson's fascinatingly disturbing thought (youtube) [2015] jesuischarlie The New Yorker's response ... [2015] Can virtual reality be real? -- Fast forward to: Incredible! (youtube.com) [2015] How many colors do you see in the image? 4? Actually there are only 3! Check the RGB values [2015] Jim Jefferies on guns in the U.S (youtube.com) [2016] Winter is coming! Are HBO lawyers losing it? (The Register) [2017] Proof that P. Ryan doesn't understand how insurance works (twitter.com) [2017] Google Echo Chamber Memo Wikipedia Entry Bosten Globe Comment WIRED Comment [2018] Jordan B. Peterson's Channel-4 interview on equality of outcome vs. equality of opportunity [2022] About Academic Freedom in Canada (C2C Journal) [2023] An analysis of the impact of social media by Jonathan Haidt: Why the past 10 years of American life have been uniquely stupid (The Atlantic paywalled? Google haidt stupid pdf) [2023] Sabine Hossenfelder on fake news, echo chambers, and polarization (youtube.com) [2023] The Free Press article on the effects of DEI on American universities [2023] Journal article \"In Defense of Merit in Science\" [2023] Sabine Hossenfelder on why we don't have free will News Jan. 31, 2023: more link updates Jan. 18, 2023: updated graduate student application status and added/updated links Mar. 25, 2021: updated my M.Sc. Project List (2021-2022) Jan. 6, 2021: updated my M.Sc. Project List (2021-2022) Mar. 24, 2020: updated my M.Sc. Project List (2020-2021) Nov. 27, 2019: updated my CMPUT 603 presentation (see below) Aug. 3, 2019: We are having fun with our new FOLDING-FAT-TIRE-E-BIKES! Jan. 8, 2019: new CMPUT 605 individual study grad course on heuristic search applied to games. There is still time to enrol! Nov. 7, 2018: updated my CMPUT 603 presentation (see below) Aug. 21, 2018: new CMPUT 605 individual study grad course on Game AI Jul. 29, 2018: CPCC2018 presentation slides Dec. 4, 2017: updated my CMPUT 603 presentation (see below) Nov.21, 2016: updated my CMPUT 603 presentation (see below) Jul.14, 2016: upcoming course list updated (see below) May.23, 2016: new SkatGame app released. You can now play against some of the World's strongest Skat programs (kermit, zoot, theCount) on Android / IOS / PC ! Nov.9, 2015: added my M.Sc. Project List 2015-2016 May.15, 2015: added AIIDE-15 workshop CFP Nov.20, 2014: updated my CMPUT 603 presentation (see below) May.9, 2014: added AIIDE-14 workshop CFP Oct.20, 2012: released Jox, a HTPC command center for Linux Oct.16, 2012: released ORTS-lite, an abstract RTS game simulator and tournament environment written in C++ (see below) Jul.26, 2012: added Webbels, a Blubbels clone written in HTML5. Also avaiable in Google Play. Apr.30, 2012: added AIIDE-12 workshop CFP Nov.18 2011: added CMPUT 603 slides (see below) Feb.4 2011: 2nd Starcraft AI Competition homepage added July 2010: moved webpage to skatgame.net July 2009: IJCAI paper on Kermit - the best Skat playing program in the world! Oct.30 2007: On Mondays at 14:00 MST there will be skat players on ISS. Please join us! Everybody is welcome. Oct.29 2007: Interested in learning a good card game? Join us to play skat Wednesdays from 12:30 to 14:00 in the SUB food court seating area. Everybody is welcome! Oct.16 2007: The International Skat Server is on-line. June.20 2007: GGS moved to bodo1.cs.ualberta.ca June.2 2007: 2007 RTS AI competition results available. Aug. 2006: The applet for GGSA has been revamped. We are looking for developers for new GGS game services. June. 2006: The UofA team has won one of three RTS game AI tournaments. Jan. 2006: Interested in RTS games? -> CMPUT605: Individual Study: Topics in RTS Games Nov. 2005: Upcoming ORTS RTS game AI competition Nov. 2005: For sale: new universal flat wall mount for screens up to 50 inch @ CampusAuctionMarket.com Nov. 2005: 605 course advertisement Oct. 2005: Winter 2006 605 course on RTS Game Topics Sep. 2005: 673 course on Computational Complexity Theory Sep. 2005: 605 course on RTS Game Topics Sep. 2005: We are planning an RTS game AI competition EBIKES780.COM We used to import and sell ebikes in Edmonton. Here is the archived ebikes780.com webpage Computer Skat Our program Kermit is currently the best Skat program in the world! It plays on ISS - the international skat server. skatgame.net: A website devoted to playing Skat worldwide. Advancing Real-Time Strategy Game AI 2014 AIIDE StarCraft AI Competition 2012,2013 AIIDE StarCraft AI Competition 2011 AIIDE StarCraft AI Competition ORTS: A free software Real-Time-Strategy Game Engine ORTS-lite: An abstract RTS game simulator and tournament environment written in C++. Requires SDL and Boost. Licensed under GPLv3. 2009 RTS Game AI Competition There will be an ORTS competition in August 2009. It will feature the same games as last year. Details ... 2008 RTS Game AI Competition 2007 RTS Game AI Competition Computer Othello Logistello - a strong Othello program. (last update: November/2/2002, Logistello source available!) Tominaga vs. Logistello (last update: May/14/2002, Logistello won the two games) Logistello gets lucky and wins the December 2002 GGS tournament Generic Game Server (GGS) Miscellaneous Jox: An HTPC command center and mp3 jukebox for Linux. Communicates with LIRC, VFD, panel buttons, and receivers/monitors (via RS-232). Jox can be controlled through a web-interface. Play Webbels in your browser! Java better than C++? Read this Matrix game LP solver (C++) : lp.tgz (last update: Dec/17/2003, initial release) McCreight's Radix Priority Search Trees (C++): PS_Tree.H Global.H (last update: Feb/21/2002, initial release) PROCMAIL SPAM BUSTER - kills all spam dead, guaranteed :-) (last update: Aug/4/2003, fixed security hole: / in email address allowed to overwrite any files) openc++ 2.5.12 for gcc-3.0.3 (last update: Jan/16/2002, initial release) bprof+scripts (last update: July/23/2003, initial release) bprof is a C/C++ profiler that generates line-by-line timing information. Triangulation Based Pathfinding Software published with AI-Wisdom 4 chapter \"Fast Pathfinding Based on Triangulation Abstractions\" by Doug Demyen and Michael Buro (2008). TA* is implemented in ./DCDT/se/src/se/Search.cpp last modified on ; you are visitor # since Dec/9/1995",
  "content_length": 8367,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:45"
}