{
  "name": "Michael Ian Shamos",
  "homepage": "http://euro.ecom.cmu.edu/shamos.html",
  "status": "success",
  "content": "Home Page of Michael Shamos Michael I. Shamos Distinguished Career Professor Language Technologies Institute and Software and Societal Systems Department School of Computer Science Carnegie Mellon University View resume in pdf Phone: 412-681-8398 Fax: 412-268-6298 Email: shamos@cs.cmu.edu Office: 6401 Gates-Hillman Complex Carnegie Mellon University 5000 Forbes Avenue Pittsburgh, PA 15213 Secretary: Not really Bio 08-732/08-532Fall 2010 Law of Computer Technology (Computers, Organizations and Society program) 96-761Fall 2010Ubiquitous Computing (MSIT eBusiness Technology program) 96-774Spring 2011Electronic Payment Systems (MSIT eBusiness Technology program) » All Courses Expert Witness Electronic Voting Non-Academic Family Biography Michael Shamos is Distinguished Career Professor in the School of Computer Science at Carnegie Mellon University and Director of the M.S. in Artificial Intelligence and Innovation in the Language Technologies Institute. He will be directing the M.S. in Biotechnology, Innovation and Computation (MSBIC) program in 2018-2019 and the M.S. in Artificial Intelligence and Innovation (MSAII) program from 2018 onward. He was Director of the MSIT eBusiness Technology Program from its inception in 2004 until its termination in 2018 and is a Director of the Universal Library. He obtained an A.B. in Physics from Princeton under John Wheeler in 1968, then worked as a programmer in IBM's Components Division, simultaneously earning an M.A. in Physics from Vassar College in 1970. From 1970-1972 he served as a commissioned officer in the U.S Public Health Service as a Supervisory Programmer at the National Cancer Institute in Bethesda, Maryland, earning an M.S. degree in Technology of Management from American University. Dr. Shamos enrolled in Yale University's Department of Computer Science as a member of its second entering class in 1972, earning an M.S. in 1973 and an M. Phil. in 1974. For his thesis work he developed fundamental algorithms in Computational Geometry with Dan Hoey. He was the author with Franco Preparata of \"Computational Geometry: An Introduction,\" the first book in the field. In 1975, Dr. Shamos was hired as an Assistant Professor in the Computer Science and Mathematics departments at Carnegie Mellon. He was named \"czar\" of CMU's introductory programming courses and taught a graduate course in analysis of algorithms. In 1978 he received the Ph.D. from Yale and also joined the CMU Department of Statistics. In 1979, he formed Unilogic, Ltd. to commercialize Scribe, a document production system written by Brian Reid, who was then a graduate student at CMU. In 1981, after earning a law degree at Duquesne University, he requested adjunct faculty status at CMU to work full-time for Unilogic. In 1984, Unilogic spun out Lexeme Corporation, formed to develop automated tools for source language translation. The assets of Unilogic were sold in 1987 and Dr. Shamos spent the next three years largely studying billiard history, ultimately publishing several books on the subject. Since 1988 he has been a Contributing Editor of Billiards Digest magazine. More details can be found here. In 1990, Dr. Shamos joined the Webb Law Firm, the largest intellectual property firm in Pittsburgh. He spent eight years involved in all phases of intellectual property, prosecuting patent applications and litigating trademark and copyright cases. In 1998, he returned to CMU as Principal Systems Scientist to serve as a Directory of the Universal Library, a book scanning project that has now sponsored the scanning of more than 1.5 million books. At that time, he held a joint appointment in the Language Technologies Institute and the Tepper School of Business, teaching analysis of algorithms and intellectual property law. In 1999, he was named Co-Director of the Institute for eCommerce, a joint venture between the School of Computer Science and Tepper, teaching eCommerce Technology, Electronic Payment Systems and Internet Law as part of the Master of Science in Electronic Commerce (MSEC). In 2001, Dr. Shamos was named Distinguished Career Professor. He was then asked to work on the development of a technology version of the MSEC degree using the story-centered curriculum concept pioneered by Roger Schank. Dr. Shamos directed the MSIT in eBusiness Technology from 2002-2018. He is now Director of the M.S. in Artificial Intelligence and Innovation. Since 2001, he has been Visiting Professor in the Department of Computer Science at the University of Hong Kong, where he teaches Electronic Payment Systems each year. From 1980-2004 and then again from 2004-2010, Dr. Shamos has served as statutory examiner of computerized voting system for the Secretary of the Commonwealth of Pennsylvania. From 2010 to the present, he has served as an expert witness on behalf of the Commonwealth of Pennsylvania in alectornic voting matters. He has also inspected voting systems for West Virginia, Nevada, Delaware, Texas and Massachusetts, eventually participating in over 120 examinations. He has testified on several occasions before the U.S. Congress and state legislatures concerning electronic voting. In 2004, he designed and taught a course at CMU entitled \"Electronic Voting.\" See the electronic voting section. Dr. Shamos has served as an expert witness in more than 360 cases involving computer technology. See the full list. Research Interests eBusiness technology, artificial intelligence, electronic voting, graph models of financial systems, experimental mathematics. Education A.B. (1968) Princeton University (Physics).   Thesis: \"Gravitational Radiation Reaction\".  Applies the principles of Wheeler-Feynman electrodynamics to a tensor field as opposed to a vector field. Advisor: John A. Wheeler. M.A. (1970) Vassar College (Physics).   Thesis: \"An Absorber Theory of Acoustical Radiation.\"  Applies the principles of Wheeler-Feynman electrodynamics to a scalar field as opposed to a vector field. Advisor: Morton A. Tavel. M.S. (1972) American University (Technology of Management). Technology of management covers quantitative tools used in manging organizations, such as statistics, operations research and cost-benefit analysis. M.S.  (1973) Yale University (Computer Science). M.Phil. (1974) Yale University (Computer Science). Ph.D. (1978) Yale University (Computer Science).   Thesis: \"Computational Geometry\".  Analysis of the complexity of fundamental geometric algorithms such as area computation, sweep-line algorithms, polygon intersection, Voronoi diagram construction, and minimum spanning tree. Thesis committee: David Dobkin, Martin H. Schultz, Stanley C. Eisenstat. J.D. (1981) Duquesne University, cum laude. Academic Experience Distinguished Career Professor, Institute for Software Research and Language Technologies Institute, School of Computer Science, Carnegie Mellon University (2001- ). Principal Systems Scientist (1998-2001).  Principal Lecturer (2002-2003).  Teaching Professor (2003- ).  Faculty, Tepper School of Business, Carnegie Mellon University (1999-2004). Director, M.S. in Artifical Intelligence and Innovation (2018-). Director, M.S. in Biotechnology, Innovation and Computation (2018-2019). Director, M.S.I.T in eBusiness Technology (2002-2018). Co-Director, Carnegie Mellon Institute for eCommerce (1998-2004).  Vice-Chair, University Research Council (2000-2002). Core Faculty, CMU Privacy Engineering degree program (2013-). Director, Universal Library, Carnegie Mellon University (1998-). Visiting Professor, Department of Computer Science, The University of Hong Kong (2001- ). Adjunct Faculty, Carnegie Mellon University, Department of Computer Science (1981-1998). Formerly Assistant Professor, Carnegie Mellon University, Departments of Computer Science and Mathematics (1975-81), Dept. of Statistics (1978-81). Teaching assistant, Yale University Department of Computer Science (1972-1975). Teaching Assistant, Vassar College Department of Physics (1969-1970). Scientific Publications Google Scholar citations. Books 1. Computational Geometry: An Introduction, with Franco P. Preparata.  Springer-Verlag (1985, revised ed., 1991), 390 pp.  ISBN 0387961313. 2. Вычислительная геометрия: введение.  Russian translation of \"Computational Geometry: An Introduction.\" Moscow: Mir Publishers (1989).  ISBN 5030010416. 3. Keisan kikagaku nyumon. Japanese translation by T. Asano and T. Asano of Computational Geometry: An Introduction, with F. P. Preparata.   Soken Shuppan (Jul. 1992).  ISBN 4795263213. 4. Handbook of Academic Titles.  198 pp. (Nov. 2002).  An encyclopedia of various academic designations used at over 1000 colleges and universities in the United States. 5. Geometria obliczeniowa.  Wprowadzenie. Polish translation of \"Computational Geometry: An Introduction.\" Warsaw: Helion (2003) 392 pp.  ISBN 8373610987. 6. Shamos's Catalog of the Real Numbers. 700 pp. (2011). Book Chapters 1. \"The Universal Digital Library: Intelligent Agents and Information on Demand,\" with Raj Reddy.   Chapter 6 in Emerging Communication Technologies and the Society, by N. Balakrishnan, Indian National Science Academy (2000).  ISBN 81-7319-341-X. 2. \"Privacy and Public Records.\" Chapter 16 in Personal Information Management, Jones & Teevan, eds., Univ. of Washington Press (2007), ISBN978-0-295-98737-8. Articles 1. \"On the Piezoelectric Effect in Bone,\" with M. H. Shamos and L. S. Lavine.  Nature 197:81 (1963). 2. \"An Absorber Theory of Acoustical Radiation,\" with M. A. Tavel. Journal of the Acoustical Society of America 54:46–49 (1973). 3. \"Problems in Computational Geometry.\" Unpublished book manuscript (1974, revised 1977). Distributed in photocopy. 4. \"Geometric Complexity.\" Proceedings of the Seventh Annual ACM Symposium on Automata and Theory of Computation (May 1975) 224–233. 5. \"Closest-point Problems,\" with D. J. Hoey. Proceedings of the Sixteenth IEEE Symposium on Foundations of Computer Science (Oct. 1975) 151–162. 6. \"Divide and Conquer in Multidime",
  "content_length": 25727,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:17"
}