{
  "name": "Michael Wybrow",
  "homepage": "https://research.monash.edu/en/persons/michael-wybrow",
  "status": "success",
  "content": "Michael Wybrow - Monash University Michael Wybrow public CV View Scopus Profile Michael Wybrow Assoc Professor Associate Professor, Department of Human Centred Computing https://orcid.org/0000-0001-5536-7780 EmailMichael.Wybrowmonashedu Accepting PhD StudentsPhD projectshttps://supervisorconnect.it.monash.edu/ 20032025 Research activity per year Personal profile Research interestsVisual interfaces for human interaction with complex systems and AI Decision-making is increasingly done by humans using optimisation, AI systems or leveraging data produced and collected by businesses. Frequently, such systems are “black-boxes” that produce results without showing how a solution was arrived at. There is a need to understand the quality of solutions, differences or similarities between solutions and the main factors that led to that solution. Additionally, humans can often provide useful insights such as weights or constraints that can inform the search and lead to better solutions through user-guidance. I use interactive visualisation and interface design to address these issues. My active research projects involve user-guided crew allocation and control room analysis for the energy industry, visualisations to explain and prevent reasoning fallacies in Bayesian Network diagrams, dashboards for monitoring care quality hospitals using Electronic Medical Record (EMR) data, and creation of a digital maths notebook for blind and low vision school students. I am also beginning to do research in the area of neurodiversity.BiographyA/Prof. Michael Wybrow received his Phd in October 2008. His PhD thesis “Using semi-automatic layout to improve the usability of diagramming software” was awarded the CORE Association’s award for the best Australasian Computer Science thesis of 2008. Following his PhD, A/Prof. Wybrow worked as a research fellow from 2009–2010 at Monash University. In 2009, A/Prof. Wybrow received the Monash Vice-Chancellor’s commendation for doctoral thesis excellence. In 2010, A/Prof. Wybrow spent 6 months sponsored by a German company to research orthogonal connector routing techniques and extend his libavoid connector routing software library. From 2011 till mid 2014, A/Prof. Wybrow held an ARC Discovery Project that gave him an Australian Postdoctoral Fellow to work on “Flexible User-Guided Network Layout for Biomedical Applications” ($261,200). In 2013, A/Prof. Wybrow received the 2013 Faculty of IT Dean’s Award for Excellence in Research by Early Career Researchers.  Between 2012 and 2015 A/Prof. Wybrow worked for nearly 3 years part-time following the birth of his daughter. During that time, while A/Prof. Wybrow was research-only, his software contributions resulted in considerable industry interest and he was variously involved with software licensing and commercial research collaborations totalling over $100k. After beginning a Lecturer (teaching and research) position with the Faculty of Information Technology at Monash University in mid 2014, A/Prof. Wybrow was tasked with creating a new first-year course, ENG1003, an ambitious IT literacy, app programming and introduction to Software Engineering unit that would be taught to the Engineering first-year in Clayton and Malaysia from Semester 1 2015 onwards. ENG1003 was an important Faculty priority, with 1,300 local students per year, and additionally delivered in Malaysia and Monash College. A/Prof. Wybrow’s responsibilities as designer, lecturer and Chief Examiner of ENG1003 required education to be his primary focus for the first two years after his appointment. Despite this heavy teaching commitment, A/Prof. Wybrow maintained the high-quality research, including a best paper award at IEEE InfoVis 2015. From 2016–2025 A/Prof. Wybrow has led the Visualisation half of an industry project on various Optimisation+Visualisation research projects with Woodside Energy, Australia’s largest operator of oil and gas production. During this time, he has worked on Optimal Chemical Process Plant Layout, Hydrogen Production Location Optimisation, and Optimal Crew Allocation and Scheduling.  These projects have been worth more than $5M with a team of 3–4 research fellows and programmers working on them. From 2019–2024, A/Prof. Wybrow was the Faculty of Information Technology’s inaugural Director of Work Integrated Learning.  In this role, he grew and diversified the prestigious Industry-Based Learning (IBL) placement program—including maintaining it through the COVID-19 years—oversaw the Industry Experience (IE) capstone studio project units, and brought the Monash Student Teams Initiative to the faculty, setting up the 6 IT-focused Student Teams, 4 of which continue to grow and thrive. Since mid 2025 A/Prof Wybrow has been the Faculty of Information Technology’s Associate Dean (Engagement and Impact).  In this role he oversees Engagement and Impact activities and initiatives across research and education. A/Prof. Michael Wybrow is known for his research on high-quality connector routing for diagrams, for interactive constraint-based network layout and for explainability of constraint-based optimisation systems. His research is very practical, and software arising from the research is widely used in academia and industry. A/Prof. Wybrow has had several industry-funded projects and has attracted over $10M in combined competitive grants and industry funding. Further recognition of his standing in the research community are frequent invitations to serve as a reviewer for top international conferences and journals, and seven invitations to attend prestigious workshops at Schloss Dagstuhl. He frequently serves on the program committee for IEEE VIS, the premier visualisation conference in the field, and was responsible for bringing the international conference to Melbourne, Australia in 2023.Monash teaching commitmentA/Prof. Michael Wybrow has experience as the Lecturer and Chief Examiner for the following units: ENG1003 Engineering mobile appsFIT3027 Android and iOS developmentFIT4039 Android and iOS developmentFIT3178 iOS app development Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Monash UniversityAward Date: 16 Oct 2008Computer Science, Bachelor of Computer Science (Honours), University of MelbourneAward Date: 16 Apr 2003 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2009 2012 2014 2020 2028 1 Active 11 Finished Projects per year Accessible Mathematics for Students: Accessible Mathematics for Students who are Blind or have Low VisionMarriott, K. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Fanshawe, M. (Chief Investigator (CI)), Wybrow, M. (Chief Investigator (CI)), Hayman, S. (Partner Investigator (PI)), Rodda, M. (Partner Investigator (PI)) & Jardine, A. (Partner Investigator (PI))ARC - Australian Research Council29/09/25 → 28/09/28Project: Research Actionable data for clinicians and external accreditors in support of quality care provision and continuous accreditation.Wybrow, M. (Primary Chief Investigator (PCI)), Taniar, D. (Chief Investigator (CI)), Davis, I. (Chief Investigator (CI)), Kokai, Z. (Partner Investigator (PI)), Luxford, K. (Partner Investigator (PI)) & Board, N. (Partner Investigator (PI))Monash University – Internal Faculty Contribution1/04/21 → 31/03/25Project: Research Improving human reasoning with causal Bayes networks: a multimodal approachNicholson, A. (Primary Chief Investigator (PCI)), Wybrow, M. (Chief Investigator (CI)), Zukerman, I. (Chief Investigator (CI)), Lagnado, D. (Chief Investigator (CI)) & Hahn, U. (Chief Investigator (CI))1/12/20 → 2/12/24Project: Research AIDE: Ambulance Vic - BCV Innovation Fund - Artificial Intelligence in carDiac arrEst (AIDE)Smith, K. (Primary Chief Investigator (PCI)), Nicholson, A. (Chief Investigator (CI)), Cohen, P. (Chief Investigator (CI)), Turhan, B. (Chief Investigator (CI)), Buntine, W. (Chief Investigator (CI)), Wybrow, M. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)) & Goodwin, S. (Chief Investigator (CI))Department of Health (DH) (Victoria)20/03/20 → 31/12/21Project: Research Layout study of a CO2 plant using the PLO FrameworkGarcia De La Banda Garcia, M. (Primary Chief Investigator (PCI)), Wybrow, M. (Chief Investigator (CI)), Czauderna, T. (Chief Investigator (CI)), Klapperstueck, M. (Chief Investigator (CI)), Senthooran, I. (Chief Investigator (CI)) & Belov, G. (Chief Investigator (CI))3/02/20 → 14/02/20Project: Research View all 12 projects Research output Research output per year 2003 2009 2013 2014 2021 2022 2023 2024 2025 37 Conference Paper 19 Article 2 Chapter (Book) 1 Foreword / Postscript 1 More 1 Review Article Research output per year Research output per year Streamlining Eye-Tracking and Observational Data for Field Study Visual AnalysisZhang, Y., Athukorala, N., Liang, Z., Qiao, Y., Simran, Yio, Y. X., Lawrence, L., Tag, B., Vered, M., Wybrow, M. & Goodwin, S., 2025, Proceedings, ETRA 2025 - ACM Symposium on Eye Tracking Research and Applications. Spencer, S. N. (ed.). New York NY USA: Association for Computing Machinery (ACM), 9 p. 98Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Open AccessFile TableCanoniser: interactive grammar-powered transformation of messy, non-relational tables to canonical tablesXiong, K., Huang, C. A., Wybrow, M. & Wu, Y., 2025, CHI 2025 - Pro",
  "content_length": 12809,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:06"
}