{
  "name": "Michel R. Dagenais",
  "homepage": "https://www.polymtl.ca/expertises/en/dagenais-michel",
  "status": "success",
  "content": "Dagenais, Michel | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Dagenais, Michel Poly Directory Courses Français Directory of Experts Dagenais, Michel Directory of Experts Back to search results Edit my profileHelp Publications Link(s) Michel Dagenais B.Ing. (Poly), Ph.D. (McGill) Publications Link(s) Adjunct Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 4029 Fax: (514) 340-5139 Room: M-3426 michel.dagenais@polymtl.ca Areas of expertise Computer hardware Distributed and parallel processing Software and development Algorithms Computer architecture and design Computer systems software Primary sphere of excellence in research New Frontiers in Information and Communication Technologies Secondary sphere(s) of excellence in research Industry of the Future and Digital Society Research interests and affiliations Research interests Distributed and heterogeneous multicore systems Cloud Computing and virtualisation Performance analysis tools Tracing Linux Free and Open Source Software The main objective of our research group is helping designers and operators of parallel and distributed computer systems to better understand the behavior and performance of their applications. For instance, a request for information (e.g., weather, banking, video, social media) issued from your laptop computer will reach several servers from the information provider through different networks and switches. Moreover, the same request issued soon after may go through other networks and switches and be served by different computers. If the performance obtained is unsatisfactory, how can one understand the behavior and diagnose the problem? Because of the decreasing costs of electronics components, computer systems now contain a large number of processing units that operate in parallel. Large data centers act as server farms for several corporations. Each service for a company may execute in parallel on several computers, when the demand is high. Conversely, each computer may execute tasks for several companies in parallel when the demand is lower. This hazy connection between specific services and specific computers has inspired the term Cloud Computing. On each computer we typically have between 4 and 64 processors (cores), operating in parallel within the central processing unit. Furthermore, a specialised co-processor for graphics, used for other computations as well, is typically available and contains up to 4096 computing cores operating in parallel. Understanding the performance in this context becomes particularly difficult. We are therefore developing, in collaboration with industry, free software tracing, profiling and debugging tools for distributed parallel applications. Those tools collect informations about all the important events occurring during the execution of requests. These informations are then analysed in order to compute how the time is spent among the different functions within the software and the execution units in the hardware, to show histograms comparing the different requests, to compute the critical path, and to identify bottlenecks. Affiliation(s) Distributed open reliable systems analysis lab (DORSAL), Head Expertise type(s) (NSERC subjects) 2701 Computer hardware 2704 Distributed and parallel processing 2705 Software and development 2713 Algorithms 2719 Computer architecture and design 2720 Computer systems software Publications Recent publications Conference paper Ekhlasi, M., Prakash, A., Lamothe, M., & Dagenais, M. (2025, April). InsightAI: Root Cause Analysis in Large Log Files with Private Data Using Large Language Model [Paper]. 4th International Conference on AI Engineering – Software Engineering for AI (CAIN 2025), Ottawa, ON, Canada. Conference paper Nourollahi, M., Haghshenas, A., & Dagenais, M. (2025, May). TraceLens: Early Detection of Software Anomalies Using Critical Path Analysis [Paper]. 16th ACM/SPEC International Conference on Performance Engineering (ICPE 2025), Toronto, ON, Canada. Journal article Belkhiri, A., & Dagenais, M. (2024). Analyzing GPU Performance in Virtualized Environments: A Case Study. Future Internet, 16(3), 72 (18 pages). Conference paper Haghshenas, A., Ezzati-Jivan, N., & Dagenais, M. (2024, May). Automatic reduction of execution trace data volume using gradient boosting in large-scale microservice systems [Paper]. 37th Canadian Conference on Artificial Intelligence (Canadian AI 2024), Guelph, ON, Canada (12 pages). See all publications (184) Biography Link(s) of interest Distributed Open Reliable Systems Analysis Laboratory Project LTTng: Linux Trace Toolkit next generation FabLab PolyFab Normand Brais Teaching Current courses: Parallel Computing (OpenMP, OpenCL, MPI), INF8601 Distributed Systems and Cloud Computing, INF8480 Past participation in courses: Computer Architecture Algorithmic Aspects of Computer Engineering Advanced Computer Graphics Object Oriented Paradigm Operating Systems First year project in Computer and Software Engineering Introduction to Computer Engineering How to succeed in a PhD Teaching awards: 1988-1989: First prize as professor in Computer Engineering, Gala Méritas of AEP (Polytechnique Student Association) 1996-1997: First prize as professor in Computer Engineering, Gala Méritas of AEP 2003-2004: First prize as professor in Computer Engineering, Gala Méritas of AEP 2013-2014: First prize as professor or lecturer in Computer and Software Engineering, Gala Méritas of AEP 2017-2018: First prize as professor for graduate courses in Computer and Software Engineering, Gala Méritas of AEP 2020-2021: First prize as professor in Computer and Software Engineering, Gala Méritas of AEP Supervision at Polytechnique COMPLETED Ph.D. Thesis (19) Darche, S. (2025). Profiling and Tracing Tools for General-Purpose Computing on Graphics Processing Units (GPGPU) [Ph.D. thesis, Polytechnique Montréal]. Ekhlasi, M. (2025). Diagnostic automatisé des performances dans les systèmes distribués à l'aide de traces, de métriques système et de modèles de langage de grande taille [Ph.D. thesis, Polytechnique Montréal]. Denys, P.-F. (2023). Distributed Performance Analysis Tools for Large Scale Computations [Ph.D. thesis, Polytechnique Montréal]. Kabamba, H. M. (2023). Approches intégrées d'analyse de performance des systèmes distribués asynchrones par trace d'exécution système [Ph.D. thesis, Polytechnique Montréal]. Kohyarnejadfard, I. (2022). System Performance Anomaly Detection using Tracing Data Analysis [Ph.D. thesis, Polytechnique Montréal]. Muller Rodrigues, I. (2022). Algorithms and Learning Models for Bug Report Deduplication [Ph.D. thesis, Polytechnique Montréal]. Belkhiri, A. (2021). Analyse de performances des réseaux programmables, à partir d'une trace d'exécution [Ph.D. thesis, Polytechnique Montréal]. Daoud, H. (2019). Analyse des performances de stockage, en mémoire et sur les périphériques d'entrée/sortie, à partir d'une trace d'exécution [Ph.D. thesis, Polytechnique Montréal]. Nemati, H. (2019). Virtual Machine Flow Analysis Using Host Kernel Tracing [Ph.D. thesis, Polytechnique Montréal]. Abusitta, A. (2018). Theoretical and Applied Foundations for Intrusion Detection in Single and Federated Clouds [Ph.D. thesis, École Polytechnique de Montréal]. Sharma, S. D. (2017). Low-Impact System Performance Analysis Using Hardware Assisted Tracing Techniques [Ph.D. thesis, École Polytechnique de Montréal]. Beamonte, R. (2016). Runtime Verification of Real-Time Applications Using Trace Data and Model Requirements [Ph.D. thesis, École Polytechnique de Montréal]. Desfossez, J. (2016). Mesure et analyse de latences dans les systèmes parallèles en temps réel [Ph.D. thesis, École Polytechnique de Montréal]. Giraldeau, F. (2015). Analyse de performance de systèmes distribués et hétérogènes à l'aide de traçage noyau [Ph.D. thesis, École Polytechnique de Montréal]. Ezzati Jivan, N. (2014). Multi-Level Trace Abstraction, Linking and Display [Ph.D. thesis, École Polytechnique de Montréal]. Jabbarifar, M. (2013). On Line Trace Synchronization for Large Scale Distributed Systems [Ph.D. thesis, École Polytechnique de Montréal]. Shameli Sendi, A. (2013). System Health Monitoring and Proactive Response Activation [Ph.D. thesis, École Polytechnique de Montréal]. Desnoyers, M. (2009). Low-Impact Operating System Tracing [Ph.D. thesis, École Polytechnique de Montréal]. Poirier, B. (2002). Reconnaissance de la structure d'un document extrait de sa représentation graphique [Ph.D. thesis, École Polytechnique de Montréal]. Master's Thesis (58) Faour, A. (2024). Mise à l'échelle des analyses de trace dans une architecture modulaire [Master's thesis, Polytechnique Montréal]. Rouhghalandari, R. (2024). Performance Analysis of Data Stream Processing Systems [Master's thesis, Polytechnique Montréal]. Dion, O. (2023). Points de trace dynamiques, portables et extensibles en espace utilisateur avec un surcoût minimal et une couverture maximale [Master's thesis, Polytechnique Montréal]. Jumaah, F. (2023). Critical Path Analysis for MPI Applications with Trace Compass [Master's thesis, Polytechnique Montréal]. Piché, D. (2023). Techniques d'analyse ciblée de mémoire en temps réel pour les systèmes embarqués [Master's thesis, Polytechnique Montréal]. Saint-Cyr, B. (2023). Traçage multi-niveaux d'orchestrateur d'application conteneur",
  "content_length": 21330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:19"
}