{
  "name": "Michael Thielscher",
  "homepage": "http://www.cse.unsw.edu.au/~mit",
  "status": "success",
  "content": "Michael Thielscher Michael Thielscher Professor School of Computer Science and Engineering UNSW Australia Home Michael Thielscher is a Professor at The University of New South Wales. Michael has been named the highest-ranked scholar (lieftime achievement) in Artificial Intelligence in Australia (and 41st in the world) by ScholarGPS in 2024. Michael received his postgraduate diploma and his Ph.D., both with distinction, as well as his Higher Doctorate (Habilitation) in Computer Science from Darmstadt University. He then joined Dresden University, where he was an associate professor before he moved to his present position. His Habilitation thesis was honoured with the Award for Research Excellence by the alumni of Darmstadt University in 1998, and in 2009 he won a Future Fellowship Award from the Australian Research Council. Michael has been elected as the Program Chair for IJCAI'28. Previously he has been the General Chair for KR'20 and a Program Co-Chair for AI'12, KI'14, KR'18. Michael's current research is mainly in Knowledge Representation, Cognitive Agents and Robots, General Game Playing, and Artificial General Intelligence. He is author of over 200 refereed papers and five books, and he has co-authored the award-winning system FLUXPLAYER, which in 2006 was crowned the World Champion at the AAAI General Game Playing Competition. Michael was an invited speaker at the AAAI-10 conference. The slides for his talk on systems with general intelligence can be found here, and a video recording can be watched here. Michael also was a keynote speaker at the IJCAI-21 conference. The slides for his talk on knowledge representation for systems with general intelligence can be found here. Research Topics General Problem-solving Systems A general problem-solving system can understand descriptions of new problems and solve them without human intervention. An example are general game players, which can play previously unknown games given nothing but their rules. General Problem Solving has been identified as a Grand Challenge of Artificial Intelligence, drawing from a variety of sub-disciplines, including Knowledge Representation, Automated Reasoning, Search, and Learning. Harnessing AI to reduce loneliness (ARC-DP 2025-2027) The Project aims to develop AI companions that are able to meaningfully engage with experiences of loneliness. Its principal innovation will be the prototyping and evaluation of digitally embodied AI companions that can respond to dynamically changing user-states (e.g. emotions or moods) as an attentive human might. This step change in the effectiveness of AI comoanions is the key to addressing the socio-emotional states associated with loneliness. Urban Copilot – AI accelerating where we build Australia's future (CRC-P 2024-2027) Australia's future economy needs enabling technologies that streamline land use application decision making. This Project will develop an interactive AI product suite to assist industry to interpret regulations and create development applications. memorySCAPE: The commemoration of war using a database narrative framework (ARC-LP 2019-2024) The Project aims to explore the emergence of artistic innovations in the commemoration of war through the use of a database narrative. It expects to reformulate commemoration as a dynamic dialogue between visitors and memorial archives. To do so it will experimentally apply an aesthetic framework that transforms the display of the Australian War Memorial’s Afghanistan collection through platforms that meet the challenge of reflecting on contemporary conflict where documentation is being replaced by interaction. Anticipated is a demonstration of how users can explore collection data assisted by an interactive archive, with benefits that impact the meaning of memorial processes. Strategic Reasoning and Planning for General Game-Playing Robots (Australia-Germany Joint Research Cooperation Scheme 2017-2018) General game-playing programs learn to play new computer games just from the rules. This project aims to take this a step further and develop fundamental strategic reasoning techniques for general game-playing robots. These will enable robots to understand descriptions of new games played in real environments, to gain knowledge of rules through demonstration, and to learn to play these games effectively without further human intervention. To this end, based on our previous work on general game-playing programs (UNSW) and cognitive robotics and planning (Freiburg) we will jointly develop and analyse a mathematical framework for general game-playing robots, implement an automated reasoning system for this framework, and incorporate this into UNSW's fully autonomous, stationary Baxter robot. Representation and Reasoning for Cognitive Personal Robotics (ARC-DP 2015-2017) Robotic systems are becoming increasingly more sophisticated and prevalent. Developing complex and maintainable robot programs to control these systems remains a significant challenge particularly given the diversity of robot platforms and application areas. This project builds on advances in problem solving and programming paradigms in Artificial Intelligence, applying them to learning sophisticated robot programs. These techniques provide for elaboration tolerance, knowledge/program maintenance and optimisation of performance. This project will develop techniques for building sophisticated declarative robot programs. It will achieve this by learning procedural robot programs and turning them into maintainable declarative robot programs. Intra-Space: The Reformulation of Architectural Space as a Dialogical Aesthetic (2015-2017) This project investigates how the interactions between human participants and digital characters produce an entirely new type of space, an intra-space, actively created through inter-action, dynamically changed through the process of interaction. By integrating these systems the project pioneers the experimental representation of contemporary architectural space. Reformulating war memory as a dialogical interactive narrative (ARC-LP 2012-2016) Retrospect is a multi-platform project presented on ABC Online, ABC Television and ABC Radio during 2015 and as an interactive installation in the AVIE3 visualisation platform at Melbourne Museum in 2016. The project interactively explores the relationship between the experiences of Afghanistan veterans and their families. It involves collaboration between a group of veterans and families, researchers at UNSW, the ABC and Department of Veterans’ Affairs, with additional support by the Australia Council for the Arts and Museum Victoria. Using an artificially intelligent database of documentary material created in the field and assembled from ABC news archives, the project provides an innovative way of exploring war memories. Retrospect’s database can evolve, updated by new memories and experiences from other veterans and families. Universal Game-Playing Systems for Randomised and Imperfect-Information Games (ARC-DP 2012-2015) A universal game-player is a computer system that you can tell the rules of any new game and that then all by itself learns to play that game. Building such systems has recently been established as a Grand Challenge for research in Artificial Intelligence. The aim of this project is to develop a universal game-playing system that can learn to play arbitrary games including those with random moves and where players have imperfect information, which is usually the case in real-world games. This will significantly advance the knowledge of this discipline, which today is limited to deterministic games with complete information. This will result in innovative methods and technologies for building universal game-playing systems. Representing and Reasoning About Ability for Robots to Use the Cloud (ARC-DP 2012-2015) Robot technologies have developed dramatically, particularly with the reduction in size and cost of computer components and the increase in sophistication of sensors and actuators. Robot software, or more accurately, robot middleware has also increased in sophistication with projects like the Robot Operating System (ROS) now being adopted by the majority of research groups worldwide. However, the desire to limit power usage means that processing capabilities and storage capacity remain bounded. The advent of cloud computing provides a means for addressing these limitations. This project develops techniques for representing and reasoning about robot abilities so that data and algorithms can be stored in the cloud and utilised as required. Declarative Programming for General Robotics (Go8-DAAD 2012-2013) The aim of this project is to endow autonomous robots with general intelligence using the methodology of declarative programming. General intelligence allows autonomous robots to solve new tasks and to function in new environments without the need to be re-programmed. To do so, robots must be able to act rationally solely on the basis of what they know about a given task, about the actions they can perform, and about the effects of these actions. This requires to build an integrated framework for general robotics that combines two cutting-edge Artificial Intelligence technologies: A mathematical framework for the automation of rational behavior, decision making, and planning developed at UNSW. A methodology and tool for declarative programming (Reactive Answer Set Programming) developed at Potsdam University. Logical Foundation and Implementation Technology for Automated Negotiation (ARC-DP 2009-2011) Electronic trading systems rely on multilateral, multi-issue negotiation models. The existing systems, underpinned by classical game theory, are mostly single-issue, numerically based. Qualitative judgements and logical reasoning are missing. In this project, we remedy these glaring deficiencies by providing a theory of bargaining with unified tools of qualitative and quantitative analysis, ",
  "content_length": 10962,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:00"
}