{
  "name": "Michael Benedikt",
  "homepage": "https://www.cs.ox.ac.uk/michael.benedikt",
  "status": "success",
  "content": "Michael Benedikt | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleMichael BenediktMichael Benedikt Professor Michael Benedikt Director of Advanced MSc in Computer ScienceProfessor of Computer ScienceE: michael.benedikt@cs.ox.ac.ukT: +44 (0)1865 273818 Room 355, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Data, Knowledge and ActionArtificial Intelligence and Machine LearningQuantumAlgorithms and Complexity TheoryCompleted Projects:FOXQuery-driven Data Acquisition from Web-based Data SourcesExODAPrOQAWDBOntoPDQmore…InterestsDatabases, information exchange, Web and Web 2.0 data management, logical methods in computer science.BiographyPh.D. in Mathematics from University of Wisconsin, 1993. Distinguished Member of Technical Staff at Bell Laboratories, 1994-2006.See alsoMy personal homepageSelected PublicationsView AllManage publications Almost Surely Asymptotically Constant Graph Neural Networks Sam Adam−Day‚ Michael Benedikt‚ İsmail İlkan Ceylan and Ben Finkelshtein In Proceedings of the 38th Annual Conference on Neural Information Processing Systems (NeurIPS). 2024. Details about Almost Surely Asymptotically Constant Graph Neural Networks | BibTeX data for Almost Surely Asymptotically Constant Graph Neural Networks | Link to Almost Surely Asymptotically Constant Graph Neural Networks Logical foundations of information disclosure in ontology−based data integration Michael Benedikt‚ Bernardo Cuenca Grau and Egor V. Kostylev In Artificial Intelligence. Vol. 262. Pages 52–95. 2018. Details about Logical foundations of information disclosure in ontology−based data integration | BibTeX data for Logical foundations of information disclosure in ontology−based data integration | DOI (10.1016/j.artint.2018.06.002) Goal−Driven Query Answering for Existential Rules With Equality Michael Benedikt‚ Boris Motik and Efthymia Tsamoura In Proceedings of the Thirty−Second AAAI Conference on Artificial Intelligence‚ New Orleans‚ Louisiana‚ USA‚ February 2−7‚ 2018. 2018. Details about Goal−Driven Query Answering for Existential Rules With Equality | BibTeX data for Goal−Driven Query Answering for Existential Rules With Equality | Link to Goal−Driven Query Answering for Existential Rules With Equality ActivitiesAlgorithms At LargeDatabasesCompleted ProjectsFOXQuery-driven Data Acquisition from Web-based Data SourcesExODAPrOQAWDBOntoPDQArtFormED3QUINTON Past Students Luying ChenGonzalo DiazClemens LeyInes MarusicCristian RiverosBen Spencer Past Researcher Jaclyn SmithAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2803,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:42"
}