{
  "name": "Michael Pradel",
  "homepage": "http://software-lab.org/people/Michael_Pradel.html",
  "status": "success",
  "content": "Michael Pradel - Software Lab - Department of Computer Science - University of Stuttgart Michael Pradel Email: michael@binaervarianz.de Phone: +49-711-685-88320 University of Stuttgart Software Lab Universitätsstr. 38, Room 1.211 70569 Stuttgart, Germany We have openings for PhD students and post-docs. Bio I'm a faculty member at the CISPA Helmholtz Center for Information Security and a full professor in the Computer Science Department of the University of Stuttgart. I'm also faculty member in the International Max Planck Research School (IMPRS) for Intelligent Systems (IS) and a member in the Stuttgart ELLIS Unit. Previously, I was an assistant professor at TU Darmstadt, a postdoctoral researcher at the University of California, Berkeley, and a lecturer and postdoctoral researcher at ETH Zurich, where I completed my Ph.D. on program analyses for automatic and precise error detection. In 2019, I spent a sabbatical at Facebook, Menlo Park. I studied computer science at TU Dresden and engineering at Ecole Centrale Paris, and I visited EPFL for my master thesis. My work has been recognized through the Ernst-Denert Software Engineering Award, an Emmy Noether grant (1.3 million Euro) by the DFG, an ERC Starting Grant (1.5 million Euro), best/distinguished paper awards at FSE (3x), ISSTA, ASE, ASPLOS, and MSR, and by being named an ACM Distinguished Member. Please follow these links for my research, publications, and teaching activities. CV, Google Scholar, DBLP, GitHub Recent, current, and upcoming service FSE 2027: PC co-chair ICSE 2026: Area chair OOPSLA 2026: Associate chair ISSTA 2026: Program committee FSE 2026: Program committee SE 2026: PC co-chair ASE 2025: Co-chair of New Faculty Symposium ASE 2025: Area chair ICSE 2025: Program committee FSE 2025: Program committee ASE 2024: Area chair ISSTA 2024: PC chair ESEC/FSE 2023: Program committee ICSE 2023: Program committee OOPSLA 2023: Review committee ISSTA 2023: Program committee ASE 2023: Program committee ESEC/FSE 2022: Chair of doctoral symposium ESEC/FSE 2022: Program committee ASE 2022: Program committee ISSTA 2022: Program committee ICSE 2022: Program committee ACM SIGSOFT Research highlights committee (2020-2022) OOPSLA 2021: Extended review committee PLDI 2021: Program committee ICSE 2021: Program committee ESEC/FSE 2021: Program committee ASE 2021: Program committee ISSTA 2021: Program committee ISSTA 2021: Co-chair of tool demonstrations ECOOP 2021: Program committee IEEE TSE (2020-2024): Associate editor Talks Slides of a few selected presentations. See here for talks on specific papers. Research Productivity and Time Management (talk given at New Faculty Symposium at FSE'25, 06/2025) LLM Agents for Program Repair and Project Setup (talk given at Shonan meeting 217, TU Delft, Imperial College London) Reliable Quantum Computing (talk given at IQST Day 2025) ChangeGuard: Validating Code Changes via Pairwise Learning-Guided Execution (talk given at Dagstuhl seminar 24431) Neuro-Symbolic Developer Tools for Analyzing, Executing, and Repairing Code (talk given at NLBSE@ICSE'24, UC Davis, Google, TU Darmstadt, TU Munich, AWS, UCLA, USC, UC Riverside, Huawei, U Chicago, York University, TU Wien, CISPA, 04/2024-12/2024) SecBench.js: An Executable Security Benchmark Suite for Server-Side JavaScript (talk given at SDD@FSE'23, 12/2023) Does AI Replace Software Developers? (talk given at infos meeting, 11/2023) Neural Software Analysis: Recent Advances on Types, Bugs, and Executions (talk given at Microsoft Research, IBM Research, and LLMs-for-Code Seminar, 07/2023) Metamorphic Testing of Developer Tools (talk given at MET@ICSE'23, 05/2023) Bugs in Quantum Computing Platforms and How to Detect Them Automatically (talk given at National University of Singapore, 09/2022) Thinking Like a Developer? Comparing the Attention of Humans with Neural Models of Code (talk given ASA@PLDI'22, 06/2022) DynaPyt: A Dynamic Analysis Framework for Python (talk given at IFIP WG2.4 Meeting, 06/2022) Neural Software Analysis: Learning Developer Tools from Code (talk given at Northeastern University, MIT, Columbia University, Stevens Institute of Technology, ETH Zurich, USI Lugano, ML4Code@Montreal, 12/2021-05/2022) From PhD Student to Full Professor: Lessons Learned in the Trenches (talk given at New Faculty Symposium of ISSRE'21, 10/2021) Semantic Bug Seeding: A Learning-Based Approach for Creating Realistic Bugs (talk given at IFIP WG2.4 Meeting, 05/2021) News and Events 11/2025: Our ASE'25 paper on understanding software engineering agents has received an ACM SIGSOFT Distinguished Award. 11/2025: Welcome to Pascal Joos, who is joining the group as a PhD student. 10/2025: Our papers on mapping code regions across commits and on generating issue-reproducing tests have been accepted to ICSE'26. 10/2025: Welcome to Geraldine (aka Widni), who is joining the group as a PhD student. 9/2025: Our article on Agentic AI Software Engineers will appear in the Communications of the ACM (CACM). 8/2025: Our papers on understanding agent trajectories and program reduction for WebAssembly will be presented at ASE'25. 7/2025: Checkout NoCode-bench (paper, leaderboard), our new benchmark for evaluating LLMs on NL-driven feature addition tasks. 6/2025: Three papers accepted at ICSE'26. 5/2025: Matteo has successfully defended his PhD thesis on \"Testing and Analysis of Quantum Software\". Congrats! 5/2025: Group retreat in Maulbronn. 5/2025: Our MSR'25 paper on using LLMs for annotating software engineering artifacts has received an ACM SIGSOFT Distinguished Paper Award. 4/2025: Big news: Starting from September, the Software Lab will join CISPA, where Michael will be a faculty member while remaining a professor at the University of Stuttgart. 4/2025: Our work on DyLin, a dynamic linter for Python, will be presented at FSE'25. 4/2025: Our paper on ExecutionAgent has been accepted at ISSTA'25. 3/2025: Welcome to Cristian Cadar, who is joining the lab as a visiting professor supported by a Humboldt Research Award (picture). 3/2025: Don't like regressions? Checkout Testora, which detects regressions by leveraging the natural language information provided in pull requests. 3/2025: Michael will serve as PC co-chair of FSE 2027. 3/2025: Doehyun is joining the group as a PhD student. Welcome! 2/2025: Opinion article on agentic-AI-based software engineering. 1/2025: Our work on Treefix, an LLM-based approach toward learning-guided execution, will be presented at ICSE'25. 1/2025: Two papers accepted at FSE'25: (i) validating code changes via learning-guided execution and (ii) a study of suppressed static analysis warnings. 1/2025: Our paper on using LLMs instead of manual annotation of software engineering artifacts will be presented at MSR'25. 12/2024: Need to build and test a project? Check out ExecutionAgent, our new technique for automatically installing, configuring, and testing arbitrary software projects. 11/2024: Welcome to Jialun Cao, who is joining the lab as a visiting professor. 11/2024: Our work on RepairAgent, an autonomous LLM agent for program repair, will be presented at ICSE'25. 10/2024: Welcome to Zhongxin Liu, who is joining the lab as a visiting professor. 7/2024: We have an opening for a(nother) full professor in Software Engineering at the University of Stuttgart. 7/2024: Our work on calibration and correctness of LLMs for code will appear at ICSE'25. 7/2024: Michael is joining UCLA for part two of his sabbatical. 6/2024: Wasm-R3, the first record-and-replay technique for WebAssembly, will be presented at OOPSLA'24. Congrats to everyone involved in this CMU-Google-KAIST-Stuttgart collaboration. 4/2024: LintQ, our static analysis framework for checking quantum programs, will be presented at FSE'24. 3/2024: Introducing RepairAgent, the first autonomous, LLM-based agent for automated program repair. 2/2024: Michael is joining UC Berkeley for a sabbatical. 2/2024: Luca has successfully defended his PhD thesis on \"Supporting Software Evolution via Search and Prediction\" and is starting a post-doc at USI Lugano. 1/2024: DyPyBench, a novel benchmark of executable Python code, will be presented at FSE'24. 12/2023: Our paper on repairing static type errors in Python will be presented at ICSE'24. 12/2023: ACM SIGSOFT Distinguished Paper Award for our work on LExecutor. 10/2023: Our work on universal fuzzing with large language models will be presented at ICSE'24. 9/2023: Daniel receives the infos award for the best PhD thesis of the year 2022 in our Computer Science Department. Congrats! 8/2023: Our empirical study of workflows of GitHub Actions will be presented at ICSE'24. 8/2023: Group retreat at Obermarchtal. 7/2023: Our work on LExecutor will be presented at FSE'23. Congrats to Beatriz on the first top-tier paper during her PhD! 7/2023: Two awards at ISSTA'23: An ACM SIGSOFT Distinguished Paper Award for bimodal taint analysis and an ACM SIGSOFT Distinguished Artifact Award for our work on WebAssembly call graphs. 7/2023: Co-organizing two Dagstuhl seminars in 2024: Code Search (April) and Automated Programming and Program Repair (October). 6/2023: Thanks to Prem Devanbu for the amazing time we had during his five-month visit of our lab. 5/2023: Interested in call graphs and/or WebAssembly? Check out our new ISSTA'23 paper. 5/2023: Luca is heading out for an internship at Uber. Have fun! 4/2023: Beatriz is joining the group as a PhD student. 2/2023: Prem Devanbu is joining the lab for five months with a Humboldt Research Award. Welcome! 2/2023: Fun and inspiring Dagstuhl seminar on Programming Language Processing. 1/2023: Our paper on bimodal taint analysis will be presented at ISSTA'23. 12/2022: Four papers accepted at ICSE'23. Congrats to everyone involved! 12/2022: Michael gets recognized as an ACM Distinguished Member. 11/2022: Our work on DiffSearch (paper, tool) will appear in IEEE TSE. 10/2022: Islem wins the ACM Student Research Competition at ASE'22 for his work on detecting incon",
  "content_length": 11503,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:45"
}