{
  "name": "Michalis K. Titsias",
  "homepage": "http://www.aueb.gr/users/mtitsias",
  "status": "success",
  "content": "Michalis K. Titsias Athens University of Economics and Business mtitsias at aueb dot gr Home Teaching Talks Software Publications GitHub This page is not updated anymore. Here is my new page. I work as a full time Research Scientist at DeepMind based on London, UK. I am interested in the theory and applications of Machine Learning, Deep Learning, Reinforcement Learning, Bayesian Statistics and Data Science. My CV (not recently updated) can be found here. Recent preprints (New) M. K. Titsias, J. Schwarz, A. G. de G. Matthews, R. Pascanu, Y. W. Teh. Functional Regularisation for Continual Learning, arXiv:1901.11356 , 2019. M. K. Titsias. Learning Model Reparametrizations: Implicit Variational Inference by Fitting MCMC Distributions, arXiv:1708.01529 , 2017. Recent conference and journal papers (New) M. K. Titsias, P. Dellaportas. Gradient-based Adaptive Markov Chain Monte Carlo. To appear in Proceedings of the 33th Conference on Neural Information Processing Systems (NeurIPS), 2019, coming soon. (New) F. J. R. Ruiz, M. K. Titsias. A Contrastive Divergence for Combining Variational Inference and MCMC, Proceedings of the 35th International Conference on Machine Learning (ICML), 2018. (New) M. K. Titsias F. J. R. Ruiz. Unbiased Implicit Variational Inference, 22th International Conference on Artificial Intelligence and Statistics (AISTATS), 2019. 2019. K. Martens, M. K Titsias, C. Yau. Rejection-free Ensemble MCMC with applications to Factorial Hidden Markov Models, 22th International Conference on Artificial Intelligence and Statistics (AISTATS), 2019. F. J. R. Ruiz, M. K. Titsias, A. B. Dieng, and D. M. Blei. Augment and Reduce: Stochastic Inference for Large Categorical Distributions, Proceedings of the 35th International Conference on Machine Learning (ICML), 2018. M. K. Titsias and O. Papaspiliopoulos. Auxiliary gradient-based sampling algorithms, Journal of the Royal Statistical Society: Series B, Vol 80, Issue 4, Pages 749-767, 2018. [slides] T. Rukat, C. C. Holmes, M. K. Titsias, C. Yau. Bayesian Boolean Matrix Factorisation, Proceedings of the 34th International Conference on Machine Learning (ICML), 2017. M. K. Titsias. One-vs-Each Approximation to Softmax for Scalable Estimation of Probabilities, NIPS, 29, 2016. F. J. R. Ruiz, M. K. Titsias and D. M. Blei. The Generalized Reparameterization Gradient, NIPS, 29, 2016. M. K. Titsias, and C. Yau. The Hamming Ball Sampler. Journal of the American Statistical Association (JASA), Theory and Methods, Vol 112, Issue 520, 2017. F. J. R. Ruiz, M. K. Titsias and D. M. Blei. Overdispersed Black-Box Variational Inference, Uncertainty in Artificial Intelligence (UAI), 2016. [supplementary] *Joint first author.",
  "content_length": 2699,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:14"
}