{
  "name": "Michael I. Miller",
  "homepage": "https://www.bme.jhu.edu/people/faculty/michael-i-miller",
  "status": "success",
  "content": "Michael I. Miller - Johns Hopkins Biomedical Engineering Skip to Content Menu Search Search Search Apply Contact BME Accreditation Give In this Section Johns Hopkins Biomedical Engineering People Faculty Michael I. Miller Michael I. Miller, PhD Research Interests: Data science, computational neuroscience, medical imaging, computational anatomy, pattern theory Publications: From Google Scholar / From Pub Med Contact mim@jhu.edu Assistant: BME-Director@jhu.edu For scheduling and inquiries, please contact BME-Director@jhu.edu Research Interests Research Interests Michael I. Miller is the Bessie Darling Massey Professor and Director of Biomedical Engineering at Johns Hopkins University. He is also co-director of the Kavli Neuroscience Discovery Institute. As a biomedical engineer who specializes in data science, Miller is pioneering cutting-edge technologies in computational medicine to understand and diagnose neurodegenerative diseases. His research focuses on the functional and structural characteristics of the human brain in health and disease, including Huntington’s disease, Alzheimer’s disease, dementia, bipolar disorder, schizophrenia, and epilepsy. By developing new tools to analyze patient brain scans, derived from advanced medical imaging technologies, Miller aims to predict the risk of developing neurological disorders years before the onset of clinical symptoms. His lab is currently devising cloud-based methods to build and share libraries of brain images—and the algorithms used to understand them—associated with neuropsychiatric illness. Miller’s research is highly translational, and he has co-founded four start-up companies in the past decade. Miller has co-authored more than 200 peer-reviewed publications, as well as two highly cited textbooks on random point processes and computational anatomy. In 2002, he was recognized by the Institute for Scientific Information (ISI) Essential Science Indicators for garnering the highest rate of increase in total citations in the field of engineering for his work in computational anatomy. He has received numerous awards for his work, including the national Institute of Electrical and Electronics Engineers (IEEE) Biomedical Engineering Thesis Award in 1982, the Johns Hopkins Paul Ehrlich Graduate Student Thesis Award in 1983, and the National Science Foundation (NSF) Presidential Young Investigator Award in 1986. He was named an inaugural Johns Hopkins University Gilman Scholar in 2011 for demonstrating a distinguished record of research, teaching, and service. He is an elected Fellow of the American Institute for Medical and Biological Engineering, the Institute of Electrical and Electronics Engineers, and the Biomedical Engineering Society. Miller earned his BS from the State University of New York at Stony Brook in 1976, and his MS in electrical engineering and PhD in biomedical engineering from Johns Hopkins University in 1978 and 1983, respectively. He was the Newton R. and Sarah L. Wilson Professor in Biomedical Engineering at Washington University in St. Louis until joining Johns Hopkins University in 1998. He was named the Herschel and Ruth Seder Professor in Biomedical Engineering in 2003, before his appointment as the director of biomedical engineering in 2017. He was also previously the director of the Johns Hopkins Center for Imaging Science. Titles & Affiliations Titles Bessie Darling Massey Professor, Biomedical Engineering Director, Department of Biomedical Engineering Co-Director, Kavli Neuroscience Discovery Institute Johns Hopkins Gilman Scholar Professor, Electrical and Computer Engineering Affiliated Centers & Institutes Center for Imaging ScienceInstitute for Computational MedicineKavli Neuroscience Discovery InstituteMathematical Institute for Data Science (MINDS) Education Education PhD, Biomedical Engineering, Johns Hopkins University, 1984 MS, Electrical Engineering, Johns Hopkins University, 1979 BS, Electrical Engineering, The State University of NY at Stony Brook, 1976 Faculty News Recent Highlights March 17, 2025 Research Matters: Earlier, better treatments for Alzheimer’s Federally funded research at Johns Hopkins offers new avenues for detecting brain disease long before it strikes. February 22, 2024 Hopkins BME, university consortium take on grand challenges in biomedical engineering In a new IEEE paper, an alliance of 50 experts from 34 elite universities— including Johns Hopkins —reveal five research areas where the field of biomedical engineering has the potential to achieve tremendous impact on the field of medicine. December 5, 2019 Michael I. Miller named IEEE Fellow Michael I. Miller, Bessie Darling Massey Professor, director of the Department of Biomedical Engineering and the Center for Imaging Science, as well as co-director of the Kavli Neuroscience Discovery Institute, has been elected as an IEEE Fellow, effective on January 1, 2020. June 17, 2019 Seven from BME receive Johns Hopkins Discovery Awards Johns Hopkins University announced 32 multidisciplinary endeavors that have been selected to receive support this year from the JHU Discovery Awards program. Seven faculty from the Department of Biomedical Engineering are part of those endeavors. Media Media Read the Johns Hopkins University privacy statement here. Accept",
  "content_length": 5305,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:15"
}