{
  "name": "Michael Prilla",
  "homepage": "https://interaktive-systeme-ude.de",
  "status": "success",
  "content": "Interaktive Systeme an der Universität Duisburg-Essen Interaktive Systeme an der Universität Duisburg-Essen Interaktive Systeme an der Universität Duisburg-Essen Interaktive Systeme an der Universität Duisburg-Essen Interaktive Systeme an der Universität Duisburg-Essen Interaktive Systeme an der Universität Duisburg-Essen Interaktive Systeme an der Universität Duisburg-Essen Interaktive Systeme an der Universität Duisburg-Essen Interaktive Systeme an der Universität Duisburg-Essen Previous Next Wir als Lehrstuhl Interaktive Systeme wollen einen Beitrag zur menschzentrierten Gestaltung interaktiver Technologien leisten. Wir untersuchen die Wirkung von Technologie in der Praxis und gestalten die Zukunft der technischen Unterstützung von Menschen mit. Dafür stützen wir unsere Forschung auf einen praxisnahen empirischen Ansatz, der verschiedene Methoden und disziplinäre Hintergründe verbindet. Aktuell arbeiten wir hierzu an Technologien wie Augmented Reality, Roboter und künstliche Intelligenz. PROBAND:INNEN GESUCHT! Für unsere laufenden Studien suchen wir aktuell Studienteilnehmer:innen! Was Sie erwartet: Neue Technologien kennenlernen und erforschen (Roboter, AR, VR etc.) Einblicke in innovative Forschungsprojekte und wissenschaftliche Methoden Möglichkeit zur Vergütung (12€/Std) oder Sammeln von Versuchspersonenstunden Registrieren Sie sich gleich hier Forschung: Mensch-Roboter-Kollaboration und -Interaktion Die Interaktion und Zusammenarbeit mit Robotern und KI wird in der Zukunft zum Alltag des Arbeitens und Lernens gehören. Wir untersuchen in unserem Lab und in verschiedenen Projekten, wie Roboter und KI mensch-zentriert entwickelt werden können. Zu unseren Robotern und der KI Forschung: Arbeiten und Lernen mit Augmented Reality Augmented Reality verbindet virtuelle und reale Welten. In unserem AR-Labor und in verschiedenen Projekten untersuchen wir Möglichkeiten, individuelles und kooperatives Arbeiten und Lernen durch Augmented Reality zu unterstützen. Zur Kooperation in AR Digitalisierung in der Praxis: Gesundheitswesen, Handwerk, Handel, Produktion In unseren Anwendungs- und Praxisprojekten entwickeln wir Lösungen für die Unterstützung von Arbeit und Lernen gemeinsam mit ihren späteren Nutzer*innen und erproben diese mit ihnen. Zu unseren Projekten",
  "content_length": 2294,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:46"
}