{
  "name": "Michael M. Swift",
  "homepage": "http://pages.cs.wisc.edu/~swift",
  "status": "success",
  "content": "Michael Swift -- University of Wisconsin Madison Michael Swift -- University of Wisconsin Madison About Professor Computer Sciences Department College of Letters and Sciences University of Wisconsin, Madison Michael Swift is a professor at the University of Wisconsin--Madison in the Department of Computer Sciences. His research focuses on the hardware/operating system boundary, including virtual memory, persistence and storage, new compute technologies, and device drivers. He received his BA from Cornell University in 1992 and Ph.D. from the University of Washington in 2005. Before graduate school, he worked at Microsoft in the Windows group, where he implemented authentication and access control functionality in Windows Cairo, Windows NT, and Windows 2000. Research My research focuses on bridging the growing gap between hardware and operating systems. My work seeks to improve the reliability and performance of hardware access while simplifying the programmerâs task. I frequently collaborate with computer architecture researchers to investigate new processor technologies, such as transactional memory, heterogeneous processors, and hardware accelerators. Our research has demonstrated how relatively modest changes to existing operating systems could greatly improve the efficiency of these new hardware designs. Most recently, my work has expanded to new storage technologies. Solid-state storage technologies, such as flash and Intel's 3D Xpoint memory promise large-capacity storage at speeds much faster than disk. My ongoing work focuses on how these technologies change system software, and specifically, on how to expose it to applications. I also have research projects on high-speed data center networking in collaboration with Professor Aditya Akella at UW--Madison, and cloud computing security with Professor Jeff Chase at Duke University. My graduate work focused on device-driver reliability and showed how operating systems could be made robust against crashes in this critical piece of code. We then expanded upon this work to focus on how to simplify coding device drivers, how to make operating systems tolerate failures of attached devices and how to simplify the testing process for driver code. Background Prior to arriving in Wisconsin, I received a Ph.D. from the University of Washington, Seattle in 2006 under advisors Hank Levy and Brian Bershad. Before entering graduate school, I worked at Microsoft in the Windows NT group, where I implemetned authentication and access control functionality in Windows Cairo, Windows NT and Windows 2000. I attended Cornell University and earned a B.A. in Computer Science in 1992. 2022-23 committee assignments Director of Undergraduate Studies Chair, CS Diversity, equity, and inclusion committee Member, CS Department Award Committee Member, Letters and Sciences Diversity, Equity and Inclusion Committee Member, Letters and Sciences Curriculum Committee Member, International Academic Programs Faculty Advisory Committee Research services Editor in Chief, ACM Tranasctions on Computer Systems Teaching All classes CS 537- Introduction to Operating Systems Research All research My research covers interaction of operating systems and hardware, including devices and new processor/memory technologies. I lead the SCAIL research group on system support for novel technologies. Previously, I led the Sonar research group on system support for novel technologies. I also co-led the Multifacet group on computer architecture with Mark Hill. I'm also part of the Wisconsin Institute on Software-defined Datacenters in Madison (WISDoM). Projects New memory technology. New uses and interfaces to flash and storage class memory. Cloud computing. Investigating security issues in cloud computing Heterogeneous and accelerated processors. System and scheduling support for accelerators and dynamically heterogeneous processors. Data-center networking. End-host network scheduling. congestion control for RDMA and software offloads to smart NICs. Transactional memory. Making transactions and the operating system work together. Device drivers. Improving driver code and design through new architectures, better understanding, and bug finding. Recent publications All publications Deepak Jegan Sirone, Liang Wang, Siddhant Bhagat and Michael M. Swift. Guarding Serverless Applications with Kalium. To appear in Proceedings of 32nd USENIX Security Symposium (USENIX SECâ23), August 2023. Shawn Zhong, Chenhao Ye, Guanzhou Hu, Suyan Qu, Andrea Arpaci-Dusseau, Remzi Arpaci-Dusseau and Michael M. Swift. MadFS: Per-File Virtualization for Userspace Persistent Memory Filesystems. To appear in Proceedings of 21st Usenix Conference on File and Storage Technologies (FAST), February 2023. Marina Sanusi, Mazharul Islam, Syed Suleman Ahmad, Michael M. Swift, Thomas Ristenpart and Rahul Chatterjee. Gossamer: Securely Measuring Password-based Logins. In Proceedings of 31st USENIX Security Symposium (USENIX SECâ22), August 2022. Yuraj Patel, Chenhao Ye, Akshat Sinha, Abigail Matthews, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau and Michael M. Swift. Using Tratr to tame Adversarial Synchronization. In Proceedings of USENIX Security Symposium, August 2022. Mark Mansi, Bijan Tabatabai and Michael M. Swift. CBMM: Financial Advice for Kernel Memory Managers. In Proceedings of the 2022 USENIX Annual Technical Conference (USENIX ATCâ22), July 2022. Sujay Yadalam, Nisarg Shah, Xiangyao Yu and Michael M. Swift. ASAP: A Speculative Approach to Persistence. In Proceedings of the 28th IEEE International Symposium on High Performance Computer Architecture (HPCA-22), April 2022 Jialiang Zhang, Michael M. Swift and Jing (Jane) Li. Software-defined address mapping: a case on 3D memory. In Proceedings of the 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2020), February 2022. ChonLam Lao, Yanfang Le, Kshiteej Mahajan, Yixi Chen, Wenfei Wu, Aditya Akella and Michael Swift. ATP: In-network Aggregation for Multi-tenant Learning. In Proceedings of the 18th USENIX Symposium on Networked Systems Design and Implementation (NSDI '21), April 2021. Best paper award Yanfang Le, Radhika Niranjan Mysore, Lalith Suresh, Gerd Zellweger, Sujata Banerjee, Aditya Akella, Michael M. Swift: PL2: Towards Predictable Low Latency in Rack-Scale Networks. arXiv 2101.06537, January 2021. Contact Information 608-890-0131 swift at cs dot wisc dot edu 7369 Computer Sciences Computer Sciences Department University of Wisconsin-Madison 1210 West Dayton Street Madison, WI 53706-1685 USA © Untitled. All rights reserved.Design: HTML5 UP",
  "content_length": 6667,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:36"
}