{
  "name": "Michael Wooldridge",
  "homepage": "http://www.cs.ox.ac.uk/people/michael.wooldridge",
  "status": "success",
  "content": "Michael Wooldridge | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyMichael WooldridgeMichael Wooldridge Professor Michael Wooldridge Ashall Professor of Foundations of Artificial IntelligenceSenior Research Fellow, Hertford CollegeE: michael.wooldridge@cs.ox.ac.ukO: Book: Programming Multi-Agent Systems in AgentSpeakThemes:Artificial Intelligence and Machine LearningCompleted Projects:RACEFoundations of Trustworthy AIInterestsMy research area is Artificial Intelligence (AI), and within that field, I have worked extensively on multi-agent systems: systems composed of multiple interacting AI systems. I have published more than four hundred and fifty articles -- see also my Google Scholar profile. Thank you for showing an interest in my work.BiographyYou can download a short and long biography along with links to a photo here. I am the Ashall Professor of the Foundations of Artificial Intelligence in the Department of Computer Science at the University of Oxford, and a Senior Research Fellow at Hertford College. From 2014-21 I was Head of Department of Computer Science. I joined Oxford on 1 June 2012; before this I was for twelve years a Professor of Computer Science at the University of Liverpool. In 2020, I was awarded the Lovelace Medal from the British Computer Society; in 2006, I was the recipient of the ACM Autonomous Agents Research Award; in 2021 I received the AAAI/EAAI Outstanding Educator Award; and in 2023 I received the Distinguished Service Award from the European Assocation for AI. I am an ACM Fellow, a AAAI Fellow, a EURAI Fellow, an AISB Fellow, a BCS Fellow, and a member of Academia Europaea. I served as President of the International Joint Conference on Artificial Intelligence (IJCAI) from 2015-17, President of the European Association for AI (EurAI) from 2014-16, and President of the International Association for Autonomous Agents and Multiagent Systems (IFAAMAS) from 2007-09. I was general chair for the 38th Annual AAAI Conference on AI (AAAI-24), held in Vancouver, BC, in February 2024, Conference Chair for the 24th International Joint Conference on Artificial Intelligence (IJCAI-2015), held in Buenos Aires, Argentina, in July 2015, program chair for the 19th European Conference on Artificial Intelligence (ECAI-2010), held in Lisbon, Portugal, in August 2010, program chair for the  Fourth International Conference on Autonomous Agents and Multiagent Systems (AAMAS-2005), held in Utrecht, the Netherlands, in 2005, General Chair for the Second International Conference on Autonomous Agents and Multiagent Systems (AAMAS-2003), held in Melbourne, Australia, in July 2003, and Program Chair for the Second International Conference on Autonomous Agents (Agents-98), held in Minneapolis in May 1998. In 2021 I received a Turing AI World Leading Researcher Fellowship from UKRI; in 2011, I was awarded a 5-year ERC Advanced Grant, entitled \"Reasoning About Computational Economies\" (RACE); and in 1997, I founded AgentLink, the EC-funded European Network of Excellence in the area of agent-based computing. I am co-Editor-in-Chief of Artificial Intelligence Journal, the oldest international journal for AI (established 1971), and indeed one of the oldest computing journals. Between 2003 and 2009 I was co-editor-in-chief of the Journal Autonomous Agents and Multi-Agent Systems. I have served as an associate editor of the Journal of Artificial Intelligence Research (JAIR) (2006-2009, 2009-2012), an associate editor of Artificial Intelligence journal (2009-2012) and I currently serve on the editorial boards of the Journal of Applied Logic, Journal of Logic and Computation, Journal of Applied Artificial Intelligence, Games, and Computational Intelligence. I gave the 2023 Royal Institution Christmas Lectures, in the 198th year of the series, broadcast by BBC TV over Christmas 2023. I have written two popular science introductions to AI: the Ladybird Expert Guide to Artificial Intelligence, a short overview in the iconic British book series, and The Road to Conscious Machines, a longer introduction to AI in Penguin's classic Pelican series; an edited and revised version of The Road to Conscious Machines was published in the USA by Flatiron Press under the title A Brief History of AI. Both books are aimed a general audience.See alsoPublicationsBook: Introduction to MultiAgent Systems (Second Edition)Book: Principles of Automated NegotiationBook: Computational Aspects of Cooperative Game TheoryBook: Reasoning about Rational AgentsBook: The Road to Conscious Machines. (Pelican, 2020)ActivitiesComplexity and equilibriaLogics for strategic reasoningConcurrency in gamesComputational social choiceRational verificationAgent-based financial modellingProjectsFoundational AI ResearchTuring AI Fellowship Current Students Lewis HammondWei-Chen Lee Research David HylandResearch Associate, Doctoral Student Past Students Josef BoltJames FoxJiarui GanDongge HanJames PaulinThomas SteeplesMateusz Tarkowski Past Researchers Javier MoralesHao ZhouAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 5313,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:05"
}