{
  "name": "Michael P. Friedlander",
  "homepage": "http://www.cs.ubc.ca/~mpf",
  "status": "success",
  "content": "Michael P. Friedlander | UBC | Computational Mathematics menuMichael P. FriedlanderProfessor of Computational MathematicsSauder School Distinguished ScholarDirector, UBC Institute of Applied MathematicsDepartment of Computer ScienceDepartment of MathematicsUniversity of British Columbialocation_onICCS 221, 2366 Main Malllocation_onVancouver, BC, V6T 1Z4, CanadaBackgroundProfessor, University of British Columbia (2014–present)Professor, University of California, Davis (2014–2016)Assistant ⤳ Associate Professor, University of British Columbia (2004–2014)Wilkinson Fellow, Argonne National Laboratory (2002–2004)PhD, Stanford University, Operations Research (2002)BA, Cornell University, Physics (1993)AppointmentsCurrent PositionsFellow, Society for Industrial and Applied Mathematics (SIAM) (2024–present)Director, UBC Institute of Applied Mathematics (2018–present)Associate Editor, Open Journal of Mathematical Optimization (2021–present)Past LeadershipBoard of Directors, Pacific Institute for Mathematical Sciences (2017-2023)Associate Head for Faculty Affairs, UBC Dept of Computer Science (2017–2018)Program Director, SIAM Activity Group in Optimization (2014–2020)Conference OrganizationCo-chair, SIAM Annual Conference (2024)Co-chair, SIAM Conference on Optimization (2017)Past Editorial ServiceArea Editor for Continuous Optimization, Mathematics of Operations Research (2018–2022)Associate Editor, Mathematics of Operations Research (2016–2018)Associate Editor, SIAM J. Optimization (2009–2018)Associate Editor, Mathematical Programming Computation (2008–2018)Associate Editor, SIAM J. Matrix Analysis and Applications (2011–2017)Associate Editor, Mathematical Programming (2015–2017)Associate Editor, SIAM J. Scientific Computing (2013–2016)Associate Editor, Optimization Methods and Software (2011–2013)Associate Editor, Electronic Transactions Numerical Analysis (2011–2013)Selected PublicationsPolar deconvolution of mixed signalsZ. Fan, H. Jeong, B. Joshi, M. P. Friedlander. IEEE Trans. Signal Processing, 2022Online mirror descent and dual averaging: keeping pace in the dynamic caseH. Fang, N J. A. Harvey, V. S. Portella, M. P. Friedlander. J. Machine Learning Research, 2022Atomic decomposition via polar alignment: the geometry of structured optimizationZ. Fan, H. Jeong, Y. Sun, M. P. Friedlander. Foundations and Trends in Optimization, 3(4):280–366, 2020Polar convolutionM. P. Friedlander, I. Macêdo, T.K. Pong. SIAM J. Optimization, 29(2):1366–1391, 2019Low-rank spectral optimization via gauge dualityM. P. Friedlander, I. Macêdo. SIAM J. Scientific Computing, 38(3):A1616–A1638, 2016Gauge optimization and dualityM. P. Friedlander, I. Macêdo, T. K. Pong. SIAM J. Optimization, 24(4):1999–2022, 2014Probing the Pareto frontier for basis pursuit solutionsE. van den Berg, M. P. Friedlander. SIAM J. Scientific Computing, 31(2):890–912, 2008Exact regularization of convex programsM. P. Friedlander, P. Tseng. SIAM J. Optimization, 18(4):1326–1350, 2007A globally convergent linearly constrained Lagrangian method for nonlinear optimizationM. P. Friedlander, M. A. Saunders. SIAM J. Optimization 15(3):863–897, 2005",
  "content_length": 3143,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:45"
}