{
  "name": "Michael Meier 0001",
  "homepage": "https://net.cs.uni-bonn.de/wg/itsec/staff/leader/michael-meier",
  "status": "success",
  "content": "Informatik 4: Michael Meier Skip to the navigationSkip to the content | Login | Internal | Sitemap | Imprint Start pageNewsTeachingWork GroupsDepartmentResearchAdministration Current Page:Work GroupsIT SecurityStaffLeaderMichael Meier Prof. Dr. Michael Meier Professor Contact Phone: +49 228 73-54249 Fax: +49 228 73-54254 Email: mm@REMOVETHISPART.cs.uni-bonn.de PGP public key: 0x4DAFC5FB Visitor address: Institute of Computer Science 4Friedrich-Hirzebruch-Allee 8D-53115 BonnGermany Postal address: Friedrich-Hirzebruch-Allee 5 Room: 1.019 Office hours: by appointmentShort BiographyMichael Meier is full professor for IT-Security in the computer science department at University of Bonn and head of the Cyber Security Department at Fraunhofer FKIE. His research interests include most aspects of applied computer security, with an emphasis on attack and malware analysis as well as detection. From 1993 to 1998 Michael Meier studied computer science and earned his PhD in 2006 for his work on Intrusion Detection at Brandenburg University of Technology Cottbus. From 2006 he worked as Senior Researcher with the Information Systems and Security working group of the Technical University Dortmund before he became Professor in Bonn in 2012.Michael Meier is founder member and chair of the special interest group on Security – Intrusion Detection and Response (SIDAR) of the German Informatics Society and co-chairs the steering committee of the international conference on Detection of Intrusion & Malware and Vulnerability Assessment (DIMVA). He is executive board member of the German Association for Data Protection and Data Security (GDD).PublicationsConference and Journal PublicationsSelected Activities Bonner Dialog für Cybersicherheit Digital-Gipfel, Plattform \"Sicherheit, Schutz und Vertrauen für Gesellschaft und Wirtschaft\"Fokusgruppe 3 „Verschlüsselung“ - Krypto-ChartaFokusgruppe 4 \"Datenschutz\" - Leitlinien für eine rechtssichere Pseudonymisierung Steering Committee Co-Chair of the International Conference on Detection of Intrusion and Malware & Vulnerability Assessment (DIMVA) Chair of the Special Interest Group for Security - Incident Detection and Response (SIG SIDAR) of the German Informatics Society Executive Board Member of the German Association for Data Protection and Data Security (GDD) Member of the German Informatics Society (GI) Last changed on February 24, 2023. Contact: webmaster-4@REMOVETHISPART.cs.uni-bonn.de Universität Bonn / Informatik ( Abt. 1, 2, 3, 4, 5, 6 )",
  "content_length": 2510,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:39"
}