{
  "name": "Michael H. Böhlen",
  "homepage": "https://www.ifi.uzh.ch/en/dbtg/Staff/Boehlen.html",
  "status": "success",
  "content": "Prof. Dr. Michael Böhlen | Department of Informatics | UZH Skip navigation Prof. Dr. Michael Böhlen Affiliation I am the head of the database technology group at the Department of Informatics (ifi) at the University of Zürich. My research interests include various aspects of data management, and have focused on time-varying information, data warehousing, similarity search in databases, and data analysis. My work has a technological focus and includes the construction of data-centric systems, query processing, data modeling and query languages, and systems architectures. Before joining the University of Zürich I was employed at the computer science departments of the Free University of Bozen-Bolzano (2003-2009), Aalborg University (1995 - 2003), University of Arizona (1994 - 1995), and ETH Zürich (1990 - 1994). At the Free University of Bolzano I was the head of the Faculty of Computer Science from August 2003 until September 2007. I was a lecturer at the Engineering School in Grenchen, Switzerland (1990 - 1994). Scientific Services: I am serving as an associate editor for ACM TODS and for the VLDB Journal. I am a member of the Board of Trustees of the VLDB Endowment. I served as a PC area chair for Temporal, Spatial and Multimedia Data for ICDE 2010. I served as a reviewer for TODS, TKDE, TOIS, TOIT, IS, and DKE. I have served on the programme committees of VLDB (2007, 2005, 1999), SIGMOD (2009, 2004), ICDE (2009, 2008, 2005, 1998), EDBT (2009, 2008, 2000, 1998), SIGSPATIAL (2010, 2009), ADBIS (2007), BTW (2007), CIKM (2010, 2005), IDEAS (2004, 2003, 2002, 1999), TIME (2007, 2002, 2001), SSTD (2003), and WISE (2002, 2001). I am a member of ACM and IEEE CS. I have been a co-organizer of the 8th EDBT Summer School that was held at the Free University in Bolzano in September 2007. I was a co-organizer of a series on international workshops on visual data mining: 1st International Workshop on Visual Data Mining in conjunction with ECML/PKDD 2001, 2nd International Workshop on Visual Data Mining in conjunction with ECML/PKDD 2001, 3rd International Workshop on Visual Data Mining in conjunction with ICDM 2003. I am a co-editor of Visual Data Mining - Theory, Techniques and Tools for Visual Analytics, Springer 2008. I served on the PhD committees of Carme Martin (Barcelona 2006), Simonas Saltenis (Aalborg 2001), Giedrius Slivinskas (Aalborg 2001), and Torben Bach Pedersen (Aalborg 2000). Research Projects: Co-principal investigator of the MEDAN competence center for Medical Data Warehousing and Analysis. MEDAN is a four-year competence center in the Database and Information Systems group in the Faculty of Computer Science at the Free University of Bozen-Bolzano. The competence center closely collaborates with Hospital Meran to realize a data warehouse that forms the backbone of a data analysis platform that supports the development of value added services for the health district South Tyrol. The center's mission is to conduct basic and applied research in the area of data warehousing and intelligent data analysis for health care and medical applications. Member of TimeCenter, an international center for the support of temporal database applications on traditional and emerging DBMS technologies. One of the main goals of TimeCenter is to provide the foundations for developing temporal database technology that is expressly technology transferable. Principal investigator and scientist-in-charge of the 3D Visual Data Mining (3DVDM) project. The 3DVDM project was an interdisciplinary research project funded by the Danish research council. It included participants from the Department of Computer Science, the Department of Mathematical Sciences, the Faculty of Humanities, and the Department of Electronic Systems at Aalborg University. Co-investigator and site responsible for the COSPA project. COSPA is a consortium for studying, evaluating, and supporting the introduction of Open Source software and Open Data Standards in the Public Administration. COSPA was funded by the EU under the FP6 programme (IST-1-002614). Teaching A partial list of courses I am or have been teaching: Distributed Database Systems (Fall 2010), Nonstandard Database Systems (Fall 2009-10), Database Systems (Spring 2010), Seminar in Databases (Spring 2010), Data Structures and Algorithms (Spring 2004-8), Advanced Algorithms (Spring 2008), Data Warehousing and Data Mining (Fall 2004-8). I am supervising the following PhD students: Anton Dignös, Francesco Cafagna, Amr Noureldin, Claudio Jossen, Mourad Khayati, Christian Tilgner, Dietrich Christopeit. The following people completed their PhD theses under my supervision: Romans Kasperovics, Andrej Taliun, Nikolaus Augsten, Arturas Mazeika, Michael O. Akinde, Ole Guttorm Jensen, Linas Bukauskas. If you like to develop scalable algorithms for data-centric systems and if you are interested in a PhD position in the database system area please contact me. If you would like to pursue an internship, BSc or MSc thesis under my supervision please send me an email. Additional Information DBTG Research Projects Swiss Feed Database Qvestor Declarative Scheduling DBTG Research Approach The research approach of the database group has a technological focus and includes the construction of data-centric algorithms and systems. Our activities include the design and implementation of systems, algorithms, data structures and database languages, system-based experiments, and algorithmic complexity analysis. The emphasis is on theoretically sound results with a solid formal basis that solve actual real-world problems. We develop algorithms and systems to validate, communicate, and disseminate our research results.",
  "content_length": 5701,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:08"
}