{
  "name": "Michael Schapira",
  "homepage": "http://www.cs.huji.ac.il/~schapiram",
  "status": "success",
  "content": "Computer Science | ​Michael Schapira Home Page | Jerusalem top of pageWE EXPLORE THECommunication Mechanisms that Make the Internet TickHi! I'm MichaelI'm a professor of Computer Science at the Hebrew University of Jerusalem. My goal is to design practical (Inter)network architectures and protocols with provable guarantees (in terms of performance, security, incentive compatibility, and beyond).(How) Can The Internet Be Fixed?The demands of Internet services are steeply rising (high-resolution video, live communications, augmented/virtual reality, IoT, etc.). ​ Yet, the Internet's communication infrastructure is already struggling to provide reasonable user experience. ​ My research aims to devise principled and practical solutions to the performance and security problems plaguing the Internet. ​RESEARCH FOCI ​ Learning-Driven Networking ​ We leverage ideas and machinery from machine learning to devise data-driven alternatives for today's handcrafted network protocols (e.g., for routing, traffic management). ​ Securing the Internet ​ We design provably secure and practically deployable solutions for the alarming vulnerabilities of the Internet infrastructure (pertaining to routing, time synchronization, and more). ​ Next-Generation Network Protocols ​ We propose alternative algorithmic approaches to fundamental networking challenges such as routing, congestion control, traffic engineering, and more. ​ Next-Generation Networks ​ We explore new network architectures and designs to address the performance and scalability limitations of today's (e.g., datacenter) networks.DID YOU KNOW?​ Internet routing is the Internet’s biggest security hole.#1 Sending 100GB of data across the Internet from the US to Slovenia could take over a week to complete.#4 Even premium-tier subscribers of broadband Internet access view movies in HD less than 40% of the time.#2 Data centers have gone from 1000s to 100,000s of servers, but there is increasing concern that traditional network fabrics cannot keep up with the constant rise in traffic demands.#5 The time shown by your laptop/mobile device is set by synchronizing with servers across the Internet. Attackers can cause considerable damage by “shifting time”.#3“At another time, when caught in a swamp, Munchausen rescued himself and the horse by lifting them both up by his pigtail...” This is very much like bootstrapping new Internet architectures... Our Academic HomeContact Usbottom of page",
  "content_length": 2460,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:55"
}