{
  "name": "Michael Vollmer 0003",
  "homepage": "https://recurial.com",
  "status": "success",
  "content": "Michael Vollmer : Programming Languages, Computer Science About Me Hello! I’m a computer scientist who studies programming languages and compilers. I'm currently a Lecturer at the University of Kent. Previously, I completed my PhD at Indiana University under Prof. Ryan Newton. In addition to doing research and hacking on Scheme and Haskell code, I enjoy reading science fiction novels and watching B-movies. My CV is here. I'm also on Mastodon. Publications David Castro-Perez, Marco Paviotti, and Michael Vollmer. Program Optimisations via Hylomorphisms for Extraction of Executable Code. International Conference on Interactive Theorem Proving. (ITP 2025). [PDF] Jack Hughes, Michael Vollmer, and Mark Batty. Spegion: Implicit and Non-Lexical Regions with Sized Allocations. European Conference on Object-Oriented Programming (ECOOP 2025). [arxiv PDF] Arthur Jamet and Michael Vollmer. Type-safe and Portable Support for Packed Data. European Conference on Object-Oriented Programming (ECOOP 2025). [arxiv PDF] Vidush Singhal, Chaitanya Koparkar, Joseph Zullo, Artem Pelenitsyn, Michael Vollmer, Mike Rainey, Ryan Newton, Milind Kulkarni. Optimizing Layout of Recursive Datatypes with Marmoset. European Conference on Object-Oriented Programming (ECOOP 2024). [arxiv PDF] Chaitanya Koparkar, Vidush Singhal, Aditya Gupta, Mike Rainey, Michael Vollmer, Artem Pelenitsyn, Sam Tobin-Hochstadt, Milind Kulkarni, Ryan R. Newton. Garbage Collection for Mostly Serialized Heaps. International Symposium on Memory Management (ISMM 2024). [PDF] Sarah Harris, Simon Cooksey, Michael Vollmer, Mark Batty. Rust for Morello: Always-On Memory Safety, Even in Unsafe Code. European Conference on Object Oriented Programming (ECOOP 2023). [PDF] Daniel Marshall, Michael Vollmer, Dominic Orchard. Linearity and Uniqueness: An Entente Cordiale. European Symposium on Programming (ESOP 2022). [PDF] Chaitanya Koparkar, Mike Rainey, Michael Vollmer, Milind Kulkarni, and Ryan R. Newton. Efficient Tree-traversals: Reconciling Parallelism and Dense Data Representations. International Conference on Functional Programming (ICFP 2021). [PDF] Michael Vollmer. A Language-based Approach to Programming with Serialized Data. (Dissertation 2021) [PDF] Jack Hughes, Michael Vollmer, Dominic Orchard. Deriving Distributive Laws for Graded Linear Types. Workshop on Linearity & Trends in Linear Logic and Applications (Linearity&TLLA 2020). [PDF] Michael Vollmer, Chaitanya Koparkar, Mike Rainey, Laith Sakka, Milind Kulkarni, and Ryan R. Newton. LoCal: A Language for Programs Operating on Serialized Data. Programming Language Design and Implementation (PLDI 2019). [PDF] Michael Vollmer, Sarah Spall, Buddhika Chamith, Laith Sakka, Milind Kulkarni, Sam Tobin-Hochstadt, and Ryan R. Newton. Compiling Tree Transforms to Operate on Packed Representations. European Conference on Object-Oriented Programming (ECOOP 2017). [PDF] Michael Vollmer, Ryan G. Scott, Madanlal Musuvathi, and Ryan R. Newton. SC-Haskell: Sequential Consistency in Languages That Minimize Mutable Shared Heap. Principles and Practice of Parallel Programming (PPoPP 2017). [PDF] Michael Vollmer, Bo Joel Svensson, Eric Holk, and Ryan R. Newton. Meta-programming and Auto-tuning in the Search for High Performance GPU Code. Workshop on Functional High-Performance Computing (FHPC 2015). [PDF] Bo Joel Svensson, Michael Vollmer, Eric Holk, Trevor L. McDonell, and Ryan R. Newton. Converting Data-parallelism to Task-parallelism by Rewrites: Purely Functional Programs Across Multiple GPUs. Workshop on Functional High-Performance Computing (FHPC 2015). [PDF]",
  "content_length": 3603,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:01"
}