{
  "name": "Michael C. Huang 0001",
  "homepage": "http://www.ece.rochester.edu/~mihuang",
  "status": "success",
  "content": "Home - Michael Huang Professor of Electrical and Computer Engineering Professor of Computer Science Professor of Goergen Institute for Data Science and Artificial Intelligence PhD, University of Illinois at Urbana-Champaign, 2002 414 Computer Studies Building(585) 275-2111michael.huang@rochester.edu Bio Michael Huang received the BS degree in computer science and engineering from Tsinghua University, Beijing, in 1994, the MS and the PhD degree in computer science from University of Illinois at Urbana-Champaign in 1999 and 2002, respectively. From 1994 to 1997, he was a lead architect in building a 32-processor hierarchical shared-memory multiprocessor research prototype. He joined the faculty of the Electrical and Computer Engineering department in 2002. In 2010, he was at IBM T. J. Watson Research Center working on future POWER processor concept development. His research interests include various aspects of high-performance computer architecture such as processor microarchitecture, communication and memory substrate, reliability, and energy-efficient and complexity-effective design. His recent emphasis is in exploiting physics-based computing. He is a recipient of the NSF CAREER award, an IBM Faculty Award, a member of the “Hall of Fame” of ISCA and HPCA, and a member of the IEEE and the ACM. Research Increasing reliance on computing as a means of scientific exploration demands ever higher speed, reliability, and efficiency from high-performance systems. Achieving sustained gain in all these metrics requires continued innovation in processor microarchitecture, the communication and coherency substrate, and the underlying device technology. Such innovation builds upon concrete understanding of the interaction of these components. Our research spans these components and focuses on delivering practical, complexity-effective solutions. In addition to architectural exploration, we are also investigating how to leverage new technologies and circuit techniques. For example, we are investigating the use of optics as well as mixed-signal circuits to design physics-based non-von Neumann computings systems such as Ising machines. Representative recent publications: (full list) PRApplied’25: “General oscillator-based Ising-machine models with phase-amplitude dynamics and polynomial interactions”, L. Sun, M. Burns, and M. Huang, Phys. Rev. Applied 24, 044035, Oct. 2025 ISCA’22: “Increasing Ising Machine Capacity with Multi-Chip Architectures”, Anshujit Sharma, Richard Afoakwa, Zeljko Ignjatovic, and Michael Huang, in Proc. of the 49th Int’l Symposium on Computer Architecture, June 2022 HPCA’21: “BRIM: Bistable Resistively-Coupled Ising Machine”, Richard Afoakwa, Yiqiao Zhang, Uday Kumar Reddy Vengalam, Zeljko Ignjatovic, and Michael Huang, in Proc. of the 27th Int’l Symposium on High-Performance Computer Architecture, Feb. 2021",
  "content_length": 2867,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:55"
}