{
  "name": "Michael Thuné",
  "homepage": "https://katalog.uu.se/empinfo/?id=AA336",
  "status": "success",
  "content": "Michael Thuné - Uppsala universitet Michael Thuné Professor emeritus vid Institutionen för informationsteknologi; Beräkningsvetenskap Besöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Michael Thuné vid Institutionen för informationsteknologi; Beräkningsvetenskap Akademiska meriter: FD Kort presentation Professor i beräkningsvetenskap, med särskilt intresse för datavetenskapliga aspekter på ämnet, exempelvis frågeställningar kring implementering av beräkningsalgoritmer på parallelldatorer; även engagerad i utbildningsfrågor och ämnesdidaktisk forskning. Biografi Min beräkningsvetenskapliga forskning har fokuserat på frågeställningar kring programvaruarkitektur för numerisk programvara och effektiv implementering av beräkningsalgoritmer. På senare år har jag även ägnat mig åt ämnesdidaktisk forskning. Publikationer Senaste publikationer Students' learning process in the computer laboratory Eckerdal, Anna; Berglund, Anders; Thuné, Michael Ingår i 2022 IEEE Frontiers in Education Conference (FIE), 2022 DOI för Students' learning process in the computer laboratory Learning to program hands-on: a controlled study von Hausswolff, Kristina; Eckerdal, Anna; Thuné, Michael Ingår i Proceedings of the 20th Koli Calling International Conference on Computing Education Research November 2020 November 2020, s. 1-10, 2020 DOI för Learning to program hands-on: a controlled study Analysis of students’ learning of computer programming in a computer laboratory context Thuné, Michael; Eckerdal, Anna Ingår i European Journal of Engineering Education, s. 769-786, 2019 DOI för Analysis of students’ learning of computer programming in a computer laboratory context Från informationsbehandling till informationsteknologi: Institutionen för informationsteknologi söker sina rötter Sjöberg, Anders; Lundell, Lotta; Thuné, Michael Acta Universitatis Upsaliensis, 2015 Ladda ner fulltext (pdf) av Från informationsbehandling till informationsteknologi: Institutionen för informationsteknologi söker sina rötter Analysing the enacted object of learning in lab assignments in programming education Eckerdal, Anna; Thuné, Michael Ingår i Proc. 1st International Conference on Learning and Teaching in Computing and Engineering, s. 208-211, 2013 DOI för Analysing the enacted object of learning in lab assignments in programming education Ladda ner fulltext (pdf) av Analysing the enacted object of learning in lab assignments in programming education Alla publikationer Artiklar i tidskrift Analysis of students’ learning of computer programming in a computer laboratory context Thuné, Michael; Eckerdal, Anna Ingår i European Journal of Engineering Education, s. 769-786, 2019 DOI för Analysis of students’ learning of computer programming in a computer laboratory context Gender-aware course reform in Scientific Computing Larsson, Elisabeth; Pålsson, Stefan; Rantakokko, Jarmo; von Sydow, Lina et al. Ingår i International journal of engineering education, s. 403-414, 2013 Variation theory applied to students' conceptions of computer programming Thuné, Michael; Eckerdal, Anna Ingår i European Journal of Engineering Education, s. 339-347, 2009 DOI för Variation theory applied to students' conceptions of computer programming OpenMP versus MPI for PDE solvers based on regular sparse numerical operators Nordén, Markus; Holmgren, Sverker; Thuné, Michael Ingår i Future Generation Computer Systems, s. 194-203, 2006 DOI för OpenMP versus MPI for PDE solvers based on regular sparse numerical operators Design and usability of a PDE solver framework for curvilinear coordinates Ljungberg, Malin; Otto, Kurt; Thuné, Michael Ingår i Advances in Engineering Software, s. 814-825, 2006 DOI för Design and usability of a PDE solver framework for curvilinear coordinates Novice Java Programmers' Conceptions of \"Object\" and \"Class\", and Variation Theory Eckerdal, Anna; Thuné, Michael Ingår i SIGCSE Bulletin inroads, s. 89-93, 2005 DOI för Novice Java Programmers' Conceptions of \"Object\" and \"Class\", and Variation Theory Partitioning strategies for composite grids Thuné, Michael Ingår i Parallel Algorithms and Applications, s. 325-348, 1997 DOI för Partitioning strategies for composite grids Object-oriented software tools for the construction of preconditioners Mossberg, Eva; Otto, Kurt; Thuné, Michael Ingår i Scientific Programming, s. 285-295, 1997 Object-oriented software tools for parallel PDE solvers Thuné, Michael Ingår i Wuhan University Journal of Natural Sciences, s. 420-429, 1996 DOI för Object-oriented software tools for parallel PDE solvers Framtidens superdator: Tusentals enkla datorer i samverkan Gustafsson, Bertil; Thuné, Michael Ingår i Forskning & Framsteg, s. 4-9, 1994 A partitioning algorithm for composite grids Thuné, Michael Ingår i Parallel Algorithms and Applications, s. 69-81, 1993 DOI för A partitioning algorithm for composite grids The partitioning problem for a class of data parallel algorithms Thuné, Michael Ingår i Parallel Computing, s. 867-878, 1992 DOI för The partitioning problem for a class of data parallel algorithms Straightforward partitioning of composite grids for explicit difference methods Thuné, Michael Ingår i Parallel Computing, s. 665-672, 1991 DOI för Straightforward partitioning of composite grids for explicit difference methods A partitioning strategy for explicit difference methods Thuné, Michael Ingår i Parallel Computing, s. 147-154, 1990 DOI för A partitioning strategy for explicit difference methods A numerical algorithm for stability analysis of difference methods for hyperbolic systems Thuné, Michael Ingår i SIAM Journal on Scientific and Statistical Computing, s. 63-81, 1990 DOI för A numerical algorithm for stability analysis of difference methods for hyperbolic systems Stability of a Runge–Kutta method for the Euler equations on a substructured domain Otto, Kurt; Thuné, Michael Ingår i SIAM Journal on Scientific and Statistical Computing, s. 154-174, 1989 DOI för Stability of a Runge–Kutta method for the Euler equations on a substructured domain Automatic GKS stability analysis Thuné, Michael Ingår i SIAM Journal on Scientific and Statistical Computing, s. 959-977, 1986 DOI för Automatic GKS stability analysis Kapitel i böcker, delar av antologi Parallel Structured Adaptive Mesh Refinement Rantakokko, Jarmo; Thuné, Michael Ingår i Parallel Computing, s. 147-173, Springer-Verlag, 2009 DOI för Parallel Structured Adaptive Mesh Refinement Object-Oriented Construction of Parallel PDE Solvers Thuné, Michael; Mossberg, Eva; Olsson, Peter; Rantakokko, Jarmo et al. Ingår i Modern Software Tools for Scientific Computing, s. 203-226, Birkhäuser, 1997 Konferensbidrag Students' learning process in the computer laboratory Eckerdal, Anna; Berglund, Anders; Thuné, Michael Ingår i 2022 IEEE Frontiers in Education Conference (FIE), 2022 DOI för Students' learning process in the computer laboratory Learning to program hands-on: a controlled study von Hausswolff, Kristina; Eckerdal, Anna; Thuné, Michael Ingår i Proceedings of the 20th Koli Calling International Conference on Computing Education Research November 2020 November 2020, s. 1-10, 2020 DOI för Learning to program hands-on: a controlled study Analysing the enacted object of learning in lab assignments in programming education Eckerdal, Anna; Thuné, Michael Ingår i Proc. 1st International Conference on Learning and Teaching in Computing and Engineering, s. 208-211, 2013 DOI för Analysing the enacted object of learning in lab assignments in programming education Ladda ner fulltext (pdf) av Analysing the enacted object of learning in lab assignments in programming education OpenMP versus MPI for PDE solvers based on regular sparse numerical operators Nordén, Markus; Holmgren, Sverker; Thuné, Michael Ingår i Computational Science – ICCS 2002, s. 681-690, 2002 A comparison of partitioning schemes for blockwise parallel SAMR algorithms Steensland, Johan; Söderberg, Stefan; Thuné, Michael Ingår i Applied Parallel Computing, s. 160-169, 2001 DOI för A comparison of partitioning schemes for blockwise parallel SAMR algorithms Mixed C++/Fortran 90 implementation of parallel flow solvers Ljungberg, Malin; Thuné, Michael Ingår i Parallel Computational Fluid Dynamics, s. 233-240, 2001 DOI för Mixed C++/Fortran 90 implementation of parallel flow solvers Object-oriented modeling of parallel PDE solvers Thuné, Michael; Åhlander, Krister; Ljungberg, Malin; Nordén, Markus et al. Ingår i The Architecture of Scientific Software, s. 159-174, 2001 Optimal parameter values for a parallel structured adaptive mesh refinement algorithm Thuné, Michael; Söderberg, Stefan Ingår i Applied Parallel Computing, s. 177-186, 2001 DOI för Optimal parameter values for a parallel structured adaptive mesh refinement algorithm Characterization of domain-based partitioners for parallel SAMR applications Steensland, Johan; Thuné, Michael; Chandra, Sumir; Parashar, Manish Ingår i Proc. Parallel and Distributed Computing and Systems, s. 425-430, 2000 Software tools for parallel CFD on composite grids Olsson, Peter; Rantakokko, Jarmo; Thuné, Michael Ingår i Parallel Computational Fluid Dynamics, s. 725-732, 1996 DOI för Software tools for parallel CFD on composite grids Towards an expressive language for PDE solvers Thuné, Michael; Åhlander, Krister Ingår i Programming Languages and Systems, s. 373-386, 1996 DOI för Towards an expressive language for PDE solvers Portability and data structures in scientific computing: Object-oriented design of utility routines in Fortran Högström, Kjell; Thuné, Michael Ingår i Parallel Computing, s. 585-588, 1992 Partition shapes for explicit difference methods: slices vs rectangles Thuné, Michael Ingår i Hypercube and Distributed Computers, s. 383-384, 1989 A software package for stability analysis of difference methods Thuné, Michael Ingår i PDE Software, s. 89-102, 1984 Proceedings (redaktörskap) Software Issues in Computational Science and Engine",
  "content_length": 10701,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:01"
}