{
  "name": "Michael D. Grossberg",
  "homepage": "https://www.ccny.cuny.edu/profiles/michael-grossberg",
  "status": "success",
  "content": "Michael Grossberg | The City College of New York Skip to main content > Home / Faculty and Staff Profiles / Michael Grossberg Michael Grossberg Associate Professor Co-Director of the Data Science and Engineering Master's Program (phishing alert: Not currently advertising for RA position. Beware of scam.) Main Affiliation Computer Science Additional Departments/Affiliated Programs CUNY-CREST Institute\t\t\t\tComputer Engineering Areas of Expertise/Research Computer Vision Data Science Data Visualization Machine Learning Web Development Building North Academic Center Office 7/311 Phone (212) 650-6166 Fax (212) 650-5768 Email mgrossberg@ccny.cuny.edu Website http://www-cs.ccny.cuny.edu/~grossberg/index.html Michael Grossberg Profile Michael D. Grossberg is an Associate Professor of Computer Science at City College, City University of New York. He works applying machine learning and visualization techniques to science problems, particularly in problems in medical imaging, remote sensing, and climate data analysis. He works with collaborators at the NOAA-CREST center and Memorial-Sloan Kettering Cancer Center. Before coming to CCNY, he spent four years as a Research Scientist with the Columbia Automated Vision Environment (CAVE), at Columbia University. He received his PhD in Mathematics from the Massachusetts Institute of Technology in 1991. His research in computer vision has included topics in the geometric and photometric modeling of cameras, and analyzing features for indexing. Dr. Grossberg was a Lecturer in the Computer Science Department at Columbia University. He was also a Ritt Assistant Professor of Mathematics at Columbia University. He has held postdoctoral fellowships at the Max Plank Institute for Mathematics in Bonn, and Hebrew University in Jerusalem. He has authored and coauthored papers that have appeared in ICCV, ECCV, CVPR. He has filed several U.S. and international patents for inventions related to computer vision. Education Ph.D MIT BA. U of Pennsylvania Courses Taught DSE I1020 Introduction to Data Science DSE I2100 Applied Machine Learning and Data Mining CSC 59969 Data Visualization CSC 47300 Web Development G 2010 MIS Software Engineering and Object Oriented Design I 43300 Advanced Topics in Internet Programming (web services) CSC 59866/7 Senior Design (Data Visualization) CSC 47100: Computer Vision CSC 32200: Software Engineering CSC 10200: Introduction to Computing (C/C++/Python) Research Interests Data Visualization, Computer Vision, Graphics, and Machine Learning. Publications Aizenmann, H., M. Grossberg, I. Gladkova, and N. Krakauer. 2015. “Toolbox for Evaluating Ensembles Using an Information Gain Measure.” AMS Annual Meeting, Phoenix. Hu, Y, M Grossberg, and G Mageras. 2015. “SU-d-BRA-03: What Image Features Are Useful for Tumor Segmentation in Multi-Modal Images?” Medical Physics 42 (6). American Association of Physicists in Medicine: 3213–3. Tessler, Z., C. Vörösmarty, M. Grossberg, I. Gladkova, H. Aizenman, J. Syvitski, and E. Foufoula-Georgiou. 2015. “Profiling Risk and Sustainability in Coastal Deltas of the World.” Science 349 (6248). American Association for the Advancement of Science: 638–43. Hu, Y, M Grossberg, and G Mageras. 2014. “Tumor Segmentation with Multi-Modality Image in Conditional Random Field Framework with Logistic Regression Models.” In Engineering in Medicine and Biology Society (EMBC), 2014 36th Annual International Conference of the IEEE, 6450–4. IEEE. Cross, J., I. Gladkova, W Paul Menzel, A. Heidinger, and M. D. Grossberg. 2013. “Statistical Estimation of a 13.3 μM Visible Infrared Imaging Radiometer Suite Channel Using Multisensor Data Fusion.” Journal of Applied Remote Sensing 7 (1). International Society for Optics; Photonics: 073473–3. Gladkova, I., J. Cross, P. Menzel, A. Heidinger, and M. Grossberg. 2013. “Statistical Estimation of a 13.3 Micron Channel for VIIRS Using Multisensor Data Fusion with Application to Cloud-Top Pressure Estimation.” Proc. AMS 29th Conference on Environmental Information Processing Technologies, Austin, TX Gladkova, I., M. Grossberg, G. Bonev, P. Romanov, G. Riggs, and D. Hall. 2013. “A Full Snow Season in Yellowstone: A Database of Restored Aqua Band 6.” Geoscience and Remote Sensing Letters, IEEE 10 (3). IEEE: 553–57. Gladkova, I., F. Shahriar, M. Grossberg, R. Frey, and W. P. Menzel. 2013. “Impact of the Aqua MODIS Band 6 Restoration on Cloud/Snow Discrimination.” Journal of Atmospheric and Oceanic Technology 30 (12): 2712–9. Krakauer, N., M. Grossberg, I. Gladkova, and H. Aizenman. 2013. “Information Content of Seasonal Forecasts in a Changing Climate.” Advances in Meteorology 2013. Hindawi Publishing Corporation: 12. Tessler, Z., C. Vörösmarty, K. McDonald, R. Schroeder, M. Grossberg, I. Gladkova, and H. Aizenman. 2013. “A Global Deltas Typology of Environmental Stress and Its Relation to Terrestrial Hydrology.” AGU Fall Meeting Abstracts 1: 02. Aizenman, H., M. Grossberg, D. Jones, N. Barnes, J. Smerdon, K. Anchukaitis, and Julien E. Geay. 2012. “Web Based Visualization Tool for Climate Data Using Python.” 92nd AMS Annual Meeting, Second Symposium on Advances in Modeling and Analysis Using Python. Gladkova, I., M. Grossberg, G. Bonev, P. Romanov, and F. Shahriar. 2012. “Increasing the Accuracy of MODIS/Aqua Snow Product Using Quantitative Image Restoration Technique.” Geoscience and Remote Sensing Letters, IEEE 9 (4). IEEE: 740–43. Gladkova, I., M. Grossberg, F. Shahriar, G. Bonev, and P. Romanov. 2012. “Quantitative Restoration for MODIS Band 6 on Aqua.” Geoscience and Remote Sensing, IEEE Transactions on 50 (6). IEEE: 2409–16. Hu, Y., A. Grossberg M.and Wu, Na. Riaz, C. Perez, and G. Mageras. 2012. “Interactive Semiautomatic Contour Delineation Using Statistical Conditional Random Fields Framework.” Medical Physics 39 (7). American Association of Physicists in Medicine: 4547–58. Grossberg, M., J. Gabaldon, P. Alabi, J. Neiman, and I. Gladkova. 2011. “Graphyte Software for Integrated Remote Sensing Research Using HPCC.” In SPIE Optical Engineering+ Applications, 81531F–81531F. International Society for Optics; Photonics Gladkova, I., M. Grossberg, G. Bonev, and F. Shahriar. 2011. “A Multiband Statistical Restoration of the Aqua MODIS 1.6 Micron Band.” In SPIE Defense, Security, and Sensing, 804819–9. International Society for Optics; Photonics. Gladkova, I., F. Shahriar, M. Grossberg, G. Bonev, D. Hillger, and S. Miller. 2011. “Virtual Green Band for GOES-R.” In SPIE Optical Engineering+ Applications, 81531C–81531C. International Society for Optics; Photonics. Grossberg, M., F. Shahriar, I. Gladkova, P. Alabi, D. Hillger, and S. Miller. 2011. “Estimating True Color Imagery for GOES-R.” In SPIE Defense, Security, and Sensing, 80481A–80481A. International Society for Optics; Photonics. Hu, Y, M Grossberg, and G Mageras.  2011. “TH-a-220-07: Semi-Automatic Multi-Modality Image Segmentation for Normal Organ Delineation in Head & Neck Radiation Treatment Planning.” Medical Physics 38 (6). American Association of Physicists in Medicine: 3847–7. Nayar, S., G. Krishnan, M. Grossberg, and R. Raskar. 2011. “Visual Chatter in the Real World.” In Robotics Research, 13–24. Springer Berlin Heidelberg Ahmed, S, R Amin, I Gladkova, A Gilerson, M Grossberg, S Hlaing, F Shariar, and P Alabi. 2010. “Characterizing Bio-Optical and Ecological Features of Algal Bloom Waters for Detection and Tracking from Space.” In SPIE Defense, Security, and Sensing, 767804–4. International Society for Optics; Photonics. Bonev, G, I Gladkova, and M. Grossberg. 2010. “Increasing the Accuracy of MODIS Snow Product Using Quantitative Restoration for MODIS Band 6 on Aqua.” AGU Fall Meeting Abstracts 1: 1343. Gladkova, I., M. Grossberg, and F. Shahriar. 2010. “Quantitative Image Restoration.” In SPIE Defense, Security, and Sensing, 769519–9. International Society for Optics; Photonics. Hu, Y, M Grossberg, and G Mageras.  2010. “Fast Graph-Based Medical Image Segmentation with Expert Guided Statistical Information.” In Information Technology and Applications in Biomedicine (ITAB), 2010 10th IEEE International Conference on, 1–5. IEEE Gladkova, I., M. Grossberg, S. Gottipati, F. Shahriar, and G. Bonev. 2009. “Error Mitigation for CCSD Compressed Imager Data.” In SPIE Optical Engineering+ Applications, 744408–8. International Society for Optics; Photonics. Grossberg, M., I. Gladkova, I. Guch, P. Alabi, F. Shahriar, G. Bonev, and H. Aizenman. 2009. “Rich Client Data Exploration and Research Prototyping for NOAA.” In SPIE Optical Engineering+ Applications, 74560C–74560C. International Society for Optics; Photonics. Grossberg, M., S. Gottipati, I. Gladkova, M. Rabinowitz, P. Alabi, T. George, and A. Pacheco. 2009. “A Comparative Study of Lossless Compression Algorithms on Multispectral Imager Data.” In SPIE Defense, Security, and Sensing, 733408–8. International Society for Optics; Photonics. Hu, Y, M Grossberg, and G Mageras. 2009.  “Survey of Recent Volumetric Medical Image Segmentation Techniques.” In Biomedical Engineering, edited by Carlos Alexandre Barros de Mello, 321–46. Rijeka, Croatia: InTech. Said, E., A. Homaifar, and M. Grossberg. 2009. “Creating Virtual Sensors Using Learning Based Super Resolution and Data Fusion.” In Aerospace Conference, 2009 IEEE, 1–9. IEEE. Hu, Y., M. Grossberg, and G. Mageras. 2008. “Semi-Automatic Medical Image Segmentation with Adaptive Local Statistics in Conditional Random Fields Framework.” In Engineering in Medicine and Biology Society, 2008. EMBS 2008. 30th Annual International Conference of the IEEE, 3099–3102. IEEE. Yu, G., M. Grossberg, G. Wolberg, and I. Stamos. 2008. “Think Globally, Cluster Locally: A Unified Framework for Range Segmentation.” Proceedings of the 4th International Symposium on 3D Data Processing, Visualization and Transmission (3DPVT’08), Atlanta, USA. Gladkova, I, S Gottipati, and M Grossberg. 2007. “A New Lossless Compression Algorithm for Satellite Earth Science Multi-Spectral Imagers”, Proceedin",
  "content_length": 17681,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:50"
}