{
  "name": "Michael Jason Minock",
  "homepage": "https://www.umu.se/en/staff/michael-minock",
  "status": "success",
  "content": "Michael Minock Michael Minock Research Interests: Natural Language Interfaces, Knowledge Representation and Databases. Teaching Interests: Databases and LLMs. Contact E-mail michael.minock@umu.se Works as Affiliation Associate professor at Department of Computing Science Location MIT-huset, Umeå universitet, MIT.D.426 Umeå universitet, 901 87 Umeå Presentation Presentation Publications Publications Mentions Mentions Teaching Interests 5DV202: Introduction to Database Management5TD004: LLMs for IT Practitioners5DV242: LLMs in Data Management5DV247: Database Systems and Applications Research Interests I have long worked at the boundary between AI and relational databases, in particular within cooperative query answering, explanation, information integration and natural language interfaces. Earlier I completed a VR project (2015-04953) investigating semantic tractability and deduction in natural language interfaces to databases (2016-2019). I also coordinated the EU STREP SpaceBook that involved both spatial databases and speech-based interfaces (2011-2014). Relational databases have always impressed me because they have proven their usefulness in the real world and, at the same time, are rooted in logic. And if one takes full database query languages (e.g. those performing counts and other aggregation operations), then it is not merely first-order logic, but  higher-order logic. My current research focuses on using logical properties of query languages to facilitate the construction and learning of natural language interfaces to databases. I am also interested in how LLMs can contribute to these topics. Most of my publications may be downloaded. Just click on them under \"Publications\" and then go to \"Open Access in DiVA\" in the upper right corner and you should be able to download a pdf. Start-up I also work part time at my start-up C-Phrase Technologies AB (see here). Work at this startup has given me new experiences in a wide variety of domains - from crypto to commodity markets, from medical planning to roofing. Contact Contact via email is always the best way. 2021 Evaluating an automata approach to query containment Proceedings of the 13th International Conference on Finite State Methods and Natural Language Processing, FSMNLP 2017, Association for Computational Linguistics (ACL) 2021 : 75-79 Minock, Michael J 2017 Evaluating an Automata Approach to Query Containment Proceedings of the 13th International Conference on Finite State Methods and Natural Language Processing (FSMNLP) : 75-79 Minock, Michael 2017 COVER: Covering the Semantically Tractable Question Proceedings of the Software Demonstrations of the 15th Conference of the European Chapter of the Association for Computational Linguistics (EACL), 2017: Demonstration session : 1-4 Minock, Michael 2017 Cover: covering the semantically tractable questions 15th Conference of the European Chapter of the Association for Computational Linguistics, EACL 2017 - Proceedings of the Software Demonstrations, Association for Computational Linguistics 2017 : 1-4 Minock, Michael J 2016 Using HOL Light to Reason over Second-Order MRLs The Sixth Swedish Language Technology Conference (SLTC) Umeå University, 17-18 November, 2016 Minock, Michael 2015 Enterprise architecture with executable modelling rules: A case study at the Swedish Defence Materiel Administration Advanced Information Systems Engineering Workshops, CAiSE 2015, Springer 2015 : 339-350 Cohen, Mika; Minock, Michael; Oskarsson, Daniel; et al. 2015 Natural Language Specification and Violation Reporting of Business Rules over ER-modeled Databases Proceedings of the 18th International Conference on Extending Database Technology, EDBT 2015, OpenProceedings.org, University of Konstanz, University Library 2015 : 541-544 Cohen, Mika; Minock, Michael; Oskarsson, Daniel; et al. 2014 In Pursuit of Decidable 'Logical Form' The Fifth Swedish Language Technology Conference, 13-14 November 2014, Uppsala Minock, Michael 2014 Does TTS-based pedestrian navigation work? Minock, Michael; Mollevik, Johan; Åsander, Mattias 2013 Context-dependent 'near' and 'far' in spatial databases via supervaluation Data & Knowledge Engineering, Vol. 86 : 295-305 Minock, Michael; Mollevik, Johan 2013 Prediction and scheduling in navigation systems Proceedings of the GeoHCI Workshop: in conjunctionwith ACM CHI 2013 : 30-32 Minock, Michael; Mollevik, Johan 2013 A test-bed for text-to-speech-based pedestrian navigation systems Natural Language Processing and Information Systems: 18th International Conference on Applications of Natural Language to Information Systems, NLDB 2013, Salford, UK, June 19-21, 2013. Proceedings, Springer Berlin/Heidelberg 2013 : 396-399 Minock, Michael; Mollevik, Johan; Åsander, Mattias; et al. 2012 Toward an active database platform for guiding urban pedestrians UMINF, 12.18 Minock, Michael; Mollevik, Johan; Åsander, Mattias 2011 A natural language interface over the MusicBrainz database Proceedings of the 1st workshop on Question Answering over Linked Data (QALD-1) : 38-43 Granberg, Johan; Minock, Michael 2010 Natural language interfaces: what's the problem? -a data-driven quantitative analysis Natural language processing and information systems: 14th International Conference on Applications of Natural Language to Information Systems, NLDB 2009, Springer Berlin/Heidelberg 2010 : 192-206 Cimiano, Philipp; Minock, Michael 2010 Vague relations in spatial databases Natural language processing and information systems: 15th international conference on applications of natural language to information systems, NLDB 2010 : 177-187 Minock, Michael 2010 C-Phrase: a system for building robust natural language interfaces to databases Data & Knowledge Engineering, Vol. 69, (3) : 290-302 Minock, Michael 2010 Describing and deriving certain answers over partial databases Journal of Intelligent Information Systems, Springer Netherlands 2010, Vol. 35, (2) : 245-260 Minock, Michael 2010 Vague relations in spatial databases Natural language processing and information systems : 177-187 Minock, Michael J 2009 Discernability and preference in interactive option searches Swedish Artificial Intelligence Society (SAIS) : 21-26 Minock, Michael 2008 Towards Building Robust Natural Language Interfaces to Databases 13th International Conference on Applications of Natural Language to Information Systems (NLDB-2008) : 12- Minock, Michael; Olofsson, Peter; Näslund, Alexander 2007 A STEP Towards Realizing Codd's Vision of Rendezvous with the Casual User 33rd International Conference on Very Large Databases (VLDB-2007) : - Minock, Michael 2006 Modular Generation of Relational Query Paraphrases Research on Language and Computation: Formal Issues in Natural Language Generation, Vol. 4, (1) : 28- Minock, Michael 2006 Natural Language Updates to Databases through Dialogue 11th International Conference on Applications of Natural Language to Information Systems (NLDB-2006) : 6- Minock, Michael 2006 Proceedings of SAIS 2006: The 23rd Annunual Workshop of the Swedish Artificial Intelligence Society Report / UMINF, 06.19 Minock, Michael; Eklund, Patrik; Lindgren, Helena 2005 Where are the 'Killer Applications' of Restricted Domain Question Answering? in proceedings of Knowledge and Reasoning in Question Answering (KRAQ-2005) : - Minock, Michael 2005 A Phrasal Approach to Natural Language Interfaces over Databases Minock, Michael 2004 Managing Database Incompleteness with the Guarded Fragment Workshop on Guarded Logics, European Summer School in Logic Language and Information (ESSLLI-04) : - Minock, Michael 2003 Knowledge Representation using Schema Tuple Queries Knowledge Representation Meets Databases (KRDB-03) : - Minock, Michael 2003 A phrasal generator for describing relational database queries Minock, Michael 2002 Z-log: Applying system-Z Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Springer 2002 : 545-548 Minock, Michael J; Kraus, Hansi View publications in DiVA Published: 26 Sep, 2024 New Large Language Models course addresses increasing skills needs Published: 20 Feb, 2024 Large Language models for efficient data management - new summer course! + Show more - Show less",
  "content_length": 8268,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:22"
}