{
  "name": "Michael Rohs",
  "homepage": "https://hci.uni-hannover.de/people/michael",
  "status": "success",
  "content": "Prof. Dr. Michael Rohs – Institut für Praktische Informatik – Leibniz Universität Hannover Prof. Dr. Michael Rohs – Institut für Praktische Informatik – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik Start Kontakt Institut für Praktische Informatik Fachgebiet Mensch-Computer-Interaktion Personenverzeichnis Prof. Dr. Michael Rohs Prof. Dr. Michael Rohs Prof. Dr. Michael Rohs Telefon +49 511 762 2435 E-Mail michael.rohshci.uni-hannover.de Adresse Appelstr. 9A 30167 Hannover Gebäude 3408 Raum 906 Prof. Dr. Michael Rohs Telefon +49 511 762 2435 E-Mail michael.rohshci.uni-hannover.de Adresse Appelstr. 9A 30167 Hannover Gebäude 3408 Raum 906 Funktionen Vorsitz Prüfungsausschuss Informatik Geschäftsführung Fachgebiet Mensch-Computer-Interaktion Vertretung der Professorinnen und Professoren Fakultätsrat der Fakultät für Elektrotechnik und Informatik Vertretung der Professorinnen und Professoren Studienkommission Informatik Professorinnen und Professoren Fachgebiet Mensch-Computer-Interaktion Meine Forschungsinteressen liegen in den Bereichen mobile Mensch-Computer Interaktion, mobile interaktive Medien und Pervasive Computing. Meine Arbeit erstreckt sich über neue Interaktionstechniken für mobile Geräte, den Einsatz von Bildverarbeitungsmethoden und die Verwendung von Sensorik für mobile Interaktionen, sowie die Integration von physischen und virtuellen Ressourcen in der Umgebung des Benutzers. Publikationen Akademischer Verlauf 1994 -2000 Studium der Informatik an der Technischen Universität Darmstadt und der University of Colorado at Boulder 2000 -2005 Doktorand und Assistent an der ETH Zürich 2005 Promotion (Dr. sc. ETH Zürich) 2005 -2010 Senior Research Scientist bei den Deutsche Telekom Laboratories, einem An-Institut der Technischen Universität Berlin; Lehraufträge an der TU Berlin für verschiedene Vorlesungen und Seminare 2007 -2008 Vertretungsprofessur für User Interface Engineering am Bonn-Aachen International Center for Information Technology (B-IT), Universität Bonn und Fraunhofer IAIS 2010 -2012 Juniorprofessor für Medieninformatik an der Ludwig-Maximilians-Universität München seit 1.7.2012 Professor für Mensch-Computer-Interaktion an der Leibniz-Universität Hannover Letzte Änderung: 15.11.22 Druckversion So erreichen Sie uns Kontakt Kontakt © 2025: Leibniz Universität Hannover Impressum Datenschutz Barrierefreiheit Sitemap Menü×Fachgebiet Mensch-Computer-InteraktionFachgebiet Software EngineeringFakultät für Elektrotechnik und InformatikKontakt",
  "content_length": 2527,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:51"
}