{
  "name": "Michelle Borkin",
  "homepage": "https://www.ccs.neu.edu/home/borkin",
  "status": "success",
  "content": "Michelle Borkin Michelle Borkin Assistant Professor Khoury College of Computer Sciences Northeastern University About Michelle Borkin is an Assistant Professor in the Khoury College of Computer Sciences at Northeastern University on the Boston Campus. She is also Co-Lead of the Visualization @ Khoury Lab, Co-Director and Co-Founder of the Northeastern Visualization Consortium (NUVis), Affiliated Faculty member of the Northeastern NULab for Text, Maps, and Networks, and an Affiliated Faculty member of the Information Design and Data Visualization Program in the College of Arts, Media, and Design at Northeastern University. Her work is focused on the development of novel visualization techniques and tools to enable new insights and discoveries in data. She works across disciplines to bring together computer scientists, doctors, and astronomers to collaborate on new analysis and visualization techniques. Her research has resulted in the development of novel computer assisted diagnostics in cardiology, scalable visualization solutions for large network data sets, and novel astrophysical visualization tools and discoveries. Prior to joining Northeastern, Borkin was a postdoctoral research fellow in computer science at the University of British Columbia with Prof. Tamara Munzner, an associate in computer science at Harvard University, and a research fellow at Brigham & Women’s Hospital. She received her PhD in applied physics at Harvard’s School of Engineering and Applied Sciences in 2014, advised by Prof. Hanspeter Pfister and Prof. Alyssa Goodman. as well as a master’s degree in applied physics and a bachelor’s degree in astronomy and astrophysics and physics from Harvard University. She was previously a National Science Foundation graduate research fellow, a National Defense Science and Engineering graduate fellow, and a TED fellow. Borkin's work has been published in venues including IEEE VIS, IEEE Transactions on Visualization & Computer Graphics (TVCG), ACM CHI, and Nature, and was recently recognized with a CHI 2020 Best Paper Award for the publication “Design Study ‘Lite’ Methodology: Expediting Design Studies and Enabling the Synergy of Visualization Pedagogy and Social Good”. Her research interests across data visualization and human-computer interaction (HCI) include multidimensional brushing-and-linking methodologies, 3D data visualization and selection techniques, tree and network visualization, visualization evaluation methodologies, perception and cognition theory, accessibility, and visualization for social good. CV (PDF download) Research & Software For the most up-to-date listing of recent research activities and affiliated project links, go to Publications. Here is a list of select projects with tools and deliverables of use to the broader visualization and scientific communities: glue glue is an open-source Python library to explore relationships within and between related datasets. Designed from the ground up to be applicable to a wide variety of data, Glue is being used on astronomy data of star forming-clouds, medical data including brain scans, and many other kinds of data. glueviz.org SSVG SSVG is an open library to speed up interactive svg-based data visualizations by transforming them into canvases. Using SSVG to convert your D3 SVG data visualization into a performant canvas visualization couldn’t be easier! ssvg.io VisConnect With minimal effort, VisConnect allows website and visualization creators to add live collaboration. VisConnect synchronizes pointer events, like click and touch, across collaborators, so that they share a common workspace. It allows each element to be modified by one person at a time. visconnect.us EasyPZ EasyPZ.js is an open-source library—EasyPZ.js for the creation of multi-scale (pan and zoom) visualizations across desktop and mobile devices. EasyPZ is fully customizable and extendable with flexible options for interaction design. easypz.io DSLM The Design Study \"Lite\" Methodology (DSLM) is a novel framework for implementing visualization design studies with novices in just 14 weeks. The Design Study \"Lite\" Methodology in conjunction with Service-Learning provides a pedagogical model to teach design studies and engage in visualization for social good. intervis-projects.ccs.neu.edu/project/DSLM MASSVIS The Massachusetts (Massive) Visualization Database consists of over 5000 static visualizations of which over 2000 contain visualization type information, and hundreds of these visualizations have extensive annotations, memorability scores, eye-movements, and labels. massvis.mit.edu Teaching For the most up-to-date listing, with links, of my courses taught at Northeastern University please visit the Visualization @ Khoury teaching page. For information about my Service-Learning teaching and Design Study \"Lite\" Methodology, including curricular materials, please visit the DSLM Project page. Publications Table of contents: Journal & Conference Papers Book Chapters Other refereed Publications and Posters Journal & Conference Papers 2021 Schwab, M., Saffo, D., Bond, N., Sinha, S., Dunne, C., Huang, J., Tompkin, J., & Borkin, M. A., 2021, “Scalable Scalable Vector Graphics: Fast Drop-In Rendering for D3.js”, IEEE Transactions on Visualization and Computer Graphics, (accepted for publication). Project Website South, L., Saffo, D., & Borkin, M. A., 2021, “Detecting and Defending Against Seizure-Inducing GIFs in Social Media”, Conference Proceedings of CHI 2021 in Yokohama, Japan, May 8-13, 2021. Schwab, M., Saffo, D., Zhang, Y., Sinha, S., Nita-Rotaru, C., Tomkin, J., Dunne, C., & Borkin, M. A., 2021, “VisConnect: Distributed Event Synchronization for Collaborative Visualization”, IEEE Transactions on Visualization and Computer Graphics (Proceedings of IEEE InfoVis 2020), 27, 2, 347-357. Project Website 2020 Ahmed, A., & Borkin, M. A., 2020, “Data Visualization for Transgender Voice Training”, Short Paper, Conference Proceedings of IEEE VIS 2020, virtual event, October 25-30, 2020. South, L., Schwab, M., Beauchamp, N., Wang, L., Wihbey, J., & Borkin, M. A., 2020, “DebateVis: Visualizing Political Debates for Non-Expert Users”, Short Paper, Conference Proceedings of IEEE VIS 2020, virtual event, October 25-30, 2020. Project Website Syeda, U. H., Murali, P., Roe, L., Berkey, B., & Borkin, M. A., 2020, “Design Study \"Lite\" Methodology: Expediting Design Studies and Enabling the Synergy of Visualization Pedagogy and Social Good”, Conference Proceedings of CHI 2020 in Honolulu, Hawaii, April 27-30, 2020. *CHI Best Paper Award* Project Website, \"Multiple Views\" Post on Medium Di Bartolomeo, S., Pandey, A., Leventidis, A., Saffo, D., Syeda, U. H., Carstensdottir, E., Seif El-Nasr, M., Borkin, M. A., & Dunne, C., 2020, “Shapeshifting Timelines: Evaluating the Effect of Timeline Shape on Visualization Task Performance”, Conference Proceedings of CHI 2020 in Honolulu, Hawaii, April 27-30, 2020. \"Multiple Views\" Post on Medium Pandey, A., Shukla, H., Young, G., S., Qin, L., Zamani, A. A., Hsu, L., Huang, R., Dunne, C., & Borkin, M. A., 2020, “CerebroVis: Designing an Abstract yet Spatially Contextualized Cerebral Artery Network Visualization”, IEEE Transactions on Visualization and Computer Graphics (Proceedings of IEEE InfoVis 2019), 26, 1, 938-948. Project Website 2019 Schwab, M., Tomkin, J., Huang, J., & Borkin, M., 2019, “EasyPZ.js: Interaction Binding For Pan and Zoom Visualizations”, Short Paper, Conference Proceedings of IEEE VIS 2019 in Vancouver, Canada, October 22-25, 2019. Project Website Schwab, M., Hao, S., Vitek, O., Tomkin, J., Huang, J., & Borkin, M., 2019, “Evaluating Pan and Zoom Timelines and Sliders”, Conference Proceedings of CHI 2019 in Glasgow, Scotland, May 4-9, 2019. Project Website 2017 Kim, N., Bylinskii, Z., Borkin, M., Gajos, K., Oliva, A., Durand, F., & Pfister, H., 2017, \"BubbleView: an alternative to eye-tracking for crowdsourcing image importance\", ACM Transactions on Computer-Human Interaction (TOCHI), 24, 5, 36:1–36:40. Project Website Bylinskii, Z., Borkin, M. A., Kim, N. W., Pfister, H., and Oliva, A., 2017, \"Eye Fixation Metrics for Large Scale Evaluation and Comparison of Information Visualizations\", in Eye Tracking and Visualization, eds. Burch, et al., Mathematics and Visualization, Springer International Publishing. 2016 Borkin, M., Bylinskii, Z., Kim, N., Bainbridge, C., Yeh, C., Borkin, D., Pfister, H., & Oliva, A., 2016, \"Beyond Memorability: Visualization Recognition and Recall\", IEEE Transactions on Visualization and Computer Graphics (Proceedings of InfoVis 2015), 22, 1, 519-528. Project website: http://massvis.mit.edu 2015 Kim, N., Bylinskii, Z., Borkin, M., Oliva, A., Gajos, K., & Pfister, H., 2015, \"A Crowdsourced Alternative to Eye-tracking for Visualization Understanding\", Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI '15), 1349-1354. 2014 Goodman, A., Alves, J., Beaumont, C., Benjamin, R., Borkin, M., Burkert, A., Dame, T., Jackson, J., Kauffmann, J., Robitaille, T., & Smith, R., 2014, \"The Bones of the Milky Way\", Astrophysical Journal, 797, 53. Project website: http://milkywaybones.org/ Borkin, M., 2014, \"Perception, Cognition, and Effectiveness of Visualizations with Applications in Science and Engineering\", Ph.D. Thesis, School of Engineering & Applied Sciences, Harvard University. 2013 Borkin, M., Vo, A., Bylinskii, Z., Isola, P., Sunkavalli, S., Oliva, A., & Pfister, H., 2013, \"What Makes a Visualization Memorable?\", IEEE Transactions on Visualization and Computer Graphics (Proceedings of InfoVis 2013), 19, 12, 2306-2315. Borkin, M., Yeh, C., Boyd, M., Macko, P., Gajos, K., Seltzer, M., & Pfister, H., 2013, \"Evaluation of Filesystem Provenance Visualization Tools\", IEEE Transactions on Visualization and Computer Graphics (Proceedings of InfoVis 2013), 19, 12, 2476-2485. 2012 Lipsa, D., Laramee, R. S., Cox, S. J., Roberts, J. C., Walker, R., Borkin, M., & Pfister,",
  "content_length": 23841,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:22"
}