{
  "name": "Michael Grossniklaus",
  "homepage": "https://dbis.uni-konstanz.de/people/people/grossniklaus",
  "status": "success",
  "content": "Prof. Dr. Michael Grossniklaus | People A–Z | People | Database and Information Systems Areas of Interest Michael's research in the area of databases and information systems focuses on developing innovative database technologies to support novel and emerging application domains. To support context-aware applications, he designed and implemented the storage and query processor of a context-aware object database, which was used as the basis to implement a context-aware web content management system and a mobile multi-channel tourist information system at the annual Edinburgh Fringe festival. Michael contributed to the development of metamodel extension modules that facilitate the adaptation and extension of database management systems. Another area of interest are data stream management systems, where he contributed to the design of the C-SPARQL language and played a key role in architecting a query execution platform. In the context of the NiagaraST project, he made major contributions to the theory and practice of data-driven windows, so-called frames. One of Michael's current research focus is to design and develop algebraic optimization techniques for graph databases. Additionally, he continues his work on data stream processing in the area of event detection techniques for the Twitter social media stream. Background Michael studied computer science with a focus on databases and information systems in his home country of Switzerland at the Department of Computer Science of ETH Zurich. In 2001, Michael graduated with a diploma thesis (MSc) in the area of context-aware content management, which he conducted in Prof. Moira C. Norrie's  Global Information Systems Group. In 2007, Michael received a doctorate for his thesis entitled An Object-Oriented Version Model for Context-Aware Data Management. After his doctorate, he continued working as a senior researcher in the Institute for Information Systems at ETH Zurich. In 2008, Michael was awarded a post-doctoral fellowship from the Swiss National Science Foundation (SNSF), entitled A Platform for the Development and Implementation of Web 2.0 Applications and hosted by Prof. Stefano Ceri's  database group at the Politecnico di Milano. At Politecnico di Milano, Michael also had the opportunity to contribute to ongoing projects, in particular C-SPARQL, a continuous query language and processor for RDF data streams and Search Computing (SeCo), a new multi-disciplinary science which will provide the abstractions, foundations, methods, and tools required to answer multi-domain queries over Web data sources. From 2010 to 2012, Michael was an SNSF-funded post-doc in Prof. David Maier's  group at Portland State University, where he worked on the project entitled Exploiting Object Database Technologies for Data Management in the Cloud. From 2012 to 2013, Michael was a postdoctoral researcher in Prof. Gerti Kappel's  Business Informatics Group (BIG), where he is working on the ARTIST EU project, which investigates advanced software-based service provisioning and migration of legacy software to cloud computing infrastructures. In 2013, Michael started his own research group at the Department of Computer and Information Science at the University of Konstanz first as a Junior Professor and since 2017 as a Full Professor for databases and information systems. Books Current Trends in Web Engineering: ICWE 2012 International Workshops MDWE, ComposableWeb, WeRE, QWE, and Doctoral Consortium, Berlin, Germany, July 23-27, 2012, Revised Selected Papers Michael Grossniklaus and Manuel Wimmer (Eds.) Book DescriptionThis book constitutes the thoroughly refereed post-workshop proceedings and the doctoral symposium of the 12th International Conference on Web Engineering, ICWE 2012, held in Berlin, Germany, in July 2012. The volume contains four workshops and a doctoral consortium, each focusing on specific research issues that contribute to the main themes of the ICWE conference: MDWE 2012: Eighth International Workshop on Model-Driven and Agile Engineering for the Web, ComposableWeb 2012: Fourth International Workshop on Lightweight Integration on the Web, WeRE 2012: Third Workshop on the Web and Requirements Engineering, QWE 2012: Third International Workshop on Quality in Web Engineering. List Price: $72.00Paperback: 245 pagesLanguage: EnglishISBN: 978-3642356223 Object Databases: 2nd International Conference, ICOODB 2009, Zurich, Switzerland, July 2009, Revised Papers Moira C. Norrie and Michael Grossniklaus (Eds.) Book DescriptionThis book constitutes the thoroughly refereed post-conference proceedings of the 2nd International Conference on Object Databases, ICOODB 2009, held in Zurich, Switzerland, in July 2009. The 6 revised full papers presented together with 3 invited papers were carefully reviewed and selected from the presentations at the research track during two rounds of reviewing and improvement. These papers address a wide range of issues related to object databases, including topics such as applications, methodologies, design tools, frameworks and standards as well as core object database technologies. List Price: $72.00Paperback: 167 pagesLanguage: EnglishISBN: 978-3642146800 Web Engineering: 9th International Conference, ICWE 2009, San Sebastián, Spain, June 24-26 2009, Proceedings Martin Gaedke, Michael Grossniklaus, and Oscar Díaz (Eds.) Book DescriptionThis book constitutes the refereed proceedings of the 9th International Conference on Web Engineering, ICWE 2009, held in San Sebastian, Spain in June 2009. The 22 revised full papers and 15 revised short papers presented together with 8 posters and 10 demonstration papers were carefully reviewed and selected from 90 submissions. The papers are organized in topical sections on accessibility and usability, component-based web engineering: portals and mashups, data and semantics, model-driven web engineering, navigation, process, planning and phases, quality, rich internet applications, search, testing, Web services, SOA and REST, and Web 2.0. List Price: $105.00Paperback: 536 pagesLanguage: EnglishISBN: 978-3642028175 Professional Activities Invited Talks Fishing in the Data Stream: Design and Evaluation of Event Detection Techniques for Twitter, Informatik Alumni der ETH Zürich, January 2016, Zurich, SwitzerlandTeach Your Data Streams New Tricks, Università Roma Tre, January 2013, Rome, ItalyTaking Data Management into New Territory, University of Konstanz, November 2012, Konstanz, GermanyTaking Data Management into New Territory, Vienna University of Technology, November 2012, Vienna, AustriaTaking Data Management into New Territory, Università della Svizzera Italiana, July 2012, Lugano, Switzerland »»Object Databases: The Concepts, the Applications, and the Cloud (with Moira C. Norrie), Amazon.com, April 2012, Seattle, WA, USAGraph Data Management and Processing, Boise State University, April 2012, Boise, ID, USA »»Graph Data Management and Processing, Illinois Institute of Technology, January 2012, Chicago, IL, USA »»C-SPARQL: From Querying RDF Streams to Stream Reasoning, Portland State University, July 2010, Portland, OR, USAContext-Aware Data Management, University of Lausanne, May 2008, Lausanne, SwitzerlandContext-Aware Data Management, DBTA Workshop, October 2007, Zurich, SwitzerlandAn Object-Oriented Version Model for Context-Aware Data Management, Politecnico di Milano, November 2006, Milano, ItalyWeb Content Management, EINIRAS 12th Annual Conference, October 2002, Berlin, Germany Conference Organisation ICWE 2012, International Conference on Web Engineering (Workshop Co-Chair)July 23-27, 2012, Berlin, Germany »»SSDBM 2011, Scientific and Statistical Database Management Conference (Treasurer)July 20-22, 2011, Portland, OR, USA »»ICOODB 2009, International Conference on Object Databases (Programme Co-Chair)July 1-3, 2009, Zurich, Switzerland »»ICWE 2009, International Conference on Web Engineering (Programme Co-Chair)June 24-26, 2009, San Sebastian, Spain »»ICWE 2008, International Conference on Web Engineering (Poster Chair)July 14-18, 2008, Yorktown Heights, NY, USA »» Recent Programme Committees VLDB 2017, International Conference on Very Large Data BasesAugust 28-September 1, 2017, Munich, GermanyEDBT 2017, International Conference on Extending Database TechnologyMarch 21-24, 2017, Venice, ItalyVLDB 2016, International Conference on Very Large Data Bases (PhD Workshop)September 5-9, 2016, New Delhi, IndiaICDE 2016, International Conference on Data Engineering (Demonstrations)May 16-20, 2015, Helsinki, FinlandCAiSE 2016, International Conference on Advanced Information Systems EngineeringJune 13-17, 2015, Ljubljana, Slovenia ICWE 2015, International Conference on Web EngineeringJune 23-26, 2015, Rotterdam, The NetherlandsCAiSE 2015, International Conference on Advanced Information Systems EngineeringJune 8-12, 2015, Stockholm, Sweden EDBT 2015, International Conference on Extending Database Technology (Demonstrations)March 23-27, 2015, Brussels, Belgium External Reviewer Journal on Information Systems (IS)Journal on Data & Knowledge Engineering (DKE)ACM Transactions on the Web (TWEB)Journal of Web Engineering (JWE) Contact Prof. Dr. Michael Grossniklaus Phone: +49 7531 88 4434 Fax: +49 7531 88 3577 Room: PZ 806 Send email Social network profiles Academia.edu ResearchGate.net Google Scholar Microsoft Academic Search DBLP ORCID LinkedIn XING Twitter Hide search Search University of Konstanz Search terms Search Results Suggestions",
  "content_length": 9513,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:05"
}