{
  "name": "Michele Parrinello",
  "homepage": "http://search.usi.ch/people/3b1efdf234d1c4d61794f89ef66ac885/Parrinello-Michele",
  "status": "success",
  "content": "Parrinello, Michele | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Michele Parrinello http://usi.to/kme Biography Professor Parrinello is known for his many technical innovations in the field ofatomistic simulations and for a wealth of interdisciplinary applications rangingfrom materials science to chemistry and biology. Together with Roberto Car heintroduced ab-initio molecular dynamics, also known as the Car-Parrinello method, marking the beginning of a new era both in the area of electronic structure calculations and in molecular dynamics simulations. He is also known for the Parrinello-Rahman method, which allows crystalline phase transitionsto be studied by molecular dynamics. More recently he has introduced metadynamics for the study of rare events and the calculation of free energies. Forhis work he has been awarded many prizes and honorary degrees. He is amember of numerous academies and learned societies, including the German Berlin-Brandenburgische Akademie der Wissenschaften, the British Royal Societyand the Italian Accademia Nazionale dei Lincei, which is the major academyin his home country Italy. Born in Messina in 1945, he got his degree from the University of Bologna and is currently professor of Computational Sciencesat Università della Svizzera italiana (Faculty of Informatics) and ETHZ in Switzerland. Competence areas Ab-initio Molecular Dynamics Biomedical Simulations Chemical and Biophysical Systems Chemical reaction in condensed phases Computational Geometry Computational Geometry Computer simulations Data Structures Design and analysis of algorithms Geometric Algorithms Metadynamics Modelling of condensed matter Nucleation Protein-protein interaction Simulation of rare events Structural and Chemical Transformations in Solids VLSI Design Contact previo appuntamento +41 (0)58 666 48 00 michele.parrinello@usi.ch tel +41 58 666 4801 Lab, Office P501 (Level P5) Via Buffi 13, 6900 Lugano Roles Faculty of Informatics Professor emeritus Links Website or personal page Attachments CV (it) Publications list (it) Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2813,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:25"
}