{
  "name": "Michael E. Papka",
  "homepage": "https://cs.uic.edu/profiles/papka-michael",
  "status": "success",
  "content": "Papka, Michael E. | Computer Science | University of Illinois Chicago Your browser is unsupported We recommend using the latest version of IE11, Edge, Chrome, Firefox or Safari. Michael E. Papka Collegiate Warren S. McCulloch Professor of Computer Science Department of Computer Science Deputy Associate Laboratory Director, Computing, Environment, and Life Sciences, Argonne National Laboratory Pronouns: He/Him/His Contact Building & Room: CDRLC 5407 Address: 850 W. Taylor St, MC 152, Chicago, IL 60607 Office Phone: 312.996.2994 Email: papka@uic.edu CV Link: Michael E. Papka Related Sites: View full profile Google Scholar LinkedIn Argonne National Laboratory Building & Room: Building 240 Room 4134 Address: 9700 South Cass Avenue, Lemont, IL 60439 About I am the Warren S. McCulloch Professor of Computer Science and a director of the Electronic Visualization Laboratory, as well as a member of the SPEAR Lab and Honors College at the University of Illinois Chicago. I hold a joint appointment with Argonne National Laboratory, where I am a Senior Scientist and Distinguished Fellow, the deputy associate laboratory director for Computing, Environment and Life Sciences, and the director of the Argonne Leadership Computing Facility. In 2024, I became the founding co-director of the George Crabtree Institute for Discovery. Before UIC, I was the Presidential Research, Scholarship, and Artistry Professor of Computer Science at Northern Illinois University (NIU) where I founded the data, devices, and interaction Laboratory (ddiLab), a joint research lab between NIU’s School of Art and the Department of Computer Science. I have an M.S. and Ph.D. from The University of Chicago, an M.S. from the University of Illinois Chicago, and a B.S. from Northern Illinois University. My teaching and research interests include high-performance computing, large-scale data analysis, and visualization. Extending from the analysis of output from traditional supercomputers to the data produced by large-scale scientific instruments and sensor networks to the integration of edge and high-performance computing (HPC) across the computing continuum. I’m interested in harnessing operational data to optimize HPC facilities and broadening the use of supercomputers beyond conventional batch computing. This includes a strong interest in enhancing the accessibility of HPC to foster real-time interactions and enable autonomous data generation. I seek to translate complex data into visually compelling results while dedicating my efforts to mentoring the next generation of scientists. These contributions form part of a larger, collective initiative that resonates with my commitment to deepening our understanding of the world by integrating computing with all things. Education Ph.D., Computer Science, University of Chicago (2009) M.S., Computer Science, University of Chicago (2002) M.S., Electrical Engineering and Computer Science, University of Illinois Chicago (1994) B.S., Physics, Northern Illinois University (1990) Professional Memberships ACM Distinguished Member IEEE Senior Member AAAS Member",
  "content_length": 3103,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:53"
}