{
  "name": "Michel Dumontier",
  "homepage": "https://www.maastrichtuniversity.nl/michel.dumontier",
  "status": "success",
  "content": "Michel Dumontier (M.J.) - Michel Dumontier (M.J.) - Maastricht University Skip to main content Michel Dumontier (M.J.) Education Research Work for third parties Michel Dumontier (M.J.) Dr. Michel Dumontier is the Distinguished Professor of Data Science at Maastricht University, is the founder and Director of the Institute of Data Science at Maastricht University, and is a co-founder of the FAIR (Findable, Accessible, Interoperable and Reusable) data principles. His research aims to unlock the potential of data for scientific research. He is an expert in building and mining knowledge graphs for drug discovery and personalised medicine. Dr. Dumontier is a principal investigator with funding from NWO, Horizon Europe, MCSA NIH/NCATS, ARPA-H. He is coordinator for the AIDAVA and REALM projects, PI for the NCATS Biomedical Data Translator, and PI for GENIUS AI lab for generative AI technologies. He is the editor-in-chief for the journal Data Science. He is internationally recognized for his contributions in bioinformatics, biomedical informatics, and semantic technologies including ontologies and linked data. Expertises FAIR data, generative artificial intelligence, machine learning, deep learning, semantic technologies, ontology, linked data, data mining, data qualilty, data quality, data integration, drug discovery, personalised medicine Career history BSc (Biochemistry) from the University of Manitoba in 1999PhD (Bioinformatics) from the University of Toronto in 2004Assistant/Associate Professor at Carleton University (2005-2013)Associate Professor at Stanford University (2013-2016)Distinguished Professor at Maastricht University(2017-) Michel Dumontier (M.J.) Distinguished Professor of Data Science Institute of Data Science; Department of Advanced Computing Sciences. ORCID michel.dumontier@maastrichtuniversity.nl X (Twitter) Linkedin",
  "content_length": 1863,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:16"
}