{
  "name": "Michael A. Lones",
  "homepage": "https://researchportal.hw.ac.uk/en/persons/michael-adam-lones",
  "status": "success",
  "content": "Michael Adam Lones - Heriot-Watt Research Portal View Scopus Profile Michael Adam Lones Professor, School of Mathematical & Computer SciencesProfessor, School of Mathematical & Computer Sciences, Computer Science https://orcid.org/0000-0002-2745-9896 EmailM.Loneshw.acuk EH14 4ASUnited Kingdom Accepting PhD Students 20132026 Research activity per year Personal profile Research interestsI have over 25 years of experience in AI, specialising in machine learning and optimisation. My journey began with bio-inspired computing, and my interests have since expanded to encompass a broad spectrum of modern AI, integrating both theoretical and practical aspects. Currently, my work focuses on the dependability of AI systems. This includes designing robust AI systems, understanding their limitations, and improving AI practices to enhance system reliability. My research has been applied across various domains, notably in medicine, where I contributed to the clinical translation of tools for Parkinson’s disease management. Drawing from these experiences, I am committed to sharing knowledge about AI practices and regularly share insights through talks and my Substack, Fetch Decode Execute.BiographyI am a Professor in the Department of Computer Science, and also a member of the Edinburgh Centre for Robotics. I have MEng and PhD degrees from the University of York, awarded in 1999 and 2003 respectively. Following my PhD, I held an ERCIM Fellowship at the Norwegian University of Science and Technology. I then worked for 8 years as a Research Associate and then Research Fellow at the University of York, before moving to Heriot-Watt University in 2013. I am an Associate Editor of BioSystems, and am on the editorial board of Genetic Programming and Evolvable Machines. I am a Senior Member of the IEEE, and a member of the IEEE Technical Committee on Bioinformatics and Bioengineering. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Michael Adam Lones is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles machine learning INIS 100% genetic algorithms INIS 78% optimization INIS 70% Parkinson's Disease Computer Science 66% Machine Learning Computer Science 58% control INIS 56% Learning System Computer Science 56% Genetic Programming Computer Science 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2013 2013 2015 2016 2018 2020 2021 2022 2024 2025 2026 32 Article 28 Conference contribution 3 Chapter 2 Chapter (peer-reviewed) 7 More 2 Paper 1 Anthology 1 Editorial 1 Review article 1 Patent 1 Preprint Research output per year Research output per year A Comparative Analysis of Transformer Models in Social Bot DetectionVeit, R. & Lones, M. A., 1 Jul 2025, (Accepted/In press).Research output: Contribution to conference › Paper › peer-review Use Case 100% Online Discussions 100% Large Language Model 100% Comparative Analysis 100% Digital Environment 100% ActDroid: An active learning framework for Android malware detectionMuzaffar, A., Ragab Hassen, H., Zantout, H. & Lones, M. A., Jan 2026, In: Computers and Security. 160, 104724.Research output: Contribution to journal › Article › peer-review Open AccessFile Learning Framework 100% Active Learning 100% Malware Detection 100% Android Malware 100% detection 100% GeMID: Generalizable Models for IoT Device IdentificationKostas, K., Kostas, R. Y., Just, M. & Lones, M. A., Nov 2025, In: Internet of Things. 34, 101806.Research output: Contribution to journal › Article › peer-review Open AccessFile Internet of Things Device 100% Device Identification 100% devices 100% internet 100% Generalizability 57% 1 Downloads (Pure) Individual Packet Features are a Risk to Model Generalization in ML-Based Intrusion DetectionKostas, K., Just, M. & Lones, M. A., Mar 2025, In: IEEE Networking Letters. 7, 1, p. 66-70 5 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Intrusion Detection 100% Machine Learning 100% Internet-Of-Things 100% detection 100% risks 100% 6 Citations (Scopus) 27 Downloads (Pure) IoTGeM: Generalizable Models for Behaviour-Based IoT Attack DetectionKostas, K., Just, M. & Lones, M. A., Oct 2025, In: Computer Networks. 270, 111550.Research output: Contribution to journal › Article › peer-review detection 100% datasets 100% Internet-Of-Things 100% Feature Extraction 66% data 40% View all 72 research outputs Datasets Android dataset for malware detectionMuzaffar, A. (Creator), Ragab Hassan, H. (Contributor), Lones, M. A. (Contributor) & Zantout, H. (Contributor), Heriot-Watt University, 2024https://www.dropbox.com/scl/fo/js2kra4l7yang2bd1a3a9/AEALOY1s94xgqWJ6M4ZI9S4?rlkey=4qaj9uohg3hz5bzxhsaq5ttox&dl=0Dataset Motor and Cognitive Deficit in Parkinson's Disease Patients: GECCO 2016 datasetsVallejo, M. (Creator) & Lones, M. A. (Creator), Heriot-Watt University, 8 May 2016DOI: 10.17861/958af07e-d336-4202-854e-12188211873aDataset Prizes Best Paper AwardElshimy, H. (Recipient), Zantout, H. (Recipient), Lones, M. A. (Recipient) & Elgayar, N. (Recipient), Feb 2025Prize: Prize (including medals and awards) File learning 100% awards 100% datasets 100% capsules 100% biomedical radiography 100% Humies Gold AwardLones, M. A. (Recipient), Alty, J. E. (Recipient), Cosgrove, J. (Recipient), Duggan-Carter, P. (Recipient), Jamieson, S. (Recipient), Naylor, R. F. (Recipient), Turner, A. J. (Recipient) & Smith, S. L. (Recipient), Jul 2018Prize: Prize (including medals and awards) awards 100% gold 100% Side Effect 100% Evolutionary Computation 100% humans 50% Press/Media A new algorithm for detecting the side-effects of Parkinson's medicationLones, M. A.8/01/18 → 8/01/182 items of Media coveragePress/Media: Research Courses F21AS: Advanced Software EngineeringBatatia, H. & Lones, M. A.1/09/20 → 31/08/23Course F21BC: Biologically Inspired ComputationBatatia, H., Lones, M. A. & Pang, W.1/09/21 → …Course F27SD: Software developmentBatatia, H. & Lones, M. A.1/09/20 → 31/08/21Course",
  "content_length": 6630,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:37"
}