{
  "name": "Michael Dinitz",
  "homepage": "http://www.cs.jhu.edu/~mdinitz",
  "status": "success",
  "content": "Michael Dinitz Michael Dinitz Associate Professor Department of Computer Science Johns Hopkins University Baltimore, MD USA mdinitz@cs.jhu.edu Home I am an Associate Professor in the Computer Science department, with a secondary appointment in Applied Mathematics and Statistics, at Johns Hopkins University. My research interests are in Theoretical Computer Science, with an emphasis on approximation algorithms, and applications to computer networking and distributed computing. I am a member of Algorithms and Complexity group, and the Mathematical Institute for Data Science inside of the Data Science and AI Institute at JHU. My work has been supported by various NSF grants, including a CRII grant, an AitF grant, and Algorithmic Foundations grants (first, second). As a graduate student I was supported by an NSF Graduate Research Fellowship, as well as an ARCS Scholarship. Ph.D., Carnegie Mellon University, 2010. Advised by Anupam Gupta. A.B., Princeton University, 2005. Advised by Sanjeev Arora. My CV. Publications Most of my publications Ph.D. Thesis: Algorithms and Models for Problems in Networking Projects Some of my systems projects have taken on lives of their own: Xpander: Towards Optimal-Performance Datacenters Wide-area Dissemination under Strict Reliability, Timeliness, and Cost Constraints Teaching Undergraduate/Masters: 601.433/633 / 600.463 Introduction to Algorithms: Fall '25, Fall '24, Fall '21, Fall '20, Fall '19, Fall '18, Fall '17, Fall '16, Fall '15, Fall '14 Graduate: 601.438/638 Algorithmic Foundations of Differential Privacy: Spring '25 601.435/635 Approximation Algorithms: Spring '24, Spring '21, Spring '19, Spring '17, Spring '15 601.436/636 Algorithmic Game Theory: Spring '22, Spring '20, Spring '18, Spring '16 600.770 Selected Topics in Algorithms for Metric Spaces: Spring '14 Research Group Qiming Cui (PhD), Shruthi Prusty (PhD), Kailee Lin (PhD) Alumni: Ama Koranteng (PhD), Yasamin Nazari (PhD), Aditya Krishnan (PhD), Zeyu Zhang (PhD), Raymond Jiang (MSE), Tianli Luo (MSE), Yang Xiao (MSSI), Yuchao Li (visiting PhD), Liam Baca (BS), Rishi Chandra (2024, BS), Caleb Robelle (2021, BS), Naomi Ephraim (2016, BS), Chenglin Fan (postdoc) Service Journals: ACM Transactions on Algorithms, Associate Editor Conference Organization: IPCO '25: Local Arrangements Committee and Webmaster FOCS '19: Local Arrangements Chair and Treasurer Program Committees: STOC 2026, Salt Lake City, UT APPROX 2025, Berkeley, CA ICDCS 2023, Hong Kong, China ICALP 2023, Paderborn, Germany ALGOSENSORS 2022, Potsdam, Germany ESA 2022, Potsdam, Germany SIROCCO 2022, Paderborn, Germany DISC 2021, Freiburg, Germany STOC 2021, Rome, Italy APoCS 2021, Alexandra, VA ICDCS 2020, Singapore SODA 2020, Salt Lake City, UT APoCS 2020, Salt Lake City, UT APPROX 2019, Boston, MA SOSA 2019, San Diego, CA OPODIS 2018, Hong Kong APPROX 2015, Princeton, NJ SPAA 2013, Montreal, Canada CATS 2013, Adelaide, Australia Workshop Organization: NSF Algorithms in the Field (AiTF) Workshop on Algorithms for Software-Defined Networking (June 2-3 2016) Spanners: Graphs and Geometry (Joint STOC-SoCG Workshop, June 18 2016) Capital Area Theory Day 2016 (May 26, 2016) Elsewhere on the Internet dblp    Google Scholar     Bluesky     Mastodon     Twitter Family Desiree Tillo    Ezra Dinitz    Jeff Dinitz    Sue Dinitz    Amy Dinitz    Tom Dinitz Contact Information Email: mdinitz@cs.jhu.edu Phone: 410-516-6251 Office: Malone 217 Mailing Address: Department of Computer Science, 160 Malone Hall, 3400 N Charles St, Baltimore, MD 21218",
  "content_length": 3550,
  "method": "requests",
  "crawl_time": "2025-12-01 13:57:52"
}