{
  "name": "Michael McGuire",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/mmcguire.html",
  "status": "success",
  "content": "Michael McGuire | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Michael McGuire Contact Info Phone: 410-704-2337 Office: YR-406C Email: mmcguire@towson.edu https://www.linkedin.com/pub/michael-mcguire/8b/52a/433 https://mpmcguire.wordpress.com/ Education Ph. D., Information Systems, University of Maryland, Baltimore County, 2010 M.S., Information Systems, University of Maryland, Baltimore County, 2005 \t\t\tB.S., Geography and Environmental Planning, Towson State University, 1996 Areas of Expertise Spatio-Temporal Data Mining, Data Warehousing, Sensor Database Systems, Distributed Databases, Environmental Informatics, Information Visualization Selected Publications: Journal Publications McGuire, M. P., & Moore, T. W. (2022). Prediction of tornado days in the United States with deep convolutional neural networks. Computers & Geosciences, 159, 104990. Moore, T. W., J. M. St. Clair, and M. P. McGuire (2022). Climatology and trends of tornado favorable environmental ingredients in the United States. Annals of the American Association of Geographers. 112.2, 331-349. Yin, Y., Y. Alqahtani, J. H. Feng, J. Chakraborty, and M.P McGuire (2021). Classification of Eye Tracking Data in Visual Information Processing Tasks Using Convolutional Neural Networks and Feature Engineering. SN Computer Science, 2(2), 1-26. Sarraf, R., and M.P. McGuire (2020). Integration and comparison of multi-criteria decision making methods in safe route planner. Expert Systems with Applications, 154, 113399. Moore, T. W and M.P. McGuire, (2019). Tornado-days in the United States by phase of the MaddenâJulian oscillation and global wind oscillation. Climate Dynamics, 1-20. Moore, T. W. and M. P. McGuire (2019). âUsing the standard deviational ellipse to document changes to the spatial dispersion of seasonal tornado activity in the United States.â npj Climate and Atmospheric Science. 2(1), 21. Sarraf, R. and M. P. McGuire (2018) âA Data Driven Approach for Safe Route Planning.â International Journal of Applied Geospatial Research (IJAGR), 9(1), 1-18. Roberge, M., M. P. McGuire, and J. Lian (2017) âHydroCloud: a web application for exploring USGS stream gage dataâ Journal of Open Research Software. 5(1). Lian, J., M. P. McGuire, and T. Moore (2017) âFunnel Cloud: A Cloud-Based System for Exploring Tornado Events.â International Journal of Digital Earth.  10(10), 1030-1054. Conference Publications Sarraf, R., & McGuire, M. P. (2021). Effect of Normalization on TOPSIS and Fuzzy TOPSIS. In Proceedings of the Conference on Information Systems Applied Research ISSN (Vol. 2167, pp. 1508). Yin, Y.*, Alqahtani, Y.*, Feng, J. H., Chakraborty, J., & McGuire, M. P. (2021, December). Deep Learning Methods for the Prediction of Information Display Type Using Eye Tracking Sequences. In 2021 20th IEEE International Conference on Machine Learning and Applications (ICMLA) (pp. 601-605). IEEE. Peneda, M.*, Wang, Q., Liao, W., McGuire, M. P. (2022) A Multi-model Multi-task Learning System for Hurricane Genesis Prediction. 20th IEEE/ACIS International Conference on Software Engineering, Management, and Applications (SERA). May 25, 2022, Las Vegas, USA. Alqahtani, Y., J. Chakraborty, McGuire, M., and Feng, J. (2019) Understanding Visual information processing for American vs. Saudi Arabian Users. 10th International Conference on Applied Human Factors and Ergonomics. July 2019. Alqahtani, Y., McGuire, M., Chakraborty, J., and Feng, J. (2019) Understanding how ADHD affects visual information processing.  21st International Conference on Human-Computer Interaction. July 2019. Mittrick, M., J. Richardson, T. Hanratty, M. P. McGuire, J. Chakraborty. (2018) Measuring the Effects of Augmented Visualizations Through Eye Gaze Tracking.  23rd ICCRTS Information Central, November 6-9, 2018, Pensacola, Florida. Yin, C. Juan, J. Chakraborty and M. P. McGuire, (2018) \"Classification of Eye Tracking Data Using a Convolutional Neural Network,\" 2018 17th IEEE International Conference on Machine Learning and Applications (ICMLA), Orlando, FL, 2018, pp. 530-535. Lian, J., S. Miao*, M. P. McGuire, and Z Tang. (2018) SQL or NoSQL? Which is the Best Choice for Storing Big Spatio-Temporal Climate Data? 37th International Conference on Conceptual Modeling (ER 2018). October 22-25, Xiâan, China McGuire, M. P., and T. Moore (2018) âAnalysis of Tornado Environments using Convolutional Neural Networksâ 14th International Conference on Data Science, July, 2018, Las Vegas Nevada, USA. Sarraf, R. and M. P. McGuire (2018) âA Data Integration and Analysis System for Safe Route Planningâ 17th International Conference on Information and Knowledge Engineering July, 2018, Las Vegas Nevada, USA Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 7861,
  "method": "requests",
  "crawl_time": "2025-12-01 13:58:39"
}