{
  "name": "Miguel P. Monteiro 0001",
  "homepage": "http://ctp.di.fct.unl.pt/~mpm",
  "status": "success",
  "content": "Miguel Pessoa Monteiro Miguel P. Monteiro Assistant Professor of the Department of Informatics (DI) of the Faculty of Sciences and Technology (FCT) of New University of Lisbon (UNL) since the fall of 2006. Member of NOVA-LINCS (previously CITI) and the QUASAR research group. Contacts: e-mail: Skype: miguel.p.monteiro Snail mail: Departamento de Informática Faculdade de Ciências e Tecnologia Universidade Nova de Lisboa Quinta da Torre 2829-516 Caparica Portugal Office location: Building 2, Room P2/16 Tel: +351-21-294 8536 ext: 0708 Fax: +351-21-294 8541 Research Interests Software Engineering, with a focus on Software Modularity and Aspect-Oriented Software Development (AOSD); Program Reengineering and Evolution. Selected publications §       Reis, E., Gralha, C., Monteiro M.P. Surveying communities of users of MATLAB and clone languages. Journal of Computer Languages vol.73 (December 2022) 101170 (PDF) https://doi.org/10.1016/j.cola.2022.101170. §       Marques N., Monteiro M.P., Silva, B. Analysis of a token density metric for concern detection in Matlab sources using UbiSOM. Expert Systems vol.35(4), 2018 https://doi.org/10.1111/exsy.12306 (PDF;link). §       Cardoso J., Fernandes J., Monteiro M.P., Carvalho T., Nobre R. Enriching MATLAB with aspect-oriented features for developing embedded systems. Journal of Systems Architecture. Vol.59(7), August 2013, pp.412428, Elsevier. ISSN 1383-7621. DOI: 10.1016/j.sysarc.2013.04.003. §       Monteiro M.P., Gomes J.L. Implementing design patterns in Object Teams. Software: Practice and Experience. Volume 43, Issue 12, pp.15191551, December 2013. Published online: 2012-09-18. John Wiley & Sons (PDF). DOI: 10.1002/spe.2154. §       Monteiro M.P., Fernandes J.M., Towards a Catalogue of Refactorings and Code Smells for AspectJ. Transactions on Aspect-Oriented Software Development (TAOSD), A. Rashid, M. Aksit (Eds.), Springer LNCS vol. 3880/2006, pp. 214258. (PDF) ISSN 0302-9743. DOI: 10.1007/11687061. Projects §       GasPar - General-purpose Aspect-Oriented framework for heterogeneous multicore Parallel systems. 3 year project funded by the the Portuguese Science and Technology Foundation (PTDC/EIA-EIA/108937/2008). Jun/2010  Dec/2013. §       AMADEUS  Aspects and Compiler Optimizations for MATLAB System Development. Due to start December 2007. 3 year project funded by the the Portuguese Science and Technology Foundation (POCTI, PTDC/EIA/70271/2006) Dec/2007  Nov/2010. §       PRIA  Parallel Programming Refinements for Irregular Applications (UTAustin/CA/0056/2008). 2 year international project in partnership with University of Texas at Austin (USA). 2009/Jul  Jun/2011. §       PPC-VM  Portable Parallel Computing Based on Virtual Machines. 3 year project funded by the Portuguese Science and Technology Foundation and by European fund FEDER (POSI/CHS/47158/2002). Dec/2004  Nov/2007. §       SOFTAS  Desenvolvimento de Software com Aspectos. 3 year project funded by the Portuguese Science and Technology Foundation (POSI/EIA/60189/2004). Apr/2005  Apr/2008. All publications 2022 §       Reis, E., Gralha, C., Monteiro M.P. Surveying communities of users of MATLAB and clone languages. Journal of Computer Languages vol.73 (December 2022) 101170 (PDF) https://doi.org/10.1016/j.cola.2022.101170. 2019 §       Silva, H.H.S., Carneiro G., Monteiro M.P. An Experience Report from the Migration of Legacy Software Systems to Microservice Based Architecture. Proceedings of the 16th International Conference on Information Technology  New Generations (ITNG 2019). Springer 2019 (PDF). §       Cairo L., Monteiro M.P., Carneiro G., Abreu F. Towards the use of machine learning algorithms to enhance the effectiveness of search strings in secondary studies. Proceedings of the 33nd Brazilian Symposium on Software Engineering (SBES). ACM press, pp.22-26, 2019 (PDF). DOI: 10.1145/3350768.3350772 §       Relvas A., Marques N., Monteiro M.P., Carneiro G. An Annotated Repository for MATLAB Code. Proceedings (technical track) of the 31st 2019 International Conference on Software Engineering & Knowledge Engineering (SEKE19), 10-12 July 2019, Portugal (PDF). DOI: 10.18293/SEKE2019-137 §       Silva H., Carneiro G., Monteiro M. Towards a Roadmap for the Migration of Legacy Software Systems to a Microservice based Architecture. 9th International Conference on Cloud Computing and Services Science (CLOSER), January 2019 (PDF). DOI: 10.5220/0007618400370047 2018 §       Cairo A., Carneiro G., Monteiro M. The Impact of Code Smells on Software Bugs: A Systematic Literature Review. Information 2018, 9(11), 273, November 2018 (PDF; link). §       Marques N., Monteiro M.P., Silva, B. Analysis of a token density metric for concern detection in Matlab sources using UbiSOM. Expert Systems vol.35(4), 2018 https://doi.org/10.1111/exsy.12306 (PDF;link). §       Filho H.S., Carneiro G., Costa E.S., Monteiro M.P. Tools to Support SMEs to Migrate to the Cloud: Opportunities and Challenges. Proceedings of the Software Engineering Track (SET) of the 15th International Conference on Information Technology: New Generations (ITNG 2018), April 16-18, Las Vegas, Nevada, USA (PDF). §       Filho R.N., Carneiro G., Monteiro M.P. An Approach to Prepare Data to Feed Visual Metaphors in a Multiple View Interactive Environment. Proceedings of the Software Engineering Track (SET) of the 15th International Conference on Information Technology: New Generations (ITNG 2018), April 16-18, Las Vegas, Nevada, USA (PDF). §       Mariano T., Carneiro G., Monteiro M.P., Abreu F.B., Munson E. A parser and a software visualization environment to support the comprehension of MATLAB/Octave programs. - Proceedings of the 20th International Conference on Enterprise Information Systems (ICEIS 2018). Volume 2, 2018, pp. 179-186 (PDF) 2017 §       Silva A.C., Carneiro G., Abreu F.B., Monteiro M.P. Frequent Releases in Open Source Software: A Systematic Review. Information 2017, 8(3), 109, September 2017 (PDF) DOI: 10.3390/info8030109 §       Monteiro M.P., Marques N.C., Cardoso J.M., Palma B., Silva B. Toward a Token-Based Approach to Concern Detection in MATLAB Sources. Proceedings of the 18th Portuguese Conference on Artificial Intelligence (EPIA 2017), Progress in Artificial Intelligence, Springer LNCS 10423, pp.573-584, September 2017 (PDF). DOI: 10.1007/978-3-319-65340-2_47 §       Fernandes J.M., Monteiro M.P. Evolution in the number of authors of computer science publications. Scientometrics Vol.110(2), pp.529-539, February 2017 (PDF). DOI: 10.1007/s11192-016-2214-9 §       Silva A.C.B.G.; Carneiro G. F.; Monteiro M.P., Abreu F.B.; Constantino K.F., Figueiredo E.M.L. On the Impact of Product Quality Attributes on Open Source Project Evolution. Proceedings of the 14th International Conference on Information Technology: New Generations (ITNG 2017), 2017, Las Vegas, USA  Springer 2017, pp. 12-17 (PDF). §       Silva A.C.B.G., Carneiro G.F., Figueiredo E.M.L., Abreu F.B., Monteiro M.P. The Influence of Software Product Quality Attributes on Open Source Projects: A Characterization Study. Proceedings of the International Conference on Enterprise Information Systems (ICEIS 2017), 2017, Porto  Portugal. Proceedings of the International Conference on Enterprise Information Systems (ICEIS 2017). Scitepress, 2017, pp. 7-19 (PDF). DOI: 10.5220/0006265400290039 2016 §       Silva A.C., Carneiro G.,Paula A., Monteiro M.P., Abreu F.B. Agility and Quality Attributes in Open Source Software Projects Release Practices. Proceedings of the 10th International Conference on the Quality of Information and Communications Technology (QUATIC2016), IEEE Computer Society, pp.107-112 (PDF). ISBN 978-1-5090-3581-6/16 DOI: 10.1109/QUATIC.2016.029 2015 §       Lessa I., Carneiro G., Monteiro M.P., Abreu F.B. Scaffolding MATLAB and Octave Software Comprehension Through Visualization. Proceedings of the 27th International Conference on Software Engineering and Knowledge Engineering (SEKE2015), pp.290-293. Pittsburgh, USA, 2015. DOI: 10.18293/SEKE2015-073 (PDF). §       Lessa I., Carneiro G., Monteiro M.P., Abreu F. A Concern Visualization Approach for Improving MATLAB and Octave Program Comprehension. Proceedings of the 29th Brazilian Symposium on Software Engineering (SBES2015), pp.130-139. Belo Horizonte, Brazil. 2015. (link;PDF) ISBN 978-1-4673-9272-3/15 DOI: 10.1109/SBES.2015.19 §       Lessa I., Carneiro G., Monteiro M.P., Abreu F. On the Use of a Multiple View Interactive Environment for MATLAB and Octave Program Comprehension. Proceedings of the 15th International Conference on Computational Science and Its Applications (ICCSA 2015), pp.640-654. (link;PDF) ISBN (print) 978-3-319-21409-2; ISBN (online) 978-3-319-21410-8. DOI: 10.1007/978-3-319-21410-8_49 §       Lessa I., Carneiro G., Monteiro M.P., Abreu F. A Multiple View Interactive Environment to Support MATLAB and GNU/Octave Program Comprehension. 12th International Conference on Information Technology - New Generations (ITNG 2015, IEEE publishing, pp.552-557). 13-15 April 2015. (link;PDF) ISBN 978-1-4799-8827-3 DOI: 10.1109/ITNG.2015.93 2013 §       Cardoso J., Fernandes J., Monteiro M.P., Carvalho T., Nobre R. Enriching MATLAB with aspect-oriented features for developing embedded systems. Journal of Systems Architecture. Vol.59(7), August 2013, pp.412428, Elsevier (PDF). ISSN 1383-7621. DOI: 10.1016/j.sysarc.2013.04.003 §       Monteiro M.P., Gomes J.L. Implementing design patterns in Object Teams. Software: Practice and Experience. Volume 43, Issue 12, pp.15191551, December 2013. Published online: 2012-09-18. John Wiley & Sons (PDF). DOI: 10.1002/spe.2154. 2012 §       Monteiro P., Monteiro M.P. Documenting Patterns with Business Process Models. Proceedings of the 19th Conference on Pattern Languages of Programs (PLoP 2012), pp.15:1-15:16. Tucson, AZ, USA, October 2012 ISBN 978-1-4503-2786-2. (PDF) §       Bariic A., Monteiro P., Amaral V., Goulão M., Monteiro M.P. Patterns for Evaluating Usabi",
  "content_length": 18110,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:32"
}