{
  "name": "Miguel Matos",
  "homepage": "http://haslab.uminho.pt/mmatos",
  "status": "success",
  "content": "High-Assurance Software - INESC TEC Cookies Policy The website need some cookies and similar means to function. If you permit us, we will use those means to collect data on your visits for aggregated statistics to improve our service. Find out More Accept Reject ' Home Centres High-Assurance Software CentreHigh-Assurance SoftwareMore InformationHASLab<More InformationFacts & Numbers000PresentationHigh-Assurance SoftwareHASLab is focused on the design and implementation of high-assurance software systems: software that is correct by design and resilient to environment faults and malicious attacks. To accomplish this mission, HASLab covers three main competences — Cybersecurity, Distributed Systems, and Software Engineering — complemented by other competences such as Human-Computer Interaction, Programming Languages, or the Mathematics of Computing. Software Engineering – methods, techniques, and tools for rigorous software development, that can be applied to the internal functionality of a component, its composition with other components, as well as the interaction with the user.Distributed Systems – improving the reliability and scalability of software, by exploring properties inherent to the distribution and replication of computer systems.Cybersecurity – minimize the vulnerability of software components to hostile attacks, by deploying structures and cryptographic protocols whose security properties are formally proven. Through a multidisciplinary approach that is based on solid theoretical foundations, we aim to provide solutions — theory, methods, languages, tools — for the development of complete ICT systems that provide strong guarantees to their owners and users. Prominent application areas of HASLab research include the development of safety and security critical software systems, the operation of secure cloud infrastructures, and the privacy-preserving management and processing of big data.Latest NewsOur Latest NewsView all NewsComputer Science and EngineeringQuien sabe por Algebra, sabe scientificamente” – the retirement of José Nuno Oliveira marks an era in Computer Science at UMinhoMore than four decades have passed since José Nuno Oliveira first stepped into the University of Minho (UMinho). On 14 November, Auditorium A1 at the Gualtar Campus in Braga was the setting for a farewell that stirred emotions and memories. The UMinho community – and beyond – gathered to celebrate José Nuno Oliveira’s dedication to teaching, research, and the training of generations in Computer Engineering. 28th November 2025INESC TEC positions national supercomputing at the forefront of EuropeINESC TEC has once again placed itself at the heart of European decision-making – this time in the field of supercomputing. On 10 November, the European Commission’s Executive Vice-President, Henna Virkkunen, visited the Deucalion supercomputer, installed at the University of Minho (UMinho), in Guimarães. The visit highlighted Portugal’s contribution to the European Union’s digital and scientific strategy in this domain. 27th November 2025Computer Science and EngineeringINESC TEC participated in a debate on the future of data centres in PortugalWhat steps must be taken to ensure sustainable and efficient data centres in Portugal? And what role can supercomputing play in this process? INESC TEC took part in an initiative organised by APDC – Digital Business Community, in collaboration with VdA and Portugal Data Centers, to discuss the installation, operation and future of these infrastructures in the country.26th November 2025Computer Science and EngineeringINESC TEC strengthened international position with new contributions in the field of storage systems and networksLast month, the Institute participated in two of the most prestigious international conferences in databases and networks – VLDB and SIGCOMM. The researchers brought to the international debate new frontiers in storage, fault tolerance, and operating systems. 29th October 2025Computer Science and EngineeringINESC TEC researchers developed a new hybrid algorithm that improves the reliability of quantum computingINESC TEC researchers have developed a new hybrid quantum–classical algorithm that promises to make quantum computing more practical and resilient to the challenges posed by current quantum devices. The research work “Bayesian Quantum Amplitude Estimation” proposes an innovative approach to one of the fundamental tasks in quantum computing – amplitude estimation – with applications in fields like engineering, finance, and Artificial Intelligence. 29th October 2025View all News001Projects BigHPCA Management Framework for Consolidated Big Data and HPC2020-2023ProjectsTeamAlcino Cunha Centre CoordinatorAntónio Luís Sousa Centre CoordinatorCatarina Leones Fernandes Advisor to the Centre CoordinatorViewClose AlphabetViewClose AlphabetabcdefghijklmnopqrstuvwxyzAdriano Novo MaiorResearcherAlexandra Sofia MendesSenior ResearcherAlexandre Almeida FilhoExternal StudentAlexandre Rodrigues FernandesResearch AssistantAlexis GonzalezExternal Research CollaboratorAlícia OliveiraResearcherÁlvaro Festas SilvaResearch AssistantAna Isabel NeriExternal StudentAna Margarida SousaResearch AssistantAna Nunes AlonsoAssistant ResearcherAndré de SousaExternal StudentAndré Lucena FerreiraResearch AssistantAndré Manuel SequeiraAssistant ResearcherAndré Martins PereiraSenior ResearcherAndré Silva GonçalvesResearch AssistantAndreia Sofia GaudêncioExternal Research CollaboratorAntónio Nestor RibeiroSenior ResearcherBeatriz CepaResearch AssistantBeatriz Ramada MacedoExternal StudentBernardo Luís PortelaSenior ResearcherBernardo MalacaExternal Research CollaboratorBruna Filipa SalgadoExternal StudentBruno Dias GiãoResearch AssistantBruno Filipe JardimExternal StudentBruno Filipe PereiraResearch AssistantCarlos Alberto RibeiroExternal StudentCarlos António FelgueirasResearch AssistantCarlos António SousaExternal StudentCarlos BaqueroArea ManagerCarlos Eduardo MachadoResearch AssistantCarlos Leite MachadoResearch AssistantCláudia Vanessa BritoAssistant ResearcherDaniel Barros TinocoResearch AssistantDaniel Matias CarvalhoResearch AssistantDaniel Silva PereiraExternal StudentDiana Abreu RodriguesExternal Research CollaboratorDiogo Alexandre MarquesResearch AssistantDiogo José RibeiroResearch AssistantDiogo Manuel PiresExternal Research CollaboratorDiogo Pinto RibeiroResearch AssistantDuarte Afonso RibeiroExternal StudentEdgar Eira AraújoResearch AssistantEzequiel José MoreiraResearch AssistantFábia PereiraAdministrative AssistantFábio André CoelhoSenior ResearcherFabio Moreira SouzaExternal StudentFilipe Simões PereiraExternal StudentFrancisca Mieiro CoelhoExternal StudentFrancisca Quintas BarrosResearch AssistantFrancisco Almeida MaiaSenior ResearcherFrancisco Justo FernandesResearch AssistantFrancisco Miguel CruzExternal Research CollaboratorFrancisco MouraExternal Research CollaboratorFrancisco Xavier FerrazExternal StudentGabriel Marcos MagalhãesExternal Research CollaboratorGonçalo Duarte MarinhoResearch AssistantGonçalo Figueiredo FerreiraExternal StudentGonçalo Manuel SousaResearch AssistantGonçalo Medeiros RaposoResearch AssistantGuilherme Lima FernandesExternal StudentGuilherme Rosas BorgesResearch AssistantGustavo Silva PereiraExternal StudentHélder Maia MartinsExternal StudentHenrique José FariaResearch AssistantHenrique Sardo FernandesResearch AssistantHugo Afonso GiãoResearch AssistantHugo Pereira PachecoSenior ResearcherHumberto Gil GomesResearch AssistantIon ChiricaExternal StudentIsabel André AmaralResearch AssistantJácome Costa CunhaResearcherJaime Pereira SantosResearch AssistantJoão Alexandre SaraivaResearch CoordinatorJoão Carlos FreitasExternal StudentJoão Carlos NovaisResearch AssistantJoão Diogo DuarteResearch AssistantJoão MacedoExternal Research CollaboratorJoão MarcoSenior ResearcherJoão Paulo PeixotoExternal StudentJoão Pedro ParenteResearch AssistantJoão Tiago PauloSenior ResearcherJorge Sousa PintoResearch CoordinatorJosé Bacelar AlmeidaSenior ResearcherJosé Bernardo BarrosSenior ResearcherJosé Creissac CamposResearch CoordinatorJosé Emanuel RodriguesExternal StudentJosé Gomes FerreiraExternal StudentJosé Manuel ValençaExternal Research CollaboratorJosé MirandaExternal Research CollaboratorJosé Nuno MacedoExternal Research CollaboratorJosé Nuno OliveiraResearch CoordinatorJosé Orlando PereiraResearch CoordinatorJosé Paiva ProençaExternal Research CollaboratorJosé Pedro FernandesExternal Research CollaboratorJosé Pedro PeixotoResearch AssistantJuliana Andreia MarquesResearch AssistantJuliana Patrício SouzaResearch AssistantJúlio Medeiros PintoResearch AssistantLarissa Ferreira dos SantosExternal Research CollaboratorLucas Ribeiro PereiraExternal Research CollaboratorLuís Esquível CostaExternal StudentLuís Manuel FerreiraResearch AssistantLuís Manuel PereiraExternal StudentLuís Paulo SantosSenior ResearcherLuís Soares BarbosaResearch CoordinatorLuís Wolffrom BarbosaResearch AssistantMafalda Francisco AlvesResearch AssistantManuel BarbosaManuel José CarvalhoResearch AssistantManuel Quintas BarrosResearch AssistantMarco Rocha FerreiraResearch AssistantMaria João FradeSenior ResearcherMaria José RamosResearch AssistantMariana Araújo AmorimExternal Research CollaboratorMariana Martins MirandaResearch AssistantMarwa ChnibExternal StudentMichael OliveiraExternal StudentMiguel PeixotoTechnical SpecialistMiguel Sousa BragaResearch AssistantMohd Zuhier FreajExternal Research CollaboratorNico Maximilian WittrockResearch AssistantNikhil ShirsathResearcherNuno Almeida MachadoExternal Research CollaboratorNuno Filipe FariaResearcherNuno Henrique RebeloExternal StudentNuno Luís MatosResearch AssistantNuno Moreira MacedoSenior ResearcherOlga PachecoSenior ResearcherPatrícia RouparAdministrative AssistantPaula Cristina RodriguesCommunication ManagerPaula Frederika MarquesExternal StudentPaulo Jorge AzevedoSenior ResearcherPaulo Sérgio AlmeidaSenior ResearcherPedro Alexandre SousaPedro D",
  "content_length": 20931,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:36"
}