{
  "name": "Miguel Campercholi",
  "homepage": "http://ual.famaf.unc.edu.ar/index.php/home/miguel-campercholi",
  "status": "success",
  "content": "Miguel Campercholi, 2015-11-26: “Definibilidad en lógica de primer orden” – Universal Algebra & Logic Research Group Skip to content psterraf24 November 201513 February 2025 Logic Seminar No Comments Esta semana el Seminario de Lógica se integra al “Día de la Matemática” a realizarse el jueves 26 de noviembre de 14 a 18 hs en el Aula Magna de FaMAF. Esta jornada, a iniciativa de la Comisión Asesora de Matemática (CAM), tiene por objetivo que los grupos de investigación de Matemática de esta Facultad expongan sus resultados actuales, haciéndolos accesibles al resto de la sección y posibilitando interacciones y la comunicación con todos los doctorandos y alumnos avanzados de la Licenciatura. La charla del área de Semántica Algebraica (nombre institucional del grupo de Álgebra Universal y Lógica) estará a cargo de Miguel Campercholi (CIEM- FaMAF) y está programada a las 17:00 hs. El título y resumen son los siguientes. Título: Definibilidad en lógica de primer orden Resumen: La lógica de primer orden (LPO) es un lenguaje formal diseñado para expresar propiedades de estructuras matemáticas como grafos, grupos, cuerpos, etcétera. Si bien la LPO es un lenguaje muy limitado en comparación a un lenguaje como el castellano, tiene virtudes muy atractivas para la investigación matemática. Quizás la más importante es que convierte las “propiedades de estructuras” en objetos formales que pueden ser investigados. Otra de sus virtudes es que cuenta con un cálculo deductivo completo, es decir, un conjunto preciso de reglas sintácticas que permiten deducir todas las consecuencias de un conjunto inicial de propiedades. Este aspecto fundamental hace posible el desarrollo de métodos de deducción automática. Las oraciones de la LPO (llamadas fórmulas) tienen como sujetos a variables que representan elementos de una estructura, y permiten expresar relaciones entre estos sujetos. Por ejemplo, la oración $ϕ(x):=∀yx⋅y=y⋅x se cumple para un elemento a en un grupo G (notación G⊨ϕ(a)), sii a pertenece al centro de G.  Otro ejemplo es la fórmula σ(x,y):=y⋅y=x, que vale para elementos (a,b) de un cuerpo K sii b es una raíz cuadrada de a. Dada una estructura A y una fórmula φ(x1,…,xn) el conjunto [φ]A:={(a1,…,an)∈An∣A⊨φ(a¯)} se llama la relación definida por φ en A. El estudio de la definibilidad consiste en describir para una estructura, o clase de estructuras, cómo son las relaciones definibles. La importancia de este estudio reside en que las relaciones definibles son exactamente los objetos semánticos que pueden nombrarse utilizando la LPO, i.e., los posibles “significados” de las oraciones del lenguaje formal. Contar con una caracterización de los mismos permite un mayor entendimiento del poder expresivo del lenguaje; sus posibilidades y también sus limitaciones. La definibilidad puede especializarse utilizando versiones restringidas de la LPO, por ejempo a oraciones sin negaciones. El grupo de Semántica Algebraica lleva adelante hace varios años una línea de investigación centrada en la definibilidad por fórmulas sin cuantificadores, negaciones ni disyunciones. Especialmente definibilidad de gráficos de funciones por este tipo de fórmulas.  Expondremos algunos resultados obtenidos y discutiremos las técnicas empleadas en el área. (source) Definability, First-order logic ← TCD en el IMAL Congratulations to Pablo Ventura! → Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Archivos January 2025 December 2019 November 2019 October 2019 September 2019 June 2019 May 2019 April 2019 September 2017 May 2017 February 2017 June 2016 May 2016 April 2016 March 2016 December 2015 November 2015 October 2015 September 2015 Categorías Logic Seminar News",
  "content_length": 3840,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:32"
}