{
  "name": "Miguel López-Benítez",
  "homepage": "https://liverpool.ac.uk/electrical-engineering-and-electronics/staff/lopez-benitez",
  "status": "success",
  "content": "Dr Miguel Lopez-Benitez | Our people | University of Liverpool Skip to main content Close Search Find courses, people, research, information and more. Please ignore What types of page to search? All Courses Academic staff News Events Search Popular pages: Undergraduate Postgraduate PhD Accommodation Research International students Alternatively use our A-Z index. About I received the PhD degree in Telecommunication Engineering (highest distinction, summa cum laude) from the Department of Signal Theory and Communications of the Technical University of Catalonia, Barcelona, Spain in 2011. From 2011 to 2013, I was a Research Fellow in the Centre for Communication Systems Research (currently Institute for Communication Systems) of the University of Surrey, Guildford, UK. In 2013, I joined the Department of Electrical Engineering and Electronics of the University of Liverpool, UK as a Lecturer (Assistant Professor), where I have been a Senior Lecturer (Associate Professor) since 2018. Since 2018, I have also been an Affiliate Senior Research Associate with the ARIES Research Centre, Antonio de Nebrija University, Madrid, Spain. My research interests are in wireless communication systems, with special emphasis on several theoretical and experimental aspects of cellular mobile communication technologies, dynamic/shared spectrum access, and wireless Internet of Things (among others). I am/have been the principal investigator of research projects competitively funded in the UK by the Engineering and Physical Sciences Research Council (EPSRC), the Department for Business, Energy and Industrial Strategy (BEIS), the Royal Society and the UK-India Education and Research Initiative (UKIERI). I have also been involved in European-funded projects (AROMA, NEWCOM++, FARAMIR, QoSMOS and CoRaSat). I have co-authored four book chapters and over 150 papers in refereed journals and recognised conferences. I am Associate Editor of IEEE Access, IET Communications, and Wireless Communications and Mobile Computing and have served as guest editor for other journals. I have been a member of the Organising Committee for the IEEE International Workshop on Smart Spectrum (IWSS 2015-21). I have also been TPC for several IEEE conferences (GLOBECOM, ICC, WCNC, PIMRC, VTC). I am a Senior Member of the Institute of Electrical and Electronics Engineers (IEEE) and a Fellow of the Higher Education Academy (HEA). PhD / Post-doc opportunities: click here Please visit my personal website for updated details: Personal website Prizes or Honours Named in the Stanford University List of World Top 2% Scientists in 2024 (Stanford University, 2024) Named in the Stanford University List of World Top 2% Scientists in 2023 (Stanford University, 2023) Named in the Stanford University List of World Top 2% Scientists in 2022 (Stanford University, 2022) Recognition of significant contribution to EPSRC Peer Review (Top 4% in the academic year 2020/21) (EPSRC, 2022) Named in the Stanford University List of World Top 2% Scientists in 2021 (Stanford University, 2021) Named in the Stanford University List of World Top 2% Scientists in 2020 (Stanford University, 2020) Best Paper Award (IEEE International Conference on Wireless Networks and Mobile Communications 2019, 2019) Exemplary reviewer of IEEE Wireless Communications Letters 2017 (Institute of Electrical and Electronics Engineers (IEEE), 2017) IEEE Access Reviewer Award (Institute of Electrical and Electronics Engineers (IEEE), 2015) Outstanding PhD Thesis Award 2011 (Department of Signal Theory and Communications, Technical University of Catalonia (UPC), 2011) Best Tutorial Paper Award 2014 (IEICE Communications Society, 2014) Finalist for the IET Innovation Awards 2012 (2012) France Telecom Foundation Special Award (5th Archimedes University Competition for Young Researchers, Spanish Ministry of Education and Science, 2006) University Education National Award 2006 (Spanish Ministry of Education and Science - Best GPA in MSc Telecommunications Engineering in Spain in 2006, 2006) University Education National Award 2003 (Spanish Ministry of Education and Science - Best GPA in BSc Telecommunications Engineering in Spain in 2003, 2003)",
  "content_length": 4205,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:33"
}