{
  "name": "Miguel A. Nacenta",
  "homepage": "https://nacenta.com",
  "status": "success",
  "content": "Miguel Nacenta | Visualization, Human-Computer Interaction, Infotypography Pages Research Research Areas & Projects InfoTypography InfoTypography InfoTypography InfoTypography InfoTypography: Resources Perceptual Input/Output Devices FatFonts FatFont example Gallery Information Visualisation Publications Media Coverage Prospective Student Academic Service About Miguel Living and working in the St Andrews area + There is quite a bit of talk these days about ungrading, but this post does not go in this direction. Grades are clearly emotional to students, which might partially explain why they make students so anxious and, simultaneously, so obsessed with them. But this post is also not about this. This post is about the less-told side of what grading means to the instructor and, in particular, to an instructor that has created the evaluation. An important start point is that setting up evaluations is hard. My students seem shocked when I tell them that it takes me between one and two full days or work to write a midterm. This is one of these things that do look very different from the other side. The students are probably thinking: well, this guy has 10-15 years of education and knows it all about the topic, so this job is mostly about putting things on paper and formatting. Well, no: as instructors we have to work hard to make sure that any evaluation aligns with the learning objectives (and really tests them), that is not easy to subvert (makes cheating harder than not cheating), that it is clear an unambiguous, that it is not too difficult (because this means too much work later on, and unhappy students), that it is not too easy (since it would remove the student’s incentive to learn), that can be marked fairly (this is trickier than it sounds), and that it does not make my life miserable (i.e., that it does not take forever to mark). In other words, setting up evaluations is a complex multi-objective optimization problem that also requires lots of creativity. And this is all assuming that the midterm is in person and not take home, which adds the risk of being chatGPTized… Then, once you think you have a good midterm/final exam etc., (or you run out of time), it’s time for the actual test. When this happens in person (i.e., in a large room) it is not unusual to see students leave the exam about 25 minutes in (for a 50 minute exam). Doubts start to creep in… was the midterm too easy? Too difficult? Did I implicitly provide answers to the questions in the class? — time passes and then you have the opposite set of doubts… why are there still so many people who seem to be in the middle of it? Was it too difficult? will I be ruining student’s life’s because of my zeal to make my questions climb up Bloom’s taxonomy little pyramid? In my experience this is usually OK, just the expression of the amazing variability of human timing, behaviour and skill (note: I recognize the issues with timed examinations and how excluding they can be, but this is a discussion for another day). Now you got your filled exams, and it is time to grade. This is the most nerve-wracking part of the process. It goes like this: The first one is terrible. It is like they did not understand the question, or they attended a set of lectures of a different course in a different department. It’s very difficult to keep the inner doubts at bay and remain calm and objective; no matter how many times you have read and re-read the questions, you read them again… is there a possibility that this question could reasonably be interpreted in that other strange way? Am I just a gatekeeper of a language and a way to look at the material that is personal, biased and unfair? The second one is terrible again, but in completely different ways. Were my lectures awful? Was it impossible to get to a reasonable solution with the material, help and time that I have provided during the class? Your mind starts coming up with possible ways to grade more generously… is is fair to give some points just for writing anything in the box? What happens if everyone fails the midterm? The third one is quite good. Sigh of relief! At least someone gets something! The fourth one is perfect… How nice! But… did I really teach them anything? Is it possible that they did already know the stuff? The fifth one is perfect again… was the exam too easy? Did I make it too easy to cheat? how is this possible? And, of course, after a while you tend to get the full range of answers, with some mistakes more common than others. If you are not grading blind to the name of the student (I prefer blind, although it can be logistically harder than it seems), some answers do seem like a disappointment, almost a betrayal. And, occasionally, you can feel a bit of pride on what you have done. I expect that the experience of the instructor may vary significantly, especially depending on personality. However, the roller-coaster that I’ve described above is still, for me, and after many years of setting up evaluations and grading, pretty much unchanged. In summary, we try to be neutral and fair, and leave emotion aside, but grading is hard work, not only because it is tedious work that simultaneously requires a large mental load to be consistent, but because it is emotional work. The only things that I found that soften the experience a bit for me: Remind myself that students are people with circumstances. They could have a bad day, a caring duty, a friend in distress, food insecurity (help if you can!). Recognize that it is not personal. A bad answer is not an insult, and most often than not, it does not reflect the attitude of the student towards you. How does grading feel to you as a student or an instructor/grader? What are your tricks? This week I will be presenting at ACM SIGGRAPH (the top conference in graphics and one of the most prestigious in Computer Science) the work that Johannes Lang and I have done in Infotypography. We looked at how people perceive typographic parameters. This could support the use of these parameters to represent information. Here is a teaser of the talk (30 seconds): Here is a fuller, 15 min presentation (): Here are two links to the paper:https://doi.org/10.1145/3528223.3530111Local copy Here is a website with resources for using it:https://nacenta.com/infotypography For those of you who are in Vancouver attending SIGGRAPH, the presentation is: When: Thursday August 11, 2022Where: East Building, Ballroom CSession: Perception A paper on our work about how people think about constraint programming has just been published in anticipation of the prestigious Conference on Principles and Practice of Constraint Programming (CP 2022). The paper is accessible through this address. The work takes place at the intersection of Human-Computer Interaction and Constraint Programming. We analyzed how non-experts tried to solve constrained programming problems. Image showing a few examples of how people solved common constraint programming problems, such as scheduling. This is work with Ruth Hoffmann, Xu Zhu, and Özgür Akgün, from the School of Computer Science at the University of St Andrews (my previous main institution). This follows our previous work on how people visually represent discrete contraint problems (at the IEEE Transations on Visualization and Computer Graphics). Dr Hoffmann has also presented at ModRef a synthesis on both pieces of work. Finally, the SACHI group posted a blog post with a bit more information. TLDR; If you are not backing up your data, do it now. If you back up your data but have not tested if you can recover it, do it now. If you are using LiveDrive to back up your data, you might not be as prepared as you think. My Previous Data Life For a very long time I have stored my data in an external drive. Why? Mostly because I do not want the main output from my employment to be locked in a single computer. Often it is very convenient to be able to access the data from another computer. Also, when there is a fire alarm, my drive is the only thing I take. I know that the cloud is a good alternative, but I like to have the data locally and there is something unsettling about trusting Google or Dropbox with your entire digital life and work. Of course, external drives fail, so I have purchased a subscription to a service which backs up my data on-line, away from my physical location, for over 12 years now. The Incident One day I arrive home, set up my USB hard drive on my computer, and the drive does not start. Or rather, it tries to partially start, but fails in a sequence of odd ways.No biggie… I should be able to recover all files. It is going to take quite a while (it’s close to 1TB), but I should be covered! I am Prepared… or am I? Well, after wiping off the sweat from my brow, and taking a glass of water, I set out to the unpleasant and boring (but necessary) task of recovering my data. The most urgent staff first in my computer’s fixed hard drive first, and then the rest on a new external drive that I have ordered. Everything should be in my LiveDrive, right? Well, the first unpleasant surprise is that LiveDrive downloads my files really really really slow. A full day of data recovery does not even start to make a dent in the 0.8 GB of data (approx) that I had backed up. I’m in a good connection, but maybe it is that the data is stored in Europe (where I used to live), and has to go under the water to get to me. I try a few things to solve this, including a VPN, but it turns out that this is not the problem. The service is extremely slow seemingly because it goes file by file, and it checks the status of each file individually, blocking the download until one file has been done. The download is decent when the file is large, but when you have a folder full of small files (e.g., Thunderbird’s e-mail folders, it slows down to a crawl. Unfortunately, the livedrive interface only lets you select folders, or files, recursively, but in one folder at a time. Additi",
  "content_length": 38456,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:26"
}