{
  "name": "Miguel Pupo Correia",
  "homepage": "http://www.gsd.inesc-id.pt/~mpc",
  "status": "success",
  "content": "Miguel Pupo Correia's homepage miguel pupo correia bio and contacts Miguel Correia is a Full Professor (Professor Catedrático) at the Computer Science and Engineering Department (DEI), Instituto Superior Técnico (IST), Universidade de Lisboa (ULisboa), in Lisboa, Portugal. He is President of the Executive Committee of INESC-ID, as well as a researcher of the Distributed, Parallel and Secure Systems (DPSS) scientific area. He is national representative at the European Blockchain Partnership that is designing the European Blockchain Services Infrastructure (EBSI). He is a non-executive member of the Board of Associação .PT. He is Associate Editor for IEEE Transactions on Computers. He has a PhD in Computer Science from the Universidade de Lisboa Faculdade de Ciências. He has been involved in several international and national research projects related to cybersecurity, including the BIG, TRUSTyFOOD, DE4A, QualiChain, SPARTA, SafeCloud, PCAS, TCLOUDS, ReSIST, CRUTIAL, and MAFTIA European projects. He has more than 200 publications and is Senior Member of the IEEE. His research focuses on cybersecurity and dependability (fault tolerance) in distributed systems and in the context of different areas (blockchain, cloud, mobile). Miguel Correia é Professor Catedrático do Departamento de Engenharia Informática do Instituto Superior Técnico da Universidade de Lisboa. Actualmente é Presidente da Comissão Executiva do INESC-ID e investigador da área Distributed, Parallel and Secure Systems (DPSS). É representante nacional na European Blockchain Partnership (EBP) e membro não executivo da direção da Associação .PT. Tem estado envolvido em muitos projectos de investigação internacionais, entre os quais os projectos BIG, TRUSTyFOOD, DE4A, QualiChain, SPARTA, SafeCloud, PCAS, TCLOUDS, ReSIST, CRUTIAL e MAFTIA. Tem mais de 200 publicações. Os seus principais interesses são a cibersegurança e a confiabilidade em sistemas distribuídos e no contexto de diferentes áreas (blockchain, cloud, móvel). email: miguel.p.correia_AT_tecnico.ulisboa.pt students research topics 1. Blockchain and Byzantine Consensus 2. Cloud Security and Dependability 3. Trusted Computing 4. Software Security 5. Security Analytics and Intrusion Detection Other topics publications • Belchior et al. A Brief History of Blockchain Interoperability, CACM 2024 • Augusto et al. SoK: Security and Privacy of Blockchain Interoperability, IEEE S&P 2024 • Correia et al. Using Range-Revocable Pseudonyms to Provide Backward Unlinkability in the Edge, ACM CCS 2023 • Vaz et al. Synthesis of Fault-Tolerant Reliable Broadcast Algorithms with Reinforcement Learning, IEEE Access 2023 • Belchior et al. A Survey on Blockchain Interoperability: Past, Present, and Future Trends, ACM CSUR 2022 • Andrade et al. SRX - Secure Data Backup and Recovery for SGX Applications, IEEE Access 2022 • Matos et al. Sanare: Pluggable Intrusion Recovery for Web Applications, IEEE TDSC 2022 • Faria and Correia BlockSim: Blockchain Simulator, IEEE Blockchain 2019 • Nunes et al. Benchmarking Static Analysis Tools for Web Security, IEEE Trans. Reliability 2018 • Medeiros et al. Detecting and Removing Web Application Vulnerabilities with Static Analysis and Data Mining, IEEE Trans. Reliability 2015 • Bessani et al. SCFS: a Shared Cloud-backed File System, Usenix ATC 2014 • Bessani et al. DepSky: Dependable and Secure Storage in a Cloud-of-Clouds. ACM Trans. Storage 2013. • Veronese et al. Efficient Byzantine Fault Tolerance, IEEE Trans. Computers 2013. projects • BLOCKCHAIN.PT - Agenda Descentralizar Portugal com Blockchain (PT)\t• ACES - Autopoietic Cognitive Edge-cloud Services (EC)\t• TRUSTyFOOD - Stakeholders-driven pathways for blockchain implementation in the agri-food sector (EC)\t• BIG - Enhancing the research and innovation potential of Tecnico through Blockchain technologies and design Innovation for social Good (EC) software • WAP - automatic Web Application Protection (23,000 downloads!) (also a OWASP project) - static analysis tool for PHP web applications • RRP/EDGAR - Range-Revocable Pseudonyms for backward unlinkability• Tracer - Blockchain for Supply Chain Traceability and Governance in the Agri-food Sector• C2BID and DynIDS - cluster-based network intrusion detection schemes • SRX - SGX Recovery Extension - Intel SGX extensions for securely moving data between enclaves • TRX - TrustZone Recovery eXtension - ARM TrustZone extensions for securely moving data between TEEs • Qualichain - consortium of organizations management with Ethereum-based smart contracts • BlockSim - a discrete event Blockchain simulator • GT-Tool 1 and GT-Tool 2 - static analysis tool for web applications extensible for several languages • MERLIN - Multi-Language Web Vulnerability Detection - static analysis tool for web applications in several languages • PSMA - Programmable Sandbox for Malware Analysis - malware dynamic analysis system for programmable and repeatable experiments • SafeCloudFS/RockFS - single cloud and cloud-of-clouds file system resilient to client side attacks • MIRES - intrusion recovery system for Backed-as-a-Service / mobile applications • Rectify - black-box intrusion recovery system for PaaS clouds • MultiTLS - middleware based on diversity and tunneling for keeping communication channels secure even when new vulnerabilities are discovered • PREMIUM - Private REactive MultIpath commUnication Middleware - secure communications using multiple communication paths • DepSky cloud-of-clouds storage - secure and dependable cloud storage using a set of clouds • MinBFT, MinZyzzyna, Spinning and EBAWA - Byzatine fault-tolerant replication libraries (MinBFT in the Hyperledger project) • RITAS - Randomized Intrusion-Tolerant Asynchronous Services - randomized BFT library events • 56th Annual IEEE/IFIP International Conference on Dependable Systems and Networks - DSN 2026 - PC Co-Chair • Blockchain Confluence 2025 • 44th International Symposium on Reliable Distributed Systems - SRDS 2025 • 34th USENIX Security Symposium - 2025 • International Conference on WEB3: Tokenization, Technology and Culture • 40th International Conference on ICT Systems Security and Privacy Protection  IFIP SEC 2025 • 45th Annual IEEE International Conference on Distributed Computing Systems - ICDCS 2025 • 55th Annual IEEE/IFIP International Conference on Dependable Systems and Networks - DSN 2025 • 55th Annual IEEE/IFIP International Conference on Dependable Systems and Networks - Rising Star Award Committee • 1st International Workshop on Dependable and Secure Web3, Blockchain and Smart Contracts - DepWeb3 2025 • 40th ACM/SIGAPP Symposium on Applied Computing, Software Protection and Reverse engIneering Track (SPIRIT) - SAC 2025 teaching (grad./undergrad.) teaching (professionals) • Blockchain, Web3 e Tokenização • Proteção e Segurança de Dados para Profissionais não Tecnológicos • Cibersegurança para Empresas talks • Blockchain and Digital Identity - SSI, DIDs, VCs, and the EBSI • Blockchain Interoperability: From Vulnerabilities to Attacks • Digital Identity in the Blockchain Era My profile at Google Scholar, ACM, DBLP, Scopus, ORCID, LinkedIn, Ciência Vitae home",
  "content_length": 7180,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:32"
}