{
  "name": "Mihai Pop",
  "homepage": "https://www.cs.umd.edu/people/mpop",
  "status": "success",
  "content": "Mihai Pop | UMD Department of Computer Science Skip to main content Explore People People FacultyFaculty Awards In Memoriam Staff Dept. PhonebookFaculty Staff Students As PDF University Directory Search People Overview Name Search by name Title Search by title Location Search by location Apply Reset Mihai Pop Professor Co-director, University of Maryland Center of Excellence in Microbiome Sciences Email: m[.dot.]popacm[.dot.]org Phone: (301) 405-7245 Location: IRB 3222 Website: https://www.pop-lab.org Google Scholar: 4glkLD0AAAAJ Education: Ph.D., Johns Hopkins University, 2000 Appointments: CS, UMIACS, CBCB Research Areas: Bioinformatics and Computational Biology Interest Areas: bioinformatics, genomics, computational geometry, computer graphics, software testing Biography Mihai Pop is a professor of computer science and co-director of the University of Maryland Center of Excellence in Microbiome Sciences.  He develops computational approaches for analyzing microbial communities, particularly for characterizing their strain-level diversity. Other interests include biological databases, antibiotic resistance, and software testing. His lab has developed several widely used open-source software tools for the analysis of genomic and metagenomic data, including software for sequence alignment, genome and metagenome assembly, sequence clustering, and for assessing metagenome associations with phenotypes. Pop teaches at all academic levels and is a strong advocate for inclusion and diversity within the scientific community. He has a particular interest in developing open educational resources for computer science and bioinformatics and he seeks new ways to engage students and promote critical thinking and learning in his classes. Pop holds a B.S. (1994, Politehnica University in Bucharest, Romania), and a Ph.D in Computer Science (2000, The Johns Hopkins University), and has joined the University of Maryland in 2005.  He is an MPower Professor, University of Maryland Strategic Partnership: MPowering the State, and fellow of the Association of Computing Machinery and of the International Society for Computational Biology. Honors and Awards Year Type Org. Name 2022 Fellow ISCB ISCB Fellow 2019 Fellow ACM ACM Fellow 2015 UMD Excellence in Teaching Award Students Advised Nathalie Bonin PhD Student Rain Haworth PhD Student Dinithi Wickramaratne PhD Student Mentions 2025 2 Science Terp Faculty Members Named MPower Professors 2019 Professor Mihai Pop named ACM Fellow 2015 Mihai Pop Awarded NSF Grant for Collaborative Metagenomics Research 2014 Ben Langmead Wins 2014 Sloan Research Fellowship 2013 Professors in the Computer Science department and UMIACS are part of research team awarded $19 million to study tobacco related health risks CBCB researchers Publish Software for Microbiome Association Statistics 2010 2010 Fall Colloquium: Mihai Pop Genome Biology Award 2009 Mihai Pop talks about CLuE Initiative 2008 Mihai Pop 1 2 next › last » Browse All News >>",
  "content_length": 2996,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:38"
}