{
  "name": "Mihai Ordean",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/ordean-mihai.aspx",
  "status": "success",
  "content": "Dr Mihai Ordean - School of Computer Science - University of Birmingham Dr Mihai Ordean School of Computer ScienceLecturer in Computer Science Contact details Emailm.ordean@bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Mihai Ordean is a lecturer for the School of Computer Science, at the University of Birmingham. He is also a member of the Birmingham Centre for Cyber Security and Privacy. His work is aimed at understanding how systems work from a security perspective, identifying flaws, and then proposing improvements. Currently he is working on cellular device security concerning protocol privacy and security, as well as implementations of cellular communication stacks such as LTE and 5G. Some of this work has led to collaborations with standardisation bodies (GSMA, Department of Transport) while other has been covered in the media (e.g. Forbes Magazine). Please follow the link below to find out more about Mihai's work: Dr Mihai Ordean - personal web page. Recent publications Article Wang, J, Cheng, Z, Ordean, M & Cui, B 2025, 'What-App? App Usage Detection Using Encrypted LTE/5G Traffic', Proceedings on Privacy Enhancing Technologies, vol. 2026, no. 1. Thomas, S, Van Den Herrewegen, J, Vasilakis, G, Chen, Z, Ordean, M & Garcia, F 2021, 'Cutting through the complexity of reverse engineering embedded devices', IACR Transactions on Cryptographic Hardware and Embedded Systems, vol. 2021, no. 3, pp. 360-389. https://doi.org/10.46586/tches.v2021.i3.360-389 Conference article Cheng, Z, Ordean, M, Garcia, FD, Cui, B & Rys, D 2023, 'Watching your call: breaking VoLTE privacy in LTE/5G networks', Proceedings on Privacy Enhancing Technologies, vol. 2023, no. 2, pp. 282-297. https://doi.org/10.56553/popets-2023-0053 Conference contribution Galindo Chacon, D, Liu, J, Ordean, M & Wong, J-M 2021, Fully distributed verifiable random functions and their application to decentralised random beacons. in 2021 IEEE European Symposium on Security and Privacy (EuroS&P)., 9581233, IEEE European Symposium on Security and Privacy (EuroS&P), IEEE, pp. 88-102, 6th IEEE European Symposium on Security and Privacy, 6/09/21. https://doi.org/10.1109/EuroSP51992.2021.00017 Ordean, M, Ryan, M & Galindo Chacon, D 2019, CAOS: Concurrent-Access Obfuscated Store. in Proceedings of the 24th ACM Symposium on Access Control Models and Technologies (SACMAT 2019). Proceedings of ACM Symposium on Access Control Models and Technologies, SACMAT, Association for Computing Machinery (ACM), pp. 13-24, 24th ACM Symposium on Access Control Models and Technologies, Toronto, Ontario, Canada, 4/06/19. https://doi.org/10.1145/3322431.3325101 Chothia, T, Ordean, M, De Ruiter, J & Thomas, RJ 2017, An attack against message authentication in the ERTMS train to trackside communication protocols. in ASIA CCS '17: Proceedings of the 2017 ACM on Asia Conference on Computer and Communications Security. Association for Computing Machinery , New York, NY, USA, pp. 743-756, ASIA CCS '17, Abu Dhabi, United Arab Emirates, 2/04/17. https://doi.org/10.1145/3052973.3053027 Schreuders, ZC, Shaw, T, Shan-A-Khuda, M, Ravichandran, G, Keighley, J & Ordean, M 2017, Security scenario generator (SecGen): A framework for generating randomly vulnerable rich-scenario VMs for learning computer security and hosting CTF events. in USENIX Workshop on Advances in Security Education 2017. USENIX Association, 2017 USENIX Workshop on Advances in Security Education, Vancouver, British Columbia, Canada, 15/08/17. <https://www.usenix.org/system/files/conference/ase17/ase17_paper_schreuders.pdf> Thomas, R, Ordean, M, Chothia, T & De Ruiter, J 2017, TRAKS: A Universal Key Management Scheme for ERTMS. in ACSAC 2017 Proceedings of the 33rd Annual Computer Security Applications Conference. Association for Computing Machinery (ACM), pp. 327-338, 33rd Annual Computer Security Applications Conference (ACSAC 2017), Orlando, Florida, United States, 4/12/17. https://doi.org/10.1145/3134600.3134631 Paper Thomas, RJ, Chothia, T & Ordean, M 2022, 'Cyber security in the rail sector - an integrated approach', Paper presented at World Congress on Railway Research 2022, Birmingham, United Kingdom, 6/06/22 - 10/06/22. Preprint Ordean, M & Garcia, FD 2022 'Millimeter-Wave Automotive Radar Spoofing' arXiv. https://doi.org/10.48550/arXiv.2205.06567 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 4560,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:39"
}