{
  "name": "Mijung Kim",
  "homepage": "https://mijungk.github.io",
  "status": "success",
  "content": "About me - Mijung Kim Mijung KimAssociate Professor at UNIST Contact Ulsan, South Korea EmailMijung is an associate professor at the Computer Science and Engineering department and AI Graduate School of UNIST (Ulsan National Institute of Science and Technology), South Korea. She is leading Software Testing and Analysis Research Lab at UNIST. Before joining UNIST, she worked as a postdoc researcher at Purdue University, USA. She obtained a PhD degree from Hong Kong University of Science and Technology.Her research focuses on automated software testing with an emphasis on test generation and its practical usage. Recently, she has been working on developing testing techniques for machine learning frameworks and applications. In the past, she also worked on defect prediction for API testing, regression testing on biomedical infrastructure, and detecting incomplete bug fixes.Research InterestsAutomated software testing and analysis in the artificial intelligence domain, test generation, fuzzing, search-based software engineering, regression testing, and defect prediction.For Prospective StudentsWe are looking for research students at all levels, undergraduate interns, MS, MS-PhD, and PhD. If you are interested, please send an email to Mijung at mijungk at unist dot ac dot kr. For more information about our lab, please visit our lab introduction page here.EducationPh.D Hong Kong University of Science and Technology, Hong Kong, ChinaM.S. Georgia Institute of Technology, Georgia, USAB.S. University of Illinois at Urbana-Champaign, Illinois, USAWork ExperienceAssociate Professor at UNIST, South KoreaAssistant Professor at UNIST, South KoreaPostdoc at Purdue University, USAVisiting scholar at Southern University of Science and Technology, Shenzhen, ChinaResearch assistant at Hong Kong University of Science and Technology, Hong Kong, ChinaResearch intern at Accenture Technology Lab, San Jose, California, USAGraduate research assistant at Georgia Institute of Technology, USASoftware engineer at Samsung Electronics Mobile Division, South KoreaPublications CMASan: Custom Memory Allocator-aware Address Sanitizer Junwha Hong, Wonil Jang, Mijung Kim, Lei Yu, Yonghwi Kwon, Yuseok Jeon. CMASan: Custom Memory Allocator-aware Address Sanitizer. S&P 2025. ToAppear. Lightweight Concolic Testing via Path-Condition Synthesis for Deep Learning Libraries Sehoon Kim, Yonghyeon Kim, Dahyeon Park, Yuseok Jeon, Jooyong Yi, Mijung Kim. Lightweight Concolic Testing via Path-Condition Synthesis for Deep Learning Libraries. ICSE 2025. ToAppear. How Effective are Large Language Models in Generating Software Specifications? Danning Xie*, Byoungwoo Yoo*, Nan Jiang, Mijung Kim, Lin Tan, Xiangyu Zhang, Judy Lee. How Effective are Large Language Models in Generating Software Specifications? SANER 2025. ToAppear. *: co-first authors. PDF Slides BibTeX Testing Diverse Geographical Features of Autonomous Driving Systems Seongdeok Seo, Judy Lee, Mijung Kim. Testing Diverse Geographical Features of Autonomous Driving Systems. ISSRE 2024. 439-450. PDF Slides BibTeX DocTer: Documentation-Guided Fuzzing for Testing Deep Learning API Functions Danning Xie, Yitong Li, Mijung Kim, Hung Viet Pham, Lin Tan, Xiangyu Zhang, Mike Godfrey. DocTer: Documentation-Guided Fuzzing for Testing Deep Learning API Functions. ISSTA 2022. 176-188. PDF Slides BibTeX DEVIATE: A Deep Learning Variance Testing Framework Hung Viet Pham, Mijung Kim, Lin Tan, Yaoliang Yu, Nachiappan Nagappan. “DEVIATE: A Deep Learning Variance Testing Framework” ASE 2021 Tool. PDF Slides BibTeX Novel Natural Language Summarization of Program Code via Leveraging Multiple Input Representations Fuxiang Chen, Mijung Kim, Jaegul Choo. “Novel Natural Language Summarization of Program Code via Leveraging Multiple Input Representations” EMNLP 2021. PDF Slides BibTeX Which Generated Test Failures are Fault Revealing? Mijung Kim, Shing-Chi Cheung, and Sunghun Kim. \"Which Generated Test Failures are Fault-revealing? Prioritizing Failures Based on Inferred Precondition Violations using PAF.\" ESEC/FSE 2018. 679-690. PDF Slides BibTeX REMI: Defect Prediction for Efficient API Testing Mijung Kim, Jaechang Nam, Jaehyuk Yeon, Soonhwang Choi, and Sunghun Kim. \"REMI: Defect Prediction for Efficient API Testing.\" ESEC/FSE 2015. 990-993. PDF Slides BibTeX Efficient Regression Testing of Ontology-driven Systems Mijung Kim, Jake Cobb, Mary Jean Harrold, Tahsin Kurc, Alessandro Orso, Joel Saltz, Andrew Post, Kunal Malhotra, and Shamkant B. Navathe. \"Efficient Regression Testing of Ontology-driven Systems.\" ISSTA 2012. 320-330. PDF Slides BibTeX An Informatics Framework for Testing Data Integrity and Correctness of Federated Biomedical Databases Mijung Kim, Tahsin Kurc, Alessandro Orso, Jake Cobb, David Gutman, Mary Jean Harrold, Andrew Post, Ashish Sharma, and Joel Saltz. \"An Informatics Framework for Testing Data Integrity and Correctness of Federated Biomedical Databases.\" AMIA Joint Summits on Clinical Research Informatics 2011. 22-26. PDF Slides BibTeX Automated Bug Neighborhood Analysis for Identifying Incomplete Bug Fixes Mijung Kim, Saurabh Sinha, Carsten Gorg, Hina Shah, Mary Jean Harrold, and Mangala Gowri Nanda. \"Automated Bug Neighborhood Analysis for Identifying Incomplete Bug Fixes.\" ICST 2010. 383-392. PDF Slides BibTeX Fault Localization and Repair for Java Runtime Exceptions Saurabh Sinha, Hina Shah, Carsten Gorg, Shujuan Jiang, Mijung Kim, and Mary Jean Harrold. \"Fault Localization and Repair for Java Runtime Exceptions.\" ISSTA 2009. 153-164. PDF Slides BibTeXMembersCurrent StudentsSehoon Kim, PhD. Fall 2022 ~ PresentMinsu Jung, MS-PhD. Spring 2025 ~ PresentYonghyeon Kim, MS. Spring 2024 ~ PresentJooyoung Jang, MS. Spring 2024 ~ PresentYunseo Lee, MS. Spring 2025 ~ PresentByoungwoo Yoo, Undergrad Intern. Winter 2022 ~ PresentSangjun Jung, Undergrad Intern. Fall 2025 ~ PresentAlumniDahyeon Park, MS. Graduated in 2025.Sangjune Park, MS. Graduated in 2024. (First job - SK Hynix, South Korea)Seongdeok Seo, MS. Graduated in 2024. (First job - Hyundai Motors, South Korea)Former VisitorsDr. Judy Lee from IBM, Research Assistant Professor at UNIST. Winter 2023 ~ Fall 2023Former Undergraduate InternsHwijun Kim, Usmonali Pakhlavonov, Aliona Pirozhenko, Thu Phuong Nguyen, Jaehyun Bhang, Youngchan Jung, Eunbi Oh, Gibeom Im, Jongmin Ahn, Soyeon ParkTeaching ExperienceInstructorUNIST. CSE 271: Principles of Programming Languages. Fall 2025, Fall 2021.UNIST. CSE 524: Advanced Software Engineering. Spring 2025, Fall 2023, Fall 2021.UNIST. CSE 324: Software Engineering. Spring 2024, Spring 2023, Spring 2021.UNIST. CSE 332: Theory of Computation. Spring 2022.UNIST, CSE 552: Program Analysis. Fall 2024, Spring 2022.UNIST. CSE 524: Advanced Software Engineering. Spring 2025, Fall 2023, Fall 2021.TalksGreybox Fuzzing for Deep Learning Libraries. McGill and Concordia University 2025Fuzzing Deep Learning APIs. National Security Research Institute and Korean Conference of Software Engineering 2025Testing for AI Software. Software Engineering Society in Korea 2024Testing AI Software Systems. Korea Computer Congress 2024Testing AI Software Systems. Software Disaster Research Center 2023Fuzzing Deep Learning Frameworks. Postech 2023Automated Software Testing: How Far are We? University of British Columbia 2022Introducing Software Testing and Analysis Research (STAR) Lab. Nanyang Technological University 2022Automated Software Testing: How Far are We? KAIST 2022Automated Software Testing: How Far are We? Handong University 2022Automated Software Testing for Machine Learning Software. Gyeongsang National University 2022Fuzzing AI Software Systems. Seoul National University 2022Automated Software Testing for Machine Learning Software. Korean Conference of Software Engineering 2021Automated Software Testing for Machine Learning Software. Software Disaster Research Center 2021Automated Software Testing for Machine Learning Software. Korea Computer Congress 2021Automated Software Testing for Deep Learning Frameworks. UNIST 2020, 2021.Which Generated Test Failures are Fault Revealing? KAIST 2019Which Generated Test Failures are Fault Revealing? ESEC/FSE 2018REMI: Risk Evaluation Method for API Testing. Samsung Electronics 2014Efficient Regression Testing of Ontology-Driven System. HKUST 2013Efficient Regression Testing of Ontology-Driven System. ISSTA 2012An Informatics Framework for Testing Data Integrity and Correctness of Federated Biomedical Databases. AMIA-CRI 2011Automated Bug Neighborhood Analysis for Identifying Incomplete Bug Fixes. ICST 2010ServiceOrganizing CommitteeInternational Conference on the Foundations of Software Engineering (FSE) - Publicity Co-chair, 2026International Conference on Software Testing, Verification and Validation (ICST) - Poster Co-chair 2026International Conference on Automated Software Engineering (ASE) - Student Volunteers Co-chair, 2025Program CommitteeInternational Workshop on Search-Based and Fuzz Testing (SBFT), 2026International Conference on Software Analysis, Evolution and Reengineering (SANER), 2026Asia-Pacific Software Engineering Conference (APSEC), 2025International Conference on Automated Software Engineering (ASE), 2025International Conference on Software Engineering (ICSE), 2025 * International Symposium on Software Testing and Analysis (ISSTA) - Tool Demo, 2025Asia-Pacific Software Engineering Conference (APSEC), 2023International Conference on Software Engineering, Management and Applications (SERA), 2023Foundations on Software Engineering (FSE) - Student Research Competition, 2022 * Korean Conference on Software Engineering (KCSE), 2021, 2022, 2023, 2024, 2025.International Conference on Automation of Software Test (AST), 2020.Workshop on Deep Data Intelligence for Finance at International Conference on Data Mining (ICDM), 2020.Artifact Evaluation CommitteeInternational Conference on Object-Oriented Programming, Systems, Languages & Applications (OOPSLA), 2020.ReviewerTransactions on So",
  "content_length": 11033,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:41"
}