{
  "name": "Mika Mäntylä",
  "homepage": "https://mmantyla.github.io",
  "status": "success",
  "content": "Professor Mika Mäntylä, D.Sc., University of Helsinki I head the EvoTestOps research group. We are part of Empirical Software Engineering research unit at the Department of Computer Science, Faculty of Science, University of Helsinki. I am still partially associated with the Empirical Software Engineering in Software, Systems and Services (M3S) research unit at the University of Oulu. Bio Mika Mäntylä is a professor of Software Engineering at the University of Helsinki in Finland. He received his D. Sc. degree in 2009 in Software Engineering from Aalto University in Finland. Mäntylä's research interests include end-of-lifecycle software engineering activities such as software testing, software maintenance, and software operations. He is also interested in systematic multivocal literature reviews and the behavioral and psychological aspects of software engineering. Currently, he applies mainly quantitative research methods from empirical software engineering and mining software repositories. Mäntylä is keen to use natural language processing, classical machine learning, and deep learning to tackle software engineering problems. He has previously worked as a full professor at the University of Oulu, as an assistant professor at Aalto University and as a post-doctoral researcher at Lund University in Sweden. His studies have been published in journals such as IEEE Transactions on Software Engineering, IEEE Software, Empirical Software Engineering, and Information and Software Technology. Mäntylä currently serves as an associate editor for IEEE Software and Empirical Software Engineering journals. For more information, please visit https://mmantyla.github.io/. Work 9/2022-9/2026 Principal Investigator (PI) (with Davide Taibi) in Multimodal Fusion based Anomaly Detection for Improving Microservice-based System project (funded by Academy of Finland) 5/2021- Editorial Board member of Empirical Software Engineering 10/2020-9/2023 Principal Investigator (PI) for WP4 (with Simo Hosio) in Critical project (funded by Strategic Research Council at the Academy of Finland) 1/2020-12/2022 Principal Investigator (PI) for NLP-TD research project (funded by Academy of Finland) 1/2018- Editorial Board member of IEEE Software 10/2017-9/2020 - Responsible Leader of Testomat project (ITEA3/Tekes) at the University of Oulu 9/2016-12/2021   Head of Doctoral Degree programme Information Processing Science 9/2016-8/2020 Principal Investigator (PI) for Auto-Time research project (funded by Academy of Finland) 1/2015-  Professor of Software Engineering at the University of Oulu, Finland. I am associated with the Faculty of Information Technology and Electrical Engineering, and M3S In 8/2014-12/2014 I worked as an assistant professor in the department of CSE at Aalto University, Finland In 2012-2014 I workedas a senior researchscientist in software engineering in Software Process Research Group at Aalto University, Finland.  My work was funded by a post-doc grant of department of CSE and an EU FP7 project U-QASAR. In 2011-2012, I was a post-doc in Software Engineering Research Group at Lund University, Sweden.I was part of ELLIIT project (funded by Swedish government's strategic research support initiative). In 2010/1-2010/4, I was a guest researcher at Simula Research Laboratory, Norway. In 2008-2011,I was a project-manager of ESPA research project (funded by TEKES)at Aalto University, Finland. In 2003-2008, I worked in SHAPE and SEMS (both funded by TEKES) research projects and I had a partial PhD grant from SoSE graduate school. In 2000-2001 I worked as software engineer in Netseal Technologies that was a hot startup but later filed for bankruptcy. In 1999, I worked as software engineering in Tieto [ Professional profiles Twitter and Linked-in] Teaching Formerly at University of Oulu Next Generation Software Engineering (2018-2022) Software Development, Maintenance and Operations (2020-2022) Software Quality and Testing 811306A (2020-2022) Emerging Trends in Software Testing 811601S (2015-2016) Emerging Trends in Software Engineering 811600S (2015-2017) Software Production and Maitenance 815312A (2017-2019) Formerly at Aalto University T-76.5613 Software testing and quality assurance 2008-2010, and 2012 T-76.3601 Introduction to Software Engineering 2011 Publications Selected Publications Mäntylä M. V., Adams B.,  Destefanis G., Graziotin D., Ortu M., \"Mining Valence, Arousal, and Dominance - Possibilities for Detecting Burnout and Productivity?\", 13th International Conference on Mining Software Repositories (MSR 2016), May 14-15, 2016, Austin, TX, USA (12 pages) Garousi, V., Mäntylä M. V.,  \"When and what to automate in software testing? A multi-vocal literature review\", Information and Software Technology, vol 76, 2016, pp. 92-117 Mäntylä M. V., Petersen K., Lehtinen, T. O. A., Lassenius, C. \"Time Pressure - A Controlled Experiment of Test-case Development and Requirements Review\",  in Proceedings of the 36th IEEE International Conference on Software Engineering (ICSE), pp. 83-94, May 31 - June 7, 2014, Hyderabad, India (full research paper) Mäntylä, M. V. and Lassenius, C. \"What Types of Defects Are Really Discovered in Code Reviews?\" IEEE Transactions on Software Engineering, vol. 35, no 3, May/June 2009, pp. 430-448 For complete list see [Self maintained list of publications ] [ DBPL,] [ Google scholar,] Scopus. Students: D.Sc./ PhD: Shayan Hashemi 2020, \"Understanding Software System Logs with Deep Learning\" Murali Sridharan 2020, \"Using Deep Learning to Detect Technical Debt\" Rantala Leevi 2019, \"Detecting Technical Debt with Natural Language Processing and Active Learning\" Wang Yuqing, 2017-2022, Software test automation maturity assessment and improvement based on best practices Kuutila Miikka, 2017- 2021, Time pressure and well-being in software engineering Raulamo-Jurvanen, Päivi 2015-2020, Evaluating and selecting software test automation tools (PROFES2016, EASE2017) Lehtinen, Timo, 2010-2014, Development and evaluation of a lightweight root cause analysis method (IST2011, ESEM2011, IST2014a, [ IST2014b, JSS2015]) M. Sc.: Post 2017 See Jultika Lämsä Tomi, 2017, Comparison of GUI testing tools for Android applications Saari Marko, 2017, Implementing new continuous integration tool Pennala Joni, 2017, Cloud-based testing of 4G base station software Nissinen Jouni, 2017, \"Benchmarking static code analysis tools on production software\" Koivuniemi, Jarmo, 2017, \"Shortening feedback time in continuous integration environment in large-scale embedded software development with test selection\" Matinolli, Ilari, 2016 \"Designing, implementing and evaluating a database for a software testing team\" Zhu, Mo, 2016 \"Sentiment analysis on medical treatment of depression\" Leinonen Juho, 2016, Evaluating software development effort estimation process in agile software development context \" Kuutila, Miikka, 2016, \"Benchmarking configurations for web-testing : Selenium versus Watir\" Kupiainen, Eetu, 2014 \"Reasons and Effects of Metric Use in Industrial Agile Teams - A Systematic Literature Review\" (WeTSOM2014, IST2015) Huishi Yin, 2014, \"Survey on Exploratory Software Testing\", University of Tartu (Appointed opponent, supervised by Dietmar Pfahl) (ESEM2014) Alessandro Marino, 2013, Code smell detection through machine learning techniques and metrics analysis, University of Milano-Bicocca (co-supervisor with Francesca Arcelli Fontana and Marco Zanoni), papers (ICSM2013, ESE2015) Iivonen Joonas, 2009, Identifying and Characterizing Highly Performing Testers – A Case Study in Three Software Product Companies, papers (ESEM2010, SQJ2012) Ruokojoki Mikko, 2006, “Kuntien henkilöstön työtyytyväisyyden ja hyvinvoinnin seurantaohjelmiston käyttötilanteiden ja vaatimuksien määrittely” Halonen Antti, 2006 “Decomposing legacy software for incremental modernization of software products – Perceived challenges and usable strategies” Laurila Pietari, 2005, “Key Activities in the Modernization of Legacy Software Systems – A Framework and a Multiple Case Study” B. Sc.: Pesola, Pekka 2016, \"Can TypeScript fix the problems with large scale JavaScript application development? \" Hokajärvi, Jouko, 2016, \"IoT-laitteiden tuotannon ja käytön aikainen laitetestaus\" Väyrynen, Joni, 2014, \"Ohjelmistotestauksen käytännöt ja ongelmat - katsaus kyselytutkimuksista\" Gädda, Johon, 2014, \"Möjligheter och utmaningar i utnyttjandet av användningsdata inom programutveckling\" Ambrosie Nicolas, 2014, \"Automaattinen virheenraportointijärjestelmä debuggausprosessin työkaluna\" Isomäki Erkka, 2012 \"Tapaustutkimus diferentiaaliin perustuvasta regressiotestauksesta laskentaintensiivisissä tietojärjestelmissä\" Laukkanen Eero, 2010, “Tiedonkeruu ohjelmointivirheiden raportoinnissa”, Papers (ESEM2011) Alahuhta Jari, 2010, “Virheraportoijien virhemäärien jakaumat virhetietokannassa” Community Service: Member of Editoral board Empirical Software Engineering (2020->) Member of Editoral board IEEE Software (2018->) Special issue Editor Empirical Software Engineering (2016) Special issue Editor: Software Engineering Success and Failure - A Special Issue of Empirical Software Engineering Submission Deadline: 15 NOV 2015 Refereeing Journals (outdated): Empirical Software Engineering [ –] Springer, Software Quality Journal – Springer ], Information and Software Technology – Elsevier ], IEEE Transactions on Software Engineering - IEEE], Journal of Systems and Software - Elsevier], IEEE Software - IEEE], Journal of Software Maintenance Research and Practice – Wiley, Automated Software Engineering – Springer, Expert Systems with Applications - Elsevier], Software Testing, Verification and Reliability [ –] Wiley, International Journal of Organisational Design and Engineering, Future Internet], Communications of the ACM - ACM], IEEE Transactions on Affective Computing, ACM Computing Surveys - ACM, Other Academic Service (PCs et al) (outdated) International Workshop on Emotion Awareness in Software Engineeri",
  "content_length": 12535,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:42"
}