{
  "name": "Mikael Vejdemo-Johansson",
  "homepage": "https://www.math.csi.cuny.edu/~mvj",
  "status": "success",
  "content": "Mikael Vejdemo-Johansson mathstodon Mikael Vejdemo-Johansson (pronounced like Michael Vey-demo Johansson). As of the Fall semester, 2016, I am Assistant Professor of Data Science at the mathematics department of CUNY College of Staten Island. As of the Spring semester, 2017, I am Doctoral Faculty in the PhD program in Computer Science at the CUNY Graduate Center. Since 2019 I have been Deputy Executive Officer for the joint PhD in Computer Science and MSc in Data Science programs. Contact If you are a student, please use Mikael.VejdemoJohansson@csi.cuny.edu. All other inquiries, please use mvj@math.csi.cuny.edu. My office on CUNY College of Staten Island, Willowbrook campus, is 1S-208. At the Graduate Center, my office is 4319.02. I prefer contact by email over contact by telephone. Research My main area of interest is in applied algebraic topology and topological data analysis: how to compute the shape of a data set, and how to use that shape to understand the underlying data. A large collection of lecture slides, written papers and other information can be found on my CV website. I have helped create several software packages for persistent homology, most recently JavaPlex. I am chair of the coordinating committee of the ATMCS conference series. Among my many side projects is an enumeration of possible tieknots. To go with this paper, I wrote a webpage with a random tieknot generator. Teaching Students Here are incomplete lists of students I have worked with either to advise thesis projects or to supervise independent studies. Thesis Students Denis Khryashchev (GC), PhD, Partially monotonic correlation coefficients Hannah Aizenman☥ (GC), PhD, Topological Data Visualization F19 Shweta Garg (GC), MSc, Spatial Data Analysis Leo Carlsson☥ (KTH), PhD 2021, Applied Machine Learning in Steel Process Engineering João Frederico Carvalho☥ (KTH), PhD 2020, Topological Methods For Motion Prediction And Caging Martina Scolamiero☥ (KTH), PhD 2015, Invariants for Multidimensional Persistence Timothy Sweeney, BSc 2017, A Study of Taxi-Cab Driver’s Times between Trips ☥ means I was/am co-advisor. Independent Studies F22 Alisa Leshchenko, Mathematical Statistics with Statistical Software F22 Miao Qin Xie, Data Science in Python F22 Denis Gostev (GC), Spatial Data Analysis F19 David Angeles, Joshua Higgins, Bayesian Data Analysis Courses Spring 2023 MTH410: Mathematical Statistics CUNY Graduate Center: Data Visualization Fall 2022 MTH229: Calculus Computer Laboratory HON223: Macaulay Honors Seminar on Science and Technology of New York Spring 2022 MTH513: Machine Learning (now MTH372: Practical Machine Learning) CUNY Graduate Center: Data Visualization Fall 2021 HON223: Macaulay Honors Seminar on Science and Technology of New York Spring 2021 MTH113: Introduction to probability and statistics with computer applications Fall 2020 HON223: Macaulay Honors Seminar on Science and Technology of New York Spring 2020 MTH410: Mathematical Statistics Fall 2019 HON223: Macaulay Honors Seminar on Science and Technology of New York Spring 2019 MTH513: Machine Learning CUNY Graduate Center: Big Data Analytics Fall 2018 MTH232: Calculus II MTH214: Applied statistics and programming Spring 2018 MTH410: Mathematical Statistics I CUNY Graduate Center: Data Mining Fall 2017 MTH 214: Applied statistics and programming MTH 231: Calculus I Spring 2017 MTH 214: Applied statistics and programming MTH 338: Linear Algebra Fall 2016 MTH 214: Applied statistics and programming MTH 410: Mathematical Statistics I Art I have a simmering interest in mathematical art, especially using laser cutters, 3d printers and other modern small-scale manufacture techniques. I exhibited at the Joint Mathematics Meetings 2020. I exhibited in the group show Mathematical Beauty at the AAAS Gallery. I exhibited at the Joint Mathematics Meetings 2019. I exhibited and gave an invited lecture at the Bridges Mathematical Art Conference 2018. I exhibited at the Joint Mathematics Meetings 2012. I am helping to launch the Illustrating Mathematics community. Currently the best place to get to know us is at our wiki.",
  "content_length": 4132,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:44"
}