{
  "name": "Mikaël Salson",
  "homepage": "http://cristal.univ-lille.fr/~salson",
  "status": "success",
  "content": "Mikaël Salson Mikaël Salson Professor of computer science mikael.salson@univ-lille.fr +33 3 28 77 84 65 Plan a meeting: In-person / Online Positions Since September 2010, I am part of the bioinformatics research group Bonsai (CRIStAL laboratory – Université de Lille and CNRS). You could find me close to the office S3.57 in the ESPRIT building, or to the office 216 in the M3 extension building or in-between them or possibly in any other place. I prepared my PhD thesis at the university of Rouen in the TIBS group of the LITIS laboratory. Teaching Head of the 1st year Msc in bioinformatics in Lille Skeptical thinking Third year bachelor – Computer science 2014 → Journalism - joint degree between Sciences Po Lille and the ESJ Lille 2022 → Second year master – Journalist and scientist 2013–2022 Algorithms and data structures Second year bachelor – Computer science 2020 → Information theory Second year bachelor – Computer science 2020 → Introduction to programming Third year bachelor – Biology of organisms and populations (BOP) 2021 → Bioinformatics Third year bachelor – Computer science 2020 → Bioinformatics methods for sequence analysis First year master – Bioinformatics 2020 → Databases First year master – Bioinformatics 2022 → Research I am the head of the Bonsai research group. Research interests I'm mainly interested in the following topics in sequence bioinformatics: sequence indexing and alignment-free comparisons. Sequence indexing ﻿The volume of sequencing data available makes indexing data necessary, whether at the level of a genome, of a sequencing set or of collections of sequencing sets. These different facets of indexation aim for one common goal: to access and query the data as efficiently as possible. Several PhD students or post-doctoral fellows that I have co-supervised have addressed these aspects: An index for multiple sequence alignment whose purpose is to efficiently compute covariation statistics on columns of the multiple sequence alignment. Indexing collection of high-throughput sequencing datasets (post-docs of C. Marchet and F. Ingels) Indexing V(D)J recombinations (T. Rocher's PhD thesis) Genome indexing for querying short sequences with high error rates (applicable to micro RNA target search, C. Vroland's PhD thesis) Alignment-free comparison ﻿Alignment-free comparisons compare data without aligning through dynamic programming. These approaches have the advantage of being much more frugal without necessarily losing in quality (contrary to what might be feared). Identifying tandem duplications in known genes (with applications to the characterization of FLT3-ITDs in acute myeloid leukemia) Characterizing populations of white blood cells from their V(D)J recombinations (with applications to marker identification in leukemias) RNA-seq data analysis (splice, fusion detections, and more) I'm also co-supervising T. Baudeau's PhD thesis on viral Nanopore sequence analysis. Software CREMSA Index for massive multiple sequence alignments. FiLT3r Tandem duplication detection in genes of interest. The software was initially developped for the idenitifcation and quantification of FLT3-ITD in high-throughput sequencing data but could be applied to other cases. Vidjil A platform for the analysis of lymphocyte populations based on their V(D)J recombination in high-throughput sequencing data. That platform is especially used in leukemia follow-up by several hospitals around the world. The software is now being transferred through the not-for-profit VidjilNet consortium. CRAC A RNA-seq read analysis tool: for detecting splicing junctions (either alternative or not), fusion gene or transcripts, point mutations (substitutions, insertions, deletions). GkArrays A C++ library for indexing reads produced by high-throughput sequencers DFMI A dynamic and compressed full-text index implementation Publications See my publication list Talks given See the list of my talks Conflicts of interest I own the minimal number of shares of my cooperative bank. My research are exclusively funded by public funds. Within the Vidjil project, I have worked in 2015–2016 with an engineer funded by the fondation EDF. I have signed a non-paid speaker contract with Novartis for a 2-day workshop in 2016 on onco-hematology with medical doctors from hospitals in the north of France. Novartis paid for a hotel room (one night) and for the meals (three). In January 2020 I've been invited by the SeqOne company in Montpellier. The company funded the transport and some meals. During the spring 2020 I temporarily brought my expertise for SeqOne. My university received funds for that expertise, those funds have be used to fund an internship, a publication and a team lunch. Contact Université de Lille – CRIStAL Bâtiment M3 – Cité scientifique 59655 Villeneuve d'Ascq Cedex - France +33 3 28 77 84 65 Credits: picture for indexing collection of high-throughput sequencing datasets by Camille Marchet, picture of the stem-loop CC BY SA Sakurambo. Test moteur de recherche : antzcontqtutionnel",
  "content_length": 5043,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:45"
}