{
  "name": "Mike C. Yip",
  "homepage": "https://yip.eng.ucsd.edu",
  "status": "success",
  "content": "Michael Yip, Ph.D.Search this siteEmbedded FilesSkip to main contentSkip to navigationMichael Yip, Ph.D.DirectorAdvanced Robotics and Controls Laboratory (ARCLab)Medical Robotics Collaboratory, Contextual Robotics InstituteAssociate ProfessorElectrical and Computer Engineering Affiliate ProfessorComputer Science and EngineeringMechanical and Aerospace EngineeringArtificial Intelligence GroupContactFranklin Antonio Hall Rm 3202(858) 822-4778 yip@ucsd.edu Short BioMichael Yip is an Associate Professor of Electrical and Computer Engineering at UC San Diego, and Director of the Advanced Robotics and Controls Laboratory (ARCLab). His group currently focuses on surgical robots, biomimetic design, and robot learning. His research has received several best paper awards and nominations at ICRA and IROS and RA-L, and he has been recognized by the NSF CAREER award, NIH Trailblazer award, and as a RAS Distinguished Lecturer. Several of his research has led to founded startups, and he was named the Faculty Innovator of the Year at UCSD in 2024, and elected into the National Academy of Inventors. Dr. Yip was previously a Disney Research in 2014 and Amazon Robotics in 2018. He received a B.Sc. in Mechatronics Engineering from the University of Waterloo, an M.S. in Electrical Engineering from the University of British Columbia, and a Ph.D. in Bioengineering from Stanford University. Lab WebsiteAdvanced Robotics and Controls Laboratory (ARCLab)Publication ListPublications → Complete CVDownload PDFAreas of ResearchRobot Manipulation in Dynamic EnvironmentsReinforcement Learning for Robot ControlContinuum and Snake-like RobotsRobotic SurgeryEducationPh.D. in Bioengineering, Stanford UniversityM.Sc. in Electrical and Computer Engineering, University of British ColumbiaB.Sc., in Mechatronics Engineering, University of WaterlooPrevious PositionsStanford University, Visiting Professor in Mechanical Engineering 2019Amazon Robotics Machine Learning and Computer Vision Group, Visiting Professor, 2018 Disney Research, Research Associate, 2014Harvard University, Research Assistant, 2008Massachusetts Institute of Technology, Research Assistant, 2007Massachusetts General Hospital, Research Assistant, 2006 Select AwardsUCSD Faculty Innovator of the Year, 2024Member, National Academy of Inventors (NAI), 2024NIH Trailblazer Award, 2021NSF CAREER Award, 2021Best Paper Finalist, Int. Conf. on Robotics and Automation (ICRA) 2021Elevated to IEEE Senior Member, 2021Best Paper Award for Cognitive Robotic Surgery, Int. Conf. on Robotics and Automation (ICRA) 2020IEEE Robotics and Automation Society Distinguished Lecturer, 2018Hellman Fellow, 2017Outstanding Researcher Award, NIH Center for Simulation in Rehab. Research 2017Inaugural Best Paper Award, IEEE Robotics and Automation Letters, 2017Best Paper Finalist, Int. Conf. on Robotics and Automation (ICRA) 2015Best Paper Award for Advances in Flexible Robotics for Medical Interventions,  Int. Conf. on Robotics and Automation (ICRA) 2014 ServiceSenior Program Committee, IEEE International Conference on Robotics and Automation (ICRA)Robotics, Science, and Systems (RSS), Primary Area ChairAssociate Editor, IEEE Robotics and Automation Letters (RA-L) Associate Editor, IEEE International Conference on Robotics and Automation (ICRA) IEEE Haptics Symposium, Sponsorship Chair NSFPanel Reviewer – NSF:ENG: National Robotics Initiative 2.0, NSF:IIS: Robust Intelligence, NIH: National Institute of Biomedical Engineering and Bioengineering Contributing Author, US Congressional Robotics Roadmap 2016 & 2020Report abuseReport abuse",
  "content_length": 3592,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:44"
}