{
  "name": "Mike Preuss",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/mike-preuss#tab-2",
  "status": "success",
  "content": "Mike Preuss - Leiden University Skip to main content Mike Preuss Associate professor artificial intelligence Name Dr. M. Preuss Telephone +31 71 527 2727 E-mail m.preuss@liacs.leidenuniv.nl ORCID iD 0000-0003-4681-1346 Mike Preuss is associate professor at LIACS, the Computer Science department of Leiden University. He is a member of the interdisciplinary research programme Society, Artificial Intelligence and Life Sciences (SAILS). He works in AI, namely game AI, natural computing, and social media computing. More information about Mike Preuss PhD Candidates Alan Kai Hassen Guest PhD candidate Zhao Yang PhD candidate / guest News 28 October 2025 Gaming your way through a PhD: 'Studying games is not just cool, it's important' 29 September 2022 Student team wins Minecraft programming challenge 04 January 2021 New project uses artificial intelligence in drug development 23 November 2020 BNAIC/Benelearn conference big success 21 November 2019 Computer program AlphaStar reaches professional level in video game StarCraft II Former PhD candidates Giulio Barbero Lecturer Matthias Müller-Brockhausen Lecturer Mozhan Soltani Mike received his PhD in 2013 from the Chair of Algorithm Engineering at TU Dortmund, Germany, and was with ERCIS at the WWU Muenster, Germany, from 2013 to 2018. His research interests focus on the field of evolutionary algorithms for real-valued problems, namely on multi-modal and multi-objective optimization, and on computational intelligence and machine learning methods for computer games. He is also involved in Social Media Computing, and he was publications chair of the multi-disciplinary MISDOOM conference 2019. He is associate editor of the IEEE ToG journal and has been member of the organizational team of several conferences in the last years, in various functions, as general co-chair, proceedings chair, competition chair, workshops chair. Associate professor Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact +31 71 527 2727 m.preuss@liacs.leidenuniv.nl Publications No relevant ancillary activities Share on Facebook Share by Bluesky Share on LinkedIn Share by WhatsApp Share by Mastodon Organisation Science Leiden Institute of Advanced Computer Science (LIACS) Machine Learning Human AI Visit our website! This website uses cookies. More information. Accept cookies Reject cookies",
  "content_length": 2415,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:50"
}