{
  "name": "Mike Crabb",
  "homepage": "https://discovery.dundee.ac.uk/en/persons/michael-crabb",
  "status": "success",
  "content": "Michael Crabb - Discovery - the University of Dundee Research Portal View Scopus Profile Crabb, Michael Dr Senior Lecturer (Teaching and Research), Computing https://orcid.org/0000-0002-9563-0691 h-index 315 Citations 10 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20132025 Research activity per year Personal profile BiographyMichael joined the University of Dundee as a Lecturer in 2018, having previously completed his PhD and RA positions at the same institution between 2010-2015. He is a Fellow of the Higher Education Authority (FHEA), the Royal Society of the Arts (FRSA), a Certified Associate in Project Management (CAPM) and a Certified Scrum Master (CSM). His expertise lies in qualitative research analysis, understanding user needs, and web development technologies. His research interests fall into three main areas: Immersive Technology Interface DesignAccessibility of Digital Media ArtefactsGames Accessibility and Testing His research has been supported by funding from Scottish Funding Council (through Interface Innovation Vouchers), the Scottish Informatics and Computer Science Alliance, and the Carnegie Trust for the Universities of Scotland. Academic Service and Leadership Summary Michael holds a number of local, national, and international research leadership positions with this including: Co-lead for the UX at Dundee research group,Leads the Human Centred Computing Research Cluster within School of Science and EngineeringCo-lead for the SICSA Human Computer Interaction Research ThemeLead for Mixed Reality Accessibility Guideline Development within the W3C Accessibility Guidelines Working Group WCAG3 Task Force. In addition to his leadership positions, he also supports Program Committees within a range of high-quality academic conferences including ACM Conference in Computer Human Interaction (ACM-CHI), ACM SIGACCESS Conference on Computers and Accessibility (ACM-ASSETS), and ACM Conference in Interactive Media Experiences (ACM-IMX). Michael is engaged in the organisation of academic conferences and workshops with this including ACM Conference in Interactive Media Experiences (2021 Accessibility Chair), HCI Camp – Research Methods Summer School (2019 Event Chair, Scottish Informatics and Computer Science Alliance Conference (2019 Poster Chair, 2018 General Chair), and SICSA HCI Doctoral Consortium (2018 Event Chair). Education Summary Michael teaches within the Discipline of Computing in the School of Science and Engineering. His main teaching responsibilities are within: AC11002 – WWW AuthoringAC31007 – Agile Software Development Supporting his teaching activities, he is a GitHub Campus Advisor and an Amazon Web Services (AWS) Campus Expert where he supports students and staff in using technologies related to web development. He has received internal awards for his teaching practice (SSEN Best Assessment and Feedback 2020, SSEN Staff Member of the Year 2020) and has previously supported local primary schools in teaching computer science through Code Club and Hour of Code Activities. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Michael Crabb is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles User Experience Keyphrases 100% Board Games Keyphrases 86% videogame Computer Science 86% Accessibility Issues Keyphrases 84% Inclusive Design Keyphrases 82% Older Adults Keyphrases 72% Disorientation Computer Science 67% Viewing Experience Keyphrases 58% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2018 2018 2023 2025 2 Finished 2 Not started Projects per year EMBEDD - Engaging Minoritised Beneficiaries in Engineering Diversity DevelopmentChernin, L. (Investigator), Crabb, M. (Investigator), Johnston, K. (Investigator), Lewis, O. (Investigator), Pakleppa, M. (Investigator), Shamvedi, D. (Investigator), Vilnay, M. (Investigator) & Ward, K. (Investigator)Project: Research Creative Strengths: Empowering Entrepreneurial Success for Future DesignersCrabb, M. (Investigator) & Huang, Y. (Investigator)Project: Research KTP Project - ProjectEUCrabb, M. (Investigator) & Newlands, M. (Investigator)1/06/23 → 1/09/25Project: Research Accessible Reality Augumented Reality Interaction Techniques with Accessibility at its CoreCrabb, M. (Investigator)Carnegie Trust for the Universities of Scotland1/06/18 → 31/05/19Project: Research Research output Research output per year 2013 2015 2016 2018 2019 2021 2022 2023 2025 2025 20 Conference contribution 12 Article 2 Paper 1 Other contribution Research output per year Research output per year Adaptive Teaching in Higher Education: Real-Time Design Patterns for Educator-Led InstructionAlajlani, N. & Crabb, M. (Lead / Corresponding author), 21 Nov 2025, (E-pub ahead of print) In: Journal of Computing in Higher Education. 22 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Real-time Patterns 100% Adaptive Teaching 100% Hybrid Learning 50% Digital education 50% Instructional Time 50% 3 Downloads (Pure) Empowering Communities of Aphasia through Adaptable Subtitled Media: The Altering Factors, Accessibility Barriers, and Inclusive Design PracticesYou, Z. & Crabb, M., 14 Aug 2025, (E-pub ahead of print) Proceedings of The British Aphasiology Society International Conference 2025. Roper, A. & Devane, N. (eds.). London, UK: British Aphasiology Society, p. 14-15 2 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 32 Downloads (Pure) Exploring Mixed Reality Design Considerations for Adaptable User Interfaces to Improve Interaction on Physical Textured SurfacesSubramanian, S., Bogdany, R., Crabb, M., Peiris, R. L. & Tigwell, G. W. (Lead / Corresponding author), 31 May 2025, Virtual, Augmented and Mixed Reality - 17th International Conference, VAMR 2025, Held as Part of the 27th HCI International Conference, HCII 2025, Proceedings: 17th International Conference, VAMR 2025, Held as Part of the 27th HCI International Conference, HCII 2025, Gothenburg, Sweden, June 22–27, 2025, Proceedings, Part III. Chen, J. Y. C. & Fragomeni, G. (eds.). 1 ed. Cham: Springer , p. 356-376 21 p. (Lecture Notes in Computer Science; vol. 15790).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Design Considerations 100% Adaptive User Interface 100% Surface Texture 100% Mixed Reality 100% Design Consideration 100% Meet Our ResearchersFerguson, C. (Lead / Corresponding author), Oza, S., Towler, M. (Editor), McKim, S. (Contributing member), Ly, T. (Contributing member), Holme, R. (Contributing member), Muqit, M. (Contributing member), O'Neill, M. (Contributing member), McGoldrick, N. (Contributing member), Keitel, C. (Contributing member), Kennedy, A. (Contributing member), Doney, A. (Contributing member), Lockhart, A. (Contributing member), Dawson, S. (Contributing member), Menard, H. (Contributing member), Schweikert, G. (Contributing member), Hartmann, J. (Contributing member), Marryat, L. (Contributing member), Pakleppa, M. (Contributing member) & Crabb, M. (Contributing member) & 6 others, Yu, S. (Contributing member), Banerjee, S. (Contributing member), De Cesare, V. (Contributing member), Johnston, Z. (Contributing member), Anderson, J. (Contributing member) & Li, C. (Contributing member), 15 May 2025, 18 p. Dundee : University of Dundee.Research output: Other contribution Open AccessFile Video Highlights 100% 24 Downloads (Pure) Subtitled Media Adaptations for People with Aphasia: Ongoing Accessibility Barriers and Emerging Design PracticesYou, A. & Crabb, M. (Supervisor), 26 Jun 2025, Access InContext Workshop at CHI 2025 on 26th of April. arXiv, p. 1-3 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Design Practice 100% Accessibility Barriers 100% Emerging Design 100% People with Aphasia 100% Barrier Design 100% 14 Downloads (Pure) View all 35 research outputs Prizes Honorable Mention Award - Developing Accessible Services: Understanding Current Knowledge and Areas for Future SupportCrabb, M. (Recipient), 2019Prize: Prize (including medals and awards) Staff Member of the Year, SSEN Learning and Teaching Awards.Crabb, M. (Recipient), Jun 2021Prize: Prize (including medals and awards) Best Advisor or Personal Tutor, DUSA Student Led Teaching Awards.Crabb, M. (Recipient), Jun 2021Prize: Prize (including medals and awards) Best Assessment and Feedback, SSEN Learning and Teaching Awards.Crabb, M. (Recipient), Jun 2021Prize: Prize (including medals and awards) Innovation in Teaching Award, SSEN Learning and Teaching Awards.Crabb, M. (Recipient), Jun 2021Prize: Prize (including medals and awards) View all 7 prizes Activities Activities per year 2018 2020 2021 2022 2022 11 Editorial activity 6 Publication peer-review 4 Participation in conference 3 Participation in workshop, seminar, course 7 More 2 Membership of committee 1 Other event 1 Membership of external research organisation 1 Funding - grants and income which support research related activities 1 Public engagement and outreach - work on advisory panels 1 Schools engagement Activities per year 24th International ACM SIGACCESS Conference on Computers and Accessibility, ASSETS 2022 (Event)Crabb, M. (Editorial board member)Oct 2022Activity",
  "content_length": 11559,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:47"
}