{
  "name": "Mike Stannett",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/mike-stannett",
  "status": "success",
  "content": "Dr Mike Stannett | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Mike Stannett PhD School of Computer Science Senior Lecturer Sustainability Lead Open staff member portrait in a modal window m.stannett@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Mike Stannett School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-2794-8614 Google Scholar Personal website Profile Mike Stannett is a theoretical computer scientist attached to the Foundations of Computation Research Group in the Department of Computer Science at Sheffield University. Originally working in hypercomputation theory, his current research mainly concerns Logical Foundations of Relativity Theories and Isabelle/HOL verification of related theorems. Research interests Dr Stannett is interested in many areas of research, including Unconventional Computing and First-Order Logical Foundations of Physics. Publications Journal articles Conference proceedings Journal articles MADARÁSZ JX, STANNETT M & SZÉKELY G (2022) Groups of worldview transformations implied by Einstein’s special principle of relativity over arbitrary ordered fields. The Review of Symbolic Logic, 15(2), 334-361. Stannett MP (2014) Specification, Testing and Verification of Unconventional Computations using Generalised X-Machines. International Journal of General Systems, 43(7), 713-721. Andréka H, Madarász JX, Németi I, Stannett MP & Székely G (2014) Faster than light motion does not imply time travel. CLASSICAL QUANT GRAV, 31(9). Stannett MP & Németi I (2014) Using Isabelle/HOL to Verify First-Order Relativity Theory. Journal of Automated Reasoning, 52(4), 361-378. Madarász JX, Stannett MP & Székely G (2014) Why Do the Relativistic Masses and Momenta of Faster-than-Light Particles Decrease as their Speeds Increase?. Symmetry, Integrability and Geometry : Methods and Applications, 10. Stannett M & Németi I (2013) Using Isabelle to verify special relativity, with application to hypercomputation theory. Dautov R, Paraskakis I, Kourtesis D & Stannett MP (2013) Addressing Self-Management in Cloud Platforms: a Semantic Sensor Web Approach. HotTopiCS '13 Proceedings of the 2013 international workshop on Hot topics in cloud services, 11-18. Stannett MP (2013) Computation and Spacetime Structure. International Journal of Unconventional Computing, 9(1-2), 173-184. Stannett M (2012) Computing the appearance of physical reality. Applied Mathematics and Computation, 219(1), 54-62. Csuhaj-Varjú E, Gheorghe M & Stannett M (2012) P Systems Controlled by General Topologies.. Lecture Notes in Computer Science, 7445, 70-81. Stannett M (2009) The computational status of physics: A computable formulation of quantum theory. Natural Computing, 8(3), 517-538. Stannett M (2006) The case for hypercomputation. APPL MATH COMPUT, 178(1), 8-24. Madarász JX, Stannett M & Székely G () Groups of Worldview Transformations Implied by Isotropy of Space. Journal of Applied Logic. Back to topConference proceedings Olayinka O & Stannett M (2020) Experiencing the Sheffield team software project: a project-based learning approach to teaching agile. Proceedings of 2020 IEEE Global Engineering Education Conference (EDUCON) (pp 1299-1305). Porto, Portugal, 27 April 2020 - 27 April 2020. View this article in WRRO Gheorghe M, Konur S, Ipate F, Mierla L, Bakir ME & Stannett M (2015) An integrated model checking toolset for kernel P systems. Lecture Notes in Computer Science, Vol. 9504 (pp 153-170). Valencia, Spain, 17 August 2015 - 17 August 2015. View this article in WRRO Stannett MP, Paraskakis I & Dautov R (2013) Utilising Stream Reasoning Techniques to Create a Self-Adaptation Framework for Cloud Environments. The 3rd International Workshop on Intelligent Techniques and Architectures for Autonomic Clouds (ITA. Dresden, Germany, 9 December 2013 - 12 December 2013. Csuhaj-Varjú E, Gheorghe M & Stannett M (2012) Using Topological Spaces to Control P Systems. Computability in Europe (CiE) 2012. Cambridge, 18 June 2012 - 23 June 2012. Stannett MP, Dautov R & Paraskakis I () On the Role of Stream Reasoning in Run-time Monitoring and Analysis in Autonomic Systems. http://www.seerc.org/dsc2013. Thessaloniki, Greece, 16 September 2013 - 17 September 2013. Back to top Research group Foundations of Computation research group Grants Interdisciplinary Workshop of Hypercomputation, EPSRC, 06/2006 to 12/2006, £7,646, as PIHypercomputation Research Network, EPSRC, 01/2008 to 01/2011, £61,074, as PIMachine Verification of First-Order Relativity Theories, ROYAL SOCIETY, 01/2012 to 12/2013, £11,960, as PIDeveloping New Robust 'What-if' Models for 'Bitcoin Use' and assessing its Risk, RCUK (JOINT RESEARCH COUNCILS), 08/2014 to 11/2014, £294, as PIResearch in Pairs, LONDON MATHEMATICAL SOCIETY, 04/2016 to 04/2016, £810, as PI Professional activities and memberships Member of the London Mathematical SocietyVisiting Fellow (2012), Isaac Newton InstituteProfessional organisations: AISB, LMS, CiE, ASL. Links Foundations of Computation research group",
  "content_length": 5172,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:51"
}