{
  "name": "Mike Fraser 0001",
  "homepage": "https://research-information.bris.ac.uk/en/persons/mike-fraser",
  "status": "success",
  "content": "Mike Fraser - University of Bristol View Scopus Profile Professor Mike Fraser BSc, PhD Head of School, School of Computer ScienceProfessor of Human-Computer Interaction, School of Computer Science https://orcid.org/0000-0001-9374-3759 EmailMike.Fraserbristol.acuk BS8 1UB Personal profile Research interestsI am interested in how computers are made, what they are made from, and how we might support individuals with limited resources to make their own computers. I'm also interested in interdisciplinarity, genealogy and art history. Technical interests include acoustic phased arrays, organic electronics, nebulisers and microscale droplet patterns, 3d printing and prototyping, and cyber-physical systems architecture. Research Groups and ThemesBristol Interaction Group Fingerprint Dive into the research topics where Mike Fraser is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Mobile Device Computer Science 100% Interaction Techniques Computer Science 81% Three Dimensional Printing Computer Science 54% Wearable Device Computer Science 51% Illustrates Engineering 48% Virtual Reality Computer Science 45% Ergonomics Engineering 42% Virtual Environments Computer Science 40% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 88 Conference Contribution (Conference Proceeding) 14 Article (Academic Journal) 3 Chapter in a book 1 Authored book 1 More 1 PhD thesis (not Bristol) Research output per year Research output per year A mixed-method approach in ergonomic analysis utilising personalised data dashboardsOrmerod, I., Shortt, N., Fraser, M. & Snider, C., 27 Aug 2025, In: Proceedings of the Design Society. 5, p. 179-188 10 p.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open Access Mixed Methods 100% Thematic Analysis 50% Subjectivity 50% Computer Vision 50% A proposed framework for data-driven human factors evaluationOrmerod, I. F., Dybvik, H., Fraser, M. & Snider, C. M., 16 May 2024, DESIGN 2024. Cambridge University Press, Vol. 4. p. 85-94 10 p. (Proceedings of the Design Society; vol. 4).Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Ergonomics 100% Illustrates 33% Design Cycle 33% DisplayFab: The State of the Art and a Roadmap in the Personal Fabrication of Free-Form Displays Using Active Materials and Additive ManufacturingHanton, O., Fraser, M. & Roudaut, A., 11 May 2024, CHI 2024 - Proceedings of the 2024 CHI Conference on Human Factors in Computing Sytems. Floyd Mueller, F., Kyburz, P., Williamson, J. R., Sas, C., Wilson, M. L., Toups Dugas, P. & Shklovski, I. (eds.). Association for Computing Machinery (ACM), p. 1-24 24 p. 333Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Active Material 100% Additive Manufacturing 100% Breakpoint 100% Three Dimensional Printing 100% Device Structure 50% 5 Citations (Scopus) View all 107 research outputs Projects 4 Active 8 Finished Projects per year Pro2 Network+: From Prototyping to Production of Digital DevicesFraser, M. (Principal Investigator)1/01/23 → 31/12/27Project: Research 8459 Flexible funds EPSRC EP/W020564/1 Pro2 Network+: From Prototyping to Production of Digital DevicesFraser, M. (Principal Investigator)1/01/23 → 31/12/27Project: Research Digital Economy Network PlusFraser, M. (Principal Investigator)1/08/22 → 31/07/27Project: Research, Parent View all 12 projects",
  "content_length": 3887,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:47"
}