{
  "name": "Mike Franklin",
  "homepage": "https://cs.uchicago.edu/people/michael-franklin",
  "status": "success",
  "content": "Michael Franklin – Department of Computer Science Skip to content Contact Info Email mjfranklin@uchicago.edu Phone (773) 702-1493 Office Crerar 247 Michael J. Franklin is the Morton D. Hull Distinguished Service Professor for the Department of Computer Science. He held the inaugural title of Liew Family Chair of Computer Science until September of 2023. An authority on databases, data analytics, data management and distributed systems, he also serves as Senior Advisor to the Provost on Computation and Data Science and is Faculty Co-Director of the Data Science Institute. Previously, Franklin was on the faculty at the University of California, Berkeley, where he was Thomas M. Siebel Professor of Computer Science and served a term as Chair of the Computer Science Division. He was Director of the Algorithms, Machines and People Laboratory (AMPLab) and was Principal Investigator of the lab’s National Science Foundation CISE “Expeditions in Computing” award. He is one of the original creators of Apache Spark, a leading open source platform for data analytics and machine learning that was developed at the lab. In addition to his academic work, Franklin founded and was chief technology officer of Truviso, a data analytics company acquired by Cisco Systems. He currently serves as a technical advisor to various data-driven technology companies and organizations, including AMPLab spin-out Databricks and Chicago-based Ocient. Franklin recently completed terms as a member of the NSF CISE Advisory Committee and a Board Member of the Computing Research Association and currently serves on the ACM Fellows Committee. He is a Fellow of the Association for Computing Machinery and a two-time recipient of the ACM SIGMOD (Special Interest Group on Management of Data) “Test of Time” award and numerous Best Paper awards at leading Systems and Database conferences. He received the Ph.D. in Computer Science from the University of Wisconsin in 1993, a Master of Software Engineering from the Wang Institute of Graduate Studies in 1986, and the B.S. in Computer and Information Science from the University of Massachusetts in 1983. Research Focus Areas: Big Data, Databases, Distributed and Streaming Database Technology, Systems Research AI & Machine Learning Foundations and applications of computer algorithms making data-centric models, predictions, and decisions Data & Databases Systems and algorithms for managing and analyzing data at scale Systems, Architecture & Networking Design and analysis of computing systems: cloud, edge, Internet, quantum, and beyond Labs & Groups ChiDATA Michael Franklin, Aaron Elmore, Sanjay Krishnan, Raul Castro Fernandez Conducting research on all things data, including large-scale video analysis, efficient data processing systems, and the economics of data. Systems Group A vibrant, collaborative research community with diverse, synergistic research interests spanning systems, programming languages and software engineering, software and hardware... Machine Learning Group Researchers at the University of Chicago and partner institutions studying the foundations and applications of machine learning and AI. CERES Center for Unstoppable Computing Andrew A. Chien A dynamic community focused on reducing the fragility and complexity of computing systems, while also increasing their efficiency and lifetime. Awards & Honors 2025 Conference on Innovative Data Systems (CIDR) Test of Time Award 2023 Arthur Kelly Faculty Prize Elected to American Academy of Arts and Sciences 2022 ACM SIGMOD Systems Award 2021 AAAS Fellow 2013 SIGMOD Test of Time Award 2004 SIGMOD Test of Time Award 1995 CAREER Award UChicago CS News Mike Franklin, Dan Nicolae Receive 2023 Arthur L. Kelly Faculty Prize Jun 02, 2023 UChicago CS News CS Chair Michael Franklin Elected to the American Academy of Arts & Sciences Apr 28, 2023 UChicago CS News Postdoc Alum John Paparrizos Named ICDE Rising Star Mar 15, 2023 UChicago CS News UChicago Launches Transform Accelerator for Data Science & Emerging AI Startups Jan 19, 2023 UChicago CS News UChicago CS Faculty Receive Industry Grants From J.P. Morgan, Google Jul 19, 2022 UChicago CS News UChicago London Colloquium Features Data Science, Quantum Research Jul 01, 2022 UChicago CS News UChicago CS Chair Michael Franklin Part of SIGMOD Award-Winning Team Jun 15, 2022 Past Event Data Value: Assessment and Evolution Workshop Jun 06, 2022 UChicago CS News UChicago CS Chair Michael J. Franklin Named AAAS Fellow Jan 26, 2022 UChicago CS News University of Chicago, City Colleges of Chicago Join Forces to Increase Diversity in Science Careers Dec 14, 2021 UChicago CS News Asst. Prof. Aaron Elmore Receives CAREER Award for Resource-Efficient Databases Sep 03, 2021 UChicago CS News New College Data Science Major: From Foundations to Insight to Impact Aug 29, 2021 arrow-down-largearrow-left-largearrow-right-large-greyarrow-right-large-yellowarrow-right-largearrow-right-smallbutton-arrowclosedocumentfacebookfacet-arrow-down-whitefacet-arrow-downPage 1CheckedCheckedicon-apple-t5backgroundLayer 1icon-google-t5icon-office365-t5icon-outlook-t5backgroundLayer 1icon-outlookcom-t5backgroundLayer 1icon-yahoo-t5backgroundLayer 1internal-yellowinternalintranetlinkedinlinkoutpauseplaypresentationsearch-bluesearchshareslider-arrow-nextslider-arrow-prevtwittervideoyoutube",
  "content_length": 5347,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:47"
}