{
  "name": "Mikhail Moshkov",
  "homepage": "https://cemse.kaust.edu.sa/people/person/mikhail-moshkov",
  "status": "success",
  "content": "Mikhail Moshkov | Computer, Electrical and Mathematical Sciences and Engineering Skip to main content Mikhail Moshkov Professor, Applied Mathematics and Computational Science Principal Investigator, Extensions of Dynamic Programming, Machine Learning, Discrete Optimization mikhail.moshkov@kaust.edu.sa machine learning data mining discrete optimization algorithmic complexity Professor Moshkov specializes in various areas of discrete applied mathematics, theoretical computer science and operations research. He is the author or co-author of more than 200 research publications, including 10 books published by Springer. BiographyMikhail Moshkov is a professor of Applied Mathematics and Computational Science (AMCS) and an affiliated professor of Computer Science (CS) at KAUST. He is also the principal investigator of the Extensions of Dynamic Programming, Machine Learning, Discrete Optimization (TREES) research group.Professor Moshkov holds an M.S. summa cum laude in 1977 from the University of Nizhni Novgorod, Russia. He obtained his Ph.D. in 1983 from the University of Saratov, Russia, and a Doctor of Science in 1999 from Moscow State University, Russia.Before joining KAUST, he held professorships at the University of Nizhni Novgorod, Russia, and the University of Silesia, Poland.Moshkov received the State Scientific Stipend in Mathematics for Outstanding Scientists from April 2000 to March 2003, awarded by the Presidium of the Russian Academy of Sciences. Additionally, he received the First Degree Research Prize, awarded by the rector of the University of Silesia, Poland, in 2006. Research InterestsProfessor Moshkov's research interests include: (i) The study of time complexity of algorithms in computational models such as decision trees, decision rule systems and acyclic programs with applications to combinatorial optimization, fault diagnosis, pattern recognition, machine learning, data mining, and analysis of Bayesian networks. (ii) The analysis and design of classifiers based on decision trees, reducts, decision rule systems, inhibitory rule systems, and lazy learning algorithms. (iii) Extensions of dynamic programming for sequential optimization relative to different cost functions and for study of relationships between two cost functions with applications to combinatorial optimization and data mining. Professional Profile Awards and Distinctions The First Degree Research Prize, Rector of the University of Silesia, Poland, 2006 The State Scientific Stipend in Mathematics for Outstanding Scientists, The Presidium of Russian Academy of Sciences, 2000 Professional Memberships Member of the Editorial Board, Springer, 2003 DisseminationProfessor Moshkov is the author of over 140 publications and books including:Decision and Inhibitory Trees and Rules for Decision Tables with Many-valued DecisionsExtensions of Dynamic Programming for Combinatorial Optimization and Data Mining Three Approaches to Data Analysis: Test Theory, Rough Sets and Logical...Combinatorial Machine Learning: A Rough Set Approach Inhibitory Rules in Data Analysis: A Rough Set ApproachPartial Covers, Reducts and Decision Rules in Rough Sets: Theory and Applications.Extensions of Dynamic Programming for Combinatorial Optimization and Data Mining Three Approaches to Data Analysis: Test Theory, Rough Sets and Logical...Combinatorial Machine Learning: A Rough Set Approach Inhibitory Rules in Data Analysis: A Rough Set Approach Partial Covers, Reducts and Decision Rules in Rough Sets: Theory and Applications Questions and Answers Why KAUST? KAUST provides exceptional research opportunities and excellent living environment. Engage ORCID KAUST Repository KAUST Academic Portal ShareXFacebookLinkedInEmailClipboard Related Sites Applied Mathematics and Computational Science (AMCS) Computer Science (CS) Extensions of Dynamic Programming, Machine Learning, Discrete Optimization (TREES) Apply for postgraduate study Start your application",
  "content_length": 3962,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:52"
}