{
  "name": "Mikhail Soutchanski",
  "homepage": "http://www.scs.torontomu.ca/~mes",
  "status": "success",
  "content": "Mikhail Soutchanski Mikhail Soutchanski, full professor PhD in Artificial Intelligence, University of Toronto, Canada. Email:   Thank you for  not  sending me email! Exception: if you would like to discuss research over Teams or Zoom, then please feel free to email me MyFamilyName (at) protonmail (dot) com Office: 245 Church Street, room ENG275 (NE corner, the 2nd floor) Computer Science is located in George Vari ENG building. The Department of Computer Science is part of the Faculty of Science. Phone: (416) 979 5000 ext 55-7954   (leave voicemail) General enquiries: Mr. Alex Zheltov (416) 979-5000 ext.55-7411 or Ms. Erin Knight (416) 979-5000 ext.55-7410 Mailing address: 245 Church Street, ENG281 Department of Computer Science Toronto Metropolitan (formerly Ryerson) University (TMU) Toronto, Ontario, M5B 2K3, Canada Some of my Publications Research interests I'm interested in Reasoning about Actions and Change. I explore several computational tasks such as reasoning about actual causes, and automated real-world planning with informative domain independent heuristics. More specifically, I'm interested in planning on the level of action schemes in the open world with incomplete knowledge when some of the objects are unknown, when the objects can be created or destroyed at planning time, and when some action parameters can vary over infinite domains. Also, I'm interested in domain independent temporal automated planning in mixed discrete-continuous dynamical systems with relational structure. Recently, my research focused on the case when all discrete actions initiate and/or terminate continuous processes and thereby stitch together continuous trajectories over time. The problem is how to compute a sequence of actions and a schedule when they have to be executed to reach a specified goal state as soon as possible. Previously, finite state hybrid automata were studied to solve this class of computational problems, but some important real-life mixed discrete-continuous dynamical systems are actually relational, since their states have complex internal structure. This research has several applications, e.g., how to integrate Task and Motion Planning (TAMP) in robotics. The focus of my research is on general, sound, domain-independent, efficient, logic-based problem solving methods that can work over infinite domains and can approximate (sometimes) plans for mixed discrete-continuous dynamical systems. (Past) multi-disciplinary research: I was interested in solving the organic chemistry synthesis problem using a variety of techniques from automated planning. More generally, I was interested in applying automated planning methods to facilitate discovery in health and natural sciences. Reasoning about actions and events with applications to generic problem solving. I was developing modular and taxonomic representations that can facilitate implementing large-scale logical theories for reasoning about effects of actions/events. International students: Unfortunately I am unable to respond to emails about graduate admission or possibility of working with me. Please contact the School of Graduate Studies or the CS Graduate Program Assistant. If you have been admitted to TMU, feel free to reach out if you're interested in discussing research opportunities in my group. I would strongly recommend to browse my recent research papers before you contact me and write why do you think our research interests match well. If you have published research papers yourself, inform me. Recent Teaching CPS 824 / CP8319: Reinforcement Learning (Winter 2026). A graduate / advanced undergraduate course. CPS 721: Artificial Intelligence 1  , an undergraduate course (Fall 2026). CPS822/CP8314 Artificial Intelligence 2 : Dynamical Systems in AI. Advanced undergraduate / graduate course (Winter 2025). Past Teaching CPS 40A/B: Undergraduate Thesis  , a two-term research oriented course (Fall 2023 - Winter 2024). Prerequisites: excellent programming skills, the grade \"A\" in CPS721 and GPA higher than 3.5 CPS 815 / CP8201: Topics in Algorithms ,   an undergraduate course (Fall 2023). CP8310/8311: Directed Studies in Computer Science (Winter 2022), a graduate course. CPS 125: Digital Computation and Programming   (Winter 2017), an undergraduate course. CPS 616: Analysis of algorithms ,   an undergraduate course (Winter 2014). CP8201: Algorithms and Computability, (Fall 2013), a graduate course. CPS603: Foundations of Semantic Technologies (Winter 2011), an undergraduate/graduate course. WWW links A former Cognitive Robotics Group at the University of Toronto (defunct from 2014). A Prolog interface to Sony's AIBO robots (from 2006). Graduate Program in Computer Science and Engineering, York University, Toronto, Ontario, Canada. I was an Adjunct Professor supervising graduate students from 2006 until June 2022. This Web page provides more details about their graduate program. The Association for Logic Programming. A direct link to the movie about Alain Colmerauer (Fall 2022) and his PROLOG adventure. Mathematical logic around the world The Open Logic Project supported by the University of Calgary Faculty of Arts and the Campus Alberta OER Initiative. The Openproof Project at the Center for the Study of Language and Information (CSLI), Stanford University. The Computability and Complexity in Analysis network. The World Logic Day: UNESCO. Quotes \"In theory, theory and practice are the same. In practice, they are not.\" \"The proper method for inquiring after the properties of things is to deduce them from experiments.\" \"In questions of science, the authority of a thousand is not worth the humble reasoning of a single individual\" \"An error does not become truth by reason of multiplied propagation, nor does truth become error because nobody sees it\" \"The greatest enemy of knowledge is not ignorance, it is the illusion of knowledge\" \"The truth is simple. If it was complicated, everyone would understand it.\" \"There is nothing more practical than good theory\" \"No more causes of natural things should be admitted than are both true and sufficient to explain their phenomena.\" (Rule 1) \"Therefore, the causes assigned to natural effects of the same kind must be, so far as possible, the same.\" (Rule 2) \"We learn more and more about less and less, and less and less about more, until we know everything about nothing and nothing about everything.\" \"When you have eliminated the impossible, whatever remains, no matter how improbable, must be truth.\" \"Imagination is more important than knowledge. For knowledge is limited to all we now know and understand, while imagination embraces the entire world, and all there ever will be to know and understand\". \"Quid est veritas?\" (\"What is truth?\") \"Thoughts without content are empty, and intuitions without concepts are blind.\" \"The grand aim of all science [is] to cover the greatest number of empirical facts by logical deduction from the smallest possible number of hypotheses or axioms.\" \"Science is built up of facts, as a house is built of stones; but an accumulation of facts is no more a science than a heap of stones is a house.\" \"The expressive power of first order logic determines not so much what can be said but what can be left unsaid.\" Web mail",
  "content_length": 7266,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:54"
}