{
  "name": "Mikkel Thorup",
  "homepage": "http://www.diku.dk/~mthorup",
  "status": "success",
  "content": "Mikkel Thorup (home page) Mikkel Thorup Professor at the Department of Computer Science, University of Copenhagen VILLUM Investigator heading Center for Basic Algorithms Research Copenhagen (BARC) 2017-2023 Mikkel Thorup (born 1965) has a D.Phil. from Oxford University from 1993. From 1993 to 1998 he was at the University of Copenhagen. From 1998 to 2013 he was at AT&T Labs-Research. Since 2013 he has been back as Professor at the University of Copenhagen. He is currently a VILLUM Investigator heading Center for Basic Algorithms Research Copenhagen (BARC) supported by a €5.3 million grant from the VILLUM Foundation. Mikkel is a Fellow of the ACM, a Fellow of AT&T, and a Member of the Royal Danish Academy of Sciences and Letters. He is co-winner of the 2011 MAA Robbins Award in mathematics and winner of the 2015 Villum Kann Rasmussen Award for Technical and Scientific Research, which is Denmark's biggest individual prize for research. More recently he was co-winner of the 2021 AMS-MOS Fulkerson Prize and an ACM STOC 20-year test of time award. Mikkel's main work is in algorithms and data structures, where he has worked on both upper and lower bounds. Recently one of his main focusses has been on hash functions unifying theory and practice. Mikkel prefers to seek his mathematical inspiration in nature, combining the quest with his hobbies of bird watching and mushroom picking. Finally some numbers: H-index above 60 (Google Scholar). More than 200 publications with more than 100 in topmost venues (A* in CORE ranking). This includes more than 40 papers at the topmost general theory of computing conferences STOC and FOCS, and more than 30 papers at the topmost algorithms conference SODA. Erdős number 2. CV and Papers Full cv with publications. List of papers in DBLP. This includes links to free CoRR/arXiv version of most recent papers. List of papers in Google Scholar. This includes h-index citations etc. Civil status: married. Office address Department of Computer Science University of Copenhagen Universitetsparken 1 2100 Copenhagen East Denmark Phone: \t(+45) 2117 9123 Email: \tmikkel2thorup@gmail.com",
  "content_length": 2133,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:00"
}