{
  "name": "Mikolaj Bojanczyk",
  "homepage": "http://www.mimuw.edu.pl/~bojan",
  "status": "success",
  "content": "Mikołaj Bojańczyk M E N U C L O S E Strona główna CV Talks zajęcia / courses posts login Mikołaj Bojańczyk This site uses cookies   ☓  more cv / contact information I work at the University of Warsaw. My research is on logic in computer science, with a focus on automata. bojan@mimuw.edu.plmore talks Tbilisi Symposium on Logic, Language and Computation Finite and Algorithmic Model Theory Categories for Automata and Language Theory The Roaming Logic Conference Chinese Annual Conference on Mathematical Logic more zajęcia / courses Professional Skills in Computer Science 2025 Języki, automaty i obliczenia II 2025 • Advance... more posts On mustard watches Slajdomat – my homegrown slide software Citations not correlated with referee scores How to improve your citations with one simple tric... Who to cite: MSO transductions more research Papers selected and grouped In the list below, papers are grouped by topic, and links are provided to the most recent versions (i.e. journal preferred over conferences). A complete list of papers with pdfs, chronologically organised based on dblp, is also provided. view papers chronologically research Papers chronologically This is the same list as on dblp with pdf links added. view papers selected and grouped “Languages recognised by finite semigroups…” book Here you can find the current version of a book that I am writing about algebraic language theory, which is called “Languages recognised by finite semigroups and their generalisations to objects such as trees and graphs, with an emphasis on definability in monadic second-order logic”. The book begins with some classical theory of finite semigroups, such as Green’s relations, but it is mainly devoted to generalisations beyond finite words (trees, graphs, or infinite words), which uses the methodology of monads and their Eilenberg-Moore algebras. more Atom book This is the current version of a short book about atoms that I am writing. The book begins with a discussion of automata models for infinite alphabets. Then, inspired by these automata, the book develops the theory of orbit-finite sets with atoms and computation on them. The book was in hiatus for 6 years, but I returned to it in 2025, while giving a course about the topic. The new version has some new material (vector spaces) and deletes some of the automata material from the previous version. more Automata Toolbox book This is the current of “An Automata Toolbox” It is a book of lecture notes about automata theory, based on a course at the University of Warsaw. The main goal is to give an intuitive – and visual as often as possible  – understanding of important constructions in automata theory. The current version is an alpha version, and has not changed much for the last 5 years. I do plan eventually to update it, but this may be delayed a long time. In the meantime, you can find the sources on github, and fix anything on your own. If you fix anything, don’t forget to add yourself to the acknowledgements, and let me know if you have doubts about or questions about your changes. Before github, there was a page with mistakes, but I did not do a good job with integrating the corrections into the text. more Polyregular functions Mikołaj BojańczykPolyregular Functions. CoRR, 2018   PDF Mikołaj Bojańczyk, Sandra Kiefer, Nathan LhoteString-to-String Interpretations With Polynomial-Size Output. ICALP, 2019   PDF Paper [1] (see also these slides) discusses a class of string-to-string functions, which goes beyond rational or regular functions, but still shares many of their good properties (e.g. the inverse image of a regular language is regular). This class is called the polyregular functions. Unlike the regular string-to-string functions (and their subclasses such as sequential or rational), which have linear size increase, the polyregular functions have polynomial size increase. The main selling point of the polyregular functions is that they admit numerous equivalent descriptions: automata with pebbles (this definition comes from here and here); a fragment of lambda calculus (this definition, as well as the other two below, is new to the author’s best knowledge); a fragment of for-programs; compositions of certain atomic functions, such as reverse or a form of string squaring. Paper [2] adds another equivalent description to the list above, namely 5.  mso interpretations (which are like mso transductions, except that one output position is interpreted in a k-tuple of input positions. more MSO with probability Mikołaj BojańczykThin MSO with a Probabilistic Path Quantifier. ICALP, 2016   PDF Mikołaj Bojańczyk, Hugo Gimbert, Edon KelmendiEmptiness of Zero Automata Is Decidable. ICALP, 2017   PDF Mikołaj Bojańczyk, Edon Kelmendi, Michal SkrzypczakMSO+∇ is undecidable. LICS, 2019   PDF Consider a probabilistic extension of MSO over infinite binary trees, which allows formulas saying “almost surely a branch satisfies ”. This logic was introduced by Mio and Michalewski, and it generalises known (qualitative) probabilistic logics such as probabilistic CTL or probabilistic CTL*. Paper [3] shows that this logic is undecidable. On the other hand, the weak fragment of the logic (where the usual set quantifiers are restricted to range over finite sets) is decidable, which follows from papers [1] and [2]. Paper [1] shows that the weak fragment of the probabilistic logic (and a bit more) can be compiled into an automaton model, while paper [2] shows that emptiness for the automaton model is decidable. more MSO on graphs Mikołaj Bojańczyk, Michal PilipczukDefinability equals recognizability for graphs of bounded treewidth. LICS, 2016   PDF Mikołaj Bojańczyk, Michal PilipczukOptimizing Tree Decompositions in MSO. STACS, 2017   PDF Mikołaj BojańczykTwo monads for graphs. CoRR, 2018   PDF In paper [1] (see also the arxiv version and these slides) we show that for every there is an MSO transduction, which inputs a graph of tree width at most , and outputs a tree decomposition of width at most . The transduction is nondeterministic, which means it might output several possible tree decompositions, but at least one. A corollary of this result is that a conjecture of Courcelle is true: for languages of graphs of bounded tree width, definability in MSO is equivalent to recognisability. In paper [2], we show that for every there is an MSO transduction which inputs a width tree decomposition and outputs an optimal width tree decomposition of the same graph. Combining these two results, we see that for every there is an MSO transduction which maps graphs of treewidth to their optimal width tree decompositions. Paper [3] uses the terminology of monads to describe recognisable languages of graphs. This is meant as an alternative description of Courcelle’s VR and HR recognisable graph classes. The paper also has a new result, namely it is decidable if an CMSO definable languages of graphs (of bounded treewidth) can be defined in MSO (i.e. it is decidable if the counting, which is the C in CMSO, is necessary). more Recognisable Languages over Monads Mikołaj BojańczykRecognisable languages over monads. CoRR, 2015   PDF There are regular languages for: finite words, finite trees, infinite words, various kinds of infinite trees, queries, tuples of words, tuples of trees, etc etc. This paper shows that monads, a concept from category theory, can be used to unify some of the theory of “regularity”. The idea is that for each setting, like finite words or labelled countable total orders, or infinite trees with countably many branches, one chooses a monad, and then many definitions and some theorems come out for free. Here are some slides. more Transducers with origin information Mikołaj BojańczykTransducers with Origin Information. ICALP (2), 2014   PDF Mikołaj Bojańczyk, Laure Daviaud, Bruno Guillon, Vincent PenelleWhich Classes of Origin Graphs Are Generated by Transducers. ICALP, 2017   PDF The idea proposed in [1] is to change the semantics of a transducer, by adding information about which positions in the output originate from which positions in the input. Under such semantics, called origin semantics, fewer transducers are equivalent to each other, e.g. the reverse and identity transformations over a one letter alphabet are not equivalent under origin semantics, but they are equivalent under standard semantics. The paper shows that with origin semantics, many technical and combinatorial problems go away. There is also an implicit and debatable philosophical point, which is that origin semantics better reflects the “true essence” of a transducer, because when thinking of a transducer one also typically has in mind some origin information. Here are some slides. Paper [2] continues the work on origin semantics. The origin semantics of a transduction can be seen as a set of graphs, which consist of an input string, an output string, and arrows from positions of the output to positions in the input which describe the origin. In [2], we study when a set of such graphs (“origin graphs”) arises from regular transductions. We identify such sets in terms of structural conditions, such as bounded treewidth or bounded outdegree for origins. more MSO+U Mikołaj BojańczykA Bounding Quantifier. CSL, 2004   PDF Mikołaj Bojańczyk, Thomas ColcombetBounds in w-Regularity. LICS, 2006   PDF Mikołaj Bojańczyk, Pawel Parys, Szymon TorunczykThe MSO+U Theory of (N, <) Is Undecidable. STACS, 2016   PDF Mikołaj BojańczykWeak MSO with the Unbounding Quantifier. Theory Comput. Syst., 2011   PDF Mikołaj Bojańczyk, Szymon TorunczykDeterministic Automata and Extensions of Weak MSO. FSTTCS, 2009   PDF Mikołaj Bojańczyk, Szymon TorunczykWeak MSO+U over infinite trees. STACS, 2012   PDF Mikołaj BojańczykWeak MSO+U with Path Quantifiers over Infinite Trees. ICALP (2), 2014   PDF The logic MSO+U is the extension of MSO with the quantifier U, where says that there are arbitrarily large finite sets which make true. The point of the logic is to ",
  "content_length": 38201,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:59"
}