{
  "name": "Milan Straka",
  "homepage": "https://ufal.mff.cuni.cz/milan-straka",
  "status": "success",
  "content": "Milan Straka | ÚFAL Skip to main content Toggle navigation ÚFAL About Events Research Projects Grants Data Tools Lindat Publications Industry Cooperation People Teaching Jobs* Wiki Pakt ICCL Search form Search Toggle navigation Milan Straka | Teaching Readings Docs Vim back to PEOPLE ↩ Milan Straka office Room 420 email straka@ufal.mff.cuni.cz phone (+420) 95155 4361 Main Research Interests Machine Learning Artificial Neural Networks Deep Learning Structured Prediction Bayesian Nonparametrics Modelling and Unsupervised Learning NLP Tools POS Tagging Dependency Parsing Named Entity Recognition and Linking Projects Tools MorphoDiTa NameTag Korektor Parsito UDPipe Data Czech Named Entity Corpus MorfFlex CZ (generation of Lindat files and MorphoDiTa dictionaries) DeriNet Curriculum Vitae My Curriculum Vitae in English and in Czech. Teaching List of the courses I am/was teaching Selected Bibliography Google Scholar ORCID: 0000-0003-3295-5576 Scopus ID: 23391086200 Researcher ID: N-1897-2017 Papers Matěj Kripner, Michal Šustr, Milan Straka (2025): LeanTree: Accelerating White-Box Proof Search with Factorized States in Lean 4. In: Proceedings of the Second AI for Math Workshop, pp. 67-79, International Machine Learning Society (IMLS), Geneva, Switzerland (url, local PDF, bibtex) Michal Novák, Miloslav Konopík, Anna Nedoluzhko, Martin Popel, Ondřej Pražák, Jakub Sido, Milan Straka, Zdeněk Žabokrtský, Daniel Zeman (2025): Findings of the Fourth Shared Task on Multilingual Coreference Resolution: Can LLMs Dethrone Traditional Approaches?. In: Proceedings of The Eighth Workshop on Computational Models of Reference, Anaphora and Coreference, pp. 95-118, Association for Computational Linguistics, Kerrville, TX, USA, ISBN 979-8-89176-342-5 (url, local PDF, bibtex) Petr Pechman, Milan Straka, Jana Straková, Jakub Náplava (2025): Refining Czech GEC: Insights from a Multi-experiment Approach. In: 28th International Conference on Text, Speech and Dialogue (Part II), pp. 64-76, Springer, Cham, Switzerland, ISBN 978-3-032-02551-7 (url, local PDF, bibtex) Milan Straka (2025): CorPipe at CRAC 2025: Evaluating Multilingual Encoders for Multilingual Coreference Resolution. In: Proceedings of The Eighth Workshop on Computational Models of Reference, Anaphora and Coreference, pp. 130-139, Association for Computational Linguistics, Kerrville, TX, USA, ISBN 979-8-89176-342-5 (url, local PDF, bibtex) Jana Straková, Milan Straka (2025): NameTag 3: A Tool and a Service for Multilingual/Multitagset NER. In: Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (Volume 3: System Demonstrations), pp. 31-39, Association for Computational Linguistics, Kerrville, TX, USA, ISBN 979-8-89176-253-4 (url, local PDF, bibtex) Jiří Mayer, Milan Straka, Jan Hajič, jr., Pavel Pecina (2024): Practical End-to-End Optical Music Recognition for Pianoform Music. In: Document Analysis and Recognition -- ICDAR 2024, pp. 55-73, Springer International Publishing, Cham, Switzerland, ISBN 978-3-030-86333-3 (url, local PDF, bibtex) Michal Novák, Barbora Dohnalová, Miloslav Konopík, Anna Nedoluzhko, Martin Popel, Ondřej Pražák, Jakub Sido, Milan Straka, Zdeněk Žabokrtský, Daniel Zeman (2024): Findings of the Third Shared Task on Multilingual Coreference Resolution. In: Proceedings of The Seventh Workshop on Computational Models of Reference, Anaphora and Coreference, pp. 78-96, Association for Computational Linguistics, Kerrville, TX, USA, ISBN 979-8-89176-171-1 (url, local PDF, bibtex) Milan Straka (2024): CorPipe at CRAC 2024: Predicting Zero Mentions from Raw Text. In: Proceedings of The Seventh Workshop on Computational Models of Reference, Anaphora and Coreference, pp. 97-106, Association for Computational Linguistics, Kerrville, TX, USA, ISBN 979-8-89176-171-1 (url, local PDF, bibtex) Milan Straka, Jana Straková (2024): Open-Source Web Service with Morphological Dictionary--Supplemented Deep Learning for Morphosyntactic Analysis of Czech. In: 27th International Conference on Text, Speech and Dialogue, pp. 279-290, Springer, Cham, Switzerland, ISBN 978-3-031-70563-2 (url, local PDF, bibtex) Milan Straka, Jana Straková, Federica Gamba (2024): ÚFAL LatinPipe at EvaLatin 2024: Morphosyntactic Analysis of Latin. In: Proceedings of the Third Workshop on Language Technologies for Historical and Ancient Languages (LT4HALA) @ LREC-COLING-2024, pp. 207-214, ELRA and ICCL, Torino, Italia, ISBN 978-2-493814-46-3 (pdf, local PDF, bibtex) Vojtěch Vančura, Pavel Kordík, Milan Straka (2024): beeFormer: Bridging the Gap Between Semantic and Interaction Similarity in Recommender Systems. In: Proceedings of the 18th ACM Conference on Recommender Systems, pp. 1102-1107, Association for Computing Machinery, New York, NY, United States, ISBN 979-8-4007-0505-2 (url, local PDF, bibtex) Josef Vonášek, Milan Straka, Rostislav Krč, Lenka Lasoňová, Ekaterina Egorova, Jana Straková, Jakub Náplava (2024): CWRCzech: 100M Query-Document Czech Click Dataset and Its Application to Web Relevance Ranking. In: Proceedings of the 47th International ACM SIGIR Conference on Research and Development in Information Retrieval, pp. 1221-1231, Association for Computing Machinery, New York, NY, USA, ISBN 9798400704314 (url, local PDF, bibtex) Ian Roberts, Andres Garcia-Silva, Cristian Berrìo Aroca, José Manuel Gómez-Pérez, Miroslav Jánoší, Dimitris Galanis, Rémi Callizano, Andis Lagzdiņš, Milan Straka, Ulrich Germann (2023): Language Technology Tools and Services. In: European Language Grid: A Language Technology Platform for Multilingual Europe, pp. 131-150, Springer Nature Switzerland AG, Cham, Switzerland, ISBN 978-3-031-17257-1 (url, bibtex) Milan Straka (2023): ÚFAL CorPipe at CRAC 2023: Larger Context Improves Multilingual Coreference Resolution. In: Proceedings of the CRAC 2023 Shared Task on Multilingual Coreference Resolution, pp. 41-51, Association for Computational Linguistics, Stroudsburg, PA, USA, ISBN 978-1-955917-02-5 (url, local PDF, bibtex) Marie Mikulová, Milan Straka, Jan Štěpánek, Barbora Štěpánková, Jan Hajič (2022): Quality and Efficiency of Manual Annotation: Pre-annotation Bias. In: Proceedings of the 13th Conference on Language Resources and Evaluation (LREC 2022), pp. 2909-2918, European Language Resources Association, Marseille, France, ISBN 979-10-95546-72-6 (url, local PDF, bibtex) Jakub Náplava, Milan Straka, Jana Straková, Alexandr Rosen (2022): Czech Grammar Error Correction with a Large and Diverse Corpus. In: Transactions of the Association for Computational Linguistics, ISSN 2307-387X, 10, pp. 452-467 (url, local PDF, bibtex) Milan Straka, Jana Straková (2022): ÚFAL CorPipe at CRAC 2022: Effectivity of Multilingual Models for Coreference Resolution. In: Proceedings of the CRAC 2022 Shared Task on Multilingual Coreference Resolution, pp. 28-37, Association for Computational Linguistics, Gyeongju, Korea (url, local PDF, bibtex) Jakub Náplava, Martin Popel, Milan Straka, Jana Straková (2021): Understanding Model Robustness to User-generated Noisy Texts. In: Proceedings of the 7th Workshop on Noisy User-generated Text (W-NUT 2021), pp. 340-350, Association for Computational Linguistics, Stroudsburg, PA, USA, ISBN 978-1-954085-90-9 (url, local PDF, bibtex) Jakub Náplava, Milan Straka, Jana Straková (2021): Diacritics Restoration using BERT with Analysis on Czech language. In: The Prague Bulletin of Mathematical Linguistics, ISSN 0032-6585, 116, pp. 27-42 (pdf, local PDF, bibtex) David Samuel, Milan Straka (2021): ÚFAL at MultiLexNorm 2021: Improving Multilingual Lexical Normalization by Fine-tuning ByT5. In: Proceedings of the 7th Workshop on Noisy User-generated Text (W-NUT 2021), pp. 483-492, Association for Computational Linguistics, Stroudsburg, PA, USA, ISBN 978-1-954085-90-9 (url, local PDF, bibtex) Milan Straka, Jakub Náplava, Jana Straková (2021): Character Transformations for Non-Autoregressive GEC Tagging. In: Proceedings of the 7th Workshop on Noisy User-generated Text (W-NUT 2021), pp. 417-422, Association for Computational Linguistics, Stroudsburg, PA, USA, ISBN 978-1-954085-90-9 (url, local PDF, bibtex) Milan Straka, Jakub Náplava, Jana Straková, David Samuel (2021): RobeCzech: Czech RoBERTa, a Monolingual Contextualized Language Representation Model. In: 24th International Conference on Text, Speech and Dialogue, pp. 197-209, Springer, Cham, Switzerland, ISBN 978-3-030-83526-2 (url, local PDF, bibtex) Jan Hajič, Eduard Bejček, Jaroslava Hlaváčová, Marie Mikulová, Milan Straka, Jan Štěpánek, Barbora Štěpánková (2020): Prague Dependency Treebank - Consolidated 1.0. In: Proceedings of the 12th International Conference on Language Resources and Evaluation (LREC 2020), pp. 5208-5218, European Language Resources Association, Marseille, France, ISBN 979-10-95546-34-4 (url, local PDF, bibtex) Kateřina Macková, Milan Straka (2020): Reading Comprehension in Czech via Machine Translation and Cross-lingual Transfer. In: 23rd International Conference on Text, Speech and Dialogue, pp. 171-179, Springer, Cham, Switzerland, ISBN 978-3-030-58322-4 (url, local PDF, bibtex) David Samuel, Milan Straka (2020): ÚFAL at MRP 2020: Permutation-invariant Semantic Parsing in PERIN. In: Proceedings of the CoNLL 2020 Shared Task: Cross-Framework Meaning Representation Parsing, pp. 53-64, Association for Computational Linguistics, Stroudsburg, PA, USA, ISBN 978-1-952148-64-4 (url, local PDF, bibtex) Milan Straka, Jana Straková (2020): UDPipe at EvaLatin 2020: Contextualized Embeddings and Treebank Embeddings. In: Proceedings of LT4HALA 2020 - 1st Workshop on Language Technologies for Historical and Ancient Languages, pp. 124-129, European Language Resources Association (ELRA), Marseille, France, ISBN 979-10-95546-53-5 (url, local PDF, bibtex) Daniel Kondratyuk, Milan Straka (2019): 75 Languages, 1 Model: Parsing Universal Dependencies Universally. In: Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th Internatio",
  "content_length": 21801,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:59"
}