{
  "name": "Milena Radenkovic 0001",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/milena.radenkovic",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Milena RadenkovicAssistant Professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsResearchPublications Contact workRoom C54 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/amilena.radenkovic@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~mvr Research SummaryMy research interest spans the areas of cognitive, self organised, opportunistic networks and systems that are agile and adaptive to users' demands and dynamic patterns of the underlying mobile ad… read moreRecent Publications M. H. REHMANI, M. REISSLEIN, A. RACHEDI, M. EROL-KANTARCI and M. RADENKOVIC, 2018. Integrating Renewable Energy Resources into the Smart Grid: Recent Developments in Information and Communication Technologies IEEE Transactions on Industrial Informatics. PP(99), 1-1M. RADENKOVIC, V. S. H. HUYNH and P. MANZONI, 2018. Adaptive Real-Time Predictive Collaborative Content Discovery and Retrieval in Mobile Disconnection Prone Networks IEEE Access. 6, 32188-32206RADENKOVIC, MILENA and WALKER, ADAM, 2018. CognitiveCharge: Disconnection Tolerant Adaptive Collaborative and Predictive Vehicular Charging In: Proceedings of the 4th ACM MobiHoc Workshop on Experiences with the Design and Implementation of Smart Objects. 2:1-2:9HUYNH, VU SAN HA, RADENKOVIC, MILENA and JOHN, ROBERT, 2018. Understanding information centric layer of adaptive collaborative caching framework in mobile disconnection-prone networks In: 14th International Wireless Communications and Mobile Computing Conference (IWCMC 2018). View all publications Current ResearchMy research interest spans the areas of cognitive, self organised, opportunistic networks and systems that are agile and adaptive to users' demands and dynamic patterns of the underlying mobile ad hoc communications. End devices are capable of learning, predicting the patterns of behaviour of other devices and resources, and dynamically sharing the resources. I am interested in a number of open research questions such as improving energy efficiency, designing new and more efficient data dissemination and routing protocols and new adaptive security and privacy techniques for data transmission in such environments.Past ResearchDr Radenkovic is based in the Mixed Reality Lab working on the MyGrid e-science project that aims to design, develop and demonstrate higher level functionalities over an existing Grid infrastructure that support scientists in making use of complex distributed resources. Her PhD research was concerned with the design and realization of large scale adaptive audio services for environments that actively support collaboration and natural audio communication between large number of simultaneous users. Distributed Partial Mixing was proposed as a new approach to distributed audio support that performs flexible management of audio streams at multiple points in the network in order to decrease network requirements as well as provide different levels of audio fidelity. The concept of Distributed Partial Mixing was the subject of a patent application by British Telecom (Patent Application Number GB 01-03595, April 2000). The international patent was successfully granted in 2002 under the publication number WO 02/17579. Dr Radenkovic's current research focuses on designing and building services for supporting domain-specific scientific collaboration over the newly emerging heterogeneous Grids. She has been designing a conceptual framework for scientific collaboration that also includes building metadata-driven portal, user proxy and e-Science gateways that interact with a wide range of database services, bioinformatics services, ontology and metadata services, notification service and workflow engine services. Her more recent research objectives focus on designing a network management and multimedia resource virtualisation support layer in heterogeneous Grids that is essential for the operation of the middleware services that support collaboration (such as those developed within myGrid). For many years she has contributed to a variety of projects including: Network Architectures for Inhabited-TV, Multimedia Networking for Inhabited-TV, eRENA, HIVE, myGrid. M. H. REHMANI, M. REISSLEIN, A. RACHEDI, M. EROL-KANTARCI and M. RADENKOVIC, 2018. Integrating Renewable Energy Resources into the Smart Grid: Recent Developments in Information and Communication Technologies IEEE Transactions on Industrial Informatics. PP(99), 1-1M. RADENKOVIC, V. S. H. HUYNH and P. MANZONI, 2018. Adaptive Real-Time Predictive Collaborative Content Discovery and Retrieval in Mobile Disconnection Prone Networks IEEE Access. 6, 32188-32206RADENKOVIC, MILENA and WALKER, ADAM, 2018. CognitiveCharge: Disconnection Tolerant Adaptive Collaborative and Predictive Vehicular Charging In: Proceedings of the 4th ACM MobiHoc Workshop on Experiences with the Design and Implementation of Smart Objects. 2:1-2:9HUYNH, VU SAN HA, RADENKOVIC, MILENA and JOHN, ROBERT, 2018. Understanding information centric layer of adaptive collaborative caching framework in mobile disconnection-prone networks In: 14th International Wireless Communications and Mobile Computing Conference (IWCMC 2018). ADAM WALKER and MILENA RADENKOVIC, 2017. GPSR-TARS: Congestion Aware Geographically Targeted Remote Surveillance for VANETs In: 2017 IEEE International Conference on Selected Topics in Mobile and Wireless Networking (MoWNeT). JOYCE HOESE ADDAE, MICHAEL BROWN, XU SUN, DAVE TOWEY and MILENA RADENKOVIC, 2017. Measuring attitude towards personal data for adaptive cybersecurity Information and Computer Security. MILENA RADENKOVIC and VU SAN HA HUYNH, 2017. Collaborative Cognitive Content Dissemination and Query in Heterogeneous Mobile Opportunistic Networks In: The 23rd Annual International Conference on Mobile Computing and Networking, MobiCom 2017, 3rd Workshop on Experiences with the Design and Implementation of Smart Objects. (In Press.)VU SAN HA HUYNH and MILENA RADENKOVIC, 2017. A Novel Cross-layer Framework For Large Scale Emergency Communications In: 2017 IEEE International Wireless Communications and MobileComputing Conference (IWCMC). RADENKOVIC, MILENA, 2016. Cognitive Privacy for Personal Clouds Mobile Information Systems. vol. 2016, Article ID: 7107103MURRAY GOULDEN, CHRISTIAN GREIFFENHAGEN, JON CROWCROFT, DEREK MCAULEY, RICHARD MORTIER, MILENA RADENKOVIC and ARJUNA SATHIASEELAN, 2016. Wild interdisciplinarity: ethnography and computer science International Journal of Social Research Methodology. 0, 1-14MUBASHIR HUSAIN REHMANI, ABDERREZAK RACHEDI, MELIKE EROL-KANTARCI, MILENA RADENKOVIC and MARTIN REISSLEIN, 2016. Cognitive radio based smart grid: The future of the traditional electrical grid Ad Hoc Networks. 41, 1 - 4M. RADENKOVIC, J. CROWCROFT and M. H. REHMANI, 2016. Towards Low Cost Prototyping of Mobile OpportunisticDisconnection Tolerant Networks and Systems IEEE Access. 4, 5309-5321M. RADENKOVIC and V. S. H. HUYNH, 2016. Low-cost mobile personal clouds In: 2016 International Wireless Communications and MobileComputing Conference (IWCMC). 836-841MILENA RADENKOVIC and NATASA MILIC-FRAYLING, 2015. Demo: RasPiPCloud: A Light-weight Mobile Personal Cloud In: Proceedings of the 10th ACM MobiCom Workshop on Challenged Networks, CHANTS@MobiCom 2015, Paris, France, September 11, 2015. 57-58M. RADENKOVIC, I. KOSTADINOV and B. WIETRZYK, 2015. Increasing communication reliability in manufacturing environments In: 2015 International Wireless Communications and Mobile Computing Conference (IWCMC). 1377-1383H. NGUYEN-MINH, A. BENSLIMANE and M. RADENKOVIC, 2015. Social delay tolerant approach for safety services in vehicular networks In: 2015 International Wireless Communications and Mobile Computing Conference (IWCMC). 1199-1204M. H. REHMANI, M. EROL KANTARCI, A. RACHEDI, M. RADENKOVIC and M. REISSLEIN, 2015. IEEE Access Special Section Editorial Smart Grids: a Hub of Interdisciplinary Research IEEE Access. 3, 3114-3118SATHIASEELAN, ARJUNA, MORTIER, RICHARD, GOULDEN, MURRAY, GREIFFENHAGEN, CHRISTIAN, RADENKOVIC, MILENA, CROWCROFT, JON and MCAULEY, DEREK, 2014. A Feasibility Study of an In-the-Wild Experimental Public Access WiFi Network In: Proceedings of the Fifth ACM Symposium on Computing for Development. 33-42RADENKOVIC, M., BENSLIMANE, A. and MCAULEY, D., 2013. Reputation aware obfuscation for mobile opportunistic networks IEEE Transactions on Parallel and Distributed Systems. n/a(n/a), n/aRADENKOVIC, MILENA, HOWARD, HEIDI, CROWCROFT, JON, GOULDEN, MURRAY, GREIFFENHAGEN, CHRISTIAN, MCAULEY, DEREK and MORTIER, RICHARD, 2013. Providing security for wireless community networks In: Proceedings of the 2013 ACM MobiCom workshop on Lowest cost denominator networking for universal access. 29-32BENSLIMANE, A., RADENKOVIC, M. and ZAKHARY, S., 2013. Efficient location privacy-aware forwarding in opportunistic mobile networks IEEE Transactions on Vehicular Technology. n/a(n/a), n/aZAKHARY, S. and RADENKOVIC, M., 2012. Utilizing social links for location privacy in opportunistic delay-tolerant networks In: International Conference on Communications. 1059-1063RADENKOVIC, M. and GRUNDY, A., 2012. Efficient and adaptive congestion control for heterogeneous delay-tolerant networks Ad Hoc Networks. 10(7), 1322-1345RADENKOVIC, M. and GRUNDY, A., 2011. Framework for utility driven congestion control in delay tolerant opportunistic networks In: Wireless Communications and Mobile Computing Conference (IWCMC), 2011 7th International. 448-454RADENKOVIC, M. and GRUNDY, A., 2011. Congestion aware forwarding in delay tolerant and social opportunistic netw",
  "content_length": 14807,
  "method": "requests",
  "crawl_time": "2025-12-01 13:59:59"
}