{
  "name": "Milica Gasic",
  "homepage": "https://www.cs.hhu.de/lehrstuehle-und-arbeitsgruppen/dialog-systems-and-machine-learning/unser-team/team.html",
  "status": "success",
  "content": "Team Zum Inhalt springen Zur Suche springen de/en |Intranet|Portale|ULB-Katalog HHU Math.-Nat. Fakultät Informatik Lehrstühle und Arbeitsgruppen Dialog Systems and Machine Learning Team Lehrstuhlinhaberin Prof. Dr. Milica Gašić Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.29 40225 Düsseldorf Nordrhein-Westfalen +49 211 81-13787 E-Mail senden Homepage Lehrstuhl Management Verena Schlösser-Lewin Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.36 40225 Düsseldorf Nordrhein-Westfalen 0211 - 81 10594 Administrator Thomas Spitzlei Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 02.48 40225 Düsseldorf Nordrhein-Westfalen +49 211 81-11632 E-Mail senden Academic Teacher Dr. Peter Arndt Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.24 40225 Düsseldorf Nordrhein-Westfalen +49-211-81-10425 E-Mail senden Homepage Academic Teacher Dr. Konrad Völkel Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.24 40225 Düsseldorf Nordrhein-Westfalen +49-211-81-10425 E-Mail senden Homepage Postdoktoraler Wissenschaftler Dr. Michael Heck Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.32 40225 Düsseldorf Nordrhein-Westfalen +49-211-81-13973 E-Mail senden Homepage Postdoktoraler Wissenschaftler Dr. Hsien-Chin Lin Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.30 40225 Düsseldorf Nordrhein-Westfalen +49-211-81-10428 E-Mail senden Homepage Postdoktorale Wissenschaftlerin Dr. Nurul Fithria Lubis Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.34 40225 Düsseldorf Nordrhein-Westfalen +49-211-81-10430 E-Mail senden Homepage Postdoktoraler Wissenschaftler Dr. Carel van Niekerk Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.32 40225 Düsseldorf Nordrhein-Westfalen +49-211-81-13973 E-Mail senden Homepage Postdoktoraler Wissenschaftler Dr. Benjamin Matthias Ruppik Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.25 40225 Düsseldorf Nordrhein-Westfalen 0211-81 12045 E-Mail senden Homepage Doktorand Shutong Feng Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.34 40225 Düsseldorf Nordrhein-Westfalen +49 211 81-10430 E-Mail senden Homepage Doktorand Renato Sprenger-Vukovic Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.25 40225 Düsseldorf Nordrhein-Westfalen 0211-81 12045 E-Mail senden Homepage Studentische Hilfskraft (WHB) Michael Petrowski Universitätsstr. 1 Gebäude: 25.12 Etage/Raum: 01.30 40225 Düsseldorf Nordrhein-Westfalen E-Mail senden Startseite Abteilung Unser Team Lehre und Abschlussarbeiten Unsere Forschung Unsere Projekte Publikationen Serviceseite Jobs Verantwortlichkeit: Sekretariat Dialog Systems and Machine Learning : Per E-Mail kontaktieren Nach oben Open search Close search Search",
  "content_length": 2614,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:00"
}