{
  "name": "Milind A. Sohoni",
  "homepage": "https://www.cse.iitb.ac.in/~sohoni",
  "status": "success",
  "content": "Milind Sohoni Home Page Something New Stabilizer Limits and Orbit Closures in GCT Talk at Chennai Math. Institute, 24th February, 2025. Presentation pdf. Prof. Vora Memorial Lecture, 4th April, 2024, Pune. Announcement link. Presentation link. Working Paper in Geometric Complexity Theory: Stabilizer Limits and Intermediate G-varieties link. The IIT Bombay - Unnat Maharashtra Abhiyan 1-week Rural Drinking Water - Ratnagiri district - Live Mapathon is here! Dates: 1 May - 21st May, 2023. Details link Over . But see link for other activities. Pathways - A Presentation made to Secretary, DST and Director on the way ahead for the GISE Hub, February 2024. link. New project: Moderninzing village maps for the Dept. of Land Records, GoM, the project in brief link, and the MoU link. Renewed till July 2025! pdf. Also see presentation made to DoLR, Govt. of India on 16th October, 2024 in New Delhi, pdf. New project: For Himachal Pradesh Integrated Development Program (HP-IDP) - Village Level Water Budgets . See summary presentation pdf, and detailed presentation pdf. MSRTC Data Sharing MoU renewed, link. Recent Courses Monsoon 2025 Semester: CS 782 Alegbraic Techiniques in Complexity Theory (in slot 6). Prerequisites: Familiarity with basic alegbra - a good text is Artin's Algebra. Registration: Instructor Consent Required. link. Also see link to pdf of the overleaf page. CS 213 Minor, Spring Semester 2024. Course Plan. link. Resources link. Monsoon 2023 Semester: Apale Prashna Apale Vidnyan, CEP Course link. Past Courses Discrete Structures taught at IIT Goa (Monsoon, 2019), course notes pdf. Development Engineering at IIT Bombay (July 2018) link. Data Structures taught at IIT Dharwad (Spring, 2017) link. IIT Dharwad CSE students map Dharwad city bus routes. link. And Charu Agrawal cleans up the data link, makes a Applet, writes a report link, makes a presentation at IIT Goa (10th April, 2018) link. New. Case-study based analysis of public transport, link. Newspaper Articles (and some recent rejected ones) Why Secular and Socialist should remain in the Preamble. submitted to Indian Express, 10th July, 2025, in response Hon. Vice President's comments on the same on 1st July, 2025. pdf. Is Sanatan Dharma a Good System of Governance? submitted to Indian Express, 10th Feb. 2025, in response Mr. Ram Madhav's article on 1st Feb. 2025. pdf. Why Adhunik Bharat needs to come before Viksit Bharat in Indian Express, 2nd October 2024, pdf, Loksatta (marathi), 3rd October, 2024, image. The NEET Supreme Court Order - What do we learn from it. in Indian Express Online, 30th August 2024, link., article version pdf. In loksatta on 13th August, pdf and its map version pdf. How Are We As A Democracy in Indian Express, 9th April 2024, pdf., full version pdf. What You Don't Ask and Don't Get in Indian Express, 28th December 2023, pdf. The Maratha Andolan - Jobs and Higher Education in Loksatta (marathi), 5th November, 2023, pdf. Why Am I a Hindu but not a Sanatani? in Indian Express, 14th September, 2023, pdf. Apley Prashna Apley Vidnyan gets coverage in Loksatta. Article by Harshad Tulpule, UMA staff in Loksatta, 10th September, 2023. pdf. Why do IIT Graduates not take up Engineering Jobs? in Indian Express, 15th June, 2023, pdf. Karnataka - Did the People Win in Indian Express, 19th May, 2023, pdf. The Empathy in Science a version appeared in in Indian Express, 19th April, 2023, pdf. The Fall of Vikasvaad in Indian Express, 24th February, 2023, pdf, the full version pdf. Analysing the Professor's Job as in Loksatta (marathi), 5th February, 2023, pdf, the original version pdf. ST versus Railway (budgets, investments and social returns ) in Loksatta (marathi), 30th October, 2022. pdf The Chiplun Imperative (on India's Trash Problem) in Indian Express, 28th September, 2022. pdf The Importance of Regional Parties in Loksatta , 5th September, 2022. pdf The sordid state of Center-State Relationship in Deccan Herald, 30th July, 2022. pdf Is the double engine serving the people? in Loksatta (Marathi), 29th May, 2022. pdf Job and Education: The Great Exodus in Indian Express, 25th February, 2022. pdf The Outcomes of Education, in Loksatta, 15th February, 2021. link Measuring Outcomes of Infrastructure Investments pdf Maps version of article which appeared in Indian Express on 18th March, 2021. link. . Why is our Science not able to meet Societal Needs, in Loksatta, 15th February, 2021. link UGC versus the States in Indian Express, 27th August, 2020. pdf A Diconnected Pedagogy (on India's National Curricula) in Indian Express, 5th March, 2020. pdf Punha Ekadaa Vikaasvaad (Marathi), Op-ed in Loksatta, 21st December, 2019. link. The Right To Science a version appeared in The Indian Express, 16th October, 2019. link. The National Education Policy - Where is the vikasvaad? a version appeared in The Indian Express, 18th July, 2019 jpg (with Oshin Dharap). The Real Vikasvaad Manifesto - the democratization of knowledge and power in Indian Express, 19th April., 2019 jpg. Real Vikasvaad and Elite-vaad. in Indian Express, 25th Dec., 2018 jpg. The Artificial Shortage of Jobs in Indian Express, jpg and in Loksatta (marathi). Aug. 2018 jpg. Stunted Development-Who is to blame? Politics or Bureaucracy? appeared in Loksatta, 27th May, 2018. jpg. A variation has now appeared in Indian Express, jpg. And also Vivek (in Marathi) pdf. The artificial shortage of facts, Op-ed in Indian Express, 22nd December, 2017. jpg. Science and technology for a Developing Country in Indian Express on 5th August, 2017. clip. link. Whats Recent Vikasvaad and the role of knowledge. Invited Lecture at the Gokhale Institute, Pune, 12th August, 2022. presentation(pdf). CS 213 M within IITB My Manifesto as \"Aaj Ka Kshudra\", November 20, 2021, Hindi. pdf. Vikasvaad as Advocacy Lecture is Prof. Subodh Wagle's Policy for Engineers and Scientists course in IIT Bombay. 22nd October 2021. presentation(pdf). video link. Hon. Health Minister, GoM, claims that there were no O2 deaths. Letter requesting details. 23th July, 2021. pdf. Submission to Hon. Justice D. Y. Chandrachud, Supreme Court of India, on 28th June 2021 on computing oxygen requirements and provision of health care. pdf. Submission to Shri Lav Agarwal, Joint Secretary, MoHFW, GoI, on 15th May 2021 on computing oxygen requirements. pdf. Presentation collecting facts in view of Maharashtra Covid-19 situation as on June 1, 2021. pdf. A Covid Ready-Reckoner for ICU-O2 Beds pdf. Letter to Secretary, MoHFW, 16th April 2021 on Ready Reckoner, pdf. May have worked...see new MHA Order of 24th April, and highlighted parts, pdf Higher Education, Jobs and Development A workshop organized by Mumbai University of the Case-Study Approach (26th April, 2021). My presentation: pdf and implementation details pdf. The Rice Production in a Village Case Study Description. pdf, and in marathi pdf. Now more case studies - A Cashew Factory, pdf, a Flour Mill pdf, and a village-level drinking water assessment, pdf. Letter to UGC on Outcome Based Curricula Framework, 14th August, 2020, pdf. Letter to Hon. Minister of Railways, GoI on metrics for Corona, 26th May, 2020, pdf. Letter to Hon. Secretary, Ministry of Health and Family Welfare, GoI on metrics for Corona, 19th May, 2020, pdf. Competitive Exams, Science and Society , Institute Colloquium at IISER Pune, 1st November, 2019. poster, presentation pdf, video of talk link and Q/A link. Geography, Engineering and the City- exploring North Goa's water supply and a way of doing engineering. , talk at Goa Engineering College, 15th April, 2019. link. Vernacular Science - The Science of Delivery , IITB TeDX talk, 19th Jan., 2019. link, the presentation pdf, and the script, pdf. Development, Science and Higher Education Talk at North Maharashtra University, 14th July 2018, Jalgaon (marathi). pdf. pdf. Development, Science and Higher Education Talk at North Maharashtra University, 14th July 2018, Jalgaon (marathi). pdf. The Crisis in Higher Education and a way out. Talk at various Universities in Maharashtra. pdf. Also see report: pdf and simplified suggestions: pdf. IIT Ropar version: pdf. Challenges and Opportunities in Engineering: The Unnat Maharashtra Abhiyan, Talk at various colleges of Maharashtra. pdf, video of a version link. The Development Agenda and the Progress of Science and Technology in India, article in Confluence, a blog of the Indian Academy of Sciences, 11th January, 2018, link Unnat Maharashtra Abhiyan, a short introduction prepared for various occasions. pdf. Water Supply: Problems and Solutions, invited talk at the Unicef Workshop on Innovations and Equity in WASH, Lonavla, June 16-17, 2017, pdf. Towards a Material Society: Development as Engineering, at the Workshop on Studies on Science and Technology Education: Culture, Imaginaries and Economy, JNU, 2-3 March, 2017, pdf. The Regional Engineering Proposal to MHRD and various IITs to engage with regional engineering problems pdf. Supporting UG course Development Engineering (approved by IIT Bombay UGPC) to prepare students for undertaking case-studies and field-work in development sectors pdf. CTARA Convocation Day Talk 2016 pdf, CTARA Convocation Day Talk 2015 pdf, Khoj Foundation Talk (2nd April, 2016, New Delhi) pdf, video clip, audio clip, A NEU version (18th May, 2016): pdf, you-tube, Talk in Nasik on Irrigation (February). pdf, Field visit to Parbhani District in April, 2015 to study Jal yukta Shivar villages. prabhani JYS. A more thorough analysis of Pedgaon is planned and here is the letter of authority. pdf, Talk at TISS-Rajasthan-Livelihoods Workshop, Feb. 26th, 2015. link, Indrayani's M.Tech. thesis, link, and presentation link. The University and The Development Agenda, A note to define a new role for the university, October, 2014 (in EPW, March 2015). (pdf) . Knowledge, Society and Global Order, Talk at the Zakir Hussain Center, Jawaharlal Nehru University, New Delhi, 26th September, 2014. (abstract) (presentation) The Elite Uni",
  "content_length": 18132,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:00"
}