{
  "name": "Milind Kulkarni 0001",
  "homepage": "https://engineering.purdue.edu/~milind",
  "status": "success",
  "content": "Milind Kulkarni Milind Kulkarni Home Email milind 'at' purdue 'dot' edu Position Michael and Katherine Birck Head and Professor Affiliations Elmore Family School of Electrical and Computer Engineering Department of Computer Science (by courtesy) Purdue University Office MSEE 150 Phone 765.494.3539 Currently teaching I am not teaching this semester. Home Publications Research Students Courses I am the Michael and Katherine Birck Head of ECE and a Professor with the Elmore Family School of Electrical and Computer Engineering at Purdue University. I am also the Head of the School. My research area is Programming Languages and Compilers, and my interests lie specifically in developing languages, compilers and runtimes that support efficient programming and high performance on emerging complex architectures. For more details of this work, see my research interests. I am one of the founding members of the Center for Programming Principles and Software Systems, which brings together researchers from programming languages, formal methods, and software engineering along with our collaborators in fields like AI, security, and computational science, to tackle the grand challenges of building effective software. I am a member of PurPL, the Purdue Programming Languages Research group. I am also an affiliate of the Center for Resilient Infrastructures, Systems, and Processes (CRISP). Working with me If you are interested in working with some of the top computer systems researchers in the country, I encourage you to apply to Purdue Computer Engineering!. Brief Bio I graduated in 2002 with a B.S. in both Computer Science and Computer Engineering from North Carolina State University. I received my Ph.D. in Computer Science from Cornell University. My advisor was Keshav Pingali. While pursuing my Ph.D., I was supported by a Department of Energy High Performance Computer Science (HPCS) Fellowship. After receiving my Ph.D., I joined the Institute for Computational Sciences and Engineering at the University of Texas at Austin as a postdoc, where I worked with the Intelligent Software Systems (ISS) group. Since the fall of 2009, I have been in the Elmore Family School of Electrical and Computer Engineering at Purdue University. Awards and Honors NSF CAREER award, 2012. Wilfred \"Duke\" Hesselberth Award for Teaching Excellence, 2012. DOE Early Career Research Program award, 2013. Purdue Seed for Success award, 2013. Teaching for Tomorrow Fellow, 2014–2015. Ruth and Joel Spira Outstanding Teaching Award, 2014. Purdue College of Engineering Exceptional Early Career Teaching Award, 2015. Presidential Early Career Award for Scientists and Engineers, 2016. Purdue Seed for Success award, 2016. Eta Kappa Nu Outstanding Teacher Award, 2018. Wilfred \"Duke\" Hesselberth Award for Teaching Excellence, 2018. University Faculty Scholar, 2018. IEEE TCSE Distinguished Paper Award (for XSTRESSOR), 2019. Purdue Seed for Success award, 2019. IEEE Senior Member, 2019. Purdue Seed for Success award, 2020. Purdue College of Engineering Faculty Excellence Award for Online Education, 2021. Eta Kappa Nu Outstanding Professor Award, 2021. Charles B. Murphy Outstanding Undergraduate Teaching Award, 2022. Eta Kappa Nu Outstanding Professor Award, 2022. ICS Best Paper Award (for SparseLNR), 2022. ACM Distinguished Member, 2022. Eta Kappa Nu Outstanding Professor Award, 2023. Wilfred \"Duke\" Hesselberth Award for Teaching Excellence, 2023. Motorola Excellence in Teaching Award, 2023 Purdue Book of Great Teachers, 2023. Dean A. A. Potter Faculty Excellence Award for Undergraduate Teaching, 2024. ICS Best Paper Award (for Arkade), 2024. My full CV can be found here. Outside Computer Science, my interests include reading, playing the piano and the mandolin, and cooking. Selected Recent Publications Coyote: A Compiler for Vectorizing Encrypted Arithmetic Circuits Raghav Malik, Kabir Sheth and Milind Kulkarni Architectural Support for Programming Languages and Operating Systems (ASPLOS) 2023. March, 2023 Acceptance rate: 21% Details coming soon Unirec: A Unimodular-like Framework for Nested Recursion and Loops Kirshanthan Sundararajah, Charitha Saumya and Milind Kulkarni Object-Oriented Programming Systems, Languages and Applications (OOPSLA) 2022 December, 2022 Acceptance rate: 31% Details coming soon SparseLNR: accelerating sparse tensor computations using loop nest restructuring Adhitha Dias, Kirshanthan Sundararajah, Charitha Saumya and Milind Kulkarni International Conference on Supercomputing (ICS) June, 2022 Acceptance rate: 24% Best Paper Award Details coming soon QuickSilver: Modeling and Parameterized Verification for Distributed Agreement-Based Systems Nouraldin Jaber, Christopher Wagner, Swen Jacobs, Milind Kulkarni and Roopsha Samanta Object-Oriented Programming, Systems, Languages & Applications (OOPSLA) October, 2021 Acceptance rate: 35% Details coming soon Vectorized Secure Evaluation of Decision Forests Raghav Malik, Vidush Singhal, Benjamin Gottfried and Milind Kulkarni Programming Languages Design and Implementation (PLDI) June, 2021 Acceptance rate: 23% Details coming soon This website does not reflect the views of Purdue University. © 2007–2025 Milind Kulkarni.",
  "content_length": 5220,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:01"
}