{
  "name": "Milind Tambe",
  "homepage": "https://teamcore.seas.harvard.edu/tambe",
  "status": "success",
  "content": "Milind Tambe Skip to content HARVARD.EDU Please don’t remove this alert box from this page.This alert box is placed on all the pages of this website. Although visible in edit mode, it is hidden by custom code. Bio, Research and Awards Teaching and Service Selected News Stories Featured Videos Current Projects Milind Tambe Short bio for external seminars: Milind Tambe is Gordon McKay Professor of Computer Science at Harvard University; concurrently, he is also Principal Scientist and Director for “AI for Social Good” at Google Research. Prof. Tambe and his team have developed innovative AI and multi-agent reasoning systems that have been successfully deployed to deliver real-world impact in public health (e.g., maternal and child health), public safety, and wildlife conservation. He is the recipient of the AAAI Award for Artificial Intelligence for the Benefit of Humanity, the AAAI Feigenbaum Prize, the IJCAI John McCarthy Award, the AAAI Robert S. Engelmore Memorial Lecture Award, the AAMAS ACM/SIGAI Autonomous Agents Research Award, and the INFORMS Wagner Prize for excellence in Operations Research practice. He is a fellow of AAAI and ACM. For his work on AI and public safety, he has also received the Military Operations Research Society Rist Prize for best implemented national security operations research study, the Columbus Fellowship Foundation Homeland security award, and commendations and certificates of appreciation from the US Coast Guard, the Federal Air Marshals Service, and airport police at the city of Los Angeles. milind_tambe@harvard.edu Prof. Tambe’s CV Teamcore Group Home Bio, Research and Awards Longer bio: Milind Tambe is Gordon McKay Professor of Computer Science at Harvard University, where he was previously also director for the Center for Research on Computation and Society (CRCS). Concurrently, he is also Principal Scientist and Director for “AI for Social Good” at Google Research. Prof. Tambe and his team have developed pioneering AI and multi agent systems that deliver real-world impact in public health (e.g., maternal and child health), public safety, and wildlife conservation. Prof Milind Tambe at the Convocation address at Univ of Toronto 2025[9 min] Prof. Tambe is recipient of the  AAAI (Association for Advancement of AI) Award for Artificial Intelligence for the Benefit of Humanity,    AAAI Feigenbaum Prize,   IJCAI (International Joint Conference on AI) John McCarthy Award,    AAAI Robert S. Engelmore Memorial Lecture Award, AAMAS ACM (Association for Computing Machinery) Autonomous Agents Research Award,  INFORMS ( Institute for Operations Research and the Management Sciences) Wagner prize for excellence in Operations Research practice   and   MORS (Military Operations Research Society) Rist Prize for best implemented national security operations research study.  He is a fellow of AAAI and ACM.  For his work on AI and public safety, he has received Columbus Fellowship Foundation Homeland security award and commendations and certificates of appreciation from the US Coast Guard, the Federal Air Marshals Service and airport police at the city of Los Angeles. Prof. Tambe and coauthors have received 17 best paper awards at conferences such as AAAI, AAMAS, IJCAI, and others; this includes his 1997 paper “Towards flexible teamwork” in the Journal of AI Research (focused on agent teamwork) that won the AAMAS influential paper award (an award given out 10 years after publication of a paper). His other prior awards include the CREATE Detlof von Winterfeld award, the Okawa foundation award, the RoboCup Scientific challenge award and the IBM faculty award. Keynote at KDD 2022 Prior to Harvard, Prof. Tambe was the Helen N and Emmett H Jones Professor in Engineering at the University of Southern California (USC), where he was also founding co-director for the Center for AI in Society (CAIS). At USC, he was awarded the USC associates award for creativity in research, “the highest honors the university faculty can bestow on its members for distinguished intellectual and artistic achievements”, the inaugural USC Viterbi School of Engineering Use-inspired research award, and the Steven B. Sample teaching and mentoring award “only faculty recognition award that is initiated by USC parents and family members”. Prof. Tambe completed his PhD from the School of Computer Science at Carnegie Mellon University. Prior to that, he completed his undergraduate education at BITS, Pilani, India, where he was awarded Distinguished Alumnus Award. Keynote at AAAI 2024 Prof. Tambe Research Prof. Tambe and his team’s work focuses on advancing AI and multiagent systems for public health, conservation & public safety, with a track record of building pioneering AI and multi-agent systems for social impact. In so doing, this research has often provided the first very uses of key multi-agent systems models and algorithms in the real world. Prof. Tambe and team are now exploring new paradigms with LLM (Large Language Model) agents and multi-agent systems to accelerate the AI for social impact process. Some major example projects include the following: AI and Multi-Agent Systems for Public Health (2013 – now) AI for maternal and child care: Prof. Tambe and team were the first to deploy restless bandit algorithms for public health, specifically for maternal and child care. Prof. Tambe and team have been collaborating with the NGO ARMMAN in India since 2019; ARMMAN focuses on maternal and child care in India, working with 40 Million beneficiaries. Prof. Tambe’s work with ARMMAN is focused on the world’s two largest mobile health programs for maternal and child care: a region program based in Mumbai (mMitra) and a pan India program (Kilkari). A key challenge is that beneficiaries/mothers drop out of these healthcare information programs. For the regional mMitra program, Prof. Tambe and team used restless bandits in this large scale public health settings to show a more than 30% reduction in drop out rate. The system has been deployed in the field with ARMMAN since April 2022. Over 350,000 mothers have been assisted by this system in deployment, and it has boosted the engagement, more than doubling the engagement of the bottom 25% of listners with the health information. It has also brought on several health benefits for the mothers. This work was conducted in part at Google Deepmind, India. At Google Deepmind India, Prof. Tambe and team are now collaborating with ARMMAN to assist them with their work on Kilkari, a pan-India program of India’s Ministry of Health and Family Welfare, focused on maternal and child care. Kilkari is one of the largest mobile health programs in the world with 10 Million beneficiaries registered at a time. Initial field trials with Kilkari, using collaborative bandits, have also shown improved engagement with the program. AI for HIV prevention: Prior to this work with ARMMAN, Prof. Tambe and his team also provided the first large scale applications of social network algorithms for public health. Conducted In collaboration with social work researchers, their pioneering large-scale field study focused on spreading HIV prevention information among youth experiencing homelessness (YEH). This project started in 2013 and provided the first empirical results (with 750 YEH in in Los Angeles) demonstrating the use of AI-guided interventions that led to significant reductions in HIV risk behaviors compared to traditional methods. AI and Game Theory for Conservation (2013 – now) AI for protecting endangered wildlife: Prof. Tambe and team were the first to apply AI models, specifically machine learning and game theory, for global scale anti-poaching efforts, as part of the PAWS project for wildlife conservation. The PAWS project was initiated in 2013 and has been extremely effective in predicting poaching activities and recommending patrols against them. Prof. Tambe and team’s decade-long collaboration on PAWS with NGOs has resulted in removing tens of thousands of snares set to trap endangered animals, in Uganda and Cambodia. For example, this work led to a 5-fold increase in snare removals in Cambodia. The SMART partnership – a collaboration of major conservation agencies — has begun deploying PAWS in 800 wildlife parks internationally, bringing AI to the fight to save the lives of endangered animals all around the globe.PAWS was listed as “Top Tech” of 2018 by IEEE spectrum. AI and Game Theory for public Safety (2006-2018) AI for optimizing security operations for counter-terrorism: Prof. Tambe and team provided the first ever applications of computational game theory for operational security. The first of these deployments was the ARMOR system of game theoretic algorithms for security (e.g., counter terrorism) which started operating at the Los Angeles LAX airport in 2007. This is one of the largest and busiest airports in the United States that serves 80 Million passengers, where ARMOR’s security games provided day-to-day randomized schedules for checkpoints and canine patrols for over 10 years. This research was followed by pioneering deployments of security games used by major security agencies, including the US Coast Guard to generate patrols in ports such as New York and Boston since 2011, the US Federal Air Marshals for scheduling air marshals on US air carriers international flights since 2009 and others. This research is credited with more than $100M in savings to US agencies. The LAX airport police, the Federal Air Marshals Service, and the US Coast Guard, have testified in United States Congress committee hearings on three separate occasions, about the utility of security games-based software for improving public safety & security (2008, 2012, 2013). See also Teamcore group home page. Since 2017, the focus of Teamcore group’s security games research has shifted to AI for conservation. Prof. Tambe’s research has also focused on fueling and energizing the “AI for social good” ecosystem around the g",
  "content_length": 17543,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:04"
}