{
  "name": "Milos Hauskrecht",
  "homepage": "https://cs.pitt.edu/~milos",
  "status": "success",
  "content": "Milos Hauskrecht's Home Page Milos Hauskrecht Professor of Computer Science Address: Department of Computer Science 5329 Sennott Square University of Pittsburgh Pittsburgh, PA 15260 412-624-8845 (voice) 412-624-8854 (fax) e-mail: milos_at_pitt.edu Postdoc opening for ML modeling of biological processes Information for prospective graduate students Education: MS in Computer Science, Department of Computer Science, Slovak Technical University, Bratislava, Slovakia, May 1988. PhD in Computer Science, Department of Electrical Engineering and Computer Science, Massachusetts Institute of Technology, Cambridge, MA, August 1997. CV Research: My research more broadly covers artificial intelligence, and machine learning. My research work is often motivated by biomedical informatics problems and applications. More specifically, my current work develops machine learning technologies for analysis of high dimensional time-series data in electronic health records (EHRs), patient state modeling, extraction and representation of biomedical knowledge and its combination with ML methods. One of the aims of my work is to deploy the AI models at bedside to perform real-time clinical monitoring and alerting, real-time patient assessment, real-time adverse event detection. Finally, my most recent research is on control and optimization of complex biological and clinical processes. Publications Research projects: Modeling and control of clinical and biological processes. AI models for real-time clinical monitoring and alerting Time-series modeling for EHR and waveform data Mining temporal predictive patterns Cost-effective human annotation/labeling Past research projects: Non-parametric graph-based methods Markov Decision processes Modeling, analysis and optimization of stochastic networks Noisy-or component analysis. Modeling and learning of transportation networks. Resource optimizations for transportation networks. Machine learning methods for high-throughput bioinformatics data. Statistical methods for identification of hidden regulatory pathways from gene expression data. Algorithms for preprocessing and analysis of high-throughput MS proteomic and genomic data and for biomarker discovery. Methods for protein ID in whole sample proteomics using prior knowledge Current research funding: NIH R01EB032752. Learning alerting models for clinical care from EMR data and human knowledge (PI: Hauskrecht) DARPA. REPAIR: Regenerative Electronic Platform through Advanced Intelligent Regulation (PI: Badylak) NIH 1R01 DK131586-01. AI Driven Acute Renal Replacement Therapy (PI: Murugan) NIH 2R01 NR013912-08A1 (PI: Al-Zaiti) Predicting Patient Instability Noninvasively for Nursing Care (PPINC-3) Teaching/ Advising Teaching in Spring 2023: CS 2750 Machine Learning (the course material is now available in Canvas) Current PhD students Matt Barren Ankitkumar Joshi Jayati Jui Junheng Wang Former PhD students: Branislav Kveton, PhD Fall 2006 ( thesis link), senior research scientist, Amazon Research, CA Tomas Singliar, PhD Fall 2008 ( thesis link), senior data scientist, Amazon Research, WA Richard Pelikan, PhD Spring 2011 ( thesis link), Bioinformatics Scientist, Oklahoma Medical Research Foundation Michal Valko, PhD Summer 2011 ( thesis link), research scientist, Deep Mind/INRIA France Iyad Batal, PhD October 2012 ( thesis link), Principal ML Engineer, Apple, Inc Saeed Amizadeh, PhD Fall 2013, Senior ML researcher, Microsoft Research, WA. Quang Nguyen , PhD Spring 2014, ( thesis link) Principal Machine Learning Engineer, Microsoft Inc Eric Heim , PhD Fall 2015, ( thesis link), research scientist, CMU Zitao Liu , PhD Summer 2016, ( thesis link), research scientist, TAL Education Group CharmGil Hong, PhD Fall 2017, ( thesis link), faculty, Handong University, South Korea Siqi Liu, PhD Summer 2020, research scientist, Borealis AI Yanbing Xue , PhD Summer 2020, staff data scientist, Walmart Inc. Zhipeng (Patrick) Luo, PhD Summer 2020. Jeongmin Lee , PhD Summer 2022, research scientist, Meta AI Sumedha Singla, PhD Summer 2022, research scientist, Meta AI Salim Malakouti, PhD Summer 2022 Former postdocs: Lei Wu, 2011-2012, currently Director of Data Science, Ultimate Software Inc Hamed Valizadegan, 2010-2013, currently at NASA Research, CA Iyad Batal, 2012-2013, currently at Microsoft, CA CharmGil Hong , 2017-2018, currently at Handong University Siqi Liu, Fall 2020, currently at Borealis AI Inc MS students: Yanbing Xue, MS, Fall 2014 David Krebs, MS, Fall 2011 Eric Heim, MS, Fall 2010 Adi Nemlekar, MSc, Summer 2007 Jose Nunez-Varela, MSc, Spring 2006 Aaron Cois, MSc, Spring 2006 Xinghua Lu, MSc, 2004 Elizabeth Clause, MSc Gregory Nilsen, MSc Last updated by milos on 07/06/22.",
  "content_length": 4719,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:12"
}