{
  "name": "Milos Prvulovic",
  "homepage": "http://www.cc.gatech.edu/~milos",
  "status": "success",
  "content": "Milos Prvulovic Milos Prvulovic Professor School of Computer Science, College of Computing Georgia Institute of Technology KACB 2332 266 Ferst Dr Atlanta, GA 30332-0280 Teaching Spring 2017: OMS CS 6290 - High Perfomance Computer Architecture Fall 2017: OMS CS 6290 - High Perfomance Computer Architecture Fall 2017: CS 4290/6290 - High Perfomance Computer Architecture (cross-listed as ECE 4100/6100) For classes from prior semesters, click here Research Interests Computer architecture and physical side channels. This includes beneficial uses of side channels, e.g. using side channels for program monitoring, profiling, detection of malware, detection of malicious hardware, etc. My interest in computer architecture also includes hardware support for secure execution, multi-core perfomance, including synchronization, transactional execution, etc. Publications Nader Sehatbakhsh, Baki Berkay Yilmaz, Alenka Zajic, and Milos Prvulovic, EMSim: A Microarchitecture-Level Simulation Tool for Modeling Electromagnetic Side-Channel Signals, IEEE International Symposium on High-Performance Computer Architecture (HPCA), February 2020. Nader Sehatbakhsh, Baki Berkay Yilmaz, Alenka Zajic, and Milos Prvulovic, A New Side-Channel Vulnerability on Modern Computers by Exploiting Electromagnetic Emanations from the Power Management Unit, IEEE International Symposium on High-Performance Computer Architecture (HPCA), February 2020. Haider A. Khan, Nader Sehatbakhsh, Luong N. Nguyen, Robert Callan, Arie Yeredor, Milos Prvulovic, and Alenka Zajic, IDEA: intrusion detection through electromagnetic-signal analysis for critical embedded and cyber-physical systems, to appear in IEEE Transactions on Dependable and Secure Computing. Baki Berkay Yilmaz, Milos Prvulovic, and Alenka Zajic, Electromagnetic Side Channel Information Leakage Created by Execution of Series of Instructions in a Computer Processor, IEEE Transactions on Information Forensics and Security (TIFS), Pages 776-789, Vol. 15, 2020 (IEEE Xplore). Haider A. Khan, Nader Sehathakhsh, Luong N. Nguyen, Milos Prvulovic, and Alenka Zajic, Malware detection in embedded systems using neural network model for electromagnetic side-channel signals, Journal of Hardware and Systems Security, December 2019. Baki Berkay Yilmaz, Milos Prvulovic, and Alenka Zajic, Communication Model and Capacity Limits of Covert Channels Created by Software Activities, IEEE Transactions on Information Forensics and Security (TIFS), available for Early Access in IEEExplore, November 2019 (IEEE Xplore). Nader Sehatbakhsh, Alireza Nazari, Monjur Alam, Frank Werner, Yuanda Zhu, Alenka Zajic, and Milos Prvulovic, REMOTE: Robust External Malware Detection Framework by Using Electromagnetic Signals, IEEE Transactions on Computers (TOC), available for Early Access in IEEExplore, October 2019 (IEEE Xplore). B. Yilmaz, E. Ugurlu, A. Zajic, and M. Prvulovic, Detecting Cellphone Camera Status at Distance by Exploiting Electromagnetic Emanations, IEEE Conference on Military Communications (MILCOM), November 2019. EMMA: Hardware/Software Attestation Framework for Embedded Systems Using Electromagnetic SignalsNader Sehatbakhsh, Alireza Nazari, Haider Khan, Alenka Zajic, Milos PrvulovicMICRO '52 Proceedings of the 52nd Annual IEEE/ACM International Symposium on Microarchitecture, 2019 B. Yilmaz, A. Zajic, and M. Prvulovic, Capacity of EM Side Channel Created by Instruction Executions in a Processor, IEEE IEMCON, October 2019. Sunjae Park, Christopher J Hughes, and Milos Prvulovic, Forgive-TM: Supporting Lazy Conflict Detection In Eager Hardware Transactional Memory, 28th International Conference on Parallel Architectures and Compilation Techniques (PACT), September 2019. N. Nguyen, C. Cheng, M. Prvulovic and A. Zajic, Creating a Backscattering Side Channel to Enable Detection of Dormant Hardware Trojans, IEEE Transactions on Very Large Scale Integration Systems (TVLSI), Vol. 27, No. 7, July 2019 (IEEE Xplore). M. Ruble, C. E. Hayes, M. Welborn, A. Zajic, M. Prvulovic and A. M. Pitruzzello, Hyperdimensional Bayesian Time Mapping (HyperBaT): A Probabilistic Approach to Time Series Mapping of Non-Identical Sequences, IEEE Transactions on Signal Processing, Pages 3719-3731, Vol. 67, No. 14, July 2019 (IEEE Xplore). Richard Rutledge, Sunjae Park, Haider Khan, Alessandro Orso, Milos Prvulovic, and Alenka Zajic, Zero-overhead path prediction with progressive symbolic execution, 41st ACM/IEEE International Conference on Software Engineering (ICSE), May 2019. Baki Yilmaz, Elvan Ugurlu, Alenka Zajic, and Milos Prvulovic, Instruction level program tracking using electromagnetic emanations, International Society for Optics and Photonics SPIE Cyber Sensing Security+Defense Conference, May 2019. Baki Yilmaz, Alenka Zajic, and Milos Prvulovic, Capacity of deliberate side-channels created by software activities, IEEE Conference on Military Communications (MILCOM), October 2018. Moumita Dey, Alireza Nazari, Alenka Zajic, and Milos Prvulovic, EMProf: Memory Profiling via EM-Emanation in IoT and Hand-Held Devices, 51st ACM/IEEE International Symposium on Microarchitecture (MICRO), October 2018. Transactional pre-abort handlers in hardware transactional memorySunjae Park, Christopher J. Hughes, Milos PrvulovicPACT '18 Proceedings of the 27th International Conference on Parallel Architectures and Compilation Techniques, 2018 M. Alam, H. A. Khan, M. Dey, N. Sinha, R. Callan, A. Zajic, and M. Prvulovic, One&Done: A Single-Decryption EM-Based Attack on OpenSSL’s Constant-Time Blinded RSA, 37th USENIX Security Symposium, August 2018.(Paper PDF and Presentation Slides) F. Werner, A. R. Djordjevic, D. I. Olcan, M. Prvulovic, and A. Zajic, Experimental validation of localization method for finding magnetic sources on IoT devices, Proceedings of the International Symposium on Electromagnetic Compatibility (EMC Europe), August 2018. Frank Werner, Derrick Chu, Antonije R. Djordjevic, Dragan I. Olcan, Milos Prvulovic, and Alenka Zajic, A Method for Efficient Localization of Magnetic-field Sources Excited by the Execution of Instructions in a Processor, IEEE Transactions on Electromagnetic Compatibility, Pages 613-622, Vol. 60, No. 3, June 2018 (IEEE Xplore). Nader Sehatbakhsh}, Alireza Nazari, Monjur Alam, Alenka Zajic, and Milos Prvulovic, Syndrome: Spectral Analysis for Anomaly Detection on Medical IoT and Embedded Devices, IEEE International Symposium on Hardware Oriented Security and Trust (HOST), May 2018. Haider Khan, Monjur Alam, Alenka Zajic, and Milos Prvulovic, Detailed tracking of program control flow using analog side-channel signals: A promise for IoT malware detection and a threat for many cryptographic implementations, International Society for Optics and Photonics SPIE Cyber Sensing Security+Defense Conference}, April 2018. C.-L. Cheng, L. N. Nguyen, M. Prvulovic, and A. Zajic, Exploiting Switching of Transistors in Digital Electronics for RFID Tag Design, IEEE International Conference on RFID, April 2018. Best paper award Baki Yilmaz, Alenka Zajic, and Milos Prvulovic, Modelling Jitter in Wireless Channel Created by Processor-Memory Activity, IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), April 2018. B. Yilmaz, R. Callan, M. Prvulovic, and A. Zajic, Capacity of the EM Covert/Side-Channel Created by the Execution of Instructions in a Processor, IEEE Transactions on Information Forensics and Security, Pages 605-620, Vol. 13, No. 3, March 2018 (IEEE Xplore). Baki Berkay Yilmaz, Robert Callan, Milos Prvulovic, and Alenka Zajic, Quantifying Information Leakage in a Processor Caused by the Execution of Instructions, IEEE Conference on Military Communications (MILCOM), October 2017. EDDIE: EM-Based Detection of Deviations in Program ExecutionAlireza Nazari, Nader Sehatbakhsh, Monjur Alam, Alenka Zajic, Milos PrvulovicISCA '17 Proceedings of the 44th Annual International Symposium on Computer Architecture, 2017 A. Zajic, M. Prvulovic, and D. Chu, Path Loss Prediction for Electromagnetic Side-Channel Signals, Proceedings of the 10th European Conference on Antennas and Propagation (EuCAP), April 2017.(PDF) M. Prvulovic, A. Zajic, R. L. Callan, and C. J. Wang, A Method for Finding Frequency-Modulated and Amplitude-Modulated Electromagnetic Emanations in Computer Systems, IEEE Transactions on Electromagnetic Compatibility (TEMC), Pages 34-42, Vol. 59, No. 1, February 2017. (IEEE Xplore, PDF) N. Sehatbakshsh, R. Callan, M. Alam, M. Prvulovic, and A. Zajic, Leveraging Electromagnetic Emanations for IoT Security, Hardware Demo at IEEE International Symposium on Hardware Oriented Security and Trust (HOST), May 1-5, 2017. Won 2nd place in HOST Hardware Demo Competition. (PDF) N. Sehatbakhsh, A. Nazari, A. Zajic, and M. Prvulovic, Spectral Profiling: Observer-Effect-Free Profiling by Monitoring EM Emanations, Proceedings of the 49th ACM/IEEE International Symposium on Microarchitecure (MICRO), October 2016. Best paper award. (IEEE Xplore, PDF) Zero-overhead profiling via EM emanationsRobert Callan, Farnaz Behrang, Alenka Zajic, Milos Prvulovic, Alessandro OrsoISSTA 2016 Proceedings of the 25th International Symposium on Software Testing and Analysis, 2016 C. Wang, R. Callan , A. Zajic, and M. Prvulovic, An Algorithm for Finding Carriers of Amplitudemodulated Electromagnetic Emanations in Computer Systems, Proceedings of the 10th European Conference on Antennas and Propagation (EuCAP), April 2016. (IEEE Xplore) S. Park , M. Prvulovic, and C. Hughes, PleaseTM: Enabling Transaction Conflict Management in Requester-wins Hardware Transaction Memory, Proceedings of the IEEE International Symposium on High-Performance Computer Architecture (HPCA), Pages 285-296, March 2016. (IEEE Xplore) R. Callan, N. Popovic, A. Daruna, E. Pollmann, A. Zajic, and M. Prvulovic, Comparison of Electromagnetic Side-Channel Energy Available to the Attacker from Different Computer Systems, Proceedings of the IEEE Symposium on Electromagnetic Compatibili",
  "content_length": 22774,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:05"
}