{
  "name": "Milos Gligoric",
  "homepage": "https://users.ece.utexas.edu/~gligoric",
  "status": "success",
  "content": "Milos Gligoric Milos Gligoric The University of Texas at Austin Electrical and Computer Engineering 2501 Speedway Austin, TX 78712, USA Phone: +1-512-232-1501 E-mail: gligoric@utexas.edu Publications Students Software Service Teaching CV DBLP Scholar GitHub About me I am an Associate Professor in the Department of Electrical and Computer Engineering at The University of Texas at Austin. My main research interests are in software engineering with focus on improving software quality and developers' productivity. I have been working on software testing (test generation and regression testing), proof engineering, systems-supported software engineering, and software engineering for scientific computing. My research has been supported by Army Futures Command, Cisco, DOE, Google, Huawei, NSF, Runtime Verification, and Samsung. I obtained my Ph.D. from the University of Illinois at Urbana-Champaign in 2015, advised by Darko Marinov. I finished my M.Sc. in Software Engineering at the School of Electrical Engineering, University of Belgrade, Serbia, where I previously received my B.Sc. in Computer Science and Engineering. I am a part-time contractor at dbt Labs (2025). Prior to that, I was a Visiting Researcher at SDF (2024; SDF was acquired by dbt at the beginning of 2025) working on data transformation and SQL. Earlier, I spent over two years (2021-2023) as a TechLead at Katana Graph working on graph databases. I am always looking for PhD students with background in software engineering, systems, and/or programming languages. Publications updated 04/2025 Aditya Thimmaiah, Zijian Yi, Joseph Kenis, Christopher J. Rossbach, and Milos Gligoric In-memory Object Graph Stores European Conference on Object-Oriented Programming (ECOOP 2025), pages 30:1-30:30, Bergen, Norway, July 2025. [bibtex] Nader Al Awar, Hannan Naeem, James Almgren-Bell, George Biros, and Milos Gligoric Dynamically Fusing Python HPC Kernels International Symposium on Software Testing and Analysis (ISSTA 2025), pages 1865-1886, Trondheim, Norway, June 2025. [bibtex]  [abstract] Linghan Zhong, Samuel Yuan, Jiyang Zhang, Yu Liu, Pengyu Nie, Junyi Jessy Li, and Milos Gligoric A Tool for Generating Exceptional Behavior Tests With Large Language Models Symposium on the Foundations of Software Engineering, formal tool demonstrations (FSE Demo 2025), pages 1193-1197, Trondheim, Norway, June 2025. [bibtex]  [abstract]  [web] William Ruys, Hochan Lee, Bozhi You, Shreya Talati, Jaeyoung Park, James Almgren-Bell, Yineng Yan, Milinda Fernando, Mattan Erez, Milos Gligoric, Burtscher Martin, Christopher J. Rossbach, Pingali Keshav, and George Biros Performance Characterization of Python Runtimes for Multi-Device Task Parallel Programming International Journal of Parallel Programming (IJPP 2025), March 2025. [bibtex] Nader Al Awar, Zijian Yi, George Biros, and Milos Gligoric Speeding up the Local C++ Development Cycle with Header Substitution International Symposium on Code Generation and Optimization (CGO 2025), pages 704-717, Las Vegas, USA, March 2025. [bibtex]  [abstract]  [web] Jiyang Zhang, Yu Liu, Pengyu Nie, Junyi Jessy Li, and Milos Gligoric exLong: Generating Exceptional Behavior Tests with Large Language Models International Conference on Software Engineering (ICSE 2025), pages 1462-1474, Ontario, Canada, May 2025. [bibtex]  [abstract]  [web] Abdelrahman Baz, Milos Gligoric, and August Shi Impact of JVM Configurations on Test Runtime International Conference on Software Maintenance and Evolution (ICSME 2024), pages 249-261, Flagstaff, USA, October 2024. [bibtex]  [abstract] Zhiqiang Zang, Fu-Yao Yu, Aditya Thimmaiah, August Shi, and Milos Gligoric Java JIT Testing with Template Extraction Symposium on the Foundations of Software Engineering (FSE 2024), pages 1129-1151, Porto de Galinhas, Brazil, July 2024. [bibtex]  [abstract] Yu Liu, Aditya Thimmaiah, Owolabi Legunsen, and Milos Gligoric ExLi: An Inline-Test Generation Tool for Java Symposium on the Foundations of Software Engineering, formal tool demonstrations (FSE Demo 2024), pages 652-656, Porto de Galinhas, Brazil, July 2024. [bibtex]  [abstract]  [web] William Ruys, Hochan Lee, Bozhi You, Shreya Talati, Jaeyoung Park, James Almgren-Bell, Yineng Yan, Milinda Fernando, George Biros, Mattan Erez, Burtscher Martin, Christopher J. Rossbach, Pingali Keshav, and Milos Gligoric A Deep Dive into Task-Based Parallelism in Python International Parallel and Distributed Processing Symposium, Workshop (IPDPS Workshop 2024), pages 1147-1149, San Francisco, USA, May 2024. [bibtex] Aditya Thimmaiah, Leonidas Lampropoulos, Christopher J. Rossbach, and Milos Gligoric Object Graph Programming International Conference on Software Engineering (ICSE 2024), pages 1-13, Lisbon, Portugal, April 2024. [bibtex]  [abstract]  [web] Zhiqiang Zang, Aditya Thimmaiah, and Milos Gligoric JOG: Java JIT Peephole Optimizations and Tests from Patterns International Conference on Software Engineering, Tool Demonstrations Track (ICSE Demo 2024), pages 11-15, Lisbon, Portugal, April 2024. [bibtex]  [abstract]  [web] Jiyang Zhang, Pengyu Nie, Junyi Jessy Li, and Milos Gligoric Multilingual Code Co-evolution using Large Language Models Symposium on the Foundations of Software Engineering (FSE 2023), pages 695-707, San Francisco, USA, December 2023. [bibtex]  [abstract]  [web] Yu Liu, Pengyu Nie, Anna Guo, Milos Gligoric, and Owolabi Legunsen Extracting Inline Tests from Unit Tests International Symposium on Software Testing and Analysis (ISSTA 2023), pages 1458-1470, Seattle, USA, July 2023. [bibtex]  [abstract]  [web] Zhiqiang Zang, Aditya Thimmaiah, and Milos Gligoric Pattern-based Peephole Optimizations with Java JIT Tests International Symposium on Software Testing and Analysis (ISSTA 2023), pages 64-75, Seattle, USA, July 2023. [bibtex]  [abstract]  [web] Yu Liu, Jiyang Zhang, Pengyu Nie, Milos Gligoric, and Owolabi Legunsen More Precise Regression Test Selection via Reasoning about Semantics-Modifying Changes International Symposium on Software Testing and Analysis (ISSTA 2023), pages 664-676, Seattle, USA, July 2023. (This paper won an ACM SIGSOFT Distinguished Paper Award.) [bibtex]  [abstract]  [web] Pengyu Nie, Rahul Banerjee, Junyi Jessy Li, Raymond J. Mooney, and Milos Gligoric Learning Deep Semantics for Test Completion International Conference on Software Engineering (ICSE 2023), pages 2111-2123, Melbourne, Australia, May 2023. [bibtex]  [abstract]  [web] Zhiqiang Zang, Fu-Yao Yu, Nathaniel Wiatrek, Milos Gligoric, and August Shi JAttack: Java JIT Testing using Template Programs International Conference on Software Engineering, Tool Demonstrations Track (ICSE Demo 2023), pages 6-10, Melbourne, Australia, May 2023. [bibtex]  [abstract]  [web] Yu Liu, Zachary Thurston, Alan Han, Pengyu Nie, Milos Gligoric, and Owolabi Legunsen pytest-inline: An Inline Testing Tool for Python International Conference on Software Engineering, Tool Demonstrations Track (ICSE Demo 2023), pages 161-164, Melbourne, Australia, May 2023. [bibtex]  [abstract]  [web] Sheena Panthaplackel, Junyi Jessy Li, Milos Gligoric, and Raymond J. Mooney Using Developer Discussions to Guide Fixing Bugs in Software Findings of the Conference on Empirical Methods in Natural Language Processing (Findings of EMNLP 2022), pages 2292-2301, Abu Dhabi, United Arab Emirates, December 2022. [bibtex]  [abstract]  [web] James Almgren-Bell, Nader Al Awar, Dilip Geethakrishnan, Milos Gligoric, and George Biros A Multi-GPU Python Solver for Low-Temperature Non-Equilibrium Plasmas International Symposium on Computer Architecture and High Performance Computing (SBACPAD 2022), pages 140-149, Bordeaux, France, November 2022. [bibtex]  [abstract] Lee Hochan, Ruys William, Yan Yineng, Stephens Sean, You Bozhi, Fingler Henrique, Henriksen Ian, Peters Arthur, Burtscher Martin, Milos Gligoric, Schulz Karl, Pingali Keshav, Christopher J. Rossbach, Mattan Erez, and George Biros A Python Orchestration System for Heterogeneous Architectures The International Conference for High Performance Computing, Networking, Storage, and Analysis (SC 2022), pages 51:1-51:15, Dallas, USA, November 2022. [bibtex]  [abstract]  [web] Yu Liu, Pengyu Nie, Owolabi Legunsen, and Milos Gligoric Inline Tests International Conference on Automated Software Engineering (ASE 2022), pages 57:1-57:13, Oakland Center, USA, October 2022. [bibtex]  [abstract]  [web] Zhiqiang Zang, Nathaniel Wiatrek, Milos Gligoric, and August Shi Compiler Testing using Template Java Programs International Conference on Automated Software Engineering (ASE 2022), pages 23:1-23:13, Oakland Center, USA, October 2022. (This paper won an ACM SIGSOFT Distinguished Paper Award.) [bibtex]  [abstract]  [web] Jiyang Zhang, Pengyu Nie, Sheena Panthaplackel, Junyi Jessy Li, and Milos Gligoric CoditT5: Pretraining for Source Code and Natural Language Editing International Conference on Automated Software Engineering (ASE 2022), pages 22:1-22:12, Oakland Center, USA, October 2022. [bibtex]  [abstract] Jiyang Zhang, Ristin Marko, Schanely Phillip, Wernher van de Venn Hans, and Milos Gligoric Python-by-Contract Dataset Symposium on the Foundations of Software Engineering, formal tool demonstrations (FSE Demo 2022), pages 1652-1656, Singapore, November 2022. [bibtex]  [abstract] Pengyu Nie, Jiyang Zhang, Raymond J. Mooney, Junyi Jessy Li, and Milos Gligoric Impact of Evaluation Methodologies on Code Summarization Association for Computational Linguistics (ACL 2022), pages 4936-4960, Virtual, May 2022. [bibtex]  [abstract] Sheena Panthaplackel, Junyi Jessy Li, Milos Gligoric, and Raymond J. Mooney Learning to Describe Solutions for Bug Reports Based on Developer Discussions Findings of the Association for Computational Linguistics (Findings of ACL 2022), pages 2935-2952, Virtual, May 2022. [bibtex]  [abstract]  [web] Jiyang Zhang, Yu Liu, Milos Gligoric, Owolabi Legunsen, and August Shi Comparing and Combining Analysis-Based and Learning-Based Regression Test Selecti",
  "content_length": 33185,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:02"
}