{
  "name": "Milos Nikolic 0001",
  "homepage": "http://homepages.inf.ed.ac.uk/mnikolic",
  "status": "success",
  "content": "Milos Nikolic MILOS NIKOLIC Associate Professor (Reader) School of Informatics, University of Edinburgh milos.nikolic@ed.ac.uk My research interest is in databases and large-scale data management systems. My recent work studies in-database learning, stream processing, incremental computation, and query compilation. I am a member of the Database Group and the Laboratory for Foundations of Computer Science. I am looking for a PhD student to work on topics related to data management. Feel free to contact me for more information. bio | Google Scholar PROJECTS Adaptive Query Processing based on Degree Information investigating trade-offs in static and dynamic evaluation of queries Incremental Maintenance of Complex Data Analytics maintaining a wide range of analytics using novel factorisation techniques Declarative Data Pipelines (industry supported) expressing complex data workflows in a clean and declarative way TEACHING Instructor Advanced Database Systems (Edinburgh, Spring 2025, 2024, 2023, 2022, 2021, w/ Andreas Pieris) Advanced Databases (Edinburgh, Spring 2020, 2019) Databases (Oxford, Michaelmas 2017, w/ Tim Furche) Object Oriented Programming (Oxford, Michaelmas 2016, w/ Joe Pitt-Francis) Teaching Assistant Database Systems Implementation (Oxford, Hilary 2018, 2017) Concurrent Programming (Oxford, Hilary 2018) Compilers (Oxford, Hilary 2017) PUBLICATIONS Conjunctive Queries with Free Access Patterns under Updates, Ahmet Kara, Milos Nikolic, Dan Olteanu, Haozhe Zhang. Logical Methods in Computer Science (LMCS) 2025. Abstract Bibtex We study the problem of answering conjunctive queries with free access patterns (CQAPs) under updates. A free access pattern is a partition of the free variables of the query into input and output. The query returns tuples over the output variables given a tuple of values over the input variables. We introduce a fully dynamic evaluation approach that works for all CQAPs and is optimal for two classes of CQAPs. This approach recovers prior work on the dynamic evaluation of conjunctive queries without access patterns. We first give a syntactic characterisation of all CQAPs that admit constant time per single-tuple update and whose output tuples can be enumerated with constant delay given a tuple of values over the input variables. We further chart the complexity trade-off between the preprocessing time, update time and enumeration delay for a class of CQAPs. For some of these CQAPs, our approach achieves optimal, albeit non-constant, update time and delay. This optimality is predicated on the Online Matrix-Vector Multiplication conjecture. We finally adapt our approach to the dynamic evaluation of tractable CQAPs over probabilistic databases under updates. @article{kara2025lmcs, title={{Conjunctive Queries with Free Access Patterns under Updates}}, author={Kara, Ahmet and Nikolic, Milos and Olteanu, Dan and Zhang, Haozhe}, journal = {{Logical Methods in Computer Science}}, volume={21}, number={2}, pages={1--50}, year={2025}, } Tractable Conjunctive Queries over Static and Dynamic Relations, Ahmet Kara, Zheng Luo, Milos Nikolic, Dan Olteanu, Haozhe Zhang. ICDT 2025. Abstract Bibtex We investigate the evaluation of conjunctive queries over static and dynamic relations. While static relations are given as input and do not change, dynamic relations are subject to inserts and deletes. We characterise syntactically three classes of queries that admit constant update time and constant enumeration delay. We call such queries tractable. Depending on the class, the preprocessing time is linear, polynomial, or exponential (under data complexity, so the query size is constant). To decide whether a query is tractable, it does not suffice to analyse separately the sub-queries over the static relations and over the dynamic relations, respectively. Instead, we need to take the interaction between the static and the dynamic relations into account. Even when the sub-query over the dynamic relations is not tractable, the overall query can become tractable if the dynamic relations are sufficiently constrained by the static ones. @inproceedings{kara2025statdyn, title={{Tractable Conjunctive Queries over Static and Dynamic Relations}}, author={Ahmet Kara and Zheng Luo and Milos Nikolic and Dan Olteanu and Haozhe Zhang}, booktitle = {28th International Conference on Database Theory (ICDT 2025)}, year={2025}, pages = {12:1--12:21}, publisher = {Schloss Dagstuhl -- Leibniz-Zentrum f{\\\"u}r Informatik} } In-Database Data Imputation, Massimo Perini, Milos Nikolic. SIGMOD 2024. Abstract Bibtex Missing data is a widespread problem in many domains, creating challenges in data analysis and decision making. Traditional techniques for dealing with missing data, such as excluding incomplete records or imputing simple estimates (e.g., mean), are computationally efficient but may introduce bias and disrupt variable relationships, leading to inaccurate analyses. Model-based imputation techniques offer a more robust solution that preserves the variability and relationships in the data, but they demand significantly more computation time, limiting their applicability to small datasets. This work enables efficient, high-quality, and scalable data imputation within a database system using the widely used MICE method. We adapt this method to exploit computation sharing and a ring abstraction for faster model training. To impute both continuous and categorical values, we develop techniques for in-database learning of stochastic linear regression and Gaussian discriminant analysis models. Our MICE implementations in PostgreSQL and DuckDB outperform alternative MICE implementations and model-based imputation techniques by up to two orders of magnitude in terms of computation time, while maintaining high imputation quality. @article{perini2024pacmmod, title={{In-Database Data Imputation}}, author={Perini, Massimo and Nikolic, Milos}, journal={Proc. ACM Manag. Data (PACMMOD)}, volume={2}, doi={10.1145/3639326}, year={2024}, publisher={Association for Computing Machinery}, } F-IVM: Analytics over Relational Databases under Updates, Ahmet Kara, Milos Nikolic, Dan Olteanu, Haozhe Zhang. The VLDB Journal, 2023. Abstract Bibtex This article describes F-IVM, a unified approach for maintaining analytics over changing relational data. We exemplify its versatility in four disciplines: processing queries with group-by aggregates and joins; learning linear regression models using the covariance matrix of the input features; building Chow-Liu trees using pairwise mutual information of the input features; and matrix chain multiplication. F-IVM has three main ingredients: higher-order incremental view maintenance; factorized computation; and ring abstraction. F-IVM reduces the maintenance of a task to that of a hierarchy of simple views. Such views are functions mapping keys, which are tuples of input values, to payloads, which are elements from a ring. F-IVM also supports efficient factorized computation over keys, payloads, and updates. Finally, F-IVM treats uniformly seemingly disparate tasks. In the key space, all tasks require joins and variable marginalization. In the payload space, tasks differ in the definition of the sum and product ring operations. We implemented F-IVM on top of DBToaster and show that it can outperform classical first-order and fully recursive higher-order incremental view maintenance by orders of magnitude while using less memory. @article{kara2023vldbj, title={{F-IVM: Analytics over Relational Databases under Updates}}, author={Kara, Ahmet and Nikolic, Milos and Olteanu, Dan and Zhang, Haozhe}, journal={The VLDB Journal}, doi={10.1007/s00778-023-00817-w}, year={2023}, } Trade-offs in Static and Dynamic Evaluation of Hierarchical Queries, Ahmet Kara, Milos Nikolic, Dan Olteanu, Haozhe Zhang. Logical Methods in Computer Science (LMCS) 2023. Abstract Bibtex We investigate trade-offs in static and dynamic evaluation of hierarchical queries with arbitrary free variables. In the static setting, the trade-off is between the time to partially compute the query result and the delay needed to enumerate its tuples. In the dynamic setting, we additionally consider the time needed to update the query result under single-tuple inserts or deletes to the database. Our approach observes the degree of values in the database and uses different computation and maintenance strategies for high-degree (heavy) and low-degree (light) values. For the latter it partially computes the result, while for the former it computes enough information to allow for on-the-fly enumeration. We define the preprocessing time, the update time, and the enumeration delay as functions of the light/heavy threshold. By appropriately choosing this threshold, our approach recovers a number of prior results when restricted to hierarchical queries. We show that for a restricted class of hierarchical queries, our approach achieves worst-case optimal update time and enumeration delay conditioned on the Online Matrix-Vector Multiplication Conjecture. @article{kara2023lmcs, title={{Trade-offs in Static and Dynamic Evaluation of Hierarchical Queries}}, author={Kara, Ahmet and Nikolic, Milos and Olteanu, Dan and Zhang, Haozhe}, journal = {{Logical Methods in Computer Science}}, volume={19}, number={3}, pages={1--50}, year={2023}, } Conjunctive Queries with Free Access Patterns under Updates, Ahmet Kara, Milos Nikolic, Dan Olteanu, Haozhe Zhang. ICDT 2023. Abstract Bibtex We study the problem of answering conjunctive queries with free access patterns under updates. A free access pattern is a partition of the free variables of the query into input and output. The query returns tuples over the output variables given a tuple of values over the input variables. We introduce a fully dynamic evaluation approach for such queries. We also give a syntactic characterisation of those queries that admit constant time per single-tuple update and whose output tuples can be enumerat",
  "content_length": 25359,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:04"
}