{
  "name": "Milos D. Krstic",
  "homepage": "https://www.uni-potsdam.de/de/dtm/mitarbeiter/prof-dr-milos-krstic",
  "status": "success",
  "content": "Prof. Dr. Miloš Krstić - Mitarbeiter - Design- und Testmethodik - Universität Potsdam JavaScript ist in ihrem Browser deaktiviert. Bitte aktivieren Sie JavaScript um alle Funktionen der Website nutzen zu können! Zum Hauptinhalt springenDie Fakultät Übersicht Institute und Transferprofessur Dekanat Regelungen der Fakultät Gremien Beauftragte / Vertrauenspersonen Fachschaften Gleichstellung Kooperierende Einrichtungen Leibniz-Kolleg Potsdam Historisches zur Fakultät Studium und Lehre Übersicht Bachelor Master Lehramt Studienbeginn MINTernational Beratung und Formulare Qualitätsmanagement E-Learning-Koordination Forschung Übersicht Forschungsschwerpunkte Forschungsinitiativen Graduiertenprogramme Geräteliste Promotion und Habilitation Good Scientific Practice Panel CoARA Internationales Übersicht Internationalisierung Service und Kontakt Projekte International Aktuelles Übersicht Veranstaltungen Disputationstermine Habilitationstermine Preise Kinder / Schüler Berufungsverfahren Uni-Startseite Intranet Notfall Uni A-Z Gebärdensprache Leichte Sprache Sitemap Schliessen Schliessen DeutschEnglishProf. Dr. Miloš KrstićProf. Dr. Miloš KrstićSchliessenStudiumStudieren an der UPStudienangebotBewerbung und ImmatrikulationStudium konkretBeratungs- und ServiceeinrichtungenTermine und FristenForschungForschen an der UPProfile, Programme und ProjekteForschungsförderungOpen ScienceForschungsdatenKooperationen und PartnerschaftenWissenschaftlicher NachwuchsUniversitätUP entdeckenOrganisationWirtschaft, Transfer und GesellschaftCampus InternationalFörderinstrumenteArbeiten an der UPOnline-DiensteAccount.UPBI.UPMail.UP (Webmailbox)PULSMoodleUniversitätsbibliothekEvaluationsportal (PEP)PraxisportalZIM – Zentrum für IT und MedienSchliessenProf. Dr.-Ing. Miloš KrstićKontactTelefon:+49 331 9 77 31 81 / +49 335 56 25 - 7 29Fax:+49 331 9 77 30 42E-Mail:krsticuihp-microelectronicspcomAdresse: Universität Potsdam Institut für Informatik und Computational Science An der Bahn 2 14476 Potsdam Öffnungszeiten: Sprechzeiten nach Vereinbarung Prof. Dr.-Ing. Miloš KrstićCurriculum VitæMiloš Krstić ist Professor für Design- und Testmethodik an der Universität Potsdam.  Seit 2001 arbeitet er am IHP, Frankfurt (Oder), wo er gegenwärtig Teamleiter der Forschunggruppe Design- und Testmethodik ist.  Im Jahr 2006 promovierte Prof. Krstić an der Brandenburgischen Technischen Universität Cottbus & Senftenberg (BTU) im Bereich des Entwurfs global-asynchroner lokal-synchroner (GALS) Schaltungssystems.  Er leitete diverse europäische und nationale R&D Projekte und ist Author von mehr als 100 Publikationen sowie von 8 Patenteinreichungen.  Seine Interessen umfassen Design- und Test integrierter Schaltungen, Entwurf und Test asynchroner und GALS Schaltungen, fehlertolrantes Design, Design-for-Testability, Low-Power Design, sowie eingebettete Systeme.Prof. Dr.-Ing. Miloš KrstićKontactTelefon:+49 331 9 77 31 81 / +49 335 56 25 - 7 29Fax:+49 331 9 77 30 42E-Mail:krsticuihp-microelectronicspcomAdresse: Universität Potsdam Institut für Informatik und Computational Science An der Bahn 2 14476 Potsdam Öffnungszeiten: Sprechzeiten nach Vereinbarung BücherA. Veronesi, D. Bertozzi, and M. Krstic, Assessing the Configuration Space of the Open Source NVDLA Deep Learning Accelerator on a Mainstream MPSoC Platform, accepted book chapter, Editors: A. Calimera, P.-E. Gaillardon, K. Korgaonkar, S. Kvatinsky, and R. Reis, SpringerZ. Stamenković and M. Krstić, Semi-Custom Implementation of Digital Circuits. Book chapter, Silicon Systems for Wireless LAN. Vol. 22, World Scientific, 2020.Beiträge in Journalen und MagazinenR. T. Syed, Y. Zhao, J. Chen, M. Andjelkovic, M. Ulbricht, M. Krstic, FPGA Implementation of a Fault-Tolerant Fused and Branched CNN Accelerator with Reconfigurable Capabilities, IEEE Access, impact factor: 3.9 (by Clarivate Analytics), DOI: 10.1109/ACCESS.2024.3392240 , 2024.D. Reiser, J. Chen, J. Knödtel, A. Baroni, M. Krstic, M. Reichenbach, Design and Analysis of an Adaptive Radiation Resilient RRAM Subsystem for Processing Systems in Satellites, Design Automation for Embedded Systems (Springer), , impact factor: 1.4, 2024. https://doi.org/10.1007/s10617-024-09285-zT. Song, Z. Huang, L. Zhang, Q. Hong, Z. Yang and M. Krstic, Test Cost Reduction for VLSI Adaptive Test with K-Nearest Neighbor Classification Algorithm, IEEE Transactions on Circuits and Systems--II: Express Briefs Print ISSN: 1549-7747 Online ISSN: 1558-3791, impact factor: 3.292 (by Clarivate Analytics), Digital Object Identifier: 10.1109/TCSII.2024.3362957, early access, 2024.L. Lu, J. Chen, M. Ulbricht, M. Krstic, Machine learning methodologies to predict the results of simulation-based fault injection, IEEE Transactions on Circuits and Systems I: Regular Papers, doi: 10.1109/TCSI.2024.3349928, impact factor: 3.318 (by Clarivate Analytics), Vol. 71, Iss. 5, pps: 1978-1991, 2024.L. Lu, J. Chen, M. Ulbricht, M. Krstic, Towards Critical Flip-Flop Identification for Soft-Error Tolerance with Graph Neural Networks, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD) , Apr 2024, Vol. 43, Iss. 4, pp: 1135-1148, Digital Object Identifier: 10.1109/TCAD.2023.3331968. impact factor: 2.9 (by Clarivate Analytics), 2024M. Andjelkovic, M. Krstic, Characterization and Modelling of Single Event Transient Propagation through Standard Combinational Cells, Microelectronics Reliability, impact factor: 1.535 (by Clarivate Analytics), 2023, https://doi.org/10.1016/j.microrel.2023.115080 .M. Ulbricht, J. Chen, L. Lu, M. Krstic, The TETRISC SoC - A resilient Quad-Core System based on the ResiliCell approach, Microelectronics Reliability, , impact factor: 1.535 (by Clarivate Analytics), https://doi.org/10.1016/j.microrel.2023.115173 Vol. 148. 2023.Z. Xiong, D. Stober, M. Krstic, O. Korup, M. Arongo Carmona, H. Li, M. Werner,  Integrating AI Hardware in Academic Teaching: Experiences and Scope from Brandenburg and Bavaria, ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences, impact factor: 1.34, Pages 75-81, Copernicus Publications, 2023.T. Song, Z. Huang, H. Qi, L. Zhang, M .Krstic, Cost-Effective Path Delay Defect Testing Using Voltage/Temperature Analysis Based on Pattern Permutation, Journal of Electronic Testing (JETTA), Springer, impact factor: 0.979,https://doi.org/10.1007/s10836-023-06057-8, 2023.E. Perez-Bosch Quesada, M. K. Mahadevaiah, T. Rizzi, J. Wen, M. Ulbricht, M. Krstic, C. Wenger and E. Perez, Experimental assessment of multilevel RRAM-based vector-matrix multiplication operations for in-memory computing, IEEE Transactions on Electron Devices, impact factor: 2.917 (by Clarivate Analytics), DOI: 10.1109/TED.2023.3244509, Volume: 70, Issue: 4, 2023.R.T. Syed, M. Andjelkovic, M. Ulbricht, M. Krstic, Towards Reconfigurable CNN Accelerator for FPGA Implementation, IEEE Transactions on Circuits and Systems II: Express Briefs, impact factor: 3.292 (by Clarivate Analytics), 2023, DOI: 10.1109/TCSII.2023.3241154, Vol. 70, Iss. 3, pp: 1249-1253, 2023.Y. Zhao, V. Sark, M. Krstic, E. Grass, Low Complexity RADAR Gesture Recognition using Synthetic Training Data, Sensors, MDPI, impact factor 3.847, Sensors 2023, 23(1), 308; https://doi.org/10.3390/s23010308 .M. Andjelkovic, M. Marjanovic, B. Drasko, C. Calligaro, O. Schrape, U. Gatti, F. Kuentzer, S. Ilic, G. Ristic, M. Krstic, Analysis of Single Event Transient Effects in Standard Delay Cells Based on Decoupling Capacitors, Journal of Circuits, Systems, and Computers (JSSC), impact factor 1.363, https://doi.org/10.1142/S0218126622400072, Volume: 31, Number: 18 (December 2022).M. Andjelkovic, M. Marjanovic, J. Chen, G. Ristic, M. Krstic, PS-BBICS: Pulse Stretching Bulk Built-in Current Sensor for On-Chip Measurement of Single Event Transients, Microelectronics Reliability, Volume 138, 114726, https://doi.org/10.1016/j.microrel.2022.114726, impact factor: 1.535 (by Clarivate Analytics), 2022.A. Breitenreiter, M. Andjelkovic, O. Schrape, M. Krstic, Fast Error Propagation Probability Estimates by Answer Set Programming and Approximate Model Counting, IEEE Access, impact factor: 3.9 (by Clarivate Analytics), 10.1109/ACCESS.2022.3174564, vol. 10, pp. 51814-51825, 2022.M. Andjelkovic, A. Simevski, J. Chen, O. Schrape, Z. Stamenkovic, M. Krstic, S. Ilic, G. Ristic, A. Jaksic, N. Vasovic, R. Duane, A. J. Palma, A. M. Lallena, M. A. Carvajal, A Design Concept for Radiation Hardened RADFET Readout System for Space Applications, Microprocessors and Microsystems, Elsevier, impact factor: 1.5 (by Clarivate Analytics), https://doi.org/10.1016/j.micpro.2022.104486, 2022.G. Ristic, S. Ilic, M. Andjelkovic. R. Duane, A. Palma. A. Lalena, M. Krstic, A. Jaksic, Sensitivity and fading of irradiated RADFETs with different gate voltages, Nuclear Instruments and Methods in Physics Research Section A, Elsevier, impact factor: 1.455 (by Clarivate Analytics), Volume 1029, 2022, 166473, https://doi.org/10.1016/j.nima.2022.166473.J. Chen, T. Lange, M. Andjelkovic, A. Simevski, L. Li and M. Krstic, Solar Particle Event and Single Event Upset Prediction from SRAM-based Monitor and Supervised Machine Learning, IEEE Transactions on Emerging Topics in Computing, Print ISSN: 2168-6750 Online ISSN: 2168-6750 Digital Object Identifier: 10.1109/TETC.2022.3147376, , impact factor: 7.7 (by Clarivate Analytics), Vol. 10, Iss. 2, pp. 564-580, 2022.O. Schrape, M. Andjelkovic, A. Breitenreiter, S. Zeidler, A. Balashov, M. Krstic, Design and Evaluation of Radiation-Hardened Standard Cell Flip-Flops, IEEE Transactions on Circuits and Systems I: Regular Papers, vol. 68, no. 11, pp. 4796-4809, Nov. 2021, doi: 10.1109/TCSI.2021.3109080, impact factor: 3.318 (by Clarivate Analytics).G. Ristic, S. Ilic, R. Duane, M. Andjelkovic, A. Palma, A. Lalena, M. Krstic, S. Stankovic, A. Jaksic, Radiation sensitive MOSFETs irradiated with various positive gate biases, Journal of Radiation Research and Applied Sciences (TRRA), doi: 10.1080/16878507.2021.1970921",
  "content_length": 38277,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:02"
}