{
  "name": "Milos D. Ercegovac",
  "homepage": "http://www.cs.ucla.edu/~milos",
  "status": "success",
  "content": "mypage MiloÅ¡ D. Ercegovac Distinguished Professor Emeritus Computer Science Department UCLA Samueli School of Engineering University of California, Los Angeles 282 Engineering VI 310-869-4536 (mobile) milos@cs.ucla.edu Research areas: Courses: Computer arithmetic Digital design Arithmetic for Machine Learning Architectures RESEARCH LAB CS M51A Introduction to Digital Systems (Fall 2019) CS252A Arithmetic Processors and Algorithms (Winter 2020) CS259 Arithmetic in the Design of Neural Networks (Spring 2019) Short biography: Professor Ercegovac earned his PhD ('75) and MS ('72) in computer science from the University of Illinois, Urbana-Champaign, and BS in electrical engineering ('65) from the University of Belgrade, Serbia. He retired in 2020 after 45 years on the faculty at UCLA. He has specialized in research and teaching in digital arithmetic, digital design, and computer system architecture. His continuing research is in the areas of left-to-right and online arithmetic algorithms, approximate arithmetic, composite algorithms,  design for low, power and arithmetic in application-specific architectures. His research contributions have been extensively published in journals and conference proceedings. He is a coauthor of two textbooks on digital design and of a monograph and a book in the area of digital arithmetic. Dr. Ercegovac has been involved in organizing the IEEE Symposia on Computer Arithmetic since 1978. He served as an associate editor of the IEEE Transactions on Computers and as a subject area editor for the Journal of Parallel and Distributed Computing. He received a Medal of Ecole Normale Superieure de Lyon, France, in 2015, a Distinguished Alumni Educator Award in 2013 from the Department of Computer Science, University of Illinois Urbana-Champaign, and Lockheed-Martin Corporation Excellence in Teaching Award in 2009. Dr. Ercegovac is a foreign member of the Serbian Academy of Sciences and Arts, Fellow of the IEEE, and a member of the ACM. Curriculum Vitae [CV.pdf] Recent Publications D. M. Harris, J. E. Stine, M. D. Ercegovac, A. Nannarelli, K. Parry, C. Turek: \"Unified Digit Selection for Radix-4 Recurrence Division and Square Root. \" IEEE Trans. Computers 73(1): 292-300, 2024. M. Usman, M. D. Ercegovac, J-A Lee: \"Low-Latency Online Multiplier with Reduced Activities and Minimized Interconnect for Inner Product Arrays. \" J. Signal Process. Syst. 95(7): 777-796, 2023. T. Arifeen, S. Gorgin, M. Gholamrezaei, A.Hassan, M. D. Ercegovac, J-A Lee: \"Low Latency and High Throughput Pipelined Online Adder for Streaming Inner Product.\" J. Signal Process. Syst.  95(7): 815-829, 2023. A. Wanna, S. Coward, T. Drane, G. Constantinides, M. Ercegovac, \"Multiplier Optimization via E-Graph Rewriting\", Proc.57h Asilomar Conference on Signals, Systems and Computers, 2023. S. Gorgin, M. Najafi, M. Golamrezaei, J-A Lee, M. D. Ercegovac, \"MSDF-SVM: Advantage of Most Significant Digit First Arithmetic for SVM Realization\",  Proc.57h Asilomar Conference on Signals, Systems and Computers, 2023. S. Gorgi, M. Golamrezaei, J-A Lee, Mi. D. Ercegovac, \"An Efficient Dot-Product Unit Based on Online Arithmetic for Variable Precision Applications\",  Proc.57h Asilomar Conference on Signals, Systems and Computers, 2023. M.Usman, J-A Lee and M. D.Ercegovac, \"Multiplier with Reduced Activities and Minimized Interconnect for Inner Product Arrays\",  Proc.55th Asilomar Conference on Signals, Systems and Computers, 2021. T. Arifeen, A. S.Hassan, J-A Lee, and M. D. Ercegovac, \"Adder with Reduced Latency and Minimized Interconnect for Streaming Inner Products\", Proc.55th Asilomar Conference on Signals, Systems and Computers, 2021. M. D. Ercegovac, \"On Reducing Module Activities in Online Arithmetic Operations\", Proc.54th Asilomar Conference on Signals, Systems and Computers, 2020. J. E. Stine, M. D. Ercegovac and J-M. Muller , \"An Architecture for Improving Variable Radix Real and Complex Division Using Recurrence Division\", Proc.54th Asilomar Conference on Signals, Systems and Computers, 2020. PhD Dissertation MS Thesis Publications Google Scholar Publications Talks Omnipresence of Teslaâs Work and Ideas Arithmetic: Past Revisited Left-to-Right Arithmetic Paradigm: Computing while Communicating - Terminate Gracefully at Any Moment Books Digital Arithmetic, M.D. Ercegovac and T. Lang, Morgan Kaufmann Publishers - An Imprint of Elsevier Science, 2004 Introduction to Digital Systems, M.D. Ercegovac, T. Lang, and J.H. Moreno, Wiley and Sons, 1998. Division and Square Root: Digit-Recurrence Algorithms and Implementations, M.D. Ercegovac and T. Lang, Kluwer Academic Publishers, 1994. Digital Systems and Hardware/Firmware Algorithms, M.D. Ercegovac and T. Lang, Wiley and Sons, 1985. Students Digital Arithmetic and Reconfigurable Architecture Laboratory Tesla Universe Updated Jannuary  2024 home | general | people | research | academics | papers (c)2000 Regents of the University of California For information about these pages, contact webmaster@ucla.edu.",
  "content_length": 5017,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:05"
}