{
  "name": "Mimi Zhang",
  "homepage": "https://www.tcd.ie/research/profiles/?profile=zhangm3",
  "status": "success",
  "content": "Mimi Zhang'Trinity Research - Trinity College Dublin Dr. Mimi Zhang Assistant Professor, Statistics mimi.zhang@tcd.ie +353 1896 2726 www.scss.tcd.ie/mimi.zhang/ Biography Mimi Zhang joined TCD as an assistant professor in October 2017. She holds a B.Sc. in statistics from University of Science and Technology of China (Sep. 2007-Jul. 2011), and a Ph.D. in industrial engineering from City University of Hong Kong (Nov. 2011-Dec. 2014). Before joining TCD, she was a research associate at University of Strathclyde and Imperial College London. My main research areas are machine learning and operations research, including cluster analysis, Bayesian optimization, functional data analysis, reliability & maintenance (engineering), etc. I primarily publish my core research in top-tier machine learning conferences, including NeurIPS, ICML, and ICDM. My collaborations primarily span the fields of mechanical, manufacturing, and biomedical engineering. Current PhD students: My research draws on advanced mathematics and statistical techniques. Therefore, I only consider PhD candidates with a STRONG background in mathematics, statistics, or computer science (not computer engineering). If you want to apply with me for the CSC-TCD PhD scholarship, please note that the deadline is early Feb. Ziqi Zheng, 2025 Guangchen Wang, 2023 Samuel Singh, 2023 Emmanuel Akeweje, 2023 Jessica Bagnall, 2023, co-supervisor Sukriti Dhang, 2022, co-supervisor Former PhD students: Joshua Tobin, thesis title \"Consistent Mode-Finding for Parametric and Non-Parametric Clustering\". Bernard Fares (part time), thesis title \"Incorporating Ignorance within Game Theory: An Imprecise Probability Approach\". Teaching Activities 09/21-now: Introduction to Statistical Concepts and Methods (10 ECTS), Coordinator 09/21-now: Implementing Statistical Methods in R (5 ECTS), Coordinator 09/17-now: Software Application (5 ECTS), Coordinator 09/17-08/21: Statistics Base Module (15 ECTS), Coordinator Software REMclust:   https://pypi.org/project/REMclust/ GPmix:   https://pypi.org/project/GPmix/ CPFcluster:   https://github.com/tobinjo96/CPFcluster FAEclust:   https://github.com/samuelveersingh/FAEclust Publications and Further Research Outputs Peer-Reviewed Publications Non-Peer-Reviewed Publications Peer-Reviewed Publications Joshua Tobin, Michaela Black, James Ng, Debbie Rankin, Jonathan Wallace, Catherine Hughes, Leane Hoey, Adrian Moore, Jinling Wang, Geraldine Horigan, Paul Carlin, Helene McNulty, Anne M Molloy and Mimi Zhang, Identifying comorbidity patterns of mental health disorders in community-dwelling older adults: A cluster analysis, BMC Geriatrics, 25, (235), 2025 Journal Article, 2025 TARA - Full Text DOI Guangchen Wang, Michael Monaghan and Mimi Zhang, Parallelizing Adaptive Reliability Analysis through Penalizing the Learning Function, IEEE Transactions on Reliability, 74, (3), 2025, p3028 - 3042 Journal Article, 2025 TARA - Full Text Samuel Singh, Shirley Coyle and Mimi Zhang, Shape-Informed Clustering of Multi-Dimensional Functional Data via Deep Functional Autoencoders, Advances in Neural Information Processing Systems (NeurIPS), The 39th Annual Conference on Neural Information Processing Systems, San Diego, 1st - 7th Dec, 2025, 2025 Conference Paper, 2025 TARA - Full Text Joshua Tobin, Michaela Black, James Ng, Debbie Rankin, Jonathan Wallace, Catherine Hughes, Leane Hoey, Adrian Moore, Jinling Wang, Geraldine Horigan, Paul Carlin, Helene McNulty, Anne M Molloy and Mimi Zhang, Co-Clustering Multi-View Data Using the Latent Block Model, Computational Statistics & Data Analysis, 210, 2025, p108188 Journal Article, 2025 Sukriti Dhang, Mimi Zhang and Soumyabrata Dev, LaBINet - An Approach for Seamlessly Integrating New Advertisement into an Existing Scene, IEEE Transactions on Artificial Intelligence, 6, 2025, p2281 - 2290 Journal Article, 2025 Sukriti Dhang, Mimi Zhang and Soumyabrata Dev, AdSegNet: A deep network to localize billboard in outdoor scenes, Signal, Image and Video Processing, 18, 2024, p7221 - 7235 Journal Article, 2024 Pangbo Ren, Charles Stuart, Mimi Zhang, Ryosuke Inomata, Kazuaki Nakamura, Isao Morita, Stephen Spence, Investigation of the surrogate model in an ANN-Meanline Hybrid model for Radial Turbine Performance Prediction, International Journal of Gas Turbine, Propulsion and Power Systems, 15, (2), 2024, p9 - 18 Journal Article, 2024 TARA - Full Text DOI URL Joshua Tobin and Mimi Zhang, A Theoretical Analysis of Density Peaks Clustering and the Component-wise Peak-Finding Algorithm, IEEE Transactions on Pattern Analysis and Machine Intelligence, 46, (2), 2024, p1109 - 1120 Journal Article, 2024 TARA - Full Text Emmanuel Akeweje and Mimi Zhang, Learning Mixtures of Gaussian Processes through Random Projection, Proceedings of the 41st International Conference on Machine Learning (ICML 2024), 41st International Conference on Machine Learning, Vienna, Austria, 21 - 27 July, 2024, 2024 Conference Paper, 2024 TARA - Full Text Mimi Zhang and Andrew Parnell, Review of Clustering Methods for Functional Data, ACM Transactions on Knowledge Discovery from Data, 17, (7), 2023, p1 - 34 Journal Article, 2023 Bernard Fares and Mimi Zhang, Incorporating Ignorance within Game Theory: An Imprecise Probability Approach, International Journal of Approximate Reasoning, 154, (March), 2023, p133 - 148 Journal Article, 2023 TARA - Full Text Joshua Tobin, Chin Pang Ho and Mimi Zhang, Reinforced EM Algorithm for Clustering with Gaussian Mixture Models, Proceedings of the 2023 SIAM International Conference on Data Mining (SDM), 2023 SIAM International Conference on Data Mining (SDM), Minnesota, U.S., 27 - 29 April, 2023, 2023, pp118 - 126 Conference Paper, 2023 TARA - Full Text Mimi Zhang and Bin Liu, Discussion of signature-based models of preventive maintenance, Applied Stochastic Models in Business and Industry, 39, (1), 2022, p54 - 56 Journal Article, 2022 Mimi Zhang, Matthew Revie and John Quigley, Saddlepoint Approximation for the Generalized Inverse Gaussian Levy Process, Journal of Computational and Applied Mathematics, 411, 2022, p114275 Journal Article, 2022 TARA - Full Text Nuno Neto, Sinead O'Rourke, Mimi Zhang, Hannah Fitzgerald, Aisling Dunne and Michael Monaghan, Non-Invasive classification of macrophage polarisation by 2P-FLIM and machine learning, eLife, 11, 2022, pe77373 Journal Article, 2022 Mimi Zhang, Weighted Clustering Ensemble: A Review, Pattern Recognition, 124, 2022, p108428 Journal Article, 2022 TARA - Full Text Muhannad Ahmed Obeidi, Medad Monu, Cian Hughes, Declan Bourke, Merve Nur Dogu, Joshua Francis, Mimi Zhang, Inam Ul Ahad and Dermot Brabazon, Laser beam powder bed fusion of nitinol shape memory alloy (SMA), Journal of Materials Research and Technology, 14, 2021, p2554-2570 Journal Article, 2021 DOI Min Xie and Mimi Zhang, Discussion of \"Virtual age, is it real?\", Applied Stochastic Models in Business and Industry, 37, (1), 2021, p30 - 31 Journal Article, 2021 Joshua Tobin and Mimi Zhang, DCF: An Efficient and Robust Density-Based Clustering Method, 2021 IEEE International Conference on Data Mining (ICDM), 2021 IEEE International Conference on Data Mining (ICDM), Auckland, New Zealand, 7 - 10 Dec, 2021, 2021, pp629 - 638 Conference Paper, 2021 TARA - Full Text Mimi Zhang, A Heuristic Policy for Maintaining Multiple Multi-State Systems, Reliability Engineering and System Safety, 203, 2020, p107081 Journal Article, 2020 TARA - Full Text Mimi Zhang, Forward-Stagewise Clustering: An Algorithm for Convex Clustering, Pattern Recognition Letters, 128, 2019, p283 - 289 Journal Article, 2019 TARA - Full Text Mimi Zhang and Tim Bedford, Vine Copula Approximation: A Generic Method for Coping with Conditional Dependence, Statistics and Computing, 28, (1), 2018, p219 - 237 Journal Article, 2018 TARA - Full Text Mimi Zhang and Matthew Revie, Continuous-Observation Partially Observable Semi-Markov Decision Processes for Machine Maintenance, IEEE Transactions on Reliability, 66 (1), 2017, p202 - 218 Journal Article, 2017 TARA - Full Text Mimi Zhang and Min Xie, An Ameliorated Improvement Factor Model for Imperfect Maintenance and Its Goodness of Fit, Technometrics, 59 (2), 2017, p237 - 246 Journal Article, 2017 TARA - Full Text Mimi Zhang, Olivier Gaudoin and Min Xie, Degradation-Based Maintenance Using Stochastic Filtering for Systems under Imperfect Maintenance, European Journal of Operational Research, 245 (2), 2015, p531 - 541 Journal Article, 2015 TARA - Full Text Mimi Zhang, Zhisheng Ye and Min Xie, A Stochastic EM Algorithm for Progressively Censored Data Analysis, Quality and Reliability Engineering International, 30 (5), 2014, p711 - 722 Journal Article, 2014 TARA - Full Text Mimi Zhang, Zhisheng Ye and Min Xie, A Condition-Based Maintenance Strategy for Heterogeneous Populations, Computers & Industrial Engineering, 77, 2014, p103 - 114 Journal Article, 2014 TARA - Full Text Mimi Zhang, Qingpei Hu, Min Xie and Dan Yu, Lower Confidence Limit for Reliability Based on Grouped Data with a Quantile Filling Algorithm, Computational Statistics & Data Analysis, 75, 2014, p96 - 111 Journal Article, 2014 TARA - Full Text Mimi Zhang, Min Xie and Olivier Gaudoin, A Bivariate Maintenance Policy for Multi-State Repairable Systems with Monotone Process, IEEE Transactions on Reliability, 62 (4), 2013, p876 - 886 Journal Article, 2013 TARA - Full Text Non-Peer-Reviewed Publications Mimi Zhang, Andrew Parnell, Dermot Brabazon and Alessio Benavoli, Bayesian Optimisation for Sequential Experimental Design with Applications in Additive Manufacturing, arXiv, 2021 Review Article, 2021 Mimi Zhang and Matthew Revie, Model selection with application to gamma process and inverse Gaussian process, CRC/Taylor & Francis Group, European Safety and Reliability Conference 2016, Glasgow, UK, 25 \" 29 Sep, 2016, 2016 Conference Paper, 2016 TARA - Full Text Mimi Zhang, Zhisheng Ye and Min Xie, Optimal Burn-in Policy for Highly Reliable Products Using Inverse Gaussian ",
  "content_length": 13772,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:07"
}