{
  "name": "Mimi Xie",
  "homepage": "https://sites.google.com/view/mxie/home",
  "status": "success",
  "content": "Mimi Xie's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationAssistant Professor Department of Computer ScienceThe University of Texas at San AntonioOffice: NPB 3.334Email: mimi.xie AT utsa DOT eduBibliographyMimi Xie is an Assistant Professor in the Department of Computer Science at University of Texas at San Antonio (UTSA). Before she joined UTSA in August, 2019, she obtained her Ph.D. from Department of Electrical and Computer Engineering, University of Pittsburgh, Pittsburgh, PA, USA. (CV)Her research focuses on design and optimization of efficient, intelligent, and secure computer system and architecture in the broad area of Internet-of-Things (IoT). She is taking an interdisciplinary effort spanning cutting-edge topics including emerging non-volatile memory technology, intermittently powered system, and intelligent algorithms to address the challenges in processing/transmitting unprecedented volume of data and powering all these devices. She is a receipient of NSF CAREER Award. Her work has been published in top conference and journal venues (e.g., DAC, ICCAD, DATE, EMSOFT, ASP-DAC, ACL, IEEE TCAD, ACM TCPS, ACM TOSN etc.).Research interestsIntermittent SystemTiny AI on IoTSustainable ComputingNews07/11/2025 Invited to serve on TPC for ACM Symposium on Applied Computing (SAC)03/2025 Received NSF CAREER Award. Thanks to NSF.02/08/2025 Invited to join TPC for GLSVLSI 2025.01/28/2025 Invited to serve on TPC for  IEEE Cloud Summit 2025.11/19/2024 One collaborative work is accepted by DATE 2025. Congrats to Mason and all collaborators!11/18/2024 My PhD student Jishnu passed dissertation defense. Big Congrats!09/22/2024 Invited to serve on TPC for ISVLSI 2024.07/09/2024 Invited to serve on TPC for ACM Symposium on Applied Computing (SAC)06/14/2024 One collaborative work is accepted by JSA. Congrats to Jingye!06/11/2024 Wei’s work is accepted by IEEE TCAD, congrats to Wei!05/06/2024 Wei’s work is accepted by ISVLSI 2024, congrats to Wei!04/25/2024 Hosted a workshop on S&CC at SP1.04/09/2024 My first PhD student Sahidul passed dissertation defense and will join Kennesaw State University as a tenture-track assistant professor in August. Big Congrats to Sahidul! https://jamy54.github.io/04/01/2024 Jishnu's paper is accepted by GLSVLSI 2024. Congrats to Jishnu!02/2024 Sahidul’s work is accepted by ISQED 2024, Congrats to Sahidul!02/04/2024 Invited to join GLSVLSI TPC 2024.01/21/2024 Invited to serve as a track chair for ISVLSI 2024.12/20/2023 One collaborative work is accepted by IEEE TOSN, congrats to Wen!12/13/2023 Invited to join TPC for IEEE Cloud Summit 2024.10/2023 Invited to serve as special session chair for ISQED 2024.10/2023 Serve on SAC TPC 2024.09/20/2023 Invited to join TPC for ACM IoTDI 2024.04/10/2023 One work is accepted by IEEE TCAD.04/2023 One collaborative work is accepted by ISQED 2023.03/2023 invited to serve as TPC member for EMSOFT 2023.02/2023 Invited to serve as a track chair for TPC of ISVLSI 2023.01/2023 Organize a special session on TinyML at DAC 2023.11/08/2022 Give a invited talk on \"On-device Intelligence for Energy Harvesting Devices\" for Department of Computer Science at Texas Tech University.11/2022 Our collaborative team with Uconn \"HuskyCS Deepical\" won 1st place in accuracy and 4th place overall of 2022 ACM/IEEE TinyML Design Contest at ICCAD among 150 teams from 10+countries. Congratulations to Sahidul and all team members! 11/03/2022 Panelist for ACM CodeQuantum Hackathon on minorities in STEM11/01/2022 Chairing the first EDA Job Fair @ ICCAD 2022, welcome to join!10/2022 Serving as a session chair for \"14D Autonomous Systems and Machine Learning on Embedded Systems\" at ICCAD'22.  10/2022 One collaborative work is accepted by IEEE ICESS.10/2022 Invited to serve as special session chair for ISQED 2023.09/2022 Invited to join TPC of ACM/IEEE IoTDI 2023.07/2022 One paper is accepted by ICCAD 2022 (CS ranking). Congratulations to Sahidul!07/2022 Join TPC of ICESS 2022.07/2022 One collaborative paper is accepted by EMSOFT 2022 (CS ranking). Thanks to awesome collaborators! Congratulations to Caleb!07/2022 Serve as Special Session co-chair for ISQED 202306/2022: We're organizing ACM SIGDA 1st Job Fair at ICCAD'22; Please submit your CV!06/2022 Caleb and Wei received DAC young fellow award. Congratulations!06/2022 One collaborative work is accepted by DAC 2023, Thanks to collaborator from Uconn.04/2022 Receive University Excellence Award: Innovation and Impact Award. Thanks to the awesome team leader Dr. Wei Wang.04/2022 TranSET project on traffic risk prediction is funded as Co-PI.04/2022 TranSET project on Reinforcement Learning is funded as Co-PI.03/2022 12/2021 Wei received the Graduate School Professional Development Award. Congratulations to Wei!03/2022 One collaborative paper is accepted by ACL 2022 (CS ranking). Thanks to awesome collaborators!03/2022 Join TPC of ICCAD 2022.02/2022 One collaborative work is accepted by 54th ACM Technical Symposium on Computer Science Education.02/2022 Give a talk at Brandeis High School02/2022 One collaborative work is accepted by CHASE 2023.01/2022 Two papers are accepted by ISQED 2022. Congratulations to Wei and awesome collaborators!12/2021 Shyamala received the Best Research Video Award, DAC Young Fellow. Congratulations!12/2021 Sahidul received the Graduate School Professional Development Award. Congratulations to Sahidul!11/2021 One Collaborative Paper is accepted by DATE 2022. Thanks to awesome collaborators!11/2021 One paper is accepted by DATE 2022. Congratulations to Sahidul!10/2021 Join TPC of the 59th Design Automation Conference (DAC) 2022.10/2021 Jishnu received the Graduate School Professional Development Award. Congratulations to Jishnu!09/2021 One collaborative paper has been accepted by the 27th Asia and South Pacific Design Automation Conference (ASP-DAC), 2022.09/2021 One collaborative paper is accepted by ASAP 2021. Thanks to awesome collaborators!07/2021 One paper is accepted by the ASAP 2021. Congratulations to Jishnu!07/2021  Join TPC of ICESS 2021.07/2021 Serve as Special Session co-chair for ISQED 2022.06/2021 Wei, Shyamala, Sahidul, and Jishnu received Richard A. Newton Young Student Fellow Award. Congratulations!04/2021 Join TPC of ASAP 2021.04/2021 Give a talk on NSCC Collaboration Day,03/2021 Join TPC of ICCAD 2021.02/2021 One collaborative paper is accepted by TranSET 2021. Thanks to awesome collaborators!01/2021 Two collaborative papers are accepted by ISQED 2021. Thanks to awesome collaborators!12/2020 Shyamala received best presentation award (Third place), Women in Hardware and Systems Security (WISE) workshop. Congratulations to Shyamala!10/2020 Join TPC of  59th Design Automation Conference (DAC) 2021.07/2020 Shyamala received Individual Contributor Award for DAC young fellow program. 07/2020 One paper is accepted by workshop of IGSC 2020. Congratulations to Shyamala!07/2020 Invited to serve as Student Presentation Chair for The Fourth Workshop for Women in Hardware and System Security, 2020.07/2020 Serve as Special Session co-chair for ISQED 202106/2020 Receive GHC Faculty Award 202005/2020 Join TPC of IGSC 2020.04/2020 One collaborative is accepted by ISPLED 2020. Thanks to awesome collaborators!11/2019 Invited by IEEE Central Texas Section Chapter to give a talk at Southwest Research Institute. https://events.vtools.ieee.org/m/20957509/2019 Join TPC of 59th Design Automation Conference (DAC) 2020.09/2019 Join TPC of EdgeSP 2019.08/2019 Join Department of Computer Science at UTSA.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 7628,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:03"
}