{
  "name": "Min Xian",
  "homepage": "http://www.uidaho.edu/engr/our-people/min-xian",
  "status": "success",
  "content": "Our people — Engineering | University of Idahoskip to main contentskip to footer Our people at EngineeringMenuEngineeringAcademicsStudent successOur PeopleNews and eventsEngineering OutreachResearchPartnershipsYou will receive mentorship and support from more than 100 nationally and internationally recognized UIdaho College of Engineering employees who are committed to your academic success.Our distinguished team includes experts across diverse engineering disciplines, offering guidance in areas such as mechanical design, fluid dynamics, cybersecurity and sustainable energy systems. With a strong emphasis on student-centered learning, our faculty are actively involved in cutting-edge research and dedicated to fostering an environment where students thrive.Our departmentsDepartment of Chemical and Biological EngineeringDev ShresthaChemical and Biological Engineering Department Chair and ProfessorWudneh \"Woody\" AdmassuProfessorEric AstonProfessorMatthew BernardsAssociate Professor, NASA Idaho Space Grant Consortium DirectorSteven GardnerProfessor, Lou Edwards Endowed ChairEric HolmesAssistant ProfessorJames MoberlyAssociate Professor of Chemical and Biological EngineeringJagdish PatelAssistant ProfessorChing-An PengProfessorBatric PesicProfessorRussell QuallsAssociate Professor and Idaho State ClimatologistNathan SchieleAssociate ProfessorJudy VandegriftManagement AssistantVivek UtgikarProfessorSarah (Xiao) WuAssociate ProfessorHaiyan ZhaoAssociate ProfessorDepartment of Civil and Environmental EngineeringMichael LowryProfessor, CEE Department ChairAhmed Abdel-RahimProfessorErik ArnsonClinical Associate ProfessorCynthia BrinkmanResearch ScientistKevin ChangProfessor, NIATT DirectorErik R. CoatsSorenson Family Endowed Professor in Water ResourcesFritz FiedlerProfessorBayomy FouadProfessorRuimin FengAssistant ProfessorAhmed A. IbrahimProfessorS.J. JungProfessorEmad KassemProfessorChyr LiouProfessorAngel MonsalveAssistant ProfessorClifford S. SwansonAssistant ProfessorDaniele ToninaProfessor, Co-Director, Center for Ecohydraulics ResearchAndrew W. TranmerAssociate Research ProfessorElowyn YagerProfessor, Co-Director, Center for Ecohydraulics ResearchYuntian WuAssistant ProfessorDepartment of Computer ScienceSteve WangProfessor and Department Chair\tDaniel Conte de LeonAssociate Professor, Acting ChairRobert RinkerAssociate Professor, Associate ChairJim Alves-FossUniversity Distinguished ProfessorJoules BeestonClinical FacultyBruce BoldenSenior InstructorRobert HiromotoProfessorHasan JamilAssociate ProfessorConstantinos (Costas) KoliasAssociate ProfessorJohnny (Liujun) LiAssistant ProfessorMarshall (Xiaogang) MaAssociate Professor, Dean's Distinguished FellowBhaskar RimalAssistant ProfessorFrederick “Rick” SheldonProfessorJohn ShovicResearch Faculty; Director of the Center for Intelligent Industrial RoboticsJia SongAssociate ProfessorTammy St. John-TeskyAdministrative specialistTerry SouleProfessorAlex VakanskiAssociate ProfessorMichael WilderClinical Faculty Assistant ProfessorMin XianAssociate ProfessorBoyu ZhangAssistant ProfessorDepartment of Electrical and Computer EngineeringYacine ChakhchoukhAssociate ProfessorZain Ul AbideenAssistant ProfessorHerbert HessDepartment Chair, ProfessorBrian JohnsonSchweitzer Engineering Laboratories Endowed Chair in Power Engineering, Distinguished Professor, Interim Director of CSDSMarc JeanClinical Assistant ProfessorHangtian LeiAssociate ProfessorFeng LiMicron Endowed Chair in Microelectronics, NGeM Director, FIB/SEM DirectorRakin Muhammad ShadabAssistant ProfessorBalakumar MuniandiAssistant ProfessorBhaskar RimalAssistant ProfessorRobert RinkerAssociate Professor, Associate ChairRowdy SanfordClinical Assistant ProfessorTing-Yen ShihAssociate ProfessorDennis SullivanProfessorGiselle VeachClinical Assistant ProfessorAta ZadehgolProfessor Department of Mechanical EngineeringEric WolbrechtDepartment Chair, Dean, and Cindy Haagenson Mechanical Engineering Endowed ProfessorChristopher BitikoferProfessorGianluca BloisAssistant ProfessorDan CordonClinical Associate ProfessorJohn C. CrepeauProfessor, Associate Dean for UndergraduatesVibhav DurgeshAssociate ProfessorKamal KumarAssociate ProfessorMichael MaughanAssociate ProfessorJoel PerryAssociate ProfessorGabriel PotirnicheAssociate Dean, ProfessorDaniel J. RobertsonGrand Challenge Scholars Program Director, Associate ProfessorMark F. RollNGeM Outreach Manager, Clinical FacultyLarry StaufferProfessor of Mechanical Engineering and Engineering ManagementRobert StephensProfessorMatthew SwensonInterdisciplinary Capstone Design Program Director, Associate ProfessorTao XingProfessorDepartment of Nuclear Engineering and Industrial ManagementIndrajit CharitDepartment Chair, ProfessorR. A. BorrelliAssociate ProfessorJavier Calvo-AmodioAssociate ProfessorAmin MirkoueiAssociate ProfessorEan NgClinical Associate ProfessorKrishnan RajaProfessorJohn RussellAssociate Research Professor, Special Assistant to the Dean of Engineering Alex VakanskiAssociate ProfessorEmeritusSandy LieskeLecturer EmeritaMichael McKellarProfessor, EmeritusLee OstromProfessor, EmeritusOur staffCollege administrationSuzanna LongDean of the College of EngineeringGabriel PotirnicheAssociate Dean, ProfessorKathy DukeAssistant to the DeanBobbi HughesChief Strategic Partnerships OfficerJohn KummExecutive Director, Energy InstituteKathryn (Katie) SchiffelbeinDirector of Strategic Programs and Student SuccessCommunications and marketingAlexiss TurnerDirector of Communications and MarketingDonor engagement and partnershipsBobbi HughesChief Strategic Partnerships OfficerChelan LippincottDirector of Development, College of EngineeringRyelee SchlueterAssociate Director of Development, College of EngineeringMaggie ScottDirector of Development, College of EngineeringStudent servicesBrian CoxAcademic advisorSydney InmanAcademic AdvisorErin LaniganAssistant director of student engagement and STEM outreachKathryn (Katie) SchiffelbeinDirector of Strategic Programs and Student SuccessOur centersBoise centerChelan LippincottDirector of Development, College of EngineeringMaggie ScottDirector of Development, College of EngineeringAndrew W. TranmerAssociate Research ProfessorElowyn YagerProfessor, Co-Director, Center for Ecohydraulics ResearchCoeur d'Alene centerJoules BeestonClinical FacultyRobert RinkerAssociate Professor, Associate ChairJohn ShovicResearch Faculty; Director of the Center for Intelligent Industrial RoboticsTammy St. John-TeskyAdministrative specialistIdaho FallsR. A. BorrelliAssociate ProfessorIndrajit CharitDepartment Chair, ProfessorRobert HiromotoProfessorConstantinos (Costas) KoliasAssociate ProfessorMichael McKellarProfessor, EmeritusAmin MirkoueiAssociate ProfessorKrishnan RajaProfessorJohn RussellAssociate Research Professor, Special Assistant to the Dean of Engineering Alex VakanskiAssociate Professor",
  "content_length": 6872,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:11"
}