{
  "name": "Min Xu 0009",
  "homepage": "https://xulabs.github.io/min-xu",
  "status": "success",
  "content": "About Min Xu - Xu lab@CBD_SCS_CMU About Min Xu Min Xu, Ph.D. Associate Professor, Computational Biology Department Courtesy Faculty, Robotics Institute School of Computer Science Courtesy Faculty, Department of Electrical and Computer Engineering Carnegie Mellon University Office: GHC 7709, 5000 Forbes Avenue, Pittsburgh, PA 15213 Email: mxu1 @ cs.cmu.edu Curriculum Vitae, Google Scholar, DBLP, Research Gate, Twitter, and Linkedin pages. Biography Dr. Min Xu (徐旻) is an Associate Professor at the Computational Biology Department within the School of Computer Science at Carnegie Mellon University. He also has Courtesy Appointments at the Robotics Institute and Department of Electrical and Computer Engineering. He serves as training faculty at the Joint CMU-Pitt Ph.D. Program in Computational Biology. He also serves as co-director at the Master of Science in Computational Biology (MSCB) program and training faculty at the Master of Science in Computer Vision (MSCV) program at CMU. He is an investigator at the National Center for Multiscale Modeling of Biological Systems. He is also affiliated with the Computer Vision Department at the Mohamed bin Zayed University of Artificial Intelligence, UAE. Dr. Xu has a career centered around the development of computer vision and machine learning methods for the analysis of cellular systems using imaging and omics data. While his early work (2000-2009) focused on developing machine learning methods for the analysis of functional genomics data, he later on (2008) moved onto developing computer vision methods for the analysis of Cellular Cryo-Electron Tomography (Cryo-ET) 3D image data. Dr. Xu and his team have designed novel structural pattern mining methods. He has been the first to demonstrate the feasibility of De Novo extraction of structures and spatial organizations of macromolecular complexes in single cells using Cryo-ET data. His current research focuses on Cryo-ET derived modelling of cellular organization at molecular resolution. Dr. Xu has published papers in peer-reviewed top journals and conferences, such as PNAS, Structure, ISMB, CVPR, NeurIPS, and MICCAI. He serves as PI of US NIH R01 and NSF awards. He received an NSF CAREER award in 2023. Dr. Xu received a B.E. in Computer Science from the Beihang University, M.Sc from School of Computing at the National University of Singapore, M.A. in Applied Mathematics from the University of Southern California (USC), and Ph.D. in Computational Biology and Bioinformatics from USC. He was a postdoctoral researcher at USC. Dr. Xu researches for fun, and he enjoys working with highly talented and motivated students. Enter your search term...",
  "content_length": 2676,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:08"
}