{
  "name": "Min Zhang 0002",
  "homepage": "https://faculty.ecnu.edu.cn/_s43/zm2_en_6072/main.psp",
  "status": "success",
  "content": "软件工程学院 教师个人主页 中文 Home Login Navigation About Resume Research Fields Enrollment and Training Course Scientific Academic Achievements Honor Min Zhang Related to the teacher About Department: Software Engineering Institute Gender: male Post: 200062 Graduate School: Degree: Ph.D Academic Credentials: Full Professor Tel: Email: zhangmin@sei.ecnu.edu.cn Office: B1117, Science Building Address: Science Building, No. 3663, North Zhongshan Road, Putuo, Shanghai PostCode: 200062 Fax: Education 2008.04-2011.09: Japan Advanced Institute of Science and Technology (JAIST), Ph.D in Software Engineering 2005.09-2008.03: Shanghai Jiao Tong University, M.S. in Software Theory 2001.09-2005.06: Shandong Normal University, B.S. Computer Science WorkExperience 2021.01-present： East China Normal University，Software Engineering Institute，Full Professor2014.11-2020.12：East China Normal University，Software Engineering Institute，Associate Professor 2011.10-2014.10：Japan Advanced Institute of Science and Technology (JAIST), post-doc researcher Resume I’m a full professor at Software Engineering Institute. I obtained my Ph.D in Software Engineering, at Ogata Lab in Japan Advanced Institute of Science and Technology (JAIST) in 2011, and my Master at the BASICS Lab in Shanghai Jiaotong University in 2008.My research interests include formal methods for safety-critical systems such as real-time systems, AI-empowered systems and blockchains. Our researches have been funded by several agencies such as National Science Foundation of China (NSFC), France Campus, Israel Science Foundation (ISF), China Scholarship Council (CSC), and Huawei. I have co-authored more than 70 publications including several at top-tier conferences and journals such as CAV, NeurIPS, AAAI, ASE, ISSTA, OOPSLA, RTSS, FSE, TCS. Other Appointments I actively particiapte into the following events: 2025: PC member of ICLR 2025, AISTATS 2025ICML 2025 2024: TPC member of DATE 2024 (D1 Track), AAAI 2024 (SRRAI), IJCAI 2024, NeurIPS 2024, ICTAC 2024, TASE 2024, FACS 2024, ICFEM 20242023: TPC member of DATE 2023, IJCAI 2023, PRDC 2023, APSEC 20232022: PC chair of ICFEM 2022, PC of APSEC 2022, PRDC 2022, TPC member of DATE 20222021: Co-chair of TASE 2021, TPC member of DATE 20212019: Co-chair of AI&FM 20192018: Co-chair of YR-FMAC 2018, PC member of TASE 2018, PC member of FACS 20182017: Program chair of TASE 2017, ACL 20172016: Publicity chair, local organization chair of TASE 2016, PC member of TASE 2016,  ICFEM 2016, ACL 2016IEEE, ACM MemberReviewers of the following journals and conferences:Frontiers of Computer Science, 2014IEICE Transactions on Information & System, 2014IEICE Transactions on Information & System, 2013IEICE Transactions on Information & System, 2012SAS 2014FoSSaCS 2013 Research Fields I and my research team are mainly working on formal methods for various computer systems such as real-time systems, AI-driven systems and blockchains. In particular, we are focused on the following directions: 1. modeling and verifying real-time systems in logical clocks. 2. formal verification of neural networks and AI-enabled systems 3. formal verification of blockchains including smart contracts and distributed protocols. Two post-doc positions are open unitl 2023.12.01. Our research lab is seeking self-motivated post-doc researchers and PhD students who have strong research intersts in both AI and FM. We will provide competitive salary and treatment. Please contact me for CV to the mail address. zhangmin@sei.ecnu.edu.cnLast update: 2023.11.05 Enrollment and Training CALL FOR PEOPLE (CFP)I'm seeking highly self-motivated graduate students and post-doc researchers to join my group. Please send me your resume to zhangmin@sei.ecnu.edu.cn if you are interested in applying. Awards for Students:  [2023.10] 田家旭同学（M3）获得国家奖学金。[2023.09] 田家旭（M3）、郅大鹏（D3）同学的论文“Taming Reachability Analysis of DNN-Controlled Systems via Abstraction-Based Training ” 被第25届形式化方法国际权威会议VMCAI 2024（CCF-B类）录用。[2023.09] 田家旭（M3）、郅大鹏（D3）同学的论文“Boosting Verification of Deep Reinforcement Learning via Piece-Wise Linear Decision Neural Networks”被第37届人工智能领域顶级会议NeurIPS 2023（CCF-A类）录用。[2023.05] 薛志一（M2）、张兆迪（D4）、吴旖婷（M3）三位同学的论文A Tale of Two Approximations: Tightening Over-Approximation for  DNN Robustness Verification via Under-Approximation被ISSTA 2023（CCF-A类）录用。[2023.02] 张兆迪（D4）、薛志一（M2）、陈洋（M2）三位同学的论文Boosting Verified Training for Robust Image Classifications via Abstraction被CVPR 2023（CCF-A类）录用。[2022.12] 郭省吾（M2）、周孜为（B3）同学的论文OccRob: Efficient SMT-Based Occlusion Robustness Verification of Deep Neural Networks被国际顶级会议第29届TACAS 2023（CCF-B类）录用。[2022.12]2019级硕士金鹏同学（M3）的硕士论文《基于抽象域训练的可验证强化学习》入选华东师范大学优秀硕士毕业论文。[2022.07] Our work 'Provably Tightest Linear Approximation for Robustness Verification of Sigmoid-like Neural Networks', has been acccepted by ASE 2022  (CCF-A)[2022.07] Our joint work 'QVIP: An ILP-based Formal Verification Approach for Quantized Neural Networks', with Fu Song (ShanghaiTech University) et. al, has been acccepted by ASE 2022  (CCF-A)[2022.07] Our joint work 'Neural Network Verification with Proof Production', with Omri Isac, Clark Barrett and Guy Katz, has been acccepted by FMCAD 2022  (CCF-C)[2022.07] Our joint work 'Bridging the Semantic Gap between Qualitative and Quantitative Models of Distributed Systems', with Dr. Si Liu, Peter Olveczky, Jose Meseguer, David Basin, has been acccepted by OOPSLA 2022 (CCF-A)[2022.05] 金鹏、田家旭、郅大鹏三位同学的论文Trainify: A CEGAR-Driven Training and Verification Framework for Safe Deep Reinforcement Learning被形式化领域顶级会议CAV 2022（CCF-A类）录用！[2021.10] I will serve as the PC chair for ICFEM 2022,one of the premier conferneces on formal methods. ICFEM 2022 is to going to be held on Oct. 24-27,2022 in Madrid, Spain. [2021.08] 2021级硕士研究生郭省吾同学的论文Eager Falsification For Accelerating Robustness Verification of Deep Neural Networks被第32届国际软件过程可靠性会议ISSRE（CCF-B类）录用。[2021.07] I will serve as TPC member for the Track D1 of DATE 2022. Submit your contributions by Step. 12![2021.04] I will serve as PC member of FoMLAS 2021, a satellite workshop of CAV 2021！[2020.12] I will co-chair TASE 2021 with Kazuhiro Ogata from 08/25 to 08/27 in 2021！[2020.12] 2020级硕士研究生吴旖婷同学的论文被人工智能顶级会议AAAI'21录用！ [2020.09] 2016级硕士研究生高飞同学毕业论文入选华东师范大学信息学部优秀毕业论文！[2020.05] 2016级硕士研究生迟晓彤同学被评委上海市优秀毕业生！[2020.05] 2020年入选法国蔚蓝海岸大学“Senior Professor”外籍学者访问项目。[2020.03] ECNU-Inria Associated Team for FM4CPS project is granted. (ECNU-Inria FM4CPS联合团队获得Inria资助）[2019.12] 迟晓彤同学的论文“An Algebraic Approach to Modeling and Verifying Policy-Driven Smart Devices in IoT Systems” 获APSEC2019最佳论文奖。[2019.11] 2017级硕士研究生高飞同学的学术论文“Modeling and Verifying Uncertainty-Aware Timing Behaviors using Parametric Logical Time Constraint”被DATE2020会议接收。[2019.07] 2019年中法“蔡元培”交流合作项目获得国家留学基金委资助，中方负责人。[2019.06] 2019年入选法国蔚蓝海岸大学“Senior Professor”外籍学者访问项目。[2019.01] 2016级硕士研究生钱佳琪同学被评为华东师范大学优秀毕业生。[2019.01] 2016级硕士研究生钱佳琪同学的学术论文“KupC: A Formal Tool for Modeling and Verifying Dynamic Updating of C Programs”被FASE 2019接收。[2018.11] 2016级硕士研究生唐玮同学获得国家励志奖学金，祝贺唐玮。[2018.08] 2015级博士研究生朱晓冉同学的学术论文“Towards a unified executable formal automobile OS kernel and its applications.”被IEEE Transactions on Reliability国际期刊录用。[2018.08] 国家自然科学基金面上项目 “基于时钟约束建模语言CCSL的实时嵌入式系统形式化验证与分析” 2019.01.01~2022.12.31, 主持人。[2018.08] 实验室获批华为OPEN HIRP项目资助。[2018.03] 实验室2018年度中法“徐光启”项目--基于SMT技术的时钟约束描述语言的形式化验证与分析 获批，中方负责人.[2017.11] 2015级硕士研究生应云辉同学的学术论文“基于SMT的时钟约束语言CCSL的形式化分析方法与工具”被软件学报录用。[2017.03] 2015级硕士研究生应云辉同学的学术论文“Towards SMT-based LTL Model Checking of Clock Constraint Specification Language for Real-Time and Embedded Systems”被LCTES 2017会议接收。[2017.03] 2014级硕士研究生代风同学被评为“校优秀毕业生”，祝贺代风。[2015.08] 国家自然科学基金青年项目 “基于模型检测的高可靠性软件动态更新的设计与验证” 2016.01.01~2018.12.31, 主持人 Course Scientific Academic Achievements [TASE'25]Min Zhang: Safeguarding Neural Network-Controlled Systems via Formal Methods: From Safety-by-Design to Runtime Assurance. TASE (CCF-C, Invited Talk), Link, 2025[RE'25]Tong Xu, Zheng Zhou, Xiaohong Chen, Zhiyi Xue, Yi Zhao, Min Zhang and Zhi Jin: Requirements Dependency Driven Test Case  Generation: An Automotive Industry Practice. RE (CCF-B), 2025[NN'25]Shi Peng, Si Liu, Dapeng Zhi, Peixin Wang, Chenyang Xu, Cheng Chen, Min Zhang: ATA: An Abstract-Train-Abstract approach for explanation-friendly deep reinforcement learning. Neural Networks (CCF-B), DOI, 2025[VMCAI'25]Junfeng Yang, Min Zhang, Xin Chen, Qin Li: Formal Verification of Probabilistic Deep Reinforcement Learning Policies with Abstract Training. VMCAI (CCF-B), pp. 124-147, 2025[AAAI'25]Chongyu Zhang, Qiping Tao, Liangyu Chen, Min Zhang: BERT-Based Code Learning for Exception Localization and Type Prediction. AAAI 2025 (CCF-A)[ICSE'25] Jiehao Wu, Yanqiu Lin, Junjie Sheng, Jianqi Shi, Xiangfeng Wang, Yanhong Huang, Min Zhang: SolSearch: An LLM-Driven Framework for Efficient SAT-Solving Code Generation. ICSE 2025, NEIR Track, (CCF-A)[CAV'24]Dapeng Zhi, Peixin Wang, Si Liu, Luke Ong, Min Zhang: Unifying Qualitative and Quantitative Safety Verification of DNN-Controlled Systems. CAV 2024, pp. 401-426, Springer, 2024 (CCF-A, PDF)[CAV'24]Haoze Wu,  Omri Isac, ..., Min Zhang, Ekaterina Komendantskaya, Guy Katz and Clark Barrett: Marabou 2.0: A Versatile Formal Analyzer of Neural Networks. CAV 2024, pp. 249 - 264, Springer, 2024  (CCF-A, PDF)[ISSTA'24]Zhiyi Xue, Liangguo Li, Senyue Tian, Xiaohong Chen, Pingping Li, Liangyu Chen, Tingting Jiang, Min Zhang: LLM4Fin: Fully Automating LLM-Powered Test Case Generation for  FinTech Software Acceptance Testing. The ISSTA 2024, pp. 1661-1673, ACM (CCF-A, PDF)[AAAI'24] Dapeng Zhi, Peixin Wang, Cheng Chen, Min Zhang: Robustness Verification of Deep Reinforcement Learning Based Control Systems using Reward Martingales. The 38th AAAI, 2024,  (CCF-A, Link)[ICSE'24] Zhaohui Wang, Min Zhang, Jingran Yang, Bojie Shao, Min Zhang: MAFT: Efficient Model-Agnostic Fairness Testing for Deep Neural Networks via Zero-Order Gradient Search. The 46th ICSE, 2024, Accepted (CCF-A, Research Track)[ICSE'24] Zhiyi Xue, Liangguo Li, Senyue Tian, Xiaohong Chen, ",
  "content_length": 25452,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:09"
}