{
  "name": "Min Zhang 0006",
  "homepage": "http://www.thuir.cn/group/~mzhang",
  "status": "success",
  "content": "Min Zhang | Home Min Zhang z-m AT tsinghua.edu.cn Follow Location DBLP Semantic Scholar Google Scholar ExperiencesTeachingResearchResourcesPublications Ph.D & Professor, Information Retrieval Group National Lab of Intelligent Tech. & Sys. Department of Computer Sci.& Tech. Tsinghua University, Beijing, China z-m AT tsinghua.edu.cn Telephone: +86-10-62798279 Research area: Web Information Retrieval and Recommendation, User Behavior Analysis and Profiling, Machine Learning, Data Mining. TOIS (ACM Transactions on Information Systems) , Editor-in-Chief (Since 2020.8): paper submission site Membership Member of Tiangong AI Research Center, which is founded by Tsinghua and Sogou Inc. Vice Director of The State Key Lab of Intelligent Technology and Systems, Tsinghua University Vice Director of Ministry of Education (MOE) - Microsoft Research Asia (MSRA) Key Research Lab on Media and Search, Tsinghua University Education and Research Experiences Professor, Tsinghua University, since 2022.06 Associate Professor, Tsinghua University, 2008.12~2022.05 Assistant Professor, Tsinghua University, 2003.8~2008.11 State Council of Informatization Office, P.R. China, 2005.3 ~ 2006.1 Ph.D., Tsinghua University, China.1999.9 ~ 2003.7 B.Sc., Tsinghua University, China. 1995.9 ~ 1999.7 Short Term Visitings: Visiting Research Associate Professor, National University of Singapore, 2018.1 Visiting Researcher, Microsoft Research Asia, 2010.8 ~ 2011.2 Visiting Researcher, Kyoto University, 2009.11 ~ 2009.12 Visiting Research Fellow, City University of Hongkong, 2004.10~2005.2 Visiting Researcher, DFKI (Germany Research Institute of Artificial Intelligence), 2004.6 ~ 2004.7 Teaching Activities Excellent Teaching Award for Young Faculties in Tsinghua University, 2008 Introduction to Machine Learning, for undergraduates, since 2004 2019: Feb 25 ~ June 14, Every Friday Afternoon, 15:20~16:55, No.3-1300. Advanced Topics in Information Retrieval, for graduate students, since 2005 2019: Feb 25 ~ June 14, Every Friday Afternoon, 13:30~15:05, No.6-6B206. Web and in Information Retrieval (in English), for Advance Computing Master Program (for foreign students), since 2011 2019: Feb 25 ~ June 14, Every Friday Morning, 9:50~11:25, No.3-1308. Research Activities Highlights (Call For Papers) Communities: The State Key Lab of Intelligent Technology and Systems, Tsinghua University, Vice Director, since 2012.2 MOE-Microsoft Key Lab of Web and Media Technology, Tsinghua University, Vice Director, since 2011.11 Tsinghua-Sohu Joint Research Lab of Searching Technology, Vice Director, since 2007.4 Professional Committee of Machine Learning, Chinese Association of Artificial Intelligence (CAAI), since 2010.8 Professional Committee of Information Retrieval, Chinese Information Processing Society of China (CIPSC), since 2010.8 Professional Committee of Chinese Information Technology, China Computer Federation (CCF), since 2010.12 CCF Senior member Journals: ACM Trans. on Information Systems (TOIS), Editor-in-Chief ACM Trans. on Information Systems (TOIS), Associate Editor (2015-2020) Information Retrieval, Springer (JIR), Reviewer Information Processing and Management (IP&M), Reviewer Journal of Computer Science and Technology,(Chinese Journal, in English), Reviewer Journal of Chinese Information Processing,(Chinese Journal), Reviewer Acta Automatica Sinica , (Chinese Journal), Reviewer Conferences: Co-organizers/Co-Chairs: CHIIR 2024 PC Chair CIKM 2023 PC Chair RecSys 2023 PC Chair ICTIR 2020 PC Co-Chair of Short Papers EVIA 2019 PC Co-Chair SIGIR 2019 Tutorials Co-Chair WSDM 2019 Workshop Chair SIGIR 2018 Short Paper Chair WSDM 2017 IJCAI 2016 DC AIRS 2016 NTCIR-11 IMINE Task, NTCIR-10 INTENT2 Task, NTCIR-9 INTENT Task The CCF Advanced Disciplines Lectures on Information Retrieval (CCF ADL 21), 2011 The CCF Advanced Disciplines Lectures on Statistical Learning for text information processing on Web (CCF ADL 46), 2014 4th Workshop on Information Credibility on the Web in conjunction with WWW 2010(WICOW2010) Senior PC Members and Area Chairs: WSDM 2019 (Outstanding SPC Award) Annual ACM SIGIR Conference: SIGIR 2017 International World Wide Web Conference: WWW 2016 ACM conference on Web Search and Data Mining: WSDM 2018, WSDM 2015 ACM Conference on Information and Knowledge Management: CIKM 2017, CIKM 2015, CIKM 2014, CIKM 2013, CIKM 2012, CIKM 2011 Aisa Information Retrieval Societies Conference: AIRS 2015, AIRS 2013, AIRS 2012, AIRS 2011, AIRS 2010, AIRS 2009 PC Members: Association for the Advancement of Artificial Intelligence: AAAI 2017 Annual ACM SIGIR Conference: SIGIR 2016, SIGIR 2015, SIGIR 2014, SIGIR 2013, SIGIR 2012, SIGIR 2011 International World Wide Web Conference: WWW 2018, WWW 2017, WWW 2015, WWW 2014, WWW 2013, WWW 2012, WWW 2011, WWW 2010, WWW 2009, WWW 2008 Annual Meeting of the Association for Computational Linguistics: ACL 2016, ACL 2014, ACL 2012, ACL 2011 IEEE International Conference on Big Data: BigData 2013 ACM conference on Web Search and Data Mining: WSDM 2012, WSDM 2011, WSDM 2010 ACM SIGKDD Conference on Knowledge Discovery and Data Mining: KDD 2012, KDD 2010 The International Conference on Language Resources and Evaluation: LREC 2015, LREC 2014, LREC 2012 conference on Empirical Methods in Natural Language Processing: EMNLP 2009 International Joint Conference of Natural Language Processing: IJCNLP 2008 Asia Information Retrieval Symposium: AIRS 20008(Harbin), AIRS 2006(Singapore), 2005(Korea), 2004 (Beijing) Resources THUIR GitHub page Tools ReChorus: a general PyTorch framework for Top-K recommendation with implicit feedback, especially for research purpose. Datasets Many of released datasets are located at the website of Tiangong AI Research Center (in Chinese). For example, we have a web corpus and a image dataset. Here are some datasets which are used in our recent studies: User Behavior Dataset. in our WSDM’19 paper The influence of image search intents on user behavior and satisfaction. Reading Attention Dataset. in our CIKM’18 paper Understanding Reading Attention Distribution during Relevance Judgement. SRR Dataset. in our CIKM’18 paper Relevance Estimation with Multiple Information Sources on Search Engine Result Pages Sogou-QCL Dataset. in our SIGIR’18 paper Sogou-QCL: A New Dataset with Click Relevance Label SearchSuccess Dataset. in our WWW’18 paper “Satisfaction with Failure” or “Unsatisfied Success”: Investigating the Relationship between Search Success and User Satisfaction. Selected Publications 2025 Heng Er Metilda Chee, Jiayin Wang, Zhiqiang Guo, Weizhi Ma, Min Zhang. PerSRV: Personalized Sticker Retrieval with Vision-Language Model. The Web Conference 2024 (WWW 2025). Chumeng Jiang, Jiayin Wang, Weizhi Ma, Charles LA Clarke, Shuai Wang, Chuhan Wu, Min Zhang. Beyond Utility: Evaluating LLM as Recommender. The Web Conference 2024 (WWW 2025). Shenghao Yang, Weizhi Ma, Zhiqiang Guo, Min Zhang, Haiyang Wu, Junjie Zhai, Chunhui Zhang, Yuekui Yang. Explainable Multi-Modality Alignment for Transferable Recommendation. The Web Conference 2024 (WWW 2025). 2024 Jiayin Wang, Fengran Mo, Weizhi Ma, Peijie Sun, Min Zhang, Jian-Yun Nie. A User-Centric Multi-Intent Benchmark for Evaluating Large Language Models. The 2024 Conference on Empirical Methods in Natural Language Processing. (EMNLP 2024) Xiaoyu Zhang, Yishan Li, Jiayin Wang, Bowen Sun, Weizhi Ma, Peijie Sun, Min Zhang. Large language models as evaluators for recommendation explanations. The 18th ACM Conference on Recommender Systems. (RECSYS 2024) Jiayu Li, Aixin Sun, Weizhi Ma, Peijie Sun, Min Zhang. Right Tool, Right Job: Recommendation for Repeat and Exploration Consumption in Food Delivery. The 18th ACM Conference on Recommender Systems. (RECSYS 2024) Shenghao Yang, Weizhi Ma, Peijie Sun, Qingyao Ai, Yiqun Liu, Mingchen Cai, Min Zhang. Sequential Recommendation with Latent Relations based on Large Language Model. The 47th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2024). Yuanqing Yu, Chongming Gao, Jiawei Chen, Heng Tang, Yuefeng Sun, Qian Chen, Weizhi Ma, Min Zhang. EasyRL4Rec: A User-Friendly Code Library for Reinforcement Learning Based Recommender Systems. The 47th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2024). Zhefan Wang, Yuanqing Yu, Wendi Zheng, Weizhi Ma, Min Zhang. Multi-Agent Collaboration Framework for Recommender Systems. The 47th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2024). Hanyu Li, Weizhi Ma, Peijie Sun, Jiayu Li, Cunxiang Yin, Yancheng He, Guoqiang Xu, Min Zhang, Shaoping Ma. Aiming at the Target: Filter Collaborative Information for Cross-Domain Recommendation. The 47th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2024). Vadim Grigorev, Jiayu Li, Weizhi Ma, Zhiyu He, Min Zhang, Yiqun Liu, Ming Yan, Ji Zhang. SiTunes: A Situational Music Recommendation Dataset with Physiological and Psychological Signals. Proceedings of the 2024 ACM SIGIR Conference on Human Information Interaction and Retrieval (CHIIR 2024). Zhefan Wang, Weizhi Ma, Min Zhang. To Recommend or Not: Recommendability Identification in Conversations with Pre-trained Language Models. The International Conference on Database Systems for Advanced Applications. (DASFAA 2024) Shenghao Yang, Weizhi Ma, Peijie Sun, Min Zhang, Qingyao Ai, Yiqun Liu, Mingchen Cai. Common Sense Enhanced Knowledge-based Recommendation with Large Language Model. The International Conference on Database Systems for Advanced Applications. (DASFAA 2024) Jiayu Li, Peijie Sun, Chumeng Jiang, Weizhi Ma, Qingyao Ai, Min Zhang. A Situation-aware Enhancer for Personalized Recommendation. The International Conference on Database Systems for Advanced Applications. (DASFAA 2024) Ziyi Ye, Xiaohui Xie, Qingyao Ai, Yiqun Liu, Zhihong Wang, Weihang Su, Min Zhang. Relevance Feedback with Brain Signals.",
  "content_length": 80266,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:10"
}