{
  "name": "Mina Guirguis",
  "homepage": "http://www.cs.txstate.edu/~mg65",
  "status": "success",
  "content": "Professor Mina Guirguis Mina S. Guirguis Professor Computer Science Department College of Science and Engineering Texas State University Email msg AT txstate DOT edu Phone/Fax 512-245-6384/(8750) Office Comal Building, office #307D.1 Address 601 University Drive, San Marcos, TX 78666 [Home | Publications | Teaching | Students | Professional Activities | Talks] Bio: Mina Guirguis is a Professor of Computer Science at Texas State University, which he joined in 2006. He directs the Intelligent Security Group. His research is broadly driven by the interplay of security, networks and stochastic control with research contributions in the areas of Cyber-Physical Systems (CPS), Networks and Computing Systems, and Mobile Cloud Computing. His research work has been published in over fifty refereed papers, posters and journals, and one book chapter. Guirguis' research and educational activities are funded with over $4.1M in grants from the NSF, DoD, AFOSR, DHS, IEEE, Cisco, U.S. Department of Education, and Texas State. Guirguis received the NSF CAREER award in 2012. Guirguis has been a visiting faculty researcher at the Air Force Research Laboratory (AFRL) in the summers of 2012 and 2013. During the academic year 2014/2015 he joined the Mobile and Pervasive Computing Group in the ECE Dept. at UT Austin. Guirguis has been a visiting scholar at the DHS Center for Risk and Economic Analysis of Terrorism Events (CREATE) in summer 2016. Guirguis has a wide range of industrial experience at various companies including Fortress Technologies and Microsoft. He has served on various Technical Program Committees for many conferences, on NSF panels and on the Editorial Board for the International Journal on Advances in Networks and Services. Guirguis is serving as an Academic Alliance Member for NCWIT and as a Senior Research Fellow in the LBJ Institute for STEM Education and Research. Guirguis earned his B.Sc. in Computer Science and Automatic Control at Alexandria University in 1999, his M.A. in Computer Science at Boston University in 2005 and his Ph.D. in Computer Science at Boston University in 2007 under Azer Bestavros and Ibrahim Matta. Research Interests: Security Aspects in Mobile Cyber-Physical Systems Mobile Cloud Computing Cybersecurity Digital Forensics Research Opportunities: Multiple research positions are available at the undergraduate and graduate levels (MS and Ph.D.) in the area of cybersecurity with the focus on applications in Cyber-Physical Systems, Wireless Networks and Cloud Computing. Check here to learn more about some of the past and ongoing research projects and our Research Group Webpage to see some of our latest publications and news. Please contact me by email if interested. Office Hours (Fall 2025): Mondays: 11:00 am - noon. Wednesdays: 2:00 pm - 4:30 pm. Also, by appointment. CV: PDF Page last updated -- Oct 2025",
  "content_length": 2875,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:17"
}