{
  "name": "Mina Tahmasbi",
  "homepage": "https://mina.arashloo.net",
  "status": "success",
  "content": "Mina Tahmasbi Arashloo Bio Teaching Papers Recognition Advising Professional Service Misc Mina Tahmasbi Arashloo Assistant Professor Canada Research Chair in Minimizing Human Error in Modern Networks Cheriton School of Computer Science, University of Waterloo Email: mina (dot) arashloo (at) uwaterloo.ca Office: DC 3510 CV (last updated January 2025) I am an assistant professor at the Cheriton School of Computer Science at University of Waterloo and a Canada Research Chair in \"Minimizing Human Error in Modern Networks\". Before joining Waterloo, I was a Presidential Post-Doctoral Fellow at the computer science department of Cornell University, working with Nate Foster, and Rachit Agarwal. I received my PhD in computer science from Princeton University, where I was advised by Jennifer Rexford. I got my B.Sc degree in Computer Engineering from department of Computer Engineering at Sharif University of Technology. Research Interests: I am primarily interested in networked systems, with a focus on software defined networking (SDN) and programmable data planes. I explore how to make networks more robust by developing tools for automated analysis of network functionality, generating correct and efficient implementations on high-speed network hardware, and monitoring for validation purposes at run-time. Personal: My other half, Sepehr Assadi, does theoretical computer science at University of Waterloo. Prospective Students: I am looking for highly-motivated students to join my lab! If you are interested in working with me, please make sure to list my name as a potential advisor in your application. Getting in touch: If you are interested in research positions in our group, please fill out the corresponding google form as described below. Unfortunately, I may not be able to respond to any other types of communication regarding graduate admissions. MMath and PhD positions Undergraduate research positions Teaching Current: CS 456/656: Computer Networks (Fall 2025) All: CS 456/656: Computer Networks: [Fall 2024][Fall 2023] CS 856: Programmable Networks: [Winter 2025][Winter 2024][Winter 2023] Advising I am very fortunate to work with the following students: Current Students: Nesa Abbasi (MMath @ UWaterloo) Amir Seyhani (PhD @ UWaterloo) Kimiya Mohammadtaheri (MMath → PhD @ UWaterloo) Pedro Mizuno (MMath → PhD @ UWaterloo) Beihao Zhou (Undergraduate @ UWaterloo) Alumni: Linfan Qian (Undergraduate @ UWaterloo → MS @ Stanford) Crystal Zhou (Undergraduate @ UWaterloo → MEng @ Cornell Tech) Carol Duan (Undergraduate @ UWaterloo → Google) Papers Preprints A Target-Agnostic Protocol-Independent Interface for the Transport Layer Pedro Mizuno, Kimiya Mohammadtaheri, Linfan Qian, Joshua Johnson, Danny Akbarzadeh, Chris Neely, Mario Baldi, Nachiket Kapre, Mina Tahmasbi Arashloo [Paper] Conferences and Workshops Toward eBPF-Accelerated Pub-Sub Systems SIGCOMM eBPF Workshop 2025 Beihao Zhou, Samer Al-Kiswany, Mina Tahmasbi Arashloo [Paper] Buffy: A Formal Language-Based Framework for Network Performance Analysis HotNets 2024 Amir Seyhani, Junyi Zhao, Aarti Gupta, David Walker, Mina Tahmasbi Arashloo [Paper] Formal Methods for Network Performance Analysis NSDI 2023 Mina Tahmasbi Arashloo, Ryan Beckett, Rachit Agarwal [Paper] dcPIM: Near-Optimal Proactive Datacenter Transport SIGCOMM 2022 Qizhe Cai, Mina Tahmasbi Arashloo, Rachit Agarwal [Paper] Modular Switch Programming under Resource Constraints NSDI 2022 Mary Hogan, Shir Landau-Feibish, Mina Tahmasbi Arashloo, Jennifer Rexford, David Walker [Paper] [NSDI'22 Talk] Towards Formally Verifying Congestion Control Behavior SIGCOMM 2021 Venkat Arun, Mina Tahmasbi Arashloo, Ahmed Saeed, Mohammad Alizadeh, Hari Balakrishnan [Paper] [SIGCOMM'21 Talk] DBVal: Validating P4 Data Plane Runtime Behavior SOSR 2021 K Shiv Kumar, Ranjitha K, P S Prashanth, Mina Tahmasbi Arashloo, Venkanna U., Praveen Tammana [Paper] Petr4: Formal Foundations for P4 Data Planes POPL 2021 Ryan Doenges, Mina Tahmasbi Arashloo, Santiago Bautista, Alexander Chang, Newton Ni, Samwise Parkinson, Rudy Peterson, Alaia Solko-Breslin, Amanda Xu, Nate Foster [Paper][POPL'21 Talk] Elastic Switch Programming with P4All HotNets 2020 Mary Hogan, Shir Landau-Feibish, Mina Tahmasbi Arashloo, Jennifer Rexford, David Walker, Rob Harrison [Paper] [HotNets'20 Talk] Enabling Programmable Transport Protocols in High-Speed NICs NSDI 2020 Mina Tahmasbi Arashloo, Alexey Lavrov, Manya Ghobadi, Jennifer Rexford, David Walker, David Wentzlaff [Paper] [NSDI'20 Talk] Tracking P4 Program Execution Path in the Data Plane SOSR 2020 Best Paper Award Suriya Kodeswaran, Mina Tahmasbi Arashloo, Praveen Tammana, Jennifer Rexford [Paper] [SOSR'20 Talk] A Scalable VPN Gateway for Multi-Tenant Cloud Services SIGCOMM Computer Communication Review 2018 Mina Tahmasbi Arashloo, Pavel Shirshov, Rohan Gandhi, Guohan Lu, Lihua Yuan, Jennifer Rexford [Paper] HotCocoa: Hardware Congestion Control Abstraction HotNets 2017 Mina Tahmasbi Arashloo, Manya Ghobadi, Jennifer Rexford, David Walker [Paper] [HotNets'17 Talk] SNAP: Stateful Network-wide Abstractions for Packet Processing SIGCOMM 2016 Mina Tahmasbi Arashloo, Yaron Koral, Michael Greenberg, Jennifer Rexford, David Walker [Paper] [Technical Report] [SIGCOMM'16 Talk] [Longer Talk at NPI] Compiling Path Queries NSDI 2016 Srinivas Narayana, Mina Tahmasbi Arashloo, Jennifer Rexford, David Walker [Paper] [Project Website] [NSDI'16 Talk] Thesis & Misc. Stateful Programming of High-Speed Network Hardware PhD Dissertation, June 2019 ACM SIGCOMM Dissertation Award Mina Tahmasbi Arashloo [Dissertation] Selected Awards and Recognition Canada Research Chair in “Minimizing Human Error in Operating Modern Networks” (Tier 2) (2024 - present) Rising Stars in Networking and Communication by N2Women (2021) Cornell Presidential Post-Doctoral Fellow (2019 - 2022) ACM SIGCOMM Dissertation Award (2019) Siebel Scholar (Class of 2019) Rising Stars in EECS at MIT (2018) School of Engineering and Applied Sciences (SEAS) Award of Excellence by Princeton University (2017) Professional Service Program Co-Chair - P4 Workshop (2023) - Symposium on SDN Research (SOSR) (2022) - The N2Women Workshop at SIGCOMM (2022) Program Committee Member - USENIX NSDI (2026) - ACM SIGCOMM (2025) - ACM HotNets (2024) - ACM SIGCOMM (2024) - ACM CoNEXT (2024) - ACM SIGMETRICS (2024) - USENIX NSDI (2024) - USENIX NSDI (2023) - ACM SoCC (2022) - ACM HotNets (2021) - ACM CoNEXT (2021) - ACM/IEEE ANCS (2021) - ACM SIGCOMM (2020) - ACM SIGCOMM Posters and Demos (2020) - Symposium on SDN Research (SOSR) (2019, 2020, 2021, 2022) - Asia-Pacific Workshop on Networking (2020, 2022) - P4 Workshop (2018, 2019, 2021) - EuroP4 Workshop (2020, 2021) Other Committees and Panels - ACM SIGCOMM Publication co-chair (2020) - NSF CNS Panel (2020) External Reviewer - Conferences: ASPLOS (External Review Committee, 2021), INFOCOM (2017) - Selected Journals: ACM SIGCOMM CCR, IEEE Transactions on Networking (TON), IEEE Transactions on Very Large Scale Integration Systems (TVLSI) Miscellaneous Performance Verification of Programmable Data Planes at the End-Host [pdf] An abstract for participation in US-Japan Workshop on Programmable Networking An Introduction to SmartNICs and their Use Cases [pdf] Presented as a guest lecture at the Computer Networks course at MIT",
  "content_length": 7322,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:13"
}