{
  "name": "Minchen Yu",
  "homepage": "https://mincyu.github.io",
  "status": "success",
  "content": "Minchen Yu (余旻晨) Minchen YuAssistant Professor@CUHK-SZ Follow Email LinkedIn Github Google Scholar ORCID I am an Assistant Professor in School of Data Science, The Chinese University of Hong Kong, Shenzhen. Prior to that, I received my PhD degree from Hong Kong University of Science and Technology, where I was advised by Prof. Wei Wang. I obtained my B.Eng. degree in Software Engineering from Nanjing University.Research InterestsMy research interests cover the broad area of cloud computing and distributed systems, with a special focus on serverless computing, big data and machine learning systems. Our current research projects include: Scalable ML and LLM inference systemsIntelligent cluster management on heterogeneous resourcesUsable and efficient serverless computing platformsProspective Students and Current OpeningsI am looking for self-motivated graduate students and research assistants (RAs) to work with me on the above topics. Please see here for the details.Recent/Selected Publications“Efficient Data Passing for Serverless Inference Workflows: A GPU-Centric Approach,” in EuroSys 2026.“Toppings: CPU-Assisted, Rank-Aware Adapter Serving for LLM Inference,” in USENIX ATC 2025.“Torpor: GPU-Enabled Serverless Computing for Low-Latency, Resource-Efficient Inference,” in USENIX ATC 2025.“Pheromone: Restructuring Serverless Computing with Data-Centric Function Orchestration,” in IEEE/ACM Transactions on Networking, 2024.“Following the Data, Not the Function: Rethinking Function Orchestration in Serverless Computing,” in USENIX NSDI 2023.“Gillis: Serving Large Neural Networks in Serverless Functions with Automatic Model Partitioning,” in IEEE ICDCS 2021. (Best Paper Runner Up) News2025/09: AdaSpec accepted to SoCC’25.2025/08: GRouter accepted to EuroSys’26.2025/04: Torpor and Toppings accepted to ATC’25.2024/10: One paper accepted to TON.2024/09: Serving on the PC of ICDCS’25. Please consider submitting.2024/07: Awarded CCF-Huawei Populus Grove Fund. Thanks CCF and Huawei!2024/04: Serving on the PC of NSDI’25. Please consider submitting.2023/12: I joined CUHK-SZ as an Assistant Professor.Useful LinksHow to Have a Bad Career in Research/Academia, by Prof. David PattersonHow to Read a Paper, by Prof. Srinivasan KeshavSystems Benchmarking Crimes, by Prof. Gernot Heiser",
  "content_length": 2304,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:13"
}