{
  "name": "Minchen Li",
  "homepage": "https://www.cs.cmu.edu/~minchenl",
  "status": "success",
  "content": "Minchen Li CV (2025/10) Minchen Li 李旻辰 Assistant Professor, CMU CSD, Carnegie Mellon Graphics Lab | Advisor, Genesis AI Ph.D., University of Pennsylvania, Computer and Information Science, 2020 M.Sc., University of British Columbia, Computer Science, 2018 B.Eng. (Hons), Zhejiang University, Computer Science and Technology, 2015 Research focus: Integrating Physics-Based Simulation with AI for Computer Graphics, Visual Computing, Robotics, and Computational Mechanics. Email | Google Scholar | Research Gate | Github | Twitter | Zhihu Biography Minchen is an Assistant Professor in the Computer Science Department at Carnegie Mellon University since 2023. Since 2025, he has also served as an advisor to Genesis AI. Previously, he was an Assistant Adjunct Professor at the UCLA Department of Mathematics, within the AIVC Lab. He completed his Ph.D. in 2020 from the SIG Center for Computer Graphics at the University of Pennsylvania, advised by Chenfanfu Jiang. Minchen's research accomplishments have been recognized with several prestigious awards, including the SCA Early Career Researcher Award (2024), the ACM SIGGRAPH Outstanding Doctoral Dissertation Award (2021), etc. He is an active member of the research community, regularly serving as a program committee member for conferences such as ACM SIGGRAPH, Eurographics, and SCA, as well as a reviewer for journals including ACM TOG, IEEE TVCG, and CMAME. Simulation Intelligence Group (SIG) The efficacy of solid and fluid simulation methods in the evolving landscape of visual computing, robotics, and manufacturing industries is fundamentally determined by robustness, efficiency, accuracy, and versatility. However, achieving a harmonious balance among these crucial characteristics remains an open challenge. The Simulation Intelligence Group (SIG) led by Minchen is committed to advancing the frontiers of physics-based simulation by striving for unprecedented levels of performance in all these areas, leveraging a comprehensive approach that combines numerical analysis, high-performance computing, and machine learning. SIG is part of Carnegie Mellon Graphics Lab. Members Minchen Li (Principal Investigator) Christina Contreras (Administrative Support) Guying Lin (CMU Ph.D. student) Juntian Zheng (CMU Ph.D. student) Michael Liu (CMU Ph.D. student) Zhaofeng Luo (CMU Ph.D. student) Yuhan Wu (Visiting Research Assistant, Ph.D. student at UTokyo) Trey Dubose (CMU MSCS student) Hanke Chen (CMU Undergrad) Alumni 2025: Yihao Shi (Visiting Research Assistant, Ph.D. student at ZJU), Mingxuan Liu (Undergrad Intern from THU), Qirui Fu (Graduate Intern from UPenn), Michael Liu (Visiting Research Assistant, Undergrad from UMich), Kevin You (CMU Undergrad), Justin Soza Soto (CMU MSME student) 2024: Kemeng Huang (Visiting Research Assistant, Ph.D. student at HKU), Bowen Ren (Undergrad Intern from THU), Zhaofeng Luo (Undergrad Intern from PKU), Yuqi Meng (Undergrad Intern from UMich), Huancheng Lin (Visiting Research Assistant, Ph.D. student at HKU), Zhitong Cui (Visiting Research Assistant, Ph.D. student at ZJU) 2023: Ruben Partono (CMU MSCS student), David Tang (CMU Undergrad) Opportunities We are eager to welcome highly motivated and skilled Ph.D. students! If you have a strong background relevant to our research areas and are interested in joining us, you can apply to any of the Ph.D. programs within the School of Computer Science. We recommend prioritizing the Ph.D. in Computer Science program and listing Minchen as a potential advisor. Here are some details about our Ph.D. stipends. Applications with fellowships from external sources are extremely welcome! Our group actively invites visiting students and scholars from around the globe to foster interdisciplinary collaborations. Prospective visits usually range between 6 to 12 months. As we can only fund a limited number of visitors, candidates are encouraged to explore alternative funds from their home institutions, third-party fellowships, etc. The availability of the positions is limited. If you are interested, please email us with the materials listed here. Students interested in a summer research internship/volunteer can directly email us within February and send their CV, transcripts, and specific research interests aligned with our research focus. We appreciate your understanding that, due to a high influx of emails, we may not be able to respond to all inquiries. If you are a CMU student interested in working with us, we strongly recommend embarking on this path by taking foundational and research-focused computer graphics courses, especially 15-362, 15-369, and 15-763. In 15-763, you will primarily work on a research-oriented course project focused on physics-based simulation, which can be combined with your own research. For undergrads and MS students, collaboration opportunities include independent studies, thesis projects, and summer internships through programs such as SURA and SURF, as dedicated time commitments are essential for successful research. Due to the limited number of positions in our group, we prioritize students who demonstrate outstanding performance in 15-763. We are also open to engaging in collaborations of any kind, both within academia and industry! Sponsors and Supporters Publications TRELLISWorld: Training-Free World Generation from Object Generators Hanke Chen, Yuan Liu, Minchen Li Arxiv 2510.23880 Preprint Physics-Based Simulation Minchen Li, Chenfanfu Jiang, Zhaofeng Luo, Wenxin Du, Chang Yu, Žiga Kovačič, Tianyi Xie Open-Source Online Book, 2025 Book (v1.0.2) Source Python Tutorial GPU Tutorial VR-Doh: Hands-on 3D Modeling in Virtual Reality Zhaofeng Luo*, Zhitong Cui* (equal contributions), Shijian Luo, Mengyu Chu, Minchen Li ACM Transactions on Graphics (SIGGRAPH), 2025 Project Page Video CK-MPM: A Compact-Kernel Material Point Method Michael Liu, Xinlei Wang, Minchen Li ACM Transactions on Graphics (SIGGRAPH), 2025 Paper + SuppDoc Video Code (CUDA and Taichi) StiffGIPC: Advancing GPU IPC for Stiff Affine-Deformable Simulation Kemeng Huang, Xinyu Lu, Huancheng Lin, Taku Komura, Minchen Li ACM Transactions on Graphics, 2025 (presentation at SIGGRAPH 2025) Paper + SuppDoc Video Code (CUDA) Penetration-free Solid-Fluid Interaction on Shells and Rods Jinyuan Liu*, Yuchen Sun* (equal contributions), Yin Yang, Chenfanfu Jiang, Minchen Li, Bo Zhu Arxiv 2505.12539 Preprint Barrier-Augmented Lagrangian for GPU-based Elastodynamic Contact Dewen Guo, Minchen Li, Yin Yang, Sheng Li, Guoping Wang ACM Transactions on Graphics (SIGGRAPH Asia), 2024 Paper Video A Dynamic Duo of Finite Elements and Material Points Xuan Li, Minchen Li, Xuchen Han, Huamin Wang, Yin Yang, Chenfanfu Jiang ACM SIGGRAPH 2024 Paper Video VR-GS: A Physical Dynamics-Aware Interactive Gaussian Splatting System in Virtual Reality Ying Jiang*, Chang Yu*, Tianyi Xie*, Xuan Li* (equal contributions), Yutao Feng, Huamin Wang, Minchen Li, Henry Lau, Feng Gao, Yin Yang, Chenfanfu Jiang ACM SIGGRAPH 2024 Project Page Unstructured Moving Least Squares Material Point Methods: A Stable Kernel Approach with Continuous Gradient Reconstruction on General Unstructured Tessellations Yadi Cao, Yidong Zhao, Minchen Li, Yin Yang, Jinhyun Choo, Demetri Terzopoulos, Chenfanfu Jiang Computational Mechanics, 2024 Preprint Mapped Material Point Method for Large Deformation Problems with Sharp Gradients and Its Application to Soil-Structure Interactions Yidong Zhao, Minchen Li, Chenfanfu Jiang, Jinhyun Choo International Journal for Numerical and Analytical Methods for Geomechanics (IJNAMG), 2024 Paper Power Plastics: A Hybrid Lagrangian/Eulerian Solver for Mesoscale Inelastic Flows Ziyin Qu, Minchen Li, Yin Yang, Chenfanfu Jiang, Fernando de Goes ACM Transactions on Graphics (SIGGRAPH Asia), 2023 Paper Video Subspace-Preconditioned GPU Projective Dynamics with Contact for Cloth Simulation Xuan Li, Yu Fang, Lei Lan, Huamin Wang, Yin Yang, Minchen Li, Chenfanfu Jiang ACM SIGGRAPH Asia 2023 Paper Video Neural Stress Fields for Reduced-order Elastoplasticity and Fracture Zeshun Zong, Xuan Li, Minchen Li, Maurizio M. Chiaramonte, Wojciech Matusik, Eitan Grinspun, Kevin Carlberg, Chenfanfu Jiang, Peter Yichen Chen ACM SIGGRAPH Asia 2023 Paper Video Augmented Incremental Potential Contact for Sticky Interactions Yu Fang*, Minchen Li* (equal contributions), Yadi Cao, Xuan Li, Joshuah Wolper, Yin Yang, Chenfanfu Jiang IEEE Transactions on Visualization and Computer Graphics (TVCG), 2023 Paper Video Multi-Layer Thick Shells Yunuo Chen, Tianyi Xie, Cem Yuksel, Danny M. Kaufman, Yin Yang, Chenfanfu Jiang, Minchen Li ACM SIGGRAPH 2023 Paper SuppDoc Video A Contact Proxy Splitting Method for Lagrangian Solid-Fluid Coupling Tianyi Xie, Minchen Li, Yin Yang, Chenfanfu Jiang ACM Transactions on Graphics (SIGGRAPH), 2023 Paper SuppDoc Video Second-order Stencil Descent for Interior-point Hyperelasticity Lei Lan, Minchen Li, Chenfanfu Jiang, Huamin Wang, Yin Yang ACM Transactions on Graphics (SIGGRAPH), 2023 Paper Video A Sparse Distributed Gigascale Resolution Material Point Method Yuxing Qiu, Samuel T. Reeve, Minchen Li, Yin Yang, Stuart R. Slattery, Chenfanfu Jiang ACM Transactions on Graphics, 2022 (presentation at SIGGRAPH 2023) Paper Video Efficient Learning of Mesh-Based Physical Simulation with Bi-Stride Multi-Scale GNN Yadi Cao, Menglei Chai, Minchen Li, Chenfanfu Jiang International Conference on Machine Learning (ICML), 2023 Paper Code (Python) Reconfigurable Data Glove for Reconstructing Physical and Virtual Grasps Hangxin Liu, Zeyu Zhang, Ziyuan Jiao, Zhenliang Zhang, Minchen Li, Chenfanfu Jiang, Yixin Zhu, Song-Chun Zhu Engineering, 2023 Paper Project Page TPA-Net: Generate A Dataset for Text to Physics-Based Animation Yuxing Qiu, Feng Gao, Minchen Li, Govind Thattai, Yin Yang, Chenfanfu Jiang Arxiv 2211.13887 Preprint Gallery PlasticityNet: Learning to Simulate Metal, Sand, and Snow for Optimization Time Integration Xuan Li, Yadi Cao, Minchen Li, Yin Yang, Craig",
  "content_length": 17307,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:17"
}