{
  "name": "Ming Liu 0027",
  "homepage": "https://mgliu.sites.cs.wisc.edu",
  "status": "success",
  "content": "Ming Liu mgliu I am an Assistant Professor in the Computer Sciences Department at the University of Wisconsin-Madison since 2021. Iâm a member of the NetLab and madNets groups. I study networking and systems, with a focus on building efficient, robust, and practical networked systems. My work is driven by emerging hardware infrastructures, such as load-store interconnects, disaggregated storage, and programmable networks. I am actively looking for students. If you are interested, feel free to email me. Â Research Recently, we build applications, systems, protocols, and utilities for composable rack-scale infrastructures. Load-Store Interconnect ChipletNet proposes Server Chiplet Networking and unearths its characteristics (HotNetsâ25). PathFinder tracks and analyzes CXL.mem using Intel PMUs (SIGCOMMâ25). MegaStation realizes the MIMO baseband processing on a single-node supercomputer (NSDIâ25). rPCIeBench develops a benchmarking framework to characterize Routable PCIe (NSDIâ24). Disaggregated Storage SANarch compares the switched and switchless architecture for disaggregated SAN (NSDIâ26). GluonFS ranked 26th in the 10-node category of IO500 and 33rd overall. ntprof is a profiling utility for characterizing and analyzing the NVMe-over-TCP protocol (NSDIâ25). Flint builds an elastic block storage over EBOFs using shadow views (NSDIâ25). LEED develops a low-power and fast key-value store over SmartNIC JBOFs (SIGCOMMâ23). Programmable Network SCR provides a framework enabling packet-granular software control over the harware transport (NSDIâ25). RpcNIC is a software-hardware co-designed SmartNIC-native accelerator for the RPC stack (HPCAâ25). LogNIC develops a high-level performance model for SmartNICs (MICROâ23). Students Zerui Guo, Wentao Hou, Yuyuan Kang, Joontaek Oh (postdoc) Service Program Committee Member: NSDI 2026, ASPLOS 2026, APNet 2025, SOSP 2024, HotInfra 2024, APNET 2024, OSDI 2024, NSDI 2024, HotInfra 2023, APNET 2023, SYSTOR 2023, SIGCOMM 2022, SYSTOR 2021",
  "content_length": 2027,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:22"
}