{
  "name": "Minglu Li 0001",
  "homepage": "http://www.acem.sjtu.edu.cn/en/faculty/luming.html",
  "status": "success",
  "content": "Faculty - Antai College of Economics & Management, Shanghai Jiao Tong University Location: Home Faculty & Research Faculty Overview Ming LU Department:Economics Phone:+86 (0)21 52301219 Title:Professor Email:luming1973@sjtu.edu.cn Profile Ming LU is Distinguished Professor of Economics, Director of Shanghai Institute for National Economy (SHINE), and research fellow of China Institute of Urban Governance at Shanghai Jiao Tong University.  He is appointed as a member of the National \"15th Five Year Plan\" Expert Committee and a member of the Shanghai Decision Making Advisory Committee. He worked as a professor at Fudan University, and as a Fulbright Scholar at Harvard University and National Bureau of Economic Research (NBER). He has consulted for the World Bank and Asian Development Bank. His research covers regional and urban-rural development, labor economics and Chinese economy. Recently, his work evaluates the urban and regional development policies, and their effects on resource allocation and economic sustainability from a perspective of spatial political economics.Web: www.profluming.com Fold Research Professor Lu Ming's research areas include Chinese economy, urban-rural and regional development, labor economics, and social economics. In recent years, his research has mainly focused on evaluating urban and regional development policies, and providing strategic thinking from urban economics and spatial economics to promote domestic market integration and high-quality economic development in China. Professor Lu Ming is committed to combining the political and economic analysis of policy formation with the new economic geography of urban and regional development, and forming a research direction of \"spatial political economy\" through a series of studies. This series of studies focuses on analyzing the agglomeration of production factors, human capital accumulation, and service development mechanisms in urban and regional development. At the same time, he investigates how political and economic factors affect market integration and have a series of consequences on the quality of economic development. In recent years, Professor Lu Ming has been promoting the combination of structural economic models with reduced-form econometric analysis to deepen research on regional economic development. Professor Lu Ming is also promoting the use of big data to study the spatial structure of cities and urban systems. Professor Lu Ming's research achievements have had an important impact on the ongoing reform of urbanization, household registration system, land system, regional development, etc. At the same time, he has also carried out extensive and in-depth research cooperation with industries and enterprises related to urban digital transformation.Professor Lu Ming has published academic works such as \"The Power of Space\", \"Governance of Great Powers: Spatial Political Economy of Development and Balance\" (co-authored), \"Great Power Economics\" (co-authored), \"China's Economic Development: Institutions, Growth and Imbalances\" (co-authored), \"China's Regional Development: Review and Prospect\" (co-edited), \"A New Economic Growth Engine for China\" (co-edited), \"Market Integration and Industrial Agglomeration in China's Regional Economic Development\", and popular works such as \"Great Nation Needs Big Cities\" and \"Centripetal Cities\". Professor Lu Ming's research achievements have won multiple awards, including the National Excellent Doctoral Dissertation Award, the Shanghai Philosophy and Social Sciences, the Ministry of Education's Excellent Achievement Award for Humanities and Social Sciences Research in Chinese Universities, and the China Soft Science Award. The honors received include \"Outstanding Talents of the New Century\" by the Ministry of Education, \"Dawn Scholar\" by the Shanghai Municipal Education Commission (2005), \"Leading Talent of Shanghai\" (2009), \"Top Ten Young Economic Figures of Shanghai\" (2010), and National-level Talent Award by the Ministry of Education (2020). Fold Teaching Economics in Contemporary China (graduates and MBA) ï¼Economic Principals and the Chinese Economy (undergraduates) Fold",
  "content_length": 4176,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:20"
}