{
  "name": "Mingyu Xiao 0001",
  "homepage": "https://sites.google.com/site/myxiao",
  "status": "success",
  "content": "Mingyu Xiao's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationMingyu Xiao's HomepageMingyu XIAO  Ph.D.(CUHK), Professor(UESTC)ProfessorSchool of Computer Science and EngineeringUniversity of Electronic Science and Technology of ChinaChengdu 611731, CHINAEmail: myxiao (at) gmail (dot) comResearch Interests:Parameterized and exact algorithms, Graph algorithms and graph theory, Optimization, Mechanism design, and others. About MeI am a professor and vice dean with the School of Computer Science and Engineering, University of Electronic Science and Technology of China (UESTC), Chengdu, China.  I received my Ph.D in computer science from The Chinese University of Hong Kong under the supervision of Professor Andrew Chi-Chih Yao and Professor Leizhen Cai in 2008. I received my M.S and B.S in mathematics from Central South University in 2005 and 2002, respectively. Professor Bakh Khoussainov and I are leading the Algorithms and Logic Lab in UESTC.Now, I am serving as the chair of Theoretical Computer Science Committee in China Computer Federation (CCF).We will hold WALCOM 2025 and COCOON 2025 at Chengdu. Please submit your nice papers.The 19th International Conference and Workshop on Algorithms and Computation (WALCOM 2025) will be held during Feburary 28 - March 2, 2025 in Chengdu, China.The 31st International Computing and Combinatorics Conference (COCOON 2025) will be held  during August 15-17, 2025 in Chengdu, China. Current Research TopicsSocial choice and mechanism design; Optimization problems from AI and Operations Research (A project on vehicle rounting is supported by NSFC);Methods for designing polynomial and linear kernels (A project on new techniques for kernelization is supported by NSFC);Methods for designing exact and parameterized algorithms (A project on the measure-and-conquer method is supported by NSFC);Efficient algorithms for problems with applications. TeachingAlgorithms and Computation Theory   (for undergradute students)        2025Combinatorics  (for undergradute students)                                                           2024-2025Advanced Topics in Computation  (for undergradute students)                  2016-2024Analysis and Design for Algorithms   (for gradute students)                         2013-nowAlgorithm Engineering  (for gradute students)                                                      2022Topics in ACM Programming Contest  (for undergradute students)         2009-2011C++  Programming    (for gradute students)                                                             2009 -2016Publications1. Some selected publications can be found here.2. My publications indexed by DBLP.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2764,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:25"
}