{
  "name": "Ming-Chang Yang",
  "homepage": "http://www.cse.cuhk.edu.hk/~mcyang",
  "status": "success",
  "content": "YANG, Ming-Chang (楊明昌) Brief Autobiography Ming-Chang Yang is currently an Associate Professor at the Department of Computer Science and Engineering, The Chinese University of Hong Kong. He received his B.S. degree from the Department of Computer Science at National Chiao-Tung University, Hsinchu, Taiwan, in 2010. He received his Master and Ph.D. degrees (supervised by Professor Tei-Wei Kuo) from the Department of Computer Science and Information Engineering at National Taiwan University, Taipei, Taiwan, in 2012 and 2016, respectively. From Aug. 2015 to July 2016, he was a visiting scholar in Department of Computer Science and Engineering, University of Minnesota, Twin Cities, USA. From Jan. 2017 to July 2017, he was a postdoctoral research fellow at Institute of Information Science (IIS), Academia Sinica, Taipei, Taiwan. His primary research interests include emerging non-volatile memory and storage technologies, memory and storage systems, and the next-generation memory/storage architecture designs. Dr. Yang has published more than 90 research papers, which were mainly published in top journals (e.g., IEEE TC, IEEE TCAD, IEEE TVLSI, ACM TOS, and ACM TECS) and top conferences (e.g., ACM SOSP, USENIX OSDI, USENIX FAST, USENIX ATC, ACM ASPLOS, IEEE HPCA, ACM/IEEE DAC, ACM/IEEE ICCAD, ACM/IEEE CODES+ISSS, and ACM/IEEE EMSOFT) and received 3 best paper awards (from ACM/IEEE CASES 2025, ACM/IEEE ISLPED 2020, and IEEE NVMSA 2019). Also, he was awarded TSIA PhD Student Semiconductor Award from Taiwan Semiconductor Industry Association (TSIA) in 2016, because of his research achievements on flash memory. Dr. Yang serves as the associate editor for ACM Transactions on Cyber-Physical Systems (TCPS) and IEEE Technical Committee on Cyber-Physical Systems (TCCPS). He also serves as a program committee member for many international conferences (e.g., ACM SOSP, USENIX FAST, USENIX ATC, IEEE HPCA, ACM/IEEE DAC, ACM/IEEE ICCAD, ACM/IEEE CODES+ISSS, ACM/IEEE ASP-DAC, and IEEE NVMSA), and as a reviewer for premier journals (e.g., IEEE TC, TCAD, TKDE, and TVLSI as well as ACM TACO, TECS, and TOS). He is also an invited speaker for many prestigious conferences, universities, and institutes. Selected Honors and Awards Best Paper Award, ACM/IEEE International Conference on Compilers, Architectures, and Synthesis for Embedded Systems (CASES) 2025. (2025/10) Best Paper Award, ACM/IEEE International Symposium on Low Power Electronics and Design (ISLPED) 2020. (2020/08) Best Paper Award, IEEE Non-Volatile Memory Systems and Applications Symposium (NVMSA) 2019. (2019/08) Postdoctoral Research Fellow Award, Academia Sinica. (2016/12) TSIA Semiconductor Award (PhD Graduate Student), Taiwan Semiconductor Industry Association (TSIA) (2016/09) Contact E-mail:\tmcyang[at]cse.cuhk.edu.hk Phone:\t(852) 3943-8405 Office:\tRm 906, Ho Sin Hang Engineering Building Consultation Hours:\tT15:30–17:30",
  "content_length": 2916,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:17"
}