{
  "name": "Ming Zhao 0002",
  "homepage": "https://search.asu.edu/profile/2740006",
  "status": "success",
  "content": "Ming Zhao | ASU Search Ming Zhao Associate Professor, School of Computing and Augmented Intelligence Other ASU affiliations Center for Cybersecurity and Trusted Foundations Affiliates Associate Professor, Course Director Fundamentals of AI and Course Director Applications in ME 2, John Shufeldt School of Medicine and Medical Engineering [email protected] Phone: 480-727-7850 ‌ BYENG 412 Temp, AZ 85287 Mail code: 8809 Campus: Tempe ‌ Long Bio Director, Research Laboratory for Virtualized Infrastructures, Systems, & Applications (VISA)Director, ASU NSF IUCRC Center for Accelerated Real Time Analytics (CARTA)Honors Faculty, SCENE MentorSchool of Computing and Augmented Intelligence (SCAI)John Shufeldt School of Medicine and Medical Engineering (affiliated)Arizona State University Dr. Ming Zhao's (''Dr. Z'') directs the Center for Accelerated Real Time Analytics (CARTA) and the Research Lab for Virtualized Infrastructure, Systems, and Applications (VISA). His research interests are in experimental computer systems, including cloud/edge, big-data/machine-learning, and high-performance computing systems as well as operating systems and storage systems in general. He is also highly interested in the cross-disciplinary studies that bridge systems research with other domains, and he has worked with applications from computational physics and chemistry, each sciences, biomedicine, neuroscience, transportation, social science and psychology etc. Dr Z has received the National Science Foundation CAREER award, ASEE Air Force Summer Faculty Fellowship, AWS Machine Learning Research Award, VMware Faculty Award, Intel Faculty Award, Excellence in Mentoring award, Excellence in Research award, and Best Paper award of the International Conference on Autonomic Computing. His PhD students have received the McKnight Doctoral Fellowship, ASEE Air Force Summer Student Fellowship, VMware Graduate Fellowship, and SCAI Doctoral Fellowship. Dr. Z is a Senior Associate Editor of ACM Transactions on Storage (TOS) and an Associate Editor of the Frontiers in High Performance Computing. He served as the General Chair for ACM HPDC, a top conference on high performance distributed computing and General Co-Chair for ACM/IEEE SEC, the flagship conference on edge computing. He also served on the review board of the Natural Sciences and Engineering Research Council of Canada (NSERC) which is the largest funder of scientific research in Canada. Education Ph.D. Electrical and Computer Engineering, University of Florida 2008 M.S. Pattern Recognition and Intelligent Systems, Automation, Tsinghua University, China 2001 B.S. Automation, Tsinghua University, China 1999 Research Website URL https://visa.lab.asu.edu Google Scholar URL https://scholar.google.com/citations?user=pAcF2lEAAAAJ Research Interests Dr. Z's research efforts are targeted to generate both fundamental scientific values and practical societal impacts. I have published over 90 peer-reviewed articles on premiere computer systems conferences and journals, which have been cited more than 3200 times. His research outcomes have also been adopted by several production systems in the industry. His research has been funded by the National Science Foundation, the Department of Homeland Security, the Department of Defense, and industry companies. Research Group CARTA is an NSF-funded Industry-University Cooperative Research Center (IUCRC) that addresses the challenges in real-time data analytics and machine learning using accelerated and next-generation systems. Faculty, spread across four university sites of ASU, Rutgers, UMBC, and U. of Miami participate in collaborative research funded by industry partners who are members of the Center. The fundamental goal of the VISA Research Lab is to explore innovative techniques in virtualization and autonomics in order to effectively utilize the resources in large-scale, dynamic, and complex computing systems and to support the efficient, robust, and secure computing of challenging applications from different domains. Currently, our team is focusing on the projects related to cloud computing, high-performance computing, and big data as well as operating systems and storage systems in general. Teaching Website URL https://visa.lab.asu.edu/web/education/ Courses 2026 Spring Course Number Course Title CSE 599 Thesis CSE 590 Reading and Conference CSE 546 Cloud Computing 2025 Fall Course Number Course Title CSE 599 Thesis CSE 795 Continuing Registration CSE 590 Reading and Conference CSE 580 Practicum CEN 795 Continuing Registration CSE 330 Operating Systems DSE 580 Practicum CSE 599 Thesis DSE 799 Dissertation CSE 330 Operating Systems CSE 330 Operating Systems CSE 330 Operating Systems CSE 330 Operating Systems CSE 799 Dissertation CEN 690 Reading and Conference 2025 Summer Course Number Course Title CSE 595 Continuing Registration CEN 795 Continuing Registration CSE 595 Continuing Registration 2025 Spring Course Number Course Title CSE 493 Honors Thesis CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 790 Reading and Conference CSE 792 Research CEN 799 Dissertation CEN 795 Continuing Registration CSE 546 Cloud Computing DSE 792 Research DSE 799 Dissertation 2024 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 493 Honors Thesis CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CEN 580 Practicum CEN 790 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration CSE 790 Reading and Conference CSE 330 Operating Systems CSE 330 Operating Systems CSE 330 Operating Systems CSE 792 Research CSE 330 Operating Systems CEN 795 Continuing Registration CSE 330 Operating Systems CSE 330 Operating Systems CSE 593 Applied Project 2024 Summer Course Number Course Title CSE 584 Internship CSE 595 Continuing Registration CSE 795 Continuing Registration CSE 790 Reading and Conference CSE 792 Research CSE 795 Continuing Registration CEN 584 Internship CEN 795 Continuing Registration CSE 595 Continuing Registration CSE 595 Continuing Registration 2024 Spring Course Number Course Title CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 790 Reading and Conference CEN 790 Reading and Conference CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 599 Thesis CSE 792 Research CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 795 Continuing Registration CSE 584 Internship CSE 546 Cloud Computing CEN 795 Continuing Registration 2023 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 493 Honors Thesis CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 580 Practicum CEN 580 Practicum CEN 790 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration CSE 790 Reading and Conference CEN 799 Dissertation CSE 531 Distrib/Multiprocess Oper Sys CEN 795 Continuing Registration 2023 Summer Course Number Course Title CSE 595 Continuing Registration CSE 795 Continuing Registration CSE 584 Internship CSE 790 Reading and Conference CSE 792 Research CSE 795 Continuing Registration CEN 584 Internship CEN 795 Continuing Registration CSE 595 Continuing Registration CSE 595 Continuing Registration 2023 Spring Course Number Course Title CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 790 Reading and Conference CSE 595 Continuing Registration CEN 790 Reading and Conference CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 599 Thesis CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 795 Continuing Registration CSE 584 Internship CEN 584 Internship 2022 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 493 Honors Thesis CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 580 Practicum CEN 580 Practicum CEN 790 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration CEN 799 Dissertation 2022 Summer Course Number Course Title CSE 795 Continuing Registration CSE 584 Internship CSE 795 Continuing Registration CEN 584 Internship CEN 795 Continuing Registration CSE 595 Continuing Registration CSE 595 Continuing Registration 2022 Spring Course Number Course Title CSE 330 Operating Systems CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 790 Reading and Conference CSE 595 Continuing Registration CEN 790 Reading and Conference CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 599 Thesis CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 795 Continuing Registration CSE 330 Operating Systems CSE 330 Operating Systems CSE 330 Operating Systems CSE 330 Operating Systems CSE 493 Honors Thesis CSE 584 Internship CEN 584 Internship CSE 546 Cloud Computing 2021 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 493 Honors Thesis CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 580 Practicum CEN 580 Practicum CEN 790 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration CSE 792 Research 2",
  "content_length": 12021,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:18"
}