{
  "name": "Minghan Wei",
  "homepage": "https://minghanwei.github.io",
  "status": "success",
  "content": "Welcome to my homepage Minghan WeiScalable Intelligence for Motion and Autonomy (SIMA) LabDepartment of Electrical Engineering and Computer ScienceFlorida Atlantic University Follow Email Google Scholar Short BiographyHello, I am Minghan Wei, an assistant professor in EECS department at FAU. I received my Ph.D. degree in Jan, 2022 from the Department of Computer Science and Engineering, University of Minnesota, under the supervision of Prof. Volkan Isler.My research interests are in the general area of Robotics perception, mapping, planning, and control for practical indoor and field applications such as precision agriculture and environmental monitoring.One focus of my research is to study how to improve the energy efficiency of robots in these applications.I study how to apply learning-based methods to predict energy-cost maps so that energy-optimal paths can be planned.I study and design energy-aware path planning algorithms to minimize total energy consumption.I also implement practical robotic systems, e.g. autonomous robot mowers, for these applications. NewsJune, 2025: Excited to share that our NSF proposal “CRII: FRR: Towards Energy-optimal Multi-Robot Navigation for Time-critical Field Tasks” has been awarded!June, 2023: I will be joining Florida Atlantic University on August 7, 2023 as an assistant professor to pursue my robotics research.June, 2022: I have joined Google as a Software Engineer in the Augmented Reality - Motion tracking team.Jan, 2022: I have joined iRobot as a Senior Robotics Software Engineer working on the mapping and planning for the autonomous vacuum cleaners.June, 2021: This summer I would be a Data Science intern at 3M.Jan, 2020: I would be a Research Intern from January to August at Samsung Research America - New York. Education University of Minnesota - Twin Cities PhD, Computer Science, Aug 2016 - Jan 2022 Minneapolis, MN, US Australian National University Exchange Student, July 2014 - December 2014 Canberra, Australia Nanjing University of Science and Technology B.E. in Computer Science and Technology, Sep 2012 - June 2016 Nanjing, China Experiences  Assistant Professor, Florida Atlantic University Aug 2023 - Present, Boca Raton, FL   Software Engineer, Google Jun 2022 - June 2023, Mountain View, CA   Senior Robotics Software Engineer, iRobot Jan 2022 - Jun 2022, Remote   Data Science Intern, 3M June 2021 - Aug 2021, Remote   Research Intern, Samsung Research America - New York Jan 2020 - Aug 2020, New York, NY   Summer Intern, Robotics Institute, CMU June 2015 - Sep 2015, Pittsburgh, PA More About MeMy wife and I like playing video games together, e.g. Fortnite in duos mode, It Takes Two, Mario Kart.We also like outdoor activities, such as tubing, kayaking in national or state parks.We have two cats at home.",
  "content_length": 2795,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:20"
}