{
  "name": "Mingming Fan 0001",
  "homepage": "http://www.mingmingfan.com",
  "status": "success",
  "content": "Mingming Fan, Ph.D. Top Mingming Fan, Ph.D. About Paper Awards Research Services Teaching Mingming Fan is an Associate Professor (with tenure) in Computational Media and Arts Thrust and Internet of Things Thrust at The Hong Kong University of Science and Technology (Guangzhou) (HKUST(GZ)), with a joint appointment in HKUST. He earned a Ph.D. from Department of Computer Science at the University of Toronto. He leads Augmenting People via Empowering X (APEX) Group to conduct Human-Computer Interaction (HCI) research by exploring the design principles, interaction techniques and applications of Accessibile Computing, Human-AI Interaction and VR/AR/MR, in particular for addressing aging, accessibility, and education/learning challenges. His group publishes scientific papers in top venues in HCI and has won Best Paper Award, Oustanding Paper Award, and Honorable Mention Award from CHI, ACM Multimedia, UbiComp and Chinese CHI as well as a Best Artefact Award from ASSETS. He regularly serves in various roles for top HCI venues, such as CHI, TOCHI, IMWUT, CSCW, UIST, ASSETS and DIS. 范明明，现任香港科技大学（广州）计算媒体与艺术学域和物联网学域长聘副教授、博士生导师，香港科技大学综合系统与设计系合聘副教授。于多伦多大学计算机科学系获博士学位。研究领域智能人机交互，主要研究方向：1）无障碍赋能技术(Assistive Technology)；2）人智交互（Human-AI Interaction)；3）虚拟与增强现实(VR/AR/MR)。已发表中国计算机学会（CCF）推荐A类（CCF A）期刊与会议论文80余篇，获国际论文奖10余次，包括人机交互顶会ACM CHI“最佳论文奖”与“最佳论文荣誉提名奖”(4次)、ACM Multimedia“杰出论文奖”与“最佳论文荣誉提名奖”、ACM UbiComp“最佳论文荣誉提名奖”等 。获华人华侨人机交互协会“Young Pioneer Award”，入选首届CCF人机交互专委“青年科技激励计划”。长期服务于国际与国内人机交互社区，如ACM ASSETS 2026程序委员会主席，ACM CHI子委员会主席(Subcommittee Chair)，IMWUT和CSCW论文奖评委，CCF人机交互专委执行委员，CCF虚拟现实与可视化技术专委委员，CCF普适计算专委委员，中国残疾人康复协会康复工程与辅具技术专业委员会委员等。 Paper Awards ACM MM 2025 Outstanding Paper Award Proposed and studied four interaction modes for AI agents and human to exchange diverse perspectives ACM MM 2024 Best Paper Honorable Mention Award Invented a VR-Mediated Cognitive Defusion for Managing Negative Thoughts CHI 2024 Best Paper Honorable Mention Award Invented a novel electrotactile wearable on fingertip edges to help Blind and Low Vision (BLV) People comprehend charts CHI 2024 Best Paper Honorable Mention Award Designed an AI- and AR-powered app to assist BLV People to use digital-screen parcel lockers CHI 2024 Best Paper Honorable Mention Award Promoting traditional Chinese cultural heritage by assisting traditional Chinese opera (Xiqu) performers CHI 2023 Best Paper Honorable Mention Award Invented a novel voice-accompanying hand-to-face gesture interaction technique Chinese CHI 2023 Best Paper Honorable Mention Award Invented an AR-based approach to help with the learning of Chinese traditional opera (Xiqu) makeup Chinese CHI 2022 Best Paper Honorable Mention Award A systematic review of communication in immersive social Virtual Reality (VR) ASSETS 2020 Best Artifact Award Invented a novel eyelid gesture interaction for people with motor impairments to use touchscreen without touch CHI 2019 Best Paper Award Investigated how livestreamers utilize streaming to promote traditional Chinese heritage UbiComp 2015 Best Paper Honorable Mention Award Invented a novel active acoustic sensing IoT technique for monitoring content level in a container Research All Accessible Computing Human-AI Interaction VR/AR/MR Computational UX Sensing Technique Note: *: Corresponding Author (annotated since 2022); #: equal contribution IJHCS LLM-powered assistant with electrotactile feedback to assist blind and low vision people with maps and routes preview Chutian Jiang, Yinan Fan, Junan Xie, Emily Kuang, Kaihao Zhang, Mingming Fan International Journal of Human-Computer Studies, Volume 207, 2026, 103682 PDF IJHCS Toward AI-driven UI transition intuitiveness inspection for smartphone apps Xiaozhu Hu, Xiaoyu Mo, Xiaofu Jin, Yuan Chai, Yongquan Hu, Mingming Fan, Tristan Braud International Journal of Human-Computer Studies, Volume 206, 2025, 103661 PDF IMWUT VR-Shuttlecock: Toward Enhancing Older Adults’ Balance Ability through Kicking Shuttlecock in VR with Multi-Sensory Feedback Fan Lin, Yiqi Liang, Qianjie Wei, Mingshuo Li, Chutian Jiang, Mingming Fan Proceedings of ACM Interact. Mob. Wearable Ubiquitous Technol. (IMWUT) PDF IMWUT Toward Designing Motor Imagery-Driven Hand Redirection in Virtual Reality for Upper Limb Rehabilitation Peixuan Xiong, Jinhui Ouyang, Zhiqing Wu, Yukai Zhang, Xian Li, Chen Gong, Kaishun Wu, Yuling Wang, Mingming Fan Proceedings of ACM Interact. Mob. Wearable Ubiquitous Technol. (IMWUT) PDF IMWUT Towards Customizable Foundation Models for Human Activity Recognition with Wearable Devices Minghui Qiu, Cekai Weng, Mingming Fan, Kaishun Wu Proceedings of ACM Interact. Mob. Wearable Ubiquitous Technol. (IMWUT) PDF ASSETS 2025 Accessibility and Social Inclusivity: A Literature Review of Music Technology for Blind and Low Vision People Shumeng Zhang, Raul Masu, Mela Bettega, Mingming Fan Proceedings of 27th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS'25) PDF SIGGRAPH Art FinHERtip: Embodied Identity and Human-AI Co-Creation in Accessible Musical Performance Shumeng Zhang, Tiancheng Liu, Mingming Fan SIGGRAPH Asia 2025 Art Papers (Accepted) IMWUT 2025 RemVerse: Supporting Reminiscence Activities for Older Adults through AI-Assisted Virtual Reality Ruohao Li, Jiawei Li, Jia Sun, Zhiqing Wu, Zisu Li, Ziyan Wang, Ge Lin, Mingming Fan* Proceedings of ACM Interact. Mob. Wearable Ubiquitous Technol. (IMWUT) PDF ACM MM 2025 SimViews: An Interactive Multi-Agent System Simulating Visitor-to-Visitor Conversational Patterns to Present Diverse Perspectives of Artifacts in Virtual Museums Mingyang Su, Chao LIU, Jingling Zhang, WU Shuang, Mingming Fan* Proceedings of the 33rd ACM International Conference on Multimedia (MM'25). (Accepted) PDF Outstanding Paper Award ACM MM 2025 ExplorAR: Assisting Older Adults to Learn Smartphone Apps through AR-powered Trial-and-Error with Interactive Guidance Jiawei Li, Linjie Qiu, Zhiqing Wu, Qiongyan Chen, Ziyan Wang, Mingming Fan* Proceedings of the 33rd ACM International Conference on Multimedia (MM'25). (Accepted) PDF SIGGRAPH'25 Immersive Pavilion Blossoms Across Time: AI-Assisted Cultural Dialogue Through Diverse Artistic Expressions in VR Intangible Cultural Heritage Experience Yingna Wang, Qingqin Liu, Xiaoying Wei, Mingming Fan* SIGGRAPH'25: Immersive Pavilion PDF CSCW 2025 DesignMemo: Integrating Discussion Context into Online Collaboration with Enhanced Design Rationale Tracking Boyu Li, Linjie Qiu, Duotun Wang, Qianxi Liu, Ryo Suzuki, Mingming Fan, Zeyu Wang CSCW 2025 Proceedings of the ACM on Human-Computer Interaction (PACM HCI), CSCW PDF CSCW 2025 Understanding and Co-designing Photo-based Reminiscence with Older Adults Zhongyue Zhang, Lina Xu, Xingkai Wang, Xu Zhang, Mingming Fan* CSCW 2025 Proceedings of the ACM on Human-Computer Interaction (PACM HCI), CSCW (In Press) PDF CSCW 2025 Challenges in Adopting Companion Robots: An Exploratory Study of Robotic Companionship Conducted with Chinese Retirees Mengyang Wang, Keye Yu, Yukai Zhang, Mingming Fan* CSCW 2025 Proceedings of the ACM on Human-Computer Interaction (PACM HCI), CSCW (In Press) PDF Modeling the Intuitiveness of Mobile GUI Navigation by Understanding and Simulating Users' Attention Distribution Xiaozhu Hu, Xiaoyu Mo, Xiaofu Jin, Yongquan Owen Hu, Mingming Fan, Tristan Braud Companion Proceedings of the ACM Web Conference 2025 (WWW Companion’25) PDF Decoding Cognitive Load: Eye-Tracking Insights into Working Memory and Visual Attention Xiaofu Jin, Yunpeng Bai, Lina Xu, Shuai Ma, Danqing Shi, Luwen Yu, Mingming Fan Proceedings of the 2025 Symposium on Eye Tracking Research and Applications PDF CHI 2025 Toward Enabling Natural Conversation with Older Adults via the Design of LLM-Powered Voice Agents that Support Interruptions and Backchannels Chao Liu, Mingyang Su, Yan Xiang, Yuru Huang, Yiqian Yang, Kang Zhang*, Mingming Fan* Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '25), April 26 11--May 1, 2025, Yokohama, Japan PDF CHI 2025 RemoteChess: Enhancing Older Adults’ Social Connectedness via Designing a Virtual Reality Chinese Chess (Xiangqi) Community Qianjie Wei, Xiaoying Wei, Yiqi Liang, Fan Lin, Nuonan Si, Mingming Fan* Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '25), April 26 11--May 1, 2025, Yokohama, Japan PDF CHI 2025 \"Watch, Smell, Ask, Touch\": Practices, Challenges, and Technological Support in Ability Assessment of Older Adults from Practitioners' Perspectives in China Zhongyue Zhang, Yuru Huang, Mengyang Wang, Mingming Fan* Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '25), April 26 11--May 1, 2025, Yokohama, Japan PDF CHI 2025 JournalAIde: Empowering Older Adults in Digital Journal Writing Shixu Zhou, Weiyue Lin, Zuyu Xu, Xiaoying Wei, Raoyi Huang, Xiaojuan Ma, Mingming Fan* Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '25), April 26 11--May 1, 2025, Yokohama, Japan PDF CHI 2025 Chorus of the Past: Toward Designing a Multi-agent Conversational Reminiscence System with Digital Artifacts for Older Adults Jingwei Sun, Zhongyue Zhang, Mengyang Wang, Nianlong Li, Yan Xiang, Liuxin Zhang, Yu Zhang*, Qianying Wang*, Mingming Fan* Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '25), April 26 11--May 1, 2025, Yokohama, Japan PDF CHI 2025 Facilitating Daily Practice in Intangible Cultural Heritage through Virtual Reality: A Case Study of Traditional Chinese Flower Arrangement Yingna Wang, Qingqin Liu, Xiaoying Wei, Mingming Fan* Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '25), April 26 11--May 1, 2025, Yokohama, Japan PDF CHI 2025 Designing LLM-Powered Multimodal Instructions to Support Rich Hands-on Skills Remote Learning: A Case Study with Massage Instructors and Learners Chutian Jiang, Yinan Fan, Junan Xie, Emily Kuang, Baichuan Feng, Kaihao Zhang*, Mingming Fan* Proceedings of the CHI Conference on Human Factors in C",
  "content_length": 43988,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:23"
}