{
  "name": "Ming-xuan Sun",
  "homepage": "http://www.csc.lsu.edu/~msun",
  "status": "success",
  "content": "Welcome to Mingxuan Sun's Webpage Mingxuan Sun Associate Professor Division of Computer Science and Engineering Louisiana State University Baton Rouge, LA 70803 Office: 3272A Patrick F. Taylor Hall Phone: (225) 578-2882 Email: msun 'AT' csc 'DOT' lsu 'DOT' edu [Home] [Research] [Publications] [More] About me I am an Associate Professor in the Division of Computer Science and Engineering in the School of Electrical Engineering and Computer Science at Louisiana State University. I received my Ph.D. degree in Computer Science from the Georgia Institute of Technology in 2012. I received my Master's degree in Computer Science from the University of Kentucky in 2006 and my Bachelor's degree in Computer Science and Engineering from Zhejiang University, China in 2004. I was a Senior Scientist with the playlist recommendation group, Pandora Media, Inc. from 2012 to 2015. To prospective students: I am looking for motivated graduate students and visiting scholars. If you are interested, please e-mail me at msun 'AT' csc 'DOT' lsu 'DOT' edu with your CV and transcripts. News March 2022: Dr. Sun received a joint NSF-Amazon grant, \"FAI: Advancing Optimization for Threshold-Agnostic Fair AI Systems\", in collaboration with Dr. Tianbao Yang (PI) and Dr. Qihang Lin. Dec. 2021: Zihan Zhou has successfully defended her Ph.D. dissertation titled \"Interpretable and anti-bias machine learning models for human event sequence data\". Congratulations, Dr. Zhou! April 2021: Our patent \"Increasing the likelihood of receiving feedback for content items\" has been issued. April 2021: Dr. Sun received LSU Alumni Association Rising Faculty Research Award, 2021. May 2020: Dr. Sun received NSF CAREER Award, \"Privacy-aware predictive modeling of dynamic human events\". May 2020: Our paper on list-wise fairness criterion for point processes has been accepted by KDD 2020. May 2020: Jin Shang has successfully defended his Ph.D. dissertation titled \"Predictive modeling of asynchronous event sequence data\". Congratulations, Dr. Shang! Research My research interests include machine learning, information retrieval, and data mining. I am also interested in machine learning and AI applications in social informatics, healthcare analytics, and wireless communications. Publications Conference Papers T. Zhao, X. Chen, and M. Sun, Enhancing Time Series Forecasting via Multi-Level Text Alignment with Large Language Models, in Proc. International Conference on Database Systems for Advanced Applications (DASFAA), May 2025. X. Chen, X. Zhou, S. Zhang, and M. Sun, DualGFL: federated learning with a dual-level coalition-auction game, in Proc. AAAI Conf. Artificial Intelligence (AAAI), Feb. 2025. X. Chen, X. Zhou, H. Zhang, M. Sun, and T. Zhao, Cost-effective federated learning: a unified approach to device and training scheduling, in Proc. IEEE Int. Conf. Commun. (ICC), June 2024. Z. Li, and M. Sun, Sparse Transformer Hawkes Process for Long Event Sequences, in Proc. Joint European Conference on Machine Learning and Knowledge Discovery in Databases (ECML-PKDD), Sep. 2023. Z. Li, Z. Zhou, M. Sun, and H. Xu Debiased Imitation Learning for Modulated Temporal Point Processes, in Proc. SIAM International Conference on Data Mining (SDM), pp. 460-468, April. 2023. Z. Zhou, and M. Sun, Multivariate Hawkes Processes for Incomplete Biased Data, in Proc. IEEE International Conference on Big Data, Dec. 2021. M. Liu, X. Zhou, and M. Sun, A game-theoretic approach to achieving bilateral privacy-utility tradeoff in spectrum sharing, in Proc. IEEE Global Commun. Conf. (GLOBECOM), Dec. 2020. J. Shang, M. Sun, and N. Lam, List-wise fairness criterion for point processes, in Proc. ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), Aug. 2020. M. Sun, Q. Wang, and Z. Liu, Human action image generation with differential privacy, in Proc. IEEE International Conference on Multimedia and Expo (ICME), July 2020. Z. Zhou, M. Sun, and J. Chen, A model-agnostic approach for explaining the predictions on clustered data, in Proc. IEEE International Conference on Data Mining (ICDM), Nov. 2019. Q. Chen, M. Sun, and J. Zhang, Neural-attention multi-instance learning for predicting user demographics from highly noisy tweets, in Proc. International Conference on Machine Learning and Data Mining (MLDM), July 2019. J. Shang and M. Sun, Geometric Hawkes processes with graph convolutional recurrent neural networks, in Proc. AAAI Conference on Artificial Intelligence (AAAI), Jan. 2019. F. Zhang, X. Zhou, and M. Sun, Multi-level channel valuations and coalitional subgames in spatial spectrum reuse, in Proc. IEEE Consumer Communications and Networking Conference (CCNC), Jan. 2019. N. Wu, X. Zhou, and M. Sun, Incentive mechanisms and influence of negotiation power in multi-relay cooperative wireless networks, in Proc. IEEE Global Communications Conference (GLOBECOM), Abu Dhabi, UAE, Dec. 2018. J. Shang and M. Sun, Local low-rank Hawkes processes for temporal user-item interactions, in Proc. IEEE International Conference on Data Mining (ICDM), Singapore, Nov. 2018. J. Shang, M. Sun, and K. Collins-Thompson, Demographic inference via knowledge transfer in cross-domain recommender systems, in Proc. IEEE International Conference on Data Mining (ICDM), Singapore, Nov. 2018. S. Guo, X. Zhou, S. Xiao, and M. Sun, Low-complexity mode selection and resource allocation for energy-efficient D2D communications, in Proc. IEEE Vehicular Technology Conference (VTC), Chicago, IL, Aug. 2018. N. Wu, X. Zhou, and M. Sun, Multi-channel jamming attacks against cooperative defense: a two-level Stackelberg game approach, in Proc. IEEE International Conference on Communications (ICC), Kansas City, MO, May 2018. F. Zhang, X. Zhou, and M. Sun, Constrained VCG auction for spatial spectrum reuse with flexible channel evaluations, in Proc. IEEE Global Communications Conference (GLOBECOM), Singapore, Dec. 2017. N. Wu, X. Zhou, and M. Sun, Secure transmission in heterogeneous networks: a two-level Stackelberg game approach, in Proc. IEEE Global Communications Conference (GLOBECOM), Singapore, Dec. 2017. M. Sun, C. Li, and H. Zha, Inferring private demographics of new users in recommender systems, in Proc. ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems (MSWIM), Miami, FL, Nov. 2017. M. Sun, G. Xu, J. Zhang, and D.W. Kim, Tracking you through DNS traffic: linking user sessions by clustering with Dirichlet mixture model, in Proc. ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems (MSWIM), Miami, FL, Nov. 2017. T. Wang, M. Sun, and K. Hu, Dilated deep residual network for image denoising, in Proc. International Conference on Tools with Artificial Intelligence (ICTAI), Boston, MA, Nov. 2017. M. Sun and S. Yang, Personalization of learning paths in online communities of creators, in Proc. International Conference on Educational Data Mining (EDM), Raleigh, NC, June 2016. K. Kapoor, M. Sun, J. Srivastava, and T. Ye, A hazard based approach to user return time prediction, in Proc. ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), New York, NY, Aug. 2014. M. Sun, F. Li, J. Lee, K. Zhou, G. Lebanon, and H. Zha, Learning multiple-question decision trees for cold-start recommendation, in Proc. ACM International Conference on Web Search and Data Mining (WSDM), Rome, Italy, Feb. 2013. J. Lee, M. Sun, S. Kim, and G. Lebanon, Automatic feature induction for stagewise collaborative filtering, in Proc. Annual Conference on Neural Information Processing Systems (NeurIPS), Lake Tahoe, NV, Dec. 2012. M. Sun, G. Lebanon, and P. Kidwell, Estimating probabilities in recommendation systems, in Proc. International Conference on Artificial Intelligence and Statistics (AISTATS), Ft. Lauderdale, FL, Apr. 2011. M. Sun, G. Lebanon, and K. Collins-Thompson, Visualizing differences in web search algorithms using the expected weighted Hoeffding distance, in Proc. International World Wide Web Conference (WWW), Raleigh, NC, Apr. 2010. M. Sun, G. Schindler, G. Turk, and F. Dellaert, Color matching and illumination estimation for urban scenes, in Proc. IEEE International Conference on Computer Vision (ICCV) Workshops, Tokyo, Japan, Oct. 2009. M. Liao, M. Sun, R. Yang, and Z. Zhang, Robust and accurate visual echo cancellation in a full-duplex projector-camera system, in Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) Workshop, New York, NY, June 2006. M. Sun, R. Yang, L. Yun, G. Landon, B. Seales, and M. S. Brown, Geometric and photometric restoration of distorted documents, in Proc. IEEE International Conference on Computer Vision (ICCV), Beijing, China, Oct. 2005. Journal Papers B. Zhang, Q. Hu, M. Sun, Q. Lin, and T. Yang, Learning to Rank with Top-K Fairness Transactions on Machine Learning Research (TMLR), 2025, to appear. K. Wang, V.V. Mihunov, N.S. Lam, and M. Sun, Mining socioenvironmental drivers of bias in social media rescue data for fairness-aware modeling: A case study of Hurricane Harvey, International Journal of Disaster Risk Reduction, 2025. X. Chen, X. Zhou, H. Zhang, M. Sun, and T. Zhao, Joint device and training scheduling for wireless federated learning, IEEE Internet of Things J., 2025. X. Chen, X. Zhou, M. Sun, and H. Wang Temporal contrastive learning for sensor-based human activity recognition: a self-supervised approach, IEEE Sensors J., vol. 25, no. 1, pp. 1839-1850, Jan. 2025. X. Chen, X. Zhou, H. Zhang, M. Sun, and H. V. Poor, Client selection for wireless federated learning with data and latency heterogeneity, IEEE Internet of Things J., vol. 11, no. 19, pp. 32183-32196, Oct. 2024. L. Song, S. Chen, Z. Meng, M. Sun, and X. Shang, FMSA-SC: A Fine-grained Multimodal Sentiment Analysis Dataset based on Stock Comment Videos, IEEE Transactions on Multimedia, 2024. L. Song, J. Li, J. Liu, Y. Yang, X. Shang, and M. Sun, Answering knowledge-based visual questions via the exploration of Question Purpose, P",
  "content_length": 15730,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:21"
}