{
  "name": "Ming Zhong 0003",
  "homepage": "https://www.scholat.com/zming.en",
  "status": "success",
  "content": "Ming Zhong in SCHOLAT 首页 学术快讯 招生资讯 招聘信息 学术会议 学术期刊 学术成果 学者百科 机构号 应用服务 知识图谱 学者百科 高校师资栏目 学术会议平台 学者 学讯 学术 学者 团队 课程 我的空间 个人主页 设置 退出登录 登录 注册 Tips 温馨提示：为保障健康的学术网络环境，关注该学者前，请先完成实名认证。 马上认证 暂不认证 Ming Zhong vice president，chair professor computer science, shen zhen technology university ,Shenzhen university www.scholat.com/zming About News Academic Links 1 Biography 2 Contact Me BIOGRAPHY Professor Ming Zhong Executive dean of the Graduate School of Shenzhen University. He was born in August 1967. Doctor of computer software and theory , Graduted from Sun Yat sen University. He was promoted to be a Professor of Computer Science in 2004. He is now a distinguished professor of Pengcheng scholars, a second-class professor of Shenzhen University and a winner of Ding Ying science and technology award.He is also an Adjunct professor of East China University of technology,Doctoral supervisor of Shenzhen University and Shenzhen Institute of advanced technology, Chinese Academy of Sciences, member of the computer teaching steering committee of the Ministry of education, honorary chairman of Shenzhen computer society, member of a council of China Computer Society (9th session), vice chairman of the Internet of things industry university research alliance of Guangdong provincial ministries and Universities, honorary member of CCF YOCSEF (Beijing) AC, and former chairman of CCF YOCSEF (Guangzhou), Provincial talents of the \"ten thousand projects\" in Guangdong Province and leading talents in Shenzhen. He is the Leader of the  discipline of computer software and theory  at Shenzhen University. He won the national teaching achievement award once ( No. 4), the first prize of Guangdong excellent teaching achievement three times ( No. 1) and the second prize two times ( No. 2 and No. 4). In 2009, she was rated as an excellent teacher in Shenzhen. \"Cloud data exchange and service scheduling platform and application\" won the first prize of Guangdong science and Technology Award in 2013 (ranking first), the \"ESB integration platform software based on data integration and information sharing\" project, the Shenzhen Science and Technology Innovation Award in 2009 (ranking first), and the third prize of Guangdong science and Technology Award in 2010 (ranking first). Won the first prize for scientific and technological progress of the Institute of Electronics (ranking first) and the first prize for scientific and technological progress of Wu Wenjun's artificial intelligence (ranking second). \"Key technologies and applications of multidimensional health data intelligent platform based on Internet of things\" won the second prize of Guangdong Provincial Science and Technology Progress Award in 2019 (ranking No. 2). He has published more than 100 academic papers. Selected Publications J. Papers C. Papers Books Projects Patents Software Copyrights Standards Reports Awards 该用户暂未对外公开其他信息！ CONTACT Me Scholat.com/zming shenzhen city 我的主页 获取微信名片 Following Followers Teams Courses Friend Relationship Map You are both not following each other, only if Ming Zhong and you followed each other,can you use the instant message. SCHOLAT.com 学者网 ABOUT US | SCHOLAT",
  "content_length": 3164,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:17"
}