{
  "name": "Mingyue Jie",
  "homepage": "https://my.ece.utah.edu/~u6007330/index.html",
  "status": "success",
  "content": "Mingyue Ji Mingyue Ji Home Publications List Publications by Topic Teaching EdgeAI Lab Projects Awards Service Codes Mingyue Ji Director of EdgeAI Lab Associate Professor The Department of Electrical & Computer Engineering Adjunct Associate Professor Kahlert School of Computing John and Marcia Price College of Engineering, University of Utah My Website at the U: http://faculty.utah.edu/~mingyueji/ Email: mingyue.ji@utah.edu Offcie: MEB 3108 Phone: 801-587-7255 Google Scholar Profile, ORCID, ResearchGate, YouTube, GitHub Announcement Starting in August 2024, I joined the Department of Electrical and Computer Engineering at the University of Florida as an Associate Professor. My new website can be found here. Openings We will have multiple PhD openings for Fall 2025 working in the general area of machine learning; cloud/edge computing; wireless communications, networking and sensing; information theory and coding. If you are interested, please send me an e-mail with your current CV or drop by my office. I will be happy to discuss. Please check samples of our research talks on our YouTube channel. Short Bio and Research Interests I am an Associate Professor in the Department of Electrical and Computer Engineering and the director of EdgeAI lab at the University of Utah. I received my PhD in 2015 at Ming Hsieh Department of Electrical Engineering, Viterbi School of Engineering, University of Southern California (USC), Los Angeles, USA. I received my MS degrees in Electrical Engineering (focusing on wireless networks) from University of California, Santa Cruz and in Electrical Engineering (focusing on information and signal processing) at Royal Institute of Technology (KTH), Stockholm, Sweden, and obtained my Bachelor Degree in Communication Engineering at Beijing University of Posts and Telecommunications (BUPT), Beijing, China. Previously, I was a Staff II System Design Scientist at Broadcom Limited, San Diego. Prof. Daniela Tuninetti from UIC, Prof. Hua Sun from UNT and myself delivered the tutorial on “Distributed Function Retrieval: a Storage and Privacy Perspective” at 2021 IEEE International Symposium on Information Theory (ISIT 2021) held (virtually) in Melbourne Australia in July 2021. The tutorial was scheduled for July 16th 2021, MDT. The video can be found here and the slides can be found here. My research interests lie in the fascinating intersection of machine learning, distributed computing and storage, communication and networking, and information theory. In particular, we are focusing on developing AI algorithms and edge hardware platforms, applying AI to IoT, wireless sensing and wireless networking, and understanding the fundamentals of AI from optimization and information theoretic perspectives. News (07/2024) Starting in August 2024, I will join the Department of Electrical and Computer Engineering at the University of Florida as an Associate Professor. (07/2024) New Journal Paper on Privacy in Federated Learning Accepted by IEEE Transactions on Information Theory, Congratulations, All!! On the Information Theoretic Secure Aggregation with Uncoded Groupwise Keys, K. Wan, X. Yao, H. Sun, M. Ji and G. Caire. (06/2024) Prof. Daniela Tuninetti from UIC, Prof. Hua Sun from UNT and myself delivered a tutorial titled “Secure Private Cache-aided Distributed Function Retrieval” on June 9th, 2024, at the 2024 IEEE International Conference on Communications (ICC). (05/2024) New Paper on the Fundamentals of Data Heterogeneity in Federated Learning Accepted by ICML 2024, Congratulations, All!! A New Theoretical Perspective on Data Heterogeneity in Federated Averaging, J. Wang, S. Wang, R.-R. Chen and M. Ji. (04/2024) New Journal Paper on Physics-informed Neural Network-based Channel Modeling Accepted by IEEE Wireless Communications Magazine. Congratulations, All!! Physics-informed Generalizable Wireless Channel Modeling with Segmentation and Deep Learning: Fundamentals, Methodologies, and Challenges, E. Zhu, H. Sun and M Ji. (04/2023) The third PhD student in EdgeAI lab, Jiayi Wang, successfully completed her defense. Congratulations, Dr. Wang!! Her PhD Thesis title is “The Fundamentals of Federated Learning with Heterogeneous Data”. (04/2024) Our Senior Clinic Project on the application of Edge AI sponsored by L3Harris and titled “Benchmarking Machine Learning Devices for Radio Frequency Spectrum Sensing” won the Most Innovative amd Societal Impact Awards in the Department of Electrical and Computer Engineering at the U. The project poster can be found here. See the Awards below. (04/2024) New Journal Paper on Privacy in Federated Learning Accepted by IEEE Transactions on Information Theory, Congratulations, All!! The Capacity Region of Information Theoretic Secure Aggregation with Uncoded Groupwise Keys, K. Wan, H. Sun, M. Ji, T. Mi and G. Caire. (04/2024) 4 Paper Accepted in IEEE ISIT 2024. The topics are elastic computing, private computation and secure aggregation in Federated Learning. Congratulations, All!! Decentralized Uncoded Storage Elastic Computing with Heterogeneous Computation Speeds, W. Huang, X. You, K. Wan, R. C. Qiu and M. Ji. On Multi-Message Private Computation, A. Gholami, K. Wan, T. Jahani-Nezhad, H. Sun, M. Ji and G. Caire. On the Optimality of Secure Aggregation with Uncoded Groupwise Keys Against User Dropouts and User Collusion, Z. Zhang, J. Liu, K. Wan, H. Sun, M. Ji and G Caire. Optimal Information Theoretic Secure Aggregation with Uncoded Groupwise Keys, K. Wan, H. Sun, M. Ji, T. Mi and G. Caire. (04/2024) We changed the name of our lab to EdgeAI lab since we are more focusing on developing AI algorithms and edge hardware platforms, applying AI to IoT, wireless sensing and wireless networking, and understanding the fundamentals of AI. (04/2024) New Paper Accepted in the 2024 International Congress on Advances in Nuclear Power Plants (ICAPP). Congratulations, All!! Statistical and Neural Network for Real Sensor-Data-Driven Anomaly Detection in Nuclear Applications, I. Nasim, V. Agarwal, J. E. Daw, M. Ji, and S. K. Kasera. (03/2024) Our paper titled “HawkRover: An Autonomous mmWave Vehicular Communication Testbed with Multi-sensor Fusion and Deep Learning” won the Best Paper Award at IEEE International Symposium on Intelligent Computing and Networking (ISICN) 2024. Congratulations to our high school student, Ethan Zhu from Green Canyon High School, North Logan, Utah, and Dr. Haijian Sun from University of Georgia. (03/2024) Our new NSF medium project is on the ECE news. See here for more details. (03/2024) New ArXiv e-prints: Decentralized Uncoded Storage Elastic Computing with Heterogeneous Computation Speeds, W. Huang, X. You, K. Wan, R. C. Qiu and M. Ji. (03/2024) New Paper Accepted in DySPAN FAST (Field Trials for Advanced Spectrum Sharing) Workshop 2024. Congratulations, All!! SPARC-LoRa: A Scalable, Power-efficient, Affordable, Reliable, and Cloud Service-enabled LoRa Networking System for Agriculture Applications, X. Wang, B. Hatasaka, Z. Liu, S. Tope, M. Karkhanis, S. Noh, F. Sium, R. V. Mural, H. Kim, C. Mastrangelo, L. Zang, J. Schnable and M. Ji. (02/2024) I will serve as a panel co-chair for IEEE CCNC 2025. (02/2024) I will serve as a track (Testbeds, Experimentation and Datasets for Communications and Networking) co-chair for IEEE CCNC 2025. (02/2024) New Demo Paper Accepted in IEEE INFOCOM 2024. Congratulations, All!! Special thanks to our collaborators, Prof. Zhangyu Guan's WINGS Lab, from the University at Buffalo!! UnionLabs: AWS-based Remote Access and Sharing of NextG and IoT Testbeds, M. McManus, T. Rinchen, S. M. Suhail, S. Santhinivas, A. Dey, S. Pagidimarri, Y. Cui, J. Hu, J. Zhang, X. Wang, M. Ji, N. Mastronarde and Z. Guan. (01/2024) New Paper Accepted in ICLR 2024 for spotlight presentation (5%). This is a joint work with Dr. Shiqiang Wang from IBM T. J. Watson Research Center. A Lightweight Method for Tackling Unknown Participation Statistics in Federated Averaging, S. Wang and M. Ji. (01/2024) New ArXiv e-prints: SPARC-LoRa: A Scalable, Power-efficient, Affordable, Reliable, and Cloud Service-enabled LoRa Networking System for Agriculture Applications, X. Wang, B. Hatasaka, Z. Liu, S. Tope, M. Karkhanis, S. Noh, F. Sium, R. V. Mural, H. Kim, C. Mastrangelo, L. Zang, J. Schnable and M. Ji. (01/2024) New Paper Accepted in IEEE ICC 2024. Congratulations, All!! Uncoded Storage Coded Transmission Elastic Computing with Straggler Tolerance in Heterogeneous Systems, X. Zhong, J. Kliewer and M. Ji (01/2024) Tutorial Accepted. Prof. Daniela Tuninetti from UIC, Prof. Hua Sun from UNT and myself will deliver a tutorial titled “Secure Private Cache-aided Distributed Function Retrieval” at 2024 IEEE International Conference on Communications (ICC). (01/2024) New ArXiv e-prints with Ethan Zhu from Green Canyon High School, North Logan, Utah: HawkRover: An Autonomous mmWave Vehicular Communication Testbed with Multi-sensor Fusion and Deep Learning, E. Zhu, H. Sun and M. Ji. Physics-informed Generalizable Wireless Channel Modeling with Segmentation and Deep Learning: Fundamentals, Methodologies, and Challenges, E. Zhu, H. Sun and M Ji. (12/2023) New Patent Granted. Congratulations to INL and University of Utah!! Systems, devices, and methods for scheduling spectrum for spectrum sharing, A Bhuyan, M. Ji and S. K. Kasera. (11/2023) New Paper Accepted in IEEE Transactions on Information Theory. Congratulations, All!! Coded Caching with Private Demands and Caches, A. Gholami, K. Wan, H. Sun, M. Ji and G. Caire. (10/2023) I co-chaired for and delivered an invited talk at 5th Buffalo Day for 5G and Wireless Internet of Things on October 6, 2023. My talk title is ‘‘A New Multi-Agent Deep Reinforcement Learning-enabled Distributed Power Allocation Scheme for mmWave and sub-6GHz Cellular Networks \". Some photos can be found here. (10/2023) New ArXiv e-prints: The Capacity Region of Information Theoretic Secure Aggregation with Uncoded Groupwise Keys, K. Wan, H. Sun, M. Ji, T.",
  "content_length": 46411,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:26"
}