{
  "name": "Ming Wen 0001",
  "homepage": "https://mingwen-cs.github.io",
  "status": "success",
  "content": "Ming Wen Ming Wen Wuhan, China Homepage Email Google Scholar DBLP ORCID RedNote Biography I am currently an Associate Professor in the school of Cyber Science and Engineering of Huazhong University of Science and Technology (HUST), where I lead the ARTS3 research group (in short for Advanced Research for Trustworthy and Secure Software Systems). I obtained my PhD degree from the Hong Kong University of Science and Technology (HKUST), and my bachelor degree from Zhejiang University. During my PhD studies, I was honored and fortunate to be supervised by Prof. Shing-Chi CHEUNG in the CASTLE group. I also had an unforgettable visiting experience at UC, Davis under the supervision of Prof. Zhendong Su. My research interests mainly focus on Software Security (in particular Fuzzing and Analysis), Software Supply Chain Security and Big Code Analysis. 招收2026级博士生1名（余额1名） 招收2026级硕士生3名（余额0名） 招收博士后、实习生，欢迎联系（请附简历） 研究方向：软件安全、软件测试与分析、代码大模型 News [2025.10] Our paper working on JVM Compiler Testing ICSE'2026, Congratulations to Shiyu! [2025.09] Our paper working on Static Detection Rule Refinement ASE'2025, Congratulations to Zongze! [2025.05] Our paper working on Java Security was accepted to USENIX Security'2025, Congratulations to Yiheng! [2025.06] Our paper working on LLM benchmark was accepted to ACL'2025, Congratulations to Jialun! [2025.04] Three papers were acceted to FSE'2025, Congratulations to Xiaohu! [2024.12] One paper was acceted to AAAI'2025, Congratulations to Xiaohu! [2024.08] Four paper were acceted to ASE'2024, Congratulations to Zongze, Zifan and Yulun! [2024.07] Our paper working on Program Repair with LLM was accepted to ISSTA'2024, Congratulations to Bo Lin! [2024.07] Our paper working on NPM Malware Detection was accepted to ISSTA'2024, Congratulations to Zeliang! [2024.06] Our paper working on JIT Testing was accepted to ASPLOS'2024, Congratulations to Zifan! [2024.05] Congrats to Xiaohu's paper on LLM-based Vulnerability Detection was accepted to ACL'2024 Findings! [2023.12] Two papers were accepted to SANER'2024, Congratulations to Kang Chen! [2023.11] Our paper collaborating with MSRA was accepted to EuroSys'2024, Congratulations to Yinfang! [2023.07] Our paper working on Go Concurrency Testing was accepted to ASE'2023, Congratulations to Zongze! [2023.07] Another five papers were accepted to ESEC/FSE'2023, Congratulations to Xiaohu! [2023.07] Our paper working on SMT Solvers Testing was accepted to ASE'2023, Congratulations to Maolin! [2023.07] Our paper working on Automated Code Generation was accepted to OOPSLA'2023. [2023.04] Our paper working on Coverage Profilers Testing was accepted to ESEC/FSE'2023. [2023.04] Our paper working on Patch Presence Test was accepted to ISSTA'2023. [2023.01] Our paper working on Testing Deep Neural Networks was accepted to TOSEM. [2023.01] Our paper working on Program Repair for Android was accepted to ISSTA'2023. [2023.01] Our paper working on JVM Fuzzing was accepted to ICSE'2023. Congratulations to Haoxiang! [2023.01] Our paper working on Deep Learning System Testing was accepted to TOSEM, Congratulations to Ziniu! [2023.01] Our paper working on Code Semantic Embedding was accepted to TOSEM! [2022.12] Our paper working on Software Supply Chain Security was accepted to ICSE'2023. [2022.12] Our paper working on SMT Solvers Testing was accepted to ICSE'2023. [2022.12] In ChinaSoft 2022, I will organize “软件缺陷的自动发现与修复” and “优秀博士生论坛” Welcome for participation! [2021.12] Our paper working on Fault Diagnosis for Deep Learning Programs was accepted to ICSE 2022. Selected Publications Software Testing and Analysis (especially for fundamental software systems) Precise and Effective Gadget Chain Mining through Deserialization Guided Call Graph Construction, USENIX Security 2025. Validating JVM Compilers via Maximizing Optimization Interactions, ASPLOS 2024. Effective Concurrency Testing for Go via Directional Primitive-Constrained Interleaving Exploration, ASE 2023. Detecting JVM JIT Compiler Bugs via Exploring Two-Dimensional Input Spaces, ICSE 2023. Validating SMT Solvers via Skeleton Enumeration Empowered by Historical Bug-Triggering Inputs, ICSE 2023. Software Supply Chain Security Effective Vulnerable Function Identification based on CVE Description Empowered by Large Language Models, ASE 2024. Maltracker: A Fine-Grained NPM Malware Tracker Copiloted by LLM-Enhanced Dataset, ISSTA 2024. Precise and Efficient Patch Presence Test for Android Applications against Code Obfuscation, ISSTA 2023. Understanding the Threats of Upstream Vulnerabilities to Downstream Projects in the Maven Ecosystem, ICSE 2023. Watchman: Monitoring Dependency Conflicts for Python Library Ecosystem, ICSE 2020. Big Code Analysis (LLM for code, security analysis for LLM) Towards Understanding the Effectiveness of Large Language Models on Directed Test Input Generation, ASE 2024. One Size Does Not Fit All: Multi-Granularity Patch Generation for Better Automated Program Repair, ISSTA 2024. Generalization-Enhanced Code Vulnerability Detection via Multi-Task Instruction Fine-Tuning, ACL 2024. SMT Solver Validation Empowered by Large Pre-Trained Language Models, ASE 2023. Two Birds with One Stone: Boosting Code Generation and Code Search via a Generative Adversarial Network, OOPSLA 2023. Awards Won the ACM SIGSOFT Distinguished Paper Award, ASE 2024 (*2) Won the ACM SIGSOFT Distinguished Paper Award, ISSTA 2024 Awarded as “华中学者”卓越青年学者, 2024 Awarded as “武汉东湖学者”, 2024 Awarded as the ACM Wuhan Rising Star (ACM武汉“新星奖”), 2023 Awarded as “优秀指导教师”, 全国大学生信息安全竞赛-作品赛全国一等奖, 2022 Awarded as Young Elite Scientist Sponsorship Program, China Association for Science and Technology, 2021-2023 Postgraduate Studentship, CSE HKUST, Annually (September 2014-March 2019). Top Research Post-Graduate Award, SENG HKUST, July 2018. School of Engineering (SENG) PhD Fellowship Award, SENG HKUST, 2014-2015. Recruiting You are warmly welcomed to join our team and work with us to conduct Advanced Research for Trustworthy and Secure Software Systems. I am always recruiting self-motivated Undergraduate/Master/PhD/PostDoc students with strong programming skills and good English ability. Please send me an email with your CV if you are interested to work with me. I am also seeking for all kinds of collaborations, drop me an email if you are interested. If you want to know more about me, please see this post (in Chinese).",
  "content_length": 6410,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:17"
}