{
  "name": "Mingyu Gao 0001",
  "homepage": "https://people.iiis.tsinghua.edu.cn/~gaomy",
  "status": "success",
  "content": "Mingyu Gao Mingyu Gao is an associate professor of computer science in the Institute for Interdisciplinary Information Sciences (IIIS) at Tsinghua University in Beijing, China. He leads the Innovative Data-centric Efficient Architecture Lab (IDEAL). His research interests lie in the fields of computer architecture and systems, including efficient memory architectures, scalable data processing, and hardware system security, with a special emphasis on data-intensive applications like artificial intelligence and big data analytics. He has published in top-tier conferences including ISCA, MICRO, ASPLOS, HPCA, OSDI, SIGMOD, and VLDB. He also regularly serves in the program committees of ISCA, MICRO, ASPLOS, HPCA, and other top conferences. Mingyu received his PhD in Electrical Engineering at Stanford University in June, 2018. He also received a Master of Science degree in Electrical Engineering at Stanford University in 2014, and a Bachelor of Science degree in Microelectronics at Tsinghua University in China in 2012. Student Recruiting I am currently looking for PhD students as well as undergraduate interns interested in computer architecture and systems. Welcome to join my group! If you are interested, please send me a short introduction email with your CV. Updates on my course offerings at Tsinghua Several changes have been made about in which semesters my undergraduate and graduate courses will be offered. Please plan accordingly if you are interested in enrolling. 30470324 Introduction to Computer Systems, offered to freshman-year undergraduate students, in each spring semester. 20470084 Computer Architecture, offered to sophomore-year undergraduate students, in each autumn semester. 80470262 Computer Systems and Architectures, offered to graduate students, in the spring semester every two years. The next offering will be in spring 2024. Recent News New! [2025.11.] I am serving on the program committees of ISCA 2026, MLSys 2026, and ISPASS 2026. New! [2025.10.] Our paper about the new paradigm of top-p for sparse attention has been accepted as spotlight at NeurIPS 2025. New! [2025.10.] Three papers are presented at MICRO 2025, about cache design for sparse tensor accelerators, domain-specific acceleration for oblivoius transfer extension, and processor design for RISC-V Vector extension. New! [2025.8.] Two papers are accepted to ASPLOS 2025 and will be presented at ASPLOS 2026, about discovering novel neural operators and PIM design for unified formats in databases. [2025.7.] I am serving on the program committee of HPCA 2026. [2025.6.] I have been introduced into the HPCA Hall of Fame. [2025.6.] Two papers are presented at ISCA 2025, about domain-specific acceleration for sparse tensors and near-data processing for approximate nearest neighbor search (ANNS). One paper is presented at SIGMOD 2025, about private information retrieval from public databases. [2025.4.] Two papers are presented at ASPLOS 2025 and DATE 2025, which are about hardware acceleration for zero-knowledge proofs and fully homomorphic encryption. [2025.4.] I am serving on the program committees of MICRO 2025, ASPLOS 2026, and EuroSys 2026, as well as the external review committee of ATC 2025. [2025.3.] Four papers are presented at HPCA 2025! [2025.2.] I have tenured and promoted to an associate professor :) [2024.11.] I am serving on the ISCA 2025 program committee. [2024.10.] We have three papers about new memory systems accepted recently, about reducing the metadata overheads of hybrid memory in PACT 2024, performance isolation of hybrid memory for CPU-GPU heterogeneous systems in SC 2024, and combining hybrid memory and near-data processing in MICRO 2024. [2024.7.] I am serving on the HPCA 2025 and SoCC 2024 program committees. [2024.6.] Our paper about finding optimized neural network architectures for private inference published in ICML 2024 is now available. [2024.4.] We have three papers about near-data processing (NDP) and processing-in-memory (PIM) accepted recently, one at SIGMOD 2024 about accelerating graph mining on real-world PIM hardware, and two at ISCA 2024 about optimizing communication in NDP architectures and supporting uniform memory space between PIM and CPUs. [2024.3.] I am serving on the MICRO 2024 and ASPLOS 2025 program committees. [2024.2.] Our paper that optimizes bulk loading process of ORAM on S&P 2024 is now available. [2024.1.] I am serving on the ICS 2024 and YArch 2024 program committees. [2023.12.] Welcome to read my new post on the ACM SIGARCH Computer Architecture Today blog, about dataflow techniques on sparse accelerators. [2023.12.] Two papers are now available, about scalable NTT acceleration and efficient and secure MLaaS. [2023.11.] I am serving on the ISCA 2024 program committees. [2023.6.] Our paper about a new indexing structure on persistent memory on SIGMOD 2023 is now available. [2023.5.] One paper is accepted in OSDI 2023, about a new approach to design GPU TEEs through software-based validation. [2023.4.] Two papers are published in VLDB 2023, about TEE-based secure data analytics and oblivious distributed database operations. [2023.4.] I am serving on the ASPLOS 2024 and MICRO 2023 program committees. [2023.3.] We have another paper published in ASPLOS 2023, about near-data processing architectures! [2022.12.] Our papers about hybrid memory architectures and sparse matrix accelerators accepted in HPCA 2023 and ASPLOS 2023 are now available! [2022.12.] I am serving on the ISCA 2023 program committee and the IEEE Micro Top Picks 2023 selection committee. [2022.8.] I summarize some commonly asked questions when students pick their initial research directions in an ACM SIGARCH Computer Architecture Today blog post. [2022.6.] I am serving on the SC 2022, MICRO 2022, SoCC 2022, and ASPLOS 2023 program committees. [2022.6.] Our paper about accelerating multi-party computation (MPC) with a minimum set of trusted hardware appears in ISCA 2022. [2022.2.] Starting from spring 2022, I am co-teaching a new course named Introduction to Computer Systems for freshman-year undergraduates. [2022.2.] We have two papers published in ASPLOS 2022, about hardware acceleration of graph mining and secure enclaves on FPGAs. [2021.12.] Read my article discussing the algorithm evolution and hardware acceleration trends of graph mining in the ACM SIGARCH Computer Architecture Today blog. [2021.11.] I am serving on the ISCA 2022 external review committee. [2021.6.] Check out my personal thoughts on acceleration for cryptographic secure computing in the ACM SIGARCH Computer Architecture Today blog. [2021.4.] I am serving on the MICRO 2021 program committee. [2021.3.] We have the PET paper accepted in OSDI 2021, about exploiting partially equivalent transformations and automated corrections in tensor program graph substitution. [2021.2.] Our PipeZK paper about hardware acceleration for zero-knowledge proof, a widely used cryptographic primitive, has been accepted in ISCA 2021. [2020.11.] Check out my post on ACM SIGARCH Computer Architecture Today blog about having effective meetings between advisors and students. [2020.10.] I am serving on the ISPASS 2021 program committee. [2020.8.] I am serving on the ASPLOS 2021 program committee. [2020.8.] I have served on the MICRO 2020 and SoCC 2020 program committees. [2020.5.] Check out my post on ACM SIGARCH Computer Architecture Today blog about how we are rethinking neural network dataflow in larger scales. [2020.2.] I am happy to join the team of regular contributors of the ACM SIGARCH Computer Architecture Today blog. [2020.2.] I started teaching a undergraduate-level computer architecture course for the Yao class at Tsinghua, beginning from Spring 2020. [2019.9.] I started teaching a graduate-level computer architecture and systems course at Tsinghua, beginning from Fall 2019. [2019.4.] The TANGRAM paper about NN accelerator dataflow scheduling is in ASPLOS 2019. [2019.3.] I am serving on the MICRO 2019 program committee. [2019.3.] I started as an assistant professor at Tsinghua University. Contact Address: Mingyu Gao FIT Building, Room 4-6015 Tsinghua University Beijing, China, 100084 (See office direction, in Chinese) Email: gaomy [at] tsinghua [dot] edu [dot] cn Office Tel: (+86) 10-62781693-1615",
  "content_length": 8293,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:24"
}