{
  "name": "Mingyu Ding",
  "homepage": "https://dingmyu.github.io",
  "status": "success",
  "content": "Mingyu Ding - 丁明宇 Hi there! I am a tenure-track assistant professor at the Department of Computer Science, University of North Carolina at Chapel Hill (UNC). I was a postdoc at BAIR@UC Berkeley working with Masayoshi Tomizuka, a distinguished member of National Academy of Engineering. Prior to that, I was a visiting PhD at CSAIL@MIT with Josh Tenenbaum and received my doctorate from the University of Hong Kong advised by Ping Luo. I finished my undergraduate degrees at Renmin University of China. My research interests lie at the intersection of robotics, embodied AI, and computer vision. I am actively seeking self-motivated students for PhD and intern positions. If you’re interested, please fill out this form before email me with your CV, thanks! News [06/2025] 4 papers accepted at IROS 2025; 2 papers accepted by TPAMI. [05/2025] Our paper won the ICRA 2025 Best Paper Award in Automation. [04/2025] Honored to receive the Amazon Research Award. [04/2025] Invited to give guest lectures at Duke and TAMU. [04/2025] Our paper Physics-Aware Robotic Palletization with Online Masking Inference was nominated as a Finalist for both Best Paper Award in Automation and Best Conference Paper Award at ICRA 2025. [03/2025] Serving as Area Chairs for ICCV, NeurIPS, CVPR, etc. [03/2025] 3 papers accepted at CVPR 2025 with 1 Highlight. [01/2025] 3 papers accepted at ICRA 2025; 2 papers accepted at ICLR 2025 with 1 Oral. Research Highlights My long-term research goal is to build embodied agents that can reason about and interact effectively with the physical world. Robot Learning: embodied AI, robot manipulation, physical simulation, AI agent, self-driving Foundational Models: 3D vision, multimodal LLMs, commonsense reasoning, self-supervised learning ICRA25: Manipulation via Scene Flow IROS25: PhyGrasp ICRA24: RT-X IROS25: ReBot NeurIPS23: EmbodiedGPT CVPR25: DexHandDiff CoRL24: Sparse Diffusion Policy CVPR23: EC for Embodied Control Preprint: Long-Horizon Tasks with LLM Preprint: REMAC CoRL22: Embodied Concept Learner RSS24: Human-oriented Manipulation NeurIPS23 Dataset: Physion++ NeurIPS22: ComPhy Benchmark Recent Publications [Full List] DexHandDiff: Interaction-aware Diffusion Planning for Adaptive Dexterous Manipulation Zhixuan Liang, Yao Mu, Yixiao Wang, Tianxing Chen, Wenqi Shao, Wei Zhan, Masayoshi Tomizuka, Ping Luo, Mingyu Ding CVPR 2025 [paper] [project] [code] ReBot: Scaling Robot Learning with Real-to-Sim-to-Real Robotic Video Synthesis Yu Fang, Yue Yang, Xinghao Zhu, Kaiyuan Zheng, Gedas Bertasius, Daniel Szafir, Mingyu Ding IROS 2025 [paper] [project] [code] Physics-Aware Robotic Palletization with Online Masking Inference Tianqi Zhang, Zheng Wu, Yuxin Chen, Yixiao Wang, Boyuan Liang, Scott Moura, Masayoshi Tomizuka, Mingyu Ding† (corresponding author), Wei Zhan ICRA 2025 (Best Paper Award in Automation) [paper] [code] Sparse Diffusion Policy: A Sparse, Reusable, and Flexible Policy for Robot Learning Yixiao Wang, Yifei Zhang, Mingxiao Huo, Thomas Tian, Xiang Zhang, Yichen Xie, Chenfeng Xu, Pengliang Ji, Wei Zhan, Mingyu Ding† (corresponding author), Masayoshi Tomizuka CoRL 2024 [paper] [project] Open X-Embodiment: Robotic Learning Datasets and RT-X Models Open X-Embodiment Collaboration: Sergey Levine et al. ICRA 2024 (Best Paper Award) [paper] [code] [project] VDT: General-purpose Video Diffusion Transformers via Mask Modeling Haoyu Lu, Guoxing Yang, Nanyi Fei, Yuqi Huo, Zhiwu Lu, Ping Luo, Mingyu Ding ICLR 2024 [paper] [project] Selected Awards 2025 Amazon Research Award 2025 ICRA Best Paper Award in Automation (10/4,250) 2024 ICRA Best Paper Award (2/3,937) 2023 ME Rising Stars, UC Berkeley (30 worldwide/year) 2022 WAIC Rising Stars (15 worldwide/year) 2021 Baidu Fellowship (10 worldwide/year) 2020 Microsoft Fellowship Nomination Award (15 in Asia/year) 2018 Best Student Paper Runner-up Award in 25th ICONIP (2/575) PhD Students 2025 FallSikai Li (B.S. in CS/ECE, UMich-SJTU) 2025 FallJiaqi Liu (B.E. & M.E. in Transportation, Tongji Univ., ranked 1/163; co-advised with Huaxiu Yao) 2025 FallZhenyu Wei (B.E. in CS, SJTU) Best Paper Award in Robot Manipulation and Locomotion at ICRA 2025 2025 FallYunchao Yao (B.S. in CS, UCSD; M.S. in Robotics, CMU RI) 2024 FallYu Fang (M.S. in CS, ShanghaiTech; co-advised with Daniel Szafir) Nature Communications Teachings Fall 2025COMP 790-186 Special Topics: Robot Learning, UNC Spring 2025 Guest Lecture: ME555 Robotic Manipulation, Duke Spring 2025 Guest Lecture: CSCE753 Computer Vision and Robot Perception, TAMU Activities Area Chair for CVPR, NeurIPS, RSS, ICCV, ICLR, WACV, VALSE Session Chair for ICRA 25; Associate Editor for IROS Editorial Board/Guest Editor for Robotics, Mechatronics and Intelligent Machines; Robotics - Embodied Intelligence; Pattern Recognition - Spatial Embodied Intelligence Conference Reviewer for ICML, ICLR, NeurIPS, CVPR, RSS, CoRL, ICRA, IROS, ICCV, ECCV, AAAI, ACMMM, ACC, etc Journal Reviewer for TPAMI, TMLR, IJCV, RA-L, TIP, TCSVT, TMM, TITS, ACM CSUR, etc",
  "content_length": 5010,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:25"
}