{
  "name": "Mingjun Zhong",
  "homepage": "https://www.abdn.ac.uk/people/mingjun.zhong",
  "status": "success",
  "content": "Dr Mingjun Zhong | The University of Aberdeen Dr Mingjun Zhong Dr Mingjun ZhongLecturer About Email Addressmingjun.zhong@abdn.ac.ukSchool/DepartmentSchool of Natural and Computing Sciences Biography I have been a Lecturer in Machine Learning at the Department of Computing Science at the University of Aberdeen since June 2020. My research interests include Machine Learning, Data Science, Data Engineering, Computational Statistics, Computational Sustainability, Machine Learning for Medical Science, etc. If you want to explore more about my research, please check My Publications. Memberships and Affiliations Internal Memberships Currently, I am serving as the director of the MSc IT programme and a Tutor. External Memberships I serve as an Associate Editor for the journal Neural Processing Letters. I serve as a Review Editor for the journal Frontiers in Applied Mathematics and Statistics (Statistics section). I am a FHEA (Fellow of the Higher Education Academy) I review grants for multiple funding bodies, a variety of international journals and several prestigious machine learning and artifial intellegence conferences. Research Research Overview My research interests are mainly (application-driven) machine learning and computational statistics. My research mission is to understand patterns and phenomena observed in real-world data by devising probabilistic and statistical machine learning methodologies. Current Research Currently I am working on the following application domains and inferential machine learning algorithms: Healthcare data Energy Efficiency Spectroscopy data Data Engineering Foundation Models Self-Supervised Learning Causal Inference Markov chain Monte Carlo Supervision I have been supervising a number of PhD students. Teaching Teaching Responsibilities I am teaching the following courses 2025-2026: CS5062 Machine Learning CS5079 Applied AI CS4042 Data Engineering CS4049 Introduction to Machine Learning and Data Mining CS3524 Distributed Systems and Security CS551R & CS5942 MSc IT project 2024-2025: CS5062 Machine Learning CS5079 Applied AI CS4048 Robotics CS3524 Distributed Systems and Security CS551Q Enterprise Software Development CS551R & CS5942 MSc IT project Publications Page 1 of 4 Results 1 to 10 of 35 DSCF: Dual-Source Counterfactual Fusion for High-Dimensional Combinatorial Interventions 2025 - Accepted/In pressDou, J., Luo, L., Zhu, B., Luo, H., Zhong, M., Cheng, Y. Contributions to Conferences: PapersCapsule Network Projectors are Equivariant and Invariant Learners 2025 - PublishedEverett, M., Durrant, A., Zhong, M., Leontidis, G. Transactions on Machine Learning Research, pp. 1-18Contributions to Journals: Articles[ONLINE] https://openreview.net/forum?id=7owCO3qskH[OPEN ACCESS] https://pure.abdn.ac.uk/ws/files/309499851/4991_Capsule_Network_Projector.pdfOmniNet: An Expandable Causal Inference Network for Multiple Modalities 2025 - PublishedZhou, Y., Leontidis, G., Zhong, M. Neural Computing and Applications, vol. 37, no. 19, pp. 13749–13763Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s00521-025-11202-9[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/ad331667-0007-4431-84ba-d2958e145871/downloadMultisource Domain Adaptation for Nonintrusive Load Monitoring Through Data Distillation 2025 - PublishedLuan, W., Zhang, R., Liu, B., Zhong, M., Li, K. IEEE Transactions on Instrumentation and Measurement, vol. 74, 2521611Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TIM.2025.3551567[ONLINE] View publication in ScopusManaging class imbalance in the training of a large language model to predict patient selection for total knee arthroplasty: Results from the Artificial intelligence to Revolutionise the patient Care pathway in Hip and knEe aRthroplastY (ARCHERY) project 2025 - PublishedFarrow, L., Anderson, L., Zhong, M. Knee, vol. 54, pp. 1-8Contributions to Journals: Articles[ONLINE] https://www.sciencedirect.com/science/article/pii/S0968016025000213[ONLINE] DOI: https://doi.org/10.1016/j.knee.2025.02.007[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/c82322ac-e840-41f8-908c-75ac44959994/downloadA systematic review of natural language processing applications in Trauma & Orthopaedics 2025 - PublishedFarrow, L., Raja, A., Zhong, M., Anderson, L. Bone and Joint Open, vol. 6, no. 3, pp. 264-274Contributions to Journals: Review articles[ONLINE] DOI: https://doi.org/10.1302/2633-1462.63.BJO-2024-0081.R1[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/47b1733e-7308-4f45-bc2a-5a38d09e92d4/download[ONLINE] View publication in ScopusMasked Capsule Autoencoders 2025 - PublishedEverett, M., Zhong, M., Leontidis, G. Transactions on Machine Learning Research, pp. 1-15Contributions to Journals: Articles[ONLINE] https://openreview.net/pdf?id=JHxrh00W1j[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/7d6c983d-e42c-4c70-adb0-a323e95064f4/download[ONLINE] https://openreview.net/forum?id=JHxrh00W1jExploring the use of biphasic quantitative thoracic computed tomography to evaluate halo-pelvic traction in managing severe adolescent idiopathic scoliosis 2024 - PublishedZhou, J., Zhao, Z., Cai, Q., Zhong, M. Quantitative Imaging in Medicine and Surgery, vol. 14, no. 12, pp. 8429-8442Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.21037/qims-24-568[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/6649f238-0896-4284-84a9-27ed30879cf2/download[ONLINE] View publication in ScopusLeOCLR: Leveraging Original Images for Contrastive Learning of Visual Representations 2024 - PublishedAlkhalefi, M. A. M. A. A., Leontidis, G., Zhong, M. Transactions on Machine Learning Research, pp. 1-16Contributions to Journals: Articles[ONLINE] https://openreview.net/forum?id=y8qGOvUn1r[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/addb9cc4-62ce-48f8-90f5-55bc1c9202f3/downloadSemantic Positive Pairs for Enhancing Visual Representation Learning of Instance Discrimination methods 2024 - PublishedAlkhalefi, M. A. M. A. A., Leontidis, G., Zhong, M. Transactions on Machine Learning Research, vol. 2024, no. 4, pp. 1-17Contributions to Journals: Articles[ONLINE] https://openreview.net/forum?id=z5AXLMBWdU&nesting=2&sort=date-desc[ONLINE] DOI: https://doi.org/10.48550/arXiv.2306.16122[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/eef0ffba-1c20-4efa-b95d-09174e253324/download[ONLINE] Open peer review reports Show 10 | 25 | 50 | 100 results per page Refine Chapters in Books, Reports and Conference Proceedings Conference Proceedings (12) Contributions to Conferences Papers (1) Contributions to Journals Articles (18) Conference Articles (1) Review articles (1) Working Papers Preprint Papers (2) Update",
  "content_length": 6648,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:23"
}