{
  "name": "Ming-Hsuan Yang 0001",
  "homepage": "https://faculty.ucmerced.edu/mhyang",
  "status": "success",
  "content": "Ming-Hsuan Yang's Home Page Ming-Hsuan Yang I work on computer vision and related problems. Basic Information Brief Biography Math Genealogy Office: Electrical Engineering and Computer Science Science and Engineering 2 216 University of California at Merced Merced, CA 95344 Email: mhyang at ucmerced dot edu Phone: 209-228-4677 Prospective PhD students Please see this for details. Research Vision and Learning Lab Journal Papers Conference Papers DBLP Google Scholar Professional Activities Teaching Courses Tutorials Lab Members PhD Students Yu-Ju Tsai, 2022-present (Chancellor's Graduate Fellowship) Weijie Lyu, 2023-present Kuan-Chih Huang, 2023-present Tiancheng Shen, 2024-present Haobo Yuan, 2024-present Hsin-Ying Lee, 2024-present Freeman Cheng, 2025-present Shuo Chen, 2025-present (Earle C. Anthony Fellowship) Former Students/Postdocs Hsin-Ping Huang, 2020-2025 (Meta Fellowship Finalist). Now with Apple. Chieh Hubert Lin, 2020-2025 (Snap Fellowship Honorable Mention). Tiantian Wang, 2018-2025 (Graduate Dean's Dissertation Fellowship). Lu Qi, 2022-2024 Yi-Wen Chen, 2019-2024 (Fred and Mitzie Ruiz Fellowship and Graduate Dean's Dissertation Fellowship). Chun-Han Yao, 2019-2023 (GSOP Fellowship). Now with Stability AI. Taihong Xiao, 2018-2023. Now with Google DeepMind. Xueting Li, PhD, 2021 (Nvidia Fellowship, Google Fellowship, and EECS Rising Stars). Now with Nvidia. Hung-Yu Tseng, PhD, 2021 (Graduate Group Recruitment Fellowship). Now with Meta. Wei-Chih Hung, PhD, 2020. Now with Waymo. Hsin-Ying Lee, PhD, 2020 (Chancellor's Fellowship). Now with Snap. Wei-Sheng Lai, PhD, 2019 (Snap Fellowship Honorable Mention and Facebook Fellowship Finalist). Now with Google. Yijun Li, PhD, 2019 (Facebook Fellowship, Adobe Fellowship, and Snap Fellowship). Now with Adobe. Sifei Liu, PhD, 2017 (Baidu Scholarship and EECS Rising Stars). Now with Nvidia. Yi-Hsuan Tsai , PhD, 2017 (Graduate Dean's Dissertation Research Fellowship). Now with Google. Zhe Hu , PhD, 2015 (Graduate Dean's Dissertation Research Fellowship). Now with Apple. Chih-Yuan Yang, PhD, 2015. Now with Chang Gung University, Taiwan. Jimei Yang, PhD, 2015 (Graduate Dean's Dissertation Research Fellowship). Now with Runway. Siddharth Seth, MS, 2025 Rakesh Jasti, MS, 2020 Yu-Ding Lu, MS, 2020 Yu-Ting Chang, MS, 2020 Nakul Agarwal, MS, 2019 Han-Kai Hsu, MS, 2018 Simon Safar, MS, 2014 Zaihong Shuai, MS, 2010 Visting Students Junyi Zhang, 2024-2024 Botao Ye, 2023-2023 Xiangyu Xu, 2016-2017 Wenqi Ren, 2015-2016 Dong Li, 2016-2016 Jinshan Pan, 2014-2016 Chao Ma, 2013-2015 Yi-Ting Chen, 2014-2015 Rachit Dubey, 2014-2014 Jia-Bin Huang, 2009-2009 Full list",
  "content_length": 2643,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:19"
}