{
  "name": "Mingwei Liu 0002",
  "homepage": "https://mingwei-liu.github.io",
  "status": "success",
  "content": "Dr. Liu Mingwei (刘名威) School of Software Engineering, Room 323, Sun Yat-Sen University (Zhuhai Campus) Dr. Mingwei Liu (刘名威) is presently serving as an Associate Professor at the School of Software Engineering, Sun Yat-Sen University, China. Before joining Sun Yat-Sen University, he completed his postdoctoral research at Fudan University in 2024. He received his Ph.D. and B.E. degrees in Software Engineering from Fudan University in 2022 and 2017, respectively. During his academic tenure, he had the invaluable opportunity to work under the guidance and mentorship of Xin Peng. Dr. Liu’s research focuses on the intersection of Software Engineering (SE) and Artificial Intelligence (AI), specifically in the domains of AI4SE and SE4AI. His primary interest lies in leveraging advanced AI technologies, such as large language models (LLMs) and knowledge graphs (KGs), to address software engineering challenges and tackle the software engineering and system engineering problems prevalent in AI applications and scenarios. Dr. Liu has published over twenty papers in top international journals and conferences in the field of software engineering, such as TSE, TOSEM, ICSE, FSE, and ASE. He has received several prestigious awards, including the IEEE TCSE Distinguished Paper Award (ICSME 2018) and the ACM SIGSOFT Distinguished Paper Award (FSE 2023). I am looking for self-motivated undergraduate/master/Phd students interested in SE and AI. Please drop me an email if you are interested in working with me! The website for our lab: sysuselab.github.io. news Jul 05, 2024 Our paper titled “TIGER: A Generating-Then-Ranking Framework for Practical Python Type Inference” is accepted by ICSE 2025, Preprint Jul 04, 2024 Check out our preprint titled “Beyond Functional Correctness: Investigating Coding Style Inconsistencies in Large Language Models”, Preprint Jun 06, 2024 Check out our preprint titled “STALL+: Boosting LLM-based Repository-level Code Completion with Static Analysis”, Preprint Jun 05, 2024 Check out our preprint titled “Vul-RAG: Enhancing LLM-based Vulnerability Detection via Knowledge-level RAG”, Preprint Jun 01, 2024 I joined the School of Software Engineering at Sun Yat-Sen University as an Associate Professor. May 20, 2024 One paper titled “Evaluating and Improving ChatGPT for Unit Test Generation” is accepted to FSE 2024. Paper May 15, 2024 One paper titled “Revisiting The Retrieval-Augmentation Strategy In Code Completion “ got accepted in JSS 2023. Paper Mar 25, 2024 Check out the ClassEval Leaderboard for evaluating the most recent LLMs on class-level code generation. for evaluating the most recent LLMs on class-level code generation. Feel free to contact us to submit new results. Dec 20, 2023 Check out our preprint titled “Resolving Crash Bugs via Large Language Models: An Empirical Study”, Preprint Dec 05, 2023 One paper titled “Evaluating Large Language Models in Class-Level Code Generation” got accepted in ICSE 2024, Paper Dec 04, 2023 Our work won ACM SIGSOFT Distinguished Paper Award at ESEC/FSE 2023, Paper Aug 20, 2023 Check out our manually-crafted benchmark ClassEval for evaluating LLMs on class-level code generation. Any feedback would be appreciated for help us improve the benchmark. GitHub, Preprint Aug 15, 2023 Check out our preprint for evaluating instruction-tuned LLMs on code comprehension tasks, Preprint Aug 10, 2023 One paper titled “Recommending Analogical APIs via Knowledge Graph Embedding” got accepted in ESEC/FSE 2023, Paper Aug 05, 2023 One paper titled “CodeGen4Libs: A Two-stage Approach for Library-oriented Code Generation” got accepted in ASE 2023, Paper, GitHub Jul 20, 2023 One paper titled “Knowledge Graph based Explainable Question Retrieval for Programming Tasks” got accepted in ICSME 2023, Paper May 20, 2023 Check out our preprint on ChatGPT-based unit test generation. Preprint May 12, 2023 One paper titled “Task-Oriented ML/DL Library Recommendation based on a Knowledge Graph” got accepted in TSE 2023 , Paper Mar 20, 2023 One paper titled “KG4CraSolver: Recommending Crash Solutions via Knowledge Graph” got accepted in ESEC/FSE 2023, Paper Feb 20, 2023 One paper titled “Research on Knowledge Graph Representation Learning Methods for Link Prediction: A Review” got accepted in JSS 2023. Paper Feb 10, 2023 One paper titled “XCoS: Explainable Code Search based on Query Scoping and Knowledge Graph” got accepted in TOSEM 2023, Paper Jun 16, 2022 I joined Fudan University as a Postdoctoral fellow, working with Prof. Xin Peng. Jun 15, 2022 I received my Ph.D degree from Fudan University. selected publications ASE 2023 CodeGen4Libs: A Two-Stage Approach for Library-Oriented Code Generation Mingwei Liu ,  Tianyong Yang ,  Yiling Lou , and 3 more authors In 38th IEEE/ACM International Conference on Automated Software Engineering, ASE 2023, Luxembourg, September 11-15, 2023 , 2023 Abs Bib PDF Code Dataset Automated code generation has been extensively studied in recent literature. In this work, we first survey 66 participants to motivate a more pragmatic code generation scenario, i.e., library-oriented code generation, where the generated code should implement the functionally of the natural language query with the given library. We then revisit existing learning-based code generation techniques and find they have limited effectiveness in such a library-oriented code generation scenario. To address this limitation, we propose a novel library-oriented code generation technique, CodeGen4Libs, which incorporates two stages: import generation and code generation. The import generation stage generates import statements for the natural language query with the given third-party libraries, while the code generation stage generates concrete code based on the generated imports and the query. To evaluate the effectiveness of our approach, we conduct extensive experiments on a dataset of 403,780 data items. Our results demonstrate that CodeGen4Libs outperforms baseline models in both import generation and code generation stages, achieving improvements of up to 97.4% on EM (Exact Match), 54.5% on BLEU, and 53.5% on Hit@All. Overall, our proposed CodeGen4Libs approach shows promising results in generating high-quality code with specific third-party libraries, which can improve the efficiency and effectiveness of software development. @inproceedings{DBLP:conf/kbse/LiuYLDWP23, author = {Liu, Mingwei and Yang, Tianyong and Lou, Yiling and Du, Xueying and Wang, Ying and Peng, Xin}, title = {CodeGen4Libs: {A} Two-Stage Approach for Library-Oriented Code Generation}, booktitle = {38th {IEEE/ACM} International Conference on Automated Software Engineering, {ASE} 2023, Luxembourg, September 11-15, 2023}, pages = {434--445}, publisher = {{IEEE}}, year = {2023}, url = {https://doi.org/10.1109/ASE56229.2023.00159}, doi = {10.1109/ASE56229.2023.00159}, timestamp = {Thu, 16 Nov 2023 09:03:51 +0100}, biburl = {https://dblp.org/rec/conf/kbse/LiuYLDWP23.bib}, bibsource = {dblp computer science bibliography, https://dblp.org}, dimensions = {true}, } ESEC/FSE 2023 KG4CraSolver: Recommending Crash Solutions via Knowledge Graph Xueying Du ,  Yiling Lou ,  Mingwei Liu , and 2 more authors In Proceedings of the 31st ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering, ESEC/FSE 2023, San Francisco, CA, USA, December 3-9, 2023 , 2023 Abs Bib PDF Fixing crashes is challenging, and developers often discuss their encountered crashes and refer to similar crashes and solutions on online Q&A forums (e.g., Stack Overflow). However, a crash often involves very complex contexts, which includes different contextual elements, e.g., purposes, environments, code, and crash traces. Existing crash solution recommendation or general solution recommendation techniques only use an incomplete context or treat the entire context as pure texts to search relevant solutions for a given crash, resulting in inaccurate recommendation results. In this work, we propose a novel crash solution knowledge graph (KG) to summarize the complete crash context and its solution with a graph-structured representation. To construct the crash solution KG automatically, we propose to leverage prompt learning to construct the KG from SO threads with a small set of labeled data. Based on the constructed KG, we further propose a novel KG-based crash solution recommendation technique KG4CraSolver, which precisely finds the relevant SO thread for an encountered crash by finely analyzing and matching the complete crash context based on the crash solution KG. The evaluation results show that the constructed KG is of high quality and KG4CraSolver outperforms baselines in terms of all metrics (e.g., 13.4%-113.4% MRR improvements). Moreover, we perform a user study and find that KG4CraSolver helps participants find crash solutions 34.4% faster and 63.3% more accurately. @inproceedings{DBLP:conf/sigsoft/DuLL0Y23, author = {Du, Xueying and Lou, Yiling and Liu, Mingwei and Peng, Xin and Yang, Tianyong}, editor = {Chandra, Satish and Blincoe, Kelly and Tonella, Paolo}, title = {KG4CraSolver: Recommending Crash Solutions via Knowledge Graph}, booktitle = {Proceedings of the 31st {ACM} Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering, {ESEC/FSE} 2023, San Francisco, CA, USA, December 3-9, 2023}, pages = {1242--1254}, publisher = {{ACM}}, year = {2023}, url = {https://doi.org/10.1145/3611643.3616317}, doi = {10.1145/3611643.3616317}, timestamp = {Mon, 04 Dec 2023 12:10:56 +0100}, biburl = {https://dblp.org/rec/conf/sigsoft/DuLL0Y23.bib}, bibsource = {dblp computer science bibliography, https://dblp.org}, dimensions = {true}, } ESEC/FSE 2023 Recommending Analogical APIs via Knowledge Graph Embedding Mingwei Liu ,  Yanjun Yang ,  Yiling Lou , and 4 more authors In Proceedings of the 31st ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software ",
  "content_length": 18576,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:24"
}