{
  "name": "Mingda Qiao",
  "homepage": "https://sites.google.com/site/acmonsterqiao",
  "status": "success",
  "content": "Mingda QiaoSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeI am an Assistant Professor in UMass Amherst's Manning College of Information and Computer Sciences, working on learning theory and theoretical computer science in general.Previously, I was a FODSI postdoc at UC Berkeley and MIT hosted by Nika Haghtalab and Ronitt Rubinfeld. I received my PhD in Computer Science from Stanford University, where I was advised by Gregory Valiant. Prior to that, I received my B.Eng. in Computer Science from Yao Class at Tsinghua University.If you are interested in working with me at UMass, apply to our PhD program (see here for details) and mention my name in your application.TeachingFall 2025: COMPSCI 514: Algorithms for Data Science.Research InterestsMy research interests lie in learning theory and theoretical computer science in general. Below is a clustering of part of my recent work:Theoretical aspects of prediction, learning, and decision-making in online settings: [QV STOC'21, QV COLT'21, QV ITCS'23, QZ COLT'24, HQYZ NeurIPS'24, QZ COLT'25, LQ NeurIPS'25]Theoretical foundations of collaborative and federated learning, from both learning- and game-theoretic perspectives: [DQ ICML'24, HQY SODA'25, HMQ NeurIPS'25]New and simple approaches to dealing with adversarial corruption and heterogeneity in statistical inference: [QGRDZ NeurIPS'22, KQS ITCS'24]Selected Papers (Full List)Truthfulness of Decision-Theoretic Calibration Measures. COLT 2025Mingda Qiao, Eric Zhao[arXiv][conference version][Eric's blog post]Truthfulness of Calibration Measures. NeurIPS 2024Nika Haghtalab, Mingda Qiao, Kunhe Yang, Eric Zhao[arXiv][conference version]On the Distance from Calibration in Sequential Prediction. COLT 2024Mingda Qiao, Letian Zheng[arXiv][conference version]Properly Learning Decision Trees in Almost Polynomial Time. FOCS 2021Guy Blanc, Jane Lange, Mingda Qiao, Li-Yang Tan[arXiv][conference version][journal version][video][Guy's TCS+ talk]Invited to FOCS 2021 special issueJournal of the ACM, 2022Stronger Calibration Lower Bounds via Sidestepping. STOC 2021Mingda Qiao, Gregory Valiant[arXiv][conference version][video]Professional ServicesProgram Committee: COLT 2025 (Senior PC)Conference Reviewer: STOC (2020, 2024), FOCS (2021, 2025), SODA (2024, 2025), ITCS (2024, 2025), ICML (2019, 2023--2025), NeurIPS (2019, 2021--2025), AISTATS (2019--2022, 2024, 2025)Journal Reviewer: SIAM Journal on Computing (SICOMP), Journal of Machine Learning Research (JMLR), IEEE Transactions on Information Theory, Transactions on Machine Learning Research (TMLR)Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:19"
}