{
  "name": "Mingshuai Chen",
  "homepage": "https://fiction-zju.github.io/author/mingshuai-chen",
  "status": "success",
  "content": "Mingshuai Chen | Formal Verification Group Search Mingshuai Chen ZJU100 Young Professor Zhejiang University I am a US-equivalent tenure-track Assistant Professor leading the Formal Verification Group at Zhejiang University. Prior to joining ZJU, I worked as a Postdoctoral Researcher at the Software Modeling and Verification Group headed by Prof. Joost-Pieter Katoen at RWTH Aachen University. In 2019, I received the Ph.D. degree in computer science from the Institute of Software, Chinese Academy of Sciences under the supervision of Prof. Naijun Zhan and co-supervision of Prof. Martin Fränzle. My primary research interest lies in formal verification and synthesis, broadly construed in mathematical logic and theoretical computer science. I develop formal reasoning techniques for programs and hybrid discrete-continuous systems for ensuring the reliability and effectiveness of safety-critical software systems while pushing the limits of automation as far as possible. I appreciate – and have been constantly fascinated by – the elegance of mathematical aspects of computer science as well as its impact on real-world applications. See the research statement for my faculty application at ZJU. I have been awarded the NSFC Excellent Young Scientists Fund Program (Overseas) (one of the most prestigious grants for young researchers across China), the Distinguished Paper Award at ATVA 2018, Best Paper Award at FMAC 2019, and the CAS-President Special Award in 2019 (1st awardee from ISCAS ever since its inception in 1985). My research results have been partially applied in the control-program verification of the Chinese lunar lander Chang’e-3 and CTCS-3 high-speed railway system. Check out my CV for more detailed information. Interests Logical Aspects of Computer Science Formal Verification and Synthesis Programming Theory/Languages Probabilistic/Quantum Systems Cyber-Physical Systems AI for Formal Methods Employment ZJU100 Young Professor, 2023.01 - Present Zhejiang University Postdoctoral Researcher, 2019.09 - 2022.11 RWTH Aachen University Education Ph.D. in Computer Science, 2019 Institute of Software, Chinese Academy of Sciences B.Sc. in Computer Science, 2013 Jilin University Academic Services I serve on the following academic committees. Consider submit your work to one of the venues! Editor & Committee Chair Program Co-Chair of QEST+FORMATS 2026 Workshop Chair of ICFEM 2025 Guest Co-Editor of Special Issue on Formal Methods and Their Applications of Journal of Software Co-Chair of Forum on Formal Methods and Their Applications at ChinaSoft 2024 Co-Chair of Forum on Theory and Engineering of Software under Uncertainty at ChinaSoft 2024 Committee Member Senior Member of the China Computer Federation (CCF) Executive Member of CCF Technical Committee on Formal Methods Member of CCF Technical Committee on Theoretical Computer Science Reviewer Panel of Mathematical Reviews Program/Review Committee Member of CAV 2026, OOPSLA 2026, TACAS 2026/2025, ICFEM 2025, ATVA 2025, TASE 2025, FSEN 2025, SETSS 2025, SETTA 2024, RTCSA 2024/2021, ICWS 2024 (SRG Workshop), SYNASC 2022 (Logic and Programming Track) Repeatability/Artifact Evaluation Committee Member of ADHS 2021, VMCAI 2021 Publications Dissertation Mingshuai Chen (2019). Verification and Synthesis of Time-Delayed Dynamical Systems. Cite Slides CAS-President Special Award Book Chapters Shenghua Feng, Tengshun Yang, Mingshuai Chen, Naijun Zhan (2024). A Unified Framework for Quantitative Analysis of Probabilistic Programs. JPK’s Festschrift. PDF Cite DOI Mingshuai Chen, Xiao Han, Tao Tang, Shuling Wang, Mengfei Yang, Naijun Zhan, Hengjun Zhao, Liang Zou (2017). MARS: A Toolchain for Modelling, Analysis and Verification of Hybrid Systems. ProCoS. PDF Cite Code DOI Journal Articles Zhuoruo Zhang, Rui Chang, Mingshuai Chen, Wenbo Shen, Chenyang Yu, He Huang, Qinming Dai, Yongwang Zhao (2025). PA-Boot: A Formally Verified Authentication Protocol for Multiprocessor Secure Boot under Hardware Supply-chain Attacks. IEEE Trans. Inf. Forensics Secur.. PDF Cite Debin Xiang, Liqiang Lu, Siwei Tan, Xinghui Jia, Zhe Zhou, Guangyu Sun, Mingshuai Chen, Jianwei Yin (2025). AdaptDQC: Adaptive Distributed Quantum Computing with Quantitative Performance Analysis. IEEE Trans. Comput.. Cite Zhongyi Wang, Mingshuai Chen, Tengjie Lin, Linyu Yang, Junhao Zhuo, Qiuye Wang, Shengchao Qin, Xiao Yi, Jianwei Yin (2025). Parf: An Adaptive Abstraction-Strategy Tuner for Static Analysis. J. Comput. Sci. Technol.. PDF Cite DOI 2nd Prize@ChinaSoft'24 Siwei Tan, Liqiang Lu, Congliang Lang, Mingshuai Chen, Jianwei Yin (2024). Fast-USYN: Fast Synthesis from Unitary Matrices to High-Quality Quantum Circuits. J. Softw.. PDF Cite Jintao Chen, Fan Wang, Shengye Pang, Mingshuai Chen, Meng Xi, Tiancheng Zhao, Jianwei Yin (2024). A Privacy Policy Text Compliance Reasoning Framework with Large Language Models for Healthcare Services. Tsinghua Sci. Tech.. PDF Cite Lutz Klinkenberg, Christian Blumenthal, Mingshuai Chen, Darion Haase, Joost-Pieter Katoen (2024). Exact Bayesian Inference for Loopy Probabilistic Programs using Generating Functions. Proc. ACM Program. Lang. (OOPSLA). PDF Cite Artifact Evaluated Shenghua Feng, Mingshuai Chen, Han Su, Benjamin Lucien Kaminski, Joost-Pieter Katoen, Naijun Zhan (2023). Lower Bounds for Possibly Divergent Probabilistic Programs. Proc. ACM Program. Lang. (OOPSLA). PDF Cite Poster Slides DOI Qiuye Wang, Mingshuai Chen, Bai Xue, Naijun Zhan, Joost-Pieter Katoen (2022). Encoding Inductive Invariants as Barrier Certificates. Inf. Comput.. PDF Cite Code Slides DOI Jian Wang, Jie An, Mingshuai Chen, Naijun Zhan, Lulin Wang, Miaomiao Zhang, Ting Gan (2020). From Model to Implementation: A Network Algorithm Programming Language. Sci. China Inf. Sci.. PDF Cite Code DOI Mingshuai Chen, Martin Fränzle, Yangjia Li, Peter Nazier Mosaad, Naijun Zhan (2020). Indecision and Delays are the Parents of Failure. Acta Inform.. PDF Cite Code Slides Video DOI Martin Fränzle, Mingshuai Chen, Paul Kröger (2019). In Memory of Oded Maler: Automatic Reachability Analysis of Hybrid-State Automata. ACM SIGLOG News. PDF Cite DOI Ting Gan, Mingshuai Chen, Yangjia Li, Bican Xia, Naijun Zhan (2018). Reachability Analysis for Solvable Dynamical Systems. IEEE Trans. Automat. Contr.. PDF Cite Code DOI Conference Papers Yutao Sun, Mingshuai Chen, Tiancheng Zhao, Kangjia Zhao, He Li, Jintao Chen, Zhongyi Wang, Liqiang Lu, Xinkui Zhao, Shuiguang Deng, Jianwei Yin (2025). Horae: A Domain-Agnostic Language for Automated Service Regulation. In IJCAI 2025. PDF Cite Code Dataset DOI Zhongyi Wang, Tengjie Lin, Mingshuai Chen, Mingqi Yang, Haokun Li, Xiao Yi, Shengchao Qin, Jianwei Yin (2025). Preguss: It Analyzes, It Specifies, It Verifies. In LMPL 2025. PDF Cite DOI Yutao Sun, Mingshuai Chen, Tiancheng Zhao, Ruochen Xu, Zilun Zhang, Jianwei Yin (2025). The Self-Improvement Paradox: Can Language Models Bootstrap Reasoning Capabilities without External Scaffolding?. In ACL 2025. PDF Cite Sergei Novozhilov, Mingqi Yang, Mingshuai Chen, Zhiyang Li, Jianwei Yin (2025). On the Almost-Sure Termination of Probabilistic Counter Programs. In CAV 2025. PDF Cite DOI Artifact Evaluated Kaiwen Zhou, Liqiang Lu, Debin Xiang, Chenning Tao, Anbang Wu, Jingwen Leng, Fangxin Liu, Mingshuai Chen, Jianwei Yin (2025). Vegapunk: Accurate and Fast Decoding for Quantum LDPC Codes with Online Hierarchical Algorithm and Sparse Accelerator. In MICRO 2025. Cite Wuwei Tian, Liqiang Lu, Siwei Tan, Shiyu Li, Hengyi Li, Tianyao Chu, Xuhong Zhang, Mingshuai Chen, Jianwei Yin (2025). YOUTIAO: Hybrid Multiplexing with Dynamic Qubit Grouping for Low-cost and Scalable Quantum Wiring. In MICRO 2025. Cite Jintao Chen, Fan Wang, Shengye Pang, Siwei Tan, Mingshuai Chen, Tiancheng Zhao, Meng Xi, Jianwei Yin (2024). UniGM: Unifying Multiple Pre-trained Graph Models via Adaptive Knowledge Aggregation. In ACM MM 2024. PDF Cite Code DOI Zhongyi Wang, Linyu Yang, Mingshuai Chen, Yixuan Bu, Zhiyang Li, Qiuye Wang, Shengchao Qin, Xiao Yi, Jianwei Yin (2024). Parf: Adaptive Parameter Refining for Abstract Interpretation. In ASE 2024. PDF Cite Code Slides Video DOI 2nd Prize@ChinaSoft'24 Yican Sun, Ruyi Ji, Jian Fang, Xuanlin Jiang, Mingshuai Chen, Yingfei Xiong (2024). Proving Functional Program Equivalence via Directed Lemma Synthesis. In FM 2024. PDF Cite DOI Artifact Evaluated Yutao Sun, Mingshuai Chen, Kangjia Zhao, Jintao Chen (2024). Horae: A Domain-Agnostic Modeling Language for Automating Multimodal Service Regulation. In ICWS (SRG) 2024. PDF Cite DOI Siwei Tan, Debin Xiang, Liqiang Lu, Junlin Lu, Qiuping Jiang, Mingshuai Chen, Jianwei Yin (2024). MorphQPV: Exploiting Isomorphism in Quantum Programs to Facilitate Confident Verification. In ASPLOS 2024. PDF Cite Code DOI Artifact Evaluated Siwei Tan, Liqiang Lu, Hanyu Zhang, Jia Yu, Congliang Lang, Yongheng Shang, Xinkui Zhao, Mingshuai Chen, Yun Liang, Jianwei Yin (2024). QuFEM: Fast and Accurate Quantum Readout Calibration Using the Finite Element Method. In ASPLOS 2024. PDF Cite Code DOI Mingqi Yang, Kevin Batz, Mingshuai Chen, Joost-Pieter Katoen, Zhiang Wu, Jianwei Yin (2024). Latticed Craig Interpolation with an Application to Probabilistic Verification. In CIBD 2024. PDF Cite Kevin Batz, Mingshuai Chen, Sebastian Junges, Benjamin Lucien Kaminski, Joost-Pieter Katoen, Christoph Matheja (2023). Probabilistic Program Verification via Inductive Synthesis of Inductive Invariants. In TACAS 2023. PDF Cite DOI Artifact Evaluated Lutz Klinkenberg, Tobias Winkler, Mingshuai Chen, Joost-Pieter Katoen (2023). Exact Probabilistic Inference Using Generating Functions. In LAFI 2023. PDF Cite Code Mingshuai Chen, Joost-Pieter Katoen, Lutz Klinkenberg, Tobias Winkler (2022). Does a Program Yield the Right Distribution?. In CAV 2022. PDF Cite DOI Artifact Evaluated Kevin Batz, Mingshuai Chen, Benjamin Lucien Kaminski, Joost-Pieter Katoen, Christoph Matheja, Philipp Schröer (2021). Latticed $k$-Induction with an Application to Pro",
  "content_length": 12645,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:23"
}