{
  "name": "Minhao Cheng",
  "homepage": "https://cmhcbb.github.io",
  "status": "success",
  "content": "Minhao Cheng - Minhao Cheng Minhao ChengAssistant Professor in College of IST at Penn State Follow State College, PA Email Twitter Github Google Scholar ORCIDI am an assistant professor in the College of Information Sciences and Technology at Penn State. I obtained my Ph.D. degree in the Department of Computer Science from the University of California, Los Angeles under the supervision of Prof. Cho-Jui Hsieh. Before joining Penn State, I was an assistant professor of Computer Science & Engineering at HKUST. My research interest is broadly on machine learning with a focus on trustworthy machine learning and AutoML.News[June 2025] We have also organized a workshop on multimodal reasoning. Looking forward to your submissions![June 2025] We will give a tutorial on multimodal reasoning in CVPR 2025.[July 2024] We initiate TurningPoint AI, a AIGC Research Collaboration group across different institutes. Check our recent amazing progress![Janaury 2024] I’m always looking for highly motivated students to join my group. Please email me if you are interested. [Janaury 2024] I will join College of Information Sciences and Technology at Penn State University in Spring 2024.[August 2021] I joined Department of Computer Science and Engineering at Hong Kong Unverisity of Science and Technology (HKUST) in Winter 2022.[April 2021] Our paper on Rethinking Architecture Selection in Differentiable NAS won the outstanding paper award at ICLR 2021.[March 2021] I have passed my PhD defense: On the Robustness of Neural Network: Attacks and Defenses.EducationPh.D. in Computer Science, Univerisity of California, Los Angeles, 2021B.Eng. in Computer Science, Univerisity of Electronic Science and Technology of China, 2015Work experience2022.1-2023.12: Assistant Professor, HKUST, Hong KongSummer 2020: Research Intern, Microsoft, Redmond, WASummer 2019: Research Intern, IBM Research, Yorktown Heights, NYSummer 2017: Research Intern, Rakuten Slice, San Mateo, CAAwardICLR 2021 Outstanding Paper AwardTalksBeyond Generation: Enabling Detection and Traceability in Large Language Models through WatermarkingPost-Hoc Security in Machine Learning SystemsLLM securityTowards Trustworthy Machine Learning: Training-time and Test-time IntegrityIntroduction on ChatGPTTeaching[Spring 2026] IST 597: Trustworthy Machine Learning[Fall 2025] IST 815: Foundations of Information Security and Assurance[Fall 2024] CYBER 362: Cybersecurity Analytics Studio[Spring 2024] CYBER 362: Cybersecurity Analytics Studio[Fall 2023] COMP 5212: Machine Learning[Spring 2023] COMP 6211I: Trustworthy Machine Learning[Fall 2022] COMP 5212: Machine LearningCurrent StudentsZhimeng Guo (PhD @ Penn State IST, Spring 2024 - Present)Zeyu Qin (PhD @ HKUST CSE, Fall 2022 - Present)Rui Min ( PhD @ HKUST CSE, Spring 2023 - Present)Kuan Li (PhD @ HKUST CSE, Fall 2023 - Present)AlumniSen Li (MPhil @ HKUST CSE, Fall 2022 - Summer 2024)Yize Cheng (UG @ HKUST, Fall 2022 - Winter 2023, Now PhD student @ University of Maryland)Wenbin Hu (UG @ HKUST, Fall 2022 - Winter 2023, Now MPhil student @ HKUST)Yihan Bai (UG @ HKUST, Summer 2023 - Summer 2024)Liaoyaqi Wang (Research Intern, Summer 2023 - Spring 2024, Now Master student @ Johns Hopkins University)Liying Li (Research Intern, Summer 2023 - Spring 2024, Now MPhil student @ Hong Kong Polytechnic University (PolyU))Jaechual Roh (UG @ HKUST, Winter 2022 - Spring 2022, Now PhD student @ UMass Amherst)Publications* denote equal contributionSparse MeZO: Less Parameters for Better Performance in Zeroth-Order LLM Fine-Tuning, Yong Liu, Zirui Zhu, Chaoyu Gong, Minhao Cheng, Cho-Jui Hsieh, Yang You. To appear in Advances in Neural Information Processing Systems (NeurIPS), 2025.Practical and Effective Code Watermarking for Large Language Models, Zhimeng Guo, Minhao Cheng. To appear in Advances in Neural Information Processing Systems (NeurIPS), 2025.Defense Against Syntactic Textual Backdoor Attacks with Token Substitution, Xianwen He, Xinglin Li, Yao Li, and Minhao Cheng. To appear in IEEE Transactions on Information Forensics and Security (T-IFS), 2025. (a short version appears in NeurIPS Workshop on Robustness in Sequence Modeling, 2022)Scaling Laws of Synthetic Data for Language Models, Zeyu Qin, Qingxiu Dong, Xingxing Zhang , Li Dong, Xiaolong Huang, Ziyi Yang, Mahmoud Khademi, Dongdong Zhang, Hany Hassan Awadalla, Yi R. Fung, Weizhu Chen, Minhao Cheng, Furu Wei, To appear in Conference on Language Modeling (COLM), 2025. [PDF]CLIPErase: Efficient Unlearning of Visual-Textual Associations in CLIP, Tianyu Yang, , Lisen Dai, Xiangqi Wang, Minhao Cheng, Yapeng Tian, Xiangliang Zhang, In Proceedings of Association for Computational Linguistics (ACL), 2025. [PDF]LaRA: Benchmarking Retrieval-Augmented Generation and Long-Context LLMs – No Silver Bullet for LC or RAG Routing, Kuan Li, Liwen Zhang, Yong Jiang, Pengjun Xie, Fei Huang, Shuai Wang, Minhao Cheng, In International Conference on Machine Learning (ICML), 2025. [PDF]Improving Your Model Ranking on Chatbot Arena by Vote Rigging, Rui Min, Tianyu Pang, Chao Du, Qian Liu, Minhao Cheng, Min Lin, In International Conference on Machine Learning (ICML), 2025. [PDF]Leveraging Reasoning with Guidelines to Elicit and Utilize Knowledge for Enhancing Safety Alignment, Haoyu Wang*, Zeyu Qin*, Li Shen, Xueqian Wang, Dacheng Tao, Minhao Cheng, In International Conference on Machine Learning (ICML), 2025. [PDF]SeedLoRA: A Fusion Approach to Efficient LLM Fine-Tuning, Yong Liu, Di Fu, Shenggan Cheng, Zirui Zhu, Yang Luo, Minhao Cheng, Cho-Jui Hsieh, Yang You, In International Conference on Machine Learning (ICML), 2025. [PDF]MOSSBench: Is Your Multimodal Language Model Oversensitive to Safe Queries?, Xirui Li*, Hengguang Zhou*, Ruochen Wang, Tianyi Zhou, Minhao Cheng, Cho-Jui Hsieh. In International Conference on Learning Representations (ICLR), 2025. [PDF] [CODE]The Crystal Ball Hypothesis in diffusion models: Anticipating object positions from initial noise, Yuanhao Ban, Ruochen Wang, Tianyi Zhou, Boqing Gong, Cho-Jui Hsieh, Minhao Cheng. To appear in International Conference on Learning Representations (ICLR), 2025. [PDF] [CODE]Input Snapshots Fusion for Scalable Discrete-Time Dynamic Graph Neural Networks, Qingguo Qi, Hongyang Chen, Minhao Cheng, Han Liu. To appear in ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD), 2025. [PDF]Forecasting battery degradation trajectory under domain shift with domain generalization, Ruifeng Tan, Xibin Lu, Minhao Cheng, Jia Li, Jiaqiang Huang, Tong-Yi Zhang. In Energy Storage Materials, 2024. [PDF]Trusted Aggregation (TAG): Model Filtering Backdoor Defense In Federated Learning, Joseph Lavond, Minhao Cheng, Yao Li, In Transactions on Machine Learning Research (TMLR), 2024. (a short version appears in NeurIPS Workshop on Federated Learning: Recent Advances and New Challenges, 2022) [PDF]Uncovering, Explaining, and Mitigating the Superficial Safety of Backdoor Defense, Rui Min*, Zeyu Qin*, Nevin L. Zhang, Li Shen, Minhao Cheng. In Advances in Neural Information Processing Systems (NeurIPS), 2024. (Spotlight) [PDF] [CODE]DrAttack: Prompt Decomposition and Reconstruction Makes Powerful LLMs Jailbreakers, Xirui Li, Ruochen Wang, Minhao Cheng, Tianyi Zhou, Cho-Jui Hsieh. In Conference on Empirical Methods in Natural Language Processing Findings (EMNLP-Findings) , 2024. [PDF] [CODE]GuardEmb: Dynamic Watermark for Safeguarding Large Language Model Embedding Service Against Model Stealing Attack, Liaoyaqi Wang, Minhao Cheng. In Conference on Empirical Methods in Natural Language Processing Findings (EMNLP-Findings) , 2024. [PDF] [CODE]Where Am I From? Identifying Origin of LLM-generated Content, Liying Li, Yihan Bai, Minhao Cheng. In Conference on Empirical Methods in Natural Language Processing (EMNLP), 2024. [PDF] [CODE]Exploring Robustness of GNN against Universal Injection Attack From a Worst-case Perspective, Dandan Ni, Sheng Zhang, Cong Deng, Han Liu, Gang Chen, Minhao Cheng and Hongyang Chen. In 33rd ACM International Conference on Information and Knowledge Management (CIKM), 2024. [PDF]A Watermark-Conditioned Diffusion Model for IP Protection, Rui Min, Sen Li, Hongyang Chen, Minhao Cheng. In European Conference on Computer Vision (ECCV), 2024. [PDF] [CODE]When and How do negative prompts take effect?, Yuanhao Ban, Ruochen Wang, Tianyi Zhou, Minhao Cheng, Boqing Gong, Cho-Jui Hsieh. In European Conference on Computer Vision (ECCV), 2024. [PDF] [CODE]Unsupervised Heterogeneous Graph Rewriting Attack via Node Clustering, Haosen Wang, Can Xu, Chenglong Shi, PengFei Zheng, Shiming Zhang, Minhao Cheng, Hongyang Chen. In ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD), 2024. [PDF]One Prompt is not Enough: Automated Construction of a Mixture-of-Expert Prompts, Ruochen Wang*, Sohyun An*, Minhao Cheng, Tianyi Zhou, Sung Ju Hwang, Cho-jui Hsieh. In International Conference on Machine Learning (ICML), 2024. [PDF] [CODE]Boosting the Adversarial Robustness of Graph Neural Networks: An OOD Perspective, Kuan Li, Yiwen Chen, Yang Liu, Jin Wang, Qing He, Minhao Cheng, Xiang Ao. In International Conference on Learning Representations (ICLR), 2024. [PDF] [CODE]CurvAGN: Curvature-based Adaptive Graph Neural Networks for Predicting Protein-Ligand Binding Affinity, Jianqiu Wu, Hongyang Chen, Minhao Cheng, Haoyi Xiong. In BMC Bioinformatics 24. [PDF]PTP: Boosting Stability and Performance of Prompt Tuning with Perturbation-Based Regularizer, Lichang Chen, Heng Huang, Minhao Cheng. In Conference on Empirical Methods in Natural Language Processing (EMNLP), 2023. [PDF]Stable Backdoor Purification with Feature Shift Tuning, Rui Min*, Zeyu Qin*, Li Shen, Minhao Cheng, In Neural Information Processing Systems (NeurIPS), 2023. [PDF] [Code]Revisiting Personalized Federated Learning: Robustness Against Backdoor Attacks, Zeyu Qin, Liuyi Yao, Daoyuan Chen, Yaliang Li, Boling Ding, Minhao Cheng, In ACM SIGKDD International Conference on Knowledge Discovery",
  "content_length": 16473,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:27"
}