{
  "name": "Minhyuk Sung",
  "homepage": "https://mhsung.github.io",
  "status": "success",
  "content": "Minhyuk Sung Minhyuk Sung Associate Professor School of Computing Graduate School of AI KAIST KAIST Visual AI Group Contact Information E3-5, Rm 507, KAIST 291 Daehak-ro, Yuseong-gu, Daejeon, South Korea 34141 Tel: (+82)-042-350-3587 Courses CS492(C): Diffusion and Flow Models Fall 2025 CS479: Machine Learning for 3D Data Spring 2025 CS492(D): Diffusion Models and Their Applications Fall 2024 More I am an associate professor in the School of Computing at KAIST, leading the KAIST Visual AI Group. I am also affiliated with the Graduate School of AI and the Metaverse Program. Before joining KAIST, I was a research scientist at Adobe Research. I received my Ph.D. from Stanford University, advised by Leonidas Guibas, and received M.S. and B.S. degrees from KAIST. My research focuses on generating, manipulating, and analyzing various visual data, including images, videos, and 3D data. I’m the recipient of the Asiapgraphics Researcher Award in 2024.I am looking for motivated students to join my group. Please reach out to me via email if you are interested in.Information for Prospective Students Announcements Call for Internship for Winter 2025-2026: We are currently seeking undergraduate interns to join our group this winter. Click here for more details. News Nov 2025 Serving as an area chair at ICML 2026. Nov 2025 One paper has been accepted to 3DV 2026. Nov 2025 One paper has been accepted to WACV 2026 (in the secound round). Oct 2025 Serving as a technical paper committee member at SIGGRAPH 2026. Sep 2025 Five papers have been accepted to NeurIPS 2025, including one spotlight. Sep 2025 One paper has been accepted to WACV 2026 (in the first round). Aug 2025 I talked about \"The Present and Future of Content Generation\" at the KAIST AI Transformation Workshop. Click to check out the recording. Aug 2025 I gave talks at NVIDIA, Google, Stanford, and SFU titled \"Inference-Time Guided Generation Using Diffusion and Flow Models\". Click to download the slides. Aug 2025 Serving as an area chair at ICLR 2026. Jul 2025 I gave lectures on diffusion models at MLSS-Senegal 2025. More Publications Proxy-Free Gaussian Splats Deformation with Splat-Based Surface Estimation Jaeyeong Kim, Seungwoo Yoo, Minhyuk Sung 3DV 2026 BoxSplitGen: A Generative Model for 3D Part Bounding Boxes in Varying Granularity Juil Koo*, Wei-Tung Lin*, Chanho Park, Chanhyeok Park, Minhyuk Sung (* equal contributions) WACV 2026 Unconditional Priors Matter! Improving Conditional Generation of Fine-Tuned Diffusion Models Prin Phunyaphibarn, Phillip Y. Lee, Jaihoon Kim, Minhyuk Sung WACV 2026 Project arXiv PDF Ψ-Sampler: Initial Particle Sampling for SMC-Based Inference-Time Reward Alignment in Score Models Taehoon Yoon*, Yunhong Min*, Kyeongmin Yeo*, Minhyuk Sung (* equal contributions) NeurIPS 2025 (Spotlight) Project arXiv PDF Code Inference-Time Scaling for Flow Models via Stochastic Generation and Rollover Budget Forcing Jaihoon Kim*, Taehoon Yoon*, Jisung Hwang*, Minhyuk Sung (* equal contributions) NeurIPS 2025 Project arXiv Code ORIGEN: Zero-Shot 3D Orientation Grounding in Text-to-Image Generation Yunhong Min*, Daehyeon Choi*, Kyeongmin Yeo, Jihyun Lee, Minhyuk Sung (* equal contributions) NeurIPS 2025 Project arXiv Code Moment- and Power-Spectrum-Based Gaussianity Regularization for Text-to-Image Models Jisung Hwang, Jaihoon Kim, Minhyuk Sung NeurIPS 2025 arXiv Neural Green’s Functions Seungwoo Yoo, Kyeongmin Yeo, Jisung Hwang, Minhyuk Sung NeurIPS 2025 Perspective-Aware Reasoning in Vision-Language Models via Mental Imagery Simulation Phillip Y. Lee, Jihyeon Je, Chanho Park, Mikaela Angelina Uy, Leonidas Guibas, Minhyuk Sung ICCV 2025 Project arXiv PDF Code MemBench: Memorized Image Trigger Prompt Dataset for Diffusion Models Chunsan Hong, Tae-Hyun Oh*, Minhyuk Sung* (* co-corresponding authors) TMLR arXiv PDF Code VideoHandles: Editing 3D Object Compositions in Videos Using Video Generative Priors Juil Koo, Paul Guerrero, Chun-Hao Paul Huang, Duygu Ceylan, Minhyuk Sung CVPR 2025 Project arXiv PDF REWIND: Real-Time Egocentric Whole-Body Motion Diffusion with Exemplar-Based Identity Conditioning Jihyun Lee, Weipeng Xu, Alexander Richard, Shih-En Wei, Shunsuke Saito, Shaojie Bai, Te-Li Wang, Minhyuk Sung, Tae-Kyun Kim, Jason Saragih CVPR 2025 Project arXiv StochSync: Stochastic Diffusion Synchronization for Image Generation in Arbitrary Spaces Kyeongmin Yeo*, Jaihoon Kim*, Minhyuk Sung (* equal contributions) ICLR 2025 Project arXiv Code SyncTweedies: A General Generative Framework Based on Synchronized Diffusions Jaihoon Kim*, Juil Koo*, Kyeongmin Yeo*, Minhyuk Sung (* equal contributions) NeurIPS 2024 Project arXiv PDF Code Neural Pose Representation Learning for Generating and Transferring Non-Rigid Object Poses Seungwoo Yoo, Juil Koo, Kyeongmin Yeo, Minhyuk Sung NeurIPS 2024 Project arXiv GrounDiT: Grounding Diffusion Transformers via Noisy Patch Transplantation Phillip Y. Lee*, Taehoon Yoon*, Minhyuk Sung (* equal contributions) NeurIPS 2024 Project arXiv Code MV2Cyl: Reconstructing 3D Extrusion Cylinders from Multi-View Images Eunji Hong, Nguyen Minh Hieu, Mikaela Angelina Uy, Minhyuk Sung NeurIPS 2024 arXiv Occupancy-Based Dual Contouring Jisung Hwang, Minhyuk Sung SIGGRAPH Asia 2024 arXiv Code ReGround: Improving Textual and Spatial Grounding at No Cost Phillip Y. Lee, Minhyuk Sung ECCV 2024 Project arXiv PDF PartSTAD: 2D-to-3D Part Segmentation Task Adaptation Hyunjin Kim, Minhyuk Sung ECCV 2024 arXiv Code Posterior Distillation Sampling Juil Koo, Chanho Park, Minhyuk Sung CVPR 2024 Project arXiv PDF Code Hugging Face As-Plausible-As-Possible: Semantic-Aware Shape Deformation using 2D Diffusion Priors Seungwoo Yoo*, Kunho Kim*, Vladimir Kim, Minhyuk Sung (* co-first authors) CVPR 2024 Project arXiv PDF Code InterHandGen: Two-Hand Interaction Generation via Cascaded Reverse Diffusion Jihyun Lee, Shunsuke Saito, Giljoo Nam, Minhyuk Sung, Tae-Kyun Kim CVPR 2024 Project Split, Merge, and Refine: Fitting Tight Bounding Boxes via Learned Over-Segmentation and Iterative Search Chanhyeok Park, Minhyuk Sung 3DV 2024 arXiv SyncDiffusion: Coherent Montage via Synchronized Joint Diffusions Yuseung Lee, Kunho Kim, Hyunjin Kim, Minhyuk Sung NeurIPS 2023 Project arXiv PDF Code Hugging Face FourierHandFlow: Neural 4D Hand Representation Using Fourier Query Flow Jihyun Lee, Junbong Jang, Donghwan Kim, Minhyuk Sung, Tae-Kyun Kim NeurIPS 2023 Project arXiv OptCtrlPoints: Optimizing Control Points for Biharmonic 3D Shape Deformation Kunho Kim, Mikaela Angelina Uy, Despoina Paschalidou, Alec Jacobson, Leonidas Guibas, Minhyuk Sung Pacific Graphics 2023 (Full Paper) Project arXiv PDF Slides Video SALAD: Part-Level Latent Diffusion for 3D Shape Generation and Manipulation Juil Koo*, Seungwoo Yoo*, Minh Hieu Nguyen*, Minhyuk Sung (* equal contributions) ICCV 2023 Project arXiv PDF Code Hugging Face 3Dpresso (Text-to-3D) Im2Hands: Learning Attentive Implicit Representation of Interacting Two-Hand Shapes Jihyun Lee, Minhyuk Sung, Honggyu Choi, Tae-Kyun Kim CVPR 2023 Project arXiv ShapeTalk: A Language Dataset and Framework for 3D Shape Edits and Deformations Panos Achlioptas, Ian Huang, Minhyuk Sung, Sergey Tulyakov, Leonidas Guibas CVPR 2023 Project PDF Seg&Struct: The Interplay Between Part Segmentation and Structure Inference for 3D Shape Parsing Junghyun Kim, Kaichun Mo, Minhyuk Sung*, Woontack Woo* (* co-corresponding authors) WACV 2023 (Algorithm Track) Project arXiv Poster Video LADIS: Language Disentanglement for 3D Shape Editing Ian Huang, Panos Achlioptas, Tianyi Zhang, Sergei Tulyakov, Minhyuk Sung, Leonidas Guibas Findings of EMNLP 2022 arXiv PDF Code The Shape Part Slot Machine: Contact-based Reasoning for Generating 3D Shapes from Parts Kai Wang, Paul Guerrero, Vladimir Kim, Siddhartha Chaudhuri, Minhyuk Sung, Daniel Ritchie ECCV 2022 arXiv Code PartGlot: Learning Shape Part Segmentation from Language Reference Games Juil Koo, Ian Huang, Panos Achlioptas, Leonidas Guibas, Minhyuk Sung CVPR 2022 (Oral) Project arXiv Video Code Pop-Out Motion: 3D-Aware Image Deformation via Learning the Shape Laplacian Jihyun Lee*, Minhyuk Sung*, Hyunjin Kim, Tae-Kyun Kim (* equal contributions) CVPR 2022 Project arXiv Video Code Point2Cyl: Reverse Engineering 3D Objects from Point Clouds to Extrusion Cylinders Mikaela Angelina Uy*, Yen-yu Chang*, Minhyuk Sung, Purvi Goel, Joseph Lambourne, Tolga Birdal, Leonidas Guibas (* equal contributions) CVPR 2022 Project arXiv Poster Video Code Implicit LiDAR Network: LiDAR Super-Resolution via Interpolation Weight Prediction Youngsun Kwon, Minhyuk Sung*, Sung-Eui Yoon* (* co-corresponding authors) ICRA 2022 Project arXiv PDF Code CPFN: Cascaded Primitive Fitting Networks for High-Resolution Point Clouds Eric-Tuan Lê, Minhyuk Sung, Duygu Ceylan, Radomír Měch, Tamy Boubekeur, Niloy Mitra ICCV 2021 arXiv Code CTRL-C: Camera calibration TRansformer with Line-Classification Jinwoo Lee, Hyunsung Go, Hyunjoon Lee, Sunghyun Cho, Minhyuk Sung, Junho Kim ICCV 2021 arXiv Code DeepMetaHandles: Learning Deformation Meta-Handles of 3D Meshes with Biharmonic Coordinates Minghua Liu, Minhyuk Sung, Radomír Měch, Hao Su CVPR 2021 (Oral) Project arXiv Web Demo Supplementary Code MultiBodySync: Multi-Body Segmentation and Motion Estimation via 3D Scan Synchronization Jiahui Huang, He Wang, Tolga Birdal, Minhyuk Sung, Federica Arrigoni, Shi-Min Hu, Leonidas Guibas CVPR 2021 (Oral) Project arXiv Code Joint Learning of 3D Shape Retrieval and Deformation Mikaela Angelina Uy, Vladimir G. Kim, Minhyuk Sung, Noam Aigerman, Siddhartha Chaudhuri, Leonidas Guibas CVPR 2021 Project arXiv Code DeformSyncNet: Deformation Transfer via Synchronized Shape Deformation Spaces Minhyuk Sung*, Zhenyu Jiang*, Panos Achlioptas, Niloy Mitra, Leonidas Guibas (* equal contributions) SIGGRAPH Asia 2020 Project arXiv PDF Code Deformation-Aware 3D Shape Embedding and Retrieval Mikaela Angelina Uy, Jingwei Huang, Minhyuk Sung, Tolga Birdal, Leonidas Guibas ECCV 2020 Project arXiv",
  "content_length": 12359,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:27"
}