{
  "name": "Minjie Cai",
  "homepage": "https://cai-mj.github.io",
  "status": "success",
  "content": "About - Minjie Cai / Homepage Minjie Cai (蔡敏捷)Associate Professor at Hunan University Follow Changsha, CHINA Github Google Scholar ORCIDHi! I’m Minjie, an associate professor at Hunan University and a cooperative research fellow at The University of Tokyo cooperating with Prof. Yoichi Sato. My research interests include computer vision, multimedia processing, human-machine interactions, and AI-assisted security.I received my Ph.D. in Information Science and Technology at The University of Tokyo, supervised by Prof. Yoichi Sato and co-advised by Dr. Kris Kitani. I received my M.S. in Communication and Information Engineering and B.S. in Electronics and Information Engineering at Northwestern Polytechnical University.News(July 5, 2025) One paper entitled “Amulet: Integrating Sensitive Information Access with Identity Authentication on Mobile Devices” has been accepted to UbiComp 2025.(February 10, 2025) One paper entitled “Enhancing Overlapped Speech Detection and Speaker Counting with Spatially-Infused Spectro-Temporal Conformer” has been accepted to IEEE Transactions on Audio, Speech and Language Processing!(January 23, 2025) One paper entitled “Pre-Training for 3D Hand Pose Estimation with Contrastive Learning on Large-Scale Hand Images in the Wild” has been accepted to ICLR 2025!(December 21, 2024) Our work on egocentric speaker diarization has been accepted to ICASSP 2025!(June 21, 2024) One paper entitled “MaDroid: A Maliciousness-aware Multifeatured Dataset for Detecting Android Malware” has been accepted to Computers & Security.(June 3, 2024) Our work on domain adaptive object detection in driving scenes has been accepted to IEEE Transactions on Intelligent Transportation Systems!(May 17, 2023) Two papers on audio-driven face animation and blind estimation of room impulse response have been accepted to INTERSPEECH 2023!(May 4, 2023) One paper entitled “DongTing: A Large-scale Dataset for Anomaly Detection of the Linux Kernel” has been accepted to The Journal of Systems & Software.",
  "content_length": 2021,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:28"
}