{
  "name": "Minlie Huang",
  "homepage": "https://coai.cs.tsinghua.edu.cn/hml",
  "status": "success",
  "content": "Dr. Minlie Huang's Homepage About Publications Honors & Rewards Services Courses Talks Recruitment About Me My general interests include artificial intelligence, deep learning, and natural language processing. I am particularly interested in the following fields:Natural language generation theories, models & evaluationFundamental problems in large language models and multi-modal foundation models AI alignment, safety and ethicsSocial intelligence with large language models (emotion, theory-of-mind, mental health applications)I am leading a research group named Conversational AI (CoAI, GitHub link). This group published more than 100 papers on ACL, ICLR, ICML, Neurips conferences, and has won many paper awards including COLING 2010 best paper, ACL 2012 best student paper, IJCAI 2018 distinguished paper, SIGDIAL 2020 best paper, NLPCC 2015/2020 best paper, ACL 2023/2024 area chair award, etc. We have also highly cited works including emotional chatting machine (AAAI 2018), ESC (ACL 2021), PPT (ACL 2022), MiniLLM (ICLR 2024), ChatGLM (2024, with Prof. Jie Tang), etc.A full version of group introduction can be seen here.We also welcome talented undergraduates and interns to join us for doing interesting and amazing research. I also supervised and led many undergraduates to do research. Here are my thoughts on how undergraduates can make successful research.ResourcesLearning to Ask Questions in Open-domain Conversational Systems with Typed Decoders (data link, extraction code: yz06)Assigning Personality/Profile to a Chatting Machine for Coherent Conversation Generation (data link, extraction code: 0ls2)Commonsense Knowledge Aware Conversation Generation with Graph Attention (data link)Generating Informative Responses with Controlled Sentence Function (data link, extraction code: hzo0) Emotional Chatting Machine  (data link, including emotion classifier and the emotional STC dataset)ConvLab-3: A Flexible Dialogue System Toolkit Based on a Unified Data Format  (Github link)CritiqueLLM: Towards an Informative Critique Generation Model for Evaluation of Large Language Model Generation  (Github link)ShieldLM: Empowering LLMs as Aligned, Customizable and Explainable Safety Detectors  (Github link)MiniPLM: Knowledge Distillation for Pre-Training Language Models (Github link)CharacterGLM: Customizing Chinese Conversational AI Characters with Large Language Models (Github link) AISafetyLab: A Comprehensive Framework for AI Safety Evaluation and Improvement (Github link) Selected Publications Select category Category All 2025 2024 2023 2022 2021 2020 2019 2018 before Jinfeng Zhou, Yongkang Huang, Bosi Wen, Guanqun Bi, Yuxuan Chen, Pei Ke, Zhuang Chen, Xiyao Xiao, Libiao Peng, Kuntian Tang, Rongsheng Zhang, Le Zhang, Tangjie Lv, Zhipeng Hu, Hongning Wang, Minlie Huang CharacterBench: Benchmarking Character Customization of Large Language Models. AAAI 2025 Zhuang Chen*, Yaru Cao*, Guanqun Bi, Jincenzi Wu, Jinfeng Zhou, Xiyao Xiao, Si Chen, Hongning Wang, Minlie Huang SocialSim: Towards Socialized Simulation of Emotional Support Conversation. AAAI 2025 Jiale Cheng, Xiao Liu, Cunxiang Wang, Xiaotao Gu, Yida Lu, Dan Zhang, Yuxiao Dong, Jie Tang, Hongning Wang, Minlie Huang SPaR: Self-Play with Tree-Search Refinement to Improve Instruction-Following in Large Language Models. ICLR 2025 Jiaxin Wen, Ruiqi Zhong, Akbir Khan, Ethan Perez, Jacob Steinhardt, Minlie Huang, Samuel R. Bowman, He He, Shi Feng Language Models Learn to Mislead Humans via RLHF. ICLR 2025 Jiaxin Wen*, Jian Guan*, Hongning Wang, Wei Wu, Minlie Huang Unlocking Reasoning Potential in Large Language Models by Scaling Code-form Planning. ICLR 2025 Yuxian Gu, Li Dong, Hongning Wang, Yaru Hao, Qingxiu Dong, Furu Wei, Minlie Huang Data Selection via Optional Training for Language Models. ICLR 2025 Yuxian Gu, Hao Zhou, Fandong Meng, Minlie Huang MiniPLM: Knowledge Distillation for Pre-Training Language Models. ICLR 2025 Erle Zhu, Yadi Liu, Zhe Zhang, Xujun Li, JinZhou, Xinjie Yu, Minlie Huang, Hongning Wang MAPS: Advancing Multi-Modal Reasoning in Expert-Level Physical Science. ICLR 2025 Zhihua Wen, Zhizhao Liu, Zhiliang Tian, Shilong Pan, Zhen Huang, Dongsheng Li, Minlie Huang（ with Assoc. Prof. Zhiliang Tian） Scenario-independent Uncertainty Estimation for LLM-based Question Answering via Factor Analysis. WWW 2025 Minlie Huang, Yingkang Wang, Shiyao Cui, Pei Ke, Jie Tang The Superalignment of Superhuman Intelligence with Large Language Models. SCIENCE CHINA Information Sciences Chujie Zheng, Ziqi Wang, Heng Ji, Minlie Huang, Nanyun Peng Model Extrapolation Expedites Alignment. ACL 2025 Junxiao Yang, Zhexin Zhang, Shiyao Cui, Hongning Wang, Minlie Huang Guiding not Forcing: Enhancing the Transferability of Jailbreaking Attacks on LLMs via Removing Superfluous Constraints. ACL 2025 Yida Lu, Jiale Cheng, Zhexin Zhang, Shiyao Cui, Cunxiang Wang, Xiaotao Gu, Yuxiao Dong, Jie Tang, Hongning Wang, Minlie Huang LongSafety: Evaluating Long-Context Safety of Large Language Models. ACL 2025 Jinfeng Zhou, Yuxuan Chen, Yihan Shi, Xuanming Zhang, Leqi Lei, Yi Feng, Zexuan Xiong, Miao Yan, Xunzhi Wang, Yaru Cao, Jianing Yin, Shuai Wang, Quanyu Dai, Zhenhua Dong, Hongning Wang, Minlie Huang SocialEval: Evaluating Social Intelligence of Large Language Models. ACL 2025 Bosi Wen, Pei Ke, Yufei Sun, Cunxiang Wang, Xiaotao Gu, Jinfeng Zhou, Jie Tang, Hongning Wang, Minlie Huang HPSS: Heuristic Prompting Strategy Search for LLM Evaluator. Findings of ACL 2025 Tianshu Yu, Chao Xiang, mingchuan yang, Pei Ke, Bosi Wen, Cunxiang Wang, Jiale Cheng, Li Zhang, Xinyu Mu, Chuxiong Sun, Minlie Huang Training Language Model to Critique for Better Refinement. Findings of ACL 2025 Guanqun Bi, Zhuang Chen, Zhoufu Liu, Hongkai Wang, Xiyao Xiao, Yuqiang Xie, Wen Zhang, Yongkang Huang, Yuxuan Chen, Libiao Peng, Minlie Huang MAGI: Multi-Agent Guided Interview for Psychiatric Assessment. Findings of ACL 2025 Jiale Cheng, Ruiliang Lyu, Xiaotao Gu, Xiao Liu, Jiazheng Xu, Yida Lu, Jiayan Teng, Zhuoyi Yang, Yuxiao Dong, Jie Tang, Hongning Wang, Minlie Huang VPO: Aligning Text-to-Video Generation Models with Prompt Optimization. ICCV 2025 Renmiao Chen, Shiyao Cui, Xuancheng Huang, Chengwei Pan, Xijie Huang, Qinglin Zhang, Xuan Ouyang, Zhexin Zhang, Hongning Wang, Minlie Huang JPS: Jailbreak Multimodal Large Language Models with Collaborative Visual Perturbation and Textual Steering. ACM Multimedia 2025 Shiyao Cui*, Qinglin Zhang*, Xuan Ouyang, Renmiao Chen, Zhexin Zhang, Yida Lu, Hongning Wang, Han Qiu, Minlie Huang ShieldVLM: Safeguarding the Multimodal lmplicit Toxicity via Deliberative Reasoning with LVLMs. ACM Multimedia 2025 Jinfeng Zhou, Yuxuan Chen, Jianing Yin, Yongkang Huang, Yihan Shi, Xikun Zhang, Libiao Peng, Rongsheng Zhang, Tangjie Lv, Zhipeng Hu, Hongning Wang, Minlie Huang Crisp: Cognitive Restructuring of Negative Thoughts through Multi-turn Supportive Dialogues. EMNLP 2025 Chujie Zheng, Hao Zhou, Fandong Meng, Jie Zhou, Minlie Huang Large Language Models Are Not Robust Multiple Choice Selectors. ICLR 2024（Spotlight） Yuxian Gu, Li Dong, Furu Wei, Minlie Huang MiniLLM: Knowledge Distillation of Large Language Models. ICLR 2024 Haozhe Ji, Pei Ke, Hongning Wang, Minlie Huang Language Model Decoding as Direct Metrics Optimization. ICLR 2024 Zhibin Gou*, Zhihong Shao*, Yeyun Gong, yelong shen, Yujiu Yang, Minlie Huang, Nan Duan, Weizhu Chen ToRA: A Tool-Integrated Reasoning Agent for Mathematical Problem Solving. ICLR 2024 Jian Guan, Jesse Dodge, David Wadden, Minlie Huang, Hao Peng Language Models Hallucinate, but May Excel at Fact Verification. NAACL 2024 Zhuang Chen, Jiawen Deng, Jinfeng Zhou, Jincenzi Wu, Tieyun Qian, Minlie Huang Depression Detection in Clinical Interviews with LLM-Empowered Structural Element Graph. NAACL 2024 Haozhe Ji, Cheng Lu, Yilin Niu, Pei Ke, Hongning Wang, Jun Zhu, Jie Tang, Minlie Huang Towards Efficient Exact Optimization of Language Model Alignment. ICML 2024 Chujie Zheng, Fan Yin, Hao Zhou, Fandong Meng, Jie Zhou, Kai-Wei Chang, Minlie Huang, Nanyun Peng On Prompt-Driven Safeguarding for Large Language Models. ICML 2024 Jiale Cheng, Xiao Liu, Kehan Zheng, Pei Ke, Hongning Wang, Yuxiao Dong, Jie Tang, Minlie Huang Black-Box Prompt Optimization: Aligning Large Language Models without Model Training. ACL 2024 Pei Ke, Bosi Wen, Zhuoer Feng, Xiao Liu, Xuanyu Lei, Jiale Cheng, Shengyuan Wang, Aohan Zeng, Yuxiao Dong, Hongning Wang, Jie Tang, Minlie Huang CritiqueLLM: Towards an Informative Critique Generation Model for Evaluation of Large Language Model Generation. ACL 2024 Jiaxin Wen, Ruiqi Zhong, Pei Ke, Zhihong Shao, Hongning Wang, Minlie Huang Learning Task Decomposition to Assist Humans in Competitive Programming. ACL 2024 Zhexin Zhang, Leqi Lei, Lindong Wu, Rui Sun, Yongkang Huang, Chong Long, Xiao Liu, Xuanyu Lei, Jie Tang, Minlie Huang SafetyBench: Evaluating the Safety of Large Language Models. ACL 2024 Zhexin Zhang, Junxiao Yang, Pei Ke, Fei Mi, Hongning Wang, Minlie Huang Defending Large Language Models Against Jailbreaking Attacks Through Goal Prioritization. ACL 2024 Sahand Sabour, Siyang Liu, Zheyuan Zhang, June M. Liu, Jinfeng Zhou, Alvionna S. Sunaryo, Juanzi Li, Tatia M.C. Lee, Rada Mihalcea, Minlie Huang EmoBench: Evaluating the Emotional Intelligence of Large Language Models. ACL 2024 Zhuang Chen, Jincenzi Wu, Jinfeng Zhou, Bosi Wen, Guanqun Bi, Gongyao Jiang, Yaru Cao, Mengting Hu, Yonghui Li, Zexuan Xiong, Minlie Huang ToMBench: Benchmarking Theory of Mind in Large Language Models. ACL 2024 Jincenzi Wu, Zhuang Chen, Jiawen Deng, Sahand Sabour, Helen Meng, Minlie Huang COKE: A Cognitive Knowledge Graph for Machine Theory of Mind. ACL 2024 Liu, Xiao;Lei, Xuanyu;Wang, Shengyuan;Huang, Yue;Feng, Zhuoer;Wen, Bosi;Cheng, Jiale;Ke, Pei;Xu, Yifan;Tam, Weng Lam;Zhang, Xiaohan;Sun, Lichao;Gu, Xiaotao;Wang, Hongning;Zhang, Jing;Huang, Minlie;Dong, Yuxiao;Tang, Jie AlignBench: Benchmarking Chinese Alignment of Large Language Models (with Prof. Jie Tang). ACL 2024 ",
  "content_length": 77901,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:27"
}