{
  "name": "Minqi Jiang",
  "homepage": "http://simecv.sufe.edu.cn/page.aspx?id=106",
  "status": "success",
  "content": "江敏祺 教师介绍 江敏祺 姓名：江敏祺 最后学位：博士 职称：助理教授 办公室：306 Email：jiangminqi@mail.shufe.edu.cn Google Scholar：https://scholar.google.com/citations?user=OBdS69UAAAAJ&hl=en Github Profile：https://github.com/Minqi824 个人简介 上海财经大学信息管理与工程学院助理教授。主要研究方向为1. 异常检测。包括弱监督异常检测、异常检测算法大规模评测与自动化组合等；2. 量化投资，包括时序预测以及LLM研究。近年来在计算机国际顶会NeurIPS、KDD、IJCAI、CIKM等发表论文数篇。 教授课程 高级机器学习理论与算法(0095) 教育背景 2020-2024， 上海财经大学，管理科学与工程，博士 科研论文 Minqi Jiang*, Chaochuan Hou*, Ao Zheng*, Songqiao Han, Hailiang Huang, Qingsong Wen, Xiyang Hu, Yue Zhao ADGym: Design Choices for Deep Anomaly Detection Advances in Neural Information Processing Systems (NeurIPS 2023, 人工智能A First Tier) *equal contribution. 关键词: 弱监督学习, 元学习, 自动化模型选择. Source Code Minqi Jiang, Songqiao Han, Hailiang Huang Anomaly Detection with Score Distribution Discrimination ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2023, 数据库与 信息检索A First Tier) *equal contribution. 关键词: 弱监督学习, 分布优化, 通用异常检测算法. Source Code Songqiao Han*, Xiyang Hu*, Hailiang Huang*, Minqi Jiang*, Yue Zhao* ADBench: Anomaly Detection Benchmark Advances in Neural Information Processing Systems (NeurIPS 2022, 人工智能A First Tier) *equal contribution. 关键词: 异常检测, 大规模算法评估. Source Code Biyang Guo*, Xin Zhang*, Ziyuan Wang*, Minqi Jiang*, Jinran Nie*, Yuxuan Ding, Jianwei Yue, Yupeng Wu How Close is ChatGPT to Human Experts? Comparison Corpus, Evaluation, and Detection International Joint Conference on Artificial Intelligence (IJCAI@LLM, 人工智能A Second Tier) *equal contribution. 关键词: 大语言模型, ChatGPT. Source Code Chaoli Zhang*, QingsongWen*, Yingying Zhang*, Lanshu Peng, Yiyuan Yang, Chongjiong Fan, Minqi Jiang, Lunting Fan, Liang Sun Benchmarking Multivariate Time Series Anomaly Detection with Large-Scale Real-World Datasets The Conference on Information and Knowledge Management (CIKM, 人工智能A Second Tier) *equal contribution. 关键词: 时间序列预测, 大规模算法评估; 个人荣誉 上海财经大学第八届研究生\"学术之星\" 博士研究生国家奖学金 硕士研究生国家奖学金 \"华为杯\"第十五届中国研究生数学建模竞赛全国一等奖 省优秀毕业生 862ZrMjFUFyq",
  "content_length": 1946,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:28"
}