{
  "name": "Minsoo Rhu",
  "homepage": "https://sites.google.com/view/kaist-via",
  "status": "success",
  "content": "VIA Research Group @ KAISTSearch this siteEmbedded FilesSkip to main contentSkip to navigationVertically Integrated Architecture Research Welcome to VIA!Vertically Integrated Architecture (VIA) research group is affiliated with the School of Electrical Engineering, Department of Semiconductor System Engineering, Graduate School of Artificial Intelligence (AI), and Graduate School of AI Semiconductor at KAIST, South Korea. We conduct research in the domain of computer architecture with a vertically integrated approach. By co-optimizing VLSI technology, computer system architecture, and application & algorithms, our mission is to build a high-performance computing platform for future \"intelligent\" systems that are programmable, robust, reliable, secure, and energy-efficient.(Note) For students interested in undergraduate research internships or those who are applying to our research group for graduate studies, please send me an email with your latest CV and transcript.(Latest News) [November 8] Our group has three papers accepted for presentation at the 32nd International Symposium on High-Performance Computer Architecture (HPCA-32), Sydney, Australia. Congratulations Jiin, Byeongjun, Jinha, Eunyeong, Jehyeon, and Dongjae![September 3] Prof. Rhu received the Best Teaching Award (EE312: Introduction to Computer Architecture) from the School of EE.[August 25] We have three graduate students joining our group this fall. Welcome aboard Yokyung, Byeongkyu  and Jiwoong![August 21] Ranggi successfully defended his Ph.D. thesis! \"Dr.\" Hwang will be joining Ulsan National Institute of Science and Technology (울산과학기술원) as an Assistant Professor. Congratulations and wish you all the best in your next journey in academia![August 21] Yunjae successfully defended his Ph.D. thesis! \"Dr.\" Lee will be joining Samsung Electronics (Device Solutions) as a Staff Engineer. Congratulations and wish you all the best in your next journey![August 1] Our paper titled \"Hera: A Heterogeneity-Aware Multi-Tenant Inference Server for Personalized Recommendations\" has been accepted for presentation at the 34th International Conference on Parallel Architectures and Compilation Techniques (PACT-34), Irvine, CA. Congratulations Dr. Choi![July 1] Our paper titled \"Mamba-X: An End-to-End Vision Mamba Accelerator for Edge Computing Devices\" has been accepted for presentation at the 44th IEEE/ACM International Conference on Computer-Aided Design (ICCAD-44), Munich, Germany. Congratulations Dongho, Gungyu, Jaewon, Yunjae, and Dongjae![June 05] Juntaek has won the prestigious Korea Presidential Scholarship in Science and Technology (대통령 과학 장학금) this year. Congratulations Juntaek![March 22] Our paper titled \"Debunking the CUDA Myth Towards GPU-based AI Systems\" has been accepted for presentation at the 52nd IEEE International Symposium on Computer Architecture (ISCA-52), Tokyo, Japan. Congratulations Yunjae, Juntaek, Jehyeon, Eunyeong, Jinseop, and Ranggi![February 25] Our group has a paper accepted for publication at IEEE Computer Architecture Letters. Congratulations Taehun,  Yunjae, and Juntaek![February 24] We have two graduate students joining our group this spring. Welcome aboard Taekwon and Junga![February 19] Our paper on uPIMulator (published last year at HPCA-30) has been selected as one of the 2024 Top 10 Research Achievements at KAIST (KAIST 대표연구성과 10선). Congratulations![February 9] Prof. Rhu is serving as the Program Co-Chair for the 58th IEEE/ACM International Symposium on Microarchitecture (MICRO-58). This marks the first time in MICRO's 58-year history that a faculty member from a university in Asia has been selected as Program Chair.[February 8] Our paper on uPIMulator (published last year at HPCA-30) has been selected as one of the top 24 papers listed as IEEE Micro Top Picks - Honorable Mention! The featured article will be published on the July/August 2025 issue of \"IEEE Micro - Special Issue on Top Picks from the 2024 Computer Architecture Conferences\". Congratulations![November 18] Our group has a paper accepted for publication at IEEE Computer Architecture Letters. Congratulations Jiwon and Yunjae![October 11] Our group's proposal (Primary Investigator: Prof. Rhu, Minsoo) on developing a \"high-performance AI model serving system\" has been awarded the prestigious Samsung Research Funding & Incubation Center (삼성미래기술육성사업) research grant.[September 27] Bongjoon successfully defended his Ph.D. thesis! \"Dr.\" Hyun will be joining Samsung Electronics (Device Solutions) as a Staff Engineer. Congratulations and wish you all the best in your next journey![September 13] Our group has a paper accepted for publication at IEEE Computer Architecture Letters. Congratulations Eunyeong and Jehyeon![September 2] We have one graduate student joining our group this fall. Welcome aboard Byeongjun and Jinseop![July 31] Our group's proposal (Primary Investigator: Prof. Rhu, Minsoo) on developing a \"Secure and Private AI System and System Software\" has been awarded the prestigious SW Starlab (SW스타랩) research grant (funding period: 8 years). [July 18] Our group has three papers accepted for presentation at the 57th IEEE/ACM International Symposium on Microarchitecture (MICRO-57), Austin, TX. Congratulations Jehyeon, Dongjae, Bongjoon, and Taehun![July 3] Prof. Rhu is inducted into the ISCA Hall of Fame.[July 2] Prof. Rhu promoted to Tenured Associate Professor. [June 22] Our group has a paper accepted for publication at IEEE Computer Architecture Letters. Congratulations Dongho and Taehun![June 10] Prof. Rhu is appointed as an Associate Editor for IEEE Transactions on Computers.[April 11] Yujeong successfully defended her Ph.D. thesis! \"Dr.\" Choi will be joining Google, Sunnyvale, CA as a Postdoctoral Researcher. Congratulations and wish you all the best in your next journey in the Bay Area![March 30] Our group has a paper accepted for publication at IEEE Computer Architecture Letters. Congratulations Dongjae, Bongjoon and Taehun![March 20] Our group members will be presenting three papers which are accepted at the 51st IEEE International Symposium on Computer Architecture (ISCA-51), Buenos Aires, Argentina. Congratulations Yujeong, Jiin, Yunjae, Hyeseong, and Ranggi![March 5] Our work on uPIMulator (\"Pathfinding Future PIM Architectures by Demystifying a Commercial PIM Technology\") won the Best Paper Award at HPCA-30! This is the first time a research group from Korea won a best paper award at a top-tier computer architecture conference. Congratulations Bongjoon, Taehun, and Dongjae![February 16] Youngeun successfully graduated with a Ph.D.! \"Dr.\" Kwon will be joining NVIDIA, Santa Clara, CA as a Senior Deep Learning Performance Engineer. Congratulations and wish you all the best in your next journey in the Bay Area![February 15] Ranggi received an internship offer to join NVIDIA Research this summer.  He will be working as a research intern in the Architecture Research Group (ARG) at Austin, TX. Congratulations and have a great summer in the \"greatest\" city in the US :-)[February 15] We have two graduate students joining our group this spring. Welcome aboard Gungyu and Jaewon!Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 7213,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:28"
}