{
  "name": "Minsu Cho",
  "homepage": "http://cvlab.postech.ac.kr/~mcho",
  "status": "success",
  "content": "Minsu Cho Minsu Cho (ì¡° ë¯¼ì) Mu-Eun-Jae (ç¡å é½) Endowed Chair Professor, Associate Professor Department of Computer Science and Engineering Graduate School of Artificial Intelligence POSTECH (Pohang Univ. of Science and Technology, í¬í­ê³µê³¼ëíêµ) 77 Cheongam-ro, Nam-gu, Pohang, Gyeongbuk, South Korea 37673 Email: mscho ~at~ postech dot ac dot kr I am a Mu-Eun-Jae (ç¡å é½) Endowed Chair Professor and an Associate Professor in the Department of Computer Science and Engineering and Graduate School of Artificial Intelligence at POSTECH, South Korea, leading POSTECH Computer Vision Lab. My research lies in the areas of computer vision and machine learning, especially in the problems of visual semantic correspondence, symmetry analysis, object discovery, action recognition, and minimally-supervised learning. I am interested in the relationship between correspondence, symmetry, and supervision in visual learning. Before joining POSTECH in the fall of 2016, I was a researcher (Starting Research Position) in the Inria WILLOW team at É cole Normale Supérieure (ENS), Paris, France, where I have worked with Jean Ponce and Cordelia Schmid. I completed my Ph.D. in 2012, under the supervision of Kyoung Mu Lee at Seoul National University, Seoul, Korea. I was a visiting faculty researcher at Google Research in 2023. I am an Associate Editor of the International Journal of Computer Vision (IJCV) and the IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) and have been serving as an Area Chair in leading conferences, including CVPR, ECCV, ICCV, and NeurIPS. I was inducted into the Young Korean Academy of Science and Technology (Y-KAST) in 2020 and appointed the Mu-Eun-Jae Endowed Chair Professor at POSTECH in 2024. POSTECH CV Lab Publications Software Students Teaching CV Google scholar NEWS Four papers (including two highlights) were accepted at ICCV 2025. Four papers were accepted at CVPR 2025. One paper on memory-modular learning was accepted at Transactions on Machine Learning Research (TMLR). I serve as an Area Chair for CVPR 2025 (Senior AC), ICCV 2025 (Lead AC), and NeurIPS 2025. I am appointed as the Mu-Eun-Jae (ç¡å é½) Endowed Chair Professor by POSTECH. Two papers were accepted at NeurIPS 2024. I won the KCCV Sang Uk Lee Prize at KCCV 2024. Five papers were accepted at ECCV 2024. Our paper on 3D shape assembly was accepted at ICML 2024. Five papers were accepted at CVPR 2024. One paper on sorting networks was accepted at ICLR 2024. I will be giving a keynote lecture at the 30th International Workshop on Frontiers of Computer Vision (IW-FCV 2024), Tokyo, Japan. I co-organize the Tool-Augmented VIsion (TAVI) workshop at CVPR 2024. I serve as a Program Chair for KCCV 2024, Busan, Korea, and ACCV 2024, Hanoi, Vietnam. Our paper, `Efficient Semantic Matching with Hypercolumn Correlation,' was included in the Best Paper Finalists at WACV 2024. Three papers were accepted at WACV 2024. I am an Associate Editor of IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) and International Journal of Computer Vision (IJCV). I served as an Organizing Committee member for ACCV 2024 (Program Chair), KCCV 2024 (Program Chair), ICCV 2023 (Workshop Chair), MVA 2021 (Program Chair), ICCV 2019 (Web Chair), and ACM Multimedia 2018 (Web Chair). I served as an Area Chair / Senior Program Committee member for CVPR 2024, ECCV 2024, NeurIPS 2024, CVPR 2023, ICCV 2023, MVA 2023, NeurIPS 2023, WACV 2023, AAAI 2022, CVPR 2022, ICPR 2022, NeurIPS 2022, AAAI 2021, BMVC 2021 CVPR 2021, ICCV 2021, IJCAI 2021, CVPR 2020, ICPR 2020, IJCAI-PRICAI 2020, ICCV 2019, ACCV 2018, CVPR 2018, and WACV 2018. RECENT PUBLICATIONS (Click here for a full list) Wongyun Yu, Ahyun Seo, Minsu Cho Axis-level Symmetry Detection with Group-equivariant Representation IEEE/CVF International Conference on Computer Vision (ICCV), Honolulu, Hawaii, 2025 Nahyuk Lee*, Juhong Min*, Junhong Lee, Chunghyun Park, Minsu Cho Combinative Matching for Geometric Shape Assembly IEEE/CVF International Conference on Computer Vision (ICCV), Honolulu, Hawaii, 2025 (highlight presentation) Eunchan Jo, Dahyun Kang, Sanghyun Kim, Yunseon Choi, Minsu Cho Few-Shot Pattern Detection via Template Matching and Regression IEEE/CVF International Conference on Computer Vision (ICCV), Honolulu, Hawaii, 2025 (highlight presentation) Jaejun Hwang*, Dayoung Gong*, Manjin Kim, Minsu Cho Generic Event Boundary Detection via Denoising Diffusion IEEE/CVF International Conference on Computer Vision (ICCV), Honolulu, Hawaii, 2025 Sanghyun Kim, Deunsol Jung, Minsu Cho Locality-Aware Interaction for Zero-Shot Human-Object Interaction Detection IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, 2025 Ahyun Seo, Minsu Cho Leveraging 3D Geometric Priors in 2D Rotation Symmetry Detection IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, 2025 Junha Lee*, Chunghyun Park*, Jaesung Choe, Yu-Chiang Frank Wang, Jan Kautz, Minsu Cho, Chris Choy Mosaic3D: Foundation Dataset and Model for Open-Vocabulary 3D Segmentation IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, 2025 Sanghyun Kim, Deunsol Jung, Minsu Cho Locality-Aware Interaction for Zero-Shot Human-Object Interaction Detection IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Nashville, 2025 Min Jung Lee, Dayoung Gong, Minsu Cho Video Summarization with Large Language Models Conference on Neural Information Processing Systems (NeurIPS), 2024, Vancouver, Canada. Dahyun Kang, Ahmet Iscen, Eunchan Jo, Sua Choi, Minsu Cho, Cordelia Schmid Memory-Modular Classification: Learning to Generalize with Memory Replacement Transactions on Machine Learning Research (TMLR), 2025 Jongmin Lee, Minsu Cho 3D Equivariant Pose Regression via Direct Wigner-D Harmonics Prediction Conference on Neural Information Processing Systems (NeurIPS), 2024, Vancouver, Canada. Dahyun Kang, Minsu Cho In Defense of Lazy Visual Grounding for Open-Vocabulary Semantic Segmentation European Conference on Computer Vision (ECCV), 2024, Milano, Italy. Yoonwoo Jeong, Jinwoo Lee, Chiheon Kim, Minsu Cho, Doyup Lee NVS-Adapter: Plug-and-Play Novel View Synthesis from a Single Image European Conference on Computer Vision (ECCV), 2024, Milano, Italy. Youngkil Song*, Dongkeun Kim*, Minsu Cho Suha Kwak Online Temporal Action Localization with Memory-Augmented Transformer European Conference on Computer Vision (ECCV), 2024, Milano, Italy. Jinsung Lee, Taeoh Kim, Inwoong Lee, Minho Shim, Dongyoon Wee, Minsu Cho, Suha Kwak Classification Matters: Improving Video Action Detection with Class-Specific Attention European Conference on Computer Vision (ECCV), 2024, Milano, Italy. (oral presentation) Dongkeun Kim, Youngkil Song, Minsu Cho, Suha Kwak Towards More Practical Group Activity Detection: A New Benchmark and Model European Conference on Computer Vision (ECCV), 2024, Milano, Italy. Nahyuk Lee*, Juhong Min*, Junha Lee, Seungwook Kim, Kanghee Lee, Jaesik Park, Minsu Cho 3D Geometric Shape Assembly via Efficient Point Cloud Matching International Conference on Machine Learning (ICML), 2024, Vienna, Austria. Sanghyun Kim*, Min Jung Lee*, Woohyeok Kim, Deunsol Jung, Jaesung Rim, Sunghyun Cho, Minsu Cho Burst Image Super-Resolution with Base Frame Selection CVPR Workshop on New Trends in Image Restroation and Enhancement (NTIRE), 2024, Seattle, USA. Seungwook Kim, Kejie Li, Xueqing Deng, Yichun Shi, Minsu Cho, Peng Wang Enhancing 3D Fidelity of Text-to-3D using Cross-View Correspondences IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, Seattle, USA. Chunghyun Park*, Seungwook Kim*, Jaesik Park, Minsu Cho Learning SO(3)-Invariant Semantic Correspondence via Local Shape Transfor IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, Seattle, USA. Seungwook Kim, Kejie Li, Xueqing Deng, Yichun Shi, Minsu Cho, Peng Wang Enhancing 3D Fidelity of Text-to-3D using Cross-View Correspondences IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, Seattle, USA. Sua Choi, Dahyun Kang, Minsu Cho Contrastive Mean-Shift Learning for Generalized Category Discovery IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, Seattle, USA. Manjin Kim, Paul Hongsuck Seo, Cordelia Schmid, Minsu Cho Learning Correlation Structures for Vision Transformers IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, Seattle, USA. Juhong Min, Shyamal Buch, Arsha Nagrani, Minsu Cho, Cordelia Schmid MoReVQA: Exploring Modular Reasoning Models for Video Questiong Answering IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, Seattle, USA. Jungtaek Kim, Jeongbeen Yoon, Minsu Cho Generalized Neural Sorting Networks with Error-Free Differentiable Swap Functions International Conference on Learning Representations (ICLR), 2024, Vienna, Austria. Seungwook Kim, Juhong Min, Minsu Cho Efficient Semantic Matching with Hypercolumn Correlation IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2024, Waikoloa, Hawaii. (oral presentation, best paper finalist) Jeongbeen Yoon, Sanghyun Kim, Suha Kwak, Minsu Cho Optical Flow Domain Adaptation via Target Style Transfer IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2024, Waikoloa, Hawaii. Donghyeon Kwon, Minsu Cho, Suha Kwak Self-supervised Learning of Semantic Correspondence Using Web Videos IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2024, Waikoloa, Hawaii. MEMBERS Postdoc: Deunsol Jung, 2024- Ahyun Seo, 2025- PhD: Manjin Kim, 2019- Sanghyun Kim, 2019- Dahyun Kang, 2019- Seungwook Kim, 2020- Jinhwi Lee (POSCO), 2019- Yoonwoo Jeong, 2020- Dayoung Gong, 2020- Sangki Kim, 2022- Junha Lee, 2023- Chunghyun Park, 2023- Sua Choi, 2022- Masters: Eunchan Jo, 2023- Chanyoung Kwak, 2024- Eunha Park, 2024- Junmyeong Lee, 2024- Won-gyun Yu, 2024- Junhong Lee, 2025- Hoseung Choi, 2025- Alumni:",
  "content_length": 12689,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:29"
}