{
  "name": "Minsung Kim",
  "homepage": "https://sites.google.com/view/minsungk",
  "status": "success",
  "content": "Minsung KimSearch this siteEmbedded FilesSkip to main contentSkip to navigationMinsung KimI am an Assistant Professor in the Department of Computer Science and WINLAB at Rutgers University. I am also an Associate Graduate Faculty member in the Department of Electrical and Computer Engineering. Before joining Rutgers, I was a Postdoctoral Associate at Yale University. I received my Ph.D. in Computer Science from Princeton University, supported by the Siebel Scholars Fellowship and the Qualcomm Innovation Fellowship.At Rutgers CS, I lead EXceL: NextG Wireless and Emerging Computing Systems LaboratoryWe study quantum and emerging computing systems for next-generation wireless networks. The research aims to leverage quantum and quantum-inspired computation to expedite NextG baseband processing at base station systems, which would unlock unprecedented levels of wireless performance in communication networks. I am looking for self-motivated students/postdocs. If you are interested in working with me (for topics on Quantum x Wireless x AI x Systems), feel free to contact me (minsungk.cs@rutgers.edu) with your CV.Email: minsungk.cs@rutgers.edu | Office: CoRE 313 | 96 Frelinghuysen Road, Piscataway, NJ   [Rutgers CoRE][CS Department][WINLAB: Wireless Information Network Laboratory]News[Nov. 2025] delivered a talk on X-ResQ at ACM MobiCom 2025 in Hong Kong[Oct. 2025] serving on TPC for ACM MobiSys 2026 & ACM MobiCom 2026[Jul. 2025] delivering talks in Korea: POSTECH (6/23), KAIST (6/26), Yonsei Univ. (7/2), SNU (7/8), and Korea Univ. (7/23)[Apr. 2025] won the Prof. Chin Ok Lee & Ms. Kwanghee Kim Award (Early Career Award)[Mar. 2025] two papers (X-ResQ & OhmScanner) accepted to ACM MobiCom 2025[Dec. 2024] one paper accepted to ACM HotMobile 2025 [Nov. 2024] serving on TPC for ACM MobiSys 2025[Sep. 2024] started at Rutgers University as Assistant Professor of Computer Science [Aug. 2024] one paper accepted to IEEE Transactions on Wireless Communications[Apr. 2024] selected as Rising Stars - ACM MobiSys 2024[Mar. 2024] nominated for the 2023 ACM SIGMOBILE Doctoral Dissertation Award  [Nov. 2023] started at Yale as Postdoctoral Associate[Nov. 2023] won the 2023 KOCSEA Moon-Jung Chung Scholarship [Oct. 2023] nominated for the 2023 ACM Doctoral Dissertation Award [Sep. 2023] won the Siebel Scholars Award (Class of 2024 CS Siebel Scholar)educationPrinceton University, NJ M.A. & Ph.D. in Computer Science2017 - 2023Korea University, Seoul B.E. in Electrical Engineering with Great Honor2016Stanford University, CAVisiting Student, Electrical Engineering2016Professional experienceRutgers University, Assistant Professor (Sep. 2024 - Present), Department of Computer Science & WINLAB, New Brunswick, NJYale University, Postdoctoral Associate (Nov. 2023 - Aug. 2024), Efficient Computing Laboratory, New Haven, CTPrinceton University, PhD Student Researcher (Aug. 2017 - Oct. 2023), PAWS Laboratory, Princeton, NJMeta, PhD Software Engineer Intern (Summer. 2022), Systems and Infrastructure, Menlo Park, CAInterDigital Communications, PhD Research Intern (Summer. 2021), R&I Department, Conshohocken, PANational Aeronautics and Space Administration (NASA) – Ames Research Center (ARC), Moffett Field, CAAffiliated Researcher (2018 - 2021), NASA Quantum Artificial Intelligence Laboratory (QuAIL)PhD Research Intern (Summer. 2020), NASA Quantum Artificial Intelligence Laboratory (QuAIL)PhD Research Intern (Summer. 2019), NASA Quantum Artificial Intelligence Laboratory (QuAIL)Visiting Scholar (Summer. 2018), Universities Space Research Association (USRA)publications(+: co-primary author)Liyao Li, Yun Wu, Minsung Kim, Bozho Shang, Jie Xiong, Wenyao Xu, Xiaojiang Chen, Yaxiong Xie, “From Signal-based to Impedance-based Sensing: A Paradigm Shift for Plug-and-Play, Mobile, and Sensitive Battery-free Sensing\"In ACM MobiCom 2025, 16 pages, acceptance rate: 12.9% (76/588).Minsung Kim, Abhishek Kumar Singh, Davide Venturelli, John Kaewell, and Kyle Jamieson, “X-ResQ: Parallel Reverse Annealing for Quantum Maximum-Likelihood MIMO Detection with Flexible Parallelism\" In ACM MobiCom 2025, 16 pages, acceptance rate: 12.9% (76/588).Parthiban Annamalai, Minsung Kim, Anurag Khandelwal, and Lin Zhong, “Exploring Intelligent Dynamic Resource Provisioning for Elastic Massive MIMO vRAN\" In ACM HotMobile 2025, 6 pages, acceptance rate: 40% (20/50).Abhishek Kumar Singh, Ari Kapelyan, Minsung Kim, Davide Venturelli, Peter L. McMahon, and Kyle Jamieson, “Uplink MIMO Detection using Ising Machines: A Multi-Stage Ising Approach\" In IEEE Transactions on Wireless Communications, 23 (11) November 2024, 17 pages, IF: 8.9.Minsung Kim, “Quantum and Quantum-Inspired Computation for NextG MIMO Wireless Communications\" In ACM MobiSys 2024 - Rising Stars Forum, 2 pages.Minsung Kim, Annalise Stockley, Keith Briggs, and Kyle Jamieson, “Physics-Inspired Discrete-Phase Optimization for 3D Beamforming with PIN-Diode Extra-Large Antenna Arrays\" Arxiv Preprint 2024, 11 pages.Minsung Kim, “Quantum and Quantum-Inspired Computation for MIMO Communications in Wireless Networks\" Princeton Doctoral Dissertation, Department of Computer Science, Princeton University, NJ, USA, Nov. 2023.Minsung Kim, and Kyle Jamieson, \"Finer-Grained Decomposition for Parallel Quantum MIMO Processing\" In IEEE ICASSP 2023, 5 pages, Oral.Minsung Kim, Davide Venturelli, John Kaewell, and Kyle Jamieson, \"Warm-Started Quantum Sphere Decoding via Reverse Annealing for Massive IoT Connectivity\" In ACM MobiCom 2022, 14 pages, acceptance rate: 17.8% (56/314).Minsung Kim+, Srikar Kasi+, Aaron P. Lott, Davide Venturelli, John Kaewell, and Kyle Jamieson, “Heuristic Quantum Optimization for 6G Wireless Communications\" In IEEE Network, 35(4) July/August 2021, 8 pages, IF: 10.693, (1 of 3 Invited Papers in 2021). Minsung Kim, Salvatore Mandra, Davide Venturelli, and Kyle Jamieson, “Physics-Inspired Heuristics for Soft MIMO Detection in 5G New Radio and Beyond\" In ACM MobiCom 2021, 14 pages, acceptance rate: 16.8% (19/113, summer deadline). Minsung Kim, Davide Venturelli, and Kyle Jamieson, “Towards Hybrid Classical-Quantum Computation Structures in Wirelessly-Networked Systems\" In ACM HotNets 2020, 7 pages, acceptance rate: 24.8% (30/121)Minsung Kim, Davide Venturelli, and Kyle Jamieson, “Leveraging Quantum Annealing for Large MIMO Processing in Centralized Radio Access Networks\" In ACM SIGCOMM 2019, 15 pages, acceptance rate: 14.5% (32/221). TeachingFall 2025: Internet Technology (CS 352)Spring 2025: Computer Networks (CS 552)honors and awardsProf. Chin Ok Lee & Ms. Kwanghee Kim Award (2025) KSEA NRC Early Career AwardRising Stars of ACM MobiSys (2024)Siebel Scholars (Class of 2024) Top Students at World’s Leading Schools, $35,000 Award, Thomas and Stacey Siebel FoundationKOCSEA Moon-Jung Chung Scholarship (2023) 1st Place, Korean Computer Scientists and Engineers Association in AmericaNomination for ACM SIGMOBILE Doctoral Dissertation Award (2023)Nomination for ACM Doctoral Dissertation Award (2023)Adiabatic Quantum Computing (AQC) Junior Scientist Award (2023)Andrew Kim Memorial Foundation Engineering Award (2023)Princeton School of Engineering and Applied Science (SEAS) Award for Excellence (2022)Travel Grants: ACM SIGMOBILE Award (MobiCom'21), ACM SIGCOMM Award (SIGCOMM'23), Princeton Dean's Funding Award (MobiCom'21), Princeton SEAS Award (MobiCom'22), NSF Grant Award (MobiSys'24), NSF NeTS Early Career Workshop'25Qualcomm Innovation Fellowship (2021) $100,000 Award for Innovative ResearchPrinceton Honorific Fellow (2021 Nominee & 2022 Nominee designated as Alternate)Graduate Prize Scholarship (2021 & 2023), Korea University Alumni Association of New YorkNASA NAMS Student Spotlight (2020), NASA Ames Research CenterPrinceton Ph.D. Fellowship (2017)Earlier Honors and AwardsGreat Honor Graduation (2016), Korea UniversityPresidential Best Research Award (2016), Korea UniversityQualcomm IT Tour (Class of 2015) Invited Small Conference with Executive Chairman (Dr. Paul E. Jacobs)Creative Challenger Research Funding Scholarships (2016), Korea UniversityMerit-Based Undergraduate Full Scholarships & Academic High Honor Awards (all semesters)postdocs and studentsPostdoc Researchers  Dr. Byungjun Kim (Website)Visiting ScholarsDr. Saavan PatelPh.D. Students Shuo Huang Zeqiao Zhou(Under)graduate Students & WINLAB Summer Interns M.S. Students Alexander Markley (WINLAB Summer 2025, Fall 2025)Undergraduate Students  Andy Chang (Spring, Summer, Fall 2025)Alex Varjabedian (Fall 2025)Sanjeev Harikrishnan (Fall 2025)Karthik Mudakalli (Fall 2025)Oskar Iwaniuk (Spring, WINLAB Summer, Fall 2025)Niva Shah (Summer, Fall 2025)Shanmuka Sadhu (Fall 2025)Shaurya Baranwal (Fall 2025)Kevin Wang (Northwestern CS, Summer, Fall 2025)Prior StudentsArchit Kumar (Yale CS, Summer 2024)Jeffrey Tang  (WINLAB Summer 2025)Jiaming Chen (Yale CS visiting student, Winter 2024)Shehzad Sultan (WINLAB Summer 2025)Brian Chacon (Spring, WINLAB Summer 2025)High School StudentsJonny Chang (Moorestown High School, Summer 2025)Aaditya Mittal (Edison Academy Magnet School, Spring 2025)selected talksACM MobiCom'25 (2025), Hong Kong, China \"X-ResQ: Parallel Reverse Annealing for Quantum Maximum-Likelihood MIMO Detection with Flexible Parallelism\"Korea University (2025), Seoul, Korea\"Quantum and Emerging Non-traditional Computing for NextG Wireless Networks\", host: Prof. Sangheon PackSeoul National University (2025), Seoul, Korea\"Quantum and Emerging Non-traditional Computing for NextG Wireless Networks\", host: Prof. Kyunghan LeeYonsei University (2025), Seoul, Korea\"Quantum and Emerging Non-traditional Computing for NextG Wireless Networks\", host: Prof. Hojung ChaKAIST (2025), Deajeon, Korea\"Quantum and Emerging Non-traditional Computing for NextG Wireless Networks\", host: Prof. Song Min KimPOSTECH (2025), Pohang, Korea\"Quantum and Emerging Non-traditional Computing for NextG Wireless Networks\", host: Prof. Yoseb JeonDIMACS Workshop on Quantum Software Systems and Theory (2025), Ru",
  "content_length": 12959,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:29"
}