{
  "name": "Minxue Pan",
  "homepage": "https://minxuepan.github.io",
  "status": "success",
  "content": "Welcome to Minxue Pan's Homepage! Minxue Pan (潘敏学) 教授、博导 Professor Software Institute State Key Laboratory for Novel Software Technology Nanjing University, China mxpnju.edu.cn Focusing on the dependability of complex software systems, my research interests include software modelling and verification, software analysis and testing, cyber-physical systems, mobile computing, and intelligent software engineering. I obtained my Ph.D. degree in Computer Science and Technology from Nanjing University in 2014 (supervisor Prof. Xuandong Li). Before that, I obtained my B.Sc. degree, also from Nanjing University. Between 2009 and 2010, I studied in the Department of Electrical Engineering and Computer Sciences at UC Berkeley (supervisor Prof. Edward A. Lee). Latest News I am looking for motivated graduate students. Both master and Ph.D. students are welcome. Please send me emails with your CV if you are interested in making dependable and intelligent software systems. Three papers accepted by ASE 2025 (CCF-A). One paper accepted by RTSS 2025 (CCF-A). One paper accepted by OOPSLA 2025 (CCF-A). One paper accepted by TOSEM (CCF-A). Two papers accepted by FSE 2025 (CCF-A). One paper accepted by ISSTA 2025 (CCF-A). One paper accepted by TCAD (CCF-A). Three papers accepted by ICSE 2025 (CCF-A). Recent Selected Publications (More in Google Scholar and DBLP) [ASE 2025] Yuanhong Lan, Shaoheng Cao, Yifei Lu, Minxue Pan, Xuandong Li. NATE: A Network-Aware Testing Enhancer for Network-Related Fault Detection in Android Apps. In IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), Seoul, South Korea, 2025, forthcoming. [ASE 2025] Yalin Feng, Yifei Lu, Minxue Pan. PoliCond: Condition-Aware Ontology-Driven LLMs for Privacy Policy Analysis. In IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), Seoul, South Korea, 2025, forthcoming. [ASE 2025] Jiajun Li, Wenhua Yang, Minxue Pan, Yu Zhou. Understanding Feature Request Practice on GitHub via a Large-Scale Empirical Study. In IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), Seoul, South Korea, 2025, forthcoming. [RTSS 2025] Yufei Shi, Longlong Lu, Minxue Pan, Xuandong Li. Accelerating Timing Specification Verification of Interrupt-driven Real-time Systems. In IEEE Real-Time Systems Symposium (RTSS 2025), Boston, MA, USA, 2025, forthcoming. [OOPSLA 2025] Chaoyue Zhang, Longlong Lu, Yifei Lu, Minxue Pan, Xuandong Li. Towards a Theoretically-Backed and Practical Framework for Selective Object-Sensitive Pointer Analysis. In ACM SIGPLAN International Conference on Systems, Programming, Languages and Applications: Software for Humanity (SPLASH), OOPSLA, Singapore, 2025, forthcoming. [TOSEM 2025] Yifei Lu, Minxue Pan, Haochuan Lu, Yuetang Deng, Tian Zhang, Linzhang Wang, and Xuandong Li. Improving Test Efficacy for Large-Scale Android Applications by Exploiting GUI and Functional Equivalence. ACM Transactions on Software Engineering and Methodology. [link] [FSE 2025] Chun Li, Hui Li, Zhong Li, Minxue Pan, Xuandong Li. Improving Graph Learning-Based Fault Localization with Tailored Semi-Supervised Learning. In ACM International Conference on the Foundations of Software Engineering (FSE 2025), Trondheim, Norway, 2025, forthcoming. [FSE 2025] Shaoheng Cao, Renyi Chen, Wenhua Yang, Minxue Pan, Xuandong Li. A Mixed-Methods Study of Model-Based GUI Testing in Real-World Industrial Settings. In ACM International Conference on the Foundations of Software Engineering (FSE 2025), Trondheim, Norway, 2025, forthcoming. [ISSTA 2025] Shaoheng Cao, Minxue Pan, Yuanhong Lan, Xuandong Li. Intention-based GUI Test Migration for Mobile Apps using Large Language Models. In ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2025), Trondheim, Norway, 2025, forthcoming. [TCAD 2025] Longlong Lu, Minxue Pan, Yifei Lu, Xuandong Li. Hierarchical Model Checking of SystemVerilog-Specified Asynchronous Circuits for Deadlock Detection. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, Early Access. [link] [ICSE 2025] Heng Yong, Zhong Li, Minxue Pan, Tian Zhang, Jianhua Zhao, Xuandong Li. GVI: Guided Vulnerability Imagination for Boosting Deep Vulnerability Detectors. In Proceedings of the 47th International Conference on Software Engineering, Ottawa, ON, Canada, 2025, forthcoming. [ICSE 2025 (Best Artifact Award)] Menglong Chen, Tian Tan, Minxue Pan, Yue Li. PacDroid: A Pointer-Analysis-Centric Framework for Security Vulnerabilities in Android Apps. In Proceedings of the 47th International Conference on Software Engineering, Ottawa, ON, Canada, 2025, forthcoming. [ICSE 2025] Chun Li, Hui Li, Zhong Li, Minxue Pan, Xuandong Li. Enhancing Fault Localization in Industrial Software Systems via Contrastive Learning. In Proceedings of the 47th International Conference on Software Engineering, Ottawa, ON, Canada, 2025, forthcoming. [ASE 2024] Xinran Yu, Chun Li, Minxue Pan, Xuandong Li. DroidCoder: Enhanced Android Code Completion with Context-Enriched Retrieval-Augmented Generation. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, Sacramento, California, United States, pp. 681–693.[link] [ASE 2024] Shaoheng Cao, Renyi Chen, Minxue Pan, Wenhua Yang, Xuandong Li. Beyond Manual Modeling: Automating GUI Model Generation Using Design Documents. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, Sacramento, California, United States, pp. 91–103.[link] [ASE 2024] Jian Shen, Zhong Li, Minxue Pan, Xuandong Li. Prioritizing Test Inputs for DNNs Using Training Dynamics. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, Sacramento, California, United States, pp. 1219–1231.[link] [ASE 2024] Zhong Li, Chong Zhang, Minxue Pan, Tian Zhang, Xuandong Li. AACEGEN: Attention Guided Adversarial Code Example Generation for Deep Code Models. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, Sacramento, California, United States, pp. 1245–1257.[link] [ASE 2024] Yuanhong Lan, Yifei Lu, Minxue Pan, Xuandong Li. Navigating Mobile Testing Evaluation: A Comprehensive Statistical Analysis of Android GUI Testing Metrics. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, Sacramento, California, United States, pp. 944–956.[link] [ISSTA 2024] Zhong Li, Zhengfeng Xu, Ruihua Ji, Minxue Pan, Tian Zhang, Linzhang Wang, Xuandong Li. Distance-Aware Test Input Selection for Deep Neural Networks. In Proceedings of the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis, Vienna, Austria, pp. 248–260.[link] [ISSTA 2024] Zhongzhen Wen, Jiayuan Zhou, Minxue Pan, Shaohua Wang, Xing Hu, Tongtong Xu, Tian Zhang, Xuandong Li. Silent Taint-Style Vulnerability Fixes Identification. In Proceedings of the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis, Vienna, Austria, pp. 428–439.[link] [ISSTA 2024] Linna Xie, Chongmin Li, Yu Pei, Tian Zhang, Minxue Pan. BRAFAR: Bidirectional Refactoring, Alignment, Fault Localization, and Repair for Programming Assignments. In Proceedings of the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis, Vienna, Austria, pp. 856–868.[link] [ICSME 2024] Tingwei Zhu, Zhong Li, Tian Zhang, Minxue Pan, Xuandong Li. Precos: Project-specific Retrieval for Better Code Summarization. In Proceedings of the 40th International Conference on Software Maintenance and Evolution, forthcoming. [ICSME 2024] Zhongzhen Wen, Yifei Lu, Tongtong Xu, Minxue Pan, Tian Zhang, Xuandong Li. Enhancing Web Test Script Repair using Integrated UI Structural and Visual Information. In Proceedings of the 40th International Conference on Software Maintenance and Evolution, forthcoming. [OOPSLA 2024] Yifei Lu, Weidong Hou, Minxue Pan, Xuandong Li, Zhendong Su. Understanding and Finding Java Decompiler Bugs. In Proceedings of the ACM on Programming Languages, 8, OOPSLA, Article 143 (April 2024), 27 pages. [link] [ASEJ 2024] Jian Shen, Zhong Li, Yifei Lu, Minxue Pan, Xuandong Li. Mitigating the impact of mislabeled data on deep predictive models: an empirical study of learning with noise approaches in software engineering tasks. Automated Software Engineering 31, 33 (2024). [link] [JSEP 2024] Chaochao Shen, Wenhua Yang, Haitao Jia, Minxue Pan, Yu Zhou. Richen: Automated enrichment of Git documentation with usage examples and scenarios. JJournal of Software: Evolution and Process 2024;e2662. [link] [ICSE 2024] Shaoheng Cao, Minxue Pan, Yu Pei, Wenhua Yang, Tian Zhang, Linzhang Wang, Xuandong Li. Comprehensive Semantic Repair of Obsolete GUI Test Scripts for Mobile Applications. In Proceedings of the 46th International Conference on Software Engineering, Article 90, 1–13. [link] [ICSE 2024] Yuanhong Lan, Yifei Lu, Zhong Li, Minxue Pan, Wenhua Yang, Tian Zhang, Xuandong Li. Deeply Reinforcing Android GUI Testing with Deep Reinforcement Learning. In Proceedings of the 46th International Conference on Software Engineering, Article 71, 1–13. [link] [TOSEM 2024] Tingwei Zhu, Zhong Li, Minxue Pan, Chaoxuan Shi, Tian Zhang, Yu Pei, and Xuandong Li. Deep is Better? An Empirical Comparison of Information Retrieval and Deep Learning Approaches to Code Summarization. ACM Transactions on Software Engineering and Methodology, 33, 3, Article 67 (March 2024), 37 pages. [link] [ASE 2023] Ruihua Ji, Tingwei Zhu, Xiaoqing Zhu, Chunyang Chen, Minxue Pan, Tian Zhang. Vision-based Widget Mapping for Test Migration across Mobile Platforms: Are We There Yet? In Proceedings of the 38th IEEE/ACM International Conference on Automated Software Engineering, Luxembourg, Luxembourg, 2023, pp. 1416-1428. [link] [ASE 2023] Yingying He, Wenhua Yang, Minxue Pan, Yasir Hussain, and Yu Zhou. Understanding and Enhancing Issue Prioritization in GitHub. In Proceedings of the 38th IEEE/ACM Internation",
  "content_length": 19828,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:30"
}