{
  "name": "Minxuan Zhou",
  "homepage": "https://www.iit.edu/directory/people/minxuan-zhou",
  "status": "success",
  "content": "Minxuan Zhou | Illinois Institute of Technology Skip to main site navigation Skip to main content Minxuan Zhou Assistant Professor of Computer Science Tags: Faculty Computer Science Home Office and Department Directory Directory Minxuan Zhou EducationPh.D. Computer Science, University of California San Diego M.S. Computer Science, University of California San DiegoB.S. Computer Science and Technology, Beihang UniversityResearch InterestsSystemsHigh Performance and Parallel ComputingPublicationsCONFERENCESMinxuan Zhou, Yujin Nam, Xuan Wang, Youhak Lee, Chris Wilkerson, Raghavan Kumar, Sachin Taneja, Sanu Mathew, Rosario Cammarota, and Tajana Rosing, “UFC: A Unified Accelerator for Fully Homomorphic Encryption”, 57th IEEE/ACM Inter-national Symposium on Microarchitecture, 2024 (accepted)Chien-Yi Yang, Minxuan Zhou, Flavio Ponzina, Suraj Sathya Prakash, Raid Ayoub, Pietro Mercati, Mahesh Subedar, and Tajana Rosing, “Multi-Objective Software-Hardware Co-Optimizationfor HD-PIM via Noise-Aware Bayesian Optimization”, ACM/IEEE International Conference on Computer-Aided Design, 2024 (accepted)Eunji Kwon, Minxuan Zhou, Weihong Xu, Tajana Rosing and Seokhyeong Kang, “RL-PTQ: RL-based Mixed Precision Quantization for Hybrid Vision Transformers”, Design Automation Conference (DAC), 2024Jaeyoung Kang, You Hak Lee, Minxuan Zhou, Weihong Xu and Tajana Rosing, “HygHD: Hyperdimensional Hypergraph Learning”, Design, Automation, and Test in Europe (DATE), 2024Yue Pan,Minxuan Zhou, Chonghan Lee, Zheyu Li, Rishika Kushwah, Vijaykrishnan Narayanan, and Tajana Rosing, “PRIMATE:Processing in Memory Acceleration for Dynamic Token-pruning Transformers”, 29th Asia and South Pacific Design Automation Conference (ASP-DAC), 2024Yujin Nam, Minxuan Zhou, Saransh Gupta, Gabrielle De Micheli, Rosario Cammarota, Chris Wilkerson, Daniele Micciancio, and Tajana Rosing, “Efficient Machine Learning on Encrypted Data using Hyperdimensional Computing”, IEEE/ACM International Symposium on Low Power Electronics and Design (ISLPED), 2023Minxuan Zhou*, Xuan Wang*, and Tajana Rosing, “OverlaPIM: Overlap Optimization for Processing In-Memory Neural Network Acceleration”, Design, Automation and Test in Europe Conference, 2023Jaeyoung Kang, Minxuan Zhou, Abhinav Bhansali, Weihong Xu, Anthony Thomas and Tajana Rosing, “RelHD: A Lightweight Graph-based Learning with Hyperdimensional Computing”, The 40th IEEE International Conference on Computer Design (ICCD), 2022Minxuan Zhou*, Weihong Xu*, Jaeyoung Kang, and Tajana Rosing, “TransPIM: A Memory-based Acceleration via Software-Hardware Co-Design for Transformers”, The 28th IEEE International Symposium on High-Performance Computer Architecture (HPCA), 2022Yizhou Wei, Minxuan Zhou, Sihang Liu, Korakit Seemakhupt, Tajana Rosing and Samira Khan. “PIMProf: An Automated Program Profiler for Processing-in-Memory Offloading Decisions”, Design, Automation and Test in Europe Conference 2023 Yeseong Kim, Mohsen Imani, Saransh Gupta, Minxuan Zhou, and Tajana Rosing. Massively Parallel Big Data Classification on a Programmable Processing In-Memory Architecture., IEEE/ACM International Conference On Computer Aided Design (ICCAD), 2021Minxuan Zhou*, Lingxi Wu*, Muzhou Li, Niema Moshiri, Kevin Skadron, and Tajana Rosing, “Ultra Efficient Acceleration for De Novo Genome Assembly via Near-Memory Computing”, International Conference on Parallel Architectures and Compilation Techniques (PACT), 2021Minxuan Zhou, Guoyang Chen, Mohsen Imani, Saransh Gupta, Weifeng Zhang, and Tajana Rosing, “PIM-DL: Boosting DNN Inference on Digital Processing In-Memory Architectures via Data Layout Optimizations”, International Conference on Parallel Architectures and Compilation Techniques (PACT), 2021Minxuan Zhou, Yunhui Guo, Weihong Xu, Bin Li, Kevin Eliceiri, and Tajana Rosing, “MAT: Processing In-Memory Acceleration for Long-Sequence Attention”, Design Automation Conference (DAC), 2021Xiao Liu,Minxuan Zhou, Rachata Ausavarungnirun, Sean Eilert, Ameen Akel, Tajana Rosing, Vijaykrishnan Narayanan, Jishen Zhao, “FPRA: A Fine-grained Parallel RRAM Architecture”, IEEE/ACM International Symposium on Low Power Electronics and Design (ISLPED), 2021Minxuan Zhou, Muzhou Li, Mohsen Imani, and Tajana Rosing, “HyGraph: Accelerating Graph Processing with Hybrid Memory-centric Computing”, Design, Automation and Test in Europe Conference (DATE), 2021Minxuan Zhou, Mohsen Imani, Yeseong Kim, Saransh Gupta, and Tajana Rosing, “DPSim: A Full-stack Simulation Infrastructure for Digital Processing In-Memory Architecture”, 26th Asia and South Pacific Design Automation Conference (ASP-DAC), 2021Mohsen Imani, Saikishan Pampana, Saransh Gupta, Minxuan Zhou, Yeseong Kim, and Tajana Rosing. Dual: Acceleration of clustering algorithms using digital-based processing in-memory., 53rd Annual IEEE/ACM International Symposium on Microarchitecture (MICRO), 2020Xiao Liu, Minxuan Zhou, Tajana Rosing, and Jishen Zhao. 2019. HR3AM: A Heat Resilient Design for RRAM-based Neuromorphic Computing. ACM/IEEE International Symposium on Low Power Electronics and Design (ISLPED), 2019Mohsen Imani, Saransh Gupta, Yeseong Kim, Minxuan Zhou, and Tajana Rosing. DigitalPIM: Digital-based Processing In-Memory for Big Data Acceleration. ACM Proceedings of the 2019 on Great Lakes Symposium on VLSIMinxuan Zhou, Mohsen Imani, Saransh Gupta, and Tajana Rosing, “Thermal-Aware Design and Management for Search-based In-Memory Acceleration”, Design Automation Conference (DAC), 2019.Minxuan Zhou, Mohsen Imani, Saransh Gupta, Yeseong Kim, and Tajana Rosing, “GRAM: Graph Processing in a ReRAM-based Computational Memory”, 24th Asia and South Pacific Design Automation Conference (ASP-DAC), 2019Minxuan Zhou, Mohsen Imani, Saransh Gupta, and Tajana Rosing, “GAS: A Heterogeneous Memory Acceleration for Graph Processing”, IEEE/ACM International Symposium on Low Power Electronics and Design (ISLPED), 2018. JOURNALSXuan Wang*, Minxuan Zhou* (co-first author),and Tajana Rosing. “Fast-OverlaPIM: A Fast Overlap-driven Mapping Framework for Processing In-Memory Neural Network Acceleration”. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 2024Lingxi Wu*, Minxuan Zhou* (co-first author), Weihong Xu, Ashish Venkat, Tajana Rosing, and Kevin Skadron, “Abakus: Accelerating k-mer Counting With Storage Technology”, ACM Transactions on Architecture and Code Optimization (TACO), 2024Minxuan Zhou, Andreas Prodromou, Rui Wang, Hailong Yang, Depei Qian, Dean Tullsen. “Temperature-Aware DRAM Cache Management -Relaxing Thermal Constraints in 3D Systems”. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 2019 Contact Information SB 226B Learn more... Illinois Tech welcomes you to join our community of people who discover, create, and solve. Apply today, visit us in Chicago, and contact us for more information. Request Info Visit Apply",
  "content_length": 6909,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:30"
}