{
  "name": "Minyi Guo",
  "homepage": "https://cs.sjtu.edu.cn/~guo-my",
  "status": "success",
  "content": "Dr. Minyi Guo's Home Page Dr. Minyi Guo ( 过 敏意 ) IEEE Fellow Zhiyuan Chair Professor European Academy of Sciences Member ACM Distinguished Member Department of Computer Science and Engineering Director of Emerging Parallel Computing Center Shanghai Jiao Tong University Tel: Fax: Office: Address: Email: (+86) 21 3420-4438 (+86) 21 3420-6609 Room 415, SEIEE Building 3 No. 800, Dongchuan Road, Minhang District, Shanghai, China, 200240 guo-my'AT'cs.sjtu.edu.cn Index Research Interest Grants Education Background Acadmic Activities Work Experience Publications Awards and Honors Links Research Interest Parallel computing, Cloud Computing, Big Data, Parallelizing Compilers, Pervasive Computing, Green Computing Education Background Dr. Minyi Guo received the B.S. and M.E. degrees in Computer Science from Nanjing University, China in 1982 and 1986, respectively. From 1986 to 1994, he had been an assistant professor of the Department of Computer Science at Nanjing University. He received the Ph.D. degree in information science from University of Tsukuba, Japan in 1998. Work Experience From 2000 to 2009, Dr. Guo had been an assistant/associate/full professor of the school of computer science and engineering, University of Aizu, Japan. From 2009, he is a chair professor the Department of Computer Science and Engineering of Shanghai Jiao Tong University (SJTU), China, and was the department head from 2009 to 2019. Awards and Honors Best Paper Award 1 [ISCA 2024 Best Paper Nomination] \"Xiaofeng Hou, Tongqiao Xu, Chao Li, Cheng Xu, Jiacheng Liu, Yang Hu, Jieru Zhao, Jingwen Leng, Kwang-Ting Cheng, Minyi Guo. A Tale of Two Domains: Exploring Efficient Architecture Design for Truly Autonomous Things.\" 2 [IWQoS 2024 Best Paper Honorable Mention Award] \"Xiaofeng Hou, Peng Tang, Tongqiao Xu, Cheng Xu, Chao Li, Minyi Guo. CPM: A Cross-Layer Power Management Facility to Enable Highly-efficient Real-time AIoT Systems.\" 3 [ICCD 2024 Best Paper Candidate] \"Xinkai Wang, Chao Li, Lingyu Sun, Qizheng Lv, Xiaofeng Hou, Jingwen Leng and Minyi Guo. SHEEO: Continuous Energy Efficiency Optimization in Autonomous Embedded Systems.\" 4 [EURO-PAR 2023 Best Paper Nomination] \"Xiaofeng Hou, Jiacheng Liu, Xuehan Tang, Chao Li, Kwang-Ting Cheng, Li Li, Minyi Guo. MMExit: Enabling Fast and Efficient Multi-modal DNN Inference with Adaptive Network Exits\" 5 [ICPE 2022 Best Paper Best Paper Runner-up] \"Chuanming Shao, Jinyang Guo, Pengyu Wang, Jing Wang, Chao Li, Minyi Guo. Oversubscribing GPU Unified Virtual Memory: Implications and Suggestions\" 6 [SC 2021 Best Reproducibility Advancement Finalist] \"Weihao Cui, Han Zhao, Quan Chen, Ningxin Zheng, Jingwen Leng, Jieru Zhao, Zhuo Song, Tao Ma, Yong Yang, Chao Li, Minyi Guo. Enable simultaneous DNN services based on deterministic operator overlap and precise latency prediction\" 7 [IPDPS 2019 Featured Paper] \"Wenyi Zhao, Quan Chen, Hao Lin, Jianfeng Zhang, Jingwen Leng, Chao Li, Wenli Zheng, Li Li, Minyi Guo. Themis: Predicting and Reining in Application-level Slowdown on Spatial Multitasking GPUs.\" 8 [ICCD 2018 Best Paper Award] \"Xiaofeng Hou, Luoyao Hao, Chao Li, Quan Chen, Wenli Zheng, Minyi Guo: Power Grab in Aggressively Provisioned Data Centers: What is the Risk and What Can Be Done About It.\" 9 [ISPA 2017 Best Paper Award] \"Yanchao Lu, Quan Chen, Yao Shen, Minyi Guo: Electro: Toward QoS-Aware Power Management for Latency-Critical Applications.\" 10 [ASPLOS 2017 Highlight Paper Award] \"Quan Chen, Hailong Yang, Minyi Guo, Ram Srivatsa Kannan, Jason Mars, Lingjia Tang: Prophet: Precise QoS Prediction on Non-Preemptive Accelerators to Improve Utilization in Warehouse-Scale Computers.\" 11 [UIC 2016 Best Paper Award] \"Yuanyi Chen, Minyi Guo, Jiaxing Shen, Jiannong Cao: A Graph-Based Method for Indoor Subarea Localization with Zero-Configuration.\" Awards Obtained in China Ministry of Education Science and Technology Progress Award (the first class award), 2021 State Technological Invention Award (the second class award), 2019 Shanghai Technological Invention Award (the first class award), 2018 Ministry of Education Natural Science Award (the first class award), 2017 Recruitment Program of Global Experts, 2010 Excellent Academic Leaders of Shanghai, 2010 National Science Fund for Distinguished Young Scholars, 2007 Awards Obtained in World Huawei Olympus Award, 2024 Edward J. McCluskey Award, 2023 Grants and Funding 1 [\tNational Key Research and Development Program of China ] “The data ﬂow heterogeneous processor architecture and computing system”. Principal Investigator. 2023.03—2026.02. 2 [\tNational Natural Science Foundation of China ] “Architecture and key technologies for efficient processing of big data”. Co-PI (PI at SJTU). 2019.01—2023.12. 3 [\tNational Natural Science Foundation of China ] “Research on key technologies of distributed resource management based on blockchain”. Principal Investigator. 2019.01—2022.12. 4 [\t973 Project ] “The Theory and Method of Ternary Space Collaborative Computing for Urban Big Data”. Principal Investigator. 2015.01—2019.08. 5 [\tNational Natural Science Foundation of China ] \"Parallel programming models and their runtime support on manycore platforms\". Principal Investigator. 2013.01—2016.12. 6 [\tNational Natural Science Foundation of China ] \"Object search in cyber-phisical space\". Principal Investigator. 2013.01—2016.12. 7 [\t863 Project ] \"Network operating system for supporting on-line e-business\". Principal Investigator. 2011.01—2013.12. 8 [\tNational Natural Science Foundation of China ] \"Distinguished Young Scholars Award\". 2008.01—2011.12. 9 [\t863 Project ] “High Performance and Low Power Compiler Optimization for Multi-core Architectures\". Principal Investigator. 2009.01—2010.12. 10 [\tNational Natural Science Foundation of China ] \"Key program for Pervasive Computing\". Principal Investigator. 2006.01—2009.12. 11 [\tDistinguished Pu-Jiang Scholars Award ] Principal Investigator. 2007.09—2009.12. 12 [\t985 project ] Principal Investigator. 2007.10—2009.12. 13 [\tKey 863 program for Adaptive Environment of Pervasive Computing ] Minister of Science and Technology of China. Co-PI (PI at SJTU). 2007.01—2008.12. 14 Over $20M federal funding as principal investigator Academic Activities Keynote Speeches and Talks 1 Keynote Speech,“Key techniques and system of Cloud computing for load bursting service”, The 25th IEEE International Conference on Parallel and Distributed Systems (ICPADS 2019), Tianjin, China, December 4, 2019 2 Keynote Speech,“New Datacenter Architecture with Utilization and QoS for Big Data Processing”, The 15th Annual IFIP International Conference on Network and Parallel Computing (NPC 2018), Hokkaido, Japan, November 29，2018 3 Keynote Speech,“Platform Development for Collaborative Computing with Urban Big data”, The 9th IEEE/ACM International Conference on Utility and Cloud Computing (UCC 2016) , Shanghai, China, December 6, 2016 4 Keynote Speech,“Energy Efficient Data Access and Storage through HW/SW Co-design”, Proceedings of the 2014 SIGPLAN/SIGBED conference on Languages, compilers and tools for embedded systems (LCTES 2014) , Edinburgh, UK, June 12, 2014 5 Keynote Speech, \"Data Center Architecture and OS for Massively Data-Intensive Computing\", The 11th IEEE/IFIP International Conference on Embedded and Ubiquitous Computing (EUC 2013), Zhangjiajie, China, November 13, 2013. 6 Keynote Speech, \"Practice in Pervasive Computing at Mobile Internet Age\", The 9th Chinese Conference on Harmonious Human Machine Environment (HHME 2013), Nanchang, China, September 28, 2013. 7 Keynote Speech, \"iCampus: A LOCATION & CONTEXT AWARENESS PERVASIVE ENVIRONMENT\", The 6th international conference on multimedia and ubiquitous engineering (MUE 2012), Leganes, Madrid, China, July 11, 2013. 8 Keynote Speech, IEEE International Conference on Computational Science and Engineering (CSE 2011), Dalian, China, August, 2011. 9 Keynote Speech, Sino-German Workshop on Cloud-based High Performance Computing, Shanghai, China, September, 2011. 10 Keynote Speech, China-USA Computer Software Workshop, Beijing, China, September, 2011. 11 Keynote Speech, 2010 International Symposium on Parallel Architectures, Algorithms and Programming (PAAP 2010), Dalian, China, December, 2010. 12 Keynote Speech, \"Internet of Things in China\" [PPT], Pacific Rim Applications and Grid Middleware Assembly (PRAGMA 2010), Changchun, China, September, 2010 13 2010 CCF, Conference on Future Computing, Changsha, China, June, 2010 Professional Services 1 Editor-in-chief, IEEE Transactions on Sustainable Computing (TSUSC) 1 Editor, IEEE Transactions on Cloud Computing (TCC) 2 Editor, IEEE Transactions on Computers (TC) 3 Editor, IEEE Transactions on Parallel and Distributed Systems (TPDS) 4 Editor, Journal of Parallel and Distributed Computing(JPDC) 5 Editor, Journal of Computer Science and Technology (JCST) 6 Member of IEEE Computer Society Fellows Evaluation Committee 7 General Chair/Program Chair for 14 international conferences 8 Department Head of Computer Science and Engineering (2009 – 2019) 9 Member of Academic Committee of the University (2016 -- present) 10 Graduated 30+ Ph.D. students and currently supervising 10 Ph.D. students Conference/Program Committee Chair 1 General Chair, IEEE International Symposium on Reliable Distributed Systems (IEEE SRDS 2020), Shanghai, China, 2020 2 General Chair, IEEE Asia-Pacific Services Computing Conference (IEEE APSCC 2019), Sydney, Australia, 2019 3 General Chair, The 10th IEEE International Conference on Big Data Science and Engineering (BigDataSE 2016), Tianjin, China, 2016 4 Program Chair, Research in Applied Computation Symposium (RACS'11), Florida, USA, 2011 5 Steering Chair, IEEE International Symposium on Parallel and Distributed Processing with Applications (ISPA'11), Busan, Korea, 2011 6 General Chair, International Symposium on Pervasive Systems, Algorithms, and Networks (I-SPAN'11), Dalian,",
  "content_length": 33304,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:30"
}