{
  "name": "Minzhao Lyu",
  "homepage": "https://minzhaolyu.github.io",
  "status": "success",
  "content": "About Me - Minzhao Lyu Minzhao LyuLecturer in Internet and Network Systems Follow Sydney, NSW, Australia University of New South Walesminzhao.lyu@unsw.edu.auUNSW Staff ProfileUNSW Researcher Profile LinkedIn ResearchGate Google Scholar ORCIDI am currently working as a Lecturer (Teaching & Research) in Network Systems and Internet at the University of New South Wales (UNSW), Sydney, Australia. I received my B.Eng. (First Class Hons.) and Ph.D. degree from the University of New South Wales, Sydney, Australia in 2017 and 2022 respectively.My current research interests focus on AI for Network Observability including AI-Native Network Data, AI Models for Network Traffic Analysis, and AI Systems for Network Measurement.I actively publish at the two top conferences (ACM SIGMETRICS and ACM IMC) of the Measurement & Performance Analysis System Discipline ranked by CSRankings; and JCR Q1 journals in the Computer Networks and Communications discipline.The website also contains a list of my publications, blogs, teaching and professional services. You may also find my profile at Google Scholar and ResearchGate.(For Future Students): Our group is continously looking for PhD students and UNSW undergraduate/honours thesis students who are self-motivated and have strong background in computer networks and systems. If you are interested, please do not hestiate contacting me via email [minzhao.lyu@unsw.edu.au].Updates(Oct 2025) Measuring Cloud Gaming at Scale is accepted at IEEE/ACM Transactions on Networking journal.(Sep 2025) Measuring Cloud Gaming Contexts for Effective QoE first-authored by PhD student Yifan Wang is accepted at ACM IMC 2025.(Sep 2025) Joined the TPC for PAM 2026.(Jul 2025) Joined the TPC for ACM SIGMETRICS 2026.(Mar 2025) Early yet Robust Flow Classification first-authored by MPhil student Rushi Babaria is accepted at ACM SIGMETRICS 2025.(Jan 2025) Successfully promoted to Lecturer at UNSW Sydney!More -->",
  "content_length": 1940,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:30"
}