{
  "name": "Miodrag Bolic",
  "homepage": "http://www.site.uottawa.ca/~mbolic",
  "status": "success",
  "content": "Miodrag Bolic Miodrag Bolic Professor Computer Engineering Undergraduate Associate Director Interim Applied AI ELG Program Graduate Director University of Ottawa, Ottawa, Canada School of Electrical Engineering and Computer Science mbolic [AT] uottawa [DOT] ca Office: 613 562-5800 ext. 6224 Room: CBY A-616, 161 Louis Pasteur, Ottawa, Ontario, Canada, K1N 6N5 Research GroupsComputational Analysis and Acceleration Research, Group (CARG) CARG GitHub Health Devices Research Group (HDRG), Health Devices GitHub Curriculum Vitae Research Dr. Bolic's research is multidisciplinary and includes biomedical signal processing and instrumentation, computer architectures, UAV detection and radio frequency identification (RFID) systems. Dr. Bolic is currently interested in addressing real-life problems through signal processing and machine learning in biomedical and automotive applications. In biomedical applications, he works with patient data in close collaboration with physicians and other medical personnel while developing wearable as well as contactless solutions with radars and thermal, depth and RGB cameras. In automotive applications, he is focusing on counter-drone and inspection problems with UAVs, again focusing on working with experimental field data. In these applications, his approach is to model and simulate the problem in order to understand it better. His main recent research contributions can be classified as follows: Biomedical signal processing and instrumentation HRRG Biomedical Lab Presentation Blood pressure measurement: Developed methods for robust and reliable measurement of systolic and diastolic blood pressure using both traditional and continuous blood pressure monitoring techniques, see HDRG Research. Contactless estimation of breathing rate and activities using radars and cameras: New methods for fall detection, posture detection and breathing estimation have been devised, see HDRG Research. Heart failure monitoring: New methods for classifying breathing patterns and estimating central vein pressure have been recently developed. Signal processing and machine learning algorithms for UAV applications CARG UAV Lab Presentation Detection and tracking of intruder UAVs using radars and cameras: Development of hybrid physical and machine learning models for detecting UAVs, see CARG Research. Beyond visual line of sight flights Powerline inspection and classification of powerline components Detection of UAVs in 5G networks New Book: PERVASIVE CARDIOVASCULAR AND RESPIRATORY MONITORING DEVICES: Model-Based Design Pervasive Cardiac and Respiratory Monitoring Devices: Model-Based Design is the first book to combine biomedical instrumentation and model-based design. As the scope is limited to cardiac and respiratory devices only, this book offers more depth of information on these devices; focusing in on signals used for home monitoring and offering additional analysis of these devices. The author offers an insight into new industry and research trends, including advances in contactless monitoring of breathing and heart rate. To downlowad all Matlab code and Simscape models, please go to Book GitHub Site. To see HTML version of the code, please go to Book's HTML Matlab Live Editor Files. To see publisher website or purchase the book, please go to Science Direct or Elsevier. Teaching Current teaching: ELG 5218 Uncertainty Evaluation in Engineering Measurements and Machine Learning BIOM5100/BMG5103/SYSC5302/ELG6321 Bioinstrumentation/Principles & Design of Advanced Biomedical Instrumentation CEG 4131 Computer architecture III From 2012 Teaching exoerience: Undergraduate CEG4136 Computer Architecture III, fall 2004, 2005, 2006, 2007, 2008, 2010, 2011, 2012, 2013, 2014, 2015, 2016 CEG3156 High-Level Computer System Design, winter 2005 to 2012, 2014, 2016 ELG4177 Digital Signal Processing, winter 2007 to 2009, 2014, 2022 CEG3155 Digital Design II, fall 2014, 2015 Graduate ELG6163 Digital Signal Processing Microprocessors, Software and Applications, winter 2006, 2007 ELG6158 Digital systems architectures, Fall 2007, Winter 2010, 2012 ELG7177 Topics in Communications: Radio Frequency Identification (RFID) Systems, Fall 2009, 2011, 2012 ELG7187 Topics in Computers: Multiprocessor Systems on Chip, Fall 2010, Winter 2012. BIOM 5100 / BMG 5103 / SYSC5302 / ELG 6321 Bioinstrumentation/Principles & Design of Advanced Biomedical Instrumentation, Fall 2013, 2014, 2015, 2016, 2018, 2020. ELG 7172B: Topics in Signal Processing: Principles of Data and Error Analysis in Engineering, 2017 ELG5218: Uncertainty Evaluation in Engineering Measurements and Machine Learning, 2019, 2021, 2022. Research Associates, Ph.D. and M.Sc. Students Dr. Kesav Ram Kaza, Postdoctoral Fellow, Start date: July 2023 Dr. Hamid Asad, Research associate, Start date: Sept 2021 Shan He (Ph.D.), Start date: 2019 Cristovao Iglesias (Ph.D.), Start date:2020 Fardad Dadboud (Ph.D.) Start date:2021 Mohamad Hosein Davoodabadi Farahani (M.Sc.) Start date: 2021 Zixiong Han (Ph.D.), Start date: Sept 2021 Meng Lian (Ph.D.), Start date: Jan 2023 Tianyu Zhang (Ph.D.), Start date: Sept 2021 Mehak Dhothar (M.Sc.) 2023-2025 Daniel Charon (M.Sc.) 2022-2025 Alumni Please see the list in Curriculum Vitae Recent Publications and Talks: Recent talks Keynote speech: Methods for UAV Detection, ICCIMS conference, July 2024. EMBC Workshop: Model-Based Design for Cardiovascular Monitoring Devices: Examples Using Oscillometric and Continuous Blood Pressure Methods, EMBC 2024. Invited speech, Contactless Cardiac and Respiratory Monitoring, University College London, UK, 2024. Tutorial: Quantifying Uncertainty in Measurement Devices, I2MTC conference, Glasgow, UK, 2024. Invited speech, Computer Architectures and Algorithms: From Filtering to Deep Learning, CMC Canada, Accelerating AI 2022. Journal papers from 2020 M. Yoshida, H.R. Dajani, S. Ando, S. Shimizu, M. Bolic, V. Groza, Analysis of the effect of CPAP on hemodynamics using clinical data and a theoretical model: CPAP therapy decreases cardiac output mechanically but increases it via afterload reduction, Sleep Medicine, Elsevier, 2023. C. F. Iglesias Junior, M. Ristovski, M. Cuperlovic-Culf, M. Bolic, Adeno-Associated Viruses: Current Outlook and Challenges of Soft Sensing in Upstream Processing, MDPI Bioengineering, Special issue: Design, Optimization and Scale-Up of Industrial Bioprocess, 2023. C. Iglesias Jr, X. Xu, V. Mehta, M. Akassou, A. Venereo-Sanchez, N. Belacel, A.. Kamen and M. Bolic, Monitoring the Recombinant Adeno-Associated Virus Production by Extended Kalman Filter, Processes, MDPI, 2022. A. Fallatah, M. Bolic, M. MacPherson, D.J. La Russa, Monitoring respiratory motion during VMAT treatment delivery using ultra-wide band radar, Sensors, MDPI, 2022. S. He, Z. Han, C. Iglesias, V. Mehta, M. Bolic, A Real-Time Respiration Monitoring and Classification System using a Depth Camera and Radars, Frontiers in Physiology, section Physio-logging, 2022. F. Yang, S. He, S. Sadanand, A. Yusuf and M. Bolic, Contactless Measurement of Vital Signs Using Thermal and RGB Cameras: A Study of COVID 19-Related Health Monitoring, Sensors, MDPI, 2022 M. Bolic, H.R. Dajani, M. Yoshida, V. Groza, Progress in the assessment of arterial stiffness, accepted for publication in IEEE Instrumentation and Measurement Magazine, 2020. Q. Zhai, M. Bolic, Y. Li, W. Cheng, and C. Liu, A Q-learning based Resource Allocation for Downlink Non-Orthogonal Multiple Access Systems Considering QoS, IEEE Access, vol. 9, pp. 72702-72711, 2021. H. Sadreazami, M. Bolic and S. Rajan, \"Contactless Fall Detection using Time-Frequency Analysis and Convolutional Neural Network, accepted for publication in IEEE Transactions of Industrial Informatics, 2020. Selected conference papers from 2020 C. Iglesias, M. Bolic, Limitations of Joint and Dual Nonlinear Kalman Estimators in Low-Cost Bioprocess Monitoring, accepted for presentation at an ICML workshop, 2024. T. Zhang, et al., Non-Contact Heart Rate and Respiratory Rate Estimation from Videos of the Neck, accepted for presentation at the 2024 46th Annual International Conference of the IEEE Engineering in Medicine & Biology Society, 2024. H. Azad, V. Mehta, I. Mantegh, M. Bolic, DroneRanger: Vision-Driven Deep Learning for Drone Distance Estimation, 2024 International Conference on Unmanned Aircraft Systems (ICUAS). H. Azad, V. Mehta, F. Dadboud, M. Bolic, and I. Mantegh, Air-to-air simulated drone dataset for AI-powered problems, in 42th Digital Avionics Systems Conference (DASC), 2023. M. Bolic, Simulating the Effects of Melanin and Air Gap Depth on the Accuracy of Reflectance Pulse Oximeters, In Proceedings of the 16th International Joint Conference on Biomedical Engineering Systems and Technologies (BIOSTEC 2023) - Volume 1: BIODEVICES, pages 64-71 H. Sadreazami, A. Khoyani, M. Amini, S. Rajan and M. Bolic, Radar based Fall Detection with Imbalance Data Handling and Data Augmentation, 2023 IEEE Sensors Applications Symposium (SAS), 2023. H. Azad, V. Mehta, M. Bolic, I. Mantegh, Simulated Dataset for the Loaded vs. Unloaded UAV Classification Problem Using Deep Learning, 2023 IEEE Sensors Applications Symposium (SAS), 2023. V. Mehta, F. Dadboud, I. Mantegh, M. Bolic, A Deep Learning Approach for Drone Detection and Classification using Radar and Camera Sensor Fusion, 2023 IEEE Sensors Applications Symposium (SAS), 2023. M. Lian, M. Bolic, An Attention based Complex-valued Convolutional Autoencoder for GEO SA-Bi SAR Ship Target Refocusing, 2023 IEEE Sensors Applications Symposium (SAS), 2023. S. H. Gazani, F. Dadboud, M. Bolic, I. Mantegh, H. Najjaran, Object Semantics Give Us the Depth We Need: Multi-task Approach to Aerial Depth Completion, the IEEE International Conference on Systems, Man, and Cybernetics (SMC), 2023. C. F. Iglesias Jr, R. Guo, P. Nucci, C. Miceli, M. Bolic, Automated Extraction of IoT Critical Objects from IoT Storylines, Requirements and User Stories via NLP, 10th IEEE Swiss Conference on Data ",
  "content_length": 14482,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:32"
}