{
  "name": "Miqing Li",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/li-miqing.aspx",
  "status": "success",
  "content": "Dr Miqing Li - School of Computer Science - University of Birmingham Dr Miqing Li BSc, MSc, PhD School of Computer ScienceAssociate Professor Contact details Telephone+44 (0) 121 414 3712Emailm.li.8@bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Miqing Li is a computer science researcher exploring how AI can be used to solve complex optimisation problems, such as multi-/many-objective, expensive, uncertain, and combinatorial problems. Dr Miqing Li’s research lies at the interface of AI and optimisation, focusing on the development of computational intelligence techniques (e.g., evolutionary algorithms, local search, Bayesian optimisation) to tackle complex fundamental and practical optimisation problems, particularly those involving multiple objectives. Miqing’s current research interests include: Multi-objective combinatorial optimisation – evolutionary algorithms, local search and neural combinatorial optimisation. Expensive and robust optimisation - evolutionary algorithms and Bayesian optimisation. Fundamental issues in multi-objective optimisation, including algorithm design, archiving, fitness landscape analysis, performance assessment, visualisation, multi-criteria decision-making, and many-objective optimisation. Practical optimisation applications in various areas, including software engineering, machine learning, mechanical engineering, and chemical engineering. Please see Dr Miqing Li’s personal web page to find out more about his work. Algorithms for Data Science (module lead) Artificial Intelligence 2 The areas I am interested in supervising include: multi-objective optimisation, combinatorial optimisation, evolutionary algorithms, local search, Bayesian optimisation, neural combinatorial optimisation, multi-criteria decision-making, and optimisation in applied areas. Evolutionary multi-/many-objective optimisation --- algorithm design, performance assessment, archiving. Evolutionary computation for other general challenging scenarios --- constraint handling, multi-modal optimisation, dynamic/robustness optimisation, data-driven optimisation. Multi-criteria decision-making --- visualisation, objective reduction, assisted decision-making. Search-based software engineering --- testing, software product line, software service composition Engineering applications --- disassembly line balancing, post-disaster response, workflow scheduling in cloud computing. Multi-objective optimisation for machine learning --- neural architecture search, reinforcement learning for video game. Recent publications Article Tong, H, Li, M, Liu, J & Yao, X 2025, 'How do dynamic events change the fitness landscape of traveling salesman problems?', IEEE Transactions on Evolutionary Computation. https://doi.org/10.1109/TEVC.2025.3538547 Jiang, C & Li, M 2025, 'Multi-Objectivising Acquisition Functions in Bayesian Optimisation', ACM Transactions on Evolutionary Learning and Optimization. https://doi.org/10.1145/3716504 Zhang, Q, Fu, X, Yang, S, Jiang, S, Li, M & Zheng, Z 2025, 'Solving dynamic multi-objective engineering design problems via fuzzy c-means prediction algorithm', Swarm and Evolutionary Computation, vol. 98, 102057. https://doi.org/10.1016/j.swevo.2025.102057 Bian, C, Zhou, Y, Li, M & Qian, C 2025, 'Stochastic population update can provably be helpful in multi-objective evolutionary algorithms', Artificial Intelligence, vol. 341, 104308. https://doi.org/10.1016/j.artint.2025.104308 Yu, Z, Zhou, W, Tang, C, Li, M, Zhen, L & Lv, J 2026, 'UniQ-ViT: Optimization-driven uniform quantization for vision transformer acceleration', Neurocomputing, vol. 663, 132072. https://doi.org/10.1016/j.neucom.2025.132072 Chen, T & Li, M 2024, 'Adapting Multi-objectivized Software Configuration Tuning', Proceedings of the ACM on Software Engineering, vol. 1, no. FSE, 25, pp. 539-561. https://doi.org/10.1145/3643751 Han, X, Chao, T, Yang, M & Li, M 2024, 'A steady-state weight adaptation method for decomposition-based evolutionary multi-objective optimisation', Swarm and Evolutionary Computation, vol. 89, 101641. https://doi.org/10.1016/j.swevo.2024.101641 Xiang, Y, Huang, H, Li, S, Li, M, Luo, C & Yang, X 2024, 'Automated test suite generation for software product lines based on quality-diversity optimisation', ACM Transactions on Software Engineering and Methodology, vol. 33, no. 2, 46, pp. 1–52. https://doi.org/10.1145/3628158 Conference contribution Ye, Y, Chen, T & Li, M 2025, Distilled Lifelong Self-Adaptation for Configurable Systems. in 2025 IEEE/ACM 47th International Conference on Software Engineering (ICSE). Proceedings - International Conference on Software Engineering, IEEE, pp. 1333-1345, 47th International Conference on Software Engineering, Ottowa, Ontario, Canada, 26/04/25. https://doi.org/10.1109/ICSE55347.2025.00094 Zhang, Q, Li, M, Tang, K & Yao, X 2025, When is non-deteriorating population update in MOEAs beneficial? in H Singh, T Ray, J Knowles, X Li, J Branke, B Wang & A Oyama (eds), Evolutionary Multi-Criterion Optimization: 13th International Conference, EMO 2025, Canberra, ACT, Australia, March 4–7, 2025, Proceedings, Part I. 1 edn, Lecture Notes in Computer Science, vol. 15512, Springer, pp. 31-45, 13th International Conference on Evolutionary Multi-Criterion Optimization , Canberra, Australia, 4/03/25. https://doi.org/10.1007/978-981-96-3538-2_3 Cui, Z, Liang, Z, Pang, LM, Ishibuchi, H & Li, M 2025, When to Truncate the Archive? On the Effect of the Truncation Frequency in Multi-Objective Optimisation. in GECCO '25: Proceedings of the Genetic and Evolutionary Computation Conference. Association for Computing Machinery (ACM), The Genetic and Evolutionary Computation Conference 2025, Málaga, Spain, 14/07/25. Ren, S, Bian, C, Li, M & Qian, C 2024, A first running time analysis of the strength Pareto evolutionary algorithm 2 (SPEA2). in Parallel Problem Solving from Nature – PPSN XVIII. Lecture Notes in Computer Science, Springer, 18th International Conference on Parallel Problem Solving From Nature PPSN 2024, Hagenberg, Austria, 14/09/24. Bian, C, Ren, S, Li, M & Qian, C 2024, An archive can bring provable speed-ups in multi-objective evolutionary algorithms. in K Larson (ed.), IJCAI '24: Proceedings of the Thirty-Third International Joint Conference on Artificial Intelligence., 763, Proceedings of the International Joint Conference on Artificial Intelligence, Association for Computing Machinery (ACM), pp. 6905-6913, 33rd International Joint Conference on Artificial Intelligence, Jeju, Korea, Republic of, 3/08/24. https://doi.org/10.24963/ijcai.2024/763 Li, M, Han, X, Chun, X & Liang, Z 2024, Empirical Comparison between MOEAs and Local Search on Multi-Objective Combinatorial Optimisation Problems. in GECCO '24: Proceedings of the Genetic and Evolutionary Computation Conference. Association for Computing Machinery (ACM), pp. 547-556, GECCO '24: Genetic and Evolutionary Computation Conference, Melbourne, Victoria, Australia, 14/07/24. https://doi.org/10.1145/3638529.3654077 Paper Tan, Z, Yuan, B, Wang, H & Li, M 2024, 'A new step size update strategy for CMA-ES in multi-objective optimisation', Paper presented at Biennial International Conference on Artificial Evolution, Talence, France, 29/10/24 - 31/10/24. View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7485,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:33"
}