{
  "name": "Miran Kim",
  "homepage": "https://k-miran.github.io",
  "status": "success",
  "content": "Miran Kim - Homepage Miran Kim Hanyang University Seoul, Korea Email Google Scholar I am an Associate Professor in the Department of Mathematics at Hanyang University and hold an affiliated faculty position at the Department of Computer Science at Hanyang University. My research mainly focuses on Privacy-Enhancing Cryptography (PEC), which aims to develop advanced cryptographic primitives to protect sensitive data of individuals. In particular, I have been actively working on the development of homomorphic encryption, which enables to compute any function on encrypted data without decryption. Also, I have been working on privacy-preserving protocols in a wide range of applications such as data query processing, genomic analysis, and machine learning. Advertisement Positions are available for postdocs, graduate students, and interns (junior or senior student) in areas in security, privacy, and deep learning. If you are interested in applying for a position, please send an email to me. 🔥 News Our team received the Grand Prize at the 2025 National Cryptographic Technology Contest, organized by the National Intelligence Service of Korea. [URL] Our paper “Empowering AI with Homomorphic Encryption for Secure Deep Reinforcement Learning” will appear in Nature Machine Intelligence. Our paper “THOR: Secure Transformer Inference with Homomorphic Encryption” was accepted to ACM CCS! Our paper “Provably Secure Approximate Computation Protocols from CKKS” has been appeared in Cryptology ePrint Archive. Our paper “More Efficient Lattice-based OLE from Circuit-private Linear HE with Polynomial Overhead” has been appeared in Cryptology ePrint Archive. 📖 Publications THOR: Secure Transformer Inference with Homomorphic Encryption [pdf] [slide] Jungho Moon, Dongwoo Yoo, Xiaoqian Jiang, Miran Kim Proceedings of the ACM SIGSAC Conference on Computer and Communications Security (CCS), 2025. Descriptor: Benchmarking Secure Neural Network Evaluation Methods for Protein Sequence Classification (iDASH24) [pdf] Arif Ozgun Harmanci, Luyao Chen, Miran Kim, Xiaoqian Jiang IEEE Data Descriptions, 2024 Finding Highly Similar Regions of Genomic Sequences Through Homomorphic Encryption [pdf] Magsarjav Bataa, Siwoo Song, Kunsoo Park, Miran Kim, Jung Hee Cheon, Sun Kim JOURNAL OF COMPUTATIONAL BIOLOGY, 2024 Accelerating HE Operations from Key Decomposition Technique [pdf] [code] Miran Kim, Dongwon Lee, Jinyeong Seo, Yongsoo Song Advances in Cryptology – CRYPTO, 2023 COLLAGENE enables privacy-aware federated and collaborative genomic data analysis [pdf] [code] Wentao Li, Miran Kim, Kai Zhang, Han Chen, Xiaoqian Jiang, Arif Ozgun Harmanci Genome Biology; 2023. Secure Human Action Recognition by Encrypted Neural Network Inference [pdf] [code] Miran Kim, Xiaoqian Jiang, Kristin Lauter, Elkhan Ismayilzada, Shayan Shams Nature Communications; 13(1), 1-13, 2022. Privacy-aware Estimation of Relatedness in Admixed Populations [pdf] Su Wang, Miran Kim, Wentao Li, Xiaoqian Jiang, Han Chen, Arif Harmanci Briefings in Bioinformatics; 23(6), 1-16, 2022. The Evolving Privacy and Security Concerns for Genomic Data Analysis and Sharing as Observed from the iDASH Competition [pdf] Tsung-Ting Kuo, Xiaoqian Jiang, Haixu Tang, XiaoFeng Wang, Arif Harmanci, Miran Kim, Kai Post, Diyue Bu, Tyler Bath, Jihoon Kim, Weijie Liu, Hongbo Chen, Lucila Ohno-Machado Journal of the American Medical Informatics Association; 29(12), 2182-2190, 2022. Evaluation of Vicinity-based Hidden Markov Models for Genotype Imputation [pdf] Su Wang, Miran Kim, Xiaoqian Jiang, Arif O. Harmanci BMC Bioinformatics; 23(356), 1-26, 2022. SVAT: Secure Outsourcing of Variant Annotation and Genotype Aggregation [pdf] [code] Miran Kim, Su Wang, Xiaoqian Jiang, Arif O. Harmanci BMC Bioinformatics; 23(409), 1-39, 2022. Trusted Monitoring Service [pdf] Xiaoqian Jiang, Miran Kim, Kristin Lauter, Tim Scott, Shayan Shams Protecting Privacy through Homomorphic Encryption; 87-95, Springer, Cham, 2022. Introduction to Homomorphic Encryption and Schemes [pdf] Jung Hee Cheon, Anamaria Costache, Radames Cruz Moreno, Wei Dai, Nicolas Gama, Mariya Geogieva, Shai Halevi, Miran Kim, Sunwoong Kim, Kim Laine, Yuriy Polyakov, Yongsoo Song Protecting Privacy through Homomorphic Encryption; 3-28, Springer, Cham, 2022. Ultra-Fast Homomorphic Encryption Models enable Secure Outsourcing of Genotype Imputation [pdf] [code] Miran Kim, Arif Harmanci, Jean-Philippe Bossuat, Sergiu Carpov, Jung Hee Cheon, Ilaria Chillotti, Wonhee Cho, David Froelicher, Nicolas Gama, Mariya Georgieva, Seungwan Hong, Jean-Pierre Hubaux, Duhyeong Kim, Kristin Lauter, Yiping Ma, Lucila Ohno-Machado, Heidi Sofia, Yongha Son, Yongsoo Song, Juan Troncoso-Pastoriza, Xiaoqian Jiang Cell Systems; 12(10), 950-952, 2021. (IF:11.091) Efficient Homomorphic Conversion Between (Ring) LWE Ciphertexts [pdf] Hao Chen, Wei Dai, Miran Kim, Yongsoo Song Proceedings of the International Conference on Applied Cryptography and Network Security (ACNS), 2021. Open Imputation Server Provides Secure Imputation Services with Provable Genomic Privacy [pdf] Arif O. Harmanci, Miran Kim, Su Wang, Wentao Li, Yongsoo Song, Kristin Lauter, Xiaoqian Jiang biorXiv:2021.09.30.462262. 2021. Maliciously Secure Matrix Multiplication with Applications to Private Deep Learning [pdf] Hao Chen, Miran Kim, Ilya Razenshteyn, Dragos Rotaru, Yongsoo Song, Sameer Wagh Advances in Cryptology – ASIACRYPT, 2020. Homomorphic Computation of Local Alignment [pdf] Magsarjav Bataa, Siwoo Song, Kunsoo Park, Miran Kim, Jung Hee Cheon, and Sun Kim. Proceedings of the IEEE International Conference on Bioinformatics and Biomedicine (BIBM), 2020. A Secure System for Genomics Clinical Decision Support [pdf] Seemeen Karimi, Xiaoqian Jiang, Robert Dolin, Miran Kim, Aziz Boxwala Journal of Biomedical Informatics; 112, 2020. Semi-Parallel Logistic Regression for GWAS on Encrypted Data [pdf] Miran Kim, Yongsoo Song, Baiyu Li, Daniele Micciancio BMC Medical Genomics; 13(7):1-13, 2020. SCOR: A secure international informatics infrastructure to investigate COVID-19 [pdf] J L Raisaro, Francesco Marino, Juan Troncoso-Pastoriza, Raphaelle Beau-Lejdstrom, Riccardo Bellazzi, Robert Murphy, Elmer V Bernstam, Henry Wang, Mauro Bucalo, Yong Chen, Assaf Gottlieb, Arif Harmanci, Miran Kim, Yejin Kim, Jeffrey Klann, Catherine Klersy, Bradley A Malin, Marie Méan, Fabian Prasser, Luigia Scudeller, Ali Torkamani, Julien Vaucher, Mamta Puppala, Stephen T C Wong, Milana Frenkel-Morgenstern, Hua Xu, Baba Maiyaki Musa, Abdulrazaq G Habib, Trevor Cohen, Adam Wilcox, Hamisu M Salihu, Heidi Sofia, Xiaoqian Jiang, Jean-Pierre Hubaux Journal of the American Medical Informatics Association (JAMIA); ocaa172, 2020. Secure and Differentially Private Bayesian Learning on Distributed Data [pdf] Yeongjae Gil, Xiaoqian Jiang, Miran Kim, Junghye Lee arXiv:2005.11007. (2020). Efficient Multi-Key Homomorphic Encryption with Packed Ciphertexts with Application to Oblivious Neural Network Inference [pdf] Hao Chen, Wei Dai, Miran Kim, Yongsoo Song Proceedings of the ACM SIGSAC Conference on Computer and Communications Security (CCS), 2019. Secure and Differentially Private Logistic Regression for Horizontally Distributed Data [pdf] Miran Kim, Junghye Lee, Lucila Ohno-Machado, Xiaoqian Jiang IEEE Transactions on Information Forensics and Security (TIFS); 15(1):695-710, 2019. SecureLR: Secure Logistic Regression Model via a Hybrid Cryptographic Protocol [pdf] Yichen Jiang, Jenny Hamer, Chenghong Wang, Xiaoqian Jiang, Miran Kim, Yongsoo Song, Yuhou Xia, Noman Mohammed, Md Nazmus Sadat, Shuang Wang IEEE/ACM Transactions on Computational Biology and Bioinformatics; 16(1):113-123, 2019. Secure Outsourced Matrix Computation and Application to Neural Networks [pdf] [code] Xiaoqian Jiang, Miran Kim, Kristin Lauter, Yongsoo Song Proceedings of the ACM SIGSAC Conference on Computer and Communications Security (CCS), 2018. A Full RNS Variant of Approximate Homomorphic Encryption [pdf] [code] Jung Hee Cheon, Kyoohyung Han, Andrey Kim, Miran Kim, Yongsoo Song Proceedings of the International Conference on Selected Areas in Cryptography (SAC), 2018. Bootstrapping for Approximate Homomorphic Encryption [pdf] [code] Jung Hee Cheon, Kyoohyung Han, Andrey Kim, Miran Kim, Yongsoo Song Advances in Cryptology – EUROCRYPT, 2018 Logistic Regression Model Training based on the Approximate Homomorphic Encryption [pdf] [code] Andrey Kim, Yongsoo Song, Miran Kim, Kiwoo Lee, Jung Hee Cheon BMC Medical Genomics; 11(Suppl 4):83, 2018. Secure Logistic Regression Based on Homomorphic Encryption: Design and Evaluation [pdf] [code] Miran Kim, Yongsoo Song, Shuang Wang, Yuhou Xia, Xiaoqian Jiang JMIR Medical Informatics; 6(2), 2018. Homomorphic Encryption for Arithmetic of Approximate Numbers [pdf] [code] Jung Hee Cheon, Andrey Kim, Miran Kim, Yongsoo Song Advances in Cryptology – ASIACRYPT, 2017. A Standard API FOR RLWE-based Homomorphic Encryption [pdf] Michael Brenner, Wei Dai, Shai Halevi, Kyoohyung Han, Amir Jalali, Miran Kim, Kim Laine, Alex Malozemoff, Pascal Paillier, Yuriy Polyakov, Kurt Rohloff, Erkay Savas, Berk Sunar Draft Homomorphic Encryption Standard, available at HomomorphicEncryption.org. 2017. Secure Searching of Biomarkers Using Hybrid Homomorphic Encryption Scheme [pdf] [code] Miran Kim, Yongsoo Song, Jung Hee Cheon BMC Medical Genomics; 10(42), 2017. Encrypting Controller using Fully Homomorphic Encryption for Security of Cyber-Physical Systems [pdf] Junsoo Kim, Chanhwa Lee, Hyungboo Shim, Jung Hee Cheon, Andrey Kim, Miran Kim, Yongsoo Song Proceedings of the IFAC Workshop on Distributed Estimation and Control in Networked Systems (NECSYS), 2016. Optimized Search-and-Compute Circuits and Their Application to Query Evaluation on Encrypted Data [pdf] Jung Hee Cheon, Miran Kim, Myungsun Kim IEEE Transactions on Information Forensics and Security (TIFS); 11(1):188–199, 2016. HEALER: Homomorphic computation of ExAct Logistic rEgRession for secure rare disease variants analys",
  "content_length": 12824,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:34"
}