{
  "name": "Mircea Lungu",
  "homepage": "https://pure.itu.dk/portal/da/persons/mircea-lungu(02960d47-7677-4b2c-99d4-490a31fd6885).html",
  "status": "success",
  "content": "Mircea Lungu - IT-Universitetet i København Mircea Lungu Lektor, Software EngineeringSoftware Engineering https://orcid.org/0000-0003-3944-5261 E-mailmlunitudk 20182024 Publikationer pr. år Personlig profil EmneordSoftware EngineeringSoftware EcosystemsEducationSoftware Architecture Fingeraftryk Dyk ned i forskningsemnerne, hvor Mircea Lungu er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 4 Lignende profiler Software Systems Computer Science 100% Software System Keyphrases 60% Software Engineering Computer Science 56% Virtual Reality Computer Science 52% Visualization Tool Computer Science 40% Technical Debt Keyphrases 34% Technical Debt Management Keyphrases 34% Systematic Literature Review Keyphrases 34% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Publikation Publikationer pr. år 2018 2019 2020 2021 2022 2023 2024 2024 15 Konferencebidrag i proceedings 2 Tidsskriftartikel 1 Konferenceabstrakt til konference Publikationer pr. år Publikationer pr. år Collaborative Software Exploration with Multimedia Note Taking in Virtual RealityHoff, A., Lungu, M., Seidl, C. & Lanza, M., 15 apr. 2024, 32nd IEEE/ACM International Conference on Program Comprehension (ICPC ’24). s. 346-357 12 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Fil Collaboration Tools 100% Virtual Reality 100% Multimedia 100% Software Exploration 100% Groupware 100% Immersive Software Archaeology: Collaborative Exploration and Note Taking in Virtual RealityHoff, A., Lungu, M., Seidl, C. & Lanza, M., 15 apr. 2024, 32nd IEEE/ACM International Conference on Program Comprehension (ICPC ’24). s. 387-391 Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Fil Virtual Reality 100% Note-taking 100% Software Systems 66% Source Codes 33% Visualization Tool 33% Challenges and Opportunities of Using Redirection of Activity for Self-Regulation OnlineInie, N., Westh, B. H., Muller, J. H. & Lungu, M., apr. 2023, CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, s. 1-19 Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Fil Redirection 100% Self-regulation 100% User Experience 100% Online Platform 100% Browser Extension 100% Live Is Life: Teaching Software Engineering on Live SystemsPfeiffer, H., Lungu, M. & Tell, P., 5 sep. 2023, I: I E E E Software. 40, 6, s. 117-125 8 s.Publikation: Artikel i tidsskrift og konference artikel i tidsskrift › Tidsskriftartikel › Forskning › peer review Åben adgangFil Software System 100% Project Work 100% Software Evolution 100% Student Projects 100% DevOps 100% Preparing Software Re-Engineering via Freehand Sketches in Virtual RealityHoff, A., Seidl, C., Lungu, M. & Lanza, M., 2023, 39th IEEE International Conference on Software Maintenance and Evolution: ICSME 2023. IEEEPublikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Fil Software Reengineering 100% Virtual Reality 100% Freehand Sketch 100% Software Systems 100% Source Codes 100% Se alle 18 publikationer Projekter Projekter pr. år 2020 2020 2023 2026 1 Afsluttet 1 Igangværende Projekter pr. år ISA: Immersive Software Archaeology – Guided Exploration of Legacy Systems in 3D Virtual RealitySeidl, C. (PI), Lungu, M. (CoI) & Hoff, A. (CoI)Danmarks Frie Forskningsfond01/07/2020 → 30/06/2024Projekter: Projekt › Forskning Virtual Reality 100% Software Systems 68% Immersive 54% Software Archeology 50% Legacy Systems 50% HPL-PATHS: Hyper-Personalized Learning Paths Through the Internet: A Sustainable Approach To Accelerating Language EducationLungu, M. (PI), Ribeiro, T. (CoI) & Waclaska, I. (CoI)Villum Fonden13/11/2023 → 31/01/2026Projekter: Projekt › Forskning Personal Learning Paths 100% Sustainable Approach 100% Language Education 100% Human-computer Interaction 100% HyPer 100% Presse/medier To nye bestyrelsesmedlemmer på ITULungu, M.01/11/2023 → 03/11/20232 MediebidragPresse/medie Tech-iværksætter og professor træder ind i bestyrelsen på ITULungu, M.31/08/20231 MediebidragPresse/medie ITU udpeger to ny eksterne bestyrelsesmedlemmerLungu, M.30/08/20231 MediebidragPresse/medie PRM / Her er IT-Universitetets to nye eksterne bestyrelsesmedlemmerLungu, M.30/08/20231 MediebidragPresse/medie Nyt bestyrelsesmedlem på ITULungu, M.22/04/20211 MediebidragPresse/medie Se alle 6 presse/medier",
  "content_length": 4952,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:36"
}