{
  "name": "Mircea Nicolescu",
  "homepage": "https://www.cse.unr.edu/~mircea",
  "status": "success",
  "content": "Mircea Nicolescu Mircea Nicolescu Professor Department of Computer Science and Engineering University of Nevada, Reno Reno, NV 89557 Email: mircea@unr.edu Phone: (775) 784-4356 Curriculum Vitae Publications Research Teaching Students Computer Vision Lab I am a Professor in the Department of Computer Science and Engineering at the University of Nevada, Reno. I have a Ph.D. in Computer Science (2003) from the University of Southern California, M.S. in Computer Science (1999) from the University of Southern California and B.S. in Computer Science (1995) from the Polytechnic University Bucharest (Romania). I am also co-director of the Computer Vision Laboratory. My research interests are in the area of computer vision, with a particular focus on video content understanding. At a general level, I am interested in building efficient and reliable methods for structure inference from image sequences. Based on such capabilities, I target the development of higher-level, application-oriented systems for specific real-world problems, particularly in the areas of surveillance, robotic vision and human-computer interaction. Automated surveillance systems require accurate scene segmentation, target detection and tracking, and reliable event understanding. I am particularly interested in addressing the difficult issues of robust tracking of multiple and possibly overlapping targets in the presence of occlusion, cooperation between multiple cameras, and scenario recognition based on detected trajectories. In the area of robot vision, I am interested in developing systems that allow for autonomous navigation through complex and dynamic environments, and for object detection and manipulation. Such systems must have the ability to recover ego-motion, infer 3-D shape from motion, and recognize objects of interest in a cluttered scene. A central issue is developing robust methods for incremental structure inference, by continuously refining the description as new images are acquired. Another direction of research is in the area of human-computer interaction. In this context I am interested in addressing the problem of non-rigid and articulated motion, in order to provide appropriate models for applications such as lip reading, face, gesture and expression recognition. Created by: Mircea NICOLESCU (email: mircea@unr.edu)",
  "content_length": 2340,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:35"
}