{
  "name": "Mirco Giacobbe",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/giacobbe-mirco.aspx",
  "status": "success",
  "content": "Dr Mirco Giacobbe - School of Computer Science - University of Birmingham Dr Mirco Giacobbe PhD School of Computer ScienceLecturer in Computer Science Contact details Emailm.giacobbe@bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Mirco Giacobbe is a Lecturer in Computer Science in the Theory of Computation group. His research interests lie between formal methods and artificial intelligence. He designs methods for the safety assurance of algorithmic systems with application to software, cyber-physical systems, and deep learning systems. PhD in Computer Science, Institute of Science and Technology Austria, 2019 Computer-aided Verification Recent publications Chapter Abate, A, Giacobbe, M, Roy, D & Schnitzer, Y 2024, Model Checking and Strategy Synthesis with Abstractions and Certificates. in N Jansen, S Junges, BL Kaminski, C Matheja, T Noll, T Quatmann, M Stoelinga & M Volk (eds), Principles of Verification: Cycling the Probabilistic Landscape: Essays Dedicated to Joost-Pieter Katoen on the Occasion of His 60th Birthday, Part II. Lecture Notes in Computer Science, vol. 15261, Springer, pp. 360-391. https://doi.org/10.1007/978-3-031-75775-4_16 Conference contribution Abate, A, Giacobbe, M, Micheletti, C & Schnitzer, Y 2025, Branching Bisimulation Learning. in R Piskac & Z Rakamaric (eds), Computer Aided Verification: 37th International Conference, CAV 2025, Zagreb, Croatia, July 23-25, 2025, Proceedings, Part IV. 1 edn, Lecture Notes in Computer Science, vol. 15934, Springer, pp. 161-184, 37th International Conference on Computer Aided Verification, CAV 2025, Zagreb, Croatia, 23/07/25. https://doi.org/10.1007/978-3-031-98685-7_8 Robbins, S, Giacobbe, M & Stella, L 2025, Feedback-evolving Mean-field Games. in 2025 IEEE 64th Conference on Decision and Control (CDC). IEEE Conference on Decision and Control, IEEE, 2025 IEEE 64th Conference on Decision and Control, Rio de Janeiro, Brazil, 10/12/25. Giacobbe, M, Kroening, D, Pal, A & Tautschnig, M 2025, Let a Neural Network Be Your Invariant. in Advances in Neural Information Processing Systems 39 (NeurIPS 2025) . Advances in Neural Information Processing Systems, vol. 39, NeurIPS, The Thirty-Ninth Annual Conference on Neural Information Processing Systems, San Diego, California, United States, 2/12/25. Neustroev, G, Giacobbe, M & Lukina, A 2025, Neural Continuous-Time Supermartingale Certificates. in T Walsh, J Shah & Z Kolter (eds), AAAI-25 Special Track on AI Alignment. Proceedings of the AAAI Conference on Artificial Intelligence, no. 26, vol. 39, Association for the Advancement of Artificial Intelligence, pp. 27538-27546, 39th Annual AAAI Conference on Artificial Intelligence, AAAI 2025, Philadelphia, United States, 25/02/25. https://doi.org/10.1609/aaai.v39i26.34966 Abate, A, Giacobbe, M & Roy, D 2025, Quantitative Supermartingale Certificates. in R Piskac & Z Rakamaric (eds), Computer Aided Verification: 37th International Conference, CAV 2025, Zagreb, Croatia, July 23-25, 2025, Proceedings, Part II. 1 edn, Lecture Notes in Computer Science, vol. 15932, Springer, pp. 3-28, 37th International Conference on Computer Aided Verification, CAV 2025, Zagreb, Croatia, 23/07/25. https://doi.org/10.1007/978-3-031-98679-6_1 Abate, A, Giacobbe, M & Schnitzer, Y 2024, Bisimulation Learning. in A Gurfinkel & V Ganesh (eds), Computer Aided Verification: 36th International Conference, CAV 2024, Montreal, QC, Canada, July 24–27, 2024, Proceedings, Part III. 1 edn, Lecture Notes in Computer Science, vol. 14683, Springer, pp. 161-183, 36th International Conference on Computer Aided Verification, CAV 2024, Montreal, Canada, 24/07/24. https://doi.org/10.1007/978-3-031-65633-0_8 Giacobbe, M, Kroening, D, Pal, A & Tautschnig, M 2024, Neural Model Checking. in Advances in Neural Information Processing Systems 38 (NeurIPS 2024). Advances in neural information processing systems, NeurIPS, Thirty-Eighth Annual Conference on Neural Information Processing Systems, Vancouver, British Columbia, Canada, 10/12/24. Abate, A, Giacobbe, M & Roy, D 2024, Stochastic Omega-Regular Verification and Control with Supermartingales. in A Gurfinkel & V Ganesh (eds), Computer Aided Verification: 36th International Conference, CAV 2024, Montreal, QC, Canada, July 24–27, 2024, Proceedings, Part III. 1 edn, Lecture Notes in Computer Science, vol. 14683, Springer, pp. 395-419, 36th International Conference on Computer Aided Verification, CAV 2024, Montreal, Canada, 24/07/24. https://doi.org/10.1007/978-3-031-65633-0_18 Edwards, A, Giacobbe, M & Abate, A 2023, On the Trade-Off Between Efficiency and Precision of Neural Abstraction. in N Jansen & M Tribastone (eds), Quantitative Evaluation of Systems: 20th International Conference, QEST 2023, Antwerp, Belgium, September 20–22, 2023, Proceedings. 1 edn, Lecture Notes in Computer Science, vol. 14287, Springer, pp. 152–171, 20th International Conference on Quantitative Evaluation of SysTems (QEST), Antwerp, Belgium, 20/09/23. https://doi.org/10.1007/978-3-031-43835-6_12 Abate, A, Edwards, A, Giacobbe, M, Punchihewa, H & Roy, D 2023, Quantitative Verification with Neural Networks. in G Pérez & J-F Raskin (eds), 34th International Conference on Concurrency Theory: CONCUR 2023, September 18–23, 2023, Antwerp, Belgium. Leibniz International Proceedings in Informatics, vol. 279, Schloss Dagstuhl - Leibniz-Zentrum für Informatik , Dagstuhl, pp. 22:1-22:18, 34th International Conference on Concurrency Theory, Antwerp, Belgium, 18/09/23. https://doi.org/10.4230/LIPIcs.CONCUR.2023.22 Abate, A, Edwards, A & Giacobbe, M 2022, Neural Abstractions. in S Koyejo, S Mohamed, A Agarwal, D Belgrave , K Cho & A Oh (eds), Advances in Neural Information Processing Systems 35 (NeurIPS 2022). Advances in neural information processing systems, vol. 35, NeurIPS, 36th Conference on Neural Information Processing Systems (NeurIPS 2022), New Orleans, Louisiana, United States, 28/11/22. <https://proceedings.neurips.cc/paper_files/paper/2022/hash/a922b7121007768f78f770c404415375-Abstract-Conference.html> Giacobbe, M, Kroening, D & Parsert, J 2022, Neural termination analysis. in A Roychoudhury, C Cadar & M Kim (eds), Proceedings of the 30th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering. Association for Computing Machinery , pp. 633-645, 30th ACM Joint Meeting European Software Engineering Conference and Symposium on the Foundations of Software Engineering, ESEC/FSE 2022, Singapore, Singapore, 14/11/22. https://doi.org/10.1145/3540250.3549120 Preprint Abate, A, Giacobbe, M & Schnitzer, Y 2024 'Bisimulation Learning' arXiv. https://doi.org/10.48550/arXiv.2405.15723 Abate, A, Giacobbe, M & Roy, D 2024 'Stochastic Omega-Regular Verification and Control with Supermartingales' arXiv. https://doi.org/10.48550/arXiv.2405.17304 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7063,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:36"
}