{
  "name": "Mireilla Bikanga Ada",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/mireillabikangaada",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Mireilla Bikanga Ada Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Mireilla Bikanga AdaMr Ethan KellyZhen Tian Dr Mireilla Bikanga Ada Senior Lecturer (Computing Science) telephone: 01413302830 email: Mireilla.BikangaAda@glasgow.ac.uk Import to contacts https://orcid.org/0000-0001-5406-6935 Biography I am a Lecturer in the School of Computing Science at the University of Glasgow, where I have worked since September 2018, and a member of the Education and Practice (EAP) research section. I lead on student transition within the School, with a focus on supporting students entering through diverse pathways and enhancing their academic and social integration. Prior to joining the University of Glasgow, I held Lecturer posts at INTO Glasgow Caledonian University (January–August 2018) and Glasgow Clyde College (2014–2018), where I taught Computing and supported international and college learners. My academic background is interdisciplinary. I completed a PhD at the University of the West of Scotland, where my research focused on feedback delivery methods, particularly the use of mobile technology to support assessment feedback in higher education. Research interests Student transition Postgraduate education Educational technology MSc supervision and marking Learning analytics and big data in CS education Assessment and feedback Identify students at risk: using students’ affective state as a measure of risk Active learning in CS education: Flipped classroom, modified Team-Based Learning Game-based Learning in CS Research groupsEducation & Practice Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2014 | 2013Number of items: 37.2025 Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2025) “It was horrible!” Understanding the transition experiences of direct Year 2 entry students in computer science. Trends in Higher Education, 4(4), 57. (doi: 10.3390/higheredu4040057) Alyahyan, Eyman, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) Adoption, Usage, and Perceptions of LLM-Generated Feedback in Computer Science Education: A Cross-Cultural Study of Students and Academics. In: 2025 Frontiers in Education Conference (FIE 2025), Nashville, Tennessee, 02-05 November 2025, (Accepted for Publication) Alyahyan, Eyman, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) Comparing Feedback Practices in Higher Education: Perspectives from Academics and Students in the UK and Saudi Arabia. In: 2025 Frontiers in Education Conference (FIE 2025), Nashville, Tennessee, 02-05 November 2025, (Accepted for Publication) Alyahyan, Eyman, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) WIP: A Pedagogical Prompt Engineering Framework for LLM-Based Feedback in Higher Education (PPE-LLM). In: 2025 Frontiers in Education Conference (FIE 2025), Nashville, Tennessee, 02-05 November 2025, (Accepted for Publication) Alyahyan, Eyman, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) A Systematic Mapping of Large Language Models as Feedback provider in Higher Education. In: 25th IEEE International Conference on Advanced Learning Technologies (ICALT 2025), Changhua, Taiwan, 14-17 July 2025, (Accepted for Publication) 2024 Albakri, Sultanah Abdullah A, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Morrison, Alistair (2024) Applying Machine Learning Techniques on Self-Reported Engagement and Student Log Data to Predict CS Learning Performance. In: 2024 IEEE Frontiers in Education (FIE 2024), Washington DC, USA, 13-16 Oct 2024, ISBN 9798350351507 (doi: 10.1109/FIE61694.2024.10892846) Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2024) It helps with crap lecturers and their low effort: investigating computer science students’ perceptions of using ChatGPT for learning. Education Sciences, 14(10), 1106. (doi: 10.3390/educsci14101106) Ayranci, Talha Enes ORCID: https://orcid.org/0000-0002-8425-6390, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Grizou, Jonathan ORCID: https://orcid.org/0000-0002-2211-4389 (2024) Curio: An Affordable Web-Based Educational Platform. In: 24th IEEE International Conference on Advanced Learning Technologies, Nicosia, North Cyprus, 01-04 Jul 2024, pp. 39-40. ISBN 9798350362053 (doi: 10.1109/ICALT61570.2024.00017) Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2024) Exploring the Potential of ePortfolios to Support Transition among International Students and Second-Year Entrants in Higher Education. In: 24th IEEE International Conference on Advanced Learning Technologies (ICALT 2024), North Nicosia, North Cyprus, 01-04 Jul 2024, ISBN 9798350362053 (doi: 10.1109/ICALT61570.2024.00085) Alasmari, Ohud Abdullah F., Singer, Jeremy ORCID: https://orcid.org/0000-0001-9462-6802 and Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2024) Online Coding Tutorial Systems: A New Category of Programming Learning Platforms. In: 2024 IEEE 48th Annual Computers, Software, and Applications Conference (COMPSAC), Osaka, Japan, 02-04 July 2024, pp. 2222-2227. ISBN 9798350376968 (doi: 10.1109/compsac61105.2024.00356) Alasmari, Ohud Abdullah F., Singer, Jeremy ORCID: https://orcid.org/0000-0001-9462-6802 and Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2024) Python OCTS: Design, Implementation, and Evaluation of an Online Coding Tutorial System Prototype. In: 2024 IEEE World Engineering Education Conference (EDUNINE), Guatemala City, Guatemala, 10-13 Mar 2024, ISBN 9798350348729 (doi: 10.1109/EDUNINE60625.2024.10500548) Alasmari, Ohud Abdullah, Singer, Jeremy ORCID: https://orcid.org/0000-0001-9462-6802 and Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2024) Do Current Online Coding Tutorial Systems Address Novice Programmer Difficulties? In: 15th International Conference on Education Technology and Computers (ICETC '23), Barcelona, Spain, 26-28 Sep 2023, pp. 242-248. ISBN 9798400709111 (doi: 10.1145/3629296.3629333) 2023 Al-Anqoudi, Maha, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935, McQuistin, Stephen ORCID: https://orcid.org/0000-0002-0616-2532, Ntarmos, Nikos ORCID: https://orcid.org/0000-0001-8676-0948, Parkinson, Jack ORCID: https://orcid.org/0000-0001-6175-7638 and Moshfeghi, Yashar (2023) Traditional Vs Non-Traditional Assessment Activities as Learning Indicators of Student Learning: Teachers’ Perceptions. In: 2023 IEEE Learning with MOOCS (LWMOOCS), Cambridge, MA, USA, 11-13 Oct 2023, ISBN 9798350315592 (doi: 10.1109/LWMOOCS58322.2023.10305928) Albakri, Sultanah Abdullah A., Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Morrison, Alistair (2023) The Roles of Confidence and Perceived Usefulness in Female Student Engagement in High School Computing Science. In: 18th WiPSCE Conference on Primary and Secondary Computing Education Research (WiPSCE 2023), Cambridge, England, 27-29 Sept 2023, ISBN 9798400708510 (doi: 10.1145/3605468.3605497) Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2023) Educators’ pre-Covid19 lived experience of the assessment and feedback policy at a UK higher education institution. Open Scholarship of Teaching and Learning, 2(3), (doi: 10.56230/osotl.10) Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2023) I Betrayed my Ethical Principles: Investigating Master’s Dissertation Marking Practices in CS. In: IEEE International Conference on Teaching, Assessment, and Learning for Engineering (TALE) 2022, Hong Kong, 4-7 December 2022, pp. 78-85. ISBN 9781665491174 (doi: 10.1109/TALE54877.2022.00021) Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Majid, Mohammad U. (2023) Developing a System to Increase Motivation and Engagement in Student Code Peer Review. In: IEEE International Conference on Teaching, Assessment, and Learning for Engineering (TALE) 2022, Hong Kong, 4-7 December 2022, pp. 93-98. ISBN 9781665491174 (doi: 10.1109/TALE54877.2022.00023) Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Foster, Mary Ellen ORCID: https://orcid.org/0000-0002-1228-7657 (2023) Enhancing postgraduate students’ technical skills: perceptions of modified team-based learning in a six-week multi-subject Bootcamp-style CS course. Computer Science Education, 33(2), pp. 186-210. (doi: 10.1080/08993408.2021.1959174) Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2023) Evaluation of a mobile web application for assessment feedback. Technology, Knowledge and Learning, 28(1), pp. 23-46. (doi: 10.1007/s10758-021-09575-6) (PMCID:PMC8580360) 2021 Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 (2021) Master's students' perceptions of final year project supervision: on-campus vs online. Open Scholarship of Teaching and Learning, 1(1), pp. 52-69. Bikanga Ada, Mireilla ORCID: h",
  "content_length": 30568,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:38"
}