{
  "name": "Mirela Alistar",
  "homepage": "http://www.personallab.org",
  "status": "success",
  "content": "Mirela alistar Mirela alistarAboutNewsApplyResearchTeachingOutreachArtArtMirela alistarAssistant Professor at ATLAS Institute and the Department of Computer Science, CU Boulderleading the Living Matter Labteaching Introduction to Biodesign and Physical Interaction with Living Matterserving as PC for CHI'19 LBW, and GLVSI'17 Biochips trackreviewing for TCAD, JETC, DATE, MJE, UIST, CHIadvising digi.bio and bold.health startupsco-founder and event organizer of >top - art & science project space in Berlin2015 - 2018 - Postdoc in the Human Computer Interaction lab of Patrick Baudisch at Hasso Plattner Institute2010 - 2014 - PhD student in the Embedded Systems Engineering lab (Paul Pop and Jan Madsen) at Technical University of Denmarkscholar | github | bioart | diybio | resume | email |NewsPositions open! We are looking for PhD students, postdoctoral fellows and other enthusiastic folks to join our lab and research with us. More information in the APPLY section. July'19: organized the Biochips workshop, CU Boulder, US [video]July'19: taught Introduction to Biodesign, TU Summer University, Germany [results]May'19: gave a talk at Johannes Kepler University, hosted by Robert Wille, AustriaMay'19: spoke at the BioCHIP conference, Germany [program]April'19: taught a one-week biotech class at Art & Design College Weissensee Berlin [pictures]March'19: my collaborative art piece Semina Aeternitatis (with Margherita Pevere) was exhibited at Kunsthalle Rostock [pictures] [video]March'19: taught a 3-days workshop on digital microfluidics in Bucharest, RomaniaMarch'19: organized and taught Culture and Colonies, at Ruine hq in Hannover, GermanyFeb'19: performed \"Secreted Functions\" with AslieMk, at >top in Berlin. GermanySept'18: spoke and gave a workshop in Ukraine, at the sRNABio meeting. Learn more: [talk] [workshop]Aug'18: had an art residency at the former tuberculosis hospital in Grabowsee and exhibited my work at Globe GalleryJul'18: my bio-dream interactive installation was shown at >top in Berlin, GermanyApplyPhd positions. We are looking for curious and ambitious candidates with backgrounds in one or more of the following areas:Computer Science and Engineering: [CAD tools] [MEMS] [ hardware design] [embedded systems]Biology: [microbiology] [synthetic biology] [bacteriophages] [E. coli] [cyanobacteria]Nanotechnology: [microfluidics] [lithography] [micro-dispensers] [dual-phase plugs] [SAW biochips]Art & Design: [bioart] [living matter] [interactive installations] [performances]If interested, please email your CV and a short introduction to learn more about you.ResearchVisionToday, diagnosis requires patients to see a doctor to provide samples, which are then sent to a wetlab, then reported back to the doctor and the patient. This process can take valuable time during which patients live in uncertainty and disease is allowed to spread. What if instead doctors could perform the tests while the patient waits? Or, what if we could empower patients to perform selected tests at home, to help them decide whether to see a doctor in the first place?In my work, I investigate how to ubiquitize healthcare by moving the process of diagnosis closer to the patient. I pursue this vision by creating cyber-physical systems based on biochips.Biochips manipulate droplets of fluids (e.g., split, merge, mix) in order to automate \"bio-protocols\", i.e., processes traditionally performed in wet labs, such as in-vitro diagnosis on a droplet of blood. Because biochips automate lab procedures, they have the potential to run biomedical protocols as if they were software.Personal biochipsFault-tolerant digital microfluidic biochipsPaul Pop, Mirela Alistar, Elena Stuart, Jan Madsen. Springer'16.[book] We identify the research challenges in the new area of digital microfluidic biochips, targeting researchers in the fields of compiler technology, design and test, and electronic design automation, and thus offering a new application area for their methods. We propose a routing-based model of operation execution, along with several associated compilation approaches, which progressively relax the assumption that operations execute inside fixed rectangular modules. Since operations can experience transient faults during the execution of a bioassay, we show how to use both offline (design time) and online (runtime) recovery strategies.==pdf==OpenDrop: an integrated do-it-yourself platform for personal use of biochipsMirela Alistar, Urs Gaudenz. Bioengineering'17.[journal paper] OpenDrop consists of a do-it-yourself biochip, an automated software tool with visual interface and a detailed technique for at-home operations of microfluidics. We address the main challenges that users may encounter: accessibility, bio-protocol design and interaction with microfluidics. Our work provides a step towards a future in which everyone will be able to use microfluidic devices for their personal applications.==pdf==Synthesis of application-specific fault-tolerant digital microfluidic biochip architecturesMirela Alistar, Paul Pop, Jan Madsen. TCAD'16.[journal paper] The current industrial trend is to produce biochips in the form of disposable cartridges, designed to execute specific bio-protocols. We propose the first methodology that automates the design of application-specific biochips, aiming at obtaining low-cost biochips, while maximizing fault-tolerance to fabrication defects.==pdf==Synthesis of biochemical applications on digital microfluidic biochips with operation execution time variabilityMirela Alistar, Paul Pop. Integration VLSI'15.[journal paper] Due to variability and randomness in biochemical reactions, droplet operations may finish earlier than expected. To exploit the resulted slack in the schedule, we implement a quasi-static compilation that takes advantage of both static and dynamic error recovery techniques. We determine offline a database of alternative implementations. During the execution of the bio-protocol, several implementations are selected based on the current execution scenario.==pdf==Redundancy optimization for error recovery in digital microfluidic biochipsMirela Alistar, Paul Pop, Jan Madsen. DAEM'15.[journal paper] So far, to simply the compilation problem, researchers have assumed an abstract droplet size of one electrode. We develop the first routing algorithm for biochips that considers the real size of droplets. Our work targets a novel biochip architecture based on Active Matrix Electrowetting on Dielectric, which enables large arrays (i.e., of thousands electrodes).==pdf==Towards droplet size-aware biochemical application compilation for AM-EWOD biochipsMirela Alistar, Paul Pop. DTIP'15.[conference paper] During the execution of a bio-protocol, transient faults can occur and alter the droplet volumes. We propose two error recovery approaches: (1) create the copy droplet sequentially, after the error is detected (i.e., time redundancy), or (2) create the copy droplet in parallel, before the error is detected (i.e., space redundancy). Because neither time nor space redundancy is better, we implement a decision algorithm that optimizes their tradeoff for the actual context.==pdf==Redundancy optimization for error recovery in digital microfluidic biochips Mirela Alistar, Paul Pop. ISIC'14. [conference paper] So far, droplet operations on biochips were scheduled considered an expected finish time. However, mixing and incubation of droplets depend on their chemical composition and may finish earlier than expected. We exploit the resulted slack in the schedule through an adaptive compilation strategy triggered at runtime, when operations experience variability in their execution time.==pdf== Operation placement for application-specific digital microfluidic biochips Mirela Alistar, Paul Pop. DTIP'13. [conference paper] We demonstrate that operations finish faster when the droplets are moved in closed circular paths. We implement a novel placement strategy for application-specific biochips (i.e., non-rectangular), based on circular-route modules.==pdf==Application-specific fault-tolerant architecture synthesis for digital microfluidic biochipsMirela Alistar, Paul Pop, Jan Madsen. ASPDAC'13.[conference paper] So far, biochips were considered to be of rectangular shape. However, in practice, non-regular architectures are common for application-specific biochips. We develop an algorithm that synthesizes application-specific biochips. Furthermore, our approach increases the fabrication yield by introducing redundant electrodes to tolerate fabrication defects.==pdf==Online synthesis for error recovery in digital microfluidic biochips with operation variabilityMirela Alistar, Paul Pop. DTIP'12. [conference paper] During the execution of a bio-protocol, the droplet volumes can vary erroneously due to parametric faults, thus impacting negatively the correctness of the application. We develop an adaptive algorithm that determines the appropriate recovery actions at the moment when faults are detected.==pdf==Synthesis of biochemical applications on digital microfluidic biochips with operation variabilityMirela Alistar, Paul Pop. DTIP'10.[conference paper] We propose an abstract model for a bio-protocol, consisting of a sequencing graph, which can capture all the fault scenarios in the application. We demonstrate that, by taking into account fault-occurrence information, we can derive better schedule implementations, which leads to shorter application completion times, even in the case of faults.==pdf==Other publicationsMetamaterial MechanismsAlexandra Ion, Johannes Frohnhofen, Mirela Alistar, Ludwig Wall, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, Patrick Baudisch. UIST'16. Honorable Mention Award.So far, metamaterials are understood as materials - we want to think of them as mechanisms. We demonstrate metamaterial objects that perform a mechanical function. Such objects consists of a single block of material made of microscopic cells that coordina",
  "content_length": 12912,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:37"
}