{
  "name": "Mirjana Stojilovic",
  "homepage": "https://mirjanastojilovic.github.io",
  "status": "success",
  "content": "Mirjana Stojilovic After graduating from the School of Electrical Engineering in Belgrade in 2006, I worked for five years as embedded systems developer at the Institute Mihailo Pupin in Belgrade. At the time, my research was closely linked to everyday issues I was facing when designing printed-circuit boards: signal integrity, transmission lines, antennas, RF amplifiers, and power plane resonances. In 2010 and 2011, I visited the Processor Architecture Laboratory (LAP) at EPFL, as part of the SNSF-SCOPES project “Advancing Embedded Systems Research in Serbia”. It was then that I started being interested in hardware acceleration using field-programmable gate arrays (FPGAs) and coarse-grain reconfigurable arrays (CGRAs). In 2013, I obtained a PhD degree at the School of Electrical Engineering in Belgrade with the thesis entitled \"A method for designing domain-specific reconfigurable arrays\". Beginning of 2013, I moved to Switzerland to pursue my research career by taking the post of a scientific collaborator at the University of Applied Sciences in Yverdon-les-Bains, where I worked on a European Union FP7-funded project STRUCTURES (Strategies for the Improvement of Critical Infrastructure Resilience to EM attacks). In October 2016, I joined the EPFL's School of Computer and Communication Sciences and the Parallel Systems Architecture Laboratory (PARSA) as a scientific assistant, where I continue building my career in research and teaching. Today, my research interests span the areas of field-programmable technology, electronic design automation (EDA) and, more recently, electrical-level attacks and countermeasures for reconfigurable hardware. In EDA space, I work on methods for designing domain-specific reconfigurable arrays, on hardware and software acceleration of VLSI and FPGA placement and routing, on machine-learning approaches for reducing the leakage power of FPGAs and on the analysis and design of FPGA routing architectures. I serve on the program committees of the FPGA, the FCCM, and the FPL conference, and review for IEEE TCAD, IEEE TVLSI, IEEE TC, IEEE TEMC, IEEE Access, IEEE TPDS, and ACM TRETS. I am a member of EcoCloud, the EPFL center for sustainable cloud computing. I am a mother of Djordje and Lucia. We love travelling the world, making friends, and enjoying good food and movies. Read More Research Group Publications Awards Committees and Editorial Boards Workshops and Tutorials Projects Teaching Research Group Current Students Shashwat Shrivastava : PhD student (started Fall 2021) Louis Coulon : PhD student (started Fall 2021, co-advised with Paolo Ienne) Dina Mahmoud : PhD student (started Fall 2019) David Dervishi : MSc student (Fall 2023) Past Students Ognjen Glamočanin : PhD student (Fall 2018–Summer 2023), currently Hardware engineer at Synthara AG Hajira Bazaz : Summer@EPFL intern (Summer 2022) Beatrice Shokry : Summer@EPFL intern (Summer 2022), currently PhD student at EPFL Arman Soleimani : Summer@EPFL intern (Summer 2022) David Spielmann : MSc student (Fall 2022–Spring 2023), currently PhD student at the Institute of Computer Science at the University of St. Gallen Samah Hussein : Summer@EPFL intern (Summer 2021), currently PhD student at EPFL Nour Ardo : Summer@EPFL intern (Summer 2022) Jinwei Yao : Summer@EPFL intern (Summer 2022) Hédi Fendri : MSc student (2019–2020), recipient of the Omega Student Award, currently Data scientist at Kudelski IoT Hamidreza Ramezani : Summer@EPFL intern (Summer 2019) Jacqueline Abalo : Summer@EPFL intern (Summer 2018) Dina G. Mahmoud : Summer@EPFL intern (Summer 2018) Radenko Pavlovic : Summer@EPFL intern (Summer 2018) Dario Korolija : MSc student (2017–2018), currently PhD student at ETHZ Mobin Yahyazadeh : Summer@EPFL intern (Summer 2017) Publications Google Scholar dblp e-prints Awards 2023, Best paper award nomination, the International Symposium on Design and Diagnostics of Electronic Circuits and Systems (DDECS) 2020, I supervised the Master's project of Hédi Féndri, titled \"ML-based side-channel analysis and disassembly of hardware Root-of-Trust\", carried out in collaboration with Kudelski Group. Hédi received the prestigious OMEGA Student Award, which honors the best Master's projects completed by students of the Microengineering Section of the EPFL. More... 2019, Best paper award nomination, the International Conference on Field Programmable Technology (FPT) 2016, Young scientist award, the International Conference on Lightning Protection (ICLP) 2016, Best paper award, the International Symposium and exhibition on electromagnetic compatibility (EMC Europe) 2015, Teaching Award, the EPFL School of Computer and Communication Sciences, for teaching excellence 2011, Blažo Mirčevski Young author best paper award, the 20th Telecommunication forum (TELFOR) Committees and Editorial Boards 2024, Program committee member, Design, Automation and Test in Europe (DATE), DT5 - Design and test of hardware security primitives 2023, Program committee member, Design, Automation and Test in Europe (DATE), D12 - Reconfigurable systems 2023, Topic chair - Secure HW and Embedded Systems, The International Symposium on Design and Diagnostics of Electronic Circuits and Systems (DDECS) 2023–, Associate Editor, ACM Transactions on Reconfigurable Technology and Systems (TRETS) 2022–, Associate Editor, IEEE Embedded Systems Letters (ESL) 2022, Program committee member, International Conference on Application-specific Systems, Architectures and Processors (ASAP) 2022, Track Chair - Architecture, Embedded and VLSI Design Conference (VLSID) 2021, Best paper award committee member, International Symposium on Field-Programmable Gate Arrays (FPGA) 2021–, Program committee member, International Symposium on Field-Programmable Gate Arrays (FPGA) 2020–2023, Program committee member, International Symposium on Field-Programmable Custom Computing Machines (FCCM) 2017–, Program committee member, International Conference on Field-Programmable Logic and Applications (FPL) 2016, PhD Forum and Demo-night chair, International Conference on Field-Programmable Logic and Applications (FPL) Workshops and Tutorials 2022, Tutorial co-organizer, Secure sharing of FPGAs in the Cloud: New challenges at the technology level, Design Automation Conference (DAC) 2022–2023, Co-organizer, 2nd Workshop on Security for Custom Computing Machines (SCCM). 2021, Hot-Topic Session Co-Organizer, \"When FPGA Turns Against You: Side-Channel and Fault Attacks in Shared FPGAs\", Design, Automation and Test in Europe (DATE) Projects 2020–, ADHeS: Attacks and defences on FPGA-CPU systems , supported by armasuisse Science and Technology 2018–, Secure FPGAs in the cloud , supported by the Swiss National Science Foundation 2017–, EDA for FPGAs Teaching Fundamentals of Digital Systems (2023–), CS-173, BA2 Computer Architecture I (2016–2022), IC, BA3 Information, Computation, Communication (ICC) (2016–2022), Mechanical Engineering, BA2 Information, Computation, Communication (ICC) (2013–2022), Chemistry and Chemical Engineering Engineering, BA2 Information, Computation, Communication (ICC) (2013–2022), Environmental Sciences and Engineering, BA2 System Programming Project (2018–19, 2019–20), IC, BA4 For more information on teaching, including the semester and Master's projects, please visit my EPFL web page.",
  "content_length": 7336,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:38"
}