{
  "name": "Miron Livny",
  "homepage": "http://pages.cs.wisc.edu/~miron",
  "status": "success",
  "content": "Home Page of Miron Livny Miron Livny Professor Computer Sciences Department University of Wisconsin 1210 W. Dayton St. Madison, WI 53706-1685 Telephone: (608) 262-0856 Fax: (608) 262-9777 Email: miron@cs.wisc.edu Ph.D., Weizmann Institute of Science, Rehovot, Israel, 1984 Interests: High Throughput Computing, Visual Data Exploration, Experiment Management Environments, and Performance Evaluation. Projects BMRB - Biological Magentic Resonance Data Bank HTCondor - High Throughput Computing DEVise - Visual Data Integration Compression Research Summary High throughput computing is a challenging research area in which a wide range of techniques is employed to harness the power of very large collections of computing resources over long time intervals. My group is engaged in research efforts to develop management and scheduling techniques that empower high throughput computing on local and wide area clusters of distributively owned resources. The results of these efforts are translated into production code and are incorporated into the Condor system. Condor is a widely used high throughput computing system. The worldwide user community of Condor plays an important and active role in our research. Researchers from a wide spectrum of scientific disciplines collaborate with us in the development and evaluation of Condor. In the area of visual exploration of information my group works on developing a framework and tools for intuitive graphical interaction with collections of multimedia data. Our framework is based on a declarative approach to the creation of active visual presentations of tabular data. We implement our tools in Java and work closely with domain scientists on testing and evaluating them with real data. Some of this data is stored in scientific databases that are connected to real-time and off-line data sources. Sample Recent Publications DEVise: Integrated Querying and Visual Exploration of Large Datasets. (M. Livny, R. Ramakrishnan, K. Beyer, G. Chen, D. Donjerkovic, S. Lawande, J. Myllymaki, and Kent Wenger) , Proc. 1997 ACM SIGMOD International Conference on Management of Data , May, 1997. Interfacing Condor and PVM to Harness the Cycles of Workstation Clusters, (J. Pruyne and M. Livny) , Journal on Future Generations of Computer Systems, Vol. 12, 1996. ZOO: A Desktop Experiment Management Environment, (Y. Ioannidis M. Livny and S. Gupta,) the 21st International VLDB Conference, September 1996. Relational Joins for Data on Tertiary Storage, (J. Myllymaki, and M. Livny) Proc. IEEE Data Engineering, April 1997. My publications as recorded by DBLP",
  "content_length": 2598,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:41"
}