{
  "name": "Miroslav Pajic",
  "homepage": "http://people.duke.edu/~mp275",
  "status": "success",
  "content": "Miroslav Pajic Miroslav Pajic - Paya E-mail: miroslav.pajic AT duke.edu Address: Hudson Hall Room 206, 100 Science Dr, Durham, NC 27708 Menu: Home CV Research CPSL@Duke Publications Teaching Awards Professional Service News Recent Headlines: August 2021: New NSF AI Institute! August 2021: Paper accepted at Automatica! August 2021: Paper accepted at IEEE TASE! August 2021: Paper accepted at IEEE TCAD! August 2021: Paper accepted at IEEE CDC'21! April 2021: Organized NSF-supported workshop on future of CPS! April 2021: New NIH Grant! February 2021: Two papers accepted at ICRA'21! February 2021: Paper accepted at the ARVO TVST Journal! December 2020: Paper accepted at ICCPS'21! December 2020: Paper accepted at DATE'21! September 2020: Paper accepted at Automatica! September 2020: Talk at Galois! August 2020: New collaboration with NATO's CMRE! August 2020: Talk at an SRC ICT Security Workshop! August 2020: New NIH Funding! August 2020: Two new PhD students joined the CPSL@Duke lab! July 2020: Talk at AVSS'20! June 2020: Received Dickinson Family Professorship from Duke! June 2020: Papers accepted at CSF'21, ESWeek'20 (CASES'20) & ATVA'20! June 2020: Keynote at SafeThing'20! April 2020: Paper accepted at the IEEE Trans. on Ind. Informatics! March 2020: Paper accepted at the ARVO TVST Journal! January 2020: 3 papers accepted at ICRA'20! January 2020: Paper accepted at ACM Trans. on CPS! January 2020: New ONR Grant! January 2020: Paper accepted at ACC'20 December 2019: Papers accepted at ICCPS'20 & HSCC'20! November 2020: TPC Chair of the 2020 NSF CPS PI Meeting! October 2020: Best Paper Finalist at EMSOFT'20! September 2020: Vuk Lesi is the first CPSL@Duke PhD graduate! July 2019: Paper accepted at EMSOFT'19! July 2019: Two papers accepted at CDC'19! June 2019: Paper accepted at ETFA'19 May 2019: Received IEEE TCCPS Early-Career Award! April 2019: Received ACM SIGBED Early Career Award! April 2019: Paper accepted at CAV'19! April 2019: New AFOSR Center of Excellence! April 2019: Paper accepted at IEEE TCST! April 2019: New NSF Grant! March 2019: Elevated to IEEE Senior Member! February 2019: New NSF IUCRC! January 2019: Paper accepted at IEEE TAC! January 2019: Paper accepted at ICRA'19! January 2019: Paper accepted at IoTDI'19! January 2019: Paper Accepted at TACAS'19! January 2019: Elected IEEE TCCPS Member-at-Large! December 2018: Paper accepted at IEEE THMS! August 2018: AE for ACM HEALTH! July 2018: New NSF CPS Medium Grant! July 2018: IBM Faculty Award! July 2018: Paper accepted at CDC! June 2018: Grant from the Lord Foundation of North Carolina! May 2018: ICCPS'19 TPC Chair February 2018: Nortel Networks Professorship! January 2018: Paper accepted at IEEE Transactions on Automatic Control! December 2017: Paper accepted at ICCPS'18! October 2017: Best Paper Award at EMSOFT'17! September 2017: Quoted in Wall Street Journal July 2017: Paper accepted in RTSS'17! July 2017: Paper accepted at IEEE CDC'17 June 2016: Pannelist at the FTC/NHTSA panel on Security of Connected Cars! June 2016: Two papers accepted at the ESWeek'17 (EMSOFT and CASES)! June 2017: Paper accepted at the IEEE Trans. on Computer Aided Design! May 2017: Invited to the the NAE's FOE Symposium! May 2017: Paper on stochastic games for secure control accepted at Automatica! April 2017: RESCHU-SA presented at CPSWeek'17 March 2017: NSF CAREER Award! February 2017: ONR YIP Award! February 2017: Paper on resilient sensor fusion in the presence of faults accepted in ACM Trans. on CPS! January 2017: New ONR project on Attack-Resilient Industrial Control & Combat Systems! December 2016: Paper accepted in TACAS'17! August 2016: Paper on secure state estimation accepted at the IEEE Trans. on Control of Network Systems! July 2016: Paper on design of attack-resilient CPS accepted at the IEEE Control Systems Magazine! June 2016: Paper accepted at ICCAD'16! June 2016: Special Session on Modeling, Sensing and Actuation for IoT accepted at CODES+ISSS'16, part of ESWeek! May 2016: Paper accepted at CASES'16, part of ESWeek! May 2016: Paper on Plug-n-Play CNC accepted at ETFA'16! May 2016: Paper on low-overhead coding for attack-detection accepted at the IEEE Trans. on Control of Network Systems! March 2016: Special Issue on Medical CPS in the ACM Trans. on CPS! December 2015: Papers accepted at ICCPS'16 and TACAS'16! November 2015: Papers accepted for ACM Transactions on Embedded Computing Systems! October 2015: Organized special session on CPS Security at ESWEEK! August 2015: Program committee member at ICCPS'16! July 2015: CPS Security and Privacy project supported by NSF and Intel! More news» Welcome I am looking for PhD students and postdocs with interests and expertise in embedded systems, formal methods, AI, learning and controls, robotics, and cyber-physical systems! I am the Dickinson Family Associate Professor in the Departments of Electrical and Computer Engineering and Computer Science and the director of the Cyber-Physical Systems Lab (CPSL) at Duke University. My research interests focus on design and analysis of cyber-physical systems with varying levels of autonomy and human interaction, at the intersection of (more traditional) areas of embedded systems, AI, learning and controls, formal methods and robotics. I received my Ph.D. in Electrical Engineering from the University of Pennsylvania. I also received Dipl. Ing. (5 years) and M.S. degrees in Electrical Engineering from University of Belgrade, and M.S. in Electrical Engineering from UPenn. I am an associate editor in the ACM Transactions on Computing for Healthcare (ACM HEALTH) and a co-chair of the 2019 ACM/IEEE International Conference on Cyber-Physical Systems (ICCPS'19). I have received various awards including Dickinson Family Professorship, Pratt School of Engineering, Duke University 2019 ACM SIGBED Early Career Researcher Award 2019 IEEE TCCPS Early-Career Award ONR Young Investigator Award NSF Faculty Early Career Development (CAREER) Award Nortel Networks Professorship, Pratt School of Engineering, Duke University ACM SIGBED/SIGSOFT Frank Anger Memorial Award EMSOFT'17 Best Paper Award ICCPS'14 Best Paper Award RTAS'12 Best Student Paper Award IBM Faculty Award, 2018 Joseph and Rosaline Wolf Best Dissertation Award from Penn Engineering Honeywell User Group Wireless Innovation Award Three additional Best Paper Finalists Awards (TACAS'12, ICCPS'14, EMSOFT'19) More» Â© 2013 Miroslav Pajic Template design by Andreas Viklund",
  "content_length": 6470,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:42"
}