{
  "name": "Miryung Kim",
  "homepage": "http://www.cs.ucla.edu/~miryung",
  "status": "success",
  "content": "Miryung Kim Miryung Kim Professor Vice Chair of Graduate Studies UCLA Computer Science Engineering VI, Room 474 Los Angeles, CA 90095 TEL: 310-825-2858 Administrative Support: Mr. Chris Bower TEL: 310-825-4033 Biography Miryung Kim is a Professor and Vice Chair of Graduate Studies in UCLA’s Computer Science Department. A pioneer in big data software engineering, she led research on the role of data scientists in the software industry and redesigned developer tools for big data analytics including Apache Spark. Her work helped formalize the “data scientist” role at Microsoft, which in turn spurred a proliferation of new data science and AI programs in universities. Code clones cause redundant developer effort across organizations. Prof Kim was among the first to analyze recurring software changes using large-scale data from GitHub and Stack Overflow. Her work advanced understanding of API stability, refactoring identification, and large-scale refactoring in industry. Professor Kim has mentored several PhD students and postdoctoral researchers eight of whom now hold faculty appointments at institutions such as Columbia and Purdue. She has received the ACM SIGSOFT Influential Educator Award, served as FSE Program Co-Chair, delivered keynotes at ASE and ISSTA, and given distinguished lectures at CMU and UIUC. She has also worked with Microsoft Research and is an Amazon Scholar at AWS. Awards Professor Kim is an ACM Distinguished Member. Her honors include the ACM SIGSOFT Influential Educator Award, two ICSME Test of Time Awards, an NSF CAREER Award, a Humboldt Fellowship, and awards from Microsoft, IBM, Google, and the Okawa Foundation. History Professor Kim graduated as No. 1 among all students in KAIST and received the Korean Ministry of Education, Science, and Technology Award, the highest honor given to an undergraduate student. She completed her MS and PhD at the University of Washington under David Notkin and held faculty positions at UT Austin and UCLA. She served eight years as faculty-in-residence, received the Doc Stevenson Award , and created Mommy Computer Science Camp, featured in PC Magazine . News (more here) Thanks to Samsung for sponsoring projects on AI-based coding assistants. Congratulations on DuoReduce (compiler debugging for MLIR), accepted to FSE 2025. Congratulations on SynthFuzz (testing AI accelerator compilers), accepted to ICSE 2025. Prof. Kim gave a keynote at Dagstuhl on Code Search in April 2024. Prof. Kim gave a Distinguished Lecture at UC Riverside in April 2024. Prof. Kim’s former PhD student Tianyi Zhang received NSF CAREER. Our paper on API Stability and Adoption received the Most Influential Paper Award from ICSME 2023 . Prof. Kim gave a Distinguished Lecture at Max Planck Institute in 2023. Prof. Kim gave a Distinguished Lecture at CMU in 2023. Prof. Kim gave a Keynote at the Symposium on SE for Machine Learning Applications in 2023. Prof. Kim gave a talk on Future of Software Engineering for Big Data and HW Heterogeneity at ICSE 2023. Prof. Kim gave a keynote at Dagstuhl Seminar on Software Bug Detection: Challenges and Synergies . Prof. Kim gave an invited talk at MPI-SWS Research Symposium in 2023. Prof. Kim served as a Program Chair of FSE 2022 (News). Prof. Kim gave a Keynote at ISSTA 2022 (News). Our research on testing quantum software is selected for ACM SIGSOFT Research Highlights ( News ). Prof. Kim received the ACM SIGSOFT Influential Educator Award (News). Prof. Kim became an ACM Distinguished Member (News). Prof. Kim gave Distinguished Lectures at UIUC and University of Minnesota in 2021. Our paper on refactoring received the Most Influential Paper Award from ICSME 2020 . Prof. Kim served as Program Co-Chair of ESEC/FSE 2022. Prof. Kim gave a Keynote at ASE 2019 . Prof. Kim was awarded a Humboldt Research Fellowship from Alexander von Humboldt Foundation. Prof. Kim’s former PhD students, Baishakhi Ray and Na Meng, received NSF CAREER. Our team received a $4.9 M grant from the Office of Naval Research on Synergistic Software Customization.",
  "content_length": 4070,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:44"
}