{
  "name": "Misha Kazhdan",
  "homepage": "http://www.cs.jhu.edu/~misha",
  "status": "success",
  "content": "Misha Kazhdan's Home Page Contact Info Department of Computer Science Johns Hopkins University 229 Malone Hall 3400 North Charles St. Baltimore, MD 21218 Fax: (410) 516-6134 E-mail: Teaching Recurring 601.857 Seminar in Computer Graphics 601.810 Diversity and Inclusion in Computer Science and Engineering Fall 2025 601.457/657 Computer Graphics Spring 2025 601.457/657 Computer Graphics Spring 2024 601.220 Intermediate Programming Fall 2023 601.457/657 Computer Graphics Spring 2023 601.760 FFTs in Graphics and Vision Fall 2022 601.457/657 Computer Graphics 501.123 FYS: Exploring Computer Science Spring 2022 601.220 Intermediate Programming Fall 2021 601.457/657 Computer Graphics Spring 2021 601.220 Intermediate Programming Fall 2020 601.457/657 Computer Graphics Spring 2020 601.459/659 Introduction to Computational Geometry Fall 2019 600.457/657 Computer Graphics Spring 2019 601.760 FFTs in Graphics and Vision Fall 2018 600.457/657 Computer Graphics Spring 2018 600.220 Intermediate Programming Fall 2017 600.457/657 Computer Graphics Spring 2017 600.120 Intermediate Programming 600.756 Introduction to Geometry Processing Fall 2016 600.457 Computer Graphics Spring 2016 600.459 Introduction to Computational Geometry Fall 2015 600.357/457 Computer Graphics Spring 2015 600.660 FFTs in Graphics and Vision Fall 2014 600.357/457 Computer Graphics Spring 2014 600.659 Introduction to Computational Geometry Fall 2013 600.357/457 Computer Graphics 600.658 Survey of methods in Computer Graphics Fall 2012 600.660 FFTs in Graphics and Vision Spring 2012 600.357/457 Computer Graphics Fall 2011 600.657 Rendering Spring 2011 600.357/457 Computer Graphics Fall 2010 600.657 Mesh Processing 600.105 M&Ms: Freshman Experience Spring 2010 600.357/457 Computer Graphics Fall 2009 600.657 Discrete Differential Geometry Spring 2009 600.357/457 Computer Graphics Fall 2008 600.660 FFTs in Graphics and Vision Spring 2008 600.758 Seminar in Computational Geometry 600.357/457 Computer Graphics Fall 2007 600.657 The Poisson Equation in Image & Shape Processing Spring 2007 600.357/457 Computer Graphics Fall 2006 600.660 FFTs in Graphics and Vision 600.105 M&Ms: Freshman Experience Spring 2006 600.357/457 Computer Graphics October 2005 ICCV 3D Scan Matching and Registration Fall 2005 600.659 Seminar on 3D Model Reconstruction 600.105 M&Ms: Freshman Experience Spring 2005 600.357/457 Computer Graphics Fall 2004 600.658 Seminar on Shape Analysis and Retrieval August 2004 SIGGRAPH Shape-Based Retrieval and Analysis of 3D Models Publications and Talks (CV) Image Processing Möbius Convolutions for Spherical CNNs (Source) T. Mitchel, N. Aigerman, V. Kim, and M. Kazhdan SIGGRAPH (2022) Efficient Spatially Adaptive Convolution and Correlation (ArXiv) T. Mitchel, B. Brown, D. Koller, T. Weyrich, S. Rusinkiewicz, and M. Kazhdan ArXiv (2020, abs/2006.13188) Variance Analysis for Monte Carlo Integration (Supplemental, Tech Report, Slides) A. Pilleboue, G. Singh, D. Coeurjolly, M. Kazhdan, and V. Ostromoukhov SIGGRAPH (2015, Vol. 34, No. 4) Gradient-Domain Fusion for Color Correction in Large EM Image Stacks (ArXiv) M. Kazhdan, K. Lillaney, W. Roncal, D. Bock, J. Vogelstein, and R. Burns ArXiv (2015, abs/1506.02079) Metric-Aware Processing of Spherical Imagery (Slides, Union Station, Source and Executables) M. Kazhdan and H. Hoppe SIGGRAPH Asia (2010, Vol. 29, No. 6) A User-Assisted Approach to Visualizing Multidimensional Images J. Lawrence, S. Arietta, M. Kazhdan, D. Lepage, and C. O'Hagan IEEE Transactions on Visualizations and Computer Graphics (2011, Vol. 17, No. 10) Distributed Gradient-Domain Processing of Planar and Spherical Images (Slides, WorldWide Telescope, Source and Executables) M. Kazhdan, D. Surendran, and H. Hoppe Transactions on Graphics (2010, Vol. 29, No. 14) Streaming Multigrid for Gradient-Domain Operations on Large Images (Slides, Supplemental, St James, Source and Executables) M. Kazhdan and H. Hoppe SIGGRAPH (2008, Vol. 27, No. 21) Geometry Processing Signal-Processing withina Texture Atlas (Slides) F. Prada, H. Hoppe, and M. Kazhdan New York University (November 2025) Conformalized Mean Curvature Flowand Möbius Registration (Slides) J. Solomon, M. Ben-Chen, A. Baden, K. Crane, and M. Kazhdan Hebrew University (January 2024) Skin Lesion Correspondence Localization in Total Body Photography W.-L. Huang, D. Tashayyod, J. Kang, A. Gandjbakhche, M. Kazhdan, and M Armand MICCAI (2023) Variational Quadratic Shape Functions for Polygons and Polyhedra (Supplemental, Source and Executables) A. Bunge, P. Herholz, O. Sorkine-Hornung, M. Botsch, and M. Kazhdan SIGGRAPH (2022, Vol. 41, No. 4) Field Convolutions for Surface CNNs (Supplemental) T. Mitchel, V. Kim, and M. Kazhdan International Conference on Computer Vision (2021, Vol. 41, No. 3) ECHO: Extended Convolution Histogram of Orientations for Local Surface Description (Source and Executables) T. Mitchel, S. Rusinkiewicz, G. Chirikjian, and M. Kazhdan Computer Graphics Forum (2021, Vol. 40, No. 1) Polygon Laplacian Made Simple (Source) A. Bunge, P. Herholz, M. Kazhdan and M. Botsch Eurographics (2020, Vol. 39, No. 2) Dense Point-to-Point Correspondences Between Genus-Zero Shapes (Slides, Source and Executables) S. Lee and M. Kazhdan Symposium on Geometry Processing (2019, Vol. 38, No. 5) Registering Genus-Zero Surfaces (Slides) M. Kazhdan IPAM Workshop (April 2019) Möbius Registration (Slides, Source and Executables) A. Baden, K. Crane, and M. Kazhdan Symposium on Geometry Processing (2018, Vol. 37, No. 5) Gradient-Domain Processing within a Texture Atlas (Slides, Source and Executables) F. Prada, M. Kazhdan, M. Chuang, and H. Hoppe SIGGRAPH (2018, Vol. 37, No. 4) Spatiotemporal Atlas Parameterization for Evolving Meshes F. Prada, M. Kazhdan, M. Chuang, A. Collet, and H. Hoppe SIGGRAPH (2017, Vol. 36, No. 4) Gradient-Domain Processing of Meshes (Source and Executables) M. Chuang, S. Rusinkiewicz, and M. Kazhdan Journal of Computer Graphics Techniques (JCGT) (2016, Vol. 5, No. 4) Motion Graphs for Unstructured Textured Meshes (Supplemental, Slides, Source and Executables) F. Prada, M. Kazhdan, M. Chuang, A. Collet, and H. Hoppe SIGGRAPH (2016, Vol. 35, No. 4) Signal Processing -- from Images to Surfaces (Slides) M. Kazhdan TCE Conference (May 2016) Unconditionally Stable Shock Filters for Image and Geometry Processing (Slides, Source and Executables) F. Prada Niño and M. Kazhdan Symposium on Geometry Processing (2015, Vol. 34, No. 5) Fast and Exact (Poisson) Solvers on Symmetric Geometries (Slides, Source and Executables) M. Kazhdan Symposium on Geometry Processing (2015, Vol. 34, No. 5) Spectral Processing (Slides) M. Kazhdan Symposium on Geometry Processing (July 2015, Course) The Poisson System: From Images to Geometry (Slides) M. Kazhdan Shape Modeling International (October 2014, Keynote) Searching for Structure in Geometry Processing (Slides) M. Kazhdan Symposium on Geometry Processing (July 2014, Keynote) Can Mean-Curvature Flow be Modified to be Non-singular? (Supplemental, Slides, Source and Executables) M. Kazhdan, J. Solomon, and M. Ben-Chen Symposium on Geometry Processing (2012, Vol. 31, No. 5) Interactive and Anisotropic Geometry Processing Using the Screened Poisson Equation (Slides, Source and Executables) M. Chuang and M. Kazhdan SIGGRAPH (2011, Vol. 30, No. 4) Fast Mean-Curvature Flow via Finite-Elements Tracking (Source and Executables) M. Chuang and M. Kazhdan Computer Graphics Forum (2011, Vol. 30, No. 6) SpringLS: A Deformable Model Representation to provide Interoperability between Meshes and Level Sets B. Lucas, M. Kazhdan, and R. Taylor MICCAI (2011, Vol. 19, No. 5) Estimating the Laplace-Beltrami Operator by Restricting 3D Functions (Slides, Source and Executables) M. Chuang, L. Luo, B. Brown, S. Rusinkiewicz, and M. Kazhdan Symposium on Geometry Processing (2009, Vol. 28, No. 5) Surface Reconstruction Symmetric Poisson Reconstruction (Source and Executables) M. Kohlbrenner, H. Liu, M. Kazhdan, and M. Alexa Symposium on Geometry Processing (2025, Vol. 44, No. 5) Poisson Manifold Reconstruction (beyond co-dimension one) (Slides) M. Kohlbrenner, S.C. Lee, M. Kazhdan, and M. Alexa Technion (January 2024) Distributed Poisson Surface Reconstruction (Source and Executables, Slides) M. Kazhdan and H. Hoppe Computer Graphics Forum (2023) Poisson Manifold Reconstruction -- Beyond Co-dimension One (Supplemental, Source and Executables) M. Kohlbrenner, S.C. Lee, M. Kazhdan, and M. Alexa Symposium on Geometry Processing (2023, Vol. 42, No. 5) Poisson Surface Reconstruction with Boundary Constraints (Slides, Source and Executables) M. Kazhdan, M. Chuang, S. Rusinkiewicz, and H. Hoppe Symposium on Geometry Processing (2020, Vol. 39, No. 5) An Adaptive Multigrid Solver for Applications in Computer Graphics (Slides, Source and Executables, Supplemental) M. Kazhdan and H. Hoppe Computer Graphics Forum (2018, Vol. 38, No. 1) Field-Aligned Online Surface Reconstruction (Video, Source) N. Schertler, M. Tarini, W. Jakob, M. Kazhdan, S. Gumhold, D. Panozzo SIGGRAPH (2017, Vol. 36, No. 4) Accurate Isosurface Interpolation with Hermite Data (Source and Executables) S. Fuhrmann, M. Kazhdan, and M. Goesele 3D Vision (2015) Screened Poisson Surface Reconstruction (Slides, Source and Executables) M. Kazhdan and H. Hoppe Transactions on Graphics (2013, Vol. 32, No. 3) Surface Reconstruction (Slides) M. Kazhdan Symposium on Geometry Processing (July 2011, Course) Parallel Poisson Surface Reconstruction M. Bolitho, M. Kazhdan, R. Burns, and H. Hoppe Inernational Symposium on Visual Computing (2009, Vol. 5875) Multilevel Streaming for Out-of-Core Surface Reconstruction (Slides, Source and Executables) M. Bolitho, M. Kazhdan, R. Burns, and H. Hoppe Symposium on Geometry Processing (2007) Unconstrained Isosurface Extraction on Arbitrary Octrees (Slides, Source and Executables) M. Kazhdan, A. Klein, K. Dalal, and H. Hoppe Symposium on Geometry Processing (2007) Poisson Surface Reconstruction (Slides, ",
  "content_length": 16950,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:45"
}