{
  "name": "Mitch Cherniack",
  "homepage": "http://www.cs.brandeis.edu/~mfc",
  "status": "success",
  "content": "Mitch Cherniack Mitch Cherniack Associate Professor of Computer Science Brandeis University Waltham, MA 02454 phone: 781 736 2738 fax: 781 736 2741 email: mfc AT brandeis DOT edu Graduate Student Advising My slides advising new grad students on course selection, and presented at the new graduate student orientation on 8/24/2010, are available here: (Powerpoint 2007) or here: (Powerpoint 2003). Education Ph.D, Brown University, 1999 M.S., Concordia University, 1992 B.Ed., McGill University, 1984 Research Interests My primary interests are in Database Systems, and in particular, niche data management areas such as stream processing and data warehouses. I am presently working on the following project: The DEVEL-OP project involves designing a development environment for building query optimizers and includes: a suite of software tools for compiling optimizer components from declarative specifications, and for debgugging, profiling and visualization of generated components, and a benchmark for measuring the effectiveness and efficiency of query optimizers and their components. This work is supported by NSF Award #1217952: A Development Environment for Query Optimizer Engineering. Publications My DBLP page can be found here. Database Community I am one of the founders and organizers of NEDS: the [N]ew [E]ngland [D]atabase [S]ociety. Please consult the NEDS web page for more information. I am also a co-founder of and consultant for two startups: Streambase (a commercialization of Aurora) and Vertica (a commercialization of C-Store). Personal Prior to my academic career, I was a high school and elementary school teacher in Quebec, Canada. I first taught elementary school in a small isolated village named Bradore Bay on Quebec's Lower North Shore near Labrador. I then spent 5 years teaching at a high school in Montreal. Quick Links Brandeis University Brandeis University, Department of Computer Science Streambase Systems Vertica Systems DBLP Brown University, Department of Computer Science Concordia University, Department of Computer Science McGill University, Faculty of Education Broomstones Curling Club Go back to Department home page.",
  "content_length": 2167,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:46"
}