{
  "name": "Mitesh M. Khapra",
  "homepage": "http://www.cse.iitm.ac.in/~miteshk",
  "status": "success",
  "content": "Mitesh M. Khapra, DSAI, IITM Mitesh M. Khapra Associate ProfessorDepartment of Data Science and AIWadhwani School of Data Science and AI Indian Institute of Technology MadrasChennai - 600 036 https://maps.app.goo.gl/XnwMQsjJVGdzVGVx6 Research | Bio | Awards| Teaching | Publications | Students Research My research focuses on bringing parity in AI technologies for Indian languages with respect to English with open-source contributions in tools, datasets, neural models, and reference applications. My specific areas of interest are pretrained multilingual models for natural language and speech, neural machine translation, efficient models for automatic speech recognition, and evaluation metrics for natural language generation. Please visit the Nilekani Centre at AI4Bharat to know more about my work. Bio Mitesh M. Khapra is an Associate Professor in the Department of Data Science and AI (DSAI), Wadhwani School of Data Science and AI at IIT Madras. He heads the AI4Bharat Research Lab at IIT Madras which focuses on building datasets, tools, models and applications for Indian languages. His research work has been published in several top conferences and journals including TACL, ACL, NeurIPS, TALLIP, EMNLP, EACL, AAAI, etc. He has also served as Area Chair or Senior PC member in top conferences such as ICLR and AAAI. Prior to IIT Madras, he was a Researcher at IBM Research India for four and a half years, where he worked on several interesting problems in the areas of Statistical Machine Translation, Cross Language Learning, Multimodal Learning, Argument Mining and Deep Learning. Prior to IBM, he completed his PhD and M.Tech from IIT Bombay in Jan 2012 and July 2008 respectively. His PhD thesis dealt with the important problem of reusing resources for multilingual computation. During his PhD he was a recipient of the IBM PhD Fellowship (2011) and the Microsoft Rising Star Award (2011). He is also a recipient of the Google Faculty Research Award (2018), the IITM Young Faculty Recognition Award (2019), the Prof. B. Yegnanarayana Award for Excellence in Research and Teaching (2020) and the Srimathi Marti Annapurna Gurunath Award for Excellence in Teaching (2022). Awards Srimathi Marti Annapurna Gurunath Award for Excellence in Teaching, 2022 Nasscom AI Game Changer Award, 2021 (Academic Category: Accepted on behalf of Team Samanantar) Prof. B. Yegnanarayana Award for Excellence in Research and Teaching, 2020 IITM Young Faculty Recognition Award, 2019 Google Faculty Research Award, 2018 Microsoft Rising Star Award, 2011 IBM PhD Fellowship, 2011-2012 Teaching Deep Learning (CS7015/CS6910): Jan 2017, Jan 2018, Jan 2019, Jan 2021, Jan 2022, Jan 2023 Topics in Deep Learning (CS7016): August 2017, August 2019 Computational Engineering (CS1100): August 2018 Object Oriented Algorithms Implementation and Analysis Lab (CS2810): Jan 2019 Linear Algebra and Random Processes (CS6015): Sep 2020, Aug 2021, Aug 2022 Students PhD: Preksha Nema (Google PhD Fellowship (2017) , with Prof. Ravindran), Ananya B. Sai ( Google PhD Fellowship, 2019), Tahir Javed (Google PhD Fellowship, 2022), Sushane Parthan, Sumanth Doddapaneni (Google PhD Fellowship, 2023), Kaushal Bhogale, Praveen S V (Google PhD Fellowship, 2024), Mohammed Safi Ur Rahman Khan, Oikantik Nath, Sakshi Joshi MS: Siddharth Arora (2015), Shashank Shrivastava (with Prof. Sutanu 2016), Shreyas Shetty (2018), Nikita Moghe (with Prof. Ravindran 2018), Suman Banerjee (Best MS Thesis Award, INAE Innovative Students Project Award 2020 - Masters Level 2019), Shweta Bhardwaj (2019), Pritha Ganguly (2019), Nitesh Methani (2020), Madhura Pande (with Prof. Pratyush Kumar 2021), Raghavan A K (2023), Yash Madhani (2023), Pranjal Agadh Chitale (2024), Nandini Mundra (2024), Anushka Singh, Srija Anand, Ashwin Sankar, Abhishek Ranjan, Thanmay Jayakumar M.Tech: Ananya b. Sai (2018), Shubham Patel (Best M.Tech Project Award 2019), Jaya Ingle (Best M.Tech Project Award 2019), Amar Vashishth (2019), Siddharth AP (2019), B Krishnanjali (with Prof. Pratyush Kumar 2020), Bethu Sai Sampath (with Prof. Pratyush Kumar 2020), Nitin John Titus (with Prof. Pratyush Kumar 2020), Manideep Ladi (2022), Aman Kumar (2022), Himani Shrotiya (2022), Prachi Sahu (2022), Priyanka Bedekar (2022), Rigved Sah (2022), Shubham Randive (2022), Sumit Negi (2022), Sushane Parthan (2022), Mohammed Safi Ur Rahman Khan (2023), Siddesh Hegde (2023), Keyur Raval (2023), Sanjanaa GV (2023), Aswanth Kumar (2023), Varun Gumma (2023), Bibhuti Majhi (2024), Sarthak Naithani (2024), Sai Sree Ram Putta (2024), Ravi Prakash Singh (2024), Raj Mahajan (2024), Sathish Kumar Reddy (2024), Tanmay Pramod Garde (2025), Amar Kumar Sharma (2025), Shubhodeep Chanda (2025) DD: Sanchit Agrawal (Best DDP Award 2018), Gurneet Singh (2018), Ishu Garg (2018), Soham Parikh (2018), Sowjanya Vemuri (2019), Ajaykrishnan Jayagopal (2019), Satishkumar Golla (2019), Umang Sinha (2020), Aashay Doshi (2020), Sandesh Katta (2020), Siddharth Devulapalli (2020), Sahana Ramnath (2020), Monisha Jegadeesan (2020), M Akash Kumar (2021), Dev Sheth (2022), Aghin Shah (2022), Nayan N (2022), Devakrishna Asokar (2022) B.Tech: Susanna Maria Baby (2017), Revanth Reddy (2018), Aarvith Muthu (2019), Emil Biju (2021), Abishek S (2022) (the number in the bracket is the year of graduation) Publications J = Journal, C = Conference [J12] Praveen S V, Amogh Gulati, Ashwin Sankar, Srija Anand, Anirudh Gupta, Anirudh Mukherjee, Shiva Kumar Marepally, Ankur Bhatia, Saloni Jaju, Suvrat Bhooshan, Mitesh M. Khapra. Rethinking MUSHRA: Addressing Modern Challenges in Text-to-Speech Evaluation. Transactions on Machine Learning Research (TMLR), 2025. [J11] Sumanth Doddapaneni, Gowtham Ramesh, Mitesh M. Khapra, Anoop Kunchukuttan, Pratyush Kumar. A Primer on Pretrained Multilingual Language Models. ACM Computing Surveys (ACM CSUR), 2025. [J10] Jay Gala, Pranjal A Chitale, A K Raghavan, Varun Gumma, Sumanth Doddapaneni, Aswanth Kumar M, Janki Atul Nawale, Anupama Sujatha, Ratish Puduppully, Vivek Raghavan, Pratyush Kumar, Mitesh M Khapra, Raj Dabre, Anoop Kunchukuttan. IndicTrans2: Towards High-Quality and Accessible Machine Translation Models for all 22 Scheduled Indian Languages. Transactions on Machine Learning Research ( TMLR ), 2022. [J09] Aravinth Bheemaraj, Mayank Jobanputra, Raghavan AK, Ajitesh Sharma, Sujit Sahoo, Harshita Diddee, Mahalakshmi J, Divyanshu Kakwani, Navneet Kumar, Aswin Pradeep, Srihari Nagaraj, Kumar Deepak, Vivek Raghavan, Anoop Kunchukuttan, Pratyush Kumar, Mitesh Shantadevi Khapra. Samanantar: The Largest Publicly Available Parallel Corpora Collection for 11 Indic Languages. Transactions of the Association for Computational Linguistics,( TACL ), 2022. [J08] Ananya B. Sai, M Akash Kumar, Mitesh M. Khapra. A Survey of Evaluation Metrics Used for NLG Systems. ACM Computing Surveys (ACM CSUR), 2021. [J07] Ananya B. Sai, M Akash Kumar, Siddharatha Arora, Mitesh M. Khapra. Improving Dialog Evaluation with a Multi-reference Adversarial Dataset and Large Scale Pretraining. Transactions of the Association for Computational Linguistics (TACL), 2020. [J06] Suman Banerjee, Mitesh M. Khapra. Graph Convolutional Network with Sequential Attention for Goal-oriented Dialogue Systems. Transactions of the Association for Computational Linguistics (TACL), 2019. [J05] Rudra Murthy, Mitesh M. Khapra, Dr. Pushpak Bhattacharyya. Improving NER Tagging Performance in Low-Resource Languages via Multilingual Learning. The ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP), 2018. [J04] Anoop Kunchukuttan, Mitesh Khapra, Gurneet Singh, Pushpak Bhattacharyya. Leveraging Orthographic Similarity for Multilingual Neural Transliteration. Transactions of the Association for Computational Linguistics (TACL), 2018. [J03] Deepak Mittal, Shweta Bhardwaj, Mitesh M. Khapra, Balaraman Ravindran. Studying the Plasticity in Deep Convolutional Neural Networks using Random Pruning. To appear in the Journal of Machine Vision and Applications (MVA). Springer. [J02] Sarath Chandar, Mitesh M. Khapra, Hugo Larochelle, Balaraman Ravindran, Correlational Neural Networks, Neural Computation, February 2016. [J01] A Kumaran, Mitesh M. Khapra and Pushpak Bhattacharyya, Compositional Machine Transliteration, accepted for publication in Transactions on Asian Language Information Processing ( TALIP ), December 2010. [C78] Sumanth Doddapaneni, Mohammed Safi Ur Rahman Khan, Dilip Venkatesh, Raj Dabre, Anoop Kunchukuttan, Mitesh M. Khapra: Cross-Lingual Auto Evaluation for Assessing Multilingual LLMs. In Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025), Vienna, Austria, July 2025. [C77] Kaushal Santosh Bhogale, Deovrat Mehendale, Tahir Javed, Devbrat Anuragi, Sakshi Joshi, Sai Sundaresan, Aparna Ananthanarayanan, Sharmistha Dey, Sathish Kumar Reddy G, Anusha Srinivasan, Abhigyan Raman, Pratyush Kumar, Mitesh M. Khapra: Towards Bringing Parity in Pretraining Datasets for Low-resource Indian Languages. In Proceedings of IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2025), Hyderabad, India, April 2025. [C76] Oikantik Nath, Hanani Bathina, Mohammed Safi Ur Rahman Khan, Mitesh M. Khapra: Can Vision-Language Models Evaluate Handwritten Math?. In Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025), Vienna, Austria, July 2025. [C75] Janki Atul Nawale, Mohammed Safi Ur Rahman Khan, Janani D, Mansi Gupta, Danish Pruthi, Mitesh M. Khapra: FairI Tales: Evaluation of Fairness in Indian Contexts with a Focus on Bias and Stereotypes. In Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025), Vienna, Austria, July 2025. [C74] Ashwin Sankar, Sparsh Jain, Nikhil Narasimhan, Devilal Choudhary, Dhairya Suman, Mohammed Safi Ur Rahman Khan, Anoop Kunchukuttan, Mitesh M Khapra, Raj Dabre: Towards Building Large Scale Datasets and State-of-the-Art A",
  "content_length": 32008,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:47"
}