{
  "name": "Mithulananthan Nadarajah",
  "homepage": "http://researchers.uq.edu.au/researcher/2221",
  "status": "success",
  "content": "Professor Mithulan Nadarajah | UQ Experts Skip to menu Skip to content Skip to footer Professor Mithulan Nadarajah Email: mithulan@eecs.uq.edu.au Phone: +61 7 336 54194 Positions Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Prof. Mithulan has a Ph.D. from the University of Waterloo, Ontario, Canada. His B.Sc. (Eng.) and M. Eng. degrees are from the University of Peradeniya, Sri Lanka, and the Asian Institute of Technology (AIT), Bangkok, Thailand, in May 1993 and August 1997, respectively. Prior to joining the University of Queensland from 2009, Mithulan was at the Energy Field of Study, AIT. His previous professional positions include Planning Engineer at Generation Planning division at Ceylon Electricity Board (CEB), Sri Lanka and Project Leader, at the Centre of Excellence in Electric Power Technology (CEEPT) at Chulalongkorn University, Thailand. His main research interest is on Grid Integration of Renewable Energy (GIRE). In this research topic, he has been leading the research in two themes: Planning and Operational Planning of grid integration of renewable energy. His research has been used by industries and received high citations. Based on his research, he published over 375 articles, including one book, eight book chapters, technical reports, refereed journal and conference papers. He had supervised 31 Ph.D. students (UQ, CQU, UNSW, UNITEN and AIT), 50 research Masters (at AIT) and over 200 thesis project students at both undergraduate and postgraduate levels to successful completion. He had been involved in over 30 projects (research, teaching and learning) with a total budget of over 4 million AU$, as a principal or co-principal investigator. His recent grants are from Australian Research Council (ARC), Government of India, Indonesia and Malaysisa and Sterling Wilson Company. Previous projects were funded by European Union (EU) and other international donor agencies such as Swedish International Development Agency (Sida), NORAD, ARC, CSIRO and Australian Power Institute (API). His research network includes most of the member nations in ASEAN, other Asian countries such as India, China, Bangladesh, Sri Lanka and a number of European countries (France, Germany, Sweden, Norway, Finland, Denmark, The Netherlands). He also served as the Coordinator of Energy Field of Study and Director of Regional Energy Resource Information Centre (RERIC), at AIT, from September 2005 to December 2007. He had been the Director of Higher Degree Research (HDR) studies and Post Graduate Coordinator at the school of Electrical Engineering and Computer Science, since July 2019, until January 2025, looking after the welfare of over 300 higher degree research scholars. He was invited to join the editorial board of the American Institute of Mathematical Sciences Electronic Engineering Journal - an international open access journal. He is a senior member of IEEE. Read more Read less Availability Professor Mithulan Nadarajah is: Available for supervision Media expert Fields of research Engineering Qualifications Bachelor of Engineering, University of Peradeniya Masters (Extended) of Electrical - Engineering, Asian Institute of Technology Thailand Doctor of Philosophy, University of Waterloo Postgraduate Diploma in Higher Education, The University of Queensland Research interests Power System Stability and Dyanmics Read more Read less Stability Challenges in Renewable Energy Integration Read more Read less Stability Challenges in EV and community energy storage integration Read more Read less Works Search Professor Mithulan Nadarajah’s works on UQ eSpace All (381) Book (2) Journal Article (158) Other Outputs (1) Conference Publication (212) Book Chapter (8) 2025 Journal Article A comprehensive framework for harnessing energy arbitrage benefits through an electric vehicle aggregator Pradana, Adlan, Haque, M. M. and Nadarajah, Mithulananthan (2025). A comprehensive framework for harnessing energy arbitrage benefits through an electric vehicle aggregator. Journal of Energy Storage, 139 118617, 1-20. doi: 10.1016/j.est.2025.118617 A comprehensive framework for harnessing energy arbitrage benefits through an electric vehicle aggregator 2025 Journal Article A review of restoration experience from historical blackouts and a decision support framework for parallel restoration with a case study De Silva, Hasini, Nadarajah, Mithulananthan, Haque, Mejbaul, Islam, Monirul and Madurai Elavarasan, Rajvikram (2025). A review of restoration experience from historical blackouts and a decision support framework for parallel restoration with a case study. Electric Power Systems Research, 248 111933, 1-27. doi: 10.1016/j.epsr.2025.111933 A review of restoration experience from historical blackouts and a decision support framework for parallel restoration with a case study 2025 Journal Article A Communication-free EV Charger for Residential Households Shafiq, Saifullah, Nadarajah, Mithulananthan and Al-Awami, Ali T. (2025). A Communication-free EV Charger for Residential Households. IEEE Transactions on Industry Applications, PP (99), 1-13. doi: 10.1109/TIA.2025.3618814 A Communication-free EV Charger for Residential Households 2025 Journal Article The inverse Carson's equations problem: definition, implementation and numerical experiments Tam, C. H., Geth, F. and Mithulananthan, N. (2025). The inverse Carson's equations problem: definition, implementation and numerical experiments. IEEE Transactions on Power Delivery, 40 (4), 2378-2390. doi: 10.1109/tpwrd.2025.3578065 The inverse Carson's equations problem: definition, implementation and numerical experiments 2025 Journal Article Tribrid Energy Storage System for Frequency Support with Stage-Specific Control in a Complex Interconnected Power System with HVDC Link Ajami, Ousama M.T., Tan, Rodney H.G., Nadarajah, Mithulananthan, Jamaludin, Farah Adilah and Pradana, Adlan Bagus (2025). Tribrid Energy Storage System for Frequency Support with Stage-Specific Control in a Complex Interconnected Power System with HVDC Link. e-Prime - Advances in Electrical Engineering, Electronics and Energy, 13 101100, 1-17. doi: 10.1016/j.prime.2025.101100 Tribrid Energy Storage System for Frequency Support with Stage-Specific Control in a Complex Interconnected Power System with HVDC Link 2025 Conference Publication PMU Placement to Estimate Power Mismatch for Frequency Stability Assessment Syifa, Baity Nuris, Nadarajah, Mithulananthan, Shah, Rakibuzzaman and Feng, JiaJie (2025). PMU Placement to Estimate Power Mismatch for Frequency Stability Assessment. IEEE. doi: 10.1109/ne-iecce64154.2025.11183216 PMU Placement to Estimate Power Mismatch for Frequency Stability Assessment 2025 Conference Publication Mitigating Cyberattack Impacts on LFC-AVR Systems with High Renewable Penetration through Redundancy and Adaptive Kalman Filter Pradana, Adlan, Nadarajah, Mithulananthan, Feng, Jiajie and Haque, Md. Mejbaul (2025). Mitigating Cyberattack Impacts on LFC-AVR Systems with High Renewable Penetration through Redundancy and Adaptive Kalman Filter. 7th Global Power Energy and Communication Conference-GPECOM-Annual, Bochum Germany, Jun 11-13, 2025. NEW YORK: IEEE. doi: 10.1109/gpecom65896.2025.11061885 Mitigating Cyberattack Impacts on LFC-AVR Systems with High Renewable Penetration through Redundancy and Adaptive Kalman Filter 2025 Conference Publication Optimal Dynamic Coordination of V2G and Fuel Cells as Frequency Control Ancillary Services Pradana, Adlan, Astriani, Yuli, Haque, Md. Mejbaul and Nadarajah, Mithulananthan (2025). Optimal Dynamic Coordination of V2G and Fuel Cells as Frequency Control Ancillary Services. 7th Global Power Energy and Communication Conference-GPECOM-Annual, Bochum Germany, Jun 11-13, 2025. NEW YORK: IEEE. doi: 10.1109/gpecom65896.2025.11061851 Optimal Dynamic Coordination of V2G and Fuel Cells as Frequency Control Ancillary Services 2025 Conference Publication Financial Viability of Hybrid AC-DC Power System for Buildings with EV and DC Loads Pradana, Adlan, Nadarajah, Mithulananthan, Anugrah, Pinto and Haque, Md. Mejbaul (2025). Financial Viability of Hybrid AC-DC Power System for Buildings with EV and DC Loads. 7th Global Power Energy and Communication Conference-GPECOM-Annual, Bochum Germany, Jun 11-13, 2025. NEW YORK: IEEE. doi: 10.1109/gpecom65896.2025.11061904 Financial Viability of Hybrid AC-DC Power System for Buildings with EV and DC Loads 2025 Conference Publication Comparison of Control Indices in Evaluating Coordinated V2G-Fuel Cells for Frequency Support Pradana, Adlan, Nadarajah, Mithulananthan, Syifa, Baity Nuris and Astriani, Yuli (2025). Comparison of Control Indices in Evaluating Coordinated V2G-Fuel Cells for Frequency Support. 7th Global Power Energy and Communication Conference-GPECOM-Annual, Bochum Germany, Jun 11-13, 2025. NEW YORK: IEEE. doi: 10.1109/gpecom65896.2025.11061868 Comparison of Control Indices in Evaluating Coordinated V2G-Fuel Cells for Frequency Support 2025 Journal Article An optimization-based EVA-VCAS for effective voltage sag management Pradana, Adlan, Haque, M．M, Nadarajah, Mithulananthan and Krismanto, AU (2025). An optimization-based EVA-VCAS for effective voltage sag management. Computers and Electrical Engineering, 123 (Part B) 110111, 1-20. doi: 10.1016/j.compeleceng.2025.110111 An optimization-based EVA-VCAS for effective voltage sag management 2025 Journal Article Erratum to “Enhancement of distribution system performance with reconfiguration, distributed generation and capacitor bank deployment” [Heliyon Volume 10, Issue 7, April 2024, Article e26343](S2405844024023740)(10.1016/j.heliyon.2024.e26343) Jayabarathi, T., Raghunathan, T., Mithulananthan, N., Cherukuri, S. H.C. and Sai, G. Loknath (2025). Erratum to “Enhancement of distribution system performance with reconfiguration, distributed generation and capacitor bank deployment” [Heliyon Volum",
  "content_length": 22286,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:51"
}