{
  "name": "Mitsunori Ogihara",
  "homepage": "http://www.cs.miami.edu/~ogihara",
  "status": "success",
  "content": "Mitsunori Ogihara's Home Page Mitsunori Ogihara's Page Mitsunori Ogihara, Professor, Ph.D. (1993), Tokyo Institute of Technology. Contact Information Email: ogihara AT cs DOT miami DOT edu Phone: 305-284-2308 Fax: 305-284-2264 Delivery Address: Department of Computer Science University of Miami 1365 Memorial Drive Coral Gables, FL 33146, USA Research Interests I have a broad range of interests related to computing, including theory of computation, music information retrieval, data mining, and digital humanities. Appointments Assistant Professor of Computer Science (1991-93), University of Electro-Communications. Visiting Lecturer/Visiting Assistant Professor of Computer Science, State University of New York at Buffalo (1992) Assistant Professor of Computer Science, University of Rochester (1994-98) Associate Professor of Computer Science, University of Rochester (1998-2002) Chair of the Department of Computer Science, University of Rochester (1999-2007) Professor of Computer Science, University of Rochester (2002-2007) Professor in the Center for Aging and Developmental Biology, University of Rochester (2003-2007) Professor of Computer Science, College of Arts of Sciences, University of Miami (2007-) Director of Data Mining in the Center for Computational Sciences, University of Miami (2007-) Professor of Electrical and Computer Engineering, College of Engineering, University of Miami (2007-) Professor in Media Technology and Industry, Frost School of Music, University of Miami (2012-) Associate Dean for Digital Library Innovations, College of Arts and Sciences & Otto G. Richter Library, University of Miami (2012-2016) Books “Fundamentals of Java Programming” from Springer International. Here is the publisher link and its cover. “Music Data Miing” from CRC Press in 2012. Here is the publisher link and its cover. A complexity theory textbook “ Hierachies in Complexity Theory” from Kyoritsu Publishing Co., 2006, written in Japanese. “The Complexity Theory Companion”, written with Lane Hemaspaandra The Complexity Theory Companion (Hemaspaandra and Ogihara, Springer-Verlag, 2002). Curriculum Vitae (Please refer to my publication section for a list of my papers) CV Editorial Positions Theory of Computing Systems International Journal of Foundations of Computer Science Courses I do not provide information for my courses here. At the University of Miami, I have taughted in the past: CSC120 Computer Programming I, CSC198/FNS190 DaVinci Seminar / Frenshman Seminar - iListen/uListen, CSC220 Data Structures, and CSC427 Theory of Computation. If you are instuctors and interested in seeing my teaching materials, please send me email. Former PhD Students Alina Beygelzimer (Yahoo! Research) Yin-He Cheng (IBM Austin Lab) Yajie Hu (Google) Gabriel Istrate (Institute e-Austria Timisoara) Ashwin Lall (Denison University) Tao Li (in memoriam; Florida International University) Srinivasan Parthasarathy (The Ohio State University) Mohammed Javeed Zaki (Rensselaer Polytechnic University) Chengliang Zhang (Amazon) Related Links Computing Research Association Assocation for Computing Machinery Notes about myself I am very much interested in music. I have been collecting CDs/LPs in jazz, classical, pop, and rock. I have an extensive collection of recordings by Helen Merrill, Karin Krog, Art Ensemble of Chicago, and Mahler Symphonies. The picture at the top shows my 6/8 Samuel Shen bass and Steinway-S, the 150th Anniversary Model.",
  "content_length": 3466,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:50"
}