{
  "name": "Mitsuhisa Sato",
  "homepage": "http://www.hpcs.cs.tsukuba.ac.jp/~msato",
  "status": "success",
  "content": "Mitsuhisa Sato, University of Tsukuba Home | Projects | Publications| HPCS Lab Mitsuhisa Sato, Ph.D Professor (Cooperative Graduate School Program) of Department of Computer Science, Graduate School of Systems and Information Engineering / Fellow of Center for Computational Sciences, University of Tsukuba Deputy Director of RIKEN Center for Computational Science, Team leader of programming environment research team, R-CCS, RIKEN Contact information Mitsuhisa Sato, Team Leader of programming environment research team, RIKEN Center for Computational Science, 7-1-26, Minatojima-minami-machi, Chuo-ku, Kobe, Hyogo, 650-0047, Japan Email: msato@riken.jp Center for Computational Sciences, University of Tsukuba Tennou-dai 1-1-1, Tsukuba, Ibaraki 305-8577 Japan Phone: (+81)298-53-5532 Fax: (+81)298-53-6406 Email: msato@cs.tsukuba.ac.jp Research Interests Parallel Computing and High performance computing Parallel computer architectures and proramming models OpenMP compiler and programming Performance Evaluation and Benchmarking of parallel systems Low-power and power-aware computing Grid Computing Optimizing Compiler Education Mitsuhisa Sato received the M.S. degree and the Ph.D. degree in information science from the University of Tokyo in 1984 and 1990. Job history a researcher on computer architecture at Quantum Magneto Flux Logic Project at Research Development Corporation of Japan (JRDC) from 1986 to 1990. a senior researcher at Electrotechnical Laboratory, working on the EM-X multiprocessor project, from 1991 to 1996. a chief of Parallel and distributed system performance laboratory in Real World Computing Partnership, Japan, from 1996 to 2001. He was a leader of Omni OpenMP Compiler Project, which develops a free and portable OpenMP compiler for SMPs and clusters. From 2001, he was a professor of Graduate School of Systems and Information Engineering, University of Tsukuba. He has been working as a director of Center for computational sciences, University of Tsukuba from 2007 to 2013. Since October 2010, he is appointed to the research team leader of programming environment research team in Advanced Institute of Computational Science (AICS), renamed to R-CCS, RIKEN. From 2014 to 2020, he was working as a team leader of architecture development team in FLAGSHIP 2020 project to develop Japanese flagship supercomputer \"Fugaku\" in RIKEN. Since 2018, he is appointed to a deputy Director of RIKEN Center for Computational Science International activity a member of IEEE CS. a member of program committee of ACM International Conference on Supercomputing (ICS) '92, '93, '95. a member of program committee of International Conference on Parallel Architecture and compilation technique(PACT) '97. a publicity chair of International Conference on Parallel Architecture and compilation technique(PACT)'98,'99. a member of program committee of The Third International Symposium on computing in object-oriented parallel environments (ISCOPE) '99. a member of program committee of COOL-chips (An international Symposium on Low-power and High-speed chips) 1999, 2000. a co-chair of organizing committee of International Workshop on OpenMP: experience and implementation 2000. a member of program committee of HPC Asia 2000, 2001. a member of program committee of The Third European Workshop on OpenMP (EWOMP 2001). a member of program committee of The Workshop on OpenMP Applications and Tools (WOMPAT 2001). a member of Editorial Board of \"Parallel Computing\" published by Elsevier Science since 2000. a chair of organizing committee of International Workshop on OpenMP: experience and implementation 2003. a member of program committee of WOMPAT 2004. a member of program committee of GP2P 2004. a member of program committee of HCW 2004. a program chair of HPC Asia 2004 (Tokyo). a board member of Compunity (OpenMP users group) Japanese domestic activity a member of IPSJ (the Information Processing Society of Japan) and JSIAM (the Japan Society for Industrial and Applied Mathematics). a chair of the special interest group on HPC (SIGHPC) in IPSJ, Japan from 1997 to 2001. a board member of PC cluster Consortium since 2001. Fellow of IPSJ Teaching Since April 2001, I had the follwoing class teaching in the University of Tsukuba. a course on \"programming language processing\" teaching compiler and interpreter techniques for undergraduate students. a course on \"programming\" teaching basic programming in C for undergraduate students. a course on \"assembly programming\" teaching basic assembly programming for undergraduate students. a course on \"programming environment\" teaching Object-oriented design, distributed computing in Java, OpenMP and MPI for graduate students. a course on \"parallel and distributed programming\" teaching parallel and distributed computing and programmning such as OpenMP and MPI, Grid, Clusters for graduate students.",
  "content_length": 4882,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:49"
}