{
  "name": "Mizuki Oka",
  "homepage": "https://websci.cs.tsukuba.ac.jp/member/mizuki-oka",
  "status": "success",
  "content": "Mizuki Oka – Oka Laboratory Mizuki Oka – Oka Laboratory Member 岡 瑞起 Mizuki Oka 筑波大学システム情報系・准教授 筑波大学准教授。博士（工学）。IPA未踏IT人材発掘・育成事業PM。人工生命研究会主査。株式会社ブランクスペース技術顧問。人工生命技術、大規模言語モデルを使ったデータ分析・生成・活用の研究を行う。大学での研究をベースに、新しい技術の社会実装と、これまでにない視座を持ち込み、革新的な価値の提供に力をいれている。コミュニティを活性化するアルゴリズムの開発、オープンエンドなアルゴリズムの研究開発などを行っている。著書に「ALIFE | 人工生命 ―より生命的なAIへ」「作って動かすALife ―実装を通した人工生命モデル理論入門」がある。 Publications F. Aki, R. Ikeda, T. Saito, C. Regan, M. Oka “LLM-POET: Evolving Complex Environments using Large Language Models”, arXiv preprint arXiv:2406.04663, (June 2024) C. Regan, N. Iwahashi, S. Tanaka, M. Oka “Can Generative Agents Predict Emotion?”, arXiv preprint arXiv:2402.04232, (Feb. 2024) N. Iwahashi, J. Okabe, M. Suda, M. Oka “An Agent-based Model for Capturing Diverse Interactions in Social Networks” , IPSJ Transactions on Mathematical Modeling and Its Applications Vol.17 No.1 11–22 (Feb. 2024) M. Suda, T. Saito and M. Oka, “Agent-based model using adjacent possible space for generating waves of novelty,” 2022 IEEE Symposium Series on Computational Intelligence (SSCI), Singapore, Singapore, 2022, pp. 1251-1258, doi: 10.1109/SSCI51031.2022.10022147. T. Saito, H. Nishimura and M. Oka, “Comparative studies of evolutionary methods and RL for learning behavior of virtual creatures,” 2022 IEEE Symposium Series on Computational Intelligence (SSCI), Singapore, Singapore, 2022, pp. 1059-1065, doi: 10.1109/SSCI51031.2022.10022282. Naoki Maejima, Takumi Saito, Mikihiro Suda and Mizuki Oka, What Factors can Affect Taking Over Members' Own Inter-organizational Social Networks in Business Firm?, NetSci2022 (poster presentation) Teruto Endo, Hirotake Abe, Mizuki Oka, Toward automatic generation of diverse congestion control algorithms through co-evolution with simulation environments, Proc. of the 2022 Conference on Artificial Life, Paper No: isal_a_00515, 33; 8 pages, 2022. Mikihiro Suda, Takumi Saito, Mizuki Oka, Exploration and exploitation of the adjacent possible space for open-endedness, Proc. of the 2022 Conference on Artificial Life, Paper No: isal_a_00513, 31; 3 pages, 2022. Yasuhiro Hashimoto, Hiroki Sato, Mizuki Oka, Evolutionary Dynamics in Web-Service, AROB 2022, 2022 星野厚, 齊藤 拓己, 岡 瑞起, クラウドAIサービス推薦システムの提案,人工知能学会論文誌, vol.37(2), p. F-L65_1-8, 2022. Hiroki Sato, Yasuhiro Hashimoto, Mizuki Oka, Takashi Ikegami, Exploration in Evolutionary Space by Hashtag Evolution on a Social Network Service, Proc. of the 2021 Conference on Artificial Life, pp. 570-576, 2021. Teruto Endo, Hirotake Abe, Mizuki Oka, Towards automatic generation of congestion control algorithms by coevolving the environment. Proceedings of the Fourth Workshop on Open-Ended Evolution at ALIFE2021, 2021. Mikihiro Suda, Mizuki Oka, Evaluation of the effect of mimicry on facial expression in Avatar-Mediated Communication, Proc. of the 2021 Conference on Artificial Life, pp. 197-205, 2021. Hiroki Kojima, Dominique Chen, Mizuki Oka and Takashi Ikegami, Analysis and Design of Social Presence in a Computer-Mediated Communication System. Front. Psychol. 12:641927, 2021. Koya Sato, Mizuki Oka, Alain Barrat, Ciro Cattuto, Predicting partially observed processes on temporal networks by Dynamics-Aware Node Embeddings (DyANE). EPJ Data Sci. 10, 22 (2021). Koya Sato, Mizuki Oka, Alain Barrat and Ciro Cattuto Dynamics-aware node embedding for temporal networks, oral presentation at NetSci, 2020. Hiroki Sato, Itsuki Doi, Yasuhiro Hashimoto, Mizuki Oka, Takashi Ikegami, Selection and Accelerated Divergence in Hashtag Evolution on a Social Network Service, Proc. of the 2020 Conference on Artificial Life, pp. 535-540, 2020 Palin Choviwatana, Shota Ejima, Mizuki Oka, Takashi Ikegami, Web as an Evolutionary Ecosystem: Emergence of Keystone Species, Proc. of the 2020 Conference on Artificial Life, pp. 230-238, 2020. Alain Barrat, Ciro Cattuto, Mizuki Oka And Koya Sato, DyANE: Dynamics-Aware Node Embedding For Temporal Networks, accepted for oral presentation at CompleNet20, 2020 Choviwatana Palin, 木内 俊克, 岡 瑞起, 橋本 康弘, 小渕 祐介, 隈 研吾,自転車利用者の走行過程における面的な回遊特性把握を可能にする指標の提案,都市計画論文集, 54 巻 2 号, pp. 90-101, 2019. Koya Sato, Mizuki Oka, Alain Barrat, Ciro Cattuto, DyANE: Dynamics-aware node embedding for temporal networks, arXiv:1909.05976,2019. Koya Sato, Mizuki Oka, Kazuhiko Kato, Early turnover prediction of new restaurant employees from their attendance records and attributes, Proc. of the 30th DEXA Conferences and Workshop, pp.277-286, 2019. 西川 仁將, 岡 瑞起, 橋本 康弘, 池上 高志,Yule–Simon過程に基づくソーシャルタギングの分析とモデリング手法,人工知能学会論文誌, vol.34(4), pp.1-8, 2019. Shota Ejima, Mizuki Oka, Takashi Ikegami, Concept of Keystone Species in Web Systems: Identifying Small Yet Influential Online Bulletin Board Threads, Proc. of the 11th ACM Conference ​on Web Science, pp.81-85, 2019. Takashi Ikegami, Yasuhiro Hashimoto, Mizuki Oka, Open-ended evolution and a mechanism of novelties in web services, Artificial Life, Vol. 25, No. 2, pp.168-177, 2019. Koya Sato, Mizuki Oka, Kazuhiko Kato, Early Churn User Classification in Social Networking Service Using Attention-based Long Short-Term Memory, Proc. of the 14th Pacific Asia Workshop on Intelligence and Security Informatics, pp.45-56, 2019. Koya Sato, Yuji Sano, Mai Otsuki, Mizuki Oka, Kazuhiko Kato, Augmented Recreational Volleyball Court: Supporting the Beginners' Landing Position Prediction Skill by Providing Peripheral Visual Feedback, Proc. of the 10th Augmented Human International Conference, 9 pages, 2019. Atsushi Hoshino, Takumi Saito and Mizuki Oka, Inferencing the best AI service using Deep Neural Networks, Proc. of the 2nd International Conference on Information Science and System, pp.204-209, 2019. Koya Sato, Mizuki Oka, Yasuhiro Hashimoto, Takashi Ikegami and Kazuhiko Kato, How the Nature of Web Services Drive Vocabulary Creation in Social Tagging, Proc. of the 2nd International Conference on Information Science and System, pp.17-21, 2019. Mizuki Oka, Dominique Chen, Ryuta Aoki, and Takashi Ikegami, ALife as a Tool for Cooperative Society Between People and Machines, Proc. of the 2018 Conference on Artificial Life, pp.103-104, 2018. Yasuhiro Hashimoto, Mizuki Oka, Takashi Ikegami, Measuring Bursty Growth of Words in Social Tagging Ecosystems, ACM WebSci'18 conference, Proc. of the 10th ACM Web Science Conference, p.17, 2018. 江島 昇太、小杉 太一、岡 瑞起、三宅 雅矩、池上 高志、Hawkes Processを用いたSocial Tagging Systemにおけるバースト現象解析、2018年度人工知能学会全国大会（第32回） 橋本 康弘、岡 瑞起、池上 高志、ソーシャルタギングシステムに見られる特異的なタグの成長、2018年度人工知能学会全国大会（第32回） チェン ドミニク、小島 大樹、岡 瑞起、池上 高志、執筆記録情報を用いた行為主体性を持つコミュニケーション場のデザイン、2018年度人工知能学会全国大会（第32回） 佐藤晃矢、岡瑞起、加藤和彦、Newcomers churn prediction by the event sequence on social networking service、2018年度人工知能学会全国大会（第32回） 西川 仁將、岡 瑞起、橋本 康弘、池上 高志、ソーシャルタギングにおけるタグ出現数のゆらぎ、2018年度人工知能学会全国大会（第32回） 齊藤拓己、岡瑞起、加藤和彦、色彩調和に基づく衣類コーディネートシステムの提案、2018年度人工知能学会全国大会（第32回） Yasuhiro Hashimoto, Mizuki Oka, and Takashi Ikegami, Anomalous popularity growth in social tagging dynamics, CoRR abs/1711.02980, 2017 Hiroki Kojima, Tom Froese, Mizuki Oka, Hiroyuki Iizuka, Takashi Ikegami, A Sensorimotor Signature of the Transition to Conscious Social Perception: Co-regulation of Active and Passive Touch, Frontiers in Psychology, 8, 1778, 14 pages, 2017. Takashi Ikegami, Mizuki Oka, Yasuhiro Hashimoto, Yoichi Mototake, Life as an Emergent Phenomenon: Studies From Large-Scale Boid Simulation and Web Data, Philosophical Transactions of The Royal Society A Mathematical Physical and Engineering Sciences. 20160351, 10.1098/rsta.2016.0351, 15 pages, 2017. Mizuki Oka, Yasuhiro Hashimoto, and Takashi Ikegami, Understanding Evolutionary Dynamics in Online Social Networks. Proceedings of the 2017 IEEE Symposium Series on Computational Intelligence (SSCI), 10.1109/SSCI.2017.8280796, 4 pages, 2017. Yasuhiro Hashimoto, Mizuki Oka, and Takashi Ikegami, Large fluctuation in social tagging ecosystems, International Conference on Computational Social Science (IC2S2 2017), 2017. 三宅雅矩, 池上高志, 岡瑞起, 橋本康弘: Hawkes Processと最適区間幅推定を用いたWeb Dataの解析, 2017年度人工知能学会全国大会, 2017. 西川仁將, 岡瑞起, 橋本康弘, マルコヴィッチオメール, 池上高志: ソーシャルタギングの形質表現と進化メカニズム, 2017年度人工知能学会全国大会, 2017. 岡瑞起, 池上高志, 青木竜太, チェンドミニク: 人間と情報技術の共進化を目指す共創コミュニティALife Lab．の構築, 2017年度人工知能学会全国大会, 2017. 中垣内千晶, 橋本康弘, 岡瑞起, 加藤和彦: VRと足裏触覚を用いたアテンション操作によるリダイレクテッド・ウォーキング, 2017年度人工知能学会全国大会, 2017. 佐藤晃矢, 岡瑞起, 橋本康弘, 池上高志, 加藤和 彦: SNSにおけるユーザ参加期間とタグ生成・利用の関係, 2017年度人工知能学会全国大会, 2017. 橋本康弘, 佐藤晃矢, 岡瑞起, 池上高志: ソーシャルタギングシステムにおける語彙の個性, 2017年度人工知能学会全国大会, 2017. 江島昇太, 岡瑞起, 橋本康弘, 加藤和彦: SNS におけるユーザの行動のモチベーション要因の分析, 2017年度人工知能学会全国大会, 2017. 小島大樹, 岡瑞起, 飯塚博幸, 池上高志: 他者の存在感を生むダイナミクスの解析, 日本物理学会第71回年次大会, 2016. 佐藤晃矢, 岡瑞起, 橋本康弘, 池上高志: ソーシャルネットワークサービスのダイナミクスにみる、ゆらぎ、応答、進化: 日本物理学会第71回年次大会, 2016. 岡瑞起, 池上高志: ウェブにおける生命性の指標について, 2016年度人工知能学会全国大会, 2016. 佐藤晃矢, 岡瑞起, 橋本康弘, 池上高志, 加藤和彦: 新しいタグの出現とソーシャルタギングシステム, 2016年度人工知能学会全国大会, 2016. 西川仁將, 岡瑞起, 橋本康弘, 池上高志: ソーシャルタギングの形質表現と進化メカニズム, 2016年度人工知能学会全国大会, 2016. 橋本康弘, 佐藤晃矢, 岡瑞起, 池上高志: ソーシャルタギングにおけるタグ出現数のゆらぎ, 2016年度人工知能学会全国大会, 2016. Aisen Caro Chacin, Maša Jazbec, Mizuki Oka, Itsuki Doi, BIRD SONG DIAMOND: Call and Response and Phase Transition work, Proceedings of the The Twenty-First International Symposium on Artificial Life and Robotics 2016 (AROB 21st 2016), pp.310, 2016. Tim Taylor, Joshua E. Auerbach, Josh Bongard, Jeff Clune, Simon Hickinbotham, Charles Ofria, Mizuki Oka, Sebastian Risi, Kenneth O. Stanley, Jason Yosinski：WebAL Comes of Age: A review of the first 21 years of Artificial Life on the Web, Artificial Life, Vol.22, pp.364-407, 2016. 岡瑞起, 伊原頌二, 池上高志: Hawkes Processによるソーシャルネットワーク時系列のモデル化, 日本物理学会第70回年次大会, 2015. 丸山典弘, 岡瑞起, 阿部洋丈, 池上高志: TCP/IP Network及びEcho State Networkを用いた学習機モデル, 2015年度人工知能学会全国大会, 2015. 岡瑞起, 池上高志: Modeling Temporal Dynamics on Social Media, 2015年度人工知能学会全国大会, 2015. 池上高志, 岡瑞起: MDFの示す生命性について, 2015年度人工知能学会全国大会, 2015. 橋本康弘, 佐藤晃矢, 岡瑞起: Zipf's Law and Heap's Law in Social Tagging, 2015年度人工知能学会全国大会, 2015. 佐藤晃矢, 岡瑞起, 橋本康弘, 加藤和彦: Yule-Simon過程によるタグ共起ダイナミクスのモデル化と分析, 2015年度人工知能学会全国大会, 2015. Mizuki Oka, Hirotake Abe, and Takashi Ikegami, Dynamic Homeostasis in Packet Switching Networks, Proceedings of the 13th European Conference on ",
  "content_length": 18032,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:50"
}