{
  "name": "Mo El-Haj",
  "homepage": "https://elhaj.uk",
  "status": "success",
  "content": "Dr Mo El-Haj Reader (Associate Professor) in NLP. Director of the NLP @ VinUniversity Research Group College of Engineering & Computer Science VinUniversity, Hanoi, Vietnam CECS VinUniversity Ocean Park, Hanoi Vietnam. elhaj.m@vinuni.edu.vn Résumé 🤗 About Hello, I'm Dr. Mo El-Haj. I'm the Director of NLP @ VinUniversity Research Group and a Reader (Associate Professor) in NLP at the College of Engineering & Computer Science, VinUniversity, Hanoi, Vietnam. Currently, I'm on a visiting research role at Lancaster University, but I'm based in Hanoi, Vietnam. I am the Director of the VinUniversity NLP Group. My doctoral research, completed at The University of Essex, focused on Arabic Multi-document Summarisation. I specialise in Summarisation, Information Extraction, Financial NLP, and multilingual NLP, with a particular focus on languages such as English, Arabic, Spanish, Portuguese, Welsh, among others. I'm particularly passionate about under-resourced languages and the development of NLP datasets. Research Interests Natural Language Processing (NLP), Language Resources, Data Science, Health and Medicine, Biomedical NLP, Text Summarization, Corpus and Computational Linguistics, Financial NLP and FinTech, Machine Learning on Text Classification, Crowd-sourcing and Information Extraction. Current PhD Students Nguyen Huy Hung. Mutlimodal biomedical NLP Gigi Alshahrani. Scope For Using Machine Learning to Detect Offensive Content in Different Arabic Dialects Salim Al Mandhari. Arabic Automatic Readability Assessment Damith Dola Mullage. PhD Title: Deep Learning models to identify ethical misconducts in legal documents Jesse Phillips. PhD Title: The Automated Generation of Meaningful and Coherent Source Code Documentation Using Natural Language Processing Techniques Previous PhD Students Dr Chiamaka Chukwuneke. PhD Title: Named entity recognition for African Languages: a focus on Igbo Dr Nadhem Zmandar. PhD Title: Multilingual Financial Summarization PhD Supervision If you are interested in a PhD under my supervision please visit the link below which contains important information to help you with your application: PhD Supervision Information (read before you email me) I am interested in supervising PhD students on research topics related to: Natural Language Processing (NLP) Arabic and multilingual NLP Financial NLP and FinTech Biomedical NLP Information Extraction and document structure detection Automatic Text Summarization (Extractive, Abstractive) Text Machine Learning, Classification and Clustering Corpus and Computational Linguistics Language and dialect identification PhD External Examiner for: Dr Mary Fouad (University of Sussex, England, UK) Dr Abdullah Alsaleh (University of Leeds, England, UK) Dr Fatimah Al-Qahtani (King's College London (KCL), England, UK) Dr Taghreed Tarmom (University of Leeds, England, UK) Dr Alaa Alqahtani (University of Birmingham, England, UK) Dr Chatrine Qwaider (University of Gothenburg, Göteborg, Sweden) Dr Mohammed Hamed Altamimi (Bangor University, Wales, UK) Dr Maher Itani (Sheffield Hallam University, England, UK) PhD Internal Examiner for: Dr Matthew Coole (Lancaster University, England, UK) Dr Edward Dearden (Lancaster University, England, UK) Dr Lama Alsudias (Lancaster University, England, UK) Dr Ronghui Mu (Lancaster University, England, UK) [Chair] Education Ph.D. in Computer Science, 2012 University of Essex M.Sc. in Information Systems, 2008 University of Jordan B.Sc. in Computer Information Systems, 2005 University of Jordan Awards Fellowship of the Higher Education Academy (FHEA) - Advance HE , UK, 2021. Winning team for the best audience-facing tool - BBC NewsHack event , London, 2016. Fully funded Internship at the National Institute of Informatics, Tokyo, Japan, 2011. Best Paper Award at the 4th LTC Conference, Poznan, Poland, 2009.",
  "content_length": 3851,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:50"
}