{
  "name": "Mo Sha 0001",
  "homepage": "https://users.cs.fiu.edu/~msha",
  "status": "success",
  "content": "Mo Sha's Homepage Home | Research | Publications | Students | Services | Teaching| Google Scholar Profile Mo Sha Associate Professor Knight Foundation School of Computing and Information Sciences Florida International University Office: INV1 459 Email: msha AT fiu.edu Phone: (305)348-1717 Mailing Address: 11200 SW 8th St, CASE 382, Miami, FL 33199 Biography I am an Associate Professor in the Knight Foundation School of Computing and Information Sciences at Florida International University (FIU). Before joining FIU, I was an Assistant Professor at Binghamton University - State University of New York. I received my Ph.D. degree in Computer Science from Washington University in St. Louis, my M.Phil. degree from City University of Hong Kong, and my B.Eng. degree from Beihang University. My research interests include wireless networking,  Internet of Things, machine learning, and network security. I am a NSF CAREER awardee, a NSF CRII awardee, an ACM Senior and Lifetime Member, and a Sigma Xi Member and membership reviewer. I am looking for self-motivated PhD students! Prospective students with interest and expertise in wireless networking, Internet of Things, applied machine learning, network security, and cyber-physical systems are welcome to contact me through email. Recent News [Paper] Our paper \"MMFNet: Multi-Scale Frequency Masking Neural Network for Time Series Forecasting\" has been accepted to SAC'26. [Service] Serve as the TPC member for DCOSS-IoT'26. Please consider submitting your paper; Call for Papers. [Service] Serve as the TPC member for SECON'26. Please consider submitting your paper; Call for Papers. [Service] Serve as the TPC member for ICC'26. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"LLM-Driven Diagnosis and Adaptive Policy Optimization for Reducing Packet Error Rate in LoRaWAN Networks\" has been accepted to ICMLA'25. [Service] Serve as the TPC member for ICPADS'25. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for INFOCOM'26. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for SAC'26 Cyber-Physical Systems Track. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for ICDCN'25. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for LCN'25. Please consider submitting your paper; Call for Papers. [Service] Join the editorial board of ACM Transactions on Cyber-Physical System and serve as an associate editor. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Sensorless Air Temperature Sensing Using LoRa Link Characteristics\" has been accepted to DCOSS-IoT'25. [Paper] Our paper \"LoRa-Based Energy-Harvesting Sensing System for Living Environment\" has been accepted to MetroLivEnv'25. [Service] Serve as the TPC member for MASS'25. Please consider submitting your paper; Call for Papers. [Service] Serve as the TPC member for RTCSA'25. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"WMN-CDA: Contrastive Domain Adaptation for Wireless Mesh Network Configuration\" has been accepted to SAC'25. [Service] Serve as a TPC member for ICC'25. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Configuring Industrial Wireless Mesh Networks via Multi-Source Domain Adaptation\" has been accepted to EWSN'24. [Service] Serve as a TPC member for DCOSS-IoT'25. Please consider submitting your paper; Call for Papers. [Service] Serve as one of the guest editors for IEEE Network Special Issue on Cyber-Physical Security for Cloud and Fog-Hosted Industrial Cyber-Physical System; Call for Papers. [Service] Serve as the TPC member for SAC'25 Cyber-Physical Systems Track. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for SECON'24. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for INFOCOM'25. Please consider submitting your paper; Call for Papers. [Service] Serve as the TPC track chair (Theory and Protocol) for ICPADS'24. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Enabling Reliable Environmental Sensing with LoRa, Energy Harvesting, and Domain Adaptation\" has been accepted to ICCCN'24. [Paper] Our paper \"MERA: Meta-Learning Based Runtime Adaptation for Industrial Wireless Sensor-Actuator Networks\" has been accepted for publication in ACM Transactions on Sensor Networks. [Service] Serve as a TPC member for MASS'24. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for EWSN'24. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Parametric Augmentation for Time Series Contrastive Learning\" has been accepted to ICLR'24. [Paper] Our paper \"Adapting Wireless Network Configuration from Simulation to Reality via Deep Learning based Domain Adaptation\" has been accepted for publication in IEEE/ACM Transactions on Networking. [Service] Serve as the TPC member for AAAI'24. Please consider submitting your paper; Call for Papers. [Service] Serve as the TPC member for DCOSS-IoT'24. Please consider submitting your paper; Call for Papers. [Service] Serve as the TPC member for ICC'24. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"AutoTCL: Automated Time Series Contrastive Learning with Adaptive Augmentations\" has been accepted to AI4TS'23 and received the best paper award. [Service] Serve as the TPC member for SAC'24 Cyber-Physical Systems Track. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for INFOCOM'24. Please consider submitting your paper; Call for Papers. [Award] Received an award ($2.5M) to establish the Center for Agile and Intelligent Power Systems (CAIPS): Cybersecurity Research, Development, and Workforce Training (2024-2026, award announcement). Thank DoE CESER. [Paper] Our paper \"Meta-Learning Based Runtime Adaptation for Industrial Wireless Sensor-Actuator Networks\" has been accepted to IWQoS'23. [Service] Serve as a TPC member for SECON'23. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for IWQoS'23. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for EWSN'23. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for ISORC'23. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Enabling Direct Message Dissemination in Industrial Wireless Networks via Cross-Technology Communication\" has been accepted to INFOCOM'23. [Paper] Our paper \"Revealing Smart Selective Jamming Attacks in WirelessHART Networks\" has been accepted for publication in IEEE/ACM Transactions on Networking. [Service] Serve as the TPC member for ICDCS'23. Please consider submitting your paper; Call for Papers. [Service] Serve as the TPC member for DCOSS-IoT'23. Please consider submitting your paper; Call for Papers. [Service] Serve as the TPC member for SAC'22 Cyber-Physical Systems Track. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Autonomous Traffic-Aware Scheduling for Industrial Wireless Sensor-Actuator Networks\" has been accepted for publication in ACM Transactions on Sensor Networks. [Service] Serve as the Local Arrangement Chair for NOMS'23. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"TrafficSpy: Disaggregating VPN-encrypted IoT Network Traffic for User Privacy Inference\" has been accepted to CNS'22. [Service] Serve as a TPC member for ICC'23. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for ICESS'22. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Localizing Campus Shuttles from One Single Base Station Using LoRa Link Characteristics\" has been accepted to ICCCN'22. [Service] Serve as a TPC member for INFOCOM'23. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for SenSys'22. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for SECON'22. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for NAS'22. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for EWSN'22. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Enabling Cross-technology Communication from LoRa to ZigBee in the 2.4 GHz Band\" has been accepted for publication in ACM Transactions on Sensor Networks. [Service] Serve as a TPC member for ICCCN'22. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for ICDCS'22. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"ATRIA: Autonomous Traffic-Aware Transmission Scheduling for Industrial Wireless Sensor-Actuator Networks\" has been accepted to ICNP'21. [Service] Serve as a TPC member for DCOSS'22. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for ISORC'22. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member for SAC'22 Cyber-Physical Systems Track. Please consider submitting your paper; Call for Papers. [Student] My second PhD student Di Mu has graduated and will join Rice University as a research engineer. Congratulations, Dr. Mu! [Service] Serve as a TPC member for ICPADS'21. Please consider submitting your paper; Call for Papers. [Paper] Our paper \"Enabling Cross-technology Communication from LoRa to ZigBee via Payload Encoding in Sub-1 GHz Bands\" has been accepted for publication in ACM Transactions on Sensor Networks. [Student] My first PhD student Junyang Shi has graduated and joined Bloomberg as a software engineer. Congratulations, Dr. Shi! [Service] Serve as a TPC member for INFOCOM'22. Please consider submitting your paper; Call for Papers. [Service] Serve as a TPC member f",
  "content_length": 18866,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:52"
}