{
  "name": "Mohammad Masudur Rahman 0001",
  "homepage": "https://web.cs.dal.ca/~masud",
  "status": "success",
  "content": "Masud Rahman, PhD | Dalhousie University Masud Rahman, Ph.D. Associate Professor, Faculty of Computer Science, Dalhousie University, Canada \"And say: My Lord increase me in knowledge.\" -(The Qur'an, Ta-Ha 20:114) Follow @masud2336 Short Bio Dr. Masud Rahman is an Associate Professor in the Faculty of Computer Science at Dalhousie University. He received his Ph.D. in Computer Science/Software Engineering from the University of Saskatchewan and was advised by Prof. Dr. Chanchal Roy. He completed his Postdoc at the Polytechnique Montreal and was advised by Prof. Dr. Foutse Khomh. Dr. Rahman leads the RAISE Lab at Dalhousie University. He is interested in the intelligent automation of software maintenance and evolution. Once a software product is released, it enters into the maintenance phase and goes through various major or minor changes. These changes (a.k.a., maintenance activities) can be triggered by several factors including post-release bugs, requests for new features, or even by the need to adapt to new technologies (e.g., Generative AI). Unfortunately, these activities have never been easy despite 40+ years of extensive research! Software maintenance activities claim up to ~50% of the developers' time and cost the global economy billions of dollars every year. For example, in 2017 alone, the global economy lost $1.7+ trillion due to software bugs, crashes, and failures. With the rise of popular but highly complex computing frameworks such as Large Language Models (LLM), Agentic AI, Deep Learning, Cloud Computing, and Mobile Computing, software maintenance has become even more challenging and costlier. Masud's research program aims to (a) better understand the challenges of software bugs, crashes, vulnerabilities, and technical debt, and (b) design cost-effective, cutting-edge, AI-powered solutions to tackle them effectively. From a technical perspective, Dr. Rahman and his team (a) study the characteristics, symptoms, and root causes of software bugs to advance the current state of understanding and (b) develop novel tools and techniques to automatically detect, diagnose, explain, and reproduce bugs or crashes from not only traditional but also AI-powered and simulation modelling software. In essence, his research opportunistically marries Artificial Intelligence (AI) and Software Engineering (SE) to tackle a challenge plaguing the software industry for decades. Using this unique research program, Masud aims to advance one of Dalhousie’s strategic goals– Advanced AI & Digital Innovation, especially Sustainable Software Innovation and Sustainable AI. His research interests have been significantly shaped by his three years of experience as a professional developer in the software industry. Please check the RAISE Lab to learn more about his research. To date, Masud has published 59 research papers, and his works got accepted in several major venues of Software Engineering including ICSE (A*), ESEC/FSE (A*), ASE (A*), TOSEM (A*), EMSE (A), ICSME (A), MSR (A) and SANER (A). Dr. Rahman received multiple prestigious awards such as Governor General's Gold Medal, U of S Doctoral Thesis Award, TCSE Distinguished Paper Award, Most Influential Paper Award, Dr Keith Geddes Award, Dalhousie Belong Research Fellowship, and the prestigious President's Gold Medal (Bangladesh) for his research excellence and outstanding academics. To date, Masud's work received $475K+ (PI) and 4.3M+ (Co-PI, Co-applicant) in competitive research funding from various sources including NSERC Discovery Grant, Mitacs Accelerate International, NSERC Alliance, Climate Action and Awareness Fund, and Dalhousie Startup Fund. Taught Courses CSCI 3130 (Winter 2025) CSCI 3130 (Fall 2024) CSCI 3130 (Winter 2024) CSCI 3130 (Fall 2023) CSCI 3130 (Winter 2023) CSCI 3130 (Fall 2022) CSCI 3130 (Winter 2022) CSCI 3130 (Fall 2021) CSCI 3130 (Winter 2021) CSCI 3130 (Fall 2020) CSCI 6308 (Winter 2024) CSCI 6308 (Winter 2023) CSCI 6308 (Winter 2022) Check teaching effectiveness. Masud on Media Futurum Careers Magazine EASE 2025 - Research paper spotlight! Dalhousie News CGPS 75 Magazine, University of Saskatchewan Department of Computer Science University of Saskatchewan Stack Overflow Blog Dr. Rahman is serving as a Guest Editor of EMSE Special Issue for SANER 2025. Please consider submitting your high-quality articles there! PC Chair SANER 2025 (Program Co-chair) CSER 2025 (Program Co-Chair) ISEC 2022 (Track Co-chair, Student Research Competition) PC Member MSR 2026 ICPC 2026 ASE 2025 FSE 2025 MSR 2025 FSE 2024 ASE 2024 ASE 2024 (NIER) ASE 2024 (Artifact) ICSE 2024 (Demo) MSR 2024 SANER 2024 ICPC 2024 (ERA) ACM SRC 2024 SCAM 2024 SCAM 2024 (NIER) ESEC/FSE 2023 (SRC) ESEC/FSE 2023 (Artifact) ASE 2023 (NIER) ICSME 2023 (NIER) SCAM 2023 (NIER) MSR 2023 Check all service records. OC Chair Proceedings Chair, ICPC 2026 Publicity & Social Media Co-Chair, MSR 2022 Virtualization Co-Chair, MSR 2021 Proceedings Chair, SCAM 2020 Web Chair, SCAM 2019 Web Chair, ICPC 2018 Journal Reviewer TSE TOSEM EMSE CSUR JSS JSME IST SCP SQJ AUSE TDSC TR JSPE FCDS Check out Masud's: CV publications awards taught courses services released artifacts Breaking News 2025 November 2025: Our SANER 2016 paper - RACK: Automatic API Recommendation using Crowdsourced Knowledge -- has been nominated for Most Influential Paper Award 2026 November 2025: Mehil won Distinguished Review Award (Shadow PC) from ICSE 2026 November 2025: Asif won 3rd place in Cognizant BrAInstorm Challenge November 2025: NSERC DG submitted! November 2025: Citations reached 2000! October 2025: Sigma defended her PhD proposal. October 2025: Our technical paper - Why Attention Fails: A Taxonomy of Faults in Attention-Based Neural Networks - got accepted at ICSE 2026 (A*). Check pre-print. September 2025: Dr. Masud Rahman and RAISE Lab were featured at Futurum Careers Magazine September 2025: Our journal article - BugMentor: Generating Answers to Follow-up Questions from Software Bug Reports using Structured Information Retrieval and Neural Text Generation - got accepted at JSS (A) September 2025: Our work - Recommending Insightful Comments for Source Code using Crowdsourced Knowledge - from SCAM 2015 received Most Influential Paper Award from SCAM 2025 August 2025: Riasat defended his MCS thesis. August 2025: Our journal article - Towards Understanding the Impact of Data Bugs on Deep Learning Models in Software Engineering - got accepted at EMSE (A). Pre-print link: link July 2025: Our journal article - Towards Understanding the Challenges of Bug Localization in Deep Learning Systems - got accepted at EMSE (A). Pre-print: link June 2025. Our work - Understanding the Impact of Domain Term Explanation on Duplicate Bug Report Detection - received spotlight at EASE 2025 to be held in Istanbul, Turkey June 2025: Masud got tenured and was promoted to Associate Professor, Faculty of Computer Science May 2025: Mehil received the Best Presentation Award and Asif received the Best Poster Award at CSER 2025 April 2025: Asif Samir passed his RAD exam with flying colours! April 2025: Digital Research Alliance of Canada Grant was awarded (with Dr. Tushar Sharma) April 2025: Our journal-first paper - Towards Enhancing the Reproducibility of Deep Learning Bugs: An Empirical Study - got accepted at FSE 2025 (A*) March 2025: Our technical paper - Understanding the Impact of Domain Term Explanation on Duplicate Bug Report Detection - got accepted at EASE 2025 (A) March 2025: Our vision paper - Can Hessian-Based Insights Support Fault Diagnosis in Attention-based Models? - got accepted at FSE 2025 (A*) January 2025: Our technical paper - Improved Detection and Diagnosis of Faults in Deep Neural Networks Using Hierarchical and Explainable Classification - got accepted at ICSE 2025 (A*). January 2025: Our technical paper - Improved IR-based Bug Localization with Intelligent Relevance Feedback - got accepted at ICPC 2025 (A). January 2025: Our ERA track paper - Towards Enhancing IR-based Bug Localization Leveraging Texts and Multimedia from Bug Reports - got accepted in ICPC 2025 (A). January 2025: Our journal article - Towards Understanding the Impact of Data Bugs on Deep Learning Models in Software Engineering - received a major revision from EMSE (A). January 2025: Our journal article - BugMentor: Generating Answers to Follow-up Questions from Software Bug Reports using Structured Information Retrieval and Neural Text Generation - received major revision from JSS (A). 2024 December 2024: Dr. Rahman has been nominated for SCAM steering committee membership. Thanks to SCAM community for their support! December 2024: Mehil Shah passed his RAD exam! October 2024: Our journal article -- Towards Enhancing the Reproducibility of Deep Learning Bugs: An Empirical Study - got accepted at EMSE (A). Please click here for the pre-print. August 2024: Our RT paper - On the Prevalence, Evolution, and Impact of Code Smells in Simulation Modelling Software - got accepted at SCAM 2024 July 2024: Our journal article - Towards Understanding the Challenges of Bug Localization in Deep Learning Systems - received a major revision from EMSE (A). July 2024: Completed our collaboration work with Drinkable! May 2024: Thanks to the students of CSCI 3130 and CSCI 6308 for their high-quality feedback and SLEQ ratings. More details can be found here April 2024: Lareina Yang defended her honours thesis with flying colors. March 2024: Masud Rahman will serve as a Program Co-Chair of SANER 2025, Montreal. March 2024: Digital Research Alliance of Canada Grant was awarded (with Dr. Tushar Sharma) March 2024: MITACS GRI Fellowship was awarded. March 2024: Sigma Jahan, PhD student, received OpenThinker Award from Dalhousie University March 2024: Sigma Jahan, PhD student, received Best TA Award from the Faculty of Computer Science January 2024: Our collaborative work - Can We Identify Stack Overflow Questions Requiring Code Snippets? Investigating the Cause & Effect of Missing Code S",
  "content_length": 19405,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:18"
}