{
  "name": "Mohammad Izadi",
  "homepage": "http://sharif.edu/~izadi",
  "status": "success",
  "content": "Mohammad Izadi Mohammad Izadi Sharif University of Technology About Me Professional Backgrounds Teaching Graduate-level Students Publications Contact Information Mohammad Izadi Department of Computer Engineering Sharif University of Technology, Tehran, Iran Present Status Associate Professor, Department of Computer Engineering, Sharif University of Technology, Tehran, Iran. Director of Distributed and Multiagent Systems Lab (DiSysLab), Department of Computer Engineering, Sharif University of Technology, Tehran, Iran. Education Ph.D. 2011 Ph.D. in Computer Science Leiden Institute of Advanced Computer Science, Leiden University, The Netherlands. Dissertation: Model Checking of Component Connectors. Ph.D. 2008 Ph.D. in Computer Engineering Sharif University of Technology, Tehran, Iran. Dissertation: An Integrated Formal Method for Specification and Verification of Component-Based Systems. M.S. 2002 M.Sc. in Computer Engineering Sharif University of Technology, Tehran, Iran. Thesis: Mu-Calculus Model Checking. M.S. 1998 M.Sc. in Philosophy of Science Sharif University of Technology, Tehran, Iran. Thesis: Oddie's Theory on Truthlikness. B.S. 1995 B.Sc. in Computer Engineering Sharif University of Technology, Tehran, Iran. Diploma 1991 1991: Social Economics 1990: Mathematics and Physics Research Interests Distributed and Multiagent Systems: Algorithms, Formal (logical and game theoretic) Analysis, Simulation and Implementation Logic in Computer Science and Artificial Intelligence: Modal and Temporal Logics, Systems and Software Verification, Model Checking Game Theory for Computer Science: Game Theoretic Analyses of Distributed Systems, Algorithmic Game Theory Computational Linguistics and Natural Language Processing: Machine Learning in Computational Linguistics, Formal Semantics, Knowledge Reprsenation Programming Languages: Semantics and Formal Analysis, Functional Programming, Type Systems Theory of Automata, Algorithms and Complexity Combinatorial Optimization and Computational Geometry Philosophy of Artificial Intelligence, Language and Mind Teaching Summary Garduate Level Theory of Distributed Systems Game Theory for Computer Science Algorithmic Game Theory Theory of Computational Complexity Verification of Reactive Systems Advanced Algorithms Logic and Computability Philosophy of Comutation and Information Philosophy of Science I: Scientific Theory and It's Evidences Undergradute Level Programming Languages: Design and Implementation Theory of Formal Languages and Automata Theory of Computation Logic for Computer Science and Engineering Discrete Mathematics Data Structures and Algorithms Design and Analysis of Algorithms Design of Compilers Computer Foundations and Advanced Programming with C/C++ Teachings by Date Fall 2019 Theory of Distributed Systems Spring 2019 Theory of Distributed Systems Fall 2018 Algorithmic Game Theory Spring 2018 Theory of Distributed Systems Fall 2017 Algorithmic Game Theory Spring 2017 Logic for Computer Science and Engineering Fall 2016 Theory of Distributed Systems Fall 2019 Programming Languages: Design and Implementation Spring 2019 Theory of Computation Fall 2018 Programming Languages: Design and Implementation Spring 2018 Fall 2017 Theory of Automata and Languages Spring 2017 Theory of Automata and Languages Fall 2016 Discrete Mathematics Publications Under Construction. For short time, you can have a look at my Google Scholar publication list, while it is not complete and in particular it doesn't contain my persian publications: Google Scholar Garduate-level Students (Supervision) PhD Graduated Sattar Sattari Thesis Title: Minimum Dilation Triangulation Problem in the Plane PhD Graduated Mehran Tarahomi Thesis Title: A hybrid method based on scheduling and load balancing to reduce the energy consumption in cloud networks PhD Graduated Ehsan Shoja Thesis Title: A Game Theoretic Approach to Distributed Computing PhD Garduated Ali BakhtHemmat Thesis Title: Binary Integer Programming By A Situation Recognizing-Based Provident Greedy Method PhD Garduated Fereshteh Jadidi Joint supervision with Dr. AliAsghar Nazari Shirejini Thesis Title: Dynamic User-System Conflict Detection in Mixed-Initiative Smart Homes PhD Current MohammadReza Besharati Thesis Title: Semantics Based Compliance Solving PhD Current AliReza Farhadi Joint supervision with Prof. Jafar Habibi Thesis Title: A Theory of Compliance with Reference in Reo Coordination Models PhD Current Shohreh Tabatabaeei Seifi Thesis Title: An Imperative Programming-Based Semantics for Natural Language Discourse PhD Current Afrooz Vazifedan Thesis Title: Learning methods in Predicting the Outcome of Repeated Games PhD Current Hajar Siar Thesis Title: Resource management and scheduling of workflows in edge-based infrastructures PhD Current Hassan Esmkhan Thesis Title: Clustering for Large-Scale Datasets PhD Current Masoumeh Soleimani Thesis Title: MSc Garduated Mohammad Amin Rayej Thesis Title: Developing a simulator for concurrent execution of multiple workflows in fog computing environment MSc Garduated Seyyed Ali Mohammadi Thesis Title: Modeling and simulation of Edge computing environments via Device-to-device communication method MSc Garduated Vahid Shahrivari Thesis Title: Persian query corrector based on deep learning (With emphasis on spatial queries) MSc Graduated Reza Sanginian Thesis Title: Code Generation of AKKA Actors from Reo Coordination Models MSc Graduated Kiavash Naji Thesis Title: Natural Language Inference in Persian Texts based on Natural Logic MSc Graduated Hamid Azami Thesis Title: Automatic extraction of Persian named entities’ knowledge graph from web sources MSc Graduated Fatemeh MohammadMahdiPour Thesis Title: Analysis of resource allocation in federated Clouds using game theoretic approach MSc Graduated Mitra MirAhmadi Thesis Title: Using Automata of Records as the Semantics of BIP Coordination Model MSc Graduated Mostafa Mohajeri Parizi Thesis Title: A game-theoretic approach to resource management in distributed cloud environments MSc Graduated Zeinab Liaghat Thesis Title: Formalizing reference architecture using their styles for conformance checking MSc Graduated Sattar Hazrati Thesis Title: Efficient Algorithm for Network Motifs Discovery MSc Graduated Ali AhmadZadeh Asl Thesis Title: Hybrid Design of Recommender Systems MSc Graduated More than 10 others Professional Backgrounds Dec. 2016 Dec. 2021 Dean of Education, Sharif University of Technology Sep. 2011 Now Associate Professor of Computer Engineering, Sharif University of Technology Dec. 2018 Sep. 2021 Dean of Education, Iranian Society of Engineering Education Dec. 2018 Now Vice-chairman, Sharif University of Technology Branch, Iranian Society of Engineering Education Sep. 2014 Dec. 2016 Vice-chairman for Education, Department of Computer Engineering, Sharif University of Technology Apr. 2009 Sep. 2011 Dean of Research Affaires, Institute for Humanities and Cultural Studies (IHCS) Jan. 2009 Sep. 2011 Head of Philosophy of Science Department, Institute for Humanities and Cultural Studies (IHCS) Dec. 2008 Sep. 2011 Assistant Professor, Philosophy of Science Department, Institute for Humanities and Cultural Studies (IHCS) Mar. 2001 Dec. 2008 Faculty Member and Instrucor, Philosophy of Science Department, Institute for Humanities and Cultural Studies (IHCS) Feb. 2006 May 2006 Research Visitor, School of Computer Science, University of Birmingham, UK Sep. 2003 Sep. 2006 Research Assistant, School of Computer Science, Institute for Studies in Theoretical Physics and Mathematics (IPM) Mar. 1998 Sep. 2002 Research Assistant, Iranian Academy of Philosophy Contact & Meet Me I would be happy to talk to you if you need my assistance in your research or academic education. I prefer to communicate through my Sharif email. Administration Affairs Tel: +98 21 66165060 Fax: +98 21 66165060 izadi@sharif.ir Reserach and Teaching Affairs Tel: +98 21 66166649 Fax: +98 21 66166649 izadi@sharif.edu At My Office You can find me at my administrative office (Room 204 located at the building of the vice-presidency for education affairs of the university) or my personal office (Room 719 in computer engineering department building). I am at one of my offices between 7 am to 6 pm, all working days!!, but you may consider an email to fix an appointment (surely I prefer to see you after reading your email containing a brief of your problem and setting an appointment) . At My Home Really? Is it that urgent? My door is always open to guests ... if they can find the door!",
  "content_length": 8569,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:17"
}