{
  "name": "Mohammad Alizadeh",
  "homepage": "https://people.csail.mit.edu/alizadeh",
  "status": "success",
  "content": "Mohammad Alizadeh Home CV Research Publications Talks/Slides Teaching 6.888 6.829 Mohammad Alizadeh Mohammad Alizadeh Associate Professor Computer Science & Artificial Intelligence Laboratory Department of Electrical Engineering and Computer Science MIT 32 Vassar Street, 32-G920 Cambridge, MA 02139 Email: alizadeh@csail.mit.edu I am an Associate Professor in the EECS Department at MIT, and a member of CSAIL. Before joining MIT, I completed my Ph.D. at Stanford University, and spent a couple of years at a datacenter networking startup, Insieme Networks, and Cisco. You can find my CV here. Research: I work in the areas of computer networks and systems. My research aims to improve the performance, robustness, and ease of management of future networks and cloud computing systems. My current research centers on network protocols and algorithms for large-scale datacenters, programmable switching architectures, and learning-based networked systems. I am also broadly interested in performance modeling and analysis of computer systems and bridging theory and practice in computer system design. A full list of papers is available here. If you are interested in working with me: Please apply to the EECS graduate program and mention my name in your application. If you are already at MIT, please send me an email and we can arrange a time to meet. Recent News CCP and Homa accepted to SIGCOMM 2018. RoadTracer accepted to CVPR 2018. I was awarded the NSF CAREER Award for proposal on data-driven network resource management systems. CCP (a datapath-agnostic congestion control plane) and ABC (congestion control for cellular networks) accepted to HotNets 2017. Honored to win the 2017 SIGCOMM Rising Star Award. Pensieve (adaptive video streaming with reinforcement learning), Marple (language-directed hardware design for network performance monitoring), and dRMT (disaggregated programmable switch architecture) accepted to SIGCOMM 2017. Honored to be selected for a 2017 Sloan Research Fellowship. Teaching 6.829: Computer Networks, Fall 2018. 6.02: Intro to EECS II: Digital Communication Systems, Fall 2017. 6.829: Computer Networks, Fall 2016. 6.888: Advanced Topics in Networking, Spring 2016 6.02: Intro to EECS II: Digital Communication Systems, Fall 2015. Accessibility Page generated 2020-10-19 11:57:17 EDT, by jemdoc.",
  "content_length": 2336,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:10"
}