{
  "name": "Mohamed F. Mokbel",
  "homepage": "http://www-users.cs.umn.edu/~mokbel",
  "status": "success",
  "content": "Mohamed Mokbel Search U of M Directories Home Education & Work Experience Awards Keynotes, Tutorials & Talks Students & Visitors Projects Publications Demos Service Teaching Funding Mohamed F. Mokbel Distinguished McKnight University Professor Director of Graduate Studies IEEE Fellow, ACM Distinguished Member Department of Computer Science and Engineering University of Minnesota - Twin Cities 4-192 KHKH Building 200 Union Street SE, Minneapolis, MN, 55455 Office: 4-207 EE/CS Building Email: mokbel@umn.edu [November 2024] General Co-Chair for the ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (ACM SIGSPATIAL 2025) [September 2024] Editor-in-Chief for ACM Transaction on Spatial Algorithms and Systems (ACM TSAS) [March 2023] Named a Distinguished McKnight University Professor University Announcment. (Link) College Announcment. (Link) Department Announcment. (Link) 10-Year Awards: IEEE ICDE 10-Year Influential Paper Award, 2025. (Announcment) An annual award given to a regular paper published at IEEE ICDE conference 10 years ago. Shortlisted for the ACM SIGSPATIAL 10-Year Impact Award, 2024. (Announcment) An annual award given to a regular paper published at ACM SIGSPATIAL conference 10 years ago whose value and prescience have become apparent over a long period of time. ACM SIGSPATIAL 10-Year Impact Award, 2022. (Announcment) An annual award given to a regular paper published at ACM SIGSPATIAL conference 10 years ago whose value and prescience have become apparent over a long period of time. VLDB 10-Years Best Paper Award 2016 A paper is selected from VLDB Conference 10-12 years earlier that best meets the “test of time”. In picking a winner, the committee especially values impact of the paper in practice, e.g., in products and services. Community Recognition: IEEE Fellow, 2020. For contributions to building spatially- and privacy-aware systems. Announcment: UMN, QCRI. ACM Distinguished Member, 2017. For Scientific Contributions to Computing. Announcment: UMN, QCRI. Keynotes and Distinguished Talks: Keynote Speaker, Hong Kong University of Science and Technology GeoAI Workshop HKUST GeoAI, Oct. 2023. Keynote Speaker, IEEE International Conference on Mobile Data Management IEEE MDM, Jul. 2023. 60th Anniversary Distinguished Lecture Series, CS Dept., Hong Kong Baptist U., Jan. 2022. Distinguished Speaker Series, ECE Dept., Iowa State U., Oct. 2021. PhD Alumni: Mashaal Musleh (2025, Senior Software Engineer, Teradata, USA) Ibrahim Sabek (2020, Assistant Professor, USC) Christopher Jonathan (2019, Co-Founder and Director, Lakes, Indonesia) Louai Alarabi (2019, Assistant Professor, Umm Al-Qura University, KSA, Chief Data Engineering, SITE, KSA) Amr Magdy (2017, Associate Professor, UC Riverside) Ahmed Eldawy (2016, Associate Professor, UC Riverside) Abdeltawab Hendawi (2015, Associate Professor, U. Rhode Island) Mo Sarwat (2014, Associate Professor, Arizona State U., Co-Founder and CEO, Wherobots, USA) Jie Bao (2014, Tech Lead, Data Managemnet, JD iCity, China) Justin Levandoski (2011, Director of Engineering, Google, Co-Founder, HiddenWights, USA) Mohamed Khalefa (2011, Assistant Professor, SUNY Old Westbury, NY) Chi-Yin (Ted) Chow (2010, Associate Professor, City U. Hong Kong, Co-Founder and Director, Flowering Tree Tech., UK) Distinguished Service: General Co-Chair, ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (ACM SIGSPATIAL 2025, 2025 Editor-in-Chief, ACM Transaction on Spatial Algorithms and Systems (ACM TSAS), 2024 - Editor-in-Chief, Springer Distributed and Parallel Databases Journal, DAPD, 2017 - 2024 Steering Committee Member, IEEE Transactions on Big Data, 2023 - Co-Organizer/Co-Editor, Communications of ACM (CACM) Arab World Regional Special Section; An 88-pages section, published in CACM, April 2021. (Youtube, CACM Video) ACM SIG Chair, ACM SIGSPATIAL, 2014 - 2017 (Elected) Associate Editor: ACM Books, ACM TODS, ACM TSAS, VLDB Journal, GeoInformatica PC Vice/Co-Chair: ACM SIGMOD 2018, ACM SIGSPATIAL 2010, 2009, 2008, IEEE MDM 2019, 2014, 2011 PC Associate Editor/Area Chair: ACM SIGMOD, 2026, 2025, 2024, 2022, VLDB, 2022, 2018, ACM SIGSPATIAL 2024, 2023, 2022, 2021, 2020, 2014, 2013, IEEE ICDE 2020, 2015, EDBT 2026, 2025, Bio: Mohamed Mokbel is a Distinguished McKnight University Professor at the University of Minnesota. Prior roles while on leave/sabbatical from UMN include Chief Scientist of Qatar Computing Research Institute, Founding Technical Director of GIS Technology Innovation Center in Saudi Arabia, and multiple times Visiting Researcher at Microsoft Research, USA. His research interests include database systems and spatial computing. He was recognized by the IEEE ICDE 10-Year Influential Paper Award for his work on big spatial data, the ACM SIGSPATIAL 10-Year Impact Award for his work on location-based social networks, and the VLDB 10-Year Test-of-Time Award for his work on location privacy. Mohamed is the Editor-in-Chief for ACM Transactions on Spatial algorithms and Systems (ACM TSAS), and on the editorial board of ACM Books and ACM TODS. He has served as the elected Chair of ACM SIGSPATIAL, PC Co-Chair for ACM SIGMOD, ACM SIGSPATIAL, and IEEE MDM. Mohamed is an IEEE Fellow and ACM Distinguished Scientist.",
  "content_length": 5303,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:59"
}