{
  "name": "Mohammad Hassan Hajiesmaili",
  "homepage": "https://groups.cs.umass.edu/hajiesmaili",
  "status": "success",
  "content": "Mohammad Hajiesmaili – Associate Professor at the Manning College of Information and Computer Sciences University of Massachusetts Amherst Search Google Appliance Enter the terms you wish to search for. Links to common UMass Amherst services and features College of Information and Computer Sciences Go.UMass Email SPIRE Moodle Blackboard Learn UDrive People Finder I direct the SOLAR (Sustainability, Optimization, Learning, and Algorithms Research) Lab. Our research is centered on carbon-intelligent computing (application) and data-driven online optimization (theory). In the SOLAR Lab, we develop rigorous algorithms using data-driven online optimization and learning tools that are applicable in several domains such as data center energy optimization, electricity market, electric vehicles, smart energy systems, and networking applications such as multimedia networking and edge/cloud networking. Our research is supported by a Google Research Faculty Award, an NSF CAREER Award, and other grants from NSF, Amazon, Adobe, and VMWare. [Research Group][Research Projects][Publications] [Google Scholar][DBLP] Awards and Honors Popular Science Briliant 10, 2022: an annual recognition by Popular Science of early-career scientists and engineers with the brightest innovations across a range of institutions and disciplines. press release Amazon Research Award, 2022 Six best paper finalist/runner-up in ACM e-Energy 2015, 2016(2), 2020, 2021, 2023 NSF CAREER Award 2021 Google Faculty Research Award, 2019 TeachingINFO 203: A Networked World, Fall 2022, Fall 2023, Spring 2024Algorithms with Prediction: Fall 2022 Prospective Students and PostdocsWe are actively looking for well-motivated and talented students and postdocs to join our research group. If interested,  please apply to our grad program and mention my name.",
  "content_length": 1827,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:15"
}