{
  "name": "Mohammed I. Al-Saleh",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=misaleh",
  "status": "success",
  "content": "Mohammed Ibrahim Al-Saleh × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content mohammed ibrahim al-saleh • Department of Computer Science - Faculty Member --- PH4 Level -1 Department of Computer Science misaleh@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from The University of New Mexico, 2011 Msc. of Computer Science from New Mexico State University, 2007 Bsc. of Computer Science from Jordan University of Science and Technology, 2003 Publications Mohammed I. Al-Saleh, Ziad A. Al-Sharif, \"Utilizing data lifetime of TCP buffers in digital forensics: Empirical study,\" Digital Investigation: The International Journal of Digital Forensics & Incident Response, vol. 9, no. 2, pp. 119-124, 2012 Mohammed I. Al-Saleh, Fatima M. AbuHjeela, Ziad A. Al-Sharif, \"Investigating the Detection Capabilities of Antiviruses under Concurrent Attacks,\" International Journal of Information Security, vol. 14, no. 4, pp. 387-396, 2015 Mohammed I. Al-Saleh , \"The impact of the antivirus on the digital evidence,\" International Journal of Electronic Security and Digital Forensics, vol. 5, no. 3/4, pp. 229-240, 2013 Mohammed I. Al-Saleh and Bilal Shebaro, \"Enhancing malware detection: clients deserve more protection,\" International Journal of Electronic Security and Digital Forensics, vol. 8, no. 1, pp. 1-16, 2016 Mohammed I. Al-Saleh and Yahya A. Forihat, \"Skype Forensics in Android Devices,\" International Journal of Computer Applications, vol. 78, no. 7, pp. 38-44, 2013 \"Utilizing Debugging Information of Applications in Memory Forensics\", Journal of Universal Computer Science Mohammed Ibrahim Mohammed Al-Saleh, Ethar Ahmad Abdal Razzaq Qawasmeh, Ziad Abdel Fattah Moh''D Al-Sharif 12/04/2020 \"Precise Performance Characterization of Antivirus on the File System Operations\", Journal of Universal Computer Science Mohammed Ibrahim Mohammed Al-Saleh, Hanan Mohammad Sa'Id Yousef Hamdan 22/07/2019 \"The Effects of Platforms and Languages on the Memory Footprint of the Executable Program: A Memory Forensic Approach\", Journal of Universal Computer Science Ziad Abdel Fattah Moh''D Al-Sharif, Mohammed Ibrahim Mohammed Al-Saleh, Yaser Ibrahim Issa Jararweh, Lu'Ay Mohammed Deeb Alawneh, Ahmed Saleh Hamad Shatnawi 09/07/2019 \"Live forensics of software attacks on cyber physical systems\", Future Generation Computer Systems Ziad Abdel Fattah Moh''D Al-Sharif, Mohammed Ibrahim Mohammed Al-Saleh, Lu'Ay Mohammed Deeb Alawneh, Yaser Ibrahim Issa Jararweh 14/07/2018 \"Can Genetic Algorithms Help Virus Writers Reshape their Creations and Avoid Detection?\", The Journal of Experimental & Theoretical Artificial Intelligence Mohammed Ibrahim Mohammed Al-Saleh 25/05/2017 \"A security framework for cloud-based video surveillance system\", Multimedia Tools and Applications Mohammad Abdullah A.R. Alsmirat, Yaser Ibrahim Issa Jararweh, Mohammed Ibrahim Mohammed Al-Saleh 06/02/2017 Faculty Member, Department of Computer Science, Nov 2011 - Present Full-time Lecturer, Department of Computer Science, Sep 2011 - Nov 2011 ADVANCED COMPUTER NETWORKS ADVANCED OPERATING SYSTEMS BASICS IN COMPUTER COMPUTATION THEORY COMPUTER NETWORKS Computer and Network Security DATA STRUCTURES DATA STRUCTURES AND ALGORITHMS NETWORK SECURITY OPERATING SYSTEMS SELECTED TOPICS IN COMPUTER SCIENCE SEMINAR IN ADVANCED COMPUTER SCIENCE THEORY OF COMPUTING Academics Academic Calendar Course Schedule Graduate Studies Resources IT Helpdesk Services Library Maharat Open Online Courses News Center Information Classification Policy Information Request Form Information & Feedback Alumni EU Projects Job Opportunities Complaints & Suggestions Newsletter Enter your email address to get the latest University news, special events and student activities delivered right to your inbox. Subscribe to JUST Newsletter ©2022, Information Technology and Communication Center. Jordan University of Science and Technology. All Rights Reserved. Contact JUST Jordan University of Science and Technology P.O.Box 3030, Irbid 22110, Jordan Tel: +962 2 7201000 Fax: +962 2 7095123 Email: public@just.edu.jo Close QS Ranking 2026 Close",
  "content_length": 4199,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:31"
}