{
  "name": "Mohamad Gharib",
  "homepage": "https://kodu.ut.ee/~gharib",
  "status": "success",
  "content": "Mohamad Gharib About Me I am an Associate Professor in Information Systems at the Institute of Computer Science, University of Tartu. I am conducting research in the broad area of Socio-Technical Systems (STS) Design. I was a Lecturer of Software Engineering at the same Institute. Before that, I was a postdoctoral researcher  at the Resilient Computing Lab (RCL)  research group of the University of Florence, and I was a postdoctoral researcher at the Department of Information Engineering and Computer Science, University of Trento, Italy, where I have obtained my Ph.D. degree in April 2015. Research Interest I am conducting research in the board area of design science with special emphasis on Socio-Technical Systems (STS) design as well as Cyber-Physical System-of-Systems (CPSoS) design. Award & Achievements September 2020 Distinguished Paper Award: COPri - a Core Ontology for Privacy Requirements Engineering. Presented at the International Conference on Research Challenges in Information Science (RCIS’20) by Mohamad Gharib, John Mylopoulos and Paolo Giorgini. Teaching - latest courses Enterprise System Integration - MTAT.03.229 - Spring Semester - 2021/22 - Now, Masters degree - Institute of Computer Science, University of Tartu, Estonia. Objectives: The objective of this course is to introduce principles and methods for designing, developing, and integrating enterprise information systems. The course introduces modern approaches to enterprise system integration, including resource-oriented architectures and their associated technologies, as well as patterns of API design and enterprise integration. Web application development - LTAT.05.004 - Fall Semester - 2021/22 - Now, Bachelor degree - Institute of Computer Science, University of Tartu, Estonia. Objectives: This course introduces key concepts for developing modern web applications, and covers numerous Web languages (e.g., HTML, CSS, Javascript), front-end (e.g., Vue.js) and back-end development frameworks (e.g., Node.js). Distributed Real time Cyber Physical Systems - B027549 (B059) - Fall Semester - 2018-2021, Masters degree, University of Florence, Italy. Objectives: This course aims at providing solid knowledge and competences to conceive, define and design complex cyber physical systems which are at the basis of emerging fields as Internet of Things (IoT), Smart Factories and Critical Infrastructures. In particular focus is put on the distribution and coordination aspects of the constituent systems of an SoS and on time management issues. Activities January 2019 Panelist - Assurance of Autonomous Systems: Characteristics and Challenges in the 75th Meeting of the IFIP 10.4 Working Group on Dependable Computing and Fault Tolerance. Champ´ery, Switzerland. February, 2018 Invited Talks - A Conceptual Model for Analyzing Information Quality in System-of-Systems Organized by the office of the Secretary of Defense (OSD) System of Systems Engineering Collaborators Information Exchange (SoSECIE). Selected Publications Mohamad Gharib Tommaso Zoppi and Andrea Bondavalli. On the Properness of Incorporating Binary Classification Machine Learning Algorithms into Safety-Critical Systems. Transactions on Emerging Topics in Computing (TETC) Journal (IF 7.691), IEEE (2022). Early access. DOI: https://doi.org/10.1109/TETC.2022.3178631 Mohamad Gharib Paolo Lollini, Andrea Bondavalli. A Cyber-Physical-Social Approach for Engineering Functional Safety Requirements for Automotive Systems. The Journal of Systems and Software, Elsevier. Volume 189, 111310, (2022). DOI: https://doi.org/10.1016/j.jss.2022.111310 Mohamad Gharib . Toward an architecture to improve privacy and informational self-determination through informed consent. Information and Computer Security, Vol. ahead-of-print No. ahead-of-print (2022). DOI: https://doi.org/10.1108/ICS-12-2021-0209 Muhammad Atif, Tommaso Zoppi, Mohamad Gharib , and Andrea Bondavalli. Towards Enhancing Traffic Sign Recognition through Sliding Windows. Sensors, (2022). 22(7), 2683. DOI: https://doi.org/10.3390/s22072683 Mohamad Gharib , Paolo Giorgini and John Mylopoulos. COPri V.2- A Core Ontology for Privacy Requirements. The Data & Knowledge Engineering (DKE) journal - Special Issue of best-accepted papers of the RCIS’20, Elsevier. (2021). DOI: https://doi.org/10.1016/j.datak.2021.101888 Mohamad Gharib , Paolo Lollini, Andrea Bondavalli. IQCPSoSML: A Model-based Approach for Modeling and Analyzing Information Quality Requirements for Cyber-Physical System-of-Systems. The International Journal on Data Semantics (JoDS). (2021). DOI: https://doi.org/10.1007/s13740-021-00129-8 Tommaso Zoppi, Mohamad Gharib , Muhammad Atif, and Andrea Bondavalli. A Meta-Learning to Improve Unsupervised Intrusion Detection in Cyber-Physical Systems. The ACM Transactions on Cyber-Physical Systems (TCPS) Journal. (2021). Accepted for publications. Mohamad Gharib , John Mylopoulos and Paolo Giorgini. An Ontology for Privacy Requirements via a Systematic Literature Review. The International Journal on Data Semantics (JoDS), 9 (4), pages 123–149. (2020). DOI: https://doi.org/10.1007/s13740-020-00116-5 Mohamad Gharib , Leandro Dias da Silva, and Andrea Ceccarelli. A Model to Discipline Autonomy in Cyber-Physical Systems-of-Systems and its Application. The International Journal of Software: Evolution & Process. Special Issue on Safe and Secure Cyber-Physical Systems. Volume 33, Issue 9. (2020). DOI: https://doi.org/10.1002/smr.2328 Mohamad Gharib and Paolo Giorgini. Information quality requirements engineering with STS-IQ. Information and Software Technology Journal, Volume 107, March 2019, pages 83-100. DOI: https://doi.org/10.1016/j.infsof.2018.11.002 Mohamad Gharib , Paolo Giorgini, and  John Mylopoulos. Analysis of information quality requirements in business processes, revisited. Requirements Engineering Journal, June 2018, Volume 23, Issue 2, pages 227–249, Springer. DOI: https://doi.org/10.1007/s00766-016-0264-4 Mohamad Gharib and John Mylopoulos. On the Philosophical Foundations of Privacy: Five Theses. The 14th IFIP WG 8.1 Working Conference on the Practice of Enterprise Modelling (PoEM'21), vol 432. Springer, Cham, 2021. pp 215-229. DOI: https://doi.org/10.1007/978-3-030-91279-6_15 Mohamad Gharib , John Mylopoulos and Paolo Giorgini. COPri - a Core Ontology for Privacy Requirements Engineering. In the 14th International Conference on Research Challenges in Information Science (RCIS’20). LNBIP, vol 385. Springer, Cham, 2020. pp 472-489. [24.5% acceptance rate][Recieved a Distinguished Paper Award]. DOI: https://doi.org/10.1007/978-3-030-50316-1_28 Mohamad Gharib , Paolo Giorgini and John Mylopoulos. Towards an Ontology for Privacy Requirements via a Systematic Literature Review. In: the 36th International Conference on Conceptual Modeling (ER 2017), Springer, pp. 193-208. [18.3% acceptance rate]. DOI: https://doi.org/10.1007%2F978-3-319-69904-2_16 Mohamad Gharib , Paolo Lollini, Andrea Ceccarelli, Andrea Bondavalli. Engineering Functional Safety Requirements for Automotive Systems: A Cyber-Physical-Social Approach. In the 19th IEEE International Symposium on High Assurance Systems Engineering (HASE), 2019, pages 74-81. DOI: https://doi.org/10.1109/HASE.2019.00021 Mohamad Gharib , Mattia Salnitri, Elda Paja, Paolo Giorgini, Haralambos Mouratidis, Michalis Pavlidis, José F. Ruiz, Sandra Fernandez, Andrea Della Siria. Privacy Requirements: Findings and Lessons Learned in Developing a Privacy Platform. Proceedings of the IEEE 24th International Requirements Engineering Conference (RE’16), 2016, pp.256-265.[27.8% acceptance rate]. DOI: https://doi.org/10.1109/RE.2016.13 Complete list of publication Google scholar DBLP Contact Email mohamad.gharib@ut.ee. Skype mgharib81 Linkedin mohgharib",
  "content_length": 7785,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:57"
}