{
  "name": "Mohammad Al-Smadi",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=maalsmadi9",
  "status": "success",
  "content": "Mohammad Ahmad Alsmadi × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content mohammad ahmad alsmadi • Department of Computer Science - Faculty Member --- C5 L-2 Department of Computer Science maalsmadi9@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from Graz University of Technology, 2012 Msc. of Computer Science from University of Jordan, 2007 Bsc. of Computer Science from Al-Mustansiryah University, 2003 Publications Mohammad AL-Smadi, GAMEDUCATION: Using Gamification Techniques to Engage Learners in Online Learning, Springer International Publishing, 2014, Book Tobias Ley, John Cook, Sebastian Dennerlein, Milos Kravcik, Christine Kunzmann, Kai Pata, Jukka Purma, John Sandars, Patricia Santos, Andreas Schmidt, Mohammad Al?Smadi, Christoph Trattner , \"Scaling informal learning at the workplace: A model and four designs from a large-scale design-based research effort,\" British Journal of Educational Technology, vol. 45, no. 6, pp. 1036-1048, 2014 AL-Smadi Mohammad, Margit Höfler, Christian Gütl, \"An Enhanced Automated Test Item Creation Based on Learners Preferred Concept Space,\" International Journal of Advanced Computer Science and Applications, vol. 7, no. 3, pp. 397-405, 2016 Mohammad Al?Smadi · Bashar Talafha · Mahmoud Al?Ayyoub · Yaser Jararweh, \"Using long short?term memory deep neural networks for aspect?based sentiment analysis of Arabic reviews,\" International Journal of Machine Learning and Cybernetics, vol. , no. , pp. 0-0, 2018 Mohammad Al-Smadi, Mahmoud Al-Ayyoub, Yaser Jararweh, OmarQawasmeh, \"Enhancing Aspect-Based Sentiment Analysis of Arabic Hotels? reviews using morphological, syntactic and semantic features,\" Information Processing and Management, vol. , no. , pp. 0-0, 2018 Mohammad Al-Smadi, Mahmoud Al-Ayyoub, Yaser Jararweh, OmarQawasmeh, \"Enhancing Aspect-Based Sentiment Analysis of Arabic Hotels? reviews using morphological, syntactic and semantic features,\" Information Processing and Management, vol. , no. , pp. 0-0, 2018 Mohammad Al-Smadia, Omar Qawasmeh, Mahmoud Al-Ayyoub, Yaser Jararweh,Brij Gupta, \"Deep Recurrent neural network vs. support vector machine foraspect-based sentiment analysis of Arabic hotels? reviews,\" Journal of Computational Science, vol. , no. , pp. 0-0, Mohammad Al-Smadia, Omar Qawasmeh, Mahmoud Al-Ayyoub, Yaser Jararweh,Brij Gupta, \"Deep Recurrent neural network vs. support vector machine foraspect-based sentiment analysis of Arabic hotels? reviews,\" Journal of Computational Science, vol. , no. , pp. 0-0, Mohammad AL-Smadi, Zain Jaradat, Mahmoud AL-Ayyoub, Yaser Jararweh, \"Paraphrase identification and semantic text similarity analysis in Arabic news tweets using lexical, syntactic, and semantic features,\" Information Processing and Management, vol. 53, no. 2017, pp. 640-652, 2017 Mohammad Al-Smadi, Mahmoud Al-Ayyoub, Huda Al-Sarhan, Yaser Jararweh , \"An Aspect-Based Sentiment Analysis Approach to Evaluating Arabic News Affect on Readers,\" Journal of Universal Computer Science, vol. 22, no. 5, pp. 630-649, 2016 Mohammad Al-Smadi, Mahmoud Al-Ayyoub, Huda Al-Sarhan, Yaser Jararweh , \"An Aspect-Based Sentiment Analysis Approach to Evaluating Arabic News Affect on Readers,\" Journal of Universal Computer Science, vol. 22, no. 5, pp. 630-649, 2016 Mohammad Al Smadi, Islam Obaidat, Mahmoud Al-Ayyoub, Rami Mohawesh,Yaser Jararweh , \"Using Enhanced Lexicon-Based Approaches for the Determination of Aspect Categories and Their Polarities in Arabic Reviews,\" International Journal of Information Technology and Web Engineering, vol. 11, no. 3, pp. 0-0, 2016 Mohammad Al Smadi, Islam Obaidat, Mahmoud Al-Ayyoub, Rami Mohawesh,Yaser Jararweh , \"Using Enhanced Lexicon-Based Approaches for the Determination of Aspect Categories and Their Polarities in Arabic Reviews,\" International Journal of Information Technology and Web Engineering, vol. 11, no. 3, pp. 0-0, 2016 Mahmoud Al-Ayyoub, Huda Al-Sarhan, Majd Al-So'ud, Mohammad Al-Smadi, Yaser Jararweh , \" Framework for Affective News Analysis of Arabic News: 2014 Gaza Attacks Case Study,\" Journal of Universal Computer Science, vol. 23, no. 3, pp. 0-0, 2017 Mahmoud Al-Ayyoub, Huda Al-Sarhan, Majd Al-So'ud, Mohammad Al-Smadi, Yaser Jararweh , \" Framework for Affective News Analysis of Arabic News: 2014 Gaza Attacks Case Study,\" Journal of Universal Computer Science, vol. 23, no. 3, pp. 0-0, 2017 Mahmoud Al-Ayyoub , Mohammed Al-andoli , Yaser Jararweh, Mohammad Smadi , Brij Gupta, \"Improving fuzzy C-mean-based community detection in social networks using dynamic parallelism,\" Computers and Electrical Engineering, vol. , no. , pp. 0-0, 2018 Mahmoud Al-Ayyoub , Mohammed Al-andoli , Yaser Jararweh, Mohammad Smadi , Brij Gupta, \"Improving fuzzy C-mean-based community detection in social networks using dynamic parallelism,\" Computers and Electrical Engineering, vol. , no. , pp. 0-0, 2018 Mohammad AL-Smadi,  Nicola Capuano , Christian Guetl, \"Decoupling assessment and serious games to support guided exploratory learning in smart education,\" Journal of Ambient Intelligence and Humanized Computing, vol. , no. , pp. 0-0, 2016 Mohammad AL-Smadi,  Nicola Capuano , Christian Guetl, \"Decoupling assessment and serious games to support guided exploratory learning in smart education,\" Journal of Ambient Intelligence and Humanized Computing, vol. , no. , pp. 0-0, 2016 Mohammad Al-Smadi, Omar Qawasmeh, Bashar Talafha, Muhannad Quwaider, \"Human Annotated Arabic Dataset of Book Reviews for Aspect Based Sentiment Analysis,\" 3rd International Conference on Future Internet of Things and Cloud (FiCloud), 2015, Nov 2015, pp. 726-736 Mohammad Al-Smadi, Bashar Talafha, Omar Qawasmeh, Mohammed N Alandoli, Wegdan A Hussien, Christian Guetl, \" A hybrid approach for Arabic named entity disambiguation,\" 15th International Conference on Knowledge Technologies and Data-driven Business, Oct 2015, pp. 0-0, ACM M Al-Smadi, M Al-Ayyoub, H Al-Sarhan, Y Jararweh, \"Using Aspect-Based Sentiment Analysis to Evaluate Arabic News Affect on Readers,\" IEEE/ACM 8th International Conference on Utility and Cloud Computing (UCC), Dec 2015, pp. 436-441 Omar Al-Qawasmeh, Mohammad AL-Smadi, Nisreen Fraihat, \"Arabic Named Entity Disambiguation Using Linked Open Data,\" Information and Communication Systems (ICICS), 2016 7th International Conference on, May 2016, pp. 0-0 \"Contextual emotion detection using ensemble deep learning\", Computer Speech & Language Asalah Mahmoud Awad Bani Thiab, Lu'Ay Mohammed Deeb Alawneh, Mohammad Ahmad Mustafa Alsmadi 20/12/2023 \"Healthcare knowledge graph construction: A systematic review of the state-of-the-art, open issues, and opportunities\", Journal of Big Data Mohammad Ahmad Mustafa Alsmadi 28/05/2023 \"Gated recurrent unit with multilingual universal sentence encoder for Arabic aspect-based sentiment analysis\", Knowledge-Based Systems Mohammad Ahmad Mustafa Alsmadi, Mahmoud Mohammed Khair Faiq Hammad, Saad Ali Sulaiman Al-Zboon, Saja Khaled Issa Tawalbeh 30/12/2022 \"Enhancing Arabic Aspect-Based Sentiment Analysis Using Deep Learning Models\", Computer Speech and Language Mohammad Ahmad Mustafa Alsmadi 05/04/2021 \"Affect detection from arabic tweets using ensemble and deep learning techniques\", Journal of King Saud University - Computer and Information Sciences Omar Abdelkarim Menawer Alzoubi, Saja Khaled Issa Tawalbeh, Mohammad Ahmad Mustafa Alsmadi 04/09/2020 \"Question to Question Similarity Analysis Using Morphological, Syntactic, Semantic, and Lexical Features\", Journal of Universal Computer Science Mahmoud Mohammed Khair Faiq Hammad, Mohammad Ahmad Mustafa Alsmadi, Qanita Mohamad Mousa Bani Baker, Muntaha Abed Al-Rahman Ali Al-As'Ad, Nour Ahmad Omar Alkhdour, Mohtaz Mohammad Ali Bni Younes, Enas Tayseer Khader Khwaileh 09/03/2020 \"Transfer Learning for Arabic Named Entity Recognition With Deep Neural Networks\", IEEE Access Mohammad Ahmad Mustafa Alsmadi, Saad Ali Sulaiman Al-Zboon, Yaser Ibrahim Issa Jararweh 01/02/2020 \"Detecting Epidemic Diseases Using Sentiment Analysis of Arabic Tweets\", Journal of Universal Computer Science Qanita Mohamad Mousa Bani Baker, Farah Fuad Suleiman Shatnawi, Saif Ahmad Mohammad Rawashdeh, Mohammad Ahmad Mustafa Alsmadi, Yaser Ibrahim Issa Jararweh 07/12/2019 \"Leveraging Linked Open Data to Automatically Answer Arabic Questions\", IEEE Access Mohammad Ahmad Mustafa Alsmadi, Islam Mahmoud Elayyan Aldalabih, Yaser Ibrahim Issa Jararweh 15/11/2019 \"Collaboration networks of arab biomedical researchers\", Multimedia Tools and Applications Mahmoud Abdel-Karim Mahmoud Alshbool, Alawneh Ibrahim Walid Esra'A, Yaser Ibrahim Issa Jararweh, Mohammad Ahmad Mustafa Alsmadi 15/08/2018 \"Cooperative mobile edge computing system for VANET-based software-defined content delivery\", Computers & Electrical Engineering Ja'Far Waleed Ahmad Albadarneh, Yaser Ibrahim Issa Jararweh, Mahmoud Abdel-Karim Mahmoud Alshbool, Mohammad Ahmad Mustafa Alsmadi 14/08/2018 \"Using long short-term memory deep neural networks for aspect-based sentiment analysis of Arabic reviews\", International Journal of Machine Learning and Cybernetics Mohammad Ahmad Mustafa Alsmadi, Bashar Bassam Nasser Talafha, Mahmoud Abdel-Karim Mahmoud Alshbool, Yaser Ibrahim Issa Jararweh 01/03/2018 \"Enhancing Aspect-Based Sentiment Analysis of Arabic Hotels? reviews using morphological, syntactic and semantic features\", Information Processing & Management Mohammad Ahmad Mustafa Alsmadi, Mahmoud Abdel-Karim Mahmoud Alshbool, Yaser Ibrahim Issa Jararweh 10/01/2018 \"Enhancing Aspect-Based Sentiment Analysis of Arabic Hotels? reviews using morphological, syntactic and semantic features\", Information Processing & Management Mohammad Ahmad Mustafa Alsmadi, Mahmoud Abdel-Karim Mahmoud Alshbool, Yaser Ibrahim Issa Jararweh, Omar Abdallah Mustafa Alqawasmeh 10/01/2018 \"Improving fuzzy C-mean-based community detection in social networks using dynamic parallelism\", Computers & Electrical Engi",
  "content_length": 14418,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:12"
}