{
  "name": "Mohammad Hossein Anisi",
  "homepage": "https://www.essex.ac.uk/people/anisi58203/hossein-anisi",
  "status": "success",
  "content": "Hossein Anisi | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Hossein Anisi People Dr Hossein Anisi Reader School of Computer Science and Electronic Engineering (CSEE) Email m.anisi@essex.ac.uk Location 5A.537, Colchester Campus Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr Anisi is a Reader and head of Internet of Everything (IoE) Laboratory at the School of Computer Science and Electronic Engineering, University of Essex, where he has been selected as the Best Academic 2023 at the annual KTP celebration of Innovation. Prior to that, he worked as a Senior Research Associate at University of East Anglia, UK and Senior Lecturer at University of Malaya, Malaysia where he received ‘Excellent Service Award’ for his achievements. As a computer scientist, he has designed novel connected systems comprised of smart things (sensors, actuators, embedded devices, autonomous vehicles, appliances and, everyday digitally enhanced objects) supported by energy-efficient, secure and resilient distributed communications and coordination services. He has also developed low-power and reliable protocols for Internet of Things (IoT) enabling technologies including wireless sensor and actuator networks, vehicular networks, heterogeneous networks and body area networks. His research results have directly contributed to the technology industry. He has particular interest in real world application domains such as agriculture, transportation, healthcare, energy management and other potential life domains. He has established strong collaborations with industry and has been working with several companies in the UK, focusing on smart monitoring and automation IoT-based systems capable of reliable and seamless generation, transmission, processing, and demonstration of data. Notably, he was awarded Best Research Impact in Enterprise and Innovation at the University of Essex’s annual Celebrating Excellence in Research and Impact Awards 2023. He has published more than 150 articles in high quality journals and several conference papers and won a number of medals for his innovations from international expositions. He has also received several International and national funding awards for his fundamental and practical research as PI and Co-I. Dr Anisi is an associate editor of IEEE Transactions on Cybernetics which has rank one in Automation and Control Systems, and Computer Science: Cybernetics. He is also serving as an associate editor of other IEEE prestigious journals including IEEE Transactions on Intelligent Transportation Systems, IEEE Transactions on Automation Science and Engineering and IEEE Transactions on AgriFood Electronics. Furthermore, he has contributed as a guest editor for various journals and taken the lead in organizing special sessions and workshops at several prominent IEEE conferences, including IEEE ICC, IEEE CAMAD, IEEE PIMRC, and IEEE VTC, among others. He is actively engaged as an executive and technical committee member for numerous conferences. Dr Anisi is Fellow of Higher Education Academy and a member of the Royal Society’s International Exchanges Panel. He is also Senior Member of IEEE; Senior Member of Institute of Research Engineers and Doctors (the IRED); member of ACM; IEEE Systems, Man, and Cybernetics Society; IEEE Council on RFID; IEEE Sensors Council; IEEE Systems Council and International Association of Engineers (IAENG). If you are interested to pursue a PhD, feel free to email him your CV. Research and professional activities Research interests Cybersecurity Open to supervise Internet of Things (IoT) Open to supervise Green and Energy-efficient Data Communication Open to supervise Mobile Ad hoc Networks Open to supervise Sensor Networks Applications Open to supervise Wireless Sensor and Actuator Networks Open to supervise Wireless Body Area Networks Open to supervise Intelligent Transportation Systems Open to supervise Autonomous Vehicles Open to supervise Current research I am interested in multi-disciplinary researches that can contribute to wealth creation, enhance quality of life and create or consolidate new industries. In such researches, I am using existing or new technologies such as wireless communication and networking, cloud computing and particularly Internet of Things in disaster monitoring, energy management, agriculture, transportation systems, healthcare and other potential life domains. Teaching and supervision Current teaching responsibilities Mathematics for Computing (CE141) Application Programming (CE203) Current supervision Shafiq Ahmed Degree subject: Computer Science Degree type: Doctor of Philosophy Aryan Morteza Degree subject: Computer Science Degree type: Doctor of Philosophy Hassan Moin Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Han Yang Thesis title: Robust and Efficient Federated Learning Algorithms Against Adaptive Model Poisoning Attacks Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 1/5/2024 Kabo Elliot Pule Thesis title: Multi-Objective Resource Optimization of Unmanned Aerial Vehicles and Internet of Things Devices in Time Critical Applications Using Evolutionary Approaches Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 3/1/2024 Sumit Kumar Singh Thesis title: Diagnosis of Skin Cancer Using Novel Computer Vision and Deep Learning Techniques Degree subject: Computer Science Degree type: Master of Science (by Dissertation) Awarded date: 17/6/2022 Publications Journal articles (102) Goudarzi, S., Soleymani, SA., Anisi, MH., Jindal, A. and Xiao, P., (2025). Optimizing UAV-Assisted Vehicular Edge Computing With Age of Information: A SAC-Based Solution. IEEE Internet of Things Journal. 12 (5), 4555-4569 Khan, MA., Ullah, I., Kumar, N., Akhunzada, A., Anisi, MH., Alqhatani, A., Afghah, F., Barb, G. and Waqas, A., (2025). An Improvised Certificate-Based Proxy Signature Using Hyperelliptic Curve Cryptography for Secure UAV Communications. IEEE Transactions on Intelligent Transportation Systems. 26 (4), 5264-5275 Mahmood, K., Shamshad, S., Anisi, MH., Brighente, A., Saleem, MA. and Das, AK., (2025). A Privacy-Preserving Access Control Protocol for 6G Supported Intelligent UAV Networks. Vehicular Communications. 54, 100937-100937 Ahmed, S. and Anisi, MH., (2025). AIDAS: AI-Enhanced Intrusion Detection and Authentication for Autonomous Vehicles. IEEE Transactions on Intelligent Transportation Systems. 26 (8), 12548-12557 Pourkabirian, A., Ni, W., Zhou, X., Li, K. and Anisi, MH., (2025). A Precoding Perturbation Method in Geometric Optimization: Exploring Manifold Structure for Privacy and Efficiency. IEEE Transactions on Information Forensics and Security. 20, 6220-6235 Ahmed, S. and Anisi, MH., (2025). A Post-Quantum Secure Federated Learning Framework for Cross-Domain V2G Authentication. IEEE Transactions on Consumer Electronics. 71 (3), 8433-8440 Singh, S., Anisi, MH., Jindal, A. and Jarchi, D., (2024). Smart Multimodal In-Bed Pose Estimation Framework Incorporating Generative Adversarial Neural Network. IEEE Journal of Biomedical and Health Informatics. 28 (6), 3379-3388 Mahmood, K., Obaidat, MS., Shamshad, S., Alenazi, MJF., Kumar, G., Anisi, MH. and Conti, M., (2024). Cost-effective Authenticated Solution (CAS) for 6G-Enabled Artificial Intelligence of Medical Things (AIoMT). IEEE Internet of Things Journal. 11 (13), 23977-23984 Wu, J., Abolghasemi, V., Anisi, MH., Dar, U., Ivanov, A. and Newenham, C., (2024). Strawberry Disease Detection through an Advanced Squeeze-and-Excitation Deep Learning Model. IEEE Transactions on AgriFood Electronics. 2 (2), 259-267 Pourkabirian, A., Kordafshari, MS., Jindal, A. and Anisi, MH., (2024). A Vision of 6G URLLC: Physical-Layer Technologies and Enablers. IEEE Communications Standards Magazine. 8 (2), 20-27 Ahmed, S. and Anisi, MH., (2024). Optimizing V2G Dynamics: An AI-Enhanced Secure Protocol for Energy Management in Industrial Cyber-Physical Systems. IEEE Transactions on Industrial Cyber-Physical Systems. 2, 312-320 Soleymani, SA., Goudarzi, S., Anisi, MH., Xiao, P., Mihaylova, L. and Wang, W., (2024). MI3SE: A Multi-User Index-Based Searchable Symmetric Encryption Scheme for Improving Security of Data in Connected Electronic Devices. IEEE Transactions on Consumer Electronics. 71 (1), 527-537 Soleymani, SA., Goudarzi, S., Anisi, MH., Jindal, A., Kama, N. and Ismail, SA., (2023). A Privacy-Preserving Authentication Scheme for Real-time Medical Monitoring Systems. IEEE Journal of Biomedical and Health Informatics. 27 (5), 2314-2322 Soleymani, SA., Goudarzi, S., Anisi, MH., Cruickshank, H., Jindal, A. and Kama, N., (2023). TRUTH: Trust and Authentication Scheme in 5G-IIoT. IEEE Transactions on Industrial Informatics. 19 (1), 880-889 Upasane, SJ., Hagras, H., Anisi, MH., Savill, S., Taylor, I. and Manousakis, K., (2023). A Type",
  "content_length": 36333,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:16"
}