{
  "name": "Mohan Kumar",
  "homepage": "https://www.cs.rit.edu/~mjk",
  "status": "success",
  "content": "Dr. Mohan Kumar, Chair, Computer Science @ RIT Home Projects People Publications OTHER LINKS ComputerScience Department Rochester Institute of Technology Welcome to My Page Kumar’s current research interests are in pervasive and mobile computing and parallel and distributed computing. He has been the Chair of the Department of Computer Science at RIT since Fall 2013. Prior to joining RIT, he served as Professor and Director of the computer engineering program in the department of Computer Science and Engineering at the University of Texas at Arlington. He initiated pervasive computing research activities at CSE@UTA in 2001 and directed the Pervasive and Invisible Computing (PICO) lab. He was the lead PI in three NSF projects: Collaborative virtual observation in dynamic, heterogeneous environments; Distributed Opportunistic Computing; and Middleware Framework for pervasive computing. He was a Co-PI in three additional NSF funded projects. He was a Co-PI in a project funded by the AFRL on Middleware for Dynamic Distributed Repositories. During the summer of 2013, Kumar was on a Office of Naval Research (ONR) Summer Faculty Fellowship. He visited the Institute for Informatics and Telematics (IIT) National Research Council (CNR)Pisa, Italy in 2000, 2008 and 2010, and the the National University of Singapore in 2008. He co-founded the IEEE International Conference on Pervasive Computing and Communications (PerCom) and the Elsevier's Pervasive and Mobile Computing Journal. He is now on his second term as the Chair of the Steering Committee for PerCom. In the past, he has served PerCom in various roles - Program Chair (PerCom 2003), General Chair (PerCom 2005 and PerCom 2012), and Steering Committee Chair(2007-10). Also, he was the Co-General Chair of IEEE World of Wireless and Mobile and Multimedia Networks (IEEE WoWMoM) 2008. Mohan is a senior member of the IEEE. Kumar has received funding of over 7 million dollars as a PI or Co-PI in several completed and ongoing projects funded by the NSF, The Air Force Research Laboratory, Texas ARP, the Australian Research Council (ARC) and the Defense Science and Technology Organization (Australia). Published more than 175 articles in refereed journals and conference proceedings. Supervised 17 PhD dissertations and 32 MS theses. Original research contributions include algorithms and mechanisms for: Opportunistic Distributed Computing; Service Composition in Pervasive and Dynamic Systems; Information Fusion in Sensor Systems, Pervasive and Sensor Systems Middleware; Caching and Prefetching in Mobile and Distributed Systems; Active Network Based Mobile IP Enhancements; Extended Hypercube Architectures for Parallel Processing; Parallelization of Artificial Neural Network Algorithms; and Dual-ported RAM based Communications in multi-processor systems. His H-index - 29; i10-index – 68. Mohan obtained his Ph.D and MTech degrees from the Indian Institute of Science in 1992 and 1985 respectively and the BE degree from the Bangalore University in 1982. During 1992-2000, he served as a faculty at the School of Computer Science, Curtin University of Technology, Perth, Australia. At Curtin University, he received the Vice-Chancellor's Excellence Award in 1999. His doctoral dissertation on Extended Hypercube architecture received the Best Dissertation award for the year 1991-92. Journal Editorships Area Editor, Pervasive and Mobile Computing Area Editor, Computer Communications Areas of Current Interest (Research): Pervasive and Mobile Computing Opportunistic Networking and Computing Sensor Systems Parallel and Distributed Computing WCNG HOME © Computer Science Department @ RIT, 2013. Designed and created by Surjya Ray RIT Home | RIT CS Home | Directories WCNG HOME",
  "content_length": 3760,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:30"
}