{
  "name": "Mohammad Hajiaghayi",
  "homepage": "http://www.cs.umd.edu/~hajiagha",
  "status": "success",
  "content": "Home page of Mohammadtaghi Hajiaghayi Welcome to MohammadTaghi HajiAghayi's homepage Address:                     MohammadTaghi Hajiaghayi Computer Science Department, University of Maryland Brendan Iribe Center for Computer Science and Engineering 8125 Paint Branch Dr., Room 5158 College Park, MD 20742 USA Phone: 301-405-6724 Fax: 301-405-6707 Email: [my lastname]@gmail.com YouTube: @hajiaghayi (watch my LIVES with Distinguished Computer Scientists as well as my Courses Online) Twitter: @MTHajiaghayi Instagram:                  @mhajiaghayi Wiki & LinkedIn:      @Mohammad Hajiaghayi I am a Guggenheim Fellow (2019), an ACM Fellow (2018) (the youngest in the class of 2018 fellows), an AAAS Fellow (2023), an IEEE Fellow (2020), an EATCS Fellow (2020), a Blavatnik National Awards for Young Scientists Honoree (2020), a Washington Academy of Science Distinguished Career Awardee (2023), a University of Waterloo Alumni Achievement Medal (2022) Recipient, and the Jack and Rita G. Minker Professor of Computer Science Department at the University of Maryland at College Park. I am also affiliated Professor with Robert H. Smith School of Business, University of Maryland. In addition, I hold a Research Affiliate position in MIT Computer Science and Artificial Intelligence Laboratory (CSAIL). I am also a Permanent Member of Center for Discrete Mathematics and Theoretical Computer Science (DIMACS) at Rutgers. I was also a Visiting Scientist in the Simons Institute for the Theory of Computing at University of California, Berkeley, in Fall 2016, Spring 2018, and Fall 2018. My research is supported in part by NSF CAREER Award, ONR Young Investigator Award, Google Faculty Research Award (twice), Northrop Grumman Faculty Research Award, University of Maryland Research and Scholarship Award (RASA), AT&T Research Labs, and a few other DARPA and AFOSR grants. I also thank European Association for Theoretical Computer Science for EATCS Nerode Prize, 2015 (awarded for our outstanding JACM paper on our Bidimensionality Theory, which was the topic of my Ph.D. thesis; see below for more info). Regarding my industry experience, since January 2019, I am also an Amazon Scholar with Amazon Sponsored & Display Advertisement Division. Before I was a Visiting Research Scientist at Google AI- Research, New York City, in 2017-2018. I was also a Visiting Researcher in Microsoft Research at New England and New York City Labs in 2016. Before joining UMD in 2010, I was a Senior Researcher in the Algorithms and Theoretical Computer Science group at AT&T Labs - Research from 2007. During my doctoral studies, I also worked as an intern at Microsoft Research Theory group in 2004 and Department of Mathematical Sciences at the IBM T.J. Watson Research Center in 2002. Regarding my education, I have been one-year Postdoctoral Fellow in the School of Computer Science at Carnegie Mellon University (with ALADDIN project) and a one-year Postdoctoral Associate in MIT Computer Science and Artificial Intelligence Laboratory (CSAIL) from which I also earned my Ph.D. under supervision of Professor Erik D. Demaine and Professor Tom Leighton (Sep. 2001- May 2005). I got my M.Sc. from the Computer Science Department of the University of  Waterloo  (Sep. 2000- Sep. 2001) and my B.Sc. from the Computer Engineering Department of Sharif University of Technology  (Sep 1997-Sep 2000). My book: Computational Intractability: A Guide to Algorithmic Lower Bounds, MIT Press 2024, with E.D. Demaine and W. Gasarch (FREE to download for everyone) Teaching: Principles of Data Science, master’s course at the University of Maryland in Fall 2022. Introduction to Algorithms, undergraduate course at the University of Maryland in Fall 2022. Algorithmic Lower Bounds: Fun with Hardness Proofs, graduate course at the University of Maryland in Fall 2022. Introduction to Computational Game Theory, undergraduate course at the University of Maryland in Spring 2019. Introduction to Algorithms, undergraduate course at the University of Maryland in Spring 2019. Algorithmic Lower Bounds: Fun with Hardness Proofs, graduate course at the University of Maryland in Spring 2019. Introduction to Computational Game Theory, undergraduate course at the University of Maryland in Fall 2017. Introduction to Algorithms, undergraduate course at the University of Maryland in Fall 2017. Network Design Foundation, graduate course at the University of Maryland in Fall 2015. Introduction to Computational Game Theory, undergraduate course at the University of Maryland in Spring 2015. Algorithmic Lower Bounds: Fun with Hardness Proofs, graduate course at the University of Maryland in Fall 2014. Algorithmic Game Theory, graduate course at the University of Maryland in Spring 2014. Introduction to Computational Game Theory, undergraduate course at the University of Maryland in Fall 2013. Introduction to Algorithms, undergraduate course at the University of Maryland in Spring 2012. Network Design Foundation, graduate course at the University of Maryland in Fall 2011. Introduction to Algorithms, undergraduate course at the University of Maryland in Spring 2011. Algorithmic Game Theory, graduate course at the University of Maryland in Fall 2010. Advanced Algorithms: Topics in Game Theory, graduate course at Rutgers University in Spring 2009. Network Design and Game Theory, graduate course at Rutgers University in Spring 2008. BigDND (Big Dynamic Network Data): joint project on BIG DATA with Erik Demaine at MIT Ph.D. Thesis: The bidimensionality theory and its algorithmic applications. Massachusetts Institute of Technology, Cambridge, MA, U.S.A, May 2005. A few workshops on our Bidimensionality Theory: FOCS 2013 Workshop on Bidimensional Structures: Algorithms and Combinatorics, October 2013. Seminar on Bidimensional Structures: Algorithms, Combinatorics, and Logic, Schloss Dagstuhl, Germany, March 2013. Seminar on Fixed-Parameter and Approximation Algorithms, Schloss Dagstuhl, Germany, December 2009. School on Algorithmic Graph Structure Theory, Berlin, Germany, October 2007. · Editor-in-Chief of Algorithmica. · Editor for SIAM Journal on Discrete Mathematics. · Editor for Journal of Computer and System Sciences · Editor for Networks. · Editor for Algorithms. · Editor for Encyclopedia of Algorithms. · Guest Editor for ACM Transactions on Parallel Computing (TOPC) special issue on selected papers from SPAA 2017. · Guest Editor for Algorithmica special issue on selected papers from ESA 2013. · Guest Editor for ACM Transactions on Algorithms (TALG) special issue on selected papers from SODA 2008. · Conferences and Workshop Committees: 1.      Senior program committee, the 36rd AAAI Conference on Artificial Intelligence (AAAI), Washington, DC, February 2023. 2.      Senior program committee, the 16th ACM International Conference on Web Search and Data Mining (WSDM), Singapore, February 2023. 3.      Program committee, the 36th International Symposium on Distributed Computing (DISC), Virtual Conference (due to COVID-19), October 2022. 4.      Organizing committee, SIAM Conference on Discrete Mathematics (DM), Pittsburgh, PA, June 13-16, 2022. 5.      Program committee, the 31st Web Conference (WWW), Lyon, France, April 2022. 6.      Program committee, the 29th European Symposium on Algorithms (ESA), Lisbon, Portugal, September 2021. 7.      Steering committee, ACM Symposium on Parallel Algorithms and Architectures, 2017-2020. 8.      Technical program committee, the 37th Annual IEEE International Conference on Computer Communications (INFOCOM), Honolulu, HI, April 2018. 9.      Program committee, the 28th Annual ACM-SIAM Symposium on Discrete Mathematics (SODA), Barcelona, Spain, January 2017. 10.   Chair, Program committee, the 29th Annual ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), Washington, DC, July 2017. 11.   Technical program committee, the 36th Annual IEEE International Conference on Computer Communications (INFOCOM), Istanbul, Turkey, April 2017. 12.   Program committee, the 22nd Annual International Computing and Combinatorics Conference (COCOON), Ho Chi Minh City, Vietnam, August 2016. 13.   Technical program committee, the 35th Annual IEEE International Conference on Computer Communications (INFOCOM), San Francisco, CA, April 2016. 14.   Program committee, the 10th International Conference on Language and Automata Theory (LATA), Prague, Czech, March 2016. 15.   Co-organizer: ACM Conference in Economics and Computation (EC) 2015 Tutorial on “Network Creation Games: How Does the Internet Form?”, Portland, OR, June 2015. 16.   Program committee, the 27th Annual ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), Portland, OR, June 2015. 17.   Program committee, the 42nd International Colloquium on Automata, Languages and Programming (ICALP), Kyoto, Japan, July 2015. 18.   Technical program committee, the 34th Annual IEEE International Conference on Computer Communications (INFOCOM), Hong Kong, April 2015. 19.   Co-chair, International Conference on Topics in Theoretical Computer Science (TTCS), Tehran, August 2015. 20.   Program committee, the 9th International Workshop on Algorithms and Computation (WALCOM), Bangladesh, Feb 2015. 21.   Program committee, the 15th ACM Conference on Economics and Computation (ACM EC), Palo Alto, CA, June 2014. 22.   Technical program committee, the 33rd Annual IEEE International Conference on Computer Communications (INFOCOM), Toronto, Canada, April 2014. 23.   Co-organizer, FOCS 2013 Workshop on Bidimensional Structures: Algorithms and Combinatorics, October 2013. 24.   Program committee, the 45th ACM Symposium on Theory of Computing (STOC), Palo Alto, CA, May 2013. 25.   Program committee, the 21st European Symposium on Algorithms (ESA), Sophia Antipolis, France, September 2013. 26.   Program committee, the 16th International Workshop on Approximation Algorithms for Combinatorial Optimization Problems (APPROX), Berkeley, CA, August 2013. 27.   T",
  "content_length": 17399,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:15"
}