{
  "name": "Mohammad Zulkernine",
  "homepage": "http://www.cs.queensu.ca/~mzulker",
  "status": "success",
  "content": "Mohammad Zulkernine – Mohammad Zulkernine Skip to content Dr. Mohammad Zulkernine, PEng Director, Queen's Centre for Security & PrivacyProfessor and Canada Research Chair, School of ComputingQueen's University, Kingston, Ontario, Canada, K7L 3N6Email: mz@queensu.ca, Call: (613) 533 2837 Dr. Mohammad Zulkernine is a Professor and Tier 1 Canada Research Chair in Cyber-Physical System Security at the School of Computing, Queen’s University, Canada. He is the Founding Director of the Queen’s Centre for Security and Privacy (QCSP) and holds a cross-appointment with the Department of Electrical and Computer Engineering at Queen’s and the Royal Military College of Canada. Previously, he served as the Graduate Chair of the School of Computing and held a Tier 2 Canada Research Chair in Software Dependability. Since joining Queen’s in 2003, Dr. Zulkernine has taken sabbaticals at the University of Trento, Italy, Irdeto Canada, and the American University of Sharjah, UAE. He is a licensed professional engineer in Ontario, Canada. Dr. Zulkernine leads the Queen’s Reliable Software Technology (QRST) research group and has authored over 250 publications. His current research focuses on the security of cyber-physical systems. He has led more than 35 provincial, federal, and industry research projects and collaborated on several international initiatives, including European Union and Canada-Africa partnerships. He has supervised over 100 graduate students and postdoctoral fellows and has received prestigious awards, such as the Excellence in Graduate Student Supervision Award from Queen’s and the Distinguished Graduate Supervision Award from the School. Additionally, Dr. Zulkernine has held more than 40 leadership roles for major international conferences and journals. Dr. Zulkernine’s diverse educational and professional background spans five countries: Bangladesh, Japan, Canada, Italy, and the UAE. He earned his BSc from Bangladesh (BUET), MEng from Japan (Muroran), and PhD from Canada (Waterloo). Major Awards & Honors Canada Research Chair (Tier I) in Cyber-Physical System Security, 2024. Queen’s Award for Excellence in Graduate Student Supervision, 2023. Canada Research Chair (Tier II) in Software Reliability and Security, 2016. Distinguished Graduate Supervision Award, School of Computing, Queen’s University, 2013. Canada Research Chair (Tier II) in Software Dependability, 2011. Research Principal Investigator, Queen’s Reliable Software Technology Laboratory Current Projects: Cyber-Physical System Security and Reliability Faculty Affiliate and Director,  Queen’s Centre for Security & Privacy Co-Investigator, NSERC Cybersecurity CREATE Program Publications: Listed in DBLP, Google Scholar, and the Publications page Major Conference Activities Standing Committee Vice Chair: The IEEE Annual Conference on Computers, Software and Applications (COMPSAC), 2021- Steering Committee Member: IEEE International Conference on Dependable Systems and Their Applications(DSA), 2024- Program Co-Chair: IEEE International Conference on Software Security and Reliability (QRS), Florence, Italy, July 2025. General Chair: IEEE DSA (China, 2024), IEEE COMPSAC (Spain, 2020, 2021), IEEE DASC (USA, 2017; Canada, 2020, 2021), IEEE DependSys (Fiji, 2020) Program Chair: CRISIS (Tunisia, 2022), NSysS (Bangladesh, 2022), DSA (China, 2021), A3S (Bulgaria, 2019), SIRI (Korea, 2011), COMPSAC (Turkey, 2011), HASE (USA, 2014), STPSA (USA, China, Finland, Korea, USA, 2006-10), NSysS (Bangladesh, 2017) Supervision / Teaching Thesis Hall of FamePostdoctoral Fellow: Dr. Amin Fakhereldine and Dr. Qi Li (with Dr. Ni)PhD: Ayesha Babar, Mahdieh Safarzadeh, Stephen McKeon, Emilie Coote (with Dr. Ding), Ephraim Govere, Nazmul Islam, Raha Abbasi (with Dr. Ni), Bilel Matmti, Daniel Sousa-Dias, and Fozle Shafi (with Dr. Hossain)MSc: Daniel Fichtinger (with Dr. Alaca), Abdelazi Al-husni (with Dr. Alaca), Ashfi Shah, and Jean-Pierre Villacura (visiting student) Former Postdoctoral fellows, PhD and MSc students: List available on QRST pageTeaching: Graduate:  Cyber-Physical System Security, Software Reliability and Security, Software ReliabilityUndergraduate: Software Quality Assurance, Distributed Systems, and Information Technology Project Countries Travelled / Lived Algeria, Australia, Austria, Bahrain, Bangladesh, Belgium, Bhutan, Brazil, Bulgaria, Canada, Chile, China, Colombia, Czech Republic, Denmark, England, Estonia, Ethiopia, Finland, France, Germany, Greece, Hong Kong, India, Indonesia, Italy, Japan, Korea, Kuwait, Luxembourg, Malaysia, Malta, Mexico, Morocco, Netherlands, New Zealand, Norway, Oman, Portugal, Qatar, Saudi Arabia, Scotland, Singapore, South Africa, Spain, Sweden, Switzerland, Taiwan, Thailand, Tunisia, Turkey, UAE, USA (Including Puerto Rico And Hawaii), Vietnam. Current & Past Sponsors",
  "content_length": 4838,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:26"
}