{
  "name": "Mohamed Khamis",
  "homepage": "http://mkhamis.com",
  "status": "success",
  "content": "Prof. Mohamed Khamis Home Bio Publications Team & Teaching Contact Welcome to my homepage! My name is Mohamed Khamis, I research in Human-Computer Interaction and Human-centered Security. As of September 2018, I am a Reader/Associate Professor at the University of Glasgow. I received my PhD from Ludwig Maximilian University of Munich (LMU) in Germany. I was supervised by Florian Alt, and Andreas Bulling. Research Interests I worked in a diversity of topics within HCI, privacy and ubiquitous computing. In particular, I am active in the fields of eye tracking, pervasive displays, usable security, and user privacy. My contributions are at the crossroads of user privacy and ubiquitous computing: - Usable Security and Privacy: I contributed to both: (1) understanding threats to user privacy that are caused/facilitated by ubiquitous technologies, such as thermal attacks (CHI'17, Honorable Mention), and shoulder surfing (CHI'17, MUM'17, INTERACT '19, ETRA'20), and (2) inventing novel ubiquitous systems for protecting user privacy and security on mobile devices (CHI'20, CHI'19, ICMI'17, MTI), public displays (IMWUT, ETRA'19, PerDis'17), and in VR (TOCHI, IEEE VR'19, USEC'17). - Designing Gaze-based Systems: I contributed to comprehensively understanding and addressing challenges of gaze interaction on ubiquitous devices, such as mobile devices (CHI'18, MobileHCI'18) and public displays (UIST'17, UbiComp'16, MUM'16), as well as proposing novel concepts that employ gaze to address problems on public displays (CHI'18, IMWUT, PerDis'17), and mobile devices (ICMI'17). I published survey papers that reflect on prior work and set the agenda for future research in eye tracking on mobile devices (MobileHCI'18) and eye tracking for security applications (CHI'20). Want to do a PhD? If you are interested in doing a PhD in Glasgow in one of those areas: Usable Security, Human-Computer Interaction, or Gaze Interaction, and have strong programming skills (e.g., Java, Python, C++, C#, etc.) please email me your CV and previous publications if any, and please highlight which publication is your strongest. You can read more about the application process here. The deadline to apply for a university scholarship is in January every year - make sure you get in touch in time. Email me if you want to know more about the open topics. Find me also at: Latest Updates Follow me and my team on Twitter for the latest news! The SIRIUS Lab on Twitter July 2023 I haven't been updating this for quite some time but a lot has been happening. For example, I filmed with Galileo a 10-min episode on our thermal imaging research, which you can watch here. October 2020 Project proposal submitted to EPSRC has been funded EP/V008870/1. October 2020 Our article on Fast and Secure Authentication in Virtual Reality using Coordinated 3D Manipulation and Pointing has been accepted at the ACM Transactions on Computer-Human Interaction (TOCHI). You can watch a summary video here. August 2020 My Keynote talk on \"The interplay between Privacy, Security and Eye Tracking in the Wild: Opportunities and Challenges\" at the ECCV 2020 Open Eyes Workshop is now online. You can watch it here. June 2020 Our article on Predicting Mid-Air Gestural Interaction with Public Displays based on Audience Behaviour has been accepted at the International Journal on Human-Computer Studies. June 2020 Our Late-breaking-work on Assessing Social Text Placement in Mixed Reality TV received the best Late-breaking-work award at IMX 2020 . March 2020 Our paper titled The Role of Eye Gaze in Security and Privacy Applications received an Honorable Mention Award (top 5% of submissions) at CHI 2020. January 2020 Does your work in security or privacy involve the use of eye gaze? make sure to submit to our ETRA Workshop on Eye-Gaze for Security Applications (EyeSec). December 2019 Two papers accepted at CHI 2020: \"The Role of Eye Gaze in Security and Privacy Applications\" and \"Conducting Studies on Public Displays in Virtual Reality\". September 2019 Two papers accepted at MUM 2019. One is on security in public space, and the other propses a novel smooth pursuit detection algorithm that allows accurate selection of up to 160 targets. September 2019 Our paper titled ElectroCutscenes: Realistic Haptic Feedback in Cutscenes of Virtual Reality Games Using Electric Muscle Stimulation was accepted as a full paper at VRST 2019. April 2019 I will serve as an Associate Chair in the program committee of ACM CHI 2020. I will be a member of the Privacy and Security Subcommittee. April 2019 Our paper titled What about my Privacy, Habibi? Understanding Privacy Concerns and Perceptions of Users from Different Socioeconomic Groups in the Arab World. was accepted at Interact 2019. March 2019 Two papers at ETRA 2019, one at Augmented Human 2019, and one at IEEE VR 2019. Also check out our book chapter on interfaces to complex systems. December 2018 Our paper titled Passquerade: Improving Error Correction of Text Passwords on Mobile Devices using Graphic Filters. was accepted at CHI 2019. November 2018 Our article was accepted for publication in the Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (PACM IMWUT). We will present the journal article at UbiComp 2019 in London. October 2018 I'll be serving as a General Chair for PerDis 2019. October 2018 I'll be serving on the CHI 2019 Program Committee as an Associate Chair this year. October 2018 Two papers accepted at MUM 2018. September 2018 Our paper titled The Past, Present, and Future of Gaze-enabled Handheld Mobile Devices: Survey and Lessons Learned received an Honorable Mention Award (top 5% of submissions) at MobileHCI 2018. August 2018 I successfully defended my PhD and received my certificate. Find the dissertation here. April 2018 We will present The Past, Present, and Future of Gaze-enabled Handheld Mobile Devices: Survey and Lessons Learned at MobileHCI 2018 April 2018 Looking forward to meet everyone at CHI 2018! you can find me in the following rooms on those days: MondayI will be presenting in 518AB at 11:30am TuesdayI will be presenting in 515ABC at 4pm WednesdayI will be chairing the \"Privacy, Passwords and Authentication\" session in 518AB at 4pm ThursdayI will be presenting in 518C at 9am March 2018 We will present papers at PerDis 2018, AVI 2018, and ETRA 2018. February 2018 Our paper titled Which one is me? Identifying Oneself on Public Displays. received an Honorable Mention Award (top 5% of submissions) at CHI 2018. Watch the video here. December 2017 We will present Three papers at CHI 2018. November 2017 Our paper titled They are all after you: Investigating the Viability of a Threat Model that involves Multiple Shoulder Surfers. received an Honorable Mention Award (top 5% submissions) at MUM 2017. October 2017 Our article was accepted for publication in the Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (PACM IMWUT). I will present the journal article at UbiComp 2018 in Singapore. October 2017 I will present a paper at MUM 2017 in Stuttgart, Germany. August 2017 I will present a paper at UIST 2017 in Quebec City, Canada, and a paper at ICMI 2017 in Glasgow, Scotland. June 2017 The presentation of our award winning paper at CHI 2017 is now online. Watch it here. May 2017 Received an Excellent Review recognition at CHI 2017. April 2017 Two papers were accepted and will be presented at PerDis 2017 in Lugano, Switzerland February 2017 Our paper titled Stay Cool! Understanding Thermal Attacks on Mobile-based User Authentication. received an Honorable Mention Award (top 5% of submissions) at CHI 2017. January 2017 I will co-present two full papers at CHI 2017 in Denver, CO, USA October 2016 I will present a short paper at MUM 2016 in Rovaniemi, Finland June 2016 I will present a full paper at UbiComp 2016 in Heidelberg, Germany I'm co-organizing the 6th PETMEI workshop which will take place in conjunction with UbiComp 2016. I'll also present a paper at PETMEI 2016. March 2016 Received the Google IoT Technology Research Award February 2016 I will present one of two accepted Late Breaking Works at CHI 2016 in San Jose, CA, USA July 2015 I will present two workshop papers at Ubicomp 2015 in Osaka, Japan May 2015 I will present a short paper at Interact 2015 in Bamberg, Germany December 2014 Transferred to the Media Informatics group at the University of Munich (LMU) April 2014 Started my PhD at the German Research Center for Artificial Intelligence (DFKI) April 2013 Got accepted for the GERLS scholarship offered by the DAAD and the MHESR July 2012 Received my M.Sc. degree in Computer Science & Engineering from the GUC March 2012 Left the DFKI and started working at the GUC",
  "content_length": 8760,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:01"
}