{
  "name": "Mohammad H. Al-Towaiq",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=towaiq",
  "status": "success",
  "content": "Mohammad Hasan Al-Towaiq × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content mohammad hasan al-towaiq --- Ph L0 Department of Mathematics and Statistics towaiq@just.edu.jo Website Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Mathmatics from State University of New York At Stony Brook, 1985 Msc. of Mathmatics from State University of New York At Stony Brook, 1982 Bsc. of Mathematics from The William Paterson College of New J., 1981 Publications Mohammad H. Al-Towaiq, \"Modified Parallel Algorithm for the Solutions of PDE's in Linux Clustered Workstations,\" Journal of Applied Mathematics and Computation, vol. 200, no. 2008, pp. 178-188, 2008 Mohammad H. Al-Towaiq, \"Clustered Gauss-Huard Algorithm for the Solution of Ax = b\",\" Journal of Applied Mathematics and Computation, vol. 184, no. 2007, pp. 485-595, 2007 Mohammad H. Al-Towaiq, \"An Implementation of A Parallel Iterative Algorithm for the Solution of Large Banded Systems on a Cluster of Workstations,\" International Journal of Modeling and Simulation, vol. 28, no. 4, pp. 1-19, 2008 Mohammad H. Al-Towaiq, \"Performance Evaluation of Database Systems Using Colored Petri Nets,\" Journal of Science and Technology, vol. 8, no. -, pp. 33-46, 2003 Mohammad H. Al-Towaiq, \"An Improved Algorithm for the Solution of Sparse Linear Systems,\" J. Inst. Math. & Computer Sciences, vol. 14, no. 1, pp. 63-69, 2003 Mohammad H. Al-Towaiq, \"A Central Limit Theorem for Absorbing Markov Chains with Absorbing Subchain,\" J. Advances in Modelling & Analysis, AMSE, vol. 37, no. 3, pp. 15-22, 2000 K. Day and M. Al-Towaiq, \"An Efficient Parallel Gauss-Seidel Algorithm on a 3D Torus Network-on-Chip ,\" SQU Journal for Science, vol. 20, no. 1, pp. 29-38, 2015 Ameina Nuseir and M. Al-Towaiq, \"The Modified Variational Iteration Method for Solving the Impenetrable agar Model Problem.,\" International Journal of Pure and Applied Mathematics, vol. 96, no. 4, pp. 445-456, 2014 M. Al-Towaiq, \"Parallel Implementation of the Gauss-Seidel Algorithm on K-ary N-Cub Machine ,\" Journal of Applied Mathematics, vol. 4, no. , pp. 177-182, 2013 M. Al-Towaiq, \"Qualitative Study of an Adaptive Three Species Predator-Prey Model.,\" Far East Journal of Applied Mathematics, vol. 70, no. 2, pp. 123-138, 2012 M. Al-Towaiq and K. Day, \"Parallel Gauss-Seidel on A TORUS NETWORK-ON-CHIP Architecture,\" Journal of Interconnection Networks, vol. 13, no. 1 & 2, pp. 1-14, 2012 Eyas El-Qawasmeh, Ahmed Mansour, and Mohammad Al-Towaiq, \"Development of a New Compression Scheme,\" Published in: F. Zavoral et al. (Eds.): NDT 2010, Part I, Spriger-Verlag Berlin Heidelberg, vol. 78, no. , pp. 85-90, 2010 M. Al-Towaiq and Osama Alayed, \"AN EFFICIENT ALGORITHM BASED ON THE CUBIC SPLINE FOR THE SOLUTION OF BRATU-TYPE EQUATION,\" J. of Interdisciplinary Mathematics, vol. 17, no. 5 & 6, pp. 471-484, 2014 M. Al-Towaiq, Abdallah Obeidat, and Assma Al-Momani, \"Clustered Diagnally Explicit Runge-Kutta Method for the Solution of Systems of Differential Equations,\" J. of Parallel and Cloud Computing, vol. 2, no. 3, pp. 58-64, 2013 M. Al-Towaiq and Hasan Al-Bzoor, \"An Efficient Algorithm for the Solution of Second Order Linear PDE,\" Journal of Discrete Mathematical Sciences and Cryptography, vol. 14, no. 1, pp. 9-31, 2010 Ameen Alawneh, Kamel Al-Khaled, and Mohammed Al-Towaiq, \"Reliable algorithm for solving integro-ddiferential equation with applications,\" International Journal of Computer Mathematics, vol. 87, no. 7, pp. 1538-1554, 2010 Feras Awad and M. Al-Towaiq, \"Parallel Algorithm for the Solutions of PDE's in Linux Clustered Workstations,\" Journal of Applied Mathematics and Computation, vol. 200, no. , pp. 178-188, 2008 M. Al-Towaiq, \"Clustered Gauss-Huard Algorithm for the Solution of Ax = b,\" Journal of Applied Mathematics and Computation, vol. 184, no. 2, pp. 485-595, 2007 M. Al-Towaiq, F. Masoud, A.B. Mnaour, K. Day, \"An Implementation of A Parallel Iterative Algorithm for the Solution of Large Banded Systems on a Cluster of Workstations,\" International Journal of Modeling and Simulation, vol. 28, no. 4, pp. 378-386, 2008 M. Al-Towaiq , K. Day, and E. Al-Daoud, \"An Improved Algorithm for the Solution of Sparse Linear Systems,\" J. Inst. Math. & Computer Sciences, (Comp. Sci. Ser.) , vol. 14, no. 1, pp. 63-69, 2003 A. B. Mnaouer, K. Day, M. Al-Towaiq, F. Masoud, \"Performance Evaluation of Database Systems Using Colored Petri Nets,\" Journal of Science and Technology, SQU, vol. 8, no. , pp. 33-46, 2003 M. Al-Towaiq and B. Al-Eideh, \"A Central Limit Theorem for Absorbing Markov Chains with Absorbing Subchain,\" J. Advances in Modelling & Analysis, AMSE, vol. 37, no. 42433, pp. 15-21, 2000 M. Al-Towaiq, \"Asymptotic normality of maximum likelihood estimators for multiparamater Markov chains,\" J. of Information and Optimization Sciences, vol. 20, no. 2, pp. 309-312, 1999 M. Al-Towaiq, \"An Improved Algorithm for the Iterative Refinement Method,\" J. of Discrete Mathematical Sciences & Cryptography,, vol. 2, no. 1, pp. 73-76, 1999 M. Al-Towaiq, \"Reverse process of absorbing Markov chains with r absorbing states,\" J. of Information and Optimization Sciences, vol. 16, no. 2, pp. 277-280, 1995 B. Al-Eideh and M. Al-Towaiq, \"Limiting Distributions for Absorbing Markov Chains with r Absorbing States,\" J. Modelling, Measurement and Control, vol. A 29, no. 42371, pp. 17-24, 1995 M. Al-Towaiq and B. Al-Eideh, \"Quasi Stationary Distribution in Absorbing Markov Chains with r Absorbing States,\" J. of Information and Optimization Sciences, vol. 15, no. 2, pp. 89-95, 1994 M. Smadi and M. Al-Towaiq, \"A Note on Jackknife Estimators and Empirical Results for the First and Second Order Autoregressive Process,\" J. of Information and Optimization Sciences, vol. 13, no. 3, pp. 399-406, 1992 M. Al-Towaiq and B. Al-Eideh, \"An Application of the McNemar Test for the Existence of Absorbing Subchains in a Given Markov Chain,\" J. of Information and Optimization Sciences, vol. 12, no. 3, pp. 467-475, 1991 M. Smadi and M. Al-Towaiq, \"Empirical Comparison for Bays Estimator for the Parameter of AR(1) Process in Case of Short Series,\" J. of Information and Optimization Sciences, vol. 2, no. 2, pp. 229-233, 1991 M. AL-Towaiq, \"A Direct Method for the Solution of Large Systems of Linear Equations Using Incomplete LU-Factorization,\" Mathematica Japonica, vol. 34, no. 5, pp. 675-682, 1989 M. AL-Towaiq, \"A Two-Term Iterative Solution Scheme for Linear Sparse Systems,? ,\" ISNA, METU, vol. , no. , pp. 123-140, 1987 K. Day and M. Al-Towaiq, \"A Parallel Gauss-Seidel Algorithm on a 3D Torus Network-on-Chip Architecture,\" 9th International Workshop on Interconnection Network Architecture: On-chip, Multi-Chip, Amsterdam, Netherlands., Jan , pp. 13-16 K. Day and M. Al-Towaiq, \"Parallel Gauss-Seidel on A TORUS NoC Architecture,\" 1st IASTED International Symposium on Power and Energy, Marina del Rey, USA, Nov , pp. 795- Rehab Duwairi, Ebraheem Elhaddadand, M. Al-Towaiq, \"Coupling Web Usage Mining with Content Mining for Recommendation Systems ,\" 14th World Multiconference on Systemics, Cypemetics, and Informatics, Orlando, USA, Jun 2010, pp. 142-146 Eyas El-Qawasmeh, Ahmed Mansour, and Mohammad Al-Towaiq, \"Development of a New Compression Scheme,\" Published in: F. Zavoral et al. (Eds.): NDT 2010, Part I, CCIS 87, 2010, pp. 85-90 Eyas El-Qawasmeh, M. Al-Towaiq, and Vaclav Snasel, \"Increasing the Efficiency of Data Compression,\" NaCSES'07, Kuantan, Malaysia, Aug 2007, pp. 1-6 Al-Towaiq and Huda Al-Aamri, \"Parallel Implementation of Gauss-Huard Algorithm on a Cluster of Linux Workstations,\" IADIS International Conference on Applied Computing , Lisbon, Portugal, Mar 2004, pp. 543-550 K. Day, M. Al-Towaiq, F. Masoud, A. B. Mnaouer, \"Comparative Performance Evaluation of Client-Server Database Systems,\" International Arab Conference on Information Technology, Alexandria, Egypt, Dec 2003, pp. 254-261 M. Al-Towaiq and Huda Al-Amri , \"A Parallel Implementation of GESPP on a Cluster of Silicon Graphics Workstations,\" Ninth IEEE Inter. Conf. On Parallel and Distributed Systems, Taiwan, Dec 2002, pp. 226-230 A.B. Mnaouer, K. Day, M. Al-Towaiq and F.A. Masoud, \"Colored Petri Nets Based Modeling and Simulations of Replicated Database Systems,\" 2002 Inter. Conf. On Information and Knowlede Engg. , Las Vegas, USA, Jun 2002, pp. 606-613 K. Day, F.A. Masoud, A.B. Mnaouer and M. Al-Towaiq, \"Centeralized Versus Replecated Client-Server Database Systems,\" IASTED Inter. Conf. On Applied Informatics, Innsbruck, Austria, Feb 2002, pp. 295-299 M. Al-Towaiq, K. Day, A. Mnaouer, F. Masoud, \"A New Parallel Algorithm for the Solution of Large Banded Shifted Systems,\" IASTED Inter. Conf. (ASM 2001), Spain, Sep 2001, pp. 355-358 K. Day, A. B. Mnaouer, F. Masoud, and M. Al-Towaiq , \"A Fault-Tolerant Asynchronous Data Replication Protocol ,\" 19th IASTED International Conference on Applied Informatics, AI?2001, Innsbruck, Austria, Feb 2001, pp. 59-63 Dean of Admission and Registration and Students Affairs, Dar AlUloom University, Saudi Arabia, Sep 2011- Aug 2013 BASICS IN COMPUTER CALCULUS 2 CALCULUS I COMPREHENSIVE EXAM COMPUTATION THEORY ELEMENTS OF STATISTICS INDEPENDENT STUDIES LINEAR PROGRAMMING AND APPLICATIONS MATHEMATICAL APPLICATIONS OF BIOLOGICAL SCIENCES MATHEMATICS FOR PHARMACEUTICS NUMERICAL ANALYSIS NUMERICAL ANALYSIS (1) NUMERICAL ANALYSIS (2) OPERATIONS RESEARCH ORDINARY DIFFERENTIAL EQUATIONS PRACTICAL TRAINING PROBABILITY & STATISTICS (FOR COMPUTER SCIENCES STUDENTS) PROBABILITY & STATISTICS( FOR ENGINEERING STUDENTS) PROGRAMMING IN C++ SELECTED PROGRAMMING LANGUAGES (FOR NON COMPUTER SCIENCE INFORMATION STUDENTS) SEMINAR THEORY OF COMPUTING WEB DEVELOPMENT Academics Academic Calendar Course Schedule Graduate Studies Resources IT Helpdesk Services Library Maharat Open Online Courses News Center Information Classification Policy Information Request Form Information & Feedback Alumni EU Projects Job Opportunities Complaints & Suggestions Ne",
  "content_length": 10473,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:17"
}