{
  "name": "Mohammad Obaid",
  "homepage": "https://research.chalmers.se/en/person/mobaid",
  "status": "success",
  "content": "Chalmers Research: Mohammad Obaid Mohammad Obaid Associate Professor at Interaction Design and Software Engineering Source: chalmers.se Contact Details ORCID Publications (72) Projects (3) Showing 72 publications 2026 Co-designing for Pain Relief: Recommendations for Assistive Robotic Design Natalia Walczak, Martina De Cet, Mohammad Obaid et al Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Vol. 16108 LNCS, p. 60-69 Paper in proceeding 2026 Towards Public-Drone Interactions: Communicating Delivery Intentions to Recipients and Bystanders Shiva Nischal Lingam, Sebastiaan Martinus Petermeijer, Mohammad Obaid et al Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Vol. 16111 LNCS, p. 317-321 Paper in proceeding 2025 Breaking the Binary: A Systematic Review of Gender-Ambiguous Voices in Human-Computer Interaction Martina De Cet, Mohammad Obaid, Ilaria Torre Conference on Human Factors in Computing Systems - Proceedings Paper in proceeding 2025 Sketching Robots: Exploring the Influence of Gender-Ambiguous Voices on Robot Perception Martina De Cet, Miriam Amber Sturdee, Mohammad Obaid et al ACM/IEEE International Conference on Human-Robot Interaction. Vol. In Press, p. 103-112 Paper in proceeding 2025 Editorial: Towards HRI of everyday life Karolina Zawieska, Mohammad Obaid, Wafa Johal Frontiers in Robotics and AI. Vol. 12 Other text in scientific journal 2025 EXplainable AI Interfaces with (and for) Expert Operators: A Participatory Design Approach Negin Hashmati, Hugo Wärnberg, Emmanuel Brorsson et al Proceedings of the 36th Australasian Conference on Human Computer Interaction Ozchi 2024, p. 324-336 Paper in proceeding 2025 The Future is Near: Design Fiction Explorations of Virtual Companions Negin Hashmati, Therése Skoog, Mohammad Obaid et al Iva 2025 Adjunct Proceedings of the 25th ACM International Conference on Intelligent Virtual Agents, p. 1-3 Paper in proceeding 2025 Hearing Ambiguity: Exploring Beyond-Gender Impressions of Artificial Ambiguous Voices Martina De Cet, Katie Seaborn, Mohammad Obaid et al Cui 2025 Proceedings of the 2025 ACM Conference on Conversational User Interfaces Paper in proceeding 2025 The Role of Drone's Digital Facial Emotions and Gaze in Shaping Individuals' Social Proxemics and Interpretation Robin Bretin, Mohamed Khamis, Emily Cross et al ACM Transactions on Human-Robot Interaction. Vol. 14 (3) Journal article 2025 In-Car Interface Design to Support Electric Taxi Drivers' Charging Decisions Adam El Jabaoui, Sofia Sjöblad, Micaela Nilsson et al Chitaly 2025 Proceedings of the 16th Biannual Conference of the Italian Sigchi Chapter Paper in proceeding 2024 A User-Centred Representation of Battery Health in Electric Vehicles Natthamon Pongchanchai, Liina Tumma, Micaela Nilsson et al 16th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, AutomotiveUI 2024 - Adjunct Conference Proceedings, p. 166-171 Paper in proceeding 2024 HoneyPot: Connecting Through a Mediated Ambient Plant Ebba Ahlqvist, Amanda Machado, Annie Li et al ACM International Conference Proceeding Series Paper in proceeding 2024 Prototyping An Interactive Ambient Plant for Meditation Diana Boskovic, Isabelle Ermeryd Tankred, Qingyuan Ma et al ACM International Conference Proceeding Series Paper in proceeding 2024 Social Drones for Health, Well-Being, Sports and Play Aswin Balasubramaniam, Dennis Reidsma, Mohammad Obaid et al ACM International Conference Proceeding Series Paper in proceeding 2024 Editorial: Creative approaches to appropriation and design: novel robotic systems for heterogeneous contexts Richard Paluch, Felix Carros, Galina Volkova et al Frontiers in Robotics and AI. Vol. 11 Other text in scientific journal 2024 Do Your Expectations Match? A Mixed-Methods Study on the Association between a Robot's Voice and Appearance Martina De Cet, Martina Cvajner, Ilaria Torre et al Proceedings of the 6th Conference on ACM Conversational User Interfaces, CUI 2024, p. 1-11 Paper in proceeding 2024 Enhancing Functional and Extra Motor Abilities: A Focus Group Study on the Re-Design of an Extra-Robotic Finger Sjoerd Hendriks, Basma Hasanen, Naqash Afzal et al IEEE International Workshop on Robot and Human Communication, RO-MAN, p. 667-673 Paper in proceeding Show project 2024 The Undertable: A Design Remake of the Mediated Body Sjoerd Hendriks, Mafalda Samuelsson-Gamboa, Mohammad Obaid Proceedings of the 2024 ACM Designing Interactive Systems Conference, DIS 2024, p. 2591-2610 Paper in proceeding Show project 2023 HighLight: Towards an Ambient Robotic Table as a Social Enabler Alessandro Cabrio, Negin Hashmati, Philip Rabia et al ACM/IEEE International Conference on Human-Robot Interaction, p. 146-150 Paper in proceeding Show project 2023 From Pain to Design Recommendations for Assistive Robotics Natalia Walczak, Martina De Cet, A. Romanowski et al ACM International Conference Proceeding Series, p. 428-430 Paper in proceeding 2023 Towards Energy Efficient Driving: Prototyping a Cross-Device Coaching Experience for Electric Car Drivers Ebba Lindberg, Linda Silberberg, Micaela Nilsson et al ACM International Conference Proceeding Series, p. 197-202 Paper in proceeding 2023 Exploring Runners' Preferences of Drone Based Feedback to Support their Well-Being Aswin Balasubramaniam, Dennis Reidsma, Mohammad Obaid et al ACM International Conference Proceeding Series Paper in proceeding 2023 An Expressive Robotic Table to Enhance Social Interactions Jonte Herben, Elin Högman Möller, Johanna Penner et al ACM/IEEE International Conference on Human-Robot Interaction, p. 151-155 Paper in proceeding Show project 2023 Collective co-design activities with children for designing classroom robots Mohammad Obaid, Gökçe Elif Baykal, Güncel Klrlanglç et al ACM International Conference Proceeding Series, p. 229-237 Paper in proceeding 2023 Championing Design Knowledge in Human-Drone Interaction Research Mafalda Samuelsson-Gamboa, Sara Ljungblad, Wafa Johal et al ACM International Conference Proceeding Series, p. 365-368 Paper in proceeding 2023 Tables Got Moves: A Review on Actuated Table Designs Sjoerd Hendriks, Michael Heron, Mohammad Obaid ACM International Conference Proceeding Series Paper in proceeding Show project 2022 HAI2022 Chairs' Welcome C. Bartneck, Takayuki Kanda, Mohammad Obaid et al HAI 2022 - Proceedings of the 10th Conference on Human-Agent Interaction, p. III-IV Other conference contribution 2022 Design Recommendations for Historical Cemeteries Using Speculative Design Linda Hirsch, Florian Hild, Mohammad Obaid ACM International Conference Proceeding Series, p. 147-157 Paper in proceeding 2022 A Taxonomy of Functional Augmented Reality for Human-Robot Interaction Ornnalin Phaijit, Mohammad Obaid, Claude Sammut et al ACM/IEEE International Conference on Human-Robot Interaction. Vol. 2022-March, p. 294-303 Paper in proceeding 2022 4th Space as Smart Information Ecology with Design Requirements of Sustainability, Ethics and Inclusion Gordana Dodig Crnkovic, Sara Ljungblad, Mohammad Obaid Proceedings (MDPI). Vol. 81 (1), p. 124-127 Paper in proceeding Show project 2022 Envisioning social drones in education Wafa Johal, Doğa Gatos, A.E. Yantaç et al Frontiers Robotics AI. Vol. 9 Journal article 2022 Social Drones for Health and Well-being Mohammad Obaid, Kivanc Tatar, Mikael Wiberg et al NordiCHI '22: Adjunct Proceedings of the 2022 Nordic Human-Computer Interaction Conference Paper in proceeding 2022 A Speculative Design Approach to Investigate Interactions for an Assistant Robot Cleaner in Food Plants Anna Grafström, Moa Holmgren, Simon Linge et al ACM International Conference Proceeding Series Paper in proceeding 2022 A Demonstration of the Taxonomy of Functional Augmented Reality for Human-Robot Interaction Ornnalin Phaijit, Mohammad Obaid, Claude Sammut et al ACM/IEEE International Conference on Human-Robot Interaction. Vol. 2022-March, p. 981-985 Paper in proceeding 2021 Robotics Aids for Character Building: More than Just Another Enabling Condition Massimiliano L. Cappuccio, E.B. Sandoval, O. Mubin et al International Journal of Social Robotics. Vol. 13 (1) Other text in scientific journal 2021 Ritual drones: Designing and studying critical flying companions Mafalda Samuelsson-Gamboa, Mohammad Obaid, Sara Ljungblad ACM/IEEE International Conference on Human-Robot Interaction, p. 562-564 Paper in proceeding 2021 What Matters in Professional Drone Pilots’ Practice? An Interview Study to Understand the Complexity of Their Work and Inform Human-Drone Interaction Research Sara Ljungblad, Yemao Man, Mehmet Aydin Baytas et al Conference on Human Factors in Computing Systems - Proceedings Paper in proceeding 2021 Robots in education: An introduction to high-tech social agents, intelligent tutors, and curricular tools Fady Alnajjar, C. Bartneck, Paul Baxter et al Book 2021 Can Robots Make us Better Humans? Virtuous Robotics and the Good Life with Artificial Agents Massimiliano L. Cappuccio, Eduardo B. Sandoval, Omar Mubin et al International Journal of Social Robotics. Vol. 13 (1), p. 7-22 Journal article 2021 DroRun: Drone visual interactions to mediate a running group Birgir Baldursson, Tim Björk, Lisa Johansson et al ACM/IEEE International Conference on Human-Robot Interaction, p. 148-152 Paper in proceeding 2020 HAI 2020 Chairs' Welcome Mohammad Obaid, O. Mubin, Yukie Nagai et al HAI 2020 - Proceedings of the 8th International Conference on Human-Agent Interaction, p. III-IV Other conference contribution 2020 Engagement in Human-Agent Interaction: An Overview Catharine Oertel, Ginevra Castellano, Mohamed Chetouani et al Frontiers in Robotics and AI. Vol. 7 Review article 2020 Domestic Drones: Context of Use in Research Literature Mohammad Obaid, Wafa Johal, O. Mubin HAI 2020 - Proceedings of the 8th International Conf",
  "content_length": 19733,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:19"
}