{
  "name": "Mohamed S. Abdelfattah [Tech]",
  "homepage": "https://www.mohsaied.com",
  "status": "success",
  "content": "Mohamed S. Abdelfattah I am looking for post-docs that are broadly interested in efficient AI hardware or systems. Get in touch and apply to the EmpireAI fellowships at Cornell. × My Office: Bloomberg Center 257 Cornell Tech 2 West Loop Road New York, NY 10044 My research group is investigating how best to build the next generation of machine-learning-centric computer systems. We study methods to co-design and co-optimize neural networks and the hardware on which they run, with a special interest in reconfigurable computing. Our goal is to enable efficient deep learning in both mobile devices and datacenters. Our current research projects include: End-to-end efficiency for large language Models (LLMs). Automated machine learning (AutoML) and neural network compression. New hardware architectures for machine learning. Programmable hardware architectures based on FPGAs. News Sep 2025 We launched our research group website. Apr 2025 Palu accepted to ICLR’25. Mar 2025 BitMoD accepted to HPCA’25. Feb 2025 Mohamed gave a talk at Tower Research conference on synthetic software. Dec 2024 Mohamed gave a talk at the LG AI Seminar. Nov 2024 ShadowLLM accepted to EMNLP’24. Nov 2024 BBS accepted to MICRO’24. Sep 2024 FLIQS accepted to AutoML’24 and won best paper award! Sep 2024 Kratos accepted to FPL’24. Aug 2024 LLM Quantization (students’s t-distributions) accepted to ICML’24. Aug 2024 Generative NAS accepted to ICML’24. Aug 2024 NAS Encodings accepted to ICML’24. Jun 2024 Beyond Inference accepted to DAC’24. May 2024 NAS Latency Predictors accepted to MLSYS’24. May 2024 PQA accepted to TRETS and FCCM’24. Jan 2024 Mohamed received the NSF CAREER Award to codesign efficient LLM HW/SW and algorithms. Jan 2024 Mohamed gave a talk at Qualcomm Research on efficient on-device AI. Dec 2023 Mohamed gave talks at Yale University and KAUST on efficient machine learning. Oct 2023 M4BRAM accepted to FPT’23. Jul 2023 DiviML accepted to ICCAD’23. Jun 2023 Our group received a NSF Award to study fine-grained DNN sparsity. May 2023 Multi-Predict accepted to AutoML’23. May 2023 Mohamed participated on a panel titled “Efficient Scaling of LLMs” at FCCM’23. Apr 2023 BRAMAC accepted to FCCM’23. Feb 2023 Zero-Cost Operation Scoring accepted to AAAI. Feb 2023 Our extended work on Logic Shrinkage has been accepted to TRETS. Dec 2022 Mohamed gave talks at Zewail UST, Rutgers Efficient AI Seminar, Untether AI, and FAI Summit. Oct 2022 BLOX accepted to NeurIPS’22 D&B Track. Oct 2022 Our group received an Intel grant to study hardware-accelerated DNN inference Sep 2022 Adaptable Butterfly Accelerator paper accepted to MICRO’22. Sep 2022 Mohamed gave a keynote at the International Symposium for Applied Reconfigurable Computing. Sep 2022 Mohamed gave a talk at the AutoML seminar. Aug 2022 Our group received a Meta Research Award in Networking for AI. Apr 2022 Mohamed gave a talk at the Crossroads FPGA seminar. Mar 2022 We received a TCS Research Award to study heterogeneous DNN computing. Jan 2022 Logic shrinkage paper accepted to FPGA’22 and nominated for the best paper award! Jan 2022 Mohamed and Jordan joined the International Centre for Spatial Computational Learning. Jan 2022 Moved to NYC and started at Cornell Tech! Jan 2019 Moved to the UK and started work at the Samsung AI Center in Cambridge. Aug 2016 Defended my PhD and started work at Intel’s Programmable Solutions Group in Toronto.",
  "content_length": 3417,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:02"
}