{
  "name": "Mohammad-Reza Siadat",
  "homepage": "https://oakland.edu/secs/directory/siadat",
  "status": "success",
  "content": "Mohammad-Reza Siadat, Ph.D. - School of Engineering and Computer Science - Oakland University Mohammad-Reza Siadat, Ph.D. School of Engineering and Computer Science Engineering Center, Room 301 115 Library Drive Rochester , MI 48309-4479 (location map) Dean's Office (248) 370-2217 Academic Advising (248) 370-2201 [email protected] School of Engineering and Computer Science Engineering Center, Room 301 115 Library Drive Rochester , MI 48309-4479 (location map) Dean's Office (248) 370-2217 Academic Advising (248) 370-2201 [email protected] Associate ProfessorComputer Science and Engineering Department(248) 370-2230[email protected]Ph.D., Wayne State University Teaching Visual Computing Advanced Visual Computing Pattern Recognition and Machine Learning Computer Problem Solving Design and Analysis of Algorithms Research Medical Signal and Image Processing Computational Anatomy and Physiology Medical Informatics The goals are utilization of the wealth of available medical data to the fullest for data-driven and patient-specific diagnosis, treatment planning and prognosis. Selected Publications “Unstructured Medical Image Query using Big Data – An Epilepsy Case Study,” Journal of Biomedical Informatics, Vol. 59, pp. 218–226, 2016. “Analysis of Incomplete and Inconsistent Clinical Survey Data,” Journal of Knowledge and Information Systems, Vol. 46, Issue 3, pp 731-750, 2016. “Validation of Brain Connectivity Analysis using fMRI Simulation,” Int. J. of Engin. Sys. Modelling and Simulation, Vol. 7, No. 4, pp. 279–293, 2015. “Conversion of a Surface Model … into a Volume Model for Medical Image Retrieval,” Applied Medical Informatics, Vol. 36, No. 2, pp. 9-30, 2015. “Continence Index: a New Screening Quest. to Predict Probability of Incont.…,” Int. Urology and Nephrology, Vol. 47, No. 7, pp 1091-1097, 2015. “Stratification of Clinical Survey Data Using Contingency Tables,” Int. J. of Data Mining and Knowledge Management Process, Vol.4, No.4, July 2014. “A Simulation … Feature Selection Methods Utilizing Gene Ontology for Gene Expr. Classif.,” J. of Biomed. Info., Vol. 46, No. 6, pp. 1044-59, 2013. “Comparison Improved Feature Select. by Incorp. Gene Similarity into LASSO,” Int. J. of Knowl. Discovery in Bioinf., Vol. 3, No. 1, pp. 1-19, 2012. “Novel Application of Statistical Methods to Identify Urinary Incontinence Risk Factors,” The Journal of Advances in Urology, Vol. 2012, pp. 1-8, 2012. LCME Accreditation Policies and Guidelines GDPR Policy Consumer Information ©2025 Oakland University William Beaumont School of Medicine✎ Connect with Us Oakland University All Rights Reserved ✎",
  "content_length": 2619,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:22"
}