{
  "name": "Mohammad Shahrad",
  "homepage": "https://ece.ubc.ca/mohammad-shahrad",
  "status": "success",
  "content": "Mohammad Shahrad - Department of Electrical and Computer Engineering Search Faculty of Applied ScienceDepartment of Electrical and Computer Engineering Home Undergraduate Admissions Programs Awards and Funding Undergraduate Teaching Assistantships Undergraduate Student Advising Peer Advisors Undergraduate Course List Capstone Opportunities Vancouver Summer Program Graduate Programs Awards and Funding Graduate Teaching Assistantships TA Access to Canvas Graduate Student Advising Graduate Course List Policies and Procedures Research Biomedical Technologies Communication Systems Computer and Software Systems Emerging Micro/Nano Technologies Energy Systems Optimization, Learning, Control People Faculty Directory Staff Directory Student Life Societies and Clubs Student Design Teams Health & Wellness Mentorship Academic Resources for Students News & Events ECE Calendar ECE News Archive Graduate Student Newsletter Archive Past Events ECE Graduate and Postdoctoral Studies Student Perspective Stories Engage with ECE Industry Partnerships Alumni Communicate with ECE EDII Suggestion Box About Head’s Message Careers Faculty Positions Staff Positions Safety in ECE Room Bookings Contact Us ECE Logos, Backgrounds, and Templates Powerpoint Templates ECE Zoom Backgrounds » Home » Mohammad Shahrad Mohammad Shahrad Assistant Professor B.Sc. (Sharif University of Technology, Iran), M.A. and Ph.D. (Princeton University, USA) Office: KAIS 4046Phone: (604) 827-3968Email: mshahrad@ece.ubc.ca Website Publications LinkedIn UBC Researcher Profile Mohammad Shahrad is an Assistant Professor of Electrical and Computer Engineering at The University of British Columbia (UBC). At the intersection of software systems and computer architecture, his research is focused on building resource-efficient cloud computing systems. He has worked across the computing stack toward this goal. This includes building novel scheduling schemes for different cloud workloads, modeling user-provider interactions to propose new pricing models, and building a new processor for efficient off-chip scalability of cloud workloads. Mohammad’s recent focus has been on enabling and efficiently managing emerging cloud services, such as serverless computing. He has collaborated with different industry teams in this space. Mohammad’s research has been deployed in production, won the USENIX Community Award, and been featured in the CACM Research Highlights. Prior to joining UBC, Mohammad was a Computer Science Lecturer at Princeton University. He holds a Ph.D. in Electrical Engineering from Princeton University and spent a year at Microsoft Research working on cloud efficiency projects. Dr. Shahrad welcomes Ph.D. applications from students interested in cloud-related research topics. Please check his website for further details. Research Interests Cloud computing, serverless computing, resource management, data center efficiency Research Areas Computer and Software Systems Research Groups Cloud Infrastructure Research for Reliability, Usability, and Sustainability (CIRRUS) << Back to Faculty Department of Electrical and Computer Engineering 5500-2332 Main Mall Vancouver, BC Canada V6T 1Z4 Tel 604 822 0895 Fax 604 822 5949 Email help@ece.ubc.ca Find us on We acknowledge that the UBC Point Grey campus is situated on the traditional, ancestral, and unceded territory of the xʷməθkʷəy̓əm (Musqueam).",
  "content_length": 3390,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:22"
}