{
  "name": "Mohammad Alian",
  "homepage": "https://alian.csl.cornell.edu",
  "status": "success",
  "content": "Mohammad Alian | ECE at Cornell Mohammad Alian Assistant Professor Computer Systems Laboratory School of Electrical and Computer Engineering Cornell University office : 322 Rhodes Hall email : malian cornell edu links : Research Group | Google Scholar | LinkedIn | github | Curriculum Vitae Biography Mohammad Alian serves as an Assistant Professor in the ECE Department at Cornell University. He completed his Ph.D. and MS degrees from UIUC (2020) and UW-Madison (2015), respectively. His research team is focused on redefining the data-delivery hierarchy of future data centers. Mohammad's research has garnered recognition, including best paper nominations at HPCA 2017 and MICRO 2018, an IEEE Micro Top Picks Honorable Mention in 2017, and an NSF CAREER award. He serves as a co-lead Principal Investigator and Broadening Participation Champion for the SRC/DARPA JUMP 2.0 ACE Center for Evolvable Computing, with the primary objective of revolutionizing distributed computing for the next decade. I always look for motivated students. Please read this if you are interested in joining ARG. News 10/22/2025 Multi-Stage Data-Centric Dense Retrieval accepted to IEEE MICRO special issue on data-centric computing! Congrats to Derrick and the team! 10/18/2025 Zuoming Fu presented gem5 co-pilot in CAMS workshop, in conjunction with MICRO 2025! 10/18/2025 Delivered the key-note talk in Re-LAMP workshop, in conjunction with MICRO 2025! 07/15/2025 Inducted into the MICRO Hall of Fame! 07/15/2025 LongSight, an algorithmic-hardware co-design approach for enabling long context LLMs accepted to MICRO! Congrats to Derrick and the team! 06/15/2025 RACER, a framework to avoid end-to-end slowdowns in CPUs with on-chip accelerators accepted to ACM TACO! Congrats to Neel! 05/19/2025 Compute-Enabled CXL Memory Expansion for Efficient Retrieval Augmented Generation accepted to IEEE MICRO! Congrats to Derrick and Neel! 04/25/2025 XRT, an accelerator-aware runtime for accelerated chip multiprocessors accepted to USENIX ATC! Congrats to Neel! 03/23/2025 DReX, accurate and scalable dense retrieval acceleration accepted to ISCA! Congrats to Derrick! More 03/10/2025 Invited to present our research on retrieval systems acceleration to Samsung and SK-Hynix as part of SRC's Asia tour! 03/05/2025 Simultaneous Data-Delivery Threads accepted to CAL! 03/03/2025 Circuit-level DRAM datapath model accepted to ISPASS as a poster! 10/02/2024 Accelerating Retrieval Augmented Generation accepted to ASPLOS-2025! Congrats to Derrick, Mohammad, and Neel! 09/01/2024 Invited to talk at 1st International Workshop on Sustainable AI at ETH Zurich! 07/31/2024 Per-Bank Bandwidth Regulation of Shared Last-Level Cache for Real-Time Systems accepted to RTSS! 07/01/2024 Moved to Cornell ECE! 04/02/2024 Silicon Efficiency in Post-Moore Servers accepted to HotEthics! 03/31/2024 Userspace networking in gem5 accepted to ISPASS! Congrats to Johnson! Here is the github repo for the extensions. 02/28/2024 Presented our work on accelerating Retrieval Augmented Generation (RAG) to Micron! 11/07/2023 DSCS-Serverless got accepted to ASPLOS 2024! 10/22/2023 SmartDIMM and DMX papers got accepted to HPCA 2024! Congrats to Neel and Amin! 09/16/2023 XFM received all the artifact evaluation ACM badges from MICRO 2023! 09/15/2023 Our project to enhance gem5 simulator ecosystem is selected for funding by NSF! This is a $3.5M collaborative project led by Jason Lowe-Power at UC-Davis! 07/24/2023 XFM accepted to MICRO 2023! 07/20/2023 Serving on HPCA 2024 PC! 07/10/2023 Our AI-Assisted Just-in-Time Scaffolding Framework for Exploring Modern Computer Design is selected for funding by NSF! 07/01/2023 Serving as the Broadening Participation Champion for ACE center! 06/26/2023 Giving a talk on inteligent data steering for Tbps networks in MPSoC Forum! 06/17/2023 Giving a talk on sustainability of architectural simulation in the gem5 workshop in conjunction w/ ISCA! 05/12/2023 Received the Miller Faculty Scholar Award from KU School of Engineering! 04/12/2022 Serving on MICRO 2023 PC! 03/29/2023 Received $5k cloud access credit under the NSF CloudBank award for our research! 03/22/2023 Received an NSF CAREER award for research on near-memory datacenter network! 02/28/2023 gem5 profiling accepted to ISPASS 2023! 02/24/2023 Neel and Johnson presenting their research in YArch and FireSim workshops hold in conjunction w/ ASPLOS! 02/12/2023 I am visiting EPFL PARSA Lab for one semester! 01/27/2023 Check out our latest addition to gem5! DPDK on gem5 is open source! 01/05/2023 Official announcement of the ACE Center for Evolvable Computing, funded by a $31.5 million grant from JUMP 2.0! 09/21/2022 Serving as travel grant chair on ISPASS 2023! 09/07/2022 Serving on ISCA 2023 ERC! 09/01/2022 Johnson is presenting a poster at ACM Student Research Competition in MICRO! 08/30/2022 Our team got second place in Open Innovation Contest for AXDIMM Technology 07/19/2022 IDIO got accepted to MICRO 2022! 07/15/2022 Presenting our recent research at Intel Labs! 07/08/2022 \"CCRI: Planning-C: Accelerated Infrastructure for Simulating Future Systems\" is selected for funding by NSF! 06/03/2022 Neel Patel received SFS scholarship. Congrats Neel! 03/10/2022 Two BlueField2 DPUs donated by NVIDIA! 12/15/2021 Our proposal is selected as one of the finalist in Open Innovation Contest for AXDIMM Technology! 08/01/2021 Samsung Grant! Research Areas of interest: Computer Architecture and Systems Vision: My research sees compute as a revolving paradigm around data delivery hierarchy (i.e., memory, storage, and network) and not the other way around, which is the conventional view. Check out our Research Group webpage to understand more about our research. Teaching ECE 6960: Special Topics: Datacenter Architecture Fall 2025 ECE 6960: Special Topics: Datacenter Architecture Spring 2025 Professional Activities Program Committee MICRO 2023, 2024, 2025 HPCA 2024, 2025 ISCA 2023, 2024, 2025 ISPASS 2022, 2025 Organizing Committee MICRO 2025 Publications Chair ISPASS 2023 Student Travel Grants Chair Useful Links ACE Center for Evolvable Computing Alian Research Group",
  "content_length": 6145,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:09"
}