{
  "name": "Mohammed J. Zaki",
  "homepage": "http://www.cs.rpi.edu/~zaki",
  "status": "success",
  "content": "Mohammed J. Zaki | Zaki Home Page Skip to main content Department Head Department of Computer Science Rensselaer Polytechnic Institute Troy, New York 12180-3590 Mohammed J. Zaki is a Professor and Department Head of Computer Science at RPI. He is also the co-director for the NSF IUCRC Center for Research Towards Advancing Financial Technologies (CRAFT). He received his Ph.D. degree in computer science from the University of Rochester in 1998. His research interests focus on novel data mining and machine learning techniques, particularly for learning from graph structured and textual data, with applications in bioinformatics, personal health and financial analytics. He has around 300 publications (and 6 patents), including the Data Mining and Machine Learning textbook (2nd Edition, Cambridge University Press, 2020). His research has won several best paper awards and nominations, including the EDBT'24 Test of Time Award. He is the founding co-chair for the BIOKDD series of workshops. He has served as associate editor for several journals, including Data Mining and Knowledge Discovery, Statistical Analysis and Data Mining, ACM Transactions on Knowledge Discovery from Data, and Social Networks and Mining. He was the program co-chair for SIGKDD, SDM, ICDM, PAKDD, BIBM, IEEE BigData, and CIKM conferences. He also served on the Board of Directors for ACM SIGKDD. He was a recipient of the National Science Foundation CAREER Award and the Department of Energy Early Career Principal Investigator Award, as well as HP Innovation Research Award, and Google Faculty Research Award. His research is supported in part by NSF, DARPA, NIH, DOE, IBM, Google, HP, and Nvidia. He is a Fellow of the IEEE, ACM, AAAS, and SIAM. Courses Data Mining Machine Learning in Bioinformatics Publications and Software You can find all of the publications and related sofware (and datasets, where applicable) at Publications You can directly access the software at my github page. You can also find my publications on and and Books",
  "content_length": 2023,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:28"
}