{
  "name": "Mohammadali Mohammadi",
  "homepage": "https://pure.qub.ac.uk/en/persons/mohammad-mohammadi",
  "status": "success",
  "content": "Mohammad Mohammadi - Queen's University Belfast View Scopus Profile Mohammad Mohammadi Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0002-6942-988X Emailm.mohammadiqub.acuk 20132025 Research activity per year Personal profile Research InterestsCell-Free Massive MIMOMassive (large-scale) MIMO systemsIntegrate Sensing and CommunicationsPhysical layer security for Massive MIMOFull-duplex CommunicationsOtherMohammadali Mohammadi (Senior Member, IEEE) is currently a Lecturer at  the Queen’s University Belfast, U.K. Prior to this, he held academic positions as an Assistant Professor and subsequently as an Associate Professor at Shahrekord University, Iran. Before joining Queen’s University Belfast, he was a Research Fellow the Centre for Wireless Innovation (CWI), Queen’s University Belfast, from 2021 to 2024. He received his Ph.D. degree in Wireless Communication Engineering from K.N. Toosi University of Technology, Iran, in September 2012. His research interests include signal processing for wireless communications, cell-free massive MIMO, integrated sensing and communication (ISAC), reconfigurable intelligent surfaces (RIS), and physical layer security. He has authored more than 80 peer-reviewed publications in international journals and conferences and has co-authored two invited book chapters. Dr. Mohammadi currently serves as an Associate Editor for IEEE Communications Letters and the IEEE Open Journal of the Communications Society. He received the Exemplary Reviewer Award from IEEE Transactions on Communications in 2020 and 2022, and from IEEE Communications Letters in 2023. He has served on the Technical Program Committees of several flagship IEEE conferences, including ICC, GLOBECOM, and VTC. Fingerprint Dive into the research topics where Mohammad Mohammadi is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Full Duplex Computer Science 100% User Computer Science 53% Full-Duplex Engineering 43% Massive MIMO Computer Science 39% Free Cell Engineering 34% Power Allocation Computer Science 33% Channels Computer Science 30% Non-Orthogonal Multiple Access Computer Science 27% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2013 2018 2019 2024 2025 2025 41 Article 34 Conference contribution 2 Chapter 1 Review article Research output per year Research output per year Beamforming and power allocation design for secure backscatter communicationCampbell, E., Mohammadi, M., Mishra, D. & Matthaiou, M., 04 Sept 2025, IEEE 26th International Workshop on Signal Processing and Artificial Intelligence for Wireless Communications (SPAWC 2025): Proceedings. Institute of Electrical and Electronics Engineers Inc., 5 p. (IEEE International Workshop on Signal Processing and Artificial Intelligence for Wireless Communications (SPAWC)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Power Allocation 100% Radio Frequency 100% Beamforming 100% User Communication 100% Spectral Efficiency 100% Cell-free full-duplex communication – an overviewGalappaththige, D., Mohammadi, M., Ngo, H. Q., Matthaiou, M. & Tellambura, C., Nov 2025, In: IEEE Transactions on Communications. 73, 11, p. 10468-10494 27 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Full Duplex 100% Access Point 25% Wireless Network 25% Case Study 16% Spectral Efficiency 16% 4 Downloads (Pure) Cell-free massive MIMO-assisted ISAC with beam scanningMobini, Z., Mohammadi, M., He, J., Ngo, H. Q. & Matthaiou, M., 04 Sept 2025, IEEE 26th International Workshop on Signal Processing and Artificial Intelligence for Wireless Communications (SPAWC 2025): Proceedings. Institute of Electrical and Electronics Engineers Inc., 5 p. (IEEE International Workshop on Signal Processing and Artificial Intelligence for Wireless Communications (SPAWC)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Free Cell 100% Massive MIMO 100% Access Point 100% Spectral Efficiency 66% Sensing Performance 66% 3 Downloads (Pure) Cell-free massive MIMO-assisted SWIPT for IoT networksMohammadi, M., Tran, L.-N., Mobini, Z., Ngo, H.-Q. & Matthaiou, M., 14 May 2025, (Early online date) In: IEEE Transactions on Wireless Communications. 17 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Free Cell 100% Simultaneous Wireless Information and Power Transfer 100% Massive MIMO 100% Access Point 100% Internet-Of-Things 100% 9 Downloads (Pure) Cell-free massive MIMO SWIPT with beyond diagonal reconfigurable intelligent surfacesHua, D.-T., Mohammadi, M., Ngo, H.-Q. & Matthaiou, M., 11 Aug 2025, (Early online date) In: IEEE Transactions on Communications. 16 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Free Cell 100% Simultaneous Wireless Information and Power Transfer 100% Massive MIMO 100% Access Point 100% Reconfigurable Intelligent Surface 100% 1 Citation (Scopus) 6 Downloads (Pure) View all 78 research outputs Prizes Exemplary Reviewer, IEEE Communication lettersMohammadi, M. (Recipient), 2023Prize: Other distinction Exemplary Reviewer, IEEE Transactions on CommunicationsMohammadi, M. (Recipient), 2022Prize: Other distinction Exemplary Reviewer, IEEE Transactions on CommunicationsMohammadi, M. (Recipient), 2020Prize: Other distinction Fellow of The Higher Education Academy (FHEA)Mohammadi, M. (Recipient), 2025Prize: Prize (including medals and awards) IEEE Senior MemberMohammadi, M. (Recipient), 2023Prize: National/international honour Activities Activities per year 2010 2025 2026 10 Participation in conference 9 Publication peer-review 3 Editorial activity 2 PGT external examination 1 More 1 Participation in workshop, seminar, course Activities per year IEEE International Conference on Communications (ICC 2026)Mohammadi, M. (Member of programme committee)2026Activity: Participating in or organising an event types › Participation in conference IEEE Wireless Communications and Networking Conference (WCNC 2026)Mohammadi, M. (Member of programme committee)2026Activity: Participating in or organising an event types › Participation in conference IEEE Open Journal of the Communications Society (Journal)Mohammadi, M. (Associate editor)May 2025Activity: Publication peer-review and editorial work types › Editorial activity Green Time-Sensitive UAV-Assisted Cooperative Communication SystemsMohammadi, M. (Examiner)Feb 2025Activity: Examination types › PGT external examination IEEE Workshop on Signal Processing and Artificial Intelligence for Wireless CommunicationsMohammadi, M. (Participant)2025Activity: Participating in or organising an event types › Participation in workshop, seminar, course View all 25 activities",
  "content_length": 7245,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:24"
}