{
  "name": "Mohammed Al-Refai",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=mnalrefai",
  "status": "success",
  "content": "Mohammed Nayef Alrefai × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content mohammed nayef alrefai • Assistant Dean - Assistant Dean • Department of Computer Science - Faculty Member --- --- Department of Computer Science mnalrefai@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from Colorado State University, 2019 Msc. of Computer Science from Jordan University of Science and Technology, 2007 Bsc. of Computer Science from Jordan University of Science and Technology, 2004 \"Federated deep learning with clustering-based aggregation for medical diagnosis\", Cluster Computing Mohammed Nayef Mohammed Alrefai, Shahed Shehadeh Mohammad Alkhaza'Leh, Ahmad Gazi Suleiman Alzubi 09/10/2025 \"A Package Level Regression Test Selection Approach for Java Software Systems\", IEEE Access Mohammed Nayef Mohammed Alrefai, Mahmoud Mohammed Khair Faiq Hammad 14/05/2025 \"Component-based architectural regression test selection for modularized software systems\", Journal of Systems Architecture Mohammed Nayef Mohammed Alrefai, Mahmoud Mohammed Khair Faiq Hammad 18/01/2025 \"Driving Style and Traffic Prediction with Artificial Neural Networks Using On-Board Diagnostics and Smartphone Sensors\", Applied Sciences Mohammed Nayef Mohammed Alrefai, Ahmad Gazi Suleiman Alzubi 08/06/2024 \"Dynamic Traffic Light System to Reduce The Waiting Time of Emergency Vehicles at Intersections within IoT Environment\", International Journal of Computers, Communications and Control Yahya Mohammad Suleiman Tashtoush, Mohammed Nayef Mohammed Alrefai, Noor Adnan Hussein Zaghal, Dirar Abdul-Kareem Mohammad Darweesh 21/03/2022 \"Dynamic Traffic Light System to Reduce The Waiting Time of Emergency Vehicles at Intersections within IoT Environment\", International Journal of Computers, Communications and Control Yahya Mohammad Suleiman Tashtoush, Mohammed Nayef Mohammed Alrefai, Noor Adnan Hussein Zaghal, Dirar Abdul-Kareem Mohammad Darweesh 16/02/2022 \"Bridging the model-to-code abstraction gap with fuzzy logic in model-based regression test selection\", International Journal on Software and Systems Modeling Mohammed Nayef Mohammed Alrefai 01/06/2021 Assistant Dean, Assistant Dean, Sep 2025 - Present Deputy Head of the Center, Deputy director, Sep 2023 - Sep 2024 Deputy Head of the Center, Deputy director, Sep 2022 - Sep 2023 Deputy Head of the Center, Vice director, Sep 2021 - Sep 2022 Deputy Head of the Center, Vice director, Mar 2021 - Sep 2021 Deputy Head of the Center, Vice director, Sep 2020 - Mar 2021 Faculty Member, Department of Computer Science, Mar 2020 - Present ARTIFICIAL INTELLIGENCE CONTEMPORARY PROGRAMMING TECHNIQUES Contemporary Programming Techniques DATA STRUCTURES FUNDAMENTALS OF MULTIMEDIA INFORMATION RETRIEVAL PROGRAMMING IN C++ SEMINAR IN ADVANCED COMPUTER SCIENCE VISUAL PROGRAMMING Academics Academic Calendar Course Schedule Graduate Studies Resources IT Helpdesk Services Library Maharat Open Online Courses News Center Information Classification Policy Information Request Form Information & Feedback Alumni EU Projects Job Opportunities Complaints & Suggestions Newsletter Enter your email address to get the latest University news, special events and student activities delivered right to your inbox. Subscribe to JUST Newsletter ©2022, Information Technology and Communication Center. Jordan University of Science and Technology. All Rights Reserved. Contact JUST Jordan University of Science and Technology P.O.Box 3030, Irbid 22110, Jordan Tel: +962 2 7201000 Fax: +962 2 7095123 Email: public@just.edu.jo Close QS Ranking 2026 Close",
  "content_length": 3664,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:28"
}