{
  "name": "Mohammad Ashiqur Rahman",
  "homepage": "https://rahman.eng.fiu.edu",
  "status": "success",
  "content": "Homepage - Mohammad Ashiqur Rahman Close Mohammad Ashiqur Rahman Education Research External Grants Publications Books and Book Chapters Journal Papers Conference Papers More Peer-Reviewed Papers Research Group News/Events ACyD Lab Close I am an associate professor in the Knight Foundation School of Computing and Information Sciences at Florida International University (FIU). I also have a secondary appointment in the Department of Electrical and Computer Engineering. I joined FIU as an Assistant Professor in Spring 2019. Before joining FIU, I was with the Department of Computer Science at Tennessee Tech University. I obtained a Ph.D. in computing and information systems from the University of North Carolina at Charlotte in 2015 under the supervision of Prof. Ehab Al-Shaer. Previously, I received BS and MS degrees in computer science and engineering from Bangladesh University of Engineering and Technology (BUET), Dhaka, in 2004 and 2007, respectively. I lead the Analytics of Cyber Defense (ACyD) Lab at FIU. I am a senior member of IEEE and a member of ACM. You can see my curriculum vitae for further information. Contact Info: Email: marahman [at] fiu [dot] eduOffice: EC 3955, Engineering Center Research Areas My primary research interest covers a wide area of security and dependability problems in cyber and cyber-physical systems (CPSs)/ Internet of Things (IoT). My research focus primarily includes: Computer and information security analysis Control loop security analysis Risk assessment and security design Resiliency analysis and hardening Secure and dependable resource allocation I primarily apply formal methods, artificial intelligence, and game theory in my research. Prospective Students The students should be comfortable with programming, algorithms, and logic, and received BS/MS with a major in Computer Science/Engineering or Electrical/Communication Engineering. Preferred qualities include scholarly publications, especially in cybersecurity, IoT/CPS, or adversarial machine learning. For further information, please go here. News & Events Recent ......... [October 2025] Alvi Ataur Khalil and I recently published our paper xPoz-Hub: Privacy Infiltration in Payment Channel Hubs through Balance Probing and Transaction Discovery at ACSAC 2025. [October 2025] Acyd Lab hosted visitors from INL, highlighting novel innovations in security for nuclear reactors and power systems. [October 2025] Acyd Lab students presented their work during the summer at the CREPES workshop symposium held at FIU. [October 2025] I was recently awarded the FIU Faculty Senate Research Excellence Award from FIU. [September 2025] I will started to serve on the editorial board of IEEE Transactions on Network and Service Management (TNSM). [September 2025] I will serve on the Technical Program Committee of IEEE/IFIP DSN 2026. [July 2025] Our REU scholars of the AI-ReHab REU site presented their posters at the FIU Summer Research Symposium. [July 2025] I would like to congratulate Ph D. Alvi Ataur Khalil for his successful dissertation and graduation. [June 2025] Our Students presented our work “Vision-Driven Fault Detection and Diagnostic in Nuclear Power Plants Using Large Language Models” at ANS’s NPIC & HMIT 2025. [June 2025] I presented our work “I will always be by your side: A Side Channel Aided PWM-based Hollistic Attack Recovery for Unmanned Aerial Vehicles” at IEEE/IFIP DSN 2025. [June 2025] I visited Sandia National Lab and met with different power grid security and resiliency researchers. Dr. Brian Pierre, Manager, Electric Power System Research Department, hosted this visit. [May 2025]The AI-ReHaB REU site is hosting 7 undergraduate students from different universities across the nation this summer. [April 2025] Our paper, “OptiGame: Game-Theoretic Enhancements for Optimistic Rollups through Bayesian Strategies”, was accepted for publication in the proceedings of the 21st EAI International Conference on Security and Privacy in Communication Networks (SecureComm). Congratulations to authors Alvi Ataur Khalil Md Golam Moula Mahedi and Mohammad Ashiqur Rahman. [April 2025] Our paper, “PEARL: A Reinforcement Learning-Based Attack Analysis Approach for Security and Robustness Assessment of Smart Home Systems”, was accepted for publication in the proceedings of the 21st EAI International Conference on Security and Privacy in Communication Networks (SecureComm). [April 2025] Our paper, ““I will always be by your side”: A Side-Channel Aided PWM-based Holistic Attack Recovery for Unmanned Aerial Vehicles”, was accepted for publication in the proceedings of the 55th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN 2025). Congratulations to authors Muneeba Asif, Jean C Tonday Rodriguez, Mohammad Kumail Kazmi, Mohammad Ashiqur Rahman and Kemal Akkaya. [April 2025] Our paper, “ROLLGUARD: Defending RPC Manipulation Attacks in Optimistic Rollups with Graph ML”, was accepted for publication in the proceedings of the 26th International Symposium on Quality Electronic Design (ISQED 2025). [March 2025] Our journal article, “SHEATH: Defending Horizontal Collaboration for Distributed CNNs Against Adverserial Noise” was accepted for publishing in the 2024 IEEE Transactions on Information Forensics and Security (TIFS). [March 2025] Our paper “Vision-Driven Fault Detection and Diagnostic in Nuclear Power Plants Using Large Language Models” was accepted at the 14th International Topical Meeting on Nuclear Plant Instrumentation, Control, and Human Machine Interface Technology 2025. [January 2025] Our paper “Adversarially Robust Intrusion Detection for PMU-Enhanced Power Grids: Detecting Stealthy Attacks in a Wide Area Control Framework” was accepted at the IEEE PES General Meeting 2025. [December 2024] I was invited to host a session at the NELMS Anual IoT Conference located at the University of Florida, where Dr. Rahman hosted a session. [September 2024] Dr. Paudyal and I have received a $5M award from the Department of Energy (DOE) for the Consortium for Research and Education in Power and Energy Systems (CREPES) 2.0 program. [September 2024]  Dr. Paudyal and I hosted a session in the 3rd CREPES Workshop hosted by Florida International University. [September 2024] Our paper “An Intelligent Hierarchical Framework for Efficient Fault Detection and Diagnosis in Nuclear Power Plants” has been accepted for publication in the 6th Joint Workshop on CPS & IoT Security and Privacy in conjunction with ACM CCS 2024. [August 2024] I would like to congratulate Dr. Nur Imtiazul Haque for his successful dissertation defense and graduation in Summer 2024. [August 2024] AI-ReHab visiting REU students successfully presented their completed work over the summer. [July 2024] I presented our work “ConFIDe: A PWM-Driven Control-Fused Intrusion Detection System” at the 19th ACM ASIA Conference on Computer and Communications Security (ASIACCS). [June 2024] I presented our work “PAROLE: Profitable Arbitrage in Optimistic Rollup with ERC-721 Token Transactions” at the 54th Annual IEEE/IFIP International Conference on Dependable Systems and Network (DSN). [June 2024] Our lab welcomed REU students from 2024 AI-ReHab to work alongside in innovative projects utilizing Artificial Intelligence for Health Care solutions. [May 2024] I was an invited panelist at the Workshop on “Data Analytics, Control, and Computing for Cyber-Physical Security in Power Systems.” organized by the Pacific Northwest National Laboratory (PNNL). [March 2024] DOE has announced a $2.5M Department of Energy (DOE) award to FIU to enhance the cybersecurity of energy systems by introducing cyber and physical agility into the system. I am the Lead PI of this project, where he haspartnered with collaborators at different universities, national labs, industries, and utilities. [March 2024] Our paper titled “PAROLE: Profitable Arbitrage in Optimistic Rollup with ERC-721 Token Transactions” has been accepted for publication at the 54th Annual IEEE/IFIP International Conference on Dependable Systems and Network (DSN). [March 2024] Our paper titled “ConFIDe: A PWM-Driven Control-Fused Intrusion Detection System” has been accepted for publication at the 19th ACM ASIA Conference on Computer and Communications Security (ASIACCS). [January 2024] Our paper titled “Formal Threat Analysis of Machine Learning-Based Control Systems: A Study on Smart Healthcare Systems” has been accepted to be published in Sustainable Energy, Grids and Networks (SEGAN), Elsevier. [January 2024] Our paper titled “Side-channel-driven Intrusion Detection System for Mission Critical Unmanned Aerial Vehicles” has been accepted for publication at the International Symposium on Quality Electronic Design (ISQED). [January 2024] Our paper titled “Formal Threat Analysis of Machine Learning-Based Control Systems: A Study on Smart Healthcare Systems” has been accepted to be published in Computers & Security (COSE), Elsevier. [April 2025] Our paper, “OptiGame: Game-Theoretic Enhancements for Optimistic Rollups through Bayesian Strategies” was accepted for publication in the 21st EAI International Conference on Security and Privacy in Communication Networks (SecureComm 2025). [April 2025] Our paper, “PEARL: A Reinforcement Learning-Based Attack Analysis Approach for Security and Robustness Assessment of Smart Home Systems” was accepted for publication in the 21st EAI International Conference on Security and Privacy in Communication Networks (SecureComm 2025). [April 2025] Our paper, “I will always be by your side”: A Side-Channel Aided PWM-based Holistic Attack Recovery for Unmanned Aerial Vehicles, was accepted for publication in the proceedings of the 55th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN 2025). [April 2025] Our paper, “ROLLGUARD: Defending RPC Manipulation Attacks in Optimistic Rollups with Graph ML”, was accepted for publication in the proceedings of the 26th International",
  "content_length": 26689,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:13"
}