{
  "name": "Mohamed Riyadh Baghdadi",
  "homepage": "https://nyuad.nyu.edu/en/academics/divisions/science/faculty/riyadh-baghdadi.html",
  "status": "success",
  "content": "Riyadh Baghdadi - NYU Abu Dhabi Skip To All NYU Navigation Skip To Main Content To open and close this bar, use optionalt+/ Riyadh Baghdadi Assistant Professor of Computer Science; Global Network Assistant Professor of Computer Science and Engineering, Tandon School of Engineering Affiliation: NYU Abu Dhabi Education: BA Ecole Superieure d’Informatique; MA Sorbonne University; PhD Sorbonne University; Postdoc MIT baghdadi@nyu.edu Research Websites: Center for Artificial Intelligence and Robotics Center for Cyber Security Research Areas: Compilers, Programming Languages, Deep Learning, Artificial Intelligence, High Performance Computing Riyadh Baghdadi's Website Riyadh Baghdadi is an Assistant Professor in Computer Science at NYU Abu Dhabi, a Global Network Assistant Professor of Computer Science and Engineering at Tandon School of Engineering in NYU and a Research Affiliate at MIT. He works on the intersection of compilers and applied machine learning. More precisely, he works on developing compilers that take high-level code and optimize it automatically to generate highly efficient code. He uses machine learning to achieve that and enable compilers to automatically optimize code. Riyadh also works on developing techniques to accelerate deep learning training and inference (e.g., by exploiting DNN weight sparsity). This enables the use of sophisticated DNN models in platforms with limited computational resources (smartphones, driverless cars, ...). Before joining NYUAD, Riyadh did a postdoc at MIT where he developed the Tiramisu compiler for deep learning, image processing and scientific computing. Riyadh obtained his Ph.D. and master's degrees from the Sorbonne University in Paris (INRIA/Paris VI). He obtained his engineering degree from Ecole Superieure d’Informatique in Algiers. Courses Taught Expand/Collapse all",
  "content_length": 1848,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:02"
}