{
  "name": "Mohammed Safayet Arefin",
  "homepage": "https://www.safayetarefin.com",
  "status": "success",
  "content": "Mohammed Safayet Arefin, PhDSearch this siteEmbedded FilesSkip to main contentSkip to navigationMohammed Safayet ArefinAssistant ProfessorDepartment of Computer ScienceColorado State University, USADr. Mohammed Safayet Arefin is an Assistant Professor in the Department of Computer Science at Colorado State University (CSU). Dr. Arefin's research concentrates on studying algorithms, technologies, perceptual mechanisms, and human visual systems to understand better the spatial perception of real and simulated virtual objects in real, augmented, and virtual environments. His research investigates the elements and constraints that create spatial perceptual biases in the extended reality (XR) system. Dr. Arefin's research's principal goal is to allow the user to fully utilize the capability of extended reality with effortless, precise, and acceptable user perceptual experiences.  Dr. Arefin has been active in the premier augmented and virtual reality conferences. He has served as a Publication Co-chair in the IEEE Virtual Reality (VR) and IEEE International Symposium on Mixed and Augmented Reality (ISMAR) conference committees for seven successive terms. In addition, Dr. Arefin is co-founder and co-organizer of the workshop on Replication in Extended Reality (WoRXR), mainly held in ISMAR. Before joining Colorado State University, Dr. Arefin was a Postdoctoral Fellow at the DEVCOM US Army Research Laboratory West (ARL West). Dr. Arefin achieved his Ph.D. and MS in Computer Science from Mississippi State University in 2022 and 2020, respectively. He obtained his bachelor's degree in Computer Science and Engineering from Chittagong University of Engineering & Technology (CUET), Bangladesh. Besides professional work, Dr. Arefin enjoys traveling with his family and playing video games with his friends.Interests and Expertise:Augmented and Virtual RealityApplied and Visual PerceptionHuman FactorsHuman-centered ComputingContact Information:Email: arefin@colostate.edu or arefin@acm.orgOffice Location: Room No: 368, Computer Science Department, Colorado State University To learn about my research and research lab, please visit my lab page:ARefin LabNews: To check the updates or news related to my lab activities, please check the ARefin lab.April 2025: Serving on the ACM Symposium on Applied Perception (SAP) 2025 Program Committee. March 2025: Serving on the IEEE VR 2026 Conference Committee as Poster Chair. February 2025: Serving on the 20th International Symposium on Visual Computing (ISVC'25) International Program Committee. January 2025: Serving on the IEEE ISMAR 2025 Conference Committee as Publications Chair.December 2024: Serving on the ACM VRST 2025 Conference Committee as Reproduction Challenge Chair. October 2024: Keynote Speaker at the 19th International Symposium on Visual Computing (ISVC'24). First time delivered Keynote Talk in the Virtual Reality area at the 19th International Symposium on Visual Computing (ISVC'24),  Lake Tahoe, NV, October 21-23, 2024.  September 2024: Delivered Invited Talk as part of the \"Virtual Reality and Augmented Vision\" theme at Optica's Frontiers in Optics + Laser Science (FiOLS) conference, Denver, Colorado, USA, 2024. July 2024: Organizing the WoRXR - 4th Workshop on Replication in Extended Reality (WoRXR) at IEEE International Symposium on Mixed and Augmented Reality (ISMAR), 2024.May 2024: Serving as Publications Chair on the IEEE VR 2025 Conference Committee. April 2024: Serving on the IEEE ISMAR 2024 Conference Committee as Publications ChairFebruary 2024: Serving as the Program co-chair in the Virtual reality (VR) area of the upcoming 19th International Symposium on Visual Computing (ISVC'24)  January 2024: Serving on the IEEE ISMAR 2024 International Program Committee (IPC). November 2023: Hosted Prof. Dr. Gregory Welch from the University of Central Florida and Prof. Dr. J. Edward Swan II from Mississippi State University as guest speakers at Colorado State UniversityOctober 2023: Organized the WoRXR - 3rd Workshop on Replication in Extended Reality (WoRXR) at IEEE International Symposium on Mixed and Augmented Reality (ISMAR), 2023.September 2023: Was a member of the IEEE ISMAR 2023 Conference Committee as Publications Chair.August 2023: Completed postdoctoral research with US DEVCOM Army Research Laboratory and started working as a tenure track assistant professor in the computer science department at Colorado State University.July 2023: Serving on the IEEE VR 2024 Conference Committee as Publications Chair. May 2023: Being a part of the International Program Committee for the IEEE ISMAR 2023 (conference papers).April 2023: I am delighted to share that I will join as a tenure track Assistant Professor in the Computer Science Department at Colorado State University this coming Fall 2023 (August 2023). I will have openings for multiple fully funded Ph.D. positions to join my research group. I will provide detailed information about this later. However, feel free to contact me via email if you are interested in my research! January 2023:  Serving on the organizing committee of the IEEE International Symposium on Mixed and Augmented Reality (ISMAR) 2023, as publication chairs!October 2022:BIG NEWS: I am delighted that I defended my Ph.D. dissertation successfully! What a journey! I have started working as an ORAU Fellow at DEVCOM US Army Research Laboratory (ARL-West)!May 2022: I am happy to share that I’m starting a new position as a Summer Research Intern at the University of Southern California (USC) Institute for Creative Technologies (ICT). More specifically, at US DEVCOM Army Research Laboratory (ARL West). I am excited to research augmented reality,  human visual systems, and eye-tracking during the internship.April 2022: Excited to share that we (Jens Grubert, Florian Echtler, Verena Biener, Mohammed Safayet Arefin, and J. Edward Swan II) are going to organize the 2nd Workshop on Replication in Extended Reality (WoRXR) at IEEE International Symposium on Mixed and Augmented Reality (ISMAR), 2022.  Here is the workshop link: https://sites.google.com/view/worxr2022/home March 2022:Conference paper accepted! Our (Mohammed Safayet Arefin, J. Edward Swan II, Russell Cohen Hoffing, Steven M. Thurman) submission \"Estimating Perceptual Depth Changes with Eye Vergence and Interpupillary Distance using an Eye Tracker in Virtual Reality\" has been accepted in the 14th ACM Symposium on Eye Tracking Research and Applications (ETRA2022). This research is the outcome of my Summer 2021 internship and is based on the collaboration with US DEVCOM Army Research Laboratory (ARL-WEST). February 2022:Excited to attend the Vision Sciences Society (VSS) conference for the first time! Our (Mohammed Safayet Arefin, J. Edward Swan II, Russell Cohen Hoffing, Steven M. Thurman) abstract “Tracking Perceptual Depth Changes with Eye Vergence and Inter-Pupillary Distance in a Virtual Reality Environment ” has been accepted as an in-person Poster presentation at the 2022 Vision Sciences Society (VSS) Annual Meeting in St. Pete Beach, Florida.  This research is the outcome of my Summer 2021 internship and is based on the collaboration with US DEVCOM Army Research Laboratory (ARL-WEST). January 2022: Journal paper accepted! Our paper has been ACCEPTED into the IEEE Transactions on Visualization and Computer Graphics (TVCG) Special Issue on the 2022 IEEE Conference on Virtual Reality and 3D User Interfaces (VR).   [Pre-Print] Our First Child! I and my wife (Farzana Alam Khan) are blessed with a baby boy at 12:16am on January 1! What a great start of the new year, 2022! Best moment our life! Our baby boy is already featured as \"New Year's Baby\" in the Starkville Daily News! Check this out [Link]  December 2021: I am going to serve on the organizing committee of the IEEE International Symposium on Mixed and Augmented Reality (ISMAR), 2022 as one of the publication chairs! [Conference Link]October 2021:1st Workshop on Replication in Extended Reality (WoRXR) at ISMAR 2021 is a success, and presented a tutorial on \"Replication Typologies and Studies in XR: Current Scenario of Replication in Human computer Interaction, Replication studies in XR research\". Check out my presentation material [PDF]Our conference paper is presented by Farzana Alam Khan. Check out the paper [Paper Link]Presented a workshop paper at PERCxR - Perceptual and Cognitive Issues in XR  in IEEE International Symposium on Mixed and Augmented Reality (ISMAR) 2021. [Paper Link]September 2021: Featured in the Newsroom of Bagley College of Engineering of Mississippi State University, USA. [LINK]Featured on the Facebook page of Mississippi State University Department of Computer Science and Engineering. [LINK]Featured on the LinkedIn page of Mississippi State University Department of Computer Science and Engineering. [LINK]August 2021: A big news for me! I am the winner of the Graduate Oral Competition of the 2021 CCDC – US Army Research Laboratory (ARL) Summer Student Symposium for my summer internship work.  I was selected out of 10 fellow graduate student interns to represent the Human Research and Engineering Division (HRED) at this symposium. Every summer, the Army Research Lab hosts hundreds of student interns, but only the best in each division are given slots to orally present their internship research.  Considering all of the ARL divisions, I won first place over approximately 100 summer graduate interns of the DEVCOM Army Research Laboratory! I am really thankful to my ARL mentors; the research scientists of ARL; Dr. Russell and Dr. Steven. They are totally amazing. I learned many things from them this summer. It was totally a team effort. Still can't believe this! What a wonderful summer I had! July 2021: Workshop paper accepted! Our (Mohammed Safayet Arefin, Nate Phillips, Alexander Plopski, J. Edward Swan II) paper entitled “Effects of a Distracting Background and Focal Switching Distance in an Augmented Reality System” has been acce",
  "content_length": 13086,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:29"
}