{
  "name": "Mohamed I. Ibrahem",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=MIBRAHEM",
  "status": "success",
  "content": "Mohamed Ibrahem - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Mohamed Ibrahem Assistant Professor Mohamed Ibrahem Assistant Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber SciencesAdministrationDepartment of The Graduate School BioDr. Mohamed Ibrahem is an Assistant Professor at the School of Computer and Cyber Sciences, Augusta University, USA. He received a Ph.D. degree in electrical and computer engineering from Tennessee Tech. University, USA, in 2021. Dr. Ibrahem received the Eminence Award for the Doctor of Philosophy Best Paper from Tennessee Tech. University, USA. His research interests include Security and Privacy in IoT Environments (Smart Grid, E-Health, Vehicular Networks, IIoT), Applied Cryptography, Privacy-preserving (Secure) Machine Learning Training and Evaluation Machine Learning for Cyber-security, Secure Federated Learning, Secure data aggregation, Traffic analysis attacks, and countermeasures, Cyber-Physical Systems Security. MIBRAHEM@augusta.edu RV 2815 Personal Website General Credentials Instruction Scholarship Service Education Ph.D., Engineering, General. Tennessee Technological Univer, 2021 Awards & Honors IEEE Senior Member IEEE , 2024 Top 2% Scientists List Stanford/Elsevier, 2024 Eminence Award for the Doctor of Philosophy Best Paper Tennessee Technological University, 2021 Courses Taught Most Recent Academic Year CSCI 8940 Dissertation Research CSCI 7520 Principles of Cryptography CSCI 6910 Master's Thesis Research AIST 3720 OS Concepts & Administration CSCI 4990 Undergrad Research Teaching Interests - Principles of Cryptography- OS Concepts & Administration- CyberSecurity- Network Security Scholarship Selected Recent Publications A Cloud Computing-Enabled ESP32-CAM System for Real-Time Object Recognition with Feedback, 2025 Conference Proceeding A Comprehensive Review on Real-Time Vehicle and Pedestrian Detection Using YOLO, 2025 Conference Proceeding A Comprehensive Survey of Model Extraction Attacks: Current Trends, Defenses, and Future Directions, 2025 Conference Proceeding A Privacy-Preserving RL-Based Secure Charging Coordinator Using Efficient FL for Smart Grid Home Batteries., 2025 Journal Article, Academic Journal Adaptive Resource Allocation in Emerging High-mobility Networks Using Hybrid Deep Learning Models, 2025 Conference Proceeding Research Interests - Security and Privacy in IoT Environments(Smart Grid, E-Health, Vehicular Networks, IIoT)- Applied Cryptography- Privacy-preserving (Secure) Machine Learning Training and Evaluation- Machine Learning for Cyber-security- Secure Federated Learning- Secure data aggregation- Traffic analysis attacks and countermeasures- Cyber-Physical Systems Security. Professional Service Institute of Electrical and Electronics Engineers (IEEE) Internet of Things Journal 2025 - Present Role: Editor",
  "content_length": 2990,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:01"
}