{
  "name": "Mohammad Hajiabadi",
  "homepage": "https://sites.google.com/view/mdhajiabadi",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationMohammad HajiabadiBio: I am an Assistant Professor in the School of Computer Science at the University of Waterloo. Before that, from 2020-2021, I was an Assistant Professor in the CSE Department at Pennsylvania State University (PSU).  Prior to joining PSU, I was a postdoctoral researcher at UC Berkeley, hosted by Sanjam Garg. I spent  January 2018-June 2018 visiting Mohammad Mahmoody at the University of Virginia.I spent September 2016-June 2017 at University College London, hosted by Jens Groth. I completed my PhD at the University of Victoria, under the supervision of Bruce M. Kapron.I received my BSc degree in Computer Science from Sharif University of Technology, Iran.Research Interests: Foundations of CryptographyThanks to Meta, Mastercard, NSERC and NSF for their support!News: I co-organized, together with Douglas Stebila, the first occurrence of Ontario Crypto Day, held on June 6, 2024 at the University of Waterloo.  The next event is scheduled to take place at the University of Toronto in December 2025. Students:Postdoc: Roman Langrehr PhD: Vahid Reza Asadi (joint with Richard Cleve), Zehou (Tiger) WuMaster's (current): Karaneh Keypoor, Anas Ibrahim,  Pranshu Kumar (joint with Douglas Stebila)Master's (graduated): Ali Ghadirli, Alice Murphy, Sara Sarfaraz, Daniel Santana (joint with Rafael Oliveira)Teaching  Computation on Encrypted Data CS 858 (Winter 2025, Winter 2023) Foundations of Modern Cryptography CS 489/698 (Fall 2025, Fall 2023)Privacy, Cryptography, Network and Data Security CS 489/698 (Winter 2024)Introduction to the Theory of Computing CS 360 (Fall 2025, Winter 2023, Fall 2022)  Cryptography / Network Security  CS 758 (Fall 2021) Introduction to Cryptography (Fall 2020, Penn State University)Program CommitteesEurocrypt 2026 Eurocrypt 2025, Asiacrypt 2025, ITC 2025  TCC 2024, Crypto 2024,  SAC 2024 Asiacrypt 2023 Crypto 2022,  Asiacrypt 2022 , ITC 2022 TCC 2021 TCC 2020, Eurocrypt 2020, ITC 2020. PublicationsConferencesSanjam Garg; Mohammad Hajiabadi; Dimitris Kolonelos; Abhiram Kothapalli; Guru Vamsi Policharla A Framework for Witness Encryption from Linearly Verifiable SNARKs and ApplicationsCrypto 2025 (Full Version )Mohammad Hajiabadi; Roman Langrehr; Adam O’Neill; Mingyuan WangOn the Black-Box Complexity of Private-Key Inner-Product Functional EncryptionTCC 2024 (Full Version)Jesko Dujmovic; Mohammad HajiabadiLower-Bounds on Public-Key Operations in PIREurocrypt 2024 (Full Version)Sanjam Garg; Mohammad Hajiabadi; Peihan Miao; Alice MurphyLaconic Branching Programs from the Diffie-Hellman AssumptionPKC 2024 (Full Version)Mohammad Hajiabadi; Mohammad Mahmoody; Wei Qi; Sara SarfarazLower Bounds on Assumptions Behind Registration-Based EncryptionTCC 2023Mohammad Hajiabadi; Shahram Khazaei; Behzad Vahdani:Randomness Recoverable Secret Sharing SchemesITC 2023 (Full Version). Accepted to Journal of Cryptology 2024.Sanjam Garg; Mohammad Hajiabadi; Abhishek Jain; Zhengzhong Jin; Omkant Pandey; Sina Shiehian Credibility in Private Set MembershipPKC 2023 (Full Version)Alexander Bienstock; Yevgeniy Dodis; Sanjam Garg; Garrison Grogan; Mohammad Hajiabadi; Paul RöslerOn the Worst-Case Inefficiency of CGKATCC 2022 (Full version)Divesh Aggarwal; Nico Döttling; Jesko Dujmovic; Mohammad Hajiabadi; Giulio Malavolta; Maciej ObremskiAlgebraic Restriction Codes and their Applications. Accepted to Algorithmica 2023.ITCS  2022 (Full version).Melissa Chase; Sanjam Garg; Mohammad Hajiabadi; Jialin Li; Peihan MiaoAmortizing Rate-1 OT and Applications to PIR and PSITCC 2021 (Full version).Navid Alamati; Pedro Branco; Nico Döttling; Sanjam Garg; Mohammad Hajiabadi; Sihang PuLaconic Private Set Intersection and ApplicationsTCC 2021 (Full version).Sanjam Garg; Mohammad Hajiabadi; Giulio Malavolta; Rafail OstrovskyHow to Build a Trapdoor Function from an Encryption SchemeAsiacrypt 2021Rohit Chatterjee; Sanjam Garg; Mohammad Hajiabadi; Dakshita Khurana; Xiao Liang; Giulio Malavolta; Omkant Pandey; Sina ShiehianCompact Ring Signatures from Learning with ErrorsCrypto 2021 (Full version).Sanjam Garg; Mohammad Hajiabadi; Rafail OstrovskyEfficient Range-Trapdoor Functions and Applications: Rate-1 OT and MoreTCC 2020 (Full version).Nico Döttling; Sanjam Garg; Mohammad Hajiabadi; Daniel Masny; Daniel WichsTwo-Round Oblivious Transfer from CDH or LPNEurocrypt 2020 (Full version).Sanjam Garg; Romain Gay; Mohammad HajiabadiMaster-Key KDM-Secure IBE from PairingsPKC 2020 (Full version). Invited to the Journal of Cryptology.Nico Döttling; Sanjam Garg; Mohammad Hajiabadi; Kevin Liu; Giulio MalavoltaRate-1 Trapdoor Functions from the Diffie-Hellman ProblemAsiacrypt 2019 (Full version).Sanjam Garg; Romain Gay; Mohammad HajiabadiNew Techniques for Efficient Trapdoor Functions and ApplicationsEurocrypt 2019 (Full version).Sanjam Garg; Mohammad Hajiabadi; Mohammad Mahmoody; Ahmadreza Rahimi; Sruthi SekarRegistration-Based Encryption from Standard AssumptionsPKC 2019 (Full version).Mohammad HajiabadiEnhancements Are Black-box Non-Trivial: Impossibility of Enhanced Trapdoor Permutations from Standard Trapdoor PermutationsTCC 2018 (Full version).Sanjam Garg; Mohammad Hajiabadi; Mohammad Mahmoody; Ahmadreza RahimiRegistration-Based Encryption: Removing Private-Key Generator from IBETCC 2018 (Full version).Sanjam Garg and Mohammad HajiabadiTrapdoor Functions from the Computational Diffie-Hellman AssumptionCrypto 2018 (Full version).Sanjam Garg; Mohammad Hajiabadi; Mohammad Mahmoody; Ameer MohammedLimits on the Power of Garbling Techniques for Public-Key EncryptionCrypto 2018 (Full version).Nico Döttling, Sanjam Garg, Mohammad Hajiabadi and Daniel MasnyNew Constructions of Identity-Based and Key-Dependent Message Secure Encryption SchemesPKC 2018 (Full version).Jonathan Bootle; Andrea Cerulli, Essam Ghadafi, Jens Groth, Mohammad Hajiabadi, Sune K. JakobsenLinear-Time Zero-Knowledge Proofs for Arithmetic Circuit SatisfiabilityAsiacrypt 2017 (Full version).Mohammad Hajiabadi and Bruce M. KapronToward Fine-Grained Blackbox Separations Between Semantic and Circular-Security NotionsEurocrypt 2017 (Full version).Mohammad Hajiabadi, Bruce M. Kapron and Venkatesh SrinivasanOn Generic Constructions of Circularly-Secure, Leakage-Resilient Public-Key Encryption SchemesPKC 2016 (Full version).Mohammad Hajiabadi and Bruce M. KapronReproducible Circularly-Secure Bit Encryption: Applications and RealizationsCrypto 2015 (Full version). Accepted to Journal of Cryptology 2017.Mohammad Hajiabadi and Bruce M. KapronGambling, Computational Information and Encryption SecurityICITS 2015 (Full version).Mohammad Hajiabadi and Bruce M. KapronComputational Soundness of Coinductive Symbolic Security under Active AttacksTCC 2013 (Full version).JournalsMohammad Hajiabadi; Shahram Khazaei; Behzad Vahdani:Randomness Recoverable Secret Sharing SchemesJournal of Cryptology 2024.Divesh Aggarwal; Nico Döttling; Jesko Dujmovic; Mohammad Hajiabadi; Giulio Malavolta; Maciej ObremskiAlgebraic Restriction Codes and their ApplicationsAlgorithmica 2023.Mohammad Hajiabadi and Bruce M. KapronReproducible Circularly-Secure Bit Encryption: Applications and RealizationsJournal of Cryptology, 2017.Recent Invited TalksLower-Bounds on Public-Key Operations in PIR. Secure Computation Workshop, Simons Institute, Berkeley, August 2025.Laconic MPC, PIR and Public-Key Operations. Invited Talk at TPLC: Theory and Practice of Laconic Cryptography Workshop, Eurocrypt 2025, Madrid, May 2025.Laconic Function Evaluation for Branching Programs. Invited Talk at TPLC: Theory and Practice of Laconic Cryptography Workshop, Eurocrypt 2024, Zurich, May 2024.Limits on the Power of Garbling Techniques for Public-Key Encryption. Workshop: Lowerbounds in Cryptography, Bertinoro, Italy (July 2019).New Techniques for Trapdoor Functions and Applications. Bay Area Crypto Day (November 2018).Trapdoor Functions from the Computational Diffie-Hellman Assumption. IST Austria (October 2018), DC Area Crypto Day (May 2018), Georgetown University (March 2018).Can public-key encryption be based on one-way functions via non-blackbox garbling techniques? Bay Area Crypto Day (November 2017).Limitations of Black-Box Constructions in Cryptography. Information Security Group, University College London (February 2017).New constructions and applications of KDM-secure schemes. Microsoft Research, Redmond (August 2015).How encryption with standard security copes under stronger forms of attack, with applications to computational soundness, Stanford Security Seminar and UCSD Theory Seminar (December 2013).Contact InformationEmail Address: Email me at XYZmdhajiabadi@uwaterloo.ca, after removing the first three letters.Cheriton School of Computer Science, University of Waterloo200 University Avenue West, Waterloo, ONCanada N2L 3G1Office: DC 2629Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 8929,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:13"
}