{
  "name": "Mohammad Abdullah Al Faruque",
  "homepage": "http://aicps.eng.uci.edu",
  "status": "success",
  "content": "Embedded & Cyber-Physical Systems Lab – Autonomous and Intelligent Cyber-Physical Systems (Al Faruque's Lab) Log InSearch Skip to content Prospective Graduate Students: We will recruit multiple Ph.D. students in the Fall of 2025. Our lab is also looking for a postdoc researcher in agent-based control systems. If you are a prospective graduate student and a postdoc researcher, contact Professor Al Faruque (alfaruqu@uci.edu). Embedded and cyber-physical systems have transformed the modern world. Embedded computing systems have been integrated with various engineering artifacts, including the power grid, health care devices, automotive and transportation systems, industrial control and manufacturing systems, etc. Modern engineering problems are typically multi-disciplinary and require hard problem-solving skills. The research expertise of the director of the AICPS lab, Professor Al Faruque, is mostly rooted in a long history of embedded systems design, including multi-core processor design, reliable system design, and hardware/software co-design. In 2009, Prof. Al Faruque started looking into the co-design problems of hardware/software and physics (aka, cyber-physical systems), including modeling, simulation, design automation, etc. In terms of CPS applications, over the last decade, his lab has worked on multiple research challenges of various CPS applications, including smart grid, electric vehicles, automotive, transportation systems, manufacturing and industrial control systems, and mobile health. Currently, the AICPS lab is focusing on solving the following research challenges: – How can cross-layer cyber-physical vulnerabilities (including IoT) be detected and defended in embedded and cyber-physical systems?– How do we develop hardware/software/physics co-design methods for low-power and low-energy AI systems (Machine Learning on the edge)?In summary, our work involves machine learning algorithms, hardware/software security, embedded hardware/software design, and optimization of multi-objective design criteria for numerous cyber-physical systems considering their underlying physics.Since 2012, the AICPS lab has been funded by various federal and state agencies, including NSF, NIH, DOE, DARPA, ONR, US ARMY, DARPA, AFRL, DOT, DoEd, UCOP, and Caltrans. Moreover, the lab has received generous funding support from various industries. We thank all sponsors for their continuous support. The lab has graduated 13 Ph.D. students and many students with M.Sc. degrees. Out of the 13 Ph.D. students who graduated, 2 went to academia and started as tenure track assistant professors (Geroge Masson University and University of Arizona), and 11 went to industries and national labs, including Lawrence Livermore National Laboratory, Qualcomm, Samsung, Palo Alto Networks, Synopsys, Xilinx, MediaTek, and Skyworks. The lab regularly involves undergraduate student researchers. Latest News [ACM TCPS 2025] Accepted Paper: Graph Deviation Network for Anomaly Detection and Localization in Additive Manufacturing Systems October 27, 2025 [IEEE RA-L 2025] Accepted Paper: Collaborative Task Allocation for Heterogeneous Multi-Robot Systems Through Iterative Clustering October 22, 2025 [ACSAC 2025] 3 Papers Accepted. Congratulations to the authors September 3, 2025 Welcome Dr. Deepak Prakash Kumar to our Lab as a postdoctoral researcher. August 22, 2025 [New Grant from UCITS: 2025-2026] Enhancing the Safety of Intelligent Traffic Management Systems Against Coordinated Physical Adversarial Attacks August 22, 2025 [IEEE TIFS] Accepted Paper: DART: Distribution-Aware Hardware Trojan Detection August 21, 2025 [NDSS 2026]: Accepted Paper: FlyTrap: Physical Distance-Pulling Attack Towards Camera-based  Autonomous Target Tracking Systems August 14, 2025 [BEST DEMO AWARD] VehicleSec 2025 – CPExploiter: from Cyber to Physical: Understanding the End-to-End Physical Attack Capability of Cyber-Attacks on Robotic Vehicles August 12, 2025 [DSD 2025]: Accepted Paper: LLM4CVE: Enabling Iterative Automated Vulnerability Repair with Large Language Models June 26, 2025 [Finalist Student Poster Award] 31st Automotive Research Center Program Review June 18, 2025 [VehicleSec 2025]: Accepted Demo: CPExploiter: from Cyber to Physical: Understanding the End-to-End Physical Attack Capability of Cyber-Attacks on Robotic Vehicles May 17, 2025 [VehicleSec 2025]: Accepted Demo: FlyTrap: Physical Distance-Pulling Attack Towards Camera-based Autonomous Target Tracking Systems May 17, 2025",
  "content_length": 4509,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:09"
}