{
  "name": "Mohammed Eunus Ali",
  "homepage": "https://sites.google.com/site/mohammedeunusali",
  "status": "success",
  "content": "mohammed eunus aliSearch this siteEmbedded FilesSkip to main contentSkip to navigationMohammed Eunus Ali, Ph.D.ProfessorDepartment of Computer Science and Engineering (CSE)Bangladesh University of Engineering and Technology (BUET)Dr. Mohammed Eunus Ali is a Professor in the Department of Computer Science and Engineering (CSE) at Bangladesh University of Engineering and Technology (BUET), Dhaka since May 2014. He is the group leader of Data Science and Engineering Research Lab (DataLab) in the department of Computer Science and Engineering at BUET. He received his PhD degree in Computer Science and Software Engineering from the University of Melbourne in 2010. He also worked as a Research Fellow and Visiting Research Scholars in the University of Melbourne, Monash University, Swinburne University of Technology,  and RMIT University. Dr. Eunus is the recipient of prestigious UGC Award in the year 2012 for his outstanding research contribution.Dr. Eunus’s research falls in the intersection of data management and machine learning. His research areas cover a wide range of topic in database systems and information management that include spatial databases, practical machine learning, and social media analytics. Dr. Eunus’s research papers have been published in top ranking journals and conferences such as the VLDB Journal, TKDE, DMKD, Information Systems, WWWJ, DKE, ICDE, CIKM, EDBT, PVLDB, and UbiComp. He served as a Program Committee Members of many prestigious conferences that include SIGMOD, VLDB, ICDE, AAAI, and SIGSPATIAL. Dr. Eunus is also involved in different projects that investigate the role of ICT for the development of developing countries like Bangladesh. The details of different research and development projects can be found in DataLab page. Dr. Eunus also led multiple projects of national interests that include iDMT for Madrasah Board, iBook for Technical Board, National ID project, etc. Dr Eunus plays a key role in establishing the Samsung Innovation Lab at CSE, BUET. Dr. Eunus was the founding Chair of BUET ACM Chapter and is a senior member of ACM, USA.    Latest NewsOur papers on Faithful and Salient Text generation from graphs and multi-modal data in INLG  2023 and INLG 2024.  link 1 and link 2Our MapCoder for automatic code generation of competitive programming problems has been accepted at ACL 2024. Please check out the paper and codebase. mapcoderAlternate path learning paper has appeared in IEEE TKDE Please see the paper.A multi-disciplinary work on early earthquake intensity prediction has been accepted in IEEE Transactions on Geoscience and Remote Sensing. Please see the paper.A work on reliable atrial fibrillation detection (one kind of heart disease) from PPG data has been published in IMWUT 2022. Please see the paper.A research work on house price prediction based on geo-spatio neighbourhood embedding has appeared in DMKD. Please see the paper. .A research work on Contact Tracing Query is now available  online. A collaborative work with Monash University  on alternate path computation has been appeared in PVLDB Vol 13 2020. Please see the paper. Prospective StudentsPlease email me  your research interest if You are a senior-year (Level 3 and above) Undergraduate student and you are highly motivated in doing research and you have strong analytical skills.You are a current Masters student and you have some prior experience in doing research in data management and/or machine learning areas.You want to PhD in data management and machine learning areas and you have some prior research experience and have necessary dedication to work very hard for a duration of 4-5 years.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3729,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:26"
}