{
  "name": "Mohamed Cheriet",
  "homepage": "http://www.synchromedia.ca",
  "status": "success",
  "content": "Synchromedia laboratory Skip to content Loading... Welcome to Synchromedia Laboratory The Founded in 2004 by Prof M. Cheriet, Synchromedia Lab core theme consists in an integration of various perceptual modes of information that allows collaborative management and sharing of information, actions and behaviors beyond the mere multimedia communication Synchromedia is a core partner in the various international research initiatives, such as EU FP7, Horizon 2020, the USA’s NSF, and China. Synchromedia leads pilot research projects developing various cloud computing platforms driving state-of-the-art next generation data centers and networks. Sample projects carried out by Synchromedia in the NGI fields include Synchromedia Platform (CFI), GreenStar Network (CANARIE), Green Sustainable Telco Cloud (NSERC/Ericsson), Self-Optimizing Fabrics for 5G Networks (MITACS/Ciena), CEOSNet : Intelligent Cyber Value Chain Network (CFI), and Energy Efficient and AI-Powered 5G and Beyond Networks (NSERC/INNOVÉÉ/Ericsson). Study in Synchromedia Inspiring Tomorrows Leaders The Future Belongs To Those Who See Possibilities Today FIND A COURSE APPLY NOW Homeadmin2022-12-20T20:21:15+00:00 Recent Publications New Converging Game Theory and Reinforcement Learning For Industrial Internet-of-Things IEEE Transactions on Network and Service Management| Game Theoretic Reinforcement Learning Framework For Industrial Internet of ThingsIEEE Wireless Communications and Networking Conference 2022| Computing on Wheels: A Deep Reinforcement Learning-Based ApproachIEEE Transactions on Intelligent Transportation Systems | Energy disaggregation using variational autoencoders 12NextLatest News New Best Paper Award at ICCV 2025 – VisionDocs Workshop Synchromedia Laboratory Welcomes Kathy Baig, CEO of ÉTS, for an Official Visit Highlighting Innovation and Research Excellence Graduation Announcement: Master’s Student Si Saber Meriem Amina Graduation Announcement for Ph.D. student, Hamdan, Mohammed WINNER of the The 2022 Administration Council Excellence Award to doctorates 12NextAll PublicationsAll NewsSYNCHROMEDIA AT A GLANCE At the core of the Synchromedia Lab are 6 professors, 5 Research Associates and 40 graduate students, as well as adjunct members from other departments and universities. We collaborate closely and regularly with several Canadian and international universities such as University of Toronto, University of Waterloo, University of Calgary, Laval University, University of Moncton, École Polytechnique of Montreal , McGill University, Concordia University, IRNS, University of Québec at Montreal, CRC (Communications Research Center of Canada), Stanford University (USA), Boston University (USA), UC Berkeley (USA), Clarkson University (USA), University of Paris VI (France), University of Bordeaux (France), Groningen University (the Netherlands), Shanghai Jiaotong University (China), Beijing Post and Telecommunication University, University of Sao Paulo (Brazil), and others. Synchromedia core theme consist in an intelligent and seamless integration of various perceptual modes of information that allows collaborative management and sharing of information, actions and behaviors beyond the multimedia teleconferencing and communication. Sustainable Smart Network and Cloud Computing Smart Networked Society Computational Intelligence and Image Processing Rather than using a conventional Client/Server architecture we adopt an advanced open overlay self scaling network architecture based on distributed and virtualized resources and grid computing paradigm. Our Research Cloud Computing Synchromedia leads pilot research projects developing various cloud computing platforms driving state-of-the-art next generation data centers and networks. Cloud computing links all resources together in a common architecture that can be virtualized. In other words, the compute and storage platform is architecturally “unified” with the network and the virtualization platform, making no distinction between the network and the edge devices connected to it. Cloud computing eliminates manual integration, in favor of an integrated architecture, thereby breaking down the silos of compute, storage, and network resources. Sample projects carried out by Synchromedia in this field include Synchromedia Platform (CFI), GreenStar Network (CANARIE), and Green Sustainable Telco Cloud (Ericsson). Network Virtualization Network virtualization research at Synchromedia is aimed at creating new models providing a logical software-based view of the underlying hardware and software networking resources (switches, routers, etc.). This results in an intelligent abstraction that makes it easy to deploy and manage network services and resources. We are pioneering the NFV (Network Function Virtualization) concept and very active in SDN (Software-Defined Networking) solutions, especially with respect to intra and inter data center networks. Sample projects carried out by Synchromedia in this field include UCLP (CANARIE), PanLab 1 (EU’s FP6 Framework), PabLab 2 (EU’s FP7 Framework), Mantychore (EU’s FP7 Framework), GreenStar Network (CANARIE) and V-WAN hypervisor (Ciena). Sustainable and Environment Awareness Relying heavily on the computing power of data centers, the Internet is enabling the establishment of entirely new industries and unlocking vast potential for innovation in existing ones, like education, health care, energy, the public sectors, and knowledge dissemination. Advanced countries, like the US, have proposed national plans to ensure that every citizen will have access to ultra-broadband Internet. As a result, larger data centers are required to host increasingly critical applications. This raises new questions, in terms of scalability, resiliency and operational cost-effectiveness, and power consumption and environmental concerns in particular. Novel paradigms are therefore required to reduce massive waste due to comatose servers and overprovision, as well as new energy efficient approaches to design and manage data centers. Synchromedia is worldwide recognized as leader in Green ICT, Sustainability and Environmental Awareness research. In collaboration with the Canadian Standards Association (CSA), Synchromedia introduced the first Canadian standard for green ICT projects in 2011. It is also an active member of ITU and many other research institutes on life-cycle assessment for ICT. Network and Cloud Security The potentially revolutionary cloud computing and networking paradigms could not be achieved in reality without appropriate security and privacy solutions. Designing trustworthy clouds or interoperable secure clouds is very challenging, because the heterogeneity and diversity of the services provided, as well as the diverse access requirements of domains in cloud environments, demand fine-grained access control policies. Synchromedia developed new security services for cloud platforms by integrating privacy-preserving protocols to verify various identity attributes through zero knowledge, proof-based techniques. The framework also allows to efficiently capture a generic set of the parameters that are essential to establishing trust and to managing evolving trust and interaction/sharing requirements. Our research addresses semantic heterogeneity, secure interoperability and policy evolution management, as well as reliability violations. Traffic Modeling and Big Data Analytics Synchromedia research has a strong focus on smart traffic analyzer and QoS provisioning based on big data mining. Various models have been built for both intra and inter- data center network, and a framework for optimally allocating resource according to each traffic model has been developed, in particular with respect to Telco and HPC applications. Based on advanced learning algorithms, relationship between application requirements and underlying traffic is discovered. These patents are contextualized to understand the behaviours of network elements, applications, and data centres, thus help optimize operational activities. Traffic modeling and big data analytical methods introduced by Synchromedia team have effectively been used in both cloud computing and Future Internet fields. Telepresence Remote collaborative working environments aim at reducing time and space constraints by exploiting existing computer and network infrastructures. Such environments become popular in business, education and research institutions. Several integrated environments for supporting collaborative work exist, but there are very few solutions which consider the hardware as well as the software sharing dimension of collaborative workspaces. Research conducted at Synchromedia ultimately resulted in highly integrated working platform supporting remote collaborative work. Document and Image Processing Processing of huge volumes of unprocessed, handwritten and historical documents is a critical challenge in front of many heritage and cultural institutes and organizations. Our main objective in the field of document image processing and understanding is development and implementation of novel models and techniques which may help in generating, enhancing, presenting and understanding of handwritten document images. Direct involvement of scholars and researchers from various institutes and universities, such as McGill University, allowed us to choose goal-oriented directions for our research and development. Currently, our focus is on providing a complete understanding system which consists of imaging, pre-processing/enhancement, word-spotting, transliteration and data mining units in an user-friendly collaborative and virtual environment. See MoreSynchromedia’s Partners Page load link Go to Top",
  "content_length": 9757,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:01"
}