{
  "name": "Mohammad A. Alsmirat",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=masmirat",
  "status": "success",
  "content": "Mohammad Abdullah Alsmirat × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content mohammad abdullah alsmirat • Department of Computer Science - Faculty Member --- M2-L2 Department of Computer Science masmirat@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Engineering from Wayne State University, 2013 Msc. of Computer Science from NYIT, 2003 Bsc. of Computer Science from Jordan University of Science and Technology, 2002 Publications Sarhan, Nabil J and Alsmirat, Mohammad A and Al-Hadrusi, Musab, \"Waiting-time prediction in scalable on-demand video streaming,\" ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM), vol. 6, no. , pp. 0-0, 2010, ACM Alsmirat, Mohammad A and Sarhan, Nabil J, \"Detailed performance and waiting-time predictability analysis of scheduling options in on-demand video streaming,\" Journal on Image and Video Processing, vol. 2010, no. , pp. 0-0, 2010, Hindawi Publishing Corp. Al-Ayyoub, Mahmoud and Jararweh, Yaser and Doulat, Ahmad and Salameh, Haythem A Bany and Al Aziz, Ahmad Al Abed and Alsmirat, Mohammad and Khreishah, Abdallah A, \"Virtualization-based cognitive radio networks,\" Journal of Systems and Software, vol. 117, no. , pp. 15-29, 2016, Elsevier Alsmirat, Mohammad A and Sarhan, Nabil J, \"Detailed performance and waiting-time predictability analysis of scheduling options in on-demand video streaming,\" Journal on Image and Video Processing, vol. 2010, no. , pp. 0-0, 2010, Hindawi Publishing Corp. Alsmirat, Mohammad A and Jararweh, Yaser and Obaidat, Islam and Gupta, Brij B, \"Automated wireless video surveillance: an evaluation framework,\" Journal of Real-Time Image Processing, vol. 13, no. , pp. 527-546, 2017, Springer Berlin Heidelberg Alsmirat, Mohammad A and Jararweh, Yaser and Obaidat, Islam and Gupta, Brij B, \"Internet of surveillance: a cloud supported large-scale wireless surveillance system,\" The Journal of Supercomputing, vol. 73, no. , pp. 973-992, 2017, Springer US Alsmirat, Mohammad A and Jararweh, Yaser and Al-Ayyoub, Mahmoud and Shehab, Mohammed A and Gupta, Brij B, \"Accelerating compute intensive medical imaging segmentation algorithms using hybrid CPU-GPU implementations,\" Multimedia Tools and Applications, vol. 76, no. , pp. 3537-3555, 2017, Springer US Tashtoush, Yahya M and Alsmirat, Mohammad A and Alghadi, Tasneem, \"Geometric sequence based multipath routing protocol for multi-hop ad hoc networks,\" International Journal of Pervasive Computing and Communications, vol. 12, no. , pp. 394-407, 2016, Emerald Group Publishing Limited Alsmirat, Mohammad A and Obaidat, Islam and Jararweh, Yaser and Al-Saleh, Mohammed, \"A security framework for cloud-based video surveillance system,\" Multimedia Tools and Applications, vol. 76, no. , pp. 22787-22802, 2017, Springer US Jararweh, Yaser and Alsmirat, Mohammad A and Al-Zaboon, Muneer and SALAMEH, HAYTHEM A and Badarneh, Osamah S, \"A Multi-Hop Multicasting Routing Protocol for Cognitive Radio Networks.,\" Adhoc \\& Sensor Wireless Networks, vol. 39, no. , pp. 0-0, 2017 Alsmirat, Mohammad A and Al-Alem, Fatimah and Al-Ayyoub, Mahmoud and Jararweh, Yaser and Gupta, Brij, \"Impact of digital fingerprint image quality on the fingerprint recognition accuracy,\" Multimedia Tools and Applications, vol. , no. , pp. 1-40, 2018, Springer US Alsmirat, Mohammad A and Sarhan, Nabil J, \"Cross-layer optimization for many-to-one wireless video streaming systems,\" Multimedia Tools and Applications, vol. , no. , pp. 1-23, 2018, Springer US Al-Ayyoub, Mahmoud and Al-Mnayyis, Nusaiba and Alsmirat, Mohammad A and Alawneh, Khaled and Jararweh, Yaser and Gupta, Brij B, \"SIFT based ROI extraction for lumbar disk herniation CAD system from MRI axial scans,\" Journal of Ambient Intelligence and Humanized Computing, vol. , no. , pp. 1-9, 2018, Springer Berlin Heidelberg Jararweh, Yaser and Issa, Manar Bani and Daraghmeh, Mustafa and Al-Ayyoub, Mahmoud and Alsmirat, Mohammad A, \"Energy efficient dynamic resource management in cloud computing based on logistic regression model and median absolute deviation,\" Sustainable Computing: Informatics and Systems, vol. 19, no. , pp. 262-274, 2018, Elsevier Bani Baker, Qanita and Alsmirat, Mohammad A. and Balhaf, Khaled and Shehab, Mohammed A., \"Accelerating white blood cells image segmentation using GPUs,\" Concurrency and Computation: Practice and Experience, vol. 0, no. , pp. 0-0, M Alsmirat and Y Jararweh and M Al-Ayyoub, \"Speeding {DBLP} querying using hadoop and spark,\" {IOP} Conference Series: Materials Science and Engineering, vol. 459, no. , pp. 0-0, 2018, {IOP} Publishing AlZu'bi, Shadi and AlQatawneh, Sokyna and ElBes, Mohammad and Alsmirat, Mohammad, \"Transferable HMM probability matrices in multi-orientation geometric medical volumes segmentation,\" Concurrency and Computation: Practice and Experience, vol. 0, no. , pp. 0-0, Mohammad Al-Zinati and Taha Almasri and Mohammad Alsmirat and Yaser Jararweh, \"Enabling multiple health security threats detection using mobile edge computing,\" Simulation Modelling Practice and Theory, vol. , no. , pp. 0-0, 2019 Asma?a Al-Mnayyis, Sanaa Abu Alasal, Mohammad Alsmirat, Qanita Bani Baker, Shadi AlZu?bi, \"Lumbar disk 3D modeling from limited number of MRI axial slices,\" International Journal of Electrical and Computer Engineering (IJECE), vol. , no. , pp. 4101-4108, 2020 Yousef Shatnawi, Mohammad Alsmirat, Mahmoud Al-Ayyoub, \"Face Recognition using Eigen-faces and ExtensionNeural Network,\" , 2019, pp. 0-0 M. {Ebrahim} and M. {Al-Ayyoub} and M. A. {Alsmirat}, \"Will Transfer Learning Enhance ImageNet Classification Accuracy Using ImageNet-Pretrained Models?,\" , 2019, pp. 211-216 M. {Ebrahim} and M. {Al-Ayyoub} and M. {Alsmirat}, \"Determine Bipolar Disorder Level from Patient Interviews Using Bi-LSTM and Feature Fusion,\" , 2018, pp. 182-189 Alsmirat, Mohammad A and Al-Hadrusi, Musab and Sarhan, Nabil J, \"Analysis of waiting-time predictability in scalable media streaming,\" , 2007, pp. 727-736, ACM Alawneh, Khaled and Al-dwiekat, Mays and Alsmirat, Mohammad and Al-Ayyoub, Mahmoud, \"Computer-aided diagnosis of lumbar disc herniation,\" , 2015, pp. 286-291, IEEE Alsmirat, Mohammad A and Sarhan, Nabil J, \"Predictive cost-based scheduling for scalable media streaming,\" , 2008, pp. 857-860, IEEE Alsmirat, Mohammad A and Al-Rifai, Saleh Yousef and Sababha, Belal H, \"Reducing Message Loss in DSRC Networks using Dynamic Distribution of Safety Messages over EDCA Access Categories,\" , 2015, pp. 0-0 Alsmirat, Mohammad A and Sarhan, Nabil J, \"Cross-layer optimization and effective airtime estimation for wireless video streaming,\" , 2012, pp. 1-7, IEEE Alsmirat, Mohammad A and Sarhan, Nabil J, \"Performance and Waiting-Time Predictability Analysis of Design Options in Cost-Based Scheduling for Scalable Media Streaming,\" , 2009, pp. 150-162, Springer, Berlin, Heidelberg Obaidat, Islam and Alsmirat, Mohammad and Jararweh, Yaser, \"Completing ieee 802.11 e implementation in ns-3,\" , 2016, pp. 190-195, IEEE Alsmirat, Mohammad A, \"Musab Al-Hadrusi, Nabil J. Sarhan, Analysis of waiting-time predictability in scalable media streaming,\" , 2007, pp. 0-0 Jararweh, Yaser and Doulat, Ahmad and Darabseh, Ala and Alsmirat, Mohammad and Al-Ayyoub, Mahmoud and Benkhelifa, Elhadj, \"SDMEC: Software defined system for mobile edge computing,\" , 2016, pp. 88-93, IEEE Al-Ayyoub, Mahmoud and AlZu'bi, Shadi M and Jararweh, Yaser and Alsmirat, Mohammad A, \"A GPU-based breast cancer detection system using Single Pass Fuzzy C-Means clustering algorithm,\" , 2016, pp. 650-654, IEEE Al-alem, Fatimah and Alsmirat, Mohammad A and Al-Ayyoub, Mahmoud, \"On the road to the internet of biometric things: a survey of fingerprint acquisition technologies and fingerprint databases,\" , 2016, pp. 1-6, IEEE Ekhtoom, Duaa and Al-Ayyoub, Mahmoud and Al-Saleh, Mohammed and Alsmirat, Mohammad and Hmeidi, Ismail, \"A compression-based technique to classify metamorphic malware,\" , 2016, pp. 1-6, IEEE Alsmirat, Mohammad and Sarhan, Nabil J, \"Cross-layer optimization for automated video surveillance,\" , 2016, pp. 243-246, IEEE Tashtoush, Yahya M and Al-Soud, Majd and Fraihat, Manar and Al-Sarayrah, Walaa and Alsmirat, Mohammad A, \"Adaptive e-learning web-based English tutor using data mining techniques and Jackson's learning styles,\" , 2017, pp. 86-91, IEEE Balhaf, Khaled and Alsmirat, Mohammad A and Al-Ayyoub, Mahmoud and Jararweh, Yaser and Shehab, Mohammed A, \"Accelerating Levenshtein and Damerau edit distance algorithms using GPU with unified memory,\" , 2017, pp. 7-11, IEEE Ababneh, Ahmad and Al-Ayyoub, Mahmoud and Jararweh, Yaser and Alsmirat, Mohammad, \"Collision-free anycast transmission scheduling in UWSNs,\" , 2017, pp. 207-212, IEEE Issa, Manar Bani and Daraghmeh, Mustafa and Jararweh, Yaser and Al-Ayyoub, Mahmoud and Alsmirat, Mohammad and Benkhelifa, Elhadj, \"Using Logistic Regression to Improve Virtual Machines Management in Cloud Computing Systems,\" , 2017, pp. 628-635, IEEE Alsmirat, Mohammad A and Qawasmeh, Ethar and Al-Ayyoub, Mahmoud and Damer, Nour Alhuda and Jararweh, Yaser, \"Building an Image Database for Studying Image Retargeting,\" , 2017, pp. 457-462, IEEE Ebrahim, Maad and Alsmirat, Mohammad and Al-Ayyoub, Mahmoud, \"Performance study of augmentation techniques for HEp2 CNN classification,\" , 2018, pp. 163-168, IEEE Mthunzi, Siyakha N and Benkhelifa, Elhadj and Alsmirat, Mohammad A and Jararweh, Yaser, \"Analysis of VM communication for VM-based cloud security systems,\" , 2018, pp. 182-188, IEEE Alsmirat, Mohammad A and Al--Hadrusi, Musab and Jararweh, Yaser, \"Multimedia Systems Power/Energy Reduction Architectural Techniques: a Survey,\" , 2017, pp. 1-6, IEEE Alasal, Sanaa Abu and Alsmirat, Mohammad and Baker, Qanita Bani and Jararweh, Yaser, \"Improving Passive 3D Model Reconstruction using Image Enhancement,\" , 2018, pp. 1-7, IEEE Alsmirat, M and Jararweh, Y and Al-Ayyoub, M, \"Speeding DBLP queryin",
  "content_length": 18308,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:09"
}