{
  "name": "Mohammad Mohammadi Amiri",
  "homepage": "https://sites.google.com/view/mmamiri",
  "status": "success",
  "content": "Mohammad's homepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationMohammad Mohammadi AmiriAssistant ProfessorRensselaer Polytechnic InstituteComputer Science Department [Email] [Google scholar] | [LinkedIn] | [ResearchGate] | [X (Twitter)] Prospective graduate students: I am looking for Ph.D. students with strong mathematical and analytical skills. Please send me your CV if you are interested in Machine Learning and comfortable with programming.   NewsMay 2023: I will be joining the CS department at Rensselaer Polytechnic Institute (RPI) as an Assistant Professor in Fall 2023.Jan. 2023: Happy to announce that our paper \"Greedy centroid initialization for federated K-means\" got accepted in the CISS 2023 conference for lecture presentation.Nov. 2022: Happy to announce that our paper \"Fundamentals of task-agnostic data valuation\" got accepted in the AAAI 2023 conference for oral presentation.Oct. 2022: Great pleasure to talk about my recent research on \"Decentralized data valuation\" in the Decentralized Society + Web3 Research Panel during the MIT Media Lab Fall Meeting. Aug. 2022: Check our recent work on \"Fundamentals of task-agnostic data valuation\" here. Apr. 2022: Honored to receive the IEEE Communications Society Young Author Best Paper Award for my paper \"Federated learning over wireless fading channels\".Feb. 2022: Happy to join Camera Culture research group at the MIT Media Lab as a Postdoctoral Associate. Aug. 2021: Happy to be the Keynote speaker at the Futurewei University Days Workshop.Dec. 2020: Great opportunity to speak to the audience as the Keynote speaker at IEEE International Conference on Communications, Networks and Satellite (COMNETSAT). Mar. 2020: Honored to receive the Best PhD Thesis award from the IEEE Information Theory Chapter of UK and Ireland.Nov. 2019: Honored to receive the Outstanding PhD Thesis award from the Electrical and Electronic Engineering Department at Imperial College London.Oct. 2019: Happy to join Princeton University as a Postdoctoral Research Associate to work with Prof. Vincent Poor and Prof. Sanjeev Kulkarni.BiographyMy research interests revolve around the theme of enabling decentralized intelligence. Consider the continuously increasing number of connected devices with the emergence of the Internet-of-Things paradigm and various smart sectors generating a significant amount of data. Tailoring machine learning algorithms to exploit this massive amount of data can lead to many new applications and open-up new markets in medical care, finance, and enabling ambient intelligence. Due to the privacy concerns and the growing storage and computational capabilities of edge devices, it is increasingly attractive to store and process the data locally by shifting network computations to the edge. This enables decentralized intelligence where local computations on the data converts decentralized data to a global intelligence; hence, enhancing data privacy while learning from the collection of data. My research focuses on creation of a collective intelligence using all the data that is inherently decentralized and only visible to its owner. Information about one of my latest research projects can be found here. I received the B.Sc. degree in Electrical Engineering from the Iran University of Science and Technology in 2011 and the M.Sc. degree in Electrical and Computer Engineering from the University of Tehran in 2014, both with the highest rank in classes. I also obtained the Ph.D. degree in Electrical and Electronic Engineering at Imperial College London in 2019. I then spent two years from 2019 to 2021 as a Postdoctoral Research Associate in the Department of Electrical and Computer Engineering at Princeton University supervised by Prof. Vincent Poor and Prof. Sanjeev Kulkarni. I am currently a Postdoctoral Associate at the MIT Media Lab where I am working under the supervision of Prof. Ramesh Raskar.I received the Best Ph.D. Thesis Award from the Department of Electrical and Electronic Engineering at Imperial College London, as well as the IEEE Information Theory Chapter of UK and Ireland in the year 2019. I am also the recipient of the IEEE Communications Society Young Author Best Paper Award (2022) for the paper titled \"Federated learning over wireless fading channels\". My research interests include machine learning, information and coding theory, wireless communications, privacy and security, distributed computing, and signal processing.Honors and AwardsIEEE Communications Society Young Author Best Paper Award (2022), paper \"Federated learning over wireless fading channels\", IEEE Transactions on Wireless Communications, vol. 19, no. 5, pp. 3546-3557, May 2020.Best PhD Thesis (2019), IEEE Information Theory Chapter of UK and Ireland.Eryl Cadwallader Davies Prize - Outstanding PhD Thesis (2019), EEE Department, Imperial College London.EEE Departmental Scholarship (2015 - 2019), Imperial College London.Excellent Student (2014), Ranked 1st among all M.Sc. students in ECE Department, University of Tehran. Excellent Student (2011), Ranked 1st among all B.Sc. students in EE Department, Iran University of Science and Technology.Outstanding Student Award (2007 - 2011), Iran University of Science and Technology.PublicationBook ChaptersM. Mohammadi Amiri and D. Gunduz, Machine learning and wireless communications, (edited by H. Vincent Poor, Yonina Eldar, Andrea Goldsmith, and Deniz Gunduz), Cambridge University Press, Cambridge, UK, 2021.M. Mohammadi Amiri and D. Gunduz, Edge caching for mobile networks, (edited by H. Vincent Poor and Wei Chen), IET Press, London, UK, 2021.Journal PapersY.-S. Jeon, M. Mohammadi Amiri, and N. Lee, Communication-efficient federated learning over MIMO multiple access channels, IEEE Transactions on Communications, vol. 70, no. 10, pp. 6547-6562, Oct. 2022.H. Hellstrom, J. M. da Silva, M. Mohammadi Amiri, M. Chen, V. Fodor, H. V. Poor, and C. Fischione, Wireless for machine learning: a survey, Foundations and Trends in Signal Processing, vol. 15, no. 4, pp. 290-399, Jun. 2022.M. Mohammadi Amiri, D. Gunduz, S. R. Kulkarni, and H. V. Poor, Convergence of federated learning over a noisy downlink, IEEE Transactions on Wireless Communications, vol. 21, no. 3, pp. 1422-1437, Mar. 2022.M. Mohammadi Amiri, T. M. Duman, D. Gunduz, S. R. Kulkarni, and H. V. Poor, Blind federated edge learning, IEEE Transactions on Wireless Communications, vol. 20, no. 8, pp. 5129-5143, Aug. 2021.M. Mohammadi Amiri, D. Gunduz, S. R. Kulkarni, and H. V. Poor, Convergence of update aware device scheduling for federated learning at the wireless edge, IEEE Transactions on Wireless Communications, vol. 20, no. 6, pp. 3643-3658, Jun. 2021.Y.-S. Jeon, M. Mohammadi Amiri, J. Li, and H. V. Poor, A compressive sensing approach for federated learning over massive MIMO communication systems, IEEE Transactions on Wireless Communications, vol. 20, no. 3, pp. 1990-2004, Mar. 2021.D. Gunduz, D. Burth Kurka, M. Jankowski, M. Mohammadi Amiri, E. Ozfatura, and S. Sreekumar, Communicate to learn at the edge, IEEE Communication Magazine, vol. 58, no. 12, pp. 14-19, Dec. 2020.  J. Zhao, M. Mohammadi Amiri, and D. Gunduz, Multi-antenna coded content delivery with caching: a low-complexity solution, IEEE Transactions on Wireless Communications, vol. 19, no. 11, pp. 7484-7497, Nov. 2020.M. Mohammadi Amiri and D. Gunduz, Federated learning over wireless fading channels, IEEE Transactions on Wireless Communications, vol. 19, no. 5, pp. 3546-3557, May 2020 (IEEE Communications Society Young Author Best Paper Award). M. Mohammadi Amiri and D. Gunduz, Machine learning at the wireless edge: distributed stochastic gradient descent over-the-air, IEEE Transactions on Signal Processing, vol. 68, pp. 2155-2169, Apr. 2020. M. Mohammadi Amiri and D. Gunduz, Computation scheduling for distributed machine learning with straggling workers, IEEE Transactions on Signal Processing, vol. 67, no. 24, pp. 6270-6284, Dec. 2019.Q. Yang, M. Mohammadi Amiri, and D. Gunduz, Audience-retention-rate-aware caching and coded video delivery with asynchronous demands, IEEE Transactions on Communications, vol. 67, no. 10, pp. 7088-7102, Oct. 2019.M. Mohammadi Amiri and D. Gunduz, Caching and coded delivery over Gaussian broadcast channels for energy efficiency‌, IEEE Journal on Selected Areas in Communications, vol. 36, no. 8, pp. 1706‌-1720, Aug. 2018.M. Mohammadi Amiri and D. Gunduz, ‌‌Cache-aided content delivery over erasure broadcast channels‌, IEEE Transactions on Communications, vol. 66, no. 1, pp. 370-381, Jan. 2018.M. Mohammadi Amiri, Q. Yang, and D. Gunduz, Decentralized caching and coded delivery with distinct cache capacities, IEEE Transactions on Communications, vol. 65, no. 11, pp. 4657-4669, Nov. 2017.M. Mohammadi Amiri and D. Gunduz, Fundamental limits of coded caching: Improved delivery rate-cache capacity trade‌‌-off‌, IEEE Transactions on Communications, vol. 65, no. 2, pp. 806-815, Feb. 2017.M. Mohammadi Amiri and B. Maham, Two novel adaptive transmission schemes in a decode-and-forward relaying network, Wireless Personal Communications, vol. 96, no. 4, pp. 5705-5722, Oct. 2017.M. Mohammadi Amiri, A. Olfat, and N. C. Beaulieu, Novel beamforming scheme for multicasting in cooperative wireless networks with a multiple antenna relay, IEEE Transactions on Wireless Communications, vol. 14, no. 8, pp. 4482-4493, Aug. 2015.Conference ProceedingsZ. Wu, M. Mohammadi Amiri, R. Raskar, and B. K. H. Low, Incentive-aware federated learning with training-time model rewards, under review.P. Vapakomma, M. Mohammadi Amiri, C. L. Canonne, R. Raskar, and A. Pentland, Private independence testing across two parties, under review.A. Chopra, S. K. Sahu, A. Singh, A. Java, P. Vepakomma, M. Mohammadi Amiri, and R. Raskar, Adaptive split learning, Conference on Machine Learning and Systems (MLSys), Miami Beach, FL, USA, Jun. 2023.K. Yang*, M. Mohammadi Amiri*, and S. Kulkarni, Greedy centroid initialization for federate",
  "content_length": 14612,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:17"
}