{
  "name": "Mohamed Elhoseiny",
  "homepage": "http://www.mohamed-elhoseiny.com",
  "status": "success",
  "content": "Mohamed H. Elhoseiny Mohamed H. ElhoseinyHomeBio and EducationPublicationsResearch and CollaboratorsTalks and DemosTeachingHonors and AwardsCurrent Group Members and Openings in Vision-CAIR Group*ContactphotosHomeArticles, Talks, and Lectures I likedAwards, Media, and RecognitionBio and EducationCode (New)▼Computer Vision ProjectsActivity Recognition and Motion CharacterizationEDiSEStructured RegressionUndergraduate-Research Mentored Projects (2007-2011)Weather Classification CNNWrite a Classifier ProjectWrite_kernel_classifierContactCurrent Group Members and Openings in Vision-CAIR Group*Honors and AwardsPersonalPhoto Galeryphotos▼PublicationsOverlapping Domain Cover Framework for Structured RegressionReadingsReadings and Articles▼Research and Collaborators▼Natural Language Processing and Multmedia ProjectsText 2 Multilevel MindMapUndergraduate-Research Mentored Projects (2007-2011)Research Statementsherlock projectSoftware and Hardware SkillsStructured Facts 380K: Structured Coco, Structured Flickr30K EntitiesTalks and DemosTeachingVision-CAIR Groupvision-cair-group▼Work ExperienceFurure Business Development (FBD)Giza Systems ExperienceHOI Group ExperienceIPPLEX Corporation , Los Angeles, USA Home Mohamed Elhoseiny, Ph.D., MSc (CS), MSc (CSys).I will serve as an area chair at ICCV 2021! I will serve as an area chair at  CVPR 2021!23 May 2021: I am looking for a passionate and creative postdoc researcher to join the VisionCAIR group @KAUST (https://cemse.kaust.edu.sa/vision-cair), apply here https://apply.interfolio.com/86108. Assistant Professor of Computer Science at KAUST(King Abdullah University of Science and Technology)       Current AffiliationsKAUST, Assistant Professorhttps://cemse.kaust.edu.sa/vision-cairEducationStanford University, Graduate School of  Business, Ignite Program  Rutgers University, MS/PhD ResearcherI worked at Stanford University, Visiting Faculty Scholar (2019-2020)https://cs.stanford.edu/~elhoseinyhttps://elhosemh.people.stanford.edu/Baidu Research,AI Consultant (March 2019- Sept 2019)               Facebook AI Research,Postdoc Fellow (Dec 2016- Jan 2019)              Adobe Research, Research AssociateSRI International, Research InternBio, CV   , linkedin fffffffffhkjhgjkdhkjfhkjdhfkjdhkfjhdkjhfkdfkjdhfkjhdkjfhkjdhfkjdhfjkhfkkkkkResearch interests: Computer Vision, Language & Vision,   Computational Creativity (Art | Fashion & AI).  I co-organized the 1st Workshop on Closing the Loop between Vision and Language, held in conjunction with ICCV 2015 and  2nd Workshop on Closing the Loop between Vision and Language, held in conjunction with ICCV 2017.I spoke at (Click) Talks (Highlights) (link for details) United Nations: My Take on AI for Mother Nature, Nov 2018My Creative Adversarial Network Demo at the official FAIR video, June 2018 CAN at HBO Silicon Valley ‎‎(Season 5, Episode 3)‎‎, 2018Work ExperienceAssistant Professor of Computer Science at KAUST, Thuwal, SA, Feb 2019-PresentVisiting Faculty at Baidu Silicon Valley AI Lab (SVAIL), Sunnyvale, CA, March 2019-PresentPostdoc Researcher at Facebook AI Research, Menlo Park, CA, Dec 2016-Jan 2019Computer Vision Research Intern at Adobe Research, Vision Group, San Jose, CA– under: Dr. Scott Cohen Liu, Walter Chang, and Brian Price– Summer 2015-Fall 2016Computer Vision Research Intern at SRI-International, Vision an Learning Group, Princeton, NJ– under: Dr. Jingen Liu, Hui Cheng, and Harpreet Sawhney– Summer 2014Computer Vision Research Intern at IPPLEX Corporation, LA, CA– under: Dr. Jeremi Sudol and David McKinnon– Summer 2012Research & Development Associate at Future Business Development, Cairo, Egypt– under Dr. Adnan Faqeeh – Summer 2011Senior R&D Software Engineer  (part-time) at House of Invention (HOI) GROUP, Cairo, Egypt– 2007-2011Undergrad-Research Mentor & Teaching Assistant  at Computer Science Department, ASU, Cairo, Egypt–2007-2011Software Testing Engineer at Giza Systems, Cairo, Egypt – 2006-2007 ServicesReviewer for IEEE TPAMI JournalReviewer for IEEE TMM JournalReviewer for IEEE TIP JournalReviewer for IEEE TNNLS Reviewer for CVPR, ICCV, ECCV conferencesReviewer for BMVCWReviewer for MVA Journal JournalNewsI will be an area chair, CVPR 2021                                                              Old News11/2017: Our paper \"The Shape of Art History in the Eyes of the Machine\" got accepted at AAAI 201809/2017: Program Committee member  CVPR18 07/2017: In 2017, I have 2 CVPR (first/co-first author), 1 AAAI (first author), 1 TPAMI (first author), 1 ICCC, 1 book chapter 2017 (first author), 1 US patent, organizing closing the loop between vision and language 2017.06/2017: US Patent accepted http://www.freepatentsonline.com/y2017/0132526.html05/2017: We will be organizing the second workshop on Closing the loop between Vision and Language link03/2017: Two papers accepted to CVPR1703/2017: Program Commitee member in  Workshop of Large Scale Biometrics :  http://isse.cqu.edu.cn/lssb/02/2017: 6DS (28K images) and LSC (814K images) datasets was released. That was part of the sherlock project. The trained model2 on LSC is also available. see https://sites.google.com/site/mhelhoseiny/sherlock_project12/2016: code released, SMTGP (published at the Machine Learning Journal 2015) code released https://sites.google.com/site/mhelhoseiny/computer-vision-projects/structured-regression11/2016: (first author) AAAI 2017 paper accepted for publication, \"Sherlock: Scalable Fact Learning in Images\"  11/2016:  (first author) TPAMI paper accepted for publication08/2016: ACL 2016 VL presentation of our work on collecting hundreds of thousands of high quality annotations from image-caption datasets.  \"Automatic Annotation of structured Facts in Images\". The evaluation shows that the precision is >80%.  Dataset released  link07/2016: Received offers from Adobe Research, PostDocs at Stanford Univeristy, University of Torronto, and Facebook AI Research06/2016: Visiting Facebook06/2016:  Presenting our paper at ICML16, \"A Comparative Analysis and Study of Multiview CNN Models for Joint Object Categorization and Pose Estimation\"05/2016: Talk and a Poster at the Mid-Atlantic Computer Vision Workshop (MACV), 2016 at JHU link 04/2016: 1 paper accepted to ICML16 (first-author)!, acceptance rate 24.5%04/2016: Visiting Disney Research Pittsburgh04/2016: Visiting UC Berkeley EECS04/2016: Attending ICLR16 (presenting 1 conference paper (co-first author) and 1 workshop presentation (first-author) ), conference acceptance rate 25%.04/2016: Attending CVPR16 (presenting 1 conference paper and a Doctoral Consortium poster)04/2016:  CVPR16  Doctoral Consortium  award!04/2016:  ICLR16  Travel Award!03/2016: 1 paper accepted to CVPR 2016, \"SPDA-CNN: Unifying Semantic Part Detection and Abstraction for Fine-grained Recognition\".02/2016: 1 paper accepted to  ICLR 2016, \"Digging Deep into the layers of CNNs: In Search of How CNNs Achieve View Invariance\"11/2015: 1 paper accepted to WACV 2016, \"Joint Object Recognition and Pose Estimation using a Nonlinear View-invariant Latent Generative Model\"10/2015: 1 paper accepted to AAAI 2016, \"Zero Shot Event Detection by Multimodal Distributional Semantic Embedding of Videos\"12/02/2015 We finalized the program for ICCV15 workshop on Closing the loop between Vision and Language, Chile, Dec 17, 2015. link11/12/2015  Our paper \"Zero Shot Event Detection by Distributional Semantic Embedding of Videos\" has been accepted in AAAI-16.10/22/2015 Our paper \"Joint Object Recognition and Pose Estimation using a Nonlinear View-­Invariant Latent Generative Model\" has been accepted in WACV16. 10/05/2015 Call for extended abstracts for ICCV15 workshop on Closing the loop between Vision and Language, Chile, Dec 17, 2015.  https://sites.google.com/site/clvlworkshop/. Tentative deadline for abstracts is 10/30/2015.07/01/2015 Our paper \"Overlapping Domain Cover for Scalable and Accurate Kernel Machines\" got accepted in BMVC 2015 (oral)06/10/2015 Our workshop proposal \"Closing the Loop Between Language and Vision\" got accepted at ICCV 2015. We are inviting full papers in this area. 06/01/2015 Our paper \"Weather Classification with Deep Convolutional Neural Networks\" got accepted in ICIP 2015 (oral)04/12/2015 Our manuscript  \"Generalized Twin Gaussian Processes using Sharma-Mittal Divergence\" got accepted in the International Machine Learning Journal, Springer. The manuscript will be presented at ECMLPKDD 2015 (Journal Track), Porto, Portugal. Journal Track of ECMLPKDD is usually <10% acceptance rate. 03/02/2015 Our paper \"Learning Hypergraph-regularized Attribute Predictors\" got accepted in CVPR1501/10/2015 Our manuscript  \"Text to Multi-level MindMaps: A Novel Method for Hierarchical Visual Abstraction of Natural Language Text\" got accepted in the International Journal of Multimedia Tools and Applications. 08/15/2014 , Received a best Intern award, Silver at SRI International (below is a picture with Prof. Rakesh Kumar, the president of SRI-International, Princeton),             08/01/2014, Received Travel Grant by my department for ICIP 201406/19/2014, An NSF proposal by my advisor based on our \"Write a Classifier\" ICCV13 results got accepted by NSF and we received  about 500,000$ from which my PhD thesis is funded this year. You can see that the proposal title has same name.  http://www.cs.rutgers.edu/news/articles/2014/06/19/prof-elgammal-awarded-nsf-grant/06/01/2014, A paper has been accepted to ICIP14.03/15/2014 , I am going to a summer intern for 2014 at SRI-International, Vision and Learning Group10/30/2013, Travel Award by PAMI 450$ for ICCV13 10/01/ 2013, A Workshop short paper at VisDA workshop at ICCV1308/30/ 2013, A paper has been accepted in ICCV1308/15/2013, Won the travel award from Rutgers to Melbourne to present my ICIP13 paperA paper has been accepted in CVPRW, SISM, 04/27/ 2013, \"MultiClass Object Classiﬁcation in Video Surveillance Systems - Experimental Study\", CVPRW,SISM, 2013A paper has been accepted in ICIP, 2013, titled",
  "content_length": 10087,
  "method": "requests",
  "crawl_time": "2025-12-01 14:00:59"
}