{
  "name": "Mohammad Goudarzi",
  "homepage": "https://research.monash.edu/en/persons/mohammad-goudarzi",
  "status": "success",
  "content": "Mohammad Goudarzi - Monash University View Scopus Profile Mohammad Goudarzi Dr Lecturer, Department of Software Systems & Cybersecurity https://orcid.org/0000-0002-7178-3386 EmailMohammad.Goudarzimonashedu Accepting PhD Students 20172024 Research activity per year Personal profile BiographyDr. Mohammad Goudarzi is a Lecturer (Assistant Professor) in the Department of Software Systems and Cybersecurity at Monash University. Before his current position, he was affiliated with UNSW Sydney and Cybersecurity CRC, where he served as a Senior Research Associate on a joint project with Cisco. He earned his PhD in Computer Science and Engineering from The University of Melbourne. Please Visit my personal website @ https://www.mgoudarzi.info/ for the latest updates, open positions, and projects. Honors/Awards Selected as one of the top 200 young computer science and mathematics scientists by the Heidelberg Laureate Forum (HLF), International (2024).The Monash Faculty Education Excellence Award for Programs that Enhance Learning (FIT5225 - Cloud Computing and Security) (2023).The IEEE TCCLD Outstanding Ph.D. Thesis Award, International (2022).The IEEE TCSC Outstanding Ph.D. Dissertation Award, International (2022).The Oracle Cloud Architect of the Year Award, International (2022).Two research papers are selected among the most popular papers in IEEE Transactions on Mobile Computing (TMC) (CoRE A*), 2022.Computer Science (CS) Research Artefacts Grant, The University of Melbourne, Australia (2022).IEEE Outstanding Service Award, International (2021).The Oracle Cloud Infrastructure (OCI) ARM Accelerator Grant, International (2021).Rowden White Scholarship - Selected as the Highly Talented Ph.D. Student, The University of Melbourne, Australia (2019).The Iranian National Elites Foundation Award and Prize (top 0.1%), Iran (2015).Monash teaching commitmentDr. Mohammad Goudarzi teaches the following units in the Faculty of IT: FIT5225 (Cloud Computing and Security)FIT5202 (Data Processing for Big Data) Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationEngineering (Distributed Systems), Doctor of Philosophy (PhD), University of Melbourne2 Jul 2018 → 30 Jun 2022Award Date: 30 Jun 2022 Research area keywordsDistributed Systems and AlgorithmsCloud ComputingEdge ComputingInternet of Things (IoT)Applied Machine Learning Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2017 2017 2021 2022 2023 2024 2024 10 Article 6 Conference Paper 2 Chapter (Book) Research output per year Research output per year Deep Reinforcement Learning-based scheduling for optimizing system load and response time in edge and fog computing environmentsWang, Z., Goudarzi, M., Gong, M. & Buyya, R., Mar 2024, In: Future Generation Computer Systems. 152, p. 55-69 15 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 100 Citations (Scopus) FLight: A lightweight federated learning framework in edge and fog computingZhu, W., Goudarzi, M. & Buyya, R., May 2024, In: Software: Practice and Experience. 54, 5, p. 813-841 29 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 9 Citations (Scopus) Resource management in edge and fog computing using FogBus2 frameworkGoudarzi, M., Deng, Q. & Buyya, R., 2024, Managing Internet of Things Applications across Edge and Cloud Data Centres. Ranjan, R., Mitra, K., Prakash Jayaraman, P. & Y. Zomaya, A. (eds.). London UK: Institution of Engineering and Technology (IET), p. 17-52 36 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research 1 Citation (Scopus) μ-DDRL: A QoS-Aware Distributed Deep Reinforcement Learning Technique for Service Offloading in Fog Computing EnvironmentsGoudarzi, M., Rodriguez, M. A., Sarvi, M. & Buyya, R., Jan 2024, In: IEEE Transactions on Services Computing. 17, 1, p. 47-59 13 p.Research output: Contribution to journal › Article › Research › peer-review 13 Citations (Scopus) A Distributed Deep Reinforcement Learning Technique for Application Placement in Edge and Fog Computing EnvironmentsGoudarzi, M., Palaniswami, M. & Buyya, R., 1 May 2023, In: IEEE Transactions on Mobile Computing. 22, 5, p. 2491-2505 15 p.Research output: Contribution to journal › Article › Research › peer-review 98 Citations (Scopus) View all 18 research outputs",
  "content_length": 4931,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:12"
}