{
  "name": "Mohamed Sarwat",
  "homepage": "http://faculty.engineering.asu.edu/sarwat",
  "status": "success",
  "content": "Mo Sarwat – Geospatial Data Technologist & Computer Sciencist Skip to content Mo SarwatAssociate ProfessorComputer Science and EngineeringSchool of Computing and AIIra A. Fulton Schools of EngineeringArizona State University Short Bio Mo is an associate professor of computer science at Arizona State University. Dr. Sarwat is a recipient of the 2019 National Science Foundation CAREER award.  His general research interest lies in developing robust and scalable data systems for spatial and spatiotemporal applications. The outcome of his research has been recognized by two best research paper awards in the IEEE International Conference on Mobile Data Management (MDM 2015) and the International Symposium on Spatial and Temporal Databases (SSTD 2011), a best of conference citation in the IEEE International Conference on Data Engineering (ICDE 2012) as well as a best vision paper award (3rd place) in SSTD 2017. Besides impact through scientific publications, Mo is also the co-architect of several software artifacts, which include Apache Sedona (a scalable system for processing big geospatial data) that is being used by major tech companies. He is an associate editor for the GeoInformatica journal and has served as an organizer / reviewer / program committee member for major data management and spatial computing venues. In June 2019, Dr. Sarwat has been named an Early Career Distinguished Lecturer by the IEEE Mobile Data Management community. Quick links Selected Publications A Machine Learning-Aware Data Re-partitioning Framework for Spatial Datasets. K. Chowdhury, Venkata Vamsikrishna Meduri, M. Sarwat. inproceedings of the IEEE International Conference on Data Engineering, IEEE ICDE2022,in Kuala Lampur, Malaysia  April 2022 A Comprehensive Benchmark Framework for Active Learning Methods in Entity Matching, Venkata Vamsikrishna Meduri, Lucian Popa, Prithviraj Sen, M. Sarwat. Proceedings of the 2020 International Conference on Management of Data, ACM SIGMOD Conference 2020, in Portland, Oregon June 2020 Turbocharging Geospatial Visualization Dashboards via a Materialized Sampling Cube Approach, Jia Yu and M. Sarwat. in proceedings of the IEEE International Conference on Data Engineering, IEEE ICDE 2020, in Dallas, Texas April 2020 Spatial Data Management in Apache Spark: The GeoSpark Perspective and Beyond [Source Code], Jia Yu, Zongsi Zhang, and M. Sarwat. in the International Journal on Advances of Computer Science for Geographic Information Systems, Springer GeoInformatica 2019 A Generic Database Indexing Framework for Large-Scale Geographic Knowledge Graphs, Yuhan Sun and M. Sarwat. in proceedings of the 26th ACM International Conference on Advances in Geographic Information Systems, ACM SIGSPATIAL GIS 2018, in Seattle, Washington, USA, November 2018 Database Systems Support for Personalized Recommendation Applications,  M. Sarwat, Raha Moraffah, Mohamed F. Mokbel, and James L. Avery. in proceedings of the IEEE International Conference on Data Engineering, IEEE ICDE 2017, in San Diego, CA April 2017 Two Birds, One Stone: A Fast, yet Lightweight, Indexing Scheme for Modern Database Systems [Source Code], Jia Yu and M. Sarwat. in proceedings of the Very Large Data Bases Endowment, PVLDB 2016, Volume 10, issue 4.  To be presented in VLDB 2017 in Munich Germany LARS*: A Scalable and Efficient Location-Aware Recommender System, M. Sarwat, Justin J. Levandoski, Ahmed Eldawy, and Mohamed F. Mokbel. in IEEE Transactions on Knowledge and Data Engineering, IEEE TKDE 2014 Horton+: A Distributed System for Processing Declarative Reachability Queries over Partitioned Graphs , M. Sarwat, Sameh Elnikety, Yuxiong He, and Mohamed F. Mokbel, in PVLDB Vol. 6 Issue. 14, PVLDB 2013, presented in the 40th International Conference on Very Large Databases VLDB 2014, Hangzhou, China, Sept, 2014 Recent News [06.10.2022] On leave of absence to work on building a startup [09.09.2021] Named the America Express Professor in Computing [05.10.2021] Tenured and promoted to Associate Professor [03.23.2021] Yuhan Sun successfully defended his PhD thesis and will join Microsoft Geospatial team [02.16.2021] Two Journal papers accepted to ACM TODS and ACM TSAS [09.21.2020] Paper on Visualizing Large-Scale Geospatial Data accepted to VLDB Journal [08.01.2020] GeoSpark is now an Apache (incubating) project under the new name Apache Sedona [05.18.2020] Jia Yu successfully defended his PhD thesis and will join Washington State University as an assistant professor in Fall 2020 [11.25.2019] Research paper on “Active Learning fo Entity Matching” accepted to ACM SIGMOD 2020 [06.12.2019] Named Early Career Distinguished Lecturer by the IEEE MDM community [02.01.2019] Received the National Science Foundation (NSF) CAREER award Scroll to Top",
  "content_length": 4779,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:06"
}