{
  "name": "Mohd Yamani Idna Idris",
  "homepage": "https://umexpert.um.edu.my/yamani",
  "status": "success",
  "content": "UMEXPERT - PROF. DR. MOHD YAMANI IDNA BIN IDRIS PROF. DR. MOHD YAMANI IDNA BIN IDRIS Department of Computer System & Technology Faculty of Computer Science and Information Technology yamanium.edu.my View CV View 1-Page CV Publons Scopus Link Biography Prof. Dr. Mohd Yamani Idna Idris has been a dedicated faculty member at Universiti Malaya since 2000, contributing significantly to education, research, and innovation. With interest and expertise in Internet of Things (IoT), image processing, computer vision, and pattern recognition, his scholarly work has enriched both academic knowledge and practical applications. His extensive experience in teaching, learning, and research has influenced countless learners, and his research is widely published in reputed journals. As a mentor, he has successfully supervised 25 Ph.D. candidates, providing invaluable emotional and motivational support to ensure their success. His expertise is also sought after in academic circles, where he serves as a reviewer and editorial board member for journals like MJCS, Pattern Recognition, and IEEE Transactions on ITS. Additionally, he has been an external examiner for Ph.D. candidates and has contributed to international technical review panels. Beyond his research contributions, Dr. Idris has held key faculty leadership positions, including Head of Department and Deputy Dean (Undergraduate (acting) and Research & Development), playing a vital role in shaping academic direction and fostering innovation. He also has experience as the Industrial Training Coordinator, where he bridges the gap between academia and industry, providing students with valuable real-world insights. His contributions also extend to national progress, as he has actively participated in digitalization initiatives for government agencies like KPDNHEP and MATRADE. Recognizing the importance of interdisciplinary collaboration, he has pioneered research efforts that integrate computer science with other fields, driving innovative solutions. Dr. Idris’s unwavering dedication has earned him three Certificates of Excellent Service and three Excellence Service Awards, highlighting his outstanding contributions to academia. His impact is further recognized internationally, having been listed among Stanford’s Top 2% Scientists in 2024. Through his leadership, mentorship, and groundbreaking research, Dr. Idris continues to shape academic excellence, industry collaboration, and scientific progress. Hide Collaborator rosli_salleh rjry saad zaily naemah ahamzah shaliza sumiani yzulina abdullah noraniza misslaiha nik_nazri zulkifliy View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status Machine Learning-driven Approaches To English Language Proficiency Testing on going A Faster Convergent Reinforcement Learning Algorithm For Smart Transportation System: Cognitive Radio Perspectives end Secure Localization By Drones (slbd): Mitigating Localization Error Attacks On The Internet Of Drones (iod) For Search And Rescue (sar) Operations end This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Book Proceeding 2025 DPA-HairNet: A Dual Encoder Attention Based Network for Hair Artifact Removal in Dermoscopic Images 2025 QRS-Trs: Style Transfer-Based Image-to-Image Translation for Carbon Stock Estimation in Quantitative Remote Sensing 2024 Adaptable and Dynamic Access Control Decision-Enforcement Approach Based on Multilayer Hybrid Deep Learning Techniques in BYOD Environment 2024 Cognitive radio and machine learning modalities for enhancing the smart transportation system: A systematic literature review 2008 2015 Automatic Speech Recognition for Quranic verse Recitation: A Review of Problems, Issues and Future Challenges, 2015 An Evaluation Of Error Level Analysis In Image Forensics 2014 Blind Source Mobile Devices Identification Using VoIP Communication 2012 Medical Identifier Technology for Pilgrims during the Hajj Season",
  "content_length": 4229,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:32"
}