{
  "name": "Mohit Iyyer",
  "homepage": "https://cs.umd.edu/~miyyer",
  "status": "success",
  "content": "Mohit Iyyer — Home mohit iyyer miyyer@umd.edu // CV // Scholar // github // x I'm an associate professor in computer science at University of Maryland, College Park and a member of CLIP. Previously, I was an associate professor at UMass CS, a Young Investigator at AI2, and a PhD student at UMD CS. My research interests lie broadly in natural language processing and machine learning. I'm currently excited about: (1) Improving instruction following abilities of large language models for long-form generation (2) Designing methods to evaluate long-form & multilingual text (e.g., for factuality and coherence) (3) Building collaborative human-LLM systems to help human authors in creative writing tasks (4) Increasing robustness of LLM-generated text detectors to attacks (e.g., paraphrasing) Oct. 2025: released our audit of AI content in American newspapers + a web dashboard to explore the data Sep. 2025: paper to appear at NeurIPS 2025 on string matching rewards for instruction following Aug. 2025: papers to appear at EMNLP 2025 on cross-lingual memorization, quantization for long-context tasks, and fast factuality evaluation Jul. 2025: papers to appear at COLM 2025 on synthetic long-context data, web agent evaluation, and multilingual long-context evaluation Apr. 2025: talk at University of Edinburgh's ILCC seminar Mar. 2025: released BEARCUBS, a benchmark for computer-using web agents Jan. 2025: my lab moved to UMD! Sep. 2024: papers to appear at EMNLP 2024 on long-context LLM evaluation and watermarking, and EMNLP Findings on factuality evaluation and long-form instruction tuning Aug. 2024: keynote at KDD CUP 2024 RAG workshop Jul. 2024: papers to appear at COLM 2024 on faithfulness in book summarization and image reproduction via multimodal LLMs Jul. 2024: keynote at Workshop on Long Context Foundation Models (ICML 2024) Jun. 2024: released NoCha, a new long-context LLM benchmark! Jun. 2024: talk at Tel Aviv University NLP seminar May 2024: papers to appear at ACL 2024 on multi-stage knowledge distillation and ACL Findings on search-augmented LLMs Mar. 2024: papers to appear at NAACL 2024 on TopicGPT and at NAACL Findings on grammar error explanation Feb. 2024: talk at UChicago / TTIC NLP seminar Jan. 2024: paper to appear at ICLR 2024 (oral) on book-length summarization Jan. 2024: papers to appear at EACL 2024 on using LLMs to reason over long documents and parameter-efficient LM adaptation Dec. 2023: talk at University of Tokyo Nov. 2023: our paper on stealing LLM decoding algorithms won a Distinguished Paper award at CCS 2023! Nov. 2023: launched litmt.org, a platform for sharing machine-translated world literature Nov. 2023: talk at MIT Embodied Intelligence seminar Nov. 2023: talk at UPenn CLunch Oct. 2023: papers to appear at EMNLP on evaluating retrieval-augmented generation and FActScore; at EMNLP-Findings on video game dialogue generation and LLM-based re-ranking; and WMT on LLMs for literary MT Oct. 2023: talk at UMD CLIP colloquium Sep. 2023: one paper to appear at NeurIPS 2023 on detecting AI-generated text Aug. 2023: spoke about AI and education on two local TV stations (Western Mass News, WWLP) Jul. 2023: keynote at Workshop on Retrieval-Enhanced Machine Learning (SIGIR 2023) May 2023: our paper on evaluating long-form summarization won an outstanding paper award at EACL 2023! May 2023: one paper to appear at ACL 2023 on expert human evaluation of long-form QA May 2023: talk at Workshop on Insights from Negative Results in NLP Apr. 2023: talk at NYU Text-as-Data series Feb. 2023: spoke about ChatGPT on three local TV stations (GBH, WWLP, and Western Mass News) Jan. 2023: papers to appear at EACL 2023 (better human evaluation of long-form summarization) and EACL-Findings (crowdsourcing coreference annotations) Dec. 2022: talk at IndoML 2022 Nov. 2022: honored to receive a Samsung AI Researcher of the Year award! Oct. 2022: six papers to appear at EMNLP 2022 on decoding with large ranking models, zero-shot cross-lingual summarization, retrieval-augmented LMs, document-level literary translation, and datasets for analyzing Chinese LMs and MT metrics Jul. 2022: teaching course on text generation at DeepLearn 2022 Summer School May 2022: talk at Baidu Research May 2022: preprints on decoding with large ranking models and zero-shot cross-lingual summarization Apr. 2022: papers to appear at NAACL 2022 on long-form QA and a long-range LM challenge dataset Apr. 2022: talk at UNC Chapel Hill Feb. 2022: paper to appear at ACL 2022 on retrieving literary evidence Oct. 2021: talk at Cornell AI seminar Aug. 2021: six papers to appear at EMNLP 2021 on language generation (evaluation, analysis, and models), few-shot learning, phrase embeddings, and latent tree induction Jun. 2021: co-advising the UMass Alexa Prize Taskbot team Jun. 2021: talk at Yandex Jun. 2021: talk at Cambridge NLP seminar May 2021: papers to appear at ACL 2021 (energy-based NMT) and ACL-Findings (modeling clinical notes) Mar. 2021: three papers to appear at NAACL 2021 (long-form QA, table embeddings, and simple neural LMs) Mar. 2021: got an NSF CAREER award to work on interactive storytelling! Feb. 2021: talk at Georgia Tech NLP seminar Sep. 2020: four papers to appear at EMNLP 2020 (task transferability, stylistic paraphrasing, interactive story generation, unsupervised parsing) Sep. 2020: talk at UMass CICS Computing and Social Justice series Sep. 2020: talk at UPenn CLunch Jul. 2020: co-organizing the Workshop on Narrative Understanding, Storylines, and Events at ACL 2020 Jun. 2020: talk at Data Science fwdays'20 May 2020: ACL 2020 paper on \"stupid\" attention mechanisms now available! Mar. 2020: talk at USC/ISI Boston office Jan. 2020: our work on characterizing racial bias in American football was covered in The Undefeated Jan. 2020: talk at CMU LTI Dec. 2020: paper on stealing BERT-based models to appear at ICLR 2020 Nov. 2019: talks at Google NYC, NYU Oct. 2019: talk at UMass Lowell Sep. 2019: talk at IBM QA and semantic parsing workshop Aug. 2019: two papers to appear at EMNLP 2019 (bias in sports commentary, unsupervised parsing) Jun. 2019: co-organizing the Workshop on Narrative Understanding at NAACL 2019; please consider attending! May 2019: three papers to appear at ACL 2019 (question generation, fast decoding, and paragraph embeddings) Feb. 2019: two papers to appear at NAACL 2019 (unsupervised parsing, computational literary criticism) Nov. 2018: talk at the University of Antwerp Nov. 2018: talk at WPI CS Colloquium Oct. 2018: talk at UVM Symposium on the Science of Stories Aug. 2018: three papers to appear at EMNLP 2018 (QuAC, (un)interpretability, and sentiment reproducibility) Jul. 2018: talk at TTIC Language Generation workshop Jun. 2018: ELMo won best long paper at NAACL 2018! Mar. 2018: talk at USC/ISI NL Seminar Feb. 2018: three papers to appear at NAACL 2018 (adversarial paraphrasing, ELMo, and image colorization) Feb. 2018: talk at Ursinus College on applications of machine learning to the digital humanities Jan. 2018: talk at Indian Institute of Science, Bengaluru Oct. 2017: submit your QA system to our human-computer QA competition at NIPS 2017! Apr. 2017: COMICS data and code released here! Jan. 2017: talk at CU Boulder Stats, Optimization, and Machine Learning seminar Nov. 2016: talk at UMass Machine Learning & Friends Lunch Nov. 2016: new paper on understanding comic book narratives and characters. Nov. 2016: new paper and associated dataset for sequential semantic parsing. Jun. 2016: our paper on characterizing fictional relationships won best long paper at NAACL 2016! Apr. 2016: we are organizing a workshop at NAACL 2016 on human-computer question answering with great invited speakers and accepted papers! May 2015: our quiz bowl robot recently faced off against a team of four Jeopardy champions. Watch the introduction to learn how it works and then check out the actual match! If you're interested, code for the entire system is also available. GROUP Yapei Chang Yekyung Kim Chau Pham Rishanth Rajendhran Jenna Russell Katherine Thai Shufan Wang Former PhDs / Postdocs: Marzena Karpinska (Postdoc 2021-2024, now Senior Researcher at Microsoft) Tu Vu (PhD 2023, now Asst. Prof @ Virginia Tech & Research Scientist @ Google DeepMind) Kalpesh Krishna (PhD 2023, now Research Scientist @ Google DeepMind) Simeng Sun (PhD 2024, now Research Scientist @ Nvidia) Andrew Drozdov (PhD 2024, co-advised w/ Andrew McCallum, now Research Scientist @ Databricks) Nader Akoury (PhD 2024, now postdoc at Cornell) Yixiao Song (PhD 2025, co-advised w/ Rajesh Bhatt), now Research Scientist @ Google Also see my group's other awesome alumni! Jack Merullo (UMass undergrad, now PhD student at Brown) Weiqiu You (UMass MS, now PhD student at UPenn) Akshita Bhagia (UMass MS, now research engineer at AI2) Dhruvil Gala (UMass UG, now at Microsoft) Ahsaas Bajaj (UMass MS, now at Walmart Labs) Sangeetha Balasubramanian (UMass MS, now ML Engineer at Amazon) If you're a prospective PhD student, click here for more info. I plan to take one new PhD student every year. If you're interested in working with me, please apply to the UMD CS PhD program and list me as a potential advisor. Feel free to send me an email after applying; I may not respond, but I'll still probably see it. If you're a current undergraduate or MS student at UMD interested in research, click here. I'm happy to work on research projects with current UMD undergraduates / MS students, especially those with experience in NLP and/or ML. Please send me an email or stop by my office hours if you're interested! TEACHING Fall 2025: Natural language processing (CMSC 723) Spring 2025: Seminar on long-context LLMs (CMSC 848O) Fall 2024: NLP seminar (CS 692L) Spring 2024: Advanced Natural Language Processing (CS 685) Spring 2024: NLP seminar (CS 692L) Fall 2023: NLP seminar (CS 692L) Spring 2023: Advanced Natural Language Processing (CS 685) Spring 2022: Advanced Natural Language Processing (CS 685) Fall",
  "content_length": 58297,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:36"
}