{
  "name": "Mohit Bansal",
  "homepage": "https://www.cs.unc.edu/~mbansal",
  "status": "success",
  "content": "Mohit Bansal CV / Bio Experience Awards Publications/Code Teaching/Talks Students/Postdocs Service Colloquia MURGe-Lab UNC-AI Group Mohit Bansal Parker Distinguished Professor Director, MURGe-Lab (UNC-AI Group) PECASE Fellow, AAAI Fellow Lead (Core AI), ENGAGE NSF-AI Institute Computer Science Dept., UNC Chapel Hill FB250, 201 S Columbia St, Chapel Hill mbansal -atsign- cs . unc . edu Google Scholar, LinkedIn, Twitter Follow @mohitban47 Recent Invited Talks/Keynotes: (04/26)    Distinguished Speaker Series, University of Virginia (03/26)    Distinguished Lecture (university-wide), Georgetown University (12/25)    India Keynotes: ACM CODS 2025; CVIP 2025 (11/25)    Keynote, ICDM 2025 Workshop on Reasoning, Agents, Retrieval, and Attribution [New:'Multimodal Retrieval                for Understanding and Generation across Diverse Sources'] (11/25)    Keynote, EMNLP 2025 5th New Frontiers in Summarization Workshop [New: 'Attributable, Conflict-Robust, Multimodal Summarization with Multi-Source Retrieval'] (10/25)    Keynote, ICCV 2025 4th Workshop on What is Next in Multimodal Foundation Models ['Multimodal Generative Models: Unification and Composable Generalization'] (10/25)    Keynote, 28th European Conference on Artificial Intelligence (ECAI), 2025              [all talks/details here] (09/25)    Distinguished Lecture Series, Virginia Tech (09/25)    Invited Speaker, Athens NLP Summer School (AthNLP), 2025 (06/25)    Keynote, CVPR 2025 Workshop on Video LLMs [New: 'Generative Multimodal Models: Planning Agents,                Skill Learning, and Compositional Generalization'] (04/25)    Singapore Keynotes: LM Safety Workshop; Singapore NLP Symposium (SSNLP); Open Multimodal Workshop (04/25)    Distinguished Lecture Series, MSU (04/25)    Keynote, Midwest Speech and Language Days (MSLD) 2025 (04/25)    Distinguished Lecture Series, GMU (03/25)    Keynote, NLP@Michigan Day, 2025 [New: 'Trustworthy Planning Agents for Collaborative Reasoning and                Multimodal Generation'] (12/24)    Distinguished Lecture Series, StonyBrook (12/24)    Distinguished Speaker Series, USF (11/24)    Keynote, Amazon Research Days (08/24)    Keynote, TTIC Multimodal AI Workshop (07/24)    Keynote, Lisbon Machine Learning Summer School (LxMLS) 2024 (06/24)    Keynote, 12th International Advanced Summer School on NLP (IASNLP-2024) (06/24)    Keynote, Pinterest Labs ML Symposium 2024 (04/24)    Distinguished Lecture Series, USC (04/24)    Keynote, SouthNLP Symposium 2024 (12/23)    Keynote, CoNLL 2023 [video] (11/23)    Keynote, AACL-IJCNLP 2023 (11/23)    Invited Speaker, TTIC 20th Anniversary Celebration (07/23)    TWIML AI Podcast (12/22)    Invited Speaker, MBZUAI Inaugural NLP Symposium (10/22)    UT Austin Forum for AI; Stanford NLP Seminar (07/22)    Keynote, INLG 2022                                                                                        (more talks/details here) News: (10/25)    Congrats to Vaidehi Patil for the Google PhD Fellowship! (08/25)    14 new publications in NeurIPS, EMNLP, TMLR, TACL on bridging MMLM+diffusion models, multi-armed bandit reward selection, 4D space-time reconstruction, reward-driven video understanding, coarse-to-fine reasoning refinement, RL and TTS for video reasoning, loophole exploitation in LLMs, editing videos via auto-generated narratives, global+local instruction-driven expert router, general multimodal reasoning with dynamic multi-Expert aggregation, skill-based CoT for domain-adaptive video reasoning, math reasoning via fine-grained data synthesis analysis, localizing factual inconsistencies, and reliable+responsible foundation models. (06/25)    Congrats for job placements to postdocs/PhD students: Elias Stengel-Eskin: UT Austin CS faculty; Jaehong Yoon: NTU Singapore faculty; Jaemin Cho: JHU CS faculty; Jialu Li: Adobe Research Scientist; Yi-Lin Sung: Meta Research Scientist; Prateek Yadav: Meta Research Scientist. (06/25)    Congrats to Zaid Khan for the NDSEG PhD Fellowship! (06/25)    17 new publications in COLM, ICCV, ACL, ICML, CVPR, TMLR, TACL on unit test generation, RAG conflict, task-circuit quantization, attribution generation programs, fine-grained summarization evaluation, occlusion understanding in VLMs, instructional video editing/reasoning, state-adaptive MoE-based VL-navigation, model merging at scale, multi-attribute steering of LLMs, localized attribution in content-grounded generation, self-consistency preference optimization, tree-based representation for long video reasoning, motion-grounded video reasoning, factual diverse generation via asymptotic entropy, model MoErging, and compression for communicating parameter-efficient updates. (03/25)    Congrats to Archiki Prasad for the Apple AI/ML PhD Fellowship! (01/25)    11 new publications in ICLR 2025 (incl. a top-1.8% 'oral' and top-5% 'spotlight') on data generation environments/agents/policies, adapting diverse controls to diffusion models, balancing fast and slow planning, multimodal compositional+modular video reasoning, lifelong multimodal instruction tuning via dynamic data selection, safe T2I/T2V generation, generative infinite games, procedural+predictive video representation learning, bootstrapping language-guided navigation learning, automated preference data synthesis, and diagnosing cultural bias of VLMs. (01/25)    5 new publications in NAACL 2025 on balancing agents' persuasion resistance+acceptance, adaptive decoding to balance contextual+parametric knowledge conflicts, reverse thinking for stronger LLM reasoning, positional bias of faithfulness for long-form summarization, and improving generation faithfulness via multi-agent collaboration. (01/25)    Honored and humbled to be selected as a AAAI Fellow -- all the credit belongs to my amazing past and current students+postdocs+collaborators! (01/25)    Honored and humbled to receive the Presidential Early Career Award for Scientists and Engineers (PECASE) Award by the US White House and President (was nominated in 2019, and awarded ARO-ECASE funding in 2021 as a `bridge program' due to White House PECASE announcement delays). (11/24)    Congrats to David Wan for the Google PhD Fellowship! (11/24)    7 new publications in NeurIPS 2024 and TMLR on agent confidence calibration via speaker-listener pragmatics, merging skill-specific text-to-image experts, game-theoretic LLM evaluation, model editing and rational belief revision, unlearning in multimodal LLMs, vision-language-navigation survey, and efficient multimodal generation. (07/24)    4 new publications in COLM 2024 and ECCV 2024 on adaptive/dynamic environment generation, long multi-scene consistent and fine-grained layout control for video generation, diagram generation via LLM planning, and contrastive region guidance for VLM grounding. (06/24)    Congrats for job placements to PhD students: Peter Hase: Anthropic Residency; Yichen Jiang: Apple AI/ML Research Scientist; Adyasha Maharana: Databricks/Mosaic Research Scientist; Swarnadeep Saha: FAIR-Meta Research Scientist. (05/24)    12 new publications in ICML 2024 and ACL 2024 on multi-agent reasoning collaboration, inducing systematicity in transformers, easy-to=hard generalization, very long conversational memory of LLM agents, soft self-consistency, fine-grained hallucination evaluation, structured distillation of multi-agent reasoning interaction graphs, refactoring programs to discover abstractions, etc. (04/24)    Congrats to Jaemin Cho for the Bloomberg PhD Fellowship! (04/24)    Program Co-chairing for EMNLP 2024. We welcome everyone to submit their papers. Looking forward to welcoming you in Miami Nov12-16! (03/24)    11 new publications in CVPR 2024 (incl. a 'spotlight') and NAACL 2024 and TMLR 2024 and EACL 2024 on interleaved+interactive any-to-any generation, alternating unimodal adaptation, interactive image segmentation, branch-solve-merge for LLM eval+generation, as-needed decomposition and planning with LLM agents, aspect-controlled referring expression generation, model merging by task subspace matching, low-cost algorithmic recourse, unified embeddings for multimodal retrieval, and hierarchical+dynamic prompt compression. (01/24)    7 new publications (incl. 2 'spotlights') in ICLR 2024 on attack vs. defense for sensitive information deletion in LLMs, Davidsonian Semantics Scene Graphs for reliable T2I evaluation, data pruning with balanced diversity and difficulty, rephrase-based visual question grounding for VLMs, efficient sparse mixture-of-experts, efficient coarse-to-fine pruning for VLMs, analyzing and mitigating hallucinations in VLMs. (10/23)    Honored and humbled to receive the IIT Kanpur Young Alumnus Award. (10/23)    6 new publications in EMNLP 2023 on reasoning chain/chain-of-thoughts evaluation, context dependency in language generation, data factors for compositional generalization, summary generation with controllable readability levels, multimodal model merging, and causal debiasing of multimodal models. (09/23)    9 new publications (including 2 'spotlights') in NeurIPS 2023 on visual programming for interpretable+explainable text-to-image generation and evaluation, any-to-any multimodal generation, LLMs teaching student models, panorama generation for VLN generalization, model merging with interference, localization informing model editing, self-chained videoQA and localization, action knowledge in video-language LLMs, adaptive contextual perception. (07/23)    3 new publications (including 1 'oral') in ICCV 2023 on text-to-image skill+bias evaluation, scaling VLN, and unified coarse-to-fine alignment for video-text retrieval. (06/23)    Postdocs Elias Stengel-Eskin and Jaehong Yoon joining us! (05/23)    11 new papers in ACL 2023 and IJCAI 2023 and *SEM 2023 on faithful extractive summarization, meeting QA, single-frame bias in VidL, mixed fwd/rev cross-entropy, multimodal graph script induction, continual learning for code generation, exclusive supermasks for CL, modular multi-step r",
  "content_length": 114653,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:34"
}