{
  "name": "Mohsen Ansari",
  "homepage": "https://sharif.edu/~ansari",
  "status": "success",
  "content": "Ansari's Homepage Mohsen Ansari, Ph.D. Assistant Professor Director of Cyber-Physical Systems Labratory (CPSLab) Sharif University of Technology, Tehran, Iran. Office: 624 (CE Building) Email: ansari [at] sharif.edu Tel: +9821 6616 6635 Fax: +9821 6616 9256 Short CV Education Positions Awards Grants Laboratory Professional Services Courses Mohsen Ansari is currently an assistant professor of computer engineering at Sharif University of Technology, Tehran, Iran. He received his Ph.D. degree in computer engineering from Sharif University of Technology, Tehran, Iran, in 2021. He was a visiting researcher in the Chair for Embedded Systems (CES), Karlsruhe Institute of Technology (KIT), Germany, from 2019 to 2021. He is currently the director of Cyber-Physical Systems Laboratory (CPSLab) at Sharif University of Technology. He was the technical program committee (TPC) member of ASP-DAC (2022 and 2023). Dr. Ansari is serving as an associate editor of the IEEE Internet of Things Journal and the IEEE Embedded Systems Letter (ESL). His research interests include embedded machine learning, internet of things AI, edge AI, edge-fog-cloud Computing, low-power design, real-time systems, cyber-physical systems, and hybrid systems design. Research Interests Cyber-Physical Systems Design Embedded Machine Learning Edge, Fog, and Cloud Computing Edge AI and IoT AI Machine Learning for CPSs and Sensor Information Processing Thermal and Low Power Design of CPSs Energy-Efficient, Fault-Tolerant, and Secure Computing Page at: Google Scholar, ResearchGate, Linkedin, Scopus Education Ph.D. in Computer Engineering, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran, Sep. 2016- Sep. 2021. M.Sc. in Computer Engineering, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran, Sep. 2014- Aug. 2016. B.Sc. in Computer Engineering, Department of Engineering, Shahed University, Tehran, Iran, Sep. 2010- Aug. 2014. Assistant Professor, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran, Apr. 2022- Present. Member of the board, Cyber-Physical Systems Society of Iran, Dec. 2021- Present. Postdoctoral Fellow, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran, Sep. 2021-Apr. 2022. Visiting Researcher, The Chair for Embedded Systems, Karlsruhe Institute of Technology, Karlsruhe, Germany, Oct. 2019- Apr. 2021. Group Leader, Embedded Systems Research Laboratory (ESR-LAB), Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran, Sep. 2016- Apr. 2022. Awards Recieved the Dr. Kazemi Ashtiani award from national elites fundation of Iran, 2024. Recieved the outstanding young researcher award from Sharif University of Technology, 2023. Recieved the Dr. Shahriari award (Faculty position) from national elites fundation of Iran, 2022. Recieved the Dr. Chamran award (Postdoctoral position) from national elites fundation of Iran, 2021. Elected as a national talent, 2016-2022. Elected as the premier teacher assistant at Sharif University of Technology, 2017. Ranked 3rd out of 1000 graduated students at Sharif University of Technology, 2016. Ranked 2nd among 42 graduated students in computer architecture, Department of Computer Science and Engineering, Sharif University of Technology, 2016. Admitted as an Exceptional Talent at Sharif University of Technology for M.Sc programs, 2014. Ranked 1st out of 160 graduated students in department of engineering at Shahed University, 2014. Grants AI grant, Sharif University of Technology, 2025-Present. The program of problem-orinted cores, grant, national elites fundation of Iran, 2025-Present. Internet of Things grant, Sharif University of Technology, 2024-2025. Kazemi-Ashtiani grant, national elites fundation of Iran, 2023-Present. Professional Services Editorial Board (Associate Editor): IEEE Internet of Things Journal, 2025-Present. IEEE Embedded Systems Letters, 2024-Present. Scientia Iranica, 2025-Present. Conference Technical Program Committee Member: The 2025 International Conference on Computer-Aided Design (ICCAD-2025), TPC. The 29th International Computer Conference, Computer Society of Iran (CSICC 2025), TPC and Web Chair. The 5th CPSSI International Symposium on Cyber-Physical Systems (Application and Theory) (CPSAT 2024), TPC and Industrial Relation Chair. Asia and South Pacific Design Automation Conference (ASP-DAC 2024), TPC. Asia and South Pacific Design Automation Conference (ASP-DAC 2023), TPC. The 28th International Computer Conference, Computer Society of Iran (CSICC 2023), TPC and Publication Chair. Asia and South Pacific Design Automation Conference (ASP-DAC 2022), TPC. Reviewer: IEEE Transactions on Parallel and Distributed Systems (TPDS). IEEE Transactions on Mobile Computing (TMC). IEEE Transactions on Computers (TC). IEEE Transactions on Circuits and Systems I: Regular (TCAS-I). IEEE Transactions on Consumer Electronics (TCE). IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD). IEEE Transactions on Very Large Scale Integration (VLSI) Systems (TVLSI). IEEE Transactions on Sustainable Computing (TSUSC). IEEE Internet of Things Journal (IoTJ). IEEE Access. IEEE Embedded Systems Letter. IEEE Open Journal of the Computer Society. Plos One, PLOS. ACM Transactions on Design Automation of Electronic Systems (TODAES). ACM Transactions on Embedded Computing Systems (TECS). ACM Transactions on Sensor Networks (TSN). Vehicular Communications, Elsevier. Reliability Engineering and System Safety (RESS), Elsevier. Microprocessors and Microsystems (MICPRO), Elsevier. Journal of Systems Architecture (JSA), Elsevier. The Journal of Supercomputing, Springer. IETE Journal of Research. Scientia Iranica - Journal - Elsevier. Journal of Circuits, Systems, and Computers (JCSC). Graduate: Cyber-Physical Systems (CPS), Sharif University of Technology, Department of Computer Science and Engineering, Fall 2022, Fall 2023, and Fall 2024. Edge Computing, Sharif University of Technology, Department of Computer Science and Engineering, Spring 2025. System on Chip (SoC), Sharif University of Technology, Department of Computer Science and Engineering, Spring 2023 and Spring 2024. Undergraduate: Embedded Systems (Undergraduate), Sharif University of Technology, Department of Computer Science and Engineering, Fall 2021, Spring and Fall 2022, Spring 2023, Fall 2023, Spring 2024, Fall 2024, and Spring 2025. Real-Time Computing (Undergraduate), Sharif University of Technology, Department of Computer Science and Engineering, Spring 2022. Numerical Methods (Undergraduate), Sharif University of Technology, Department of Computer Science and Engineering, Groups 1 & 2, Fall 2018. Numerical Methods (Undergraduate), Sharif University of Technology, Department of Computer Science and Engineering, Fall 2017. Digital Design (Logic Design) (Undergraduate), Sharif University of Technology, International Campus-Tehran, Fall 2017.",
  "content_length": 7058,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:33"
}