{
  "name": "Mohsen Jozani",
  "homepage": "https://www.augusta.edu/ccs/faculty.php",
  "status": "success",
  "content": "SCCS Faculty Skip to main contentBack to Top Computer & Cyber Sciences Augusta University Computer & Cyber Sciences Faculty Our Faculty Meet the brilliant minds shaping the future of technology at Augusta University's School of Computer and Cyber Sciences. Our faculty comprises accomplished researchers, seasoned industry professionals, and dedicated educators committed to providing you with an unparalleled learning experience. Their expertise spans a wide range of disciplines, from cutting-edge cybersecurity and artificial intelligence to advanced software development and data science, ensuring you receive instruction from leaders in their respective fields. Explore their profiles to discover the depth of their knowledge and the passion they bring to empowering the next generation of tech innovators. Dean's Office Faculty Part-Time Faculty Departments Computer Science Dr. Konstantin Busch, Chair Information Systems and Security Dr. Mark Harris, Chair Cyber Systems Engineering Dr. Alex Schwarzmann, Chair Dean's Office Alexander Schwarzmann, PhD Dean Professor Email Dr. Schwarzmann Gursimran Walia, PhD Associate Dean of Academic Affairs Director of Graduate Studies Email Dr. Walia Denise Coleman Cyber Academic Program Coordinator 706-721-1042 Email Mrs. Coleman Brandon Mercer Systems Administrator Regina White Director of Business Operations Email Mrs. White Mandy Brown Business Operations Specialist 706-729-2370 Email Mrs. Brown Karly Henson Office Specialist Email Ms. Henson Computer Science Abdullah Al-Mamun, PhD Assistant Professor Email Dr. Al-Mamun Google Scholar Website Paul Attie, PhD Professor Email Dr. Attie Google Scholar Clement Aubert, PhD Associate Professor Email Dr. Aubert Google Scholar DBLP Website Yuyan Bao, PhD Assistant Professor Email Dr. Bao Google Scholar Website Waylon Brunette, PhD Assistant Professor Email Dr. Brunette Google Scholar Konstantin Busch, PhD Professor Chair of Computer Science Email Dr. Busch Google Scholar Bogdan Chlebus, PhD Professor Email Dr. Chlebus Google Scholar Richard DeFrancisco, PhD Assistant Professor Email Dr. DeFrancisco Google Scholar Gokila Dorai, PhD Assistant Professor Director for Access, Success and Belonging Email Dr. Dorai Google Scholar Website Michael Dowell, PhD Associate Professor Email Dr. Dowell Google Scholar Harley Eades, PhD Associate Professor Email Dr. Eades Google Scholar DBLP Website Onyeka Ezenwoye, PhD Associate Professor Email Dr. Ezenwoye Google Scholar Shiwei Fang, PhD Assistant Professor Email Dr. Fang ‪ ‪Google Scholar‬ Website Jeronimo Grandi, PhD Assistant Professor Email Dr. Grandi Google Scholar Mohamed Ibrahem, PhD Assistant Professor Email Dr. Ibrahem Google Scholar Website Dariusz Kowalski, PhD Professor Email Dr. Kowalski Google Scholar Piotr Krysta, PhD Professor Email Dr. Krysta Website Google Scholar DBPL Hoda Maleki, PhD Assistant Professor Email Dr. Maleki Google Scholar Jason Orlosky, PhD Associate Professor Director of the Senior Design Program Email Dr. Orlosky Google Scholar Website Nisha Panwar, PhD Assistant Professor Email Dr. Panwar Website Dr. Meikang Qiu, PhD Professor Email Dr. Qiu Google Scholar Reza Rahaeimehr, PhD Assistant Professor Email Dr. Rahaeimehr DBLP Peter Robinson, PhD Associate Professor Email Dr. Robinson Google Scholar Ming Ming Tan, PhD Instructor Email Dr. Tan Google Scholar Edward Tremel, PhD Assistant Professor Email Dr. Tremel Google Scholar ORCID Website Gursimran Walia, PhD Professor Associate Dean of Academic Affairs Director of Graduate Studies Email Dr. Walia Website DBLP Zi Wang, PhD Assistant Professor Email Dr. Wang Website Google Scholar Weiming Xiang, PhD Associate Professor Email Dr. Xiang Google Scholar Website Shiwei Zeng, PhD Assistant Professor Email Dr. Zeng Website Wei Zhang, PhD Assistant Professor Email Dr. Zhang Google Scholar Shungeng Zhang, PhD Assistant Professor Email Dr. Zhang Google Scholar DBLP Jieqiong Zhao, PhD Assistant Professor Email Dr. Zhao Information Systems and Security Ahmed Aleroud, PhD Associate Professor Email Dr. Aleroud Google Scholar Mark Harris, PhD Associate Professor, Chair of Information Systems and Security Email Dr. Harris Google Scholar John Heslen, PhD Associate Professor Email Dr. Heslen Google Scholar Lin Li, PhD Assistant Professor Email Dr. Li Google Scholar Ron Martin, CISSP, PMP Assistant Professor Email Mr. Martin Jeff Morris, PhD, CISSP Assistant Professor Email Dr. Morris Google Scholar Jonathan Sloan Adjunct Instructor Email Mr. Sloan James N. Smith, DBA, CISSP Assistant Professor Email Dr. Smith Google Scholar Jason Williams, PhD, PMP Assistant Professor Email Dr. Williams Google Scholar Paul York, PhD Assistant Professor Email Dr. York Google Scholar Jieqiong Zhao, PhD Assistant Professor Email Dr. Zhao Gianluca Zanella, PhD Assistant Professor Email Dr. Zanella Google Scholar Cyber Systems Engineering Waylon Brunette, PhD Assistant Professor Email Dr. Brunette Google Scholar Hisham Daoud, PhD Assistant Professor Email Dr. Daoud Google Scholar Website Mohamed Ibrahem, PhD Assistant Professor Email Dr. Ibrahem Google Scholar Website Hoda Maleki, PhD Assistant Professor Email Dr. Maleki Google Scholar Jeff Morris, PhD, CISSP Assistant Professor Email Dr. Morris Google Scholar Weiming Xiang, PhD Associate Professor Email Dr. Xiang Google Scholar Website Wei Zhang, PhD Assistant Professor Email Dr. Zhang Google Scholar Cyber Institute Ahmed Aleroud, PhD Associate Professor Email Dr. Aleroud Google Scholar John Heslen, PhD Associate Professor Email Dr. Heslen Google Scholar Jeff Morris, PhD, CISSP Assistant Professor Email Dr. Morris Google Scholar Michael Nowatkowski, PhD, CISSP Professor Head of the Cyber Programs of Study Cyber Institute Director Email Dr. Nowatkowski Google Scholar James N. Smith, DBA, CISSP Assistant Professor Email Dr. Smith Google Scholar Gursimran Walia, PhD Professor Associate Dean of Academic Affairs Director of Graduate Studies Email Dr. Walia Website DBLP Part-Time Faculty George Bell, CISSP, GCFE, GSNA James Beneke, CISSP, GCFA, GCIA Brian Bohlman Jacob Cox James Cunningham Charles Flack, DBA-IS, MSEE Ken Groombridge, CISSP, CSIM, PMP Misty Lawrence Matthew Sherburne Cory Singleton Richard Spencer Ian Thomas Anthony Lawrence Steve Weldon ©",
  "content_length": 6268,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:34"
}