{
  "name": "Mokhtar Aboelaze",
  "homepage": "http://www.cs.yorku.ca/~aboelaze",
  "status": "success",
  "content": "Mokhtar Aboelaze Mokhtar Aboelaze Associate ProfessorMokhtar AboelazeDepartment of Electrical Engineering and Computer Science Lassonde Building, room 2026Phone: (416) 736-2100 ext. 40607Fax:   (416) 736-5872my_last_name_at_cse_dot_yorku_dot_ca Education B.Sc. Electrical Engineering Cairo University 1978 M.Sc. Electrical and Computer Engineering University of South Carolina 1982 Ph.D. Electrical and Computer Engineering Purdue university 1988 Research Interests My research interests are in the fields of computer networks, mobile networks, computer architecture, special purpose architecture for image processing.. Prospective students I am retired now. No applications for geaduate supervision please Publications Courses I am usually teaching (if it is not active, I am not teaching it this term) COSC 3201 Digital Logic Design COSC 3213 Computer Networks COSC 4201 Computer Architecture crosslisted with COSC5501 Computer Architecture (graduate course) ECE 460     Computer Networks for University of Toronto students COSC4213 Computer Networks II COSC6590   High-Performance Computer Networks COSC 5590 Special topics in Hardware Systems (advanced Computer Architecture) Some Interesting Architecture and Networks Sites ISDN site ATM Forum RFC Index Search Form ISO ANSI WWW Computer Architecture Home Page Parallel computation Archive Want to search for technical reports from cs departments and government research laboratories, follow this link SEARCH Trimaran: An infrastructure for Instruction Level Parallelism Students (grad and undergrad) here is an excellent article about how to read a book, it was written by Paul N. Edwards, The school of information, University of Michigan Here are some sites for starting graduate students How to write a good system paper Graduate student survivor guide How to give a good talk Mark Hil and David Patterson Misc The Museum of Unworkable Devices History of the Tacoma Narrows Bridge The Dead Grandmother/Exam Syndrome and the Potential Downfall of American Society (testing may be dangerous to students' grandparents health). An article by Mike Adams: Biology Department, Eastern Con. State University. What time is it now ? (eastern time zone) Sports Boilermakers at CNN   Basketball Football Manchester United Real Madrid ZAMALEK page on Wikipedia My favorite soccer team in Egypt. my_last_name_at_cse_dot_yorku_dot_ca",
  "content_length": 2377,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:37"
}