{
  "name": "Molei Tao",
  "homepage": "https://mtao8.math.gatech.edu/index.html",
  "status": "success",
  "content": "Molei Tao welcome home bio publication group teaching service c.v. (2023) blog Molei Tao (full) Professor, Richard Duke Fellow School of Mathematics Georgia Institute of Technology (sorry I don't use LinkedIn, but I use X (Twitter)) Follow @MoleiTaoMath Office: Skiles 214A Address: 686 Cherry St NW, Atlanta GA 30332, USA Phone: +1-404-894-3711 mtao at gatech dot edu some other affiliations: GT Machine Learning Center Algorithms & Randomness Center (ARC) Algorithms, Combinatorics & Optimization (ACO) Program GT Decision & Control Lab Tech AI (Internal Technical Advisory Board) GT AI4Science Center (Associate Director) What do I do? As an applied & computational mathematician, I'm interested in the theoretical and algorithmic foundation of machine learning. This includes probabilistic ML, including sampling, measure transport, and (diffusion) generative modeling deep learning theory, optimization, and geometric methods in ML; I advocate an emerging direction we call ‘dynamical systems for machine learning’ AI4Sciences (astronomy, quantum sciences, bioengineering, scientific computing, mechanical engineering, material sciences, chemistry, …) A subset of what I'm thankful for. (sorry if I forget to update!) Sep 2025: Congrats to Kijung, Yuchen, Wei, Jaemoo, Avrajit, Lianghe, Yinuo and Haoxuan. 6 x NeurIPS’25 well deserved. Sep 2025: Honored and grateful to have received Richard Duke Fellowship, and generous supports from 2 x DOE + 1 x NSF. Aug 2025: GT AI4Science Center launched. Delighted to serve as an Associate Director. Jul 2025: Our NeurIPS 2025 DynaFront (Dynamics at the Frontiers of Optimization, Sampling, and Games) Workshop was accepted. If you care about dynamical aspects and foundations of machine learning, please consider submitting and/or attending! Mar 2025: Congrats to Yuqing - Sigma Xi Award for Best Ph.D. Thesis in Georgia Tech (2024)! Mar 2025: Congrats to Ye - multiple tenure track offers! Proud of you, and best wishes to your future endeavor! Mar 2025: Full prof. Jan 2025: Congrats to Yuchen, Wei, and Kevin. 3 x ICLR’25 + 1 x AISTATS’25 well deserved. Oct 2024: Congrats to Wei for winning a Best Poster Award at international conference “Recent Advances and Future Directions for Sampling” held at Yale! Sep 2024: Congrats to Yuqing, Ye, Lingkai, and Zhenghao. 4 x NeurIPS’24 led by us are not too shabby as theorists. Summer 2024: Congrats to Dr. Yuqing Wang - Ph.D. in Math! Proud of you, and best wish to your next journey as a prestigious Research Fellow at the Simon's Institute at UC Berkeley! Summer 2024: Very grateful to have received SONY Faculty Innovation Award. â¦(prehistory by ML timescale) Interested in joining our group? 2 PhD student positions and 1 postdoc position are available. The currently planned areas are AI4Science (especially AI for quantum), deep learning theory and optimization, but exceptional candidates in other areas can also be considered. Due to the large volume of inquiries, I may not be able to reply, but I will read emails carefully. If applying to PhD, please apply to one of the following Ph.D. programs: Math, CSE, Machine Learning, ACO; choose Math as the home unit, and include my name as one of your interested faculty members. Thank you for your interest.",
  "content_length": 3260,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:37"
}