{
  "name": "Monica S. Lam",
  "homepage": "https://suif.stanford.edu/~lam",
  "status": "success",
  "content": "Monica Lam Monica S. Lam Kleiner Perkins, Mayfield, Sequoia Capital Professor of the School of Engineering Computer Science Department Electrical Engineering Department (by courtesy) Stanford University Faculty Director Open Virtual Assistant Lab (OVAL) Gates Building, Room 368 353 Jane Stanford Way Stanford University CA 94305 (Directions) Phone: (650) 725-3714 Fax: (650) 725-6949 E-mail: lam at cs.stanford.edu Twitter: MonicaSLam Administration Assistant: Angelica Teaupa Gates Building, Room 372 (650) 724-5040 avteaupa at stanford.edu Biography Monica Lam is a Professor in the Computer Science Department at Stanford University since 1988. She is the faculty director of the Open Virtual Assistant Lab (OVAL). She received a B.Sc. from University of British Columbia in 1980 and a Ph.D. in Computer Science from Carnegie Mellon University in 1987. Monica is a Member of the National Academy of Engineering and an ACM Fellow. She is a co-author of the popular text Compilers, Principles, Techniques, and Tools (2nd Edition), also known as the Dragon book. Professor Lam's current research is on creating trustworthy and effective virtual assistants based on Large Language Models (LLMs). She is also an expert in compilers for high-performance machines. Her pioneering work of affine partitioning provides a unifying theory to the field of loop transformations for parallelism and locality. Her software pipelining algorithm is used in commercial systems for instruction level parallelism. Her research team created the first, widely adopted research compiler, SUIF. Her contributions in computer architecture include the CMU Warp Systolic Array and the Stanford DASH Distributed Memory Multiprocessor. She was on the founding team of Tensilica, now a part of Cadence. She received an NSF Young Investigator award in 1992. She was the author of two of the papers in \"20 Years of PLDI--a Selection (1979-1999)\", and one paper in the \"25 Years of the International Symposia on Computer Architecture\". She received the ACM Most Influential Programming Language Design and Implementation Paper Award in 2001, an ACM SIGSOFT Distinguished Paper Award in 2002, the ACM Programming Language Design and Implementation Best Paper Award in 2004, the ACM SIGARCH/SIGPLAN/SIGOPS ASPLOS Influential Paper Awards in two consecutive years, 2021 and 2022. Professor Lam received the University of British Columbia Computer Science 50th Anniversary Research Award in 2018. Her decentralized, privacy-preserving Almond virtual assistant received Popular Science's Best of What's New Award in Security in 2019. Her research on eliminating Large Language Model hallucination, by grounding in Wikipedia, received a Wikimedia Foundation's Research of the Year Award in 2024. Recent Presentations and Interviews Importance of voice technology to the humanitarian community Interviewed by Mark Dalton in Humanitarian AI Today, July 2021 Genie: An Open Privacy Preserving Virtual Assistant Keynote at the 48th International Symposium on Computer Architecture, June 2021. Stanford Almond Open Source Voice Assistant – Voicebot Podcast Ep 175 Interviewed by Bret Kinsella for Voicebot.AI, October 2020. \"Stanford Team Aims at Alexa and Siri With a Privacy-Minded Alternative\" Written by John Markoff for the New York Times, June 2019 \"Privacy in the Age of Virtual Assistants\" Video, The Future of Everything Podcast, Stanford School of Engineering, Stanford, June 4, 2019. (Top 5 of 100 Videos Award). \"Giving Control Back to Consumers with Open Federated Virtual Assistants\" Video, Keynote at the High Performance and Embedded Architecture and Compilation (HiPEAC) Conference, Valencia, Spain, January 2019. Almond: Keeping the Internet Open with An Open-Source Virtual Assistant (Video, Slides) Keynote at the 24th Annual International Conference on Mobile Computing and Networking (Mobicom), New Dehli, India, November, 2018. Research Interests Virtual Assistant. Machine learning. Natural language programming. Distributed mobile computing. Current Research The Open Virtual Assistant Lab Previous Research Projects Mobile and social computing, a part of the Programmable Open Mobile Internet (POMI) 2020 project. Improving Program Robustness via Static Analysis and Dynamic Instrumentation. The Collective: an Appliance-Based Computing Architecture. The SUIF Compiler System Current PhD Students Harshit Joshi George Liu Sina Semnani Sally Wang Jackie Yang Ph.D. Graduates Michael Wolf Michael Smith, Harvard Todd Mowry, CMU Martin Rinard, MIT Daniel Scales, Google Saman Amarasinghe,MIT Jennifer Anderson, Uber Robert Wilson, Apple Jason Nieh, Columbia University Shih-wei Liao, National Taiwan University Brian Schmidt, Google Patrick Sathyanathan Amy Lim, Cadence Brian Murphy, Amazon Jeffrey Oplinger, Oracle David Heine, Google Constantine Sapuntzakis, Pure Storage V. Benjamin Livshits, Imperial College London John Whaley, UnifyID Michael Martin, Roblox Christopher Unkel, DriveScale Sudheendra Hangal, Ashoka University Jiwon Seo, Hanyang University Michael Fischer Giovanni Campagna Silei Xu Mehrad Moradshahi Recent Papers SPAGHETTI: Open-Domain Question Answering from Heterogeneous Data Sources with Retrieval and Semantic Parsing Heidi C. Zhang, Sina J. Semnani, Farhad Ghassemi, Jialiang Xu, Shicheng Liu, Monica S. Lam In Findings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL), Bangkok, Thailand, August 11-16, 2024. Assisting in Writing Wikipedia-like Articles From Scratch with Large Language Models Yijia Shao, Yucheng Jiang, Theodore A. Kanell, Peter Xu, Omar Khattab, Monica S. Lam In Proceedings of the North American Chapter of Association for Computational Linguistics (NAACL), Mexico City, Mexico, June 16–21, 2024. SUQL: Conversational Search over Structured and Unstructured Data with Large Language Models Shicheng Liu, Jialiang Xu, Wesley Tjangnaka, Sina J. Semnani, Chen Jie Yu, Monica S. Lam In Findings of the North American Chapter of Association for Computational Linguistics (NAACL), Mexico City, Mexico, June 16–21, 2024. ReactGenie: A Development Framework for Rich Multimodal Interactions Using Large Language Models Jackie (Junrui) Yang, Yingtian Shi, Yuhan Zhang, Karina Li, Daniel Wan Rosli, Anisha Jain, Shuning Zhang, Tianshi Li, James A. Landay, Monica S. Lam In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '24), Honolulu, HI, USA, May 11–16, 2024. AMMA: Adaptive Multimodal Assistants Through Automated State Tracking and User Model-Directed Guidance Planning Jackie (Junrui) Yang, Leping Qiu, Emmanuel Corona-Moreno, Louisa Shi, Hung Bui, Monica S. Lam, James A. Landay In 2024 IEEE Conference Virtual Reality and 3D User Interfaces (VR), Orlando, FL, March 16-21, 2024. Fine-tuned LLMs Know More, Hallucinate Less with Few-Shot Sequence-to-Sequence Semantic Parsing over Wikidata Silei Xu*, Shicheng Liu*, Theo Culhane, Elizaveta Pertseva, Meng-Hsi Wu, Sina J. Semnani, Monica S. Lam In Proceedings of Association for Computational Linguistics: EMNLP 2023, Singapore, December 6-10, 2023. WikiChat: Stopping the Hallucination of Large Language Model Chatbots by Few-Shot Grounding on Wikipedia Sina J. Semnani, Violet Z. Yao*, Heidi C. Zhang*, Monica S. Lam In Findings of the Association for Computational Linguistics: EMNLP 2023, Singapore, December 6-10, 2023. X-RiSAWOZ: High-Quality End-to-End Multilingual Dialogue Datasets and Few-shot Agents Mehrad Moradshahi*, Tianhao Shen*, Kalika Bali, Monojit Choudhury, Gael de Chalendar, Anmol Goel, Sungkyun Kim, Prashant Kodali, Ponnurangam Kumaraguru, Nasredine Semmar, Sina Semnani, Jiwon Seo, Vivek Seshadri, Manish Shrivastava, Michael Sun, Aditya Yadavalli, Chaobin You, Deyi Xiong, Monica S. Lam In Findings of the Association for Computational Linguistics (ACL), Toronto, Canada, July 9-14, 2023. Zero and Few-Shot Localization of Task-Oriented Dialogue Agents with a Distilled Representation Mehrad Moradshahi, Sina Semnani, Monica S. Lam In Proceedings of the European Chapter of the Association for Computational Linguistics (EACL), Dubrovnik, Croatia, May 2-6 2023. Contextual Semantic Parsing for Multilingual Task-Oriented Dialogues Mehrad Moradshahi, Victoria C. Tsai, Giovanni Campagna, Monica S. Lam In Proceedings of the European Chapter of the Association for Computational Linguistics (EACL), Dubrovnik, Croatia, May 2023. HomeView: Automatically Building Smart Home Digital Twins With Augmented Reality Headsets Zhuoyue Lyu, Jackie (Junrui) Yang, Monica S. Lam, James A. Landay In Adjunct Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology, Bend, Oregon, October 2022. A Few-Shot Semantic Parser for Wizard-of-Oz Dialogues with the Precise ThingTalk Representation Giovanni Campagna, Sina J. Semnani, Ryan Kearns, Lucas Jun Koba Sato, Monica S. Lam In Findings of the Association for Computational Linguistic1s (ACL), Dublin, Ireland, July 2022. HybridTrak: Adding Full-Body Tracking to VR Using and Off-the-Shelf Webcam Jackie (Junrui) Yang, Tuochao Chen, Fang Qin, Monica S. Lam, James A. Landay In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems, New Orleans, LA, April 2022. DIY Assistant: A Multi-Modal End-User Programmable Virtual Assistant Michael H. Fischer, Giovanni Campagna, Euirim Choi, Monica S. Lam In Proceedings of the 42nd ACM SIGPLAN International Conference on Programming Language Design and Implementation (PLDI 2021),June 2021. Grounding Open-Domain Instructions to Automate Web Support Tasks Nancy Xu, Sam Masling, Michael Du, Giovanni Campagna, Larry Heck, James Landay, Monica S Lam In Proceedings of the 2021 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL-HLT 2021), June 2021. AutoQA: From Databases To Q&A Semantic Parsers With Only Synthetic Training Data Silei Xu, Sina J. Semnani, Giovanni Campagna, Monica S. Lam In Proceedings of the 2020 Conference on Empirical Methods i",
  "content_length": 22791,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:42"
}