{
  "name": "Monika Akbar",
  "homepage": "https://hb2504.utep.edu/Home/Profile?username=makbar",
  "status": "success",
  "content": "UTEP Faculty Profiles MinerAlert Skip to main content Search pages and people FACULTY PROFILES X Quick Links Library Parking & Maps UTEP News Events Student Affairs Business Affairs Employment Opportunities University Bookstore Technology Support Main Content UTEP Faculty Profiles UTEP Faculty Profiles Monika Akbar Associate Professor Computer Science Cyber-Share Office Building: Chemistry and Computer Science Building Office Room: 3.0422 Phone: (915) 747-5883 Email: makbar@utep.edu Expertise: See Research Profile in Expertise Connector Bio Education Scholarly and Creative Activity Grants Courses Course Evaluations Bio < No info available. > Education < Ph D in Computer Science and Applications, Virginia Tech (2013) MS in Computer Science, Montana State University-Bozeman (2008) > Publications < A Mixture of Experts in Forecasting Student Performance in Classroom Programming Activities ACM (2024), Moqsadur Rahman, Monika Akbar, Justice T. Walker, Mahmud Hossain. Temporal word embedding with predictive capability Knowledge and Information Systems 65 12 (2023), Ahnaf Farhan, Roberto Camacho Barranco, Monika Akbar, Mahmud Hossain. Toward Common Weakness Enumerations in Industrial Control Systems IEEE Security &amp; Privacy 21 4 (2023), David M. Nicol, Gregory Shannon, Monika Akbar, Matt Bishop, Michael Chaney, Matthew Luallen. Detecting Malware Activity Using Public Search Data IEEE (2022), Ismael Villanueva-Miranda, Monika Akbar. Human Mobility Driven Modeling of an Infectious Disease IEEE 96 (2022), Ismael Villanueva-Miranda, Mahmud Hossain, Monika Akbar. Effect of Peer Influence and Self-Reflection on Scaffolded Out-of-Class Activity Administered Using a Mobile Application Education Sciences (2022), Monika Akbar. La educación en Ciencias de la Computación como una oportunidad para avanzar en la pedagoǵıa bilingüe/translenguaje Ñemitỹrã (2022), Monika Akbar. The Sol y Agua RPP: A Bilingual and Culturally Responsive Approach to Introduce Computational Thinking in Middle School Proceedings of the 53rd ACM Technical Symposium on Computer Science Education V. 2 (2022), Monika Akbar. The Sol y Agua RPP: A bilingual and culturally responsive approach to introduce computational thinking in middle school 2022 Proceedings of the 53rd ACM Technical Symposium on Computer Science Education (2022), Monika Akbar, Katherine Mortimer. La educación en ciencias de la computación como una oportunidad para avanzar en la pedagogía bilngüe/translenguaje. Computer science as an opportunity to advance bilingual/translanguaging pedagogy Ñemityrâ: Revista Multilingüe de Lengua, Sociedad y Educación 4 1 (2022), Katherine Mortimer, Monika Akbar. Sol y Agua: Bilingual, culturally relevant CS curriculum 2021 STEM For All Video Showcase (2021), Katherine Mortimer, Monika Akbar. A mobile educational platform based on peer influence and instructional scaffolding for engaging students in out-of-class activities 2021 International Conference on Advanced Learning Technologies (ICALT) (2021), Monika Akbar. Demographic Data-driven Deprivation Index for Predicting Chronic Diseases 2021 IEEE International Conference on Big Data (Big Data) (2021), Monika Akbar. Diffusion-based Temporal Embeddings for Biomedical Entities The AAAI-21 Workshop on Scientific Document Understanding at the Thirty-Fifth AAAI Conference on Artificial Intelligence (AAAI-21), SDU@AAAI-21 (2021), Monika Akbar. Integrating Heterogeneous Data for a Multi-disease Outbreak Detection Framework 2021 IEEE International Conference on Big Data (Big Data) (2021), Monika Akbar. Public Health Units - Exploratory Analysis for Decision Support Springer International Publishing (2021), Tatiane Lautert, Nádia P. Kozievitch, Ismael Villanueva-Miranda, Monika Akbar. Repeatable Experimentation for Cybersecurity Moving Target Defense International Conference on Security and Privacy in Communication Systems (2021), Monika Akbar. Diffusion-based Temporal Embeddings for Biomedical Entities (in press), Ahnaf Farhan, Roberto Camacho Barranco, Mahmud Hossain, Monika Akbar. A vulnerability analysis and prediction framework Computers & Security (2020), Monika Akbar. A vulnerability analysis and prediction framework Computers & Security 92 (2020), Mark A. Williams, Roberto C. Barranco, Sheikh M. Naim, Sumi Dey, Mahmud Hossain, Monika Akbar. Keeping Students Occupied with the Course Contents After Leaving the Classroom Proceedings of the 2020 ACM Conference on Innovation and Technology in Computer Science Education (2020), Monika Akbar. Social Learning and Scaffolding to Improve Student's Self-efficacy and Engagement Proceedings of the 51st ACM Technical Symposium on Computer Science Education (2020), Monika Akbar. Presentations Working toward equitable teacher learning community in research for equitable student learning (2022), Volume Seattle, WA, Katherine Mortimer, Monika Akbar, Romelia Rodriguez. La educación en ciencias de la computación como una oportunidad para avanzar en la pedagogía bilingüe/translenguaje (Computer science education as an opportunity to advance bilingual/translanguaging pedagogy) (2021), Volume Asunción, Paraguay, Katherine Mortimer, Monika Akbar. > Grants < A Research-Practice Partnership (RPP) for Developing Computational Thinking through Linguistically and Culturally Relevant CS Curriculum in Middle School (09/01/2010 - 08/31/2021) - NSFCollaborative Research: Active Learning for Out-of-class Activities to Improve Student Success (09/15/2017 - 08/31/2020) - NSF > Current/Future Courses < Term Course Section Syllabus Fall 2025 CS 4342 - Database Systems 12745 Syllabus Fall 2025 CS 6399 - Dissertation 12552 Fall 2025 CS 6194 - Doctoral Research 14573 Fall 2025 CS 6294 - Doctoral Research 14699 Fall 2025 CS 6394 - Doctoral Research 15172 Fall 2025 CS 6694 - Doctoral Research 10669 Fall 2025 CS 5391 - Individual Studies 16730 Fall 2025 CS 5390 - Special Topic Computer Science 16291 Syllabus Fall 2025 AI 4390 - Special Topics in AI 17686 Syllabus Fall 2025 CS 4390 - Special Topics in Computer Sci 16290 Syllabus Fall 2025 RSRC 4033 - Undergraduate Research 18603 Past Courses Select Term: All Spring 2025 Fall 2024 Spring 2024 Fall 2023 Spring 2023 Fall 2022 Summer 2022 Spring 2022 Fall 2021 Spring 2021 Fall 2020 Spring 2020 Fall 2019 Spring 2019 Fall 2018 Spring 2018 Apply Term Course Section Syllabus Spring 2025 CS 6294 - Doctoral Research 23557 Spring 2025 CS 6394 - Doctoral Research 23237 Spring 2025 CS 6694 - Doctoral Research 22957 Spring 2025 CS 2401 - Elem. Data Struct./Algorithms 21023 Syllabus Spring 2025 CS 2401 - Elem. Data Struct./Algorithms 21829 Spring 2025 CS 2401 - Elem. Data Struct./Algorithms 23712 Spring 2025 CS 2401 - Elem. Data Struct./Algorithms 23714 Spring 2025 CS 2401 - Elem. Data Struct./Algorithms 24963 Spring 2025 CS 1290 - Special Topics in Computing 24029 Syllabus Fall 2024 CS 6294 - Doctoral Research 15397 Fall 2024 CS 6394 - Doctoral Research 16029 Fall 2024 CS 6694 - Doctoral Research 10743 Fall 2024 CS 2401 - Elem. Data Struct./Algorithms 11378 Syllabus Fall 2024 CS 2401 - Elem. Data Struct./Algorithms 12063 Syllabus Fall 2024 CS 2401 - Elem. Data Struct./Algorithms 13560 Syllabus Fall 2024 CS 2401 - Elem. Data Struct./Algorithms 13672 Syllabus Fall 2024 CS 2401 - Elem. Data Struct./Algorithms 15009 Syllabus Fall 2024 CS 5391 - Individual Studies 18245 Spring 2024 CS 6294 - Doctoral Research 24082 Spring 2024 CS 6394 - Doctoral Research 23683 Spring 2024 CS 6694 - Doctoral Research 23344 Spring 2024 CS 2401 - Elem. Data Struct./Algorithms 21122 Syllabus Spring 2024 CS 2401 - Elem. Data Struct./Algorithms 22039 Spring 2024 CS 2401 - Elem. Data Struct./Algorithms 24266 Spring 2024 CS 2401 - Elem. Data Struct./Algorithms 24268 Spring 2024 CS 2401 - Elem. Data Struct./Algorithms 25891 Spring 2024 CS 6391 - Individual Studies 21976 Spring 2024 CS 5399 - Master's Thesis 24587 Fall 2023 CS 6394 - Doctoral Research 17651 Fall 2023 CS 2401 - Elem. Data Struct./Algorithms 11632 Syllabus Fall 2023 CS 2401 - Elem. Data Struct./Algorithms 12442 Fall 2023 CS 2401 - Elem. Data Struct./Algorithms 14237 Fall 2023 CS 2401 - Elem. Data Struct./Algorithms 14441 Fall 2023 CS 2401 - Elem. Data Struct./Algorithms 16189 Fall 2023 CS 4364 - Topics in Data Science 15366 Syllabus Fall 2023 CS 5364 - Topics in Data Science 15367 Syllabus Spring 2023 CS 6399 - Dissertation 22152 Spring 2023 CS 2401 - Elem. Data Struct./Algorithms 21218 Syllabus Spring 2023 CS 2401 - Elem. Data Struct./Algorithms 22221 Syllabus Spring 2023 CS 2401 - Elem. Data Struct./Algorithms 24858 Syllabus Spring 2023 CS 2401 - Elem. Data Struct./Algorithms 24861 Syllabus Spring 2023 CS 2401 - Elem. Data Struct./Algorithms 27433 Syllabus Fall 2022 CS 6399 - Dissertation 16252 Fall 2022 CS 2401 - Elem. Data Struct./Algorithms 18415 Syllabus Fall 2022 CS 2401 - Elem. Data Struct./Algorithms 18418 Syllabus Fall 2022 CS 1301 - Intro to Computer Science 18414 Syllabus Fall 2022 CS 1101 - Intro to Computer Science Lab 18685 Syllabus Summer 2022 CS 6398 - Dissertation 33919 Spring 2022 CS 6294 - Doctoral Research 26649 Spring 2022 CS 6694 - Doctoral Research 25261 Spring 2022 CS 1301 - Intro to Computer Science 24770 Spring 2022 CS 1301 - Intro to Computer Science 28045 Spring 2022 CS 1101 - Intro to Computer Science Lab 24775 Spring 2022 CS 1101 - Intro to Computer Science Lab 28046 Fall 2021 CS 6394 - Doctoral Research 16254 Fall 2021 CS 6694 - Doctoral Research 16237 Fall 2021 CS 1301 - Intro to Computer Science 15618 Fall 2021 CS 1101 - Intro to Computer Science Lab 16369 Fall 2021 CS 4364 - Topics in Data Science 18071 Fall 2021 CS 5364 - Topics in Data Science 18072 Fall 2021 RSRC 4033 - Undergraduate Research 14898 Spring 2021 CS 4342 - Data Base Management 27262 Spring 2021 CS 5342 - Database Management 28342 Spring 2021 CS 6394 - Doctoral Research 26616 Spring 2021 CS 6694 - Doctoral Research 25832 Spring 2021 CS 1301 - Intro to Computer Science 27247 Syllabus Spring 2021 CS 1101 - Intro to Computer Science",
  "content_length": 32069,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:45"
}