{
  "name": "Monica T. Whitty",
  "homepage": "https://research.monash.edu/en/persons/monica-whitty",
  "status": "success",
  "content": "Monica Whitty - Monash University View Scopus Profile Monica Whitty Professor Professor, Department of Software Systems & Cybersecurity https://orcid.org/0000-0001-8143-289X EmailMonica.Whittymonashedu Accepting PhD StudentsPhD projectsMonica has several available scholarships for candidates considering human factors in cybersecurity. They need to have training in psychology or the social sciences and have interest and/or experience in researching these matters. Her field is a growing and important field in cybersecurity. Examples of potential projects may be:- Victimology of scam victims- Examination of the methods employed by criminals to trick scam victims- Detection of mis/disinformation via an understanding of psychological theories- Effective methods to train users in safe cyber security behaviours- Pathway models of insider threat (accidental and malicious)- Typology of an insider threat- Computer simulation of insider threats- How to improve businesses to make them more resilient to insider attacks 20012025 Research activity per year Personal profile BiographyProfessor Monica Whitty is the Head of Department of Software Systems and Cybersecurity and is Professor of Human Factors in Cyber Security. She has been a member of the World Economic Forum Cyber Security Centre and was a member of the WEF Cyber Security Global Futures Committee. She values a diverse and inclusive environment. Prof Whitty's academic career began in Australia working at Macquarie University and the University of Western Sydney, before moving to the UK (2003) and then returning home to Australia (2018). In the UK she worked for universities in the Russell Group (Queen's University, Belfast; University of Warwick), and The 1994 Group Universities (University of Leicester). In Australia, she previously worked at the University of Melbourne before commencing her post at UNSW in 2020. She was the founder and the Director of the UNSW Institute for Cyber Security (IFCYBER). Professor Whitty has worked in a GCHQ accredited Cyber Security Centre in the UK at the University of Warwick and has held an honorary post at the University of Oxford at the Oxford Martin School and the Oxford Internet Institute, and an honorary Professorship at the Institute of Royal Holloway, University of London. Monica has extensive experience in leading large interdisciplinary, international teams on funded projects. Professor Whitty has been awarded significant research funding (> $20 million AUD) and has led most of her projects. She has extensive experience in teaching at all levels and in the development of successful Masters courses. Prof Whitty is the author of over 100 articles and 5 books. She is a leading expert on human factors in cybersecurity. She is well-known for her work on the prevention, disruption, and detection of cyber fraud, (esp. romance scams and investment scams), cyber security training, identities created in cyberspace, online security risks, behaviour in cyberspace, insider threat and mis/disinformation. Monica's work is highly impactful - contributing to policy and tools in the UK and Australia to improve cyber security behaviours, prevent and detection cyber fraud victimisation, insider attacks, and the spread of disinformation. She has been an expert witness on > 10 cases across the globe for cyber fraud victims wrongly accused of drug trafficking and money laundering, and sentencing. Monica has given over >50 keynotes and invited talks and is regularly interviewed by the media on matters of cyber security. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationPsychology, PhD (psychology), Macquarie UniversityAward Date: 1 Mar 2000Psychology, BA (Hons) Psychology, Macquarie UniversityAward Date: 1 Mar 1992 Research area keywordscybersecurityFraudinsider threatmis/disinformationdeceptionpersuasionDecision-making Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2021 2021 2024 2026 1 Finished 2 Active Projects per year Ethical framework: Developing an Ethical Framework for using Blockchain-based Digital Credential Systems: Tackling the issue of Fake DegreesWhitty, M. (Primary Chief Investigator (PCI)), Cui, H. (Chief Investigator (CI)), Srivastava, A. (Chief Investigator (CI)), Liu, J. (Chief Investigator (CI)), Kumar Sinha, M. (Partner Investigator (PI)) & Young, G. (Chief Investigator (CI))Department of Foreign Affairs and Trade (DFAT) (Australia)1/11/24 → 31/10/26Project: Research Enhanced Disinformation DetectionWhitty, M. (Primary Chief Investigator (PCI)), Doherty, S. (Chief Investigator (CI)) & Sinnott, R. (Chief Investigator (CI))30/12/21 → 29/12/25Project: Research Building Resilience to Internal Cyber DisruptionWhitty, M. (Primary Chief Investigator (PCI)), Olivier, P. (Chief Investigator (CI)), Grobler, M. (Chief Investigator (CI)), Richelle, R. (Chief Investigator (CI)) & Butavicius, M. (Chief Investigator (CI))15/06/21 → 19/06/24Project: Research Research output Research output per year 2001 2007 2008 2010 2012 2014 2015 2020 2021 2025 2025 50 Article 21 Chapter (Book) 15 Conference Paper 3 Book 7 More 3 Review Article 2 Foreword / Postscript 1 Edited Book 1 Comment / Debate Research output per year Research output per year A Blockchain-Based Digital Identity Management System via Decentralized Anonymous CredentialsCui, H., Whitty, M., Miyaji, A. & Li, Z., 2025, Proceedings of the 6th ACM International Symposium on Blockchain and Secure Critical Infrastructure, BSCI 2024. Choo, K.-K. R., Gai, K., K. Liu, J. & Yu, J. (eds.). New York NY USA: Association for Computing Machinery (ACM), 11 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Open AccessFile 2 Citations (Scopus) Audio Deepfake Detection: What Has Been Achieved and What Lies AheadZhang, B., Cui, H., Nguyen, V. & Whitty, M., 22 Mar 2025, In: Sensors. 25, 7, 33 p., 1989.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 5 Citations (Scopus) COVID-19 lies and truths: Employing the Elaboration Likelihood Model (ELM) and Linguistic Inquiry and Word Count (LIWC) to gain insights into the persuasive techniques evident in disinformation (fake news)Whitty, M. T. & Ruddy, C., Dec 2025, In: Computers in Human Behavior Reports. 20, 11 p., 100797.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) Human-centric cyber security: Applying protection motivation theory to analyse micro business owners’ security behavioursJamil, H., Zia, T., Nayeem, T., Whitty, M. T. & D'Alessandro, S., 20 Jan 2025, In: Information and Computer Security. 33, 1, p. 49-76 28 p.Research output: Contribution to journal › Article › Research › peer-review 4 Citations (Scopus) Inside the Threat Matrix: Using Hybrid Computer Simulations to Educate Adults on Malicious Insider Threat and Technology MisuseWhitty, M. T., Abdulgalimov, D., Oliver, P., Ruddy, C., Seguin, J. & Young, G., 2025, HCI for Cybersecurity, Privacy and Trust - 7th International Conference, HCI-CPT 2025 Held as Part of the 27th HCI International Conference, HCII 2025 Gothenburg, Sweden, June 22–27, 2025 Proceedings, Part I. Moallem, A. (ed.). Cham Switzerland: Springer, p. 298-312 15 p. (Lecture Notes in Computer Science; vol. 15814).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) View all 96 research outputs Press/Media What are ‘click frauds’ – and how can we stop them?Whitty, M.30/08/241 Media contributionPress/Media: Article/Feature Cybersecurity in the Pacific: how island nations are building their online defences.Rudolph, C., Boorman, J. & Whitty, M.15/06/221 Media contributionPress/Media: Blogs, Podcasts and Social Media › Blogs",
  "content_length": 8355,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:43"
}