{
  "name": "Monica M. C. Schraefel",
  "homepage": "https://www.ecs.soton.ac.uk/people/sign",
  "status": "success",
  "content": "Professor m.c. Schraefel | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor m.c. Schraefel phd, cscs, ceng, fbcs Professor Connect with m.c. Email: mc@ecs.soton.ac.uk Tel: +44 23 8059 8372 ORCID On this page Research Publications External roles and responsibilities Research Publications External roles and responsibilities Research Research groups Member of: Agents, Interaction and Complexity Institute for Life Sciences Centre for Health Technologies Southampton Marine and Maritime Institute Research projects Active projects makeNormalBetter: Developing Health Resilience INteractive Technology to Transform UK Health and Wellbeing at Scale Researchers: Professor m.c. Schraefel Sponsor: EPSRC Completed projects ReFresh: remodeling Building Design Sustainability from a Human centered Approach Researchers: Professor m.c. Schraefel Sponsor: EPSRC MyTea Researchers: Professor m.c. Schraefel Professor Jeremy Frey Sponsor: EPSRC Overseas travel grant Researchers: Professor m.c. Schraefel Sponsor: EPSRC SMART-TEA2 Researchers: Professor m.c. Schraefel Professor Jeremy Frey Sponsor: EPSRC MusicSpace Researchers: Professor m.c. Schraefel Professor Jeanice Brooks Sponsor: Arts & Humanities Research Council Meaningful Consent in the Digital Economy Researchers: Professor m.c. Schraefel Professor Enrico Gerding , Professor Michael Vlassopoulos Sponsor: EPSRC Global research award Researchers: Professor m.c. Schraefel Sponsor: Royal Academy of Engineering RAE Equipment Grant 2012/2013 Researchers: Professor m.c. Schraefel Sponsor: Royal Academy of Engineering Dr MC Schraefel equipment grant Researchers: Professor m.c. Schraefel Sponsor: Royal Academy of Engineering Equipment Grant Researchers: Professor m.c. Schraefel Sponsor: Royal Academy of Engineering Elder Athletes: building incidental interaction at home for thriving at home, in home and on the go Researchers: Professor m.c. Schraefel Professor Chris Freeman , Doctor Martin Warner Sponsor: EPSRC AutoTrust: Human-Cyber Design for Resiliant, Useful, Usable Internet of Vehicles Researchers: Professor m.c. Schraefel Professor Enrico Gerding , Professor Sebastian Stein Sponsor: EPSRC EnAKTing - CLOSED Researchers: Dame Wendy Hall , Professor m.c. Schraefel , Doctor Nicholas Gibbins Sponsor: EPSRC [USE 515379] Shadbolt. EPSRC. SOCIAM: The Theory and Practice of Social Machines Researchers: Dame Wendy Hall , Professor m.c. Schraefel Sponsor: EPSRC W Hall. EPSRC. SOCIAM: The Theory and Practice of Social Machines Researchers: Dame Wendy Hall Professor m.c. Schraefel Sponsor: EPSRC Yardley - EPSRC Get A Move On (UCL Lead) Researchers: Professor Lucy Yardley Professor m.c. Schraefel Sponsor: EPSRC Shenoi - MARTHA Researchers: Ajit Shenoi Doctor Dominic Taunton , Professor m.c. Schraefel Sponsor: Orange County Community Foundation Enhancing the effectiveness of virtual communication: Synthesizing co-presence Researchers: Doctor Christoph Tremmel Doctor Nathan Huneke , Professor m.c. Schraefel Publications Detection of social anxiety using multiple simultaneous biosignals: a pilot study Christoph Tremmel, Nathan T.M. Huneke, Daniel Hobson & M.C. Schraefel, 2025, PLoS ONE, 20(9) DOI: 10.1371/journal.pone.0330603 Type: article Optimal algorithms for improving pressure-sensitive mat centre of pressure measurements Alexander Dawid Bincalar, Chris Freeman & m.c. schraefel, 2025, Sensors, 25(5) DOI: 10.3390/s25051283 Type: article “Should I Introduce myself?”: asynchronous semi-guided professional introductions for enhanced perceived team effectiveness in new virtual dyadic teams George Catalin Muresan, Sebastian Mititelu, Josh Andres & m.c. schraefel, 2024, International Journal of Human Computer Studies, 188 DOI: 10.1016/j.ijhcs.2024.103279 Type: article Editorial: inbodied interaction M.C. Schraefel, Michael Jones, Josh Andres & Elizabeth Murnane, 2023, Frontiers in Computer Science, 5 DOI: 10.3389/fcomp.2023.1295041 Type: letterEditorial Discomfort: a new material for interaction design M.C. schraefel & Michael Jones, 2023, Frontiers in Computer Science, 5 DOI: 10.3389/fcomp.2023.958776 Type: article Exploring the design space for Crowdsourcing Journey eXperience Selin Zileli, Richard C. Gomer & m.c. schraefel, 2023 DOI: 10.1145/3544549.3585818 Type: conference Work after Covid19: What do our futures look like? Pauline Leonard, Jane Parry, Steven Meers, Lohan Presencer & m.c. schraefel, 2023 Type: creativeMediaAndArtefact Comparing heart rate variability biofeedback and simple paced breathing to inform the design of guided breathing technologies Aaron Tabor, Scott Bateman, Erik J. Scheme & m.c. schraefel, 2022, Frontiers in Computer Science, 4 DOI: 10.3389/fcomp.2022.926649 Type: article Automated privacy negotiations with preference uncertainty Dorota Filipczuk, Tim Baarslag, Enrico H. Gerding & M. C. Schraefel, 2022, Autonomous Agents and Multi-Agent Systems, 36(2) DOI: 10.1007/s10458-022-09579-1 Type: article Body as starting point 5 Josh Andres, Richard Gomer, Michael Jones & M. C. Schraefel, 2022 DOI: 10.1145/3491101.3503707 Type: conference External roles and responsibilities Name: Creativity as a Health & Social Justice Right: Challenges/Opportunities for HCI Role: Speaker Year: 2022 Name: Inbodied Interaction: principles for hypertext and web scientists to consider how their work can help #makeNormalBetter for all, at scale. Role: Speaker Year: 2022 Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Pre-sessional English courses Course modules Assessment Subjects Acoustical engineering Aeronautical and astronautical engineering Ageing and gerontology Archaeology Art, design and fashion Audiology Biological sciences Biomedical and medical engineering Business, accounting, finance and marketing Chemistry Civil engineering Computer science and software engineering Economics Education Electrical and electronic engineering English Film studies French Geography and environmental science History Languages and linguistics Law Maritime engineering Mathematical sciences Mechanical engineering Medicine Music Nursing, midwifery and healthcare Ocean and Earth science Philosophy Photonics and optoelectronics Physics and astronomy Politics and international relations Psychology Social statistics and demography Sociology, social policy and criminology PhDs and research degrees Create your own research project Find a PhD project A missing link between continental shelves and the deep sea: Have we underestimated the importance of land-detached canyons? A study of rolling contact fatigue in electric vehicles (EVs) Acoustic monitoring of forest exploitation to establish community perspectives of sustainable hunting Acoustic sensing and characterisation of soil organic matter Advancing intersectional geographies of diaspora-led development in times of multiple crises Aero engine fan wake turbulence – Simulation and wind tunnel experiments Against Climate Change (DACC): improving the estimates of forest fire smoke emissions All-in-one Mars in-situ resource utilisation (ISRU) system",
  "content_length": 29170,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:45"
}