{
  "name": "Monica N. Nicolescu",
  "homepage": "https://www.cse.unr.edu/~monica",
  "status": "success",
  "content": "Monica Nicolescu Photo by Sally Casas Monica Nicolescu Professor Director, Robotics Research Lab Department of Computer Science University of Nevada, Reno Reno, NV 89557 Email: monica@cse.unr.edu Phone: (775) 784-1687 My research interests cover a wide range of topics in the area of human-robot interaction, focusing on the issues of communication, learning, social interactions, and teamwork. My research is aimed at developing methodologies for successfully integrating robots into human society. More specifically, I focus on designing systems that incorporate novel approaches to robot learning, autonomous control and interaction that increase the utility of autonomous robots and their ability to function in dynamic, unpredictable environments. Robots that can effectively operate in such environments require robust and flexible real-time control and the ability to perform complex tasks. In addition, for efficient interaction with humans or other agents in their environment, robots should be endowed with learning capabilities that enable them to adapt and improve their performance. Within the area of multi-robot systems I am interested in issues related to robot group learning from highly interactive teaching experiences, and also in issues related to a group's ability to adapt to changes in the environment, the task, or the group structure. Effective communication and interaction with robots can be achieved through concurrent use of multiple interface modalities (such as speech, vision, gestures, or otherwise mediated communication) and by increasing the ability of robots to interact with the environment, other robots, and people. I am interested in approaches that through the integration of a wider variety of sensors and using more expressive communicative skills will allow robots to more accurately characterize the environment and will provide humans with a more natural approach for interacting with them. I am also interested in the topic of social robotics. Being able to follow social norms and establish social relationships are essential in application domains such as service robotics and personal and companion robotics, in which the nature of the interaction requires the robots to behave socially. A related topic I am exploring is developing architectures for heterogeneous teams of humans and robots. In this area I am interested in the interactions and relationships between humans and robots, in order to find optimal organizations for various human-robot scenarios, and to determine appropriate authority relationships among the members of the team.",
  "content_length": 2596,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:42"
}