{
  "name": "Monica Divitini",
  "homepage": "https://www.ntnu.edu/employees/divitini",
  "status": "success",
  "content": "Monica Divitini - NTNU Monica Divitini Download press photo Download press photo Foto: Close Monica Divitini Professor Department of Computer Science divitini@ntnu.no +4791897790 213 IT-bygget Gløshaugen, Trondheim About Monica Divitini is Professor in Cooperation Technologies at IDI-NTNU since 2002. She holds a PhD in Computer Science from Aalborg University, Denmark. Main scientific Grants (recent) MIRROR, (Unit responsible - proposal prepared with Dr. Birgit Krogstie) IP Co-Funded by EU IST FP7 (project nr. 257617), theme: Technology-enhanced learning, 2010 – 2014, Coordinator: IMC Information Media, Germany - 15 partners across 6 European countries. NORDIC-LEAF (unit responsible), Nordforsk funded network for researcher training in social and mobile learning, lead by Stockholm University, 8 partners in Nordic countries. Co-creat (unit responsible), project co-funded by EU LLP2010 on creative collaboration in learning, lead by Oulu University, 8 partners across Europe FABULA (Project leader) – Project funded by NFR-VERDIKT on seamless networks for transforming the city into an arena for learning. Collaboration among IDI, the Department of Telematics and the Center for ICT and Learning (LIKT) at NTNU 11 MNOK ASTRA (Unit responsible) – Project  co-funded by EU IST-FET on pervasive awareness applications, lead by CTI, Greece with 5 partners. Completed in 2010. MOTUS (project leader) – Project funded by LIKT-NTNU on Mobile Technology in University Education. Collaboration among IDI, the Programme for teacher education and the Department of Modern Foreign Languages (French group) at NTNU. Completed 2010. Publications 2025 Jost, Patrick; Divitini, Monica; Dahl, Yngve; Sharma, Kshitij. (2025) Using Serious Games in Decision‐Making Research: From Ideation to Application. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation 2024 Schmidt, Michaela Margarethe; Divitini, Monica; Hohenbüchler, Christine; Ringdal, Nora Othilie; Schütz, Theresa; Tellioglu, Hilda. (2024) Infrastructure and Creativity: Can they co-exist? (workshop description). Reports of the European Society for Socially Embedded Technologies Academic article Barendsen, Erik; Lonati, Violetta; Quille, Keith; Altin, Rukiye; Divitini, Monica; Hooshangi, Sara. (2024) AI in and for K-12 Informatics Education. Life after Generative AI. Academic chapter/article/Conference paper Clear, Tony; Cajander, Åsa; Clear, Alison; McDermott, Roger N.; Bergqvist, Andreas; Daniels, Mats. (2024) A Plan for a Joint Study into the Impacts of AI on Professional Competencies of IT Professionals and Implications for Computing Students. Academic chapter/article/Conference paper Håtveit, Åse; Mora, Simone; Venverloo, Titus; Duarte, Fábio; Divitini, Monica. (2024) Teaching urban sensing skills - experiences from a summer school. ID&A Interaction design & architecture(s) Academic article Gangstø, Benedicte Helen; Divitini, Monica. (2024) Sustainability in IT education A game-based approach. ID&A Interaction design & architecture(s) Academic article 2023 Fessl, Angela; Maitz, Katharina; Divitini, Monica. (2023) Survival Skills in the Digital Era: Helping Teachers to Develop Digital Competences. ERCIM News Article in business/trade/industry journal Fessl, Angela; Divitini, Monica; Maitz, Katharina. (2023) Transferring Digital Competences for Teaching from Theory into Practice Through Reflection. Lecture Notes in Computer Science (LNCS) Academic article Rehman, Attiqa; Divitini, Monica. (2023) Categorizing Projects for Software Engineering Capstone Courses. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Terzi, Ioanna; Divitini, Monica; Avouris, Nikolaos. (2023) Human factors in software development: A study on database systems adoption by developers. Academic chapter/article/Conference paper 2022 Rouhani, Majid; Divitini, Monica; Hashemi, Amir Massoud. (2022) Computer Science in Schools: A Literature Mapping of Professional Development for In-Service Teachers. IEEE Global Engineering Education Conference, EDUCON Academic article Rouhani, Majid; Lillebo, Miriam Størseth; Farshchian, Veronica; Divitini, Monica. (2022) Learning to Program: an In-service Teachers’ Perspective. IEEE Global Engineering Education Conference, EDUCON Academic article 2021 Jost, Patrick; Divitini, Monica. (2021) From Paper to Online: Digitizing Card Based Co-creation of Games for Privacy Education. Academic chapter/article/Conference paper Rouhani, Majid; Divitini, Monica; Olsø, Atle. (2021) Project-based learning and training of in-service teachers in programming: Projects as a bridge between training and practice. IEEE Global Engineering Education Conference, EDUCON Academic article Nystad, Niklas Joakim; Rouhani, Majid; Divitini, Monica. (2021) Code Reuse and Formative Assessment in Secondary Education. IEEE Global Engineering Education Conference, EDUCON Academic article Schulte, Carsten; Becker, Brett A.; Divitini, Monica; Barendsen, Erik. (2021) ITiCSE 2021 Chairs' Welcome. Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE Editorial Jost, Patrick; Divitini, Monica. (2021) Designing Analytic Serious Games: An Expert Affordance View on Privacy Decision-Making. Academic chapter/article/Conference paper Rouhani, Majid; Farshchian, Veronica; Divitini, Monica. (2021) Teaching Programming in Secondary Schools: Stepping and Stumbling Stones. ID&A Interaction design & architecture(s) Academic article Rouhani, Majid; Lillebo, Miriam Størseth; Farshchian, Veronica; Divitini, Monica. (2021) Professional Development for In-Service Teachers of Programming: Evaluation of a University-Level Program. Lecture Notes in Computer Science (LNCS) Academic article 2020 Jost, Patrick; Divitini, Monica. (2020) The Challenge Game Frame: Affordance oriented Co-Creation of Privacy Decision Games. Academic chapter/article/Conference paper Jost, Patrick; Bøhm, Gisela; Divitini, Monica; Tjøstheim, Ingvar. (2020) ALerT – Learning about privacy at the time of data sharing everywhere. ERCIM News Academic article Giannakos, Michail; Sindre, Guttorm; Andrew, Luxton-Reilly; Divitini, Monica. (2020) ITiCSE '20: Proceedings of the 2020 ACM Conference on Innovation and Technology in Computer Science Education. Association for Computing Machinery (ACM) Association for Computing Machinery (ACM) Academic anthology/Conference proceedings Jost, Patrick; Divitini, Monica. (2020) Game elicitation: exploring assistance in delayed-effect supply chain decision making. Academic chapter/article/Conference paper Thorsnes, Jørgen; Rouhani, Majid; Divitini, Monica. (2020) In-Service Teacher Training and Self-efficacy. Lecture Notes in Computer Science (LNCS) Academic article Berger, Erlend; Solberg, Dag Frode; Sæthre, Torjus Hansen; Divitini, Monica. (2020) Supporting the Co-design of Games for Privacy Awareness. Advances in Intelligent Systems and Computing Academic article Jin, Fufen; Divitini, Monica. (2020) Affinity for Technology and Teenagers' Learning Intentions. Proceedings of the 2020 ACM Conference on International Computing Education Research Academic article Giannakos, Michail; Sindre, Guttorm; Luxton-Reilly, Andrew; Divitini, Monica. (2020) ITiCSE 2020 Chairs' Welcome. Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE Editorial Jin, Fufen; Divitini, Monica. (2020) Affinity for Technology and Teenagers' Learning Intentions. Academic chapter/article/Conference paper 2019 Gianni, Francesco Valerio; Klecha, Lisa; Divitini, Monica. (2019) Tiles-Reflection: Designing for Reflective Learning and Change Behaviour in the Smart City. Academic chapter/article/Conference paper Berger, Erlend; Sæthre, Torjus Hansen; Divitini, Monica. (2019) PrivaCity: A Chatbot Game to Raise Privacy Awareness Among Teenagers. Lecture Notes in Computer Science (LNCS) Academic article Saxegaard, Evelyn; Divitini, Monica. (2019) CITY: A Game to Raise Girls’ Awareness About Information Technology. Lecture Notes in Computer Science (LNCS) Academic article Rouhani, Majid; Divitini, Monica; Vujosevic, Vojislav; Stai, Sondre; Olstad, Hege Annette. (2019) Design of a programming course for teachers supporting flexible learning trajectories. Academic chapter/article/Conference paper Divitini, Monica; Jin, Fufen. (2019) Final evaluation of the UMI-Sci-Ed project: Analysis of empirical data. European Commission European Commission Report 2018 Reiersølmoen, Mikael; Gianni, Francesco Valerio; Divitini, Monica. (2018) DELTA: Promoting Young People Participation in Urban Planning. Academic chapter/article/Conference paper Mavroudi, Anna; Divitini, Monica; Mora, Simone; Gianni, Francesco Valerio. (2018) Game-Based Learning for IoT: the Tiles inventor toolkit. Academic chapter/article/Conference paper Gianni, Francesco Valerio; Divitini, Monica. (2018) Designing IoT Applications for Smart Cities: extending the Tiles Ideation Toolkit. ID&A Interaction design & architecture(s) Academic article Mavroudi, Anna; Divitini, Monica; Gianni, Francesco Valerio; Mora, Simone; Kvittem, Dag Rune. (2018) Designing IoT Applications in Lower Secondary Schools. Academic chapter/article/Conference paper Mealha, Óscar; Divitini, Monica; Rehm, Matthias. (2018) Citizen, Territory and Technologies: Smart Learning Contexts and Practices. Springer Springer Academic anthology/Conference proceedings Gianni, Francesco Valerio; Mora, Simone; Divitini, Monica. (2018) RapIoT toolkit: Rapid prototyping of collaborative Internet of Things applications. Future Generation Computer Systems Academic article Giannakos, Michail; Divitini, Monica; Jaccheri, Maria Letizia; Iversen, Ole Sejer. (2018) Proceedings of the Conference on Creativity and Making in Education. Association for Computing Machinery (ACM) Association for Computing Machinery (ACM) Academic anthology/Conference proceedings Giannakos, Michail; Jaccheri, Maria Letizia; Divitini, Monica. (2018) Proceedings of the 17t",
  "content_length": 74482,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:41"
}