{
  "name": "Monosij Maitra",
  "homepage": "https://monosijm.github.io",
  "status": "success",
  "content": "Monosij Maitra Monosij Maitra Email: {first name} AT cse.iitkgp.ac.in / {first name.last name} AT gmail.com Office: Room 307, CSE Main Building, IIT Kharagpur. Vocalizing my name: Enounce first 'o' as \"awe\" prefixed with M and 's' as \"sh\" [M + awe + no + sh + ij]. I work as a faculty in the CSE department at IIT Kharagpur. My research interests are broadly in the theory and applications of public-key cryptography with a focus on computing on encrypted/authenticated data and building tools to enable distributed trust. Before joining IIT Kharagpur, I worked as a postdoc jointly with Eike Kiltz (at Ruhr-Universität Bochum) & Giulio Malavolta (at Max Planck Institute for Security and Privacy). Prior to that, I worked as a postdoc with Sebastian Faust (at TU Darmstadt). Earlier, I received a PhD in CSE from IIT Madras and then worked as a research staff at CCD@IITM. During PhD, I was very fortunate to be advised by Shweta Agrawal. Research | Open Positions | Group | Professional | Teaching | Research: Publications/Preprints/Patents [DBLP] [Google Scholar] Silent Threshold Traitor Tracing & Enhancing Mempool Privacy. Anirban Chakrabarti, Monosij Maitra, Arup Mondal, Kushaz Sehgal. [ACM CCS 2025] Traitor Tracing without Trusted Authority from Registered Functional Encryption. Pedro Branco, Russell W. F. Lai, Monosij Maitra, Giulio Malavolta, Ahmadreza Rahimi, Ivy K. Y. Woo. [ASIACRYPT 2024] Round Efficient Byzantine Agreement from VDFs. Poulami Das, Lisa Eckey, Sebastian Faust, Julian Loss, Monosij Maitra. [SCN 2024] Updatable Policy-Compliant Signatures. Christian Badertscher, Monosij Maitra, Christian Matt, Hendrik Waldner. [PKC 2024] Registered (Inner-Product) Functional Encryption. Danilo Francati, Daniele Friolo, Monosij Maitra, Giulio Malavolta, Ahmadreza Rahimi, Daniele Venturi. [ASIACRYPT 2023] Functional Encryption for Turing Machines with Dynamic Bounded Collusion from LWE. Shweta Agrawal, Monosij Maitra, Narasimha Sai Vempati, Shota Yamada. [CRYPTO 2021] Two-Party Adaptor Signatures From Identification Schemes. Andreas Erwig, Sebastian Faust, Kristina Hostakova, Monosij Maitra, Siavash Riahi. [PKC 2021] Adaptive Simulation Security for Inner Product Functional Encryption. Shweta Agrawal, Benoît Libert, Monosij Maitra, Radu Titiu. [PKC 2020] Attribute Based Encryption for Deterministic Finite Automata from DLIN. Shweta Agrawal, Monosij Maitra, Shota Yamada. [TCC 2019] Attribute Based Encryption (and more) for Nondeterministic Finite Automata from LWE. Shweta Agrawal, Monosij Maitra, Shota Yamada. [CRYPTO 2019] FE and iO for Turing Machines from Minimal Assumptions. Shweta Agrawal, Monosij Maitra. [TCC 2018] Convergence of the Min-Sum Decoding Scheme for LDPC Codes from a Dynamical Systems Perspective Monosij Maitra, Abhik Mukherjee. [EAIT 2014] [PhD Thesis] Fine-grained Encryption for Uniform Models of Computation. (IBM Best PhD Thesis award). [Patent(s) Filed/Published] Decentralized Multi-Authority Attribute-Based Inner-Product Functional Encryption. Pratish Datta, Monosij Maitra, Tapas Pal. (US Patent|US2023/0353346A1|Filed by NTT Research, Inc.) Open Positions I am looking for motivated Masters & PhD students. Please email, if interested. Check here for details on admission into research programmes. Research Group We are part of the following Cryptography & Security group. Below are the members of my research group. Current members - Harshit Kumar [MTech, 2024-26] - Abhinandan Mohapatra [Project Associate (since 09/25)] - Satyabrat Rath [Research Associate (since 09/25)] Professional Activities Program committee member: - Indocrypt 2023, ACNS (2025, 2026), ACM CCS (2025, 2026) External reviewer: - Eurocrypt (2022, 2025, 2026) - Crypto (2021, 2022, 2023, 2025) - Asiacrypt (2017, 2018, 2019, 2020, 2021, 2022, 2025) - TCC (2019, 2021, 2023) - PKC (2019, 2021, 2022, 2023, 2024) - ACM CCS 2022, ITCS 2021, ICALP 2023 - Indocrypt (17, 20, 22, 24), SCN 2024, CANS 2024 Journal reviewer: - Journal of Cryptography - Design, Codes and Cryptography - IEEE Transactions on Dependable and Secure Computing - IEEE Transactions on Information Forensics and Security Volunteer: Indocrypt 2017, TCC 2018. Teaching Semester-1, Autumn 2024-25 - CS60065: Cryptography and Network Security - CS19003: Programming and Data Structures Lab  (CS19003: Jointly with Satrajit Ghosh) Semester-2, Spring 2024-25 - CS21202: Switching Circuits and Logic Design - CS29204: Switching Circuits Lab  (CS21202+CS29204: Jointly with Indranil Sen Gupta) Semester-3, Autumn 2025-26 - CS60065: Cryptography and Network Security - CS19003: Programming and Data Structures Lab  (CS19003: Jointly with Ayan Chaudhury) Semester-4, Spring 2025-26 - CS21204: Formal Language and Automata Theory - CS60088: Foundations of Cryptography (CS21204: Jointly with Aritra Hazra) (CS60088: Jointly with Somindu Chaya Ramanna)",
  "content_length": 4850,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:45"
}