{
  "name": "Monojit Choudhury",
  "homepage": "https://mbzuai.ac.ae/study/faculty/monojit-choudhury",
  "status": "success",
  "content": "Monojit Choudhury - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Monojit Choudhury Monojit Choudhury Professor of Natural Language Processing Research Interests Professor Choudhury’s research interests center around the convergence of Language Technology and Society, exploring pivotal inquiries such as the learning and (mis)representation of linguistic and cultural diversity by foundation models. His research delves into the impact of representational disparities on present and future of technology use, and their impact on linguistic and cultural dynamics in the real world. A focal objective is to devise fair and equitable language technologies, contributing to an inclusive future. Additionally, Choudhury is keen on leveraging generative AI for planetary-scale quantitative investigations into and modeling of culture. Email Share Prior to joining MBZUAI, Professor Choudhury was a principal researcher at Microsoft Research India from 2009 to 2022 and a principal applied scientist at Microsoft Turing (part of Microsoft India Development Center) from 2022 to 2023. He is also an adjunct faculty at International Institute of Information Technology Hyderabad (since 2017) and a professor of practice at Plaksha University (since 2021). He was a recipient of the Media Lab Asia research fellowship from 2002 to 2007. Professor Choudhury has a US patent on automatic request categorization of Internet applications. He is also the general chair of the Panini Linguistics Olympiad (India’s national linguistics Olympiad) and founding co-chair of Asia Pacific Linguistics Olympiad. Professor Choudhury takes keen interest in popularizing linguistics and natural language processing among schoolchildren and non-experts through designing puzzles. Postdoctoral fellow at Microsoft Research India (2007-2008) Ph.D. in Computer Science and Engineering from Indian Institute of Technology (2007) BTech in Computer Science and Engineering from Indian Institute of Technology Kharagpur (2002) Associate editor of IEEE Trans. on Pattern Analysis and Machine Intelligence (since 2023) and ACM Trans. on Asian and Low-resource Language Information Processing (2017-2020) Action editor of ACL Rolling Review Program co-chair for ACM COMPASS 2023 Best Paper awards in IJCAI 2007 workshop on Noisy Unstructured Text Data and Evolang 2012 Young Scientist Award by Indian Science Congress Association (2003) Choudhury, M. (2023). Generative AI has a language problem. Nature Human Behaviour, 1-2. Rao, A., Khandelwal, A., Tanmay, K., Agarwal, U., & Choudhury, M. (2023). Ethical Reasoning over Moral Alignment: A Case and Framework for In-Context Ethical Policies in LLMs. In Findings of the Association for Computational Linguistics: EMNLP 2023 (pp. 13370-13388). Ahuja, K., Kumar, S., Dandapat, S., & Choudhury, M. (2022). Multitask Learning For Zero Shot Performance Prediction of Multilingual Models. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (pp. 5454–5467). Diddee, H., Bali, K., Choudhury, M., & Mukhija, N. (2022, June). The six conundrums of building and deploying language technologies for social good. In ACM SIGCAS/SIGCHI Conference on Computing and Sustainable Societies (COMPASS) (pp. 12-19). Choudhury, M., & Deshpande, A. (2021). How Linguistically Fair Are Multilingual Pre-Trained Language Models?. In Proceedings of the AAAI conference on Artificial Intelligence (Vol. 35, No. 14, pp. 12710-12718). Joshi, P., Santy, S., Budhiraja, A., Bali, K., & Choudhury, M. (2020). The State and Fate of Linguistic Diversity and Inclusion in the NLP World. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics (pp. 6282-6293). Google Scholar dblp LinkedIn ResearchGate Related Wednesday, May 21, 2025 Advancing cultural diversity through AI To mark World Day for Cultural Diversity for Dialogue and Development, we look at how MBZUAI is… large language models llms diversity United Nations language culture cultural awareness inclusion benchmark music dialogue low resource UNESCO Read more Wednesday, May 14, 2025 What LLMs get wrong about culture — and how to fix them: Two studies from NAACL Researchers from MBZUAI used book reviews from Ethiopia, India, and the US to measure the ability of… research conference large language models llm llms NAACL award culture cultural awareness languages Read more Monday, April 28, 2025 Identifying bias in generative music models: A new study presented at NAACL A team from MBZUAI tested the performance of models in non-Western music, with the aim of making… generative AI NAACL culture music Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 6101,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:47"
}