{
  "name": "Morris Sloman",
  "homepage": "http://wp.doc.ic.ac.uk/mss",
  "status": "success",
  "content": "Emeritus Professor Morris Sloman | Department of Computing Distributed Sofware Engineering Emeritus Professor Morris Sloman Department of Computing, Imperial College London, Email:        m.sloman %at% imperial.ac.uk Brief CV DSE Photographs Imperial College Medal May 2018 I am now retired and not supervising PhD students, so do not send me applications. Professional Societies Fellow of Royal Academy of Engineering Fellow of the Institution of Electrical and Electronic Engineers Chartered Engineer Current External Activities Advisory Board  IEEE Transaction on Network and Service Management (TNSM) Editorial Advisory Board Journal of Network and Systems Management (JNSM) Editorial Advisory Board International Journal of Network Management International Advisory Council INESC ID-Lisboa Member IEEE Fellows Committee 2016, 2018, 2019, 2020 Past External Activities HEFCE Research Assessment Exercise 2001, 2008 Computer Science Sub-Panel (F23) Member, and REF 2014 Sub-Panel B11 (Deputy Chair) Editor in Chief IEEE Transaction on Network and Service Management (TNSM) (Jan 2011 – Dec 2013) International Panel Reviewing INRIA Networks and Telecommunications Theme (2012) Policy: IEEE International Symposium on Policies for Distributed Systems and Networks Steering Committee Member UKCRC: UK Computing Research Committee Executive committee member UKCRC: Grand Challenge on Global Ubiquitous Computing: Science and Design – working group chair Editor of IEE/BCS/IOP Distributed Systems Engineering Journal (ceased publication) Chairman EPSRC Multimedia and Network Applications Research MNA Program (1995-2000). EPSRC Information and Communications Technologies Strategic Advisory Team (2002-2004) 5th IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO2011) Michigan, Oct. 2011 SASO 2007 First IEEE International Conference on Self-Adaptive and Self-Organizing Systems, Boston, Mass., USA, July 9-11, 2007, Program Committee SELFMAN2006 Second IEEE International Workshop on Self-Managed Networks, Systems & Services Dublin, Ireland, 16 June Program Co-chair MONAM2006: IEEE / IST Workshop on Monitoring, Attack Detection and Mitigation, Tuebingen, Germany, 28-29 Sep. 2006 Program Co-chair MDM2003 4th: International Conference on Mobile Data Management, Melbourne Australia, 21-24 Jan. 2003 Program Co-Chair IM’99, Boston, May 24-28 1999 Lectures and Keynotes Analysis of REF 2014 Results for SP11 Computer Science and Informatics Inaugural Lecture    Policy Agents: Licensed to Manage,  May 1998 Presentation-HTML,  Presentation-PDF Management of Ubiquitous Communications (MUCS), Trinity College Dublin, Dec. 2004 invited keynote speaker 8th International Conference on Feature Interactions in Telecommunications and Software Systems June 2005, Leicester, UK, invited keynote Engineering Policy Based Ubiquitous Systems,  Invited BCS Computer Journal Lecture, May 2009 Presentation pdf,    Computer Journal Paper The Many Faces of Policy Based Management, IEEE/IFIP Network Operations and Management  (NOMS’12), Maui, April 2012, invited keynote Presentation pdf Print Email to a Friend Email to a Friend Page URL: http://wp.doc.ic.ac.uk/mss/ Your Information: Your Name Your Email Friend’s Information: Friend’s Name Friend’s Email Close Login Main campus address: Imperial College London, South Kensington Campus, London SW7 2AZ, tel: +44 (0)20 7589 5111 Campus maps and information About this site This site uses cookies © Copyright 2013 – Imperial College London",
  "content_length": 3509,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:51"
}