{
  "name": "Morteza Varasteh",
  "homepage": "https://www.essex.ac.uk/people/varas35607/morteza-varasteh",
  "status": "success",
  "content": "Morteza Varasteh | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Morteza Varasteh People Dr Morteza Varasteh Lecturer School of Computer Science and Electronic Engineering (CSEE) Email m.varasteh@essex.ac.uk Location 5B.523, Colchester Campus Academic support hours Monday 11am - 12pm Friday 11am - 12pm Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Morteza Varasteh received his PhD degree in Communications from Imperial College London, London, UK in 2016. In his PhD, information theoretic limits of zero-delay point-to-point transmission techniques have been investigated using tools in analysis, optimization and information theory. He was a research associate in Imperial college London from 2017 to 2019, during which he worked on the EPSRC-funded project \"Simultaneous Information-Power Transfer\". A number of significant results were achieved during this work, among which was the design of signalling schemes for wireless information-power transmission (WIPT) systems utilizing tools in machine learning, optimization and information theory. The designed signalling schemes are now used in prototyping WIPT systems. He is currently a lecturer (assistant professor) in the Computer Science and Electrical Engineering (CSEE) Department, University of Essex, Colchester Campus, UK. His research interests lie in the general area of machine learning, privacy and information theory. Qualifications PhD Imperial College London, MSc Sharif University of Technology, Research and professional activities Research interests Information Theory Open to supervise Artificial Intelligence Privacy Teaching and supervision Current teaching responsibilities Foundations of Electronics II (CE164) Signal Processing (CE223) Current supervision Aryan Morteza Degree subject: Computer Science Degree type: Doctor of Philosophy Publications Publications (1) Varasteh, M., (2023). Privacy Against Agnostic Inference Attacks in Vertical Federated Learning Journal articles (10) Varasteh, M., Rassouli, B. and Clerckx, B., (2020). On Capacity-Achieving Distributions for Complex AWGN Channels Under Nonlinear Power Constraints and Their Applications to SWIPT. IEEE Transactions on Information Theory. 66 (10), 6488-6508 Varasteh, M., Hoydis, J. and Clerckx, B., (2020). Learning to Communicate and Energize: Modulation, Coding, and Multiple Access Designs for Wireless Information-Power Transmission. IEEE Transactions on Communications. 68 (11), 6822-6839 Varasteh, M., Rassouli, B. and Clerck, B., (2019). SWIPT Signalling over Frequency-Selective Channels with a Nonlinear Energy Harvester: Non-Zero Mean and Asymmetric Inputs. IEEE Transactions on Communications. 67 (10), 7195-7210 Varasteh, M., Rassouli, B. and Clerckx, B., (2019). SWIPT Signaling Over Frequency-Selective Channels With a Nonlinear Energy Harvester: Non-Zero Mean and Asymmetric Inputs.. IEEE Trans. Commun.. 67, 7195-7210 Varasteh, M., Rassouli, B., Simeone, O. and Gunduz, D., (2018). Zero-Delay Source-Channel Coding With a Low-Resolution ADC Front End. IEEE Transactions on Information Theory. 64 (2), 1241-1261 Rassouli, B., Varasteh, M. and Gündüz, D., (2018). Gaussian Multiple Access Channels with One-Bit Quantizer at the Receiver †,‡. Entropy. 20 (9), 686-686 Rassouli, B., Varasteh, M. and Gündüz, D., (2018). Gaussian Multiple Access Channels with One-Bit Quantizer at the Receiver †, ‡.. Entropy. 20, 686-686 Varasteh, M., Rassouli, B., Simeone, O. and Gunduz, D., (2017). Zero-Delay Source-Channel Coding With a 1-Bit ADC Front End and Correlated Receiver Side Information. IEEE Transactions on Communications. 65 (12), 5429-5444 Varasteh, M., Gunduz, D. and Tuncel, E., (2016). Zero-Delay Joint Source-Channel Coding in the Presence of Interference Known at the Encoder. IEEE Transactions on Communications. 64 (8), 3311-3322 Varasteh, M. and Behroozi, H., (2012). Optimal HDA Schemes for Transmission of a Gaussian Source Over a Gaussian Channel With Bandwidth Compression in the Presence of an Interference. IEEE Transactions on Signal Processing. 60 (4), 2081-2085 Show all Book chapters (1) Clerckx, B. and Varasteh, M., (2018). Fundamentals of Signal Design for WPT and SWIPT. In: Wireless Information and Power Transfer Theory and Practice. Wiley. 17- 37 Conferences (16) Turetta, C., Varasteh, M., Kolozali, Ş. and Pravadelli, G., (2024). Leveraging mmWave for Contactless Breath Rate Estimation of Moving Subjects Varasteh, M., Piovano, E. and Clerckx, B., (2019). A Learning Approach to Wireless Information and Power Transfer Signal and System Design Varasteh, M., Hoydis, J. and Clerckx, B., (2019). Learning Modulation Design for SWIPT with Nonlinear Energy Harvester: Large and Small Signal Power Regimes Varasteh, M., Hoydis, J. and Clerckx, B., (2019). Learning Modulation Design for SWIPT with Nonlinear Energy Harvester: Large and Small Signal Power Regimes. Varasteh, M., Piovano, E. and Clerckx, B., (2019). A Learning Approach to Wireless Information and Power Transfer Signal and System Design. Varasteh, M., Rassouli, B. and Clerckx, B., (2018). Wireless information and power transfer over an AWGN channel: Nonlinearity and asymmetric Gaussian signaling Varasteh, M., Rassouli, B., Joudeh, H. and Clerckx, B., (2018). SWIPT Signalling over Complex AWGN Channels with Two Nonlinear Energy Harvester Models Rassouli, B., Varasteh, M. and Gunduz, D., (2017). Capacity region of a one-bit quantized Gaussian multiple access channel Varasteh, M., Rassouli, B., Simeone, O. and Gunduz, D., (2016). Zero-delay joint source-channel coding with a 1-bit ADC front end and receiver side information Varasteh, M., Simeone, O. and Gunduz, D., (2016). Joint source-channel coding with one-bit ADC front end Varasteh, M., Gunduz, D. and Tuncel, E., (2015). Zero-delay joint source-channel coding in the presence of interference known at the encoder Varasteh, M., Gunduz, D. and Tuncel, E., (2015). Delay limited transmission of a uniform source over an AWGN channel Aguerri, IE., Varasteh, M. and Gunduz, D., (2014). Zero-delay joint source-channel coding Varasteh, M. and Behroozi, H., (2012). Layered hybrid digital-analog coding with correlated interference Varasteh, M. and Behroozi, H., (2011). Optimal HDA codes for sending a Gaussian source over a Gaussian channel with bandwidth compression in the presence of an interference Varasteh, M. and Behroozi, H., (2011). On the transmission of a Gaussian source over an AWGN channel with correlated interference Show all Reports and Papers (1) Rassouli, B., Varasteh, M. and Gunduz, D., (2022). Privacy Against Inference Attacks in Vertical Federated Learning Grants and funding 2022 Lubron UK Limited KTP 22_23 R3 Innovate UK (formerly Technology Strategy Board) 2020 AND Technology Research KTP Application Innovate UK (formerly Technology Strategy Board) Contact m.varasteh@essex.ac.uk Location: 5B.523, Colchester Campus Academic support hours: Monday 11am - 12pm Friday 11am - 12pm STUDY Course Finder Undergraduate study Postgraduate study Doctoral and Postdoctoral College Short courses and CPD International students Study online Apprenticeships Summer Schools Find a course LIFE Our campuses Student accommodation Essex Sport Careers and Employability Student support RESEARCH Research excellence Research showcase Media requests Research Excellence Framework (REF) Research institutes and centres EXPLORE About us Departments Contact us How to pay your fees Jobs A-Z Students Alumni Staff Business CONTACT US Contact General - enquiries@essex.ac.uk Undergraduate - admit@essex.ac.uk Postgraduate - pgadmit@essex.ac.uk +44 (0) 1206 873333 University of Essex Wivenhoe Park Colchester CO4 3SQ Cookie settings Disclaimer Accessibility Our privacy statements Our transparency return Modern slavery and human trafficking CONNECT WITH US University of Essex Instagram University of Essex TikTok University of Essex Youtube University of Essex Facebook University of Essex LinkedIn University of Essex Twitter University of Essex Weibo © 2025 University of Essex. All rights reserved UNRVLD Digital Agency website",
  "content_length": 9170,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:54"
}