{
  "name": "Mosarrat Jahan",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1777",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Mosarrat Jahan (Associate Professor) Department of Computer Science and Engineering Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Computer Science and Engineering UNSW Sydney Australia 2018 Masters Computer Science (Research) Concordia University Canada 2012 Masters Computer Science and Engineerning University of Dhaka Bangladesh 2005 Bachelor Computer Science University of Dhaka Bangladesh 2003 Title Organization Location From Date To Date Associate Professor Department of Computer Science and Engineering, University of Dhaka 21, Jan 2018 Currently Working Assistant Professor Department of Computer Science and Engineering, University of Dhaka 04, Aug 2009 20-01-2018 Lecturer Deparment of Computer Sciecne, University of Dhaka 05, Feb 2006 03-08-2009 Lecturer Stamford University Bangladesh 04, Aug 2003 04-02-2006 Research Interest Subject Description Research Interest (Goal, Target Indicator) VANET security Analyzing various security issues of Vehicular Ad Hoc Networks (VANETs) and proposing solutions. IoT security Developing lightweight solutions for handling security issues of the Internet of Things (IoT). Cloud security Analysis of various cloud security issues and proposing solutions to protect users' data. Blockchain Applying blockchain to handle performance and data security issues. Applied Cryptography Study and implementation of cryptographic solutions for handling security and privacy issues of networks, cloud, IoT, etc. Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Masters Secure Handover Mechanism in 5G-enabled IoT Network Dr. Mosarrat Jahan Shaikhum Monira Security and privacy, IoT 2020 Masters Secure Data Sharing in Edge-enabled Vehicular Network Dr. Mosarrat Jahan Farhana Siddiqua Security and privacy, vehicular networks 2020 Masters Malicious Vehicle Detection using Trust based Mechanism in VANET Dr. Mosarrat Jahan Md Mahmudul Hasan Security and privacy, vehicular networks 2020 Research Project Report/Other Sybil Attack Detection in VANETs Dr. Mosarrat Jahan Md. Sadmin Tahmid Khan, Md. Saim Ahmmed Utsho 2024 Research Project Report/Other Application Type-2 Fuzzy System in VANETs Mosarrat Jahan Shaily Kabir Prodipta Sen Amartya, Sagar Karmakar 2023 Research Project Report/Other Security and Privacy Issues of Indoor Localization System Mosarrat Jahan Fariha Tanjim Shifat, Sayma Sarwar Ela 2023 Research Project Report/Other Intelligent Transportation Systems Mosarrat Jahan Upama Kabir abdullah al mamun, Tanzimul Hoque 2022 Research Project Report/Other Trust Management in Internet of Things Mosarrat Jahan Muhammad Ibn Ziauddin, Rownak Rahad Rabbi 2022 Research Project Report/Other Blockchain For handling Pandemic Dr. Upama Kabir Dr. Mosarrat Jahan Sakib Jobaid Alamin Hossain Security and privacy, Blockchain 2020 Research Project Report/Other IoT Authentication Dr. Upama Kabir Dr. Mosarrat Jahan Raihan Dewon Md. Rajib Hossain Security and Privacy, IoT 2020 Research Project Report/Other Sinkhole Attack Detection and Mitigation for Smart Home Dr. Mosarrat Jahan Dr. Upama Kabir Muntaha Tasnim Md. Shafiqul Islam Security and Privacy, IoT, WSN, Smarthome 2020 Research Project Report/Other Security Risk Assessment of IT Infrastructure Dr. Mosarrat Jahan Dr. Upama Kabir Arnab Paul Sanjoy Kumar Mahato Security and privacy 2020 Research Project Report/Other Network Log ManagementSystem using Blockchain Dr. Mosarrat Jahan Dr. Upama Kabir Mohammad Habibullah Rakib, Showkot Hossain Security and privacy, IoT, Blockchain 2019 Research Project Report/Other A Secure and Lightweight UserAuthentication Mechanism forWireless Body Area Network(WBAN) Dr. Mosarrat Jahan Fatema Zohra, Kamal Parvez Security and privacy, WBAN 2019 Research Project Report/Other An Energy-Efficient Data Aggregation Tree Construction Algorithm for Wireless Sensor Networks Dr. Mosarrat Jahan Md. Sajidul Islam, Imtiaz Rahim Energy-efficient wireless sensor networks 2014 Research Project Report/Other Energy-Efficient Methods to Maximize Network Lifetime in Wireless Sensor Networks with Adjustable Sensing Ranges Dr. Mosarrat Jahan Safwat Ali Khan, Zinat Ara Energy-efficient wireless sensor networks 2014 Research Project Report/Other Modified Centralized Set Cover based Approximation(CSCA) for Duty-Cycled Wireless Sensor Networks Dr. Mosarrat Jahan Shaily Kabir Rifatul Islam, Umama Tasnim Energy-efficient wireless sensor networks 2014 Research Project Report/Other Deep Reinforcement Learning to Improve Lane Change Dr. Mosarrat Jahan Ahnaf Tahmid, Raisa Islam Research Project Report/Other Sybil Attack detection in VANETs Dr. Mosarrat Jahan Md. Sadmin Tahmid Khan, Md. Saim Ahmmed Utsho Current Year Research Project Report/Other lane change behavior of autonomous vehicle Dr. Mosarrat Jahan Ahanf Tahmid, Raisa Islam Current Year Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration Computer Science and Engineering A Blockchain-Driven Scalable Contact Tracing Data Management Scheme:Bangladesh Perspective Centennial Research Grant (CRG), University of Dhaka 01-06-2021 31-12-2021 Dr. Upama Kabir, Dr. Mosarrat Jahan, Sakib Jobaid Computer Science and Engineering CyChain: A Blockchain Assisted Cyber Threat Detection Engine ICT Innovation Fund (2020-21), ICT division, Ministry of Post, Telecommunication and Information Technology, the People’s Republic of Bangladesh 01-01-2021 31-12-2021 Dr. Upama Kabir, Dr. Mosarrat Jahan, Mohammad Habibullah Rakib, Showkot Hossain Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year No Collaboration & Membership is found Journal Article 1 Farhana Siddiqua and Mosarrat Jahan : A Trust-Based Malicious RSU Detection Mechanism in Edge-Enabled Vehicular Ad Hoc Networks, Journal of the Asiatic Society of Bangladesh, Science , vol.51 , no.1 , pp.123--150 , 2025 . 2 Sakib Al Jobaid, Upama Kabir and Mosarrat Jahan : Scalable data management in global health crises: Leveraging blockchain technology, IET Blockchain , 2024 . 3 Md. Shafiqul Islam, Muntaha Tasnim, Upama Kabir and Mosarrat Jahan : Securing Smart Home against Sinkhole Attack using Weight-based IDS Placement Strategy, IET Wireless Sensor Systems , pp.1-19 , 2023 . 4 Md. Mahmudul Hasan, Mosarrat Jahan and shaily Kabir : A Trust Model for Edge-Driven Vehicular Ad Hoc Networks using Fuzzy Logic, IEEE Transactions on Intelligent Transportation Systems , vol.24 , no.12 IEEE , pp.1-14 , 2023 . View More 5 Mosarrat Jahan, Fatema Tuz Zohra, Md. Kamal Parvex, Upama Kabir, Abdul Mohaimen Al Radi and Shaily Kabir : An end-to-end authentication mechanism for wireless body area networks, Smart Health , vol.29 , no.100413 Elsevier , pp.1-16 , 2023 . View More 6 Raihan Dewon Eman, Mosarrat Jahan and Upama Kabir : A multi-device user authentication mechanism for Internet of Things, IET Networks , vol.12 , no.5 John Wiley & Sons, Inc. , pp.1--21 , 2023 . 7 Mosarrat Jahan, Suranga Seneviratne, Partha Sarathi Roy, Kouichi Sakurai, Aruna Seneviratne and Sanjay Jha : Light Weight and fine-grained Access Mechanism for Secure Access to Outsourced Data, Concurrency and Computation: Practice and Experience , 2018 . 8 Mosarrat Jahan, Mohsen Rezvani, Qianrui Zhao, Partha Sarathi Roy, Kouichi Sakurai, Aruna Seneviratne and Sanjay Jha : Light Weight Write Mechanism for Cloud Data, IEEE Transactions on Parallel and Distributed System , vol.29 , no.5 , pp.1131-1146 , 2018 . 9 Mosarrat Jahan, Shaily Kabir and Mohammad Asif Hossain Khan : A Modified Approach to Improve the Performance of Lazy Release Consistency (LRC) Model, The Dhaka University Journal of Science , vol.58 , no.1 , pp.49-53 , 2010 . 10 Hafiz Md. Hasan Babu, Md. Rafiqul Islam, Mosarrat Jahan and Mohammad Abdullah-Al-Wadud : A Heuristic Approach to Minimize the Multiple-Output Functions, The Dhaka University Journal of Science , vol.54 , no.5 , pp.7-10 , 2006 . 11 Shaikhum Monira, Upama Kabir, Mosarrat Jahan and Uchswas Paul : An Efficient Handover Mechanism for SDN-Based 5G HetNets, Dhaka University Journal of Applied Science and Engineering , vol.6 , no.2(2021) , pp.49 -- 58 , 2022 . 12 Mohammad Habibullah Rakib, Showkot Hossain, Mosarrat Jahan and Upama Kabir : A Blockchain-Enabled Scalable Network Log Management System, Journal of Computer Science , vol.18 , no.6 , pp.496--508 , 2022 . Conference Proceedings 1 Fariha Tanjim Shifat, Sayma Sarwar Ela and Mosarrat Jahan \"Securing WiFi Fingerprint-based Indoor Localization Systems from Malicious Access Points.\" 2025 IEEE 7th Symposium on Computers & Informatics (ISCI) , pp. 380-387. 2025 . 2 Prodipta S. Amartya, Shaily Kabir, Sagar C. K. Babu and Mosarrat Jahan \"An Interval Creation Approach to Construct Interval Type-2 Fuzzy Sets.\" 2024 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE) , pp. 1-9. IEEE, 2024 . 3 Mohammad Habibullah Rakib, Showkot Hossain, Mosarrat Jahan and Upama Kabir \"Towards Blockchain-Driven Network Log Management System.\" 2020 IEEE 8th International Conference on Smart City and Informatization (iSCI) , pp. 73-80. 2020 . 4 Kamal Parvez, Fatema Tuz Zohra and Mosarrat Jahan \"A secure and lightweight user authentication mechanism for wireless body area network.\" 6th International Conference on Networking, Systems and Security , pp. 139-143. Dhaka: 2019 . 5 Mosarrat Jahan, Suranga Seneviratne, Ben Chu, Aruna Seneviratne and Sanjay Jha \"Privacy preserving data access scheme for IoT devices.\" IEEE NCA 2017 , pp. 217-226. 2017 . 6 Mosarrat Jahan, Aruna Seneviratne and Sanjay Jha \"Access Mechanism for Outsourced Data by Preserving Data Owner’s Preference.\" IEEE LCN 2017 , pp. 611-614. 2017 . 7 Mosarrat Jahan, Partha Sarathi Roy",
  "content_length": 11550,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:53"
}