{
  "name": "Mosaddek Hossain Kamal Tushar",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1764",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Mosaddek Hossain Kamal (Professor) Department of Computer Science and Engineering Research Profile Social Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Electrical and Computer Engineering Concordia University Canada 2017 Masters Information Tecnology University of New South Wales Australia 2006 Masters Computer Science University of Dhaka Bangladesh 1996 Bachelor Applied Physics & Electronics University of Dhaka Bangladesh 1993 Title Organization Location From Date To Date NSERC Post Doctoral Fellow University of Toronto Toronto, Canada 01, Jan 2020 30-06-2022 Post Doctoral Fellow Concordia University Montreal, Concordia 01, May 2017 18-02-2018 Research Interest Subject Description Research Interest (Goal, Target Indicator) Intelligent system for Electric Vehicle Cloud Charging Infrastructure Embedded System for Industry Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Research Project Report/Other Autonomous VEhicle ECU for object Detection Dr. Mosaddek Hossain Kamal Tushar Current Year Research Project Report/Other Indutrial RS485 Network and ModBus Security Dr. Mosaddek Hossain Kamal Tushar Current Year Research Project Report/Other Variable Frequency Drive Dr. Mosaddek Hossain Kamal Tushar Current Year Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration No project/research work is found Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year 1 Asiatic Society Multidisciplinary Research Organization 2021 till today 2 IEEE Academic and Industry Research 2012 till today Journal Article 1 Mosaddek Hossain Kamal Tushar, Chadi Assi, Martin Maier and Mohammad Faisal Uddin : Smart Microgrids: Optimal Joint Scheduling for Electric Vehicles and Home Appliances, IEEE Transactions on Smart Grid , vol.5 , no.1 , pp.239-250 , 2014 . View More 2 Mosaddek Hossain Kamal Tushar, Adel W. Zeineddine and Chadi Assi : Demand-Side Management by Regulating Charging and Discharging of the EV, ESS, and Utilizing Renewable Energy, IEEE Transactions on Industrial Informatics , vol.14 , no.1 , pp.117-126 , 2018 . View More 3 Mosaddek H. K. Tushar, Chadi Assi and Martin Maier : Distributed Real-Time Electricity Allocation Mechanism for Large Residential Microgrid, IEEE Transactions on Smart Grid , vol.6 , no.3 , pp.1353-1363 , 2014 . View More 4 Mosaddek Hossain Kamal Tushar and Chadi Assi : Volt-VAR Control Through Joint Optimization of Capacitor Bank Switching, Renewable Energy, and Home Appliances, IEEE Transactions on Smart Grid , vol.9 , no.5 , pp.4077-4086 , 2017 . View More 5 Mosaddek Hossain Kamal Tushar and Chadi Assi : Optimal Energy Management and Marginal-Cost Electricity Pricing in Microgrid Network, IEEE Transactions on Industrial Informatics , vol.13 , no.6 , pp.3286-3298 , 2017 . View More 6 Ribal F. Atallah, Chadi M. Assi, Wissam Fawaz, Mosaddek Hossain Kamal Tushar and Maurice Jose Khabbaz : Optimal Supercharge Scheduling of Electric Vehicles: Centralized Versus Decentralized Methods, IEEE Transactions on Vehicular Technology , vol.67 , no.9 , pp.7896-7909 , 2018 . View More 7 Mohammad Ekramul Kabir, Chadi Assi, Mosaddek Hossain Kamal Tushar and Jun Yan : Optimal Scheduling of EV Charging at a Solar Power-Based Charging Station, IEEE Systems Journal , vol.14 , no.3 , pp.4221-4231 , 2020 . View More 8 Reem Kateb, Parisa Akaber, Mosaddek H. K. Tushar, Abdullah Albarakati, Mourad Debbabi and Chadi Assi : Enhancing WAMS Communication Network Against Delay Attacks, IEEE Transactions on Smart Grid , vol.10 , no.3 , pp.2738-2751 , 2019 . View More 9 Reem Kateb, Mosaddek Hossain Kamal Tushar, Chadi Assi and Mourad Debbabi : Optimal Tree Construction Model for Cyber-Attacks to Wide Area Measurement Systems, IEEE Transactions on Smart Grid , vol.9 , no.1 , pp.25-34 , 2018 . View More 10 Hyame Assem Alameddine, Mosaddek Hossain Kamal Tushar and Chadi Assi : Scheduling of Low Latency Services in Softwarized Networks, IEEE Transactions on Cloud Computing , vol.9 , no.3 , pp.1220-1235 , 2019 . View More 11 Rossi Kamal, Mosaddek Hossain Kamal, Muhammad Mostafa Monowar and Choong Seon Hong : A mobile middleware to solve interoperability problems in VOIP streaming session, International Journal of Communication Networks and Distributed Systems , vol.8 , no.1-2 InderScience , pp.1-12 , 2011 . View More Conference Proceedings 1 Hyame Assem Alameddine, Chadi Assi, Mosaddek Hossain Kamal Tushar and Jia Yuan Yu \"Low-Latency Service Schedule Orchestration in NFV-based Networks.\" 2019 IEEE Conference on Network Softwarization (NetSoft) , pp. 378-386. 2019 . View More 2 Sajib Kumar Mistry, Mosaddek Hossain Kamal and Dilip Mistry \"Semantic Discovery of Web Services through Social Learning.\" The 2012 Iberoamerican Conference on Electronics Engineering and Computer Science , pp. 167-177. 2012 . View More 3 Sheikh Muhammad Sarwar and Mosaddek Hossain Kamal \"Integration of Novel Image Based Features into Markov Random Field Model for Information Retrieval.\" 2012 26th International Conference on Advanced Information Networking and Applications Workshops , pp. 827-832. 2012 . View More 4 Mohammad Shahidul Hasan, Mosaddek Hossain Kamal and M Lutfar Rahman \"A NEW ADAPTIVE HYBRID ROUTING STRATEGY FOR DATAGRAM SERVICE.\" Int. Conf. on Computer and Information Technology (ICCIT2001) , pp. 4. Dhaka: 2001 . View More 5 Reem Kateb, Parisa Akaber, Mosaddek H. K. Tushar, Mourad Debbabi and Chadi Assi \"Delay aware measurements gathering in WAMS communication network.\" 2017 IEEE Global Conference on Signal and Information Processing (GlobalSIP) , pp. 1090-1094. 2017 . View More 6 Mosaddek Hossain Kamal Tushar and Chadi Assi \"Volt-VAR optimization by using electric vehicle, renewable energy and residential load-shifting.\" 2016 IEEE International Conference on Smart Grid Communications (SmartGridComm) , pp. 460-465. Dallas: 2016 . View More 7 Mosaddek Hossain Kamal Tushar and Chadi Assi \"Optimal electricity pricing in a microgrid network.\" 2016 IEEE/PES Transmission and Distribution Conference and Exposition (T D) , pp. 1-5. 2016 . View More Award Type Title Year Country Description International NSERC Post Doctoral Felloship 2020-2021 2020 Canada Currently Attach to ECE, University of Toronto The Postdoctoral Fellowships (PDF) program provides support to a core of the most promising researchers at a pivotal time in their careers. The fellowships are also intended to secure a supply of highly qualified Canadians with leading-edge scientific and research skills for Canadian industry, government, and academic institutions. for more: https://www.nserc-crsng.gc.ca/students-etudiants/pd-np/pdf-bp_eng.asp International Post Doctoral Felloship 2018 Canada International ENCS Doctoral Prize 2018 Canada Concordia University Best Ph.D. Thesis Award for 2017-2018. International PERSWARD NSERC-CRSNG Award 2016 Canada Dr. Mosaddek Hossain Kamal Professor Department of Computer Science and Engineering Faculty of Engineering and Technology Email: tushar@du.ac.bd Phone: 01700766184",
  "content_length": 7388,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:53"
}