{
  "name": "Moses Samson Charikar",
  "homepage": "https://profiles.stanford.edu/moses-charikar",
  "status": "success",
  "content": "Moses Charikar's Profile | Stanford Profiles Moses Charikar Donald E. Knuth Professor and Professor, by courtesy, of Mathematics Computer Science Print Profile Email Profile View Stanford-only Profile Tab Menu Bio Research & Scholarship Teaching Publications Bio Moses Charikar is the Donald E. Knuth professor of Computer Science at Stanford University. He obtained his PhD from Stanford in 2000, spent a year in the research group at Google, and was on the faculty at Princeton from 2001-2015. His research interests include: efficient algorithmic techniques for processing, searching and indexing massive high-dimensional data sets; efficient algorithms for computational problems in high-dimensional statistics and optimization problems in machine learning; approximation algorithms for discrete optimization problems with provable guarantees; convex optimization approaches for non-convex combinatorial optimization problems; low-distortion embeddings of finite metric spaces.His work won best paper awards at FOCS 2003, COLT 2017 and SODA 2024, the 10 year best paper award at VLDB 2017 and the 20 year test of time award at STOC 2022. He was jointly awarded the 2012 Paris Kanellakis Theory and Practice Award for his work on locality sensitive hashing, was named a Simons Investigator in theoretical computer science in 2014, and an ACM Fellow in 2021. Academic Appointments Professor, Computer Science Member, Bio-X Member, Wu Tsai Human Performance Alliance Honors & Awards ACM Fellow, ACM (2021) Paris Kanellakis Theory and Practice Award, ACM (2012) Simons Investigator in Theoretical Computer Science, Simons Foundation (2014) Alfred P. Sloan Fellowship, Sloan Foundation (2003) Distinguished Alumnus Award, IIT Bombay (2016) 20 year test of time award, STOC (2022) 10 year best paper award, VLDB (2017) Best paper award, COLT (2017) Best paper award, FOCS (2003) Boards, Advisory Committees, Professional Organizations Sloan Research Fellowships Selection Committee Member, Alfred P. Sloan Foundation (2022 - Present) Godel Prize Committee, ACM SIGACT (2015 - 2018) Scientific Advisory Board Member, Simons Institute for the Theory of Computing (2015 - 2018) Director, Center for Computational Intractability (2012 - 2014) Member, SIGACT Committee for the Advancement of Theoretical Computer Science (2011 - 2017) Member, ACM-SIAM SODA steering committee (2010 - 2012) Professional Education B.Tech., Indian Institute of Technology, Bombay, Computer Science and Engineering (1995) Ph.D., Stanford University, Computer Science (2000) Patents Moses Charikar, Deepa Ramakrishna. \"United States Patent 10,282,863 Lossless Compression of Fragmented Image Data\", EMC Corporation, May 7, 2019 Moses Charikar, Deepa Ramakrishna. \"United States Patent 10,249,059 Lossless Compression of Fragmented Image Data\", EMC Corporation, Apr 2, 2019 Moses Charikar, Deepa Ramakrishna. \"United States Patent 10,114,839 Format Identification for Fragmented Data\", EMC Corporation, Oct 30, 2018 Moses Charikar, Deepa Ramakrishna. \"United States Patent 9,684,974 Lossless compression of fragmented image data\", EMC Corporation, Jun 20, 2017 Moses Charikar, Deepa Ramakrishna. \"United States Patent 9,558,566 Lossless compression of fragmented image data\", EMC Corporation, Jan 31, 2017 Moses Charikar, Deepa Ramakrishna. \"United States Patent 9,495,390 Format identification for fragmented image data\", EMC Corporation, Nov 15, 2016 Moses Charikar, Deepa Ramakrishna. \"United States Patent 9,384,218 Format identification for fragmented image data\", EMC Corporation, Jul 5, 2016 Kai Li, Qin, Lv, Moses Charikar. \"United States Patent 7966327B2 Similarity search system with compact data structures\", The Trustees Of Princeton University, Jun 21, 2011 Ran Canetti, Moses Charikar, Sridhar Rajagopalan, S. Ravikumar, Amit Sahai, Andrew Tomkins. \"United States Patent US7222362B1 Non-transferable anonymous credentials\", IBM, May 22, 2007 Moses Charikar. \"United States Patent US7158961 B1 Methods and apparatus for estimating similarity\", Google, Inc, Dec 31, 2001 Contact Academic charikar@stanford.edu University - Faculty Department: Computer Science Position: Professor Additional Info Mail Code: 9045 ORCID: https://orcid.org/0000-0003-0807-3389 Links Curriculum Vitae PDF Google Scholar page DBLP page Semantic Scholar page Current Research and Scholarly Interests Efficient algorithmic techniques for processing, searching and indexing massive high-dimensional data sets; efficient algorithms for computational problems in high-dimensional statistics and optimization problems in machine learning; approximation algorithms for discrete optimization problems with provable guarantees; convex optimization approaches for non-convex combinatorial optimization problems; low-distortion embeddings of finite metric spaces. 2025-26 Courses Design and Analysis of AlgorithmsCS 161 (Win) Machine LearningCS 229, STATS 229 (Aut) Independent Studies (14) Advanced Reading and ResearchCS 499 (Aut, Win, Spr) Advanced Reading and ResearchCS 499P (Aut, Win, Spr) Curricular Practical TrainingCS 390A (Aut, Win, Spr) Curricular Practical TrainingCS 390B (Aut, Win, Spr) Curricular Practical TrainingCS 390C (Aut, Win, Spr) Independent ProjectCS 399 (Aut, Win, Spr) Independent ProjectCS 399P (Aut, Win, Spr) Independent WorkCS 199 (Aut, Win, Spr) Independent WorkCS 199P (Aut, Win, Spr) Part-time Curricular Practical TrainingCS 390D (Aut, Win, Spr) Ph.D. Research RotationCME 391 (Aut, Win, Spr) Senior ProjectCS 191 (Aut, Win, Spr) Supervised Undergraduate ResearchCS 195 (Aut, Win, Spr) Writing Intensive Senior Research ProjectCS 191W (Aut, Win, Spr) Prior Year Courses 2024-25 Courses Artificial Intelligence: Principles and TechniquesCS 221 (Spr) Design and Analysis of AlgorithmsCS 161 (Win) Machine LearningCS 229, STATS 229 (Aut) 2023-24 Courses Artificial Intelligence: Principles and TechniquesCS 221 (Spr) Design and Analysis of AlgorithmsCS 161 (Win) Machine LearningCS 229, STATS 229 (Aut) 2022-23 Courses Artificial Intelligence: Principles and TechniquesCS 221 (Spr) Design and Analysis of AlgorithmsCS 161 (Win) Machine LearningCS 229, STATS 229 (Aut) Stanford Advisees Doctoral Dissertation Reader (AC) Guy Blanc, Xiao Mao, Mohammad Roghani Doctoral Dissertation Advisor (AC) Prasanna Ramakrishnan Doctoral Dissertation Co-Advisor (AC) Ruiquan Gao, Alireza Haqi, Anna Thomas Master's Program Advisor Anthony Maltsev, Ahmed Sharaf, Yangyi Shen, Maggie Sun, Abhishek Vangipuram, Ramgopal Venkateswaran, Avery Voss, Anthony Zhan, Isaac Zhao Doctoral (Program) Chirag Pabbaraju, Aidan Perreault, Prasanna Ramakrishnan All Publications Improved Approximations for Ultrametric Violation Distance Charikar, M., Gao, R. edited by Woodruff, D. P. SIAM. 2024: 1704-1737 View details for Web of Science ID 001267398704013 A Quasi-Monte Carlo Data Structure for Smooth Kernel Evaluations Charikar, M., Kapralov, M., Waingarten, E. edited by Woodruff, D. P. SIAM. 2024: 5118-5144 View details for Web of Science ID 001267398702033 Distributed algorithms from arboreal ants for the shortest path problem. Proceedings of the National Academy of Sciences of the United States of America Garg, S., Shiragur, K., Gordon, D. M., Charikar, M. 2023; 120 (6): e2207959120 Abstract Colonies of the arboreal turtle ant create networks of trails that link nests and food sources on the graph formed by branches and vines in the canopy of the tropical forest. Ants put down a volatile pheromone on the edges as they traverse them. At each vertex, the next edge to traverse is chosen using a decision rule based on the current pheromone level. There is a bidirectional flow of ants around the network. In a previous field study, it was observed that the trail networks approximately minimize the number of vertices, thus solving a variant of the popular shortest path problem without any central control and with minimal computational resources. We propose a biologically plausible model, based on a variant of the reinforced random walk on a graph, which explains this observation and suggests surprising algorithms for the shortest path problem and its variants. Through simulations and analysis, we show that when the rate of flow of ants does not change, the dynamics converges to the path with the minimum number of vertices, as observed in the field. The dynamics converges to the shortest path when the rate of flow increases with time, so the colony can solve the shortest path problem merely by increasing the flow rate. We also show that to guarantee convergence to the shortest path, bidirectional flow and a decision rule dividing the flow in proportion to the pheromone level are necessary, but convergence to approximately short paths is possible with other decision rules. View details for DOI 10.1073/pnas.2207959120 View details for PubMedID 36716366 Fast Algorithms for a New Relaxation of Optimal Transport Charikar, M., Chen, B., Re, C., Waingarten, E. edited by Neu, G., Rosasco, L. JMLR-JOURNAL MACHINE LEARNING RESEARCH. 2023 View details for Web of Science ID 001222719105002 Single-Pass Streaming Algorithms for Correlation Clustering Behnezhad, S., Charikar, M., Ma, W., Tan, L. edited by Bansal, N., Nagarajan SIAM. 2023: 819-849 View details for Web of Science ID 001288501200118 Simple, Scalable and Effective Clustering via One-Dimensional Projections Charikar, M., Henzinger, M., Hu, L., Voetsch, M., Waingarten, E. edited by Oh, A., Neumann, T., Globerson, A., Saenko, K., Hardt, M., Levine, S. NEURAL INFORMATION PROCESSING SYSTEMS (NIPS). 2023 View details for Web of Science ID 001228825108037 A Characterization of List Learnability Charikar, M., Pabbaraju, C. edited by Servedio, R. A., Saha, B. ASSOC COMPUTING MACHINERY. 2023: 1713-1726 View details for DOI 10.1145/3564246.3585190 View details for Web of Science ID 001064640700139 p Local Density Estimation in High Dimensions MATHEMATICS OF OPERATIONS RESEARCH Wu, X., Charikar, M., Natchu, V. 2022 View details for DOI 10.1287/moor.20",
  "content_length": 37097,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:55"
}