{
  "name": "Mosharaf Chowdhury",
  "homepage": "http://www.mosharaf.com",
  "status": "success",
  "content": "Mosharaf Chowdhury Skip to content I am an Associate Professor of CSE at the University of Michigan, Ann Arbor, where I lead the SymbioticLab. CV | Bio | Students | Google Scholar | Software Interests: I am interested in large-scale systems for emerging AI/ML and Big Data workloads. Our recent projects include large model training systems for the cloud, understanding and optimizing the energy consumption of AI/ML workloads, and memory disaggregation over CXL. Impact: All SymbioticLab works are open source. We developed the first memory disaggregation software (Infiniswap), the first software-only GPU sharing system for deep learning (Salus), the largest federated learning benchmark platform and runtime (FedScale), and the first AI energy optimizer (Zeus). Our research has received several paper awards from top systems venues like NSDI, OSDI, ATC, and MICRO. I am one of the original co-creators of Apache Spark. My seminal works on coflow and virtual network embedding spawned two research directions that continue to be pursued by many. Teaching CSE 585: Advanced Scalable Systems for X [GenAI – W26, F25, F24] EECS 489: Computer Networks [W25, W24, F21, F20, F19, F18, W17] EECS 598: Systems for X [GenAI – W24] [AI – W21, W20] [Big Data – W19, F17] EECS 582: Advanced Operating Systems [F16, W16] Service Program Co-Chair NSF NeTS PI Meeting, 2023 NSF Workshop on Next Generation Cloud Research Infrastructure, 2019 Second Asia-Pacific Workshop on Networking (APNet), 2018 NSDI 2017 Posters Program Committees 2026: SOSP, MLSys 2025: OSDI, NSDI, SIGCOMM, TTODLer-FM 2024: MLSys, HotCarbon 2023: OSDI, MLSys 2022: SIGCOMM, HotCarbon 2021: OSDI, NSDI, SIGCOMM, NeurIPS Datasets and Benchmarks Track 2020: ICDCS 2019: NSDI, SIGCOMM, BigData, APNet, WORD, NSysS 2018: SIGCOMM, ICDCS 2017: NSDI, SIGCOMM, KBNets, APNet, NSysS 2016: CoNEXT, SIGCOMM Poster/Demo, ICCIT 2015: CoNEXT Student Workshop Associate Professor Director, SymbioticLab CSE, Michigan mosharaf@umich.edu Office: 4156 LEIN Google Scholar LinkedIn",
  "content_length": 2024,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:55"
}