{
  "name": "Mothy Roscoe",
  "homepage": "http://people.inf.ethz.ch/troscoe",
  "status": "success",
  "content": "Timothy Roscoe (Mothy) Timothy Roscoe (Mothy) troscoe@inf.ethz.ch Professor, Department of Computer Science, ETH Zürich ETH Zürich Systems Group STF H 314 Stampfenbachstrasse 114 8092 Zürich Switzerland [ Biography ] [ Teaching ] [ Publications ] [ Program committees ] Note: My name is Timothy, or Mothy, but not Tim. Why would it be Tim? I'm a systems research person: I build stuff. I'm part of the ETH Zürich Computer Science Department's Systems Group. My main research areas are operating systems, distributed systems, and networking, with some critical theory on the side. I have two main research interests right now: Building and using a research computer called Enzian for experimentation with hardware/software codesign for servers. Formally specifying the interface between real hardware and systems software, and using these specifications in the design of Operating systems for future machines that scale to thousands of cores, adapt to radically heterogeneous architectures, and handle the sheer complexity and diversity of modern hardware platforms. I recently have a joint keynote address at Usenix ATC and OSDI 2021 which seems to have generated some interest. You can find the video of the talk here, and a (slightly) cleaned up version of the slides here. Teaching We're always looking for talented research students who like hacking on large systems. We have a number of projects available in networking, distributed systems, FPGA-based hardware, and OS design and implementation. See the Systems Group web pages for a few ideas, but also email me - we often have more up-to-date proposals available. If you're thinking of applying for a position in the group: If you're interested in a postdoctoral position, following these instructions. If you're interested in pursuing a PhD in the group, follow the same instructions. Note that ETH Zurich generally requires you to already have a Masters degree. We do, however, have a so-called Direct Doctorate program for a limited number of high-quality Bachelor students, details are here. You may also find Steven Hand's excellent talk on Doing a Systems PhD useful (for here or elsewhere). If you're interested in a Masters degree, admissions are handled centrally in the department. See here for more information, including how to apply. If you specifically want to work with me for your Masters thesis, I suggest selecting the \"Distributed Systems\" track. If you want to simply do an internship, bear in mind that I only take interns under exceptional circumstances. Also, the number of applications I receive for internships is such that I cannot respond to most of them. Your best bet is to apply for our Summer research fellowship program. I generally teaching the following courses at ETHZ; details can be found on the Systems Group course page: Systems Programming and Computer Architecture Advanced Computer Systems Advanced Operating Systems Big Data, Law, and Policy Datacenter Networking Biography [short bio], [C.V. in A4], [C.V. in US letter] Timothy Roscoe has been a Full Professor in the Systems Group of the Computer Science Department at ETH Zurich since 2007. He works on operating systems, networks, and distributed systems, and in particular the Enzian research computer and its applications. He received a PhD in 1995 from the Computer Laboratory of the University of Cambridge, where he was a principal designer and builder of the Nemesis OS. After three years working on web-based collaboration systems at a startup in North Carolina, Mothy joined Sprint's Advanced Technology Lab in Burlingame, California in 1998, working on cloud computing and network monitoring, and spent time as an Industrial Fellow at the University of California at Berkeley Computer Science department, working with the Oceanstore project. He joined Intel Research at Berkeley in April 2002 as a principal architect of PlanetLab, an open, shared platform for developing and deploying planetary-scale services, and worked on Declarative Networking, while becoming an Adjunct Professor at Berkeley. In September 2006 he spent four months as a visiting researcher in the Embedded and Real-Time Operating Systems group at National ICT Australia in Sydney, which was developing the seL4 microkernel Since joining ETH Zurich he has also spent time at Microsoft Research, Intel Research, and the University of Washington. His work has included the Barrelfish multikernel research OS, as well as work on distributed stream processors, and using formal specifications to describe the hardware/software interfaces of modern computer systems. He was named Fellow of the ACM in 2013 for contributions to operating systems and networking research. Mothy's current research centers on Enzian, a powerful hybrid CPU/FPGA machine designed for research into systems software. Publications Full list in [HTML] or [BibTEX] Some selected recent published papers: The Design and Implementation of a Virtual Firmware Monitor, Charly Castes, François Costa, Neelu Shivprakash Kalani, Timothy Roscoe, Nate Foster, Thomas Bourgeat, Edouard Bugnion. SOSP '25: Proceedings of the 31st ACM symposium on Operating systems principles, Seoul, Republic of Korea, ACM Press, October 2025. [PDF] [DOI] Mainframe-style channel controllers for modern disaggregated memory systems, Zikau Liu, Jasmin Schult, Pengcheng Xu, Timothy Roscoe. Proceedings of the 16th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys '25), Seoul, South Korea, October 2025. [PDF] [DOI] The NIC should be part of the OS., Pengcheng Xu, Timothy Roscoe. HotOS XX: The ACM SIGOPS 20th Workshop on Hot Topics in Operating Systems, Banff, Alberta, Canada, ACM Press, May 2025, pp. 151-157. [PDF] [DOI] Rethinking Programmed I/O for Fast Devices, Cheap Cores, and Coherent Interconnects, Anastasiia Ruhzanskaia, Pengcheng Xu, David Cock, Timothy Roscoe. arXiv preprint, April 2025. [PDF] [DOI] Sockeye: a language for analyzing hardware documentation, Ben Fiedler, Samuel Gruetter, Timothy Roscoe. arXiv preprint, November 2025. [PDF] [DOI] Efeu: generating efficient, verified, hybrid hardware/software drivers for I2C devices, Daniel Schwyn, Zikai Liu, Timothy Roscoe. Proceedings of the ACM European Systems Conference (Eurosys 2025), Rotterdam, Netherlands, March 2025, pp. 76-93. [PDF] [DOI] Semi-open-state testing for in-silicon coherent interconnects, Jasmin Schult, Ben Fiedler, David Cock, Timothy Roscoe. Proceedings of Formal Methods in Computer-Aided Design (FMCAD), October 2024. [PDF] Generating Trustworthy Software/Hardware I2C Drivers, Daniel Schwyn, Zikai Liu, Timothy Roscoe. Proceedings of the seL4 Summit 2024, October 2024. [PDF] seL4 as a CPU Driver for an OS for Real Computers, Roman Meier, Zikai Liu, Ben Fiedler, Timothy Roscoe. Proceedings of the seL4 Summit 2024, October 2024. [PDF] Verified fault handling for modern BMCs, Ben Fiedler, Zikai Liu, David Cock, Timothy Roscoe. Proceedings of 20th International Conference on Formal Aspects of Component Software (FACS), September 2024. [PDF] High Throughput Hardware Accelerated CoreSight Trace Decoding, Matthew Edwin Weingarten, Nora Hossle, Timothy Roscoe. Proceedings of Design, Automation & Test in Europe Conference & Exhibition (DATE), March 2024. [PDF] Specifying the de-facto OS of a production SoC, Ben Fiedler, Roman Meier, Jasmin Schult, Daniel Schwyn, Timothy Roscoe. Proceedings of the 1st Workshop on Kernel Isolation, Safety and Verification (KISV '23), Association for Computing Machinery, New York, NY, USA, October 2023, pp. 18-25. [PDF] [DOI] Putting out the hardware dumpster fire, Ben Fiedler, Daniel Schwyn, Constantin Gierczak-Galle, David Cock, Timothy Roscoe. HotOS '23: Proceedings of the Workshop on Hot Topics in Operating Systems, June 2023, pp. 46-52. [PDF] [DOI] How to diagnose nanosecond network latencies in rich end-host stacks, Roni Haecki, Radhika Niranjan Mysore, Lalith Suresh, Gerd Zellweger, Bo Gan, Timothy Merrifield, Sujata Banerjee, Timothy Roscoe. NSDI '22: Proceedings of the 19th USENIX Symposium on Networked Systems Design and Implementation, USENIX Association, April 2022, pp. 861-877. [PDF] Enzian: an open, general, CPU/FPGA platform for systems software, David Cock, Abishek Ramdas, Daniel Schwyn, Michael Giardino, Adam Turowski, Zhenhao He, Nora Hossle, Dario Korolija, Melissa Licciardello, Kristina Martsenko, Reto Achermann, Gustavo Alonso, Timothy Roscoe. ASPLOS '22: Proceedings of the Twenty-Seventh International Conference on Architectural Support for Programming Languages and Operating Systems, February 2022. [PDF] [DOI] Declarative Power Sequencing, Jasmin Schult, Daniel Schwyn, Michael Giardino, David Cock, Reto Achermann, Timothy Roscoe. ACM Transactions on Embedded Computing Systems, ACM Press, New York, NY, USA, vol. 20, no. 5s, October 2021, pp. 1--21. [PDF] [DOI] A model-checked I2C specification, Lukas Humbel, Daniel Schwyn, Nora Hossle, Roni Häcki, Melissa Licciardello, Jan Schär, David Cock, Michael Giardino, Timothy Roscoe. Proceedings of the 27th International SPIN Symposium on Model Checking of Software, July 2021. [PDF] mmapx: uniform memory protection in a heterogeneous world, Reto Achermann, David Cock, Roni Haecki, Nora Hossle, Lukas Humbel, Timothy Roscoe, Daniel Schwyn. HotOS '21: Proceedings of the Workshop on Hot Topics in Operating Systems, June 2021, pp. 159–166. [PDF] [Video] [DOI] The Enzian Coherent Interconnect (ECI): Opening a coherence protocol to research and applications, Abishek Ramdas, David Cock, Timothy Roscoe, Gustavo Alonso. Proceedings of the 2021 Workshop on Languages, Tools, and Techniques for Accelerator Design (LATTE '21), April 2021. [PDF] Do OS abstractions make sense on FPGAs?, Dario Korolija, Timothy Roscoe, Gustavo Alonso. 14th USENIX Symposium on Operating Systems Design and Implementation (OSDI'20), USENIX Association, November 2020, pp. 991-1010. [PDF] [Video] Shared arrangements: practical inter-query sharing for streaming dataflows, Frank McSherry, Andrea Lattuada, Malte ",
  "content_length": 16976,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:59"
}