{
  "name": "Motonobu Kanagawa",
  "homepage": "https://sites.google.com/site/motonobukanagawa",
  "status": "success",
  "content": "Motonobu KanagawaSearch this siteEmbedded FilesSkip to main contentSkip to navigationMotonobu KanagawaI am an Assistant Professor (Maitre de Conférences) in the Data Science Department at EURECOM in France since 2019.  Previously, I was a research scientist at the University of Tuebingen and the Max Planck Institute for Intelligent Systems in Germany with Prof. Philipp Hennig (2017-2019). I obtained a PhD in 2016  at the Institute of Statistical Mathematics in Tokyo with Prof. Kenji Fukumizu.Research interests: Statistics, Machine Learning and SimulationSimulations enable understanding complex systems or phenomena appearing in many areas of science and engineering, such as climate, disasters, economics and finance.  A simulator's reliability, however, depends on various factors, such as the accuracy in approximating the system under analysis and the accuracy in numerical computation. One of my recent interests is statistical learning methods for automatically verifying those factors.   Contact InformationEurecom, 450 Route des Chappes, 06410 Biot, FranceEmail: motonobu.kanagawa [CHAN] eurecom.fr  (Please replace [CHAN] by @)NewsWe are organising the First International Conference on Probabilistic Numerics (ProbNum 2025) at EURECOM in southern France in Sep 2025 (https://probnum25.github.io/)Our paper ``Fast Computation of Leave-One-Out Cross-Validation for k-NN Regression'' has been accepted by Transactions of Machine Learning Research (2024)Our paper \"Comparing Scale Parameter Estimators for Gaussian Process Interpolation with the Brownian Motion Prior: Leave-One-Out Cross Validation and Maximum Likelihood\" has been accepted by the SIAM/ASA Journal on Uncertainty Quantification. (2024) I have been awarded the Chris Daykin Prize from the International Actuarial Association for our paper \"Intergenerational risk sharing in a defined contribution pension system: analysis with Bayesian optimization\", together with An Chen (Ulm University) and Fangyuan Zhang (EDHEC Business School).Our new paper \"Variable Selection in Maximum Mean Discrepancy for Interpretable Distribution Comparison\" is now available on arXiv (Nov 2023). Our new paper \"Comparing Scale Parameter Estimators for Gaussian Process Regression: Cross Validation and Maximum Likelihood'' is now available on arXiv (July 2023).Our new paper ``When is Importance Weighting Correction Needed for Covariate Shift Adaptation?'' is now available on arXiv (Mar 2023).Our paper ``Intergenerational Risk Sharing in a Defined Contribution Pension System: Analysis with Bayesian Optimization'' has been accepted by ASTIN Bulletin (March 2022)! Our new paper ``Improved Random Features for Dot Product Kernels'' is now available on arXiv (Jan 2022).We have written a new paper ``Intergenerational Risk Sharing in a Collective Defined-Contribution Pension System: A Simulation Study with Bayesian Optimization''  (June 2021). Our paper \"Counterfactual Mean Embeddings\" has been accepted by JMLR! (June 2021)A new preprint ``Connections and Equivalences between the Nyström Method and Sparse Variational Gaussian Processes'' is now available on arXiv (June 2021).I have been awarded a new chair position at the 3IA Cote d'Azur (a French national research institute on AI) (June 2021).We have significantly updated our preprint \"Counterfactual Mean Embeddings\", now containing several new results (Mar 2020). We are organizing Workshop on Functional Inference and Machine Intelligence at EURECOM on 17 - 19 Feb 2020. Our paper \"Simulator Calibration under Covariate Shift with Kernels\" has been accepted for publication at AISTATS 2020 (Jan 2020).A new preprint \"Simulator Calibration under Covariate Shift with Kernels\" has now been available (Oct 2019).Our paper \"\"Model-based Kernel Sum Rule: Kernel Bayesian Inference with Probabilistic Models\" has been accepted for publication in Machine Learning (Oct 2019).Our paper \"Convergence Guarantees for Adaptive Bayesian Quadrature Methods\" by Kanagawa and Hennig has been accepted for publication in NeurIPS 2019 (Sep 2019).I have moved to Eurecom and started working as an Assistant Professor! (Sep 2019)Our paper \"On the positivity and magnitudes of Bayesian quadrature weights\" by Karvonen, Kanagawa and Särkkä has been accepted for publication in Statistics and Computing (Aug 2018).A new preprint \"Convergence Guarantees for Adaptive Bayesian Quadrature Methods\" by M. Kanagawa and P. Hennig (27 May 2019)Our paper \"Convergence Analysis of Deterministic Kernel-Based Quadrature Rules in Misspecified Settings\" by Kanagawa, Sriperumbudur and Fukumizu has just been accepted for publication in Foundations of Computational Mathematics (30 Oct 2018)Academic ServicesEditorial Board Member of Journal of Machine Learning Research (JMLR)Reviewing service: TPAMI, Machine Learning, Statistics and Computing, JMLR, etc.AISTATS(2016,2019, 2020), ICML (2015,2017,2018,2019,2020), NeuIPS (2015,2016,2017,2018,2019,2020)Antibes, September 2019Tuebingen, April 2019 Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 5036,
  "method": "requests",
  "crawl_time": "2025-12-01 14:01:57"
}