{
  "name": "Mridula Singh",
  "homepage": "https://cispa.de/en/people/c01mrsi",
  "status": "success",
  "content": "Mridula Singh Send email Copy Email Address Faculty Mridula Singh Research Group Secure Connected and Mobile Systems Email Address Stuhlsatzenhaus 5 66123 Saarbrücken (Germany) Awards (selection) 2023: Busy Beaver Award \"Wireless and Mobile Security\" Further Information Mridula Singh on profiles.cispa Short Bio Dr. Mridula Singh is tenure-track faculty at CISPA Helmholtz Center for Information Security in Saarbruecken, Germany. She is interested in Wireless and System Security, focusing strongly on autonomous cyber-physical systems. Her interest in designing physical layer Message Time of Arrival Codes establishes the foundation of secure proximity-based access control and positioning systems. This work has been instrumental in enabling secure passive keyless entry and start systems of various car models. She is currently exploring the possibility of designing secure LiDAR sensors, LEO positioning, and scalable positioning systems. She co-founded Trishulam while pursuing her master's degree. She worked as a research engineer at Xerox Research Center India, where she was involved in smart transportation and healthcare projects. She received her master's degree in computer science from IIIT-Delhi, India, and her Ph.D in Computer Science from ETH Zurich, Switzerland. CV: Last stations Since 2021 Faculty at CISPA Helmholtz Center for Information Security 2016 – 2021 PhD in System Security at ETH Zurich 2014 – 2016 Research Engineer at Xerox Research Centre India at Xerox 2012 – 2014 Co-Founder Trishulam Publications by Mridula Singh Year 2025 2025-07-21 LEO-Range: Physical Layer Design for Secure Ranging with Low Earth Orbiting Satellites Conference / Medium Usenix Security Symposium (USENIX-Security) Tags Authors Daniele Coppola Arslan Mumtaz Giovanni Camurati Harshad Sathaye Mridula Singh Srdjan Capkun Full Paper Visit Detail Page Year 2023 2023-06-29 Location-independent GNSS Relay Attacks: A Lazy Attacker’s Guide to Bypassing Navigation Message Authentication Conference / Medium Conference on Wireless Network Security (WiSec) Tags Secure Connected and Mobile Systems Authors Maryam Motallebighomi Harshad Sathaye Mridula Singh Aanjhan Ranganathan Full Paper Visit Detail Page 2023-01-08 Invited Paper: Challenges and Opportunities in Enabling Secure 5G Positioning Conference / Medium International Conference on COMmunication Systems & NETworkS (COMSNETS) Tags Secure Connected and Mobile Systems Authors Aneet Kumar Dutta Mridula Singh Full Paper Visit Detail Page Year 2022 2022-04-01 V-Range: Enabling Secure Ranging in 5G Wireless Networks Conference / Medium Network and Distributed System Security Symposium (NDSS) Tags Secure Connected and Mobile Systems Authors Mridula Singh Marc Roeschlin Aanjhan Ranganathan Srdjan Capkun Full Paper Visit Detail Page",
  "content_length": 2798,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:01"
}