{
  "name": "Mridul Nandi",
  "homepage": "https://www.isical.ac.in/~mridul",
  "status": "success",
  "content": "Mridul Nandi Page Mridul Nandi Professor Applied Statistics Division Indian Statistical Institute C o n t a c t Who am I? I am Professor in the Applied Statistics Unit of the Indian Statitical Institute, Kolkata in India. My main research area in Symmetric Cryptography. My research focusses on cryptographic algorithms and security analysis. I did B.Stat (1999) and M.Stat (2001) and Ph.D (2005) from Indian Statistical Institute, Kolkata. Before joining Indian Statistical Institute, I was a Post-doc fellow in the CACR, Waterloo University (worked with Professor Douglas Stinson), Scientist in IPN, CINVESTAV, Mexico, visiting researcher in National Institute of Standard and Technology and George Washington University, USA. Please click on \"More Info\" for further details. M o r e I n f o R e s u m e Details Courses Awards Organizer Program Chair and Committee Members Invited Talks Books Important Publications Students Courses and Lecture Series Topic Course Year Cryptology M.Tech CS and M.Tech CrS, 1st Year Second Semester 2020 - 21 Algebra and Number Theory M.Tech CrS, 1st Year First Semester 2020 - 21 Advanced Cryptology M.Tech CrS, 2nd Year Third Semester 2020 - 21 Cryptology M.Tech CS, 2nd Year First Semester 2019 - 20, 2018 - 19,2017 - 18,Aug 2014 - Dec 2014 Basic Probability Theory M.Math 2nd Year First Semester 2019 - 20, July 2015 - Dec 2015, July 2013 - Dec 2013,July 2011 - Dec 2011 Advanced Cryptology M.Tech CS, 2nd Year Second Semester 2018 - 19, Jan 2015 - April 2015,Jan 2014 - April 2014 Algebra and Number Theory M.Tech CrS, 1st Year First Semester 2017 - 18 Number Theory B.Stat 3rd Year Second Semester 2017 - 18, 2016 - 17 Abstract Algebra B.Stat 2nd Year First Semester 2016-2017,Jan 2013 - April 2013 Graph Theory and Combinatorics M.Math 2nd Year Second Semester 2015-16 Linear Algebra-II B.Stat1st Year Second Semester Jan 2012 - April 2012 Probability and Stochastic Process M.Tech 1st year First Semester July 2012 - Dec 2012 Lecture Series 1 Coefficient H-Technique for research scholars July 2018 - Aug 2018 Lecture Series 1 Provable security of symmetric key for research scholars Sep 2016 - Nov 2016 Awards and Recognitions CAESAR Winner: ELmD (with Nilanjan Datta): A misuse resistant authenticated encryption. Submitted to CAESAR Competition, 2014. Currently named as COLM after merging with COPA and selected as a winner in \"Defense in Depth\" category of CAESAR. This work is also invited for publication of a special issue on Journal of Cryptology (submission in 2019). Invited Papers: - COFB (with Avik Chakraborti, Tetsu Iwata and Kazuhiko Minematsu). It was nominated as one of the best papers in CHES 2017 and invited for publication of Journal of Cryptology (Accepted in 2019). - COLM (with Nilanjan Datta and others) has been invited for publication to a special issue at the Journal of Cryptology (currently under review). NIST LWC Submissions: Designer of the following submissions to the NIST Standardisation Competition of Lightweight Authenticated Encryption and Hash Algorithms. (1) COMET (2) ESTATE (3) GIFT-COFB (4) HyENA (5) LOTUS-AEAD and LOCUS-AEAD (6) mixFeed (7) ORANGE (8) ORIBATIDA (9) PHOTON-Beetle and (10) SPOC. All these 10 algorithms have been selected for the second round (out of 32 algorithms). NIST Finalists: GIFT-COFB and PHOTON-Beetle Other CAESAR Submission:\tTriviA (with Avik Chakraborti): A streamcipher based authenticated encryption. Submitted to CAESAR Competition, 2014. It was selected for the second round. Awards: - Selected as one of the top three students for Shyama-Prasad Scholarship in 2001. - Indian National Mathematical Olympiad Awardee and participant of International Mathematical Olympiad Training Camp in 1995 and 1996. Erdős number is two (co-authored with Douglas Stinson). Organizer - Regional Mathematical Olympiad Coordinator for WB Region (2017, 2018, 2019 and 2020). - Member of Selection Committee of NIST Standardization Competition of Hash Algorithms (SHA3) (An US Federal Government Project Under Department of Commerce). - Organized Asian Symmetric Key Workshop, 2018 at Indian Statistical Institute, Kolkata. - Organized Winter School at ASU on Interplay between Statistics and Cryptology in Dec, 2014. - Organized Workshop on SHA3 and Its Evaluation in Dec, 2012. Program Chair - Program co-chair of SPACE 2019. - Program co-chair of Asian Symmetric Key Workshop 2018. - Program co-chair of Indocrypt 2012 (jointly with Steven Galbraith). Invitated Talks - Invited speaker on \"Current Trends in Cryptography\" CTCrypt 2020 - Invited as a keynote speaker of Indocrypt 2018. - Invited as a keynote speaker of SPACE 2018. - Invited Speaker for Asian Symmetric Key Workshop 2017. - Invited Speaker for Asian Symmetric Key Workshop 2016. - Invited Speaker for Asian Symmetric Key Workshop 2015. - Invited Speaker for Asian Symmetric Key Workshop 2014. Books Published 1.Pranab Chakraborty, Subhamoy Maitra, Mridul Nandi and Suprita Talnikar. Contact Tracing in Post-Covid World, Springer. https://doi.org/10.1007/978-981-15-9727-5, 2020. Books Edited 1. Shivam Bhasin, Avi Mendelson, Mridul Nandi: Security, Privacy, and Applied Cryptography Engineering - 9th International Conference, SPACE 2019, Gandhinagar, India, December 3-7, 2019, Proceedings. Lecture Notes in Computer Science 11947, Springer 2019. 2. Steven D. Galbraith, Mridul Nandi: Progress in Cryptology - INDOCRYPT 2012, 13th International Conference on Cryptology in India, Kolkata, India, December 9-12, 2012. Proceedings. Lecture Notes in Computer Science 7668, Springer 2012. Selected Publications This is the list of important publications. Please refer my resume for the full list of publications. Selected Journal Publications 1. Ashwin Jha; Mridul Nandi, Tight Security of Cascaded LRW2. Journal of Cryptology 33, pages1272–1317 (2020). (Link of the paper) 2. Ashwin Jha; Cuauhtemoc Mancillas-Lopez; Mridul Nandi; Sourav Sen Gupta. On random access of OCB. IEEE Transaction on Information Theory, 2019, 65(12), pp 8325-8344. (Link of the paper) 3. Avik Chakraborti, Tetsu Iwata, Kazuhiko Minematsu, Mridul Nandi. Blockcipher-based Authenticated Encryption: How Small Can We Go? Journal of Cryptology, 33, pages 703–741(2020) (Link of the paper) 4. Avik Chakraborti, Nilanjan Datta, Ashwin Jha, Cuauhtemoc Mancillas-Lpez, Mridul Nandi, Yu Sasaki. INT-RUP Secure Lightweight Parallel AE Modes. IACR Transaction on Symmetric Cryptology, 2019(4). pp 81-118. (Link of the paper) 5. Avik Chakraborti, Nilanjan Datta, Mridul Nandi. On the optimality of non-linear computations for symmetric key primitives. Journal of Mathematical Cryptology, 2018, 12(4), pp 241-259. (Link of the paper) 6. Nilanjan Datta; Avijit Dutta; Mridul Nandi; Goutam Paul. Double-block Hash-then-Sum: A Paradigm for Constructing BBB Secure PRF. IACR Transaction on Symmetric Cryptology. 2018(3), pp 36-92. (Link of the paper) 7. Mridul Nandi, Tapas Pandit. Verifiability-based conversion from CPA to CCA-secure predicate encryption. Applicable Algebra in Engineering, Communication and Computing, 2018, 29(1), pp 77-102. (Link of the paper) 8. Ashwin Jha, Mridul Nandi. On rate-1 and beyond-the-birthday bound secure online ciphers using tweakable block ciphers. Cryptography and Communications, 2018, 10(5), pp 731-753. (Link of the paper) 9. Avik Chakraborti, Nilanjan Datta, Mridul Nandi, Kan Yasuda. Beetle Family of Lightweight and Secure Authenticated Encryption Ciphers. IACR Transaction on Cryptographic Hardware Embedded System. 2018(2), pp 218-241. (Link of the paper) 10. Srimanta Bhattacharya, Mridul Nandi. Revisiting Variable Output Length XOR Pseudorandom Function. IACR Transaction on Symmetric Cryptology 2018(1), pp 314-335. (Link of the paper) 11. Ashwin Jha, Avijit Dutta, Mridul Nandi. A New Look at Counters: Don't Run Like Marathon in a Hundred Meter Race. IEEE Transaction on Computers, 2017, 66(11), pp 1851-1864. (Link of the paper) 12. Nilanjan Datta, Avijit Dutta, Mridul Nandi, Goutam Paul, Liting Zhang. Single Key Variant of PMAC Plus. IACR Transaction on Symmetric Cryptology 2017(4), pp 268-305. (Link of the paper) 13. Ashwin Jha, Mridul Nandi. Revisiting Structure Graphs: Applications to CBC-MAC and EMAC. Journal of Mathematical Cryptology, 2016, 10(3-4), pp 157-180. (Link of the paper) 14. Mridul Nandi, Tapas Pandit. On the Security of Joint Signature and Encryption Revisited. Journal of Mathematical Cryptology, 2016, 10(3-4), pp 181-221. (Link of the paper) 15. Eik List, Mridul Nandi. ZMAC+ - An Efficient Variable-output-length Variant of ZMAC. IACR Transaction on Symmetric Cryptology. 2017(4), pp 306-325. (Link of the paper) 16. Ritam Bhaumik, Mridul Nandi. OleF: an Inverse-Free Online Cipher. An Online SPRP with an Optimal Inverse-Free Construction. IACR Transaction on Symmetric Cryptology. 2016(2), pp 30-51. (Link of the paper) 17. Debrup Chakraborty, Mridul Nandi. Attacks on the Authenticated Encryption Mode of Operation PAE. IEEE Transaction on Information Theory 2015, 61(10): pp 5636-5642. (Link of the paper) 18. Mridul Nandi. An improved security analysis of OMAC. Journal of Mathematical Cryptology, 2009. Volume 3, Issue 2, Pages 133 - 148. (Link of the paper) 19. Mridul Nandi and Avradip Mandal. An Improved Security Analysis of PMAC. Journal of Mathematical Cryptology, 2008(2)2, pp 149 - 162. (Link of the paper) 20. Mridul Nandi and D. R. Stinson. Multicollision attacks on a class of generalized Sequential hash functions. IEEE Transactions on Information Theory, 2007 (53)2, pp 759 - 767. (Link of the paper) Selected Conference Publications 1. Mridul Nandi. Mind the Composition: Birthday Bound Attacks on EWCDMD and SoKAC21. (Link of the paper) 2. Avijit Dutta, Mridul Nandi, Suprita Talnikar: Beyond Birthday Bound Secure MAC in Faulty Nonce Model. EUROCRYPT 2019(1), pp 437-466. (Link of the paper) 3. Mridul Nandi. Bernstein Bound on WCS is Tight - Repairing Luykx-Preneel Optimal Forgeries. CRYPTO 2018(2), pp 213-238. (Link of the paper) 4. Gatan Leurent, Mridul",
  "content_length": 15107,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:01"
}