{
  "name": "Muchao Ye",
  "homepage": "https://cs.uiowa.edu/people/muchao-ye",
  "status": "success",
  "content": "Muchao Ye, Ph.D. | Computer Science - College of Liberal Arts and Sciences | The University of Iowa Skip to main content Muchao Ye, Ph.D. Assistant Professor Biography Muchao Ye is an Assistant Professor in Computer Science at the University of Iowa. He received his PhD from the College of Information Sciences and Technology at Pennsylvania State University in 2024. Before that, he obtained his Bachelor of Engineering degree in Information Engineering at South China University of Technology. His research interests lie in the intersection of AI, security, and healthcare, with a focus on improving AI safety from the perspective of adversarial robustness. His research works have been published in top venues including NeurIPS, KDD, AAAI, ACL, and the Web Conference.Research InterestsProfessor Ye's research interests are in the fields of machine learning and data mining. His recent research focuses on AI Safety with an emphasis on building robust and trustworthy deep neural networks for safety-critical applications. He has worked on topics including addressing the adversarial robustness issue of neural language models and designing deep learning methods in safety-critical applications (e.g., video anomaly detection and health risk prediction).Research Interests (Keywords)Artificial Intelligence; Machine Learning; AI SafetySelected PublicationsUniT: A Unified Look at Certified Robust Training against Text Adversarial Perturbation. Muchao Ye, Ziyi Yin, Tianrong Zhang, Tianyu Du, Jinghui Chen, Ting Wang, and Fenglong Ma. In the Thirty-seventh Conference on Neural Information Processing Systems (NeurIPS '23)PAT: Geometry-Aware Hard-Label Black-Box Adversarial Attacks on Text. Muchao Ye, Jinghui Chen, Chenglin Miao, Han Liu, Ting Wang, and Fenglong Ma. In the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD '23)LeapAttack: Hard-Label Adversarial Attack on Text via Gradient-Based Optimization. Muchao Ye, Jinghui Chen, Chenglin Miao, Ting Wang, and Fenglong Ma. In the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD '22)TextHoaxer: Budgeted Hard-Label Adversarial Attacks on Text. Muchao Ye, Chenglin Miao, Ting Wang, and Fenglong Ma. In the 36th AAAI Conference on Artificial Intelligence (AAAI '22)MedPath: Augmenting Health Risk Prediction via Medical Knowledge Paths. Muchao Ye*, Suhan Cui *, Yaqing Wang, Junyu Luo, Cao Xiao, and Fenglong Ma. In Proceedings of The Web Conference 2021. (* indicates equal contribution.)MedRetriever: Target-Driven Health Risk Prediction via Retrieving Unstructured Medical Text. Muchao Ye*, Suhan Cui*, Yaqing Wang, Junyu Luo, Cao Xiao, and Fenglong Ma. In Proceedings of the 30th ACM International Conference on Information and Knowledge Management (CIKM '21) (* indicates equal contribution.)LSAN: Modeling Long-term Dependencies and Short-term Correlations with Hierarchical Attention for Risk Prediction. Muchao Ye, Junyu Luo, Cao Xiao, and Fenglong Ma. In Proceedings of the 29th ACM International Conference on Information and Knowledge Management (CIKM '20)HiTANet: Hierarchical Time-Aware Attention Networks for Risk Prediction on Electronic Health Records. Junyu Luo, Muchao Ye, Cao Xiao, and Fenglong Ma. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '20)AnoPCN: Video Anomaly Detection via Deep Predictive Coding Network. Muchao Ye, Xiaojiang Peng, Weihao Gan, Wei Wu, and Yu Qiao. In Proceedings of the 27th ACM International Conference on Multimedia (ACM MM '19) Research areas Artificial Intelligence, Machine Learning, and Pattern Recognition Email muchao-ye@uiowa.edu Phone 319-467-1858 Website Personal Website, Google Scholar Contact Information Office Address 101F MacLean Hall (MLH) Iowa City, IA 52242 United States",
  "content_length": 3803,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:03"
}