{
  "name": "Muffy Thomas",
  "homepage": "http://www.dcs.gla.ac.uk/~muffy",
  "status": "success",
  "content": "Professor Muffy Calder FRSE FBCS FIEE- Computing Science, University of Glasgow Muffy Calder DBE OBE FREng FRSE FBCS University of Glasgow email:muffy.calder@glasgow.ac.uk Research in computational modelling and automated reasoning for concurrent, communicating systems; sensor-based systems; privacy intrusion and national security; responsible AI for policing. Senior Visiting Fellow at CETaS (Centre for Emerging Techology and Security). Trustee of Academy of Mathematical Sciences. RSE Women in Science Online Portrait Selected Recent Publications Practical Modelling with Bigraphs, Formal Aspects of Computing, 2025. Modelling Railway Networks with Bigraphs: Electrification, Failures, and Optimisation, 6th Intl Conf. on Reliability, Safety, and Security of Railway Systems, 2025. AI Proportionality Assessment Aid, IPCO Technology Advisory Panel, 2025. Privacy Intrusion and National Security in the Age of AI: assessing proportionality of automated analytics, CETaS Research Reports, Alan Turing Institute, 2023. Structured Framework for Assessing Proportionality of Privacy Intrusion of Automated Analytics, CETaS Research Reports, Alan Turing Institute, 2023. Quantitative Modelling and Analysis of BDI Agents, Software and Systems Modeling, 2023. Probabilistic Bigraphs, Formal Aspects of Computing, Vol. 34, Issue 2, ACM, 2022. DOI Previous roles: Vice-Principal and Head of College of Science and Engineering, University of Glasgow, Member of Prime Minister's Council for Science and Technology, Royal Society Leverhulme Research Senior Fellowship, Royal Society Wolfson Merit Research Award, Suffrage Science award in Computing Science and Mathematics, Chief Scientific Adviser for Scotland (Scottish Government), co-Chair of EU FET Science Advisory Group, chair of BCS School Curriculum and Assessment Committee, deputy chair REF 2021 Main Panel B, member of UKRI-EPSRC Council. Links Publications Research Projects Research Students Professional Responsibilities Imagine the Pandemic Without Computer Science Video Imagine the Pandemic Without Computer Science Poem Ode to women in Computing Biography Press and Media Why study Computing at school Photos and Fun Google Scholar Current/Recent Research Projects Responsible AI UK (RAI UK) UKRI-funded PROBabLE Futures:Probabilistic AI Systems in Law Enforcement Futures UKRI RAI Keystone project Ethical Review to Support Responsible AI in Policing - A Preliminary Study of West Midlands Police's Specialist Data Ethics Review Committee AHRC Bridging Responsible AI Divides (BRAID) project Science of Sensor System Software EPSRC programme grant Multi-Perspective Design of IoT Cybersecurity in Ground and Aerial Vehicles EPSRC Petras project A Population Approach to Ubiqcomp System Designs EPSRC programme grant Orcid number: 0000-0001-5033-7232",
  "content_length": 2812,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:06"
}