{
  "name": "Muhammed F. Esgin",
  "homepage": "https://research.monash.edu/en/persons/muhammed-esgin",
  "status": "success",
  "content": "Muhammed Esgin - Monash University XView Scopus Profile Muhammed Esgin Dr Senior Lecturer, Department of Software Systems & Cybersecurity https://orcid.org/0000-0003-1650-3748 EmailMuhammed.Esginmonashedu Accepting PhD StudentsPhD projectsLattice-based cryptography, zero-knowledge proofs, privacy-preserving protocols, blockchain protocols 20152025 Research activity per year Personal profile BiographyMuhammed is currently a lecturer at Faculty of Information Technology (FIT). Prior to this position, he was a post-doctoral researcher at Monash University and CSIRO's Data61 jointly. Before that, he did a research internship at IBM Research - Zurich, hosted by Vadim Lyubashevsky. He completed his PhD degree at Monash University in May 2020. Research interestsMuhammed's research is focused around cybersecurity and lies at the intersection of Mathematics and Computer Science. In particular, he is interested in various aspects of cryptography such as quantum-resistant cryptography, privacy-enhancing technologies (e.g. zero-knowledge proofs) and blockchain protocols. Supervision interestsInterested in supervision of students seeking a higher degree research in cryptography, blockchain protocols and/or applications of cryptographic tools (such as privacy-enhancing technologies) for the social good.Monash teaching commitmentMuhammed has had various teaching roles including tutor, admin tutor and lecturer of the following units: FIT3031 Network SecurityFIT9137 Introduction to Computer Architecture and NetworksFIT5163 Information and Computer SecurityFIT5124 Advanced Topics in SecurityFIT2093 Introduction to Cyber Security Education/Academic qualificationCybersecurity, Doctor of Philosophy, Practice-Oriented Techniques in Lattice-Based Cryptography, Department of Software Systems & CybersecurityAward Date: 12 May 2020 Research area keywordsCybersecurityCryptographyQuantum-Resistant CryptographyBlockchain Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2021 2021 2022 2023 2024 2025 2028 4 Finished 4 Active Projects per year Quantum-Resistant Oblivious Pseudorandom Functions for PracticeEsgin, M. (Primary Chief Investigator (PCI))19/06/25 → 31/12/25Project: Research Securing Privacy-Preserving: Securing Privacy-Preserving Cloud Computation Against Active AttacksSteinfeld, R. (Primary Chief Investigator (PCI)), Sakzad, A. (Chief Investigator (CI)), Esgin, M. (Chief Investigator (CI)) & Stehle, D. (Partner Investigator (PI))ARC - Australian Research Council, Monash University – Internal Faculty Contribution9/04/25 → 8/04/28Project: Research More Efficient: More Efficient and Scalable Post-Quantum Multi-SignaturesEsgin, M. (Primary Chief Investigator (PCI)), Steinfeld, R. (Chief Investigator (CI)), Yuen, J. (Chief Investigator (CI)) & Liu, J. (Chief Investigator (CI))1/08/24 → 31/12/25Project: Research Quantum Information Technology: Quantum Information Technology: Industry Readiness & ApplicationsSteinfeld, R. (Primary Chief Investigator (PCI)), simmons, M. (Chief Investigator (CI)), Usman, M. (Chief Investigator (CI)), Phung, D. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)), Pas, E. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Aleti, A. (Associate Investigator (AI)), Garcia De La Banda Garcia, M. (Associate Investigator (AI)), Nakashima, P. (Associate Investigator (AI)), Schmidt, D. (Associate Investigator (AI)), Esgin, M. (Associate Investigator (AI)) & Fay, J. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Practical Post-Quantum: Practical Post-Quantum Oblivious Pseudorandom Functions Supporting VerifiabilityEsgin, M. (Primary Chief Investigator (PCI)) & Steinfeld, R. (Chief Investigator (CI))Amazon Web Services Inc (United States of America)1/05/24 → 1/05/25Project: Research View all 8 projects Research output Research output per year 2015 2019 2020 2022 2023 2024 2024 21 Conference Paper 2 Chapter (Book) 1 Article 1 Review Article Research output per year Research output per year MatRiCT: efficient, scalable and post-quantum blockchain confidential transactions protocolEsgin, M. F., Zhao, R. K., Steinfeld, R., Liu, J. K. & Liu, D., Nov 2019, CCS'19 - Proceedings of the 2019 ACM SIGSAC Conference on Computer and Communications Security. Wang, X. & Katz, J. (eds.). New York NY USA: Association for Computing Machinery (ACM), p. 567-584 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 89 Citations (Scopus) Lattice-based zero-knowledge proofs: new techniques for shorter and faster constructions and applicationsEsgin, M. F., Steinfeld, R., Liu, J. K. & Liu, D., 2019, Advances in Cryptology – CRYPTO 2019 : 39th Annual International Cryptology Conference Santa Barbara, CA, USA, August 18–22, 2019 Proceedings, Part I. Boldyreva, A. & Micciancio, D. (eds.). Cham Switzerland: Springer, p. 115-146 32 p. (Lecture Notes in Computer Science ; vol. 11692 ).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 59 Citations (Scopus) Short lattice-based one-out-of-many proofs and applications to ring signaturesEsgin, M. F., Steinfeld, R., Sakzad, A., Liu, J. K. & Liu, D., 2019, Applied Cryptography and Network Security: 17th International Conference, ACNS 2019 Bogota, Colombia, June 5–7, 2019 Proceedings. Deng, R. H., Gauthier-Umaña, V., Ochoa, M. & Yung, M. (eds.). Cham Switzerland: Springer, p. 67-88 22 p. (Lecture Notes in Computer Science ; vol. 11464 ).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 45 Citations (Scopus) DualRing-PRF: Post-quantum (Linkable) Ring Signatures from Legendre and Power Residue PRFsZhang, X., Steinfeld, R., Liu, J. K., Esgin, M. F., Liu, D. & Ruj, S., 2024, Information Security and Privacy - 29th Australasian Conference, ACISP 2024 Sydney, NSW, Australia, July 15–17, 2024 Proceedings, Part II. Zhu, T. & Li, Y. (eds.). Singapore Singapore: Springer, p. 124-143 20 p. (Lecture Notes in Computer Science; vol. 14896).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 3 Citations (Scopus) Loquat: A SNARK-Friendly Post-quantum Signature Based on the Legendre PRF with Applications in Ring and Aggregate SignaturesZhang, X., Steinfeld, R., Esgin, M. F., Liu, J. K., Liu, D. & Ruj, S., 2024, Advances in Cryptology – CRYPTO 2024 - 44th Annual International Cryptology Conference Santa Barbara, CA, USA, August 18–22, 2024 Proceedings, Part I. Reyzin, L. & Stebila, D. (eds.). Cham Switzerland: Springer, p. 3-38 36 p. (Lecture Notes in Computer Science; vol. 14920).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 2 Citations (Scopus) View all 25 research outputs Activities Activities per year 2020 2020 2022 2022 2 Patents Activities per year CSIRO - Commonwealth Scientific and Industrial Research Organisation (External organisation)Esgin, M. (Member) & Steinfeld, R. (Member)23 Apr 2022Activity: Industry, Government and Philanthropy Engagement and Partnerships › Patents › Patent CSIRO - Commonwealth Scientific and Industrial Research Organisation (External organisation)Esgin, M. (Member)10 Dec 2020Activity: Industry, Government and Philanthropy Engagement and Partnerships › Patents › Patent",
  "content_length": 7732,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:11"
}