{
  "name": "Muhammad Ali Babar Abbasi",
  "homepage": "https://pure.qub.ac.uk/en/persons/muhammad-ali-babar-abbasi",
  "status": "success",
  "content": "Muhammad Ali Babar Abbasi - Queen's University Belfast View Scopus Profile Muhammad Ali Babar Abbasi Dr Reader, School of Electronics, Electrical Engineering and Computer ScienceInstitute of Electronics, Communications & Information Technology https://orcid.org/0000-0002-1283-4614 Phone+44 (0)28 9097 1810EmailM.Abbasiqub.acuk Room 01.053 - Queens Titanic Quarter (QTQ)United Kingdom Accepting PhD StudentsPhD projectsActive/passive microwave/millimeter-wave antennas (application specific)Beamformers (application specific)AI-inspired applied electromagnetism Metamaterials and transformation electromagnetics 20112025 Research activity per year Personal profile ParticularsI am a Reader (Associate Professor) at the Centre forWireless Innovation (CWI) at Queen's University Belfast since 2024. I joined CWI as a Postdoctoral Research Fellow in 2017 and later progressed to Lecturer and Senior Lecturer in 2019 and 2024, respectively. I earned my PhD under the prestigious Erasmus Mundus Doctoral Scholarship (now Marie‑Skłodowska‑Curie Actions) with the final degree awarded by Frederick University. I received my M.S. degree in Electrical Engineering from the National University of Sciences and Technology (NUST), SEECS, and my B.S. degree in Electrical (Telecommunication) Engineering from COMSATS-UI. I am a Senior Member IEEE, Senior Member URSI, Fellow of the UK Higher Education Academy, IEEE Antennas and Propagation Society (AP-S) Young Professional Ambassador, and IET Young Professional since 2024, 22, 22, and 17, respectively. I was honoured with the Grand Prize of the Mobile World Scholar Challenge at the Mobile World Congress (MWC) in 2019. My research grant portfolio as Principle Investigator and Co-Investigator includes academic ownership of over £1.66 million. Two funded PhD positions are available Position 1: Advanced Reconfigurable Beamforming Hardware at Millimeter-waves Application Deadline: 28 February 2025 (position offered) Start Date: 1 October 2025 Position open Position 2: Active Polarization Agile Spherical Retrodirective Antenna Application Deadline: 28 February 2025 (position offered) Start Date: 1 October 2025 Position open Research InterestsDevice physics level Microwave/millimeter-wave Active/passive antennas Metamaterials and transformation electromagneticsBeamformers and multi-antenna systemsComputational electromagnetics & Multiphysics Higher Level Telecoms Millimeter-wave hardware (beamformer and RIS)Multiple-input and multiple-output (MIMO) systemsSmart cooperative networks: like body areaPhysical-layer security schemes Modeling and Algorithms: AI-inspired applied electromagnetismAntenna array optimization (application specific ) ______________________________________ PhD Supervisor for: Alali, Bader Saad F, 25%, 01/04/2019 → 1/09/2024Larmour, Christopher, 75%, 30/09/2021 → …George Travers, 50%,  06/09/2023 → …Adam Beacom, 50%, 06/09/2023 → …Md Tarek Hassan, 25%, 02/01/2025 → …Zhang, Jiaming, 25%, 07/09/2022 → …Li, Aobo, 25%, 01/04/2022 → …Petit, Barnabas, 25%, 01/06/2023 → …Ebadi, Zohreh, 10%, 07/09/2022 → … TeachingELE3037 - High-Frequency Systems TechniqueELE2040 - Communications (Electromagnetics and Antennas)TMP1804 - Engineering Electromagnetic Field Fingerprint Dive into the research topics where Muhammad Ali Babar Abbasi is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 9 Similar Profiles Antenna Engineering 100% Frequencies Physics 77% Lenses Engineering 60% Arrays Physics 60% Antennas Computer Science 55% Direction of Arrival Physics 54% Performance Physics 47% Applications Engineering 47% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2023 2024 2024 8 Active Projects per year R1004ECS: Future Communications Hub in All-Spectrum Connectivity v2 (HASC Hub)Cotton, S. (PI), Abbasi, M. A. B. (CoI), Matthaiou, M. (CoI), Ngo, H.-Q. (CoI), Yurduseven, O. (CoI) & Zelenchuk, D. (CoI)25/06/2024 → …Project: Research R3432ECS: The EME (Electromagnetic Environment) HubYurduseven, O. (PI) & Abbasi, M. A. B. (CoI)30/04/2024 → …Project: Research R3433ECS: EME Deep Physical Layer in an EW context (Additional Research - DSTL)Abbasi, M. A. B. (PI), Malyuskin, O. (CoI), Matthaiou, M. (CoI) & Yurduseven, O. (CoI)24/04/2024 → …Project: Research R5278ECS: Research into Next Generation Information Networks (R-NGIN) Phase 2 FullCotton, S. (PI), Abbasi, M. A. B. (CoI), Buchanan, N. (CoI) & Yurduseven, O. (CoI)25/09/2023 → …Project: Research R3514ECS: REASON (Research on Enabling Architectures and Solutions for Open Networks)Cotton, S. (PI), Abbasi, M. A. B. (CoI), Matthaiou, M. (CoI), Ngo, H.-Q. (CoI), Yurduseven, O. (CoI) & Zelenchuk, D. (CoI)22/05/2023 → …Project: Research View all 8 projects Research output Research output per year 2011 2020 2023 2024 2025 2025 74 Conference contribution 62 Article 5 Chapter (peer-reviewed) 2 Paper 5 More 2 Letter 1 Other report 1 Chapter 1 Other contribution to conference Research output per year Research output per year A 3D-printing metasurface-augmented half-circle Maxwell fisheye lens for millimetre-wave analogue beamformingAlali, B., Zelenchuk, D. & Abbasi, M. A. B., 27 Jan 2025, In: Journal of Physics D: Applied Physics. 58, 4, 10 p., 045304.Research output: Contribution to journal › Article › peer-review Open AccessFile Metasurface 100% Millimeter Wave 100% Beamforming 100% Three Dimensional Printing 100% Beamformer 60% 29 Downloads (Pure) Advanced near-field radar imaging approaches in security: an overview on signal processing challenges, opportunities and future directionsMolaei, A. M., Hu, S., Fusco, V., Fromentèze, T., Kumar, R., Abbasi, M. A. B. & Yurduseven, O., 01 Jan 2025, In: IEEE Signal Processing Magazine. 42, 1, p. 126-146 21 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Radar Imaging 100% Signal Processing 100% Image Reconstruction 100% Antenna 100% Millimeter Wave 66% 2 Citations (Scopus) 96 Downloads (Pure) A polarization insensitive wideband 1-bit RIS unit cell design using printed dipolesSaikia, M., Garcia Fernández, M., Álvarez Narciandi, G., Abbasi, M. A. B. & Yurduseven, O., 20 Mar 2025, IEEE Microwaves, Antennas, and Propagation Conference (MAPCON 2024): Proceedings. Institute of Electrical and Electronics Engineers Inc., 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Surface Design 100% Incidence Angle 66% 9 Downloads (Pure) A reconfigurable ultra-wideband antenna for intelligent sensing and signal filteringSaleem, I., Abbasi, M. A. B., Quddious, A., Bilal, A., Mukhopadhyay, S., Inaltekin, H. & Abbas, S. M., 16 May 2025, 2024 17th International Conference on Sensing Technology (ICST): Proceedings. Institute of Electrical and Electronics Engineers Inc., (Proceedings of the International Conference on Sensing Technology, ICST).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Radiology Information System 100% Ultra-Wideband 100% UWB antenna 100% Antenna 100% Data Processing 50% 14 Downloads (Pure) A survey on security of terahertz communicationsSingh, R., Ahmad, I., Abbasi, M. A. B. & Kokkoniemi, J., 12 Jun 2025, 2024 IEEE Future Networks World Forum (FNWF 2024): Proceedings. Institute of Electrical and Electronics Engineers Inc., p. 317-324 8 p. (IEEE Future Networks World Forum: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 6G 100% Terahertz 100% Potential Solution 50% Security Challenge 50% side-channel 50% View all 148 research outputs Datasets Maxwell Fisheye Lens Based Retrodirective Array Abbasi, M. A. B. (Creator) & Fusco, V. (Creator), Queen's University Belfast, 2019DOI: 10.17034/e5ccb5a1-87c8-4481-b678-8b625c9b09f5Dataset File Animated Electric Field Radiated From Millimeter-wave Circular Antenna ArrayAbbasi, M. A. B. (Creator), Assimonis, S. (Creator) & Fusco, V. (Creator), Queen's University Belfast, Oct 2020DOI: 10.17034/426d6261-0404-4423-99c6-0e1711f5be0bDataset File Lens–Based Beamformer for Low–Complexity Millimeter–Wave Cellular SystemsAbbasi, M. A. B. (Creator), Queen's University Belfast, 04 Mar 2019DOI: 10.17034/70eb11c8-e844-4707-bf3d-265e04c897aeDataset File Compressive Sensing Multiplicative Antenna ArrayAbbasi, M. A. B. (Creator), Queen's University Belfast, 04 Mar 2019DOI: 10.17034/b019ed26-d290-4985-8b46-92ea6aaf732bDataset File Target Location Using Dual Beam Directional Modulated Circular ArrayAbbasi, M. A. B. (Creator), Queen's University Belfast, 04 Mar 2019DOI: 10.17034/0ae2ed70-1fee-4bac-81c9-f0188e49f72eDataset File View all 11 datasets Prizes 2022 IEEE AP-S YP AmbassadorAbbasi, M. A. B. (Recipient), 2022Prize: Appointment Programs 100% Antennas 100% All-Ireland URSI Commission B Official MemberAbbasi, M. A. B. (Recipient), 2022Prize: Appointment Development 100% Images 100% Frequency Domain 100% Computer Simulation 100% Innovation 100% Best Paper Award - UCET 2019Abbasi, M. A. B. (Recipient), 2019Prize: Prize (including medals and awards) Paper 100% Gold Medal and Outstanding Achievement AwardAbbasi, M. A. B. (Recipient), 2016Prize: Prize (including medals and awards) Education 100% Universities 100% Achievement 100% President 100% Awards 100% Grand Prize Winner - Mobile World Scholar Challenge 2019Abbasi, M. A. B. (Recipient), 2019Prize: Prize (including medals and awards) View all 9 prizes Activities Activities per year 2016 2019 2021 2024 11 Editorial activity 11 Invited talk 5 Oral presentation 3 Participation in conference 8 More 3 Invited or keynote talk at national",
  "content_length": 11913,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:06"
}