{
  "name": "Muhammad Haris Khan",
  "homepage": "https://mbzuai.ac.ae/study/faculty/muhammad-haris-khan",
  "status": "success",
  "content": "Muhammad Haris Khan - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Muhammad Haris Khan Muhammad Haris Khan Assistant Professor of Computer Vision Research Interests Professor Khan’s research interests span active topics in computer vision, including face-related tasks, visual domain adaptation and generalization, and visual tracking. He is also interested in unsupervised learning for instance-level to dense prediction tasks to leverage vast amounts of unlabeled data and human-object interaction detection tasks for a deeper understanding of human behaviors. Email Share Prior to joining MBZUAI, Professor Khan was a research scientist in the Inception Institute of Artificial Intelligence (IIAI), UAE. Before joining IIAI, he served as an assistant professor at Comsats University Islamabad (CUI), Pakistan for two years. Earlier, he was a postdoctoral fellow at the University of Nottingham (UoN), United Kingdom for 1.5 years. Prior to starting his Ph.D., he also served as a lecturer for three years at CUI, Pakistan. He is a recipient of the International Research Excellence Scholarship for his doctoral study. Ph.D. in computer vision from the University of Nottingham (UoN), United Kingdom. Master’s in embedded digital systems from University of Sussex, United Kingdom. Several publications in top-tier computer vision venues, including CVPR, ICCV, and NeurIPS - 2015-2022 Outstanding reviewer recognition in CVPR 2021 Best Workshop Paper Award 2013 Best Paper Award 2009 International Research Excellence Scholarship from University of Nottingham for three years Ph.D. study - 2011 Bronze medal for achieving 3rd position in Computer Engineering - 2006 Awarded Honorarium twice during employment - 2009-2010 Publication Muhammad Haris Khan Khan has authored and co-authored several papers in top-ranked computer vision conferences. His overall peer-reviewed research has more than 2700 citations. Muhammad Zaigham Zaheer, Arif Mehmood, Muhammad Haris Khan, Mattia Segu, Fisher Yu, Seung-Ik Lee, “Generative Cooperative Learning for Unsupervised Video Anomaly Detection”. Accepted at IEEE/CVF (CVPR) 2022. Muhammad Saad Saeed, Muhammad Haris Khan, Shah Nawaz, Muhammad Haroon Yousaf, Alessio Del Bue, “Fusion and Orthogonal Projection for Improved Face-Voice Association”, Accepted at IEEE ICASSP 2022. Muhammad Akhtar Munir, Muhammad Haris Khan, Muhammad Saquib Sarfraz, Mohsen Ali, “Synergizing between Self-Training and Adversarial Learning for Domain Adaptive Object Detection”, Proc. NeurIPS 2021. Muhammad Haris Khan, Talha Zaidi, Salman Khan, Fahad Shahbaz Khan, “Mode-Guided Feature Augmentation for Domain Generalization”, Proc. BMVC 2021. Muhammad Haris Khan, John McDonagh, Salman Khan, Muhammad Shahabuddin, Aditya Arora, Fahad Shahbaz Khan, Ling Shao, and Georgios Tzimiropoulos, “AnimalWeb: A Large-Scale Hierarchical Dataset of Annotated Animal Faces”. Proc. IEEE/CVF (CVPR) 2020. Tiancai Wang, Rao Muhammad Anwer, Muhammad Haris Khan, Fahad Shahbaz Khan, Yanwei Pang, Ling Shao, Jorma Laaksonen, “Deep Contextual Attention for Human-Object Interaction Detection”, Proc. ICCV 2019. Google Scholar Intelligent Visual Analytics Lab ResearchGate Related Wednesday, November 19, 2025 Towards open and scalable AI-powered waste detection Research by MBZUAI's Muhammad Haris Khan showed that fine-tuning modern waste detectors more than doubled their performance… fine-tuning waste BMVC detectors ML research machine learning Read more Tuesday, August 12, 2025 Detecting deepfakes in the presence of code-switching MBZUAI researchers tackle the challenge of detecting deepfakes when people mix Arabic and English in the same… nlp natural language processing computer vision dataset Arabic language Arabic code switching deep fake Deepfakes prompting Read more Saturday, September 17, 2022 27 papers accepted at NeurIPS MBZUAI faculty and researchers have 27 academic papers accepted at the 36th Conference on Neural Information Processing… research conference neurips Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 5651,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:08"
}