{
  "name": "Muhammad Ikram 0001",
  "homepage": "https://researchers.mq.edu.au/en/persons/muhammad-ikram",
  "status": "success",
  "content": "Muhammad Ikram - Macquarie University Muhammad Ikram public CV View Scopus Profile Muhammad Ikram Dr Senior Lecturer, School of ComputingFuture Communications Research Centre https://orcid.org/0000-0003-2113-3390 Phone+61 2 9850 8439Emailmuhammad.ikrammq.eduau h-index 711 Citations 13 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20082025 Research activity per year Personal profile BiographyDr Muhammad Ikram is a Senior Lecturer in Cybersecurity at the School of Computing, Macquarie University. He is a member of the Information Security and Privacy (ISP) group at Macquarie University and a Project Lead at Macquarie Cybersecurity Hub (MCHUB). Before joining Macquarie University, he was a joint postdoctoral research fellow at the University of Michigan (USA) and Macquarie University. He completed his PhD in Electrical Engineering and Telecommunication from UNSW, Master in Information and Computer Engineering from Ajou University (Korea), and Bachelor in Computer Engineering from the University of Engineering and Technology Peshawar (Pakistan). Ikram's current research interests are focused on data-driven analysis of privacy and security issues in mobile and Web applications. He has been thinking and working to build techniques leveraging machine-learning algorithms to fight against security and privacy issues and fraud detection targeting online services. Ikram has published more than 30 high-quality publications in top-notched conferences（Usenix Security [A*-ranked, 1], NDSS [A*-ranked, 1], WWW [A*-ranked, 1, 2], IMC [A-ranked, 1], PETS [A-ranked, 1], and AsiaCCS [A-ranked, 1]) and journals (ACM Transaction on Privacy and Security [1, 2], ACM Communications, and The British Medical Journal [Impact Factor: 30.223, 1]. Awarded The Best Paper Award by ACM Asia Computer Communication Security (AsiaCCS) in 2019 and The Outstanding Paper Award by European Alliance for Innovation (EAI) Mobile and Ubiquitous Systems (Mobiquitous) in 2021. Ikram's has been regularly interviewed by news and media outlets (e.g., The Guardian) and his work has been featured in top security and privacy magazines. For instance, his work on Web resource loading has been featured by more than 50 news and media outlets reaching to ~11 million audiences. Ikram is serving as a technical program committee member (WWW [A*-ranked], PETS [A-ranked]), reviewer (CCS [A*-ranked], PETS), and organizer (PETS) of top security and privacy conferences. Research interestsSystem and Network Security Trustworthiness of mobile VPN systems [1], Microsegmentation [1],  iOS apps assessment [1] Measurement of Security and Privacy Issues in Web and Mobile Platforms Web Platform: Tracking prevention [1, 2], risks of resource loading from implicitly trusted resources [1, 2], Vulnerabilities [1]Mobile Platform: iOS apps assessment [1], Mobile health apps [1, 2] Vulnerabilities and Malware Detection Longitudinal analysis of malicious activities [1], DaDiDroid [1] Education/Academic qualificationElectrical Engineering and Telecommunication, PhD, Design and analysis of secure and privacy preserving systems, The University of New South Wales1 Sept 2014 → 16 May 2018Award Date: 16 May 2018Information and Communication Engineering, Master of Science, Power efficient clustering for wireless multimedia sensor network, Ajou University19 Mar 2008 → 22 Feb 2010Award Date: 22 Feb 2010Computer Engineering, Bachelor of Science, Simulation and implementation of CDMA transceiver., NWFP University of Engineering and Technology16 Dec 2002 → 1 May 2007Award Date: 1 May 2007 External positionsResearch Scientist, Networks Research Group Data611 Sept 2019 → 1 Oct 2020Postdoc Researcher, University of Michigan1 Jul 2018 → 31 Aug 2019 Fingerprint Dive into the research topics where Muhammad Ikram is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Security and Privacy Computer Science 100% Malware Computer Science 75% Obfuscation Computer Science 54% Online Social Network Computer Science 48% Research Community Computer Science 42% Mobile App Computer Science 40% COVID-19 Computer Science 39% Android (Operating System) Computer Science 38% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2016 2016 2018 2020 2023 3 Finished Projects per year The obligation of telecommunications service providers to provide ‘clean pipes’De Vos, M. (Chief Investigator), Selvadurai, N. (Primary Chief Investigator) & Ikram, M. (Chief Investigator)1/06/20 → 30/09/22Project: Research MISC_University of Michigan: Server-Side Blocking: Watching provider discriminationIkram, M. (Chief Investigator)1/07/18 → 31/12/19Project: Research MQCSH: Macquarie University Cyber Security HubKaafar, D. (Primary Chief Investigator), Selvadurai, N. (Primary Chief Investigator), Wiggins, M. (Primary Chief Investigator), Sheedy, E. (Primary Chief Investigator), Asghar, H. (Chief Investigator), Ikram, M. (Chief Investigator), Shevchenko, P. (Chief Investigator), Berkovsky, S. (Chief Investigator), Bayl-Smith, P. (Chief Investigator), Zhang, X. (Chief Investigator), Yang, J. (Chief Investigator), Modabber-Moghadam, S. (Coordinating Investigator) & Goldbarsht, D. (Project Leader)2/12/16 → 30/06/23Project: Research Research Outputs Research output per year 2008 2022 2023 2024 2025 2025 33 Conference proceeding contribution 20 Article 13 Paper 1 Commissioned report 4 More 1 Chapter 1 Review article 1 Other contribution 1 Preprint Research output per year Research output per year iOS, your OS, everybody's OS: vetting and analyzing network services of iOS applicationsTang, Z., Tang, K., Xue, M., Tian, Y., Chen, S., Ikram, M., Wang, T. & Zhu, H., 2020, Proceedings of the 29th USENIX Security Symposium. Berkeley, CA: USENIX Association, p. 2415-2432 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open AccessFile Network Service 100% iOS (Operating System) 100% Security and Privacy 14% Denial-of-Service 14% Network Connection 14% 17 Citations (Scopus) 127 Downloads (Pure) Measuring and analysing the chain of implicit trust: a study of third-party resources loadingIkram, M., Masood, R., Tyson, G., Kaafar, M. A., Loizon, N. & Ensafi, R., Apr 2020, In: ACM Transactions on Privacy and Security (TOPS). 23, 2, p. 1-27 27 p., 8.Research output: Contribution to journal › Article › peer-review Open Access Dependency Chain 100% Malware 20% External Resource 20% Javascript Code 20% Decentralized control: a case study of RussiaRamesh, R., Raman, R. S., Bernhard, M., Ongkowijaya, V., Evdokimov, L., Edmundson, A., Sprecher, S., Ikram, M. & Ensafi, R., 2020, Proceedings, 2020 Network and Distributed System Security Symposium. Reston, VA: Internet Society, p. 1-18 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open Access Data Center 100% Case Study 100% Decentralized Control 100% Control Information 100% IT Infrastructure 100% 51 Citations (Scopus) A decade of mal-activity reporting: a retrospective analysis of Internet malicious activity blacklistsZhao, B. Z. H., Ikram, M., Asghar, H. J., Kaafar, M. A., Chaabane, A. & Thilakarathna, K., Jul 2019, Proceedings of the 2019 ACM Asia Computer Communication and Security (AsiaCCS). New York: Association for Computing Machinery (ACM), p. 193-205 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open Access Malicious Activity 100% Retrospective Analysis 100% Learning System 100% Machine Learning 50% Autonomous System 50% 20 Citations (Scopus) Mobile health and privacy: cross sectional studyTangari, G., Ikram, M., Ijaz, K., Kaafar, M. A. & Berkovsky, S., 2021, In: The BMJ. 373, p. 1-12 12 p., n1248.Research output: Contribution to journal › Article › peer-review Open AccessFile User Data 100% Sectional Study 100% Privacy Policy 60% Mobile Platform 20% Outcome Measure 20% 114 Citations (Scopus) 111 Downloads (Pure) View all 71 research outputs Prizes ACM AsiaCCS 2019 Best Paper AwardZhao, B. Z. H. (Recipient), Ikram, M. (Recipient), Asghar, H. (Recipient), Kaafar, M. A. (Recipient), Abdelberi, C. (Recipient) & Thilakarathna, K. (Recipient), 10 Jul 2019Prize: Other distinction File Computer Security 100% Computer Network 100% Communication Security 33% Security Conference 33% Malicious Activity 33% Longitudinal Compliance Analysis of Android Applications with Privacy PoliciesIkram, M. (Recipient), 10 Nov 2021Prize: Other distinction File Privacy Policy 100% Android Application 100% Mobile Application 33% Collect Information 16% Dynamic Analysis 16% Best Paper AwardMasood, R. (Recipient), Ogundoyin, S. (Recipient) & Ikram, M. (Recipient), 31 Oct 2013Prize File Privacy Control 100% Activities Activities per year 2020 2020 2021 2021 1 Other 1 Invited talk 1 Presentation Activities per year Obfuscation Resilient Malware DetectionIkram, M. (Speaker)20 Oct 2021Activity: Talk or presentation › Presentation Analyzing vulnerabilities and security issues in mobile applicationsIkram, M. (Speaker)1 Sept 2021Activity: Talk or presentation › Invited talk Submission to the NSW Legislative Council Inquiry into Cybersecurity, Dali Kaafar, Hassan Jameel Asghar, Muhammad Ikram, Niloufer Selvadurai, 2020.Kaafar, D. (Participant), Asghar, H. (Participant), Ikram, M. (Participant) & Selvadurai, N. (Participant)2020Activity: Other Press/Media The privacy of health applications in the spotlight: where does our data go?Ikram, M.2/07/221 Media contributionPress/Media",
  "content_length": 10145,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:08"
}