{
  "name": "Muhammad Fahim",
  "homepage": "https://pure.qub.ac.uk/en/persons/muhammad-fahim",
  "status": "success",
  "content": "Muhammad Fahim - Queen's University Belfast View Scopus Profile Muhammad Fahim Dr Senior Lecturer, School of Electronics, Electrical Engineering and Computer Science Phone+44 (0)28 9097 5431EmailM.Fahimqub.acuk Room 01.003 - Computer Science BuildingUnited Kingdom 20102025 Research activity per year Personal profile Research InterestsMy research interest includes AI in healthcare with a primary focus on healthy aging. My core expertise includes machine & deep learning models, time-series prediction, and data analytics. I am also interested in collaborating in multidisciplinary research projects to embed AI with societal impact. Fingerprint Dive into the research topics where Muhammad Fahim is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Models Computer Science 100% Smartphones Computer Science 57% Activity Recognition Computer Science 56% Application Computer Science 52% Energy Consumption Computer Science 34% Anomaly Detection Computer Science 32% Accuracy Computer Science 32% Long Short-Term Memory Network Computer Science 26% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2023 2023 2023 2 Active Projects per year R3511ECS: TUDOR: Towards Ubiquitous 3D Open Resilient NetworkDuong, T. Q. (PI), Fahim, M. (CoI), Garcia-Palacios, E. (CoI) & Sharma, V. (CoI)10/05/2023 → …Project: Research R1814ECS: Autonomous Multi-Format In-Situ Observatory for Atmospheric Carbon Dioxide and Methane Monitoring in Permafrost, Deserts & Wetlands (MISO)Sharma, V. (PI), Duong, T. Q. (CoI), Fahim, M. (CoI) & Shakeel, H. (CoI)16/02/2023 → …Project: Research Gas Sensor 100% Methane 100% Detection Limit 100% Multichannel 100% Polydimethylsiloxane 100% Research output Research output per year 2010 2013 2019 2022 2023 2024 2025 2025 32 Conference contribution 28 Article 2 Chapter 1 Edited book 2 More 1 Paper 1 Review article Research output per year Research output per year Air quality and healthy ageing: predictive modeling of pollutants using CNN Quantum-LSTMNaz, F., Fahim, M., Ahmad Cheema, A., Mcniven, B. D. E., Cao, T.-V., Hunter, R. & Duong, T. Q., 15 May 2025, In: IEEE Access. 13, p. 94212-94223 12 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Air Pollution 100% Nitrogen Dioxide 100% Fine Particulate Matter 50% Particular Matter 2.5 50% Lstm 33% 20 Downloads (Pure) Edge intelligence: a deep distilled model for wearables to enable proactive eldercareFahim, M., Ahsan Kazmi , S. M., Sharma, V., Shin, H. & Duong, T. Q., 09 Jan 2025, (Early online date) In: IEEE Transactions on Artificial Intelligence.Research output: Contribution to journal › Article › peer-review Open AccessFile Edge Intelligence 100% Wearable Sensor 100% Deep Learning Method 100% Mobile Phone 100% Learning Model 100% 80 Downloads (Pure) Few-shot classification of brain cancer images using meta-learning algorithmsNguyen, T.-N. T., Fahim, M., McNiven, B. D. E., Le, Q. N. & Le, N. D., 06 Nov 2025, (Early online date) In: EAI Endorsed Transactions on Industrial Networks and Intelligent Systems. 12, 4, 10 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Learning Algorithm 100% Meta-Learning 100% Average Accuracy 40% Large Data Set 20% Learning Framework 20% LFA-Net: a lightweight network with LiteFusion Attention for retinal vessel segmentationMehmood, M., Spence, I. & Fahim, M., 20 Aug 2025, (Accepted) 6th International Conference on Computer Vision and Data Mining: Proceedings. (International Conference on Computer Vision and Data Mining: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Vessel Segmentation 100% Retinal Blood Vessel 100% Constrained Environment 33% Outstanding Performance 33% Network Segmentation 33% Multimodal deep learning model based on ECG and clinical notes for arrhythmia classificationAgnew, S. & Fahim, M., 08 Aug 2025, (Accepted) 2025 IEEE International Conference on E-health Networking, Application & Services: Proceedings. IEEE, 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Deep Learning Model 100% Multimodal Deep Learning 100% Cardiac Dysrhythmia 100% Electrocardiogram 100% Random Decision Forest 50% View all 65 research outputs Prizes Best Student Paper Award Megarry, M. (Recipient), Masaracchia, A. (Recipient), Fahim, M. (Recipient), Sharma, V. (Recipient) & Duong, T. Q. (Recipient), 20 Feb 2024Prize: Prize (including medals and awards) Queen's Merit Award for FellowshipFahim, M. (Recipient), 09 Feb 2023Prize: Fellowship awarded competitively SEDA Leading Undergraduate Programmes CertificationFahim, M. (Recipient), 05 Sept 2024Prize: Other distinction Activities Activities per year 2022 2022 2024 2 Participation in conference 2 PhD external examination 2 Invited talk 1 Other 1 More 1 Oral presentation Activities per year Project - How Digital Twins, Generative AI, and Data Analytics Can Transform Education, Create Immersive Learning Experiences, and Drive Industry InnovationLydon, D. (Chair), Stockdale, J. (Contributor), Soban, D. (Contributor), Turkan, S. (Contributor), Elghaish, F. (Contributor), Birch, M. (Contributor), Edgar, A.-L. (Contributor), Fahim, M. (Contributor), Gillen, K. (Contributor), Boyle, L. (Contributor), Booth, N. (Contributor), Guo, H. (Contributor), O'Kelly, C. (Contributor), A Rahman, A. (Contributor) & Ofterdinger, U. (Contributor)01 Jan 2024 → …Activity: Other activity types › Other Artificial Intelligence for Wearable ComputingFahim, M. (Invited speaker)17 Nov 2023Activity: Talk or presentation types › Invited talk EAI International Conference on Industrial Networks and Intelligent SystemsFahim, M. (Member of programme committee)02 Aug 2023 → 03 Aug 2023Activity: Participating in or organising an event types › Participation in conference The University of ManchesterFahim, M. (Examiner)02 Nov 2022Activity: Examination types › PhD external examination The University of MessinaFahim, M. (Examiner)03 Oct 2022Activity: Examination types › PhD external examination View all 8 activities",
  "content_length": 6496,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:07"
}