{
  "name": "Muhammad Hamad Alizai",
  "homepage": "http://web.lums.edu.pk/~alizai",
  "status": "success",
  "content": "Muhammad Hamad Alizai | CS @ LUMS Muhammad Hamad Alizai Associate Professor of Computer Science @ LUMS Research: Internet of Things, Cyber Physical Systems, Embedded AI Contact: 9-G09A, SBASSE, LUMS University, 54792, Lahore, Pakistan hamad.alizai “at” lums.edu.pk · +92 42 3560-8479 Research Interests I research distributed systems in a broad sense. I am fascinated by the idea of extending the Internet to everything around us, aka the Internet of Things (IoT). Lately, I have been exploring how generative AI can make IoT more accessible in low- and middle-income regions, as well as tackling local societal challenges through computational thinking. Main Research Projects (present) My research is generously funded by HEC, LUMS faculty grants, DAAD, and NCBC. See me if you can: Building privacy-preserving cameras ground-up Glitch in time: Exploiting IMUs for eavesdropping Checkmate: Automating approximate intermittent computing through GenAI SKIP: School kids in carpool Guardian Angel: Unlocking the power of IoT for developing regions through GenAI Selected Publications (complete list, also on Google Scholar) CheckMate: LLM-Powered Approximate Intermittent Computing Sayid-Ali A, Rafay A, Soomro A, Alizai M.H, Bhatti N ACM SenSys, 2025 (Acceptance Rate 18%) The Internet of Batteryless Things Ahmed S, Islam B, Yildrim K.S, Zimmerling M, Pawełczak P, Alizai M.H, Lucia B, Mottola L, Sorber J, Hester J Communications of the ACM (CACM), 2024 Glitch in Time: Exploiting Temporal Misalignment of IMU for Eavesdropping Najeeb A, Rafay A, Bhatti N, Alizai M.H ACM AsiaCCS, Hanoi, 2025 (Acceptance Rate ≈15%) Battery-less Zero-maintenance Embedded Sensing at the Mithraeum of Circus Maximus Afanasov M, Bhatti N, Campagna D, Caslini G, Centonze F.M, Dolui K, Maioli A, Barone E, Alizai M.H, Siddiqui J.H, Mottola L ACM SenSys, Yokohama, 2020 (Acceptance Rate 20%) No-frills Water Comfort for Developing Regions Abbas S, Ehsan A, Ahmed S, Khan S.A, Jadoon T.M, Alizai M.H ACM/IEEE IPSN, Sydney, 2020 (Acceptance Rate 22%) Intermittent Asynchronous Peripheral Operations Branco A, Mottola L, Alizai M.H, Siddiqui J.H ACM SenSys, New York, 2019 (Best Paper Candidate, Acceptance Rate 19%) Scylla: Interleaving Multiple IoT Stacks on a Single Radio Iqbal H, Alizai M.H, Qazi I.A, Lansiedel O, Uzmi Z.A ACM CoNEXT, Heraklion, 2018 (Acceptance Rate 17%) Inverting HVAC for Energy-Efficient Thermal Comfort in Populous Emerging Countries Hafeez K, Chandio Y, Bakar A, Ali A, Syed A, Jadoon T.M, Alizai M.H ACM BuildSys, Delft, 2017 (Audience Choice Award, Acceptance Rate 31%) Energy Harvesting and Wireless Transfer in Sensor Network Applications: Concepts and Experiences Bhatti N, Alizai M.H, Syed A, Mottola L ACM Transactions on Sensor Networks (TOSN), 2016 Sensors with Lasers: Building a WSN PowerGrid Bhatti N, Syed A, Alizai M.H ACM/IEEE IPSN, Berlin, 2014 (Acceptance Rate 20%) Probabilistic Addressing: Stable Addresses in Unstable Wireless Networks Alizai M.H, Vaegs T, Landsiedel O, Goetz S, Bitsch Link J.A, Wehrle K ACM/IEEE IPSN, Chicago, 2011 (Acceptance Rate 17%) Refector: Heuristic Header Error Recovery for Error-Tolerant Transmissions Schmidt F, Alizai M.H, Aktas I, Wehrle K ACM CoNEXT, Tokyo, 2011 (Acceptance Rate 18%) KleeNet: Discovering Insidious Interaction Bugs in Wireless Sensor Networks Before Deployment Sasnauskas R, Landsiedel O, Alizai M.H, Weise C, Kowalewski S, Wehrle K ACM/IEEE IPSN, Stockholm, 2010 (Acceptance Rate 17%) Bursty Traffic over Bursty Links Alizai M.H, Landsiedel O, Bitsch Link J.A, Goetz S, Wehrle K ACM SenSys, Berkeley, 2009 (Acceptance Rate 17%) When Timing Matters: Enabling Time-Accurate & Scalable Simulation of Sensor Network Applications Landsiedel O, Alizai M.H, Wehrle K ACM/IEEE IPSN, St. Louis, 2008 (Acceptance Rate 23%) PhD Students Saad Ahmed: Intermittent Computing (2016-2020) → Postdoc, Northwestern University Samar Abbas: IoT retrofits for old buildings (2017-2021) → Assistant Professor, Punjab University MS Thesis Students Qurat ul Ain: Dynamic voltage and frequency scaling in battery-less IoT (2020) Bilal Khan: Infrastructure-assisted sensing (2020) Tehreem Fatima (co-advised with Junaid Siddiqui): Edge computing (2019) Farhan Asghar (co-advised with Junaid Siddiqui): Edge computing (2019) Ahmed Ehsan: IoT-based water metering (2019) Tayyaba Zainab: Single radio multiple personalities (2019) Hassan Iqbal: Dynamic reconfiguration of IoT radios (2018) Junaid Ahmed: Differential checkpointing for transiently powered computers (2018) Natasha Khan: Path-based checkpointing for intermittent computing (2017) Jazib Jamil: Network virtualization in IoT (2017) Furqan Arshad: Hashing-based incremental checkpointing for embedded systems (2017) Hassan Ali Khan: Incremental checkpointing for intermittent computations (2016) Khadija Hafeez: Inverted HVAC for older buildings (2016) Noshab Gul: Modeling mine planning and design using parallel computing paradigm (2015) Musa Khattak: Recycling corrupt packets in wireless networks (2014) Farhan Naeem: Error-tolerant wireless communications (2014) Pedagogical Contributions I love teaching and am always working toward pedagogical innovation. I lead the LUMS Learning Institute, where we've developed faculty-development programs for educators at LUMS and across the country. Check out our website to learn more about our contributions to teaching and learning. Teaching (Recent Courses) CS 370 – Operating Systems (Fall 2022-2024) CS 570 – Advanced Operating Systems (Spring 2017-2020) CS 677 – Internet of Things (Fall 2016-2025) Service Technical Program Committees: ACM CoNEXT 2024, ACM/IEEE IPSN 2022, ACM MobiSys 2021, ACM/IEEE IPSN 2021, ACM/IEEE IPSN 2019, ACM BuildSys 2018, IEEE ICCCN 2017, IEEE PerCom (Demos), IEEE CSCN, IEEE ICET Organization Committees: IEEE SECON 2020 (workshop co-chair), ACM/IEEE IPSN 2019 (poster/demo co-chair), ACM/IEEE IPSN 2018 (publicity chair) Co-organizer: CPS Week Tutorial on Transiently Powered Embedded Computing 2018, ACM SenSys Doctoral School on Transiently Powered Computing 2017 Potential Students I have open thesis topics available for grad and undergrad students. I prefer students who have participated in my lectures and labs. Please contact me in person for thesis, internships, and PhD studies.",
  "content_length": 6285,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:07"
}