{
  "name": "Muhammad Rizwan Asghar",
  "homepage": "https://www.cs.auckland.ac.nz/~asghar",
  "status": "success",
  "content": "Muhammad Rizwan Asghar's Homepage Tweets by DrRizwanAsghar Contact Muhammad Rizwan Asghar Building 303S - Room 585 School of Computer Science The University of Auckland Private Bag 92019 Auckland 1142 New Zealand Phone: +64 9 923 4762 E-mail: r.asghar@ auckland.ac.nz Copyright Notice: Please consult copyright notice of the original publishers before downloading any material from this webpage. Muhammad Rizwan Asghar Muhammad Rizwan Asghar is a Senior Lecturer (over the bar) in the School of Computer Science at The University of Auckland (UoA) in New Zealand. Prior to joining UoA as a Lecturer, he was a Postdoctoral Researcher at international research institutes including the Center for IT-Security, Privacy, and Accountability (CISPA) at Saarland University in Germany and CREATE-NET (an international research centre) in Trento Italy, where he also served as a Researcher. He received his PhD degree in ICT (Security and Privacy) from the University of Trento, Italy in 2013. As part of his PhD programme, he was a Stanford Research Institute (SRI) Fellow at SRI International, California, USA. Before starting his PhD, he was a Research Assistant at the University of Trento. He obtained his MSc degree in Computer Science and Engineering - Information Security Technology from the Eindhoven University of Technology (TU/e), The Netherlands in 2009 and carried out his research on DRM Convergence as a Master Thesis Student at the Ericsson Research Eurolab, Germany. During his career, he also worked as a Software Engineer at international software companies. He is an award-winning teacher and researcher who received several awards including the 2017 Dean's Award for Teaching Excellence, Best Paper Award at TrustCom 2018, Highly Commended Paper at ITNAC 2017, and Best Paper Award at FiCloud 2015. To see a full list of his research publications, visit his Google Scholar or DBLP page. Research Interests Access Control, Cybersecurity, Privacy, and Applied Cryptography. Teaching Cyber Forensics and Security (Online), 2021 [Course Coordinator]. Cyber Security (COMPSCI 316), 2021 [Course Coordinator]. Network Defence and Countermeasures (COMPSCI 726), 2021 [Course Coordinator]. Security for Smart Devices (COMPSCI 702), 2021 [Course Coordinator]. Click here to see more ... Research Outputs (Selected) Qinwen Hu, Se-Young Yu, and Muhammad Rizwan Asghar, Analysing Performance Issues of Open-source Intrusion Detection Systems in High-speed Networks, Journal of Information Security and Applications, 51:102426, 2020. URL | BibTeX | PDF Muhammad Usman, Marwa Qaraqe, Muhammad Rizwan Asghar, and Imran Shafique Ansari, Mitigating Distributed Denial of Service Attacks in Satellite Networks, Transactions on Emerging Telecommunications Technologies, 31(6):e3936, 2020. URL | BibTeX | PDF Muhammad Rizwan Asghar, Qinwen Hu, and Sherali Zeadally, Cybersecurity in Industrial Control Systems: Issues, Technologies, and Challenges, Computer Networks, 165:106946, 2019. URL | BibTeX | PDF Fateme Shirazi, Milivoj Simeonovski, Muhammad Rizwan Asghar, Michael Backes, and Claudia Díaz, A Survey on Routing in Anonymous Communication Protocols, ACM Computing Surveys, 51(3):51:1-51:39, 2018. URL | BibTeX | PDF Shujie Cui, Muhammad Rizwan Asghar, and Giovanni Russello, Multi-CDN: Towards Privacy in Content Delivery Networks, IEEE Transactions on Dependable and Secure Computing, 2018. Department's Best Student Paper Award. URL | BibTeX | PDF Muhammad Rizwan Asghar, György Dán, Daniele Miorandi, and Imrich Chlamtac, Smart Meter Data Privacy: A Survey, IEEE Communications Surveys & Tutorials, 19(4):2820–2835, 2017. URL | BibTeX | PDF Manoranjan Mohanty, Muhammad Rizwan Asghar, and Giovanni Russello, 2DCrypt: Privacy-Preserving Image Scaling and Cropping in the Cloud, IEEE Transactions Information Forensics and Security, 11(11):2542-2555, 2016. Its review appeared in the IEEE COMSOC MMTC Communications - Review Letter (Volume 8, Issue 1, February 2017. URL | BibTeX | PDF Muhammad Rizwan Asghar, Mihaela Ion, Giovanni Russello, and Bruno Crispo, ESPOONERBAC: Enforcing Security Policies in Outsourced Environments, Computers & Security, 35:2–24, 2013. One of three papers from ARES 2011 invited to this journal. URL | BibTeX | PDF Click here to see more ... Media Interviews, Opinion Pieces, and News Articles (Selected) A cyberattack lesson from Waikato DHB Newsroom, June 21, 2021 NZX cyber attacks: Computer expert calls for a global crackdown on digital crimes Newshub (NZ), September 1, 2020 Trading on NZX disrupted... Dr Rizwan Asghar of the School of Computer Science at the University of Auckland explains the impact it has had (Podcast from 13'27'') BBC World Business Report (a daily programme on BBC World Service radio, which broadcasts to 20m people in English weekly), August 28, 2020 New Zealand bourse resumes trade after cyber attacks, government activates security systems Reuters, August 28, 2020 Serious cyber-attack on NZX could have been ‘easily avoided’ - expert (Video) 1News TVNZ, August 26, 2020 NZX resumes trading after second cyber attack Stuff (NZ), August 26, 2020 NZX comes under another cyber attack (Audio - 2'05'') Midday Report, RNZ (Radio New Zealand), August 26, 2020 Are we ready for Online Voting? (Audio - 17'51'') RNZ (Radio New Zealand), November 13, 2019 How to wipe yourself off the internet. NZ Herald, August 2, 2015. Click here to see more ... Presentations iGenoPri: Privacy-Preserving Genomic Data Processing with Integrity and Correctness Proofs, The 14th Annual Conference on Privacy, Security and Trust (PST), Auckland, New Zealand, December 2016. CloudEFS: Efficient and Secure File System for Cloud Storage, The 14th Annual Conference on Privacy, Security and Trust (PST), Auckland, New Zealand, December 2016. Certificate Revocation Guard (CRG): An Efficient Mechanism for Checking Certificate Revocation, The 41st Annual IEEE Conference on Local Computer Networks (LCN), Dubai, UAE, November 2016. Can the Internet Forget? Enforcing 'Right to be Forgotten', Alumni Day, The University of Auckland, New Zealand, October 2016. Enforcing 'Right to be Forgotten', New Zealand Information Security Forum (NZISF), Auckland, New Zealand, September 2016. SPARER: Secure Cloud-Proof Storage for e-Health Scenarios, The 3rd International Workshop on Software Assurance (SAW) in conjunction with the International Conference on Availability, Reliability and Security (ARES), Salzburg, Austria, September 2016. PROTECTOR: Privacy-Preserving Information Lookup in Content-Centric Networks, International Conference on Communications (ICC), Kuala Lumpur, Malaysia, May 2016. Enforcing Encrypted Dynamic Security Constraints in the Cloud, University of Trento, Italy, August 2015. [Slides] E-GRANT: Enforcing Encrypted Dynamic Security Constraints in the Cloud, The 3rd International Conference on Future Internet of Things and Cloud (FiCloud) - Special Track on Security, Privacy and Trust, Rome, Italy, August 2015. Supporting Complex Queries for Multi-User Encrypted Databases, Aura Information Security, Wellington, New Zealand, July 2015. Privacy and Cybersecurity Issues in Smart Grids, Round Table Discussion on Smart Energy Systems, EIT ICT Labs, Trento Co-Location Center, Italy, June 2014. PIDGIN: Privacy-Preserving Interest and Content Sharing in Opportunistic Networks, The 9th ACM Symposium on Information, Computer and Communications Security (ASIACCS), Kyoto, Japan, June 2014. Privacy Preserving Enforcement of Sensitive Policies in Distributed Environments, The Security and Privacy (S&P) group at the Max Planck Institute for Software Systems (MPI-SWS), Saarbrücken, Germany, March 2014. [Slides] Privacy Preserving Enforcement of Sensitive Policies in Outsourced Environments, Laboratory for Communications and Applications 1 (LCA1), Swiss Federal Institute of Technology in Lausanne (EPFL), Switzerland, February 2014. [Slides] Click here to see more ... Professional Activities Guest Editor The Special Issue on Preserving Privacy and Security in IoT, 2016. Assistant Organiser The 21st Annual International Conference on the Theory and Application of Cryptology and Information Security (ASIACRYPT) 2015. Publicity Chair The 9th International Conference on Risks and Security of Internet and Systems (CRiSIS) 2014. Technical Programme Committee (TPC) Member The 12th IEEE International Workshop on Security, Trust, and Privacy for Software Applications (STPSA) 2017. The 10th International Conference on Bio-inspired Information and Communications Technologies (formerly BIONETICS) 2017. Australasian Information Security Conference (AISC) 2017. The 10th IEEE Workshop on Network Measurements (WNM) 2016. The 11th IEEE International Workshop on Security, Trust, and Privacy for Software Applications (STPSA) 2016. The 5th International Conference on Advances in Computing, Communications and Informatics (ICACCI) 2016. Australasian Information Security Conference (AISC) 2016. The 3rd International Conference on Future Internet of Things and Cloud (FiCloud) - Special Track on Networking and Communication Protocols 2015. The 9th International Conference on Bio-inspired Information and Communications Technologies - Special Track on Bio-inspired Wireless Network Security (BWNS) 2015. Journal Reviewer ACM Transactions on Computing Education (TOCE) and ACM Transactions on Storage (TOS). Elsevier Computer Communications (COMCOM), Elsevier Computer Networks (COMNET), Elsevier Computers & Security (COSE) and Elsevier Information Sciences (INS). IEEE Access, IEEE Communications Magazine (COMMAG), IEEE Transactions on Cloud Computing (TCC) and IEEE Transactions on Computers (TC). Inderscience International Journal of Security and Networks (IJSN). Springer International Journal of Information Security (IJIS) . Conference/Workshop Reviewer CLOUD 2017, TrustCom 2017, VTC (Fall) 2017 and VTC (Spring) 2017. ASIACRYPT 2016. ASIACCS 2015, ISC 2015, QRS 2015, SecureComm 2015 and SmartGridComm 2015. Click here to s",
  "content_length": 10041,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:10"
}