{
  "name": "Muhammad Shafique 0001",
  "homepage": "https://engineering.nyu.edu/faculty/muhammad-shafique",
  "status": "success",
  "content": "Muhammad Shafique | NYU Tandon School of Engineering Skip to Main Content Search NYU Tandon Fulltext search Looking for News or Events? Muhammad Shafique Global Network Professor Electrical and Computer Engineering Connect Email muhammad.shafique [at] nyu.edu Website Home Page Muhammad Shafique received his Ph.D. degree in computer science from the Karlsruhe Institute of Technology (KIT), Germany, in 2011. Afterwards, he established and led a highly recognized research group at KIT for several years as well as conducted impactful R&D activities in Pakistan. Besides co-founding a technology startup in Pakistan, he was also an initiator and team lead of an ICT R&D project. He has also established strong research ties with multiple universities in Pakistan, where he has been actively co-supervising various R&D activities and theses since 2011, resulting in top-quality research outcome and scientific publications. Before KIT, he was with Streaming Networks Pvt. Ltd. where he was involved in research and development of video coding systems several years. In Oct.2016, he joined the Institute of Computer Engineering at the Faculty of Informatics, Technische Universität Wien (TU Wien), Vienna, Austria as a Full Professor of Computer Architecture and Robust, Energy-Efficient Technologies. Since Sep.2020, he is with the Division of Engineering, New York University Abu Dhabi (NYUAD) in UAE, and is a Global Network faculty at the NYU Tandon School of Engineering in USA. Dr. Shafique has demonstrated success in leading team-projects, meeting deadlines for demonstrations, motivating team members to peak performance levels, and completion of independent challenging tasks. His experience is corroborated by strong technical knowledge and an educational record (throughout Gold Medalist). He also possesses an in-depth understanding of various video coding standards. His research interests are in brain-inspired computing, AI & machine learning hardware and system-level design, autonomous systems, wearable healthcare, energy-efficient systems, robust computing, hardware security, emerging technologies, FPGAs, MPSoCs, and embedded systems. His research has a special focus on cross-layer analysis, modeling, design, and optimization of computing and memory systems. The researched technologies and tools are deployed in application use cases from Internet-of-Things (IoT), smart Cyber-Physical Systems (CPS), and ICT for Development (ICT4D) domains. Dr. Shafique has given several Keynotes, Invited Talks, and Tutorials at premier venues. He has also organized many special sessions at premier venues (like DAC, ICCAD, DATE, IOLTS, and ESWeek) and served as the Guest Editor for IEEE Design and Test Magazine (D&T), IEEE Transactions on Sustainable Computing (T-SUSC), and MICPRO. He has served as the TPC Chair of ISVLSI, PARMA-DITAM, RTML, ESTIMedia and LPDC, General Chair of DDECS and ESTIMedia, Track Chair at DATE, IOLTS, DSD and FDL, and PhD Forum Chair of ISVLSI. He has also served on the program committees of numerous prestigious IEEE/ACM conferences including ICCAD, ISCA, DATE, CASES, ASPDAC, and FPL. He is a senior member of the IEEE and IEEE Signal Processing Society (SPS), and a member of the ACM, SIGARCH, SIGDA, SIGBED, and HIPEAC. He holds one US patent and has (co-)authored 6 Books, 10+ Book Chapters, and over 300 papers in premier journals and conferences. Dr. Shafique received the prestigious 2015 ACM/SIGDA Outstanding New Faculty Award (given world-wide to one person per year), the AI-2000 Chip Technology Most Influential Scholar Award in 2020, six gold medals in his educational career, and several best paper awards and nominations at prestigious conferences like CODES+ISSS, DATE, DAC and ICCAD, Best Master Thesis Award, DAC'14 Designer Track Best Poster Award, IEEE Transactions of Computer \"Feature Paper of the Month\" Awards, and Best Lecturer Award. His research work on aging optimization for GPUs featured as a Research Highlight in the Nature Electronics, Feb.2018 issue. Research Interests Brain-inspired Computing, Embedded Machine Learning and AI, Energy-Efficient Computing, AI for Wearable Healthcare, Autonomous Systems, Robust Computing, Fault-Tolerant and Secure Hardware, MPSoCs, FPGAs, Embedded Systems for CPS & IoT Education Karlsruhe Institute of Technology (KIT), 2011 Ph.D., Computer Science, Magna cum Laude Pakistan Institute of Engineering and Applied Science (PIEAS), 2003 M.Sc., Information Technology, 2 Gold Medals, Best Thesis Award University of Engineering and Technology (UET) Lahore, 2000 B.Sc., Engineering, 4 Gold Medals Experience Vienna University of Technology (TU Wien), Austria Full Professor (Univ.-Prof.) of Computer Engineering, Faculty of Informatics Head of the Computer Architecture and Robust Energy-Efficient Technologies (CARE-Tech.) group Oct. 2016 – Aug. 2020 Karlsruhe Institute of Technology (KIT), Germany Research Group Leader, at the Chair for Embedded Systems, Informatics Jan. 2011 – Sep. 2016 National University of Science and Technology (NUST), Pakistan Collaborative Research Lead and Co-Advisor, at SEECS 2011 – to date University of New South Wales (UNSW), Australia Visiting Research Fellow, at the School of Computer Science and Engineering Aug. 2013 – Sep. 2013 Federal University of Rio Grande do Sul (UFRGS), Porto Alegre, Brazil Visiting Research Fellow, at the Informatics Institute (INF) Apr. 2012 Karlsruhe Institute of Technology (KIT), Germany Research Assistant at the Chair for Embedded Systems, Informatics Oct. 2006 – Dec. 2010 Streaming Networks Pvt. Ltd., www.streaming-networks.com/ Senior Embedded Systems Engineer, at the Video Group 2003-2006 WorldCall Multimedia Pvt. Ltd., www.worldcall.com.pk Planning and Coordination Engineer, Cable-TV Project on Hybrid Fiber-Coaxial Network 2001 Publications A nearly complete list of my publications can be found on my DBLP website or via my Google Scholar page. Awards Career Awards ACM/SIGDA Outstanding New Faculty Award, 2015 AI2000 Most Influential Scholar Award, 2020 Best Elective Lecturer Award, at KIT, Germany. Ph.D. with magna cum laude Best Master Thesis Award 1st Position Holder in M.Sc. Information Technology with 2 Gold Medals 1st Position Holder in B.Sc. Engineering with 4 Gold Medals Best Paper Awards and Nominations DAC 2017 Best Paper Award Nomination for the paper “Low-overhead Aging-aware Resource Management on Embedded GPUs” in ACM/IEEE 54th Design Automation Conference, June 2017. Two DATE 2017 Best Paper Award Nominations for the papers “Scalable Probabilistic Power Budgeting for Many-Cores” and “Embracing Approximate Computing for Energy-Efficient Motion Estimation in High Efficiency Video Coding” in ACM/IEEE Design Automation and Test in Europe Conference, March 2017. IEEE Transactions on Computers “Feature Paper of the Month” Award for the January 2017 for the paper “Thermal safe power (TSP): Efficient power budgeting for heterogeneous manycore systems in dark silicon”. DAC 2016 Best Paper Award Nomination for the paper “Improving Mobile Gaming Performance through Cooperative CPU-GPU Thermal Management” in ACM/IEEE 53rd Design Automation Conference, June 2016. IEEE Transactions on Computers “Feature Paper of the Month” Award for the November 2016 for the paper “Scalable Power Management for On-Chip Systems with Malleable Applications”. CODES+ISSS 2015 Best Paper Award for the paper “R2Cache: Reliability-Aware Reconfigurable Last-Level Cache Architecture for Multi-Cores” in IEEE International Conference on Hardware-Software Codesign and System Synthesis, 2015. CODES+ISSS 2014 Best Paper Award for the paper “TSP: Thermal Safe Power – Efficient Power Budgeting for Many-Core Systems in Dark Silicon” in IEEE International Conference on Hardware-Software Codesign and System Synthesis, 2014. DAC 2014 Designer Track Best Poster Award for “Application-Specific Hierarchical Power Management for Multicast High Efficiency Video Coding” in ACM/IEEE 51st Design Automation Conference, 2014. CODES+ISSS 2011 Best Paper Award for the paper “Reliable Software for Unreliable Hardware: Embedded Code Generation aiming at Reliability” in IEEE International Conference on Hardware-Software Codesign and System Synthesis, 2011. MaXentric Technologies AHS 2011 Best Paper Award for the paper “Concepts, Architectures, and Run-time Systems for Efficient and Adaptive Reconfigurable Processors” in NASA/ESA 6th Conference on Adaptive Hardware and Systems, 2011. ICCAD 2010 Best Paper Candidate for the paper “Selective Instruction Set Muting for Energy-Aware Adaptive Processors”, in IEEE/ACM International Conference on Computer-Aided Design, 2010. DATE 2008 Best Paper Award for the paper “Run-time System for an Extensible Embedded Processor with Dynamic Instruction Set”, in IEEE/ACM Design Automation and Test in Europe Conference, 2008. IEEE Transactions on Computers paper “Aging-aware Workload Management on Embedded GPU Under Process Variation” featured in Research Highlights of “Nature Electronics”, February 2018 issue. Several Paper Awards by the European Network of Excellence on High Performance and Embedded Architecture and Compilation for my papers at DAC and FCCM between 2008 and 2020. Research News View More NYU Tandon researchers develop AI agent that solves cybersecurity challenges autonomously Artificial intelligence agents — AI systems that can work independently toward specific goals without constant human guidance — have demonstrated strong capabilities in software development and web navigation. Their effectiveness in cybersecurity has remained limited, however. That may soon change, thanks to a research team from NYU Tandon School of Engineering, NYU Abu Dhabi and other universities that developed an AI agent capable of autonomously solving complex cybersecurity challenges. The system, called EnIGMA, was presented this month at the International Conference on Machine Learning (ICML) 2025 in Vancouver, Canada. \"EnIGMA is about using Large L",
  "content_length": 14854,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:11"
}