{
  "name": "Muhammad Aamir Cheema",
  "homepage": "http://www.aamircheema.com",
  "status": "success",
  "content": "Muhammad Aamir Cheema - Professor, Faculty of Information Technology, Monash University, Australia. Home Papers EDI Teaching Grants & Services Team PhD Positions Humorous Articles » Muhammad Aamir Cheema Professor, Head of Department, Department of Software Systems and Cybersecurity, Faculty of Information Technology, Monash University, Melbourne, AUSTRALIA Office: 2.04F, 20 Exhibition Walk (Woodside Building), Monash University, Clayton 3168 VIC Phone: +61 3 9905 9662 Email: News May-2025 Our paper titled \"MapEval: A Map-Based Evaluation of Geo-Spatial Reasoning in Foundation Models\" has been accepted at ICML 2025 as a Spotlight paper. Jan-2025 Our paper titled \"Beyond Data, Towards Sustainability: A Sydney Case Study on Urban Digital Twins\", has been accepted by PFG - Journal of Photogrammetry, Remote Sensing and Geoinformation Science. Nov-2024 Our vision paper received The Best Vision Paper Award at ACM SIGSPATIAL 2024. The paper is titled \"Beyond the Commute: Unlocking the Potential of Electric Vehicles as Future Energy Storage Solutions\". Nov-2024 Bojie has received the prestigious 2025 CORE Award for the Australasian Distinguished Doctoral Dissertation for his PhD thesis titled \"Advances in Pathfinding Algorithms for Games, Route Planning Software, and Automated Warehouses\". Aug-2024 Our Vision paper titled \"Beyond the Commute: Unlocking the Potential of Electric Vehicles as Future Energy Storage Solutions\", has been accepted in ACM SIGSPATIAL 2024. Jul-2024 Our paper titled\"Eco-Friendly Route Planning Algorithms: Taxonomies, Literature Review and Future Directions\" has been accepted in ACM Computing Surveys 2024. Jul-2024 Our paper titled \"Enabling Spatial Digital Twins: Technologies, Challenges, and Future Research Directions\" has been accepted in PFG - Journal of Photogrammetry, Remote Sensing and Geoinformation Science, 2024. Apr-2024 Our paper titled \"Efficient Alternative Route Planning in Road Networks\" has been accepted for publication in IEEE Transactions on Intelligent Transportation Systems. Jan-2024 Our paper titled \"Load Balancing for Heterogeneous Serverless Edge Computing: A Performance-Driven and Empirical Approach\" has been accepted by Future Generation Computer Systems. Jan-2024 Our paper titled \"faasHouse: Sustainable Serverless Edge Computing through Energy-aware Resource Scheduling\" has been accepted by IEEE Transactions on Services Computing. Jan-2024 My tenure as the Director of Research for our department has concluded, and I am transitioning into the role of Director of Education. Having dedicated a substantial portion of my career to research-only roles like DECRA and Future Fellow, I am excited to take on this new responsibility and aim to make a meaningful contribution to education at Monash. Introduction Bio: I am currently a Professor, ACM Distinguished Speaker, and Head of Department for Software Systems and Cybersecurity at Monash University. I am also the founder and co-director of Urban Computing Lab. I am the recipient of 2012 Malcolm Chaikin Prize for Research Excellence in Engineering, 2013 Discovery Early Career Researcher Award, 2014 Dean's Award for Excellence in Research by an Early Career Researcher, 2018 ARC Future Fellowship, 2018 Monash Student Association Teaching Award, and 2019 Victorian Young Tall Poppy Science Award. I have also won two CiSRA best research paper awards (in 2009 and 2010), two \"one of the best papers of ICDE\" (in 2010 and 2012), Best Vision Paper Award at ACM SIGSPATIAL 2024, and three best paper awards at ICAPS 2020, WISE 2013 and ADC 2010, respectively. I am an Associate Editor of IEEE Transactions on Knowledge and Data Engineering (TKDE). Some of my other service roles include PC co-chair for ADC 2015, ADC 2016, ACM SIGSPATIAL Workshop ISA 2016 & 2018, and International Workshop on Social Computing (IWSC) 2017, proceedings chair for ICDE 2019 and DASFAA 2015, tutorial chair for APWeb 2017 and publicity co-chair for ACM SIGSPATIAL 2017 & 2018. Research interests: My research interests lie in the areas of data management, data analytics, cloud computing and edge computing. Specifically, I focus on the application of these technologies in Urban Computing, with a particular emphasis on the development of sustainable transportation systems and smart buildings. By leveraging cutting-edge data management and analytics techniques, my research aims to contribute to the creation of cities that are inclusive, safe, resilient, and sustainable, in alignment with United Nations Sustainable Development Goal 11. Some examples of my current research projects are: 1) using electric vehicles and bidirectional charging to reduce greenhouse gas emissions, e.g., charging using excess renewable energy and supplying power back to grid/homes when renewable energy is scarce; 2) using big spatiotemporal data collected from smartphones mounted in vehicles to reduce greenhouse gas emissions on roads and improve road safety by automatically identifying risky road conditions and unsafe driving behaviors (this is our ARC Discovery Project 2023); 3) indoor data management for smart buildings, including pathfinding, emergency evacuation, location-based services, mobility analytics etc. to improve the functionality and safety of buildings (this is related to my ARC Future Fellowship Project); 4) Using autonomous vehicles to support public transportation by offering first/last leg connectivity, enabling more flexible and sustainable transport options that complement traditional transit systems; 5) using digital twins to reduce carbon footprint of cities and buildings. This includes creating digital replicas of cities and buildings to simulate the impact of various interventions on energy consumption and emissions. If your research aims/interests are similar and you are interested in exploring collaboration opportunities, please reach out to me. Awards/Honors Our paper titled \"Beyond the Commute: Unlocking the Potential of Electric Vehicles as Future Energy Storage Solutions\" received The Best Vision Paper Award at ACM SIGSPATIAL 2024. ACM Distinguished Speaker (2023-2025) Our paper titled \"Hierarchical Graph Traversal for Aggregate k Nearest Neighbors Search in Road Networks\" received The Best Paper Award at ICAPS 2020. 2019 Young Tall Poppy Science Award. 2018 Monash Student Association Teaching Award - Innovation. ARC Future Fellow (2019-2023). Winner of 2014 Dean's Award for Excellence in Research by an Early Career Researcher. Our paper titled Probabilistic n-of-N Skyline Computation over Uncertain Data Streams received The Best Paper Award at WISE 2013 and invited to Special Issue of WWWJ on Best Papers of WISE 2013. Winner of Discovery Early Career Researcher Award 2013. I was invited to give a Commencement Speech at UNSW Graduation Ceremony in 2012. You can watch the commencement speech on YouTube here. Winner of 2012 Malcolm Chaikin Prize for Research Excellence in Engineering. The news was covered by various Pakistani news resources such as Dunya TV, Technology Times (English), Technology Times (Urdu), Pakistan State Times, Pakistan Science Club and UrduPoint etc. Our paper titled \"Efficiently Monitoring Top-k Pairs over Sliding Windows\" was invited to the special issue of IEEE-TKDE on \"The Best Papers of ICDE 2012\". In ICDE 2011, all authors were invited to present a poster in addition to a regular 20 minutes presentation. Our poster won Poster of the day award at ICDE2011. [poster] Winner of 2010 CiSRA Best Research Paper Award for the paper titled \"Influence Zone: Efficiently Processing Reverse k Nearest Neighbors Queries\". Winner of 2009 CiSRA Best Research Paper Award for the paper titled \"Lazy Updates: An Efficient Technique to Continuously Monitoring Reverse kNN\". Our paper titled \"Multi-Guarded Safe Zone: An Effective Technique to Monitor Moving Circular Range Queries\" was invited to the special issue of IEEE-TKDE on \"The Best Papers of ICDE 2010\". The Best Paper of ADC (Australasian Database Conference) 2010 for the paper titled \"Counting Distinct Objects over Sliding Windows\". Winner of ACM@UNSW 2005 programming competition. Hobbies I love playing different sports (especially Badminton and Table Tennis), and writing in my free time. Here are some highlights in reverse chronological order. Our team won the 2025 Autumn Premier League at Greater Dandenong Table Tennis Association (P6). Leading player medal for the 2025 Summer Premier League at Greater Dandenong Table Tennis Association (P6). Leading player medal for the Summer League 2023 at Greater Dandenong Table Tennis Association (P7). Winner of the B2 Grade Championship organised by Greater Dandenong Table Tennis Association. Our team, consisting of my dad, brother, and myself, won the Greater Dandenong Table Tennis Association Autumn Pennant Tournament (B3) which runs for 11 weeks in Autumn each year. I was also honored to receive a medal for the Leading Player of the tournament. Photo at the ceremony here. Runner-up of the EBC2022 Badminton tournament (four-members team event). Winner of Pakenham Khed Mela Badminton Tournament, 2022 (Men's doubles). Winner of Protech City Of Melbourne 2022 Badminton Tournament (MD-C) organized by Badminton Victoria (Men's doubles). Runner up 2021 Victoria Activated Badminton Challenge Graded Seasonal Series (Men's Singles-D). Winner of Monash University Staff Games 2019 in Badminton Singles (Runner-up in doubles). Urdu Editor of ECHO 2005, Official magazine of UET Lahore. \"Best Humorous Writer Award\" consecutively two years for Essay writing competitions held in 2003 and 2004 in UET Lahore. I have been writing to different famous pakistani monthly magazines like Urdu Digest. I have also been writing for children magazines. Here are some of Humorous Articles written by me. Winner of Annual Drama Competition organized by Dramatic Society UET Lahore. Best Skit Award in 2003 and Best Production Award in 2004. Participated in All Pakistan Inter Board Badminton tourname",
  "content_length": 10393,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:05"
}