{
  "name": "Muhammad Asif Hossain Khan",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1771",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Muhammad Asif Hossain Khan (Professor) Department of Computer Science and Engineering Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Information Science and Technology The University of Tokyo Japan 2014 Masters Computer Science The University of Dhaka Bangladesh 2001 Bachelor Computer Science The University of Dhaka Bangladesh 1999 Title Organization Location From Date To Date Professor Department of Computer Science and Engineering University of Dhaka 29, May 2019 Currently Working Associate Professor Department of Computer Science and Engineering University of Dhaka 27, Oct 2014 28-05-2019 Visiting Researcher Center for Spatial Informatin Science University of Tokyo, Japan 01, Apr 2014 31-03-2015 Research Fellow Institute of Industrial Science University of Tokyo, Japan 01, Apr 2013 31-03-2014 Doctoral Research Fellow Ministry of Education, Culture, Sports Science and Technology (MEXT), Japan 01, Apr 2010 31-03-2013 Research Student Ministry of Education, Culture, Sports Science and Technology (MEXT), Japan 02, Apr 2009 31-03-2010 Assistant Professor Department of Computer Science and Engineering University of Dhaka 26, Sep 2005 26-10-2014 Lecturer Ministry of Education, Culture, Sports Science and Technology (MEXT), Japan 12, Mar 2002 25-09-2005 Research Interest Subject Description Research Interest (Goal, Target Indicator) Natural Language Processing Development of Natural Language Processing tools for Bangla such as Spell Checker, Dependency Parser, Optical Character Reader Mechine Learning Developing Efficient Feature Selection Algorithms, Deep Learning Algorithms, Attention Modules Text Mining Automatic Question Answering, Social Network and Micro-blog Analysis, Discovering Latent Relations, Text Summarization Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion No project/research supervision is found Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration No project/research work is found Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year No Collaboration & Membership is found Journal Article 1 Nishat Tasnim Mim, Md Eusha Kadir, Suravi Akhter and Muhammad Asif Hossain Khan : An Overlapping Conscious Relief-based Feature Subset Selection Method, International Journal of Electrical and Computer Engineering (IJECE) , vol.14 , no.2 Institute of Advanced Engineering and Science (IAES) , pp.2068-2075 , 2024 . View More 2 Md Rabiul Haque, Mohammad Shariful Islam, Md Khalid Hasan, Md Salim Hossain, Muhammad Asif Hossain Khan and Farhin Islam : Determinants of anxiety and depression among Bangladeshi adults during COVID-19 lockdown: An online survey, Heliyon (impact factor:4) , vol.8 , no.5 Elsevier Ltd. , 2022 . View More 3 Sadia Sharmin, Mohammad Shoyaib, Amin Ahsan Ali, Muhammad Asif Hossain Khan and Oksam Chae : Simultaneous Feature Selection and Discretization based on Mutual Information, Pattern Recognition (impact factor:3.965) , vol.91 , pp.162-174 , 2019 . 4 Tahira Alam, Chowdhury Farhan Ahmed, Sabit Anwar Zahin, Muhammad Asif Hossain Khan and Maliha Tashfia Islam : An Effective Recursive Technique for Multi-Class Classification and Regression for Imbalanced Data, IEEE Access (impact factor:4.098) , vol.7 , no.1 , pp.127615 - 127630 , 2019 . 5 Minhas Kamal, Amin Ahsan Ali, Muhammad Asif Hossain Khan and Mohammad Shoyaib : Braille to Text Translation for Bengali Language: A Geometric Approach, JahangirNagar University Journal of Information Technology (JJIT) , pp.93-111 , 2018 . 6 Muhammad Asif Hossain Khan, Anindya Sundar Paul and Muhammad Jawad Iqbal : Printed Bangla Character Image Segmentation: A Font Invariant Approach, IUT Journal of Engineering and Technology (JET) , 2018 . View More 7 Partha Protim Ghosh, Rezvi Shahariar and Muhammad Asif Hossain Khan : A Rule Based Extractive Text Summarization Technique for Bangla News Documents, International Journal of Modern Education and Computer Science (IJMECS) (impact factor:0.669 (2015)) , vol.10 , no.12 , pp.44-53 , 2018 . 8 Khalid Hussain, Shanto Rahman, Md. Mostafijur Rahman, Shah Mostafa Khaled, M. Abdullah-Al Wadud, Muhammad Asif Hossain Khan and Mohammad Shoyaib : Histogram Specification Technique for Dark Image Enhancement Using a Local Transformation Method, IPSJ Transactions on Computer Vision and Applications, (Springer Berlin Heidelberg) , vol.10 , no.3 , 2018 . 9 Muntasir Wahid, M. Abid Naziri, Mohammad Shoyaib and Muhammad Asif Hossain Khan : Bangla Spell Checker: A Distance and Prior Probability based Approach, JahangirNagar University Journal of Information Technology (JJIT) , vol.6 , pp.87-108 , 2017 . 10 Umme Hafsa Billah and Muhammad Asif Hossain Khan : A Systematic Literature Review on Segmentation and Recognition of Printed Bangla Characters, IUT Journal of Engineering and Technology (JET) , vol.13 , no.1 , pp.1-8 , 2016 . View More 11 Muhammad Asif Hossain Khan, Danushka Bollegala, Guangwen Li and Kaoru Sezaki : Delineating Real-Time Events by Identifying Relevant Tweets with Popular Discussion Points, ASE Human Journal , vol.2 , no.3 , pp.136-150 , 2013 . 12 Muhammad Asif Hossain Khan, Masayuki Iwai and Kaoru Sezaki : An Improved Classification Strategy for Filtering Relevant Tweets Using Bag-of-Word Classifiers, Journal of Information Processing , vol.21 , no.3 , pp.507-516 , 2013 . 13 Muhammad Asif Hossain Khan, Mohammad Shafkat Amin, Mohammed Shafiul Alam Khan and Fahima Amin Bhuyan : AFS: An improved file system with reduced file storage overhead, The Dhaka University Journal of Science , vol.55 , pp.43-51 , 2007 . 14 Muhammad Asif Hossain Khan, Shah Mustafa Khaled, Md. Touhidul Islam and Md. Sanaul Karim : Extending Mobile Phone SMS Capacity into Email, The Dhaka University Journal of Science , vol.55 , no.2 , pp.167 – 170 , 2007 . 15 Rony Hasinur Rahman, Nusrat Nowsheen, Mahbubul Azam Khan and Muhammad Asif Hossain Khan : Wireless LAN Security: An In-Depth Study of the Threats and Vulnerabilities, Asian Journal of Information and Technology , vol.6 , no.4 , pp.441-446 , 2007 . 16 Rony Hasinur Rahman, Nusrat Nowsheen, Mahbubul Azam Khan and Muhammad Asif Hossain Khan : Locating Mobile Phones on a City Map Using SMS Technology, The Dhaka University Journal of Science , vol.55 , no.2 , pp.211 – 213 , 2007 . 17 Muhammad Asif Hossain Khan, Md. Minhajul Abedin and Quazi Ashfaqur Rahman : An Efficient Huffman Encoding and Decoding Algorithm Using Improved Header Compression, Jahangir Nagar Physics Studies , vol.11 , pp.39-48 , 2005 . 18 Muhammad Asif Hossain Khan and Mosaddek Hossain Kamal : FLRC: An Improved Cache Coherence Protocol for Software DSM, The Dhaka University Journal of Science , vol.52 , no.2 , pp.133-140 , 2004 . Conference Proceedings 1 Saif Mahmud, M Tanjid Hasan Tonmoy, Kishor Kumar Bhaumik, A K M Mahbubur Rahman, M Ashraful Amin, Mohammad Shoyaib, Muhammad Asif Hossain Khan and Amin Ahsan Ali \"Human Activity Recognition from Wearable Sensor Data Using Self-Attention.\" 24th European Conference on Artificial Intelligence (ECAI) Santiago de Compostela, Spain: 2020 . 2 Md. Nazmul Haque, M. Tanjid Hasan Tonmoy, Saif Mahmud, Amin Ahsan Ali, Muhammad Asif Hossain Khan and Mohammad Shoyaib \"GRU-based Attention Mechanism for Human Activity Recognition.\" 1st International Conference on Advances in Science, Engineering and Robotics Technology (ICASERT) , pp. 1-6. Dhaka, Bangladesh: IEEE, 2019 . View More 3 Tahira Alam, Chowdhury Farhan Ahmed, Sabit Anwar Zahin, Muhammad Asif Hossain Khan and Maliha Tashfia Islam \"An Effective Ensemble Method for Multi-class Classification and Regression for Imbalanced Data.\" 18th Industrial Conference on Data Mining , pp. 59-74. Springer, New York, USA: 2018 . 4 Sadia Sharmin, Amin Ahsan Ali, Muhammad Asif Hossain Khan and Mohammad Shoyaib \"BFSp: A Feature Selection Method for Bug Severity Classification.\" 5th IEEE Region 10 Humanitarian Technology Conference (IEEE R10HTC) Dhaka, Bangladesh: 2017.12 . 5 Sadia Sharmin, Amin Ahsan Ali, Muhammad Asif Hossain Khan and Mohammad Shoyaib \"Feature Selection and Discretization based on Mutual Information.\" 2017 IEEE International Conference on Imaging, Vision & Pattern Recognition (icIVPR) Dhaka, Bangladesh: 2017.2 . 6 Guangwen Liu, Muhammad Asif Hossain Khan, Masayuki Iwai, Masaki Ito, Yoshito Tobe, Kaoru Sezaki and Dunstan Matekenya \"Beyond Horizontal Location Context: Measuring Elevation using Smartphone's Barometer.\" UbiComp , pp. 459-468. Seattle, USA: 2014.9 . 7 Muhammad Asif Hossain Khan, Danushka Bollegala, Guangwen Liu and Kaoru Sezaki \"Multi-Tweet Summarization of Real-Time Events.\" ASE/IEEE International Conference on Social Computing , pp. 128-133. Washington D.C., USA: 2013.9 . 8 Muhammad Asif Hossain Khan, Masayuki Iwai and Kaoru Sezaki \"A Robust and Scalable Framework for Detecting Self-Reported Illness from Twitter.\" 14th IEEE International Conference on E-Health Networking, Application and Services (IEEE Healthcom) , pp. 303-308. Beijing, China: 2012.10 . 9 Muhammad Asif Hossain Khan, Masayuki Iwai and Kaoru Sezaki \"Towards Urban Phenomenon Sensing by Automatic Tagging of Tweets.\" 9th International Conference on Networked Sensing Systems (INSS) , pp. 1-8. Antwerp, Belgium: 2012.6 . 10 Md. Saiful Islam, Lutfar Rahman, Muhammad Asif Hossain Khan, B.M. Mainul Hossain, Muhammad Rezaul Karim and Abdullah Al Mahmud \"Digital Signature: Does It Really Work for Electronic Documents?.\" 8th IEEE International Multi-topic Conference (INMIC) , pp. 473–479. Lahore, Pakistan: 2004.12 . 11 Muhammad Asif Hossain Khan, Mohammad Abu Nawar Siddique, Mohammad Asad-uz-zaman, Safwan Mahmud Khan and Syed Shahed Kabir Ro",
  "content_length": 11536,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:05"
}