{
  "name": "Mukesh Kumar Rohil",
  "homepage": "http://www.bits-pilani.ac.in/pilani/rohil/profile",
  "status": "success",
  "content": "Prof. Mukesh Kumar Rohil - BITS Pilani Campus Header Institute Header Home Academics Integrated first degree B.E.(Manufacturing Engineering) M.Sc.(Mathematics) M.Sc.(Chemistry) M.Sc.(General Studies) M.Sc.(Biological Sciences) M.Sc.(Physics) M.Sc.(Economics) B.E.(Mechanical) B.E.(Civil) B.E.(Electronics and Instrumentation) B.E.(Electronics and Communication) B.E.(Electrical and Electronics) B.E.(Chemical) B.Pharm.(Pharmacy) B.E.(Computer Science) Higher Degree M.E.(Sanitation Science, Technology and Management) M.E. Chemical Engineering (with specialization in Petroleum Engineering) M.E.(Chemical) MBA(Master of Business Administration In Business Analytics) Master in Public Health M.Sc. General Studies – Communication and Media Studies Stream M.E. (Mechanical with specialization in Thermal Engineering) M.E.(Software Systems) M.E. M.Pharm M.Pharm.(Pharmacology) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmacy) M.E.(Design Engineering) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E.(Microelectronics) M.E.(Mechanical) M.E.(Manufacturing Systems Engineering) M.E.(Embedded Systems) M.E. Electronics & Control M.E.(Computer Science) M.E.(Communication Engineering) M.E. Civil – Water Resource Engineering M.E.(Civil with specialization in Transportation Engineering) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Biotechnology) M.E.(Environmental Engineering) Doctoral Programmes Pharmacy Physics Civil Engineering Computer Science & Information Systems Electrical & Electronics Engineering Biological Sciences Chemical Engineering Chemistry Economics & Finance Humanities & Social Sciences Mathematics Mechanical Engineering Management WILP Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Department Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Faculty Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Students Student Activities Events & Festivals BITScan BITS Embryo Picture Gallery Convocation 2025 BITS BEAT Student Achievements Student Services Academic Counseling Academic Document/Verification Requests Student Facilities Student Welfare Procedure for Issurance of Duplicate Degree Anti Ragging Scrutiny of Grades Information for Prospective Students Prevention of Sexual Harassment Centers Teaching Learning Centre Centre for Women’s Studies Centre for Entrepreneurial Leadership Centre for Desert Development Technologies Centre for Robotics and Intelligent Systems Technology Business Incubator Central Instrumentation Facility AI Centre Alumni Quick Links Academic Counselling Center Medical Center Library e-services Outreach IT Services Unit Central Workshop Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITS Law School, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Prof. Mukesh Kumar Rohil Pilani Computer Science Professor, Department of Computer Science & Information Systems, BITS Pilani, Pilani Campus Artificial Intelligence and Expert Systems, Computer Networks, Computer Vision, Data Mining and Business Analytics, Geographical Information Systems and Remote Sensing, Pattern Recognition, Software Engineering Room No. 6120-H Department of Computer Science & Information Systems Birla Institute of Technology & Science, Pilani Pilani - 333031, Rajasthan, India rohil@pilani.bits-pilani.ac.in Phone (Desk): +91-1596-255615 Phone (Department): +91-1596-255405 Mukesh Kumar Rohil is a Professor of Computer Science & Information Systems (CSIS) at BITS Pilani. He leads the Kalipatnapu Augmented Reality/Virtual Reality Lab and the Multimedia and Human-Computer Interaction Lab there. He holds a Ph.D. in Computer Science & Engineering (2004), an M.E. in Systems & Information (1995), and an M.Sc. (Hons.) in Physics (1993) with a B.E. (Hons.) in Civil Engineering (1993) under the Dual Degree Program, all from BITS Pilani. His research interests lie in the domains of Artificial Intelligence, Computer Vision, Machine Learning, Extended Reality, Remote Sensing, Human-Computer Interaction, Software Engineering, Business Analytics, and Computer Networks. He has been a key member driving excellence in the Off-Campus Programmes and Industry Engagement for BITS Pilani. Prof. Rohil has a number of publications (60+) in refereed journals, proceedings of conferences, conventions, workshops, and symposia of repute published/organized by IEEE, Elsevier, Springer, Taylor & Francis, ACM, ISPRS, IET, ISRS, and Indian Buildings Congress amongst others. He has a design issued and two patents filed. His research has been funded by the government as well as industries in India and abroad. He has received sanction for the grant on “Support for Entrepreneurial and Managerial Development of SMEs through Incubators” from the Ministry of Micro, Small and Medium Enterprises (MSME), Government of India, New Delhi and has completed a minor research project funded by the University Grants Commission (UGC), Government of India, New Delhi. He has executed and coordinated several industry-sponsored research and development projects for the Technology Innovation Centre (TIC) of BITS Pilani; the sponsors include Sabre Travel Network, Bengaluru (Subsidiary of Sabre Corporation, Southlake, TX, USA), John Deere, Pune, and RedMed Health Systems, Bengaluru. Dr. Rohil has also completed a couple of externally funded consultancy projects pertaining to Management Information Systems, apart from accomplishing several in-house projects at BITS Pilani. He is a Senior Member of the Institute of Electrical and Electronics Engineers (IEEE), a Life Member of the Indian Society of Remote Sensing, and a Life Member of the Indian Society for Technical Education. He has been a reviewer for leading journals and has served on the Program/Advisory Committees of top conferences. He has delivered several invited keynotes and research talks at national venues. He has independently supervised three Ph.D. scholars and is currently supervising five. He has also (been) proactively served (serving) as a Doctoral Advisory Committee (DAC) Member for seven Ph.D. scholars and has been an external examiner for several doctoral theses/master's degree dissertations. He has supervised more than 40 Higher Degree Dissertations/Research Practices/Studies in Advanced Topics and 150 First Degree Theses/Projects having taught varied courses (27 in total) in CSIS and allied interdisciplinary area",
  "content_length": 12942,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:13"
}