{
  "name": "Mukesh Singhal",
  "homepage": "http://cloudlab.ucmerced.edu/people/~mukesh",
  "status": "success",
  "content": "Prof. Mukesh Singhal | UC Merced Cloud Lab Skip to content Select Language Select Language English Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scottish Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sudanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Directory Apply Give Enter your keywords CAPTCHAThis question is for testing whether or not you are a human visitor and to prevent automated spam submissions. UC Merced Cloud Lab CloudLab.UCMerced.edu Select Language Select Language English Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scottish Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sudanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Navigation menu Menu Prof. Mukesh SinghalProfessional Experience Honors and Awards Books Selected Publications Professional Activities Dr. Mehdi Bahrami Mina Naghshnejad Prof. Mukesh Singhal Curriculum Vitae Prof. Mukesh Singhal Director of Cloud Lab Chancellor’s Professor Computer Science and Electrical Engineering The University of California, Merced Email        MSinghal <at> UCMerced.edu Phone      209-228-4344 Location  S&E 296 RESEARCH INTERESTS Cloud Computing, Big Data, Computer and Networks Security, Cybertrust, Distributed Computing Systems, Performance Modeling and Evaluation of large, complex computer systems, Wiresless Networks and Mobile Computing, and Operating Systems. TEACHING INTERESTS Cloud computing, Computer and Networks Security, Wireless networks, Distributed Computing Systems, and Operating systems. EDUCATION Ph.D., Computer Science, University of Maryland (1986). B.E., Electronics & Comm. Eng., Indian Institute of Technology, Roorkee (1980). Click here for my new book on Distributed Computing. Review my Operating Systems, Computer Networks, and Distributed Systems books at Amazon.com. Awards and Honors: Gartner Executives Meet UK's Gartner Endowed Chair. IEEE Fellow (since 2001, \"For pioneering contributions to distributed computing systems\"). IEEE Technical Achievement Award, 2003. Commissioned as \"Kentucky Colonel\" by the Governor of Kentucky (2003). Lumley Research Award, (for demonstrating excellence in research), College of Engineering, Ohio State University, 1998. Wethington Award (in recognition of outstanding competitive or prestigious extramural funding), College of Engineering, University of Kentucky, 2007. Above and Beyond the Call of Duty Award, National Science Foundation, June 2001. (For demonstrating an outstanding performance in processing of proposals in the Information Technology Research program.) Ameritech Faculty Fellow, 1997-98. National Merit Scholarship, Government of India, 1974. My Graduated Ph.D. students (1) Yelena Yesha (1989), (2) Ajay Kshemkalyani (1991), (3) Duane Buck (1993), (4) A. Gahlot (1993), (5) N. Shivaratri (1994), (6) Golden Richard (1995), (7) M.G. Sriram (1995), (8) M. Ramachandran (1995), (9) Frank Adelstein (1995), (10) Ravi Prakash (1996), (11) R. Subramanian (1996), (12) W. Mostafa (1997), (13) D. Manivannan (1997), (14) K. Sheta (1997), (15) L. Ren (1998), (16) G. Dommety (1998), (17) Guohong Cao (1999), (18) Sri Subramanian (1999), (19) Yuping Yang (2000), (20) Jun Xu (2000), (21) Huaizhi Li (2006), (22) Venkata C. Giruka (2007), (23) Rendong Bai (2007), (24) Yongwei Wang (2008), (25) Saikat Chakrabarti (2008) (co-advisor: Ken Calvert), (26) Santosh Chandrasekhar (2011), and (27) Yan Sun (2011). Journal Editorships Associate Editor, IEEE Trans. on Dependable and Secure Computing, (2010-). Associate Editor, IEEE Trans. on Parallel and Distributed Systems, (2006-2009). Associate Editor, IEEE Trans. on Computers, (2002-2006). Associate Editor, IEEE Trans. on Data and Knowledge Engineering, (1999-2004). Associate Editor, Journal of Pervasive and Mobile Computing, (2004-) Associate Editor, Journal of Ubiquitous Computing and Intelligence, (2006-). Editor, Computer Networks, (1999-2003). Recent Conference Organization General Co-Chair, IEEE Int'l Conference on Sensor Networks, Ubiquitous, and Trustworthy Computing, June 2008, Taiwan. Program Co-Chair, IEEE Int'l Conference on Sensor Networks, Ubiquitous, and Trustworthy Computing, June 2006, Taiwan. General Chair, Second IEEE International Conference on Security and Privacy for Emerging Areas in Communication Networks (SecureComm 2006), Baltimore. Program Co-Chair, 2nd IEEE International Conference on Mobile Ad-hoc and Sensor Systems (MASS'05), November 7-10, 2005, Washington, DC. General Chair, The 24th IEEE Symposium on Reliable Distributed Systems, October 26-28, 2005, Orlando, FL. Vice Chair, Pervasive Communication Track, Third IEEE International Conference on Pervasive Computing and Communication (PerCom'05), Hawaii, March 2005. Chair, Steering Committee, The IEEE Symposium on Reliable Distributed Systems. Quotes to Ponder: \"A person should not be too honest. Straight trees are cut first and Honest people are screwed first\". --Chanakya (A great Indian politician, strategist and writer, 350 BC 75 BC). \"A mind all logic is like a knife all blade: it bleeds the hand that holds it.\" --Rabindranath Tagore \"Success is the ability to go from one failure to another with no loss of enthusiasm.\" --Winston Churchill \"The only ones among you who will be really happy are those who will have sought and found how to serve.\" --Albert Schweitzer Quotable Quotes: \"The fragrance of flowers spreads only in the direction of the wind. But the goodness of a person spreads in all direction\". --Chanakya (A great Indian politician, strategist and writer, 350 BC 75 BC). \"He is richest who is contect with the least, for content is the wealth of the nature\". -Socrates \"If you pick up a starving dog and make him prosperous, he will not bite you. That is the principal difference between a dog and a man.\" --Mark Twain \"If I have seen further than others, it is by standing upon the shoulders of giants.\" -Newton \"I can calculate the motion of heavenly bodies, but not the madness of people.\" -Newton \"I have never met a man so ignorant that I couldn't learn something from him.\" -Galileo \"All truths are easy to understand once they are discovered;....\" -Galileo \"..., If you want to test a man's character, give him power.\" --Abraham Lincoln \"A woman is the only thing I am afraid of that I know will not hurt me.\" --Abraham Lincoln \"Your vision will become clear only when you can look into your own heart. Who looks outside, dreams; who looks inside, awakes.\" --Carl Jung \"A fool thinks himself to be wise, but a wise man knows himself to be a fool.\" --William Shakespeare \"Go to your bosom: Knock there, and ask your heart what it doth know.\" --William Shakespeare Additional Links UC Merced Newsroom Executive Leadership University Library Academics School of Engineering School of Natural Sciences School of Social Sciences, Humanities & Arts Ernest & Julio Gallo Management Program Division of Graduate Education Division of Undergraduate Education Administration Office of the Chancellor Office of Executive Vice Chancellor and Provost Equity, Justice and Inclusive Excellence External Relations Finance & Administration Physical Operations, Planning and Development Student Affairs Research and Economic Development Office of Information Technology University of California, Merced 5200 North Lake Rd. Merced, CA 95343 Telephone: (209) 228-4400 © 2025 About UC Merced Directions Directory Privacy/Legal Site Feedback UC Regents Accessibility Nondiscrimination Policy Site List Please ensure Javascript is enabled for purposes of website accessibility",
  "content_length": 8953,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:14"
}