{
  "name": "Mukesh K. Mohania",
  "homepage": "https://www.iiitd.ac.in/mukesh",
  "status": "success",
  "content": "IIIT-Delhi Skip to main content -A A A+ AA Mukesh Mohania Mukesh Mohania Professor (CSE) PhD (1995), IIT Bombay Contact Details 011-26907355 mukesh@iiitd.ac.in Web Profile A-507 (R&D Block) Profile Mukesh Mohania received his Ph.D. in Computer Science & Engineering from Indian Institute of Technology - Bombay, India in 1995. He was a faculty member in University of South Australia and Western Michigan University from 1995-2001, and then worked at IBM Research (India and Australia) for 18+ years till October 2019 as Distinguished Engineer. His research interests are on Information (structured and unstructured data) integration, master data management, AI based entity analytics, big data analytics and applications, and blockchain data management. His work in these areas has led to the development of new products and also influenced several existing IBM products. He has received several awards within IBM, such as \"Best of IBM\", “Outstanding Innovation Award”, \"Outstanding Technical Achievement Award\", and many more. He has published more than 120 Research papers in reputed International Conferences and Journals and has more than 50 granted patents. He has held several visible positions in academia and professional activities, like Adjunct Professor at Australian National University and University of Melbourne, VLDB 2016 Conference Organising Chair, ACM India Vice-President (2015-2017), ACM Distinguished Service Award Committee Chair (2017-18), Distinguished Speaker Program Chair (2015-17), and editorial board member in several journals and transactions. He is an ACM Distinguished Scientist, a recipient of ACM Outstanding Service Award, and an IEEE Meritorious Award. He was a member of IBM Academy of Technology, and IBM Master Inventor. Research Interests Information Integration Entity Discovery and Analytics Big Data Analytics and Applications Blockchain Data Management Teaching Interests Information Management and Data Integration Affiliated Centres & Labs",
  "content_length": 1988,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:12"
}