{
  "name": "Mukkai Krishnamoorthy",
  "homepage": "http://www.cs.rpi.edu/~moorthy",
  "status": "success",
  "content": "Document Title : Mukkai S. Krishnamoorthy Mukkai S. Krishnamoorthy Mukkai S. Krishnamoorthy mskmoorthy@gmail.com Associate Professor(Retired)Ph.D., Indian Institute of Technology Here is a Graph Theory book in a story setting free to browse/download. Graph Theory Book in a story form If you have any comments, please let me know mskmoorthy@gmail.com contactinfo Problem Solving web graph of my website for click and shoot Compiler Technology Combinatorial and Algebraic Algorithms Teaching I Have retired from RPI I am deeply interested in Open Source Software Practices at RPI RCOS meetings are in DCC 318 at 4:00 pm on Every Tuesday , Friday during Fall and Spring I have been working on Table Recognition with a group from RPI and BYU on Tango project supported by NSF. I have been working Prof. Ron Eglash of the STS department on an NSF suported project (NSF GK-12) called triple helix. Details of the project may be found in triple helix . Prof Eglash's csdt site will give the nature and scope of NSF GK-12 project. My google scholar page is here - lists most of my publications from most recent These five are some of my most recent work (joint with John Punin and Andrew Morrison) Real-Time Monitoring and Alerting of Web Usage The W 3 live system uses LOGML and the graph library of the WWWPal suite, and lay the foundation for future developments. ... Paper with Andrew Morrison and John Punin. Description of the system is in W3Live , a real time web monitoring XGMML, an XML description of graphs. A system to view graphs in XGMML. WWWPal in C. LOGML an XML description of log reports. RGML, an RDF description of Graphs. WWWPal, A System for the analysis and synthesis of web documents. Visual Techniques for Computing Polyhedral Volumes Paper written jointly with T. V. Raman These are some of my joint work with Aaron Sherman and Dan Reed. Efficient Solutions for Peer to Peer Resource Discovery on Local Area Networks - Paper written jointly with Aaron Sherman, Daniel Reed. Cake Cutting is Not a Piece of Cake co-authored with Malik Magdon-Ismail and Costas Busch. Courses In the fall 2002, I taught (with Prof. Mark Goldberg and Prof. Bulent Yener) a course on Random Graphs and Webgraphs. There were interesting student projects. Interesting class projects done in Random and Web Graphs. Graph Draw in Java bu Ulfar Erlingsson. Mian Huang (My Master's student) have written a servlet that accepts a URL where graph format is stored in XGMML and displays the graph using Graph Draw. The number of vertices should not be too large!. startpage (using DOM parser) for your explorations or startpage (Using Sax parser) and hence faster . Generic Graph Package (Graph Base ) in Java by Dave Goldschmidt (My Master' student) Research My juggling and Pi. My other fun activities Research Seminar (9/11/01) The two graphs corresponding to the http://www.cs.rpi.edu/courses may be found in graph 1 and graph 2. Summary of the course web site can be found in structure report . The slides may be accessed from Talk only from CS sites (meaning cslab suns). ASHE was designed by John Punin and myself and developed by John Punin. Here is a game (scientific american March 97 Mathematical recreations Game) that I implemented. Picking Game Please let me know Mukkai Krishnamoorthy . Thanks. Here is a game (M. Krishnamoorthy, Subh, A Game on Digraphs, Journal of Recreational Maths Vol.28(2), 85-92, 96-97) that I implemented Subh Here is a small java program (written originally in modula2 by N. Wirth and I hand translated from modula 2) Space-filling Curve Fuzzy Clustering by Mary Anne Egan & Mike Kondorf",
  "content_length": 3616,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:13"
}