{
  "name": "Mukul S. Bansal",
  "homepage": "http://www.engr.uconn.edu/~mukul",
  "status": "success",
  "content": "Bansal, Mukul | College of Engineering Our websites may use cookies to personalize and enhance your experience. By continuing without changing your cookie settings, you agree to this collection. For more information, please see our University Websites Privacy Notice. UConn Cookie Information What are Cookies? Authentication Cookies Analytics Cookies Opt Out Web cookies (also called HTTP cookies, browser cookies, or simply cookies) are small pieces of data that websites store on your device (computer, phone, etc.) through your web browser. They are used to remember information about you and your interactions with the site. Purpose of Cookies: Session Management: Keeping you logged in Remembering items in a shopping cart Saving language or theme preferences Personalization: Tailoring content or ads based on your previous activity Tracking & Analytics: Monitoring browsing behavior for analytics or marketing purposes Types of Cookies: Session Cookies: Temporary; deleted when you close your browser Used for things like keeping you logged in during a single session Persistent Cookies: Stored on your device until they expire or are manually deleted Used for remembering login credentials, settings, etc. First-Party Cookies: Set by the website you're visiting directly Third-Party Cookies: Set by other domains (usually advertisers) embedded in the website Commonly used for tracking across multiple sites Authentication cookies are a special type of web cookie used to identify and verify a user after they log in to a website or web application. What They Do: Once you log in to a site, the server creates an authentication cookie and sends it to your browser. This cookie: Proves to the website that you're logged in Prevents you from having to log in again on every page you visit Can persist across sessions if you select \"Remember me\" What's Inside an Authentication Cookie? Typically, it contains: A unique session ID (not your actual password) Optional metadata (e.g., expiration time, security flags) Analytics cookies are cookies used to collect data about how visitors interact with a website. Their primary purpose is to help website owners understand and improve user experience by analyzing things like: How users navigate the site Which pages are most/least visited How long users stay on each page What device, browser, or location the user is from What They Track: Some examples of data analytics cookies may collect: Page views and time spent on pages Click paths (how users move from page to page) Bounce rate (users who leave without interacting) User demographics (location, language, device) Referring websites (how users arrived at the site) Here’s how you can disable cookies in common browsers: 1. Google Chrome Open Chrome and click the three vertical dots in the top-right corner. Go to Settings > Privacy and security > Cookies and other site data. Choose your preferred option: Block all cookies (not recommended, can break most websites). Block third-party cookies (can block ads and tracking cookies). 2. Mozilla Firefox Open Firefox and click the three horizontal lines in the top-right corner. Go to Settings > Privacy & Security. Under the Enhanced Tracking Protection section, choose Strict to block most cookies or Custom to manually choose which cookies to block. 3. Safari Open Safari and click Safari in the top-left corner of the screen. Go to Preferences > Privacy. Check Block all cookies to stop all cookies, or select options to block third-party cookies. 4. Microsoft Edge Open Edge and click the three horizontal dots in the top-right corner. Go to Settings > Privacy, search, and services > Cookies and site permissions. Select your cookie settings from there, including blocking all cookies or blocking third-party cookies. 5. On Mobile (iOS/Android) For Safari on iOS: Go to Settings > Safari > Privacy & Security > Block All Cookies. For Chrome on Android: Open the app, tap the three dots, go to Settings > Privacy and security > Cookies. Be Aware: Disabling cookies can make your online experience more difficult. Some websites may not load properly, or you may be logged out frequently. Also, certain features may not work as expected. Close UConn College of Engineering COE Search University of Connecticut Search UConn Search University Communications Search UConn Search UConn A to Z Index UConn A to Z Index Click to open menu Associate Professor, School of Computing Email mukul.bansal@uconn.edu Phone (860) 486-2572 Mailing Address University of Connecticut 371 Fairfield Way, Unit 4155 Storrs, CT 06269-4155 Campus Storrs Link Research Website Google Scholar Link Overview Research Interests Projects Teaching Publications Related News Fellows Brief Bio I am an associate professor of Computer Science & Engineering at the University of Connecticut. My research interests are in computational biology and bioinformatics, with an emphasis on computational phylogenetics and comparative genomics. More generally, I am interested in algorithms and combinatorial optimization. I lead the computational biology research group where we develop new computational methods, efficient algorithms, and powerful software tools to help answer fundamental biological questions. Inferring gene family and genome evolution through gene duplication, horizontal transfer, and loss. Understanding tumor evolution and inferring tumor phylogenies. Understanding and modeling evolution at the subgene/domain level. Reconstructing highly accurate gene trees for evolutionary and functional genomic studies. Inferring infectious disease transmission networks. Building whole-genome and multi-locus species phylogenies. A systematic assessment of phylogenomic approaches for microbial species tree reconstruction Samson Weiner, Yutian Feng, J. Peter Gogarten, Mukul S. Bansal Peer Community Journal, Vol. 5, e72, 2025 DICE: Fast and Accurate Distance-Based Reconstruction of Single-Cell Copy Number Phylogenies Samson Weiner, Mukul S. Bansal Life Science Alliance, 8(3), e202402923, 2025. → Simulated datasets used in this paper are available from Zenodo at https://doi.org/10.5281/zenodo.10108730 Investigating Additive and Replacing Horizontal Gene Transfers Using Phylogenies and Whole Genomes Lina Kloub, Sophia Gosselin, Joerg Graf, J. Peter Gogarten, Mukul S. Bansal Genome Biology and Evolution, 16(9), evae180, 2024. → The real dataset used in this paper is available from https://compbio.engr.uconn.edu/software/dart/ Assessing the potential of gene tree parsimony for microbial phylogenomics Samson Weiner, Yutian Feng, J. Peter Gogarten, Mukul S. Bansal RECOMB Comparative Genomics Conference (RECOMB-CG) 2024; LNCS 14616: 129-149. Reducing the impact of domain rearrangement on sequence alignment and phylogeny reconstruction Sumaira Zaman, Mukul S. Bansal International Symposium on Bioinformatics Research and Applications (ISBRA) 2023; LNBI 14248: 337–350. CNAsim: Improved simulation of single-cell copy number profiles and DNA-seq data from tumors Samson Weiner, Mukul S. Bansal Bioinformatics, 39(7), btad434, 2023. Generalizing the Domain-Gene-Species Reconciliation Framework to Microbial Genes and Domains Abhijit Mondal, Mukul S. Bansal IEEE/ACM Transactions on Computational Biology and Bioinformatics; 20(6): 3511-3522, 2023. DaTeR: Error-Correcting Phylogenetic Chronograms Using Relative Time Constraints Abhijit Mondal, L. Thiberio Rangel, Jack G. Payette, Gregory P. Fournier, Mukul S. Bansal Bioinformatics, 39(2), btad084, 2023. virDTL: Viral recombination analysis through phylogenetic reconciliation and its application to sarbecoviruses and SARS-CoV-2 Sumaira Zaman, Samuel Sledzieski, Bonnie Berger, Yi-Chieh Wu, Mukul S. Bansal Journal of Computational Biology, 30(1): 3-20, 2023. → A preliminary version of this paper is available on bioRxiv: https://doi.org/10.1101/2021.08.12.456131 On Partial Gene Transfer and its Impact on Gene Tree Reconstruction Sumaira Zaman, Mukul S. Bansal RECOMB Comparative Genomics Conference (RECOMB-CG) 2022; LNBI 13234: 168–186. Deciphering Microbial Gene Family Evolution Using Duplication-Transfer-Loss Reconciliation and RANGER-DTL Mukul S. Bansal In: Luo, H. (eds) Environmental Microbial Evolution. Methods in Molecular Biology, vol 2569, 2022. Humana, New York, NY. TNet: Transmission Network Inference Using Within-Host Strain Diversity and its Application to Geographical Tracking of COVID-19 Spread Saurav Dhar, Chengchen Zhang, Ion Mandoiu, Mukul S. Bansal IEEE/ACM Transactions on Computational Biology and Bioinformatics, 19(1): 230-242, 2022. (Published online in July 2021) → The global COVID-19 dataset used in this paper is available from the Datasets Page → Acknowledgement tables for COVID-19 sequences used in our analysis: Global sequences and US sequences. Improved Duplication-Transfer-Loss Reconciliation with Extinct and Unsampled Lineages Samson Weiner, Mukul S. Bansal Algorithms, 14(8): 231, 2021. Optimal Completion and Comparison of Incomplete Phylogenetic Trees Under Robinson-Foulds Distance Keegan Yao, Mukul S. Bansal Combinatorial Pattern Matching (CPM) 2021; Leibniz International Proceedings in Informatics (LIPIcs), Vol. 191, No. 25. → This paper won the best student paper award at CPM 2021. Systematic Detection of Large-Scale Multigene Horizontal Transfer in Prokaryotes Lina Kloub, Sean Gosselin, Matthew Fullmer, Joerg Graf, J. Peter Gogarten, Mukul S. Bansal Molecular Biology and Evolution, 38(6): 2639–2659, 2021. TreeFix-TP: Phylogenetic Error-Correction for Infectious Disease Transmission Network Inference Samuel Sledzieski, Chengchen Zhang, Ion Mandoiu, Mukul S. Bansal Pacific Symposium on Biocomputing (PSB) 2021: Proceedings, pages 119-130. → A preliminary version of this paper was posted to bioRxiv and is available here → Slides from the PSB 2021 presentation are available from https://doi.org/10.7490/f1000research.1118422.1 A Supervised Machine Learning Approach for Distinguishing Between Additive and Replacing Horizontal Ge",
  "content_length": 45949,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:19"
}