{
  "name": "Mun Choon Chan",
  "homepage": "https://www.comp.nus.edu.sg/~chanmc",
  "status": "success",
  "content": "Chan Mun Choon. Home Publications Grants Past Projects Past Students Teaching Services Software News Chan Mun Choon I graduated with a BS in Computer and Electrical Engineering from Purdue University and Ph.D. from Columbia University. I was a Member of Technical Staff in the Networking Research Laboratory, Bell Labs, Lucent Technologies before joining NUS. I am currently a Professor in the Department of Compuer Science, School of Computing. Contact: School of Computing, National University of Singapore Office: COM3 #02-15 Tel: +65 6516 7372 Email: chanmc AT comp dot nus dot edu dot sg Job/Research Opportunities I am looking to offer research projects in the areas related to programming networks (DPTP, DySo, SynDB, FCM) and 5G network (FSA, SLIC, PR3) Current Projects Programmable Network Research advances in Software Defined Networking (SDN) have enabled new paradigms and architectures through providing programmable capabilities to both the control and data plane. I am particularly interested in understanding how these capabilities enable new monitoring frameworks, control paradigms, virtualization strategies and speedup of large scale distributed computations. Related Papers [SIGCOMM'23] R Joshi, CH Song, XZ Khooi, N Budhdev, A Mishra, MC Chan, B Leong, Masking Corruption Packet Losses in Datacenter Networks with Link-local Retransmission, ACM SIGOCMM, Sep 2023. [SIGCOMM'23] CH Song, XZ Khooi, R Joshi, I Choi, J. Li, MC Chan, Network Load Balancing with In-network Reordering Support for RDMA, ACM SIGOCMM, Sep 2023. [ComputerNetworks'22] CH Song, XZ Khooi, DM Divakaran, MC Chan, DySO: Enhancing application offload efficiency on programmable switches, Computer Networks, 2023. [NSDI'21] PG Kannan, N Budhdev, R Joshi, MC Chan, Debugging Transient Faults in Data Center Networks using Synchronized Network-wide Packet Histories, USENIX conference on Networked Systems Design and Implementation (NSDI), April 2021. pdf [CoNEXT'20] CH Song, PG Kannan, BKH Low, MC Chan, FCM-sketch: generic network measurements with data plane support, CoNEXT, Dec 2020. pdf [ICNP'19]T. Qu, R. Joshi, MC. Chan, B. Leong, D. Guo, Z. Liu, SQR: In-network Packet Loss Recovery from Link Failures for Highly Reliable Datacenter Networks, International Conference on Network Protocols (ICNP) Oct 2019 (Best Paper). pdf [SOSR'19] PG Kannan, R Joshi, MC Chan, Precise Time-synchronization in the Data-Plane using Programmable Switching ASICs, Proceedings of the 2019 ACM Symposium on SDN Research. (Best Paper), April 2019. pdf Low Power, Energy Efficient Edge Computing With mobile devices becoming ubiquitous, collaborative applications have become increasingly pervasive. We look into various approaches in which these devices can leverage the available sensing, computation and communication capabilities to design collaborative applications. In particular, we are looking at how high-fidelity context awareness can be achieved with low-cost sensing and communication on resource-constrained devices and possibly with collaboration among many different devices. Related Papers [SENSYS'23] B. Sun, K. Sabharwal, G. Kim, M. Chan, J. Han, Testing Masks and Air Filters With Your Smartphones, ACM Sensys, Nov 2023. [MOBISYS'22] B Sun, RX Tan, Z Ren, MC Chan, J Han, Detecting Counterfeit Liquid Food Products in a Sealed Bottle Using a Smartphone Camera, ACM MobiSys, June 2022. [EWSN'22] E William and MC Chan, SpeedCollect: Data Collection Using Synchronous Transmission for Low-Power Heterogeneous Wireless Sensor Network, EWSN, Dec 22. pdf [INFOCOM'20] Paramasiven Appavoo, Mun Choon Chan, Anand Bhojan, MagB: Repurposing the Magnetometer for Fine-Grained Localization of IoT Devices, INFOCOM. [SECON'19] Ebram Kamal William, Mun Choon Chan, InDP: In-Network Data Processing for Wireless Sensor Networks, IEEE International Conference on Sensing, Communication and Networking (SECON) Jun 2019. pdf [IMWUT'18] H Hong, G Silva, MC Chan, CrowdProbe: Non-invasive Crowd Monitoring with Wi-Fi Probe. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2(3): 115:1-115:23 (2018) [IPSN'18] M. Mohammad, XiangFa Guo, and Mun Choon Chan, \"Codecast: supporting data driven in-network processing for low-power wireless sensor networks,\" 17th International Conference on Information Processing in Sensor Networks (IPSN '18). [EWSN'18] Mohammad, Mobashir, Raj Joshi, and Mun Choon Chan. \"EleTrack: Ultra-Low-Power Retrofitted Monitoring for Elevators.\" International Conference on Embedded Wireless Systems and Networks (EWSN 2018), Feb 2018. [TMC'17] Xiangfa Guo, Binbin Chen and Mun Choon Chan, \"Analysis and Design of Low-Duty Protocol for Smartphone Neighbor Discovery,\" IEEE Transactions on Mobile Computing, Dec 2017. [INFOCOM'16] Xiangfa Guo, Mobashir Mohammad, Sudipta Saha, Mun Choon Chan, Seth Gilbert and Derek Leong, \"PSync: Visible Light-Based Time Synchronization for Internet of Things (IoT),\" IEEE INFOCOM 2016. [IPSN'16] Mobashir Mohammad, XiangFa Guo, and Mun Choon Chan, \"Oppcast: Exploiting Spatial and Channel Diversity for Robust Data Collection in Dynamic Urban Environments,\" 15th International Conference on Information Processing in Sensor Networks (IPSN '16). [IPSN'14] Chengwen Luo, Hande Hong and Mun Choon Chan, “PiLoc: A Self-Calibrating Participatory Indoor Localization System,” ACM/IEEE International Conference on Information Processing in Sensor Networks (IPSN), April 2014. [IPSN'14] Manjunath Doddavenkatappa and Mun Choon Chan, “P3: A Practical Packet Pipeline Using Constructive Interference for Wireless Sensor Networks,” ACM/IEEE International Conference on Information Processing in Sensor Networks (IPSN), April 2014. [SENSYS'14] Kartik Sankaran, Akkihebbal L. Ananda, Mun Choon Chan and Li-Shiuan Peh, “Using Mobile Phone Barometer for Low-Power Transportation Context Detection,” ACM Conference on Embedded Network Sensor Systems (Sensys), Nov 2014. [SENSYS'13] Chengwen Luo and Mun Choon Chan, “Collaborative Inference of Human Conversation Networks Using Smartphones,” ACM Conference on Embedded Network Sensor Systems (Sensys), 2013. [NSDI'13] Manjunath Doddavenkatappa, Mun Choon Chan and Ben Leong, “Splash: fast data dissemination with constructive interference in wireless sensor networks,” USENIX conference on Networked Systems Design and Implementation (NSDI), 2013. [SENSYS'12] PG Kannan, SP Venkatagiri, MC Chan, AL Ananda, LS Peh, \" Low Cost Crowd Counting using Audio Tones,\" ACM Conference on Embedded Network Sensor Systems (Sensys), 2012. [MOBISYS'11] B Anand, K Thirugnanam, J Sebastian, PG Kannan, AL Ananda, MC Chan, RK Balan, “Adaptive display power management for mobile games,” ACM International Conference on Mobile Systems, Applications, and Services (Mobisys) 2011. 5G Network 5G is expected to support a wide variety of users with very diverse requirements. We are looking at how a combination of Software Defined Networking (SDN), Network Virtualization (NV) and cloud computing can be used to meet the requirements of scaling, flexibility and isolation. Related Papers [CCS'21] N Lakshmanan, N Budhdev, MS Kang, MC Chan, J Han, A Stealthy Location Identification Attack Exploiting Carrier Aggregation in Cellular Networks, USENIX Security Symposium, August 2021. pdf s [MOBICOM'21] N Budhdev, R Joshi, PG Kannan, MC Chan, T Mitra, FSA: fronthaul slicing architecture for 5G using dataplane programmable switches, ACM MOBICOM 2021. pdf [INFOCOM'18] Nishant Budhdev, Mun Choon Chan, Tulika Mitra, “PR3: Power Efficient and Low Latency Baseband Processing for LTE Femtocells,” IEEE International Conference on Computer Communications (INFOCOM), April 2018. pdf Network Anaomly Detection This research project focuses on exploiting the availability of enormous amount of customers and traffic data that are generated by telcos. These techniques include analysis of traffic/customer/application data to detect anomalies. Related Papers [AsiaCCS'19] Q. Nguyen, R. Oikawa, D. Divakaran, MC Chan, K. Low, Markov Chain Monte Carlo-Based Machine Unlearning: Unlearning What Needs to be Forgotten. AsiaCCS 2022. [CNS'19] Q. Nguyen, K. Lim, D. Divakaran, K. Low, MC. Chan, GEE: A Gradient-based Explainable Variational Autoencoder for Network Anomaly Detection, IEEE Conference on Communications and Network Security (CNS), Jun 2019. pdf This page uses the Perfect 'Full Page' 1 column Liquid Layout by Matthew James Taylor. View more website layouts and web design tips.",
  "content_length": 8456,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:14"
}