{
  "name": "Munira Raja",
  "homepage": "https://liverpool.ac.uk/electrical-engineering-and-electronics/staff/munira-raja",
  "status": "success",
  "content": "Dr Munira Raja | Our people | University of Liverpool Skip to main content Close Search Find courses, people, research, information and more. Please ignore What types of page to search? All Courses Academic staff News Events Search Popular pages: Undergraduate Postgraduate PhD Accommodation Research International students Alternatively use our A-Z index. About I graduated with a BEng Honours degree in Computer and Microelectronic Systems, at the University of Liverpool in 1999. I proceeded to do a PhD in Organic Electronics, where I researched the effects of utilising novel conjugated polymers in Electronic devices such as thin-film transistors. This research was funded by EPSRC, under the Carbon-Based Electronics (CBE) project. From 2004, I worked as research associate on a European project ‘PolyApply’, funded under the Fp6 EU programme. The project had interests in generating smart organic devices that integrate a range of electronic capabilities. For a demonstrator, the consortium presented a functional Radio Frequency Identification (RFID) tag with organic devices. In 2008, I was appointed a lectureship in the Department of EEE, under the Organic Electronics group. My current research interest includes development of low-cost flexible organic circuits, for use as key functional blocks in various mixed signal applications such as smart sensor (SIMS EU project), display (Case Award with Merck Chemicals Ltd) and RFID tag (PolyApply project). To learn more about my research activities, please follow the Organic Electronics Research group at http://www.liv.ac.uk/electrical-engineering-and-electronics/research/organic-electronics/about/. Prizes or Honours Best Publicly Funded Project (SIMS) Demonstrator - (Munich) (Organic Electronics Association (OE-A), 2013)",
  "content_length": 1788,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:21"
}