{
  "name": "Munmun De Choudhury",
  "homepage": "http://www.munmund.net",
  "status": "success",
  "content": "Home | munmund Munmun De Choudhury, Ph.D Georgia Tech Home Research Papers Talks CV Teaching SocWeB Lab mchoudhu@cc.gatech.edu CODA Tech Square (C1576B) 756 W Peachtree St NW Atlanta, GA 30308 +1 (404) 385-8603 Twitter: @munmun10 I am J.Z. Liang Professor in the School of Interactive Computing at Georgia Institute of Technology. I Co-Lead the Patient-Centered Care Delivery research pillar at the Children's Healthcare of Atlanta Pediatric Technology Center at Georgia Tech (PTC). Given the diversity of my intellectual interests, I am also affiliated with the Institute for People and Technology (IPaT), the Machine Learning Center (ML@GT), the Institute for Data Engineering and Science (IDEaS), and the Petit Institute for Bioengineering and Bioscience (IBB) at Georgia Tech. Research Background and Interests. Trained as a computer scientist studying internet phenomena, my career has been dedicated to research that tackles some of the most pressing challenges of the 21st century. Sitting at the intersection of the fields of computer science and social science, my work employs large-scale data analytics, machine learning, and artificial intelligence techniques to understand human behavior and dynamics in online environments. Core to these investigations is a highly interdisciplinary approach, blending insights from psychology, sociology, medicine, and public health with advanced computational methods. Over the past decade, I have been passionate about how novel forms of social interaction online might shape our health and well-being. In particular, first proposed in this influential paper, my research has pioneered the computational use of social media data for mental health. This topic now constitutes a full-fledged research direction pursued by scholars and practitioners worldwide, within and beyond academia. Specifically, my work has led to significant advancements in the development of computational tools and techniques for early detection, intervention, and support in mental health care, fostering collaborations and synergies, nationally and internationally, across academia, industry, practitioner, advocacy, and public health sectors. My recent work explores how emerging technologies, especially generative AI, are transforming the ways we connect and care for one another online. If the past decade positioned social media as a conduit for human-to-human interaction, todays AI systems introduce a new modality: one where conversations, empathy, and even support may be mediated or replaced by machines. This shift raises profound questions: How will AI-based interaction shape experiences of loneliness, stigma, or belonging? What does it mean to encounter care, or harm, when delivered through an algorithmic agent? Can machines foster authentic connection and psychological safety, or do they risk deepening isolation under the guise of support? My ongoing work seeks to guide us through this evolving terrain while navigating regulatory gray zones, engaging diverse stakeholders, and staying nimble to the rapidly changing risks and opportunities of AI, with the aim of amplifying, rather than eroding, our collective well-being. Recognition. I have been fortunate to have my research recognized through several awards and honors over the years. These include, the 2023 SIGCHI Societal Impact Award, the 2023 AAAI ICWSM and the 2022 Web Science Trust Test-of-Time Awards, the 2021 ACM-W Rising Star Award, the 2019 Complex Systems Society  Junior Scientific Award, and over a dozen best paper and honorable mention awards from the ACM and AAAI. In 2024, I was inducted to the SIGCHI Academy, one of the highest recognitions from the Special Interest Group on Computer-Human Interaction. My work features quite frequently in popular press like the New York Times, the NPR, and the BBC, among other national and international outlets. Leadership and Impact. Beyond academic impact, my research has resulted in many practical and policy implications. These range from contributing to suicide prevention efforts at the Centers for Disease Control and Prevention, to supporting gun control advocacy by the non-profit Everytown for Gun Safety, and to helping the National Academies of Sciences, Engineering, and Medicine draft a consensus report on the impact of social media on the wellbeing of young people. Notably, I was an invited contributor to the Office of U.S. Surgeon General's 2023 Advisory on The Healing Effects of Social Connection. Recently, I have served as a member of the Technical Advisory Group of the Commission for Social Connection at the World Health Organization. I have also served in varied leadership roles on topics related to my research expertise. I serve on the advisory boards of a number of initiatives and organizations, including the Jockey Club Online Youth Emotional Support  Open Up (2018-), The New Public Initiative (2019-), the International Society for Computational Social Science (2021-), the American Foundation for Suicide Prevention (2023-), and the Steering Committee of the International Conference on Web and Social Media  the leading multidisciplinary annual gathering that publishes cutting edge research on social media. SocWeB Laboratory. At Georgia Tech, I founded and direct the Social Dynamics and Wellbeing Lab (SocWeB Lab). We study, analyze, and use social media, responsibly and ethically, to derive computational, large-scale data-driven insights, and to develop mechanisms and technologies for improving our well-being, particularly our mental health. Please refer to the Research page for details about our research agenda, and the Publications page for recent efforts. Our research is and has been graciously supported by funds from the National Institutes of Health (NIH), National Science Foundation (NSF), Intelligence Advanced Research Projects Activity (IARPA), Centers for Disease Control and Prevention (CDC), American Foundation for Suicide Prevention (AFSP), Betty and Gordon Moore Foundation, Everytown for Gun Safety, the United Nations Foundation, John Templeton Foundation, Microsoft, Instagram, Mozilla, Yahoo!, Cisco, and Samsung, totaling over $42 million. Prospective Students. Please read my note here. Media Inquiries. I frequently speak to the local, national, and international media on issues and events related to my research topics, involving, but not limited to: digital mental health; mental health equity; social media; harms of social media and digital technologies; benefits, harms, and role of AI in mental health, and others. The best way to reach me is via email; I can turnaround pretty quickly on such inquiries, especially those of a time-sensitive nature. Speaking Engagements. I do receive several requests for speaking engagements and participation in various meetings, workshops, conferences, and other convenings. Please reach to me via email to discuss such prospects for your event. A formal biography is included here. From the Past. I have been fortunate to have spent quality time in an eclectic set of places at different points in my career. Before moving to Georgia Tech in Spring 2014, I was a postdoctoral researcher in the neXus group at Microsoft Research, Redmond, between 2011 and 2013. I received my Ph.D in 2011 from the Department of Computer Science at Arizona State University, Tempe, where I was a part of the transdisciplinary program and venture on digital media: Arts, Media & Engineering. Following grad school, I also spent some time at the School of Communication and Information, Rutgers. In the academic year 2014-15, I was also a faculty associate with the Berkman Center for Internet and Society at Harvard. I was born in India and grew up in one of the smallest and one of the most remote parts of the country, the state of Tripura. So at my core, I am still a small town girl! When not working, I cherish my passion for art, culture, and history. © Copyright 2006 - 2024 | Munmun De Choudhury.",
  "content_length": 7971,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:17"
}