{
  "name": "Murat Kantarcioglu",
  "homepage": "https://www.kantarcioglu.net",
  "status": "success",
  "content": "Dr. Murat Kantarcioglu's Web Page Dr. Murat Kantarcioglu Professor of Computer Science and CCI Faculty Fellow, Virginia Tech Director, The Data Security and Privacy Lab @ Virginia Tech Faculty Associate, Harvard University Data Privacy Lab Adjunct Professor, University of Texas at Dallas Email: muratk at vt. edu My research is centered on developing technologies capable of efficiently extracting valuable information from data without compromising privacy or security. My work spans various domains, including addressing security and privacy challenges in data science and machine learning, social networks, databases, healthcare, and applied cryptography for data security. I also delve into risk and incentive issues in assured information sharing, as well as employing machine learning for cybersecurity and homeland security purposes. More recently, my focus has shifted towards exploring security, accountability, fairness, and privacy concerns in machine learning, along with the application of blockchain technology for assured information sharing. I am the the recipient of various awards including NSF CAREER award, the AMIA (American Medical Informatics Association) 2014 Homer R Warner Award and the IEEE (Institute of Electrical and Electronics Engineers) ISI (Intelligence and Security Informatics) 2017 Technical Achievement Award presented jointly by IEEE SMC and IEEE ITS societies for my research in data security and privacy. I am also a fellow of AAAS (American Association for the Advancement of Science), and IEEE, and a distinguished member of ACM. Before September 1st, 2024, I was an Ashbel Smith Professor of Computer Science at UT Dallas. Please visit the old UTD Data Security and Privacy Lab's web page for more details related to our past research and publicly available software. In addition, please see the following interview for a summary of some of our research results. Please also see the some of the news articles that mention our research or views on data security and privacy: Boston Globe, ABC News, GenomeWeb, ACM News, Network World, The Huffington Post, Dallas Morning News, KDAF-TV Channel 33(1)(Social network privacy related), KDAF-TV Channel 33 (2) (CyberStalking related), CBS 11 TV, Marketsforgood.org My perspectives on Data-Centric Cybersecurity (slides). Some of  the conferences that I am involved with. CV For biographical and historical info, please see my NSF Style [CV] Publications Publication information, please visit the following page [Publications]. Education Purdue University, West Lafayette, Indiana, USA Ph.D., Computer Science, Advisor: Chris Clifton, August 2005 Graduate Certificate in Applied Statistics, May 2005. METU, Ankara, Turkey B.S., Computer Engineering with Minor in Finance, June 2000 Teaching For information on courses that I teach, please visit the following web page  [Teaching] Current Ph.D. Students Mestan Celik Firat (@UTD) Kunal Mukherjee (co-advised with Dr. Kangkook Jee) (@UTD) Umid Suleymanov (@VT) Chengen Wang (@UTD) Alumni I had chance to work with many talented students over the years. Please visit the following page for Alumni information [Alumni].",
  "content_length": 3153,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:22"
}