{
  "name": "Murat Yuksel",
  "homepage": "http://www.ece.ucf.edu/~yuksem",
  "status": "success",
  "content": "Murat Yuksel – Professor of ECE, CS, CREOL @UCF Murat Yuksel Professor of ECE, CS, CREOL @UCF My research interests are in networked, wireless, and computer systems with a recent focus on optical wireless, spectrum sharing, device-to-device systems, network architectures and economics, and network management. My older work, with occasional current activity, has included wireless routing, multicast, peer-to-peer and overlays, and network science. I direct Networking and Wireless Systems Lab (NWSL) at UCF. Our work spans both theoretical and experimental aspects of computer and networked systems research. I am a strong believer in inter-disciplinary research and much of my projects have been collaborative with experts from fields other than networking like economics, math, management/policy sciences, and physics. Here is a list of some of our recent projects: FAN4Science: Flow-Aware Networking for Data-Intensive Science INWADE: INtelligent Waveform Adaptation with DEep Learning (w/ Clemson) 3D RF/FSO Mesh Networking with Challenged Infrastructure Directional Software-Defined Radio Some of the earlier projects include the followings: A Visible Light Communication (VLC) Testbed for Next Generation Wireless Research (w/ Georgia State) Secure Communications Link Between Robotics and Autonomous Systems Stable and Efficient Peering Through Internet Exchange Points (IXPs) (w/ RPI) Multi-Element Mobile Visible Light Communication for Smart Cities Modeling and Development of Resilient Communication for First Responders in Disaster Management (w/ UC Riverside, UIC, and Rutgers) US Ignite: Rapid and Resilient Critical Data Sourcing for Public Safety and Emergency Response (w/ VCU) Multi-Element Illuminication for Mobile Free-Space-Optical Networks (w/ FIU, NCSU) Pervasive Spectrum Sharing for Public Safety Communications (w/ NCSU and VTech) OMEGA: Online Management, Experimentation, and GAme of Large-Scale Networks FSO-MANETs: Free-Space-Optical Mobile Ad-hoc Networks (w/ RPI) Contract-Switching: Value Flows and Risk Management Architecture for Future Internet (w/ RPI) PIM Reconfiguration in Backbone Video Networks (w/ AT&T Labs) Value of Class-of-Service (CoS) Support in the Internet Backbone (w/ AT&T Labs) DTONs: Towards Disconnection Tolerant, Opportunistic Internet (w/ RPI)",
  "content_length": 2305,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:24"
}