{
  "name": "Murat Aydos",
  "homepage": "https://web.cs.hacettepe.edu.tr/~maydos",
  "status": "success",
  "content": "Murat AYDOS | HOME Murat Aydos Hacettepe University About Me Research Publications Teaching Gallery Contact & Meet Me Download CV Bio Dr. Murat Aydos received the B.Sc. degree from Yıldız Technical University (Turkey) in 1991, and M.S. degree from Electrical and Computer Engineering Department, OklahomaState University (USA), in 1996. He completed his Ph.D. study in Oregon State University, Electrical Engineering and Computer Science Department in June 2001. He has been a scholar funded by Higher Education Council (YÖK) for his studies in the USA. Dr. Murat Aydos worked at Oregon State University as an Instructor between September 2000 and June 2001 teaching several Signal Processing and Cryptography & Network Security courses. He also worked in Intel Corporation as an Security Architect for a period of 4 months in 2000. Between June 2001 and 2002, he has worked as a software test engineer in a start-up company called rTrust specialized on cryptographic hardware software solutions. As of July 2002, he started working at Pamukkale University, Computer Engineering Department as an Assistant Professor. In October 2006, Dr. Aydos was appointed for a specific task at The Scientific Technological Research Council of Turkey (TUBİTAK). As a director and coordinator, Dr. Aydos has been in charge of organizing the admition, evaluation and monitoring processes of R&D Fund Programs in the area of ICT for 5 years. He has also been the serving Turkish delegate for COST in the ICT domain during 2007-2014.Dr. Aydos joined Informatics Institute @ Hacettepe University in April 2013. He is the Head of Information Security Division at the Informatics Institute. Dr. Aydos is the author/co-author of more than 15 technical publications focusing on the applications of Cryptographic Primitives, Information & Data Security Mechanisms. Academic Position Present 2103 Asistant Professor Hacettepe University, Informatics Institute Oct.2006 Dec.2002 Asistant Professor Pamukkale University, Computer Engineering Department Jul.2001 Sep.2000 Instructor Oregon University, Computer and Computer Engineering Deparment 2002 1994 Research Assistant Pamukkale Uiversity, Engineering Department 1993 1991 Reaserch Assistant Yıldız Technical University, Electrical and Computer Engineering Department Education & Training Ph.D. 2001 Ph.D. in Oregon State University, USA M.S.1996 Master of Science in Oklahama State University, USA B.Sc.1991 Bachelor of Science in Yıldız Technical University, Turkey Professional and Administrative Experiences 2013 Informatics Institute, Hacettepe University Head of Information Security Division at Informatics Institute, Hacettepe University 2007 - 2014 Eroupean Cooperation in Science and Technology Delegate for Turkey in European Cooperation in sciences and Technology(COST), ICT Domain, April 2007 - 2014 2011 TÜBİTAK, BİDEB As an Expert in the Department of Science Fellowships and Grant Programmes (BİDEB) at TÜBİTAK, Ankara, Turkey. April 2011 - October 2011 2006 - 2011 TÜBİTAK Director and Coordinator of Electrical, Electronics and Informatics Research Founding Group, TÜBİTAK, Ankara, Turkey 2005 - 2008 Information Technologies Congress Member and local secretary of Information Technologies Organization Committee, Akademik Bilişim 2006, Pamukkale University 2004 - 2005 Cisco Local Academy, Pamukkale University Director of Cisco Local Academy at Pamukkale University. Octoer 2004 - October 2005 2004 - 2005 Journal of Engineering Sciences Member at Journal of Engineering Sciences comittee. October 2004 - october 2005 2001 - 2002 rTrust Technologies Inc. Security Architect and Test Engineer at rTrust Technologies Inc. Corvallis, Oregon, USA. April 2001 - june 2002 2000 - 2002 Intel Corporation Security Architect, Intel Corporation, Portland, Oregon, USA. January 2000 - May 2002 1998-2000 Oregon Unversity President, Turkish Student Association at Oregon State University Research Summary Interests Cryptography Information and Network Security Privacy and Security in Wireless, Ad-hock and Sensor Networks Digital Certificates and Public Key Infrastructures ID-based Cryptography Authentiction and Agreement Protocols Application-level Network Security Protocols Electronic Commerce and Payment Systems Thesis Students Esra Şahin Master of Science Spam-Ham E-mail Classification Using Machine Learning Methods Based on Bag of Word Techniqs + Follow Ahmet Deniz Nalbant PhD Modelling and Comparing Ouality and Cost Criteria Optimization in laboratory Ouality Systems by Using Westgard Rules and Levy Jennings Carts + Follow Yılmaz Vural PhD + Follow Ahmet Kutluana PhD Design and Implementation of IO T-based Secure Smart Home Systems + Follow Maryam Moharramzadeh Master of Science Quantitive Analysis of Common Criteria Certification Practice and Automated Conversion Model for CC Process + Follow Meriç Çetin Master of Science + Follow Great lab Personel! Project Activities Map2Heal Global Health Guide Uygulamanın gerek web arayüzündeki modüllerde gerekse mobil araryüzündeki hasta ile ilgil verilerin güvenliğinin sağlanması ve bu verilerin analizi sonucu sağlık haritası çıktısının elde edilmesi. Korugan United Threat Managment İlgili iş paketleri kapsamında: - Firewall Modülü - IDS/IPS Modülü - Web Filterleme Modülü - E-posta Filterleme Modülü - Spam Modülü - VPN ve IPSEC Modülü - Loglama ve Raporlama Modülü tasarım ve gerçeklemelerinde bilşmsel danışmanlık verilmesi. Akıllı Süreç İzleme, Yönetim ve Analiz Platformu Very short description of the project. Güvenli dosya paylaşımı, erişim yetkilendirmesi, hiyerarşik gizlilik sağlanması, anahtar üretim ve dağıtım teknikleri konusunda bilimsel danışmanlık. Yeni Nesil Güvenli Reklam Dağıtım Platformu Very short description of the project. İlgili iş paketleri kapsamında: - Düşük maliyetli ve tüm dünyada hizmet verebilecek ölçeklenebilir bir internet servisi kurulması, işletilmesi ve operasyonu. - Sahtekarlık (Fraud) tanımaya ve önlemeye yönelik mekanızmaların kurulması ve çalıştırılması. - Doğru reklam- kullanıcı eşleşmesini sağlayacak veri madenciliği çalışmaların yapılması ve geliştirilmesi. tasarım v gerçeklemelerinde bilimsel danışmanlık verlimesi. E-posta Siber İstihbarat Merkezi Very short description of the project. İlgili iş paketleri kapsamında: - Sahadaki cihazlardan gelen milyonlarca e-postalara ait verilerin ve istatiklerinin, - Web filterleme çözümlerinden gelen zararlı/temiz ve IP/domain/URL listelerinin, - Üçüncü-parti, açık kod sistemlerden gelen kötücül yazılım dosyalarının korelasyunu yapılarak e-posta içerisindeki IP/domain/URL bilgileri için itibar sistemi oluşturulması görevlerinde bilimsel danışmanlık. Selected Publications Filter by type: All types Jounal Papers Conference Papers Book Chapters Books Sort by year: p-GAIN: A Utility Based Data Publishing Model Yılmaz Vural, Murat Aydos Journal Paper Journal of the Faculty of Engineering and Architecture of Gazi University, May 2017 Abstract Data privacy is a difficult problem that tries to find the best balance between the privacy risks of data owners and the utility of data sharing to the third parties. Anonimization is the most commonly applied technique to overcome data privacy problems. The equivalence classes, the natural outcome of anonymization process, are classified according to the data utility in two main categories: Utility and Outlier Equivalence Classes (UEC, OEC). The utility equivalence class contains records that have been suppressed by anonymization techniques for privacy concerns. Menawhile, the outlier equivalence class contains records that have been fully suppressed by anonymization techniques resulting in no data utility. In this study, ρ-Gain model, which focus on the effect of outlier equivalence class for increasing data utility, is proposed. In the proposed model, k-Anonymity and 1-Diversity privacy models are used together with ρ-iterations to reduce the privacy risks. The Equivalence class average metric was used to measure data utility. According to the findings obtained from the study, the ρ-Gain model improved the data utility, but did not cause a significant negative impact on privacy risk estimates. With the use of the proposed ρ-Gain model as an anonymization technique, we have shown that the data utility has improved while keeping the data privacy risk with no significant change. A Detailed Study on Routing Security for Ad Hoc Networks Yılmaz Vural, Murat Aydos, Mehmet Tekerek Journal Paper Bilişim Teknolojileri Dergisi, Volume 9, Issue 2, 2016, Pages 171-180 Abstract Ad-hoc networks are temporary networks, which use wireless media that consists of interconnected nodes without a common network infrastructure using wireless media for immediate and dedicated network solutions. Ad-hoc networks are much vulnerable against the threats compared to the traditional networks due to its nature of lacking of a central control mechanism and the individual attitude of each node. In this study, the security threats and the routing protocols defined for ad hoc networks are investigated and the findings are evaluated. The aim of the study is to reach a generalized conclusion on the existing routing protocols in ad-hoc networks by evaluating the advantages and disadvantages of these protocols. In this paper, it is shown that the routing and security protocols to be used in ad-hoc networks should be designed by providing a resistance, robustness and high energy efficiency in order to overcome security treats aiming for confidentiality, integrity and accessibility. The balance between resistance to threats, high energy efficiency and robustness should be carefully considered and implemented in an autonomous way by weighting each of them for a specific task. Chaotic Image Encryption with Random Shuffling of Data Murat Aydos, Alper Uğur Journal Paper Pajes, Volume 20, Issue 2, February 2014, Pages 31-35 Abstract Security of valuable multimedia contents such as images in personal photograph albums, electronic publishi",
  "content_length": 46567,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:22"
}