{
  "name": "Murat Manguoglu",
  "homepage": "http://user.ceng.metu.edu.tr/~manguoglu",
  "status": "success",
  "content": "Webpage of Murat Manguoglu [Education | Research | Publications | Research Grants | Teaching | Curriculum Vitae] Murat Manguoglu Department of Computer Engineering A407 Middle East Technical University, 06800 Ankara , Turkey Office: (+90) 312 210 5551 Fax: (+90) 312 210 5544 Research Group: Parallel Processing Laboratory Email: manguoglu(at)ceng.metu.edu.tr or murat.manguoglu(at)gmail.com Office hour: Monday 14:00-15:00 Note: I do not respond to unsolicited email applications for summer internships. Education: Phd. Purdue'09, Computer Science and a specialization in Computational Science (phd family tree) MSc. the University of Utah'04, Computational Engineering and Science BSc. METU'02, Electrical and Electronics Engineering Research Interests: Parallel Computing and Numerical Linear Algebra Join us: I am always looking for highly motivated undergraduate or graduate students that are interested in parallel computing, numerical linear algebra and their applications in science and engineering. Awards and Research Grants: Manguoglu M; Science Academy Young Scientist Award, 2020 Manguoglu M; Alexander von Humboldt Foundation Fellowship for Experienced Researchers, 2017 Manguoglu M; Turkish Academy of Sciences Distinguished Young Scientist Award, 2013 Manguoglu M (PI); TUBITAK Career Award EEAG111E238; (1/5/2012 -1/5/2014) ; Parallel Solution of Sparse Linear Systems Manguoglu M (PI); METU BAP-08-11-2011-128; (1/7/2011 - 31/12/2013); Solution of Linear Systems on Parallel Computers Manguoglu M (researcher); The Partnership for Advanced Computing in Europe First Implementation Phase (PRACE-1IP), European Community's Seventh Fram Programme (FP7/2007- 2013) under grant agreement no: RI-261557; (2/6/2011-2/6/2012) Sameh A and Manguoglu M(co-PI); from Intel Corporation; (1/6/2009 - 31/5/2010); Towards an Adaptive Library for Solving Large Sparse Linear Systems Manguoglu M (researcher); various projects during (2005-2010); NSF (NSF-CCF-0635169), DARPA/AFRL (FA8750-06-1-0233), DOE (DE-FC52-08NA28617) and funding from Intel Corporation Selected refereed publications : (A local preprint or postprint PDF of the papers are provided whenever allowed by the publisher, see http://www.sherpa.ac.uk/romeo/ for the specific rules of different publishers. For the final copy of any paper please follow publisher links provided or email me) Torun FS, Manguoglu M, Aykanat C, Enhancing block Cimmino for sparse linear systems with dense columns via Schur complement, SIAM Journal on Scientific Computing, 45(2),pp. C49-C72, 2023 ~PDF Publisher's version Torun T, Torun FS, Manguoglu M, Aykanat C, Partitioning and reordering for Spike-based distributed-memory parallel Gauss-Seidel, SIAM Journal on Scientific Computing, 44(2), pp. C99-C123,2022 ~PDF Publisher's version Manguoglu M, Mehrmann V, A two-level iterative scheme for general sparse linear systems based on approximate skew-symmetrizers, Electronic Transactions on Numerical Analysis Volume 54,pp.370-391, 2021 Publisher's version Manguoglu M, Mehrmann V, A Robust Iterative Scheme for Symmetric Indefinite Systems, SIAM Journal on Scientific Computing, 41 (3), A1733-A1752, 2019 ~PDF Publisher's version Torun FS, Manguoglu M, Aykanat C, A Novel Partitioning Algorithm for Accelerating the Block Cimmino Algorithm, SIAM Journal on Scientific Computing, 40(6), pp.C827-C850, 2018 ~PDF Publisher's version Arslan H, Manguoglu M, A Parallel Bio-inspired Shortest Path Algorithm , Computing, 101(8), 969-988, 2019 ~PDF Publisher's version Torun FS, Manguoglu M, Aykanat C, Parallel minimum norm solution of sparse block diagonal column overlapped underdetermined systems, ACM Transactions on Mathematical Software,43(4), pp. 31:1--31:21, 2017 ~PDF Manguoglu M, Parallel solution of sparse linear systems, High Performance Scientific Computing, Springer (book chapter, editors:M. Berry, K. Gallivan, E. Gallopoulos, A. Grama, B. Philippe, Y. Saad and F. Saied), 2012 Publisher's version Manguoglu M, Koyuturk M, Sameh A, Grama A, Weighted Matrix Ordering and Parallel Banded Preconditioners for Iterative Linear System Solvers, SIAM Journal on Scientific Computing, 32(3), pp.1201-1216, 2010 ~ PDF Publisher's version Mikkelsen CCK, Manguoglu M , Analysis of the Truncated Spike Algorithm, SIAM Journal on Matrix Analysis and Applications, 30(4), pp.1500-1519,2008, ~ PDF Publisher's version Manguoglu M, Sameh A, Tezduyar T, Sathe S, A nested iterative scheme for computation of incompressible flows in long domains, Computational Mechanics, 43(1),pp.73-80 , 2008, ~ PDF Publisher's version (Follow the link for a complete list of my publications) Teaching: CENG371 Scientific Computing [Fall 2025][Syllabus] CENG487 Introduction to Quantum Computimng [Fall 2025][Syllabus] Travel and Conference Schedule updated on August, 2025",
  "content_length": 4801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:23"
}