{
  "name": "Murphy Yuezhen Niu",
  "homepage": "https://cs.ucsb.edu/index.php/people/faculty/murphy-niu",
  "status": "success",
  "content": "Murphy Niu | UCSB Computer Science Murphy Niu Assistant Professor Stansbury Chair in Computer Science murphyniu@ucsb.edu 2013 Henley Hall Google Scholar Education Ph.D., Physics, MIT B.A., Physics, Peking University Off-Campus Affiliations Adjunct Assistant Professor in the University of Maryland, College Park, and the University of Maryland Institute for Advanced Computer Studies Research Areas Algorithms and Theory Computer Architecture Machine Learning and Data Mining Quantum Computing Bio Murphy Yuezhen Niu is an Assistant Professor and Stansbury Chair in Computer Science at the University of California, Santa Barbara since 2024. Previously, she was a senior research scientist in the Google Quantum AI team, where her work focused on intelligent quantum control optimization and metrology, quantum machine learning, quantum algorithm design and near-term quantum error correction. Niu received her doctorate in theoretical and mathematical physics from MIT in 2018. She received the Claude E. Shannon Research Assistantship for her work at the intersection of photonic quantum computation, quantum error correction and quantum cryptography. Research Professor Niu's long-term research goal is to develop quantum computing paradigms in regard to how we program, control, characterize, measure, and error correct a large-scale quantum computer without paying the steep price of digitization towards real-world impacts. Niu applies cutting-edge deep reinforcement learning and generative models to quantum control, quantum circuit compilation, and quantum system learning using some of the largest quantum computers based on superconducting qubits. Her recent research focus on developing scalable analog quantum control and algorithms for emerging quantum architectures with superconducting, ion trap, photonic, and neutral atom qubits. Visit Niu’s academic publications on Google Scholar here.",
  "content_length": 1905,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:24"
}