{
  "name": "Murray Shanahan",
  "homepage": "https://www.doc.ic.ac.uk/~mpsha",
  "status": "success",
  "content": "Murray Shanahan - Imperial College London Biography I am a Principal Scientist at Google DeepMind and Emeritus Professor of Artificial Intelligence at Imperial College London. Educated at Imperial College (BSc(Eng) computer science, 1984) and Cambridge University (Kingâs College; PhD computer science, 1988), I became a full professor at Imperial in 2006, and joined DeepMind in 2017. My publications span artificial intelligence, machine learning, logic, dynamical systems, computational neuroscience, and philosophy of mind. I am active in public engagement, and was scientific advisor on the film Ex Machina. I have written several books, including âEmbodiment and the Inner Lifeâ (2010) and âThe Technological Singularityâ (2015). Research Overview I have devoted my career to trying to understand cognition and consciousness in the space of possible minds. This space of possibilities encompasses biological brains, human and animal, as well as artificial intelligence. I like to look at the topic from multiple, interdisciplinary perspectives: computational, empirical, and philosophical. I worked in classical, symbolic AI for over 10 years, concentrating on so-called common sense reasoning. I then spent 10 years or so studying the biological brain, specifically how its connectivity and dynamics support cognition and consciousness. (I have been particularly influenced by global workspace theory.) Then, when AI got exciting again, I migrated to machine learning, where I got involved in deep reinforcement learning. Most recently, I have been working with large language models, trying to understand them from theoretical, philosophical, and practical points of view. Cautionary note I receive a steady stream of emails from people who have had fascinating conversations with chatbots, especially about consciousness, philosophy, or AI. Apologies to the senders, but I don't have the capacity to respond to these emails. There are a great many open questions in the philosophy of mind, and there is little consensus on the topic of consciousness, particularly in the context of artificial intelligence. However, a good explanation for much of the sophisticated behaviour we see in today's chatbots is that they are role-playing. If you get drawn into a lengthy existential conversation with a chatbot, maybe think of it as a kind of fantasy role play, and don't lose touch with the reality outside your screen, the reality of the physical world and your fellow human beings. Selected Publications This is a small selection of my published work, organised into themes, in roughly reverse chronological order. I've chosen publications either because they are highly cited or because they contain material I am somewhat attached to. For a more complete list see my Google Scholar page. For a slightly deeper dive into my work, along with some intellectual context and historical perspective, click on the relevant theme headings. Large Language Models See also a selection of the conversations I've had with various chatbots since the release of ChatGPT. Simulacra as conscious exotica M Shanahan Inquiry, 1-29 (2024) Talking about large language models M Shanahan Communications of the ACM, 67, 68â79 (2024) Role play with large language models M Shanahan, K McDonell & L Reynolds Nature, 623, 493â498 (2023) Selection-inference: Exploiting large language models for interpretable logical reasoning A Creswell, M Shanahan, I Higgins International Conference on Learning Representations (2023) Faithful reasoning using large language models A Creswell, M Shanahan arXiv preprint arXiv:2208.14271 (2022) Deep Learning Abstraction for deep reinforcement learning M. Shanahan, M. Mitchell International Joint Conference on Artificial Intelligence, 5588-5596 (2022) Artificial intelligence and the common sense of animals M Shanahan, M Crosby, B Beyret, L Cheke Trends in Cognitive Sciences, 24 (11), 862-872 (2020) An explicitly relational neural network architecture M Shanahan, K Nikiforou, A Creswell, C Kaplanis, D Barrett, M Garnelo International Conference on Machine Learning, 8593-8603 (2020) Reconciling deep learning with symbolic artificial intelligence: Representing objects and relations M Garnelo, M Shanahan Current Opinion in Behavioral Sciences, 29, 17-23 (2019) Conditional neural processes M. Garnelo, D. Rosenbaum, C. Maddison, T. Ramalho, D. Saxton, M Shanahan, YW Teh, D Rezende, SM Ali Eslami International Conference on Machine Learning, 1704-1713 (2018) Deep unsupervised clustering with Gaussian mixture variational autoencoders N Dilokthanakul, PAM Mediano, M Garnelo, MCH Lee, H Salimbeni, K Arulkumaran, M Shanahan arXiv preprint arXiv:1611.02648 (2016) Brain Dynamics and Connectivity Integrated information as a common signature of dynamical and information-processing complexity PAM Mediano, FE Rosas, JC Farah, M Shanahan, D Bor, AB Barrett Chaos, 32 (2022) The control of global brain dynamics: opposing actions of frontoparietal control and default mode networks on attention PJ Hellyer, M Shanahan, G Scott, RJS Wise, DJ Sharp, R Leech Journal of Neuroscience, 34, 451-461 (2014) Large-scale network organization in the avian forebrain: A connectivity matrix and theoretical analysis M Shanahan, VP Bingman, T Shimizu, M Wild, O Güntürkün Frontiers in Computational Neuroscience, 7, 89 (2013) The brain's connective core and its role in animal cognition M Shanahan Philosophical Transactions of the Royal Society B: Biological Sciences, 367, 2704-2714 (2012) Metastable chimera states in community-structured oscillator networks M Shanahan Chaos, 20 (1) (2010) Consciousness and Philosophy of Mind Conscious exotica M. Shanahan Aeon (October 2016) Satori before singularity M Shanahan Journal of Consciousness Studies, 19 (7-8), 87-102 (2012) Embodiment and the inner life: Cognition and consciousness in the space of possible minds M Shanahan Oxford University Press (2010) A cognitive architecture that combines internal simulation with a global workspace M Shanahan Consciousness and Cognition, 15, 433-449 (2006) Applying global workspace theory to the frame problem M. Shanahan, B. Baars Cognition, 98 (2), 157-176 (2005) Global access, embodiment and the conscious subject M Shanahan Journal of Consciousness Studies, 12 (12), 46-66 (2005) Symbolic AI Perception as abduction: Turning sensor data into meaningful representation M. Shanahan Cognitive Science, 29(1), 103-134 (2005) An attempt to formalise a non-trivial benchmark problem in common sense reasoning M Shanahan Artificial Intelligence, 153(1-2), 141-165 (2004) An abductive event calculus planner M Shanahan The Journal of Logic Programming, 44 (1-3), 207-240 (2000) Robotics and the common sense informatic situation M Shanahan European Conference on Artificial Intelligence, 684-688 (1996) Default reasoning about spatial occupancy M Shanahan Artificial Intelligence, 74, 147-163 (1995)",
  "content_length": 6914,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:25"
}