{
  "name": "Musard Balliu",
  "homepage": "http://www.csc.kth.se/~musard",
  "status": "success",
  "content": "Musard Balliu Musard Balliu Associate Professor School of Electrical Engineering and Computer Science KTH Royal Institute of Technology Email: musard@kth.se Phone: +46 8 790 68 22 Office: 4517 Postal address: Lindstedtsvägen 5, SE-100 44, Stockholm, Sweden I am Associate Professor at the School of Electrical Engineering and Computer Science at KTH Royal Institute of Technology in Stockholm, Sweden. I lead the LangSec (Language-Based Security) group conducting research at the intersection of computer security, programming languages, formal methods and software engineering. Our research interests are in many aspects of security, from both theoretical and practical angles, spanning core and emerging areas such as information flow control, web and mobile application security, IoT security, low-level security, program analysis and verification, and logics. News Activities: Journal of Computer Security (Associate editor), ASIACCS 2026 (PC), CCS 2026 (PC), CSF 2026 (PC, Workshop chair), USENIX Security 2026 (PC), SCORED 2025 (PC), MADWeb 2025 (PC), CCS 2025 (PC), USENIX Security 2025 (PC), EuroS&P 2025 (PC), CSF 2025 (Workshop chair), AHyper 2024 (Keynote), NII Shonan Meeting 159 (Web Application Security), CSF 2024 (PC, Workshop chair), EuroS&P 2024 (PC), USENIX Security 2024 (PC), CPSIoTSec 2023 (Keynote), CCS 2023 (PC), Dagstuhl Seminar 23281 (Theoretical Advances and Emerging Applications in Abstract Interpretation), SecDev 2023 (PC), CSF 2023 (PC, Workshop chair), EuroS&P 2023 (PC), PriSC 2023 (PC), SafeThings 2023 (PC), PLAS 2022 (co-chair), NordSec 2022 (PC), SecDev 2022 (PC), Infineon WinterSchool 2022 (Keynote), CCS 2022 (PC), CSF 2022 (PC, Workshop chair), EuroS&P 2022 (PC), CCS 2021 (PC), CSF 2021 (PC), EuroS&P 2021 (PC), NordSec 2021 (PC), SecDev 2021 (PC), EuroS&P 2020 (PC), NordSec 2020 (PC), PLAS 2020 (PC), CSF 2020 (PC), SOFTENG 2020 (PC), CASTOR Software Days 2019 (co-chair security track), CSF 2019 (PC), EuroS&P 2019 (local organizer), NordSec 2019 (PC), JPF 2019 (PC), POST 2019 (PC), NordSec 2018 (PC), IFIPTM 2017 (co-chair of Graduate Symposium), FCS 2017 (PC), Nordsec 2017 (PC) I am continuously looking for PhD students, PostDocs, amanuensis, and M.Sc. students. Check out our ongoing research and projects, and reach out to me if interested in joining the LangSec group. Drop me a line if interested in giving a talk at KTH Security Seminar I teach Language-Based Security and Computer Security Are you a student of age 16 - 25? Join Sweden's National Hacking Team team at European Cyber Security Challenge (ECSC) LangSec Group Marcus Birgersson (co-advised with Cyrille Artho) Eric Cornelissen SiKai Lu Mojtaba Moazen Mohammad Ahmadpanah (PostDoc) Graduated PhD students and PostDocs: Amir M. Ahmadian (PhD 2024), Mikhail Shcherbakov (PhD 2024), Matvey Soloviev (PostDoc 2022 - 2023) Projects and Awards SambIoT: Secure and Scalable 6G Ambient IoT, (Digital Futures Flagship Project 2025), co-PI ShiftLeft: Securing the Software Supply Chain by Code-centric Analysis, (WASP NEST Cyber Security 2024), PI WebInspector: Taming Code Reuse Attacks in Web Applications, (VR 2022), PI CHAINS: Consistent Hardening and Analysis of Software Supply Chains, (SSF 2022), co-PI CyberSecIT: Automated and Autonomous Cybersecurity for IoT, (WASP NEST 2022), co-PI SOS: Empowering User Control over Sensitive IoT Data, (Digital Furures 2021), PI JointForce: Reconciling Database Access Control and Information Flow Control, (VR Starting grant, 2018), PI Trustfull: Trustworthy Fullstack Computing, (SSF 2018) Best Reviewer Award, CCS 2022 Google Research Scholar Award, 2022 Facebook Award in Privacy-Enchancing Technologies, 2021 Centers I am involved in the following initiatives. Swedish Natioal Hacking Team (co-founder and SC representative for Sweden) CDIS Cybercampus Sverige Digital Futures WASP",
  "content_length": 3843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:32"
}