{
  "name": "Mustafa Cenk Gursoy",
  "homepage": "http://eng-cs.syr.edu/directory",
  "status": "success",
  "content": "Directory - ECS – Syracuse University All Staff/Faculty Biomedical and Chemical Engineering Civil and Environmental Engineering Electrical Engineering and Computer Science Mechanical and Aerospace Engineering ECS Leadership All ECS Staff All ECS Full-Time Faculty All ECS Part-Time Faculty Mo Abdallah Assistant Teaching Professor Riyad S. Aboutaha Associate Professor Nicole Adkins Assistant to Director, Records and Study Abroad Cassie Agren Student Program Coordinator Jeongmin Ahn Professor Ben Akih-Kumgeh Associate Professor Aerospace Engineering Undergraduate Program Director Sahar Almahmoud Graduate Programs Coordinator Michael Ammoury Assistant Teaching Professor Jackie Anderson Associate Teaching Professor, Engineering Management Graduate Program Director, SU-Industrial Training and Assessment Center Director Michelle Anson-Silverstein Computer Consultant Christian Aponte-Rivera Assistant Professor Ethan Arnault Assistant Professor Chris Barbera Marketing and Communications Coordinator Marjory Baruch Part Time Associate Professor Hind BenGabr Academic Operations Specialist, Mechanical and Aerospace Engineering Shelby Bergen Career Advisor Gabriela Bermudez Student Success Advisor Shobha K. Bhatia Professor Emeritus Michael Blatchley Assistant Professor Michelle M. Blum Associate Dean for Student Affairs Teaching Professor Dean’s Faculty Fellow for Assessment Ed Bogucz Associate Professor Jesse Q. Bond Mezger Endowed Professor Kathryn Bradford Budget Analyst, Center of Excellence Thomas E. Braga Senior Experimental Machinist Tim Breen Workshop and Project Manager Cynthia M. Bromka-Skafidas Administrative Assistant, Electrical Engineering and Computer Science Katie Cadwell Teaching Professor and Chemical Engineering Undergraduate Program Director Yue Cao Assistant Teaching Professor Heather Carroll Assistant Director Alumni & Donor Engagement Elizabeth Carter Assistant Professor C.Y. Roger Chen Professor Ruth Chen Professor of Practice Biao Chen John E. and Patricia A. Breyer Professor in Electrical Engineering Shiu-Kai Chin Emeritus Professor Nicholas Clarke Associate Director for Graduate Student Recruitment and Administration Megan Claxton Budget Manager, Mechanical and Aerospace Engineering Sam Clemence Meredith Professor Emeritus Sarah Collins Director of Academic Operations, Electrical Engineering and Computer Science Andria Costello Staniec Department Chair CEE, Associate Professor,Civil Engineering Graduate Program Director Don Crampton Director of Strategic Partnerships John F. Dannenhoffer III Associate Professor Cliff I. Davidson Professor Emeritus Gabriel Silva De Oliveira Assistant Teaching Professor Alexander Deyhim Kenneth and Mary Ann Shaw Professor of Practice in Entrepreneurial Leadership Rick DiRubbo Director of Online Learning Karen Dixon-Cherebin Academic Support Coordinator, Mechanical and Aerospace Engineering Bing Dong Traugott Professor of Mechanical and Aerospace Engineering Charles T. Driscoll University Professor of Environmental Systems and Distinguished Professor, National Academy of Engineering Member Victor Duenas Associate Professor Alex Dunbar Communications and Marketing Manager Jennifer Duque Graduate Assistant in Career Services Sara Eftekharnejad Associate Professor Ehat Ercanli Associate Teaching Professor Associate Chair of Education and Operations Matthew Erdman Assistant Teaching Professor Makan Fardad Associate Professor Interim Electrical Engineering and Computer Science Graduate Program Director Jennifer Fazio Assistant Director for Employer Relations and Career Services Eric Finkelstein Technical Director, BioInspired Institute Materials Research Core Abby Fite Director of Inclusive Excellence Heather Flaherty Administrative Assistant to Charles T. Driscoll Amelia Forbes Administrative Assistant, Biomedical and Chemical Engineering Chelsey Franza Career Advisor Zhenyu Gan Assistant Professor Venkata S.S. Gandikota Assistant Professor Natarajan Gautam Professor Operations Research and Systems Analytics Master's Program Director, Dean’s Faculty Fellow for Graduate Student Engagement Nadeem Ghani Assistant Teaching Professor Prasanta K. Ghosh Professor Michael Glinski Lab Coordinator Jennifer W. Graham Associate Teaching Professor Amy Gullotta Senior Director of Development M. Cenk Gursoy Professor Matthew Hanley Information Technology Analyst Moamer (Mo) Hasanovic Assistant Teaching Professor Julie M. Hasenwinkel Associate Provost for Academic Programs James (Jay) Henderson Professor, BioInspired Institute Director Endadul Hoque Assistant Professor Jonathan Hoster Associate Director for Undergraduate Admissions and Recruitment Wei (Frank) Hu Office of Inclusive Excellence Program Manager Kara Hughes Operations Specialist, Bioinspired Institute Britton Inglehart Graduate & Global Career Advisor Can Isik Professor Era Jain Assistant Professor Chae Jeong-Potter Assistant Professor Pankaj K. Jha Assistant Professor Chris E. Johnson Professor Alex K. Jones Klaus Schroder Endowed Professor for Engineering, Department Chair EECS Andrea Joseph Assistant Professor Kathleen M. Joyce Assistant Dean for Student Recruitment Michaela Karcher Recruitment Specialist Sue Karlik Assistant to the Director of Space Management and Strategic Initiatives Garrett Ethan Katz Associate Professor Sean K. Kelly Digital Media and Web Specialist Lance S. Ketcham Practitioner in Residence Bryan S. Kim Assistant Professor Shawn L. Knight Assistant to the Department Chair, Electrical Engineering and Computer Science Rodrick Kuate Defo Assistant Professor Saman Priyantha Kumarawadu Associate Teaching Professor Computer Science Undergraduate Program Director Lihong Lao Assistant Professor Taylor Larsen Student Success Advisor Kasey Laurent Assistant Professor Andrew C. Lee Assistant Teaching Professor Andra Lee Assistant Dean of Advancement & External Affairs Tong Lin Research Assistant Professor Xiyuan Liu Associate Teaching Professor Dean’s Faculty Fellow for Academic Affairs Weisi Liu Budget Manager, Civil and Environmental Engineering Min Liu Director, Syracuse University Infrastructure Institute Abdallah H. Yabroudi Endowed Professor in Sustainable Civil Infrastructure Yizhi Liu Assistant Professor Linda Lowe Budget Manager, Electrical Engineering and Computer Science Eric M. Lui Laura J. and L. Douglas Meredith Professor for Teaching Excellence Aoyi Luo Assistant Professor Zhen Ma Associate Professor, Samuel and Carol Nappi Research Scholar Biomedical and Chemical Engineering Graduate Program Director Sinéad C. Mac Namara Associate Professor Sarah Mack Director of Student Success Advising Paul Mackanos Academic Operations Specialist, Civil and Environmental Engineering Melissa Maldonado Director of Administration Analytics Shalabh C. Maroo Professor MAE Graduate Program Director Hong Martel Adjunct Professor/Instructor Karen Martinez Soto Assistant Teaching Professor Joao Paulo Marum Assistant Teaching Professor Jean-Daniel Medjo Assistant Teaching Professor Electrical Engineering and Computer Engineering Undergraduate Program Director Kristopher Micinski Assistant Professor Aaron Mohammed Assistant Professor Chilukuri K. Mohan Professor Mario Montesdeoca Laboratory Manager Young B. Moon William J. Smith Professor in Manufacturing Enterprises Shikha Nangia Milton and Ann Stevenson Endowed Professor of Biomedical and Chemical Engineering, Biomedical and Chemical Engineering Department Chair Dawit Negussey Professor and Graduate Dean’s Faculty Fellow for Diversity and Inclusion Rebecca Noble Office Coordinator, Electrical Engineering and Computer Science Jae C. Oh David G. Edelstein Professor for Broadening Participation,Senior Associate Dean for Faculty Affairs and Academic Initiatives Susan Older Associate Professor Anupam Pandey Assistant Professor Malea Perkins Student Success Advisor Vir V. Phoha Professor Jeremy Pierce Part-Time Instructor Peter Plumley Research Associate Professor Jason Pollack Assistant Professor Savonne Proctor Success Advisor Quinn Qiao Professor Interim Associate Dean for Research Site Director, NSF IUCRC Center for Solid-State Electric Power Storage (CEPS) Zhao Qin Assistant Professor Qinru Qiu Distinguished Professor Younes Ra’di Assistant Professor Farzana Rahman Associate Teaching Professor Allen Reed Help Desk Manager Dacheng Ren Research Professor Jorge Romeu Part Time Professor Tamara Rosanio Associate Director for Partner Programs at the Syracuse Center of Excellence in Environmental and Energy Systems Jennifer Ross Interim Dean Utpal Roy Professor Fabrizio Sabba Assistant Professor Cynthia Salanger Administrative Specialist, Electrical Engineering and Computer Science Baris Salman Assistant Professor Ashok S. Sangani Professor Amit K. Sanyal Associate Professor Mehmet Sarimurat Teaching Professor, Mechanical Engineering Undergraduate Program Director Paulo Shakarian KG Tan Endowed Professor of Artificial Intelligence Wanliang Shan Associate Professor Ian M. Shapiro Professor of Practice Jim Sheedy Facilities Manager Andrea Shen Assistant Teaching Professor Yilei Shi Associate Teaching Professor, Undergraduate Civil Engineering Program Director Changmin Shi Assistant Professor Clarissa Simpson Budget Manager, Biomedical and Chemical Engineering Cindy Smith Assistant Teaching Professor Lilly Smolak Admissions Coordinator Pranav Soman Professor Sucheta Soundarajan Associate Professor James Spoelstra Director of Information Technology David Stablein NRT Program Director, Biomedical and Chemical Engineering Chris Stathatos Computer Consultant Jessica Stockham Computer Consultant I Emilia Stojanovski Academic Operations Specialist, Biomedical and Chemical Engineering Yiyang Sun Assistant Professor Radhakrishna (Suresh) Sureshkumar Distinguished Professor Yuzhe Tang Associate Professor Svetoslava Todorova Environmental Engineering Program Director, Professor of Practice John Trimmer Assistant Teaching Professor Yoko Urao Office Coordinator, Mechanical and Aerospace",
  "content_length": 11237,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:30"
}