{
  "name": "Mustaque Ahamad",
  "homepage": "http://www.cc.gatech.edu/~mustaq",
  "status": "success",
  "content": "Mustaque Ahamad's Home Page Mustaque Ahamad Professor College of Computing Georgia Institute of Technology mustaq@cc.gatech.edu [ Biography] [ Research Interests ] [ Publications ] [ Courses] [ Current Students] [ Former Students] Biography Mustaque Ahamad received the B.E.(Hons.) degree in Electrical and Electronics Engineering from the Birla Institute of Technology and Science, Pilani, India in 1981 and the M.S. and Ph.D. degrees in Computer Science from the State University of New York, Stony Brook , in 1983 and 1985, respectively. Dr. Ahamad's research interests are in distributed operating systems, computer security, and fault-tolerant systems. Current Research Projects Securing Scalable Distributed Services Securing Future Applications Guarding the Next Internet Frontier: Countering Denial of Information A Secure Storage Service for Managing Personal Information Recent Publications Online copies of somewhat older publications can be found here. Online links to recent publications can be found on the home pages of my students. Courses CS6238 Secure Computer Systems CS6210 Advanced Operating Systems Seminar in Computer Security Current Graduate Students Michael Covington Matthew Moyer Tianying Chang Subramanian Lakshmanan Lei Kong Gang Liang Vinay Manivel Former Ph.D. Students: Vijaykumar Krishnaswamy (2001), Startup. Francisco Torres (1999), Faculty of Institute of Technology, Costa Rica. Sumeer Bhola (1999), IBM T. J. Watson Research Center. Brad Topol (1998), IBM Research Triangle Park, North Carolina. Rammohan Kordale (1997), Scalable Information Systems Group, Silicon Graphics. R. Ananthanarayanan (1997), Silicon Graphics. Muthusamy Chelliah (1996), HP Laboratories, Palo Alto, CA. Prince Kohli (1996), Silicon Graphics. Ranjit John (1995), Transarc Corporation. Nasr Belkier (1992), CISCO. Luke Lin (1990), IBM, Santa Teresa Labs. Shun Yan Cheung (1990), Associate Professor, Dept. of Math. and Computer Science, Emory University, Atlanta, GA. Jose Bernabeau-Auban (1988), Associate Professor, Polytechnic University of Valencia, Dept. of Information Systems and Computing , Valencia, Spain. Contact information: College of Computing, 801 Atlantic Drive Georgia Institute of Technology Atlanta, Georgia 30332-0280 Telephone: +1 404 894 2593 Internet: mustaq@cc.gatech.edu",
  "content_length": 2309,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:31"
}