{
  "name": "Mustafa A. Mustafa",
  "homepage": "https://research.manchester.ac.uk/en/persons/mustafa.mustafa",
  "status": "success",
  "content": "Mustafa Mustafa - Research Explorer The University of Manchester Mustafa Mustafa Dr Senior Lecturer, Systems and Software Security https://orcid.org/0000-0002-8772-8023 Personal profile Research interestsSecurity and Privacy in Smart Grid Peer-to-peer (local) electricity trading marketsSmart meteringSmart electric vehicle chargingDemand response Applied Cryptography in Smart City and e-Health Keyless car sharing systemsFrictionless authenticationHealth data collection, distribution and access controlPrizes and awardsWinner of the Student Video Competition organised by the flagship IEEE International Conference on Smart Grid Communications (SmartGridComm 2017), the video: \"Secure and Privacy-friendly Local Electricity Trading\"Best Paper Award at the 11-th International Conference on Emerging Security Information, Systems and Technologies (SECURWARE 2017), the awardDistinguished Achievement Award as Postgraduate Research Student of the Year nominee by the School of Computer Science of The University of Manchester (2015)Supervision informationGraduated PhD students Sara Cleemput, \"Secure and Privacy-friendly Smart Electricity Metering\", PhD in Engineering Science: Electrical Engineering, KU Leuven, awarded in May 2018. I acted as her daily supervisor and was a member of her examination committeeIraklis Symeonidis, \"Analysis and Design of Privacy-Enhancing Information Sharing Systems\", PhD in Engineering Science: Electrical Engineering, KU Leuven, awarded in May 2018. I acted as his daily supervisor. Graduated Master students Omar Alhawi, \"Finding Software Vulnerabilities in Unmanned Aerial Vehicles Using Software Verification\", MPhil in Computer Science, The University of Manchester, awarded in November 2020.Osama Almoghamis, \"Privacy-friendly Electric Vehicle Charging\", MSc in Computer Science, The University of Manchester, awarded in November 2020.David De Troch - \"Scalable and Efficient Smart Contract for Secure Car Sharing\", KU Leuven, awarded in July 2020, Co-supervised with Akash Madhusudan and Iraklis Symeonidis.Chao Shi, \"Conditional Anonymity in Sharing Economy Systems: The Private Car Sharing Case\", MSc in Computer Science, The University of Manchester, awarded in November 2019.Xuyuan Su, \"Conditional Anonymity in Sharing Economy Systems: The Uber Case\", MSc in Computer Science, The University of Manchester, awarded in November 2019.Akash Madhusudan, “Secure and Privacy-friendly Keyless Car Sharing Systems”, Master in Engineering Science: Artificial Intelligence, KU Leuven, awarded in September 2018, Co-supervising with Iraklis Symeonidis.Siemen Dhooghe, “Applying Multiparty Computation to Car Access Provision”, Master in Engineering Science: Mathematical Engineering, KU Leuven, awarded in June 2017, co-supervised with Iraklis Symeonidis and Abdelrahaman Aly.Karel Domin, \"Security Analysis of the Drone Communication Protocol: Fuzzing the MAVLink Protocol\", Master in Engineering Science: Computer Science, KU Leuven, awarded in June 2016. I was his assessor. Other researchOngoing Reseach Projects EnnCore: End-to-End Conceptual Guarding of Neural Architectures, EPSRC (2020-2024), in collaboration with University of LiverpoolSCorCH: Secure Code for Capability Hardware, EPSRC (2019-2023) in collaboration with University of OxfrodSNIPPET: Secure and Privacy-friendly Peer-to-peer Electricity Trading, FWO-SBO project (2019 - 2023), in collaboration with KU Leuven (BE) and VUB (BE)Secure and Privacy-friendly Sharing Economy Applications, The University of Manchester (2018 - 2023) Previous Reseach Projects DiskMan: Dynamic Risk-based Access Management, imec ICON project (2016 - 2018)SAGA: Secured Smart Grid Metering Architecture, KIC Innovation project (2015 - 2016)Smart Grid Security, EPSRC and Toshiba (2011 - 2015) Scholarships and Fellowships Dame Kathleen Ollerenshaw Research Fellowship, The University of Manchester, (2018–2023)Postdoctoral Scholarship Holder in international mobility, KU Leuven, (2015–2018)Industrial CASE Ph.D. Studentship, EPSRC and Toshiba Research Europe, (2011–2015)ONE North East Postgraduate Bursary, One North East, (2009–2010)OverviewMustafa A. Mustafa is a Senior Lecturer (Associate Professor) in the Department of Computer Science at The University of Manchester. He is also a deputy director of the university-wide Centre for Digital Trust and Society and Academic Centre of Excellence in Cyber Security Research (ACE-CSR). He received the B.Sc. degree in communications from the Technical University of Varna, Varna, Bulgaria, in 2007, the M.Sc. degree in communications and signal processing from Newcastle University, Newcastle upon Tyne, U.K., in 2010, and the Ph.D. degree in computer science from The University of Manchester, Manchester, U.K., in 2015. He then was a post-doctoral research fellow with the imec-COSIC research group, Department of Electrical Engineering (ESAT), KU Leuven, Belgium. From July 2018 till June 2023, he was a Dame Kathleen Ollerenshaw Research Fellow in the Department of Computer Science at The University of Manchester. He was the recipient of the Best Student Video Award from IEEE SmartGridComm 2017 and the Best Paper Award from SECURWARE 2017. During his PhD studies he was also a recipient of the Distinguished Achievement Award as Postgraduate Research Student of the Year 2015 nominee by the School of Computer Science of The University of Manchester. He currently acts as an expert in the IEC/SYC/WG 3 “IEC Smart Energy Roadmap”. He has also given tutorials, guest lectures and invited talks at several national and international summer schools/seminars/workshops/conferences. He has acted as a reviewer for a large number of journals and international conferences. His research interests include information security, data privacy and applied cryptography in areas such as smart grid, smart city, e-health, and IoT. His main expertise lies in applied crypto in the Smart Grid domain where he has filed one patent and published numerous papers at leading Smart Grid conferences. My groupCurrent PhD students Kamil Erdayandi - \"Privacy-friendly Multi-agent Systems for Smart Grid Application\" - main supervisorKhlood Jastaniah - \"Security and Privacy for the Internet of Things (IoT) in E-health\" - main supervisorFatimah Aljaafari - \"Detecting Vulnerabilities in IoT Lightweight Cryptography Algorithms using Fuzzing and Symbolic Execution\" - co-supervisorTwisha Twisha - \"Effective Solutions for BotVM Detection\" - co-supervisor Current MSc students Robbie Thandi - \"Privacy-Enhancing Settlements Protocol in Peer-to-Peer Energy Trading Markets\", MSc in Computer Science, The University of Manchester, expected to graduate in November 2021.Further informationMy contact details Address: Kilburn Building - office 2.93 Department of Computer Science The University of Manchester Oxford Road Manchester, M13 9PL, UK Email: [email protected]OpportunitiesFor prospective PhD students I welcome enquiries from prospective PhD students interested in the following areas: Applied cryptography in Smart Grid, Smart City, e-Banking, e-Health, IoT (Internet of Things), etc.Distributed trust computingBlockchain and public ledgersMobile and wireless securityPrivacy-friendly machine learningAnonymous communication Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationDoctor of Philosophy, Smart Grid Security: Protecting Users' Privacy in Smart Grid Applications, The University of Manchester1 Jul 2011 → 30 Jun 2015Award Date: 12 Oct 2015Master in Science, Intelligent Video Surveillance System for Detecting Abnormal Human Behaviour, Newcastle University15 Sept 2009 → 30 Aug 2010Award Date: 1 Sept 2010Bachelor of Science, Design of Magnitude Response Equaliser, Technical University Varna15 Sept 2002 → 30 Jul 2007Award Date: 17 Jul 2007 External positionsVoluntary researcher , Katholieke Universiteit Leuven1 Jul 2018 → 30 Jun 2025 Areas of expertiseQA75 Electronic computers. Computer scienceInformation SecurityData PrivacySmart GridResearch Beacons, Institutes and PlatformsInstitute for Data Science and AIDigital FuturesEnergyManchester Energy Fingerprint Dive into the research topics where Mustafa Mustafa is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Privacy Preserving Computer Science 100% Security and Privacy Computer Science 64% User Privacy Computer Science 53% Security Analysis Computer Science 45% Business Models Computer Science 34% Smart Meters Computer Science 34% Smart Grid Computer Science 26% Privacy Requirement Computer Science 24% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 47 Conference contribution 21 Article 3 Poster 2 Chapter 6 More 2 Conference article 1 Review article 1 Other contribution 1 Doctoral Thesis 1 Working paper Research output per year Research output per year EDGChain-E: A Decentralized Git-Based Framework for Versioning Encrypted Energy DataAlimoglu, A., Erdayandi, K., Mustafa, M. & Cali, Ü., 7 Sept 2025, (Accepted/In press) IEEE International Conference on Distributed Ledger Technologies (ICDLT 2025). IEEEResearch output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Initial Energy 100% Mitigating Backdoor Attacks in Federated IoT Systems via Representative-Attention MechanismObioma, C. P., Sun, Y. & Mustafa, M. A., 22 May 2025, (Accepted/In press).Research output: Contributi",
  "content_length": 16540,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:27"
}