{
  "name": "Muthuramakrishnan Venkitasubramaniam",
  "homepage": "https://muthu.georgetown.domains",
  "status": "success",
  "content": "Muthu Venkitasubramaniam Muthuramakrishnan Venkitasubramaniam Contact 357 St Mary's Hall Georgetown University Mail: mv783@georgetown.edu I am a Professor in the Department of Computer Science at Georgetown University. I got my Ph.D in the Computer Science Department at Cornell University under the supervision of Rafael Pass and spent a year as a CI Fellow at NYU and Columbia University. Prior to coming to Georgetown I was an Assistant, then Associate Profossor at University of Rochester. My research interests lie in cryptography, network security and complexity theory. My research is funded by the National Science Foundation, IARPA, DARPA, JP Morgan and Google Faculty Research Award and Tech and Humanity Grant from the McCourt School of Public Policy. I am co-inventor of Ligero ZK-SNARK and co-founder and CEO of Ligero Inc. Teaching Spring 2023: Introduction in Cryptography (COSC 260) Fall 2022: Cryptography (COSC 530) Spring 2022: Seminar in Cryptography (COSC 830). Fall 2021: Cryptography (COSC 530) Spring 2021: Introduction to Cryptography (CSC 281/481, University of Rochester) Spring 2020: Introduction to Cryptography (CSC 281/481, University of Rochester) Fall 2019: Introduction to Cryptography (CSC 281/481, University of Rochester) Spring 2019: Computer Models and Limitations (CSC 280/480, University of Rochester) Fall 2018: Computational Complexity (CSC 286/486, University of Rochester) Spring 2017: Introduction to Cryptography (CSC 281/481, University of Rochester) Spring 2016: Computer Models and Limitations (CSC 280, University of Rochester) Fall 2015: Introduction to Cryptography (CSC 281/481, University of Rochester) Spring 2015: Computer Models and Limitations (CSC 280, University of Rochester) Fall 2014: Introduction to Cryptography (CSC 281/481, University of Rochester) Spring 2014: Advanced Algorithms (CSC 284/484, University of Rochester) Fall 2013: Introduction to Cryptography (CSC 281/481, University of Rochester) Spring 2013: Topics in Cryptography (CSC 283/483, University of Rochester) Fall 2012: Introduction to Cryptography (CSC 281/481, University of Rochester) Spring 2012: Introduction to Cryptography (CSC 281/481, University of Rochester) PhD Students Scott Ames (Graduated, 2019) Mohammad H Faghihi (Graduated, 2023) Laasya Bangalore (Graduated, 2024) Ruihan Wang (2024 - Present) Postdoc Antigoni Polychroniadou (2018-2019) (Ph.D Aarhus University, co-advised by Elaine Shi and Rafael Pass, now VP at JP Morgan) Oxana Poburinnaya (Ph.D Boston University) Albert Cheu (Ph.D Northeastern University, co-advised by Kobbi Nissim, now at Google) Naty Peter (Ph.D Ben Gurion University, co-advised by Kobbi Nissim) Eliad Tsfadia (Ph.D Tel Aviv University, co-advised by Kobbi Nissim) Rishabh Bhadauria (Ph.D Bar-Ilan University, co-advised by Justin Thaler) Bar Alon (Ph.D Ariel University) Editorships, Reviewing Activities and Service General Chair: IACR Annual Cryptology Conference (CRYPTO) 2019. Editorial Board: IACR Communications in Cryptography 2024 Program Chair: Co-organizing the 6th Edition of the ZKProof Standardization Workshop. Co- organized Emerging Technologies in Security and Privacy of Distributed, Grid and Cloud Computing Systems in conjunction with 35th IEEE International Conference on Distributed Computing Systems (ICDCS) 2015. Area Track Chair (Applied Cryptography): ACM Conference on Computer and Communications Security (CCS) 2021, IACR Annual International Cryptology Conference (CRYPTO) 2023. Program Committee: IACR International Conference on Practice and Theory in Public Key Cryp- tography (PKC) 2011, IACR Annual International Cryptology Conference (CRYPTO) 2014, IACR Theory of Cryptography Conference (TCC) 2016-B, International Conference on Cryptology in India, (Indocrypt) 2016, 37th Annual Eurocrypt Conference (Eurocrypt 2018), IACR Theory of Cryptog- raphy Conference (TCC 2019), 39th Annual Eurocrypt Conference (Eurocrypt 2020), IACR Annual International Cryptology Conference (CRYPTO) 2021, IACR Theory of Cryptography Conference (TCC 2021). IACR Annual International Cryptology Conference (CRYPTO) 2023, ACM Symposium on Theory of Computing (STOC 2023), IACR Theory of Cryptography Conference (TCC 2024). Journal Refereeing: SIAM Journal on Computing, Journal of Cryptology, Theory of Computing, Theoretical Computer Science. Conference Refereeing: EATCS ICALP 2008, STOC 2008, IACR TCC 2009, IACR CRYPTO 2009, Innovations in Computer Science (ICS) 2010, IACR TCC 2010, IACR TCC 2011, IACR CRYPTO 2011, IACR TCC 2012, IACR Eurocrypt 2012, ACM SIGACT STOC 2012, IACR TCC 2013, IACR Eurocrypt 2013, IACR CRYPTO 2013, ACM SIGACT STOC 2014, IACR TCC 2014, IACR Eurocrypt 2014, IACR TCC 2015, IACR CRYPTO 2015, IACR TCC 2016, IACR Eurocrypt 2016, IACR TCC 2017, IACR Eurocrypt 2017, IACR, STOC 2017, IACR FOCS 2017, ACM STOC 2018, IACR Eurocrypt 2018, IACR TCC 2018, IACR Crypto 2018, IACR Eurocrypt 2019, ACM STOC 2019, IACR TCC 2020, IACR Eurocrypt 2022, IACR CRYPTO 2022. Selected Invited Presentations Ligetron and the Price of ZK, Google ZK Summit. (July 31, 2024) Ligetron and the Llama Inference, ZKProof Workshop 6th edition,Berlin, Germany (May 22-24, 2024) Ligetron: WASM as an Intermediate Representation and easy tooling for zkSNARKs. MPTS 2023: NIST Workshop on Multi-party Threshold Schemes 2023 (September 26-28, 2023, Virtual). Ligetron: WASM as an Intermediate Representation and easy tooling for zkSNARKs. ZKProof Policy Day, Washington DC (November 30, 2023). Zero-knowledge from MPC-in-the-head: Theory edition, Tokyo Crypto Day, Tokyo. (March 30-31, 2023) Price of Active Security, AlgoCRYPT Seminar, AlgoCRYPT, Center of Excellence, JP Morgan. (Jan 13th, 2023, Virtual). Black-box constructions of complexity-preserving sublinear (ZK) arguments from symmetric primitives, Workshop on Efficient Probabilistic Proofs, Bertinoro, Italy (July 17-22, 2022). Visitors Alessandra Scafuro (February 2014) Carmit Hazay (August 2016 - September 2016) Oxana Poburinnaya (September 2016 - October 2016) Publications: (click title for abstract) Tight ZK CPU: Batched ZK Branching with Cost Proportional to Evaluated Instruction (CCS 2024) Y. Yang, C. Hazay, D. Heath, V. Kolesnikov, M. Venkitasubramaniam We explore Zero-Knowledge proofs (ZKP) of statements expressed as programs written in high-level languages, e.g., C or assembly. At the core of executing such programs in ZK is the repeated evaluation of a CPU step, achieved by branching over the CPU's instruction set. This approach is general and covers traversal-execution of a program's control flow graph (CFG): here CPU instructions are straight-line program fragments (of various sizes) associated with the CFG nodes. This highlights the usefulness of ZK CPUs with a large number of instructions of varying sizes. We formalize and design an efficient tight ZK CPU, where the cost (both computation and communication, for each party) of each step depends only on the instruction taken. This qualitatively improves over state-of-the-art, where cost scales with the size of the largest CPU instruction (largest CFG node). Our technique is formalized in the standard commit-and-prove paradigm, so our results are compatible with a variety of (interactive and non-interactive) general-purpose ZK. We implemented an interactive tight arithmetic (over $\\mathbb{F}_{2^{61}-1}$) ZK CPU based on Vector Oblivious Linear Evaluation (VOLE) and compared it to the state-of-the-art non-tight VOLE-based ZK CPU Batchman (Yang et al. CCS 23). In our experiments, under the same hardware configuration, we achieve comparable performance when instructions are of the same size and a $5$-$18$x improvement when instructions are of varied size. Our VOLE-based tight ZK CPU (over $\\mathbb{F}_{2^{61}-1}$) can execute $100$K (resp. $450$K) multiplication gates per second in a WAN-like (resp. LAN-like) setting. It requires $\\leq 102$ Bytes per multiplication gate. Our basic building block, ZK Unbalanced Read-Only Memory (ZK UROM), may be of independent interest. PDF LogRobin++: Optimizing Proofs of Disjunctive Statements in VOLE-Based ZK (Asiacrypt 2024) C. Hazay, D. Heath, V. Kolesnikov, M. Venkitasubramaniam, Y. Yang (abstract) PDF Lightweight Scalable End-to-End Zero-Knowledge Proofs Post-Quantum ZK-SNARKs on a Browser. (IEEE SP 2024) R. Wang, C. Hazay, M. Venkitasubramaniam. Zero-Knowledge (ZK) proofs were introduced in the seminal work of Goldwasser, Micali, and Rackoff (STOC 1985) and remain one of the cornerstones of modern cryptography. With the advent of Blockchains, there has been reinvigorated interest in deploying ZK-proof systems in the form of ZKSNARKs. ZKSNARKs are an attractive variant as they are non-interactive (in fact, publicly verifiable) and succinct. Yet, current deployments require huge running times and/or very large memory, and scaling them to large circuits cannot be accomplished on commodity hardware. We design and implement an efficient sublinear non-interactive zero-knowledge system, Ligetron, that can be deployed as a web application and scales to billions of gates. Core to our construction is identifying a good intermediate representation, namely Web Assembly (WASM) that is: (1) versatile to represent complex computations, (2) can be compiled from most popular high-level languages, and (3) embodies rich semantics to derive space-efficiency. On the backend, we design and implement a space-efficient variant of the Ligero ZK system introduced in the work of Ames et al. (ACM CCS 2017) that can leverage the semantics of WASM. Ligetron is the first post-quantum ZK-SNARK to scale to billion gates and run from a browser. On commodity hardware, Ligetron scales to arbitrarily large circuits while showcasing competitive prover/verifier running times and better proof lengths than all previous post-quantum ZK-SNARKs. PDF Can Alice and Bob Guarantee Output to Carol? (EUROCRYPT 2024) B. Alon, E. Omri, M. Venkitasubramaniam. In the setting of solitary output computations, only a single d",
  "content_length": 82149,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:31"
}