{
  "name": "Muyinatu A. Lediju Bell",
  "homepage": "https://pulselab.jhu.edu",
  "status": "success",
  "content": "Muyinatu Bell – Professor & PULSE Lab Director Skip to content The mission of the PULSE Lab, directed by Dr. Muyinatu Bell, is to engineer and deploy innovative biomedical imaging systems that address unmet clinical needs, with an emphasis on diagnostic and surgical ultrasound and photoacoustic technologies. Our highly interdisciplinary research agenda integrates optics, acoustics, robotics, signal processing, and medical device design, to significantly improve the standard of patient care. We develop theories, models, and simulations to investigate advanced beamforming techniques for improving ultrasonic and photoacoustic image quality. In parallel, we design and build novel light delivery systems for photoacoustic imaging and incorporate medical robots to improve operator maneuverability and enable standardized procedures for more personalized medicine. Our technologies are then interfaced with patients treated at the Johns Hopkins Hospital to facilitate clinical translation of the devices, methods, and tools developed in our lab. These techniques and technologies have applications in neurosurgical navigation, women’s health, coronary artery disease, early cancer detection, and improved cancer treatment. We are additionally motivated by the creation of these technologies to investigate fundamental science questions surrounding the limits of laser-tissue interactions and measurements of tissue and integrated system properties derived from acoustic data. The PULSE Lab is affiliated with the ECE, BME, CS, and Oncology Departments at JHU, as well as the following JHU institutes and centers: Malone Center for Engineering in Healthcare Laboratory for Computational Sensing and Robotics Hopkins Extreme Materials InstituteCarnegie Center for Surgical Innovation We have dedicated laboratory space at both the Homewood Campus and the Johns Hopkins Hospital School of Medicine. Our research has received generous funding and support from the following sponsors: Support Us Latest News Welcome to Sebastian, Jose, Joselyn, Yanlin, Yunlong, and Yun 10/13/2025 Five Abstracts Accepted to IEEE IUS 2025 09/22/2025 Journal Paper Accepted to IEEE TBME 07/16/2025 Journal Paper Accepted to IEEE TBME 06/29/2025 Welcome to Ella and Cindy 05/30/2025 Prof. Bell Wins Award from The Franklin Institute 04/26/2025 Journal Paper Accepted to IEEE T-UFFC 04/24/2025 Two Journal Papers Recently Published in BOE and UMB 04/17/2025 Rhea Rasquina Wins BiOS 3-Minute Poster Competition 02/03/2025 Six Abstracts Accepted to SPIE 01/24/2025 Welcome to Ajay Gunalan 11/07/2024 Research Featured on Cover of Biophotonics Discovery 10/13/2024 Prof. Bell Delivers Lopez Lecture to NIH NIBIB National Advisory Council 09/16/2024 Five Abstracts Accepted to IEEE UFFC-JS 2024 08/29/2024 Welcome to Jamie, Haben, Jahin, and Julia 08/28/2024 All NewsAll News Select Category All  (235) Awards  (58) Conferences  (59) Congrats  (121) Courses  (2) General  (6) Grants  (21) Keynotes  (10) Outreach  (12) Publications  (53) Publicity  (70) Research  (137) Seminars  (21) Social  (8) Welcome  (29)",
  "content_length": 3084,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:30"
}