{
  "name": "My Tra Thai",
  "homepage": "http://www.cise.ufl.edu/~mythai",
  "status": "success",
  "content": "My T. Thai Basic Information UF Research Foundation Professor (2016-present), CISE Department, University of Florida Associate Director (2018-present), Nelms Institute for the Connected World Full Professor (2015-present), CISE Department, University of Florida Associate Chair for Research (2015-2018), CISE Department, University of Florida Associate Professor (2011-2015), CISE Department, University of Florida Assistant Professor (2006-2011), CISE Department, University of Florida Areas of Specialization: Trustworthy AI; Blockchain; Security and Privacy; Big Graph Mining, Complex Network Analysis; Approximation Algorithms; Quantum Computing; Optimization Contact Information: Mailing Address: CSE Building, Room E301, University of Florida, P.O. Box 116120, Gainesville, Florida 32611-6120 Office: Room 550, CSE Building Fax: 352-392-1220, attn: My T. Thai Email: mythai@cise.ufl.edu Announcements Postdoc positions are available for 2019-21. Pls email me your CV and Research Statement if interested. Please email me if you'd like to chair the CSoNet 2019 and beyond. Recent Awards And Honors 2023 AAAI Distinguished Paper Award 2021 Fellow of IEEE 2021 Fellow of AAIA 2018 UF IoT Term Professorship Award 2018 IEEE/ACM ASONAM Best Paper Runner Up Award 2017 IEEE ICDM Best Papers Award 2017 IEEE ICDCS Best Paper Award Candidate 2016 UF Research Foundation Professorship Award 2014 IEEE MSN Best Paper Award 2011 Provost's Excellence Award for Assistant Professors at the University of Florida 2010 NSF CAREER Award 2009 Defense Threat Reduction Agency (DTRA) Young Investigator Award Recent Professional Activities Editor in Chief: IET Blockchain Journal, 2020-present (Founder) Journal Of Combinatorial Optimization, 2019 - present Book Series Editor: Springer Briefs in Optimization, 2010-present Steering Committee Chair: Int Conf on Computational Social Networks (CSoNet) Int IEEE INFOCOM Workshop on Inter-Dependent Networks (WIDN) Int ACM SIGMETRICS Workshop on Critical Infrastructure Network Security (CINS) General Chair: ICDM 2022 (IEEE Int Conference on Data Mining) MSN 2014 (IEEE Int Conference on Mobile Ad-hoc and Sensor Networks) WASA 2014 (International Conference on Wireless Algorithms, Systems, and Applications) CCNet 2011 (IEEE Globecom Workshop on Complex Communication Networks) TPC Chair: ICBC 2022 (IEEE International Conference on Blockchain and Cryptocurrency) BigData 2021 (IEEE International Conference on Big Data) Vice Chair in Big Data Learning and Analytics ICDCS 2019 (IEEE International Conference on Distributed Computing Systems) Track Chair: Social Networks and Crowdsourcing CINS 2018 (ACM SIGMETRICS International Workshop on Critical Infrastructure Network Security) MASS 2018 (IEEE Conf on Mobile Ad-hoc and Sensor Systems) Track Chair: Algorithms and Theory COCOON 2016 (International Computing and Combinatorics Conference) WIDN 2015 (IEEE INFOCOM Workshop on Inter-Dependent Networks) DySON 2014 (IEEE INFOCOM Workshop on Dynamic Social Networks) CSoNet 2013 (International Workshop on Computational Social Networks) ISSPIT 2012 (IEEE International Symposium on Signal Processing and Information Technology) IWCMC 2012, Mobile Computing Symposium (IEEE International Wireless Communications and Mobile Computing Conference) SIMPLEX 2011 (Workshop on Simplifying Complex Networks for Practitioners) COCOON 2010 (International Computing and Combinatorics Conference) CCNet 2010 (IEEE Globecom Workshop on Complex Communication Networks) DIS 2011 (International Conference on the Dynamics of Information Systems) Selected Talks \"Federated Learning: A False Sense of Security?\", IEEE Int Conf on Bigdata Security, 2023. Plenary Keynote \"Provable Guarantees on Privacy in the Age of Adversarial Learning\", 17th Int Conf on Ubiquitous Security, 2021. Plenary Keynote \"Nonlinear Explainability for Blackbox AI\" Women in Data Science (WiDS), 2021. Distinguished Speaker \"AI in Addiction Science: Potential and Challenges\", NIDA/NSF workshop on Computer and Addiction Science, 2021. Plenary Keynote \"Making Blackbox Models Explainable\", Int Conf on Wireless Algorithms, Systems, and Applications (WASA), 2021. Plenary Keynote ”Information Diffusion on Social Networks: From the Traditional Setting to the Future Blockchain-Based”, IEEE/ACM ASONAM, Aug 2018, Spain. Tutorial Talk \"Blockchain: Promising Future and Current Challenges\", Lancaster University, May 2018, UK. Invited Talk \"Mining in Online Social Networks: Dynamic Sampling and Adaptive Learning\", Int. Conf. on Machine Learning, Optimization, and Big Data (MOD), Sept 2017, Italy. Plenary Keynote \"Cyber Attacks in Online Social Networks through Social Bots\", the AFRL Mathematical Modeling and Optimization Institute (MMOI), Aug 2017. Plenary Keynote \"Viral Marketing: From the Approximation to the Exact on Billion-scale Networks\", Int. Conf. on Network-Based Information Systems (NBiS), Sept 2016, Czech. Plenary Keynote \"Group Testing and Its Application in Biological Screening\", Int. Conf. on Computational Biomedicine (CBM), 2016. Plenary Keynote ”Viral Marketing: A Road to Billion-scale Networks”, Int. Conf. on Combinatorial Optimization and Application (COCOA), Dec 2015, Houston, TX. Plenary Keynote \"Security in Smart Grids: Interdependency and Vulnerability\", Smart Grid Security Workshop, May 2014, Korea. Plenary Keynote ”Cybersecurity in Internet-of-Things”, Korea University, May 2014. \"Big Data in Social Networks\", Int. Conf. on Computer Information Systems and Industrial Management Applications (CISIM), 2014, Vietnam. Plenary Keynote. \"Interdependent Networks Analysis\", Learning and Intelligent Optimization Conference (LION 8), Feb 2014, USA. Tutorial Talk. \"Cybersecurity in Smart Grids\", National Security Research Institute, Nov 2013, Korea. Invited Talk \"Dynamic Community Structure Analysis in Complex Networks\", Int Conference on the Dynamics of Information Systems, Feb 2013. USA. Plenary Keynote \"How the Power-law Distribution Impacts on the Complex Network Vulnerability\", Int Workshop on Complex Networks, Mar 2012, USA. Invited Speaker. \"The Optimal Use of Social Networks to Manipulate Information\", University of Texas – Dallas, Department of Computer Science, Sep 2011. USA. Department Colloquium talk Current Students Nhat Hoang (Ph.D., joined since Fall 2023) Hoang Ngo (Ph.D., joined since Summer 2022) Tre' R. Jeter (Ph.D., joined since Fall 2021) Former Students Minh Vu (Ph.D., December 2023). Los Alamos National Laboratory (LANL) Raed Alharbi (Ph.D., August 2023). Saudi Electronic University Truc Nguyen (Ph.D., May 2023). National Renewable Energy Laboratory (NREL) Lan Nguyen (Ph.D., May 2021). Meta J. David Smith (Ph.D., August 2020). Doseform Tianyi Pan (Ph.D., August 2019). Google Xiang Li (Ph.D., August 2018). Santa Clara University Alan Kuhnle (Ph.D., August 2018). Texas A&M University Huiling Zhang (Ph.D., August 2018). Google Md Abdul Alim (Ph.D., Dec 2016). Optym Huiyuan Zhang (Ph.D., July 2016). Amazon Subhankar Mishra (Ph.D., July 2016). Indian Institute of Technology, Roorkee Dzung T. Nguyen (Ph.D., July 2013). Microsoft Nam Nguyen (Ph.D., March 2013). Towson University Yilin Shen (Ph.D., March 2013). Samsung Research Thang N. Dinh (Ph.D., March 2013). Virginia Commonwealth University Bo Li (Ph.D., Summer 2012, co-advice with Ye Xia). Microsoft Ying Xuan (Ph.D., Fall 2011). IBM Research Ravi Tiwari (Ph.D., June 2010). eBay Incheol Shin (Ph.D., May 2010). Mokpo National University, Korea Yu-Song Syu (M.S., June 2012) Ning Zhang (M.S., 2008). NEC Labs Research Interests My research interests span on the optimization and algorithmic mathematics underpinnings of billion-scale data mining, machine learning, and cybersecurity with applications to blockchains, healthcare, social media, and critical networking infrastructure. More information can be found at my lab: Adaptive Learning and Optimization. Funded Research Projects NSF 2021-2025, SCH: Trustworthy and Explainable AI for Neurodegenerative Diseases, (Lead PI: Thai, collaborate with E. Xing, R. Fang, and A. Ramirez-Zamora) NSF 2021-2023, SaTC: Trustworthy and Privacy-preserving Federated Learning, (Lead PI: Thai, collaborate with T. N. Dinh) NSF 2020-2023, SaTC: When Adversarial Learning Meets Differential Privacy: Theoretical Foundation and Applications, (UF PI: Thai, collaborate with H. Phan) FC2 2020-2021, Multi-Layer and Systematic Analytics for Securing the Internet-of-Things, (UF PI: Thai, collaborate with A. Mohaisen) NSF 2020-2023, FAI: Towards a Computational Foundation for Fair Network Learning, (collaborate with HH Tong and R Maciejewski) NSF 2019-2022, III: Stream-based Active Mining at Scale: Non-Linear Non-Submodular Maximization, (Lead PI: Thai, collaborate with DZ Du) CTMT 2020-2021, DeepTrust: Building Competency-aware AI Systems with Human-Centric Communication, (coPI, collaborate with S. Chan-Olmsted) UFII 2019-2021, Active Mining and Data Integrity at Scale: A Blockchain-based Approach (sole PI). NSF 2018-2021, NeST: Lightweight Adaptive Algorithms for Network Optimization at Scale towards Emerging Services, (Lead PI: Thai, collaborate with ZL Zhang) FC2 2018-2019, Thwarting APTs in IoT, (UF PI: Thai, collaborate with A. Mohaisen) FC2 2017-2018, Resilient Smart Grid Control for Load Switching Cyber Attacks, (UF PI: Thai, collaborate with Z. Miao) NSRI 2016-2017, Identification of Critical Monitoring Nodes in SCADA Network, (sole PI) FC2 2016-2017, Nonlinear Model-Based Cyber Attack-Resilient Smart Grid Control, (UF PI: Thai, collaborate with Z. Miao) NSF 2015-2019, EARS: Collaborative Research: Laying the Foundations of Social Network-Aware Cellular Device-to-Device Communications, (UF PI: Thai, collaborate with W. Saad and Z. Han) NSF 2014-2019, Collaborative Research: RIPS Type 2: Vulnerability Assessment and Resilient Design of Interdependent Infrastructures, (Lead PI: Thai, co-PI: V. Boginski, Y. Yin, C. McCarty, A. Sarwat) NSF 2014-2017, CCF: Modeling and Dynamic Analyzing for Multiplex S",
  "content_length": 14415,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:32"
}