{
  "name": "Mykola Pechenizkiy",
  "homepage": "http://www.win.tue.nl/~mpechen",
  "status": "success",
  "content": "Mykola Pechenizkiy's Homepage Mykola Pechenizkiy Full Professor, Chair Data Mining,Department of Computer Science, Eindhoven University of Technology (TU/e) Adjunct Professor (Dosentti) in Data Mining for Industrial Applications at the Department of Mathematical Information Technology, University of Jyvaskyla (JYU) Postal address: Data Mining group, W&I, TU/e, P.O. Box 513, 5600 MB Eindhoven, the Netherlands; Visiting address: Office MF 7.100 in MetaForum, De Groene Loper 5, 5612 AZ Eindhoven (see it on Google Maps) Tel: +31 40 247 2733 (secretary) Fax: +31(0)40 246 3992 E-mail: Curriculum Vitae, Publications and Recent Talks Short Biography; Short CV (pdf file) Publications listed in DBLP; Google Scholar; preprints and current submissions Recent talks, tutorials, presentations We have a few open PhD and Postdoc positions. Please check the vacancies page Visitors to our group If you have travel funding and want to collaborate with us on a project, please e-mail me the details. We also often have some funding for short and medium term visiting PhD/Postdoc researchers interested in currently Research Interests data science, knowledge discovery and data mining responsible analytics (fairness, accountability and transparency) context-aware predictive analytics handling concept drift and reoccurring contexts automation of feature construction analytics on evolving networks Data Mining Application Areas Responsible Data Science research program of DSC/e banking and insurance (RATE-Analytics and KYC Predictive analytics) (bio)medicine, healthcare (EDIC, RPM), lifestyle and wellbeing (Stress@work) commerce (food sales), industry (CFB boilers), smart maintenance (Prophesy) web analytics, social media and sentiment analysis process mining, learning analytics and educational data mining DSC/e, Nationally- and EU-funded Projects (full list of projects) EDIC: Exceptional and Deep Intelligent Coach (co-PI with prof. Hermie Hermens, 2019-2023) RATE-Analytics: Next generation predictive analytics for data-driven banking and insurance (principal investigator, 2016-2020) DSC/e and Rabobank: KYC-Analytics: Know Your Customer Predictive Analytics (principal investigator, 2016-2020) H2020 SODA: Scalable Oblivious Data Analytics project (H2020-ICT-2016-1; Big Data PPP) CAPA: Context-Aware Predictive Analytics (principal investigator, 2011-2016) HaCDAIS: Handling Concept Drift in Adaptive Information Systems (principal investigator, 2008-2012) GAF: Generic adaptation framework (co-promotor, 2008-2011) COMPASS: Complex Patterns in Streams (team member, 2009-2013) CurriM: Curriculum Mining (principal investigator, Mar - Oct, 2012) LADA: Learning Analytics Dashboard Applications (team member, Sep 2013 - June 2014) NL Agency CoDaK: Co-evolving Document collections & Knowledge structures (co-PI, 2011-2013) EIT ICT Labs: Service Spaces, Stress@work (TU/e partner, task leader, 2010-2013) NL Agency KWR MIP: Medical Information Processing, Philips Research and TU/e, (RPM task leader) (2009-2010) EU FP7 STREP: GRAPPLE: Generic Responsive Adaptive Personalized Learning Environment (TU/e partner, team member, 2008-2011) (Co-) Supervision Postdocs dr. Niek Bouman (May 2017 - Dec 2019), Data mining with secure computations (H2020 SODA project) dr. Samaneh Khoshrou (June 2017 - June 2020), RATE-Analytics dr. Firat Ismailoglu (Feb 2017 - Sep 2017), Retail analytics (with Philips Lighting) dr. Anne Driemel (Apr 2014 - Dec 2014), Context-Aware Predictive Web Analytics (now Assistant Professor in the Data Mining group) dr. Jeroen De Knijf (Mar 2012 - Dec 2013), Context-Aware Predictive Web Analytics (now Researcher at AVG Technologies) dr. Evgeny Knutov (Jan 2012 - Dec 2013), Co-evolving Document collections & Knowledge structures (now works hard on a startup) dr. Indre Zliobaite (Apr - Nov, 2010), Context-Aware Predictive Analytics (now Research Scientist at Aalto University, Finland) dr. Wauter Bosma (Mar - Dec, 2011), Co-evolving Document collections & Knowledge structures (now with Netherlands Forensic Institute) PhD Candidates Negar Ahmadi (started Jan 2016) Complex Brain Networks Analytics Guido Budziak (started Jan 2010; part-time), Data-Driven Decision Making with Web Analytics Alexandr Maslov (started Aug 2011), Knowledge Discovery from Sensor Data (together with T. Karkkainen and P. De Bra) Felipe Masculo (started July 2016), Model adaptation (together with P. De Bra and M. Petkovic) Iftitahu Nimah (started 2017), Deep Learning for Text Mining (together with V. Menkovski) Yulong Pei (started Sep 2015), Graph Evolution Mining (together with G. Fletcher) Erik Tromp (started Sep 2013; part-time), Authorship Profiling Du Xin (started Jan 2017) Exceptional Mobility Mining (together with W. Duivesteijn) Oren Zeev Ben Mordehai (started Jan 2017) Transparency of Predictive Models (together with W. Duivesteijn) Simon van der Zon (started Jan 2017) Interactive Predictive Analytics (together with W. Duivesteijn) Anil Yaman (started Nov 2015), (together with G. Fletcher and Matt Coler) Jianpeng Zhang (started Nov 2014), Stream Clustering (together with G. Fletcher ) Completed: Jorn Bakker (2012), Evgeny Knutov (2012), David Smits (2012), Julia Kiseleva (2016), Alejandro Montes Garcia (2017) PDEng Candidates (OOTI) Luc de Smet (Jan-Sep 2016): Impromptu: A flexible data analysis platform (Oce, supervised together with Rob kersemakers and Edy Klomp), expected by October 2016 Panagiotis Thomaidis (Jan-Sep 2014): An Extensible Architecture for Easy Integration of Clinical & Telehealth Data (Philips Research, supervised together with dr. Helen Schonenberg and Charalampos Xanthopoulakis) Fanis Grollios (Jan-Sep 2012): Nano-scale 3D Image Reconstruction and Analysis (FEI, supervised together with dr. Remco Schoenmakers) Catharina Ibrahim (Jan-Sep 2011): Web Enabled Education and Coaching Service (Philips Research, supervised together with dr. Wim Stut) Master projects & Internships in 2016-2017 (complete list for 2007-2017) E.J.T.G. van der Burgt Real estate price prediction, expected by March 2017 Vincent van Bergen Realtime bidding, (Targetcircle, supervised together with dr. Heiko Hildebrandt), expected by December 2016 Robbert Raats Water usage profiling with pattern matching, (Betabit and LevenIsWater, supervised together with Auke van Balen) expected by December 2016 Roy Haanen\tPredicting aircraft time to fly profile on final approach, (Aerospace Operations Safety Institute (AOSI) of the Netherlands Aerospace Centre (NLR), supervised together with G.B. van Baren), October 2016 Hao Zhang Consumer insights analytics: air purifier use case (Philips Research, supervised together with dr. Qi Gao and Mark Graus), October 2016 Adam Zika Identification of lead users on social media (Coosto.nl, supervised together with dr. Sarah Gelper and dr. Jorn Bakker), October 2016 Edward Brinkmann Improving the search engine user experience, October 2016 Rosa Sicilia Information diffusion in social media, (external MSc from U. Rome, supervised together with Yulong Pei and Paolo Soda), October 2016 Stella Lo Giudice Information diffusion in social media, (external MSc from U. Rome, supervised together with Yulong Pei and Paolo Soda), October 2016 Bob Giesbers Association rule mining of student grades, a Grammar Guided Genetic Programming approach, September 2016 Simon van der Zon Predictive Performance and Discrimination in Unbalanced Classification, September 2016 Dennis Eikelenboom Enterprise resource demand prediction through mining of sales data, (Microsoft), September 2016 Cas Hariri Data mining for understanding and optimizing building energy efficiency, (COFELY GDF-SUEZ), September 2016 Yangfengfan Zhang Philips Hue data analytics, (Philips Research, supervised together with dr. Pierluigi Casale), August 2016 Daniel Duwaer Self-learning adaptive traffic regulation and management, expected by August 2016 Laavanyaa Balasubramanian Hospital workflow data analytics (Philips Research, supervised together with dr. Supriyo Chatterjea), July 2016 Fengjun Wang on predictive/proactive maintenance service (Philips Research, supervised together with dr. Kees Wouters), July 2016 Harm Eggels Expected Goals in Soccer: Explaining Match Results using Predictive Analytics (PSV, supervised together with Ruud van Elk), August 2016 Koen Vrijdag Auction Price Prediction: Real Estate Value Prediction: An Instance-Transfer Learning approach, July 2016 Stijn Hoogervorst Inferring Demographics of Website Visitors with Supervised Learning, Adversitement BV, July 2016 Fangjing Wu Intelligent strategies to learn and recognise lifestyle patterns, (IMEC, supervised together with dr. Giuseppina Schiavone), June 2016 Simon Nouwens Web user behavior profiling (MastersPortal.eu, supervised together with dr. Martijn Willemsen), May 2016 Xu Wang Feature learning for efficient control, (Philips Research, supervised together with dr. Vlado Menkovski), January 2016 Honours projects (CSE Masters) Christine Gerpheide and Luc Smet (Apr - Aug 2013): Location-based ranking adjustment Timur Bagautdinov (Nov 2012 - Aug 2013): Managing multiple Ad serving subsystems Wouter Meulemans, Sander Verdonschot, Vincent van der Weele (Sep 2009 - Mar 2010): Time-series characterization for meta-learning Teaching in 2015-2016 academic year (previous years) 2IMM15: Web Information Retrieval and Data Mining (Fall 2017: Q1, TU/e) 2IID0: Web Analytics (Fall 2017: Q2, TU/e) together with Wouter Duivesteijn 2IMM00: Seminar Data Mining (Fall 2017: Q2, TU/e), together with Vlado Menkovski 2IMM05 Capita selecta Data Mining 2IMC05 Preparation Graduation Project for Embedded Systems (Fall 2016: Q2 and Spring 2017: Q3 TU/e) Professional Activities (2011-2016) (previous years) Professional positions: President of the International Educational Data Mining Society (IEDMS): 2015-2019 Chair of the Steering Committee IEEE CBMS Conference series: 2012-2016 ECML/PKDD Journal Track Guest Editorial Board (DAMI and MACH): 2014-2016 Associate editor",
  "content_length": 14452,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:35"
}