{
  "name": "Mylène C. Q. Farias",
  "homepage": "https://userweb.cs.txstate.edu/~mylene",
  "status": "success",
  "content": "Mylene Farias Main home resume Teaching classes students alumni Research areas publications databases Misc worth sharing activities and talks Mylène C.Q. Farias Associate Professor Department of Computer Science Texas State University Comal 311B, San Marcos Campus San Marcos, Texas, US Email: x@unb.br (replace x with mylene) Web: https://cs.txstate.edu/~asf93/ [CV (English)] [ Scopus ] [Google Scholar] [DBLP] [ ORCID ID ] [ResearchGate] [LinkedIn ] [Plubons] Bio Mylene Farias received her B.Sc. degree in electrical engineering from Federal University of Pernambuco (UFPE), Brazil, in 1995 and her M.Sc. degree in electrical engineering from the State University of Campinas (UNICAMP), Brazil, in 1998. She received her Ph.D. in electrical and computer engineering from the University of California Santa Barbara (UCSB), USA, in 2004 for work in no-reference video quality metrics. Dr. Farias has worked as a research engineer at CPqD (Brazil) in video quality assessment and validation of video quality metrics. She has also worked as an intern for Philips Re- search Laboratories (The Netherlands) in video quality assessment of sharpness algorithms and for Intel Corporation (Phoenix, USA) developing no-reference video quality metrics. Currently, she is an Associate Professor in the Department of Computer Science at Texas State University. Previously, she was an associate professor in the Department of Electrical Engineering at the University of Brasilia (UnB). To date, she has published 58 scientific journals and over 110 peer- reviewed conference papers. She is currently a Senior Area Editor for IEEE Signal Processing Letters and an Associate Editor for IEEE Transactions on Circuits and Video Technology, in addition to being an Area Editor for Elsevier Signal Processing Image Communication. In the past, she was an associate editor for SPIE Journal of Electronic Imaging and Elsevier Displays. Dr. Farias is a Senior Member of IEEE and the IEEE Signal Processing Society. She is also a member of ACM. She has served as a member and area chair in technical program committees of several conferences. She has served as a Technical Program Co-Chair for ACM IMX 2025, ACM NOSSDAV 2021 and QoMEX 2020 and 2023, and as a co-chair of the ACM MMSys 2022. She was elected as a member of the IEEE Image, Video, and Multidimensional Signal Processing Technical Committee and of the IEEE Multimedia Signal Processing Technical Committee, both of the IEEE Signal Processing Society. She is currently a member of the JPEG Pleno Light-Field Working Group and VQEG Immersive Media Group. She is also a member of the TV 3.0 Video Coding Layer Test Laboratories of the Brazilian Digital Television System. Her current interests include video quality metrics, video processing, multimedia signal processing, immersive media, and visual attention. Page generated 2025-10-25 17:31:33 CDT, by jemdoc+MathJax. (source)",
  "content_length": 2917,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:33"
}