{
  "name": "Myounghoon Philart Jeon",
  "homepage": "https://www.ise.vt.edu/people/faculty/jeon.html",
  "status": "success",
  "content": "Myounghoon \"Philart\" Jeon | Grado Department of Industrial and Systems Engineering | Virginia Tech Myounghoon \"Philart\" Jeon Professor Myounghoon \"Philart\" Jeon Philart Jeon 519G Whittemore Hall (MC 0118) 1185 Perry Street Blacksburg, VA 24061 myounghoonjeon@vt.edu 540-231-3510 Personal website       ResearchGate       Google Scholar Research Areas Main Area:  Human-Computer Interaction/ Human-Robot Interaction Sound and Music Computing Affective Computing Assistive Technologies Automotive User Interfaces Aesthetic Computing Education Ph.D., Engineering Psychology and Human-Computer Interaction, Georgia Institute of Technology M.S., Engineering Psychology, Georgia Institute of Technology M.S., Cognitive Sciences (Cognitive Engineering), Yonsei University, South Korea B.S., Psychology, Sociology, Yonsei University, South Korea Professional History Associate Professor, Department of Industrial and Systems Engineering, Virginia Tech, August 2018 - Present Associate Professor, Department of Cognitive and Learning Sciences, Department of Computer Science, Michigan Tech, August 2016-August 2018 Assistant Professor, Department of Cognitive and Learning Sciences, Department of Computer Science, Michigan Tech, August 2012-August 2016 Recent Courses Taught ISE 6624 Advanced Topics in HF: Affective Design and Computing ISE 6614 Human Computer Systems ISE 5654 Human Factors in System Design ISE 3614 Intro to Human Factors Engineering Selected Recent Publications Cao, Y., Yuan, J., Li, L., & Jeon, M. (2024). Head-up displays improve drivers’ performance and subjective perceptions with the in-vehicle gesture interaction system. International Journal of Human-Computer Interaction. Dam, A., Lee, Y., Siddiqui, A., Lages, W. S., & Jeon, M. (2024).  Audio augmented reality using sonification to enhance visual art experiences: Lessons learned. International Journal of Human-Computer Studies. Moon, H., Saade, M., Enriquez, D., Duer, Z., Moon, H. S., & Lee, S. W., & Jeon, M. (2024). Mixed-reality art as shared experience for cross-device users: Materialize, understand, and explore. International Journal of Human-Computer Studies, 103291. https://doi.org/10.1016/j.ijhcs.2024.103291 Tabbarah, M., Cao, Y., Fang, Z., Li, L., & Jeon, M. (2024). Sonically-enhanced in-vehicle air gesture interactions: Evaluation of different spearcon compression rates. Journal on Multimodal User Interfaces. Open Access: https://link.springer.com/article/10.1007/s12193-024-00430-3 Wang, M., Lee, S. C., & Jeon, M. (2024). Pairing in-vehicle intelligent agents with different levels of automation: Implications from driver attitudes, cognition, and behaviors in automated vehicles. Human-Computer Interaction. https://doi.org/10.1080/07370024.2024.2341217 Moon, H.S., Moon, H., Orr, G., & Jeon, M. (2024). The effects of whole-hand interactions with one fingertip vibrotactile feedback on cooperative VR game experience and performance. PRESENCE: Virtual and Augmented Reality, 32, 99-115. Dam, A., Siddiqui, A., Leclercq, C., & Jeon, M. (2024). Taxonomy and definition of audio augmented reality (AAR): A grounded theory study. International Journal of Human-Computer Studies, 182, 103179. Enriquez, D., Moon, H., Bowman, D., Jeon, M., & Lee, S. (2024). Investigating object translation in room-scale, handheld virtual reality. Journal track at the 23rd IEEE International Symposium on Mixed and Augmented Reality (ISMAR24), To appear in IEEE Transactions on Visualization and Computer Graphics. Bautista, C., Moon, H., Enriquez, D., Jeon, M., & Lee, S. W. (2024). Understanding multi-user, mobile-based mixed reality for group-based MR game. Proceedings of the ACM: Human-Computer Interaction, Volume 8, Issue CSCW1, Article No.: 197, pp. 1-28. Dong, J., Gowda, N., Wang, Y., Choe, M., Alsaid, A., Alvarez, I., Krome, S., & Jeon, M. (2024). Inside out: Emotoin GaRage vol. V. Adjunct Proceedings of the 16th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '24), Stanford, USA, September 22–25. Rampton, J. M., Robert, L. P., Jeon, M., Wang., M., Gan, G., Patel, A. R., & Miller, D. (2024). Steering UX education: Designing an automotive UX course. Adjunct Proceedings of the 16th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '24), Stanford, USA, September 22–25. Barton, H., Jeon, M., Trippe, J., Cohen, M., Kim, J., Wooldridge, A., & Lum, H.  (2024). What does it mean to be inclusive? A Conversation with the HFES Council of Affinity Groups (COAG). Proceedings of the ASPIRE - the HFES International Annual Meeting. Phoenix, AZ, September 9-13. Kim, S., Wang, M., Fok, M., Kim, J., Izaac, V., hornburg, C. B., Scarpa, A., & Jeon, M.  (2024). Exploring collaborative patterns in neurodiverse teams: a hidden markov model approach using physiological signals. Proceedings of the ASPIRE - the HFES International Annual Meeting. Phoenix, AZ, September 9-13. Wang, M., Fok, M., Kim, J., Izaac, V., hornburg, C. B., Scarpa, A., Jeon, M., & Kim, S. (2024). Exploring neurodiverse collaboration between autistic and non-autistic adults in an online setting: A pilot study. Proceedings of the ASPIRE - the HFES International Annual Meeting. Phoenix, AZ, September 9-13. Dam, A., Ro, H., Ban, G., Walker, S., Veinott, E., Lautala, P., & Jeon, M. (2024). Design of multimodal in-vehicle notifications at highway-rail grade crossings: A perception study. Proceedings of the ASPIRE - the HFES International Annual Meeting. Phoenix, AZ, September 9-13. Jeon, M., Ban, G., Choe, M., & Lee, Y. (2024). A novel affective design tool: Task Emotion Analysis (TEA). Proceedings of the ASPIRE - the HFES International Annual Meeting. Phoenix, AZ, September 9-13. Cho, I., Kim, K., Han, D., Bayro, A., Jeong, H., Kim, H., Moon, H., & Jeon, M. (2024, March). An Overview of the 3rd International Workshop on eXtended Reality for Industrial and Occupational Supports (XRIOS). In 2024 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW) (pp. 364-369). IEEE. Dong, J., Esterwood, C., Ye, X., Mitchell, J. J., Jo, W., Robert, L. P., Park, C. H., & Jeon, M. (2024). Taking a Closer Look: Refining Trust and its Impact in HRI. Proceedings of the ACM/IEEE International Conference on Human-Robot Interaction (HRI2024), Boulder, CO, March 11-15. IEEE. Dong, J., Mitchell, J. J., Yu, S., Harmon, M., Holstein, A., Shim, J. H., Choi, K., Zhu, Q., & Jeon, M. (2024). Promoting STEAM education and AI/Robot ethics in a child-robot theater afterschool program. Proceedings of the ACM/IEEE International Conference on Human-Robot Interaction (HRI2024), Boulder, CO, March 11-15. IEEE. Mitchell, J. J., Dong, J., Yu, S., Harmon, M., Holstein, A., Shim, J. H., Choi, K., Zhu, Q., & Jeon, M. (2024). Bridging the gap: Early education on robot and AI ethics through the robot theater platform in an informal learning environment. Proceedings of the ACM/IEEE International Conference on Human-Robot Interaction (HRI2024), Boulder, CO, March 11-15. IEEE. Professional Affiliations Associate Editor, International Journal of Human-Computer Studies, 2017 - Present Associate Editor, MIT Journal Presence: Teleoperations and Virtual Environments, 2015 - Present Senior Editor, Ergonomics in Design, 2018 - Present Editorial Board, Multimodal Technologies and Interaction, 2020 - Present President, International Community for Auditory Display, 2019 - 2022 General co-chair, International ACM Conference on Automotive User Interfaces and Interactive Vehicular Applications, 2022 Chair, Korean-American Human Factors and Ergonomics Society, 2021 - 2022 Co-chair, BIPOC Affinity Group in HFES, 2022 - Present Awards / Honors Principles of Community Award, Virginia Tech as the ISE DEI Committee (role: chair of the committee), 2024 Alphonse Chapanis Best Student Paper Award at HFES 2023 Conference, 2023 Earl Alluisi Award for Early Career Achievement, American Psychological Association (APA), Division 21 Applied Experimental & Engineering Psychology, 2022 Best Paper Award at the 27th ICAD Conference, Virtual, 2022 ICAT Creativity + Innovation Day Audiences’ Choice Award, 2022 ICAT Creativity + Innovation Day Judges’ Choice Award, 2022 Best Video Award 3rd Place HART TG at the 65th HFES Conference, USA 2021 Best Paper Award at the ArtsIT Conference, Denmark, 2016 Best Poster Abstract Paper Award at the 15th HCI International Conference, USA, 2013 ICAD Doctoral Student Consortium “ThinkTank”, Travel Funds (NSF), USA, 2010, 2011 Best Student Paper Award for the PPTG (Perception and Performance Technical Group) at the 53rd Annual Meeting of the Human Factors and Ergonomics Society, USA, October 19-23, 2009 IF Communication Design Award (Digital Media: Interface), Personal Navigation Device User Interface, Germany, 2007 Korean Ergonomic Design Award, Air Conditioner UI/AUI Design, Korea, 2007",
  "content_length": 8919,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:34"
}