{
  "name": "Myra B. Cohen",
  "homepage": "https://www.cs.iastate.edu/people/myra-cohen",
  "status": "success",
  "content": "Myra Cohen | Department of Computer Science Skip to main content Myra Cohen Position Professor Associate Chair for Research Lanh & Oanh Nguyen Endowed Chair of Software Engineering Myra Cohen is a Professor in the Department of Computer Science at Iowa State University, and the Lanh & Oanh Nguyen Endowed Chair of Software Engineering. Prior to joining the university, Dr. Cohen was previously a Susan J. Rosowski Professor in Computer Science and Engineering at the University of Nebraska-Lincoln where she was a member of Laboratory for Empirically-based Software Quality Research and Development, ESQuaReD. Contact Email mcohen@iastate.edu Phone 515-294-8305 202 Atanasoff Hall, 2434 Osborn Drive Ames, Iowa 50011-1090 Social Media and Websites website Research Area AI, ML, and Data Science Bioinformatics and Computational Biology Software Engineering and Programming Languages Area of Expertise Software testing of highly-configurable software Search based software engineering Testing of cyber-physical and scientific software Synergies between systems and synthetic biology Software Engineering Education Ph.D., University of Auckland, Auckland, New Zealand M.S., University of Vermont B.S. Cornell University, School of Agriculture and Life Sciences Her research interests are in software testing of highly-configurable software, search based software engineering, testing of cyber-physical and scientific software, and synergies between systems and synthetic biology, and software engineering. She received her Ph.D. from the University of Auckland, New Zealand, and was the recipient of an NSF CAREER award, an AFOSR Young Investigator Award, and has received 4 ACM distinguished paper awards.Myra Cohen is an ACM Distinguished Scientist, a Fellow of the Automated Software Engineering Conference (ASE), a Better Scientific Software (BSSw) Fellow,  and an IEEE Senior member. She serves on the steering committee of the IEEE/ACM International Conference on Automated Software Engineering, ESEC/FSE, the International Conference on Software Testing and the Systems and Software Product Line Conference.  She is was the program co-chair for  ESEC/FSE 2020 and will be the program co-chair of ISSTA 2025. She has served multiple organizational roles in software engineering conferences, and was the general chair of Automated Software Engineering in 2015. Recent Publications There was an error when fetching publications.",
  "content_length": 2431,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:34"
}