{
  "name": "Myra Spiliopoulou",
  "homepage": "http://www.kmd.ovgu.de",
  "status": "success",
  "content": "KMD - Knowledge Management & Discovery Lab Knowledge Management & Discovery Lab KMD stands for \"Knowledge Management and Discovery\" . The KMD Lab is part of the department Technical and Business Information Systems (ITI) . The KMD Lab was established in February 2003. In the KMD lab, we develop and apply data mining methods for dynamic environments, with particular emphasis on: Machine Learning methods for streams and time series with gaps – prediction and feature contribution Parsimonious usage of data and features – cost-aware active feature acquisition methods Design of human-understandable solutions Our application areas are: Medical Mining I : Treatment prediction, phenotyping in medical research Medical Mining II : Human interaction with mHealth apps Experiments I : Analysis of participant behavior in experimental settings Experiments II: Experiment design and analysis of human behavior in human-machine interaction We are currently involved in the TACTIC graduate school (2024-2027), in the RheumaMining project (2024-2027) and in the AICOLAB project. More on our research can be found here . Our research is reflected in our teaching curriculum, which is built around the topic of data mining: Students learn underpinnings of data mining in all bachelor courses we offer. In the mandatory courses ITO and WMS of the Bachelor Business Informatics degree, we focus on mining for business applications. In the Recommenders course, we elaborate on the mining methods for static and stream recommenders. In the courses Data Mining I (two variants, one for bachelor degrees, one for master degrees), students learn fundamentals on algorithms, model evaluation and data preparation. In Data Mining II, students learn learning methods for timestamped data. In the seminars, team projects and individual projects, students learn to design and apply mining and machine learning methods in realistic applications, and they get involved in our research - in team projects and individual projects. Our courses can be found under Study . News Exam Inspection SS 25 Exam inspection at KMD for the courses: Data Mining I (DM 1) Data Mining II (DM 2) Data Mining - An Introduction (DM4BA) Information Technology in Organizations (ITO) Recommenders ((RECSYS) is scheduled on  November 11 and November 18, 2025 from 9:30 to 11:00 by APPOINTMENT ONLY. Exam inspection at KMD for the courses: Data Mining I (DM 1) is scheduled on  November 04, 2025 from 9:30 to 13:00 by APPOINTMENT ONLY. Please apply via Mail to Christian Knopke more ... Presentation of Team and Software Projects WS2025/26 Our projects for bachelor and master students will be presented on the 14th of October 2025 in room 130 at 11am. more ... Exam Inspection WS24/25 Exam inspection at KMD for the courses: Data Mining I (DM 1) Data Mining II (DM 2) Data Mining - An Introduction (DM4BA) Information Technology in Organizations (ITO) Knowledge Management (WMS) Recommenders ((RECSYS) is scheduled on  April 23, 2025 (Wednesday) from 9:30 to 11:30 by APPOINTMENT ONLY (Venue: R130 and R128) . more ... Volunteers for Survey We are looking for voluteers to take a survey for an experiment, the link for the survey and other details are provided in the PDF attached. more ... Announcement: Master Thesis Opportunity on Classification of Rare Classes and Rare Values Investigating the potential of GraphNNs or multi-layer networks for classification of objects when the classes are rare and some of the predictive features are also rare more ... DM II Examination Annulment The DM II exam of summer term 2024 (written exam in July 2024) is annulated. Re-regristations open until 15th November 13:00. more ... Exam Inspection 2024 Exam inspection at KMD for the courses -Data Mining I (DM 1), Data Mining II (DM 2), Data Mining - Eine Einführung (DM4BA), Informationstechnologie in Organisationen (ITO), Wissensmanagement (WMS), Recommenders ((RECSYS)on Tuesday, November 5, 11:30 to 14:30 BY APPOINTMENT ONLY. more ... 1 2 3 4 5 6 7 8 9 RSS Last Modification: 10.11.2025 - Contact Person:",
  "content_length": 4056,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:36"
}