{
  "name": "Myrthe Lotte Tielman",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/interactive-intelligence/people/current-group-members/myrthe-tielman",
  "status": "success",
  "content": "Personal page of Myrthe Tielman Zoeken Sluit zoek Myrthe Tielman BiographyMyrthe Tielman is assistant professor in Interactive Intelligence. She has a background in cognitive artificial intelligence, and did her PhD in a virtual coach for PTSD therapy at the TUDelft (2013-2017). In her post-doc work (2017-2019) she focused on how to formally represent human norms and values in order to create more trustworthy personal agents. Since 2019, she has been assistant professor at the TUDelft and focuses on trust and trustworthy AI in the context of human-agent interaction. Together with Anahita Jamshidnedjad she is leading the AI*MAN lab (2020 - now), focused on mutual understanding in efficient human-AI teamwork. She has worked on the program committee of several conferences in the field such as AAMAS, IVA and HRI. In 2022, she was Program Chair on the first conference on Hybrid Human-Artificial Intelligence conference.Research statementMuch of what I do revolves around the theme of responsible and trustworthy AI. In particular, I am interested in how we can help AI systems understand people better. For instance, to understand people's values, how much a person trusts an AI system and whether a person understands the AI system back. In my ideal world, we will have AI assistants which inspire appropriate trust, which take into account people's values, which are explainable in their decision making and which understand the capabilities and needs of the humans they support. How to create such technology is the core of my research. This ranges from translating results from research on human behavior into technology, to finding those technological methods which allow computers to display the right behavior. In my work, I aim to combine methods from the field of Human-Machine Interaction with knowledge based AI and formal modelling.TeachingI am involved in a number of courses, most notably Human-Computer Interaction (CSE3500), Collaborative AI (CSE3210) and Conversational Agents (CS4270). Additionally, I regularly supervise both Bsc. research projects and Msc. thesis projects. If you are interested in the topics described in my research statement and looking for a Msc. thesis project at TUDelft, feel free to reach out to me. Deel deze pagina: Facebook Linkedin Twitter Email WhatsApp Deel deze pagina Myrthe Tielman +31 15 278 2523 M.L.Tielman@tudelft.nl Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands Room 4W.580 Personal website: https://ii.tudelft.nl/Myrthe/",
  "content_length": 2497,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:35"
}