{
  "name": "Mythili Vutukuru",
  "homepage": "https://www.cse.iitb.ac.in/~mythili",
  "status": "success",
  "content": "Mythili Vutukuru Associate Professor SIA-310, Kanwal Rekhi Building Department of Computer Science and Engineering Indian Institute of Technology, Bombay Powai, Mumbai, 400076 Email: mythili AT cse.iitb.ac.in Phone: (O) 7973 Bio: I am an Associate Professor at the Department of Computer Science and Engineering at IIT Bombay. Before joining IITB in 2013, I obtained my Ph.D. and M.S. degrees in Computer Science from the Massachusetts Institute of Technology in 2010 and 2006 respectively. I was advised by Prof. Hari Balakrishnan. After my Ph.D., I worked at Movik Networks, a startup in the telecom space, for 3 years before joining IITB. Earlier, I obtained a Bachelors in Computer Science and Engineering from the Indian Institute of Technology, Madras in 2004. Other links: My blog with my non-academic writings (mostly poetry). Teaching Online courses Here are some pointers to online teaching material (video lectures, slides, labs and assignments) for some of my courses, which may be useful to students and instructors outside IITB. Lectures on Operating Systems (UG core) Virtualization and Cloud Computing (PG elective) Design and Engineering of Computer Systems (PG elective / NPTEL course) IITB courses List of courses I have taught at IITB: Operating Systems (CS219/CS347) and Operating Systems Lab (CS236/CS333) (Spring 2025, Spring 2024, Autumn 2020, Autumn 2019, Autumn 2016, Spring 2016) CS695: Virtualization and Cloud Computing (Spring 2021, Spring 2020) CS744: Design and Engineering of Computing Systems (Autumn 2025, Autumn 2022, Autumn 2018, Autumn 2017) CS347M: Operating Systems Minor (Autumn 2024, Spring 2022, Spring 2019) BTech first year courses: CS103 Computing and Science (Autumn 2022), CS101 Computer Programming and Utilization (Spring 2023) CS641: Computer Networks (Autumn 2015, Autumn 2014) CS348M / CS224M: Computer Networks Minor (Autumn 2017, Spring 2015) CS653: Mobile Computing (Spring 2014) \"If you want to build a ship, don't drum up people to collect wood and don't assign them tasks and work, but rather teach them to long for the endless immensity of the sea.\" - Antoine de Saint-Exupery Research My main research interests lie in the broad area of networked systems. I like to work on challenging research problems at the intersection of computer networking and real-world computer systems. The source code of most of my projects is on the GitHub page of our research group. Below are some of the main threads in my current research. eBPF / XDP / AF_XDP. We are working on some exciting projects on improving in-kernel support for fast packet processing. Papers and code: FLASH paper (SoCC '25) and code Virtualized Mobile Packet Core. We are working on techniques that can improve the performance of 4G/5G mobile packet core components. We are are looking at next-generations designs for the mobile packet core based on the principles of Network Function Virtualization (NFV) and Software Defined Networking (SDN). Papers: 5G Core on Kubernetes (Comsnets '25), Fastlane (NFV-SDN '24), Pyramis (APNet '24), AppSteer (CCGrid '24), AccelUPF (SOSR '22), Network stack comparison for 5G Core (APNet '21), Accelerating 5G UPF with programmable dataplanes (APNet '21), TurboEPC (SOSR '20), Distributed EPC (NFV-SDN '17), Mobility aware EPC (NFV-SDN '17), NFV vs SDN (NFV-SDN '16). Code: We have built simplified versions of the LTE mobile packet core as part of our research: NFV-based LTE EPC and SDN-based LTE EPC. 5G testbed. My team is part of the 5G testbed project, a collaboration across several Indian institutes towards building an end-to-end 5G testbed for research purposes. Here is a list of past projects that have been completed. \"True happiness comes from the joy of deeds well done, the zest of creating things new.\" - Antoine de Saint-Exupery Students I have had the privilege of working with some great students in the past few years at IITB. Current PhD students Hari Sharan (co-advised with Prof. Biswabandan Panda) Khushboo Tiwari Preeti Debojeet Das (co-advised with Prof. Puru Kulkarni) Graduated PhD students Abhik Bose (currently at Arrcus) Ashwin Kumar (currently postdoc at Microsoft Research, India) Priyanka Naik (currently at IBM Research, India) Rinku Shah (co-advised with Prof. Puru Kulkarni) (currently at IIIT Delhi) Mukulika Maity (co-advised with Prof. Bhaskaran Raman) (currently at IIT Madras) Here is a complete list of B.Tech. and M.Tech. students who have worked with me for their BTP/MTP. \"All grown-ups were once children... but only few of them remember it.\" - Antoine de Saint-Exupery Publications Peer-reviewed Conferences and Journals FLASH: Fast Linked AF_XDP Sockets for High Performance Network Function Chains [pdf] Debojeet Das, Kevin Prafull Baua, Aditya Kansara, Arghyadip Chakraborty, Dheeraj Kurukunda, Mythili Vutukuru, Purushottam Kulkarni ACM Symposium on Cloud Computing (SoCC), Nov 2025. A Scalable and Fault-Tolerant 5G Core on Kubernetes [pdf] Sourav Paul, Tanvi Keluskar, Mythili Vutukuru International Conference on COMmunication Systems & NETworkS (COMSNETS), Jan 2025. Fastlane: A framework for building fast path network applications [pdf] Debojeet Das, Lakshya, Mythili Vutukuru IEEE Conference on Network Function Virtualization and Software Defined Networks (NFV-SDN), November 2024. Pyramis: A Domain Specific Language for Developing Multi-tier Systems [pdf] Ashwin Kumar, Ajinkya Tanksale, Armaan Chowfin, Mohan Ajjampudi, Arnav Mishra, Abuhujair Khan, Vishal Saha, Priyanka Naik, Mythili Vutukuru Asia-Pacific Workshop on Networking (APNet), August 2024. Feasibility of Application Layer Header Parsing in eBPF and P4 [pdf] Ashwin Kumar, Abhik Bose, Khushboo Tiwari, Arnav Mishra, Abhishek Dixit, Abuhujair Khan, Mythili Vutukuru IFIP/IEEE Networking, June 2024. AppSteer: Framework for Improving Multicore Scalability of Network Functions via Application-aware Packet Steering [pdf] Ashwin Kumar, Rajneesh Katkam, Pranav Chaudhary, Priyanka Naik, Mythili Vutukuru IEEE/ACM international Symposium on Cluster, Cloud and Internet Computing (CCGrid), May 2024. DDIOSim: A Microarchitecture Simulator for Data Direct I/O Technology [pdf] Hari Sharan, Mythili Vutukuru, Biswabandan Panda IEEE International Conference on High Performance Computing, Data, and Analytics (HiPC), Dec 2023. AccelUPF: Accelerating the 5G user plane using programmable hardware [pdf] Abhik Bose, Shailendra Kirtikar, Shivaji Chirumamilla, Rinku Shah, Mythili Vutukuru ACM SIGCOMM Symposium on SDN Research (SOSR), Oct 2022. Leveraging Programmable Dataplanes for a High Performance 5G User Plane Function [pdf] Abhik Bose, Diptyaroop Maji, Prateek Agarwal, Nilesh Unhale, Rinku Shah, Mythili Vutukuru Asia-Pacific Workshop on Networking (APNet), June 2021. Evaluating Network Stacks for the Virtualized Mobile Packet Core [pdf] Ashwin Kumar, Priyanka Naik, Sahil Patki, Pranav Chaudhary, Mythili Vutukuru Asia-Pacific Workshop on Networking (APNet), June 2021. (Demo paper) Demonstration of 5G core software system in Indias indigenous 5G test bed J Babu Narayanan Koonampilli, Mythili Vutukuru, Krishna M Sivalingam, Anusuya Balasubramanian, Raghavan Viswakumar Vinodh, Susheela Seshasayee, Kapil Gokhale, Deepak Vasuki Kashyap, Radhakrishna Rajaram Kamath International Conference on COMmunication Systems & NETworkS (COMSNETS), Jan 2021. (Demo paper) Development of MEC system for indigenous 5G test-bed Arzad Alam Kherani, Gaurav Shukla, Shashvat Sanadhya, Neha Vasudev, Muneeb Ahmed, Ashish Singh Patel, Rashi Mehrotra, Brejesh Lall, Huzur Saran, Mythili Vutukuru, Abhishek Singh, Sushila Seshasayee, Vinodh R Viswakumar, Kishore Loganathan International Conference on COMmunication Systems & NETworkS (COMSNETS), Jan 2021. TurboEPC: Leveraging Dataplane Programmability to Accelerate the Mobile Packet Core [pdf] Rinku Shah, Vikas Kumar, Mythili Vutukuru, Purushottam Kulkarni ACM SIGCOMM Symposium on SDN Research (SOSR), San Jose, CA, March 2020. libVNF: Building Virtual Network Functions Made Easy [pdf] Priyanka Naik, Akash Kanase, Trishal Patel, Mythili Vutukuru ACM Symposium on Cloud Computing (SoCC), Carlsbad, CA, October 2018. Cuttlefish: Hierarchical SDN Controllers with Adaptive Offload [pdf] Rinku Shah, Mythili Vutukuru, Purushottam Kulkarni IEEE International Conference on Network Protocols (ICNP), Cambridge, UK, September 2018. pcube: Primitives for network data plane programming [pdf] Rinku Shah, Aniket Shirke, Akash Trehan, Mythili Vutukuru, Purushottam Kulkarni P4 European Workshop, colocated with ICNP 2018. Witals: AP-centric Health Diagnosis of WiFi Networks [pdf] Mukulika Maity, Bhaskaran Raman, Mythili Vutukuru, Avinash Chaurasia, Rachit Srivastava IEEE Transactions on Mobile Computing, Volume 17, Issue 4, April 2018. Performance Comparison of State Synchronization Techniques in a Distributed LTE EPC [pdf] Pratik Satapathy, Jash Dave, Priyanka Naik, Mythili Vutukuru IEEE Conference on Network Function Virtualization and Software Defined Networks (NFV-SDN), Berlin, Germany, November 2017. Mobility-aware VNF Placement in the LTE EPC [pdf] Akanksha Patel, Mythili Vutukuru, Dilip Krishnaswamy IEEE Conference on Network Function Virtualization and Software Defined Networks (NFV-SDN), Berlin, Germany, November 2017. libVNF: A Framework for Building Scalable High Performance Virtual Network Functions [pdf] Priyanka Naik, Mythili Vutukuru ACM SIGOPS Asia-Pacific Workshop on Systems (APSys), Mumbai, India, September 2017. DiME: A Performance Emulator for Disaggregated Memory Architectures [pdf] Dhantu Buragohain, Abhishek Ghogare, Trishal Patel, Mythili Vutukuru, Purushottam Kulkarni ACM SIGOPS Asia-Pacific Workshop on Systems (APSys), Mumbai, India, September 2017. Devolve-Redeem: Hierarchical SDN Controllers with Adaptive Offloading [pdf] Rinku Shah, Mythili Vutukuru, Purushottam Kulkarni Asia-Pacific Workshop on Networking (APNet), Hong Kong, China, August 2017. TCP Download Performance in Dense WiFi Scenarios: Analysis and Solution [pdf] Mukulika",
  "content_length": 14463,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:35"
}