{
  "name": "Myung J. Lee",
  "homepage": "https://www.ccny.cuny.edu/profiles/myung-lee",
  "status": "success",
  "content": "Myung Jong Lee | The City College of New York Skip to main content > Home / Faculty and Staff Profiles / Myung Jong Lee Myung J. Lee Professor Main Affiliation Electrical Engineering Additional Departments/Affiliated Programs Computer Engineering Building Steinman Hall Office ST 677 Phone (212) 650-7260 Fax (212) 650-8249 Email mlee@ccny.cuny.edu Myung J. Lee Profile Dr. Myung J. Lee received a B.S and an MS from Seoul National University in Korea and Ph.D degree from Columbia University in electrical/electronics engineering. He is currently a professor at the Dept of Electrical & Computer Engineering and a doctoral faculty of computer science at Graduate Center of City University of New York. He is also an adjunct professor at GIST. Dr. Lee’s recent research interests include AI/machine learning for communications and networks such as resource management for wireless systems and mobile edge cloud computing network, stochastic computing  applications for deep neural networks, intrusion detection system, secure V2X communications, and COSMOS wireless testbed beyond 5G. His researches have been funded by government agencies and leading industries, including, NSF, ARL, Bellcore, Samsung and ETRI.  He published extensively in those research areas more than 200 journal and conference papers, book chapters, and  more than 25 U.S and international patents, and numerous international standard contributions including IEEE 802.15 standards (chair for TG5 WPAN Mesh and TG8 Peer Aware Communications) and ZigBee.  Dr. Lee’s research group developed the first NS-2 simulator for IEEE 802.15.4, a standard NS-2 distribution widely used for wireless sensor network researches. He co-received the three best paper awards and CUNY Performance Excellence Award. Education Ph.D., Electrical Engineering, Columbia University, New York, 1990 M.S., Electrical Engineering, Seoul National University, Korea, 1978 B.S., Electrical Engineering, Seoul National University, Korea, 1976 Courses Taught 5G Mobile Communication & IoT Wireless Communications Probability and Random Processes Wireless sensor/ad hoc networks Advanced wireless multimedia networks Senior Design Research Interests Dr. Lee’s current research interests include Machine Learning based management of resources for mobile edge cloud and IoT, wireless communications, Secure V2X group communications, stochastic computing based Deep Neural Net and Intrusion Detection System, and NSF COSMOS wireless testbed for future wireless communications. Recent projects: •    NSF PAWR: COSMOS testbed (Cloud Enhanced Open Software Defined Mobile Wireless Testbed for City-Scale Deployment) The COSMOS testbed will cover one square mile in West Harlem, with City College to the north, Columbia University’s Morningside Heights campus to the south, the Hudson River to the west, and Apollo Theater to the east. This vibrant, densely populated neighborhood is seen as an ideal place to push the bandwidth and latency limits of 4G, and even fifth-generation wireless technology, or 5G, which carriers are starting to roll out in some cities now. The COSMOS architecture has a particular focus on ultra-high bandwidth and low latency wireless communication tightly coupled with edge cloud computing. The COSMOS testbed will be deployed in upper Manhattan and will consist of 40-50 advanced software-defined radio nodes along with fiber-optic front-haul and back-haul networks and edge and core cloud computing infrastructure. Researchers will be able to run experiments remotely on the COSMOS testbed by logging into a web-based portal which will provide various facilities for experiment execution, measurements, and data collection. •    NSF IRNC: Testbed COSMOS Interconnecting Continents (COSMIC) A Rutgers/Columbia/Arizona/CCNY team has been awarded  from NSF entitled \"IRNC: Testbed: COSMOS Interconnecting Continents (COSM-IC)\".  The CCNY PI Prof. Saadawi and Co-PI Prof. Myung Lee. The project is aimed at development of an international networking and wireless testbed by federating US research testbeds including COSMOS, ORBIT, FABRIC and PEERING with experimental facilities in Ireland, Greece, Brazil and Japan.  The federated international testbed will enable experimental research on a wide range of  optical, wireless, SDN networking, inter-domain routing and edge computing experiments at a global scale. In particular, CCNY and Kyutech Japan have been collaborating for a set of experiments using COSM-IC fiber connectivity. •    NSF STTR Phase I:  Stochastic Computing-based Host Intrusion Detection System Stochastic Computing (SC) to provide hardware Host Intrusion Detection System (HIDS) security solution for resource limited IoT devices.  The proposed approach exploited two salient properties of SC: 1) consumption of less silicon area and power, 2)  both SC and HIDS are inherently probabilistic in nature. SC is generated probabilistically from conventional number system that can perform complex mathematical operation using simple hardware blocks. The proposed approach provides industrial drone with HIDS based on simple hardware together with  Machine Learning Neural Network Algorithm. Coupled with other security layers such as cryptography, access control etc., this light weight hardware solution provides strong security to the resource limited IoT devices. Embedded inside the device, this HIDS monitors the incoming packets for any malicious activity and offers the important layer of security defense. •    NSF JUNO2:  Resilient Cloud Designed Networks (RECN) The objective of this joint research between CUNY and Kyutech Japan is to conduct between   foundational research on a resilient edge cloud designed network to achieve basic understanding of the underlying science for future RECN. This work will cover issues of security, heterogeneity, resource constraints and potential mobility of end devices/sensors. A backbone network will be implemented and diversity of access network technologies, availability/placement of computing resources and Quality of Service (QoS) requirements will be examined. Publications (Selected) •    Arslan Qadeer, Myung Lee, Daiki Nobayashi,  “P4-based In-Network RL inference for Efficient Flow-Level Bandwidth Allocation,” IEEE Globecom 2023, Accepted •    Shota Akiyoshi, Yuzo Taeknaka, Kazuya Tsukamoto, Myung Lee, “Content search method utilizing the metadata matching characteristics of both Spatio-temporal content and user request in the IoT era”,  IEICE Transaction on Communication,  Aug. 2023 •    Arslan Qadeer and Myung Lee, “Deep-Deterministic Policy Gradient based Multi-Resource Allocation in Edge-Cloud System: A distributed approach,” IEEE Access, Vol. 11, Jan. 2023, pp. 20381-20398, Digital Object Identifier: 10.1109/ACCESS.2023.3249153 •    Hotaka Kaneyasu, Daiki Nobayashi, Kazuya Tsukamoto, Takeshi Ikenaga, Myung Lee, “Complementary Data Transmission Control with Collision Avoidance for Efficient Retention of Large-size Spatio-temporal Data”, IEEE CCNC 2023 •    Tingjun Chen, et. al, “Open-Access Millimeter-Wave Software-Defined Radios in the PAWR COSMOS Testbed: Design, Deployment, and Experimentation,” Computer Networks,  (COMMNET-D-23-00990), co-author: Prasanthi Maddala, Panagiotis Skrimponis, Jakub Kolodziejski, Abhishek Adhikari, Hang Hu, Zhihui Gao, Arun Paidimarri, Alberto Valdes-Garcia, Myung Lee, Sundeep Rangan, Gil Zussman, Ivan Seskar, Accepted July 2023. •    Arslan Qadeer and Myung Lee, “HRL-Edge-Cloud: Multi-Resource Allocation in Edge-Cloud based Smart-StreetScape System using Heuristic Reinforcement Learning,” Accepted to Springer Journal of Information Systems Frontiers, January 2023.   DOI:10.1007/s10796-022-10366-2 •    A. Qadeer, M. Lee, K. Tsukamoto, “Flow-level Dynamic Bandwidth Allocation in SDN-enabled Edge Cloud using Heuristic Reinforcement Learning,” 8th IEEE Conference, on Future Internet of Things and Cloud, August, 2021 •    Shumpei Shimokawa, Yuzo Taeknak, Kazuya Tsukamoto, Myung Lee,  “SDN based in-network two-staged video QoE estimation with measurement error correction for edge network,” IEEE Access Journal, Vol. 9, Feb, 23, 2021 •    K. Ahmed, M. Hernandez, M. Lee, K. Tsukamoto, “End-to-end Security for Connected Vehicles,” Proc. of The 12-th International Conference on Intelligent Networking and Collaborative Systems (INCoS-2020), Canada, Sept, 2020 •    (Invited Paper) T. Saadawi, A. Kawaguchi, M. Lee, A. Mowshowitz, “ Secure Resilient Edge Cloud Designed Network”, Trans. IEICE, Vol. E103-B, No. 4, pp.291-301 April 2020 •    Kazi Ahmed and Myung Lee, “Secure Resource Allocation for  LTE-based V2X Service,”    IEEE Transaction on Vehicular Technology, Vol. 67, No. 12, pp. 11324-1133, Dec. 2018 •    Kazi Ahmed and Myung Lee, “Secure, LTE-based D2D for V2X Services,”  IEEE IoT Journal, Vol. 5, No. 5, October, 2018, pp. 3724-3732 •    A. Qadeer, M. Lee, K. Tsukamoto, “Real-time Multi-resource Allocation via Structured Policy Table,”  Proc. INCoS-2019, Sept, 2019 •    (Best Paper) S. Yamasaki, T. Kanaoka, Y. Taenaka, K. Tsukamoto, M. Lee, “ SDN-based time-domain error correction for in-network video QoE estimation in wireless networks,” Proc. of INCoS-2019, Sept. 2019 •    Kwang Myung Jeon, Chan Jun Chun, Hong Kook Kim, and Myung J. Lee, “User-Aware Audio Marker Using Low Frequency Ultrasonic Object Detection and Communication for Augmented Reality,”  Journal of Applied Science, Appl. Sci. May 2019 •    K. Ahmed, B. Yuan, M. Lee, “High Accuracy Stochastic Computing based FIR Filter Design,” ICASSP 2018, Canada 2018 •    M. Hussain, W. Brandauer, Myung Lee, “Mobility-aware Vehicle-to-Grid (V2G) Optimization for Uniform Utilization in Smart Grid based Power Distribution Network,” Journal of Mobile Networks and Application (MONET),  April, 2018 •    M Hussain and M. Lee, “End-to-end Delay minimization in Multi-Channel, TDMA Wireless Sensor Networks by Particle Swarm Optimization,” IEEE ICACCE 2018 (IEEE International Conference on Advances in Computer and ",
  "content_length": 11654,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:35"
}