{
  "name": "Mário J. Silva",
  "homepage": "http://lisboa.academia.edu/M%C3%A1rioJSilva",
  "status": "success",
  "content": "Mário J. Silva - Universidade de Lisboa Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Mário J. SilvaUniversidade de Lisboa, Departamento de Engenharia Informática (IST), Faculty MemberaddFollowdoneFollowingFollowers144Following31Co-authors2Public ViewsAddress: Rua Alves Redol, 91000-029 LisboalessRelated Authors Steven PinkerHarvard University Beat SignerVrije Universiteit Brussel Sebastián VenturaUniversidad de Córdoba Geylani KardasEge University Asha VijayanAmrita Vishwa Vidyapeetham Aswani Kumar CherukuriVIT University Armando Marques-GuedesUNL - New University of Lisbon Kati (Katalin) PrajdaUniversity of Vienna Fabio CuzzolinOxford Brookes University José Alfonso AguilarUniversidad Autónoma de SinaloaInterestsView All (7) UploadsPapers by Mário J. SilvaWebCAT: A Web content analysis tool for IR applicationsProceedings of WI-2005, The 2005 IEEE/WIC/ACM International Conference on Web Intelligence, 2005 Geo Linked Databy Francisco J. Lopez-Pellicer and Mário J. SilvaLecture Notes in Computer Science, 2010The pervasive use of map viewer clients on Semantic Web applications shows the juxtaposition of t... more The pervasive use of map viewer clients on Semantic Web applications shows the juxtaposition of two worlds: the Semantic Web and the Geo Web. The Geo Web is a wide Web community based on the use of a set of specifications and applications with which systems can share and transform data with geographic content. This paper analyzes the powerful role of px, yq as linker of spatial knowledge, and describes a practice, Geo Linked Data, that transforms the juxtaposition into a formal link between two different approaches of representation of the spatial semantics: the formal, represented by the Semantic Web, and the configurational, represented by the Geo Web.Download A deposit for digital collectionsby José Borbinha and Mário J. SilvaResearch and Advanced …, Jan 1, 2001Download Handling Locations in Search Engine QueriesThis paper proposes simple techniques for handling place references in search engine queries, an ... more This paper proposes simple techniques for handling place references in search engine queries, an important aspect of geographical information retrieval. We address not only the detection, but also the disambiguation of place references, by matching them explicitly with concepts at an ontology. Moreover, when a query does not reference any locations, we propose to use information from documents matching the query, exploiting geographic scopes previously assigned to these documents. Evaluation experiments, using topics from CLEF campaigns and logs from real search engine queries, show the effectiveness of the proposed approaches.Download Relevance Ranking for Geographic IRIn this paper, we introduce a geographic similarity operator that computes the relatedness betwee... more In this paper, we introduce a geographic similarity operator that computes the relatedness between two geographic places and describe how it is combined with textual ranking. The effectiveness of the geographic ranking is evaluated on the GeoCLEF 2005 collection. We considered various strategies for query formulation and for combining textual ant geographical ranking. For some queries, geographic ranking significantly improves results, while for other queries it does not have a positive impact.Download Query expansion through geographical feature typesThis paper introduces a new approach for expansion of queries with geographical context. The prop... more This paper introduces a new approach for expansion of queries with geographical context. The proposed strategy is based on a query parser that captures geonames and spatial relationships, and maps geographical features and feature types into concepts of a geographical ontology. Different strategies for query expansion, according to the geographical restrictions given by the user, are compared. The proposed method allows a more versatile and focused expansion towards the geographical information need of the user.Download The XLDB Group at GeoCLEF 2005This paper describes our participation at the GeoCLEF 2005 task. We detail the main software comp... more This paper describes our participation at the GeoCLEF 2005 task. We detail the main software components of our Geo-IR system, its adaptation for the participation at GeoCLEF and discuss the obtained results. The software architecture includes a geographic knowledge base, a text mining tool for geo-referencing documents, and a geo-ranking component to re-rank the results of a standard IR index according to geo-scopes. Evaluation shows that ranking with geographic scopes is heavily dependent on the information loaded in the knowledge base and on the ranking algorithm involved, requiring more than the correct assignment of a geo-scope to each document.Download Theme-based retrieval of Web newsEfficient information retrieval of highly dynamic information, such as Web news, is a complex tas... more Efficient information retrieval of highly dynamic information, such as Web news, is a complex task. As a result, search and retrieval environments for continuously updated news from other sources than the largest media conglomerates are almost absent on the Internet. Global search engines do not index or classify news information from smaller network communities. To address this problem, I developed NewsSearch, a news information management environment designed to improve retrieval efficiency of online news for the smaller networked communities.Download Characterizing a national community webACM Transactions on Internet Technology, 2005Abstract This article presents a characterization of the community Web of the people of Portugal.... more Abstract This article presents a characterization of the community Web of the people of Portugal. We defined criteria for delimiting this Web based on our past experience of crawling pages related to Portugal and collected over 3.2 million documents from 46,000 sites satisfying those criteria. Our characterization was derived from this crawl. We describe the rules that we established for defining the boundaries of this community Web and the methodology used to gather statistics. Statistics cover the number and domain distribution ... A Graph-Ranking Algorithm for GeoReferencing DocumentsThis paper presents an application of PageRank for assigning documents with a corresponding geogr... more This paper presents an application of PageRank for assigning documents with a corresponding geographical scope. We describe the technique in detail, together with its theoretical foundations. Experimental results are promising, comparing favorably with previous proposals.Download A Geographic Knowledge Base for Semantic Web ApplicationsThis paper introduces GKB, a repository based on a domain independent meta-model for integrating ... more This paper introduces GKB, a repository based on a domain independent meta-model for integrating geographic knowledge collected from multiple sources. We present the architecture, the repository design and the data cleaning and knowledge integration processes. We also describe the rules developed to add new knowledge to GKB. GKB includes tools for generating ontologies, which are being used by multiple semantic web applications. To illustrate how it is being used, we present some of the applications that interact with the repository or load ontologies created with GKB.Download Language identification in web pagesThis paper discusses the problem of automatically identifying the language of a given Web documen... more This paper discusses the problem of automatically identifying the language of a given Web document. Previous experiments in language guessing focused on analyzing \"coherent\" text sentences, whereas this work was validated on texts from the Web, often presenting harder problems. Our language \"guessing\" software uses a well-known n-gram based algorithm, complemented with heuristics and a new similarity measure. Both fast and robust, the software has been in use for the past two years, as part of a crawler for a search engine. Experiments show that it achieves very high accuracy in discriminating different languages on Web pages.Download Indexing and ranking in Geo-IR systemsThis paper addresses document indexing and retrieval using geographical location. It discusses po... more This paper addresses document indexing and retrieval using geographical location. It discusses possible indexing structures and result ranking algorithms, surveying known approaches and showing how they can be combined to build an effective Geo-IR system.Download Adding geographic scopes to web resourcesComputers, Environment and Urban Systems, 2006Many Web pages are rich in geographic information and primarily relevant to geographically limite... more Many Web pages are rich in geographic information and primarily relevant to geographically limited communities. However, existing IR systems only recently began to offer local services and largely ignore geo-spatial information. This paper presents our work on automatically identifying the geographical scope of Web documents, which provides the means to develop retrieval tools that take the geographical context into consideration. Our approach makes extensive use of an ontology of geographical concepts, and includes a system architecture for extracting geographic information from large collections of Web documents. The proposed method involves recognising geographical references over the documents and assigning geographical scopes through a graph ranking algorithm. Initial evaluation results are encouraging, indicating the viability of this approach.Download Web access mining from an on-line newspa",
  "content_length": 10742,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:42"
}