{
  "name": "Mélanie Bouroche",
  "homepage": "https://www.scss.tcd.ie/Melanie.Bouroche",
  "status": "success",
  "content": "TCD SCSS Melanie Bouroche School of Computer Science and Statistics, Trinity College Dr. Mélanie Bouroche Status: Lecturer in Middleware for Distributed Systems - Future Cities Research Programme Manager Location: O'Reilly Institute F.26 Phone: +353 1 896 8556 e-mail: Melanie.Bouroche@scss.tcd.ie Research Interests: Future Cities - Middleware for Smart Cities - Wireless Sensor Networks, Vehicular Communication, Coordination of Mobile Autonomous Entities - Distributed Systems Vacancies: PhD position in Distributed Systems - Connected Autonomous Vehicles 2019 Publications: For up to date publications, check my Google Scholar page. 2015 Constantinos Patsakis, Paul Laird, Michael Clear, Mélanie Bouroche, Agusti Solanas, Interoperable privacy-aware e-participation within smart cities, Computer 48 (1), 52-58 2014 Guojun Qin, Constantinos Patsakis and Mélanie Bouroche, Playing Hide and Seek with Mobile Dating Applications, IFIP International Information Security and Privacy Conference (SEC), June 2014, p185-196. Constantinos Patsakis, Riccardo Venanzi, Paolo Bellavista, Agusti Solanas, Mélanie Bouroche, Personalized Medical Services using Smart Cities Infrastructures, 2014 IEEE International Symposium on Medical Measurements and Applications(MeMeA), June 2014. Constantinos Patsakis, Michael Clear, Paul Laird, Athanasios Zigomitros, Mélanie Bouroche, Privacy-Aware Large-Scale Virological and Epidemiological Data Monitoring, 27th International Conference on Computer-Based Medical Systems (CBMS), May 2014. Constantinos Patsakis, Kleanthis Dellios, Mélanie Bouroche, Towards a distributed secure in-vehicle communication architecture for modern vehicles, Elseviers Computers & Security, Volume 40, February 2014, Pages 60-74. Atif Manzoor, Constantinos Patsakis, Alistair Morris, Jessica McCarthy, Gabriel Mullarkey, Han Pham, Siobhán Clarke, Vinny Cahill, Mélanie Bouroche, CityWatch: Exploiting Sensor Data to Manage Cities Better, Transaction on Emerging Telecommunications Technologies, Special Issue: Smart Cities - Trends & Technologies, Volume 25, Issue 1, pages 6480,Wiley January 2014 2013 Atif Manzoor, Constantinos Patsakis, Siobhán Clarke, Vinny Cahill, Jessica McCarthy, Gabriel Mullarkey, Mélanie Bouroche, Data sensing and dissemination framework for smart cities, in the 6th International Conference on MOBILe Wireless MiddleWARE, Operating Systems, and Applications (MobilWare), November 2013. Atif Manzoor, Hong-Linh Truong, Alberto Calatroni, Daniel Roggen, Mélanie Bouroche, Siobhán Clarke, Vinny Cahill, Gerhard Tröster and Schahram Dustdar, Analyzing the impact of different action primitives in designing high-level human activity recognition systems, in IOS Journal of Ambient Intelligence and Smart Environments, volume 5, AOIS press p443461, vol 5, no 5. Stefano Tennina, Marco Tiloca, Jan-Hinrich Hauer, Mélanie Bouroche, Mario Alves, Anis Koubaa, Petr Jurcik, Nuno Pereira, Ricardo Severino, Eduardo Tovar, Gianluca Dini and Roberta Daidone IEEE 802.15. 4 and ZigBee as Enabling Technologies for Low-Power Wireless Systems with Quality-of-Service Constraints by Springer. 2012 Niall O'Hara, Marco Slot, Dan Marinescu, Jan Curn, Dawei Yang, Mikael Asplund, Mélanie Bouroche, Siobhán Clarke and Vinny Cahill, MDDSVsim: An Integrated Traffic Simulation Platform for Autonomous Vehicle Research, at The International Workshop on Vehicular Traffic Management for Smart Cities (VTM 2012), Dublin, Ireland, Nov 2012, invited paper. Atif Manzoor, Melanie Bouroche, Siobhán Clarke, Vinny Cahill. Trust Evaluation for Participatory Sensing, in the 9th International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (MobiQuitous), LNCS vol 120, 2012. Mithileash Mohan, Arnab Bhattacharya, Mélanie Bouroche, Vinny Cahill, BLESS: A divine energy saving protocol for wireless sensor networks, Wireless days, IFIP, 2012 Dan Marinescu, Jan Curn, Mélanie Bouroche, Vinny Cahill, On-ramp traffic merging using cooperative intelligent vehicles: A slot-based approach in Proceedings of the 15th International IEEE Conference on Intelligent Transportation Systems (ITSC), pp900-906, September 2012. Mikael Asplund, Atif Manzoor, Mélanie Bouroche, Siobhán Clarke and Vinny Cahill, A Formal Approach to Autonomous Vehicle Coordination, in Proceedings of the 18th International Symposium on Formal Methods, Springer, August 2012. Farrukh Mirza, Mélanie Bouroche, and Vinny Cahill. Unstable Path Routing in Urban-Scale WSN, in ACM SIGBED Review, Volume 9 Issue 3, pp 24-28, July 2012. Maurice Gavin, Vikram Pakrashi, John Barton, Brendan O'Flynn, Mélanie Bouroche, Bidisha Ghosh. Cyclists' Route Planner Mobile-app for Dublin City, in European Transport Conference 2012. Mélanie Bouroche, Vinny Cahill, Siobhan Clarke, Ivana Dusparic, Anurag Garg, Fabian Bustamante. Research Challenges in Participatory Sensing for Urban Management Applications, 11th IT&T Conference, March 2012, invited paper. 2011 Marco Slot, Mélanie Bouroche and Vinny Cahill. Design of a Safety-critical Geocast API for Vehicular Coordination. nternational Journal of Vehicle Information and Communication Systems (IJVICS),vol 2, no.3/4, pp. 193  212, December 2011. Stefano Tennina, Mélanie Bouroche, Pedro Braga, Ricardo Gomes, Mario Alves, Farrukh Mirza, Vincenzo Ciriello, Gabriella Carrozza, Pedro Oliveira and Vinny Cahill. EMMON: A WSN System Architecture for Large Scale and Dense Real-Time Embedded Monitoring. Proceedings of the 9th IEEE/IFIP International Conference on Embedded and Ubiquitous Computing (EUC 2011) Colm Bhandal, Mélanie Bouroche and Arthur Hughes. An Abstract Model of a Coordination Protocol using the UPPAAL model checker. Proceedings of the 9th IEEE/IFIP International Conference on Embedded and Ubiquitous Computing (EUC 2011) Mong Leng Sin, Mélanie Bouroche and Vinny Cahill. Scheduling of Dynamic Participants in Real-Time Distributed Systems. Proceedings of the 30th IEEE Symposium on Reliable Distributed Systems (SRDS 2011) Colm Bhandal, Mélanie Bouroche and Arthur Hughes. A Process Algebraic Description of a Temporal Wireless Network Protocol. Proceedings of 4th International Workshop on Formal Methods for Interactive Systems (FMIS 2011), June 2011 2010 Dan Marinescu, Jan Curn, Marco Slot, Mélanie Bouroche and Vinny Cahill. An Active Approach to Guaranteed Arrival Times Based on Traffic Shaping. Proceedings of the 13th International IEEE Conference on Intelligent Transportation Systems (ITSC 2010), Funchal, Portugal, Sept. 2010 Marco Slot, Mélanie Bouroche and Vinny Cahill. Membership Service Specifications for Safety-Critical Geocast in Vehicular Networks. Proceedings of the Seventh IEEE, IET International Symposium on Communication Systems, Networks and Digital Signal Processing (CSNDSP), Newcastle, United Kingdom, Jul. 2010, ISBN 978-1-86135-3 Dan Marinescu, Mélanie Bouroche and Vinny Cahill. Towards An Active Approach to Guaranteed Arrival Times Based on Traffic Shaping. International forum on Advanced Microsystems for Automotive Applications (AMAA), Berlin, Germany, pp. 367-376, Springer, May 2010, ISBN 978-3-642-126 2009 Aline Senart, Mélanie Bouroche, Vinny Cahill, and Stefan Weber. Vehicular Networks and Applications in Benoit Garbinato, Hugo Miranda and Luis Rodrigues, eds, \"Middleware for Network Eccentric and Mobile Applications\", chapter 17, Springer, 2009 2008 Mélanie Bouroche and Vinny Cahill. We don't need to agree to coordinate in Michael Mock ed, Workshop on Dependable Network Computing and Mobile Systems (DNCMS'08) at SRDS'08, Naples, Italy, pages 47-51, October 2008 Aline Senart, Mélanie Bouroche, and Vinny Cahill. Modelling an Emergency Vehicle Early-Warning System using Real-Time Feedback. International Journal of Intelligent Information and Database Systems (IJIIDS), Special issue on \"Information Processing in Intelligent Vehicles and Road Applications\", vol. 2 issue 2, pages 222-239, Inderscience Publishers, 2008 Vinny Cahill, Aline Senart,Douglas C. Schmidt, Stefan Weber, Anthony Harrington, Barbara Hughes, Kulpreet Singh and Mélanie Bouroche. The Managed Motorway: Real-time Vehicle Scheduling. Proceedings of the 9th ACM SIGMOBILE Workshop on Mobile Computing Systems and Applications (HotMobile'2008), Napa Valley, CA, USA, February 2008 2007 Mélanie Bouroche. Real-Time Coordination of \t\t\t\t\t\t\t\tMobile Autonomous Entities. Phd thesis, December 2007 2006 Aline Senart, Raymond Cunningham, Mélanie Bouroche, Neil O'Connor, Vinny Reynolds and Vinny Cahill. MoCoA: Customisable Middleware for Context-aware Mobile Applications. 8th International Symposium on Distributed Objects and Applications (DOA'2006), Montpellier, France, November 2006, Lecture Notes in Computer Science vol. 4276 Mélanie Bouroche, Barbara Hughes and Vinny Cahill. Real-time Coordination of Autonomous Vehicles. IEEE Conference on Intelligent Transportation Systems (ITSC'06), Toronto, Canada, September 2006 Aline Senart, Mélanie Bouroche, Neil O'Connor, Barbara Hughes, Kulpreet Singh and Vinny Cahill. Supporting Mobility using Context-Based Reasoning. System Support for Ubiquitous Computing Workshop (UbiSys), at UbiComp'2006, California, US, September 2006 Mélanie Bouroche and Vinny Cahill. Coordination of Autonomous Mobile Entities. 4th MiNEMA Workshop, Lisbon, Portugal, July 2006 Mélanie Bouroche, Barbara Hughes and Vinny Cahill. Building Reliable Mobile Applications with Space-Elastic Adaptation. In international workshop on Mobile Distributed Computing (MDC'06), in conjunction with WoWMoM'06, Niagara Falls, New York, USA, June 2006 Aline Senart, Mélanie Bouroche, Barbara Hughes and Vinny Cahill. Coordination of Safety-Critical Mobile Real-Time Embedded Systems. In Workshop on Research Directions for Security and Networking in Critical Real-Time and Embedded Systems (CRTES'06), in conjunction with RTAS 2006, San Jose, California, USA, April 2006 2005 Aline Senart, Mélanie Bouroche, Gregory Biegel and Vinny Cahill. A Component-based Middleware Architecture for Sentient Comput",
  "content_length": 10801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:44"
}