{
  "name": "N. Hari Narayanan",
  "homepage": "http://www.eng.auburn.edu/~naraynh",
  "status": "success",
  "content": "N. Hari Narayanan N. Hari Narayanan Professor, Department of Computer Science and Software Engineering Auburn University N. Hari Narayanan is John H. and Gail Watson Endowed Chair Professor and Chair of the Department of Computer Science and Software Engineering (CSSE) at Auburn University. His research interests span Learning Sciences & Technologies, Human-Computer Interaction, Artificial Intelligence and Cognitive Science. He has edited three books and authored over ninety refereed research publications. His work has been supported by the National Science Foundation, Institute for Education Sciences, Office of Naval Research, Gates Foundation, Hewlett Foundation, Electronics & Telecommunication Research Institute of South Korea, Open Society Foundation, and Auburn University, and recognized by Auburn University Engineering Faculty Research Excellence Awards in 2001 and 2005. He received the National Science Foundation Director's Award for Collaborative Integration in 2006. He has presented invited talks and tutorials at the US Naval Research Laboratory, Polish Academy of Sciences, Bulgaria, France, India, Japan and South Korea. He received the B.E. degree in Electrical and Electronic Engineering from the Birla Institute of Technology and Science, Pilani, India. He then attended the Indian Institute of Science and the University of Rochester, obtaining the degrees of M.E. (Automation) and M.S. (Computer Science). He earned his doctorate in Computer and Information Science from the Ohio State University, specializing in Artificial Intelligence and Cognitive Science. He worked at the Advanced Research Laboratory of Hitachi, the Knowledge Systems Laboratory of Stanford University, the EduTech Institute and the College of Computing at Georgia Institute of Technology prior to joining Auburn in 1996. Address: CSSE Dept., 3101 Shelby Center 345 W. Magnolia St. Auburn, AL 36849-5347, USA Tel: +1 334 844-6312 Dept. Office: +1 334 844-6300 Fax: +1 334 844-6329 Email: naraynh at-symbol auburn period edu",
  "content_length": 2028,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:45"
}