{
  "name": "Na Meng 0001",
  "homepage": "http://people.cs.vt.edu/nm8247",
  "status": "success",
  "content": "Home page of Na Meng Na Meng Associate Professor Computer Science Virginia Tech nm8247@vt.edu Gilbert Place, Room 4311A Na Meng is an Associate Professor in the Department of Computer Science at Virginia Tech since 2021. She received her B.E. in Software Engineering from Northeastern University (NEU) in China in 2006, and received her M.S. in Computer Science from Peking University in China in 2009. She obtained her Ph.D. in Computer Science from The University of Texas at Austin in 2014, advised by Miryung Kim and Kathryn S. McKinley. She started working in Virginia Tech as an Assistant Professor in 2015. Dr. Meng's research interests span Software Engineering, Programming Languages, Software Security, and Artificial Intelligence. She leads the NiSE (iNnovations in Software Engineering) research group, which conducts various empirical studies and develops novel automated approaches. The group's mission is to uncover new and intriguing phenomena in contemporary software practices, design innovative tools that advance software development as well as maintenance in the future, and create automated solutions that address real-world challenges--ultimately enhancing public well-being and improving human health. Dr. Meng received the NSF CAREER Award in 2019. Her research has been supported by NSF, ONR, CCI, and OpenAI. News 11/2025: Our paper on \"How Can ChatGPT Support Human Security Testers to Help Mitigate Supply Chain Attacks?\" got accepted by TSE! 08/2025: Our project on \"How Effectively Does ChatGPT Generate Security Tests to Mitigate Supply Chain Attacks?\" received OpenAI Cybersecurity Grant! 07/2025: Our paper on \"Detecting Outdated Screenshots from GUI Documents\" got accepted by TOSEM! 05/2025: Our paper on \"BlockSOP: A blockchain-based software management platform for open collaborative development\" got accepted by The Journal of Systems and Software! 05/2025: Our project on \"SmartHomeSecure: A GenAI-Powered Prototype for Detecting Defects and Vulnerabilities in Smart Home Automation Systems\" got funded by CCI! 04/2025: Our paper on \"An Exploratory Study on Build Issue Resolution Among Computer Science Students\" received the Distinguished Paper Award of CSEE&T 2025! 04/2025: Our proposal on \"Developing the NEH Digital Humanities Advancement Grant Proposal and Spencer Foundation Large Research Grant Proposal for Creativerse\" got funded by the Center for Educational Networks and Impacts (CENI) at Virginia Tech! 04/2025: Our Paper on \"Programming of Automation Configuration in Smart Home Systems: Challenges and Opportunities\" got accepted by TOSEM! 03/2025: Our paper on \"Simulating Personalized Smart-Home Activity Datasets with Generative AI: A Case Study\" has been accepted at ICPS 2025! 03/2025: Congratulations to Bowen Shen for successfully defending his PhD dissertation! 03/2025: Our project on \"PriHEOS: A Privacy-Preserving Home Energy Optimization System\" got funded by CCI! 02/2025: Our paper on \"A Comprehensive Indoor Environment Dataset from Single-family Houses in the US\" got accepted by the Data journal! 01/2025: We are organizing The First International Workshop on Large Language Model-Oriented Empirical Research. Please submit your awesome work on or before the deadline 02/25/2025! 01/2025: Our paper on \"Detecting Metadata-Related Bugs in Enterprise Applications\" got accepted by FSE 2025 12/2024: Our paper on \"An Exploratory Study on Build Issue Resolution Among Computer Science Students\" got accepted by CSEE&T 2025! 12/2024: Congratulations to Rishith Gandham for successfully defending his MS thesis! Current Students Md Mahir Asef Kabir (PhD student, Fall 2019 - ) mahir.kabir.prof@gmail.com Sheikh Shadab Towqir (PhD student, Spring 2020 - ) shadabtowqir@vt.edu Yeana Bond (PhD student, Spring 2025 - ) yeana@vt.edu Ye Cao (MS student, Spring 2025 - ) yecao@vt.edu Teaching CS6704: Software Engineering Research [Spring17][Spring19][Spring21][Fall24] CS5704: Software Engineering [Spring16][Spring18][Spring20][Spring24] CS3304: Comparative Languages [Fall16][Fall17][Fall18][Fall20] CS3704: Intermediate Software Design and Engineering [Fall15][Fall19][Spring22][Fall23][Fall24] Selected Research Topics Security coding practices[SecDev22][ICPC22][IEEE S&P'22][TSE22][SecDev20][TIFS19][ICSE19][ICSE18] Artificial intelligence and software engineering[IJCNN21][TDSC19][ICSME18a][ICSME17a] Automated program generation[ESEC/FSE21][ITiCSE21][IJCAI19] Automated program transformations [ASE20][ICPC19][MOBILESoft18][ICSE15][ICSE13][PLDI11] Software bugs and fixes[ASE22][TOSEM'22][SANER22][ICSE21][JSS19][ICSME18b][EMSE17][ICSME17b][ICPC17] Program comprehension[ICSE20][LCTES19][JSS18] Cyber-Physical Systems[JOBE'22][CRC22] Patent System to uncover root cause of non-deterministic (flaky) tests (Patent Number 9,311,220). Jungwoo Ha, Jaeheon Yi, Peter Dinges, Jeremy Manson, Caitlin Harrison Sadowski, Na Meng Software The implementations from nearly all of my publications are publicly available. Other researchers have used several of these implementations in their publications. See projects and GitHub for details. Funding Commonwealth Cyber Initiative (CCI)-PTGXR5RJ, CCI-P4TLGZ22, CCI-PMH7EUMV, CCI-PE6GLBAE, ONR N00014-22-1-2057, NSF-2006278 Graduated Students Publications Activities Cultures",
  "content_length": 5280,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:48"
}