{
  "name": "Na Zhao 0004",
  "homepage": "https://na-z.github.io",
  "status": "success",
  "content": "About me - Dr. Na Zhao Na ZHAOAssistant Professor, Singapore University of Technology and Design Follow Singapore Email LinkedIn Github Google ScholarI am currently a tenure-track Assistant Professor in the Information Systems Technology and Design (ISTD) Pillar at Singapore University of Technology and Design (SUTD). Prior to joining SUTD, I was a Research Fellow in Computer Vision and Robot Perception Lab, Department of Computer Science, National University of Singapore (NUS). I recieved my Ph.D. in Computer Science from NUS in March 2021, supervised by Professor Tat-Seng Chua.I am heading Intelligent Machine Perception Lab (IMPL) at SUTD, with a primary focus on, but not limited to: (1) Computer Vision: 3D computer vision, (3D) scene understanding, 3D reconstruction, 3D generation, 3D spatial intelligence. (2) Machine Learning: data-efficient learning, multi-modal learning, continual learning, out-of-distribution learning, robust learning. Open PositionsI am looking for PhD applicants with strong background in computer science, fully-supported by SUTD/AISG/industry scholarship.I am recruiting research fellow (holds a doctoral degree) with relevant research experience on computer vision.I am welcoming self-fund or CSC-fund visiting PhD/Master students and local MComp/BComp students with interests in the area of (3D) computer vision and machine learning.Please check here for more information, and feel free to reach out via email if you are interested in working with me. News [Nov 2025] Two papers about point cloud representation learning and radar-LiDAR scene flow estimation are accepted by AAAI 2026, for oral and poster presentations, respectively! [Oct 2025] I am invited to give a keynote talk at the workshop on Multimodal Foundation Models for Spatial Intelligence at ACM Multimedia 2025! [Oct 2025] I am invited serve as an Associate Editor for IEEE Transactions on Circuits and Systems for Video Technology (Impact Factor: 11.1)! [Sep 2025] One paper about 3D fine-grained embodied reasoning is accepted by NeurIPS 2025! [Sep 2025] I am invited to give a talk at NEXUS Japan–Singapore Joint Workshop 2025! [Aug 2025] I will serve as an Area Chair for ICLR 2026! [Jul 2025] One paper about assumptive reasoning in MLLMs is accepted by MM 2025! [Jun 2025] Four papers are accepted by ICCV 2025! [May 2025] One paper about multi-modal 3D panoptic segmentation is accepted by ICML 2025! [Apr 2025] One paper about multi-view clutering is accepted by IJCAI 2025! [Apr 2025] I will serve as an Area Chair for MM 2025! [Mar 2025] One paper about occluded human reconstruction is accepted by ICME 2025! [Feb 2025] Two papers about active 3D object detection and embodied multi-agent collaboration are accepted by CVPR 2025! [Feb 2025] One paper about 3D object detection for autonomous driving is accepted by IJCV 2025! [Feb 2025] I am invitated to serve as an Associate Editor for Knowledge-Based Systems (Impact Factor: 7.6)! [Feb 2025] One paper about semi-supervised medical domain generalization is accepted by TMM 2025! [Jan 2025] One paper about 3D reconstruction and editing is accepted by ICLR 2025! [Dec 2024] I will serve as an Area Chair for NLPCC 2025! [Dec 2024] One paper about 3D visual grounding is accepted by AAAI 2025! [Dec 2024] One paper about class-incremental 3D object detection is accepted by TIP 2024! [Nov 2024] I will serve as a senior PC for IJCAI 2025! [Nov 2024] I am awarded a grant titled \"Bridging Language and Physical Real-world for 3D Reasoning and Object Manipulation\" from TL@SUTD as the sole Principal Investigator! [Oct 2024] I am invited to serve as Demo Chair at ACM Multimedia 2025! [Oct 2024] One paper about open-set single-source domain generalization is accepted by TMM 2024! [Sep 2024] I am awarded a joint SMU-SUTD grant titled \"Synthesis and Resilience: Generative Models for Generalizable 3D World Understanding\" as the co-Principal Investigator! [Sep 2024] I will serve as an Area Chair for ICLR 2025! [Aug 2024] I am awarded a MoE Tier 2 grant titled \"Empowering Real-World 3D Scene Understanding: Navigating Noise, Distribution Shifts, and Incremental Learning\" as the sole Principal Investigator! [Aug 2024] I am appointed as a Technical Committee member for IEEE-CAS Multimedia Systems and Applications! [Jul 2024] Two papers about domain generalized 3D semantic segmentation and UDA for 3D object detection are accepted by BMVC 2024! [Jul 2024] Two papers about generalizable neural semantic fields and point cloud representation learning are accepted by MM 2024! [Jul 2024] Two papers about open-vocabulary 3D object detection and 3D Gaussain splatting editing are accepted by ECCV 2024! [Jan 2024] One paper about language-guided 3D affordance segmentation is accepted by CVPR 2024! [Jan 2024] One paper about semi-supervised 3D instance segmentation is accepted by ICRA 2024! [Dec 2023] I am awarded a grant titled \"MANTIS - Cross-modality Resiliency against Real-world Attacks\" from DSO as the sole Principal Investigator! [Dec 2023] Two papers about semi-supervised 3D object detection and robust visual recognition are accepted by AAAI 2024! [Oct 2023] One paper about self-supervised point cloud representation learning is accepted by 3DV 2024 as an oral paper! [Sep 2023] One paper about visual domain generalization is accepted by IJCV 2023! [Aug 2023] One paper about robust few-shot point cloud segmentation is accepted by BMVC 2023! [Aug 2023] I am awarded a grant titled \"Towards Realistic Deep Learning for 3D Vision\" from A*STAR as the co-Investigator! [Jul 2023] One paper about generalized few-shot point cloud segmentation is accepted by ICCV 2023! [Jun 2023] One paper about 6-DoF grasps synthesis is accepted by IROS 2023! [May 2023] One paper about monocular 3D object detection is accepted by TCSVT 2023! [Mar 2023] I am invited to serve as Demo Chair at Sixth IEEE International Conference on Multimedia Information Processing and Retrieval (MIPR 2023)! [Feb 2023] I am invited to join the Organising Committee of IEEE ICME 2023 Workshop on 3D Multimedia Analytics, Search and Generation! [Oct 2022] I am awarded a grant titled \"Multi-modal Joint Learning for Scene Understanding\" from SUTD-ZJU IDEA as the sole Principal Investigator! [Sep 2022] I am awarded a grant titled \"Data-efficient 3D Object Detection for Robot Perception\" from TL@SUTD as the sole Principal Investigator! [Aug 2022] I join the Singapore University of Technology and Design as an Assistant Professor! [Jul 2022] Three papers are accepted by ECCV 2022! [Dec 2021] One paper about class-incremental 3D object detection is accepted by AAAI 2022 as an oral paper! [Jun 2021] I am selected for the CVPR 2021 Doctoral Consortium. My mentor is Prof. Serge Belongie! [May 2021] I win the IMDA Excellent Prize (best thesis) for my PhD thesis! [Mar 2021] I successfully defended my PhD thesis \"Towards Learning Scene Semantics on 3D Point Clouds\"! [Mar 2021] One paper about few-shot 3D semantic segmentation is accepted by CVPR 2021! [Aug 2020] I recieve the Research Achievement Award from SoC! [Feb 2020] One paper about semi-supervised 3D object detection is accepted by CVPR 2020 as an oral paper! Selected PublicationsPlease visit my google scholar profile for the full publication list. * indicates corresponding author, and # indicates co-corresponding author RaLiFlow: Scene Flow Estimation with 4D Radar and LiDAR Point Clouds Jingyun Fu, Zhiyu Xiang#, Na Zhao# 40th AAAI Conference on Artificial Intelligence, 2026 [Paper (Coming soon)] [Code] Graph Smoothing for Enhanced Local Geometry Learning in Point Cloud Analysis Shangbo Yuan, Jie Xu, Ping Hu, Xiaofeng Zhu, Na Zhao 40th AAAI Conference on Artificial Intelligence, 2026 Oral Presentation [Paper (Coming soon)] AffordBot: 3D Fine-grained Embodied Reasoning via Multimodal Large Language Models Xinyi Wang, Xun Yang#, Yanlong Xu, Yuchen Wu, Zhen Li, Na Zhao# 39th Annual Conference on Neural Information Processing Systems (NeurIPS), 2025 [Preprint] [Code] MotionLab: Unified Human Motion Generation and Editing via the Motion-Condition-Motion Paradigm Ziyan Guo, Zeyu HU, De Wen Soh, Na Zhao* International Conference on Computer Vision (ICCV), 2025 [Project][Preprint] [Paper] [Code] H3R: Hybrid Multi-view Correspondence for Generalizable 3D Reconstruction Heng Jia, Linchao Zhu, Na Zhao International Conference on Computer Vision (ICCV), 2025 [Preprint] [Paper] [Code] Robust Multi-View Learning via Representation Fusion of Sample-Level Attention and Alignment of Simulated Perturbation Jie Xu, Na Zhao#, Gang Niu, Masashi Sugiyama, Xiaofeng Zhu# International Conference on Computer Vision (ICCV), 2025 [Preprint] [Paper] [Code] Geometric Alignment and Prior Modulation for View-Guided Point Cloud Completion on Unseen Categories Jingqiao Xiu, Yicong Li, Na Zhao, Han Fang, Xiang Wang, Angela Yao International Conference on Computer Vision (ICCV), 2025 [Paper] Look Before You Decide: Prompting Active Deduction of MLLMs for Assumptive Reasoning Yian Li, Wentao Tian, Yang Jiao, Tianwen Qian, Na Zhao, Bin Zhu, Jingjing Chen, Yu-Gang Jiang ACM Multimedia (MM), 2025 [Paper] How Do Images Align and Complement LiDAR? Towards a Harmonized Multi-modal 3D Panoptic Segmentation Yining Pan, Qiongjie Cui, Xulei Yang, Na Zhao* International Conference on Machine Learning (ICML), 2025 [Preprint] [Paper] [Code] OcSplats: Rendering Occluded Humans with Prior Knowledge Jie Zhang, Qiongjie Cui, Xulei Yang, Na Zhao* IEEE International Conference on Multimedia & Expo (ICME), 2025 [Paper (coming soon)] Uncertainty Meets Diversity: A Comprehensive Active Learning Framework for Indoor 3D Object Detection Jiangyi Wang, Na Zhao* IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Preprint] [Paper] [Code] Collaborative Tree Search for Enhancing Embodied Multi-Agent Collaboration Lizheng Zu, Lin Lin, Song Fu, Na Zhao, Pan Zhou IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper] CT3D++: Improving 3D Object D",
  "content_length": 18918,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:47"
}