{
  "name": "Nabanita Das 0001",
  "homepage": "https://www.isical.ac.in/~ndas",
  "status": "success",
  "content": "Prof. Nabanita Das Nabanita Das Professor Advanced Computing & Microelectronics Unit Indian Statistical Institute 203, B.T.Road, Kolkata, West Bengal, India Pin - 700108 Phone: +91-33-2575-3004 Fax: +91-33-2577-3035/ 6630 E-mail: ndas AT isical.ac.in Home Page Teaching & Research Professional Activities Publications Academic Qualification Ph.D Jadavpur University, 1992 M.E. Electronics & Telecomm. Engg, Jadavpur University, 1983 B.Tech. Radio Physics & Electronics, Calcutta University, 1979 B.Sc Physics Hons., Calcutta University, 1976 Senior Member, IEEE Research Area Mobile and Ad hoc Networks Wireless Sensor Networks Parallel & Distributed Computing Interconnection Networks Nabanita Das is a Professor in the Advanced Computing and Microelectronics Unit of Indian Statistical Institute, Kolkata, India, since 1986. Her area of interest includes Mobile Ad Hoc Networking, Pervasive Computing, Parallel and Distributed Computing and Multi-Core Computing. Dr. Das acted as the co-Editor of 'Distributed Computing- IWDC 2004' LNCS, Springer, Guest Editor of special issue on 'Resource Management in Mobile Communication Networks' of 'Microprocessors and Microsystems', 2004, Elsevier, Editor of 'Recent Trends in High Performance Computing', Proc. of International Workshop on High Performance Computing', 1998-99. She is a senior member of IEEE. She served as the Chair of Women in Engineering (WIE) affinity group of IEEE Calcutta section during 2009-2011. ReSearch Updates & Latest Publications D. Saha, S. Pal, N. Das, and B. B. Bhattacharya : Fast Estimation of Area-Coverage for Wireless Sensor Networks Based on Digital Geometry, IEEE Transactions on Multi-Scale Computing Systems, TMSCS, Vol: 3, No: 3, pp: 166-180, ISSN: 2332-7766, 2017 P. Chatterjee, S. C. Ghosh, N. Dass : Load Balanced Coverage with Graded Node Deployment in Wireless Sensor Networks, IEEE Transactions on Multi-Scale Computing Systems, Vol: 3 No. 2, pp: 100-112, ISSN: 2332-7766, 2017 D. Saha and N. Das : Self-Organized Area Coverage in Wireless SensorNetworks by Limited Node Mobility - Innovations in Systems and Software Engineering, pp. 1-12, issn. 1614-5054, Springer, 2016 D. Saha and N. Das, 'Self-Organized Node Placement for Area Coverage in Pervasive Computing Networks', In 3rd International Conference on Advanced Computing, Networking and Informatics, Smart Innovation, Systems and Technologies, Springer, 2015, Best Paper Awarded. P. Chatterjee, N. Das, 'Multiple sink deployement in multi-hop wireless sensor setworks to enhance lifetime', IEEE Sponsored International Conference on Applications and Innovations in Mobile Computing ( AIMoC 2015 ), IEEE Xplore, Kolkata, Feb, 2015 S. Kundu, N. Das, 'Event Boundary Detection and Gathering in Wireless Sensor Networks ', IEEE Sponsored International Conference on Applications and Innovations in Mobile Computing ( AIMoC 2015 ), IEEE Xplore, Kolkata, Feb, 2015 D. Saha, N. Das and B. B. Bhattacharya, 'Fast Estimation of Coverage Area in a Pervasive Computing Environment', 2nd International Conference on Advanced Computing, Networking, and Informatics( ICACNI ), Springer, June, 2014, Best Paper Awarded. D. Saha, N. Das, and S. Pal, 'A digital-geometric approach for computing area coverage in wireless sensor networks'. Proceedings in 10th International Conference on Distributed Computing and Internet Technologies ( ICDCIT ), LNCS-Springer, 2014. Useful Links DBLP : http://dblp.uni-trier.de/Nabanita.Das ResearchGate: http://www.researchgate.net/ Social Network Facebook : https://www.facebook.com/Nabanita.Das ISI ACMU Divisions & Units © ACMU 2015 All rights reserved.",
  "content_length": 3629,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:48"
}