{
  "name": "Nadav Cohen",
  "homepage": "http://www.cohennadav.com",
  "status": "success",
  "content": "Nadav Cohen Nadav Cohen Home Biography Publications Research Group Selected Talks Blog Posts Teaching Patents Media Nadav Cohen Assoc. Professor of Computer Science & AI @ Tel Aviv University CTO, President & Co-Founder @ Imubit E-mail: cohennadav (at) tauex.tau.ac.il Research My research focuses on the theoretical and algorithmic foundations of neural networks (a.k.a. deep learning). I am interested in mathematically analyzing aspects of expressiveness, optimization and generalization, with the goal of deriving theoretically founded procedures and algorithms that improve practical performance. News 18-Sep’25: Two papers from my group accepted to NeurIPS 2025, one of them in Spotlight Track (top 3%). 8-Dec’24: Promoted to Assoc. Professor (with tenure). 6-Oct’24: Congratulations to Noam Razin for receiving the Israel Council for Higher Education Fellowship for Outstanding Postdoctoral Scholars. 1-Oct’24: Congratulations to Noam Razin for receiving the Zuckerman Postdoctoral Fellowship. 5-Sep’24: Honored to receive the ERC Starting Grant. 1-Sep’24: Congratulations to Noam Razin for joining Princeton Language and Intelligence Center as a Postdoctoral Fellow. 25-Aug’24: Released lecture notes on the theory (and surprising practical applications) of linear neural networks. 5-Jun’23: Hosted OpenAI CEO and Chief Scientist at Tel Aviv University. 30-Mar’23: Congratulations to Noam Razin for receiving the Deutch PhD prize. 16-Mar’22: Congratulations to Noam Razin for receiving the Apple AI/ML PhD fellowship. 3-Oct’21: Congratulations to Noam Razin for receiving the Tel Aviv University Center for AI & Data Science PhD fellowship. 16-Aug’21: Imubit is out of stealth. 11-Mar’21: Honored to receive the Google Research Scholar Award. 1-Dec’20: Honored to be elected as ELLIS Scholar. 4-Nov’20: Honored to receive the Google Gift for Machine Learning Research. 1-Jul’19: Joined the School of Computer Science at Tel Aviv University. 14-May’18: Honored to receive the Hebrew University's Hans Wiener Prize for outstanding doctoral thesis. 7-Nov’17: Honored to be part of TheMarker Magazine's 40 Under 40 list (for academic achievements). 25-Sep’17: Joined the Institute for Advanced Study in Princeton. 04-Jul’17: Honored to receive the Final Prize for Machine Learning Research. 05-Jun’17: Honored to receive the Zuckerman Postdoctoral Fellowship. 24-Jan’17: Honored to receive the Rothschild Postdoctoral Fellowship. 28-Aug’15: Honored to receive the Google Doctoral Fellowship in Machine Learning. Page generated 2025-09-20 09:12:52 Eastern Daylight Time, by jemdoc. (source)",
  "content_length": 2593,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:49"
}