{
  "name": "Nadia El-Mabrouk",
  "homepage": "http://www.iro.umontreal.ca/~mabrouk",
  "status": "success",
  "content": "Nadia El-Mabrouk - DIRO - Université de Montréal Nadia El-Mabrouk Département d'informatique et de recherche opérationnelle (DIRO) English Page principale Publications Recherche Laboratoire Enseignement Logiciels Contact Nadia El-Mabrouk Département d'informatique et de recherche opérationnelle Université de Montréal Pavillon André-Aisenstadt CP 6128 succ Centre-Ville Montréal, Québec H3C 3J7 Canada Bureau: 3163 Pav. André Aisenstadt Tel.: 514-343-7481 mabrouk AT iro.umontreal.ca SPIRE 2024: Simultaneously Building and Reconciling a Synteny Tree Mathieu Gascon, Matttéo Delabre and Nadia El-Mabrouk, Implementation of FullSynesth is available here. IWOCA 2021: Complexity and Algorithms for MUL-Tree Pruning, Mathieu Gascon, Riccardo Dondi and Nadia El-Mabrouk, Implementation of the MULPR Algorithm is available here. Recracking the Genetic Code, Casey McGrath, Genome Biology and Evolution, Vol. 11, Issue 10, pp 2990-2991, 2019. Highlight on Rapid Genetic Code Evolution in Green Algal Mitochondrial Genomes, E. Noutahi, V. Calderon, M. Blanchette, N. El-Mabrouk and B.F. Lang, Molecular Biology and Evolution, Vol. 36, Num. 4, pp 766-783, 2019. Nadia El-Mabrouk est professeure titulaire au département d'informatique de l'université de Montréal. Elle detient un Ph.D. en Informatique théorique de l'universite Paris VII, obtenu en 1996. Elle est membre du Centre de Recherche Mathematiques et du Centre Robert Cedergren . Son domaine de recherche est la biologie computationnelle. Ses projets de recherche principaux sont reliés au developpement de méthodes algorithmiques et mathematiques pour la génomique comparative. Elle œuvre regulièrement dans les comité de programme des conférences de Bio-informatiques telles que RECOMB, RECOMB-CG, ISMB, ECCB et WABI. Enseignement IFT3295/IFT6291/BIN6000 -->",
  "content_length": 1813,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:52"
}