{
  "name": "Nadine Abu Rumman",
  "homepage": "https://www.brunel.ac.uk/people/nadine-aburumman",
  "status": "success",
  "content": "Dr Nadine Aburumman | Introduction | Brunel University London Skip to Content Home People Dr Nadine Aburumman LinkedIn Twitter YouTube Dr Nadine AburummanAssociate Dean EDI/Lecturer in Computer Science Graphics and Extended Reality Team (GERT) Centre for AI: Social and Digital Innovation Presonal Webpage Google Scholar Computer Science College of Engineering, Design and Physical Sciences Summary Nadine researches real-time computer graphics and leads the Graphics and Extended Reality Team (GERT). She is a member of the Centre for AI: Social and Digital Innovation, where she co-coordinated the AI Centre Thought Leadership series (TLS) for two years (2023 and 2024). She is also a member of the Interactive Multimedia System (IMS) research group. Before joining Brunel, Nadine was a research associate at the Institute of Cognitive Neuroscience (ICN) at University College London (UCL). Prior to that, she was a postdoctoral researcher at the Computer Science Research Institute of Toulouse (IRIT) funded by Centre International de Mathématiques et Informatique de Toulouse (CIMI) after a successful grant acquisition (fellowship) for 2 years (€ 100K). Before that, she was a postdoctoral researcher at the Friedrich-Alexander University Erlangen-Nürnberg, in the Institute for Multiscale Simulation (MSS). She completed her PhD studies in the ALCOR Lab at Sapienza University of Rome after being awarded a PhD Erasmus Mundus Scholarship. Qualifications BSc in computer science, MSc in computer science (computer graphics, vision and imaging), PhD in computer science (digital human and shape simulation), and FHEA (PgCAP in academic practice). Nadine is a Professional Member of the British Computer Society (BCS) Nadine's work; research, teaching, and admin activities contribute towards the following Sustainable Development Goals (SDGs): Awards: 2024: Runner-Up: Lecturer of the Year (Student Led Award-University Level) 2023: The Recognition of Excellence (RoE) Award 2022: Brunel Research Initiative And Enterprise Fund (BRIEF) Award 2016 -2018: CIMI Post-doctoral Fellowships (two years salary costs and €10,000 for research costs) 2014: Best paper and best presentation awards at the 30th SCCG conference 2012: Three-year scholarship awarded from EU Erasmus Mundus to support my PhD studies Programme Committee (PC) member & Editorial Roles: ACM International Conference on Intelligent Virtual Agents (IVA) Computer Graphics International (CGI) International Conference on Computer Animation and Social Agents (CASA) Review Editor, Virtual Reality and Human Behaviour, Frontiers in Virtual Reality Peer-review for funding agencies: Dutch Research Council (NWO) Engineering & Physical Sciences Research Council (EPSRC) Responsibility - Member of Senate - University Level, - Deputy Admissions Tutor for Undergraduate Level, - Departmental Athena SWAN - Outreach Lead (Some of our outreach activities are listed here, and some resources related to these activities can be found here), - The CS communication coordinator with Code First Girls (CFG), - Made In Brunel - logistics and planning, - In2STEM Programme Co-Host and Facilitator 2024 - Co-lead the AI Centre Thought Leadership series (TLS) – (from 2023 - to 2024) AI Thought Leadership Seminars for Winter/Spring 2024 AI Thought Leadership Seminars for Winter/Spring 2023 Newest selected publications Serino, G., Heraty, S., Dalvit-Menabe, S., Powell, S., Everdell, N., Aburumman, N., Charman, T., Viding, E., Hamilton, A., Pinti, P. and Bulgarelli, C. et al. (2025) 'Tailoring and Validating DOT-Virtual Reality Methods for Use with Neurodiverse Children'. [Poster] Exhibited at. fNIRS UK 2025 19 9 2025 Poster Counsell, S., Destefanis, G., Neykova, R., Miron, A., Aburumman, N. and Shippey, T. (2025) 'There's Nothing to See Here: A Study of Deaf and Hearing Developer Use of Stack Overflow'.IEEE/ACM 47th International Conference on Software Engineering: Software Engineering in Society (ICSE-SEIS). Ottawa, ON, Canada. 27 - 3 May. IEEE. pp. 55 - 58. ISSN: 0270-5257 Conference paper Koutzampasopoulou Xanthidou, R., Aburumman, N. and Ben Abdallah, H. (2024) 'The Impact of Collaborative Virtual Environments on Student’s Performance while Learning'.The 2024 IEEE International Conference on Metrology for eXtended Reality, Artificial Intelligence and Neural Engineering - IEEE MetroXRAINE 2024. St Albans, UK. 21 - 23 October. IEEE. pp. 231 - 236.Open Access Link Conference paper Zhou, M. and Aburumman, N. (2024) 'Grasping Objects in Immersive Virtual Reality Environments: Challenges and Current Techniques'.10th IEEE International Conference on Virtual Reality 2024. Bournemouth, UK. 24 - 26 July. IEEE. pp. 190 - 197. ISSN: 2331-9542 Open Access Link Conference paper K. Xanthidou, O., Aburumman, N. and Ben-Abdallah, H. (2024) 'Investigating Trainee Perspectives on Virtual Reality Environments: An In-Depth Examination of Immersive Experiences with Haptic Feedback Vibration'.The 18th IEEE Annual International Systems Conference 2024. Montreal, QC, Canada. 15 - 18 April. IEEE. pp. 1 - 8. ISSN: 1944-7620 Open Access Link Conference paper More publications(22)",
  "content_length": 5142,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:56"
}