{
  "name": "Nadine Marcus",
  "homepage": "https://research.unsw.edu.au/people/dr-nadine-marcus",
  "status": "success",
  "content": "Associate Professor Nadine Marcus | UNSW Research Skip to main content Researcher Fields of Research (FoR) Educational Technology and Computing, Educational Psychology, Cognitive Science, Computer-Human Interaction SEO tags Education and Training Learner and Learning Processes Biography Dr Nadine Marcus, Associate Professor, Computer Science & Engineering Her research interests include: Educational technology Human Computer Interaction Adaptive E-learning Multimedia Instructional Design Cognitive Load Theory Instructional Animations Modelling of Human Cognition Human Robot Interaction/interfaces Broad research interests Level 1: I develop online learning strategies to improve student learning Level 2: I design, develop and...view more Dr Nadine Marcus, Associate Professor, Computer Science & Engineering Her research interests include: Educational technology Human Computer Interaction Adaptive E-learning Multimedia Instructional Design Cognitive Load Theory Instructional Animations Modelling of Human Cognition Human Robot Interaction/interfaces Broad research interests Level 1: I develop online learning strategies to improve student learning Level 2: I design, develop and test multimedia based strategies to support online learning Level 3: Using Cognitive Load Theory as a theoretical based I use empirical research methods to develop strategies to facilitate online learning Interest in engineering Why did you get into engineering? I am interested in the design of software that people can actually use.  Too much focus in Engineering is often on the functionality of systems, rather than their usability.  In software design both are equally important. What are your research goals? To design online learning systems that people can use and actually learn from. What do people not understand about you do? I have a cross disciplinary background and can often contribute a unique perspective to different projects – I understand both the technology and the people. Advice for prospective Computer engineers It is not enough to just design software with good functionality.  It also needs to be enjoyable and easy to use. Lectures/Courses taught I have been teaching Human Computer Interaction since 2001 – includes COMP3511;COMP9511;COMP4511 Students Number graduated: 30+ Student Projects: Most projects relate to using cognitive load theory to improve online learning and/or using Smartsparrow’s Adaptive eLearning platform to facilitate student learning outcomes. Project titles: Linking computers to human minds; Using instructional animations to improve learning; Adaptive eLearning; Using gesture to improve learning; Writing versus typing and the effects on learning; Effects of seeing hands on learning human motor tasks; Looking for students for projects related to: Cognitive Load theory and its applications to online learning Current Grants SEF L&T grant – Virtual Field trips AOARD grant - Autonomous Adaptation and Trust Smartsparrow PhD project – Pedagogical evaluation of the AeLP Education PhD/postgraduate B.Sc. Honours, Experimental Psychology, University of the Witwatersrand, South Africa, 1988. Ph.D. Education, University of NSW, 1998. Undergraduate B.Sc. Computer Science & Psychology, University of Cape Town, South Africa,1987. My Research SupervisionSupervision keywords human computer interaction educational technology Areas of supervision Adaptive eLearning: Trust and Cognitive Load; Transient information effects within a Cognitive Load perspective; Related Human Computer Interaction projects; Online learning View less Location Engineering Building K17, level 4, room 401B, Kensington Campus Contact +61 2 9385 5173 55995 Follow My Google Scholar Publications by Associate Professor Nadine Marcus Book Chapters 7 Journal articles 26 Conference Papers 35 Conference Presentations 15 Conference Abstracts 4 Reports 2 Preprints 2 View all » ORCID as entered in ROS https://orcid.org/0000-0002-4996-4850 Related Links Smartsparrow startup UNSW Sydney NSW 2052 Australia Telephone +61 2 93851000 Authorised by Deputy Vice-Chancellor (Research) UNSW CRICOS Provider Code: 00098G ABN: 57 195 873 179 Join the conversation Facebook Twitter UNSW Youtube LinkedIn Pinterest Instagram Member Group of Eight Member Universitas 21 Member Global Alliance of Technological Universities Member Association of Pacific Rim Universities MemberPLuS Alliance Home 2025 Strategic Initiatives SHARP UNSW Futures Interdisciplinary Research World Class Research Infrastructure Grand Challenges Thought Leadership & Public Engagement Knowledge Exchange ARTU - Aggregate Ranking of Top Universities Contact Us Deputy Vice-Chancellor (Research & Enterprise) Pro Vice-Chancellor (Research) Graduate Research Scholarships Applying for a Scholarship External Scholarships How to apply Higher Degree Research Programs Submitting an Application Finding a Supervisor Fees and Costs FAQs Thesis Thesis Preparation Examination Graduation Help and Advice Arc UNSW – Postgraduate Council Arc UNSW – Student Life Financial Support New to UNSW Research Events & Workshops Study with Us Research Training Extend Your Career Networks New to UNSW Research Research Career Opportunities Research Impact UNSW Areas of Research Strength Biomedical Sciences Contemporary Humanities and Creative Arts Defence and Security Fundamental and Enabling Sciences ICT, Robotics and Devices Law, Business and Economics Next Generation Materials and Technologies Social Policy, Government and Health Policy Water, Climate, Environment and Sustainability Fellows of Learned Academies Research News & Stories Research Integrity Research Ethics & Compliance Support Research Integrity for Staff Supervisors and Research Integrity Research Ethics and Compliance Support Animal Research Ethics Human Research Ethics Radiation Safety Research Export Controls Research Strategy Office About the RSO Partner with us Contact Us Partner With Us Services for Researchers Research Grants and Contracts (RGC) About Us Current Funding Opportunities Resources and Quicklinks Systems Research Infrastructure Analytical Centre (MWAC) Contacts & About Us Data Management, Storage and Tools Network Labs Shared Research Equipment UNSW Research Infrastructure Scheme Partner With Us Pricing Tool Researcher Hub (UNSW login) Current Funding Opportunities Research News UNSW Centres and Institutes Find a Researcher FAQ: Researcher Profiles - Tags & Codes",
  "content_length": 6430,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:57"
}