{
  "name": "Nadim W. Alkharouf",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/nalkharouf.html",
  "status": "success",
  "content": "Nadim Alkharouf | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Nadim Alkharouf Contact Info Phone: 410-704-3149 Office: SC 5101A Email: nalkharouf@towson.edu https://www.linkedin.com/pub/nadim-alkharouf/b/550/94b https://wp.towson.edu/nalkharo/ Education Ph.D. Computational Sciences and Informatics, George Mason University, VA. May 2004 \t\t\tM.S. Biological Sciences, Yarmouk University, Irbid, Jordan. August 1998 \t\t\tB.Sc. Biological Sciences, Yarmouk University, Irbid, Jordan. June 1996 Areas of Expertise Bioinformatics, Analysis of high throughout experiments (next generation sequencing, Illumina and 454), Database design and development, Data mining, Web development. Scholarly Papers | Synopsis:  Google Scholar Profile Selected Publications and Presentations, 2013 â present: Li S, Darwish O, Alkharouf N, Matthews B, Ji P, Domier L, Zhang N, Bluhm B. Draft genome sequence of Phomopsis longicolla isolate MSPL 10-6.Genomics Data, Volume 3, March 2015, Pages 55-56. Darwish O, Shahan R, Liu Z, Slovin JP, Alkharouf NW. Re-annotation of the woodland strawberry (Fragaria vesca) genome. BMC Genomics. 2015 Jan 27;16:29. doi: 10.1186/s12864-015-1221-1. PubMed PMID: 25623424; PubMed Central PMCID:PMC4318131. Tavakolan M, Alkharouf NW, Matthews BF, Natarajan SS. SoyProLow: A protein database enriched in low abundant soybean proteins. Bioinformation. 2014 Sep 30;10(9):599-601. doi: 10.6026/97320630010599. eCollection 2014. PubMed PMID: 25352730; PubMed Central PMCID: PMC4209371. Natarajan S, Tavakolan M, Alkharouf NW, Matthews BF. SCNProDB: A database for the identification of soybean cyst nematode proteins. Bioinformation. 2014 Jun 30;10(6):387-9. doi: 10.6026/97320630010387. eCollection 2014. PubMed PMID:25097385; PubMed Central PMCID: PMC4110433. Hollender CA, Kang C, Darwish O, Geretz A, Matthews BF, Slovin J, Alkharouf N, Liu Z. Floral Transcriptomes in Woodland Strawberry Uncover Developing Receptacle and Anther Gene Networks. Plant Physiol. 2014 May 14;165(3):1062-1075. [Epub ahead of print] PubMed PMID: 24828307; PubMed Central PMCID: PMC4081322. Darwish O, Slovin JP, Kang C, Hollender CA, Geretz A, Houston S, Liu Z, Alkharouf NW. SGR: an online genomic resource for the woodland strawberry. BMC Plant Biol. 2013 Dec 23;13:223. doi: 10.1186/1471-2229-13-223. PubMed PMID: 24364888; PubMed Central PMCID: PMC3878773. Darwish O, Rowland LJ, Alkharouf NW. BBGD454: A database for transcriptome analysis of blueberry using 454 sequences. Bioinformation. 2013 Oct 16;9(17):883-6. doi: 10.6026/97320630009883. eCollection 2013. PubMed PMID: 24250117; PubMed Central PMCID: PMC3819576. Tremblay A, Hosseini P, Li S, Alkharouf NW, Matthews BF. Analysis of Phakopsora pachyrhizi transcript abundance in critical pathways at four time-points during infection of a susceptible soybean cultivar using deep sequencing. BMC Genomics. 2013 Sep 11;14:614. doi: 10.1186/1471-2164-14-614. PubMed PMID: 24025037; PubMed Central PMCID: PMC3847679. Kang C, Darwish O, Geretz A, Shahan R, Alkharouf N, Liu Z. Genome-scale transcriptomic insights into early-stage fruit development in woodland strawberry Fragaria vesca. Plant Cell. 2013 Jun;25(6):1960-78. doi: 10.1105/tpc.113.111732. Epub 2013 Jun 28. PubMed PMID: 23898027; PubMed Central PMCID: PMC3723606. Tavakolan M, Alkharouf NW, Khan FH, Natarajan S. SoyProDB: A database for the identification of soybean seed proteins. Bioinformation. 2013;9(3):165-7. doi: 10.6026/97320630009165. Epub 2013 Feb 6. PubMed PMID: 23423175; PubMed Central PMCID: PMC3569605. Research: Dr. Alkharoufâs area of research is computational biology\\Bioinformatics. His lab works on the design and development of databases for high throughput biological experiments. His lab also works on the analysis of data from genome sequencing projects, gene expression and proteomics experiments. Dr. Alkharouf is also very interested in data mining and web development. Example projects in his lab include building a database and analyzing gene expression data (Microarry and RNA-Seq) from experiments on soybean, dealing with the identification of resistance genes in soybean against devastating parasites and fungal infections. And working with strawberry genomic data (Illumina RNA-Seq) to elucidate the molecular function of flower and fruit development in strawberry. His lab has also assembled and re-annotated a number of genomes, the most recent was the complete re-annotation of the strawberry genome. Service: Member of the FSCM Undergraduate Research Committee (2006 â present) Member of the FSCM STEM committee (2013-present) Member of the MB3 Committee (2006 â present) Member of the CS Curriculum Committee (2012 â present) Member of the FCSM College Council Executive Committee (recording secretary) (2012-2013) Member of the FCSM College Council (2010-2013) Member of the CS Graduate Committee (2009 â 2014) Member of a number of Faculty Hiring Committees in MB3 and AIT Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 8084,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:54"
}