{
  "name": "Nafise Sadat Moosavi",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/nafise-sadat-moosavi",
  "status": "success",
  "content": "Dr Nafise Sadat Moosavi | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Nafise Sadat Moosavi School of Computer Science Lecturer in Natural Language Processing Member of the Natural Language Processing research group Deputy School Head of ED&I Open staff member portrait in a modal window N.S.Moosavi@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Nafise Sadat Moosavi School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-8332-307X Google Scholar Profile Dr. Nafise Sadat Moosavi is a Lecturer in Natural Language Processing at the Computer Science Department of the University of Sheffield. Before joining the University of Sheffield, she was a postdoctoral researcher at the UKP Lab at the Technical University of Darmstadt. Before that, she got her PhD degree from Heidelberg University. She received her bachelor's and master's degrees in computer science from Alzahra University and the Sharif University of Technology in Tehran, Iran. Research interests She is interested in various areas of Natural Language Processing and Machine Learning including end-to-end reasoning, robustness and generalization, coreference resolution, text generation, sustainability, and reliable evaluation. Publications Show: Featured publications All publications Featured publications This person does not have any publications available. All publications Journal articles Elghazaly H, Mirheidari B, Moosavi NS & Christensen H (2025) Exploring Gender Disparities in Automatic Speech Recognition Technology.. CoRR, abs/2502.18434. Paun S, Yu J, Moosavi NS & Poesio M (2023) Scoring coreference chains with split-antecedent anaphors. Dialogue & Discourse, 14(2), 1-48. View this article in WRRO Dhole K, Gangal V, Gehrmann S, Gupta A, Li Z, Mahamood S, Mahadiran A, Mille S, Shrivastava A, Tan S , Tongshang Wu et al () NL-Augmenter . Northern European Journal of Language Technology, 9(1). Conference proceedings Sivakumar JA & Moosavi NS (2025) How to leverage digit embeddings to represent numbers?. Proceedings of the 31st International Conference on Computational Linguistics (pp 7685-7697). Abu Dhabi, United Arab Emirates, 19 January 2025 - 19 January 2025. View this article in WRRO Mi M, Villavicencio A & Moosavi NS (2025) Rolling the DICE on Idiomaticity: How LLMs Fail to Grasp Context. Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers) (pp 7314-7332), July 2025 - July 2025. Shafiei M, Saffari H & Moosavi NS (2025) MultiHoax: A Dataset of Multi-hop False-premise questions. Findings of the Association for Computational Linguistics: ACL 2025 (pp 10169-10187), July 2025 - July 2025. ElGhazaly H, Mirheidari B, Christensen H & Moosavi NS (2025) Fairness in Automatic Speech Recognition Isn’t a One-Size-Fits-All. Findings of the Association for Computational Linguistics: EMNLP 2025 (pp 19169-19178), November 2025 - November 2025. Jiang G, Wang Y, Li Y, Moosavi NS & Hui P (2024) Blending Social Interaction Realms: Harmonizing Online and Offline Interactions through Augmented Reality. Proceedings of the 17th International Symposium on Visual Information Communication and Interaction (pp 1-8) Delbari Z, Moosavi NS & Pilehvar MT (2024) Spanning the spectrum of hatred detection: a Persian multi-label hate speech dataset with annotator rationales. Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 38(16) (pp 17889-17897). Vancouver, Canada, 20 February 2024 - 20 February 2024. View this article in WRRO Poesio M, Ogrodniczuk M, Ng V, Pradhan S, Yu J, Moosavi NS, Paun S, Zeldes A, Nedoluzhko A, Novák M , Popel M et al (2024) Universal Anaphora: The First Three Years. 2024 Joint International Conference on Computational Linguistics Language Resources and Evaluation Lrec Coling 2024 Main Conference Proceedings (pp 17087-17100) Liu Y, Moosavi NS & Lin C (2024) LLMs as narcissistic evaluators: when ego inflates evaluation scores. Findings of the Association for Computational Linguistics: ACL 2024 (pp 12688-12701). Bangkok, Thailand, 11 August 2024 - 11 August 2024. View this article in WRRO Jan-Christoph K, Lee J-U, Stowe K, Şahin G, Moosavi NS, Bates L, Petrak D, Eckart De Castilho R & Gurevych I (2023) Lessons learned from a Citizen Science project for Natural Language Processing. Proceedings of the 17th Conference of the European Chapter of the Association for Computational Linguistics (pp 3594-3608). Dubrovnik, Croatia, 2 May 2023 - 2 May 2023. View this article in WRRO Fang H, Lee J-U, Moosavi NS & Gurevych I (2023) Transformers with learnable activation functions. Findings of the Association for Computational Linguistics: EACL 2023 (pp 2382-2398). Dubrovnik, Croatia, 2 May 2023 - 2 May 2023. View this article in WRRO Sivakumar J & Moosavi NS (2023) FERMAT: an alternative to accuracy for numerical reasoning. Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), Vol. 1 (pp 15026-15043). Toronto, Canada, 9 July 2023 - 9 July 2023. View this article in WRRO Petrak D, Moosavi NS & Gurevych I (2023) Arithmetic-based pretraining improving numeracy of pretrained language models. Proceedings of the 12th Joint Conference on Lexical and Computational Semantics (*SEM 2023), Vol. *SEM 2023 (pp 477-493). Toronto, Canada, 13 July 2023 - 13 July 2023. View this article in WRRO Klie JC, Lee JU, Stowe K, Şahin GG, Moosavi NS, Bates L, Petrak D, de Castilho RE & Gurevych I (2023) Lessons Learned from a Citizen Science Project for Natural Language Processing. Eacl 2023 17th Conference of the European Chapter of the Association for Computational Linguistics Proceedings of the Conference (pp 3576-3590) Fang H, Lee JU, Moosavi NS & Gurevych I (2023) Transformers with Learnable Activation Functions. Eacl 2023 17th Conference of the European Chapter of the Association for Computational Linguistics Findings of Eacl 2023 (pp 2337-2353) Petrak D, Moosavi N, Tian Y, Rozanov N & Gurevych I (2023) Learning From Free-Text Human Feedback – Collect New Datasets Or Extend Existing Ones?. Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing (pp 16259-16279), December 2023 - December 2023. Vu DNL, Moosavi NS & Eger S (2022) Layer or representation space: what makes BERT-based evaluation metrics robust?. Proceedings of the 29th International Conference on Computational Linguistics, Vol. 29(1) (pp 3401-3411). Gyeongju, Republic of Korea, 12 October 2022 - 12 October 2022. View this article in WRRO Utama PA, Bambrick J, Moosavi NS & Gurevych I (2022) Falsesum : generating document-level NLI examples for recognizing factual inconsistency in summarization. Proceedings of the 2022 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (pp 2763-2776). Seattle, WA, USA, 10 July 2022 - 10 July 2022. View this article in WRRO Moosavi NS, Delfosse Q, Kersting K & Gurevych I (2022) Adaptable adapters. Proceedings of the 2022 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (pp 3742-3753). Seattle, WA, USA, 10 July 2022 - 10 July 2022. View this article in WRRO Yu J, Khosla S, Moosavi NS, Paun S, Pradhan S & Poesio M (2022) The Universal Anaphora Scorer. Proceedings of the Thirteenth Language Resources and Evaluation Conference, LREC 2022 (pp 4873-4883). Marseille, France, 20 June 2022 - 20 June 2022. View this article in WRRO Moosavi N, Rücklé A, Roth D & Gurevych I (2021) SciGen : a dataset for reasoning-aware text generation from scientific tables. Proceedings of the Neural Information Processing Systems Track on Datasets and Benchmarks 1 (NeurIPS Datasets and Benchmarks 2021), 6 December 2021 - 6 December 2021. View this article in WRRO Utama PA, Moosavi NS, Sanh V & Gurevych I (2021) Avoiding inference heuristics in few-shot prompt-based finetuning. Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing (pp 9063-9074). Punta Cana, Dominican Republic (Online), 7 November 2021 - 7 November 2021. View this article in WRRO Wu M, Moosavi NS, Roth D & Gurevych I (2021) Coreference reasoning in machine reading comprehension. Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing, Vol. 1 (pp 5768-5781). Bangkok, Thailand (Online), 1 August 2021 - 1 August 2021. View this article in WRRO Yu J, Moosavi NS, Paun S & Poesio M (2021) Stay together: a system for single and split-antecedent anaphora resolution. Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (pp 4174-4184). Online, 6 June 2021 - 6 June 2021. View this article in WRRO Yu J, Moosavi NS, Paun S & Poesio M (2020) Free the plural: unrestricted split-antecedent anaphora resolution. Proceedings of the 28th International Conference on Computational Linguistics (pp 6113-6125). Barcelona, Spain (Online), 8 December 2020 - 8 December 2020. View this article in WRRO Wu M, Moosavi NS, Rücklé A & Gurevych I (2020) Improving QA generalization by concurrent modeling of multiple biases. Findings of the Association for Computational Linguistics: EMNLP 2020 (pp 839-853). Online, 16 November 2020 - 16 November 2020. View this article in WRRO Utama PA, Moosavi NS & Gurevych I (2020) Towards debiasing NLU models from unknown biases. Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP 2020) (pp 7597-7610). Online, 16 November 2020 - 16 November 2020. View this article in WRRO Utama PA, Moosavi NS & Gurevych I (2020) Mind the trade-off: debiasing NLU models without degrading the in-distribution performance. Proceedings of the 58th Annual",
  "content_length": 17482,
  "method": "requests",
  "crawl_time": "2025-12-01 14:02:59"
}