{
  "name": "Najoung Kim",
  "homepage": "https://najoung.kim",
  "status": "success",
  "content": "Home | Najoung Kim I’m an Assistant Professor at the Department of Linguistics and an Affiliated Faculty at the Department of Computer Science at Boston University. I was a Visiting Faculty Researcher at Google DeepMind until very recently. Before that, I was a Faculty Fellow at the Center for Data Science at New York University and a PhD student in the Department of Cognitive Science at Johns Hopkins University, advised by Dr. Paul Smolensky and Dr. Kyle Rawlins. My interests, broadly, are meaning and generalization in human and machine learners. I use computational and experimental linguistic methodologies to explore these areas. Please refer to the Publications section to find out more. I’m recruiting: please take a look at the “For students” section if you’re interested in working with me! Updates Where you can catch me in the near future: I will be attending NeurIPS (Nov) Invited talk at Yale Linguistics Colliquium Series (Jan) Invited talk at Cognitive Basis of Reasoning (in Minds and AI) Workshop, IVADO (Feb) Nov 2025: I gave a plenary address at the Society for Language Development titled “Whence insights? The value of delineating human and machine CogSci”. Slides here Sep 2025: Vision-and-Language Training Helps Deploy Taxonomic Knowledge but Does Not Fundamentally Alter It was accepted to NeurIPS! (work with Yulu Qin, Dheeraj Varghese, Adam Dahlgren Lindström, Lucia Donatelli, & Kanishka Misra) Sep 2025: Death of the Novel(ty): Beyond n-Gram Novelty as a Metric for Textual Creativity is now on arXiv (work with Arkadiy Saakyan, Smaranda Muresan, & Tuhin Chakrabarty) Aug 2025: Yukyung’s work CheckEval: A reliable LLM-as-a-Judge framework for evaluating text generation using checklists was accepted to EMNLP! Aug 2025: Several tinlab members presented Mechanistic Understanding of Entity Tracking in Natural Language involving Multiple Operations at NEMI. Jul 2025: I was at a Dagstuhl seminar! 🏰 Jul 2025: Our lab’s research on mechanistic understanding of reasoning/explanations in entity tracking is being supported by MassMutual. Jun 2025: RExBench: Can coding agents autonomously implement AI research extensions? is out on arXiv (work with Nicholas Edwards, Yukyung Lee, Yujun Audrey Mao, Yulu Qin, & Sebastian Schuster). Also see https://rexbench.com! Education / Professional experience Current: Assistant Professor, Dept. of Linguistics Affiliated faculty, Dept. of Computer Science Faculty Fellow, Center for Data Science at Boston University Visiting Faculty Researcher, Google 2021–2022: Faculty Fellow, Center for Data Science, New York University 2021 Ph.D., Dept. of Cognitive Science, Johns Hopkins University May-Nov 2020 Research Intern, Google Student Researcher, Google Summer 2019 Research Intern, IBM research 2015–2016 Visiting researcher, NLP*CL Lab, School of Computing, KAIST 2015 M.St. General Linguistics & Comparative Philology University of Oxford (Ertegun scholar) 2013–2014 Intern developerKnowledge Extraction/NLP Team, NAVER Corporation 2013 B.A. English Linguistics & Literature B.A. Linguistics with minor in Computer Science & Engineering Seoul National University",
  "content_length": 3137,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:02"
}