{
  "name": "Nam P. Nguyen",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/nnguyen.html",
  "status": "success",
  "content": "Nam Nguyen | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Nam Nguyen Professor Contact Info Phone: 410-704-3089 Office: YR-206N Email: npnguyen@towson.edu Education Ph.D., Computer Science, University of Florida Areas of Expertise Complex Network Analysis, Mobile Computing, Social Data Analysis and Data Mining Biography Nam Nguyen is currently a Professor in the Computer and Information Sciences Department. He received his PhD degree in Computer Science from the University of Florida in 2013. Prior to his PhD, he got his M.S. and B.S. from Ohio University (in 2009) and Vietnam National University (in 2007). Nguyen's research interests focus on Network Structure Analysis, BigData, Social-aware Information Mining, Cyber Security, and Practical Mobile Computing applications. Nguyen has published over 30 research papers in major conferences and journal. He has served as an Associate Editor of Springer's Computational Social Network jounal, the TPC Co-chair for CSoNet 2015 and as a TPC member for many research conferences including IEEE INFOCOM'16 and MSN'14 - 15. Nguyen is also the reviewer for IEEE Trans. on Distributed Computing (TPDS), Trans. on Networking (TON), Trans. on Service Computing, etc. In 2015, Nguyen served as a panelist for the National Foundation of Science, USA. Professional Service: Associate Editor - Computational Social Networks Journal (2013 - now). Conference TPC Member IEEE Conference on Computer Communications (INFOCOM), 2016. IEEE Conference on Mobile Ad-hoc and Sensor Networks (MSN), 2014, 2015. Journal and Conference reviewer IEEE Trans. on Distributed Computing (TPDS) IEEE Trans. on Networking (TON) IEEE Trans. on Services Computing IEEE Trans. on Vehicular Technology (IVT) IEEE Trans. on Computational Social Systems IEEE Trans. on Cybernetics Elsevier Neurocomputing Elsevier Information Sciences Theoretical Computer Sciences (TCS) Social Network Analysis and Mining (SNAM) Int. Journal of Sensor Networks (IJSNET) Journal of Combinatorial Optimization (JOCO) Optimization Letter Ad Hoc Networks Journal Wireless Communication and Mobile Computing Springer Trans. on Large-Scale Data- and Knowledge-Centered Systems (TLDKS) MSN’14-15, CSoNet’14-15, ISSAC’10, INFOCOM’10-13, COCOON’10-15, SIMPLEX’11, SOCIALCOM’11, MILCOM’11, ICDCS’13 Selected Publications and Presentations: Vulnerability of Clustering Under Node Failure in Complex Networks,Alan Kuhnle, Nam P. Nguyen, Thang N. Dinh, and My T. Thai, IEEE/ACM Transactions on Networking, 2015 (Under review). Structural Vulnerability Assessment of Community-based Routing in Opportunistic Networks,Md A. Alim, Nam P. Nguyen, My T. Thai and Abdelsalam Helal, IEEE/ACM Transactions on Mobile Computing, 2015 (Under revision). A method to detect communities with stability in social networks,Nam P. Nguyen, M. A. Alim, Thang N. Dinh and My T. Thai, Social Network Analysis and Mining, Vol. 4, Issue 1, DOI: 10.1007/s13278-014-0224-2, 2014. Dynamic social community detection and its applications,Nam P. Nguyen, Thang N. Dinh, Yilin Shen and My T. Thai, PloSONE, DOI: 10.1371/journal.pone.0091431, 2014. Targeted Dot Product Representation for Friend Recommendation in Online Social Networks, Minh D. Dao, Akshay Rangamani, Sang (Peter) Chiny, Nam P. Nguyen and Trac D. Tran, ASONAM 2015. A Note On Clustering Difference by Maximizing Variation of Information, Nam P. Nguyen, CSoNet 2015. Community Structure Analysis in Big Climate Data, Michael P. McGuire and Nam P. Nguyen, SCDM Workshop, IEEE BigData 2014. Structural Vulnerability Analysis of Overlapping Communities in Complex Networks, Md Abdul Alim*, Nam P. Nguyen*, Thang N. Dinh and My T. Thai, IEEE/WIC/ACM WI 2014 (*Co-first authors). Research: Complex Network Analysis, Mobile Computing, Social Data Analysis and Data Mining Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 6960,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:04"
}