{
  "name": "Nan Guan",
  "homepage": "https://www.cs.cityu.edu.hk/~nanguan",
  "status": "success",
  "content": "Nan Guan - CityU Nan Guan Home Publications Professor Department of Computer Science City University of Hong Kong Email: nanguan\"at\"[atsign]cityu.edu.hk My Google scholar pageMy DBLP page Recruiting! Our research group has multiple openings of Ph.D Student, Research Assistant/Associate, Post-Doc Fellow and Software Engineer for the following exciting projects: LLM-aided System Design. Autonomous Driving Systems. Real-Time Inteligence on Edge/Device. Real-Time Robotic Operating System (ROS). Both theoretical and system guys are welcome! Do not hesitate to contact me if you have interests. Research Interests Real-Time Systems Embedded Systems Cyber-Physical Systems Internet-of-Things About MeI'm a Professor at the Department of Computer Science, City University of Hong Kong. I recieved my PhD from Uppsala University, Sweden. Before joining CityU, I worked in The Hong Kong Polytechnic University and Northeastern University, China. My research interests include real-time systems, embedded systems, cyber-physical systems and internet-of-things. Apart form doing theoretical research, I'm also involved in some projects building cool systems, together with my industry parteners. News Outstanding Paper Award of RTSS 2025. Our Paper \"WCDFP Analysis for Real-Time Tasks with Stochastic Release Patterns using Chernoff Bound\" received the Outstanding Paper Award of RTSS 2025 (IEEE Real-Time Systems Symposium). Best Paper Award of CODES+ISSS 2025. Our Paper \"Re-thinking Memory-Bound Limitations in CGRAs\" received the Best Paper Award of CODES+IEEE 2025 (International Conference on Hardware/Software Codesign and System Synthesis). Outstanding Paper Award of RTAS 2025. Our Paper \"Jointly Ensuring Timing Disparity and End-to-End Latency Constraints in Hybrid DAGs\" recieved the Outstanding Paper Award of RTAS 2025 (IEEE Real-Time and Embedded Technology and Applications Symposium). Serve as the General Co-Chair of MEMOCODE 2025 (check details here). MEMOCODE's objective is to emphasize the importance of models and methodologies in correct system design and development. MEMOCODE'25 is a part of ESWEEK 2025, which will take place in Taipei, Taiwan during Sep 28 - Oct 3 2025. Serve as the General Co-Chair of SETTA 2024 (check details here). The purpose of the SETTA is to bring international researchers to exchange research results and ideas with the Chinese computer science and software engineering community. We hope to develop understanding of the research of different groups so as to encourage closer and interest-driven research collaborations. SETTA 2024 will be held in Hong Kong, Nov 26-28, 2024. Best Paper Award of RTSS 2023. Our Paper \"SEAM: An Optimal Message Synchronizer in ROS with Well-Bounded Time Disparity.\" wins the Best Paper Award of RTSS 2023 (IEEE Real-Time Systems Symposium), the flagship conference in the field of real-time systems. Serve as the Local Arrangement Chair of CPS-IoT Week 2024 (check details here). CPS-IoT Week is the premier event on Cyber-Physical Systems and the Internet-of-Things. It brings together five top conferences, HSCC, ICCPS, IoTDI, IPSN, and RTAS, multiple workshops, tutorials, and competitions. CPS-IoT Week 2024 will be held in Hong Kong, May 13-16, 2024. Serve as the Design and Application Track Chair of RTSS 2023 (check details here). Please consider submitting your fine work. The IEEE Real-Time Systems Symposium (RTSS) is the premier conference in the field of real-time systems. The 44th IEEE RTSS is to be held in Taipei from Dec. 5 to 8, 2023. Serve as the Program Co-Chair of RTCSA 2023 (check details here). Please consider submitting your fine work. The 29th IEEE Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA 2023) is to be held from Aug. 30 to Sep.01, 2023, in TOKI MESSE, Niigata, Japan. Outstanding Paper Award of RTSS 2022. Our Paper \"Bounding the Response Time of DAG Tasks Using Long Paths\" wins the Outstanding Paper Award of RTSS 2022 (43th IEEE Real-Time Systems Symposium), the flagship conference in the field of real-time systems. Keynote Talk at MEMOCODE 2022 (check details here). I gave a keynote talk titled \"Towards a Theoretical Foundation for Real-Time Robotic Operating System (ROS)\" in 20th ACM-IEEE International Conference on Formal Methods and Models for System Design (MEMOCODE 2022). Serve as the Selection Committee Chair of SIGBED-SIGSOFT Frank Anger Memorial Award 2022 (check details here). The Frank Anger Memorial Award is a student award in the name of the late Dr. Frank Anger that promotes cross-disciplinary research between embedded systems and software engineering. Funding for the award is provided by ACM SIGBED. Serve as the General Co-Chair of ISORC 2023 (check details here). Please consider submitting your fine work. The 26th IEEE International symposium on Real-Time Distributed Computing is to be held from May 23 to 25 in Nashville, Tennessee, USA. Serve as the General Chair of RTAS 2022 (check details here). Please consider to submit your fine work. RTAS (IEEE Real-Time and Embedded Technology and Applications Symposium) is a flagship conference in the field of real-time and embedded computing systems. Serve as the Program Co-Chair of ISORC 2022 (check details here). Please consider to submit your fine work. ISORC (IEEE Symposium on Real-Time Distributed Computing) addresses research into the application of real-time distributed technology, with an emphasis on object-, component- and service-oriented systems and solutions. Serve as the Selection Committee Chair of SIGBED-SIGSOFT Frank Anger Memorial Award 2021 (check details here). The Frank Anger Memorial Award is a student award in the name of the late Dr. Frank Anger that promotes cross-disciplinary research between embedded systems and software engineering. Funding for the award is provided by ACM SIGBED. Serve as the Industry Chair of RTSS 2021 (check details here). RTSS (IEEE Real-Time Systems Symposium) is a flagship conference in the field of real-time and embedded computing systems. The purpose of RTSS 2021 Industry Session is to initiate and strengthen the collaborations between industry and academia in real-time systems research. Best Paper Award of EMSOFT 2020. Our Paper \"Efficient Feasibility Analysis for Graph-based Real-Time Task Systems\" wins the Best Paper Award of EMSOFT 2020 (International Conference on Embedded Software), a top conference in the field of embedded computing systems and software. Serve as the PC Chair of RTAS 2021. Please consider to submit your fine work. RTAS (IEEE Real-Time and Embedded Technology and Applications Symposium) is a flagship conference in the field of real-time and embedded computing systems. Serve as the Deputy Track Chair of RTSS 2020 Track 2. RTSS (IEEE Real-Time Systems Symposium) is a flagship conference in the field of real-time and embedded computing systems. 2020 ACM SIGBED Early Career Researcher Award. ACM SIGBED is a focal point within the Association for Computing Machinery (ACM) for all aspects of embedded computing systems and cyber-physical systems, including both software and hardware. ACM SIGBED in 2017 established the Early Career Researcher Award to recognize contributions by junior researchers in the area of embedded, real-time, and cyber-physical systems. Serve as the Track Co-Chair of ICPADS 2020, Architecture Track. Please consider to submit your fine work. ICPADS (IEEE International Conference on Parallel and Distributed Systems) is a major international forum for scientists and engineers to exchange and share new ideas and their latest research results regarding systems that are inherently parallel and/or distributed. Outstanding Paper Award of RTSS 2019. Our Paper \"Mixed-Criticality Multicore Scheduling of Real-Time Gang Task Systems\" wins the Outstanding Paper Award and Best Student Paper Award of RTSS 2019 (IEEE Real-Time Systems Symposium), a flagship conference in the field of real-time and embedded computing theory and systems. Serve on the TCRTS Executive Committee. TCRTS (IEEE Technical Committee on Real-Time Systems) promotes and facilitates the exchange of research results and development in the areas of real-time systems, including applications, databases, distributed and parallel systems, formal methods and timing analysis, networks, operating systems and middleware, programming languages, scheduling and resource management, security, and verification and validation. Best Paper Award of ISORC 2019. Our Paper \"Improving Multiprocessor Real-Time Systems with Bursty Inputs under Global EDF using Shapers\" wins the Best Paper Award of ISORC 2019 (IEEE International Symposium on Real-Time Distributed Computing). Serve as the PC Chair of SETTA 2019. Please consider to submit your fine work. SETTA (Symposium on Dependable Software Engineering) will take place in Shanghai, China, Nov. 28-29, 2019. Best Paper Award of e-Energy 2018. Our Paper \"Data Driven Chiller Sequencing for Reducing HVAC Electricity Consumption in Commercial Buildings\" wins the Best Paper Award of e-Energy 2018 (International Conference on Future Energy Systems). Awards ACM SIGBED Early Career Researcher Award, 2020 EDAA Outstanding Dissertation Award, 2014 Best Paper Award, RTSS 2009 Best Paper Award, DATE 2013 Best Paper Award, ACM e-Energy 2018 Best Paper Award, ISORC 2019 Outstanding Paper Award, RTSS 2019 Best Paper Award, EMSOFT 2020 Outstanding Paper Award, RTSS 2022 Best Paper Award, RTSS 2023 Outstanding Paper Award, RTAS 2025 Best Paper Award, CODES+ISSS 2025 Outstanding Paper Award, RTSS 2025 Service Track Chair of RTSS 2023 Program Co-Chair of RTCSA 2023 General Co-Chair of ISROC 2023 General Co-Chair of RTAS 2022 Selection Committee Chair of SIGBED-SIGSOFT Frank Anger Memorial Award 2022 Program Co-Chair of ISROC 2022 Selection Committee Chair of SIGBED-SIGSOFT Frank Anger Memorial Award 2021 Program Chair of RTAS 2021 Program Co-Chair of SETTA 2019 Program Co-Chair of EMSOFT 2015 Track Chair of RTAS 2018 Progra",
  "content_length": 10354,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:07"
}