{
  "name": "Nan Niu",
  "homepage": "http://homepages.uc.edu/~niunn",
  "status": "success",
  "content": "Nan Niu (Home Page) Nan Niu Associate Professor , PO Box 210030 Cincinnati, OH 45221 832 Rhodes Hall (Office), +1.513.556.0051 (Phone), +1.513.556.7326 (Fax) E-mail:   firstname [dot] lastname [at] uc [dot] edu Associate Editor, & Associate Editor, Ph.D., ) M.Sc., ) B.Eng., , Beijing, China I moved to the University of North Florida in July 2025, but would remain as an adjunct faculty member with UC to continue supervising my graduate stduents. I will not actively maintain this site though; please visit my UNF page for updates. Thank you! Consider contributing to some of the cool events: Research My current research interests focus on requirements engineering in , , and contexts. I am also investigating practical and automated ways to manage software traceability and to test scientific software. My earlier work focused on an ecological-evolutionary, foraging-theoretic approach to understanding and improving developers' search for relevant information in their daily activities, such as debugging, refactoring, and reuse. Our research is funded by NSF, EPA, NSA, AFRL, ERDC, ECI, P&G, and Ohio Cyber Range. Recent honors Darwin T. Turner Scholars Breakfast of Champions, UC's Office of Ethnic Programs and Services, 2023 CEAS Master Educator Award 2019 Recent publications (Full List, Google Scholar Profile, DBLP List) Hanlin Tang, Yanjie Jiang, Yuxia Zhang, Nan Niu, and Hui Liu, \"\", (accepted). Bo Liu, Hui Liu, Nan Niu, Yuxia Zhang, Guangjie Li, He Jiang, and Yanjie Jiang, \"\", (accepted). Bo Liu, Yanjie Jiang, Yuxia Zhang, Nan Niu, Guangjie Li, and Hui Liu, \"\", (accepted). Yilong Yang, Younggi Bok, Hongyue Pan, Yang Li, Nan Niu, and Tong Li, \"\", (accepted). Victoria Niu, Walaa Alshammari, Naga Mamata Iluru, Padmaja Vaishnavi Teeleti, Nan Niu, Tanmay Bhowmik, and Jianzhang Zhang, \"\", , Ottawa, Canada, April 27, 2025, (accepted). Jianzhang Zhang, Jialong Zhou, Jinping Hua, Nan Niu, and Chuang Liu, \"\", (accepted). Fu Fan, Yanjie Jiang, Tianyi Chen, Hengshun Zhang, Yuxia Zhang, Nan Niu, and Hui Liu, \"\", (accepted). Jianzhang Zhang and Nan Niu, \"\", (accepted). Current and former students Ph.D. M.Sc. Undergraduate Aurek Chattopadhyay Anjali Golla Elmoataz Abdellah Mahima Dahiya Naga Mamata Iluru Walaa Alshammari Padmaja Vaishnavi Teeleti Teaching Current: CS5128/6028 - Large Scale Software Engineering (Spring 2025) Past: UC: EECE3093C - Software Engineering (Spring 2015-2021), CS5127/6027 - Requirements Engineering (Fall 2014-2024), CS5128/6028 - Large Scale Software Engineering (Spring 2023-2025), EECE 7001 - Graduate Seminar (Fall 2023-2024) MSU: CSE4/683 - Software Testing and Quality Assurance (Spring 2014, Spring 2013, Spring 2012, Spring 2011), CSE4/6214 - Introduction to Software Engineering (Fall 2013, Fall 2012, Fall 2010), CSE321/23 - Software Engineering Senior Design Project (Fall 2011, Spring 2012), CSE8273 - Software Requirements Engineering (Fall 2013, Fall 2011, Fall 2009), CSE8990 - Software Reuse and Domain Engineering (Fall 2012, Spring 2010) UofT: CSC309 - Programming on the Web (Fall 2008, Summer 2008) [Last updated: July 27, 2025]",
  "content_length": 3095,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:10"
}