{
  "name": "Nancy Lan Guo",
  "homepage": "https://www.binghamton.edu/computer-science/people/profile.html?id=nguo1",
  "status": "success",
  "content": "Nancy L. Guo - Our Faculty | School of Computing | Binghamton University Skip to main content School of Computing Our Faculty Nancy L. Guo Professor of Empire Innovation School of Computing nguo1@binghamton.edu 607-777-4884 EB Q07 BackgroundNancy Guo is a Professor of Empire Innovation at the School of Computing at Binghamton University's Thomas J. Watson College of Engineering and Applied Science. Guo is experienced in leading foundation AI-based multidisciplinary research as PI of two NIH R01s and two NSF grants. She obtained more than $45.5 million in federal funding as PI/PD to develop technology and infrastructure to advance precision medicine. She has 61 peer-reviewed journal publications with more than 3,800 citations. Her research has generated 14 patents on cancer drugs and molecular diagnostic assays with FDA “novel technology” status. Software products developed by her team have more than 46,000 visits. As the founding director of the Biomedical Informatics Resources Core of West Virginia Clinical & Translational Science Institute from 2009-17, she led statewide informatics initiatives and enhanced multi-state collaboration. She is fostering academic-industry partnerships for clinical commercialization of AI-based cancer treatment selection and drug development through her current NSF PFI-RP project. She mentored 48 postdocs, MDs and graduate students to strive as next-generation researchers, tenured faculty, entrepreneurs as PI of NSF and NCI SBIRs and healthcare professionals recognized with nine national awards. She served as chair of grant review panels of lung cancer research for the DOD and NCI.EducationBS: Biochemistry and Molecular Biology, Peking University, Beijing, ChinaPhD: Computer and Information Science, West Virginia UniversityResearch InterestsArtificial intelligenceMachine learningBioinformatics and computational genomicsRelated News StoriesNew Empire Innovation professor at the forefront of bioinformatics revolution Return to Top Last Updated: 3/31/25",
  "content_length": 2015,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:12"
}