{
  "name": "Nancy A. Lynch",
  "homepage": "https://people.csail.mit.edu/lynch",
  "status": "success",
  "content": "Nancy Lynch's Home Page Nancy A. Lynch NEC Professor of Software Science and Engineering, Professor of Electrical Engineering and Computer Science, Massachusetts Institute of Technology. Nancy Lynch heads the Theory of Distributed Systems Group (TDS) research group in MIT's Computer Science and Artificial Intelligence Laboratory (CSAIL). This group is part of the Theory of Computation (TOC) group. Research interests: Distributed computing, real-time computing, algorithms, lower bounds, formal modelling and verification, wireless network algorithms, and biological distributed algorithms. Teaching: Spring 2021: 6.042J Math for Computer Science Fall 2020: 6.852J/18.437 Distributed Algorithms Spring 2020: Reading group on Brain Network algorithms Spring, 2019: Reading group on Brain Network algorithms Fall 2018: 6.852J/18.437 Distributed Algorithms -Spring 2016: 6.006 Introduction to Algorithms -Fall 2015: 6.852J/18.437 Distributed Algorithms -Spring 2015: 6.046J Design and Analysis of Algorithms -Fall 2014 6.852J/18.437 Distributed Algorithms -Spring 2014: 6.006 Introduction to Algorithms -Fall 2013: 6.852J/18.437 Distributed Algorithms -Spring 2012: 6.041 Probabilistic Systems Analysis -Fall 2011: 6.852J/18.437 Distributed Algorithms -Spring 2011: 6.885 Distributed Algorithms: New Topics and Techniques -Spring 2010: 6.045/18.400 Automata, Computability, and Complexity -Fall 2009: 6.852/18.437 Distributed Algorithms -Spring 2009: 6.045/18.400 Automata, Computability, and Complexity -Fall 2008: 6.885 Distributed Algorithms for Mobile Wireless Ad Hoc Networks Books: Atomic Transactions, Distributed Algorithms The Theory of Timed I/O Automata Nancy Lynch's Publications and TDS group Publications Members of the TDS Group Past Students Accessibility 617 253-7225 (voice) 617 258-8682 (fax) lynch@csail.mit.edu Administrative Assistant Joanne Talbot Hanley",
  "content_length": 1877,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:11"
}