{
  "name": "Nancy J. Nersessian",
  "homepage": "http://www.cc.gatech.edu/aimosaic/faculty/nersessian",
  "status": "success",
  "content": "Nancy J. Nersessian Nancy J. Nersessian Regents' Professor of Cognitive Science (Emerita) Georgia Institute of Technology Research Associate Harvard University Department of Psychology William James Hall 33 Kirkland St. Cambridge, MA 02138 nancy.nersessian@gmail.com My research focuses on creativity, innovation, and conceptual change in science. I try to understand the cognitive and cultural processes that lead up to scientific innovation, both theoretical and experimental. The practice of science involves sophisticated cognition, which only rich social, cultural, and material environments can enable. But most accounts of creativity and innovative practices tend to focus on either \"cognitive\" or \"cultural\" factors. In contrast, I seek to develop an account of how a dynamic and evolving interplay of cognition and culture support and sustain creative and innovative scientific practices. The account I am developing brings together and integrates methodologies and conceptual frameworks from cognitive science, philosophy of science, and history of science. I draw upon four sources: 1) a range of empirical data, including historical documents pertaining to past science, ethnographic observations, and interviews relating to \"science-in-action\"; 2) concepts and analyses from cognitive science; 3) an extensive body of literature on scientific practices in the science studies fields; and 4) my own theoretical analysis of problems and issues, developed over the past decades. To bring together this wide range of theory, data, and methodologies, I have been working with a very diverse research team that has over the years consisted of cognitive scientists, theoretical psychologists, computer scientists, philosophers, historians of science, and ethnographers. Currently, I am investigating physical and computational modeling practices in biomedical engineering and integrative systems biology research laboratories, and how such models contribute to scientific breakthroughs. Using a combination of ethnography, cognitive-historical analysis, and theoretical frameworks from cognitive science, this research examines: 1) How researchers construct physical and computational models and use them to reverse engineer biological phenomena, 2) How learning proceeds in such labs, and 3) How investigative and collaboration practices support research and innovation in such interdisciplinary and transdisciplinary settings. For research group publications, visit the Cognition and Learning in Interdisciplinary Cultures (CLIC) website. One objective of this research is to extend my analysis of model-based reasoning from conceptual models to physical and computational models. Another major objective is to work with science and engineering faculty to design and develop undergraduate and graduate learning environments that encourage and support creativity and innovation in interdisciplinary science and engineering. A third major theme of my research is conceptual innovation and change in physics, engineering sciences, and learning, specifically by means of analogical, visual, and simulative modeling. Together with Ph.D. students in design cognition I have been extending my analyses of model-based reasoning, distributed cognition, and interdisciplinary practices to architectural design. I hold an A.B. in Physics and Philosophy from Boston University and M.A. and Ph.D. degrees in Philosophy from Case Western Reserve University . I am a Fellow of the American Association for the Advancement of Science, a Fellow of the Cognitive Science Society, and a Foreign Member of the Royal Netherlands Academy of Arts and Sciences. I’ve held fellowship positions at the Radcliffe Institute for Advanced Study (Harvard), the Dibner Institute at MIT, the Pittsburgh Center for the Philosophy of Science, the Netherlands Institute for Advanced Study, and the University of Leiden, the Netherlands (Fulbright Scholar). I have served as the Chair of the Cognitive Science Society (2003-4) and on its Governing Board, and as a Governing Board member of the Philosophy of Science Association. In 2011 I was honored with the inaugural Patrick Suppes Prize in Philosophy of Science by the American Philosophical Society. In 2012 I and my co-authors were honored with the William James Book Award by the American Psychological Association. Selected Books Science as Psychology: Sense-making and Identity in Science Practice. (co-authored with L. Osbeck, K. Malone, and W. Newstetter; Cambridge University Press 2011) (William James Book Award, American Psychological Association, 2012) Creating Scientific Concepts (MIT Press, 2008) (Patrick Suppes Prize, American Philosophical Society, 2011) Model-Based Reasoning: Science, Technology, and Values (edited with L. Magnani; Kluwer 2002) Model-Based Reasoning in Scientific Discovery (ed. with L. Magnani and P. Thagard; Plenum 1999) Faraday to Einstein: Constructing Meaning in Scientific Theories (Kluwer, 1984, 1990) Current Courses Philosophy of Science, Cognitive Models of Science, Cognition and Culture, Philosophy of Cognition, Philosophical Issues in Computation, STS Perspectives on Science and Technology. In my spare time I sing opera and other classical music. My favorite poem is Anna Akhmatova's, \"The Sentence.\" CLIC Research | CV Online Publications MacLeod, M. & Nersessian, N.J. (2017): Interdisciplinary Problem-solving: Emerging Modes in Integrative Systems Biology to appear in European Journal of Philosophy of Science on-line July 2016 (in press 2017) [ PDF ] Osbeck, L.M. & Nersessian, N.J. (2017): Epistemic Identities in Interdisciplinary Science to appear in Perspectives on Science 25 [ PDF ] MacLeod, M. & Nersessian, N.J. (2015): Modeling Systems-Level Dynamics: Understanding without Mechanistic Explanation in Integrative Systems Biology in Studies in History and Philosophy of Science Part C — Biological and Biomedical Science 49:1-11 [ PDF ] Chandrasekharan, S. & Nersessian, N.J. (2015): Building Cognition: The Construction of Computational Representations for Scientific Discovery in Cognitive Science 39:1727-1763 [ PDF ] MacLeod, M. & Nersessian, N.J. (2014): Strategies for Coordinating Experimentation and Modeling in Integrative Systems Biology in Journal of Experimental Zoology, Part B: Molecular and Developmental Evolution 322:230-239 [ PDF ] MacLeod, M. & Nersessian, N.J. (2013): Coupling Simulation and Experiment: The Bimodal Strategy in Integrative Systems Biology in Studies in the History and Philosophy of the Biological and Biomedical Sciences 44 vol 4 [ PDF ] MacLeod, M. & Nersessian, N.J. (2013): Building Simulations from the Ground-Up: Modeling and Theory in Systems Biology in Philosophy of Science 80:533-556 [ PDF ] MacLeod, M. & Nersessian, N.J. (2013): The creative industry of integrative systems biology in Mind & Society, 12:35-48 [ PDF ] Aurigemma, J., Chandrasekharan, S., Nersessian, N. J., & Newstetter, W. (2013): Turning experiments into objects: the cognitive processes involved in the design of a lab-on-a-chip device in Journal of Engineering Education, Special Issue: Representations (vol. 102, 1/2013) [ PDF ] Chandrasekharan, S., Nersessian, N.J., & Subramanian, V. (2012): Computational Modeling: Is this the end of thought experimenting in science? In J. Brown, M. Frappier, & L. Meynell, eds. Thought Experiments in Philosophy, Science and the Arts. (London: Routledge). pp. 239-260. [ PDF ] Dogan, F. & Nersessian, N. J. (2012): Conceptual diagrams in creative architectural practice: the case of Daniel Libeskind's Jewish Museum in Berlin. In arq: Architectural Research Quarterly, 16:14-28 [ PDF ] Nersessian, N. J. (2012): Modeling Practices in Conceptual Innovation: An ethnographic study of a neural engineering research laboratory in Scientific Concepts and Investigative Practice, U. Feest & F. Steinle, eds. (Berlin: DeGruyter, 2012). 245-269 [ PDF ] Chandrasekharan, S. & Nersessian, N.J. (2011): Building Cognition: The Construction of External Representations for Discovery. In Proceedings of the Cognitive Science Society 33, 2011 [ PDF ] Dogan, F. & Nersessian, N.J. (2010): Generic abstraction in design creativity: the case of the Staatsgalerie by James Stirling, Design Studies, 31:207-236. [ PDF ] Osbeck, L.M. & Nersessian, N.J. (2010): Forms of Positioning in Interdisciplinary Science Practice and their Epistemic Effects in The Journal for the Theory of Social Behavior, 40:136-161 [ PDF ] Nersessian, N.J. (2009). How do engineering scientists think? Model-based simulation in biomedical engineering laboratories, Topics in Cognitive Science, 1:730-757. [ PDF ] Nersessian, N.J. & Chandrasekharan, S. (2009). Hybrid Analogies in Conceptual Innovation in Science, Cognitive Systems Research Journal, Special Issue: Integrating Cognitive Abilities. 10: pp. 178-188 [ PDF ] Nersessian, N.J. & Patton, C. (2009). \"Model-based reasoning in interdisciplinary engineering\", The Handbook of the Philosophy of Technology & Engineering Sciences, A. W. M. Meijers, ed., Springer, pp. 678-718. [ PDF ] Nersessian, N.J. (2008) Creating Scientific Concepts. Cambridge, MA: MIT Press. [ Preface PDF ] Harmon, E. & Nersessian, N.J. (2008). Cognitive partnerships on the bench top: Designing to support scientific researchers. In Proceedings of DIS'08, ACM [ PDF ] Nersessian, N. J. (2007). \"Mental Modeling in Conceptual Change\", International Handbook of Conceptual Change, S. Vosniadou, ed. ( London: Routledge, 2008, pp. 391-416) [ PDF ] Nersessian, N. J. (2006). The Cognitive-Cultural Systems of the Research Laboratory. Organization Studies, 27(1), pp. 125-145.[ PDF ] Nersessian, N. J., Kurz-Milcke, E. & Davies, J. (2005). Ubiquitous computing in science and engineering research laboratories: A case study from biomedical engineering. In G. Kouzoulis et al., (Eds.), Knowledge in the New Technologies Berlin: Peter Lang Publishers. pp. 167-198.[ PDF ] Nersessian, N. J. (2005). Interpreting scientific and engineering practices: Integrating the c",
  "content_length": 13040,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:13"
}