{
  "name": "Nancy M. Amato",
  "homepage": "https://parasollab.web.illinois.edu/people/amato",
  "status": "success",
  "content": "Home Page for Nancy M. Amato | Parasol Laboratory Nancy M. Amato Abel Bliss Professor and Director, Siebel School of Computing and Science Parasol Laboratory url: http://parasollab.web.illinois.edu/~namato/ Siebel School of Computing and Data Science email: University of Illinois at Urbana-Champaign office: 3229 Siebel Center Urbana, IL 61801, USA tel: +1-217-333-3426 Bio CV (pdf) Google Scholar Profile Publications Nancy's School Page Personal Home Page \"\" Spring 2024 CS199 STR: CS STARS Seminar (Spring 2024). CS591 CS: CS Colloquium (Spring 2024) Past Courses CS 591 PhD: PhD Orientation Seminar (Fall 2023) CS491 PD: Professional Development Seminar (Spring 2023) \"\" CS Student Ambassadors / Research Scholars (CS STARS) Program: Students in this program engage in research with a faculty mentor, serve as ambassadors to recruit women who are interested in CS majors, and lead and participate in outreach and community building activities in CS. Grad School & Career Advice CRA-WP Distributed Research Experiences for Undergraduates (DREU) CRA Committee on Widening Participation in Computing Research (CRA-WP) CERP: The CRA Center for Evaluating the Research Pipeline \"\" The 16th International Workshop on the Algorithmic Foundations of Robotics. Chicago, USA, October 7-9 2024. Visit Page This NSF Expedition in Computing will develop the science and technology to fabricate, model and program systems based on living neurons. Interfacing with muscles and sensors, the behavior of these machines will evolve as they probe their environment, explore and respond to it. Visit Page Motion planning has applications in robotics, games/virtual reality, computer-aided design/virtual prototyping, and bioinformatics. Our research is focused on developing motion planning algorithms and applying them to a wide range of problems. Visit Page The Standard Template Adaptive Parallel Library is a framework for developing parallel programs in C++. It is designed to work on both shared and distributed memory parallel computers and its core is a library of ISO Standard C++ components with interfaces similar to the (sequential) ISO C++ standard library. Visit Page Our group is investigating applications of sampling-based motion planning methods to protein folding, ligand binding (i.e., drug docking, which arises in drug design), RNA folding, and neuroscience. Visit Page The 35th International Workshop on Languages and Compilers for Parallel Computing. Chicago, Illinois, October 12-14, 2022 Visit Page The US National Robotics Roadmap was first created in 2009. It has since been used by government agencies, universities and companies as a reference about where robotics is going. Chicago, Illinois, September 11-12, 2019 Visit Page Excursions in Algorithmics: A late festschrift for Franco P. Preparata. Brown University, Providence, RI, October 27-28, 2006. Visit Page Position: It Is Time We Test Neural Computation In Vitro, Frithjof Gressmann, Ashley Chen, Lily Hexuan Xie, Nancy M. Amato, Lawrence Rauchwerger , Proceedings of the 42nd International Conference on Machine Learning, Vol: 267, pp. 81393-81409, Jul 2025. DOI: PMLR 267:81393-81409Keywords: Computational Biology, Machine LearningLinks : [Published] [Talk] BibTex@InProceedings{pmlr-v267-gressmann25a, title = \t {Position: It Is Time We Test Neural Computation In Vitro}, author = {Gressmann, Frithjof and Chen, Ashley and Xie, Lily Hexuan and Amato, Nancy and Rauchwerger, Lawrence}, booktitle = \t {Proceedings of the 42nd International Conference on Machine Learning}, pages = \t {81393--81409}, year = \t {2025}, editor = \t {Singh, Aarti and Fazel, Maryam and Hsu, Daniel and Lacoste-Julien, Simon and Berkenkamp, Felix and Maharaj, Tegan and Wagstaff, Kiri and Zhu, Jerry}, volume = \t {267}, series = \t {Proceedings of Machine Learning Research}, month = \t {13--19 Jul}, publisher = {PMLR}, pdf = \t {https://raw.githubusercontent.com/mlresearch/v267/main/assets/gressmann25a/gressmann25a.pdf}, url = \t {https://proceedings.mlr.press/v267/gressmann25a.html}, abstract = \t {Recent advances in bioengineering have enabled the creation of biological neural networks in vitro, significantly reducing the cost, ethical hurdles, and complexity of experimentation with genuine biological neural computation. In this position paper, we argue that this trend offers a unique and timely opportunity to put our understanding of neural computation to the test. By designing artificial neural networks that can interact and control living neural systems, it is becoming possible to validate computational models beyond simulation and gain empirical insights to help unlock more robust and energy-efficient next-generation AI systems. We provide an overview of key technologies, challenges, and principles behind this development and describe strategies and opportunities for novel machine learning research in this emerging field. We also discuss implications and fundamental questions that could be answered as this technology advances, exemplifying the longer-term impact of increasingly sophisticated in vitro neural networks.} }AbstractRecent advances in bioengineering have enabled the creation of biological neural networks in vitro, significantly reducing the cost, ethical hurdles, and complexity of experimentation with genuine biological neural computation. In this position paper, we argue that this trend offers a unique and timely opportunity to put our understanding of neural computation to the test. By designing artificial neural networks that can interact and control living neural systems, it is becoming possible to validate computational models beyond simulation and gain empirical insights to help unlock more robust and energy-efficient next-generation AI systems. We provide an overview of key technologies, challenges, and principles behind this development and describe strategies and opportunities for novel machine learning research in this emerging field. We also discuss implications and fundamental questions that could be answered as this technology advances, exemplifying the longer-term impact of increasingly sophisticated in vitro neural networks. K-ARC: Adaptive Robot Coordination for Multi-Robot Kinodynamic Planning, Mike Qin, Irving Solis, James Motes, Marco Morales, Nancy M. Amato, ArXiv, Jan 2025. DOI: https://doi.org/10.48550/arXiv.2501.01559Keywords: Multi-Agent Systems, Sampling-Based Motion PlanningLinks : [ArXiv] BibTex@article{qin2025karc, title={K-ARC: Adaptive Robot Coordination for Multi-Robot Kinodynamic Planning}, author={Mike Qin and Irving Solis and James Motes and Marco Morales and Nancy M. Amato}, journal={arXiv preprint arXiv:2501.01559}, year={2025} } AbstractThis work presents Kinodynamic Adaptive Robot Coordination (K-ARC), a novel algorithm for multi-robot kinodynamic planning. Our experimental results show the capability of K-ARC to plan for up to 32 planar mobile robots, while achieving up to an order of magnitude of speed-up compared to previous methods in various scenarios. K-ARC is able to achieve this due to its two main properties. First, K-ARC constructs its solution iteratively by planning in segments, where initial kinodynamic paths are found through optimization-based approaches and the inter-robot conflicts are resolved through sampling-based approaches. The interleaving use of sampling-based and optimization-based approaches allows K-ARC to leverage the strengths of both approaches in different sections of the planning process where one is more suited than the other, while previous methods tend to emphasize on one over the other. Second, K-ARC builds on a previously proposed multi-robot motion planning framework, Adaptive Robot Coordination (ARC), and inherits its strength of focusing on coordination between robots only when needed, saving computation efforts. We show how the combination of these two properties allows K-ARC to achieve overall better performance in our simulated experiments with increasing numbers of robots, increasing degrees of problem difficulties, and increasing complexities of robot dynamics. A primer on in vitro biological neural networks, Frithjof Gressmann, Ashley Chen, Lily Hexuan Xie, Sarah Dowden, Nancy Amato, Lawrence Rauchwerger, NeurIPS 2024 Workshop Machine Learning with new Compute Paradigms, Vancouver, Canada, Dec 2024. Keywords: Machine Learning, Scientific ComputingLinks : [Published] [Manuscript] BibTex@inproceedings{gressmann_primer_2024, title = {A Primer on in Vitro Biological Neural Networks}, author = {Gressmann, Frithjof and Chen, Ashley and Xie, Lily Hexuan and Dowden, Sarah and Amato, Nancy and Rauchwerger, Lawrence}, date = {2024-10-17}, url = {https://openreview.net/forum?id=RdFI2ogt1j}, urldate = {2024-11-04}, eventtitle = {{{NeurIPS}} 2024 {{Workshop Machine Learning}} with New {{Compute Paradigms}}}, langid = {english} } AbstractRecent advances in bioengineering have enabled the creation of biological neural networks in vitro, raising the prospect of novel, unconventional platforms that can leverage genuine biological computation. The technology could help unlock computing paradigms that could be faster, more powerful, and more energy efficient than the silicon-based architectures that dominate today's computing landscape. However, engineering cell cultures for computing applications presents a radical departure from digital von Neumann architectures that computer scientists have grown accustomed to and will require a rethink of the entire stack. Here, we provide a brief overview of the key technologies, principles, and challenges of this emerging interdisciplinary field. We argue that seizing on its potential will require the development of new machine-learning approaches that can process the vast observable activity of neuronal cell cultures and learn to control and make sense of their neural code. Such an effort could provide a pathway for leveraging biological neural networks and contribute to our understanding of what makes biologic",
  "content_length": 370806,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:15"
}