{
  "name": "Nancy Alonistioti",
  "homepage": "http://cgi.di.uoa.gr/~nancy",
  "status": "success",
  "content": "Team – SCAN Lab Skip to content Team Faculty Members Nancy Alonistioti Associate Professor Read More Αs. Prof. Nancy Alonistioti (female) has a B.Sc. degree and a PhD degree in Informatics and Telecommunications (Dept. of Informatics and Telecommunications, UoA). She has over 20 years of experience in numerous national and European projects, including project/technical management experience (MOBIVAS, ANWIRE, LIAISON, E2R I & II, E3, SelfNET, SACRA, CONSERN, UniverSelf, SmartAgriFood). She is currently leading the SCAN group activities in the Dept. Informatics in UoA. She has served as member of the Future Internet Assembly Steering Committee. She has also undertaken management activities as a PMT member and WP Leader of the FP6 IST- E2R and FP7 E3 projects and the PC of FP7 ICT Self-NET and FP7 ICT CONSERN projects. She is member of the ETSI Experts group and the Greek standardization group ELOT (5G, smart citiy autonomic communications). She has over 100 publications in the area of mobile networks, Future Internet/NGI, cognitive management, autonomic communications and reconfigurable mobile systems. She is coauthor of 4 WO Patents and has more than 2500 citation in her work. George Alexandropoulos Associate Professor Researchers Lina Magoula PhD candidateRead More Lina Magoula is currently a Senior PhD candidate and is working as Technical Manager at the SCAN Laboratory of National and Kapodistrian University of Athens, performing active research in applied AI for next generation networks. Since 2021, she has been working as Technical Manager of the SCAN laboratory, actively involved in the design and development of AI-empowered solutions for intelligent resource orchestration for 5G+ networks. Her main areas of interest are Machine Learning, Artificial Intelligence, 5G and Beyond Networks, Distributed Learning, Green Communications, Smart Resource Orchestration and Network Function Virtualization. Nikolas Koursioumpas PhD candidateRead More Nikolaos Koursioumpas is a Senior PhD Candidate and works as Technical Project Manager at the SCAN Laboratory of National and Kapodistrian University of Athens. He received his B.Sc and M.Sc from the Department of Informatics and Telecommunications with specialization in “Computer Networking and Telecommunications”. He is distinguished for his strong background in the design and development of distributed AI/ML algorithms for dynamic resource allocation through Context and Energy-Aware Resource Management. His main areas of interest include: Distributed AI, Green 5G+ and 6G Networks Panagiotis Kontopoulos PhD candidate Read More Mr. Panagiotis Kontopoulos obtained his four-year Bachelor of Science (B.Sc.) and two-year Master of Science (M.Sc.) from National and Kapodistrian University of Athens (UoA), in the Department of Informatics and Telecommunications. Currently works as a Research Associate in the Software Centric & Autonomic Networking (SCAN) Lab of UoA in conjunction with his Doctor of Philosophy (PhD) from National and Kapodistrian University of Athens (UoA), in the Department of Informatics and Telecommunications, with a specialization in Artificial Intelligence, Telecommunications and Networks. His main fields of interest are Software-Defined Networking (SDN), Software-Defined Wireless Local Area Networking (SDWLAN), distributed systems, mobile communication systems and services in future networks. Personal Site: Site Konstantinos Soras Research AssociateRead More Konstantinos Soras has obtained his bachelor’s degree (BSc) from the Department of Informatics and Telecommunications, National and Kapodistrian University of Athens. He is currently working as a 3D Modeler, Unity Developer and Front-End Developer at the Software Centric and Autonomic Networking (SCAN) Lab of NKUA. His main interests are digitization of cultural heritage, game development and animation. Theodora Panagea Research AssociateRead More Theodora is currently pursuing her Masters Degree at the Department of Informatics and Telecommunications, National and Kapodistrian University of Athens (NKUA). She received her Bachelor of Science (B.Sc.) from the same department, with a specialization in “Computer Science Foundations”. She is currently working as a Research Associate at the Software Centric and Autonomic Networking (SCAN) Laboratory at NKUA. Her main topics of interest are machine learning, artificial intelligence, algorithms, and cognitive science. Giorgos Halios System Administrator – Research AssociateRead More Giorgos obtained his Bachelor of Science (B.Sc.) from the Department of Informatics and Telecommunications in the University of Athens, in the field of Computer Science and Computer Networks. He is currently working as a System Administrator and Research Associate at the Software Centric and Autonomic Networking (SCAN) Lab of UoA. His main fields of interest are Linux administration, low level programming (Unix, IoT etc.), signal processing, machine learning and wireless and mobile networks beyond 5G Georgios Demesiotis System Administrator – Research AssociateRead More Georgios obtained his Bachelor of Science (B.Sc.) the Department of Computer Science at the University of Thessaly. In addition, he is working as a System Administrator and Research Associate at the Software Centric and Autonomic Networking (SCAN) Lab of UoA. His main fields of interest include Unix, Cyber Security, Linux administration, and IoT programming. Site Violetta Gkika Research AssociateRead More Violetta is a Computer Science graduate from the National and Kapodistrian University of Athens, now pursuing a master’s in Data Science with a specialization in Bioinformatics and Biomedical Data Science. Her primary interests lie in machine learning and data science within biological and medical applications. She currently contributes to the SCAN Lab as a Unity Developer, focusing on 3D modeling and digital twin development. Vanessa Ibro Research AssociateRead More Vanessa holds a Bachelor’s degree in Physics from the University of Patras and is currently completing a Master’s degree in Computer Engineering and Informatics at the same institution, with a specialization in Machine Learning and Information Processing. Her research interests focus on artificial intelligence, machine learning, and the development of data-driven solutions for complex analytical problems. She is particularly engaged in forecasting and predictive modeling, as well as designing innovative approaches to data analysis and processing. As a Research Associate at the SCAN Lab, she actively contributes to projects that apply advanced computational techniques to real-world challenges across various domains. Nikitas Moschos Research AssociateRead More Nikitas is currently pursuing his Bachelor of Science (B.Sc.) the Department of Informatics and Telecommunications at the National and Kapodistrian University of Athens. In addition, he is working as a Research Associate at the Software Centric and Autonomic Networking (SCAN) Lab of UoA. His main fields of interest include research on Artificial Intelligence, ML – Driven data analysis and IoT technologies. Administrative Support Stella Kazilieri Read More Ms Stella Kazilieri received the B.Sc. degree in 1999 from the Department of Business Administration, University of Piraeus. She has computer knowledge and especially as far as office and financial applications are concerned. She has a ten year previous job experience in private and public sector (Municipality of Heraklio, Attikis, Cultural Centre – Ministry of Culture, Directorate of Byzantine and Post-Byzantine Antiquities, Clerical Officer – Ministry of Tourism, Executive Secretary Office). Stamatios Kolovos Read More Mr. Stamatios Kolovos received his B.Sc degree from the Department of Business Administration, Technological Educational Institute of Chalkida in 2013, and his  M.Sc in Management & Economics of Telecommunication Networks from the Department of Informatics and Telecommunications, National and Kapodistrian University of Athens (NKUA) in 2016. He has been working as a research associate for the SCAN group since July 2013. His main research interests lie in Theoretical framework of Crowdsourcing on Business. Past Members Sokratis Barmpounakis Postdoctoral ResearcherRead More Dr. Sokratis Barmpounakis is a Postdoctoral Research Associate, serving as the Technical Manager of SCAN group, Dept. of Informatics and Telecommunications. He holds a Ph.D. in “Context-based Resource Management and Slicing for SDN-enabled 5G Smart, Connected Environments”, since May 2018. Dr. Barmpounakis obtained his Engineering Diploma in Electrical and Computer Engineering, from the National Technical University of Athens (NTUA) in 2010. From 2010 until 2013, he worked as a Research Associate at the University of Geneva, Switzerland, in several projects (Swiss and European), as a member of the QoL group. Since March 2013, he is a researcher in the SCAN group, actively involved in numerous European Projects and industrial contracts, having also undertaken managerial roles, coordinating the University of Athens team. Since 2018, he serves as an Adjunct Professor in the Department of Informatics and Telecommunications of the University of Athens. Dr. Barmpounakis has more than 250 citations, and he is a co-inventor of 2 patents, approved and filed in the World Intellectual Property Organisation. His main fields of interest are: 5G, AI-assisted Networking for intelligent resource management, Network Function Virtualization, and Software Defined Networking. Since 2010, he is also a member of the Technical Chamber of Greece. Dimitris Kassos Research AssociateRead More Dimitris Kassos obtained his four-year Bachelor of Science (B.Sc.) from National and Kapodistrian University of Athens (UoA), in the Department of Informatics and Telecommunications. He is currently working as a system Administrator at the Software Centric and Autonomic Networking (SCAN) Lab of Uo",
  "content_length": 11040,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:15"
}