{
  "name": "Nandlal L. Sarda",
  "homepage": "https://www.cse.iitb.ac.in/~nls",
  "status": "success",
  "content": "N.L.SARDA'S HOME PAGE N.L.SARDA Professor (Retd). Computer Science & Engineering Department IIT BOMBAY Powai Mumbai-400076 Tel: (mobile) +91-9820120045 email Me cse.iitb.ac.in email Me gmail.com Personal Details Courses Journal Editorship Awards & Honours Publications Journals Conferences Books Other Detailed (not up-to-date though !) biodata is here GISE Lab initiative (2008) RESEARCH INTRESTS : Database Management Systems Database modeling and Applications. Spatio-Temporal and Geospatial Databases. Software Engineering. Information Systems. Brief-Biodata : Dr. Nandlal L. Sarda was a Professor in the Department of Computer Science and Engineering at IIT Mumbai (Bombay). He received his Master's (M.Tech.) and PhD degrees from IIT Bombay, and joined as faculty at IIT Bombay, where he is teaching since 1972. He was a Visiting Associate Professor at University of New Brunswick, Canada from 1986 to 88. He was Head of the Computer Science & Engineering Department at IIT Bombay from 1994 to 1997. He was Head of Shailesh J. Mehta School of Management from Aug. 2006 till Feb. 2007. He was Dean of Academic Programmes, IIT Bombay, from October 2001 to September 2004.. In this capacity, he coordinated with IIT's Senate and its various Academic departments for creating, revising, operationalizing and supervising IIT's academic programmes. He served as Professor-in-Charge of Innovation and Entrepreneurship, from October 2004 to Feb. 2006, in which role he coordinated with the Society for Innovation and Entrepreneurship (SINE) hosted by IIT Bombay to encourage and actively facilitate IITB's faculty and students to convert intellectual property developed by them into business ventures. He continued at IIT Bombay as Emeritus Fellow until April 2018 after his super-annuation in June 2013. He is presently a Visiting Professor in Computer Sci and Eng Department at IIT Dharwad. His main research interests are in the areas of Database Systems and Software Engineering. He has published widely in international journals and conferences. He has focused in the last few years on the research issues in Database Modeling, Geo-spatial and Temporal databases, data warehousing (that includes metadata integration from multiple sources), and ontology-based schema integration. He has participated in many national and international conferences in the capacity of Programme Committee chair/member, invited speaker, etc. He was the Programme Co-chair of VLDB'96, a premier international database conference, which was held in Mumbai in 1996. He has also served on the editorial board of a few international journals. He was honoured as Fellow of Computer Society of India at its convention in November 2006 for his sustained contributions to CSI's activities. He is closely associated with many companies and government institutions as a consultant, offering advice in planning, selection, implementation and evaluation of information technology solutions. He is on Technical Advisory committees of National Payments Corporation of India (NPCI), NSE (National Stock Exchange), NSDL, and CCIL among others. He served as Director on the Board of Directors of Union Bank of India, a large public sector Bank from June 2003 to June 2009, and Andhra Bank from 2011 to 2014. He was also Director on the Boards of Clearing Corporation of India, and continues to be on the Boards of Ujjivan Small Finance Bank, Cybertech Systems and Software Ltd and eMudhra Ltd. UP Awards & Honours (partial, not uptodate) : Given the \"Patron of CSI Mumbai Branch\" award in 2005 and the Computer Society of India (CSI) Fellowship award in 2006 Director, Board of Directors, Union Bank of India, Mumbai (2003 -) Director, Board of Directors, Clearing Corporation of India, Mumbai (2005 -) Director, Board of Directors, IDBI Intech Limited, Mumbai (2000 -2003) Member, Technical Advisory Committee, The Clearing Corporation of India (2002) Member of Rerserve Bank of India Steering Committee on IT Standardization, April 97. Chairman, Reserve Bank of India Committee on Standardization of System Software (for distributed Systems), Aug. 1997. Member of educational board of SNDT University, Bombay and DAV University, Indore, India Member, Accreditation Board for Engineering Studies. Member of Board of Studies, DOEACC Society (Department of Electronics, Govt of India, from 1999. UP Journal Editorship : Publications Chair, Computer Society of India, from 1998-2000 Member , Editor Board, Distributed and Parallel Databases - An International Journal, Kluwer Academic publishers, (from 1998 - 2005) Member, editorial board, World Wide Web : Internet and Web Information Systems, Kluwer Academic publishers (from May 2001 - 2006 ) www.wkap.nl/journals/wwwj Family Photos Kaushal Neha-Kaushal Grandson Yash",
  "content_length": 4784,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:15"
}