{
  "name": "Nandita Vijaykumar",
  "homepage": "http://www.cs.toronto.edu/~nandita",
  "status": "success",
  "content": "Nandita Vijaykumar Nandita Vijaykumar Assistant Professor, Computer Science, University of Toronto Faculty Member, Vector Institute embARC Research Group I am an assistant professor in the Computer Science Department at the University of Toronto and the Department of Computer and Mathematical Sciences at the University of Toronto Scarborough. I am currently a Research Scholar at Amazon. I am a faculty member at the Vector Institute for Artificial Intelligence. I am also a faculty member at the Acceleration Consortium and am affiliated with the Robotics Institute. I lead the embARC Research Group. I received my Ph.D. and M.S. in 2020 from Carnegie Mellon University where I was advised by Prof. Onur Mutlu and Prof. Phil Gibbons. I was fortunate to also work with the Systems Group in the Computer Science Department at ETH Zurich as a visiting student. In the past, I have also worked for AMD, Intel, Microsoft, and Nvidia. My group's research explores the intersection of computer systems/architecture with visual computing, including computer vision, robotics, and machine learning. I am particularly interested in building efficient, scalable, and programmable systems that enable machines to perceive, interpret, and interact with the physical world. Our work focuses on cross-stack co-design—spanning algorithms, compilers, runtimes, and hardware—for workloads such as 3D reconstruction, neural rendering, spatial perception, and generative models. Our research has been supported by industry and academic partners including Intel, AMD, LG, Sony, Rebellions AI, NSERC, MITACS, CentML, and CSE Canada. You can read more about my group's research here. I am currently looking to take new graduate students. Please apply directly to the graduate program at the Department of Computer Science. For undergraduate students interested in doing research with my group, please send me an email with your CV and transcripts. My group also has post-doctoral researcher positions available. If you are interested in the above topics, please send me an email. LinkedIn Google Scholar DBLP Up-to-date list here VoxelCache: Accelerating Online Mapping in Robotics and 3D Reconstruction Tasks Sankeerth Durvasula, Raymond Kigaru, Samarth Mathur, Jimmy Lin, Jenny Xu, and Nandita Vijaykumar PACT 2022 GPUPool: A Holistic Approach to Fine-Grained GPU Sharing in the Cloud Xiodan Serina Tan, Pavel Golikov, Nandita Vijaykumar, and Gennady Pekhimenko PACT 2022 CoordX: Accelerating Implicit Neural Representation with a Split MLP Architecture Ruofan Liang, Hongyi Sun, and Nandita Vijaykumar ICLR 2022 MetaSys: A Practical Open-source Metadata Management System to Implement and Evaluate Cross-layer Optimizations Nandita Vijaykumar, Ataberk Olgun, Konstantinos Kanellopoulos, F. Nisa Bostanci, Hasan Hassan, Mehrshad Lotfi, Phillip B. Gibbons, and Onur Mutlu ACM Transactions on Architecture and Code Optimization (TACO) 2022 GenStore: A High-Performance and Energy-Efficient In-Storage Computing System for Genome Sequence Analysis Nika Mansouri Ghiasi, Jisung Park, Harun Mustafa, Jeremie Kim, Ataberk Olgun, Arvid Gollwitzer, Damla Senol Cali, Can Firtina, Haiyu Mao, Nour Almadhoun Alserr, Rachata Ausavarungnirun, Nandita Vijaykumar, Mohammed Alser, and Onur Mutlu ASPLOS 2022 DAMOV: A New Methodology and Benchmark Suite for Evaluating Data Movement Bottlenecks Geraldo F. Oliveira, Juan Gomez-Luna, Lois Orosa, Saugata Ghose, Nandita Vijaykumar, Ivan fernandez, Mohammad Sadrosadati, and Onur Mutlu IEEE Access, September 2021 QUAC-TRNG: High-Throughput True Random Number Generation Using Quadruple Row Activation in Commodity DRAM Chips Ataberk Olgun, Minesh Patel, A. Giray Yaglikci, Haocong Luo, Jeremie S. Kim, F. Nisa Bostanci, Nandita Vijaykumar, Oguz Ergin, and Onur Mutlu ISCA 2021 SynCron: Efficient Synchronization Support for Near-Data-Processing Architectures Christina Giannoula, Nandita Vijaykumar, Nikela Papadopoulou, Vasileios Karakostas, Ivan Fernandez, Juan Gómez-Luna, Lois Orosa, Nectarios Koziris, Georgios Goumas, and Onur Mutlu HPCA 2021 Echo: Compiler-based GPU Memory Footprint Reduction for LSTM RNN Training Bojian Zheng, Nandita Vijaykumar, Gennady Pekhimenko ISCA 2020 SysScale: Exploiting Multi-domain Dynamic Voltage and Frequency Scaling for Energy Efficient Mobile Processors Jawad Haj-Yahya, Mohammed Alser, Jeremie Kim, A. Giray Yaglikci, Nandita Vijaykumar, Efraim Rotem, and Onur Mutlu ISCA 2020 Enhancing Programmability, Portability, and Performance with Rich Cross-Layer Abstractions Nandita Vijaykumar PhD Thesis, Carnegie Mellon University Slides (pptx) (pdf) SMASH: Co-designing Software Compression and Hardware-Accelerated Indexing for Efficient Sparse Matrix Operations Konstantinos Kanellopoulos, Nandita Vijaykumar, Christina Giannoula, Roknoddin Azizi, Skanda Koppula, Nika Mansouri Ghiasi, Taha Shahroodi, Juan Gomez-Luna, and Onur Mutlu MICRO 2019 CROW: A Low-Cost Substrate for Improving DRAM Performance, Energy Efficiency, and Reliability Hasan Hassan, Minesh Patel, Jeremie S. Kim, A. Giray Yaglikci, Nandita Vijaykumar, Nika Mansourighiasi, Saugata Ghose, and Onur Mutlu ISCA 2019 A Case for Richer Cross-layer Abstractions: Bridging the Semantic Gap with Expressive Memory Nandita Vijaykumar, Abhilasha Jain, Diptesh Majumdar, Kevin Hsieh, Gennady Pekhimenko, Eiman Ebrahimi, Nastaran Hajinazar, Phillip B. Gibbons, Onur Mutlu ISCA 2018Slides (pptx) (pdf) Lightning Talk Slides (pptx) (pdf) Lightning Talk Video The Locality Descriptor: A Holistic Cross-Layer Abstraction to Express Data Locality in GPUs Nandita Vijaykumar, Eiman Ebrahimi, Kevin Hsieh, Phillip B. Gibbons, Onur Mutlu ISCA 2018 Slides (pptx) (pdf) Lightning Talk Slides (pptx) (pdf) Lightning Talk Video Gaia: Geo-Distributed Machine Learning Approaching LAN Speeds Kevin Hsieh, Aaron Harlap, Nandita Vijaykumar, Dimitris Konomis, Gregory R. Ganger, Phillip B. Gibbons, Onur Mutlu NSDI 2017 SoftMC: A Flexible and Practical Open-Source Infrastructure for Enabling Experimental DRAM Studies Hasan Hassan, Nandita Vijaykumar, Samira Khan, Saugata Ghose, Kevin Chang, Gennady Pekhimenko, Donghyuk Lee, Oguz Ergin, Onur Mutlu HPCA 2017 Zorua: A Holistic Approach to Resource Virtualization in GPUs Nandita Vijaykumar, Kevin Hsieh, Gennady Pekhimenko, Samira Khan, Ashish Shrestha, Saugata Ghose, Adwait Jog, Phillip B. Gibbons, Onur Mutlu MICRO 2016 Slides (pptx) (pdf) Lightning Session Slides (pptx) (pdf)Poster (pdf) Accelerating Pointer Chasing in 3D-Stacked Memory: Challenges, Mechanisms, Evaluation Kevin Hsieh, Samira Khan, Nandita Vijaykumar, Kevin K. Chang, Amirali Boroumand, Saugata Ghose, Onur Mutlu ICCD 2016 Transparent Offloading and Mapping (TOM): Enabling Programmer-Transparent Near-Data Processing in GPU Systems Kevin Hsieh, Eiman Ebrahimi, Gwangsun Kim, Niladrish Chatterjee, Mike O'Connor, Nandita Vijaykumar, Onur Mutlu, Stephen Keckler ISCA 2016 ChargeCache: Reducing DRAM Latency by Exploiting Row Access Locality Hasan Hassan, Gennady Pekhimenko, Nandita Vijaykumar, Vivek Seshadri, Donghyuk Lee, Oguz Ergin, Onur Mutlu HPCA 2016 A Case for Toggle-Aware Compression for GPU Systems Gennady Pekhimenko, Evgeny Bolotin, Nandita Vijaykumar, Onur Mutlu, Todd C. Mowry, Stephen W. Keckler HPCA 2016 A Case for Core-Assisted Bottleneck Acceleration in GPUs: Enabling Flexible Data Compression with Assist Warps Nandita Vijaykumar, Gennady Pekhimenko, Adwait Jog, Abhishek Bhowmick, Rachata Ausavarungnirun, Chita Das, Mahmut Kandemir, Todd C. Mowry, and Onur Mutlu ISCA 2015 Slides (pptx) (pdf) Lightning Session Slides (pptx) (pdf) Decoupling the Programming Model from Resource Management in Throughput Processors Nandita Vijaykumar, Kevin Hsieh, Gennady Pekhimenko, Samira Khan, Ashish Shrestha, Saugata Ghose, Adwait Jog, Phillip B. Gibbons, Onur Mutlu Many Core Computing: Hardware and Software, IET, 2019. arXiv.org version, May 2018. A Framework for Accelerating Bottlenecks in GPU Execution with Assist Warps Nandita Vijaykumar, Gennady Pekhimenko, Adwait Jog, Abhishek Bhowmick, Rachata Ausavarungnirun, Chita Das, Mahmut Kandemir, Todd C. Mowry, Onur Mutlu Invited Book Chapter in Advances in GPU Research and Practice, Morgan Kaufmann, 2016. arXiv.org version, February 2016. nandita@cs.toronto.edu Admin contact Design: TEMPLATED Images: Unsplash (CC0)",
  "content_length": 8313,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:15"
}