{
  "name": "Nannan Wang 0001",
  "homepage": "https://web.xidian.edu.cn/nnwang",
  "status": "success",
  "content": "王楠楠 | 个人信息 | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 王楠楠的留言板 王楠楠的主页:个人信息科学研究科研论文荣誉奖励科研团队课程教学招生信息English 基本信息 王楠楠，教授，博士生导师 博士招生学科：信息与通信工程 (通信工程学院，多媒体信息理论方向)智能科学与技术 (人工智能学院)硕士学科：专硕：电子信息 (085401)学硕：通信与信息系统（多媒体信息理论方向）空天地一体化综合业务网(ISN)全国重点实验室 联系方式通信地址：西安市雁塔区太白南路二号西安电子科技大学北校区119信箱电子邮箱：nnwang AT  xidian.edu.cn办公地点：老科技楼A409 个人简介王楠楠，华山学者领军教授（培育），博士生导师，空天地一体化综合业务网全国重点实验室副主任。在IEEE TPAMI、IJCV、CVPR、ICCV等期刊和会议上发表论文150余篇，授权专利40余项，实现专利转化7项，牵头制定行业标准2项、参与制定国际国家标准4项，获中国图象图形学学会自然科学奖一等奖(R1)、教育部自然科学奖一等奖(R2)、陕西省科学技术奖一等奖(R5)、陕西青年科技奖、中国人工智能学会优秀博士学位论文、陕西省优秀博士学位论文等奖项；主持国家自然科学基金优秀青年基金项目、联合基金重点项目等项目。目前是陕西省科技创新团队负责人，担任国际期刊Visual Computer的Co-Editor-in-Chief以及Neural Networks编委等，同时担任中国电子学会青年科学家俱乐部会员，VALSE常务领域主席（http://valser.org/），中国图象图形学学会学术工委委员、青年工作委员会执行委员，中国计算机学会计算机视觉专委会委员、人工智能专委会委员、多媒体专委会委员，中国人工智能学会模式识别专委会委员，中国图象图形学学会多媒体专委会委员、遥感图像专委会委员等。  团队快讯​​​​​ 2025.11，祝贺实验室何潇、何凌峰、郭凯三位研究生的AAAI 2026论文录取，2篇论文为底层视觉问题，另外1篇探讨持续学习问题：(1) Mixture of Ranks with Degradation-Aware Routing for one-Step Real-World Image Super-Resolution（设计动态MOE来适应不同输入质量的图像以提高重建效果）(2) Harnessing Textual Semantic Priors for Knowledge Transfer and Refinement in CLIp-Driven Continual Learning (大模型的持续学习) (3) Revealing the Invisible: Latent StructureModeling for Semantically Consistent Cloud Removal（去云）！ 2025.10，祝贺实验室胡永杰、陈建航、韦磊、徐一搏、许志鹏、何凌峰六位研究生获得本年度国家奖学金！ 2025.09，入选斯坦福大学发布的“全球前2%顶尖科学家榜单（2025年版）”的“终身影响力榜单”和“年度影响力榜单”（连续六年）！ 2025.09，祝贺李航宇博士录取IEEE TPAMI期刊论文一篇：An Enhanced Adaptive Confidence Margin for Semi-Supervised Facial Expression Recognition！攻读博士期间投出，历经投出->大修->大修->拒稿->修改重投->小修->录取的三年经历，为博士期间工作画上圆满句号！ 2025.08，受邀担任Computer Graphics International (CGI) 2026程序委员会主席！ 2025.08，祝贺博士生刘良辰录取IEEE TPAMI期刊论文一篇：Frequency-based Comprehensive Prompt Learning for Vision-Language Models！ 2025.07，祝贺硕士生胡永杰录取ACM MM会议论文一篇：CADQ: Attribute-Consistent Face Cartoonization with Cross-modal Aligned and Deformable Quantization！ 2025.06，祝贺团队录取4篇ICCV 2025论文：(1)Q-Norm: Robust Representation Learning via Quality-Adaptive Normalization、(2) 3D Test-time Adaptation via Graph Spectral Driven Point Shift、(3) DIH-CLIP: Unleashing the Diversity of Multi-Head Self-Attention for Training-Free Open-Vocabulary Semantic Segmentation、(4) Dual Domain Control via Active Learning for Remote Sensing Domain Incremental Object Detection！ 2025.06，祝贺李航宇博士获得校优秀博士学位论文奖，石超华、徐怡颔、台海春、赵若愚硕士学位论文获得校优秀硕士学位论文奖！同时祝贺刘良辰博士和11位硕士同学毕业并奔赴祖国各地，祝大家事业有成、生活幸福！ 2025.06.11，受华为邀请做罗马广场高端论坛2小时学术报告：面向边端高效推理的模型轻量化！ 2025.05.19，获得华为火花奖，针对复杂场景下的场景识别与目标检测提出一种通过图像重建的思路提高识别率与检测精度！ 2025.05.12，团队获批陕西省科技创新团队--视觉内容生成与可信分析！ 2025.05.01，团队在ICML 2025上录取3篇论文，祝贺博士生程坤与何潇(生成模型：Diff-MoE: Diffusion Transformer with Time-Aware and Space-Adaptive Experts)、博士生刘良辰（大模型提示学习：Surrogate Prompt Learning: Towards Efficient and Diverse Prompt Learning for Vision-Language Models）、硕士生徐一搏（可信学习：Phase and Amplitude-aware Prompting for Enhancing Adversarial Robustness）！ 2025.04，团队录取2篇IJCV（International Journal of Computer Vision, CCF-A类期刊）论文，祝贺周大为博士、程德副教授与何凌峰同学！主题分别为可信学习、无监督跨域识别。 2025.03，团队获批陕西省三秦学者特支计划创新团队--视觉内容生成与可信分析，祝贺！ 2025.02.27，祝贺团队4篇论文被计算机视觉领域顶级会议CVPR录取！内容涉及大模型提示词优化、多模态语义对齐、弱监督语义理解及视频行为分析! 2025.02.22，祝贺博士生何潇获华为创新先锋一等奖，表彰其在与华为的合作项目中快速推理算法落地于华为移动终端产品中所作贡献！ 2025.02.06，祝贺博士生周大为录取IEEE TPAMI论文一篇：Improving Adversarial Training from the Perspective of Class-Flipping Distribution！同时祝贺其博士毕业并在澳门城市大学担任助理教授一职！ 2024.12.10, 课题组程坤、周诺言、许家华三位同学和高飞、刘德成、程德三位老师各喜提一篇AAAI论文，研究主题为可信、高效的生成模型架构及生成质量评价，祝贺！​ 2024.11，祝贺课题组获得中国图象图形学学会自然科学一等奖！（跨域图像内容生成理论与方法，完成人：王楠楠，高新波，张凯兵，朱明瑞，李洁） 2024.11，祝贺课题组八位同学获得国家奖学金：刘良辰、何潇、夏瑞阳、赵若愚、台海春、董士银、胡雨松、赵宇鑫 版权声明 未经西安电子科技大学以及个人主页教师本人许可，不得复制、转载和传播本页内容，禁止用于任何商业用途。如需转载请征得主页所有者同意，并附上主页链接！ 更新 王楠楠的留言板 技术支持：电院网络中心陕ICP备05016463号-3© 2025 西安电子科技大学",
  "content_length": 3625,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:15"
}