{
  "name": "Nantheera Anantrasirichai",
  "homepage": "https://pui-nantheera.github.io",
  "status": "success",
  "content": "Pui's webpage Dr Nantheera Anantrasirichai (Pui) Associate Professor in Visual Computing 3.20, Merchant Venturers Building, University of Bristol Bristol, BS8 1UB, UK eexna*at*bris.ac.uk About I am an Associate Professor in the School of Computer Science at the University of Bristol (UoB), a member of the management team of the Bristol Vision Institute, and a member of the Visual Information Laboratory, led by Prof. Alin Achim. I have been involved in many projects across multiple disciplines, including telecommunications, biology, optometry, clinical sciences, biochemistry, mechanical engineering, psychology, and geoscience. I lead the work package AI Workflows for Challenging Acquisition Environments as part of MyWorld, led by Prof. David Bull, which strengthens the world-leading position of creative technologies in the southwest region. Additionally, I am a key scientist at the Centre for the Observation and Modelling of Earthquakes, Volcanoes, and Tectonics (COMET). Regarding teaching duties, I am the Programme Director of the MSc Immersive Technologies (Virtual and Augmented Reality) and teach Advanced Visual AI (Y4) . Opportunities PhD Scholarship funded by UoB/EPSRC: Project 'Intelligent Video Restoration and Enhancement via a Large Prior Database' PhD Scholarship funded by UoB: University of Bristol Postgraduate Research Scholarships. Please send me your CV and transcripts. Research Interests Image and video analysis Image and video enhancement Object detection and tracking 3D representation Machine learning Inverse problem Remote sensing Medical imaging Highlights UW-GS: Distractor-Aware 3D Gaussian Splatting for Enhanced Underwater Scene Reconstruction and DaBiT: Depth and blur informed transformer for video deblurring are presenting at WACV2025 Low-light Video Enhancement with Conditional Diffusion Models and Wavelet Interscale Attentions won the best paper award at ACM SIGGRAPH CVMP BVI-Lowlight: Fully registered datasets for low-light image and video enhancement Updated review paper: Artificial Intelligence in Creative Industries: Advances Prior to 2025 News & Activities 2025-2027: EURASIP TAC (Second Term) Biomedical Image & Signal Analytics 29 April 2025: Invited talk: EGU 12 Mar 2024: Invited talk: AI for Visual Data at CenSoF 12 Feb 2024: New project! MyUnderwaterWorld 31 Oct 2023: New dataset! BVI-Lowlight Fully registered video dataset 5 Oct 2023: Invited speaker at Bringing Space Down to Earth 1 Jun 2023: New project! Object recognition under heat haze environment 1 Mar 2023: Invited talk AI-based Image Processing for Challenging Natural Data Previous News & Activities: see here BVI-Lowlight datasets Projects Production Workflow for Challenging Environments Intelligent Video Restoration and Enhancement Low-Light Enhancement and Denoising Underwater Enhancement & 3D Representation Atmospheric Turbulence Removal [Model-based] Atmospheric Turbulence Removal [AI-based] Medical and Biological Image Computing B-Line Quantification in Lung Ultrasound Images Computer Assisted Analysis of Ocular Imaging Multi-modal Medical Image Registration Parasitic Egg Detection and Classification Deep Learning for Computational Microscopy Computational Imaging in Remote Sensing Automated Alert System for Volcanic Unrest Dynamic Ground Motion Map of the UK Ground Movement Monitoring along the Rail Corridor River Planform Extraction in SAR Image Fusion Computer Vision for Robotics Real Time Inspection of Wind Turbine Blade Health Bio-inspired Visual Framework for Autonomous Locomotion Terrain Analysis for Robotics Fixation Prediction Fast Depth Estimation for View Synthesis More projects and details: see here Publications For all my papers, see both google scholar and university site Google Scholar research-information.bris.ac.uk Selected papers Unsupervised anomaly detection for volcanic deformation in InSAR imagery. R Popescu, N Anantrasirichai, J Biggs, Earth and Space Science, 2025 [PDF] Feature Denoising For Low-Light Instance Segmentation Using Weighted Non-Local Blocks. J Lin, N Anantrasirichai, D Bull, ICASSP 2025 [PDF] UW-GS: Distractor-Aware 3D Gaussian Splatting for Enhanced Underwater Scene Reconstruction. H Wang, N Anantrasirichai, F Zhang, D Bull, WACV 2025 [PDF] [Code] [Project] DeTurb: Atmospheric Turbulence Mitigation with Deformable 3D Convolutions and 3D Swin Transformers. Z Zou, N Anantrasirichai, ACCV 2024 [PDF] [Code] [Project] TaGAT: Topology-Aware Graph Attention Network For Multi-modal Retinal Image Fusion. X Tian, N Anantrasirichai, L Nicholson, A Achim. MICCAI 2024 [PDF] [Code] [Dataset] [Project] Learning Ground Displacement Signals Directly from InSAR-Wrapped Interferograms. L Moualla, A Rucci, G Naletto, N Anantrasirichai. Sensors. 2024 [PDF] Parasitic Egg Detection and Classification in Low-cost Microscopic Images using Transfer Learning. T Suwannaphong, S Chavana, S Tongsom, D Palasuwan, T H Chalidabhongse, and N Anantrasirichai. SN Computer Science. 2023 [PDF] [Dataset] Current Advances in Computational Lung Ultrasound Imaging: A Review. T. Yang, O. Karakuş, N. Anantrasirichai, and A. Achim. IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control. 2023.[PDF] ICIP 2022 Challenge on Parasitic Egg Detection and Classification in Microscopic Images: Dataset, Methods and Results. N Anantrasirichai, TH Chalidabhongse, D Palasuwan, K Naruenatthanaset, T Kobchaisawat, N Nunthanasup, K Boonpeng, X Ma, and A Achim. IEEE International Conference on Image Processing. 2022. [PDF] [Dataset] [Website] Detecting Ground Deformation in the Built Environment using Sparse Satellite InSAR data with a Convolutional Neural Network. N. Anantrasirichai, J. Biggs, K. Kelevitz, Z. Sadeghi, T. Wright, J. Thompson, A. Achim and D. Bull. IEEE Transactions on Geoscience and Remote Sensing. 2020.[PDF] [Project] Image fusion via sparse regularization with non-convex penalties. N. Anantrasirichai, R. Zheng, I. Selesnick and A. Achim. Pattern Recognition Letters. 2020. [PDF] [CODE] River Planform Extraction From High-Resolution SAR Images Via Generalised Gamma Distribution Superpixel Classification. O. Pappas, N. Anantrasirichai, A. Achim and B. Adams. IEEE Transactions on Geoscience and Remote Sensing. 2020.[PDF] Detection of Line Artefacts in Lung Ultrasound Images of COVID-19 Patients via Non-Convex Regularization. O. Karakuş, N. Anantrasirichai, A. Aguersif, S. Silva, A. Basarab and A Achim. IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control. 2020.[PDF] [BibTeX] [CODE] The Application of Convolutional Neural Networks to Detect Slow, Sustained Deformation in InSAR Timeseries. N. Anantrasirichai, J. Biggs, F. Albino, and David Bull. Geophysical Research Letters. 2019. [PDF] [BibTeX] [Project] A Deep Learning Approach to Detecting Volcano Deformation from Satellite Imagery using Synthetic Datasets. N. Anantrasirichai, J. Biggs, F. Albino, and David Bull. Remote Sensing of Environment. 2019. [PDF] [BibTeX] [CODE] [Project] More papers: see here Download Datasets BVI-RLV: Fully Registered Low-Light Videos BVI-LOWLIGHT: Dataset for Low-Light Image Denoising [Paper] BVI-Turb: Atmospheric Turbulence Dataset BVI-Coral: Underwater scenes for 3D reconstruction [Paper] OCT2Confocal: in-vivo OCT and ex-vivo confocal retinal images [Paper] ICIP 2022 Challenge: Parasitic Egg Detection and Classification in Microscopic Images [Paper] Chula-parasitic-eggs: Parasitic Egg Detection and Classification in Low-cost Microscopic Images [Paper] LICS Dataset for Volcanic Deformation Classification [Paper] Find more code and datasets here.",
  "content_length": 7591,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:16"
}