{
  "name": "Naoaki Okazaki",
  "homepage": "http://www.nlp.c.titech.ac.jp/index.en.html",
  "status": "success",
  "content": "Okazaki Laboratory | Okazaki Laboratory at Tokyo Institute of Technology Okazaki Laboratory Okazaki Laboratory focuses on Natural Language Processing (NLP) in Artificial Intelligence Course, Department of Computer Science, School of Computing, Institute of Science Tokyo. AiTech Seminar: Mr. Ryo Kamoi Mr. Ryo Kamoi from The Pennsylvania State University visited our lab and presented a guest talk. (2025-11-17) AiTech Seminar: Mr. Issa Sugiura Mr. Issa Sugiura from Kyoto University visited our lab and presented a guest talk. (2025-11-10) Paper at Journal of Natural Language Processing We have a paper accepted at the Journal of Natural Language Processing. (2025-11-10) Awards at JSAI2025 Taihei Shiotani’s presentation at the The 39th Annual Conference of the Japanese Society for Artificial Intelligence (JSAI 2025) received the JSAI Annual Conference Award. (2025-11-06) AiTech Seminar: Prof. Iryna Gurevych Prof. Iryna Gurevych from TU Darmstadt visited our lab and presented a guest talk. (2025-10-17) New members We welcome new members, Saki Furutani (staff) and Ayumi Sato (staff). (2025-10-01) New members We welcome new members, Vincent Phelipot (M1), and Donghui Lim (YSEP). (2025-09-29) Farewell Party We held a farewell party at Meguro Uokin for An Wang-san and Sangwhan Moon-san. (2025-09-22) Awards at YANS2025 Tatsuya Ichinose and Hinari Shimada’s presentations at the YANS (Young Researcher Association for NLP Studies) 2025 received the Sponsorship Award offered by CyberAgent, Inc and Polaris.AI, respectively. Koshiro Saito’s team received the Examiner Special Award in Hackathon. (2025-09-19) Accepted research proposals (ACT-X) The research proposals of Eri Onami and Youmi Ma have been accepted by the FY2025 Strategic Basic Research Programs (ACT-X). (2025-09-18) Presentation at YANS2025 We have 6 presentations at the YANS (Young Researcher Association for NLP Studies) 2025. (2025-09-16) Welcome Party We held a welcome party for Saito-sensei and Ota-san. (2025-09-08) New members We welcome new members, Prof. Itsumi Saito as Specially Appointed Associate Professor and Prof. Daisuke Oba with his new title as Specially Appointed Assistant Professor. (2025-09-01) Paper at EMNLP 2025 We have 2 papers accepted at EMNLP 2025. (2025-08-21) Paper at Computational Linguistics We have a paper accepted at Computational Linguistics. (2025-08-15) Paper at MELT 2025 We have a paper accepted at The 1st Workshop on Multilingual and Equitable Language Technologies (MELT). (2025-08-08) Farewell Party We held a farewell party at 2Jill Gakudai for Konishi-san. (2025-07-24) Selected for Nippon Foundation HUMAI Program Fellowship Eri Onami has been selected as a recipient of the Category C Fellowship in the first cohort of the Nippon Foundation HUMAI Program. (2025-07-20) Paper at COLM 2025 We have a paper accepted at The Second Conference On Language Modeling (COLM). (2025-07-08) Paper at Tokshop We have a paper accepted at Tokenization Workshop @ ICML 2025. (2025-06-11) BBQ Party We held a BBQ party at Dejikyu BBQ terrace Don Quixote Mizonokuchi Station shop. (2025-06-08) AiTech Seminar: Dr. Ayana Niwa Dr. Ayana Niwa from MBZUAI visited our lab and presented a guest talk. (2025-06-02) To be presented at JSAI2025 We will present a paper at the 39th Annual Conference of the Japanese Society for Artificial Intelligence. (2025-05-27) AiTech Seminar: Dr. Masaru Isonuma Dr. Masaru Isonuma from NII LLMC/Tohoku University visited our lab and presented a guest talk. (2025-05-19) News archive",
  "content_length": 3529,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:16"
}