{
  "name": "Naomi Feldman",
  "homepage": "https://users.umiacs.umd.edu/~nhf",
  "status": "success",
  "content": "Naomi Feldman home  |  advisees  |  papers  |  arrangements Naomi Feldman 1401 Marie Mount Hall College Park, MD 20742 (301) 405-5800 nhf (at) umd (dot) edu I'm on sabbatical for the 2025-2026 academic year and am categorically declining review requests, committee invitations, and so on. I'm a professor in the Department of Linguistics and the Institute for Advanced Computer Studies at the University of Maryland with a focus in computational psycholinguistics. My research uses methods from statistics, machine learning, and automatic speech recognition to formalize questions about how people learn and represent the structure of their language. I primarily use these methods to study speech representations, modeling the cognitive processes that support learning and perception of speech sounds in the face of highly complex and variable linguistic input. I also computationally characterize the strategies that facilitate language acquisition more generally, both from the perspective of learners, and from the perspective of clinicians. I'm affiliated with the Computational Linguistics and Information Processing Lab, the Department of Computer Science, and the Program in Neuroscience and Cognitive Science. I'm an active member of the university's interdisciplinary Language Science community. I regularly interact with researchers from multiple other departments, multiple times a week, which makes it easy to develop research projects that cross disciplinary boundaries. You can read about some current projects here and here and some recent research findings here and here. Prospective graduate students: I can advise students through the graduate programs in linguistics, NACS (neuroscience and cognitive science), and computer science. I look at applications for all three programs. I'm always open to taking new PhD students, so please apply if you're interested. You can also check whether you're eligible for any of the graduate school's application fee waivers. Linguistics and NACS are almost exactly equivalent to each other in terms of chances of admission, funding options, flexibility, etc. for students who want to work with me. Just apply to the program whose coursework and degree you're most excited about, and list me as a possible advisor when you submit your application. Computer science is a bit different, in that fit to a particular advisor is only weakly taken into account in the admissions process. Students often come in without knowing who their research advisor is going to be, get to know several research areas (and faculty members) through coursework, and only find an advisor once they're well into their first or second year. If you're specifically interested in cognitive modeling, please do still list me as a possible advisor and make sure it's clear at the beginning of your statement of purpose that cognitive science is a research interest of yours. Undergraduates who want to do research: University of Maryland undergraduates who have interests in both language science and math/computer science are welcome to get in touch about research opportunities. Please include information about your background (e.g., your major/minor, year in the program, unofficial transcript, any other relevant experience) and what you're hoping to learn. I do look for evidence that you've taken initiative to pursue your relevant interests, but it's ok if you haven't had previous research experience. See here, here, here, and here for examples of publications that undergraduates have co-authored in the past. I'm in a web comic! I play the role of \"some girl\" at Brown University.",
  "content_length": 3620,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:18"
}