{
  "name": "Naouel Moha",
  "homepage": "https://www.etsmtl.ca/recherche/professeurs-chercheurs/nmoha",
  "status": "success",
  "content": "Moha, Naouel - ÉTS Montréal Accueil Étudier à l'ÉTS Corps professoral Moha, Naouel Naouel Moha Professeure Département Département de génie logiciel et TI Bureau A-4499 Courriel naouel.moha@etsmtl.ca Axes de recherche Systèmes intelligents et autonomes Systèmes logiciels, multimédia et cybersécurité Expertises Qualité, maintenance et évolution du logiciel Analyse de systèmes logiciels Systèmes orientés objets, services et mobiles Anti-patrons et patrons de conception Refactorisation des logiciels Méta-modélisation Internet des objets (IdO) Sécurité logicielle et vulnérabilités Intelligence artificielle pour le génie logiciel Cours MGL802 Principes et applications de la conception de logiciels 3 crédits Été 2025 Encadrements Thèse de doctorat (recherche appliquée) En codirection avec : Yann-Gaël GuéhéneucA Machine Learning–Based Framework to Support Monoliths to Microservices Migration: From Identification to Packaging and Deployment, par Imen TrabelsiÉté 2025En codirection avec : Quentin StiévenartAméliorer les Systèmes d'IA par l'Optimisation Automatisée, par Brahim MahmoudiHiver 2026 Mémoire à 30 crédits En codirection avec : Julien Gascon-SamsonOptimisation des performances des systèmes IdO basés sur les microservices grâce aux meilleures pratiques : revue et étude empirique, par Yahia El FellahHiver 2024En codirection avec : Ghizlane El boussaidiAnalyse et détection des patrons architecturaux dans les applications mobiles à l'aide des techniques d'apprentissage automatique, par Chaima ChekhabaHiver 2023En codirection avec : Yann-Gaël GuéhéneucÉtude de la qualité architecturale et de l’implémentation des logiciels pour l’IoT, par Nour KhezemiHiver 2024En codirection avec : Manel AbdellatifMigration des systèmes à base d'intelligence artificielle vers les moicroservices, par Hakim GhlissiAutomne 2025En codirection avec : Florent AvellanedaAmélioration des techniques de génération de traces d’exécution sur des systemes logiciels pour la détection dynamique de défauts de code, par Houcine Abdelkader CheriefAutomne 2025 Projet d'application à 15 crédits Création d’un modèle intelligent pour la détection de défauts de codes spécifiques aux systèmes d’IA, par Yasser KhelfiAutomne 2025En codirection avec : Manel AbdellatifMigration des systèmes à base d'intelligence artificielle vers les microservices, par Mohamed El Hadi BoukhatemAutomne 2025Identification de patrons et d’anti-patrons dans les systèmes à base de microservices, par Yubo ZhouAutomne 2021Microbuilder : un outil automatisé pour la migration de systèmes monolithiques vers une architecture microservices, par Ilan PipernoAutomne 2022Utilisation de l’intelligence artificielle afin d’automatiser l’identification des microservices lors de la migration d’un système monolithique, par Lucas GeffardAutomne 2022Génération automatisée de cas de test End-to-End pour les systèmes IoT, par Zacharie Chenail-LarcherHiver 2025 Projet d'intervention en entreprise à 15 crédits En codirection avec : Sylvie TrudelÉtude de l'application de l'approche Agile dans l'analyse des besoins et la rédaction des spécifications, par Imane GridAutomne 2025Conception et évolution d'applications web dans une chaîne CI/CD en contexte agile, par Grégory PitittoAutomne 2025Structuration et optimisation du cyle de vie de développement logiciel, par Guillaume BelloneHiver 2026En codirection avec : Véronique De LestrangeAméliorations du processus de mise en service des nouvelles fonctionnalités de l'application \"Ma Livebox\" d'ORANGE en mode Agile, par Mathieu AudebrandÉté 2021Supervision des infrastructures des outils du SOC et du CERT, par Alexandre GiardHiver 2023Biométrie comportementale d’un utilisateur pour la sécurité des systèmes d'information, par Thomas LavigneHiver 2023Développement logiciel et configuration de réseaux auto-organises centralisés, par Younes RamadiHiver 2025Développement et maintenance d’une application de gestion interne du LAB’SOLUTEC, par Félix BertagnolioHiver 2025En codirection avec : Sylvie TrudelL'optimisation de l'agilité de la Direction des technologies au sein de la BNCK, par Nawfal Doukkali Al-AmajidiÉté 2025Export et import de la norme S1000D, par Jordan LambertÉté 2025 Stage industriel et rapport technique, 3 cr. La complexité du développement des logiciels bancaires de haute performance en mode agile, par Nathan Babaka KinalendeleÉté 2023Analyse et étude des besoins du département M&E d'EBC pour magasiner une nouvelle solution efficace, par Rima MeddourÉté 2023Développement et automatisation des tests- Expérience au sein du Mouvement Desjardins, par Abderraouf MaalimÉté 2024Évaluation et amélioration de l’application logicielle HCCM de D-BOX, par Jamal OufkirÉté 2024Le projet de migration des systèmes de communication radio de la Gendarmerie royale du Canada, par Kawther Ghania MakreloufAutomne 2024Développement au sein d’un système en transition de monolithe vers les micro-services. Expérience au sein d’Ubisoft Montréal, par Richard MartinÉté 2025 Rapport technique à 6 crédits Détection des défauts de code IA dans les systèmes logiciels à base de modèles de langage de grande taille (LLM), par Tiziri BouayadAutomne 2025 Rapport technique II, à 3 crédits Développer et intégrer un système d'apprentissage automatique, par Jamal OufkirÉté 2024 Projet en entreprise, 9 cr. Automatisation et intelligence artificielle à Loto-Québec, par Thomas DelunelÉté 2025 Publications Article publié dans une revue, révisé par les pairs 31 Manel Abdellatif, Naouel Moha, Yann-Gaël Guéhéneuc, Hafedh Mili, Ghizlane El boussaidi. 2025 « Identifying reusable services in legacy object-oriented systems: A type-sensitive identification approach ». IEEE Transactions on Software Engineering vol. 51 , nº 10. p. 2879-2899Nour Khezemi, Sikandar Ejaz, Naouel Moha, Yann-Gaël Guéhéneuc. 2025 « A comparison of code quality metrics and best practices in non-IoT and IoT systems ». Internet of Things vol. 34Jean Baptiste Minani, Yahia El Fellah, Fatima Sabir, Naouel Moha, Yann-Gael Gueheneuc, Martin Kuradusenge, Tomoaki Masuda. 2025 « IoT systems testing: Taxonomy, empirical findings, and recommendations ». Journal of Systems and Software vol. 226Jean Baptiste Minani, Fatima Sabir, Naouel Moha, Yann-Gaël Guéhéneuc, Tomoaki Masuda. 2025 « TISSEA: A framework for testing IoT systems based on technical software engineering aspects ». IEEE Internet of Things JournalImen Trabelsi, Brahim Mahmoudi, Jean Baptiste Minani, Naouel Moha, Yann-Gaël Gueheneuc. 2025 « A systematic literature review of machine learning approaches for migrating monolithic systems to microservices ». IEEE Transactions on Software EngineeringNour Khezemi, Jean Baptiste Minani, Fatima Sabir, Naouel Moha, Yann-Gael Gueheneuc, Ghizlane El Boussaidi. 2024 « A systematic literature review of IoT system architectural styles and their quality requirements ». IEEE Internet of Things Journal vol. 11 , nº 23. p. 37599-37616Jean Baptiste Minani, Fatima Sabir, Naouel Moha, Yann-Gael Gueheneuc. 2024 « A multi-method study of internet of things systems testing in industry ». IEEE Internet of Things Journal vol. 11 , nº 1. p. 1662-1684Jean Baptiste Minani, Fatima Sabir, Naouel Moha, Yann-Gaël Gueheneuc. 2024 « A systematic review of IoT systems testing: Objectives, approaches, tools, and challenges ». IEEE Transactions on Software Engineering vol. 50 , nº 4. p. 785-815Dimitri Prestat, Naouel Moha, Roger Villemaire, Florent Avellaneda. 2024 « DynAMICS: A tool-based method for the specification and dynamic detection of Android behavioral code smells ». IEEE Transactions on Software Engineering vol. 50 , nº 4. p. 765-784Hocine Rebatchi, Tegawendé F. Bissyandé, Naouel Moha. 2024 « Dependabot and security pull requests: large empirical study ». Empirical Software Engineering vol. 29 , nº 5Rafik Tighilt, Manel Abdellatif, Imen Trabelsi, Loïc Madern, Naouel Moha, Yann-Gaël Guéhéneuc. 2023 « On the maintenance support for microservice-based systems through the specification and the detection of microservice antipatterns ». Journal of Systems and Software vol. 204Imen Trabelsi, Manel Abdellatif, Abdalgader Abubaker, Naouel Moha, Sébastien Mosser, Samira Ebrahimi-Kahou, Yann-Gael Gueheneuc. 2023 « From legacy to microservices: A type-based approach for microservices identification using machine learning and semantic analysis ». Journal of Software: Evolution and Process vol. 35 , nº 10Dimitri Prestat, Naouel Moha, Roger Villemaire. 2022 « An empirical study of Android behavioural code smells detection ». Empirical Software Engineering vol. 27 , nº 7Fatima Sabir, Yann-Gael Gueheneuc, Francis Palma, Naouel Moha, Ghulam Rasool, Hassan Akhtar. 2022 « A Mixed-method approach to recommend corrections and correct REST antipatterns ». IEEE Transactions on Software Engineering vol. 48 , nº 11. p. 4319-4338Arthur D. Sawadogo, Tegawendé F. Bissyandé, Naouel Moha, Kevin Allix, Jacques Klein, Li Li, Yves Le Traon. 2022 « SSPCatcher: Learning to catch security patches ». Empirical Software Engineering vol. 27 , nº 6Sarra Habchi, Naouel Moha, Romain Rouvoy. 2021 « Android code smells: From introduction to refactoring ». Journal of Systems and Software vol. 177Timothé Riom, Arthur Sawadogo, Kevin Allix, Tegawendé F. Bissyandé, Naouel Moha, Jacques Klein. 2021 « Revisiting the VCCFinder approach for the identification of vulnerability-contributing commits ». Empirical Software Engineering vol. 26 , nº 3Manel Abdellatif, Rafik Tighilt, Abdelkarim Belkhir, Naouel Moha, Yann-Gäel Guéhéneuc, Éric Beaudry. 2020 « A multi-dimensional study on the state of the practice of REST APIs usage in Android apps ». Automated Software Engineering vol. 27. p. 187-228Benjamin Benni, Sébastien Mosser, Naouel Moha, Michel Riveill. 2019 « A delta-oriented approach to support the safe reuse of black-box code rewriters ». Journal of Software: Evolution and Process vol. 31 , nº 8Hayet Brabra, Achraf Mtibaa, Fabio Petrillo, Philippe Merle, Layth Sliman, Naouel Moha, Walid Gaaloul, Yann-Gäel Gué",
  "content_length": 33428,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:21"
}