{
  "name": "Naphtali David Rishe",
  "homepage": "http://cake.fiu.edu/Rishe",
  "status": "success",
  "content": "Dr. Naphtali David Rishe Cover of the FIU Fall 2026 Magazine: Shonda and Shalisha Witherspoon and Dr. Rishe Cover of the 2016 NSF Breakthroughs Compendium: CAKE Center Cover of the 2014 NSF Breakthroughs Compendium Naphtali David Rishe, Ph.D. The inaugural Outstanding University Professor, Florida International University Fellow, National Academy of Inventors Founding Director, NSF Industry/University Cooperative Research Center for Advanced Knowledge Enablement at FIU, FAU, and Greenwich U Director, FIU High Performance Database Research Center Director, Geospatial Laboratory Author:4 books on database design, geography, and interfaces. Author:430 papers in journals and proceedings (citations: 6900, h-index: 39, i10 index: 130). Editor:9 books on database management, high performance computing, fuzzy logic, and health informatics. Inventor:30 U.S. patents on database querying, semantic database performance, Internet data extraction, health informatics, and transportation.     Dr. Rishe is the most prolific inventor at FIU.    Rishe is a Fellow of the National Academy of Inventors (Fellow's Medal awarded in November 2021). Innovator:featured on the covers of both latest (2014 and 2016) National Science Foundation (NSF) Compendia of Technology Breakthroughs of Industry-University Cooperative Research Centers -- books published by NSF every two years until 2016 to advise U.S. Congress and Public on the state of science and technology. Grantee:awarded as the Principal Investigator $60 million in research grants by Government and Industry, including NASA, NSF, IBM, DoI, USGS, and DOT; Rishe's current grants as the P.I. include a $2.6M NSF grant for a Geospatial System for Multimodal Environmental Observations (2020-2025) and the $700K subproject P.I.-ship of a $1.4M Biscayne Bay Prediction System (2023-2025). Rishe is also currently a co-Principal Investigator on major collaborative grants, such as the $3.3M NSF grant for a Comprehensive Study of Alzheimer's Disease (2019-2025), a $300K DHS grant for Activity Recognition (2023-2025), and a $150K DHS grant for AI-driven Threat Detection (2024-2025). Outstanding Professor:the first FIU professor awarded the title of Outstanding University Professor. Rishe received the 2021 IBM Global University Program Academic Award. Mentor:recognized on the cover of the Fall 2016 FIU magazine for graduating top students, as well as the herald of the 2020 FIU Next Horizon infomercial. Architect:the TerraFly project, extensively covered by worldwide press, including the New York Times, USA Today, NPR, Science and Nature journals, and FOX TV News. Of the 53,000 NSF-funded projects in 2009, it chose 120, including Rishe's TerraFly, for the NSF annual report to Congress. Leader:Director of the FIU Database Research Center, Founding Director of FIU-FAU NSF Industry-University Center, Chair of the Forum of Outstanding Professors, serves on editorial boards and NSF panels. Humanitarian:pro-bono director of the Brain Center and other foundations and Florida \"guru\" on Storm, Beach Safety, and Housing. EDUCATION: 1981-1984Ph.D., Computer Science Department, Tel Aviv University 1979-1981M.Sc., Computer Science Department, Israel Institute of Technology (Technion), 1975-1979B.Sc. Summa Cum Laude, Computer Science Department, Israel Institute of Technology (Technion) ACADEMIC: 2000-Outstanding University Professor of Florida International University 1987-Professor (Full Professor 1992-, Associate Professor 1987-1992, tenured in 1990), School of Computing, Florida International University 1984-1987Visiting Assistant Professor, Computer Science Department, University of California, Santa Barbara 1981-1984Instructor, Computer Science Department, Tel Aviv University LEADERSHIP: 1994-Director, FIU High-performance Database Research Center 2012-2014, 2024-Chair, FIU Forum of Outstanding Professors 2008-2022Director, NSF Industry/University Cooperative Research Center at FIU, FAU, Greenwich U: Center for Advanced Knowledge Enablement 2008-2016Director, NSF CREST Center for Innovative Information Systems Engineering 1997-2002Director, NASA Regional Applications Center in Miami HONORS: 2000the inaugural Outstanding University Professor, Florida International University 🔗 2002winner (first prize) of the Miami Herald Business Plan Competition 🔗 2014Cover of Compendia of Technology Breakthroughs of Industry-University Cooperative Research Centers, NSF 🔗 2016Cover of Compendia of Technology Breakthroughs of Industry-University Cooperative Research Centers, NSF 🔗 2016Cover of FIU Magazine, Fall issue 🔗 2021Fellow Medal, National Academy of Inventors 🔗 2021Global University Program Academic Award, IBM 🔗 High Performance Database Research Center, Knight Foundation School of Computing and Information Sciences, Florida International University, 11200 SW 8th St, CASE-243, Miami, FL 33199; (305) 348-1706; http://cake.fiu.edu/Rishe",
  "content_length": 4918,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:21"
}