{
  "name": "Narendra S. Chaudhari",
  "homepage": "http://www.iiti.ac.in/~narendra",
  "status": "success",
  "content": "Profile | Dr.Narendra Chaudhari Untitled IIT Indore Home Education Work Experience Research Interests Publications Contact Details Dr. Narendra S. Chaudhari Professor (HAG) - Computer Science and Engineering nsc[at]iiti.ac.in, nsc0183[at]yahoo.com Office (landline) 0731-660-3305 Residence (landline) 0731-2403621 Mobile nos (in the order of preferance):9422802961,9981439671 Faculty Profile Computer Science and Engineering Dr. Narendra S. Chaudhari is with Indian Institute of Technology, Indore since Aug 2009 as a Professor of Computer Science and Engineering. He was Vice Chancellor of Uttarakhand Technical University (UTU), Dehradun from Jan.2019 to Mar.2021. He had been Director of Visvesvaraya National Institute of Technology (VNIT) Nagpur (M.S.) since June 2013 till June 2018 (five year term). In VNIT Nagpur, he promoted institute-wide research with multi-disciplinary projects, successfully addressed issues about nurturing human resources, introduced student mentorship program, involvement of alumni for entrepreneurship amongst students and promoted international collaborations and innovation culture. He initiated innovation Centre at VNIT Nagpur and provided leadership for product development that resulted in patents and technology transfer for engineering products. He had additional charge of Director of Maulana Azad National Institute of Technology (MANIT), Bhopal from March 2016 to May 2017. During 2016-2017, he provided leadership for technical education at national level as: (i) Chairman, Central Regional Committee, AICTE, MHRD, Govt. of India, and, (ii) Co-convener and secretary, standing council of NITs, MHRD, Govt. of India. Since Sept 2010 to June 2013, he was Dean - Research and Development (Dean - R&D), IIT Indore, and in this duration he has sown seeds of research culture in IIT Indore, which has now shown results in 2018 with IIT Indore surpassing all old IITs in Times Higher Education World University Rankings 2019 as the second-best World University in India (next to IISc, Bangalore). Since 2001 to July 2009, he was with the School of Computer Engineering, Nanyang Technological University (NTU), Singapore. In NTU Singapore, he was Coordinator, International Exchange Program, and Dy. Director, GameLAB, the lab which initiated entertainment computing in Singapore. From 1990 to 2001, he was Professor of Computer Science in M.Sc. DRDO Program, Ministry of Defense (Govt. of India) at Devi Ahilya University, Indore and from 1988 to 1990, he was a Reader in M.Sc. DRDO Program, Ministry of Defense (Govt. of India) at Devi Ahilya University, Indore. As a Dean, Faculty of Engineering Sciences, Devi Ahilya Vishwavidyalaya (DAVV), Indore, in 1995-1998, he initiated Institute of Engineering and Technology that is now leading Engineering institute in central India. Narendra has represented India in year 2015 and 2016 as part of six-member academic delegation accompanying with Honourable President of India in Sweden, Belarus and P.R. China. Narendra has represented India for formation of BRICS-Network University (NU) at Yekaterinburg, Russia held on 06-09 April, 2016. He was a member of FICCI's higher education delegation to Germany, France and Netherlands for the duration of 22-27 June 2015. Narendra has completed his undergraduate, graduate, and doctoral studies at Indian Institute of Technology (IIT), Mumbai, India, in 1981, 1983, and 1988 respectively. After his Bachelor's (B.Tech.) degree (First Class with distinction) in Electrical Engg., he had the exposure to industrial experience in the areas of electronics controllers (in Larson and Toubro, Mumbai) as well as software development (in Tata Consultancy Services, Mumbai). Since 1988, he was involved in graduate level training for the defense scientists (Ministry of Defense, Govt. of India) in the area of Computer Science till 1999. Subsequently, he was a visiting faculty member in Southern Cross University, NSW (Australia), and on another visiting assignment with Freie Universitat, Berlin (Germany) in 2000. Narendra has shouldered many senior level administrative positions in universities in India as well as abroad. Afew notable assignments include: (i)\tVice Chancellor, Uttarakhand Technical University (UTU), Dehradun (state govt university) since Jan 2019 to Mar.2021, (ii) Director, Visvesvaraya National Institute of Technology (VNIT) Nagpur (M.S.) since June 2013 till June 2018, (iii) Director, Maulana Azad National Insitute of Technology (MANIT), Bhopal since March 2016 to May 2017, (iv)Chairman - Central Regional Committee, All India Council for Technical Education (AICTE), MHRD, Govt of India, since March 2016 till June 2017, (v)\tChairman - Board of Governors, Government Engineering College, Chandrapur (M.S.) India since Nov. 2015 till Nov 2018, (vi) Mentor Director, Indian Insitute of Information Technology (IIIT), Nagpur since March 2016 till June 2018, (vii) Member- Board of Governors of IIIT Nagpur, till June 2018, (viii) Co-Convenor and Secretary, Standing Committee of Council of NITs: 14 July 2016 - June 2018, (ix) Member - Board of Governors of IIT Indore (2010-2013), (x)\t Member - Executive Council, Devi Ahilya University, Indore, (xi) Coordinator - International Exchange Program, Nanyang Technological University, Singapore, (xii) Deputy Director - GameLAB, Nanyang Technological University, Singapore, (xiii) Dean - Faculty of Engineering Sciences, Devi Ahilya University, Indore, (xiv) Dean - Research and Development, Indian Institute of Technology (IIT) Indore. Narendra's significant research contributions are in the areas of Network Security and Mobile Computing, machine learning, game AI, Novel Neural Network Models, Context Free Grammar Parsing, Optimization, and Graph Isomorphism Problem. Some of his important contributions are: (i) Authentication Protocols and Security Mechanisms for Cellular Networks, (ii) generalization of notion of alignment in bioinformatics sequences to fuzzy similarity and its usage for identification of Context Free structure in languages, (iii) rerouting strategies in Multi-Protocol Label Switching (MPLS) networks, (iv) applications of soft-computing techniques like genetic algorithms for cutting stock problems, and for credit risk estimation, (v) novel neural network models for protein secondary structure prediction, (v) specialized binary neural network structures, and (vi) implementation of interior point algorithms. He has delivered invited talks and presented his research results in several countries like America, Australia, Canada, Germany, Hungary, Japan, United Kingdom, etc. A few institutes where he has given talks on his research includes Massachusetts Institute of Technology (MIT) USA, Nagoya Institute of Technology (NIT), Nagoya, Japan, Manchester Metropolitan University (MMU), Manchester (U.K.), Beijing Normal University (BNU), Beijing (P.R. China), etc. Narendra has supervised more than fourty three doctoral students and published more than 380 papers in Journals and Conferences. He has successfully completed eight R&D Projects funded by DST, UGC, AICTE, MHRD etc. He has been a reviewer for DST and UGC projects. He has also contributed collaborative Research Work on other pilot projects on Computing techniques and Industry Interaction funded by ST-Engg, DSTA and A*STAR etc. in Singapore. Narendra has supervised more than fourty doctoral students and published more than three hundred eighty papers. Narendra has represented India in year 2015 and 2016 as part of academic delegation accompanying with Honorable President of India in Sweden, Belarus and P.R. China. In 2017, he represented India for the formation of BRICS Network University. In Sept. 2017, he visited St. Petersburg Mining University where he initiated India's collaborations with that University in Russia. Narendra is Fellow of the Institution of Electronics and Telecommunication Engineers (IETE) (India), Senior member of Computer Society of India, Senior Member of IEEE, USA, Member of Indian Mathematical Society (IMS), Member of Cryptology Research Society of India (CRSI), and member of many other professional societies. From 2015 to 2017, Narendra had been Chairman, IEEE-MP Subsection and Computer Society of India Nagpur Chapter. Currently, he is President of Indian Academy of Mathematics, Indore.",
  "content_length": 8333,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:28"
}