{
  "name": "Narges Mahyar",
  "homepage": "https://groups.cs.umass.edu/nmahyar",
  "status": "success",
  "content": "Narges Mahyar | Associate Professor Skip to content * Please note that I have moved to City St George’s, University of London and I am not accepting new students. I will continue supporting UMass remotely for a period to wrap up advising, teaching commitments, and service. Bio Narges Mahyar is an Associate Professor in the Manning College of Information and Computer Sciences at the University of Massachusetts Amherst. Narges’s research falls at the intersection of Visualization, HCI, Social Computing, and Design with the goal of augmenting people’s abilities to solve complex problems. She designs, develops, and evaluates novel social computing and visualization techniques that help people (both experts and non-experts) make better decisions. More recently, she has focused on exploring new strategies for scaling and diversifying public engagement in massive decision-making processes related to civic issues. She holds a Ph.D. in Computer Science from the University of Victoria, an MS in Information Technology from the University of Malaya, and a BS in Electrical Engineering from Tehran Azad University. She was a postdoctoral fellow in the Department of Computer Science at the University of British Columbia from 2014 to 2016 and in the Design Lab at the University of California San Diego from 2016 to 2018. Her recognition in the field has been repeatedly confirmed through several accolades from the premium venues in HCI and Visualization, including five Best/Outstanding Paper Awards from CHI 2023, Eurovis 2022, CSCW 2020, VAST 2014; and the Council of Educators in Landscape Architecture 2017, and three Best Paper Honorable Mention Awards from TiiS 2022, DIS 2021, and ISS 2016. Recent Public Talks Rising Tides: Broadening Public Participation in Climate Action through Mixed Reality Visualization, Radcliffe Institute at Harvard, Fellow presentation, December 13, 2023 Latest News Mar 2025: Our work, “AI-Enabled Conversational Journaling for Advancing Parkinson’s Disease Symptom Tracking” received the Best Paper Honorable Mention Award from ACM CHI 2025. Mar 2025: I am excited to be traveling to Yokohama, Japan, to attend CHI 2025! Mar 2025: Ali Sarvghad and I will give a joint talk at Stuttgart University’s Department of Computer Science on May 16, 2025. Mar 2025: For the second consecutive year, I am excited to serve on the Program Committee for the Posters Track at EuroVis 2025. Jan 2025: Our work, “AI-Enabled Conversational Journaling for Advancing Parkinson’s Disease Symptom Tracking” was accepted at ACM CHI 2025. Oct 2024: I will present two workshop papers at the “VISions of the Future” and “Vis4Climate+sustainability” workshops at IEEE VIS 2024. Oct 2024: Matt Brehmer and I are organizing a panel at IEEE VIS 20024 on VIS Conference Futures to discuss Community Opinions on Recent Experiences, Challenges, and Opportunities for Hybrid Event Formats on Wednesday, October 16, 2024 12:00 PM-1:00 PM EDT (UTC-4). Oct 2024: I am giving a talk at the University of Virginia, Computer Science, Distinguished Seminar, on Oct 11, 2024. Oct 2024: I am honored to share that my research on Communicating Climate Change has been featured in Radcliffe Moments, Past, Present, and Future, 2024. Older News Jul 2024: I am excited to announce that I’ll be giving a keynote at the International Conference on Innovation in Civil, Structural, and Environmental Engineering (CIVILENG2024). Jul 2024: I am excited to announce that I will serve as the Area Chair for Visualization at CHI 2025. May 2024: I will be traveling to Odense, Denmark, to attend EuroVis 2024 from May 27th to 30th. May 2024: I will be traveling to Honolulu, Hawaii, to attend CHI 2024 from May 11th to 16th. Mar 2024: I am excited to announce that I will serve on the Program Committee for Posters Track at EuroVis 2024. Mar 2024: I am excited to announce that I will serve on the Program Committee for Full Papers at IEEE VIS 2024. Jan 2024: I am giving a talk at UC Berkeley BID HCI speaker series on Jan 16, 2024. Jan 2024: I am giving a talk at Stanford Human-Computer Interaction Seminar on Jan 12, 2024. Dec 2023: I am giving a talk at the Harvard Radcliffe Institute on Dec 13, 2023. You can find additional information regarding the talk here. Dec 2023: I am giving a talk at the University of British Columbia on Dec 7, 2023. The talk is titled “Harnessing Data for Social Impact: Empowering Communities through Visualization & Social Computing.” Nov 2023: I am invited to give a talk at CMU HCI on Nov 17, 2023. You can find additional information regarding the talk here. Nov 2023: I am invited to give a talk at Boston College on Nov 6, 2023. Oct 2023: I will present three workshop papers at VIS 2023 on behalf of my student Mahmood Jasim. Oct 2023: I am giving a talk at MIT CSAIL. You can find additional information regarding the talk here. Sep 2023: Our paper “ClioQuery: Interactive Query-Oriented Text Analytics for Comprehensive Investigation of Historical News Archives” received the best paper runner-up award at TiiS 2022. Aug 2023: I will be serving as an AC member (Sub-Committee: Visualization) for CHI 2024. May 2023: I am honored to be named the 2023-24 Harvard Radcliffe Institute Fellow. April 2023: I was awarded the 2023 PIT@UMass faculty fellowship along with Dr. Ali Sarvghad and Kara M Smith (MD). April 2023: Our paper “Building Community Resiliency through Immersive Communal Extended Reality (CXR)” was recently accepted to MDPI Multimodal Technologies and Interaction 2023. April 2023: Our paper “Who Do We Mean When We Talk About Visualization Novices?” received the best paper award at CHI 2023. Feb 2023: I will be serving as a Program Committee member for IEEE VIS 2023. Dec 2022: Sheshera Mysore presented our paper, “Exploring how Data Scientists Review Scholarly Literature” at CHIIR 2023. Dec 2022: Our paper “Who Do We Mean When We Talk About Visualization Novices?” was accepted to CHI 2023. Dec 2022: I am honored to join the IEEE VIS Executive Committee (VEC). Dec 2022: Our paper “Exploring how Data Scientists Review Scholarly Literature” was accepted to CHIIR 2023. Nov 2022: Our paper “CommunityBots: Creating and Evaluating A Multi-Agent Chatbot Platform for Public Input Elicitation” was accepted to CSCW 2023. Oct 2022: I am excited to join the 2023 IEEE VIS organizing committee as the Workshop Co-Chair. Sep 2022: Our paper “Mapping Instability: The Effects of the Pandemic on the Civic Life of a Small Town” was accepted to the Environments By Design: Health, Wellbeing And Place Conference 2022. Aug 2022: Our paper “From Invisible to Visible: Impacts of Metadata in Communicative Data Visualization” was accepted to TVCG 2022. July 2022: Our Eurovis 2022 paper was featured in the news. May 2022: Our paper “Of Course it’s Political! A Critical Inquiry into Underemphasized Dimensions in Civic Text Visualization” was awarded Best Paper at Eurovis 2022. May 2022: I was an invited panelist for the panel on “Connecting Science and Art for Effective Community Engagement” hosted by Engineers and Scientists Acting Locally (ESAL). May 2022: I attended the Dagstuhl seminar on visual text analytics (May 8-13). April 2022: I gave a talk at Northwestern University titled “Social Computing and Visualization Tools for Empowering the Public” as part of the Technology & Social Behavior (TSB) Speaker Series. April 2022: I gave a talk at Tufts University titled “Social Computing and Visualization Tools for Empowering the Public” as a part of the Computer Science Colloquium Series. April 2022: I was awarded a recognition of service and contributions to the ACM honor for serving as a Program Co-Chair for the 2021 Creativity and Cognition Conference. March 2022: I will be serving as an PC for VIS 2022. March 2022: Our paper “Of Course it’s Political! A Critical Inquiry into Underemphasized Dimensions in Civic Text Visualization” was accepted to Eurovis 2022. Feb 2022: I received an NSF grant ($147,000) with CO-PI Pari Riahi and Ali Sarvghad for “MAPPING INSTABILITY: Building an Intelligent Community Agent Platform for Understanding the Impact of Large-Scale Crisis on Small Town Communities”. Jan 2022: I am excited to join the organizing committee for the Visualization for Social Good Workshop (Vis4Good) 2022, in conjunction with IEEE VIS 2022. Jan 2022: Our paper “ClioQuery: Interactive Query-Oriented Text Analytics for Comprehensive Investigation of Historical News Archives” was accepted to Transactions on Interactive Intelligent Systems journal. Jan 2022: Proud of my PhD student Mahmood Jasim for receiving the Computing for Common Good Fellowship. We will be working with Town of Amherst officials to design and develop CommunityClick-virtual—an online collaborative tool that combines machine learning, data visualization, and citizen-sourcing technology for inclusive public input collection and analysis Dec 2021: In close collaboration with the Town of Amherst, on Dec 2, we invited the Amherst community to use CommunityClick-Virtual during a public hearing on Kendrick Park area changes in order to broaden and diversify public participation in civic processes. You can find more information in the GazetteNet’s article. Oct 2021: Our paper “Making the Invisible Visible: Risks and Benefits of Disclosing Metadata in Visualization” was presented at the Visualization for Social Good workshop as a part of IEEE VIS 2021. For a summary of what was presented, see this summary slide. Oct 2021: Our paper “A Framework for Open Civic Design: Integrating Public Participation, Crowdsourcing, and Design Thinking” was accepted for publication in the ACM Journal for Digital Government: Research and Practice. Sept 2021: I will be serving as an AC for CHI 2022. July 2021: Our CommunityPulse paper received an Honorable Mention Award at DIS 2021. June 2021: Our paper “Designing with Pictographs: Envision Topics without Sacrificing Understanding” was accepted for publication in IEEE Transactions on Visualization an",
  "content_length": 15529,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:28"
}