{
  "name": "Nasir M. Rajpoot",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/nasir_rajpoot",
  "status": "success",
  "content": "Nasir Rajpoot Skip to main content Skip to navigation Hailing from the ancient Asian city of Multan, Nasir Rajpoot is the Professor of Computational Pathology at the University of Warwick and the founding Director of Tissue Image Analytics (TIA) Centre (previously the TIA lab) at Warwick since 2012. Prior to completing his PhD in Computer Science from Warwick in 2001, he was a postgraduate research fellow in the Applied Math program (partially based at the School of Medicine) at Yale University (USA) during 1998-2000 and a systems engineering fellow at PIEAS (Pakistan) during 1994-1996.The focus of current research in TIA Centre led by Prof Rajpoot is on AI and machine learning algorithms for the study of histological and multi-omic markers of cancer biology, with applications to early detection of cancer and stratification of cancer patients in terms of recurrence, progression and response to therapy. Rajpoot has co-authored over 300 research publications on algorithms for computational pathology in leading journals and conferences. He has been active in the digital pathology community for almost two decades now.Prof Rajpoot was recently awarded the Wolfson Fellowship by the UK Royal Society and the Turing Fellowship by the Alan Turing Institute, the UK's national data science institute. He was also the founding co-Director of the recently funded £15m PathLAKE centre of excellence on AI in pathology.Since Feb 2024, Prof Rajpoot leads the team at Histofy, a spinout from the TIA Centre aimed at accelerated precision diagnostics in both clinical and pharmaceutical workflows. Click here for the TIA Centre pagesTIA Centre LinkedIn pageHomepageClick here for my old homepage.PublicationsClick here for a full list of publications.ContactEmail: N.M.Rajpoot at warwick.ac.uk Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 2161,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:29"
}