{
  "name": "Nasir U. Eisty",
  "homepage": "http://nasireisty.com",
  "status": "success",
  "content": "Nasir Eisty I am an Assistant Professor in the Min H. Kao Electrical Engineering and Computer Science Department at the University of Tennessee, Knoxville. My research interests lie in the area of Software Engineering, which includes Empirical Software Engineering, Scientific/Research Software Engineering, Software Quality Assurance using AI in fields such as Software Testing, Peer Code Review, and Software Metrics, and Software Engineering Education. Resume (PDF) ***My lab welcomes fulbright scholars, visiting scholars, postdocs, and researchers from all around the world. Please feel free to email me. UTK Aug 25 - Present BSU Aug 21 - Jul 25 Cal Poly Sep 20 - Jul 21 UA Aug 16 - Aug 20 LANL Summer 2019 NCSA Summer 2017 Teaching Research Service • 6/15/2024: Our grant proposal together with Dr. Elena Sherman and Dr. Grady Wright on formal methods in scientific software was funded. Thanks to NSF! • 4/29/2024: My first Ph.D. student, Sharif Ahmed, will join the University of Central Arkansas Computer Science Department as a tenure-track Assistant Professor starting Fall 2025. Congratulations to Sharif! • 4/22/2024: Mushfiqur Rahman is set to do a summer internship at Oak Ridge National Lab (ORNL) this summer. Congratulations to Mushfiq! • 4/22/2024: Shane Panter passed his Ph.D. proposal. Congratulations to Shane! • 1/28/2025: Our paper Testing Research Software: An In-Depth Survey of Practices, Methods, and Tools has been accepted for publication in the Empirical Software Engineering (EMSE) Journal . Thanks to my co-authors Upulee Kenewala (UNF) and Jeffrey Carver (UA)! • 1/20/2025: Our paper Hold On! Is My Feedback Useful? Evaluating the Usefulness of Code Review Comments has been accepted for publication in the Empirical Software Engineering (EMSE) Journal . Congratulations to Sharif! • 11/05/2024: Sharif Ahmed and Shariful Alam both passed their Ph.D. proposals. Eric Melin Passed his Ph.D. Comprehensive exam. Congratulations to all of them! • 8/16/2024: Sharif Ahmed completed a summer internship at Oak Ridge National Lab (ORNL) • 9/15/2024: Our poster Software Testing Practices for Reproducible Open Science has been accepted to AGU 2024 Conference at Washington D.C. Thanks to Alex Koufos (Stanford University) and Miranda Mundt (Sandia National Lab)! • 7/26/2024: Our poster Better Architecture, Better Software, Better Research has been accepted to US-RSE 2024 Conference at Albuquerque, New Mexico. Thanks to my 12 co-authors! • 7/22/2024: Our paper Rusty Linux: Advances in Rust for Linux Kernel Development has been accepted to ESEM 2024 Conference at Barcelona, Spain. Congratulations to Shane! • 3/14/2024: Attended Dagstuhl Seminar Research Software Engineering: Bridging Knowledge Gaps at Germany • 1/12/2024: Our paper Understanding Emojis :) in Useful Code Review Comments has been accepted to NLBSE 2024 Workshop (Co-Located to ICSE 2024). Congratulations to Sharif! • 8/19/2023: Our BoF workshop titled Scientific Software and the People Who Make it Happen: Building Communities of Practice has been accepted to be held at the SC 2023 Conference • 8/01/2023: A talk titled Peer Code Review in Research Software: Enhancing Quality and Collaboration has been accepted to be presented at the US-RSE 2023 Conference • 7/12/2023: Our paper Exploring the Advances in Identifying Useful Code Review Comments has been accepted to ESEM 2023 Conference. Congratulations to Sharif! • 3/30/2023: Five papers were accepted at the SERA 2023 conference! Congratulations to all my co-authors! • 12/7/2022: Grant ($250K) proposal was funded by the Alphred P. Sloan Foundation • 11/16/2022: Organized BOF titled Software Engineering and Reuse in Modeling, Simulation, and Data Analysis for Science and Engineering at the Supuer Computing Conference (SC22). • 9/15/2022: Presented a talk on Testing Research Software at US-RSE VIrtual Workshop 2022 • 5/26/2022: Journal paper Testing Research Software: A Survey was accepted to the Empirical Software Engineering Journal (EMSE). • 4/22/2022: Attended US-RSE Association community building workshop, April 26-27, 2022 in Princeton, NJ • 4/1/2022: Our paper Automatic Transformation of Natural to Unified Modeling Language: A Systematic Review has been accepted to SERA 2022 Conference. Congratulations to Sharif and Arif! • 2/9/2022: Our paper Software Engineering Approaches for TinyML based IoT Embedded Vision: A Systematic Literature Review has been accepted to @serp4iot colocated with @ICSE 2022 . Congratulations to Shashank! • 12/21/2021: BSSw blog post Reflecting on Our Community: The SC21 BoF on Software Engineering and Reuse in Modeling, Simulation, and Data Analytics for Science and Engineering was published. • 12/3/2021: Position paper Scientific Software Development Laboratory: A Proposal was accepted to the DOE ASCR Workshop on the Science of Scientific-Software Development and Use 2021 • 9/20/2021: BOF titled Software Engineering and Reuse in Modeling, Simulation, and Data Analysis for Science and Engineering was accepted to the Supuer Computing Conference (SC21). • 9/2/2021: Journal paper Developers Perceptions of Peer Code Review in Research Software was accepted to the Empirical Software Engineering Journal (EMSE). • 7/25/2021: Started working as an Assistant Professor in the CS department of Boise State University.",
  "content_length": 5332,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:29"
}