{
  "name": "Nassir Navab",
  "homepage": "http://campar.in.tum.de/Main/NassirNavabCv",
  "status": "success",
  "content": "Start - Lehrstuhl für Informatikanwendungen in der Medizin Chair for Computer Aided Medical Procedures & Augmented Reality CAMP Chair & Labs News Teaching Projects Director at CAMP Prof. Dr. Nassir Navab Director of the Chair for Computer Aided Medical Procedures & Augmented Reality Surgical Workflow Medical Image Analysis Microscopic Imaging Reconstruction Molecular Imaging Medical Augmented Reality Computer-aided Interventions Machine Learning for Medical Applications Robot-guided Surgery Ultrasound Imaging Biomedical Crowdsourcing Computer Vision Industrial Augmented Reality Vice Director Dr. Ulrich Eck Director of NARVIS Lab Medical Augmented Reality for Surgery and Training Intra-operative Navigation and Guidance System Architectures for Realtime Interactive Systems Haptic-Enabled Simulators Clinical Research Lead Prof. (TUMS) Dr. med. Reza Ghotbi Clinical Research Lead of the CAMP Chair.Vascular Imaging and Vascular Surgery Dr. Angelos Karlas Clinical Research Lead of the CAMP Chair. Clinical Translation Medical Imaging Assistant Professor Prof. Dr. Cristina Piazza Director of Neuroprosthetics and Human-Centered Robotics Lab Study of Human Movement Design of Bionic Prostheses and Wearable Devices Based on Soft Robotics Technologies Development of Advanced Control Algorithms Development of Innovative Assessments for Upper Limb Rehabilitation Using Emerging Technologies Senior Research Scientists Dr. Mohammad Farid Azampour Robotic ultrasound and ultrasound image processingImplicit neural representation in medical image processingAnatomy-aware deep learning Nikolas Brasch 3D Computer Vision SLAM 3D Scene Understanding Dr. Shahrooz Faghihroohi Deep Learning for Medical Image Analysis Medical Image Reconstruction Cardiovascular Image Analysis Dr. Matthias Keicher Deep learning for medical applications and image analysisMultimodal decision support and report generationVision-language models and visual question answering (VQA)Clinical reasoning PD Dr. Federico Tombari Computer Vision and 3D Computer VisionScene Understanding and ReconstructionObject Understanding and ReconstructionVision-Language Models3D Reconstruction and Rendering Dr. Stefano Gasperini Computer VisionScene Understanding3D Reconstruction and RenderingAutonomous Driving Senior Affiliate Lecturers / Research Scientists Dr. Shadi Albarqouni Deep Learning for Medical Applications Microscopic Image Analysis Computer Aided Diagnosis Dr. Ahmad Ahmadi Neuroimaging Multi-modal Imaging (US,MRI,etc.) Clinical Applications Dr. Vasileios Belagiannis Computer Vision Machine Learning Deep Learning Dr. Benjamin Busam Computer Vision Sensor Fusion Collaborative Robotics Dr. Azade Farshad Generative ModelsSemantic Scene ModelingGraphs and Scene GraphsDeep Learning for Medical Applications Dr. Christoph Hennersperger Research & Development in Interventional Imaging Lecturer MedInnovate Innovation Fellowship Lecturer Ultrasound Imaging & Robotics PD Dr. Slobodan Ilic Deformable surface modeling and tracking 3D reconstruction (multi-camera, stereo) Real-time object detection and tracking Object detection and localization in 3D data Dr. Zhongliang Jiang Robotic Vision Robot Learning Medical Image Processing Medical and Surgical Robotics Human-Robot Interaction PD Dr. Markus Kowarschik Lecturer: Interventional Imaging Research: Interventional Imaging, Tomographic Image Reconstruction Dr. Diana Mateus Machine Learning for Medical Applications 3D shape acquisition, modeling and registration Computer Vision Prof. Dr. Stephan Nekolla Quantitative methods in medical imaging Integration of multi modality data: PET, SPECT, CT, MRI Going the full distance: from imaging physics to tracking therapeutical changes Dr. Peter Noël Lecturer: Medical Imaging Research: Tomographic reconstruction Dr. Marie Piraud Medical computer vision, deep learning Biomedical data analytics, survival analysis Dynamical and statistical modelling, mixed-effect models Prof. Dr. Daniel Roth Virtual and Augmented RealityComputer Aided InterventionsRobotics Prof. Dr.-Ing. Kuangyu Shi Translational molecular imaging computing Artificial intelligence for nuclear medicine imaging & therapy Digital twin and computational biology for theranostics Nuclear medicine instrumentational and physical computing Dr. Arash Taki Lecturer: Ultrasound Imaging Scientific Advisor: Cardiovascular, Respiratory & Patient Monitoring Dr. Joerg Traub Lecturer: Innovation Generation in the Healthcare Domain Invited lecture in CAMP-I: Translation research in medical technology Dr. Wolfgang Wein Lecturer: conebeam CT and US Imaging Research: Advanced Ultrasound Imaging Dr. Thomas Wendler Former Director of Interdisciplinary Research Lab (IFL) Clinical Research Nuclear Medicine and Brachytherapy Medical Robotics Machine Learning Image-Guided Interventions People at CAMP Alumni Dr. Mai Bui Deep Learning for Interventional Cardiology Computer Vision for Interventional Imaging Catheter Tracking and Navigation Dr. Anees Kazi Graph Deep Learning for Healthcare Applications Multi-modal Data Analysis Medical Image Analysis Dr. Roger Soberanis Deep Learning and Graph Deep Learning for Medical ApplicationsMedical Image SegmentationLocalization in Medical Imaging To top Lehrstuhl für Informatikanwendungen in der Medizin (Prof. Navab) Prof. Nassir Navab Boltzmannstr. 3 85748 Garching Administrative office fon: +49 (0)89 289-17058 fax: +49 (0)89 289-17059 email: martina.hilla(at)tum.de News 22.06.2025 20 Papers Accepted to MICCAI 2025 16.05.2025 Medical Augmented Reality Summer School 2025 - Call for Participation 26.02.2025 10+ Papers Accepted to CVPR 2025 24.02.2025 3 Papers Accepted to IPMI 2025 04.02.2025 3 Papers Accepted to IPCAI 2025",
  "content_length": 5715,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:36"
}