{
  "name": "Natalie Jeremijenko",
  "homepage": "https://steinhardt.nyu.edu/people/natalie-jeremijenko",
  "status": "success",
  "content": "Page Not Found | NYU Steinhardt Skip to main content Search NYU Steinhardt Search Close Search Page Not Found Students looking down the stage from the seating area as they listen to their host. On November 12, students from NYU’s graduate program for Performing Arts Administration traveled to Off-Broadway for an exclusive site visit of Signature Theatre Company. As part of the ongoing \"Backstage Pass\" series, students participated in a comprehensive tour of the entire facility as well as a Q&A session with members from the organization’s administrative team.The highly accessible Off-Broadway venue is home to three separate performance spaces and two rehearsal studios. Its spacious upstairs lobby boasts cafe-style seating and a full bar where patrons can gather before and after shows. The tour was led by Jake Miller, Director of Rentals and Sales. Miller shared insights into the functionality of the stunning geometric design of each performance space and touched on how past and current productions utilized each theater for their specific needs. After the tour, students sat down for a panel discussion with six staff members from the organization; Timothy J. McClimon (Executive Director), Megan O’Keefe (PAA ’24 and Company Manager), Maggie Swahl (Associate General Manager), Gavin Trinidad (Marketing Manager, Audience and Community Engagement), Robin Woindrich (Manager of Donor Programs), Ethan Sichel (Manager of Special Events), and Emily Chackerian (Artist Assistant and Board Liaison). Each speaker delved into their specific role at the not-for-profit organization, sharing how they contribute to day-to-day tasks and long-term operations. With this visit to Signature Theatre Company, PAA students experienced the inner workings of a major Off-Broadway organization up close. Experiences like the Backstage Pass Series continue to advance the PAA program’s mission of integrating classroom learning with real-world professional insight.",
  "content_length": 1961,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:35"
}