{
  "name": "Natalija Vlajic",
  "homepage": "http://www.cse.yorku.ca/~vlajic",
  "status": "success",
  "content": "index Natalija Vlajic Associate Professor PhD ECE  /  PEng  /  CISSP Department of Electrical Engineering and Computer Science Lassonde School of Engineering York University NEWS TEACHING RESEARCH PUBLICATIONS CONTACT email:  vlajic @ yorku. ca address:  4700 Keele St., Toronto, ON, M3J 1P3, Canada office:  Lassonde Building, room 2047 phone:  (416) 736-2100 x 77878 YorkU Discover Profile: https://discover.academics.yorku.ca/Natalija.Vlajic Congratulations to Gabriele Cianfarani! Our paper \"Automated Risk-Based Cryptoperiod Calculation in ICSs: Analytical Framework & Software Tool\" is accepted for publication in Wiley Journal of Security and Privacy, September 2025. Congratulations to Melina Najimi!  Our paper \"Novel Color Coded MITRE ATT&CK Inspired Attack Tree Modeling: Application in ICSs\" is accepted for publication at IEEE COMPSAC, Toronto, Canada, July 2025. Congratulations to Gabriele Cianfarani! Our paper \"Risk-Based Optimization of Cryptoperiods to Minimize Impact of Data Siphoning Attacks on ICSs\" is accepted for publication at IEEE ICC 2025, Montreal, Canada, June 2025. Congratulations to Jazdeep Sarai! Our paper \"Comprehensive Study of ICS Malware Attacks & Prioritizing Critical Defenses Using MITRE ATT&CK\" is accepted for publication at IEEE CCNCPS 2025, Dubai, UAE, June 2025. Congratulations to Melina Najimi!  Our paper \"Merging Attack Trees and MITRE ATT&CK Tactics for More Effective Attack Modeling\" is accepted for publication at 13th IEEE ISDFS, Boston, USA, April 2025. In March 2025, I had the honor of accompanying 4 of my incredible graduate students (D. Brown, G. Cianfarani, J. Sarai, R. Blostein) at the inaugural GradCon Conference organized by Waterloo's Cybersecurity and Privacy Institute, where they each presented their respective research works. Congratulations to Gabriele Cianfarani!  Our paper \"Risk-Based Methodology for Optimal Cryptoperiod Calculation in ICSs Under Data Siphoning Attack\" is accepted for publication at RICSS Workshop, ACM CCS, October 2024. Congratulations to Daniel Brown!  Our paper \"Novel Approach to Tor User De-Anonymization: Client-Side Generated Watermark \" is accepted for publication at IEEE CSR, September 2024. Congratulations to Shadi Sadeghpour!  Our paper \"ReBotDetector: A Detection Model with LSTM Feature Extractor for Session-Replay Web Bot Attacks\" is accepted for publication at IEEE CSR, September 2024. Congratulations to Gabriele Cianfarani!  Our paper \"Data Siphoning in ICSs: Attack Tree and Role of Cryptoperiods\" is accepted for publication at IEEE CSR, September 2024. Prof. Vlajic is a co-editor for the FT on Security of Communication Protocols in Industrial Control Systems (ICSs) in June 2023 Issue of IEEE Communications Magazine. Congratulations to Shadi Sadeghpour!  Our paper \"RanABD: MTD-Based Technique for Detection of Advanced Session-Replay Web Bots\" is accepted for publication at ACM CCS'23, Moving Target Defence (MTD) Workshop, November 2023. Congratulations to Daniel Brown!  Our poster paper \"Novel Client-Side Watermarking Technique for Tor User De-Anonymization\" is accepted for publication at ACM IMC'23, October 2023. Congratulations to Shadi Sadeghpour!  Our paper \"RanABD: Web Page Randomization for Advanced Web-Bot Detection\" is accepted for publication at IEEE CSNet'23, October 2023. Congratulations to Stefan Petrovic!   Our ACM/IEEE ICCPS poster paper has won the Best Poster Award! Congratulations to Stefan Petrovic!  Our poster paper \"PIRAT - Tool for Automated Cyber-Risk Assessment of PLC components & Systems Deploying NVD CVE & MITRE ATT&CK Databases\" is accepted for publication at ACM/IEEE ICCPS, May 2023. Congratulations to Shadi Sadeghpour!  Our paper \"ReMouse Dataset: On the Efficacy of Measuring the Similarity of Human-Generated Trajectories for the Detection of Session-Replay Bots\" is accepted for publication in MDPI Journal of Cybersecurity and Privacy, February 2023. Congratulations to Shadi Sadeghpour!  Our paper \"Analysis of Novel Mouse Dynamics Dataset with Repeat Sessions: Helpful Observations for Tackling Session-Replay Bots\" is accepted for publication at IEEE CCNC, January 2023. On Nov 7 2019 EECS's Computer Security program hosted a seminar on \"Career Paths in Computer Security: Advice from the Trenches\". Guest speakers at the seminar included 4 amazing York alumni:  Zachary Matthews, Marmara El Masri, Hassaan Ahmed, Abdul Basit (left to right). Prof. Vlajic was an invited speaker and panelist at FSP 2019 Fall Seminar. Prof. Vlajic was an invited speaker at SERENE-RISC Fall 2017 Workshop. TEACHING CSE 3482 - Introduction to Computer Security CSE 4482 - Network Security and Forensics CSE 3214 - Computer Network Protocols and Applications CSE 3213 - Communication Networks CSE 4215/5431 - Mobile Communications CSE 2011 - Fundamentals of Data Structures RESEARCH INTERESTS information / network / computer / cyber security security of Industrial Control Systems (ICS) security risk management bots & DDoS attacks user privacy Internet of things (IoT) machine learning / data mining network & system performance evaluation sensor networks Security Research at York [ SecRAY ]",
  "content_length": 5155,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:37"
}