{
  "name": "Natalia Sidorova",
  "homepage": "http://www.win.tue.nl/~sidorova",
  "status": "success",
  "content": "Home page of Natalia Sidorova Natalia Sidorova Dept. of Mathematics and Computer Science Technische universiteit Eindhoven PO Box 513 5600 MB Eindhoven The Netherlands Office Metaforum 7.105 Tel. +31 (0)40 2473705 Fax +31 (0)40 2463992 E-mail n.sidorova@tue.nl Lectures Metamodeling and Interoperability (2II65) Some old teaching materials are still available here. PhD Students: Helen Schonenberg:  PhD thesis Whats Next? Operational Support for Business Process Execution. Carmen Bratosin: PhD thesis Grid Architecture for Distributed Process Mining Jan Martijn van der Werf:  PhD thesis Compositional Design and Verification of Component-Based Information Systems Olivia Oanea: PhD thesis Verification of Soundness and Other Properties of Business Processes Natalia Yustinova: PhD thesis Abstractions and Static Analysis for Verifying Reactive Systems Main projects Data-Driven Value Proposition, 2015-2018 (TU/e, Philips Research)  supervising a PhD project Mine your own body, 2014-2018 (within the TU/e-Philips program Impulse)  supervising a PhD project Fit2Perform, 2014-2015 (EIT ICT Labs activity involving TU/e, Philips Research, Imperial College of London,TNO, HumanCapitalCare and other partners) - task leader Turnout burnout, 2013 (EIT ICT Labs activity involving TU/e, Philips Research, TNO, CREATE-NET, Aalto University, Novay and HumanCapitalCare) - coordinator + task leader Stress@work, 2012 (EIT ICT Labs activity involving TU/e, Philips Research, Aalto University, as well as HumanCapitalCare) - coordinator + task leader \"Creation of a Test Bed (Service Space) and applications for Health and Well-being\", 2011 (EIT ICT Labs activity with 8 academic and industrial partners) - coordinator + task leader \"Workflow Management for Large Parallel and Distributed Applications\", 2006-2010 (NWO-project, 2 PhD students and 1 postdoc) -  principal investigator \"Providing Full Life Cycle Support for Adaptive Processes by Advanced Mining Approaches\", 2006-2010 (NWO project) 2006- co-promotor of a PhD student \"Route\", 2006 (verification of UML activity diagrams for an external party, 3 researchers) - project leader \"Modelling and Verification of Business Processes\", 2003-2007 (NWO-project, 1 PhD student and 1 postdoc) - principal investigator Publications See Google Scholar, DBLP, TU/e",
  "content_length": 2312,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:36"
}