{
  "name": "Natasa Zivic",
  "homepage": "https://www.eti.uni-siegen.de/dcs/mitarbeiter/professoren/zivic/?lang=de",
  "status": "success",
  "content": "Dr.-Ing. Natasa Zivic | Lehrstuhl für Digitale KommunikationssystemeSkip to the navigation.Skip to the content. Fakultät IV Lehrstuhl für digitale KommunikationssystemeÜber unsMitarbeiterProfessorenChristoph RulandNatasa ZivicChristoph RulandNatasa ZivicWissenschaftliche MitarbeiterGastwissenschaftlerAsmaa TellabiEhemalige MitarbeiterLehreVeröffentlichungenArbeitenForschungProjektePräsentation des LehrstuhlsFlyer des LehrstuhlsPreisträger und AuszeichnungentestMailunisonoFormulareSucheWir verwenden Google für unsere Suche. Mit Klick auf diesen Button aktivieren Sie das Suchfenster und akzeptieren die Nutzungsbedingungen.Hinweise zum Einsatz der Google SucheErweiterte SuchePersonensuchezur unisono PersonensucheVeranstaltungssuchezur unisono VeranstaltungssucheKatalog plus  / dcs / mitarbeiter / professoren / zivic /  Dr.-Ing. Natasa Zivic Dr. - Ing. habil. Natasa Zivic Priv. Doz. natasa.zivic@uni-siegen.de Telefon +49 (0) 271/ 740 - 2332 Telefax +49 (0) 271/ 740 - 2536 Raum H-E 208 Aktuelles: Interview mit Frau Dr.-Ing. habil. Natasa Zivic auf der FICC 2018 (Future of Information and Communication Conference, Singapore 2018)   Ausbildung anzeigen Habilitation in Elektrotechnik/Nachrichtentechnik (1.8.2007 - 13.12.2012) Universität Siegen, Naturwissenschaftlich-Technische Fakultät Department Elektrotechnik und Informatik Lehrstuhl für Digitale Kommunikationssysteme Hölderlinstr. 3, 57076 Siegen Lehrgebiet: Nachrichtentechnik Dr. – Ing. in Elektrotechnik (1.10.2004 – 6.7.2007) Universität Siegen, Hölderlinstrasse 3, 57076 Siegen Fachbereich: Elektrotechnik und Informatik Thesistitel: Joint Channel Coding and Cryptography Betreuer: Prof. Dr. Christoph Ruland Magister in Elektrotechnik (1.1.2000 – 9.11.2002) Universität Belgrad, Bulevar Kralja Aleksandra 73, 11000 Belgrad Abteilung: Nachrichtentechnik Forschungsgebiet: Signalverarbeitung und Kommunikationstechnologien Thesistitel: Influence of Time and Frequency Parameters on Autocorrelation Function of the Music Signal Betreuer: Prof. Dr. Miomir Mijic Dipl. – Ing. in Elektrotechnik (1.10.1993 – 22.12.1999) Universität Belgrad, Bulevar Kralja Aleksandra 73, 11000 Belgrad Abteilung: Elektronik, Nachrichtentechnik und Automatisierungstechnik Thesistitel: ADSL with accent to G.Lite Technology Betreuer: Prof. Dr. Zoran Petrovic Stipendien anzeigen DAAD Stipendium, 1.10.2004 – 31.7.2005 Stipendien der Universität Siegen, 1.8.2005 – 31.12.2007 Andere Aktivitäten anzeigen Mitglied im DIN (Deutsches Institut für Normung, Berlin) AA27 und ISO SC 27 (Security Techniques) seit 2006 Project Editor der Standards: ISO/IEC 13888-1: Non Repudiation - General ISO/IEC 13888-2: Non Repudiation using Symmetric Algorithms Reviewer IEEE Transactions on Information Theory IEEE Transactions on Communications IEEE Transactions on Image Processing IEEE Communications Letters IEEE Wireless Communications Letters IEEE Signal Processing Letters IET Networks IET Communications Computer Networks (Elsevier) Physical Communication (Elsevier) British Journal of Mathematics and Computer Science International journal of Network Security & Its Applications (IJNSA) International Open Access Journal Sensors International Journal of Ad Hoc and Ubiquitous Computing (IJAHUC) International Journal of Database Management Systems (IJDMS) International Journal of Computer Engineering Research (IJCER) International Journal of Computer Science and Information Technologies (IJCSIT) Organisation Workshop on Information Security using noisy and lossy Communication Systems, IEEE ICC 2013, Budapest, Hungary, June 9-13,2013 Frühere und aktuelle akademische Zusammenarbeit College of Engineering Department of Electrical and Computer Engineering, University of Arizona, USA Duksung University of Seoul, Seoul, Korea The School of Film and Video Art Technology of the Shanghai University, Shangai, China Claude Shannon Institute for Discrete Mathematics, Coding and Cryptography (CSI), Belfield, Dublin, Ireland Institute of Technology of Buenos Aires (ITBA), Buenos Aires, Argentina Faculty of Electrical Engineering, University of Belgrade, Serbia Lehre anzeigen Universität Siegen Kognitive Netze Grundlagen der Nachrichtentechnik Digitale Kommunikationstechnologie I Digitale Kommunikationstechnologie II Digitale Kommunikationsnetze Hochschulprojekte anzeigen Hochschulinterne Forschungsförderung der Universität Siegen (2011) DAAD-Projekt mit der Duksung Universität Seoul/Korea im Rahmen des DAAD Programms Partnerschaften mit Japan und Korea (2012 - 2013) Thema: Trusted based Security for Hybrid wireless Mesh Networks DAAD-Projekt mit der Arizona University Tucson/USA im Rahmen des DAAD Programms PPP mit USA (2014 - 2015) Thema: Compressed Sensing Authentication DAAD-Projekt mit der Duksung Universität Seoul/Korea im Rahmen des DAAD Programms Partnerschaften mit Japan und Korea (2014 - 2015) Thema: Security for Internet of Things DAAD-Projekt mit der Duksung Universität Seoul/Korea im Rahmen des DAAD Programms Partnerschaften mit Japan und Korea (2016 - 2017) Thema: Common Security Model for Smart Grids and Internet of Things Berufserfahrung anzeigen Universität Siegen Akad. Rätin (1.1.2010 - heute) Wiss. Mitarbeiterin (1.1.2008 – 31.12.2009) PTT “Serbien”, Abteilung für Telekommunikationen, Belgrad Senior engineer for switching systems (15.5.2000 – 30.9.2004) Sprachen anzeigen Deutsch Englisch Französisch Serbo-Kroatisch Publikationsliste klicken zum Anzeigen. 2020 N. Zivic: Opportunities for Deploying Distributed Ledger Technologies in the Automotive Industry 4.0, 5th International Conference on Smart and Sustainable Technologies (SpliTech 2020), September 2020, Split, CroatiaN. Zivic: Distributed Ledger Technologies for Car Industry 4.0, International Conference on Computer Communication and Information Systems, August 2020, Ho Chi Minh, VietnamN. Zivic, E. Kadusic, K. Kadusic: Directed Acyclic Graphs as Hashgraph: an Alternative DLT to Blockchains and Tangles, Infoteh 2020, January 2020, Jahorina, BosniaN. Zivic: Distributed Ledger Technology for Automotive Production 4.0, 28th Telecommunications Forum (TELFOR 2020), November 24-25, Belgrade, Serbia   2019 N. Zivic, C. Ruland, J. Sassmannshausen: “Distributed Ledger Technologies for M2M Communications”, the 33rd International Conference on Information Networking (ICOIN 2019) January 9-11, 2019, Kuala Lumpur, MalaysiaN. Zivic, C. Ruland, O. Ur-Rehman, \"Addressing Byzantine Fault Tolerance in Blockchain Technology\",  2019 8th International Conference on Modeling Simulation and Applied Optimization (ICMSAO), April 15-17, 2019, Manama, BahrainO. Ur-Rehman, N. Zivic, C. Ruland: “An Overview of Automotive Security Standards”, the 43th International Convention on Information, Communication and Information Technology (MIPRO 2019),  May 20-24, 2019, Opatija, CroatiaN. Zivic, E. Kadusic, K. Kadusic: “Directed Acyclic Graph as Tangle: an IoT Alternative to Blockchains”, 27th Telecommunications Forum (TELFOR 2019), November 26-27, Belgrade, SerbiaE. Kadusic, C. Ruland, N. Zivic, A. Masovic, “Implementation of MQTT Native Application for Tizen-based Smartwatches”, 6th Annual Conference on Computational Science and Computational Intelligence, December 5-7, Las Vegas, Nevada, USA 2018 N. Zivic, C. Ruland, \"Cognitive Channel Decoding\", Future of Information and Communication Conference (FICC 2018), Singapore, Apr. 2018. N. Zivic, C. Ruland, Cognition for Enhanced Biometric Authentication, The 32th Int. Conference on Information Networking (ICOIN 2018), Chang Mai, Thailand, Jan. 2018 2017 N. Zivic, \"Improved Up-Link Repetition Procedure for Narrow Band Internet of Things\", The 2017 International Conference on Computer Science and Computational Intelligence (CSCI’17), Las Vegas, USA, Dec. 2017. O. Ur-Rehman and N. Zivic, \"Two-phase Method for Image Authentication and Enhanced Decoding\", IEEE Access, vol. 5, issue 1, pp. 12158-12167, Dec. 2017. C. Ruland, J. Sassmannshausen, K.Waedt and N. Zivic, \"Smart grid security - an overview of standards and guidelines\", e & i Elektrotechnik und Informationstechnik, vol. 134, issue 1, pp. 19-25, Feb 2017, Springer Wien. [Link] O. Ur Rehman and N. Živić, \"Discrete Wavelet Transform based Watermarking for Image Content Authentication\", 6th International Conference on Pattern Recognition Applications and Methods, Porto, Portugal, Feb. 24-26, 2017. O. Ur Rehman,N. Živić and C. Ruland, \"Approximate Image Authentication and Correction Using Spatial and Frequency Domain Features\", 11th International Conference on Systems, Communications and Coding (SCC 2017), Hamburg, Germany, Feb. 6 - 9, 2017. N. Živić, O. Ur Rehman and C. Ruland, \"Iterative Decoder for OFDM Transmission over Rayleigh Channel\", The 31st International Conference on Information Networking (ICOIN 2017), Da Nang, Vietnam, Jan. 11 - 13, 2017. 2016 N. Živić and O. Ur Rehman, \"Improved OFDM Decoder for LTE and Beyond\", The 2016 International Conference on Computational Science and Computational Intelligence (CSCI'16), Las Vegas, USA, Dec. 15 - 17, 2016. N. Živić and O. Ur Rehman, \"Soft Authentication Techniques for Images\", 24th Telecommunications Forum (TELFOR 2016), Belgrade, Serbia, Nov 22-23, 2016. N. Živić, O. Ur Rehman and C. Ruland, \"Smart Metering for Intelligent Buildings\", Transactions on Networks and Communications, vol. 4, no. 5, Oct. 2016. S. Abbas, F. Ahmed, N. Živić and O. Ur Rehman, \"Perceptual Image Hashing using SVD based Noise Resistant Local Binary Pattern\", The 8th International Congress on Ultra Modern Telecommunications and Control Systems (ICUMT 2016), Lisbon, Portugal, Oct. 18 - 20, 2016. N. Živić, \"Security and Robustness in Smart Grid Control\", Smart Grid Technologies Meeting, Aug 16-20, 2016, Berlin, Germany. E. Kadusić, N. Živić, A. Kos: QoS-aware dynamic MAP selection in HMIPv6 architecture, IEEE Access, vol. 4, pp. 3112-3126, Jun 2016. O. Ur Rehman, N. Živić and C. Ruland, \"Content based Image Authentication with Error Correction\", IEEE International Conference on Commu",
  "content_length": 32977,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:38"
}