{
  "name": "Natacha Crooks",
  "homepage": "https://nacrooks.github.io",
  "status": "success",
  "content": "Natacha Crooks I am an Assistant Professor at UC Berkeley in the Department of Electrical Engineering and Computer Science (EECS). I work at the intersection of distributed systems, databases and security. I am a founding member of the SkyLab, a member of the Data Systems and Foundations Group as well as the Berkeley Center for Decentralized Intelligence. I am a Sloan Fellow and recipient of an NSF CAREER Award. On the industrial side, I am a visiting researcher at Azure Research, Security & Privacy. Previously I was a Scientific Advisor at Improbable on their metaverse project and a Strategic Advisor at Astronomer. Before that, I worked at Materialize, a new streaming SQL materialized view engine. I obtained my PhD from the University of Texas at Austin under the supervision of Lorenzo Alvisi and where I was part of the Laboratory for Advanced Systems Research. I obtained the ACM Dennis Ritchie Doctoral Research Award for the Best Dissertation in Systems Research. I also obtained an Honorable Mention for the SIGMOD Jim Gray Doctoral Research Award for the Best Dissertation in Database Research. Previously, I was a visiting researcher at Cornell University, a student at MPI-SWS, and at the University of Cambridge. I also obtained my undergraduate degree in Cambridge. In the more or less distant past, I worked at INRIA in the WHISPER team (2016, Paris, France), at Microsoft Research in the DMX group (2015, Redmond, USA), at Imperial College (2012, London, UK) in the Large-Scale Data & Systems Group, and at the Max Planck Institute for Software Systems in the Dependable Systems Group (2011, Saarbrucken, Germany). Before that, I worked on the JMEDS Framework for Web Services in Materna GmBH (2010, Dortmund, Germany). An even longer time ago, I took the French Baccalaureate (2008). I am originally from the lovely area of Belleville, in Paris.",
  "content_length": 1870,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:30"
}