{
  "name": "Natasa Przulj",
  "homepage": "https://mbzuai.ac.ae/study/faculty/natasa-przulj",
  "status": "success",
  "content": "Natasa Przulj - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Natasa Przulj Natasa Przulj Professor of Computational Biology Share Nataša Pržulj is a Professor of Computational Biology at Mohamed Bin Zayed University of Artificial Intelligence (MBZUAI). She has been a Full Professor of Computer Science at University College London since 2016 and has held a prestigious Catalan Institution for Research and Advanced Studies (ICREA) Research Professorship since 2019. Professor Pržulj is a leader in biological network analysis and a pioneer in network biology geometry applied to personalized (precision) medicine. In 2004, she introduced graphlets to extract biomedical knowledge from molecular networks, revolutionizing the field. Graphlets are a basis of many AI methodologies to produce feature vectors and matrices capturing network topology that are inputted into many AI/ML algorithms for network data analytics in various domains. They are the subject of around 23,000 research papers and hundreds of patents according to Google Scholar. Professor Pržulj’s current research focuses on developing new AI methods for multi-omics data fusion applied to precision medicine and discovery of precision therapeutics. Ph.D. in computer science from the University of Toronto in 2005. Professor Pržulj’s research has been supported by over €27 million in competitive research funding. Notably, she received three prestigious, single PI, European Research Council (ERC) grants: ERC Consolidator (2018-2025), ERC Proof of Concept (2020-2023) and ERC Starting (2012-2017). She also received an NSF Career award at UC Irvine, California, USA (2007-2011). She has been elected to many academies and learned societies, including: Fellow of the International Society for Computational Biology (ISCB), in 2024; Fellow of The European Laboratory for Learning and Intelligent Systems (ELLIS), in 2024; Fellow of the British Computer Society (BCS) Academy of Computing, in 2013; Academia Europaea, The Academy of Europe, in 2017; The Serbian Royal Academy of Scientists and Artists (SKANU), in 2019; Scientific Advisor of the Mathematics Institute of the Serbian Academy of Sciences and Arts (SANU), in 2012; etc. In 2014, Professor Pržulj received the British Computer Society Roger Needham Award, sponsored by Microsoft Research, in recognition of the potential her research has to revolutionize health and pharmaceutics. Zuqi Li, Sam F L Windels, Noël Malod-Dognin, Seth M Weinberg, Mary L Marazita, Susan Walsh, Mark D Shriver, David W Fardo, Peter Claes, Nataša Pržulj, Kristel Van Steen, Clustering individuals using INMTD: a novel versatile multi-view embedding framework integrating omics and imaging data, Bioinformatics, Volume 41, Issue 4, April 2025, btaf122, https://doi.org/10.1093/bioinformatics/btaf122 Mihai Pop, Teresa K Attwood, Judith A Blake, Philip E Bourne, Ana Conesa, Terry Gaasterland, Lawrence Hunter, Carl Kingsford, Oliver Kohlbacher, Thomas Lengauer, Scott Markel, Yves Moreau, William S Noble, Christine Orengo, B F Francis Ouellette, Laxmi Parida, Natasa Przulj, Teresa M Przytycka, Shoba Ranganathan, Russell Schwartz, Alfonso Valencia, Tandy Warnow, Biological databases in the age of generative artificial intelligence, Bioinformatics Advances, Volume 5, Issue 1, 2025, vbaf044, https://doi.org/10.1093/bioadv/vbaf044 Nataša Pržulj, Noël Malod-Dognin, Simplicity within biological complexity, Bioinformatics Advances, Volume 5, Issue 1, 2025, vbae164, https://doi.org/10.1093/bioadv/vbae164 Sam F L Windels, Daniel Tello Velasco, Mikhail Rotkevich, Noël Malod-Dognin, Nataša Pržulj, Graphlet-based hyperbolic embeddings capture evolutionary dynamics in genetic networks, Bioinformatics, Volume 40, Issue 11, November 2024, btae650, https://doi.org/10.1093/bioinformatics/btae650 Katarina Mihajlović, Noël Malod-Dognin, Corrado Ameli, Alexander Skupin, Nataša Pržulj, MONFIT: multi-omics factorization-based integration of time-series data sheds light on Parkinson’s disease, NAR Molecular Medicine, Volume 1, Issue 4, October 2024, ugae012, https://doi.org/10.1093/narmme/ugae012 Andreas Maier, Michael Hartung, Mark Abovsky, Klaudia Adamowicz, Gary D Bader, Sylvie Baier, David B Blumenthal, Jing Chen, Maria L Elkjaer, Carlos Garcia-Hernandez, Mohamed Helmy, Markus Hoffmann, Igor Jurisica, Max Kotlyar, Olga Lazareva, Hagai Levi, Markus List, Sebastian Lobentanzer, Joseph Loscalzo, Noel Malod-Dognin, Quirin Manz, Julian Matschinske, Miles Mee, Mhaned Oubounyt, Chiara Pastrello, Alexander R Pico, Rudolf T Pillich, Julian M Poschenrieder, Dexter Pratt, Nataša Pržulj, Sepideh Sadegh, Julio Saez-Rodriguez, Suryadipto Sarkar, Gideon Shaked, Ron Shamir, Nico Trummer, Ugur Turhan, Rui-Sheng Wang, Olga Zolotareva, Jan Baumbach, Drugst.One — a plug-and-play solution for online systems medicine and network-based drug repurposing, Nucleic Acids Research, Volume 52, Issue W1, 5 July 2024, Pages W481–W488, https://doi.org/10.1093/nar/gkae388 Google Scholar Profile ORCID Profile Related Thursday, November 13, 2025 AI Innovation Day at MBZUAI unites UAE leaders to shape the future of AI in healthcare The event welcomed more than 200 healthcare leaders and featured talks and presentations by MBZUAI faculty about… on campus conference innovation healthcare research health AI Innovation Day Read more Friday, October 10, 2025 MBZUAI and Cleveland Clinic Abu Dhabi showcase AI advances for UAE healthcare challenges Researchers and clinicians came together in Abu Dhabi to put the spotlight on AI innovations designed to… vision cardiovascular diabetes hospital public health partnerships healthcare innovation collaborations health Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 7320,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:42"
}