{
  "name": "Natassa Ailamaki",
  "homepage": "https://people.epfl.ch/anastasia.ailamaki",
  "status": "success",
  "content": "Anastasia Ailamaki — People - EPFL Anastasia Ailamaki Edit profile Full Professor anastasia.ailamaki@epfl.ch +41 21 693 75 64 Anastasia Ailamaki is a Professor of Computer and Communication Sciences at the École Polytechnique Fédérale de Lausanne (EPFL), a visiting researcher at Google, and the co-founder and Chair of the Board of Directors of RAW Labs SA, a Swiss company developing systems to analyze heterogeneous big data from multiple sources efficiently. Her research interests are in data-intensive systems and applications, and in particular:(a) in strengthening the interaction between the database software and emerging hardware and I/O devices, and (b) in automating data management to support computationally- demanding, data-intensive scientific applications. She earned a Ph.D. in Computer Science from the University of Wisconsin-Madison in 2000. She has received the 2019 ACM SIGMOD Edgar F. Codd Innovations Award and the 2020 VLDB Women in Database Research Award. She is also the recipient of an ERC Consolidator Award (2013), the Finmeccanica endowed chair from the Computer Science Department at Carnegie Mellon (2007), a European Young Investigator Award from the European Science Foundation (2007), an Alfred P. Sloan Research Fellowship (2005), an NSF CAREER award (2002), twelve best-paper awards and three Test-of-Time prizes at international scientific conferences. She has received the 2018 Nemitsas Prize in Computer Science by the President of Cyprus and the 2021 ARGO Innovation Award by the President of the Hellenic Republic. She is an ACM fellow, an IEEE fellow, a member of the Academia Europaea, and an elected member of the Swiss, the Belgian, the Greek, and the Cypriot National Research Councils. Full Professor, Data-Intensive Applications and Systems Laboratory EPFL IC IINFCOM DIAS BC 226 (Bâtiment BC) Station 14 1015 Lausanne +41 21 693 75 64 Office: BC 226 EPFL > IC > IINFCOM > DIAS Web site: Web site: https://dias.epfl.ch/ Full Professor, SIN - Teaching EPFL > IC > IC-SIN > SIN-ENS Web site: Web site: https://sin.epfl.ch Full Professor, SSC - Teaching EPFL > IC > IC-SSC > SSC-ENS Web site: Web site: https://ssc.epfl.ch Member, EPFL Academic strategic committee EPFL > VPA > VPA-FAC > ASC vCard Données administratives Fields of expertise Database management systems, scientific applications, computer architecture Publications Infoscience publications Infoscience extract Filtered Vector Search: State-of-the-Art and Research OpportunitiesY. Chronis; H. Caminal; Y. Papakonstantinou; F. Özcan; A. AilamakiProceedings of the VLDB Endowment. 2025. DOI : 10.14778/3750601.3750700.Detailed recordView at publisherStatic Typing Meets Adaptive Optimization: A Unified Approach to Recursive QueriesA. Herlihy; A. Ailamaki; M. Odersky2025. SIGMOD/PODS '25: International Conference on Management of Data, Berlin, Germany, 2025-06-22 - 2025-06-27. p. 1 - 6. DOI : 10.1145/3735106.3736533.Detailed recordView at publisherThe Effectiveness of Compression for GPU-Accelerated Queries on Out-of-Memory DatasetsH. Nicholson; K. Chasialis; A. Boffa; A. Ailamaki2025. SIGMOD/PODS '25: International Conference on Management of Data, Berlin Germany. p. 1 - 10. DOI : 10.1145/3736227.3736240.Detailed recordView at publisherThe Cambridge Report on Database ResearchA. Ailamaki; S. Madden; D. Abadi; S. Amer-Yahia; G. Alonso et al.2025Detailed recordView at publisherTrustworthy and Efficient LLMs Meet DatabasesK.-M. Kim; A. Ailamaki2024Detailed recordPixelsDB: Serverless and NL-Aided Data Analytics with Flexible Service Levels and PricesH. Bian; D. Geng; H. Li; Y. Chai; A. Ailamaki2024Detailed recordThe Effect of Scheduling and Preemption on the Efficiency of LLM Inference ServingK.-M. Kim; K. Hong; C. Gulcehre; A. Ailamaki2024Detailed recordOptimizing Context-Enhanced Relational JoinsV. Sanca; M. Chatzakis; A. Ailamaki2024. IEEE 40th International Conference on Data Engineering (ICDE), Utrecht, Netherlands, 2024-05-13 - 2024-05-16. p. 501 - 515. DOI : 10.1109/ICDE60146.2024.00045.Detailed recordView at publisherAdaptive Recursive Query OptimizationA. Herlihy; G. Martres; A. Ailamaki; M. Odersky2024. IEEE 40th International Conference on Data Engineering (ICDE), Utrecht, Netherlands, 2024-05-13 - 2024-05-17. p. 368 - 381. DOI : 10.1109/ICDE60146.2024.00035.Detailed recordView at publisherOptimizing Goodput through Sharing for Batch Analytics with DeadlinesS. K. Venkatesh; P. Sioulas; A. Pradhan; R. Subramanya; I. Mytilinis et al.2024. International Conference on Extending Database Technology, PAESTUM, ITALY, 2024-03-25 - 2024-03-28. DOI : 10.48786/edbt.2024.29.Detailed recordView at publisherOligolithic Cross-task Optimizations across Isolated Workloads.E. Zapridou; P. Sioulas; A. Ailamaki2024. 14th Annual Conference on Innovative Data Systems Research (CIDR’24), Chaminade, USA, January 14–17, 2024,. Detailed recordEfficient Operational Analytics on Fresh DataA. Raza / A. Ailamaki (Dir.) Lausanne, EPFL, 2024. DOI : 10.5075/epfl-thesis-9830. Detailed recordView at publisherEfficient Data Access Paths for Mixed Vector-Relational SearchV. Sanca; A. Ailamaki2024. 20th International Workshop on Data Management on New Hardware (DaMoN), Santiago, Chile, June 10, 2024. Detailed recordEfficient Approximate Analytics via Adaptive Context-Conscious Query ProcessingV. Sanca / A. Ailamaki (Dir.) Lausanne, EPFL, 2024. DOI : 10.5075/epfl-thesis-9829. Detailed recordView at publisherEfficient and Reusable Lazy SamplingV. Sanca; P. Chrysogelos; A. AilamakiSIGMOD Record. 2024. Detailed recordEfficient Model-Relational Data Management: Challenges and OpportunitiesV. Sanca; A. AilamakiIEEE Transactions on Knowledge and Data Engineering. 2024. DOI : 10.1109/TKDE.2024.3384276.Detailed recordView at publisherHPCache: memory-efficient OLAP through proportional caching revisitedH. Nicholson; P. Chrysogelos; A. AilamakiVldb Journal. 2023. DOI : 10.1007/s00778-023-00828-7.Detailed recordView at publisherDetermining an optimum quantity of interleaved instruction streams of defined coroutinesG. Psaropoulos; T. Legler; N. May; A. AilamakiSAP: US11789741 ; US2019278608 . 2023.Detailed recordChaosity: Understanding Contemporary NUMA-architecturesH. Nicholson; A. Nica; A. Raza; V. Sanca; A. Ailamaki2023. Fifteenth TPC Technology Conference on Performance Evaluation & Benchmarking (TPCTC 2023), Vancouver, Canada, August 28, 2023. Detailed recordPost-Moore's Law Fusion: High-Bandwidth Memory, Accelerators, and Native Half-Precision Processing for CPU-Local AnalyticsV. Sanca; A. Ailamaki2023. Workshop on Accelerating Analytics and Data Management Systems (ADMS’23), Vancouver, Canada, August 28 - September 1, 2023. Detailed recordE-Scan: Consuming Contextual Data with Model PluginsV. Sanca; A. Ailamaki2023. Second International Workshop on Composable Data Management Systems (CDMS’23), Vancouver, Canada, August 28 - September 1, 2023. Detailed recordImproving K-means Clustering Using SpeculationS. Igescu; V. Sanca; E. Zapridou; A. Ailamaki2023. Workshop on Applied AI for Database Systems and Applications (AIDB’23), Vancouver, Canada, August 28 - September 1, 2023. Detailed recordUsing Cloud Functions as Accelerator for Elastic Data AnalyticsH. Bian; T. Sha; A. Ailamaki2023. ACM SIGMOD/PODS International Conference on Management of Data, Seattle, Washington USA, June 18-23, 2023. DOI : 10.1145/3589306.Detailed recordView at publisherOne-shot Garbage Collection for In-memory OLTP through Temporality-aware Version StorageA. Raza; P. Chrysogelos; A. C. Anadiotis; A. Ailamaki2023. DOI : 10.1145/3588699.Detailed recordView at publisherHetCache: Synergising NVMe Storage and GPU acceleration for Memory-Efficient AnalyticsH. Nicholson; A. Raza; P. Chrysogelos; A. Ailamaki2023. 13th Annual Conference on Innovative Data Systems Research (CIDR 2023), Amsterdam, The Netherlands, January 8-11, 2023. Detailed recordEfficient Concurrent Analytical Query Processing using Data and Workload-conscious SharingP. Sioulas / A. Ailamaki (Dir.) Lausanne, EPFL, 2023. DOI : 10.5075/epfl-thesis-8975. Detailed recordView at publisherAnalytical Engines With Context-Rich Processing: Towards Efficient Next-Generation AnalyticsV. Sanca; A. Ailamaki2023. IEEE 39th International Conference on Data Engineering (ICDE), Anaheim, California, USA, April 3-8, 2023. DOI : 10.1109/ICDE55515.2023.00298.Detailed recordView at publisherLAQy: Efficient and Reusable Query Approximations via Lazy SamplingV. Sanca; P. Chrysogelos; A. Ailamaki2023. 2023 ACM SIGMOD/PODS Conference, Seattle, WA, USA, June 18-23, 2023. DOI : 10.1145/3589319.Detailed recordView at publisherFrom Self-managed Database Systems to Runtime-intelligent AnalyticsA. Ailamaki2023. IEEE 39th International Conference on Data Engineering (ICDE), Anaheim, CA, Apr 03-07, 2023. p. 91 - 91. DOI : 10.1109/CDEW58674.2023.00020.Detailed recordView at publisherThe Formidable Mid-Career CrisisM. T. Ozsu; A. AilamakiSigmod Record. 2022. DOI : 10.1145/3572751.3572761.Detailed recordView at publisherAdaptive table placement in NUMA architecturesT. Scheuer; I. Psaroudakis; A. Sellami; N. May; A. AilamakiSAP: US11275721 ; US2017017674 . 2022.Detailed recordEfficient Massively Parallel Join Optimization for Large QueriesR. Mancini; S. K. Venkatesh; B. Chandra; V. Mageirakos; A. Ailamaki2022. International Conference on Management of Data (SIGMOD), Philadelphia PA, USA, June 12-17, 2022. p. 122 - 135. DOI : 10.1145/3514221.3517871.Detailed recordView at publisherSampling-Based AQP in Modern Analytical EnginesV. Sanca; A. Ailamaki2022. SIGMOD/PODS '22: International Conference on Management of Dataent on New Hardware, Philadelphia PA, USA, June 13, 2022. p. 1 - 8. DOI : 10.1145/3533737.3535095.Detailed recordView at publisherDalton: Learned Partitioning for Distributed Data StreamsE. Zapridou; I. Mytilinis; A. Ailamaki2022. International Conference on Very Large Databases (VLDB 2022), Sydney, Australia, September 5-9, 2022. p. 491 - 504. DOI : 10.14778/3570690.3570699.Det",
  "content_length": 66790,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:42"
}