{
  "name": "Natalia Villanueva-Rosales",
  "homepage": "https://www.utep.edu/newsfeed/campus/Smart-Cities-Grant-Fosters-International-Collaborations.html",
  "status": "success",
  "content": "Smart Cities Grant Fosters International Collaborations Skip to main content Miner Alert Main Content Smart Cities Grant Fosters International Collaborations Last Updated on July 05, 2017 at 12:00 AM Originally published July 05, 2017 By Lauren Macias-Cervantes UTEP Communications An interdisciplinary team from The University of Texas at El Paso led by Natalia Villanueva Rosales, Ph.D., assistant professor in the Department of Computer Science, has been awarded a grant from the National Science Foundation to fund an Interdisciplinary Research Experience for Students (IRES) Program. UTEP students and faculty visited UdeG June 20–July 2, 2017 to finish the implementation of their Smart Cities solutions and participate in the IBM Smart Cities Hackathon. Photo: Miguel de la Rosa/UdeG The $239,000 grant will support the collaboration with the University of Guadalajara (UdeG) and three cohorts of 10 students each – undergraduate and graduate – for a total of 30 students in three years. “We are preparing the workforce for the demands that are there,” Villanueva Rosales said. “Half of the population lives in urban cities, and all the stress that we are putting on the cities and the infrastructure is very high. We are trying to find more sustainable and environmentally friendly solutions. With this program, we are training professionals to effectively collaborate in teams with members across disciplines, cultures and borders demanded by worldwide initiatives driven by industry, academia and government to create smart cities.” A smart city is characterized by its ability to integrate people, technology and information to create a sustainable and resilient infrastructure that provides high quality services for residents, Villanueva Rosales explained. The IRES Program research focuses on sensor data management, data analytics and multi-modal optimization. Students will develop innovative solutions for smart mobility and smart buildings related to scalability, modularity, interoperability and relevant smart cities services, resilience and security. “We realized that to convert cities into smart cities we really need to start looking at applications that have no borders and that can be applied in different cities and require interdisciplinary work,” Villanueva Rosales said. The partnership with the University of Guadalajara is strategic. Students have access to a smart city testbed equipped with cutting-edge technology at the University of Guadalajara in Mexico: Ciudad Creativa Digital. The city of Guadalajara was selected by the Institute of Electrical and Electronics Engineers as the world’s first smart city in 2014. “It’s very important that they have this global perspective,” Villanueva Rosales said. “They’re not just inventing things, they’re looking at what is out there and how it can be reused and how they can improve the quality of life.” While the IRES grant is new, the partnership between the two universities and work on smart cities is not. The IRES program builds on an existing collaboration with faculty at the Mexican university. Last year the universities took part in the 100,000 Strong in the Americas program.  In June, students visited each other’s campuses as they participated in the U.S.-Mexico Bidirectional Program on Smart Cities sponsored by IBM. The program is led by Kelvin Cheu, Ph.D., UTEP professor of civil engineering, and enables the binational cooperation of 32 undergraduate and graduate students from UTEP and UdeG to develop innovative smart cities solutions to common challenges in El Paso and Guadalajara. In teams of four students – two from UTEP and two from UdeG – across disciplines, undergraduates and graduate students work together for a period of five weeks on challenges addressing smart mobility, smart building and smart healthcare. “Working with people from a different university and different disciplines helps you grow,” said computer science doctoral candidate Alejandro Vargas. “They have different ideas, see things from a different point of view. I hope to see new problems that can be tackled and things that have been implemented that perhaps can work here in El Paso.” Vargas and his team decided to work on a solution to smart mobility. “We decided to focus on mobility and helping people who are visually impaired,” said Sarah Ponce de Leon, an undergraduate in civil engineering. “Specifically, our app allows them to take public transportation independently using text-to-speech and speech-to-text along with visual recognition. We found the problem to be more prevalent in Guadalajara.” The team presented their project, along with the rest of the cohort, to a team of industry experts for feedback and further collaboration. Teams had to show how their idea solves a problem that exists. Work included extensive research, talking with experts and key stakeholders and learning how to complete a business case – something that is not traditional for an engineering student. “Usually in engineering fields like computer science, students spend a significant amount of time behind the computer and don’t deal with people or have good social skills,” said Victor Larios, Ph.D., professor in the Department of Information Systems at the University of Guadalajara. “In this case, we are leveraging that and creating other support for them to supplement their education as future researchers.” As the sponsor, IBM offers its technology, making it possible for functional prototypes in the near future. Student teams will also publish white papers to share their ideas and research. “I really think that this generation of students care about the impact that their applications will have,” Villanueva Rosales said. “When you talk to them, it’s not about how much money they will make but how they are going to benefit society, and smart cities is all about improving the quality of life.” UTEP hosts students from UdeG for one week, and UTEP students visit UdeG SCLL for two weeks. Activities in the program include field trips to city agencies and industry partners, and a Smart Cities Hackathon organized by IBM.",
  "content_length": 6115,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:34"
}