{
  "name": "Natalie Schluter",
  "homepage": "https://pure.itu.dk/portal/en/persons/natalie-elaine-schluter(879e7ac4-e64c-4c5f-9591-421e56cd0678).html",
  "status": "success",
  "content": "Natalie Schluter - IT-University of Copenhagen Natalie Schluter Associate Professor, Theoretical Computer ScienceNLPnorthMachine LearningAlgorithms https://orcid.org/0000-0001-8215-4801 Emailnaelitudk 20102020 Research activity per year Personal profile KeywordsData scienceNatural language processingAlgorithms and machine learning Fingerprint Dive into the research topics where Natalie Schluter is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 4 Similar Profiles Parsing Computer Science 100% Automatic Summarization Computer Science 50% Word Embedding Computer Science 50% Cross-lingual Keyphrases 45% Taggers Keyphrases 37% Part-of Keyphrases 37% Dependency Parsing Keyphrases 37% Deep Neural Network Computer Science 37% View full fingerprint Research output Research output per year 2010 2014 2016 2017 2018 2019 2020 15 Article in proceedings 1 Journal article 1 Conference article 1 PhD thesis Research output per year Research output per year DaNewsroom: A Large-scale Danish Summarisation DatasetVarab, D. & Schluter, N., Apr 2020, Proceedings of the 12th Conference on Language Resources and Evaluation (LREC 2020). European Language Resources Association, p. 6731–6739 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Automatic Text Summarization 100% Summarization Dataset 100% Automatic Summarization 100% English (Language) 100% English 100% Recurrent models and lower bounds for projective syntactic decodingSchluter, N., 2019, Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Vol. Volume 1 (Long and Short Papers). p. 251-260 10 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Recurrent Model 100% Maximum Spanning Tree 100% Syntactics 100% Spanning Tree 100% Graph-based 50% The Lacunae of Danish Natural Language ProcessingKirkedal, A. S., Plank, B., Derczynski, L. & Schluter, N., 2019, Proceedings of the Nordic Conference of Computational Linguistics (2019). Linköping University Press, p. 356–362 (NEALT (Northern European Association of Language Technology) Proceedings Series).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Natural Language Processing 100% Lacunae 100% Danish 100% Tradition 66% Scientific Innovations 50% Baselines and test data for cross-lingual inferenceAgic, Z. & Schluter, N., 7 May 2018, Proceedings of the Eleventh International Conference on Language Resources and Evaluation (LREC 2018). European Language Resources Association, p. 3890-3894 5 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Natural Language Processing 100% Machine Translation 100% Word Embedding 100% Average Accuracy 100% Deep Neural Network 100% The glass ceiling in NLPSchluter, N., 31 Oct 2018, Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, p. 2793-2798 6 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile NLP. 100% Evidence-based 50% View all 18 research outputs Projects Projects per year 2019 2020 2025 4 Finished Projects per year Danish Language Inclusion: High-speed high-quality bootstrapping of large-scale research resourcesSchluter, N. (PI) & Poulsen, S. (CoI)Carlsberg Foundation01/01/2019 → 31/12/2021Project: Research Large-scale Research 100% Bootstrap 100% Language Inclusion 100% Danish Language 100% Research Resources 100% NLP-assisted rewriting of Standard Operation Procedures in a GMP-regulated environmentSchluter, N. (PI) & Varab, D. (PI)Innovation Fund Denmark01/01/2020 → 30/04/2023Project: Research Everyday Language 100% Operation Procedure 100% Summarization Technique 100% Regulated Environment 100% Practioners 100% FaDa: Enabling language technology for the Faroe Islands and Denmark through coordinated collaboration Schluter, N. (PI) & Derczynski, L. (CoI)Danish Agency for Higher Education and Science01/08/2020 → 31/07/2021Project: Research Faroe Islands 100% Network Programs 100% Denmark 100% International Networks 100% Language Technology 100% GOOGLELOWNLP: Probing sound for better low-resource NLPHardmeier, C. (CoI), Schluter, N. (PI), Sasu, D. (CoI) & Ulmer, D. T. (CoI)Google Inc.01/01/2020 → 14/08/2025Project: Other Press/Media 15 vigtige forskningsdebatter du skal besøge til FolkemødetSchluter, N.10/06/20191 Media contributionPress/Media: Press / Media Flere kvinder på IT-uddannelserSchluter, N.12/05/20191 Media contributionPress/Media: Press / Media DATADETEKTIVER ER OGSÅ KVINDERSchluter, N.05/04/20191 Media contributionPress/Media: Press / Media Danske universiteter dumper på ligestillingSchluter, N.08/03/20181 Media contributionPress/Media: Press / Media Danmark er dårligst til ligestilling blandt forskereSchluter, N.08/03/20181 Media contributionPress/Media: Press / Media View all 17 press/media Activities Activities per year 2018 2018 2019 2019 2 Organisation and participation in conference Activities per year 1st Conference of Women in Data Science (WiDS) CopenhagenPlank, B. (Conference Chair) & Schluter, N. (Conference Chair)16 Apr 2019Activity: Participating in or organising an event types › Organisation and participation in conference 2019 Annual Conference of the North American Chapter of the Association for Computational LinguisticsSchluter, N. (Other (please specify))1 Sept 2018 → 30 Jun 2019Activity: Participating in or organising an event types › Organisation and participation in conference",
  "content_length": 5939,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:37"
}