{
  "name": "Natasha Sharygina",
  "homepage": "http://www.inf.usi.ch/faculty/sharygina",
  "status": "success",
  "content": "Natasha Sharygina: Home Page Home Research USI Group Tools Service Funding Prof. Dr. Natasha Sharygina Full Professor PhD: UT Austin 2002 Publications: DBLP, Google Scholar Some lecture videos: Tutorial at Facebook, London (starts at 00:47:11), Presentation at ETH, Zurich Press: SwissInfo Article, Microsoft Research Blog Address: Università della Svizzera Italiana (University of Lugano), USI Informatics Department East Campus, Sector D, Office D4.18, Via la Santa 1, CH-6962 Lugano-Viganello, Switzerland. [email protected] +41 (0)58 66 64299 My primary research interests are in formal verification, using model checking and related logic-based reasoning, with the focus on the integrated development of efficient SAT/SMT solvers. I joined USI in 2005 by moving from \t\tCarnegie Mellon University (CMU) after receiving a career award from the Swiss Tasso Foundation. At USI I established the USI Formal Verification and Security Lab, which projects focus on automated formal verification with a particular interest in software/hardware model checking for safety analysis and information security. We create both theoretical frameworks and practical tools to enable sound and scalable verification of industrial-size computer systems. Research of my Lab has been supported by USI, Swiss National Science Foundation, Hasler Foundation and EU STReP and COST projects. Current Initiatives In progress (1) (2019 - 2023) Beyond Symbolic Model Checking through Deep Modelling Completed (9) (2017 - 2019) From Parallel SMT to Parallel Software Verification (2016 - 2018) Guiding SMT-Based Interpolation for Program Verification (2014 - 2018) Runtime Verification beyond Monitoring (ARVI) (2014 - 2016) Harnessing Parallel Computing for Model Checking (2013 - 2015) Quality of Interpolants in Model Checking ​​(2010 - 2013) Pincette -- Validating Changes and Upgrades in Networked Software (2009 - 2013) Rich-Model Toolkit - An Infrastructure for Reliable Computer Systems (2008 - 2010) Detection of Security Vulnerabilities by Guided Model Checking - extension (2006 - 2008) Detection of Security Flaws and Vulnerabilities by Guided Model Checking Free Hit Counter Last updated in December, 2022.",
  "content_length": 2192,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:42"
}