{
  "name": "Nathan Malkin",
  "homepage": "https://malk.in",
  "status": "success",
  "content": "Nathan Malkin Hello my name is Nathan Malkin I'm an assistant professor in the Department of Informatics at New Jersey Institute of Technology (NJIT) in the New York City metro area. Previously, I received my PhD in computer science from UC Berkeley and was a postdoctoral researcher at the University of Maryland. Email Github LinkedIn I'm actively recruiting PhD students to join the SPUR Lab, my research group, in Fall 2026. Research Through my research in human-centered security and privacy, I strive to make technology more private and secure by studying and simplifying people's decisions. My work lies at the intersection of (cyber)security & privacy with human-computer interaction & social computing. I use observations and experiments, as well as surveys and interviews, to understand how human factors (people's individual abilities and limitations, and group behaviors and processes) contribute to privacy and security problems. I then design systems to overcome these challenges and empirically validate them with user studies and real-world deployments. My current interests include designing novel privacy interfaces for AI agents and ubiquitous-computing environments, helping vulnerable users get better security advice, and improving privacy and security habits and education. Previous work has focused on privacy controls for always-listening devices, including smart speakers and smart TVs. I've also drawn on behavioral economics to help users make security decisions while avoiding cognitive biases. See my publications for more details of my research. Teaching Spring 2026: IS 633 – Human Factors in Security and Privacy Fall 2025: IS 393 – Usable Security and Privacy Spring 2025: IS/CS 698 – Human Factors in Security and Privacy Fall 2024: IS/CS 485 – Usable Security and Privacy Spring 2024: IS/CS 698 – Human Factors in Security and Privacy Guest lectures: Cornell Tech, Columbia/Barnard Professional service 2026: IEEE Security & Privacy, ACM CHI (associate chair), SOUPS workshops co-chair 2025: USENIX Security, PETS, ACM CCS, ACM CHI (associate chair), ACM Transactions on Privacy and Security (associate editor), SOUPS workshops co-chair 2024: USENIX Security, PETS, ACM Transactions on Privacy and Security (associate editor) 2023: USENIX Security, IEEE Security & Privacy, NDSS, CHI, SecHOPE Special Recognitions for Outstanding Reviews: ACM CHI 2017, 2018, 2021, 2022, 2023, 2024, 2025; PETS 2024 Please consider submitting your work to these and other usable security venues! Resources I've started posting resources and advice that I hope may be useful, including: calendar of deadlines for usable security & privacy conferences collection of readings on various usability, privacy, and security topics tutorial on using Zotero for bibliography management advice for writing a Statement of Purpose for PhD admissions and more! × My email address is: nathan.malkin at njit.edu",
  "content_length": 2915,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:45"
}