{
  "name": "Nathan R. Sturtevant",
  "homepage": "https://www.movingai.com",
  "status": "success",
  "content": "Moving AI Lab Moving AI Lab Pathfinding Resources Grid-Based Path Planning Competition Pathfinding Benchmarks Current Research EPCG Bidirectional Search Chinese Checkers External Memory Search Machine Learning in Search Multi-Agent Pathfinding Single-Agent Pathfinding Suboptimal Search Selected Demos Sliding Tile Puzzle A* IDA* JPS IBEX/BTS Suboptimal Search Selected Videos A* Tie Breaking A* Variations Weighted A* Inconsistent Heuristics Pinball f-LRTA* Rubik's Cube DFS vs DFID A* and Dijkstra IDA* JPS variants Moving AI Lab Nathan R. Sturtevant AAAI Fellow (as of 2026) Canada CIFAR chair Alberta Machine Intelligence Institute (Amii) Fellow Professor, Department of Computing Science, University of Alberta Office: UComm 6-183 The Moving AI lab does research broadly in Artificial Intelligence. This includes work that includes but is not limited to heuristic search (single-agent, multi-agent, game-tree), learning (in search and traditional games), game playing, and video games. Our pathfinding research has been implemented in commercial games (Dragon Age: Origins and the upcoming Nightingale). Information for prospective MSc and PhD students. Broad resources of community interest: Benchmark problems for: 2D grids Voxel grids Multi-agent Path Planning (MAPF) Historical Grid-Based Path Planning Competition data. (We are working to revive this, but plans were disrupted by COVID-19.) Interactive heuristic search demos. These cover many basic and advanced heuristic search algorithms. These demos and other research is implemented in the HOG2 platform. Graduate lectures on Single Agent Search Recent additions of interest: Exhaustive Procedural Content Generation: Snakebird Heuristic Search Demos: Budgeted Tree Search: IDA* replacement with better worst-case performance Weighted A* (XDP): Simple modification to Weighted A* that often finds suboptimal solutions more efficiently, especially on hard problems Content: ©Nathan Sturtevant, All rights reserved.",
  "content_length": 1978,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:46"
}