{
  "name": "Nathaniel D. Osgood",
  "homepage": "https://www.cs.usask.ca/~osgood",
  "status": "success",
  "content": "Homepage of Nathaniel Osgood -- Combining Data Science, Systems Science, Computational Science and Mathematics for Health Insight and Decision Making Nathaniel Osgood Nathaniel Osgood - Professor Email: osgood@cs.usask.ca Office : 254.4 Thorvaldson (Computational Epidemiology and Public Health Informatics Lab) Phone: (306) 966 6102 Fax: (306) 966 4884 Email: osgood 'at' cs.usask.ca BS EECS (MIT), MS EECS (MIT), PhD CS (MIT) Professor, Department of Computer Science Associate Faculty, Department of Community Health & Epidemiology Associate Faculty, Bioengineering Division (CV) (Google Scholar) (LinkedIn) (Youtube) (Selected dynamic models pubs) (Selected combos of dynamic modeling & machine learning) (Avicenna (formerly Ethica Health)) Research Interests -- Combining Systems Science, Compositional Data Science, Applied Category Theory, Computational Science, Higher & Applied Math to improve decision making in health and healthcare My research is focused on providing cross-linked system simulation, categorical systems science, applied category theory, mobile data collection, and theory-informed machine learning/artificial intelligence tools, and Applied Category Theory to inform decision making in health. Such tools can, for example, aid public health decision makers in putting into place cost-effective preventive policies, design more effective screening or treatment strategies for an illness, help support epidemiological models that learn from incoming evidence and are kept perpetually up-to-date with the latest evidence so as to provide for more reliable policy planning. These methodologies can further enable insight into the causes underlying changes in the number of cases of a disease reported, and react more quickly to an outbreak of infectious disease when it occurs. Tools of choice include applied category theory (presheaves/C-Sets/models of double theories for mathematically transparent encoding of dynamic models and other structures, (double) categories of open diagrams, formal concept analysis, supplementing system science dynamic models (particularly Agent-Based models, System Dynamics, and discrete event simulation) with particle filtering and particle MCMC with such system science models, systems for visualizing state space reconstruction and for Convergent Cross Mapping (CCM), existing and novel machine learning and dynamic modeling toolsets, GPU-based computational statistics algorithms (PMCMC and Particle Filtering) and CM, and a growing amount of FPGA-based performance acceleration of key algorithms. Of late, I have a particularly strong focus on leveraging understanding from Applied Category Theory -- an area I find to offer compelling alignment with the systems science perspective, synergies with systems science techniques, the requisite power to deliver compelling insight, and an outstanding foundation for more powerful tools for study of complex systems. I am particularly committed to using applied category theory as the basis for use of higher-level functional programming and metalinguistic abstraction to enhance the clarity, transparency, concision, modularity, flexibility and power of languages for characterizing dynamic models. All such tools are applied within the health and community safety & well-being sphere, as this is our elected point of focus, inspiration and dedication. We further make extensive investment in machine learning to sharpen and broaden the health surveillance, including sheaf-based deep learning, UMAP, persistent homology and other forms topological data analysis, and with our Avicenna Research epidemiological smartphone and wearable-based data collection system, time series of search volumes, time series of machine-learning-classifed Twitter messages, web-scraped data, and other mechanisms. The types of data we obtain through surveillance data are classified using machine learning tools (including more traditional tools through to deep learning) to flag tweets of relevance and inform our particle-filtered and PMCMC-regrounded models. Various Internal and External Summaries of Aspects of my Work I list here some relevant links to varied summaries of our work. Here is a list of selected elements of my dynamic models (Agent-Based models, System Dynamics models, Hybrid Models, etc.) in Health. Background on examples of our work combining dynamic modeling (Agent-Based Models and System Dynamics modeling) and machine learning/artificial intelligence/computational statistics tools Particularly because I use it to disseminate updates on our work, and because there are others who share my name on LinkedIn, I note that my LinkedIn page can be found here Similarly, while I put a great deal of emphasis on making a difference in diverse ways that are not captured in publications and citations, my Google Scholar page can be found here Visitors interested in my innovations in contributing platforms for collection of big data and those interested my latest and entrepreneurial contributions may find of interest this link to the Avicenna Research (formerly Ethica Data Services) company for which I serve as co-founder and an ongoing contributor Those who enjoy video-based learning may be interested in the 1000's of videos of my lectures that I maintain on my Youtube Channel Spheres of Research: Further information Our work includes both application and methodological components. Health Applications On the application side, our research involves collaborating with cross-disciplinary teams to create tools to inform the design of health interventions that are high leverage, robust, and cost-effective. Such applications are almost always pursued in close collaboration with broader teams, frequently including those with close clinical familiarity of the diseases and/or pathogens involved (particularly doctors and nurses), epidemiologists, biostatisticians, public health nurses, and researchers or others involved in data collection and surveillance. Please see our applications page for more information on this work. Data sources that we tap in this area include smartphone and wearable based data collection (particularly via the Avicenna Research (formerly Ethica Health) epidemiological data collection system, which emerged from our iEpi project), social media and search mining. To help make sense of such data and make it actionable at policy, health services and clinical levels, we use a variety of tools, including Agent-Based modeling and ODE (System Dynamics, particularly when leveraged by Particle Filtering) and Discrete Event modeling & hybrids, MCMC, and PMCMC, deep learning for symptom and health-behaviour recognition, additional types of Machine Learning tools (e.g., HMMs and Bayesian Networks), CCM and State-Space Reconstruction. Much recent work has focused on fully homomorphic encryption and privacy-preserving technologies for health and social data. Where they fill a key gap, we also develop apps for smartphone and web platforms. Methodological Research Our methodological work reflects the fact that practitioners of dynamic modelling for public health currently face many hurdles and challenges in building, validating, executing, modifying and understanding their models. Please see our methodological work page for additional information. Avicenna Research (formerly Ethica Health) and iEpi Our most recent contribution here comes in terms of the Avicenna Research epidemiological data collection system, which provides a powerful platform for quickly defining , refining, running and monitoring, and analyzing and reporting on epidemiological data. This platform can tap into the exceptional power of smartphones as a health/mHealth data collection platform, but also leverages wearable devices and web-based data collection from consenting respondents. All of this work is undertaken in the context of strong privacy guarantees, including the capacity to pause data collection at any point, and (for many studies) the capacity for a respondent to retroactively delete previously collected data. For information on earlier versions of our smartphone-based Avicenna Research/Ethica Health/iEpi epidemiological monitoring system, please see information on the Avicenna Research epidemiological data collection system used globally and my iEpi page. Bootcamp on Combining Data Science and Systems Science (Big Data and Dynamic Modeling) for Health Registration and information for our coming 2019 bootcamp on Combining Data Science and Systems Science (Big Data and Dynamic Modeling) for Health 2019 (Jul 29-Aug 2, 2019) Click here to see videos from our 2018 bootcamp on combining Data Science and System Science. Selected Recent Publications Please see my publications page and Curriculum Vitae for lists of some recent publications. Model libraries and information You can find my recent free library of public health agent-based and hybrid model at these materials from my August 2018 bootcamp. Look in the \"Example Models\" folder. Videos & Screencasts Classes & Tutorials 2019 University of Saskatchewan Bootcamps For added information on the below, please write christine.hillis@usask.ca 2019 Bootcamp & Incubator on Understanding Health Behavior using Smartphones and Wearables June 24-26, 2019 This tutorial introduces researchers & practitioners to tools, practical skills and the conceptual background required to define,deploy, monitor & analyze mHealth studies with no programming, and assists participants in getting started in applying such techniques to studies and applications of their specific interest. This tutorial will include hands-on work with the popular Avicenna Research smartphone and wearable-based health data collection system, which has been used by researchers across 4 continents (between it and predecessors, in approximately 100 studies). Incubator participants will create first versions of mHealth studies in their areas of specific interest, including to build & test out custom study designs, ",
  "content_length": 14023,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:55"
}