{
  "name": "Nathan Friedman",
  "homepage": "https://www.cs.mcgill.ca/academic/undergrad/advising",
  "status": "success",
  "content": "McGill School Of Computer Science Inclusivity Statement Programs & Admissions Undergraduate Future Students Program Information Advising Graduate Future Students Program Information Courses TA Awards Funding Research Areas Tech Reports People Faculty Staff Community News & Events News Events UCORE Docs & Services Docs CS Accounts Public Resources Software Remote Access Tutorials Services Room Reservation Webmail Visitor Form Open positions Faculty Course Lecturer Research Student TA Donate About Contact Us Facilities Equity, Diversity and Inclusivity Resources and Groups Newsletter CS Internal KB Programs and Admissions Undergraduate Future Students Why McGill? Why CS? Information for Incoming Students Incoming Students Freshman (U0) CEGEP Choosing a Major Combining Studies Internships Applying Transfers Program Information Overview New Students Information for Incoming Students Programs Program Overview How Should I Plan My Computer Science Degree? Computer Games Option Bachelor of Science Bachelor of Arts Bachelor of Arts and Science Minor in Computer Science FAQ Advising Research UCORE Overview Resources Program Internships & Careers B.Sc/M.Sc (Thesis) Track Preparation for Graduate Studies Graduate Contact Information Future Students Overview M.Sc. Admission Requirements Ph.D. Admission Requirements How to Apply Application Deadlines FAQ Programs Masters M.Sc. Thesis M.Sc. Non-thesis Breadth Requirement Ph. D. Program Regulations Timeline Courses Courses TA Awards Funding Financial Information Scholarships and Financial Aid Advising This page has been replaced by this new advising page. Internal Add Content Admin Quick Links COVID-19 Room Bookings Facilities Contact Us Explore News Events Careers All content related requests should be sent to webadmin@cs.mcgill.ca © McGill University 2025 Credits",
  "content_length": 1831,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:44"
}