{
  "name": "Nathan Jacobs",
  "homepage": "https://engineering.washu.edu/faculty/Nathan-Jacobs.html",
  "status": "success",
  "content": "Nathan Jacobs | WashU McKelvey School of Engineering Education PhD, computer science, Washington University in St. Louis, 2010 Research areas Applications of Imaging in Science & Engineering Computational Methodologies Computer Vision Graphics, Vision, and Imaging Machine Learning & Artificial Intelligence Machine Learning in Image Science Natural Language Processing Signals & Imaging Expertise Develops learning-based computer vision algorithms, with a focus on geospatial and medical applications Research Professor Jacobs’ research centers on developing learning-based algorithms and systems for extracting information from large-scale image collections. He has applied this expertise in many application domains, with a particular focus on geospatial and medical applications. He earned a PhD in computer science at Washington University in St. Louis in 2010. Prior to re-joining the institution as a professor in 2022, he was a professor of computer science at the University of Kentucky.   His research has been funded by the National Science Foundation, National Institutes of Health, Defense Advanced Research Projects Agency (DARPA), Intelligence Advanced Research Projects Activity (IARPA), National Geospatial-Intelligence Agency (NGA) and Google, among others. He holds two U.S. patents and has received numerous awards and honors, including a National Science Foundation CAREER award in 2016 and the College of Engineering Dean’s Award for Excellence in Research at the University of Kentucky in 2018. Biography Nathan Jacobs joins McKelvey School of Engineering from the University of Kentucky, where he was on the faculty since 2010, most recently as a professor of computer science and director of graduate studies (data science). In addition, he is a member of the Institute for Biomedical Informatics and owner of Multidomain Vision Research LLC, a research and software development firm that specializes in novel algorithms in computer vision, medical imaging and remote sensing. In the News Animal classification could be simplified through global and local entailment learning Work in Nathan Jacobs’ lab creates an improved hierarchical representation learning framework. 10.07.2025 Better visual quality or better depth? Research in Nathan Jacobs’ lab looks at stereo image generation technology. 10.06.2025 Novel strategy could boost visual information in geospatial images Nathan Jacobs’ lab makes strides toward solving tasks. 07.01.2025 Find more news about Nathan Jacobs",
  "content_length": 2500,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:45"
}