{
  "name": "Nathan J. McNeese",
  "homepage": "https://computing.clemson.edu/trace/team.html",
  "status": "success",
  "content": "Team | TRACE Research Group Team Meet The Team LinkedIn Website Contact Research Interests: Human-AI Teaming, AI-AI Teaming, Human-Centered AI, Human-Centered Collaborative Tools and Systems Nathan McNeese Research Group Director Dr. Nathan J. McNeese is an Assistant Professor and Director of the Team Research Analytics in Computational Environments (TRACE) Research Group within the division of Human-Centered Computing in the School of Computing at Clemson University. Dr. McNeese is also the Director of the university-wide Clemson University Data (Science) Lab. He also holds a secondary appointment in Clemson’s Human Factors Institute, is a Faculty Scholar in Clemson’s School of Health Research, and a Watt Family Faculty Fellow. Dr. McNeese received a PhD in Information Sciences & Technology from The Pennsylvania State University. For over 15 years, Dr. McNeese has conducted research mainly focused on teamwork, artificial intelligence (AI), and collaborative technology within a variety of different contexts (command & control, emergency crisis management, and healthcare). His current research interests span across human-AI teaming, human-centered AI, and the development/design of human-centered collaborative tools and systems. He currently serves on multiple international/societal program and technical committees, in addition to multiple editorial boards including Human Factors. He is a previous Member of the National Academies of Science Panel on Human Factors Science, and previous member of the Army Research Lab HERD Technical Advisory Board. His research has received multiple best paper awards/nominations and has been published in peer-reviewed venues over 90 times. In addition, he has acquired over $9M in research funding from agencies such as NSF, ONR, AFOSR, and AHRQ. Post-Doctorate Researchers TRACE Research Group works with post-docotorate researchers to bolster their experience in publication and grant driting while also allowing them to pursue interestes in human-AI collaboration. Wen Duan PhD Students PhD Students in TRACE Research Group are actively leading and publishing original research while also pursuing a higher degree of education. Our PhD students are experts in Human-Centered Computing and actively work to pursue and develop their own personal research interests and trajectories. Rohit Mallick Yunhao Wang Nan(Phoebe) Weng Undergraduate Students At TRACE we are always eager to work with undergraduate students who are interested in helping conduct and publish original research. Our goal is to provide students with the opportunity to learn what academic research looks like and how it may align with their career goals. We are also committed to helping students pursue internships outside of TRACE to further their education and expertise. Kyle Zheng Christian Ihekweazu Mia Yancey Graduate Alumni TRACE alumni are successful in whatever career they decide to pursue upon completing their degree. Our students have the potential to pursue any career path, whether it be industry, government, or academia. TRACE alumni exit Clemson with the skills and expertise needed to meaningfully contribute to modern problems facing both Computer Science and Human-Centered Computing. Chris Allyson Caitlin Beau Rui Geoff Swapnil Lorenzo Undergraduate Alumni Jake Ethan Joshua Noah Alyssa Nirali Bekk Mark Jack Dylan Rafael Houston Richard Casey Jada Mari Thomas Sarah Steve Qwelian",
  "content_length": 3434,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:46"
}