{
  "name": "Nathaniel Hudson",
  "homepage": "https://www.iit.edu/directory/people/nathaniel-hudson-0",
  "status": "success",
  "content": "Nathaniel Hudson | Illinois Institute of Technology Skip to main site navigation Skip to main content Nathaniel Hudson Assistant Professor of Computer Science Tags: Faculty Computer Science Home Office and Department Directory Directory Nathaniel Hudson EducationPh.D. Computer Science, University of KentuckyM.S. Computer Science, University of KentuckyB.S. Computer Science, Northern Kentucky UniversityResearch InterestsArtificial Intelligence and Machine LearningSystemsPublications“Steering an Active Learning Workflow Towards Novel Materials Discovery via Queue Prioritization;”  Marcus Schwarting, Logan Ward, Nathaniel Hudson, Xiaoli Yan, Ben Blaiszik, Eliu Huerta, and Ian Foster; In 2025 IEEE International Conference on e-Science 2025 “Flight: A FaaS-Based Framework for Complex and Hierarchical Federated Learning;” Nathaniel Hudson, Valerie Hayot-Sasson, Yadu Babuji, Matt Baughman, J Gregory Pauloski, Ryan Chard, Ian Foster, and Kyle Chard; Future Generation Computer Systems 2025 “AERO: An Autonomous Platform for Continuous Research;” Valérie Hayot-Sasson, Abby Stevens, Nicholson Collier, Sudershan Sridhar, Kyle Conroy, J. Gregory Pauloski, Yadu Babuji, Maxime Gonthier, Nathaniel Hudson, Dante D. Sanchez-Gallegos, Ian Foster, Jonathan Ozik, and Kyle Chard; arXiv preprint arxiv:2505.18408 2025 “Topology-Aware Knowledge Propagation in Decentralized Learning;”  Mansi Sakarvadia,  Nathaniel Hudson, Tian Li, Ian Foster, and Kyle Chard; arXiv preprint arXiv:2505.11760 2025“Cartesian Equivariant Representations for Learning and Understanding Molecular Orbitals;” Daniel King, Daniel Grzenda, Ray Zhu, Nathaniel Hudson, Ian Foster, Bingqing Cheng, and Laura Gagliardi; 2025 “MOFA: Discovering Materials for Carbon Capture with a GenAI- and Simulation-Based Workflow;” Xiaoli Yan, Nathaniel Hudson, Hyun Park, Daniel Grzenda, J. Gregory Pauloski, Marcus Schwarting, Haochen Pan, Hassan Harb, Samuel Foreman, Chris Knight, Tom Gibbs, Kyle Chard, Santanu Chaudhuri, Emad Tajkhorshid, Ian Foster, Mohamad Moosavi, Logan Ward, and E. A. Huerta; 2025 “Mitigating Memorization In Language Models;” Mansi Sakarvadia, Aswathy Ajith, Arham Khan, Nathaniel Hudson, Caleb Geniesse, Kyle Chard, Yaoqing Yang, Ian Foster, and Michael W Mahoney; In to appear in the proceedings of The Thirteenth International Conference on Learning Representations 2025 “Causal Discovery over High-Dimensional Structured Hypothesis Spaces with Causal Graph Partitioning;” Ashka Shah, Adela DePavia, Nathaniel Hudson, Ian Foster, and Rick Stevens; Transactions on Machine Learning Research (TMLR) 2025 “SoK: On Finding Common Ground in Loss Landscapes Using Deep Model Merging Techniques;” Arham Khan, Todd Nief, Nathaniel Hudson, Mansi Sakarvadia, Daniel Grzenda, Aswathy Ajith, Jordan Pettyjohn, Kyle Chard, and Ian Foster; arXiv preprint arXiv:2410.12927 2024“TaPS: A Performance Evaluation Suite for Task-based Execution Frameworks;” J. Gregory Pauloski, Valerie Hayot-Sasson, Maxime Gonthier, Nathaniel Hudson, Haochen Pan, Sicheng Zhou, Ian Foster, and Kyle Chard; In 2024 IEEE International Conference on e-Science 2024 “An Empirical Investigation of Container Building Strategies and Warm Times to Reduce Cold Starts in Scientific Computing Serverless Functions;” André Bauer, Maxime Gonthier, Haochen Pan, Ryan Chard, Daniel Grzenda, Martin Straesser, J. Gregory Pauloski, Alok Kamatar, Matt Baughman, Nathaniel Hudson, Ian Foster, and Kyle Chard; In 2024 IEEE International Conference on e-Science 2024 “Thinking in Categories: A Survey on Assessing the Quality for Time Series Synthesis;” Michael Stenger, André Bauer, Thomas Prantl, Robert Leppich, Nathaniel Hudson, Kyle Chard, Ian Foster, and Samuel Kounev; Journal of Data and Information Quality May 2024 “Deep Learning for Molecular Orbitals;” Daniel King, Daniel Grzenda, Ray Zhu, Nathaniel Hudson, Ian Foster, and Laura Gagliardi; May 2024 “RuralAI in Tomato Farming: Integrated Sensor System, Distributed Computing and Hierarchical Federated Learning for Crop Health Monitoring;” Harish Devaraj, Shaleeza Sohail, Boyang Li, Nathaniel Hudson, Matt Baughman, Kyle Chard, Ryan Chard, Enrico Casella, Ian Foster, and Omer Rana; IEEE Sensors Letters May 2024   “QoS-Aware Edge AI Placement and Scheduling with Multiple Implementations in FaaS-based Edge Computing;” Nathaniel Hudson, Hana Khamfroush, Matt Baughman, Daniel E. Lucani, Kyle Chard, and Ian Foster; Future Generation Computer Systems May 2024 “Trillion Parameter AI Serving Infrastructure for Scientific Discovery: A Survey and Vision;” Nathaniel Hudson, J. Gregory Pauloski, Matt Baughman, Alok Kamatar, Mansi Sakarvadia, Logan Ward, Ryan Chard, André Bauer, Maksim Levental, Wenyi Wang, Will Engler, Owen Price Skelly, Ben Blaiszik, Rick Stevens, Kyle Chard, and Ian Foster; In Proceedings of the IEEE/ACM International Conference on Big Data Computing, Applications and Technologies May 2024 “Tournament-Based Pretraining to Accelerate Federated Learning;” Matt Baughman, Nathaniel Hudson, Ryan Chard, Andre Bauer, Ian Foster, and Kyle Chard; In Proceedings of the SC ’23 Workshops of The International Conference on High Performance Computing, Network, Storage, and Analysis May 2023 “Measurement and Applications: Exploring the Challenges and Opportunities of Hierarchical Federated Learning in Sensor Applications;” Melanie Po-Leen Ooi, Shaleeza Sohail, Victoria Guiying Huang, Nathaniel Hudson, Matt Baughman, Omer Rana, Annika Hinze, Kyle Chard, Ryan Chard, Ian Foster, Theodoros Spyridopoulos, and Harshaan Nagra; IEEE Instrumentation & Measurement Magazine May 2023 “Attention Lens: A Tool for Mechanistically Interpreting the Attention Head Information Retrieval Mechanism;” Mansi Sakarvadia, Arham Khan, Aswathy Ajith, Daniel Grzenda, Nathaniel Hudson, André Bauer, Kyle Chard, and Ian Foster; May 2023 “Memory Injections: Correcting Multi-Hop Reasoning Failures during Inference in Transformer-Based Language Models;”Mansi Sakarvadia, Aswathy Ajith, Arham Khan, Daniel Grzenda, Nathaniel Hudson, André Bauer, Kyle Chard, and Ian Foster; May 2023 “Adversarial Predictions of Data Distributions Across Federated Internet-of-Things Devices;” Samir Rajani, Dario Dematties, Nathaniel Hudson, Kyle Chard, Nicola Ferrier, Rajesh Sankaran, and Peter Beckman; In 2023 IEEE World Forum on Internet of Things (WF-IoT) October 2023 “Accelerating Communications in Federated Applications with Transparent Object Proxies;” J. Gregory Pauloski, Valerie Hayot-Sasson, Logan Ward, Nathaniel Hudson, Charlie Sabino, Matt Baughman, Kyle Chard, and Ian Foster; In Proceedings of the International Conference on High Performance Computing, Networking, Storage and Analysis October 2023 “Deadline-Aware Task Offloading for Vehicular Edge Computing Networks Using Traffic Lights Data;” Pratham Oza, Nathaniel Hudson, Thidapat Chantem, and Hana Khamfroush; ACM Transactions on Embededded Computing Systems April 2023    “Searching for the Ground Truth: Assessing the Similarity of Benchmarking Runs;” André Bauer, Martin Straesser, Mark Leznik, Marius Hadry, Lukas Beierlieb, Nathaniel Hudson, Kyle Chard, Samuel Kounev, and Ian Foster; In 2023 ACM/SPEC International Conference on Performance Engineering Data Challenge Track April 2023 “Balancing Federated Learning Trade-Offs for Heterogeneous Environments;” Matt Baughman, Nathaniel Hudson, Ian Foster, and Kyle Chard; In 2023 IEEE International Conference on Pervasive Computing and Communications (PerCom) Work in Progress Apr 2023 “Hierarchical and Decentralised Federated Learning;” Omer Rana, Theodoros Spyridopoulos, Nathaniel Hudson, Matt Baughman, Kyle Chard, Ian Foster, and Aftab Khan; In 2022 Cloud Computing April 2022 “FLoX: Federated Learning with FaaS at the Edge;” Nikita Kotsehub, Matt Baughman, Ryan Chard,  Nathaniel Hudson, Panos Patros, Omer Rana, Ian Foster, and Kyle Chard; In 2022 IEEE International Conference on e-Science December 2022 “Smart Edge-Enabled Traffic Light Control: Improving Reward-Communication Trade-offs with Federated Reinforcement Learning;” Nathaniel Hudson, Pratham Oza, Hana Khamfroush, and Chantem Thidapat; In 2022 IEEE International Conference on Smart Computing (SMARTCOMP) July 2022  “Smart Decision-Making via Edge Intelligence for Smart Cities,” Nathaniel Hudson, May 2022 “Communication-Loss Trade-Off in Federated Learning: A Distributed Client Selection Algorithm;” Minoo Hosseinzadeh,  Nathaniel Hudson, Sam Heshmati, and Hana Khamfroush; In 2022 IEEE 19th Annual Consumer Communications & Networking Conference (CCNC)May 2022“QoS-Aware Placement of Deep Learning Services on the Edge with Multiple Service Implementations;” Nathaniel Hudson, Hana Khamfroush, and Daniel E. Lucani; In 2021 IEEE International Conference on Computer Communications and Networks (ICCCN) Big Data and Machine Learning for Networking (BDMLN) Workshop May 2021 “A Framework for Edge Intelligent Smart Distribution Grids via Federated Learning;” Nathaniel Hudson, Md Jakir Hossain, Minoo Hosseinzadeh, Hana Khamfroush, Mahshid Rahnamay-Naeini,  and Nasir Ghani; In 2021 IEEE International Conference on Computer Communications and Networks (ICCCN) May 2021 “Joint Compression and Offloading Decisions for Deep Learning Services in 3-Tier Edge Systems;” Minoo Hosseinzadeh, Nathaniel Hudson, Xiaobo Zhao, Hana Khamfroush, and Daniel E. Lucani; In 2021 IEEE International Symposium on Dynamic Spectrum Access Networks (DySPAN)January 2021 “Behavioral Information Diffusion for Opinion Maximization in Online Social Networks,” Nathaniel Hudson and Hana Khamfroush, IEEE Transactions on Network Science and Engineering (TNSE) Oct 2020 “Improving the Accuracy-Latency Trade-off of Edge-Cloud Computation Offloading for Deep Learning Services;” Xiaobo Zhao, Minoo Hosseinzadeh, Nathaniel Hudson, Hana Khamfroush, and Daniel E. Lucani; In 2020 IEEE Globecom Workshops December 2020  “A Proximity-Based Generative Model for Online Social Network Topologies;” Emory Hufbauer, Nathaniel Hudson, and Hana Khamfroush;",
  "content_length": 10593,
  "method": "requests",
  "crawl_time": "2025-12-01 14:03:56"
}