{
  "name": "Nava Tintarev",
  "homepage": "http://navatintarev.com",
  "status": "success",
  "content": "Nava Tintarev You need to enable JavaScript to run this app. Home CV Teaching Team Reviewing Publications Organizing Talks Grants and awards Related links Prof. Nava Tintarevn.tintarev@maastrichtuniversity.nl Prof. Nava Tintarev Full Professor in Explainable AI at Maastricht University. Hi, I am Prof. Nava Tintarev I am a Full Professor in Explainable AI at Maastricht University in the Department of Advanced Computing Sciences (DACS) where I am the Director of Research. My research is funded by projects in the field of human-computer interaction in artificial advice-giving systems, such as recommender systems; specifically developing the state-of-the-art for automatically generated explanations (transparency) and explanation interfaces (recourse and control). I was a founding Co-Investigator in the ROBUST consortium to carry out long term (10-years, ~87M, NWO+EZK+private funding) research into trustworthy artificial intelligence. I am currently a co-lab director of the ICAI TAIM lab, working on trustworthy media, in collaboration with UvA and RTL. Previous funders include the European Commission, IBM, and Twitter. Senior ACM member since 2020, round table member for informatics (informaticatafel, since 2024), and board member ICT-Research Platform Netherlands , (IPN, incoming 2026). Open CV Click to see gallery of (visual) explanation interfaces: News 21st of November Full paper accepted to the IEEE/CVF Winter Conference on Applications of Computer Vision (core A) titled ``A Little More Like This: Text-to-Image Retrieval with Vision-Language Models Using Relevance Feedback''. Led by Bulat Khaertdinov and with Mirela Popa 29th of October Two submissions presented at MediaEval (Dublin). Beyond Similarity: Two-Stage Retrieval for News Image Search (NewsImages: Retrieval and generative AI for news thumbnails) and Early Fusion and Pre-text task learning for Video Memorability Prediction (Memorability track - honorable mention). Led by Bulat Khaertdinov and Aashutosh Ganesh a.o. 29th of October Also presented at the workshop on Dutch/Belgian Information Retrieval: ``VisualReF: Interactive Image Search Prototype with Visual Relevance Feedback''. 25th of August Accepted demo at Recsys: ``VisualReF: Interactive Image Search Prototype with Visual Relevance Feedback''. Led by Bulat Khaertdinov and with Mirela Carmia Popa. Accepted short paper at Recsys: ``Consistent Explainers or Unreliable Narrators? Understanding LLM-generated Group Recommendations''. Led by Cedric Waterschoot and with Francesco Barile. Accepted paper led by PhD student Adarsa Sivaprasad (with Ehud Reiter a.o.) at an AI and Healthcare conference titled: Patient-Centred Explainability in IVF Outcome Prediction. 6th of June Invited talk: Frontiers in AI at the European Conference on Artificial Intelligence on the theme of Humans and AI, titled ``Measuring Explanation Quality – a Path Forward''. Associated pre-print . 6th of June Accepted journal paper in Re-centering the User in Recommender System Research a Special Issue of the International Journal of Human-Computer Studies (IJHCS). Title: De-centering the (Traditional) User: Multistakeholder Evaluation of Recommender Systems. Authors: Robin Burke; Gediminas Adomavicius; Toine Bogers; Tommaso Di Noia; Dominik Kowald; Julia Neidhardt; Özlem Özgöbek; Maria Soledad Pera; Nava Tintarev; Jürgen Ziegler. Pre-print. 21st of April Invited talks: Pint of Science on Diversity and Inclusion in Data Science with Dennis Soemers; Keynotes IR for Good at ECIR, and the e-enforcement academy (to consumer protection & safety authorities across EU and the Commission) on Recommender Systems: Transparency, Bias, and Privacy 7th of April Accepted full paper at UMAP'25: With Friends Like These, Who Needs Explanations? Evaluating User Understanding of Group Recommendations. Joint work with Cedric Waterschoot, Raciel Yera Toledo, and Francesco Barile. Pre-print. 7th of April I am grateful for the vote of confidence to join the board of the ICT-Research Platform Netherlands (IPN), incoming 2026. 3rd of January Our Dagstuhl seminar proposal \"Challenges of Human Oversight: Achieving Human Control of AI-Based Systems\" was accepted! 3rd of January Our paper, Town Mice versus Country Mice: Urban Bias in Job Recommender Systems has been accepted for presentation at the ECIR 2025 conference as a full paper. Authors: Roan Schellingerhout, Francesco Barile, and Nava Tintarev. Teaching I have extensive teaching experience and am a holder of a Dutch teaching qualification (BKO/UTQ). Lecturing 2022-Ongoing Explainable AI (KEN4246)Master Course (NL) Delivered and designed with Tjitze Rienstra. Topics: (1) Intrinsically interpretable models, e.g., decision trees, decision rules, linear regression. (2) Identification of violations of assumptions; such as distribution of features, feature interaction, non-linear relationships between features; and what to do about them. (3) Model agnostic explanations, e.g., LIME, scoped Rules (Anchors), SHAP (and Shapley values) (4) Ethics for explanations, e.g., fairness and bias in data, models, and outputs. (5) (Adaptive) User Interfaces for explainable AI (6) Evaluation of explanation understandability 2021-Ongoing Recommender systemsBachelors course (NL) Delivered and designed with Francesco Barile. Topics: Non-personalized and Stereotype-based Recommender Systems, Classical recommender systems algorithms, e.g., Content-based Filtering, Collaborative-based Filtering, Offline Evaluation e.g., protocols, criteria, metrics, User-centered evaluation, Interfaces and interaction in Recommender systems, e.g., explanations and conversational recommender systems, Ethics, bias, and fairness in recommender systems, Advanced methods, e.g., Matrix Factorization, Hybrid recommenders. 2020 Human Computer InteractionBachelors course (NL) Delivered and designed with Myrthe Tielman. Topics: Requirements Elicitation, Information Architecture, Design, Expert and User Evaluation, UX for AI and Adaptive Systems 2018-2020 Crowd computing (CS4145)Master Course (NL) Delivered and designed with Alessandro Bozzon. Topics: Human Computation, Crowd Computing, User Modeling, Human Computer Interaction 2018-2020 Information retrieval (IN4325)Master Course (NL) Delivered and designed with Claudia Hauff. Topics: Natural Language Processing, Natural Language Generation 2016 Big Data and Cloud ComputingMasters Course (UK) Designed and delivered a Masters unit on Big Data and Cloud Computing, which is part of the Applied Data Analytics Masters program. Topics covered include: R programming, information visualization, exploratory data analysis, NoSQL, Hadoop and MapReduce. 2012 Digital SocietyBachelor course (UK) Course coordinator and lecturer for a multi-disciplinary course with around 200 students, addressing the impact of technology on society. This required the supervision and coordination of 5 tutors. 2011-2012 Adaptive Interactive SystemsBachelor course (UK) Gave invited lectures on the topic of recommender systems and adaptive hypermedia on the course Adaptive Interactive Systems Tutorials 2010-2015 Research methods, Digital Society, Human Computer Interaction, Web Application Development (Ruby/Rails), Data Mining and Visualization, Enterprise Computing (Java), Adaptive Interactive Systems. Team As research director I coordinated a department of 100 researchers, and I am a line manager of 11 assistant/associate professors, postdocs, and PhDs. I am also a member of the Explainable AI (XAI) research theme, which is an interdisciplinary field of research focusing on providing explanations of AI-driven systems. This includes intrinsically explainable approaches to AI, as well as methods that provide explanations for decisions made by \"black-box\" machine learning models. The ability of AI-driven systems to explain their decisions in human-understandable terms improves the trust we place in these systems and helps address issues related to fair and unbiased decision-making. We bring together researchers working on XAI in a diverse range of application areas, including recommender systems, computational social science, causal inference for life sciences, affective computing, computer vision, knowledge representation/reasoning and machine learning. We have expertise on interactive interfaces for XAI, computational argumentation for XAI, and the evaluation of XAI systems. Current PhD students 2023 - ongoing Aashutosh GaneshCo-supervisor(s): Mirela Popa Video Summarization 2023 - ongoing Dina ZilbershteinCo-supervisor(s): Francesco Barile Fair and Transparent Recommendations 2022-Ongoing Roan SchellingerhoutCo-supervisor(s): Francesco Barile Explaining job recommendations 2022-Ongoing Adarsa SivaprasadCo-supervisor(s): Ehud Reiter, Nir Oren (Aberdeen, UK) Explaining Risk and Uncertainty for IVF treatment Current Postdocs 2025 - ongoing Bulat KhaertdinovCo-supervisor(s): Mirela Popa Explainable Video Summarization 2024 - ongoing Cedric Waterschoot Co-supervisor(s): Francesco Barile Explainable Group Recommender Systems Alumni PhDs Tim Draws (2024, cum laude), Shabnam Najafian (2023), Federico Cau (2023), Yucheng Jin (2019), Kirsten Smith (2016) Postdocs Federico Cau, Amir Fard, Rishav Hada, Oana Inel, Mesut Kaya, Dimitrios Bountouridis, Emily Sullivan Reviewing I am an experienced academic reviewer. I serve on editorial boards, and act as senior program committee members for leading journals and conferences in both Artificial Intelligence and Human Computer Interaction. I review grant proposals in the Netherlands (NWO), Belgium (VLAIO), and the UK (EPSRC). I have served on the examination committee for PhD vivas (NL, UK, Germany, Italy, Spain, and Canada). I also serve on international hiring and promotion committees (Denmark, Switzerland) Editorial User Modeling and User-Adapted Interaction (UMUAI) (ISI@5 years: 4.131), from 2019 Transactions on Recommender Systems (TORS), from 2022 journal i-com -- Journal of Interactive Media (de Gru",
  "content_length": 18059,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:05"
}