{
  "name": "Naveed Anwar Bhatti",
  "homepage": "https://naveedanwarbhatti.github.io",
  "status": "success",
  "content": "Naveed Anwar Bhatti | Assistant Professor Naveed Anwar Bhatti Welcome to my academic home on the web. I am an Assistant Professor at Lahore University of Management Sciences (LUMS), where I mentor the next generation of systems researchers while directing high-impact initiatives in embedded intelligence. Prior to LUMS, I was an ERCIM Alain Bensoussan Postdoctoral Fellow with Thiemo Voigt at RISE-SICS in Stockholm. My research investigates the foundations of cyber-physical systems with a particular emphasis on transiently powered platforms, embedded system security, and network forensics. I completed my Ph.D. in Computer Science at the Department of Electronics, Information, and Bioengineering (DEIB), Politecnico di Milano, under the guidance of Associate Professor Luca Mottola. Earlier, I contributed to the Systems and Networks Lab at the National University of Computer and Emerging Sciences, working with Associate Professor Affan A. Syed. My academic roots include an MS in Computer Science and a BS in Telecommunications from FAST-NUCES—experiences that seeded a lifelong fascination with crafting dependable, human-centered technology. Download CV Schedule a conversation Assistant Professor Research avenues From resilient architectures to secure deployments, my research tackles the practical challenges of making ubiquitous computing sustainable. Cyber-Physical Systems & Intermittent Computing Designing computing stacks that gracefully tolerate power failures, enabling batteryless devices to deliver dependable sensing and actuation in the wild. Embedded & Network Security Developing forensic techniques and protective mechanisms that secure constrained platforms without sacrificing responsiveness or usability. Sustainable & Responsible IoT Championing human-centered, environmentally conscious deployments that translate rigorous research into meaningful societal impact. Recent highlights A snapshot of collaborative projects that bridge fundamental research and real-world deployment. CheckMate SenSys 2025 LLM-powered approximate intermittent computing that accelerates batteryless intelligence without compromising system integrity. Explore the publication Glitch in Time AsiaCCS 2025 Exposed how temporal misalignment in inertial sensors can be weaponized for eavesdropping, informing defenses for autonomous platforms. Read the study Batteryless Heritage Monitoring SenSys 2020 Deployed zero-maintenance sensing at the Mithraeum of Circus Maximus, safeguarding cultural heritage through sustainable CPS design. Watch the project story Imagination is more important than knowledge. For knowledge is limited, whereas imagination embraces the entire world, stimulating progress and giving birth to evolution. Albert Einstein Let's advance resilient intelligence together Whether you're a prospective collaborator, student, or industry partner, I'm always eager to explore new ideas that blend rigor with real-world relevance. Browse my publications Connect with me",
  "content_length": 2994,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:01"
}