{
  "name": "Naveen Kumar 0001",
  "homepage": "http://people.du.ac.in/~nk",
  "status": "success",
  "content": "Prof. Naveen Kumar, Professor ,Department of Computer Science, University of Delhi Naveen Kumar Senior Professor Department of Computer Science University of Delhi Naveen Kumar Senior Professor, Department of Computer Science, University of Delhi Biography Naveen Kumar is a Senior Professor at the Department of Computer Science, University of Delhi, Delhi, India. He holds a Ph.D. degree in Computer Science from IIT, Delhi. Before his doctoral studies, he earned his M.Tech. (Computer Science) and M.Sc. (Mathematics) degrees from IIT Delhi and an honours degree in Mathematics from the University of Delhi. He has taught undergraduate and postgraduate students various courses and has about 40 years of teaching experience. He has co-authored a book with Sheetal Taneja titled Python Programming, A Modular Approach, published by Pearson Education. He has supervised many PhD students in soft computing and social networks. His current areas of interest include explainable AI, machine learning, and deep learning. He has contributed several articles in national and international journals and conferences. He has been a member of the curriculum design committees of various universities and the CBSE. He has also been an organising chair/program committee member of several workshops, conferences, and symposia. Academic Qualifications Ph.D. Computer Science* Indian Institute of Technology, Delhi *Thesis title: Invariance in Computer Vision MTech. Computer science Indian Institute of Technology, Delhi M. Sc. Mathematics Indian Institute of Technology B. Sc. (Honors) Mathematics University of Delhi > Research Profile PUBLICATIONS (List of papers published in SCI-indexed Journals) Chanchal Bareja, Kountay Dwivedi, Apoorva Uboveja, Ankit Mathur, Naveen Kumar, and Daman Saluja. \"Identification and clinicopathological analysis of potential p73-regulated biomarkers in colorectal cancer via integrative bioinformatics.\" Scientific Reports 14, no. 1 (2024): 9894. (Impact Factor: 4.6, SCIE (Q1)) Gaurav Pandey, Rashika Bagri, Rajan Gupta, Ankit Rajpal, Manoj Agarwal, Naveen Kumar. \" Robust Weighted General Performance Score for Various Classification Scenarios.\" Intelligent Decision Technologies (2024). (Impact Factor: 1.0) Onkar Singh, Ajay Jaiswal, Nitin Kumar, and Naveen Kumar. \"Random permutation‐based linear regression for cancelable biometrics.\" Expert Systems (2024). (Impact Factor: 3.3, SCIE (Q2)) Aditya Ranjan Dalabehera, Sujit Bebortta, Naveen Kumar, and Dilip Senapati. \"Mist-fog-assisted real-time emotion recognition using deep transfer learning framework for smart city 4.0.\" Internet of Things (2024): 101237. (Impact Factor: 5.9, SCIE (Q1)) Ankit Rajpal, Rashmi Mishra, Sheetal Rajpal, Kavita, Varnika Bhatia, Naveen Kumar. \"Explaining Deep Learning-Based Leaf Disease Identification.\" Soft Computing (2024). (Impact Factor: 4.1, SCIE (Q2)) Accepted for Publication Kountay Dwivedi, Ankit Rajpal, Sheetal Rajpal, Virendra Kumar, Manoj Agarwal, Naveen Kumar. \"XL1R-Net: Explainable AI-driven Improved L1-Regularized Deep Neural Architecture for NSCLC Biomarker Identification.\" Computational Biology and Chemistry (2024): Vol 108, 107990 (Impact Factor: 3.1, SCIE (Q2)), https://doi.org/10.1016/j.compbiolchem.2023.107990. Kountay Dwivedi, Ankit Rajpal, Sheetal Rajpal, Manoj Agarwal, Virendra Kumar, Naveen Kumar. \"Enlightening the Path to NSCLC Biomarkers: Utilizing the Power of XAI-guided Deep Learning.\" Computer Methods and Programs in Biomedicine: Accepted for Publication (2023) (Impact Factor: 6.1, SCIE) Ankit Rajpal, Subodh Kumar, Neeraj Kumar Sharma, Ajith Abraham, Anurag Mishra, Naveen Kumar. \"CXRmark: A Watermarking Scheme for Chest X-Rays using Online Sequential Reduced Kernel ELM.\" Circuits, Systems and Signal Processing (2023) (Impact Factor: 2.3, SCIE (Q3)) Shikha Gupta, Naveen Kumar, and Subhash Bhalla. \"Citation metrics and evaluation of journals and conferences.\" Journal of Information Science (2023): (Impact Factor: 2.4, SCIE (Q3)) Subodh Kumar, Neeraj Kumar Sharma, and Naveen Kumar. \"WSOmark: An adaptive dual-purpose color image watermarking using white shark optimizer and Levenberg–Marquardt BPNN.\" Expert Systems with Applications 226 (2023): 120137. (Impact Factor: 8.5, SCIE (Q1=1.87)) Sharma, Neeraj Kumar, Subodh Kumar, and Naveen Kumar. \"HGSmark: An efficient ECG watermarking scheme using hunger games search and Bayesian regularization BPNN.\" Biomedical Signal Processing and Control 83 (2023): 104633. (Impact Factor: 5.1, SCIE (Q1=1.07)) Vanshika Dua, Ankit Rajpal, Sheetal Rajpal, Manoj Agarwal, Naveen Kumar. \"I-FLASH: Interpretable Fake News Detector using LIME And SHAP.\" Wireless Personal Communications (2023) (Impact Factor: 2.2, SCIE (Q3)) Rashmi Mishra, Kavita, Ankit Rajpal, Varnika Bhatia, Sheetal Rajpal, Manoj Agarwal, Naveen Kumar. \"I-LDD: An Interpretable Leaf Disease Detector.\" Soft Computing (2023). (Impact Factor: 4.1, SCIE (Q2)) Sheetal Rajpal, Ankit Rajpal, Manoj Agarwal, Virendra Kumar, Ajith Abraham, Divya Khanna, Naveen Kumar. \"XAI-CNVMarker: Explainable AI-based Copy Number Variant Biomarker Discovery for Breast Cancer Subtypes.\" Biomedical Signal Processing and Control (2023): 104979. (Impact Factor: 5.1, SCIE (Q1=1.07)) Sheetal Rajpal, Ankit Rajpal, Arpita Saggar, Ashok K. Vaid, Virendra Kumar, Manoj Agarwal, Naveen Kumar. \"XAI-MethylMarker: Explainable AI Approach for Biomarker Discovery for Breast Cancer Subtype Classification using Methylation Data.\" Expert Systems with Applications (2023): 225, 120130. (Impact Factor: 8.5, SCIE (Q1=1.87)) Kountay Dwivedi, Ankit Rajpal, Sheetal Rajpal, Manoj Agarwal, Virendra Kumar, Naveen Kumar. \"An Explainable AI-driven Biomarker Discovery Framework for Non-Small Cell Lung Cancer Classification.\" Computers in Biology and Medicine: 153, 106544 (2023) (Impact Factor: 7.7, SCIE (Q1=1.22)) Neeraj Kumar Sharma, Subodh Kumar, Ankit Rajpal, and Naveen Kumar. \"MantaRayWmark: An image adaptive multiple embedding strength optimization based watermarking using Manta Ray Foraging and bi-directional ELM.\" Expert Systems with Applications (2022): 200, 116860. (Impact Factor: 8.5, SCIE (Q1=1.87)) Subodh Kumar, Ankit Rajpal, Neeraj Kumar Sharma, Sheetal Rajpal, Anand Nayyar, and Naveen Kumar. \"ROSEmark: Robust Semi-blind ECG Watermarking Scheme using SWT-DCT Framework.\" Digital Signal Processing (2022): 103648. (Impact Factor: 2.9, SCIE (Q2)) Sheetal Rajpal, Manoj Agarwal, Ankit Rajpal, Navin Lakhyani, Arpita Saggar, and Naveen Kumar. \"COV-ELM Classifier: An Extreme Learning Machine based Identification of COVID-19 using Chest X-Ray Images.\" Intelligent Decision Technologies Pre-Press (2022): 16(1) 193-203 (Impact Factor: 1.0, SCIE (Q4)). Sheetal Rajpal, Navin Lakhyani, Ayush Kumar Singh, Rishav Kohli, and Naveen Kumar. \"Using handpicked features in conjunction with ResNet-50 for improved detection of COVID-19 from chest X-ray images.\" Chaos, Solitons & Fractals 145 (2021): 110749. (Impact Factor: 7.8, SCIE (Q1=1.39)) Sheetal Rajpal, Manoj Agarwal, Virendra Kumar, Anamika Gupta, and Naveen Kumar. \"Triphasic deepbrca-a deep learning-based framework for identification of biomarkers for breast cancer stratification.\" IEEE Access 9 (2021): 103347-103364. (Impact Factor: 3.9, SCIE (Q2)) Himani Sharma, Deep Chandra Mishra, R. K. Sharma, and Naveen Kumar. \"Multi-image steganography and authentication using crypto-stego techniques.\" Multimedia Tools and Applications 80, no. 19 (2021): 29067-29093. (Impact Factor: 3.6, SCIE (Q2)) Indranath Chatterjee, Manoj Agarwal, Bharti Rana, Navin Lakhyani, and Naveen Kumar. \"Bi-objective approach for computer-aided diagnosis of schizophrenia patients using fMRI data.\" Multimedia Tools and Applications 77 (2018): 26991-27015. (Impact Factor: 3.6, SCIE (Q2)) Indranath Chatterjee, Virendra Kumar, Bharti Rana, Manoj Agarwal, and Naveen Kumar. \"Identification of changes in grey matter volume using an evolutionary approach: an MRI study of schizophrenia.\" Multimedia Systems 26 (2020): 383-396. (Impact Factor: 3.9, SCIE (Q2)) Indranath Chatterjee, Virendra Kumar, Bharti Rana, Manoj Agarwal, and Naveen Kumar. \"Impact of ageing on the brain regions of the schizophrenia patients: an fMRI study using evolutionary approach.\" Multimedia Tools and Applications 79 (2020): 24757-24779. (Impact Factor: 3.6, SCIE (Q2)) D. C. Mishra, Himani Sharma, R. K. Sharma, and Naveen Kumar. \"A first cryptosystem for security of two-dimensional data.\" Fractals 25, no. 01 (2017): 1750011. (Impact Factor: 4.7, SCIE (Q1)) Manoj Agarwal, Nitin Agrawal, Shikhar Sharma, Lovekesh Vig, and Naveen Kumar. \"Parallel multi-objective multi-robot coalition formation.\" Expert Systems with Applications 42, no. 21 (2015): 7797-7811. (Impact Factor: 8.5, SCIE (Q1)) Manoj Agarwal, Naveen Kumar, and Lovekesh Vig. \"Non-additive multi-objective robot coalition formation.\" Expert Systems with Applications 41, no. 8 (2014): 3736-3747. (Impact Factor: 8.5, SCIE (Q1)) Shikha Gupta, Stuti Mittal, Tamanna Gupta, Isha Singhal, Barkha Khatri, Ajay K. Gupta, and Naveen Kumar. \"Parallel quantum-inspired evolutionary algorithms for community detection in social networks.\" Applied Soft Computing 61 (2017): 331-353. (Impact Factor: 8.7, SCIE (Q1)) Hanuman Verma, Ramesh K. Agrawal, and Naveen Kumar. \"Improved fuzzy entropy clustering algorithm for MRI brain image segmentation.\" International journal of imaging systems and technology 24, no. 4 (2014): 277-283. (Impact Factor: 3.3, SCIE (Q3)) Sonia Deshmukh, Manoj Agarwal, Shikha Gupta, and Naveen Kumar. \"MOEA for discovering Pareto-optimal process models: an experimental comparison.\" International Journal of Computational Science and Engineering 21, no. 3 (2020): 446-456. (ESCI) Arpita Aggarwal, and Naveen Kumar. \"SAHAM: shared adaptive hypermedia application model.\" International journal of computer applications in technology 40, no. 1-2 (2011): 138-145. (ESCI) Himani Sharma, Deep Chandra Mishra, R. K. Sharma, and Naveen Kumar. \"Crypto-stego system for securing",
  "content_length": 17170,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:12"
}