{
  "name": "Nawfal F. Fadhel",
  "homepage": "https://www.ecs.soton.ac.uk/people/nf1m14",
  "status": "success",
  "content": "Doctor Nawfal Al Hashimy | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Dr Nawfal Al Hashimy PhD, FHEA, Snr Teaching Fellow in Computer Science Accepting applications from PhD students. Connect with Nawfal Email: Nawfal@soton.ac.uk Tel: +44 23 8059 6659 ORCID LinkedIn On this page About Research Publications Teaching External roles and responsibilities Biography About Research Publications Teaching External roles and responsibilities Biography About Dr. Nawfal Al Hashimy is a distinguished cybersecurity expert affiliated with the University of Southampton. With a passion for technology from an early age, Dr. Al Hashimy pursued a Ph.D. in cybersecurity, focusing on groundbreaking research in intrusion detection systems and anomaly detection algorithms. His work has had significant global impact, influencing both academic and industrial practices. Currently a Senior Teaching Fellow in Computer Science, Dr. Al Hashimy is dedicated to educating future cybersecurity professionals and spearheading innovative research. He has played a pivotal role in establishing the university's cybersecurity research center, fostering collaboration between academia and industry. Beyond academia, Dr. Al Hashimy is a sought-after consultant, advising governments and corporations on securing critical infrastructure. He is also committed to public education, delivering lectures and workshops to demystify cybersecurity. Dr. Al Hashimy is a strong advocate for diversity and inclusion in tech, mentoring underrepresented individuals and promoting inclusive practices within the cybersecurity field. His career reflects a steadfast commitment to enhancing digital security and education. Research Research groups Member of: Cyber Physical Systems ECS Education Group Cyber Security Academy Centre for Resilient Socio-Technical Systems Current research Security of industry 4.0 Security of Wearable Devices Security of IoT devices Publications Business email compromise: a systematic review of understanding, detection, and challenges Amirah Almutairi, BooJoong Kang & Nawfal Alhashimy, 2025, Computers & Security, 158 DOI: 10.1016/j.cose.2025.104630 Type: review Business email compromise: a comprehensive taxonomy for detection and prevention Amirah M. Almutairi, Boojoong Kang & Nawfal A.L. Hashimy, 2025 DOI: 10.1145/3700706.3700714 Type: conference Evaluating routing protocols for intermittent energy harvesting IoT networks Sara A. Alsodairi, Alex S. Weddell, Nawfal F. Al Hashimy & Geoff V. Merrett, 2024 DOI: 10.1109/COINS61597.2024.10622119 Type: conference Property ownership formal modelling using Event-B and iUML-B Manar Altamimi, Nawfal Al Hashimy, Asieh Salehi Fathabadi & Gary Wills, 2024 DOI: 10.1007/978-3-031-63790-2_12 Type: conference BiBERT-AV: enhancing authorship verification through Siamese networks with pre-trained BERT and Bi-LSTM Amirah Almutairi, BooJoong Kang & Nawfal Al Hashimy, 2024 DOI: 10.1007/978-981-97-1274-8_2 Type: conference Routing in intermittently powered IoT networks Sara Alsodairi, Geoff V. Merrett, Alex S. Weddell & Nawfal Al Hashimy, 2023 Type: conference The effectiveness of transformer-based models for BEC attack detection Amirah Almutairi, BooJoong Kang & Nawfal Fadhel, 2023 DOI: 10.1007/978-3-031-39828-5_5 Type: conference Expert review of the Land Registration Framework in the Kingdom of Saudi Arabia Manar Altamimi, Gary Wills & Nawfal Al Hashimy, 2022, International Journal of ICT Research in Africa and the Middle East, 11(1) DOI: 10.4018/IJICTRAME.304395 Type: article Efficient NFS model for risk estimation in a risk-based access control model Hany F. Atlam, Muhammad Ajmal Azad & Nawfal Fadhel, 2022, Sensors, 22(5) DOI: 10.3390/s22052005 Type: article Malicious activity detection using smart contracts in IoT. Nawfal Fadhel, Hany F. Atlam & Eric Mwangi, 2021 DOI: 10.5220/0010474802860295 Type: bookChapter Teaching Gamification of Cyber Security Learning and Teaching Cyber Security for secondary and higher education Creating sustainable learning enviroments External roles and responsibilities Name: External Examiner at the University of East London Role: Examiner Year: 2024 Biography Dr. Nawfal Al Hashimy is an expert in the field of cybersecurity, known for his significant contributions and unwavering commitment to safeguarding digital systems. Currently affiliated with the University of Southampton, Dr. Al Hashimy's journey from his early fascination with technology to becoming a cybersecurity professional is a testament to his dedication to the field. Hailing from Iraq, Dr. Al Hashimy displayed an innate interest in computers and technology from a young age. His parents recognized his aptitude and nurtured his interests, laying the groundwork for his future in cybersecurity. After earning his undergraduate degree in computer science with top honors, Dr. Al Hashimy pursued a Ph.D. in cybersecurity at the University of Southampton. During this time, he conducted groundbreaking research in intrusion detection systems, contributing significantly to the field's advancement. His work on anomaly detection algorithms and network security protocols had practical implications for industries worldwide. Upon completing his Ph.D., Dr. Al Hashimy continued his association with the University of Southampton as a faculty member, where he focused on educating the next generation of cybersecurity professionals. He also played a key role in establishing the university's cybersecurity research center, facilitating collaboration between academia and industry to address cybersecurity challenges. Beyond academia, Dr. Al Hashimy's expertise has been sought after by governments and corporations for guidance in securing critical infrastructure and sensitive data. His consultancy work has led to the development of robust cybersecurity practices. Dr. Al Hashimy is also committed to raising public awareness about cybersecurity. He has delivered numerous lectures and workshops, simplifying complex concepts and offering practical tips to protect individuals and businesses in the digital age. In addition to his professional achievements, Dr. Al Hashimy advocates for diversity and inclusion in the cybersecurity field. He actively mentors underrepresented individuals, encouraging them to pursue careers in this crucial domain. In summary, Dr. Nawfal Al Hashimy's journey from his early interest in technology to becoming a leading figure in cybersecurity reflects his dedication to protecting the digital world. His research, commitment to education, and advocacy for diversity continue to shape the field of cybersecurity, ensuring the security of digital infrastructure in an evolving threat landscape. Prizes Dean's Awards 2020 (2020) Student Union Award - Best Pastoral Support (2016) First Class Achievers Award by Kind of Jordan, Abdullah the 2nd (2007) Staff Achievement Award (2015) Innovation to Commercialisation of University Research (ICURe) Programme (2017) Entrepreneure First - London (2017) Dean's Awards 2020 (2020) Student Union Award - Best Pastoral Support (2016) First Class Achievers Award by Kind of Jordan, Abdullah the 2nd (2007) Staff Achievement Award (2015) Innovation to Commercialisation of University Research (ICURe) Programme (2017) Entrepreneure First - London (2017) Study View all courses Taught postgraduate stud",
  "content_length": 31065,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:13"
}