{
  "name": "Nayna Patel",
  "homepage": "https://www.brunel.ac.uk/people/nayna-patel",
  "status": "success",
  "content": "Dr Nayna Patel | Introduction | Brunel University London Skip to Content Home People Dr Nayna Patel Dr Nayna PatelReader (Education) - Computer Science Wilfred Brown 114 Email: nayna.patel@brunel.ac.uk Tel: +44 (0)1895 266301 Computer Science College of Engineering, Design and Physical Sciences Summary I am a Senior Lecturer in the department of Computer Science and my specialism is user experience and digital service design. In addition to working in the placement and careers service, and as a service designer for a digital design agency, I have over 15 years of teaching experience. I am also a trained Mediator and Conflict Coach, and more recently I trained as a Mental Health First Aider. Qualifications PhD, MSc, BSc (Hons) Responsibility Co-Director of Teaching and Learning Newest selected publications Al-Faresi, S. and Patel, N. (2012) 'The design of an adoption and acceptance framework for mobile digital library services'. International Conference on Information Society I Society 2012. pp. 216 - 224. Conference paper Patel, N., Brinkman, WP. and Coughlan, J. (2012) 'Work placements and academic achievement: Undergraduate computing students'. Education + Training, 54 (6). pp. 523 - 533. ISSN: 0040-0912 Journal article Coughlan, J., Macredie, RD. and Patel, N. (2011) 'Understanding the consumption process through in-branch and e-mortgage service channels: A first-time buyer perspective'. International Journal of Bank Marketing, 29 (2). pp. 148 - 167. ISSN: 0265-2323 Open Access Link Journal article Coughlan, J., Eatock, J. and Patel, N. (2010) 'Simulating the use of re-prioritisation as a wait-reduction strategy in an emergency department'. Emergency Medicine Journal, 28 (12). pp. 1013 - 1018. ISSN: 1472-0213 Open Access Link Journal article Coughlan, J., Macredie, RD. and Patel, N. (2007) 'Moving face-to-face communication to web-based systems'. Interacting with Computers, 19 (1). pp. 1 - 6. ISSN: 0953-5438 Open Access Link Journal article More publications(16)",
  "content_length": 1999,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:12"
}