{
  "name": "Nazanin Rahnavard",
  "homepage": "http://cwnlab.eecs.ucf.edu",
  "status": "success",
  "content": "Learning, Communications, and Wireless Networks Lab (CWNlab) – CWN Lab PreviousNext123456789101112131415161718192021 About LCWN Lab Director: Dr. Nazanin Rahnavard At the Learning, Communications, and Wireless Networks Lab (LCWN lab), our passion is to significantly advance telecommunication, networking, and sensing systems by devising novel frameworks, schemes, and applications. Our research effort bridges several areas such as telecommunications, modern wireless networking, signal processing, and machine learning. Our research interests include: Deep learning: theory and applications Machine/Deep Learning Applications in Communication Systems High-dimensional and Big data analysis Compressive Sensing Cognitive Radio Networks and RF Spectrum Cartography Wireless Ad-Hoc and Sensor Networks LCWNLab is located at: 331 and 365 Harris Corp. Engineering Center (HEC), UCF About Dr. Rahnavard Professor, Department of Electrical and Computer Engineering University of Central Florida Office: Harris Corp. Engineering Center (HEC) 335, University of Central Florida 4000 Central Florida Blvd., Orlando, FL, 32816 Phone: (407) 823-1762 Email: nazanin.rahnavard at ucf.edu Education Ph.D., Electrical and Computer Engineering, Georgia Institute of Technology (2007) M.S., Electrical Engineering, Sharif University of Technology (2001) B.S., Electrical Engineering, Sharif University of Technology (1998) Academic Distinctions National Science Foundation CAREER Award UCF Faculty Excellence in Mentoring Postdoctoral Scholars Award (2023) Research Incentive Award (RIA) (2023) UCF Faculty Excellence in Mentoring Doctoral Students Award (2022) College of Engineering and Computer Science (CECS) Excellence in Research Award (2020) UCF Women’s History Month Honoree (2020) Latest NewsDr. Rahnavard is awarded the UCF’s 2023 “Faculty Excellence in Mentoring Postdoctoral Scholars Award”. Congratulations!April 21, 2023 - 3:37 pmDr. Rahnavard is awarded the 2022 “Faculty Excellence in Mentoring Doctoral Students Award” at UCF. Congratulations!March 3, 2022 - 11:23 amNazmul’s paper on “Noisy Label Detection” got accepted in CVPR’22! Congratulations Nazmul!March 3, 2022 - 11:23 amDr. Alireza Zaeemzadeh is now a Research Associate at University of Wisconsin – Madison. Congratulations Alireza!March 3, 2022 - 11:22 amDr. Marzieh Edraki has joined Sony! Congratulations Marzieh!March 3, 2022 - 11:18 am Scroll to top",
  "content_length": 2417,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:20"
}