{
  "name": "Nazli Goharian",
  "homepage": "http://people.cs.georgetown.edu/~nazli",
  "status": "success",
  "content": "Nazli Goharian: Home - Georgetown University Nazli Goharian is Clinical Professor of Computer Science and Associate Director of the Information Retrieval Lab at Georgetown University, which she joined in 2010 . She joined the Illinois Institute of Technology (IIT) from industry in 2000. Her research and doctoral student mentorship span the domains of information retrieval, text mining, and natural language processing. Specifically, her interest lies on humane-computing applications such as medical/health domain. Joint with her doctoral students, she received an EMNLP 2017 Best Long Paper Award and COLING 2018 Honorable Mention both for papers on mental health and social media. For contributions to undergraduate and graduate curriculum development and teaching excellence, she was recognized with the IIT Julia Beveridge Award for faculty (university-wide female faculty of the year) in 2009, the College of Science and Letters Dean's Excellence Award in Teaching in 2005, and in 2002, 2003, and 2007, the Computer Science Department Teacher of the Year Award. She has graduated 5 doctoral students with very strong publications records and academia/research job placements; she also supervised multiple MS Theses and more than a dozen MS projects. She has supervised undergraduate students under NSF REU. Since the start of the CS doctoral program at Georgetown (2011) she has been running (founded & running) the Semi-Annual Graduate Research Presentation Days where the graduate students present their published/accepted research work. She was Area Chair at ACL 2018, 2019, and 2021; Senior Area Chair in ACL 2020, and the Program co-Chair of ECIR 2024. She is the SIGIR Women in IR Chair and has been [co]-Chair of Women in Information retrieval (WIR) since 2019, focusing on gender pay inequity and women leadership. Doctoral Students Saket Mengle (2010) ; Senior Research Data Scientist - Roku Inc. Andrew Yates (2016); Assistant Professor, University of Amsterdam Arman Cohan (2018); Assistant Professor, Yale University Luca Soldaini (2018); Applied Research Scientist, Allen Institute for Artificial Intelligance Sean MacAvaney (2021); Lecturer, University of Glasgow Sajad Sotudeh (Present)",
  "content_length": 2209,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:15"
}