{
  "name": "Neal Snooke",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/nns",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth UniversityDr Neal Snooke BSc, PhD (Wales) Lecturer Department of Computer Science Contact Details Email: nns@aber.ac.uk Office: MP1.42, Physical Sciences Building Phone: +44 (0) 1970 621782 Personal Website: http://users.aber.ac.uk/nns Research Portal Profile Profile My research interests are broadly in the area of Artificial Intelligence, particularly with respect to model based reasoning, temporal logic and software analysis. Further details are contained on my personal pages together with my publications and teaching duties. I enjoy writing software and I wrote and maintain the Marking Scheme and Feedback tool (https://users.aber.ac.uk/nns/msg/mfa.html) When not at work I kite surf, mountain bike and build and fly model aircraft and FPV drones. Teaching Module Coordinator CSS0160 - Sandwich Year CC22120 - Peirianneg Meddalwedd CS22220 - Software Engineering for the Web CS23820 - C and C++ CSS0060 - Sandwich Year CS22120 - Software Engineering CSS0760 - Sandwich Year Coordinator CSS0760 - Sandwich Year CSS0160 - Sandwich Year CSS0060 - Sandwich Year CS23820 - C and C++ CC22120 - Peirianneg Meddalwedd CS22120 - Software Engineering CS22220 - Software Engineering for the Web Moderator CS38220 - Professional Issues in the Computing Industry CS00710 - License to Use Mathematics Lecturer CHM9360 - MSC Project CSM9060 - Dissertation CS10220 - Introduction to Computer Infrastructure CS33020 - Systems Engineering Research Groups Advanced Reasoning Group Publications Cook, J, Roberts, BP, Labrosse, F & Snooke, N 2025, 'Detecting and Mapping Invasive Species Across Riparian Corridors via Object Detection Approaches in UAV Imagery: An Example of Impatiens glandulifera', Ecology and Evolution, vol. 15, no. 8, e71921. 10.1002/ece3.71921Roberts, BP, Neal, M, Snooke, N, Labrosse, F, Curteis, T & Fraser, M 2020, 'A bespoke low‐cost system for radio tracking animals using multi‐rotor and fixed‐wing unmanned aerial vehicles', Methods in Ecology and Evolution, vol. 11, no. 11, pp. 1427-1433. 10.1111/2041-210X.13464Roberts, BP, Fraser, M, Snooke, N, Johnstone, I, Joyce, I & Labrosse, F 2020, 'New technologies for understanding livestock behaviour in conservation management: A case study at RSPB Lake Vyrnwy', Paper presented at Resilience in the Welsh Uplands - An Evidence Perspective, 14 Sept 2020 - 18 Sept 2020.Chudley, TR, Christoffersen, P, Doyle, S, Abellan, A & Snooke, N 2019, 'High-accuracy UAV photogrammetry of ice sheet dynamics with no ground control', Cryosphere, vol. 13, no. 3, pp. 955-968. 10.5194/tc-13-955-2019Roberts, BP, Snooke, N, Bunting, P & Fraser, M 2018, Multispectral imagery from UAVs to classify and monitor vegetation change in semi-natural grasslands. in B Horan, D Hennessey, M O'Donovan, E Kennedy, B McCarthy, JA Finn & B O'Brien (eds), Sustainable meat and milk production from grasslands: 27th General Meeting of the European Grassland Federation. Grassland Science in Europe, vol. 23, Teagasc, Fermoy, 27th EGF General Meeting, Cork, Ireland, 17 Jun 2018.More publications on the Research Portal",
  "content_length": 3120,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:15"
}