{
  "name": "Nectarios Koziris",
  "homepage": "http://www.cslab.ntua.gr/~nkoziris",
  "status": "success",
  "content": "Nectarios Koziris home page (photo in office) Nectarios KozirisProfessor, former Dean of the School of Electrical and Computer Engineering, National Technical University of Athens Contact info: National Technical University of Athens School of Electrical and Computer Engineering Department of Computer Science Office 21.7 or Computing Systems Laboratory (Room 21.34-5) Zografou Campus, 157 73 Zografou,Athens,GREECE Tel: +30-210-772-1531 Fax: +30-210- 772-1292 e-mail: nkoziris (at) cslab.ece.ntua.gr http://www.cslab.ece.ntua.gr/~nkoziris Office/Lab Assistants: Katerina Tachriltzidou, Tel. +30 210 7721529, ktach (at) cslab.ece.ntua.gr (21.34B, Computing Systems Lab) Eliza Angelidi, Tel. +30 210 7724023, eliza (at) cslab.ece.ntua.gr (21.34B, Computing Systems Lab) Short bio: Nectarios Koziris is a Professor of Computer Science, former Dean of the School of Electrical and Computer Engineering at the National Technical University of Athens. His research interests include parallel and distributed systems, interaction between compilers, OS and architectures, datacenter hyperconvergence, scalable data management and large scale storage systems. He has co-authored more than 180 research papers with more than 5800 citations (h-index:33). From 1998 he has been involved in the organization of many international scientific conferences including IPDPS, ICPP, SC, SPAA, etc. He has given many invited talks in conferences and universities. He is a recipient of two best paper awards for his research in parallel and distributed computing (IEEE/ACM IPDPS 2001 and CCGRID 2013) and had received honorary recognition from Intel (2015) for his research and insightful contributions in transactional memory (TSX synchronization extensions). He has participated as a partner or consortium coordinator in several EU projects involving large-scale systems (ACTiCLOUD, EuroEXA, SELIS, CELAR, ASAP, EGI, PRACE, GREDIA, GRID4ALL, ARCOMEM,etc). He is a member of the IEEE Computer Society, senior member of the ACM, elected chair of the IEEE Greece Section and started the IEEE Computer Society Greece. To promote the open source software in Greece, he co-founded the Greek Free/Open Source Software Society (GFOSS-www.ellak.gr) in 2008, with members 29 Greek Universities and Research Centers, where he is now serving as the Vice-Chair of the Board of Directors. He was a member of the European Commission's cloud computing expert group (2012-2013) which was established with the aim to develop a cloud computing vision for Europe and future research directions and he is also serving in the EC task force for the Next Generation Internet. For the last 10 years (2004-2014), Nectarios has served as the Vice-Chair for the Greek Research and Technology Network-GRNET. He was the founder of the ~okeanos project, a public Cloud IaaS infrastructure, among the biggest ones in the European public sector (topping out beyond 10.000 active VMs), powered by the open source Synnefo software (www.synnefo.org). ~Okeanos and ~okeanos-global for the GÉANT community, offer IaaS services to thousands of academics and researchers around Europe. He has also served (2013-2014) as a member of the BoD for the Athena Research and Innovation Center in Information, Communication and Knowledge Technologies. He is an advisor to Arrikto Inc., a fresh startup based in Palo Alto, California, that develops storage intelligence to access, manage, and store data in large-scale, heterogeneous and hybrid environments. For more: http://www.cslab.ece.ntua.gr/~nkoziris Brief CV in Greek  (updated: November 2024) Affiliated with: www.ece.ntua.gr, School of Electrical and Computer Engineering, National Technical University of Athens. www.cslab.ntua.gr, Computing Systems Lab.www.iccs.gr, Adjunct Researcher, Institute of Communication and Computer Systems (ICCS), School of Electrical and Computer Engineering, NTUA www.imis.gr, Adjunct Researcher, Institute for the Management of Information Systems (IMIS), \"Athena\" - Research and Innovation Center in Information, Communication and Knowledge Technologies. www.ellak.gr, Free/Libre/Open Source Software Organization in Greece. www.ieee.gr, IEEE Greece Section. www.arrikto.com, storage intelligence. Currently working: RESEARCH@CSLab ASAP, A Scalable Analytics Platform. CELAR, Automatic, Multi-Grained elasticity provisioning for the cloud. ACTiCLOUD, ACTivating resource efficiency and large databases in the CLOUD. SELIS, Towards a Shared European Logistics Intelligent Information Space. BONSEYES, An open platform for the development of systems of artificial intelligence from cloud to edge devices. EuroEXA, Co-designed Innovation and System for Resilient Exascale Computing in Europe: From Applications to Silicon. E2DATA, European Extreme Performing Big Data Stacks. Past: ~okeanos Public Cloud IaaS (similar to Amazon WS)synnefo, Open Source Software (similar to Openstack)Hellasgrid, National Greek Initiative on GRID Infrastructure-counts more than 1000 nodes and 6 sites. Athenswifi, The first free public wireless network downtown Athens, covering Syntagma area, Thission and Kotzia square. Pithos, Free Online Storage 50GB for all Greek Students and Researchers (REST API, versioning, backup, desktop and rich web client-See open source code in GRNET Simple Storage Service (GSS) Current Courses:(in greek) Computer Architecture (5th semester) Operating Systems (7th semester) Operating Systems Lab (8th semester) Advanced Computer Architecture (8th semester) Parallel Processing Systems (9th semester) Distributed Systems (9th semester) Advanced Topics in Databases (9th semester) Code Optimization for Multiprocessing Systems (graduate course) Past Courses:(in greek) Introduction to Computer Science (4th semester) Data Structures (4th semester, last offered Spring 2002) Distributed Operating Systems (last offered Fall 2001) Research Interests: Computing Systems Architecture and Systems Software: Loop code optimizations for simultaneous multithreaded, multicore microarchitectures Code/Compiler Optimizations for multi-level memory hierarchies combined with superscalar, multithreaded cores Interaction between compilers, OS and architectures (scheduling of OS resources, system level optimizations) Scheduling for large, scalable cluster systems Systems software for communication architectures for scalable clusters Large scale distributed computer systems (GRID, P2P) Resource Scheduling for centralized, hierarchical and fully distributed systems Storage and Data management Architecture of scalable distributed storage and computer infrastructures Publications Member of Computing Systems Laboratory (www.cslab.ece.ntua.gr) (profile in pdf) Upcoming Parallel Distributed Computing Conferences and Workshops Ongoing Research: (more) Memory bandwidth aware userspace scheduler (MemBUS) gmblock: Scalable block-level storage sharing over Myrinet SPMV: Sparse Matrix-Vector Multiplication Optimization of stencil computations for Cluster platforms Emerging Architectures (GP-GPUs, CELL) SpMV on the Cell Synchronization of threads executing on a HT-enabled processors Data updates in DHT based structured P2P systems (XOROS) GridTorrent: GridFTP + BitTorrent's peer and fragment selection DFS: Federative, disconnected, peer-to-peer filesystem Best Paper awards: Automated, Elastic Resource Provisioning for NoSQL Clusters Using TIRAMOLA, Proceedings of the 13th IEEE/ACM International Symposium On Cluster, Cloud And Grid Computing (CCGRID2013) Minimising Completion Time for Loop Tiling with Computation and Communication Overlapping, Proceedings of the 2001 International Parallel and Distributed Processing Symposium (IPDPS2001), IEEE Press, San Francisco, California, April 2001. (pdf) An extended version appeared in: A Pipelined Schedule to Minimize Completion Time for Loop Tiling with Computation and Communication Overlapping. Journal of Parallel and Distributed Computing, Volume 63, Issue 11, pp. 1138-1151, Nov. 2003. (pdf) Upcoming Conferences: PC Member, The 12th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE 2017), 28-29 April 2017, Porto, Portugal. PC Member, The 16th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGrid 2016), May 16-19, 2016, Cartagena, Colombia. Past Conferences: PC Member, The 12th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE 2017), 28-29 April 2017, Porto, Portugal. PC Member, The 16th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGrid 2016), May 16-19, 2016, Cartagena, Colombia. PC Member, The 11th Workshop on Virtualization in HighÂ­-Performance Cloud Computing (VHPC 2016) held in conjunction with the International Supercomputing Conference - High Performance, June 19-23, 2016, Frankfurt, Germany. PC Member, The 15th IEEE International Symposium on Network Computing and Applications (NCA 2016), October 27-29, 2016, Cambridge, MA USA. PC Member, The 11th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE 2016),  27-28 April 2016, Rome, Italy. PC Member, The 15th IEEE International Conference on Ubiquitous Computing and Communications (IUCC2016), Granada, Spain, 14-16 December 2016. PC Member, The 21th IEEE Workshop on Dependable Parallel, Distributed and Network-Centric Systems (DPDNS16) in conjunction with the 30th International Parallel and Distributed Processing Symposium (IPDPS 2016), May 23-27, 2016, Chicago, Illinois USA. PC Member, The 10th Workshop on Virtualization in High-Performance Cloud Computing (VHPC 2015) in conjunction with Euro-Par 2015, August 24-28, 2015, Vienna, Austria. PC Member, The 13th IEEE International Conference on Dependable, Autonomic and Secure Computing (DASC-2015) will be held in Liverpool, England, UK, 26-28 October 2015. PC Member, First International Workshop on Elasticity Engineering for Big Data Analytics (eBigDaC 2015), in conjunction with IEEE International Co",
  "content_length": 28030,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:19"
}