{
  "name": "Nectarios C. Papanicolaou",
  "homepage": "https://www.unic.ac.cy/papanicolaou-nectarios",
  "status": "success",
  "content": "Professor Nectarios Papanicolaou - University of Nicosia Skip to content APPLY Professor Nectarios Papanicolaou Professor Nectarios Papanicolaou Professor School of Sciences and Engineering Department of Computer Science 22841666 [email protected] Central Building, 2nd Floor, B211 Brief CVFull CV Research Profile https://orcid.org/0000-0001-5739-1143 Google Scholar Dr Nectarios C. Papanicolaou is a Professor of Applied Mathematics at the University of Nicosia (Department of Computer Science). He received his B.Sc. in Mathematics (emphasis in Applied Mathematics) from the University of Cyprus in 1999. He continued his studies at the University of Louisiana at Lafayette, earning his M.Sc. in Mathematics in 2001 and his PhD in Mathematics in May 2003.  During his graduate studies, he was supported by a Teaching Assistantship award from the Department of Mathematics of U. L. Lafayette and also worked as Research Assistant under Grant R199524 from LaSPACE (P.I. Prof. C. I. Christov). Upon returning to Cyprus in 2003 he joined the Department of Computer Science at Intercollege as an Assistant Professor of Mathematics and in 2007 continued in the same position at the University of Nicosia. In May 2011 he was promoted to the rank of Associate Professor and in July 2017 he was awarded the rank of Professor. He has served as elected Research Teaching Faculty representative to the Council of the School of Sciences and Engineering from 2008-2012 and in April 2016 he was elected RTF representative to the University Council. He has also served in School Hiring Committees and in the School Research Committee. As the Mathematics Programme Coordinator from September 2010 to September 2018, he helped formulate a proposal for creating a Minor Degree in Mathematics. Prof. Papanicolaou was instrumental in developing the University of Nicosia BSc Mathematics Programme, the result of a collective effort by the Mathematics faculty of the University. Prof. Papanicolaou is an active researcher in the field of Applied Mathematics with publications in peer-reviewed journals. He has collaborations with Academics in Cyprus, Europe and the United States and is involved in interdisciplinary research. His main expertise is the use of Galerkin Spectral Methods for the Numerical Solution of Partial Differential Equations. His other research interests include: – Finite Difference and Finite Element Methods for the Solution of Partial Differential Equations. – Computational Fluid Mechanics. – Numerical Analysis and Computational Mathematics. – Numerical and Analytic Techniques in Electromagnetic Wave Propagation. – Numerical Simulation of the Modulated Photothermal Radiometric Signal in Semiconductors. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 3344,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:19"
}