{
  "name": "Nedialko S. Nedialkov",
  "homepage": "https://www.cas.mcmaster.ca/~nedialk",
  "status": "success",
  "content": "Ned Nedialkov's Web Page Ned Nedialkov Professor Department of Computing and Software McMaster University Hamilton, Ontario, L8S 4K1 CANADA Phone 1-905-525-9140, ext. 24161 Fax 1-905-524-0340 Email Biography Ned Nedialkov was born and raised in Bulgaria. He received M.Sc. (1995) and Ph.D. (1999) degrees in Computer Science at the University of Toronto, and has been with the Department of Computing and Software at McMaster University since 1999. He was a long-term visitor during the Thematic Year on Numerical and Computational Challenges in Science and Engineering at the Fields Institute 2001-02, spent a sabbatical year at the Center for Applied Scientific Computing at the Lawrence Livermore National Laboratory in 2005-06, and was a guest of the Arénaire project at École Normale Supérieure de Lyon in the summer of 2008. His research is in the general area of scientific computing and mathematical software with emphasis on interval numerical methods for differential equations and numerical methods for differential-algebraic equations. He is the author of the VNODE and VNODE-LP packages for computing rigorous bounds on solutions in initial-value problems for ordinary differential equations, and the DAETS package for solving high-index differential algebraic equations. PhD positions I have two industrially-funded PhD positions. The research will be on mixed-precision numerical algorithms and high-performance computing to accelerate the performance of various solvers. A substantial component of the work is the implementation of such algorithms and incorporating them into industrial-strength codes. I seek candidates with a strong background in applied mathematics and computing. Experience in C/C++, software design and development, software optimizations for high-performance, and writing parallel programs is highly desirable. Software VNODE-LP DAETS Multi-body Lagrangian simulations DAESA Teaching Winter 2024 CAS708/CSE700 Scientific Computing Selected Publications J. D. Pryce and N. S. Nedialkov. Data, Lagrangian, Action! Simulating mechanisms direct from a text file. PDF J. D. Pryce, N. S. Nedialkov and G. Tan. DAESA — a Matlab Tool for Structural Analysis of Differential-Algebraic Equations: Theory. ACM TOMS 41(2), 9:1-9:20, 2015 N. S. Nedialkov, J. D. Pryce, and G. Tan. Algorithm 948: DAESA—A Matlab Tool for Structural Analysis of Differential-Algebraic Equations: Software. ACM TOMS, 41(2) 12:1-12:14, 2015 N. S. Nedialkov. Implementing a Rigorous ODE Solver through Literate Programming. Modeling, Design, and Simulation of Systems with Uncertainties. Springer, 3-19, 2011 N. S. Nedialkov and J. D. Pryce. Solving Differential-Algebraic Equations by Taylor Series (I): Computing Taylor Coefficients. BIT 45(3), 561-591, 2005. N. S. Nedialkov and J. D. Pryce. Solving Differential-Algebraic Equations by Taylor Series (II): Computing the System Jacobian. BIT 47(1), 121-135, 2007. N. S. Nedialkov and J. D. Pryce. Solving Differential-Algebraic Equations by Taylor Series (III): the DAETS Code. J. Numerical Analysis, Industrial and Applied Mathematics, 3, 61-80, 2008. N. S. Nedialkov and K. R. Jackson. A New Perspective on the Wrapping Effect in Interval Methods for Initial Value Problems for Ordinary Differential Equations. In A. Facius, U. Kulisch, and R. Lohner, editors, Perspectives on Enclosure Methods, 219–264, Springer-Verlag, Vienna, Austria, 2001. N. S. Nedialkov, K. R. Jackson and G. F. Corliss.Validated Solutions of Initial Value Problems for Ordinary Differential Equations. Applied Mathematics and Computation, 105(1), 21-68, 1999. Miscellaneous Academic Tree Projects from the Parallel Computing course Projects 2014, HPC wire Projects 2015 Projects 2016 OpenACC notes Part I Part II",
  "content_length": 3745,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:16"
}