{
  "name": "Neerja Mhaskar",
  "homepage": "https://www.cas.mcmaster.ca/~pophlin",
  "status": "success",
  "content": "Neerja Mhaskar Neerja Mhaskar, PhD, P.Eng Assistant Professor Department of Computing and Software Room: ITB 220 McMaster University 1280 Main Street West Hamilton, Ontario L8S 4L8 Canada Email: pophlin AT mcmaster DOT ca Research Interest My research focuses on algorithms and data structures. In particular, I am interested in algorithms on strings for pattern matching algorithms for designing a secure network analyzing patterns in big data developing tools and data structures for data compression, and information retrieval Positions Available I am currently looking for only PhD students. If your research interests align with mine and you have strong coding skills (especially in C and C++), please email me your CV. Due to the sheer volume of applications I may not be able to respond to all your emails. About Me I am an Assistant Professor in the Department of Computing and Software, McMaster University. Prior to this role, I was a post doctoral fellow/visiting researcher working with Professors Ridha Khedri and Bill Smyth, and a sessional faculty in the same department. I completed my PhD in Computer Science in August 2016, from McMaster University under the supervision of Professor Michael Soltys. I have a Master's degree in Engineering Science from Louisiana State University, USA, and a Bachelor's degree in Mechanical Engineering from Jawaharlal Nehru Technological University Hyderabad, India. When I am not working I am with my two kids and family. Current Graduate Students Hamed Hasibi, PhD Computer Science (co-supervised with Dr. Smyth and Dr. Golding) Nivetha Raj Pappuraj, PhD Computer Science Samkith Kishore Kumar Jain, MSc Computer Science Graduated Students Shutong Wu, MEng Computer Science Tieyun Zhang, MEng Computer Science (Software Engineer, Siemens Canada) Meng Wang, MEng Computer Science (Software Engineer, Siemens Canada) Chenge Liu, MSc Computer Science (Software Engineer, Canada) Zehong Wang, MEng Computer Science (Software Engineer, Robinhood) Hossein Dehghani, MSc Computer Science (Robotic Assistance Devices) Holly Koponen, MSc Computer Science (co-supervised with Dr. Smyth) (PhD Student at McMaster University) Teaching Below are the courses I taught/am teaching. Courses taught/teaching: Data Structures and Algorithms (Comp Sci 2C03) - Winter 2021, Fall 2021, 2023. Computing Patterns in Strings (CAS 722) - Winter 2020, Fall 2021, 2022. String Processing Algorithms (CAS 779) - Fall 2024, Winter 2026 Computer Science Practice and Experience: Operating Systems (Comp Sci 3SH3) - Winter 2017, 2018, 2022, Fall 2024, Fall 2025 Operating Systems (SFWRENG 3SH3) - Winter 2023, Winter 2025, Winter 2026 Research In the field of string algorithms, it is customary for authors to be listed in alphabetical order. See my list of publications at: DBLP",
  "content_length": 2802,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:18"
}