{
  "name": "Neil D. Lawrence",
  "homepage": "http://inverseprobability.com",
  "status": "success",
  "content": "Home | inverseprobability.com: Neil Lawrence’s Homepage ML@CL Home edit Neil Lawrence is the DeepMind Professor of Machine Learning at the University of Cambridge, a Visiting Professor at the University of Sheffield. You might be interested in The Atomic Human. ai@cam the University’s flagship mission on AI. The Accelerate Science Programme for accelerating scientific progress through machine learning and AI. The ELLIS Society. ML@CL research on ML in the Computer Laboratory. Data Science Africa a yearly workshop and summer school on Data Science held in collaboration with Makerere University, UN Global Pulse, Dedan Kemathi University and the Nelson Mandela African Institution of Science and Technology. The AutoAI project The Digital Markets Unit at the CMA. The Data Trusts Initiative for exploring new models of data governance. PMLR which publishes leading and emerging machine leaning conferences. The AISTATS conference. Data Readiness Levels an effort to unify the language around data status for improved management of the data science process. the Open Data Science Initiative an approach to data science designed to address societal needs. Part of open data science involves education. We are active in education including our series of Gaussian Process Summer Schools For some (older … but still relevant I think) public interest articles you can have a look at my Guardian contributor page, these articles are also normally reposted on my blog which contains other articles which tend to be more targeted at the machine learning and related communities. At Sheffield I used to lead the ML@SITraN group. The group’s research interests were in probabilistic models with applications in computational biology and personalized health. See the links above for more information about my research, teaching or software, as well as contact details and a mini bio. I began work in my current post on 1st October 2019, for the University of Cambridge press release see here. This site last compiled Sat, 15 Nov 2025 07:27:35 +0000 Github Account Copyright © Neil D. Lawrence 2025. All rights reserved.",
  "content_length": 2112,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:24"
}