{
  "name": "Neil Spring",
  "homepage": "http://www.cs.umd.edu/~nspring",
  "status": "success",
  "content": "Neil Spring photo: bobby bhattacharjee About Me I am a professor in the Department of Computer Science and UMIACS, studying Internet topology, reliability, and performance through measurements. I received my Ph.D from the University of Washington in 2004. My advisors were David Wetherall and Tom Anderson, and my thesis work won the SIGCOMM 2014 Test-of-time paper award. I received my Bachelor's degree in Computer Engineering from UC San Diego in 1997. I was the co-chair of the departmental undergraduate honors program from 2012 to 2015, redesigning the key introduction to research class and writing a new honors web service (though only logged-in students can see the cool parts). I was the information services director (web-monkey and spam-sender) for ACM SIGCOMM 2007–2013. I am the Associate Chair of Facilities for our department, helping to ensure the design of the Iribe Center meets our needs. In my spare time, I've 3-d printed a silverware tray, converted PWM daytime running light power to run LED lights in my CR-V, and wedged arduinos into otherwise blinkenlight-deprived toys. I write code using Rails. I commute by bike because two metro trains and a campus shuttle are too much. Research Projects See the pages dedicated to: ThunderPing (does residential Internet failure correlate with weather), Bond Breaker (can you identify your friends securely), BattOr (measure phone power consumption while mobile), Maranello (partial packet recovery at 802.11 speed), WiFidelity (understanding traces of wireless network traffic), Sidecar (measurement traffic in TCP), Scriptroute (flexible network measurement), Peerwise (overlays based on mutual advantage), Rocketfuel (ISP network mapping), or Tulip (Internet path diagnosis). Publications Google Scholar works too. Philipp Richter, Ramakrishna Padmanabhan, Neil Spring, Arthur Berger, and David Clark. Advancing the art of internet edge outage detection. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), Boston, November 2018. Zhihao Li, David Levin, Neil Spring, and Bobby Bhattacharjee. Internet anycast: Performance, problems, and potential. In Proceedings of the ACM SIGCOMM Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication (SIGCOMM), pages 59–73, Budapest, August 2018. DOI:10.1145/3230543.3230547. Christine Alvarado and Neil Spring. Successfully engaging early undergraduates in cs research: (abstract only). In Proceedings of the 49th ACM Technical Symposium on Computer Science Education, SIGCSE '18, pages 1050–1050. ACM, 2018. DOI:10.1145/3159450.3162365. Youndo Lee and Neil Spring. Identifying and analyzing broadband internet reverse DNS names. In Proceedings of the International Conference on emerging Networking EXperiments and Technologies (CoNEXT), pages 35–40, Seoul, 2017. DOI:10.1145/3143361.3143392. Fan Du, Catherine Plaisant, Neil Spring, and Ben Shneiderman. Finding similar people to guide life choices: Challenge, design, and evaluation. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI), 2017. DOI:10.1145/3025453.3025777. Fan Du, Catherine Plaisant, Neil Spring, and Ben Schneiderman. EventAction: Visual analytics for temporal event sequence recommendation. In IEEE Conference on Visual Analytics Science and Technology (IEEE VAST 2016), Baltimore, October 2016. DOI:10.1109/VAST.2016.7883512. Ramakrishna Padmanabhan, Amogh Dhamdhere, Emile Aben, kc claffy, and Neil Spring. Reasons dynamic addresses change. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), Santa Monica, California, November 2016. DOI:10.1145/2987443.2987461. Youndo Lee and Neil Spring. Identifying and aggregating homogeneous IPv4 /24 blocks with Hobbit. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), Santa Monica, California, November 2016. DOI:10.1145/2987443.2987448. Ramakrishna Padmanabhan, Patrick Owen, Aaron Schulman, and Neil Spring. Timeouts: Beware surprisingly high delay. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), pages 303–316, Tokyo, October 2015. DOI:10.1145/2815675.2815704. Frank Cangialosi, Dave Levin, and Neil Spring. Ting: Measuring and exploiting latencies between all Tor nodes. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), pages 289–302, Tokyo, October 2015. DOI:10.1145/2815675.2815701. Dave Levin, Youndo Lee, Zhihao Li, Luke Valenta, James Litton, Victoria Lai, Brendan Rowan, Cristian Lumezanu, Neil Spring, and Bobby Bhattacharjee. Alibi routing. In Proceedings of the ACM SIGCOMM Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication (SIGCOMM), pages 611–624, London, August 2015. DOI:10.1145/2785956.2787509. Neil Spring. Timeouts: Beware surprisingly high delay: Collect everything, assume nothing. AIMS 2015: Workshop on Active Internet Measurements, Apr 2015. Aaron Schulman, David Levin, and Neil Spring. RevCast: Fast, private certificate revocation over FM radio. In Proceedings of CCS'14: 2014 ACM SIGSAC Conference on Computer and Communications Security, pages 799–810, 2014. DOI:10.1145/2660267.2660376. Ramakrishna Padmanabhan, Dave Levin, and Neil Spring. UAv6: Alias resolution in IPv6 using unused addresses. In Proceedings of Passive \\& Active Measurement (PAM), pages 136–148, April 2014. DOI:10.1007/978-3-319-15509-8_11. Matthew Lentz, Dave Levin, Jason Castonguay, Neil Spring, and Bobby Bhattacharjee. D-mystifying the d-root address change. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), Barcelona, October 2013. Aaron Schulman and Neil Spring. Pingin' in the rain. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), Berlin, November 2011. DOI:10.1145/2068816.2068819. Dave Levin, Aaron Schulman, Katrina LaCurts, Neil Spring, and Bobby Bhattacharjee. Making currency inexpensive with iOwe. In Workshop on the Economics of Networks, Systems and Computation, San Jose, June 2011. Aaron Schulman, Vishnu Navda, Ramachandran Ramjee, Neil Spring, Pralhad Deshpande, Calvin Grunewald, Kamal Jain, and Venkata N. Padmanabhan. Bartendr: A practical approach to energy-aware cellular data scheduling. In Proceedings of the International Conference on Mobile Computing and Networking (MobiCom), pages 85–96, Chicago, September 2010. DOI:10.1145/1859995.1860006. Cristian Lumezanu, Katherine Guo, Neil Spring, and Bobby Bhattacharjee. The effect of packet loss on redundancy elimination in cellular wireless networks. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), pages 294–300, Melbourne, Australia, November 2010. DOI:10.1145/1879141.1879179. Cristian Lumezanu, Dave Levin, Bo Han, Neil Spring, and Bobby Bhattacharjee. Don't love thy nearest neighbor. In Proceedings of the International Workshop on Peer-to-Peer Systems (IPTPS), San Jose, CA, April 2010. Bo Han, Aaron Schulman, Francesco Gringoli, Neil Spring, Bobby Bhattacharjee, Lorenzo Nava, Lusheng Ji, Seungjoon Lee, and Robert Miller. Maranello: Practical partial packet recovery for 802.11. In Proceedings of the ACM/USENIX Symposium on Networked Systems Design and Implementation (NSDI), San Jose, CA, April 2010. Taowei David Wang, Catherine Plaisant, Ben Schneiderman, Neil Spring, David Roseman, Greg Marchand, Vikramjit Mukherjee, and Mark Smith. Temporal summaries: Supporting temporal categorical searching, aggregation and comparison. In Proceedings of the IEEE Information Visualization Conference (InfoVis), pages 1049–1056, Atlantic City, NJ, October 2009. Randy Baden, Neil Spring, and Bobby Bhattacharjee. Identifying close friends on the Internet. In Proceedings of the ACM Workshop on Hot Topics in Networks (HotNets), New York, October 2009. Cristian Lumezanu, Randy Baden, Neil Spring, and Bobby Bhattacharjee. Triangle inequality variations in the Internet. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC), pages 177–183, Chicago, November 2009. DOI:10.1145/1644893.1644914. Taowei David Wang, Catherine Plaisant, Ben Schneiderman, Neil Spring, David Roseman, Greg Marchand, Vikramjit Mukherjee, and Mark Smith. Temporal summaries: Supporting temporal categorical searching, aggregation and comparison. IEEE Transactions on Visualization and Computer Graphics, 15(6):1049–1056, November/December 2009. DOI:10.1109/TVCG.2009.187. Dave Levin, Neil Spring, and Bobby Bhattacharjee. Systems-compatible incentives. In Proceedings of the International Conference on Game Theory for Networks, pages 100–106, May 2009. Dave Levin, Daniel Malter, Neil Spring, and Bobby Bhattacharjee. Stay or go? Participation in under-provisioned video streams. In Joint Workshop on The Economics of Networked Systems and Incentive-Based Computing (NetEcon+IBC), Palo Alto, July 2009. Randy Baden, Adam Bender, Neil Spring, Bobby Bhattacharjee, and Daniel Starin. Persona: An online social network with user-defined privacy. In Proceedings of the ACM SIGCOMM Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication (SIGCOMM), pages 135–146, Barcelona, August 2009. DOI:10.1145/1592568.1592585. Cristian Lumezanu, Randolph Baden, Neil Spring, and Bobby Bhattacharjee. Triangle inequality and routing policy violations in the internet. In Proceedings of Passive \\& Active Measurement (PAM), pages 45–54, Seoul, April 2009. DOI:10.1007/978-3-642-00975-4_5. Cristian Lumezanu, Randolph Baden, Dave Levin, Neil Spring, and Bobby Bhattacharjee. Symbiotic relationships in Internet routing overlays. In Proceedings of the ACM/USENIX Symposium on Networked Systems Design and Implementation (NSDI), pages 467–480, Boston, MA, April 2009. Adam Bender, Rob Sherwood, Derek Monner, Nathan Goergen, Samrat Bhattacharjee, and Neil Spring. Fighting spam with the NeighborhoodWatch DHT. In Proceedings of the IEEE Joint Conference of the IEEE Computer and Communications Societies (INFOCOM), pages 1755–1763, Rio de Janeiro, Brazil, April 2009. ",
  "content_length": 22646,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:28"
}