{
  "name": "Neil S. Gaikwad",
  "homepage": "https://web.media.mit.edu/~gaikwad",
  "status": "success",
  "content": "Neil S. Gaikwad, Human-AI Alignment, Policy, Sustainability Neil S. Gaikwad Neil Gaikwad pronouns: he/him/his नील गायकवाड Assistant Professor HCI Researcher focused on Human-AI Value Alignment, Policy, and Sustainability School of Data Science and Society, Department of Computer Science University of North Carolina, Chapel Hill Faculty Advisory Council, UNC Parr Center for Ethics, Department of Philosophy Fellow, MIT Dalai Lama Center for Ethics and Transformative Values Ph.D. Massachusetts Institute of Technology I have received my PhD in Society-Centered AI from MIT where I was advised by Danielle Wood, Julie Shah, Sally Haslanger, Bish Sanyal, and Nabeel Gilani. I joined the University of North Carolina, Chapel Hill as an Assistant Professor in Data Science and Computer Science, starting in Fall 2024. If you are interested in joining my lab as an undergrad, PhD student, or postdoc, feel free to drop me an email. For PhD positions, consider applying to the UNC Computer Science, Information Science, or Statistics & Operations Research programs, and be sure to mention my name in your application. The rise of AI has fundamentally altered the relationship between algorithms and ethical values, transforming both computing and society. As a researcher in human-computer interaction and ethical machine learning, I focus on Human-AI Alignment and Policy to drive equitable societal development, particularly for underserved global populations. My work creates novel, value-sensitive designs for interactive systems that integrate ethics with engineering principles, aiming to promote fair decision-making at individual and institutional levels. This public interest research examines the impact of algorithmic systems on societal disparities and development trajectories within broader sociotechnical contexts. Through equity-focused analysis of AI-driven processes, I develop systems to enhance collective decision-making and broaden access to socioeconomic opportunities for diverse populations. The work extends to policy domains, addressing issues such as algorithmic fairness, poverty reduction, climate change mitigation, and public health. Ultimately, this research aims to create inclusive sociotechnical approaches that benefit marginalized communities globally. I am a fellow at MIT's Dalai Lama Center for Ethics and Transformative Values. By establishing grassroots community partnerships and contributing to policy discussions, I strive to address societal challenges comprehensively and improve equitable AI governance at various levels. My commitment to broadening equitable access to STEM and policy education is reflected in research, science policy initiatives, mentoring, and teaching at UNC, CMU, and MIT (EECS, IDSS, and Media Lab). I've mentored over 30 students from diverse backgrounds, supporting their publication of influential papers on equity in AI, securing fellowships, pursuing research careers, and shaping AI fairness policies. These efforts were recognized with MIT's Karl Taylor Compton Prize. Twitter LinkedIn gaikwad@cs.unc.edu gaikwad@mit.edu arts @neilgaikwad_creations Recent Talks & Travels NeuirIPS 2024 Stanford University National Science Foundation University of Michigan, Ann Arbor UW Seattle, CSE CHANGE Seminar Carnegie Mellon UNC Chapel Hill Cornell University Imperial College London Teaching Data 120 (UNC): Ethics of Data Science and AI (200 students) 6.3952 (MIT EEES): AI, Decision-Making, and Society (212 students) 6.UAR (MIT EEES): Undergraduate Advanced Research (81 students) IDS 412J (MIT IDSS): Science, Technology, and Public Policy (80 students) Program Committee/Session Chair ACM/AAAI Conferences 2023/2024 ACM FAccT EAAMO (Equity & Access in Algorithms, Mechanisms, & Optimization) AIES (AI, Ethics, and Society) Research Neil Gaikwad holds PhD from the Massachusetts Institute of Technology, specializing in Society-Centered AI. Neil received a master's degree from the School of Computer Science at Carnegie Mellon University, where he worked at the Robotics Institute and Software and Societal Systems Department. He was also a part of the Complex Systems Summer School at the Santa Fe Institute. Before MIT, Neil worked extensively on machine learning and decision-making research in his job as a data scientist in financial industry. Neil leads the development of AI and Policy research program (Gaikwad et al., 2020, 2021, 2022). His research has been published in artificial intelligence and human-computer interaction conferences (AAAI, ACM CSCW, ACM UIST, ACM CHI) and a scientific journal (PNAS), and also featured in the New York Times, Bloomberg, WIRED, and The Wall Street Journal. Neil, along with his colleagues, has built the Ethical AI system that learns a model of high-stake societal decision-making from 1.3 million people. He is also one of the principal creators and founding members of Daemo, a self-governed AI data market, and EteRNA, a crowd computing system that enables massive scale human and machine collaboration to realize scientific discoveries neither of them can accomplish in isolation. He led the open source development of Daemo's sociotechnical architecture that demonstrates mechanisms for designing equitable AI data market systems (Gaikwad et al., 2015, 2016, 2017). His foundational contributions draw on mechanism design (incentive-compatible reputation systems for AI data markets), portfolio management (tranches-based guilds for the future of work), and human-centered design (shared mental model of task composition in AI data markets). Neil's research has resulted in deployable open-source systems, environmental art exhibitions, and technical talks at global policymaking forums of the United Nations and European Union. His scholarship continues to benefit researchers and practitioners worldwide. Daemo has been cited in the International Labour Organization's (ILO) report on Digital Labour Platforms and the Future of Work and deployed to create SQuAD, Stanford's Natural Language Processing dataset. Besides, Boomerang (Gaikwad et al. 2016) has been a part of the advanced HCI/human-computation course curriculum at leading universities. EteRNA has reached over 250,000 citizen scientists as of 2016; it was also one of the 25 great ideas from CMU's School of Computer Science. Neil's TEDx talk presents his vision for just market institutions in the era of AI. Neil is committed to increasing diversity and belonging in science, technology, and policy. He was one of the core members of the Stanford Crowd Research Initiative, MIT's Innovating for Billions in Emerging Worlds Leadership Council, and Computational Sustainability Open Graduate Seminar organizers. He has mentored over 20 students, who have gone on to win prestigious awards (e.g., Apple Ph.D. Fellowship), pursue careers in research, and publish influential scholarship that has shifted the discourse on AI fairness. Neil's research, teaching, and professional service have been widely recognized with the Facebook Research Ph.D. Fellowship, William Asbjornsen Albert Memorial Fellowship (awarded to one MIT student conducting research in modern science and engineering), UChicago Rising Stars in Data Science, MIT GSC Graduate Teaching Award (presented annually to one MIT professor or teaching assistant from each school for excellence in teaching a graduate-level course). Selected Awards and Honors Leadership Karl Taylor Compton Prize, 2019, MIT's Highest Student Award Research and Innovation Facebook Research Fellowship, 2019 Rising Star in Stanford Management Science and Engineering, 2024 PKG Fellowship for Public Interest Tech and Social Impact, 2024 Schmidt Science Fellowship MIT Nomination, 2023 Fellow, MIT Center for Ethics and Transformative Values, 2023 MIT Social & Ethical Responsibilities of Computing Scholar, 2023 Rising Stars in Data Science, UChicago, 2021 MIT William Asbjornsen Albert Memorial Science & Engg Fellowship, 2021 MIT Human Rights & Technology Fellowship, 2021 INK Fellow Emerging Innovator, 2019 Best Paper Honorable Mention, UIST 2017 Teaching MIT GSC Graduate Teaching Award, 2018 MIT Kaufman Teaching Certificate, 2017 Teaching Fellow MIT EECS Comm Lab, 2020 Professional Service EAAMO 2021, Program Committee, Best Reviewers CHI 2020 and CHI 2019 Special Recognition, Outstanding Reviews IJCAI 2018, Distinguished PC Arts MIT Arts Scholars National Geographic Photo of the Day Publications (Organized by Research Themes) Responsible AI and Policy for Ethical Decision-Making in the context of Sustainable Development Algorithmic Alignment: Value-Sensitive Designs of Human-AI Collaboration for Global Social Inclusion Gaikwad, S. Annual Ethical AI Symposium 2024, The Michigan Institute for Data Science, University of Michigan, Ann Arbor Value Sensitive Design of Ethically Responsible Human-AI Systems for Sustainable Food Supply Gaikwad, S. The National Science Foundation (NSF) Workshop on Sustainable Computing 2024 Data-driven Humanitarian Mapping and Policymaking: Toward Planetary-Scale Resilience, Equity, and Sustainability Gaikwad, S., Iyer, Shankar., Lunga, Dalton., Yabe, Takahiro., Laing, Xiaofan., Ananthabhotla, Bhavani., Behari, Nikhil., Guggilam, Sreelekha., GuanghuaChi KDD 2022, KDD 2021, KDD 2020: ACM SIGKDD Conference on Knowledge Discovery and Data Mining. link website picture_as_pdf paper 2022 picture_as_pdf paper 2021 picture_as_pdf KDD workshop proceedings 2021 picture_as_pdf KDD workshop proceedings 2020 Decoding the Evolution of UN’s Sustainable Development Goals using Bayesian Inference Gaikwad, S. Santa Fe Institute, Complex Systems Summer School Proceedings 2018 AI Alignment: Human-AI Systems for Ethical Decision-Making at a Societal Scale (Involving Millions of People) A Voting-Based System for Ethical Decision Making Noothigattu, Ritesh., Gaikwad, S., Awad, Edmond., D'Souza, Sohan., Rahwan, Iyad., Ravikumar, Pradeep., Procaccia, Ariel D. AAAI 2018: Association for the Advancement o",
  "content_length": 36280,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:28"
}