{
  "name": "Neil A. Ernst",
  "homepage": "http://neilernst.net",
  "status": "success",
  "content": "Neil Ernst – Semantic Werks I am associate professor of Computer Science at the University of Victoria. I am fortunate to have been born, to live, and to work on the traditional territory of the lək̓ʷəŋən peoples, and the Songhees, Esquimalt and W̱SÁNEĆ peoples whose historical relationships with the land continue to this day. You can learn more about my research. Download my short bio. I teach courses in software engineering (mostly) for our Software Engineering and Computer Science programs. I am the acting director of the Bachelor of Software Engineering program. I serve in various roles as workshop and conference organizer, program committees, student supervision, journal reviews, etc. Among others: Director, UVic Matrix Institute for Data Science Senior Associate Editor, Journal of Systems and Software registered reports and open science advocate program committees - among others, at various times, ICSE, RE, XP, CAISE, ER, MODELS Associate Editor, Journal of Empirical Software Engineering Mastodon Github Consulting I occasionally act as speaker, consultant and expert for matters relating to software architecture and software requirements, including architecture analysis, modern software development practices, and analytics for software engineering. Previously senior member of the technical staff at the Software Engineering Institute at Carnegie Mellon University. postdoc in software engineering at the University of British Columbia. PhD student in Computer Science at the University of Toronto. master’s student in Computer Science at the University of Victoria. undergraduate research in geography and GIS at the University of Victoria, including work placements with the BC Ministry of the Environment. Contact Phone: c’mon man email: nernst@uvic.ca Fax: 250-472-5708 (srsly?) Postal Mail: Department of Computer Science University of Victoria Engineering & Computer Science Building (ECS), Room 504 PO Box 1700 STN CSC Victoria BC V8W 2Y2 Canada",
  "content_length": 1977,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:20"
}