{
  "name": "Neil Buchanan",
  "homepage": "https://pure.qub.ac.uk/en/persons/neil-buchanan",
  "status": "success",
  "content": "Neil Buchanan - Queen's University Belfast View Scopus Profile Neil Buchanan Dr Reader, School of Electronics, Electrical Engineering and Computer ScienceWireless Communication SystemsInstitute of Electronics, Communications & Information Technology Phone+44 (0)28 9097 1721Emailn.buchananecit.qub.acuk Room 01.018 - Queens Titanic Quarter (QTQ)United Kingdom 1996 …2025 Research activity per year Personal profile Fingerprint Dive into the research topics where Neil Buchanan is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Arrays Physics 100% Antenna Engineering 97% Performance Engineering 57% Applications Engineering 44% Networks (Circuits) Engineering 44% Antenna Arrays Engineering 43% Array Earth and Planetary Sciences 40% Elements Engineering 33% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2023 2023 2023 1 Active Projects per year R5278ECS: Research into Next Generation Information Networks (R-NGIN) Phase 2 FullCotton, S. (PI), Abbasi, M. A. B. (CoI), Buchanan, N. (CoI) & Yurduseven, O. (CoI)25/09/2023 → …Project: Research Research output Research output per year 1996 2009 2010 2011 2013 2021 2022 2023 2024 2025 2025 37 Article 31 Conference contribution 26 Paper 2 Letter 2 More 1 Abstract 1 Special issue Research output per year Research output per year Comprehensive analysis of mmWave antenna array for B5G/6G mobile device based on experimental measurementsLarmour, C., Yurduseven, O., Fusco, V., Diola, N., Buchanan, N., Zelenchuk, D. & Abbasi, M. A. B., 26 Jun 2025, (Early online date) In: IEEE Transactions on Antennas and Propagation. 16 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Experimental Measurement 100% Antenna Arrays 100% Millimeter Wave 100% Experimental Result 25% Field Measurement 25% 16 Downloads (Pure) Mutual coupling reduction considerations for 2 × 2 and 3 × 3 sparse microstrip patch antenna arrayLarmour, C., Abbasi, M. A. B., Buchanan, N., Zelenchuk, D. & Fusco, V., 23 Jan 2025, 2024 International Symposium on Antennas and Propagation (ISAP): Proceedings. Institute of Electrical and Electronics Engineers Inc., (International Symposium on Antennas and Propagation (ISAP): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Mutual Coupling 100% Antenna Arrays 100% microstrip patch antenna 100% Review Paper 50% Optimization Method 50% 18 Downloads (Pure) Portable, inclusive, and affordable electronics laboratories: promoting diversity and overcoming barriers in engineering educationToh, B. Y. & Buchanan, N., 03 Jun 2025, The IEEE Global Engineering Education Conference, EDUCON 2025: Proceedings. Institute of Electrical and Electronics Engineers Inc., 6 p. (IEEE Global Engineering Education Conference, EDUCON: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Engineering Education 100% Engineering 100% Positive Feedback 100% Personal Computer 100% Diverse Background 50% 7 Downloads (Pure) Rapidly deployable remote analogue electronics lab with antiplagiarism and AI immunity featuresToh, B. Y. & Buchanan, N., 03 Jun 2025, IEEE Global Engineering Education Conference (EDUCON 2025): Proceedings. Institute of Electrical and Electronics Engineers Inc., 7 p. (Proceedings of the IEEE Global Engineering Education Conference (EDUCON)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Artificial Intelligence 100% Analogue Electronics 100% Team Member 33% Analog Circuit 33% Plagiarism 33% 42 Downloads (Pure) Self-mixing phase conjugator for retrodirective wireless power transfer applicationsBuchanan, N. & Mardani, H., Jun 2025, In: IEEE Transactions on Microwave Theory and Techniques. 73, 6, p. 3359 - 3367Research output: Contribution to journal › Special issue › peer-review Open AccessFile Wireless Power Transfer 100% Antenna 100% Pilot Signal 100% Power Amplifier 100% Intermediate Frequency 100% 2 Citations (Scopus) 93 Downloads (Pure) View all 98 research outputs Datasets Active Circular Retro-directive ArrayChepala, A. (Creator), Fusco, V. (Creator) & Buchanan, N. (Creator), Queen's University Belfast, 17 Jul 2019DOI: 10.17034/5197a141-cdbb-48a8-af91-a7e09a748c3c, https://ieeexplore.ieee.org/document/8763897Dataset File Analog/Digital Hybrid Delay-Locked-Loop for K/Ka Band Satellite Retrodirective Arrays Fusco, V. (Creator) & Buchanan, N. (Creator), Queen's University Belfast, 2018DOI: 10.17034/9e1ded07-cfed-4647-aef7-79c92b4be5c3Dataset File Prizes Belfast business Top 50 AwardBuchanan, N. (Recipient), 18 Oct 2012Prize: Prize (including medals and awards) Belfast 100% Enterprises 100% Houses 100% Awards 100% Satellites 100% Best Student Paper Award Safari Mugisho, M. (Recipient), Buchanan, N. (Recipient) & Thian, M. (Recipient), 16 Jul 2020Prize: Prize (including medals and awards) Harmonics 100% Power Amplifier 100% Inductance 100% Students 100% Injection 100% ESA Young Antenna Engineer PrizeBuchanan, N. (Recipient), 26 Oct 2010Prize: Prize (including medals and awards) Applications 100% Mobile Terminal 100% Antenna 100% Antenna Technique 100% Mobile World Scholar Gold AwardBuchanan, N. (Recipient), 26 Feb 2018Prize: Prize (including medals and awards) Application 100% Waves 100% Antennas 100% 5g 100% Utilization 100% NISP 25K Awards - Overall WinnerBuchanan, N. (Recipient), 27 Sept 2011Prize: Prize (including medals and awards) Award 100% View all 8 prizes Activities Activities per year 2014 2019 2021 2023 2024 2024 8 Invited talk 3 Joint or sponsored appointments or secondments with industry or commerce 3 Research and Teaching at External Organisation 2 Participation in conference 1 More 1 Work on advisory panel to industry or government or non-government organisation Activities per year IEEE MTT-S International Microwave Symposium (IMS2024)Buchanan, N. (Invited speaker)11 Jun 2024 → 16 Jun 2024Activity: Talk or presentation types › Invited talk 12th IET Colloquium on Antennas, Wireless and Electromagnetics (CAWE)Buchanan, N. (Keynote speaker)15 May 2024Activity: Talk or presentation types › Invited talk European Conference on Antennas and Propagation (EuCAP) 2024Buchanan, N. (Invited speaker)20 Mar 2024Activity: Talk or presentation types › Invited talk UK Space Conference 2023Buchanan, N. (Invited speaker)20 Nov 2023Activity: Talk or presentation types › Invited talk UK Space Conference 2023Buchanan, N. (Session chair)20 Nov 2023Activity: Participating in or organising an event types › Participation in conference View all 17 activities Press/Media RTE Futureville Ireland - Space Solar PowerBuchanan, N.13/11/20241 Media contributionPress/Media: Expert Comment Space solar Farms - BBC Radio UlsterBuchanan, N.30/06/20241 Media contributionPress/Media: Expert Comment Solar Farms In Space - U105 RadioBuchanan, N.16/05/20241 Media contributionPress/Media: Expert Comment Irish scientists predict space solar power plants could help solve global energy crisis as technology advances - ExBulletinBuchanan, N.16/05/20241 Media contributionPress/Media: Expert Comment Solar farms in space could help solve global energy crisis following tech breakthrough, Irish scientists predict - Irish TimesBuchanan, N.16/05/20241 Media contributionPress/Media: Expert Comment View all 8 press/media",
  "content_length": 7786,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:23"
}