{
  "name": "Nektarios Georgios Tsoutsos",
  "homepage": "https://udel.edu/~tsoutsos",
  "status": "success",
  "content": "Nektarios Georgios Tsoutsos Home Publications Research Advisees Teaching Service Misc Nektarios Georgios Tsoutsos Nektarios Georgios Tsoutsos, Ph.D. Associate Professor, University of Delaware Co-Director, FinTech Innovation Hub Associate Director, Center for Cybersecurity, Assurance, and Privacy Department of Electrical and Computer Engineering 139 The Green, Evans Hall, Newark, DE 19716 Department of Computer and Information Sciences 18 Amstel Ave, Smith Hall, Newark, DE 19716 FinTech Innovation Hub 591 Collaboration Way, FinTech Innovation Hub, Newark, DE 19713 Office: 201F Evans Hall [Map] Phone: (302) 831–6655 Email: lastname at udel dot edu [PGP] Vita I am an associate professor in the Department of Electrical and Computer Engineering at the University of Delaware, with a joint appointment in the Department of Computer and Information Sciences. As of 2021, I am also associate director at the Center for Cybersecurity, Assurance, and Privacy at UD, and as of September 2024, I am a co-director of UD's FinTech Innovation Hub. Since May 2025, I am also a member of the Delaware Cyber Security Advisory Council, and a senior member of the Institute of Electrical and Electronics Engineers (IEEE). My research interests are in cybersecurity and applied cryptography, with a special focus in hardware security, trustworthy computing, and privacy outsourcing. I have received the Ph.D. degree in Computer Science from New York University, and the M.Sc. degree in Computer Engineering from Columbia University. Before joining UD, I was a postdoctoral researcher at NYU where I have been developing secure architectures for private and trustworthy processing of sensitive information using homomorphic encryption. While at NYU, I have also spent time at Intel and the Security Center of Excellence in Hillsboro, OR. Honors and Awards National Science Foundation (NSF) CAREER Award from the Secure & Trustworthy Cyberspace program Recognition: Delaware's 15 Most Influential Business Leaders by the Delaware News Journal (2023) University of Delaware Research Foundation (UDRF) Award in 2021 New York University Ph.D. Student Fellowship for the duration of doctoral studies Pearl Brownstein Doctoral Research Award for doctoral research showing the greatest promise (NYU) Deborah Rosenthal Award for outstanding performance on the Ph.D. Qualification Exam (NYU) 1st Place Award at CSAW Embedded Security Challenge '13 for the design of stealthy hardware Trojan horses to bypass the protections of FANCI (CCS '13) Advisee Honor: 1st Place Award at CSAW Embedded Security Challenge '18 for designing robust covert channels to exfiltrate sensitive data using IoT smart bulbs (C. Gouert) Advisee Honor: 3rd Place Award at CSAW Hack3D '20 for for reverse engineering additive manufacturing files (N. Kater) Advisee Honor: Graduate Fellowship by the Gerondelis Foundation (D. Mouris) Advisee Honor: 1st Place Award at ECE Research Day '21 for privacy-preserving neural network inference (L. Folkerts and C. Gouert) Advisee Honor: Graduate Faculty Award on Computer Systems & Networks '21 (C. Gouert) Advisee Honor: 1st Place Best Presentation Award at IEEE R2DM Workshop '21 (D. Mouris) Advisee Honor: 2nd Place Best Presentation Award at IEEE R2DM Workshop '21 (L. Folkerts) Advisee Honor: Graduate Block Funding Fellowship of ECE department '21 (C. Gouert) Advisee Honor: Excellence in Teaching Award of UD's College of Engineering '22 (L. Folkerts) Advisee Honor: 1st Place Award at ECE Research Day '22 for attacks in privacy-preserving multi-exit neural networks (L. Folkerts) Advisee Honor: Graduate Fellowship Finalist in 2022 by NVIDIA (C. Gouert) Advisee Honor: Doctoral Fellowship for Excellence of UD's Graduate College in 2023 (C. Gouert) Advisee Honor: Travel Grant from NDSS 2023 Symposium '23 (L. Folkerts) Advisee Honor: Travel Grant from PETS 2023 Symposium '23 (D. Mouris) Advisee Honor: 1st Place Award at ECE Research Day '23 for Accelerated Encrypted Computing on GPUs (C. Gouert) Advisee Honor: First-year Scholarship of UD's ECE department '24 (O. Gutierrez) Advisee Honor: ECE Faculty Award for Computer Engineering '24 (L. Folkerts) Advisee Honor: Builder Bounty 2024 Award by Nillion for secure biometric authentication using private facial recognition (O. Ahmed, L. Folkerts) Select Media Coverage Forever CSAW, by Lois Anne DeLong, NYU CyberByte New directors for UD's growing fintech endeavors, by Beth Miller, UDaily News Supporting Cybersecurity Scholars, by Erica Brockmeier, UDaily News Improving Cybersecurity, by Erica Brockmeier, UDaily News Business: Delaware's most influential people, by Brandon Holveck, Delaware News Journal Encouraging Equity in FinTech, by Maddy Lauria, UDaily News Degree of the future – Cybersecurity Engineering, by Maddy Lauria, University of Delaware Magazine Blue Hens Capture The Flag (2022), by Maddy Lauria, UDaily News Degree of the Future, by Maddy Lauria, UDaily News Blue Hens Capture the Flag (2021), by UD Engineering, UDaily News Training Ethical Hackers, by Julie Stewart, UDaily News Team secures NSF grant to advance novel CAD technology for 3D printing, by UD ECE News 3D Printing Gives Hackers Entirely New Ways to Wreak Havoc, by Alessandro Di Fiore, Harvard Business Review 3D Printing Security Risk Caused by Undetectable Defects, and Ways to Prevent It, by Michael Kassner, TechRepublic Fabrication-time Attacks and the Manchurian Chip, by Pierluigi Paganini, Security Affairs NYU Team Encode Parts with 3D Printed QR \"Clouds\" to Prevent Counterfeiting, by Beau Jackson, 3D Printing Industry Medical and Aerospace 3D Printed Parts Could Be Secured by Embedded QR Codes, by Clare Scott, 3Dprint.com World's Biggest Student-Led Cybersecurity Games Announce Winners of CSAW 2018, by NYU Tandon School of Engineering",
  "content_length": 5801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:30"
}