{
  "name": "Nelly Fazio",
  "homepage": "http://www-cs.ccny.cuny.edu/~fazio",
  "status": "success",
  "content": "Nelly Fazio Nelly Fazio, Ph.D. Associate Professor City University of New York (CUNY) Affiliations: The City College of New York Department of Computer Science and CAISS Center The Graduate Center Department of Computer Science Brief Bio Contact Info The Graduate Center Crypto Group (GCCG) Research Interests: My research interests are in cryptography and information security. My research publications are available online. See also my DBLP entry and my Google Scholar profile. Research Funding: My research is funded in part by an NSF CAREER award and other grants by the National Science Foundation, by the U.S. Army Research Laboratory and the U.K. Ministry of Defence, by a CUNY CIRG award and two PSC-CUNY awards. The support of the respective funding agencies is gratefully acknowledged. Students: Dissertation Advising: Marios Georgiou (Graduate Center of CUNY). Fall '14–Spring '20. Milinda Perera (Graduate Center of CUNY). Fall '10–Spring '15. Cyrus Peterpaul (Graduate Center of CUNY). Spring '13–Fall '14. Undergraduate Advising: Anuja Prabhakar (National Institute of Information Technology, New Delhi, India). Spring 2014. (co-advised with Prof. K. Ravindran) Grace Mark (NYU GSTEM summer program). Summer 2013. Anuja Prabhakar (National Institute of Information Technology, New Delhi, India). Summer 2013. Linda Wong (City College of CUNY). Spring '12–Fall 12. Stanis Laus Billy (City College of CUNY). Summer 2010. Milinda Perera (City College of CUNY). Summer 2010. Sam Neubardt (City College of CUNY). Fall 2010. Kevin Ramdath (City College of CUNY). Fall 2010. Current Teaching: Fall 25: Algorithms (CSc 22000, City College of New York) Fall 25: Cryptography (CSc 48000, City College of New York) Previous Teaching: Spring 25: Algorithms (CSc 22000, City College of New York) Spring 25: Modern Cryptography (CSc 73010, Graduate Center) Fall 24: Algorithms (CSc 22000, City College of New York) Fall 24: Fundamental Algorithms (CSc I0600, City College of New York - Master Level) Spring 24: Algorithms (CSc 22000, City College of New York) Spring 24: Cryptography (CSc 48000, City College of New York) Fall 23: Algorithms (CSc 22000, City College of New York) Fall 23: Computer Security (CSc 38000, City College of New York) Spring 23: Algorithms (CSc 22000, City College of New York) Spring 23: Fundamental Algorithms (CSc I0600, City College of New York - Master Level) Fall 22: Algorithms (CSc 22000, City College of New York) Fall 22: Fundamental Algorithms (CSc I0600, City College of New York - Master Level) Spring 22: Algorithms (CSc 22000, City College of New York) Spring 22: Fundamental Algorithms (CSc I0600, City College of New York - Master Level) Fall 21: Modern Cryptography (CSc 85030, Graduate Center) Fall 21: Fundamental Algorithms (CSc I0600, City College of New York - Master Level) Fall 2020–Spring 2021: Cryptography and Cryptocurrencies (CSc 59866, City College of New York) Fall 2020: Algorithms (CSc 22000, City College of New York) Spring 2020: Algorithms (CSc 22000, City College of New York) Fall 19: Modern Cryptography (CSc 73010, Graduate Center) Fall 19: Algorithms (CSc 22000, City College of New York) Spring 19: Algorithms (CSc 22000, City College of New York) Fall 18: Modern Cryptography (CSc 80010, Graduate Center) Fall 18: Discrete Mathematical Structures (CSc 10400, City College of New York) Fall 17: Discrete Mathematical Structures (CSc 10400, City College of New York) Spring 16: Algorithms (CSc 22000, City College of New York) Fall 15: Cryptographic Protocols (CSc 85030, Graduate Center) Spring 15: Modern Cryptography (CSc 85031, Graduate Center) Fall 14: Algorithms (CSc 22000, City College of New York) Fall 13: Cryptographic Protocols (CSc 85030, Graduate Center) Spring 13: Computer Security (CSc 48000, City College of New York) Fall 12: Modern Cryptography (CSc 85030, Graduate Center) Fall 12: Algorithms (CSc 22000, City College of New York) Spring 12: Computer Security (CSc 48000, City College of New York) Fall 11: Cryptographic Protocols (CSc 85030, Graduate Center) Fall 11: Computer Security (CSc 48000, City College of New York) Spring 11: Algorithms (CSc 22000, City College of New York) Spring 11: Computer Security (CSc 48000, City College of New York) Fall 10: Modern Cryptography (CSc 85030, Graduate Center) Fall 10: Formal Languages (CSc 42800, City College of New York) Fall 09–Spring 10: Applied Cryptography (CSc 59866, City College of New York) Spring 09: Modern Cryptography (CSc 85030, Graduate Center) Fall 08: Computer Security (CSc 48000, City College of New York) Professional Activities: Conference Organizer: Faces of Modern Cryptography conference (FoMC '13) (Poster) The City College of New York—CUNY, October 4, 2013. New York, NY The 9th IACR Theory of Cryptography Conference (TCC '12) (Call for Papers) March 18–21, 2011, Taormina, Italy. General co-Chair. Faces of Modern Cryptography conference (FoMC '11) (Poster) The City College of New York—CUNY, September 09, 2011. New York, NY Security and Privacy Day (SnP '11) (Poster) The City College of New York—CUNY, May 20, 2011. New York, NY The 14th IACR International Conference on Public Key Cryptography (PKC '11) (Call for Papers) March 6-9, 2011, Taormina, Italy. General co-Chair. Faces of Modern Cryptography conference (FoMC '09) (Poster) The City College of New York—CUNY, September 11, 2009. New York, NY Program Committee Member: The 15th International Conference on Cryptology and Network Security (CANS '16), November 14–16, 2016, Milan, Italy. The 13th International Conference on Applied Cryptography and Network Security (ACNS '15), June 2–5, 2015, New York, NY. The 17th IACR International Conference on Public Key Cryptography (PKC '14), March 26–28, 2014, Buenos Aires, Argentina. The 11th IACR Theory of Cryptography Conference (TCC '14), February 24–26, 2014. San Diego, CA, USA. The 7th IACR Theory of Cryptography Conference (TCC '10), February 9–11, 2010, Zurich, Switzerland The Cryptographers' Track at the RSA Conference (CT-RSA '09), April 20–24, 2009, San Francisco, CA, USA The 12th IACR International Conference on Practice and Theory in Public Key Cryptography (PKC '09), March 18–20, 2009, Irvine, California, USA ACM Symposium on Information, Computer & Communication Security (ASIACCS '09), March 17–19, 2009, Sydney, Australia The 6th Applied Cryptography and Network Security Conference (ACNS '08), June 3–6, 2008, New York, NY, USA The Cryptographers' Track at the RSA Conference (CT-RSA '08), April 8–11, 2008, San Francisco, CA, USA The 6th ACM Digital Rights Management Workshop (DRM '07), October 2007, Alexandria, VA, USA The 10th International Security Conference (ISC '07), October 9–12, 2007, Valparaiso, Chile 1st International Conference on Provable Security (ProvSec '07), October 29–31, 2007, Wollongong, Australia The 2nd SKLOIS Conference on Information Security and Cryptology (Inscrypt '06 - formerly CISC), Nov. 29–Dec. 1, 2006, Beijing, P.R. China. 1st ACM Workshop on Content Protection and Security (MCPS '06),October 27, 2006, Santa Barbara, CA, USA Journal Reviewer: IACR Journal of Cryptology ACM Transactions on Information and System Security (TISSEC) IEE Information Security IEEE Transactions on Broadcasting International Journal of Computers and Electrical Engineering Tutorial Organizer & Speaker: Tutorial on Content Protection ACM Multimedia 2008, October 27-31, Vancouver, BC, Canada. Tutorial on Multimedia Content Protection ACM Multimedia 2006, October 23-27, Santa Barbara, CA. Contact Information: Mailing address: Department of Computer Science The City College of New York 160 Convent Ave, NAC 8/206 New York, NY 10031 @ City College: nfazio [at] ccny [dot] cuny [dot] edu Room: NAC 8/201 Phone: (212) 650-5151 @ Graduate Center: nfazio [at] gc [dot] cuny [dot] edu 365 Fifth Avenue, Room 4411 Copyright © Nelly Fazio",
  "content_length": 7856,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:32"
}