{
  "name": "Nelleke Oostdijk",
  "homepage": "https://www.ru.nl/english/people/oostdijk-n",
  "status": "success",
  "content": "Dr N.H.J. Oostdijk (Nelleke) | Radboud University Dr N.H.J. Oostdijk (Nelleke) Guest researcher - Department of Language and Communication Guest researcher - Centre for Language Studies Member - Representative Council Faculty of Arts As a computational linguist, Nelleke Oostdijk’s main research interests are centred around language use and variation, the role of expert (linguistic) knowledge in approaches to text mining and information retrieval, and the creation and curation of language resources.Nelleke Oostdijk is affiliated as a researcher with the research institute Centre for Language Studies (CLS) and the research group Language and Speech Technology. She is also chair of the advisory board of the Centre for Language and Speech Technology (CLST). Until 1 September 2024 Nelleke Oostdijk was coordinator of the research master programme in Linguistics and Communication Sciences and teacher ambassador for the Teaching and Learning Centre (TLC). Research group Language and Speech Technology Tags: Computational Linguistics, Text Mining, Corpus Linguistics, Deep Syntactic Parsing, Language Resources Publications Key publications Tan, F., Hettiarachchi, H., Hürriyetoğlu, A., Oostdijk, N.H.J., Caselli, T., Nomoto, T., Uca, O., Liza, F. & Ng, S. (2023). RECESS. Resource for Extracting Cause, Effect, and Signal Spans. In Proceedings of the 13th International Conference on Natural Language Processing and the 3rd Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics 2023 (IJCNLP-AACL 2023) (pp. 66-82). Association for Computational Linguistics Full text Larson, M., Oostdijk, N.H.J. & Zuiderveen Borgesius, F.J. (2021). Not Directly Stated, Not Explicitly Stored: Conversational Agents and the Privacy Threat of Implicit Information. In J. Masthoff & E. Herder (Eds.), UMAP '21: Adjunct Proceedings of the 29th ACM Conference on User Modeling, Adaptation and Personalization, Utrecht Netherlands June 21 - 25, 2021 (pp. 388–391). New York: Association for Computing Machinery doi: 10.1145/3450614.3463601 Full text D’hondt, E., Verberne, S., Oostdijk, N.H.J. & Boves, L.W.J. (2017). Patent Classification on Subgroup Level Using Balanced Winnow. In M. Lupu, K. Mayer, N. Kando & A.J. Trippe (Eds.), Current Challenges in Patent Information Retrieval (The Information Retrieval Series, 37) (pp. 299-324). Berlin, Heidelberg: Springer Berlin Heidelberg. Full text Oostdijk, N.H.J., Reynaert, R., Schuurman, I. & Hoste, V. (2013). The construction of a 500-million-word reference corpus of contemporary written Dutch. In P. Spyns & J. Odijk (Eds.), Essential Speech and Language Technology for Dutch (Theory and Applications of Natural Language Processing) (pp. 219-247). Berlin: Springer. Full text Oostdijk, N.H.J. (1991). Corpus Linguistics and the Automatic Analysis of English. Amsterdam: Rodopi. Publication lists Radboud Repository Research Information Services (RIS) Projects 2023 - 2027 HYBRIDS -- Fake news, disinformation and hate speech online are pervasive and exacerbating societal tensions. Amidst growing concern that this harmful rhetoric is inciting violence and driving extremism, a global strategy to counter this digital phenomenon is more important than ever. In this context, the Marie Skłodowska-Curie Actions project HYBRIDS is working to provide researchers with the knowledge and tools they need to tackle disinformation. Specifically, it will integrate the structured knowledge provided by social and human sciences into natural language processing tools and deep learning algorithms. By developing new hybrid intelligence systems, HYBRIDS will combine machine and human intelligence to overcome the shortcomings of existing artificial intelligence methods. More information Teaching Education prizes 2017 - Prijs der Humaniora. RU, Faculty of Arts.> Courses Bachelor Term Paper Bachelor Thesis Master Thesis Computing Science Master Thesis Information Sciences Research Master thesis Ancillary activities No relevant ancillary activities have been specified by Dr N.H.J. Oostdijk (Nelleke). About Nelleke Oostdijk researches how predefined linguistic patterns can be used to automatically extract information from large amounts of text. For example, with this method, an investigative authority can detect only those tweets that contain threatening language among millions of tweets.",
  "content_length": 4363,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:32"
}