{
  "name": "Nenad Medvidovic",
  "homepage": "https://softarch.usc.edu/~neno",
  "status": "success",
  "content": "Nenad Medvidovic success fail Jul SEP Oct 11 2018 2019 2020 499 captures 28 Apr 2006 - 11 Sep 2019 About this capture COLLECTED BY Collection: Twitter Outlinks TIMESTAMPS Nenad MedvidoviÄ TRW Professor in Engineering Professor and Chair Thomas Lord Department of Computer Science School of Advanced Computing Viterbi School of Engineering University of Southern California Office:  GCS 102 G1 (Chair) / GCS 505 N (Faculty) E-mail: neno@usc.edu Phone: +1-213-740-4494 (Chair) / +1-213-740-5579 (Faculty) Assistant to CS Chair: Julia Mittenberg-Beirao Office: GCS 102 G E-mail: mittenbe@usc.edu Phone: +1-213-740-4498 Mailing Address 1031 Downey Way University of Southern California Los Angeles, CA 90089-0781, U.S.A. News People Jae young Bang (Ph.D. 2015) named CEO of Cyberonix Yuriy Brun (Ph.D. 2008) named IEEE Fellow Joshua Garcia (Ph.D. 2014) promoted to Associate Professor with Tenure at UC Irvine Youn Kyu Lee (Ph.D. 2017) joined Chung Ang University, South Korea as Associate Professor Chris Mattmann (Ph.D. 2007) named Chief Data and AI Officer at UCLA Marija MikiÄ (Ph.D. 2004) joined Cruise as VP of AI Foundations Adriana Sejfia (Ph.D. 2023) joined University of Edinburgh, UK as Lecturer (Assistant Professor) Saghar Talebipour (Ph.D. 2024) joined Snap as Software Engineer Publications A Classification and Comparison Framework for Software Architecture Description Languages named an IEEE TSE Most Influential Paper DNN Modularization via Activation-Driven Training accepted to ICSE 2026 Automated Test Transfer across Android Apps using Large Language Models appeared in ISSTA 2025 and Proceedings of the ACM on Software Engineering Are We Learning the Right Features? A Framework for Evaluating DL-Based Software Vulnerability Detection Solutions presented at ICSE 2025 Trust Dynamics in AI-Assisted Development: Definitions, Factors, and Implications presented at ICSE 2025 Toward Improved Deep Learning-based Vulnerability Detection presented at ICSE 2024 Projects Modularization of Deep Neural Networks Leveraging AI to Detect and Predict Software Vulnerabilities Leveraging LLMs and Reinforcement Learning for Software Modernization Systematic Assessment of LLMs' Software Generation Capabilities Automatic Assessment of Architectural Sustainability in Software Systems A General Framework for Automated Test Transfer across Applications and Platforms Research Publications (Google Scholar) Curriculum Vitae Students Teaching Wikipedia Page Short Bio Appointments Nenad MedvidoviÄ is a TRW Professor in Engineering, and Professor and Chair in the Thomas Lord Department of Computer Science at the University of Southern California (USC). He is also a faculty associate of the Institute for Software Research (ISR) at the University of California, Irvine. MedvidoviÄ is the Founding Director of the SoftArch Laboratory at USC. He has served as Director of the USC Center for Systems and Software Engineering (2009-2013), as well as Vice-Chair for Tenure Affairs (2021-2022) and Associate Chair for Ph.D. Affairs in USC's CS Department (2011-2015). MedvidoviÄ has served as Editor-in-Chief of IEEE Transactions on Software Engineering (2018-2022). He has Chaired the ACM Software System Award Committee (2021-2022), ACM Special Interest Group on Software Engineering (SIGSOFT) (2015-2018), and Steering Committees for the International Conference on Software Engineering (2013-2015) and the Symposium on the Foundations of Software Engineering (2015-2017). He was the Program Co-Chair of ICSE 2011 and General Co-Chair of ICSA 2024. Education MedvidoviÄ received his B.S. in 1992 from the Department of Computer Science and Engineering at Arizona State University. He received his M.S. in 1995 and Ph.D. in 1999 from the Department of Information and Computer Science at University of California, Irvine. Research MedvidoviÄâs research interests are in the area of software engineering, with a particular focus on architecture-based software development. His work has studied event-based architectures; architecture recovery, maintenance, and evolution; middleware facilities for architectural implementation; domain-specific architectures; architectural styles and patterns; and architectures of distributed, decentralized, mobile, resource constrained, and embedded systems. Recently, he has worked on assessing the suitability of AI techniques to a range of software engineering activities, as well as the applicability of software engineering techniques to AI. He is a co-author of a textbook on software architectures. Honors MedvidoviÄ is a recipient of the National Science Foundation CAREER (2000) award, the Okawa Foundation Research Grant (2005), the IBM Real-Time Innovation Award (2007), the USC Mellon Mentoring Award (2010), the OCEC Distinguished Engineering Merit Award (2018), and the ACM SIGSOFT Distinguished Service Award (2020). He was named to the UC Irvine School of Information and Computer Sciences Hall of Fame (2023). He is a co-author of the ICSE 1998 and SEAMS 2007 papers that were given the respected conferences' Most Influential Paper (\"test-of-time\") awards, as well as a 2000 IEEE TSE paper that was named a Most Influential Paper. Several of his other papers have won Best Paper awards at conferences and Most Cited recognitions from journals. MedvidoviÄ is an ACM Distinguished Scientist and an IEEE Fellow.",
  "content_length": 5376,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:39"
}