{
  "name": "Nergis Tömen",
  "homepage": "https://www.tudelft.nl/en/ewi/over-de-faculteit/afdelingen/intelligent-systems/pattern-recognition-bioinformatics/computer-vision-lab/people/nergis-toemen",
  "status": "success",
  "content": "Nergis Tömen Search Close search Nergis Tömen Modern computer vision models, such as deep neural networks, share fundamental principles with visual information processing in the brain, yet there is still much to learn from biological systems, especially in terms of scale, speed, and efficiency. Drawing on these shared principles, my work is focused on biologically-inspired computer vision. My research interests include scalable machine vision using sensors (such as event-based cameras) and software (such as spiking neural networks) which mimic the brain. In terms of applications, I am interested in developing low-power and low-latency machine vision, with implications for sustainable ICT and green AI. Potential applications include control of autonomous vehicles, for example self-driving cars or autonomous drones, with strict low power and latency requirements. Similarly, biologically-inspired machine vision is suitable for a variety of safety-critical real-time control applications which benefit from a low-bandwidth and high-speed approach, such as control of medical imaging instruments. I am the co-director of Delft AI Lab “Biomorphic Intelligence Lab”, which is a collaboration between the EEMCS faculty and the Aerospace Engineering faculty. My main research focus is to build low-power vision pipelines for micro air vehicles, which have strict power, latency and payload restrictions. For more information see: https://www.tudelft.nl/ai/biomorphic-intelligence-lab I am the co-director of Delft AI Lab “BIOLab”, which is a collaboration between the EEMCS faculty and the Applied Sciences faculty. My main research focus within the lab is computer vision for biomedical applications, including automated extraction of biophysical models from live tissue microscopy and integration of low-latency event-cameras for superresolution microscopy. For more information see: https://www.tudelft.nl/ai/biolab I received my Ph.D. in computational neuroscience from the University of Bremen, Germany and have worked as a postdoctoral researcher in the Computer Vision Lab at the Delft University of Technology, Netherlands. Publications: https://scholar.google.com/citations?user=6vcKI6MAAAAJ Share this page: Facebook Linkedin Twitter Email WhatsApp Share this page Nergis Tömen N.Tomen@tudelft.nl Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands",
  "content_length": 2366,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:40"
}