{
  "name": "Neri Merhav",
  "homepage": "http://webee.technion.ac.il/people/merhav",
  "status": "success",
  "content": "Neri Merhav's home page Professor Neri Merhav The Irving Shepard Academic Chair Last update: November 2, 2025 A proposed research project for undergraduate students, Winter Semester 2025-2026: Click here for details. Interested students are encouraged to contact me by e-mail. Contact Information Local Address Room 670, A. Meyer Building, X4737 (merhav@ee) Snail-Mail Address Professor Neri Merhav The Andrew and Erna Viterbi Faculty of Electrical and Computer Engineering Technion - Israel Institute of Technology Technion City, Haifa 3200003, Israel Phone: +972-(4)-829-4737 Fax: +972-(4)-829-5757 Email: merhav AT ee DOT technion DOT ac DOT il Biosketch I received the B.Sc., M.Sc., and D.Sc. degrees from the Technion, Israel Institute of Technology, in 1982, 1985, and 1988, respectively, all in electrical engineering. From 1988 to 1990 I was with AT&T Bell Laboratories, Murray Hill, NJ, USA. Since 1990 I have been with the Electrical Engineering Department of the Technion. During 1994-2000, I was also serving as a consultant to the Hewlett-Packard Laboratories - Israel (HPL-I). During 1996-1999 and 2017-2020 I served as an associate editor for IEEE Transactions on Information Theory, in the areas of Source Coding and Shannon Theory, respectively. Since 2004, I am also on the Editorial Board of Foundations and Trends in Communications and Information Theory. My complete CV can be found here. Areas of Interest My general research interests include information theory, statistical communications, and statistical signal processing. In particular, I am interested in the areas of lossless and lossy source coding, sequential prediction of time-series, relationships between information theory and statistics, most notably, estimation, hypothesis testing, and universal decoding in situations of channel uncertainty. The latter includes also some work on error exponents. Other problem areas which I find interesting include Shannon Theory, in particular, Shannon-theoretic secrecy, joint source-channel coding, source/channel simulation, and coding with side information with applications to information hiding and watermarking systems as well as to biometric security. Some of these topics are also handled using the individual-sequence approach in information theory. Yet another recent research interest of mine concerns relationships between information theory and statistical physics. Teaching Courses I have been teaching: Undergraduate Studies 044198 - Introduction to Digital Signal Processing 044202 - Random Signals 046201 - Introduction to Random-Signal Processing - see videotaped lectures in Youtube. 046205 - Introduction to Coding Theory 046206 - Introduction to Digital Communications 046242 - Statistical Physics, Fluctuations and Noise 046733 - Information Theory Graduate Studies 048934 - Coded Communications 049043 - Universal Lossless Data Compression 049044 - Rate Distortion Theory, Lossy Compression, and Quantization 049054 - Statistical Physics and Information Theory Publications ( copyright note) My articles are in the following problem areas (some articles appear under more than one category): Lossless Source Coding Lossy Source Coding and Rate-Distortion Theory Information-Theoretic Aspects of Digital Watermarking Prediction and Sequential Decision Making Universal Hypothesis Testing and Universal Decoding Shannon Theory: Joint Source-Channel Coding, Data Processing Bounds, Guesswork, Secrecy, Mismatched Decoding, and Others Information-Theoretic Aspects of Universal Simulation of Random Processes Signal Processing, Detection/Estimation Theory, and Parameter Modulation-Estimation Lempel-Ziv Complexity and the Individual-Sequence Approach to Information Theory Exponential Error Bounds and Reliability Functions of Source Coding and Channel Coding Information Theory and Statistical Physics Information-Theoretic Aspects of Biometric Security Data Processing in the Compressed Domain Tutorials and Others Selected talks Graduate students Google Scholar profile My book. See also here. Patents Some of my recent drawings My main accomplishment is the following (joint work with Ilana Merhav): Reut, Hilla, and Roy Merhav - triplets, 32 years young.",
  "content_length": 4206,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:41"
}