{
  "name": "Nesli Erdogmus",
  "homepage": "http://ceng.iyte.edu.tr/people/nesli-erdogmus",
  "status": "success",
  "content": "Nesli Erdoğmuş (on leave) - Computer Engineering Department Computer Engineering Department Izmir Institute of Technology Search Computer Engineering Department Izmir Institute of Technology Home About People Research Research Focus Projects Publications Collaborations Education Undergraduate Program MS Programs CENG MS Program SEDS MS Program PhD Program Minor Program Contact lidya multisite > Computer Engineering Department > Nesli Erdoğmuş (on leave) Nesli Erdoğmuş (on leave) Nesli Erdoğmuş (on leave) Assistant Professor Assistant Professor Nesli Erdoğmuş received her B.S. and M.S degrees from the Electrical and Electronics Department of Middle East Technical University. After completing her Ph.D. studies at EURECOM Sophia-Antipolis, France and graduating from Télécom ParisTech, she did a two-year post-doc at Idiap in Switzerland. In 2014, she was awarded scholarship via a TUBITAK BIDEB project and she joined IZTECH Computer Engineering Department in 2014 as a researcher. Later in 2016, she started as an assistant professor in the same department. In the CSIGB research group that she founded in parallel to her field of interest, research is mainly conducted on face and fingerprint recognition. B.Sc. : Electrical and Electronics Engineering, Middle East Technical University (2005) M.Sc. : Electrical and Electronics Engineering, Middle East Technical University (2008) Ph.D. : Multimedia Communications, Eurecom – Telecom ParisTech, France (2012) CoursesPublicationsProjectsCourses CENG 461 - Artificial Intelligence CENG 388 - Web Programming CENG 501 - Introduction to Statistical Data Processing CENG 507 - Introduction to Biometric Recognition CENG 533 - Probabilistic Reasoning CENG 222 - Probability and Statistics Publications 2022 Serhat Caner; Nesli Erdoğmuş; Yusuf Murat ErtenPerformance analysis and feature selection for network-based intrusion detectionwith deep learning Journal Article Turkish Journal of Electrical Engineering and Computer Sciences, 30 (3), pp. 629–643, 2022.BibTeX@article{caner2022performance, title = {Performance analysis and feature selection for network-based intrusion detectionwith deep learning}, author = { Serhat Caner and Nesli Erdo\\u{g}mu\\c{s} and Yusuf Murat Erten}, year = {2022}, date = {2022-01-01}, journal = {Turkish Journal of Electrical Engineering and Computer Sciences}, volume = {30}, number = {3}, pages = {629--643}, keywords = {}, pubstate = {published}, tppubtype = {article} } Close Projects Generation of Synthetic Latent Fingerprints, TÜBİTAK UİDB 2515 Scene Text Recognition and Its Applications in Turkish, TÜBİTAK BİDEB 2236 B.Sc. : Electrical and Electronics Engineering, Middle East Technical University (2005) M.Sc. : Electrical and Electronics Engineering, Middle East Technical University (2008) Ph.D. : Multimedia Communications, Eurecom - Telecom ParisTech, France (2012) Courses Publications Projects CENG 222 - Probability and Statistics CENG 388 - Web Programming CENG 461 - Artificial Intelligence CENG 501 - Introduction to Statistical Data Processing CENG 507 - Introduction to Biometric Recognition CENG 533 - Probabilistic Reasoning Conference Paper Erdoğmuş, N., “Türkçe Manzara Metni Veri Kümesi – Scene Text Dataset in Turkish,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2017. Chingovska, I., Erdoğmuş, N., Anjos, A., Marcel, S., “Face Recognition Systems under Spoofing Attacks,” Face Recognition Across the Imaging Spectrum, Springer, 2016. Erdoğmuş, N., Özuysal, M., “Anahtar Noktalar Kullanarak Manzara Metni Tespiti – Scene Text Localization Using Keypoints,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2015. Erdoğmuş, N., Marcel, S., “Introduction to Biometric Anti-spoofing,” Handbook of Biometric Anti-Spoofing, Springer, 2014. Erdoğmuş, N., Marcel, S., \"Spoofing Face Recognition With 3D Masks,\" IEEE Transactions on Information Forensics and Security, vol.9, no.7, pp.1084,1097, July 2014. Erdoğmuş, N., Dugelay, J.-L., \"3D Assisted Face Recognition: Dealing With Expression Variations,\" IEEE Transactions on Information Forensics and Security, vol.9, no.5, pp.826,838, May 2014. Erdoğmuş, N., Vanoni, M., Marcel, S., “Within- and Cross- Database Evaluations for Gender Classification via BeFIT Protocols,” International Workshop on Multimedia Signal Processing, MMSP 2014. Erdoğmuş, N., Marcel, S., “Spoofing in 2D Face Recognition with 3D Masks and Anti-spoofing with Kinect,” Biometrics: Theory, Applications and Systems, BTAS 2013. Erdoğmuş, N., Marcel, S., “Spoofing Attacks To 2D Face Recognition Systems With 3D Masks,” International Conference of the Biometrics Special Interest Group, BIOSIG 2013. Velardo, C., Dugelay, J.-L., Daniel, L., Dantcheva, A., Erdoğmuş, N., Köse, N., Min, R., Zhao, X., \"Introduction to Biometry,\" Multimedia Image and Video Processing, CRC Press, 2012. Erdoğmuş, N., Dugelay, J.-L., “Impact Analysis of Nose Alterations on 2D and 3D Face Recognition,” IEEE International Workshop on Multimedia Signal Processing, MMSP 2012. Erdoğmuş, N., Dugelay, J.-L., “Probabilistic Fusion of Regional Scores in 3D Face Recognition,” IEEE International Conference on Image Processing, ICIP 2012. Erdoğmuş, N., Dugelay, J.-L., “On Discriminative Properties of TPS Warping Parameters for 3D Face Recognition,” International Conference on Informatics, Electronics & Vision, ICIEV 2012. Ben Amor, B., Drira, H., Daoudi, M., Ardabilian, M., Ben Soltana, W., Lemaire, P., Chen, L., Erdoğmuş, N., Dugelay, J.-L., Colineau, J., “3D Face Recognition: A Robust Multi-Matcher Approach to Data Degradations,” IAPR International Conference on Biometrics, ICB 2012. Erdoğmuş, N., Dugelay, J.-L., \"Regional Confidence Score Assessment for 3D Face,” IEEE International Conference on Acoustics, Speech and Signal Processing, ICASSP 2012. Köse, N., Erdoğmuş, N., Dugelay, J.-L., “Block Based Face Recognition Approach Robust to Nose Alterations,” IEEE International Conference on Biometrics: Theory, Applications and Systems, BTAS 2012. Dantcheva, A., Erdoğmuş, N., Dugelay, J.-L., \"On the Reliability of Eye Color as a Soft Biometric Trait,\" IEEE Workshop on Applications of Computer Vision, WACV 2011. Erdoğmuş, N., Dugelay, J.-L., \"Automatic Extraction of Facial Interest Points Based on 2D and 3D Data,\" Electronic Imaging Conference on 3D Image Processing (3DIP) and Applications, SPIE 2011. Erdoğmuş, N., Dugelay, J.-L., \"Seyreltik Kodlama ile Yüz İfadelerinin Sınıflandırılması - Classification of Facial Expressions by Sparse Coding,\" IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU 2011. Erdoğmuş, N., Dugelay, J.-L., \"An Efficient Iris and Eye Corners Extraction Method,\" Structural, Syntactic, and Statistical Pattern Recognition - Joint IAPR International Workshop, SSPR and SPR 2010. Erdoğmuş, N., Etheve, R., Dugelay, J.-L., \"Realistic and Animatable Face Models for Expression Simulations in 3D,\" Electronic Imaging Conference on 3D Image Processing (3DIP) and Applications, SPIE, 2010. Erdoğmuş, N., Etheve, R., Dugelay, J.-L., \"TPS Yöntemiyle MPEG-4 Uyumlu Canlandırılabilir 3B Yüz Modelleri Elde Etme - Obtaining MPEG-4 Compliant Animatable 3D Face Models by Using TPS Method,\" Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2010. Bozkurt, N., Halıcı, U., Ulusoy, I., Akagündüz, E., “Yüz Tarayıcısı Verilerinin İyileştirilmesi için 3B Veri İşlem – 3D Data Processing for Enhancement of Face Scanner Data,” Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2009. Bozkurt, N., \"2D/3D Imaging Simulator,\" M.S. Thesis, Middle East Technical University, 2008. Akagündüz, E., Ulusoy, I., Bozkurt, N., Halıcı, U., “2.5B Verinin Olcekten Bagimsiz Gosterilmesi - Scale Invariant Representation of 2.5D Data,” Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2007. Akagündüz, E., Ulusoy, I., Bozkurt, N., Halıcı, U., “A Physically-based Facial Skin Model to Simulate Facial Expressions on Digitally Scanned 3D Models,” International Symposium on Computer and Information Sciences, ISCIS, 2007. Savran, A., Çeliktutan, O., Akyol, A., Trojanová, J., Dibeklioglu, H., Esenlik, S., Bozkurt, N., Demirkır, C., Akagündüz, E., Çalışkan, K., Alyüz, N., Sankur, B., Ulusoy, I., Akarun, L., Sezgin, T. M., “3D Face Recognition Performance under Adversarial Conditions,” eNTERFACE'07 Workshop on Multi-Modal Interfaces, 2007. Generation of Synthetic Latent Fingerprints, TÜBİTAK UİDB 2515 Scene Text Recognition and Its Applications in Turkish, TÜBİTAK BİDEB 2236 IZTECH Computer Engineering Dept., Gulbahce, 35430 Urla, İzmir, Turkey 138 neslierdogmus@iyte.edu.tr +90 232 750 7887 csigb.iyte.edu.tr",
  "content_length": 8584,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:51"
}