{
  "name": "Netta Cohen",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/301/professor-netta-cohen",
  "status": "success",
  "content": "Professor Netta Cohen | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor Netta Cohen Position: Professor Email: N.Cohen@leeds.ac.uk Phone: +44(0)113 343 6789 Location: 8.03a E C Stoner Building Website: My Personal Site | C. elegans group page | Googlescholar | ORCID Responsibilities Lead, Computing in Biology, Medicine and Health theme School Equality and Inclusion champion Executive team member, Robotics@Leeds Research interests Complex systems, computational neuroscience, neural control of behaviour, biological physics and biomechanics, biorobotics and bio-inspired control (with applications to infrastructure robotics), C. elegans neurobiology, neural circuits and behaviour. Recent Grants: - WHole Animal Modelling (WHAM): Toward the integrated understanding of sensory motor control in C. elegans, Funding: EPSRC, Role: EPSRC Leadership Fellowship (PI) - National Facility for Innovative Robotic Systems, Funding: EPSRC, Role: Co-I - Microswimmers: Analysing the motion of biological swimmers (with David Hogg and Thomas Ranner; Funding: EP/S01540X/1): http://leeds.wormlab.eu/ Current funded projects: - Pipebots: Pervasive Sensing for Buried Pipes (Co-I Programme Grant; Funding:  EP/S016813/1): http://pipebots.ac.uk/ - Self Repairing Cities: Balancing the impact of city infrastructure engineering on natural systems using robots: (Co-I Grand Challenge project; Funding: EP/N010523/1): https://selfrepairingcities.com/ - New AD model (co-I, with Patricija van-Oosten Hawle; Funding: NC3R): http://www.vanoostenhawlelab.com/ - Towards the formulation of a general theory of root gravitropism Towards the formulation of a general theory of root gravitropism (co-I with Stefan Kepinski, Funding: Leverhulme Trust) <h4>Research projects</h4> <p>Some research projects I'm currently working on, or have worked on, will be listed below. Our list of all <a href=\"https://eps.leeds.ac.uk/dir/research-projects\">research projects</a> allows you to view and search the full list of projects in the faculty.</p> Balancing the impact of City Infrastructure Engineering on Natural systems using Robots Research groups and institutes Computing in Biology, Medicine and Health Artificial Intelligence Computational Science and Engineering Robotics Current postgraduate researchers Luis Alfredo <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Projects <li><a href=\"//phd.leeds.ac.uk/project/717-3d-microscopy-of-swimming-worms\">3D microscopy of swimming worms</a></li> <li><a href=\"//phd.leeds.ac.uk/project/718-modelling-dynamics-of-swimming-in-3d\">Modelling dynamics of swimming in 3D</a></li> <li><a href=\"//phd.leeds.ac.uk/project/716-modelling-the-neural-control-of-locomotion\">Modelling the neural control of locomotion</a></li> <li><a href=\"//phd.leeds.ac.uk/project/1861-the-neuromechanical-basis-of-locomotion-in-3d\">The neuromechanical basis of locomotion in 3D</a></li> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 3819,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:41"
}