{
  "name": "Ney Calazans",
  "homepage": "http://www.inf.pucrs.br/~calazans",
  "status": "success",
  "content": "Ney Laert Vilar Calazans Homepage Português Ney Laert Vilar Calazans Homepage Professor at PUCRS - School of Technology Member of: IEEE (Senior) - SBC - SBMicro CNPq Research Productivity Scholarship - Level 1C PUCRS - School of Technology 6681, Ipiranga Av. - Building 32 - Suite 718 Porto Alegre - Brasil - ZIP: 90619-900 Work phone: +55 51 3353 8718 E-mail: ney dot calazans at pucrs dot br Comp Eng Introd Proc Org/Arq Dig Syst Constr Teaching Undergrad - Comp. Org. Lab. (Old) Graduate - Comp. Theory (Old) See my Publications Classified by Year Classified by Subject Classified by Type View my Citations Google Scholar DBLP Acad. ACM Scopus ResearcherID Orcid About my Research GAPH Asynchronous HeMPS MPSoC HERMES NoC/Atlas Comp. Eng. Curriculum Curricular Diagram 98AK Curricular Diagram 4450 Course Plans Curriculum 98AK Pedagogical Project Excerpt General Data PUCRS PUCRS Site School of Technology Comp. Eng. PPGCC PUCRS Library 2022 Acad. Cal. Administrative MOODLE SARC Undergrad Grades Graduate Grades SIPESQ 3213 Printer People César Marcon Edson Moreno Fabiano Hessel Fernando Moraes Ney Calazans General GAPH list h-index PPGCC NEWS Mai/2019: Article published in ASYNC´19 conference in Japan. Chosen as one of 3 Best Paper Finalists. Dec/2017: Article published in the IEEE Transactions on Circuits and Systems I journal. Apr/2013: Ney Calazans elevated to the Senior Member category at IEEE. Work with us! Take an MSc or PhD course at the PPGCC. International Excellence in Computer Science. CAPES grade 6 of 7. PPGCC-PUCRS My Research Interests Microelectronics Asynchronous Circuits Standard Cells and Libraries Networks on Chip (NoCs) Design and Verification of VLSI Systems (ASICs) Rapid prototyping of Digital Systems using FPGAs Design Tools for VLSI Systems (EDA or E-CAD) Applications in Telecommunications My Academic Background Post-Doctoral Senior Stage (USC - 2014/2015) PhD in Applied Sciences (UCL - 1993) MSc in Computer Science (PPGC-UFRGS - 1988) BS in Electrical Engineering (EE-UFRGS - 1985) Professional Information My Weekly Job Schedule My Teaching Activities The Hermes NOC and the ATLAS Environment Asynchronous Circuits Stuff The HeMPS MPSoC Awards PhD Competition Award - ICECS 2012 Best Full Paper Finalist - ASYNC 2019 My Research Keywords The PhD-Reconf Hw Era (1993-2000) The Reconf Hw-NoCs Era (2000-2007) The NoCs-Async Era (2007-2018) Overall (1993-2018) Last Updated: October, 7th 2019",
  "content_length": 2438,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:44"
}