{
  "name": "Nezam Rohbani",
  "homepage": "http://cs.ipm.ac.ir/~rohbani",
  "status": "success",
  "content": "Nezam Rohbani Nezam Rohbani Assistant Professor Institute for Research in Fundamental Sciences Email: rohbani AT ipm DOT ir Nezam Rohbani is an Assistant Professor and the Head of the System Group at the Institute for Research in Fundamental Sciences (IPM). He received his Ph.D. from Sharif University of Technology in 2018 and has been working at the Institute for Research in Fundamental Sciences since then. You can find my CV HERE. Students (in alphabetical order) (with Prof. Hamid Sarbazi-Azad): Kian Bahadori Roozbeh Piryadi Fatemeh Serajeh Sorush Sherafat Mohammad Arman Soleimani Research Interests: Computer Architecture: design and optimization of computer systems, including processors, memory, and interconnects. Hyperdimentional Computing: brain-inspired computing using high-dimensional vectors for efficient and robust computation, generally inside the memory. SRAM and DRAM Memory Design: design and optimization of static random-access memory (SRAM) and dynamic random-access memory (DRAM) for high-performance and low-power applications. Processing-in-Memory: integration of memory and processing capabilities to improve the performance and energy efficiency of computer systems. Neural Networks Accelerators: design and optimization of hardware accelerators for neural network computations. Fault Management in Neural Networks: techniques for detecting and mitigating faults in neural network computations. Non-Volatile Memories: design and optimization of non-volatile memory technologies, such as flash and phase-change memory, for high-performance and low-power applications. Aging-Aware Processor Architecture Design: design and optimization of computer systems that are aware of aging effects and can adapt to them. Thermal and Power Management: design and optimization of thermal and power management techniques for computer systems. Aging and Process Variation Sensors: design and optimization of sensors for monitoring aging and process variation in computer systems. Publications Journal Papers Ansari, Mohsen, Sepideh Safari, Nezam Rohbani, Alireza Ejlali, and Bashir M. Al-Hashimi, \"Power-Efficient and Aging-Aware Primary/Backup Technique for Heterogeneous Embedded Systems,\" Transactions on Sustainable Computing (TSUSC), 2023. Shirmohammadi, Zahra, Mojtaba Farmani, Mina Mohseni, and Nezam Rohbani, \"A Cluster-Based Energy-Aware Routing Algorithm for Wireless Sensor Networks,\" Ad Hoc & Sensor Wireless Networks (AHSWN), pp. 303-315, 2022. Darbani, Paria, Nezam Rohbani, Hakem Beitollahi, and Pejman Lotfi-Kamran, \"RASHT: A Partially Reconfigurable Architecture for Efficient Implementation of CNNs,\" Transactions on Very Large Scale Integration (TVLSI) Systems, IEEE, 2022. Navardi, Mozhgan, Behnaz Ranjbar, Nezam Rohbani, Alireza Ejlali, and Akash Kumar, \"Peak-Power Aware Life-Time Reliability Improvement in Fault-Tolerant Mixed-Criticality Systems,\" Open Journal of Circuits and Systems, pp. 199-215, IEEE, 2022. Safari, Maede, Zahra Shirmohammadi, Nezam Rohbani, and Hamed Farbeh, \"LETHOR: a thermal-aware proactive routing algorithm for 3D NoCs with less entrance to hot regions,\" The Journal of Supercomputing, Elsevier, 2022. Bahrami, Fahimeh, Behnaz Ranjbar, Nezam Rohbani, and Alireza Ejlali, \"PVMC: Reliability-Aware Task Allocation and Energy Management under Process Variation Heterogeneity in Mixed-Criticality Systems,\" Transactions on Emerging Topics in Computing (TETC), IEEE, 2021. Saadatmand, Faezeh Sadat, Nezam Rohbani, Farshad Baharvand, and Hamed Farbeh, \"TAMER: an adaptive task allocation method for aging reduction in multi-core embedded real-time systems,\" The Journal of Supercomputing, vol. 77, pp. 1939-1957, Springer, 2021. Sharifi, Ferdous, Nezam Rohbani, and Shaahin Hessabi, \"Aging-Aware Context Switching in Multicore Processors Based on Workload Classification,\" Computer Architecture Letters (CAL), vol. 19, no. 2, pp. 159-162. IEEE, 2020. Rohbani, Nezam, Hiroaki Gau, Sara Mohammadinejad, Tapas Kumar Maiti, Dondee Navarro, Mitiko Miura-Mattausch, Hans Jürgen Mattausch, and Hirotaka Takatsuka, \"Power Reduction and BTI Mitigation of Data-Cache Memory Based on the Storage Management of Narrow-Width Values\" Transactions on Very Large Scale Integration Systems (TVLSI), vol. 27, no. 7, pp. 1675-1684. IEEE, 2019. Rohbani, Nezam and Seyed Ghassem Miremadi, \"A Low-Overhead Integrated Aging and SEU Sensor,\" Transactions on Device and Materials Reliability (TDMR), vol. 18, no. 2, pp. 205-213. IEEE, 2018. Miura-Mattausch, Mitiko, Hidenori Miyamoto, Hideyuki Kikuchihara, Tapas K. Maiti, Nezam Rohbani, Dondee Navarro, and Hans J. Mattausch, \"Compact modeling of dynamic trap density evolution for predicting circuit-performance aging,\" Microelectronics Reliability (MR), vol. 80, pp. 164-175. Elsevier, 2018. Rohbani, Nezam, Mojtaba Ebrahimi, Seyed Ghassem Miremadi, and Mehdi B. Tahoori, \"Bias Temperature Instability Mitigation via Adaptive Cache Size Management,\" Transactions on Very Large Scale Integration Systems (TVLSI), vol. 25, no. 3, pp. 1012-1022. IEEE, 2017. Rohbani,Nezam, Zahra Shirmohammadi, Maryam Zare, and Seyed Ghassem Miremadi, \"LAXY: A Location-Based Aging-Resilient Xy-Yx Routing Algorithm for Network on Chip,\" Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 36, no. 10, pp. 1725-1738. IEEE, 2017. Karimi, Maryam, Nezam Rohbani, and Seyed Ghassem Miremadi, \"A Low Area Overhead NBTI/PBTI Sensor for SRAM Memories,\" Transactions on Very Large Scale Integration Systems (TVLSI), vol. 25, no. 11, pp. 3138-3151. IEEE, 2017. Conference Papers Rohbani, Nezam, Mohammad Arman Soleimani, Hamid Sarbazi-Azad, \"CoolDRAM: An Energy-Efficient and Robust DRAM\", In Proceedings of the International Symposium on Low Power Electronics and Design (ISLPED), Vienna-Austria, ACM/IEEE, 2023. Rohbani, Nezam, Mohammad Arman Soleimani, Hamid Sarbazi-Azad, \"PIPF-DRAM: Processing in Precharge-Free DRAM\", In Proceedings of the Design Automation Conference (DAC), San Francisco-USA, ACM/IEEE, 2022. Rohbani, Nezam, Sina Darabi, Hamid Sarbazi-Azad, \"PF-DRAM: A Precharge-Free DRAM Architecture,\" In Proceedings of the International Symposium on Computer Architecture (ISCA), pp. 126-138, Valencia-Spain, ACM/IEEE, 2021. Rohbani, Nezam, Masoumeh Ebrahimi, \"SRAM Gauge: SRAM Health Monitoring via Cells Race,\" In Proceedings of the International Symposium on Low Power Electronics and Design (ISLPED), Boston-USA, ACM/IEEE, 2021. Elaheh Malekzadeh, Rohbani, Nezam, Zhonghai Lu, Masoumeh Ebrahimi, \"The Impact of Faults on DNNs: A Case Study,\" In Proceedings of the International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology System (DFT), Athens-Greece, IEEE, 2021. Yari-Karin, Sina, Ali Sahraee, Javad Saber-Latibari, Mohsen Ansari, Nezam Rohbani, and Alireza Ejlali, \"A comparative study of joint power and reliability management techniques in multicore embedded systems,\" In Proceedings of the International Symposium on Real-Time and Embedded Systems and Technologies (RTEST), pp. 1-8. Tehran-Iran, IEEE, 2020. Rohbani, Nezam, Tapas Kumar Maiti, Dondee Navarro, Mitiko Miura-Mattausch, Hans Jürgen Mattausch, Hirotaka Takatsuka, \"NVDL-Cache: Narrow-Width Value Aware Variable Delay Low-Power Data Cache\" In Proceedings of the International Conference on Computer Design (ICCD), pp. 264-272. Abu Dhabi-UAE, IEEE, 2019. Gau, Hiroaki, Nezam Rohbani, Tapas K. Maiti, Dondee Navarro, Mitiko Miura-Mattausch, Hans Jürgen Mattausch, and Hirotaka Takatsuka, \"Consistent Predictive Simulation of SRAM-Cell Performance Degradation Including Both MOSFET Fabrication Variation and Aging,\" In Proceedings of the 2nd Electron Devices Technology and Manufacturing Conference (EDTM), pp. 31-33. Kobe-Japan, IEEE, 2018. Farbeh, Hamed, Nezam Rohbani, \"PCM-Oriented Cache Management Strategies for Solid-State Disks,\" In Proceedings of of the CSI Symposium on Real-Time and Embedded Systems and Technologies (RTEST), pp. 16-23. Tehran-Iran, IEEE, 2018. Mafari, Maede, Zahra Shirmohammadi, Nezam Rohbani, Hamed Farbeh, \"WiP: Floating XY-YX: An Efficient Thermal Management Routing Algorithm for 3D NoCs,\" In Proceedings of the 16th Intl Conf on Dependable, Autonomic and Secure Computing (DASC), pp. 736-741. Athens-Greece, IEEE, 2018. Rohbani, Nezam, Hidenori Miyamoto, Hideyuki Kikuchihara, Dondee Navarro, Tapas K. Maiti, Chenyue Ma, Mitiko Miura-Mattausch, Seyed Ghassem Miremadi, and Hans J. Mattausch, \"Circuit-Aging Modeling Based on Dynamic MOSFET Degradation and Its Verification,\" In Proceedings of the International Conference on Simulation of Semiconductor Processes and Devices (SISPAD), pp. 97-100. Kamakura-Japan, IEEE, 2017. Miura-Mattausch, Mitiko, Hidenori Miyamoto, Hideyuki Kikuchihara, Dondee Navarro, Tapas K. Maiti, Nezam Rohbani, Chenyue Ma, Hans J. Mattausch, \"Modeling of Dynamic Trap Density Increase for Aging Simulation of any MOSFET Circuits,\" In Proceedings of the European Solid-State Device Research Conference (ESSDERC), pp. 192-195. Leuven-Belgium, IEEE, 2017. Shirmohammadi, Zahra, Nezam Rohbani, and Seyed Ghassem Miremadi, \"3D-DPS: An Efficient 3D-CAC for Reliable Data Transfer in 3D ICs,\" In Proceedings of the European Dependable Computing Conference (EDCC), pp. 97-107. Gothenburg-Sweden, IEEE, 2016. Nazari, Reza, Nezam Rohbani, Hamed Farbeh, Zahra Shirmohammadi, and Seyed Ghassem Miremadi, \"A2CM2: Aging-Aware Cache Memory Management Technique,\" In Proceedings of the CSI Symposium on Real-Time and Embedded Systems and Technologies (RTEST), pp. 1-8. Tehran-Iran, IEEE, 2015. Hezaveh, Maryam, Zahra Shirmohammdi, Nezam Rohbani, and Seyed Ghassem Miremadi, \"A fault-tolerant and energy-aware mechanism for cluster-based routing algorithm of WSNs,\" In Proceedings of the International Symposium on Integrated Network Management (IM), pp. 659-664. Ottawa-Canada, IEEE, 2015. Patent Rohbani, Nezam, Sina Darabi, Hamid Sarbazi-Azad, \"Semiconductive Memory Device\", PCT-international patent system, US Patent App. 17/846,102, 2022. Work Experi",
  "content_length": 11765,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:48"
}