{
  "name": "Nezer Zaidenberg",
  "homepage": "https://cris.ariel.ac.il/iw/persons/nezer-jacob-zaidenberg",
  "status": "success",
  "content": "Nezer Jacob Zaidenberg - אוניברסיטת אריאל בשומרון הצגת פרופיל Scopus נצר יעקב זיידנברג ד\"ר מרצה בכיר, הנדסת מחשבים ותכנהשיוך קודםמרצה בכיר, מדעי המחשב https://orcid.org/0000-0003-3496-7925 20112024 פעילות מחקר לפי שנה טביעת אצבע תחומי מחקר אלו נובעים מהפרסומים המדעיים של אדם זה. יחד הם יוצרים טביעת אצבע ייחודית. Hypervisor Computer Science 100% Operating System Keyphrases 24% Malware Computer Science 24% Virtualizations Computer Science 23% Virtualization Keyphrases 17% Reverse Engineering Keyphrases 17% Virtual Machine Computer Science 17% Linux Keyphrases 15% לטביעת האצבע המלאה שיתופי פעולה ותחומי מחקר עיקריים בחמש השנים האחרונות שיתוף פעולה עם חוקרים ממדינות/אזורים חיצוניים מהתקופה האחרונה. לפרטים, יש ללחוץ על הנקודות או בחר מדינה/אזור מתוך הרשימה היכנס לפרטים לבחור מדינה/אזור לצפייה בפרסומים ובפרויקטים משותפים סגירה נא לבחור מדינה/אזור מתוך הרשימה לפרטים נוספים על הרשת פרסומים מחקריים פרסומים מחקריים בשנה 2011 2013 2019 2021 2022 2024 32 פרסום בספר כנס 20 מאמר 1 פרק פרסומים מחקריים בשנה פרסומים מחקריים בשנה Detecting eBPF Rootkits Using Virtualization and Memory ForensicsZaidenberg, N. J., Kiperberg, M., Menachi, E. & Eitani, A., 2024, Proceedings of the 10th International Conference on Information Systems Security and Privacy. Lenzini, G., Mori, P. & Furnell, S. (עורכים). Science and Technology Publications, Lda, עמוד 254-261 8 עמוד (International Conference on Information Systems Security and Privacy; כרך 1).פרסום מחקרי: פרק בספר / בדוח / בכנס › פרסום בספר כנס › ביקורת עמיתים גישה חופשית Memory Forensics 100% Rootkit 100% Virtualization 100% Malware 100% Virtualizations 100% 2 ציטוטים ‏(Scopus) HyperWallet: cryptocurrency wallet as a secure hypervisor-based applicationZaidenberg, N. J. & Kiperberg, M., דצמ׳ 2024, ב-: Eurasip Journal on Information Security. 2024, 1, 25.פרסום מחקרי: פרסום בכתב עת › מאמר › ביקורת עמיתים גישה חופשית Hypervisor 100% Cryptocurrency Wallet 100% Cryptocurrency 100% Attack Surface 33% Dedicated Hardware 33% 1 ציטוט ‏(Scopus) PDIFT++: System-Wide Memory Tracking Using a Single-Process Memory TrackerKiperberg, M. & Zaidenberg, N., פבר׳ 2024, ב-: SN Computer Science. 5, 2, 226.פרסום מחקרי: פרסום בכתב עת › מאמר › ביקורת עמיתים System-wide 100% Tracker 100% Single Process 100% Process Memory 100% Memory Tracking 100% 1 ציטוט ‏(Scopus) Virtualized network packet inspectionShlingbaum, E., Yehuda, R. B., Kiperberg, M. & Zaidenberg, N. J., ספט׳ 2024, ב-: Computer Networks. 251, 110619.פרסום מחקרי: פרסום בכתב עת › מאמר › ביקורת עמיתים Virtual Network 100% Network Packet 100% Packet Inspection 100% Inspection Packet 100% Virtualized 75% HERO vs Zombie: Destroying Zombie Guests in Virtual Machine EnvironmentsZaidenberg, N. J., Kiperberg, M., Elinav, Y., Moshinky, A. & Siag, L., 2023, Model-Driven Engineering and Software Development - 9th International Conference, MODELSWARD 2021, and 10th International Conference, MODELSWARD 2022, Revised Selected Papers. Pires, L. F., Hammoudi, S. & Seidewitz, E. (עורכים). Springer Science and Business Media Deutschland GmbH, עמוד 48-59 12 עמוד (Communications in Computer and Information Science; כרך 1708 CCIS).פרסום מחקרי: פרק בספר / בדוח / בכנס › פרסום בספר כנס › ביקורת עמיתים Host Environment 100% Zombies 100% Environment Resources 100% Resource Optimization 100% Machine Environment 100% הצגת כל 53 פרסומים מחקריים",
  "content_length": 3332,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:51"
}