{
  "name": "Ngai-Man Cheung",
  "homepage": "https://sites.google.com/site/mancheung0407",
  "status": "success",
  "content": "Ngai-Man (Man) CheungSearch this siteEmbedded FilesSkip to main contentSkip to navigationNgai-Man (Man) CheungAssociate ProfessorSingapore University of Technology and Design (SUTD)Contact informationE-mail: ngaiman_cheung(at)sutd.edu.sgTel: +65 6499 4542Office:Building 2, level 4, 2.401-26 8 Somapah Road, Singapore 487372 Research Interest: Image and Signal Processing/Analysis, Computer Vision, Machine Learning, AIPublicationsGoogle ScholarNews[09/2023: NeurIPS-2023] Ngoc-Bao Nguyen (*), Keshigeyan Chandrasegaran (*), Milad Abdollahzadeh, Ngai-Man Cheung. Label-Only Model Inversion Attacks via Knowledge Transfer. In Proc. NeurIPS-2023. (*) Equal contribution.[09/2023: NeurIPS-2023] Christopher T.H Teo, Milad Abdollahzadeh, Ngai-Man Cheung. On Measuring Fairness in Generative Models. In Proc. NeurIPS-2023.[09/2023: NeurIPS-2023] Yunqing Zhao, Tianyu Pang, Chao Du, Xiao Yang, Chongxuan Li, Ngai-Man Cheung, Min Lin. On Evaluating Adversarial Robustness of Large Vision-Language Models. In Proc. NeurIPS-2023.[03/2023: TIP] Yunqing Zhao, Ngai-Man Cheung. FS-BAN: Born-again networks for domain generalization few-shot classification. IEEE Transactions on Image Processing 2023.[03/2023: CVPR-2023] Yunqing Zhao, Chao Du, Milad Abdollahzadeh, Tianyu Pang, Min Lin, Shuicheng YAN, Ngai-Man Cheung. \"Exploring Incompatible Knowledge Transfer in Few-shot Image Generation.\" In Proc. CVPR-2023.[03/2023: CVPR-2023] Ngoc-Bao Nguyen (*), Keshigeyan Chandrasegaran (*), Milad Abdollahzadeh, Ngai-Man Cheung. \"Re-thinking Model Inversion Attacks Against Deep Neural Networks.\" In Proc. CVPR-2023. (*) Equal contribution.[02/2023: AAAI-2023] Christopher TH Teo (*), M Abdollahzadeh (*), Ngai-Man Cheung. \"Fair Generative Models via Transfer Learning.\" In Proc. AAAI-2023. (*) Equal contribution.[01/2023] Appointed as AI Advisor - Smart Nation and Digital Government Office (SNDGO), Prime Minister's Office[01/2023] Outstanding Associate Editor Award - IEEE Transactions on Multimedia[09/2022: NeurIPS-2022] Yunqing Zhao (*), Keshigeyan Chandrasegaran (*), Milad Abdollahzadeh (*), Ngai-Man Cheung, \"Few-shot Image Generation via Adaptation-aware Kernel Modulation,\" in Proc. NeurIPS 2022. (*) Equal contribution.[09/2022: ECCV-2022 (Oral)] K Chandrasegaran, NT Tran, A Binder, NM Cheung, \"Discovering Transferable Forensic Features for CNN-generated Images Detection,\" in Proc. ECCV 2022 (Oral) [PDF][06/2022: ICML-2022] K Chandrasegaran, NT Tran (*), Y Zhao (*), NM Cheung, \"Revisiting Label Smoothing and Knowledge Distillation Compatibility: What was Missing?\" in Proc. ICML-2022 [PDF]. (*) Equal contribution.[06/2022: CVPR-2022] Y Zhao, H Ding, H Huang, NM Cheung, \"A Closer Look at Few-shot Image Generation,\" in Proc. CVPR-2022 [PDF][02/2022: AAAI-2022 (Oral)] Thilini Cooray, Ngai-Man Cheung, \"Graph-wise Common Latent Factor Extraction for Unsupervised Graph Representation Learning,\" in Proc. AAAI-2022 (Oral) [PDF][10/2021: NeurIPS-2021] Milad Abdollahzadeh, Touba Malekzadeh, Ngai-Man Cheung, \"Revisit Multimodal Meta-Learning through the Lens of Multi-Task Learning,\" in Proc. NeurIPS-2021 [PDF][06/2021: TPAMI paper] Wen-Yan Lin, Siying Liu, Changhao Ren, Ngai-Man Cheung, Hongdong Li, Yasuyuki Matsushita, \"Shell Theory: A Statistical Model of Reality\" IEEE Transactions on Pattern Analysis and Machine Intelligence 2021.[06/2021] Outstanding Reviewer Award. IEEE Transactions on Multimedia.[04/2021: CVPR-2021 (Oral)] Keshigeyan Chandrasegaran, Ngoc-Trung Tran, Ngai-Man Cheung, \"A Closer Look at Fourier Spectrum Discrepancies for CNN-generated Images Detection,\" in Proc. CVPR-2021 (Oral) [PDF] [Project and code][04/2021: Signal Processing] R Liu, NM Cheung, \"Joint estimation of low-rank components and connectivity graph in high-dimensional graph signals: application to brain imaging\" Signal Processing 2021[01/2021: TIP paper] NT Tran, VH Tran, NB Nguyen, TK Nguyen, NM Cheung, \"On data augmentation for GAN training\" IEEE Transactions on Image Processing 30, 1882-1897[01/2021: WACV-2021 (Oral)] KS Lee, NT Tran, NM Cheung, \"InfoMax-GAN: Improved Adversarial Image Generation via Information Maximization and Contrastive Learning\" IEEE Winter Conference on Applications of Computer Vision 2021[12/2020: IJCAI-2020] T Hoang, TT Do, TV Nguyen, NM Cheung, \"Direct Quantization for Training Highly Accurate Low Bit-width Deep Neural Networks\" IJCAI-2020. International Joint Conference on Artificial Intelligence[12/2020: TIP paper] T Hoang, TT Do, TV Nguyen, NM Cheung, \"Unsupervised Deep Cross-modality Spectral Hashing\" IEEE Transactions on Image Processing 29, 8391-8406[06/2020: CVPR-2020] Y Guo, NM Cheung, \"Attentive Weights Generation for Few Shot Learning via Information Maximization\" CVPR-2020[06/2020: CVPR-2020] T Cooray, NM Cheung(*), W Lu, \"Attention-Based Context Aware Reasoning for Situation Recognition\" CVPR-2020.  (*) Corresponding author[12/2019: ICCV-2019] L Yang, NM Cheung(*), J Li, J Fang, \"Deep Clustering by Gaussian Mixture Variational Autoencoders With Graph Embedding\" ICCV 2019. (*) Corresponding author[12/2019: TMM Paper] TT Do, T Hoang, DK Le Tan, AD Doan, NM Cheung, \"Compact hash code learning with binary deep neural network\" IEEE Transactions on Multimedia 22 (4), 992-1004[12/2019: NeurIPS-2019]  Trung Tran, Hung Tran, Ngoc Nguyen, Linxiao Yang, Ngai-Man Cheung, \"Self-supervised GAN: Analysis and Improvement with Multi-class Minimax Game,\" in Proc. NeurIPS-19 (NIPS-19) (Total 6743 submissions. 21.1% acceptance rate) [PDF][08/2019] SAIL Award Finalist at the World AI Conference, Shanghai, China (WAIC-2019) (Total ~700 nominations)[06/2019: CVPR-2019 Best Paper Finalist] H Le, TT Do, T Hoang, NM Cheung, \"SDRSAC: Semidefinite-Based Randomized Approach for Robust Point Cloud Registration without Correspondences,\" in Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR-19) (Oral) (Total 5160 submissions) [PDF]Biography:Ngai-Man (Man) Cheung is an Associate Pillar Head and Associate Professor with Singapore University of Technology and Design (SUTD). He receives his Ph.D. degree in Electrical Engineering from University of Southern California (USC), Los Angeles, CA. His Ph.D. research focused on image and video coding, and the work was supported in part by NASA-JPL. He was a postdoctoral researcher with the Image, Video and Multimedia Systems group at Stanford University, Stanford, CA. He was a core team member of the Foundational Research Capabilities Team for AI - National Research Foundation (NRF) Singapore, and an AI Advisor for Smart Nation and Digital Government Office (SNDGO) in Singapore. His research has resulted in more than 100 papers and 14 U.S. patents granted with several pending. Two of his inventions have been licensed to companies. One of his research results has led to a SUTD spinoff on AI for healthcare. His research has also been featured in the National Artificial Intelligence Strategy. As a long-time member of the IEEE Signal Processing Society, he has been deeply engaged in the signal processing community. He currently serves as Senior Area Editor for both the IEEE Transactions on Image Processing and the IEEE Signal Processing Letters, and as Associate Editor for the IEEE Transactions on Multimedia and APSIPA Transactions on Signal and Information Processing. He is the Lead General Chair of IEEE VCIP 2026 and has held key roles in other major signal processing and AI conferences. Additionally, he is a Founding Committee Member of the APSIPA Singapore Chapter. Since 2015, he has served in multiple executive roles in the IEEE Signal Processing Society - Singapore Chapter, including Chapter Chair.He has received several research recognitions, including the Best Paper Finalist at the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2019, the Finalist of Super AI Leader (SAIL) Award at the World AI Conference (WAIC) 2019 at Shanghai, China. His research interests are Signal and Image Processing, Computer Vision and AI.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 8054,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:48"
}