{
  "name": "Nguyen Phong Hoang",
  "homepage": "https://homepage.np-tokumei.net",
  "status": "success",
  "content": "Nguyen Phong Hoang Search Nguyen Phong Hoang Assistant Professor University of British Columbia Thank you for visiting my homepage! I am an Assistant Professor of Computer Science at The University of British Columbia. I am part of Systopia Lab and Security and Privacy Group where we work on Systems and Security research broadly. My research interests are in the general areas of network security, online privacy, and Internet measurement. Specifically, by designing new systems and techniques to collect large-scale and longitudinal datasets, my research aims to improve the security of networked systems and reinforce the privacy of our online communications. Recently, this research goal has led me to focus on designing novel methods to (1) monitor Internet Freedom at scale by building systems for global and longitudinal measurements, and (2) evaluate and improve the effectiveness of domain name encryption protocols which have been proposed to enhance user privacy, e.g., DNS over HTTPS, and Encrypted Client Hello in TLS. Prior to joining UBC, I was a Postdoctoral Scholar in Department of Computer Science at The University of Chicago, working with Professor Nick Feamster. I obtained my PhD from The State University of New York at Stony Brook under the supervision of Professor Michalis Polychronakis. With the support from the OTF’s Information Controls Fellowship during my PhD, I have also worked with several interdisciplinary groups, including The Citizen Lab at University of Toronto and the networking research group of Professor Phillipa Gill at The University of Massachusetts - Amherst. While I have been writing and publishing research papers under the name Nguyen Phong Hoang (abbrv NP Hoang), my Vietnamese name is Hoàng Nguyên Phong {family name: Hoàng, given name: Nguyên Phong}. So for the ease of pronunciation, I often go by Phong or フォン if you speak 日本語 (I spent the best six years of my youth in Japan at 京都大学, JAIST, and 立命館 APU). I am serving on the program committees of IEEE Security & Privacy ‘26, USENIX Security (‘26, ‘25, ‘24), IMC (‘26, ‘25, ‘24), PAM (‘25, ‘24), PETS (‘25, ‘24’), and FOCI (‘25, ‘24). Please consider submitting your work! Publications IRBlock: A Large-Scale Measurement Study of the Great Firewall of Iran Jonas Tai, Karthik Nishanth Sengottuvelavan, Peter Whiting, Nguyen Phong Hoang PDF Cite [USENIX Security '25] [Honorable Mention Award] [CSAW 2025 Finalist] Is Nobody There? Good! Globally Measuring Connection Tampering without Responsive Endhosts Sadia Nourin, Erik Rye, Kevin Bock, Nguyen Phong Hoang, Dave Levin PDF Cite [IEEE S&P '25] GFWeb: Measuring the Great Firewall's Web Censorship at Scale Nguyen Phong Hoang, Jakub Dalek, Masashi Crete-Nishihata, Nicolas Christin, Vinod Yegneswaran, Michalis Polychronakis, Nick Feamster PDF Cite GFWeb Dashboard [USENIX Security '24] Toward Automated DNS Tampering Detection Using Machine Learning Paola Calle, Larissa Savitsky, Arjun Nitin Bhagoji, Nguyen Phong Hoang, Shinyoung Cho Cite Code [FOCI '24] Automatic Generation of Web Censorship Probe Lists Jenny Tang, Léo Alvarez, Arjun Brar, Nguyen Phong Hoang, Nicolas Christin Cite Preprint [PoPETs '24] DeResistor: Toward Detection-Resistant Probing for Evasion of Internet Censorship Abderrahmen Amich, Birhanu Eshete, Vinod Yegneswaran, Nguyen Phong Hoang PDF Cite Code Slides [USENIX Security '23] Augmenting Rule-based DNS Censorship Detection at Scale with Machine Learning Jacob Brown, Xi Jiang, Van Tran, Arjun Nitin Bhagoji, Nguyen Phong Hoang, Nick Feamster, Prateek Mittal, Vinod Yegneswaran PDF Cite Code Preprint [KDD '23] Detecting Network Interference Without Endpoint Participation Sadia Nourin, Kevin Bock, Nguyen Phong Hoang, Dave Levin Cite [FOCI '23] Measuring and Evading Turkmenistan's Internet Censorship Sadia Nourin, Van Tran, Xi Jiang, Kevin Bock, Nick Feamster, Nguyen Phong Hoang, Dave Levin Cite Code Slides Preprint TMC Dashboard [WWW '23] Measuring the Accessibility of Domain Name Encryption and its Impact on Internet Filtering Nguyen Phong Hoang, Michalis Polychronakis, Phillipa Gill PDF Cite Slides Preprint [PAM '22] See all publications Media Coverage Big Brother gets new powers in China with digital ID system China is launching a digital ID system, giving Beijing greater control over online activity and further raising concerns about … Katrina Northrop Press release 中国の「金盾」を追跡する「GFWeb」が公開されChatGPTなどのAIサイトをいつから検閲していたのかが判明 中国政府は国内のインターネット通信を監視するため、グレートファイアウォール(金盾)という国家規模の検閲システムを運用しています。そんなグレー ギガジン English 日本語 New data reveals exactly when the Chinese government blocked ChatGPT and other AI sites Rest of World received exclusive access to a platform that tracks patterns and timing of Chinese online censorship. GFWeb provides … Joanna Chiu Press release New study finds Internet censorship in Turkmenistan reaches over 122,000 domains Blanket type censorship results in massive collateral damage! The dictatorship in Turkmenistan does not get a lot of media and … Nurbek Bekmurzaev Press release Exhaustive study puts China’s infamous Great Firewall under the microscope China’s notorious website-blocking technology is impacting the global DNS system as well as restricting access to content locally, … John Leyden Press release How The Great Firewall Reflects Beijing’s Policy The Internet censorship analyst talks about the evolution of China’s system, how it differs from and affects other countries, and … Katrina Northrop Press release China’s Great Firewall is blocking around 311k domains, 41k by accident In the largest study of its kind, a team of academics from four US and Canadian universities said they were able to determine the size … Catalin Cimpanu Press release Español 日本語 한글 简体 繁体 русский босански עִבְרִית‎ Français ខ្មែរ China suddenly blocked an Indonesian newspaper. No one knows why Earlier this week, Chinese censors abruptly blocked access to the website of Jawa Pos, one of Indonesia’s largest newspapers, … Peter Guest Press release Is Your Location Really Private on Grindr? Not Quite... If someone is truly determined, they can pinpoint where you are by comparing your proximity to fake accounts. Researchers at … David Murphy Press release Gay Dating Apps Promise Privacy, But Leak Your Exact Location A FEW DAYS ago, I warned my wife that the experiment I was about to engage in was entirely non-sexual, lest she glance over my shoulder … Andy Greenberg Press release I am very grateful to the following sponsors for supporting my research: Disclaimer: Any opinions, findings and conclusions or recommendations expressed in research outputs (published papers, talks, blog postings, etc.) are those of the author(s) and do not necessarily reflect the views of the sponsors. Land Acknowledgement: We respectfully acknowledge that the UBC Vancouver-Point Grey academic campus is located on the traditional, ancestral, unceded territory of the xʷməθkʷəy̓əm (Musqueam), and UBC operations in Vancouver more generally are also on the territories of the Skwxwú7mesh (Squamish) and səl̓ilwətaɁɬ (Tsleil-Waututh). Cite × Copy Download",
  "content_length": 7074,
  "method": "requests",
  "crawl_time": "2025-12-01 14:04:53"
}