{
  "name": "Niall McLaughlin",
  "homepage": "https://pure.qub.ac.uk/en/persons/niall-mclaughlin",
  "status": "success",
  "content": "Niall McLaughlin - Queen's University Belfast View Scopus Profile Niall McLaughlin Dr Senior Lecturer, School of Electronics, Electrical Engineering and Computer ScienceSpeech, Image and Vision SystemsInstitute of Electronics, Communications & Information Technology https://orcid.org/0000-0002-0917-9145 Phone+44 (0)28 9097 1830Emailn.mclaughlinqub.acuk Accepting PhD StudentsPhD projectsDeep Learning, Neural Networks, Machine Learning, Computer Vision, Image processing, Tracking, Re-identification, Human Pose Estimation, Cybersecurity, Malware detection 20112025 Research activity per year Personal profile Fingerprint Dive into the research topics where Niall McLaughlin is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 11 Similar Profiles Models Computer Science 100% Android Computer Science 90% Malware Detection Computer Science 75% Detection Computer Science 67% Person Re-Identification Computer Science 60% Reidentification Computer Science 52% Deep Learning Computer Science 47% Malware Computer Science 34% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2019 2019 2021 2022 2023 2024 2025 2025 7 Active Projects per year R3687ECS: Automated Piglet and Sow Monitoring for Early Detection of At-Risk PigletsMcLaughlin, N. (PI) & Kyriazakis, I. (CoI)06/02/2025 → …Project: Research R1373GFS: UKRI AI Centre for Doctoral Training in Sustainable Understandable agri-food Systems Transformed by Artificial INtelligence (SUSTAIN)Kyriazakis, I. (PI), Creevey, C. (CoI), Jurek-Loughrey, A. (CoI) & McLaughlin, N. (CoI)09/02/2024 → …Project: Research R1272ECS: TruDetect: Trustworthy Deep-Learning based Hardware Trojan Detection - Version 2O'Neill, M. (PI), Alouani, I. (CoI) & McLaughlin, N. (CoI)25/09/2023 → …Project: Research R1796ECS: NIO New Deal Cyber Bid -AIDE_NICYBER2025 (linked to R1778ECS)Miller, P. (PI), Alouani, I. (CoI), Devereux, B. (CoI), Johnson, C. (CoI), Martinez-del-Rincon, J. (CoI), McLaughlin, K. (CoI), McLaughlin, N. (CoI), O'Neill, M. (CoI), Olukoya, O. (CoI), Scott-Hayward, S. (CoI), Sharma, V. (CoI) & Wang, H. (CoI)19/12/2022 → …Project: Research Radio Access Network 100% Machine Learning 59% Artificial Intelligence 59% Misconfiguration 59% 6G 59% R8915CPH: Expanding the Gateway Research Infrastructure on Exposome Studies for the Health and Retirement Study and the Harmonized Cognitive Assessment Protocol International Network of StudiesHunter, R. (PI), Anderson, N. (CoI), Kee, F. (CoI), McGuinness, B. (CoI), McKinley, J. (CoI) & McLaughlin, N. (CoI)19/10/2022 → …Project: Research View all 7 projects Research output Research output per year 2011 2024 2025 2025 17 Conference contribution 14 Article 4 Paper 1 Chapter (peer-reviewed) 1 More 1 Meeting abstract Research output per year Research output per year Automated precision weighing: leveraging 2D video feature analysis and machine learning for live body weight estimation of broiler chickensCampbell, M., Miller, P., Diaz Chito, K., Irvine, S., Baxter, M., Martinez-del-Rincon, J., Hong, X., McLaughlin, N., Arumugam, T. & O'Connell, N., Mar 2025, In: Smart Agricultural Technology. 10, 100793.Research output: Contribution to journal › Article › peer-review Open AccessFile Learning System 100% Artificial Intelligence 100% Broiler Chickens 100% Broiler Chicken 100% Body Weight 100% 3 Citations (Scopus) 105 Downloads (Pure) LAB-KG: a retrieval-augmented generation method with knowledge graphs for medical lab test interpretationGuo, R., Devereux, B., Farnan, G. & McLaughlin, N., 30 Jan 2025, Proceedings of Bridging Neurons and Symbols for Natural Language Processing and Knowledge Graphs Reasoning @ COLING 2025. European Language Resources Association, p. 40-50 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Large Language Model 100% Information Retrieval 100% Knowledge Graph 100% Laboratory Test 60% Interpretability 20% 45 Downloads (Pure) Mind the gap: detecting black-box adversarial attacks in the making through query update analysisPark, J., McLaughlin, N. & Alouani, I., 13 Aug 2025, IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR 2025). Institute of Electrical and Electronics Engineers Inc., p. 10235-10243 (Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Adversarial Machine Learning 100% Attack Strategy 33% Model Architecture 33% Learning System 33% Machine Learning 33% 10 Downloads (Pure) Re-identification for long-term tracking and management of health and welfare challenges in pigsOdo, A., McLaughlin, N. & Kyriazakis, I., Mar 2025, In: Biosystems Engineering. 251, p. 89-100Research output: Contribution to journal › Article › peer-review Open AccessFile Performance Characteristic 100% Management Condition 100% Optical Tracking 12% 1 Citation (Scopus) 43 Downloads (Pure) SP-FGSM - salient pixel masking for improved adversarial attack concealmentMcCaughey, D., McLaughlin, N. & Martinez-del-Rincon, J., 30 Jun 2025, (Accepted) Irish Machine Vision and Image Processing Conference Proceedings 2025. Irish Pattern Recognition & Classification Society, Vol. 2025. (Proceedings (Irish Machine Vision and Image Processing Conference)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution View all 37 research outputs Prizes Mobile World Scholar Challenge - FinalistMcLaughlin, N. (Recipient), Millar, S. (Recipient), Martinez-del-Rincon, J. (Recipient) & Miller, P. (Recipient), 25 Feb 2019Prize: Prize (including medals and awards) Research Best Paper (AMDO 2018 Conference)McLaughlin, N. (Recipient) & Martinez-del-Rincon, J. (Recipient), 2018Prize: Prize (including medals and awards) Pose Estimation 100% Autoencoder 100% Press/Media Vision-based system tracks, analyzes chicken welfare (2020)O'Connell, N., Martinez-del-Rincon, J., Miller, P. & McLaughlin, N.27/05/20201 Media contributionPress/Media: Public Engagement Activities Impacts Applications of Novel Speech and Audio-Visual Processing ResearchJi, M. (Participant), Srinivasan, R. (Participant), Crookes, D. (Participant), Stewart, D. (Participant), McLaughlin, N. (Participant) & Woods, R. (Participant)Impact: Economic Impact, Health Impact",
  "content_length": 6734,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:06"
}