{
  "name": "Niao He",
  "homepage": "http://niaohe.ise.illinois.edu/index.html",
  "status": "success",
  "content": "Optimization & Decision Intelligence Group Home Prof. Niao He People Publications Teaching Openings Student Projects Contact Optimization & Decision Intelligence Group Welcome to the Optimization & Decision Intelligence Group. We are part of the Institute for Machine Learning at the Department of Computer Science of ETH Zürich. Decision Making with A.I. Optimization Convex & Non-convex Optimization Stochastic & Online Optimization Learning Theory & Game Theory Control & Dynamical Systems + Decision Intelligence Reinforcement Learning Meta and Transfer Learning Automated Decision Making Trustworthy Decision Making Join us We are looking for talented graduate students and postdocs with strong mathematical background and interests in optimization and machine learning. Check our Current Openings! > < Recent News and Highlights 2024-07 Our paper on Efficient Algorithms for A Class of Stochastic Hidden Convex Optimization and Its Applications in Network Revenue Management is accepted to Operations Research, 2024. 2024-05 Several papers accepted to ICML 2024. Congrats to all! - Private Fine-Tuning of Language Models without Backpropagation.. L. Zhang, B. Li, K. Thekumparampil, S. Oh, N. He. ICML 2024. - Truly No-Regret Learning in Constrained MDPs.. A. Müller, P. Alatur, V. Cevher, G. Ramponi, N. He. ICML 2024. - Model-Based RL for Mean-Field Games is not Statistically Harder than Single-agent RL. J. Huang, N. He, A. Krause. ICML 2024. 2024-04 Our paper on Convergence of Entropy-Regularized Natural Policy Gradient with Linear Function Approximation is accepted to SIAM Journal on Optimization, 2024, and our paper on Momentum-Based Policy Gradient with Second-Order Information is accepted to Transactions on Machine Learning Research (TMLR), 2024. 2024-03 Our paper on Finite-Time Analysis of Natural Actor-Critic for POMDPs is accepted to SIAM Journal on Mathematics of Data Science (SIMODS), 2024, and our paper on Finite-Time Analysis of Entropy-Regularized Neural Natural Actor-Critic Algorithm is accepted to Transactions on Machine Learning Research (TMLR), 2024. 2024-01 Several papers accepted to AISTATS 2024. Congrats to all! - Parameter-Agnostic Optimization under Relaxed Smoothness.. F. Hübler, J. Yang, X. Li, N. He. AISTATS 2024. - Generalization Bounds of Nonconvex-(Strongly)-Concave Stochastic Minimax Optimization. S. Zhang, Y. Hu, L. Zhang, N. He . AISTATS 2024. - On the Statistical Efficiency of Mean Field RL with General Function Approximation . J. Huang, B. Yardim, N. He. AISTATS 2024. - Taming Nonconvex Stochastic Mirror Descent with General Bregman Divergence. I. Fatkhullin, N. He. AISTATS 2024. - Independent Learning in Constrained Markov Potential Games. P. Jordan, A. Barakat, N. He. AISTATS 2024. 2023-12 Congrats to Dr. Junchi Yang for his next postdoc position at Argonne National Laboratory and Dr. Giorgia Ramponi for her next position as Assistant Professor at University of Zurich. Wish you great success in your new journey! 2023-12 Our paper on Automated Design of Affine Maximizer Mechanisms in Dynamic Settings is accepted to AAAI 2024, and two papers are accepted to the 23rd International Conference on Autonomous Agents and Multiagent Systems, AAMAS 2024. Congrats to Vinzenz, Pragnya, Giorgia, and Batu! 2023-11 We have been awarded the SNSF Starting Grant 2023! Thanks SNSF for the unprecedented support of our research! 2023-10 Several papers are accepted to NeurIPS 2023 main conference and workshops. Stay tuned and see you at New Orleans in December! - Optimal Guarantees for Algorithmic Reproducibility and Gradient Complexity in Convex Optimization. L. Zhang, J. Yang, A. Karbasi, N. He. NeurIPS 2023. (Spotlight) - Two Sides of One Coin: the Limits of Untuned SGD and the Power of Adaptive Methods. J. Yang, X. Li, I. Fatkhullin, N. He. NeurIPS 2023. - Robust Knowledge Transfer in Tiered Reinforcement Learning . J. Huang, N. He. NeurIPS 2023. - On Imitation in Mean-field Games. G. Ramponi, P. Kolev, O. Pietquin, N. He, M. Lauriere, M. Geist. NeurIPS 2023. - Momentum Provably Improves Error Feedback!. I. Fatkhullin, A. Tyurin, P. Richtarik. NeurIPS 2023. - Entropy-dissipation Informed Neural Network for McKean-Vlasov Type PDEs. Zebang Shen, Z. Wang. NeurIPS 2023. - Stochastic Optimization under Hidden Convexity. . I. Fatkhullin, N. He, Y. Hu. NeurIPS Workshop OPT 2023. - Parameter-Agnostic Optimization under Relaxed Smoothness.. F. Hübler, J. Yang, X. Li, N. He. NeurIPS Workshop OPT 2023. - DPZero: Dimension-Independent and Differentially Private Zeroth-Order Optimization.. L. Zhang, K. Thekumparampil, S. Oh, N. He. NeurIPS Workshop on Federated Learning 2023. 2023-09 Six papers are accepted and presented at the 16th European Workshop on Reinforcement Learning (EWRL 2023) in Brussels, Belgium! 2023-07 Congrats to Tanmay Goyal for receiving the ABB Research Prize for top-class Master's thesis from our group. 2023-04 Three papers accepted to ICML 2023! Congrats to Batu, Anas, and Ilyas. 2023-02 Congratulations to Xiang Li for receiving the ETH medal for his outstanding Master's thesis! See news here . 2023-02 Two papers accepted to AISTATS 2023 . Our paper on TiAda: A Time-scale Adaptive Algorithm for Nonconvex Minimax Optimization is accepted to ICLR 2023 . 2023-01 Niao visited University of Vienna in January and gave a lecture series on reinforcement learning at Vienna Graduate School on Computational Optimization . 2023-01 Two journal papers accepted: our paper on Sample Complexity and Overparameterization Bounds for Temporal Difference Learning with Neural Network Approximation is accepted to IEEE Transactions on Automatic Control ; our paper on A discrete-time switching system analysis of Q-learning is accepted to SIAM Journal on Control and Optimization . 2022-12 Niao gave a talk on Adaptive Min-Max Optimization at NeurIPS Workshop on Optimization for Maching Learning at New Orleans, USA, and at NUS Workshop on Optimization in the Big Data Era, National University of Singapore. 2022-10 Congratulations to ODI members, Junchi, Jiawei, Giorgia, and Siqi for being rated as top reviewers for NeurIPS 2022! 2022-10 Niao gave a talk on Nonconvex min-max optimization: fundamental limits, acceleration, and adaptivity at The Mathematics of Machine Learning Workshop at Bilbao, Spain. 2022-09 Several papers from the group members are accepted for NeurIPS 2022. - Nest Your Adaptive Algorithm for Parameter-Agnostic Nonconvex Minimax Optimization. J. YANG, X. Li, N. He. - Sharp Analysis of Stochastic Optimization under Global Kurdyka-Lojasiewicz Inequality. I. Fatkhullin, J. Etesami, N. He, N. Kiyavash. - Bring Your Own Algorithm for Optimal Differentially Private Stochastic Minimax Optimization. L. Zhang, K. Thekumparampil, S. Oh, N. He. - Trust Region Policy Optimization with Optimal Transport Discrepancies: Duality and Algorithm for Continuous Actions. A. Terpin, N. Lanzetti, A. B. Yardim, G. Ramponi, F. Dorfler. - Tiered Reinforcement Learning: Pessimism in the Face of Uncertainty and Constant Regret. J. Huang et.al. - Stochastic Second-Order Methods Provably Beat SGD For Gradient-Dominated Functions. M. Masiha, S. Salehkaleybar, N. He, N. Kiyavash, P. Thiran. 2022-09 Niao gave a talk on Complexities of Actor-critic Methods for Regularized MDPs and POMDPs at the 15th European Workshop on Reinforcement Learning (EWRL 2022) in Milan, Italy and the WiOpt workshop on Reinforcement Learning and Stochastic Control in Queues and Networks. 2022-09 Niao gave a lecture on the Interplay between Optimization and Reinforcement Learning at the Sargent Centre Summer School on Data-Driven Optimisation at Imperial College London, UK. 2022-08 Congratulations for Yifan, Siqi, and Semih for their new journeys. Yifan is starting a postdoc position at EPFL, Switzerland, and Siqi will be a Rufus Isaacs Postdoctoral Fellow at Johns Hopkins University, USA. Semih Cayci will start a faculty position in the Department of Mathematics at RWTH Aachen, Germany. 2022-07 Several group members, Yifan, Anas, and Niao gave talks and organized sessions at the seventh International Conference on Continuous Optimization (ICCOPT) at Lehigh University, USA. 2022-06 Niao gave a talk on nonconvex minimax optimization and Junchi presented a poster at the ELLIS Theory Workshop in Arenzano, Italy. 2022-05 Together with Florian Dorfler, Niao co-organized the NCCR symposium on Systems Theory of Algorithms at ETH Zurich and also gave a talk on Q-learning through the Lens of Dynamical Systems : from asymptotics to non-asymptotics. 2022-02 Niao visited Simons Institute at UC Berkeley for six weeks and participated in the Learning and Games program. During the visit, Niao gave a talk on Universal Acceleration for Minimax Optimization at the visitor seminar series and another talk on single-loop algorithms for unbalanced minimax optimization at the workshop on Adversarial Approaches in Machine Learning. 2021-11 Niao gave a seminar talk on \"Three common RL tricks: why and when do they work?\" at Machine Learning Genoa Center (MaLGa), Italy and a virtual talk at the Control Seminar series at University of Oxford, UK. 2021-08 Together with Yurii Nesterov, Niao gave week-long lectures at Zinal Summer School: Data Science, Optimization and Operations Research organized by TRANSP-OR from EPFL. Please find the lecture slides on Reinforcement Learning: Optimization and Dynamical Systems Perspectives here. 2021-07 Together with Agarwal, Du, Szepesvári, and Yang, we organized the ICML workshop on Reinforcement Learning Theory, July 24-25, virtual event. 2021-06 Niao (joint with Bo Dai from Google Brain) gave lectures on Reconciling Reinforcement Learning: Optimization, Generalization, and Exploration at the EPFL & ETHZ Summer School on Foundations and Mathematical Guarantees of Data-driven Control. Please find the (8-hour) video recording here. 2021-01 Our group has moved to ETH Zurich, Switzerland! 2020-12 Our group got six papers accepted to NeurIPS 2020! Check papers her",
  "content_length": 10661,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:07"
}