{
  "name": "Nicholas Spooner",
  "homepage": "https://spooner.cc",
  "status": "success",
  "content": "Nicholas (Nick) Spooner Nicholas (Nick) Spooner nspooner [at] cornell [dot] edu I am an Assistant Professor of Computer Science at Cornell University, and a member of the Theory of Computing group. In summer 2025 I was a Simons-Berkeley Research Fellow in connection with the programme \"Cryptography 10 Years Later\". My work focuses on post-quantum proof systems. My interests include probabilistic proof systems and zero knowledge in general, post-quantum cryptography, quantum information, coding theory and computational complexity. I was an assistant professor at the University of Warwick until 2024, and a visiting assistant professor at NYU for the 2023-24 academic year. Before that, I was a postdoc at Boston University, hosted by Ran Canetti. I received my PhD from UC Berkeley, where I was advised by Alessandro Chiesa. I hold a master's degree in theoretical computer science from ETH Zürich, Switzerland, and a bachelor's degree in computer science from the University of Cambridge. Teaching Fall 2025: CS 6832: Quantum Cryptography at Cornell. Spring 2025: CS 4813: Quantum Computing at Cornell. Fall 2024: CS 6814: Probabilistic Proofs at Cornell. Spring 2024: CSCI-UA.0480-​074 Quantum Computing at NYU. Fall 2023: CSCI-GA.3033-​103 Quantum Computing at NYU. Spring 2022, Spring 2023: CS419/939 Quantum Computing at Warwick. Advising Oren Renard (PhD, 2024-present), co-advised with Eshan Chattopadhyay Max Tromanhauser (PhD, 2024-present) Publications Quantum Rewinding for IOP-Based Succinct Arguments Alessandro Chiesa, Marcel Dall'Agnol, Zijing Di, Ziyi Guan and Nicholas Spooner Accepted to TCC 2025. A Zero-Knowledge PCP Theorem Tom Gur, Jack O'Connor and Nicholas Spooner STOC 2025, Prague, Czechia. Untangling the Security of Kilian's Protocol: Upper and Lower Bounds Alessandro Chiesa, Marcel Dall'Agnol, Ziyi Guan, Nicholas Spooner and Eylon Yogev TCC 2024, Milan, Italy. Perfect Zero Knowledge PCPs for #P Tom Gur, Jack O'Connor and Nicholas Spooner STOC 2024, Vancouver, Canada. [talk by Jack] ITC 2024, Santa Barbara, USA. Featured in Quanta Magazine. An efficient quantum parallel repetition theorem and applications John Bostanci, Luowen Qian, Nicholas Spooner and Henry Yuen QIP 2024, Taipei, Taiwan (short plenary). [talk by John] STOC 2024, Vancouver, Canada. On the Necessity of Collapsing for Quantum and Post-Quantum Commitments Marcel Dall'Agnol and Nicholas Spooner QCW 2022, QIP 2023 (poster) and TQC 2023 (Outstanding Paper Prize). Speed-Stacking: Fast Sublinear Zero-Knowledge Proofs for Disjunctions Aarushi Goel, Mathias Hall-Andersen, Gabriel Kaptchuk and Nicholas Spooner Eurocrypt 2023, Lyon, France. Proof-Carrying Data From Arithmetized Random Oracles Megan Chen, Alessandro Chiesa, Tom Gur, Jack O'Connor and Nicholas Spooner Eurocrypt 2023, Lyon, France. The Superlinearity Problem in Post-Quantum Blockchains Sunoo Park and Nicholas Spooner Financial Cryptography (FC) 2023, Bol, Croatia. Quantum Rewinding for Many-Round Protocols Russell W.F. Lai, Giulio Malavolta and Nicholas Spooner TCC 2022, Chicago, USA. Post-Quantum Zero Knowledge, Revisited (or: How to Do Quantum Rewinding Undetectably) Alex Lombardi, Fermi Ma and Nicholas Spooner. FOCS 2022, Denver, USA. QIP 2023, Ghent, Belgium. On Succinct Non-Interactive Arguments in Relativized Worlds Megan Chen, Alessandro Chiesa and Nicholas Spooner. Eurocrypt 2022, Trondheim, Norway. Post-Quantum Succinct Arguments: Breaking the Quantum Rewinding Barrier Alessandro Chiesa, Fermi Ma, Nicholas Spooner and Mark Zhandry.FOCS 2021 (invited to SICOMP special issue), online. QIP 2022, Pasadena, USA. QCrypt 2021, online. [talk by Fermi] Talk at Protocol Labs. Proof-Carrying Data without Succinct Arguments Benedikt Bünz, Alessandro Chiesa, William Lin, Pratyush Mishra and Nicholas Spooner. CRYPTO 2021, online. Charles River Crypto Day, online. [talk] Proof-Carrying Data from Accumulation Schemes Benedikt Bünz, Alessandro Chiesa, Pratyush Mishra and Nicholas Spooner. TCC 2020, online. Fractal: Post-Quantum and Transparent Recursive Proofs from Holography Alessandro Chiesa, Dev Ojha and Nicholas Spooner. Eurocrypt 2020, online. [talk by Dev] SBC 2020, Stanford, USA. [talk] Efficient Post-quantum SNARKs for RSIS and RLWE and Their Applications to Privacy. Cecilia Boschini, Jan Camenisch, Max Ovsiankin and Nick Spooner. PQCrypto 2020. [talk by Cecilia] Succinct Arguments in the Quantum Random Oracle Model Alessandro Chiesa, Peter Manohar and Nicholas Spooner. TCC 2019, Nuremberg, Germany. QIP 2020, Shenzhen, China. [talk] Linear-Size Constant-Query IOPs for Delegating Computation Eli Ben-Sasson, Alessandro Chiesa, Lior Goldberg, Tom Gur, Michael Riabzev and Nicholas Spooner. TCC 2019, Nuremberg, Germany. Aurora: Transparent Succinct Arguments for R1CS Eli Ben-Sasson, Alessandro Chiesa, Michael Riabzev, Nicholas Spooner, Madars Virza and Nicholas P. Ward. Eurocrypt 2019, Darmstadt, Germany. 2nd ZKProof Standards Workshop, Berkeley, CA. [talk] Spatial Isolation Implies Zero Knowledge Even in a Quantum World Alessandro Chiesa, Michael A. Forbes, Tom Gur and Nicholas Spooner. FOCS 2018, Paris, France. [talk] QIP 2019, Boulder, CO, USA. (includes material from preprint A Zero Knowledge Sumcheck and its Applications.) Zero Knowledge Protocols from Succinct Constraint Detection Eli Ben-Sasson, Alessandro Chiesa, Michael A. Forbes, Ariel Gabizon, Michael Riabzev and Nicholas Spooner. TCC 2017, Baltimore MD, USA. Interactive Oracle Proofs with Constant Query Complexity and Rate Eli Ben-Sasson, Alessandro Chiesa, Ariel Gabizon, Michael Riabzev and Nicholas Spooner. ICALP 2017, Warsaw, Poland. Interactive oracle proofs Eli Ben-Sasson, Alessandro Chiesa and Nicholas Spooner. TCC 2016-B, Beijing, China. Fixed-Budget Performance of the (1+1)-EA on Linear Functions Johannes Lengler and Nicholas Spooner. ACM/SIGEVO Foundations of Genetic Algorithms XIII (FOGA 2015), Aberystwyth, UK. Other recorded talks Post-quantum cryptographic proofs STOC 2022 Workshop: The Multiple Facets of Quantum Proofs, June 2022. SNARKs from Hash Functions. ZK HACK #1, Oct 2021 Proofs of proofs: incremental verifiability from recursion and accumulation 4th ZKProof Standards Workshop, May 2021 Older preprints and reports Concrete Security for Succinct Arguments from Vector Commitments Alessandro Chiesa, Marcel Dall'Agnol, Ziyi Guan and Nicholas Spooner A Zero Knowledge Sumcheck and its Applications Alessandro Chiesa, Michael A. Forbes and Nicholas Spooner. ePrint 2017/305 Evaluation and Benchmarking for Robot Motion Planning Problems Using TuLiP Nicholas Spooner. Caltech Technical Report (2012). Service Program committees: FOCS 2025, Eurocrypt 2025, CRYPTO 2024, ICALP 2024, Quantum Cryptography Workshop 2022, TCC 2022, ZKProof4 (2021), TCC 2020, Stanford Blockchain Conference 2020.",
  "content_length": 6803,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:12"
}