{
  "name": "Nicholas R. Jennings",
  "homepage": "https://www.lboro.ac.uk/services/vco/smt/vc-prof-jennings",
  "status": "success",
  "content": "Vice-Chancellor and President | Vice-Chancellor's Office | Loughborough University Professor Nick Jennings CB FREng FRS Vice-Chancellor and President of Loughborough University Professor Jennings is Vice-Chancellor and President of Loughborough University. He is also the Vice-President for Fellowship Engagement at the Royal Academy of Engineering. He was previously the Vice-Provost for Research and Enterprise at Imperial College London, the UK Government’s first Chief Scientific Advisor for National Security, and Regius Professor of Computer Science at the University of Southampton. ORCiD Researcher ID Google Scholar +44 (0)1509 222001 Send email Hazlerigg Building LinkedIn X Vice-Chancellor’s Communications VC Annual Awards VC Gold Pins Profile Responsibilities Research Awards Profile Professor Nick Jennings is an internationally-recognised authority in the areas of AI, autonomous systems, cyber-security and agent-based computing. His research focuses on developing AI systems for large-scale, open and dynamic environments. In particular, he is interested in how to endow individual autonomous agents with the ability to act and interact in flexible ways and with effectively engineering systems that contain both humans and software agents. He is passionate about the real-world impact of research and his systems have been deployed to save lives in the aftermath of disasters, to win Olympic medals for TeamGB, and to monitor the impact of climate change on glaciers. He has also been involved with a number of start-ups including Aerogility, Darktrace, Sentient Sports, Reliance Cyber Systems and is a board member of Midlands Mindforge and a board advisor to Leicestershire County Cricket Club. In undertaking this research, he has attracted grant income of £33M, published over 700 articles (with 500 co-authors) and graduated 55 PhD students (including two winners and one runner-up of the BCS/CPHC Distinguished Dissertation Award). With over 100,000 citations, he is one of the world's most cited computer scientists. He was the founding Editor-in-Chief of the International Journal of Autonomous Agents and Multi-Agent Systems and a founding director of the International Foundation for Autonomous Agents and Multi-Agent Systems. Nick was made a Companion of the Order of the Bath (CB) in the Queen’s New Year Honours List in 2016 for his services to computer science and national security science. He has received a number of prestigious awards for his research including the Computers and Thought Award, the ACM Autonomous Agents Research Award, and the Lovelace Medal. He is a judge for the Queen Elizabeth Prize for Engineering and was chair of the judges for the inaugural Manchester Prize in AI. He is a Fellow of the Royal Society, Royal Academy of Engineering, the Institute of Electrical and Electronic Engineers, the British Computer Society, the Institution of Engineering and Technology, the Association for the Advancement of Artificial Intelligence (AAAI), the Society for the Study of Artificial Intelligence and Simulation of Behaviour (AISB), the Royal Society of the Arts, the City and Guilds of London Institute, the German AI Institute (DFKI) and the European Artificial Intelligence Association and a member of Academia Europaea. Responsibilities Professor Jennings became the ninth Vice-Chancellor and President of Loughborough University in October 2021. The Vice-Chancellor and President is the academic and executive head of the University and is also chair of Senate. They are responsible for devising and delivering upon the strategic and operational plans that have been approved by the University’s Council and for ensuring the University operates in a sustainable manner. The Vice-Chancellor has special responsibilities for the advancement of the University, through the development of relationships with partners and supporters locally, nationally, and internationally. They are also the University’s Accountable Officer to the Office for Students. Research My research focuses on developing artificial intelligence (AI) systems for large-scale, open and dynamic environments. I focus on how to endow individual autonomous agents with the ability to act and interact in flexible ways and with effectively engineering systems that contain both humans and software agents. My main scientific contributions are in three areas: First, in the analysis and design of automated negotiation algorithms; including computationally-tractable strategies for complex and uncertain settings such as bilateral encounters and online auctions, and argumentation-based models for persuasive encounters. Second, developing new mechanisms and algorithms for inter-agent cooperation and coordination. This includes coalition formation techniques based on game theory, message-passing algorithms that rely on decision and information theory to achieve effective coordination in resource-constrained environments and principled models of trust and reputation. Third, in the establishment and development of the discipline of agent-oriented software engineering; including laying out the key tenets of the field of agent-based computing for building complex software systems and developing associated software engineering methodologies. I am passionate about the real-world impact of research. I was the lead system architect for one of the world’s first industrial deployments of multi-agent technology, in the area of electricity transportation, and have subsequently been involved with deployments of agent-based solutions in many domains with a range of companies and charities: With the disaster response charity Rescue Global, deployed a system of machine learning, information fusion and coordination algorithms to inform their response to the 2015 Nepal Earthquake. Our multi-agent system identified a number of villages, missed by their standard approach, which benefited from the deployment of water filters. This intervention brought much needed relief to victims that would otherwise not have received timely assistance With research colleagues, built environmental sensor networks system that provided new insights on the impact of climate change in the Briksdalsbreen glacier in Norway and monitored pollution in the River Solent in Southampton. The individual sensors intelligently coordinate their readings to effectively manage their power usage and communication channels Used negotiation algorithms to efficiently control Daimler-Chrysler’s engine manufacturing production lines, schedule the repair of aircraft engines with Rolls-Royce, manage complex supply chains with BAE Systems and allocate teams of field engineers to repair tasks with BT With UK Sport, used information fusion and cooperation algorithms to assess and predict race conditions for the highly successful 2012 British Olympic sailing team (winners of one gold and four silver medals) With BHP Billiton, built an agent-based system for interpreting seismic data for oil exploration With BAE Systems, incorporated fusion and coordination algorithms into one of their products for in-theatre situational awareness With the Centre for Sustainable Energy, developed assistant agents that accurately analyse and predict home energy use for individuals in fuel poverty. This greater fidelity helped the charity better determine the best intervention for the people they visit Awards Int. Foundation for Autonomous Agents and Multi-Agent Systems Influential Paper Award for “Negotiation decision functions for autonomous agents” pub. in Robotics and Autonomous Systems (1998) (2024) Winner AIJ Prominent Paper Award (2021) for “Efficient crowdsourcing of unknown experts using bounded multi-armed bandits” pub. in Artificial Intelligence Journal in 2014 BCS Lovelace Medal for outstanding contributions to the field of multi-agent systems (2020) AMiner Top 10 Most Influential Scholars Award in AI (2018) Int. Foundation for Autonomous Agents and Multi-Agent Systems Influential Paper Award for “Developing multiagent systems: the Gaia methodology” published in ACM Trans. on Software Engineering and Methodology in 2003 (2018) The Engineer’s “Collaborate to Innovate” Award for ORCHID (2016) IJCAI-JAIR Best Paper Prize (Honourable Mention) for“Theoretical and practical foundations of large-scale agent-based micro-storage in the smart grid” published in Journal of AI Researchin 2011 (2016) The Engineer’s Award for Best Aerospace and Defence Project for ALADDIN (2009) BAE Systems Chairman’s Award for ALADDIN’s Technology Transfer activities (2009) Int. Conf. on Autonomous Agents and Multi-Systems Best Industrial Demonstrator Award (2008) Int. Foundation for Autonomous Agents and Multi-Agent Systems Special Recognition Award for “Intelligent agents: theory and practice” published in The Knowledge Engineering Review in 1995 [> 12k citations] (2007) The Engineer’s Award for Large Company/Univ. Collaboration for ARGUS II (2007) ACM Autonomous Agents Research Award for contributions to agent-based computing (2003) IET Achievement Medal for contributions to agent-based computing (2000) Computer and Thought Award for contributions to multi-agent systems. This is the most prestigious award for a young AI researcher and first time in the award’s 40-year history the recipient was based in Europe (1999) Winner of 11 best paper awards at international conferences; including AAMAS (x3), EUMAS, ISWC and IAT and 11 honourable mentions (AAAI, AAMAS (x4) and ECAI (x6))",
  "content_length": 9491,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:11"
}