{
  "name": "Nicholas G. Feamster",
  "homepage": "https://people.cs.uchicago.edu/~feamster",
  "status": "success",
  "content": "Nick Feamster Nick Feamster Neubauer Professor, Department of Computer Science Director, Network Operations and Internet Security Lab Co-Director, Internet Innovation Initiative Co-Lead, netml.io Co-Director, AI and Policy Pillar University of Chicago CV | News | Wikipedia John Crerar Library Room 261 feamster -at- uchicago . edu I am Neubauer Professor of Computer Science at the University of Chicago. I direct the Network Operations and Internet Security research lab, where we develop data-driven tools and systems to improve Internet security, performance, and adoption. Join us! I am Co-Lead of netml.io, a research initiative focused on applying machine learning to networking problems. I am also Co-Director of the AI and Policy Pillar, working on policy issues at the intersection of AI and technology. My research focuses on empirical measurement and applications of AI/ML to improve the performance and security of networked systems, with extensive experience in technology, policy, and the intersection of the two. My early work on network configuration analysis pioneered AI-driven approaches to network security, and my research on the Routing Control Platform laid the foundation for Software Defined Networking (SDN), earning the USENIX Test of Time Award. Before academia, I was the first software engineer at LookSmart (later acquired by AltaVista), where I built one of the first web crawlers, and my work on streaming protocols in the late 1990s led to early live television transmission over the Internet. I serve as an expert witness in technology litigation, with federal trial testimony experience in software patent, copyright, trade secrets, and privacy law. My expertise spans AI models, machine learning, access control, anomaly detection, video technologies, and software defined networking. Outside of work, I am an avid distance runner with more than 20 marathons including Boston, New York, Chicago, and the Comrades ultramarathon in South Africa. I also write, produce, and perform music. Group Software News Book",
  "content_length": 2048,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:07"
}