{
  "name": "Nicholas R. Gans",
  "homepage": "https://sites.google.com/view/nicholasrgans/home",
  "status": "success",
  "content": "Nicholas R. GansSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome!My CVNick_Gans_CV.pdfDr. Nicholas GansI am currently the Division Head of Automation and Intelligent Systems at the University of Texas at Arlington Research Institute and an Associate Professor in the Computer Science and Engineering Department at the University of Texas at Arlington.I have been in my role at UTARI since 2019 and in the CSE department since 2024Prior to that, I was a professor at the Department of Electrical Engineering at the University of Texas at Dallas. My research interests are in robotics, control theory, and machine learning.  I have a focus on vision-based estimation and control for robots and autonomous vehicles.  Naturally, my research includes computer vision and nonlinear control.  You can learn more about UT Arlington Research Institute and CSE at UTA .  I am still getting my reserach lab up and running, so don't have a lab web page at this time.At UT Dallas I directed the Sensing, Robotics, Vision, Controls  and Estimation (SeRViCE) Lab.  Please check out the (now historical) SeRViCE Lab webpage.Many of my papers can be easily viewed and downloaded  at my ResearchGate page. My recent research includes:• Control laws that incorporate machine learning to teach robots and vehicles human skills while  guaranteeing safety and performance.  Our work was nominated for Finalist for Best Paper at the Conference at the 2021 IEEE Conference on Automation Science and Engineering• Advanced 3D vision to inspect infrastructure such as roads and structures• Adaptive control and geometric control to enable robot-guided ink-jet deposition on curved surfaces • Novel extrememum seeking control algorithms for variable speed rhythmic processes such as powered prosthetic walking • Combining the relative strengths of control theory and machine learning to create robust control policies • Using machine learning to reduce the data necessary for simultaneous localization and mapping (SLAM)• Advanced distributed formation control and obstacle avoidance algorithms for swarms of robots • Vision-based lane and vehicle detection for automated driver assistance and autonomous vehicles • Visual odometry and motion estimation for mobile robotsGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2318,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:10"
}