{
  "name": "Nickolay Zakhleniuk",
  "homepage": "https://www.essex.ac.uk/people/zakhl71400/nick-zakhleniuk",
  "status": "success",
  "content": "Nick Zakhleniuk | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Nick Zakhleniuk People Dr Nick Zakhleniuk Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email naz@essex.ac.uk Telephone +44 (0) 1206 874248 Location 1NW.4.14, Colchester Campus Teaching and supervision Publications Contact Teaching and supervision Publications Contact Teaching and supervision Current teaching responsibilities Team Project Challenge (CE101) Internship Portfolio (CE307) Telecommunication Networks and Systems (CE334) IP Networking and Applications (CE707) Current supervision Mona Alshehri Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Onur Duzgol Thesis title: Enhanced Modulation Dynamic Performance of Optically-Injected Widely-Tunable Semiconductor Lasers Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 23/8/2017 Georgios Kyritsis Thesis title: Theory and Modelling of Wavelength Tunable Laser Transmitters with Enhanced Tuning Range and Their Modulation Performance Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 12/1/2016 Publications Journal articles (44) Zakhleniuk, N., (2025). Landau-Fokker-Planck equation for hot electrons in semiconductors. Physical Review Research. 7 (3) Zakhleniuk, N. and Duzgol, O., (2024). Optical injection locking and optical-fiber data transmission by directly modulated wavelength tunable laser transmitters. AIP Advances. 14 (3) Alasmar, M., Clegg, R., Zakhleniuk, N. and Parisis, G., (2021). Internet Traffic Volumes are Not Gaussian—They are Log-Normal: An 18-Year Longitudinal Study With Implications for Modelling and Prediction. IEEE ACM Transactions on Networking. 29 (3), 1266-1279 Kyritsis, G. and Zakhleniuk, N., (2017). Performance of Widely Tunable Multi-Quantum-Well and Bulk Laser Diodes and the Main Limiting Factors. IEEE Journal of Quantum Electronics. 53 (3), 1-16 Duzgol, O., Kyritsis, G. and Zakhleniuk, N., (2017). Travelling‐wave modelling of the modulation dynamic performance of wavelength‐tunable laser diodes using the integrated VPI and PICS3D software. IET Optoelectronics. 11 (2), 66-72 Duzgol, O., Kyritsis, G. and Zakhleniuk, N., (2017). Modulation dynamic response of optical-injection-locked wavelength-tunable semiconductor laser diodes. IET Optoelectronics. 11 (2), 58-65 Kyritsis, G. and Zakhleniuk, N., (2013). Self-Consistent Simulation Model and Enhancement of Wavelength Tuning of InGaAsP/InP Multisection DBR Laser Diodes. IEEE Journal of Selected Topics in Quantum Electronics. 19 (5), 1-11 Momox, E., Zakhleniuk, N. and Balkan, N., (2012). Overshoot mechanism in transient excitation of THz and Gunn oscillations in wide-bandgap semiconductors. Nanoscale Research Letters. 7 (1) Momox, E., Zakhleniuk, N. and Balkan, N., (2012). Solution of the 1D Schrödinger equation in semiconductor heterostructures using the immersed interface method. Journal of Computational Physics. 231 (18), 6173-6180 Momox, E., Zakhleniuk, NA. and Balkan, N., (2012). Overshoot mechanism in transient excitation of THz and Gunn oscillations in wide-bandgap semiconductors. Nanoscale Research Letters. 7 (1), creators-Zakhleniuk=3ANickolay_A=3A=3A Stolz, C., Labukhin, D., Zakhleniuk, NA. and Adams, MJ., (2010). Dynamics of Optically-Injected Semiconductor Lasers Using the Travelling-Wave Approach. IEEE Journal of Quantum Electronics. 46 (2), 220-227 Labukhin, D., Stolz, CA., Zakhleniuk, NA., Loudon, R. and Adams, MJ., (2010). Nonlinear Dynamics of Multi-Section Tunable Lasers. IEEE Journal of Quantum Electronics. 46 (5), 689-699 Bulutay, C., Turgut, CM. and Zakhleniuk, NA., (2010). Carrier-induced refractive index change and optical absorption in wurtzite InN and GaN: Full-band approach. Physical Review B. 81 (15), 155206- Labukhin, D., Stolz, CA., Zakhleniuk, NA., Loudon, R. and Adams, MJ., (2009). Modified Fabry–Perot and Rate Equation Methods for the Nonlinear Dynamics of an Optically Injected Semiconductor Laser. IEEE Journal of Quantum Electronics. 45 (7), 864-872 Brannick, A., Zakhleniuk, NA., Ridley, BK., Eastman, LF., Shealy, JR. and Schaff, WJ., (2009). Hydrodynamic simulation of surface traps in the AlGaN/GaN HEMT. Microelectronics Journal. 40 (3), 410-412 Brannick, A., Zakhleniuk, NA., Ridley, BK., Shealy, JR., Schaff, WJ. and Eastman, LF., (2009). Influence of Field Plate on the Transient Operation of the AlGaN/GaN HEMT. IEEE Electron Device Letters. 30 (5), 436-438 Stolz, CA., Labukhin, D., Zakhleniuk, N., Loudon, R. and Adams, MJ., (2009). Power fluctuations of a weakly optically-injected semiconductor laser in a period-one state. Optics Communications. 282 (10), 2074-2080 Zakhleniuk, NA., (2006). Nonequilibrium drift-diffusion transport in semiconductors in presence of strong inhomogeneous electric fields. Applied Physics Letters. 89 (25) Bulutay, C., Ridley, BK. and Zakhleniuk, NA., (2003). Electron momentum and energy relaxation rates in GaN and AlN in the high-field transport regime. Physical Review B. 68 (11) Anderson, DR., Zakhleniuk, NA., Babiker, M., Ridley, BK. and Bennett, CR., (2001). Polar-optical phonon-limited transport in degenerate GaN-based quantum wells. Physical Review B. 63 (24), 2453131-2453137 Anderson, DR., Babiker, M., Bennett, CR., Zakhleniuk, NA. and Ridley, BK., (2001). Evaluations of the low-field mobility in degenerate GaN/AlN heterojunctions. Journal of Physics Condensed Matter. 13 (26), 5999-6004 Ridley, BK., Zakhleniuk, NA. and Babiker, M., (2000). A continuum model for acoustic and optical phonons in heterostructures. Solid State Communications. 116 (7), 385-388 Bulutay, C., Ridley, BK. and Zakhleniuk, NA., (2000). Comparative analysis of zinc-blende and wurtzite GaN for full-band polar optical phonon scattering and negative differential conductivity. Applied Physics Letters. 77 (17), 2707-2709 Bulutay, C., Ridley, BK. and Zakhleniuk, NA., (2000). Full-band polar optical phonon scattering analysis and negative differential conductivity in wurtzite GaN. Physical Review B. 62 (23), 15754-15763 Zakhleniuk, NA., Bennett, CR., Babiker, M. and Ridley, BK., (1999). The Bloch–Grüneisen mobility of two-dimensional electron gas in AlGaN/GaN heterostructures. Applied Physics Letters. 75 (11), 1565-1567 Zakhleniuk, NA., Babiker, M., Bennett, CR. and Ridley, BK., (1999). Hot electrons in large-bandgap bulk semiconductors and quantum wells. Turkish Journal of Physics. 23 (4), 593-601 Bennett, CR., Ridley, BK., Zakhleniuk, NA. and Babiker, M., (1999). The extended hybrid model for optical phonon confinement. Turkish Journal of Physics. 23 (4), 731-738 Babiker, M., Zakhleniuk, NA., Bennett, CR., Stavrou, VN. and Ridley, BK., (1999). Electrons and phonons in GaN semiconductor quantum well devices. Turkish Journal of Physics. 23 (4), 529-538 Zakhleniuk, NA., Bennett, CR., Stavrou, VN., Babiker, M. and Ridley, BK., (1999). Quantum capture of injected electrons in GaN-based laser heterostructures. Physica Status Solidi A Applied Research. 176 (1), 79-83 Zakhleniuk, NA., Bennett, CR., Ridley, BK. and Babiker, M., (1998). Multisubband hot-electron transport in GaN-based quantum wells. Applied Physics Letters. 73 (17), 2485-2487 Ridley, BK., Al-Dossary, O., Babiker, M., Zakhleniuk, NA. and Bennett, CR., (1998). Optical-phonon tunnelling and the electron scattering rate. Superlattices and Microstructures. 23 (2), 201-203 Bennett, CR., Amato, MA., Zakhleniuk, NA., Ridley, BK. and Babiker, M., (1998). Effects of a monolayer on the electron-phonon scattering rates in a quantum well: Dielectric continuum versus hybrid model. Journal of Applied Physics. 83 (3), 1499-1506 Zakhleniuk, NA. and Ridley, BK., (1997). Cascade Capture and Hot Photoelectrons in One-Dimensional Semiconductors. physica status solidi (b). 204 (1), 287-289 Ridley, BK., Zakhleniuk, NA., Bennett, CR., Constantinou, NC. and Babiker, M., (1997). Nonequilibrium Electrons under Quantization Conditions. physica status solidi (b). 204 (1), 262-264 Zakhleniuk, NA., Bennett, CR., Constantinou, NC., Ridley, BK. and Babiker, M., (1996). Theory of optical-phonon limited hot-electron transport in quantum wires. Physical Review B. 54 (24), 17838-17849 Ridley, BK. and Zakhleniuk, NA., (1996). Hot electrons under quantization conditions: III. Analytical results and new nonlinear regimes. Journal of Physics: Condensed Matter. 8 (44), 8553-8581 Ridley, BK. and Zakhleniuk, NA., (1996). Inelastic electron-acoustic-phonon interaction in quantum-well wires. Journal of Experimental and Theoretical Physics Letters. 63 (6), 464-470 Ridley, BK. and Zakhleniuk, NA., (1996). Hot electrons under quantization conditions: II. The Boltzmann equation. Journal of Physics: Condensed Matter. 8 (44), 8539-8552 Ridley, BK. and Zakhleniuk, NA., (1996). Hot electrons under quantization conditions: I. Kinematics. Journal of Physics: Condensed Matter. 8 (44), 8525-8537 Kochelap, VA. and Zakhleniuk, NA., (1994). Hydrodynamic fluctuations of a hot-e",
  "content_length": 16852,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:19"
}