{
  "name": "Nickolai Zeldovich",
  "homepage": "https://people.csail.mit.edu/nickolai",
  "status": "success",
  "content": "Nickolai Zeldovich Nickolai Zeldovich Professor Joan and Irwin M. (1957) Jacobs Professorship PDOS and CSS research groups Computer Science and Artificial Intelligence Laboratory (CSAIL) Department of Electrical Engineering and Computer Science MIT Contact Email: nickolai at csail mit edu 32 Vassar Street, Room 32-G994 Cambridge, MA  02139 (617) 253-6005 Bio Nickolai Zeldovich is the Joan and Irwin M. (1957) Jacobs Professor of Electrical Engineering and Computer Science at MIT, and a member of the Computer Science and Artificial Intelligence Laboratory. He received his PhD from Stanford University in 2008. His research interests are in building practical secure systems. Recent projects by Prof. Zeldovich and his students and colleagues include the CryptDB encrypted database, the STACK tool for finding undefined behavior bugs in C programs, the FSCQ formally verified file system, the Algorand cryptocurrency, and the Vuvuzela private messaging system. He has been involved with several start-up companies, including MokaFive (desktop virtualization), PreVeil (end-to-end encryption), and Algorand (cryptocurrency). Prof. Zeldovich's work has been recognized by best paper awards at the ACM SOSP conference, a Sloan fellowship (2010), an NSF CAREER award (2011), the MIT EECS Spira teaching award (2013), the MIT Edgerton faculty achievement award (2014), the ACM SIGOPS Mark Weiser award (2017), an MIT EECS Faculty Research Innovation Fellowship (2018), and an MIT EECS Jamieson award for excellence in teaching (2024). Teaching Spring 2026: 6.5660: Computer Systems Security Fall 2025: 6.1810: Operating System Engineering Spring 2025: Sabbatical Leave Fall 2024: Sabbatical Leave Spring 2024: 6.5660: Computer Systems Security Fall 2023: 6.1600: Foundations of Computer Security Spring 2023: 6.5660: Computer Systems Security Fall 2022: 6.1600: Foundations of Computer Security Spring 2022: 6.858: Computer Systems Security Fall 2021: 6.S060: Foundations of Computer Security Spring 2021: Faculty Teaching Relief IAP 2021: 6.148 (web.lab): Web programming competition (faculty sponsor) Fall 2020: 6.826: Principles of Computer Systems Spring 2020: 6.858: Computer Systems Security IAP 2020: 6.148 (web.lab): Web programming competition (faculty sponsor) Fall 2019: 6.826: Principles of Computer Systems Spring 2019: Professional Leave Fall 2018: Professional Leave Spring 2018: 6.858: Computer Systems Security IAP 2018: 6.148: Web programming competition (faculty sponsor) Fall 2017: 6.826: Principles of Computer Systems Spring 2017: 6.858: Computer Systems Security IAP 2017: 6.148: Web programming competition (faculty sponsor) Fall 2016: Sabbatical Leave Spring 2016: Faculty Teaching Relief IAP 2016: 6.148: Web programming competition (faculty sponsor) Fall 2015: Sabbatical Leave Spring 2015: 6.888: Certified Systems Software IAP 2015: 6.148: Web programming competition (faculty sponsor) Fall 2014: 6.858: Computer Systems Security Spring 2014: 6.824: Distributed Systems IAP 2014: 6.470: Web programming competition (faculty sponsor) Fall 2013: 6.858: Computer Systems Security Spring 2013: Junior Faculty Research Leave IAP 2013: 6.470: Web programming competition (faculty sponsor) Fall 2012: 6.858: Computer Systems Security Spring 2012: 6.033: Computer Systems Engineering IAP 2012: 6.470: Web programming competition (faculty sponsor) Fall 2011: 6.858: Computer Systems Security Spring 2011: 6.033: Computer Systems Engineering IAP 2011: 6.470: Web programming competition (faculty sponsor) Fall 2010: 6.858: Computer Systems Security Spring 2010: 6.857: Computer and Network Security IAP 2010: Introduction to multicore research with Beehive Fall 2009: 6.893: Computer Systems Security Spring 2009: 6.033: Computer Systems Engineering Fall 2008: 6.828: Operating System Engineering Publications Shipwright: Proving liveness of distributed systems with Byzantine participants. Derek Leung, Nickolai Zeldovich, and M. Frans Kaashoek. arXiv:2507.14080 [cs.DC], July 2025. PoWER Never Corrupts: Tool-Agnostic Verification of Crash Consistency and Corruption Detection. (Distinguished artifact award.) Hayley LeBlanc, Jacob R. Lorch, Chris Hawblitzel, Cheng Huang, Yiheng Tao, Nickolai Zeldovich, and Vijay Chidambaram. In Proceedings of the 19th USENIX Symposium on Operating Systems Design and Implementation (OSDI), Boston, MA, July 2025. Modular Verification of Secure and Leakage-Free Systems: From Application Specification to Circuit-Level Implementation. Anish Athalye, Henry Corrigan-Gibbs, Frans Kaashoek, Joseph Tassarotti, and Nickolai Zeldovich. In Proceedings of the 30th ACM Symposium on Operating Systems Principles (SOSP), Austin, TX, November 2024. Probability from Possibility: Probabilistic Confidentiality for Storage Systems Under Nondeterminism. Atalay Mert İleri, Frans Kaashoek, Nickolai Zeldovich, and Adam Chlipala. In Proceedings of the 37th IEEE Computer Security Foundations Symposium (CSF), Enschede, The Netherlands, July 2024. Private web search with Tiptoe. Alexandra Henzinger, Emma Dauterman, Henry Corrigan-Gibbs, and Nickolai Zeldovich. In Proceedings of the 29th ACM Symposium on Operating Systems Principles (SOSP), Koblenz, Germany, October 2023. Grove: a Separation-Logic Library for Verifying Distributed Systems. Upamanyu Sharma, Ralf Jung, Joseph Tassarotti, M. Frans Kaashoek, and Nickolai Zeldovich. In Proceedings of the 29th ACM Symposium on Operating Systems Principles (SOSP), Koblenz, Germany, October 2023. The K2 Architecture for Trustworthy Hardware Security Modules. Anish Athalye, M. Frans Kaashoek, Nickolai Zeldovich, and Joseph Tassarotti. In Proceedings of the 2023 Workshop on Kernel Isolation, Safety and Verification (KISV), Koblenz, Germany, October 2023. Private web search with Tiptoe. Alexandra Henzinger, Emma Dauterman, Henry Corrigan-Gibbs, and Nickolai Zeldovich. Cryptology ePrint Archive, Paper 2023/1438, September 2023. Grove: a Separation-Logic Library for Verifying Distributed Systems (Extended Version). Upamanyu Sharma, Ralf Jung, Joseph Tassarotti, M. Frans Kaashoek, and Nickolai Zeldovich. arXiv:2309.03046 [cs.LO], September 2023. Verifying vMVCC, a high-performance transaction library using multi-version concurrency control. Yun-Sheng Chang, Ralf Jung, Upamanyu Sharma, Joseph Tassarotti, M. Frans Kaashoek, and Nickolai Zeldovich. In Proceedings of the 17th USENIX Symposium on Operating Systems Design and Implementation (OSDI), Boston, MA, July 2023. Leakage models are a leaky abstraction: the case for cycle-level verification of constant-time cryptography. Anish Athalye, M. Frans Kaashoek, Nickolai Zeldovich, and Joseph Tassarotti. In Proceedings of the 1st Workshop on Programming Languages and Computer Architecture (PLARCH), Orlando, FL, June 2023. Aardvark: An Asynchronous Authenticated Dictionary with Short Proofs. Derek Leung, Yossi Gilad, Sergey Gorbunov, Leonid Reyzin, and Nickolai Zeldovich. In Proceedings of the 31st USENIX Security Symposium, Boston, MA, August 2022. Verifying the DaisyNFS concurrent and crash-safe file system with sequential reasoning. Tej Chajed, Joseph Tassarotti, Mark Theng, M. Frans Kaashoek, and Nickolai Zeldovich. In Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation (OSDI), Carlsbad, CA, July 2022. Verifying Hardware Security Modules with Information-Preserving Refinement. Anish Athalye, M. Frans Kaashoek, and Nickolai Zeldovich. In Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation (OSDI), Carlsbad, CA, July 2022. Groove: Flexible Metadata-Private Messaging. Ludovic Barman, Moshe Kol, David Lazar, Yossi Gilad, and Nickolai Zeldovich. In Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation (OSDI), Carlsbad, CA, July 2022. GoJournal: a verified, concurrent, crash-safe journaling system. Tej Chajed, Joseph Tassarotti, Mark Theng, Ralf Jung, M. Frans Kaashoek, and Nickolai Zeldovich. In Proceedings of the 15th USENIX Symposium on Operating Systems Design and Implementation (OSDI), Virtual conference, July 2021. rtlv: push-button verification of software on hardware. Noah Moroze, Anish Athalye, M. Frans Kaashoek, and Nickolai Zeldovich. In Proceedings of the 5th Workshop on Computer Architecture Research with RISC-V (CARRV), Virtual conference, June 2021. Compact Certificates of Collective Knowledge. Silvio Micali, Leonid Reyzin, Georgios Vlachos, Riad S. Wahby, and Nickolai Zeldovich. In Proceedings of the 42nd IEEE Symposium on Security and Privacy, Virtual conference, May 2021. Compact Certificates of Collective Knowledge. Silvio Micali, Leonid Reyzin, Georgios Vlachos, Riad S. Wahby, and Nickolai Zeldovich. Cryptology ePrint Archive, Paper 2020/1568, December 2020. Efficiently Mitigating Transient Execution Attacks using the Unmapped Speculation Contract. Jonathan Behrens, Anton Cao, Cel Skeggs, Adam Belay, M. Frans Kaashoek, and Nickolai Zeldovich. In Proceedings of the 14th USENIX Symposium on Operating Systems Design and Implementation (OSDI), Virtual conference, November 2020. Notary: A Device for Secure Transaction Approval. Anish Athalye, Adam Belay, M. Frans Kaashoek, Robert Morris, and Nickolai Zeldovich. ACM GetMobile: Mobile Computing and Communications Review, 24(2):34–38, September 2020. Aardvark: A Concurrent Authenticated Dictionary with Short Proofs. Derek Leung, Yossi Gilad, Sergey Gorbunov, Leonid Reyzin, and Nickolai Zeldovich. Cryptology ePrint Archive, Paper 2020/975, August 2020. Notary: A Device for Secure Transaction Approval. Anish Athalye, Adam Belay, M. Frans Kaashoek, Robert Morris, and Nickolai Zeldovich. USENIX ;login:, 45(1):12–16, March 2020. Verifying concurrent Go code in Coq with Goose. Tej Chajed, Joseph Tassarotti, M. Frans Kaashoek, and Nickolai Zeldovich. In Proceedings of the 6th International Workshop on Coq for Programming Languages (CoqPL), New Orleans, LA, January 2020. Yodel: Strong Metadata Security for Voice Calls. David Laza",
  "content_length": 36341,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:20"
}