{
  "name": "Nick Gravish",
  "homepage": "http://web.eng.ucsd.edu/~ngravish",
  "status": "success",
  "content": "Nick Gravish Assistant Professor UC San Diego Mechanical & Aerospace Engineering EBU II, Room 280 ngravish@eng.ucsd.edu http://gravishlab.ucsd.edu Google scholar Nick Gravish Assistant Professor UC San Diego Mechanical and Aerospace Engineering EBU II, Room 280 ngravish@eng.ucsd.edu Personal: http://web.eng.ucsd.edu/~ngravish/ Group web: http://gravishlab.ucsd.edu About My research focuses on applying the principles of biological systems towards the design and control of mobile robots. I am passionate about mechanical design and system dynamics, and I enjoy working at the intersection of these areas with biological locomotion research. The current research in my lab is focused on three core areas: 1) development of novel fabrication methods for bio-inspired mobile robots at small and large scales, 2) translating principles of biological legged locomotion to legged robot design and control, 3) development of bio-inspired energy efficient flapping wing robots. For more information about my current research please visit http://gravishlab.ucsd.edu Experience Postdoctoral scholar at Harvard University (2013 - 2016) School of Engineering & Applied Sciences Department of Organismic and Evolutionary Biology Advisers: Robert J. Wood and Stacey A. Combes Ph.D. in Physics at Georgia Tech School of Physics (2008 - 2013) Thesis: Collective dynamics of active and passive granular media Minor: Mechanics of materials Adviser: Daniel I. Goldman B.S. in Physics at University of California, Santa Barbara (2001 - 2005) Undergraduate Research Honors, 2004 & 2005 Teaching MAE207: Bio-inspired mobile robotics. Spring 2018, 2019 MAE 150: Computer aided analysis and design. Winter 2018, 2019 MAE 156A: Fundamental Principles of Mechanical Design I. Winter 2017, 2019. Fall 2018. MAE 3: Introduction to Engineering Graphics and Design. Spring, 2017 Calendar",
  "content_length": 1860,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:15"
}