{
  "name": "Nick Falkner",
  "homepage": "http://www.adelaide.edu.au/directory/nickolas.falkner",
  "status": "success",
  "content": "Staff Directory | Associate Professor Nickolas Falkner × Search University staff directory Login Associate Professor Nickolas Falkner Position Associate Professor/Reader Org Unit Computer Science Email nickolas.falkner@adelaide.edu.au Telephone 831 36185 Location Floor/Room 4 , Ingkarni Wardli , North Terrace View My Researcher Profile Biography/ Background 2023- : Deputy Head of School, School of Computer and Mathematical Sciences 2023 : Discipline Lead, Computer Science 2022-23 : Deputy Head of School, School of Computer Science 2021-23 : Director of Teaching Operations, School of Computer Science 2018-20: Director, Australian Smart Cities Consortium 2017- : Associate Professor, School of Computer Science, University of Adelaide 2012-2014: Associate Dean (IT), Faculty of Engineering, Computer and Mathematical Sciences 2007- : Employed as academic at the University of Adelaide 2004-2007: PhD Candidate 2003-2006: Network engineer 2000-2004: Winemaker 1996-2000: Senior Systems Administrator, School of Computer Science, University of Adelaide Awards & Achievements 2015: Stephen Cole the Elder Award for Excellence in Teaching 2012-2014: Australian Council of Deans of ICT Learning and Teaching Academy Fellowship 2013: Executive Dean's Award for Excellence in Teaching 2013: Faculty Learning and Teaching Award for Excellence in Teaching 2008: Nominated for Australian Distinguished Dissertation Award Teaching Interests I teach across the curriculum and am recognised as a leader in learning and teaching, with expertise in new approaches to course delivery and assessment strategies, both face-to-face and on-line. My goal is to engage and motivate students to learn. I have a learning and teaching blog that I used to update regularly but then everything got rather busy. My last overarching theme was \"beautiful education\" and I hope to contribute more in this space once I know what the future has in store. I am particularly interested in innovative assessment mechanisms that encourage personal development, rather than rote-learning. I try to make extensive use of new and innovative technologies, once I have established that they are actually of benefit to all concerned! In 2024, I am afraid that I have no time in my workload allocation for teaching! I am running an international exchange in June around Cyber Security and IT in Tallinn, Estonia, in conjunction with Taltech. Research Interests Research Supervision Note: I am STILL very limited in the number of students I can supervise for Masters by Research or PhD. The best way to apply is to read the section below and apply to me in e-mail. Please take the time to send me your best application first and I will take the time to read it and get back to you. As a supervisor, I expect you to be an active participant within the school's research community and also the Faculty and University community. That means attending seminars, reading lots of paper, thinking and discussing your ideas with me, other supervisors, and other academics, as needed. I'll help you with your project planning and initial methodology but I expect you to work with me and, as you progress, take more and more responsibility for your own project and research direction. (I will always be there to help you if you get stuck!) I expect to meet with most of my students at least once a week and we find that the best results tend to come when students come in and work, at Uni, over a roughly 9-5 work day, 5 days a week. For part-time students, or students with pre-existing commitments, we are flexible and you should always discuss things with me first so that I can help you, or let you know where to go to get help. Working with me, you will read a lot and you will write a lot. I turn drafts around quickly, but often with a lot of red pen showing where improvements can be made. This is 'friendly' red pen because I'm trying to help you make your work better. Your final thesis is a statement to the world of what you have done and what you have discovered - I want to help you make it the best document you can, but you will be the one doing the writing. Finally, I will try to pass on to you my excitement about research in this growing and interesting field, as well as the importance of scientific rigour, accuracy and producing work that is both interesting and useful. Applying for me to be your Supervisor If you wish to ask me to be your supervisor, I expect you to provide a brief covering e-mail, your current CV, an academic transcript for all of your qualifications and a 5 page research proposal, outlining which of my research areas you are thinking about. Please do not submit a research proposal that is composed of text that you have copied from the Internet and then mildly edited to make it read sensibly. I want to read your own words so that I can form an idea as to how and if we could work together. I am always happy to consider a candidate but I regularly tell potential students that I can't supervise them because they have obviously not checked my areas of research or they send me proposals that are obviously cut-and-pasted from Internet sources. I require a very high standard of integrity in research and scholarship, as does the University. Please, send me your own ideas in your own words. (All documents greatly preferred as PDFs, no smaller than 10 point Times New Roman, single spaced!) Areas of Research Education Research (Currently the majority of my research is in this area.) My education research interests include improving student engagement and retention, with an additional goal of developing professional skills, including problem solving abilities and the importance of a consistent ethical framework. I am always lookings for PhD student candidates for projects involving student time management, social currency and a detailed analysis of over 10 years of accumulated data on student hand-in behaviours. I welcome applicants with a social science background, who have some familiarity with computer science education and a reasonable grasp of statistics. (Any floating cognitive neuroscientists, or related psychologists, please consider applying!) My work also involves both learning and academic analytics. Network Research My areas in this area included network topologies, Internet of things, network abstraction and TOR. Big Data and Ethical Data Storage My work in networking and ethics has now extended in privacy preservation of large data repositories, while still allowin big data and ML techniques to be used across them. Security I have a great deal of interest in anonymisation and privacy preserving operations, often in conjunction with the areas above. While I am not a crypto specialist, I am fortunate enough to work with people who are and we would construct a supervisory panel that would provide the best support. Current Postgraduate Students Nhu Long Nguyen (PhD) with Hong Nguyen Isuru Mahagani Arachchige (PhD) with Thushari Atapattu and Menasha Thilakaratne Hamzah Arishi (PhD) with Christoph Treude and Thushari Atapattu (Submitted) Abhilash Sridhara (PhD) with Thushari Atapattu and Menasha Thilakaratne (Submitted) Graduated PhD/Masters Students Zarrin Tasnim Sworna (PhD) Mubin Ul Haque (PhD) Mnar Saaed Alnaghes (PhD) Hamid Tarmazdi Dung Le Ba Richard Matthews Zhigang Lu Yongrui Qin Thushari Atapattu Wenjie Ruan Dinesha Ranatunga Amir Kanan Kashefi Publications Selected publications: D Ranathunga, M Roughan, H Nguyen, P Kernick, N Falkner, \"Case Studies of SCADA Firewall Configurations and the Implications for Best Practices\", IEEE Transactions on Network and Service Management 13 (4), 871-884, 2016. Ranathunga, D., Roughan, M., Kernick, P., Falkner, N., Nguyen, H., McClintock, M., & Mihailescu, M., \"Verifiable Policy-defined Networking for Security Management\", In Proceedings of the 13th International Joint Conference on e-Business and Telecommunications (ICETE 2016) - Volume 4: SECRYPT, pages 344-351, 2016. D Ranathunga, M Roughan, P Kernick, N Falkner, \"Malachite: Firewall policy comparison\", Computers and Communication (ISCC), 2016 IEEE Symposium on, 310-317, 2016. Y Qin, QZ Sheng, NJG Falkner, S Dustdar, H Wang, AV Vasilakos, \"When things matter: A survey on data-centric internet of things\", Journal of Network and Computer Applications 64, 137-153, 2016. T. Atapattu, K. Falkner, N. Falkner, “Task-Adapted Concept Map Scaffolding to Support Quizzes in an Online Environment”, Proceedings of the 2015 ACM Conference on Innovation and Technology in Computer Science Education, 2015. H. Tarmazdi, R. Vivian, C. Szabo, K. Falkner, N. Falkner, “Using Learning Analytics to Visualise Computer Science Teamwork”, Proceedings of the 2015 ACM Conference on Innovation and Technology in Computer Science Education, 2015. T. Atapattu, K. Falkner, N. Falkner, “Educational Question Answering motivated by Question-Specific Concept Maps”, Artificial Intelligence in Education, 13-22, 2015. Y. Qin, Q. Z. Sheng, N. Falkner, W. Zhang, H. Wang, Indexing Linked Data in a Wireless Broadcast System with 3D Hilbert Space-Filling Curves Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management (CIKM 2014), Shanghai, China, Nov, 2014. N. Falkner & K. Falkner, ‘“Whither, Badges?” or “Wither, Badges!”: A Metastudy of Badges in Computer Science Education to Clarify Effects, Significance and Influence’, Koli Calling Conference, Koli, Finland, 20th-23rd November, 2014. K. Falkner, R. Vivian and N. Falkner, “Identifying Computer Science Self-Regulated Learning Strategies”, in proceedings of ITiCSE 2014, 19th Annual Conference on Innovation and Technology in Computer Science Education, Uppsala, Sweden, June 23-25, 2014. R. Vivian, K Falkner and N. Falkner, \"Addressing the challenges of a new digital technologies curriculum: MOOCs as a scalable solution for teacher professional development\", Research in Learning Technology, Volume 22, 2014. K. E. Falkner and N. Falkner, \"Supporting and ",
  "content_length": 13266,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:17"
}