{
  "name": "Nick G. Duffield",
  "homepage": "http://nickduffield.net/work",
  "status": "success",
  "content": "Work | Nick Duffield Current Positions 2014 to present: Texas A&M University, Department of Electrical and Computer Engineering, Full Professor (with tenure) 2018 to present: Director, Texas A&M Institute of Data Science 2020 to present: Texas A&M College of Engineering, Royce E Wisenbaker Professorship I Current and Recent Positions, Affiliations and Professional Service 2022 to present, Advisory Board, Mathematics for Artificial Reasoning in Science program, Pacific Northwest National Lab 2022 to present, Internal Advisory Board, Texas A&M AgriLife Institute for Advancing Health Through Agriculture 2015 to present: Professor by Courtesy, Texas A&M Computer Science and Engineering 2014 to present: Editor-at-Large, IEEE/ACM Transactions on Networking 2018 to present: Executive Board, Center for Geospatial Sciences, Applications and Technology (GEOSAT) 2015-2019: Member of Board of Directors, ACM Sigmetrics 2014-2019: Chief Editor for Big Data Networks, Frontiers in ICT 2019-2020: TEES Research Professor Publications Publication list,: Google Scholar; DBLP; MathSciNet; USPTO H-Index: 65 (Google Scholar, > 16,000 citations),  Erdös number: 2 Awards ACM Fellow, 2020; IET Fellow, 2016; AT&T Fellow, 2007; IEEE Fellow, 2005. ACM SIGMETRICS Test of Time, 2013 and 2012 Teaching Fall 2018, 2019 ECEN 758 Data Mining and Analysis Spring 2015, 2016, Fall 2017, ECEN 689 Data Mining and Analysis Fall 2014, Fall 2015: ECEN 689 Data Science for Communications Networks Current Students Mahmood Ettehad (Texas A&M Mathematics) Yixiao Feng (Texas A&M Electrical and Computer Engineering) Ziyi Zhang (Texas A&M Electrical and Computer Engineering) Peiman Mosheni (Texas A&M Computer Science and Engineering) Graduated Students Liangzhen Xia, Facebook (Texas A&M Electrical and Computer Engineering, MS 2017) Arash Abdollahzadeh, Chevron (Texas A&M Electrical and Computer Engineering, BS 2019) Yunhong Xu, Facebook (Texas A&M Electrical and Computer Engineering, PhD 2020) Hanzi Mao, Facebook AI (Texas A&M Computer Science and Engineering, PhD 2020) Current Research Projects and Collaborators AI Applications to Video Imaging in Transportation Amir Behzadan (Texas A&M Construction Science) Yalong Pi (Texas A&M Construction Science) Tim Lomax (Texas A&M Transportation Institute) Research Organizational Intelligence Jack Baldauf (Texas A&M Division of Research) Bruce Herbert (Texas A&M Libraries) Jian Tao (TAMIDS / HPRC / TEES) Machine Learning on Graphs Krishna Narayan (Texas A&M Electrical and Computer Engineering) Xiaoning Qian (Texas A&M Electrical and Computer Engineering) Arman Hasanzadeh (Texas A&M Electrical and Computer Engineering, PhD Student) Eshan Hajiramezenali (Texas A&M Electrical and Computer Engineering, Phd Student) Streaming Algorithms for Graph Sampling Nesreen Ahmed (Intel Research Labs) Data Science in Hydrology Dhruva Kathuria (Texas A&M Biological and Agricultural Engineering), PhD student) Binayak Mohanty (Texas A&M Biological and Agricultural Engineering) Network Resilience through Tomography Mahmood Ettehad (Texas A&M Math Phd Student, as advisor) Kyriakos Manouskis (Applied Communication Sciences) Gregory Berkolaiko (Texas A&M Mathmatics) Anirban Bhattacharya (Texas A&M Statistics) Advanced Traffic Measurement and Analysis Platforms K.K. Ramakrishnan (UC Riverside) Yixiao Feng (Texas A&M Electrical and Computer Engineering, as advisor) Read more about current opportunities Recent Completed Projects Rough Paths in Data Analytics Ni Hao (University of Oxford, Oxford-Man Institute of Quantitative Finance) Weijung Xu (University of Warwick, Mathematics Institute) Big Data in Transportation Byron Chigoy (Texas Transportation Institute, Research Specialist) Shawn Turner ( Texas Transportation Institute, Division Head for Mobility) Measurement in Software Defined Networking Bin Liu (Tsinghua University Hao Wu (Tsinghua University) Yunhong Xu (Texas A&M ECE PhD Student, as advisor) Minlan Yu (University of Southern California) Recent Research Funding EAGER: Real-Time: Learning-Mediated Control for Traffic Shaping, National Science Foundation, Award 1839816, 10/1/2018-9/30/2020, PI N. Duffield, Co-PI’s, K. Narayanan, S. Shakkottai, A. Talebpour,  Total $300,000 / Duffield $75,000 Advanced Traffic Analysis For Network Virtualization, 07/20/2018 to 08/31/2018, PI N. Duffield, $61,743 EAGER: III: Adaptive Sampling of Massive Graph Streams, National Science Foundation, Award 1848596 , 09/01/2018 to 08/21/2020, PI N. Duffield, Total $200,488 / Duffield $200,488 NeTS: Small: Collaborative Research: Distributed Approximate Packet Classification, National Science Foundation, Award 1618030, 9/1/2016-8/31/2019. PIs Nick Duffield (Texas A&M) & Minlan Yu (Yale). Total $350,996 / Duffield $198,346. DEDUCE: Distributed Enclave Defense Using Configurable Edges. DARPA $11,500,000, 7/1/2015-6/30/2018, Applied Communication Sciences. Texas A&M Subaward, PI: Nick Duffield. Total $11,500,000 / Duffield $389,872 Traffic Measurement from High-level Names in Software Defined Networking, Google Faculty Research Award, 2015,  $79,992, PIs N.G. Duffield and Minlan Yu (Yale). Approximation Methods for Massive Graph Analytics, Intel Corporation, 2016, PI N.G. Duffield, $30,000 Understanding Multi-Scale Hydrology: Fusion of BIG DATA from Ground Networks and Space-Based Satellites, Texas A&M Big Data Seed Grant, January 2016, PI: Binayak Mohanty (Texas A&M Biological and Agricultural Engineering); co-PI: N. Duffield. Total $50,000./ Duffield $25,000 Improving Understanding of Travel Behavior and Transportation Systems through Big Data Analytics, Texas A&M Big Data Seed Grant, January 2016, PI: Shawn Turner (Texas A&M Transportation Institute) co-PI: N. Duffield. Total $50,000 / Duffield $25,000 Boosting Attack Identification through Correlated System & Network Monitoring. Texas A&M Cybersecurity Seed Grant, January 2016,. PI: N. Duffield, co-PI: Guofei Gu (Texas A&M Computer Science and Engineering). Total  $50,000 / Duffield $25,000 Recent Short Term Research Visits 7/17/2017-7/28/2017, Alan Turing Institute, London, UK 7/3/2017-7/14/2017, Computer Science, University of Warwick, UK 6/20/2016-7/15/2016, Intel Research, Santa Clara, CA 7/1/2015-7/31/2015, Oxford-Man Institute of Quantitative Finance Recent Talks 3/29/2017: University of Utah, Salt Lake City, UT 2/6/2017: Tulane University, New Orleans, LA 12/5/2016: Keynote, 2016 BigGraphs Workshop at IEEE BigData’16, Washington, DC 11/29/2016: Yale University, New Haven, CT 7/13/2016: Intel Research, Santa Clara, CA 7/8/2016: University of Southern California 1/21/2016: Informatics Institute, University of Florida 11/2015: University of Texas at Austin 12/6/2014: Keynote, IPCCC, Austin TX 9/12/2014: Invited talk, Heilbronn Conference, Bristol, UK 8/2014: Sampling for Big Data: A Tutorial (with G. Cormode), ACM SIGKDD 2014 2/26/2014: Big Data Lecture Series, University of Illinois at Urbana Champaign 2/11/2014: Computer Engineering Eminent Scholar Seminar, Texas A&M University 12/10/2013: Facebook, Menlo Park CA 12/10/2013: Google, Mountain View CA 11/13/2013: Invited Speaker and Panelist, Big Data in the Mathematical Sciences, Warwick University 09/11/2013: Keynote Speaker, ITC 25, Shanghai Recent Service Technical Program Committee, WWW 2018 Technical Program Committee, IEEE Big Data Conference 2017 Technical Program Committee, IFIP Performance 2017 Program Committee 2016 BigGraphs Workshop at IEEE BigData’16 Scientific Programme Committee, 9th Bernoulli/IMS World Congress in Probability and Statistics, Toronto 2016 Chief Editor for Big Data, Frontiers in ICT, since October 2014 Editor-at-Large, IEEE/ACM Transactions on Networking, since September 2014 TPC, International Workshop on Traffic Monitoring Analysis (TMA). Barcelona, April 2015 TPC, IEEE International Conference on Network Protocols, ICNP 2014 TPC, Workshop on MAthematical performance Modeling and Analysis, MAMA 2014 TPC Co-Chair, IFIP Performance 2013, Previous Positions and Education 2013-2014: Rutgers University / DIMACS, NJ: Research Professor 1995-2013: AT&T Labs-Research, NJ:  Distinguished Member of Technical Staff (final level) and AT&T Fellow. 1986-1995: Post-doc and faculty positions in Dublin, Ireland and Heidelberg, Germany. 1983-1986: Queen Mary College, University of London, PhD, Mathematical Physics (1987) 1979-1983: Christ’s College, University of Cambridge, BA Natural Sciences (1982) and MMath (Part III Maths, 1983), MA (1986) Previous Research Areas Data Analytics and Mobility Modeling in Cellular Networks Machine Learning in Network Management: Exploring the complex causal relationships between measurable network behavior and customer experience Optimal Sampling (including Smart Sampling of Flow Records): Developing efficient sampling algorithms that provably optimize trade-off between sample size and estimation variance, even for heavy-tailed distributions typical in the Internet. Structure aware sampling for more accurate range queries. Fair sampling over subpopulations. Versions currently deployed in network measurement infrastructure. Architectures for Fine Grained Traffic Measurement: Router level data structures for storage and retrieval of delay measurements. Enhancing performance measurement through temporal locality, Graph Sampling: unbiased node sampliing in P2P networks. Network Security and Attack Detection: stress testing traffic, machine learning of flow classifiers Performance Monitoring. Sampling for temporal loss patterns, now standardized in the IETF. Trajectory Sampling. Coordinate packet sampling across routers based on hash of invariant packet fields. Now standardized in the IETF. Network Tomography. Traffic Matrices: inferring traffic matrices from link level traffic aggregates. Deployed in network measurement infrastructure. Link Performance: inferring link level loss and delay by correlating end-to-end measurements across a mesh of paths. Support for reporting by transport protocols standardized ",
  "content_length": 11211,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:15"
}