{
  "name": "Niclas Boehmer",
  "homepage": "https://hpi.de/en/research/research-groups/algorithmic-decision-making-and-society",
  "status": "success",
  "content": "Algorithmic Decision Making and Society | Hasso-Plattner-Institut Prof. Dr. Niclas Böhmer Algorithmic Decision Making and Society The Algorithmic Decision Making and Society group designs and analyses algorithms that make decisions for groups of individuals with competing interests. As algorithms increasingly shape our lives, we study and formalize what characterizes good and fair decision making. Our research spans multiple disciplines, including the aggregation of preferences into collective decisions (studied in social choice), individual and group fairness in AI selection systems, and the (sequential) allocation of scarce resources in areas like public health. Our interdisciplinary approach integrates AI, combinatorial optimization, economics, game theory, and reinforcement learning to create theoretically grounded systems with a positive societal impact. Prof. Dr. Niclas Böhmer Function Head of Algorithmic Decision Making and Society Room V-1.01 Phone: +49 331 550-9196 Mail: niclas.boehmer@hpi.de More about prof. böhmer Office Svenja Fenn Office Assistant for Algorithmic Decision Making and Society Phone: +49 331 5509-198 Mail: office-boehmer@hpi.de Further Information HomeTeamPublicationsTeachingNews & Events HPI, Hasso Plattner Institute, Prof. Dr. Niclas Böhmer + Team Department \"Algorithmic Decision Making and Society\", Potsdam, 01/12/2025, Photo: Nicole Krüger HPI, Hasso Plattner Institute, Prof. Dr. Niclas Böhmer + Team Department \"Algorithmic Decision Making and Society\", Potsdam, 01/12/2025, Photo: Nicole Krüger HPI, Hasso Plattner Institute, Prof. Dr. Niclas Böhmer + Team Department \"Algorithmic Decision Making and Society\", Potsdam, 01/12/2025, Photo: Nicole Krüger Last change: 08/07/2025, Mareike-Vic Schreiber",
  "content_length": 1755,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:20"
}