{
  "name": "Nicolas R. Gauger",
  "homepage": "https://www.scicomp.uni-kl.de/team/gauger",
  "status": "success",
  "content": "Prof. Dr. Nicolas R. Gauger | Scientific Computing Home About Scientific Computing About us Contact and Directions News Events 27th EuroAD Workshop 2025 Workshop on Coupled Adjoints 2022 Summer School on SU2 2017 Team Prof. Dr. Nicolas R. Gauger Johannes Blühdorn Dr. Ole Burghardt Dr. Long Chen Lea Fischer Tobias Kortus Dr. Alexander Linke Maoni Ngowa Msinda Dr. Emre Özkaya Rohit Pochampalli Jan Rottmayer Dr. Max Sagebaum Alexander Schilling Guillermo Suarez Martinez Prof. Dr. Ralf Keidel Job Offers Research SIVERT (pCT) Algorithmic Differentiation in High-Energy Physics Machine Learning for Turbulence Modeling Hybrid RANS/LES Simulation for Turbulent Flows Aeroacoustic Prediction and Optimization Optimal Flow Control Optimization of Aero Engines One-Shot Optimization Software adjoint-PETSc CoDiPack Derivgrind MeDiPack OpDiLib SU2 Teaching Algorithmic Differentiation Scientific Computing Seminar Special Topics in Scientific Computing Publications Prof. Dr. Nicolas R. Gauger Chairholder for Scientific Computing and Director of Computing Center (RHRZ) University of Kaiserslautern-Landau (RPTU) Bldg/Geb 34, Paul-Ehrlich-Strasse 67663 Kaiserslautern, Germany Office:  34-312 Phone: +49 (0)631 205 5635 (direct) Phone: +49 (0)631 205 2265 (Secretary) Fax:   +49 (0)631 205 3056 Email:   nicolas.gauger@scicomp.uni-kl.de Nico Gauger is Full Professor at the Department of Mathematics as well as Department of Computer Science. He holds the Chair for Scientific Computing and directs the Computing Center (RHRZ) at RPTU. > Short CV > Research Team / SciComp Team > Research Areas and Projects > Team at Computing Center (RHRZ) > Teaching > Publications > Talks > Videos Upcoming Events Thu23Oct2025Thu26Feb2026 Seminar Talks! Please contact us Tue02Dec2025 SciComp Workshop13:00 Tue02Dec2025 SC Seminar: Jan Kieseler15:15 News Release of OpDiLib v2.0.0 17. November 2025 Teaching Award for Prof. Gauger 26. June 2025 Dr. Max Aehle Awarded for Outstanding Dissertation by the Freundeskreis of RPTU 15. May 2025 New Project “AI Care”: Fighting cancer with AI 7. November 2023 Workshop on Coupled Adjoints at TU Kaiserslautern 11. October 2022 Release of CoDiPack 2.0 8. September 2021 Release of OpDiLib v1.0 24. February 2021 New Project SIVERT: Fighting cancer with AI 1. October 2020 Dashboard | Impressum | Wiki | © 2024 Chair for Scientific Computing, RPTUWordPress Theme by Simple Themes",
  "content_length": 2402,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:35"
}