{
  "name": "Nicole Megow",
  "homepage": "https://cslog.uni-bremen.de/nmegow",
  "status": "success",
  "content": "Prof. Dr. Nicole Megow - Universität Bremen Prof. Dr. Nicole MegowUniversität Bremen FB3: Mathematik/Informatik Bibliothekstr. 5 28359 Bremen Germany Office: MZH 3310 Phone: +49 (421) 218-63581Email Office hours: by appointmentBioNicole Megow studied Mathematics at TU Berlin and the Massachusetts Institute of Technology, USA. She received her PhD from TU Berlin in 2006 under the supervision of Rolf Möhring. She was postdoc and senior researcher at the Max Planck Institute for Informatics, Saarbrücken, held n interim professorship in Discrete Optimization at TU Darmstadt (2011-12), and led an Emmy Noether Research Group at TU Berlin starting in 2012. Subsequently, she was an assistant professor for Discrete Mathematics at TU Munich. Since 2016, she has held the Chair of Combinatorial Optimization in the Faculty of Mathematics and Computer Science at the University of Bremen.Her research has been recognized with several awards, including the Dissertation Award of the German Operations Research Society (2007) and the Berlin Science Award for Young Researchers (2013). In the same year, she received the Heinz Maier-Leibnitz Prize, the most prestigious German award for early-career researchers, jointly presented by the German Research Foundation (DFG) and the Federal Ministry of Education and Research (BMBF). She was an elected member of the Elisabeth-Schiemann-Kolleg of the Max Planck Society (2013–2016) and was twice listed among Germany’s \"Top 40 Under 40\" (Capital, 2014, 2015). Since 2020, she has been an elected member of the DFG review board for Theoretical Computer Science.Nicole Megow's research focuses on mathematical optimization and the design and analysis of algorithms, with an emphasis on decision-making under uncertainty and learning-augmented algorithms. She is a member of Cluster of Excellence The Martian Mindset and contributes actively to the high profile area Minds, Media, Machines, the research cluster Dynamics in Logistics and the Data Science Center.Research Interests Combinatorial optimization, discrete optimizationEfficient algorithms, approximation algorithmsScheduling, resource allocation, packing, network design, routingUncertainty models: online, stochastic, robust, explorablePublicationsFind here a fairly complete list of publications.Other listing can be found at DBLP and Google Scholar .TeachingSee the group's teaching page.List of supervised theses (bachelor/master). Current Phd Students and Postdocs Max Stahlberg, postdoc, (since 2025)Joes Biburger, PhD student (since 2025)Sarah Morell, postdoc (since 2025)Bart Zondervan, PhD student (since 2024)Zhenwei Liu, PhD student (jointly with Guochuan Zhang, since 2023)Alexander Lindermayr, PhD student (2020-2024), postdocPrevious postdocs and phd students: hereServiceMember of the DFG Review Board for Computer Science, since 2020Member of the Tenure Board of the University of Bremen, since 2022Member of the Doctoral Committee (Promotionsausschuss) for Math/CS at the University of Bremen, since 2022Member of the Faculty Council (Fachbereichsrat) for Math/CS at the University of Bremen, since 2018Member of the Advisory Board of BYRD (Bremen Early Career Research Development), since 2024Program Committees SODA 2026, IPCO 2025 (chair), SODA 2025, ISAAC 2024, ICALP 2024, APPROX 2023 (chair), ACDA 2023, STOC 2023, FSTTCS 2022, IPCO 2022, STACS 2022, SOSA 2022,FCT 2021, ACDA 2021, MFCS 2021, SODA 2021, APPROX 2020, ESA 2019,WAOA 2019 (PC co-chair), ISAAC 2019, ALENEX 2019, WAOA 2017, APPROX 2017, SEA 2017, MAPSP 2017, SODA 2017, WAOA 2016, APPROX 2016, Euro-Par 2016, STACS 2016, WAOA 2015, APPROX 2015, ITCS 2015, ESA 2013, SEA 2013, WAOA 2012, CATS 2012, MAPSP 2009.Editorial Work Operations Research (since 2024)Discrete Optimization (since 2015)Journal of Scheduling (since 2014)SIAM Journal on Discrete Mathematics (2017-2023)Discrete Mathematics & Theoretical Computer Science (2015/16)Operations Research Letters (2013-2018)Organization of Dagstuhl Seminar 25471: Online Algorithms beyond Competitive Analysis (with Sungjn Im, Debmalya Panigrahi, Sahil Singla), 2025ICALP 2025 Satellite Workshop on Theory and Applications of Algorithms with Predictions, Aarhus, Denmark, July 2025Dagstuhl Seminar 25121: Scheduling and Fairness (with Claire Mathieu, Benjamin Moseley, Frits Spieksma), 2025Bremen Workshop on Combinatorial Reconfiguration and Beyond (with Daniel Schmand and Sebastian Siebertz), Bremen, November 2024Workshop on Matroid-Constrained Optimization Problems (with Kristóf Bérczi and Chien-Chung Huang), Paris, France, April 2024 ICALP 2023 Satellite Workshop on Recent Trends in Online Algorithms , Paderborn, Germany, July 2023Dagstuhl Seminar 23061: Scheduling beyond the Worst Case (with Benjamin Moseley, Ola Svensson, David Shmoys, Sergei Vassilvitskii), 2023.Gauß in Bremen, DMV Gauß Lecture (with Anke Pohl), Speakers: Valentin Blomer (Bonn) and Antje Boetjus (Bremen), 2021.Dagstuhl Seminar: Scheduling and Transportation (with Ola Svensson and David Shmoys), 2020.Scheduling Meets Fixed-Parameter Tractability (with Matthias Mnich and Gerhard Woeginger), at Lorentz Center Leiden, 2019.Dagstuhl Seminar: Scheduling and Networks (with Magnus M. Halldorsson and Cliff Stein), 2018.MAPSP 2017, June 12-16, 2017 at Kloster Seeon, with Susanne Albers and Andreas S. Schulz.Dagstuhl Seminar: Scheduling (with Nikhil Bansal and Cliff Stein), 2016.ProjectsOptimization under Explorable Uncertainty, German Research Foundation (DFG), 2023-2026How robots learn how to uses structure (with Daniel Schmand and Sebastian Siebertz), seed grant of the research cluster Minds, Media, Machines (MMM), 2022-2024Scheduling Invasive Multicore Programs Under Uncertainty within TCRC 89: Invasive Computing (InvasIC), DFG, 2018-2022Query complexity meets optimization under uncertain input (with Christoph Dürr), Bayerisch-Französisches Hochschulzentrum (BFHZ), 2016.Design and Operation of Infrastructure Networks under Uncertainty, ECMath Einstein Center for Mathematics (with Martin Skutella), 2014-2017Scheduling under Uncertainty: On Performance-Adaptivity Tradeoffs, German Research Foundation (DFG), Emmy Noether Programme, 2012-2017Algorithms for Combinatorial Optimization Problems on Uncertain Inputs, Group of Eight Australia - Germany co-operation scheme (with Julian Mestre), 2013-2014Scheduling on Unreliable Machines: On Performance-Adaptivity Tradeoffs, German Research Foundation (DFG), bilateral cooperation with The University of Sydney (with Julian Mestre), 2011-2012 Updated by: Lukas BarningRSSPrint pageScroll to the bottom of the pageScroll to the top of the page",
  "content_length": 6621,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:37"
}