{
  "name": "Nicolas Markey",
  "homepage": "http://www.lsv.ens-cachan.fr/~markey",
  "status": "success",
  "content": "Nicolas Markey Nicolas Markey Researcher in Computer Science at CNRS Contact informations E-mail nicolas.markey@cnrs.fr Administrative situation I have been a CNRS researcher since october 2004. I am currently on leave of absence, working as a secondary-school teacher, since september 2024. Research interests My research works focus on formal methods for verification and synthesis of reactive systems. In particular: model checking, temporal logics quantitative aspects of verification games for synthesis Research activities My publication list: Full list with abstracts and papers DBLP https://orcid.org/0000-0003-1977-7525 Google Scholar My CV[last updated:09/01/2024] Students Ph.D. students Nicolas Waldburger (2021-2024). Former Ph.D. students Emily Clement (2018-2022). Robustness of timed automata: computing the maximally-permissive strategies Suman Sadhukhan (2018-2021). A Verification Viewpoint on Network Congestion Games Léo Henry (2018-2021). There and back again: formal methods and model learning for real-time systems Victor Roussanaly (2017-2020). Efficient verification of real-time systems Mauricio González (2016-2019). Stochastic games on graphs with applications to smart-grid optimization Samy Jaziri (2015-2019). Automata over timed domains Patrick Gardy (2013-2017). Semantics of Strategy Logic Daniel Stan (2013-2017). Randomized strategies in concurrent games Ocan Sankur (2010-2013). Robustness in Timed Automata: Analysis, Synthesis, Implementation Romain Brenguier (2009-2012). Nash Equilibria in Concurrent Games — Application to Timed Games Arnaud Da Costa-Lopes (2007-2011). Propriétés de jeux multi-agents Ghassan Oreiby (2005-2008). Logiques temporelles pour le contrôle temporisé Post-doc. students Former post-doc. students Aline Goeminne (2021-2022) Vincent Jugé (2016-2017). Maximilien Colange (2015-2016). Amélie David (2015-2016). Mickaël Randour (2014-2015). Raj Mohan Matteplackel (2013-2015). Michael Ummels (2010-2012). Delphine Longuet (2008-2009). Thomas Brihaye (2006-2007).",
  "content_length": 2027,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:35"
}