{
  "name": "Nicola Conci",
  "homepage": "https://webapps.unitn.it/du/en/Persona/PER0003698/Curriculum",
  "status": "success",
  "content": "Nicola Conci | CV | University of Trento Nicola Conci Associate professor Department of Information Engineering and Computer Science Via Sommarive, 5 - 38123 Povo tel. 0461 283919 nicola.conci[at]unitn [dot] it Expertise: Activity recognition and understanding Audio/video streaming Cognition Complex systems Computer vision Data management Digital signal processing Methods of analysis Multimedia Multimedia analysis Scene understanding Signal processing Uncertainty analysis Video tracking Virtual reality Education Nicola Conci received his PhD degree from the international ICT Doctoral School of Trento, Italy, in 2007. In 2008 he was post Doctoral Researcher at Create-NET, leading the video coding research activities for the EU-Project MING-T (VI Framework Programme RTD – IST). In 2008 and 2009, he was research assistant in the Multimedia and Vision Group at the Queen Mary, University of London (UK). Academic career and teaching activities Nicola Conci is Associate Professor at the Dept. of Information Engineering and Computer Science, University of Trento (Italy), where he teaches the courses of Computer Vision and Multimedia Analysis (M.Sc. in Information Eng, M.Sc Computer Science, M.Sc. Mechatronics) and Multimedia communications (B.Sc in Information Engineering). He received his PhD degree from the international ICT Doctoral School of Trento, Italy, in 2007. In 2008 he was post Doctoral Researcher at Create-NET, leading the video coding research activities for the EU-Project MING-T (VI Framework Programme RTD – IST). In 2008 and 2009, he was research assistant in the Multimedia and Vision Group at the Queen Mary, University of London (UK). His research interests are in the field of image and video analysis for human behavior analysis in monitoring and surveillance applications. The research activities focus on the classification of dyadic interactions, as well as the extraction of behavioral patterns from crowded scenes, for motion segmentation, anomaly detection and path prediction. In video surveillance he is also interested in studying cooperative camera networks, with focus on the coverage optimizationof the observed scene. With this regard he has been awarded, as co-author of the paper, the ‘excellent paper award’ (top 3) at the IEEE Int’l Conference on Distributed Smart Cameras (ICDSC2013). He has been actively involved in various project activities, including the local coordination of the project UNCAP (H2020). At the University of Trento he is currently coordinating the M.Sc degree in Information Engineering and Communications, local coordinator of the EIT Master in Visual Computing and Communications, and member of the Executive Committee of the ICT Ph.D School. Research interests His research interests are in the field of multimedia analysis for human behavior recognition in monitoring and surveillance applications. The research activities focus on the classification of dyadic interactions, as well as the extraction of behavioral patterns from crowded scenes, for motion segmentation, anomaly detection and path prediction. With specific application to the video surveillance domain his research targets cooperative camera networks, with focus on the coverage optimization of the observed scene. With this regard he has been awarded, as co-author of the paper, the ‘excellent paper award’ (top 3) at the IEEE Int’l Conference on Distributed Smart Cameras (ICDSC2013). Research work Human Behavior Analysis - Image and video processing plays a fundamental role in many new types of application areas (surveillance, ambient assisted living, etc.) in which humans still play a central role.  The goal of such systems is now to mimic the human understanding capabilities in order to automatically interpret the observe scene. The solution typically lies at the crossroads of different research areas from psychology to image processing and computer vision, etc. This opens to a number of interesting yet challenging research problems, including the behavior analysis at different spatiotemporal scales, also considering the inherent uncertainty of machine in detecting human activities. In this research area, Prof. Conci has been investigating several different facets of behavior analysis, at different levels of abstraction, including trajectory analysis, or interactions with the salient areas of the environment. However, in some situations the mere analsysis of the spatio-temporal cues may not provide an accurate representation of the event occurring in the scene, thus requiring the investigation additional elements, such as the social dimension, to better describe the human bahvior. In this area, Prof. Conci has contributed to the development of different methods for the analysis of human social interactions by exploiting local motion features and proxemics information. Another promising area of research is represented by the analysis of people motion at a larger and denser scale, usually referred to as crowd motion analysis. In such situations, behaviors cannot be learned by looking at single moving subjects due to the continuous cluttering and occlusions. Preliminar results in segmentation and identification of anomalies have been proposed using graph-cuts and gaussian mixtures. The detection and localization of events of interest occurring in the scene, does in general also depend on the quality of images captured by the cameras deployed in the environment. For this reason, a particular attention should also be devoted to understanding what can be the most adequate positioning of the sensing infrastructure. Due to the impossibility of solving the optimization problem analytically we have proposed a stochastic algorithm for the global and local coverage optimization, so as to maximize the visibility on the entire environment, but also to make maintain a good quality of view for the targets moving in the scene. Memberships in societies and scientific committees Member IEEE Member ACM Member CNIT (www.cnit.it) Member GTTI (www.gtti.it) Member CVPL (www.cvpl.it) Awards and honours - Best Student Paper Award, ACM Mobimedia 2006, Alghero (Italy) - Premio Andrea Scuri, funded by the Andrea Scuri Association, for the development of Low-Cost Human Machine Interfaces - Excellent Paper Award (top 3 papers) for the paper \"Optimal configuration of PTZ camera networks based on visual quality assessment and coverage maximization” by Krishna Konda Reddy and Nicola Conci at the 7th ACM/IEEE International Conference on Distributed Smart Cameras (ICDSC 2013) - Co-recipient of the grant Make A Change 2011 for the best social business proposal for new startups Other work Area Chair and TPC Member of the IEEE International Conference on Image Processing (ICIP) 2019 and 2021.General Co-Chair of the International Conference on Distributed Smart Cameras, held in Trento(Italy), 2019General Co-Chair of the Symposium Signal Processing for Understanding Crowd Dynamics, held at IEEE AVSS 2017 (Lecce, Italy)Technical Program Co-Chair of the Symposium Signal Processing for Understanding Crowd Dynamics, IEEE GlobalSip 2016 (Washington DC, USA).Organizer of the task Synchronization of Multi-User Event Media at the workshop MediaEval 2014 and 2015Local Chair for the ACM International Conference on Multimedia Retrieval – ICMR2011 (Trento)",
  "content_length": 7333,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:23"
}