{
  "name": "Nico Roos",
  "homepage": "https://dke.maastrichtuniversity.nl/nico.roos",
  "status": "success",
  "content": "Nico Roos | Homepage of Nico Roos Skip to content Welcome Nico Roos is an associate professor at the Department of Advanced Computing Sciences of the Faculty of Science and Engineering at Maastricht University (UM). Nico Roos joint the Department of Advanced Computing Sciences in 1995. Since 1998, he has been coordinating the Agent Technology group, and since 2009, the Robots Agents and Interaction research group and the Robotlab of the Department of Advanced Computing Sciences. Together with Pieter Collins, Nico Roos started the Explainable Artificial Intelligence (XAI) research theme of the Department of Advanced Computing Sciences in 2017. Nico Roos has a background in electrical engineering and computer science. In 1991, he received his PhD from the Delft University of Technology for his research on the handling of inconsistent and uncertain information. From the beginning of 2008 until the end of 2010, Nico Roos has been the Director of Studies for the bachelor program Data-Science and Artificial Intelligence, and the master programs Artificial Intelligence and Data Science for Decision Making. In the same period, he was a member of the Board of the Department of Advanced Computing Sciences. Nico Roos has been the chair of the faculty council for 8 year, he has been a member and the chair of the Board of Examiners and the Board of Admission, and he has been a member of the Program Committee for the bachelor program and the two master programs. He has been a member of the board for the Maastricht University excellence program Marble for 12 years. Currently, he is a member of the Country Team China of Maastricht University, he is the chair of the Assessment Committee of the Department of Advanced Computing Sciences, and he is a member of the Board of Appeal for Exams (College van Beroep voor de Examens – CBE) of Maastricht University. Nico Roos is also a member of Program Management Team for the new bachelor program Brain Science; a collaboration between the faculties FPN, FHML and FSE.",
  "content_length": 2024,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:21"
}