{
  "name": "Nicolas Flammarion",
  "homepage": "https://people.epfl.ch/nicolas.flammarion",
  "status": "success",
  "content": "Nicolas Flammarion — People - EPFL Nicolas Flammarion Editer le profil nicolas.flammarion@epfl.ch +41 21 693 27 37 https://scholar.google.com/citations?user=7nVGYfgAAAAJ&hl Professeur assistant tenure track, Laboratoire de théorie en apprentissage automatique EPFL IC IINFCOM TML INR 110 (Bâtiment INR) Station 14 1015 Lausanne +41 21 693 27 37 +41 21 693 52 26 Local: INR 110 EPFL > IC > IINFCOM > TML Professeur assistant tenure track, SSC - Enseignement EPFL > IC > IC-SSC > SSC-ENS Web site: Site web: https://ssc.epfl.ch Membre de la commission du programme doctoral, Programme doctoral Informatique et communications EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDIC-GE Web site: Site web: https://go.epfl.ch/phd-edic Professeur assistant tenure track, EDEE - Enseignement EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDEE-ENS vCard Données administratives Biographie Nicolas Flammarion is a tenure-track assistant professor in computer science at EPFL. Before that, he was a postdoctoral fellow at UC Berkeley, hosted by Michael I. Jordan. He received his PhD in 2017 from Ecole Normale Superieure in Paris, where he was advised by Alexandre d’Aspremont and Francis Bach. In 2018, he received the prize of the Fondation Mathématique Jacques Hadamard for the best PhD thesis in the field of optimization, in 2021, he was one of the recipients of the NeurIPS Outstanding Paper Award, and in 2024, he received a Trust & Safety Google Research Award. His research focuses on learning problems at the intersection of machine learning, statistics, and optimization. He aims to develop algorithmic and theoretical tools that improve our understanding of machine learning and increase its robustness and usability.Complete CV Show more Enseignement & Phd Enseignement Computer Science Communication Systems Doctorants D'Angelo Francesco, Papazov Hristo Georgiev, Varre Aditya Vardhan, Yüce Gizem, Yüksel Oguz Kaan, A dirigé les thèses EPFL de Andriushchenko Maksym , Pesme Scott William , Vladarean Maria-Luiza , close Liste complète des adresses et fonctions EPFL IC IINFCOM TML Professeur assistant tenure track Statut:  Personnel EPFL IC IINFCOM TML INR 110 (Bâtiment INR) Station 14 1015 Lausanne +41 21 693 27 37 +41 21 693 52 26 Local: INR 110 EPFL > IC > IINFCOM > TML EPFL IC IC-SIN SIN-ENS Professeur assistant tenure track Statut:  Personnel EPFL > IC > IC-SIN > SIN-ENS EPFL IC IC-SSC SSC-ENS Professeur assistant tenure track Statut:  Personnel EPFL > IC > IC-SSC > SSC-ENS EPFL VPA-AVP-DLE AVP-DLE-EDOC EDIC-GE Membre de la commission du programme doctoral Statut:  Personnel EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDIC-GE EPFL VPA-AVP-DLE AVP-DLE-EDOC EDEE-ENS Professeur assistant tenure track Statut:  Personnel EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDEE-ENS",
  "content_length": 2750,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:30"
}