{
  "name": "Nicole Jochems",
  "homepage": "https://www.imis.uni-luebeck.de/de/institut/team/nicole-jochems",
  "status": "success",
  "content": "Univ.-Prof. Dr.-Ing. Nicole Jochems Dipl.-Inform. | IMIS - Universität zu Lübeck Direkt zum Inhalt Institut Professuren Team IMIS Kontakt Anfahrt Forschung Forschungsschwerpunkte Forschungsthemen Forschungsprojekte Publikationen Lehre Lehrbereiche Bachelorarbeiten Masterarbeiten Sonstige Arbeiten Transfer Transferbereiche Wissenstransfer Transferprojekte Weiterbildung Aktuelles News Stellenangebote Search Univ.-Prof. Dr.-Ing. Nicole Jochems Dipl.-Inform. Institutssprecherin, Leiterin des Studiengangs Medieninformatik, Professorin für Medieninformatik Institut für Multimediale und Interaktive Systeme Universität zu Lübeck , Gebäude 64 , Raum 1.004 Ratzeburger Allee 160 D-23562 Lübeck Tel: +49 451 3101 5110 Fax: +49 4513101 5104 E-Mail: nicole.jochems [at] uni-luebeck.de Allgemeines Zur Person Prof. Dr. Nicole Jochems ist seit 2013 Professorin für Medieninformatik an der Universität zu Lübeck. Nach dem Studium der Informatik an der RWTH Aachen, wechselte Sie an das Institut für Arbeitswissenschaft und promovierte dort 2009 zur Dr.-Ing im Themenfeld der altersdifferenzierten Gestaltung von Mensch-Maschine-Systemen. Ihre Promotion wurde mit der Borschers-Plakette der RWTH Aachen sowie dem Walter-Rohmert Forschungspreis gewürdigt. Von 2009 bis 2013 leitete Sie als Oberingenieur die Forschungsgruppe Ergonomie und Mensch-Maschine-Systeme am gleichen Institut. Frau Prof. Jochems ist: - Sprecherin des Instituts für Multimediale und Interaktive Systeme - Leiterin der Forschungsgruppe Medieninformatik - Studiengangsleiterin des Bachelor- und Masterstudiengangs Medieninformatik. - Mitglied im Stiftungsrat der Universität zu Lübeck https://www.uni-luebeck.de/structure/stiftungsrat.html - Mitglied im Scientific Advisory Board der AHFE (Applied Human Factors and Ergonomics) - Mitglied im Zentrum für Bevölkerungsmedizin und Versorgungsforschung der Universität zu Lübeck (ZBV). - Mitglied im Center for Open Innovation in Connected Health (COPICOH). Professur Professur für Medieninformatik Curriculum Vitae 1999- 2004 Studium der Informatik mit Anwendungsfach Psychologie und Vertiefungsgebiet Datenmanagement und Datenexploration an der RWTH Aachen 2004 Diplom in Informatik (Dipl.-Inform.) an der RWTH Aachen 2004 - 2005 wissenschaftliche Mitarbeiterin am Lehrstuhl für Datenmanagement und Datenexploration an der RWTH Aachen 2005 - 2009 wissenschaftliche Mitarbeiterin am Institut für Arbeitswissenschaft der RWTH Aachen 2009 Promotion an der RWTH Aachen (Dr.-Ing.) zum Thema \"Altersdifferenzierte Gestaltung der Mensch-Rechner-Interaktion\" 2009 - 2013 Oberingenieurin und stellv. Abteilungsleiterin der Forschungsgruppe Ergonomie und Mensch-Maschine-Systeme am Institut für Arbeitswissenschaft, RWTH Aachen 2010 Walter-Rohmert-Forschungspreis 2010 Förderpreis \"Alter und Arbeit\" der Marie-Luise und Ernst Becker Stiftung Projektvorhaben: \"Altersdifferenzierte Arbeitsplatzgestaltung auf Basis digitaler Menschmodelle\" 2011 Borchers Plakette der RWTH Aachen seit 2013 Universitätsprofessorin (W2) für Medieninformatik am Institut für Multimediale und Interaktive Systeme der Universität zu Lübeck seit 2022 Sprecherin des Instituts für Multimediale und Interaktive Systeme seit 2025 W3-Professorin für Medieninformatik Projekte Geleitete Projekte AgeVR Age-Differentiated Design of Immersive Virtual Environments LABORATORIUM KI-gestützte individuelle Lernassistenz im Skills Lab für patientenzentrierte und interprofessionelle Kommunikation in den Gesundheitsberufen. PiTiPS Partizipation und Co-Creation für innovative Technologien für informell Pflegende und Sorgegemeinschaften VernetzBar Lübeck Digitale Plattform zur Prävention und Förderung des psychischen Wohlbefindens für Jugendliche und junge Erwachsene Digital Explorer Digitales Qualifizierungsprogramm für Schüler:innen MaTZ Initiative für Medienkompetenz, achtsame Technikentwicklung und digitale Zukunftsthemen ImPresVR Presence in immersive Virtual Reality STUDYhealth Datenbrillen in der Ausbildung von Pflegekräften ReNaApp Steigerung der Langzeiteffekte onkologischer Rehabilitation durch eine Nachsorge-App Ambient Care Ambient Care Historytelling Altersgerechten Gestaltung von Mensch-Technik-Schnittstellen ParkProTrain Individualisiertes Trainingsprogramm für Parkinson-Patienten ACTIVATE An Ambient System for Communication, Information and Control in Intensive Care Publikationen Publikationen Balke, N. ,  & Jochems, N. (2025)Who Gets to Participate? An Exploration of Participatory Interfaces in (Semi-) Public SpacesProceedings of Mensch und Computer 2025, 783-788. https://doi.org/10.1145/3743049.3748591Zitieren Dresel, M. , Wortmann, R. , Siraf, P. , Fuchs, L. ,  & Jochems, N. (2025)Enabling Exploratory Yet Systematic Investigation of Presence Factors in Virtual Reality: Proposed Methodology, Research Tool Development, and Practical ApplicationVirtual Worlds, 4(2). https://doi.org/10.3390/virtualworlds4020024Publikation herunterladenZitieren Schaller, M. , Volkmann, T. , Unger, A. , Jochems, N. ,  &  Fischer, F. (2025)Implizites Wissen explizit machen: Umgang mit gesellschaftlich geprägten Vorstellungen und Stereotypen in der partizipativen Technikentwicklung In Soziotechnische Transformationen im Sozial- und Gesundheitswesen: kollaborativ, divers, barrierefrei und sozialräumlich (pp. 84-99). Beltz. Zitieren Dresel, M. ,  Docenko, O. , Schrills, T. ,  & Jochems, N. (2024)Does It Break the Presence? Using Procedurally Generated Virtual Environments for Controlled Variation in VR Experiments to Foster GeneralizabilityInternational Conference on Extended Reality: XR Salento 2024, 210-220. https://doi.org/10.1007/978-3-031-71707-9_15Zitieren Wanali, W. , Dresel, M. ,  & Jochems, N. (2024)Human-Animal Interaction in Immersive Virtual Reality: The Role of Social Presence and Positive EffectsMuC '24: Mensch und Computer 2024., 342 - 359. https://doi.org/10.1145/3670653.3670661Zitieren Calero Valdez, A. , Heine, M. , Franke, T. , Jochems, N. , Jetter, H. ,  & Schrills, T. (2024)The European commitment to human-centered technology: the integral role of HCI in the EU AI Act’s successi-com - Journal of Interactive Media, 23(2), 249-261. https://doi.org/10.1515/icom-2024-0014Publikation herunterladenZitieren Samek, F. , Dresel, M. ,  & Jochems, N. (2024)More than words: Visualizing AI-based analysis of human-to-human communication training in healthcare educationHCI International Posters 2024, 352–362. https://doi.org/10.1007/978-3-031-61966-3_38Zitieren Kopetz, J. ,  Kordts, B. , Schrills, T. ,  & Jochems, N. (2024)An Assistive System For Non-Vocal Patients in Intensive Care Units (In Press)International Conference on Computer-Human Interaction Research and Applications (CHIRA). Zitieren Lindemann, L. , Goldbach, P. ,  & Jochems, N. (2024)Leveling Up Gamification: Personalized Progress Indicators for Young Adults in Social Contexts - A Pre-StudyMensch und Computer 2024 - Workshopband. https://doi.org/10.18420/muc2024-mci-ws01-173Zitieren Volkmann, T. , Weiß, A. , Unger, A. ,  & Jochems, N. (2024)Historytelling als Produkt und Prozess partizipativer Technikentwicklung In Partizipative Technikentwicklung im Sozialund Gesundheitswesen. Interdisziplinäre Konzepte und Methoden (pp. 224-237). hogrefe. Zitieren Volkmann, T. , Weiß, A. , Gruber, E. ,  & Jochems, N. (2024)Ein Prozess zur ressourcensensiblen Auswertung von Co-Design-Workshops im Rahmen des VernetzBar-ProjektsMensch und Computer 2024 - Workshopband. https://doi.org/10.18420/muc2024-mci-ws18-195Zitieren Samek, F. ,  Eulers, M. , Dresel, M. , Jochems, N. ,  Schrader, A. ,  &  Mertins, A. (2023)CoSy - AI enhanced assistance system for face to face communication trainings in higher healthcare educationPETRAE 23. https://doi.org/10.1145/3594806.3596581Zitieren Dresel, M. , Schmeier, B. , Balke, N. ,  Emkes, B. ,  Wanali, W. ,  & Jochems, N. (2023)Rapid Mixed Reality Prototyping for Novel Interaction Devices: Evaluating a Transparent Handheld DisplayXR Salento 2023: Extended Reality, 14218, 456-467. https://doi.org/10.1007/978-3-031-43401-3_3Zitieren Dresel, M. ,  Plaumann, J. ,  & Jochems, N. (2023)Investigating Age Differences in Passive Haptic Feedback for Immersive Virtual Reality: A Pilot Study on Configuration TasksExtended Reality. XR Salento 2023. Lecture Notes in Computer Science, 14218. https://doi.org/10.1007/978-3-031-43401-3_14Zitieren Volkmann, T. ,  Schaller, M. , Nolte, A. , Jochems, N. ,  &  Fischer, F. (2023)Deconstruction and Reflection in Participatory Research and Design – A Multidisciplinary PerspectiveWorkshopband MuC 2023. https://doi.org/10.18420/muc2023-mci-ws02-440Zitieren Lindemann, L. , Volkmann, T. ,  & Jochems, N. (2023)Building Bridges Through Design: Game Design Strategies to Empower Young Adults Taking Social Offers-Results From a Pilot Studyroceedings of Mensch und Computer 2023 (MuC '23). https://doi.org/10.1145/3603555.3608545Zitieren Volkmann, T. , Dresel, M. ,  & Jochems, N. (2023)Balancing Power Relations in Participatory Design: The Importance of Initiative and External FactorsCHI EA '23: Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3544549.3585864Zitieren Nolte, A. ,  Gleißl, B. ,  Heckmann, J. ,  Wallach, D. ,  & Jochems, N. (2023)\"I Want To Be Able To Change The Speed And Size Of The Avatar\": Assessing User Requirements For Animated Sign Language Translation InterfacesCHI EA '23: Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3544549.3585675Zitieren Lindemann, L. , Nolte, A. , Volkmann, T. ,  & Jochems, N. (2022)Measuring Participation Through Empowerment: A Position Paper on Empowering Young AdultsMensch und Computer 2022, 4. - 7. September 2022, Technische Universität Darmstadt, Workshopband. https://doi.org/10.18420/muc2022-mci-ws02-232Zitieren Nolte, A. ,  Lüneburg, K. ,  Wallach, D. ,  & Jochems, N. (2022)Creating Personas for Signing User Populations: An Ability-Based Approach to U",
  "content_length": 53491,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:34"
}