{
  "name": "Nicole Wein",
  "homepage": "https://web.eecs.umich.edu/~nswein",
  "status": "success",
  "content": "Nicole Wein Nicole Wein nswein at umich dot edu Bio Students Teaching Service Other she/her Office: Beyster 3603 I am an assistant professor at the University of Michigan in the Theory of Computation Lab within the Computer Science and Engineering Division of the EECS Department. I did my PhD at MIT advised by Virginia Vassilevska Williams. Prospective PhD students: Unfortunately I am not looking for new PhD students this cycle. However, if you are interested in applying to University of Michigan's PhD program: Consider registering for the virtual Explore Grad Studies in CSE Workshop. If paying the application fee poses a challenge, you can apply for a waiver by Nov 16. My Research I am a theoretical computer scientist and my research involves graph algorithms and lower bounds including in the areas of distance-estimation algorithms, dynamic algorithms, parameterized algorithms, distributed algorithms, online algorithms, data structures, and fine-grained complexity. I am more broadly interested in algorithmic problems that are combinatorial in nature. Some questions that guide my research: How can algorithms cope with changing data? What information can algorithms extract from a graph in only (say) linear time? Can we understand the structure of shortest paths in graphs, especially directed graphs? Here's a short overview from 2023 of some of my research interests. Publications Preprints Settling Weighted Token Swapping up to Algorithmic Barriers with Guanyu (Tony) Zhang [arXiv] 2025 Improved Online Sorting with Jubayer Nirjhor WAOA [arXiv] Improved Hardness-of-Approximation for Token Swapping with Sam Hiken ESA [arXiv] Covering Approximate Shortest Paths with DAGs with Sepehr Assadi and Gary Hoppenworth STOC [arXiv] Edge-Minimum Walk of Modular Length in Polynomial Time with Antoine Amarilli and Benoît Groz ITCS [arXiv] [talk] Low Sensitivity Hopsets with Vikrant Ashvinkumar, Aaron Bernstein, Chengyuan Deng, and Jie Gao ITCS [arXiv] [talk] Beyond 2-approximation for k-Center in Graphs with Ce Jin, Yael Kirkpatrick, and Virginia Vassilevska Williams SODA [arXiv] 2024 Additive Spanner Lower Bounds with Optimal Inner Graph Structure with Greg Bodwin, Gary Hoppenworth, Virginia Vassilevska Williams, and Zixuan Xu ICALP [arXiv] Detecting Disjoint Shortest Paths in Linear Time and More with Shyan Akmal and Virginia Vassilevska Williams ICALP [arXiv] Are there graphs whose shortest path structure requires large edge weights? with Aaron Bernstein and Greg Bodwin ITCS [arXiv] [talk] 2023 A Local-to-Global Theorem for Congested Shortest Paths with Shyan Akmal ESA [arXiv] Closing the Gap Between Directed Hopsets and Shortcut Sets with Aaron Bernstein SODA [arXiv] [talk] 2022 Online List Labeling: Breaking the log2n Barrier with Michael A. Bender, Alexander Conway, Martín Farach-Colton, Hanna Komlós, and William Kuszmaul FOCS, Invited to the special issue of SICOMP, Invited to HALG [arXiv] [TCS+ talk] [Quanta] Approximation Algorithms and Hardness for n-Pairs Shortest Paths and All-Nodes Shortest Cycles with Mina Dalirooyfard, Ce Jin, and Virginia Vassilevska Williams FOCS [arXiv] Hardness of Token Swapping on Trees with Oswin Aichholzer, Erik D. Demaine, Matias Korman, Anna Lubiw, Jayson Lynch, Zuzana Masárová, Mikhail Rudoy, and Virginia Vassilevska Williams ESA, Invited minisymposium at CANADAM [arXiv] Memoryless Worker-Task Assignment with Polylogarithmic Switching Cost with Aaron Berger, William Kuszmaul, Adam Polak, and Jonathan Tidor ICALP [arXiv] Better Lower Bounds for Shortcut Sets and Additive Spanners via an Improved Alternation Product with Kevin Lu, Virginia Vassilevska Williams, and Zixuan Xu SODA [arXiv] 2021 Algorithms for the Minimum Dominating Set Problem in Bounded Arboricity Graphs: Simpler, Faster, and Combinatorial with Adir Morgan and Shay Solomon DISC [arXiv] [talk] Tight Conditional Lower Bounds for Approximating Diameter in Directed Graphs with Mina Dalirrooyfard STOC [arXiv] See also concurrent work by Ray Li New Techniques and Fine-Grained Hardness for Dynamic Near-Additive Spanners with Thiago Bergamaschi, Monika Henzinger, Maximilian Probst Gutenberg, and Virginia Vassilevska Williams SODA [arXiv] 2020 Lower Bounds for Dynamic Distributed Task Allocation with Hsin-Hao Su ICALP, BDA [arXiv] New Algorithms and Hardness for Incremental Single-Source Shortest Paths in Directed Graphs with Maximilian Probst Gutenberg and Virginia Vassilevska Williams STOC [arXiv] [talk] 2019 Tight Approximation Algorithms for Bichromatic Graph Diameter and Related Problems with Mina Dalirrooyfard, Virginia Vassilevska Williams, and Nikhil Vyas ICALP [arXiv] Approximation Algorithms for Min-Distance Problems with Mina Dalirrooyfard, Virginia Vassilevska Williams, Nikhil Vyas, Yinzhan Xu, and Yuancheng Yu ICALP [arXiv] Algorithms and Hardness for Diameter in Dynamic Graphs with Bertie Ancona, Monika Henzinger, Liam Roditty, and Virginia Vassilevska Williams ICALP [arXiv] 2018 Improved Dynamic Graph Coloring with Shay Solomon ESA, TALG [arXiv] [mentioned in blog post] Finding Cliques in Social Networks: A New Distribution-Free Model with Jacob Fox, Tim Roughgarden, C. Seshadhri, and Fan Wei ICALP, SICOMP [arXiv] [talk] [chapter 28 of Beyond the Worst-Case Analysis of Algorithms] Fully Dynamic MIS in Uniformly Sparse Graphs with Krzysztof Onak, Baruch Schieber, and Shay Solomon ICALP, TALG [arXiv] Towards Tight Approximation Bounds for Graph Diameter and Eccentricities with Arturs Backurs, Liam Roditty, Gilad Segal, and Virginia Vassilevska Williams STOC, SICOMP [arXiv]",
  "content_length": 5568,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:36"
}