{
  "name": "Nicolas James LaLone",
  "homepage": "https://www.rit.edu/directory/njligm-nicolas-lalone",
  "status": "success",
  "content": "Nick LaLone | RIT RIT Logo with Text Nick LaLone Assistant Professor School of Interactive Games and Media Golisano College of Computing and Information Sciences njligm@rit.edu Office Location GOL-2519 Nick LaLone Assistant Professor School of Interactive Games and Media Golisano College of Computing and Information Sciences Bio I began my life in academia not as a grad student but as administrative staff. I was charged with the responsibility of fostering technology use among the Sociologists in my department. I found this work challenging, but fascinating. I sought answers to the unasked, unconscious issues that I saw in the world of well-educated, well-informed social scientists from any place that I could find information. Names and terms like Object Oriented Ontology, Actor-Network Theory, the Social Construction of Technology introduced me to a number of concepts, epistemologies, and philosophies surrounding what would become known to me as, “non-human actors.” I began to read more and more and over time wanted to do more than foster technology use within the faculty of my department, I wanted to approach developers or just use of technology in general. I enrolled at Pennsylvania State University in the Information Science and Technology program. My intent was to simply gain new perspectives about technology at an iSchool since Penn State’s Science and Technology program had been sunset years before. However, as a resident of the iSchool, I was introduced to different levels of computation and began to expand my knowledge of how the computer actually works. After removing many of the barriers of use and fostering a growing sense of how programming worked, I returned to those initial questions I had as a systems support person; namely, how to foster a world where people, places, and things all learn to work together. njligm@rit.edu Personal Links Personal Website ORCID Google Scholar Currently Teaching IGME-220Game Design & Development I3 CreditsThis course examines the core process of game design, from ideation and structured brainstorming in an entertainment technology context through the examination of industry standard processes and techniques for documenting and managing the design process. This course specifically examines techniques for assessing and quantifying the validity of a given design, for managing innovation and creativity in a game development-specific context, and for world and character design. Specific emphasis is placed on both the examination and deconstruction of historical successes and failures, along with presentation of ethical and cultural issues related to the design and development of interactive software and the role of individuals in a team-oriented design methodology. Students in this class are expected to actively participate and engage in the culture of design and critique as it relates to the field.IGME-320Game Design & Development II3 CreditsThis course continues to examine the core theories of game design as they relate to the professional field. Beginning with a formalized pitch process, this course examines the design and development paradigm from story-boarding and pre-visualization through rapid iteration, refinement, and structured prototyping exercises to further examine the validity of a given design. Specific emphasis is placed on iterative prototyping models, and on methodologies for both informal and formal critique. This course also explores production techniques and life-cycle in the professional industry.IGME-689IGM Graduate Research Studio3 CreditsThis course will allow students to work as domain specialists on teams completing one or more faculty-led research projects over the course of the semester. The faculty member teaching the class will provide the research topic(s). Students will learn about research methodology to implement, test, and evaluate results of projects. Students will complete research reports and final assessments of themselves and their teammates in addition to completing their assigned responsibilities on the main projects. Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 4279,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:31"
}