{
  "name": "Nico Potyka",
  "homepage": "https://profiles.cardiff.ac.uk/staff/potykan",
  "status": "success",
  "content": "Dr Nico Potyka - People - Cardiff University Skip to main content Search the websiteSearch Close Dr Nico Potyka (he/him) Teams and roles for Nico Potyka LecturerSchool of Computer Science and Informatics Overview Publications Research Teaching Biography Overview I am a Lecturer in the Knowledge Representation and Reasoning group at Cardiff University and affiliated with the Computational Logic and Argumentation group at Imperial College London as an Honorary Research Fellow. I am interested in applying formal methods to Artificial Intelligence to design robust and trustworthy autonomous systems. My research revolves around the following questions: How can we represent and reason about knowledge? How can we deal with uncertain and inconsistent knowledge? How can we guarantee robustness and correctness of autonomous systems? How we can explain the decisions of autonomous systems both faithfully and comprehensibly to a user? I believe that the answer requires hybrid systems that combine the transparency and verifiability of symbolic methods with the flexibility and efficiency of machine-learning methods. I am also interested in knowledge transfer and collaborations with industry partners. Programming Libraries For lack of a better place, I refer to some libraries here that I implemented together with colleagues over the years. Attractor (Java): The Attractor library allows modeling and solving Quantitative/Gradual Argumentation problems. Arguments can be modeled in a directed graph, where nodes represent arguments and edges attack or support relationships between them. Every argument has an initial weight that represent an apriori strength when all other arguments are ignored. Reasoning algorithms assign a final strength to every argument based on its initial weight and the final strength of its attackers and supporters. Attractor supports various semantics and computes the final strength values by viewing the reasoning problem as a dynamical system that can be solved by numerical methods in polynomial-time (linear time for acyclic graphs). ProBabble (Java): ProBabble allows modeling and reasoning about Probabilistic Argumentation problems. Similar to Gradual Argumentation Frameworks, argumentation problems are described by directed graphs. However, relationships between arguments are described by probabilistic constraints. ProBabble supports linear atomic constraints that allow representing many interesting relationships and reasoning in polynomial-time. Uncertainpy (Python): Uncertainpy started as a Python version of Attractor but now contains additional tools that can be used for Quantitative Argumentation with weights or probabilities. As a rule of thumb, the Java implementations are faster but Uncertainpy is better suited for rapid prototyping. Log4KR (Java): Log4KR is a Java library that allows modeling and reasoning about Probabilistic Reasoning problems. It supports propositional and relational probabilistic logic including probabilistic conditional logics. In order to deal with inconsistencies, it also provides implementations of inconsistency measures and paraconsistent reasoning algorithms. The library can be downloaded as part of the KReator project. Publication Date Type 2025 Corea, C., Kampik, T. and Potyka, N. 2025. Privacy-preserving inconsistency measurement. Presented at: The 18th European Conference on Symbolic and Quantitative Approaches to Reasoning with Uncertainty (ECSQARU), Germany, 23-26 September 2025Symbolic and Quantitative Approaches to Reasoning with Uncertainty, Vol. 16099. Lecture Notes in Computer Science Springer Nature pp. 455-467., (10.1007/978-3-032-05134-9_31) Ayoobi, H., Potyka, N. and Toni, F. 2025. ProtoArgNet: Interpretable image classification with super-prototypes and argumentation. Presented at: The 39th Annual AAAI Conference on Artificial Intelligence, Philadelphia, Pennsylvania, USA, 25 February – 4 March 2025 Presented at Walsh, T., Shah, J. and Kolter, Z. eds.Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 39. Vol. 2. Washington, DC, USA: AAAI Press pp. 1791-1799., (10.1609/aaai.v39i2.32173) Zhu, Y. et al. 2025. ArgRAG: Explainable retrieval augmented generation using quantitative bipolar argumentation. Presented at: 19th International Conference on Neurosymbolic Learning and Reasoning (NeSy), USA, 8 - 10 September 2025Proceedings of Machine Learning Research, Vol. 284. Zhu, Y., Potyka, N., Pan, J., Xiong, B., He, Y., Kharlamov, E. and Staab, S. 2025. Conformalized answer set prediction for knowledge graph embedding. Presented at: 2025 Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics, Albuquerque, New Mexico, 29 April - 4 May 2025Proceedings Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics: Human Language Technologies, Vol. 1. ACL pp. 731-750. Potyka, N. and Booth, R. 2025. An empirical study of quantitative bipolar argumentation frameworks for truth discovery. Presented at: 10th International Conference on Computational Models of Argument (COMMA 2024), Hagen, Germany, 18-20 September 2024 Presented at Reed, C., Thimm, M. and Rienstra, T. eds.Proceedings of COMMA 2024. Volume 388: Computational Models of Argument. Frontiers in Artificial Intelligence and Applications IOS Press pp. 205-216., (10.3233/FAIA240322) 2024 Kampik, T., Potyka, N., Yin, X., Čyras, K. and Toni, F. 2024. Contribution functions for quantitative bipolar argumentation graphs: A principle-based analysis. International Journal of Approximate Reasoning 173, article number: 109255. (10.1016/j.ijar.2024.109255) Yin, X., Potyka, N. and Toni, F. 2024. CE-QArg: Counterfactual explanations for quantitative bipolar argumentation frameworks. [Online]. arXiv: Cornell University. Available at: https://doi.org/10.48550/arXiv.2407.08497 Potyka, N., Zhu, Y., He, Y., Kharlamov, E. and Staab, S. 2024. Robust knowledge extraction from large language models using social choice theory. Presented at: The 23rd International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS 2024), Auckland, New Zealand, 6-10 May 2024 Presented at Alechina, N., Dignum, V. and Sichman, J. S. eds.AAMAS '24: Proceedings of the 23rd International Conference on Autonomous Agents and Multiagent Systems. Association for Computing Machinery pp. 1593–1601., (10.5555/3635637.3663020) Leofante, F. and Potyka, N. 2024. Promoting counterfactual robustness through diversity. Presented at: The Thirty-Eighth AAAI Conference on Artificial Intelligence (AAAI-24), 20-27 February 2024Proceedings of the AAAI Conference on Artificial Intelligence: AAAI-24 Special Track Safe, Robust and Responsible AI Track, Vol. 38. Vol. 19. Association for the Advancement of Artifcial Intelligence pp. 21322-21330., (10.1609/aaai.v38i19.30127) Ulbricht, M., Potyka, N., Rapberger, A. and Toni, F. 2024. Non-flat ABA is an instance of bipolar argumentation. Presented at: The Thirty-Eighth AAAI Conference on Artificial Intelligence (AAAI-24), 20-27 February 2024Proceedings of the AAAI Conference on Artificial Intelligence: AAAI Technical Track on Knowledge Representation and Reasoning, Vol. 38. Vol. 9. pp. 10723-10731., (10.1609/aaai.v38i9.28944) Potyka, N. and Booth, R. 2024. Balancing open-mindedness and conservativeness in quantitative bipolar argumentation (and how to prove semantical from functional properties). Presented at: 21st International Conference on Principles of Knowledge Representation and Reasoning (KR 2024), Hanoi, Vietnam, 2-8 November 2024 Presented at Marquis, P., Ortiz, M. and Pagnucco, M. eds.Proceedings of the 21st International Conference on Principles of Knowledge Representation and Reasoning — Main Track. International Joint Conferences on Artificial Intelligence Organization pp. 597-607., (10.24963/kr.2024/56) Yin, X., Potyka, N. and Toni, F. 2024. CE-QArg: Counterfactual explanations for quantitative bipolar argumentation frameworks. Presented at: 21st International Conference on Principles of Knowledge Representation and Reasoning (KR 2024), Hanoi, Vietnam, 2-8 November 2024 Presented at Marquis, P., Ortiz, M. and Pagnucco, M. eds.Proceedings of the 21st International Conference on Principles of Knowledge Representation and Reasoning — Main Track.. International Joint Conferences on Artificial Intelligence Organization pp. 697-707., (10.24963/kr.2024/66) Zhu, Y., Potyka, N., Nayyeri, M., Xiong, B., He, Y., Kharlamov, E. and Staab, S. 2024. Predictive multiplicity of knowledge graph embeddings in link prediction. Presented at: The 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024), Miami, Florida, 12-16 November 2024. Yin, X., Potyka, N. and Toni, F. 2024. Explaining arguments’ strength: Unveiling the role of attacks and supports. Presented at: IJCAI 2024, Jeju Island, South Korea, 3 - 9 August 2024 Presented at Larson, K. ed.Proceedings of the Thirty-Third International Joint Conference on Artificial Intelligence. pp. 3622-3630. 2023 Hunter, A. and Potyka, N. 2023. Syntactic reasoning with conditional probabilities in deductive argumentation. Artificial Intelligence 321, article number: 103934. (10.1016/j.artint.2023.103934) Potyka, N., Yin, X. and Toni, F. 2023. Explaining random forests using bipolar argumentation and Markov networks. Presented at: Thirty-Seventh AAAI Conference on Artificial Intelligence, AAAI 2023, 7-14 February 2023Thirty-Seventh AAAI Conference on Artificial Intelligence, AAAI 2023. AAAI Press pp. 9453-9460., (10.1609/aaai.v37i8.26132) Ayoobi, H., Potyka, N. and Toni, F. 2023. SpArX: sparse argumentative explanations for neural networks. Presented at: 26th European Conference on Artificial Intelligence (ECAI), 30 September - 04 October 2023ECAI 2023, Vol. 372. Frontiers in Artificial Intelligence and Applications IOS Press pp. 149-156., (10.3233/FAIA230265) Yin, X., Potyka, N. and Toni, F. 2023. Argument attribution explanations in quantitative bipolar argum",
  "content_length": 41040,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:23"
}