{
  "name": "Nicolas Guelfi",
  "homepage": "http://wwwen.uni.lu/recherche/fstc/computer_science_and_communications_research_unit/members/nicolas_guelfi",
  "status": "success",
  "content": "Nicolas GUELFI - FSTM - University of Luxembourg I Uni.lu Full professor Contact nicolas.guelfi@uni.lu (+352) 46 66 44 5251 Details Profile Profile CV Functions Full professor In detail Faculty of Science, Technology and Medicine Department of Computer Science Software engineering | Dependable systems Maison du Nombre6, avenue de la FonteL-4364 ESCH MNO, E03 0315020 nicolas.guelfi@uni.lu (+352) 46 66 44 5251 Publications on ORBilu Dr. Nicolas Guelfi is a Full Professor in Computer Science at the Departement of Computer Science of the University of Luxembourg. He joined the institution in 1999, contributing to the university’s creation and development. He was the founder of the Laboratory for Advanced Software Systems (LASSY), which he directed for over 10 years. He was the founding programme director for the academic Bachelor in Computer Science (BICS), which opened in 2017. Professor Guelfi has contributed extensively to the field of software engineering through publications, book editing, and serving as a program chair and review committee member. His research contributions have historically focused on: Requirements definition, specification, and simulation using formal, semi-formal, or informal methods. System dependability and resiliency. His current main research field is development methods for deep learning focusing on generative AI. Publication record overview can be accessed here: ‪Nicolas Guelfi‬ – ‪Google Scholar‬ Nicolas GUELFI | Professor (Full) | Phd | University of Luxembourg, Luxembourg | Research profile Current teaching duties include: Bachelor in Information technologies: Modeling with UML (S3) Master in European Governance: Introduction to Artificial Intelligence for the European Citizen. Master in Entrepreneurship and Innovation: Introduction to Artificial Intelligence for the citizen. Master in Entrepreneurship and Innovation: Artificial Intelligence for Entrepreneurship and Innovation. Master in Learning and Communication in Multilingual and Multicultural Contexts: Artificial Intelligence for Languages & Cultures. Professor Guelfi served as an expert for the Supreme Court of Justice of Luxembourg for 10 years (2007-2016), specializing in software conformance trials. He has also served as a member of the European Research Consortium in Mathematics and Informatics (ERCIM) executive committee. He has created an education offer in Artificial Intelligence, specifically Generative AI, aimed at supporting industry needs in up-skilling and re-skilling. This training is deployed at the Luxembourg Digital Learning Hub (DLH). Professor, University of Luxembourg (Mar 1999 – Present) Chief Executive Officer & Co-founder, Right On Skill (Jan 2020 – Present) Invited Professor, University of Geneva, Switzerland (Jan 2022 – Jul 2022) Invited Professor, Innopolis University, Russia (Feb 2017 – May 2017) Visiting Professor, Peter the Great St. Petersburg Polytechnic University, Russia (Mar 2016 – Dec 2016) Expert at the Supreme Court of Justice of Luxembourg, (2007 – 2016) Research & Teaching Assistant, EPFL (École polytechnique fédérale de Lausanne), Switzerland (1995 – 1998) Head of the Software Engineering Specialisation, EPITA (Ecole d’Ingénieurs en Informatique), France (1995 – 1997) Professor, EPITA (Ecole d’Ingénieurs en Informatique), France (1992 – 1997) ATER (Teaching & Research Associate), University of Paris XII, France (1993 – 1995) Doctor of Philosophy (Ph.D.), Computer Science (1990 – 1994) Paris-Sud University (Paris XI), France Thesis: High-level object-oriented specification formalisms for concurrent systems. Master in Theoretical Computer Science (1989 – 1990) ULM-X-Ensta-PXI (Joint Master between Ecole Normale Supérieure Paris, Ecole Polytechnique Paris, ENSTA and Université Paris XI), France. Stay connected and subscribe to our newsletter All fields are mandatory Choose among our mailing list(s) Mailing list 0 items selected University of Luxembourg – News and events FSTM – News and events Enter your email address Example: contact@uni.lu Please provide a valid email address. Example: jean.dupont@gmail.com I agree to the use of my email address in the context of subscribing to the University of Luxembourg’s newsletters. I am aware that I can unsubscribe or update my profile by clicking the unsubscribe or update profile link in the email communication. More information about data processing. Subscribe now To the top",
  "content_length": 4420,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:33"
}