{
  "name": "Nicola Paoletti",
  "homepage": "https://www.kcl.ac.uk/people/nicola-paoletti",
  "status": "success",
  "content": "Nicola Paoletti | King's College London Skip to main contentDr Nicola Paoletti Deputy Head of the Software Systems (SSY) GroupSenior Lecturer in Computer ScienceResearch interestsComputer scienceContact detailsnicola.paoletti@kcl.ac.ukBiographyDr Nicola Paoletti is a Senior Lecturer in Computer Science in the Department of Informatics, King's College London. Prior to this, he was a Lecturer at the Department of Computer Science at Royal Holloway, University of London (2018-2022). He was a post-doc in the Department of Computer Science, Stony Brook University, working within the CyberCardia project (2016-2018). Prior to this, Nicola was a post-doc in the Department of Computer Science, Oxford University (2014-2016). In 2013, he undertook a three month internship in the Biological Computation Group, at Microsoft Research Cambridge. Nicola obtained a PhD in Information Sciences and Complex Systems from Università di Camerino in 2014.Research interestsCyber-physical systemsFormal verification and synthesisAI safety and securityHealthcare and medical applicationsFurther informationPersonal websitePublicationsResearchResearchTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Health HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Security HubThe Security Hub consolidates the research related to securityKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Software SystemsThe group studies design, modelling and engineering of software systems.NewsNews13 October 2025Project to verify AI models with confidence awarded major grantDr Nicola Paoletti from the Department of Informatics will embark on the work following a competitive grant from Open Philanthropy. Technology & Science17 April 2023Five King's scientists win prestigious New Investigator AwardsThe academics awarded over £2 million from the Engineering and Physical Sciences Research Council (EPSRC).Technology & ScienceFeaturesFeatures19 July 2023King's students build, code and race self-driving cars at the 11th F1TENTH Autonomous Grand PrixThe team from the Department of Informatics got hands-on with autonomous vehicles alongside engineers from across the globe at the ExCel Centre last month Technology & SciencePublicationsResearchNewsFeaturesResearchTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Health HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Security HubThe Security Hub consolidates the research related to securityKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Software SystemsThe group studies design, modelling and engineering of software systems.News13 October 2025Project to verify AI models with confidence awarded major grantDr Nicola Paoletti from the Department of Informatics will embark on the work following a competitive grant from Open Philanthropy. Technology & Science17 April 2023Five King's scientists win prestigious New Investigator AwardsThe academics awarded over £2 million from the Engineering and Physical Sciences Research Council (EPSRC).Technology & ScienceFeatures19 July 2023King's students build, code and race self-driving cars at the 11th F1TENTH Autonomous Grand PrixThe team from the Department of Informatics got hands-on with autonomous vehicles alongside engineers from across the globe at the ExCel Centre last month Technology & Science(S)5.17Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 4111,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:26"
}