{
  "name": "Nicolas Papernot",
  "homepage": "https://www.papernot.fr",
  "status": "success",
  "content": "Nicolas Papernot - HomePage Nicolas Papernot Photo by Matthew Tierney. I am an Associate Professor at the University of Toronto, in the Department of Electrical and Computer Engineering, the Department of Computer Science, and the Faculty of Law. I am also a faculty member at the Vector Institute where I hold a Canada CIFAR AI Chair, and a faculty affiliate at the Schwartz Reisman Institute. In addition, I am a Co-Director of the Canadian AI Safety Institute (CAISI) Research Program at CIFAR. For the 2025-2027 period, I hold an International Chair at Inria. My research interests are at the intersection of security, privacy, and machine learning. If you would like to learn more about my research, I recommend reading the blog posts I co-authored on cleverhans.io, for example about proof-of-learning, collaborative learning beyond federation, dataset inference, machine unlearning, differentially private ML, or adversarial examples. I was named an Alfred P. Sloan Research Fellow in Computer Science in 2022, a Member of the Royal Society of Canada College in 2023, and an AI2050 Early Career Fellow By Schmidt Sciences in 2024. I received the McCharles Prize for Early Career Research Distinction and the ACM SIGSAC Outstanding Early-Career Researcher Award, both in 2024. I received the Samsung AI Researcher of the Year Award in 2025. My research has been cited in the press: e.g., the BBC, New York Times, Popular Science, The Atlantic, the Wall Street Journal and Wired. I am serving as Program Co-Chair of the 47th and 48th IEEE Symposium on Security and Privacy in 2026 and 2027. I co-founded and served as a Program Co-Chair of the IEEE Conference on Secure and Trustworthy Machine Learning (SaTML) in 2023 and 2024. Previously, I earned my Ph.D. in Computer Science and Engineering at the Pennsylvania State University, working with Prof. Patrick McDaniel and supported by a Google PhD Fellowship. Upon graduating, I joined Google Brain for a year; I continue to spend time at Google DeepMind. Email: [email protected] Office: Pratt 484E and SRIC (the Vector Institute lobby is on the 11th floor) Mail/Packages: 10 King's College Road, Room SFB540, Toronto, ON M5S 3G4, Canada CV » Bluesky » Google Scholar » Recent & selected older publications A complete list of publications is available in my CV. 2026Preempt: Sanitizing Sensitive Prompts for LLMs. Amrita Roy Chowdhury, David Glukhov, Divyam Anshumaan, Prasad Chalasani, Nicolas Papernot, Somesh Jha, Mihir Bellare. Proceedings of the 2026 Network and Distributed System Security Symposium. conference2025Private Rate-Constrained Optimization with Applications to Fair Learning. Mohammad Yaghini, Tudor Ioan Cebere, Michael Menart, Aurélien Bellet, Nicolas Papernot. EurIPS 2025 Workshop on PPML. workshopPosition Paper: Machine Unlearning Doesn't Do What You Think: Lessons for Generative AI Policy, Research, and Practice. A Feder Cooper, Christopher A. Choquette-Choo, Miranda Bogen, Matthew Jagielski, Katja Filippova, Ken Ziyu Liu, Alexandra Chouldechova, Jamie Hayes, Yangsibo Huang, Niloofar Mireshghallah, Ilia Shumailov, Eleni Triantafillou, Peter Kairouz, Nicole Mitchell, Percy Liang, Daniel E. Ho, Yejin Choi, Sanmi Koyejo, Fernando Delgado, James Grimmelmann, Vitaly Shmatikov, Christopher De Sa, Solon Barocas, Amy Cyphert, Mark Lemley, danah boyd, Jennifer Wortman Vaughan, Miles Brundage, David Bau, Seth Neel, Abigail Z. Jacobs, Andreas Terzis, Hanna Wallach, Nicolas Papernot, Katherine Lee. Proceedings of the 39th Conference on Neural Information Processing Systems. conferenceWhat Does It Take to Build a Performant Selective Classifier?. Stephan Rabanser, Nicolas Papernot. Proceedings of the 39th Conference on Neural Information Processing Systems. conferenceLearned-Database Systems Security. Roei Schuster, Nicolas Papernot, Paul Grubbs, Jin Peng Zhou. Transactions on Machine Learning Research. journalSecure Noise Sampling for Differentially Private Collaborative Learning. Olive Franzese, Congyu Fang, Radhika, Xiao Wang, Somesh Jha, Nicolas Papernot, Adam Dziedzic. Proceedings of the 32nd ACM Conference on Computer and Communications Security. conferenceConfidential Guardian: Cryptographically Prohibiting the Abuse of Model Abstention. Stephan Rabanser, Ali Shahin Shamsabadi, Olive Franzese, Xiao Wang, Adrian Weller, Nicolas Papernot. Proceedings of the 42nd International Conference on Machine Learning, Vancouver, Canada. conferenceSuitability Filter: A Statistical Framework for Model Evaluation in Real-World Deployment Settings. Angéline Pouget, Mohammad Yaghini, Stephan Rabanser, Nicolas Papernot. Proceedings of the 42nd International Conference on Machine Learning, Vancouver, Canada. conference (+oral)Language Models May Verbatim Complete Text They Were Not Explicitly Trained On. Ken Ziyu Liu, Christopher A. Choquette-Choo, Matthew Jagielski, Peter Kairouz, Sanmi Koyejo, Percy Liang, Nicolas Papernot. Proceedings of the 42nd International Conference on Machine Learning, Vancouver, Canada. conference (+spotlight)Fast Exact Unlearning of Fine-Tuning Data for LLMs. Andrei Ioan Muresanu, Anvith Thudi, Michael R. Zhang, Nicolas Papernot. Proceedings of the 42nd International Conference on Machine Learning, Vancouver, Canada. conferenceLeveraging Per-Instance Privacy for Machine Unlearning. Nazanin Mohammadi Sepahvand, Anvith Thudi, Berivan Isik, Ashmita Bhattacharyya, Nicolas Papernot, Eleni Triantafillou, Daniel M. Roy, Gintare Karolina Dziugaite. Proceedings of the 42nd International Conference on Machine Learning, Vancouver, Canada. conferenceTrustworthy ML Regulation as a Principal-Agent Problem. Mohammad Yaghini, Patty Liu, Andrew Magnuson, Natalie Dullerud, Nicolas Papernot. Proceedings of the 2025 ACM Conference on Fairness, Accountability, and Transparency. conferenceA False Sense of Safety: Unsafe Information Leakage in Safe AI Responses. David Glukhov, Ziwen Han, Ilia Shumailov, Vardan Papyan, Nicolas Papernot. Proceedings of the 13th International Conference on Learning Representations. conferenceTighter Privacy Auditing for the Hidden State Model via Gradient-Crafting Adversaries. Tudor Ioan Cebere, Aurélien Bellet, Nicolas Papernot. Proceedings of the 13th International Conference on Learning Representations. conferenceSelective Prediction via Training Dynamics. Stephan Rabanser, Anvith Thudi, Kimia Hamidieh, Adam Dziedzic, Israfil Bahceci, Akram Bin Sediq, Hamza Sokun, Nicolas Papernot. Transactions on Machine Learning Research. journalInexact Unlearning Needs More Careful Evaluations to Avoid a False Sense of Privacy. Jamie Hayes, Amr Khalifa, Ilia Shumailov, Nicolas Papernot, Eleni Triantafillou. Proceedings of the 3rd IEEE Conference on Secure and Trustworthy Machine Learning. conferenceVerifiable and Provably Secure Machine Unlearning. Thorsten Eisenhofer, Doreen Riepel, Varun Chandrasekaran, Esha Ghosh, Olga Ohrimenko, Nicolas Papernot. Proceedings of the 3rd IEEE Conference on Secure and Trustworthy Machine Learning. conferenceBackdoor Detection through Duplicated Execution of Outsourced Training. Hengrui Jia, Sierra Wyllie, Akram Bin Sediq, Ahmed A. Ibrahim, Nicolas Papernot. Proceedings of the 3rd IEEE Conference on Secure and Trustworthy Machine Learning. conferenceArchitectural Neural Backdoors from First Principles. Harry Langford, Ilia Shumailov, Yiren Zhao, Robert Mullins, Nicolas Papernot. Proceedings of the 46th IEEE Symposium on Security and Privacy, San Francisco, CA. conference2024Beyond Labeling Oracles: What does it mean to steal ML models?. Avital Shafran, Ilia Shumailov, Murat A. Erdogdu, Nicolas Papernot. Transactions on Machine Learning Research. journalTemporal-Difference Learning Using Distributed Error Signals. Jonas Guan, Shon Eduard Verch, Claas A Voelcker, Ethan C Jackson, Nicolas Papernot, William A Cunningham. Proceedings of the 38th Conference on Neural Information Processing Systems. conferenceLLM Dataset Inference: Detect Datasets, not Strings. Pratyush Maini, Hengrui Jia, Nicolas Papernot, Adam Dziedzic. Proceedings of the 38th Conference on Neural Information Processing Systems. conferenceAI models collapse when trained on recursively generated data. Ilia Shumailov, Zakhar Shumaylov, Yiren Zhao, Yarin Gal, Nicolas Papernot, Ross Anderson. Nature. journalAugment then Smooth: Reconciling Differential Privacy with Certified Robustness. Jiapeng Wu, Atiyeh Ashari Ghomi, David Glukhov, Jesse C. Cresswell, Franziska Boenisch, Nicolas Papernot. Transactions on Machine Learning Research. journalGradients Look Alike: Sensitivity is Often Overestimated in DP-SGD. Anvith Thudi, Hengrui Jia, Casey Meehan, Ilia Shumailov, Nicolas Papernot. Proceedings of the 33rd USENIX Security Symposium. conferenceAuditing Private Prediction. Karan Chadha, Matthew Jagielski, Nicolas Papernot, Christopher A. Choquette-Choo, Milad Nasr. Proceedings of the 41st International Conference on Machine Learning, Vienna, Austria. conferenceThe Fundamental Limits of Least-Privilege Learning. Theresa Stadler, Bogdan Kulynych, Michael Gastpar, Nicolas Papernot, Carmela Troncoso. Proceedings of the 41st International Conference on Machine Learning, Vienna, Austria. conferencePosition Paper: Rethinking LLM Censorship as a Security Problem. David Glukhov, Ilia Shumailov, Yarin Gal, Nicolas Papernot, Vardan Papyan. Proceedings of the 41st International Conference on Machine Learning, Vienna, Austria. conferenceFairness Feedback Loops: Training on Synthetic Data Amplifies Bias. Sierra Calanda Wyllie, Ilia Shumailov, Nicolas Papernot. Proceedings of the 2024 ACM Conference on Fairness, Accountability, and Transparency. conferenceFrom Differential Privacy to Bounds on Membership Inference: Less can be More. Anvith Thudi, Ilia Shumailov, Franziska Boenisch, Nicolas Papernot. Transactions on Machine Learning Research. journalDecentralised, Collaborative, and Privacy-preserving Machine Learning for Multi-Hospital Data. Congyu Fang, Adam Dziedzic, Lin Zhang, Laura Oliva, Amol Verma, F",
  "content_length": 29843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:31"
}