{
  "name": "Nicolas Navet",
  "homepage": "http://nicolas.navet.eu",
  "status": "success",
  "content": "Nicolas Navet homepage Affiliation : University of Luxembourg Faculty of Science, Technology and Medicine (FSTM)Department of Computer Science Laboratory of Advanced Software SYstems (LASSY) Address :6, Avenue de la FonteMaison du NombreL-4364 Esch-sur-AlzetteLuxembourg Office:Campus Belval, Maison du Nombre, MNO 03-15-080  Phone: (+352).46.66.44.52.73 Email:firstname.lastname@uni.lu 09/2023 - Keynote at RNDM23 on TSN timing QoS with 10 years of hindsight.01/2023 - Study with R. Bosch on the Design Space Exploration of E/E architectures - Pdf of the paper.06/2022 - Study with Volvo Cars on the scalability of next-generation E/E architectures presented at the 2022 Automotive Ethernet Congress  - Pdf of the slides.02/2021 - Study with Airbus Helicopters on the TSN mechanisms needed in helicopters presented at DASC 2021 - Pdf of the slides.02/2021 - Study with Renault on QoS-predictable Service Oriented Architectures presented at the 2021 Automotive Ethernet Congress  - Pdf of the slides.09/2020 - Study with BMW on E/E architecture Design Automation presented at the 2020 IEEE Standards Association (IEEE-SA) Ethernet & IP @ Automotive Technology Day - Pdf of the slides.02/2020 - Study with Volvo Cars on early-stage design choices with design-space exploration presented at the 2020 Automotive Ethernet Congress - Pdf of the slides.09/2019 - Study with Renault on early-stage design choices with design-space exploration presented at the 2019 IEEE Standards Association (IEEE-SA) Ethernet & IP @ Automotive Technology Day - Pdf of the slides.02/2018 - our study on the clock synchronization in the TTEthernet network received a best paper award at ERTSS2018.12/2017 - Phd thesis of Guillaume Brau received foundation ISAE-SUPAERO award. Research in real-time dependable systems and risk assessment My goal is to advance techniques, tools, and computing platforms that enable the development of provably safe systems in a time- and cost-efficient way, with applications in: Automotive and aerospace embedded systems: automated synthesis of E/E architecture (design-space exploration, machine learning) & timing and dependability verification Risk assessment: quantify risks using probabilistic models derived from historical data Here is a list of my publications (available for download) and slides from recent talks. You can find here a short biography and a list of (academic) professional activities.Selected works E/E architecture design automation:A Model-Based Systems Engineering framework with DSE for E/E architectures in automated driving vehicles, with Robert Bosch.Graph neural networks to speed-up the verification of Ethernet TSN networks in design-space exploration - study available here as well as a follow-up work.  âQoS-Predictable SOA on TSN: Insights from a Case-Studyâ, with Renault. âTowards Computer-Aided, Iterative TSN-and Ethernet based EE Architecture Designâ, with BMW.âEarly-stage Bottleneck Identification and Removal in TSN Networksâ, with Volvo. âPractical Use-cases for Ethernet Redundancyâ, with NXP. \"Multi-source software on multicore automotive ECUs - Combining runnable sequencing with task scheduling\", with PSA. Communication networks for dependable systems: Timing QoS protocols on top of Ethernet TSN (slides)Scheduling frames with offsets provides a major performance boost on CAN (slides) Configuration of FlexRay networks (slides) Fine Tuning MAC Level Protocols for Optimized Real-Time QoS Optimal configuration of TDMA / TTP/C networks - (slides) Probabilistic analysis of CAN fault-confinement mechanismsPatents on communication networks:  FR2976432 - FR2976434 - FR2976435. Model-Driven Engineering for embedded systems:\"Automated Fault Tolerance Augmentation in Model-Driven Engineering for CPS\"âLean Model-Driven Development through Model-Interpretation: the CPAL design ï¬owâ.Low-power scheduling: Optimal CPU frequencies for energy consumption, the case of FIFO tasks and the general case. Stochastic model of battery discharge time Multi-processor low-power scheduling Financial engineering Regime-switching models for financial dataHeavy-tails behavior of financial data Large deviations for risk assessment Correlation between time series entropy and technical analysis returns",
  "content_length": 4270,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:33"
}