{
  "name": "Nicole C. Krämer",
  "homepage": "https://www.uni-due.de/sozialpsychologie/kraemer.shtml",
  "status": "success",
  "content": "Prof. Dr. Nicole Krämer Prof. Dr. Nicole Krämer Leitung des Fachgebiets SozialpsychologieProf. Dr. Nicole Krämer Anschrift Tectrum Bismarckstr. 120 47057 Duisburg Raum 3.1.OG.2214 Sprechstunde nach Vereinbarung per E-Mail! Telefon +49 203 379 - 6026 E-Mail nicole.kraemer@uni-due.de Curriculum Vitae Übersicht Mit einem Klick auf die Überschrift gelangen Sie direkt zum entsprechenden Abschnitt des CVs. Akademische Qualifikationen Beruflicher Werdegang Forschungsprojekte Mitgliedschaften Preise / Ehrungen Auslandsaufenthalte Tagungsorganisation Publikationen Akademische Qualifikationen 2006 Abschluss des Habilitationsverfahrens (venia legendi für Psychologie) an der Universität zu Köln Habilitationsschrift: „Soziale Wirkungen virtueller Helfer“ 2001 Promotion (summa cum laude), Dissertation zum Thema „Bewegende Bewegung. Sozio-emotionale Wirkungen nonverbalen Verhaltens und deren experimentelle Untersuchung mittels Computeranimation“ 1992 - 1997 Studium der Psychologie an der Universität zu Köln (mit Auszeichnung abgeschlossen) Zur Übersicht Beruflicher Werdegang Seit 2007 Professorin für „Sozialpsychologie – Medien und Kommunikation“ an der Universität Duisburg-Essen, Fakultät für Ingenieurwissenschaften, Abteilung für Angewandte Informatik und Kognitionswissenschaften 1998 - 2007 Wissenschaftliche Mitarbeiterin/Assistentin in der Abteilung „Differentielle Psychologie und Sozialpsychologie“ der Universität zu Köln (Prof. Dr. Gary Bente) 2003 - 2004 Visiting scholar und visiting lecturer an der University of Cambridge, Faculty of Social and Political Sciences (Prof. Dr. Tony Manstead) 1995 - 1997 Studentische Hilfskraft an der Universität zu Köln Zur Übersicht Forschungsprojekte 2009 - 2010 Social Engagement with Robots and Agents (SERA), EU 7th Framework Programme, Strep ICT 2008 - 2010 DFG-Netzwerk „Assessing and Augmenting Instructional Communication in Computer-Supported Settings” (mit N. Rummel) 2008 - 2009 Disaster Readiness through education (Dread-Ed) (EU, Life Long Learning Programme) 2005 - 2009 Nonverbale Kommunikationspolitiken in der Individual- und Massenkommunikation. Ein Kulturvergleich in Deutschland, den Vereinigten Arabischen Emiraten und den USA (im Rahmen des Forschungskollegs „Medien und kulturelle Kommunikation“, DFG) (mit G. Bente) 2003 - 2005 Akzeptanz von biometrischen Sicherheitssystemen – Integrated Program BioSec (EU, sechstes Rahmenprogramm) (mit G. Bente) 2003 - 2004 Soziale Präsenz in virtuellen Teams: Psychologische Determinanten von avatar-basierter Wissenskommunikation (im Schwerpunktprogramm “Netzbasierte Wissenskommunikation in Gruppen”, DFG) (mit G. Bente) 1999 - 2003 Entwicklung und Evaluation von anthropomorphen Interface Agenten (im MTI-Leitprojekt EMBASSI, gefördert durch das BMBF) (mit G. Bente) Projektmitarbeit 1997 - 1999 Virtuelle Realität und parasoziale Interaktion (DFG) 1995 - 1997 Affektfernsehen – Motive, Angebotsweisen und Wirkungen (Landesanstalt für Rundfunk, NRW) Zusätzliche Einwerbung von Drittmitteln 2008 Innovationsprojekt E-Learning der Universität Duisburg-Essen 2004 Erfolgreicher Antrag bei der Fritz-Thyssen-Stiftung zur Unterstützung der Frühjahrsschule „Interdisziplinäres Kolleg 2005“ Zur Übersicht Mitgliedschaften 2008 International Society for Facial Expression 2007 National Communication Association (division: Nonverbal Communication) 2006 - International Communication Association (divisions: Communication and Technology, Mass Communication, Visual Studies, Interpersonal Communication) 2003 - International Society for Research on Emotions 2002 - Gesellschaft für Kognitionswissenschaften 2002 - Deutscher Hochschulverband 1998 - Deutsche Gesellschaft für Psychologie (Fachgruppen: Sozialpsychologie und Medienpsychologie) Zur Übersicht Preise / Ehrungen 2005 - 2009 Aufnahme in das Interdisziplinäre Nachwuchsnetzwerk des ZiF (Zentrum für Interdisziplinäre Forschung), Bielefeld (inklusive Mittel zur Durchführung eines internationalen Workshops) 2006 Einladung des National Research Councils (Washington) als Expertin für Nonverbale Kommunikation (Workshop Opportunities in Basic Research in the Behavioral and Social Sciences for the U.S. Military) 2005 Best-Paper Award, Intelligent Virtual Agents 2005 2002 Preis der Offermann-Hergarten-Stiftung 2002 für die Dissertation 2001 Best Paper Award (Auszeichnung für den besten Vortrag eines Nachwuchswissenschaftlers), Werkstatt für Mensch-Maschine-Interaktion, Berlin Zur Übersicht Auslandsaufenthalte Sept. 2008 Forschungsaufenthalt am Institute for Creative Technologies (University of Southern California) (Dr. Jonathan Gratch) Sept. 2005 Forschungsaufenthalt an der University of California Santa Barbara (Prof. Dr. Jim Blascovich) 2003 - 2004 Visiting scholar und visiting lecturer an der University of Cambridge, Faculty of Social and Political Sciences (Prof. Dr. Tony Manstead) Zur Übersicht Tagungsorganisation 2009 Organisation der 6. Tagung der der Fachgruppe Medienpsychologie der DGPs an der Universität Duisburg-Essen 2008 “Theory of Mind” (ToM) – Analysis of the integrative potential of a cognitive capacity” – Workshop am Zentrum für interdisziplinäre Forschung, Bielefeld (gemeinsam mit Prof. Dr. Kai Vogeley) 2005 Wissenschaftliche Gesamtleitung und Organisation der Frühjahrsschule “Interdisziplinäres Kolleg 2005” mit H. Mallot, Schwerpunktthema: „Real, mental and virtual space“, März 2005 2007, 2005, 2003 Doktorandenworkshop der Fachgruppe Medienpsychologie 2001 - Planungs- und Programmkomitee der Frühjahrsschule “Interdisziplinäres Kolleg” 2002-2007 2000 Co-Organisation der 1. Tagung der Fachgruppe Medienpsychologie der DGPs in Köln Zur Übersicht Zeitschriften und publizierte Konferenz-Proceedings (mit peer review) Publikationen 2018 Horstmann, A., Winter, S., Rösner, L. & Krämer, N. C. (2018). SOS on my phone: An analysis of motives and incentives for participation in smartphone‐based volunteering. Journal of Contingencies and Crisis Management, 26 (1), 193-199. Horstmann, A., Bock, N., Linhuber, E., Szczuka, J., Straßmann, C. & Krämer, N. C. (2018). Do a robot’s social skills and its objection discourage interactants from switching the robot off? PlosOne, 13 (7), e0201581 Krämer, N.C., Lucas, G., Schmitt, L. & Gratch, J. (2018). Social snacking with a virtual agent – On the interrelation of need to belong and effects of social responsiveness when interacting with artificial entities. International Journal of Human-Computer Studies, 109, 112-121. Krämer, N.C., Sobieraj, S., Feng, D., Trubina, E. & Marsella, S. (2018). Being bullied in virtual environments: experiences and reactions of male and female students to a male or female oppressor. Frontiers in Psychology, 9, https://doi.org/10.3389/fpsyg.2018.00253 Krämer, N.C., Preko, N., Flanagin, A., Winter, S. & Metzger, M. (2018). What Do People Attend to When Searching for Information on the Web: An Eye-Tracking Study. Proceedings of the Technology, Mind, and Society APA Conference (p. 19). New York: ACM. Kyewski, E. & Krämer, N.C. (2018). To gamify or not to gamify? An experimental field study of the influence of badges on motivation, activity, and performance in an online learning course. Computers & Education, 118, 25-37. Neubaum, G., & Krämer, N. C. (2018). What do we fear? Expected sanctions for expressing minority opinions in offline and online communication. Communication Research, 45 (2), 139-164. Oliver, M.B., Raney, A., Slater, M.D., Appel, M., Hartmann, T., Bartsch, A., Schneider, F., Janicke-Bowles, S., Krämer, N., Mares, M.-L., Vorderer P., Rieger, D., Dale, K.R. & Das, E. (2018). Self-transcendent media experiences: Taking meaningful media to a higher level. Journal of Communication, 68 (2), 380-389. Reer, R. & Krämer, N.C. (2018). Psychological need satisfaction and well-being in first-person shooter clans: Investigating underlying factors. Computers in Human Behavior, 84, 383-391. Rosenthal-von der Pütten, A., Krämer, N.C. & Herrmann, J. (2018). The Effects of Humanlike and Robot-Specific Affective Nonverbal Behavior on Perception, Emotion, and Behavior. International Journal of Social Robotics, 1-14. Rosenthal-von der Pütten, A., Straßmann, C., Yaghoubzadeh, R., Kopp, S. & Krämer, N. C. (2018). Dominant and submissive nonverbal behavior of virtual agents and its effects on evaluation and negotiation outcome in different age groups. Computers in Human Behavior, Advance online Publication, doi.org/10.1016/j.chb.2018.08.047 Szczuka, J.M. & Krämer, N.C. (2018). Robotic Love Rival?: A Quantitative Study on the Jealousy of Women Evoked by other Women and Robots. Proceedings of the Technology, Mind, and Society APA Conference (p. 39). New York: ACM. Walther, J.B., Neubaum, G., Rösner, L., Winter, S. & Krämer, N.C. (2018). The Effect of Bilingual Congruence on the Persuasive Influence of Videos and Comments on YouTube. Journal of Language and Social Psychology, 37 (3), 310-329. Winter, S., Krämer, N. C., Benninghoff, B., & Gallus, C. (2018). Shared entertainment, shared opinions: The influence of Social TV comments on the evaluation of talent shows. Journal of Broadcasting & Electronic Media, 62 (1), 21-37. 2017 Erdmann, J., Rummel, N., Christmann, N., Elson, M., Hecking, T., Herrmann, T., Hoppe, H. U., Krämer, N. C., Kyewski, E., & Wichmann, A. (2017). Challenges in Implementing Small Group Collaboration in Large Online Courses. In B. K. Smith, M. Borge, E. Mercier, and K. Y. Lim (Eds.). Making a Difference: Prioritizing Equity and Access in CSCL, 12th International Conference on Computer Supported Collaborative Learning (CSCL) 2017, Volume 2. Philadelphia, PA: International Society of the Learning Sciences. Feng, D., Jeong, D. C., Krämer, N. C., Miller, L. C. & Marsella, S. (2017). „Is it just me?“ Evaluating Attribution of Negative Feedback as a Function of Virtual Instructor’s Gender and Proxemics. In S. Das, E. Durfee, K. Larson, M. Winiko (eds.), Proceedings of the 16th International Conference on Autonomous Agents and Multiagent Systems (AAMAS",
  "content_length": 52938,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:34"
}