{
  "name": "Nicolás Cardozo",
  "homepage": "https://profesores.virtual.uniandes.edu.co/ncardozo",
  "status": "success",
  "content": "Nicolás Cardozo Nicolás Cardozo Associate Professor Research Group: TICSw-Tecnologías de Información y Construcción de Software Contact: Office: ML 755 Email: Extension: 1673 Research Publications Courses Students Software Service Projects cv Academic background Interests and Research lines: Programming languages Adaptive systems Dynamic programs analysis and verification Software engineering Research Group: TICSw-Tecnologías de Información y Construcción de Software FLAGlab – https://www.youtube.com/flaglabuniandes Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar A framework for the analysis of quantum safe cryptography Tesis 2025 .(2025). A framework for the analysis of quantum safe cryptography.Trabajo Dirigido por: N. Cardozo - 2025 A programming language for reinforcement learning Tesis 2025 .(2025). A programming language for reinforcement learning.Trabajo Dirigido por: N. Cardozo - 2025 Análisis de concurrencia en programas de Elixir con la herramienta Rascal Tesis 2025 .(2025). Análisis de concurrencia en programas de Elixir con la herramienta Rascal.Trabajo Dirigido por: N. Cardozo - 2025 Constructing a language for testing Reinforcement Learning programs using NLP techniques Tesis 2025 .(2025). Constructing a language for testing Reinforcement Learning programs using NLP techniques.Trabajo Dirigido por: N. Cardozo - 2025 Evaluation of transfer learning for driving in roadside behavior in autonomous robots Tesis 2025 .(2025). Evaluation of transfer learning for driving in roadside behavior in autonomous robots.Trabajo Dirigido por: N. Cardozo - 2025 Extension of the Points-to Analysis for Context-Oriented JavaScript Programs in WALA Tesis 2025 .(2025). Extension of the Points-to Analysis for Context-Oriented JavaScript Programs in WALA.Trabajo Dirigido por: N. Cardozo - 2025 Flik:a back-in-time debugger for reinforcement learning systems Tesis 2025 .(2025). Flik:a back-in-time debugger for reinforcement learning systems.Trabajo Dirigido por: N. Cardozo - 2025 Herramientas para el análisis de Dart 3 Tesis 2025 .(2025). Herramientas para el análisis de Dart 3.Trabajo Dirigido por: N. Cardozo - 2025 Identificación automática de cartas del Tarot usando detección de elementos simbólicos. Tesis 2025 .(2025). Identificación automática de cartas del Tarot usando detección de elementos simbólicos..Trabajo Dirigido por: N. Cardozo - 2025 Resilient routes: leveraging deep learning to identify critical transportation links for humanitarian response Tesis 2025 .(2025). Resilient routes: leveraging deep learning to identify critical transportation links for humanitarian response.Trabajo Dirigido por: N. Cardozo, Herrera A - 2025 Sistema de recomendación basado en aprendizaje por refuerzo con interacción multi-agente a través de meta-recompensas independientes del contexto Tesis 2025 .(2025). Sistema de recomendación basado en aprendizaje por refuerzo con interacción multi-agente a través de meta-recompensas independientes del contexto.Trabajo Dirigido por: N. Cardozo - 2025 VR-Programming-Playground Tesis 2025 .(2025). VR-Programming-Playground.Trabajo Dirigido por: N. Cardozo - 2025 Verifying context oriented programs with refinement types Tesis 2025 .(2025). Verifying context oriented programs with refinement types.Trabajo Dirigido por: N. Cardozo - 2025 A framework for self healing systems Tesis 2024 .(2024). A framework for self healing systems.Trabajo Dirigido por: N. Cardozo - 2024 Bingoapp: Una nueva experiencia de compras Tesis 2024 .(2024). Bingoapp: Una nueva experiencia de compras.Trabajo Dirigido por: N. Cardozo - 2024 CloneCorp: Cross-language clone detection dataset Software 2024 N. Cardozo. CloneCorp: Cross-language clone detection dataset. Zenodo. (2024) - 2024 Exploring a Self-Replication Algorithm to Flexibly Match Patterns Artículo 2024 Leger P, Fukuda H, N. Cardozo, San Martín D. (2024) Exploring a Self-Replication Algorithm to Flexibly Match Patterns. IEEE Access (ISSN 2169-3536) 12 (1), pp. 13553-13570. - 2024 Hacia un lenguaje de patrones DEVOPS para las startups colombianas Tesis 2024 .(2024). Hacia un lenguaje de patrones DEVOPS para las startups colombianas.Trabajo Dirigido por: N. Cardozo - 2024 Homotopy gets real Tesis 2024 .(2024). Homotopy gets real.Trabajo Dirigido por: N. Cardozo - 2024 Learning Recovery Strategies for Dynamic Self-Healing in Reactive Systems Capítulo de libro 2024 Sanabria M, Dusparic I, N. Cardozo. (2024) Learning Recovery Strategies for Dynamic Self-Healing in Reactive Systems. 2024 IEEE/ACM 19th Symposium on Software Engineering for Adaptive and Self-Managing Systems (ISBN 979-8-4007-0585-4) pp. 133-142. IEEE - 2024 For a full list of my publications visit google scholar Programming Language Essentials Maratones de programación Estructuras de datos y Algoritmos Desarrollo de aplicaciones móviles Diseño y Programación Orientada a Objetos Lenguajes y Máquinas Matemática estructural y lógica Paradigmas de programación (MISIS) Concurrencia, Paralelismo y Distribución (MISIS) Programación Funcional (MISIS) Reinforcement Learning (MISIS) Aprendizaje por refuerzo (MaIA) Aprendizaje por refuerzo profundo (MaIA) Introducción a la inteligencia artificial contemporánea (MaIA) Métricas de calidad de software (MISO) Programación funcional con aplicaciones en Scala (MISO) Master Luis Bautista – Leonardo Angel – Raul de la Rosa – Lucas Gandara – Transfer Learning for robot environments (2025) Sebastian Lemus – Refinement types for adaptive systems (2025) Luis Alejandro Medina – Testing Deep RL programs (2025) Laura Rodriguez – Back-in-time debuggers for RL (2024) Julio Cesar – Analysis of post-quantum cryptography algorithms (2024) Michel Patiño – Explainability in RL (2023) Mateo Sanabria – Self-healing systems (2021 – 2022) Sergio Cardenas – Completeness Analysis for COP (2021 – 2022) Adriana Paola Bonilla – program analysis (2021) Christian Sepulveda – program analysis (2021) Miller Trujillo – Symbolic analysis for algorithmic diversity (2021) Juan Sebastián Sosa – Distributed Petri nets (2020 – 2021) Stephannie Jimenez – Cross-language code clone detection for mobile platforms (2020 – 2021) Leonardo Merchan – DSL for IoT discovery (2020) Andres Felipe Carrion – Mining RL python projects (2020) Tomas Orozco – Causality models (2018 – 2020) Edgar Margffoy – Multi-GPU distribution of single-batch, time-dependent linear products (2019-2020) Carlos Mario Cáceres – Multi-Strategy self-adaptive software model for cyber-physical systems (2019-2020) Mauricio Montaña – Cross-language clone detection (2019) Jairo Ariza – Adaptive IoT architectures (2018-2019) Sebastián Sanchez – Evaluation of Distributed ledgers (2018 – 2019) Christian Poveda – Bounded Const Generics in Rust (2018-2019) Juan Camilo Tangarife – Authorization and authentication for IoT devices (2018) Carlos Saavedra – Authorization and authentication for IoT devices (2018) Jorge Humberto Castro – Resolución de Conflictos de Contexto Automatizado por Machine Learning (2017) Undergrad Juan Felipe Carballo (2025) Nicolas Londoño (2025) Santiago Rodriguez (2025) Sebastian Ospino (2025) Camilo Morillo (2024) Felipe Nuñez (2024) Javier Cerino (2024) Juan David Salguero (2024) Juan Camilo Bonet (2024) Isabela Martinez (2024) Sebastian Caceres (2024) Javier David Peniche (2024) Luis Felipe Dussan (2024) Juan Camilo Gonzalez (2024) Camilo Aguilar (2023) Mario Medina (2023) Nicolas Chalee (2023) Daniel Zambrano (2023) Jhoan Díaz (2023) Andres Ochoa (2023) Andres Orozco (2023) Nicolas Angarita (2023) Pietro Erlich (2022) Juan Felipe Rubio (2022) Juan Sebastián Gomez (2021) Miguel Hoyos (2021) Andrés Silva (2021) Yeisson Tarazon (2021) Mateo Salcedo (2020) Gabriel Cubillos (2020) Valentina Chacon (2020) Juan Sebastián Numpaque (2020) Luis Carlos Garavito (2020) Kelvin Estupiñan (2020) Sergio Cardenas (2020) Juan Felipe Ramos (2020) Daniel Agudelo (2020) Juan Sebastián Sosa (2019) Jose Daniel Fandiño (2019) Juan Manuel Lovera (2018) Tomas Venegas (2018) Juan Diego Chaves (2018) Juan Camilo Bages (2018) Santiago Beltran (2017) Others Camilo Cabrera – Master Juan Fernando – Master All artifact related to our research are available at our GitHub team: https://github.com/orgs/FLAGlab/teams Activities of service to the community as a reviewer or as part of the organization committees of scientific events Organization ECOOP 2026 (workshop chair) ACSOS 2023-2025 (publicity co-chair) – 2026 (Artifacts co-chair) ICSME @ Uniandes, Bogotá Colombia – 2023 SEAMS – 2022 (OC) FSE workshop on Software Testing, A-TEST – LANGETI – 2020, 2021 Ibero-American Conference on Software Engineering, CibSE – 2018 Workshop on Live Adaptation of Software SYstems, LASSY – 2016, 2017, 2018 Workshop on Logic, Languages, Information, and Computation, WoLLIC – 2018 Refereeing and Reviewing IEEE Access (2020) Journal on Information and Software Technology – (2022) Jornal of Object Technology – (2022) Transactions on Neural Networks and Learning Systems (2020) IEEE Transactions on Systems, Man and Cybernetics: Systems (2016,2017) IEEE Transactions on Services Computing (2015) IEEE Transactions on Software Engineering (2014) Expert Systems with Applications (2014) Science of Computer Programming Journal (2013) [publons profile] Program committees/External reviews Venue – [# of reviews] (year of review) MPLR – [3](2025) DSL – ACSOS posters – (2021) MSR Data showcase – [6](2021) Congreso Chileno de Computación [4]",
  "content_length": 14330,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:40"
}