{
  "name": "Niculae Sebe",
  "homepage": "http://disi.unitn.it/~sebe",
  "status": "success",
  "content": "Home Prof. Dr. Nicu SebeDept. of Information Engineering and Computer ScienceLeader of Multimedia and Human Understanding Group (MHUG)University of Trento Address:  via Sommarive 9, 38123 Povo-Trento, ItalyEmail:  sebe AT disi DOT unitn DOT itTelephone:  +39-0461 28 2989 Fax:  +39-0461 28 3939Personal:  [Google Scholar] [DBLP] ​ Research Interests Research Activities Editorials Publications Awards Students Research Interests The main research interests relate to the investigation and implementation of new techniques in the fields of computer vision and multimedia. Specifically, in computer vision, I address a large spectrum of themes including human-behavior analysis, action recognition, 2D/3D object detection, large-scale event detection and video analysis, etc. In multimedia, my research focuses on three aspects: multimedia information retrieval, social signals processing and affective computing. The specific research topics include cross media retrieval, multi-modal learning, social media analysis, emotion recognition, multimodal brain-computer interfaces, etc. Check the recent papers for more about my research details on MHUG publications. Research Activities Program Chair, International Conference on Computer Vision (ICCV), Venice, October 2017General Chair, International Conference on Multimedia Retrieval, Bucharest, June 2017Program Chair, European Conference on Computer Vision (ECCV), Amsterdam, October 2016General Chair, International Conference on Multimedia Modelling, Miami, January 2016Area Chair for International Conference on Computer Vision, Santiago, Chile, December 2015Area Chair for ACM Multimedia (MM), Brisbane (Australia), October 2015General Chair, ACM Multimedia (MM), Barcelona, October 2013General Chair, International Conference on Affective Computing and Intelligent Interaction (ACII), Geneva, September 2013Program Chair, International Conference on Multimedia Modelling, Huangshan, January 2013Area Chair for ACM Multimedia (MM), Nara (Japan), October 2012Program Chair for the International Conference on Multimodal Interfaces (ICMI), Alicante, November 2011Program Chair, ACM Multimedia (MM), Scottsdale, December 2011Area Chair for the Asian Conference on Computer Vision (ACCV), Queenstown (NZ), November 2010Track Chair International Conference on Pattern Recognition (ICPR), Istanbul, August 2010General Chair of the International Conference on Image and Video Retrieval (CIVR), Beijing, July 2010 (B ranking).Area Chair European Conference on Computer Vision (ECCV), Heraklion, September 2010 (A ranking).Area Chair Asian Conference on Computer Vision (ACCV), Xian, September 2009 (B ranking).Track Chair for the International World Wide Web conference (WWW), Madrid, April 2009 (A* ranking).General Chair of the International Workshop on Image Analysis for Multimedia Interactive Services (WIAMIS), London, 6-8 May 2009.Workshop Chair of the 3rd International Workshop on Human-centered Computing (HCM08) - in conjunction with ACM Multimedia 2008.General Chair of IEEE International Conference on Automatic Face and Gesture Recognition, Amsterdam, 17-19 September 2008.Area Chair, IEEE International Conference on Computer Vision and Pattern Recognition (CVPR), June 2008.Workshop Chair of the 2nd International Workshop on Human-centered Computing (HCM07) - in conjunction with ACM Multimedia 2007.Workshop Chair of the IEEE International Workshop on Human Computer Interaction (HCI07) - in conjunction with the 11th International Conference on Computer Vision (ICCV 2007)General Chair of the International Conference on Image and Video Retrieval (CIVR 2007), Amsterdam, 9-11 July 2007.Program Chair of the International Workshop on Multimedia Content Analysis and Mining, Weihai, China, June 2007.Chair of the IS&T/SPIE Conference on Multimedia Content Access: Algorithms and Systems, San Jose, CA, January 2007.General Chair of Asia-Pacific Workshop on Information Processing (VIP 2006), Beijing, China, 7-9 November 2006.Workshop Chair of the 1st International Workshop on Human-centered Computing (HCM06) - in conjunction with ACM Multimedia 2006.Workshop Chair of the International Workshop on Human Computer Interaction (HCI06) - in conjunction with the 9th European Conference on Computer Vision (ECCV 2006)Chair of the IS&T/SPIE Conference on Multimedia Content Analysis, Management, and Retrieval, San Jose, CA, January 2006.Workshop Chair of the IEEE International Workshop on Human Computer Interaction (HCI05) - in conjunction with the 10th International Conference on Computer Vision (ICCV 2005)Workshop Chair of the 6th ACM SIGMM International Workshop on Multimedia Information Retrieval (MIR04) - in conjunction with ACM Multimedia 2004Workshop Chair of the International Workshop on Human Computer Interaction (HCI04) - in conjunction with the 8th European Conference on Computer Vision (ECCV 2004)Workshop Chair of the 5th ACM SIGMM International Workshop on Multimedia Information Retrieval (MIR03) - in conjunction with ACM Multimedia 2003Technical Program Chair and Editor of the Proceedings for International Conference on Image and Video Retrieval - CIVR'2003 Editorials Author of Machine Learning in Computer Vision, Springer Verlag, ISBN 1-4020-3274-9, May 2005Author of Robust Computer Vision - Theory and Applications, Kluwer Academic Publishers, ISBN 1-4020-1293-4, April 2003Guest Editor for the IEEE Transactions on Big Data, Special Issue on Big Media Data: Understanding, Search, and Mining, Summer 2016.Guest Editor for the Journal on Multimodal User Interfaces, Special Issue on Emotion Recognition in the Wild Fall 2015.Guest Editor for the Image and Vision Computing Journal, Special Issue on Event-based Media Processing and Analysis , Fall 2015.Guest Editor for Machine Vision and Applications, Special Issue on Contextual Visual Computing, vol. 25, issue 7, October 2014.Guest Editor for IEEE MultiMedia, Special Issue on Large Scale Geo-Social Multimedia Computing, vol. 21, issue 3, July-September 2014.Guest Editor for IEEE Transactions on Multimedia, Special Issue on Socio-Mobile Media Analysis and Retrieval, vol. 16, issue 3, April 2014.Guest Editor for Computer Vision and Image Understanding, Special Issue on Learning from Multiple Evidences for Large Scale Multimedia Analysis vol. 118, issue 1, January 2014.Guest Editor for International Journal of Computer Vision, Special Issue on Human-Computer Interaction: Real-Time Vision Aspects of Natural User Interfaces vol. 101, issue 3, February 2013.Guest Editor for the Journal of Visual Communication and Image Representation, Special Issue on Large-Scale Multimedia Search, vol. 21, issue 8, November 2010.Guest Editor for the IEEE Transactions on Multimedia, Special issue on Multimodal Affective Interaction vol. 12, issue 6, October 2010.Guest Editor for the Image and Vision Computing Journal, Special Issue on Face and Gesture Recognition, vol. 28, nr. 5, May 2010.Guest Editor for the ACM Transactions on Multimedia Computing Communication and Applications Special Issue on Multimedia Analysis, Vol 4, No 4, 2008.Guest Editor for Computer Vision and Image Understanding, Special Issue on Similarity Matching, Vol 110, No 3, June 2008.Guest Editor for the Image and Vision Computing Journal Special Issue on Human-computer Interaction, Vol 25, No. 12, December 2007.Guest Editor for the IEEE Computer, Special Issue on Human-centered Computing, Vol 40, No 5, May 2007.Guest Editor for the ACM Transactions on Multimedia Computing Communication and Applications Special Issue on Multimedia Information Retrieval, Vol 2, No.1 February 2006.Guest Editor for the ACM Multimedia Systems Journal Special Issue on Systems and Architectures of Multimedia Information Retrieval, Vol 10, No. 6, October 2005.Guest Editor for Computer Vision and Image Understanding Special Issue on Video Retrieval and Summarization, Vol. 92, No. 2-3, November/December, 2003 Selected Publications Yan Yan, Elisa Ricci, Ramanathan Subramanian, Gaowen Liu, Oswald Lanz, Nicu Sebe:​ A Multi-Task Learning Framework for Head Pose Estimation under Target Motion. IEEE Trans. Pattern Anal. Mach. Intell. (TPAMI) 38(6): 1070-1083 (2016)Xavier Alameda-Pineda, Jacopo Staiano, Ramanathan Subramanian, Ligia Maria Batrinca, Elisa Ricci, Bruno Lepri, Oswald Lanz, Nicu Sebe: SALSA: A Novel Dataset for Multimodal Group Behavior Analysis. IEEE Trans. Pattern Anal. Mach. Intell. (TPAMI) 38(8): 1707-720 (2016)Zhigang Ma, Yi Yang, Nicu Sebe, Alexander G. Hauptmann: Knowledge Adaptation with PartiallyShared Features for Event Detection Using Few Exemplars. IEEE Trans. Pattern Anal. Mach. Intell. (TPAMI) 36(9): 1789-1802 (2014)Zhigang Ma, Yi Yang, Feiping Nie, Nicu Sebe, Shuicheng Yan, Alexander G. Hauptmann: Harnessing Lab Knowledge for Real-World Action Recognition. International Journal of Computer Vision (IJCV) 109(1-2): 60-73 (2014)Anoop Kolar Rajagopal, Subramanian Ramanathan, Elisa Ricci, Radu L. Vieriu, Oswald Lanz, Kalpathi Ramakrishnan, Nicu Sebe:Exploring Transfer Learning Approaches for Head Pose Classification from Multi-view Surveillance Images. International Journal of Computer Vision (IJCV) 109(1-2): 146-167 (2014)Elisa Ricci, Gloria Zen, Nicu Sebe, Stefano Messelodi: A Prototype Learning Framework Using EMD: Application to Complex Scenes Analysis. IEEE Trans. Pattern Anal. Mach. Intell. (TPAMI) 35(3): 513-526 (2013)Roberto Valenti, Nicu Sebe, Theo Gevers: What Are You Looking at? - Improving Visual Gaze Estimation by Saliency. International Journal of Computer Vision (IJCV) 98(3): 324-334 (2012)Jie Yu, Jaume Amores, Nicu Sebe, Petia Radeva, Qi Tian: Distance Learning for Similarity Estimation. IEEE Trans. Pattern Anal. Mach. Intell. (TPAMI) 30(3): 451-462 (2008)Jaume Amores, Nicu Sebe, Petia Radeva: Context-Based Object-Class Recognition and Retrieval by Generalized Correlograms. IEEE Trans. Pattern Anal. Mach. Intell. (TPAMI) 29(10): 1818-1833 (2007)Dionysius P. Huijsmans, Nicu Sebe: How to Complete Performance Graphs in ",
  "content_length": 11540,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:38"
}