{
  "name": "Nidhi Simmons",
  "homepage": "https://pure.qub.ac.uk/en/persons/nidhi-simmons",
  "status": "success",
  "content": "Nidhi Simmons - Queen's University Belfast View Scopus Profile Nidhi Simmons Dr Lecturer and Royal Academy of Engineering Research Fellow, School of Electronics, Electrical Engineering and Computer ScienceInstitute of Electronics, Communications & Information Technology https://orcid.org/0000-0002-8076-9607 EmailNidhi.Simmonsqub.acuk 20152025 Research activity per year Personal profile ParticularsNidhi Simmons is a Lecturer and Royal Academy of Engineering (RAEng) Research Fellow at the Centre for Wireless Innovation (CWI), Queen’s University Belfast (QUB). Her research focuses on delivering ultra-reliable communications within 5G/6G networks using Machine Learning (ML) approaches. She received her M.Sc. (Distinction) in Wireless Communications and Signal Processing from the University of Bristol, U.K., in 2012. Through funding from the Queen’s University Belfast studentship, she completed her PhD in Electrical Engineering in December 2018. From January 2019 to August 2020, she worked as a Research Fellow at CWI, QUB, where her research focused on wireless channel characterization and modeling. In 2020, she secured the Royal Academy of Engineering Research Fellowship worth £500k (2020–2026) to pursue her research on devising ML solutions for ultra-reliable communications in future 5G+ networks. In addition, she has been awarded the EPSRC New Investigator Award (2025–2028), building on her recent results to further develop tailored ML solutions to shape the future of ultra-reliable 6G networks, bringing her total secured research funding to ~£900k. Nidhi has authored several IEEE journal and conference papers and was a recipient of the Best Paper Award at IEEE ANTS in December 2023. She is an IEEE Senior Member and has served as an Organising Committee Member for IEEE ANTS 2024, a Co-Chair of the Recent Results Track at IEEE VTC Fall 2024, and a Technical Programme Committee (TPC) Member for IEEE GLOBECOM 2023 and 2025 (Machine Learning for Communications and Communications Theory tracks). She is an active member of IEEE Women in Engineering and the IEEE Communications Society and serves as a reviewer for several IEEE journals and letters. Beyond research, Nidhi is deeply committed to mentoring early-career researchers and PhD students. She actively promotes Women in Engineering and STEM, participating in outreach initiatives such as open days, PhD induction events, and keynote talks at the Edinburgh Science Festival (2021) and Women in Tech Belfast (2022). As part of her commitment to diversity and inclusion, she serves as a mentor for the RAEng Graduate Engineering Engagement Programme (2024–2025), supporting engineering students from underrepresented backgrounds in securing employment.Research InterestsHer research interests include physical-layer security, channel characterization and modeling, ultra-reliable communications, machine-learning for communications and machine learning for ultra-reliable 5G+/6G Fingerprint Dive into the research topics where Nidhi Simmons is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Models Computer Science 100% Channels Computer Science 75% Model Physics 67% Outage Probability Computer Science 49% Channel Interference Computer Science 44% Environment Physics 33% Communication Computer Science 31% Probability Density Function Computer Science 31% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2015 2018 2024 2025 21 Conference contribution 14 Article Research output per year Research output per year Channel measurements at 6.4 GHz for IEEE 802.11be WLANChaudhry, N., Cotton, S. L., Simmons, N., Da Silva, C. R. C. M., Yurduseven, O., Sofotasios, P. C., Matthaiou, M. & Duong, T. Q., 01 Jan 2025, 2024 IEEE 35th International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC): Proceedings. Institute of Electrical and Electronics Engineers Inc., 7 p. (IEEE International Symposium on Personal, Indoor and Mobile Radio Communications, PIMRC: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution wireless local area network 100% Scale Fading 100% Local Area Network 100% Access Point 50% Information Loss 50% Characteristics of 6.4 GHz radio channels used for IEEE 802.11bn under obstructed LOS conditionsChaudhry, N., Cotton, S., Simmons, N., Da Silva, C. R. C. M., Yurduseven, O., Sofotasios, P. C., Matthaiou, M. & Duong, T. Q., 05 Mar 2025, (Accepted) 2025 IEEE International Symposium on Antennas and Propagation and North American Radio Science Meeting: Proceedings. Institute of Electrical and Electronics Engineers Inc., (IEEE International Symposium on Antennas and Propagation and North American Radio Science Meeting: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Impact of calibration in ML-aided wireless resource allocationRaina, R., Simmons, N., Simmons, D. E., Yacoub, M. D. & Duong, T. Q., 01 Aug 2025, (Accepted) IEEE Globecom Workshops 2025: Proceedings. (IEEE Globecom Workshops: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Impact of Platt scaling on calibration in ML-based wireless resource allocationRaina, R., Simmons, N., Simmons, D. E., Yacoub, M. D. & Cotton, S. L., 03 Sept 2025, 2025 IEEE International Conference on Machine Learning for Communication and Networking (ICMLCN): Proceedings. Institute of Electrical and Electronics Engineers Inc., 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Loss Function 100% Outages 100% Learning System 100% Machine Learning 100% Resource Allocation 100% 1 Downloads (Pure) A simulation framework for cooperative reconfigurable intelligent surface based systemsSimmons, N., Browning, J., Cotton, S., Sofotasios, P., Morales-Jimenez, D., Matthaiou, M. & Abbasi, M. A. B., Jan 2024, In: IEEE Transactions on Communications. 72, 1, p. 480 - 495 16 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Simulation 100% Phase Error 100% Channels 66% Radiology Information System 66% Operating Condition 33% 10 Citations (Scopus) 117 Downloads (Pure) View all 35 research outputs Prizes Best Workshop Paper Award Raina, R. (Recipient), Simmons, N. (Recipient), Simmons, D. E. (Recipient) & Yacoub, M. D. (Recipient), 2023Prize: Prize (including medals and awards) Outage Probability 100% Closed Form 100% Allocation 100% \"Research excellence\" EPS Postdoc Prize 2020Simmons, N. (Recipient), 24 Sept 2020Prize: Prize (including medals and awards) Awards 100% Research 100% Research Excellence 100% Research Performance 100% External Partner 100% Royal Academy of Engineering Research FellowSimmons, N. (Recipient), 01 Sept 2020Prize: Fellowship awarded competitively Communication 100% Engineering 100% Academy 100% Research Grants 100% Interpersonal Communication 100% Activities Activities per year 2014 2015 2022 2023 2025 10 Membership of peer review panel or committee 3 Other 1 Invited or keynote talk at national or international conference 1 Invited talk Activities per year Supervising Research Students TrainingSimmons, N. (Participant)25 Nov 2025Activity: Other activity types › Other IEEE Global Communications Conference 2023 (Event)Simmons, N. (Member)08 Jun 2023 → …Activity: Membership types › Membership of peer review panel or committee 2023 IEEE Global Communications Conference, GLOBECOM 2023 (Event)Simmons, N. (Member)23 May 2023 → …Activity: Membership types › Membership of peer review panel or committee Institute of Electrical and Electronics Engineers (External organisation)Simmons, N. (Member)28 Apr 2023 → …Activity: Membership types › Membership of peer review panel or committee The Economy of ThingsSimmons, N. (Invited speaker)08 Jun 2022Activity: Talk or presentation types › Invited or keynote talk at national or international conference View all 15 activities",
  "content_length": 8378,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:40"
}