{
  "name": "Nidhi Hegde 0001",
  "homepage": "https://sites.ualberta.ca/~nidhih",
  "status": "success",
  "content": "Nidhi Hegde Nidhi Hegde Associate Professor, Department of Computing Science Canada CIFAR AI Chair, Fellow, Amii University of Alberta Contact Office: ATH 3-04 Email: nidhi.hegde(at)ualberta.ca Department of Computing Science 2-21 Athabasca Hall University of Alberta Edmonton, Alberta, Canada T6G 2E8 My Research My research has spanned many areas such as resource allocation in networking, smart grids, social information networks, machine learning. Broadly, my interest lies in gaining a fundamental understanding of a given system and the design of robust algorithms. More recently my research focus has been on fundamental approaches to robust and trustworthy machine learning. This includes notions such as privacy, fairness, and robustness. The applications span a wide range of machine learning models including classification, bandits, language models,etc. Bio I'm an Associate Professor in the Department of Computing Science at the University of Alberta and a Canada CIFAR AI Chair and Fellow at the Alberta Machine Intelligence Instribute (Amii). Before joining the University of Alberta, I spent many years in industry research labs. Most recently, I was a Research team lead at Borealis AI (a research institute at Royal Bank of Canada), where my team worked on privacy-preserving methods for machine learning models and other applied problems for RBC. Prior to that, I spent many years in research labs in Europe working on a variety of interesting and impactful problems. I was a researcher at Bell Labs, Nokia, in France from January 2015 to March 2018, where I led a new team focussed on Maths and Algorithms for Machine Learning in Networks and Systems, in the Maths and Algorithms group of Bell Labs. I also spent a few years at the Technicolor Paris Research Lab working on social network analysis, smart grids, and privacy in recommendations.",
  "content_length": 1864,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:39"
}