{
  "name": "Niels Landwehr",
  "homepage": "https://www.uni-potsdam.de/en/cs-dsia/team/prof-dr-niels-landwehr.html",
  "status": "success",
  "content": "Prof. Dr. Niels Landwehr - Data Science in Agriculture - University of Potsdam JavaScript is not activated in your browser. Please activate JavaScript to use the whole functionality of this website! Skip to main contentExplore the UP Overview News and Announcements About the UP You at UP UP Experience Publications Faculties Faculties Law Faculty Faculty of Arts Faculty of Human Sciences Faculty of Economics and Social Sciences Faculty of Science Digital Engineering Faculty Faculty of Health Sciences Structure Overview Boards and Committees Directorate Central and Scientific Institutions University Library Other Institutions International Campus Overview International Profile From Abroad Going Abroad International@Home Contact Corporate Community Relations Overview Business Partners Corporate Services Start-Up and Transfer Universitätsgesellschaft Potsdam e.V. Alumni-Programm Home Intranet Emergency Uni A-Z German Sign Language Easy-to-read Sitemap Close Close DeutschEnglishProf. Dr. Niels LandwehrProf. Dr. Niels LandwehrCloseStudyingStudying at the UPWhat to StudyApplication and EnrollmentStudyingAdvising and ServicesDates and DeadlinesResearchResearch at the UPProfiles, Programs and ProjectsResearch FundingOpen ScienceResearch DataCooperations and PartnershipsYoung AcademicsUniversityExplore the UPOrganizationCorporate Community RelationsCampus InternationalFörderinstrumenteWorking at the UPOnline ServicesAccount.UPBI.UPMail.UP (Webmailbox)PULSMoodleUniversity LibraryEvaluation Portal (PEP)Internship PortalZIM – Center for IT and MediaCloseProf. Dr. Niels Landwehrtelephone:+49 331 5699 913fax:+49 331 977 3022E-Mail:landwehrucs.uni-potsdampdeaddress: Campus Griebnitzsee University of Potsdam Department of Computer Science Building 4, Office 0.13 August-Bebel-Str. 89 14482 Potsdam, Germany Until 31.03.2021, I was a professor for \"Data Science in Agriculture\" at the Institute of Computer Science in a joint appointment with the Leibniz Institute of Agricultural Engineering and Bioeconomy (ATB).  As of 01.04.2021, I have moved to a professorship for \"Data Science\" at the University of Hildesheim (new home page currently under construction). We therefore do not offer any courses at the University of Potsdam any more.My research interests are in machine learning and computational data analysis. In addition to developing novel methods and studying their statistical and algorithmic properties, we also work on different application problems. We currently focus on applications of machine learning to agricultural and bioeconomic production systems. I have also worked in joint projects with partners from industry, for example on targeting marketing, IT-security, and the evaluation of ranking models in information retrieval, and with researchers in psychology (models of human eye movements) and geophysics (seismic hazard analysis). For an up-to-date list of publications, also see my Google Scholarprofile.Hanna Drimalla, Tobias Scheff er, Niels Landwehr, Irina Baskow, Stefan Roepke, Behnoush Behnia, and Isabel Dziobek. Towards the Automatic Detection of Social Biomarkers in Autism Spectrum Disorder: Introducing the Simulated Interaction Task (SIT). Nature Digital Medicine 3 (25), 2020.  Sabrina Hempel, Julian Adolphs, Niels Landwehr, David Janke, and Thomas Amon. How the selection of training data and modeling approach aff ects the estimation of ammonia emissions from a naturally ventilated dairy barn - classical statistics versus machine learning. To appear in Sustainability, 2020.  Ahmed Abdelwahab and Niels Landwehr. Deep Distributional Sequence Embeddings Based on a Wasserstein Loss. ArXiv:1912.01933, 2019.  Ahmed Adbelwahab and Niels Landwehr. Quantile Layers: Statistical Aggregation in Deep Neural Networks for Eye Movement Biometrics.  Proceedings of the 30th European Conference on Machine Learning (ECML-2019), Würzburg, Germany, 2019.  Norman Abrahamson, Nicolas Kühn, Melanie Walling, and Niels Landwehr. Probabilistic Seismic Hazard Analysis in California Using Nonergodic Ground-Motion Prediction Equations. Bulletin of the Seismological Society of America 109 (4): 1235-1249, 2019.  Hanna Drimalla, Niels Landwehr, Ursula Hess, and Isabel Dziobek. From face to face: the contribution of facial mimicry to cognitive and emotional empathy. Cognition and Emotion 33 (8):1672-1686, 2019.  Susanne Theuerl, Christiane Herrmann, Monika Heiermann, Philipp Grundmann, Niels Landwehr, Ulrich Kreidenweis, and Anette Prochnow. The Future Agricultural Biogas Plant in Germany: A Vision.  Energies 2019, 12(3), 396, 2019.Silvia Makowski, Lena Jäger, Ahmed Abdelwahab, Niels Landwehr, and Tobias Scheffer. A Discriminative Model for Identifying Readers and Assessing Text Comprehension from Eye Movements. Proceedings of the29th European Conference on Machine Learning (ECML-2018), Dublin, Ireland, 2018.  Hanna Drimalla, Niels Landwehr, Irina Baskow, Behnoush Behnia, Stefan Roepke, Isabel Dziobek, and Tobias Scheff er. Detecting Autism by Analyzing a Simulated Social Interaction. Proceedings of the 29th European Conference on Machine Learning (ECML-2018), Dublin, Ireland, 2018.  Sybille Landwehr-Kenzel, Anne Zobel, Henrike Hoffmann, Niels Landwehr, Michael Schmueck-Henneresse, Thomas Schachtner, Andy Roemhild, and Petra Reinke. Ex vivo expanded natural regulatory T-cells from patients with end stage renal disease or kidney transplantation are useful for autologous cell therapy.Kidney International 93(6):1452-1464,  2018.  Matthias Bussas, Christoph Sawade, Nicolas Kühn, Tobias Scheffer, Niels Landwehr. Varying-Coefficient Models for Geospatial Transfer Learning (draft).Machine Learning 106:1419--1440, 2017.  Ahmed Abdelwahab, Reinhold Kliegl, and Niels Landwehr. A Semiparametric Model for Bayesian Reader Identification. Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing (EMNLP-2016), Austin, Texas, 2016.Niels Landwehr, Nicolas Kühn, Tobias Scheffer, and Norman Abrahamson. A Non-Ergodic Ground-Motion Model for California with Spatially Varying Coefficients. Bulletin of the Seismological Society of America 106(6):2574-2583, 2016.Paul Prasse, Christoph Sawade, Niels Landwehr, and Tobias Scheffer. Learning to Identify Concise Regular Expressions that Describe Email Campaigns. Journal of Machine Learning Research 16:3687−3720, 2015.  Niels Landwehr, Sebastian Arzt, Tobias Scheffer, and Reinhold Kliegl. A Model of Individual Differences in Gaze Control During Reading. Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP-2014), Doha, Qatar, 2014.  Michael Großhans, Christoph Sawade, Tobias Scheffer, and Niels Landwehr. Joint Prediction of Topics in a URL Hierarchy. Proceedings of the 25th European Conference on Machine Learning (ECML-2014), Nancy, France, 2014.  Christoph Sawade, Steffen Bickel, Timo von Oertzen, Tobias Scheffer, and Niels Landwehr. Active Evaluation of Ranking Functions based on Graded Relevance (Extended Abstract) . Proceedings of the 23rd International Joint Conference on Artificial Intelligence (IJCAI-2013), Invited Track on Best Papers from Sister Conferences, Beijing, China, 2013.  Christoph Sawade, Steffen Bickel, Timo von Oertzen, Tobias Scheffer, and Niels Landwehr. Active Evaluation of Ranking Functions based on Graded Relevance . Machine Learning 92(1):41-64, 2013.  Christoph Sawade, Niels Landwehr and Tobias Scheffer. Active Comparison of Prediction Models (with online appendix). Proceedings of the 26th Conference on Neural Information Processing Systems (NIPS-2012), Lake Tahoe, NV, USA, 2012. Oral spotlight presentation, top 5% out of 1467 submissions.  Christoph Sawade, Steffen Bickel, Timo von Oertzen, Tobias Scheffer, and Niels Landwehr. Active Evaluation of Ranking Functions based on Graded Relevance . Proceedings of the 23rd European Conference on Machine Learning (ECML-2012), Bristol, England, 2012. Best Paper Award.  Paul Prasse, Christoph Sawade, Niels Landwehr and Tobias Scheffer. Learning to Identify Regular Expressions that Describe Email Campaigns (with online appendix). Proceedings of the 29th International Conference on Machine Learning (ICML-2012), Edinburgh, Scotland, 2012.  Elisa Cilia, Niels Landwehr, and Andrea Passerini. Relational Feature Mining with Hierarchical Multitask kFOIL.Fundamenta Informaticae 113: 1-26, 2011.  Ingo Thon, Niels Landwehr, and Luc De Raedt. Stochastic Relational Processes: Efficient Inference and Applications. Machine Learning 82 (2): 239-277, 2011.  Christoph Sawade, Niels Landwehr, and Tobias Scheffer. Active Estimation of F-measures (with Online Appendix). Proceedings of the 24th Annual Conference on Neural Information Processing Systems (NIPS-2010), Vancouver, Canada, 2010.  Christoph Sawade, Niels Landwehr, Steffen Bickel, and Tobias Scheffer. Active Risk Estimation. Proceedings of the 27th International Conference on Machine Learning (ICML-2010), Haifa, Israel, 2010.  Niels Landwehr, Andrea Passerini, Luc De Raedt, and Paolo Frasconi. Fast learning of relational kernels. Machine Learning 78(3): 305-342, 2010.  Ingo Thon, Niels Landwehr, and Luc De Raedt. Applications of stochastic relational processes. Workshop on Analysis of Complex Networks at the 21st European Conference on Machine Learning (WS@ECML-2010), Barcelona, Spain, 2010.  Niels Landwehr. Trading Expressivity for Efficiency in Statistical Relational Learning (Ph.D. Thesis Abstract). SIGKDD Explorations 11(2): 59-60, 2009.  Ingo Thon, Bernd Gutmann, Martijn van Otterlo, Niels Landwehr, and Luc De Raedt. From non-deterministic to probabilistic planning with the help of statistical relational learning. Proceedings of the Workshop on Planning and Learning, in conjunction with the 19th International Conference on Automated Planning and Scheduling (WS@ICAPS-2009), Thessaloniki, Greece, 2009.  Elisa Cilia, Niels Landwehr, and Andrea Passerini. Mining Drug Resistance Relational Features with Hierarchical Multitask kFOIL.Proceedings of the Bio",
  "content_length": 17226,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:41"
}