{
  "name": "Nigel Phair",
  "homepage": "https://research.monash.edu/en/persons/nigel-phair",
  "status": "success",
  "content": "Nigel Phair - Monash University View Scopus Profile Nigel Phair Professor Professor, Department of Software Systems & Cybersecurity EmailNigel.Phairmonashedu 20122022 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2012 2012 2020 2022 2022 2 Conference Paper 1 Article Research output per year Research output per year Cybersecurity skills of com pany direc tors — ASX 100Phair, N. & Alavizadeh, H., 3 Jun 2022, In: Journal of Risk Management in Financial Institutions. 15, 4, p. 429-436 9 p.Research output: Contribution to journal › Article › Research › peer-review 3 Citations (Scopus) Mapping the Geography of Cybercrime: A Review of Indices of Digital Offending by CountryLusthaus, J., Bruce, M. & Phair, N., 2020, Proceedings - 5th IEEE European Symposium on Security and Privacy Workshops, EUROS&PW 2020. Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 448-453 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other 12 Citations (Scopus) Detecting illicit drugs on social media using Automated Social Media Intelligence Analysis (ASMIA)Watters, P. A. & Phair, N., 2012, Cyberspace Safety and Security - 4th International Symposium, CSS 2012, Proceedings. Xiang, Y., Lopez, J., Kuo, C.-C. J. & Zhou, W. (eds.). Berlin Germany: Springer, p. 66-76 11 p. (Lecture Notes in Computer Science; vol. 7672).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 15 Citations (Scopus)",
  "content_length": 2166,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:49"
}