{
  "name": "Nigel A. Beacham",
  "homepage": "https://www.abdn.ac.uk/people/n.beacham",
  "status": "success",
  "content": "Dr Nigel Beacham | The University of Aberdeen Dr Nigel Beacham Dr Nigel BeachamBSc. MSc. PhD. CEng. MBCS. CITP. MIScT, CSci. SFHEA.Senior Lecturer About Email Addressn.beacham@abdn.ac.ukTelephone Number+44 (0)1224 273878Office AddressRoom 220 Department of Computing Science Meston Building King's College Aberdeen AB24 3UE +44 (0) 1224 273 878School/DepartmentSchool of Natural and Computing Sciences Biography Dr Beacham is the Director of Education for the School of Natural and Computing Sciences. He is a Senior Lecturer within the School of Natural and Computing Sciences and a leading academic in the interdisciplinary field of Computer Science Education. With over 25+ years of experience collaborating with academics from various disciplines (such as Human-Computer Interaction, Business and Accounting, Geography and Geology, Civil and Building Engineering, Maths Education Support, Special Educational Needs, Educational Psychology and Teacher Education), he has come to be recognized for his innovative and pioneering educational research in the use and development of educational technologies embedded within inclusive education and pedagogies, supporting adult learners within HE who have Specific Learning Difficulties such as dyslexia and dyscalculia..His research is published in world renowned international peer-reviewed journals and conference proceedings including ED-MEDIA, AREA, JORSEN, Computing and Education. He is a journal reviewer for AACE JILR and reviews funding proposals for RUK. He is a member of the ACM, BCS, IST, AdvanceHE bodies and the AREA for a period. He began his research career working as a Research Assistant for the Teesside Business School researching the development and use of intelligent tutoring systems for educating trainee accountants. He then went on the work for the Geography Department at the University of Leicester developing and research e-learning systems for Geographers. He then worked for nine years for Loughborough University in a number of departments developing and research e-learning systems as part of undergraduate, postgraduate and continue professional development programmes, until moving to his current post at the University  of Aberdeen. Qualifications PhD Distributed Performance Support Systems 1998 - University of Teesside Memberships and Affiliations Internal Memberships Current Duties Director for Education, School of Natural and Computing Sciences He is the course coordinator and lecturer for the following courses: Principles of Software Engineering (CS3028) and Software Engineering and Professional Practices (CS3528) Human Computer Interaction (CS2506 and CS5075) Databases and Data Management (CS2019) and Database Systems and Big Data (CS5097 and CS5098) Past Duties Dr Beacham was previously the Director for UG Pathways (2021-2024) having been the Postgraduate Director for Teaching and Learning within the School of Natural and Computing Sciences (2017-18) and Director for Postgraduate Teaching within the Department of Computing Science (2012-18). His duties included: Head of Computing Science (Acting: Nov 2024 - Sep 2025) chair of the School Education Committee, NCS chair of the Computing Science Staff-Student Liaison Committee chair of the Computing Science Teaching and Learning Committee chair of the Computing Science internal and external exam board member of Senate member of the Physical Sciences and Engineering Ethics Board member of the NCS School Education Committee (Taught) member of the PGT Engagements and Communications Group member of the School Teaching and Learning Committee He was the admissions tutor for the advanced MSc programmes, i.e. Artificial Intelligence and for the conversion MSc programme, i.e. Information Technology. Past admin responsibilities included Web content manager for the Department of Computing Science and course coordinator for the following courses: TS1002: Tools for Science Information Technology (CS1017 and KL107S) Web Application Development (CS1025/CS1026 and CS1525/CS1524) Advanced Web Application Development (CS2509, CS2012 and CS2512) Software Quality Assurance and Control Technology (CS5569: postgraduate) Systems Analysis and Design (CS5037/CS5071) Advanced MSc Project (CS5950) Database Systems and Big Data (CS5097/CS5098) Security (CS4028 and CS4097) Information Security (CS5099 and CS50AH) Web Development (CS5077 and CS551S) Data Management (CS2019) Object-Oriented Programming (CS1527) UG Final Year Projects (CS4525, CS4594) External Memberships Dr Beacham is one of the main authors and developers of DyslexSim – A pack of photocopiable materials for raising awareness about dyslexia which includes activities and a simulation of visual difficulties associated with dyslexia on CD ROM. (on sale through iANSYST Ltd. from March 2005). He is also one of the main authors and developers of Dyscalculium – A screening tool for adults with dyscalculia (retired 2022) (https://shop.tribalgroup.co.uk/vmchk/Assessment-screening/DyscalculiUM.html). He is a referee for the peer-reviewed Journal of Interactive Learning Research (http://www.aace.org/pubs/jilr/default.htm) published by AACE. Member of the ACM since 2019. Member of the AdvanceHE since 2008 Member of the BCS and CEI since 2003 Research Research Overview Dr Beacham's research interests include: Computer Science Education and Human-Computer Interaction aspects of E-learning E-Pedagogies for Inclusion, Digital Inclusion within Schools, Colleges and Higher Education Specific learning difficulties (such as dyslexia) and assistive technologies Distributed Performance Support Systems and Computer-Based Training Research Areas Computing ScienceView Research AreaEducationView Research Area Research Specialisms Computing and Information TechnologyHuman-Computer Interaction Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Current Research Dr Beacham is currently investigating the role inclusive education and practices can play in the development of cloud-based security systems. In parallel to this work he is studying e-pedagogies for inclusion. Both streams of work provide ongoing findings for informing future policy and practice in the areas of inclusive education and digital inclusion. Collaborations Dr Beacham is currently working with colleagues as part of the Part Time and Short Cycle Higher Education (PT&SCHE) project. He is a member of the SQA Technology Industry Board and an external examiner for the University of Northampton. Funding and Grants Dr Beacham was awarded a grant of the project 'Developing NQTs E-Pedagogies for Inclusion' which is a partnership between the PICTAL research group, Inclusive Practice project and the Higher Education Academy Subject Centre ESCalate. Teaching Programmes BSc Computing ScienceUndergraduate, 4 year, September startBSc Computing Science and PhysicsUndergraduate, 4 year, September startBSc Computing Science and MathematicsUndergraduate, 4 year, September startBSc Data ScienceUndergraduate, 4 year, September startBSc Business Management and Information SystemsUndergraduate, 4 year, September startMA Business Management and Information SystemsUndergraduate, 4 year, September startMA ComputingUndergraduate, 4 year, September startMA Computing and MusicUndergraduate, 4 year, September startMSci Computing Science with Industrial PlacementUndergraduate, 5 year, September startMEng Computing Science (5 years)Undergraduate, 5 year, September startMEng Computing Science (Artificial Intelligence)Undergraduate, 5 year, September startMEng Computing Science (Cybersecurity)Undergraduate, 5 year, September startMEng Engineering in Electronic and Software EngineeringUndergraduate, 5 year, September startMSc Information TechnologyPostgraduate, 3 stage, September startMSc Information TechnologyPostgraduate, 3 stage, January startMSc Artificial IntelligencePostgraduate, 3 semester, September startMSc Artificial IntelligencePostgraduate, 3 semester, January start Courses Principles of Software Engineering CS3028Software Engineering And Professional Practice CS3528Human-Computer Interaction CS2506Human Computer Interaction CS5075Databases and Data Management CS2019Database Systems And Big Data CS5097Database Systems And Big Data CS5098Online course Teaching Responsibilities Dr Beacham is currently teaching on the following courses: Principles of Software Engineering (CS3028: undergraduate) Software Engineering and Professional Practice (CS3528: undergraduate) Human Computer Interaction (CS2506: undergraduate and CS5075: postgraduate) Dr Beacham also currently supervises student projects: Principles of Software Engineering and Software Engineering and Professional Issues (CS3028 and CS3528: undergraduate) Single and Joint Honours Computing Projects (CS4525, CS4529 and CS4594: undergraduate) MSc in Information Technology (CS5942: postgraduate) MSc Projects in Artificial Intelligence (CS5917: postgraduate) Business and Industry Applications of IT (CS3901: undergraduate) Past responsibilities for teaching included: Tools for Science (TS1002: undergraduate) Information Technology (CS1017: undergraduate) Web Application Development (CS1025 and CS1525: undergraduate and CS1026 and CS1524: distance learning) Advanced Web Application Development (CS2509: undergraduate, CS2012 and CS2512: undergraduate and CS2514 and CS2514: distance learning) Data Management (CS2015 and CS2018: undergraduate) Software Quality Assurance and Control Technology (CS5569: postgraduate) Introduction to Database Systems (CS5035: postgraduate and CS5070 distance learning) Web Technology (CS1518: undergraduate, CS5548: postgraduate and CS5574: distance learning) System Analysis and Design (CS5037: postgraduate and CS5071 distance learning)) Human Computer Interaction (CS5541: postgraduate and CS5586 distance learning) Evaluation of AI Systems (CS506",
  "content_length": 13914,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:49"
}