{
  "name": "Nika Haghtalab",
  "homepage": "https://people.eecs.berkeley.edu/~nika",
  "status": "success",
  "content": "Nika Haghtalab - Homepage Nika Haghtalab Assistant Professor EECS Department, UC Berkeley. Sloan Fellow about research group teaching activities contact I am an Assistant Professor in the Department of Electrical Engineering and Computer Sciences at UC Berkeley. I am a co-director of the Center for the Theoretical Foundations of Learning, Inference, Information, Intelligence, Mathematics and Microeconomics at Berkeley (CLIMB) and a member of the Berkeley Artificial Intelligence Research (BAIR) Lab and the Theory Group at UC Berkeley. I work on a broad and versatile set of problems related to machine learning, algorithms, economics, and society. My work contributes to an emerging mathematical foundation for learning and decision-making systems in the presence of economic and societal forces. Important problem settings often addressed by my work include collaborative (and federated) learning, learning in markets and other economics settings, incentive-aware and robust learning, and foundations of machine learning generally. My work has been recognized by a Sloan fellowship (2024), Schmidt Sciences AI2050 award, NSF CAREER (2022), Google Research scholar award (2023), NeurIPS and ICAPS best paper awards, EC exemplary track paper awards, and several other industry awards and fellowships. Previously, I was an assistant professor in the CS department of Cornell University, in 2019-2020. Prior to that, I was a postdoctoral researcher at Microsoft Research, New England, in 2018-2019. I received my Ph.D. from the Computer Science Department of Carnegie Mellon University, where I was fortunate to be co-advised by Avrim Blum and Ariel Procaccia. My thesis titled Foundation of Machine Learning, by the People, for the People received the CMU School of Computer Science Dissertation Award (2018) and a SIGecom Dissertation Honorable Mention Award (2019). My CV can be found here. Preprints P2 Strategic Deletion in Centralized Learning Mechanisms By Nivasini Ananthakrishnann and Nika Haghtalab. Working paper, last update: Aug 2023. P3 Algorithmic Content Selection and the Impact of User Disengagement By Emilio Calvano, Nika Haghtalab, Ellen Vitercik, and Eric Zhao. [ arXiv ]. Working paper, last update: October 2024. P5 On Surjectivity of Neural Networks: Can you elicit any behavior from your model? By Haozhe Jiang, and Nika Haghtalab. Working paper, last update: May 2025. P7 Algorithms for Emergent Communication By Nivasini Ananthakrishnann, Mark Bedaywi, Michael I. Jordan, Stuart Russell, and Nika Haghtalab. Working paper, last update: May 2025. P8 Panprediction: Optimal Predictions for Any Downstream Task and Loss By Sivaram Balakrishnan, Nika Haghtalab, Daniel Hsu, Brian W Lee, and Eric Zhao. Working paper, last update: May 2025. [arXiv version] Publications C53 Distortion of Learning from Human Feedback: Pluralistic Alignment through Implicit Utilitarian Voting By Paul Golz, Nika Haghtalab, and Kunhe Yang. NeurIPS 2025: Proc. 38th Annual Conference on Neural Information Processing Systems, 2025. [ arXiv version ]. C52 From Style to Facts: Mapping the Boundaries of Knowledge Injection with Finetuning By Eric Zhao, Pranjal Awasthi, and Nika Haghtalab. NeurIPS 2025: Proc. 38th Annual Conference on Neural Information Processing Systems, 2025. [arXiv version]. C51 Sample-Adaptivity Tradeoff in On-Demand Sampling By Nika Haghtalab, Omar Montasser, and Mingda Qiao. NeurIPS 2025: Proc. 38th Annual Conference on Neural Information Processing Systems, 2025. [conference version]. T3 Multi-agent risks from advanced AI By Lewis Hammond et al. (long author list). Technical Report, Cooperative AI Foundation, February 2025 [ arXiv ]. C50 Leakage-Robust Bayesian Persuasion By Nika Haghtalab, Mingda Qiao, and Kunhe Yang. EC 2025: Proc. ACM Conference on Economics and Computationg. forthcoming [ arXiv ]. C50 Leakage-Robust Bayesian Persuasion By Nika Haghtalab, Mingda Qiao, and Kunhe Yang. EC 2025: Proc. ACM Conference on Economics and Computationg. forthcoming [ arXiv ]. C49 Learning With Multi-Group Guarantees For Clusterable Subpopulations By Jessica Dai, Nika Haghtalab, and Eric Zhao. ICML 2025: Proc. International Conference on Machine Learning. forthcoming [ arXiv ]. C48 Platforms for Efficient and Incentive-Aware Collaboration By Nika Haghtalab, Mingda Qiao, and Kunhe Yang. SODA 2025: Proc. Symposium on Discrete Algorithms, 2025. [ arXiv ]. C47 Truthfulness of Calibration Measures By Nika Haghtalab, Mingda Qiao, Kunhe Yang, and Eric Zhao. NeurIPS 2024: Proc. 37th Annual Conference on Neural Information Processing Systems, 2024. [arXiv] C46 Is Knowledge Power? On the (Im)possibility of Learning from Strategic Interactions By Nivasini Ananthakrishnan, Nika Haghtalab, Chara Podimata, Kunhe Yang. NeurIPS 2024: Proc. 37th Annual Conference on Neural Information Processing Systems, 2024. [arXiv] C45 Covert Malicious Finetuning: Challenges in Safeguarding LLM Adaptation By Danny Halawi, Alex Wei, Eric Wallace, Tony Wang, Nika Haghtalab, and Jacob Steinhardt. ICML 2024: Proc. International Conference in Machine Learning, 2024. [arXiv, conference version] J7 Smoothed Analysis with Adaptive Adversaries By Nika Haghtalab, Tim Roughgarden, Abhishek Shetty. Journal of the ACM. Supercedes the FOCS 2021 paper below. [JACM paper, journal version] C44 Delegating Data Collection in Decentralized Machine Learning By Nivasini Ananthakrishnan, Stephen Bates, Michael I. Jordan, and Nika Haghtalab. AISTATS 2024: Proc. International Conference on Artificial Intelligence and Statistics, 2024. [ arXiv ] C43 Can Probabilistic Feedback Drive User Impacts in Online Platforms? By Jessica Dai, Bailey Flanigan, Nika Haghtalab, Meena Jagadeesan, Chara Podimata. AISTATS 2024: Proc. International Conference on Artificial Intelligence and Statistics, 2024. [ arXiv ] C42 Smooth Nash Equilibria: Algorithms and Complexity By Constantinos Daskalakis, Noah Golowich, Nika Haghtalab, and Abhishek Shetty. ITCS 2024: Proc. Innovations in Theoretical Computer Science, 2024. [ arXiv ] C41 Communicating with Anecdotes By Nika Haghtalab, Nicole Immorlica, Brendan Lucier, and Markus Mobius, Divyarthi Mohan. ITCS 2024: Proc. Innovations in Theoretical Computer Science, 2024. [ arXiv, slides ] C40 Jailbroken: How Does LLM Safety Training Fail? By Alex Wei, Nika Haghtalab, and Jacob Steinhardt. NeurIPS 2023: Proc. 36th Annual Conference on Neural Information Processing Systems, 2023. [ arXiv ] Selected for NeurIPS oral presentation. C39 Calibrated Stackelberg Games: Learning Optimal Commitments Against Calibrated Agents By Nika Haghtalab, Chara Podimata, Kunhe Yang. NeurIPS 2023: Proc. 36th Annual Conference on Neural Information Processing Systems, 2023. [ arXiv ] Selected for NeurIPS spotlight presentation. C38 Smoothed Analysis of Sequential Probability Assignment By Alankrita Bhatt, Nika Haghtalab, Abhishek Shetty. NeurIPS 2023: Proc. 36th Annual Conference on Neural Information Processing Systems, 2023. [ arXiv ] Selected for NeurIPS spotlight presentation. C37 A Unifying Perspective on Multi-Calibration: Game Dynamics for Multi-Objective Learning By Nika Haghtalab, Michael I. Jordan, and Eric Zhao. NeurIPS\t2023: Proc. 36th Annual Conference on Neural Information Processing Systems, 2023. [ arXiv ] C36 Improved Bayes Risk Can Yield Reduced Social Welfare Under Competition By Meena Jagadeesan, Michael I. Jordan, Jacob Steinhardt, and Nika Haghtalab. NeurIPS\t2023: Proc. 36th Annual Conference on Neural Information Processing Systems, 2023. [ arXiv ] C35 Open Problem: The Sample Complexity of Multi-Distribution Learning for VC Classes By Pranjal Awasthi, Nika Haghtalab, and Eric Zhao. COLT 2023: Proc. 36th Annual Conference on Learning Theory, 2023. [ arXiv ] C34 Smoothed Analysis of Online Non-parametric Auctions By Naveen Durvasula, Nika Haghtalab, and Manolis Zampetakis. EC 2023: Proc. 24th ACM Conference on Economics and Computation, 2023. C33 Leveraging Reviews: Learning to Price with Buyer and Seller Uncertainty By Wenshuo Guo, Nika Haghtalab, Kirthevasan Kandasamy, and Ellen Vitercik. EC 2023: Proc. 24th ACM Conference on Economics and Computation, 2023. [ arXiv ] Exemplary Paper Award, AI Track, EC 2023. C32 Stochastic Minimum Vertex Cover in General Graphs: a 3/2-Approximation By Mahsa Derakhshan, Naveen Durvasula, and Nika Haghtalab. STOC 2023: Proc. 55th Annual ACM Symposium on Theory of Computing, 2023 [ submitted version ] C31 Competition, Alignment, and Equilibria in Digital Marketplaces By Meena Jagadeesan, Michael I. Jordan, and Nika Haghtalab. AAAI 2023: Proc. 37th AAAI Conference on Artificial Intelligence, 2023 [arXiv] C30 Oracle-Efficient Online Learning for Beyond Worst-Case Adversaries By Nika Haghtalab, Yanjun Han, Abhishek Shetty, and Kunhe Yang. NeurIPS 2022: Proc. 35th Annual Conference on Neural Information Processing Systems, 2022. [ arXiv ] Selected for NeurIPS oral presentation. C29 On-Demand Sampling: Learning Optimally from Multiple Distributions By Nika Haghtalab, Michael I. Jordan, and Eric Zhao. NeurIPS 2022: Proc. 35th Annual Conference on Neural Information Processing Systems, 2022. [ submitted version, arXiv ] Selected for NeurIPS oral presentation. Outstanding paper award at NeurIPS 2022. Selected for Symposium on the Foundations of Responsible Computing (FORC 2023) non-archival track. C28 Learning in Stackelberg Games with Non-myopic Agents By Nika Haghtalab, Thodoris Lykouris, Sloan Nietert, Alex Wei. EC 2022: Proc. 23nd ACM Conference on Economics and Computation, 2022 [ arXiv:2208.094076, EC version] C27 Smoothed Analysis with Adaptive Adversaries By Nika Haghtalab, Tim Roughgarden, Abhishek Shetty. FOCS 2021: Proc. 62nd Annual Symposium on Foundations of Computer Science, 2021. [ arXiv:2102:08446, slides] J6 Polarization Through the Lens of Learning Theory By Nika Haghtalab, Matthew O. Jackson, Ariel D. Procaccia. PNAS: Proceedings of the National Academy of Sciences, 2021. [ SSRN version, PNAS version] C26 One for One, or All for All: Equi",
  "content_length": 21741,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:54"
}