{
  "name": "Nikhil Muralidhar",
  "homepage": "https://www.stevens.edu/profile/nmurali1",
  "status": "success",
  "content": "Nikhil Muralidhar | Stevens Institute of TechnologySkip to ContentNikhil MuralidharAssistant ProfessorCharles V. Schaefer, Jr. School of Engineering and ScienceDepartment of Computer ScienceGateway Center S354(201) 216-5462[email protected]WebsiteEducationPhD (2022) Virginia Tech (Computer Science) MS (2015) George Mason University (Computer Science) BS (2012) Virginia Tech (Computer Science) ResearchAssistant Professor in the Department of Computer Science at Stevens Institute of Technology.At Stevens, I lead the ScAI (Scientific Artificial Intelligence) Lab. The primary research focus at ScAI lab entails developing machine learning models that also incorporate scientific knowledge (along with data) governing a process of interest. This area of research is termed Knowledge-Guided Machine Learning (KGML).Our group at ScAI lab is especially focused on leveraging scientific domain knowledge to improve model generalization, decision interpretability and reduce the negative effects of data paucity and noise. Most recently, we have been focused on leveraging machine learning techniques to address challenges in physics (specifically computational fluid dynamics) to alleviate the cost of expensive simulations using science-guided machine learning models.Other areas of research interest include:1. Transfer Learning & Domain Adaptation2. Multi-task & Meta Learning3. Time-series Forecasting & Anomaly Detection (especially in the context of Cyber-Physical Systems)4. Disease Modeling (COVID-19, Influenza-Like-illnesses)General InformationI completed my Ph.D (Aug. 22') from the Department of Computer Science at Virginia Tech advised by Prof. Naren Ramakrishnan and Prof. Anuj Karpatne. Prior to my Ph.D., I was part of the Big Data and Personalization team at The Washington Post and was primarily focused on developing and maintaining news article recommendation systems and online content optimization tools using multi-armed bandits.Institutional ServiceFaculty Search Committee MemberProfessional ServiceNeural Information Processing Systems ReviewerICLR Social (ML for Accelerating Scientific Discovery: Challenges and Opportunities) Lead OrganizerAAAI (Bridge Program on Knowledge-Guided ML) Co-OrganizerAI STATS Conference ReviewerInternational Conference on Learning Representations ReviewerNeural Information Processing Systems ReviewerNational Science Foundation Proposal ReviewerDepartment of Energy (ASCR) Proposal ReviewHonors and AwardsNominated by CS Dept. for College of Engg. Outstanding Doctoral Student Award -------------- 2022SIAM International Conference on Data Mining (SDM21) Travel Award --------------------------- 2021Applied ML Summer Research Fellowship Los-Alamos Nat. Lab - (7.5% Acceptance Rate) ------- 2021Expert Reviewer (International Conf. on Machine Learning) -------------------------------------- 2021First place: COVID-19 Symptom Data Challenge organized by Catalyst Health & Facebook ------ 2020Second Place: C3.ai COVID-19 Grand Challenge ------------------------------------------------- 2020Top 33% Ranking Reviewer Appreciation (International Conf. on Machine Learning) ------------- 2020National Science Foundation Urban Computing Fellowship -------------------------------------- 2016-2018Outstanding Academic Achievement Award - CS Dept., George Mason University --------------- 2015Patents and Inventions1. Muralidhar N., Han E., Rangwala H., inventors; WP Company LLc, assignee. Systems and Methods for Recommending Temporally Relevant News Content for Implicit Feedback Data. United States patent US 10,977,322. 2021 Apr 13.2. Nakayama K., Jin C., Sharma R., Muralidhar N., inventors; NEC Corp, assignee. Detection of false data injection attacks in power systems using multiplex invariant networks and domain knowledge. United States patent US 10,585,123. 2020 Mar 10Selected PublicationsJournal Publications1. Ashwin, NR., Tafti D., & Muralidhar N. Comparison of reduced order models based on dynamic mode decomposition and deep learning for predicting chaotic flow in a random arrangement of cylinders. Physics of Fluids 35.7 (2023). (Impact Factor: 4.6)2. Ashwin NR, Cao Z., Muralidhar N., Tafti D., & Karpatne A. Deep learning methods for predicting fluid forces in dense particle suspensions. Powder Technology. 2022 Mar 23:117303. (Impact Factor: 5.134)3. Muralidhar, N., Bu, J., Cao, Z., He, L., Ramakrishnan, N., Tafti, D., & Karpatne, A. (2020). Physics-Guided Deep Learning for Drag Force Prediction in Dense Fluid-Particulate Systems. Big Data, 8(5), 431-449.(Impact Factor: 2.128)4. Muralidhar, N., Tabassum, A., Chen, L., Chinthavali, S., Ramakrishnan, N., & Prakash, B. A. (2020). Cut-n-Reveal: Time Series Segmentations with Explanations. ACM Transactions onIntelligent Systems and Technology (TIST), 11(5), 1-26. (Impact Factor: 4.654)5. Muralidhar, N., Wang, C., Self, N., Momtazpour, M., Nakayama, K., Sharma, R., & Ramakrishnan, N. (2018). illiad: InteLLigent Invariant and Anomaly Detection in Cyber-Physical Systems. ACM Transactions on Intelligent Systems and Technology (TIST), 9(3), 35. (Impact Factor: 4.654)Conference Publications6. Sharma, M., Muralidhar N., & Ramakrishnan, N., Learning Non-linguistic Skills without Sacrificing Linguistic Proficiency. Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics. 2023. (Acceptance Rate 23.5%)7. Tabassum, A., Muralidhar, N., Kannan, R., & Allu, S. (2022, December). MatPhase: Material phase prediction for Li-ion Battery Reconstruction using Hierarchical Curriculum Learning. In 2022 IEEE International Conference on Big Data (Big Data) (pp. 1936-1941). IEEE. (Acceptance Rate 19.2%)8. Rathinavel, G., Muralidhar, N., O’Shea, T., & Ramakrishnan, N., Efficient Generative Wireless Anomaly Detection for Next Generation Networks. In MILCOM 2022-2022 IEEE Military Communications Conference (MILCOM) 2022 Nov 28. IEEE.9. Rathinavel, G., Muralidhar, N., O’Shea, T., & Ramakrishnan, N., Detecting Irregular Network Activity with Adversarial Learning & Expert Feedback . In Proceedings of the 22nd IEEE International Conference on Data Mining (ICDM), IEEE, 2022. (Acceptance Rate 20%)10. Muralidhar, N., Bu, J., Cao, Z., Raj, N., Ramakrishnan, N., Tafti, D., & Karpatne, A., “Phyflow: Physics-guided deep learning for generating interpretable 3D flow fields”. In Proceedings of the 21st IEEE International Conference on Data Mining (ICDM), IEEE, 2021. (Acceptance Rate 20%)11. Muralidhar, N., Zubair, A., Weidler, N., Gerdes, R., & Ramakrishnan, N. Contrastive Graph Convolutional Networks for Hardware Trojan Detection in Third Party IP Cores. In Proceedings of the 14th IEEE International Symposium on Hardware-Oriented Security and Trust (IEEE HOST) 2021.12. Rodriguez, A.*,Muralidhar, N.*, Adhikari, B., Tabassum, A., Ramakrishnan, N., & Prakash B.A. Steering a Historical Disease Forecasting Model Under a Pandemic: Case of Flu and COVID-19. In Proceedings of the 35th International Conference on Artificial Intelligence (AAAI) 2021 (https://arxiv.org/abs/2009.11407) - (Acceptance Rate 21%).13. Danielson, T. L., Pike J. A., Whiteside T., Mayer B., Muralidhar N., Self N., & Butler P. Machine Learning Using Open Data Sources for Detection of Nuclear Proliferation Activities (U). Aiken, SC : Savannah River National Laboratory, SRNL-STI-2021-00047. January 2021.14. Muralidhar, N., Bu, J., Cao, Z., He, L., Ramakrishnan, N., Tafti, D., Karpatne, A.PhyNet: Physics-guided Neural Networks for Particle Drag Force Prediction in Assembly. Proceedings of the 2020 SIAM International Conference on Data Mining (SDM20). Society for Industrial and Applied Mathematics 2020. [Selected for Publication in Special Issue on Best of SDM20] - (Acceptance Rate 21.3 %)15. Muralidhar, N., Muthiah, S., Nakayama, K., Sharma, R., & Ramakrishnan, N. (2019, December). Multivariate Long-Term State Forecasting in Cyber-Physical Systems: A Sequence to Sequence Approach. In 2019 IEEE International Conference on Big Data (IEEE Big Data) (pp. 543-552). IEEE. - (Acceptance Rate 18.7%)16. Nakayama, K., Muralidhar, N., Jin, C., & Sharma R. Detection of False Data Injection Attacks in Cyber-Physical Systems using Dynamic Invariants. Eighteenth International Conference on Machine Learning and Applications (ICMLA) (2019 December)17. Muralidhar, N., Muthiah, S., & Ramakrishnan N. DyAt Nets: Dynamic Attention Networks for State Forecasting in Cyber-Physical Systems. Proceedings of the Twenty-Eighth International Joint Conference on Artificial Intelligence (IJCAI) (2019 August) - (Acceptance Rate 17.9%).18. Muralidhar, N., Islam, M. R., Marwah, M., Karpatne, A., & Ramakrishnan, N. (2018,December). Incorporating Prior Domain Knowledge into Deep Neural Networks. In 2018 IEEE International Conference on Big Data (IEEE Big Data) (pp. 36-45) - (Acceptance Rate 19.7%).19. Muralidhar, N., Rangwala H., and Han E., Recommending Temporally Relevant News Content From Implicit Feedback Data: A Tag Based Approach.IEEE 27th ICTAI 689-696 (2015)Book Chapters & Theses20. Muralidhar, N. (2022). Science Guided Machine Learning: Incorporating Scientific Domain Knowledge for Learning Under Data Paucity and Noisy Contexts (Doctoral dissertation, Virginia Tech).21. Muralidhar, N., Bu, J., Cao, Z., He, L., Ramakrishnan, N., Tafti, D. & Karpatne, A.Science-Guided Design & Evaluation of Machine Learning Models: A Case-Study on Multi-Phase Flows, In Science Guided Machine Learning: Emerging Trends in Combining Scientific Knowledge with Data-driven Methods., Karpatne, A., Kannan, R., Kumar, V.(Eds.), (Book to be published in Data Mining Knowledge Discovery Series, CRC Press, 2022).22. Muralidhar, N. Recommending Temporally Relevant News Content From Implicit Feedback Data: A Tag Based Approach. Masters Thesis in Computer Science, George Mason University, December2015.CoursesCS-556 Mathematical Foundations of Machine Learning (Fall 2022)CS-556 Mathematical Foundations of Machine Learning (Spring 2023)CS-556 Mathematical Foundations of Machine ",
  "content_length": 10276,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:56"
}