{
  "name": "Nikhil Garg 0001 [Tech]",
  "homepage": "https://gargnikhil.com",
  "status": "success",
  "content": "Nikhil Garg Academic Website Hi! I'm an assistant professor of Operations Research and Information Engineering (ORIE) at Cornell Tech, as part of the Jacobs Institute, and an ORIE, Computer Science, and Information Science field member at Cornell University. What's new NEW! We are building feeds on BlueSky for the academic community and beyond! We have launched Paper Skygest, a feed that filters posts about papers from your following network. Sept-25 3 Paper awards at CSCW 2025: Best Paper Award, Impact Recognition, and Diversity Recognition for two papers led by PhD Advisee Vince Bartle! Cornell News wrote about the work here! Jul-25 As part of the McClintock Letters initiative, I wrote about my family's immigration and science journey here. Jun-25 PhD Advisee Zhi Liu successfully defended his PhD! August update: He was named a finalist for the INFORMS George Dantzig Dissertation Award! Apr-25 Program co-chair for ACM EAAMO 2025! Research overview I design, build, deploy, and evaluate public interest AI systems, and data-driven decision-making within societal systems more broadly. Methodologically, my work spans computer science, operations research, data science, and their intersection with economics and policymaking. I try to combine the relative strengths of machine learning/AI and market design/operations to improve democracy, education, high-stakes recommenders, and societal systems at large. I believe in having first-hand practical experience in a domain before tackling research questions, and work closely with several government agencies. My recent work is in two high-level directions: building and deploying public interest computational systems in collaboration with practitioners; and conceptually, mathematically, and empirically studying sociotechnical systems. Deployed Projects & Real-World Applications We are building, deploying, and evaluating public interest computational systems. This work is often in collaboration with government agencies or non-profits using real data. Methodologically, we tackle challenges such as missing data. See here for a recent \"manifesto\" on the challenges caused by heterogeneous participation in participatory systems, which also surveys my work broadly. High school applications (with NYC Department of Education). We are studying disparities in how students apply to high schools in New York City, as a result of a complex process. For the 2025 cycle, we are working with NYC to help students in the application process. Undermatching in New York City School Choice: Application Behavior and Feedback Bluesky Algorithmic feeds. We are building feeds on BlueSky for the academic community and beyond! We have launched Paper Skygest, which currently has about 8000 daily uses by about 1200 daily active users. Platform to help place discharged hospital patients into nursing homes. In Hawai`i, a PhD advisee built and deployed a platform to help place discharged hospital patients into one of over 1000 nursing homes, which are often run by single individuals out of their homes. The platform texts homes to ask for updated capacity and preference information, and then provides this information to about 10 hospital social workers. Faster Information for Effective Long-Term Discharge: A Field Study in Adult Foster Care, CSCW 2025 \"Shopping Around\": An Experiment in Preferences and Incentives for Placing Long-term Patients, CSCW 2025 Resident crowdsourcing (with the NYC Department of Parks and Recreation). Understanding resident crowdsourcing behavior and government inspection and work order resource allocation: do some neighborhoods report more than others for the same ground truth conditions, thus receiving better government services?. This has involved methodological work, as well as building and transferring a data dashboard and tree planting scheduling optimization. See here for a recent talk video. Quantifying Spatial Under-reporting Disparities in Resident Crowdsourcing, Nature CS 2023 and ACM EC 2022 A Bayesian Spatial Model to Correct Under-Reporting in Urban Crowdsourcing, AAAI 2024 Redesigning Service Level Agreements: Equity and Efficiency in City Government Operations, ACM EC 2024 Library operations (with the New York Public Library) Do differences in how neighborhoods use the library hold system lead to all books \"flowing\" to a few neighborhoods, thus reducing access for others? We have quantified such disparities and are working on deploying optimized book flow procedures to mitigate them. Identifying and Addressing Disparities in Public Libraries with Bayesian Latent Variable Modeling, AAAI 2024 Optimizing Library Usage and Browser Experience: Application to the New York Public Library Theoretical Modeling, Methods Development, & Empirical Analysis Our deployment work is informed by theoretical (mathematical) modeling, algorithm development, and empirical analysis. See here for a recent talk video, which also overviews my work generally. Understanding algorithmic monoculture How do algorithms make correlated decisions and errors, and what are the downstream implications in hiring (matching) markets, LLM-as-judge setups, and other applications? Correlated Errors in Large Language Models, ICML 2025 Monoculture in Matching Markets, NeurIPS 2024 Wisdom and Foolishness of Noisy Matching Markets, ACM EC 2024 Fair, diverse recommendations in high-stakes settings How do we design recommendations systems in high-stakes settings that are fair (to both users and providers), and can provide diverse recommendations to users, preventing content rabbit holes? User-item fairness tradeoffs in recommendations, NeurIPS 2024 Reconciling the accuracy-diversity trade-off in recommendations, The Web Conference 2024 Supply-Side Equilibria in Recommender Systems, NeurIPS 2023 Computational Social Science more broadly How can we use modern NLP and optimization techniques to answer social science questions? Sparse Autoencoders for Hypothesis Generation, ICML 2025 Word Embeddings Quantify 100 Years of Gender and Ethnic Stereotypes, PNAS 2018 Addressing Discretization-Induced Bias in Demographic Prediction, PNAS Nexus 2025 and FAccT 2024 Combatting Gerrymandering with Social Choice: the Design of Multi-member Districts, ACM EC 2022 Our work has received several awards, including the NSF CAREER, INFORMS George Dantzig Dissertation award, ACM SIGecom Dissertation Award (Honorable Mention), Forbes 30 under 30 for Science, the NSF graduate research fellowship, and several best paper awards. My work has also been covered in the New York Times, Washington Post, Science Magazine, Smithsonian Magazine (in print), Stanford Engineering magazine, and Stanford News, among others. My research has been supported by the Sloan Foundation, NSF, NASA, the Cornell Tech Urban Tech Hub, Google, Meta, and Amazon. I received a MS and PhD from Stanford in 2020, where I was lucky to be advised by Ashish Goel and Ramesh Johari and was part of the Stanford Crowdsourced Democracy Team and the Society and Algorithms Lab, after which I was a post-doc at UC Berkeley EECS. Before that, I graduated with a BS and BA from the University of Texas at Austin in 2015. During the 2020 US election cycle, I led data science efforts at PredictWise. I am also involved with EAAMO (formerly MD4SG), most recently as Program co-Chair for 2025. Contact me at ngarg@REMOVETHIScornell.REMOVETHISedu. Applicants: please read the information at the Contact page before emailing me.",
  "content_length": 7476,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:54"
}