{
  "name": "Nikita Soni 0001",
  "homepage": "https://cs.uic.edu/profiles/soni-nikita",
  "status": "success",
  "content": "Soni, Nikita | Computer Science | University of Illinois Chicago Your browser is unsupported We recommend using the latest version of IE11, Edge, Chrome, Firefox or Safari. Nikita Soni Assistant Professor Department of Computer Science Contact Building & Room: CDRLC 5421 Address: 850 W. Taylor St, MC 152, Chicago, IL 60607 Office Phone: 312.996.0207 Email: nnsoni@uic.edu Related Sites: Personal Website Google Scholar About Nikita Soni, Ph.D. is an assistant professor in the Department of Computer Science at the University of Illinois Chicago. She earned a Bachelor of Technology (B.Tech) degree in Electronics and Communications (Jaypee University of Engineering and Technology, 2015), a Master of Science (MS) degree in Computer Science (University of Florida, 2016), and a Ph.D. in Human-Centered Computing (University of Florida, 2021). Her research interests include Human-Computer Interaction, Interaction Design, Computer-Supported Collaborative Work, and Child-Computer Interaction. In her research, Nikita understands children’s and adults’ mental models and natural interaction behaviors, with novel and existing technologies, then leverages this understanding to create and test computing applications that enable learning and creativity. Her Ph.D. dissertation investigated how to design natural user interactions for multi-touch spherical displays to support both individual and group-based interactions, particularly in the context of learning from educational data visualizations in museums. Here is a sub-set of design guidelines from her dissertation, that can be used when designing future applications for multi-touch spherical displays or porting existing flatscreen applications to spherical touchscreens. Nikita's work on designing touchscreen applications for children has led to the formation of the TIDRC framework, containing actionable design guidelines for designers and developers of children's touchscreen applications. Her work has received recognition and honorable mention in the research community at one of the top HCI conferences in 2021, ACM Computer-Supported Collaborative Work (CSCW). Selected Grants Illinois Space Grant Consortium 2022 (UIUC sub-award, NASA primary sponsor), GeoDataOnSphere: Collaborative Exploration of GeoData on Multi-touch Spherical Displays for Future Teachers, PI Selected Publications Soni, N., Tierney, A., Jurczyk, K., Gleaves, S., Schreiber, E., Stofer, K.A., and Anthony, L. 2021. Collaboration around Multi-touch Spherical Displays: A Field Study at a Science Museum. In Proceedings of the ACM on Human-Computer Interaction, Vol. 5, CSCW2, Article 326 (October 2021), 32 pages. Impact Factor: 1.825 [Honorable Mention] [PDF] Soni, N., Aloba, A., Morga, K.S., Wisniewski, P.J., and Anthony, L. 2019. A Framework of Touchscreen Interaction Design Recommendations for Children (TIDRC): Characterizing the Gap between Research Evidence and Design Practice. In Proceedings of the Conference on Interaction Design and Children (IDC’19), Idaho, USA, 419-431. [PDF] Service to Community Co-chair, Late Breaking Results, International Conference on Multimodal Interaction (ICMI 2022)",
  "content_length": 3151,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:57"
}