{
  "name": "Niki Trigoni",
  "homepage": "https://www.cs.ox.ac.uk/niki.trigoni",
  "status": "success",
  "content": "Niki Trigoni | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyNiki TrigoniNiki Trigoni Professor Niki Trigoni Professor of Computer ScienceGoverning Body Fellow, Kellogg CollegeE: niki.trigoni@cs.ox.ac.ukT: Office: +44 1865 610681T: Mobile: +44 7841 522300Themes:SystemsArtificial Intelligence and Machine LearningData, Knowledge and ActionCompleted Projects:Mobile and Sensor Nodes for Wildlife Monitoringmore…InterestsProfessor Trigoni's interests lie in intelligent and autonomous sensor systems with applications in positioning, healthcare, environmental monitoring and smart cities. Please contact her if you are interested in applying for a DPhil, postdoc or senior software engineer position in one of the following areas: Indoor positioning systems, data fusion, inference and learning from sensor data, human-robot interaction, communication protocols and quality assurance for sensor networks, innovative mobile sensing platforms and architectures including participatory and social sensing, sensor tasking, control, coordination, decision making and actuation. We currently have a number of funded open positions.  BiographyNiki Trigoni is a Professor at the Oxford University Department of Computer Science and a fellow of Kellogg College. She obtained her DPhil at the University of Cambridge (2001), became a postdoctoral researcher at Cornell University (2002-2004), and a Lecturer at Birkbeck College (2004-2007). At Oxford, she is currently Director of the EPSRC Centre for Doctoral Training on Autonomous Intelligent Machines and Systems, a program that combines machine learning, robotics, sensor systems and verification/control. She also leads the Cyber Physical Systems Group, which is focusing on intelligent and autonomous sensor systems with applications in positioning, healthcare, environmental monitoring and smart cities. The group’s research ranges from novel sensor modalities and low level signal processing to high level inference and learning. News Nov 2017: If you are interested in doing a DPhil in Computer Science in the area of cyberphysical systems, please find information on how to apply here. Deadlines 8th January/9th March 2018. Nov 2017: Several funded PhD positions are available every year at the EPSRC Centre for Doctoral Training in Autonomous Intelligent Machines and Systems (AIMS) - directed by N. Trigoni and M. Osborne. It combines four themes: Robotics, Machine Learning, Verification&Control and Sensor&Actuator Networks. Next Deadline: 19th January 2018. Nov 2017: TPC chair of Sensys 2017, with Prof. L. Mottola June 2017: Trigoni and Markham receive a 3-year NIST grant to develop indoor positioning systems for emergency responders April 2016: TPC chair of IPSN 2016, with Prof. D. Culler and S. Nath Selected PublicationsView AllManage publications mmPoint: Dense Human Point Cloud Generation from mmWave Qian Xie‚ Qianyi Deng‚ Ta−Ying Cheng‚ Peijun Zhao‚ Amir Patel‚ Niki Trigoni and Andrew Markham In British Machine Vision Conference (BMVC). 2023. Details about mmPoint: Dense Human Point Cloud Generation from mmWave | BibTeX data for mmPoint: Dense Human Point Cloud Generation from mmWave | Download (pdf) of mmPoint: Dense Human Point Cloud Generation from mmWave Beyond Fusion: Modality Hallucination−based Multispectral Fusion for Pedestrian Detection Qian Xie‚ Ta−Ying Cheng‚ Jia−Xing Zhong‚ Kaichen Zhou‚ Andrew Markham and Niki Trigoni In IEEE/CVF Winter Conference on Applications of Computer Vision (WACV). 2023. Details about Beyond Fusion: Modality Hallucination−based Multispectral Fusion for Pedestrian Detection | BibTeX data for Beyond Fusion: Modality Hallucination−based Multispectral Fusion for Pedestrian Detection | Download (pdf) of Beyond Fusion: Modality Hallucination−based Multispectral Fusion for Pedestrian Detection Illumination−Aware Hallucination−Based Domain Adaptation for Thermal Pedestrian Detection Qian Xie‚ Ta−Ying Cheng‚ Zhuangzhuang Dai‚ Vu Tran‚ Niki Trigoni and Andrew Markham In IEEE Transactions on Intelligent Transportation. 2023. Details about Illumination−Aware Hallucination−Based Domain Adaptation for Thermal Pedestrian Detection | BibTeX data for Illumination−Aware Hallucination−Based Domain Adaptation for Thermal Pedestrian Detection | Download (pdf) of Illumination−Aware Hallucination−Based Domain Adaptation for Thermal Pedestrian Detection ActivitiesCyber Physical SystemsWorkplace AutonomyDeep Learning Based Inertial TrackingMobile and People-centric Systems and SensingIntelligent Resource Constrained SystemsMachine Learning SystemsDistributed Sensing and CoordinationPositioning in GPS-denied EnvironmentsSoftware EngineeringProjectsACE-OPSCompleted ProjectsMobile and Sensor Nodes for Wildlife MonitoringTIME-EACMAgent-based Area Exploration and Event Detection in Emergency ScenariosSensing, Unmanned, Autonomous Aerial VEhiclesAcoustic Actuated Sensor Networks for Industrial Processes (AASN4IP)Autonomous Ubiquitous SensingFRESNELHARPSIndoorPosTrackSafeMobile RoboticsACE-OPS Current Students Qianyi DengSamuel HodgsonHe LiangChenyang MaFanqi XuShitong XuYiyuan YangJiaojiao YeJiaxing ZhongYuzhou  Zhou Research Xinyu HouResearch AssociateSangyun  ShinResearch Associate Past Students Ada AlevizakiYasin AlmaliogluTa-Ying ChengEttore FerrantiYuhang HeQingyong HuMuzammil HussainShuyu LinChris Xiaoxuan LuSavvas PapaioannouVít RůžičkaMarion SbaiAndrew SymingtonMadhu Vankadari Christian WallentaYiming  WanBing WANGJialu WangWei WangRicklef WohlersZhuoling XiaoLinhai XieBo YangPeijun ZhaoKaichen Zhou Past Researchers Traian AbrudanChanghao ChenStuart GolodetzPedro Porto Buarque de GusmãoConor MuldoonNhat PhamStefano RosaMuhamad Risqi U. SaputraVu TranJohan WahlstromSen WangHongkai WenResearch AssociateQian  XieYang XingMohd Asyraf ZulkifleyAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 6079,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:56"
}