{
  "name": "Niki van Stein",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/niki-van-stein/publications#tab-2",
  "status": "success",
  "content": "Niki van Stein - Leiden University Skip to main content Niki van Stein Associate professor artificial intelligence data driven data mining industrial processes kriging machine learning optimization quassian processes surrogate models Name Dr. N. van Stein Telephone +31 71 527 2727 E-mail n.van.stein@liacs.leidenuniv.nl ORCID iD 0000-0002-0013-7969 Niki van Stein is a researcher in the Natural Computing Group of LIACS and manager of the applied data science lab. She received her PhD in Computer Science from Leiden University in 2018. Niki's research interest are in automated machine learning, global (Bayesian) optimization and neural architecture search. More information about Niki van Stein PhD Candidates Kirill Antonov PhD candidate Qi Huang PhD candidate Sofoklis Kitharidis PhD candidate Christiaan Lamers Guest PhD candidate / self funded Fu Xing Long PhD Candidate / Self Funded Bernd Wagner PhD candidate / self funded Alexander Zeiser PhD candidate / guest News 12 August 2025 Award for a method that can create even better algorithms 01 August 2025 New project explores how engineers and AI can truly work together 07 October 2024 Better ship designs thanks to smart algorithms 01 October 2024 Celebrating female computer scientists: ‘Computer science is for everyone’ 14 November 2018 Algorithm Data Science student designs best ship in less time 16 September 2018 PhD on research on an industrial production process See also Link to personal website Niki van Stein is a researcher in the Natural Computing Group of LIACS and manager of the applied data science lab. She received her PhD in Computer Science from Leiden University in 2018. Niki's research interest are in automated machine learning, global (Bayesian) optimization and neural architecture search. Next to her research, Niki has founded several software solution-oriented companies such as Van Stein & Groentjes – Custom software development, and Smartnotation – the smart meeting minutes application. Associate professor Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact +31 71 527 2727 n.van.stein@liacs.leidenuniv.nl JavaScript is required to view this content. Stein B. van, Raponi E., Sadeghi Z., Bouman N., Ham R.C.H.J. van & Bäck T.H.W. (2022), A comparison of global sensitivity analysis methods for explainable AI with an application in genomic prediction, IEEE Access 10: 103364-103381. 'Refereed' artikel in tijdschrift Stein B. van, Wang H. & Bäck T.H.W. (2019), Automatic Configuration of Deep Neural Networks with Parallel Efficient Global Optimization, 2019 International Joint Conference on Neural Networks (IJCNN). 2019 International Joint Conference on Neural Networks (IJCNN) 14 July 2019 - 19 July 2019. Budapest, Hungary, Hungary: IEEE. 1-7. 'Refereed' congrespublicatie Stein B. van, Wang H., Kowalczyk W.J., Emmerich M.T.M. & Bäck T.H.W. (2019), Cluster-based Kriging approximation algorithms for complexity reduction, Applied Intelligence : . 'Non-refereed' artikel in tijdschrift Ponse K., Plaat A., Stein N. van & Moerland T.M. (2025), EconoJax: a fast & scalable economic simulation in jax, Proceedings of the 24th international conference on autonomous agents and multiagent systems. 24th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2025) 19 May 2025 - 23 May 2025: International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS). 1679-1687. 'Refereed' congrespublicatie Winter R. de, Milatz B., Blank J., Stein N. van, Bäck T.H.W. & Deb K. (2024), Parallel multi-objective optimization for expensive and inexpensive objectives and constraints, Swarm and Evolutionary Computation 86: 101508. 'Refereed' artikel in tijdschrift Schaap A. Kitharidis S. & Stein N. van (2024), Towards fairness in machine learning: balancing racially imbalanced datasets through data augmentation and generative AI. Marcelloni F. & Madani K. et al. (Eds.), Proceedings of the 16th international joint conference on computational intelligence - NCTA. IJCCI 20 November 2024 - 22 November 2024. 16th International Joint Conference on Computational Intelligence no. 1. Porto: SCITEPRESS - Science and Technology Publications. 584-592. 'Refereed' congrespublicatie Huang Q., Kitharidis S., Bäck T.H.W. & Stein N. van (2024), TX-Gen: multi-objective optimization for sparse counterfactual explanations for time-series classification. Marcelloni F., Madani K., Stein N. van & Filipe J. (Eds.), Proceedings of the 1st international conference on explainable AI for neural and symbolic methods EXPLAINS. IJCCI 20 November 2024 - 22 November 2024 no. 1. Porto: SCITEPRESS - Science and Technology Publications. 62-74. 'Refereed' congrespublicatie Halsema M., Vermetten D.L., Bäck T.H.W. & Stein N. van, ACM Conferences: 1993-2001. Annotatie Winter R. de, Bäck T.H.W. & Stein N. van (2024), Modular optimization framework for mixed expensive and inexpensive real-world problems, GECCO '24 companion: proceedings of the genetic and evolutionary computation conference companion. GECCO '24: Genetic and Evolutionary Computation Conference 14 July 2024 - 18 July 2024. New York: Association for computing machinery. 1715-1723. 'Refereed' congrespublicatie Winter R. de, Milatz B., Blank J., Stein N. van, Bäck T.W.H & Deb K. (2024), Hot off the press: parallel multi-objective optimization for expensive and Inexpensive objectives and constraints, GECCO '24 companion: proceedings of the genetic and evolutionary computation conference companion. GECCO '24: Genetic and Evolutionary Computation Conference 14 July 2024 - 18 July 2024. New York: Association for computing machinery. 31-32. 'Refereed' congrespublicatie Winter R. de, Long F.X., Thomaser A.M., Bäck T.H.W., Stein N. van & Kononova A.V. (2024), Landscape analysis based vs. domain-specific optimization for engineering design applications: a clear case, 2024 IEEE Conference on Artificial Intelligence (CAI). The 2024 IEEE Conference on Artificial Intelligence (IEEE CAI 2024) 25 June 2024 - 27 June 2024: IEEE. 776-781. 'Refereed' congrespublicatie Antonov K., Tukker T., Botari T., Bäck T.H.W., Kononova A.V. & Stein N. van (2024), Quality-diversity driven robust evolutionary optimization of optical designs. Smith D.G. & Erdmann A. (Eds.), Optical design and engineering IX. SPIE Optical Systems Design, 2024 7 April 2024 - 12 April 2024: SPIE. 130230B. 'Non-refereed' congrespublicatie Antonov K., Kalkreuth R., Yang K., Bäck T.H.W., Stein N. van & Kononova A.V. (2024), A functional analysis approach to symbolic regression, GECCO '24: proceedings of the genetic and evolutionary computation conference companion. Gecco '24 Genetic and evolutionary computation 14 July 2024 - 18 July 2024. New York, N.Y., U.S.A.: Association for Computing Machinery. 859-867. 'Refereed' congrespublicatie Long F.X., Frenzel M., Krause P., Gitterle M., Bäck T.H.W. & Stein N. van (2024), Landscape-aware automated algorithm configuration using multi-output mixed regression and classification. Affenzeller M., Winkler S.M., Kononova A.V., Trautmann H., Tusar T., Machado P. & Bäck T.H.W. (Eds.), Parallel problem solving from nature: PPSN XVIII. Parallel Problem Solving from Nature – PPSN XVIII 14 September 2024 - 18 September 2024. Lecture Notes in Computer Science no. 15149. Cham: Springer. 87-104. 'Refereed' congrespublicatie Long F.X., Stein N. van, Moritz F., Krause P., Gitterle M. & Bäck T.W.H. (2024), Generating cheap representative functions for expensive automotive crashworthiness optimization, ACM Transactions on Evolutionary Learning and Optimization 4(2): 9. 'Refereed' artikel in tijdschrift Long X.F., Vermetten D.L., Stein N. van & Kononova A.V. (2023), BBOB instance analysis: landscape properties and algorithm performance across problem instances. Correia J., Smith S. & Qaddoura R. (Eds.), Applications of evolutionary computation. International Conference on the Applications of Evolutionary Computation (Part of EvoStar) 12 April 2023 - 14 April 2023. Lecture Notes in Computer Science no. 13989. Cham: Springer. 380-395. 'Refereed' congrespublicatie Stein N. van, Vermetten D.L., Caraffini F. & Kononova A.V. (2023), Deep BIAS: detecting structural bias using explainable AI, GECCO '23 companion: proceedings of the companion conference on genetic and evolutionary computation. GECCO '23 Companion: Companion Conference on Genetic and Evolutionary Computation 15 July 2023 - 19 July 2023. New York, U.S.A.: Association for Computing Machinery. 455-458. 'Refereed' congrespublicatie Thomson S.L., Stein N. van, Berg D. van den & Leeuwen C. van (2023), The opaque nature of intelligence and the pursuit of explainable AI. Stein N. van, Marcelloni F., Lam H.K., Cottrell M. & Filipe J. (Eds.), Proceedings of the 15th International Joint Conference on Computational Intelligence. 15th International Conference on Neural Computation Theory and Applications 13 November 2023 - 15 November 2023: SciTePress . 555-564. 'Refereed' congrespublicatie Stein. N. van, Winter R. de, Bäck T.H.W. & Kononova A. V. (2023), AI for expensive optimization problems in industry, 2023 IEEE Conference on Artificial Intelligence (CAI). 2023 IEEE Conference on Artificial Intelligence 5 June 2023 - 6 June 2023: IEEE. 251-254. 'Non-refereed' congrespublicatie Lamers C.H.C.B., Vidal R., Belbachir N., Stein N. van, Bäck T.H.W. & Giampouras P. (2023), Clustering-based domain-incremental learning , Conference Proceedings 2023 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW). 2023 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW) 2 October 2023 - 6 October 2023: IEEE Computer Society. 3376-3384. 'Refereed' congrespublicatie Back T.H.W., Kononova A.V., Stein N. van, Wang H., Antonov K., Kalkreuth R.T., Nobel J.P. de, Vermetten D., Winter R. de & Ye F. (2023), Evolutionary algorithms for parameter optimization: thirty years later, Evolutionary Computation 31(2): 81-122. 'Refereed' artike",
  "content_length": 30789,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:58"
}