{
  "name": "Niki Kittur",
  "homepage": "https://www.hcii.cmu.edu/people/aniket-kittur",
  "status": "success",
  "content": "Aniket (Niki) Kittur | Human-Computer Interaction Institute Skip to main content Search Expand Menu Close Menu Aniket (Niki) Kittur Professor & Associate Director for Strategy and Partnerships Faculty Email nkittur@cs.cmu.edu Campus Address Newell-Simon Hall 2504a Links Website Lab Google Scholar Research Areas Social Computing Tools and Programming Data Visualization Human-Centered AI Cognitive Science and Behavioral Science Human-Agent and Human-Robot Interaction Advisees Andrew Kuznetsov Yaqing Yang Administrative Staff Carolyn Buzzelli-Stumpf Aniket \"Niki\" Kittur is a Professor in the Human-Computer Interaction Institute at Carnegie Mellon University. His research on AI-augmented cognition looks at how we can accelerate knowledge acquisition and innovation by partnering human and machine intelligence. He has authored and co-authored over 100 papers, 17 of which have received best paper awards or honorable mentions. Dr. Kittur is a Kavli fellow, has been inducted into the CHI Academy, has received an NSF CAREER award, the Allen Newell Award for Research Excellence, major research grants from NSF, NIH, Google, Microsoft, Bosch, and Toyota, and his work has been reported in venues including Nature News, The Economist, The Wall Street Journal, NPR, TechCrunch, and the Chronicle of Higher Education. He received a BA in Psychology and Computer Science at Princeton, and a PhD in Cognitive Psychology from UCLA. Research Interests Sensemaking by groups and individuals, collective intelligence, visualization and insight, cognitive psychology In the News Human-AI Collaboration Can Unlock New Frontiers in Creativity Content churned out by generative AI models is surprisingly competent, if not always particularly exciting. But research at Carnegie Mello... View Details CMU at CHI 2025 Our halls are abuzz with talk of “CHI” (pronounced “kai”), the nickname for the upcoming conference on computer human interaction (CHI). ... View Details HCII Highlights in The Link The Link magazine from the CMU School of Computer Science is now available in mailboxes of alumni and friends, on newsstands in SCS campus... View Details SCS Faculty Receive Google Academic Research Awards Nine School of Computer Science faculty members recently received Google Academic Research Awards, which aim to fund and actively collabor... View Details Related Projects Project Inkspire With recent advancements in the capabilities of Text-to-Image (T2I) AI models, product designers With recent advancements in the capabilities of Text-to-Image (T2I) AI models, product designers have begun experimenting with them in their work. However, T2I models struggle to interpret abstract la ... View Details Project Skeema Skeema is a new way to manage your tabs that helps to declutter your browser and your mind. Skeema is a new way to manage your tabs that helps to declutter your browser and your mind. ... View Details Project Knowledge Accelerator The challenge: find a target user group that has a need to make sense of vast and ambiguous information online, and design a tool based on Fuse's technolo The challenge: find a target user group that has a need to make sense of vast and ambiguous information online, and design a tool based on Fuse's technology that would alleviate their current pain poi ... View Details Project The Knowledge Accelerator Researchers from the Human-Computer Interaction Institute are working on a system they call Knowledge Accelerator. A system that uses a machine-learning p Researchers from the Human-Computer Interaction Institute are working on a system they call Knowledge Accelerator. A system that uses a machine-learning program to sort and organize information uncove ... View Details Back to Top",
  "content_length": 3737,
  "method": "requests",
  "crawl_time": "2025-12-01 14:05:56"
}