{
  "name": "Niklas Elmqvist",
  "homepage": "https://cs.au.dk/~elm",
  "status": "success",
  "content": "Niklas Elmqvist, Ph.D. LinkedIn Twitter Mastodon Google Scholar Email Blog CV Hi, Iâm Niklas. ð I build human-data interaction tools for everyone. Iâm a Villum Investigator and a Full Professor in the Department of Computer Science at Aarhus University in Aarhus, Denmark . My research is on the intersection of data visualization and human-computer interaction (HCI). I am the Director of the Center for Anytime Anywhere Analytics (CA3), a research center on Augmented and Extended Reality (AR/XR) for data visualization funded by the Villum Foundation. Besides ubiquitous analytics, a research topic I founded, my research interests span accessible data visualization, human-AI/ML teaming, and visual analytics. My research has been recognized by a U.S. NSF CAREER award, several best paper awards at conferences such as IEEE VIS and ACM CHI, and significant grant funding from federal and industrial sponsors. I take academic service seriously and have served as a papers co-chair for IEEE VIS threefive times, an associate editor for journals such as IEEE TVCG, IJHCS, Information Visualization, and JoVI, an elected member of the IEEE VIS Steering Committee, and Adjunct Chair of Awards in the ACM SIGCHI Executive Committee. Iâm an ACM Fellow and an IEEE Fellow. Positions available I am always hiring talented Ph.D. students and postdocs. See the open positions for the CA3 center for details! Please send me an email with your resume and research interests! ð If youâre interested in my ruminations on life, visualization, and research, you probably want my blog. ð For details about my publications and research, please visit the CA3 website! News Date Title Description Jan 22, 2025 Elevated to ACM Fellow I have been elevated to Fellow of the ACM, effective January 1, 2025. May 27, 2024 EuroVA 2024 Keynote I gave the keynote at EuroVA 2024. Nov 23, 2023 Elevated to IEEE Fellow I have been elevated to Fellow of the IEEE, effective January 1, 2024. Nov 21, 2023 Kicking Off CA3! This week we are kicking off the CA3 center with a brand new website, an opening ceremony on November 23, and a visit from the Villum folks! Nov 17, 2023 Cover story in CACM! My paper on Data Analysis Anywhere and Everywhere was just published as the cover story in the December 2023 issue of the Communications of the ACM. Oct 27, 2023 Attending VIS 2023 My students and I had a stellar time at VIS 2023. Here I describe the work we presented there. Jul 1, 2023 New Job, New Website In what has almost become a tradition, I am celebrating my new position at Aarhus University by rolling out this spanking new website! No matching items",
  "content_length": 2645,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:00"
}