{
  "name": "Nikolaos Thomos",
  "homepage": "https://www.essex.ac.uk/people/thomo13706/nikolaos-thomos",
  "status": "success",
  "content": "Nikolaos Thomos | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Nikolaos Thomos People Professor Nikolaos Thomos Professor School of Computer Science and Electronic Engineering (CSEE) Email nthomos@essex.ac.uk Location 1NW.4.10, Colchester Campus Academic support hours My Academic Support Hours are 10 am- 12 pm on Tuesday. Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I am a Professor at the School of Computer Science and Electronic Engineering (CSEE) at the University of Essex, Colchester, United Kingdom and the CSEE director of research. Before that, I was senior researcher in the Signal Processing Laboratory (LTS4) at the Ecole Polytechique Federale de Lausanne (EPFL), Lausanne, Switzerland and the Communication and Distributed Systems Laboratory at the University of Bern, Bern, Switzerland. I received my Diploma (MSc equivalent) and the PhD degrees from the Electrical and Computer Engineering Department of the Aristotle University of Thessaloniki, Thessaloniki, Greece. I was awarded the highly esteemed Ambizione career award from Swiss National Science Foundation (SNSF) in 2008 and 2011 for carrying out research on low computational complexity network coding for collaborative video streaming. I have been PI and co-I for a number of EPSRC, SNSF, EU, InnovateUK, and Hassler foundation-funded projects. I regularly serve as a member in technical program committees of international conferences. I am an elected member of IEEE MMSP Technical Committee (MMSP - TC) for the period 2019 - 2024. I am currently a TPC chair of ICME'25. I served as the lead TPC chair of MMSP'24, co-Chair of the Doctoral Symposium at ICIP'18, the Awards co-Chair at MMSP'17, the Publications Chair of IEEE workshop Packet Video 2012 and 2016, among others. I was guest editor for Trans. on Emerging Telecommunication Technologies, SI: Spectrum extensions for 5G and beyond 5G networks. My research interests include machine learning for communications, multimedia communications, semantic communications, design of novel waveforms, network coding, information-centric networking, networking, joint source and channel coding, video coding for machines, signal processing, and sensor networks. I am a Senior Member of the IEEE, a Fellow of the Higher Education Academy and Associate College Member of Engineering and Physical Sciences Research Council (EPSRC). Prospective PhD students interested in pursuing research in machine learning for communication, multimedia communications, network coding, networking, and multimedia sensor networks are encouraged to contact me by e-mail. If you are looking for a host institution for a Marie Curie IF on a topic related to my research interests, please send your CV to nthomos AT essex DOT ac DOT uk. My new webpage is now available at https://sites.google.com/site/nthomos/. You can find my old webpage at https://lts4.epfl.ch/thomos. Research and professional activities Research interests Network coding Open to supervise Multimedia communications Open to supervise Information-centric networks Open to supervise Joint source and channel coding Open to supervise Semantic Communications Open to supervise Machine learning for communications Open to supervise Caching Networks Open to supervise Multimedia Signal Processing Open to supervise Teaching and supervision Current teaching responsibilities Digital Electronic Systems (CE162) Previous supervision Nihan Ari Thesis title: Physical Layer Security of Short Packet Communications Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 17/5/2023 Amirul Islam Thesis title: Machine Learning Assisted Ultra Reliable and Low Latency Vehicular Optical Camera Communications Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 30/11/2022 Eleni Nisioti Thesis title: Reinforcement Learning-Based Optimization of Multiple Access in Wireless Networks Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 10/3/2021 Pantelis Maniotis Thesis title: Delivery of 360° Videos in Edge Caching Assisted Wireless Cellular Networks Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 3/11/2020 Publications Publications (2) Hedhly, W., Musavian, L. and Thomos, N., (2024). OTFS-NOMA System for MIMO Communication Networks with Spatial Diversity Hedhly, W., Musavian, L. and Thomos, N., (2024). Performance Analysis of OTFS-NOMA System with Fractional Doppler Journal articles (57) Chakraborty, J., Reed, M., Thomos, N., Pratt, G. and Wilson, N., (2025). Neuro-Fuzzy voice quality improvement for low-power, half-duplex, communication. IEEE Transactions on Audio, Speech and Language Processing. 33, 3609-3622 Ari, N., Musavian, L. and Thomos, N., (2025). Does Semantic Similarity Provide Enhanced Physical Layer Security?. IEEE Communications Letters, 1-1 Islam, A., Thomos, N. and Musavian, L., (2024). 5G NR Codes and Modulation Deep-RL Optimization for uRLLC in Vehicular OCC. IEEE Transactions on Intelligent Transportation Systems. 25 (12), 19592-19604 Islam, A., Thomos, N. and Musavian, L., (2024). Deep Reinforcement Learning Based Ultra Reliable and Low Latency Vehicular OCC. IEEE Transactions on Communications. 73 (5), 3254-3267 Luo, Q., Xiao, P., Liu, Z., Wan, Z., Thomos, N., Gao, Z. and He, Z., (2024). AFDM-SCMA: A Promising Waveform for Massive Connectivity over High Mobility Channels. IEEE Transactions on Wireless Communications. 23 (10), 14421-14436 Islam, A., Thomos, N. and Musavian, L., (2023). Multi-Agent Deep Reinforcement Learning for Spectral Efficiency Optimization in Vehicular Optical Camera Communications. IEEE Transactions on Mobile Computing. 23 (5), 3666-3679 Reed, M., Thomos, N., Al-Khalidi, M. and Al-Zaidi, R., (2023). Intelligent Seamless Handover in Next Generation Networks. IEEE Transactions on Consumer Electronics. 70 (1), 1566-1579 Thomos, N., Maugey, T. and Toni, L., (2022). Machine Learning for Multimedia Communications. Sensors. 22 (3), 819-819 Hu, J., Reed, M., Thomos, N., Al-Naday, M. and Yang, K., (2022). A Dynamic Service Trading in a DLT-Assisted Industrial IoT Marketplace. IEEE Transactions on Network and Service Management. 19 (4), 4691-4705 Ari, N., Thomos, N. and Musavian, L., (2022). Performance Analysis of Short Packet Communications with Multiple Eavesdroppers. IEEE Transactions on Communications. 70 (10), 6778-6789 AL-Naday, M., Thomos, N., Hu, J., Volckaert, B., de Turck, F. and Reed, MJ., (2022). Service-based, Multi-Provider, Fog Ecosystem with Joint Optimization of Request Mapping and Response Routing. IEEE Transactions on Services Computing. 16 (3), 1-15 Xia, M., Lai, E., Hu, J., Liu, X., Thomos, N., Liu, Z., Han, T., Bohara, VA. and Sali, A., (2022). Editorial: 5G-and-Beyond Communications for Smart Cities: Networks, Systems and Applications. Frontiers in Communications and Networks. 3 Yang, X. and Thomos, N., (2021). An approximate dynamic programming approach for collaborative caching. Engineering Optimization. 53 (6), 1005-1023 Hu, J., Reed, M., Thomos, N., Al-Naday, MF. and Yang, K., (2021). Securing SDN controlled IoT Networks Through Edge-Blockchain. IEEE Internet of Things Journal. 8 (4), 2102-2115 Maniotis, P. and Thomos, N., (2021). Tile-based edge caching for 360° live video streaming. IEEE Transactions on Circuits and Systems for Video Technology. 31 (12), 4938-4950 Maniotis, P. and Thomos, N., (2021). Viewport-Aware Deep Reinforcement Learning Approach for 360º Video Caching. IEEE Transactions on Multimedia. 24, 386-399 Kobbaey, T., Hamzaoui, R., Ahmad, S., Al‐Fayoumi, M. and Thomos, N., (2021). Enhanced collision resolution and throughput analysis for the 802.11 distributed coordination function. International Journal of Communication Systems. 34 (16) Hu, J., Reed, MJ., Al-Naday, M. and Thomos, N., (2021). Hybrid Blockchain for IoT—Energy Analysis and Reward Plan. Sensors. 21 (1), 305-305 Hancke, GP., Salehizadeh, MR., Liu, X., Hu, J., Abu‐Mahfouz, AM., Thomos, N., Ishihara, S. and Savaglio, C., (2021). Guest editorial: IoT sensing, applications, and technologies for smart sustainable cities. IET Smart Cities. 3 (3), 121-124 Nisioti, E. and Thomos, N., (2020). Fast Q-learning for Improved Finite Length Performance of Irregular Repetition Slotted ALOHA. IEEE Transactions on Cognitive Communications and Networking. 6 (2), 844-857 Maniotis, P., Bourtsoulatze, E. and Thomos, N., (2020). Tile-Based Joint Caching and Delivery of 360° Videos in Heterogeneous Networks. IEEE Transactions on Multimedia. 22 (9), 2382-2395 Hu, J., Reed, MJ., Al-Naday, MF. and Thomos, N., (2020). Blockchain-Aided Flow Insertion and Verification in Software Defined Networks.. CoRR. abs/2006.14513 Al-Khalidi, MQ., Thomos, N., Reed, M., Al-Naday, M. and Trossen, D., (2019). Anchor Free IP Mobility. IEEE Transactions on Mobile Computing. 1",
  "content_length": 28450,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:03"
}