{
  "name": "Nikolaos Tziavelis",
  "homepage": "https://ntzia.github.io",
  "status": "success",
  "content": "Nikolaos Tziavelis I am an Assistant Professor in UC Santa Cruz. My research spans both theoretical and practical aspects of database systems. I like working on problems in database theory and leveraging these ideas to improve the performance of real-world systems. I am actively looking for motivated PhD students to join my group. If you have a strong background in databases/systems, or if you are excited about designing algorithms for problems that come up in data processing systems, apply to the PhD program of UC Santa Cruz and mention my name in your application. Office: Engineering 2 361 Research Interests Data Management Database Theory Query Processing and Optimization Algorithms for Big Data ML for Databases / Databases for ML Publications Fine-Grained Dichotomies for Conjunctive Queries with Minimum or Maximum Nofar Carmeli, Nikolaos Tziavelis Arxiv'25 [Arxiv] The Importance of Parameters in Ranking Functions Wolfgang Gatterbauer, Benny Kimelfeld, Christoph Standke, Nikolaos Tziavelis ICDT'26 (Upcoming) Any-k Algorithms for Enumerating Ranked Answers to Conjunctive Queries Nikolaos Tziavelis, Wolfgang Gatterbauer, Mirek Riedewald TODS'25 (Extended version of VLDB'20 paper) [Arxiv] [Project Webpage] [Code] Ranked Enumeration for Database Queries Nikolaos Tziavelis, Wolfagang Gatterbauer, Mirek Riedewald SIGMOD Record'24 [PDF] [Arxiv] Efficient Ranked Access over Joins Nikolaos Tziavelis VLDB'23 PhD Workshop Best paper award [PDF] [Project Webpage] Efficient Computation of Quantiles over Joins Nikolaos Tziavelis, Nofar Carmeli, Wolfgang Gatterbauer, Benny Kimelfeld, Mirek Riedewald PODS'23 [PDF] [Arxiv] [Video (17')] [Project Webpage] Tractable Orders for Direct Access to Ranked Answers of Conjunctive Queries Nofar Carmeli*, Nikolaos Tziavelis*, Wolfgang Gatterbauer, Benny Kimelfeld, Mirek Riedewald TODS'23 [PDF] [Arxiv] [Project Webpage] Toward Responsive DBMS: Optimal Join Algorithms, Enumeration, Factorization, Ranking, and Dynamic Programming Nikolaos Tziavelis, Wolfgang Gatterbauer, Mirek Riedewald ICDE'22 (Tutorial) [PDF] [Video] [Tutorial Webpage] Beyond Equi-joins: Ranking, Enumeration and Factorization Nikolaos Tziavelis, Wolfgang Gatterbauer, Mirek Riedewald VLDB'21 Experiments reproduced by PVLDB (Reproducibility Site) [PDF] [Arxiv] [Video] [Project Webpage] [Code] [Reproducibility Instructions] Tractable Orders for Direct Access to Ranked Answers of Conjunctive Queries Nofar Carmeli*, Nikolaos Tziavelis*, Wolfgang Gatterbauer, Benny Kimelfeld, Mirek Riedewald PODS'21 Selected among \"Best of\" [PDF] [Arxiv] [Video (12')] [Video (20')] [Project Webpage] Optimal Algorithms for Ranked Enumeration of Answers to Full Conjunctive Queries Nikolaos Tziavelis, Deepak Ajwani, Wolfgang Gatterbauer, Mirek Riedewald, Xiaofeng Yang VLDB'20 Experiments reproduced by PVLDB (Reproducibility Site) [PDF] [Arxiv] [Video] [Project Webpage] [Code] [Reproducibility Instructions] Optimal Join Algorithms Meet Top-k Nikolaos Tziavelis, Wolfgang Gatterbauer, Mirek Riedewald SIGMOD'20 (Tutorial) [PDF] [Arxiv] [Video] [Tutorial Webpage] Fair Procedures for Fair Stable Marriage Outcomes Nikolaos Tziavelis, Ioannis Giannakopoulos, Rune Quist Johansen, Katerina Doka, Nectarios Koziris, Panagiotis Karras AAAI'20 [PDF] Loch Prospector: Metadata Visualization for Lakes of Open Data Neha Makhija, Mansi Jain, Nikolaos Tziavelis, Laura Di Rocco, Sara Di Bartolomeo, Cody Dunne IEEE VIS 2020 [PDF] [Project Webpage] [Video] Equitable Stable Matchings in Quadratic Time Nikolaos Tziavelis, Ioannis Giannakopoulos, Katerina Doka, Nectarios Koziris, Panagiotis Karras NeurIPS'19 [PDF] Teaching CS 6240, Summer 2023 (Northeastern University) CSE 214, Fall 2024 CSE 182, Spring 2025 CSE 180, Fall 2025 CSE 182, Winter 2025 Service I have served on the Program Committee of SIGMOD (2024, 2025), VLDB (2024), PODS (2025), EDBT (2025 Demo Track), ICDE (2022), and Northeast Database Day 2023. Short Bio Nikolaos (Nikos) Tziavelis is an Assistant Professor in the CSE Department in Basking Engineering, UC Santa Cruz. His research interests span both theoretical and practical aspects of data systems, leveraging ideas from database theory to design innovative solutions for real-world systems. He received his Ph.D. from Northeastern University advised by Mirek Riedewald and Wolfgang Gatterbauer. Before that, he received a Diploma from the National Technical University of Athens, Greece. His work has been awarded with a 2022 Google PhD fellowship, a PODS 2021 “Best of” recognition, a 2023 VLDB PhD Workshop Best Paper Award, and the 2024 Khoury Research Award from Northeastern University.",
  "content_length": 4625,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:04"
}