{
  "name": "Nikolas Martelaro",
  "homepage": "https://hcii.cmu.edu/people/nikolas-martelaro",
  "status": "success",
  "content": "Nikolas Martelaro | Human-Computer Interaction Institute Skip to main content Search Expand Menu Close Menu Nikolas Martelaro Assistant Professor Human-Computer Interaction Institute Email nikmart@cmu.edu Campus Address Newell-Simon Hall 3613 Links Website GitHub LinkedIn Google Scholar Lab website CMU Scholars Research Areas Research through Design Human-Centered AI Tools and Programming Human-Agent and Human-Robot Interaction Interaction and Experience Design Accessibility and Assistive Technology Service Design and AI Innovation Advisees Howie Wang Frederic Gmeiner David Chuan-en Lin Howard Han Zeda Xu Administrative Staff Eric Davidson Hi, I'm Nik. I am an Assistant Professor at Carnegie Mellon's Human-Computer Interaction Institute. My lab focuses on augmenting designer's capabilities through the use of new technology and design methods. My interest in developing new ways to support designers stems from my interest in creating interactive and intelligent products. I blend a background in product design methods, interaction design, human-robot interaction, and mechatronic engineering to build tools and methods that allow designers to understand people better and to create more human-centered products. Before moving to the HCII, I was a Digital Experiences researcher at the Accenture Technology Labs in San Francisco. I graduated with my Ph.D. in Mechanical Engineering from Stanford's Center for Design Research, where I was co-advised by Larry Leifer and Wendy Ju. Research Interests Interaction Design, Interaction with autonomous systems, Design tools, Mechatronics In the News NSF Funds Development of Robots for Public Spaces A Carnegie Mellon University research team recently received a $1.25 million grant from the National Science Foundation's Smart and Connec... View Details Human-AI Collaboration Can Unlock New Frontiers in Creativity Content churned out by generative AI models is surprisingly competent, if not always particularly exciting. But research at Carnegie Mello... View Details CMU at CHI 2025 Our halls are abuzz with talk of “CHI” (pronounced “kai”), the nickname for the upcoming conference on computer human interaction (CHI). ... View Details CMU Launches Human-Centered AI Research Center with Seoul National University Carnegie Mellon University and Seoul National University (SNU) have announced a new collaboration to advance human-centered artificial int... View Details Related Projects Project Inkspire With recent advancements in the capabilities of Text-to-Image (T2I) AI models, product designers With recent advancements in the capabilities of Text-to-Image (T2I) AI models, product designers have begun experimenting with them in their work. However, T2I models struggle to interpret abstract la ... View Details Project VideoMap Video editing is a creative and complex endeavor and we believe that there is potential for reim Video editing is a creative and complex endeavor and we believe that there is potential for reimagining a new video editing interface to better support the creative and exploratory nature of video edi ... View Details Project Soundify In the art of video editing, sound is really half the story. Through formative interviews with professional editors (N=10), we found that the manual task In the art of video editing, sound is really half the story. Through formative interviews with professional editors (N=10), we found that the manual task of adding sounds to video can be challenging. ... View Details Project Jigsaw: Supporting Designers to Prototype Multimodal Applications by Assembling AI Foundation Models Recent advancements in AI foundation models have made it possible for them to be utilized off-the-shelf for creative tasks, including ideating design conc Recent advancements in AI foundation models have made it possible for them to be utilized off-the-shelf for creative tasks, including ideating design concepts or generating visual prototypes. However, ... View Details Back to Top",
  "content_length": 3993,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:05"
}