{
  "name": "Nikos Hardavellas",
  "homepage": "http://www.eecs.northwestern.edu/~hardav",
  "status": "success",
  "content": "Nikos Hardavellas @ NU Nikos Hardavellas Professor | CS & ECE Northwestern University Github Resume CV Map Email Research Interests Parallel systems, quantum computer systems, quantum system software stack, fault-tolerant quantum computing and error management, computer architecture, microarchitecture, photonics, memory-centric computing, design for dark silicon. Our current research is performed at PARAG@N, the Parallel Architecture Group @ Northwestern. The mission of the group is to achieve energy-efficient high-performance parallel computing at all scales through cross-layer design: from emerging devices and circuits, to computer architecture, compilers, runtimes, operating systems, and applications. If you are interested in joining PARAG@N, please read this. My research proceeded along three synergistic fronts that encompassed hardware, software, and scalable performance evaluation techniques. In particular: Scalable Hardware. Cache designs (R-NUCA) that dynamically optimize data placement on chip, allowing for controlled replication and near-neighbor sharing through Rotational Interleaving. Transistor-efficient multicore designs through ADviSE (Analytic Design-Space Exploration), a collection of first-order performance, area, bandwidth, power and thermal analytical models. Memory systems with spatio-temporal memory streaming, a memory system in which data move in correlated streams, rather than only individual cache blocks. Scalable Parallel Software. Execution migration of complex database queries across cores (QPIPE) and multicore-specific optimizations for storage managers (Shore-MT). Scalable Performance Evaluation Techniques. FLEXUS, a cycle-accurate full-system simulation infrastructure, and precursor to QFlex. Cashmere: a two-level software distributed-shared-memory system over low-latency remote-memory-access networks. Carnival: a tool for the characterization and analysis of waiting time and communication patterns of parallel shared-memory applications. While affiliated with Digital Equipment Corp., Compaq Computer Corp., and Hewlett-Packard, I was a member of the design team of high-end multiprocessor servers. I contributed to the Alpha EV6 (21264), EV7 (21364), and EV8 (21464) generations of microprocessors, and had a fleeting relationship with the Piranha multicore. The rest of my time was spent working on a number of AlphaServers in the Titan, Wildfire, and Marvel families: the Marvel (GS-1280), WildFire (GS-320), and Privateer (ES-45) multiprocessor systems. The AlphaServer GS systems were used to sequence the human genome, and the AlphaServer ES-45 system was the building block of the ASCI Q Supercomputer installed at Los Alamos, and was the second fastest supercomputer in the world in 2003. My work focused on memory hierarchy and multiprocessor system design, including adaptive and multi-level cache coherence protocols, migratory data optimizations, novel caching schemes, RAMbus modeling and optimizations, link retraining, flow control, directory caches, routing, and system topology. Also, I worked on the design and development of full-system execution-driven, trace-driven, and statistical simulators, and tools and techniques for performance analysis. Nikos Hardavellas is a professor of Computer Science and Computer Engineering at Northwestern University, where he directs the Parallel Architecture Group at Northwestern (PARAG@N, https://paragon.cs.northwestern.edu/). His research focuses on computer architecture, specifically at the intersection of computer architecture with the computer systems stack (programming languages, compilers, operating systems), memory systems, nanophotonics, energy-efficient computing and quantum computing systems. Nikos serves on the Executive Committee of the Northwestern Institute for Quantum Information Research and Engineering (INQUIRE), was named a Future CRA Leader by the Computing Research Association in the inaugural cohort (2024), received an NSF CAREER award (2015), and was a keynote speaker at IEEE ISPDC (2010). At Northwestern University, he received the June and Donald Brewer Chair (2009), a Faculty Service award (2022), was included in the Associated Student Government Faculty Honor Roll (2022), and became a Fellow of the Searle Center for Teaching Excellence in 2012. Nikos received best paper awards, nominations and test-of-time awards at HPCA (2022), ISLPED (2021), EDBT (2019) and ICDE (2006), an IEEE Micro Top Picks Award (2010), an IEEE Micro Top Picks Honorable Mention (2023), and a Technical Award for Contributions to the Alpha Microprocessor (2000). Prior to joining Northwestern University, he contributed to the design of several generations of Alpha microprocessors and high-end multiprocessor servers at Digital Equipment Corp. (DEC), Compaq, and Hewlett-Packard. Nikos received a Ph.D. in Computer Science from Carnegie Mellon University. Resume: Resume Curriculum Vitae: CV My Erdős number is 3: Paul Erdős - Noga Alon : MR0996763 (90c:05112) Noga Alon - Phillip B. Gibbons : MR1915030 (2003g:68032) Phillip B. Gibbons - Nikos Hardavellas : SPAA-07 Academic Genealogy, designed by Nicole D. Hill (over 1000 years, ending in Constantinople in 990 AD). Here is a link to my entry in the Mathematics Genealogy Project. Office address: 2233 Tech Dr, Mudd Hall 3517, Evanston, IL 60208, USA Map E-mail: nikos@northwestern.edu Email If you are interested in joining PARAG@N, please do not email me. Instead, read this. © Untitled. All rights reserved.Design: HTML5 UP",
  "content_length": 5523,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:10"
}