{
  "name": "Nikolaos M. Missirlis",
  "homepage": "http://cgi.di.uoa.gr/~nmis",
  "status": "success",
  "content": "N. Missirlis Personal Page ABOUT RESEARCH BOOKS PROJECTS CONTACT Short Bio N. M. Missirlis Download Full CV Nikolaos M. Missirlis has a BSc in Applied Mathematics, Department of Mathematics, University of Ioannina, Greece in 1974 and a PhD in Numerical Analysis, Department of Computer Studies, Loughborough University of Technology, UK in 1978. He started his academic carrier in 1980 as a Lecturer and later as an Assistant and Associate Professor in the Department of Mathematics at the National and Kapodistrian University of Athens (NKUA). He is a Professor at the Department of Informatics and Telecommunications at NKUA since 1995. In 1986-1987 he was visiting Professor of the Computer Science Department and Research Scholar of the Parallel Computing Laboratory at Rutgers University, USA. In 2006-2008 he was visiting professor of the Computer Science Department of Cyprus. During spring 2013 he was visiting Scholar of the Applied Mathematics and Statistics Department of the State University of New York at Stony Brook. He has taught a variety of undergraduate courses. In the graduate level he teaches the courses Scientific Computing (numerical solution of Partial Differential Equations) and Parallel Algorithms. He is the author of five books, over 30 publications in refereed journals and over 40 publications in conference proceedings. He has been the advisor of five PhD students. His main research interests are in the area of scientific computing and in particular in parallel solution of Partial Differential Equations and in load balancing. He has been the principal investigator of various national research projects and co investigator of EU funded projects. It is worth mentioning the SKIRON project which resulted in the parallelization of the well known Eta model. SKIRON is in operational use by the Hellenic Meteorology Service for medium range weather forecasting. Teaching Activities Graduate level Numerical Analysis Numerical Linear Algebra Algorithms and Complexity Introduction to Programming Data Structures Postgraduate level Scientific Computing (Numerical Solution of Partial Differential Equations) Parallel Algorithms Stay in Touch Tel.: +30 210 7275103 Fax: +30 210 7275114 Email: nmis @ di.uoa.gr Address Department of Informatics and Telecommunications National and Kapodistrian University of Athens Panepistimiopolis 157 84, Ilissia, Athens, Greece. © 2018 Department of Informatics and Telecommunications - UoA",
  "content_length": 2458,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:04"
}