{
  "name": "Nikolay Atanasov 0001",
  "homepage": "https://natanaso.github.io",
  "status": "success",
  "content": "Nikolay A. Atanasov Nikolay Atanasov Research Publications CV Associate Professor ERL · ECE · CRI · UCSD email natanasov@ucsd.edu office Franklin Antonio Hall 3304 lab Franklin Antonio Hall 3301 Biography I am an Associate Professor in the Department of Electrical and Computer Engineering at University of California, San Diego. I direct the Existential Robotics Laboratory (ERL). I am affiliated with the Contextual Robotics Institute (CRI) at UCSD. Before joining UCSD, I was a Postdoctoral Fellow at the department of Mechanical Engineering and Applied Mechanics, University of Pennsylvania, working with Vijay Kumar. I defended my Ph.D. dissertation on Active Information Acquisition with Mobile Robots at the department of Electrical and Systems Engineering, University of Pennsylvania in July, 2015. My advisors were George J. Pappas and Kostas Daniilidis. I received an M.S. degree in Electrical Engineering from the University of Pennsylvania, Philadelphia, PA, in 2012 and a B.S. degree in Electrical Engineering from Trinity College, Hartford, CT, in 2008. Research Interests My research goal is to develop scientific principles for increasing the reliability, efficiency, and versatility of autonomous robot systems. My work focuses on autonomous information collection using ground and aerial mobile robots in localization and mapping, environmental monitoring, and security and surveillance applications. My research contributions include probabilistic environment models that unify geometry and semantics and optimal control and reinforcement learning algorithms for minimizing uncertainty in these models. The fields relevant to my research are robotics, machine learning, control theory, optimization, and computer vision. Teaching Winter '26ECE 276A: Sensing & Estimation in Robotics Spring '25ECE 276B: Planning & Learning in Robotics Winter '25ECE 276A: Sensing & Estimation in Robotics Fall '24ECE 171A: Linear Control System Theory Spring '24ECE 276B: Planning & Learning in Robotics Winter '24ECE 276A: Sensing & Estimation in Robotics Fall '23ECE 171A: Linear Control System Theory Spring '23ECE 276B: Planning & Learning in Robotics Winter '23ECE 276A: Sensing & Estimation in Robotics Fall '22ECE 171A: Linear Control System Theory Spring '22ECE 276B: Planning & Learning in Robotics Winter '22ECE 276A: Sensing & Estimation in Robotics Fall '21ECE 171A: Linear Control System Theory Spring '21ECE 276B: Planning & Learning in Robotics Winter '21ECE 276A: Sensing & Estimation in Robotics Spring '20ECE 276B: Planning & Learning in Robotics Winter '20ECE 276A: Sensing & Estimation in Robotics Spring '19ECE 276B: Planning & Learning in Robotics Winter '19ECE 276A: Sensing & Estimation in Robotics Winter '18ECE 276B: Planning & Learning in Robotics Fall '17ECE 276A: Sensing & Estimation in Robotics Spring '17ESE 650: Learning in Robotics (University of Pennsylvania)",
  "content_length": 2896,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:06"
}