{
  "name": "Nikolaos Laoutaris",
  "homepage": "http://laoutaris.info",
  "status": "success",
  "content": "Personal homepage – Researcher & Innovator Skip to content I am  a research professor at IMDEA Networks Institute in Madrid and director of its Data Transparency Group. Prior to that I was director of data science at Eurecat and chief scientist of the Data Transparency Lab which I co-founded in 2014 during my 10 year tenure as a researcher and senior researcher of Telefonica Research in Barcelona. Before Telefonica, I was a postdoc fellow at Harvard University and Marie Curie postdoc fellow at Boston University. I got my PhD in computer science from the University of Athens in 2004. My interests include: privacy/transparency/data protection, economics of networks and information, intelligent transportation, distributed systems, protocols, and network measurements. Search for: Search Recent Posts Podcast: The Future of Privacy with ProperData PIs A measurement study of B2B Data Marketplaces, their data products and pricing. A first look at what awaits ahead in the era of European Data Spaces and Gaia-X. Let’s stop tracking and instead build a personal data inter-network on top of the Web and the Internet. Here’s how … We looked at 1 Billion URLs and found that some 150 Millions of them include sensitive content related to Health, Political Beliefs, Sexual Orientation, etc. Why online services should pay You for Your data? The arguments for a Human-Centric Data Economy Networking Research: Present, Future and Beyond Data Transparency: Concerns and Prospects Myth-busting: Most tracking flows on European citizens DO NOT terminate outside EU28 GDPR borders The three types of research papers and how I learned to recognise them There I said it: The Net Neutrality “debate” is the Climate Change “debate” of the Internet Recent Commentsvifrihdas on Why online services should pay You for Your data? The arguments for a Human-Centric Data EconomyVasileios on There I said it: The Net Neutrality “debate” is the Climate Change “debate” of the InternetTiago Simas on A brief farewell after 10 yearsBEA on A brief farewell after 10 yearsCategories Computer Science Data Economy DTL IMDEA Internet Personal Privacy Raving Posting....",
  "content_length": 2148,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:07"
}