{
  "name": "Nikolaos Aletras",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/nikos-aletras",
  "status": "success",
  "content": "Professor Nikos Aletras | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Nikos Aletras School of Computer Science Professor of Natural Language Processing Head of the Natural Language Processing (NLP) research group Open staff member portrait in a modal window n.aletras@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Nikos Aletras School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0003-4285-1965 Google Scholar Personal website Profile Nikos Aletras is a Professor in Natural Language Processing (NLP) in the Computer Science Department at the University of Sheffield, co-affiliated with the Machine Learning (ML) group. Previously, he was a research scientist at Amazon (Core ML and Alexa) and a research associate at UCL, Department of Computer Science, Media Futures Group. He completed a PhD in NLP at the University of Sheffield. His research interests are in NLP, Machine Learning and Data Science. He develops text analysis methods to solve problems in other scientific areas such as (computational) social and legal science. Research interests NLPComputational Social ScienceLegal NLPData ScienceMachine Learning Publications Journal articles Cao M, Wang X & Aletras N (2025) Progressive Depth Up-scaling via Optimal Transport.. CoRR, abs/2508.08011. Fang J, Peng Y, Zhang X, Wang Y, Yi X, Zhang G, Xu Y, Wu B, Liu S, Li Z , Ren Z et al (2025) A Comprehensive Survey of Self-Evolving AI Agents: A New Paradigm Bridging Foundation Models and Lifelong Agentic Systems.. CoRR, abs/2508.07407. Lewis-Lim S, Tan X, Zhao Z & Aletras N (2025) Analysing Chain of Thought Dynamics: Active Guidance or Unfaithful Post-hoc Rationalisation?. CoRR, abs/2508.19827. Meng C, Tonolini F, Mo F, Aletras N, Yilmaz E & Kazai G (2025) Bridging the gap: from ad-hoc to proactive search in conversations. SIGIR '25: Proceedings of the 48th International ACM SIGIR Conference on Research and Development in Information Retrieval, 64-74. View this article in WRRO Chlapanis OS, Galanis D, Aletras N & Androutsopoulos I (2025) GreekBarBench: A Challenging Benchmark for Free-Text Legal Reasoning and Citations.. CoRR, abs/2505.17267. Tan X, Valentino M, Akhter ME, Liakata M & Aletras N (2025) Enhancing Logical Reasoning in Language Models via Symbolically-Guided Monte Carlo Process Supervision.. CoRR, abs/2505.20415. Williams M, Chrysostomou G, Jeronymo V & Aletras N (2025) Compressing Language Models for Specialized Domains.. CoRR, abs/2502.18424. Mu Y, Niu P, Bontcheva K & Aletras N (2024) Predicting and analyzing the popularity of false rumors in Weibo. Expert Systems with Applications, 243. View this article in WRRO Chrysostomou G, Zhao Z, Williams M & Aletras N (2024) Investigating hallucinations in pruned large language models for abstractive summarization.. Transactions of the Association for Computational Linguistics, 12, 1163-1181. Zhao Z & Aletras N (2024) Comparing explanation faithfulness between multilingual and monolingual fine-tuned language models. Proceedings of the 2024 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (Volume 1: Long Papers), 1, 3226-3244. View this article in WRRO Mu Y, Song X, Bontcheva K & Aletras N (2024) Examining the limitations of computational rumor detection models trained on static datasets. 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation, LREC-COLING 2024 - Main Conference Proceedings, 6739-6751. View this article in WRRO Mu Y, Wu BP, Thorne W, Robinson A, Aletras N, Scarton C, Bontcheva K & Song X (2024) Navigating prompt complexity for zero-shot classification: a study of large language models in computational social science. Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024), 12074-12086. View this article in WRRO Yamaguchi A, Villavicencio A & Aletras N (2024) An Empirical Study on Cross-lingual Vocabulary Adaptation for Efficient Language Model Inference. Findings of the Association for Computational Linguistics: EMNLP 2024, 6760-6785. Villegas DS, Preoţiuc-Pietro D & Aletras N (2024) Improving Multimodal Classification of Social Media Posts by Leveraging Image-Text Auxiliary Tasks. Eacl 2024 18th Conference of the European Chapter of the Association for Computational Linguistics Findings of Eacl 2024, 1126-1137. Jin M, Preoţiuc-Pietro D, Doğruöz AS & Aletras N (2024) Who is bragging more online? A large scale analysis of bragging in social media. 2024 Joint International Conference on Computational Linguistics Language Resources and Evaluation Lrec Coling 2024 Main Conference Proceedings, 17575-17587. Yamaguchi A, Villavicencio A & Aletras N (2024) Vocabulary Expansion for Low-resource Cross-lingual Transfer.. CoRR, abs/2406.11477. De Clercq O & Aletras N (2024) Introduction. Eacl 2024 18th Conference of the European Chapter of the Association for Computational Linguistics Proceedings of System Demonstrations, IV. Mu Y, Jin M, Song X & Aletras N (2024) Enhancing Data Quality through Simple De-duplication: Navigating Responsible Computational Social Science Research.. CoRR, abs/2410.03545. Hughes A, Aletras N & Ma N (2024) How Private are Language Models in Abstractive Summarization?. CoRR, abs/2412.12040. Yamaguchi A, Morishita T, Villavicencio A & Aletras N (2024) Vocabulary Expansion of Chat Models with Unlabeled Target Language Data.. CoRR, abs/2412.11704. Lalmas M, Zhang M, Santos R, Yilmaz E, Joho H, Ding W, Hauff C, Aletras N, Jaidka K & Alhoori H (2023) CIKM'23 Program Chairs' Welcome. International Conference on Information and Knowledge Management Proceedings, v. Dommett K, Mensah SA, Zhu J, Stafford T & Aletras N (2023) Is there a permanent campaign for online political advertising? Investigating partisan and non-party campaign activity in the UK between 2018–2021. Journal of Political Marketing, 24(2), 143-161. View this article in WRRO Vickers P, Barrault L, Monti E & Aletras N (2023) We Need to Talk About Classification Evaluation Metrics in NLP. Proceedings of the 13th International Joint Conference on Natural Language Processing and the 3rd Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics (Volume 1: Long Papers). Williams M & Aletras N (2023) Frustratingly Simple Memory Efficiency for Pre-trained Language Models via Dynamic Embedding Pruning.. CoRR, abs/2309.08708. Xue H & Aletras N (2023) Pit One Against Many: Leveraging Attention-head Embeddings for Parameter-efficient Multi-head Attention. Findings of the Association for Computational Linguistics: EMNLP 2023, 10355-10373. Sánchez Villegas D, Goanta C & Aletras N (2023) A Multimodal Analysis of Influencer Content on Twitter. Proceedings of the 13th International Joint Conference on Natural Language Processing and the 3rd Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics (Volume 1: Long Papers), 225-240. Alajrami A, Margatina K & Aletras N (2023) Understanding the Role of Input Token Characters in Language Models: How Does Information Loss Affect Performance?. Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing, 9085-9108. Goanta C, Aletras N, Chalkidis I, Ranchordás S & Spanakis G (2023) Regulation and NLP (RegNLP): Taming Large Language Models. Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing, 8712-8724. Margatina K, Schick T, Aletras N & Dwivedi-Yu J (2023) Active Learning Principles for In-Context Learning with Large Language Models. Findings of the Association for Computational Linguistics: EMNLP 2023, 5011-5034. Williams M & Aletras N (2023) How Does Calibration Data Affect the Post-training Pruning and Quantization of Large Language Models?. CoRR, abs/2311.09755. Zhang L, Song H, Aletras N & Lu H (2022) Node-feature convolution for graph convolutional networks. Pattern Recognition, 128. View this article in WRRO Li W & Aletras N (2022) Improving Graph-Based Text Representations with Character and Word Level N-grams. Proceedings of the 2nd Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics and the 12th International Joint Conference on Natural Language Processing (Volume 2: Short Papers), 228-233. Mu Y, Niu P & Aletras N (2022) Identifying and Characterizing Active Citizens who Refute Misinformation in Social Media.. CoRR, abs/2204.10080. Mu Y & Aletras N (2020) Identifying Twitter users who repost unreliable news sources with linguistic information. PeerJ Computer Science, 6. Fomicheva M, Sun S, Yankovskaya L, Blain F, Guzmán F, Fishel M, Aletras N, Chaudhary V & Specia L (2020) Unsupervised quality estimation for neural machine translation. Transactions of the Association for Computational Linguistics, 8(2020), 539-555. View this article in WRRO Aletras N, Tsarapatsanis D, Preoţiuc-Pietro D & Lampos V (2016) Predicting Judicial Decisions of the European Court of Human Rights: A Natural Language Processing Perspective. PeerJ in Computer Science, 2. View this article in WRRO Aletras N, Baldwin T, Lau J & Stevenson M (2015) Evaluating Topic Representations for Exploring Document Collections. Journal of the Association for Information Science and Technology. View this article in WRRO Gonzalez-Agirre A, Rigau G, Agirre E, Aletras N & Stevenson M (2015) Why are these similar? Investigating item simirlaity types in a large Digital Library. Journal of the Association for Information Science and Technology. View this article in WRRO Preoţiuc-Pietro D, Volkova S, Lampos V, Bachrach Y & Aletras N (2015) Studying user income through language, behaviour and affect in social media. PLoS ONE, 10(9). View this article in WRRO Aletras N, Stevenson M & Clough P (2012) Computing simil",
  "content_length": 47711,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:02"
}