{
  "name": "Nikolas Mitrou",
  "homepage": "http://mcwt.cn.ntua.gr/content/nikolaos-mitrou",
  "status": "success",
  "content": "Nikolaos Mitrou | MCWT Skip to main content MCWT Multimedia Communications & Web Technologies English Ελληνικά Home About Members Education ResearchProjects Publications News Contact Search form Search About Members Education Research News You are hereHome»Members»Nikolaos Mitrou Nikolaos Mitrou Prof. Nikolas M. Mitrou received the undergraduate Diploma degree in electrical engineering from the National Technical University of Athens (NTUA) in 1980, the MSc degree in Systems and Control from the UMIST, Manchester, in 1982 and the PhD degree in electrical engineering from NTUA in 1986. From 1982 to 1985 he was with the Nuclear Research Centre \"Demokritos\", Athens, where he was involved in signal processing projects. From 1986 to 1988 he worked at the National Defense Research Centre, Athens, for the development of a low-bit-rate voice coding system. In 1988 he joined the NTUA, where he is currently full professor in the School of Electrical and Computer Engineering. His research interests are in the areas of digital communication systems, networks and networked applications & services, sensor networks, knowledge and semantic web technologies, with emphasis on the architecture, modelling, performance evaluation and optimisation of systems and networks, as well as on end-user application and service development, having more than 45 journal papers in the above fields. Currently, he is active in the areas of sensor networks and distributed knowledge systems with applications in the fields of Geographic Information and mulimedia content management. Prof. Mitrou has had a leading participation in many research projects, mainly in the fields of broadband communications and networked applications (RACE, ESPRIT, ACTS, IST): RACE 1022 \"Technology for ATD\", RACE 1043 \"Mobile Telecommunication Project\", RACE 2061 \"EXPLOIT\", RACE 2064 FLASH-TV, H-VLSI-DPE (ESPRIT), H-VLSI-DPE (STRIDE), ACTS AC094 \"EXPERT\", IST-OPENISE, IST-CREDO, IST- ADAMANT. He was the Project Manager of the European project AC235-WATT, aiming at remote monitoring and control of experimental ATM networks through the WWW and disseminating important results from trials. He has also been the technical coordinator of the IST-1999-11590 project OPENISE (Open Platform for Enhanced Interactive Services) and the coordinator of the NTUA participation in many national R&D projects (ESPRIT, STRIDE, PENED, PAVET). Prof. Mitrou has a significant contribution to the corresponding research fields with more than 45 journal papers and many conference papers and tutorials. He has supervised 21 doctoral students, successfully completed their theses in the period 1989-2009, while 6 more are currently working towards their PhD degree in the areas of \"Sensor Networks\", \"Multimedia Communications\", \"Wireless Communications\", \"Web Technologies\" and \"Distributed Knowledge Systems\". He has been the general chair of the Networking 2004 (the 3rd IFIP-TCG networking conference). Prof. Mitrou is a member of the IEEE and the Technical Chamber of Greece and member of the IFIP WG 6.4. Job Title: ProfessorAffiliation: Division of Communication, Electronic and Information Engineering mitrou_publications_citations.pdf Publications 2013 Arkoulis S, Anifantis E, Karyotis V, Papavassiliou S, Mitrou N. On the optimal, fair and channel-aware cognitive radio network reconfiguration. Computer Networks. 2013;57(8):1739-1757. 2012 Arkoulis S, Anifantis E, Karyotis V, Papavassiliou S, Mitrou N. Channel switching-aware optimal reconfiguration in Cognitive Radio Networks.; 2012. 1. p. 1-8p. 2006 Zoi S, Stathopoulos P, Papageorgiou P, Mitrou N, Soldatos J. PRIAMOS: A system for the real time extraction of multimedia semantics and its integration in advanced surveillance and conferencing applications.; 2006. 2004 Tsesmetzis D, Solidakis M, Stathopoulos V, Mitrou N. Distributed Search in P2P Networks through Secure-Authenticated Content Management Systems (CMSs). Los Alamitos, CA, USA: IEEE Computer Society; 2004. 2. p. 260-261p. Navigation About Members Education Research Latest Publications An Approach for the Incremental Export of Relational Databases into RDF Graphs Incremental Export of Relational Database Contents into RDF Graphs Exposing Scholarly Information as Linked Open Data: RDFizing DSpace contents Electronic textbooks advantages and challenges for the Hellenic higher education and publishing community Contact Prof. Nikolas Mitrou School of Electrical and Computer Engineering, National Technical University of Athens, Heroon Polytechneiou 9, 157-73, Zografou, GREECE Tel.: +30210-7721639, +30210-7722549 Fax: +30210-7722530 e-mail: mitrou@cs.ntua.gr Powered by Drupal",
  "content_length": 4668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:06"
}