{
  "name": "Nikolaj Tatti",
  "homepage": "https://researchportal.helsinki.fi/en/persons/nikolaj-tatti",
  "status": "success",
  "content": "Nikolaj Tatti - University of Helsinki Nikolaj Tatti Professor, Department of Computer ScienceTitle of Docent, Department of Computer ScienceSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿ https://orcid.org/0000-0002-2087-5360 Emailnikolaj.tattihelsinkifi PL 68 (Pietari Kalmin katu 5)00014Finland 20062026 Research activity per year Personal profile Fields of Science113 Computer and information sciences Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2006 2011 2012 2014 2017 2023 2024 2026 50 Conference contribution 39 Article 2 Chapter Research output per year Research output per year The Densest SWAMP Problem: Subhypergraphs with Arbitrary Monotonic Partial Edge RewardsBengali, V., Tatti, N., Kumpulainen, I., Adriaens, F. & Veldt, N., 2026, Machine Learning and Knowledge Discovery in Databases. Research Track - European Conference, ECML PKDD 2025, Proceedings. Ribeiro, R. P., Jorge, A. M., Pfahringer, B., Japkowicz, N., Larrañaga, P., Soares, C., Abreu, P. H. & Gama, J. (eds.). Springer Science and Business Media Deutschland GmbH, p. 75-91 17 p. (Lecture Notes in Computer Science; vol. 16015 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Approximating splits for decision trees quickly in sparse data streamsTatti, N., 2025, 2025 SIAM International Conference on Data Mining, SDM 2025. Society for Industrial and Applied Mathematics Publications, p. 647-655 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Fair Diversity Maximization with Few RepresentativesAdriaens, F. & Tatti, N., 3 Aug 2025, KDD '25: Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining V.2. ACM, p. 17-25 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Finding Coherent Node Groups in Directed GraphsKumpulainen, I. & Tatti, N., 2025, Machine Learning and Principles and Practice of Knowledge Discovery in Databases - International Workshops of ECML PKDD 2023, Revised Selected Papers. Meo, R. & Silvestri, F. (eds.). Springer Science and Business Media Deutschland GmbH, p. 486-497 12 p. (Communications in Computer and Information Science; vol. 2135 CCIS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open Access From Your Block to Our Block: How to Find Shared Structure Between Stochastic Block Models over Multiple GraphsKumpulainen, I., Dalleiger, S., Vreeken, J. & Tatti, N., 2025, Proceedings of the Thirty-Ninth AAAI Conference on Artificial Intelligence and Thirty-Seventh Conference on Innovative Applications of Artificial Intelligence and Fifteenth Symposium on Educational Advances in Artificial Intelligence. Walsh, T., Shah, J. & Kolter, Z. (eds.). The Association for the Advancement of Artificial Intelligence (AAAI), p. 11987-11994 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review View all 91 research outputs Projects Projects per year 2023 2023 2025 2029 2 Active Projects per year PAPADAM: Principled approaches to explainable data analysis and miningTatti, N. (Project manager)Academy of Finland01/09/2025 → 31/08/2029Project: Research Council of Finland: Academy Project University profiling funding 7 InterEarth RESETAiravaara, M. (Project manager), Heiskanen, J. (Project manager), Huiskonen, J. (Project manager), Hyvärinen, M. (Project manager), Kulmala, M. (Project manager), Kulmala, M. (Project manager), Mervaala, E. (Project manager), Mäkelä, J. (Project manager), Primmer, C. (Project manager), Räsänen, A. (Project manager), Sironen, T. (Project manager), Toivonen, R. (Project manager), Aalto, P. (Participant), Ahonen, L. (Participant), Alakukku, L. (Participant), Arif, K. (Participant), Auvinen, P. (Participant), Betz-Heinemann, A. (Participant), Citterico, M. (Participant), Ecke, F. (Participant), El Wali, M. (Participant), Eronen, J. T. (Participant), Fuentenebro Alonso, P. (Participant), Gammal, J. (Participant), Green, S. (Participant), Haaranen, D. A. P. (Participant), Halder, M. (Participant), Heikinheimo, A. (Participant), Heinonen, S. (Participant), Heinonen, M. (Participant), Hohti, R. (Participant), Holopainen, M. (Participant), Hyytiäinen, K. (Participant), Hölttä, T. (Participant), Jenkins, J. (Participant), Jokiranta, J. (Participant), Junttila, S. (Participant), Kaartinen, T. (Participant), Karhu, K. (Participant), Kaukonen, M. (Participant), Kemppinen, J. (Participant), Kerminen, V.-M. (Participant), Kiljunen, S. (Participant), Kolari, P. (Participant), Korhonen, E. M. (Participant), Korpela, K. (Participant), Korsunova-Tsaruk, A. (Participant), Koskinen, M. (Participant), Lajunen, A. (Participant), Lampilahti, J. (Participant), Lehto, K.-M. (Participant), Lewandowska, A. (Participant), Lindholm, T. M. (Participant), Lindroos, M. (Participant), Lintunen, A. (Participant), Luomanen, P. (Participant), Lyu, Y. (Participant), Mappes, J. (Participant), Mietola, R. (Participant), Mühleip, A. W. (Participant), Nordström, M. C. (Participant), Norkko, J. (Participant), Omija, J. A. (Participant), Paasonen, P. (Participant), Paavilainen, V. (Participant), Pietikäinen, J. (Participant), Pihlatie, M. (Participant), Poczai, P. (Participant), Porcar-Castell, A. (Participant), Poupart, T. A. (Participant), Pylkkö, T. (Participant), Raivonen, M. (Participant), Rasmus, L. S. (Participant), Rikkinen, J. (Participant), Ruohomäki, A. I. (Participant), Ryhti-Laine, K. (Participant), Saari, T. L. A. (Participant), Sadeghibagherabadi, A. (Participant), Sandström, V. (Participant), Sikanen, T. (Participant), Siven, M. (Participant), Spisak, S. M. (Participant), Su, X. (Participant), Syrjä, P. (Participant), Taira, T. (Participant), Tani, S. (Participant), Tanskanen, T. T. (Participant), Tatti, N. (Participant), Thomas, D. N. (Participant), Tiira, T. (Participant), Toppinen, A. (Participant), Tuominen, P. (Participant), Uimari, P. (Participant), Uusitalo, J. A. (Participant), Vainio, A. (Participant), Varjosalo, M. (Participant), Vartiainen, M. (Participant), Veikkolainen, T. (Participant), Williamson, A. (Participant) & Zaidan, M. A. (Participant)Academy of Finland, Suomen Akatemia Projektilaskutus01/01/2023 → 31/12/2028Project: Research Council of Finland: Strengthening university research profiles (PROFI)",
  "content_length": 6868,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:01"
}