{
  "name": "Nikolai Sultana",
  "homepage": "https://www.iit.edu/directory/people/nik-sultana",
  "status": "success",
  "content": "Nik Sultana | Illinois Institute of Technology Skip to main site navigation Skip to main content Nik Sultana Assistant Professor of Computer Science Tags: Faculty Computer Science Home Office and Department Directory Directory Nik Sultana EducationPh.D. Computer ScienceTrinity College, University of CambridgeResearch InterestsDistributed systems, Programmable networking, Security, Automated reasoning, Formal methodsCybersecuritySystemsTheoryProfessional Affiliations & MembershipsAssociation for Automated ReasoningAssociation for Computing Machinery (ACM)British Logic Colloquium (BLC)Institute of Electrical and Electronic Engineering (IEEE)Institution of Engineering and Technology (IET)USENIXPublicationsFlightplan: Dataplane Disaggregation and Placement for P4 Programs April 2021, N.S, J. Sonchack, H. Giesen, I. Pedisich, Z. Han, N. Shyamkumar, S. Burad, A. DeHon, B. Loo; USENIX Symposium on Networked Systems Design and Implementation (NSDI)Emu: Rapid Prototyping of Networking Services July 2017 N.S, S. Galea, D. Greaves, M. Wojcik, J. Shipton, R. Clegg, L. Mai, P. Bressana, R. Soulé, R. Mortier, P. Costa, P. Pietzuch, J. Crowcroft, A. Moore, N. Zilberman; USENIX Annual Technical Conference (ATC)FLICK: Developing and Running Application-Specific Network Services June 2016, A. Alim, R. Clegg, L. Mai, L. Rupprecht, E. Seckler, P. Costa, P. Pietzuch, A. Wolf, N.S, J. Crowcroft, A. Madhavapeddy, A. Moore, R. Mortier, M. Koleni, L. Oviedo, D. McAuley, M. Migliavacca; USENIX Annual Technical Conference (ATC) Contact Information nsultana1@illinoistech.edu Website 208C, SB Learn more... Illinois Tech welcomes you to join our community of people who discover, create, and solve. Apply today, visit us in Chicago, and contact us for more information. Request Info Visit Apply",
  "content_length": 1792,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:00"
}