{
  "name": "Nikolaos M. Freris",
  "homepage": "http://staff.ustc.edu.cn/~nfr",
  "status": "success",
  "content": "ï»¿ Nikolaos M. Freris Nikolaos M. Freris (å°¼å ) Professor of Computer Science School of Computer Science and Technology University of Science and Technology of China (USTC) Email: nfr@ustc.edu.cn Telephone: +86-(0) 551 63601767 Addressï¼Office 515, Diansan Building, West Campus, 443 Huangshan Road, Hefei, Anhui 230027, China Introduction Welcome to the AIoT group! Please check our introduction video (slides , poster). æ¬¢è¿ç¡å£«çãåå£«çãåå£«ååç¹ä»»å¯ç ç©¶åå å ¥äººå·¥æºè½ç©èç½å®éªå®¤ The AIoT Lab at USTC is recruiting students at all levels and postdocs / associate research fellows Education â PhD Electrical & Computer Engineering â University of Illinois at Urbana-Champaign (2010) â MS Mathematics â University of Illinois at Urbana-Champaign (2008) â MS Electrical & Computer Engineering â University of Illinois at Urbana-Champaign (2007) â Diploma Electrical & Computer Engineering â National Technical University of Athens (2005) Research Cyberphysical Systems (CPS) encapsulate very large networks of âsmartâ devices (possessing sensing, communication, and computation capabilities) that control physical entities. Notable examples enlist Smart Cities, Smart Grids, Intelligent Transportation, Sensor Networks, and Swarm Robotics. The ever-emerging paradigm of Artificial Intelligence of Things (AIoT) targets solutions that capitalize the computational power of Internet-of-Things (IoT) devices to enable Artificial Intelligence (AI) in system operations. Our group conducts interdisciplinary research across a broad range of topics and applications pertaining to AIoT / CPS / IoT such as: â Machine Learning: Distributed Learning, Deep Learning, Data Mining, Federated Learning, Online Learning, Reinforcement Learning â Distributed Optimization â Edge Computing â Wireless Networks â System Theory: Optimization, Estimation, and Control â Signal Processing: Sparse sampling and Online algorithms as well as applications in transportation, power systems, and robotics. Teaching CS4017  Introduction to Optimization COMP6224P  Optimization Theory COMP6209P  Queueing Theory & Applications Brief Bio Nick Freris is Professor in the School of Computer Science at USTC and former Vice Dean of the International College (2019-2024). He received the Diploma in Electrical and Computer Engineering from the National Technical University of Athens (NTUA), Greece, in 2005, and the M.S. degree in Electrical and Computer Engineering, the M.S. degree in Mathematics, and the Ph.D. degree in Electrical and Computer Engineering all from the University of Illinois at Urbana-Champaign (UIUC) in 2007, 2008, and 2010, respectively. His research lies in AIoT/CPS/IoT: machine learning, distributed optimization, data mining, wireless networks, control, and signal processing, with applications in transportation, power systems, sensor networks, and robotics. Dr. Freris has published several papers in high-profile conferences and journals held by IEEE, ACM, and SIAM and holds four patents. His research has been sponsored by the Ministry of Science and Technology of China, the Anhui Department of Science and Technology, Tencent, and the National Science Foundation (NSF), USA. He was recognized as the 2023 IEEE ROBIO Best Paper Award Finalist, as well as with the USTC Alumni Foundation Innovation Scholar Award (twice), the IBM High Value Patent Award, the IBM Invention Achievement Award (twice), and the Gerondelis Foundation Scholarship. Previously, he was with the faculty of NYU and, before that, he held senior researcher and postdoctoral researcher positions at EPFL and IBM Research, respectively. Dr. Freris is a Senior Member of IEEE, ACM, and CCF. CV (Nov. 2025) Publications (Google Scholar page) Journal Articles 1. Z. Wang, N. Freris, and X. Wei, âSpiRobs: Logarithmic Spiral-shaped Robots for Versatile Grasping Across Scales.â Device, vol. 3, no. 4, pp. 100646, 2025. (video in English & Chinese) 2. Z. Huang and N. Freris, âReinforcement Learning-based Layer-wise Aggregation for Personalized Federated Learning.â IEEE Internet of Things Journal, vol. 12, no. 7, pp. 8614-8625, 2025. 3. D. Yan, P. Yang, F. Shang, N. Freris, and Y. Yan, âNon-intrusive and Efficient Estimation of Antenna 3-D Orientation for WiFi APs.â IEEE Transactions on Mobile Computing, vol. 24, no. 3, pp. 1453-1468, 2025. 4. L. Wei and N. Freris, âArctic Sea Ice Prediction based on Multi-scale Graph Modeling with Conservation Laws.â Journal of Geophysical Research: Atmospheres, vol. 130, no.1, pp. e2024JD042136, 2025. 5. L. Wei and N. Freris, âMulti-scale Graph Neural Network for Physics-informed Fluid Simulation.â Visual Computer, vol. 41, pp. 1171-1181, 2025 (also presented at the 40th Computer Graphics International (CGI) Conference, Aug. 2023). 6. Y. Zhang and N. Freris, âAdaptive Filter Pruning via Sensitivity Feedback.â IEEE Transactions on Neural Networks and Learning Systems, vol. 35, no. 8, pp. 10996-11008, 2024. 7. T. Wen and N. Freris, âSemantically Enhanced Multi-Object Detection and Tracking for Autonomous Vehicles.â IEEE Transactions on Robotics, vol. 39, no. 6, pp. 4600-4615, 2023. 8. Y. Li, P. Voulgaris, D. Stipanovic, and N. Freris, âCommunication Efficient Curvature Aided Primal-dual Algorithms for Decentralized Optimization.â IEEE Transactions on Automatic Control, vol. 68, no. 11, pp. 6573-6588, 2023. 9. N. Freris, A. Ajalloeian, and M. Vlachos, âInterpretable Embedding and Visualization of Compressed Data.â ACM Transactions on Knowledge Discovery from Data, vol. 17, no. 2, pp. 1-22, 2023. 10. M. Li, J. Qin, N. Freris, and D. Ho, âMulti-Player Stackelberg-Nash Game for Nonlinear System via Value Iteration-Based Integral Reinforcement Learning.â IEEE Transactions on Neural Networks and Learning Systems, vol. 33, no. 4, pp. 1429-1440, 2022. 11. T. Huang, N. Freris, P. R. Kumar, and L. Xie, âA Synchrophasor Data-driven Method for Forced Oscillation Localization under Resonance Conditions.â IEEE Transactions on Power Systems, vol. 35, no. 5, pp. 3927-3939, 2020. 12. S.\tJabari,\tN.\tFreris, and\tD.\tDilip,\tâSparse\ttravel\ttime\testimation\tfrom\tstreaming\tdata.â\tTransportation\tScience, vol. 54, no. 1, pp. 1-20, 2020. 13. P.\t Latafat,\t N.\t Freris,\t and\t P.\t Patrinos,\t âA\t new\t randomized\t block-coordinate\t primal-dual\t algorithm\t for\t distributed\toptimization.â\tIEEE\tTransactions\ton\tAutomatic\tControl,\tvol. 64, no. 10, pp. 4050-4065, 2019. 14. A.\tDarabseh\tand\tN.\tFreris,\tâA\tsoftware-defined\tcontrol\tfor\tIoT Cyberphysical\tSystems.â\tJournal\tof\tCluster\tComputing, vol. 22, no. 4, pp. 1107-1122, 2019. 15. M.\tVlachos,\tN.\tFreris,\tand\tA.\tKyrillidis,\tâCompressive\tMining:\tFast\tand\tOptimal\tData\tMining\tin\t the\tCompressed\tDomain.â\tInternational\tJournal\ton\tVery\tLarge\tData Bases\t(VLDB Journal),\tvol.\t24, no. 1,\tpp.\t1-24,\t2015 16. S.\t Zoumpoulis,\t M.\t Vlachos,\t N.\t Freris,\t and\t C.\t Lucchese,\t âRight-Protected\t Data\t Publishing\t with\t Provable\t Distance-based\tMining.â\tIEEE\tTransactions\ton\tKnowledge\tand\tData\tEngineering,\tvol.\t26, no. 8,\tpp.\t2014-2028,\t2014. 17. A.\tZouzias\tand\tN.\tFreris,\tâRandomized\tExtended\tKaczmarz\tfor\tSolving\tLeast\tSquares.â\tSIAM\tJournal\ton\tMatrix\tAnalysis\tand\tApplications,\tvol.\t34, no. 2,\tpp.\t773-793,\t2013. 18. N.\t Freris,\t C.\t Hsu,\t J.\t Singh, and\t X.\t Zhu,\t âDistortion-Aware\t Scalable\t Video\t Streaming\t to\t Multinetwork\t Clients.â\t IEEE/ACM\tTransactions\ton\tNetworking,\tvol.\t21,\tno. 2,\tpp. 469-481,\t2013. 19. N.\tFreris,\tS.\tGraham, and\tP.\tR.\tKumar,\tâFundamental\tLimits\ton\tSynchronizing\tClocks\tover\tNetworks.â IEEE\tTransactions\ton\tAutomatic\tControl,\tvol.\t56,\tno.\t2,\tpp.\t1352-1364,\t2011. 20. N.\t Freris,\t H.\t Kowshik, and\t P.\t R.\t Kumar,\t âFundamentals\t of\t large\t sensor\t networks:\t Connectivity,\t Capacity,\t Clocks\t and\tComputation.â\tProceedings\tof\tthe\tIEEE,\tvol.\t98,\tno.\t1,\tpp.\t1828-1846,\t2010. Conference Papers 1. D. Yi, F. Zeng, and N. Freris, âCurvature accelerated decentralized non-convex optimization for high-dimensional machine learning problems.â Proceedings of the 23rd IEEE European Control Conference (ECC), June 2025.2. D. Yan, P. Yang, F. Shang, N. Freris, and Y. Yan, âAnteumbler: Non-Invasive Antenna Orientation Error Measurement for WiFi APs.â Proceedings of the 32nd IEEE/ACM International Symposium on Quality of Service (IWQoS), pp. 1-10, June 2024. 3. Z. Wang, G. Wang, X. Chen, and N. Freris, âKinematic modeling and control of a soft robotic arm with non-constant curvature deformation.â Proceedings of the 41st International Conference on Robotics and Applications (ICRA), pp. 12749-12755, May 2024. 4. Y. Zhang, L. Wei, and N. Freris, âSynergistic patch pruning for Vision Transformer: Unifying intra- & inter-layer patch importance.â Proceedings of the 12th International Conference on Learning Representations (ICLR), May 2024. 5. Z. Wang and N. Freris, âExploiting frictional effects to reproduce octopus-like reaching movements with a cable-driven spiral robot.â  Proceedings of the 7th IEEE-RAS International Conference on Soft Robotics (RoboSoft), pp. 537-542, Apr. 2024. 6. Z. Yu and N. Freris, âCommunication-efficient distributed optimization with adaptability to system heterogeneity.â Proceedings of the 62nd IEEE Conference on Decision and Control (CDC), pp. 3321-3326, Dec. 2023. 7. D. Yi and N. Freris, âDistributed optimization on directed graphs based on inexact ADMM with partial participation.â Proceedings of the 62nd IEEE Conference on Decision and Control (CDC), pp. 1138-1143, Dec. 2023. 8. Z. Wang, G. Wang, X. Chen, and N. Freris, âDynamic Modeling and Control of a Soft Robotic Arm Using a Piecewise Universal Joint Model.â Proceedings of the 19th IEEE International Conference on Robotics and Biomimetics (ROBIO), pp. 1-6, Dec. 2023. 9. J. Liu, L. Zhang, C. Lv, T. Yu, N. Freris, and X. Li, âTPMDP: Threshold Personalized Multi-party Differential Privacy via Optimal Gaussian Mechanism.â Proceedings of ",
  "content_length": 38893,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:02"
}