{
  "name": "Nikolaos Malevris",
  "homepage": "http://www.cs.aueb.gr/en/content/malevris-nikolaos",
  "status": "success",
  "content": "Τμήμα Πληροφορικής | Οικονομικό Πανεπιστήμιο Αθηνών Χρησιμοποιούμε cookies για να σας προσφέρουμε την καλύτερη δυνατή εμπειρία στη σελίδα μας. Εάν συνεχίσετε να χρησιμοποιείτε τη σελίδα, θα υποθέσουμε πως είστε ικανοποιημένοι με αυτό. Μπορείτε να μάθετε περισσότερα εδώ Χρησιμοποιούμε cookies για να σας προσφέρουμε την καλύτερη δυνατή εμπειρία στη σελίδα μας. Εάν συνεχίσετε να χρησιμοποιείτε τη σελίδα, θα υποθέσουμε πως είστε ικανοποιημένοι με αυτό. Μπορείτε να μάθετε περισσότερα εδώ -A +A Έντυπα Αιτήσεων Ώρες Γραφείου Εγχειρίδια Ψηφιακές Υπηρεσίες ΤΕΛΕΥΤΑΙΑ ΝΕΑ ΟΠΑ Κατάθεση αιτήσεων για παράταση ανώτατης διάρκειας φοίτησης - από Δευτέρα 3 Νοεμβρίου 2025 έως και την Τρίτη 2 Δεκεμβρίου 2025 Ωρολόγιο Πρόγραμμα Διδασκαλίας Χειμερινού εξαμήνου 2025-2026 Ανακοινώσεις 25 11, 2025 Κατατάξεις Πτυχιούχων 2025-2026 Ανακοινώθηκε το πρόγραμμα των κατατακτήριων εξετάσεων. Οι υποψήφιοι θα εξεταστούν στις 8,12 και 15 Δεκεμβρίου 2025 ... περισσότερα 17 11, 2025 Ομιλία Καθ. Βαγγέλη Μαρκάκη Title: On Approximately Fair Allocations of Indivisible Goods, Μέρα/Ώρα: Πέμπτη 20/11, ώρα 11πμ ... περισσότερα 10 10, 2025 Μηχανική Μάθηση Εκτάκτως για φέτος, το μάθημα της Μηχανικής Μάθησης θα διδαχθεί στο 7ο εξάμηνο. ... περισσότερα 17 09, 2025 Πρόγραμμα Πρακτικής Άσκησης Ανακοινώθηκαν τα Προσωρινά Αποτελέσματα για το πρόγραμμα «Πρακτική Άσκηση Οικονομικού Πανεπιστημίου Αθηνών ακ. ετών 2024-2025, 2025-2026 και 2026-2027» ... περισσότερα 25 08, 2025 Προκηρύξεις Θέσεων Εντεταλμένων Διδασκόντων του Τμήματος Πληροφορικής, της Σχολής Επιστημών και Τεχνολογίας της Πληροφορίας του ΟΠΑ ... περισσότερα 30 07, 2025 Προκηρύξεις Προγραμμάτων Μεταπτυχιακών Σπουδών Ξεκίνησε ο Β' κύκλος αιτήσεων για τα ΠΜΣ του Τμήματος Πληροφορικής για το Ακαδ. Έτος 2025-26 ... περισσότερα 23 07, 2025 Πρόγραμμα Πρακτικής Άσκησης Καλούνται οι ενδιαφερόμενοι/νες φοιτητές/τριες να δηλώσουν το ενδιαφέρον τους για Πρακτική Άσκηση για το Χειμερινό Εξάμηνο Ακ. Έτους 2025 – 2026 ... περισσότερα 22 07, 2025 Ανακοίνωση Προκήρυξης μιας (1) Θέσης ΔΕΠ στη βαθμίδα του Αναπληρωτή Καθηγητή για το Τμήμα Πληροφορικής της Σχολής Επιστημών και Τεχνολογίας της Πληροφορίας του Οικονομικού Πανεπιστημίου Αθηνών ... περισσότερα 23 06, 2025 Εκλογές για την ανάδειξη Προέδρου και Αντιπροέδρου Ανακήρυξη υποψήφιων για τη θέση του προέδρου και για τη θέση του αντιπροέδρου του τμήματος Πληροφορικής ... περισσότερα 09 06, 2025 Προκηρύξεις Προγραμμάτων Μεταπτυχιακών Σπουδών Προκηρύξεις των ΠΜΣ του Τμήματος Πληροφορικής για το Ακαδ. Έτος 2025-26 ... περισσότερα 29 05, 2025 Προκήρυξη Εκλογών Για την ανάδειξη εκπροσώπων των μελών Εργαστηριακού Διδακτικού Προσωπικού (Ε.ΔΙ.Π.) στην Κοσμητεία της Σχολής Επιστημών και Τεχνολογίας της Πληροφορίας του ΟΠΑ ... περισσότερα 28 05, 2025 Προκήρυξη Υποψηφίων Μεταδιδακτόρων τέσσερεις (4) θέσεων υποψήφιων μεταδιδακτόρων με καταληκτική ημερομηνία αιτήσεων την Δευτέρα 16 Ιουνίου 2025 ... περισσότερα Αρχείο ανακοινώσεων Νέα από τον κόσμο της Έρευνας Νέο Έργο Adaptive Video Delivery for Network Music Performance (AViD-NMP) στο MMLab Το έργο Adaptive Video Delivery for Network Music Performance (AViD-NMP) με επιστημονικό υπεύθυνο τον Καθηγητή Γιώργο Ξυλωμένο θα μελετήσει τη δικτυακή μουσική εκτέλεση (NMP) πάνω από δίκτυα 5G/6G, αξιοποιώντας τους πόρους (δίκτυο 5G και MEC) που παρέχονται από τις ερευνητικές υποδομές του έργου 6G-XR για την ανταλλαγή δεδομένων ήχου, βίντεο και ογκομετρικών δεδομένων, έτσι ώστε να ενσωματώσει τεχνολογίες XR στη δικτυακή μουσική εκτέλεση. ... περισσότερα Νέο Έργο: SeEDS Το έργο Secure and Efficient Data Spaces (SeEDS) με επιστημονικό υπεύθυνο τον Καθηγητή Γιώργο Ξυλωμένο θα υλοποιήσει ένα Data Space σύμφωνο με τα πρότυπα της ETSI πάνω από την αρχιτεκτονική NDN. To SeEDS θα εκμεταλλευτεί τις προχωρημένες δυνατότητες της αρχιτεκτονικής NDN στον τομέα της διανομής πληροφορίας, υλοποιώντας ευέλικτες και αποδοτικές τεχνικές ανακάλυψης και διαχείρισης δεδομένων, ειδοποιήσεις όταν εμφανίζονται συγκεκριμένα δεδομένα, καθώς και αναζητήσεις δεδομένων με βάση χρονικούς περιορισμούς. ... περισσότερα Νέο Έργο: TENeMP Το έργο Telepresence-Enhanced Network Music Performance (TENeMP) με επιστημονικό υπεύθυνο τον Καθηγητή Γιώργο Ξυλωμένο θα χρησιμοποιήσει την υποδομή του έργου SPIRIT για να πειραματιστεί με εφαρμογές Δικτυακής Μουσικής Εκτέλεσης (NMP) σε δίκτυα 5ης Γενιάς (5G), παρέχοντας ήχο και εικόνα με τεχνολογίες απομακρυσμένης παρουσίας (telepresence), όπως η επικοινωνία μέσω τρισδιάστατων ολογραμμάτων ή ρεαλιστικών αναπαραστάσεων των χρηστών (avatars). ... περισσότερα InterConnect project Σε μια πρωτοποριακή συνεργασία, το InterConnect συγκέντρωσε 50 φορείς από όλη την Ευρώπη για να αναπτύξει καινοτόμες λύσεις που γεφυρώνουν το χάσμα μεταξύ κατοικιών, κτιρίων και του τομέα της ηλεκτρικής ενέργειας. Το έργο, που καλύπτει 11 χώρες με συνεισφορές τόσο από τον δημόσιο όσο και από τον ιδιωτικό τομέα, θέτει τα θεμέλια για το μέλλον των έξυπνων λύσεων διαχείρισης ενέργειας. ... περισσότερα Secure Named Data Sharing (SNDS) Το έργο SNDS επιδιώκει να φέρει επανάσταση στην πληροφοριοκεντρική αρχιτεκτονική NDN, εισάγοντας επεκτάσεις προσαρμοσμένες για ανάκτηση περιεχομένου βάσει ερωτημάτων, λειτουργίες αποθήκευσης και ενημερώσεις περιεχομένου. ... περισσότερα LeadingEdge project O στόχος του LeadingEdge ήταν η ανάπτυξη νέων μαθηματικών βάσεων, αλγοριθμικών τεχνικών και αρχιτεκτονικών δικτύου για την υλοποίηση του οράματος της μηχανικής μάθησης (ML) στο άκρο του δικτύου (edge ML). Η βελτιστοποίηση της μηχανικής μάθησης στο άκρο έχει ταυτοποιηθεί ως το κύριο ορόσημο για την επίτευξη βελτιστοποιημένων και ουσιαστικά αποδοτικών υπηρεσιών υπολογιστών στο άκρο. ... περισσότερα NUDGE project Βασικός στόχος του έργου είναι να διερευνήσει πώς ήπιες παρεμβάσεις χωρίς τη χρήση οικονομικών κινήτρων, τα αποκαλούμενα nudges, μπορούν να προκαλέσουν την αλλαγή της συμπεριφοράς των νοικοκυριών ως προς την κατανάλωση ενέργειας. Συνδυάζοντας τα οριζόντια μέτρα με τις πιο στοχευμένες παρεμβάσεις, που αξιολογούνται στο έργο NUDGE με πιλοτικές δοκιμές, μπορεί να δημιουργηθεί ένα ισορροπημένο μείγμα πολιτικών, το οποίο, τελικά, να συμβάλει επιτυχώς στη μείωση της χρήσης ενέργειας για οικιακή θέρμανση. ... περισσότερα Project LEMONADE Το αντικείμενο του έργου είναι τα ασύρματα κινητά δίκτυα με ανοχή στις καθυστερήσεις (Delay-Tolerant Networks, DTNs). Σε αυτά τα δίκτυα, οι πληροφορίες ταξιδεύουν προς τον προορισμό τους μέσω ασύρματων μεταδόσεων αλλά και της φυσικής τους μεταφοράς ενόσω βρίσκονται στους ενταμιευτήρες των κόμβων. ... περισσότερα SMOTANET project Ο στόχος του έργου ήταν είναι ο σχεδιασμός ενός αρθρωτού, προσαρμοστικού και ασφαλούς ασύρματου αδόμητου (ad hoc) τηλεπικοινωνιακού δικτύου. Για να επιτευχθεί αυτό, το έργο SMOTANET (1) σχεδίασε τακτικές συσκευές που ενσωματώνουν τρεις διαφορετικές τεχνολογίες, συγκεκριμένα, το Software Defined Radio (SDR), τα Mobile Ad-hoc Networks (MANET) και τα Software Defined Networks (SDN) και (2) ανέπτυξε πλατφόρμες δοκιμών βασισμένες στις προαναφερθείσες συσκευές, οι οποίες θα χρησιμοποιηθούν για τη δοκιμή και αξιολόγηση των αντίστοιχων τεχνικών λύσεων σύμφωνα με καλά καθορισμένες μετρικές. ... περισσότερα Αρχείο νέων από τον κόσμο της έρευνας Σημαντικές Διακρίσεις ACM SIGecom Test of Time Award 2025 Η εργασία του κ. Ευάγγελου Μαρκάκη, Καθηγητή του τμήματος Πληροφορικής του ΟΠΑ, σε συνεργασία  με τους Richard Lipton, Elchanan Mossel, Amin Saberi, με τίτλο \"On Approximately Fair Allocations of Indivisible Goods\", η οποία είχε δημοσιευθεί στο συνέδριο ACM EC 2004, επιλέχθηκε για το βραβείο Test of Time Award του έτους 2025 από την ACM (ACM SIGecom: Special Interest Group on Economics and Computation). ... περισσότερα Best Paper Runner Up «Revisiting Silhouette Aggregation» Το άρθρο «Revisiting Silhouette Aggregation», το οποίο παρουσιάστηκε από τον Επίκουρο Καθηγητή του Ο.Π.Α. Γιάννη Παυλόπουλο στο συνέδριο Discovery Science 2024 στη Πίζα, αναγνωρίστηκε ως Best Paper. ... περισσότερα Best Paper Award \"Best Paper Award\" στο συνέδριο GECON 2022 για το άρθρο \"A Business Model for Multi-Tiered Decentralized Software Frameworks: The Case of ONTOCHAIN\", by Thanasis Papaioannou and George Stamoulis. ... περισσότερα Ψηλά στην κατάταξη CSRankings το Τμήμα μας Στην κατάταξη CSRankings με βάση την τελευταία 10ετία το ΟΠΑ εμφανίζεται 78ο στην Ευρώπη στον τομέα του Computer Science και πρώτο στην Ελλάδα (μαζί με το ΕΜΠ). ... περισσότερα Χορηγία από την EPIC Games Inc. Η ομάδα γραφικών υπολογιστών του Τμήματος Πληροφορικής ΟΠΑ (graphics.cs.aueb.gr) με επικεφαλής τον καθ. Γ. Παπαϊωάννου έλαβε χορηγία από την εταιρία EPIC Games Inc. (Unreal Engine, Fortnite, κλπ.) για τη συμβολή της σε τεχνολογίες παρακολούθησης ακτινών (ray tracing) για το διαδίκτυο. ... περισσότερα Best demo paper award H δημοσίευση με τίτλο INforE: Interactive Cross-platform Analytics for Everyone, έλαβε το βραβείο του best demo paper award στο διεθνές συνέδριο Conference on Information and Knowledge Management (CIKM2020) ... περισσότερα Αρχείο σημαντικών διακρίσεων Είπαν για εμάς Ονομάζομαι Παναγιώτης Παπαδόπουλος και είμαι απόφοιτος του τμήματος Πληροφορική του ΟΠΑ. Είμαι εταίρος στο επενδυτικό κεφάλαιο Marathon Venture Capital υποστηρίζοντας ελληνικές startups στα πρώτα τους βήματα. Προηγουμένως εργάστηκα στη Silicon Valley και συγκεκριμένα στην εταιρία Splunk, αφότου αυτή εξαγόρασε την τελευταία εταιρία που ίδρυσα με την ονομασία Bugsense και η οποία ειδικευόταν στην παροχή application performance managements για smartphone εφαρμογές. Οι σπουδές στο Τμήμα Πληροφορικής του ΟΠΑ υπήρξαν καταλυτικές για την καριέρα μου, καθώς με εφοδίσιαν με τις απαραίτητες γνώσεις σε πολλά πεδία. Ακόμα πιο σημαντική συνεισφορά ήταν η παρακολούθηση μαθημάτων από καταξιωμένους καθηγητές με πορεία στις ΗΠΑ οι οποίοι μας προετοίμαζαν για τον επαγγελματικό στίβο: παρέχοντας υψηλή κατάρτιση, μας κατεύθυναν στο να αναπτύξουμε ικανότητες στην επικοινωνία και την ομαδικότητα. Τέλος τίποτα από τα παραπάνω δε θα ήταν δυνατό χωρίς τους συμφοιτητές μου, οι οποίοι ήταν εξαιρετικοί επιστήμονες και μεθοδικοί φοιτητές. Παναγ",
  "content_length": 17761,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:06"
}