{
  "name": "Nikos Vasilakis",
  "homepage": "https://nikos.vasilak.is",
  "status": "success",
  "content": "Nikos Vasilakis | About I am an Assistant Professor of Computer Science at Brown University, affiliated also with the Brown Data Science Institute. I am also an Affiliated Researcher under Athena's new Archimedes Research Unit on AI and Data Science. My research interests include software systems, programming languages, and computer security—often building new systems or enhancing existing ones with capabilities such as parallelism, distribution, isolation, and security. This enhancement forms a transition path towards secure distributed environments targeting multiple scales. E-mail: nikos@vasilak.is   | Office: CIT 555 — 115 Waterman St., Providence, RI 02912   | ATLAS group Recent News Sep'25: Early ideas on LLM guardrails, hybrid scheduling, and verifiable kernel extensions at SOSP'25 workshops! Aug'25: Two papers accepted at NSDI'26 on opaque distributed optimization prediction and fault tolerance! Jul'25: Our benchmark suite for the shell received the Best Paper Award at USENIX ATC'25! Jul'25: Received a Google ML-and-Systems Junior Faculty Award on Securing Open-Source Software! Jun'25: Our paper on the Koala benchmarks for the shell was accepted at Usenix ATC'25—the last one, ever! Apr'25: Apply to attend the Brown Systems Week 2025 in beautiful Providence, RI! Mar'25: Our paper on semantics-driven static analysis for the shell made it to HotOS'25! Mar'25: Our group received an Amazon Research Award (ARA) on Automated Reasoning for the Unix/Linux shell! More news. Current Courses/Seminars Fall'25: CS1952/2952R: Systems Transforming Systems (new: COEX+WRIT) Spring'25: CS1380/1385/2380: Distributed Computing Systems Full list of courses I've taught. Current Students & Postdocs Full list of current and past students and postdocs. Current Research I enjoy work that is highly collaborative, serves everyday developers, and has real-world impact! Automating Protections Against Software Supply-Chain Threats: Modern software incorporates thousands of dependencies as a means of accelerating its development and reducing its cost—at a significant risk to safety and security for both developers and end-users. We have built a series of systems targeting the JavaScript dependency ecosystem—the largest such ecosystem out there—automating the analysis, transformation, and synthesis of JavaScript dependencies across a variety of threat models. Automating the Acceleration and Scale-out of Software Systems: Some programming environments, such as the shell, are used pervasively partly due to their simplicity in combining components (commands) written in multiple languages. Unfortunately, this language-agnostic composition hinders automated parallelization and distribution, often forcing developers to manually rewrite shell programs (and their components) in other languages that support these features. We have a series of systems, including PaSh, and several extensions and sibling projects that offer automated acceleration and scale-out in these environments—along with serious correctness and compatibility guarantees. Automated Transformation Towards Secure Scalable Computing Paradigms: Recent trends are pushing developers towards new paradigms of secure and scalable computing—e.g., confidential computing, microservices, serverless computing, and edge computing. Transforming a conventional program to leverage these paradigms is a laborious manual process that can lead to suboptimal performance and in many cases even break the program. We are developing systems supporting this kind of decomposition and leveraging special hardware capabilities when these are available in the network. More info on ATLAS web. Some Recent Publications The Koala Benchmarks for the Shell: Characterization and Implications Evangelos Lamprou, Ethan Williams, Georgios Kaoukis, Zhuoxuan Zhang, Michael Greenberg, Konstantinos Kallas, Lukas Lazarek, Nikos Vasilakis. 2025 USENIX Annual Technical Conference (ATC'25) Received Best Paper Award. USENIX | PDF | website | GitHub From Ahead-of- to Just-in-Time and Back Again: Static Analysis for Unix Shell Programs Lukas Lazarek, Seong-Heon Jung, Evangelos Lamprou, Zekai Li, Anirudh Narsipur, Eric Zhao, Michael Greenberg, Konstantinos Kallas, Konstantinos Mamouras, Nikos Vasilakis. 20th ACM Workshop on Hot Topics in Operating Systems (HotOS XX) ACM DL | PDF BinWrap: Hybrid Protection Against Native Node.js Add-ons George Christou, Grigoris Ntousakis, Eric Lahtinen, Sotiris Ioannidis, Vasileios P. Kemerlis, and Nikos Vasilakis. ACM ASIA Conference on Computer and Communications Security (ASIA CCS'23), Received Distinguished Paper Award. ACM DL | PDF | code Full list of publications.",
  "content_length": 4667,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:12"
}