{
  "name": "Nikos Tzevelekos",
  "homepage": "https://www.tzevelekos.org",
  "status": "success",
  "content": "Nikos TzevelekosSearch this siteEmbedded FilesSkip to main contentSkip to navigationI am a Senior Lecturer at the School of Electronic Engineering and Computer Science at Queen Mary University of London, and member of the Theory Group. Previously, I was a postdoctoral researcher at the Department of Computer Science at the University of Oxford, and member of the Quantum Group, where I also completed my PhD thesis.My focus is on Theoretical Computer Science and in particular I study the mathematical meaning of computation. I devise mathematical models of programming languages, expressed in game semantics at the concrete level and in category theory at the abstract level. I examine applications of these models to program analysis in order to develop methods and tools for formally analysing and checking software.I can be reached at:  nikos.tzevelekos at qmul.ac.uk School of Electronic Engineering and Computer Science Queen Mary University of London, London E1 4NS, UK Events:LICS 2025 (pc), Logical Methods in Computer Science (paper), World Logic Day (slides on website), Automata in the Wild 2025POPL 2024 (pc), FOSSACS 2024 (pc), CFV seminar (slides), GSSI seminar (slides), LICS 2024 (paper), SEFM 2024 (paper)LICS 2023 (distinguished paper), JSA paperNew Challenges in PL Semantics (organiser), SETTA 2022 (paper), TACAS 2022 (paper), PERR 2022 (pc), PLS 13 (pc)FOSSACS 2021 (pc), ICFP 2021 (paper)FSCD 2020 (paper), PERR 2020 (pc)PERR 2019, PLS12, ESSLLI 2019, ATVA 2019, SETTA 2019Dagstuhl seminar on Program Equivalence, Highlights 2018, MOVEP 2018, MFGR 2018OPCT 2017, LOLA 2017, ESSLLI 2017, Highlights 2017FOSSACS 2016, Program Equivalence, Automata, Logic and Games @IMS, Compositionality @SimonsSR 2015, CONCUR 2015, ESSLLI 2015, LOLA 2015, MFPS31, PLS10, GALOP XETAPS 2015, Semantics and Verification of Object-Oriented Languages @ShonanGALOP VIII, LOLA 2013, Wessex 17, GALOP 2011, Oxford LINTQueen Mary Theory seminarsGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2018,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:11"
}