{
  "name": "Nikola Banovic 0001",
  "homepage": "http://www.nikolabanovic.net",
  "status": "success",
  "content": "Nikola Banovic About Announcements Advising Teaching Publications Nikola Banovic Associate Professor Computer Science & Engineering University of Michigan, Ann Arbor Associate Director Michigan Institute for Data & AI for Society University of Michigan, Ann Arbor BBB 3632 2260 Hayward Street Ann Arbor, MI 48109, USA Email: nbanovic@umich.edu Curriculum Vitae (CV) Google Scholar ORCID dblp About Me My research is in the field of HCI with a broad focus on Human-AI Interaction, Explainable AI, and Responsible AI. I specialize in the design and evaluation of AI explanation mechanisms that can help develop or improve AI literacy of end-users who lack computer science backgrounds. This could help such end-users critically reflect on strengths and limitations of AI-based systems, and help them decide when and how to use such computational technology. My work has been recognized with an NSF CAREER award, and best paper and honorable mention awards at premier HCI conferences. Before joining the Computer Science & Engineering department at the University of Michigan as a faculty, I received my Ph.D. degree from the Human-Computer Interaction Institute (HCII) at Carnegie Mellon University, and my B.Sc. and M.Sc. degrees from the Department of Computer Science at the University of Toronto. For more information, see my Curriculum Vitae (CV). Announcements Students, I will never email you to offer you research employment if you did not apply for or inquire about a research position with me or the department first. Any such emails are likely Job Offer Scam. Advising Current Doctoral Students Snehal Prabhudesai Tsedeniya Amare Jaewoong Choi Ishika Joshi Graduated Doctoral Students Nel Escher Sumit Asthana Anindya Das Antar Divya Ramesh Past Postdoctoral Fellows Somayeh Molaei Past Masters Students Anmol Mansingh Daniel Chechelnitsky Xincheng Huang Zhuoran \"Jim\" Yang Yujian Liu Aditya Ramesh Suraj Kiran Raman Past Undergraduate Students Ananya Kasi Matthew Conrad Trisha Dani Tess Eschebach Ruiyi Wang Rui Nie Tavanya Seth Zhe Chen Caitlin Henning Yuan Xu Sabrina Tobar Thommel Antara Gandhi Yucen Sun Enhao Zhang Nan Liu Elise Minto Zhipeng Yan Kevin Pu Alvin Hermans Joshua Spalter Ponette Rubio Keylonnie Miller Alice Liu Renee Li Sam Mikell Past Graduate Visiting Scholars Tahera Hossain Past Undergraduate Visiting Scholars Sitara Baxendale Bruktawit Amare Daniel Ramirez Shareni Ortega Shruti Srinidhi Teaching (Active Courses) CSE 593 - Human-Computer Interaction Latest Course Website Principles (e.g., human-centered systems design, usability, accessibility) and methods (e.g., requirements gathering, functional prototyping, user study evaluation) of technical Human-Computer Interaction (HCI) research. Survey of HCI research threads including Human-AI Interaction, Social Computing, Behavior Modeling, Education Technologies. Group assignments give students exposure to HCI research methods. Prerequisites: Graduate standing; or permission from instructor. EECS 493 - User Interface Development Latest Course Website Concepts and techniques for designing computer system user interfaces to be easy to learn and use, with an introduction to their implementation. Task analysis, design of functionality, display and interaction design, and usability evaluation. Interface programming using an object-oriented application framework. Fluency in a standard object-oriented programming language is assumed. Prerequisites: EECS 281 or graduate standing in CSE. Minimum grade of “C” required for enforced prerequisite. Publications This list is automatically generated from ORCID. For a complete list of publications organized by category, please see my Curriculum Vitae (CV). 1.Somayeh Molaei, Lionel Peter Robert, and Nikola Banovic. 2025. What Do People Want to Know about Artificial Intelligence (AI)? The Importance of Answering End-user Questions to Explain Autonomous Vehicle (AV) Decisions. Proceedings of the ACM on Human-Computer Interaction 9, 7: 1-32. https://doi.org/10.1145/3757437 2.Tess Eschebach, Nikola Banovic, and Allison McDonald. 2025. Playing \"Google’s Game\": How Educational YouTubers Manage Tensions Between Education and Monetization. Proceedings of the ACM on Human-Computer Interaction 9, 7: 1-33. https://doi.org/10.1145/3757496 3.Anindya Das Antar, Xun Huan, and Nikola Banovic. 2025. \"Do Your Guardrails Even Guard?’’ Method for Evaluating Effectiveness of Moderation Guardrails in Aligning LLM Outputs with Expert User Expectations. Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society 8, 1: 705-718. https://doi.org/10.1609/aies.v8i1.36583 4.Snehal Prabhudesai, Ananya Prashant Kasi, Anmol Mansingh, Anindya Das Antar, Hua Shen, and Nikola Banovic. 2025. \"Here the GPT made a choice, and every choice can be biased\": How Students Critically Engage with LLMs through End-User Auditing Activity. In Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems, 1-23. https://doi.org/10.1145/3706598.3713714 5.Anindya Das Antar, Somayeh Molaei, Yan-Ying Chen, Matthew L Lee, and Nikola Banovic. 2024. VIME: Visual Interactive Model Explorer for Identifying Capabilities and Limitations of Machine Learning Models for Sequential Decision-Making. In Proceedings of the 37th Annual ACM Symposium on User Interface Software and Technology, 1-21. https://doi.org/10.1145/3654777.3676323 6.Nel Escher and Nikola Banovic. 2024. Hexing Twitter: Channeling Ancient Magic to Bind Mechanisms of Extraction. In Extended Abstracts of the CHI Conference on Human Factors in Computing Systems, 1-6. https://doi.org/10.1145/3613905.3644071 7.Shane C. Quinonez, David A. Stewart, and Nikola Banovic. 2024. ChatGPT and Artificial Intelligence in Graduate Medical Education Program Applications. Journal of Graduate Medical Education 16, 4: 391-394. https://doi.org/10.4300/jgme-d-23-00823.1 8.Nel Escher, Jeffrey Bilik, Nikola Banovic, and Ben Green. 2024. Code-ifying the Law: How Disciplinary Divides Afflict the Development of Legal Software. Proceedings of the ACM on Human-Computer Interaction 8, CSCW2: 1-37. https://doi.org/10.1145/3686937 9.Patrick C. Kinnunen, Kenneth K. Y. Ho, Siddhartha Srivastava, Chengyang Huang, Wanggang Shen, Krishna Garikipati, Gary D. Luker, Nikola Banovic, Xun Huan, Jennifer J. Linderman, and Kathryn E. Luker. 2024. Integrating inverse reinforcement learning into data-driven mechanistic computational models: a novel paradigm to decode cancer cell heterogeneity. Frontiers in Systems Biology 4. https://doi.org/10.3389/fsysb.2024.1333760 10.Sumit Asthana, Jane Im, Zhe Chen, and Nikola Banovic. 2024. \"I know even if you don’t tell me\": Understanding Users’ Privacy Preferences Regarding AI-based Inferences of Sensitive Information for Personalization. In Proceedings of the CHI Conference on Human Factors in Computing Systems, 1-21. https://doi.org/10.1145/3613904.3642180 11.Divya Ramesh, Caitlin Henning, Nel Escher, Haiyi Zhu, Min Kyung Lee, and Nikola Banovic. 2023. Ludification as a Lens for Algorithmic Management: A Case Study of Gig-Workers’ Experiences of Ambiguity in Instacart Work. In Proceedings of the 2023 ACM Designing Interactive Systems Conference, 638-651. https://doi.org/10.1145/3563657.3596004 12.Tahera Hossain, Wanggang Shen, Anindya Antar, Snehal Prabhudesai, Sozo Inoue, Xun Huan, and Nikola Banovic. 2023. A Bayesian Approach for Quantifying Data Scarcity when Modeling Human Behavior via Inverse Reinforcement Learning. ACM Transactions on Computer-Human Interaction 30, 1: 1-27. https://doi.org/10.1145/3551388 13.Anindya Das Antar, Anna Kratz, and Nikola Banovic. 2023. Behavior Modeling Approach for Forecasting Physical Functioning of People with Multiple Sclerosis. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 7, 1: 1-29. https://doi.org/10.1145/3580887 14.Nikola Banovic, Zhuoran Yang, Aditya Ramesh, and Alice Liu. 2023. Being Trustworthy is Not Enough: How Untrustworthy Artificial Intelligence (AI) Can Deceive the End-Users and Gain Their Trust. Proceedings of the ACM on Human-Computer Interaction 7, CSCW1: 1-17. https://doi.org/10.1145/3579460 15.Jane Im, Ruiyi Wang, Weikun Lyu, Nick Cook, Hana Habib, Lorrie Faith Cranor, Nikola Banovic, and Florian Schaub. 2023. Less is Not More: Improving Findability and Actionability of Privacy Controls for Online Behavioral Advertising. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems, 1-33. https://doi.org/10.1145/3544548.3580773 16.Snehal Prabhudesai, Jeremiah Hauth, Dingkun Guo, Arvind Rao, Nikola Banovic, and Xun Huan. 2023. Lowering the computational barrier: Partially Bayesian neural networks for transparency in medical imaging AI. Frontiers in Computer Science 5. https://doi.org/10.3389/fcomp.2023.1071174 17.Sarah Jabbour, David Fouhey, Stephanie Shepard, Thomas S. Valley, Ella A. Kazerooni, Nikola Banovic, Jenna Wiens, and Michael W. Sjoding. 2023. Measuring the Impact of AI in the Diagnosis of Hospitalized Patients. JAMA 330, 23: 2275. https://doi.org/10.1001/jama.2023.22295 18.Xincheng Huang, Keylonnie L. Miller, Alanson P. Sample, and Nikola Banovic. 2022. StructureSense. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 6, 4: 1-25. https://doi.org/10.1145/3570343 19.Snehal Prabhudesai, Leyao Yang, Sumit Asthana, Xun Huan, Q. Vera Liao, and Nikola Banovic. 2023. Understanding Uncertainty: How Lay Decision-makers Perceive and Interpret Uncertainty in Human-AI Decision Making. In Proceedings of the 28th International Conference on Intelligent User Interfaces, 379-396. https://doi.org/10.1145/3581641.3584033 20.Sumit Asthana, Sabrina Tobar Thommel, Aaron Lee Halfaker, and Nikola Banovic. 2021. Automatically Labeling Low Quality Content on Wikipedia By Leveraging Patterns in Editing Behaviors. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2: 1-23. https://doi.org/10.1145/3479503 21.Enhao Zhang and Nikola Banovic. 2021. Method for Exploring",
  "content_length": 16718,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:01"
}