{
  "name": "Nikolay I. Nikolaev",
  "homepage": "https://www.gold.ac.uk/computing/staff/n-nikolaev",
  "status": "success",
  "content": "Dr Nikolay Nikolaev | Goldsmiths, University of London Main menu Staff & students In this section Nikolay’s recent work is devoted to genetic programming of tree-structured polynomials. Staff details Position Lecturer Department Computing Email n.nikolaev (@gold.ac.uk) Website http://homepages.gold.ac.uk/nikolaev/ Full information in Nikolay's homepage Areas of supervision Evolutionary computation, genetic algorithms & genetic programming, neural networks, biocomputation, machine learning, applications to time-series prediction, financial engineering & data mining. Featured works Book chapters and conference papers Nikolaev,N., and Iba,H. (2002). Genetic Programming of Polynomial Models for Financial Forecasting. In: Shu-Heng Chen (Ed.), Genetic Algorithms and Genetic Programming in Computational Finance, Chapter 5, Kluwer Academic Publ., Boston, MA, pp.103-123. Nikolaev,N., de Menezes,L. and Iba, H. (2002). Overfitting Avoidance in Genetic Programming of Polynomials, In: Proc. 2002 Congress on Evolutionary Computation, CEC2002, IEEE Press, Piscataway, NJ, pp.1209-1214. Nikolaev,N. and Iba, H. (2001). Genetic Programming using Chebishev Polynomials, In: L.Spector, E.D.Goodman, A.Wu, W.B.Langdon, H.-M.Voigt, M.Gen, S.Sen, M.Dorigo, S.Pezeshk, M.H.Garzon, and E.Burke (Eds.), Proc. of the Genetic and Evolutionary Computation Conference, GECCO-2001, Morgan Kaufmann Publ., San Francisco, CA, pp.89-96. Publications and research outputs BookAdaptive Learning of Polynomial Networks: Genetic Programming, Backpropagation and Bayesian Methods Nikolaev, Nikolay ; and Iba, H.. 2006. Adaptive Learning of Polynomial Networks: Genetic Programming, Backpropagation and Bayesian Methods. Springer. ISBN 0387312390 Book SectionNonlinear filtering of asymmetric stochastic volatility models and Value-at-Risk estimation Nikolaev, Nikolay ; De Menezes, L. M.; and Smirnov, E.. 2014. Nonlinear filtering of asymmetric stochastic volatility models and Value-at-Risk estimation. In: R. J. Almeida; D. Maringer; V. Palade and A. Serguieva, eds. IEEE/IAFE Conference on Computational Intelligence for Financial Engineering, Proceedings (CIFEr). IEEE, pp. 310-317. ISBN 978-147992380-9 ArticleA Regime-Switching Recurrent Neural Network Model Applied to Wind Time Series Nikolaev, Nikolay ; Smirnov, Evgueni; Stamate, Daniel ; and Zimmer, Robert . 2019. A Regime-Switching Recurrent Neural Network Model Applied to Wind Time Series. Applied Soft Computing, 80, pp. 723-734. ISSN 1568-4946 Time-dependent series variance learning with recurrent mixture density networks Nikolaev, Nikolay ; Peter, Tino; and Evgueni, Smirnov. 2013. Time-dependent series variance learning with recurrent mixture density networks. Neurocomputing, 122, pp. 501-512. ISSN 0925-2312 Heavy-tailed mixture GARCH volatility modeling and Value-at-Risk estimation Nikolaev, Nikolay ; Boshnakov, Georgi N.; and Zimmer, Robert . 2013. Heavy-tailed mixture GARCH volatility modeling and Value-at-Risk estimation. Expert Systems with Applications, 40(6), pp. 2233-2243. ISSN 0957-4174 Show more information Time-Dependent Series Variance Estimation via Recurrent Neural Networks Nikolaev, Nikolay ; Tino, Peter; and Smirnov, Evgueni. 2011. Time-Dependent Series Variance Estimation via Recurrent Neural Networks. Artificial Neural Networks and Machine Learning – ICANN 2011, 6791(n/a), pp. 176-184. ISSN 0302-9743 Nonlinear maximum likelihood estimation of electricity spot prices using recurrent neural networks Mirikitani, Derrick; and Nikolaev, Nikolay . 2011. Nonlinear maximum likelihood estimation of electricity spot prices using recurrent neural networks. Neural Computing and Applications, 20(1), pp. 79-89. ISSN 0941-0643 Recursive Bayesian Recurrent Neural Networks for Time-Series Modeling Mirikitani, D. T.; and Nikolaev, Nikolay . 2010. Recursive Bayesian Recurrent Neural Networks for Time-Series Modeling. IEEE Transactions on Neural Networks, 21(2), pp. 262-274. ISSN 1045-9227 k-Version-Space Multi-class Classification Based on k-Consistency Tests Smirnov, Evgueni; Nalbantov, Georgi; and Nikolaev, Nikolay . 2010. k-Version-Space Multi-class Classification Based on k-Consistency Tests. European Conference on Machine Learning and Knowledge Discovery in Databases, 6323, pp. 277-292. ISSN 0302-9743 Single-Stacking Conformity Approach to Reliable Classification Smirnov, Evgueni; Nikolaev, Nikolay ; and Nalbantov, Georgi. 2010. Single-Stacking Conformity Approach to Reliable Classification. Artificial Intelligence: Methodology, Systems, and Applications, 6304, pp. 161-170. ISSN 0302-9743 Efficient online recurrent connectionist learning with the ensemble Kalman filter Mirikitani, Derrick T.; and Nikolaev, Nikolay . 2010. Efficient online recurrent connectionist learning with the ensemble Kalman filter. Neurocomputing, 73(4 - 6), pp. 1024-1030. ISSN 0925-2312 Sequential Bayesian Kernel Modelling with Non-Gaussian Noise Nikolaev, Nikolay ; and de Menezes, L. 2008. Sequential Bayesian Kernel Modelling with Non-Gaussian Noise. Neural Networks, 21(1), pp. 36-47. ISSN 0893-6080 Polynomial Harmonic GMDH Learning Networks for Time Series Modeling Nikolaev, Nikolay . 2003. Polynomial Harmonic GMDH Learning Networks for Time Series Modeling. Neural Networks, 16(10), pp. 1527-1540. ISSN 08936080 Learning polynomial feedforward neural networks by genetic programming and backpropagation Nikolaev, Nikolay . 2003. Learning polynomial feedforward neural networks by genetic programming and backpropagation. IEEE Transactions on Neural Networks, 14(2), pp. 337-350. ISSN 10459227 Genetic Programming of Polynomial Harmonic Networks using the Discrete Fourier Transform Nikolaev, Nikolay ; and Iba, Hitoshi. 2002. Genetic Programming of Polynomial Harmonic Networks using the Discrete Fourier Transform. International Journal of Neural Systems, 12(5), pp. 399-410. ISSN 0129-0657 Accelerated Genetic Programming of Polynomials Nikolaev, Nikolay ; and Iba, Hitoshi. 2001. Accelerated Genetic Programming of Polynomials. Genetic Programmimg and Evolvable Machines, 2(3), pp. 231-257. ISSN 1389-2576 Regularization Approach to Inductive Genetic Programming Nikolaev, Nikolay . 2001. Regularization Approach to Inductive Genetic Programming. IEEE Transactions on Evolutionary Computation, 5(4), pp. 359-375. ISSN 1089778X Conference or Workshop ItemStandard feedforward neural networks with backprop cannot support cognitive superposition Vanegdom, A. ; Nikolaev, Nikolay ; and Garagnani, M. ORCID logo . 2022. 'Standard feedforward neural networks with backprop cannot support cognitive superposition'. In: Bernstein Conference 2022. Berlin, Germany 13-16 September 2022. Research Interests Neural networks statistical learning networks, basis-function networks, constructive learning of the topology and initial weights of multilayer neural networks; financial engineering by basis-function neural networks; chaotic time-series prediction by statistical networks. Genetic Algorithms Structured genetic algorithms with cooperative subpopulations flowing on fitness sublandscapes; Fourier expansions of fitness landscapes over regular graphs, messy genetic algorithms for applied economic regression tasks. Inductive Genetic Programming (iGP): Evolutionary induction of multivariate high-order polynomials, genetic programming of statistical learning networks, genetic programming of polynomial discriminant classifiers, regularization in iGP, finite-state automata induction by iGP. Data mining A utomated discovery of polynomials from data with numerical and continuous features; sequential forward and backward feature selection for construction of multi-layer neural networks. Machine Learning Decision tree classifiers, stochastic complexity (Minimum Description Length-MDL) measures for decision tree learners, multivariate splitting methods for non-linear decision trees; linear and oblique decision trees, distance-based decision trees. Current research My recent work is devoted to genetic programming of tree-structured polynomials, known as statistical learning networks of the GMDH type. This includes design of stochastic complexity (Minimum Description Length-MDL) and statistical fitness functions for efficient search navigation. These functions are elaborated using ideas from the regularization theory aiming at evolution of parsimonious, accurate and predictive polynomials.",
  "content_length": 8381,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:10"
}