{
  "name": "Nilanjan Banerjee",
  "homepage": "http://www.csee.umbc.edu/~nilanb",
  "status": "success",
  "content": "Nilanjan Banerjee | UMBC Toggle navigation Nilanjan Banerjee Home ECLIPSE CLUSTER Publications Courses Research Lab Videos/Press Service Sponsors Nilanjan Banerjee Professor Associate Director for Cybersecurity for Manufacturing Initiatives NSF Career Awardee MSR SEIF Awardee UMBC Up and Coming Inventor email: nilanb AT umbc.edu Resume Lab Updates on Facebook! New Hope for People Living with Paralysis Eclipse researchers with UMB research (Dr. Sandy McCombe-Waller) were recently featured in a video developed by Microsoft Research. The video showcases Banerjee, Robucci, and UMB professor Sandra McCombe Waller, as they discuss the application of Microsoft’s Lab of Things to the team’s wearable sensing system project. Read more. Low-cost Distracted Driving Detection My group has developed a novel proximity sensor-based system that analyzes driver movements and infers whether he/she is distracted or driving dangerously. The key novelity of our approach is that our sensors are built into head-gears, dashboards, and door mats inside vehicles and can non-intrusively detect dangerous and distracted driving using our novel signal processing algorithm. Our goal is to build these sensors into fleet vehicles. Read more. NSF and TEDCO Grant Awarded Professors Nilanjan Banerjee, Ryan Robucci, and Chintan Patel have been awarded a $650,000 NSF grant from the NSF-NIH Smart and Connected Health program and a $150,000 TEDCO grant on wearable computing. Read more. Micro-doppler Radar System for Tongue Gesture Recognition Eclipse researchers have developed a micro-doppler radar array system that can detect subtle cheek and tongue gestures. The wireless system can be used for environmental control for individuals with severe paralysis. Read more. Previous Next Nilanjan Banerjee is a Professor at University of Maryland, Baltimore County. He is also an Associate Director of Cybersecurity in Manufacturing at UMBC. He is an expert in mobile and sensor systems with focus on designing end-to-end cyber-physical systems with applications to physical rehabilitation, physiological monitoring, and home energy management systems. He is also an expert in cybersecurity for embedded and cyber-physical systems. Presently his research focuses on two broard areas: (1) Wearable Sensing and Analytics for Physiological Sensing; and (2) Cybersecurity for Manufacturing and Supply Chain Management. His research is funded by the National Science Foundation, National Insitutes of Health, Office of Naval Research, Army Research Lab, Microsoft, Department of Defense, and the Technology Development Corporation. He has published more than 60 peer-reviewed conference and journal articles in top conferences including MobiSys, IPSN, Mobicom, Ubicomp, RTSS, Sensors, IEEE Transactions on Networking, IEEE Transactions on Multi-scale Computing, and IEEE Sensors. He is a National Science Foundation CAREER awardee and has received a Microsoft Research Software Engineering Innovations Award, UMBC Up and Coming Inventor, a UMBC Innovation Collaborative, a UMBC Mid-Career Excellence Awardee, a Yahoo! Outstanding Dissertation Award, and a Best Undergraduate Thesis award. He is interested in commercializing his reseach products. He is the co-founder and CEO of Tanzen Medical, Inc. and he is the CSO of LifePlus, Inc. His research and commercialization effort has been highlited in several news outlets including the Baltimore Sun, the Washington Post, and the MIT technology review. He holds a Ph.D. and a M.S. in Computer Science from the University of Massachusetts Amherst and a BTech. (Hons.) from Indian Institute of Technology, Kharagpur. Recent News Research Paper News ACM E-Energy ACM E-Energy 2019 Thermal modeling paper accepted to ACM E-Energy 2019. NGRoup NGRoup 2019 Communication Structure Paper accepted to NGRoup 2019. Psychosomatic Psychosomatic Medicine 2018 Modeling ANS and prediction of inter-beat interval papers accepted to Psychosomatic Medicine 2018. ACC ACC 2018 Cross-layer security paper accepted to ACC 2018. ACC ACC 2018 Cross-layer security paper accepted to IEEE ISCAS 2018. IEEE ISCAS IEEE ISCAS 2018 Structural Synchrony Paper accepted to IEEE ISCAS 2018. ACM BuildSys ACM BuidSys 2017 Longitudinal Energy Waste paper accepted to ACM BuildSys 2017. VTS VTS 2017 FISCAL paper accepted VTS 2017. IEEE Sensors August 2016 Wearable radar breathing detection paper accepted to IEEE Sensors. IEEE Sensors August 2016 Wearable radar breathing detection paper accepted to IEEE Sensors. IEEE Sensors August 2016 Wearable radar breathing detection paper accepted to IEEE Sensors. IEEE Sensors Journal February 2016 Differential Capacitance paper accepted to IEEE Sensors Journal. Infocom 2016 Novemeber 2015 RAM paper accepted to IEEE Infocom 2016. IEEE Transactions in Multi-Scale Computing Systems October 2015 Advanced Gesture Recognition paper accepted to IEEE Transactions on Multi-scale computing systems. IEEE Sensors Journal September 2015 Distracted Driving paper accepted to IEEE Sensors Journal. Euroviz March 2015 Energy Visualization paper accepted to EuroVis 2015. Host Feb 2015 \"Post Fabrication\" paper on Security Vulnerabilities in IEEE Host 2015 IPSN Jan 2015 SunaPlayer paper on emulation of solar cells in ACM/IEEE IPSN 2015 IPSN Jan 2015 Tongue-n-Cheek paper on tongue gesture recongition in paralysis patients in ACM/IEEE IPSN 2015 Research Funding News ARO March 2019 Building forecasting models for human-agent Teaming ($150,000) NSF July 2018 SBIR: In-home Monitoring of Sleep Fragmentation and Micro-Arousals by Characterizing Leg Movements ($225,000) MITRE October 2018 Inferring Cyber-Attacks and Building Resilient Cyber-physical Systems ($200,000) ONR June 2018 Autonomic Resilient Cyber-Physical Systems ($195,000) ONR April 2015 Anomaly Detection in Cyber-physical Systems: Resilience by Degree of Awareness ($173,360) GE October 2018 Cyber-physical System Security ($185,000) ARL/DoD October 2018 Online, Adaptive Artifact Identification for Realworld NeuroImaging: Algorithms and Hardware ($399,628) ARL/DoD October 2017 Advanced Computational Approaches to Understand Individual and Team State Changes Over Time ($244,000) GE December 2016 Study Security in Cyber-physical Systems ($65,000). DCS August 2016 Study Human Adaptations ($240,000). NSF April 2016 NSF Grant ($200,000). TEDCO March 2016 TEDCO Grant ($150,000). Hrabowski Innovation Fund December 2015 Hrabowski Innovation Fund ($24,000). Constellation Inc. November 2015 E2 Energy to Educate Grant ($25,000). NIH November 2015 NIH Grant for Pediatric Asthma Detection ($2,000,000). NSF September 2015 NSF Grant on Utility-driven Energy Management Services. ($1,000,000). NSF September 2015 NSF Grant on Energy Assessment System. ($500,000). ONR April 2015 ONR Grant on Anomaly Detection in Cyber-physical Systems. ($300,000). TEDCO Jan 2015 TEDCO Grant on developing a Sleep Monitoring System with Johns Hopkins University ($150,000). TEDCO September 2014 TEDCO Grant on developing Textile capacitive sensor system. NSF September 2014 NSF-NIH grant on developing assistive care systems for severly paralyzed patients. Microsoft February 2013 Microsoft Research Software Engineering Innovations Award. NSF, Unity Education, Microsoft Earlier than 2013 Several Awards including NSF CAREER, NSF CSR Awards (2012, 2013), Gift from Unity Education. Award and Media News Blavatnik Blavatnik 2016 University nominee for the Blavatnik Award Baltimore Sun September 2016 News article mentioning our textile sensor project [article] HOST April 2016 HOST Demo on Hardware Security wins third prize MIT Technology Review April 2016 News article mentioning our textile sensor project [article] Baltimore Sun and Washington Post March 2016 News article on our commercialization effort [article] Hrabowski Innovation Fund November 2015 Awarded the UMBC Innovation Collaborative. Inventor's Lunch November 2015 Awarded the UMBC Up and coming Inventor. PerCom15 March 2015 InviZ Demo wins Best Demo Award (Runner-up) at IEEE PerCom 2015. NSF March 2014 Jackson Schmandt and Alexander Nelson received the NSF SFS Fellowship and NSF Graduate Fellowship, Honorable Mention. Microsoft June 2013 Microsoft Research Software Engineering Innovations Award, 2013 NSF Feb 2011 National Science Foundation Early CAREER Award. Research Projects Understanding Individual Human and Team Performance in Human and Human-AI Teams Funded by the Army Research Laboratory. Description Coming Soon... Sleep Analytics by Analyzing Leg Movements During Sleep Description Coming Soon. Embedded Hardware Security We study power-supply sidechannel leakage on FPGAs and ASICs through hardware experimentaion and simulation. Our goal is discovery of new side-channel volnerabilites along with techniques and EDA tools for coutermeasures in embedded systems. We are espcially focused on security for low-power embedded systems. HOST 2015 VTS 2015 LATS 2015 Home and Building Energy Management Our goal is to make it easier for home residents to make smart choices about managing energy. Renewable technologies, such as solar and wind, are becoming more widely adopted, however, current best practices for energy use and conservation do not necessarily apply in green homes. This project seeks to better understand energy generation and consumption in green homes, and to explore automated techniques for helping residents to achieve better utilization of resources. This includes building demand response systems, energy analytics for home energy usage, and visualization systems for home energy usage. Project website PerEnergy2015 PMC 2014 IGCC2014 CHIEA2014 PerCom2014 BuildSys2013 Wearable Assistive Devices An estimated 1.5 million individuals in the United States are hospitalized each year because of strokes, brain injuries and spinal cord injuries. Severe impairment such as paralysis, paresis, weakness and limited range of motion are common sequels resulting from these injuries, requiring extensive rehabilitation. T",
  "content_length": 12463,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:15"
}