{
  "name": "Niladri Chatterjee",
  "homepage": "https://web.iitd.ac.in/~niladri",
  "status": "success",
  "content": "Niladri Chatterjee Dr. Niladri Chatterjee Soumitra Dutta Chair Professor of Artificial Intelligence Prof. (HAG) Department of Mathematics, School of IT, School of AI IIT Delhi, INDIA Dr. Niladri Chatterjee is a Professor of Computer Science & Statistics in the Department of Mathematics, IIT Delhi. His primary research areas are Artificial Intelligence, Natural Language Processing, Machine Learning, Data Science, Statistical Modeling, Mathematical Reasoning, Rough Sets. His association with IIT Delhi is of 22 years. Before that, he had worked as a Lecturer in the Dept. of Computer science, University of London, and a Computer Engineer (Software) at Indian Statistical Institute, Calcutta. In between he has been a Visiting Professor in Dipartimento di Informatica Department of Informatics) University of Pisa, Italy. He possesses B.Stat and M.Stat degrees from Indian Statistical Institute, Calcutta. He also did his M.Tech in Computer science from the same institute and Ph.D. in Computer Science from the University of London. He has written more than 100 papers in international and national journals and conferences. He received the \"Best Paper\" award in CICLING-conference, Haifa, Israel; and also received the “ Best Paper” award and the Raizada memorial shield by Computer Society of India. He is also the recipient of UNDP scholarship for month-long training in INRIA France. He is also the recipient of Commonwealth Scholarship of the British Council. He is a member of the National Standardization Committee for Artificial Intelligence, Bureau of India Standards Gov. Of India. He is also a research committee chair of the school of Information technology at IIT Delhi. He is also a member of the core committee of Forthcoming Centre of excellence AI and ML, IIT Delhi. He has supervised 10 Ph.D. thesis and more than 100 Master thesis. Currently, seven students are working for their PhDs under his supervision. He is a regular reviewer of Computer Speech and Language (Elsevier), TALLIP (ACM) Springer, Pattern Recognition Letters, Defence Science Journal among others. He is currently the PI of several Govt. And industrial projects. Specialization and research interests: Artificial Intelligence Natural Language Processing Fuzzy and Rough Sets Machine Learning Statistical Modeling Publications Journals Aayush Singha Roy and Niladri Chatterjee. Forecasting of Indian stock market using Rough Set and Fuzzy-Rough Set based Models. IETE Technical Review. Taylor and Francis. Impact Factor 2.175. [link] Kartikay Gupta and Niladri Chatterjee. Stocks Recommendation from Large Datasets using Important Company and Economic Indicators. Asia-Pacific Financial Markets, Springer. [link] Alok Nikhil Jha, Niladri Chatterjee, Geetam Tiwari. A Performance Analysis of Prediction Techniques for Impacting Vehicles in Hit-and-Run Road Accidents. Accident Analysis and Prevention, Elsevier, Vol. 157, 106164, 2021 Impact Factor: 4.993. [link] Kartikay Gupta and Niladri Chatterjee. Selecting stock pairs for pairs trading while incorporating lead-lag relationship. Physica A, Statistical Methods and Applications, 551, pp 1 – 16, 2020 Impact Factor: 2.5. [link] Sahil Bhatnagar and Niladri Chatterjee. Neural Machine Translation of Hindi and English. LKE-2019. Journal of Intelligent & Fuzzy Systems. IOS Press. Accepted on September 9, 2019. Impact Factor: 1.637. [link] Nidhika Yadav and Niladri Chatterjee. Rough Sets based Span and its Application to Extractive Text Summarization. Journal of Intelligent & Fuzzy Systems. IOS Press. Vol 37, pp 4299-4309, 2019. Impact Factor: 1.637. [link] Kartikay Gupta, Aayushi Khajuria, Niladri Chatterjee, Pradeep Joshi, Deepak Joshi, Rule Based Classification of Neurodegenerative Diseases using Data Driven Gait Features. Health and Technology, Springer, Accepted 30-10-2018. [link] Nidhika Yadav and Niladri Chatterjee, Fuzzy Rough Set based Technique for User Specific Information Retrieval: A Case Study on Wikipedia Data. International Journal of Rough Set and Data Analysis, IGI Global, Volume 5, Issue 4, pp 32- 47, 2018. [link] Niladri Chatterjee and Susmita Gupta, Efficient Phrase Table Pruning for Hindi to English machine translation through syntactic and marker-based filtering and hybrid similarity measurement. Natural Language Engineering, pp 1 – 40, 2018. [link] Renu Balyan and Niladri Chatterjee, Factor-based Evaluation of English to Hindi MT Outputs, Language Resources and Evaluation, Springer, pp 1- 28, 2018. [link] Niladri Chatterjee and NidhikaYadav, Fuzzy Rough Set Based Sentence Similarity Measure and Its Application to Text Summarization, IETE Technical Review,pp 1 - 9, 2018. [link] Anjali Singh and Niladri Chatterjee. Unsupervised Graph-based Discourse Planning and Generation. IETE Technical Review, Taylor and Francis, pp 1-8, 2018. [link] Kartikay Gupta and Niladri Chatterjee. Forecasting through Motifs discovered by Genetic Algorithms. IETE Technical Review, Taylor and Francis, 2018. [link] Niladri Chatterjee, Naha Kaushik and Bhavya Bansal: Inter-Subdomain Relation Extraction for Agriculture Domain. IETE Technical Review, Taylor and Francis. 2018. [link] Neha Kaushik and Niladri Chatterjee. Automatic Relationship Extraction from Agricultural Text for Ontology Construction. Information Processing in Agriculture, Elsevier, Vol 5, 2018, pp 60 – 73. [link] Suraiya Jabin, Niladri Chatterjee, Suos Samak, Kim Sokphyrum, Javier Sola. An Online English-Khmer hybrid Machine Translation System, International Journal of Intelligent Systems Technologies and Applications (IJISTA), Vol 17, No.3, 2018, pp 293 - 309. [link] Susmita Gupta and Niladri Chatterjee. A Hybrid Approach using Phrases and Rules for Hindi to English Machine Translation. International Journal of Natural Language Computing (IJNLC) Vol 6, No. 3, pp 57-73, 2017 [link] Renu Balyan and Niladri Chatterjee. Translating Noun Compounds Using Semantic Relations. Computer Speech and Languages, Elsevier Vol 32, 2015 pp 91- 108. [link] Niladri Chatterjee and. Random Indexing and Modified Random Indexing Based Approach for Extractive Text Summarization. Computer Speech and Languages, Elsevier. Vol 29, 2015 pp 32- 44. [link] Mariya Khatoon, Geetam Tiwari and Niladri Chatterjee. Binary Probabilistic Models for Pedestrians’ Crossing Behaviour and Risk at the Free Left Turn: Delhi, India. Journal of the Eastern Asia Society for Transportation Studies January 2014. [pdf] Niladri Chatterjee and Pramod K. Sahoo. Effect of Near-Orthogonality on Random Indexing Based Extractive Text Summarization. International Journal of Innovation and Applied Studies. Vol 3, No. 3, Pp 701 – 713, 2013. [pdf] Mariya Khatoon, Geetam Tiwari, Niladri Chatterjee. Impact of Grade Separator on Pedestrian Risk Taking Behavior. Accident Analysis and Prevention, Elsevier, pp 861 – 870, 2012. [link] Khatoon, M., G. Tiwari and Niladri Chatterjee. Statistical Analysis to Measure Pedestrian Risk at foot of Flyover”, Urban Transport Research Journal 2011, Institute of Urban Transport, India, New Delhi, India. pp 35-43. [link] Niladri Chatterjee and Renu Balyan, Towards Development of a Suitable Evaluation Metric for English to Hindi Machine Translation, International Journal of Translation Vol 23, No. 1, pp 7 - 26, 2011. [link] Udit Gupta,Niladri Chatterjee, Geetam Tiwari and Joseph Fazio. Case Study of Pedestrian Risk Behavior and Survival Analysis. Journal of Eastern Asia Society for Transportation Studies. Vol 8, pp 2095 – 2111, September 2010. [PDF] Geetam Tiwari, Joseph Fazio, Sushant Gaurav and Niladri Chatterjee: Continuity Equation Validation for Non-homogeneous Traffic. Journal of Transportation Engineering. ASCE, Vol 134, No. 3, pp 118-127, March 2008. [PDF] K.V. Krishna and Niladri Chatterjee.  Holonomy Decomposition of Seminearrings. Southeast Asian Bulletin of Mathematics, Vol 31, pp 1113 – 1122, 2007. [PDF] K. V. Krishna and Niladri Chatterjee: Representation of Near Semi-Rings and Approximation of their Categories. Southeast Asian Bulletin of Mathematics, Vol 31, pp 903 – 914, 2007. [PDF] K. V. Krishna and Niladri Chatterjee.  A Necessary Condition to Test the Minimality of Generalized Linear Sequential Machines Using the Theory of Near-Semirings. Algebra and Discrete Math., No. 3,  pp 1 – 16, 2005. [link] Shailly Goyal and Niladri Chatterjee.  Study of Hindi Noun Phrase Morphology for Developing a Link Grammar Based Parser. Languages in India, Vol. 5, 2005. [PDF] D. Gupta and Niladri Chatterjee. Divergence in English to Hindi Translation: Some Studies. International Journal of Translation, Vol 15. No. 2, pp 5 – 24, 2003. [link] Niladri Chatterjee: A Case-Based Reasoning System for Calculation of Land Acquisition Compensation. CSI Communications, Vol 23, No. 9, pp 13 – 19, 2000. Niladri Chatterjee and J.A.Campbell: Interpolation of Plans for Time-Critical Adaptation, Knowledge-Based Systems, Vol. 12, Elsevier, pp 171 - 182, 1999. Niladri Chatterjee and J.A.Campbell: Cashing in on Caching: An Architecture for Time-Bounded Knowledge-Based Problem Solving. Real-Time Systems, Vol 15, No. 3, Springer , pp 221 - 247, 1998. [PDF] Niladri Chatterjee and J.A.Campbell: Knowledge Interpolation: A Simple Approach to Rapid Symbolic Reasoning. Computers & Artificial Intelligence, Vol 17 ( 6 ), pp 517 - 551, 1998. (Presently Called Computing and Informatics). A. Mukherjee, S.Acharya, Niladri Chatterjee and J.Das: A Network Based Approach for Uncertainty Management in Rule-based Decision Making. Neural Network World, No. 1/98, pp 81 - 97, 1998. Niladri Chatterjee, P.Pal and J.Das: Boundary Extraction from SODAR Images. Signal Processing, Vol 62, No. 2, Elsevier, pp 229 - 235, 1999. Conference/Workshop/Symposium Niladri Chatterjee and Raksha Agarwal. DEPSYM: A Lightweight Syntactic Text Simplification Approach using Dependency Trees. Proceedings of the First Workshop on Current Trends in Text Simplification (CTTS 2021), CEUR Workshop Proceedings (CEUR-WS.org), pp 42-56. R",
  "content_length": 31425,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:12"
}