{
  "name": "Nils Wilde",
  "homepage": "https://sites.google.com/view/nwilde/home",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationNils WildeAssistant Professor of Computer Science at Dalhousie UniversityShort Bio:I am an Assistant Professor of Computer Science at Dalhousie University in Halifax, Canada. From 2021 to 2024, I was a Postdoctoral Fellow in the Autonomous Multi-Robots Lab working with Javier Alonso-Mora at TU Delft. Until August 2021 I was a postdoctoral fellow at the Autonomous Systems Lab at the University of Waterloo where I also did my PhD in Electrical and Computer Engineering (ECE) under the co-supervision of Dana Kulić and Stephen L. Smith from 2016 to 2020. Before that I completed my BSc. and MSc. degrees at the Technical University Berlin in 2012 and 2016, respectively.Research Interests:My research focuses on motion planning, multi-robot coordination and task assignment, vehicle routing, multi-objective planning, human (multi-) robot interaction, preference learning and learning from human feedback. Please find details about recent research projects under Research.News:November 2025 I had to chance to visit the Intelligent Multi-Robot Coordination Lab at TU Berlin and the Resilient Cyber-Physical Systems at TU Darmstadt, where I also gave seminars on our recent research on multi-objective optimization. Thanks for the kind invitations!April 2025  I am incredible proud to share that I received my first independent research grant: The NSERC Discovery Grant on Adapting complex multi-robot systems to end-user preferences.March 2025 Our paper on Informative Path Planning for Active Regression with Gaussian Processes via Sparse Optimization was accepted at T-RO, congrats to first author Shamak Dutta!March 2025 We (myself, Dylan Shell and Javier Alonso-Mora) are organizing a workshop on Multi-objective optimization and planning in Robotics at RSS this year. Please find more details about this exciting event on our website https://sites.google.com/view/moo-rss25/homeNovember 2024 I have several PhD openings in my new lab at Dalhousie University. Please check the Prospective Students page for more information.October 2024 Beginning in December 2024, I start a new position as Assistant Professor in the Faculty of Computer Science at Dalhousie University in Halifax, Canada! I am immensely looking forward to returning to Canada joining this innovative and vibrant campus community. February 2024 Our work on Regret-based Sampling of Pareto Fronts for Multi-Objective Robot Planning Problems was accepted at Transactions on Robotics (T-RO)! The full paper is available here.January 2024 New year, new paper: Our work on Scalarizing Multi-Objective Robot Planning Problems using Weighted Maximization was accepted at RA-L, the full paper is available here.December 2023 We received a nice Christmas letter publication decision that our paper Statistically Distinct Plans for Multi-Objective Planning and Task Assignment was accepted at Transactions on Robotics (T-RO)! The full paper is available here.October 2023  We had a great day running our Workshop on Human Multi-Robot Interaction at IROS 2023. Thanks to all who contributed and attended!September 2023 Our paper Designing Heterogeneous Robot Fleets for Task Allocation and Sequencing was accepted at the International Symposium on Multi-Robot and Multi-Agent Systems (MRS)! [pdf]August 2023 We have extended the deadline for contributions to our workshop on Human Multi-Robot Interaction at IROS 2023 until September 1st. See our website for more details.July 2023 Our paper A Unified Approach to Optimally Solving Sensor Scheduling and Sensor Selection Problems in Kalman Filtering was accepted at CDC 2023 IEEE Conference on Decision and Control (CDC) 2023, congrats to first author Shamak!July 2023 Our paper Optimizing Task Waiting Times in Dynamic Vehicle Routing was accepted at RA-L!April 2023 Our workshop on Human Multi-Robot Interaction was accepted at IROS 2023. More announcements to follow soon! UPDATE: We are pleased to invite submissions of short papers (4 pages) to our workshop. The full call for papers and submission instructions can be found on the workshop's website.January 2023 Our paper Approximation Algorithms for Robot Tours in Random Fields with Guaranteed Estimation Accuracy  was accepted at ICRA 2023, congratulations to first author Shamak Dutta!December 2022 The Canadian Robotics Network NCRN  invited me to give a seminar at McGill University in Montreal, thanks to everyone involved for a spectacular visit!November 2022 I gave invited talks at the Robotics and Biology Lab at TU Berlin as well as at Kavraki Lab at Rice University, thanks for the kind invitations!September 2022 Our paper Do we use the Right Measure? Challenges in Evaluating Reward Learning Algorithms was accepted at the Conference on Robot Learning (CoRL)!July 2022  Our paper Online Multi-Robot Task Assignment with Stochastic Blockages was accepted at the IEEE Conference on Decision and Control (CDC) 2022!Moreover, I am co-author of two other papers, Scheduling Operator Assistance for Shared Autonomy in Multi-Robot Teams  and Informative Path Planning in Random Fields via Mixed Integer Programming, which both also got accepted at CDC, congrats to first authors Yifan and Shamak!May 2022  Our paper  Learning Submodular Objectives for Team Environmental Monitoring will be featured in the Workshop on Robotics for Climate Change at ICRA 2022.March 2022 Our paper Error-Bounded Approximation of Pareto Fronts in Robot Planning Problems, was accepted at WAFR 2022!November 2021 New journal paper Learning Submodular Objectives for Team Environmental Monitoring, accepted at RA-L, with presentation at ICRA 2022.September 2021 I started a new Postdoc at TU Delft, working together with Prof. Javier Alonso-Mora! Thanks Waterloo and Canada for all the fantastic times, great research endeavours with Stephen Smith, Dana Kulic and all the great people in their labs. Until next time, Canada!September 2021 Our paper Learning Reward Functions from Scale Feedback , was accepted at CoRL 2021.September 2020 I successfully defended my PhD thesis on September 2nd. A huge thanks goes to my  supervisors Dana Kulic and Stephen L. Smith as well as to my committee members Anca Dragan, Christopher Nielsen, David Wang and Steve Waslander! The pdf of my thesis is available from the UW library.July 2020 Our paper Active Preference Learning using Maximum Regret, was accepted at IROS 2020.April 2020 Our journal paper Improving User Specifications for Robot Behavior through Active Preference Learning: Framework and Evaluation, will be presented at the Workshop on Interactive Robot Learning (WIRL) at ICRA 2020.April 2020 Our paper Learning Control Sets for Lattice Planners from User Preferences, first authored by Alexander Botros and me, was accepted at WAFR 2020.January 2020 Our paper Learning User Preferences from Corrections on State Lattices was accepted at ICRA 2020.ContactDalhousie University, Faculty of Computer ScienceGoldberg Computer Science Building, Room 3146299 South St, Halifax, NS B3H 4R2, Canadaemail: nils.wilde@dal.caGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 7170,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:15"
}