{
  "name": "Ning Yang 0001",
  "homepage": "https://yneversky.github.io",
  "status": "success",
  "content": "Ning Yang Ning Yang 博士，副教授，博士研究生导师 中国计算机学会高级会员 中国计算机学会信息系统专业委员会执行委员 Ph.D, Associate Professor, Senior member of CCF Address: College of Computer Science Sichuan University Chengdu, China, 610041 Telephone: (86-028)85466105 Email: yangning at scu dot edu dot cn Office: B421 Basic Teaching Building [Research Interests] [Research Projects] [Brief Bio] [Publications] [Courses] [Google Scholar Profile] [Professional Services] [People] Research Interests Trustworthy Machine Learning (Adversarial Robustness, Fairness, Explainability, Privacy, Accountability, ... ) Recommender Systems Learning on Graph 科研经费充足，学习和研究环境宽松，欢迎对我的研究方向感兴趣的同学申请我的硕士研究生和博士研究生。 I am looking for motivated students who are interested in my research interests. Research Projects Current Projects Research on Key Techniques of Adversarial Attacks and Defense in Recommender Systems, Supported by Natural Science Foundation of Sichuan Province with Grant No. 2024NSFSC0516, ¥200K, 2024-2025 (四川省自然科学基金项目, 主持) Finished Projects Research on Fusion of Multiple Social Networks Based on Cross-network Information Diffusions, Supported by National Natural Science Foundation of China, General Program (Grant No. 61972270), ¥728K, 2020-2023 (国家自然科学基金面上项目, 主持) Research on Real-Time Computing and Analyzing Engine for Urban Big Data, Supported by Sichuan Province, Hightech Program (Grant No. 2019YFG0213), ¥200K, 2019-2020 (四川省支撑计划项目, 主持) Research on Key Techniques of Large Scale Social Sensing Data Mining, Supported by the Basic Research Program of Sichuan Province with Grant No. 2014JY0220, ¥100K, 2014-2016 (四川省应用基础计划项目, 主持) Research on the Mining of Information Transfer in Temporal Sequences, Supported by National Natural Science Foundation of China, General Program (Grant No. 61173099), ¥550K, 2012-2015 (国家自然科学基金面上项目, 主持) Research on the Mining of Information Transfer for the Predictions and Intervenions of Temporal Sequences, Supported by the Doctoral Fund of Ministry of Education of China (Grant No. 20110181120062), ¥40K, 2012-2014 (教育部博士点基金项目, 主持) Research on Key Techniques of the Mining and Application of Digital Traces in Internet of Things, Supported by Sichuan Province, Hightech Program (Grant No. 2011GZ0223), ¥100K, 2011-2013 (四川省支撑计划项目, 主持) Brief Bio I received Ph.D. in computer Science from the Sichuan University, Chengdu, China, 2010. Before coming back to campus, I was a programmer. Visiting Scholar at University of Illinois at Chicago, Supervised by Professor Philip S. Yu (09/2012 - 08/2013) Publications IEEE BigData 2025 Denoised Recommendation Model with Collaborative Signal Decoupling. Zefeng Li, Ning Yang* IJCAI 2025 Negative Metric Learning for Graphs. Yiyang Zhao, Chengpei Wu, Lilin Zhang, Ning Yang* [paper] [codes] CVPR 2025 Weakly Supervised Contrastive Adversarial Training for Learning Robust Features from Semi-supervised Data. Lilin Zhang, Chengpei Wu, Ning Yang* [preprint] [online] [codes] RecSys 2024 Improving Adversarial Robustness for Recommendation Model via Cross-Domain Distributional Adversarial Training. Jingyu Chen, Lilin Zhang, Ning Yang* [paper] TPAMI 2024 Provable Unrestricted Adversarial Training without Compromise with Generalizability. Lilin Zhang, Ning Yang*, Yanchao Sun, Philip S. Yu [paper] [online] [codes] SIGIR 2024 Adaptive Fair Representation Learning for Personalized Fairness in Recommendations via Information Alignment. Xinyu Zhu, Lilin Zhang, Ning Yang* [paper] DASFAA 2024 Cross-Domain Causal Preference Learning for Out-of-Distribution Recommendation. Zhuhang Li, Ning Yang* [paper] TKDE 2023 Learning from Atypical Behavior: Temporary Interest Aware Recommendation Based on Reinforcement Learning. Ziwen Du, Ning Yang*, Philip S. Yu [paper] [online] TKDE 2023 Dual Adversarial Variational Embedding for Robust Recommendation. Qiaomin Yi, Ning Yang*, Philip S. Yu [paper] [online] ICASSP 2023 Robust Log-Based Anomaly Detection with Hierarchical Contrastive Learning. Yuhui Zhao, Ruichun Yang, Ning Yang* [paper] IJCNN 2023 An Anchor-Semantics-Aware Neural Preference Propagation Model for Session-based Recommendation. Yaxuan Ye, Ning Yang* [paper] WWW 2023 Contrastive Collaborative Filtering for Cold-Start Item Recommendation. Zhihui Zhou, Lilin Zhang, Ning Yang* [paper] TIM 2023 A Three-Step Calibration Method of Sensors’ Pose for Magnetic Localization System. Weijun Lin, Shijie Ding, Zheng Li, and Ning Yang* [oneline] KBS 2022 Learning Aspect-Level Complementarity for Intent-Aware Complementary Recommendation. Rui Wang, Ning Yang*, Philip S. Yu [paper] CIKM 2022 Time Lag Aware Sequential Recommendation. Lihua Chen, Ning Yang*, Philip S. Yu [paper] WSDM 2022 Multi-Sparse-Domain Collaborative Recommendation via Enhanced Comprehensive Aspect Preference Learning. Xiaoyun Zhao, Ning Yang*, Philip S. Yu [paper] IEEE BigData 2020 MLANE: Meta-Learning Based Adaptive Network Embedding. Chen Cui, Ning Yang*, Philip S. Yu [paper] WWWJ 2020 A Meta-feature Based Unified Framework for Both Cold-start and Warm-start Explainable Recommendations. Ning Yang, Yuchi Ma, Li Chen, Philip S. Yu [paper] KBS 2020 Deep Collaborative Embedding for Information Cascade Prediction. Yuhui Zhao, Ning Yang*, Tao Lin, Philip S. Yu [paper] IEEE BigData 2019 Hybrid Deep Embedding for Recommendations with Dynamic Aspect-Level Explanations. (Best Paper Award, out of 554 submissions) Huanrui Luo, Ning Yang*, Philip S. Yu [paper] WWWJ 2019 Explainable Recommendation with Fusion of Aspect Information. Yunfeng Hou, Ning Yang*, Yi Wu, Philip S. Yu [paper] ICDM 2017 Collaborative Inference of Coexisting Information Diffusions. Yanchao Sun, Cong Qian, Ning Yang*, Philip S. Yu [paper] KAIS 2017 Spatial and Semantical Label Inference for Social Media: A Cross-Network Data Fusion Approach. Yuchi Ma, Ning Yang*, Lei Zhang, Philip S. Yu [paper] DMKD 2017 Reducing Uncertainty of Dynamic Heterogeneous Information Networks: A Fusing Reconstructing Approach. Ning Yang, Lifang He, Zheng Li, Philip S. Yu [paper] WWWJ 2017 Predicting Neighbor Label Distributions in Dynamic Heterogeneous Information Networks. Yuchi Ma, Ning Yang*, Lei Zhang, Philip S. Yu [paper] CIKM 2016 Efficient Hidden Trajectory Reconstruction From Sparse Data. Ning Yang, Philip S. Yu [paper] SDM 2015 Predicting Neighbor Distribution in Heterogeneous Information Networks. Yuchi Ma, Ning Yang*, Chuan Li, Lei Zhang, Philip S. Yu [paper] SDM 2014 When and Where: Predicting Human Movements Based on Social Spatial-Temporal Events. Ning Yang, Xiangnan Kong, Fengjiao Wang, Philip S. Yu [paper] Courses Principles of Database System (Fall 2020, for undergraduates) Professional Services CCF Senior Member ACM Member ACM SIGKDD Member IEEE Computer Society Member PC or Reviewer: AAAI, KDD, WWW, ICDM, RecSys, DASFAA, IEEE BigData, TKDE, ...",
  "content_length": 6752,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:20"
}