{
  "name": "Ning Zhang 0001",
  "homepage": "https://www.research.manchester.ac.uk/portal/ning.zhang-2.html",
  "status": "success",
  "content": "Ning Zhang - Research Explorer The University of Manchester Ning Zhang, BSc, PhD Dr Senior Lecturer, Systems and Software Security https://orcid.org/0000-0001-9519-9128 Personal profile OverviewNing Zhang is currently a Senior Lecturer in Distributed Systems Security in the School of Computer Science at the University of Manchester. She received a BSc degree from Dalian Maritime University, China, and a PhD degree from the University of Kent at Canterbury, UK, all in Electronics Engineering. Before joining the University of Manchester, she worked as a Research Associate in the School of Computer Science, the University of York, and then as a Lecturer in the School of Computing and Math, the Manchester Metropolitan University. She joined the School as a Lecturer in 2000, and became a Senior Lecturer in 2006. She was the recipient of the Best Student Paper Award from the IEEE ICC/SUPERCOM'90, and a co-recipient of a Best Paper Award from IEEE ISCC2004. She was a general co-chair of the Third International Symposium on Information Assurance and Security (IAS07), an Editor for the IAS07 proceedings, a Co-chair of the LoA-RG (Authentication Levels of Assurance Research Group) in OGF (Open Grid Forum). She also served as a Guest Editor for the Journal of Information Assurance and Security, Issue 4 (2009), 1554-1010, Dynamic Publishers, Inc. She currently serves as an Editor for the Journal of Information Assurance and Security (JIAS), and an Associate Editor of the Communication System and Security Track of the JIPS (Journal of Information Processing Systems), published by Korea Information Processing Society, and as an external examiner for some of the MSc Programmes in Computer Science both at the University of Hull and at University College Dublin. She has six times been invited by the Irish Research Council as an International Peer Assessor/Reviewer for research funding assessments and project progress reviewing. She has served as a technical Programme Committee member for a large number of International security conferences. More information about my research interests are available here at: http://staff.cs.manchester.ac.uk/~nzhangQualificationsObtained BSc from Dalian Maritime University, China, and PhD from the University of Kent at Canterbury, UK.Research interestsNing's current research interests include security in networked and distributed systems, applied cryptography, data privacy, trust and digital right managements. She has been working on a range of security projects including smart card based multi-factor authentication, authentication strength linked fine-grained access control, context-aware and adaptive security provision in mobile ad hoc networks and Ubiquitous Computing, digital rights management, accountable anonymity, signature delegation and distributed trust management. She led the completion of the FIDES (Fair Integrated Data Exchange Services) project working on the design of cryptographic primitives, protocols and architectures to address security threats and vulnerabilities in Internet-based e-commerce activities/transactions. She also led the FAME-PERMIS and the ES-LoA (E-infrastructure Security: Levels of Assurance) projects developing a multi-factor authentication framework and authentication strength linked fine-grained access control extension for the Shibboleth infrastructure. She was one of the investigators of the clinical e-Science project, CLEF-Services, supervising the design and development of the CLEF security architecture to support secure remote access to patient data. She was also the designer of the architecture and algorithms to support privacy-preserving record linkage for the Genetic Lab Pilot project hosted at the Manchester St Mary Hospital, and the security advisor for the PsyGrid project on building a security bridge linking Janet and the NHS (National Health Services) Network. She has published extensively in the field of security and supervised 37 PhDs to their successful completions. Supervised Research/PhD Projects: Dr Lisha He - Thesis Title: An Asymmetrical End-to-End Mobile Payment Protocol for M-Commerce (PhD), awarded 2005.Dr Delia Critchlow - Thesis Title: User Privacy and Accountable Anonymity for M-commerce Transactions (PhD); Delia has won the School's 2003 Best Paper Award; awarded 2005.Dr Aleksandra Nenadic - Thesis Title: A Security Solution for Fair Exchange and Non-repudiation in E-Commerce (PhD), awarded 2005.Dr Omaima Bamasak - Thesis Title: Delegating Signing Power to Mobile Agents: Algorithms and Protocol Designs (PhD). Omaima has won the Best Paper Award given by the IEEE Computer Society in the IEEE ISCC04 conference; She has also won the School's 2004 Best Paper Award, awarded 2006.Dr Ian Featherstone - Thesis Title: Quality of Service in Hybrid Wireless IP Networks (PhD), awarded 2006.Jay Sean Chin - Thesis Title: Context-constrained Authorisation Architecture for Pervasive Grid Computing (MPhil), awarded 2007.Dr Clara Corzo - Thesis Title: An Agent-based Distributed Workflow-oriented Audit Architecture: a solution to securing inter-bank e-trading transactions (PhD), awarded in 2010.Dr Ali Ahmed - Thesis Title: Context-aware Access Control in Ubiquitous Computing (PhD), awarded in 2010.Dr Li Yao - Thesis Title: A Structured Approach to Electronic Authentication Assurance Level Derivation (PhD); awarded in 2010.Dr Osama Elshakankiry - Thesis Title: Securing Home and Correspondent Registrations in Mobile IPV6 Networks (PhD), awarded in 2011, jointly with Dr Andy Carpenter (I am the 2nd supervisor).Dr Naikuo Yang - Thesis Title: Formalism of Privacy Preserving Access Control (PhD), awarded in 2011, jointly with Prof. Howard Barringer (I am the 2nd supervisor);Dr Tarek Gaber - Thesis Title: Support Consumers' Rights in DRM: A Secure and Fair Solution to Digital License Reselling over the Internet (PhD), awarded in 2012;Dr Mengchang Liu - Thesis Title: Achieving Privacy-preserving Distributed Statistical Computation (PhD), awarded in 2012;Dr Kitisak Osathanunkul - Thesis Title: A Cross-Layer and Multi-Metric Routing Decision Making Framework for MANETs (PhD), awarded in 2013.Dr Peter McNerney - Thesis Title: Achieving Quality of Service in Mobile Ad Hoc Networks Containing Packet Forwarding Attackers (PhD), awarded in 2013.Dr Abdulla Alnajem - Thesis Title: Risk-Linked Security Solutions for Mobile Financial Systems (PhD), awarded in 2015.Dr Mustafa Mustafa - Thesis Title: Smart Grid Security: Protecting Users' Privacy in Smart Grid Applications (PhD), awarded in 2015.Dr Rima Addas - Thesis Title: Supporting Access to Distributed EPRs (Electronic Patient Records) with Three Levels of Identity Privacy Preservation (PhD), awarded in 2015.Dr Helen Bakhsh - Thesis Title: ATL-QoS: An Adaptive Trust-Aware Location-Based Framework for Achieving QoS in MANETs (PhD), awarded in 2016.Dr Ahmed Al-Riyami - Thesis Title: Towards an Adaptive Solution to Data Privacy Protection in Hierarchical Wireless Sensor Networks (PhD), awarded in 2016.Dr Adel Binbusayyis - Thesis Title: Achieving Secure and Efficient Access Control of Personal Health Records in a Storage Cloud (PhD), awarded in 2017.Dr Sadia Saleem – Thesis Title: A Risk-Aware Workload Scheduler to Support Efficient Data Transfer for Mobile Collaborative Communities (PhD), awarded in 2017.Dr Ibrahim Lahmer - Thesis Title: Towards a Virtual Domain based Authentication Solution for the MapReduce Application (PhD), awarded in 2018.Dr Gabriel Sanchez Bautista - Thesis Title: A Multi-Level Access Control Framework for Data Access in a Healthcare Cloud (PhD), awarded in 2018.Dr Pin Shen Teh - Thesis Title: Using Users' Touch Dynamics Biometrics to Enhance Authentication on Mobile Devices (PhD), awarded in 2019.Dr Ayesha Naureen - Thesis Title: A RELIABLE AND ENERGY EFFICIENT DATA COLLECTION SOLUTION FOR WIRELESS SENSOR NETWORKS (PhD), awarded in 2019; received a PDS award.Dr Reem Almarwani - Thesis Titie: Secure, Reliable and Efficient Data Integrity Auditing (DIA) Solution for Public Cloud Storage (PCS) (PhD), awarded in 2020.Dr Soontorn Sirapaisan - Thesis Title: An Effective And Efficient Authentication Framework for MapReduce in a Multiple Public Cloud Environment (PhD), awarded in 2021.Dr Tahani Aljohani - Thesis Title: A Secure and ID Privacy-Preserving Distributed Data Collection Framework for Internet of Things Applications (PhD), awarded in 2022.Dr Salem AlJanah - Thesis Title: An Interaction Based Multi-Factor Multi-Level Authentication Framework for IoT Environments (PhD), awarded in 2022.Dr Twisha Twisha - Thesis Title: Let’s Look Out For Each Other: A Distributed Framework for Botcloud Detection (PhD), awarded in 2022.Dr Michael Akpoghiran - Thesis Title: BOS-FRAMEWORK: BIOMETRIC-ORIENTED SECURITY FRAMEWORK FOR MOBILE AD HOC NETWORKS (PhD), awarded in 2022.Dr Tolijan Trajanovski - Thesis Title: COUNTERING IoT BOTNETS (PhD), awarded in 2023.Dr Siok Wah Tay - Thesis Title: A Two-Level Communication-based Access Control Framework for the Internet of Things (PhD), awarded in 2023.Dr Amina Gamlo - Thesis Title: A Trust-based Elastic and Dynamic Authentication Solution for Multi-Cloud Computing (PhD), awarded in 2023.Dr Mengya Li - Thesis Title: A Framework for Continuous, Efficient and Privacy-Preserving Authentication in Internet of Vehicles (IoV) Environments (PhD), awarded in 2023.Dr Hanin Almutairi - Thesis Title: A Swam Intelligence-based Path Selection for Low Power and Lossy Networks with The Presence of Packet Dropping Attacks (PhD), awarded in 2024.Dr Ismail Alsalti - Thesis Title: An Effective, Efficient, and Scalable Link Discovery (EESLD) Framework for Hybrid Multi-controller SDN Networks (PhD), awarded in 2024. Currently Supervised Research Students/Projects: Nour Alhariqi - Secure Routing (PhD).Bowen Xu - Risk-aware Routing (PhD).Asma Alqahtani - IoT Security (PhD).Fai Alsaykhan - IoT Security (PhD).Nusaibah AlRatta - IoT Security (PhD).Norah Alassaf - IoT Security (PhD). My groupSyst",
  "content_length": 15570,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:23"
}