{
  "name": "Ninghui Li",
  "homepage": "https://www.cs.purdue.edu/homes/ninghui",
  "status": "success",
  "content": "Ninghui Li's Homepage Ninghui Li Samuel D. Conte Professor of Computer Science ACM Fellow, IEEE Fellow ninghui@purdue.edu Biographical Information Address Purdue University Department of Computer Sciences 305 N. University Street West Lafayette, Indiana, 47907-2107 Office Phone: +1 765-496-6756 FAX: +1 765-494-0739 Coaching Purdue ICPC Teams On November 10, 2024, Purdue Teams competed in the ICPC North America East Division competition. Purdue Waffle Wizards team (Wilbert Chu, Robert Lee, and Thomas Quintus Marlowe) solved all 13 problems and finished at 3rd place in the combined ranking including all 3 regions in the division, behind CMU and MIT. The team advances to North America Championship. In April, 2024, ICPC held the 46th and 47th World Finals. Purdue Team (Trung Dang, Richard Li, and Devin Qu) competed in the 47th World Final, and Purdue Team (Egor Gagushin, Peter Jin, and Minh Thanh Nguyen) competed in the 46th World Final. On May 29, 2023, Purdue Team (Trung Dang, Richard Li, and Devin Qu) received a Bronze Medal in ICPC North America Championship. Purdue team finished at 4th place. On February 25, 2023, Purdue Team (Trung Dang, Richard Li, and Devin Qu) won ICPC East Central North America Contest, besting teams from CMU, Waterloo, Toronto, Michigan and many other universities in the region. On November 10, 2022, Purdue Team (Riley Borgard, Trung Dang, and Richard Li) finished 20th place in ICPC World Finals Dhaka. Purdue was 4th place among all universities in North America behind MIT, CMU, and Waterloo. On May 30, 2022, Purdue Team (Trung Dang, Minh Nguyen, and Devin Qu) finished 9th place in ICPC North America Championship, and advanced to World Final . On August 14, 2021, Purdue Team (Riley Borgard, Trung Dang, and Richard Li) finished 12th place in ICPC North America Championship, and advanced to World Final Dhaka. On February 23, 2020, Purdue Team (Riley Borgard, Trung Dang, and Yi Xu) won Bronze Medal (4th place) in 2020 North America Championship, and advanced to World Final Moscow. Due to Covid, only Riley attended WF Moscow. Outreach See here for a list of K-12 competition math courses I've taught Learning to Code on the Cloud: Virtual Summer Camps for Middle and High School Students July 2021 ; June 2022 ; July 2023 See here for resources on learning to program See here for some info of grades 3-6 math Current Research Projects SaTC: Frontiers: Center for Distributed Confidential Computing (CDCC) 10/1/2022 to 9/30/2027, (PI of Purdue Portion). Funded by NSF. Collaboration with IU Bloominton, CMU, Duke, Ohio State, Penn State, UNC Chapel Hill, Yale. ACTION: AI Institute for Agent-based Cyber Threat Intelligence and Operation 06/01/2023 to 05/31/2028. Funded by NSF. Collaboration with University of California-Santa Barbara, University of California-Berkeley, Georgia Tech, and other universities Collaborative Proposal: SaTC: CORE: Small: Differentially Private Data Synthesis. 07/15/2023-06/30/2026. Funded by NSF. (PI of Purdue, in collaboration with UCLA) Slides from Recent Talks Private Data Synthesis: State of the Art and Challenges Keynote talk in 2024 Synthetic Data and GenAI Wrokshop Membership Inference Attacks against Classifiers Keynote talk in 2023 IEEE CNS. Differentially Private: Meaning and Caveats Invited talk in AI for Society day in 2023 KDD conference Teaching CS(i+1)90-CPi: Competitive Programming : CP1 and CP2 have been offered every Fall/Spring in recent years. Below are the versions with the most publicly-available resources. See https://purdue.kattis.com/ for problem sets used in recent semesters. CP0: Summer 2020 Offered only once. CP1: Fall 2020 CP2:       Spring 2020 CS 556 (former 590-DSP): Data Security and Privacy (Graudate) Spring 2025, Spring 2022, Spring 2018 CS 529: Security Analytics (Graudate) Fall 2018, Fall 2017 CS 526: Information Security (Graduate): Fall 2015, Fall 2014, Fall 2013, Fall 2012, Spring 2012, Fall 2011, Spring 2011, Spring 2009, Fall 2008 CS 591RS2: Research Seminar for First Year Grad Students: Fall 2016 CS 252: Systems Programming: Spring 2017,   Spring 2015,   Spring 2014 CS 555: Cryptography (Graduate): Spring 2012, Fall 2004, Spring 2004, CS 426: Computer Security (Undergraduate): Fall 2010, Fall 2007, Fall 2006, CS 590U: Access Control: Theory and Practice (Graduate): Spring 2006, Spring 2005, Fall 2003, CS 590N: Logical Methods in Information Security (Graduate): Spring 2008 CS 655: Advanced Cryptology (Graduate) : Spring 2007 CS 355: Cryptography (Undergraduate): Fall 2005 CS 591C: Research Seminar for Beginning Graduate Students: Spring 2006 A reading list in security Current Students Yuetian Chen Yuntao Du Zhizhen Yuan Kaiyuan Zhang PhD Graduates Mahesh V. Tripunitara (Ph.D.  Dec 2005, now with University of Waterloo) Jiangtao Li (Ph.D. May 2006, co-advised with Professor Mike Atallah) Ji-Won Byun (Ph.D. May 2007, co-advise with Prof. Elisa Bertino) Qihua Wang (Ph.D. August 2009) Hong Chen (Ph.D. December 2009) Ziqing Mao (Ph.D. December 2009) Tiancheng Li (Ph.D. August 2010) Ian Molloy (Ph.D. August 2010) Wahbeh Qardaji (Ph.D. May 2013) Christopher S. Gates (Ph.D. August 2014) Weining Yang (Ph.D. August 2016) Dong Su (Ph.D. December 2016) Hao Peng (Ph.D. May 2017, co-advised with Prof. Yuan Qi). Wei-Yen Day (Ph.D. August 2017) Haining Chen (Ph.D. August 2018). Sze Yiu Chau (Ph.D. August 2019, co-advised with Prof. Aniket Kate) joined Chinese University of Hong Kong (CUHK) as a tenure-track faculty member. Tianhao Wang (Ph.D. May 2021), joined University of Virgina as a tenure-track faculty member Zitao Li (Ph.D. December 2022) Huangyi Ge (Ph.D. December 2022) Weicheng Wang (Ph.D. December 2023) Jiacheng Li (Ph.D. May 2024) Former PostDocs Xinming Ou (PostDoc September 2005 to May 2006) Zenglin Xu (PostDoc September 2013 to August 2014) Omar Chowdhury (PostDoc September 2014 to August 2016) Syed Rafiul Hussain (September 2019 to August 2020, co-supervised with Prof. Elisa Bertino) Former Visiting Students and Scholars Jerry Ma (January 2013 to December 2013) Min Luo (February 2013 to February 2014) Min Lv (September 2014 to Feb 2016) Zhikun Zhang (September 2017 to August 2019) Jianyu Yang (September 2019 to October 2020) Selected Current and Recent Professional Activities and Affiliations ACM Conference on Computer and Communications Security (CCS), Chair of Steering Committee (Nov 2025 - present), PC Chair (2014 and 2015) SIGSAC Outstanding Early-Career Researcher Award Committee, Chair (2024) ACM SIGSAC Awards Committee, Chair (2023, 2016) ACM Conference on Data and Application Security and Privacy (CODASPY), PC Chair, 2023 and 2024 ACM Transactions on Privacy and Security (TOPS) (Formerlly TISSEC), Editor-in-Chief (October 2020~January 2024) ACM Special Interest Group on Security, Audit and Control (SIGSAC), Member of Executive Committee (July 2021~June 2025), Chair (July 2017~2021), Vice Chair (July 2013~2017) ACM Transactions on Internet Technology (TOIT), Associate Editor (2014~present) European Symposium on Research in Computer Security (ESORICS), PC Chair, 2020 Journal of Computer Security (JCS), Associate Editor (2014~2022) ACM Symposium on Access Control Models and Technologies (SACMAT), , Steering Committee member, (2008-2016) IEEE Transactions on Dependable and Secure Computing, Associate Editor, (2011~2015) ASIACCS: ACM Symposium on Information, Computer and Communications Security, Steering Committee member, (2011-2016) The VLDB Journal, Associate Editor, (2007~2013) On COVID-19 August, 2021: Our paper titled \"PURE: A Framework for Analyzing Proximity-based Contact Tracing Protocols\" was accepted to appear in ACM Computing Surveys June 29, 2020: I gave a keynote at 2020 IEEE Conference on Communications and Network Security (CNS) titled \"COVID-19, Cybersecurity, and Epidemiology\". Slides are \t\there. Recorded talk is here. April 5, 2020: We Should Learn from Austria's Experiences Fighting COVID-19. PDF version on (April 5, 2020) March 22, 2020: Resources for Kids Learning at Home PDF version on (Mar 23, 2020) March 30, 2020: COVID-19 for the Risk Digest. Essentially the same version titled: Covid-19, CyberSecurity, and Epidemiology March 14, 2020: Open Letter 2: Aggressive Social Distancing is Everyone's Responsibility PDF version on (Mar 14, 2020) March 9, 2020: Open Letter 1: The Urgent Need for Aggressive Social Distancing Actions PDF version on (Mar 10, 2020) (Mar 11, 2020) This page last modified November 11, 2025.",
  "content_length": 8473,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:22"
}