{
  "name": "Ningning Hou",
  "homepage": "https://ningning-hou.github.io/homepage",
  "status": "success",
  "content": "Welcome! - HOU Ningning HOU NingningLecturer Follow Email ResearchGate Google Scholar ORCIDMy name is Hou Ningning. I am a Lecturer (Assistant Prof) at Macquarie University (Sydney, Australia). Before joining Macquarie University, I worked as a Postdoctoral Fellow at The Hong Kong Polytechnic University (PolyU). I obtained my Ph.D. from PolyU under the supervision of Prof. Yuanqing Zheng. Prior to this, I received my B.Eng. degree from Beijing University of Posts and Telecommunications (BUPT). Feel free to contact me at [ningning.hou@mq.edu.au]. Detailed CV is [Here].I am looking for self-motivated PhD students and research staff at all levels to work on exciting research projects related to Artificial Intelligence of Things (AIoT), LPWANs, edge computing, wireless networking, security, and privacy. If you are interested in any of these or other research topics, please feel free to contact me.News[2025/06] Invited as a TPC member of INFOCOM 2026 — submissions are welcome![2025/06] Invited as a TPC member of SenSys 2026 — submissions are welcome![2025/05] Invited as a TPC member of BodySys @ ACM UbiComp 2025 — submissions are welcome![2025/05] Invited as a Demo TPC member @ MobiCom 2025[2025/04] Serve as a member of MobiCom 2025 Artifact Evaluation Commitee.[2025/02] Our paper MoLoRa is accepted by ACM SenSys 2025 (46/245=18.78%).Scholarships– Successful applicants will receive a tax-free scholarship of about $39,700 per annum, PLUS a free tuition fee of 3 years for a PhD, and a free tuition fee of 1 year for MRes (Master by Research) students.– Onshore students can apply for Road to Research Scholarship for MRes of about $39,700 per annum.– 2 years for Master Research (MRes) may also get a living allowance from project money. Outstanding students with a Bachelor’s degree can apply for MRes year-2 directly.– A PhD student enrolled in an overseas university can apply for the cotutelle PhD program (联合培养双学位) at Macquarie. A successful applicant can receive a scholarship with the same rate of about $39,700 per annum (2024 rate) for 1-2 years. After graduation, the student can be awarded PhD degrees from the overseas home university and Macquarie University.– An applicant from China can also apply for CSC (Chinese Scholarship Council) scholarship. If granted, Macquaire covers tuition fees (45k AUD per year) and both CSC and Macquarie will provide a stipend (38,500 AUD per annum) for the entire program. Both CSC visiting students and research fellows are also welcome！– A Ph.D. student could receive up to $7.5k for attending international conferences (5,000 AUD from the university and 2,500 AUD from the department) during the program.EligibilityFor admission to the PhD program, an international applicant needs an overall score of 6.5 in IELTS, or overall 83 in TOEFL iBT, or overall 58 in PTE.Research InterestsLow Power Wide Area Networks(LPWANs), Artificial Intelligence of Things (AIoT), Wireless Computing and Networking, and Wireless Security. Also interested in collaborations and discussions on ISAC, Space-air-ground Integrated Networks, LLMs+CPS, Drones and Robotics. Please drop me an email if you are interested in working together.Conference papers[IMC’25] “Satellite IoT in Practice: A First Measurement Study on Network, Availability, Performance, and Costs” Wenchang Chai, Jinhong Liu, Ziyue Zhang, Xianjin Xia, Yuanqing Zheng, Ningning Hou, Qiang Yang, Weiwei Chen, Tao Gu. In ACM Internet Measurement Conference, Madison, Wisconsin, USA, Oct. 2025. [PDF][SenSys’25] “MoLoRa: Intelligent Mobile Antenna System for Enhanced LoRa Reception in Urban Environments” Ningning Hou, Yifeng Wang, Shiming Yu, Yuanqing Zheng, Tao Gu. In ACM SenSys, Irvine, LA, USA, 6-9 May 2025. [PDF][MobiCom’25] “From Interference Mitigation to Toleration: Pathway to Practical Spatial Reuse in LPWANs” Ruonan Li, Ziyue Zhang, Xianjin Xia, Ningning Hou, Changwen Chai, Shiming Yu, Yuanqing Zheng, Tao Gu. In ACM MobiCom, Hong Kong, China, 4-8 Nov 2025. [PDF][SenSys’24] “FDLoRa: Tackling Downlink-Uplink Asymmetry with Full-duplex LoRa Gateways” Shiming Yu, Xianjin Xia, Ziyue Zhang, Ningning Hou, Yuanqing Zheng, In ACM SenSys, Hangzhou, China, 4-7 Nov 2024. [PDF][MobiCom’24] “Revolutionizing LoRa Gateway with XGate: Scalable Concurrent Transmission across Massive Logical Channels” Shiming Yu, Xianjin Xia, Ningning Hou, Yuanqing Zheng, Tao Gu. In ACM MobiCom, Washington, D.C., USA, 2-6 Oct 2024. [PDF][MobiCom’23] “XCopy: Boosting Weak Links for Reliable LoRa Communication” Xianjin Xia, Qianwu Chen, Ningning Hou, Yuanqing Zheng, Mo Li. In ACM MobiCom, Madrid, Spain, 2-6 Oct 2023. [PDF][INFOCOM’23] “One Shot for All: Quick and Accurate Data Aggregation for LPWANs” Ningning Hou, Xianjin Xia, Yifeng Wang, Yuanqing Zheng. In IEEE INFOCOM, New York, United States, 17-20 May 2023. [PDF][SenSys’22] “HyLink: Towards High Throughput LPWANs with LoRa Compatible Communication” （Best paper candidate） Xianjin Xia, Qianwu Chen, Ningning Hou, Yuanqing Zheng. In ACM SenSys, Boston, United States, 6-9 Nov 2022. [PDF][INFOCOM’22] “Don’t Miss Weak Packets: Boosting LoRa Reception with Antenna Diversities” Ningning Hou, Xianjin Xia, Yuanqing Zheng. In IEEE INFOCOM, Virtual Conference, 2-5 May 2022. [PDF] [Presentation Video][MobiCom’21] “PCube: Scaling LoRa Concurrent Transmissions with Reception Diversities” Xianjin Xia, Ningning Hou, Yuanqing Zheng, Tao Gu. In ACM MobiCom, New Orleans, United States, March 28 - April 1, 2022. [PDF] [1-min Pitch][INFOCOM’21] “Jamming of LoRa PHY and Countermeasure” Ningning Hou, Xianjin Xia, Yuanqing Zheng. In IEEE INFOCOM, Virtual Conference, 10-13 May 2021. [PDF] [Presentation Video][ICNP’20] “CloakLoRa: A Covert Channel over LoRa PHY” Ningning Hou,Yuanqing Zheng. In IEEE ICNP, Madrid, Spain, 13-16 Oct 2020. Acceptance Rate:16.8% (31/184) [PDF] [Presentation Video]Journal papers[TMC] “FDLoRa: ScalingDownlinkConcurrentTransmissionswithFullduplexLoRaGateways” Shiming Yu, Xianjin Xia, Ziyue Zhang, Ningning Hou, Yuanqing Zheng. IEEE Transactions on Mobile Computing (TMC), May. 2025. [TON] “XGate: ScalingLoRaCommunicationstoMassiveLogicalChannels” Shiming Yu, Xianjin Xia, Ningning Hou, Yuanqing Zheng, Tao Gu. IEEE/ACM Transactions on Networking (TON), Apr. 2025. [TON] “Hylink: Towards High Throughput LPWANs with LoRa Compatible Communication” Xianjin Xia, Qianwu Chen, Ningning Hou, Yuanqing Zheng, Tao Gu. IEEE/ACM Transactions on Networking (TON), Mar. 2024. [TON] “One Shot for All: Quick and Accurate Data Aggregation for LPWANs” Ningning Hou, Xianjin Xia, Yifeng Wang, Yuanqing Zheng. IEEE/ACM Transactions on Networking (TON), Jan. 2024. [[PDF][TON] “CloakLoRa: A Covert Channel over LoRa PHY” Ningning Hou, Xianjin Xia, Yuanqing Zheng. IEEE/ACM Transactions on Networking (TON), Sep. 2022. [PDF][TOSN] “Don’t Miss Weak Packets: Boosting LoRa Reception with Antenna Diversities” Ningning Hou, Xianjin Xia, Yuanqing Zheng. ACM Transactions on Sensor Networks (TOSN), Aug. 2022. [PDF][TOSN] “PCube: Scaling LoRa Concurrent Transmissions with Reception Diversities” Xianjin Xia, Ningning Hou, Yuanqing Zheng, Tao Gu. ACM Transactions on Sensor Networks (TOSN), Jun. 2022. [PDF][TOSN] “Jamming of LoRa PHY and Countermeasure” Ningning Hou, Xianjin Xia, Yuanqing Zheng. ACM Transactions on Sensor Networks (TOSN), Feb. 2023. [PDF]Demo[INFOCOM’20] “CLoRa: A Covert Channel over LoRa PHY” Ningning Hou, Yuanqing Zheng. In IEEE INFOCOM, Beijing, China, Apr. 2020. [PDF]FundsARC Linkage Projects Amount: 749,991.00 AUD, Year funded: 2025-2027 “Reliable and Efficient Massive Long Range Connectivity”Macquarie University Research Acceleration Scheme, AUD 50,000. “Bridging the Digital Divide: Reshaping Aged Care with Long-Range Integrated Sensing and Communication Technology”Project“Auto Coffee Machine Robot” In this project, a robot arm makes a cup of coffee for you on your order automatically! Explore [here!]TeachingLecturer, COMP8293 IoT Communication Networks and Security, 2024 Semester 1 Lecturer, COMP8294 Embedded IoT Hardware System and Devices, 2024 Semester 2 Lecturer, COMP8296 Artificial Intelligence and Machine Learning Techniques in IoT, 2024 Semester 2 Professional ServicesReviewer of conferences: IEEE INFOCOM 2019-2022, ACM SenSys 2019-2022, IEEE/ACM IoTDI 2021 Reviewer of journals: IEEE/ACM TON; ACM TOSN; IEEE TWC，TMC, TDSC, TCOM, TNSE; EURASIP TPC member of conferences: IEEE ICPADS 2022-2023, MSN 2023-2024, ICDCS 2024,BodySys 2025 Conference Program Chairs: Publicity chair of IEEE ICPADS 2024 Journal Guest Editor: electronics - Ubiquitous Computing and Mobile Computing (Special Issue) Journal Guest Editor: Drones - Drone Communication, Networking, and Trajectory Control in Urban Environments (Special Issue) Selected AwardsPeople’s Choice Award for the “[Three Minute Thesis (3MT) Competition]”(https://www.polyu.edu.hk/feng/publications/vibrant/issue-2/3-minute-thesis-competition/) (2021) IEEE INFOCOM student travel grant (2021) PolyU Annual Research Day (First prize in 2018, Second prize in 2019) National Scholarship for Encouragement (2014-2016) The Xingda Scholarship (2014-2016) Outstanding Graduates & Dissertation Award of Beijing University of Posts and Telecommunications (2017, top 5%)",
  "content_length": 9219,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:22"
}