{
  "name": "Nir Oren",
  "homepage": "https://www.abdn.ac.uk/people/n.oren",
  "status": "success",
  "content": "Professor Nir Oren | The University of Aberdeen Professor Nir Oren Professor Nir OrenPersonal Chair, Dean for Research Performance Accepting PhDs About Email Addressn.oren@abdn.ac.ukTelephone Number+44 (0)1224 274162Office AddressMeston 222School/DepartmentSchool of Natural and Computing SciencesSchool/DepartmentSenior Vice Principals External Memberships FHEA Research Research Overview I work in multi-agent systems, specialising in formal argumentation, computational trust theory, and norm-based reasoning. Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Supervising Accepting PhDsView Research Area Research Specialisms Artificial IntelligenceOperational Research Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Teaching Courses Algorithms and Data Structures CS2522Operating Systems CS3026Languages And Computability CS3518 Publications Page 1 of 17 Results 1 to 10 of 169 Discrimination of haematoma and peri-haematoma regions of sub-acute intracerebral haemorrhage using Field-Cycling Imaging at field strengths below 0.2 T 2025 - PublishedSenn, N., Mallikourti, V., Ross, J., Levi, R., Oren, N., Broche, L., Waiter, G., Macleod, M. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1177/17474930251379781Patient-Centred Explainability in IVF Outcome Prediction 2025 - PublishedSivaprasad, A., Reiter, E., McLernon, D., Tintarev, N., Bhattacharya, S., Oren, N. Working Papers: Working Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2506.18760Generalised BDI Planning 2025 - PublishedMeneguzzi, F., Pereira, R. F., Oren, N. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.5555/3709347.3743782Responsibility-aware Strategic Reasoning in Probabilistic Multi-Agent Systems 2025 - PublishedMu, C., Najib, M., Oren, N. Contributions to Journals: Conference Articles[ONLINE] DOI: https://doi.org/10.1609/aaai.v39i22.34492[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/f073fbff-d670-45d0-8f0c-8e06050015c6/download[ONLINE] https://aaai.org/aaai-publications/aaai-conference-proceedings/Measuring Responsibility in Multi-Agent Systems 2024 - PublishedMu, C., Oren, N. Working Papers: Preprint Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2411.00887[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/cec2d5c1-3f4e-4ec3-ba9f-aa83a5b1e585/downloadResponsibility-aware Strategic Reasoning in Probabilistic Multi-Agent Systems 2024 - PublishedMu, C., Najib, M., Oren, N. Working Papers: Preprint Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2411.00146[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/d84c79e4-3025-4991-9662-ac4d9186d74e/downloadAn Extension-based Approach for Computing and Verifying Preferences in Abstract Argumentation 2024 - PublishedMahesar, Q., Oren, N., Vasconcelos, W. W. Working Papers: Preprint Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2403.17653[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/eac8b9e7-ff40-4f39-ba6a-5984a71fd6e1/downloadUnlocking the potential of sensors for our environment: A call to action from a NERC writing retreat 2024 - PublishedBagshaw, L., Bee, E., Bhowmik, D., Bridle, H., Chan, K., Gaura, E., England, P., Halford, A., Lynch, I., Maniatis, G., Martin, P., Mao, F., Mukherjee, K., Naylor, M., Novellino, A., Oren, N., Pope, F., Schaap, A., Watson, C., Van De Wiel, M., Yüksel Ripley, B. Coventry University. 36 pagesBooks and Reports: Commissioned Reports[ONLINE] DOI: https://doi.org/10.18552/CSMM/2024/0001[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/57c464c0-ffa4-416c-8302-a42098f6a83f/downloadAbstract Weighted Based Gradual Semantics in Argumentation Theory 2024 - PublishedLibman, A., Oren, N., Yun, B. Working Papers: Preprint Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2401.11472[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/58a1020d-6b16-4495-b99e-5b43fa3dd9cb/downloadEvaluation of Human-Understandability of Global Model Explanations Using Decision Tree 2024 - PublishedSivaprasad, A., Reiter, E., Tintarev, N., Oren, N. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1007/978-3-031-50396-2_3[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/343a6a81-cb10-4512-8699-ea75cd204e7f/download[ONLINE] View publication in Scopus[ONLINE] https://ecai2023.eu/[ONLINE] https://xai3ecai2023.github.io/ Show 10 | 25 | 50 | 100 results per page Refine Books and Reports Commissioned Reports (1) Other Reports (1) Chapters in Books, Reports and Conference Proceedings Chapters (6) Chapters (Peer-Reviewed) (3) Conference Proceedings (89) Forewords and Postscripts (2) Contributions to Conferences Abstracts (1) Papers (20) Posters (1) Oral Presentations (1) Contributions to Journals Abstracts (1) Articles (28) Conference Articles (2) Review articles (1) Contributions to Specialist Publications Articles (1) Non-textual Forms Web Publications and Websites (1) Working Papers Working Papers (1) Preprint Papers (9) Update",
  "content_length": 5279,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:25"
}