{
  "name": "Nir Shavit",
  "homepage": "http://people.csail.mit.edu/shanir",
  "status": "success",
  "content": "Nir Shavit homepage Massachusetts Institute of Technology Nir Shavit Nir Shavit received B.Sc. and M.Sc. degrees in Computer Science from the Technion - Israel Institute of Technology in 1984 and 1986, and a Ph.D. in Computer Science from the Hebrew University of Jerusalem in 1990. Shavit is a co-author of the book The Art of Multiprocessor Programming. He is a recipient of the 2004 Gödel Prize in theoretical computer science for his work on applying tools from algebraic topology to model shared memory computability and of the 2012 Dijkstra Prize in Distributed Computing for the introduction of Software Transactional Memory. For many years his main interests were techniques for designing, implementing, and reasoning about multiprocessor algorithms. These days he is interested in understanding the relationship between deep learning and how neural tissue computes and is part of an effort to do so by extracting connectivity maps of brain, a field called connectomics. Nir is the principal investigator of the Multiprocessor Algorithmics Group and the Computational Connectomics Group. Phone: +1 (617) 324-8440 (Send me email. Do not leave messages). Address: Nir Shavit MIT Computer Science and Artificial Intelligence Laboratory The Stata Center 32 Vassar Street, 32-G622 Cambridge, MA 02139 Email: shanir at csail followed by a dot followed by mit then a dot followed by edu Publications: My List of Publications My multicore programming textbook \"The Art of Multiprocessor Programming.\" (selected for Intel Corporations Recommended Reading List) If you wish to teach a class based on the book, teaching materials (a complete set of Slides, all code and Homework Assignments can be found in the books companion. For Administrative help please contact: Joanne Hanley Tel.: +1 (617) 253-6054 joanne at csail.mit.edu MIT Computer Science and Artificial Intelligence Laboratory (CSAIL) 32 Vassar Street, 32-G646 Cambridge, MA 02139 Accessibility Updated: Thursday, October 8th, 2020",
  "content_length": 1993,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:25"
}