{
  "name": "Nirav Ajmeri",
  "homepage": "https://niravajmeri.github.io",
  "status": "success",
  "content": "Nirav Ajmeri -at- University of Bristol Nirav Ajmeri Bio | Publications | Professional Activities | Tools | Team Nirav Ajmeri Senior Lecturer in Artificial Intelligence School of Computer Science University of Bristol Merchant Venturers Building, Woodland Road, Bristol, BS8 1UB nirav.ajmeri@bristol.ac.uk Updates Mar 2024: AI for the Common Good Policy Dialogue Feb 2024: Talk at CCAIS Seminar Series Feb 2024: UKRI Reserarch Hub on AI for Collective Intelligence (AI4CI) launched Nov 2023: Talk at NC State AI in Society Seminars Jul 2023: Talk at AI for Industry 4.0 Apr 2023: HotSoS 2023 Feb 2023: Talk at Bath Sep 2022: Tutorial at Bristol Interactive AI Summer School (BIAS 2022) May 2022: COINE at AAMAS 2022 Feb 2022: Tutorial at AAAI 2022 Sep 2021: Tutorial at Bristol Interactive AI Summer School (BIAS 2021) May 2021: Tutorial at AAMAS 2021 on Ethics and Sociotechnial Systems Jul 2021: Tutorial at IJCAI 2020 on Ethics in Sociotechnical Systems Oct 2020: I am now a Lecturer in Artificial Intelligence at the University of Bristol Aug 2020: Tutorial at ACSOS 2020 on Ethics in Self-* Sociotechnical Systems May 2020: Best Blue Sky Paper award at AAMAS 2020 May 2020: Tutorial at AAMAS 2020 on Ethics in Sociotechnical Systems Biography I am a Senior Lecturer in Artificial Intelligence in the School of Computer Science at the University of Bristol (UoB). My research interests are in socially intelligent agents and multi-agent systems, emphasising ethics and privacy in socio-technical systems of humans, organisations, and software agents. My research seeks to design ethical socio-technical systems and develop computational agents that support their users in decision making considering societal norms and human values and preferences. I received a Ph.D. and an M.S. in Computer Science from North Carolina State University, and a B.E. in Computer Engineering from Sardar Vallabhbhai Patel Institute of Technology, Gujarat University. My doctoral dissertation was advised by Professor Munindar P. Singh. Prior to joining Bristol, I was a Postdoctoral Research Scholar in Computer Science at North Carolina State University, supported by NSA Science of Security Lablet. I was advised by Professor Munindar P. Singh and Professor Laurie Williams. I worked in the Multiagent Systems and Social AI Lab and with the Realsearch Group. In Fall 2017, I worked as research intern with the CTO research team of HERE Technologies. At HERE, I built location and trajectory privacy-preserving data publishing, query answering, and learning systems. From 2007 to 2012, I worked as a researcher in the Software Engineering Lab at Tata Research Development and Design Centre (TRDDC), India. At TRDDC, I worked on agile requirements engineering, social software and semantic web, and knowledge extraction, representation, reuse and reasoning. My research focused on making available domain knowledge (tacit as well as explicit) visible and accessible, so as to make it amenable for reconfiguration and reuse. Publications Publications from the University of Bristol 2025 [C24] Jessica Woodgate and Nirav Ajmeri. Combining Normative Ethics Principles to Learn Prosocial Behaviour. Proceedings of the 24th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), Detroit, May 2025, pages 2789--2791. [J18] Alex O. Davies, Nirav Ajmeri, and Telmo M. Silva Filho. A Comparative Study of GNNs and Rule-Based Methods for Synthetic Social Network Generation. IEEE Access, vol 13, 2025, pages 32198--32210. doi: 0.1109/ACCESS.2025.3541091 [W18] Alex O. Davies, Nirav Ajmeri, and Telmo M. Silva Filho. A Metric for the Balance of Information in Graph Learning. Proceedings of the 4th Annual AAAI Workshop on AI to Accelerate Science and Engineering (AI2ASE), Philadelphia, Feb 2025, pages 1--5. [C23] Jessica Woodgate, Paul Marshall, and Nirav Ajmeri. Operationalising Rawlsian Ethics for Fairness in Norm-Learning Agents. Proceedings of the 39th AAAI Conference on Artificial Intelligence (AAAI), Philadelphia, Feb 2025, pages 26382--26390. 2024 [J17] Seth Bullock, Nirav Ajmeri, Mike Batty, Michaela Black, John Cartlidge, Robert Challen, Cangxiong Chen, Jing Chen, Joan Condell, Leon Danon, Adam Dennett, Alison Heppenstall, Paul Marshall, Phil Morgan, Aisling O'Kane, Laura G. E. Smith, Theresa Smith, and Hywel T. P. Williams. Artificial intelligence for collective intelligence: A national-scale research strategy. Knowledge Engineering Review (KER), vol 39, 2024, pages 1--23. [C22] Sz-Ting Tzeng, Nirav Ajmeri, and Munindar P. Singh. Value-Based Rationale Improve Social Experience: A Multiagent Simulation Study. Proceedings of the 27th European Conference on Artificial Intelligence (ECAI), Santiago De Compostela, Oct 2024, pages 3612--3619. [J16] Vaibhav Garg, Hui Guo, Nirav Ajmeri, Saikath Bhattacharya, and Munindar P. Singh. Understanding Mobile App Reviews to Guide Misuse Audits. Communications of the ACM (CACM), vol 67, number xx, 2024, pages 1--9. [J15] Jessica Woodgate and Nirav Ajmeri. Macro Ethics Principles for Responsible AI Systems. ACM Computing Surveys (ACM CSUR), vol 56, number 11, 2024, pages 1--37. doi: 10.1145/3672394. [W17] Daniel E. Collins, Conor J. Houghton, and Nirav Ajmeri. Fostering Multi-Agent Cooperation through Implicit Responsibility. Proceedings of the International Workshop on Citizen-Centric Multiagent Systems (CMAS), Auckland, May 2024, pages 1--21. [C21] Sz-Ting Tzeng, Nirav Ajmeri, and Munindar P. Singh. Norm Enforcement with a Soft Touch: Faster Emergence, Happier Agents. Proceedings of the 23th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), Auckland, May 2024, pages 1--9. 2023 [W16] Alex O. Davies, Riku Green, Nirav Ajmeri, and Telmo M. Silva Filho. Its All Graph To Me: Single-Model Graph Representation Learning on Multiple Domains. Proceedings of the NeurIPS Workshop on New Frontiers in Graph Learning, pages 1--15, 2023. [W15] Alex O. Davies, Nirav Ajmeri, and Telmo M. Silva Filho. Size Matters: Large Graph Generation with HIGGS. Proceedings of the NeurIPS Workshop on Synthetic Data Generation with Generative AI, pages 1--19, 2023. [W14] Kopo M Ramokapane, Lizzie Coles-Kemp, Nikhil Patnaik, Rui Huan, Nirav Ajmeri, Genevieve Liveley, and Awais Rashid. Towards Equitable Privacy. Proceedings of the Workshop on Inclusive Privacy and Security (WIPS) @ SOUPS, Aug 2023, pages 1--6. [W13] Daniel E. Collins, Conor J. Houghton, and Nirav Ajmeri. Social Value Orientation and Integral Emotions in Multi-Agent Systems. Proceedings of the International Workshop on Coordination, Organizations, Institutions, Norms, and Ethics for Governance of Multi-Agent Systems (COINE), London, May 2023, pages 1--21. [J14] Amanul Haque, Nirav Ajmeri, and Munindar P. Singh. Understanding Dynamics of Polarization via Multiagent Social Simulation. AI & Society: Journal of Knowledge, Culture and Communication, vol 38, number 4, 2023, pages 1373--1389. doi: 10.1007/s00146-022-01626-5. 2022 [J13] Mehdi Mashayekhi, Nirav Ajmeri, George F. List, and Munindar P. Singh. Prosocial Norm Emergence in Multiagent Systems. ACM Transactions on Autonomous and Adaptive Systems (TAAS), vol 17, number 1--2, 2022, pages 3:1--3:24. doi: 10.1145/3540202. [C20] Rishabh Agrawal, Nirav Ajmeri, and Munindar P. Singh. Socially Intelligent Genetic Agents for the Emergence of Explicit Norms. Proceedings of the 31th International Joint Conference on Artificial Intelligence (IJCAI), Vienna, July 2022, pages 10--16. [C19] Pradeep K. Murukannaiah, Nirav Ajmeri and Munindar P. Singh. Enhancing Creativity as Innovation via Asynchronous Crowdwork. Proceedings of the 14th ACM Web Science Conference (WebSci), Barcelona, June 2022, pages 66--74. [J12] Veljko Dubljević, Sean Douglas, Jovan Milojevich, Nirav Ajmeri, William A. Bauer, George F. List, and Munindar P. Singh. Moral and Social Ramifications of Autonomous Vehicles: A Qualitative Study of the Perceptions of Professional Drivers. Behaviour & Information Technology, vol 41, number xx, May 2022, pages 1--15. In press. [C18] Jessica Woodgate and Nirav Ajmeri. Macro Ethics for Governing Equitable Sociotechnical Systems. Proceedings of the 21st International Conference on Autonomous Agents and Multiagent Systems (AAMAS), Blue Sky Idea Track, Auckland, May 2022, pages 1824--1828. [W12] Sz-Ting Tzeng, Nirav Ajmeri, and Munindar P. Singh. Fleur: Social Values Orientation for Robust Norm Emergence. Proceedings of the International Workshop on Coordination, Organizations, Institutions, Norms, and Ethics for Governance of Multi-Agent Systems (COINE), Auckland, May 2022, pages 185--200. [W11] Phillip Sloan and Nirav Ajmeri. Commitment-Based Negotiation Semantics. Proceedings of the 10th International Workshop on Engineering Multi-Agent Systems (EMAS), Auckland, May 2022, pages 1--20. [W10] Amanul Haque, Nirav Ajmeri, and Munindar P. Singh. Understanding Dynamics of Polarization via Multiagent Social Simulation. Proceedings of the 3rd International Workshop on Autonomous Agents for Social Good (AASG), Auckland, May 2022, pages 1--9. [J11] Rezvan Mahdavi-Hezaveh, Nirav Ajmeri, and Laurie Williams. Feature toggles as code: Heuristics and metrics for structuring feature toggles. Information and Software Technology (IST), vol 145, January 2022, article 106813, pages 1--14. doi: 10.1016/j.infsof.2021.106813. 2021 [J10] Veljko Dubljević, George F. List, Jovan Milojevich, Nirav Ajmeri, William A. Bauer, Munindar P. Singh, Eleni Bardaka, Thomas A. Birkland, Charles H. W. Edwards, Roger C. Mayer, Ioan Muntean, Thomas M. Powers, Hesham A. Rakha, Vance A. Ricks, and M. Shoaib Samandar. Toward a Rational and Ethical Sociotechnical System of Autonomous Vehicles: A Novel Application of Multi-Criteria Decision Analysis. PLOS One, vol 16, number 8, August 2021, article e0256224, pages 1--17. doi: 10.1371/journal.pone.0256224. [W9] Sz-Ting Tzeng, Nirav Ajmeri, and Munindar P. Singh. Noe: Norm Emergence and Robustness Based on Emotions in Multiagent Sy",
  "content_length": 22947,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:24"
}