{
  "name": "Nirmalya Roy",
  "homepage": "https://mpsc.umbc.edu/nroy",
  "status": "success",
  "content": "Mobile Pervasive & Sensor Computing - nroySearch this siteEmbedded FilesSkip to main contentSkip to navigationDr. Nirmalya RoyNirmalya Roy is currently a Professor in the Department of Information Systems at University of Maryland Baltimore County. He directs the Mobile, Pervasive and Sensor Computing (MPSC) Lab. He was a Clinical Assistant Professor in the School of Electrical Engineering and Computer Science at Washington State University from January 2012 to June 2013. Prior to that, he worked as a Research Scientist at Institute for Infocomm Research (I2R), Singapore from 2010 to 2011. He was a postdoctoral fellow in Electrical and Computer Engineering Department at The University of Texas at Austin from 2008 to 2009. He received his Ph.D. and M.S. in Computer Science and Engineering from The University of Texas at Arlington in 2008 and 2004 respectively. He did his Bachelors in Computer Science and Engineering from Jadavpur University, India in 2001.Download my CV here:CVResearch Interests:Pervasive Computing and Middleware (activity recognition, energy efficient remote monitoring, QoI, physiological data modeling)Wireless SensorNetworks (sensor data stream processing, sensor-driven decision making, embedded sensor system)Smart Environments (sensor-driven smart healthcare and rehabilitation, a fine-grained building energy monitoring and control)Education:Ph.D. in Computer Science & Engineering at The University of Texas at Arlington, 2008M.S. in Computer Science & Engineering at The University of Texas at Arlington, 2004Bachelors in Computer Science and Engineering at Jadavpur University, 2001Publications: See lab publications here. Contact:Office: ITE 421Address: 1000 Hilltop Circle ITE Building Baltimore MD 21250Email: nroy (at) umbc (dot) edu Report abuseReport abuse",
  "content_length": 1805,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:25"
}