{
  "name": "Nirmala Shenoy",
  "homepage": "https://www.rit.edu/gccis/nirmala-shenoy",
  "status": "success",
  "content": "Nirmala Shenoy | Golisano College of Computing and Information Sciences | RIT RIT Logo with Text Nirmala Shenoy Professor School of Information Golisano College of Computing and Information Sciences nxsvks@rit.edu 585-475-4887 Office Location GOL-2307 Nirmala Shenoy Professor School of Information Golisano College of Computing and Information Sciences Education BE, ME, University of Madras (India); Ph.D., University of Bremen (Germany) nxsvks@rit.edu 585-475-4887 Personal Links Personal Website Curriculum Vitae LinkedIn Currently Teaching NSSA-242Wireless Networking3 CreditsThis course is designed to provide the student with an understanding of the protocols, principles and concepts of radio communication as they apply to wireless data networking (802.11) for local area networks and peripherals. As its basis it uses the fundamental concepts and technologies learned in Introduction to Routing and Switching, and expands upon them to include other contemporary and emerging technologies. Topics including WLANs, wireless network operation, network integration, construction and network design will be discussed. Modulation techniques, measurement standards, nomenclature, equipment and theory behind transmissions in this portion of the electromagnetic spectrum will be examined.NSSA-245Network Services3 CreditsThis course will investigate the protocols used to support network based services and the tasks involved in configuring and administering those services in virtualized Linux and Windows internet working environments. Topics include an overview of the TCP/IP protocol suite, in-depth discussions of the transport layer protocols, TCP and UDP, administration of network based services including the Dynamic Host Configuration Protocol (DHCP), Domain Name Service (DNS), Secure Shell (SSH), and Voice Over IP (VoIP). Students completing this course will have thorough theoretical knowledge of the Internet Protocol (IP), the Transport Control Protocol (TCP), and the User Datagram Protocol (UDP), as well as experience in administering, monitoring, securing and troubleshooting an internet work of computer systems running these protocols and services.NSSA-441Advanced Routing and Switching3 CreditsAdvanced Routing and Switching covers advanced networking technologies available to enterprises. Protocol options and their evolutions over the years, the growth in complexity and its impacts are explored in depth. Topics include: VLANs and VLAN Hierarchies, Loop- Avoidance in customer, provider and provider backbone networks such as RSTP and Shortest Path Bridging, , IPv4 and IPv6 coexistence issues, Routing protocols with IPv4 and IPv6 for inter and intra-AS routing, MobileIP, queuing and Quality of service routing and congestion control in the Internet, MultiProtocol Label Switching, Routing and Switching in wireless networks In the News October 30, 2020 New IEEE standard will significantly improve performance in switched data center networks Computing researchers at RIT have developed a new loop-avoidance protocol that solves a key challenge faced in switched networks, including many of the data center networks that run our internet and cloud services. More News Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 3402,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:27"
}