{
  "name": "Nirupam Roy",
  "homepage": "https://www.cs.umd.edu/~nirupam",
  "status": "success",
  "content": "Nirupam Roy, Assistant Professor, UMD College Park Nirupam Roy Assistant Professor, Dept. of CS, UMD College Park Director, iCoSMoS research lab niruroy@umd.edu,    Office:  IRB 5240 Research interests Core: Wireless Networking, Mobile Computing, Communication, Sensing Application: IoT, Localization, Healthcare, Security, Wearables Visit our group website for current research updates. We are looking for motivated Ph.D. students. Teaching Spring 2025 CMSC 417: Computer Networks Fall 2024 CMSC 715: Wireless and Mobile Systems for the IoT Selected Publications Papers MobiSys 2022 SPiDR: Ultra-low-power Acoustic Spatial Sensing for Micro-robot Navigation Yang Bai (co-primary), Nakul Garg (co-primary), Nirupam Roy Best paper award Video IASA 2022 VoiceFind: Noise-Resilient Speech Recovery in Commodity Headphones Irtaza Shahid, Yang Bai, Nakul Garg, Nirupam Roy Info AVAR 2022 Personal active soundfield control (PASCAL) framework Shoken Kaneko, Irtaza Shahid, Nirupam Roy, Nail Gumerov, Ramani Duraiswami Info MobiSys 2021 Owlet: enabling spatial information in ubiquitous acoustic devices Nakul Garg (co-primary), Yang Bai (co-primary), Nirupam Roy Best demo award Website Talk InterNoise 2021 Regularized spherical harmonics-domain spatial active noise cancellation in a reverberant room Shoken Kaneko, Nirupam Roy, Nail Gumerov, Ramani Duraiswami Info HotMobile 2020 Enabling Self-defense in Small Drones Nakul Garg, Nirupam Roy Info Slides SenSys 2020 Spying with Your Robot Vacuum Cleaner: Eavesdropping via Lidar Sensors Sriram Sami, Yimin Dai, Sean Rui Xiang Tan, Nirupam Roy, Jun Han Best poster runner-up award Info Ph.D. Dissertation Inaudible Acoustics: Techniques and Applications Nirupam Roy CSL Ph.D. thesis award, UIUC Info Video SIGCOMM 2018 MUTE: Bringing IoT to Noise Cancellation Sheng Shen, Nirupam Roy, Junfeng Guan, Haitham Hassanieh, Romit Roy Choudhury Slides Video NSDI 2018 Inaudible Voice Commands: The Long-Range Attack and Defense Nirupam Roy, Sheng Shen, Haitham Hassanieh, Romit Roy Choudhury Slides Video MobiSys 2017 BackDoor: Making Microphones Hear Inaudible Sounds Nirupam Roy, Haitham Hassanieh, Romit Roy Choudhury Best paper award Audience choice award Slides Video NSDI 2016 Ripple II: Faster Communication through Physical Vibration Nirupam Roy, Romit Roy Choudhury Slides Website MobiSys 2016 Listening through a Vibration Motor Nirupam Roy, Romit Roy Choudhury Slides Website ICNP 2016 Compressing Backoff in CSMA Networks Mahanth K Gowda, Nirupam Roy, Romit Roy Choudhury, Srihari Nelakuditi Slides NSDI 2015 Ripple: Communicating through Physical Vibrations Nirupam Roy, Mahanth K Gowda, Romit Roy Choudhury Slides Website MobiSys 2014 I am a Smartphone and I can Tell my Userâs Walking Direction Nirupam Roy, He Wang, Romit Roy Choudhury Outstanding MS thesis award Slides Website NDSS 2014 AccelPrint: Imperfections of Accelerometers Make Smartphones Trackable Nirupam Roy, S. Dey (Co-primary), W. Xu, R. Roy Choudhury, S. Nelakuditi Slides HotNets 2014 Infrastructure Mobility: A What-if Analysis Mahanth K Gowda, Nirupam Roy, Romit Roy Choudhury Slides HotWireless 2014 Backing out of Linear Backoff in Wireless Networks Mahanth K Gowda, Nirupam Roy, Romit Roy Choudhury, Srihari Nelakuditi Slides Poster/Demo MobiSys 2022 Poster: Ultra-low-power Acoustic Imaging Yang Bai (co-primary), Nakul Garg (co-primary), Nirupam Roy Write-up Poster MobiSys 2021 Demo: Microstructure-guided Spatial Sensing for Low-power IoT Nakul Garg (co-primary), Yang Bai (co-primary), Nirupam Roy Best demo award Write-up Poster HotMobile 2020 Poster: Acoustic Sensing for Detecting Projectile Attacks on Small Drones Nakul Garg, Nirupam Roy Write-up Poster SenSys 2020 Poster: LidarPhone: Acoustic Eavesdropping using a Lidar Sensor Sriram Sami, Sean Rui Xiang Tan, Yimin Dai, Nirupam Roy, Jun Han Best poster runner-up award Write-up Award MobiCom 2018 Poster: Networked Acoustics Around Human Ears Sheng Shen, Nirupam Roy, Junfeg Guan, Haitham Hassanieh, Romit Roy Choudhury Write-up MobiSys 2017 Demo: Riding the Non-linearities to Record Ultrasound with Smartphones Nirupam Roy, Haitham Hassanieh, Romit Roy Choudhury Write-up Poster MobiCom 2016 Assessing Header Impacts in Soccer with Smartball Theodore Stone et. al., Student Mentor: Nirupam Roy Student research competition winner Write-up Poster NSDI 2016 Vibration: A new mode of communication Nirupam Roy, Romit Roy Choudhury Write-up Poster Google 2015 Ripple: Communicating through Physical Vibration Nirupam Roy, Romit Roy Choudhury Google Mobile Faculty Summit 2015 Poster MobiSys 2014 Demo: I am a Smartphone and I can Tell my Userâs Walking Direction Nirupam Roy, He Wang, Romit Roy Choudhury Write-up Poster HotMobile 2013 Leveraging Imperfections of Sensors for Fingerprinting Smartphones Sanorita Dey, Nirupam Roy, Wenyuan Xu, Srihari Nelakuditi Best poster runner-up award Write-up Poster Patents Granted Communicating through physical vibration Nirupam Roy, Romit Roy Choudhury, Mahanth K Gowda Patent number: US 9608848 B2,   March 28, 2017 Patent Pending Unsupervised indoor localization and heading directions estimation Romit Roy Choudhury, He Wang, Nirupam Roy, Souvik Sen, et. al. Patent number: US 20150281910 A1,   October 1, 2015 Patent Awards & Honors Best paper award, MobiSys 2022 SPiDR, an ultra-low-power spatial sensing system for miniature mobile robots, wins best paper award at MobiSys 2022. Info Best demo award, MobiSys 2021 Owlet, the low-power and miniaturized spatial sensing system, wins best demo award at MobiSys 2021. Info Best poster runner-up award, SenSys 2020 LidarPhone wins best poster runner-up award at SenSys 2020. LidarPhone shows how the lidar sensor can be exploited to extract traces of spoken words and uncovers an acoustic eavesdropping threat. Info CSL Ph.D. Thesis Award, 2019 The thesis “Inaudible Acoustics: Techniques and Applications” wins the CSL Ph.D. thesis award 2019 at UIUC. Info Info Best paper award at MobiSys, 2017 “BackDoor: Making Microphones Hear Inaudible Sounds” wins the best paper award and the audience-choice award at MobiSys 2017. Info Qualcomm Innovation Fellowship (QInF) finalist, 2016 “The QInF program is focused on recognizing, rewarding, and mentoring innovative PhD students across a broad range of technical research areas, based on Qualcommâs core values of innovation, execution and teamwork.” Info Bahl fellowship as outstanding graduate student, 2015-2017 “The fellowship was established by Dr. Lalit R. Bahl and Kavita Kinra and will provide graduate fellowships to students in the Electrical and Computer Engineering Department, UIUC” Info Valkenburg award for outstanding research, 2015 “Mac Van Valkenburg symbolizes the highest quality of engineering education in Illinois and, indeed, in the country. The award, which is given annually to one or two outstanding PhD candidates in ECE, UIUC.” Info Outstanding thesis award for MS thesis, 2013 The MS thesis was selected for the outstanding thesis award 2013 at the University of South Carolina, Columbia. Info Info Best poster/demo runner-up at HotMobile, 2013 The poster on smartphone fingerprinting (AccelPrint) won the second prize at the HotMobile 2013, the International Workshop on Mobile Computing Systems and Applications. Info Best undergraduate thesis of the institute, 2007 The undergraduate thesis on the robotic navigation assistant was selected as the best undergraduate thesis of the year 2007 at the Indian Institute of Engineering, Science, and Technology (IIEST, formerly B.E.College), Shibpur, India Info 10th rank in Secondary Examination, 2001 Placed 10th among around 700,000 examinees, according to the merit list published by 'West Bengal Board of Secondary Education', India. Info Media Coverage AccelPrint BackDoor VibraPhone",
  "content_length": 7800,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:27"
}