{
  "name": "Nisansa de Silva",
  "homepage": "https://nisansads.staff.uom.lk",
  "status": "success",
  "content": "Nisansa de Silva Nisansa de Silva University of Moratuwa About Curriculum Vitae Publications Research Group Teaching Other Interests Contact Calendar Copyright by Nisansa de Silva Last Modified : Thu, 23 October 2025 05:07:05 Nisansa Dilushan de Silva I am a lecturer at the Department of Computer Science & Engineering, University of Moratuwa, Sri Lanka. I obtained my Ph.D (2020, advisor: Dejing Dou) and MS (2016) degrees in Computer and Information Science from University of Oregon, USA and my BSc (Hons) in Computer Science & Engineering (2011) degree from University of Moratuwa. I joined University of Moratuwa as a lecturer in 2011. From 2013 to 2014, I worked as a researcher at LIRNEasia. In 2018, I worked as a Givens Associate at Argonne National Laboratory, USA. I have over 80 peer reviewed publications in the field of computer science, mostly under the subfields of Natural Language Processing and Artificial Intelligence, earning more than 1400 citations. I am also an associate member of the IESL. Nisansa de Silva ( Dr. Nisansa Dilushan de Silva Ph.D.), NisansaDdS w, e Computer Scientist (Get IEEE bio) Professional Experience Present 2020 Senior Lecturer Department of Computer science & Engineering, University of Moratuwa,Sri Lanka 2021 2020 Research Fellow LIRNEasia,Sri Lanka 2020 2014 Graduate Research/Teaching Fellow University of Oregon, Department of Computer and Information Science,USA. 2018 2018 Givens Associate Argonne National Laboratory,USA. 2020 2011 Lecturer Department of Computer science & Engineering, University of Moratuwa,Sri Lanka 2014 2013 Researcher LIRNEasia,Sri Lanka 2014 2013 Visiting Lecturer Northshore College of Business and Technology,Sri Lanka Education Ph.D. 2020 Ph.D. in Computer & Information Science University of Oregon, USA MS 2016 MS in Computer & Information Science University of Oregon, USA BSc2011 B.Sc Engineering (Hons)in Computer Science & Engineering University of Moratuwa, Sri Lanka Featured Research Party-based Sentiment Analysis Pipeline for the Legal DomainS. Jayasinghe, L. Rambukkanage, A. Silva, N. de Silva, and A. Perera2021 21st International Conference on Advances in ICT for Emerging Regions (ICter), 2021, pp. 171-176, Since the advent of research to automate existing manual language workflows, legal domain has risen as a key area. When it comes to making the process of court cases more efficient with the said automation, legal information extraction is vital for legal professionals. In this study, we propose a unified pipeline to annotate party-based sentiment for court cases which reduces manual work. To achieve this end, we combined two state-of-the-art models into a single workflow. The first model extracts the entities which represent each party in a court case, while the second model analyzes the sentiment with respect to each party in a given sentence of a court case. In this study we propose two approaches for defining the pipeline which maps the output of the party extraction system into the party-based sentiment analysis system. Further, we propose improvements to the existing party extraction system.",
  "content_length": 3118,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:29"
}