{
  "name": "Nisansa Dilushan de Silva",
  "homepage": "https://nisansads.staff.uom.lk",
  "status": "success",
  "content": "Nisansa de Silva Nisansa de Silva University of Moratuwa About Curriculum Vitae Publications Research Group Teaching Other Interests Contact Calendar Copyright by Nisansa de Silva Last Modified : Thu, 23 October 2025 05:07:05 Nisansa Dilushan de Silva I am a lecturer at the Department of Computer Science & Engineering, University of Moratuwa, Sri Lanka. I obtained my Ph.D (2020, advisor: Dejing Dou) and MS (2016) degrees in Computer and Information Science from University of Oregon, USA and my BSc (Hons) in Computer Science & Engineering (2011) degree from University of Moratuwa. I joined University of Moratuwa as a lecturer in 2011. From 2013 to 2014, I worked as a researcher at LIRNEasia. In 2018, I worked as a Givens Associate at Argonne National Laboratory, USA. I have over 80 peer reviewed publications in the field of computer science, mostly under the subfields of Natural Language Processing and Artificial Intelligence, earning more than 1400 citations. I am also an associate member of the IESL. Nisansa de Silva ( Dr. Nisansa Dilushan de Silva Ph.D.), NisansaDdS w, e Computer Scientist (Get IEEE bio) Professional Experience Present 2020 Senior Lecturer Department of Computer science & Engineering, University of Moratuwa,Sri Lanka 2021 2020 Research Fellow LIRNEasia,Sri Lanka 2020 2014 Graduate Research/Teaching Fellow University of Oregon, Department of Computer and Information Science,USA. 2018 2018 Givens Associate Argonne National Laboratory,USA. 2020 2011 Lecturer Department of Computer science & Engineering, University of Moratuwa,Sri Lanka 2014 2013 Researcher LIRNEasia,Sri Lanka 2014 2013 Visiting Lecturer Northshore College of Business and Technology,Sri Lanka Education Ph.D. 2020 Ph.D. in Computer & Information Science University of Oregon, USA MS 2016 MS in Computer & Information Science University of Oregon, USA BSc2011 B.Sc Engineering (Hons)in Computer Science & Engineering University of Moratuwa, Sri Lanka Featured Research Some Languages are More Equal than Others: Probing Deeper into the Linguistic Disparity in the NLP WorldS. Ranathunga, and N. de Silva arXiv preprint arXiv:2210.08523, 2022, Linguistic disparity in the NLP world is a problem that has been widely acknowledged recently. However, different facets of this problem, or the reasons behind this disparity are seldom discussed within the NLP community. This paper provides a comprehensive analysis of the disparity that exists within the languages of the world. We show that simply categorising languages considering data availability may not be always correct. Using an existing language categorisation based on speaker population and vitality, we analyse the distribution of language data resources, amount of NLP/CL research, inclusion in multilingual web-based platforms and the inclusion in pre-trained multilingual models. We show that many languages do not get covered in these resources or platforms, and even within the languages belonging to the same language group, there is wide disparity. We analyse the impact of family, geographical location, GDP and the speaker population of languages and provide possible reasons for this disparity, along with some suggestions to overcome the same.",
  "content_length": 3221,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:29"
}