{
  "name": "Nisheeth K. Vishnoi",
  "homepage": "https://cpsc.yale.edu/people/nisheeth-vishnoi",
  "status": "success",
  "content": "Nisheeth Vishnoi | Professor | Yale Engineering Skip to Content Nisheeth Vishnoi A. Bartlett Giamatti Professor of Computer Science Email Room / Office:Room 319 Office Address:17 Hillhouse Avenue New Haven, CT 06511 Mailing Address:P.O. Box 208285 New Haven, CT 06520 Website: Research Website About Nisheeth Vishnoi Degrees Ph.D., Georgia Institute of Technology B. Tech, Indian Institute of Technology Bombay Perspectives My research spans several areas of theoretical computer science: from approximability of NP-hard problems, to combinatorial, convex and non-convex optimization, to tackling algorithmic questions involving dynamical systems, stochastic processes, and polynomials. I am also broadly interested in understanding and addressing some of the key questions that arise in nature and society from the viewpoint of theoretical computer science. Here, my current focus is on natural algorithms, emergence of intelligence, and questions at the interface of AI, Ethics, and Society. Selected Awards & Honors Best Technical Paper Award at ACM FAT* (2019) Invited Paper in Innovations in Theoretical Computer Science (2017) IIT Bombay Young Alumni Achievers Award (2016) Indian National Science Academy Young Scientist Medal (2011) IBM Research Pat Goldberg Memorial Award for 2005 (2006) Best Paper Award at IEEE Foundations of Computer Science (FOCS) (2005) Selected Publications Controlling Polarization in Personalization: An Algorithmic Approach, L. Elisa Celis, Sayash Kapoor, Farnood Salehi, Nisheeth K. Vishnoi, ACM FAT*, 2019. Dimensionally Tight Running Time Bounds for Second-Order Hamiltonian Monte Carlo, Oren Mangoubi, Nisheeth K. Vishnoi, NeurIPS, 2018. IRLS and Slime Mold: Equivalence and Convergence, Damian Straszak, Nisheeth K. Vishnoi, Innovations in Theoretical Computer Science, 2017. The Unique Games Conjecture, Integrality Gap for Cut Problems and the Embeddability of Negative Type Metrics into ℓ1, Subhash Khot, Nisheeth K. Vishnoi, Journal of the ACM, 62(1), 2015. Lx=b (Laplacian Solvers and Their Algorithmic Applications), Nisheeth K. Vishnoi, Foundations and Trends in Theoretical Computer Science, Volume 8, Issue 1-2, 2012. Related Content Vishnoi named Fellow of the American Mathematical Society",
  "content_length": 2241,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:32"
}