{
  "name": "Nitesh Saxena",
  "homepage": "https://nsaxena.engr.tamu.edu",
  "status": "success",
  "content": "Nitesh Saxena, Professor, Computer Science and Engineering Skip to primary navigation Skip to main content Skip to primary sidebarMenu Greetings! I am a Full Professor of the department of Computer Science and Engineering at the Texas A&M University (A&M), and the Associate Director of Texas A&M Global Cyber Research Institute (GCRI),  and served as a Dean’s Research Fellow, 2022-23, at the College of Engineering & Texas A&M Engineering Experiment Station. Broadly, I work in the areas of computer and network security, and applied cryptography. My particular focus is on fundamental, transformative, inter-disciplinary and game changing research, which can go beyond the traditional confines of academic domain and make a positive impact to the lives of end users hopefully relatively quickly. I am currently looking for a post-doc. My students and I run the SPIES — Security and Privacy In Emerging computing and networking Systems — research lab. I also serve on the leadership team of the Texas A&M Connected Intelligence Initiative (TICI) as the Thrust Area Director of Systems Security. Besides research, I have a major emphasis on workforce development, especially in areas related to cybersecurity. In this line, I am currently a co principal Investigator of the  TAMU CyberCorps Scholarship for Service program, funded by NSF. Previously, I was the principal investigator and director of the UAB CyberCorps Scholarship for Service (SFS) program (2017-2021), and had served as the Co-Director of UAB’s M.S. program in Cyber-Security (2012-2021).  I also co-led UAB’s Center for Cyber Security (2018-2021), which is an NSA/DHS National Center of Academic Excellence in Cyber Defense Research (CAE-R). My research has been externally supported by NSF (multiple grants and multiple programs, including SaTC, CICI and SFS), DOD, NSA, NIJ/DoJ, Google (2 Faculty Research Awards), Comcast, Cisco, Microsoft Research, MxD, Intel, Nokia, and Research in Motion. I obtained my Ph.D. in Information and Computer Science from UC Irvine. I hold an M.S. in Computer Science from UC Santa Barbara, and a Bachelor’s degree in Mathematics and Computing from Indian Institute of Technology, Kharagpur, India. Before joining A&M, I was on the faculty of the department of Computer Science at University of Alabama at Birmingham (UAB), and before then, I was on the faculty of the department of Computer Science and Engineering at the New York University Tandon School of Engineering. Note for Students:  I am actively looking for exceptionally bright prospective PhD/MS/BS students to join my research group. If interested, please contact me with your CV. Recent Selected Contributions/Grants/Awards (2013-2025): College of Engineering Dean’s Excellence Award, 2025 Distinguished Paper Award, ACM CCS 2025 Thrust Area Director (Systems Security), Texas A&M Connected Intelligence Initiative (TICI), 2024 PI on a $473,000 AFRL grant on privacy-preserving machine learning, 2024 Leading a $75,000 MxD Grant, 2023 Associate Director, Global Cyber Research Institute (GCRI), 2023 TAMU Sole PI on a $6.2M Multidisciplinary University Research Initiatives (MURI) Award, 2023, based on our neuro security work. Co Leading a $687K grant from the National Security Agency (NSA), 2023 Leading a $1.2 Million NSF Medium Secure and Trustworthy Cyberspace Grant (SaTC) Grant, 2022 Co Leading TAMU’s $4.5 Million NSF Scholarship for Service (SFS) Grant, 2022 Dean’s Research Fellow, 2022 Fortune’s Top Master’s Program in Cybersecurity, 2022 (architected  and directed for a decade previously at UAB) Leading a $75,000 MxD Grant, 2021 $500,000 NSF Cybersecurity Innovation for Cyberinfrastructure (CICI) Grant, 2021 Leading a $900,000 NSF Medium Secure and Trustworthy Cyberspace Grant (SaTC) Grant, 2020 A $550,000 supplement on our ongoing grant NSF Scholarship for Service (SFS) Grant, 2019 Runner Up, The Mark Weiser Best Paper Award, Percom 2019 Research grant from Microsoft Research to study security warnings via the Neuro Security methodology introduced at the SPIES lab, 2019 NSF Secure and Trustworthy Cyberspace Grant (SaTC) Grant, 2017 Graduate School Dean’s Award for Excellence in Mentorship, 2016/17 NSF Scholarship for Service (SFS) Grant, 2016/17 The NIJ GRF-STEM fellowship, 2016/17 (for my PhD student, Ajaya Neupane) NSF Secure and Trustworthy Cyberspace Grant (SaTC) Grant, 2015 NSF Cybersecurity Innovation for Cyberinfrastructure (CICI) Grant, 2015 Comcast Research Award, 2014 NDSS 2014 Distinguished Paper Award Google Research Award, 2013 Cisco Grant, 2013 Papers at: TIFS’25. Oakand’25, USENIX Sec’25, CCS’25, WWW’25 (2 papers); TMC’24, CCS’24 (2 papers); TOPS’23, CSUR’23, Oakland’23, USENIX Sec’23; CCS’23, MobiCom’23, MobiSys’23;  TMC’22, EuroS&P’22, ICDCS’22, WiSec’22 (2 papers); ACM TOPS’21, TMC’21, MobiCom’21, EuroS&P’21 (2 papers), AsiaCCS’21 (3 papers), WiSec’21 (2 papers); ACSAC’20 (3 papers), WiSec’20; NDSS’19, Percom’19, ACSAC’19 (2 papers); Oakland’18, TDSC’18, TMC’18, ACSAC’18, WiSec’18; CCS’17 (2 papers), WWW’17, TDSC’17, ICDCS’17, ACSAC’17, WiSec’17 (2 papers); CCS’16, NDSS’16, ACSAC’16 (2 papers), WiSec’16 (2 papers), TIFS’16; CCS’15, ACSAC’15 (2 papers), ESORICS’15, Percom’15, TIFS’15; CCS’14,   NDSS’14 (2 papers), Percom’14, ICME’14; TETC’13, TIFS’13, TDSC’13, WiSec’13 Extensive Media Coverage (> 350 articles) including NY Times, MSN, NBC, Fox, CNN, Discovery News, Yahoo! Finance, Yahoo! Tech, CNBC, CNET, MIT Tech Review, ACM TechNews, Bloomberg, Economist, ZDNet, CACM News, Slashdot, Guardian, Register, HackerNews, Bleeping Computer, Science Daily, Motherboard and Conversation. Editorial Boards: Senior Area Editor, IEEE Transactions on Information Forensics and Security (TIFS) (since 2025) ACM Transactions on Privacy and Security (TOPS) (since 2021) ACM AI Letters (AILET) (since 2025) Proceedings on Privacy Enhancing Technologies (PoPETs) (since 2019) IEEE Transactions on Information Forensics and Security (TIFS) (from 2013 to 2016) Springer’s International Journal of Information Security (IJIS) (from 2013 to 2018) Recent Program Committees: 2024: CNS (TPC Area Chair), ACSAC, MetaCom, ICICS 2023: CCS, ACSAC, CNS, ICICS, MetaCom 2022: USENIX Security, CCS, ACSAC, ACNS, ASIACCS, WWW (S&P track), WiSec 2021: CNS (TPC Co-Chair); WWW (S&P Track), ASIACCS, PETS, SADFE, WiSec, ACSAC, ICICS, WPES 2020: SecureComm (TPC Co-Chair), IJCB (Area Chair), Oakland, PETS, ASIACCS; WWW (S&P Track), ACSAC, ACSAC Artifact Evaluation, WiSec, CNS, ICICS 2019: Oakland, CNS (TPC Area Chair), CCS, ACSAC, ACSAC Artifact Evaluation Track, PETS, WiSec 2018: WWW (S&P Track); CCS; Wisec: ISI (TPC Chair); SciSec 2017: IEEE ISBA (TPC Co-Chair), WiSec, SEC, ESORICS, WPES 2016: IEEE RFID (TPC Co-Chair), Protocols and Security Track), CCS, ESORICS, WiSec, CANS, WPES, SPVAN, RFIDSec 2015: USENIX Security, NSS, RFIDSec, ESORICS, CCS, ICCCN, LightSec, ICISC Recent News Paper accepted to IJCNLP-AACL October 25, 2025 TAMU SPIES Lab Wins CCS 2025 Distinguished Paper Award! October 20, 2025 6 out of 7 PhD graduates in past 4 years are in faculty positions October 4, 2025 Dr. Saxena joins the Editorial Board of ACM AILET September 29, 2025 Paper accepted to eCrime 2025 September 9, 2025 Paper accepted to IEEE S&P (Magazine) August 24, 2025 Another recent SPIES graduate to take up faculty position August 21, 2025 Paper accepted to CSCML 2025 August 13, 2025 SPIES graduate to start as Assistant Professor July 22, 2025 Paper accepted to ACM CCS 2025 July 2, 2025 Paper accepted to ICME 2025 June 24, 2025 SPIES Lab’s Browser Fingerprinting Work in the News June 23, 2025 Journal paper accepted to IEEE TIFS June 19, 2025 SPIES Lab’s Browser Fingerprinting Work Features in News June 18, 2025 Paper Accepted to USENIX Security 2025 June 6, 2025 2 Papers Accepted to PST 2025 June 6, 2025 The 17th SPIES PhD Graduate – Ahmed Tanvir Mahdad June 2, 2025 AI Spies News — BPSniff (IEEE S&P 2025) Paper News Story May 12, 2025 Launching the AI Spies News Channel May 12, 2025 Paper accepted to WiSec 2025 May 11, 2025 Contact Info Nitesh Saxena PETR 238 435 Nagle Street College Station, Tx 77843-3112 email: nsaxena[at]tamu.edu (best way to reach me) SPIES Lab, Computer Science and Engineering Paper accepted to IJCNLP-AACL 2025TAMU SPIES Lab Wins CCS 2025 Distinguished Paper Award!Paper accepted to eCrime 2025Paper accepted to IEEE S&P (Magazine)Another recent SPIES graduate to take up faculty positionPaper accepted to CSCML 2025SPIES graduate to start as Assistant ProfessorPaper accepted to ACM CCS 2025News: Security and Accessibility Gaps in Web Authentication for Blind and Visually Impaired UsersPaper accepted to ICME 2025 Search this website",
  "content_length": 8683,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:31"
}