{
  "name": "Nitin Nitin",
  "homepage": "https://researchdirectory.uc.edu/p/nitinfu",
  "status": "success",
  "content": "Expert Profile: Nitin Nitin | Research Directory Nitin Nitin , PHD Associate Professor Educator James A. Rhodes Hall812CCincinnati, Ohio 45221-0030Phone +1 (513) 556 7619Email nitinfu@ucmail.uc.edu +1 (513) 556 7619EmailDownload V-Card I am currently working as an Associate Professor Educator-Full Time in the College of Engineering and Applied Sciences at the University of Cincinnati. In the past I have worked as Associate Professor-Full Time of Information Systems and Analytics at IIM Shillong, Meghalaya, INDIA. During my tenure at IIM Shillong, I have also served as Chairperson for the two Areas {(Information Systems and Analytics) & (IT Services and Website Committee)}. During 2017-2018, I worked as Professor Educator in the Department of EECS at University of Cincinnati, OH and during 2010-2011 as First Tier Bank Professor in the Peter Kiewit Institute at University of Nebraska at Omaha, NE, USA. I have started my professional career in June 1997; in December 2001, I received B.Engg. in Computer Science & Engineering [Hons.] from Dr. B.R. Ambedkar University, Agra. In 2003 I graduated in M.Engg. in Software Engineering from Thapar Institute of Engineering and Technology (Deemed University), Patiala, Punjab, INDIA. In September 2008, I received Ph.D. in Computer Science & Engineering from Jaypee University of Information Technology, INDIA and University of Florida (UF), Gainesville, FL, USA under faculty-student exchange program, specifically I have completed 12 credits course work from UF. Finally in May 2013, I received D.Sc. in Computer Science & Engineering from Uttarakhand Technical University, Dehradun, INDIA. I completed the partial research work that was related to my D.Sc. at University of Nebraska at Omaha (UNO), NE, USA. I was successful in simulating all my research work on a Supercomputer called Firefly. I am an IBM certified engineer, a Life Member of IAENG, Senior Member of IEEE, ACM & IACSIT and Member of SIAM and ACIS. Currently I am focused in the research areas of AI, ML, Big Data Analytics, Hybrid Blockchain Technology, Hybrid Smart Contracts, Interconnection Networks, Networks-on-Chip, Systems-on-Chip, Systems-in-Packages, Multiprocessor-Systems-on-Chip, Parallel and Distributed Computing, Finite State Testing of GUIs, CMC in Business and Negotiations for the last 24 years, which resulted in 200+ academic research papers in high-impact refereed International Journals & Transactions, Book Chapters, Symposium, Conferences and Position, Research reports, such as Elsevier, Springer, Taylor & Francis, Wiley, IEEE, ACM, Sage, CRC, IOS Press, MDPI, Tech Science Press, 1 granted Australian and 2 granted Indian Patents, 7 Books, 12 PhDs, 60 Master’s Thesis and 60+ Academic & Research Awards. I am also an Associate Editor of the International Journal of Parallel, Emergent and Distributed Systems, Taylor and Francis, UK and IEEE Access, IEEE, USA. In addition to this, I am also serving as referee for the Journal of Parallel and Distributed Computing; Computer Communications; Computers and Electrical Engineering; Mathematical and Computer Modelling-Elsevier Sciences, The Journal of Supercomputing, Springer and International Journal of System Science, Taylor & Francis. Doctor of Science (D.Sc.) : Veer Madho Singh Bhandari Uttarakhand Technical University, UK, INDIA UK, India, 2013 (Computer Science and Engineering) Doctor of Philosophy (Ph.D.): Jaypee University of Information Technology, HP, INDIA/University of Florida, FL, USA 2008 (Computer Science and Engineering ) Master of Engineering (M.E.): Thapar Institute of Engineering and Technology, PB, INDIA PB, India, 2003 (Software Engineering) Bachelor of Engineering (B.E.): Dr. B.R. Ambedkar University, UP, INDIA UP, India, 2001 (Computer Science and Engineering) AI, ML, Medical Data Analysis, Big Data Analytics, Cyber Physical Systems, Hybrid Blockchain Technology, Hybrid Smart Contracts, Interconnection Networks, Networks-on-Chip, Systems-on-Chip, Systems-in-Packages, Multiprocessor-Systems-on-Chip, Parallel and Distributed Computing, Finite State Testing of Graphical User Interfaces, Computer Mediated Business Communications and Negotiations.08-15-2017 -08-14-2018 Assistant Professor Educator , University of Cincinnati, USA 08-21-2010 -05-31-2011 First Tier Bank Professor, University of Nebraska at Omaha, USA 07-28-2003 -06-30-2005 Lecturer, Jaypee University of Information Technology, India 07-01-2005 -09-18-2008 Senior Lecturer, Jaypee University of Information Technology, India 09-19-2008 -06-30-2011 Assistant Professor, Jaypee University of Information Technology, India 07-01-2011 -06-30-2015 Associate Professor, Jaypee University of Information Technology, India 07-01-2015 -09-28-2016 Associate Professor, Jaypee Institute of Information Technology, India 09-29-2016 -08-18-2017 Professor, Jaypee Institute of Information Technology, India 08-20-2018 -12-31-2020 Associate Professor , Indian Institute of Management Shillong, India 01-01-2021 -To Present Associate Professor Educator, Department of Electrical and Computer Engineering, University of Cincinnati, USA Grant: #Faculty Development Award Investigators:Nitin, Yamuma Shukla and Marc Cahay 01-01-2024 -05-31-2024 University of Cincinnati Bias Estimation in Large Language Models like ChatGPT Role:PI $1800 Completed Type:Grant Level:College Grant: #Faculty Development Award Investigators:Nitin 05-01-2022 -08-31-2022 University of Cincinnati Role:PI $2650 Completed Type:Grant Level:College Grant: #Sustainability Course Contents Enhancement Program Award Investigators:Nitin 11-01-2022 -12-31-2023 University of Cincinnati Role:PI $850 Completed Type:Grant Level:University Grant: #Faculty Development Award Investigators:Nitin and Yamuna Shukla 08-01-2022 -12-31-2022 University of Cincinnati Ischemic Stroke Prediction Model Using Deep Learning Role:PI $2500 Completed Type:Grant Level:College Grant: #Faculty Development Award Investigators:Nitin and Yamuna Shukla 01-01-2022 -06-30-2022 University of Cincinnati Design and Development of an Efficient Artificial Intelligence based tool for 2D/3D Medical Image Segmentation Role:PI $2600 Completed Type:Grant Level:College Grant: #Faculty Development Award Investigators:Nitin and Rashmi Sharma 08-01-2021 -12-31-2021 University of Cincinnati Advancement of current technical understanding, research-based, and for unanimous collaboration on Next Generation RTDS Algorithm research Role:PI $400 Completed Type:Grant Level:College Grant: #OCRI Investigators:Nitin 11-30-2023 -06-30-2024 OCRI and University of Cincinnati Introduction to Smart Contract Programming Role:PI $15,000 Completed Type:Grant Level:State Grant: #57681578 Investigators:Jian-Jia Chen, Nitin and Phil Wilsey 03-01-2023 -12-31-2023 IVAC - International Virtual Academic Collaboration 2023-DAAD Germany WEAR: WEarable resource Aware programming and RTOS Role:PI €50,000 Completed Type:Grant Level:International Grant: #UC Visiting Scholar Grant Investigators:Nitin and Manisha Shah 05-01-2024 -08-31-2024 University of Cincinnati Development of an IoT-Enabled Smart Battery Management System for Battery Health Monitoring and V2X Communication Role:PI Completed Type:Grant Level:International Grant: #First Tier Bank Professor Investigators:Nitin 08-21-2010 -05-31-2011 University of Nebraska at Omaha Sabbatical Grant for Research in the Field of Interconnection Networks Role:PI $10,000 Completed Type:Grant Level:College Grant: #Jaypee University of Information Technology Investigators:Nitin 08-01-2010 -05-31-2011 Jaypee University of Information Technology Sabbatical Grant for Research in the Field of Interconnection Networks Role:PI $21,000 Completed Type:Grant Level:International Grant: #UC Faculty/ Staff International Incentive Grant Investigators:Nitin and Manisha Shah 05-01-2025 -08-31-2025 University of Cincinnati Self-adaptive Intelligent Algorithm for Battery Health Monitoring for EV Application Role:PI $3050 Completed Level:International Grant: #OCRI Investigators:Nitin 05-01-2025 -06-30-2025 OCRI and University of Cincinnati Application of AI to Cyberwarfare Role:PI $13408.08 Completed Type:Grant Level:State Grant: #Faculty Development Award Investigators:Nitin and Manisha Shah 04-01-2025 -08-31-2025 University of Cincinnati Advanced Ensemble Learning Framework for Optimized Lithium-ion Battery State of Health (SOH) Prediction Role:PI $2500 Completed Type:Grant Level:College Investigators:Nitin 05-01-2026 -08-31-2026 OCRI and University of Cincinnati Autonomous Cyber Defense Agents (Multi-Agent RL) Role:PI $15000 Active Type:Grant Level:StatePeer Reviewed Publications Kumar P.; Nitin; Punhani A. (01-01-2017. ) Optimal extra links placement in mesh interconnection network using improved environmental adaptatio.Journal of Intelligent and Fuzzy Systems, , 32 (5 ) ,3285-3295 More Information Nitin; Sharma A. (04-01-2016. ) A literature survey on energy efficent virtual network embedding in cloud computing .International Journal of Applied Engineering Research, , 11 (6 ) ,3828-3841 Chauhan A.; Nitin; Punhani A. (03-29-2016. ) EMC2Mesh.12th IEEE International Conference Electronics, Energy, Environment, Communication, Computer, Control: (E3-C3), INDICON 2015, , More Information Kumar S.; Nitin (03-01-2016. ) A literature survey on finite state testing of graphical user interface .International Journal of Applied Engineering Research, , 11 (4 ) ,2942-2954 Chauhan A.; Nitin; Punhani A. (01-05-2016. ) Comparative analysis of traffic patterns on centre connected topologies based on burton normal form.IEEE Region 10 Annual International Conference, Proceedings/TENCON, , 2016-January , More Information Nitin; Sehgal V.; Verma R. (01-01-2016. ) Implementation of information system in crisis management using modeling and simulation.International Journal of Simulation: Systems, Science and Technology, , 17 (32 ) , More Information Nitin; Sehgal V.; Verma R. (01-01-2016. ) Implementation of control measure in ",
  "content_length": 50890,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:34"
}