{
  "name": "Niv Dayan",
  "homepage": "https://nivdayan.net",
  "status": "success",
  "content": "Home | nivdayan top of pageDatabases & Data StructuresData structures are the bookkeepers of modern civilization. At its core, a data structure is a method of organizing data and putting it at our fingertips. My work aims to design the best possible data structures that the laws of physics allow for. With modern hardware constantly evolving and new application domains (e.g., crypto, ML, VR) continuously emerging, the quest for the world’s best data structures is never complete. This work spans the full pipeline from theory into practice: from mathematical analysis, to efficient implementation, to rigorous experimentation. I do this work in collaboration with industry partners, especially startups, to keep it grounded and helpful to real-world users. ​ For more about my work, read here. ​Join my LabSelected PublicationsDo you enjoy cracking algorithmic riddles? Do you like using math to distill insight? Do you love implementing lighting-fast code? If so, we would love to have you on board as a masters' or PhD student. Reach out to me nivdayan@cs.toronto.edu for more. Diva: Dynamic Range Filter for Var-Length Keys and Queries Navid Eslami, Ioana O. Bercea, Niv Dayan. VLDB 2025. [code]   [video]  Best Paper. ​ Sphinx: A Succinct Perfect Hash Index for x86 Sajad Faghfoor Maghrebi, Niv Dayan. VLDB 2025. [code]  [video] ​ Memento Filter: A Fast, Dynamic, and Robust Range Filter. Navid Eslami, Niv Dayan. SIGMOD 2025. [code]  [video] ​ Aleph Filter: To Infinity in Constant Time. Niv Dayan, Ioana Bercea, Rasmus Pagh. VLDB 2024.  [video] ​ InfiniFilter: Expanding Filters to Infinity and Beyond. Niv Dayan, Ioana Bercea, Pedro Reviriego, Rasmus Pagh. SIGMOD 2023. [video] ​ Spooky: Granulating LSM-Tree Compactions Correctly. Niv Dayan, Tamar Weiss, Shmuel Dashevsky, Michael Pan, Edward Bortnikov, Moshe Twitto. VLDB 2022. [video]  [slides] ​ Chucky: A Succinct Cuckoo Filter for LSM-Tree. Niv Dayan, Moshe Twitto. SIGMOD 2021. [video] [slides]​​ ​ The Log-Structured Merge-Bush & the Wacky Continuum. Niv Dayan, Stratos Idreos. SIGMOD 2019. [video] [slides] ​ Dostoevsky: Better Space-Time Trade-Offs for LSM-Tree Based Key-Value Stores via Adaptive Removal of Superfluous Merging. Niv Dayan, Stratos Idreos. SIGMOD 2018. [video] [slides] ​ Monkey: Optimal Navigable Key-Value Store. Niv Dayan, Manos Athanassoulis, Stratos Idreos. SIGMOD 2017. [video]  Best of SIGMOD. ​ See the full list in Google Scholar. ​ See full publication listThis paper was cited as one of the best four papers at the conference. C.V.Assistant Professor, University of Toronto, 2023 - Postdoctoral Researcher, Copenhagen University, 2022 Research Scientist, Pliops, 2019 - 2022 Postdoctoral Researcher, Harvard, 2015 - 2019 PhD in Computer Science, IT University of Copenhagen, 2012 - 2015 MSc in Software Development, IT University of Copenhagen, 2010 - 2012 BSc in Computing and Economics, University of Dundee, 2007 - 2010 ​ See full C.V.TeachingCSC443/CSC2234: Database System Technology CSC2525: Research Topics in Database Managementbottom of page",
  "content_length": 3048,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:34"
}