{
  "name": "Nivedita Arora",
  "homepage": "https://niveditaarora.com",
  "status": "success",
  "content": "Building Sustainable Computational Materials – Nivedita Arora Skip to content Building Sustainable Computational Materials Nivedita Arora Allen K. and Johnnie Cordell Breed Junior Professor of DesignAssistant Professor, ECE & CS departmentNorthwestern UniversityNivedita is Breed Assistant Professor in the ECE & CS departments at Northwestern University. Her research aims to transform sustainable everyday materials and things (paper, wood, soil, plants, textiles) to have computational properties and support applications in climate change, agriculture, smart infrastructure, wildlife monitoring, and education. She calls this new area of research — ‘Sustainable Computational Materials.’ She directs the VAK Sustainable Computing Lab. VAK is short for Vasudhaiva Kutumbakam, an ancient Sanskrit phrase that means ‘one world, one family, one future.’ In a world driven by performance and functionality-first technology, inspired by her values of responsible indigenous living, VAK lab re-envisions the computing stack from a sustainability-first approach for its entire life-cycle: (1) Production: eco-friendly biodegradable materials and manufacturing, (2) Use: battery-free system design and operation, (3) Disposal: responsible end-of-the-lifecycle or reuse. To create such disruptive technology, the core value of the lab is set in transdisciplinary innovation. VAK Lab is a group of fearless and purpose-driven scientists, engineers, and designers cutting across disciplines. Nivedita herself is trained in electrical engineering, computer sc, and design and traversed into materials and biology. The lab often also engages with community partners to deploy and test prototypes in real-world scenarios. She built the first realized example of sustainable computational material —  interactive stickers during her Ph.D. in Computer Science at Georgia Institute of Technology, advised by Gregory Abowd and Thad Starner. This work has appeared in ACM IMWUT, ACM UIST, ACM MobiSys, and NPJ Flexible Electronics. It has won two best papers (ACM IMWUT, ACM SenSys-ENSsys), two best poster awards (MobiSys, UIST), an outstanding design award (Fast Company), and research highlights in Communications of the ACM and SIGMOBILE GetMobile Magazine. It was also recognized as the best dissertation at Georgia Tech’s College of Computing. She has also worked closely with Josiah Hester as a post-doctoral researcher. For her research and service work, Nivedita has been named the winner of the Gaetano Borriello Outstanding Ubicomp Student award in the ACM Ubicomp and ISWC community, Foley scholar in Georgia Tech’s GVU Center, Outstanding GRA in Georgia Tech’s College of Computing, GT’s Top 10 Faces of Inclusive Excellence and MIT Rising Stars in EECS. Ongoing Projects 🌵 Biodegradable sensor platform for remote sustainable sensing🧶 Low/No power smart robotic textiles for rehabilitation and space junk removal 🗒️ Carbon-aware interactive smart home sticky notes⚛️ Sustainable carbon-aware quantum computing I am always looking for motivated students and skilled postdoctoral scholars to join the VAK lab. Please email me your resume and a paragraph explaining why you would like to join the lab. Awards Global• ACM Dissertation Award | 2023 • Fast Company Design Innovation Competition in Experimental Category Finalist | 2022• ACM Gaetano Borriello Outstanding Ubiquitous Computing Student Award | 2021• EECS Rising Stars, Massachusetts Institute of Technology | 2021University• Breed Junior Chaired Professor | 2023• Outstanding Dissertation, Georgia Tech College of Computing | 2023• Outstanding Graduate Research Assistant Award in Georgia Tech’s College of Computing | 2022• GVU Foley Scholar, Georgia Institute of Technology | 2021 Paper• Best position paper, International Workshop on Sensys- EnSys | 2022• Distinguished Paper, ACM Ubicomp conference | 2019• Best poster, ACM MobiSys conference | 2019• Best poster, ACM UIST conference | 2018 Diversity• Scholarship recipient, Richard Tapia Celebration of Diversity in Computing Conference | 2021• Faces of Inclusive Excellence, Georgia Tech, 2015 Others • Fast Company Design Innovation Competition in Experimental Category Honoree for workon self-powered stickers | 2021• Young researchers, Heidelberg Laureate Forum | 2020• Final round, Qualcomm Innovation Fellowship | 2018• 2nd position in powering Internet of Things poster presentation, NextFlex Workshop | 2017 Publications full publication list will be updated on the VAK Sustainable Computing lab website from 2024 2024 B. Yen, P. Sahinidis, S. Bernstein, L. Jaliff, G. Marcano, C. Josephson, P. Pannuto, W. Shuai, G. Wells, N. Arora, J. Hester. Soil-Powered Computing: The Engineer’s Guide toPractical Soil Microbial Fuel Cell Design. Proceedings of the ACM Interactive Mobile Wearable Ubiquitous Technology, Vol. 7, No. 4, Article 112. September 2023Fast Company’s Innovation by Design Competition Honoree PDF Project Page 2023 Y. Do, N. Arora, A. Mirzazadeh, I. Moon, E. Xu, Z. Zhang, G. Abowd, S. Das. Powering for Privacy: Improving User Trust in Smart Speaker Microphones with IntentionalPowering and Perceptible Assurance In 32nd USENIX Security Symposium, Aug 2023. PDF Video 2022 N. Arora, V. Iyer, H. Oh, G.D. Abowd and J. Hester. Circularity in Energy Harvesting Computational “Things” The 20th ACM Conference on Embedded Networked Sensor Systems (SenSys’22), November 6–9, 2022. Best Position Paper, ENSsys Workshop PDF Video D. Zhang, C.F. Hernandez, Y. Li, J.W. Park, Y. Wang, Y. Zhao, N. Arora, A. Mirzazadeh, Y. Do, T. Cheng, T. Starner, and G.D. Abowd. Flexible Computational Photodetectors for Self-Powered Activity Sensing. NPJ Flexible Electronics, January 2022 PDF Video 2021 A. Curtiss, B. Rothrock, A. Bakar, N. Arora, J. Huang, Z. Englhardt, A. Empedrado, C. Wang, S. Ahmed, Y. Zhang, N. Alshurafa, J. Hester. FaceBit: Smart Face Masks Platform. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, November, 2021.Finalist, Fast Company’s Innovation by Design Competition |ACM TechNews | Forbes PDF Video Scientific American N. Arora, A. Mirzazadeh, I. Moon, C. Ramey, Y. Zhao, D. Rodriguez, G. D. Abowd and T. Starner. MARS: Nano-Power Battery-free Wireless Interfaces for Touch, Swipe, and Speech Input. Proceedings of the 34th Annual ACM Symposium on User Interface Software and Technology, October 2021.Fast Company’s Innovation by Design Competition Honoree PDF 30-second Video 5-min Video DOI 2020 N. Arora, T. Starner and G. D. Abowd. SATURN: An Introduction to the Internet of Materials. Communications of the ACM, January 2021.Research Highlights: 20000+ downloads PDF DOI A. Waghmare, Q. Xue, D. Zhang, Y. Zhao, S. Mittal, N. Arora, C. Byrne, T. Starner, and G. D. Abowd. UbiquiTouch: Self-Sustaining Ubiquitous Touch Interfaces. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, March 2020. PDF Video DOI Y.K. Meena, N. Arora, X.D. Yang, M. L¨ochtefeld, M. Carnie, N. Henze, S. Hodges, M. Jones, and G.D. Abowd. Self-Sustainable CHI: Self-Powered Sustainable Interfaces and Interactions. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, April 2020. PDF Workshop Website DOI N. Arora, N. Arora, J. Yu, H. Oh, T. Starner and G. D. Abowd. SATURN: Technical and Design Challenges in Building a Self-sustainable Sound and Vibration Sensing Material. GetMobile: Mobile Computing and Communications. January 2020.ACM SIGMOBILE Research Highlights Website DOI 2019 N. Arora, Q. Xue, D. Bansal, P. McAughan, R. Bahr, D. Osorio, X. Ma, A. Sample, T. Starner and G. D. Abowd. Surface++ : A Scalable and Self-sustainable Wireless Sound Sensing Surface. In Proceedings of the 17th ACM Annual International Conference on Mobile Systems, Applications, and Services, MobiSys (pp. 543-544), June 2019.Best Poster PDF DOI 2018 N. Arora, and G. D. Abowd. ZEUSSS: Zero Energy Ubiquitous Sound Sensing Surface Leveraging Triboelectric Nanogenerator and Analog Backscatter Communication. Adjunct Publication of the 31st Annual ACM Symposium on User Interface Software and Technology, October 2018. Best Poster People’s Choice Award PDF Video DOI N. Arora, S. L. Zhang, F. Shahmiri, D. Osorio, Y.-C. Wang, M. Gupta, Z. Wang, T. Starner, Z. L. Wang, and G. D. Abowd. SATURN: A thin and flexible self-powered microphone leveraging triboelectric nanogenerator. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), Volume 2 (2), June 2018. Distinguished Paper (Top 3%) PDF Video Fabrication-Video Talk-slides Talk-video DOI 2016 N. Arora, L. Freil, I. Walker, T. Starner, M. M Jackson. Towards Mobile and Wearable Brain-Computer Interfaces. Proceedings of the 6th International Brain-Computer Interface Meeting, organized by the BCI Society, May 2016. PDF Video Slides Patents Systems And Methods For Multi-Channel Ambiently-Powered Real-Time Sensing. Filed: April, 2021. Patent Application: 63/231,930, GT provisional: 8734 Self-powered Wireless Identification Barcode based on Triboelectric Nanogenerator and Backscatter Communication. Filed: Dec, 2020, GT provisional: 8653 A Thin and Flexible Self-Powered Microphone Designed on the Principle of Triboelectric Nanogenerator. Granted: US Patent 10,932,063. Talks Sustainable Computational Materials :Rethinking the Electronic Lifecycle from an Environmental Lens,11th Greater Chicago Area Systems Research Workshop (GCASR) | May, 2024 Sustainable Quantum Technologies :Quantum for Sustainability and Sustainability of QuantumThe Quantum Economic Development Consortium Annual Meeting | March, 2024 Sustainable Internet of Things: Rethinking the Lifecycle of Electronicsfrom an Environmental LensComputer Science Department, Northwestern University | Feb, 2024 Sustainable IoT: Rethinking materials to applications5th Annual Joint Meeting of the IEEE Magnetics Society and NanotechnologyCouncil Chicago Chapters | Nov 2023 Building Sustainable Computational MaterialsUIUC CS (",
  "content_length": 18821,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:35"
}