{
  "name": "Nizar Habash",
  "homepage": "https://www.nizarhabash.com",
  "status": "success",
  "content": "Nizar HabashSearch this siteEmbedded FilesSkip to main contentSkip to navigationNizar Habashنزار حبشNizar Habash Professor of Computer Science, New York University Abu DhabiDirector of the Computational Approaches to Modeling Language (CAMeL) Lab نزار حبشأستاذ في علوم الحاسوب، جامعة نيويورك أبوظبيمدير مختبر «كامل» - مختبر الأساليب الحاسوبية لنمذجة اللغة Hello! Welcome to my home page. My name is Nizar Habash  (/nəzár ħábaʃ/). I am a Professor of Computer Science at New York University Abu Dhabi and  the director of the Computational Approaches to Modeling Language (CAMeL) Lab.My area of research is artificial intelligence, specifically natural language processing and computational linguistics. I primarily work on Arabic and Arabic dialect language processing (in terms of orthography, morphology, syntax, semantics, lexicons and corpora), machine translation and dialogue systems. For more information about my research, check out my lab research areas, my lab resource page, my CV and my list of publications. For some demos and videos of my work on Arabic artificial intelligence, corpus creation and dialogue systems, go to www.camel-lab.com.For courses I teach, tutorials and textbooks, see my teaching page.I am also an aspiring artist. Most of my art work relates to language, communication and identity narratives. Check out my constructed language Delason. My current large art project is Palisra, a collection of pieces and an Arabic-Hebrew conlang reflecting my views on the Middle East conflict.  I sell some of my artistic creations through Zazzle: nizware is my wearable art product line.مرحبا! أهلا بكم في موقعي الإلكتروني.اسمي نزار حبش.أنا أستاذ في برنامج علوم الحاسوب في جامعة نيويورك أبوظبي. ومدير مختبر الأساليب الحاسوبية لنمذجة اللغة (مختبر «كامل» CAMeL Lab).مجال بحثي هو الذكاء الاصطناعي، وتحديدا معالجة اللغة الطبيعية واللغويات الحاسوبية. أعمل بشكل أساسي على معالجة اللغة العربية ولهجاتها بتطوير حلول وأنظمة متخصصة بالإملاء، الصرف الحاسوبي، النحو الحاسوبي، الدلالة والمعجم، الموارد اللغوية الرقمية، الترجمة الآلية وأنظمة الحوار الآلي.للمزيد من المعلومات حول أبحاثي رجاء الذهاب إلى صفحة الأبحاث تحت موقع مختبر \"كامل\" الإلكتروني  وكذلك صفحة الموارد هناك، والاطلاع على سيرتي الذاتية وقائمة منشوراتي البحثية. موقع المختبر (www.camel-lab.com) يحتوي على مجموعة من العروض التوضيحية ومقاطع الفيديو الخاصة بعملي حول أنظمة الذكاء الاصطناعي العربي.بالنسبة إلى المساقات التي أقوم بتدريسها، والدورات التعليمية والكتب، راجع صفحة التدريس الخاصة بي.أنا أيضا فنان طموح. تتعلق معظم أعمالي الفنية بسرديات اللغة والتواصل والهوية. البعض من أعمالي الفنية معروض هنا. صفحة لغتي الاصطناعية الأولى «ديلاسون» والتي استغرق بناؤها أكثر من سبع سنوات هنا. مشروعي الفني الكبير الحالي هو «فليسرا» ، وهو مجموعة من القطع الفنية ولغة اصطناعية عربية-عبرية تعكس وجهات نظري حول صراع الشرق الأوسط وفكرة حل الدول الواحدة.أبيع بعض إبداعاتي الفنية من خلال موقع «زازِل»، «نِزوير» هو خط إنتاجي الفني المرتدى. Before emailing me, please read my FAQ page.   .الرجاء قراءة صفحة الأسئلة الكثيرة التداول قبل إرسال البريد الإلكتروني Here is a link to my short biography. هنا رابط لسيرتي الشخصية المختصرة. The video of an invited talk at Grammarly on \"Arabic Natural Language Processing: Challenges and Solutions\"ELRA awarded me the Antonio Zampolli Prize for 2024 for \"Outstanding Contributions to the Advancement of Language Resources and Language Technology Evaluation within Human Language Technologies\". This is the award speech.An article published on Majarra in Arabic and English (2024)My Journey from the Arts to Artificial Intelligence and Arabic Language Processingرحلتي من الفنون إلى عالم الذكاء الاصطناعي ومعالجة اللغة العربيةAn article about why I chose NYU Abu Dhabi An article in The National newspaper about dialectal Arabic projects at CAMeL Lab  An article in the 2019 NYUAD Research Report on bias in AIمقال في تقرير أبحاث جامعة نيويورك أبوظبي ٢.١٩ عن التحيز والذكاء الاصطناعيAn article in  Al Sharq Al Awsat about my work on dialect identification A research profile article in Al Arab News paper (September 23, 2019)Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4065,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:35"
}