{
  "name": "Noah A. Smith",
  "homepage": "https://www.cs.washington.edu/people/faculty/nasmith",
  "status": "success",
  "content": "Noah Smith, Professor - Paul G. Allen School of Computer Science & Engineering Skip to content Enter search text Current site All the UW Search scope Current site All the UW Noah Smith Professor Amazon Professor of Machine Learning Adjunct, Department of Linguistics Focus Area: Artificial Intelligence Expertise: Machine Learning; Natural Language Processing Email: nasmith@cs.washington.edu Faculty Webpage Noah’s ARK UW NLP Group eScience Institute Biography: Noah Smith is Amazon Professor of Machine Learning in the Paul G. Allen School of Computer Science & Engineering at the University of Washington (also Adjunct in Linguistics, Affiliate of the Center for Statistics and the Social Sciences, Senior Data Science Fellow at the eScience Institute, and Associate Faculty of the Stroum Center for Jewish Studies) as well as Senior Director of NLP Research at the Allen Institute for Artificial Intelligence. Previously, he was an Associate Professor of Language Technologies and Machine Learning in the School of Computer Science at Carnegie Mellon University. Broadly, Smith’s research targets algorithms that process data encoding language, music, and more, to augment human capabilities. He also works on core problems of research methodology like evaluation, and co-directs the OLMo open language modeling effort with Hanna Hajishirzi at AI2. Smith was elected a Fellow of the Association for Computational Linguistics “for significant contributions to linguistic structure prediction, computational social sciences, and improving NLP research methodology” (2020). UW’s Sounding Board team, which he co-led with Profs. Mari Ostendorf and Yejin Choi ,won the inaugural Amazon Alexa Prize in 2017. Smith’s research was recognized with a UW Innovation award “to stimulate innovation among faculty from a range of disciplines and to reward some of their most terrific ideas” (2016–2018), the Finmeccanica career development chair at CMU “to acknowledge promising teaching and research potential in junior faculty members” (2011–2014), an NSF CAREER award (2011–2016), and a Hertz Foundation graduate fellowship (2001–2006). He has coauthored conference papers that were cited as outstanding, finalist, honorable mention, and sometimes even “best” student/theme/resource/overall paper at ICLP 2008, ACL 2009, COLING 2010, NAACL 2013, ACL 2014, NAACL 2015, WWW 2016, EACL 2017, NAACL 2018, ACL 2018, ACL 2019 (twice), ACL 2020, ACL 2021, NAACL 2022, and ACL 2024 (twice). He earned his Ph.D. in Computer Science from Johns Hopkins University and his B.S. in Computer Science and B.A. in Linguistics from the University of Maryland.",
  "content_length": 2635,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:36"
}