{
  "name": "Noah Stephens-Davidowitz",
  "homepage": "http://www.noahsd.com",
  "status": "success",
  "content": "Noah Stephens-Davidowitz About I am an assistant professor in Cornell's computer science department, and a member of the applied math field and the mathematics field. My research to date has focused primarily on the study of lattices. I am also interested more broadly in theoretical computer science, cryptography, and geometry. I received my PhD from NYU, advised by Professors Oded Regev and Yevgeniy Dodis. Before coming to Cornell, I was a fellow at the Simons Institute in Berkeley, as part of the program Lattices: Algorithms, Complexity, and Cryptography, a postdoctoral researcher at MIT's computer science department, supervised by Vinod Vaikunthanathan, and a postdoc at Princeton’s computer science department and visiting researcher at the Institute for Advanced Study’s math department---both as part of the Simons Collaboration on Algorithms and Geometry. My email is noahsd@gmail.com. My office is Gates 321. Papers BibBase stephens-davidowitz, n generated by Group by Year Author Type Keyword Downloads Expand/Collapse All Download BibTeX RSS Feed Excellent! Next you can create a new website with this list, or embed it in an existing web page by copying & pasting any of the following snippets. JavaScript (easiest) <script src=\"https://bibbase.org/show?bib=https://dl.dropbox.com/s/26018h26wgh5c2o/bibbase.bib&theme=simple&fullnames=1&noTitleLinks=true&showSearch=true&jsonp=1\"></script> PHP <?php $contents = file_get_contents(\"https://bibbase.org/show?bib=https://dl.dropbox.com/s/26018h26wgh5c2o/bibbase.bib&theme=simple&fullnames=1&noTitleLinks=true&showSearch=true\"); print_r($contents); ?> iFrame (not recommended) <iframe src=\"https://bibbase.org/show?bib=https://dl.dropbox.com/s/26018h26wgh5c2o/bibbase.bib&theme=simple&fullnames=1&noTitleLinks=true&showSearch=true\"></iframe> For more details see the documention. This is a preview! To use this list on your own web site or create a new web site from it, create a free account. The file will be added and you will be able to edit it in the File Manager. We will show you instructions once you've created your account. To the site owner: Action required! Mendeley is changing its API. In order to keep using Mendeley with BibBase past April 14th, you need to: renew the authorization for BibBase on Mendeley, and update the BibBase URL in your page the same way you did when you initially set up this page. Fix it now 2026 (1) A simple proof of a reverse Minkowski theorem for integral lattices. Oded Regev; and Noah Stephens-Davidowitz. Journal of Number Theory. 2026. Paper link bibtex 3 downloads @article{RSSimpleProofReverse2023, title = {A simple proof of a reverse {{Minkowski}} theorem for integral lattices}, author = {Regev, Oded and {Stephens-Davidowitz}, Noah}, year = {2026}, url = {http://arxiv.org/abs/2306.03697}, journal = {Journal of Number Theory}, } 2025 (4) Guarding the Signal: Secure messaging with reverse firewalls. Yevgeniy Dodis; Bernardo Magri; Noah Stephens-Davidowitz; and Yiannis Tselekounis. In Crypto, 2025. Paper link bibtex 12 downloads @inproceedings{DMST25, title = {Guarding the Signal: {{Secure}} messaging with reverse firewalls}, author = { Dodis, Yevgeniy and Magri, Bernardo and {Stephens-Davidowitz}, Noah and Tselekounis, Yiannis}, booktitle={Crypto}, year = {2025}, url = {https://eprint.iacr.org/2025/1172}, } Recursive lattice reduction—A framework for finding short lattice vectors. Divesh Aggarwal; Thomas Espitau; Spencer Peters; and Noah Stephens-Davidowitz. In SOSA, 2025. Paper link bibtex @inproceedings{AEPD23Recursive, title = {Recursive lattice reduction---A framework for finding short lattice vectors}, author = {Aggarwal, Divesh and Espitau, Thomas and Peters, Spencer and {Stephens-Davidowitz}, Noah}, year = {2025}, url = {https://arxiv.org/abs/2311.15064}, booktitle = {SOSA}, } Difficulties constructing lattices with exponential kissing number from codes. Huck Bennett; Alexander Golovnev; and Noah Stephens-Davidowitz. IEEE Transactions on Information Theory. 2025. Paper link bibtex @article{bennettDifficultiesConstructingLattices2024, title = {Difficulties constructing lattices with exponential kissing number from codes}, journal = {IEEE Transactions on Information Theory}, author = {Bennett, Huck and Golovnev, Alexander and {Stephens-Davidowitz}, Noah}, year = {2025}, url = {http://arxiv.org/abs/2410.16660}, } The more the merrier! On total coding and lattice problems and the complexity of finding multicollisions. Huck Bennett; Surendra Ghentiyala; and Noah Stephens-Davidowitz. In ITCS, 2025. Paper link bibtex 1 download @inproceedings{BGS24, title = {The more the merrier! On total coding and lattice problems and the complexity of finding multicollisions}, author = {Huck Bennett and Surendra Ghentiyala and Noah {Stephens-Davidowitz}}, booktitle={ITCS}, year = {2025}, url = {https://eccc.weizmann.ac.il/report/2024/018}, } 2024 (3) A pretty proof that an exponential function is superpolynomial. Noah Stephens-Davidowitz. 2024. Paper link bibtex 1 download @unpublished{SteExponentialSuperpoly2024, title = {A pretty proof that an exponential function is superpolynomial}, url = {http://noahsd.com/exponential_is_superpolynomial.pdf}, author = {{Stephens-Davidowitz}, Noah}, year = {2024} } More basis reduction for linear codes: backward reduction, BKZ, slide reduction, and more. Surendra Ghentiyala; and Noah Stephens-Davidowitz. In APPROX, 2024. Paper link bibtex 49 downloads @inproceedings{GS24BasisReductionCodes, title = {More basis reduction for linear codes: backward reduction, BKZ, slide reduction, and more}, author = {Ghentiyala, Surendra and {Stephens-Davidowitz}, Noah}, year = {2024}, booktitle = {APPROX}, url = {https://arxiv.org/abs/2408.08507}, } A reverse Minkowski theorem. Oded Regev; and Noah Stephens-Davidowitz. Annals of Mathematics. 2024. A preliminary version appeared in STOC 2017. Paper tcs+ talk ias talk bourbaki seminar link bibtex 284 downloads @article{RSReverseMinkowski17, title = {A reverse {Minkowski} theorem}, url = {http://arxiv.org/abs/1611.05979}, journal = {Annals of Mathematics}, author = {Regev, Oded and {Stephens-Davidowitz}, Noah}, year = {2024}, url_TCS+_talk = {http://www.youtube.com/watch?v=mgDNeg3U5TQ}, url_IAS_talk = {http://www.youtube.com/watch?v=9mvPxAKj5BU}, url_Bourbaki_seminar = {http://www.youtube.com/watch?v=j7YvtVvv3qs}, note = {A preliminary version appeared in STOC 2017.} } 2023 (5) The hardness of range avoidance for randomized algorithms implies Minicrypt. Eldon Chung; Alexander Golovnev; Zeyong Li; Maciej Obremski; Sidhant Saraogi; and Noah Stephens-Davidowitz. 2023. Paper link bibtex 3 downloads @unpublished{CGLOSS23, title = {The hardness of range avoidance for randomized algorithms implies Minicrypt}, author = {Eldon Chung and Alexander Golovnev and Zeyong Li and Maciej Obremski and Sidhant Saraogi and Noah {Stephens-Davidowitz}}, year = {2023}, url = {https://eccc.weizmann.ac.il/report/2023/193}, } Lattice problems beyond polynomial time. Divesh Aggarwal; Huck Bennett; Zvika Brakerski; Alexander Golovnev; Rajendra Kumar; Zeyong Li; Spencer Peters; Noah Stephens-Davidowitz; and Vinod Vaikuntanathan. In STOC, 2023. Paper link bibtex 108 downloads @inproceedings{ABB+LatticeProblemsPolynomial2022, title = {Lattice problems beyond polynomial time}, author = {Aggarwal, Divesh and Bennett, Huck and Brakerski, Zvika and Golovnev, Alexander and Kumar, Rajendra and Li, Zeyong and Peters, Spencer and {Stephens-Davidowitz}, Noah and Vaikuntanathan, Vinod}, year = {2023}, booktitle = {STOC}, url = {http://arxiv.org/abs/2211.11693}, } Revisiting time-space tradeoffs for function inversion. Alexander Golovnev; Siyao Guo; Spencer Peters; and Noah Stephens-Davidowitz. In CRYPTO, 2023. Paper link bibtex 21 downloads @inproceedings{GGPSRevisitingTimespaceTradeoffs2022, title = {Revisiting time-space tradeoffs for function inversion}, author = {Golovnev, Alexander and Guo, Siyao and Peters, Spencer and {Stephens-Davidowitz}, Noah}, year = {2023}, url = {https://eccc.weizmann.ac.il/report/2022/145/}, booktitle = {CRYPTO}, } Just how hard are rotations of $ℤ^n$? Algorithms and cryptography with the simplest lattice. Huck Bennett; Atul Ganju; Pura Peetathawatchai; and Noah Stephens-Davidowitz. In Eurocrypt, 2023. Paper link bibtex 58 downloads @inproceedings{BGPSJustHowHard2021, title = {Just how hard are rotations of $\\mathbb{Z}^n$? Algorithms and cryptography with the simplest lattice}, author = {Bennett, Huck and Ganju, Atul and Peetathawatchai, Pura and {Stephens-Davidowitz}, Noah}, year = {2023}, url = {https://eprint.iacr.org/2021/1548}, booktitle = {Eurocrypt}, } On the (im)possibility of branch-and-bound search-to-decision reductions for approximate optimization. Alexander Golovnev; Siyao Guo; Spencer Peters; and Noah Stephens-Davidowitz. In APPROX, 2023. Paper link bibtex 9 downloads @inproceedings{GGPSImPossibilityBranchandbound2021, title = {On the (im)possibility of branch-and-bound search-to-decision reductions for approximate optimization}, author = {Golovnev, Alexander and Guo, Siyao and Peters, Spencer and {Stephens-Davidowitz}, Noah}, year = {2023}, booktitle = {APPROX}, url = {https://eccc.weizmann.ac.il/report/2021/141/}, } 2022 (2) A tight reverse Minkowski inequality for the Epstein zeta function. Yael Eisenberg; Oded Regev; and Noah Stephens-Davidowitz. Proceedings of the AMS. 2022. Paper link bibtex 28 downloads @article{ERSTightReverseMinkowski2022, title = {A tight reverse {{Minkowski}} inequality for the {{Epstein}} zeta function}, author = {Eisenberg, Yael and Regev, Oded and {Stephens-Davidowitz}, Noah}, year = {2022}, journal = {Proceedings of the AMS}, url = {http://arxiv.org/abs/2201.05201}, } On seedless PRNGs and premature next. Sandro Coretti; Yevgeniy Dodis; Harish Karthikeyan; Noah Stephens-Davidowitz; and Stefano Tessaro. In ITC, 2022. Paper link bibtex 10 downloads @inproceedings{CDK+SeedlessPRNGsPremature2022, title = {On seedless {{PRNGs}} and premature next}, booktitl",
  "content_length": 27767,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:37"
}