{
  "name": "Noah Snavely [Tech]",
  "homepage": "http://www.cs.cornell.edu/~snavely",
  "status": "success",
  "content": "Noah Snavely—Cornell Computer Science, Cornell Tech Postdocs Yuanbo Xiangli Ph.D. Students Yen-Yu Chang Hanyu Chen Gene Chou Haian Jin Bharath Raj Nagoor Kani Alumni Ruojin Cai (postdoc, Kempner Institute) Qianqian Wang (postdoc, Berkeley) Wenqi Xian (Netflix Research) Kai Zhang (Adobe) Hadar Averbuch-Elor (Cornell Tech) Jin Sun (University of Georgia) Zhengqi Li (Google Research) Paul Upchurch (Apple) Scott Wehrwein (Western Washington University) Balazs Kovacs (Zoox) Sean Bell (Grokstyle) Kevin Matzen (Facebook) Kyle Wilson (Washington College) Daniel Hauagge (Cornell Tech) Song Cao (Amazon) Chun-Po Wang (Google) Teaching Spring '25CS5670: Computer Vision Spring '24CS5670: Computer Vision Spring '23CS5670: Computer Vision Spring '22CS5670: Computer Vision Spring '21CS5670: Computer Vision Spring '20CS5670: Computer Vision Spring '19CS5670: Computer Vision Spring '18CS5670: Computer Vision Spring '17CS5670: Computer Vision Summer '15CURIE Academy Fall '13CS4670/5670: Intro to Computer Vision Spring '13CS1114: Intro to Computing using Matlab and Robotics About me Noah is a Professor of Computer Science at Cornell Tech interested in computer vision and computer graphics, and a member of the Cornell Graphics and Vision Group. He also works at Google DeepMind in NYC. His research interests are in computer vision and graphics, in particular in 3D understanding and depiction of scenes from images. Noah is the recipient of a PECASE, a Microsoft New Faculty Fellowship, an Alfred P. Sloan Fellowship, and a SIGGRAPH Significant New Researcher Award, and is a Fellow of the ACM and the IEEE. For a quick overview of my interests, see my TR35 talk. View my CV. Publications See my Google Scholar page. Selected Projects C3Po: Cross-View Cross-Modality Correspondence Kuan Wei Huang, Brandon Li, Bharath Hariharan, Noah Snavely NeurIPS 2025 [www, pdf, code] FlashDepth Gene Chou, Wenqi Xian, Guandao Yang, M. Abdelfattah, Bharath Hariharan, Noah Snavely, Ning Yu, Paul Debevec ICCV 2025 [www, pdf, code] Beyond the Frame: Generating 360Â° Panoramic Videos Rundong Luo, Matthew Wallingford, Ali Farhadi, Noah Snavely, Wei-Chiu Ma ICCV 2025 [www, pdf] Visual Chronicles Boyang Deng, Songyou Peng, Kyle Genova, Gordon Wetzstein, Noah Snavely, Leo Guibas, Tom Funkhouser ICCV 2025 [www, pdf] MoMaps: Semantics-Aware Scene Motion Generation Jiahui Lei, Kyle Genova, George Kopanas, Noah Snavely, Leonidas Guibas ICCV 2025 [www, pdf] MegaSaM Zhengqi Li, Tucker, Cole, Wang, Jin, Ye, Kanazawa, Holynski, Snavely CVPR 2025 Best Paper Honorable Mention [www, pdf, code] Doppelgangers++ Yuanbo Xiangli, Ruojin Cai, Hanyu Chen, Jeffrey Byrne, Noah Snavely CVPR 2025 [www, pdf] Stereo4D Linyi Jin, Richard Tucker, Zhengqi Li, David Fouhey, Noah Snavely, Aleksander HoÅyÅski CVPR 2025 [www, pdf] Generating 3D-Consistent Videos from Unposed Internet Photos Gene Chou, Kai Zhang, Sai Bi, Hao Tan, Zexiang Xu, Fujun Luan, Bharath Hariharan, Noah Snavely CVPR 2025 [www, pdf] Can Generative Video Models Help Pose Estimation? Ruojin Cai, Jason Y. Zhang, Philipp Henzler, Zhengqi Li, Noah Snavely, Ricardo Martin Brualla CVPR 2025 [www, pdf] Large View Synthesis Model Haian Jin, Hanwen Jiang, Hao Tan, Kai Zhang, Sai Bi, Tianyuan Zhang, Fujun Luan, Noah Snavely, Zexiang Xu ICLR 2025 [www, pdf, code] Neural Gaffer Haian Jin, Yuan Li, Fujun Luan, Yuanbo Xiangli, Sai Bi, Kai Zhang, Zexiang Xu, Jin Sun, Noah Snavely NeurIPS 2024 [www, pdf, code] MegaScenes Joseph Tung*, Gene Chou*, Ruojin Cai, Guandao Yang, Kai Zhang, Gordon Wetzstein, Bharath Hariharan, Noah Snavely ECCV 2024 [www, pdf, data] PhysDreamer Tianyuan Zhang, Koven Yu, Rundi Wu, Brandon Y. Feng, Changxi Zheng, Noah Snavely, Jiajun Wu, Bill Freeman ECCV 2024 [www, pdf, code] Generative Image Dynamics Zhengqi Li, Richard Tucker, Noah Snavely, Aleksander Holynski CVPR 2024 Best Paper Award [www, pdf] Streetscapes Boyang Deng, Richard Tucker, Zhengqi Li, Leonidas Guibas, Noah Snavely, Gordon Wetzstein SIGGRAPH 2024 [www, pdf] NeRFiller Ethan Weber, A. Holynski, V. Jampani, S. Saxena, N. Snavely, A. Kar, A. Kanazawa CVPR 2024 [www, pdf, code] WonderJourney Koven Yu, Haoyi Duan, Junhwa Hur, Kyle Sargent, Michael Rubinstein, Bill Freeman, Forrester Cole, Deqing Sun, Noah Snavely, Jiajun Wu, Charles Herrmann CVPR 2024 [www, pdf, code] Tracking Everything Everywhere All at Once Qianqian Wang, Yen-Yu Chang, Ruojin Cai, Zhengqi Li, Bharath Hariharan, Aleksander Holynski, Noah Snavely ICCV 2023 Best Student Paper Award [www, pdf, code] Doppelgangers Ruojin Cai, Joseph Tung, Qianqian Wang, Bharath Hariharan, Hadar Averbuch-Elor, Noah Snavely ICCV 2023 [www, pdf, code] ASIC: Aligning Sparse in-the-wild Image Collections Kamal Gupta, V. Jampani, C. Esteves, A. Shrivastava, A. Makadia, N. Snavely, A. Kar CVPR 2023 [www, pdf] FactorMatte Zeqi Gu, Wenqi Xian, Noah Snavely, Abe Davis SIGGRAPH 2023 [www, pdf, code] DynIBaR Zhengqi Li, Qianqian Wang, Forrester Cole, Richard Tucker, Noah Snavely CVPR 2023 Best Paper Honorable Mention [www, pdf, code] Persistent Nature Lucy Chai, Richard Tucker, Zhengqi Li, Phillip Isola, Noah Snavely CVPR 2023 [www, pdf, code] Neural Scene Chronology Haotong Lin, Qianqian Wang, Ruojin Cai, Sida Peng, Hadar Averbuch-Elor, Xiaowei Zhou, Noah Snavely CVPR 2023 [www, pdf, code] Neural Lens Modeling Wenqi Xian, AljaÅ¾ BoÅ¾iÄ, Noah Snavely, Christoph Lassner CVPR 2023 [www, pdf, code] Accidental Light Probes Koven Yu, Samir Agarwala, Charles Herrmann, Richard Szeliski, Noah Snavely, Jiajun Wu, Deqing Sun CVPR 2023 [www, pdf] Omnimatte3D Mohammed Suhail, Erika Lu, Zhengqi Li, Noah Snavely, Leonid Sigal, Forrester Cole CVPR 2023 [www, pdf] Seeing a Rose in 5,000 Ways Yunzhi Zhang, Shangzhe Wu, Noah Snavely, Jiajun Wu CVPR 2023 [www, pdf] What's in a Decade? Eric Ming Chen, Jin Sun, Apoorv Khandelwal, Dani Lischinski, Noah Snavely, Hadar Averbuch-Elor Eurographics 2023 [www, pdf] InfiniteNature-Zero Zhengqi Li, Qianqian Wang, Noah Snavely, Angjoo Kanazawa ECCV 2022 [www, pdf] ARF: Artistic Radiance Fields Kai Zhang, Nick Kolkin, Sai Bi, Fujun Luan, Zexiang Xu, Eli Shechtman, Noah Snavely ECCV 2022 [www, pdf, code] Structure and Motion for Casual Videos Zhoutong Zhang, Forrester Cole, Zhengqi Li, Michael Rubinstein, Noah Snavely, Bill Freeman ECCV 2022 [code, pdf] Dimensions of Motion Richard Strong Bowen*, Richard Tucker*, Ramin Zabih, Noah Snavely 3DV 2022 [www, pdf] Neural 3D Reconstruction in the Wild Jiaming Sun, Xi Chen, Qianqian Wang, Zhengqi Li, Hadar Averbuch-Elor, Xiaowei Zhou, Noah Snavely SIGGRAPH 2022 [www, pdf] IRON: Inverse Rendering by Optimizing Neural SDFs and Materials Kai Zhang, Fujun Luan, Zhengqi Li, Noah Snavely CVPR 2022 [www, pdf] Deformable Sprites for Unsupervised Video Decomposition V. Ye, Z. Li, R. Tucker, A. Kanazawa, N. Snavely CVPR 2022 [www, pdf] 3D Moments from Near-Duplicate Photos Qianqian Wang, Zhengqi Li, David Salesin, Noah Snavely, Brian Curless, Janne Kontkanen CVPR 2022 [www, pdf] Infinite Nature Andrew Liu*, Richard Tucker*, Varun Jampani, Ameesh Makadia, Noah Snavely, Angjoo Kanazawa ICCV 2021 [www, pdf] Towers of Babel Xiaoshi Wu*, Hadar Averbuch-Elor*, Jin Sun, Noah Snavely ICCV 2021 [www, pdf, data] Who's Waldo? Claire Yuqing Cui*, Apoorv Khandelwal*, Yoav Artzi, Noah Snavely, Hadar Averbuch-Elor ICCV 2021 [www, pdf] IBRNet: Learning Multi-View Image-Based Rendering Qianqian Wang, Z. Wang, K. Genova, P. Srinivasan, H. Zhou, J. Barron, R. Martin-Brualla, N. Snavely, T. Funkhouser CVPR 2021 [www, pdf] Neural Scene Flow Fields Zhengqi Li, Simon Niklaus, Noah Snavely, Oliver Wang CVPR 2021 [www, pdf] PhySG: Inverse Rendering with Spherical Gaussians Kai Zhang*, Fujun Luan*, Qianqian Wang, Kavita Bala, Noah Snavely CVPR 2021 [www, pdf] De-rendering the World's Revolutionary Artefacts Shangzhe Wu, Ameesh Makadia, Jiajun Wu, Noah Snavely, Richard Tucker, Angjoo Kanazawa CVPR 2021 [www, pdf] Extreme Rotation Estimation Ruojin Cai, Bharath Hariharan, Noah Snavely, Hadar Averbuch-Elor CVPR 2021 [www, pdf] KeypointDeformer Tomas Jakab, Richard Tucker, Ameesh Makadia, Jiajun Wu, Noah Snavely, Angjoo Kanazawa CVPR 2021 [www, pdf] DirectionNet Kefan Chen, Noah Snavely, Ameesh Makadia CVPR 2021 [www, pdf] Repopulating Street Scenes Yifan Wang, Andrew Liu, Richard Tucker, Jiajun Wu, Brian Curless, Steve Seitz, Noah Snavely CVPR 2021 [www, pdf] An Ethical Highlighter for People-Centric Dataset Creation Margot Hanley, Apoorv Khandelwal, Hadar Averbuch-Elor, N. Snavely, Helen Nissenbaum NeurIPS 2020 NBIAIR Workshop [pdf] MetaSDF: Meta-Learning Signed Distance Functions Vincent Sitzmann, Eric Chan, Richard Tucker, Noah Snavely (Google), Gordon Wetzstein NeurIPS 2020 [www, pdf] Multi-Plane Program Induction with 3D Box Priors Li*, Mao*, Zhang, Freeman, Tenenbaum, Snavely, Wu NeurIPS 2020 [www, pdf] Crowdsampling the Plenoptic Function Zhengqi Li, Wenqi Xian, Abe Davis, Noah Snavely ECCV 2020 [www, pdf] Learning Feature Descriptors using Camera Pose Supervision Qianqian Wang, Xiaowei Zhou, Bharath Hariharan, N. Snavely ECCV 2020 [www, pdf] Learning to Factorize and Relight a City Andrew Liu, Shiry Ginosar, Tinghui Zhou, Alexei A. Efros, Noah Snavely (Google Research) ECCV 2020 [www, pdf] Learning Gradient Fields for Shape Generation Ruojin Cai*, Guandao Yang*, Averbuch-Elor, Hao, Belongie, Snavely, Hariharan ECCV 2020 [www] Hidden Footprints: Learning Contextual Walkability Jin Sun, Hadar Averbuch-Elor, Qianqian Wang, Noah Snavely ECCV 2020 [www, pdf] Visual Chirality Zhiqiu Lin, Jin Sun, Abe Davis, Noah Snavely CVPR 2020 [www, pdf] Single-View View Synthesis with Multiplane Images Richard Tucker, Noah Snavely (Google Research) CVPR 2020 [www, pdf] Lighthouse: Predicting Lighting Volumes Srinivasan*, Mildenhall*, Tancik, Barron, Tucker, Snavely CVPR 2020 [www, pdf] DualSDF Zekun Hao, Hadar Averbuch-Elor, Noah Snavely, Serge Belongie CVPR 2020 [www, pdf] Depth Sensing Beyond LiDAR Range Kai Zhang, Jiaxin Xie, Noah Snavely, Qifeng Chen CVPR 2020 [www, pdf] Scene Summarization via Moti",
  "content_length": 16014,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:38"
}