{
  "name": "Noah John Cowan",
  "homepage": "https://limbs.lcsr.jhu.edu",
  "status": "success",
  "content": "Locomotion in Mechanical and Biological Systems Skip to content NAVIGATION AND CONTROL IN ANIMALS AND MACHINES The Locomotion in Mechanical and Biological Systems (LIMBS) Laboratory investigates the principles of sensorimotor integration that enable agile, robust movement in animals and robots. This work bridges neuroscience, biomechanics, and control theory, revealing how the brain and body coordinate motion and how these insights can inform the design of bio-inspired machines. The LIMBS Lab approaches animal locomotion as an analysis problem—reverse engineering how neural circuits interact with biomechanics to generate behavior—while viewing robotics as a design problem, using biological insights to engineer novel control strategies. The lab explores cross-modal sensory integration and motor control across diverse model systems. In Drosophila melanogaster, the team investigates how the brain fuses multisensory information to guide navigation under uncertainty. In weakly electric fish, they study how animals modulate sensory and motor outputs during complex social and environmental interactions. With collaborators, the LIMBS Lab has also explored the neural basis of airflow sensing and flight control in bats, tactile navigation in cockroaches, and upper limb movement disorders in individuals with cerebellar ataxia. Across these projects, a common thread is the use of control-theoretic frameworks to quantify how biological systems maintain stability and adapt to perturbations. The LIMBS Lab integrates behavioral experiments, neurophysiology, virtual reality environments, and mathematical modeling to uncover general principles of movement control. By collaborating closely with neuroscientists, engineers, and clinicians, the lab not only advances our understanding of animal and human motor systems, but also contributes to the development of more capable, adaptive robotic systems. The work done at the LIMBS lab has practical applications in many areas, such as developing better prosthetics, improving robotic systems for search and rescue missions, and enhancing our understanding of neurological disorders that affect movement. By bridging the gap between biology and engineering, the LIMBS lab is driving innovations that could significantly impact both healthcare and technology. We are part of the robotics center at Johns Hopkins called the Laboratory for Computational Sensing and Robotics. If you are interested in working in the LIMBS laboratory, please look under Opportunities. Prospective graduate students must read the Opportunities page before reaching out to Prof. Cowan. Sincerely,Noah J. CowanProfessor of Mechanical EngineeringCourtesy appointments in Computer Science,  Electrical & Computer Engineering, and NeurosciencePI of the LIMBS LaboratoryWhiting School of EngineeringJohns Hopkins University News from LIMBS Lab: Pitch Perfect: Debojyoti Biswas Named Postdoc Champion! Three Freshly Minted LIMBS PhDs! Congratulations to Krystal Lan! Congratulations Dr. Deng! Noah Cowan elevated to IEEE Fellow Joy Yeh wins PURA award",
  "content_length": 3078,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:35"
}