{
  "name": "Noam Aigerman",
  "homepage": "https://noamaig.github.io",
  "status": "success",
  "content": "Noam Aigerman's Homepage Noam Aigerman (pronounced \"Noh-uhm\", like Noah with an M at the end.) Associate Professor, University of Montreal Associate Academic Member, Mila Email noam.aigerman@umontreal.ca Google Maps Room 3359, André-Aisenstadt building, C.P. 6128, succ. Centre-Ville, Montréal, Québec, Canada H3C 3J7 Google Scholar Google Scholar Bluesky image/svg+xml Calendar I work on problems related to machine learning and 3D geometry. Namely, my research lies at the intersection of geometry processing, deep learning, and optimization, with applications in 3D vision and computer graphics. Currently, I mostly focus on using geometry processing to devise thoeretically-grounded machine learning approaches for 3D problems; and, vice-versa, approaching geometry processing tasks from a machine learning perspective. Group Current: Zihan Zhu (PhD, 2025 - ) Tianshu Kuai (PhD, 2024 - ) Thomas Peschlow (MSc, 2025 - ) Joey Marten (cosupervised with Prof. Derek Nowrouzezahrai) (MSc, 2025 - ) Darsh Kaushik (MSc, 2024 - ) Hongshuo Min (Undergraduate Intern, 2025) Alumni: Martin El Mqirmi (MSc, 2024 - 2025) Teaching Current Year: IFT6759 - Advanced Machine Learning Projects (winter 2026) Past Years: IFT6095 - Neural Geometry Processing (winter 2025) IFT6759 - Advanced Machine Learning Projects (winter 2025) IFT6095 - Neural Geometry Processing (winter 2024) Publications (hover over a project's image for a one-sentence summary) PoissonNet: A Local-Global Approach for Learning on Surfaces Arman Maesumi, Tanish Makadia, Thibault Groueix, Vladimir G. Kim, Daniel Ritchie, Noam Aigerman ACM Transactions on Graphics (SIGGRAPH Asia 2025) Paper | Project Page | Code Neural Kinematic Bases for Fluids Yibo Liu, Paul Kry, Kenny Erleben, Noam Aigerman, Sune Darkner, Teseo Schneider ACM SIGGRAPH Asia 2025 Paper | Code (coming soon) Differentiation Through Black-Box Quadratic Programming Solvers Connor W. Magoon, Fengyu Yang, Noam Aigerman, Shahar Z. Kovalsky NeurIPS 2025 Paper | Code View-Dependent Deformation Fields for 2D Editing of 3D Models Martin El Mqirmi, Noam Aigerman ACM/EG Expressive Symposium 2025 Paper | Code | Project Page Instant3dit: Multiview Inpainting for Fast Editing of 3D Objects Amir Barda, Matheus Gadelha, Vladimir G. Kim, Noam Aigerman, Amit Haim Bermano, Thibault Groueix CVPR 2025 Paper | Project Page MeshUp: Multi-Target Mesh Deformation via Blended Score Distillation Hyunwoo Kim, Itai Lang, Thibault Groueix, Noam Aigerman, Vladimir G. Kim, Rana Hanocka 3DV 2025 (best paper runnerup) Paper | Project Page Temporally-Consistent Surface Reconstruction using Metrically-Consistent Atlases Jan Bednarik, Noam Aigerman, Vladimir G. Kim, Siddhartha Chaudhuri, Shaifali Parashar, Mathieu Salzmann, Pascal Fua IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2025 Paper | Code MagicClay: Sculpting Meshes With Generative Neural Fields Amir Barda, Vladimir Kim, Noam Aigerman, Amit Haim Bermano, Thibault Groueix ACM SIGGRAPH Asia 2024 Paper | Project Page DECOLLAGE: 3D Detailization by Controllable, Localized, and Learned Geometry Enhancement Qimin Chen, Zhiqin Chen, Vladimir G. Kim, Noam Aigerman, Hao Zhang, Siddhartha Chaudhuri ECCV 2024 Paper | Project Page Temporal Residual Jacobians for Rig-free Motion Transfer Sanjeev Muralikrishnan, Niladri Shekhar Dutt, Siddhartha Chaudhuri, Noam Aigerman, Vladimir Kim, Matthew Fisher, Niloy Mitra ECCV 2024 Paper | Project Page Generative Escher Meshes Noam Aigerman, Thibault Groueix ACM SIGGRAPH 2024 Paper | Code TutteNet: Injective 3D Deformations by Composition of 2D Mesh Deformations Bo Sun, Thibault Groueix, Chen Song, Qixing Huang, Noam Aigerman CVPR 2024 Paper | Code Neural Semantic Surface Maps Luca Morreale, Noam Aigerman, Vladimir G. Kim, Niloy Mitra Computer Graphics Forum (Eurographics 2024) Project page Explorable Mesh Deformation Subspaces from Unstructured 3D Generative Models Arman Maesumi, Paul Guerrero, Vladimir G. Kim, Matthew Fisher, Siddhartha Chaudhuri, Noam Aigerman, Daniel Ritchie ACM SIGGRAPH Asia 2023 Project page TextDeformer: Geometry Manipulation using Text Guidance William Gao, Noam Aigerman, Thibault Groueix, Vladimir G. Kim, Rana Hanocka ACM SIGGRAPH 2023 Project page Neural Face Rigging for Animating and Retargeting Facial Meshes in the Wild Dafei Qin, Jun Saito, Noam Aigerman, Thibault Groueix, Taku Komura ACM SIGGRAPH 2023 Paper Neural Progressive Meshes Yun-Chun Chen, Vladimir G. Kim, Noam Aigerman, Alec Jacobson ACM SIGGRAPH 2023 Paper DA Wand: Distortion-Aware Selection using Neural Mesh Parameterization Richard Liu, Noam Aigerman, Vladimir G. Kim, Rana Hanocka CVPR 2023 Paper | Project page Learning Proximal Operators to Discover Multiple Optima Lingxiao Li, Noam Aigerman, Vladimir G. Kim, Jiajin Li, Kristjan Greenewald, Mikhail Yurochkin, Justin Solomon ICLR 2023 Paper | Code Isometric Energies for Recovering Injectivity in Constrained Mapping Xingyi Du, Danny M. Kaufman, Qingnan Zhou, Shahar Z. Kovalsky, Yajie Yan, Noam Aigerman, Tao Ju ACM SIGGRAPH Asia 2022 Project page PatchRD: Detail-Preserving Shape Completion by Learning Patch Retrieval and Deformation Bo Sun, Vladimir G. Kim, Noam Aigerman, Qixing Huang, Siddhartha Chaudhuri ECCV 2022 Paper | Code Learning Joint Surface Atlases Theo Deprelle, Thibault Groueix, Noam Aigerman, Vladimir G. Kim, Mathieu Aubry ECCV Workshop on Learning to Generate 3D Shapes and Scenes, 2022 Paper | Code Neural Jacobian Fields: Learning Intrinsic Mappings of Arbitrary Meshes Noam Aigerman, Kunal Gupta, Vladimir G. Kim, Siddhartha Chaudhuri, Jun Saito, Thibault Groueix ACM SIGGRAPH 2022 (journal track) Paper | Code Mobius Convolutions for Spherical CNNs Thomas Mitchel, Noam Aigerman, Vladimir G. Kim, Michael Kazhdan ACM SIGGRAPH 2022 Paper | Code Neural Convolutional Surfaces Luca Morreale, Noam Aigerman, Paul Guerrero, Vladimir G. Kim, Niloy Mitra CVPR 2022 Project Page GLASS: Geometric Latent Augmentation for Shape Spaces Sanjeev Muralikrishnan, Siddhartha Chaudhuri, Noam Aigerman, Vladimir G. Kim, Matthew Fisher, Niloy Mitra CVPR 2022 Paper Differentiable Surface Triangulation Marie-Julie Rakotosaona, Noam Aigerman, Niloy Mitra, Maks Ovsjanikov, Paul Guerrero ACM SIGGRAPH ASIA 2021 Paper | Code Optimizing Global Injectivity for Constrained Parameterization Xingyi Du, Danny M. Kaufman, Qingnan Zhou, Shahar Z. Kovalsky, Yajie Yan, Noam Aigerman, Tao Ju ACM SIGGRAPH ASIA 2021 Project Page Temporally-Coherent Surface Reconstruction via Metric-Consistent Atlases Jan Bednarik, Vladimir G. Kim, Siddhartha Chaudhuri, Shaifali Parashar, Mathieu Salzmann, Pascal Fua, Noam Aigerman ICCV 2021 Paper | Video Swept Volumes via Spacetime Numerical Continuation Silvia Sellán, Noam Aigerman, Alec Jacobson ACM SIGGRAPH 2021 Project Page DECOR-GAN: 3D Shape Detailization by Conditional Refinement Zhiqin Chen, Vladimir G. Kim, Matthew Fisher, Noam Aigerman, Hao Zhang, Siddhartha Chaudhuri CVPR 2021 (oral) Paper | Code Neural Surface Maps Luca Morreale, Noam Aigerman, Vladimir G. Kim, Niloy J. Mitra CVPR 2021 Project Page Learning Delaunay Surface Elements for Mesh Reconstruction Marie-Julie Rakotosaona, Paul Guerrero, Noam Aigerman, Niloy J. Mitra, Maks Ovsjanikov CVPR 2021 (oral) Project Page Joint Learning of 3D Shape Retrieval and Deformation Mikaela Angelina Uy, Vladimir G. Kim, Minhyuk Sung, Noam Aigerman, Siddhartha Chaudhuri, Leonidas Guibas CVPR 2021 Project Page Developability of Heightfields via Rank Minimization Silvia Sellán, Noam Aigerman, Alec Jacobson ACM SIGGRAPH 2020 Project Page Neural Subdivision Hsueh-Ti Derek Liu, Vladimir G. Kim, Siddhartha Chaudhuri, Noam Aigerman, Alec Jacobson ACM SIGGRAPH 2020 Paper | Code Lifting Simplices to Find Injectivity Xingyi Du, Noam Aigerman, Qingnan Zhou, Shahar Kovalsky, Yajie Yan, Danny M. Kaufman, Tao Ju ACM SIGGRAPH 2020 Paper | Project Page | Code | Data Set | Video Neural Cages for Detail-Preserving 3D Deformations Wang Yifan, Noam Aigerman, Vladimir G. Kim, Siddhartha Chaudhuri, Olga Sorkine-Hornung CVPR 2020 (oral) Paper | Project Page Coupling Explicit and Implicit Surface Representations for Generative 3D Modeling Omid Poursaeed, Matthew Fisher, Noam Aigerman, Vladimir G. Kim ECCV 2020 Project Page Spherical Orbifold Tutte Embeddings Noam Aigerman, Shahar Kovalsky, Yaron Lipman ACM SIGGRAPH 2017 Paper | Low Res | Code Convolutional Neural Networks on Surfaces via Seamless Toric Covers Haggai Maron, Meirav Galun, Noam Aigerman, Miri Trope, Nadav Dym, Ersin Yumer, Vladimir G. Kim, Yaron Lipman ACM SIGGRAPH 2017 Paper | Low Res | Code Hyperbolic Orbifold Tutte Embeddings Noam Aigerman, Yaron Lipman ACM SIGGRAPH Asia 2016 Paper | Low Res | Code Orbifold Tutte Embeddings Noam Aigerman, Yaron Lipman ACM SIGGRAPH Asia 2015 Paper | Low Res | Code Large Scale Bounded Distortion Mappings Shahar Kovalsky, Noam Aigerman, Ronen Basri, Yaron Lipman ACM SIGGRAPH Asia 2015 Paper | Low Res | Project Page Seamless Surface Mappings Noam Aigerman, Roi Poranne, Yaron Lipman ACM SIGGRAPH 2015 Paper | Low Res Lifted Bijections for Low Distortion Surface Mappings Noam Aigerman, Roi Poranne, Yaron Lipman ACM SIGGRAPH 2014 Paper | Low Res Controlling Singular Values with Semidefinite Programming Shahar Kovalsky, Noam Aigerman, Ronen Basri, Yaron Lipman ACM SIGGRAPH 2014 Paper | Low Res | Project Page Injective and Bounded Distortion Mappings in 3D Noam Aigerman, Yaron Lipman ACM SIGGRAPH 2013 Paper | Low Res | Project Page (code + data) Research, in a nutshell",
  "content_length": 9478,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:36"
}