{
  "name": "Nobuko Yoshida",
  "homepage": "https://www.doc.ic.ac.uk/~yoshida",
  "status": "success",
  "content": "Mobility Reading Group Prof Nobuko Yoshida Professor of Computing dblp teaching editorial works activities Publications Nobuko Yoshida is Professor of Computing at Imperial College London. Last 10 years, her main research interests are theories and applications of protocols specifications and verifications. She introduced multiparty session types [ POPL'08, JACM ] which received Most Influential POPL Paper Award in 2018 (judged by its influence over the last decade). This work enlarged the community and widened the scope of applications of session types, e.g. runtime monitoring based on Scribble (co-developed with Red Hat) has been deployed to other projects such as cyberinfrastructure in the US Ocean Observatories Initiative (OOI); and widened the scope of her research areas. She was awarded CNRS and JSSP visiting fellowships and visiting professorships at Paris VI and Paris VII. She is an editor of ACM Transactions on Programming Languages and Systems, Mathematical Structures in Computer Science, Journal of Logical Algebraic Methods in Programming, and the chief editor of The Computer-aided Verification and Concurrency Column for EATCS Bulletin. Her current industry partners include: Cognizant, Estafet, J.P. Morgan, Red Hat, Weaveworks, November Group, ABB, EDF Energy, Xilinx, EPCC Ltd, Codeplay Software Ltd and Mexeler. Department of Computing Imperial College London 180 Queen's Gate Room 556 South Kensington Campus London SW7 2AZ Tel: +44(0)20 759 48240 Fax: +44(0)20 758 18024 Publications 2022 Adam Barwell, Francisco Ferreira, Nobuko Yoshida: CONCUR Test-of-Time Award for the Period 1994–97 Interview with Uwe Nestmann and Benjamin C. Pierce. JLAMP : 100744. Zak Cutner, Nobuko Yoshida, Martin Vassor: Deadlock-Free Asynchronous Message Reordering in Rust with Multiparty Session Types. PPoPP '22 : 261 - 246. Lorenzo Gheri, Ivan Lanese, Neil Sayers, Emilio Tuosto, Nobuko Yoshida: Design-by-Contract for Flexible Multiparty Session Protocols. ECOOP 2022 : 8:1 - 8:28. Eva Graversen, Iain Phillips, Nobuko Yoshida: Event structures for the reversible early internal π-calculus. JLAMP . Adam Barwell, Alceste Scalas, Nobuko Yoshida, Fangyi Zhou: Generalised Multiparty Session Types with Crash-Stop Failures. To appear in CONCUR 22. Nicolas Lagaillardie, Rumyana Neykova, Nobuko Yoshida: Stay Safe under Panic: Affine Rust Programming with Multiparty Session Types. ECOOP 2022 : 4:1 - 4:29. 2021 Mario Bravetti, Marco Carbone, Julien Lange, Nobuko Yoshida, Gianluigi Zavattaro: A Sound Algorithm for Asynchronous Session Subtyping and its Implementation. LMCS . Nobuko Yoshida, Fangyi Zhou, Francisco Ferreira: Communicating Finite State Machines and an Extensible Toolchain for Multiparty Session Types. FCT 2021 : 18 - 35. Anson Miu, Francisco Ferreira, Nobuko Yoshida, Fangyi Zhou: Communication-Safe Web Programming in TypeScript with Routed Multiparty Session Types. CC 2021 : 94 - 106. Eva Graversen, Iain Phillips, Nobuko Yoshida: Event Structure Semantics of (controlled) Reversible CCS. JLAMP . Bernardo Toninho, Nobuko Yoshida: On Polymorphic Sessions And Functions: A Tale of Two (Fully Abstract) Encodings. TOPLAS : 7:1 - 7:55. Silvia Ghilezan, Jovanka Pantovic, Ivan Prokic, Alceste Scalas, Nobuko Yoshida: Precise Subtyping for Asynchronous Multiparty Sessions. POPL 2021 : 16:1 - 16:28. Zak Cutner, Nobuko Yoshida: Safe Session-Based Asynchronous Coordination in Rust. COORDINATION 2021 : 89 - 80. David Castro-Perez, Francisco Ferreira, Lorenzo Gheri, Nobuko Yoshida: Zooid: A DSL for Certified Multiparty Computation. PLDI 2021 : 237 - 251. 2020 Doriana Medic, Claudio Antares Mezzina, Iain Phillips, Nobuko Yoshida: A Parametric Framework for Reversible Pi-Calculi. IC : 1 - 57. Nobuko Yoshida, Lorenzo Gheri: A Very Gentle Introduction to Multiparty Session Types. ICDCIT 2020 : 73 - 93. David Castro-Perez, Nobuko Yoshida: CAMP: Cost-Aware Multiparty Session Protocol. OOPSLA 2020 : 155:1 - 155:30. David Castro-Perez, Nobuko Yoshida: Compiling First-Order Functions to Session-Typed Parallel Code. CC 2020 : 143 - 154. David Castro-Perez, Francisco Ferreira, Nobuko Yoshida: EMTST: Engineering the Meta-theory of Session Types. TACAS 2020 : 285 - 278. Eva Graversen, Iain Phillips, Nobuko Yoshida: Event Structures for the Reversible Early Internal Pi-Calculus. RC 2020 : 71 - 90. Sung-Shik Jongmans, Nobuko Yoshida: Exploring Type-Level Bisimilarity towards More Expressive Multiparty Session Types. ESOP 2020 : 251 - 279. Robert Griesemer, Raymond Hu, Wen Kokke, Julien Lange, Ian Lance Taylor, Bernardo Toninho, Philip Wadler, Nobuko Yoshida: Featherweight Go. OOPSLA 2020 : 149:1 - 149:29. Anson Miu, Francisco Ferreira, Fangyi Zhou, Nobuko Yoshida: Generating Interactive WebSocket Applications in TypeScript. PLACES@ETAPS 2020 : 12 - 22. Nicolas Lagaillardie, Rumyana Neykova, Nobuko Yoshida: Implementing Multiparty Session Types in Rust. COORDINATION 2020 : 127 - 136. Nicolas Lagaillardie, Rumyana Neykova, Nobuko Yoshida: Implementing Multiparty Session Types in Rust. PLACES@ETAPS 2020 : 1 - 8. Rupak Majumdar, Nobuko Yoshida, Damien Zufferey: Multiparty Motion Coordination: From Choreographies to Robotics Programs. OOPSLA 2020 : 134:1 - 134:30. Keigo Imai, Rumyana Neykova, Nobuko Yoshida, Shoji Yuen: Multiparty Session Programming with Global Protocol Combinators. ECOOP 2020 : 9:1 - 9:30. Julia Gabet, Nobuko Yoshida: Static Race Detection and Mutex Safety and Liveness for Go Programs. ECOOP 2020 : 4:1 - 4:30. Fangyi Zhou, Francisco Ferreira, Raymond Hu, Rumyana Neykova, Nobuko Yoshida: Statically Verified Refinements for Multiparty Protocols. OOPSLA 2020 : 148:1 - 148:30. 2019 Mario Bravetti, Marco Carbone, Julien Lange, Nobuko Yoshida, Gianluigi Zavattaro: A Sound Algorithm for Asynchronous Session Subtyping. CONCUR 19 : 38:1 - 38:16. Laura Bocchi, Maurizio Murgia, Vasco Thudichum Vasconcelos, Nobuko Yoshida: Asynchronous Timed Session Types. ESOP 2019 : 583 - 610. Simon Castellan, Nobuko Yoshida: Causality in Linear Logic. FoSSaCS 2019 : 150 - 168. Nicola Atzei, Massimo Bartoletti, Stefano Lande, Nobuko Yoshida, Roberto Zunino: Developing secure Bitcoin contracts with BitML.. ESEC/FSE 2019 : 1124 - 1128. David Castro-Perez, Raymond Hu, Sung-Shik Jongmans, Nicholas Ng, Nobuko Yoshida: Distributed Programming Using Role Parametric Session Types in Go. POPL 2019 : 29:1 - 29:30. Tiago Cogumbreiro, Raymond Hu, Francisco Martins, Nobuko Yoshida: Dynamic deadlock verification for general barrier synchronisation. TOPLAS : 1 - 38. Rumyana Neykova, Nobuko Yoshida: Featherweight Scribble. ROCCO65 : 236 - 259. Alceste Scalas, Nobuko Yoshida: Less Is More: Multiparty Session Types Revisited. POPL 2019 : 30:1 - 30:29. Rupak Majumdar, Marcus Pirron, Nobuko Yoshida, Damien Zufferey: Motion Session Types for Robotic Interactions. ECOOP 2019 : 28:1 - 28:27. Jonathan King, Nicholas Ng, Nobuko Yoshida: Multiparty Session Type-safe Web Development with Static Linearity. PLACES 2019 : 35 - 46. Dimitrios Kouzapas, Jorge A. Pérez, Nobuko Yoshida: On the Relative Expressiveness of Higher-Order Session Processes. IC : 1 - 54. Bernardo Toninho, Nobuko Yoshida: Polymorphic Session Processes as Morphisms. FC : 101 - 117. Silvia Ghilezan, Svetlana Jaksic, Jovanka Pantovic, Alceste Scalas, Nobuko Yoshida: Precise subtyping for synchronous multiparty sessions. JLAMP : 127 - 173. Assel Altayeva, Nobuko Yoshida: Service Equivalence via Multiparty Session Type Isomorphisms. PLACES 2019 : 1 - 11. Keigo Imai, Nobuko Yoshida, Shoji Yuen: Session-Ocaml: a Session-based Library with Polarities and Lenses. scico : 1 - 50. Eva Graversen, Iain Phillips, Nobuko Yoshida: Towards a Categorical Representation of Reversible Event Structures. JLAMP : 16 - 59. Simon Castellan, Nobuko Yoshida: Two Sides of the Same Coin: Session Types and Game Semantics. POPL 2019 : 27:1 - 27:29. Julien Lange, Nobuko Yoshida: Verifying Asynchronous Interactions via Communicating Session Automata. CAV 2019 : 117 - 97. Alceste Scalas, Nobuko Yoshida, Elias Benussi: Verifying message-passing programs with dependent behavioural types. PLDI 2019 : 502 - 516. 2018 Doriana Medic, Claudio Antares Mezzina, Iain Phillips, Nobuko Yoshida: A Parametric Framework for Reversible Pi-Calculi. EXPRESS/SOS'18 : 87 - 103. Rumyana Neykova, Raymond Hu, Nobuko Yoshida, Fahd Abdeljallal: A Session Type Provider: Compile-time API Generation for Distributed Protocols with Interaction Refinements in F#. CC 2018 : 128 - 138. Julien Lange, Nicholas Ng, Bernardo Toninho, Nobuko Yoshida: A Static Verification Framework for Message Passing in Go using Behavioural Types. ICSE 2018 : 1137 - 1148. Romain Demangeon, Nobuko Yoshida: Causal Computational Complexity of Distributed Processes. LICS 2018 : 344 - 353. Bernardo Toninho, Nobuko Yoshida: Depending On Session Typed Process. FoSSaCS 2018 : 128 - 145. Eva Graversen, Iain Phillips, Nobuko Yoshida: Event Structure Semantics of (controlled) Reversible CCS. RC 2018 : 122 - 102. Bernardo Toninho, Nobuko Yoshida: Interconnectability of Session Based Logical Processes. TOPLAS : 1 - 42. Alceste Scalas, Nobuko Yoshida: Multiparty Session Types, Beyond Duality. JLAMP : 55 - 84. Bernardo Toninho, Nobuko Yoshida: On Polymorphic Sessions And Functions: A Tale of Two (Fully Abstract) Encodings. ESOP 2018 : 827 - 855. 2017 Laura Bocchi, Tzu-Chun Chen, Romain Demangeon, Kohei Honda, Nobuko Yoshida: Monitoring Networks through Multiparty Session Types. TCS : 33 - 58. Rumyana Neykova, Laura Bocchi, Nobuko Yoshida: Timed Runtime Monitoring for Multiparty Conversations. FAOC : 1 - 34. Alceste Scalas, Ornela Dardha, Raymond Hu, Nobuko Yoshida: A Linear Decomposition of Multiparty Sessions for Safe Distributed Programming. ECOOP 2017 : 24:1 - 24:31. Julien Lange, Emilio Tuosto, Nobuko Yoshida: A Tool for Choreography-Based Analysis of Message-Passing Software. Behavioural Types: from Theory to Tools : 125 - 146. Bernardo Toninho, Nobuko Yoshida: Certifying data in multiparty session types. JLAMP . Dimit",
  "content_length": 33825,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:41"
}