{
  "name": "Nodari Sitchinava",
  "homepage": "http://www2.hawaii.edu/~nodari",
  "status": "success",
  "content": "Nodari Sitchinava Nodari Sitchinava Professor Algorithms and Parallel Computing Group (AlgoPARC) Department of Information and Computer Sciences University of Hawaii at Manoa Research Publications Service Teaching Contact Research My research focuses on algorithms for modern parallel systems. Most recently, I've been working on cache-efficient parallel algorithms for multicores and GPUs. Since efficient utilization of locality is essential for the performance on modern systems, I am interested in I/O-efficient algorithms, cache-oblivious algorithms and communication-efficient distributed algorithms (e.g. in the bulk-synchronous parallel (BSP) model and MapReduce) and limits of computation in these models (lower bounds). I am also interested in computational geometry and graph algorithms. Publications You can click on the title of the publication to view a PDF or click on next to the publication to see additional info, including abstract and links to the official publication on the publisher's website. You can also find my publications on Google Scholar and on DBLP. If you find any links missing or broken, please let me know. As is customary in the algorithms research, most of my publications are in the alphabetical author order. The few publications, which appear in the venues where authorship is ordered by individual contributions, are marked with (*). Disclaimer: The papers are provided here for prompt dissemination of research results. For some of them the copyright is held by the respective publishers and should not be reproduced or republished elsewhere. The definitive versions are available from the official publishers' websites (via the provided DOI links). Conference Proceedings K. Berney, N. Sitchinava \"Eliminating bank conflicts in GPU mergesort\". In Proceedings of the 37th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), pages 158-170, 2025. Abstract: Graphics Processing Units (GPUs) have emerged as popular architectures for high-performance computing due to their parallelism and low latency context switching capabilities. However, optimizing GPU implementations can be challenging due to the complexity of the architecture, such as the diverse characteristics of memory units. While most optimization efforts focus on parallelism and global memory access, for some algorithms memory conflicts in shared memory, known as bank conflicts, can significantly impact performance. This affects the accuracy of theoretical runtime analysis of GPU algorithms. In this paper, we present a number-theoretic solution for eliminating all bank conflicts for Thrust library's mergesort implementation -- the fastest comparison-based sorting implementation on GPUs. Our experiments demonstrate that the modified mergesort takes virtually the same time to run on the worst-case inputs as it does on random inputs (the worst-case inputs have been shown in the past to cause up to 50% slowdown). PDF BIBTEX DOI Related Software P. Afshani, N. Sitchinava. \"A cell probe lower bound for the predecessor search problem in PRAM\". In Proceedings of the 36th ACM-SIAM Symposium on Discrete Algorithms (SODA), pages 3998-4008, 2025. Abstract: We study the predecessor search problem in the classical PRAM model of computation. In this problem, the input is a set of n l-bit integers and the goal is to store the input in a data structure of size S(n) such that given a query value q, the predecessor of q can be found efficiently. This is a very classical problem with an extensive history. We prove a lower bound for this problem in the strongest CRCW PRAM model. A simplified version of the lower bound states that in a K-processor PRAM model with O(log n)-bit registers, the query requires Ω(logKlog n) worst-case time under the realistic setting where the space is near-linear. PDF BIBTEX DOI N. Sitchinava, R. Svenning. \"The all nearest smaller values problem revisited in practice, parallel and external memory\". In Proceedings of the 36th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), pages 259--268, 2024. Abstract: We present a thorough investigation of the All Nearest Smaller Values (ANSV) problem from a practical perspective. The ANSV problem is defined as follows: given an array A consisting of n values, for each entry A i compute the largest index l < i and the smallest index r > i such that A i > Al and Ai > Ar, i.e., the indices of the nearest smaller values to the left and to the right of Ai. The ANSV problem was solved by Berkman, Schieber, and Vishkin [J. Algorithms, 1993] in the PRAM model. Their solution in the CREW PRAM model, which we will refer to as the BSV algorithm, achieves optimal O(n) work and O(log n) span. Until now, the BSV algorithm has been perceived as too complicated for practical use, and we are not aware of any publicly available implementations. Instead, the best existing practical solution to the ANSV problem is the implementation by Shun and Zhao presented at DCC’13. They implemented a simpler O(n log n)-work algorithm with an additional heuristic first proposed by Blelloch and Shun at ALENEX’11. We refer to this implementation as the BSZ algorithm. In this paper, we implement the original BSV algorithm and demonstrate its practical efficiency. Despite its perceived complexity, our results show that its performance is comparable to the BSZ algorithm. We also present the first theoretical analysis of the heuristic implemented in the BSZ algorithm and show that it provides a tunable trade-off between optimal work and optimal span. In particular, we show that it achieves O(n(1 + log nk)) work and O(k(1 + log nk)) span, for any integer parameter 1 ≤ k ≤ n. Thus, for k = Θ(log n), the BSZ algorithm can be made to be work-optimal, albeit at the expense of increased span compared to BSV. Our discussion includes a detailed examination of different input types, particularly highlighting that for random inputs, the low expected distance between values and their nearest smaller values renders simple algorithms efficient. Finally, we analyze the input/output (I/O) complexities of the BSV algorithm. PDF BIBTEX DOI Related Software P. Afshani, J. Iacono, V. Jayapaul, B. Karsin, N. Sitchinava. \"Locality-of-reference optimality of cache-oblivious algorithms\". In Proceedings of the Third SIAM Symposium on Algorithmic Principles of Computer Systems (APOCS), pages 31-45, 2022. Abstract: The program performance on modern hardware is characterized by locality of reference, that is, it is faster to access data that is close in address space to data that has been accessed recently than data in a random location. This is due to many architectural features including caches, prefetching, virtual address translation and the physical properties of a hard disk drive; attempting to model all the components that constitute the performance of a modern machine is impossible, especially for general algorithm design purposes. What if one could prove an algorithm is asymptotically optimal on all systems that reward locality of reference, no matter how it manifests itself within reasonable limits? We show that this is possible, and that excluding some pathological cases, cache-oblivious algorithms that are asymptotically optimal in the ideal-cache model are asymptotically optimal in any reasonable setting that rewards locality of reference. This is surprising as the cache-oblivious framework envisions a particular architectural model involving blocked memory transfer into a multi-level hierarchy of caches of varying sizes, and was not designed to directly model locality-of-reference correlated performance. PDF BIBTEX ARXIV DOI M.T. Goodrich, R. Jacob, N. Sitchinava. \"Atomic power in forks: a super-logarithmic lower bound for implementing butterfly networks in the Nonatomic Binary Fork-Join model\". In Proceedings of the 32nd ACM-SIAM Symposium on Discrete Algorithms (SODA), pages 2141-2153, 2021. Abstract: We prove an Ω(log n loglog n) lower bound for the span of implementing the n-input, log n-depth FFT circuit (also known as butterfly network) in the nonatomic binary fork-join model. In this model, memory-access synchronizations occur only through fork operations, which spawn two child threads, and join operations, which resume a parent thread when its child threads terminate. Our bound is asymptotically tight for the nonatomic binary fork-join model, which has been of interest of late, due to its conceptual elegance and ability to capture asynchrony. Our bound implies super-logarithmic lower bound in the nonatomic binary fork-join model for implementing the butterfly merging networks used, e.g., in Batcher's bitonic and odd-even mergesort networks. This lower bound also implies an asymptotic separation result for the atomic and nonatomic versions of the fork-join model, since, as we point out, FFT circuits can be implemented in the atomic binary fork-join model with span equal to their circuit depth. PDF BIBTEX DOI J. Ellert, J. Fischer, N. Sitchinava. \"LCP-aware parallel string sorting\". In Proceedings of the 26th International European Conference on Parallel and Distributed Computing (Euro-Par), pages 329-342, 2020. Abstract: When lexicographically sorting strings, it is not always necessary to inspect all symbols. For example, the lexicographical rank of europar amongst the strings eureka, eurasia, and excells only depends on its so called relevant prefix euro. The distinguishing prefix size D of a set of strings is the number of symbols that actually need to be inspected to establish the lexicographical ordering of all strings. Efficient string sorters should be D-aware, i.e. their complexity should depend on D rather than on the total number N of all symbols in all strings. While there are many D-aware sorters in the sequential setting, there appear to be no such results in the PRAM model. We propose a framework yielding a D-aware modification of any existing PRAM string sorter. The derived algorithms are wor",
  "content_length": 54891,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:40"
}