{
  "name": "Noelia Barreira-Rodríguez",
  "homepage": "https://pdi.udc.es/en/File/Pdi/2829E",
  "status": "success",
  "content": "María Noelia Barreira Rodríguez File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Grupo de Visión Artificial y Reconocimiento de Patrones Research lines Computer Vision, Medical Imaging Contacto UDC directory Orcid id0000-0003-0961-2057 ResearcherIDN-4006-2014 Scopus55901814100 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Advanced Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Analysis of Biomedical Images Master in Bioinformatics for Health Sciences Compulsory 0 23 Computer Vision II Master's Degree in Artificial Intelligence Optional 0 10.5 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 16.5 Fundamentals of Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 83 Master´s Dissertation Master's Degree in Artificial Intelligence Compulsory 0 10.5 Master's Dissertation Master's in Computer Engineering Compulsory 0 5 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 10 Subject and involved studies Type Distance hours Total hours Advanced Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Analysis of Biomedical Images Master in Bioinformatics for Health Sciences Compulsory 0 23 Computer Vision II Master's Degree in Artificial Intelligence Optional 0 10.5 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 14.5 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 0.5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 9 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 4.5 Fundamentals of Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 75 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 3.5 Master's Dissertation Master in Computer Vision Compulsory 0 10.83 Subject and involved studies Type Distance hours Total hours Advanced Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Analysis of Biomedical Images Master in Bioinformatics for Health Sciences Compulsory 0 23 Computer Vision II Master's Degree in Artificial Intelligence Optional 0 10.5 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 8.5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 2.5 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 12.5 Fundamentals of Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 45 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 8 Master's Dissertation Master in Computer Vision Compulsory 0 1 Subject and involved studies Type Distance hours Total hours Advanced Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Analysis of Biomedical Images Master in Bioinformatics for Health Sciences Compulsory 0 23 Computer Vision II Master's Degree in Artificial Intelligence Optional 0 10.5 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8 Fundamentals of Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 50 Work Placement Master in Bioinformatics for Health Sciences Master in Bioinformatics for Health Sciences Optional 0 1 Subject and involved studies Type Distance hours Total hours Advanced Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Analysis of Biomedical Images Master in Bioinformatics for Health Sciences Compulsory 0 22 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8 Fundamentals of Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 50 Programming II Degree in Computer Engineering Core 0 7 Work Placement Master in Bioinformatics for Health Sciences Master in Bioinformatics for Health Sciences Optional 0 1 Subject and involved studies Type Distance hours Total hours Advanced Image Processing and Analysis Master in Computer Vision Compulsory 0 5 Analysis of Biomedical Images Master in Bioinformatics for Health Sciences Compulsory 0 22 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 16 Fundamentals of Image Processing and Analysis Master in Computer Vision Compulsory 0 7 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 15 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 8 Programming II Degree in Computer Engineering Core 0 24 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Monday 11:00 a 13:00 Teams o presencial 1st quarter Tuesday 10:30 a 11:30 Teams o presencial 1st quarter Tuesday 12:30 a 13:30 Teams o presencial 1st quarter Thursday 12:30 a 13:30 Teams o presencial 1st quarter Thursday 10:30 a 11:30 Teams o presencial 2nd quarter Monday 11:00 a 13:00 Teams o presencial 2nd quarter Tuesday 11:00 a 13:00 Teams o presencial 2nd quarter Thursday 11:00 a 13:00 Teams o presencial EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 2017/2018 2016/2017 2015/2016 2014/2015 2013/2014 Conversational Assistant for the Interpretation and Consultation of European Regulations. Mobile application for the management of small livestock farms CloutFit: Clothing recommendation system with mobile and web application Computer-aided tool for seed viability assessment TripExpenses: application for managing business travel expenses Vertical social network of public restrooms reviews. Development of a support system for online Digimon card games Foam segmentation in water treatment plants InfoVaca, cattle farm data management application Medición automática do tempo de ruptura da película lagrimal baseada en métodos de aprendizaxe profunda OutMe: virtual closet management mobile application Deep learning for optic disc and retinal layer segmentation in optic disc-centred OCT images Framework for product monitoring at points of sale Horse route mobile application Migration and update of a time management application to an SPA based architecture with a React frontend and GraphQL backend. MakeYourMenu: SaaS application for digital menu customization Real-time vehicle tracking platform for carrier companies Tool for assessing DNA damage in spider crab sperm by comet assay Automatic analysis of nailfold capillaroscopy images Automatic tool for analysis and classification of nail fold capillaroscopy images Automatic tool for the segmentation of the aorta artery from computerized tomography images Computer-aider tool for diagnosis, monitoring and measurement of volumes in cases of lymphedema Application to discover new friendships based on interests shown in publications of other social networks Energetic Efficiency in WWTPs Tool for the automatic detection of barcodes in product images Calendars of Accesories generation for Factories Multiplatform system for the queue management in establishments Social application (web on Android) for communication and collaboration among participants in events Monitoring and geopositioning platform of sensors in drawings Venous artery tree reconstruction on 3D from retinal OCT images KGuardiant. Intelligent surveillance system based on Kinect Development of a tool form medical studies management and analysis in an optometry service Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Book chapters PhD theses directed Conference papers 2025 2024 2023 2022 2021 ... 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 Funding entity National Council for Scientific and Technological Development-CNPq/MCTI/FNDCT Main researches Joaquim de Moura Type Proyecto Internacional Dates From 01/01/2025 to 31/12/2026 Funding entity Consellería de Educación, Ciencia, Universidades e Formación Profesional Main researches Marcos Ortega Hortas Type Proyecto Programas Autonomicos Dates From 01/01/2024 to 20/11/2027 Funding entity Ibonelab S.L. Main researches N. Barreira Type Contrato Dates From 01/01/2023 to 21/12/2023 Funding entity COMISIÓN EUROPEA Main researches M. G. Penedo Type Proyecto Internacional Dates From 01/01/2022 to 31/12/2026 Funding entity Ministerio de Ciencia e Innovación Main researches Marcos Ortega Hortas (IP1) / Jorge Novo Buján (IP2) Type Proyecto Programas Nacionales Dates From 01/12/2022 to 30/11/2024 Funding entity Ministerio de Ciencia e Innovación Main researches Marcos Ortega Hortas Type Proyecto Programas Nacionales Dates From 01/12/2022 to 30/11/2024 Funding entity Instituto Universitario de Investigación en Atención Primaria (IDIAP) Jordi Gol Main researches M. Ortega Type Contrato Dates From 01/03/2022 to 31/12/2025 Funding entity AGATA TECHN",
  "content_length": 54164,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:43"
}