{
  "name": "Nor Badrul Anuar",
  "homepage": "https://umexpert.um.edu.my/badrul",
  "status": "success",
  "content": "UMEXPERT - PROF. TS. DR. NOR BADRUL ANUAR BIN JUMA'AT PROF. TS. DR. NOR BADRUL ANUAR BIN JUMA'AT Department of Computer System & Technology Faculty of Computer Science and Information Technology badrulum.edu.my View CV View 1-Page CV Publons Scopus Link Biography Nor Badrul Anuar is an accomplished academic leader with a wealth of experience in various leadership positions. He currently serves as the Associate Vice Chancellor for Infrastructure and Information Services and acts as the Chief Information Officer at Universiti Malaya, where he leads various university services, including ICT, physical infrastructure, sports, and library services. As a senate member, he also chairs many ICT and infrastructure development committees. In addition, he leads the Centre of Research for Cyber Security & Network (CSNET). Nor Badrul Anuar began his academic journey at Universiti Malaya, earning his Bachelor's and Master's degrees in Computer Science in 2001 and 2003, respectively. He obtained his PhD at the Centre for Information Security & Network Research, University of Plymouth, UK 2012. After joining Universiti Malaya as a tutor in 2001, he was promoted to lecturer in 2003, senior lecturer in 2008, and associate professor in 2017. In 2022, he was promoted to full professor at the Faculty of Computer Science and Information Technology at Universiti Malaya, Kuala Lumpur. In addition, he is also serving as a visiting professor at the Institute of Informatics and Computing in Energy (IICE), Universiti Tenaga Nasional, Malaysia. He has supervised numerous post-doctoral fellows and research students, including eighteen PhD and six master's research students, in the computer network security and applications domain between 2012 and 2022. He has published extensively on computer security and applications, with his work being featured in academic journals both domestically and internationally. As of January 2023, his 152 published papers have attracted 7,670 citations and obtained an H-index of 41, making him a highly cited scholar. He is recognised as an expert in several subject categories, including computer science, engineering, science & technology - other topics, telecommunications, and information science & library science, by Web of Science. In 2022, Stanford University recognised him as one of the world's top 2% scientists. Currently, he serves on the editorial board of two journals, including the Journal of Network and Computer Applications (JNCA), which has an impact factor of 7.574. He has received numerous honours and recognitions throughout his illustrious career. He was honoured by Universiti Malaya for eight consecutive years, from 2012 to 2019, for his outstanding service. In 2015, he was recognised as an outstanding lecturer in science at Universiti Malaya and was awarded the university's highest honour, the Universiti Malaya Excellence Award (Anugerah Cemerlang Universiti Malaya). His research interests are intrusion detection systems, high-speed networks, and management information systems. Specifically, he focuses on intrusion detection systems, intrusion response systems, security events and management, digital forensic and network security, switching, routing, IPv6, and multicast. His current research explores network traffic classification and its applications and the role of federated learning in enhancing network security. Hide Collaborator nizam_ayub sitihafizah rosli_salleh rozanaothman syedabdrazak angtf cswoo zules ainins cochow yamani zairul kamarul norisma zulkana abdullah noraniza norjihan misslaiha View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Latest Publications View All Article in Academic Journals Chapter in book Proceeding 2025 Machine learning for Internet of Things (IoT) device identification: a comparative study 2025 A bibliometric and content analysis of technological advancement applications in agricultural e-commerce 2023 Fifteen years of YouTube scholarly research: knowledge structure, collaborative networks, and trending topics 2023 ROOTECTOR: Robust Android Rooting Detection Framework Using Machine Learning Algorithms 2019 Evaluation of IoT-based computational intelligence tools for DNA sequence analysis in bioinformatics 2019 User profiling in anomaly detection of authorization logs 2018 Challenges of Internet of Things and Big Data Integration 2015 Blind Source Computer Device Identification from Recorded Calls 2017 Performance evaluation of virtual desktop operating systems in virtual desktop infrastructure 2017 The Internet of Things adoption in healthcare applications. 2017 Computational intelligence tools and databases in bioinformatics 2015 Pixel value differencing steganography techniques: Analysis and open challenge",
  "content_length": 4927,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:44"
}