{
  "name": "Nor Liyana Mohd Shuib",
  "homepage": "https://umexpert.um.edu.my/liyanashuib",
  "status": "success",
  "content": "UMEXPERT - PROF. DR. NOR LIYANA BT MOHD SHUIB PROF. DR. NOR LIYANA BT MOHD SHUIB Department of Information System Faculty of Computer Science and Information Technology liyanashuibum.edu.my View CV View 1-Page CV Publons Scopus Link Biography Professor Dr. Nor Liyana Mohd Shuib is a distinguished academic at the Faculty of Computer Science and Information Technology, Universiti Malaya, where she coordinates the Bachelor of Computer Science (Data Science) program. Ranked among the top 2% of scientists globally by Stanford University in 2023-2024, she is renowned for her excellence in research, innovation, and consultancy. Throughout her career, Professor Liyana has successfully supervised numerous PhD students to completion, reflecting her dedication to mentoring and nurturing future scholars. She is a prolific researcher with a Scopus H-index of 35 and a Web of Science H-index of 32, and she has published extensively in high-impact journals and international conference proceedings. Her research interests include personalization, e-learning, recommender systems, data analytics, data science, AI applications, and educational technology. An accomplished innovator, Professor Liyana has received over 30 prestigious awards at both national and international levels, including multiple best paper accolades. She leads impactful projects as the Principal Investigator, notably on digital skills frameworks and mental health applications for senior citizens, alongside various AI-driven initiatives in Healthcare and Education. Her consultancy work for Malaysia's Ministry of Higher Education includes evaluating digital learning readiness across higher education institutions. A senior member of the IEEE Computer Society, Professor Liyana also serves as an Adjunct Professor at Universitas Semarang, Indonesia, where she continues to advance the fields of computer science and AI applications. Hide Collaborator isma_jaafar suraya_hamid hanizaaminudin amir sdevi zaily ainins badrul sameem mariney norisma ainuddin fazmidar maizatul noraniza norjihan View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status 2heal 2.0: Pemantapan Kesedaran Kesihatan Mental Di Kalangan Pesara on going Digital Transformation In Selangor: The Identification And Recommendation Of Digital Skills Of Public Officers In Selangor Government end This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Chapter in book Proceeding 2024 Technology-Assisted Language Learning Systems: A Systematic Literature Review 2024 Features, techniques and evaluation in predicting articles' citations: a review from years 2010-2023 2023 Exploring Social Media and Organisational Sustainability Performance Goals: Themes, Functional Areas, and Practices Learning from the Preceding Decade 2023 Mobile English language learning: a systematic review of group size, duration, and assessment methods 2019 Sustainability Reporting: The Faculty Report Card 2019 Microblogging Hashtag Recommendation Considering Additional Metadata 2018 Design of an Algebraic Concept Operator for Adaptive Feedback in Physics 2018 Mobile Games for Language Learning 2021 A Proposed Gamification Elements of Educational Games 2019 An Enhancement of Malay Social Media Text Normalization for Lexicon-Based Sentiment Analysis 2019 Evidence of Students Gaming the System and Going Off-Task in an Intelligent Tutoring System 2019 The Architecture of Knowledge-Based Tool For UM Nature Inspired Library",
  "content_length": 3756,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:46"
}