{
  "name": "Nor Aniza Abdullah",
  "homepage": "https://umexpert.um.edu.my/noraniza",
  "status": "success",
  "content": "UMEXPERT - ASSOCIATE PROF. DR. NOR ANIZA BINTI ABDULLAH ASSOCIATE PROF. DR. NOR ANIZA BINTI ABDULLAH Department of Computer System & Technology Faculty of Computer Science and Information Technology noranizaum.edu.my View CV View 1-Page CV Publons Scopus Link Biography NOR ANIZA ABDULLAH is an Associate Professor at the Faculty of Computer Science and Information Technology (FCSIT), University of Malaya, Malaysia. She graduated with Bachelor degree (Hons) in Computer Science from the University of Malaya. (UM) She has a Master degree in Interactive Multimedia from the Westminster University, London. She obtained her PhD degree in Computer Science from the Southampton University, United Kingdom in 2006. She was the Deputy Dean of the Equitable Society Research Cluster, UM from year 2016 until 2018. She was the Deputy Dean of Undergraduate at FCSIT from 2011 until 2013. She was the Head of the Multimedia Unit of FCSIT from 1999 until 2003, and from 2007 until 2011. She was the Lead Internal Auditor to Faculty of Engineering, UM, during the university's first internal auditing exercise for MS ISO 9001:2000, in the year 2002. She was the Quality Manager for FCSIT from 2012 to 2013. She was the Chairperson for the UM Student Council Selection Audit Committee in 2012. In year 2012-2013 she led a committee to study and enhance the quality of teaching of programming courses at the faculty. She received the UM Excellence Service Awards in year 2001 and year 2013. Her research interests include personalized learning, multimedia retrieval, multimedia recommender system, machine learning/deep learning, sentiment analysis, mobile crowdsourcing, augmented reality, image processing, and medical imaging informatics. She has authored or co-authored 58 publications in the Web of Science (WOS) with WOS h-index 10, Scopus h-index 13, and Google Scholar h-index-19. Most of her WOS journal publications are in tier-1 and tier-2. She has successfully supervised many postgraduate and undergraduate students. Kindly visit the following links for further details on her publications: Orcid: 0000-0001-6218-8772, ResearcherID: B-2768-2010; Scopus Author ID: 26659416000 Hide Collaborator aznulqalid isma_jaafar suraya_hamid jeannie_wong80 amir izlin zaily ainins badrul yamani khrlazmi norjihan norlisah stefanie azlina_aa misslaiha zulkifliy View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status Performance Enhancement Of Low-dose Ct Image Denoising And Lesion Classification Using Deep Learning on going A Secure And Flexible Authenticated Encryption Schemes end Building Online Presence Of Mobile Application Using Unified Intention Model And Proactive Recommendation Approach end This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Book Chapter in book 2025 Accurate and efficient insulator maintenance: A DETR algorithm for drone imagery 2025 Accurate and efficient insulator maintenance: A DETR algorithm for drone imagery 2025 Factors driving the use of mobile health app: insights from a survey 2025 Factors driving the use of mobile health app: insights from a survey 2006 2014 Reduction of Motion Disturbances in Coronary Cineangiograms through Template Matching",
  "content_length": 3495,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:45"
}