{
  "name": "Nora Boulahia-Cuppens",
  "homepage": "https://www.polymtl.ca/expertises/en/boulahia-cuppens-nora",
  "status": "success",
  "content": "Boulahia Cuppens, Nora | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Boulahia Cuppens, Nora Poly Directory Courses Français Directory of Experts Boulahia Cuppens, Nora Directory of Experts Back to search results Edit my profileHelp Publications Nora Boulahia Cuppens Publications Full Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 2063 Fax: (514) 340-5139 Room: M-3107 nora.boulahia-cuppens@polymtl.ca Areas of expertise Cybersecurity Primary sphere of excellence in research New Frontiers in Information and Communication Technologies Secondary sphere(s) of excellence in research Modeling and Artificial Intelligence Sustainable Transport and Infrastructures Student research project(s) I am recruiting Research interests and affiliations Affiliation(s) LAMA-WeST (Web, Semantics and Text), Collaborating member Publications Recent publications Conference paper Baghalizadeh Moghadam, N., Cuppens, F., & Boulahia Cuppens, N. (2025, June). An NLP-Based Framework Leveraging Email and Multimodal User Data [Paper]. 22nd International Conference on Security and Cryptography (SECRYPT 2025), Bilbao, Spain. Journal article Saint-Hilaire, K., Neal, C., Cuppens, F., Boulahia Cuppens, N., Bassi, F., & Hadji, M. (2025). A real-time automated attack-defense graph generation approach. Journal of Information Security and Applications, 94, 104266 (28 pages). Conference paper Computer Security – ESORICS 2025 [Paper] (2025, September). 30th European Symposium on Research in Computer Security (ESORICS 2025), Toulouse, France. Published in Lecture Notes in Computer Science, 16054. Book chapter Cuppens, F., & Boulahia Cuppens, N. (2025). Cover Story. In Jajodia, S., Samarati, P., & Yung, M. (eds.), Encyclopedia of Cryptography, Security and Privacy (pp. 450-452). See all publications (287) Biography Nora Cuppens est professeure titulaire à Polytechnique Montréal. De 2014 à 2020, elle a été directrice de recherche à IMT Atlantique, Campus de Rennes, et responsable de la formation en cybersécurité. Elle a co-animé l’équipe IRIS (sécurité et résilience des systèmes d’information) de IMT Atlantique et a été responsable du programme transverse Cyrus sur la cybersécurité du Lab-STICC (CNRS, UMR 6285). Elle a obtenu un doctorat de l’École nationale supérieure de l’aéronautique et de l’espace et une Habilitation à diriger les recherches de l’Université de Rennes 1. Ses thèmes de recherche portent sur la formalisation des propriétés et des politiques de sécurité, l’analyse des protocoles cryptographiques, la validation formelle des propriétés de sécurité et l’évaluation des risques cyber et des réponses aux attaques. Ses sujets de recherche actuels incluent le contrôle d’accès et d’usage a posteriori et la traçabilité, la détection des logiciels malveillants et la réponse aux intrusions au moyen d’algorithmes issus de l’intelligence artificielle, la protection des données de sécurité ainsi que la cyberrésilience aux cyberattaques. Professeure Cuppens a publié plus de 250 articles techniques dans des revues à comité de lecture et des actes de conférences. Elle est la représentante française du TC11 « Sécurité de l’information » de l’IFIP. Elle a été impliquée dans les projets FP7 DEMONS et INTERTRUST et H2020 SuperCloud. Elle a été l’un des membres clés de la chaire sur la cyberdéfense des systèmes navals et le référent IMT Atlantique de la chaire « Cyber CNI » sur la cybersécurité des infrastructures critiques. Elle a reçu le Oustanding Service Award de l’IFIP TC 11 en 2016 et le Outstanding Service Award du IFIP WG 11.3 en 2017. Nora Cuppens est la co-fondatrice côté français du projet ASSET sur la sécurité de l’internet industriel des objets de l’Académie franco-allemande. Supervision at Polytechnique COMPLETED Ph.D. Thesis (2) Saint-Hilaire, K. (2025). Automatic Generation of Attack and Remediation Graphs [Ph.D. thesis, Polytechnique Montréal]. Merzouk, M. A. (2024). A Landscape of Adversarial Threats to Machine Learning-Based Intrusion Detection [Ph.D. thesis, Polytechnique Montréal]. Master's Thesis (14) Rulh, B. (2025). Mise en place et expérimentation d'une infrastructure de test de la cybersécurité des technologies opérationnelles navales [Master's thesis, Polytechnique Montréal]. Gourceyraud, M. (2024). Système de détection d'intrusion non supervisé fédéré [Master's thesis, Polytechnique Montréal]. Morantin, B. R. M. (2024). Sécurité véhiculaire: Une approche par système de détection d'intrusion hybride [Master's thesis, Polytechnique Montréal]. Abou Ahmed, K. (2023). Ontologie de playbook pour la réponse à incident [Master's thesis, Polytechnique Montréal]. Adala, M. (2023). Outil d'aide à la décision pour la gestion de la conformité des TI [Master's thesis, Polytechnique Montréal]. Chelle, V. (2023). Méthode d'analyse de la sécurité d'un téléphone intelligent et d'une application android tactique [Master's thesis, Polytechnique Montréal]. Crochelet, P. (2023). Attribution de cyber-attaquants à partir de logs Honeypots [Master's thesis, Polytechnique Montréal]. Delas, J. (2023). Étude de la vulnérabilité des systèmes de détection d'intrusion par apprentissage par renforcement face aux comportements adverses [Master's thesis, Polytechnique Montréal]. Ksontini, R. (2023). XM-Guards: A Blockchain-Based Collaborative Intrusion Detection Argumentation Framework For Decision-Making [Master's thesis, Polytechnique Montréal]. Aurora, V. (2022). Classification non supervisée de cyberattaques par inspection de paquets [Master's thesis, Polytechnique Montréal]. Charpentier, A. (2022). Optimisation de la sélection de techniques déceptives pour la sécurité et la cyber-résilience [Master's thesis, Polytechnique Montréal]. Rousselot, A. (2022). Banc de test et protocole d'authentification pour le système d'identification automatique maritime [Master's thesis, Polytechnique Montréal]. Badaoui, A. (2021). Proposition d'approche pour la détection de menace interne [Master's thesis, Polytechnique Montréal]. Langlois, J.-G. (2021). Infrastructure de test pour la cybersécurité des systèmes maritimes [Master's thesis, Polytechnique Montréal]. News about Nora Boulahia Cuppens NEWS | December 9, 2021 Cybersecurity: Creation of a Research Chair in Supply Chain Resilience | Read NEWS | June 22, 2021 Humanities: Polytechnique Montréal researchers involved in research projects and partnerships | Read NEWS | February 10, 2021 Cybersecurity: Polytechnique Montréal’s community and the general public are invited to the first edition of the 24h@CTF event | Read NEWS | January 28, 2021 A maritime cybersecurity research center is set to take form | Read NEWS | May 28, 2020 COVID-19: Polytechnique Montréal Cybersecurity experts sound the alarm on tracing applications | Read View more Press review about Nora Boulahia Cuppens October 8, 2025, Les Affaires, Ériger une forteresse autour de l'information Nora Boulahia Cuppens, professeure titulaire au Département de génie informatique et génie logiciel et directrice adjointe de la recherche pour l’Institut multidisciplinaire en cybersécurité et cyberrésilience (IMC2), souligne qu'on parle davantage de cybersécurité depuis que le périmètre de l'information numérisée s'est étendu à Internet. Elle souligne aussi l'importance de conscientiser le personnel d'une organisation aux risques en matière de sécurité de l'information. October 8, 2025, Les Affaires, Loi 25: les entreprises tardent à se conformer Frédéric Cuppens, professeur titulaire titulaire au Département de génie informatique et génie logiciel et directeur de l'Institut multidisciplinaire en cybersécurité et cyberrésilience (IMC2) et Nora Bouhahia Cuppens, professeure titulaire et directrice adjointe pour la recherche de l'IMC2, font état des ressources qui sont à la disposition des entreprises pour se conformer à la Loi 25 sur la protection des renseignements personnels. November 4, 2023, Acadie Nouvelle, Attention aux ordinateurs zombies! Nora Boulahia-Cuppens, professeure au Département de génie informatique et génie logiciel, parle du fonctionnement des ordinateurs zombies. October 31, 2023, Les As de l'info, Attention aux ordinateurs zombies! Nora Boulahia-Cuppens, professeure au Département de génie informatique et génie logiciel, explique ce que sont les ordinateurs zombies. October 19, 2023, ICI Première Québec, Bulletin régional / CBV | Bulletin du 19 octobre - 11 h L'IMC2, l'Institut multidisciplinaire en cybersécurité et cyberrésilience, inaugure sa création le 18 octobre 2023 pour faire face aux cybermenaces qui touchent bon nombre d'organisations. Other mentions: Ameq en ligne October 18, 2023, Le Devoir, Un projet pour mieux outiller les entreprises face aux cybermenaces L'IMC2, l'Institut multidisciplinaire en cybersécurité et cyberrésilience, inaugure sa création le 18 octobre 2023 pour faire face aux cybermenaces qui touchent bon nombre d'organisations. Other mentions: Courrier Frontenac, Les Affaires, Acadie Nouvelle, ICI Première (8min.), HEC Montréal, Noovo Info, iHeart Radio, L'Hebdo Journal May 18, 2023, La Tribune, Polytechnique, HEC et l’Université de Montréal créent un Institut de cybersécurité L’Université de Montréal et ses deux écoles affiliées, Polytechnique Montréal et HEC Montréal, annoncent la création de l’Institut multidisciplinaire en cybersécurité et cyberrésilience (IMC2).",
  "content_length": 16881,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:48"
}