{
  "name": "Norbert Gronau",
  "homepage": "https://lswi.de/lehrstuhl/personen/lehrstuhlinhaber/univ-prof-dr-ing-habil-norbert-gronau",
  "status": "success",
  "content": "Gronau | LSWI Lehrstuhl > Team > Professuren > Univ.-Prof. Dr.-Ing. habil. Norbert Gronau Raum Karl-Marx-Straße 67, Raum 2.03 Sprechzeit Montag 13-14h (nur nach Vereinbarung/Sekretariat) Telefon +49 (0)331/977-3322 e-Mail norbert.gronau@wi.uni-potsdam.de Web www.prof-gronau.de Univ.-Prof. Dr.-Ing. habil. Norbert Gronau Univ. Prof. Dr.-Ing. habil. Norbert Gronau ist Inhaber des Lehrstuhls für Wirtschaftsinformatik, Prozesse und Systeme. Seine Forschungsinteressen beinhalten insbesondere Industrie 4.0, digitale Technologien, Wissensmanagement und Geschäftsprozesse sowie Wandlungsfähigkeit sozio-technischer Systeme. Als Institutsleiter, Unternehmer und Keynote Speaker verbindet er Wissenschaft und Praxis. Werdegang Univ.-Prof. Dr.-Ing habil. Norbert Gronau studierte Maschinenbau und Betriebswirtschaftslehre an der Technischen Universität Berlin (TU). 1994 promovierte er im Fachbereich Informatik (TU) zum Thema „Konzeption eines strategieorientierten Führungsinformationssystems zur Entscheidungsunterstützung des Produktionsmanagements“. Bis einschließlich März 2000 leitete er an der TU Berlin die Lehr- und Forschungsgruppe Produktionsorientierte Wirtschaftsinformatik, im Oktober habilitierte er zum Thema „Nachhaltige Architekturen industrieller Informationssysteme bei organisatorischem Wandel“. Durch seine Berufung nach Oldenburg leitete Prof. Gronau von 2000 bis 2004 die Abteilung der Wirtschaftsinformatik an der Universität Oldenburg. Im Jahr 2004 folgte er dem Ruf auf eine C4-Professur an der Universität Potsdam und ist seither Lehrstuhlinhaber für Wirtschaftsinformatik , Prozesse und Systeme, einschließlich Electronic Government. Prof. Gronau ist Research Fellow und Gastdozent an der Stellenbosch University in Südafrika für Knowledge Management. Er initiierte 2008 die Potsdam Consulting Group (PCG), die seit 2016 unter Potsdam Consulting Advisory GmbH firmiert. Prof. Gronau war darüber hinaus an mehreren Internet-Startup zu dem Thema Wissensmanagement und Sales Acceleration beteiligt. Gründungstätigkeiten Herausgebertätigkeiten Mitgliedschaften Schwerpunkte Publikationen Vorträge Infos Gründungstätigkeiten Herausgebertätigkeiten Mitgliedschaften Schwerpunkte Publikationen Vorträge Forschungs- und Anwendungszentrum Industrie 4.0 Wissenschaftlicher Direktor Center for Enterprise Research (CER) Wissenschaftlicher Leiter ERP System des Jahres Vorsitzender Jury Fabriksoftware des Jahres Vorsitzender Jury Potsdam Consulting Advisory GmbH Gründer ERP Management - ERP, HR, BI, CRM-Wissen für Entscheider Herausgeber Factory Innovation - Agil und smart mit Industrie 4.0 Herausgeber Industry 4.0 Science - Cutting-Edge Forschung zu Industrie 4.0 und Smart Factory Herausgeber Deutsche Akademie der Technikwissenschaften (Acatech) Ordentliches Mitglied Weizenbaum- Institut für die Vernetzte Gesellschaft Prinzipal Investigator der Forschungsgruppe Bildung und Weiterbildung in der digitalen Gesellschaft Wissenschaftliche Gesellschaft für Arbeits- und Betriebsorganisation e.V. Mitglied des Vorstands Verband der Software-, Informations- und Kommunikations-Industrie Berlin-Brandenburg SIBB e.V. Beiratsmitglied Verband der Hochschullehrer für Betriebswirtschaft e.V. Mitglied der Kommissionen Wirtschaftsinformatik und Produktionswirtschaft Institut für Wirtschaftsinformatik und Digitale Gesellschaft e.V. Sprecher des Vorstands ERP-Systeme Industrie 4.0 Internet of Things Anwendungssysteme Prozessmodellierung Wandlungs- und Wettbewerbsfähigkeit Kreativität und Innovation Bildung und Weiterbildung 09/2025 Working Paper Fattah-Weil, Jasmin | Abendroth, Adrian | Stoffels, Jasmijn | Kaan, Paula | Horn, Hannes-Florin | Ahmad, Karim | Gronau, Norbert Der ERP-Trendradar – Zukünftige Technologien und strategische Handlungsempfehlungen für ERP-Systeme Wie sieht die Zukunft von ERP-Systemen aus? Welche Technologien werden in den nächsten Jahren relevant und wie sollen Unternehmen damit umgehen? Das Whitepaper „ERP-Trendradar“ gibt fundierte Antworten auf diese Fragen. Die Analyse basiert auf einer zweistufigen… (mehr) 09/2025 Proceedings Fattah-Weil, Jasmin | Roder, Jako | Schäfer, Lydia | Fay, Doris | Gronau, Norbert CreaDev - A Structured Framework for Embedding Creativity in Business Process Management Modern organizations face the dual challenge of maintaining efficiency while fostering innovation. Yet, traditional Business Process Management (BPM) frameworks often lack the flexibility to support creative problem-solving. This paper introduces CreaDev,… (mehr) 04/2025 Working Paper Gonnermann-Müller, Jana | Leins, Nicolas | Lettkemann, Virginie | Pasler, Theresia | Gronau, Norbert | Teichmann, Malte Whitepaper zu Nutzung und Potentialen von Augmented Reality und Virtual Reality für KMU 1. Chancen sichtbar machen: Die Rahmenbedingungen sollten so gestaltet werden, dass klein und mittleren Unternehmen (KMU) Potenziale neuer Technologien leichter erkennen können. 2. Zugang zu Ressourcen sichern: Es sollten Förderprogramme, Netzwerke… (mehr) 10/2024 Proceedings Gonnermann-Müller, Jana | Leins, Nicolas | Gronau, Norbert | Kosch, Thomas Value by Design: Reducing Cognitive Load by Using Visual Guidance in Augmented Reality - An Eye-Tracking Study Besides the positive effects of Augmented Reality (AR) on work and learning performance, research on its impact on cognitive load has generated ambiguous results. Therefore, this study investigates the effects of visual guidance in AR on cognitive load… (mehr) 05/2024 Bücher Ullrich, André | Gonnermann-Müller, Jana | Vladova, Gergana | Gronau, Norbert Partizipation und Akzeptanz bei organisationalen Veränderungsprozessen: Vorgehensmodell und Praxisbeispiel zur Einführung neuer Anwendungssysteme (mehr) 04/2024 Proceedings Abendroth, Adrian | Bender, Benedict | Gronau, Norbert The Evolution of Original ERP Customization: A Systematic Literature Review of Technical Possibilities Enterprise Resource Planning (ERP) system customization is often necessary because companies have unique processes that provide their competitive advantage. Despite new technological advances such as cloud computing or model-driven development, technical… (mehr) 02/2024 Journalbeiträge Bender, Benedict | Korjahn, Nicolas | Gronau, Norbert Erfolgreich auf Handelsplattformen: Einblicke in die Marktstudie Handelsplattformen 2023/2024 Plattformanbieter sind heute in zahlreichen Branchen präsent, darunter E-Commerce, Touristik und der Servicebereich. Diese Plattformen fungieren als zentrale Schnittstellen, die Angebot und Nachfrage effizient zusammenführen. Besonders im Handelsbereich… (mehr) 02/2024 Working Paper Bender, Benedict | Korjahn, Nicolas | Abendroth, Adrian | Fattah-Weil, Jasmin | Rojahn, Marcel | Ulrich, Marc | Schummel, Philip | Gronau, Norbert Marktstudie Handelsplattformen 2023/2024 Handelsplattformen prägen als zentrale Schnittstellen in verschiedenen Branchen das Konsumverhalten. Der Handelsverband Deutschland (HDE) schätzt, dass etwa 50% des E- Commerce-Umsatzes in Deutschland über diese Plattformen generiert wird. Amazon dominiert… (mehr) 01/2024 Proceedings Rojahn, Marcel | Gronau, Norbert Digital Platform Concepts for manufacturing Companies - A Review Digital Platforms (DPs) has established themself in recent years as a central concept of the Information Technology Science. Due to the great diversity of digital platform concepts, clear definitions are still required. Furthermore, DPs are subject to… (mehr) 01/2024 Proceedings Rojahn, Marcel | Gronau, Norbert Openness Indicators for the Evaluation of Digital Platforms between the Launch and Maturity Phase In recent years, the evaluation of digital platforms has become an important focus in the field of information systems science. The identification of influential indicators that drive changes in digital platforms, specifically those related to openness,… (mehr) 10/2023 Buchbeiträge Teichmann, Malte | Busse, Jana | Gonnermann, Jana | Ritterbusch, Georg | Langemeyer, Ines | Gronau, Norbert Konzeption, Erstellung und Evaluation von VR-Räumen für die betriebliche Weiterbildung in KMU – Erfahrungen und Handlungsempfehlungen aus dem Forschungsprojekt API-KMU Der Beitrag adressiert die Erstellung von Virtual-Reality gestützten (Lehr- und Lern-) Räumen für die betriebliche Weiterbildung im Rahmen eines Forschungsprojektes. Der damit verbundene Konzeptions- und Umsetzungsprozess ist mit verschiedenen Herausforderungen… (mehr) 09/2023 Bücher Gronau, Norbert Handbuch der ERP-Auswahl, komplett überarbeitete 3. Auflage 2023 ERP-System auswählen und Prozesse optimieren! Der ERP-Markt ist komplex, die Vielfalt der angebotenen Systeme enorm. Nur ein richtig ausgewähltes ERP-System sichert die problemlose Einführung und einen produktiven Betrieb. In der aktuellen Auflage… (mehr) 09/2023 Journalbeiträge Rojahn, Marcel | Ambros, Maximilian | Biru, Tibebu | Krallmann, Hermann | Gronau, Norbert | Grum, Marcus; Adequate Basis for the Data-Driven and Machine-Learning-Based Identification Process mining (PM) has established itself in recent years as a main method for visualizing and analyzing processes. However, the identification of knowledge has not been addressed adequately because PM aims solely at data-driven discovering, monitoring,… (mehr) 07/2023 Journalbeiträge Panzer, Marcel | Bender, Benedict | Gronau, Norbert A deep reinforcement learning based hyper-heuristic for modular production control In nowadays production, fluctuations in demand, shortening product life-cycles, and highly configurable products require an adaptive and robust control approach to maintain competitiveness. This approach must not only optimise desired production objectives… (mehr) 06/2023 Journalbeiträge Rojahn, Marcel | Weber, Edzard | Gronau, Norbert; Towards a Standardization in Scheduling Models: Assessing the Variety of Homonyms Terminology is a critical instrument for each researcher. Different terminologies for the same research object may arise in different research communities. By this inconsiste",
  "content_length": 50850,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:49"
}