{
  "name": "Norisma Idris",
  "homepage": "https://umexpert.um.edu.my/norisma",
  "status": "success",
  "content": "UMEXPERT - ASSOCIATE PROF. DR. NORISMA BINTI IDRIS ASSOCIATE PROF. DR. NORISMA BINTI IDRIS Department of Artificial Intelligence Faculty of Computer Science and Information Technology norismaum.edu.my View CV View 1-Page CV Publons Scopus Link Collaborator rosmadifauzi rozanaothman hanizaaminudin amir sdevi sameem taufik zamree abrizah ishakhs mariney abdullah ainuddin b1salina fazmidar maizatul lilyazura View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Latest Publications View All Article in Academic Journals Chapter in book Proceeding 2025 Enhancing radiology report generation: A prior knowledge-aware transformer network for effective alignment and fusion of multi-modal radiological data 2025 Legal Judgment Prediction using Natural Language Processing and Machine Learning Methods: A Systematic Literature Review 2025 Medical radiology report generation: A systematic review of current deep learning methods, trends, and future directions 2025 Engaging Preference Optimization Alignment in Large Language Model for Continual Radiology Report Generation: A Hybrid Approach 2018 Design of an Algebraic Concept Operator for Adaptive Feedback in Physics 2017 A Cognitive Knowledge-based Framework for Adaptive Feedback 2016 Feel-It: An Intelligent Secondary School Physics Q&A System 2011 An Analysis of Students¿ Summaries using Summary Sentence Decomposition 2022 Neural Machine Translation for Malay Text Normalization using Synthetic Dataset 2021 Aspect Extraction in Sentiment Analysis Based on Emotional Affect Using Supervised Approach 2018 International Conference on Industrial Enterprise and System Engineering (ICOIESE) 2017 2015 Toward Tweets Normalization Using Maximum Entropy",
  "content_length": 1880,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:51"
}