{
  "name": "Norman W. Paton",
  "homepage": "http://www.cs.man.ac.uk/~norm",
  "status": "success",
  "content": "Norman Paton - Research Explorer The University of Manchester Norman Paton Prof Professor, Information Management https://orcid.org/0000-0003-2008-6617 Emailnorman.patonmanchester.acuk Personal profile BiographyNorman Paton has been a Professor of Computer Science at Manchester University since 2000; he has also worked as a lecturer at Heriot-Watt University and a Research Assistant at Aberdeen University. In Computer Science at Manchester he has held a variety of roles, including Head of School, Director of Teaching Strategy, Director of the Research School and Director of Postgraduate Taught Programmes in Computer Science. In relation to community service, he is a member of the Editorial Boards of Philosophical Transactions of the Royal Society A.  He has held PC and Track Chair roles at several international conferences, including CIKM, EDBT, ICDE and VLDB, and has been President of the Extending Database Technology Association (EDBT). If you are local to Manchester and wondering what to do at the weekend, I have a Day Trips From Manchester blog that may give you some ideas.OpportunitiesPostgraduate Opportunities To date, Norman Paton has supervised 30 PhD students and 2 MPhil students to completion. QualificationsBSc Honours (1) Computing Science, University of Aberdeen, 1986 PhD Computing Science, University of Aberdeen, 1989Research interestsMy research focuses on distributed information management for challenging environments and applications. The development of effective techniques for improving computer support for data intensive applications is one of the major areas of activity in computer science research. Current areas of interest in computer science include: Autonomic systems: enabling distributed systems to adapt their behaviour automatically to reflect changes in their execution environment.Data integration: reducing the cost of developing and maintaining applications that combine data from multiple databases or analysis environments. Recent projects include an EPSRC Programme Grant on Adding Value to Data (VADA) and a Knowledge Transfer Partnership with Peak.ai.Memberships of committees and professional bodiesMember of Academia Europaea. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital Futures Fingerprint Dive into the research topics where Norman Paton is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Data Integration Computer Science 100% Query Processing Computer Science 90% Sensor Networks Computer Science 54% Data Model Computer Science 50% Object (Databases) Computer Science 41% Data Management Computer Science 40% Object-Oriented Database Computer Science 40% Schema Mapping Computer Science 39% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 146 Conference contribution 100 Article 9 Chapter 2 Letter 2 More 1 Book 1 Review article Research output per year Research output per year Gem: Gaussian Mixture Model Embeddings for Numerical Feature DistributionsRauf, H. T., Bogatu, A., Paton, N. W. & Freitas, A., 5 Feb 2025, (Accepted/In press) 28th International Conference on Extending Database Technology.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Gaussian Mixture Model 100% Data Management 100% Numerical Data 66% Entity Resolution 33% Distinctive Feature 33% 8 Downloads (Pure) REVIEW OF STATE-OF-THE-ART MACHINE LEARNING RESEARCH FOR STRUCTURAL INTEGRITY ASSESSMENT OF WELDED JOINTSEka, S., Paton, N. W., Sherry, A. H. & Pickering, E. J., 31 Mar 2025, (Accepted/In press) Proceedings of ASME 2025 Pressure Vessels and Pipeline Conference.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Welds 100% Structural Integrity 100% Learning System 100% Machine Learning 100% Welded Joint 100% TableDC: Deep Clustering for Tabular DataRauf, H. T., Freitas, A. & Paton, N., 18 Jun 2025, Proceedings of the ACM on Management of Data. 3 ed. Association for Computing Machinery, Vol. 3. p. 1-28 28 p. 229Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Cauchy Distribution 100% Deep Representation Learning 100% Quadratic Time 100% 82 Downloads (Pure) Taxonomy Inference for Tabular Data Using Large Language ModelsWu, Z., Chen, J. & Paton, N., 2025, (Accepted/In press) The Extended Semantic Web Conference (ESWC 2025).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review File Large Language Model 100% Ontology 20% Management Data 20% Inference System 20% Bidirectional Encoder Representations From Transformers 20% 9 Downloads (Pure) Dataset Discovery and Exploration: State-of-the-art, Challenges and OpportunitiesPaton, N. W. & Wu, Z., 5 Feb 2024, (Accepted/In press) Proceedings 27th International Conference on Extending Database Technology ( EDBT 2024 ).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Annotation 100% 15 Downloads (Pure) View all 259 research outputs Projects 2 Finished Projects per year Internet of Things cities Demonstrator: CityVerveTaylor, C. (PI), Brass, A. (CoI), Cotton, I. (CoI), Georghiou, L. (CoI), Jay, C. (CoI), Keane, J. (CoI), Parisio, A. (CoI), Paton, N. (CoI), Peek, N. (CoI), Topping, D. (CoI) & Van Staa, T. (CoI)1/07/16 → 30/06/18Project: Research Internet 100% Internet-Of-Things 100% Urban Areas 100% Research 50% Agreement 50% Value Added Data Systems: Principles and Architecture.Paton, N. (PI), Fernandes, A. (CoI) & Keane, J. (CoI)1/04/15 → 30/09/20Project: Research Data Preparation 100% Schema Mapping 75% Postprocessing 75% Training Data 75% Preprocessing 75% Press/Media BUSINESS MANCHESTER: Innovators land £30k following UMIP’s ‘Next Big Thing’ finalePaton, N., Konstantinou, N., Nancekievill, M., Mcnaught, J. & Ananiadou, S.28/03/181 Media contributionPress/Media: Research",
  "content_length": 6572,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:58"
}