{
  "name": "Norma Saiph Savage",
  "homepage": "https://www.khoury.northeastern.edu/people/saiph-savage",
  "status": "success",
  "content": "Saiph Savage - Khoury College of Computer Sciences All People Saiph Savage (she/her/hers) Assistant Professor Research interests Research interests Artificial intelligence Human–computer interaction Data science Network science Machine learning Education Education PhD in Computer Science; University of California, Santa Barbara MA in Computer Science; University of California, Santa Barbara BA in Computer Engineering, Universidad Nacional Autónoma de México — Mexico Biography Biography Saiph Savage is an assistant professor and director of the Civic AI Lab in the Khoury College of Computer Sciences at Northeastern University, based in Boston. Savage's research focuses on creating intelligent civic technology to organize collective action for change, which includes battling misinformation and empowering gig and rural workers to access better jobs. Much of this work focuses on expanding real-world applications of AI and human-centered design. To that end, Savage has collaborated with federal and local governments, and has penned high-level policy briefs within the Federation of American Scientists’ accelerator program. At Khoury College, Savage teaches human-centered AI, global UX, human–computer interaction, and social computing. Her students have obtained fellowships and internships in industry and academia, including at Facebook, Twitch, Microsoft, X, and the Oxford Internet Institute. Before joining Northeastern in 2021, Savage was a tech worker at Intel Labs and Microsoft Bing, and a crowd research worker at Stanford. She has taught or directed at West Virginia University, Carnegie Mellon University, and the University of Washington, focusing on human–computer interaction or human-centered design each time. Savage has published in ACM CHI and CSCW, AAAI ICWSM and HCOMP, and the Web Conference; the BBC, The Economist, and the New York Times have covered her work. She is a recipient of grants from the UN and NSF, the Google Anita Borg Scholarship, and MIT Technology Review’s “35 Innovators Under 35” honor. She is also a fellow at the Center for Democracy and Technology, a technical advisor for Mexico’s Ministry of Foreign Affairs, and a member of ACM SIGCHI’s Latin America Committee. Labs and groups Labs and groups Civic A.I. Lab Projects Projects Published: November 9, 2021 A.I. to Empower Displaced Rural Workers Lead PI: Saiph Savage Published: November 9, 2021 Human Centered A.I. for Federal Governments Lead PI: Saiph Savage Published: November 9, 2021 Reputation Agent: Tools to Help Digital Workers Earn More and Create Fairer Workspaces Lead PI: Saiph Savage Recent publications Recent publications Published: April 25, 2025 New Frontiers of Human-centered Explainable AI (HCXAI): Participatory Civic AI, Benchmarking LLMs, XAI Hallucinations, and Responsible AI Audits Citation: Upol Ehsan, Elizabeth Anne Watkins, Philipp Wintersberger, Carina Manger, Nina Hubig, Saiph Savage, Justin D. Weisz, Andreas Riener. (2025). New Frontiers of Human-centered Explainable AI (HCXAI): Participatory Civic AI, Benchmarking LLMs, XAI Hallucinations, and Responsible AI Audits CHI Extended Abstracts, 793:1-793:6. https://doi.org/10.1145/3706599.3706713 Published: March 10, 2025 The Impact of Generative AI Coding Assistants on Developers Who Are Visually Impaired Citation: Claudia Flores-Saviaga, Benjamin V. Hanrahan, Kashif Imteyaz, Steven Clarke, Saiph Savage. (2025). The Impact of Generative AI Coding Assistants on Developers Who Are Visually Impaired CoRR, abs/2503.16491. https://doi.org/10.48550/arXiv.2503.16491 Published: January 13, 2025 Data Enrichment Work and AI Labor in Latin America and the Caribbean Citation: Gianna Williams, Maya De Los Santos, Alexandra To, Saiph Savage. (2025). Data Enrichment Work and AI Labor in Latin America and the Caribbean CoRR, abs/2501.06981. https://doi.org/10.48550/arXiv.2501.06981 Published: November 8, 2024 A Culturally-Aware AI Tool for Crowdworkers: Leveraging Chronemics to Support Diverse Work Styles Citation: Carlos Toxtli, Christopher Curtis, Saiph Savage. (2024). A Culturally-Aware AI Tool for Crowdworkers: Leveraging Chronemics to Support Diverse Work Styles Proc. ACM Hum. Comput. Interact., 8, 1-34. https://doi.org/10.1145/3686899 Published: May 11, 2024 Designing Gig Worker Sousveillance Tools Citation: Kimberly Do, Maya De Los Santos, Michael Muller, Saiph Savage. (2024). Designing Gig Worker Sousveillance Tools CHI, 384:1-384:19. https://doi.org/10.1145/3613904.3642614 Published: March 4, 2024 Unveiling AI-Driven Collective Action for a Worker-Centric Future Citation: Saiph Savage. (2024). Unveiling AI-Driven Collective Action for a Worker-Centric Future WSDM, 6-7. https://doi.org/10.1145/3616855.3637633 Published: February 20, 2024 Remote Possibilities: Where there is a WIL, is there a Way? AI Education for Remote Learners in a New Era of Work-Integrated-Learning Citation: Derek Jacoby, Saiph Savage, Yvonne Coady. (2024). Remote Possibilities: Where there is a WIL, is there a Way? AI Education for Remote Learners in a New Era of Work-Integrated-Learning CoRR, abs/2402.12667. https://doi.org/10.48550/arXiv.2402.12667 Published: April 12, 2023 Why Do We Need to Learn about Citational Practices? Recognizing Knowledge Production from the Global Souths and Beyond Citation: Amy Ogan, Frederick M. C. van Amstel, Gabriela Molina León, Juan Fernando Maestre, Kristin Williams, Nicola J. Bidwell, Pedro Reynolds-Cuéllar, Saiph Savage, Sushil K. Oswal, Vishal Sharma. (2023). Why Do We Need to Learn about Citational Practices? Recognizing Knowledge Production from the Global Souths and Beyond XRDS, 29, 12-17. https://doi.org/10.1145/3589256 Published: February 27, 2023 4th Crowd Science Workshop – CANDLE: Collaboration of Humans and Learning Algorithms for Data Labeling Citation: Dmitry Ustalov, Saiph Savage, Niels van Berkel, Yang Liu. (2023). 4th Crowd Science Workshop - CANDLE: Collaboration of Humans and Learning Algorithms for Data Labeling WSDM, 1268. https://doi.org/10.1145/3539597.3572703 Published: November 11, 2022 Datavoidant: An AI System for Addressing Political Data Voids on Social Media Citation: Claudia Flores-Saviaga, Shangbin Feng, Saiph Savage. (2022). Datavoidant: An AI System for Addressing Political Data Voids on Social Media Proc. ACM Hum. Comput. Interact., 6, 1-29. https://doi.org/10.1145/3555616 Published: October 22, 2022 The Global Care Ecosystems of 3D Printed Assistive Devices Citation: Saiph Savage, Claudia Flores-Saviaga, Rachel Rodney, Liliana Savage, Jon Schull, Jennifer Mankoff. (2022). The Global Care Ecosystems of 3D Printed Assistive Devices ACM Trans. Access. Comput., 15, 31:1-31:29. https://doi.org/10.1145/3537676 Published: April 28, 2022 REGROW: Reimagining Global Crowdsourcing for Better Human-AI Collaboration Citation: Andy Alorwu, Saiph Savage, Niels van Berkel, Dmitry Ustalov, Alexey Drutsa, Jonas Oppenlaender, Oliver Bates, Danula Hettiachchi, Ujwal Gadiraju, Jorge Gonçalves , Simo Hosio. (2022). REGROW: Reimagining Global Crowdsourcing for Better Human-AI Collaboration CHI Extended Abstracts, 88:1-88:7. https://doi.org/10.1145/3491101.3503725 Published: October 1, 2021 Quantifying the Invisible Labor in Crowd Work Citation: Carlos Toxtli, Siddharth Suri, and Saiph Savage. 2021. Quantifying the Invisible Labor in Crowd Work. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 319 (October 2021), 26 pages. DOI:https://doi.org/10.1145/3476060 Published: November 30, 2020 Meta-Gig: Empowering Anyone to Create Crowd Marketplaces Citation: TOXTLI, Carlos; SAVAGE, Saiph. Meta-Gig: Empowering anyone to create crowd marketplaces. Avances en Interacción Humano-Computadora, [S.l.], n. 1, p. 11-19, nov. 2020. ISSN 2594-2352. Available at: . Date accessed: 09 nov. 2021. doi: http://dx.doi.org/10.47756/aihc.y5i1.62. Individual Details Tenured/Tenure-Track Faculty Campus Boston Website http://www.saiph.org/ Google Scholar See Citations Areas of Interest Human-Centered Computing Artificial Intelligence Contact s.savage@northeastern.edu Related news Khoury College faculty on when — and when not — to use AI in the classroom October 29, 2025 25 in ’25: Record number of Khoury research apprentices showcase work in Boston May 16, 2025 CHI 2025: Khoury researchers publish record-high papers for second straight year April 22, 2025 Explore all news Current PhD students Christopher Curtis PhD Student Read bio Locations Close this dialog window Boston Kashif Imteyaz PhD Student Read bio Locations Close this dialog window Boston HwiJoon Lee PhD Student Read bio Locations Close this dialog window Boston Previous PhD students Claudia Flores-Saviaga PhD Student Locations Close this dialog window Boston Carlos Toxtli-Hernandez PhD Student Locations Close this dialog window Boston",
  "content_length": 8787,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:52"
}