{
  "name": "Norman I. Badler",
  "homepage": "https://www.cis.upenn.edu/~badler",
  "status": "success",
  "content": "Norm Badler's Homepage Norman I. Badler Rachleff Professor, Computer and Information Science Dept. Director, Center for Digital Visualization (ViDi) Past Director, Center for Human Modeling and Simulation Director and Faculty Advisor: DIGITAL MEDIA DESIGN Undergraduate SEAS BSE Degree Co-Director: Computer Graphics and Game Technology Masters (MSE) Degree University of Pennsylvania School of Engineering and Applied Science Last update to these pages: February 13, 2020 How to Reach me Professional Activities Professional Experience Research Interests Publications Teaching Education Other Interests A brief biography A tree of CIS/HMS PhD students and their PhD students, recursively, including some ancestry. My Google Profile A current generic talk abstract. A Tutorial on Computer Graphics for the Humanities (2.5 hours) A video of a talk I gave at DGP40 (2008) in Toronto (scroll to 7 minute mark) \"Lies, Pixels, and Video Fakes\" Interested in Summer Research opportunities? Very limited spaces; Apply online. CG@Penn: PhD Research, CGGT Masters, Digital Media Design Undergraduates and more! Dachshund Days: More than Just Pets Norman Badler and Virginia Badler Epigraph Books, 2018 Available from Amazon and Barnes & Noble in Hardcover, Paperback, and eBook An article on the SIG Center An article on our \"Visualizing the Past/Peopling the Past\" course with Anthropologist Clark Erickson My 2017 Commencement address at the College of Creative Studies (CCS), University of California at Santa Barbara The UCSB CCS 50th Anniversary Newsletter with a recap of that talk and an article on the inaugural CCS class in 1967 An article on Digital Media Design at Penn A 2013 article on Penn and Pixar Books: Simulating Crowds in Egress Scenarios.Vinicius J. Cassol, Soraia. R. Musse, Claudio R. Jung and Norman I. Badler. Springer 2018. Simulating Heterogeneous Crowds with Interactive Behaviors. Nuria Pelechano, Jan Allbeck, Mubbasir Kapadia and Norman Badler (editors). CRC Press 2016. Virtual Crowds: Steps Toward Behavioral Realism by Mubbasir Kapadia, Nuria Pelechano, Jan Allbeck and Norman Badler; Morgan Claypool Publishers 2015. Download free from the Penn domain, or order from Amazon. Virtual Crowds: Methods, Simulation, and Control by Nuria Pelechano, Jan Allbeck and Norman Badler; MorganClaypool Publishers 2008. Download free from the Penn domain, or order from Amazon. Simulating Humans from Oxford University Press may be freely downloaded. (This links to the download instructions for the pdf file.) Heard about MarchingOrder? See article in our 2015 Newsletter. Of Historical Interest: The 1984 Self Magazine article created with 3D \"Bubblewoman\" models My 1974 PhD thesis video drawn onto microfilm with 3D spherical projection 3D models, moving camera, hidden line elimination, and component animation The ViDi Center for Digital Visualization The ViDi Center will fundamentally address the connections between visual analysis and re-synthesis problems, primarily involving 3D objects and environments that pose significant and interesting questions in the Humanities (but also in Medicine and Engineering). The ViDi Center will bring together Engineering and Humanities faculty to embark on deeply collaborative investigations to discover new Computer Graphics modeling and animation methods and apply the best and most appropriate techniques to modeling and visualization challenges presented by human artistic, structural, and cultural artifacts. How to reach me Levine 304 Computer and Information Science Department University of Pennsylvania 3330 Walnut Street Philadelphia, PA 19104-6389 USA Email: badler AT seas DOT upenn DOT edu Phone: 215-898-5862 Fax: 215-898-0587 Research Interests Ph.D. Research at University of Toronto in computer understanding of three-dimensional moving object motions from movie images; this work was the first to build general 3-D motion models from perspective image sequences. Early research at University of Pennsylvania into effective methods for graphical representation of complex objects using solid and surface models. Speciality in human figure modeling and animation, especially with respect to the problems of motion specification and control. Recent research centers on virtual embodied human agents, including fast motion generators, Parameterized Action Representation (PAR), Parameterized Behavior Trees (PBT) and functional crowd simulation . The Center for Human Modeling and Simulation is the creator of the Jack software, used worldwide for human figure animation and human factors analysis. Jack is now commercially licensed by Siemens (which bought UGS, which bought Unigraphics, which bought Engineering Animation, Inc. which bought the first commercial home of Jack, Transom Technologies, Inc.).  More recent work on Digital Visualization in the humanities, through the ViDi Center.  A focus on reconstructing and peopling ancient societies, especially in South America, with Anthropology colleague Clark Erickson. Research Project links Virtual Beings - What Role will they Play? -- Panel discussion at SIGGRAPH 2002. (free registration on Computer Graphics World website) An article which discusses Penn's Center for Technology Transfer and the Jack spin-off... Teaching Advanced Rendering, CIS 461 / CIS 561 (Spring term) Visualizing the Past/Peopling the Past CIS 106/ANTH 258 (Fall term) DMD Senior Project, CIS 497 Seminar in Crowd Simulation, CIS 700 (Spring 2016) Other interests Quotes that shaped my academic life. Coincidences -- True vignettes Home repair, cooking and baking, dachshunds, stained glass, travel, and Philip Glass. If you want to visit Schatze [RIP 8-29-02 at almost 17 years], Greta [RIP 9-17-04 at 14 years], Bruiser [RIP 3-11-01 at 12 years], and Holly [RIP] (clockwise from bottom), click here. How about Playful Bruiser? Or maybe Bruiser as the Cane-Doge. \"Puppy\" Josef.  Our first rescue dachshund: Kohle (a \"standard\") [RIP 1-5-15].  Our second rescue: Magda (a white dachshund; a former breeder bitch from Texas) [RIP 2-11-13]. Josef discovers \"Squirrel TV\" while Greta thinks he's very silly. More about our pets and our life with them? See our book: Dachshund Days Back to Top of Page",
  "content_length": 6209,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:53"
}