{
  "name": "Nour Ali",
  "homepage": "https://www.brunel.ac.uk/people/nour-ali",
  "status": "success",
  "content": "Dr Nour Ali | Introduction | Brunel University London Skip to Content Home People Dr Nour Ali Dr Nour AliVice-Dean Education/Reader Wilfred Brown Building 114 Email: nour.ali@brunel.ac.uk Tel: +44 (0)1895 265375 Twitter Google Scholar Brunel Software Engineering Lab Computer Science College of Engineering, Design and Physical Sciences Summary Dr Nour Ali is a Reader in the Department of Computer Science at Brunel University London.  She currently co-heads the Brunel Software Engineering Lab (http://www.brunel-sweng.org/) and is the Vice-Dean of Education for the College of Engineering, Design and Physical Sciences. She received her PhD in Software Engineering from Universidad Politecnica de Valencia – Spain and has a Major in Computer Science from Bir-Zeit University- Palestine. Before moving to Brunel, she was a Principal Lecturer in Software Engineering at University of Brighton and held research fellowships at Lero, the Irish Software Engineering Research Centre and the Politecnico di Milano. She also has been a visiting researcher at Leicester University and Free University of Bolzen. She has been Principal Investigator and member of several research and knowledge transfer projects. Her research focuses on developing software architecture techniques, methods and tools and applying them to different challenging systems and situations such as distributed, mobile and adaptive. She has over 70 publications in journals, books and conferences. Here are links to her publications on dblp and google scholar . She also is a reviewer for top journals and national funding bodies such as EPSRC. She serves in several Programme and Organization Committees of conferences and workshops in her area and has co-edited 4 books. Dr Ali has experience of Higher Education teaching, from undergraduate to MSc level. She has a PG Certificate in Teaching and Learning in Higher Education from the University of Brighton. She is also Fellow of the Higher Education Academy (HEA). Newest selected publications Alshuqayran, N., Ali, N. and Evans, R. (2025) 'A Model-Driven Architecture Approach for Recovering Microservice Architectures: Defining and Evaluating MiSAR'. Information and Software Technology, 186 (October 2025). pp. 1 - 22. ISSN: 0950-5849 Open Access Link Journal article Ahmed, K., Ali, N. and Awad, W. (2025) 'Waste Definition and Identification in Software Engineering: A Review'.2024 International Conference on IT Innovation and Knowledge Discovery (ITIKD). IEEE. pp. 1 - 4. Conference paper Ali, N., Alshuqayran, N., Faqeeh, R., Rohman, T. and Solis, C. (2024) 'An Approach and Toolset to Semi-Automatically Recover and Visualise Micro-Service Architecture'.17th European Conference on Software Architecture (ECSA). Istanbul, Turkey. 30 - 22 September. Springer Nature Switzerland. pp. 326 - 341. ISSN: 0302-9743 Open Access Link Conference paper Hassan, S., Bahsoon, R., Minku, L. and Ali, N. (2022) 'Dynamic Evaluation of Microservice Granularity Adaptation'. ACM Transactions on Autonomous and Adaptive Systems, 16 (2). pp. 1 - 35. ISSN: 1556-4665 Open Access Link Journal article Espinoza, A., Del-Moral, E., Martínez-Martínez, A. and Ali, N. (2021) 'A validation & verification driven ontology: An iterative process'. Applied Ontology, 16 (3). pp. 297 - 337. ISSN: 1570-5838 Open Access Link Journal article More publications(12)",
  "content_length": 3361,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:55"
}