{
  "name": "Nuno Vasconcelos",
  "homepage": "http://www.svcl.ucsd.edu/~nuno",
  "status": "success",
  "content": "SVCL - Nuno Vasconcelos Home People Research Publications Demos News Jobs Prospective Students About Internal Nuno Vasconcelos Department of Electrical and Computer Engineering,University of California, San Diego9500 Gilman Drive, Mail code 0407EBU 1, Room 5603La Jolla, CA 92093-0407n u n o @ u c s d . e d u https://orcid.org/0000-0002-9024-4302 Phone: (858) 534-5550Fax:      (858) 534-1483 I am a Professor at the Electrical and Computer Engineering Department of UCSD, where I head the Statistical Visual Computing Laboratory. Before joining UCSD, I was a member of the research staff at the Compaq Cambridge Research Laboratory, which later became the HP Cambridge Research Laboratory. I received a PhD from MIT in 2000 and was a research assistant at the MIT Media Laboratory for the duration of my studies.  My areas of research interest are  computer vision, statistical signal processing, machine learning, and multimedia. [Brief Biography, Curriculum Vitae, Information for Prospective Students] Teaching: ECE 271A: Statistical Learning I (Fall 2005-Fall 2012)ECE 271B: Statistical Learning II (Spring 2007, Fall 2009)ECE 161C: Digital Signal Processing II (Spring 2004 - Spring 2012)ECE 175: Elements of Machine Intelligence (Spring 2005, Spring 2007)ECE 285: Special Topics in Robotics and Control Systems (Winter 2004, Winter 2005)ECE 285: Special Topics in Robotics and Control Systems (Fall 2003, Fall 2004) Awards: IEEE Fellow, 2017 Hellman Fellowship, 2005NSF CAREER award, 2005Graduate Fellowship, Junta Nacional para a Investigacao Cientifica e Tecnologica, 1993 -1997Graduate Fellowship, Luso-American Foundation, 1991 - 1993 Professional Service: Senior Area Editor, IEEE Signal Processing Letters, 2013- Guest Editor, Special Issue in \"Content-based Image and Video Retrieval\", EURASIP Signal Processing Journal, Vol. 85, N. 2, February 2005. Area Chair, International Conference in Machine Learning, Beijing, 2014 Area Chair, IEEE Conference on Computer Vision and Pattern Recognition, Columbus, 2014 Area Chair, Neural Information Processing Systems, Lake Tahoe, 2013 Area Chair, Iberian Conference on Pattern Recognition and Image Analysis, Madeira, 2013 Area Chair, IEEE Conference on Computer Vision and Pattern Recognition, Providence, 2012 Demo Chair, IEEE Conference on Computer Vision and Pattern Recognition, San Diego, 2005 Chair, special session on \"Content-based retrieval from image databases\", ICIP 2001, Greece. Conference Program Committees Journal and Conference reviewing Major grants: NRI-Small: A Biologically Plausible Architecture for Robotic Vision, NSF, 2012-2017 Large Vocabulary Semantic Image Processing: Theory and Algorithms, NSF, 2008-2013 RI-Small: Optimal Automated Design of Cascaded Object Detectors, NSF, 2008-2013 Understanding Video of Crowded Environments, NSF, 2005-2009 Career: Weakly Supervised Recognition, NSF, 2005-2011 Publications: For papers see the Publications section of the SVCL site.My PhD thesis is available on-line Talks: These are some example talks that I gave. If you serach the web you may find more. On the Optimal Design of Cascaded Classifiers for Object Detection, SIAM Annual Meeting 2013 Using Statistics to Search and Annotate Pictures, Google Tech Talks, 2006﻿ © SVCL",
  "content_length": 3258,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:03"
}