{
  "name": "Nuno J. Mamede",
  "homepage": "https://www.l2f.inesc-id.pt/wiki/index.php/Nuno_Mamede",
  "status": "success",
  "content": "Nuno Mamede - HLT@INESC-ID Nuno Mamede From HLT@INESC-ID Nuno J. MamedeProfessor Associado | SA-HLT E31E-332E-A259 0000-0001-6033-158X 7Kou6lkAAAAJ C-5555-2008 6602527446 +351213100300     232 nuno.mamede@inesc-id.pt www.l2f.inesc-id.pt/wiki/index.php/Nuno_Mamede Nuno Mamede graduated in Electrotechnical and Computers Engineering from the Instituto Superior Técnico (IST), Lisbon, in 1981, and received his MSc and Ph.D. degrees in Electrotechnical and Computers Engineering, from the same University in 1985 and 1992, respectively. In 1982 he started as a lecturer and since 2006 he holds the position of Associate Professor at Instituto Superior Técnico, where he has taught Digital Systems, Object Oriented Programming, Programming Languages, knowledge representation, and Natural Language Processing. He has been a researcher at INESC-ID Lisboa, in Lisbon, since its creation in 1980. He participated in the foundation of L2F where he held a position in the Executive Board. His activities have been in the areas of Written Natural Language Processing, namely on Syntactic Processing, Named Entity Recognition, and Natural Language Interfaces to Data Bases. He has authored a significant number of scientific papers. He is a member of AAAI, ACM and ACL.Research Interests: Written Natural Language Processing Named Entity Recognition Time Expression normalization Dialog systems Total Publications: 183Article (Author)Exploring Few-Shot Approaches to Automatic Text Complexity Assessment in European PortugueseEugénio Ribeiro, David Antunes, Nuno J. Mamede, Jorge Baptista, Journal of the Brazilian Computer Society, vol. 31, n. 1, pages 690–710, DOI 10.5753/jbcs.2025.5820, August 2025Avaliação Automática do Nível de Complexidade de Textos em Português EuropeuEugénio Ribeiro, Nuno J. Mamede, Jorge Baptista, Linguamática, vol. 16, n. 2, pages 121-145, DOI 10.21814/lm.16.2.449, November 2024Diferenciação dos advérbios compostos do português brasileiro e do português europeuIzabela Müller, Nuno J. Mamede, Jorge Baptista, Revista da Associação Portuguesa de Linguística, vol. 11, pages 136-163, DOI https://doi.org/10.26334/2183-9077/rapln11ano2024a7, October 2024Verbo-suporte escondido “com rabo de fora”: Construções complexas com verbo-suporte reduzidoJorge Baptista, Nuno J. Mamede, Revista da Associação Portuguesa de Linguística, vol. 10, pages 41–57, DOI https://doi.org/10.26334/2183-9077/rapln10ano2023a3, October 2023Advérbios compostos do Português do BrasilIzabela Müller, Nuno J. Mamede, Jorge Baptista, Revista da Associação Portuguesa de Linguística, vol. 10, pages 230–250, DOI https://doi.org/10.26334/2183-9077/rapln10ano2023a13, October 2023Nomes predicativos e construções neutrasJorge Baptista, Sónia Reis, Nuno J. Mamede, Revista da Associação Portuguesa de Linguística, vol. 9, n. 10, pages 13-30, DOI https://doi.org/10.26334/2183-9077/rapln9ano2022a2, October 2022Predicados de comunicação em português europeu: nominalizações e nomes autónomosSónia Reis, Nuno J. Mamede, Jorge Baptista, Revista da Associação Portuguesa de Linguística, n. 8, pages 237-259, DOI 10.26334/2183-9077/rapln8ano2021a16, October 2021Integração de Predicados Nominais em Parser: uma Experiência Com As Construções com o Verbo-Suporte Dar em Português BrasileiroAmanda Rassi, Jorge Baptista, Oto Vale, Nuno J. Mamede, Alfa, vol. 62, n. 3, pages 543-571, DOI 10.1590/1981-5794-1811-5, December 2018A Rule-Based Meronymy Extraction Module for PortugueseIlia Markov, Nuno J. Mamede, Jorge Baptista, Computación y Sistemas, vol. 19, n. 4, pages 661–683 , DOI 10.13053/CyS-19-4-2255 , December 2015ASR-based exercises for listening comprehension practice in European PortugueseThomas Pellegrini, Rui Correia, Isabel Trancoso, Jorge Baptista, Nuno J. Mamede, Maxine Eskenazi, Computer Speech and Language, DOI http://dx.doi.org/10.1016/j.csl.2013.02.004, February 2013Extending Automatic Transcripts in a Unified Data Representation towards a Prosodic-based Metadata Annotation and EvaluationFernando Batista, Helena Moniz, Isabel Trancoso, Nuno J. Mamede, Ana Isabel Mata da Silva, Journal of Speech Sciences, vol. 2, n. 2, December 2012Bilingual Experiments on Automatic Recovery of Capitalization and Punctuation of Automatic Speech TranscriptsFernando Batista, Helena Moniz, Isabel Trancoso, Nuno J. Mamede, IEEE Transactions on Audio, Speech, and Language Processing, vol. 20, n. 2, pages 474 -- 485, DOI 10.1109/TASL.2011.2159594, February 2012Caracterização e Processamento de Expressões Temporais em PortuguêsCaroline Hagège, Jorge Baptista, Nuno J. Mamede, Linguamática, vol. 2, n. 1, pages 63-76, April 2010Recovering Capitalization and Punctuation Marks for Automatic Speech Recognition: Case Study for the Portuguese Broadcast NewsFernando Batista, Diamantino António Caseiro, Nuno J. Mamede, Isabel Trancoso, Speech Communication, vol. 50, n. 10, pages 847-862, DOI 10.1016/j.specom.2008.05.008, October 2008Uma Interface Sintaxe-Semântica no Quadro do Paradigma 5PLuísa Coheur, Nuno J. Mamede, Gabriel Bès, Palavra, vol. 12, pages 75-90, December 2004A Negotiation Model for Autonomous Computational Agents: Formal Description and Empirical EvaluationFernando Lopes, Nuno J. Mamede, A. Q. Novais, Helder Coelho, Journal of Intelligent & Fuzzy Systems, vol. 12, n. 3, pages 195-212, DOI http://doi.acm.org/10.1145/1082473.1082698, December 2002Locally Perceiving Hard Global Constraints in Multi-Agent SchedulingJ. Reis, Nuno J. Mamede, H. O'Neill, Journal of Intelligent Manufacturing (JIM), vol. 12, n. 2, pages 223-236, DOI 10.1023/A:1011212929394, April 2001In Proceedings (Author)The iRead4Skills Intelligent Complexity AnalyzerWafa Aissa, Raquel Amaro, David Antunes, Thibault Bañeras-Roux, Jorge Baptista, Alejandro Catala, Luís Correia, Thomas François, Marcos Garcia González, Mario Izquierdo-Álvarez, Nuno J. Mamede, Vasco Martins, Miguel Neves, Eugénio Ribeiro, Sandra Rodriguez Rey, Elodie Vanzeveren, Conference on Empirical Methods in Natural Language Processing (EMNLP), November 2025iRead4Skills @ IberSPEECH 2024: Project presentation and developments for the Portuguese languageJorge Baptista, Eugénio Ribeiro, Nuno J. Mamede, IberSPEECH, pages 297--299, November 2024The Role of Adverbs in Language Variety Identification: The Case of Portuguese Multi-Word AdverbsIzabela Müller, Nuno J. Mamede, Jorge Baptista, Proceedings of the Eleventh Workshop on NLP for Similar Languages, Varieties, and Dialects (VarDial 2024), \"Association for Computational Linguistics\", pages 99–106, https://aclanthology.org/2024.vardial-1.8/, June 2024Hurdles in Parsing Multi-word Adverbs: Examples from PortugueseIzabela Müller, Nuno J. Mamede, Jorge Baptista, Computational Processing of the Portuguese Language, LNAI/LNCS, Springer, vol. 1, pages 1, March 2024Automatic Text Readability Assessment in European PortugueseEugénio Ribeiro, Nuno J. Mamede, Jorge Baptista, International Conference on Computational Processing of Portuguese (PROPOR), pages 97--107, March 2024Text Readability Assessment in European Portuguese: A Comparison of Classification and Regression ApproachesEugénio Ribeiro, Nuno J. Mamede, Jorge Baptista, International Conference on Computational Processing of Portuguese (PROPOR), pages 551-557, March 2024Exploring the Automated Scoring of Narrative Essays in Brazilian Portuguese using Transformer ModelsEugénio Ribeiro, Nuno J. Mamede, Jorge Baptista, International Conference on Computational Processing of Portuguese (PROPOR), vol. 2, March 2024Hurdles in Parsing Multi-word Adverbs: Examples from PortugueseIzabela Müller, Nuno J. Mamede, Jorge Baptista, Proceedings of the 16th International Conference on Computational Processing of Portuguese, Association for Computational Linguistics, vol. 1, pages 177–186, https://aclanthology.org/2024.propor-1.18/, March 2024Bootstrapping a Lexicon of Multiword Adverbs for Brazilian PortugueseIzabela Müller, Nuno J. Mamede, Jorge Baptista, Conference: EUROPHRAS International Conference on Computational and Corpus-Based Phraseology (EUROPHRAS 2022), LNCS-LNAI, Springer, pages 160-174, Springer, September 2022Support Verb Constructions across the Ocean SeaJorge Baptista, Nuno J. Mamede, Sónia Reis, 18th Workshop on Multiword Expressions (MWE 2022) n@LREC2022, European Language Resources Association (ELRA),, pages 26-36, European Language Resources Association (ELRA),, Marseille, June 2022Provérbios portugueses usuais: distribuição em corporaSónia Reis, Jorge Baptista, Nuno J. Mamede, Symposium in Information and Human Language Technology (STIL), Sociedade Brasileira de Computação, pages 32-334, Sociedade Brasileira de Computação, MG, Brasil, December 2021Syntactic Transformations in Rule-Based Parsing of Support Verb Constructions: Examples from European PortugueseJorge Baptista, Nuno J. Mamede, 9th Symposium on Languages, Applications and Technologies (SLATE 2020), OpenAccess Series in Informatics (OASIcs), Schloss Dagstuhl—Leibniz-Zentrum fur Informatik, vol. 83, pages 11:1—11:14, Schloss Dagstuhl—Leibniz-Zentrum fur Informatik, Dagstuhl, Germany, September 2020New developments on processing European Portuguese verbal idiomsAna Isabel Silva Galvão, Jorge Baptista, Nuno J. Mamede, XII Symposium in Information and Human Language Technology and Collocates Events (STIL), Brazilian Computer Society, pages 229-238, Brazilian Computer Society, Salvador, BA, Brazil, October 2019Processing European Portuguese Verbal Idioms: From the Lexicon-Grammar to a Rule-based ParserAna Isabel Silva Galvão, Jorge Baptista, Nuno J. Mamede, EUROPHRAS 2019, pages 70-77, Malaga, Spain, September 2019Suffix Identification in Portuguese using TransducersHugo Miguel Correia de Almeida, Jorge Baptista, Nuno J. Mamede, INForum 2016 - 8º Simpósio de Informática, pages 167-178, Lisboa,, September 2016ZAC – Zero Anaphora Corpus: A Corpus for Zero Anaphora Resolution in PortugueseJorge Baptista, Simone Pereira, Nuno J. Mamede, Proceedings of the Workshop on Corpora and Tools for Processing Corpora, ",
  "content_length": 73340,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:04"
}