{
  "name": "Nuno M. Preguiça",
  "homepage": "http://asc.di.fct.unl.pt/~nmp",
  "status": "success",
  "content": "Nuno Preguiça Nuno Preguiça (esta página em português) [Contacts] [Research Projects] [Software] [Publications] [Teaching/Aulas] Contacts Phone: +351 - 21 294 8300 Ext. 10753 Office: P3/7 Address: Departamento de Informática, FCT, Universidade NOVA de Lisboa Quinta da Torre 2829-516 CAPARICA, PORTUGAL Short CV [PDF] Positions Full professor at the Departament of Computer Science (Dep. Informática), Faculdade de Ciências e Tecnologia, Universidade Nova de Lisboa. Coordinator of Computer Systems research area of NOVA LINCS. Degrees \"Habilitation\" in Computer Science, Universidade Nova de Lisboa, 2019. Phd in Computer Science, Universidade Nova de Lisboa, 2003. Teaching (local) More information following this link/Mais informação seguindo este link. Research projects In the NOVA LINCS computer systems group, we are hiring Post-Docs and PhD students in the context of other projects. Contact me if you want to know more about these opportunities. We are always looking for enthusiastic and motivated students willing to work on the distributed systems area. Contact me via email or stop by my office to talk about possible topics of work in the context of research projects and for thesis proposals! I am currently involved in the following projects: Tardis: Trustworthy And Resilient Decentralised Intelligence For Edge Systems: The primary goal of TaRDIS (2023-2025, UE H2020) is to significantly ease the complexity and reduce the effort of building correct and efficient heterogeneous swarms. TaRDIS focuses on supporting the correct and efficient development of applications for swarms and decentralised distributed systems, by combining a novel programming paradigm with a toolbox for supporting the development and executing of applications. In the context of this project I am collaborating in the data management support. Partners in the projects: DTU, U. Oxford, U. Novi Sad, U. Athens, EDP Inovação, Actyx, GMV, Caixa Mágica, Telefónica, Martel. Recently finished projects: SAMOA: The SAMOA project (FCT/MCTES, 2018-21, PTDC/CCI-INF/32662/2017) addressed the systems challenges posed by supporting large-scale mobile applications in current and forthcoming Internet infrastructures. We aim to design services and algorithms that explore direct communication among mobile devices, while leveraging on the cloud and edge resources for providing efficient, highly available and reliable solutions. As a predecessor of this project, we have built Legion, a framework for extending web applications with peer-to-peer interactions. Legion relies on WebRTC, STUN and TURN to allow web clients to securely replicate data objects and synchronize peer-to-peer. Legion relies on cloud services for providing data durability - it provides an API compatible with Google Drive Realtime. This was a result of SyncFree project (2013-16, UE FP7) and LightKone project (2017-19, UE H2020, 732505). LightKone: The goal of LightKone (2017-19, UE H2020, 732505) is to develop a scientifically sound and industrially validated model for doing general-purpose computation on edge networks. (2013-16, UE FP7). Partners in the projects: UC Louvain, INRIA, U. Minho, TU Kaiserskautern, , UC Louvain, Koç University, Rovio, Trifork, Basho. AntidoteDB: AntidoteDB is a planet-scale, highly available, transactional NoSQL database with strong semantics. It support geo-replication, with: CRDTs for providing correct data convergence; causal consistency and highly available transactions for improved guarantees; and bounded-counters for supporting strong invariants over numeric values. This was a result of SyncFree project (2013-16, UE FP7) and it is being extended in LightKone project (2017-19, UE H2020, 732505). We are currently focusing on the following directions in the context of AntidoteDB: Global invariants (Indigo, IPA) - some applications can only run correctly if global invariants are maintained. We are studying how to enforce such global invariants in eventually consistent data stores; SQL invariants for NoSQL databases (AQL) - we are developing mechanisms for enforcing SQL invariants -- primery key, check and foreign key constraints -- in eventually consistent data stores; Non-uniform replication - Non-uniform replication is a replication model where each replica keeps only part of the state and it is still able to run every query locally. We are studying what applications can use this model and how to use it in practice. Concordant (2010-14, ANR-10-BLAN 0208), SyncFree (2013-16, UE FP7), SwiftComp (2013-15, FCT/MEC #PTDC/EEI-SCR/1837/2012). CRDTs are data types for which all concurrent operations commute. In the context of this research, we have proposed CRDTs as a way to simplify data replication for collaborative editing. We are currently researching the use of the same approach for managing data in cloud computing environments. These efforts are currently focused in two inter-related projects: SwiftCloud - storage solutions for cloud environments; SwiftComp - computation solutions for cloud environments. Partners in the projects: INRIA, U. Minho, TU Kaiserskautern, LORIA, UC Louvain, Koç University, Rovio, Trifork, Basho, INESC Id, INESC TEC. Byzantium (2018-2012, FCT/MCES #PTDC/EIA/74325/2006). The goal of this project is to design an efficient database system that tolerates byzantine faults. Partners in the projects: INESC/Id, MPI-SWS. My web page @ NOVA LINCS might have more up-to-date information. Software Recent software: AntidoteDB (https://github.com/SyncFree/antidote) : open-source AntidoteDB geo-replicated NoSQL database. AQL (https://github.com/JPDSousa/AQL) : SQL interface for AntidoteDB enforcing primary key, check and foreign key constraints. Legion (https://github.com/albertlinde/Legion) : framework for extending web applications with peer-to-peer interactions. Graduate Students Current Students André Rijo (PhD, co-advisor: Carla Ferreira) Pedro Fouto (PhD, co-advisor: João Leitão) Luís Silva (PhD, co-advisor: João Leitão) Bernardo Silva (Msc) Diogo Rosa (Msc) Rafael Riveiro (Msc) Recent students João Leitão (post-doc) Albert van der Linde (PhD; now @ Google) Valter Balegas (Phd; now @ElectricSQL, founder & CTO) João Soares (Ph; now at FCUP, researcher) Francisco Mendes (Msc) Ana Santos (Msc) Miguel França (Msc) Diogo Jesus (Msc) Events (recent and selected) EuroSys 2024 (PC) OPODIS 2023 (PC) EuroSys 2023 (PC) EuroSys 2021 (PC) SYSTOR 2017 (PC) Inforum 2016 (PC co-chair) OPODIS 2016 (PC) EuroSys 2016 (PC) TRIOS 2015 (PC) EuroSys 2015 (shadow PC co-chair) TRIOS 2013 (PC) Inforum 2012 (Organizing comitte co-chair) Europar 2005 (PC), 2007 (track chair) ICDCS 2006 (PC) MobiSys 2004 (PC) 12+1 Selected publications Why logical clocks are easy. [DOI | PDF | Bibtex] Carlos Baquero, Nuno Preguiça. Communications of the ACM, 59, 4 (March 2016), 43-47. Also as: Why logical clocks are easy. [DOI | PDF | Bibtex] Carlos Baquero, Nuno Preguiça. Queue: Volume 14 Issue 1, January-February 2016 High Throughput Replication with Integrated Membership Management. [@Usenix | PDF | Bibtex] Pedro Fouto, Nuno M. Preguiça, João Leitão: in Proc. USENIX ATC'22, 2022. Practical Client-side Replication: Weak Consistency Semantics for Insecure Settings. [DOI | PDF | Bibtex] Albert van der Linde, João Leitã̃o, and Nuno Preguiç̧a: PVLDB, 13(11): 2590-2605, 2020. IPA: Invariant-Preserving Applications for Weakly Consistent Replicated Databases [DOI | PDF | Bibtex] Valter Balegas, Sérgio Duarte, Carla Ferreira, Rodrigo Rodrigues, Nuno Preguiça: PVLDB, 12(4): 404-418, 2018. Legion: Enriching Internet Services with Peer-to-Peer Interactions [DOI | PDF | Bibtex] Albert van der Linde, Pedro Fouto, João Leitão, Nuno Preguiça, Santiago Castiñeira, and Annette Bieniusa: Proc. WWW'2017, 2017. Pixida: Optimizing Data Parallel Jobs in Wide-Area Data Analytics [DOI | PDF | Bibtex] Konstantinos Kloudas, Margarida Mamede, Nuno Preguiça, Rodrigo Rodrigues: Proc. VLDB'16, 2015. Cure: Strong semantics meets high availability and low latency [DOI | PDF | Bibtex] Deepthi Devaki Akkoorath, Tyler Crain, Alejandro Z. Tomsic, Annette Bieniusa, Manuel Bravo, Nuno Preguiça, Zhongmiao Li, Marc Shapiro: Proc. ICDCS'16, 2016. Putting Consistency back into Eventual Consistency [DOI | PDF | Bibtex] Valter Balegas, Sérgio Duarte, Carla Ferreira, Rodrigo Rodrigues, Nuno Preguiça, Mahsa Najafzadeh, Marc Shapiro: Proc. EuroSys ’15, 2015, ACM. Making Geo-Replicated Systems Fast if Possible, Consistent when Necessary [PDF | Bibtex] Cheng Li, Daniel Porto, Allen Clement, Johannes Gehrke, Nuno Preguica, and Rodrigo Rodrigues. In the 10th USENIX Symposium on Operating Systems Design and Implementation (OSDI '12). Conflict-free Replicated Data Types [PDF | Bibtex] Extended TR [link] Marc Shapiro, Nuno Preguiça, Carlos Baquero and Marek Zawirski. In Proceedings of the 13th International Symposium on Stabilization, Safety, and Security of Distributed Systems (SSS 2011), October 2011. Efficient middleware for byzantine fault tolerant database replication [PDF | Bibtex] Rui Garcia, Rodrigo Rodrigues, and Nuno Preguiça. In Proceedings of the sixth conference on Computer systems (EuroSys ’11), Abril 2011, ACM. A commutative replicated data type for cooperative editing [PDF | Bibtex] Nuno Preguiça, Joan Marquès, Marc Shapiro, Mihai Letia. In Proceedings of the 29th IEEE International Conference on Distributed Computing Systems (ICDCS 2009), June 2009. IEEE. Scalable Bloom Filters [DOI | PDF | Bibtex] Paulo Sérgio Almeida, Carlos Baquero, Nuno Preguiça, David Hutchison. Information Processing Letters, Vol. 101, No. 6, 2007, pp.s 255-261. Elsevier. Other recent and selected publications PS-CRDTs: CRDTs in highly volatile environments. [DOI] António Barreto, Hervé Paulino, João A. Silva, Nuno M. Preguiça: Future Gener. Comput. Syst. 141: 755-767. 2023. Babel: A Framework for Developing Performant and Dependable Distributed Protocols. [DOI | PDF | Bibtex] Pedro Fouto, Pedro Ákos Costa, Nuno M. Preguiça, João Leitão: in Proc. SRDS 2022. ",
  "content_length": 18743,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:02"
}