{
  "name": "Nuno Cruz Garcia",
  "homepage": "https://ciencias.ulisboa.pt/en/perfil/nrgarcia",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Skip to main content Ciências ULisboa Pesquisa Português English Login You are here / / Back to Top Nuno Cruz Garcia Contactos Departamento de Informática Sala/Gabinete 6.3.38 Email nrgarcia@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Auxiliar Indicadores ResearcherID Orcid Scopus Google Scholar CiênciaVitae Palavras Chave Visão Computacional Aprendizagem Automática Aprendizagem Profunda Keywords Computer Vision Machine Learning Deep Learning Currículo Resumido Nuno da Cruz Garcia é professor auxiliar no Departamento de Informática da Faculdade de Ciências da Universidade de Lisboa. Obteve o Doutoramento em Visão Computacional e Aprendizagem Automática pela Universidade de Génova, Itália, e pelo Instituto Italiano de Tecnologia. Foi investigador visitante na Boston University, EUA, professor na Universidade Lusófona em Lisboa, e engenheiro de dados na Miniclip. Atualmente, é membro integrado do LASIGE e Investigador Principal do projeto DL-CADET - Deep Learning for Breast Cancer Detection - financiado pela FCT ( EXPL/CCICOM/ 0656/2021), cujo objetivo é desenvolver métodos de aprendizagem automática profunda e visão computacional aplicados à deteção de cancro da mama em mamografia e tomossíntese. É membro da acção COST Distributed Knowledge Graphs. Participa como investigador em vários projetos na área de aprendizagem automática e visão computacional, como o projeto THOR - Avaliação Torácica Assistida por Computador usando Point-of-Care Ultrasound POCUS -, Brainteaser - Bringing Artificial Intelligence home for a better care of amyotrophic lateral sclerosis and multiple sclerosis, entre outros. Interesses Científicos A minha investigação centra-se nas áreas de Visão Computacional e Aprendizagem Automática Profunda. O meu objetivo é construir sistemas capazes de aprender várias modalidades e sem muitas anotações. Se houver interesse em colaborar ou trabalhar nestas áreas, entre em contacto. Scientific Interests My research is in the areas of in computer vision and deep learning. My goal is to build computer systems that are able to learn with multiple modalities and without many labels. Contact me if you are interested in collaborate or working on these topics. Publicações selecionadas Garcia, Nuno C., Pietro Morerio, and Vittorio Murino. \"Learning with privileged information via adversarial discriminative modality distillation.\" IEEE TPAMI transactions on pattern analysis and machine intelligence (2019). Garcia, Nuno C., Pietro Morerio, and Vittorio Murino. \"Modality distillation with multiple stream networks for action recognition.\" In Proceedings of the European Conference on Computer Vision (ECCV), pp. 103-118. 2018. Garcia, Nuno C., Sarah Adel Bargal, Vitaly Ablavsky, Pietro Morerio, Vittorio Murino, and Stan Sclaroff. \"DMCL: Distillation Multiple Choice Learning for Multimodal Action Recognition.\" IEEE WACV (2021). Vong, A., Matos-Carvalho, J.P., Toffanin, P., Pedro, D., Azevedo, F., Moutinho, F., Garcia, N.C. and Mora, A., 2021. How to Build a 2D and 3D Aerial Multispectral Map?—All Steps Deeply Explained. Remote Sensing, 13(16), p.3227. Ver todas as Publicações",
  "content_length": 3213,
  "method": "requests",
  "crawl_time": "2025-12-01 14:06:59"
}