{
  "name": "Nurit Haspel",
  "homepage": "http://www.cs.umb.edu/~nurith",
  "status": "success",
  "content": "Nurit Haspel's Homepage Nurit Haspel Computer Science Department Home CV Publications Research Students Info for Undergrads Contact information Address: Computer Science Department, University of Massachusetts Boston 100 Morrissey Blvd. Boston, MA 02125 USA Office: I recently moved to M03-201-09 (McCormack building, 3rd floor, room 201-09) Email: nurit dot haspel at umb dot edu Phone: 617-287-6414 About me I am a professor in the department of Computer Science at the University of Massachusetts, Boston. Before that I was a postdoctoral research associate with the Physical and Biological Computing group at Rice University. I graduated from the Department of Computer Science in Tel Aviv University, Israel, where I was a member of the structural bioinformatics group. I am the CS Undergraduate program director. See forms and information here Research Interests My research lies in the areas of computational structural biology and structural bioinformatics. My goal is to better understand the structure and flexibility of proteins, to model conformational changes in proteins, and to design novel nano-structures which may contribute to the understanding of the self-assembly properties of proteins and facilitate experimental nano-design. In my research, I focus on both the development of novel algorithms and the application of state-of-the-art existing methodologies to various problems in molecular biology, nanobiology and biochemistry. A detailed (albeit not always updated...) description of my past and present research can be found here. Teaching Advanced data structures and algorithms (CS310) Analysis of algorithms (CS624) Applied Discrete Mathematics (CS220, formerly CS/Math320) Algorithms in Bioinformatics (CS612, approx. every three semesters.) Past courses Higher level languages (CS450, Spring 2018) Science gateway seminar(CS187/188, Fall 2013-Spring 2014.) IB/CSCI Introductory seminar (INTRD-601) Announcements I am the PC chair for ACM-BCB 2022, which took place in August 2022 in Chicago. Congratulations to Dr. Ramin Dehghanpoor for defending his PhD thesis in July 2022. \"Algorithms and Methods in Structural Bioinformatics, Edited by Kevin Molloy, Filip Jagodzinski and me, now available here . Valid XHTML 1.0 | Copyright © Nurit Haspel | Design by super j man",
  "content_length": 2298,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:02"
}