{
  "name": "Nutan Limaye",
  "homepage": "https://itu.dk/~nuli",
  "status": "success",
  "content": "My Homepage Nutan Limaye Full Professor IT university of Copenhagen, Denmark 4B 404, Rued Langgaards Vej 7 2300 København S Danmark About I am a faculty member at IT University of Copenhagen, Denmark, and I have been here since September 2021. Before this, I had the pleasure of serving as a faculty member in the Computer Science and Engineering department at the Indian Institute of Technology, Bombay, India from August 2010 to August 2021. In addition, I had a brief but fulfilling postdoctoral stint at the Tata Institute of Fundamental Research from August 2009 to July 2010. I completed my Ph.D. at the Institute of Mathematical Sciences, Chennai, India in 2009, where I was advised by Meena Mahajan. News Manon Blanc has joined as a post-doc from July 2025. My inaugural lecture is now available online! On the PC of STOC 2025, FOCS 2025, and MFCS 2025. Research I am interested in several topics in theoretical computer science. My research mainly focuses on Complexity Theory. In the recent years, I have been spending most of my time thinking about problems in algebraic complexity theory. Publications Here is a link to a list of my publications. Awards and honours Keynote speaker at the Computational Complexity Conference 2024. Received ACM India Outstanding Contributions in Computing by a Woman Award 2023. Featured in Vigyan Vidushi, a Resource Book on Profiles of Indian Women Scientists, put together by Department of Science and Technology, Government of India. Department Award for Excellence in Teaching, Computer Science Department, IIT Bombay, India. (Based on 5-year performance 2016 -– 2021). FOCS 2021 Best paper award for Superpolynomial Lower Bound for Low-depth Algebraic Cir- cuits, co-authored with Srikanth Srinivasan and Sébastien Tavenas. IIT Bombay Research Publication Award, 2019. Funding My research is funded by the following grants. Independent Research Fund Denmark (Danmarks Frie Forskningsfond) [Jan 2024 -- Dec 2026] Villum Fonden's BARC II (Member of the core team) [Jul 2024 -- Jun 2029] Innovation Fund Denmark (co-PI) [Jan 2023 -- Dec 2025] Students and Post-docs Prateek Dwivedi (post-doc) [August 2024 -- to date] Suryajith Chillara (post-doc) [Sept 2017 -- Sept 2019] Christain Engels (post-doc) [Aug 2017 -- Aug 2019] Nikhil Balaji (post-doc) [Oct 2015 -- Jan 2017] Magnus Hansen (Ph.D. student) [Started in Sept 2024] Vaibhav Krishan (Ph.D. student (co-advised with Sundar Vishwanathan)) [Defended in May 2024] Chandra Kanta Mohapatra (Ph.D. student (co-advised with Mrinal Kumar)) [Defended in Aug 2023] Prasad Chaugule (Ph.D. student) [Defended in May 2023] Pooja Vyavahare (Ph.D. student (co-advised with D. Manjunath)) [Defended in Dec 2016] Short bio Dr. Nutan Limaye is a Full Professor in the Theoretical Computer Science section at IT University of Copenhagen, Denmark. Before this, she was an Associate Professor at IT University of Copenhagen from 2021 to 2025. Prior to that, she was an Associate Professor in the Department of Computer Science and Engineering, IIT Bombay, India. She finished her Ph.D. at the Institute of Mathematical Sciences (IMSc) Chennai, India in 2009. She did a one-year postdoc stint at TIFR Mumbai, before joining IIT Bombay in 2010. Her research interests are in theoretical Computer Science. Specifically, she is interested in Algorithms and Complexity Theory. Her recent research has focussed on Algebraic Complexity Theory and Lower Bounds. She is an Associate Editor for ACM Transactions on Computation Theory (TOCT) and . She received the IRCC IIT Bombay Research Publication Award 2019 and the Best Paper award at FOCS 2021. She received the Departmental Award for Excellence in Teaching 2022 for her contributions to teaching activities at IIT Bombay. She has been on program committees of reputed computer science conferences such as STOC, FOCS, ITCS, and ICALP. She has been a part of the Association of Computing Machinery in many different capacities. Presently, she is the ACM-W Regional Activities Co-Chair. She was associated with ACM India as the vice-chair of the ACM-W from 2019 to 2021. She was also the treasurer for Indian Association for Research in Computing Science (IARCS), India from 2018 to 2020. Contact Email: nuli [at] itu [dot] dk, nutanlimaye [at] gmail [dot] com",
  "content_length": 4292,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:02"
}