{
  "name": "O. G. Kakde",
  "homepage": "https://vnit.ac.in/engineering/cse/dr-o-g-kakde",
  "status": "success",
  "content": "Dr. O. G. Kakde​ | VNIT Nagpur Computer Science Department Dr. O. G. Kakde​ Brief Bio Brief Bio Director, IIIT, Nagpur on Deputation from VNIT, Nagpur Education Sr. No.DegreeYearSpecializationUniversity 1Ph.D.Computer ScienceNagpur University – at VRCE/VNIT 2M.Tech.Computer ScienceIIT Bombay Contact Details Phone:Email:Address: 09822571618(M)ogkakde.cse.vnit.ac.inVNIT, Nagpur Research Interest Language Processor Computer Programming Languages Advanced Compiler Construction Sponsored Research Projects Consultancy Projects Book or Book Chapters Patents STTP & Workshop Administrative Responsibilities Awards & Honors Journal Publications Conference Publications Sr. No.TitleFunding AgencyRoleYearAmount (in Lakhs INR) Sr. No.TitleFunding AgencyRoleYearAmount (in Lakhs INR) DescriptionAuthor(s)PublisherISBNYear Publishing quality books in a recognized discipline, referred for study in higher education at the National/International level : 05 Sr. No.Patent TitleApplication No.DatePresent Staus Sr. No.Title Sr. No.ResponsibilityInstituteRoleYear 1VNIT Revised admission process for Ph.D. admissionsVNIT 2GHRCE Instrumental in deciding Academic Processes under autonomy NBA 2006 – till date, Understanding of outcome based educationVNIT2006 3Visited Universities of South Africa, and Mauritius as a leader of delegation from VJTI, Mumbai, under TEQIP-II, to explore possibilities of Academic and Research Collaborations. 4Worked as reviewer for International Conferences. 5As TEQIP II Coordinator at VNIT, Nagpur, worked with Procurement Management Support System first to use and get Procurement Plan Approved Sr. No.Awards 1Member og western Regional Committee of AICTE, Mumbai. 2Member of Engineeing Evaluation and accreditation Committee for Tier-I institutes of NBA. 3Member of Shikhan Shulka Sameeti of Govt. of Maharashtra. 4Member of Academic Council of NITIE Mumbai. 5Member of Governing Council of wester Regional Instrumentation Center of UGC, university of Mumbai. 6Chancellor’s nominee on Executive Council of BATU, Lonere 7Amravati University, Member, RRC 2012- till date Sr. No.AuthorsTitlePublicationYearPublisher Sr. No.AuthorsTitlePublicationYearPublisher 1Research publications in peer-reviewed/referred international research Journals/ Conferences : More than 25",
  "content_length": 2288,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:14"
}