{
  "name": "Oana Andrei",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/oanaandrei",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Oana M Andrei Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Oana M AndreiMr Ethan KellyZhen Tian Dr Oana Andrei Senior Lecturer (Computing Science) telephone: 01413305457 email: Oana.Andrei@glasgow.ac.uk pronouns: She/her/hers Room F123, Computing Science, 12 Lilybank Gardens, Glasgow G12 8QQ Import to contacts https://orcid.org/0000-0002-1306-0219 Biography I am a Senior Lecturer (Associate Professor) with the Education and Practice (EAP) section and the Formal Analysis, Theory and Algorithms (FATA) section. Until August 2020 I was a Research Fellow in the School of Computing Science at the University of Glasgow. I worked under Prof Dame Muffy Calder on the EPSRC programme grants S4: Science of Sensor Systems Software (2016 -- 2020), Populations: A populations approach to ubicomp systems design (2011 -- 2017), and the EPRSC projects VPS: Verifying Interoperability Requirements in Pervasive Systems (2011) and SIGNAL: Stochastic process algebra for biochemical signalling pathway analysis (2009 -- 2011). In 2008 I obtained a PhD in Computer Science from INPL (nowadays University of Lorraine) and INRIA Nancy-Grand Est, France. Research interests My Computing Education research focuses on developing professional competencies across university and work-based learning programs in software engineering, as well as enhancing algorithmic thinking skills. I have been investigating pedagogical approaches such as pair programming in algorithms courses, reflective practice in work-based learning programs, and the integration of socially responsible computing. I am passionate about widening access to computing education and promoting social mobility through degree-level apprenticeships and inclusive educational practices. My 20+ years research expertise in Formal Methods - techniques for modelling complex systems as abstract mathematical entities amenable to a rigorous analysis of their properties - focuses on formal modelling and analysis, including Markov models, stochastic model checking, and term and graph rewriting. I have worked on a range of interdisciplinary research projects encompassing areas such as: Computational Biology (biochemical networks, membrane systems), Communicating Systems (autonomous systems, vehicular networks, security protocols, sensor networks, smart water networks), Human Computer Interactions (user models, analytics for interactive systems), Computational Social Science. Research groupsFormal Analysis, Theory & AlgorithmsEducation & Practice Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2019 | 2018 | 2017 | 2016 | 2014 | 2013 | 2012 | 2011 | 2010Number of items: 27.2025 Kunkeler, Thom, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Li, Xiaohan, Muncey, Andrew, Nylén, Aletta and Venn-Wycherley, Megan (2025) Same Structures, Different Settings: Exploring Computing Capital and Participation across Cultural Contexts. In: Koli Calling '25: 25th Koli Calling International Conference on Computing Education Research, Koli, Finland, 12-16 Nov 2025, (Accepted for Publication) Phetmanee, Surasak ORCID: https://orcid.org/0000-0002-8913-1124, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2025) Rational Verification in Repeated Security Games. 4th International Workshop on Safety and Security Interactions (SENSEI 2025), Stockholm, Sweden, 9 Sept 2025. ISBN 9783032020178 (doi: 10.1007/978-3-032-02018-5_23) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2025) The Development of Reflective Practice on a Work-Based Software Engineering Program: a Longitudinal Study. In: 37th IEEE Conference on Software Engineering Education and Training (CSEE&T), Ottowa, Canada, 27 April - 3 May 2025, pp. 53-61. ISBN 9798331537098 (doi: 10.1109/CSEET66350.2025.00012) Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Cutts, Quintin ORCID: https://orcid.org/0000-0002-6368-9912, Maguire, Joseph ORCID: https://orcid.org/0000-0002-3718-7679, Morrison, Alistair, Parkinson, Jack ORCID: https://orcid.org/0000-0001-6175-7638, Somerville, Derek and Storer, Tim ORCID: https://orcid.org/0000-0002-4026-097X (2025) Assessing Work-Based Learning in the Senior Years of a Software Engineering Graduate Apprenticeship Program. In: IEEE Conference on Software Engineering Education and Training (CSEE&T), Ottawa, Ontario, Canada, 28-29 April 2025, pp. 30-40. ISBN 9798331537098 (doi: 10.1109/CSEET66350.2025.00010) Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Morrison, Alistair (2025) Understanding Skill Transfer Between University and Workplace Through Reflective Practice: A Software Engineering Work-Based Learning Experience. In: 30th ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE ’25), Nijmegen, Netherlands, 30 June- 2 July 2025, pp. 368-374. ISBN 9798400715679 (doi: 10.1145/3724363.3729119) Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2025) Course Portfolio on Algorithmics. Project Report. Zenodo. (doi: 10.5281/zenodo.14809895). Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 and Petrovska, Olga (2025) Integrating Socially Responsible Computing Competencies in Computer Science and Software Engineering Education. 9th Conference on Computing Education Practice (CEP 2025), Durham, UK, 07 Jan 2025. pp. 36-37. ISBN 9798400711725 (doi: 10.1145/3702212.3702225) 2024 Phetmanee, Surasak ORCID: https://orcid.org/0000-0002-8913-1124, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2024) STEVE: A Rational Verification Tool for Stackelberg Security Games. In: 19th International Conference on Integrated Formal Methods (iFM 2024), Manchester, UK, 11-15 Nov 2024, pp. 267-275. ISBN 9783031765537 (doi: 10.1007/978-3-031-76554-4_15) Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 and Sojtory, Zoltan (2024) LLM-aided Pair Programming for Algorithm Tracing. In: UK and Ireland Computing Education Research Conference (UKICER 2024), Manchester, UK, 05-06 Sep 2024, p. 20. ISBN 9798400711770 (doi: 10.1145/3689535.3689546) Lungu, Alexandru-Ioan, Teodorescu, Vlad, Zaborila, Andrei, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 and Lucanu, Dorel (2024) Alk: a formal-methods-based educational platform for enhancing algorithmic thinking. Scientific Annals of Computer Science, XXXIV(1), pp. 39-66. (doi: 10.47743/SACS.2024.1.39) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Morrison, Alistair and Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 (2024) The Development of Students' Professional Competencies on a Work-Based Software Engineering Program. In: 55th ACM Technical Symposium on Computer Science Education (SIGCSE TS), Portland, OR, USA, 20-23 March 2024, pp. 81-87. ISBN 9798400704239 (doi: 10.1145/3626252.3630944) 2023 Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 and Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 (2023) On Students’ Experiences with Algorithm Tracing using Pair Programming. In: 19th ACM Conference on International Computing Education Research (ICER 2023), Chicago, Illinois, USA, 8-10 October 2023, ISBN 9781450399753 (doi: 10.1145/3568812.3603477) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 and Kallia, Maria ORCID: https://orcid.org/0000-0002-8591-9651 (2023) Widening access to higher education through degree-level apprenticeships in software engineering. In: IEEE ASEE Frontiers in Education Conference (FIE 2023), College Station, Texas, 18–21 October 2023, ISBN 9798350336429 (doi: 10.1109/FIE58773.2023.10343199) 2022 Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2022) A Practice Enquiry Design to Investigate How Pair Programming Can Help with Constructing Automata. In: United Kingdom and Ireland Computing Education Research (UKICER 2022), Dublin, Ireland, 1-2 Sept 2022, p. 20. ISBN 9781450397421 (doi: 10.1145/3555009.3555031) 2021 Kavanagh, William ORCID: https://orcid.org/0000-0003-0521-1643, Miller, Alice ORCID: https://orcid.org/0000-0002-0941-1717, Norman, Gethin ORCID: https://orcid.org/0000-0001-9326-4344 and Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2021) Balancing turn-based games with chained strategy generation. IEEE Transactions on Games, 13(2), pp. 113-122. (doi: 10.1109/TG.2019.2943227) 2019 Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Calder,",
  "content_length": 26270,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:04"
}