{
  "name": "Odd Erik Gundersen",
  "homepage": "https://www.ntnu.edu/employees/odderik",
  "status": "success",
  "content": "Odd Erik Gundersen - NTNU Odd Erik Gundersen Foto: Ragna Fagerli Download press photo Download press photo Foto: Close Odd Erik Gundersen Associate Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering odderik@ntnu.no +4747637075 IT-bygget, Gløshaugen ResearchGate Google Scholar About CV Odd Erik Gundersen is a Norwegian computer scientist and artificial intelligence (AI) researcher, currently serving as an Associate Professor at the Department of Computer Science at the Norwegian University of Science and Technology (NTNU) in Trondheim. He also holds the position of Chief AI Officer at Aneo AS, a renewable energy company, and is a co-founder of Virtur AS, a startup focused on AI-driven driver education. Gundersen earned both his MSc and PhD in AI from NTNU. Since 2006, he has applied AI in various industries, particularly startups, and has led several research projects in the field. His research interests include reproducibility in AI, time-series forecasting, decision support systems, and case-based reasoning. Gundersen has also explored the application of AI in oilwell drilling, renewable energy and driver training. As an educator, he teaches and supervises PhD and Master's students in AI at NTNU. Odd Erik is the Chair of the Norwegian Artificial Intelligence Society (NAIS) and the Co-editor in Chief for AI Magazine with K. Brent Venable. Competencies AI Applications Artificial Intelligence Case-based Reasoning Decision Support Machine Learning Metascience Renewable Energy Reproducibility Publications 2025 Gundersen, Odd Erik; Cappelen, Odd; Mølnå, Martin; Nilsen, Nicklas Grimstad. (2025) The Unreasonable Effectiveness of Open Science in AI: A Replication Study. Proceedings of the AAAI Conference on Artificial Intelligence Academic article Davis-Stober, Clintin P.; Sarafoglou, Alexandra; Aczel, Balazs; Chandramouli, Suyog; Errington, Timothy M.; Field, Sarahanne M.. (2025) How can we make sound replication decisions?. Proceedings of the National Academy of Sciences of the United States of America (PNAS) Article in business/trade/industry journal Aczel, Balazs; Barwich, Ann-Sophie; Diekman, Amanda; Fishbach, Ayelet; Goldstone, R; Gomez, Pablo. (2025) The present and future of peer review: Ideas, interventions, and evidence. Proceedings of the National Academy of Sciences of the United States of America (PNAS) Article in business/trade/industry journal Intahchomphoo, Channarong; Gundersen, Odd Erik; PEYTON, Liam; WECHAYACHAI, Omkaew. (2025) Sustainable Innovation Post-Pandemic: Perspectives from the US, Canada, Norway, and Thailand. IEEE Engineering Management Review Article in business/trade/industry journal 2024 Gundersen, Odd Erik; Helmert, Malte; Hoos, Holger H.. (2024) Improving Reproducibility in AI Research: Four Mechanisms Adopted by JAIR. The journal of artificial intelligence research Academic article Intahchomphoo, Channarong; Millar, Jason; Gundersen, Odd Erik; Tschirhart, Christian; Meawasige, Kris; Salemi, Hojjat. (2024) Effects of artificial intelligence and robotics on human labour: A systematic review. Legal Information Management Academic article Fleten, Kristine Klock; Aasgård, Ellen Krohn; Xing, Liyuan; Grøttum, Hanne Høie; Fleten, Stein-Erik; Gundersen, Odd Erik. (2024) Applying and benchmarking a stochastic programming-based bidding strategy for day-ahead hydropower scheduling. Computational Management Science Academic article Strøm, Eivind; Gundersen, Odd Erik. (2024) Performance metrics for multi-step forecasting measuring win-loss, seasonal variance and forecast stability: an empirical study. Applied Intelligence - The International Journal of Research on Intelligent Systems for Real Life Complex Problems Academic article Nasar, Wajeeha; Karlsen, Anniken Susanne Thoresen; Torres, Ricardo Da Silva; Gundersen, Odd Erik. (2024) Artificial Intelligence – Informed Decision Support for Search and Rescue. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Rehm, Johannes; Reshodko, Irina; Gundersen, Odd Erik. (2024) A virtual driving instructor that assesses driving performance on par with human experts. Expert Systems With Applications Academic article Kapoor, Sayash; Cantrell, Emily; Peng, Kenny; Pham, Hien; Bail, Chris; Gundersen, Odd Erik. (2024) REFORMS: Consensus-based Recommendations for Machine-learning-based Science. Science Advances Academic article Rehm, Johannes; Reshodko, Irina; Børresen, Stian Zimmermann; Gundersen, Odd Erik. (2024) The Virtual Driving Instructor: Multi-Agent System Collaborating via Knowledge Graph for Scalable Driver Education. Proceedings of the AAAI Conference on Artificial Intelligence Academic article Bjørnland, Johan Fredrik Rønningen; Gedde, Yrjar Bringedal; Rehm, Johannes; Reshodko, Irina; Gundersen, Odd Erik. (2024) A Virtual Driving Instructor That Generates Personalized Driving Lessons Based on Student Skill Level. Proceedings of the AAAI Conference on Artificial Intelligence Academic article Nasar, Wajeeha; Gundersen, Odd Erik; Torres, Ricardo; Karlsen, Anniken Susanne Thoresen. (2024) Knowledge Graphs to Accumulate and Convey Knowledge from Past Experiences in Search and Rescue Planning and Resource Allocation. Applied Artificial Intelligence Academic article Rehm, Johannes; Reshodko, Irina; Børresen, Stian Zimmermann; Gundersen, Odd Erik. (2024) The virtual driving instructor: Multi-agent system collaborating via knowledge graph for scalable driver education. The AI Magazine Academic article Nasar, Wajeeha; Karlsen, Anniken Susanne Thoresen; Torres, Ricardo da Silva; Gundersen, Odd Erik. (2024) Artificial Intelligence-Informed Decision Support for Search and Rescue. NTNU Norges teknisk-naturvitenskapelige universitet NTNU Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Nasar, Wajeeha; Torres, Ricardo; Gundersen, Odd Erik; Karlsen, Anniken Susanne Thoresen. (2024) Improving search and rescue planning and resource allocation through case-based and concept-based retrieval. Journal of Intelligent Information Systems Academic article 2023 Venable, Kristen Brent; Gundersen, Odd Erik. (2023) Editorial. The AI Magazine Editorial Gundersen, Odd Erik; Shamsaliei, Saeid; Kjærnli, Håkon Slåtten; Langseth, Helge. (2023) On Reporting Robust and Trustworthy Conclusions from Model Comparison Studies Involving Neural Networks and Randomness. Academic chapter/article/Conference paper Grotmol, Gunnar Grung; Furdal, Eivind Hovdegård; Dalal, Nisha; Ottesen, Are Løkken; Rørvik, Ella-Lovise Hammervold; Mølnå, Martin. (2023) A Robust and Scalable Stacked Ensemble for Day-Ahead Forecasting of Distribution Network Losses. Academic chapter/article/Conference paper Gundersen, Odd Erik. (2023) Improving reproducibility of artificial intelligence research to increase trust and productivity. Academic chapter/article/Conference paper Nasar, Wajeeha; Torres, Ricardo Da Silva; Gundersen, Odd Erik; Karlsen, Anniken Susanne Thoresen. (2023) The Use of Decision Support in Search and Rescue: A Systematic Literature Review. ISPRS International Journal of Geo-Information Academic article Gundersen, Odd Erik; Coakley, Kevin. (2023) Open Research in Artificial Intelligence and the Search for Common Ground in Reproducibility: A Commentary on “(Why) Are Open Research Practices the Future for the Study of Language Learning?”. Language Learning Academic article 2022 Coakley, Kevin; Kirkpatrick, Christine; Gundersen, Odd Erik. (2022) Examining the Effect of Implementation Factors on Deep Learning Reproducibility. Academic chapter/article/Conference paper Xing, Liyuan; Sizov, Gleb Valerjevich; Gundersen, Odd Erik. (2022) Digital Transformation in Renewable Energy: Use Cases and Experiences from a Nordic Power Producer. Academic chapter/article/Conference paper 2021 Alfredsen, Knut; Dalsgård, Arild Sørensen; Shamsaliei, Saeid; Halleraker, Jo Halvard; Gundersen, Odd Erik. (2021) Towards an automatic characterization of riverscape development by deep learning. Rivers Research and Applications: an international journal devoted to river research and management Academic article Gundersen, Odd Erik. (2021) The fundamental principles of reproducibility. Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences Academic article Gundersen, Odd Erik. (2021) The case against registered reports. The AI Magazine Academic article Dalal, Nisha; Mølnå, Martin; Herrem, Mette; Røen, Magne; Gundersen, Odd Erik. (2021) Day-ahead forecasting of losses in the distribution network. The AI Magazine Academic article Venable, Kristen Brent; Gundersen, Odd Erik. (2021) Letter from the Editors: AI Magazine in the new era of AI. The AI Magazine Editorial Gundersen, Odd Erik; Shamsaliei, Saeid; Isdahl, Richard Juul. (2021) Do machine learning platforms provide out-of-the-box reproducibility?. Future Generation Computer Systems Academic article Intahchomphoo, Channarong; Vellino, André; Gundersen, Odd Erik; Jarusawat, Piyapat; Wongjamras, Pranee; Tschirhart, Naomi Anne. (2021) The Impact of Thailand's Migrant Worker Law on Literacy and Social Media among Ethnic Shan Female Migrants from Myanmar. International Journal of Legal Information (IJLI) Academic article 2020 Intahchomphoo, Channarong; Vellino, André; Gundersen, Odd Erik; Tschirhart, Christian; Shaaban, Eslam. (2020) References to Artificial Intelligence in Canada's Court Cases. Legal Information Management Academic article Gundersen, Odd Erik. (2020) The Reproducibility Crisis Is Real. The AI Magazine Academic article Intahchomphoo, Channarong; Gundersen, Odd Erik. (2020) Artificial Intelligence and Race: a Systematic Review. Legal Information Management Academic article Dalal, Nisha; Mølnå, Martin; Herrem, Mette; Røen, Magne; Gundersen, Odd Erik. (2020) Day-Ahead Forecasting of Losses in the Distribution Network. Academic chapter/article/Conference paper Sandberg, Martin K. Hoel; Rehm, Johannes",
  "content_length": 39491,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:04"
}