{
  "name": "Oded Stein",
  "homepage": "https://odedstein.com",
  "status": "success",
  "content": "Oded Stein Oded Stein Research · Teaching · Blog I am Oded Stein, an assistant professor at the University of Southern California’s Viterbi School of Engineering where I lead the Geometry and Graphics Group (GGG). You can contact me at ostein@usc.edu. My office is GCS 202N. If you want to work with me as an undergraduate intern, a graduate student, or a postdoc, please visit this page for more information. My interests include geometry processing, numerical mathematics and optimization, simulation, differential geometry and algebraic topology. If it has anything to do with geometry, I am interested! You can find my list of publications here. Interesting links: My GitHub profile A simple geometry processing library in Python using numpy/scipy by Silvia Sellán and me. Use it for your Python geometry processing projects! A guide on how to write your first ACM SIGGRAPH / TOG paper created by others and me of SIGGRAPH RCDC. A collection of meshes with minimal licensing requirements that I have curated. Use them in your research project! A quick introduction to geometry processing with Python. A simple tutorial for general audiences. Academia in computer science and mathematics can be complicated to navigate for newcomers. If you have any questions about how to plan your academic career, how to apply for grad school, how to get research internships, or anything of the like, feel free to email me if you think my advice might be useful. Short biography Oded Stein recieved his PhD in Applied Mathematics in 2020 from Columbia University under the supervision of Eitan Grinspun for his research of smoothness energies in geometry processing. From 2020 to 2022 he was a postdoctoral fellow at MIT’s Computer Science & Artificial Intelligence Lab with the gracious support of the Swiss National Science Foundation’s Early Postdoc.Mobility fellowship. Since 2023 Oded Stein is an Assistant Professor at USC’s Viterbi School of Engineering. Oded Stein has won the 2025 SIAM Geometric Design Early Career Prize, and his geometry processing library Gpytoolbox has won the 2025 SGP software award. My CV can be found here. Acknowledgements My research is generously supported by a gift from Adobe Inc. I graciously acknowledge the support of the National Science Foundation (award #2335493). Cheeseman cartoon figure created by Alec Jacobson. © 2022 Oded Stein, using the Purity theme. Hosted on GitHub Pages",
  "content_length": 2416,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:05"
}