{
  "name": "Oded Regev 0001",
  "homepage": "http://www.cims.nyu.edu/~regev",
  "status": "success",
  "content": "Oded Regev My lab uses interpretable machine learning techniques to derive insights into biological processes. Although they provide good predictions, typical machine learning models are 'black box' and as a result do not help advance our understanding of biology. Without a good understanding of the underlying processes, generalizing beyond the dataset (to other cell types, developmental states, diseases contexts, etc.) is nearly impossible. By designing our models with interpretability in mind, we are able to 'observe' molecular processes such as RNA processing or translation at the level of individual protein-nucleic acid interactions, resulting in novel models. My other work is in mathematics, cryptography, and quantum computation. My main contribution there is to lattice-based cryptography, and specifically the Learning With Errors problem, forming the basis of post-quantum cryptography. 2025/08: Our NSF MFB proposal with Jef Boeke on probing ribosome organization got funded 2025/06: Congratulations to Simon Liu for winning the NSF GRFP! 2023/10: Our NSF proposal with Jingyi Fei on understanding splicing through synthetic datasets and imaging got funded 2023/10: NIH proposal (with Jef Boeke as PI) on using machine learning to assemble big DNA got funded 2023/10: Our work on quantum factoring algorithms was covered in Science Magazine 2022/9: Our NIH proposal on antisense oligo therapy for nonsense mutations got funded 2022/9: Our NSF proposal with Shu-Bing Qian on deciphering RNA regulatory logic with interpretable machine learning got funded If you would like to serve as a grader or tutor for a course I teach, please fill out this form. Do not contact by email. 2022/7: We are hiring! Undergraduate, graduate students, and postdocs with interest in using machine learning for discovery in biological sciences should apply. Strong drive is a must. We are also hiring postdocs in theoretical computer science with a deadline in late August so please apply early. 2022/10: Congratulations to Susan for winning the Single Ventricle Research Fund from Additional Ventures. 2021/9: Faculty Fellow Mauricio Arias joins the lab after research at Columbia University. Welcome Mauricio! 2020/9: Congratulations to Susan for winning the Life Sciences Research Foundation award Elizabeth Speiser Phase separation driving RNA logic: We proposed a model for RNA processing at the interface of two biomolecular condensates, arguing that interfaces of phase-separated condensates have functional roles in spatially organizing biochemical reactions. We also explore how phase separation can lead to unique biological ``threshold'' codes, such as those seen in RNA splicing. We are currently investigating this model using a combination of computational and imaging techniques. Splicing code: Genes in our genome contain long introns that are removed in a process called splicing. The sequence features that demarcate those introns are highly intricate and are known as the splicing code. In our lab, we combine high-throughput experiments with interpretable machine learning analysis to gain insight into this remarkable process. We are particularly interested in changes in splicing occurring during development. These results can have implications to human disease and therapeutics. Mathematical and cryptographic aspects of lattices: A main focus of our research is on lattice-based cryptography, and specifically, the Learning With Errors (LWE) problem. Lattice-based cryptography offers many advantages over traditional number-theoretic cryptography, including its conjectured security against quantum computers, making it one of the leading candidates for post-quantum (or quantum-resistant) cryptography. It is also incredibly versatile, allowing the construction of advanced cryptographic protocols like fully homomorphic encryption. Lab Members Postdocs Mauricio A. Arias (Research Scientist; Ph.D. 2013, Columbia University) Susan E. Liao (Assistant Professor/Faculty Fellow; Ph.D. 2019, Johns Hopkins; funded by Additional Ventures (previously the Life Sciences Research Foundation and the Lalor Foundation) Ph.D. Arush Ramteke (2025-) Simon Liu (2024-) Avery Dunn (2024-; with Jef Boeke) Undergrad and MS Joyce Xie (2025) Wenjing Zhang (2025) Alumni Postdocs Jeroen Zuiddam (Ph.D. 2018, University of Amsterdam) Young Kun Ko, joint with Subhash Khot (Ph.D. 2018, Princeton) Euiwoong Lee, joint with Subhash Khot (Ph.D. 2017, CMU; assistant professor, UMich) Omri Weinstein (Ph.D. 2015, Princeton; assistant professor, Columbia) Aravindan Vijayaraghavan (Ph.D. 2013, Princeton; assistant professor, Northwestern) Anindya De (Ph.D. 2013, UC Berkeley; assistant professor, Northwestern) Jop Briët, joint with Assaf Naor (Ph.D. 2011, CWI, Amsterdam; researcher, CWI, Amsterdam) Daniel Dadush, joint with Assaf Naor (Ph.D. 2012, Georgia Tech; researcher, CWI, Amsterdam) Divesh Aggarwal, joint with Yevgeniy Dodis (Ph.D. 2012, ETH Zurich; assistant professor, NUS) Vadim Lyubashevsky (Ph.D. 2008, UC San Diego; researcher in IBM Zurich) Dan Gutfreund (Ph.D. 2005, Hebrew University; researcher in IBM Cambridge) Ph.D. Allyn Muzhi Xu (2019-2023) Min Jae Song (2019-2023) (with Joan Bruna) Mukund Sudarshan (2022; with Subramanian and Ranganath; supported by the PhRMA Foundation) Shravas Rao (2018; Assistant Professor at Portland State) Alexander Golovnev (2017, with Yevgeniy Dodis; Assistant Professor at Georgetown University) Noah Stephens-Davidowitz (2017, with Yevgeniy Dodis; Assistant Professor in Cornell) Klim Efremenko (2012, with Amnon Ta-Shma; Associate Professor in Ben Gurion University) Ishay Haviv (2011; Associate Professor in the Academic College of Tel Aviv-Yaffo) Avi Ben-Aroya (2011, with Amnon Ta-Shma) Iftah Gamzu (2010, with Yossi Azar) Ricky Rosen (2010, with Ran Raz) Undergrad and MS John Quigley Zijin Hu Elizabeth Wei Frank Liu Nicholas Wang Ivri Faitelson (honors CS/math double major, 2024) Chuanyang Jin (honors CS/math double major, 2024) Fiker Zewdie (Biology major, 2025) Brittany Bustos (Biology major, 2024) Panchi (Steven) Mei (CS major, 2022) Bob Junyi Zou (math major, 2021) Minjun Park (CS major, 2020) Yi Tang (CS MS, 2020) Guy Moshkovitz (MS, 2011) Michal Moshkovitz (MS, 2010, joint with Amir Shpilka) Liron Schiff (MS, 2008) Lior Eldar (MS, 2008) Ishay Haviv (MS, 2006) Ricky Rosen (MS, 2005) Teaching Basic Algorithms, Fall 2025 Quantum Computation, Fall 2025 Past Courses Oded Regev is a Silver Professor in the Courant Institute of Mathematical Sciences of New York University. Prior to joining NYU, he was affiliated with Tel Aviv University and the École Normale Supérieure, Paris under the French National Centre for Scientific Research (CNRS). He received his Ph.D. in computer science from Tel Aviv University in 2001. He is the recipient of a European Research Council (ERC) Starting Grant in 2008, the 2018 Gödel Prize, the 2019 Simons Investigator award, as well as best paper awards in STOC 2003 and Eurocrypt 2006. His research areas include theoretical computer science, cryptography, quantum computation and complexity theory, as well as applications of machine learning for biological discovery. His main contributions to date are in the area of lattice-based cryptography, where he introduced several key concepts, including the Learning with Errors (LWE) problem and the use of Gaussian measures. His current work also focuses on using machine learning for scientific discovery, specifically, for generating and testing hypotheses about RNA processes in biology. Organizer and co-founder of TCS+, an online seminar series in theoretical computer science, accessible to the widest possible audience, and ensuring a carbon-free dissemination of ideas across the globe. Theory of Computing (Associate Editor-in-Chief) Program committee member in STOC 2004, CCC 2005, TCC 2007, ANTS 2008, STOC 2008, CCC 2009, STOC 2010, STOC 2012 Dynamics of RNA localization to nuclear speckles are connected to splicing efficiency (link)Jinjun Wu, Yu Xiao, Yunzheng Liu, Li Wen, Chuanyang Jin, Shun Liu, Sneha Paul, Chuan He, Oded Regev*, Jingyi Fei* Science Advances, 2024. An Efficient Quantum Factoring Algorithm (link)Oded Regev Submitted, 2024. Quanta Magazine article. Science news. Deciphering RNA splicing logic with interpretable machine learning (link)Susan E. Liao, Mukund Sudarshan, Oded Regev PNAS 2023. Uncovering Distinct Peptide Charging Behaviors in Electrospray Ionization Mass (link)Allyn Muzhi Xu, Lauren Clarissa Tang, Marko Jovanovic, and Oded Regev Journal of the American Society for Mass Spectrometry, 2023 An integer parallelotope with small surface area (link)Assaf Naor and Oded Regev Journal of Functional Analysis, 2023. Quanta Magazine article. Nuclear speckle-localized RNAs exhibit preferential positioning and orientation (link)Sneha Paul, Mauricio A. Arias, Li Wen, Susan E. Liao, Jiacheng Zhang, Xiaoshu Wang, Oded Regev*, and Jingyi Fei* iScience 2024. Splicing at the phase-separated nuclear speckle interface: a model (link)Susan E. Liao, Oded Regev Nucleic Acids Research 2021 New bounds on the density of lattice coverings (link)Or Ordentlich, Oded Regev, and Barak Weiss Journal of the AMS A Reverse Minkowski Theorem (link)Oded Regev, Noah Stephens-Davidowitz STOC 2017. Annals of Math. Towards Strong Reverse Minkowski-type Inequalities for Lattices (link)Daniel Dadush, Oded Regev FOCS 2016 Counterexamples to a conjecture of Woods (link)Oded Regev, Uri Shapira, Barak Weiss Duke J Math Recovering Short Generators of Principal Ideals in Cyclotomic Rings (link)Ronald Cramer, Léo Ducas, Chris Peikert, Oded Regev EUROCRYPT 2016 Tight Hardness of the Non-commutative Grothendieck Problem (link)Jop Briët, Oded Regev, Rishi Saket FOCS 2015 Solving the Shortest Vector Problem in 2^n Time via Discrete Gaussian Sampling (link)Divesh Aggarwal, Daniel Dadush, Oded Regev, Noah Stephens-Davidowitz STOC 2015 On the Lattice Isomorphism Problem (link)Ishay Haviv, Oded Regev SODA 2014 Classical",
  "content_length": 14703,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:06"
}