{
  "name": "Oded Nov",
  "homepage": "https://wp.nyu.edu/odednov",
  "status": "success",
  "content": "Oded Nov Morton L. Topfer Professor in Technology Management Tandon School of Engineering, New York University General Information Office: 2 MetroTech Room 1094 Phone: 646-997-3562 Email: onov@nyu.edu RESEARCH INTERESTS The future of work Digital health Human-computer interaction Citizen science HCI and decision-making We are looking for outstanding PhD students and post-docs – people with HCI/social computing background are encouraged to apply. EDUCATION Ph.D. Cambridge University M.Sc. London School of Economics B.A. Tel Aviv University PUBLICATIONS (Google Scholar citations) Varanasi, R.A., Wiesenfeld, B.M. and Nov, O. (2025). AI Rivalry as a Craft: How Resisting and Embracing Generative AI Are Reshaping the Writing Profession. Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. Ghaiumy Anaraky, R., Schuster, A.M., Van Fossen, J., Nov, O. and Cotten, S. (2025). Increased Use of Asocial Technologies Is Associated with Reduced Well-being Among Older Adults. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. Ghaiumy Anaraky, R., Cartwright, M. and Nov, O. (2025). The Role of Auditory Environments and Anxiety in Detecting Phishing Emails. In Proceedings of the Extended Abstracts of the ACM CHI Conference on Human Factors in Computing Systems. Mandal, S., Wiesenfeld, B., Mann, D., Nov, O. (2025). The” New” New Normal: Changes in Telemedicine Utilization Since COVID-19. The American Journal of Managed Care, 31(3):74-78. Mendel, T., Singh, N., Mann, D.M., Wiesenfeld, B. and Nov, O. (2025). Laypeople’s Use of and Attitudes Toward Large Language Models and Search Engines for Health Queries: Survey Study. Journal of Medical Internet Research, 27, p.e64290. Mandal, S., Wiesenfeld, B., Mann, D., Szerencsy, A., Iturrate, E., and Nov, O. (2024). Quantifying the Impact of Telemedicine and Patient Medical Advice Request Messages on Physicians’ Inbasket Work. NPJ Digital Medicine 7,1,35. Mendel, T., Singh, N., Mann, D., Wiesenfeld, B., and Nov, O. (2024). Laypeople’s Use of and Attitudes Toward Large Language Models and Search Engines for Health Queries: A Survey Study. Journal of Medical Internet Research (JMIR). Ghaiumy Anaraky, R., Li, Y., Cho, H., Huang, D.Y., Byrne, K.A., Knijnenburg, B. and Nov, O. (2024). Personalizing Privacy Protection With Individuals’ Regulatory Focus: Would You Preserve or Enhance Your Information Privacy? Proceedings of the CHI Conference on Human Factors in Computing Systems. Small, W. R., Wiesenfeld, B., Brandfield-Harvey, B., Jonassen, Z., Mandal, S., Stevens, E. R., … & Mann, D. (2024). Large language model–based responses to patients’ in-basket messages. JAMA network open, 7(7), e2422399-e2422399. Mendel, T., Nov, O. and Wiesenfeld, B. (2024). Advice from a Doctor or AI? Understanding Willingness to Disclose Information Through Remote Patient Monitoring to Receive Health Advice. Proceedings of the ACM on Human-Computer Interaction, 8(CSCW2), pp.1-34. Dove, G., Guthmann, M.R., Charvet, L., Nov, O. and Pilloni, G. (2024). “Data Is One Thing, But I Want To Know The Story Behind”: Designing For Self-Tracking and Remote Patient Monitoring In The Context Of Multiple Sclerosis Care. In Proceedings of the 2024 ACM Designing Interactive Systems Conference (pp. 597-618). Sukumar, P.T., Porfiri, M. and Nov, O. (2024). Are Mass Shootings in the US Increasing? Understanding How Differing Definitions of Politically Charged Events Impact People’s Perceptions of Expected Trends in Visualizations. IEEE Computer Graphics and Applications, 44(4), pp.140-149. Nov, O., Singh, N., Mann, D.M. (2023). Putting ChatGPT’s Medical Advice to the (Turing) Test. JMIR Medical Education, 9(1), p.e46939. Lawrence, K., Singh, N., Jonassen, Z., Groom, L., Alfaro-Arias, V., Mandal, S., Schoenthaler, A., Mann, D., Nov, O., Dove, G. (2023). Operational Implementation of Remote Patient Monitoring Within a Large Ambulatory Health System: Multimethod Qualitative Case Study. JMIR Human Factors 10 (1) e45166. Anand, S., Arazy, O., Mandayam, N. and Nov, O. (2023). A game-theoretic analysis of Wikipedia’s peer production: The interplay between community’s governance and contributors’ interactions. Plos one, 18(5), p.e0281725. Bell, A., Nov, O. and Stoyanovich, J. (2023). Think about the stakeholders first! Toward an algorithmic transparency playbook for regulatory compliance. Data & Policy, 5, p.e12. Dove, G., Shanley, J., Matuk, C., & Nov, O. (2023). Open Data Intermediaries: Motivations, Barriers and Facilitators to Engagement. Proceedings of the ACM on Human-Computer Interaction, 7(CSCW1), 1-22. Wiesenfeld, B., Aphinyanaphongs, Y., Nov, O. (2022). Model Transferability in Healthcare: a Sociotechnical Perspective. Nature Machine Intelligence 4 (10) 807-809. Lawrence, K., Nov, O., Mann, D., Mandal, S., Iturrate, E., Wiesenfeld, B. (2022). The Impact of Telemedicine on Physicians’ After-hours Electronic Health Record “Work Outside Work” During the COVID-19 Pandemic: Retrospective Cohort Study. JMIR Medical Informatics 10(7). Dove, G., Fernando, A., Hertz, K., Kim, J., Rizzo, JR., Seiple, W., Nov, O. (2022). Digital Technologies In Orientation And Mobility Instruction For People Who Are Blind Or Have Low Vision. Proceedings of the ACM on Human-Computer Interaction (CSCW). Mandal, S, Wiesenfeld, B., Mann, D., Lawrence, K.,  Chunara, R., Testa, P., Nov, O. (2022). Evidence for telemedicine’s ongoing transformation of healthcare delivery since the onset of COVID-19: A retrospective observational study. JMIR Formative Research. Dove, H., Mydlarz, C., Fries, D., Chen, S., Johnson, V., Bello, JP., Nov, O. (2022). From Environmental Monitoring to Mitigation Action: Considerations, Challenges, and Opportunities for HCI. Proceedings of the ACM on Human Computer Interaction (CSCW). Seals, A., Pilloni, G., Kim, J., Sanchez, R., Rizzo, JR., Charvet, L., Nov, O. Dove, G. (2022). ‘Are They Doing Better In The Clinic Or At Home’: Understanding Clinicians’ Needs When Visualizing Wearable Sensor Data Used In Remote Gait Assessments For People With Multiple Sclerosis. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). Bell, A., Solano-Kamaiko, I., Nov, O., Stoyanovich, J. (2022). It’s Just Not That Simple: An Empirical Study of the Accuracy-Explainability Trade-off in Machine Learning for Public Policy. ACM Conference on Fairness, Accountability, and Transparency (ACM FAccT). Mendez Mendez, A., Cartwright, M., Bello, JP., Nov, O. (2022). Eliciting Confidence for Improving Crowdsourced Audio Annotations. Proceedings of the ACM on Human Computer Interaction (CSCW). Lawrence, K., Nov, O., Mann, D., Mandal, S., Iturrate, E., Wiesenfeld, B. (2022). Virtual Work Outside Work: The Impact of Telemedicine on Physicians’ After-Hours EHR Work During the COVID-19 Pandemic. JMIR Medical Informatics. Dove, G., Mydlarz, C., Bello, J.P. and Nov, O. (2022). Sounds of New York City. ACM Interactions, 29(3), pp.32-35. Shaer, O., Otiono, J., Qian, Z., Seals, A., Nov, O. (2022). Remote Evaluation of Augmented Reality Interaction with Personal Health Information. Frontiers in Computer Science. Barak-Ventura, R., Stewart-Hughes, K., Nov, O., Raghavan, P., Marín Ruiz, M., Porfiri, M. (2022). Data-driven classification of human movements in virtual reality-based serious games: A pre-clinical rehabilitation study in citizen science. JMIR Serious Games. – Balestra, M., Chen, J., Iturrate, E., Aphinyanaphongs, Y., and Nov, O. (2021). Predicting Inpatient Pharmacy Order Interventions Using Provider Action Data. JAMIA Open 4 (3). – Yuan, J., Nov, O., and Bertini, E. (2021). An Exploration and Validation of Visual Factors in Understanding Classification Rule Sets. Proceedings of IEEE InfoVis 2021. – Nov, O., Aphinyanaphongs, A., Lui Y., Mann D., Porfiri, M., Riedl, M., Rizzo, JR, and Wiesenfeld, B. (2021). The Transformation of Patient-Clinician Relationships with AI-Based Medical Advice: A “Bring Your Own Algorithm” Era in Healthcare. Communications of the ACM 64(3) 46-48. – Seals, A., Olaosebikan, M., Otiono, J., Shaer, O., and Nov, O. (2021). Effects of Self-Focused Augmented Reality on Health Perceptions During the COVID-19 Pandemic: A Between-Subject Web-Based Experiment. Journal of Medical Internet Research. – Chunara, R., Zhao, Y., Chen, J., Lawrence, K., Testa, P., Nov, O., and Mann, D. (2021). Telemedicine and Healthcare Disparities: A Cohort Study in a Large Healthcare System in New York City During COVID-19. Journal of the American Medical Informatics Association 28(1) 33-41. – Barak-Ventura, R., Ruiz Marin, M., Nov, O., Raghavan, P., and Porfiri, M. (2021). A Low-Cost Telerehabilitation Paradigm for Bimanual Training. IEEE/ASME Transactions on Mechatronics. – Nov, O., Dove, G., Balestra, M., Lawrence, K., Mann, D. and Wiesenfeld, B. (2021). Preferences and patterns of response to public health advice during the COVID-19 pandemic. Scientific Reports 11, 21700. – Poretski, L., Arazy, O., Lanir, J., and Nov, O. (2021). Who Owns What? Psychological Ownership in Shared Augmented Reality. International Journal of Human-Computer Studies. – Holland, J. G., Nakayama, S., Porfiri, M., Nov, O., and Bloch, G. (2021). Body size and behavioural plasticity interact to influence the performance of free-foraging bumble bee colonies. Insects 12, 236. – Dove, G., Balestra, M., Mann, D., and Nov, O. (2020). Good for the Many or Best for the Few? A Dilemma in the Design of Algorithmic Advice. Proceedings of the ACM on Human-Computer Interaction. 4,2 (CSCW). – Mann, D., Chen, J., Chunara, R., Testa, P., and Nov, O. (2020). COVID-19 Transforms Healthcare Through Telemedicine: Evidence From the Field. Journal of the American Medical Informatics Association 27(7) 1132–1135. – Caplin, A., Csaba, D., Leahy, J., and Nov, O. (2020). Rational Inattention, Competitive Supply, and Psychometrics. Quarterly Journal of Economics 135(3) 1681–1724. – Nakayama, S., Richmond, S., Nov, O. and Porfiri, M. (2020). The gold miner’s ",
  "content_length": 35847,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:05"
}