{
  "name": "Odest Chadwicke Jenkins",
  "homepage": "http://ohseejay.org",
  "status": "success",
  "content": "Chad Jenkins, Roboticist and Computer Scientist Chad Jenkins Skip To Main Navigation Skip To Main Content Main Print Heading Print Subheading Chad Jenkins Roboticist.Computer Scientist. Main Short Bio. Curr. Vita Publications Teaching Github Impact Contact Odest Chadwicke Jenkins, Ph.D. Professor of Robotics Professor of EECS (courtesy) University of Michigan 2505 Hayward St., Robotics 2236 Ann Arbor, MI 48109-2106 USA ocj a@t umich d@o@t edu (734) 764-4847 (voicemail) I am a Professor of Robotics and a Professor of Electrical Engineering and Computer Science at the University of Michigan. I am the leader of the Laboratory for Progress (Perceptive RObotics and Grounded REasoning SystemS). My work and collaborations aim to discover methods for computational reasoning and perception that will enable robots to effectively learn from and assist people in common human environments. Essentially, we explore how to make the real world programmable by regular people through the control of autonomous robots. Critical challenges towards this goal are enabling robots to perceive our world, understand the form and function of objects, reason under uncertainty, and learn from human users. This research pertains primarily to robot learning from demonstration, semantic perception, and mobile manipulation towards enabling the usability of this technology by people in real situations. Because science is exactly independently verifiable knowledge, open-source contributions and reproducibility are critical features of my work. My open-source approach to scholarship emphasizes a balance of theory and practice, a balance of research and teaching, and prioritization on equity and excellence. I am the founding Chair of the Michigan Robotics Undergraduate Program, where I led the creation of the Michigan Robotics Major. I served as inaugural Editor-in-Chief for the ACM Transactions on Human-Robot Interaction. I am currently a member of the ACM Council for the Association for Computing Machinery, a member of the Board of Trustees for the CNA Corporation and the Vice President for Educational Activities for the IEEE Robotics and Automation Society. This year, I am serving as a Program Chair for the AAAI-26 Conference. Projects over my career are highlighted in this robotics research video playlist. My active projects include Semantic Robot Programming for declarative robot programming from demonstration, taskable planning and control for bipedal humanoids and mobile manipulators, perceptual reasoning for goal-directed robotic manipulation, fast nonparametric belief propagation for manipulation in clutter and multi-robot coordination, independent living technologies for aging populations, and Distributed Teaching Collaboratives for open-source course development. Our IROS 2017 paper is an example of our previous efforts in manipulation and perception in cluttered scenes and highlighted in the following research video: My past projects include the rosbridge protocol and libraries for web/cloud robotics, perception of transparent and transluscent objects, robotic person following and gesture recognition, learning finite state machines from demonstration, physics-based tracking of human motion from video, markerless model and motion capture, inertial motion capture, balance control of simulated humanoids, and humanoid imitation learning. Publications A more-or-less complete listing of my publications is available from my profile on Google Scholar. Impact I aim to realize both equitable opportunity and technological excellence in robotics, AI, computing, and all areas of automated technologies. Robotics and computing technology is having an incredible impact on society. However, the wisdom needed for this impact to be positive and beneficial requires broader participation across society. Towards this end, I actively engage in activities to broaden participation in robotics and computing along many dimensions, including improving engagement with students from underrepesented groups. A popular spinout from my talk at National Geographic in 2013 was the following collaborative TED presentation with Henry Evans that goes into more detail about web robotics and remote presence for people with disabilities (which I guess is everyone): I have co-authored opinion articles on the role of robotics and automation in society: O. Jenkins, A. Peseri, Automation, Not Domination: How Robots Will Take Over Our World, Footnote, 2013. O. Jenkins, Before we put $100 billion into AI …, VentureBeat, 2020. An overview of my research and perspective on relationship between the nature of work and robotics was presented at the Robotics: Science and Systems Conference in 2018: Teaching Winter 2025: Michigan Robotics 320 Robot Operating Systems Winter 2025: Michigan Robotics 380 / Robotics 511 / EECS 367 Mobile Manipulation Systems Fall 2024: Michigan Robotics 102 Introduction to AI and Programming Winter 2024: Michigan Robotics 320 Robot Operating Systems Winter 2024: Michigan Robotics 380 / Robotics 511 / EECS 367 Mobile Manipulation Systems Fall 2023: Michigan Robotics 102 Introduction to AI and Programming Winter 2023: Michigan Robotics 498/599 Deep Learning for Robot Perception Winter 2023: Michigan Robotics 320 / Robotics 511 / EECS 367 Robot Operating Systems Fall 2022: Michigan Robotics 102 Introduction to AI and Programming Fall 2021: Michigan Robotics 102 Introduction to AI and Programming Winter 2021: Michigan EECS 467 Autonomous Robotics (Remote) Laboratory Fall 2020: Michigan EECS 367 Introduction to Autonomous Robotics Fall 2020: Michigan Robotics 511 Robot Operating Systems Winter 2020: Michigan EECS 467 Autonomous Robotics (Remote) Laboratory Fall 2019: Michigan EECS 367 Introduction to Autonomous Robotics Fall 2019: Michigan ME/EECS 567 | ROB 510 Robot Kinematics and Dynamics Winter 2019: Michigan EECS 467 Autonomous Robotics Laboratory Fall 2018: Michigan EECS 398 Introduction to Autonomous Robotics Fall 2018: Michigan ME/EECS 567 | ROB 510 Robot Kinematics and Dynamics Fall 2017: Michigan EECS 398-001 Introduction to Autonomous Robotics Fall 2017: Michigan ME/EECS 567 Robot Kinematics and Dynamics Winter 2017: Michigan EECS 467 Autonomous Robotics Laboratory Fall 2016: Michigan ROB 550 Robotics Systems Laboratory Fall 2016: Michigan EECS 398-004 Introduction to Autonomous Robotics Fall 2016: Michigan EECS 598-009 Robot Modeling and Control Winter 2016: Michigan EECS 398-002 Introduction to Autonomous Robotics Winter 2016: Michigan EECS 598-010 Robot Modeling and Control Fall 2015: Michigan EECS 598-010 Interactive Robot Manipulators Spring 2014/5: Brown CS 148 Introduction to Autonomous Robotics Fall 2013/4: Brown CS 195E/2951P Human-Robot Interaction Seminar Fall 2004-11: Brown CS 148 Building Intelligent Robots Short Biography Odest Chadwicke Jenkins, Ph.D., is a Professor of Robotics and a Professor of Electrical Engineering and Computer Science at the University of Michigan. Professor Jenkins earned his B.S. in Computer Science and Mathematics at Alma College (1996), M.S. in Computer Science at Georgia Tech (1998), and Ph.D. in Computer Science at the University of Southern California (2003). He previously served on the faculty of Brown University in Computer Science (2004-15). His research addresses problems in robot learning from demonstration and human-robot interaction, primarily focused on dexterous mobile manipulation and robot perception. Professor Jenkins is currently serving as Vice President for Educational Activities for the IEEE Robotics and Automation Society. Professor Jenkins was the founding Program Chair of the Robotics Major Degree Program launched in 2022 for undergraduates at the University of Michigan. He was founding Editor-in-Chief for the ACM Transactions on Human-Robot Interaction. Professor Jenkins is a Fellow of the American Association for the Advancement of Science (AAAS) and Association for the Advancement of Artificial Intelligence (AAAI). Professor Jenkins is the recipient of the 2024 ACM/CMD-IT Richard A. Tapia Achievement Award for Scientific Scholarship, Civic Science, and Diversifying Computing. ©Copyright 2025 • All Rights Reserved • Odest Chadwicke Jenkins • Ann Arbor MI USA 48105 http://ocj.me Main Print Footer",
  "content_length": 8270,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:07"
}