{
  "name": "Odette Scharenborg",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/multimedia-computing/people/odette-scharenborg",
  "status": "success",
  "content": "Odette Scharenborg Zoeken Sluit zoek Odette Scharenborg Odette Scharenborg is a Full Professor of Inclusive Speech Communication and head of the Delft Inclusive Speech Communication (DISC) lab, which is part of the Multimedia Computing Group at Delft University of Technology, the Netherlands. Her research aims to develop inclusive speech technology, i.e. making speech technology available for everyone irrespective of how they speak or what language they speak. In her research, Odette considers technical aspects as well as ethical and societal aspects. She is interested in anything and everything speech, ranging from human to automatic speech processing. Highlights:2025: General Chair of Interspeech 2025, Rotterdam, the Netherlands.2025: Appointed Full Professor of Inclusive Speech Communication.2023-2025: President of the International Speech Communication Association (ISCA).2021-2023: Vice-President of the International Speech Communication Association (ISCA).2019-2023: (Senior) Associate Editor of IEEE Signal Processing Letters.2018-2023: Delft Technology Fellow, Delft University of Technology.2018-2021: IEEE Speech and Language Processing Technical Committee (subarea Speech Production and Perception).2028: IEEE senior member.2017: Co-led a 6-week Frederick Jelinek Memorial Summer Workshop (JSALT 2017) at Carnegie Mellon University.2017-2025: Board member of the International Speech Communication Association (ISCA).2013-2018: Vidi fellowship from NWO (the Netherlands Organisation for Scientific Research).2006-2010: Veni fellowship from NWO (the Netherlands Organisation for Scientific Research).2005-2006: Talent scholarship from NWO (the Netherlands Organisation for Scientific Research). Visit my website for details of my on-going activities and a full listing of my articles and (invited) lectures. Please send an e-mail to inquire about internships and BSc/MSc projects. Bence Mark Halpern, Siyuan Feng, Rob van Son, Michiel van den Brekel, Odette Scharenborg (2023), Automatic evaluation of spontaneous oral cancer speech using ratings from naive listeners, In Speech Communication Volume 149 p.84-97. Xinsheng Wang, Qicong Xie, Lei Xie, Jihua Zhu, Odette Scharenborg (2022), AnyoneNet: Synchronized Speech and Talking Head Generation for Arbitrary Persons, In IEEE Transactions on Multimedia p.1-12. Deel deze pagina: Facebook Linkedin Twitter Email WhatsApp Deel deze pagina Odette Scharenborg O.E.Scharenborg@tudelft.nl Faculty of Electrical Engineering, Mathematics and Computer ScienceIntelligent SystemsVan Mourik Broekmanweg 62628 XE DelftThe Netherlands linkedin",
  "content_length": 2604,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:07"
}