{
  "name": "Oguz 'Oz' Buruk",
  "homepage": "https://webpages.tuni.fi/gamification/members/oguz-turan-buruk",
  "status": "success",
  "content": "Gamification Group | Dr. Oğuz ‘Oz’ Buruk Oğuz ‘Oz’ Buruk Contact Information Email: oguz.buruk@tuni.fi Phone: +358504720177 Dr. Oğuz ‘Oz’ Buruk is an industrial product designer and completed his PhD in Interaction Design at Koç University – Arçelik Research Center for Creative Industries (KUAR). His work focused on creating novel interactive environments for gaming purposes. Specifically, he worked on topics such as gaming wearables or social touch in games. His research on these topics were published in high quality venues of HCI and Design such as CHI, DIS, Visual Communications and International Journal of Art and Design Education. He joined Gamification Group in June 2018. He currently manages the GArMEnt project which is funded by Business Finland for exploring the integration of wearables into mainstream gaming. Besides, he is also a Marie Skłodowska Curie Individual Fellowship Grant Holder with WEARTUAL project which focuses on creating design knowledge for extended reality wearables. Apart from his research activities Dr. Buruk also worked and still working on development of commercial mobile games. He has been in roles of project manager, visual designer and animator and game designer in these projects. Dr. Buruk’s research activities in Gamification Group focus on deployment of wearables and novel game design practices in VR and AR environments. Publications Ahmet Borutecene and Oğuz “Oz” Buruk. 2019. Otherworld: Ouija Board as a Source for Design. In Halfway to the Future 2019. Oğuz “Oz” Buruk, Katherine Isbister, and Theresa Jean Tanenbaum. 2019. A Design Framework for Playful Wearables. In International Conference on the Foundations of Digital Games, FDG ’19, 19. Oğuz Turan Buruk and Oğuzhan Özcan. 2018. Extracting Design Guidelines for Wearables and Movement in Tabletop Role-Playing Games via a Research Through Design Process. In The ACM 2018 CHI Conference on Human Factors in Computing Systems. (Honorable Mention) Selin İnsel, Oğuz Turan Buruk, Mehmet Cengiz Onbaşlı, and Oğuzhan Özcan. 2018. Snowflakes: A Design Speculation for a Modular Prototyping Tool for Rapidly Designing Smart Wearables. In The ACM 2018 CHI Conference on Human Factors in Computing Systems Extended Abstracts. Ceylan Beşevli, Merve Erkaya, Oğuz Turan Buruk, and Oğuzhan Özcan. 2018. Investigating the Effects of Legacy Bias: User elicited gestures from the end users perspective. In The ACM SIGCHI 2018 Conference on Designing Interactive Systems Companion. İdil Bostan, Oğuz Turan Buruk, Mert Canat, Mustafa Tezcan, Celalettin Yurdakul, Tilbe Göksun, and Oğuzhan Oguzhan Özcan. 2017. Hands as a Controller: User Preferences for Hand Specific On-Skin Gestures. In Proceedings of the 2017 ACM International Conference on Designing Interactive Systems Conference, 1123–1134. Oğuz Turan Buruk, İsmet Melih Özbeyli, and Oğuzhan Özcan. 2017. WEARPG : Movement-Based Tabletop Role-Playing Game with Arm-Worn Devices and an Augmented Die. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play – CHI PLAY ’17 Extended Abstracts, 639–646. Çağlar Genç, Oğuz Turan Buruk, Sejda İnal Yılmaz, Kemal Can, and Oğuzhan Özcan. 2017. Forming Visual Expressions with Augmented Fashion. Visual Communications16, 4: 427–440. Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Eran Tiza, Buğra Can Sefercik, Idil Bostan, Oğuz Turan Buruk, Tilbe Göksun, and Oğuzhan Özcan. 2016. Sensation: Measuring the Effects of a Human-to-Human Social Touch Based Controller on the Player Experience. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 3944–3955.",
  "content_length": 3626,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:11"
}