{
  "name": "Ohad Ben-Shahar",
  "homepage": "https://www.cs.bgu.ac.il/~ben-shahar",
  "status": "success",
  "content": "Ohad Ben-Shahar Website - Home Page Publications Students Lab Teaching Links Personal The Computational Vision Lab Department of Computer Science Faculty of Computer and Information Science School of Brain Sciences and Cognition The ABC Robotics Initiative The Data Science Research Center Homeland Security Institute Institute for Future Technologies Ben Gurion University of the Negev Curriculum Vitae I obtained my B.Sc. and M.Sc. in Computer Science from the Technion, Israel, and my M.Phil and Ph.D. in Computer Science and Computational Vision from Yale University, CT, USA. In October 2004 I joined Ben Gurion University, where I am a professor of Compuer Science, head of the School of Brain Sciences and Cognition, former chairperson (2017-2020) of the Department of Computer Science, and the founding director of the Interdisciplinary Computational Vision Laboratory. Although focusing on computational vision, my interests span all aspects of theoretical, experimental, and applied vision sciences, and their relationship to cognitive science as a whole. In particular, I am interested in: Theoretical Computational Vision Human Perception and Visual Psychophysics Visual Computational Neuroscience Animal Vision Biologically Inspired Robot Vision Applied Computer Vision for Robotics I am always looking for excellent graduate students to join my group. If any of the vision sciences catches your imagination and research is your passion, I will be happy to chat with you about the opportunities in the lab. Outstanding undergraduate students looking for a senior project or research internships are welcome also. E-mail: ben-shahar@cs.bgu.ac.il Phone: + 972 8 647 7868 Direct Fax: + 972 8 647 7975 Dep. Fax: + 972 8 647 7650 (ATT: Ohad Ben-Shahar) Address: Prof. Ohad Ben-Shahar Computer Science Dep. Ben-Gurion University P.O.Box. 653 Beer-Sheva, 84105 Israel Location: BGU Campus, Building 37, Office 114 iCVL Lab: BGU Campus, Building 37, Lab -103 (one floor below ground gloor) Directions: Please see department and university visitor information. July 2025 New research grant awarded by the Israel Science FOundation (ISF) O. Ben-Shahar, Can Fish Really Navigate a Maze? Unraveling Aquatic Spatial Intelligence. July 2025 New research grant awarded by the Israel Science Foundation (ISF) O. Ben-Shahar, A laboratory for animal visual navigation. June 2025 New work presented in the International Conference on Culture and Computing G. Elkin, O. I. Shahar, Y. Ohayon, N. Alali, and O. Ben-Shahar, Recognizing Artistic Style of Archaeological Image Fragments Using Deep Style Extrapolation . Jan 2025 New paper accepted for publication in the Vision Research R. Mairon and O. Ben-Shahar, The Polar Saccadic Flow Model:Re-modeling the Center Bias from Fixations to Saccades . Dec 2024 New work presented in the Conference on Neural Information Processing Systems (NeurIPS) as part of the RePAIR FET Open project, Re-assembling the past: The RePAIR dataset and benchmark for real world 2D and 3D puzzle solving . Copyright © 2011 by Ohad Ben-Shahar. All rights reserved. INTERIA Web Design & Development",
  "content_length": 3118,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:13"
}