{
  "name": "Oisin Mac Aodha",
  "homepage": "https://homepages.inf.ed.ac.uk/omacaod",
  "status": "success",
  "content": "Oisin Mac Aodha Oisin Mac Aodha My name is Oisin Mac Aodha (how to pronounce my name) and I am a Reader (aka Associate Professor) in Machine Learning in the School of Informatics at the University of Edinburgh (UoE). I was a Turing Fellow from 2021 to 2025, currently am an ELLIS Scholar, and a founder of the Turing interest group on biodiversity monitoring and forecasting. My current research interests are in the areas of computer vision and machine learning, with a specific emphasis on 3D understanding, human-in-the-loop methods, and AI for conservation and biodiversity monitoring. From 2016-2019 I was fortunate to be a postdoc in Prof. Pietro Perona's Computational Vision Lab at Caltech working with the Visipedia team. Previous to Caltech, I spent three great years (2013-2016) as a postdoc in the Department of Computer Science at University College London (UCL) with Prof. Gabriel Brostow and Prof. Kate Jones. There I worked on interactive machine learning, where our goal was to design algorithms to enable non-programming scientists to semi-automatically explore events of interest in vast quantities of audio and visual data. I did both my MSc (with Dr. Simon Prince) and PhD (with Prof. Gabriel Brostow) at UCL and have an undergraduate degree in electronic engineering from the University of Galway in Ireland. Before my PhD, I was a research assistant for one year in Prof. Marc Pollefeys' group at ETH Zurich. Email: oisin (dot) macaodha (at) ed.ac.uk Bsky: @oisinmacaodha Office: Informatics Forum 2.24A News Dec 2025: I'll be speaking at the following two workshops at NeurIPS 2025: Imageomics and AI for Non-Human Animal Communication. Oct 2025: I'm talking at the Probabilistic AI for Environmental Science workshop in Cambridge. Sep 2025: I'll be giving invited talks at the following events this month: Irish Machine Vision and Image Processing Conference, UK Plant Phenomics Conference, and LifeCLEF2025. Jun 2025: Recording of talk I gave on our species range estimation work can be found here. Feb 2025: I'll be an Area Chair for NeurIPS 2025. Jan 2025: Co-organising the FGVC12 workshop at CVPR 2025. Click here to read older news. Dec 2024: I'll be speaking at the BMVA Symposium on 3D Vision in London in Feb 2025. Dec 2024: I'll be an Area Chair for ICCV 2025. Nov 2024: I'll be speaking at the Advancing Medical Imaging - Integrating AI & Data Sharing workshop in Denmark. Sep 2024: I'll be an Area Chair for CVPR 2025. May 2024: I'll be speaking at the Tackling Climate Change with Machine Learning workshop at ICLR 2024. Mar 2024: I'll be an Area Chair for NeurIPS 2024. Jan 2024: Open postdoc position in 3D-aware representation learning. Apply here. Jan 2024: Co-organising FGVC11 workshop on June 18th at CVPR 2024. Oct 2023: I'll be an Area Chair for CVPR 2024 and ECCV 2024. Sep 2023: You can read about our collaboration with iNaturalist on improving computer vision here and here. Sep 2023: I'll be speaking at the Frontiers of Monocular 3D Perception workshop at ICCV 2023. Jul 2023: I'll be speaking at the 26th BMVA Computer Vision Summer School. Jun 2023: I'll be speaking at the 2nd Monocular Depth Estimation Challenge Workshop at CVPR 2023 on June 18th. May 2023: I'll be speaking at the Leveraging AI to Quantify Biodiversity and Ecosystem Change Workshop on May 18th. Jan 2023: Co-organising FGVC10 workshop at CVPR 2023. Jan 2023: I'll be an Area Chair for ICML 2023 and ICCV 2023. Jan 2023: I'll be speaking at the Monocular Depth Estimation Challenge Workshop on January 7th. Dec 2022: I'll be speaking at the Workshop on Challenges of Fine-Grained Image Analysis on December 5th. Nov 2022: We have just launched our Turing Interest Group on Biodiversity Monitoring and Forecasting. Oct 2022: I'll be an Area Chair for CVPR 2023. Jun 2022: I'll be speaking at the 25th BMVA Computer Vision Summer School in July and the CV4Ecology Summer School in August. Apr 2022: I'll be an Area Chair for NeurIPS 2022. Mar 2022: Open postdoc position in AI for biodiversity monitoring at the University of Edinburgh. More info here. Feb 2022: I'll be an Area Chair for ECCV 2022. Jan 2022: Co-organising FGVC9 workshop at CVPR 2022. Dec 2021: Open postdoc in position human-in-the-loop AI at the University of Edinburgh. More info here. Sep 2021: Selected as a Turing Fellow and ELLIS Scholar. May 2021: I'll be an Area Chair for BMVC 2021. Mar 2021: FGVC8 will be held on June 25th 2021. More info here. Mar 2021: I'll be an Area Chair for NeurIPS 2021. Dec 2020: Co-organising FGVC8 workshop at CVPR 2021. Sep 2020: I'll be an Area Chair for ICLR 2021. Aug 2020: I'll be a Senior Program Committee Member for AAAI 2021. Jul 2020: Presenting at the AI for Social Good workshop. Video of the talk is here. Jul 2020: Giving a talk at the Optimizing Human Learning workshop. Video of the talk is here. Jun 2020: You can find the videos of the talks from our FGVC7 workshop here. May 2020: I'll be an Area Chair for NeurIPS 2020. Mar 2020: Serving as a Program Chair for BMVC 2020. Consider submitting! Dec 2019: Co-organising FGVC7 workshop at CVPR 2020. Nov 2019: Vacancies: Several openings for PhD students - see here for more details. Oct 2019: Just started as a Lecturer (aka Assistant Professor) in Machine Learning at the University of Edinburgh. Jul 2019: Serving on the Program Committee for Workshop on Computer Vision for Wildlife Conservation at ICCV 2019. Consider submitting your papers! Jun 2019: Serving as an Area Chair for WACV 2020. May 2019: Code released for our Monodepth2 paper. Apr 2019: FGVC6 competitions now live on Kaggle. Jan 2019: Co-organising FGVC6 workshop at CVPR 2019. Sep 2018: Serving as an Area Chair for ACCV 2018. Jul 2018: Check out Niantic's occlusion demo using our monocular depth work. Jun 2018: FGVC5 held at CVPR 2018. Feb 2018: Launched iNaturalist 2018 challenge. Jan 2018: Gave a talk to LA school children about the importance of bats. Jan 2018: Co-organising FGVC5 workshop at CVPR 2018. Aug 2017: Read about the iNaturalist Challenge 2017 that we ran in conjunction with Caltech, iNaturalist, Cornell, Google, and Kaggle. Jul 2017: Helped organize the Fourth Fine-Grained Visual Categorization workshop at CPVR this summer. Jul 2017: Read about our monocular depth estimation project at UCL and The Engineer. Jun 2017: Live deployment of our bat detection system in the former Olympic Park in London. Read about it on the BBC or follow our twitter page to get daily updates. Sep 2016: Interviewed by SVT for our work on using machine learning to detect bats. Aug 2016: Read about our handwriting synthesis project at the BBC, UCL, Engadget, Reuters, Gizmodo, and The Irish Times. Jul 2016: Moved to Caltech to do a postdoc. Mar 2016: Gave a talk about Bat Detective at UCL's Grant Museum. Apr 2015: Blog about bat call detection over at Methods in Ecology and Evolution. Selected Publications More details on Google Scholar. MotionPhysics: Learnable Motion Distillation for Text-Guided Simulation Miaowei Wang, Jakub Zadrożny, Oisin Mac Aodha, and Amir Vaxman AAAI 2026 [coming soon] INQUIRE-Search: A Framework for Interactive Discovery in Large-Scale Biodiversity Databases Edward Vendrow, Julia Chae, Rupa Kurinchi-Vendhan, Isaac Eckert, Jazlynn Hall, Marta Jarzyna, Reymond Miyajima, Ruth Oliver, Laura Pollock, Lauren Schrack, Scott Yanco, Oisin Mac Aodha, and Sara Beery arXiv 2025 [paper] View-Consistent Diffusion Representations for 3D-Consistent Video Generation Duolikun Danier, Ge Gao, Steven McDonagh, Changjian Li, Hakan Bilen, and Oisin Mac Aodha arXiv 2025 [paper] [webpage] CleverBirds: A Multiple-Choice Benchmark for Fine-grained Human Knowledge Tracing Leonie Bossemeyer, Samuel Heinrich, Grant Van Horn, and Oisin Mac Aodha NeurIPS 2025 Datasets and Benchmarks Track [paper] [webpage] [code] The Automated LLM Speedrunning Benchmark: Reproducing NanoGPT Improvements Bingchen Zhao, Despoina Magka, Minqi Jiang, Xian Li, Roberta Raileanu, Tatiana Shavrina, Jean-Christophe Gagnon-Audet, Kelvin Niu, ..., Alexander Miller, Oisin Mac Aodha, Jakob Foerster, and Yoram Bachrach NeurIPS 2025 Datasets and Benchmarks Track [preprint] Jamais Vu: Exposing the Generalization Gap in Supervised Semantic Correspondence Octave Mariotti, Zhipeng Du, Yash Bhalgat, Oisin Mac Aodha, and Hakan Bilen NeurIPS 2025 [preprint] Representational Difference Explanations Neehar Kondapaneni, Oisin Mac Aodha, and Pietro Perona NeurIPS 2025 [paper] [webpage] [code] Enhancing Tactile-based Reinforcement Learning for Robotic Control Elle Miller, Trevor McInroe, David Abel, Oisin Mac Aodha, and Sethu Vijayakumar NeurIPS 2025 [paper] [webpage] Sample-efficient Integration of New Modalities into Large Language Models Osman Batur İnce, André F. T. Martins, Oisin Mac Aodha, and Edoardo Ponti arXiv 2025 [preprint] [code] Interpretable Text-Guided Image Clustering via Iterative Search Bingchen Zhao and Oisin Mac Aodha BMVC 2025 [paper] WildSAT: Learning Satellite Image Representations from Wildlife Observations Rangel Daroya, Elijah Cole, Oisin Mac Aodha, Grant Van Horn, and Subhransu Maji ICCV 2025 [paper] [code] Feedforward Few-shot Species Range Estimation Christian Lange, Max Hamilton, Elijah Cole, Alexander Shepard, Samuel Heinrich, Angela Zhu, Subhransu Maji, Grant Van Horn, and Oisin Mac Aodha ICML 2025 [paper] [code] VesselSDF: Distance Field Priors for Vascular Network Reconstruction Salvatore Esposito, Daniel Rebain, Arno Onken, Changjian Li, and Oisin Mac Aodha MICCAI 2025 [preprint] DepthCues: Evaluating Monocular Depth Perception in Large Vision Models Duolikun Danier, Mehmet Aygün, Changjian Li, Hakan Bilen, and Oisin Mac Aodha CVPR 2025 [paper] [code] [webpage] CrossSDF: 3D Reconstruction of Thin Structures From Cross-Sections Thomas Walker, Salvatore Esposito, Daniel Rebain, Amir Vaxman, Arno Onken, Changjian Li, and Oisin Mac Aodha CVPR 2025 [paper] [webpage] MVSAnywhere: Zero Shot Multi-View Stereo Sergio Izquierdo, Mohamed Sayed, Michael Firman, Guillermo Garcia-Herna",
  "content_length": 23362,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:13"
}