{
  "name": "Okko Johannes Räsänen",
  "homepage": "https://researchportal.tuni.fi/en/persons/okko-r%C3%A4s%C3%A4nen",
  "status": "success",
  "content": "Okko Räsänen - Tampere University Research Portal View Scopus Profile Okko Räsänen Professor, Computing Sciences https://orcid.org/0000-0002-0537-0946 20192025 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Okko Räsänen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Annotation Computer Science 100% Child-centered Keyphrases 81% Audio Recording Computer Science 68% Information Retrieval Computer Science 64% speech corpus Computer Science 63% Learning System Computer Science 51% Phoneme Keyphrases 50% Speech Representation Keyphrases 48% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2019 2021 2023 2024 2025 2025 28 Article 25 Conference contribution 3 Abstract 2 Poster 1 More 1 Other conference contribution Research output per year Research output per year A model of early word acquisition based on realistic-scale audiovisual naming eventsKhorrami, K. & Räsänen, O., Feb 2025, In: Speech Communication. 167, 103169.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Word Acquisition 100% Sensory Input 100% Word Learning 100% Word Perception 50% Vocabulary Growth 25% 2 Citations (Scopus) 13 Downloads (Pure) A pipeline for stochastic and controlled generation of realistic language input for simulating infant language acquisitionRäsänen, O. & Kocharov, D., 2025, In: BEHAVIOR RESEARCH METHODS. 57, 10, 275.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Controlled Generation 100% Naturalistic Input 66% Proof 66% Controlled Language 33% Powerful Learning 33% 1 Downloads (Pure) Automatic Classification of Strain in the Singing Voice Using Machine LearningLiu, Y., Kiran Reddy, M., Yagnavajjula, M. K., Räsänen, O., Alku, P., Ikävalko, T., Hakanpää, T., Öyry, A. & Laukkanen, A.-M., 2025, (E-pub ahead of print) In: Journal of Voice.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile 1 Citation (Scopus) 16 Downloads (Pure) FinnAffect: An Affective Speech Corpus for Spontaneous FinnishLahtinen, K., Mustanoja, L. & Räsänen, O., Nov 2025, In: Speech Communication. 175, 103327.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Regression Model 100% Arousal Classification 25% WavLM 25% Valence Classification 25% Spontaneous Speech Corpus 25% 1 Downloads (Pure) IAR 2.0: An Algorithm for Refining Inconsistent Annotations for Time-Series Data Using Discriminative ClassifiersVaaras, E., Airaksinen, M. & Räsänen, O., 2025, In: IEEE Access. 13, p. 19979-19995 17 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Annotation Refinement 100% Discriminative Classifier 100% Iterative Annotation 100% Time Series 100% State of the Art 33% 16 Downloads (Pure) View all 59 research outputs Datasets Models and activations for \"Can phones, syllables, and words emerge as side-products of cross-situational audiovisual learning? - A computational investigation\"Khorrami, K. (Creator) & Räsänen, O. (Creator), Zenodo, 26 Feb 2021DOI: 10.5281/zenodo.4564284Dataset Realistic-Scale Speech and Audiovisual Naming Events to Study Language Development in InfantsKhorrami, K. (Creator) & Räsänen, O. (Creator), Zenodo, 20 Dec 2024DOI: 10.5281/zenodo.14534108Dataset Activities Activities per year 2019 2019 2023 2023 2 Hosting a visitor 1 Supervisor of doctoral candidate Activities per year Socially-Aware Machine PerceptionVirtanen, T. (Examiner), Hirvonen, M. (Examiner) & Räsänen, O. (Examiner)2023 → …Activity: Evaluation, examination and supervision › Supervisor of doctoral candidate Heikki RasiloRäsänen, O. (Host)12 Aug 2019 → 16 Aug 2019Activity: Hosting a visitor Herman KamperRäsänen, O. (Host)18 May 2019 → 24 May 2019Activity: Hosting a visitor",
  "content_length": 4546,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:15"
}