{
  "name": "Oksana Kulyk",
  "homepage": "https://pure.itu.dk/portal/en/persons/oksana-kulyk(1dbd1112-eb47-4406-936c-6807e8845610).html",
  "status": "success",
  "content": "Oksana Kulyk - IT-University of Copenhagen Oksana Kulyk Associate Professor, Theoretical Computer ScienceCenter for Information Security and Trust https://orcid.org/0000-0003-4218-1658 Emailokkuitudk 20192025 Research activity per year Personal profile KeywordsSecurityPrivacyElectronic votingHuman factorsUsability Fingerprint Dive into the research topics where Oksana Kulyk is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Cybersecurity Computer Science 100% Security and Privacy Computer Science 100% Manipulation Detection Keyphrases 88% Security Privacy Keyphrases 83% Internet Voting Keyphrases 83% Electronic Voting Keyphrases 77% Privacy Protection Computer Science 77% Perceived Trust Keyphrases 75% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2019 2022 2023 2025 27 Article in proceedings 4 Journal article 1 Report 1 Paper Research output per year Research output per year \"I tell him everything that I do\": An investigation of privacy and safety implications of AI companion usageHenriksen, A., Asadi, R., Gerdes, A., Kulyk, O. & Mayer, P., Jul 2025. 12 p.Research output: Contribution to conference - NOT published in proceeding or journal › Paper › Research › peer-review Cookie disclaimers: Dark patterns and lack of transparencyBerens, B., Bohlender, M., Dietmann, H., Krisam, C., Kulyk, O. & Volkamer, M., 2024, In: Computers & Security. 136Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Cookies 100% Lack of Transparency 100% Service Provider 100% Informed Consent 100% User Attitude 20% How to increase transparency and trust in internet voting systems: An experimental studyAgbesi, S., Budurushi, J., Dalela, A., Nissen, C. F. & Kulyk, O., 2024, Proceedings of the 13th Nordic Conference on Human-Computer Interaction. Association for Computing MachineryResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Verifiability 100% Technical Documentation 50% Primary Barrier 25% Perceived Transparency 25% Individual Dimension 25% Tracking Code-based Verification-Design and EvaluationNissen, C. F., Kulyk, O., Volkamer, M., Fredrich, L. E. & Hermansen, H., 2024, Proceedings of the Ninth International Joint Conference on Electronic Voting (E-Vote-ID 2024). Gesellschaft für Informatik, 16 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Code-based 100% security level 100% Cryptographic Mechanism 100% Internet Voting 25% Verifiability 25% Voting beyond borders: A pilot study investigating preferences and trade-offs in remote voting among the Albanian electorateBudurushi, J., Faraon, M., Agbesi, S., Kulyk, O. & Dalela, A., 2024, Proceedings of Ongoing Research, Practitioners, Posters, Workshops, and Projects of the International Conference EGOV-CeDEM-ePart 2024. CEUR Workshop Proceedings. 12 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Albanian 100% Electorate 100% Pilot Study 100% Voting System 100% Aviation Employees 100% View all 33 research outputs Projects Projects per year 2020 2020 2023 2027 2 Active 5 Finished Projects per year aDESSO: Towards demonstrating secure software development for small and medium enterprises in a business-to-business modelKulyk, O. (PI), Paja, E. (PI), Asadi, R. (CoI), Oppermann, N. (Admin) & Ibsen, P. (Admin)DigitalLead 15/09/2023 → 31/03/2024Project: Research Interactive Session 100% Social Proof 100% Large Corporations 100% Security Criteria 100% All-solution-processed 100% PrivacyNetwork: Cultivating A User-Centered Research Network on Managing Digital Security and Privacy from Cross-Cultural PerspectivesBarkhuus, L. (PI) & Kulyk, O. (CoI)Danish Agency for Higher Education and Science01/04/2020 → 01/08/2023Project: Research Cross-cultural Perspective 100% User Research 100% Digital Privacy 100% Security Privacy 100% Digital Security 100% UCORV: Designing usable coercion resistant Internet voting systemsKulyk, O. (PI), Schürmann, C. (CoI), Barkhuus, L. (CoI) & Nissen, C. F. (CoI)Independent Research Fund Denmark01/07/2023 → 30/06/2027Project: Research Coercion 100% Voting System 100% Internet Voting 100% Security and Privacy 100% Cryptographic Protocol 100% ODC: Optimering af Danmarks CybernødberedskabKulyk, O. (PI)Nationalt Forsvarsteknologisk Center01/11/2024 → 31/10/2026Project: Research Hacker Group 100% Common Target 100% Civilian Harm 100% Communication Energy 100% Large-scale Attacks 100% COMET: Establishing and Communicating Trust in the Security of Election TechnologiesKulyk, O. (PI), Agbesi, S. (CoI), Budurushi, J. (CoI) & Dalela, A. (Collaborator)Villum Foundation01/01/2022 → 31/12/2023Project: Research Code-based 100% Cryptographic Mechanism 100% security level 100% Technical Documentation 50% Individual Dimension 25% View all 7 projects Press/Media Løbe-app gav overraskende indblik i konge og statsministers gøren og laden: En »banal fejl, der sagtens kunne være undgået«Kulyk, O.11/07/20251 Media contributionPress/Media: Press / Media - Man er virkelig sårbar dér hvor mennesker er involveretKulyk, O.12/05/2025 → 12/06/20253 Media contributionsPress/Media: Press / Media Falske phishingmails fra universitet møder kritik: »Ubehageligt spild af tid«Kulyk, O.22/10/20241 Media contributionPress/Media: Press / Media Russiske hackere har ændret taktik i UkraineKulyk, O.25/09/20241 Media contributionPress/Media: Press / Media Vi skal passe på tunnelsyn i sikringen af vores digitale infrastrukturSchürmann, C. & Kulyk, O.31/07/20241 Media contributionPress/Media: Press / Media View all 29 press/media Activities Activities per year 2019 2019 2023 2024 2024 5 Membership in review committee 2 Organisation and participation in conference 1 Organisation and participation in workshop, seminar, course Activities per year 14th International Conference on Availability, Reliability and Security (ARES 2019)Kulyk, O. (Member of Programme Committee)2019Activity: Participating in or organising an event types › Organisation and participation in conference Hiring committee for assistant/associate Professorships in Algorithms (Event)Sestoft, P. (Chair), Kulyk, O. (Member) & Jacob, R. (Member)2 May 2024 → 1 Sept 2024Activity: Membership types › Membership in review committee Hiring committee for recruitment of assistant/associate professorships in Natural Language Processing (Event)Sestoft, P. (Chair), Hardmeier, C. (Member) & Kulyk, O. (Member)26 Nov 2023 → 1 Mar 2024Activity: Membership types › Membership in review committee Hiring committee for recruitment of assistant professor in therapeutic and affective robotics (Event)Sestoft, P. (Chair), Støy, K. (Member) & Kulyk, O. (Member)12 Mar 2024 → 1 May 2024Activity: Membership types › Membership in review committee Hiring committee for recruitment of associate professor in Data Science and Machine Learning (Event)Sestoft, P. (Chair), Kulyk, O. (Member) & Hansen, D. W. (Member)5 Jul 2023 → 1 Dec 2023Activity: Membership types › Membership in review committee View all 8 activities",
  "content_length": 7668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:16"
}