{
  "name": "Ola Svensson",
  "homepage": "http://theory.epfl.ch/osven",
  "status": "success",
  "content": "Ola Svensson Ola Svensson I am an Associate Professor active in the theory group at the School of Computer and Communication Sciences, EPFL. My research interests include approximation algorithms, combinatorial optimization, computational complexity and scheduling. I am grateful to the generous support from the ERC Starting Grant \"OptApprox\" (2014-2019), from the SNF grant \"Randomness in Problem Instances and Randomized Algorithms\" (2019 - 2023), and from the ERC Consolidator Grant \"POTCO\" (2023-). Phone +41 21 693 1204 Fax +41 21 693 7510 E-mail firstname.lastname at epfl dot ch Address EPFL-IC Building INJ (INJ112) Station 14 CH-1015 Lausanne Switzerland Visiting address Office INJ112 Supervision I have (and had) the pleasure to advice and learn from the following PhD students: Christos Kalaitzis (2012 - 2016, now postdoc at ETHZ) Abbas Bazzi (2013 - 2017, now at Google Zürich) Ashkan Norouzi-Fard (2013 - 2018, now at Google Zürich) Jakub Tarnawski (2014 - 2019, now at MSR) Buddhima Gamlath (2016 - ) Paritosh Garg (2017 - 2022, coadvised with Michael Kapralov, joined startup) Etienne Bamas (2019 - 2023, postdoc at ETHZ) Xinrui Jia (2019 - 2023, joined startup) Andreas Maggiori (2019 - 2023 , coadvised with Ruediger Urbanke, postdoc at Columbia University) Marina Drygala (2021 - ) Yuan Weiqiang (2022- , coadvised with Mika Goos) Radu Vintan (2023 - ) Miltos Stouras (2023 - ) Lukas Vogl (2023 - , coadvised with Friedrich Eisenbrand) Teaching I am very proud to have received the I&C teaching award. Semester projects For available semester projects for EPFL students, please contact me directly be sending an email. Courses I teach (taught) Advanced Algorithms, Algorithms, Topics in Theoretical Computer Science., Computational Complexity, and Approximation Algorithms and Hardness of Approximation. Previously at KTH, I was responsible for the graduate course Approximation Algorithms and I taught some of the lectures in Johan Håstad's postgraduate course Theoreticians toolkit. Publications This is not updated very regularly. For a more up-to-date list, see DBLP. Journal Papers Sara Ahmadian, Ashkan Norouzi-Fard, Ola Svensson, and Justin Ward: Better Guarantees for k-Means and Euclidean k-Median by Primal-Dual Algorithms Journal version in SIAM Journal on Computing 49(4), 2020. Abbas Bazzi, Samuel Fiorini, Sebastian Pokutta, and Ola Svensson: No Small Linear Program Approximates Vertex Cover Within a Factor 2 - epsilon Journal version in Math. Oper. Res. 44(1), 147-172, 2019. Moran Feldman, Ola Svensson, and Rico Zenklusen: A Simple O(log log(rank))-Competitive Algorithm for the Matroid Secretary Problem Journal version in Math. Oper. Res. 43(2), 638-650, 2018. Ola Svensson, Jakub Tarnawski, and László A. Végh: Constant factor approximation for ATSP with two edge weights Journal version in Math. Program. 172(1-2), 371-397, 2018. Abbas Bazzi, Samuel Fiorini, Sangxia Huang, and Ola Svensson: Small Extended Formulation for Knapsack Cover Inequalities from Monotone Circuits Journal version in Theory of Computing 14(1), 1-29, 2018. Teklemariam Tsegay Tesfay, Jean-Yves Le Boudec, and Ola Svensson: Optimal Software Patching Plan for PMUs Journal version in IEEE Trans. Smart Grid 9(6), 6500-6510, 2018. Hyung-Chan An, Mohit Singh, and Ola Svensson: LP-Based Algorithms for Capacitated Facility Location Journal version in SIAM Journal on Computing 46(1), 272-306, 2017. Hyung-Chan An, Ashkan Norouzi-Fard, and Ola Svensson: Dynamic Facility Location via Exponential Clocks Journal version in ACM Transactions on Algorihms 13(2), 21:1- 21:20, 2017. Chidambaram Annamalai, Christos Kalaitzis, and Ola Svensson: Combinatorial Algorithm for Restricted Max-Min Fair Allocation Journal version in in ACM Transactions on Algorihms 13(3), 37:1- 37:28, 2017. Tobias Mömke and Ola Svensson: Removing and Adding Edges for the Traveling Salesman Problem. Journal version in the Journal of the ACM 63(1), 2:1-2:28, 2016. Shi Li and Ola Svensson: Approximating k-median via Pseudo-Approximation. Journal version in SIAM Journal on Computing 45(2), 530-547, 2016. Lukas Polacek, Ola Svensson: Quasi-Polynomial Local Search for Restricted Max-Min Fair Allocation. Journal version in ACM Transactions on Algorihms 12(2), 13:1- 13:13, 2016. Ola Svensson: Hardness of Vertex Deletion and Project Scheduling. Journal version in Transactions on Computation Theory 9(24):759-781. Monaldo Mastrolilli, Nikolaus Mutsanas, and Ola Svensson: Single machine scheduling with scenarios. Journal version in Theoretical Computer Science 477:57-66, 2013. Ola Svensson: Santa Claus Schedules Jobs on Unrelated Machines. Journal version in SIAM Journal on Computing 41(5):1318-1341, 2012 Florian Diedrich, Klaus Jansen, Lars Prädel, Ulrich M. Schwarz, Ola Svensson: Tight Approximation Algorithms for Scheduling with Fixed Jobs and Non-Availability. Journal version in ACM Transactions on Algorithms 8(3):27, 2012. Mahdi Cheraghchi, Johan Håstad, Marcus Isaksson, Ola Svensson: Approximating Linear Threshold Predicates. Journal version in Transactions on Computation Theory 4(1):2, 2012. Monaldo Mastrolilli, Ola Svensson: Hardness of Approximating Flow and Job Shop Scheduling Problems. Journal version in the Journal of the ACM 58(5): 20:1-20:32, 2011. Ola Svensson: Hardness of Precedence Constrained Scheduling on Identical Machines. Journal version in SIAM J. Comput. 40(5): 1258-1274, 2011. Christoph Ambühl, Monaldo Mastrolilli, Ola Svensson: Inapproximability Results for Maximum Edge Biclique, Minimum Linear Arrangement, and Sparsest Cut Journal version in SIAM J. Comput. 40(2): 567-596, 2011. Christoph Ambühl, Monaldo Mastrolilli, Nikos Mutsanas, Ola Svensson: On the Approximability of Single Machine Scheduling with Precedence Constraints. Mathematics of Operations Research 36(4): 653-669, 2011. Monaldo Mastrolilli, Maurice Queyranne, Andreas S. Schulz, Ola Svensson, Nelson A. Uhan: Minimizing the sum of weighted completion times in a concurrent open shop. Journal version in Oper. Res. Lett. 38(5): 390-395, 2010. Conference Papers Hendrik Fichtenberger, Silvio Lattanzi, Ashkan Norouzi-Fard, Ola Svensson: Consistent k-Clustering for General Metrics. In SODA 2021 Available as arXiv report 2011.06888. Etienne Bamas, Andreas Maggiori, Ola Svensson: The Primal-Dual method for Learning Augmented Algorithms. In NeurIPS 2020, Oral presentation Available as arXiv report 2010.11632. Etienne Bamas, Andreas Maggiori, Lars Rohwedder, Ola Svensson: Learning Augmented Energy Minimization via Speed Scaling. In NeurIPS 2020, Spotlight presentation Available as arXiv report 2010.11629. Vincent Cohen-Addad, Silvio Lattanzi, Ashkan Norouzi-Fard, Christian Sohler, Ola Svensson: Fast and Accurate k-means++ via Rejection Sampling. In NeurIPS 2020 Available here. Moran Feldman, Ashkan Norouzi-Fard, Ola Svensson, Rico Zenklusen: The one-way communication complexity of submodular maximization with applications to streaming and robustness. In STOC 2020 Available as arXiv report 2003.13459. Xinrui Jia, Kshiteej Sheth, Ola Svensson: Fair Colorful k-Center Clustering. In IPCO 2020 Available as arXiv report 2007.04059. Paritosh Garg, Sagar Kale, Lars Rohwedder, and Ola Svensson: Robust Algorithms Under Adversarial Injections. In ICALP 2020 Available as arXiv report 2004.12667. Nikhil Bansal, Ola Svensson, Luca Trevisan: New Notions and Constructions of Sparsification for Graphs and Hypergraphs. In FOCS 2019. Available as arXiv report 1905.01495. Buddhima Gamlath, Michael Kapralov, Andreas Maggiori, Ola Svensson, David Wajc: Online Matching with General Arrivals. In FOCS 2019. Available as arXiv report 1904.08255. Buddhima Gamlath, Sagar Kale, Slobodan Mitrovic, Ola Svensson: Weighted Matchings via Unweighted Augmentations. In PODC 2019. Available as arXiv report 1811.02760. Buddhima Gamlath, Sagar Kale, Ola Svensson: Beating Greedy for Stochastic Bipartite Matching. In SODA 2019. Ashkan Norouzi-Fard, Jakub Tarnawski, Boba Mitrovic, Amir Zandieh, Aida Mousavifar Mousavifar, Ola Svensson: Beyond 1/2-Approximation for Submodular Maximization on Massive Data Streams. In ICML 2018. Buddhima Gamlath, Sangxia Huang, Ola Svensson: Semi-Supervised Algorithms for Approximately Optimal and Accurate Clustering. In ICALP 2018. Available as arXiv report 1803.00926. Ola Svensson, Jakub Tarnawski, Laszlo Vegh: A Constant-Factor Approximation Algorithm for the Asymmetric Traveling Salesman Problem Extended abstract in the 50th ACM Symposium on the Theory of Computing (STOC), 2018. Best paper award. Available as arXiv report 1708.04215. For a summary of the approach see the 10-page extended abstract. Moran Feldman, Ola Svensson, Rico Zenklusen: A Framework for the Secretary Problem on the Intersection of Matroids To appear in ACM-SIAM Symposium on Discrete Algorithms (SODA), 2018. Available as arXiv report 1704.02608 Ola Svensson, Jakub Tarnawski: The Matching Problem in General Graphs is in Quasi-NC Extended abstract in IEEE Symposium on Foundations of Computer Science (FOCS), 2017. Best paper award. Available as arXiv report 1704.01929 Sara Ahmadian, Ashkan Norouzi-Fard, Ola Svensson, Justin Ward: Better Guarantees for k-Means and Euclidean k-Median by Primal-Dual Algorithms. To appear in IEEE Symposium on Foundations of Computer Science (FOCS), 2017. Invited to SICOMP special issue. Available as arXiv report 1612.07925 Christos Kalaitzis, Ola Svensson, Jakub Tarnawski: Unrelated Machine Scheduling of Jobs with Uniform Smith Ratios . Extended abstract in ACM-SIAM Symposium on Discrete Algorithms (SODA), 2017. Available as arXiv report 1607.07631 Abbas Bazzi, Samuel Fiorini, Sangxia Huang, Ola Svensson: Small Extended Formulation for Knapsack Cover Inequalities from Monotone Circuits . Extended abstract in ACM-SIAM Symposium on Discrete Algorithms (SODA), 2017. Available as arXiv report 1609.03737 Aditya Bhaskara, Mehrdad Ghadiri, Vahab Mirrokni Ola Svensson: Linear Relaxations for Finding Diverse Elements in Metric Spaces . NIPS, 2016. N",
  "content_length": 17042,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:15"
}