{
  "name": "Oladapo Oyebode",
  "homepage": "https://www.dal.ca/faculty/computerscience/faculty-staff/Oladapo_Oyebode.html",
  "status": "success",
  "content": "Dr. Oladapo Oyebode - Faculty of Computer Science - Dalhousie University Support Dal Current Students Faculty & Staff Family & Friends Campuses Agricultural Campus (Truro) Halifax Campuses Directory Campus Maps myDal Dal Online Brightspace OpenDal myDal Directory Maps OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal Dalhousie University Study Admissions Campus Life Libraries Research and Innovation Alumni About Dal Faculty of Computer Science For Current Students For Faculty & Staff Home About Current Students Undergraduate Graduate Research News & Events Dr. Oladapo Oyebode Assistant Professor Connect with me My research cluster: Human-Computer Interaction, Visualization & Graphics My website Faculty of Computer Science Email: oladapo.oyebode@dal.ca Mailing Address: Location: Faculty of Computer Science Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada Research Topics: Human-Centred AI User Adaptive Systems Persuasive Technologies Dynamic User Modelling Intervention Design Digital Health Bio: Oladapo Oyebode is an Assistant Professor in the Faculty of Computer Science, Dalhousie University, Canada. He obtained his PhD and MSc degrees in Computer Science from Dalhousie University and Western University, Canada, respectively. His research intersects Human-Computer Interaction, Artificial Intelligence (AI), and Persuasive Computing to design, develop, and evaluate AI-driven, user-adaptive, and highly personalized technologies for social good across diverse domains including health and wellness. These technologies deliver evidence-based, highly personalized, and adaptive interventions in real-time while operationalizing appropriate behaviour change strategies to motivate, promote, and sustain desirable behaviours in individuals and groups. Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada inquiries@cs.dal.ca Contact the Faculty of Computer Science Campus Directory Campus Map Privacy Statement Terms of Use Media Centre Contact the Faculty of Computer Science Campus Directory Campus Map Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada 902-494-2093 inquiries@cs.dal.ca",
  "content_length": 2380,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:14"
}