{
  "name": "Olaf Wolkenhauer",
  "homepage": "https://www.sbi.uni-rostock.de/team/detail/prof-olaf-wolkenhauer",
  "status": "success",
  "content": "Prof. Olaf Wolkenhauer - SBI Rostock sbi@uni-rostock.de +49 381 498-7571 SBI – Department of Systems Biology and Bioinformatics Faculty of Computer Science and Electrical EngineeringUniversity of RostockUlmenstrasse 69 | 18057 RostockGermany  +49 381 498-7571  olaf.wolkenhauer@uni-rostock.de Prof. Olaf Wolkenhauer I am making sense out of data; Providing meaning to models. Research interestI am a data scientist, using mathematics and computational tools to make sense of data. My work focusses on understanding how the functioning of cellular systems emerges from the interactions between the system’s parts, and how these emergent properties of a system as a whole enable or constrain the behaviour of its parts. Despite technological advances, that allow us to identify and characterise cellular components, the principles by which cells and tissues realise their function, remain poorly understood. My approach combines data-driven modelling with model-driven experimentation, using a wide range of computational and mathematical tools, including machine learning, statistics, systems theory, and stochastic processes. The results of my work support basic biological and medical research. Profil auf Deutsch; Profile in English You can find me on Google Scolar too. Projects For a list of projects see > Research > Projects Academic background 2020 – 2024 Guest Professor, Leibniz Institute for Food Systems Biology, at the TU Munich 2017– to date Adjunct Professor, Chhattisgarh Swami Vivekanand Technical University, India 2005 Fellow of the Stellenbosch Institute for Advanced Study (STIAS), Stellenbosch, South Africa 2004 – to date Adjunct Professor, Dept. of Electrical Engineering and Computer Science, Case Western Reserve University, Cleveland, Ohio, USA 2003 – to date Full Professor (C4/W3), Dept. of Systems Biology & Bioinformatics, Faculty of Computer Science and Electrical Engineering, University of Rostock, Germany 2003 – 2006 Visiting Reader, School of Mathematics, The University of Manchester, UK 2002 – 2003 Senior Lecturer. Joint appointment between the Dept. of Biomolecular Sciences and the Dept. of Electrical Engineering, University of Manchester Institute of Science and Technology (UMIST), UK 1999 – 2000 Senior Research Fellow (by invitation), Faculty of Information Technology and Systems, Delft University of Technology, Netherlands 1997 – 2000 Lecturer, Lucas Varity Research Lectureship, Control Systems Centre, UMIST, Manchester, UK 1997 Ph.D. Dissertation title: Possibility Theory with Applications to Data Analysis. Control Systems Centre, University of Manchester Institute of Science and Technology (UMIST), UK 1994 – 1997 Research Associate, Control Systems Centre, UMIST, Manchester, UK 1993 Research Assistant, Institute of Biomedical Engineering, Medical Academy Carl Gustav Carus, Dresden, Germany 1993 – 1994 B.Eng. (hons) 1st School of Systems Engineering, University of Portsmouth, UK 1991 – 1993 Teacher, Stiftung für Berufliche Bildung, Hamburg 1989 – 1993 Dipl.Ing. (FH) Control Engineering, Dept of Electrical Engineering and Computer Science. University of Applied Sciences, Hamburg, Germany 1985 – 1988 Industrial apprentice, completed with distinction. AEG Systems Technology, Hamburg ServicesMy work involves various advisory functions to ministries, funding bodies, award committees and consultancy for companies. Over the years, I have coordinated several research consortia in the UK, Germany and for the European Commission. I am the member of scientific advisory boards for several systems biology institutes and initiatives across Europe. From 2026 to 2024, I was an elected member of the review panel Foundations of Medicine & Biology of the German Research Foundation (DFG). I am the founding editor of the first international journal in Systems Biology. I have written four books, including the research monograph “Possibility Theory with Applications to Data Analysis” (Wiley), the textbooks “Data Engineering” (Wiley) and “Stochastic Approaches for Systems Biology” (Springer). Another, more unusual book is an introductory conversation handbook for 'Plattdeutsch' (lower German) an old language that is spoken by only few people. I have edited other books, including a volume on “Systems Biology” (Portland Press), the Encyclopaedia of Systems Biology (Springer), a book on MicroRNA Cancer Regulation (Springer) and in 2016 a book on Systems Medicine (Springer). I am also the editor of the upcoming Encyclopaedia of Systems Medicine. Awards and Distinctions 2016– 2024 Elected member of the DFG review panel Foundations of Medicine and Biology, German Research Foundation (DFG) 2009 SPIE Pioneer Award 1994 IBM Computing Prize for best Final Year Project Teaching ExperienceMy teaching focusses on data analysis and mathematical modelling with applications in the life sciences, i.e., Bioinformatics, Systems Biology, Systems Medicine. We have more than 15 years of experience in teaching interdisciplinary courses at graduate level. Our students are coming from biology, medicine, physics, mathematics, engineering and computer science. Over the years, I have also enjoyed the organisation and teaching at various international summer and winter schools. I am also offering three seminars, through which I share my experience and try to support young scientists. The seminars have been booked by various Universities, doctoral training centres, graduate schools and research institutes. Productivity, Project and Time Management for ScientistsTo-Do lists, reminder apps, multiple calendars, meeting protocols, „zero-inbox“ strategies: A career goal for every one of us, should be, not to require project, time management strategies and productivity tools. Unfortunately, most of us have to handle multiple projects at work, and at home. The question is how to be most productive and effective? The seminar will help you getting more things done, avoid errors, focus on what’s important, including fulfilment, and have more effective project meetings.Effective Scientific CommunicationScientific data do not speak for themselves but require an argument to be accepted as facts. For facts to be trusted and results being accepted, we must communicate them effectively. Therefore, scientists are, to some extent, only as clever as others think they are. The communication of scientific results is therefore at least as important as their generation. In this course, we learn a strategy to effectively communicate research in paper abstracts, in grant applications, through websites as well as in oral and poster presentations. Our analysis reveals strategies to structure and formulate texts. These findings contribute to a more successful communication of the participant’s work and identify strategies for effective forms of writing.Successful writing of grant proposalsIn this seminar I would like to share my experience as an applicant and reviewer for DFG, BMBF and EU funding. Why? (i) Because I find it difficult to write successful proposals.  (ii) Because I was elected to the DFG Review panel on the Foundations of Medicine and Biology, rewarding the trust I have gained. (iii) Because as a young scientist I would have liked to receive help for this important part of my work. The seminar is therefore aimed at all those for whom writing applications for third-party funding is an opportunity to learn. My experiences are of course limited and not universally valid. For colleagues from the engineering and natural sciences, as well as medicine, however, one or the other valuable reference could be there. The format of the seminar is not a lecture, but a discussion with hopefully many questions of the participants. The most important experience in twenty years of reviewing is the observation that proposals for research projects is a form of science communication that has a number of similarities with other forms of communication (publications, posters, websites ...). I will present this structure of successful proposals and give concrete advice on how to submit them. Other Interests and ActivitiesPlattdeutsch is a second German, not a dialect but a language close to Frisia and English, that used to be spoken from the Netherlands to Poland and in the Baltic region. It is recognized as a minority language, with most speakers located in the costal areas in Germany and immigrant communities worldwide. Gedanken zu und auf Plattdeutsch Liggt de Tokumst vun de Kreeftbehanneln in de Mathematik? Podcast zur Systembiologie. Kreeftforschen mit Mathe un Computers, Quickborn, 114. Jahrgang, Heft 1, 2024, 36-43 An essay (in German) on my origins in northern Germany and a book (published with Quickborn, Hamburg) I have written in \"Plattdeutsch\" - a language of northern Germany, spoken by a tiny minority along the coasts of the north and baltic seas. See also this newspaper article for a description 'op platt' (Kieler Nachrichten, 16. November 2012). \"Auf der Suche nach Regeln und Ausnahmen\" an essay about the interaction of cells within a larger group of cells was published in the Laborjournal (in German) Interview for systembiologie.de (pdf) Interview for the Systems Medicine Web Hub (pdf) Interview for the BMBF (in German) (pdf) An autobiographical article describing my path from engineering to biomedicine (IET Systems Biology, 2014) Some \"philosophical\" musings on systems theory and systems biology can be found in an interview with The Reasoner, Vol. 5, Nr. 9, September 2011. A science policy briefing on Systems Biology for Medical Applications that I prepared for the European Science Foundation (see also Advancing systems biology for medical applications). In remembrance of Allan Muir. Collection of some of my favorite quotations, aphorisms and thoughts that have motivated and influenced my thinking. A review (pdf) of D. Ellerman: Adjoints and emergence: applications of a new theory of adjoint functors. Axiomathes (2007) 17:19-39. The Beauty of Mathematics - A Rough Sketch for ",
  "content_length": 13420,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:21"
}