{
  "name": "Olaf Landsiedel",
  "homepage": "https://www.ds.informatik.uni-kiel.de/en/people/olaf",
  "status": "success",
  "content": "Verteilte Systeme Wir betreiben - hauptsächlich datengetriebene - Systemforschung zu Vernetzten und Verteilten Systemen. Unsere besondere Leidenschaft gilt dem Internet der Dinge (IoT), Edge und Fog Computing, Edge AI, Resilient Systems, Smart Cities, Industrie 4.0.Die Vision unserer Arbeitsgruppe lautet: Eine widerstandsfähige, datengesteuerte Gesellschaft und eine nachhaltige Welt aus vernetzten, autonomen DingenUnsere Arbeit wird von drei Trends angetrieben: (1) Sensoren sind überall und geben nahezu in Echtzeit Einblicke in jeden Aspekt der Welt, (2) KI ist hier, um zu bleiben, (3) fast alles wird programmierbar, siehe RISE-Lab (auf Englisch). Wir lieben es, Systeme zu bauen und mit ihnen zu spielen (= Experimente durchzuführen und Abhandlungen darüber zu schreiben). Wir veröffentlichen unsere Ergebnisse als Open Source und evaluieren unsere Arbeit in groß angelegten Testumgebungen mit Hunderten von drahtlosen Knotenpunkten. Derzeit konzentriert sich die Gruppe auf die folgenden Bereiche: Dr.-Ing. Mohamed Hailmohamed.hail@informatik.uni-kiel.de+49 431 880-4480Hermann-Rodewald-Str. 324118 KielRaum: 507a (HRS 3) © Jason Leung, UnsplashResilient Internet of Things: Ausfallsichere drahtlose Netzwerke mit geringer Latenz in drahtlosen Netzwerken mit geringer Leistung.Drahtlose Netzwerke mit geringer Leistung: Bluetooth (BLE), ZigBee / 802.15.4, LoRa, 5G, 6G, 802.11, UWBEdge Computing: Datenverarbeitung in verteilten, heterogenen Umgebungen © Igor Omilaev, UnsplashEdge AI und TinyML: Inferenz für verteilte und ressourcenbeschränkte IoT-SystemeErkennung und Klassifizierung von eingebetteten Ereignissen: Zeitreihenvorhersage und Ereigniserkennung auf eingebetteten und begrenzten GerätenOn-device Learning: Training tiefer neuronaler Netze auf eingebetteten Geräten © Aaron Burden, UnsplashVerteiltes Rechnen im Internet of Things: Verteiltes Rechnen in dynamischen und ressourcenbeschränkten UmgebungenSchwarm autonomer Geräte: Koordination von Manövern in Schwärmen mit Methoden des verteilten RechnensKooperative Lokalisierung: Positionierung und Lokalisierung in dynamischen und mobilen Umgebungen © Shubham Dhage, UnsplashBlockchain und das Internet of Things: Offline-Transaktionen zwischen ressourcenbeschränkten IoT-Geräten für Blockchains. Software-Releases von Projekten, an denen wir beteiligt waren, werden auf GitHub veröffentlicht:GitHub DS-KielGitHub IoT Chalmers (older projects) Abschlussarbeiten Projekt: An INnovative, intelligent SYSTem for coastal water monitoring using artificial intelligence (INSYST)Rolle: PIJahr(e): 2023–2026 (3 Jahre)Summe: 325k Euro Projekt: DFG Forschungsgruppe: \"SOURCED – Process Mining on Distributed Event Sources.\"Rolle: PIJahr(e): 2023–2027 (4 Jahre)Summe: ca. 400k Euro Bundesministerium für Digitales und VerkehrProjekt: CAPTN Fördeareal II (DTW II)Rolle: Co-PISumme: 260k Euro Gesellschaft für Energie und Klimaschutz Schleswig-HolsteinProjekt: Intelligent Railway TechnologyRolle: PIJahr(e): 2023–2024Summe: 150k Euro Projekt: Intelligent Railway Technology (Track Access)Rolle: Co-PIJahr(e): 2023Summe: 140k Euro Bundesministerium für Wirtschaft und Klimaschutz (BMWK, ehem. BMWi)Projekt:Marispace-XRolle: Co-PIJahr(e): 2021-2024 (3 Jahre)Summe: 450k Euro für unsere Forschungsgruppe Bundesministerium für Digitales und VerkehrProjekt: CAPTN Förde 5GJahr(e): 2021–2024 (3 Jahre)Summe: 450k Euro für unsere Forschungsgruppe(4M Euro ges.) Projekt: DatencampusRolle: PIJahr(e): 2021 - 2024 (3 Jahre)Summe: ca. 230k Euro für unsere Forschungsgruppe (2M Euro ges.) Bundesministerium für Digitales und VerkehrProjekt: CAPTN FördearealRolle: Co-PIJahr(e): 2021–2023 (2 Jahre)Summe: 150k Euro für unsere Forschungsgruppe(6,1M Euro ges.) Projekt: MarData Forschungsprojekt (MarData 5), Teil der “Helmholtz School for Marine Data Science\" (auf Englisch)Rolle: Co-PIJahr(e): 2021-2024 (3 Jahre)Summe: 230k Euro Projekt: AI computing cluster (extension)Rolle: PIJahr(e): 2022Summe: 31k Euro Bundesministerium für GesundheitProjekt: Corona Wrist Band (Corona-Armband)Rolle: PIJahr(e): 2020-2021Summe: 100k Euro Gesellschaft für Energie und Klimaschutz Schleswig-HolsteinProjekt: EKSH-Vorstudie \"Digitalisierung der Energiewende auf der Quartiersebene - Vernetzung, Datenanalyze, Data Mining\"Rolle: PIJahr(e): 2020Summe: 18k Euro (2012-2018, Teilzeit 2019-2023)Schwedischer Forschungsrat (VR - Vetenskapsrådet), Stipendium für Forscher, ungefähr 10% Annahmequote, 2019-2023, ungefähr 4 MSEK (400k Euro), persönliches StipendiumReisekostenzuschuss zur Vinnova-Konferenz, 2017, 25 kSEK (2500 Euro)Schwedische Stiftung für strategische Forschung (SSF - Stiftelsen för Strategisk Forskning), Future Research Leader Grant, weniger als 10% Annahmequote, 2017-2021, 12 MSEK (1,2 Mio. Euro), persönliches Stipendium, läuft bis Oktober 2018Schwedischer Forschungsrat (VR - Vetenskapsrådet), Stipendium für Nachwuchsforscher, Annahmequote etwa 10%, 2015-2018, etwa 3,6 MSEK (360k Euro), persönliches StipendiumGöteborg Energi, Projektzuschuss, Magnus Almgren, Vincenzo Gulisano, Olaf Landsiedel, Marina Papatriantafilou (PI), 2015 - 2016, 1,4 MSEK (140k Euro)Schwedische Energieagentur (Energimyndigheten), Projektzuschuss, 2013 - 2016, 4,4 MSEK (440k Euro), PI und Hauptantragsteller, geteilter Zuschuss, mit Marina Papatriantafilou und Magnus AlmgrenGöteborg Energi, Projektzuschuss, Magnus Almgren, Marina Papatriantafilou (PI), 2013 - 2014, ich war Teil des Projekts, aber kein AntragstellerChalmers Internal Funds, mehrere Fonds von Chalmers für Seed-Projekte, PostDocs (AoA Transport, Cyber-Physical Chalmers), Seed-Finanzierung (AoA of Energy, E-Science), und Qualität der Lehre; hauptsächlich mit Marina Papatriantafilou, Magnus Almgren und Elad M. Schiller, mit insgesamt etwa 1,5 MSEK (150k Euro) seit 2012KaryOn, EU FP7, 2012 - 2014, ich war Teil des Projekts, aber kein Antragsteller.Startup Package als Assistenzprofessor, 2012 - 2016.Spenden von Texas Instruments (TI) und ARM von Hardware-Plattformen für Forschung und Lehre im Bereich des Internets der Dinge.Spenden und Unterstützung von der lokalen Industrie (Delphi, HiQ, XCube, ...) für Projekte zu autonomen Fahrzeugen, mit Christian Berger, 2013 - 2016. Die Dargestellung zeigt die Finanzierung der Arbeitsgruppe, seit Olaf Landsiedel 2012 als Assistenzprofessor zu Chalmers kam. Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 6843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:18"
}