{
  "name": "Olaf Schenk",
  "homepage": "http://search.usi.ch/people/9a52a2fdb8d3d26ec16fb1569b590909/Schenk-Olaf",
  "status": "success",
  "content": "Schenk, Olaf | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Olaf Schenk http://usi.to/ovv Biography Olaf Schenk is a professor at the Institute of Computing at the Faculty of Informatics at Universita della Svizzera italiana (USI), Switzerland. He serves as the director of the Institute of Computing and as the director for the Master in Computational Science. He is also an adjunct member of the Computer Systems Institute at USI. He graduated in Applied Mathematics from Karlsruhe Institute of Technology (KIT), Germany. He earned his PhD in 2001 from the Department of Information Technology and Electrical Engineering of ETH Zurich and a venia legendi from the Department of Mathematics and  Computer Science from the University of Basel in 2009.  He conducts research in applied algorithms, computing, and software tools for high-performance scientific computing. Olaf Schenk is an elected Fellow of the Society of Industrial and Applied Mathematics (SIAM), a senior member of the Institute for Electrical and Electronic Engineers (IEEE), and a senior member of the Association for Computing Machinery (ACM). He is an associate editor of ACM Transactions on Mathematical Software, an editorial board member of the SIAM Journal for Scientific Computing. He has been elected as the Program Director for the SIAM Activity Group on Supercomputing, as Vice Chair for the SIAM Activity Group on Supercomputing, and as the Chair for the SIAM Activity Group on Supercomputing. He regularly chairs international computer science conferences (e.g. ACM PASC, SIAM PP, IEEE CSE) or serves on various program committees of international computer science conferences. For example, he participated in over 60 technical program committees, including top-level computer science conferences such as the ACM/IEEE Conference on High Performance Computing, Networking, Storage and Analysis, the IEEE International Parallel Distributed Processing Symposium, and the IEEE International Conference on High Performance Computing.He is a co-winner of the SIAM Supercomputing Prize 2023, for the most outstanding paper in the field of parallel scientific and engineering computing published within the four calendar years preceding the award year. Previous awards include e.g. an IBM faculty award and two leadership computing awards from the U.S. Department of Energy. In the private sector, he holds the role of Founder & Director at Panua Technologies Sagl, a company based in Lugano that creates customized high-end software solutions for large-scale prediction, simulation, optimization, and graph analytics. Citations: https://scholar.google.ch/olaf.schenk (>8000 as of 2024). Research My research interests are centered around the topic of multicore and manycore algorithms for computational science simulations on emerging high-performance computing (HPC) architectures. To this end, the research connects several relevant subfields of computer science with the needs of computational science and HPC. Typically, I drive research towards extreme-scale simulations in computational algorithms, application software, programming, and software tools. Competence areas Computational Science and Engineering Computing Distributed Algorithms High performance computing Large Scale Graph Analysis Contact olaf.schenk@usi.ch tel +41 58 666 4850 East Campus, Sector D, Office D5.17 (Level P5) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Full Professor Computer Systems Institute (SYS) Institute of Computing (CI) Chair for SIAM Activity Group on Supercomputing, Master Program Co-Director MSc in Computational Science Links Website or personal page Social media Linkedin Attachments CV short version (en) CV (en) Publications list (en) Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 4490,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:19"
}