{
  "name": "Olaoluwa Adigun",
  "homepage": "https://www.oadigun.com",
  "status": "success",
  "content": "Olaoluwa Adigun | AI Researcher and Educator top of pageI am a postdoctoral researcher at the Signal and Image Processing Institute, University of Southern California, Los Angeles.Olaoluwa AdigunCurriculum VitaeAbout MeI am was a lecturer in the Department of Electrical and Computer Engineering at the University of Southern California, Los Angeles. I was also a postdoctoral researcher at the USC Signal and Image Processing Institute. My research focus is machine learning and nonlinear signal processing. I have taught graduate-level classes in probability theory, statistics, random processes, deep learning, and linear algebra and an undergraduate-level class in probability. I received the Best Paper Award for my work on Using Noise to Speed Up Video Classification with Recurrent Backpropagation from the 2017 IEEE-INNS International Joint Conference on Neural Networks. I also received the 2018 Jenny Wang Excellence in Teaching Assistant Award from the Viterbi School of Engineering, University of Southern California, Los Angeles.   PublicationsPUBLICATIONS O. Adigun, and B. Kosko, \"Training Deep Neural Classifiers with Soft Diamond Regularizers\",  23rd IEEE International Conference on Machine Learning and Applications (ICMLA), 2024. B. Kosko, and O. Adigun, \"Bidirectional Variational Autoencoders\", IEEE World Conference on Computational Intelligence (WCCI), 2024.[Paper] [Video] O. Adigun, and B. Kosko, \"Bidirectional Backpropagation Autoencoding Networks for Image Compression and Denoising\", 22nd IEEE International Conference on Machine Learning and Applications (ICMLA), IEEE, 2023. [Paper] O. Adigun, and B. Kosko.  \"Noise-boosted recurrent backpropagation\", Neurocomputing   (2023),  pp 126438. [Paper] O. Adigun, and B. Kosko.  \"Hidden Priors for Bayesian Bidirectional Backpropagation\", 2023  IEEE Conference on Systems, Man, and Cybernetics  (SMC), IEEE 2023.[Paper][Video] O. Adigun, and B. Kosko.  \"Deeper Bidirectional Neural Networks with Generalized Non-Vanishing Hidden Neurons\",  IEEE International  Conference on Machine Learning and Applications (ICMLA), IEEE 2022. [Paper] O. Adigun, P. Olsen, and R. Chandeer.  \"Location-Aware Super-Resolution for Satellite Data Fusion\", 2022  IEEE International Geoscience and Remote Sensing Symposium (IGARSS), IEEE 2022. [Paper] O. Adigun, and B. Kosko. \"Deeper neural network with non-vanishing logistic hidden units: NoVa vs. ReLU neurons\",  20th IEEE International Conference on Machine Learning and Applications (ICMLA). IEEE, 2021. [Paper] O. Adigun, and B. Kosko. \"Bidirectional backpropagation for high-capacity blocking networks.\",  20th IEEE International Conference on Machine Learning and Applications (ICMLA). IEEE, 2021. [Paper] O. Adigun, and B. Kosko. \"Bayesian Bidirectional Backpropagation Learning\". 2021 International Joint Conference on Neural Networks (IJCNN). IEEE-WCCI, 2021. [Paper][Video] O. Adigun, and B. Kosko. \"High Capacity Deep Neural Classifiers with Logistic Neurons and Random Coding.\" Proceedings of the 2020 International Joint Conference on Neural Networks (IJCNN), IEEE-WCCI. [Paper] [Video] J. Qijia, O. Adigun, H. Narasimhan, M. Milani Fard, and M. Gupta. \"Optimizing black-box metrics with adaptive surrogates.\" In International Conference on Machine Learning, pp. 4784-4793. PMLR, 2020. [Paper] O. Adigun, and B. Kosko. \"Noise-boosted bidirectional backpropagation and adversarial learning.\" Neural Networks, vol. 120, pp 9-31, 2019.  [Paper] O. Adigun, and B. Kosko. \"Bidirectional backpropagation.\" IEEE Transactions on Systems, Man, and Cybernetics: Systems,  2019. [Paper] O. Adigun, and B. Kosko.  \"Training generative adversarial networks with bidirectional backpropagation.\",  17th IEEE International Conference on Machine Learning and Applications (ICMLA),  pp. 1178-1185. IEEE, 2018. [Paper] O. Adigun, and B. Kosko. \"Using noise to speed up video classification with recurrent backpropagation.\", International Joint Conference on Neural Networks (IJCNN), pp. 108-115. IEEE, 2017. [Paper] [Best Paper Award] O. Adigun, and B. Kosko. \"Bidirectional representation and backpropagation learning.\" 2016 International Joint Conference on Advances in Big Data Analytics, pp. 3-9, 2016. [Paper] WORK EXPERIENCEWork Experience University of Southern California,  Los Angeles,  CA                                                                                          August 2022 - Present Adjunct Lecturer Courses:  Probability for Electrical and Computer Engineers  (EE 503) Preparatory Class for Ph.D. Screening Exam (EE 590) University of Southern California,  Los Angeles,  CA                                                                                                          2016 - 2022 Graduate Teaching Assistant Courses:  Introduction to Probability for Electrical Engineering and Computer Science  (EE 364) Neural Learning and Computational Intelligence (EE 500) Probability for Electrical and Computer Engineers (EE 503) Statistics and Data Analysis for Engineers (EE 517) Preparatory Class for Ph.D. Screening Exam (EE 590) Deep Learning for Engineers (EE 599) Microsoft Research,  Redmond,  WA.                                                                                                                                Summer  2020 Research Intern Topic: Improving the Temporal and Spatial Resolution of Satellite Images Google Research, Mountain View, CA.                                                                                                                              Summer  2019 Research Intern Topic: Training Machine Learning Models on Non-differentiable Metrics Amazon  Science,  Seattle, WA.                                                                                                                                           Summer  2018 Applied Scientist Intern Topic: Adaptive Machine Learning Models for Emerging Fraud Patterns Amazon  Science,  Seattle, WA.                                                                                                                                           Summer  2017 Applied Scientist Intern Topic: Adaptive Machine Learning Models for New Launchbottom of page",
  "content_length": 6174,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:17"
}