{
  "name": "Ole Lehrmann Madsen",
  "homepage": "https://pure.au.dk/portal/en/persons/ole-lehrmann-madsen(edbb51a2-ec05-4400-b3ce-24037bad9857).html",
  "status": "success",
  "content": "Ole Lehrmann Madsen - Aarhus University Public CV View Scopus Profile Ole Lehrmann Madsen Ph.d. Professor, Department of Computer Science https://orcid.org/0000-0001-7221-142X Phone+4520154451Emailole.l.madsencs.audk Åbogade 34, 5342, 2248200 Aarhus NDenmark 1976 …2024 Research activity per year Personal profile KeywordsDistributed software systemsObject-oriented programming lauguageObject-oriented software systemsObject-oriented analysis and designObject-oriented modellingObject-oriented programmingSoftware architectureSoftware Systems for pervasive computingSoftware development toolsVitual/abstract machines Fingerprint Dive into the research topics where Ole Lehrmann Madsen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Object-Oriented Languages Computer Science 100% Programming Language Computer Science 58% Object Orientation Computer Science 33% Object-oriented Programming Keyphrases 24% Subclasses Computer Science 20% Concurrency Computer Science 20% Object-oriented Languages Keyphrases 16% Structured Block Computer Science 11% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 1976 1976 1986 2007 2 Finished Projects per year The Mjølner ProjectMadsen, O. L. (PI)01/08/1986 → 01/08/1991Project: Research Development of the Beta LanguageMadsen, O. L. (PI)01/05/1976 → 01/08/2007Project: Research Research output Research output per year 1976 1977 1979 1980 1981 1983 1985 1987 1988 1990 1992 1993 1994 1996 1998 1999 2000 2001 2004 2018 2022 2023 2024 33 Article in proceedings 8 Book chapter 8 Journal article 5 Report 19 More 4 Book 4 Paper 4 Working paper 3 Conference article 1 Anthology 1 Conference abstract for conference 1 Net publication - Internet publication 1 Other contribution Research output per year Research output per year An introduction to object-oriented programming as modelingMadsen, O. L. & Møller-Pedersen, B., 30 Dec 2024Research output: Book/anthology/report › Book › Education Using Object-Sequence Diagrams for DebuggingMadsen, O. L., Jul 2023, DEBT 2023: Proceedings of the 1st ACM International Workshop on Future Debugging Techniques. Gonzalez Boix, E. & Scholliers, C. (eds.). New York: Association for Computing Machinery, p. 11-22 Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review What your mother forgot to tell you about modeling – and programmingMadsen, O. L. & Møller-Pedersen, B., 2023, 2023 ACM/IEEE International Conference on Model Driven Engineering Languages and Systems Companion (MODELS-C). IEEE, p. 200-210 11 p.Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Object Modeling 100% Object-Oriented Languages 100% Programming Languages 50% Object-oriented 50% Object-oriented Languages 50% 1 Citation (Scopus) Using supplementary properties to reduce the need for documentationMadsen, O. L. & Møller-Pedersen, B., Oct 2022, Leveraging Applications of Formal Methods, Verification and Validation. Software Engineering - 11th International Symposium, ISoLA 2022, Proceedings: Software Engineering. Margaria, T. & Steffen, B. (eds.). Springer, p. 35-59 25 p. (Lecture Notes in Computer Science; No. 13702, Vol. LNCS).Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Programming Language 100% Communicates 100% Global Variable 100% Computer Language 100% Subclasses 50% 2 Citations (Scopus) What Object-Oriented Programming Was Supposed to Be: Two Grumpy Old Guys’ Take on Object-Oriented Programming Madsen, O. L. & Møller-Pedersen, B., 29 Nov 2022, Onward! 2022 - Proceedings of the 2022 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software, co-located with SPLASH 2022: Proceedings of the 2022 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software. Association for Computing Machinery, p. 220–239 20 p.Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review 2 Citations (Scopus) View all 73 research outputs Activities Activities per year 1988 1988 1992 2000 2002 2003 2005 2006 2007 2008 2009 2013 2014 2018 2018 8 Member of committee, council or board 3 Member of research network 2 Member of board or management of company or organisation 1 Participation in or organisation af a conference 1 More 1 Lecture and oral contribution Activities per year International Symposium On Leveraging Applications of Formal Methods, Verification and ValidationMadsen, O. L. (Participant)2018Activity: Participating in or organising an event types › Participation in or organisation af a conference InnovationsfondenMadsen, O. L. (Member)1 Apr 2014 → 31 Dec 2014Activity: Presentations, memberships, employment, ownership and other activities › Member of committee, council or board Aftagerpanelet for Danmarks Tekniske Universitet (Event)Madsen, O. L. (Member)1 Dec 2013 → …Activity: Presentations, memberships, employment, ownership and other activities › Member of committee, council or board CONNECT Advisory Forum - a Horizon 2020 Advisory GroupMadsen, O. L. (Member)12 Feb 2013 → 31 Jan 2015Activity: Presentations, memberships, employment, ownership and other activities › Member of committee, council or board Advisory Board for DTU NanoTech Madsen, O. L. (Member)1 Jan 2009 → …Activity: Presentations, memberships, employment, ownership and other activities › Member of committee, council or board View all 15 activities",
  "content_length": 5997,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:21"
}