{
  "name": "Oleg Vladimirovich Komogortsev",
  "homepage": "http://cs.txstate.edu/~ok11",
  "status": "success",
  "content": "Komogortsev Oleg's Web Page Home Research Teaching Service NSF CAREER Google Scholar LinkedIn Oleg Komogortsev, Ph.D. Denise M. Trauth Endowed Presidential Research Professor OK Lab Computer Science Texas State University 601 University Drive San Marcos, Texas 78666 Office: CMAL 309D Office Hours: TBD Phone: (512) 245 - 0349 Fax: (512) 245-8750 Research interests: Eye tracking, VR/AR/MR, Biometrics, HCI, Healthcare Major research questions investigated in OK Lab: 1) What units of information are encoded in the eye tracking signal for each person? 2) How those units of information change when the quality of eye tracking signal changes? 3) How those units of information change when the state or activity of a person changes? Introduction Videos to My Research: Brief introductory video created by Texas State University. Interview by LiveScience with corresponding video. National Science Foundation video. Detailed video of a technical presentation at Microsoft Research. Talk on novel eye tracking sensors given at Eye Tracking Research and Applications Symposium 2018. Alpha Chi Honor Society 2019 Distinguished Lecture provides a brief of the research ecosystem that I am developing. Major Awards and Recognition: Scientist at Meta 2019-2024 (Multiple contracts). Denise M. Trauth Endowed Presidential Research Professorship 2024. Meta Faculty Research Award 2023. Meta Faculty Research Award 2022b. Meta Faculty Research Award 2022a. Facebook Faculty Research Award 2021b. Facebook Faculty Research Award 2021a. Facebook Faculty Research Award 2020. Facebook Faculty Research Award 2019. Alpha Chi Honor Society 2019 Distinguished Lecture and was elected as an honorary life time member of Alpha Chi Honor Society. Google Global Research Award 2018 (Augmented and Virtual Reality). Kenote speaker for IARP International Conference on Biometrics (ICB) 2019. Kenote speaker for ACM Eye Tracking Research and Applications Symposium (ETRA) 2019. Worked as a Tenured Associate Professor at Michigan State University during 2017- 2018 as a part of the biometrics group that consisted of Anil Jain, Arun Ross, Xiaoming Liu, and Vishnu Bodetti. The work is briefly presented in the following feature article. Presidential Early Career Award for Scientists and Engineers (PECASE) 2017 from President Barack Obama. The award was given for my work in cybersecurity with the emphasis on eye movement-driven biometrics and health assessment. PECASE is \"the highest honor bestowed by the United States Government on science and engineering professionals in the early stages of their independent research careers\". Press release from White House. Press release from the National Science Foundation. NSF indicates that the award was given: \"For his groundbreaking research on the muscle structure of the eye as a basis for identification, which is transforming approaches to security and medicine. And for his unparalleled outreach on STEM research and education to large populations of underrepresented minorities.\" Google Virtual Reality Research Award 2017 (Virtual Reality, by invitation) Google Virtual Reality Research Award 2016 (Virtual Reality, by invitation) Google Faculty Research Award 2014 (Security) NSF CAREER Award 2012 Research Positions Available: 11/11/24: Looking for talented postdoctoral researchers. 11/11/24: Looking for talented Ph.D. students. 11/11/24: Looking for talented undergraduate students. Official Texas State University Disclaimer",
  "content_length": 3464,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:26"
}