{
  "name": "Olfa Nasraoui",
  "homepage": "http://louisville.edu/speed/people/faculty/nasraouiOlfa",
  "status": "success",
  "content": "Olfa Nasraoui » logowhite logofullcolor googlescholar checkmark_red checkmark_checkmark envelope instagram phone pointer seemore menu chevron_black chevron_blue chevron_red chevron_white contactwatermark coopwatermark relatedwatermark chevron close facebook flickr home linkedin minus pinterest play plus quote search twitter youtube Olfa Nasraoui Professor, Endowed Chair for E-Commerce Dr. Olfa Nasraoui is Professor of Computer Science and Engineering, Endowed Chair of E-commerce and the founding director of the Knowledge Discovery & Web Mining Lab at University of Louisville. She received her Ph.D in Computer Engineering and Computer Science from the University of Missouri-Columbia. She has conducted research in responsible AI and machine learning, and data science, in particular mining high dimensional, heterogeneous data streams, web mining and recommender systems, and currently focuses on research in fairness and explainability in AI and machine learning, including Deep Learning and Large Language Models. She has more than 200 publications in journals, book chapters and top tier refereed conferences, as well as 12 edited volumes. She is a National Science Foundation CAREER award winner and three-times winner of Best Paper Awards in the research area of machine learning. In the area of AI, Big data, data mining and machine learning, she has served as Primary Investigator (PI) for over 10 research grant projects and as Co-PI or Co-I on 8 research grant projects, funded mainly by the National Science Foundation, NASA.  Dr. Nasraoui has been leading as PI the NSF funded ATHENA ADVANCE initiative for STEM faculty equity and success at University of Louisville. She has also been leading an NSF site for Research Experiences for Teachers in Big Data and Data Science since 2018. She served as leader of the Cyber-enabled Discovery Research and Scholarship group at the Speed School of Engineering at University of Louisville between 2015 and 2019. She has served as Technical Mentor and Project Lead at the Data Science for Social Good fellowship at the University of Chicago in the 2015 summer cohort. Dr. Nasraoui has served on the organizing and program committees of several conferences and workshops, including organizing the premier series of workshops on Web Mining, WebKDD 2004-2008, as part of the ACM KDD conference. She has also served as Vice-Chair, Track Chair, or Senior Program Committee member for several of the most prestigious international AI and data mining conferences including KDD, RecSys, AAAI, IJCAI, ICDM, SDM, and CIKM. She serves on the Distinguished Review Board of ACM Transactions on Recommender Systems and serves on the Editorial board of Frontiers in Big Data, the International Journal of Machine Learning and Computing, Electronics- Artificial Intelligence Section, as well as the journal of Applied Intelligence. She has also served as Associate Editor for the IEEE Access journal and guest editor for Data Mining and Knowledge Discovery. She is a member of IEEE, IEEE CIS, IEEE WIE, ACM, and ACM SIG-KDD. She currently serves on the leadership team of the Kentucky Girls STEM collaborative network and has served as faculty advisor of the University of Memphis and the University of Louisville chapters of the Society of Women Engineers.EducationB.S. in Computer Engr & Electrical Eng, University of Missouri-Columbia, 1990M.S. in Computer Engineering, University of Missouri-Columbia, 1992Ph.D. in Computer Sc and Computer Engr, University of Missouri-Columbia, 1999PublicationsExploiting Tags and Social Profiles to Improve Focused Crawling- 2009 Additional Publications Journal ArticlesSoliman, M., ., Andreeva, K., ., Nasraoui, O., . & Cooper, N., . (2017). A causal mediation model of ischemia reperfusion injury in the retina. PLOS ONE, 12(11)Khribi, M., K., Jemni, M., . & Nasraoui, O., . (2009). Automatic Recommendations for E-Learning Personalization Based on Web Usage Mining Techniques and Information Retrieval. EDUCATIONAL TECHNOLOGY & SOCIETY, 12(4), 30-42KRISHNAPURAM, R., ., NASRAOUI, O., . & FRIGUI, H., . (1992). THE FUZZY-C SPHERICAL-SHELLS ALGORITHM - A NEW APPROACH. IEEE TRANSACTIONS ON NEURAL NETWORKS, 3(5), 663-671Zhang, Z., . & Nasraoui, O., . (2008). Mining search engine query logs for social filtering-based query recommendation. APPLIED SOFT COMPUTING, 8(4), 1326-1334Krishnapuram, R., ., Joshi, A., ., Nasraoui, O., . & Yi, L., Y. (2001). Low-complexity fuzzy relational clustering algorithms for Web mining. IEEE TRANSACTIONS ON FUZZY SYSTEMS, 9(4), 595-607Nasraoui, O., ., Rojas, C., . & Cardona, C., . (2006). A framework for mining evolving trends in Web data streams using dynamic learning and retrospective validation. COMPUTER NETWORKS, 50(10), 1488-1512Durak, N., ., Nasraoui, O., . & Schmelz, J., . (2010). Automated Coronal-Loop Detection based on Contour Extraction and Contour Classification from the SOHO/EIT Images. SOLAR PHYSICS, 264(2), 383-402KRISHNAPURAM, R., ., FRIGUI, H., . & NASRAOUI, O., . (1993). THE FUZZY C QUADRIC SHELL CLUSTERING-ALGORITHM AND THE DETECTION OF 2ND-DEGREE CURVES. PATTERN RECOGNITION LETTERS, 14(7), 545-552Zhuhadar, L., ., Carson, B., ., Daday, J., ., Thrasher, E., . & Nasraoui, O., . (2016). Computer-Assisted Learning Based on Universal Design, Multimodal Presentation and Textual Linkage. JOURNAL OF THE KNOWLEDGE ECONOMY, 7(2), 373-387Soliman, M., ., Nasraoui, O., . & Cooper, N., . (2016). Building a glaucoma interaction network using a text mining approach. BIODATA MINING, 9Spiliopoulou, M., ., Mobasher, B., ., Nasraoui, O., . & Zaiane, O., . (2012). Guest editorial: special issue on a decade of mining the Web. DATA MINING AND KNOWLEDGE DISCOVERY, 24(3), 473-477Frigui, H., . & Nasraoui, O., . (2004). Unsupervised learning of prototypes and attribute weights. PATTERN RECOGNITION, 37(3), 567-581KRISHNAPURAM, R., ., FRIGUI, H., . & NASRAOUI, O., . (1995). FUZZY AND POSSIBILISTIC SHELL CLUSTERING ALGORITHMS AND THEIR APPLICATION TO BOUNDARY DETECTION AND SURFACE APPROXIMATION .1.. IEEE TRANSACTIONS ON FUZZY SYSTEMS, 3(1), 29-43KRISHNAPURAM, R., ., FRIGUI, H., . & NASRAOUI, O., . (1995). FUZZY AND POSSIBILISTIC SHELL CLUSTERING ALGORITHMS AND THEIR APPLICATION TO BOUNDARY DETECTION AND SURFACE APPROXIMATION .2.. IEEE TRANSACTIONS ON FUZZY SYSTEMS, 3(1), 44-60Nasraoui, O., ., Soliman, M., ., Saka, E., ., Badia, A., . & Germain, R., . (2008). A web usage mining framework for mining evolving user profiles in dynamic Web sites. IEEE TRANSACTIONS ON KNOWLEDGE AND DATA ENGINEERING, 20(2), 202-215Caicedo, J., C., BenAbdallah, J., ., Gonzalez, F., A. & Nasraoui, O., . (2012). Multimodal representation, indexing, automated annotation and retrieval of image collections via non-negative matrix factorization. NEUROCOMPUTING, 76(1), 50-60 Badami, M., Tafazzoli, F. & Nasraoui, O. (2018). A case study for intelligent event recommendation. International Journal of Data Science and Analytics, 5(4), 249-268 Soliman, M., Andreeva, K., Nasraoui, O. & Cooper, N., G. (2017). A causal mediation model of ischemia reperfusion injury in the retina. PLOS ONE, 12(11) Soliman, M., Nasraoui, O., Cooper, N., G., Soliman, M., Nasraoui, O., Cooper, Nigel G. F., . & Cooper, N., G. (2016). Building a glaucoma interaction network using a text mining approach. BioData Mining, 9(1) Zhuhadar, L., Carson, B., Daday, J., Thrasher, E. & Nasraoui, O. (2016). Computer-Assisted Learning Based on Universal Design, Multimodal Presentation and Textual Linkage. Journal of the Knowledge Economy, 7(2), 373-387 Chuprina, S. & Nasraoui, O. (2016). Using Ontology-based Adaptable Scientific Visualization and Cognitive Graphics Tools to Transform Traditional Information Systems into Intelligent Systems. Scientific VisualizationChuprina, S., Postanogov, I. & Nasraoui, O. (2016). Ontology Based Data Access Methods to Teach Students to Transform Traditional Information Systems and Simplify Decision Making Process. Procedia Computer Science, 80, 1801-1811Hosseini-Asl, E., Nasraoui, O. & Zurada, J., M. (2016). Deep Learning of Part-Based Representation of Data Using Sparse Autoencoders With Nonnegativity Constraints. IEEE Transactions on Neural Networks and Learning Systems, 27(12), 2486-98Khenner, E. & Nasraoui, O. (2016). A Bilingual Semantic Network of Computing Concepts. Procedia Computer Science, 80, 2392-2396 Gomez, J., Leon, E., Nasraoui, O., Giraldo, F. & Giraldo, F. (2014). The Parameter-less Randomized Gravitational Clustering algorithm with online clusters’ structure characterization. Progress in Artificial Intelligence, 2(4), 217-236 Spiliopoulou, M., Mobasher, B., Nasraoui, O. & Zaiane, O. (2012). Guest editorial: special issue on a decade of mining the Web. Data Mining and Knowledge Discovery, 24(3), 473-477Zhuhadar, L., Nasraoui, O., Wyatt, R. & Yang, R. (2011). Visual knowledge representation of conceptual semantic networks. Social Network Analysis and MiningNasraoui, O., Soliman, M., Saka, E., Badia, A., Germain, R., N. & Germain, R., N. (2008). A Web Usage Mining Framework for Mining Evolving User Profiles in Dynamic Websites. IEEE Transactions on Knowledge and Data Engineering, 20(February), 202-15 (2006). A multi-layered and multi-faceted framework for mining evolving web clickstreams. Adaptive and Personalized Semantic Web, 14, 11-35Abdollahi, B., . & Nasraoui, O., . (2017). Using Explainability for Constrained Matrix Factorization. PROCEEDINGS OF THE ELEVENTH ACM CONFERENCE ON RECOMMENDER SYSTEMS (RECSYS'17), 79-83Abdullin, A., . & Nasraoui, O., . (2012). Clustering Heterogeneous Data with Mutual Semi-supervision. STRING PROCESSING AND INFORMATION RETRIEVAL, 7608, 18-29Achananuparp, P., ., Han, H., ., Nasraoui, O., . & Johnson, R., . (2007). Semantically Enhanced User Modeling. APPLIED COMPUTING 2007, VOL 1 AND 2, 1335-+Alshammari, M., ., Nasraoui, O., . & Sanders, S., . (2019). Mining Semantic Knowledge Graphs to Add Explainability to Black Box Recommender Systems. IEEE ACCESS, 7, 110563-110579Alshammari,",
  "content_length": 25345,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:27"
}