{
  "name": "Olga Sorkine",
  "homepage": "http://igl.ethz.ch/people/sorkine",
  "status": "success",
  "content": "igl | Interactive Geometry Lab | ETH Zurich | Prof. Dr. Olga Sorkine-Hornung igl | Interactive Geometry Lab Interactive Geometry Lab home contact people research publications code teaching events links internal ETH Zurich Prof. Dr. Olga Sorkine-Hornung address ETH Zurich Department of Computer Science CNB, G 106.2 Universitaetstrasse 6 8092 ZurichSwitzerland e-mailSorry, you need Javascript on to email me. phone+41 44 632 83 57 assistant+41 44 632 74 08 bio I was born in Moscow region, Russia, and grew up in Tel Aviv, Israel. I am currently a Professor of Computer Science at ETH Zurich. I lead the Interactive Geometry Lab at the Institute of Visual Computing. Prior to joining ETH, I was an Assistant Professor at the Courant Institute of Mathematical Sciences, New York University (2008-2011). I earned my BSc in Mathematics and Computer Science and PhD in Computer Science from Tel Aviv University (2000, 2006). Following my studies, I received the Alexander von Humboldt Foundation Fellowship and spent two years as a postdoc at the Technical University of Berlin. I am interested in theoretical foundations and practical algorithms for digital content creation tasks, such as shape representation and editing, artistic modeling techniques, digital fabrication, computer animation and digital image manipulation. I also work on fundamental problems in digital geometry processing, including reconstruction, filtering, parameterization and meshing, as well as discrete differential geometry. Full CV publications My list of publications is available here. current service activities (highlights) Member of the ACM SIGGRAPH Papers Advisory Group (PAG). Member of the Eurographics Technical Awards Committee. honors and awards (selection) Test of Time Award, 2024, awarded at Eurographics Symposium on Geometry Processing 2024 for the paper \"Laplacian Surface Editing\" (SGP 2004) by Olga Sorkine-Hornung, Daniel Cohen-Or, Yaron Lipman, Marc Alexa, Christian Roessl and Hans-Peter Seidel Test of Time Award, 2024, awarded at SIGGRAPH 2024 for the paper \"Robust Inside-Outside Segmentation using Generalized Winding Numbers\" (SIGGRAPH 2013) by Alec Jacobson, Ladislav Kavan and Olga Sorkine-Hornung Best Paper Honorable Mention at SIGGRAPH, 2024, with Aviv Segall, Jing Ren and Amir Vaxman Best Paper Honorable Mention at Eurographics, 2024, with Alexandre Binninger, Amir Hertz, Daniel Cohen-Or and Raja Giryes Elected as member of the Swiss Academy of Engineering Sciences, the SATW, 2023 Best Paper Award at 3DV, 2022, with Robin Magnet, Jing Ren and Maks Ovsjanikov Test of Time Award, 2022, awarded at Eurographics Symposium on Geometry Processing 2022 for the paper \"As-rigid-as-possible surface modeling\" (SGP 2007) by Olga Sorkine-Hornung and Marc Alexa Golden Owl, 2021 (awarded for excellence in teaching at ETH Zurich) ACM Fellow, 2020 ERC Consolidator Grant, 2020 SGP Software Award, 2020, for Instant Meshes, with Wenzel Jakob, Marco Tarini and Daniele Panozzo Best Paper Award at SGP, 2020, with Marc Alexa, Philipp Herholz and Sorry, you need Javascript on to email me. Best Paper Honorable Mention at Eurographics 2018 Max Rössler Prize, 2017 EUROGRAPHICS Outstanding Technical Contributions Award, 2017 Best Paper Award at 3DV, 2016, with Kaan Yücer, Changil Kim and Alexander Sorkine-Hornung Fellow of the Eurographics Association, 2015 SGP Software Award, 2015, for libigl (with multiple co-contributors) Best Paper Award at SGP, 2014, with Olga Diamanti, Amir Vaxman and Daniele Panozzo Intel Early Career Faculty Award, 2013 Latsis Prize of ETH Zurich, 2012 ERC Starting Grant, 2012 ACM SIGGRAPH Significant New Researcher Award, 2011 EUROGRAPHICS Young Researcher Award, 2008 professional activities Technical program chair Pacific Graphics 2025 Conference Co-Chair ACM SIGGRAPH 2019 Technical Papers AAG 2018 Technical Papers / CO-CHAIRS Chris Williams, Samar Malek Axel Kilian Pacific Graphics 2017 Technical Papers / CO-CHAIRS Wen-Chieh Lin, Jernej Barbič EUROGRAPHICS 2015 Technical Papers / CO-CHAIR Michael Wimmer EUROGRAPHICS 2013 Short Papers / CO-CHAIR Miguel A. Otaduy 3DimPVT 2012 / CO-CHAIR Jan-Michael Frahm SMI 2011 / CO-CHAIR Niloy Mitra SGP 2010 / CO-CHAIR Bruno Levy ECCV Media Retargeting Workshop 2010 / CO-CHAIRS Thomas Deselaers, Alexander Sorkine-Hornung Keynote speaker Symposium on Computational Fabrication 2025 VMV 2024 DLGC@CVPR 2024 SIAM International Meshing Roundtable 2023 SIAM Conference on Geometric and Physical Modeling (GD/SPM) 2021 Geometry Workshop in Obergurgl 2021 Graphics Interface 2021 Symposium on Computational Geometry (SoCG) 2020 Design Modelling Symposium 2019 Symposium on Geometry Processing 2018 Symposium on Geometry and Computational Design 2017 (GCD4) International Conference on Computational Science (ICCS) 2017 ECCV Workshop NORDIA 2014 EUROGRAPHICS 2013 VMV 2013 CGI 2013 CVMP 2012 SCCG 2012 ESOF 2010 SIBGRAPI 2009 Imagina 2007 Editorial board member ACM Transactions on Graphics (2016-2020) IEEE Transactions on Visualization and Computer Graphics (2015–2018) IEEE Computer Graphics and Applications (2011-2015) Computer Graphics Forum (2010-2013) Graphical Models (2010-2015) The Visual Computer (2009-2015) Computers & Graphics (2008-2014) Technical program committee member ACM SIGGRAPH Papers 2008, 2009, 2011, 2012, 2014, 2017, 2018, 2019 (chair), 2021, 2024 (sorter) ACM SIGGRAPH ASIA Papers 2010, 2017 (sorter) EUROGRAPHICS Papers 2007, 2008, 2011, 2012, 2014, 2015 (co-chair) EUROGRAPHICS Short Papers 2008, 2009, 2013 (co-chair) SGP Papers 2008, 2009, 2010 (papers co-chair), 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2020, 2021, 2022, 2023, 2024, 2025 Pacific Graphics Papers 2007, 2008, 2011, 2012, 2013, 2017 (papers co-chair) ACM I3D Papers 2010, 2011, 2012, 2013 ACM SIGGRAPH Sketches & Posters 2007 ACM SIGGRAPH ASIA Sketches & Posters 2008 (advisory board), 2009 SIAM/ACM SPM Papers 2008, 2009, 2010, 2011, 2012, 2013 SMI Papers 2008, 2009, 2011 (papers co-chair), 2013 SIBGRAPI Papers 2009, 2011, 2012 SBIM Papers 2010, 2012, 2013 NPAR Papers 2013 Computational Aesthetics Papers 2013 NORDIA Workshop Papers 2010, 2011 3DPVT Papers 2008, 2010, 2012 (papers co-chair) GMP Papers 2012 ICSE Workshop on Games and Software Engineering Papers 2012 Computer Animation and Social Agents (CASA) Papers 2008 International Symposium on Visual Computing (ISVC) Papers 2009, 2010 APSIPA ASC Papers 2009 IADIS International Conference on Computer Graphics and Visualization Papers 2007, 2008 © 2025 ETH Zurich | Department of Computer Science | Institute of Visual Computing | imprint | Last update: Sep 10, 2025 Please activate JavaScript.",
  "content_length": 6638,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:30"
}