{
  "name": "Olga Ormandjieva",
  "homepage": "http://www.cs.concordia.ca/~ormandj",
  "status": "success",
  "content": "Olga Ormandjieva, PhD, Eng. - Curriculum Vitae Olga Ormandjieva, PhD, Eng. Professor, Computer Science and Software Engineering e: olga dot ormandjieva at concordia.ca w: Olga Ormandjieva's Concordia page Bio and Research Interests Dr. Olga Ormandjieva is Associate Professor in the Computer Science and Software Engineering (CSSE) Department at Concordia University, Montreal, Quebec (Canada) and a member of the Ordre des Ingénieurs du Québec (OIQ). She holds a Ph.D. in Computer Science (2002) and Master's Degree in Computer Science and Mathematics (1987). Dr. Ormandjieva joined the Department in 2002 as an Assistant Professor. She has conducted extensive research in the area of Measurement in Software Engineering and its extension to the development of formal methods for modelling and monitoring functional and nonfunctional requirements. Her current research work addresses the problem of automatic detection of cyber-predators in social media using Artificial Intelligence (AI) technology and best Software Engineering practices. Dr. Ormandjieva’s new research direction aims at exploring different approaches to big data quality modeling and measurement. She has over 135 peer-reviewed journal and conference papers to her name, as well as seven book chapters. Dr. Ormandjieva has received several grant fundings from the Natural Sciences and Engineering Research Council (NSERC) and other sources since 2002. She has graduated seven doctoral students, seventeen students in the Master’s program (thesis option) and is held in very high esteem by all those she supervises. Currently she is teaching software engineering undergraduate and graduate courses at Concordia University. Throughout her academic career she has contributed to the departmental governance. Her service to the academic community includes organizing/chairing sessions at international conferences and workshops, participating in program committees for various international conferences, and serving as external reviewer for highly ranked journals such as Journal of Software Systems and Software. She also served as secretary of the IEEE Montreal Computer Chapter. As Professional Engineer, Dr. Ormandjieva served on the visiting team for the Canadian Engineering Accreditation Board (CEAB) Accreditation Visit as a program visitor for the software engineering program to Carleton University in November 2017. Work Experience Professor, Computer Science & Software Engineering Department (CSE), Concordia University April 2002 - present Expertise Measurement in Software Engineering Big Data Quality Modeling and Measurement Software Project Management Software Requirements Engineering Formal Methods in Software Engineering Curriculum Vitae Olga Ormandjieva's CV Last updated on December 30, 2022 Mailing Address Department of Computer Science & Software Engineering, ER-929, ER Building, 2155 Guy St., Montreal, Quebec, Canada H3G 1M8",
  "content_length": 2927,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:27"
}