{
  "name": "Olga R. P. Bellon",
  "homepage": "https://www.inf.ufpr.br/olga",
  "status": "success",
  "content": "Olga Regina Pereira Bellon Olga Regina Pereira Bellon Profa. Olga Regina Pereira Bellon é pesquisadora do CNPq (Produtividade em Pesquisa). Possui graduação em Engenharia Elétrica pela Universidade Federal do Espírito Santo (1987), mestrado em Engenharia Elétrica pela Universidade Estadual de Campinas (1990), doutorado em Engenharia Elétrica pela Universidade Estadual de Campinas (1997) e pós-doutorado em Engenharia Elétrica e de Computação pela The Ohio State University (2003). Atualmente, é professor adjunto 4 da Universidade Federal do Paraná, tendo ingressado em 1992 e atuado como Coordenadora do Programa de Pós-Graduação em Informática (1997-2000) e como Coordenadora Geral de Pesquisa (2000-2002) desta instituição. Elaborou e implementou o primeiro curso de Especialização em Software Livre da UFPR (2001). Fundou e coordena o Grupo IMAGO de Pesquisa em Visão Computacional, Computação Gráfica e Processamento de Imagens (www.inf.ufpr.br/imago), cadastrado desde 1995 no Diretório de Grupos de Pesquisa do CNPq. Tem experiência na área de Ciência da Computação, com ênfase em Processamento Gráfico (Visão Computacional, Computação Gráfica e Processamento de Imagens) e Informática em Saúde, atuando principalmente nos seguintes temas: range images, extração de características, segmentação de imagens, registro de imagens, análise de imagens, modelagem 3D, biometria, mineração de dados e de imagens, aquisição e construção de conteúdos digitais para preservação de acervos naturais e culturais, e imagens médicas. Recebeu diversos financiamentos a projetos por agências de fomento tais como FINEP, CNPq, e Fundação Araucária, além de possuir cooperação com vários grupos de pesquisa multidisciplinares. Orientou diversos trabalhos de doutorado, mestrado e iniciação científica, possuindo 7 premiações pela Sociedade Brasileira de Computação. Participou como revisora e/ou membro do comitê de diversos eventos nacionais e internacionais, bem como periódicos internacionais. Em 2004, coordenou o XVII Brazilian Symposium on Computer Graphics and Image Processing joint with II Ibero-American Symposium on Computer Graphics, em Curitiba-PR. Em 2007, foi eleita Presidente da Comissão Especial de Computação Gráfica e Processamento de Imagens (CEGRAPI) da Sociedade Brasileira de Computação. Para saber mais sobre o currículo e as atividades da profa. Olga Bellon, acesse o seu CV Lattes CNPq e/ou o site do Grupo IMAGO de Pesquisa. E-mail:",
  "content_length": 2452,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:28"
}