{
  "name": "Olga Gadyatskaya",
  "homepage": "https://ogadyatskaya.github.io",
  "status": "success",
  "content": "Olga Gadyatskaya Olga Gadyatskaya Hi there! I am Associate Professor of Cyber Security at LIACS, Leiden University. I work on a variety of topics pertaining to cyber security of organizations, ranging from security risk management and threat modeling to mobile security and secure software development. My main goal is to make organisations more secure by improving their security management practices, helping them to secure their software and systems, providing them insights into cyber threats, and assisting them in making decisions about cyber security. I lead the Leiden Organizational Cyber Security (LOCS) group at LIACS. Find out more about our group https://locs.liacs.nl/ I teach courses on cyber security in several MSc and BSc programmes at Leiden University. I also supervise MSc and BSc projects. Please contact me via email if you would like to work on a cyber security-related thesis project under my supervision. PhD Students Currently there are no open PhD positions in my group. Open positions will always be advertized via the Leiden University jobs website and AcademicTransfer.com Current Nathan D. Schiele on graphical security models (started in Nov. 2020) Xinyuan Ji on security and privacy in federated learning (CSC scholar; started in Jul. 2021) Rui Li on explainable malware detection (CSC scholar; started in Oct. 2021) Soufian El Yadmani on security technology automation (started in Oct. 2021) Arina Kudriavtseva on secure software engineering programs in organizations (on the C-SIDe project; started in Dec. 2021) Jafar Akhoundali on secure software engineering for large-scale systems (on the C-SIDe project; started in Apr. 2023) Dalia Papuc on reasoning about distributed systems (started in Jun. 2023) Former Dr. Aleksandr Pilgun Instruction Coverage for Android App Testing and Tuning (Nov. 2016 - Nov. 2020) News July 2023: Our KIEM grant application had been accepted! This means that next year we will be able to organize a large event dedicated to Ethics in Cyber Security and AI. Stay tuned! July 2023: I have been promoted to associate professor at LIACS, Leiden University. June 2023: On July 3rd I will give a keynote talk at the DevSecOpsRA workshop (with EuroS&P 2023). Workshop details here April 2023: I am organizing a workshop on teaching about ethics in cyber security courses (in higher education). Save the date: May 8th, 2023, Leiden! Confirmed speakers: Prof. Herbert Bos (VU), Astrid Oosenbrug (DIVD), Dr. Luca Consoli (RU). More details and registration link here April 2023: I will give a 1-day course on mobile security at the IPA course on algorithms, complexity and security. Register if you are a PhD student March 2023: I am excited to speak at the High-Tech Women event 2023 in Darmstadt. https://hightechwomen.org/: please consider attending! March 2023: I am giving a talk on explainable AI methods for Android malware detection at the SAILS lunch seminar. More info February 2023: I was interviewed about my research and careers for females in cyber security for the Science Faculty website: read the interview February 2023: I have joined the Ethics Review Committee at the Faculty of Science. December 2022: I am organizing a Meet-and-Mingle lunch for female scientists at LIACS and the MI on January 12, 2023. Drop me an email if you would like to join us! October 2022: Soufian El Yadmani presents our work on malicious proof-of-concept exploits published on GitHub at ONE conference. Come to see his talk (details), or read a preprint of the paper on Arxiv https://arxiv.org/pdf/2210.08374.pdf April 2022: I am excited to be a Jury member for the demos at ICT Open 2022. Looking forward to seeing many exciting new technologies! March 2022: I am excited to join the new Junior Board at RISE (Researchers in Science for Equality). Gender equality in STEM is an important subject for me and I am looking forward to being able to contribute more. November 2021: Our C-SIDe project on cyber security by integrated design has kicked-off! Discover more about the project: https://www.projectcside.nl/ October 2021: I/O Magazine (NWO/ICT Platform Nederland) runs an article about our Systems and Security cluster: check it out September 2021: I am co-chairing the Dutch Best Cyber Security Research Paper Award 2021 (DCSRP). Submit your best research paper published in 2021 by 13 September 2021! More info here June 2021: The CSC grant application of Rui Li has been accepted! Rui will soon join our group and will do her PhD study on mobile security and explainable AI. May 2021: Our NWA Cyber Security proposal has been accepted by the NWO! The project will start in the Fall 2021. Check out more information on Leiden University website. March 2021: I am co-organizing the 2nd edition of the International Workshop on Security in Mobile Technologies at ACNS 2021 (SecMT). Consider submitting your papers on mobile security! Workshop page. January 2021: I have given an invited lecture on Cyber Security at the FAECTOR Excellence Programme (Erasmus University Rotterdam). December 2020: The CSC grant application of Xinyuan Ji has been approved! Xinyuan will pursue a joint Xi'an Jiaotong-Leiden PhD degree, and she will join our group in July 2021 to continue her work on privacy and security challenges in federated learning. November 2020: My first PhD student Alex Pilgun has successfully defended his PhD thesis titled Instruction Coverage for Android App Testing and Tuning at the University of Luxembourg!",
  "content_length": 5484,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:24"
}