{
  "name": "Olga Russakovsky",
  "homepage": "http://www.cs.cmu.edu/~orussako",
  "status": "success",
  "content": "Olga Russakovsky Olga Russakovsky Home Say hi Associate Professor, Computer Science Department, Princeton University Associate Director, Princeton AI Lab Chair of the Board of Directors, AI4ALL nonprofit [Lab] [Scholar] [CV] [Bio] [Say hi] Research I work on developing artificially intelligent systems that are able to reason about the visual world. My primary research area is computer vision, closely integrated with machine learning, human-computer interaction and fairness, accountability and transparency. Please visit the Visual AI Lab page for a list of publications, project descriptions, lab members, and other information. To get involved, please say hi. I am an Associate Professor in the Department of Computer Science; I am also affiliated faculty at the Center for Statistics and Machine Learning and the Center for Information Technology Policy. Here are my Google Scholar, CV and a formal bio. Outreach I spend a lot of time thinking about how we as a society got ourselves into such a diversity crisis in computer science, and how we can get ourselves out of it. Some of my views are briefly summarized in this MIT Technology Review article. Also: AI4ALL is a nonprofit I co-founded in 2017 to create a diverse future generation of AI leaders. You can read more about the AI4ALL story on our website or in this excellent article in TheAtlantic. Here's how to get involved with AI4ALL. Princeton AI4ALL is a camp I co-founded in 2018 for high school students from underrepresented racial/ethnic groups. You can read more about it in this excellent EdWeek article and (if you're at Princeton) get involved. Stanford AI4ALL (formerly SAILORS) is a program that I co-founded in 2015 to educate high school girls about AI. You can read more about it in this excellent Wired article or in our SIGCSE 2016 paper. Random tidbits One of the most useful books I ever read is Stress-Free For Good by Fred Luskin and Kenneth R. Pelletier. It makes a really solid point that while mental stress may be helpful for motivation, physical stress (heart pounding, muscles tightening, sinking feeling in your stomach) is strictly counter-productive on every level -- except when you're running from an actual physical tiger, which you probably aren't. So the book describes some straight-forward techniques to trick your body into being less physically stressed. A 2015 study published in Science and extensively covered by the media led by Sarah-Jane Leslie found that scientific fields where innate brilliance is believed to be required tend to attract fewer women and racial minorities. This is an incredibly important but deeply distressing finding. It's particularly frustrating since innate brilliance is not even really a thing. For example, check out Peak: Secrets from the New Science of Expertise by Anders Ericsson which essentially invalidates this concept entirely. It summarizes several decades of research into how the right type of practice can be used to develop almost any skill. There are some excellent resources which seek to illuminate both the hard-hitting impact and the deep structural causes of AI bias. In particular, I highly recommend two great books, Race After Technology by Dr. Ruha Benjamin and Algorithms of Oppression by Dr. Safiya Umoja Noble. If you only have a few minutes, please watch AI, Ain't I a Woman by Joy Buolamwini for a beautiful and painful look at the topic. This is why it is so vitally important that we create space for a diverse next generation of AI leaders. Home Say hi",
  "content_length": 3525,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:29"
}