{
  "name": "Olga G. Troyanskaya",
  "homepage": "https://www.cs.princeton.edu/people/profile/ogt",
  "status": "success",
  "content": "Olga Troyanskaya CS Skip to main content Olga Troyanskaya Maduraperuma/Khot Professor of Computer Science Contact Building 242 Carl Icahn Lab Envelope ogt@cs.princeton.edu Phone (609) 258-1749 Diploma Ph.D., Stanford University, 2003 Research Areas Computational Biology Short Bio Olga Troyanskaya is a professor at the Lewis-Sigler Institute for Integrative Genomics and the Department of Computer Science at Princeton University, where she has been on the faculty since 2003. She is the director of Princeton Precision Health and affiliated with the Department of Molecular Biology and, the Omenn-Darling Bioengineering Institute. In 2014 she became the deputy director of Genomics at the Center for Computational Biology at the Flatiron Institute, a part of the Simons Foundation in NYC. She holds a Ph.D. in Biomedical Informatics from Stanford University, has been honored as one of the top young technology innovators by the MIT Technology Review, and is a recipient of the Sloan Research Fellowship, the National Science Foundation CAREER award, the Overton award from the International Society for Computational Biology, and the Ira Herskowitz award from the Genetic Society of America. Troyanskaya Laboratory: function.princeton.edu Other Affiliations Genomics PACM PBI PicSciE Related News July 9, 2025 Major autism study uncovers biologically distinct subtypes, paving the way for precision diagnosis and care Researchers at Princeton University and the Simons Foundation have identified four clinically and biologically distinct subtypes of autism. October 6, 2023 Beyond ChatGPT: Princeton Language and Intelligence initiative pushes the boundaries of large AI models ChatGPT took the public by storm a year ago, but Princeton experts have been working at the intersection of language and artificial intelligence for more than a decade. May 11, 2023 Using the tools of computer science to improve health care This semester a team of Princeton students gather weekly in a small seminar room to study medicine. But no stethoscopes or scalpels are involved. These students are using computers.",
  "content_length": 2103,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:25"
}