{
  "name": "Oliver Ray",
  "homepage": "https://www.cs.bris.ac.uk/~oray",
  "status": "success",
  "content": "Dr Oliver Ray - HomePage Contact Details Department of Computer Science University of Bristol Merchant Venturers Building Woodland Road, BS8 1UB Bristol, United Kingdon csxor@bristol.ac.uk tel: 0117 954 5150 fax: 0117 954 5208 room 3.29 MVB Academic Experience Jan 21 - nowSenior Lecturer, Department of Computer Science, University of Bristol, UK Jan 12 - Dec 21Lecturer, Department of Computer Science, University of Bristol, UK Jan 07 - Dec 11RCUK Research Fellow, Department of Computer Science, University of Bristol, UK Feb 07 - Apr 07JSPS Visiting Research Fellow, National Institute of Informatics, Japan Dec 05 - Dec 06Visiting Scientist, Department of Computer Science, University of Cyprus, Cyprus Sep 01 - Dec 05Ph.D. in Computer Science, Department of Computing, Imperial College London, UK Sep 00 - Sep 01Teaching Associate, Department of Computing, Imperial College London, UK Oct 97 - Jul 00B.Eng. in Information Systems Engineering, Department of Electrical and Electronic Engineering, Imperial College London, UK Research Interests My main areas of research concern the formalisation and automation of intelligent reasoning through the integration of deductive inference, abductive explanation and inductive learning within interactive artificial intelligence and hybrid neuro-symbolic cognitive architectures. I am also involved in applications of these techniques to the automation of scientific and commonsense reasoning in systems-biology, astro-physics, juris-informatics, cyber-security, energy-aware computation, social insect behaviour, robot enhanced Autism interventions, and the evolution of norms in socio-technical institutions. Selected References Journal Articles G. Stevens, S. Fotopoulou, M.N. Bremer and O. Ray. AstronomicAL: an interactive dashboard for visualisation, integration and classification of data with Active Learning. Journal of Open Source Software 6 (65), 3635, 2021. (here) L. Marucci, M. Barberi, J. Karr, O. Ray, P.R. Race, M. de Souza Andrade, C. Grierson, S.A. Hoffmann, S. Landon, E. Rech, J. Rees-Garbutt, R. Seabrook, W. Shaw and C. Woods. Computer-Aided Whole-Cell Design: Taking a Holistic Approach by Integrating Synthetic With Systems Biology. Frontiers in Bioengineering and Biotechnology 8(942), 2020. (here) C. Blackmore, K. Eder and O. Ray. A Logic Programming Approach to Predict Effective Compiler Settings for Embedded Software. Theory and Practice of Logic Programming 15(4-5): 481-494, 2015. H. Nabeshima, K. Iwanuma, K. Inoue and O. Ray. SOLAR: An Automated Deduction System for Consequence Finding. AI Communications 23(2-3): 188-203, 2010. O. Ray. Nonmonotonic Abductive Inductive Learning. Journal of Applied Logic 7(3): 329-340, 2009. D. Alrajeh, O. Ray, A. Russo and S. Uchitel. Using abduction and induction for operational requirements elaboration. Journal of Applied Logic 7(3): 275-288, 2009. A. d'Avila Garcez, D. Gabbay, O. Ray and J. Woods. Abductive Reasoning in Neural-Symbolic Learning Systems. TOPOI 26(1):37-49, 2007. Book Chapters J. Valvoda and O. Ray. From Case Law to Ratio Decidendi. New Frontiers in Artificial Intelligence: Revised selected papers from the Japanese Society for Artificial Intelligence 2017 Workshops. LNAI 10838:20-34, Springer, 2018. (here) K. Whelan, O. Ray and R. King. Representation, Simulation and Hypothesis Generation in Graph and Logical Models of Biological Networks. Yeast Systems Biology. Methods and Protocols, chap.26, Methods in Molecular Biology 759:465-482, Humana Press, 2011. Conference Papers O. Ray. Learning and Revising Dynamic Temporal Theories in the Full Discrete Event Calculus Proc. 30th Int. Conf. on Inductive Logic Programming (ILP), LNAI 13191:219-233, 2021. (here) O. Ray and S. Moyle. Towards expert-guided elucidation of cyber attacks through interactive inductive logic programming Proc. 13th Int. Conf. on Knowledge and Systems Engineering (KSE), IEEE Press, 2021. (here) O. Ray, A. Conroy and R. Imansyah. Summarisation with Majority Opinion. Proc. 33rd Int. Conf. on Legal Knowledge and Information Systems (JURIX), Frontiers in Artificial Intelligence and Applications 334:247-250, IOS Press, 2020. (here) J. Valvoda, O. Ray and K. Satoh. Using agreement statements to identify majority opinion in UKHL case law. Proc. 31st Int. Conf. on Legal Knowledge and Information Systems (JURIX), Frontiers in Artificial Intelligence and Applications 313:141-150, IOS Press, 2018. (here) O. Ray, S. Hicks and S. Moyle. Using ILP to Analyse Ransomware Attacks. Proc. 26th Int. Conf. on Inductive Logic Programming (ILP), CEUR 1865:54-59, 2016. (here) R. Rozanski, O. Ray, R King and S. Bragaglia. Automating development of metabolic network models. Proc. 13th Int. Conf. on Computational Methods in Systems Biology (CMSB), LNCS 9308:145-156, 2015 (here) S. Bragaglia and O. Ray. Nonmonotonic Learning in Large Biological Networks. Proc. 24th Int. Conf. on Inductive Logic Programming (ILP), LNAI 9046:33-48, 2015. (here) O. Ray, T. Soh and K. Inoue. Analysing Pathways using ASP-based Approaches Proc. 2010 Conference on Algebraic and Numeric Biology (ANB), LNCS 6479:167-183, 2011. O. Ray, K. Whelan and R. King. Automatic Revision of Metabolic Networks through Logical Analysis of Experimental Data Proc. 19th Int. Conf. on Inductive Logic Programming (ILP), LNAI 5989:194-201, 2010. D. Corapi, O. Ray, A. Russo, A. Bandara and E. Lupu. Learning rules from user behaviour Proc. 5th Int. Conf. on Artificial Intelligence Applications and Innovations (AIAI), IFIP 296:459-468, 2009. Y. Yamamoto, O. Ray and K. Inoue. Towards a Logical Reconstruction of CF-Induction. Proc. Japanese Society for Artificial Intelligence 2007 Conference, LNCS 4914:330-343, 2008. O. Ray and K. Inoue. A Consequence Finding Approach for Full Clausal Abduction Proc. 10th Int. Conf. on Discovery Science (DS), LNAI 4755:173-184, 2007. O. Ray and K. Inoue. Mode-Directed Inverse Entailment for Full Clausal Theories. Proc. 17th Int. Conf. on Inductive Logic Programming (ILP), LNAI 4894:225-238, 2007. O. Ray. Automated Abduction in Scientific Discovery. Model-Based Reasoning in Science and Medicine (MBR), SICI 64:103-116, 2007. O. Ray, A. Antoniades, A. Kakas and I. Demetriades. Abductive Logic Programming in the Clinical Management of HIV/AIDS. Proc. 17th Europ. Conf. on Artificial Intelligence (ECAI), pp 437-441, 2006. Workshop Contributions S. Hulkkonen and O. Ray An End-to-End PDF Toolchain for Marking Up Scientific Documents. Proc. 11th Int. Conf. on Language Resources and Evaluation (LREC) Workshop on Mining Scientific Publications (WOSP). ELRA, 2018. (here) C. Blackmore, O. Ray, M Kull, G. Rahman, P. Flach and N. Lachiche Reframing of Classification and Regression Tasks for Predicting the Effects of Compiler Settings on Multiple Embedded Systems. Proc. 2nd ECML/PKDD Int. Workshop on Learning over Multiple Contexts (LMCE), 2015. R. Gladstone, T. Burghardt, B. Golenia, O. Ray, I. Culverwell, J. Gregory, H. Hellmer and T. Payne Simulated water masses and changes near Antarctica: A comparison of oceanmodels. Proc. IGS-Symposium on Interactions of Glaciers and Ice Sheets with the Ocean: Eprint 24547, 2011. O. Ray, A. Clare, M. Liakata, L. Soldatova, K. Whelan and R. King. Towards the Automation of Scientific Method. Proc. IJCAI'09 Workshop on Abductive and Inductive Knowledge Development: 27-33, 2009. O. Ray, K. Whelan and R. King. A nonmonotonic logical approach for modelling and revising metabolic networks. Proc. 3rd Int. Conf. on Complex, Intelligent and Software Intensive Systems: 825-829, 2009. O. Ray. Towards a Rational Approach for the Logical Modelling of Inhibition in Metabolic Networks. Proc. 23rd Int. Conf. on Advanced Information Networking and Applications: 918-923, 2009. O. Ray and C. Bryant. Inferring the function of genes from synthetic lethal mutations. Proc. 2nd Int. Conf. on Complex, Intelligent and Software Intensive Systems, IEEE, pp 667-671, 2008. O. Ray and A. Kakas. ProLogICA: a practical system for Abductive Logic Programming. Proc. 11th Int. Workshop on Non-monotonic Reasoning:304-312, 2006. Editorials H. Chang, T. Akutsu, O. Ray, S. Draghici and T. Pai (Guest Eds.). Intelligent Informatics in Translational Medicine. BioMed Research International, Hindawi Publishing Corp., 2016. H. Chang, T. Akutsu, S. Draghici, O. Ray and T. Pai (Guest Eds.). Intelligent Informatics in Translational Medicine. BioMed Research International, Hindawi Publishing Corp., 2015. H. Chang, R. Calogero, S. Draghici, O. Ray and T. Pai (Guest Eds.). Intelligent Informatics in Biomedicine. BioMed Research International, Hindawi Publishing Corp., 2013. PhD Thesis O. Ray. Hybrid Abductive Inductive Learning Department of Computing, Imperial College, University of London, 2005. Project Funding Feb 14 - Feb 15Symbolic Support for Scientific Reasoning in Systems Biology (PI, EPSRC First Grant - £125k) Oct 12 - Oct 15Rethinking the Essence, Flexibility and Reusability of Advanced Model Exploitation (CoI, EPSRC/CHIST-ERA Grant - £500k) Oct 10 - Mar 11Using artificial intelligence to support computer experiments in ocean science (PI, EPSRC Cross-Disciplinary Feasibility Account - £21k) Oct 07 - Oct 12Logical Reasoning and Knowledge Discovery in Bioinformatics (MoU, Japanese National Institute of Informatics) Feb 07 - May 07First-Order Hybrid Abductive Inductive Learning for Bioinformatics (PI, JSPS Postdoctoral Fellowship - £12.5k) Jan 07 - Dec 11Exabyte Informatics Research (PI, RCUK Academic Fellowship - £125k) Invited Talks Conf. of Brit. Assoc. of Lecturers in English for Ac. Purposes (BALEAP) - joint talk with Lisa Hanson (Rebuilding through collaboration; from text to course). Bristol, UK, April, 2017. 24th International Conference on Automated Reasoning with Analytic Tableaux and Related Methods (Tableaux'15) and 10th International Symposium on Frontiers of Combining Systems (FroCoS'15). Wroclaw, Poland, September, 2015. Workshop on Automated Reasoning (ARW'15). Birmingham, UK, April, 2015. The 6th Brist",
  "content_length": 15753,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:35"
}