{
  "name": "Oliver Krancher",
  "homepage": "https://pure.itu.dk/portal/en/persons/oliver-krancher(f14f4742-c9d8-4a34-b8e2-d713c3a1f437).html",
  "status": "success",
  "content": "Oliver Krancher - IT-University of Copenhagen Oliver Krancher Associate Professor Professor, Digital Business Innovation https://orcid.org/0000-0003-3876-3604 Emailolikitudk 20122025 Research activity per year Personal profile CurriculumOliver Krancher is a Full Professor in the Digital Business Innovation Section at the IT University of Copenhagen. His research focuses on digital sourcing, automation, and information systems development. He has published in leading journals in information systems and software engineering, including Journal of Management Information Systems, Journal of the Association for Information Systems, Journal of Strategic Information Systems, Journal of Information Technology, European Journal of Information Systems, MIS Quarterly Executive, Empirical Software Engineering, and Information & Software Technology. He currently serves as an Associate Editor at the Journal of the Association for Information Systems, a Department Editor at Business & Information Systems Engineering, and a Track Chair at international conferences such as the European Conference on Information Systems. His work has been recognized with several awards, including the AIS SIG Sourcing Early and Mid Career Award, the McKinsey Business Technology Award, the ITU Excellence in Teaching Award, the AIS Innovation in Teaching Award, and the TU Dresden Distinguished Scholar Award. Before joining the IT University of Copenhagen, he worked as a consultant at Accenture in Germany and earned his Ph.D. from the University of Bern in Switzerland, where he also held a position as Assistant Professor. He has been a visiting scholar at the Georgia Institute of Technology (USA), the University of Auckland (New Zealand), and the Technical University of Dresden (Germany). External positionsExternal Lecturer, University of Bern1 Aug 2018 → … KeywordsAgileOutsourcingLearningAutomationArtificial intelligenceTeamworkMultisourcingBenefits Managementscaled agileProject managementSoftware development Fingerprint Dive into the research topics where Oliver Krancher is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Multi-source Keyphrases 100% Software Maintenance Keyphrases 80% Information Technology Computer Science 66% Knowledge Transfer Keyphrases 62% Outsourced Projects Keyphrases 58% Schedule Overrun Keyphrases 53% Transition Phase Computer Science 53% Software Project Computer Science 48% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2012 2018 2022 2024 2025 2025 14 Article in proceedings 14 Journal article 9 Book chapter 7 Paper 9 More 4 Conference article 1 Anthology 1 Report 1 Conference abstract for conference 1 Editorial 1 Other contribution Research output per year Research output per year Digital sourcing: A discussion of agential, semiotic, infrastructural, combinatorial, and economic shiftsKrancher, O., Sabherwal, R., Oshri, I. & Kotlarsky, J., 1 Jun 2024, In: Journal of Information Technology. 39, 2, p. 262-269 8 p.Research output: Journal Article or Conference Article in Journal › Editorial Open Access Semiotics 100% Digital Age 100% Economic Shift 100% Agential 100% Information Systems 100% Challenges and design principles for the evaluation of productive AI systems in the public sectorNagbøl, P. R., Krancher, O. & Müller, O., 13 Feb 2024, Research Handbook on Public Management and Artificial Intelligence Research Handbook on Public Management and Artificial Intelligence. Charalabidis, Y., Medaglia, R. & van Noordt, C. (eds.). Edward Elgar, p. 245–262 (Elgar Handbooks in Public Administration and Management).Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open AccessFile Bilateral, collective, or both? Formal governance and performance in multisourcingKrancher, O., Oshri, I., Kotlarsky, J. & Dibbern, J., 2022, In: Journal of the Association for Information Systems (JAIS). p. 1211-1234Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Multi-source 100% Formal Governance 100% Collective Governance 100% Outsourcing 100% Conflict Management 100% Antecedents of psychological safety in agile software development teamsAlami, A., Zahedi, M. & Krancher, O., 27 May 2023, In: Information and Software Technology. 107267.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Agile Software Development 100% Software Teams 100% Psychological Safety 100% Development Team 100% Knowledge-Sharing 100% Key Affordances of Platform-as-a-Service : Self-Organization and Continuous FeedbackKrancher, O., Luther, P. & Jost, M., 2018, In: Journal of Management Information Systems. 35, 3, p. 776-812 37 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Self-organization 100% Continuous Feedback 100% Software Development 100% Software Teams 50% Development Team 42% View all 53 research outputs Projects Projects per year 2022 2022 2024 2025 2028 2 Active 3 Finished Projects per year When AI goes live: Managing AI risks during maintenanceKrancher, O. (PI) & Nagbøl, P. R. (CoI)Danish Business Authority01/05/2022 → 31/10/2024Project: Research Artificial Intelligence 100% AI-based Methods 75% Socio-technical 50% AI Risks 50% Danish 31% Adoption 2.0 - designing a tool for managing enterprise systems adoption and business valueKrancher, O. (PI) & Falch, C. C. (PI)Innovation Fund Denmark01/01/2022 → 31/01/2025Project: Research Business Value 100% Vesta 100% Industrial PhD 100% Enterprise System Implementation 100% Information Systems Adoption 100% ML Project Success: Knowledge Overlap, Iterative Development, and Machine Learning Project SuccessKrancher, O. (PI)Carlsberg Foundation01/12/2024 → 28/02/2025Project: Research Learning Development 100% Iterative Development 100% Project Success 100% Knowledge Overlap 100% Learning System 100% Augmenting Manufacturing Control with AI: Insights from Action Design Research at Novo NordiskKrancher, O. (PI)Innovation Fund Denmark01/01/2025 → 31/08/2028Project: Research Procedural Rationality 100% Shop Floor Management 100% Shop Floor 100% Artificial Intelligence 100% Shop-floor Operators 50% ITOM: IT Operating Models Krancher, O. (PI) & Biangslev, C. S. (PI)Innovation Fund Denmark01/11/2024 → 31/10/2027Project: Research IT Operating Model 100% Operating Model 100% Contextual Factors 35% Organizational Context 18% Infrastructure Support 18% Press/Media Nyt værktøj kan hjælpe os med at bruge kunstig intelligens ansvarligt i vores arbejdeKrancher, O. & Nagbøl, P. R.18/02/20241 Media contributionPress/Media: Press / Media Coronakrisen kan ramme offentlige it-projekterKrancher, O.22/05/20201 Media contributionPress/Media: Press / Media Corona giver it-projekter en mavepuster: Kan ramme budgetter, tidsplaner og produktkvalitetKrancher, O.20/05/20201 Media contributionPress/Media: Press / Media Datasets How psychological safety cultivates behaviors aimed at enhancing software quality in agile teams?Alami, A. (Creator), Zahedi, M. (Creator) & Krancher, O. (Creator), ZENODO, 24 Feb 2024DOI: 10.5281/zenodo.10700529, https://zenodo.org/records/10700529Dataset Prizes AIS Innovation in Teaching AwardKrancher, O. (Recipient), 2015Prize: Prizes, scholarships, distinctions AIS SIG Sourcing Early & Mid Career AwardKrancher, O. (Recipient), 2022Prize: Prizes, scholarships, distinctions Best Associate Editor Award (International Conference on Information Systems)Krancher, O. (Recipient), 2017Prize: Prizes, scholarships, distinctions Best Paper in the Track “IS Design, Development and Project Management” at ICIS 2024Krancher, O. (Recipient), 2024Prize: Prizes, scholarships, distinctions Distinguished Research FellowKrancher, O. (Recipient), 2024Prize: Prizes, scholarships, distinctions View all 11 prizes Activities Activities per year 2021 2023 2024 2025 2025 11 Lecture and oral contribution 2 Membership in review committee 1 Visiting an external academic institution Activities per year Bedre end forventet? Budget og tidsoverskridelser i statslige it-projekterØstergaard Madsen, C. (Speaker) & Krancher, O. (Speaker)9 Oct 2023Activity: Talk or presentation types › Lecture and oral contribution Digital Sourcing: A Discussion of Agential, Semiotic, Infrastructural, Combinatorial, and Economic ShiftsKrancher, O. (Speaker)2024Activity: Talk or presentation types › Lecture and oral contribution En ny silverbullet? Om agile praksisser i vellykkede IT-projekterKrancher, O. (Speaker)9 Oct 2023Activity: Talk or presentation types › Lecture and oral contribution Governance of Predictive Artificial Intelligence: Insights from an Action Design Research StudyKrancher, O. (Speaker)2025Activity: Talk or presentation types › Lecture and oral contribution Hiring committee for recruitment of associate professor in Enterprise and System IT Governance (Event)Pries-Heje, L. (Chair), Krancher, O. (Member) & Andersen, J. V. (Member)1 May 2021 → 31 Dec 2021Activity: Membership types › Membership in review committee View all 14 activities",
  "content_length": 9586,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:35"
}