{
  "name": "Oliver Bimber",
  "homepage": "https://www.jku.at/en/institute-of-computer-graphics/about-us/team/oliver-bimber",
  "status": "success",
  "content": "Oliver Bimber | Institute of Computer Graphics Skip to content (access key: 1) Skip to Search (access key: 2) Univ.-Prof. Dr. Ing. habil. Oliver Bimber Head of the Institute Science Park 3 - 3rd floor - Room 0302 +43 732 2468 6631 oliver.bimber(at)jku.at Curriculum Vitae 2025 Visiting Professor at Free University of Bozen-Bolzano 2024 Visiting Professor at École Polytechnique Fédérale de Lausanne (EPFL) 2023 Visiting Professor at University of Cambridge 2015 Speaker of the Department of Computer Science (JKU) 2009 Appointed to full university professor 2003 - 2010 Junior Professor of Augmented Reality at the Media System Science Department of Bauhaus-University Weimar 2007 Habilitation degree in Computer Science (Informatik) at Munich University of Technology 2002 Ph.D. in Engineering from Darmstadt University of Technology, Germany 2001 - 2002 Senior researcher at the Fraunhofer Center for Research in Computer Graphics in Providence, RI/USA 1998 - 2001 Scientist at the Fraunhofer Institute for Computer Graphics in Rostock, Germany Show More Additional information Bimber co-authored the book \"Displays: Fundamentals and Applications\" (2011, 2016) with Rolf R. Hainich and the book \"Spatial Augmented Reality\" (2005) with Ramesh Raskar (MIT). From 2005 until 2015, he served on the editorial board of the IEEE Computer Magazine. The VIOSO GmbH was founded in his group in 2005. He and his students received several awards for their research and inventions, and have won scientific competitions, such as the ACM Siggraph Student Research Competition (1st place 2006 and 2008, 2nd place 2009 and 2011), and the ACM Student Research Competition Grand Final (2006) that was presented together with the Turing award. Bimber's research interests include AI, visual computing, and optics in the context of next-generation display and imaging technologies. Besides work, he likes cycling and spending as much time as possible with his wife, Melanie, and his dog, Leni. Professional Duties Journals Editorial Board: IEEE Transactions on Visualization and Computer Graphics since 2019 Editorial Board: IEEE Computer (2005-2015) Editorial Board: Computer Graphics Forum since 2011 Editorial Board: Computers & Graphics (2011-2013) Guest Editor: OSA Optics Express, vol. 29. iss. 1, 2021, Virtual feature issue on 3D Image Acquisition and Display: Technology, Perception and Applications Guest Editor: OSA Optics Express, 2021, Special Issue on 3D Image Acquisition and Display Guest Editor: IEEE Computer, vol. 47, no. 7, 2014, Special Issue on Thinking Virtual Guest Editor: IEEE Computer, vol. 46, no. 7, 2013, Special Issue on Visual Analytics Guest Editor: IEEE Computer, vol. 45, no. 7, 2012, Special Issue on What's Real About Augmented Reality Guest Editor: IEEE Computer, vol. 44, no. 7, 2011, Special Issue on Computational Archeology Guest Editor: IEEE Computer, vol. 43 no. 6, 2010, Special Issue on Capturing the World Guest Editor: IEEE Computer, vol. 42, no. 7, 2009, Special Issue on Visual Effects and Beyond Guest Editor: IEEE Computer, vol. 41, no. 10, 2008, Special Issue on Brain-Computer Interfaces Guest Editor: IEEE Computer, vol. 39, no. 8, 2006, Special Issue on Computational Photography Guest Editor: IEEE Computer, vol. 38, no. 8, 2005, Special Issue on Ultimate Display Technologies Guest Editor: Computers and Graphics, vol. 25, no. 5, 2001, Special Issue on Mixed Realities - Beyond Conventions Reviews: Nature, Science, IIEEE Transactions on Visualization and Computer Graphics (TVCG), Presence, Computers and Graphics, Intl. Journal of Computer Vision, IET Optoelectronics Journal, IEEE Computer, IEEE Computer Graphics and Applications, Journal of Imaging Science and Technology, ACM Transactions on Graphics, International Journal of Human-Computer Studies, ... Conferences International Steering Committee: IEEE/ACM International Symposium on Augmented and Mixed Reality since 2007 Poster Co-Chair: Eurographics 2019 General Co-Chair:Austrian Computer Science Day 2016 General Co-Chair: IEEE ProCams 2007 General Co-Chair: IKM Workshop on Computer Vision and Image Processing 2006 Program Co-Chair: IEEE/ACM International Symposium on Augmented and Mixed Reality 2008 (ISMAR'08) Program Co-Chair: IEEE/ACM International Symposium on Augmented and Mixed Reality 2005 (ISMAR'05) Awards Chair: IEEE/ACM International Symposium on Augmented and Mixed Reality 2009 (ISMAR'09) Tutorial Co-Chair: IEEE Virtual Reality 2009 (VR'09) Demo Co-Chair: International Conference on Computer Vision 2009 (ICCV'09) Publication Chair: IEEE/ACM International Symposium on Augmented and Mixed Reality 2004 (ISMAR'04) Area Chair: IEEE/ACM International Symposium on Augmented and Mixed Reality (ISMAR) 2003, 2006, 2007, 2009, 2010 International Program Committee: International Symposium on Visual Computing (ISVC), IEEE/ACM International Symposium on Augmented and Mixed Reality (ISMAR), IEEE International Workshop on Projector-Camera Systems (ProCams), IEEE Virtual Reality (VR), Joint Virtual Reality Conference (JVRC),... Reviews: ACM SIGGRAPH, ACM SIGGRAPH Asia, ACM SIGCHI, EUROGRAPHICS (EG), IEEE Virtual Reality (IEEE VR), Immersive Projection Technology Workshop / Eurographics Workshop on Virtual Environments (IPT/EGVE), IEEE/ACM International Symposium on Augmented and Mixed Reality (ISMAR), ACM Symposium on Virtual Reality Software and Technology (VRST), IEEE ProCams, ... Publications Please click here to see publications. scroll to top Johannes Kepler University Linz Altenberger Straße 69 4040 Linz, Austria T Telephone +43 732 2468 0 Contact Use of cookies Our website uses cookies to ensure you get the best experience on our website, for analytical purposes, to provide social media features, and for targeted advertising. This it is necessary in order to pass information on to respective service providers. If you would like additional information about cookies on this website, please see our data privacy policy . Settings Required cookies These cookies are required to help our website run smoothly. Name Purpose Lifetime Provider CookieConsent This cookie saves your settings about cookie-handling at this website. 1 year JKU Web statistics cookies These cookies help us to continuously improve our services and adapt our website to your needs. We statistically evaluate the pseudonymized data collected from our website. Name Purpose Lifetime Provider _ga This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors. 2 years Google _gid This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the website is doing. The data collected including the number visitors, the source where they have come from, and the pages visited in an anonymous form. 1 day Google _gat_UA-112203476-1 This is a pattern type cookie set by Google Analytics, where the pattern element on the name contains the unique identity number of the account or website it relates to. It appears to be a variation of the _gat cookie which is used to limit the amount of data recorded by Google on high traffic volume websites. 1 minute Google __Secure-ENID Used for Google services. The cookie is primarily used for security and authentication. 13 months Google AEC Is used to prevent unauthorized access and cross-site request forgery (CSRF) attacks. 6 months Google SOCS Is used to save the user's cookie settings. 13 months Google _pk_id This cookie is used to store a few details about the user such as the unique visitor ID. 13 months JKU _pk_ses This cookie is a short lived cookie used to temporarily store data for the visit. 30 minutes JKU _pk_ref This cookie is used to store the attribution information, the referrer initially used to visit the website. 6 months JKU Marketing cookies These cookies help us make our services more attractive to you as well as optimize our advertising and website content. We analyze and evaluate pseudonymised data collected from our website. Name Purpose Lifetime Provider _ga This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors. 2 years Google _gid This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the website is doing. The data collected including the number visitors, the source where they have come from, and the pages visited in an anonymous form. 1 day Google _gcl_au This cookie is used by Google Analytics to understand user interaction with the website. 3 months Google _gac_UA-112203476-1 Contains campaign related information for the user and measures the AdWords campaign success. 90 days Google test_cookie This cookie is set to determine if the website visitor's browser supports cookies. Doesn't contain personal identifier. 15 minutes Google IDE This cookie carries out information about how the end user uses the website and any advertising that the end user may have seen before visiting the said website. 1 year Google _gcl_aw This cookie is set when a user clicks an ad to reach our website. It informs about the success of campaigns and allows to connect ads to conversion targets. 3 months Google AMCV_xx This is a pattern type cookie name associated with Adobe Marketing Cloud. It stores a unique visitor identifier, and uses an organisation identifier to allow a company to track users across their domains and services. 3 years LinkedIn bcookie Contains a browser ID. 2 years LinkedIn bscookie Contains a browser ID for a secure connection.",
  "content_length": 11965,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:31"
}