{
  "name": "Oliver Schneider 0006",
  "homepage": "http://oliverschneider.ca",
  "status": "success",
  "content": "Welcome to the Haptic Experience Lab | Haptic Experience Lab | University of Waterloo Skip to main content Welcome to the Haptic Experience Lab RecHap: An Interactive Recommender System for Navigating a Large Number of Mid-Air Haptic Designs (ToH '23) Factors of Haptic Experience across Multiple Haptic Modalities (CHI '23) Scrappy Using Scrap Material as Infill To Make Fabrication More Sustainable (CHI '21) Juicy Haptic Design Vibrotactile Embellishments Can Improve Player Experience in Games (CHI '21) Defining Haptic Experience (HX) Drawing insights from haptic novices and expert hapticians, we defined Haptic Experience (HX) and offer a model of its pragmatic and hedonic qualities (CHI '20 Honourable Mention) Novice Haptician Design We studied novice hapticians - engineers and designers with limited haptics expertise - to improve our understanding of haptic experience design (Transactions on Haptics '20) Comfort and anxiety in autonomous vehicles We investigated how comfortable or anxious people were when riding in an autonomous vehicle, connecting physiological measures like heart rate to the car's driving style (CHI '20) Haptic Experience Design (HaXD) Haptic Experience Design (HaXD), the process of designing for touch, is extremely challenging but poorly understood. We interviewed professional hapticians to develop a first description of HaXD and identify critical barriers. Play banner slideshow play Pause banner slideshow pause The Haptic Experience (HX) Lab at the University of Waterloo is group of researchers combining the fields of Human-Computer Interaction and Haptics. Haptic technology engages the sense of touch by providing physical feedback to users. Our lab focuses on what we call HX Research. We study the design, study, and evaluation of complete haptic systems, with a drive towards studying these systems in-depth and at scale. As part of this work, we build software and conceptual tools for HX design and research to enable anyone, anywhere to be able to work with haptic technology just like it's other media. Without these tools, haptic technology will be limited to small, in-lab studies and slow deployment into commercial applications, and haptics will provide benefits for a select few. Our long-term goal is a suite of haptic computing tools to assist the creation, deployment, and study of haptic technology, which we will use to conduct cutting-edge research into haptics. We are highly interdisciplinary spanning Faculties across the university, from Engineering to Arts. News News Saturday, April 26, 2025 HX Lab @ CHI 2025 The HX Lab will be presenting three papers at CHI 2025 in Yokohama, Japan. Come see Ludwig Wall, Tianzheng Shi, and Tor-Salve Dalsgaard as they present their work! Wednesday, April 16, 2025 Honourable Mention at CHI Congratulations to Ludwig Wall for his honourable mention at CHI’25! Ludwig and his co-authors (Dan Vogel and Oliver Schneider) received an honourable mention for their paper, \"Intermittent Interaction in Digital Fabrication: User Perception of Periodic Intervention in Semi-Automated Creation Tasks\". If you're at CHI'25, you can catch Ludwig's talk on Wednesday, April 30 at 4:20pm in the Fabrication and Interactive Tools session. Wednesday, March 26, 2025 Two papers accepted to CHI 2025! Congratulations to Ludwig Wall and Tianzheng Shi, who will be presenting their work at CHI 2025 in Yokohama! Ludwig will present his work titled \"Intermittent Interaction: User Perception of Periodic Intervention in Semi-Automated Creation Tasks\", by Ludwig Wall, Oliver Schneider, and Dan Vogel. Tianzheng will present his work titled \"Development and Initial Validation of the Haptic Experience Inventory (HXI)\", by Tianzheng Shi and Oliver Schneider. See you in Yokohama! Read all news",
  "content_length": 3781,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:36"
}