{
  "name": "Oliver Matias van Kaick",
  "homepage": "http://people.scs.carleton.ca/~olivervankaick",
  "status": "success",
  "content": "Oliver van Kaick's home page Oliver van Kaick's home page Home News Publications Service People Teaching Miscellaneous About myself I am an associate professor at the School of Computer Science at Carleton University in Ottawa, Canada. I am also a member of the Graphics, Imaging, and Games Lab. I completed my PhD in computing science at Simon Fraser University, Canada, and was a postdoc at Simon Fraser University and Tel Aviv University, Israel, the latter as an Azrieli fellow. Before my PhD, I got a B.Sc. and M.Sc. from the Federal University of Paraná, Brazil. Research interests I am interested in computer graphics and, more specifically, in the analysis, creation, and manipulation of shapes, especially 3D objects. The problems that I work on are part of areas commonly called geometric modeling and processing and shape analysis. In my work, I have focused on solutions to problems such as shape segmentation (decomposing a shape into meaningful parts), shape correspondence (computing a mapping between portions of two or more shapes), and shape similarity estimation (quantifying how similar shapes are). In general, I am interested in the use of analysis techniques for learning about the essence of shapes, including their geometry, topology, structure, part composition, relations between parts, and functionality. These analysis techniques are precursors to applications such as shape synthesis, editing and understanding, which are of interest in diverse areas, including 3D content creation, computer animation, game development, and medical imaging. The methods developed to perform such analysis often involve a combination of geometric data analysis, optimization, and machine learning. Prospective students I am looking for talented students to join my group. If you are interested in working with me, please read this page before contacting me. Timeline (past) Sabbatical from July 2020 to June 2021. I visited the University of Tokyo and worked with Prof. Hiroyuki Shinoda and Prof. Takeo Igarashi from February to July 2021. Assistant professor (September 2014 - June 2019) School of Computer Science at Carleton University in Ottawa, Canada. Postdoctoral researcher (April 2013 - July 2014) Blavatnik School of Computer Science at Tel Aviv University, under the supervision of Daniel Cohen-Or. I was supported by an Azrieli Fellowship. Postdoctoral researcher (December 2011 - December 2012) Under a MITACS Elevate Postdoc Fellowship at the School of Computing Science, at Simon Fraser University, with the industrial partner PDFTron Inc. My supervisor at SFU was Hao (Richard) Zhang. PhD in Computing Science (September 2005 - November 2011) School of Computing Science, Faculty of Applied Sciences, Simon Fraser University, Burnaby, BC, Canada. My supervisors were Hao (Richard) Zhang and Ghassan Hamarneh. I was affiliated with the GrUVi Lab and the Medical Image Analysis Lab. M.Sc. in Computer Science (2003-2005) Computer Science Department Federal University of Parana, Curitiba, PR, Brazil My supervisor was Hélio Pedrini. B.Sc. in Computer Science (1999-2003) Computer Science Department Federal University of Parana, Curitiba, PR, Brazil Contact E-mail: Oliver.vanKaick at carleton dot ca Mailing address: School of Computer Science Carleton University 5302 Herzberg Building, 1125 Colonel By Drive Ottawa, ON, K1S 5B6, Canada Phone: +1 (613) 520-4333 (computer science front office) Last update: September 4, 2025.",
  "content_length": 3454,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:34"
}