{
  "name": "Oliver Bringmann 0001",
  "homepage": "https://www.embedded.uni-tuebingen.de/team/oliver-bringmann",
  "status": "success",
  "content": "Prof. Dr. Oliver Bringmann | Universität Tübingen Prof. Dr. Oliver Bringmann Prof. Dr. Oliver Bringmann Universität Tübingen Fachbereich Informatik Lehrstuhl Eingebettete Systeme Sand 13 72076 Tübingen Telefon+49 - (0) 70 71 - 29 - 77348 Telefax+49 - (0) 70 71 - 29 - 50 62 E-Mail Mail BüroSand 13, B207 SprechstundeMontag 15:00 - 16:00 Publikationen auf Google Scholar Inhalt Forschungsprojekte Veröffentlichungen Lehre Abschlussarbeiten Aktuelles Prof. Dr. Oliver Bringmann leitet den Lehrstuhl für Eingebettete Systeme an der Universität Tübingen und ist Mitglied des Direktoriums am FZI Forschungszentrum Informatik. Von 2014-2020 war er stellv. Sprecher und von 2020-2022 Sprecher des Fachbereichs Informatik an der Universität Tübingen. Er studierte Informatik an der Universität Karlsruhe (KIT) und hat an der Universität Tübingen 2001 in Informatik promoviert. Bis 2012 war er am FZI Forschungszentrum Informatik in Karlsruhe tätig, zunächst als Abteilungsleiter der Forschungsgruppe “Systementwurf in der Mikroelektronik” und später als Leiter des Forschungsbereichs “Intelligent Systems and Production Engineering” sowie als Mitglied des FZI Management Boards. Der Lehrstuhl für Eingebettete Systeme befasst sich mit dem Entwurf, der Analyse und der Verifikation von verteilten Eingebetteten Systemen und Systems-on-Chip und deren Anwendung in den Bereichen Automotive, Internet-of-Things (IoT) und der Medizintechnik. Die Forschungsschwerpunkte liegen in den Bereichen Entwurfsautomatisierung mikroelektronischer Systeme (EDA), Eingebettete Softwaresysteme, Energieeffiziente KI-Architekturen, Hardware/Software-Codesign für KI-Systeme und robuste Wahrnehmung unter Umgebungsvariationen. Forschungsinteressen Eingebettete Softwaresysteme Analyse von Performanz, Power und Energiebedarf Generierung Timing/Power-vorhersagbarer Software Hardware/Software-Evaluierung zur technischen Machbarkeitsanalyse Architekturentwurf: von der Systemebene bis zum Tapeout Energieeffiziente KI-Architekturen („Edge AI“) Architekturbewertung & Technologieprojektion Hardware-gestützte Security-Architekturen Hardware/Software-Codesign für KI-Systeme Generierung maßgeschneiderter KI-Rechenbeschleuniger Ressourcen- und energieeffizientes Maschinelles Lernen Hardware-spezifische Optimierungen künstlicher neuronaler Netze Robuste Wahrnehmung in cyber-physischen Systemen Modellierung/Simulation von Umgebungsbedingungen Sensor- (Video, Radar) und Kommunikationsmodelle Robustes maschinelles Lernen unter Umgebungsvariationen Community Service Member of the Executive Committee of the IEEE/ACM Conference Design, Automation and Test in Europe (D.A.T.E.) Chair Special Day e-Mobility, 2012; Interactive Presentations Chair, 2012, 2013, 2014, 2015, 2016. Topic Chair at IEEE/ACM Conference Design, Automation and Test in Europe (D.A.T.E.), Topic E4 “Embedded Software Architectures”, 2011, 2012, 2013, 2014. Technical Program Committee Member at IEEE/ACM Conference Design, Automation and Test in Europe (D.A.T.E.), 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018. Technical Program Committee Member at ACM/EDAC/IEEE Design Automation Conference (DAC), 2016, 2017, 2018. Topic Chair at IEEE/ACM International Conference on Hardware-Software Codesign and System Synthesis (CODES+ISSS), 2011. Technical Program Committee Member at IEEE/ACM International Conference on Hardware-Software Codesign and System Synthesis (CODES+ISSS), 2009, 2010, 2011, 2012, 2014, 2015, 2016, 2017, 2018. Technical Program Committee Member at IEEE/ACM International Conference on Compilers, Architectures, and Synthesis for Embedded Systems (CASES), 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018. Technical Program Committee Member at IEEE/ACM International Symposium on VLSI (ISVLSI), 2012. Technical Program Committee Member at IEEE International Conference on Networking, Architecture, and Storage (NAS), 2010, 2011, 2012. Member of the Steering Committee at GMM/GI/ITG-Fachtagung Zuverlässigkeit und Entwurf, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015. Program Chair at GMM/ITG/GI-Workshop Cyber-Physical Systems - Enabling Multi-Nature Systems (CPMNS), 2011, 2012. Program Chair at ITG/GI/GMM-Workshops Multi-Nature Systems: Entwicklung von Systemen mit elektronischen und nichtelektronischen Komponenten, 2007, 2009. Technical Program Committee Member at edaWorkshop 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016. Technical Program Committee Member at ITG/GMM/GI-Workshops Methoden und Beschreibungs-sprachen zur Modellierung und Verifikation von Schaltungen und Systemen, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018. Technical Program Committee Member at GI/ITG/GMA Workshops “Dependability and Fault Tolerance” associated to ARCS, 2009. Technical Program Committee Member at IEEE International Conference on Parallel Computing in Electrical Engineering (PARELEC) 2004, 2006, 2008, 2011. Member of the Steering Committee of the GI-Fachbereich Technische Informatik Member of the Steering Committee of Fachausschuss Rechnergestützter Schaltungs- und Systementwurf (RSS). Chair of the Steering Committee of the special interest group “Allgemeine Methodik und Unterstützung von Entwurfsprozessen für Schaltungen und Systeme” der Kooperationsgemeinschaft Rechnergestützter Schaltungs- und Systementwurf (RSS). Member of the Steering Committee of the special interest group “Beschreibungssprachen und Modellierung von Schaltungen und Systemen” der Kooperationsgemeinschaft Rechnergestützter Schaltungs- und Systementwurf (RSS). Member of the EUREKA CATRENE EDA Roadmap committee: responsible for chapter “Embedded Software and ESL to RTL”, 2008/2009. Veröffentlichungen 2025 Advancing Video Capsule Endoscopy with Edge AI: A Public Multi-Center Capsule Dataset with Multi-Label Annotations by M Le Floch, J Werner, L Mcintyre, F Wolf, J Steinhäuser, J Hampe, R Langanke, S Kirk, C Stopp, ME Geissler, and others In Endoscopy 57(S 02): MP061. Georg Thieme Verlag KG, 2025. Seeing More with Less: Video Capsule Endoscopy with Multi-Task Learning by Julia Werner, Oliver Bause, Julius Oexle, Maxime Le Floch, Franz Brinkmann, Jochen Hampe, and Oliver Bringmann In 2025 Applications of Medical AI (AMAI) at MICCAI25, 2025. Systematic Hardware Integration Testing for Smart Video-based Medical Device Prototypes by Oliver Bause, Julia Werner, and Oliver Bringmann In 2025 47th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC2025), 2025. Smart Video Capsule Endoscopy: Raw Image-Based Localization for Enhanced GI Tract Investigation by Oliver Bause*, Julia Werner*, Paul Palomero Bernardo, and Oliver Bringmann (*Equal Contribution) In 2025 32nd International Conference on Neural Information Processing (ICONIP) - Nominated for the Best Paper Award, 2025. Criticality Metrics for Relevance Classification in Safety Evaluation of Object Detection in Automated Driving by Jörg Gamerdinger, Sven Teufel, Stephan Amann, and Oliver Bringmann In 2025 19th IEEE International Conference on Vehicular Electronics and Safety (ICVES 2025), 2025. S2S-Net: Addressing the Domain Gap of Heterogeneous Sensor Systems in LiDAR-Based Collective Perception by Sven Teufel, Jörg Gamerdinger, and Oliver Bringmann In 2025 19th IEEE International Conference on Vehicular Electronics and Safety (ICVES 2025), 2025. Enhanced Anomaly Detection for Capsule Endoscopy Using Ensemble Learning Strategies by Julia Werner, Christoph Gerum, Jörg Nick, Maxime Le Floch, Franz Brinkmann, Jochen Hampe, and Oliver Bringmann In 2025 47th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC), 2025. CarlaNCAP: A Framework for Quantifying the Safety of Vulnerable Road Users in Infrastructure-Assisted Collective Perception Using EuroNCAP Scenarios by Jörg Gamerdinger, Sven Teufel, Simon Roller, and Oliver Bringmann In 2025 IEEE 101st Vehicular Technology Conference:(VTC2025-Spring), 2025. Virtual KITTI NextGen: Procedural Environment Reconstruction for Test Coverage Expansion of Connected and Autonomous Vehicles by Patrick Schulz, Pascal Zwick, Jörg Gamerdinger, Sebastian Reiter, Alexander Viehl, and Oliver Bringmann In 2025 IEEE International Automated Vehicle Validation Conference (IEEE IAVVC 2025), 2025. SnowyLane: Robust Lane Detection on Snow-covered Rural Roads Using Infrastructural Elements by Jörg Gamerdinger, Benedict Wetzel, Patrick Schulz, Sven Teufel, and Oliver Bringmann In 2025 IEEE Intelligent Transportation Systems Conference (IEEE ITSC 2025), 2025. Datasets for Lane Detection in Autonomous Driving: A Comprehensive Review by Jörg Gamerdinger, Sven Teufel, and Oliver Bringmann In arxiv preprint, 2025. Automatic Generation of Fast and Accurate Performance Models for Deep Neural Network Accelerators by Konstantin Lübeck, Alexander Louis-Ferdinand Jung, Felix Wedlich, Mika Markus Müller, Federico Nicolás Peccia, Felix Thömmes, Jannik Steinmetz, Valentin Biermaier, Adrian Frischknecht, Paul Palomero Bernardo, and Oliver Bringmann In ACM Trans. Embed. Comput. Syst. 24(2). Association for Computing Machinery, 2025. Keywords: Deep neural networks, performance estimation, analytical model Compiler-aware AI Hardware Design for Edge Devices by Paul Palomero Bernardo, Patrick Schmid, Christoph Gerum, and Oliver Bringmann In Proceedings of the 8th International Workshop on Edge Systems, Analytics and Networking, pages 31–36. Association for Computing Machinery, 2025. Keywords: edge computing, hardware accelerator, deep learning compiler A Hardware-assisted Approach for Non-invasive and Fine-grained Memory Power Management in MCUs by Michael Kuhn, Patrick Schmid, and Oliver Bringmann In 2025 Design, Automation & Test in Europe Conference (DATE), 2025. Keywords: Computer architecture, Embedded Systems, Energy efficiency, Low-power electronics, Memory architecture It’s all about PR – Smart Benchmarking",
  "content_length": 117485,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:32"
}