{
  "name": "Oliver Kramer 0001",
  "homepage": "https://uol.de/en/computingscience/ci/team/oliver-kramer",
  "status": "success",
  "content": "Oliver Kramer // University of Oldenburg School II Department of Computing Science Computational Intelligence Lab Oliver Kramer Prof. Dr. Oliver Kramer Carl v. Ossietzky University of Oldenburg 26111 Oldenburg oliver.kramer@uol.de A5 2-231 Oliver Kramer Prof. Dr. Oliver KramerHead of Computational Intelligence Lab Room: A5-2-231E-Mail: oliver.kramer@uol.deGoogleScholar, DBLP, GitHub, ResearchGate, LinkedIn,TowardsDataScience, ResearchGatePrivate: Beatport, Spotify CV Oliver Kramer studied computer science at the University of Bielefeld and TU Dortmund, completing his degree in 2003 and earning a PhD in Artificial Intelligence from the University of Paderborn in 2008 in the Wissensbasierte Systeme Group of Hans Kleine Büning in the International Graduate School of Dynamic Intelligent Systems. After postdoctoral research at the Computational Intelligence Group of Günter Rudolph of the TU Dortmund and Algorithms Group of Richard Karp at ICSI Berkeley, he became a Junior Professor for Stochastics and Optimization at the Institute of Structural Mechanics at Bauhaus University Weimar in 2011. In 2013, he completed his habilitation at the University of Oldenburg. Since 2017, he has been a Professor of Computational Intelligence at the Carl von Ossietzky University of Oldenburg, where he represents his field in research and teaching. Teaching Bachelor's Program in Computer ScienceLecture: Introduction to Artificial Intelligence (inf530)Proseminar: Genetic Algorithms (inf800) Master’s Program in Computer ScienceLecture: Evolution Strategies (inf535)Lecture: Deep Learning (inf536) Responsible for the Specialization in Artificial Intelligence in the Master’s Program in Computer Science Books Selected Recent Publications 2025Oliver Kramer, Jill Baumann: Unlocking Structured Thinking in Language Models with Cognitive Prompting. ESANN 20252024Jill Baumann, Oliver Kramer: LLaMA Tunes CMA-ES. ESANN 2024Jill Baumann, Oliver Kramer: Towards Explainable Evolution Strategies with Large Language Models. ESANN 2024Jill Baumann, Oliver Kramer: Evolutionary Multi-objective Optimization of Large Language Model Prompts for Balancing Sentiments. EvoApplications@EvoStar 2024: 212-224Jill Baumann, Oliver Kramer: Evolutionary Multi-Objective Optimization of Large Language Model Prompts for Balancing Sentiments. CoRR abs/2401.09862 (2024)Oliver Kramer: Large Language Models for Tuning Evolution Strategies. CoRR abs/2405.10999 (2024)Jill Baumann, Oliver Kramer: Towards Explainable Evolution Strategies with Large Language Models. CoRR abs/2407.08331 (2024)Oliver Kramer, Jill Baumann: Unlocking Structured Thinking in Language Models with Cognitive Prompting. CoRR abs/2410.02953 (2024)2023Oliver Kramer: Enhancing Evolution Strategies with Evolution Path Bias. ESANN 2023Oliver Kramer, Jill Baumann: Wind Power Prediction with ETSformer. ESANN 20232022Oliver Kramer: A Fast and Simple Evolution Strategy with Covariance Matrix Estimation. ESANN 2022Tim Cofala, Oliver Kramer: An Evolutionary Fragment-Based Approach to Molecular Fingerprint Reconstruction. GECCO 2022: 1156-11632021Patrick Burke, Jonas Prellberg, Oliver Kramer: Evolutionary Deep Multi-Task Learning. ESANN 2021Tim Cofala, Oliver Kramer: Transformers for Molecular Graph Generation. ESANN 2021Tim Cofala, Thomas Teusch, Oliver Kramer: Spatial Generation of Molecules with Transformers. IJCNN 2021: 1-72020Oliver Kramer: Learning Step Size Adaptation in Evolution Strategies. ESANN 2020: 435-440Nils Worzyk, Stefan Niewerth, Oliver Kramer: Adversarials-1 in Speech Recognition: Detection and Defence. ESANN 2020: 619-624Stefan Oehmcke, Thomas Teusch, Thorben Petersen, Thorsten Klüner, Oliver Kramer:Modeling H2O/Rutile-TiO2(110) Potential Energy Surfaces with Deep Networks. IJCNN 2020: 1-7Jonas Prellberg, Oliver Kramer: Learned Weight Sharing for Deep Multi-Task Learning by Natural Evolution Strategy and Stochastic Gradient Descent. IJCNN 2020: 1-8Lars Elend, Sebastian A. Tideman, Kerstin Lopatta, Oliver Kramer: Earnings Prediction with Deep Learning. KI 2020: 267-274Tim Cofala, Lars Elend, Philip Mirbach, Jonas Prellberg, Thomas Teusch, Oliver Kramer: Evolutionary Multi-objective Design of SARS-CoV-2 Protease Inhibitor Candidates. PPSN (2) 2020: 357-371 Oliver Kramer (Changed: 19 Feb 2025) |  Kurz-URL:Shortlink: https://uol.de/p111590en Zum Seitananfang scrollen Scroll to the top of the page",
  "content_length": 4386,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:33"
}