{
  "name": "Oliver Schulte",
  "homepage": "http://www.cs.sfu.ca/~oschulte",
  "status": "success",
  "content": "Oliver Schulte Simon Fraser University sfu.ca Burnaby Surrey Vancouver Home Contact C.V. Blog About Me Teaching Research Papers Talks Theorems SSS: Software Database Pointers Prospective Students Graduate Students Graduate Funding Possible Thesis Topics Undergraduate Students Undergraduate Funding Previous Lives My Youth in Chess Philosophy Miscellaneous NSF Project Ockham's Razor Learning Theory Adventures in Administration Oliver Schulte Professor School of Computing Science Simon Fraser University Burnaby, B.C. V5A 1S6 Canada Phone: +1-778-782-3390 Fax: +1-778-782-3045 Machine Learning for Structured Data Learning Theory Computational Game Theory Ph.D.: 1997, Carnegie Mellon University, Logic and Computation M.Sc.: 1993, Carnegie Mellon University, Logic and Computation B.Sc.: 1992, University of Toronto, Computing Science. Affiliations Director Structured Machine Learning Lab Associate Member Department of Statistics Member of the VINCI institute Member of SFU Sports Analytics Group Noteworthy Events This fall I'm teaching a course on Fintech and AI. You can see my tentative course material. Requires OneNote. Here's the course schedule in pdf. You can access the course home page, available also from here, look for 983 X1. I'm looking for a new MSc student. Began a three-year term as department chair in September 2024. I've started a blog on being a computer science department chair. Mainly reflections on academic administration, a bit about my personal experience. Check out my talk on when causal reasoning should be used in reinforcement learning. Thank you to UBC CAIDA for hosting. Our repository of relational databases, known as the Prague Relational Learning Repository, is back in Prague (Port 3306, username=guest,pwd=ctu-relational). Thank you to getML for hosting and migrating the server during its exile from Prague. Our repository of relational databases is getting more and more users. (I know because people email me when it's down.) Here is a blog post discussing it. I gave a keynote on hockey analytics at LINHAC 2022, here are the talk and slides. Series on Reinforcement Learning. On reinforcement learning for sports analytics. I gave a brief talk in the Aggregate Intellect Science Series on Reinforcement Learning. On reinforcement learning for sports analytics. Director Sliq Lab (ended 2022). for Predictive Analytics. I have started work as the founding director for a research lab on predictive analytics, that is part of SportLogiq. Strategic Project award. I was the PI on a partnership award from the Natural Sciences and Engineering Research Council of Canada, totalling over $500K for 3 years. The success rate is 20%. Our company partner is SportLogiq. My co-applicants are Greg Mori and Pascal Poupart. Best paper award from the StarAI@IJCAI workshop for the contribution from Manfred Jaeger and myself. The paper discusses how inference and learning for relational network data depends on the population size (node size). NSERC Discovery and Accelerator award. The Natural Sciences and Engineering Research Council of Canada has renewed my operating grant and given me a bonus award. The Accelerator awards aim to provide substantial and timely additional resources to accelerate progress and maximize the impact of outstanding research programs. SFU News and Faculty of Applied Sciences News published an article about our paper at MIT Sloan conference. We said that Erik Karlsson was the best player in the 2015-2016 NHL season and hasn't he been great in 2016-17? My undergraduate RA and coauthor Zeyu Zhao has won the Dean's convocation medal for the Faculty of Applies Sciences. Next he'll be entering the M.Sc. Program at Harvard. Check out my tutorial in learning Bayesian networks for complex relational data . Presented at AAAI 2017, ECML 2016 and Canadian AI 2015. The faculty of Applied Sciences has made a video about some of my research on hockey analytics. I must learn to keep my eyes open while I talk. I co-organized the Vancouver Hockey Analytics Conferences in 2016 , 2017 , and 2018 . You can see the 2016 presentations on-line. I especially recommend the media panel. #vanhac was hashtag number 4 in Canada on the day of the conference! The 2018 conference was sponsored by SFU's Big Data Hub. Fatemeh Riahi received the best student paper award at the IEEE Symposium on Computational Intelligence for her paper \"Model-based Outlier Detection for Object-Relational Data\" Kurt Routley received an award for the best Canadian AI Master's Thesis of 2015 from the Canadian Artificial Intelligence Association. The IJCAI conference gave me a blue ribbon for my service on the Senior Program Committee 2016. The CTU Prague Relational Learning Repository is live now. It contains over 80 relational datasets for learning. I developed this together with Jan Motl. Here's a write-up of what you can find in it, including how to connect to the database server.",
  "content_length": 4935,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:37"
}