{
  "name": "Oliver Cossairt",
  "homepage": "http://compphotolab.northwestern.edu",
  "status": "success",
  "content": "Comp Photo Lab Home - Comp Photo Lab Home About Projects People Publications Links Snapshot 3D multifocal light field microscopy New paper on fusing high resolution images with high speed events A new image + event fusion framework for high speed video synthesis A novel action recognition system that conceals the appearance. Tracking, accelerating and recovering phase information for micro-organisms on a chip. SAVI: Synthetic Apertures for Visible Imaging Subsampled Phase Retrieval for Lens-free On-chip Video Our Streamlined Photometric Stereo Framework for Cultural Heritage Coherent camera arrays for high-resolution imaging of distant objects (e.g. faces 1000 meters away) Ultra-Miniature Diffraction Gratings for Lensless Imaging High-Speed Compressive Video Gauguin: Surface Shape Studies of the Art of Paul Gauguin MC3D: Motion Contrast 3D Laser Scanner Gigapixel Computational Imaging We are building a new breed of cameras with increased functionality and performance that will transform the way cameras are built in coming decades, from low-end consumer imagers to high-end scientific instruments. Our research is in the emerging field of computational photography, which combines expertise in optics, image processing, computer vision, and computer graphics. We design, model and build systems that combine sensors, displays, and novel optical elements. The Computational Photography Lab is led by Prof. Oliver Cossairt, Associate Professor in the Department of Electrical Engineering and Computer Science at Northwestern University. Recent Projects Wavefront Imaging Sensor with High Resolution and Depth Ranging Yicheng Wu*, Fengqiang Li*, Florian Willomitzer, Ashok Veeraraghavan, Oliver Cossairt View project Snapshot multifocal light field microscopy Kuan He, Xiaolei Wang, Zihao W. Wang, Hannah Yi, Norbert F. Scherer, Aggelos K. Katsaggelos, and Oliver Cossairt. View project Guided Event Filtering, CVPR 2020 Zihao W. Wang, Peiqi Duan, Oliver Cossairt, Aggelos K. Katsaggelos, Tiejun Huang, and Boxin Shi View project Event-driven Video Frame Synthesis Zihao W. Wang, Weixin Jiang, Kuan He, Boxin Shi, Aggelos Katsaggelos, Oliver Cossairt View project Recent Posts One paper accepted to CVPR’20, on event-based imaging Apr 22, 2020 Read More New paper on event-based high-speed video synthesis appears at PBDL’19 (ICCV Workshop) Sep 25, 2019 Read More Privacy paper presented at CV-COPS’19 (CVPR Workshop) Sep 25, 2019 Read More Rare Mummy Portraits Offer Peek into the Past at Block Museum Apr 4, 2018 Read More Collaborators Funding © 2025 Comp Photo Lab All Rights Reserved. Theme by Theme Trust",
  "content_length": 2622,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:32"
}