{
  "name": "Oliver E. Theel",
  "homepage": "https://uol.de/svs/personen/oliver-theel",
  "status": "success",
  "content": "Oliver Theel // Universität Oldenburg Fk. II Department für Informatik Systemsoftware und verteilte Systeme Oliver Theel Prof. Dr.-Ing. Oliver Theel Carl von Ossietzky Universität Oldenburg Fakultät II  Department für Informatik Abteilung Systemsoftware und verteilte Systeme D-26111 Oldenburg +49 441 798-2364 +49 441 798-2756 Theel@Informatik.Uni-Oldenburg.DE Sekretariat: Meike Burke Regina Knippenberg +49 (0) 441 - 798 2855 +49 (0) 441 - 798 2756 A04 2-226 Meike.Burke@uni-oldenburg.de Regina.Knippenberg@uni-oldenburg.de Oliver Theel Kontaktinformationen Postadresse  Carl v. Ossietzky Universität Fakultät II, Department für Informatik Oldenburg, Niedersachsen 26111 Germany Telefon +49 441 798 2364 Fax +49 441 798 2756 Email Theel@Informatik.Uni-Oldenburg.DE [inproceedings] bibtex O. Theel, \"Rapid Replication Scheme Design using General Structured Voting\" in Proc. of the 17th Annual Computer Science Conference, Christchurch, New Zealand, 1994. @INPROCEEDINGS{The94:rrs, author = {Oliver Theel}, title = {{Rapid Replication Scheme Design using General Structured Voting}}, booktitle = {of the 17th Annual Computer Science Conference, Christchurch, New Zealand}, year = {1994}, pages = {669--677}, month = {January}, note = {ISBN 0-473-02313-X}, } Kopieren [inproceedings] bibtex B. Freisleben, H. Koch, und O. Theel, \"Designing Multi-Level Quorum Schemes for Highly Replicated Data\" in Proc. of the 1991 Pacific Rim International Symposium on Fault Tolerant Systems, Kyoto, Japan, 1991. @INPROCEEDINGS{FKT91:dmq, author = {Bernd Freisleben and Hans-Henning Koch and Oliver Theel}, title = {{Designing Multi-Level Quorum Schemes for Highly Replicated Data}}, booktitle = {of the 1991 Pacific Rim International Symposium on Fault Tolerant Systems, Kyoto, Japan}, year = {1991}, pages = {154--159}, month = {September}, organization = {IEEE}, } Kopieren [inproceedings] bibtex B. Freisleben, H. Koch, und O. Theel, \"The Electoral District Strategy for Replicated Data in Distributed Systems\" in Proc. of the 5th International Conference of Fault-Tolerant Computing Systems, Nuremberg, Germany, 1991. @INPROCEEDINGS{FKT91:eds, author = {Bernd Freisleben and Hans-Henning Koch and Oliver Theel}, title = {{The Electoral District Strategy for Replicated Data in Distributed Systems}}, booktitle = {of the 5th International Conference of Fault-Tolerant Computing Systems, Nuremberg, Germany}, year = {1991}, pages = {100--111}, month = {September}, organization = {IEEE}, } Kopieren [inproceedings] bibtex B. Freisleben, H. Koch, und O. Theel, \"Replication Management in Large Networks\" in Proc. of the 16th Annual Conference on Local Computer Networks, Minneapolis, MN, 1991. @INPROCEEDINGS{FKT91:rml, author = {Bernd Freisleben and Hans-Henning Koch and Oliver Theel}, title = {{Replication Management in Large Networks}}, booktitle = {of the 16th Annual Conference on Local Computer Networks, Minneapolis, MN}, year = {1991}, pages = {629--637}, month = {September}, organization = {IEEE}, } Kopieren [article] bibtex B. Freisleben, H. Koch, und O. Theel, \"Designing Multi-Level Quorum Schemes for Highly Replicated Data (Extended version)\" IEICE Transactions on Information and Systems, vol. E75-D, iss. 6. 1992. @ARTICLE{FKT92:dml, author = {Bernd Freisleben and Hans-Henning Koch and Oliver Theel}, title = {{Designing Multi-Level Quorum Schemes for Highly Replicated Data (Extended version)}}, journal = {IEICE Transactions on Information and Systems}, year = {1992}, volume = {E75-D}, pages = {763--770}, number = {6} } Kopieren [inproceedings] bibtex B. Freisleben, H. Koch, und O. Theel, \"Providing Low Cost Read Access to Replicated Data with Multi--Level Voting\" in Proc. of the 4th International Conference on Information Networks and Data Communication (INDC'92), Helsinki, Finland, 1992. @INPROCEEDINGS{FKT92:plc, author = {Bernd Freisleben and Hans-Henning Koch and Oliver Theel}, title = {{Providing Low Cost Read Access to Replicated Data with Multi--Level Voting}}, booktitle = {of the 4th International Conference on Information Networks and Data Communication (INDC'92), Helsinki, Finland}, year = {1992}, pages = {357--376}, month = {March}, organization = {IFIP}, } Kopieren [phdthesis] bibtex O. E. Theel, \"Ein vereinheitlichendes Konzept zur Konstruktion hochverfügbarer Dienste (in German)\" PhD Thesis , 1993. @PHDTHESIS{The93:diss, author = {Oliver E. Theel}, title = {{Ein vereinheitlichendes Konzept zur Konstruktion hochverf{\\\"u}gbarer Dienste (in German)}}, school = {Darmstadt University of Technology, Department of Computer Science, Germany}, year = {1993}, pages = {I-IX, 1-209} } Kopieren [inproceedings] bibtex O. Theel, \"A General Framework for Modelling Data Replication Schemes\" in Proc. of the International Workshop on Modelling, Analysis and Simulation of Computer and Telecommunication Systems MASCOTS'93, San Diego, CA, 1993. @INPROCEEDINGS{The93:gfm, author = {Oliver Theel}, title = {{A General Framework for Modelling Data Replication Schemes}}, booktitle = {of the International Workshop on Modelling, Analysis and Simulation of Computer and Telecommunication Systems MASCOTS'93, San Diego, CA}, year = {1993}, editor = {H. Schwertman and J. Walrand and K. Bagchi and others}, pages = {247--250}, month = {January}, organization = {SCS and IEEE}, note = {ISBN 1-56555-018-8}, } Kopieren [inproceedings] bibtex O. Theel, \"General Structured Voting: A Flexible Framework for Modelling Cooperations\" in Proc. of the 13th International Conference on Distributed Computing Systems, Pittsburgh, PA, 1993. @INPROCEEDINGS{The93:gsv, author = {Oliver Theel}, title = {{General Structured Voting: A Flexible Framework for Modelling Cooperations}}, booktitle = {of the 13th International Conference on Distributed Computing Systems, Pittsburgh, PA}, year = {1993}, pages = {227--236}, month = {May}, organization = {IEEE}, } Kopieren [inproceedings] bibtex O. Theel, \"Meeting the Application's Needs: A Design Study of a Highly Customized Replication Scheme\" in Proc. of the 1993 Pacific Rim International Symposium on Fault Tolerant Computing, Melbourne, Australia, 1993. @INPROCEEDINGS{The93:man, author = {Oliver Theel}, title = {{Meeting the Application's Needs: A Design Study of a Highly Customized Replication Scheme}}, booktitle = {of the 1993 Pacific Rim International Symposium on Fault Tolerant Computing, Melbourne, Australia}, year = {1993}, pages = {111--117}, month = {December}, organization = {IEEE and ACS}, } Kopieren [inproceedings] bibtex C. Liebig, H. Pagnia-Koch, F. Schwappacher, und O. Theel, \"Applying Scalable Read Consistency to Data Replication\" in Proc. of the 13th International Conference on Applied Informatics, Innsbruck, Austria, 1995. @INPROCEEDINGS{LPS+95:asr, author = {Christoph Liebig and Hans-Henning Pagnia-Koch and Frank Schwappacher and Oliver Theel}, title = {{Applying Scalable Read Consistency to Data Replication}}, booktitle = {of the 13th International Conference on Applied Informatics, Innsbruck, Austria}, year = {1995}, month = {February}, organization = {IASTED}, } Kopieren [inproceedings] bibtex O. E. Theel und B. D. Fleisch, \"Analysis of a Fault-Tolerant Coherence Protocol for Distributed Shared Memory Systems Under Heavy Write Load\" in Proc. of the Pacific Rim Intern. Symposium on Fault-Tolerant Systems, Newport Beach, CA, 1995. @INPROCEEDINGS{TF95:afc, author = {Oliver E. Theel and Brett D. Fleisch}, title = {{Analysis of a Fault-Tolerant Coherence Protocol for Distributed Shared Memory Systems Under Heavy Write Load}}, booktitle = {{of the Pacific Rim Intern. Symposium on Fault-Tolerant Systems, Newport Beach, CA}}, year = {1995}, pages = {146--151}, month = {December}, organization = {IEEE}, } Kopieren [inproceedings] bibtex O. E. Theel und B. D. Fleisch, \"Design and Analysis of Highly Available and Scalable Coherence Protocols for Distributed Shared Memory Systems Using Stochastic Modeling\" in Proc. of the 24th Intern. Conf. on Parallel Processing, Oconomowoc, WI, 1995. @INPROCEEDINGS{TF95:dah, author = {Oliver E. Theel and Brett D. Fleisch}, title = {{Design and Analysis of Highly Available and Scalable Coherence Protocols for Distributed Shared Memory Systems Using Stochastic Modeling}}, booktitle = {{of the 24th Intern. Conf. on Parallel Processing, Oconomowoc, WI}}, year = {1995}, pages = {I-126 -- I-130}, month = {August}, organization = {IEEE}, } Kopieren [inproceedings] bibtex O. Theel und H. Pagnia-Koch, \"General Design of Grid-based Data Replication Schemes Using Graphs and a Few Rules\" in Proc. of the 15th International Conference on Distributed Computing Systems, Vancouver, CA, 1995. @INPROCEEDINGS{TP95:gdg, author = {Oliver Theel and Henning Pagnia-Koch}, title = {{General Design of Grid-based Data Replication Schemes Using Graphs and a Few Rules}}, booktitle = {of the 15th International Conference on Distributed Computing Systems, Vancouver, CA}, year = {1995}, pages = {395--403}, month = {May}, organization = {IEEE}, } Kopieren [inproceedings] bibtex C. Liebig, H. Pagnia, F. Schwappacher, und O. Theel, \"A Quality-of-Service Approach for Mobile Users of Replicated Data in Distributed Systems\" in Proc. of the 10th European Simulation Multiconference, ESM96, Budapest, Hungary, 1996. @INPROCEEDINGS{LPS+96:qam, author = {Christoph Liebig and Hans-Henning Pagnia and Frank Schwappacher and Oliver Theel}, title = {{A Quality-of-Service Approach for Mobile Users of Replicated Data in Distributed Systems}}, booktitle = {of the 10th European Simulation Multiconference, ESM96, Budapest, Hungary}, year = {1996}, editor = {Andras Javor and Axel Lehmann and Istvan Molnar}, pages = {842--851}, month = {June}, organization = {SCS}, } Kopieren [inproceedings] bibtex H. Pagnia, C. Liebig, und O. Theel, \"Mutual Trust between Customers and Providers of Distributed Services\" in Proc. of the IASTED International Conference on Networks, Orlando, FL, 1996. @INPROCEEDINGS{PLT96:mtc, author = {Hans-Henning Pagnia and Christoph Liebig and Oliver Theel",
  "content_length": 91004,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:32"
}