{
  "name": "Olivier Tremblay Savard",
  "homepage": "http://www.cs.umanitoba.ca/~tremblao",
  "status": "success",
  "content": "Olivier Tremblay-Savard Olivier Tremblay-Savard Assistant Professor Department of Computer Science University of Manitoba ABOUT ME My research interests are in the areas of bioinformatics and human computing. In particular, I'm interested in all aspects of genome and biological sequence evolution, as well as human computing and crowdsourcing games. I completed my Ph.D. in bioinformatics at the Université de Montréal in 2013 under the supervision of Nadia El-Mabrouk. From 2013 to 2015, I worked as a postdoctoral fellow on human computing games in genomics at McGill University under the mentorship of Jérôme Waldispühl. I joined the Department of Computer Science at the University of Manitoba in January 2016. RESEARCH PROJECTS Analysis of tRNA gene evolution in bacterial genomes Transfer RNA (tRNA) genes are among the most important and ancient genes. We are interested in studying the evolution of the tRNA genes in terms of their numbers, their organization in the genomes, their sequences and their functional identity. When studying bacterial genomes that have diverged quickly, it becomes difficult to identify the orthologous relationships between the tRNA genes, which makes it hard to infer evolutionary scenarios. Another goal of our research is to develop new algorithmic methods to help with the inference of the evolutionary events that have transformed the genomic organization of the genes. Human computing games in genomics Human computing is the combination of traditional computing power with human intellectual power in order to solve specific problems, or in other words, problems that can benefit from the capabilities of the human brain (like perception, knowledge, reasoning, coordination, etc.). In human computing research projects, the workers are usually performing the required tasks voluntarily or in exchange of a monetary compensation. However, it is also possible to recruit players that will perform the tasks as part of a video game. We are interested in the development of human computing and crowdsourcing video games that help solve specific problems in genomics. LAB MEMBERS Rogerio de Leon Pereira, PhD student Anjum Matin, MSc student Mardel Maduro, undergraduate student Alumni: Chamath Welihinda, undergraduate student Adam Grabowiecki, undergraduate student Brittany Postnikoff, undergraduate student PROSPECTIVE STUDENTS I am currently looking for students at the M.Sc. or Ph.D. levels with interests in bioinformatics. M.Sc. or Ph.D. candidates interested in pursuing studies in bioinformatics under my supervision must have a strong background in algorithm development, theoretical computer science and programming. The potential candidates must have at least some experience in biology and/or bioinformatics; otherwise, they have to demonstrate a high level of motivation to learn biological concepts. Potential candidates must send me, by e-mail, their CV and most recent transcript, along with a letter of motivation. Positions are competitive and due to the large number of requests, only the best candidates will receive an answer. CONTACT ME Office: E2-411 EITCUniversity of ManitobaWinnipeg, MB R3T 2N2 Email: tremblao AT cs.umanitoba.ca Phone: 204-474-8675 Based on a template from BlackTie.co",
  "content_length": 3255,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:37"
}