{
  "name": "Oliver Michel",
  "homepage": "https://www.iit.edu/directory/people/oliver-michel",
  "status": "success",
  "content": "Oliver Michel | Illinois Institute of Technology Skip to main site navigation Skip to main content Oliver Michel Assistant Professor of Computer Science Tags: Faculty Computer Science Home Office and Department Directory Directory Oliver Michel EducationPh.D. Computer Science, University of Colorado BoulderResearch InterestsSystemsPublicationsScalable Video Conferencing Using SDN Principles, Oliver Michel, Satadal Sengupta, Hyojoon Kim, Ravi Netravali, Jennifer RexfordSIGCOMM '25 (Annual Conference of the ACM Special Interest Group on Data Communication, 2025)Athena: Seeing and Mitigating Wireless Impact on Video Conferencing and Beyond, Fan Yi, Haoran Wan, Kyle Jamieson, Jennifer Rexford, Yaxiong Xie, Oliver MichelHotNets '24 (ACM Workshop on Hot Topics in Networks, 2024)LinuxFP: Transparently Accelerating Linux Networking Marcelo Abranches, Erika Hunhoff, Rohan Eswara, Oliver Michel, Eric KellerICDCS '24 (IEEE Conference on Distributed Computing Systems, 2024)Getting Back What Was Lost in the Era of High-Speed Software Packet Processing Marcelo Abranches, Oliver Michel, Eric KellerHotNets '22 (ACM Workshop on Hot Topics in Networks, 2022)Enabling Passive Measurement of Zoom Performance in Production Networks, Oliver Michel, Satadal Sengupta, Hyojoon Kim, Ravi Netravali, Jennifer RexfordIMC '22 (ACM Internet Measurement Conference, 2022)PowerTCP: Pushing the Performance Limits of Datacenter NetworksVamsi Addanki, Oliver Michel, Stefan SchmidNSDI '22 (USENIX Symposium on Networked Systems Design and Implementation, 2022)Efficient Network Monitoring Applications in the Kernel with eBPF and XDPMarcelo Abranches, Oliver Michel, Eric Keller, Stefan SchmidNFV-SDN '21 (IEEE Conference on NFV and SDN, 2021)The Programmable Data Plane: Abstractions, Architectures, Algorithms, and Applications, Oliver Michel, Gabor Retvari, Roberto Bifulco, Stefan SchmidCSUR (ACM Computing Surveys, 2021)Software Packet-Level Network Analytics at Cloud Scale, Oliver Michel, John Sonchack, Greg Cusack, Maziyar Nazari, Eric Keller, Jonathan M. SmithTNSM (IEEE Transactions on Network and Service Management, 2021) Contact Information omichel@illinoistech.edu Website SB 218E Learn more... Illinois Tech welcomes you to join our community of people who discover, create, and solve. Apply today, visit us in Chicago, and contact us for more information. Request Info Visit Apply",
  "content_length": 2383,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:34"
}