{
  "name": "Olof B. Widlund",
  "homepage": "https://www.cs.nyu.edu/widlund",
  "status": "success",
  "content": "Olof B. Widlund Olof B. Widlund Silver Professor of Mathematics and Computer Science Throughout his career, Olof Widlund has focused on numerical algorithms for partial differential equations. His primary concern has been new algorithms and mathematical tools for their analysis. For over two decades, with students and other associates, he has concentrated his efforts on domain decomposition algorithms for the large linear systems of algebraic equations that arise in many computational continuum mechanics problems, for example in fluid dynamics and elasticity. These algorithms use a preconditioned conjugate gradient approach and they are designed for parallel and distributed computers. A main challenge is to overcome the potential computational bottleneck arising because the solutions of the linear systems depend on the data everywhere in the region. A research monograph, ``Domain Decomposition Methods - Algorithms and Theory'', coauthored with Andrea Toselli, was published by the Springer Verlag in 2005. In February 2006, it received the Award for Excellence in Professional and Scholarly Publications of the Association of American Publisher, in the category Mathematics and Statistics. The book contains many results developed by the seventeen doctoral students, who had completed doctoral dissertations at the Courant Institute in this field of research between 1989 and 2004. These algorithms are increasingly being accepted by the user community and their usefulness on loosely-coupled computer systems and the very largest parallel computers has been demonstrated in a substantial number of experimental studies, some of them using the PETSc system developed at the Mathematics and Computer Science Division of the Argonne National Laboratory . In recent years, the Courant Institute research group has focused its work on FETI-DP and BDDC algorithms for elliptic systems, including those of saddle point type and on domain decomposition methods for electro-magnetics. The group has also actively developed new, hybrid domain decomposition algorithms, which combine features of iterative substructuring methods and two-level overlapping Schwarz methods; the principal applications so far has been to almost incompressible elasticity. In recent years, work on domain decomposition algorithms for isogeomtric analysis and on the adaptive selection of global, primal spaces for BDDC algorithms has also begun. Several of his friends and colleagues organized a meeting Fast Algorithms for Scientific Computing which was held at the Courant Institute on September 19-20, 2008, to mark his seventieth birthday. A large number of his former students, and many other friends and coworkers, participated in a meeting held at the Courant Institute on January 23-24, 1998, on the occasion of his sixtieth birthday. He is also a regular participant in the International Conferences on Domain Decomposition in Science and Engineering and has helped edit a number of the proceedings of these conference. The sixteenth, and one of the largest in the series, was held at the Courant Institute on January 11-15, 2005. On the day just before the twentieth conference in the series, held at UCSD February 7-11, 2011, he offered a full day tutorial ; see also a four page introduction to this set of slides. Publications and Doctoral Students Selected Papers Doctoral Students NYU Tech Reports Research Sponsors Olof Widlund's research is funded by United States National Science Foundation under Contract NSF DMS-1522736 and has previously been funded by a grant from the United States Department of Energy under Contract DE-FG02-06ER25718. He was funded by and was the institutional lead of the DOE SciDAC (\"Scientific Discovery through Advanced Computing\") TOPS (\"Terascale Optimal PDE Simulation\") project until Spring 2007. Earlier, he was also a co-principal investigator in developing A Numerical Laboratory for Multi-Model Multi-Domain Computational Methods in Aerodynamics and Acoustics. Some of the members of that group later participated in the TOPS effort. Course homepages Advanced Numerical Analysis: Finite Element Methods, Fall 2016 Numerical Analysis, Spring 2016 Numerical Methods II, Spring 2015 Complex Variables I, Fall 2014 Numerical Methods I, Fall 2013 Linear Algebra I, Fall 2011 Ordinary Differential Equations, Spring 2009 Related Links Courant Institute Department of Computer Science New York University Contact Information Mailing Address and Phone and Fax Numbers Courant Institute 251 Mercer Street New York, New York 10012 U.S.A. 212.998.3110 (voice) 212.995.4121 (fax) E-Mail widlund at cims.nyu.edu",
  "content_length": 4636,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:38"
}