{
  "name": "Oluwasanmi Koyejo",
  "homepage": "http://sanmi.cs.illinois.edu",
  "status": "success",
  "content": "Sanmi Koyejo Sanmi Koyejo Home Bio Research Group Topics Papers Talks ProspectiveStudents Teaching MLHP (Fa25) GAI (Fa25) AIG (Wi25) AI (Sp24) ML (Wi24) MLHP (Fa23) AI (Sp23) PGM (Sp21) ML (Fa20) PGM (Sp20) ML (Fa19) ML (Fa18) ML (Fa17) PGM (Fa16) Service Recent Sanmi Koyejo New lab webpage! Assistant Professor Computer Science, Stanford University Stanford Affiliations SAIL, HAI, CRFM, AIMI, AI Safety, Machine Learning Group, Bio-X Adjunct Associate Professor Computer Science, University of Illinois at Urbana-Champaign Research I lead Stanford Trustworthy AI Research (STAIR). STAIR develops measurement-theoretic foundations for trustworthy AI systems, spanning AI evaluation science, algorithmic accountability, and privacy-preserving machine learning. Our applied research includes applications to healthcare, neuroimaging, and scientific discovery. For more details, see publications. Contact Assistant Professor 342 Gates, 353 Jane Stanford Way, Stanford, CA, 94305. sanmi[at]cs.stanford.edu http://cs.stanford.edu/~sanmi Google Scholar, DPLB, arXiv Selected Recent News With Sang Truong and Andy Haupt, I am writing a textbook on Machine Learning from Human Preferences. Submit a PR to contribute! Sanmi receives the Presidential Early Career Award for Scientists and Engineers (PECASE) (2025). Excited to give a keynote at the European Conference on Computer Vision (ECCV 2024). Excited to give a keynote at the ACM Conference on Fairness, Accountability, and Transparency (ACM FAccT 2024). Excited to give a keynote at the Conference on Health, Inference, and Learning (CHIL 2024). Our work on AI capabilities evaluation was cited in the 2024 Economic Report of the President. Co-founded Virtue AI, developing enterprise solutions for AI safety and security measurement and mitigation. Some press on our preprint critiquing emergent abilities (May 2023). Our work “Toward fairness in artificial intelligence for medical image analysis: identification and mitigation of potential biases in the roadmap from data collection to model deployment” was highlighted by SPIE (April 2023). Excited to give a keynote at the International Symposium of Biomedical Imaging (2023) Page generated 2025-09-08 09:44:34 PDT, by jemdoc.",
  "content_length": 2232,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:39"
}