{
  "name": "Oluwafemi Olukoya",
  "homepage": "https://pure.qub.ac.uk/en/persons/oluwafemi-olukoya",
  "status": "success",
  "content": "Oluwafemi Olukoya - Queen's University Belfast View Scopus Profile Oluwafemi Olukoya Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0003-2771-2553 Phone+44 (0)28 9097 4652Emailo.olukoyaqub.acuk Room 03.028 - Computer Science BuildingUnited Kingdom Accepting PhD Students 20192025 Research activity per year Personal profile Research InterestsMy core research interests include privacy, malware analysis, systems security and cybercrime. My current research focuses on mobile systems security and privacy, sustainable malware analysis and detection engineering, cyber-attack attribution and connecting software engineering with legal and regulatory requirements. I am also interested in multidisciplinary research projects that capture the socio-technical dynamics of the cyber environment. Fingerprint Dive into the research topics where Oluwafemi Olukoya is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 7 Similar Profiles Malware Computer Science 100% User Computer Science 65% Android Computer Science 56% Malware Family Computer Science 44% Malware Detection Computer Science 40% Learning System Computer Science 38% Machine Learning Computer Science 38% Concept Drift Computer Science 35% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2022 2022 1 Active Projects per year R1796ECS: NIO New Deal Cyber Bid -AIDE_NICYBER2025 (linked to R1778ECS)Miller, P. (PI), Alouani, I. (CoI), Devereux, B. (CoI), Johnson, C. (CoI), Martinez-del-Rincon, J. (CoI), McLaughlin, K. (CoI), McLaughlin, N. (CoI), O'Neill, M. (CoI), Olukoya, O. (CoI), Scott-Hayward, S. (CoI), Sharma, V. (CoI) & Wang, H. (CoI)19/12/2022 → …Project: Research Radio Access Network 100% Machine Learning 59% Artificial Intelligence 59% Misconfiguration 59% 6G 59% Research output Research output per year 2019 2024 2025 2025 11 Article 7 Conference contribution 1 Other contribution Research output per year Research output per year Depression detection in read and spontaneous speech: a multimodal approach for lesser-resourced languagesDaly, K. & Olukoya, O., Oct 2025, In: Biomedical Signal Processing and Control. 108, 18 p., 107959.Research output: Contribution to journal › Article › peer-review Open AccessFile Mental Health 100% Short-Term Memory 50% Neural Network 50% Bidirectional Encoder Representations From Transformers 50% Correlation Analysis 50% 2 Citations (Scopus) 17 Downloads (Pure) Navigating concept drift and packing complexity in malware family classificationGuldemir, N. H., Olukoya, O. & Martínez-del-Rincón, J., 09 Feb 2025, Conference on Applied Machine Learning for Information Security (CAMLIS 2024): Proceedings. CEUR-WS, Vol. 3920. p. 129-144 15 p. (CEUR Workshop Proceedings; vol. 3920).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Malware 100% Malware Family 100% Concept Drift 100% Model Accuracy 33% Performance Model 16% 71 Downloads (Pure) On the limitations of fuzzy hashing for malware similarity: an analysis of vulnerable code detection in malwareRoss, N., Olukoya, O. & Martinez-del-Rincon, J., 04 Oct 2025, (Accepted) 2025 IEEE 24th International Conference on Trust, Security and Privacy in Computing and Communications (TrustCom): proceedings. IEEE, (IEEE International Conference on Trust, Security and Privacy in Computing and Communications (TrustCom): proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Malware 100% Hashing 100% Vulnerability Assessment 11% Static Program Analysis 11% Malware Sample 11% PEVuln: a benchmark dataset for using machine learning to detect vulnerabilities in PE malwareRoss, N., Olukoya, O., Martínez del Rincón, J. & Carlin, D., 09 Feb 2025, Conference on Applied Machine Learning for Information Security (CAMLIS 2024): Proceedings. CEUR-WS, Vol. 3920. p. 83-113 30 p. (CEUR Workshop Proceedings; vol. 3920).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Malware 100% Learning System 100% Machine Learning 100% Malware Sample 20% Vulnerability Database 20% 228 Downloads (Pure) Threat-based vulnerability management: mapping CVEs to the MITRE ATT&CK frameworkMcMahon, L. & Olukoya, O., 26 Oct 2025, SECURWARE 2025: The Nineteenth International Conference on Emerging Security Information, Systems and Technologies: Proceedings. Lawall, A. & Wu, F. (eds.). IARIA Press, p. 6-13 8 p. (International Conference on Emerging Security Information, Systems and Technologies: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Common Knowledge 100% Vulnerability Management 100% Knowledge Mapping 50% Risk Management 25% Cybersecurity 25% 6 Downloads (Pure) View all 19 research outputs Prizes Queen's Merit Award for FellowshipOlukoya, O. (Recipient), 13 Dec 2022Prize: Fellowship awarded competitively Activities Activities per year 2021 2021 2022 2023 2024 2025 10 Participation in conference 10 Participation in workshop, seminar, course 9 Publication peer-review 2 Oral presentation 3 More 1 Editorial activity 1 Other examination 1 Membership of network Activities per year Tutorial: Secure & Smart Distributed Computing with Blockchain, Agentic AI AND LoRaWANSharma, V. (Presenter), Duong, T. Q. (Member), Olukoya, O. (Member), Abdul Majeed, A. (Presenter), Sandjaja, F. R. (Presenter) & Wickremasinghe, G. (Presenter)19 Jun 2025Activity: Talk or presentation types › Oral presentation 2025 NCSC Cyber Security Education Ecosystem ConferenceOlukoya, O. (Participant)04 Mar 2025 → 05 Mar 2025Activity: Participating in or organising an event types › Participation in conference Internal PhD Examiner (QUB)Olukoya, O. (Examiner)15 Oct 2024 → …Activity: Examination types › Other examination IEEE Internet of Things Journal (Journal)Olukoya, O. (Peer reviewer)05 Oct 2024 → …Activity: Publication peer-review and editorial work types › Publication peer-review Journal of Computer Virology and Hacking Techniques (Journal)Olukoya, O. (Peer reviewer)01 Aug 2024 → …Activity: Publication peer-review and editorial work types › Publication peer-review View all 34 activities",
  "content_length": 6632,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:39"
}