{
  "name": "Om P. Damani",
  "homepage": "https://www.cse.iitb.ac.in/~damani",
  "status": "success",
  "content": "Om P. Damani Office: KReSIT 316 damani...cse...iitb..ac..in Om P. Damani Professor CSE@IIT Bombay Also associated with Center for Policy Studies and Centre for Technology Alternatives for Rural Areas (CTARA) My favourites: Dijkstra: Computing Science's founding father AID: Voluntary Org Bhopal: Social Justice Causes Earthcare Books: Book Store Academic Interests Technology for Development of the bottom 80%, System Dynamics: Modeling and Simulation for Social Development, System Architecture, Data Science. Resources Developed Textbook: Improving the Performance of Rural Water Supply and Sanitation Sector in Maharashtra JalTantra: A System for Design and Optimization of Water Distribution Networks : Optimal, fast, and free. Triennial IFORS Prize for OR in Development of International Federation of Operational Research Societies, 2020 IIT Bombay's Impactful Research Award, 2019 FAI: Farm Assessment Index : A holistic index to compare the performance of farming systems. Best Poster Award at Agriculture Science Congress 2017 GramDrishti: A system for detecting and annotating satellite image objects in rural areas. Current focus is on wells and farm ponds. CAPS: A Calculational Assistant for Programming from Specifications : Bugs free programming - Yes we can ! CPOST: CRF based Hindi Part of Speech Tagger: No longer being supported Teaching Spring 2025: CS 752 - System Dynamics : Modeling and Simulation for Development Earlier Courses Selected Publications System Dynamics How can resource-level thresholds guide sustainable intensification of agriculture at farm level? A system dynamics study of farm-pond based intensification - Pooja Prasad, Om P. Damani and Milind Sohoni. Agricultural Water Management,Vol. 264, April 2022. Effectiveness of Testing, Tracing, Social Distancing and Hygiene in Tackling Covid-19 in India: A System Dynamics Model, pre-print, 2020. Assessing Self-Sustainability of Rural Water Supply Systems: Free Household Connections vs Free Solar Pumps - Abhishek Kumar Sinha, Om Damani, Shreya Agarwal, Sandeep Chougule and Pradip Kalbar. 38th International Conference of the System Dynamics Society, SD 2020. A Stock and Flow Based Framework to Identify Indicators for a Holistic Comparison of Farming Practices - Siva Muthuprakash K. M. and Om P. Damani. Agricultural Research, September 2017, 6:248. GramDrishti FPCD: An Open Aerial VHR Dataset for Farm Pond Change Detection - Chintan Tundia, Rajiv Kumar, Om P. Damani, G. Sivakumar. VISIGRAPP (5: VISAPP), 2023. public dataset. The MIS Check-Dam Dataset for Object Detection and Instance Segmentation Tasks - Chintan Tundia, Rajiv Kumar, Om P. Damani, G. Sivakumar. VISIGRAPP (5: VISAPP), 2022. public dataset. Aiding Irrigation Census in Developing Countries by Detecting Minor Irrigation Structures from Satellite Imagery - Chintan Tundia, Pooja Tank and Om Damani. 6th Intl. Conf. on Geographical Information Systems Theory, Applications and Management, GISTAM 2020. Well Detection in Satellite Images using Convolutional Neural Networks - Pratik Wagh, Debanjan Das and Om Damani. 5th Intl. Conf. on Geographical Information Systems Theory, Applications and Management, GISTAM 2019. Water Transmission Networks Hydraulic modeling approach for evaluating the performance of flow-starved water transmission networks - Abhishek Kumar Sinha; Anujkumar Ghorpade; Om Damani; Pradip P. Kalbar. Journal of Water Supply: Research and Technology-Aqua, (2023) 72 (1): 1-18. Jaltantra Piping Cost Optimisation of Water Distribution Networks - Saumya Goyal, Om Damani, Ashutosh Mahajan. 22nd Conference of the Intl. Federation of the Operational Research Societies (IFORS) 2021. A Series of ILP Models for the Optimization of Water Distribution Networks - Nikhil Hooda, Ashutosh Mahajan and Om P. Damani. Sadhana 44.12 (2019): 239, Indian Academy of Sciences. JalTantra: A System for Design and Optimization of Rural Piped Water Networks - Nikhil Hooda and Om Damani. INFORMS Journal on Applied Analytics (2019). Inclusion of Tank Configurations as a Variable in the Cost Optimization of Branched Piped Water Networks - Nikhil Hooda and Om P. Damani. Drinking Water Engineering and Science, 10, 39-44, 2017; Preliminary version in 14th Conference on Computing and Control for the Water Industry, CCWI 2016. A System for Optimal Design of Pressure Constrained Branched Piped Water Networks - Nikhil Hooda and Om P. Damani. 18th Conference on Water Distribution System Analysis, WDSA 2016. Farm Assessment Index (FAI) Design of Farm Assessment Index (FAI) for a holistic comparison of farming practices: case of organic and conventional farming systems from two Indian states - Siva Muthuprakash K M and Om P. Damani. Agroecology and Sustainable Food Systems, 2019, Volume 43, Issue 3, Pages 329-357 . A Stock and Flow Based Framework to Identify Indicators for a Holistic Comparison of Farming Practices - Siva Muthuprakash K. M. and Om P. Damani. Agricultural Research, September 2017, 6:248. Challenges in Large Scale Soil Sampling and Testing (based on Field Application of the Farm Assessment Index (FAI)) - Siva Muthuprakash K. M. and Om P. Damani. India’s Soils: Science-PolicyPractice Interfaces for Sustainable Futures (2017). Assessment of Farming Practices of Sixty Farmers in Maharashtra Using a Composite Index - Siva Muthuprakash K. M., Om P. Damani, Ashok Bang, Niranjana Maru. XIII Agricultural Science Congress at University of Agricultural Sciences, Bengaluru (2017). Best poster award Significance of Soil Parameters in Evaluating the Farming Practices: A Systems Approach - Siva Muthuprakash K M and Om Damani. Wageningen Soil Conference (2015). Program Derivation Assumption Propagation Through Annotated Programs - Dipak L. Chaudhari and Om P. Damani. Formal Aspects of Computing, May 2017, 29(3), (doi:10.1007/s00165-016-0395-x). Building an IDE for the Calculational Derivation of Imperative Programs - Dipak L. Chaudhari and Om P. Damani. 2nd Workshop on Formal-IDE, Formal Methods 2015. Combining Top-down and Bottom-up Techniques in Program Derivation - Dipak L. Chaudhari and Om P. Damani. 25th Intl. Symp. on Logic-Based Program Synthesis and Transformation, LOPSTR 2015. Introducing Formal Methods via Program Derivation - Dipak L. Chaudhari and Om P. Damani. 20th Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE 2015. Automated Theorem Prover Assisted Program Calculations - Dipak L. Chaudhari and Om P. Damani. The 11th International Conference on Integrated Formal Methods, IFM 2014. Generating Hierarchical State Based Representation From Event-B Models - Dipak L. Chaudhari and Om P. Damani. B 2011. (Presentation) NLP A Domain-Restricted, Rule Based, English-Hindi Machine Translation System Based on Dependency Parsing - Pratik Desai, Amit Sangodkar, Om P. Damani. 11th International Conference on Natural Language Processing, ICON 2014. Appropriately Incorporating Statistical Significance in PMI - Om P. Damani and Shweta Ghonge. Conference on Empirical Methods on Natural Language Processing, EMNLP 2013. Improving Pointwise Mutual Information (PMI) by Incorporating Significant Co-occurrence - Om P. Damani. 17th Conference on Computational Natural Language Learning, CoNLL 2013. Noun Group and Verb Group Identification for Hindi - Smriti Singh, Om P. Damani, Vaijayanthi M. Sarma. 24th International Conference on Computational Linguistics, COLING 2012. pdf, ppt presentations. Wikipedia is a practical alternative to the Web for measuring Co-occurrence based Word Association - Om P. Damani, Pankhil Chedda, and Dipak Chaudhari. 4th Conference on Language and Technology, CLT 2012. Re-ordering Source Sentences for SMT - Amit Sangodkar and Om P. Damani. The Eighth International Conference on Language Resources and Evaluation, LREC 2012 Lexical Co-occurrence, Statistical Significance, and Word Association - Dipak L. Chaudhari, Om P. Damani, and Srivatsan Laxman. Conference on Empirical Methods on Natural Language Processing, EMNLP 2011. resources used in the paper. Transliteration for Resource Scarce Languages - Manoj K. Chinnakotla, Om P. Damani, Avijit Satoskar. ACM Transactions on Asian Language Information Processing (TALIP), Vol. 9, No. 4, Article 14, Dec 2010. Data-set used in the paper. Parts of this paper appeared as Character Sequence Modeling for Transliteration in 7th International Conference on Natural Language Processing, ICON 2009. English to UNL (Interlingua) Enconversion - Manoj Jain and Om P. Damani. Poster paper at 2nd Conference on Language and Technology, CLT 2009. Experiences with English-Hindi, English-Tamil and English-Kannada Transliteration Tasks at NEWS 2009, Manoj K. Chinnakotla and Om P. Damani, ACL-IJCNLP Named Entities Workshop, NEWS 2009. Character Sequence Modeling for Transliteration - Manoj Chinnakotla and Om P. Damani. 7th Intl. Conf. on Natural Language Processing, ICON 2009. A System for Compound Noun Multiword Expression Extraction for Hindi - Anoop Kunchukuttan and Om P. Damani. 6th Intl. Conf. on Natural Language Processing, ICON 2008. Statistical Machine Translation with Rule Based Re-ordering of Source Sentences - Amit Sangodkar, Vasudevan N., Om P. Damani. In Proceedings of the NLP Tools Contest, 6th International Conference on Natural Language Processing (ICON 2008). Hindi to English and Marathi to English Cross Language Information Retrieval Evaluation - Manoj Chinnakotla, Sagar Ranadive, Om P. Damani, and Pushpak Bhattacharyya. 8th Workshop of the Cross-Language Evaluation Forum, CLEF 2007. This work secured the first place for any Indian Language to English CLIR and fifth place for any language to English CLIR at CLEF 2007. Hindi Generation from Interlingua (UNL) - Smriti Singh, Mrugank Dalal, Vishal Vachhani, Pushpak Bhattacharyya, Om P. Damani. Machine Translation Summit XI, 2007. Presentations: pdf, ppt Distributed Systems Interference-constrained coverage algorithms in the protocol and SINR models - Prateek Kapadia, Om P. Damani, Animesh ",
  "content_length": 15846,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:38"
}