{
  "name": "Om Pal",
  "homepage": "http://people.du.ac.in/~ompal",
  "status": "success",
  "content": "Dr. Om Pal Om Pal received B.E. in Computer Science & Engineering from Dr. B. R. Ambedkar University, Agra, MBA(Operation & Management) from IGNOU, MS (Research) in field of Cryptography from IIT Bombay, PG Diploma in Cyber Law, Cyber Crime Investigation and Digital Forensics from National Law Institute University, Bhopal and Ph.D. in field of Information Security from Jamia Millia Islamia, New Delhi. He has more than 20 years of Academic & Research experience in various areas of Computer Science. He is a Co-founder & CEO of SafeQbit Technologies Pvt Ltd. He is an Associate Professor in Department of Computer Science, University of Delhi (Central University), Delhi. Previously he worked as a Scientist at Ministry of Electronics and Information Technology (MeitY), Government of India. He evolved and worked on research projects of national interest in various areas including Cryptography, Information Security, Digital Personal Data Protection (DPDP) Bill 2022, National Strategy on Blockchain, Post-Quantum Cryptography, Quantum Computing, Cyber Law etc. and drafting of R&D policies. Prior to this, he worked at Centre for Development of Advanced Computing (C-DAC) as a Sr. Technical Officer and as an IT Resource Person in National Thermal Power Corporation (NTPC). He has published many research articles in International Journals and International Conferences of repute. He owns two Indian patents on Conditional Access Systems. He is a certified ethical hacker. He is also an AICTE & C-DAC certified 'Master Trainer' in field of High-Performance Computing. He is also a Nodal Officer of University of Delhi for Visvesvaraya PhD scheme of MeitY, Govt of India. He has published books: (i) Unleashing the Potentials of Blockchain Technology for Healthcare Industries by Elsevier (ii) Intelligent Cyber Security for Modern Networks by CRC Press (Taylor & Francis Group). He is a member Convener in Bureau of Indian Standards, Ministry of Consumer Affairs, Food and Public Distribution, Government of India for Review of ISO Standard 16340 & 20415. He has supervised many Master's students and PhD Research Scholars. He has delivered more than 50 invited talks in FDPs and International Conferences. He has served as a Guest Editor for International Journals. He has been nominated in the board of reviewers of various peer-reviewed and refereed Journals. Profile",
  "content_length": 2376,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:39"
}