{
  "name": "Om Prakash Jena",
  "homepage": "https://ravenshawuniversity.ac.in/?page_id=31149",
  "status": "success",
  "content": "Ravenshaw University.Ravenshaw is the oldest institution of higher education in the state of Odisha and one of the oldest institutions of higher education in India. Important Updates Reschedule of PG 1st Semester Paper-1.1.1 Examination 2025  || PROVISIONAL LIST OF CANDIDATES SELECTED FOR 2nd SELECTION ADMISSION INTO DIFFERENT Ph.D. PROGRAMMES FOR THE SESSION 2025–26  || Notice for Extension of UG 5th Semester Examination Form Fillup 2025  || PG 1st Semester Examination Form FIllup 2025  || M.Sc (BIotechnology) 3rd Semester Examination Form FIllup 2025  || Institutional Vision Founded with the Vision to spread the light of learning, and guided by the motto Jnanameva Shakti (Knowledge is power), Ravenshaw University aims to preserve its position as the “temple of learning”, with a deep knowing that the phrase exists in the vernacular for a reason. The university envisions itself as the one-stop destination for higher education for students from diverse social and economic backgrounds, and will help students to steer their passions towards making the world a better place. With the aforesaid vision, the University has adopted three main principles – coordination, hierarchy and functional differentiation – to maintain unified goals and vision. With efficient academic governance and quality infrastructure the university targets to produce human resource commensurate with the progress of knowledge at international level. The university realizes the demand of quality higher education and requirement of connectivity between the classroom education and the societal application. It visions to initiate future programmes to impart skills, as demanded by the society and the stake holders and training of applicability. History Ravenshaw is the oldest institution of higher education in the state of Odisha and one of the oldest institutions of higher education in India. It was founded in 1868 with intermediate level (F. A.) classes at the Cuttack Zilla (district) School (now Ravenshaw Collegiate School). The high school, which was also known as the Cuttack High School, was elevated to a first grade college in 1876. It became widely known as Cuttack College until it was rechristened Ravenshaw College as a tribute to T. E. Ravenshaw, who was the Commissioner of Cuttack Division and had played a key role in its creation. The office of Ravenshaw College and Ravenshaw Collegiate School was separated in 1904. 📰 Latest News 📂 Tenders View All Latest News 28-11-2025 PG 3rd Semester Examination Programme 2025 28-11-2025 UG 1st Semester & UG 3rd Semester Arts, Science, Commerce, ITM, BBA, BCA, JMC, B.A B.Ed and B.Sc B.Ed Examination Programme 27-11-2025 Invitation Letter to all Universities for particiaption in EZIU Cricket tournament of AIU of Ravenshaw University 24-11-2025 Extension Form Fill Up Notice of UG 5TH Semester & B.A B.Ed/ B.Sc B.Ed 7th Semester Examination, 24-11-2025 Extension Notice of Form Fill Up for PG 1st Semester Examination 21-11-2025 Reschedule of PG 1st Semester Paper-1.1.1 Examination 2025 17-11-2025 PROVISIONAL LIST OF CANDIDATES SELECTED FOR 2nd SELECTION ADMISSION INTO DIFFERENT Ph.D. PROGRAMMES FOR THE SESSION 2025–26 15-11-2025 M.Sc(Biotechnology) 3rd Semester Examination Programme 2025 15-11-2025 PG 1st Semester Examination Programme 2025 15-11-2025 M.Sc (BIotechnology) 3rd Semester Examination Form FIllup 2025 15-11-2025 PG 1st Semester Examination Form FIllup 2025 15-11-2025 Notice for Extension of UG 5th Semester Examination Form Fillup 2025 08-11-2025 UG 5TH SEMESTER EXAMINATION 2025 (R&B) NOTICE 07-11-2025 PROVISIONAL LIST OF CANDIDATES SELECTED FOR COUNSELLING-CUM-CERTIFICATE VERIFICATION & PROVISIONAL ADMISSION INTO COMMERCE Ph.D. PROGRAMME FOR THE SESSION 2025–26 04-11-2025 PROVISIONAL LIST OF CANDIDATES SELECTED FOR ADMISSION INTO DIFFERENT Ph.D. PROGRAMMES FOR THE SESSION 2025–26 03-11-2025 FORM FILL UP NOTICE FOR UG (5th & 7th) SEMESTER EXAMINATION -2025 (R & B) 31-10-2025 PROVISIONAL LIST OF CANDIDATES SELECTED FOR UG SPOT ADMISSION 2025 31-10-2025 PROVISIONAL LIST OF CANDIDATES SELECTED FOR PG SPOT ADMISSION 2025 27-10-2025 NOTIGE FOR UG 1st Year(Regular) RE-CHECKING OF MARKS 22-10-2025 SCHEDULE FOR PH.D. INTERVIEWS & DOCUMENTS VERIFICATION-2025 17-10-2025 THE DIVISION OF SEATS IN PH.D PROGRAMME FOR THE SESSION 2025-26 15-10-2025 Notice for Hostel Readmission 13-10-2025 The last date for online application Ph. D admission for the session 2025-26, is extended up to 19.10.2025. 09-10-2025 Notice for \"Youth Conclave on Healthy Diets\" 08-10-2025 Reschedule of BCA Paper VAC-102 of UG 2nd Semester Examination 2025 27-09-2025 Click here to apply for Ph.D Admission-2025. 27-09-2025 Ph.D. Admission Prospectus 2025-26 15-09-2025 RE-ADMISSION FEE Details for the Session 2025-26 View All Tenders Top Recruiter 600000+ Alumni 10000+ Students 400+ Faculty & Staff 700+ Research Projects 3500+ Publications 150+ Academic Events Gallery Prev Next ✕ ❮ ❯ Study Undergraduate Postgraduate Ph.D. Program Professional Programs Continuing Education Skill Programs Online Teaching & Learning Outreach Facilities Academic Infrastructure WiFi Campus Hostels Canteen Dispensary Barrier Free Campus Banking Services Post Office Dossier IQAC-NAAC NAAC-SSR RUSA UGC Annual Academic Report Annual Audit Report NIRF Endowment Convocation Reports Library Braille Library UGC e-ShodhSindhu NIC e-Granthalaya National Digital Library Knowledge Center e-Journals from INFLIBNET e-Resources Center University Archives Sports Our Facilities Membership Clubs & Activities Accessories Achievements Sports Website Opening Hours Yoga Centre Research Center of Excellence Innovation Center Library & e-Resources Holds over 1.8 Lakh resources Sponsors & Collaborators Sponsored research projects Proteomic signatures of human seminal plasma as a function of ROS gradient Impact of Nanoparticles on Neural Dysfunctions and Strategies to Reduce Toxicity Energy Optimization & Data Reduction for IoT-Based Indoor Environments Willingness to Pay for Rainfall Insurance in Rural India Ravenshaw in News Plantation Programme Earlier today, a team led by Prof Somnath Khaoash from the Department of Geology visited the Naraj foothills in the Mahanadi campus for planting seeds of various trees. Over 5000 seeds were planted today. 12 July 2024 ଆନ୍ତର୍ଜାତୀୟ ଯୋଗ ଦିବସ ରେଭେନ୍ସା ଆବାସ ବିଶ୍ବବିଦ୍ୟାଳୟରେ ୨୧ ଜୁନ ଆନ୍ତର୍ଜାତୀୟ ଯୋଗ ଦିବସ ପାଳିତ ହୋଇଛି। ଛାତ୍ରଛାତ୍ରୀ ଏବଂ ଶିକ୍ଷକମାନେ ଯୋଗ ଅଭ୍ୟାସ କରିଥିଲେ। 21 June 2024 Placement-2024 Placement season kicks off... Current stats: 400 placed graduates, 8 departments and 15 companies. 14 June 2024 View All Blogs & Books View All Campus Gallery All rights reserved © Ravenshaw University. Copyright 2025 Ravenshaw University. This is the official website of Ravenshaw University, Cuttack, Odisha. Ravenshaw University is the owner of the website. The Site is under development. Please share your valuable suggestions and feedback @ oicsystem[at]ravenshawuniversity[dot]ac[dot]in",
  "content_length": 6960,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:39"
}