{
  "name": "Omar Rivasplata",
  "homepage": "https://research.manchester.ac.uk/en/persons/omar-rivasplata",
  "status": "success",
  "content": "Omar Rivasplata - Research Explorer The University of Manchester X Omar Rivasplata Dr Senior Lecturer in Machine Learning, Machine Learning and Robotics https://orcid.org/0000-0002-2467-251X Accepting PhD Students Fingerprint Dive into the research topics where Omar Rivasplata is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Neural Network Computer Science 100% Deep Neural Network Mathematics 72% Bayesian Analysis Mathematics 60% Heavy Tail Mathematics 60% Truncation Mathematics 60% Meta-Analysis Mathematics 60% Variance Mathematics 60% Least Square Mathematics 60% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 6 Article 3 Conference contribution 1 Preprint Research output per year Research output per year Regularized Gradient Clipping Provably Trains Wide and Deep Neural NetworksTucat, M., Mukherjee, A., Sun, M., Sen, P. & Rivasplata, O., 2025, In: Transactions on Machine Learning Research. 2025-JuneResearch output: Contribution to journal › Article › peer-review Open Access Deep Neural Network 100% Minimizes 33% Step Size 33% Neural Network 33% Deep Learning Method 33% Semi-pessimistic Reinforcement LearningZhu, J., Zhou, X., Yao, J., Aminian, G., Rivasplata, O., Little, S., Li, L. & Shi, C., 25 May 2025, arXiv, p. 1-54, 54 p.Research output: Preprint/Working paper › Preprint Open AccessFile Labeled Data 100% Reinforcement Learning 100% Learning Algorithm 100% Transition Function 50% Parkinson's Disease 50% 3 Downloads (Pure) A note on generalization bounds for losses with finite momentsRodríguez-Gálvez, B., Rivasplata, O., Thobaben, R. & Skoglund, M., Jul 2024, IEEE International Symposium on Information Theory. Proceedings, p. 2-10 9 p.Research output: Contribution to specialist publication › Article File Variance 100% Heavy Tail 100% Truncation 100% 5 Downloads (Pure) A Note on the Convergence of Denoising Diffusion Probabilistic ModelsMbacke, S. D. & Rivasplata, O., Jun 2024, (Accepted/In press) In: Transactions on Machine Learning Research . p. 1-13 13 p.Research output: Contribution to journal › Article › peer-review Open Access Denoising Diffusion Probabilistic Models 100% Generating Distribution 100% Score Function 50% score function ψ 50% Meta-analysis of Bayesian AnalysesBlomstedt, P., Mesquita, D., Rivasplata, O., Lintusaari, J., Sivula, T., Corander, J. & Kaski, S., 2024, In: Bayesian Analysis.Research output: Contribution to journal › Article › peer-review Open Access Meta-Analysis 100% Bayesian Analysis 100% Bayesian 75% Posterior Distribution 50% Summary Statistic 25% View all 10 research outputs Projects 1 Active Projects per year MCAIF: Centre for AI FundamentalsKaski, S. (PI), Alvarez, M. (Researcher), Pan, W. (Researcher), Mu, T. (Researcher), Rivasplata, O. (PI), Sun, M. (PI), Mukherjee, A. (PI), Caprio, M. (PI), Sonee, A. (Researcher), Leroy, A. (Researcher), Wang, J. (Researcher), Lee, J. (Researcher), Parakkal Unni, M. (Researcher), Sloman, S. (Researcher), Menary, S. (Researcher), Quilter, T. (Researcher), Hosseinzadeh, A. (PGR student), Mousa, A. (PGR student), Glover, E. (PGR student), Das, A. (PGR student), DURSUN, F. (PGR student), Zhu, H. (PGR student), Abdi, H. (PGR student), Dandago, K. (PGR student), Piriyajitakonkij, M. (PGR student), Rachman, R. (PGR student), Shi, X. (PGR student), Keany, T. (PGR student), Liu, X. (PGR student), Jiang, Y. (PGR student), Wan, Z. (PGR student), Harrison, M. (Support team), Machado, M. (Support team), Hartford, J. (PI), Kangin, D. (Researcher), Harikumar, H. (PI), Dubey, M. (PI), Parakkal Unni, M. (PI), Dash, S. P. (PGR student), Mi, X. (PGR student) & Barlas, Y. (PGR student)1/10/21 → 30/09/26Project: Research Reinforcement Learning 100% Neural Network 71% Approximation (Algorithm) 62% Machine Learning 61% Artificial Intelligence 56%",
  "content_length": 4202,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:46"
}