{
  "name": "Omar Abdul Wahab 0001",
  "homepage": "https://www.polymtl.ca/expertises/abdul-wahab-omar",
  "status": "success",
  "content": "Abdul Wahab, Omar | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Abdul Wahab, Omar Poly Bottin Cours English Répertoire des expertises Abdul Wahab, Omar Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Omar Abdul Wahab Publications Professeur adjoint Département de génie informatique et génie logiciel Tél. : (514) 340-4711 poste 3893 Téléc. : (514) 340-5139 Local : M-3117 omar.abdul-wahab@polymtl.ca Domaines d'expertise Cybersécurité Intelligence artificielle Pôle d'excellence principal Nouvelles frontières en technologies de l'information et communications Pôle(s) d'excellence secondaire(s) Transport et infrastructures durables Industrie du futur et société numérique Projet(s) de recherche pour étudiants Je recrute Intérêts de recherche et affiliations Intérêts de recherche Cybersécurité Internet des objets Intelligence artificielle Sécurité infonuagique Type(s) d'expertises (sujets CRSNG) 2700 TECHNOLOGIE DE L'INFORMATION 2704 Traitement réparti et simultané 2715 Optimisation 2800 INTELLIGENCE ARTIFICIELLE (Vision artificielle, utiliser 2603) Publications Publications récentes Article de revue Arisdakessian, S., Wehbi, O., Abdul Wahab, O., Mourad, A., Otrok, H., & Guizani, M. (2025). A Two-Level Dirichlet Framework for Heterogeneous Federated Network. IEEE Transactions on Network Science and Engineering. Article de revue Arisdakessian, S., Wehbi, O., Abdul Wahab, O., Mourad, A., & Otrok, H. (2025). Towards Vox Populi in Federated Learning: A Fair and Inclusive Client Selection Framework. IEEE Transactions on Artificial Intelligence, 1, 1-15. Communication de conférence Arisdakessian, S., Abdul Wahab, O., Wehbi, O., Mourad, A., & Otrok, H. (septembre 2024). Detecting Free-Riders in Federated Learning Using an Ensemble of Similarity Distance Metrics [Communication écrite]. 4th Intelligent Cybersecurity Conference (ICSC 2024), Valencia, Spain. Communication de conférence Abdul Wahab, O. (novembre 2024). Dynamic Threat Intelligence Coalitions for Improved Cyber Defense Capabilities [Communication écrite]. IEEE 13th International Conference on Cloud Networking (CloudNet 2024), Rio de Janeiro, Brazil. Voir toutes les publications (61) Biographie Omar Abdul Wahab est professeur adjoint à Polytechnique Montréal. Il a obtenu son doctorat en ingénierie des systèmes d'information de l’Université Concordia en 2017. De 2017 à 2018, il a fait son postdoc à l'École de technologie supérieure, où il a travaillé sur un projet de recherche en collaboration avec Rogers et Ericsson. Omar a obtenu son diplôme de licence en informatique de gestion de l’Université Libanaise et son master en informatique de l’Université Libano-Américaine. Ses intérêts de recherche sont dans les domaines de la cybersécurité, de l’Internet des objets et de l’intelligence artificielle. Enseignement INF8107 Détection d'intrusion et supervision INF8108 Gestion et chasse de la cybermenace Formation Ph. D. en ingénierie des systèmes d'information, Université Concordia, Montréal, Canada Maîtrise in Computer Science, Université Libano-Américaine, Beyrouth, Liban Diplôme de licence en informatique de gestion, Université Libanaise, Tripoli, Liban Encadrement à Polytechnique EN COURS Doctorat (2) Arisdakessian, Sarhad. Apprentissage fédéré robuste et équitable en présence de free-riders. Wehbi, Osama. Détection des attaques par porte dérobée sur l'apprentissage fédéré. Maîtrise recherche (1) Rahali, Ranim. Améliorer la détection des intrusions en environnement ouvert dans les véhicules autonomes. Nouvelle(s) concernant Omar Abdul Wahab NOUVELLES | 4 octobre 2023 Subventions pour la recherche du CRSNG: 42 chercheuses et chercheurs de Polytechnique Montréal obtiennent des appuis totalisant plus de 2,6 M$ | Lire Revue de presse concernant Omar Abdul Wahab 10 janvier 2025, ICI Nouvelle Alberta, Pourquoi les données d’enfants sont-elles visées par des cyberattaques? Omar Abdul Wahab, professeur au Département de génie informatique et génie logiciel, intervient sur la cyberattaque du logiciel PowerSchool, utilisé dans plusieurs établissements manitobains. Autres mentions : ICI Première Alberta (à 4min.) 9 janvier 2025, ICI Télé Alberta, Le téléjournal Alberta | Épisode du jeudi 9 janvier 2025 Omar Abdul Wahab, professeur au Département de génie informatique et génie logiciel, intervient sur la cyberattaque du logiciel PowerSchool, utilisé dans plusieurs établissements manitobains (à 2min.). Futur étudiantZone étudianteZone employéMédiasFondation et AlumniRetraitésUrgenceOffres d'emploi Études Études (Registrariat)Programmes d'études offertsRépertoire des cours et horairesBibliothèqueDépartementsAide financière et boursesSociétés techniquesStages et emploisServices aux étudiantsGo-Poly Recherche Informations généralesRépertoire des expertisesChaires, laboratoires et groupesProjets de recherche pour étudiants aux études supérieuresSoutien aux chercheursProjets de recherche en partenariatStagiaires postdoctoraux Entreprises Embaucher un stagiaire ou recruter un étudiantFaire de la recherche en partenariatAcquisition d'une technologieAccéder à notre infrastructure de rechercheFormation continue À propos Renseignements générauxDocuments officielsInternationalFemmes et génieDéveloppement durablePropolys (soutien à l'entrepreneuriat)Direction et gouvernanceServicesAvis de confidentialité et conditions d’utilisationAccessibilitéNous joindre 2500, chemin de Polytechnique Montréal (Québec) H3T 1J4 (514) 340-4711 Suivez-nous! Faire un don",
  "content_length": 6232,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:42"
}