{
  "name": "Omer Khan",
  "homepage": "https://khan.engr.uconn.edu",
  "status": "success",
  "content": "Prof. Omer Khan, UConn Search Omer Khan Professor Electrical and Computer Engineering College of Engineering University of Connecticut Biography Dr. Khan is a Professor of Electrical and Computer Engineering at the University of Connecticut. He leads the Computer Architecture Group (CAG) and also serves as an Associate Director of the Connecticut Advanced Computing Center (CACC). His research interests include computer architectures that exploit parallelism and locality for high-performance applications, such as graph intelligence problems. He has contributed architectural advancements for futuristic massively parallel microprocessors that substantially enhance system level performance and efficiency. Prior to joining UConn, Khan was a Postdoctoral Research Scientist at the Massachusetts Institute of Technology. He received Ph.D. from the University of Massachusetts Amherst. He spent several years in the semiconductor industry as a high-performance processor architect. Dr. Khan is addressing the computational complexity problem in artificial intelligence applications that must handle increasingly large and sparse graph-based data, and optimize multiple goals at once, like finding the best trade-off between speed, fuel efficiency, and weather for autonomous vehicles. Efficient processing of sparse and multi-objective graph intelligence problems is extremely challenging since the underlying computations are highly irregular and require complex mathematical operations whose processing suffers from performance scaling challenges on existing hardware processing units. Dr. Khan is developing computer architectures that exploit sparsity for performance and massive parallelism to rapidly accelerate computationally hard artificial intelligence problems. This means exact solutions that used to take minutes to generate can be found in seconds or less. This allows decision-makers to have access to real-time information, leading to better decision-making in high-impact application scenarios. Announcements Recruiting PhD students to work on massively parallel computer architectures for graph intelligence problems. Contact me via email. Interests Computer Architecture Parallel Processor Secure Processor Graph Intelligence Education PhD in Electrical and Computer Engineering, 2009 University of Massachusetts Amherst BSc in Electrical and Computer Engineering, 2000 Michigan State University Projects Research Activities My research interests can be generalized to the field of Computer Architecture and Systems. My current research deals with hardware–software mechanisms for parallelism, security, and resiliency of future parallel computer architectures. I enjoy simulating and building architecture prototypes. Parallel Computer Architectures Many emerging applications comprise real-time automated processing, interpretation, and intelligent decisions using large volumes of input data, while simultaneously decreasing the time necessary to arrive at a decision. The objective of this research is to explore both hardware and software parallelism challenges holistically, characterize key bottlenecks, and explore architectural methods that improve performance, lower energy, and lower programmer effort. Multi-Objective Graph Intelligence – ICS'25 OPMOS Accelerating Graph Neural Networks – CAL'25, HPCA'24, ASPLOS'24, CAL'23, ISPASS'23, ICCAD'23, ICCD'22-Temporal GNNs, ICCD'22 Sparse GNNs, ICCD'22 GNNs on ReRAM, ICCD'22 GNNs on Quantum – You can view the special session’s Video Recording Accelerating Graph Processing – HPCA'22, CAL'21, HPEC'21, ICS'20, ISPASS'19, IPDPS'18, Micro'17, IISWC'15 Moving Compute to Data Model – Micro'20, TACO'19, IPDPS'17 Locality-Aware Cache Coherence – ISCA'13, HPCA'14, PACT'15, TACO'16, CAL'11 Library Cache Coherence – MIT-TR'11 The Execution Migration Machine – COMPUTER'15, CAL'14, NOCS'11 Asymmetric Multicores – PACT'11, PACT'12, GLSVLSI'10 Architecture for High Performance Power Electronics – RTSS'11, DATE'13 Secure Parallel Architectures Computer systems have recently seen a rise of malicious exploits on processor hardware. Virtualization technologies expose hardware resources, thus requiring strong isolation and obfuscation guarantees for security. Moreover, with the advent of confidential computing, the authenticity of sensitive code execution requires fast remote attestations. This research aims to address these challenges by devising methods to secure parallel processors, while meeting the efficiency and responsiveness expectations of the system. Secure Processor – HOST'24, TC'23, TACO'23, CAL'22, SEED'21, HPCA'20, TC'20, CAL'18, BARC'16, HPCA'14 Timing Side-Channels – JETC'23, ICCD'22, SEED'22, HPEC'21, HOST'21 Oblivious RAM – ICCD'18, arXiv'17 Hardware Trojans – TDSC'19 Memory Safety – HASP'15, ICCD'15 Resilient Parallel Architectures The focus of this reseaerch is to build architectural mechanisms and protocols that exploit application through hardware layers to co-optimize processor resiliency and efficiency. Resilient Processor – TACO'21, TECS'18, CAL'15, COMPUTER'13, ICCD'17, TC'10, TDSC'11, ITC'10, DATE'09, DATE'09 Near-Threshold Computing – TACO'14, WNTC'14 Multicore Thermal Management – HiPEAC'09, DATE'09, ICCAD'08 Open Source Software MergePath-SpMM: Parallel Sparse Matrix-Matrix Algorithm for Graph Neural Network Acceleration, ISPASS'23 Download Link HeteroMap: A Runtime Performance Predictor for Efficient Processing of Graph Analytics on Heterogeneous Multi-Accelerators, ISPASS'19 Download Link CRONO: A Benchmark Suite for Multithreaded Graph Algorithms Executing on Futuristic Multicores, IISWC'15 Download Link A Cycle-level Multithreaded Multicore Simulator for the 1000-core Era, TCAD'12, ISPASS'11 Download Link DARSIM: A parallel cycle-level NoC Simulator, MoBS'10 Download Link Research Experiences for Undergraduates (REU) I am the principal investigator for the NSF REU Site on Trustable Embedded Systems Security. To learn more about the research projects and highlights from past summers, visit the REU site’s official webpage .js-id-Demo Recent Publications Discover relevant content by filtering all publications. Leo Gold, Adam Bienkowski, David Sidoti, Krishna Pattipati, Omer Khan (2024). OPMOS: Ordered Parallel Algorithm for Multi-Objective Shortest-Paths. 2025 ACM International Conference on Supercomputing (ICS ’25). PDF Cite DOI Omer Khan (2025). A Data Prefetcher-Based 1000-Core RISC-V Processor for Efficient Processing of Graph Neural Networks. 2025 IEEE Computer Architecture Letters. PDF Cite DOI Hanan Khan, Deniz Gurevin,Omer Khan (2025). Graph Input-Aware Matrix Multiplication for Pruned Graph Neural Network Acceleration. 2025 IEEE International Parallel and Distributed Processing Symposium (IPDPS). Cite Zachary DiMeglio, Jenna Bustami, Deniz Gurevin, Chenglu Jin, Marten van Dijk, Omer Khan (2024). Masked Memory Primitive for Key Insulated Schemes . 2024 IEEE International Symposium on Hardware Oriented Security and Trust (HOST). PDF Cite DOI Deniz Gurevin, Mohsin Shan, Shaoyi Huang, MD Amit Hasan, Caiwen Ding, Omer Khan (2024). PruneGNN: Algorithm-Architecture Pruning Framework for Graph Neural Network Acceleration. 2024 IEEE International Symposium on High-Performance Computer Architecture (HPCA). Cite DOI Jared Nye, Usman Ali, Omer Khan (2024). SSE: Security Service Engines to Scale Enclave Parallelism for System Interactive Applications. 2024 International Symposium on Secure and Private Execution Environment Design (SEED). Cite DOI Hongwu Peng, Xi Xie, Kaustubh Shivdikar, Md Amit Hasan, Jiahui Zhao, Shaoyi Huang, Omer Khan, David Kaeli, Caiwen Ding (2024). MaxK-GNN: Extremely Fast GPU Kernel Design for Accelerating Graph Neural Networks Training. Proceedings of the 29th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 2. PDF Cite DOI See all publications Students Current Graduate Students Leo Gold Anna Kelley Abdul Hanan Gul Khan Former Students Doctoral Shaoyi Huang, Ph.D. 2024, UConn (Assistant Professor, Stevens Institute of Technology) Deniz Gurevin, Ph.D. 2024, UConn (Synopsys) Usman Ali, Ph.D. 2023, UConn (Meta) Mohsin Shan, Ph.D. 2023, UConn (Qualcomm, Austin) Hamza Omar, Ph.D. 2020, UConn (Qualcomm) Masab Ahmad, Ph.D. 2019, UConn (AMD Research) Halit Dogan, Ph.D. 2018, UConn (Intel) Qingchuan Shi, Ph.D. 2017, UConn (AMD) Farrukh Hijaz, Ph.D. 2016, UConn (Facebook) George Kurian, Ph.D. 2015, MIT (Google) Masters Zachary DiMeglio, M.S. 2024, UConn Jared Nye, M.S. 2023, UConn Rasheed Sahni, M.S. 2022, UConn (Qualcomm) Salman Khaliq, M.S. 2022, UConn (Qualcomm) Brandon D’Agostino, M.S. 2021, UConn (PhD Student at Stanford University) Akif Rehman, M.S. 2019, UConn (Qualcomm) Kartik Lakshminarasimhan, M.S. 2016, UConn (PhD Student at Ghent University) Undergraduates Anastasiia (Nastia) Drozdova (UG student) Maryam Abuissa (REU student), Summer 2023) Alison Menezes, (REU student), Summer 2023) JiWon Kim, (REU student), Summer 2023) Jenna Bustami (REU student), Summer 2022) Jared Nye (REU student, Summer 2021) Maia Iyer (REU student, Summer 2019) Brandon D’Agostino (REU student, Summer 2019, AY 2019-21) Adithya Nott (REU student, Summer 2017) Siena Biales (REU student, Summer 2016) Emanuel Correa (REU student, Summer 2016) James Palmer (REU student, Summer 2016) Astha Patni (REU student, Summer 2015) Michal Zielinski (UG student, Summer 2015) Matthew Seita (REU student, Summer 2014) Ethan Johnson (REU student, Summer 2014) Neil Butcher (REU student, Summer 2013) Teaching Computer Architecture ECE 5402/ CSE 5302/ CSE 4302: Fall 2025, Fall 2024, Fall 2023, Fall 2022, Fall 2021, Fall 2020, Fall 2017, Fall 2016, Fall 2015, Fall 2013 Digital Systems Design ECE 3401/ CSE 3302: Spring 2025, Spring 2024, Spring 2023, Spring 2022, Spring 2021, Spring 2020, Spring 2019, Spring 2018, Spring 2017, Spring 2016, Spring 2015 Multicore Architecture ECE 6095: Spring 2016, Spring 2014 Digital Design Lab ECE 4401: Fall 2014, Fall 2",
  "content_length": 15720,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:48"
}