{
  "name": "Omid Abari",
  "homepage": "https://web.cs.ucla.edu/~omid",
  "status": "success",
  "content": "Omid Abari Omid Abari Associate Professor, Computer Science UCLA Email: omid@cs.ucla.edu Office: ENG VI - Room 497B Short Bio: I am an Associate Professor in the department of Computer Science at the University of California, Los Angeles (UCLA) where I lead Intelligent Connectivity (ICON) research group. I received my PhD from Computer Science and Artificial Intelligence Laboratory (CSAIL) at Massachusetts Institute of Technology (MIT), working with Professor Dina Katabi and Professor Anantha Chandrakasan. I received my Master's degree from MIT and my Bachelor's degree from Carleton University, Canada. Research Interests: My research group focuses on developing smart Internet of Things (IoT) systems across the full stack—from energy-efficient hardware to adaptive, AI-driven software and applications. We design and build integrated software–hardware systems that enable ubiquitous sensing, intelligent computation, and seamless connectivity to support emerging data-driven applications. Selected Publications: Check this page for a complete list of publications. ICML 2024: NeWRF: A Deep Learning Framework for Wireless Radiation Field Reconstruction and Channel Prediction [PAPER] ACM MobiCom 2024: Enabling On-Demand Low-Power mmWave Repeaters via Passive Beamforming [PAPER] ACM MobiCom 2023: Bringing Millimeter Wave Technology to Any IoT Device [PAPER] ACM SIGCOMM 2023: A Millimeter Wave Backscatter Network for Two-Way Communication and Localization [PAPER] ACM/IEEE IPSN 2023: Turning Processors to Low Overhead Radios Using Side-Channels [PAPER] USENIX NSDI 2023: A Steerable, Transflective Metamaterial Surface for NextG mmWave Networks [PAPER] ACM SIGCOMM 2021: mmTag: a Millimeter Wave Backscatter Network [PAPER] ACM MobiCom 2021: Can WiFi Backscatter Replace RFID? [PAPER] ACM UIST 2021: PocketView: Through-Fabric Information Displays [PAPER] ACM SIGCOMM 2020: WiTAG: Seamless WiFi Backscatter Communication [PAPER] ACM MobiSys 2020: GreenTag: Soil Moisture Sensing with Commodity RFID Systems [PAPER] ACM SenSys 2020: Sensing Finger Input Using An RFID Transmission Line [PAPER] ACM SIGCOMM 2019: mmX: A Millimeter Wave Network for Billions of Things [PAPER] ACM MobiSys 2019: Are RFID Sensing Systems Ready for the Real World? [PAPER] ACM UIST 2019: Tip-Tap: Battery-free Discrete 2D Fingertip Input [PAPER] ACM MobiCom 2018: RFID Hacking for Fun and Profit [PAPER] ACM SIGCOMM 2018: ReMix: In-body Backscatter Communication and Localization [PAPER] ACM SIGCOMM 2018: Agile-Link: Fast Millimeter Wave Beam Alignment [PAPER] MIT PhD Thesis: Software-hardware Systems for the Internet-of-Things [THESIS] USENIX NSDI 2017: MoVR: Enabling High-Quality Untethered Virtual Reality [PAPER] ACM SIGCOMM 2015: Caraoke: An E-Toll Transponder Network for Smart Cities [PAPER] IEEE INFOCOM 2015: AirShare: Distributed Coherent Transmission Made Seamless [PAPER] IEEE INFOCOM 2014: BigBand: GHz-Wide Sensing and Decoding Using the Sparse Fourier Transform [PAPER] IEEE ISSCC 2014: A 0.75 Million-Point Fourier Transform Chip for Frequency-Sparse Signals [PAPER] MIT MS Thesis: Building Compressed Sensing Systems : Sensors and Analog-to-Information Converters [THESIS] IEEE TCAS 2013: Why Analog-to-Information Converters Suffer in High-Bandwidth Sparse Signal Applications [PAPER] IEEE TCAS 2013: Energy Aware Design of Compressed Sensing Systems for Wireless Sensors [PAPER] IEEE ICASSP 2012: Performance Trade-offs and Design Limitations of Analog-To-Information Converter Front-Ends [PAPER] Awards: 2023: NSF CAREER Award 2022: UCLA Society of Hellman Fellows Award 2017: ACM Student Research Competition (SRC) Grand Finals Winner 2016: ACM MobiCom Student Research Competition Winner, Gold Medal 2016: Boston Is The Smartest City (BITS) Competition Winner 2015: ACM Student Research Competition (SRC) Grand Finals Winner 2014: ACM MobiCom Student Research Competition Winner, Gold Medal 2013: NSERC Alexander Graham Bell Canada Graduate Scholarship 2011: Merrill Lynch Fellowship 2010: Senate Medal for Outstanding Academic Achievement Current Members (PhD Students and Postdocs): Haofan Lu Haochen Zhao Christopher Vattheuer Jian-Tiang Ko Shanmu Wang Alumni (PhD Students and Postdocs): Tianxiang Li Antony Irudayaraj Mohammad Mazaheri Ju WangAli Abedi",
  "content_length": 4277,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:47"
}