{
  "name": "Omid Ardakanian",
  "homepage": "http://webdocs.cs.ualberta.ca/~oardakan",
  "status": "success",
  "content": "Omid Ardakanian Associate Professor Department of Computing Science University of Alberta ardakanian@ualberta.[NULL]ca I am an associate professor in the Department of Computing Science at the University of Alberta. My research addresses systems challenges in sensor networks, data centers, and energy systems. I use optimization, control, and machine learning techniques to enhance the design and operation of networked, embedded, and cyber-physical systems. The Sustainable Computing Research Lab | Publications | Google Scholar Bio Omid Ardakanian is an Associate Professor in the Department of Computing Science at the University of Alberta and a Principal Investigator of Future Energy Systems. His research focuses on designing algorithms for performance monitoring and control of networked, embedded, and cyber-physical systems. He received the BSc in Computer Engineering from Sharif University of Technology in Iran, and the MMath and PhD in Computer Science from the University of Waterloo in Canada. Before joining UofA, he was a NSERC postdoctoral fellow at the University of California, Berkeley and the University of British Columbia. He currently serves as Treasurer for ACM SIGEnergy, Area Editor of Energy Informatics Review (EIR), and on the steering committee of ACM e-Energy. Dr. Ardakanian is a recipient of the ACM SIGEnergy Rising Star Award, the ASTech Award for Outstanding Achievement in AI/ML Advancement: Energy and Environmental Innovation, and the University of Waterloo Outstanding Achievement in Graduate Studies Award. He won the 2024 ACM e-Energy Test of Time Award for his research that also received the Best Paper Award at the Fourth International Conference on Future Energy Systems (ACM e-Energy) in 2013. He also received the best paper award at ACM BuildSys 2016 and 2022, and IEEE Power and Energy Society General Meeting 2017. Note to prospective students: I am always looking for motivated undergraduate, masterâs, and PhD students interested in computer systems, particularly those with a strong background in optimization theory and machine learning. I especially encourage women and students from equity-seeking groups to apply to my group. If you are considering graduate studies at the University of Alberta, please read this page before submitting your application. You must have a degree in Computer Science, Computer Engineering, or a closely related discipline (in that case you should have completed core CS courses). Additionally, PhD applicants are expected to have at least one publication in a top-tier conference, workshop, or journal in your area of research. If your background aligns with my research areas and you meet the criteria above, you may contact me by email. Please include your CV, a brief summary of your background and research interests, the name of one of my projects that you would like to contribute to, and the word \"Houseplant\" in the subject line. Please note that while I may not be able to respond to every inquiry, I do review all emails and application materials submitted through the official system. Promising candidates may be invited for an interview. What's new? Sept. 2025 — Two papers accepted in BuildSys 2025. Congratulations Amirhossein and Steve! May 2025 — Paper accepted in the 25th Privacy Enhancing Technologies Symposium. Congratulations Xin! May 2025 — Participated in a panel on AI and Energy to discuss opportunities for data centre development in Alberta and beyond. The panel was part of the 2025 Resilient and Clean Energy Systems Workshop. Apr. 2025 — Tianyu received the 2025 SIGEnergy Doctoral Dissertation Award Honorable Mention 🎉 Congratulations! Mar. 2025 — Javier received the CS department's best MSc thesis runner-up award. Way to go, Javier! Nov. 2024 — Served on the technical program committee of ACM SenSys 2025. Jun. 2024 — I am truly honored to receive the SIGEnergy Rising Star Award! I gave my award talk at ACM eEnergy 2024 in Singapore. Slides can be downloaded from here. May 2024 — I am thrilled to receive the ACM eEnergy Test of Time Award along with S. Keshav and Catherine Rosenberg for our paper on distributed congestion control for electric vehicle charging which was published in ACM eEnergy 2013. May 2024 — Our paper on analyzing age of inforamtion in multi-source updating systems is accepted in IEEE Communications Letters. Congratulations Aresh! Apr. 2024 — Paper accepted in IEEE Sensors Journal. Congratulations Sanju and Xin! Mar. 2024 — Three papers accepted in ACM e-Energy 2024! Dec. 2023 — Tianyu defended his PhD thesis entitled \"Data-enabled Optimization of Building Operations\". Congratulations Dr. Zhang! Dec. 2023 — Our paper on grey-box Bayesian optimization is accepted at the AI for Social Impact special track of AAAI 2024. Congratulations Shadan! Aug. 2023 — Papers accepted in ACM Transactions on Sensor Networks and ACM CCS Workshop on CPS&IoT Security and Privacy. Congratulations Xin! Jul. 2023 — Amirhossein won first place in the solar generation forecasting competition organized as part of the IEEE PES General Meeting. May 2023 — Three papers accepted to the ACM e-Energy conference. Congratulations Afia, Javier, Saidur, and Karim! Feb. 2023 — Paper on reducing the training cost of RL agents for HVAC control got accepted in Energy and Buildings. Congratulations Aakash and Tianyu! Dec. 2022 — Gave a talk at the Department of Computer Science and Technology, University of Cambridge, as part of the EEG seminar series. Nov. 2022 — Received the ASTech Award for Outstanding Achievement in AI/ML Advancement: Energy and Environmental Innovation! Nov. 2022 — Received the Best Paper Award at ACM BuildSys for our work on optimizing the operation of virtual power plants! Sept. 2022 — Papers accepted in ACM BuildSys 2022 and IEEE Transactions on Industrial Informatics. Congratulations Saidur and Yuan! Mar. 2022 — Serving on the organizing committee and technical program committee of ACM BuildSys 2022. Mar. 2022 — Paper accepted in Energy and Buildings. Congratulations Tianyu! Feb. 2022 — Our robust sizing paper is accepted in IEEE PES General Meeting 2022. Congratulations to Hadi! Jan. 2022 — I serve on the technical program committee of ACM e-Energy 2022. Sept. 2021 — Congratulations to Omid Hajihassani on the acceptance of his paper in ACM Transactions on Internet of Things. Aug. 2021 — I'm serving on the TPC of ACM BuildSys 2021 and ACM SIGEnergy RLEM 2021. Apr. 2021 — Two papers accepted in ACM e-Energy 2021. Congratulations Tianyu, Gaby, Ray, and Moosa! Apr. 2021 — I'm serving as Web Co-chair of ACM BuildSys 2021. You can find the CFP here. Feb. 2021 — Our journal paper got accepted in Energy and Buildings. Congratulations Tianyu and Monir! Jan. 2021 — New paper accepted in ACM/IEEE IoTDI 2021. Jan. 2021 — Congratulations to Zishan and Moosa on the acceptance of their paper in IEEE Transactions on Smart Grid. Nov. 2020 — Our BuildSys poster was the runner-up for the best poster award. Congratulations Tianyu! Oct. 2020 — I'm a TPC co-chair of ACM e-Energy 2021. Check out the CFP and submit your best work to this SIG sponsored conference. Aug. 2020 — I'm organizing the 2nd International Workshop on Performance and Modelling of Energy Systems for IFIP Performance 2020. Jul. 2020 — I'm serving on the technical program committee of ACM BuildSys 2020 and IEEE GLOBECOM 2020 (SAC - SGCPLC). Jun. 2020 — Our paper on adaptive congestion control for EV charging is accepted in ACM e-Energy 2020. Watch the video presentation. May 2020 — I served on the technical program committee of International Conference on Parallel Processing (ICPP'20). Feb. 2020 — I'm serving on the technical program committee of ACM e-Energy 2020 and am the co-organizer of a workshop on \"Challenges and opportunities in the design and operation of energy storage systems\". Jan. 2020 — We had two papers accepted in ACM/IEEE ICCPS and IEEE ICC. Congratulations to Zishan, Moosa, and Evandro! Dec. 2019 — I served on the technical program committee of IEEE ICC Smart Grid Communications 2020. Nov. 2019 — A workshop paper and a poster accepted in ACM BuildSys 2019. Congratulations to Tianyu. Monir, and Leepakshi! Oct. 2019 — One paper accepted in IEEE Smartgridcomm 2019. Sept. 2019 — Our IEEE TSG paper entitled \"Bayesian Learning-Based Harmonic State Estimation in Distribution Systems with Smart Meter and DPMU Data\" is in press. Jun. 2019 — EnergyBoost was one of the bast paper award finalists of ACM e-Energy 2019 [check out the photo]. Apr. 2019 — Two papers accpeted in ACM e-Energy 2019. Congratulations to Baihong, Mohammad, Tianyu and Zishan! Mar. 2019 — Check out this blog post about our recent work presented in NIPS 2018 FEAP-AI4Fin workshop. Feb. 2019 — I served on the technical program committee of the Tenth ACM International Conference on Future Energy Systems. Jan. 2019 — Congratulations to Tianyu for having his first paper accepted in ACM/IEEE IoTDI 2019! Jan. 2019 — Our IEEE TCNS paper entitled \"On Identification of Distribution Grids\" is in press. Dec. 2018 — I served on the technical program committee of IEEE ICC Smart Grid Communications 2019. Dec. 2018 — I delivered a talk on sparsity in distribution networks and how it facilitates system identification at ePerf workshop in Toulouse, France. Oct. 2018 — I co-chaired \"Data, Analytics, and Synchrophasors for Transparent Distribution Networks\" Workshop at IEEE Smartgridcomm 2018. Sept. 2018 — I served on the \"AI and Future Energy Systems\" panel of the International Symposium on Applications of Artificial Intelligence. Jul. 2018 — Paper on Sparse Bayesian Learning for Harmonic State Estimation accepted in IEEE SmartGridComm 2018. Apr. 2018 — Paper on data-driven occupancy modelling accepted in ACM e-Energy 2018. Apr. 2018 — I am excited to kick off a collaboration with ATB Financial and be part of the their AI lab (read more about our four-year partnership between UAlberta and ATB). Mar. 2018 — I currently serve as the Information",
  "content_length": 12054,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:49"
}