{
  "name": "Omprakash Gnawali",
  "homepage": "http://www2.cs.uh.edu/~gnawali",
  "status": "success",
  "content": "Omprakash Gnawali Omprakash Gnawali Associate Professor Department of Computer ScienceUniversity of Houstonodgnawal@central.uh.edu Office: PGH 230 Mail:Department of Computer Science 3551 Cullen Blvd., Room 501 Houston, TX 77204-3010 Phone: +1 713 743 3356 (email preferred) Office Hours: By appointment I do research in the areas of Internet of Things, smart and mobile devices, sensor networks and analysis of data from these and other networks using modern artificial intelligence technologies. I have also served as an expert witness in patent and other cases. I am looking for outstanding Undergraduate, Masters, and Ph.D. students for research. Typically, I can consider Masters students for funding only after working together for a semester. Brief bio: Postdoc (Stanford University), Ph.D. (University of Southern California), Masters and Bachelors (Massachusetts Institute of Technology). List of Publications Sample research areas and projects Ultra-wide Band (UWB) location technologies Collection Tree Protocol CodeDrip Routing with Node Mobility in Wireless Networks Wireless Network Experimentation Methodology Tenet: Sensor Network Architecture Smart Eyewear Systems Mobile Image Webs Keyword Search in Peer-to-peer Network I work with a group of student collaborators at the Networked Systems Laboratory. Please visit the lab website to learn about current projects. Check out Research Diaries to learn about different aspects of planning or doing research. Teaching COSC 6321 : Research Methods in Computer Science. F2012 F2013 F2014 F2015 S2017 S2019 S2020 F2021 S2023 S2024 S2025 COSC 4397/6397 : Cyber-physical Systems - F2012 COSC 6377 : Computer Networks (graduate) - F2011 F2012 S2014 S2015 F2016 F2017 F2018 S2019 S2020 S2021 S2022 F2023 COSC 4377 : Introduction to Computer Networks (undergraduate) - S2012 S2021 F2022 Some Service Activities Technical Program Committee: ACM/IEEE IPSN 2012-2017, ACM SenSys 2012, 2016 Chair, TinyOS Network Protocol Working Group, 2007 - 2012 TinyOS 2.1 Tutorial at ACM/IEEE IPSN, April 2009.",
  "content_length": 2051,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:48"
}