{
  "name": "Omri Abend",
  "homepage": "http://www.cs.huji.ac.il/~oabend",
  "status": "success",
  "content": "Omri Abend's Homepage Omri Abend School of Computer Science and Engineering Department of Cognitive and Brain Sciences, Chair The Hebrew University of Jerusalem I am a faculty member in the Hebrew University. My fields of interest are Computational Linguistics and Natural Language Processing. Specifically, I conduct research on semantic (meaning) representation from a computational perspective. My research is tightly linked to statistical learning, language technology, such as machine translation and information extraction, and to the computational modeling of child language acquisition. Some of the projects/research questions I am engaged in: Grammatical and semantic representation, asking what semantic grammatically-relevant information should be manually encoded and how. The representation approach we developed is Universal Conceptual Cognitive Annotation (UCCA), and it is inspired by typological and cognitive approaches to grammar. How can we map text (strings) into structured meaning representation? This line of work is deeply tied to machine learning. Computational modeling of child language acquisition: how do infants acquire their first words, while making their first steps in acquiring syntax? Inducing lexical relations from text: how can distributional information, extracted from statistical regularities in large bodies of text, be used to infer the meanings of words and expressions? Unsupervised approaches to grammar: what about grammar can be learned without any manual annotation? Brief Bio: I am an associate professor at the Hebrew University, working in the departments of Computer Science and Cognitive Science. Previously I was a research associate (post-doc) with Mark Steedman under the GramPlus project. I earned my PhD from the Hebrew University, where my supervisor was Ari Rappoport. During my PhD studies, I was a member of the Azrieli Fellows Program. Before that, I studied mathematics and cognitive sciences in the Hebrew University (BSc, summa cum laude). | Publications | Community | Download | Teaching | Contact Info | Publications Surveying the Landscape of Image Captioning Evaluation: A Comprehensive Taxonomy, Trends and Metrics Analysis Uri Berger, Gabriel Stanovsky, Omri Abend and Lea Frermann. To appear in TACL. Computational Analysis of Character Development in Holocaust Testimonies Esther Shizgal, Eitan Wagner, Renana Keydar and Omri Abend. EMNLP 2025. Mind Your Theory: Theory of Mind Goes Deeper Than Reasoning Eitan Wagner, Nitay Alon, Joseph M. Barnby and Omri Abend. Findings of ACL 2025. T5Score: A Methodology for Automatically Assessing the Quality of LLM Generated Multi-Document Topic Sets Itamar Trainin and Omri Abend. Findings of ACL 2025. The ShareLM Collection and Plugin: Contributing Human-Model Chats for the Benefit of the Community Shachar Don-Yehiya, Leshem Choshen and Omri Abend. ACL 2025 Demo Track. Beneath the Surface of Consistency: Exploring Cross-lingual Knowledge Representation Sharing in LLMs Maxim Ifergan, Omri Abend, Idan Szpektor, Leshem Choshen and Roee Aharoni. Findings of NAACL 2025. The Future of Open Human Feedback Shachar Don-Yehiya, Ben Burtenshaw, Ramon Fernandez Astudillo, Cailean Osborne, Mimansa Jaiswal, Tzu-Sheng Kuo, Wenting Zhao, Idan Shenfeld, Andi Peng, Mikhail Yurochkin, Atoosa Kasirzadeh, Yangsibo Huang, Tatsunori Hashimoto, Yacine Jernite, Daniel Vila-Suero, Omri Abend, Jennifer Ding, Sara Hooker, Hannah Rose Kirk, Leshem Choshen. Nature Machine Intelligence, Vol. 7, pp. 825-835 (2025). Exploring the Learning Capabilities of Language Models using LEVERWORLDS Eitan Wagner, Amir Feder, Omri Abend. EMNLP 2024. CONTESTS: a Framework for Consistency Testing of Span Probabilities in Language Models Eitan Wagner, Yuli Slavutsky, Omri Abend. EMNLP 2024. Locally Measuring Cross-lingual Lexical Alignment: A Domain and Word Level Perspective Taelin Karidi, Eitan Grossman, Omri Abend. Findings of EMNLP 2024. Aligning Alignments: Do Colexification and Distributional Similarity Align as Measures of Cross-lingual Lexical Alignment Taelin Karidi, Eitan Grossman, Omri Abend. CoNLL 2024. A Language-agnostic Model of Child Language Acquisition Louis Mahon, Omri Abend, Uri Berger, Katherine Demuth, Mark Johnson, Mark Steedman. Computer Speech and Language (2024). A Nurse is Blue and Elephant is Rugby: Cross Domain Alignment in Large Language Models Reveal Human-like Patterns Asaf Yehudai*, Taelin Karidi*, Gabriel Stanovsky, Ariel Goldstein, Omri Abend. CogSci 2024. Cross-linguistically consistent semantic and syntactic annotation of child-directed speech Ida Szubert, Omri Abend, Nathan Schneider, Samuel Gibbon, Louis Mahon, Sharon Goldwater, Mark Steedman. Language Resources and Evaluation (LRE), 2024. Automatic Topic-Guided Segmentation of Holocaust Survivor Testimonies Eitan Wagner, Renana Keydar, Amit Pinchevski, Omri Abend. Journal of Computational Literary Studies (JCLS), 2024. Testimony from the Machine: Listening to Holocaust Testimony as a Whole Renana Keydar, Amit Pinchevski, Maxim Ifergan, Omri Abend. Law, Society and CultureLaw and the Material Turn 7 (in Hebrew), 2024. The Testimony of the Multitude: Towards a computational model of listening to Holocaust testimony Renana Keydar, Amit Pinchevski, Maxim Ifergan, Omri Abend. Holocaust and Genocide Studies (forthcoming). Human Learning by Model Feedback: The Dynamics of Iterative Prompting with Midjourney Shachar Don-Yehiya, Leshem Choshen and Omri Abend. EMNLP 2023. Event-Location Tracking in Narratives: A Case Study on Holocaust Testimonies Eitan Wagner, Renana Keydar and Omri Abend. EMNLP 2023. Improving Cross-lingual Transfer through Subtree-aware Word Reordering Ofir Arviv, Dmitry Nikolaev, Taelin Karidi and Omri Abend. Findings of EMNLP 2023. MuLER: Detailed and Scalable Reference-based Evaluation Taelin Karidi, Leshem Choshen, Gal Patel and Omri Abend. CoNLL 2023. DisentQA: Disentangling Parametric and Contextual Knowledge with Counterfactual Question Answering Ella Neeman, Roee Aharoni, Or Honovich, Leshem Choshen, Idan Szpektor and Omri Abend. ACL 2023. Area Chair Award for Best Paper in the Track. Parallel Context Windows for Large Language Models Nir Ratner, Yoav Levine, Yonatan Belinkov, Ori Ram, Inbal Magar, Omri Abend, Ehud Karpas, Amnon Shashua, Kevin Leyton-Brown and Yoav Shoham. ACL 2023. [Arxiv] A Large-Scale Multilingual Study of Visual Constraints on Linguistic Selection of Descriptions Uri Berger, Lea Frermann, Gabriel Stanovsky and Omri Abend. Findings of EACL 2023. [Paper] Evaluating and Improving the Coreference Capabilities of Machine Translation Models Asaf Yehudai, Arie Cattan, Omri Abend and Gabriel Stanovsky. EACL 2023. [Paper] Topical Segmentation of Spoken Narratives: A Test Case on Holocaust Survivor Testimonies Eitan Wagner, Renana Keydar, Amit Pinchevski and Omri Abend. EMNLP 2022. PreQuEL: Quality Estimation of Machine Translation Outputs in Advance Shachar Don-Yehiya, Leshem Choshen and Omri Abend. EMNLP 2022. Enhancing the Transformer Decoder with Transition-based Syntax Leshem Choshen and Omri Abend. CoNLL 2022. On Neurons Invariant to Sentence Structural Changes in Neural Machine Translation Gal Patel, Leshem Choshen and Omri Abend. CoNLL 2022. Cognitive Simplification Operations Improve Text Simplification Eytan Chamovitz and Omri Abend. CoNLL 2022. [Paper/supp. material] Reinforcement Learning with Large Action Spaces for Neural Machine Translation Asaf Yehudai, Leshem Choshen, Lior Fox and Omri Abend. COLING 2022. Semantics-aware Attention Improves Neural Machine Translation Aviv Slobodkin, Leshem Choshen and Omri Abend. *SEM 2022. A Computational Acquisition Model for Multimodal Word Categorization Uri Berger, Gabriel Stanovsky, Omri Abend, Lea Frermann. NAACL 2022. The Grammar-Learning Trajectories of Neural Language Models Leshem Choshen, Guy Hacohen, Daphna Weinshall, Omri Abend. ACL 2022. [Paper+appendices: pdf] On the Relation between Syntactic Divergence and Zero-Shot Performance Ofir Arviv, Dmitry Nikolaev, Taelin Karidi and Omri Abend. EMNLP 2021. [Paper+appendices: pdf][Code/data: github and github] Putting Words in BERT's Mouth: Navigating Contextualized Vector Spaces with Pseudowords Taelin Karidi, Yichu Zhou, Nathan Schneider, Omri Abend and Vivek Srikumar. EMNLP 2021. [Paper+appendices: pdf][Code/data: github] Q2: Evaluating Factual Consistency in Knowledge-Grounded Dialogues via Question Generation and Question Answering Or Honovich, Leshem Choshen, Roee Aharoni, Ella Neeman, Idan Szpektor and Omri Abend. EMNLP 2021. [Paper+appendices: pdf][Code/data: github] Paths to Relation Extraction through Semantic Structures Jonathan Yellin and Omri Abend. Findings of ACL 2021. [Paper+appendices: pdf][Code: github] Mediators in Determining what Processing BERT Performs First Aviv Slobodkin, Leshem Choshen and Omri Abend. NAACL 2021. [arXiv:pdf] PMI-Masking: Principled Masking of Correlated Spans Yoav Levine, Barak Lenz, Opher Lieber, Omri Abend, Kevin Leyton-Brown, Moshe Tennenholtz, Yoav Shoham. ICLR 2021. [openreview:pdf] Classifying Syntactic Errors in Learner Language Leshem Choshen, Dmitry Nikolaev, Yevgeni Berzak and Omri Abend. and Omri Abend. CoNLL 2020. [Paper/supp. material] MRP 2020: The Second Shared Task on Cross Framework and Cross Linguistic Meaning Representation Parsing. Stephan Oepen, Omri Abend, Lasha Abzianidze, Johan Bos, Jan Hajic, Daniel Hershcovich, Bin Li, Tim O'Gorman, Nianwen Xue, and Daniel Zeman. CoNLL 2020. [Paper/supp. material] [Website] Semantic Structural Decomposition for Neural Machine Translation Elior Sulem, Omri Abend and Ari Rappoport. *SEM 2020. [Paper/supp. material] Comparison by Conversion: Reverse-Engineering UCCA from Syntax and Lexical Semantics Daniel Hershcovich, Nathan Schneider, Dotan Dvir, Jakob Prange, Miryam de Lhoneux and Omri Abend. COLING 2020. [Paper/supp. material] Morphosyntactic Predictability of Translationese Dmitry Nikolaev, Taelin Karidi, Neta Kenneth, Veronika Mitnik, Lilja Maria Saeboe an",
  "content_length": 17526,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:49"
}