{
  "name": "Ondrej Lhoták",
  "homepage": "https://plg.uwaterloo.ca/~olhotak",
  "status": "success",
  "content": "Ondřej Lhoták Ondřej Lhoták [ Home ] [ Publications ] [ Teaching ] Professor Programming Languages Group David R. Cheriton School of Computer Science University of Waterloo 200 University Avenue West Waterloo, Ontario, N2L 3G1, Canada Office: DC 2520 Fax: +1-519-885-1208 E-mail: olhotak@uwaterloo.ca Waterloo's participation in the International Collegiate Programming Contest My research interests are in programming languages and compilers. My focus is on program analysis of object-oriented languages. I am currently directing most of my attention to Scala. Selected projects and research themes (current and former): - Safety of references in Scala JFP25, OOPSLA24, ECOOP24, TOPLAS23, OOPSLA23b, OOPSLA23c, Scala21, OOPSLA20a, OOPSLA20b, ECOOP20a, ECOOP20b, ECOOP20c - Theoretical foundations of Scala POPL20, OOPSLA19, OOPSLA17, Scala18, FTfJP17 - Interprocedural analysis and optimization of Scala OOPSLA23, OOPSLA16, TOSEM15, ECOOP14 - Flix, a declarative language for implementing program analyses ECOOP23, Datalog22, OOPSLA20c, PLDI16, ISSTA18, CC18, PPDP18 - Call graph construction for incomplete programs ECOOP13, ECOOP12 - Context-sensitive program analysis algorithms PLDI17, SAS15, CC11a, CC11b, CC10 - Scalability of software model checking SCP15, OOPSLA12, ASE11, JPF11, SPIN11 - Static analysis of temporal properties OOPSLA08, VMCAI17, ISMM09, ECOOP07, OOPSLA05 - Points-to analysis POPL11a, POPL11b, TOSEM08, CC06, PLDI05, CC03 - Program analysis using Binary Decision Diagrams TC10, SP&E09, TOPLAS08, LCPC08, LCPC07, PLDI04, PLDI03 Postdocs and graduate students (current and alumni): Postdocs Magnus Madsen(Aarhus U.) Pavel Parízek(Charles U.) PhD Edward Lee(current) Marianna Rapoport(Amazon) Rei Thiessen(Google) Karim Ali(U. Alberta) Nomair Naeem(U. Waterloo) Mirza Omer Beg(NUCES) Masters Harris Lau(current) Jin Xu(current) Jian Yu(current) Enze Xing(current) AmirHossein PashaeeHir(current) Pedro Oliveira(current) Yaoyu Zhao(PhD candidate, EPFL) Matt D'Souza(Oracle) James You(IBM) Michael Thode Alistair Finn Hackett(PhD candidate, U. British Columbia) Abel Nieto Rodriguez(PhD candidate, Aarhus U.) Zhong Sheng Hu(PhD candidate, McGill U.) Ifaz Kabir(PhD candidate, U. Alberta) Ming-Ho Yee(PhD candidate, Northeastern U.) Dan Brotherston(TD Bank) Marianna Rapoport(Amazon) Tarek Chammah Rei Thiessen(Google) Jonathan Rodriguez Alan Leung(Google) Adam Richard",
  "content_length": 2390,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:50"
}