{
  "name": "Ondrej Chum",
  "homepage": "http://cmp.felk.cvut.cz/~chum",
  "status": "success",
  "content": "Ondrej Chum chum@cmp.felk.cvut.cz Ondrej Chum Professor I am leading a team within the Visual Recognition Group at the Department of Cybernetics, Faculty of Electrical Engineering, Czech Technical University in Prague. I received the MSc degree in computer science from Charles University, Prague, in 2001 and the PhD degree from the Czech Technical University in Prague, in 2005. From 2006 to 2007, I was a postdoctoral researcher at the Visual Geometry Group, University of Oxford, United Kingdom. My research interests include large-scale image and particular object retrieval, object recognition, and robust estimation of geometric models. I am a member of Image and Vision Computing editorial board, and I have served as an area chair at major international conferences (e.g., ICCV, ECCV, CVPR, WACV and BMVC). I co-organize Computer Vision and Sports Summers School in Prague. I was the recipient of the Best Paper Prize at the BMVC 2002, Best Science Paper Honorable mention at BMVC 2017, and Saburo Tsuji Best Paper Award at ACCV 2018. I was awarded the 2012 Outstanding Young Researcher in Image & Vision Computing runner up for researchers within seven years of their PhD. Complete list of awards below. [. . .] CV HomePublications News PhD and PostDoc positions open in the group. Apply by sending me an e-mail. For PostDocs, include links to your CVPR, ICCV, ECCV, NIPS papers. Our paper Pritts, Kukelova, Larsson, and Chum : Rectification from Radially-Distorted Scales, ACCV 2018 has received the Saburo Tsuji Best Paper Award. Ph.D. Students Tomas Jenicek Nikos Efthymiadis, (co-advised with Giorgos Tolias) Nikolaos-Antonios Ypsilantis Close collaborators Giorgos Tolias assistant professor Graduated Arun Mukundan (co-advised with Giorgos Tolias) Ph.D. 2020 Thesis: Local Descriptors for Image Matching and Retrieval James Pritts (co-advised with Zuzana Kukelova) Ph.D. 2020, moved on to Oculus Thesis: Methods for the Rectification of Imaged Coplanar Repeated Patterns Javier Aldana (co-advised with Jiri Matas) Ph.D. 2020, moved on to Avast Thesis: Relevant Shot Detection with Local Features for Video Re-ranking Filip Radenovic Ph.D. 2019, moved on to Facebook Thesis: Visual Retrieval with Compact Image Representations Andrej Mikulik (co-advised with Jiri Matas) Ph.D. 2015, moved to Google Thesis: Large-Scale Content-Based Sub-Image Search Alumni Ahmet Iscen moved on to Google Pierre Jacob Assia Benbihi Contact Karlovo namesti 13, 121 35 Praha 2, Czech Republic Office: G3 (building G, room 3), directions Tel: +420 2 2435 7282 Awards Rector's award for prestigeous publication (one per year per CTU in Prague) for paper Radenovic, Tolias, Chum: Fine-tuning CNN Image Retrieval with No Human Annotation, TPAMI'19 Saburo Tsuji Best Paper Award at ACCV 2018 Pritts, Kukelova, Larsson, Chum: Rectification from Radially-Distorted Scales, ACCV'18 Best Science Paper Honorable Mention at BMVC 2017 Mukundan, Tolias, Chum: Multiple-Kernel Local-Patch Descriptor, BMVC'17 Longuet-Higgins Prize at CVPR 2017 Philbin,Chum,Isard,Sivic,Zisserman: Object Retrieval with Large Vocabularies and Fast Spatial Matching, CVPR'07 The 2012 Outstanding Young Researcher in Image & Vision Computing runner up for researchers within seven years of their PhD. Best Science Paper at BMVC 2002 Matas, Chum, Urban, Pajdla: RobustWide Baseline Stereo from Maximally Stable Extremal Regions, BMVC'02 Projects and code Unsupervised fine-tuning of CNN for retrieval Training data, fine-tuned deep neural networks and matlab evaluation code to reproduce the results of our ECCV 2016 paper. See the project page. Diffusion on Region Manifolds Diffusion paper on arXiv and the project page. Low dimensional feature maps Feature maps construction for kernels with low-dimensional compact interval input cast as a convex optimization problem. See our ICCV 2015 paper for details, Matlab code is available. Fixing LO-RANAC Fast and reliable two-view geometry estimation from our BMVC 12 paper , software page, and data. Results any RANSAC paper should compare to. USAC: Universal RANSAC A modular framework implementing a number of RANSAC extensions. Our PAMI 2013 paper and code and data zip archive are available. Homography from two correspondences Homography estimation from a correspondence of at least two elliptical featires: ICPR 2012 paper and Matlab code . Dataset: Alps100K Alps100K dataset contains 98,136 annotated (GPS coordinates, elevation, EXIF if available) outdoor images from mountain environments, from our BMVC 2015 paper. See the project page.",
  "content_length": 4557,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:50"
}