{
  "name": "Onur Mutlu",
  "homepage": "https://people.inf.ethz.ch/omutlu",
  "status": "success",
  "content": "Onur Mutlu's homepage Onur Mutlu I am a Professor of Computer Science at ETH Zurich, in the Information Technology and Electrical Engineering department. I am also affiliated with the Computer Science department. I am also an Adjunct Professor of Electrical and Computer Engineering at Carnegie Mellon University, where I held the Dr. William D. and Nancy W. Strecker Early Career Professorship, and an Adjunct Professor of Computer Engineering at Bilkent University. My research is in computer architecture, systems, security, and bioinformatics. My work spans and stretches the boundaries between applications, systems, languages, system software, compilers, and hardware. My research tackles many issues in high performance, energy efficiency, hardware security, fault tolerance, predictable systems, dependable systems, and hardware/software cooperation. I am especially excited about novel, fundamentally-secure and fundamentally-efficient computation, communication and memory/storage paradigms, applied to emerging systems, technologies, and bioinformatics/medical applications. I am also excited about system design for bioinformatics and biologically inspired computing paradigms. My bio-sketch, publications, selected talks, lectures, honors and awards, and CV. You can also find me on Youtube (as me), Youtube (as my past self), LinkedIn, Twitter and GitHub. My Research Group at ETH: SAFARI. My Research Group at CMU (old website): SAFARI@CMU Graduated PhD Students and Their PhD Dissertations Research & Teaching Overview White Paper (November 2021) SAFARI Newsletter, July 2024 Edition SAFARI Newsletter, June 2023 Edition SAFARI Newsletter, December 2021 Edition SAFARI Newsletter, January 2021 Edition SAFARI Newsletter, April 2020 Edition For Prospective Students: If you are interested in doing research with me (at any level: high school, bachelors, masters, PhD, postdoc, internship), please study our materials & apply here. After that, you can send me your CV and application ID via email. A very incomplete list of example potential Master's, Bachelor's and Semester projects are available here. I am always interested in working with bright and self-motivated students who have a passion for rigorously solving problems and who are willing to do proper justice to scientific exploration, evaluation & communication. I cherish working with students from all nationalities and diverse backgrounds in an open and inclusive environment. Some principles we follow in our research and research group are described in this mentoring presentation (from ISCA 2021), this interview (from ISCA 2023), and this longer interview (from ISCA 2019). Currently Teaching (Spring 2025): Digital Design & Computer Architecture Currently Teaching (Spring 2025): Fundamentals of Computer Architecture Currently Teaching (Spring 2025): Seminar in Computer Architecture Currently Teaching (Spring 2025): SAFARI Projects & Seminars in Computer Architecture and Genomics Most Recently Taught (Fall 2024): Computer Architecture Most Recently Taught (Fall 2024): Seminar in Computer Architecture Most Recently Taught (Fall 2024): SAFARI Projects & Seminars in Computer Architecture and Genomics Short Course (July 2024): Memory Systems and Memory-Centric Computing Systems (at HiPEAC ACACES Summer School) Recently Taught (Spring 2023): Digital Design & Computer Architecture Recently Taught (Spring 2023): Seminar in Computer Architecture Recently Taught (Spring 2023): SAFARI Projects & Seminars in Computer Architecture and Genomics Recently Taught (Fall 2022): Computer Architecture Recently Taught (Fall 2022): Seminar in Computer Architecture Recently Taught (Fall 2022): SAFARI Projects & Seminars in Computer Architecture and Genomics Recently Taught (Spring 2022): Digital Design & Computer Architecture Recently Taught (Spring 2022): Seminar in Computer Architecture Recently Taught (Spring 2022): SAFARI Projects & Seminars in Computer Architecture and Genomics Recently Taught (Fall 2021): Computer Architecture Recently Taught (Fall 2021): Seminar in Computer Architecture Recently Taught (Fall 2021): SAFARI Projects & Seminars in Computer Architecture and Genomics Recently Taught (Spring 2021): Digital Design & Computer Architecture Recently Taught (Spring 2021): Seminar in Computer Architecture Recently Taught (Spring 2021): SAFARI Projects & Seminars in Computer Architecture and Genomics Recently Taught (Fall 2020): Computer Architecture Recently Taught (Fall 2020): Seminar in Computer Architecture Recently Taught (Fall 2020): SAFARI Projects & Seminars in Computer Architecture and Genomics Recently Taught (Spring 2020): Digital Design & Computer Architecture Recently Taught (Spring 2020): Seminar in Computer Architecture Recently Taught (Fall 2019): Computer Architecture Recently Taught (Fall 2019): Seminar in Computer Architecture Recently-Taught Tutorial (February 2020): Memory Systems and Memory-Centric Computing Systems Recently-Taught Tutorial (September 2019): Memory Systems and Memory-Centric Computing Systems Recently-Taught Tutorial (July 2019): Memory Systems and Memory-Centric Computing Systems Recently-Taught Short Course (June 2019): Memory Systems and Memory-Centric Computing Systems Recently Taught (Spring 2019): Design of Digital Circuits Recently Taught (Spring 2019): Seminar in Computer Architecture Recently Taught (Fall 2018): Computer Architecture Recently Taught (Fall 2018): Seminar in Computer Architecture Short Course (October 2018): Memory Systems: Fundamentals, Recent Research, Challenges, Opportunities Short Course (July 2018): Memory Systems and Memory-Centric Computing Systems (at HiPEAC ACACES Summer School) Recently Taught (Spring 2018): Design of Digital Circuits Bio, Contact & CV Publications Talks News & Research Summaries Honors and Awards Lecture Videos & Course Materials Teaching Research Service Open Source Tools, Software and Data Sets",
  "content_length": 5921,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:51"
}