{
  "name": "Or Haim Anidjar",
  "homepage": "https://cris.ariel.ac.il/en/persons/or-haim-anidjar",
  "status": "success",
  "content": "Or Haim Anidjar - Ariel University View Scopus Profile Or Haim Anidjar Dr. Lecturer, Department of Computer and Software EngineeringFormer affiliationLecturer, Department of Computer Science https://orcid.org/0000-0002-7673-6511 20202025 Research activity per year Fingerprint Dive into the research topics where Or Haim Anidjar is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Speaker Change Detection Keyphrases 100% Speaker Diarization Computer Science 66% Textual Information Computer Science 50% Learning System Engineering 50% Convolutional Neural Network Computer Science 41% Diarization Keyphrases 40% Speech Analysis Keyphrases 40% Audio Recording Keyphrases 35% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2020 2024 2025 9 Article 2 Conference contribution 1 Conference article 1 Preprint Research output per year Research output per year Measuring and Analyzing Defects of Additive Manufactured Ti-6Al-4V Specimens Through Image SegmentationLang, R., Anidjar, O., Slonimsky, S., Hajaj, C., Golan, O., Matias, C., Diskin, A., Evgeny, S. & Mega, M., Dec 2025, In: Fatigue and Fracture of Engineering Materials and Structures. 48, 12, p. 5112-5129 18 p.Research output: Contribution to journal › Article › peer-review Open Access Lack of Fusion Defects 100% Critical Size Defect 100% Hot Isostatic Pressing 100% Print Quality 50% Cycles to Failure 50% Transformer-based language-independent gender recognition in noisy audio environmentsAnidjar, O. H. & Yozevitch, R., Dec 2025, In: Scientific Reports. 15, 1, 14421.Research output: Contribution to journal › Article › peer-review Open Access Audio Clips 100% Noisy Audio 100% Gender Recognition 100% Overrepresentation 100% Spectrogram 100% A Data-Driven NLP Approach to Analyzing Framing and Reframing in Design ProtocolsCasakin, H., Sopher, H., Anidjar, O. H. & Gero, J. S., 2024, Proceedings of the 42nd Conference on Education and Research in Computer Aided Architectural Design in Europe, eCAADe 2024. Kontovourkis, O., Phocas, M. C. & Wurzer, G. (eds.). Education and research in Computer Aided Architectural Design in Europe, p. 547-556 10 p. (Proceedings of the International Conference on Education and Research in Computer Aided Architectural Design in Europe; vol. 2).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › peer-review Design Protocol 100% Natural Language Processing 100% Data-driven Approach 100% Natural Language Processing Algorithm 100% Semantic Value 100% Extending limited datasets with GAN-like self-supervision for SMS spam detectionAnidjar, O. H., Marbel, R., Dubin, R., Dvir, A. & Hajaj, C., Oct 2024, In: Computers and Security. 145, 103998.Research output: Contribution to journal › Article › peer-review Self-supervision 100% Limited Datasets 100% Network-like 100% Generative Adversarial Networks 100% Generative Adversarial Model 100% 2 Scopus citations Harnessing the power of Wav2Vec2 and CNNs for Robust Speaker Identification on the VoxCeleb and LibriSpeech DatasetsAnidjar, O. H., Marbel, R. & Yozevitch, R., 1 Dec 2024, In: Expert Systems with Applications. 255, 124671.Research output: Contribution to journal › Article › peer-review Wav2vec 2.0 100% LibriSpeech 100% Robust Speaker Identification 100% Speaker Identification 100% VoxCeleb 100% 6 Scopus citations View all 13 Research outputs",
  "content_length": 3796,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:52"
}