{
  "name": "Orestis Telelis",
  "homepage": "https://www.ds.unipi.gr/en/faculty/telelis-en",
  "status": "success",
  "content": "Orestis Telelis - Department of Digital Systems Skip to content Orestis Telelis Phone +30 210-4142649 Email telelis@unipi.gr Title Assistant Professor Office Hours Tuesday 14:00 - 15:00, Thursday 12:00 - 14:00 Office 502 (Gr. Lambraki 126) Courses Algorithms for Electronic Markets — 7th semester Algorithms and Complexity — 4th semester Data Structures — 3rd semester Optimization Techniques — 6th semester Brief CV Orestis Telelis obtained his degree from the Department of Informatics and Telecommunications of the National and Kapodistrian University of Athens, in 2001. He received his M.Sc. Diploma in Advanced Information Systems (2003) and his Ph.D. in Theoretical Computer Science (2006), from the same department. He worked as a post-doctoral researcher in the Evry-Val d’Essonne University (France, 2007) and in Aarhus University (Denmark, 2007-2009). During the period 2009-2010 he received the “Allain Bensoussan” fellowship from the European Research Consortium for Informatics and Mathematics (ERCIM), for post-doctoral research at the Center for Mathematics and Computer Science (CWI Amsterdam) of the Netherlands. Subsequently, he worked as Research Associate in the Department of Computer Science of the University of Liverpool (United Kingdom, 2010-2012). In the period 2012-2014, he received funding from the General Secretariat of Research and Technology (Greece), for scientific research at the Athens University of Economics and Business. His research interests lie broadly within the fields of Algorithms Design and Analysis and of Computational Complexity. His recent work is on Algorithmic Game Theory (Mechanism Design, Computation and Efficiency of Equilibria, Auctions and Pricing Algorithms) and on Approximation Algorithms for computationally hard problems. Publications Publications 2015 – 2019 I) JOURNALS G. Birmpas, E. Markakis, O. Telelis, A. Tsikiridis: Tight Welfare Guarantees for Pure Nash Equilibria of the Uniform Price Auction. Theory of Computing Systems 63(7): 1451-1469 (2019) E. Markakis, O. Telelis: Item Bidding for Combinatorial Public Projects. Theoretical Computer Science 678: 40-55 (2017) P. Krysta, O. Telelis, C. Ventre: Mechanisms for Multi-unit Combinatorial Auctions with a Few Distinct Goods. Journal of Artificial Intelligence Research (JAIR) 53: 721-744 (2015). B. de Keijzer, G. Schaefer, O. Telelis: The Strong Price of Anarchy of Linear Bottleneck Congestion Games. Theory of Computing Systems 57(2): 377-396 (2015). E. Markakis, O. Telelis. Uniform Price Auctions: Equilibria and Efficiency. Theory of Computing Systems 57(3): 549-575 (2015). II) CONFERENCES P. Nikitopoulos, G. A. Sfyris, A. Vlachou, C. Doulkeridis, O. Telelis: Parallel and Distributed Processing of Reverse Top-k Queries. In Proceedings of the 35th IEEE International Conference on Data Engineering (ICDE), 2019: 1586-1589 G. Birmpas, E. Markakis, O. Telelis, A. Tsikiridis: Tight Welfare Guarantees for Pure Nash Equilibria of the Uniform Price Auction. Proceedings of the 10th International Symposium on Algorithmic Game Theory (SAGT) Springer LNCS 10504: 16-28, 2017 (Best Paper Award). E. Markakis, O. Telelis: Envy-Free Revenue Approximation for Asymmetric Buyers with Budgets. Proceedings of the 9th International Symposium on Algorithmic Game Theory (SAGT), Springer LNCS 9928: 247-259, 2016. E. Markakis, O. Telelis: Item Pricing for Combinatorial Public Projects. Proceedings of the 11th International Conference on Algorithmic Aspects of Information and Management (AAIM), Springer LNCS 9778: 1-13, 2016. P. Krysta, O. Telelis, C. Ventre: Near-Optimal Approximation Mechanisms for Multi-Unit Combinatorial Auctions. Proceedings of the 24th International Joint Conference on Artificial Intelligence (IJCAI), 2015: 4275-4281. Recent announcements 2nd Application Submission period for the M.Sc. Program “E-Learning” until Monday 16 June 2025 May 30, 2025 Call for Applications for the M.Sc. Program “Information Systems & Services” (Extended until 21/07/2025) May 30, 2025 Announcement of Extension for the Distribution of Textbooks May 30, 2025 Extension of the deadline for applications for free student meals for the Academic Year 2024-2025 until Wednesday 4 June 2025 May 28, 2025 Announcement of the MSc in “Health Services Organisation and Management – Health Informatics” for the Academic Year 2025 – 2026 May 27, 2025 Start of course/teaching evaluations for the spring semester 2024-2025 May 20, 2025 Searching for students for Internship May 12, 2025 Update on the Entrepreneurship & Career Panorama 2025 May 12, 2025 Useful LinksInstitute of Electrical and Electronics Engineers (IEEE) The British Computer Society (BCS) Workflow Management Coalition (WfMC) International Medical Informatics Association (IMIA) The American Medical Informatics Association (AMIA) European Federation For Medical Informatics (EFMI) Hellenic Society of Computer and Information Scientists and Professionals Evdoxos Alumni Site We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok",
  "content_length": 5118,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:55"
}