{
  "name": "Ori Lahav 0001",
  "homepage": "https://www.cs.tau.ac.il/~orilahav",
  "status": "success",
  "content": "Ori Lahav - אורי להב Ori Lahav / אורי להב I am a faculty member in the School of Computer Science at Tel Aviv University. I did my PhD at Tel Aviv University under the supervision of Arnon Avron. In 2014, I was a postdoctoral researcher at Tel Aviv University hosted by Mooly Sagiv. After that, until September 2017, I was a postdoctoral researcher at MPI-SWS in Germany hosted by Viktor Vafeiadis and Derek Dreyer. My main areas of research are programming languages and verification, with a focus on concurrency and relaxed memory models. I am also interested in proof-theory and semantics of (non-classical) logics and automated reasoning. My research is generously supported by an ERC Starting Grant and an ISF Grant. I am seeking highly motivated candidates for postdoc, PhD, and MSc positions. If you are interested in programming language theory, concurrency, and formal methods, feel free to contact me! News: We are organizing a Dagstuhl Seminar on Foundations of Disaggregated Memory and Heterogeneous Architectures, to be held in 2026. Contact Info Email: (click to reveal) Zoom: (click to reveal) Office: 234 Check Point Building Tel: +972-3-640-6422 Address: School of Computer Science, Tel Aviv University, Tel Aviv, 6997801 Israel Group Yoav Ben Shimon (PhD student co-advised by Sharon Shoham) Yotam Dvir (PhD student co-advised by Ohad Kammar) Matan Kalp (research assistant) Amir Karniel (PhD student) Yuval Katsman Ezra (MSc student) Roy Margalit (PhD student) Mikhail Svyatlovskiy (research assistant) Alumni Ori Saporta (MSc) Abhishek Kr Singh (postdoc, now Assistant Professor at IIIT Hyderabad) Teaching (access via Moodle for TAU students) Shared Memory Concurrency Semantics [spring 21] Workshop on Proof Mechanization and Program Verification in Coq [spring 23] Programming Language Foundations [spring 20] [fall 20-21] [fall 21-22] [fall 22-23] [fall 23-24] [fall 24-25] Software Foundations in Coq [spring 19] Concurrency Theory (undergraduate seminar) [spring 19] [spring 20] [spring 21] [spring 23] Discrete Mathematics [fall 18-19] [fall 21-22] [fall 22-23] Discrete Mathematics 1 [fall 23-24] Weakly Consistent Concurrency (graduate seminar) [spring 18] Advanced Seminar in Programming Languages (yearly research seminar) [website] [calendar] Publications [dblp] [google scholar] [orcid] The [pdf] links include pre-copy-editing self-produced PDFs. Conference Papers (including PACMPL) Dynamic Robustness Verification against Weak Memory Roy Margalit, Michalis Kokologiannakis, Shachar Itzhaky, Ori Lahav PLDI 2025 [pdf] [full] [tool] Two-Sorted Algebraic Decompositions of Brookes's Shared-State Denotational Semantics Yotam Dvir, Ohad Kammar, Ori Lahav, Gordon Plotkin FoSSaCS 2025 [pdf] [full] [springer] Sufficient Conditions for Robustness of RDMA Programs Guillaume Ambal, Ori Lahav, Azalea Raad ESOP 2025 [pdf] [full] [springer] Hyperproperty-Preserving Register Specifications Yoav Ben Shimon, Ori Lahav, Sharon Shoham Best Paper & Best Student Paper Awards DISC 2024 [pdf] [full] [LIPIcs] [slides] [talk (by Yoav)] What Cannot Be Implemented on Weak Memory? Armando Castañeda, Gregory Chockler, Brijesh Dongol, Ori Lahav DISC 2024 [pdf] [full] [LIPIcs] [talk (by Gregory)] Semantics of Remote Direct Memory Access: Operational and Declarative Models of RDMA on TSO Architectures Guillaume Ambal, Brijesh Dongol, Haggai Eran, Vasileios Klimis, Ori Lahav, Azalea Raad OOPSLA 2024 [pdf] [pdf] [project] [acm] [talk (by Guillaume)] Extending the C/C++ Memory Model with Inline Assembly Paulo Emílio de Vilhena, Ori Lahav, Viktor Vafeiadis, Azalea Raad OOPSLA 2024 [pdf] [full] [acm] [talk (by Paulo)] Compositional Semantics for Shared-Variable Concurrency Mikhail Svyatlovskiy, Shai Mermelstein, Ori Lahav PLDI 2024 [pdf] [full] [acm] [Coq] [slides] A Denotational Approach to Release-Acquire Concurrency Yotam Dvir, Ohad Kammar, Ori Lahav ESOP 2024 [pdf] [full] [springer] [slides] [poster] Intel PMDK Transactions: Specification and Concurrency Azalea Raad, Ori Lahav, John Wickerson, Piotr Balcer, Brijesh Dongol ESOP 2024 [pdf] [springer] [artifact report] [arxiv] Decidable Verification under Localized Release-Acquire Concurrency Abhishek Kr Singh, Ori Lahav TACAS 2024 [pdf] [full] [springer] [slides] [talk (by Abhishek)] Rely-Guarantee Reasoning for Causally Consistent Shared Memory Ori Lahav, Brijesh Dongol, Heike Wehrheim CAV 2023 [pdf] [full] [springer] [arxiv] [Coq] Putting Weak Memory in Order via a Promising Intermediate Representation Sung-Hwan Lee, Minki Cho, Roy Margalit, Chung-Kil Hur, Ori Lahav PLDI 2023 [pdf] [full] [Coq (promising IR)] [Coq (mapping to ARM)] [experiments] [acm] [talk (by Sung-Hwan)] An Operational Approach to Library Abstraction under Relaxed Memory Concurrency Abhishek Kr Singh, Ori Lahav POPL 2023 [pdf] [full] [acm] [talk (by Abhishek)] Kater: Automating Weak Memory Model Metatheory and Consistency Checking Michalis Kokologiannakis, Ori Lahav, Viktor Vafeiadis POPL 2023 [pdf] [acm] An Algebraic Theory for Shared-State Concurrency Yotam Dvir, Ohad Kammar, Ori Lahav Yotam received the Boaz Trakhtenbrot Centennial Scholarship for this paper APLAS 2022 [paper] [full] [springer] [slides] Effective Semantics for the Modal Logics K and KT via Non-deterministic Matrices Ori Lahav, Yoni Zohar IJCAR 2022 [pdf] [springer] [slides] Sequential Reasoning for Optimizing Compilers Under Weak Memory Concurrency Minki Cho, Sung-Hwan Lee, Dongjae Lee, Chung-Kil Hur, Ori Lahav PLDI 2022 [pdf] [full] [Coq] [acm] [talk (by Minki)] Abstraction for Crash-Resilient Objects Artem Khyzha, Ori Lahav ESOP 2022 [pdf] [extended] [springer] [slides] View-Based Owicki-Gries Reasoning for Persistent x86-TSO Eleni Bila, Brijesh Dongol, Ori Lahav, Azalea Raad, John Wickerson Distinguished Artifact Award ESOP 2022 [pdf] [extended] [project] [Isabelle/HOL] [springer] Making Weak Memory Models Fair Ori Lahav, Egor Namakonov, Jonas Oberhauser, Anton Podkopaev, Viktor Vafeiadis Distinguished Paper Award OOPSLA 2021 [pdf] [full] [Artifact @Zenodo] [acm] [talk (by Egor)] Modular Data-Race-Freedom Guarantees in the Promising Semantics Minki Cho, Sung-Hwan Lee, Chung-Kil Hur, Ori Lahav PLDI 2021 [pdf] [full] [Coq] [acm] [talk (by Minki)] Taming x86-TSO Persistency Artem Khyzha, Ori Lahav POPL 2021 [pdf] [full] [arxiv] [acm] [talk (by Artem)] Verifying Observational Robustness against a C11-Style Memory Model Roy Margalit, Ori Lahav POPL 2021 [pdf] [full] [acm] [tool] [talk (by Roy)] Persistent Owicki-Gries Reasoning Azalea Raad, Ori Lahav, Viktor Vafeiadis OOPSLA 2020 [pdf] [full] [acm] [talk (by Azalea)] Reconciling Event Structures with Modern Multiprocessors Evgenii Moiseenko, Anton Podkopaev, Ori Lahav, Orestis Melkonian, Viktor Vafeiadis ECOOP 2020 [LIPIcs] [Coq] [talk (by Evgenii)] Decidable Verification under a Causally Consistent Shared Memory Ori Lahav, Udi Boker PLDI 2020 [pdf] [full] [acm] [Coq] [trailer] [talk] Promising 2.0: Global Optimizations in Relaxed Memory Concurrency Sung-Hwan Lee, Minki Cho, Anton Podkopaev, Soham Chakraborty, Chung-Kil Hur, Ori Lahav, Viktor Vafeiadis PLDI 2020 [pdf] [full] [acm] [Coq PS2] [Coq PS2toIMM] [project page] [trailer] [talk (by Sung-Hwan)] Robustness against Release/Acquire Semantics Ori Lahav, Roy Margalit PLDI 2019 [pdf] [full] [acm] [tool] [slides] [talk] On the Semantics of Snapshot Isolation Azalea Raad, Ori Lahav, Viktor Vafeiadis VMCAI 2019 [pdf] [full] [springer] [arxiv] [project page] Bridging the Gap Between Programming Languages and Hardware Weak Memory Models Anton Podkopaev, Ori Lahav, Viktor Vafeiadis POPL 2019 [pdf] [full] [acm] [project page] [talk (by Anton)] On Library Correctness under Weak Memory Consistency Azalea Raad, Marko Doko, Lovro Rožić, Ori Lahav, Viktor Vafeiadis POPL 2019 [pdf] [technical appendix] [acm] [project page] [talk (by Azalea)] A Simple Cut-Free System for a Paraconsistent Logic Equivalent to S5 Arnon Avron, Ori Lahav AiML 2018 [pdf] [aiml] On Parallel Snapshot Isolation and Release/Acquire Consistency Azalea Raad, Ori Lahav, Viktor Vafeiadis ESOP 2018 [pdf] [technical appendix] [springer] [project page] A Separation Logic for a Promising Semantics Kasper Svendsen, Jean Pichon-Pharabod, Marko Doko, Ori Lahav, Viktor Vafeiadis ESOP 2018 [pdf] [technical appendix] [springer] Effective Stateless Model Checking for C/C++ Concurrency Michalis Kokologiannakis, Ori Lahav, Konstantinos Sagonas, Viktor Vafeiadis POPL 2018 [pdf] [full] [acm] [talk (by Michalis)] Cut-Admissibility as a Corollary of the Subformula Property Ori Lahav, Yoni Zohar Best Paper Award TABLEAUX 2017 [pdf] [springer] Promising Compilation to ARMv8 POP Anton Podkopaev, Ori Lahav, Viktor Vafeiadis ECOOP 2017 [pdf] [full] [LIPIcs] [talk (by Anton)] Strong Logic for Weak Memory: Reasoning About Release-Acquire Consistency in Iris Jan-Oliver Kaiser, Hoang-Hai Dang, Derek Dreyer, Ori Lahav, Viktor Vafeiadis Best Paper Award ECOOP 2017 [pdf] [full] [LIPIcs] [project page] [talk (by Jan-Oliver)] Repairing Sequential Consistency in C/C++11 Ori Lahav, Viktor Vafeiadis, Jeehoon Kang, Chung-Kil Hur, Derek Dreyer Distinguished Paper Award PLDI 2017 [pdf] [full] [slides] [acm] [project page] [talk] Verifying Reachability in Networks with Mutable Datapaths Aurojit Panda, Ori Lahav, Katerina J. Argyraki, Mooly Sagiv, Scott Shenker NSDI 2017 [pdf] [usenix] A Promising Semantics for Relaxed-Memory Concurrency Jeehoon Kang, Chung-Kil Hur, Ori Lahav, Viktor Vafeiadis, Derek Dreyer POPL 2017 [pdf] [full] [slides, kent concurrency workshop] [acm] [project page] [talk (by Jeehoon)] Explaining Relaxed Memory Models with Program Transformations Ori Lahav, Viktor Vafeiadis FM 2016 [pdf] [slides] [springer] [project page] It ain't necessarily so: Basic Sequent Systems for Negative Modalities Ori Lahav, João Marcos, Yoni Zohar AiML 2016 [pdf] [aiml] Taming Release-Acquire Consistency Ori Lahav, Nick Giannarakis, Viktor Vafeiadis POPL 2016 [pdf] [full] [slides] [poster] [acm] [project page] [talk] Owicki-Gries Reasoning for Weak ",
  "content_length": 18762,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:54"
}