{
  "name": "Ornela Dardha",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/orneladardha",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Ornela Dardha Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Ornela DardhaMr Ethan KellyZhen Tian Dr Ornela Dardha Senior Lecturer (School of Computing Science) telephone: +44 (0)141 330 1732 email: Ornela.Dardha@glasgow.ac.uk Room F143, Level F, 14 Lilybank Gardens, Glasgow, Glasgow City, Scotland, United Kingdom, G12 8RZ Import to contacts https://orcid.org/0000-0001-9927-7875 Biography I am a Senior Lecturer (Associate Professor) in the School of Computing Science at the University of Glasgow. My research interests are in programming languages foundations and formal verification, especially leveraging session types. Within the School, I am a member of Formal Analysis, Theory and Algorithms (FATA). I am the PI of the EPSRC New Investigator Award Uni-pi: safety, adaptability and resilience in distributed ecosystems, by construction. I was Glasgow Site Leader of the European RISE Action Behavioural Application Program Interfaces (BehAPI) and I was a Co-I and a Postdoctoral Researcher of the UK EPSRC programme grant From Data Types to Session Types: A Basis for Concurrency and Distribution (ABCD). I obtained my PhD (May 2014) in computing science from the University of Bologna, Italy, under the supervision of Davide Sangiorgi. My PhD thesis Type Systems for Distributed Programs: Components and Sessions won the prize for the Best Italian PhD Thesis in Theoretical Computer Science 2015, awarded by the Italian Chapter of EATCS. I obtained my BSc (2008) and MSc (2010) in computing science both summa cum laude (110/110 e lode), from Sapienza University of Rome, Italy. You can find more about me on my personal website. Research interests My research interests are in programming languages, concurrency, logic and verification. My goal is to design and develop rigorous formal models and software tools for communication-safe, adaptable and resilient concurrent and distributed systems. If you are interested in working with me or simply want to know more about my research, you are welcome to contact me.Research groupsGlasgow SystemsFormal Analysis, Theory & Algorithms Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2010Number of items: 41.2025 Alsubhi, Arwa, Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 and Gay, Simon J. ORCID: https://orcid.org/0000-0003-3033-9091 (2025) Design and evaluation of Coconut: typestates for C++. Science of Computer Programming, (doi: 10.1016/j.scico.2025.103398) (Accepted for Publication) Le Brun, Matthew Alan, Fowler, Simon ORCID: https://orcid.org/0000-0001-5143-5475 and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2025) Multiparty Session Types with a Bang! In: 34th European Symposium on Programming (ESOP 2025), Hamilton, Canada, 3–8 May 2025, pp. 125-153. ISBN 9783031911200 (doi: 10.1007/978-3-031-91121-7_6) 2024 Alsubhi, Arwa Hameed and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2024) Coconut: Typestates for Embedded Systems. In: 26th International Conference on Coordination Models and Languages (COORDINATION 2024), Groningen, The Netherlands, 17-21 June 2024, pp. 219-238. ISBN 9783031626975 (doi: 10.1007/978-3-031-62697-5_12) Le Brun, Matthew Alan and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2024) MAGπ!: The Role of Replication in Typing Failure-Prone Communication. In: DisCoTec 2024, Gronigen, Netherlands, 17-21 June 2024, pp. 99-117. ISBN 9783031626449 (doi: 10.1007/978-3-031-62645-6_6) Cavoj, Samuel, Nikitin, Ivan, Perkins, Colin ORCID: https://orcid.org/0000-0002-3404-8964 and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2024) Session Types for the Transport Layer: Towards an Implementation of TCP. In: 15th Workshop on Programming Language Approaches to Concurrency and Communication-cEntric Software (PLACES 2024), Luxembourg City, Luxembourg, 06 April 2024, (doi: 10.4204/EPTCS.401.3) 2023 Tang, Wenhao, Hillerström, Daniel, McKinna, James, Steuwer, Michel, Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875, Fu, Rongxiao and Lindley, Sam (2023) Structural Subtyping as Parametric Polymorphism. Proceedings of the ACM on Programming Languages, 7, pp. 1093-1121. 260. (doi: 10.1145/3622836) Fowler, Simon ORCID: https://orcid.org/0000-0001-5143-5475, Kokke, Wen, Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875, Lindley, Sam and Morris, J. Garrett (2023) Separating sessions smoothly. Logical Methods in Computer Science, 19(3), 3. (doi: 10.46298/lmcs-19(3:3)2023) Le Brun, Matthew Alan and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2023) MAGπ: Types for Failure-Prone Communication. In: 32nd European Symposium on Programming (ESOP23), Paris, France, 22-27 April 2023, pp. 363-391. (doi: 10.1007/978-3-031-30044-8_14) 2022 Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875, Giachino, Elena and Sangiorgi, Davide (2022) Session Types Revisited: A Decade Later. In: 24th International Symposium on Principles and Practice of Declarative Programming (PPDP 2022), Tbilisi, Georgia, 20-22 September 2022, p. 12. ISBN 9781450397032 (doi: 10.1145/3551357.3556676) Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 and Pérez, Jorge A. (2022) Comparing type systems for deadlock freedom. Journal of Logical and Algebraic Methods in Programming, 124, 100717. (doi: 10.1016/j.jlamp.2021.100717) 2021 Jakobsen, Mathias, Ravier, Alice and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2021) Papaya: Global Typestate Analysis of Aliased Objects. In: 23rd International Symposium on Principles and Practice of Declarative Programming (PPDP 2021), Tallinn, Estonia, 06-08 Sep 2021, p. 19. ISBN 9781450386890 (doi: 10.1145/3479394.3479414) Kokke, Wen and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2021) Deadlock-Free Session Types in Linear Haskell. In: 14th ACM SIGPLAN International Symposium on Haskell (Haskell 2021), 26-27 Aug 2021, ISBN 9781450386159 (doi: 10.1145/3471874.3472979) Fowler, Simon ORCID: https://orcid.org/0000-0001-5143-5475, Kokke, Wen, Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875, Lindley, Sam and Morris, J. Garrett (2021) Separating Sessions Smoothly. In: 32nd International Conference on Concurrency Theory (CONCUR 2021), 23-27 Aug 2021, 36:1-36:18. ISBN 9783959772037 (doi: 10.4230/LIPIcs.CONCUR.2021.36) Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Fowler, Simon ORCID: https://orcid.org/0000-0001-5143-5475, Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 and Gay, Simon J. ORCID: https://orcid.org/0000-0003-3033-9091 (2021) Multiparty Session Types for Safe Runtime Adaptation in an Actor Language. [Artefact] Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Fowler, Simon ORCID: https://orcid.org/0000-0001-5143-5475, Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 and Gay, Simon J. ORCID: https://orcid.org/0000-0003-3033-9091 (2021) Multiparty Session Types for Safe Runtime Adaptation in an Actor Language. In: 35th European Conference on Object Oriented Programming (ECOOP 2021), 12-17 Jul 2021, (doi: 10.4230/LIPIcs.ECOOP.2021.10) Damiani, Ferruccio and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (Eds.) (2021) Coordination Models and Languages: 23rd IFIP WG 6.1 International Conference, COORDINATION 2021, Held as Part of the 16th International Federated Conference on Distributed Computing Techniques, DisCoTec 2021, Valletta, Malta, June 14-18, 2021, Proceedings. Series: Lecture notes in computer science. Springer: Cham. ISBN 9783030781415 Kokke, Wen and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2021) Prioritise the Best Variation. In: 41st IFIP WG 6.1 International Conference on Formal Techniques for Distributed Objects, Components, and Systems, FORTE 2021, Valletta, Malta, 14-18 Jun 2021, pp. 100-119. ISBN 9783030780883 (doi: 10.1007/978-3-030-78089-0_6) Zalakain, Uma and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2021) π with Leftovers: a Mechanisation in Agda. In: 41st IFIP WG 6.1 International Conference on Formal Techniques for Distributed Objects, Components, and Systems, FORTE 2021, Valletta, Malta, 14-18 Jun 2021, pp. 157-174. ISBN 9783030780883 (doi: 10.1007/978-3-030-78089-0_9) Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 and Castiglioni, Valentina (Eds.) (2021) Proceedings Combined 28th International Workshop on Expressiveness in Concurrency and 18th Workshop on Structural Operational Semantics, Paris, France (online event), 23rd August 2021. Open Publishing Association. 2020 Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 and Rot, Jurriaan (Eds.) (2020) Proceedings Combined 27th International Workshop on Expressiveness in Concurrency and 17th Workshop on Structural Operational Semantics, EXPRESS/SOS 2020, and 17th Workshop on Structural Operational Semantics, Online, 31 August 2020. Series: Electronic proceedings in theoretical computer science. EPTCS. Usov, Artem and Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 (2020) SFJ: an Implementation of Semantic Featherweight Java. In: 22nd IFIP WG 6.1 International Conference, COORDINATION 20",
  "content_length": 33313,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:58"
}