{
  "name": "Oscar Chaparro",
  "homepage": "https://ojcchar.github.io",
  "status": "success",
  "content": "Oscar Chaparro Oscar ChaparroAssociate Professor of CS at William & Mary Follow Email Google Scholar DBLP LinkedIn Github Twitter ORCIDI am an Associate Professor of Computer Science at William & Mary.I lead the Software Evolution and Analysis (SEA) Lab, which conducts research in software maintenance & evolution, program comprehension, refactoring, software quality, developers’ productivity, text analysis applied to software engineering (SE), software supply chain management, and legal aspects of SE.My current research areas are:Automated bug report management: automating bug reporting, triage, localization, and resolutionVerification-guided code refactoring and comprehension: leveraging code verification techniques to guide automated code refactoring and reduce code comprehension effortInformed decision making for software change: processing and managing code change decisions documented in software artifacts/repositories to assist developers in producing software that is less faulty, higher quality, and easier to maintainSoftware licensing and supply chain management: automating and managing the software supply chain (emphasis on licensing and software evolution)My research employs empirical methods, analyzes/leverages different software artifacts (software bug reports, source code, online discussions, etc.), and builds on creating, adapting, and integrating techniques based on program analysis, software repository mining (MSR), information retrieval (IR), natural language processing (NLP), computer vision (CV), and machine/deep learning (ML/DL).Take a look at my publications to know more about my research.Education: I got my Ph.D. in Software Engineering (SE) from The University of Texas at Dallas in 2019, under the advice of Dr. Andrian Marcus, and my B.Eng. and M.Eng. degrees in Systems Engineering and Computing from Universidad Nacional de Colombia in Bogotá, Colombia.RECENT NEWS(Oct 2025) Paper on studying the ML/AI Supply Chain in Hugging Face accepted at TOSEM. Congrats Nathan and Trevor!(Oct 2025) Congratulations to Sam for receiving the W&M’s CS department Northrop-Grumman Award for Excellence in Research!(Aug 2025) Paper on Bug-Report-Based Test Oracle Generation accepted at ASE’25. Congrats to the authors!(July 2025) Tool demo paper on GUI-based Bug Localization accepted at ICSME’25. Congrats to the UCF team and authors, including Nadeeshan!(May 2025) I will be on sabbatical leave during the 2025-2026 academic year(May 2025) Paper on studying Copyright Issues of using Generative AI for Software Developement accepted at TOSEM. Congrats Nathan and Trevor!(May 2025) I recevived a Distinguished Reviewer Award at ICPC’25! Thanks ICPC!(Apr 2025) Congratulations to Sam for receiving the W&M’s Charles Center Summer Research Grant to conduct research on interactive bug reporting(Mar 2025) Congratulations to Antu for receiving the W&M’s 2025 International Student Achievement Award in recognition for his achievements as an international student(Feb 2025) I will be an Associate Professor with tenure starting Fall 2025. Deeply thankful to my wife, students, collaborators, mentors, colleagues, letter writers, and W&M for their support. Excited for a new chapter of impactful research!",
  "content_length": 3241,
  "method": "requests",
  "crawl_time": "2025-12-01 14:07:59"
}