{
  "name": "Osman Abul",
  "homepage": "http://osmanabul.etu.edu.tr",
  "status": "success",
  "content": "Homepage-Osman Abul Dr. Osman Abul Associate Professor, Department of Computer Engineering, TOBB University of Economics and Technology, Sogutozu, Ankara, Turkey. E-mail: osmanabul [AT] etu.edu.tr Phone: +90 312 2924263 Office: Room 162 Education Experience Publication Research Teaching Professional Misc Education PhD (January 2005): Department of Computer Engineering, Middle East Technical University, Ankara, Turkey. MSc (August 1999): Department of Computer Engineering, Middle East Technical University, Ankara, Turkey. BSc (June 1996): Department of Computer Science&Engineering, Hacettepe University, Ankara, Turkey. Experience April 2013 - ... : Associate Professor, TOBB University of Economics and Technology, Ankara, Turkey. March 2007 - March 2013 : Assistant Professor, TOBB University of Economics and Technology, Ankara, Turkey. June 2006 - March 2007: Postdoctoral fellow, Institute of Information Science and Technology (ISTI-CNR), Pisa, Italy. September 2005 - June 2006: Postdoctoral fellow, Norwegian University of Science and Technology (NTNU), Trondheim, Norway. January 2004 - September 2005: Senior software engineer, Aselsan Inc. Ankara, Turkey. December 2002 - December 2003: Research & Teaching assistant, University of Calgary, Calgary, AB, Canada. August 2001-November 2002: Military service, Turkish Land Forces Hq. Ankara, Turkey. August 1997-July 2001: (Senior) software engineer, Aselsan Inc. Ankara, Turkey. August 1996 - August 1997: Research&Teaching assistant, Hacettepe University, Ankara, Turkey. Publication Theses O. Abul. \"Controlling Discrete Genetic Regulatory Networks\", PhD thesis, Dept. of Computer Engineering, Middle East Technical University, Ankara, 2005. Advisors: Professors Faruk Polat and Reda Alhajj. O. Abul. \"Multi-agent Reinforcement Learning using Function Approximation\", Masters thesis, Dept. of Computer Engineering, Middle East Technical University, Ankara, 1999. Advisor: Prof. Faruk Polat. Book ChaptersO. Abul. \"Knowledge Hiding in Emerging Application Domains\" in \"Privacy-Aware Knowledge Discovery: Novel Applications and New Techniques\", December 2010, CRC Press. (F. Bonchi and E. Ferrari editors). Refereed Journals O.Abul and H. Gokce. ”Knowledge Hiding from Tree and Graph Databases”, Data & Knowledge Engineering, Vol.72, Pages 148-171, February 2012. S. Gundersen, M. Kalas, O.Abul, A. Frigessi, E. Hovig and G. K. Sandve. ”Identifying elemental genomic track types and representing them uniformly”, BMC Bioinformatics, Vol. 12 No.494, 2011. O. Abul, F. Bonchi and M. Nanni. \"Anonymization of Moving Objects Databases by Clustering and Perturbation\", Information Systems, Vol.35, No.8, December 2010. O. Abul, F. Bonchi and F. Giannotti. \"Hiding Sequential and Spatio-temporal Patterns\", IEEE TKDE Vol.22, No.12, December 2010.G. K. Sandve, O. Abul and F. Drablos. \"Compo: composite motif discovery using discrete models\", BMC Bioinformatics, Vol.9, No.527, 2008.K. Klepper, G.K. Sandve, O. Abul, J. Johansen, V. Walseng and F. Drablos. \"Assessment of composite motif discovery methods\",  BMC Bioinformatics, Vol.9, No.123, 2008. G.K. Sandve, O. Abul, V. Walseng and F. Drablos. \"Improved Benchmarks for Computational Motif Discovery\",  BMC Bioinformatics, Vol.8, No.163, 2007. O. Abul, R. Alhajj and F. Polat. \"A Powerful Approach for Effective Finding of Significantly Differentially Expressed Genes\", IEEE/ACM Transactions on Computational Biology and Bioinformatics, Vol.3, No.3, pp. 220-231, 2006. O. Abul, R. Alhajj, F. Polat and K. Barker. \"Finding differentially expressed genes for pattern generation\", Bioinformatics, Vol.21, No.4, pp. 445-450, 2005. F. Polat and O. Abul. \"Learning Sequences of Compatible Actions Among Agents\", Artificial Intelligence Review, Kluwer, Vol.17:1, pp. 21-37, March 2002. O. Abul, F. Polat and R. Alhajj. \"Multi-Agent Reinforcement Learning Using Function Approximation\", IEEE Transactions on Systems, Man and Cybernetics-C, Vol.30, No. 4, pp. 485-497, Nov. 2000. Refereed Conferences E.Yigitoglu, M.L. Damiani, O. Abul and C. Silvestri. \"Privacy-preserving sharing of sensitive semantic locations under road-network constraints\", MDM 2012: 186-195, July 2012, Bengaluru-India. C. Silvestri, E.Yigitoglu, M.L. Damiani, O. Abul. \"SAWLnet: Sensitivity Aware Location Cloaking on Road-NETworks\". MDM 2012: 336-339, July 2012, Bengaluru-India. I.Gumus and O.Abul. \"Turkish archive digitization by human computation approach\", INISTA 2012, July 2012, Trabzon-Turkey. R. Ozcan, F. Orhan, M. F. Demirci and O. Abul. ”An Adaptive Smoothing Method for Sensor Noise in Augmented Reality Applications on Smartphones”, Mobilware 2011, June 2011, London. D. Vitale, E. E. Kuruoglu and O. Abul. ” Long Range Correlations Between Nucleotide Triplets”, Int. Symp. on Health Informatics and Bioinformatics (HIBIT’11), pp. 241-244, May 2011, Izmir. H. Gokce and O. Abul. \"A Tradeoff Balancing Algorithm for Hiding Sensitive Frequent Itemsets\", Int. Conf. on Knowlede Discovery and Information Retrieval (KDIR'10), October 2010, Valencia. G. O. Ozdogan and O. Abul. \"Task-Parallel FP-Growth on Cluster Computers\", 25th International Symposium on Computer and Information Sciences (ISCIS’10) , September 2010, London. O. Abul. \"MotifHider: A Knowledge Hiding Approach to Sequence Masking\", 24th International Symposium on Computer and Information Sciences (ISCIS’09) , September 2009, Cyprus.O. Abul, H. Gokce, and Y. Sengez. \"Frequent Itemsets Hiding: A Performance Evaluation Framework\", 24th International Symposium on Computer and Information Sciences (ISCIS’09), September 2009, Cyprus. O. Abul. \"Hiding Co-Occurring Frequent Itemsets\", 2nd International Workshop on Privacy and Anonymity in the Information Society (PAIS’09), In conjunction with ICDT/EDBT'09, St. Petersburg, Russia, March 2009.O. Abul, F. Bonchi and M. Nanni. \"Never Walk Alone: Uncertainty for Anonymity in Moving Objects Databases\", IEEE 24th International Conference on Data Engineering (ICDE 2008), Cancun, Mexico, April 2008. O. Abul, G.K. Sandve and F. Drablos. \"False Discovery Rates in Identifying Functional DNA Motifs\", Proceedings of IEEE Symposium on Bioinformatics and Bioengineering (BIBE'07), Cambridge MA, Oct. 2007. O. Abul, M. Atzori, F. Bonchi and F. Giannotti. \"Hiding Sensitive Trajectory Patterns\", 6th International Workshop on Privacy Aspects of Data Mining, ICDM'07 Workshops, October 2007, Omaha, Nebreska. M. Atzori, F. Bonchi, F. Giannotti, D. Pedreschi and O. Abul. \"Privacy-Aware Knowledge Discovery from Location Data\",The International Workshop on Privacy-Aware Location-based Mobile Services (PALMS'07),Mannheim, Germany, May 2007. O. Abul, M. Atzori, F. Bonchi and F. Giannotti. \"Hiding Sequences\", The 3rd International Workshop on Privacy Data Management, IEEE 23rd International Conference on Data Engineering (ICDE 2007), Istanbul, Turkey, April 2007. Also appears as a technical report of ISTI (acc. number 2006-TR-40). An extended abstract appears in Proceedings of Italian Symposium on Advanced Database Systems, SEBD'07. O. Abul, F. Polat and R. Alhajj. \"Asymptotical Lower Limits on the Required Number of Examples for Learning Boolean Networks\", The 21st International Symposium on Computer and Information Sciences (ISCIS), Istanbul, Turkey, Nov. 2006 (LNCS, Vol 4263 pp. 154-164, Springer-Verlag). O. Abul, F. Polat and R. Alhajj. \"Optimal Multi-Objective Control Method for Discrete Genetic Regulatory Networks\", Proceedings of IEEE Symposium on Bioinformatics and Bioengineering (BIBE), Washington DC, Oct. 2006. G.K. Sandve, M. Nedland, O.B. Syrstad, L.A. Eidsheim, O. Abul and F. Drablos. \"Accelerating Motif Discovery: Motif Matching on Parallel Hardware\", 6th Workshop on Algorithms in Bioinformatics (WABI), Zurich-Switzerland, Sep. 2006 (LNCS, Vol 4175 pp. 197-206 Springer-Verlag). O. Abul, G.K. Sandve and F. Drablos. \"A Methodology for Motif Discovery Employing Iterated Cluster Re-assignment\", Computational Systems Bioinformatics Conference (CSB), Stanford University CA, Aug. 2006 (Series on Advances in Bioinformatics and Computational Biology - Volume 4, 2006, Imperial College Press). O. Abul, G.K. Sandve and F. Drablos. \"TSCAN: A two-step de novo Motif Discovery Method\", The 3rd annual RECOMB Satellite Workshop on Regulatory Genomics (RECOMB-RG), Singapore, July. 2006. O. Abul, R. Alhajj and F. Polat. \"Importance of Monitoring in Developing Optimal Control Policies for Probabilistic Boolean Genetic Networks\", Proceedings of the International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems (IPMU), Italy, July 2004. O. Abul, R. Alhajj and F. Polat. \"Markov Decision Processes Based Optimal Control Policies for Probabilistic Boolean Networks\", Proceedings of IEEE Symposium on Bioinformatics and Bioengineering (BIBE), Taiwan, pp.337-344, May 2004. O. Abul, R. Alhajj, F. Polat and K. Barker. \"Finding Differentially Expressed Genes: Pattern Generation using q-values\", Proceedings of the ACM Annual Symposium on Applied Computing, Cyprus, Mar. 2004. O. Abul, A. Lo, R. Alhajj, F. Polat and K. Barker. \"Cluster Validity Analysis Using Subsampling\", Proceedings of IEEE International Conference on Systems, Man and Cybernetics, Washington DC, Oct. 2003. O. Abul, F. Polat and R. Alhajj. \"Function Approximation Based Multi-Agent Reinforcement Learning\", Proceedings of IEEE International Conference on Tools with Artificial Intelligence (ICTAI-2000), IEEE Press, Nov 13, 2000, Vancouver, British Columbia, Canada, pp.36-39. Other O.Abul. \"Privacy issues when sharing sensitive semantic locations in urban settings\", MOVE COST Workshop on Analysis & Visualization of MOVEment,October 10-11 2012, Thessaloniki-Greece. K. Dursun, A.T. Bilgin, C.Kılıç and O. Abul. \"Mastermind Oyununa Yapay Zeka Yaklaşımı\", Fırat Elektrik-Elektronik Bilgisayar Sempozyumu (FEEB 2011), September 2011, Elazığ. (In Turkish). H. Gokce and O. Abul. \"Hassas Bilgi Gizleme Uygulaması\", ELECO 2010, December 2010, Bursa, Turkey. (In Turki",
  "content_length": 16726,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:04"
}