{
  "name": "Oswin Aichholzer",
  "homepage": "http://www.ist.tugraz.at/aichholzer",
  "status": "success",
  "content": "Oswin Aichholzer's homepage Skip to: Content | Navigation | Footer Oswin Aichholzer Welcome I am an associate professor at the Institute of Algorithms and Theory (ATCS) at Graz University of Technology. For more information please have a look at my official TUG-Online Visitenkarte (business card) or my contact page. EUROCORES-Project ComPoSe ComPoSe: Combinatorics on Point Sets and Arrangements of Objects This CRP focuses on combinatorial properties of discrete sets of points and other simple geometric objects primarily in the plane. In general, geometric graphs are a central topic in discrete and computational geometry, and many important questions in mathematics and computer science can be formulated as problems on geometric graphs. In the current context, several families of geometric graphs, such as proximity and skeletal structures, constitute useful abstractions for the study of combinatorial properties of the point sets on which they are defined. For arrangements of other objects, such as lines or convex sets, their combinatorial properties are usually also described via an underlying graph structure. read more Doctoral Program \"Discrete Mathematics\" The Doctoral Program \"Discrete Mathematics\" offers an advanced PhD training and research program which is run jointly by Graz University of Technology (TU Graz), University of Graz (KFU Graz), and University of Leoben (MU Leoben). It is funded by the Austrian Science Fund (FWF) and the three supporting universities. Range of topics The range of topics in Discrete Mathematics comprises Commutative and noncommutative Algebra Number Theory Additive Combinatorics Discrete Dynamics and Fractals Graph Theory Combinatorial Group Theory Discrete Stochastics Combinatorial Optimisation Discrete and Computational Geometry Analysis of Algorithms You can find the individual projects here and the open positions here. read more Lehrbuch angewandte Geometrie read more Navigation Home Research Publications Projects and collaborations Research projects Teaching (german) Entwurf und Analyse von Algorithmen Datenstrukturen und Algorithmen 2 Algorithmen und Spiele Enumerative Combinatoric Algorithms Discrete and Computational Geometry Projektthemen, Diplomarbeiten Information for visitors Contact Back to top Quick links Mittagsseminar Institute for Software Technology Graz University of Technology EUROCORES-Project ComPoSe Doctoral Program \"Discrete Mathematics\" Lehrbuch angewandte Geometrie Perfect Connect 4 Rectilinear Crossing Number Project (RCN) Rectilinear Crossing Number Records A story about RCN in the FAZ A story about RCN, french version New topics for projects and thesis Abalone World Champion FWF Joint Research Program Industrial Geometry TU-Forschungsschwerpunkt \"Algorithmen und mathematische Modellierung\" Erik Demaine's List of Events Computational Geometry Pages © 2006 Oswin Aichholzer. Valid CSS & XHTML. Back to: Top | Content | Navigation",
  "content_length": 2940,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:05"
}