{
  "name": "Otmar Hilliges",
  "homepage": "http://ait.ethz.ch/people/hilliges",
  "status": "success",
  "content": "Prof. Dr. Otmar Hilliges | AIT Lab About me I am a Professor in the Computer Science Department at ETH Zurich. I lead the AIT lab and serve as the head of the Institute of Intelligent Interactive Systems. My research is in spatio-temporal understanding of how humans move within and interact with the physical world. I research algorithms, methods and representations for human- and interaction-centric understanding of our world from videos, images and other sensor data. I'm interested in many different application domains such as Augmented and Virtual Reality, Human Robot Interaction and more. Prior to joining ETH I was a postdoc and later a researcher at Microsoft Research Cambridge, in the I3D group(2010-2013). I was awarded a Diplom (equiv. MSc) in Computer Science from Technische Universität München and my PhD in Computer Science from LMU München, Germany (2009). CV CV Academic and Professional Activities Grants ERC Consolidator Grant: \"AI-Perceive: Robust Human-Centric Computer Vision for Advanced AI-Agents\". 2022-2027 Google Inc. Sponsored Research Agreement: \"Generative Modelling of Humans\". 2020-2025. ERC Starting Grant: \"OPTINT: Optimization-based Design of Interactive Technologies\". 2017-2021 Microsoft Research Swiss JRC Grant: \"Human-Centric-Flight II: End-user Design of High-level Robotic Behavior\". 2017-2019 SNF Grant: \"Deformation and Motion Modeling using Modular, Sensor-based Input Devices\". 2015-2018 Google Inc. Sponsored Research Agreement: \"Recognition Algorithms Using High-Speed, Wide Field-of-View, Short Range Sensors for Mobile and Wearable Computing\". 2014-2016. SNF Grant: \"UFO: Semi-Autonomous Aerial Vehicles for Augmented Reality, Human-Computer Interaction and Remote Collaboration\" (200021L_153644). 2015-2018 Microsoft Research Swiss JRC Grant: \"Human-Centric Flight: Micro Aerial Vehicles for Interaction, Videography and 3D Reconstruction\". 2014-2017 Technical Program Comittee Member European Conference on Computer Vision (ECCV '22) Conference on Computer Vision and Pattern Recognition (CVPR '23) Conference on Computer Vision and Pattern Recognition (CVPR '22) ACM SIGCHI Conference on Human Factors in Computing Systems (ACM CHI '20) AAAI Conference on Artificial Intelligence (AAAI '20) Eurographics (EG '20) ACM Symposium on User Interface Software and Technology (ACM UIST '20) ACM Symposium on User Interface Software and Technology (ACM UIST '19) ACM SIGCHI Conference on Human Factors in Computing Systems (ACM CHI '17) ACM Symposium on User Interface Software and Technology (ACM UIST '16) ACM SIGCHI Conference on Human Factors in Computing Systems (ACM CHI '16) ACM SIGCHI Conference on Human Factors in Computing Systems (ACM CHI '15) ACM Symposium on User Interface Software and Technology (ACM UIST '14) ACM SIGCHI Conference on Human Factors in Computing Systems (ACM CHI '14) ACM Conference on Tangible, Embedded, and Embodied Interaction (ACM TEI '14) ACM Symposium on User Interface Software and Technology (ACM UIST '13) ACM SIGCHI Conference on Mobile and Ubiquitous Multimedia (ACM MUM '13) ACM SIGCHI Conference on Human Factors in Computing Systems (ACM CHI '13) ACM Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13) IEEE Symposium on Mixed and Augmented Reality (IEEE Ismar '13) IEEE Joint 3DIM/3DPVT Conference (IEEE 3DV '13) IEEE Joint 3DIM/3DPVT Conference (IEEE 3DIMPVT '12) ACM Symposium on User Interface Software and Technology (ACM UIST '12) ACM Conference on Interactive Tabletops and Surfaces (ACM ITS '10) ACM Conference on Tangible and Embedded Interaction (ACM TEI '09) Organizing Comittee Member General Chair, ACM/IEEE Symposium on Mixed and Augmented Reality (ISMAR '18) Keynote Chair, ACM Symposium on User Interface Software and Technology (ACM UIST '14) Keynote Chair, ACM Symposium on User Interface Software and Technology (ACM UIST '13) Video Co-Chair, ACM Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13) Demonstrations Co-Chair, ACM Symposium on User Interface Software and Technology (ACM UIST '10 & '11) Student Volunteer Chair, ACM Conference on Interactive Tabletops and Surfaces (ACM ITS '08 & '09) Keynote speaker Keynote, International Conference on 3D Vision (3DV ' 22) Keynote, Graphics Interface (GI ' 19) Reviewing I routinely review paper for conferences and journals in computer vision (CVPR, ICCV, 3DV, TPAMI), in HCI (CHI, UIST, Ubicomp, VR, ISMAR) and Robotics (ICRA, IROS, RA-L). Publications 2025 No Training, No Problem: Rethinking Classifier-Free Guidance for Diffusion Models Seyedmorteza Sadat, Manuel Kansy, Otmar Hilliges, Romann M. Weber International Conference on Learning Representations (ICLR), 2025 Paper Eliminating Oversaturation and Artifacts of High Guidance Scales in Diffusion Models Seyedmorteza Sadat, Otmar Hilliges, Romann M. Weber International Conference on Learning Representations (ICLR), 2025 Paper Gaussian Garments: Reconstructing Simulation-ready Clothing with Photorealistic Appearance from Multi-view Video Boxiang Rong*, Artur Grigorev*, Wenbo Wang, Michael J. Black, Bernhard Thomaszewski, Christina Tsalicoglou, Otmar Hilliges * Equal contribution International Conference on 3D Vision 2025, 2025 Video Paper Code 2024 LiteVAE: Lightweight and Efficient Variational Autoencoders for Latent Diffusion Models Seyedmorteza Sadat, Jakob Buhmann, Derek Bradley, Otmar Hilliges, Romann M. Weber Annual Conference on Neural Information Processing Systems (NeurIPS), 2024 Video Paper Cafca: High-quality Novel View Synthesis of Expressive Faces from Casual Few-shot Captures Marcel C. Buehler, Gengyan Li, Erroll Wood, Leonhard Helminger, Xu Chen, Tanmay Shah, Daoye Wang, Stephan Garbin, Sergio Orts-Escolano, Otmar Hilliges, Dmitry Lagun, Jérémy Riviere, Paulo Gotardo, Thabo Beeler, Abhimitra Meka, Kripasindhu Sarkar Conference paper at SIGGRAPH Asia, 2024 Video Talk Paper Data Benchmarks and Challenges in Pose Estimation for Egocentric Hand Interactions with Objects Zicong Fan*, Takehiko Ohkawa*, Linlin Yang*, Nie Lin, Zhishan Zhou, Shihao Zhou, Jiajun Liang, Zhong Gao, Xuanyang Zhang, Xue Zhang, Fei Li, Liu Zheng, Feng Lu, Karim Abou Zeid, Bastian Leibe, Jeongwan On, Seungryul Baek, Aditya Prakash, Saurabh Gupta, Kun He, Yoichi Sato, Otmar Hilliges, Hyung Jin Chang, Angela Yao European Conference on Computer Vision (ECCV), 2024 Paper ReLoo: Reconstructing Humans Dressed in Loose Garments from Monocular Video in the Wild Chen Guo*, Tianjian Jiang*, Manuel Kaufmann, Chengwei Zheng, Julien Valentin, Jie Song, Otmar Hilliges * Equal contribution European Conference on Computer Vision (ECCV), 2024 Video Paper Code WorldPose: A World Cup Dataset for Global 3D Human Pose Estimation Tianjian Jiang, Johsan Billingham, Sebastian Müksch, Juan Zarate, Nicolas Evans, Martin Oswald, Marc Pollefeys, Otmar Hilliges, Manuel Kaufmann, Jie Song European Conference on Computer Vision (ECCV), 2024 Video Paper Data HSR: Holistic 3D Human-Scene Reconstruction from Monocular Videos Lixin Xue, Chen Guo, Chengwei Zheng, Fangjinhua Wang, Tianjian Jiang, Hsuan-I Ho, Manuel Kaufmann, Jie Song, Otmar Hilliges European Conference on Computer Vision (ECCV), 2024 Video Paper Code GraspXL: Generating Grasping Motions for Diverse Objects at Scale Hui Zhang, Sammy Christen, Zicong Fan, Otmar Hilliges, Jie Song European Conference on Computer Vision (ECCV), 2024 Video Paper Data Code Human Hair Reconstruction with Strand-Aligned 3D Gaussians Egor Zakharov, Vanessa Sklyarova, Michael J. Black, Giljoo Nam, Justus Thies, Otmar Hilliges European Conference on Computer Vision (ECCV), 2024 Video Paper Code AvatarPose: Avatar-guided 3D Pose Estimation of Close Human Interaction from Sparse Multi-view Videos Feichi Lu*, Zijian Dong*, Jie Song, Otmar Hilliges * Equal contribution European Conference on Computer Vision (ECCV), 2024 Video Paper Code PALM: Predicting Actions through Language Models Sanghwan Kim, Daoji Huang, Yongqin Xian, Otmar Hilliges, Luc Van Gool, Xi Wang European Conference on Computer Vision (ECCV), 2024 Paper ROMEO: Revisiting Optimization Methods for Reconstructing 3D Human-Object Interaction Models From Images Alexey Gavryushin, Yifei Liu, Daoji Huang, Yen-Ling Kuo, Julien Valentin, Luc Van Gool, Otmar Hilliges, Xi Wang European Conference on Computer Vision Workshops (ECCVW), 2024 best paper award of the T-CAP workshop Paper Code ContourCraft: Learning to Resolve Intersections in Neural Multi-Garment Simulations Artur Grigorev, Giorgio Becherini, Michael Black, Otmar Hilliges, Bernhard Thomaszewski ACM SIGGRAPH, 2024 Video Paper Code MARLUI: Multi-Agent Reinforcement Learning for Adaptive Point-and-Click UIs Thomas Langerak, Sammy Christen, Mert Albaba, Christoph Gebhardt, Christian Holz, Otmar Hilliges Proc. ACM Human-Computer Interaction 8, EICS, 2024 Video Paper Utilizing Synthetic Data in Supervised Learning for Robust 5-DoF Magnetic Marker Localization Mengfan Wu*, Thomas Langerak*, Otmar Hilliges, Juan Zarate * Equal contribution IEEE Transactions on Magnetics, 2024 Video Paper WANDR: Intention-guided Human Motion Generation Markos Diomataris, Nikos Athanasiou, Omid Taheri, Xi Wang, Otmar Hilliges, Michael J. Black Computer Vision and Pattern Recognition (CVPR), 2024 Video Paper Code Summarize the Past to Predict the Future: Natural Language Descriptions of Context Boost Multimodal Object Interaction Anticipation Razvan-George Pasca, Alexey Gavryushin, Muhammad Hamza, Yen-Ling Kuo, Kaichun Mo, Luc Van Gool, Otmar Hilliges, Xi Wang Computer Vision and Pattern Recognition (CVPR), 2024 Video Paper Code MultiPly: Reconstruction of Multiple People from Monocular Video in the Wild Zeren Jiang*, Chen Guo*, Manuel Kaufmann, Tianjian Jiang, Julien Valentin, Otmar Hilliges, Jie Song * Equal contribution Computer Vision and Pattern Recognition (CVPR), 2024 Accepted as Oral Presentation (Top 3.3%) Video Paper Data Code HOLD: Category-agnostic 3D Reconstruction of Interacting Hands and Objects from Video Zicong Fan, Maria Parelli, Maria Eleni Kadoglo",
  "content_length": 46886,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:09"
}