{
  "name": "Ouhyoung Ming",
  "homepage": "https://www.csie.ntu.edu.tw/~ming",
  "status": "success",
  "content": "Ming Ouhyoung Ming Ouhyoung:  Home Projects Publications Selected publications  Courses CV  Links Graduated MS/Ph.D Ming Ouhyoung () Pegatron Chair Professor（2019）Adjunct Professor (8/2020-) Emeritus professor台大名譽教授 (2021-) Communication and Multimedia Lab , Graduate Institute of Networking and Multimedia Department of Computer Science and Information Engineering National Taiwan University Office: CSIE Room 341 Phone: +886-2-33664888 ADDR: Dept. of CSIE, NTU , 1 Roosevelt Rd. Sec. 4, Taipei, 106 Taiwan Office: room 341, 0233664888 ext. 341 my email http://www.csie.ntu.edu.tw/~ming Ming Ouhyoung received BS and MS degree in electrical engineering from National Taiwan University, Taipei, in 1981 and 1985, respectively. He received Ph.D degree in computer science from the university of North Carolina at Chapel Hill in Jan. 1990. He was a member of the technical staff at AT&T Bell Laboratories, Middle-town, during 1990 and 1991. Since August 1991, he has been an associate professor in the department of Computer Science and Information Engineering, National Taiwan University. Then since August 1995, he became a professor, and retired on 8/2020. Now, he is an adjunct professor. He was the Director of the Center of Excellence for Research in Computer Systems, College of Engineering, from August 1998 to July 2000, and was the Chairman of the Dept. of CSIE from August 2000 to July 2002. He was the associate dean of College of EECS (2012-2015). He has published over 100 technical papers on computer graphics, virtual reality, and multimedia systems. He is a senior member of ACM and member of IEEE. Education: BS(1977-1981), MS(1983-1985), Electrical Eng., National Taiwan University PhD(1/1986-1/1990), CS, University of North Carolina at Chapel Hill, (Dissertation title: Force Display in Molecular Docking) Experiences: Professor, Department of Computer Science and Information Engineering (8/1995~7/2020)  retired since 8/2020 Associate Dean, College of Electrical Engineering and Computer Science (8/2012~2015/7;  8/2005~7/2007) Visiting fellow, Department of Computer Science, Princeton University (9/2003-12/2003 ) Chairman, Department of Computer Science and Information Engineering (8/2000~7/2002) Director, Center of Excellence for Research in Computer Systems (8/1998-7/2000) MTS, AT&T Bell Laboratory, Middletown, N.J. USA (2/1990 - 8/1991) Google Scholar Profile (publications) Family photo My Church Gideons International",
  "content_length": 2450,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:08"
}