{
  "name": "Ouri E. Wolfson",
  "homepage": "https://www.cs.uic.edu/~wolfson",
  "status": "success",
  "content": "Wolfson, Ouri Ouri E. Wolfson Professor Department of Computer ScienceUniversity of Illinois at Chicago Biographical sketch:Ouri Wolfson's main research interests are in big data, mobile and pervasive computing, smart city technologies, and AI. He received his B.A. degree in mathematics, and his Ph.D. degree in computer science from Courant Institute of Mathematical Sciences, New York University. He is currently a Professor of Computer Science at the University of Illinois at Chicago and the founder, president, and chief Scientist of Pirouette Software Inc.. Previously he has been on the computer science faculty at the Technion, Columbia University, University of Illinois at Urbana Champaign, and a Member of Technical Staff at Bell Laboratories. He was the founder of Mobitrac, a high-tech venture-funded startup that was listed in the top 50 start-ups in Chicagoland and acquired in 2006. He served as a consultant to Argonne National Laboratory, US Army Research Laboratories, DARPA, and NASA. Ouri Wolfson authored over 240 publications, eight of them award winning. He holds seven patents, and has over 17,000 citations and an h-index of 61 on Google scholar. He is a Fellow of the Association of Computing Machinery (ACM), a Fellow of the American Association for the Advancement of Science (AAAS), a Fellow of the Institute of Electrical and Electronics Engineers (IEEE), a Fellow of the Asia-Pacific Artificial Intelligence Association (AAIA), a Fellow of the International Artificial Intelligence Industry Alliance (AIIA), and a University of Illinois Scholar for 2009. He served as a Distinguished Lecturer for the Association of Computing Machinery. Wolfson was the keynote and distinguished speaker at leading conferences and universities, recently the The Eighth International Conference on Big Data Analytics (BDA2020) , Dec. 2020, and the International Conference on Transport and Smart Cities (ICoTS 2021) , Sept. 2021. Ouri Wolfson is the Editor in Chief of the MDPI Journal of Future Transportation , the Specialty Chief Editor of Frontiers' Smart Technologies and Cities , and he chaired leading conferences. His research has been funded by the National Science Foundation (NSF), Air Force Office of Scientific Research (AFOSR), Defense Advanced Research Projects Agency (DARPA), NATO, US Army, NASA, the New York State Science and Technology Foundation, Hughes Research Laboratories, Informix, Accenture, and Hitachi Co. Full Curriculum Vitae Current Projects Directed and Related Publications: Smart City and Urban Computing Computational Neuroscience, Connectomics, Consciousness Completed Projects and Related Publications: IGERT: Computational Transportation Science . Mobile Peer-to-Peer computing (Mobi-Dik) . Moving Objects Databases (DOMINO). Active Databases. Adaptive Replication. Semantic Multicast: Intelligently Sharing Collaborative Sessions. List of Publications wolfson at uic dot edu",
  "content_length": 2929,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:11"
}