{
  "name": "Oya Aran",
  "homepage": "http://www.oyaaran.com",
  "status": "success",
  "content": "Oya's Research PageSearch this siteEmbedded FilesSkip to main contentSkip to navigationOya Arane-mail: aranoya at gmail comDirector @ Procter & Gamble R&D, Data Science & AIEducationCurrent Research InterestsPast projectsPublicationsEducationPhD: Bogazici University, Department of Computer Engineering, Istanbul, Turkey, 2008MS: Bogazici University, Department of Computer Engineering, Istanbul, Turkey, 2002BS: Bogazici University, Department of Computer Engineering, Istanbul, Turkey, 2000High School: 60.Yil Anadolu Lisesi, Izmir, Turkey, 1996Current Research InterestsSocial computing, computer vision, machine learningPast projectsMultimodal Computational Modeling of Nonverbal Social Behavior in Face to Face Interaction (SOBE), SNSF Ambizione Fellowship Project, 2011 - 2015NOVICOM: Automatic Visual Nonverbal Human Behaviour Analysis in Small Group Conversations, EU FP7 Marie Curie Intra European Fellowship project, 2009-2011.Publications (Link to Google Scholar)JournalsFC Weigend, N Kumar, O Aran, HB Amor, WearMoCap: multimodal pose tracking for ubiquitous robot control using a smartwatch, Frontiers in Robotics and AI, 2025Burcu Bakir-Gungor, Hilal Hacılar, Amhar Jabeer, Ozkan Ufuk Nalbantoglu, Oya Aran, Malik Yousef, Inflammatory bowel disease biomarkers of human gut microbiota selected via different feature selection methods, PeerJ 10, e13205, 2022Shogo Okada, Laurent Son Nguyen, Oya Aran, and Daniel Gatica-Perez, Modeling Dyadic and Group Impressions with Intermodal and Interperson Features, ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM), vol. 15, no: 2, 2019 (DOI: https://doi.org/10.1145/3265754)Yunus Emre Kara, Gaye Genç, Oya Aran & Lale Akarun, Actively Estimating Crowd Annotation Consensus , Journal of Artificial Intelligence Research, vol. 61, pp. 363-405, 2018 (code)Alp Kindiroglu, Lale Akarun, and Oya Aran, Multi-domain and multi-task prediction of extraversion and leadership from meeting videos, EURASIP Journal on Image and Video Processing, vol. 2017, pp. 77, 2018Aleksandra Cerekovic, Oya Aran, and Daniel Gatica-Perez, Rapport with Virtual Agents: What do Human Social Cues and Personality Explain?, IEEE Transactions on Affective Computing, vol. 8, no. 3, pp. 382-395, 2017Umut Avci and Oya Aran, Predicting the Performance in Decision-Making Tasks: From Individual Cues to Group Interaction, IEEE Transactions on Multimedia, 18(4):643--658, 2016Yunus Emre Kara, Gaye Genc, Oya Aran, and Lale Akarun, Modeling annotator behaviors for crowd labeling, Neurocomputing, vol. 160, pp. 141-156, 2015 (code)Oya Aran, Joan-Isaac Biel and Daniel Gatica-Perez, Broadcasting oneself: Visual Discovery of Vlogging Styles , IEEE Transactions on Multimedia , vol. 16, no. 1, pp. 201-215, 2014Dairazalia Sanchez-Cortes, Oya Aran, Marianne Schmid Mast, and Daniel Gatica-Perez, A Nonverbal Behavior Approach to Identify Emergent Leaders in Small Groups, IEEE Transactions on Multimedia, vol. 14, no.3-2, pp. 816-832, 2012Dairazalia Sanchez-Cortes, Oya Aran, Dinesh Babu Jayagopi, Marianne Schmid Mast, and Daniel Gatica-Perez, Emergent leaders through looking and speaking: from audio-visual data to multimodal recognition, Journal on Multimodal User Interfaces, 2012.Konstantinos Moustakas, Laila Dybkjaer, Oya Aran, Dimitrios Tzovaras and Niels Ole Bernsen, Using Modality Replacement to Facilitate Communication Between Blind and Hearing Impaired People, IEEE Multimedia , vol. 18, no. 2, pp. 26-37, 2011Oya Aran & Lale Akarun, A Multi-class Classification Strategy for Fisher Scores: Application to Signer Independent Sign Language Recognition, Pattern Recognition, vol. 43, no. 5, May 2010. (link)Oya Aran, Ismail Ari, Alexandre Benoit, Pavel Campr, Ana Huerta Carrillo, Francois-Xavier Fanard, Lale Akarun, Alice Caplier & Bulent Sankur, SignTutor: An Interactive System for Sign Language Tutoring, IEEE Multimedia, vol. 16, 2009. (link)Oya Aran, Thomas Burger, Alice Caplier & Lale Akarun, A Belief-Based Sequential Fusion Approach for Fusing Manual and Non-Manual Signs , Pattern Recognition, vol.42, no.5, 2009.Oya Aran, Olcay Taner Yildiz, Ethem Alpaydin, An Incremental Framework Based on Cross-Validation for Estimating the Architecture of a Multilayer Perceptron, International Journal of Pattern Recognition and Artificial Intelligence, vol. 23, no. 2, 2009.Oya Aran, Ismail Ari, Pavel Campr, Erinc Dikici, Marek Hruz, Siddika Parlak, Lale Akarun & Murat Saraclar, Speech and Sliding Text Aided Sign Retrieval from Hearing Impaired Sign News Videos , Journal on Multimodal User Interfaces, vol.2, pp.117-131, Springer, 2008. (The original publication is available at www.springerlink.com: link)S. Argyropoulos, K. Moustakas, A. Karpov, O. Aran, D. Tzovaras, T. Tsakiris, G. Varni & B. Kwon, A Multimodal Framework for the Communication of the Disabled, Journal on Multimodal User Interfaces, vol.2, pp.105-116, Springer, 2008.Alice Caplier, Sebastien Stillittano, Oya Aran, Lale Akarun, Gerard Bailly, Denis Beautemps, Nouredine Aboutabit & Thomas Burger, Image and video for hearing impaired people, EURASIP Journal on Image and Video Processing, Special Issue on Image and Video Processing for Disability, 2007.Book ChaptersD. Gatica-Perez, O. Aran, and D. Jayagopi, Small Group Analysis, in J. Burgoon, N. Magnenat-Thalmann, M. Pantic, and A. Vinciarelli (Eds.) Social Signal Processing, Cambridge University Press, pp.349-367, 2017 (link to the book)Oya Aran, Ismail Ari, Alp Kindiroglu, Pinar Santemiz and Lale Akarun, Otomatik Isaret Dili Tanıma ve Turk Isaret Dili icin Bilgisayar Uygulamalari, in Ellerle Konusmak: Turk Isaret Dili Arastirmalari / Research on Turkish Sign Language, pp. 471-498, Arik, E. (ed.), Koc University Press, 2016O. Aran & D. Gatica-Perez, Analysis of Group Conversations: Modeling Social Verticality, in Computer Analysis of Human Behavior, pp. 293-322, Salah, A. A. & Gevers, T.(ed.), Springer London, 2011.C. Keskin, O. Aran & L. Akarun, Hand Gesture Analysis, in Computer Analysis of Human Behavior, pp. 125-149, Salah, A. A. & Gevers, T.(ed.), Springer London , 2011.Oya Aran, Thomas Burger, Lale Akarun & Alice Caplier, Gestural Interfaces for Hearing-Impaired Communication, in Multimodal user interfaces: from signals to interaction, Dimitrios Tzovaras (Ed.) Springer, 2008. (The original publication is available at www.springerlink.com: link)International Conferences and WorkshopsN Kumar, O Aran, Automated Measurement of Eczema Severity with Self-Supervised Learning, IEEE EMBC 2025N Kumar, O Aran, V Vasudevan, Visual In-Context Learning for Few-Shot Eczema Segmentation, IEEE EMBC 2024FC Weigend, N Kumar, O Aran, HB Amor, Ubiquitous Robot Control Through Multimodal Motion Capture Using Smartwatch and Smartphone Data, Arxiv, 2024Baculo, M.J.C., Ruiz, C., Aran, O., Cecid Fly Defect Detection in Mangoes Using Object Detection Frameworks. In: Advances in Computer Graphics. CGI 2021. Lecture Notes in Computer Science, vol 13002. Springer, Cham. https://doi.org/10.1007/978-3-030-89029-2_16, 2021Sandrine Tornay, Oya Aran, Mathew Magimai-Doss, An HMM Approach with Inherent Model Selection for Sign Language and Gesture Recognition, LREC 2020, 2020Umut Avci, Oya Aran, Analyzing group performance in small group interaction: Linking personality traits and group performance through the verbal content, 6th International Workshop on Context Based Affect Recognition CBAR @ FG 2019, 2019Berkay Aydin, Alp Kindiroglu, Oya Aran, Lale Akarun, Automatic Personality Prediction from Audiovisual Data Using Random Forest Regression, International Conference On Pattern Recognition (ICPR'16), Cancun, Mexico , 2016Oya Aran, Dairazalia Sanchez-Cortes, Minh-Tri Do, Daniel Gatica-Perez, Anomaly Detection in Elderly Daily Behavior in Ambient Sensing Environments, ACM MM Workshop on Human Behavior Understanding (HBU 2016), 2016Shogo Okada, Oya Aran and Daniel Gatica-Perez, Personality Trait Classification via Co-Occurrent Multiparty Multimodal Event Discovery, ACM International Conference on Multimodal Interaction (ICMI 2015), Seattle, WA, USA, pages 15-22, 2015.Umut Avci, Oya Aran, Effect of nonverbal behavioral patterns on the performance of small groups, ICMI Workshop on Understanding and Modeling Multiparty Multimodal Interactions, ICMI 2014, Istanbul, Turkey, 2014Aleksandra Cerekovic, Oya Aran, Daniel Gatica-Perez, How Do You Like Your Virtual Agent?: Human-Agent Interaction Experience through Nonverbal Features and Personality Traits, ICCV Workshop on Human Behavior Understanding (HBU 2014), 2014Oya Aran and Daniel Gatica-Perez, One of a Kind: Inferring Personality Impressions in Meetings, 15th ACM International Conference on Multimodal Interaction, Sydney, Australia (ICMI 2013), 2013Oya Aran and Daniel Gatica-Perez, Cross-Domain Personality Prediction: From Video Blogs to Small Group Meetings, 15th ACM International Conference on Multimodal Interaction, Sydney, Australia (ICMI 2013), 2013Albert Ali Salah, Hayley Hung, Oya Aran, Hatice Gunes, Creative Applications of Human Behavior Understanding, ACM MM Workshop on Human Behavior Understanding (HBU 2014), 2013Kyriaki Kalimeri, Bruno Lepri, Oya Aran, Dinesh Babu Jayagopi, Daniel Gatica-Perez and Fabio Pianesi, Modeling dominance effects on nonverbal behaviors using granger causality, International Conference on Multimodal Interaction, ICMI 2012, Santa Monica, CA, 2012.D. Sanchez-Cortes, O. Aran, D. Gatica-Perez, An audio visual corpus for emergent leader analysis, ICMI workshop on Multimodal Corpora for Machine Learning, Alicante, 2011.J.-I. Biel, O. Aran, D. Gatica-Perez, You Are Known by How You Vlog: Personality Impressions and Nonverbal Behavior in YouTube, AAAI International Conference on Weblogs and Social Media (ICWSM), Washington DC, May 2011 .G. Chittaranjan, O. Aran, and D. Gatica-Perez, Exploiting Observers' Judgments for Nonverbal Group Interaction Analysis, IEEE Int. Conf. on Automatic Face and Gesture Recognition (FG), Santa Barbara, 2011.D. Sanchez-Cortes, O. Aran, M. Sc",
  "content_length": 15890,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:13"
}