{
  "name": "Oyewole Oyekoya",
  "homepage": "https://wolex.com",
  "status": "success",
  "content": "Welcome - Visualization and Virtual Reality Lab CUNY Academic CommonsPeopleGroupsSitesCoursesEventsActivityAboutLog InRegisterSearchHelp NotificationsNotifications Skip to main content Visualization and Virtual Reality Lab VR, AR, MR and Visualization Research Search for: Search Welcome Profile Prof. Wole leads the Visualization and Virtual Reality Lab. He is an Associate Professor at Hunter College, City University of New York (CUNY) and a member of the Doctoral Faculty of CUNY Graduate Center (CUNY’s Ph.D. Program in Computer Science). He obtained his PhD in 2007 at University College London, where he worked on “Eye Tracking: A Perceptual Interface for Content Based Image Retrieval”. His PhD advisor was Prof. Fred Stentiford. Prior to his appointment at CUNY, he led the Visualization Group, part of Clemson Computing and Information Technology of Clemson University from August 2015 to August 2019. At Virginia Tech, he worked in the Visualization Group, part of Advanced Research Computing (ARC) from November 2013 to June 2015. At University College London, he worked with Prof Anthony Steed in the Virtual Environments and Computer Graphics Group at the University College London from January 2008 to October 2013. He worked on two EU-funded telepresence projects (Beaming and Presenccia) and one EPSRC project (Eye Catching: Supporting Tele-communicational Eye-gaze in Collaborative Virtual Environments). At Middlesex University, he worked on a EU-funded TIME (Tele-Imaging in Medicine) project. His research focus was on 3D Visualization of Retrieved PET Images and reported to Prof. Xiaohong Gao. He is a guest associate editor of Virtual Reality in Medicine (Frontiers in Virtual Reality journal) and a research topic editor for the same journal on “Virtual Reality and Mental Health: Opportunities to Advance Research and Practice”. He is also a recipient of funding from the National Science Foundation, Adobe Digital Marketing Research Award and PSC CUNY Research Award. His research expertise and interests include the following areas: Immersive Visualization and Virtual Reality Digital Humans (Virtual Self) Data Science and Visualization Scientific Visualization Learning in Virtual Environments Distributed Heterogeneous Systems Robotics and Telepresence Eye Tracking and Visual Attention Modeling This entry is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International license. News New Meta Quest 3 VR HeadsetsComputers & Education: XRACM SIGGRAPH Asia 2024ACM SIGGRAPH Asia 2023VR-REU 2022: New Research Experience Program to Broaden Participation in ComputingFrontiers in VR PaperACM SUI PaperPhD Student PositionNSF REU AwardACM ICVARS Paper Hunter College City University of New York HN-1001T 695 Park Ave New York, NY 10065 Telephone: +1 (212) 396-6837 Email: oo700 at hunter dot cuny dot edu Follow me: Need help with the Commons? Email us at commonshelpsite@gmail.com so we can respond to your questions and requests. Please email from your CUNY email address if possible. Or visit our help site for more information: Visit our help site Help Privacy Terms of Service Accessibility Creative Commons (CC) license unless otherwise noted Built with WordPress Protected by Akismet Powered by CUNY",
  "content_length": 3261,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:15"
}