{
  "name": "Oznur Tastan",
  "homepage": "http://people.sabanciuniv.edu/otastan",
  "status": "success",
  "content": "Oznur Tastan Okan Sabanci University, FENS 2058, Istanbul, Turkey, 34956. otastan [at] sabanciuniv.edu +90-216-483-9883 Associate Professor at the Faculty of Engineering and Natural Sciences at Sabanci University, member of Computer Science and Engineering and the Molecular Biology, Genetics and Bioengineering programs. I am currenlty the graduate cordinator for the Data Science Masters Program with thesis . I am also affiliated with The Center of Excellence for Data Analytics . NEWS! Recently elected as the co-president for the Machine Learning in Computational and Systems Biology (MLCSB) community, which promotes the exchange of ideas, interactions and collaborations in this area. I will be serving with Prof. Anshul Kundaje as a co-president for 4 years. MLCSB is a community of special interest (COSI) of the International Society for Computational Biology (ISCB) . Will be serving as an associate editor for the IEEE/ACM Transactions on Computational Biology and Bioinformatics. Served as one of the Track Chairs (with Su-In Lee ) for the Machine Learning for Computational Systems Biology (MLCSB) COSI, ISMB 2023. Served as the Publication Chair for the RECOMB 2023 that took place in Istanbul. Gave a lecture in Paris for the FEBS Advance Lecture Course in Paris for the Computational Systems Biology . Delivered a keynote talk at the ISMB/ECCB 2021 Machine Learning in Computational and Systems Biology (MLCSB) COSI, Jul 30, 2021. Looking for highly motivated students to work on various projects in machine learning and/or computational biology! Write me an e-mail if you are interested otastan [at] sabanciuniv.edu. Find the application information on graduate programs here. You may apply through the Computer Science program, Data Science program or the Molecular Biology, Genetics and Engineering program. The students will be supported through a TUBITAK project or through scholarships. Details on financial aid and scholarships are provided here . Bio: Before joining Sabanci University, I was a faculty member of Bilkent University, Department of Computer Engineering. I worked as a post-doctoral researcher at Microsoft Research New England Lab. I obtained my PhD in 2011 and MSc in 2007 (in parallel to PhD) from Carnegie Mellon University, School of Computer Science, Language Technologies Intitute I graduated from Sabancı University in 2004 (The first settlers of the campus). And that makes a full circle! Research interest: My research lies at the boundary of machine learning and computational biology. Advances in molecular profiling technologies have resulted in large quantities of data, turning biology into a data rich field. A key challenge is to use this data effectively to deepen our understanding of the molecular basis of the workings of the cell, diseases, and to translate this knowledge into clinics. My research focuses on developing methodologies towards this aim. Note that, I also like to work in other applications of machine learning and data science if the problem triggers my curiosity. Curriculum Vitae [pdf]",
  "content_length": 3065,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:23"
}