{
  "name": "P. Krishna Gummadi [SWS]",
  "homepage": "https://www.mpi-sws.org/~gummadi",
  "status": "success",
  "content": "Krishna Gummadi's Home Page, Networked Systems Group, Max Planck Institute for Software Systems (MPI-SWS) Krishna P. Gummadi Faculty (Scientific Director) Head, Networked Systems Research Group Max Planck Institute for Software Systems (MPI-SWS) Email: [ Bio | CV | Research | Students / Postdocs | Teaching | Publications | Citations | Professional Activities | Contact ] I am broadly interested in understanding and building networked and distributed computer systems. Past Interests: Internet (Broadband) Access Networks, Trusted Cloud Computing, Peer-to-Peer / Overlay Routing Systems. Current Interests: Social Computing Systems. (Related Key Words: Crowdsourcing and Social Media Systems, Social and Information Networks, Computational Social Science, Computational Journalism, Security and Privacy, Information Dissemination, Search, and Recommender Systems) Current Research Overview What are Social Computing Systems? They are an emerging class of societal-scale human-computer systems that facilitate interactions and knowledge exchange between individuals, organizations, and governments in our society. Examples include social networking sites like Facebook and Google+, blogging and microblogging sites like Twitter and LiveJournal, anonymous social media sites like Whisper and 4chan, content sharing sites like YouTube and Instagram, social bookmarking sites like Reddit and Pintrest, crowdsourced opinion sites like Yelp and eBay seller ratings, and social peer production sites like Wikipedia and Amazon's Mechanical Turk. Motivating Perspective: Social computing systems represent human-computer symbiosis at societal-scale. By symbiosis, we refer to networking of humans and computers, where human societal behaviors affect computations and vice-versa. Goals: The high-level goals of our studies of social computing systems are to Understand, Predict, and Control the behaviors of their constituent human users and computer systems. Methodology: We leverage a variety of inter-disciplinary methods in our studies: User-centric Studies: We conduct empirical studies of user behaviors and interactions in social computing systems using large-scale observational studies of deployed systems as well as smaller-scale studies of users recruited on the Web to participate in experimental systems and surveys. Data-centric Studies: We construct and analyze computational models of user and system behaviors from the data we gather using appropriate data mining (e.g., graph analysis, data clustering and dimensionality reduction), statistical learning (e.g., supervised learning and convex optimization) and NLP (e.g., statistical language and topic models) techniques. Systems-centric Studies: We leverage insights from our empirical and analytical studies above to design, implement and deploy useful systems and services in practice (e.g., check out our publicly deployed systems and apps listed below.) Projects: We have conducted some of the earliest studies of Social Network Analysis gathering data from real-world social networks at scale. Our recent studies have focussed on: Bias, Fairness, and Transparency in Data Driven Decision Systems Trustworthiness, Credibility, and Reputation of Social Identities Privacy, Anonymity, and Exposure in Crowdsourcing Systems Information Dissemination, Retrieval, and Assimilation in Social Media Systems Datasets: We have released several datasets from our empirical studies. Details for obtaining them can be found here. Systems: We have publicly released software code and deployed several systems and apps to illustrate the utility of our studies. Learning Fair Classifiers: Github code repository for training fair classifiers. Trust assessment and fraud detection: (i) TrulyTweeting and (ii) TrulyFollowing services to detect manipulation (tampering) of popularity of Twitter content and Twitter users, respectively. Privacy risk awareness, assessment, and management: (i) Secondary footprint, a Twitter app to help users check what information others are leaking about them in Twitter, (ii) Friendlist Manager, a Facebook app to help users manage their friendlists that are used to configure access controls and (iii) Privacy IQ, a Facebook app to raise user awareness about their privacy settings. Search and recommendations: Systems to (i) help Twitter users measure and manage information diets, (ii) find relevant and trustworthy topical content and topical authorities (experts) in Twitter, and (iii) discover topical interests and topical expertise of Twitter users. Students / Postdocs Graduate Students: I work with the following fantastic graduate students at Max Planck Institutes: Junaid Ali, Reza Babaei, Nina Grgić-Hlača, Preethi Lahoti, Johnnatan Messias, Till Speicher If you are interested in graduate studies at MPI-SWS, follow this link. Postdoctoral Researchers: I am delighted to collaborate with Abhijnan Chakraborty I am also fortunate to work with the following graduate students and postdocs outside Max Planck Institutes: Hoda Heidari, Elissa Redmiles, Giridhari Venkatadri Former Students / Postdocs (with their first employment): Asia J. Biega, Ph.D. student (coadivised with Gerhard Weikum), Postdoctoral Researcher at Microsoft Research Montreal Przemyslaw Grabowicz, postdoctoral researcher, Research Assistant Professor at University of Massachusetts, Amherst Muhammad Bilal Zafar, Ph.D. student, Research Engineer at Bosch Center for Artifical Intelligence Juhi Kulshrestha, Ph.D. student, Postdoctoral Researcher at Leibniz Institute for Social Sciences Mainack Mondal, Ph.D. student, Postdoctoral Researcher at University of Chicago Rijurekha Sen, postdoctoral researcher (coadvised with Peter Druschel), Assistant Professor at IIT Delhi Oana Goga, postdoctoral researcher, Researcher at CNRS Saptarshi Ghosh, postdoctoral researcher, Assistant Professor at IIT Kharagpur Denzil Correa, postdoctoral researcher, Data Scientist at Bayer Business Services Bimal Viswanath, Ph.D. student (coadvised with Alan Mislove), Researcher at Bell Labs Nuno Santos, Ph.D. student (coadvised with Rodrigo Rodrigues), Assistant Professor at IST Lisbon Massimiliano Marcon, Ph.D. student, Software Engineer at SAP Marcel Dischinger, Ph.D. student, Senior Software Engineer at Barracuda Networks Meeyoung Cha, postdoctoral researcher, Assistant Professor at KAIST Alan Mislove, Ph.D. student (coadvised with Peter Druschel), Assistant Professor at Northeastern University Teaching Distributed Systems: Winter 18 Human-Centered Machine Learning: Winter 18 Distributed Systems: Winter 16 Social Media Analysis: Summer 16 Human vs. Algorithimc Decision Making: Bias, Fairness, and Transparency: Winter 15 Security and Privacy in Social Computing Systems: Summer 13 Systems Seminar: Winter 10 Computer Networks: Summer 07 Publications For a complete list of my publications in chronological order, follow this link. Publications related to past projects: Internet Access Networks | Trusted Cloud Computing | Peer-to-Peer and Overlay Routing Systems Publications related to Social Computing Systems grouped by research topic: Bias, Fairness, and Transparency | Privacy, Anonymity, and Exposure | Trustworthiness, Credibility, and Reputation | Information Dissemination, Retrieval, and Assimilation | Social Network Analysis Bias, Fairness, and Transparency in Data Driven Decision Systems: Fairness Behind a Veil of Ignorance: A Welfare Analysis for Automated Decision Making, by Hoda Heidari, Claudio Ferrari, Krishna P. Gummadi, and Andreas Krause To Appear in Proceedings of the 32nd Annual Conference on Neural Information Processing Systems (NIPS), Montreal, Canada, December 2018. A Unified Approach to Quantifying Algorithmic Fairness: Measuring Individual and Group Unfairness via Inequality Indices, by Till Speicher, Hoda Heidari, Nina Grgić-Hlača, Krishna P. Gummadi, Adrian Weller, and Muhammad Bilal Zafar Proceedings of the 24th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), London, UK, August 2018. (.pdf, 1.9 MB) Blind Justice: Fairness with Encrypted Sensitive Attributes, by Niki Kilbertus, Adria Gascon, Matt Kusner, Michael Veale, Krishna P. Gummadi, and Adrian Weller Proceedings of the 35th International Conference on Machine Learning (ICML), Stockholm, Sweden, July 2018. (.pdf, 767 KB) Equity of Attention: Amortizing Individual Fairness in Rankings, by Asia J. Biega, Krishna P. Gummadi, and Gerhard Weikum Proceedings of the 41st Annual SIGIR Conference (SIGIR), Ann Arbor, Michigan, July 2018. (.pdf, 1.4 MB) Media Bias Monitor: Quantifying Biases of Social Media News Outlets at Scale, by Filipe N. Ribeiro, Lucas Henrique, Fabricio Benevenuto, Abhijnan Chakraborty, Juhi Kulshrestha, Mahmoudreza Babaei, and Krishna P. Gummadi Proceedings of the 12th International AAAI Conference on Web and Social Media (ICWSM), Stanford, California, June 2018. (.pdf, 462 KB) Human Perceptions of Fairness in Algorithmic Decision Making: A Case Study of Criminal Risk Prediction, by Nina Grgić-Hlača, Elissa Redmiles, Krishna P. Gummadi, and Adrian Weller Proceedings of the 27th Web Conference (WWW) , Lyon, France, April 2018. (.pdf, 604 KB) On the Potential for Discrimination in Online Targeted Advertising, by Till Speicher, Muhammad Ali, Giridhari Venkatadri, George Arvanitakis, Krishna P. Gummadi, Patrick Loiseau, and Alan Mislove Proceedings of the 1st Conference on Fairness, Accountability, and Transparency (FAT) , New York City, New York, February 2018. (.pdf, 560 KB) Investigating Ad Transparency Mechanisms in Social Media: A Case Study of Facebook’s Explanations, by Athanasios Andreou, Giridhari Venkatadri, Oana Goga, Krishna P. Gummadi, Patrick Loiseau, and Alan Mislove Proceedings of the 24th Network and Distributed System Security Symposium (NDSS), San Diego, California, February 2018. (CNIL-INRIA Privacy Runners-Up Award) (.pdf, 1.8 MB) Beyond Distributive Fairness in Algorithmic Decision Making: Feature Selection for Procedurally Fair Learning, by Nina",
  "content_length": 30356,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:18"
}