{
  "name": "Pablo Alejandro Figueroa",
  "homepage": "https://profesores.virtual.uniandes.edu.co/pfiguero/es/inicio",
  "status": "success",
  "content": "Pablo Alejandro Figueroa Forero Pablo Alejandro Figueroa Forero Profesor Asociado Grupo:: Research Group: IMAGINE-Computación Visual, I+D+i Contacto: Oficina: Office: ML 434 Correo: Email: Extensión: Extension: 2864 Formación Investigación Publicaciones Cursos Dictados Experiencia Proyectos Hoja de Vida Sobre Videojuegos Realidad Virtual Thesis Presentaciones Otros Ph.D. en Ciencias de la Computación, Universidad de Alberta, Canadá Magíster en Ingeniería de Sistemas y Computación, Universidad de los Andes, Colombia Ingeniero de Sistemas, Universidad Nacional de Colombia, Colombia Páginas de Interés Intereses y líneas de Investigación: Realidad virtual y aumentada Desarrollo de videojuegos Grupo:: Research Group: IMAGINE-Computación Visual, I+D+i Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar Explorando el uso de la Realidad Virtual y el análisis de datos para el bienestar emocional en un entorno universitario Tesis 2025 .(2025). Explorando el uso de la Realidad Virtual y el análisis de datos para el bienestar emocional en un entorno universitario.Trabajo Dirigido por: Figueroa P - 2025 A Case Study on User Centered Design for VR Based Training in Health Capítulo en Memoria 2024 Figueroa P, Rivera C, Casas P, López J, Mora D, Gomez I, Peñaranda K, Figueroa P. (2024) A Case Study on User Centered Design for VR Based Training in Health. IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW) (ISBN 979-8-3503-7449-0) - 2024 Answering Anya: Un juego de realidad virtual y mixta centrado en el proceso de nurturing usando eye/gaze tracking, inteligencia artificial y detección de objetos Tesis 2024 .(2024). Answering Anya: Un juego de realidad virtual y mixta centrado en el proceso de nurturing usando eye/gaze tracking, inteligencia artificial y detección de objetos.Trabajo Dirigido por: Figueroa P - 2024 Desarrollo de videojuegos en realidad virtual: the hands of Midas Tesis 2024 .(2024). Desarrollo de videojuegos en realidad virtual: the hands of Midas.Trabajo Dirigido por: Figueroa P - 2024 Desarrollo y evaluación de un sistema de terapia gamificada para la rehabilitación de parálisis facial central Tesis 2024 .(2024). Desarrollo y evaluación de un sistema de terapia gamificada para la rehabilitación de parálisis facial central.Trabajo Dirigido por: Figueroa P - 2024 Exploración de la dirección de la mirada como indicador de atención en ambientes con realidad extendida Tesis 2024 .(2024). Exploración de la dirección de la mirada como indicador de atención en ambientes con realidad extendida.Trabajo Dirigido por: Figueroa P - 2024 Inmersión total: creando el Gemelo Digital del Laboratorio Colivri en la Universidad de Los Andes Tesis 2024 .(2024). Inmersión total: creando el Gemelo Digital del Laboratorio Colivri en la Universidad de Los Andes.Trabajo Dirigido por: Figueroa P - 2024 Passive Haptic Feedback for Control Elements in Virtual Reality Capítulo en Memoria 2024 Tatzgern M, Fasching D, Gómez V, Calvache S, Figueroa P, Figueroa P. (2024) Passive Haptic Feedback for Control Elements in Virtual Reality. IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW) (ISBN 979-8-3503-7449-0) - 2024 ProtoColVR: Requirements Gathering and Collaborative Rapid Prototyping of VR Training Simulators for Multidisciplinary Teams Artículo 2024 Gómez V, Figueroa P, Figueroa P. (2024) ProtoColVR: Requirements Gathering and Collaborative Rapid Prototyping of VR Training Simulators for Multidisciplinary Teams. IEEE Transactions on Visualization and Computer Graphics (ISSN 1077-2626) 30 (5), pp. 2549-2558. - 2024 The Influence of Metaverse Environment Design on Learning Experiences in Virtual Reality Classes: A Comparative Study Capítulo en Memoria 2024 Uribe V, Figueroa P, Gómez V, Figueroa P. (2024) The Influence of Metaverse Environment Design on Learning Experiences in Virtual Reality Classes: A Comparative Study. IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW) (ISBN 979-8-3503-7449-0) - 2024 The influence of metaverse environment design on the quality of experience in virtual reality classes: a comparative study Artículo 2024 Uribe V, Figueroa P, Gomez V. (2024) The influence of metaverse environment design on the quality of experience in virtual reality classes: a comparative study. Frontiers in Education (ISSN 2504-284X) 9 (1), pp. 1-18. - 2024 Tracing the Visual Path: Gaze Direction in the 360 Video Experience Capítulo en Memoria 2024 Rozo-bernal V, Figueroa P, Figueroa P. (2024) Tracing the Visual Path: Gaze Direction in the 360 Video Experience. Advances in Computing (ISBN 978-3-031-47372-2) - 2024 Using Virtual Reality to Detect Memory Loss: An Exploratory Study Capítulo en Memoria 2024 Contreras M, Figueroa P, Figueroa P. (2024) Using Virtual Reality to Detect Memory Loss: An Exploratory Study. Advances in Computing (ISBN 978-3-031-47372-2) - 2024 Ambiente VR para preparar presentaciones en público Tesis 2023 .(2023). Ambiente VR para preparar presentaciones en público.Trabajo Dirigido por: Figueroa P - 2023 Defensor de la cultura Tesis 2023 .(2023). Defensor de la cultura.Trabajo Dirigido por: Figueroa P - 2023 EscapeVR: Explorando la colaboración entre usuarios en un juego de escaperoom de realidad virtual Tesis 2023 .(2023). EscapeVR: Explorando la colaboración entre usuarios en un juego de escaperoom de realidad virtual.Trabajo Dirigido por: Figueroa P - 2023 Wizard Chess Tesis 2023 .(2023). Wizard Chess.Trabajo Dirigido por: Figueroa P - 2023 Corruptio Tesis 2022 .(2022). Corruptio.Trabajo Dirigido por: Figueroa P - 2022 Desarrollo humano para valientes: aplicación de realidad virtual para apoyar la generación de empatía Tesis 2022 .(2022). Desarrollo humano para valientes: aplicación de realidad virtual para apoyar la generación de empatía.Trabajo Dirigido por: Figueroa P - 2022 FotoDiversidadVR Tesis 2022 .(2022). FotoDiversidadVR.Trabajo Dirigido por: Figueroa P - 2022 2015 2015-10 AMBIENTES INTERACTIVOS 3D VIDEOJUEGOS: TEC.,DISEÑO Y CUL 2015-20 VIDEOJUEGOS: TEC.,DISEÑO Y CUL 2016 2016-10 VIDEOJUEGOS: TEC.,DISEÑO Y CUL 2017 2017-10 ALGORITMICA Y PROGR. OBJ. I AMBIENTES INTERACTIVOS 3D VIDEOJUEGOS: TEC.,DISEÑO Y CUL 2017-20 ALGORITMICA Y PROGR. OBJ. I INTRO VIDEOJUEGOS SIMUL Y EDUC VIDEOJUEGOS: TEC.,DISEÑO Y CUL 2018 2018-10 VIDEOJUEGOS: TEC.,DISEÑO Y CUL COMPUTACION VISUAL INTERACTIVA 2018-20 INTR PENSAMIENTO COMPUTACIONAL VIDEOJUEGOS Y CULTURA ALGORITMICA Y PROGR. OBJ. I 2019 2019-10 VIDEOJUEGOS PROD.CULTURAL INTR PENSAMIENTO COMPUTACIONAL DES APLICACIONES REALDAD MIXTA 2019-20 VIDEOJUEGOS PROD.CULTURAL COMPUTACION VISUAL INTERACTIVA 2020 2020-10 VIDEOJUEGOS PROD.CULTURAL INTR PENSAMIENTO COMPUTACIONAL 2020-20 VIDEOJUEGOS PROD.CULTURAL INTR PENSAMIENTO COMPUTACIONAL 2021 2021-10 COMPUTACION VISUAL INTERACTIVA INTR PENSAMIENTO COMPUTACIONAL VIDEOJUEGOS PROD.CULTURAL 2021-20 DES APLICACIONES REALDAD MIXTA VIDEOJUEGOS PROD.CULTURAL INTR PENSAMIENTO COMPUTACIONAL 2022 2022-10 VIDEOJUEGOS PROD.CULTURAL INTROD. INGENIERÍA DE SISTEMAS PROYECTO DE GRADO INTR PENSAMIENTO COMPUTACIONAL 2022-20 ODS EN REGIONES COLOMBIANAS COMPUTACION VISUAL INTERACTIVA PROYECTO DE GRADO VIDEOJUEGOS PROD.CULTURAL INTROD. INGENIERÍA DE SISTEMAS 2023 2023-10 DESARROLLO DE VIDEOJUEGOS DES APLICACIONES REALDAD MIXTA INTROD. INGENIERÍA DE SISTEMAS ODS EN REGIONES COLOMBIANAS 2023-12 DESARROLLO DE VIDEOJUEGOS 2023-20 INTROD. INGENIERÍA DE SISTEMAS PROYECTO DE GRADO VIDEOJUEGOS PROD.CULTURAL 2024 2024-10 PROYECTO DE GRADO DES APLICACIONES REALDAD MIXTA VIDEOJUEGOS PROD.CULTURAL INTROD. INGENIERÍA DE SISTEMAS DESARROLLO DE VIDEOJUEGOS 2024-12 DESARROLLO DE VIDEOJUEGOS 2024-20 PROYECTO DE GRADO 2025 2025-10 COMPUTACION VISUAL INTERACTIVA VIDEOJUEGOS PROD.CULTURAL PROYECTO DE GRADO INTROD. INGENIERÍA DE SISTEMAS DESARROLLO DE VIDEOJUEGOS 2025-12 DESARROLLO DE VIDEOJUEGOS 2025-20 VIDEOJUEGOS PROD.CULTURAL PROYECTO DE GRADO DES APLICACIONES REALDAD MIXTA INTROD. INGENIERÍA DE SISTEMAS Profesor Visitante, Institut Image, Francia (Año Sabático, 2016) Investigador Invitado, Institute of Creative Technologies, Los Angeles, USA (Año Sabático, 2016) ES EN ACAC Estado: Cerrado Categoría: Investigación Grupo: IMAGINE-Computación Visual, I+D+i Colciencias Estado: Cerrado Categoría: Consultoria Grupo: Sin grupos asociados Colombia movil S.A. ESP Estado: Cerrado Categoría: Consultoria Grupo: IMAGINE-Computación Visual, I+D+i Fortalecimiento de Capacidades – MINTIC Vivelabs Estado: Cerrado Universidad del Atlántico Categoría: Consultoria Grupo: Sin grupos asociados Impointer S.A. Estado: Cerrado Categoría: Consultoria Grupo: IMAGINE-Computación Visual, I+D+i Universidad del Atlántico – Fortalecimiento de Capacidades – MINTIC Vivelabs Estado: Cerrado Programa fortalecimiento de capacidades en contenidos digitales. Categoría: Consultoria Grupo: IMAGINE-Computación Visual, I+D+i Universidad EAFIT Estado: Cerrado Categoría: Investigación Grupo: IMAGINE-Computación Visual, I+D+i Universidad Nacional de Colombia Estado: Cerrado Categoría: Consultoria Grupo: IMAGINE-Computación Visual, I+D+i ACAC Status: Closed Category: Investigación Research Group: IMAGINE-Computación Visual, I+D+i Colciencias Status: Closed Category: Consultoria Research Group: No Research groups Colombia movil S.A. ESP Status: Closed Category: Consultoria Research Group: IMAGINE-Computación Visual, I+D+i Fortalecimiento de Capacidades – MINTI",
  "content_length": 29015,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:28"
}