{
  "name": "Pablo Rivas-Perea",
  "homepage": "https://www.rivas.ai",
  "status": "success",
  "content": "Dr. Pablo Rivas I am Dr. Pablo Rivas, an Assistant Professor of Computer Science at Baylor University and former Assistant Professor at Marist College and NASA Goddard Space Flight Center. With a decade of experience in the tech industry as a software engineer and membership as a Senior Member of the IEEE, ACM, and SIAM, I bring a wealth of knowledge to my teaching of machine learning and deep learning courses, focused on natural language processing and computer vision. I am an ally for women in technology and advocate for democratizing AI and machine learning. My research interests include machine learning, computer vision, and AI ethics, and I publish in top machine learning conferences such as NeurIPS, ICML, and ACL. I am also actively developing AI ethics standards with the IEEE Standards Association; I hope the term AI Orthopraxy catches on. [ Courses | Sched | Students | Papers | Bio ] Education Ph.D. Electrical and Computer Engineering, (honors society HKN). The University of Texas at El Paso (UTEP), 2011. Dissertation: \"Algorithms for training large-scale linear programming support vector regression and classification.\" [ bib |  .pdf 30.6MB ] M.S. Electrical Engineering, Chihuahua Institute of Technology (ITCH), 2006. Thesis: Face Recognition under Non-Cooperative Environments. B.S. Computer Science, Nogales Institute of Technology (ITN), 2004. Research Interests I am an AI researcher with a strong passion for exploring the possibilities of machine learning and artificial intelligence. My research interests lie in a wide range of topics within this field, including deep learning, neural networks, autoencoders, and adversarial training. I am particularly interested in understanding how these technologies can be leveraged to produce advanced systems, such as chatbots, that can have a significant impact on people's lives. Additionally, I have a keen interest in exploring the ethical implications of AI and machine learning, particularly with regards to standards for AI ethics. Another area of my research focuses on image processing, particularly in the context of remote sensing and multispectral image segmentation. I am dedicated to understanding the underlying algorithms and models that drive these technologies, and I strive to uncover new and innovative ways to improve their accuracy and performance. One area of my research that I am particularly passionate about is the optimization of machine learning models. This involves finding the right set of hyper-parameters that will allow a model to perform at its best. I also take a close interest in exploring feature importance estimation, which is a technique used to determine which variables in a dataset are most relevant to a machine learning model's predictions. Overall, my research interests center around developing advanced machine learning and artificial intelligence technologies that are both accurate and ethically sound. I am constantly searching for new and innovative ways to push the boundaries of this field and bring machine learning closer to its full potential. Teaching Data Mining and Analysis - CSI 5355 Advanced topics in Data Mining are presented. These include the pattern analysis of numerical, categorical, time, and textual data. The course focuses on algorithms for clustering and predictive modeling with special attention to extracting useful information from raw data, and methods for data validation. [ Fall 2024 | Fall 2025 ] Introduction to Data Mining - CSI 4352 Introduction to the concepts, techniques, and applications of data mining. Topics include design and implementation of data analysis pipelines; data mining concepts and methods such as association rule mining, pattern mining, classification, regression, and clustering; applications of data mining techniques to complex types of data in various fields. [ Fall 2020 | Fall 2021 | Fall 2023 | Fall 2024 | Fall 2025 ] Advanced Deep Learning - CSI 6326 This course offers an in-depth exploration of advanced deep learning methodologies, focusing on state-of-the-art neural network architectures such as convolutional, recurrent, attention mechanisms, and auto-regressive generative models. Emphasis is placed on advanced optimization techniques, hyperparameter tuning, and neural architecture search. Students will engage in rigorous theoretical study and practical implementation, addressing applications in computer vision, natural language processing, bioinformatics, and cybersecurity. The course also critically examines the ethical and societal implications of AI technologies. The course integrates theoretical foundations with research projects, preparing students to address complex challenges in AI research and industry. [ Spring 2025 ] Machine Learning - DSC 4310 This course provides an introduction to the fundamental methods and theory of modern machine learning. Machine learning algorithms covered include: shallow, mid-level, and deep learning models and their applications as well as unsupervised learning and reinforce learning techniques. [ Spring 2025 ] Information Retrieval and Natural Language Processing - CSI 5360 This course introduces fundamental and advanced algorithms in Information Retrieval and Natural Language Algorithms. Topics include Language Modelling, Retrieval Algorithms and Evaluation, and Language Processing techniques such as tagging, parsing, lexical semantics, embeddings and some of most of the most recent machine-learning based approaches to these. Applications and research topics are also covered throughout the course. The Python language will be used to develop applications and projects to showcase its potential. [ Spring 2022 | Spring 2023 | Spring 2024 ] Introduction to Algorithms- CSI 3344 This course will provide a comprehensive introduction to computer algorithms taken from diverse areas of application. This course will concentrate on algorithms of fundamental importance and on analyzing the efficiency of these algorithms. [ Fall 2023 ] Data Structures and Algorithms - CSI 3334 Software design and construction with abstract data types. Description, performance and use of commonly-used algorithms and data structures including lists, trees, and graphs. [ Spring 2015 | Fall 2014 | Spring 2014 | Fall 2013 | Fall 2022 ] Introduction to Machine Learning - CSI 5325 Introduction to the major problems, techniques, and issues around the theory of learning from data. Emphasis is placed upon the topics of machine learning and problem solving. The python language is used to illustrate various machine learning techniques. [ Spring 2021 ] Security Algorithms and Protocols - MSCS 630 Analysis of the fundamental risks, vulnerabilities and threats to mobile and cloud based applications and the countermeasures that must be implemented to reduce risks to these applications and associated infrastructure with a specific focus on cryptography. Topics covered include risk assessment, foundations of cryptography, symmetric and public key cryptography, stream ciphers, block ciphers and hashing algorithms, public key infrastructures (PKI), cryptographic algorithms (RSA, DES, AES), cryptographic protocols (SSL, TLS, IPSEC), key exchange protocols (DiffieÂ­Hellman, RSA and IKE), authentication protocols (Radius, the Java cryptographic API and government regulations and cryptographic standards). [ Spring 2016 | Spring 2017 | Spring 2018 | Spring 2020 ] Advanced Data Structures - MSCS 502 This course continues the study and implementation of linear and non-linear data structures including linked lists, stacks, queues, trees, heaps, and hashing. Complexity will be considered on sorting algorithms and efficient structures will be covered including balanced binary search trees and priority queues. Advanced Java topics will be covered including abstract classes, class inheritance, and polymorphism. [ Fall 2018 | Spring 2019 | Fall 2019 | Spring 2020 ] Data Science Project - DATA 477 Study of project management techniques, review of oral presentation skills, creation of machine learning project, assembly of project teams, selection of a project client, data pipeline analysis and design, and beginning of project implementation. [ Spring 2020 ] Formal Languages and Computability - CMPT 440 Study of formal languages, automata, and computability provides the theoretical foundation for the design, specification, and compilation of programming languages. The formal languages of the Chomsky Hierarchy, their grammars, and the associated abstract machines or automata will be studied. This leads naturally to consideration of the theory of computability. [ Spring 2016 | Spring 2017 | Spring 2019 | Spring 2020 ] Algorithm Analysis and Design - CMPT 435 This course continues the study of data structures and algorithm complexity from a more mathematically formal viewpoint. Time complexity of algorithms will be examined using Big Oh notation for worst-, best-, and average-case analyses. The ideas of polynomial-time, NP, exponential, and intractable algorithms will be introduced. Elementary-recurrence relation problems relating to recursive procedures will be solved. Sorting algorithms will be formally analyzed. Strategies of algorithm design such as backtracking, divide and conquer, dynamic programming, and greedy techniques will be emphasized. We will be using the Java programming language as our base language. [ Spring 2018 | Spring 2019 | Spring 2020 ] Emerging Technologies - MSIS 620 This course addresses the management of emerging technologies, how they evolve, how to identify them and the effects of international, political, social, economic, and cultural factors on them. We discuss the management challenges posed by emerging technologies at the point where scientific research reveals a technological possibility and goes all the way to the commercialization of the technology into lead markets. [ Fall 2017 | Fall 2018 | Fall 2019 ] Computer Science Project - CMPT 475 Study of project management techniqu",
  "content_length": 77645,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:31"
}