{
  "name": "Pai H. Chou",
  "homepage": "http://epl.tw/people/phchou",
  "status": "success",
  "content": "周百祥 教授 – EPL Skip to content 周百祥 教授 (Professor Pai H. Chou) Department of Computer Science (CS)National Tsing Hua University (NTHU)620 Delta BuildingHsinchu City, TAIWAN 300044+886 (3) 574-2959 fax +886 (3) 573-1201[email protected]Embedded Platform Lab 招生資訊 (2024.11.20)  推甄/考試生: 連絡我們以前，先觀看影片 (1 小時 6 分鐘 華語發音)介紹EPL研究。面談時間是每週三 11am-12pm.  必須先 email professor and CC contact window  預約才能加入 conference call.  Email須附成績單、作品集。面談時必須能清楚說明自己的強項、和如何能夠對Sysmaker計畫做出什麼貢獻。 (2024.11.15) we have already admitted all the senior project students(專題生已收滿) we can take for 2025.  Thank you for your interest.  專題區 for report requirements. Research Interests embedded systems hardware and software, the Internet of Things low-power design and energy harvesting design tools and system modeling Teaching (2023 fall) CS 1358 Introduction to Programming in Python (2023 fall) EECS 1210 Introduction to Programming in Python (2023 fall) CS 3423 Operating Systems Other semesters CS 5912 English for Science and Technology – Spring semesters (but not 2022, 2023) Embedded Systems (hopefully again… waiting for Sysmaker to finish) Research Publications, Google Scholar statistics, ResearchGate profile Overview Talks with slides About Biography Services TPC Member: ISLPED 2016-2017, DAC 2016-2017, CPSCom 2017, ICCE-Berlin General Chair, ISLPED 2013, (International Symposium on Low-Power Electronics and Design), Beijing, China; and TPC Co-Chair, ISLPED 2012:Redondo Beach, July 30-August 1, 2012. Associate Editor, IEEE Embedded Systems Letters (2008-2010), Springer DAEM (2005-) Associate Chair for Computer Engineering, UCI (2009,2010,2011)ABET accreditation, Curriculum reform, Prelim scheduling, … Faculty Advisor for IEEE Student Chapter, UCI (2010, 2011) Awards 2015: Low Power Design Contest, International Symposium on Low Power Electronics and Design (ISLPED) 2013: Low Power Design Contest, International Symposium on Low Power Electronic and Design (ISLPED): “Energy harvesting from anti-corrosion sources” 2011: Embedded System Design Contest, Taiwan: Tier 2 (Top-3): flying gateway), Tier 3 (Top-7) augmented reality in home automation system –> 2010: First Place, IT-application; Tier 3 (top 10), MOD-application, Chunghwa Telecomm Design Contest 2009: Embedded System Design Contest, Taiwan: Tier 2 (top 5) Ultra Mouse, Tier 3 (top 10), Remote Terminator, and Tier 4 (top 15) WSN development kit 2007: DAC/ISSCC Design Contest Award: “HBS: a handheld breast cancer detector based on FDPM” 2006: Best Demo Award, IEEE SECON 2006: Low-Power Design Contest, ISLPED, “AmbiMax: Efficient, Autonomous Energy Harvesting System for Multiple-Supply Wireless Sensor Nodes” 2005: NSF CAREER Award, “Design Optimization and Quantitative Evaluation of Wireless Embedded Sensing Systems” 2005: Chancellor’s Award for Excellence in Undergraduate Research, UC Irvine 2005: Low-Power Design Contest, ISLPED, “Everlast: Long-life, supercapacitor-operated Wireless Sensor Node,” 2004: Recognition of Service Award, ACM 2004, Low-Power Design Contest, ISLPED, “Eco: an Ultra-Compact Low-Power Wireless Sensor Node for Real-time Motion Monitoring” 2004, Low-Power Design Contest, ISLPED, “DuraNode: Wireless Sensor Node for Structural Health Monitoring” 2003, Low-Power Design Contest, ISLPED, “B#: A Battery Emulator and Power Profiling Instrument” 2002: SIGDA Technical Leadership Award, 39th DAC 2002: Best Paper Award, Asia South-Pacific Design Automation Conference",
  "content_length": 3443,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:37"
}