{
  "name": "Palash Sarkar 0001",
  "homepage": "https://www.isical.ac.in/~palash",
  "status": "success",
  "content": "Home Page of Palash Sarkar PALASH SARKAR Professor Applied Statistics Unit Indian Statistical Institute 203, B.T. Road, Kolkata 700108, INDIA. e-mail: palash AT isical DOT ac DOT in My main expertise is in cryptology. I am one of the early researchers in India to have started active research in cryptology within the country. At the national level, I have pioneered research in several important areas of cryptology. For some important cryptographic functionalities, solutions developed by me and my collaborators are the state-of-the-art. Apart from cryptology, I work on a variety of other topics including mathematical aspects of economics, Boolean functions and discrete mathematics. Click for an overview of selected research works. Click for a list of publications categorised by area. Click for books and monographs. Click for former PhD students and post-docs. Curriculum Vitae (including list of publications); dblp; google scholar. Talks and notes. A course on research methodology Academic Degrees Doctor of Philosophy from the Indian Statistical Institute in 1999. Master of Technology in Computer Science from the Indian Statistical Institute in 1993. Bachelor of Electronics and Telecommunication Engineering from Jadavpur University, 1991. Professional Experience July 2011 onwards: Professor (HAG) at the Indian Statistical Institute, Kolkata. June 2005  June 2011: Professor at the Indian Statistical Institute, Kolkata. October 2001  May 2005: Associate professor at the Indian Statistical Institute, Kolkata. September 2000  September 2001: Postdoctoral fellow at the Centre for Applied Cryptographic Research (CACR), University of Waterloo. May 1994  August 2000: Computer programmer at the Indian Statistical Institute, Kolkata. August 1993  April 1994: Associate Information Technology Engineer at CMC Ltd. (a software company), Kolkata. Academic Recognition Shanti Swarup Bhatnagar prize  for Mathematical Sciences for the year 2011. B. M. Birla science prize for Mathematics for the year 2005. Professional Recognition Honorary Professor, School of Computing, University of Kent, UK, 02/11/2020 to 31/10/2023. A paper at Asiacrypt 2017 co-authored with Sabyasachi Karati was recommended by the program chairs for invitation to the Journal of Cryptology. Best paper award Mycrypt 2016 for a paper co-authored with Sanjit Chatterjee, Neal Koblitz and Alfred Menezes. Scientific committee member for the workshop on Elliptic Curve Cryptography in 2012 and 2013. Program co-chair for Asiacrypt 2013 and Asiacrypt 2014. Program co-chair for Indocrypt 2002. PC member of over 80 international cryptology conferences including 14 IACR conferences and workshops. Invited Talks at International Conferences Invited speaker at the Asian Symmetric Key Symposium, Kolkata, India, 2024 Invited speaker at the International Conference on Cryptology in India, Indocrypt, 2015. Keynote speaker at International Conference on Electrical Engineering, Computing Science and Automatic Control, CINVESTAV, Mexico City, Mexico, 2015. Invited speaker at the 18th workshop on Elliptic Curve Cryptography, Chennai, 2014. Invited speaker at the Workshop on Directions in Authenticated Ciphers, Stockholm, 2012. Invited speaker at the Asian Symmetric Key Symposium, Singapore, 2011. Invited speaker at the International Conference on Security Aspects in Information Technology, High-Performance Computing and Networking, Haldia, India, 2011. Invited speaker at the International Conference on Cryptology in India, Indocrypt, 2008. Invited speaker at the International Conference on Information Security and Cryptology held at Busan, Korea in 2006. Tutorial speaker at the International Conference on Cryptology in India, Indocrypt, 2006.",
  "content_length": 3740,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:36"
}