{
  "name": "Pallab Dasgupta",
  "homepage": "http://cse.iitkgp.ac.in/~pallab",
  "status": "success",
  "content": "Pallab Dasgupta, Professor, CSE, IIT Kharagpur Dr. Pallab Dasgupta Professor, Department of Computer Science and Engineering, Indian Institute of Technology Kharagpur Since May 22, 2023, Prof. Dasgupta is with Synopsys Inc. at Sunnyvale, USA as Head of Research and Innovation (Formal Verification) Phone: +91-3222-283470 (Off) +91-3222-283471 (Res) Email: pallab[a]cse[dot]iitkgp[dot]ac[dot]in Home: http://cse.iitkgp.ac.in/~pallab Current CV Areas of Expertise Formal Methods, Trusted AI, Electronic Design Automation Appointments: Academic Appointments 2013- 2007- 2013 2002- 2007 1998- 2002 1995- 1998 Professor in Higher Administrative Grade, IIT Kharagpur Professor, Dept. of Computer Science and Engineering, IIT Kharagpur Associate Professor, Dept. of Computer Science and Engg, IIT Kharagpur Assistant Professor, Dept. of Computer Science & Engg, IIT Kharagpur Visiting Lecturer, I.I.T. Kharagpur Administrative Appointments 2016- 2019 2014- 2016 2009- 2007- 2010 2019- 2023 (April) Dean, Sponsored Research and Industrial Consultancy, IIT Kharagpur Associate Dean, Sponsored Research and Industrial Consultancy Director, Synopsys CAD Labs, IIT Kharagpur Chairman, Advanced VLSI Consortium, IIT Kharagpur Professor-in-Charge, Academy of Classical and Folk Arts, IIT Kharagpur Awards and Recognition: National Awards Fellow of the Indian Academy of Science Fellow of the Indian National Academy of Engineering Young Scientist Medal of Indian National Science Academy (1999) Young Engineer Medal of Indian National Academy of Engineering (2002) Young Associate of the Indian Academy of Sciences (1998 – 2002) Fellow of the Institution of Electronics and Telecom Engineers, India Jagadis Bose National Science Talent Search Scholarship (1986 – 1990) Industry Awards IESA Techno-mentor Award (2012) conferred by the Indian Electronics and Semiconductor Association Qualcomm Faculty Award (2021) IBM Faculty Award (2007) Institute Awards Institute Silver Medal (1st rank in Btech), Computer Sc & Engg, IIT Kharagpur (1990) Institute Silver Medal (1st rank in MTech), Computer Sc & Engg, IIT Kharagpur (1992) A K Singh Distinguished Chair Professor in Artificial Intelligence, IIT Kharagpur (2018-20) Education: 1995 Ph.D. Computer Science & Engineering, Indian Institute of Technology Kharagpur. 1992 M.Tech Computer Science & Engineering, Indian Institute of Technology Kharagpur.    (ranked first in the department with GPA of 9.6 / 10.0) 1990 B.Tech Computer Science & Engineering, Indian Institute of Technology Kharagpur.    (ranked first in the department with GPA of 9.98 / 10.0) Research profile: ~230 research publications (92 Jour,137 Conf), 20+ PhD guidance, 2 US patents Publications grouped by areas can be found  here, whereas publications grouped by year can be accessed from  here Industry sponsored research (spanning 25 years) – Intel, Synopsys, SRC, National Semiconductors, Freescale Semiconductors, Texas      Instruments, General Motors, IBM, Qualcomm, Google, Indian Railways, Hindustan Aeronautics Ltd. Areas of Research Contributions: Formal Methods – Assertion languages and formalisms, Model checking, Consistency and Coverage, Cohesive formal + simulation-based verification, Counter-example ranking, Formal bug taxonomies Formal and Semi-formal Verification of Integrated Circuits – Formal verification of power management logic, SAT based power / timing analysis, Property grouping, Assertion refinement, Assertion-guided simulation, Assertion hierarchy for large integrated circuits, Assertion-guided fault simulation. Assertions for Analog / Mixed-Signal Designs – AMS assertion languages and tools, Lifting assertions to real valued Features, Precision and sampling issues for assertion checking over AMS simulation, Verification of power management with analog power domains, Machine learning for enhanced AMS fault coverage. Formal Methods in Automated Control and Embedded Systems – Control loop execution patterns with provable guarantees, SAT/SMT based verification of automated control, Energy optimization in automated control, Formal verification of railway signaling / interlocking logic, Formal verification of avionic RTOS, Formal verification of access control policies in networks. Trusted Artificial Intelligence – Program-driven RL agents in autonomous driving, Learning adaptive safety shields for safe RL, Semi-lexical languages for combining reasoning with machine learning, Mining causal relations from time series, Integrating rule-based knowledge into deep learning systems, Safety augmentation in Decision Trees, Bayesian optimization for identifying safety corners, Adversarial AI planning for finding gaps in specifications. Classical Artificial Intelligence – Multi-objective heuristic search, Multi-objective AND/OR Graph search, AI planning as a verification tool, Partial Order Search in Game Trees, Integrating deduction with constraint optimization, Agent searching. ClassicalOther Areas – Computational musicology (pitch extraction from music, representing the deep structure of Indian ragas as semi-lexical languages), Distributing computing (agreement protocols, managing timing in federated automotive platforms). Teaching Summary: Recent Subjects – Programming and Data Structures Theory, Artificial Intelligence (200+ students), Formal systems, Foundations of Computing Science, Advanced Graph Theory, Distributed Systems, Testing and Verification of Integrated Circuits Past Subjects – Database Management Systems, Algorithms, Operations Research, Programming and Data Structures, Computational Foundations of Cyber-Physical Systems, Popular lectures series in YouTube (viewed worldwide): Artificial Intelligence: – YouTube LinkThis series is the first AI course on NPTEL (National Program on Technology Enhanced Learning), India’s national portal on technical education. This series has more than 200,000 views worldwide. An updated version of several lectures, recorded in 2020 is available here:YouTube Link Distributed Computing: – This series has more than 90,000 views worldwide.YouTube Link Verification: – This series has been used in several companies for training.YouTube Link Professional And Leadership Services: Associate Editor, IEEE Trans. on Computer Aided Design of Int. Circuits and Systems (2015-2018). Vice Chair (India) of IEEE Council on Electronic Design Automation (2016-2018). Council Member of Indian Association for Research in Computer Science (2013-2014). Founder of Synopsys CAD Lab, IIT Kharagpur with Dr Pradip Dutta, President, Synopsys India (2009). Chairman, Advanced VLSI Consortium (consortium of 15 semiconductor and EDA companies) 2007-2010. This was the largest research consortium of semiconductor companies in the country at a time when the VLSI industry in India was growing in research. Founder of the Indo-German Center for Intelligent Transportation System in collaboration with Technical University of Munich, Germany. Founder and PI of FMSAFE: Center for Formal Methods in Safety Critical Systems in partnership with two other IITs. This center has been created under the IMPRINT program of India. Founder of the Academy of Classical and Folk Arts, IIT Kharagpur (2020 - ) Co-Founder and Co-PI of Center for Artificial Intelligence for Societal Needs, IIT Kharagpur. Co-Founder and Co-Principal Investigator of Science and Heritage Initiative (SandHI), IIT Kharagpur. Co-Founder and Co-Principal Investigator of General Motors Collaborative Research Lab, IIT Kharagpur. Professor-in-charge of SPIC MACAY, IIT Kharagpur Chapter (2000 – 2016). Co-Founder of Advanced Manufacturing Consortium, IIT Kharagpur (conceived the consortium model as the Dean, Sponsored Research and Industrial Consultancy, IIT Kharagpur). Forays In Music And Culture: I play an Indian Classical stringed instrument called the sitar (shown in the picture). I am currently collaborating with Padma Bhushan Pt Ajoy Chakraborty, legendary classical vocalist and scholar, on studying the deep structure of Indian Ragas and their representation as semi-lexical languages – a study which is expected to highlight the creative liberty in Indian Classical Music from a cognitive perspective. I am also using the raga system to understand the cohesion between imitation based learning and grammar (rule) based learning, and translating that to combinations of rule-based reasoning and machine learning.",
  "content_length": 8388,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:37"
}