{
  "name": "Pan Hu 0001",
  "homepage": "https://ist.sjtu.edu.cn/membershup",
  "status": "success",
  "content": "胡畔 - 工业软件技术实验室 工业软件技术实验室 上海交通大学软件学院工业软件技术实验室（IST）建立于 2004 年，研究方向集中在企业工业软件技术及应用方面。 通过 SOA，信息集成，语义本体，网络计算机图形学等技术及理论的导入及应用，构造可配置、柔性、灵活的电子商务、电子政务、ERP 软件、MES 软件，满足政府、企业、公众的信息化应用需求。 介绍 新闻 实验组 成员 论文 项目 胡畔 个人履历 胡畔，副教授，博士生导师 于2012年获上海交通大学学士学位，2015年获上海交通大学硕士学位，期间于2011.7-2013.9在法国高等矿业大学圣埃蒂安分校攻读工程师学位，2013.3-2013.9在比利时荷兰语鲁汶大学机器学习研究组交流访问。2020年获英国牛津大学博士学位，2019.10-2021.9受英国工程和自然科学研究委员会资助在牛津大学从事博士后研究。2021年11月返回上海交通大学任助理教授，2024年12月晋升副教授。主攻知识表示与处理。 项目经历： 国家自然科学基金青年基金项目：基于Datalog的混合式模块化知识推理框架研究，2023.1 – 2025.12，主持 英国工程与自然科学研究理事会项目，OASIS: Ontology Reasoning over Frequently-changing and Streaming Data，2019.10 – 2022.9，具名研究员 获奖情况: 2011-2013年法国政府外交部埃菲尔精英学生奖学金（学费+生活费资助） 2015-2019年教育部国家留学基金委国家公派奖学金（学费+生活费资助） 联系方式 邮箱：pan.hu@sjtu.edu.cn 论文成果 [AAAI] Goal Driven Reasoning in DatalogMTL with Magic Sets Shaoyu Wang, Kaiyue Zhao, Dongliang Wei, Przemysław Andrzej Wałęga, Dingmin Wang, Hongming Cai, Pan Hu In Proceedings of the AAAI Conference on Artificial Intelligence, 2025 [TODS] Accurate Sampling-Based Cardinality Estimation for Complex Graph Queries Pan Hu, Boris Motik ACM Transactions on Database Systems, Volume 49, Issue 3, Article 12, pp. 1 - 46, 2024 [AIJ] Modular Materialisation of Datalog Programs Pan Hu, Boris Motik, Ian Horrocks. Artificial Intelligence 308 (2022): 103726. [AAAI] MeTeoR: Practical Reasoning in Datalog with Metric Temporal Operators Dingmin Wang, Pan Hu, Przemysław Andrzej Wałęga, Bernardo Cuenca Grau In Proceedings of the AAAI Conference on Artificial Intelligence, vol. 36, no. 5, pp. 5906-5913. 2022. [MLJ] Owl2vec*: Embedding of owl ontologies Jiaoyan Chen, Pan Hu, Ernesto Jimenez-Ruiz, Ole Magnus Holter, Denvar Antonyrajah, Ian Horrocks Machine Learning 110, no. 7 (2021): 1813-1845. [CIKM] Datalog Reasoning over Compressed RDF Knowledge Bases Pan Hu, Jacopo Urbani, Boris Motik, Ian Horrocks In Proceedings of the 28th ACM International Conference on Information and Knowledge Management, pp. 2065-2068. 2019. [AAAI] Modular Materialisation of Datalog Programs Pan Hu, Boris Motik, Ian Horrocks In Proceedings of the AAAI Conference on Artificial Intelligence, vol. 33, no. 1, pp. 2859-2866. 2019. [AAAI] Optimised Maintenance of Datalog Materialisations Pan Hu, Boris Motik, Ian Horrocks In Proceedings of the AAAI Conference on Artificial Intelligence, vol. 32, no. 1, pp. 1871-1879. 2018. [TAES] Enhancing Context-aware Reactive Planning for Unexpected Situations of On-orbit Spacecraft Bingqing Shen, Li Da Xu, Hongming Cai, Han Yu, Pan Hu, Lihong Jiang, Jingzhi Guo IEEE Transactions on Aerospace and Electronic Systems (2022). [MMM] SLOREV: Using Classical CAD Techniques for 3D Object Extraction from Single Photo Pan Hu, Hongming Cai, Fenglin Bu In International Conference on Multimedia Modeling, pp. 491-501. Springer, Cham, 2015. 2022-05-02 Comments",
  "content_length": 2788,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:36"
}