{
  "name": "Pan He",
  "homepage": "https://panhe.org",
  "status": "success",
  "content": "Pan He Pan He Assistant Professor, Auburn University Dept. of Comp. Sci. and Soft. Eng. Samuel Ginn College of Engineering Contact Information: 3101T Shelby Center 357-359 W Magnolia Ave Auburn, AL 36832 Phone: +1 (334) 844-6389 Email: pan.he@auburn.edu I am an Assistant Professor in the Department of Computer Science and Software Engineering, Auburn University. I received my Ph.D. in Computer Science from the Department of Computer & Information Science & Engineering, University of Florida. I earned my B.E. degree in June 2015 from the Department of Software Engineering, Sichuan University. From 2014 to 2016, I worked as a Research Assistant at the Multimedia Lab, Department of Information Engineering, Chinese University of Hong Kong (MMLab, CUHK), and the Multimedia Research Center, Shenzhen Institute of Advanced Technology (MMLab, SIAT). I was fortunate to work with Dr. Weilin Huang and Prof. Chen Change Loy, under the support of Prof. Yu Qiao and Prof. Xiaoou Tang. I am interested in developing essential AI techniques and seamlessly integrating them for creating or empowering real-time downstream applications in next-generation infrastructure systems. Openings: I am currently searching for highly talented students (PhDs, Masters, and Undergraduates) to work or remotely work with me. More details click. Links: Resume | Google Scholar | GitHub | LinkedIn | Twitter | Facebook | ResearchGate | Semantic Scholar Latest News 10/2025:I am honored to serve as an Area Chair for the 2026 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR 2026). I look forward to contributing to the computer vision community. 07/2025:We gratefully acknowledge the generous cloud credits provided by the Lambda Research Grant Program. Thank you to the Lambda team! 05/2025:I received the 2025 ORAU Ralph E. Powe Junior Faculty Enhancement Award from Oak Ridge Associated Universities. Thank you, ORAU and the lovely reviewers! 01/2025:We are organizing the workshop Foundational AI for Pervasive Computing (FairPC) at PAKDD. We warmly invite you to submit your work 12/2024:Congratuations to Owen Strength. He has been selected as an honorable mention for the 2024-2025 CRA Outstanding Undergraduate Researcher Award 12/2024:Our paper \"VERA: Explainable Video Anomaly Detection via Verbalized Learning of Vision-Language Models\" is available at Project 04/2024:Our paper \"An Efficient Semi-Automated Scheme for Infrastructure LiDAR Annotation\" has been accepted in T-ITS 04/2024:Our paper \"BadFusion: 2D-Oriented Backdoor Attacks against 3D Object Detection\" has been accepted in IJCAI 03/2024:Our paper \"A Holistic Framework Towards Vision-based Traffic Signal Control with Microscopic Simulation\" is publicly available arxiv 02/2024:Congratuations to Isaiah Gallardo for being selected as 2024 Wolotsz Graduate Student Fellow. 12/2023:Invited to serve as Associate Editor in IEEE Transactions on Neural Networks and Learning Systems (TNNLS). 12/2023:Congratuations to Isaiah Gallardo. His research proposal to the AAAI-24 Undergraduate Consortium has been accepted (with awarded travel funding) 11/2023:My PhD dissertation is publicly available dissertation 11/2023:Our paper \"BadFusion: 2D-Oriented Backdoor Attacks against 3D Object Detection\" has been accepted in Backdoors in Deep Learning @ NeurIPS 2023 10/2023:Our paper \"Towards Improving the Generation Quality of Autoregressive Slot VAEs\" has been accepted in Neural Computation 08/2023:Our paper \"Learning Canonical Embeddings for Unsupervised Shape Correspondence with Locally Linear Transformations\" has been accepted in TPAMI 08/2023:Joined Auburn University as a tenure-track assistant professor. War Eagle! 07/2023:Our paper \"A Spatiotemporal Correspondence Approach to Unsupervised LiDAR Segmentation with Traffic Applications\" has been accepted in ITSC 07/2023:Finished my PhD defense. Dissertation Title \"Deep Learning on Spatiotemporal Point Cloud Modeling for Motion and Correspondence\" 03/2023:Our paper \"An Efficient Semi-Automated Scheme for LiDAR Annotation and A Benchmark Infrastructure Dataset\" has been accepted in ICLR ML4IoT 04/2022:Our paper \"Automated Truck Taxonomy Classification Using Deep Convolutional Neural Networks\" has been accepted in IJTSR 04/2022:Received the CVPR'22 Doctoral Consortium Award 03/2022:Our paper \"Machine Learning based Real-time Multi-Camera Vehicle Tracking and Travel Time Estimation\" has been accepted in J. Imaging 02/2022:Our paper \"Machine Learning-based Highway Truck Commodity Classification Using Logo Data\" has been accepted in Appl. Sci. 12/2021:Our paper \"Self-Supervised Robust Scene Flow Estimation via the Alignment of Probability Density Functions\" has been accepted in AAAI 11/2021:Our paper \"Learning Scene Dynamics from Point Cloud Sequences\" has been accepted in IJCV 10/2021:Received the ICCV'21 Doctoral Consortium Award 10/2021:Our paper \"Learning Fast and Slow: PROPEDEUTICA for Real-time Malware Detection\" has been accepted in TNNLS 10/2021:Our paper \"Ego-Deliver: A Large-Scale Dataset for Egocentric Video Analysis\" has been accepted in ACM-MM 05/2021:Our paper \"Efficient Iterative Amortized Inference for Learning Symmetric and Disentangled Multi-Object Representations\" has been accepted in ICML 12/2020:Our paper \"SparsePipe: Parallel Deep Learning for 3D Point Clouds\" has been accepted in HiPC Experience Research Intern:Megvii Research US. May. 2017 - Aug. 2017 Research Assistant:MaltLab, University of Florida. Aug. 2017 - Present NSF Center for Big Learning, University of Florida. Aug. 2016 - Jul. 2017 MMLab, The Chinese University of Hong Kong. Oct. 2015 - Jul. 2016 Multimedia Lab, SIAT, Chinese Academy of Sciences. Sept. 2014 - Jul. 2016 Summer Intern:National University of Singapore, Jul. 2014 - Sept. 2014 Project Developer:Facebook Open Academy, Sept. 2013 - May. 2014 Selected Awards International Award:Doctoral Consortium @ CVPR, 2022. Mentor: Prof. Fernando De la Torre Doctoral Consortium @ ICCV, 2021. Mentor: Prof. James Hays UFL Award:UF International Center Outstanding Achievement Awards, 2021 Gartner Group Graduate Fellowship, 2022 Gartner Group Graduate Fellowship, 2021 Gartner Group Graduate Fellowship, 2020 SIAT-CAS Award:Dean’s Award for Innovation and Creativity, 2016 SCU Award:Outstanding Graduate Award, 2015 Best Bachelor Thesis Award, 2015 (only 2 recipients in SE department) Patents METHODS AND APPARATUS FOR RECOGNIZING TEXT IN AN IMAGE [pdf][pdf2] International Patent WO2016/197381Al with Xiaoou Tang, Yu Qiao, Chen Change Loy and Weilin Huang APPARATUS AND METHOD FOR DETECTING SCENE TEXT [pdf] US Patent US10679085 with Xiaolin Li TEXT DETECTION METHOD AND DEVICE FOR SCENE IMAGE [pdf] Chinese Patent: 201610878795.5. with Yu Qiao, Tong He, Weilin Huang and Zhi Tian",
  "content_length": 6778,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:37"
}