{
  "name": "Pan Zhou 0002",
  "homepage": "https://panzhous.github.io",
  "status": "success",
  "content": "Pan ZHOU I am a tenure-track Assistant Professor, Lee Kong Chian Fellow, and the director of Language & Vision Lab (LV-Lab) at the School of Computing and Information Systems, Singapore Management University (SMU). Prior to this position, I held roles as a Senior Research Scientist at Sea AI Lab and as a Research Scientist at Salesforce. I completed my Ph.D. degree at the National University of Singapore (NUS), fortunately advised by Prof. Jiashi Feng and Prof. Shuicheng Yan. Before studying in NUS, I graduated from Peking University (PKU) where I had the honor to work with Prof. Zhouchen Lin and Prof. Chao Zhang. I also collaborated closely with Prof. Xiaotong Yuan. I also spent several wonderful months at Georgia Tech in 2018 and Princeton University in 2019 as a visiting student. panzhou3@gmail.com Google Scholar Research Interests My target is to build “efficient and effective artificial intelligent systems” so that machines can cognize, understand and interact with the environment. Currently, I mainly focus on three research topics across machine learning, computer vision and optimization. See more details here. Learning framework: how to learn knowledge from (unlabeled) data effectively and efficiently? E.g. self-supervised (multi-modal) learning and generative models like diffusion models for image/3D/video. Network architecture design: how to design more advanced neural network architectures? Parameter optimizer: how to design training algorithms like Adam to efficiently train AI models? Open Positions I am seeking for full- and part-time Ph.D. applicants with strong background in computer science and mathematics, fully-supported by SMU/AISG. I am recruiting visiting Ph.D. and Masters for AIGC direction like 3D generation topic, multimodal learning and LLM, and optimization. I am looking for self-fund or CSC-fund visiting scholars, Ph.D., and Masters with interests in my research topics or related ones. I am welcoming remote interns/scholars and collaborations without strong restrictions on topics. Please check details of open positions, and feel free to contact me via email.",
  "content_length": 2120,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:37"
}