{
  "name": "Pan Hui 0001",
  "homepage": "https://www.cs.helsinki.fi/u/panhui",
  "status": "success",
  "content": "Professor Pan Hui - University of Helsinki Prof. Pan Hui (FREng - IEEE Fellow - ACM Distinguished Scientist - Member of Academia Europaea) I am the Nokia Chair in Data Science (with a generous endowment from Nokia) at the University of Helsinki. I am also an International Fellow of the Royal Academy of Engineering (FREng) , a Member of the Academia Europaea (MAE), a Fellow of the Institute of Electrical and Electronics Engineers (FIEEE) , and a Distinguished Scientist of the Association for Computing Machinery (ACM). I was a Senior Research Scientist and then a Distinguished Scientist with Deutsche Telekom Innovation Laboratories, Berlin Germany. Currently (Sept. 2020 -- Aug. 2021), I only serve as Supervisor for the Doctoral Programme in Computer Science at the University of Helsinki (no teaching duty, no admin duty, nor any other regular duties). University of Helsinki and Hong Kong University of Science and Technology (HKUST) have established a dual PhD programme so a qualified candidate can receive PhD degrees from both HKUST and University of Helsinki with the same thesis. I highly encourage motivated University of Helsinki students and other potential PhD candidate to explore this great opportunity with HKUST where I also serve as the director of the HKUST-DT Systems and Media Laboratory (SyMLab). Over the years, I have conducted research at University of Helsinki, HKUST, Aalto University, Deutsche Telekom Laboratories, University of Cambridge, Thomson Research Paris, Intel Research Cambridge, and University of Hong Kong. I have enjoyed working at the intersection of multiple disciplines and with a rich collection of collaborators, both individuals and institutions. My publications have covered a wide spectrum of topics including data science, mobile computing, networking, social networks, and augmented reality. A common theme underlying all of them is \"Data Science for Sociotechnical Systems\". Sociotechnical refers to the interrelatedness of social and technical aspects of an organization. In Computer Science, Ubiquitous Computing is a good example of such systems. Ubiquitous computing is an interdisciplinary area in touches on distributed computing, mobile computing, location computing, mobile networking, sensor net- works, human-computer interaction, context-aware smart home technologies, and artificial intelligence. In my research, Data Science is a major methodology and most of my contributions are at the scientific core of Ubiquitous Computing, which further categorizes my research into two major topics: Data-driven Systems Design and Immersive Human-Data Interaction, covering three objectives: 1.) Using empirical big data to model human behaviors and gain deep insights into social and sociotechnical systems, and then further design better software systems with the evidences; 2.) Building energy efficient, high performance, and scalable software for mobile, wearable devices, and cloud systems with a data-driven approach; 3.) Developing Mobile Augmented Reality algorithms and systems for immersive data visualization and human-data interaction. I am an Associate Editor for IEEE Transactions on Mobile Computing (since 2014) and the Springer journal of Computational Social Networks. I have also served as Associate Editor for IEEE Transactions on Cloud Computing (2014 - 2018) and guest editor for various journals including IEEE Journal on Selected Areas in Communications (JSAC), IEEE Transactions on Secure and Dependable Computing, IEEE Communications Magazine, and ACM Transactions on Multimedia Computing, Communications, and Applications. I have also served as track chair, area chair, senior program committee member, organising committee member, and program committee member of many top conferences including ACM WWW, ACM SIGCOMM, ACM MobiSys, ACM MobiCom, ACM CoNext, IEEE Infocom, IEEE ICNP, IEEE ICDCS, IJCAI, AAAI, and ICWSM. I also served on the 2018 IEEE Computer Society Fellows Evaluation Committee. The H2O initiative (Hong Kong - Helsinki Oasis for Innovation and Technology) : to establish an AI research centre in Hong Kong. (Media 1, Media 2 (English), Media 3 I am looking for top and motivated candidates for PhD and Postdocs to work on Augmented-Reality (AR), Mobile Computing, Social Networks or some other interesting Machine Learning/data mining applications. I am also interested in hiring excellent interns to work on some researches of mutual interest together. Interested and qualified candidates may send me their CV and Statement of Purpose (SOP) by email (pan.huiAThelsinki.fi/panhuiATust.hk). Attention: My name in Chinese Characters is . This webpage will not be updated often this year. Please follow my HKUST homepage for more recent updates.",
  "content_length": 4748,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:37"
}