{
  "name": "Pan Li 0005",
  "homepage": "https://sites.google.com/view/panli-purdue/home",
  "status": "success",
  "content": "Pan Li's webpageSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome to my site!Pan Li     (李 攀 in Chinese)Email:  panli at gatech.edu panli at purdue.eduGoogle Scholar I keep looking for passionate Ph.D. students and I plan to hire 1-2 Ph.D. students every year. And currently, the team has one postdoc opening.  Note that at Georgia Tech., it is common to have two advisors co-advise you. If you plan to apply for a Ph.D. position and select me as the unique advisor, you may apply through the machine learning program, and the ECE program, and select ECE as your home unit.  The home unit at Georgia Tech. is not much related to the program/the degree but related to where the advisor is. You may also join other programs such as the CS program or the ISYE program and still would like to work with me.  In these cases, I may work as a co-advisor of you and feel free to reach out to me and let me know who you also plan to work with in those programs. I am happy to help with the coordination. For prospective students/postdocs, please read this page carefully.Our team also provides some short-term research opportunities (approximately half a year to a year) for undergraduates and master's students, mainly focusing on applying graph machine learning methods to specific scientific problems in the fields of particle physics, material science, and astronomy. Excellent students can receive remuneration! We also have a one-year program for funded post-bachelor students (only for US citizens and permanent residency due to the funding restriction) in the area of graph computation and machine learning.My dear wife, Dr. Cong Hao, is also at the school of ECE at Georgia Tech. She is looking for excellent students who would like to work in the joint area of hardware design and machine learning. SHORT BIO (To introduce Pan before the talk, one may use this short bio for convenience.) Pan Li joined ECE at Georgia Tech as an assistant professor in 2023 Spring and an on-leave position at Purdue CS.  Pan Li joined the Purdue CS department as an assistant professor in 2020 Fall.  Before joining Purdue, Pan worked as a postdoc in the SNAP group at Stanford for one year, where he worked in the SNAP group led by  Prof. Jure Leskovec.  Before joining the SNAP group, Pan did his Ph.D. in Electrical and Computer Engineering at the University of Illinois Urbana - Champaign (2015 - 2019). His PhD advisor at UIUC was Prof. Olgica Milenkovic. At UIUC, he also worked with several wonderful collaborators including Prof. Niao He, Prof. Arya Mazumdar, Prof. Jiawei Han, Prof. David Gleich, etc. Pan Li has received the NSF CAREER award (2023), the Best Paper award from Learning on Graph (LoG) 2022, Amazon Research Award (2023), Sony Faculty Innovation Award (2021), JPMorgan Faculty Award (2021 & 2023), Ross-Lynn Faculty Award (2021). Pan Li has served as a Senior reviewer (Area Chair) in conferences on machine learning and data science such as ICLR, ICML, NeurIPS, WWW, WSDM, and AAAI.News2025/11 Keynote Talk at ICDM on Graph Augmented Language Models: Beyond the Sequence - Challenges and Opportunities in Integrating Graphs and LLMs.2025/10 Invited Talk at INFORMS on Hypergraph Pagerank Diffusion.2025/09 Big congratulations to Peihao on winning this year’s Google Fellowship and the Data Science Rising Star honor—well deserved! Excited to continue our collaboration with Peihao and Atlas.2025/09 Four papers in NeurIPS'25, big congrats to Haoyu, Shikun, Rongzhe, Peihao, Mufei, and all the great collaborators!Do LLMs Really Forget? Evaluating Unlearning with Knowledge Correlation and Confidence Awareness (code)Graph-KV: Breaking Sequence via Injecting Structural Biases into Large Language Models (code)RoFt-Mol: Benchmarking Robust Fine-Tuning with Molecular Graph Foundation Models (code) (spotlight)Differentially Private Relational Learning with Entity-level Privacy Guarantees (code)2025/07 One paper in COLM'25: Privately Learning from Graphs with Applications in Fine-tuning Large Language Models (code)2025/05 Congrats to Haoteng on graduating! Wishing you a bright future! 2025/05 Three papers in ICML'25, big congrats to Haoyu, Shikun, Rongzhe, Jiajun, Peihao, Mufei, and all the great collaborators!Generalization Principles for Inference over Text-Attributed Graphs with Large Language Models (code)Rethinking Addressing in Language Models via Contextualized Equivariant Positional Encoding (code)Underestimated Privacy Risks for Minority Populations in Large Language Model Unlearning (code)2025/03 Received the ECE Outstanding Junior Faculty Award! 2025/03 Give a talk at Umich and MSU on \"Towards Efficient and Robust Graph and Geometric Machine Learning\". 2025/01 Five papers in ICLR'25, big congrats to Eli, Yinan, Haoyu, Peihao, Jiajun, Mufei, Siqi, Viraj, and all the great collaborators!What Are Good Positional Encodings for Directed Graphs? (codes)Convergent privacy loss of noisy-sgd without convexity and smoothnessSimple is effective: The roles of graphs and large language models in knowledge-graph-based retrieval-augmented generation (codes)Understanding and Mitigating Bottlenecks of State Space Models through the Lens of Recency and Over-smoothing (codes)LayerDAG: A Layerwise Autoregressive Diffusion Model for Directed Acyclic Graph Generation (codes) (Spotlight at ICLR 2025 and the SynthData Workshop)2025/01 The work on a comprehensive overview of labeling tricks, including multi-node labeling tricks and partial-order labeling tricks, has been accepted by JMLR! Huge thanks to my great collaborators Xiyuan and Muhan for their incredible effort!Improving Graph Neural Networks on Multi-node Tasks with Labeling Tricks2025/01 Really excited to get the NSF award on the research project Physics-informed GDL for Neutrino Reconstruction! (collaborated with Prof. Ignacio Taboada)2024/12 The paper on understanding confusing data patterns in explainable AI for geometric deep learning is accepted by Nature Machine Intelligence. The formal version is here. Big congrats to the team! 2024/11 Give a talk at Google Deepmind on Graph-based RAG. Thanks for the invitation and looking forward to the follow-up collaboration! The relevant paper is Simple is Effective: The Roles of Graphs and Large Language Models in Knowledge-Graph-Based Retrieval-Augmented Generation (code) 2024/10 Received 2024 JP Morgan faculty research award! Many thanks for JPMC and my close collaborators in JPMC, Vamsi Potluru, Mohsen Ghassemi, and Eleonora Kreacic. Look forward to continuing our collaboration!2024/10 Organized mini-symposiums at SIAM MDS 2024—Many thanks to all speakers and poster presenters for their contributions! New Frontier of Graph Machine LearningNew Frontier of Privacy in Machine Learning2024/10 Big congrats to Haoteng, who has won the RCAC Cyberinfrastructure Symposium Best Poster Award ($1k travel grant) for his recent studies on privacy-preserved graph learning and LLM: Privately Learning from Graphs with Applications in Fine-tuning Large Language Models (codes)2024/10 Give a talk at Purdue CS on Model Generalization & Computation for Graph/Geometric ML and Allerton 24 on Differentially Private Graph Diffusion.2024/9 Four papers in NeurIPS'24, big congrats to Eli, Rongzhe, Haoyu, Deyu, Shikun, Siqi, and all the great collaborators.Langevin Unlearning: A New Perspective of Noisy Gradient Descent for Machine Unlearning (Spotlight)Differentially Private Graph Diffusion with Applications in Personalized PageRanksCertified Machine Unlearning via Noisy Stochastic Gradient DescentGeSS: Benchmarking Geometric Deep Learning under Scientific Applications with Distribution Shift (Benchmark Track)2024/9 Three papers in TMLR, big congrats to Rongzhe, Haoyu, and Mufei, and all the great collaborators.Privacy-preserving structured data generation. Big congrats to Rongzhe! This work was also selected to be presented at ICLR 2025 (2024/11). GraphMaker: Can Diffusion Models Generate Large Attributed Graphs?  (codes) Big congrats to Mufei! DIG-MILP: a Deep Instance Generator for Mixed-Integer Linear Programming with Feasibility Guarantee  (codes). Big congrats to Haoyu! 2024/08 Really excited to get the NSF award on the research project \"Machine Learning on Graphs with Distribution Shifts\"!2024/07-08 Attend ICML and Travel in Asia: Give multiple talks on \"Towards Efficient and Robust Graph and Geometric Machine Learning\". Many thanks to the organizers!2024/07 Thank OpenAI for providing credits for our LLM research.2024/06 Our survey paper \"Exploring the Opportunities and Challenges of Graph Neural Networks in Electrical Engineering\" got accepted by Nature Reviews Electrical Engineering. Big congrats to Eli and Mufei, and the whole team!2024/06 Give a talk at SES AI  on Model Generalization and Foundation Models for Graphs.   2024/05 Three papers got accepted by ICML'24. Big congrats to the leading students Siqi, Shikun, Xiyuan, and other collaborators. Locality-Sensitive Hashing-Based Efficient Point Transformer with Applications in High-Energy Physics (codes, oral)Pairwise Alignment Improves Graph Domain Adaptation (codes, spotlight)Graph As Point Set (codes)2024/04 Invited talk at UIUC CS Colloquium on \"Challenges and Opportunities on Graph Machine Learning: A Study on Graph Data Distribution Shifts\", many thanks for my great collaborator Han Zhao's invitation! I miss UIUC so much.2024/04 Big congrats to Haoteng, who has won the Purdue Teaching Academy Graduate Teaching Award for his GTA effort in 2023! 2024/03 Our NSF award project \"Privacy-preserving Machine Learning on Graphs\" got funded! Many thanks for NSF! I feel excited to work with Prof. Olgica Milenkovic and Prof. Kamarlika Chaudhuri on this project. Also, many thanks to Eli for assisting the team with the proposal writing. 2024/02 Give an invited talk at the Applied and Computational Math Seminar at GT.2024/02 Invited to give a talk \"Machine Learning on Graphs --- Design System-friendly Algorithms\" at CRNCH Summi",
  "content_length": 13007,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:37"
}