{
  "name": "Panagiota Fatourou",
  "homepage": "http://users.ics.forth.gr/~faturu",
  "status": "success",
  "content": "Panagiota Fatourou - Home Page Panagiota Fatourou Professor, University of Crete Department of Computer Science P.O.Box 2208 Voutes Campus GR-70013 Heraklion Crete Island, GREECE Tel: +30 2810 393549 Fax: +30 2810 393591 E-mail: Room: K311 & Foundation for Research and Technology - Hellas (FORTH) Institute of Computer Science (ICS) N. Plastira 100 Vassilika Vouton, GR-70013 Heraklion Crete Island, Greece Tel: +30 2810 391727 Fax: +30 2810 391609 Room: Ã121 (Main FORTH Building) Slides and video from my invited talk at SPTDC 2023. Slides from my invited talk at MEDES 2023. Check out our new paper: Highly-Efficient Persistent FIFO Queues. I am in the PC of SPAA 2024, NETYS 2024 and SRDS 2024. The last few years, I have also served in the PCs of SRDS 2023, EuroPar 2023, FUN 2022, SRDS 2022, SRDS 2021, SPAA 2021, SPAA 2020, , PODC 2019. Check out our paper in PVLDB 2023: Odyssey: A Journey in the Land of Distributed Data Series Similarity Search.. Check out our paper in PPoPP 2023: Practically and Theoretically Efficient Garbage Collection for Multiversioning.. Slides from my invited talk at OPODIS 2022. Best paper award in PPoPP 2022 for our paper The Performance Power of Software Combining in Persistence, (pdf, archived version, code, video). Check out our article in CACM: Recommender systems under European AI regulations. My Marie-Curie PLATON project at Université Paris Cité, LIPADE, France. I have served as the Chair (and the Past Chair) of the ACM Europe Council and as the chair of the ACM Europe Research Visibility working group. I am the Chair of the Greek ACM-W Chapter. Panagiota Fatourou is a Professor at the Department of Computer Science of the University of Crete, Greece and the Institute of Computer Science (ICS) of the Foundation for Research and Technology - Hellas (FORTH). She has been (twice) a visiting Professor at the School of Computer and Communication Sciences, École Polytechnique Fédérale de Lausanne in Switzerland. Prior to joining the University of Crete and FORTH ICS, she was a full-time faculty member at the Department of Computer Science & Engineering of the University of Ioannina. She has worked as a postdoc at Max-Planck Institut für Informatik, Saarbrücken, Germany, and at the Computer Science Department of the University of Toronto, Canada. Her research interests focus on the principles of parallel and distributed computing. Panagiota Fatourou is currently serving as the Past Chair of the ACM Europe Council (and she is since July 2015, an elected member of the Council, currently serving her second term). She has served as the editor of the Distributed Computing Column of the Bulletin of the European Association for Theoretical Computer Science (BEATCS), and as the General Chair of the ACM Symposium on Principles of Distributed Computing (PODC 2013), the top conference in her field. She has been a member-at-large of the Steering Committees of the ACM Symposium on Principles of Distributed Computing (PODC) and the International Conference on Principles of Distributed Systems (OPODIS). She has served as the PC Chair  of the 20th International Conference on Principles of Distributed Systems (OPODIS 2016) (together with Fernando Pedone, University of Lugano, Switzerland), and of the 19th International Symposium on Stabilization, Safety, and Security of Distributed Systems (SSS17), track Distributed Computing and Communication Networks (together with Sergio Rajsbaum, UNAM, Mexico). She has participated in the PC of more than 40 conferences. She has been an ACM Distinguished Speaker and a Featured ACM Member. She has been awarded a Marie-Curie Individual Fellowship and an FSMP Distinguished Professor Fellowship from the Foundation Sciences Mathématiques de Paris. Panagiota Fatourou was the coordinator of TransForm - Theoretical Foundations of Transactional Memory, an EU-funded Marie Curie Initial Training Network (2008 - 2013), and the co-coordinator (together with Manolis Katevenis) of the GreenVM project (ARISTEIA Action of the Operational Programme \"Education and Lifelong Learning\"). She was the Greek representative of the COST Action Euro-TM:  Transactional Memories: Foundations, Algorithms, Tools, and Applications, and is the Greek representative and a member of the Management Committee of the COST Action EUGAIN: European Network For Gender Balance in Informatics. Her ELIDEK research proposal PERSIST: How to Compute with Persistent Memory? has been approved and the project is expected to start soon. She has participated in many additional research and development projects. Panagiota Fatourou is the founder and chair of Greek ACM-W Chapter and she has served as the chair of the Evaluation Panel of the Minerva Informatics Equality Award, 2018. She has co-organized and co-chaired the 1st and the 2nd Summits on Gender Equality in Computing (GEC 2019 and GEC 2020) and she has been the scientific director and chair of the organizing committee of the 1st Summer School on Women in Science, Technology, Engineering and Mathematics (WISTEM 2019). Selected Publications ■      Manos Chatzakis, Panagiota Fatourou, Eleftherios Kosmas, Themis Palpanas, and Botao Peng, ``Odyssey: A Journey in the Land of Distributed Data Series Similarity Search, Proceedings of the 49th International Conference on Very Large Databases Sydney, Vancouver, Canada, 2023 (pdf, archived version, supporting material, citation). ■      Yuanhao Wei, Guy E. Blelloch, Panagiota Fatourou, Eric Ruppert, ``Practically and Theoretically Efficient Garbage Collection for Multiversioning, Proceedings of the 27th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming, pp. 66-78, Montreal, Canada, February 2023 (pdf, archived version, slides, code, citation). ■     Tommaso Di Noia, Nava Tintarev, Panagiota Fatourou, Markus Schedl, Recommender systems under European AI regulations, Communications of the ACM 65(4): 69-73 (2022) (full text, pdf, citation). ■     Karima Echihabi, Panagiota Fatourou, Kostas Zoumpatianos, Themis Palpanas, Houda Benbrahim, Hercules Against Data Series Similarity Search, Proceedings of the VLDB Endow., 15(10): pp. 2005-2018, September 2022 (pdf, archived version, supporting material). ■    Carole Delporte-Gallet, Panagiota Fatourou, Hugues Fauconnier, Eric Ruppert, When is Recoverable Consensus Harder Than Consensus?, Proceedings of the 41st ACM Symposium on Principles of Distributed Computing (PODC22), pp. 198-208, July 2022 (pdf, archived version, slides, citation). ■    Panagiota Fatourou, Nikolaos D. Kallimanis, Eleftherios Kosmas, The Performance Power of Software Combining in Persistence, Proceedings of the 27th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming (PPoPP22), April 2022 (pdf, archived version, code, video, citation). ■    Hagit Attiya, Ohad Ben-Baruch, Panagiota Fatourou, Danny Hendler, Eleftherios Kosmas, Detectable Recovery of Lock-Free Data Structures, Proceedings of the 27th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming (PPoPP22), April 2022 (pdf, archived version, code, video, citation). ■    Yuanhao Wei, Naama Ben-David, Guy E. Blelloch, Panagiota Fatourou, Eric Ruppert, Yihan Sun, Space and Time Bounded Multiversion Garbage Collection, Proceedings of the 35th International Symposium on Distributed Computing (DISC), pp. 12:1-12:20, October 2021 (pdf, archived version, video, slides, citation). ■    Yuanhao Wei, Naama Ben-David, Guy E. Blelloch, Panagiota Fatourou, Eric Ruppert, Yihan Sun, Constant-time snapshots with applications to concurrent data structures, Proceedings of the 26th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming, pp. 31-46, Feb-Mar 2021 (pdf, archived version, video, slides, code, citation). ■     Panagiota Fatourou and Chris Hankin, Europe Region Special Section - Communications of the ACM, 62(4), ISSN:0001-0782, 2019, https://cacm.acm.org/magazines/2019/4/235591-welcome-to-the-europe-region-special-section/fulltext (video). ■  Botao Peng, Panagiota Fatourou, and Themis Palpanas, SING: Sequence Indexing Using GPUs, Proceedings of the 37th IEEE International Conference on Data Engineering (ICDE21), Chania, Crete, April 2021 (pdf, citation). ■    Botao Peng, Panagiota Fatourou, and Themis Palpanas, Fast Data Series Indexing for In-Memory Data, The VLDB Journal 30, 10411067 (2021) (archived version, supporting material). ■    Botao Peng, Panagiota Fatourou, and Themis Palpanas, MESSI: In-Memory Data Series Indexing, In Proceedings of the 36th IEEE International Conference on Data Engineering (ICDE20), pp. 337-348, Dallas, Texas, April 2020 (pdf, supporting material). ■    Botao Peng, Panagiota Fatourou, and Themis Palpanas, ParIS+: Data Series Indexing on Modern Hardware, IEEE Transactions on Knowledge and Data Engineering, Volume 33, Number 5, pp. 2151-2164, May 2021 (pdf, supporting material). ■    Victor Bushkov, Dmytro Dziuma, Panagiota Fatourou, Rachid Guerraoui, The PCL theorem: transactions cannot be parallel, consistent and live, Journal of the ACM, Volume 66, Issue 1, January 2019, Article No. 2 (citation). ■    P. Fatourou, F. Fich and E. Ruppert, ``Time Lower Bounds for Implementations of Multi-Writer Snapshots, Journal of the ACM, 54(6), Article 30, December 2007 (citation). ■    Panagiota Fatourou and Nikolaos Kallimanis, ``Lower and Upper Bounds for Single-Scanner Snapshot Implementations, Distributed Computing, Volume 30, Issue 4, pp 231260, August 2017 (pdf, citation). ■    Faith Ellen, Panagiota Fatourou, Eleftherios Kosmas, Alessia Milani, and Corentin Travers, ``Universal Constructions that Ensure Disjoint-Access Parallelism and Wait-Freedom, Distributed Computing, August 2016, Volume 29, Issue 4, pp 251277 (citation). ■    Panagiota Fatourou, Elias Papavasileiou, Eric Ruppert, Persistent Non-Blocking Binary Search Trees Supporting Wait-Free Range Queries, In Proc. of the 31st ACM SI",
  "content_length": 12788,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:39"
}