{
  "name": "Panagiotis Bouros",
  "homepage": "https://datamanagement.cs.uni-mainz.de/panagiotis-bouros",
  "status": "success",
  "content": "Jun.-Prof. Dr. Panagiotis Bouros | Data Management Skip to contentNavigationsstrukturAn Interactive Interface for Road Network GenerationAn Interface for Generating and Visualizing Geosocial NetworksSimulation-based Evacuation Planning for Urban AreasAn Interactive Tool for Evaluating Choices and Changes in Transportation NetworksJun.-Prof. Dr. Panagiotis BourosHead of the Data Management research group E-Mail: bouros@uni-mainz.de Room: 03-121 Phone: +49 (0) 6131 39 23603 Personal Homepage: https://pbour.github.io Research Interests My research interests are with in-memory data management and query processing with a special focus on complex data types including spatial, temporal, text and graph data. Bio 2018-now Assistant Professor Institute of Computer Science Johannes Gutenberg University Mainz, Germany 2015-2017 Post-doctoral researcher Department of Computer Science Aarhus University, Denmark Supervisor: Prof. Ira Assent 2013-2015 Post-doctoral researcher Department of Computer Science Humboldt-Universität zu Berlin, Germany Supervisor: Prof. Dr. Ulf Leser 2011-2013 Post-doctoral researcher Department of Computer Science The University of Hong Kong, China PR Supervisor: Prof. Nikos Mamoulis 2005-2011 Doctorate of Engineering, Data Management National Technical University of Athens, Greece Thesis: Evaluating Queries over Route Collections Supervisors: Prof. Yannis Vassiliou and Prof. Timos Sellis 2005 Research assistant Department of Informatics and Telecommunications University of Athens, Greece Supervisor: Associate Prof. Afrodite Tsalgatidou 2000-2005 Software engineer Institute for Speech and Language Processing Supervisor: Dr. Nicholas Glaros 1998-2003 Diploma of Electrical and Computer Engineering National Technical University of Athens, Greece Thesis: Query Language for Hierarchical Structures (in greek) Supervisor: Prof. Timos Sellis Selected Publications A complete list can be found here. Christian Rauch and Panagiotis Bouros: Fast Indexing for Temporal Information Retrieval Proceedings of the ACM on Management of Data (PACMMOD), Vol 3, No 4, September 2025 To be presented at the 2026 ACM International Conference on Management of Data (ACM SIGMOD), Bengaluru, India, May 31 - June 5, 2026 Panagiotis Bouros and Nikos Mamoulis: Relevance queries for interval data To appear in the Proceedings of the ACM on Management of Data (PACMMOD), Vol 3, No 3, June 2025 To be presented at the 2025 ACM International Conference on Management of Data (ACM SIGMOD), Berlin, Germany, June 22-27, 2025 George Christodoulou, Panagiotis Bouros and Nikos Mamoulis: LIT: Lightning-fast In-memory Temporal Indexing Proceedings of the ACM on Management of Data (PACMMOD), Vol 2 No 1, February 2024 Presented at the 2024 ACM International Conference on Management of Data (ACM SIGMOD), Santiago, Chile, June 9-15, 2024 George Christodoulou, Panagiotis Bouros and Nikos Mamoulis: HINT: A Hierarchical Index for Intervals in Main Memory Proceedings of the 2022 ACM International Conference on Management of Data (ACM SIGMOD), Philadelphia, PA, USA, June 12-17, 2022 Panagiotis Bouros, Dimitrios Tsitsigkos, Nikos Mamoulis and Manolis Terrovitis: In-Memory Interval joins International Journal on Very Large Data Bases (VLDBJ), Vol 30, No 4, July 2021 Theodoros Chondrogiannis, Panagiotis Bouros, Johann Gamper, Ulf Leser and David B. Blumenthal: Finding k-Shortest Paths with Limited Overlap International Journal on Very Large Data Bases (VLDBJ), Vol 29, No 5, September 2020 Willi Mann, Nikolaus Augsten and Panagiotis Bouros: An Empirical Evaluation of Set Similarity Join Techniques Proceedings of the VLDB Endowment (PVLDB), Vol 9, No 9, May 2016 Panagiotis Bouros, Dimitris Sacharidis, Theodore Dalamagas, Spiros Skiadopoulos and Timos Sellis: Evaluating Path Queries over Frequently Updated Route Collections IEEE Transactions on Knowledge and Data Engineering (TKDE), Vol 24, No 7, July 2012 Awards Best Paper Award, 14th International Symposium on Spatial and Temporal Databases (SSTD), 2015 Greek State Scholarship, 2007-2010 Professional Activities Journal Reviewer VLDB Journal (x8), ACM TODS (x2), IEEE TKDE (x4), GeoInformatica, DKE, IS (x3), TSAS (x3), WWW Journal, DAPD (x2), JCST, TJSS Member of Program Committees ACM SIGMOD'27, VLDB'26, VLDB'25, EDBT'25, ACM SIGSPATIAL'25, IEEE DASFAA'25, SSTD'25, VLDB'24, ACM SIGSPATIAL'24, DASFAA'24, EDBT'24-PhD, IEEE MDM'24 (meta-reviewer), SISAP'24, CDF4MD@IEEE MDM'24, VLDB'23, ACM SIGSPATIAL'23, DASFAA'23, SSTD'23, SISAP'23, IEEE ICDE'22, ACM SIGSPATIAL'22, DASFAA'22, SISAP'22, IEEE ICDE'21, ACM SIGSPATIAL'21, SSTD'21, IEEE DASFAA'21, IEEE ICDE'20, ACM SIGMOD'20-Demos, ACM SIGSPATIAL'20, ACM CIKM'20-Short papers, TIME'20, SISAP'20, ACM SIGSPATIAL'19, SISAP'19, VLDB'18, EDBT'18, ACM SIGSPATIAL'18, SISAP'18, ACM SIGSPATIAL'17, IEEE BigDataService'17, Smart City BigData@IEEE BigDataService'17, IEEE ICDE'16, ACM CIKM'16, ACM SIGSPATIAL GIS'16, IEEE BigDataService'16, SISAP'16, GeoRich@ACM SIGMOD'16, ACM CIKM'15, ACM SIGSPATIAL GIS'15, IEEE DASFAA'15, IEEE BigDataService'15, SISAP'15, GeoRich@ACM SIGMOD'15, ACM CIKM'14, ACM SIGSPATIAL GIS'14, ICDM'14-Demos, SISAP'14, iiWAS'14, BASNA'14, GeoRich@SIGMOD'14, ACM CIKM'11-Posters External Reviewer ACM SIGMOD'17, VLDB'17, VLDB'16, ACM SIGKDD'16, ACM SIGMOD'15, IEEE ICDE'15, EDBT'15, ACM SIGMOD'14, ACM SIGKDD'14, ACM SIGMOD'13, IEEE ICDE'13, ACM SIGKDD'13, SSTD'13, IEEE DASFAA'13, IEEE DASFAA'11, ACM SIGMOD'11, ACM CIKM'11, SSTD'11, TPDL'11, IEEE ICDE'10, SETN'10, DEXA'10, EGOVIS'10, VLDB'09, EDBT'09, ACM CIKM'09, ACM SIGSPATIAL GIS'09, BPM'09, PCI'07, PersDL'07, PSI'06, DaWak'06, HDMS'06, DEXA'05, EC-Web'05, I3E'05, ICWS'05 Member of Organizing Committees IEEE BigData'25 (Vice co-chair, Big Data Search and Mining), ACM SIGSPATIAL'24 (Workshops Chair), LocalRec@ACM SIGSPATIAL'24 (Chair), ACM SIGSPATIAL'23 (Registration Chair), LocalRec@ACM SIGSPATIAL'23 (Chair), ACM SIGSPATIAL'22 (Registration Chair), LocalRec@ACM SIGSPATIAL'22 (Chair), LocalRec@ACM SIGSPATIAL'21 (Chair), LocalRec@ACM SIGSPATIAL'20 (Chair), GeoRich@ACM SIGMOD'20 (Chair), SSTD'19 (General Chair), LocalRec@ACM SIGSPATIAL'19 (Chair), WISE'19, LocalRec@ACM SIGSPATIAL'18 (Chair), LocalRec@ACM SIGSPATIAL'17 (Chair), GeoRich@ACM SIGMOD'17, GeoTour@ADBIS'17, GeoRich@SIGMOD'16, LocalRec@ACM RecSys'15 (Chair), GeoRich@ACM SIGMOD'15, GeoRich@ACM SIGMOD'14 Search in contentSearchGo News New publication: SpatialConnect @ ACM SIGSPATIAL 2025 26. September 2025 New publication ACM SIGMOD 2026 27. May 2025 New publication: ADBIS 2025 26. May 2025 New publication: IEEE TKDE Journal 25. April 2025 HiWi positions open 7. February 2025 New publication: ACM SIGMOD 2025 3. February 2025 Bachelor thesis defense: Sebastian Hemberger 10. January 2025 Bachelor thesis defense: Dennis Scheck 7. January 2025 Bachelor thesis defense: Joshua Kempter 7. October 2024 Master thesis defense: Samia Goraya 24. September 2024",
  "content_length": 6928,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:40"
}