{
  "name": "Panagiotis Charalampopoulos",
  "homepage": "https://pcharalampo.github.io",
  "status": "success",
  "content": "Panagiotis Charalampopoulos Panagiotis Charalampopoulos Home Publications Teaching Service Address Department of Informatics King's College London Bush House, 30 Aldwych, London, WC2B 4BG Email p.charalampopoulos[at]kcl.ac.uk I am a Lecturer (Assistant Professor) in the Department of Informatics at King's College London. Prior to that, I was a Lecturer in the School of Computing and Mathematical Sciences at Birkbeck, University of London. Earlier, I was a postdoctoral fellow in the Efi Arazi School of Computer Science at Reichman University (IDC Herzliya) hosted by Shay Mozes and Oren Weimann (University of Haifa). I completed my Ph.D. studies in Computer Science in the Department of Informatics at King's College London under the supervision of Tomasz Radzik and Solon P. Pissis. During my Ph.D. studies, I completed a 6-month research internship in the Institute of Informatics at the University of Warsaw hosted by Jakub Radoszewski and a 5-month research internship at IDC Herzliya. Research Interests I am interested in algorithms and data structures, with a focus on strings and planar graphs. Selected Publications Strings Pattern Matching under Weighted Edit Distance [arxiv] P. Charalampopoulos, T. Kociumaka, P. Wellnitz FOCS 2025. Faster Pattern Matching Under Edit Distance: [doi] [arxiv] [slides] [talk at 42:50] A Reduction to Dynamic Puzzle Matching and the Seaweed Monoid of Permutation Matrices P. Charalampopoulos, T. Kociumaka, P. Wellnitz FOCS 2022. Faster Approximate Pattern Matching: A Unified Approach [doi] [arxiv] P. Charalampopoulos, T. Kociumaka, P. Wellnitz FOCS 2020. Planar graphs Almost Optimal Exact Distance Oracles for Planar Graphs [doi] [pdf] P. Charalampopoulos, P. Gawrychowski, Y. Long, S. Mozes, S. Pettie, O. Weimann, C. Wulff-Nilsen Journal of the ACM (2023). Exact Distance Oracles for Planar Graphs with Failing Vertices [doi] [arxiv] P. Charalampopoulos, S. Mozes, B. Tebeka ACM Transactions on Algorithms (2022). Strings via planar graphs An Almost Optimal Edit Distance Oracle [doi] [arxiv] [slides] [talk] P. Charalampopoulos, P. Gawrychowski, S. Mozes, O. Weimann ICALP 2021. Education 2016-2020: Ph.D. in Computer Science, King's College London, UK 2015-2016: M.Sc. in Advanced Computing, King's College London, UK 2010-2013: B.A. in Mathematics, University of Cambridge, UK",
  "content_length": 2334,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:38"
}