{
  "name": "Panagiotis Demestichas",
  "homepage": "https://www.ds.unipi.gr/en/faculty/pdemest-en",
  "status": "success",
  "content": "Panagiotis Demestichas - Department of Digital Systems Skip to content Panagiotis Demestichas Phone +30 210-4142758 Email pdemest@unipi.gr Title Professor Office Hourse Friday 10:00-11:00 & 14:00-16:00 Office 302 (150, Androutsou Str, Piraeus, 18532) Courses Computer Networks I — 4th semester Computer Networks II — 5th semester Brief CV Professor Panagiotis Demestichas received the Diploma and the Ph.D. degrees in Electrical Engineering from the National Technical University of Athens (NTUA). Since April 2012 he is full Professor at the Department of Digital Systems of the University of Piraeus, also leading the Telecommunication Networks and integrated Services (TNS) laboratory (http://tns.ds.unipi.gr). In the period from October 2015 to September 2016 he was on Sabbatical, collaborating with the University of Surrey and in particular its 5G Innovation Center. He has served as the Chairman of the Department of Digital Systems of the University of Piraeus (09.2011-09.2015), as an Assistant Professor (09.2002-11. 2007) and as an Associate Professor (12.2007-03.2012).  He led (serving as the Project Coordinator) the project OneFIT (07.2010-12.2012), and he served as Technical Manager of the project E3 (09.2008-12.2009), while also being Chairman of various Work Groups of WWRF, the most recent being the WGC “Communication Architectures and Technologies” (01.2004-12.2015). Professor Demestichas teaches Computer Networks I & II, at undergraduate level. He has supervised ten already completed PhD theses, and three currently under development. The main research areas of the TNS laboratory are smart/cognitive/autonomic management/convergence, management of ICT infrastructures/core-fixed access, applications/integrated services, SDN/NFV, smart wireless access, cognitive radio networks, opportunistic/sensor networks, as well as cloud/Internet of Things. Professor Demestichas participated in the project EuConNeCts2, in the context of which he organized the European Conference on Networks and Communications (EUCNC 2016), as the Chair of the Technical Programme Committee. The conference took place in Athens, Greece in June 2016. He has participated through various leading roles in the projects SLALOM, UniverSelf, iCore and ACROPOLIS. At a European level he has actively participated in research and development project under the framework programmes RACE II, ACTS, BRITE/EURAM, EURET, IST/FP5, IST/FP6, ICT/FP7. His recent interests include 5G aspects, and especially, the exploitation of spectrum beyond 6 GHz, overall spectrum management, 5G architectures, knowledge-based and predictive management, virtualization technologies based on SDN and NFV. He has several publications in these areas in international journals and refereed conferences. In terms of standardization, he has contributed to various standardization bodies such as ETSI and IEEE. He is a senior member of the IEEE, member of ACM and the Technical Chamber of Greece. Publications Publications Publications 2011 – 2019 I) JOURNALS I.-P. Belikaidis, A. Georgakopoulos, K. Tsagkaris, Z. Altman, S. Ben Jemaa, M. Michaloliakos, P. Demestichas, N. Mitrou, “System-level Evaluation and Management of 5G RAN Slicing Concept”, accepted for publication in IEEE Vehicular Technology Magazine, September 2019 D. Sabella, P. Serrano, G. Stea, A. Virdis, I. Tinnirello, F. Giuliano, D. Garlisi, P. Vlacheas, P. Demestichas, V. Foteinos, N. Bartzoudis and M. Payaro, “Designing the 5G network infrastructure: a flexible and reconfigurable architecture based on context and content information”, EURASIP Journal on Wireless Communications and Networking, August 2018, doi: https://doi.org/10.1186/s13638-018-1215-1 C. Bockelmann, N. K. Pratas, G. Wunder, S. Saur, M. Navarro, D. Gregoratti, G. Vivier, E. De Carvalho, Y. Ji, C. Stefanovic, P. Popovski, Q. Wang, M. Schellmann, E. Kosmatos, P. Demestichas, M. Raceala-Motoc, P. Jung, S. Stanczak and A. Dekors, “Towards Massive Connectivity Support for Scalable mMTC Communications in 5G networks”, IEEE Access, December 2018, doi: 10.1109/ACCESS.2018.2837382 I.-P. Belikaidis, A. Georgakopoulos, P. Demestichas, B. Miscopein, M. Filo, S. Vahid, B. Okyere, M. Fitch, “Multi-RAT dynamic spectrum access for 5G heterogeneous networks: the SPEED-5G approach”, IEEE Wireless Communications, Vol. 24, No. 5, pp. 14-22, October 2017, doi: 10.1109/MWC.2017.1700085 F. Schaich, B. Sayrac, S. Elayoubi, I. -P. Belikaidis, M. Caretti, A. Georgakopoulos, X. Gong, E. Kosmatos, H. Lin, P. Demestichas, B. Mouhouche, K. Pedersen, N. Pratas, M. Schellmann, M. Schubert, M. Shaat, and G. Wunder, “FANTASTIC-5G: flexible air interface for scalable service delivery within wireless communication networks of the 5th generation”. Trans. Emerging Tel. Tech., 27: 1216–1224. doi: 10.1002/ett.3050, June 2016 U. Herzog, A. Georgakopoulos, I. -P. Belikaidis, M. Fitch, K. Briggs, S. Diaz, Ó. Carrasco, K. Moessner, B. Miscopein, S. Mumtaz, and P. Demestichas, “Quality of service provision and capacity expansion through extended-DSA for 5G”. Trans. Emerging Tel. Tech., 27: 1250–1261. doi: 10.1002/ett.3061, Sept. 2016 A. Georgakopoulos, A. Margaris, K. Tsagkaris and P. Demestichas, “Resource Sharing in 5G Contexts: Achieving Sustainability with Energy and Resource Efficiency,” IEEE Vehicular Technology Magazine, vol. 11, no. 1, pp. 40-49, March 2016 P. Demestichas, A. Georgakopoulos, K. Tsagkaris, S. Kotrotsos, “Intelligent 5G networks: managing 5G wireless/mobile broadband,” IEEE Vehicular Technology Magazine, Vol.10, No.3, pp.41-50, Sept. 2015 K. Tsagkaris, G. Poulios, P. Demestichas, A. Tall, Z. Altman, C. Destre, “An open framework for programmable, self-managed Radio Access Networks”, IEEE Communications Magazine, Vol.53, No.7, pp.154-161, July 2015 D. Karvounas, A. Georgakopoulos, V. Stavroulaki, K. Tsagkaris, P. Demestichas, “Evaluation of signaling load in control channels for the cognitive management of opportunistic networks”, Transactions on Emerging Telecommunications Technologies, Vol. 26, No.5, pp.929-944, May 2015 V. Foteinos, K. Tsagkaris, P. Peloso, L. Ciavaglia, P. Demestichas, “Energy-aware allocation of traffic to optical lightpaths in multilayer core networks”, International Journal of Network Management, May 2015, DOI: 10.1002/nem.1890 K. Tsagkaris, M. Logothetis, V. Foteinos, G. Poulios, M. Michaloliakos, P. Demestichas, “Customizable autonomic network management: integrating autonomic network management and software-defined networking,” IEEE Vehicular Technology Magazine, Vol.10, No.1, pp.61-68, Mar. 2015 V. Foteinos, K. Tsagkaris, P. Peloso, L. Ciavaglia, P. Demestichas, “Operator-friendly traffic engineering in IP/MPLS core networks”, IEEE Transactions on Network and Service Management, Vol.11, No.3, pp. 333-349, Sept. 2014 Y. Wang, J. Li, L. Huang, J. Yao, A. Georgakopoulos, P. Demestichas, “5G mobile: spectrum broadening to higher-frequency bands to support high data rates”, IEEE Vehicular Technology Magazine, Vol.9, No.3, pp.39-46, Sept. 2014 D. Karvounas, A. Georgakopoulos, K. Tsagkaris, V. Stavroulaki, P. Demestichas, “Smart management of D2D constructs: An experiment-based approach”, IEEE Communications Magazine, Vol.52, No.4, pp.82-89, Apr. 2014 A. Bantouna, G. Poulios, K. Tsagkaris, P. Demestichas, “Network load predictions based on big data and the utilization of self-organizing maps”, Journal of Network and Systems Management, Vol. 22, No. 2, pp. 150-173, Apr. 2014 V. Stavroulaki, N. Koutsouris, Y. Kritikou, P. Demestichas, “Cognitive management of devices in the wireless networks”, Wireless Personal Communications Journal, Vol. 75, No.4, pp. 2289-2322, Apr. 2014, DOI: 10.1007/s11277-013-1468-2 J. Poncela, P. Vlacheas, R. Giaffreda, S. De, M. Vecchio, S. Nechifor, R. Barco, M. C. Aguayo-Torres, V. Stavroulaki, K. Moessner, P. Demestichas, “Smart Cities via Data Aggregation”, Wireless Personal Communications, Springer, March 2014 V. Foteinos, D. Kelaidonis, G. Poulios, P. Vlacheas, V. Stavroulaki, P. Demestichas, “A Cognitive management framework for enabling autonomous applications in the Internet of Things”, IEEE Vehicular Technology Magazine, Vol. 8, No.4, pp.90-99, Dec. 2013 A. Galani, K. Tsagkaris, G. Nguengang, I. I. Grida Ben Yahia, M. Ghader, A. Kaloxylos, M. Gruber, A. Kousaridas, M. Bouet, S. Georgoulas, A. Bantouna, N. Alonistioti, P. Demestichas, “A survey of autonomic networking architectures: towards a unified management framework”, International Journal of Network Management, Vol. 23, No. 6, pp. 402-423, Nov/Dec. 2013 P. Vlacheas, V. Stavroulaki, P. Demestichas, S. Cadzow, D. Ikonomou, S. Gorniak, “Towards an end-to-end network resilience”, International Journal of Critical Infrastructure Protection, Vol. 6, No. 3-4, pp. 159-178, Dec. 2013 P. Demestichas, A. Georgakopoulos, D. Karvounas, K. Tsagkaris, V. Stavroulaki, J. Lu, C. Xiong, J. Yao, “5G on the horizon: key challenges for the radio access network”, IEEE Vehicular Technology Magazine, Vol.8, No.3, pp.47-53, Sept. 2013 M. Logothetis, K. Tsagkaris, P. Demestichas, “Application and mobility aware integration of opportunistic networks with wireless infrastructures”, Computers and Electrical Engineering journal, Vol. 39, No. 6, pp. 1609-1624, Aug. 2013, DOI:10.1016/j.compeleceng.2012.07.014 D. Karvounas, P. Vlacheas, A. Georgakopoulos, V. Stavroulaki, P. Demestichas, “Enriching self-organizing networks use cases with opportunistic features: a coverage and capacity optimization paradigm”, International Journal of Network Management, Vol. 23, No. 4, pp. 272-286, Jul./Aug. 2013, DOI: 10.1002/nem.1829 P. Vlacheas, R. Giaffreda, V. Stavroulaki, D. Kelaidonis, A. Somov, V. Foteinos, G. Poulios, A.-R. Biswas, K. Moessner, P. Demestichas, “Enabling smart cities through a cognitive management framework for the Internet of Things”, IEEE Communications Magazine, Vol. 51, No. 6, pp. 102-111, Jun. 2013, DOI: 10.1109/MCOM.2013.6525602 G. Baldini, O. Holland, V. Stavroulaki, A. Polydoros, S. Karanasios, D. ",
  "content_length": 34938,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:40"
}