{
  "name": "Panagiotis Kanellopoulos",
  "homepage": "https://www.essex.ac.uk/people/kanel33803/panagiotis-kanellopoulos",
  "status": "success",
  "content": "Panagiotis Kanellopoulos | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Panagiotis Kanellopoulos People Dr Panagiotis Kanellopoulos Faculty Progress and Assessment Officer - Lecturer (R) (Science & Health) School of Computer Science and Electronic Engineering (CSEE) Email panagiotis.kanellopoulos@essex.ac.uk Location 1NW.3.13, Colchester Campus Academic support hours Summer Term 2024/25: - Monday, 11am-1pm: email me to arrange a meeting Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Appointments University of Essex Faculty Progress and Assessment Officer, University of Essex (1/2025 - present) Lecturer, Computer Science and Electronic Engineering, University of Essex (1/8/2019 - present) Research and professional activities Research interests Algorithmic Game Theory Algorithmic Mechanism Design Design and Analysis of Algorithms Reinforcement Learning Teaching and supervision Current teaching responsibilities Industry Expert Lectures in Finance (BE653) Machine Learning for Finance (CF969) CCFEA MSc Dissertation (CF981) Current supervision Nee Norteye Barnor Degree subject: Computational Finance Degree type: Doctor of Philosophy Sirui Zhu Degree subject: Computational Finance Degree type: Doctor of Philosophy Previous supervision Rongsen Zhang Thesis title: Mechanism Design Without Money for Heterogeneous and Distributed Facility Location Problems Degree subject: Computational Finance Degree type: Doctor of Philosophy Awarded date: 23/5/2024 Hao Zhou Thesis title: A Study on the Impact of Strategic Behaviour in Financial Networks Degree subject: Computational Finance Degree type: Doctor of Philosophy Awarded date: 28/11/2023 Publications Journal articles (26) Caragiannis, I., Kanellopoulos, P. and Kyropoulou, M., (2025). On interim envy-free allocation lotteries. Mathematics of Operations Research. 50 (4), 3257-3282 Kanellopoulos, P., Voudouris, A. and Zhang, R., (2025). Truthful two-facility location with candidate locations. Theoretical Computer Science. 1024, 114913-114913 Long, X., Kampouridis, M. and Kanellopoulos, P., (2025). An In-Depth Investigation of Genetic Programming Under Physical Time and Directional Change Frameworks for Algorithmic Trading. IEEE Access. 13, 151001-151015 Qi, J., Woolway, M., Kyropoulou, M., Kanellopoulos, P. and Steele, D., (2025). Telematics in Insurance: Challenges and Limitations. IEEE Access. 13, 147449-147466 Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2025). Optimal Bailouts and Strategic Debt Forgiveness in Financial Networks. Artificial Intelligence. 349, 104424-104424 Filos-Ratsikas, A., Kanellopoulos, P., Voudouris, AA. and Zhang, R., (2024). The Distortion of Distributed Facility Location. Artificial Intelligence. 328, 104066-104066 Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2024). On priority-proportional payments in financial networks. Theoretical Computer Science. 1014, 114767-114767 Kanellopoulos, P., Voudouris, A. and Zhang, R., (2023). On Discrete Truthful Heterogeneous Two-Facility Location. SIAM Journal on Discrete Mathematics. 37 (2), 779-799 Kanellopoulos, P., Kyropoulou, M. and Voudouris, A., (2023). Not all Strangers are the Same: The Impact of Tolerance in Schelling Games. Theoretical Computer Science. 971, 114065-114065 Caragiannis, I., Kanellopoulos, P. and Voudouris, AA., (2022). Bounding the Inefficiency of Compromise in Opinion Formation. Algorithmica. 84 (1), 234-271 Kampouridis, M., Kanellopoulos, P., Kyropoulou, M., Melissourgos, T. and Voudouris, A., (2022). Multi-Agent Systems for Computational Economics and Finance. AI Communications: the European journal on artificial intelligence. 35 (4), 369-380 Kaklamanis, C., Kanellopoulos, P., Papaioannou, K. and Patouchas, D., (2021). On the price of stability of some simple graph-based hedonic games. Theoretical Computer Science. 855, 1-15 Caragiannis, I., Filos-Ratsikas, A., Kanellopoulos, P. and Vaish, R., (2021). Stable fractional matchings. Artificial Intelligence. 295 (C), 103416-103416 Kanellopoulos, P., Kyropoulou, M. and Voudouris, AA., (2021). Modified Schelling games. Theoretical Computer Science. 880, 1-19 Kaklamanis, C., Kanellopoulos, P. and Tsokana, S., (2018). On network formation games with heterogeneous players and basic network creation games. Theoretical Computer Science. 717, 62-72 Caragiannis, I., Chatzigeorgiou, X., Kanellopoulos, P., Krimpas, GA., Protopapas, N. and Voudouris, AA., (2017). Efficiency and complexity of price competition among single-product vendors. Artificial Intelligence. 248, 9-25 Caragiannis, I., Kaklamanis, C., Kanellopoulos, P., Kyropoulou, M., Lucier, B., Paes Leme, R. and Tardos, É., (2015). Bounding the inefficiency of outcomes in generalized second price auctions. Journal of Economic Theory. 156, 343-388 Alon, N., Demaine, ED., Hajiaghayi, M., Kanellopoulos, P. and Leighton, T., (2014). Correction: Basic network creation games. SIAM Journal on Discrete Mathematics. 28 (3), 1638-1640 Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Kyropoulou, M., (2014). Revenue Guarantees in the Generalized Second Price Auction. ACM Transactions on Internet Technology. 14 (2-3), 1-19 Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Kyropoulou, M., (2012). The Efficiency of Fair Division. Theory of Computing Systems. 50 (4), 589-610 Caragiannis, I., Flammini, M., Kaklamanis, C., Kanellopoulos, P. and Moscardelli, L., (2011). Tight Bounds for Selfish and Greedy Load Balancing. Algorithmica. 61 (3), 606-637 Caragiannis, I., Kaklamanis, C. and Kanellopoulos, P., (2010). Taxes for linear atomic congestion games. ACM Transactions on Algorithms. 7 (1), 1-31 Caragiannis, I., Kaklamanis, C., Kanellopoulos, P. and Papaioannou, E., (2008). Scheduling to maximize participation. Theoretical Computer Science. 402 (2-3), 142-155 Caragiannis, I., Kaklamanis, C. and Kanellopoulos, P., (2006). Energy-Efficient Wireless Network Design. Theory of Computing Systems. 39 (5), 593-617 Caragiannis, I., Kaklamanis, C. and Kanellopoulos, P., (2003). A logarithmic approximation algorithm for the minimum energy consumption broadcast subgraph problem. Information Processing Letters. 86 (3), 149-154 Caragiannis, I., Kaklamanis, C. and Kanellopoulos, P., (2002). New bounds on the size of the minimum feedback vertex set in meshes and butterflies. Information Processing Letters. 83 (5), 275-280 Show all Books (1) (2022). Algorithmic Game Theory - 15th International Symposium, SAGT 2022, Colchester, UK, September 12-15, 2022, Proceedings. Springer. 3031157133. 978-3-031-15713-4 Book chapters (1) Caragiannis, I., Kanellopoulos, P. and Kaklamanis, C., (2007). Minimum Energy Communication in Ad Hoc Wireless Networks. In: Chapman & Hall/CRC Computer & Information Science Series. Chapman and Hall/CRC. 9781584886235 Conferences (40) Kanellopoulos, P., Kyropoulou, M. and Zhou, H., Forgiving Debt in Financial Network Games: Extended Abstract Kanellopoulos, P. and Voudouris, A., Truthful Facility Location with Candidate Locations and Limited Resources Kanellopoulos, P. and Voudouris, A., (2025). Constrained Truthful Obnoxious Two-Facility Location with Optional Preferences Long, X., Kampouridis, M. and Kanellopoulos, P., (2023). Multi-objective optimisation and genetic programming for trading by combining directional changes and technical indicators Kanellopoulos, P., Voudouris, A. and Zhang, R., (2023). Truthful Two-Facility Location with Candidate Locations Filos-Ratsikas, A., Kanellopoulos, P., Voudouris, A. and Zhang, R., (2023). Settling the Distortion of Distributed Facility Location Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2023). Debt Transfers in Financial Networks: Complexity and Equilibria Christodoulaki, E., Kampouridis, M. and Kanellopoulos, P., (2022). Technical and Sentiment Analysis in Financial Forecasting with Genetic Programming Kanellopoulos, P., Voudouris, A. and Zhang, R., (2022). On Discrete Truthful Heterogeneous Two-Facility Location Long, X., Kampouridis, M. and Kanellopoulos, P., (2022). Genetic programming for combining directional changes indicators in international stock markets Kanellopoulos, P., Kyropoulou, M. and Voudouris, A., (2022). Not all Strangers are the Same: The Impact of Tolerance in Schelling Games Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2022). Forgiving Debt in Financial Network Games Kanellopoulos, P., Kyropoulou, M. and Zhou, H., (2021). Financial network games Caragiannis, I., Kanellopoulos, P. and Kyropoulou, M., (2021). On Interim Envy-Free Allocation Lotteries Kanellopoulos, P., Kyropoulou, M. and Voudouris, A., (2020). Modified Schelling Games Caragiannis, I., Filos-Ratsikas, A., Kanellopoulos, P. and Vaish, R., (2019). Stable Fractional Matchings Kaklamanis, C., Kanellopoulos, P. and Patouchas, D., (2018). On the Price of Stability of Social Distance Games Kiourt, C., Kalles, D. and Kanellopoulos, P., (2018). How Game Complexity Affects ",
  "content_length": 16320,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:39"
}