{
  "name": "Panagiotis Stamatopoulos",
  "homepage": "http://cgi.di.uoa.gr/~takis/Welcome.html",
  "status": "success",
  "content": "Homepage of Panagiotis Stamatopoulos ÅëëçíéêÜ PANAGIOTIS STAMATOPOULOS Education Professional Appointments Research and Teaching Activities Publications Contact Information Education 1988 PhD in Computer Science (Department of Physics, University of Athens) 1982 Diploma in Physics (Department of Physics, University of Athens) Professional Appointments May 2001 - today Assistant Professor at the Department of Informatics and Telecommunications of the University of Athens October 1993 - May 2001 Lecturer at the Department of Informatics of the University of Athens July 1989 - July 1993 Postdoctoral researcher at the Institute of Informatics and Telecommunications of NCSR \"Democritos\" March 1989 - October 1993 Research associate at the Department of Informatics and Telecommunications of the University of Athens in the context of European Union research projects Research and Teaching Activities Panagiotis Stamatopoulos received his PhD in March 1988 from the University of Athens. The research for his thesis, entitled \"Contribution to Natural Language Understanding for Database Access\", was carried out in NCSR \"Democritos\". In 1989, he got a four-year postdoctoral research position at \"Democritos\". Since October 1993, he is a member of the academic staff at the Department of Informatics and Telecommunications of the University of Athens. He has co-authored more than 50 papers, which have received more than 2000 citations. His research work falls into the following general areas: Artificial Intelligence Constraint Programming Logic Programming Natural Language Processing and Understanding Machine Learning Parallel Processing Combinatorial Search Problems Scheduling and Resource Allocation Problems Multi-agent Systems Artificial Intelligence Methods for the Web Consolidation of Constraint Programming and Operations Research Handling Large Prolog Knowledge Bases Panagiotis Stamatopoulos has worked at the Department of Informatics and Telecommunications of the University of Athens for the European Union research projects EDS (EP2025), APPLAUSE (EP6708), PARACHUTE (EP9134) and PARROT (EP24960). He has also led various projects funded (or co-funded) by the University of Athens, as well as a project funded by Olympic Airways. He teaches the undergraduate courses \"Introduction to Programming\" and \"Logic Programming\" as well as the postgraduate course \"Advanced Artificial Intelligence\". He has also taught the undergraduate courses \"Artificial Intelligence\" and \"System Programming\" and the postgraduate course \"Expert Systems\". Finally, he has supervised, and he is currently supervising, a number of qualifying diploma theses. Publications Papers N. Pittaras, G. Giannakopoulos, P. Stamatopoulos, V. Karkaletsis. \"Content-based and Knowledge-enriched Representations for Classification Across Modalities: A Survey\". ACM Computing Surveys, Vol. 55, No. 14s, pp. 1-40, 2023. (Pdf here) G. Kamaras, P. Stamatopoulos, S. Konstantopoulos. \"Path planning for terrain of steep incline using Bézier curves\". Proceedings of the 32nd IEEE International Conference on Tools with Artificial Intelligence ICTAI-2020, pp. 101-105, Virtual Conference, 2020. (Pdf here) N. Pothitos, P. Stamatopoulos. \"The Dilemma Between Arc and Bounds Consistency\". International Journal of Intelligent Systems, Vol. 35, No. 10, pp. 1467-1491, 2020. (Pdf here) N. Gialitsis, N. Pittaras, P. Stamatopoulos. \"A Topic-Based Sentence Representation for Extractive Text Summarization\". Proceedings of the MultiLing 2019 Workshop, Varna, 2019. (Pdf here) N. Pothitos, P. Stamatopoulos. \"Building Search Methods with Self-Confidence in a Constraint Programming Library\". International Journal on Artificial Intelligence Tools, Vol. 27, No. 4, 2018. (Pdf here) N. Pothitos, P. Stamatopoulos. \"Piece of Pie Search: Confidently Exploiting Heuristics\". Proceedings of the 9th Hellenic Conference on Artificial Intelligence SETN-2016, Thessaloniki, 2016. (Pdf here) N. Pothitos, P. Stamatopoulos. \"Constraint Programming MapReduce'd\". Proceedings of the 9th Hellenic Conference on Artificial Intelligence SETN-2016, Thessaloniki, 2016. (Pdf here) N. Pothitos, P. Stamatopoulos, K. Zervoudakis. \"Course Scheduling in an Adjustable Constraint Propagation Schema\". Proceedings of the 24th IEEE International Conference on Tools with Artificial Intelligence ICTAI-2012, Vol. 1, pp. 335-343, Athens, 2012. (Pdf here) N. Pothitos, G. Kastrinis, P. Stamatopoulos. \"Constraint Propagation as the Core of Local Search\". Proceedings of the 7th Hellenic Conference on Artificial Intelligence SETN-2012, LNAI 7297, pp. 9-16, Lamia, 2012. (Pdf here) M. Dima, D. Vogiatzis, G. Paliouras, P. Stamatopoulos. \"Expert Based Prediction of User Preferences\". Proceedings of the 5th International Workshop on Semantic Media Adaptation and Personalization SMAP-2010, pp. 112-117, Limmassol, 2010. (Pdf here) N. Pothitos, P. Stamatopoulos. \"Flexible Management of Large-Scale Integer Domains in CSPs\". Proceedings of the 6th Hellenic Conference on Artificial Intelligence SETN-2010, LNAI 6040, pp. 405-410, Athens, 2010. (Pdf here) V. Papataxiarhis, V. Tsetsos, I. Karali, P. Stamatopoulos, S. Hadjiefthymiades. \"i-footman: A Knowledge-Based Framework for Football Managers\". Proceedings of the 3rd East European Workshop on Rule-Based Applications RuleApps2009, Cottbus, Germany, September 2009. (Pdf here) V. Papataxiarhis, V. Tsetsos, I. Karali, P. Stamatopoulos, S. Hadjiefthymiades. \"Developing Rule-Based Applications for the Web: Methodologies and Tools\". Chapter XVI in \"Handbook of Research on Emerging Rule-Based Languages and Technologies: Open Solutions and Approaches\", Information Science Reference, ISBN 978-1-60566-402-6, May 2009. (Pdf here) G. Giannakopoulos, V. Karkaletsis, G. Vouros, P. Stamatopoulos. \"Summarization System Evaluation Revisited: N-gram Graphs\". ACM Transactions on Speech and Language Proceesing, Vol. 5, No. 3, pp. 1-39, 2008. (Pdf here) S. D. Afantenos, V. Karkaletsis, P. Stamatopoulos, C. Halatsis. \"Using Synchronic and Diachronic Relations for Summarizing Multiple Documents Describing Evolving Events\". Journal of Intelligent Information Systems, Vol. 30, pp. 183-226, 2008. (Pdf here) S. D. Afantenos, V. Karkaletsis, P. Stamatopoulos. \"Summarizing Reports on Evolving Events; Part I: Linear Evolution\". International Conference RANLP 2005 (Recent Advances in Natural Language Processing), pp. 18-24, Borovets, 2005. (Pdf here) S. D. Afantenos, V. Karkaletsis, P. Stamatopoulos. \"Summarization from Medical Documents: A Survey\". Artificial Intelligence in Medicine, Vol. 33, pp. 157-177, 2005. (Pdf here) G. Sigletos, G. Paliouras, C. D. Spyropoulos, P. Stamatopoulos. \"Stacked Generalization for Information Extraction\". Proceedings of the 16th European Conference on Artificial Intelligence ECAI 2004, pp. 549-553, Valencia, 2004. (Pdf here) N. Karampatziakis, G. Paliouras, D. Pierrakos, P. Stamatopoulos. \"Navigation Pattern Discovery Using Grammatical Inference\". Proceedings of the 7th International Colloquium on Grammatical Inference ICGI-2004, LNAI 3264, pp. 187-198, Athens, 2004. (Pdf here) E. Michelakis, I. Androutsopoulos, G. Paliouras, G. Sakkis, P. Stamatopoulos. \"Filtron: A Learning-Based Anti-Spam Filter\". Proceedings of the 1st Conference on Email and Anti-Spam CEAS 2004, Mountain View, 2004. (Pdf here) G. Boukeas, P. Stamatopoulos, C. Halatsis, V. Zissimopoulos. \"Inherent Choice in the Search Space of Constraint Satisfaction Problem Instances\". Proceedings of the 3rd Hellenic Conference on Artificial Intelligence SETN-2004, LNAI 3025, pp. 362-370, Samos, 2004. (Pdf here) K. Hatzikokolakis, G. Boukeas, P. Stamatopoulos. \"Construction and Repair: A Hybrid Approach to Search in CSPs\". Proceedings of the 3rd Hellenic Conference on Artificial Intelligence SETN-2004, LNAI 3025, pp. 342-351, Samos, 2004. (Pdf here) G. Boukeas, C. Halatsis, V. Zissimopoulos, P. Stamatopoulos. \"Measures of Intrinsic Hardness for Constraint Satisfaction Problem Instances\". Proceedings of the 30th Conference on Current Trends in Theory and Practice of Computer Science SOFSEM 2004, LNCS 2932, pp. 184-195, Prague, 2004. (Pdf here) G. Sigletos, G. Paliouras, C. D. Spyropoulos, P. Stamatopoulos. \"Meta-learning Beyond Classification: A Framework for Information Extraction from the Web\". Proceedings of the \"Adaptive Text Extraction and Mining\" Workshop of the 7th European Conference on Principles and Practice of Knowledge Discovery in Databases PKDD 2003 and of the 14th European Conference on Machine Learning ECML 2003, 2003. (Pdf here) G. Sakkis, I. Androutsopoulos, G. Paliouras, V. Karkaletsis, C. D. Spyropoulos, P. Stamatopoulos. \"A Memory-Based Approach to Anti-Spam Filtering for Mailing Lists\". Information Retrieval, Vol. 6, pp. 49-73, 2003. (Pdf here) M. Sellmann, K. Zervoudakis, P. Stamatopoulos, T. Fahle. \"Crew Assignment via Constraint Programming: Integrating Column Generation and Heuristic Tree Search\". Annals of Operations Research, Vol. 115, pp. 207-225, 2002. (Pdf here) O. Telelis, P. Stamatopoulos. \"Guiding Constructive Search with Statistical Instance-Based Learning\". International Journal on Artificial Intelligence Tools, Vol. 11, No. 2, pp. 247-266, 2002. (Pdf here) D. G. Kapopoulos, M. Hatzopoulos, P. Stamatopoulos. \"Efficient Management of Persistent Knowledge\". Journal of Intelligent Information Systems, Vol. 19, No. 1, pp. 111-134, 2002. (Pdf here) H. Kornilakis, P. Stamatopoulos. \"Crew Pairing Optimization with Genetic Algorithms\". Proceedings of the 2nd Hellenic Conference on Artificial Intelligence SETN-2002, LNAI 2308, pp. 109-120, Thessaloniki, 2002. (Pdf here) G. Christodoulou, P. Stamatopoulos. \"Crew Assignment by Constraint Logic Programming\". Proceedings of the 2nd Hellenic Conference on Artificial Intelligence SETN-2002 (Companion Volume), pp. 117-127, Thessaloniki, 2002. (Pdf here) O. Telelis, P. Stamatopoulos. \"Heuristic Backbone Sampling for Maximum Satisfiability\". Proceedings of the 2nd Hellenic Conference on A",
  "content_length": 16628,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:41"
}