{
  "name": "Panagiotis Tsanakas",
  "homepage": "http://www.cslab.ntua.gr/~panag",
  "status": "success",
  "content": "Dr Panayiotis Tsanakas Home Page Welcome to Dr. Panayiotis Tsanakas' Home Page! Panayiotis D. Tsanakas Professor National Technical University of Athens Department of Electrical & Computer Engineering Computer Systems Laboratory Dipl. in Electrical Engineering from the University of Thessaloniki MSc in Computer Engineering from Ohio University PhD in Computer Engineering from the National Technical University of Athens Research Interests Parallel/distributed computing systems Automated synthesis of application-specific architectures Educational multimedia platforms Medical information systems Research Publications List of Courses ECE 3720 Computer Architecture ECE 3610 Operating Systems ECE 3888 Computer Systems Laboratory ECE 3990 Parallel Computing Systems RTD Projects Automated synthesis of parallel VLSI architectures for specialised applications (GSRT-PENED) Portable parallel programming platform for multiple system architectures (GSRT-PENED) DEFACTO: Design Framework for Interactive Story Systems, ESPRIT - LTR 23456 MODULATES: Multimedia Organisation for Developing the Understanding and Learning of Advanced Technology in European Schools, EU Educational Multimedia Taskforce MM-1018 Upgrading and expansion of the Greek telemedicine system (STRIDE-HELLAS) SENARIO: Sensor-aided intelligent wheel chair navigation, (CEC-TIDE Project) NIKA: A generalised system for medical image management (GSRT-EKBAN-504). DIALOGOS: Development of the Greek language and speech industry (GSRT-EKBAN) CORAES: Digitisation and dissemination of the cultural material of the National Library of Greece (GSRT-EKBAN) HILDE: Hypermedia Intelligent Learning Environment, GSRT-EKBAN ÁÌBULANCE: Mobile unit for health care provision via telematics support, Telematics-HC-2547. ASPIS: Reengineering and Automation of Bussiness Processes in Drug Management (GSRT-EKBAN-98) VELOS: Advanced CAD Applications on High Performance Computing Architectures (GSRT-EKBAN) Books (in Greek) Operating Systems Principles I, Symmetria Publications, 240p, 1986. (with G. Papakonstantinou and N. Bilalis) Computer Architecture, Symmetria Publications, 320p, 1989. (with G. Papakonstantinou and G. Frangakis) The Operating System EMPIX, Symmetria Publications, 376p, 1990. (with G. Papakonstantinou and C. Dellarokas) Parallel Computing Systems, Symmetria Publications, 245p, 1994. (with G. Papakonstantinou and T. Theoharis) Mapping of algorithms onto parallel computing architectures, Papasotiriou, 240p, 1998. (with G. Papakonstantinou and N. Koziris) Introduction to Operating Systems, OEDB, 198p, 1998. (with G. Papakonstantinou, A. Manousopoulou, A. Galdadas and P. Matzakos) Computer System Technology and Operating Systems, OEDB, 250p, 1999. (with G. Papakonstantinou, A. Manousopoulou, N. Koziris and P. Matzakos) Panayiotis Tsanakas Department of Electrical and Computer Engineering National Technical University of Athens Polytechnioupolis Zographou, GR-15773 Hellas (Greece) panag at cs.ntua.gr Voice : +30-210-772 2541 Cellular: (+30-693) 2621668 Fax : +30-210-772 2542 Personal interests Last updated May  12, 2002.",
  "content_length": 3108,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:42"
}