{
  "name": "Panayotis Mavromatis",
  "homepage": "http://steinhardt.nyu.edu/faculty/Panayotis_Mavromatis",
  "status": "success",
  "content": "Panayotis Mavromatis | NYU Steinhardt Skip to main content Search NYU Steinhardt Search Close Search Panayotis Mavromatis Associate Professor of Music and Music Education Music and Performing Arts Professions panos.mavromatis@nyu.edu (212) 998-5287 Panayotis Mavromatis received his B.A. and M.A. in Mathematics from Cambridge University in England, his M.A. in Physics from Boston University, and his Ph.D. in Music Theory from the Eastman School of Music. His research integrates cognitive science, linguistics and computer science into traditional music disciplines, including Schenkerian theory, history of theory, and post-tonal theory. His current work focuses on the mathematical modeling of musical structure, as well as the computational modeling of musical skill and its acquisition. In one line of research, he developed a computational model of melody in modern Greek church chant and explored its cognitive implications. In another line of research, he pursues the educational applications of his theoretical work using Intelligent Tutoring Systems. Selected Publications Mavromatis, P. \"Minimum Description Length Modeling of Musical Structure.\" Journal of Mathematics and Music 3/3 (2009): 117-136. (link) Mavromatis, P. (2009) \"A Multi-tiered Approach for Analyzing Expressive Timing in Music Performance.\" Communications in Computer and Information Science: Mathematics and Computation in Music, pp. 193-204. Springer Verlag. (link) Mavromatis, P. (2009) \"HMM Analysis of Musical Structure: Identification of Hidden Variables Through Topology-Sensitive Model Selection.\" Communications in Computer and Information Science: Mathematics and Computation in Music, pp. 205-217. Springer Verlag. (link) Mavromatis, P. and Brown, M. \"An Intelligent Tutoring System for Tonal Counterpoint: From Process to Structure.\" In Proceedings of the 4th Conference on Interdisciplinary Musicology, Thessaloniki, Greece, 3-6 July 2008. http://web.auth.gr/cim08/ (link) Mavromatis, P. \"A Hidden Markov Model of Melody Production in Greek Church Chant.\" Computing in Musicology 14 (2005): 93-112. (link) Mavromatis, P. The Echoi [Modes] of Modern Greek Church Chant in Written and Oral Transmission: A Computational Model and Its Cognitive Implications. Ph.D. Dissertation. Eastman School of Music, University of Rochester, 2005. (link) Programs Music Education Prepare to become a music educator in school, international, studio, and community settings as you develop your artistic and instructional skills in NYC. Read More",
  "content_length": 2522,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:44"
}