{
  "name": "Panagiotis Tsakalides",
  "homepage": "http://users.ics.forth.gr/~tsakalid",
  "status": "success",
  "content": "Panagiotis Tsakalides Panagiotis Tsakalides Professor Department of Computer Science University of Crete Head Signal Processing Laboratory (SPL) Institute of Computer Science (ICS) Foundation for Research & Technology - Hellas (FORTH) Tel: +30 2810 391.730 +30 2810 393.587 Fax: +30 2810 391.601 E-mail: tsakalid@csd.uoc.gr, tsakalid@ics.forth.gr Air-mail: FORTH-ICS, N. Plastira 100, Vassilika Vouton, GR 700 13 Heraklion, Crete, Greece Short Biography (From palm-tree country to olive-tree country) Panagiotis Tsakalides earned his Diploma in Electrical Engineering from Aristotle University of Thessaloniki, Greece, in 1990. The same year, he moved to Tinseltown (that is LA in California) to pursue graduate studies with scholarships from the Fulbright and Bodossakis Foundations. He received his M.Sc. in Computer Engineering in 1991 and his Ph.D. in Electrical Engineering in 1995, both from the University of Southern California (USC). From 1996 to 1999, he served as a Research Assistant Professor at USC's Signal & Image Processing Institute and worked as a consultant for the U.S. Navy and Air Force. Between 1999 and 2002, he was with the Department of Electrical Engineering at the University of Patras, Greece. In September 2002, he joined the Computer Science Department at the University of Crete as an Associate Professor and FORTH-ICS as a Researcher. From March 2017 to September 2019, he served as Vice Rector of Financial Planning, Infrastructure and Development at the University of Crete, and from September 2019 to August 2020, he was the University's Rector. He is currently a Professor of Computer Science, Head of the Signal Processing Laboratory, and Associate Director at FORTH-ICS. His research focuses on statistical signal processing and machine learning with emphasis in non-Gaussian estimation and detection theory, sparse representations, and their applications in imaging, sensor networks, audio, and multimedia systems. He has coauthored over 250 technical publications, including 65 journal papers. Prof. Tsakalides has extended experience in technology transfer and industry collaboration. Since 2003, he has coordinated 9 European Commission and 13 national projects, with a combined budget exceeding 15 M €, securing over 8 M € for FORTH-ICS and the University of Crete. He was the principal investigator of the 1.3 M € FP7 MC-IAPP \"CS-ORION\" project on compressed sensing for remote imaging in aerial and terrestrial surveillance, and the 1 M € H2020-LEIT-Space-COMPET project \"PHYSIS,\" focused on sparse signal processing for hyperspectral imaging systems. Currently, he leads a 2.5 M € Horizon Europe ERA Chair project, \"TITAN: Frugal Artificial Intelligence and Application in Astrophysics,\" aimed at establishing a center of excellence in computational science, machine learning, and statistics for data-driven Astronomy. Complete CV Expertise and General Research Interests Mathematical Signal Processing and Machine Learning Non-Gaussian Time Series Analysis Compressed Sensing, Sparse Representations and Applications Distributed Signal Processing for Sensor Networks Computational Imaging Systems The Team doing the work: The Signal Processing Laboratory Funded Research Projects/Grants The TITAN project (2023-2027) The V4-ICARUS project (2020-2022) The CALCHAS project (2019-2022) The SMARTWATER2020 project (2017-2020) The PHYSIS project (2015-2017) The CS-ORION project (2010-2014) The ASPIRE project (2006-2010) List of Publications Google Citation Profile Scopus Citation Overview Teaching UoC-CS-217: Probability Theory (Fall 2002-12, 2014-24) UoC-CS-317: Random Processes (Spring 2016, 2021-25, Fall 2013; Spring 2009-12; Spring 2005-07) UoC-CS-215: Applied Mathematics for Engineers (Signals and Systems) (Spring 2013) UoC-CS-430: Digital Communications (Fall 2003) UoC-CS-473: Pattern Recognition (Spring 2003-04) UoC-CS-570: Statistical Signal Processing (Spring 2009-14; Spring 2006-07; Spring 2004) University of Valencia: Statistical and Adaptive Signal Processing (Summer 2009) UThes., UoPatras: Signals and Systems (Spring 2002; Spring 2000) USC-EE-464: Probability Theory for Engineers (Spring 2008) USC-EE-583: Adaptive Signal Processing (Spring 1999-2000; Fall 1997-98) USC-EE-667: Array Signal Processing (Spring 1997) USC-EE-683: Modern Spectral Analysis (Spring 1996) Family Yiota Poirazi Christos, Andreas, and Melina-Polytimi Various Los Angeles Times KCRW, Santa Monica Public Radio Signal Processing Lab © Copyright 2025 Panagiotis Tsakalides. Last updated October 2025.",
  "content_length": 4545,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:41"
}