{
  "name": "Panayiotis Zaphiris",
  "homepage": "https://www.cut.ac.cy/faculties/aac/mga/staff/elected-staff/panayiotis.zaphiris/?languageId=1",
  "status": "success",
  "content": "CYPRUS UNIVERSITY OF TECHNOLOGY ΕΛ EN 20 Years CUT myUni Library Faculties Faculty of Fine and Applied Arts Department of Multimedia and Graphic Arts Staff Elected Panayiotis Zaphiris Faculties Faculty of Fine and Applied Arts Department of Multimedia and Graphic Arts Staff Elected Panayiotis Zaphiris Panayiotis Zaphiris Rector of the Cyprus University of Technology, Professor Department of Multimedia and Graphic Arts rector@cut.ac.cy 25002385 https://ktisis.cut.ac.cy/cris/rp/rp00010 Panayiotis Zaphiris (male) is Professor (Multimedia and Graphic Arts Department) and Rector at CUT. He has a PhD in Human Computer Interaction from the University of Wayne, USA. He is also a graduate of Engineering Systems and Electrical Engineering from the University of Maryland, College Park, USA. Prior to returning to Cyprus, he was a Reader at the Human Computer Interaction Design Center of the City University of London, where he founded and led the City Interaction Lab (funded by the Vodafone Foundation). Prior to City University, he was a researcher at the Gerontology Institute at Wayne University where he [...]took a PhD in Human Computer Interaction (HCI). His research interests are at HCI with an emphasis on participatory design and social aspects of ICTs. Prof Zaphiris has participated in more than 16 funded research projects with a funding of more than 5 million euros. He has published over 250 academic articles in well-known academic journals and international conferences. Recent related research activities include leading the academic management of the Youth Makerspace Larnaka (the 1st Makerspace founded in Cyprus), being the PI of HORIZON 2020 TWINNING project NOTRE. Panayiotis also served on the Board of Directors of RISE (Research Center on Interactive Media Smart Systems and Emerging Technologies - http://www.rise.org.cy) Links: Personal website: http://www.zaphiris.org/ Research Lab: http://cyprusinteractionlab.com/ Panayiotis Zaphiris Τεχνολογικό Πανεπιστήμιο Κύπρου Rector of the Cyprus University of Technology, Professor Panayiotis Zaphiris (male) is Professor (Multimedia and Graphic Arts Department) and Rector at CUT. He has a PhD in Human Computer Interaction from the University of Wayne, USA. He is also a graduate of Engineering Systems and Electrical Engineering from the University of Maryland, College Park, USA. Prior to returning to Cyprus, he was a Reader at the Human Computer Interaction Design Center of the City University of London, where he founded and led the City Interaction Lab (funded by the Vodafone Foundation). Prior to City University, he was a researcher at the Gerontology Institute at Wayne University where he took a PhD in Human Computer Interaction (HCI). His research interests are at HCI with an emphasis on participatory design and social aspects of ICTs. Prof Zaphiris has participated in more than 16 funded research projects with a funding of more than 5 million euros. He has published over 250 academic articles in well-known academic journals and international conferences. Recent related research activities include leading the academic management of the Youth Makerspace Larnaka (the 1st Makerspace founded in Cyprus), being the PI of HORIZON 2020 TWINNING project NOTRE.  Panayiotis also served on the Board of Directors of RISE (Research Center on Interactive Media Smart Systems and Emerging Technologies - http://www.rise.org.cy) Links: Personal website: http://www.zaphiris.org/ Research Lab: http://cyprusinteractionlab.com/ Κύπρος rector@cut.ac.cy 25002385 STAFF SEARCH Academic Staff Administrative Staff Maps University Map Sitemap Virtual Tour Quick Links Student Login eLearning (Moodle) CUT Mail (students and staff on Office365) Password Reset Multi Factor Authentication (MFA) Απομακρυσμένη Πρόσβαση (VPN) cut-radio Intent Europe Direct green@cut Learning Development Network Personal Data Protection Policy Intranet Useful Videos Contact Details ΤΕΧΝΟΛΟΓΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΥΠΡΟΥ 30 Arch. Kyprianos Str. 3036 Limassol 2500 2500 2500 2750 administration@cut.ac.cy Copyright © 2025 CYPRUS UNIVERSITY OF TECHNOLOGY Contact About this website Cookie Policy Digital Logo Files Contact About this website Cookie Policy Digital Logo Files Copyright © 2025 CYPRUS UNIVERSITY OF TECHNOLOGY × Βοηθήστε μας να γίνουμε καλύτεροι! Ποιος ο σκοπός της επίσκεψης σας στο διαδικτυακό μας χώρο;  Ενδιαφέρον για προγράμματα σπουδών Ενδιαφέρον για ερευνητικά προγράμματα Ενδιαφέρον για εκδηλώσεις/ανακοινώσεις Ενδιαφέρον για θέσεις εργασίας Γενικό ενδιαφέρον για το Πανεπιστήμιο Ποια η ιδιότητα σας;  Υποψήφιος φοιτητής Υφιστάμενος φοιτητής Πανεπιστημιακό μέλος ΤΠΚ Πιθανός εξωτερικός συνεργάτης Επισκέπτης γενικού ενδιαφέροντος Ποιο το επίπεδο μόρφωσης σας;  Απόφοιτος Λυκείου Απόφοιτος Πανεπιστημίου/Κολλεγίου Μεταπτυχιακό Διδακτορικό Ποια η εργασιακή σας κατάσταση;  Μαθητής Φοιτητής Άνεργος Δημόσιος Υπάλληλος Ιδιωτικός Υπάλληλος Ποια η ηλικία σας;  15-18 19-25 26-30 30- Ευχαριστούμε για τα σχόλια σας! Ref. 1764569323043 SUBMIT Our website uses cookies Our website uses cookies to ensure its proper functionality, as described here. Agree Required cookies Analytics cookies Disagree Required cookies Analytics cookies Boηθήστε μας να γίνουμε καλύτεροι!",
  "content_length": 5237,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:43"
}