{
  "name": "Pang-Ning Tan",
  "homepage": "http://www.cse.msu.edu/~ptan",
  "status": "success",
  "content": "Welcome to Pang-Ning Tan's Web page Pang-Ning Tan Professor Department of Computer Science & Engineering Michigan State University 428 S Shaw Lane, Room 2129 East Lansing, MI 48824-1226 Email: ptan at msu dot edu Phone: (517) 432-9240 Fax: (517) 432-1061 DMiner Lab Publications Teaching Service General Information: Dr Pang-Ning Tan is a Professor in the Department of Computer Science and Engineering at Michigan State University. He received his M.S. degree in Physics and Ph.D. degree in Computer Science from University of Minnesota. His research interests focus on the development of novel data mining and machine learning algorithms for a broad range of applications, including climate and ecological sciences, cybersecurity, and network analysis. He has more than 200 publications, appearing in conferences and journals such as KDD, ICDM, SDM, AAAI, IJCAI, CIKM, TKDE, and DMKD. He also served as associate editor and program committee chairs for several international journals and conferences. His research has been supported through external grants from the National Science Foundation, Office of Naval Research, Army Research Office, National Aeronautics and Space Administration, National Oceanic and Atmospheric Administration, and National Institutes of Health. Click here for his latest CV, including publications. Introduction to Data Mining (2nd Edition) Pang-Ning Tan, Michael Steinbach, Anuj Karpatne, Vipin Kumar Addison Wesley, ISBN-13: 978-0133128901 Instructor Resources (including sample chapters) Table of Content (2nd Edition) Recent Publications: Farzan Masrour, Francisco Santos, Pang-Ning Tan, and Abdol-Hossein Esfahanian. Fairness-Aware Graph Sampling for Network Analysis In Proc of the 22nd IEEE International Conference on Data Mining, Orlando, FL (2022). Tyler Wilson, Andrew McDonald, Asadullah Galib, Pang-Ning Tan, and Lifeng Luo. Beyond Point Prediction: Capturing Zero-Inflated & Heavy-Tailed Spatiotemporal Data with Deep Extreme Mixture Models . In Proc of ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD 2022), Washington, DC (2022). Asadullah Hill Galib, Andrew McDonald, Tyler Wilson, Lifeng Luo, and Pang-Ning Tan. DeepExtrema: A Deep Learning Approach for Forecasting Block Maxima in Time Series Data . In Proc of the 31st International Joint Conference on Artificial Intelligence (IJCAI 2022), Vienna, Austria (2022). Andrew McDonald, Pang-Ning Tan, and Lifeng Luo COMET Flows: Towards Generative Modeling of Multivariate Extremes and Tail Dependence . In Proc of the 31st International Joint Conference on Artificial Intelligence (IJCAI 2022), Vienna, Austria (2022). Young Anna Argyris, Bidhan Bashyal, Pang-Ning Tan, and Nan Zhang. Using Deep Learning to Identify Linguistic Features that Facilitate or Inhibit the Propagation of Anti- and Pro-Vaccine Content on Social Media . In Proc of IEEE International Conference on Digital Health, Barcelona, Spain (2022). Francisco Santos, Junke Ye, Farzan Masrour, Pang-Ning Tan, and Abdol-Hossein Esfahanian. FACS-GCN: Fairness-Aware Cost-Sensitive Boosting of Graph Convolutional Networks . In Proc of IEEE International Joint Conference on Neural Networks (IJCNN-2022), Padova, Italy (2022). Tyler Wilson, Pang-Ning Tan, and Lifeng Luo. DeepGPD: A Deep Learning Approach for Modeling Geospatio-Temporal Extreme Events . In Proc of the 36th AAAI Conference on Artificial Intelligence (2022). Boyang Liu, Pang-Ning Tan, and Jiayu Zhou. Unsupervised Anomaly Detection by Robust Density Estimation . In Proc of the 36th AAAI Conference on Artificial Intelligence (2022). Pouyan Hatami Bahman Beglou, Lifeng Luo, Pang-Ning Tan, Lisi Pei. Automated Analysis of the US Drought Monitor Maps With Machine Learning and Multiple Drought Indicators. Frontiers in Big Data, 4: 94 (2021). Ding Wang and Pang-Ning Tan. JOHAN: A Joint Online Hurricane Trajectory and Intensity Forecasting Framework. In Proc of ACM SIGKDD Int'l Conf on Data Mining (KDD 2021) (2021). Boyang Liu, Mengying Sun, Ding Wang, Pang-Ning Tan, and Jiayu Zhou. Learning Deep Neural Networks under Agnostic Corrupted Supervision. In Proc of Int'l Conf on Machine Learning (ICML 2021) (2021). Boyang Liu, Ding Wang, Kaixiang Lin, Pang-Ning Tan, and Jiayu Zhou. RCA: A Deep Collaborative Autoencoder Approach for Anomaly Detection. In Proc of 30th International Joint Conference on Artificial Intelligence (IJCAI 2021) (2021). Ding Wang and Pang-Ning Tan. Online LSTM Framework for Hurricane Trajectory Prediction. In Climate Change AI workshop at ICML 2021 (2021). Young Argyris, Kafui Monu, Pang-Ning Tan, Colton Aarts, Fan Jiang, and Kaleigh Wiseley. Using Machine Learning to Compare Provaccine and Antivaccine Discourse Among the Public on Social Media: Algorithm Development Study JMIR Public Health and Surveillance, 7(6):e23105, doi:10.2196/23105 (2021) Farzan Masrour, Pang-Ning Tan, and Abdol-Hossein Esfahanian. Fairness Perception from a Network-Centric Perspective. In Proceedings of the 20th IEEE International Conference on Data Mining, Sorrento, Italy (2020). Saleem Alhabash, Duygu Kanver, Chen Lou, Sandy Smith, and Pang-Ning Tan. Trick or Drink: Offline and Social Media Hierarchical Normative Influences on Halloween Celebration Drinking. Health Communications, doi: 10.1080/10410236.2020.1808406 (2020). Ding Wang, Boyang Liu, and Pang-Ning Tan. Online Learning Algorithm for Hurricane Intensity Prediction. In KDD Workshop on Fragile Earth: Data Science for a Sustainable Planet (2020). Tyler Wilson, Pang-Ning Tan, and Lifeng Luo, Convolutional Methods for Predictive Modeling of Geospatial Data. In Proceedings of the SIAM International Conference on Data Mining (SDM-2020), Cincinnati, OH (2020). Ding Wang, Boyang Liu, Pang-Ning Tan, and Lifeng Luo, OMuLeT: Online Multi-Lead Time Location Prediction for Hurricane Trajectory Forecasting. In Proceedings of 34th AAAI Conference on Artificial Intelligence (AAAI-2020), New York, NY (2020). Farzan Masrour, Tyler Wilson, Heng Yan, Pang-Ning Tan, Abdol-Hossein Esfahanian. Bursting the Filter Bubble: Fairness-Aware Network Link Prediction. In Proceedings of 34th AAAI Conference on Artificial Intelligence (AAAI-2020), New York, NY (2020). Patricia A. Soranno, Kendra Spence Cheruvelil, Boyang Liu, Qi Wang, Pang-Ning Tan, Jiayu Zhou, Katelyn B.S. King, Ian M. McCullough, Joseph Stachelek, Meridith Bartley, Christopher T. Filstrup, Ephraim M. Hanks, Jean-Francois Lapierre, Noah R. Lottig, Erin M. Schliep, Tyler Wagner, and Katherine E. Webster. Ecological prediction at macroscales using big data: Does sampling design matter? Ecological Applications. doi: 10.1002/eap.2123 (2020). Tyler Wagner, Noah Lottig, Meridith Bartley, Ephraim Hanks, Erin Schliep, Nathan Wikle, Katelyn King, Ian McCullough, Joseph Stachelek, Kendra Cheruvelil, Christopher Filstrup, Jean Francois Lapierre, Boyang Liu, Patricia A. Soranno, Pang-Ning Tan, Qi Wang, Katherine Webster, and Jiayu Zhou. Increasing accuracy of lake nutrient predictions in thousands of lakes by leveraging water clarity data. Limnology and Oceanography Letters (2020). Jianpeng Xu, Jiayu Zhou, Pang-Ning Tan, Xi Liu, and Lifeng Luo. Spatio-temporal Multi-task Learning via Tensor Decomposition. IEEE Transactions on Knowledge and Data Engineering, doi:10.1109/TKDE.2019.2956713 (2019). Xi Liu, Tyler Wilson, Pang-Ning Tan, and Lifeng Luo, Hierarchical LSTM Framework for Long-Term Sea Surface Temperature Forecasting. In Proceedings of 6th IEEE International Conference on Data Science and Advanced Analytics (DSAA 2019), Washington, DC (2019). Courtland VanDam, Farzan Masrour, Pang-Ning Tan, and Tyler Wilson. You have been CAUTE! Early Detection of Compromised Accounts on Social Media . In Proceedings of IEEE/ACM International Conference on Social Networks Analysis and Mining (ASONAM 2019), Vancouver, Canada (2019). Farzan Masrour, Pang-Ning Tan, and Abdol-Hossein Esfahanian. OPTANE: An OPtimal Transport Algorithm for NEtwork Alignment. In Proceedings of IEEE/ACM International Conference on Social Networks Analysis and Mining (ASONAM 2019), Vancouver, Canada (2019). Boyang Liu, Pang-Ning Tan, and Jiayu Zhou. Augmented Multi-Task Learning by Optimal Transport. In Proceedings of the SIAM International Conference on Data Mining (SDM 2019), Calgary, Canada (2019). Qi Wang, Claire Boudreau, Qixing Luo, Pang-Ning Tan, and Jiayu Zhou. Deep Multi-view Information Bottleneck. In Proceedings of the SIAM International Conference on Data Mining (SDM 2019), Calgary, Canada (2019). Sarah Collins, Shuai Yuan, Pang-Ning Tan, Sam Oliver, Jean-Francois Lapierre, Kendra Cheruvelil, Emi Fergus, Nicholas Skaff, Joe Stachelek, Ty Wagner, and Patricia Soranno. Winter Precipitation and Summer Temperature Predict Lake Water Quality at Macroscales. Water Resources Research, doi: 10.1029/2018WR023088 (2019). Tyler Wilson, Pang-Ning Tan, and Lifeng Luo. A Low Rank Weighted Graph Convolutional Approach to Weather Prediction. In Proceedings of IEEE International Conference on Data Mining (ICDM 2018), Singapore (2018). Xi Liu, Pang-Ning Tan, Zubin Abraham, Lifeng Luo, and Pouyan Hatami. Distribution Preserving Multi-Task Regression for Spatio-Temporal Data. In Proceedings of IEEE International Conference on Data Mining (ICDM 2018), Singapore (2018). Qi Wang, Pang-Ning Tan, and Jiayu Zhou. Imputing Structured Missing Values in Spatial Data with Clustered Adversarial Matrix Factorization. In Proceedings of IEEE International Conference on Data Mining (ICDM 2018), Singapore (2018). Boyang Liu, Pang-Ning Tan, and Jiayu Zhou. Enhancing Predictive Modeling of Nested Spatial Data through Group-Level Feature Disaggregation. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD 2018), London, England (2018). Jianpeng Xu, Xi Liu, Tyler Wilson, Pang-Ning Tan, Pouyan Hatami, and Lifeng Luo. MUSCAT: Multi-Scale Spatio-Temporal Learning with Application to Climate Modeling. In Proceedings of the 27th International Joint Conferen",
  "content_length": 14492,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:44"
}