{
  "name": "Pankaj Jalote",
  "homepage": "https://www.iiitd.edu.in/~jalote",
  "status": "success",
  "content": "Pankaj Jalote - Home Page Pankaj Jalote Distinguished Professor, IIIT-Delhi (Founding Director 2008 - 2018) Brief Bio Current Projects and Teaching Teaching and Education Monsoon, 2021, teaching a course \"AI for SE\". This is a collaborative teaching effort - so we can collaboratively offer research level courses, which institutions find it hard to offer individually. Monsoon 2020, Winter 2021: Taught a newly designed course: Software Development Using Open Source. This really is software engineering using Open Source Methods and Open Source Software - it combines modern processes and leveraging of the huge OSS resource. Projects currently working on: Enveave: A platform for facilitating environmental initiatives Active Learning and Teaching (ALT) App: An app for use within the lecture for active learning. It allows for short active learning exercises, quick feedback, minute papers to assess student's learning, etc. AICTE Model Curriculum for CSE revision. Chairing the committee for this revision. Certificate program in CS Education. An ambitious program involving dozens of experts from across the country to improve the quality of CS education in the country. ACM 202x CS Curriculum. A member of the steering committee for the CS curriculum revision by ACM and IEEE Books This book provides a comprehensive and holistic view of a research university and discusses the key dimensions of such a university, including education, research, PhD programme, faculty management, governance, financing and third mission. This book will be of interest to academicians, academic leaders, policymakers, and those who are involved in developing a university in India. Preface               Advance Comments More Info More Info More Info More Info More Info Blog Posts Inviting Foreign Universities to Establish Universities in India This topic – of inviting foreign universities to start operations in India – has been a recurrent theme for a couple of decades in discourses on HE in India. Recently, UGC has announced guidelines for foreign universities. There were some earlier attempts also to invite foreign universities, which did not pan out. Let us see […] Continue Reading Teaching in the Hybrid Mode – Initial Experience￼ As discussed in the previous post, when normalcy returns, it is likely that hybrid teaching will be the dominant method for teaching some types of courses. As explained in previous post, in hybrid teaching, the lecture is given to the in-class students, but is also simultaneously streamed to online students, and the taped version is […] Continue Reading Hybrid Teaching Now that familiarity with online is widespread and accepted, given some of its benefits like convenience of attending remotely, having taped lectures available later, etc, it is unlikely that higher education will go back to fully in-person teaching and attending of courses. At the same time in-person has its own advantages, particularly in assessments, and […] Continue Reading Supporting Effective Teaching and Learning Effective teaching needs to be systematically supported in an institution. This needs training for teaching, building feedback loops, and rewarding teaching excellence. Continue Reading Interdisciplinary Education and CS+X Programs Interdisciplinary education is the need of the times. NEP also promotes it. This note discusses how such programs be designed, in particular CS+X programs. Continue Reading Designing the Curriculum for a Degree Program Designing the curriculum of a program is a challenging exercise that needs to be done carefully and rigorously, starting from establishing the objectives of education, to graduates attributes of the program, to designing the individual courses. This note gives an overview of the process. Continue Reading NEP and Financing of Education and Research in HEIs in India￼ An HEI needs funds to support its two primary missions – education and research. NEP provides an opportunity to clearly separate funding for education and funding for research for universities – the vast majority can be nudged to excel in education and the best universities can be motivated to excel in research and reach world levels. Continue Reading Autonomy of Higher Education Institutions and NEP Autonomy is essential for universities to thrive. NEP recommendations are in line with the global practices. Continue Reading Expectations of Prospective Students from a PhD program This is the last of the series of articles on PhD program in India. While the earlier ones focused on the evolution and current state of the PhD program, the desirable objectives and characteristics of a high quality PhD program, what types of careers PhD students are hoping for and what they should do during […] Continue Reading Getting The Most from your PhD Training This post about PhD is from a PhD student perspective – what should he/she do during PhD to launch a strong career. Continue Reading Characteristics of a High Quality PhD program This post is a part of the series of posts on PhD program. The first two discussed the early stages of PhD program, and some recent trends in PhD produce. The previous post discussed the objectives of a PhD program and desired graduated attributes of PhD graduates. All these articles are extracts from my book […] Continue Reading Objectives and Graduate Attributes of a Quality PhD program A PhD program is the backbone of a research university, its most important facet, one which clearly separates it from institutions which focus on teaching. In fact, the basic definition of a research university in the Carnegie Classification Framework for Universities in the US is based on the size of the PhD programs of these […] Continue Reading Recent Trends in PhDs Production The previous note discussed the origins of PhD program in India. This note discusses some aspects of the current situation. (Some of this is from Chapter 1 of the book.) I hope to discuss what a good PhD program should be like in the next post(s). In India, about 1000 universities have degree-granting powers. Most […] Continue Reading PhD Program in India – Early Stages As I mentioned, the book “Building Research Universities in India”is large and only some aspects may be of interest to someone. I hope to regularly post some articles of general interest. They may be based on what is there in the book, augmented with further thoughts or current developments.  In the next few posts, I […] Continue Reading Evolution of Research Universities in India During my Sabbatical in 2019-20, I worked on the book “Building Research Universities in India” (SAGE). The book was published late last year. The book is 400+ pages, and covers a lot of ground. There are many topics explored in the book which can become interesting stand-alone articles for those interested in higher education in […] Continue Reading Why More Students Need to Do PhD and What Can be Done About It I had written this article for The Hindu. It appeared recently – here is the link: they titled it “Think Global Promote Local”. I am posting this full article that I had prepared for them. PhD scholars may particularly find the proposed scheme exiting and useful for them and they should push for it in […] Continue Reading Digital Launch of the book “Building Research Universities in India” Finally, the book “Building Research Universities in India” has been released by SAGE, and is available on Amazon across the world. It is based on my decade long experience in building IIIT-Delhi into a globally respected research university in India. I hope it will have a positive effect on the HE ecosystem in the country. […] Continue Reading Building Research Universities in India – Advance Comments The book is finally going to come out in Nov. The publisher has shared a flier announcing the book , given later in this post- which gives some information about the book. I have been fortunate that many eminent people agreed to give advance comments for the book. I am giving these comments here. I […] Continue Reading Building Research Universities in India – Preface of the Book After finishing my decade long term as Founding Director of IIIT-Delhi, I took a leave of absence to work on a book based on my experience, and do some serious travelling. In 2019, was able to do a good amount of travelling (spent more than 4 months outside Delhi), and also made decent progress on […] Continue Reading Possibilities with New Education Policy Recently, Prof. Philiph Altbach and I wrote an article on the possibilities that may open up with NEP, if indeed it is implemented in true spirit. This article was carried as the lead article in University World News. Prof. Philiph Altbach is one of the most well known researchers and academician in the area of […] Continue Reading Affiliating Model Finally set to Exit as per NEP2020 The new education policy (NEP), which has recently been accepted by the govt, has proposed phasing out of the affiliating model. This has been long overdue – many people have argued for it. I had written two articles on this aspect in Economic Times – Reform the Affiliating University Model (Sept 2009) and Times of […] Continue Reading The New Education Policy (NEP) has Great Suggestions for Higher Education It is heartening that the government has accepted the recommendations of the New Education Policy (NEP). I had studied the higher education (HE) portion of the NEP quite well when researching for my upcoming book (“Building Research Universities in India“, to be published by SAGE, end of this year). I was very impressed with the […] Continue Reading Future of Universities The previous note discusses how education will change after covid. The focus was on how existing education programs in existing universities will change. In this note, we take it further and discuss the future of universities and colleges. Online education was growing even before Covid happened – with Covid, as many more students and universities ",
  "content_length": 37346,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:46"
}