{
  "name": "Panos Parpas",
  "homepage": "http://www.doc.ic.ac.uk/~pp500",
  "status": "success",
  "content": "Panos Parpas - Panos Parpas Professor of Computational and Applied Mathematics Room 357, Huxley Building Department of Computing Imperial College 180 Queen's Gate London SW7 2AZ Email: p.parpas@imperial.ac.uk Phone: +44 (0) 20 7594 8366 Brief bio: I am a Professor of Computational and Applied Mathematics in the Department of Computing at Imperial College London. Before joining Imperial, I was a postdoctoral fellow at MIT. You can find a brief CV here (updated Sept-2024) Research Interests Mathematical Optimization Algorithms as Dynamical Systems Computational Mathematics Scientific Computing Teaching Computational Optimization Computational Finance Computational Finance with C++ Pre-prints Nick Tsipinakis, Panos Parpas Simba: A Scalable Bilevel Preconditioned Gradient Method for Fast Evasion of Flat Areas and Saddle Points C. McMeel, P. Parpas. Uncertainty Quantification for Gradient and Accelerated Gradient Descent Methods on Strongly Convex Functions Daniel Lengyel, Panos Parpas, Nikolas Kantas, Nicholas R. Jennings Curvature Aligned Simplex Gradient: Principled Sample Set Construction For Numerical Differentiation N Tsipinakis, P Tigkas, P Parpas A Multilevel Low-Rank Newton Method with Super-linear Convergence Rate and its Application to Non-convex Problems A Borovykh, N Kantas, P Parpas, G Pavliotis Privacy Risk for anisotropic Langevin dynamics using relative entropy bounds Publications (See also Google scholar) Nick Tsipinakis, Panos Parpas Multilevel Regularized Newton Methods with Fast Convergence Rates SIAM Journal on Scientific Computing, (2025) Daniel Lengyel, Panos Parpas, Boumediene Hamzi, Houman Owhadi Kernel Sum of Squares for Data Adapted Kernel Learning of Dynamical Systems from Data: A global optimization approach Physica D: Nonlinear Phenomena, Volume 478, August 2025 P. Parpas, Corey Mury Predict Globally, Correct Locally:Parallel-in-Time Optimal Control of Neural Networks, Automatica, Volume 171, January 2025 N. Tsipinakis, P. Parpas A Multilevel Method for Self-Concordant Minimization, Journal of Optimization Theory and Applications, September 2024 A. Borovykh, N. Kantas, P. Parpas, G.A Pavliotis Stochastic mirror descent for convex optimization with consensus constraints, SIAM Journal on Applied Dynamical Systems Vol. 23, Iss. 3 (2024) T. Lelièvre, P. Parpas. Using Witten Laplacians to locate index-1 saddle points, SIAM Journal on Scientific Computing, Vol 46, Issue 2 (2024). L. Sharrock, N. Kantas, P. Parpas, G.A Pavliotis. Online parameter estimation for the McKean–Vlasov stochastic differential equation, Stochastic Processes and their Applications, Volume 162, August 2023, Pages 481-546. J.S Campos, R. Misener, P. Parpas Partial Lasserre relaxation for sparse Max-Cut , Optimization and Engineering, Volume 24, pages 1983–2004, (2023) A. Borovykh, D. Kalise, A. Laignelet and P. Parpas Data-driven initialization of deep learning solvers for Hamilton-Jacobi PDEs, IFAC-PapersOnline 55(30)(2022) A. Borovykh, N. Kantas, P. Parpas, G.A Pavliotis. On stochastic mirror descent with interacting particles: convergence properties and variance reduction , Physica D. 418 (2021) 132844 A Borovykh, N Kantas, P Parpas, G Pavliotis On stochastic mirror descent with interacting particles: convergence properties and variance reduction , Proceedings of the 38th International Conference on Machine Learning (ICML 2021) F. Pecci, P. Parpas, I. Stoianov. Sequential convex optimization for detecting and locating blockages in water distribution networks, Journal of Water Resources Planning and Management, Volume 146, Issue 8, May 2020. A. Borovykh, N. Kantas, P. Parpas, G.A Pavliotis. Stochastic Mirror Descent for Fast Distributed Optimization and Federated Learning ,OPT2020: 17th Annual Workshop on Optimization for Machine Learning (2020). C.P. Ho , M. Kocvara, and P. Parpas, Newton-type multilevel optimization method , Optimization Methods and Software, Dec 2019. A. Borovykh, N. Kantas, P. Parpas, G.A Pavliotis. To interact or not? The convergence properties of interacting stochastic mirror descent , Workshop on \"Beyond first-order methods in ML systems\" at 36th International Conference on Machine Learning (ICML) 2020. J.S. Campos, R. Misener, P. Parpas. A multilevel analysis of the Lasserre hierarchy , European Journal of Operational Research, Volume 277, Issue 1, 16 August 2019, Pages 32-41, B. Guler, A. Laignelet, P. Parpas, Towards Robust and Stable Deep Learning Algorithms for Forward Backward Stochastic Differential Equations , Workshop on \"Robust AI in Financial Services: Data, Fairness, Explainability, Trustworthiness, and Privacy\" Neurips 2019. C.P. Ho, P. Parpas. Empirical Risk Minimization: Probabilistic Complexity and Stepsize Strategy , Computational Optimization and Applications, June 2019, Volume 73, Issue 2, pp 387–410. V. Hovhannisyan,Y. Panagakis,P. Parpas, S. Zafeiriou Fast Multilevel Algorithms for Compressive Principle Component Pursuit , SIAM Journal on Imaging Sciences, Vol. 12, No. 1, pp. 624-649, 2019. J. S. Campos Salazar, P. Parpas. A Multigrid approach to SDP relaxations of sparse polynomial optimization problems , SIAM Journal on Optimization, Volume 28, Issue 1, 2018. P. Parpas. A Multilevel Proximal Gradient Algorithm for Large Scale Optimization , SIAM Journal on Scientific Computing, Vol. 39, Issue 5, Nov. 2017. V. Hovhannisyan, P. Parpas, and S. Zafeiriou. MAGMA: Multi-level accelerated gradient mirror descent algorithm for large-scale convex composite minimization , SIAM Journal on Imaging Sciences, 9(4), 1829–1857, 2016. R. Baltean-Lugojan, and P. Parpas. Robust Numerical Calibration for Implied Volatility Expansion Models , SIAM Journal on Financial Mathematics, 2016, 7(1), 917–946. D.V. N. Luong, P. Parpas, D. Rueckert, and Berc Rustem. A weighted Mirror Descent algorithm for nonsmooth convex optimization problem , Journal of Optimization Theory and Applications (2016). Menke, R., Abraham, E., Parpas, P., and Stoianov. I. Demonstrating demand response from water distribution system through pump scheduling, Applied Energy, 2016. Wright, R., Abraham, E., Parpas, P., and Stoianov, I. Control of Water Distribution Networks with Dynamic DMA Topology using Strictly Feasible Sequential Convex Programming, Journal of Water Resources Research, 2015. P. Parpas, B. Ustun, M. Webster and Q.K. Tran. Importance Sampling in Stochastic Programming with MCMC, INFORMS Journal on Computing, Published Online: April 24, 2015, Page Range: 358 - 377 Menke, R., Abraham, E., Parpas, P., and Stoianov, I. Exploring optimal pump scheduling in water distribution networks with branch and bound methods, Water Resources Management, Springer (2015) Menke, R., Abraham, E., Parpas, P., and Stoianov, I. , Approximation of System Components for Pump Scheduling Optimisation. Procedia Engineering Volume 119 pp 1059-1068 DOI, 2015 Wright, R., Abraham, E., Parpas, P., and Stoianov, I. Optimized Control of Pressure Reducing Valves in Water Distribution Networks with Dynamic Topology Procedia Engineering Volume 119 pp 1003-1011, 2015. C.P Ho, P. Parpas. Singularly Perturbed Markov Decision Processes: A Multiresolution Algorithm, SIAM Journal on Control and Optimization, 52(6), 3854-3886, 2014. R. Wright, I. Stoianov, P. Parpas, K. Henderson, J. King. Adaptive Water Distribution Networks with Dynamically Reconfigurable Topology, Journal of Hydroinformatics, November 2014, 16 (6) 1280-1301. P. Parpas, and M. Webster. A stochastic multiscale model for electricity generation capacity expansion, European Journal of Operational Research, Volume 232, Issue 2, Pages 359-374, January 2014. G. Tavares and P. Parpas. On the information-based complexity of stochastic programming, Operations Research Letters, Volume 41, Issue 6, Pages 622-626, November 2013. Wright, R., Stoianov, I. and Parpas, P. Dynamic Topology in Water Distribution Networks Proceedings 12th International Conference on Computing and Control for the Water Industry CCWI2013, 2nd-4th September 2013, Perugia, Italy ISSN:1877-7058 DOI P. Parpas and M. Webster. A Stochastic Minimum Principle and a mesh-free method for Stochastic Optimal Control , Automatica, Volume 49, Issue 6, Pages 1663-1671, June 2013. F.W Kong, P. Parpas, and B. Rustem. Sum of Non-Concave Utilities Maximization for MIMO Interference Systems, IEEE Transactions on Wireless Communications, Volume 12, No 4, Pages 1744-1751, April 2013. M. Webster and Nidhi Santen and P. Parpas. An approximate dynamic programming framework for modeling global climate policy under decision-dependent uncertainty Computational Management Science,Volume 9, Issue 3, pp 339-362. August 2012. Kai Ye, P. Parpas, B. Rustem. Robust portfolio optimization: a conic programming approach, Computational Optimization and Applications, Volume 52, Issue 2, pp 463-481, June 2012. D. V.N. Luong, P. Parpas, D. Rueckert, and B. Rustem Solving MRF Minimization by Mirror Descent. Advances in Visual Computing Lecture Notes in Computer Science Volume 7431, 2012, pp 587-598 P. Kleniati, P. Parpas, B. Rustem. Decomposition-based method for sparse SDP relaxations of polynomial problems, Journal of Optimization, Theory and Applications, Volume 145, Issue 2, pp 289-310, May 2010. D. Kuhn, P. Parpas, B. Rustem, Raquel Fonseca. Dynamic mean-variance portfolio analysis under model risk The Journal of Computational Finance. Volume 12, Number 4, Summer 2009. A. Tsoukalas, P. Parpas, B. Rustem. A smoothing algorithm for finite minmaxmin problems Optimization Letters, Volume 3, Number 1 / January, 2009. P. Parpas, B. Rustem. Convergence analysis of a global optimization algorithm using stochastic differential equations Journal of Global Optimization, Volume 45, Number 1 / September, 2009. P. Parpas, B. Rustem, E.N Pistikopoulos. Global optimization of robust chance constrained problems. Journal of Global Optimization. Volume 43, Numbers 2-3, March, 2009. D. Maringer, P. Parpas. Global Optimization of Higher Order Moments in Portfolio Selec",
  "content_length": 13518,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:47"
}