{
  "name": "Panos Kalnis",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/panagiotis-kalnis",
  "status": "success",
  "content": "Panagiotis Kalnis - Professor, Computer Science - King Abdullah University of Science and Technology Top Home Study Faculty Panagiotis Kalnis Professor, Computer Science Principal Investigator, ‌InfoCloud Computer, Electrical and Mathematical Science and Engineering Division panos.kalnis@kaust.edu.sa InfoCloud Research Group Data is at the foundation of today's human progress. My goal is to design the most practical tools to allow scientific advancement in security and healthcare. Program Affiliations Computer Science Biography Panos Kalnis is a professor of Computer Science at KAUST. He served as chair of the University’s Computer Science program from 2014 to 2018. In 2009, Kalnis was on sabbatical at Stanford University in the United States. Before that, he was an assistant professor at the National University of Singapore.Earlier in his career, Kalnis was involved in designing and testing very-large-scale integration (VLSI) chips at the Computer Technology Institute in Greece. He has also worked for several companies on database design, e-commerce projects, and web applications.Kalnis received his diploma in computer engineering in 1998 from the University of Patras in Greece and his Ph.D. in 2002 from the Hong Kong University of Science and Technology (HKUST).Kalnis served as an associate editor for the IEEE Transactions on Knowledge and Data Engineering from 2013 to 2015 and was on the editorial board of the International Journal on Very Large Data Bases from 2013 to 2017. Research Interests Kalnis' research interests include big data, cloud computing, parallel and distributed systems, large graphs, systems for machine learning. Furthermore, he is interested in computing privacy in order to advance in the fields of data mining, knowledge extraction, security and bioinformatics. supercomputing infoclouds Education Profile PhD Hong Kong University of Science and Technology, 2002MS University of Patras, GreeceBS University of Patras, Greece, 1997 Publications Tao Y., Yi K., Sheng C., Kalnis P., \"Efficient and accurate nearest neighbor and closest pair search in high dimensional space\", (to appear) ACM transactions on Data Base Systems (ACM TODS), 2010.Ghinita G., Kalnis P., Tao Y., \"Anonymous publication of sensitive transactional data\", (to appear) IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE), 2010.Yiu M.L., Ghinita G., Jensen CS., Kalnis P., \"Enabling search services on outsourced private spatial data\", (to appear) Very Large Data Base Journal (VLDBJ), 2010.Ghinita G., Zhao K., Papadias D., Kalnis P., \"A reciprocal framework for spatial K-anonymity\", Information Systems, 35(3), 299-314, 2010.Ghinita G., Karras P., Kalnis P., Mamoulis N., \"A framework for efficient data anonymization under privacy and accuracy constraints\", (to appear) ACM Transactions on Data Base Systems (ACM TODS), 2009.Zhu Z., Kalnis P., Bakiras S., \"DCMP: A Distributed Cycle Minimization Protocol for Peer-to-Peer Networks\", IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), 19(3), 363-377, 2008. Show more Research Areas Computer Science Extreme Computing Multimedia - ORCID - KAUST Repository - KAUST Academic Portal - Scopus",
  "content_length": 3190,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:47"
}