{
  "name": "Panos J. Antsaklis",
  "homepage": "http://www3.nd.edu/~pantsakl",
  "status": "success",
  "content": "Panos J. Antsaklis at Notre Dame UNIVERSITY of NOTRE DAME COLLEGE of ENGINEERING Panos J. Antsaklis Search Site Search Advanced Search… Personal tools Log in Sections Home Home Highlights Awards & Recognitions Interviews & In the News Presentations Downloads Highlighted Publications Books More Biography Brief Biography (PDF) Biography (PDF) Full CV (PDF) Academics Research Publications Graduate Students Resources Mediterranean Control Association Fn & T in Systems & Control Transactions on Automatic Control ISIS Lab Links Seminars and Events Home Panos J. Antsaklis Department of Electrical Engineering University of Notre Dame Notre Dame, IN 46556 antsaklis.1@nd.edu Phone: +1 (574) 631-5792 Fax: +1 (574) 631-4393 Office: 205A Cushing Hall Symposium on Autonomy - Website, Interview Autonomy at ND Highlighted Publications Books Downloads Awards & Recognitions Interviews & In the News Presentations Panos J. Antsaklis Contact Info Email: antsaklis.1@nd.edu Phone: 574-631-5792 Fax: 574-631-4393 Office: 205A Cushing Hall Website: http://www.nd.edu/~pantsakl/ arXiv.org • Math Genealogy • ResearchGate Affiliations Department of Electrical Engineering Professor, H. Clifford and Evelyn A. Brosey Chair Department of Computer Science and Engineering Concurrent Professor Department of Applied and Computational Mathematics and Statistics Concurrent Professor Research Interests The research of AntsaklisGroup focuses on Cyber Physical Networked Embedded Systems and addresses systems, control and automation problems in the interdisciplinary research area of Control, Computing and Communication Networks. This research examines ways to design engineering systems that will exhibit high degrees of autonomy in performing useful tasks. High autonomy and ways to achieve it has been the driving force and the central theme of his research on the control of complex systems. Application areas include transportation, power, manufacturing, and chemical process systems, as well as computer and communication networks. His work includes analysis of behavior and control strategies for complex autonomous, intelligent, learning and reconfigurable systems. It is based on mathematical and data models of continuous, hybrid and discrete event dynamical systems. His recent work on a general theory for the analysis and robust design of Cyber-Physical Systems uses the energy like concepts of passivity (passivity indices) and dissipativity. Courses: Linear Systems, Control Systems, Control Systems Lab, Optimization The Department of Electrical Engineering at the University of Notre Dame",
  "content_length": 2588,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:47"
}