{
  "name": "Panos P. Markopoulos",
  "homepage": "https://www.markopoulos.us",
  "status": "success",
  "content": "P. Markopoulos, PhDSearch this siteEmbedded FilesSkip to main contentSkip to navigationPanagiotis (Panos) Markopoulos, PhDAssociate Professor and Cloud Technology Endowed FellowDepartments of Computer Engineering and Computer ScienceCollege of AI, Cyber and Computing (CAICC)The University of Texas at San AntonioContact InformationAddress: One UTSA Circle, San Antonio, TX 78249E-mail: Panagiotis.Markopoulos@utsa.eduWebsite: https://www.markopoulos.usLab: https://www.milos-lab.org Areas of ExpertiseArtificial intelligence, machine learning, data science, and signal processing, with emphasis in trustworthiness and computational efficiency.Current research topics:Trustworthy (reliable and explainable) artificial intelligenceMachine learning from limited and/or corrupted dataFederated learning with privacy constraintsAdaptive and continual learning in dynamic environmentsMultimodal learning and data fusionQuantum machine learningApplication areas include, among others:Computer vision (image classification, object detection and tracking )Remote sensing (various imagery types including hyperspectral imagery, SAR, electro-optical; modality fusion, image segmentation, object detection and tracking)Wireless communication systems (physical layer modulation, transmit/receive beamforming, spread-spectrum channelization, multi-user channel access, interference avoidance and suppression, direction-of-arrival estimation and source tracking, radar)Healthcare (privacy-aware, limited data, data analytics and inference)Brief BiographyI am an Associate Professor and Cloud Technology Endowed Fellow with the Departments of Computer Engineering (CE) and Computer Science (CS) in the College of AI, Cyber and Computing (CAICC) at The University of Texas at San Antonio (UT San Antonio). I serve as Director of the Machine Learning Optimization and Systems (MILOS) Laboratory and Lead for Trustworthy AI in MATRIX: The UTSA AI Consortium for Human Well-Being. From 2022 to 2025, I held the Margie and Bill Klesse Endowed Associate Professorship in the Department of Electrical and Computer Engineering (ECE) in the Klesse College of Engineering and Integrated Design (KCEID), at UT San Antonio. In 2025, ECE was reorganized into Electrical Engineering (EE, housed in KCEID) and Computer Engineering (CE, housed in CAICC), and I joined CE at CAICC. Prior to UTSA, I was a tenured Associate Professor at the Rochester Institute of Technology (RIT). During the summers of 2018, 2020, and 2021, I was a Visiting Faculty (Independent Contractor) with the U.S. Air Force Research Laboratory (AFRL), Information Directorate, in Rome, NY.My expertise lies in machine learning, artificial intelligence, signal and image processing, and data science. Application domains for my work include wireless communications, computer vision, remote sensing, and healthcare, among others. My research mission is to advance efficient, robust, and trustworthy solutions in these areas. Together with students and collaborators, I have co-authored more than 80 journal and conference articles and three book chapters. My research has been funded by the U.S. National Science Foundation (NSF), the National Geospatial-Intelligence Agency (NGA), the U.S. Air Force Office of Scientific Research (AFOSR), and AFRL. In 2019, I was recognized with the AFOSR Young Investigator Program (YIP) Award. In 2021, I was elevated to IEEE Senior Member.Professional PositionsAssociate Professor and Cloud Technology Endowed FellowDepartment of Computer Engineering (CE), College of AI, Cyber and Computing (CAICC)Department of Computer Science (CS), College of AI, Cyber and Computing (CAICC)The University of Texas at San Antonio (UT San Antonio), San Antonio, TX, 9/2025 – Present.(In 2025, ECE was reorganized into EE, housed in KCEID, and CE, housed in CAICC, and I joined CE at CAICC)Concurrent Roles:Founding Director, Machine Learning Optimization and Systems Laboratory, 2022 – Present.Lead for Trustworthy AI, MATRIX: The UTSA AI Consortium for Human Well-Being, 2024 – Present.Margie and Bill Klesse Endowed Associate ProfessorDepartment of Electrical & Computer Engineering (ECE), Klesse College of Engineering and Integrated Design (KCEID)Department of Computer Science (CS), College of Science (COS)The University of Texas at San Antonio (UT San Antonio), San Antonio, TX, 8/2022 – 9/2025.Concurrent Roles:Founding Director, Machine Learning Optimization and Systems Laboratory, 2022 – Present.Founding Director, Multimodal Sensing and Signal Processing Education Laboratory, 2023 – 2025.Chair, Signal Processing and Learning Concentration, ECE Dept., 2022 – 2025.Co-Lead for Trustworthy AI, MATRIX: The UTSA AI Consortium for Human Well-Being, 2024 – Present.Core Faculty Member, UTSA School of Data Science, 2022 – 2025 (SDS became part of CAICC).Associate Professor (with Tenure)Department of Electrical and Microelectronic Engineering, Kate Gleason College of Engineering (KGCOE)Rochester Institute of Technology (RIT), Rochester, NY, 2021 – 8/2022.Concurrent Roles:Director, Machine Learning Optimization & Signal Processing (MILOS) LabCore Faculty, RIT Center for Human-aware Artificial Intelligence (CHAI)Extended Faculty, PhD Program in Computing and Information SciencesExtended Faculty, PhD Program in Mathematical ModelingMember, RIT Faculty Senate (2021-2022)Assistant Professor (Tenure-Track)Department of Electrical and Microelectronic Engineering, Kate Gleason College of Engineering (KGCOE)Rochester Institute of Technology, Rochester, NY, 2015 – 2022.Visiting Faculty (Independent Contractor)Visiting Faculty Research Program, U.S. Air Force Research Laboratory (AFRL), Information Institute, Rome, NY, Summers of 2018, 2020, 2021.Graduate Research AssistantDepartment of Electrical Engineering, The State University of New York at Buffalo (UB), Buffalo, NY, 2011 – 2015.EducationPh.D., Electrical EngineeringState University of New York at Buffalo, Buffalo, NY, 2015Dissertation: “Optimal Algorithms for L1-norm Principal Component Analysis: New Tools for Signal Processing and Machine Learning with Few and/or Faulty Training Data.”M.S., Electronic and Computer EngineeringTechnical University of Crete, Chania, Greece, 2012Thesis: “Full-rate Differential M-PSK Alamouti Modulation with Polynomial-complexity Maximum-likelihood Noncoherent Detection.”Engineering Diploma (5-year program), Electronic and Computer EngineeringTechnical University of Crete, Chania, Greece, 2010Thesis: “Maximum-Likelihood Noncoherent M-PSK OSTBC Detection with Polynomial Complexity.”© Copyright 2025 Panagiotis MarkopoulosGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 6674,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:46"
}