{
  "name": "Panos K. Chrysanthis",
  "homepage": "http://panos.cs.pitt.edu",
  "status": "success",
  "content": "Panos K. Chrysanthis Panos K. Chrysanthis (Πάνος Κ. Χρυσάνθης) Professor of Computer Science Director of Advanced Data Management Technologies Lab Department of Computer Science, School of Computing and Information University of Pittsburgh Learn more Biography Panos Kypros Chrysanthis is a Professor of Computer Science and a founder and director of the Advanced Data Management Technologies Laboratory at the University of Pittsburgh. He is also an adjunct Professor at Carnegie-Mellon University and at the University of Cyprus. He received his BS degree (Physics with concentration in Computer Science, 1982) from the University of Athens, Greece. He earned his MS and PhD degrees (Computer and Information Sciences, 1986 and 1991) from the University of Massachusetts at Amherst. His research interests lie within the areas of data management (Big Data, Databases, Data Streams & Sensor networks), distributed & mobile computing, workflow management, operating systems and real-time systems. In 1995, he was a recipient of the U.S. National Science Foundation CAREER Award for his investigation on the management of data for mobile and wireless computing. His editorial service includes VLDB J (2001-2007), IEEE TKDE (2012-2017) and DAPD (2011-present). Chrysanthis is an ACM Distinguished Scientist and a Senior Member of IEEE. He was honored with seven teaching awards and in 2015, he received the University of Pittsburgh's Provost Award for Excellence in Mentoring (doctoral students). Curriculum vitae Celebrating 25 years of ADMT Lab (1996-2021). [09/2021] Celebrating 30 years as a proud UMass, Amherst Alumnus (PhD, 1991); Celebrating 30 years as a professor at Pitt (1991-2021). [09/2021] Honorary Visiting Professor of Computer Science at the University of Diaspora of the University of Cyprus. [7/2021] Honorary Visiting Professor of Computer Science at the University of Diaspora of the University of Cyprus. [4/2018] General Co-Chair of The 12th International Workshop on Real-Time Business Intelligence & Analytics (BIRTE 2018) co-located with VLDB 2018 in Rio de Janeiro, Brazil. [02/2018] The first acceptance of 2018: SlickDeque @ EDBT 2018 in Vienna. [12/2017] My first three generation journal paper: Humaira Ehsan, Mohamed Sharaf and P. K. Chrysanthis, \"Efficient Recommendation of Aggregate Data Visualizations.\" [11/2017] Very Pround of my lab and my students' presentations at VLDB 2017 in Munich. [9/2017] 2017 Keynote Speaker at The Twenty-Ninth International Conference on Software Engineering and Knowledge Engineering on July 6, 2017. His keynote was on “User-centric Techniques for Big Data Exploration”. [7/2017] New $1.8M U01 NIH Grant titled \"Systems Level Causal Discovery in Heterogeneous TOPMed Data\". [4/2017] Officially the Program Co-Chair of IEEE ICDE 2018 . [4/2017] New NSF Award supporting Student Travel Awards to attend VLDB BIRTE 2017. [4/2017] Speaker in Computer Science Department Seminar of the University of Missouri Science & Technology Computer Science Department on April 3, 2017. The topic was Data-driven Serendipity Navigation in Urban Places. [4/2017] Co-Chair of The 11th International Workshop on Enabling Real-Time Business Intelligence & Analytics (BIRTE 2017) co-located with VLDB 2017 in Munich, Germany. [01/2017] Guest speaker at the Software Seminar of the University of Michigan's Computer Science Department on December 19, 2016. The topic was Data-driven Serendipity Navigation in Urban Places. [12/2016] Two new papers in IEEE BigData 2016: REQUEST & ARGO. [12/2016] The new School of Computing and Information is a reality!! It was approved by the University of Pittsburgh Board of Trustees on October 28, 2016 and starts operations July 1, 2017; first students admitted Fall 2017. [10/2016] New NSF Award focusing on Big Data. [9/2016] Yesterday's News Selected Recent Publications [DBLP] [ADMT Lab] [Google Scholar] [ACM DL] [Research Gate] EDBT 2018 SlickDeque: High Throughput and Low Latency Incremental Sliding-Window Aggregation IEEE TKDE 2017 Efficient Recommendation of Aggregate Data Visualizations ICDE 2016 MuVE: Efficient Multi-Objective View Recommendation for Visual Data Exploration Planar: Parallel Lightweight Architecture-Aware Adaptive Graph Repartitioning BigData2016 REQUEST: A Scalable Framework for Interactive Construction of Exploratory Queries ARGO: Architecture-Aware Graph Partitioning VLDB Journal 2016 Avoiding class warfare: managing continuous queries with differentiated classes of service EDBT 2016 PARAGON: Parallel Architecture-Aware Graph Partition Refinement Algorithm IGSC2016 Holistically Evaluating the Environmental Impacts in Modern Computing Systems MDM 2016 MPG: Not so Random Exploration of a City All Publications Teaching UNDERGRADUATE COURSES CS 1555: Database Management Systems (1992-2016) & Current Term CS 1566: Introduction to Computer Graphics (2001-2002) CS 132: Programming in C and Introduction to UNIX (1992-1997) GRADUATE COURSES CS 2550: Principles of Database Systems (1992-2015, 2017) & Current Term CS 2555: Transaction-Oriented Computing (1995) CS 3110, CS 3550, CS 3551: PhD Seminars • Mobile Computing, Spring ’97, ’01, ’04 • Internet Middleware, Fall ’00 • Network-Centric Data Base Servers, Spring ’99 • Advances in Management of Data, Fall ’92 • Data in Crisis Management, Fall ’05 • Data Stream Management Systems, Fall ’08 • Data Management on the Cloud, Fall ’10 • In-Memory Distributed Data Processing, Fall ’15 Short Courses Service Professional Activities ICDE 2018: Program Co-Chair HDMS 2018: General Co-Chair BIRTE 2016: Program Co-Chair MDM 2018: Research Program Committee member ICDE 2017: Research Program Committee member & PhD Symposium VLDB 2017: Research Program Committee member MDM 2017: Research Program Committee member IoTDI 2017: Research Program Committee member ICDCS 2016: Research Program Committee member EDBT 2016: Research Program Committee member & Session Chair DAPD: Distributed and Parallel Databases, An International Journal Special Issues Coordinator, 2017- IEEE TKDE: Transactions on Knowledge and Data Engineering Associate Editor, 2012-2017 DAPD: Distributed and Parallel Databases, An International Journal Associate Editor, 2011-2017 IJNGC: International Journal of Next-Generation Computing, Associate Editor, 2011- Pittsburgh DataWorks: Advisory Committee, 2011- University Activities Senate Budget Policies Committee, 2016-2019 CSD: Chair of Graduate Programs and Exams, 2016-2017 University Honors College: Faculty Advisory Board, 2014-2016 CSD: Director of Graduate Studies, 2013-2014 CSD: Chair of CSD Web Site & Public Relations, 2008-2015 Curriculum vitae Contact Office Hours Tuesday / Thursday 3:00 - 4:30 pm Office: Sennott Square Building, Room 6421 (SENSQ 6421) Address 210 S. Bouquet Street Department of Computer Science University of Pittsburgh Pittsburgh, PA 15260-9161 USA Email: panos at cs dot pitt dot edu Phone: +1-412-624-8924 Fax: +1-412-624-8854",
  "content_length": 6959,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:48"
}