{
  "name": "Panos Louvieris",
  "homepage": "https://www.brunel.ac.uk/people/panos-louvieris",
  "status": "success",
  "content": "Professor Panos Louvieris | Introduction | Brunel University London Skip to Content Home People Professor Panos Louvieris Professor Panos LouvierisProfessor - Information System Wilfred Brown Building 211 Email: panos.louvieris@brunel.ac.uk Tel: +44 (0)1895 265832 Computer Science College of Engineering, Design and Physical Sciences Summary Panos Louvieris is Professor of Information Systems and leads the Defence & Cyber Security (DCS) research group in the Department of Computer Science at Brunel University London and co-director of the Brunel Intelligent Digital Economy and Society (IDEAS) Research Centre. His research interests are data and information fusion, defence and cyber security analytics, and computational finance in the digital economy. He is co-director of the Trusted Open Models Institute (TOMI) at the Hartree Centre concerning the assurance of AI computational models. He is a committee member of the EPSRC Digital Personhood Network. In addition, he is a member of EPSRC ITaaU+ Network and NEMODE+ Network. Newest selected publications Mahmood, I., Arabnejad, H., Suleimenova, D., Sassoon, I., Marshan, A., Serrano, A., Louvieris, P., Anagnostou, A., Taylor, S., Bell, D. and Groen, D. et al. (2020) 'FACS: A geospatial agent-based simulator for analyzing COVID-19 spread and public health measures on local regions'. Journal of Simulation, 16 (4). pp. 355 - 373. ISSN: 1747-7778 Open Access Link Journal article Louvieris, P. and Ikwu, R. (2019) 'Monitoring ‘Cyber-Related’ Discussions in Online Social Platforms.'. International Journal on Cyber Situational Awareness, 4 (1). pp. 69 - 98. ISSN: 2057-2182 Journal article Ikhalia, E., Serrano, A., Bell, D. and Louvieris, P. (2019) 'Online Social Network Security Awareness: Mass Interpersonal Persuasion using a Facebook App'. Information Technology and People, 32 (5). pp. 1276 - 1300. ISSN: 0959-3845 Open Access Link Journal article Ioannou, G., Louvieris, P. and Clewley, N. (2019) 'A Markov Multi-phase Transferable Belief Model for Cyber Situational Awareness'. IEEE Access, 7. pp. 39305 - 39320. ISSN: 2169-3536 Open Access Link Journal article Al-Shamisi, A., Louvieris, P., Al-Mualla, M. and Mihajlov, M. (2016) 'Towards a theoretical framework for an active cyber situational awareness model'.International Conference on Systems, Signals and Image Processing (IWSSIP). Bratislava, Slovakia. 4 - 25 May. IEEE. pp. 1 - 6. ISSN: 2157-8672 Open Access Link Conference paper More publications(25)",
  "content_length": 2482,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:47"
}