{
  "name": "Panpan Cai",
  "homepage": "https://cindycia.github.io",
  "status": "success",
  "content": "Cai Panpan's Home Page Search Recent service I am serving as an associate editor (AE) for ICRA 2023. Homepage New T-RO paper Closing the Planning-Learning Loop with Application to Autonomous Driving in a Crowd. Paper Best paper finalist at CoRL 2022 LEADER: Learning Attention over Driving Behaviors for Planning under Uncertainty. Paper Presented at ICRA 2022 GAMMA: A General Agent Motion Model for Autonomous Driving. Paper WIPL 2021 I co-organized the RSS 2021 Workshop on Integrating Planning and Learning (WIPL). Website Presented at RSS 2021 MAGIC: Learning Macro-Actions for Online POMDP Planning using Generator-Critic. Paper Past lecturing I have co-lectured graduate-level robotics courses at NUS on sampling-based motion planning, POMDP plannig, and robot system architectures. Previous Next Panpan Cai Associate Professor Shanghai Jiao Tong University (SJTU) Biography I am a roboticist. I am currently an associate professor in Shanghai Jiao Tong University (SJTU), China. Prior to that, I was a postdoctoral research fellow supervised by Prof. David Hsu at the Department of Computer Science, National University of Singapore. I received my PhD degree from the Nanyang Technological University. I have been focusing on tackling large-scale decision making problems in robotics that involve complex environments, uncertainties and long-term planning. My research interests include robot motion planning, decision making, robot learning, parallel computing, and their applications to autonomous driving in crowded environments. My goal is to enable robots to seamlessly interact with humans in crowded, chaotic environments and accomplish complex tasks. Please see this video for a 3-min introduction of my recent research, or see my research statement and CV for details. Interests Robot planning and decision making Robot learning Integrate planning and learning Autonomous driving in crowed traffic Parallel computing Education PhD in Robotics, 2016 Nanyang Technological University, Singapore Bsc in Computational Mathematics, 2011 ChuKoChen Honors College, Zhejiang University, China Experience Associate Professor Shanghai Jiao Tong University Aug 2022 – Present Shanghai, China Research topics: Integrating planning and learning Planning under uncertainty Autonomous driving Robot manipulation Senior Research fellow National University of Singapore Dec 2021 – Jan 2022 Singapore Research topics: Integrating planning and learning Behaviour modeling of traffic agents Research fellow National University of Singapore Feb 2017 – Dec 2021 Singapore Research topics: Autonomous driving in crowded environments Behaviour modeling of traffic agents Massive parallelization for real-time planning under uncertainty Integrating planning and learning for large-scale decision making under uncertainty. PhD Nanyang Technological University Aug 2011 – Dec 2016 Singapore Research topics: GPU-based collision detection in complex environments Massively parallel path planning in complex industrial environments Undergraduate student Zhejiang University Aug 2007 – Jun 2011 China Specifications: Top students selected to the ChuKoChen Honors College. Trained on Mathematics and Scientific Computing. Selected Publications Panpan Cai, David Hsu August 2023 IEEE Transactions on Robotics Closing the Planning-Learning Loop with Application to Autonomous Driving Real-time planning under uncertainty is critical for robots operating in complex dynamic environments. Consider, for example, an autonomous robot vehicle driving in dense, unregulated urban traffic of cars, motorcycles, buses, etc.. The robot vehicle has to plan in both short and long terms, in order to interact with many traffic participants of uncertain intentions and drive effectively. Planning explicitly over a long time horizon, however, incurs prohibitive computational cost and is impractical under real-time constraints. To achieve real-time performance for large-scale planning, this work introduces a new algorithm Learning from Tree Search for Driving (LeTS-Drive), which integrates planning and learning in a closed loop, and applies it to autonomous driving in crowded urban traffic in simulation. Specifically, LeTS-Drive learns a policy and its value function from data provided by an online planner, which searches a sparsely-sampled belief tree; the online planner in turn uses the learned policy and value functions as heuristics to scale up its run-time performance for real-time robot control. These two steps are repeated to form a closed loop so that the planner and the learner inform each other and improve in synchrony. The algorithm learns on its own in a self-supervised manner, without human effort on explicit data labeling. Experimental results demonstrate that LeTS-Drive outperforms either planning or learning alone, as well as open-loop integration of planning and learning. PDF Cite Mohamad H. Danesh*, Panpan Cai* (corresponding author), David Hsu December 2022 Conference on Robot Learning (CORL) (Best paper finalist) LEADER: Learning Attention over Driving Behaviors for Planning under Uncertainty Uncertainty on human behaviors poses a significant challenge to autonomous driving in crowded urban environments. The partially observable Markov decision processes (POMDPs) offer a principled framework for planning under uncertainty, often leveraging Monte Carlo sampling to achieve online performance for complex tasks. However, sampling also raises safety concerns by potentially missing critical events. To address this, we propose a new algorithm, LEarning Attention over Driving bEhavioRs (LEADER), that learns to attend to critical human behaviors during planning. LEADER learns a neural network generator to provide attention over human behaviors in real-time situations. It integrates the attention into a belief-space planner, using importance sampling to bias reasoning towards critical events. To train the algorithm, we let the attention generator and the planner form a min-max game. By solving the min-max game, LEADER learns to perform risk-aware planning without human labeling. PDF Cite Yuanfu Luo*, Panpan Cai* (co-first and corresponding author), Yiyuan Lee, David Hsu February 2022 Robotics and Automation Letter GAMMA: A General Agent Motion Model for Autonomous Driving This paper presents GAMMA, a general motion prediction model that enables large-scale real-time simulation and planning for autonomous driving. GAMMA models heterogeneous, interactive traffic agents that operate under diverse road conditions, with various geometric and kinematic constraints. GAMMA treats the prediction task as constrained optimization in traffic agents’ velocity space. The objective is to optimize an agent’s driving performance, while obeying all the constraints resulting from the agent’s kinematics, collision avoidance with other agents, and the environmental context. Further, GAMMA explicitly conditions the prediction on human behavioral states as parameters of the optimization model, in order to account for versatile human behaviors. We evaluated GAMMA on a set of real-world benchmark datasets. The results show that GAMMA achieves high prediction accuracy on both homogeneous and heterogeneous traffic datasets, with sub-millisecond execution time. Further, the computational efficiency and the flexibility of GAMMA enable (i) simulation of mixed urban traffic at many locations worldwide and (ii) planning for autonomous driving in dense traffic with uncertain driver behaviors, both in real-time. The open-source code of GAMMA is available online. PDF Cite Code Dataset Yiyuan Lee, Panpan Cai, David Hsu July 2021 Robotics: Science & Systems MAGIC: Learning Macro-Actions for Online POMDP Planning using Generator-Critic When robots operate in the real world, they need to handle uncertainties in sensing, acting, and the environment dynamics. Many tasks also require reasoning about long-term consequences of robot decisions. The partially observable Markov decision process (POMDP) offers a principled approach for planning under uncertainty. However, its computational complexity grows exponentially with the planning horizon. We propose to use temporally-extended macro-actions to cut down the effective planning horizon and thus the exponential factor of the complexity. We propose Macro-Action Generator-Critic (MAGIC), an algorithm that learns a macro-action generator using feedback from a planner, and in turn uses the learned macro-actions to condition long-horizon planning. Importantly, the generator is learned to directly maximize the down-stream planning performance. We evaluate MAGIC on several long-term planning tasks, showing that it significantly outperforms planning using primitive actions and hand-crafted macro-actions in both simulation and on a real robot. PDF Cite Code Panpan Cai*, Yiyuan Lee* (co-first author), Yuanfu Luo, David Hsu September 2020 Presented at ICRA 2020 SUMMIT: A Simulator for Urban Driving in Massive Mixed Traffic Autonomous driving in an unregulated urban crowd is an outstanding challenge, especially, in the presence of many aggressive, high-speed traffic participants. This paper presents SUMMIT, a high-fidelity simulator that facilitates the development and testing of crowd-driving algorithms. By leveraging the open-source OpenStreetMap map database and a heterogeneous multi-agent motion prediction model developed in our earlier work, SUMMIT simulates dense, unregulated urban traffic for heterogeneous agents at any worldwide loca- tions that OpenStreetMap supports. SUMMIT is built as an extension of CARLA and inherits from it the physical and visual realism for autonomous driving simulation. SUMMIT supports a wide range of applications, including perception, vehicle control and planning, end-to-end learning. We provide a context-aware planner together with benchmark scenarios and show that SUMMIT generates complex, realistic traffic behaviors in challenging crowd-driving settings. PDF Cite Co",
  "content_length": 16702,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:47"
}