{
  "name": "Paolo Giorgini",
  "homepage": "http://disi.unitn.it/~pgiorgio",
  "status": "success",
  "content": "Paolo Giorgini Prof. Paolo Giorgini Head of the Department Information Engineering and Computer Science University of Trento Via Sommarive 9 I-38050, Povo (Trento) - Italy Tel. +39-0461-282052 paolo.giorgini[at]unitn.it Since 2019, head of the Information Engineering and Computer Science Department at University of Trento and, previously, founder and head of the Doctorate Program in Indastrial Innovation (2018-2019), head of the International Doctoral School on ICT (2016-2018), and coordinator of the Software Engineering,  Formal Methods, and Security research group (2012-2018). My current research interests lie in the area of Agent and Goal-Oriented Software, Real-Time Software Agents, Security Engineering and multi-view modeling and cross-view reasoning. I was co-founder of the International Journal of Agent-oriented Software Engineering and I contributed to the organization of many international events. In 2015, I have been awarded of the 10 years Most Influential Paper at the 2015 Requirements Engineering Conference - paper and presentation . You can get at my publications and my research page if you want to find out more (though not updated). H-index, citations and more at  my Google Scholar citation profile. Short Bio. PhD in Computer Science at University of Ancona (1998); research fellow at University of Macerata (1998); Post-Doc the Mechanized Reasoning Group at Economics and Management Department; (1998-2002); Assistant Professor (2002-2012), Associate Professor (2012-2018), and Full Professor (2018-now) at the Information Engineering and Computer Science Department of University of Trento. Visiting researcher at the Computer Science Department of University of Toronto (2000) and at the Software Engineering Department of University of Technology, Sydney (2005). Research Publications Projects Teaching Students",
  "content_length": 1850,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:53"
}