{
  "name": "Paolo Ferragina",
  "homepage": "http://pages.di.unipi.it/ferragina",
  "status": "success",
  "content": "Paolo Ferragina --- Home Page Paolo Ferragina Homepage menu: Homepage Curriculum Papers Teaching Paolo Ferragina Full Professor Department of Computer Science University of Pisa Largo Bruno Pontecorvo 3, I-56127 Pisa, Italy. email: paolo.ferragina(AT)unipi.it skype: paolo.ferragina linkedin: my profile Highlights I'm leading the Advanced Algorithms and Application Lab (Acube), located at the Department of Computer Science, University of Pisa. We design and implement algorithms for compressing, indexing, searching and mining Big Data. We had/have collaborations on these themes with Senseable City Lab at MIT (Boston, USA), Pinello Lab at Harvard and MassGeneral Hospital (Boston, USA), European Broadcasting Union (EBU), Google (Zurich), Bloomberg (London), ST Microelectronics, Tiscali (Istella's search engine), Yahoo! Research (Barcelona), ENEL Foundation, CERVED Group, Bassilichi, Spazio Dati. I've got some international awards for my research activities, some follow: 2023 ESA Test of Time Award, assigned by the European Symposium on Algorithms (ESA) for the paper on \"Engineering a Lightweight Suffix Array Construction Algorithm\", Procs ESA 2002 and Algorithmica 2004. 2023 CIKM Test of Time Award, assigned by the ACM Conference on Information and Knowledge Management (CIKM) for the paper on TAGME (paper, software), 2023. ACM Paris Kanellakis from Theory to Practice award, from the Association of Computing Machinery (USA), 2022. Google Cloud Research Innovator program, 2022. \"Cherub\" (Cherubino), from the University of Pisa, 2019. Three Google research awards in 2010, 2012 and 2016. A 5-year Yahoo! research award from 2007 to 2010. The \"Philip Morris Award on Science and Technology\", 1997; The \"EATCS Doctoral Dissertation Thesis Award\", from the EATCS Italian Chapter, 1997. About my research [updated on Jan 2023]: my h-index is 38 on Scopus (with more than 6k citations) and 42 on Google Scholar (with more than 11k citations), and concerns with the following five main lines which are detailed below: Compressed and Learned Data Structures, Data Compression, Search Engines, Sports Analytics. I'm currently serving under the following duties: Member of the Steering Committee of the SIAM Symposium on Algorithm Engineering and Experiments (ALENEX), 2024-2028. Member of the Board of the PhD in Computer Science of the University of Pisa (since 2002), Member of the Board of the Italian National PhD program in Artificial Intelligence for Society of the University of Pisa (since 2013/14, cycle 39), Member of the Scientific Committee of the CNR Department on \"Engineering, ICT, and Technologies for Energy and Mobility\" (since 2023), co-Director of the J.T. Schwartz International School for Scientific Research, topic \"Computational Complex and Social Systems\" (since 2016), Member of the Editorial Board of the Journal on Graph Algorithms and Applications (JGAA) (since 2011). Area Editor of the Encyclopedia of Algorithms (Springer, Editor Ming-Yang Kao, 2016), and of the Encyclopedia of Big Data Technologies (Springer, Editor Zomaya and Sakr, 2018). Member of the Advisory Board of the Master in \"Big Data Analytics & Artificial Intelligence for Society\", promoted by University of Pisa and CNR, and with the support of Scuola Superiore Sant'Anna and Scuola Normale Superiore. I'm proud to have served my University as: Vice-Rector on ICT (2019-2022). President of the PhD in Computer Science which is a joint initiative of the Universities of Pisa, Florence and Siena (2017-2020); Vice-rector on \"Applied Research and Innovation\" (2010-2016); President of the IT Center (which is a competence center about Cloud and HPC for Dell and Intel, Xeonphi Centre for Intel, 2009-2016); Vice-chairman of the Department of Computer Science (2006-2010). Books Pearls of Algorithm Engineering (Cambridge University Press, 2023) ** Errata corrige ** Computational Thinking: First Algorithms, Then Code (Springer, 2018) Il pensiero computazionale. Dagli algoritmi al coding (Il Mulino, 2017) Elementi di crittografia (Pisa University Press, 2015) Crittografia. Principi, algoritmi, applicazioni (Boringhieri, 2001) Computational Thinking: First Algorithms, Then Code (second edition, Springer, 2024) Research I published more than 180 peer reviewed papers in international journals and conferences. On Jan 2023, my h-index is 38 on Scopus (with more than 6k citations) and 42 on Google Scholar (with more than 10k citations). See DBLP for an updated list of my most recent publications. My research got the following main awards: \"Best Land Transportation Paper Award\" from IEEE Vehicular Technology Society (1995); \"EATCS Doctoral Dissertation Thesis Award\" (1997); \"Philip Morris Award on Science and Technology\" (1997); \"Research Capital award\" from the University of Pisa (2002); Yahoo! faculty award (2007-2010); Working Capital Award (2010); Google research award (2010, 2012 and 2016); Bloomberg Data Science research grant (2017), Google Cloud Research Innovator program (2022), ACM Paris Kanellakis from Theory to Practice award (2022), CIKM 2023 Test of Time award for his paper on TagME (2023). I got accepted For the Patents: five in US (owned by Lucent, University of Pisa and Rutgers, Yahoo!, New York University, Catalog Technologies), one in Italy (owned by University of Pisa, code = 102021000014069), and three more are pending in the USA (owned by Yahoo!, and University of Pisa). For the journals: 5 Journal of the ACM, 3 SIAM Journal on Computing, 4 ACM Transactions on Algorithms, 7 Algorithmica, 7 Theoretical Computer Science, 2 ACM Trans. on Information Systems, etc.; For the conferences: 3 ACM STOC, 5 IEEE FOCS, 7 ACM-SIAM SODA, 13 ESA, 6 WWW, 3 ACM WSDM, etc. About my research topics, they address four main lines: Data Compression: In the period June 2016 - December 2020 Google was supporting our research on Information Theory and Data Compression, which last since 15 years. The project was called \"An algorithmic analysis of Brotli to personalized data compression\", which got a Google Faculty Award (2016). Our contribution to the design of Brotli, which is one of the compressors used in many browsers and applications worldwide (e.g. Chrome), is described in the paper I co-authored with Jyirki Alakuijala and his Googlers group, published in ACM TOIS 4:2018. Compressed and Learned Data Structures: Yahoo! Research sponsored my promotion to full professor from 2007 to 2011, awarding my research on compressed data structures. Among these results, I mention the FM-index that got the ACM Kanellakis Award in 2022 (see above). Very recently, I moved my attention to the interplay between Machine Learning and Data Compression, also thanks to the support by MIUR PRIN 2017, and started to design and develop data structures that successfully address the new issues posed by modern applications. A first example is the PGM index. Search Engines and Information Retrieval: I've got two Google research awards, in 2010 and 2012, and one Bloomberg Research Grant, in 2017 (round 4), on designing and applying a novel Semantic Annotation technology, known as TAGME (which got the 2023 CIKM Test of Time Award, see above, and won the ERD Challenge at SIGIR 2014), to several IR problems: Classification (ECIR 12), Clustering (WSDM 12), Social Network Analysis (ICWSM 15) and Query Disambiguation (WWW '16). For further information on the suite of entity-linking tools we developed in those years, please look at the Web API publicly available at the SoBigData Platform. Sports Analytics: We are developing algorithms and AI techniques for the evaluation of performance of soccer players or the planning of soccer matches based on Big Data provided to us by Wyscout. Our first result is PlayeRank, a data-driven framework that offers a principled multi-dimensional and role-aware evaluation of the performance of soccer players. PlayeRank has been designed and evaluated on a massive dataset of millions of events pertaining to four seasons of the five prominent European leagues, showing that it is the state-of-the art. Starting from these scientific achievements I co-founded in 2018 the start-up PlayeRank, which currently is a spin-off of the University of Pisa. (Other) Recent Projects and Committees Member of the Scientific Committee of the collaboration between University of Pisa and the \"Fondazione Toscana Life Sciences\" (June 2020 - December 2022). Member of the Scientific Committee of the \"Fondazione Innovazione e Sviluppo Imprenditoriale\" of the Camera Commercio di Pisa (January 2017 - December 2022). Member of the 2019 ERC Panel Committee for PE6 - Computer Science and Informatics. Member of the Editorial Board of the Journal on Graph Algorithms and Applications (JGAA), since 2011. Area Editor of the Encyclopedia of Algorithms (Springer, Editor Ming-Yang Kao, 2016), and of the Encyclopedia of Big Data Technologies (Springer, Editor Zomaya and Sakr, 2018). co-Director of the Lipari PhD School on on Computational Complex and Social Systems, Lipari (Italy), since 2014. Member of the Steering Committee of the European Symposium on Algorithms (ESA), 2012-2014. The Acube Lab had/has collaborations on Algorithmics for BigData with Senseable City Lab at MIT (Boston, USA), Pinello Lab at Harvard and MassGeneral Hospital (Boston, USA), Google (Zurich), Bloomberg (London), European Broadcasting Union (EBU), ST Microelectronics, Tiscali (Istella's search engine), Yahoo! Research (Barcelona), ENEL Foundation, CERVED Group, Bassilichi, Spazio Dati. Currently, he is: PI of the project on \"Large scale compression of software source code\" developed in collaboration with Roberto di Cosmo and Stefano Zacchiroli for the Software Heritage project (since 2022). PI of the project on \"Biological Knowledge Graphs and AI for BioMed applications\" developed in collaboration with FerroLab (University of Catania), selected in the 2022 Google Cloud Research Innovators program. Partner of the HumanE-AI project (call H2020-ICT-2019-",
  "content_length": 19258,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:53"
}