{
  "name": "Paolo Tonella",
  "homepage": "http://www.inf.usi.ch/faculty/tonella",
  "status": "success",
  "content": "Paolo Tonella Paolo Tonella Paolo Tonella is Professor of Software Engineering and Director of the Software Institute at the Faculty of Informatics, Università della Svizzera italiana (USI), in Lugano, Switzerland. He has been Honorary Professor at University College London, UK, and Head of Software Engineering at Fondazione Bruno Kessler, Trento, Italy. Paolo Tonella held an ERC Advanced grant as Principal Investigator of the project PRECRIME (Self-assessment Oracles for Anticipatory Testing). Paolo Tonella has written over 200 peer reviewed conference papers and over 100 journal papers. His H-index (according to Google scholar) is 72; the number of citations 16k. He is/was in the editorial board of the ACM Transactions on Software Engineering and Methodology, of the IEEE Transactions on Software Engineering, of Empirical Software Engineering, Springer. Paolo Tonella teaches Information Modeling and Analysis and Knowledge Search and Extraction at the Master in Data and Software Engineering; Probability and Statistics at the Bachelor in Informatics. Paolo Tonella has given foundational contributions to Software Engineering, in the area of code analysis and testing. His ICSE Most Influential Paper (MIP) award winning paper, Analysis and Testing of Web Applications, initiated a new stream of research devoted to the development of testing techniques for web applications. His comprehensive book Reverse Engineering of Object-Oriented Code laid the foundations for the reverse engineering of object-oriented systems. His ISSTA 2004 paper Evolutionary Testing of Classes is recognized as a milestone for the automated generation of object oriented test cases. One of the most widely used Java test case generators, EvoSuite, can be traced back to this seminal ISSTA paper and to the associated tool, eToc. In May 2023, Paolo Tonella has given a keynote on The Road Toward Dependable AI Based Systems in Melbourne, Australia, at the ACM/IEEE International Conference on Software Engineering (ICSE). More details about Paolo Tonella are available in his Curriculum Vitae. Social: Blue Sky, Instagram Selected papers Papers by year Papers by type Projects Tools Photos",
  "content_length": 2182,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:57"
}