{
  "name": "Paola Boito",
  "homepage": "http://www.ens-lyon.fr/en/english-ens-de-lyon-269761.kjsp",
  "status": "success",
  "content": "Home | Site Ens international Skip to main content Skip to menu Skip to search Quick links Université de Lyon Bibliothèque Diderot de Lyon (Library) IFÉ (French Institute of Education) ENS Éditions Alumni Webosphere of ENS de Lyon News Events Tools People finder (Directory in French) Intranet Learning Platform ENT Skip to main page Skip to contain Skip to sitemap Skip to search Skip to accessibility Skip to contact Skip to legal notice Training through research ENS de Lyon offers training for teaching and research careers Discover Multidisciplinary research 30 research structures and high-tech equipment, from archaeology to quantum physics Discover An urban campus in the heart of Europe ENS de Lyon offers a unique study environment in the center of the city Discover Bibliothèque Diderot de Lyon ENS de Lyon library offers more than 1.2 million reference documents and electronic resources Discover Previous Next Display transcript ENS de Lyon institutional presentation video ENS de Lyon institutional presentation video. This 2.10 minute video introduce ENS de Lyon in a succession of images of the different sites and memebers of the school, accompanied by texts and figures in French and in English. The texts displayed on the images are transcribed below in french and then in english. Image descriptions are shown in square brackets. Bienvenue à l’École normale supérieure de Lyon Welcome to École normale supérieure de Lyon [Image of students throwing their hats at a graduation ceremony] Formation & Recherche Research and education [Images of lecture theatres and research laboratories at ENS de Lyon] 2400 étudiantes et étudiants 2400 students [Photograph of a graduating class of students from ENS de Lyon] 700 enseignantes-chercheures et enseignants-chercheurs 700 Academic staff [Images of faculty memeber in teaching and research situations] 600 personnels administratifs et techniques 600 admistrative staff [Images of various administrative staff in professional situations: managers, gardeners, IT specialists, animators] 12 départements de formation 12 departments [Mosaic of 12 images representing the activities of the various departments of ENS de Lyon] 30 structures de recherche 30 research units [Mosaic of 12 images representing the activities of the various research structures at ENS de Lyon] Sciences et humanités Humanities and sciences [Image taken from an ENS de Lyon graduation ceremony when the Humanities department took to the stage] Interface entre Science & société When science and society meet [Overhead view of a ‘climate fresk’] Exigence Aiming high [Image taken from a graduation ceremony at ENS de Lyon during the presentation of the degree by the school's governing body] Curiosité Curiosity [Composition of 3 images with interactions between faculty memebers and students] Ouverture Openness [Composition of 2 images at events open to the public] Rejoignez-nous Join us [Aerial views of ENS de Lyon site] Créer Create [Image from a research units at ENS de Lyon] Transmettre Transmit [2 Images of students and teachers] Diffuser la connaissance Disseminate knowledge [Mosaic of 4 images of students and teachers] Pour un monde plus intelligible et durable Making sense of the world for a sustainable future [Close-up of a flower in the garden of ENS de Lyon, then a view of the garden on the Descartes campus] École normale supérieure [Text and image animation by ENS de Lyon] University of Lyon / ENS de Lyon co-branded logo Labels : \"Bienvenue en France\" HRS4R (Human Resources Strategy for Researchers) Overview Trailer Discover the campus Headlines See all news Lafayette Fellowship members, here you come! Welcome to ENS de Lyon! To celebrate the upcoming 250th anniversary of American independence and Franco-American friendship, France has launched the Lafayette Fellowships, a new program offering 30 scholarships each year to American students who wish to spend a year pursuing a master’s degree in France. ENS de Lyon is proud to be among the 15 French host institutions for the laureates. Doctor Honoris Causa Spotlight on Hartmut Rosa, distinguished guest at ENS de Lyon on December 15, 2025 Visiting academics Blair Sullivan, invited professor at LIP Research ENS de Lyon is home to numerous research laboratories in the fields of exact sciences, social sciences and the humanities. Research activity at ENS de Lyon is reflected in the number of publications and citations of its researchers, projects funded, numerous scientific events, etc.More information Laboratories Junior labs International and joint research units Equipment Labex Bring the best out of your research Gain international experience Set up a project Focus on Understanding the mechanical response of foams by observing individual bubbles is possible! According to a CNRS publication dated November 5, 2025. Based on a scientific publication in Nature Communications to which Stéphane Santucci, a CNRS researcher at ENS de Lyon's Physics Laboratory (LPENSL), contributed: Multiscale stress dynamics in sheared liquid foams revealed by tomo-rheoscopy. Thumbnail credit: © CNRS More information Immune defenses: a repeated invention throughout evolution According to a communication from the CNRS dated November 12, 2025. Based on a scientific publication in Nature Ecology & Evolution to which Lucie Étienne, CNRS research director at CIRI, and Alexandre Legrand, INSERM researcher and CIRI doctor, contributed: Evolutionary characterization of antiviral SAMD9/9L across kingdoms supports ancient convergence and lineage-specific adaptations. Thumbnail photo credit: © Cédric SUEUR/Marie PELE/IPHC/CNRS Images More information Temporal information: an efficient fuel for a microscopic engine! According to a CNRS communication dated October 29, 2025. Based on a scientific publication in Physical Review Letters to which Ludovic Bellon, a CNRS researcher at ENS de Lyon's Physics Laboratory (LPENSL), contributed: “Information Engine Fueled by First-Passage Times.” Thumbnail image: a Brownian particle (subject to thermal agitation) wanders in a confined well until it reaches a threshold, where an automated system (a demon) acts on the position of the well to extract energy from the particle. © Aubin Archambault, Caroline Crauste-Thibierge, Alberto Imparato, Christopher Jarzynski, Sergio Ciliberto, Ludovic Bellon. More information First light from 4MOST, the next-generation cosmograph National press release. The 4MOST instrument, installed in Chile on the European Southern Observatory's (ESO) VISTA telescope and developed largely by teams from the CNRS, Université Claude Bernard Lyon 1, and ENS de Lyon, has just achieved first light. This first ray of light from space, analyzed by the instrument's spectrographs, marks the beginning of a great adventure in studying and mapping the sky: thanks to its cutting-edge technology, 4MOST can study the light from 2,400 celestial objects simultaneously, every 15 minutes. Thumbnail image credit: Image: Roelof de Jong / AIP; Jens-Kristian Krogager / CRAL; background image: Harshwardhan Pathak / Telescope Live More information Mosses reveal the secret of their shape According to a CNRS communication dated October 16, 2025. Based on a scientific publication in Current Biology to which the RDP laboratory at ENS de Lyon contributed: “Robust branch patterning in moss shoots via symplasmic auxin diffusion.” Image © Des Callaghan More information Martian oceans: the northern plains of Mars reveal new clues Press release, Villeurbanne, October 9, 2025. The past of the planet Mars continues to captivate the scientific community. One question in particular remains unanswered: did oceans once cover the surface of the Red Planet? Recently, a research team, bringing together numerous French laboratories including the Lyon Geology Laboratory: Earth, Planets, Environment (LGL-TPE – Université Claude Bernard Lyon 1 / ENS de Lyon / CNRS) and the Marseille Astrophysics Laboratory (LAM – Aix Marseille Université / CNRS / CNES), has been studying the Northern Plains of Mars using various NASA and ESA probes orbiting Mars. They have published their new findings in the journal Communications Earth & Environment. More information First simulation of the formation of a brown dwarf through gravitational collapse According to a CNRS communication dated September 30, 2025. Based on a scientific publication in Astrophysical Journal to which Adnan-Ali Ahmad, a CNRS researcher at the Lyon Astrophysics Research Center (CRAL), contributed: “Brown Dwarf Formation Through Gravitational Collapse: Insights From 3D Numerical Simulations.” Image: © Adnan-Ali AHMAD and Alex ANDRIX – CRAL More information The HTLV-1 retrovirus reprograms the antiviral response through control of nuclear export According to a CNRS announcement dated September 29, 2025, based on a scientific publication in Nucleic Acids Research to which Vincent Mocquet, research fellow at ENS de Lyon within the LBMC, contributed. Thumbnail: The HTLV-1 retrovirus © Vincent Mocquet More information The dust disk of Fomalhaut shaped by a hidden planet According to a press release from the Lyon Observatory dated September 4, 2025, based on a scientific publication to which Elliot Lynch, researcher at CRAL (ENS de Lyon/CNRS/UCBL), contributed as part of an international team: “ALMA Reveals an Eccentricity Gradient in the Fomalhaut Debris Disk”, published in The Astrophysical Journal on September 4, 2025. More information L’Économie de la violence – À qui profite la guerre ? Enjeux et solutions (The Economy of Violence – Who Benefits from War? Issues and Solutions) Mathieu Couttenier, professor of economics at ENS de Lyon and director of the CERGIC laboratory, has published L’Économie de la violence with Les Léonides (publisher). More information \"Des frères mendiants en français,\" a collective volume edited by Thibaut Radomme Thibaut Radomme is a senior lecturer in medieval literature at Université Jean Monnet Saint-Étienne a",
  "content_length": 22093,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:50"
}