{
  "name": "Paolo Gasti",
  "homepage": "https://site.nyit.edu/bio/pgasti",
  "status": "success",
  "content": "Paolo Gasti | New York Tech Staff & Faculty Directory Paolo Gasti Professor; Computer Science, College of Engineering & Computing Sciences Education Credentials: Ph.D.Expertise: Applied cryptography, privacy, behavioral biometricsJoined New York Tech: 2012 Dr. Paolo Gasti is a Professor of Computer Science at the NYIT College of Engineering and Computing Sciences. Dr. Gasti’s research focuses on behavioral biometrics, privacy-preserving biometric authentication and identification, secure multi-party protocols, and network security. His recent work includes protocols for secure genomic computation, privacy-preserving document similarity, secure document caching, and distributed denial-of-service detection and prevention in future Internet architectures. He served as a member of the NDN project, which is a National Science Foundation-sponsored initiative with the goal of designing a new network architecture that might eventually replace the current Internet. His work has been sponsored by DARPA and the National Science Foundation. Gasti worked as a research scholar at University of California. He received his Ph.D. in Computer Science from University of Genoa, Italy. He is a Fulbright fellow. Recent Projects/Research National Science Foundation: Leveraging Movement, Posture, and Anthropometric Contexts to Strengthen the Security of Mobile Biometrics National Science Foundation: Towards Energy-Efficient Privacy-Preserving Active Authentication of Smartphone Users Privacy-preserving active authentication Energy-efficient cryptographic protocols Privacy-preserving user matching Security and privacy in Named Data Networking Location privacy Publications Nicholas Cariello, Seth Levine, Gang Zhou, Blair Hoplight, Paolo Gasti, and Kiran Balagani. “SMARTCOPE: Smartphone Change Of Possession Evaluation for continuous authentication.” Pervasive and Mobile Computing, 97 (2024): 101873. Matteo Cardaioli, Mauro Conti, Kiran Balagani, and Paolo Gasti. “Your pin sounds good! Augmentation of pin guessing strategies via audio leakage.” In 25th European Symposium on Research in Computer Security, ESORICS 2020, Guildford, UK, September 14–18, 2020, Proceedings, Part I 25, pp. 720–735. Springer International Publishing, 2020. Anand Santhanakrishnan, Ding Ding, Paolo Gasti, Mike O’Neal, Mauro Conti, and Kiran S. Balagani. “DISPERSE: A Decentralized Architecture for Content Replication Resilient to Node Failures.” IEEE Transactions on Network and Service Management 17, no. 1 (2019): 201–212. Briland Hitaj, Paolo Gasti, Giuseppe Ateniese, and Fernando Perez-Cruz. “PassGAN: A deep learning approach for password guessing.” In Applied Cryptography and Network Security: 17th International Conference, ACNS 2019, Bogota, Colombia, June 5–7, 2019, Proceedings 17, pp. 217–237. Springer International Publishing, 2019. Qing Yang, Ge Peng, Paolo Gasti, Kiran Balagani, Yantao Li, and Gang Zhou. Meg: Memory and Energy Efficient Garbled Circuit Evaluation on Smartphones. In Transactions on Information Forensics and Security (T-IFS), vol. 10 pp. 384–396, 2018. Kasper Rasmussen, and Paolo Gasti. Weak and Strong Deniable Authenticated Encryption: On Their Relationship and Applications. In Sixteenth Annual International Conference on Privacy, Security and Trust (PST), IEEE, 2018. Kiran Balagani, Mauro Conti, Paolo Gasti, Martin Georgiev, Tristan Gurtler, Daniele Lain, Charissa Miller, Kendall Molas, Nikita Samarin, Eugen Saraci, Gene Tsudik, and Lynn Wu. Silk-tv: Secret Information Leakage from Keystroke Timing Videos. In European Symposium on Research in Computer Security (ESORICS), Springer, Berlin, Heidelberg, 2018. Qing Yang, Paolo Gasti, Kiran Balagani, Yantao Li, and Gang Zhou. Usb Side-channel Attack on Tor. In Elsevier Journal on Computer Networks (COMNET), vol. 141 pp. 57–66, 2018. Paolo Gasti, and Gene Tsudik. Content-centric and Named-data Networking Security: The Good, The Bad and The Rest. In Local and Metropolitan Area Networks (LANMAN), IEEE, 2018. Fatimah Elsayed, Kiran Balagani, Paolo Gasti, Chung Hyuk Park, and Anand Santhanakrishnan. Continuous and Transparent Authentication of Haptic Users. In Proceedings of the IEEE Haptics Symposium, IEEE, 2018. Kiran Balagani, Paolo Gasti, Aaron Elliott, Azriel Richardson, and Mike O’Neal. The Impact of Application Context on Privacy and Performance of Keystroke Authentication Systems. In Journal of Computer Security (JCS), pp. 543–556, 2018. For a full list of publications, visit Dr. Gasti’s website. Honors and Awards Fulbright scholar Courses Taught at New York Tech CSCI 610: Theoretical Concepts in Computers and Computation CSCI 651: Algorithmic Concepts INCS 741: Cryptography CSCI 330: Operating Systems (undergraduate) INCS 615/CSCI 440/ITEC 440: Network Security and Perimeter Protection CSCI 185: Programming II CSCI 125: Programming I Contact Information Email: pgasti@nyit.edu Phone: 212.261.1609 Office: New York, NY Website: lamp.soecs.nyit.edu By continuing to use the website, you consent to analytics tracking per New York Tech's Privacy StatementAccept Cookies",
  "content_length": 5076,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:53"
}