{
  "name": "Parag Singla",
  "homepage": "http://www.cse.iitd.ac.in/~parags",
  "status": "success",
  "content": "Parag Singla HOME Parag Singla Professor Department of Computer Science and Engineering, Joint Appointment with School of AI Indian Instiute of Technology Delhi Hauz Khas, New Delhi. 110016 Phone : 91-11-26596064 Email : parags [at] cse [dot] iitd [dot] ac [dot] in Home Research Teaching Miscellaneous Curriculum Vitae I am a Professor in the Department of Computer Science and Engineering at Indian Institute of Technology, Delhi. I am a member of the Data Analytics and Intelligence Research (DAIR) Group. Earlier, I worked as a postdoctoral fellow with Raymond Mooney at the University of Texas at Austin. I finished my Phd with Pedro Domingos at the University of Washington, Seattle in 2009. My broad interests lie in the area of Machine Learning. Specifically, I am interested in the space of neuro symbolic reasoning. The goal here is to combine the power of pure nerual (black-box) learning with logic style reasoning as a way to incorporate additional domain knowledge and constraints in the neural framework. Much of the recent work has shown that a merger of the two has a great potential to solve problems, which could not be solved earlier, especially in the constrained settings such as availability of low amount of data. In general, the objective has been to move towards a more general model of human intelligence. My current work involves developing new models and algorithms in the area of neuro symbolic reasoning, as well as applying them to the problems in application areas such as NLP and Computer Vision. Earlier, I have worked extensively in the area of Statistical Relational Learning (SRL) which aims to combine the power of logic and probability. I worked on a widely used SRL model by the name Markov Logic. I was one of the developers of Alchemy, the first open source implementation of Markov Logic. The key to scaling up inference in SRL models is to exploit the underlying symmetry of the model for efficient inference and learning (referred to as lifted inference and learning). I was the inventor of the well known lifted Inference algorithm for SRL Models, Lifted First-order Belief Propagation .",
  "content_length": 2134,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:58"
}