{
  "name": "Paris Avgeriou",
  "homepage": "http://www.cs.rug.nl/~paris",
  "status": "success",
  "content": "Home Page of Paris Avgeriou | Software Architecture Research & Practice Current Position I am Full Professor (chair of Software Engineering) and Head of the SEARCH (Software Engineering and Architecture) Group of the Bernoulli Institute for Mathematics, Computer Science and Artificial Intelligence at the University of Groningen (RuG). Joining the group We have 2 Ph.D. positions in Software Engineering, as part of an ITEA project. For informal inquires please reach out to me. News Program Committee of the 15th International Symposium on Empirical Software Engineering and Measurement (ESEM 2021), Bari, Italy, October 11th to 15th, 2021. Co-chair: Journal First Track at the IEEE International Conference on Software Maintenance and Evolution (ICSME 2021), September 27 – October 1 2021, Luxembourg. Program Committee of the 15th European Conference on Software Architecture (ECSA 2021), 13-17 September 2021, Växjö, Sweden. Co-chair: Software Engineering and Technical Debt (SEaTeD) Track at the 47th EUROMICRO SEAA Conference, Palermo, Italy, September 6-8, 2021. Co-chair: Ideas, Visions and Reflections Track at the ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2021), Mon 23 – Fri 27 August 2021 Athens, Greece. Co-chair: International Software Architecture PhD School (iSAPS 2021), 14-18 June 2021, Lorentz Center, the Netherlands. Program Committee of the Software Engineering In Practice (SEIP) Track at the International Conference on Software Engineering (ICSE 2021), Madrid, Spain from May 22-30 2021. Program Committee of the fourth International Conference on Technical Debt (Tech Debt 2021), May 23-24, 2021, collocated with the International Conference on Software Engineering (ICSE 2021). Program Committee of the International Conference on Software Architecture (ICSA) 2021, March 22 – 26, Stuttgart, Germany. For an archive of old news, please check the activities page. Contact details Prof.dr.ir. Paris AvgeriouBernoulli Institute for Mathematics, Computer Science and Artificial Intelligence, University of GroningenVisit: Nijenborgh 9, 9747 AG Groningen, The Netherlands – room 574 BernoulliborgPost: PO Box 407, 9700 AK Groningen, The NetherlandsPhone: +31 50 3637057, Fax: +31 50 3633800Email: p [dot] avgeriou [at] rug [dot] nlHomepage: https://www.cs.rug.nl/~paris/ Archives March 2012 Meta Log in",
  "content_length": 2401,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:03"
}