{
  "name": "Parinaz Naghizadeh",
  "homepage": "https://jacobsschool.ucsd.edu/people/profile/parinaz-naghizadeh",
  "status": "success",
  "content": "Parinaz Naghizadeh | Jacobs School of Engineering Skip to main content Faculty Profiles Back to Faculty Profiles Parinaz Naghizadeh Assistant Professor, Electrical and Computer Engineering Network economics, game theory, ethics and economics of AI, optimization, reinforcement learning, economics of cyber security Professor Naghizadeh and her group develop mathematical models and analytical tools to predict and influence how humans and/or algorithmic decision makers behave in complex network environments. Specifically, their current work focuses on the ethics and economics in AI (including long-term impacts of human-in-the-loop, and data biases), decision making and learning in networks (multilayer network games, and multi-agent reinforcement learning), and the economics of cyber security (using incentive design and data analytics to improve security decision making). Capsule Bio: Parinaz Naghizadeh is an Assistant Professor in the Department of Electrical and Computer Engineering and the Design Lab at the University of California San Diego. Prior to joining UC San Diego, she was an assistant professor in the Integrated Systems Engineering and Electrical and Computer Engineering Departments at The Ohio State University from 2019 to 2023. Prior to that, she was a postdoctoral researcher at Purdue University and Princeton University Edge Lab. She received her Ph.D. in electrical engineering and M.Sc. degrees in mathematics and electrical engineering from the University of Michigan, and her B.Sc. in electrical engineering from Sharif University of Technology, Iran. Her research interests are in network economics, game theory, ethics and economics of AI, and reinforcement learning. She is a recipient of the NSF CAREER award in 2022, a Rising Stars in EECS in 2017, and a Barbour Scholarship from the University of Michigan in 2014. Update your profile Email: pnaghizadeh@ucsd.edu Website",
  "content_length": 1912,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:59"
}