{
  "name": "Parinya Punpongsanon",
  "homepage": "https://punpongsanon.info",
  "status": "success",
  "content": "Parinya Punpongsanon Search Parinya Punpongsanon, Ph.D Associate Professor at Graduate School of Science and Engineering, Saitama University. Principal Investigator of Fabrication, Interaction, and Perception Laboratory. Office Graduate School of Science and Engineering, Building for Research and Project, 7F, Room 703. 255 Shimo-Okubo, Sakura-ku, Saitama 338-8570, Japan Email parinya [at] mail.saitama-u.ac.jp Research Focus Extended Reality, Human Perception, Digital Fabrication, Computational Interaction Research Projects * All XR Human Perception Fabrication Unobtrusive Edible Tags using Food 3D Printing Presented at ACM UIST 2022 (Paper, Demonstration) Keyword Fabrication Enhancing Asynchronous Shared-Space Demonstrations with Spatial-temporal Assistive Toolsets for Effective Learning in Immersive Virtual Laboratories Presented at ACM SUI 2021 (Poster), ACM CSCW 2022 (Published at ACM PHCI 2022) Best Poster Award Keyword XR, Virtual Laboratory AI-generated Characters for Supporting Personalized Learning and Well-being Year 2020 - 2022 Publication Nature Machine Intelligence (2021), ACM CHI 2022 (Workshop) Keyword XR, Human Perception SoftPrint: Investigating Haptic Softness Perception of 3D Printed Soft Object in FDM 3D Printers Presented at Printing For Fabrication 2021, JIST-FIRST 2021 Keyword Fabrication, Human Perception Color Reproduction Framework for Inkjet FDM 3D Printers Year 2020 - Ongoing Publication EUROGRAPHICS 2021 (Poster) Keyword Fabrication Wearable Sanitizer: Design and Implementation of an Open-source, On-body Sanitizer for a Post-Pandemic Presented at ACM SIGGRAPH Asia 2020 (Emerging Technologies) Keyword Fabrication Programmable Filament: Printed Filaments for Multi-material 3D Printing Presented at ACM UIST 2020 HONORABLE MENTION AWARD Keyword Fabrication, Human perception FoodFab: Creating Food Perception Illusions using Food 3D Printing Year 2020 - 2022 Publication Workshop on Food Computing 2019, ACM CHI 2020, ACM CHI 2020, AsianCHI Symposium 2020, SIGCHI Japan 2020, STT 2020 Best Presentation Award Keyword Fabrication, Human perception Remote Environment Exploration with Drone Agent and Haptic Force Feedback Presented at IEEE AIVR 2019 Keyword XR, Human Perception FleXeen: Visually Manipulating Perceived Fabric Bending Stiffness in Spatial Augmented Reality Presented at IEEE VR 2019, IEEE TVCG 2020 INVITED TALK Keyword XR, Human perception Photo-Chromeleon: Re-Programmable Multi-Color Textures Using Photochromic Dyes Presented at ACM UIST 2019 Best Paper Award Best Talk Award Keyword Fabrication ObserVAR: Visualization System for Observing Virtual Reality Users using Augmented Reality Presented at IEEE VR 2019, IEEE ISMAR 2019, ACM SIGGRAPH Asia 2020 (XR) Keyword XR fARFEEL: Providing Haptic Sensation of Touched Objects using Visuo-Haptic Feedback Presented at IEEE VR 2019 Keyword XR, Human Perception Sequential Support: 3D Printing Dissolvable Support Material for Time-Dependent Mechanisms Year 2018 - 2019 Publication ACM TEI 2019 Keyword Fabrication FlyingHand: Extending the Range of Haptic Feedback on Virtual Hand using Drone-based Object Recognition Presented at ACM SIGGRAPH Asia 2018 Technical Briefs Keyword XR, Human perception Efficient Information Sharing Techniques between Workers of Heterogeneous Tasks in 3D CVE Year 2017 - 2019 Presented at ACM CSCW 2018 Keyword XR, VR for Education ColorMod: Recoloring 3D Printed Objects using Photochromic Inks Presented at ACM CHI 2018 Keyword Fabrication LazyNav: 3D Ground Navigation with Non-Critical Body Parts Presented at ICAT-EGVE 2014, ACM 3DUI 2015, TVCG 2016 BEST PAPER AWARD Keyword XR SoftAR: Visually Manipulating Haptic Softness Perception in Spatial Augmented Reality Presented at IEEE ISMAR 2014/2015, IEEE TVCG 2015, ACM SIGGRAPH 2016, MIRU 2016 INVITED TALK Keyword XR, Human perception DeforMe: Visualization of Tangential Surface Deformation using Invisible Textures Presented at KJMR 2013, ACM SIGGRAPH Asia 2013: Emerging Technologies, Springer-Verlag Virtual Reality 2015 BEST PRESENTATION AWARD Keyword XR Publications Journals and Research Articles Shota Kosaka, Kentaro Kimura, Seiichi Yamamoto, Hiroki Ishizuka, Yoichi Masuda, Parinya Punpongsanon, Sei Ikeda, Osamu Oshiro. Reconfigurable Soft Pneumatic Actuators Using Multi-Material Self-Healing Polymers. IEEE Robotics and Automation Letters Vol. 10, Issue 5, pp. 4938-4945, 2025. Atsushi Maki, Parinya Punpongsanon, Daisuke Iwai, Kosuke Sato. Visually Manipulating Perceived Food Texture in Projection Mapping. Transactions of the Virtual Reality Society of Japan Vol. 29, Issue 2, pp. 81-84, 2024. Short Article 松田 綾美, プンポンサノン・パリンヤ, 岩井 大輔, 佐藤 宏介. 食品端材への低視認度画像マーカ埋込による料理識別. システム制御情報学会論文誌, 2024年 37巻 12号, pp. 313-315. In Japanese Shengze Zhong, Parinya Punpongsanon, Daisuke Iwai, Kosuke Sato. Topology Optimization with Text-Guided Stylization. Springer Structural and Multidisciplinary Optimization Vol. 66, Article No. 256. November 2023. プンポンサノン・パリンヤ. 食品3Dプリンタと人工知能による食体験の向上に関する研究. 日本ロボット学会誌, 2023年 41巻 8号, pp. 676-679. Invited Review Article In Japanese Shengze Zhong, Parinya Punpongsanon, Daisuke Iwai, Kosuke Sato. Estimation of Fused-Filament-Fabrication Structural Vibro-Acoustic Performance by Modal Impact Sound. Elsevier Computers & Graphics (Special Issues on Computer-Aided Design and Computer Graphics 2023), Vol. 115, pp. 137-147. October 2023. Parinya Punpongsanon, Yamamoto Miyatake, Daisuke Iwai, Kosuke Sato. Food DX Through Unobtrusive Edible Tags using Food 3D Printing. Journal of the Imaging Society of Japan, Vol. 62, No. 2, pp. 121-127. April 2023. Invited Review Article Kosuke Hiratani, Daisuke Iwai, Yuta Kageyama, Parinya Punpongsanon, Takefumi Hiraki, Kosuke Sato. Shadowless Projection Mapping using Retrotransmissive Optics. IEEE Transactions on Visualization and Computer Graphics (Special Issues on IEEE Virtual Reality 2023), Vol. 29, No. 5, pp. 2280-2290. May 2023. Thammathip Piumsomboon, Youngho Lee, Parinya Punpongsanon. Editorial: Supernatural enhancements of perception, interaction, and collaboration in mixed reality. Frontiers in Virtual Reality(Section Augmented Reality), Vol 4, No. 2023, pp. 1-3. February 2023. Shengze Zhong, Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. NSTO: Neural Synthesizing Topology Optimization for Modulated Structure Generation. Computer Graphics Forum (Special Issue on Pacific Graphics 2022), Volume 41, Number 7, October 2022. Santawat Thanyadit, Parinya Punpongsanon, Thammathip Piumsomboon, and Ting-Chuen Pong. XR-LIVE: Enhancing Asynchronous Shared-Space Demonstrations with Spatial-temporal Assistive Toolsets for Effective Learning in Immersive Virtual Laboratories. Proceedings of the ACM on Human-Computer Interaction (In Proceedings of the ACM Conference on Computer-Supported Cooperative Work & Social Computing 2022) 6, CSCW 1, Article 136, April 2022. Piyarat Silapasuphakornwong, Chulapong Panichkriangkrai, Parinya Punpongsanon, Masahiro Suzuki, and Kazutake Uehira. An exploration of color reproduction for inkjet FDM color 3D printing. Electronic Imaging (Proceedings of Color Imaging XXVII: Displaying, Processing, Hardcopy, and Applications 2022), pp. 180:1-180:7. Online, January 2022. Pat Pataranutaporn, Valdemar Danry, Joanne Leong, Parinya Punpongsanon, Dan Novy, Pattie Maes, and Misha Sra. AI-generated Characters for Supporting Personalized Learning and Well-being. Nature Machine Intelligence (2021) Perspective. December 2021. IF (2020): 16.65 Sorashi Kimura, Daisuke Iwai, Parinya Punpongsanon, and Kosuke Sato. Multifocal Stereoscopic Projection Mapping. IEEE Transactions on Visualization and Computer Graphics (Proceedings of IEEE International Symposium on Mixed and Augmented Reality), Vol. 27, No. 11, pp. 4256-4266. November 2021. Acceptance Rate: 19.46% Best Journal Paper Award Masatoki Sugimoto, Daisuke Iwai, Koki Ishida, Parinya Punpongsanon, and Kosuke Sato. Directionally Decomposing Structured Light for Projector Calibration. IEEE Transactions on Visualization and Computer Graphics (Proceedings of IEEE International Symposium on Mixed and Augmented Reality), Vol. 27, No. 11, pp. 4161-4170. November 2021. Acceptance Rate: 19.46% Motoki Miyoshi, Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. SoftPrint: Investigating Haptic Softness Perception of 3D Printed Soft Object in FDM 3D Printers. Journal of Imaging Science and Technology (Proceedings of Printing for Fabrication 2021), Vol. 65, No. 4, pp. 40406:1-40406:8(8). July 2021. Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. FleXeen: Visually Manipulating Perceived Fabric Bending Stiffness in Spatial Augmented Reality. IEEE Transactions on Visualization and Computer Graphics, Vol. 26, No. 2, pp. 1433-1439. February 2020. Santawat Thanyadit, Parinya Punpongsanon, and Ting-Chuen Pong. Efficient Information Sharing Techniques between Workers of Heterogeneous Tasks in 3D CVE. Proceedings of the ACM on Human-Computer Interaction (Proceedings of the 21th ACM Conference on Computer-Supported Cooperative Work & Social Computing), Vol. 2, No. CSCW, Article No. 172. November 2018. Parinya Punpongsanon, Emilie Guy, Daisuke Iwai, Kosuke Sato, and Tamy Boubekeur. Extended LazyNav: Virtual 3D Ground Navigation for Large Displays and Head-Mounted Displays. IEEE Transactions on Visualization and Computer Graphics, Vol. 23, No. 8, pp. 1952-1963. August 2017. Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. SoftAR: Visually Manipulating Haptic Softness Perception in Spatial Augmented Reality. IEEE Transactions on Visualization and Computer Graphics (Proceedings of IEEE International Symposium on Mixed and Augmented Reality 2015), Vol. 21, No. 11, pp. 1279-1288. November 2015. Best Student Research Award Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. Projection-based Visualization of Tangential Deformation of Nonrigid Surface by Deformation Estimation Using Infrared Texture. Virtual Reality, Springer London, Vol. 19(1), pp. 45-56. March 2015. Conference Proceedi",
  "content_length": 39745,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:00"
}