{
  "name": "Parimala Thulasiraman",
  "homepage": "http://www.cs.umanitoba.ca/~thulasir",
  "status": "success",
  "content": "<!-- Parimala Thulasiraman-->'s Home Page <!--<a href=\"researchlab.html\">InterDisciplinary Evolving Algorithmic Sciences (IDEAS) Laboratory </a> Welcome to Parimala Thulasiraman's Home Page IDEAS (InterDisciplinary Evolving Algorithmic Science) LAB Dr. Parimala Thulasiraman Professor Department of Computer Science E2-578 EITC University of Manitoba Winnipeg, Manitoba Canada R3T 2N2 phone: 204 474 8856 fax: 204 474 7609 Parimala.Thulasiraman@umanitoba.ca Research Focus Parallel Evolutionary/Bi-Inspired Computing for Real World Applications Lab Distributed Evolutionary/Bio-Inspired Machine Learning Computing for Dynamic Networks Lab Quantum Computing Lab ResearchTeam Publications Teaching Professional Activities Dr. Parimala Thulasiraman is a Professor with the Department of Computer Science at the University of Manitoba. Parimala received B.Eng. (Honours) and M.A.Sc. degrees in Computer Engineering from Concordia University in Montreal, QC, Canada. She obtained her Ph.D. from the University of Delaware in Newark, DE, USA after finishing most of her formalities at McGill University in Montreal, QC, Canada. Parimala’s research interests are in the intersection of high performance computing and graph analytics for real world applications in Network Science. Her laboratory, Inter-Disciplinary Evolving Algorithmic Sciences (IDEAS), applies innovative soft computing techniques such as evolutionary computation, bio-inspired computation, and machine learning to solve challenging issues in complex network systems and data scientific problems. She explores novel algorithmic optimization techniques for these problems to efficiently map, design, and develop scalable algorithms for futuristic multicore architectures. Her research is supported by the Natural Sciences and Engineering Research Council of Canada, Research Manitoba, MITACS ACCELERATE, MITACS Globalink, NSERC Engage and University of Manitoba local grants such as Faculty of Science Interdisciplinary grants and University of Manitoba Research Grants Program. Parimala has also received the teaching recognition award at the University of Manitoba. She is a member and senior member of the ACM and IEEE societies, respectively.",
  "content_length": 2207,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:59"
}