{
  "name": "Pari Delir Haghighi",
  "homepage": "https://research.monash.edu/en/persons/pari-delir-haghighi",
  "status": "success",
  "content": "Pari Delir Haghighi - Monash University View Scopus Profile Pari Delir Haghighi Dr Senior Lecturer, Department of Human Centred Computing https://orcid.org/0000-0001-9922-1214 EmailPari.Delir.Haghighimonashedu Accepting PhD StudentsPhD projectshttps://supervisorconnect.it.monash.edu/ 20052025 Research activity per year Personal profile BiographyPari is a Senior Lecturer in the Faculty of Information Technology, Monash University. Pari received her PhD in Computing from Monash University in 2010. After completion of her degree, she was awarded a competitive Early Career Development Fellowship (ECDF) at Monash University. She has over 14 years of experience in developing intelligent, context-aware mobile solutions for real world problems, particularly in healthcare. She has worked closely with medical professionals and experts to design and develop innovative, personalised and context-aware solutions for real time management and monitoring of chronic conditions and diseases. She has also introduced the first ontology for emergency management in mass gatherings (DO4MG) published in the Australian National Data Services library, and a new framework for developing and evaluating ontologies.Research interestsUbiquitous computing, Context-aware computing, Mobile health, Mobile and intelligent decision support systems, Mobile and social sensingMonash teaching commitmentTeaching Awards 2020 - Teaching Excellence Award, Citation for Outstanding Contribution to Student Learning2014 - Teaching Excellence Award for Honours Supervision Pari has experience as the Chief Examiner and Lecturer for the following units in the Faculty of IT: FIT5046 Mobile and distributed computing systemsFIT9130 Systems Analysis and DesignFIT5152 User interface design and usabilityFIT5030 Web services and service oriented computingFIT5148 Distributed and big data processing Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputing, Doctor of Philosophy, Monash UniversityAward Date: 20 May 2010Computing, Bachelor of Computer (Honours), Monash UniversityAward Date: 30 Aug 2004 Research area keywordsUbiquitous ComputingMobile HealthContext-aware computingMobile and social sensing Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2011 2011 2014 2016 2017 2018 2019 2021 2022 2023 2025 13 Finished Projects per year Real-time EH&S Intervention to Improve Site Safety (Scoping Study) Delir Haghighi, P. (Primary Chief Investigator (PCI)), Ens, B. (Primary Chief Investigator (PCI)), Dwyer, T. (Chief Investigator (CI)), Tag, B. (Chief Investigator (CI)), Wang, T. (Chief Investigator (CI)) & Rezatofighi, H. (Chief Investigator (CI))15/03/23 → 30/06/25Project: Research AI-powered Monitoring and Prediction to Improve Site SafetyKe, F. (Primary Chief Investigator (PCI)), Delir Haghighi, P. (Chief Investigator (CI)), Ens, B. (Chief Investigator (CI)) & Wang, T. (Chief Investigator (CI))1/08/22 → 1/08/25Project: Research Context aware interventions for eating disorder prevention and improved body imageMcNaney, R. (Primary Chief Investigator (PCI)), Delir Haghighi, P. (Chief Investigator (CI)), Sharp, G. (Chief Investigator (CI)) & Xie, J. (Chief Investigator (CI))1/01/22 → 30/06/25Project: Research Sense-ED: Developing mobile sensing and Natural Language Processing models to support the identification of, and interventional mechanisms for, eating disorder relapseMcNaney, R. (Primary Chief Investigator (PCI)), Delir Haghighi, P. (Chief Investigator (CI)), Mei Kuan, L. (Chief Investigator (CI)), Phan, R. (Chief Investigator (CI)), Chun Yong, C. (Chief Investigator (CI)), Wang, T. (Chief Investigator (CI)), Sharp, G. (Chief Investigator (CI)) & Bell, B. T. (Chief Investigator (CI))Monash University – Internal Faculty Contribution19/08/21 → 31/08/22Project: Research Internet and telerehabilitation-based management of rotator cuff related shoulder pain: a randomised controlled trialMalliaras, P. (Primary Chief Investigator (PCI)), Haines, T. (Chief Investigator (CI)), Skouteris, H. (Chief Investigator (CI)), Burstein, F. (Chief Investigator (CI)) & Delir Haghighi, P. (Chief Investigator (CI))Hospitals Contribution Fund of Australia (trading as HCF Research Foundation)20/03/21 → 20/12/23Project: Research View all 13 projects Research output Research output per year 2005 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2024 2025 54 Conference Paper 24 Article 6 Chapter (Book) 2 Other 4 More 2 Editorial 1 Letter 1 Review Article Research output per year Research output per year Development of a patient decision aid in relation to imaging for rotator cuff tendinopathy: a mixed-methods studyMalliaras, P., Haines, T. P., Burstein, F., Connell, D., Delir Haghighi, P., Hoffmann, T., Neil, J., Nicklen, P., Skouteris, H., Page, R. S., Whale, R., Harris, I. & Zadro, J. R., Oct 2025, In: Musculoskeletal Science and Practice. 79, 9 p., 103388.Research output: Contribution to journal › Article › Research › peer-review Open Access HYDRA: A Hyper Agent for Dynamic Compositional Visual ReasoningKe, F., Cai, Z., Jahangard, S., Wang, W., Haghighi, P. D. & Rezatofighi, H., 2025, Computer Vision – ECCV 2024, 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part XX. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: Springer, p. 132-149 18 p. (Lecture Notes in Computer Science; vol. 15078).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 4 Citations (Scopus) Social media mining in health researchHabibabadi, S. K., Palmer, C., Delir Haghighi, P., Burstein, F., Javed, M., Dimaguila , G. L. & Buttery, J., 2025, Research Handbook on Health Information Systems. Gray, K. & Lederman, R. (eds.). 1st ed. Cheltenham Glos UK: Edward Elgar Publishing, p. 347–366 20 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research › peer-review AR-Facilitated Safety Inspection and Fall Hazard Detection on Construction SitesLiu, J., Rao, A. S., Ke, F., Dwyer, T., Tag, B. & Haghighi, P. D., 2024, Proceedings - 2024 IEEE International Symposium on Mixed and Augmented Reality, ISMAR-Adjunct 2024. Eck, U., Sra, M., Stefanucci, J., Sugimoto, M., Tatzgern, M. & Williams, I. (eds.). IEEE, Institute of Electrical and Electronics Engineers, p. 12-14 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 2 Citations (Scopus) A Social Support-Enabled Mobile Health (mHealth) Application for Adolescent Depressive Symptomatology: Is it Usable and Feasible?Gilani, S. M., Pasha, M. F., Thanzami, V. & Delir Haghighi, P., 2024, Proceedings of the AHFE International Conference on Human Factors in Design, Engineering, and Computing (AHFE 2024 Hawaii Edition). Ahram, T. & Karwowski, W. (eds.). New York USA : AHFE Conference, Vol. 159. p. 1329–1340 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile View all 90 research outputs Activities Activities per year 2017 2017 2018 2019 2019 3 Contribution to conference Activities per year International Conference on Advances in Mobile Computing and Multimedia 2019Delir Haghighi, P. (Organiser)2 Dec 2019 → 4 Dec 2019Activity: Participating in or organising an event types › Contribution to conference International Conference on Advances in Mobile Computing and Multimedia 2018Delir Haghighi, P. (Organiser)18 Nov 2018Activity: Participating in or organising an event types › Contribution to conference International Conference on Advances in Mobile Computing and Multimedia 2017Delir Haghighi, P. (Organiser)17 Dec 2017Activity: Participating in or organising an event types › Contribution to conference",
  "content_length": 8354,
  "method": "requests",
  "crawl_time": "2025-12-01 14:08:59"
}