{
  "name": "Parke Godfrey",
  "homepage": "http://www.cs.yorku.ca/~godfrey",
  "status": "success",
  "content": "parke godfrey, york university parke godfrey § biography § courses § research § activities § miscellaneous § papers biography position: associate professor Department of Electrical Engineering & Computer Science York University university postal address: Parke Godfrey 1012M Lassonde Bldg (EECS) York University 4700 Keele Street Toronto, Ontario M3J 1P3 CANADA office: Lassonde #2050 telephone numbers: Ph#: 416-736-2100 x66671 FAX#: 416-736-5872 EECS Department: 416-736-5053 e-mail: godfrey@yorku.ca encryption: PGP Public Key research affiliations: Laboratory for Computer Systems Research, York University IBM Visiting Research Scientist, IBM Toronto Laboratory curriculum vitae: PhD in Computer Science, 1999, University of Maryland at College Park. MS in Information and Computer Science, Georgia Institute of Technology. BS in Mathematical Sciences, University of North Carolina at Chapel Hill. Parke Mononoke © Prisma August 2016 At Picasso Museum in Paris. © Jack Minker? June 1991 Chillin' in Ellicott City. © 1997 Oops, that's Godfrey Parke. William Powell and Carole Lombard in My Man Godfrey. © 1936 Looking across the Hudson from the Cloisters in NYC. © parke godfrey 29 December 2000 teaching & courses fall 2025 EECS-4411A: Database Management Systems office hours: 14:00â16:00 Mondays & by appointment winter 2025 EECS-4415M: Big Data Systems EECS-6002: Directed Reading (Data & AI) past classesâ¦ research CS Research Interests primary database, knowledge bases, & information systems query expressiveness preference queries & skyline queries cooperative query answering (cooperative response to database queries) query optimization logic-based query optimization information integration heterogeneity & mediation over databases reasoning over queries and views & query complexity semantic query caching query & database semantics integrity constraints weak forms of negation secondary deductive databases & logic programming knowledge discovery & data mining WWW search engine technology tertiary / general artificial intelligence knowledge representation theory of computation algorithms combinatorics & computational complexity automata theory software engineering Current Research Endeavors skyline & preference queries SPQL (a skyline-based preference query language): extending SQL for preference queries understanding the properties of skyline (maximal vector) sets developing relational algorithms for computing skyline (maximal vector) sets Pareto Search: effective web search using long keyword queries data mining on relational database systems finding and addressing bottlenecks in RDBMSs for data mining applications adapting RDBMSs for better use for scientific applications query optimization and integrity checking use of statistics and sampling in query optimization optimizing integrity checking for complex constraints Er, no, that's Parker Posey as Jackie O. in The House of Yes. © 1997. However, if you are a friend of hers and would be willing to arrange an introduction... A sign at Kensington Market. © parke godfrey 9 April 2005 In Fuquay Varina. © parke godfrey 26 December 2005 Entering Bergen. © parke godfrey 3 September 2005 activities â® miscellaneous Sunset at Cape Hatteras, looking across the bay. © parke godfrey 27 December 2004 A window box at the Jagdschloss Niederwald. © parke godfrey 28 August 2005 Dogwood blossoms on Monument Avenue in Richmond during the Easter Parade. © parke godfrey 20 April 2003 papers List on DB&LP.",
  "content_length": 3488,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:03"
}