{
  "name": "Parmit K. Chilana",
  "homepage": "http://www.cs.sfu.ca",
  "status": "success",
  "content": "School of Computing Science - Simon Fraser University Learn More Learn More Learn More Learn More Learn More Learn More Learn More Learn More Learn More Learn More Learn More WELCOME TO THE SCHOOL OF COMPUTING SCIENCE The School of Computing Science at Simon Fraser University is ranked among the top computing science schools in Canada for research excellence. Our world-class faculty consistently produce high-quality research published in leading computer science journals. Our programs are designed to meet the growing demand for graduates with the scientific knowledge and technical skills needed to excel in today’s technological world. We challenge our students to reach their full potential and develop the tools to become effective problem-solvers and make impact in the industry. DISCOVER CS AT SFU Our computing science programs cover software design, artificial intelligence, algorithms, programming, networks, databases, and operating systems. Taught by world-class faculty, they are designed to prepare you to excel in today’s technology-driven world and pursue a career in academia or industry. Computing Science at SFU stands out for its dynamic and innovative approach to solving real-world problems with technology. Explore our programs now! FUTURE STUDENTS SEE OUR PROGRAMS CURRENT STUDENTS FIND RESOURCES LATEST NEWS Shaping the Future with Big Data: Shubham Bhatia’s MPCS Experience at SFU Read More New AI Tool Lean Finder Helps Mathematicians Discover Theorems Faster and Smarter Read More Celebrating Innovation and Discovery at CS Research Day 2025 Read More MORE NEWS UPCOMING EVENTS MORE EVENTS About Overview Message From the Director Industry Relations Overview MPCS Advisory Council Job Opportunities Diversity in CS Overview Diversity Committee Webinars Awards and Project Presentations 2025 Explore Computing Science Research Workshop Contact Us CS Intranet People Overview Leadership Faculty Staff Future Students Overview Undergraduates Graduates Current Students Overview Undergraduates Overview Program Requirements Forms Policies Co-op Student Resources Undergraduate Student Research Award (USRA) Academic Enhancement Program (AEP) AEP in the News! Computing Science Peer Tutoring Meet your CS Peer Tutors Research Opportunities Undergraduate Project Showcase Frequently Asked Questions Graduates Overview Program Requirements Policies Forms Financial Support Resources Supervisory Committee Thesis & Defence Internships & Co-op MPCS Co-op Industrial Internships Teaching Assistantships Student Life Research Overview Areas Labs Overview Trustworthy Artificial Intelligence (TAI) Lab Centres & Institutes Chairs Awards Overview Nominations for CS Excellence in Teaching Awards Best Paper Award Seminars Overview Distinguished Lecture Series Industry Talks Series VCR/AI News & Events Overview News Events Overview ICPC Programming Contest About ICPC ICPC PACNW | SFU Support Overview CSIL Linux/UNIX FAQ Overview CSIL Linux/Unix Known Issues Network Lab FAQ CSIL Overview Remote Access CSIL Windows systems Known Issues CSIL Linux/UNIX FAQ Basic Linux Command Line Survival Known Issues How to kill Unix Processes Grads & Researchers Guides & Tips Overview Print, Photocopy & Scan SFU.CA Search Search This Site SFU.ca SFU Mail goSFU Canvas close",
  "content_length": 3284,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:04"
}