{
  "name": "Partha Pakray",
  "homepage": "http://cs.nits.ac.in/partha",
  "status": "success",
  "content": "Faculty Details Dr. Partha Pakray Information Designation : Associate Professor Email : partha@cse.nits.ac.in Phone : 8259065018 Research Group Natural Language Processing Artificial Intelligence Machine Learning Quantum Computing Large Language Models (LLMs) Quantum NLP Key Notes Conference: International - 117 Journals: 71 Conferences: 147 Book Chapters: 5 Book: 1 Patents: 6 PhD: Guided: 18 Post Graduates: Guided: 11 Under Graduates: Guided: 16 Cited byView allAllSince 2020Citations27232062h-index2623i10-index89650480240120360200920102011201220132014201520162017201820192020202120222023202420258112435125445387479094121248356404449472 224 PUBLICATIONS 18 DOCTORAL STUDENTS 6 PATENTS 9 PROJECTS Introduction [Biosketch] My Motto: “If you believe in yourself, you will become yourself” Dr. Partha Pakray is an Associate Professor in the Department of Computer Science & Engineering at the National Institute of Technology (NIT) Silchar, India. He earned his Ph.D. in Computer Science & Engineering from Jadavpur University, focusing on Answer Validation through Textual Entailment. He pursued two prestigious post-doctoral fellowships under the ERCIM “Alain Bensoussan” Fellowship Programme of the European Union—at the Norwegian University of Science & Technology (NTNU), Norway, and the Faculty of Informatics, Masaryk University, Czech Republic. He also worked as a Guest Researcher at the University of Bremen, Germany, and Aix-Marseille University, France, through DST–DAAD and DST–CNRS International Research Collaborations. Dr. Pakray’s research interests encompass Artificial Intelligence, Natural Language Processing, Machine Translation, Deep Learning, Information Retrieval, Quantum Machine Learning, Adversarial AI, Quantum NLP and Large Language Models. He has served as Principal Investigator (PI) for multiple national and international research projects, including collaborations with France, Germany, Malaysia, and Indonesia, funded by DST, SERB, MeitY, CNRS, DAAD, and ASEAN. His current research projects include Intelligent Speech-to-Speech Translation with Lip-Syncing for Educational Domain and Design and Development of a Low-Cost Hemodialysis Machine with Remote Monitoring Facility. He has published over 70 journal papers, 140+ conference papers, 5 book chapters, and holds six granted patents (including five German Utility Patents and one Indian Patent). He has also guided 15 Ph.D. scholars and numerous M.Tech. and B.Tech. students, fostering research excellence at NIT Silchar. His editorial contributions include serving as Guest Editor for special issues in Cambridge Core’s Natural Language Processing Journal and NASA Springer Journal, and Editorial Board Member of Natural Language Engineering (Cambridge Press). Dr. Pakray’s academic leadership is reflected in his roles as Associate Dean (Examinations), Coordinator of the Undergraduate Research Council, and Warden of Boy’s Hostel-1. Internationally, he is associated with several academic networks such as the European COST Action on Gender Balance in Informatics and Institute for IR 4.0, Universiti Kebangsaan Malaysia (UKM). Recognized for his global academic engagement, Dr. Pakray has been awarded multiple international fellowships and research grants, including the National Scholarship Programme of the Slovak Republic, the CEFIPRA-France Research Grant, and the Guest Missionaries Grant at University of Paris-Saclay and LISN-CNRS. His contributions extend to organizing international workshops such as QuantumNLP 2025 (IJCNLP–AACL, IIT Bombay) and Quantum NLP Workshop 2024 (Aix-Marseille University, France). Dr. Pakray continues to contribute to advancing research and innovation at the intersection of Artificial Intelligence, Quantum Computing, and Natural Language Processing, promoting interdisciplinary collaboration and fostering global research partnerships. Areas of Interest Machine Learning Deep Learning Quantum Machine Learning Natural Language Processing Large Language Models (LLMs) Cybersecurity – Fake News Detection Cyberbullying, Analysis of Hinglish content Machine Translation Gender Equality and Gender Bias Semantic Textual Similarity Text Entailment Question Answering Machine Intelligence Information Retrieval Languages: any Northeast Indian Languages - drop email: partha@cse.nits.ac.in EDUCATION QUALIFICATION Institution Year Degree Jalpaiguri Govt. Engineering College 2004 B.E. (Computer Science & Engineering) Jadavpur University 2007 M.E. (Computer Science & Engineering) Jadavpur University 2013 Ph.D. (Computer Science & Engineering) EXPERIENCE Teaching Experience Associate Professor 18 October 2023 - Present National Institute of Technology Silchar (Govt. of India) Assistant Professor Grade I 21 November 2019 - 17 October 2023 National Institute of Technology Silchar (Govt. of India) Assistant Professor Grade II 13 August 2018 - 20 November 2019 National Institute of Technology Silchar (Govt. of India) Industrial/Research Experience Post Doctoral 15 October 2014 - 6 January 2015 Masaryk University, Czech Republic Post Doctoral 1 August 2013 - 30 July 2014 Norwegian University of Science and Technology, Norway PUBLICATIONS 224 Journal International Conferences Book Chapters Monograph Book All 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2013 2011 Partha Pakray et al., “Preface: Special issue on Natural Language Processing applications for low-resource languages”, Natural Language Processing, Cambridge University Press, Volume 31, Issue 2, 181-182, February, 2025, https://doi.org/10.1017/nlp.2024.34, Indexed in SCIE, Impact Factor: 2.3, Quartile: Q1 Pankaj Dadure, Partha Pakray, Sivaji Bandyopadhyay, “Mathematical Information Retrieval: A Review”, ACM Computing Surveys, 2025, https://doi.org/10.1145/369995, Indexed in SCIE, Impact Factor: 23.8, Quartile: Q1 Partha Pakray et al., “Natural Language Processing Applications for Low-Resource Languages”, Natural Language Processing, Cambridge University Press, Volume 31, Issue 2, 183 - 197, February, 2025, https://doi.org/10.1017/nlp.2024.33, Indexed in SCIE, Impact Factor: 2.3, Quartile: Q1 Advaitha Vetagiri, Partha Pakray, Amitava Das, “A deep dive into automated sexism detection using fine-tuned deep learning and large language models”, Engineering Applications of Artificial Intelligence, Volume 145, January, 2025, Indexed in SCIE, Impact Factor: 7.5, Quartile: Q1 All 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 Annepaka Yadagiri, Reddi Mohana Krishna, Partha Pakray, “CNLP-NITS-PP at GenAI Detection Task 2: Leveraging DistilBERT and XLM-RoBERTa for Multilingual AI-Generated Text Detection”, In Proceedings 1st Workshop on GenAI Content Detection (GenAIDetect), January 19th 2025, 2025, 31st International Conference on Computational Linguistics (COLING 2025) Annepaka Yadagiri, Sai Teja Lekkala, Mandadoddi Srikar Vardhan, Partha Pakray, Reddi Mohana Krishna, “CNLP-NITS-PP at GenAI Detection Task 1: AI-Generated Text Using Transformer-Based Approaches”, In Proceedings 1st Workshop on GenAI Content Detection (GenAIDetect), January 19th 2025, 2025, 31st International Conference on Computational Linguistics (COLING 2025) Sai Teja Lekkala, Annepaka Yadagiri, Mangadoddi Srikar Vardhan, Partha Pakray, “nits_teja_srikar at GenAI Detection Task 2: Distinguishing Human and AI-Generated Essays Using Machine Learning and Transformer Models”, In Proceedings 1st Workshop on GenAI Content Detection (GenAIDetect), January 19th 2025, 2025, 31st International Conference on Computational Linguistics (COLING 2025) Sai Teja Lekkala, Annepaka Yadagiri, Mangadoddi Srikar Vardhan, Partha Pakray, “CNLP-NITS-PP at GenAI Detection Task 3: Cross-Domain Machine-Generated Text Detection Using DistilBERT Techniques”, In Proceedings 1st Workshop on GenAI Content Detection (GenAIDetect), January 19th 2025, 2025, 31st International Conference on Computational Linguistics (COLING 2025) Annepaka Yadagiri and Partha Pakray, “Deep Learning Strategies for Identifying Machine-Generated Text”, In Proceedings International Conference on Ubiquitous Information Management and Communication, 2025, Bangkok, Thailand, doi: 10.1109/IMCOM64595.2025.10857545 All 2022 2021 2020 Pankaj Dadure, Partha Pakray, and Sivaji Bandyopadhyay, “Challenges and Opportunities in Knowledge Representation and Reasoning”, InJohn Wang, Data Science and Machine Learning, January, 2022, 2500, IGI Global, https://www.igi-global.com/book/encyclopedia-data-science-machine-learning/276507 All 2012 Partha Pakray, “Multilingual restricted domain QA System with dialogue management”, April, 2012, LAP Lambert Academic Publishing COURSES TAUGHT / TEACHING Sl.No Course Name Semester Course Code Duration Status 1 Natural Language Processing B.Tech CS 332 Even Semester, 2025 Completed 2 Artificial Intelligence M.Tech CS 5109 Even Semester, 2025 Completed 3 Artificial Intelligence B.Tech CS 401 Odd Semester, 2025 Ongoing 4 Artificial Intelligence M.Tech CS 5202 Odd Semester, 2025 Ongoing 5 Python Programming Laboratory M.Tech CS 5306 Odd Semester, 2025 Ongoing STUDENT GUIDANCE 45 Undergraduate Post Graduate Ph.D. Speech-to-Speech Translation with Lip-Syncing for Educational Domain Swarup Chanda, Mahesh Birajdar, Ayush Mani, Vyshnavi Chilaka, Asad Ahmed Enrolled: 1 August 2025 Supervisor : Dr. Partha Pakray Academic Year : 2025-2026 Multimodal based Abstractive Summarization Mr. Abdullah Khilji Mr. Utkarsh Singh Mr. Pintu Singh Mr. Adnan Ali Completed : Supervisor : Dr. Partha Pakray Academic Year : 2020-2021 *MedicBot: A healthcare Assistant Mr. Devi Prasad Upadhyay Mr. Sriharsha Medisetti Mr. KVN Pranav Mr. Prateek Mishra Completed : Supervisor : Dr. Partha Pakray Academic Year : 2021-2022 Multilingual News Article Similarity Rajdeep Paul, Samudranil Dutta, Battula Veeranjaneyulu Chowdary, Completed : Supervisor : Dr. Partha Pakray Academic Year : 2022-2023 Deep Text Summarization and Semantic Evaluation Rishu Kumar Darsh, Kumar Kaushik, Joya Chakr",
  "content_length": 27050,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:08"
}