{
  "name": "Pascal Fallavollita",
  "homepage": "https://health.uottawa.ca/people/fallavollita-pascal",
  "status": "success",
  "content": "Home | Faculty of Health Sciences Faculty of Health Sciences Learn more about our programs play_arrow pause With its state-of-the-art teaching, learning and research spaces, the Faculty gives Canada’s future health leaders the hands on, job-ready skills they need to support Canada's health system. Our Schools Interdisciplinary School of Health Sciences Learn how to promote and improve the health of individuals and populations. Develop an understanding of the interactions and relationships between biological determinants of health and environments, social networks, and communities. Contribute to a healthy future School of Human Kinetics Contribute to the field of physical activity and health, or of sports and society. Enjoy an enriching university experience thanks to the School’s internationally recognized research activities. Help others get moving School of Nursing Be among the next generation of nurses to offer high-quality care, take on leadership roles within the health care system, and contribute to the advancement of knowledge in nursing science. Be part of a new generation School of Nutrition Sciences Train to undertake a leadership role in the field of health and nutrition and to mobilize knowledge to promote healthy lifestyles. Discover the power of food School of Rehabilitation Sciences Pursue a career in bilingual health care to meet the needs of Francophone clients in Ontario and in Francophone and bilingual communities across Canada. Help others recover News Sustainability 200 Lees Avenue: A Landmark in Sustainability at uOttawa The University of Ottawa has reached an important milestone in its sustainability journey. The new Faculty of Health Sciences (FHS) building at 200 Lees Avenue has been awarded LEED® Platinum certification, the highest level of certification in the LEED program, signifying exemplary performance in sustainable design and construction. More stories Read all news keyboard_arrow_right Faculty of Health Sciences Christina Campbell: a nursing student driving change in health equity Faculty of Health Sciences Occupational therapy students empower peers on the way to mental well-being Faculty of Health Sciences Tackling the housing crisis with an interactive dashboard Faculty of Health Sciences Dawn Stacey honored with the 2025 Grimes Career Achievement Award for her contributions to health research Events View all events Nov 25 Info session: Graduate Diploma Food Policy and Regulatory Affairs Learn all about the Graduate Diploma in Food Policy and Regulatory Affairs in this online info session! Dec 1 to Jun 30 High school workshops Inspire your students to explore university studies in health sciences through interactive workshops offered by the Faculty of Health Science at uOtta… Jan 30 Health Sciences Career Fair Networking with professionals in the health care industry. Greetings from the dean “We are passionate about active, healthy living and are eager to share our knowledge and expertise with you.” Lucie Thibault — Dean, Faculty of Health Sciences 5K+ Undergraduate and graduate students 120+ Full-time professors ~ $9M Research funding in 2022 We are committed to equity, diversity, and inclusion. Learn more about our initiatives Quick links Our programs Research Academic Office Mentoring Centre OUR NEW CAMPUS Health care in Canada is in crisis and that is why the University of Ottawa is investing close to $500 million in health, biomedical sciences, and life sciences infrastructure, creating innovative research and training environments to help revitalize Canada’s health-care system. Contact us Dean's Office 200 Lees Avenue, room 513Ottawa ON K1N 6N5Canada[email protected] Academic Office Montpetit Hall125 University, room 232Ottawa ON K1N 6N5CanadaAcademic Office homepage",
  "content_length": 3778,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:10"
}