{
  "name": "Pascal Meißner",
  "homepage": "https://fiw.thws.de/fakultaet/personen/dozentinnen-und-dozenten/person/prof-dr-ing-pascal-meissner",
  "status": "success",
  "content": "Dozentinnen und Dozenten :: Technische Hochschule Würzburg-Schweinfurt Zum Inhalt wechseln Zum Hauptmenü wechseln Zum Navigationspfad wechseln Zur Suche wechseln Zur Sprachauswahl wechseln Zur Servicenavigation wechseln Dozentinnen und Dozenten Prof. Dr.-Ing. Pascal Meißner Fakultät Informatik und Wirtschaftsinformatik Telefon +49 931 3511-8353 E-Mail pascal.meissner[at]thws.de Besucheranschrift Franz-Horn-Straße 2 97082 Würzburg Raum K.3.12 Sprechstunden Right after my courses Aufgabenbereich(e) Research Professor at the Center for Artificial Intelligence, Head of Examinations Committee and Programme Leader for the M.Sc. Artificial Intelligence, Deputy Head of the Center for Artificial Intelligence Lehrgebiete Teaching Courses (taught in English)Fundamentals of Mobile Robotics (M.Sc. Artificial Intelligence)Computer Vision: Artificial Intelligence Applied (B.Eng. Computer Science / Business Information Systems)Courses (taught in German)Fundamentals of Theoretical Computer Science (B.Eng. Computer Science)Non-course Teaching ResponsibilitiesHead of Examinations Committee for M.Sc. Artificial IntelligenceProgramme Leader for M.Sc. Artificial IntelligenceProject and thesis supervision for the M.Sc. Artificial Intelligence Projekte Funding, Grants and Collaborations I am always open to pursuing new ideas. It is, unfortunately, possible that I don't know your work yet, but if you think a collaboration could be fruitful, please feel free to email me.ConsultanciesRat der Region Mainfranken (Fachlicher Sprecher des Kompetenzfelds IT & KI) Publikationen Research Research keywords (in alphabetical order): Autonomous Vehicle Navigation, Computer Vision for Automation, Computer Vision for Manufacturing, Cooperative Manipulators, Grasping, Industrial Robots, Intelligent and Flexible Manufacturing, Learning and Adaptive Systems, Localization, Mapping, Mobile Manipulation, Motion and Path Planning, Object Detection / Segmentation / Categorization, Planning / Scheduling and Coordination, Probability and Statistical Methods, Range Sensing, Reactive and Sensor-Based Planning, Recognition, RGB-D Perception, Semantic Scene Understanding, Service Robots.Publication details:I do have a Google Scholar profile, a LinkedIn profile, a ResearchGate profile, and a GitHub account.My ORCID is 0000-0002-7918-1566.Personal right to supervise PhDs through the doctoral center Sustainable and Intelligent Systems (NISys). Vita Personal Details 2024: Offer for Associate Professorship in AI & Robotics (declined)Institution: Institut Mines-Télécom Atlantique, Computer Science Department, FR2022: Offer for Associate Professorship in Mobile Robotics (declined)Institution: Technical University of Applied Sciences Wuerzburg-Schweinfurt, Faculty of Electrical Engineering (FE), DEPhD (Dr.-Ing.) from Karlsruhe Institute of Technology (KIT), GermanyDiscipline: Computer Science, grade: magna cum laude (very good), completion:  6th July 2018Thesis: Indoor Scene Recognition by 3-D Object Search for Robot Programming by DemonstrationJury presidents: Prof. Gregor Snelting (KIT), Prof. Dennis Hofheinz (KIT)Supervisors: Prof. Ruediger Dillmann (KIT), Prof. Michael Beetz (University of Bremen)Examiners: Prof. Torsten Kroeger (KIT), Prof. Sebastian Abeck  (KIT)Diploma (Dipl.-Inform.) from Karlsruhe Institute of Technology (KIT), GermanyMajor: Computer Science, minor: Philosophy, grade: very good (1.2), completion: 6th April 2010Thesis: Part and Contour-oriented Classification and Pose Estimation of Tables and Chairs using Multisensory Depth DataSupervisors: Prof. Ruediger Dillmann (KIT), Prof. Juergen Beyerer (KIT)Short BiographyPascal Meißner graduated in computer science (’10) and obtained a PhD (’18) in this discipline from Karlsruhe Institute of Technology (KIT), Germany. He held a research scholarship at FZI Research Center for Computer Science, Germany ('10-'13) and was academic staff at KIT ('13-'17). Then, after heading a junior research group at KIT (’18-'20) and holding an assistant professor post at the University of Aberdeen, United Kingdom (’20-'22), he joined CAIRO (Center for Artificial Intelligence), Germany ('22) as an associate professor (research). His interests lie in autonomous robots, computer vision, machine learning, and artificial intelligence. His research includes the development of object pose estimation and scene understanding capabilities for robots as well as the investigation of learning-based robotic grasping and robot programming by demonstration. Prof. Meißner is an associate editor of several IEEE conference proceedings and an active member of the IEEE Robotics and Automation Society (MIEEE’15).",
  "content_length": 4663,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:12"
}