{
  "name": "Pascal Bercher",
  "homepage": "https://cs.anu.edu.au/people/pascal-bercher",
  "status": "success",
  "content": "Pascal Bercher | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Biography If you want to learn more about me, my personal website presents my entire academic CV. Jan. 2025-today: (tenured) Associate Professor at the ANU. Jan. 2022-2024: (tenure-track) Senior Lecturer at the ANU. Nov. 2019-Dec. 2021: (tenure-track) Lecturer at the ANU. Oct. 2016-Oct. 2019: Project coordinator (over the entire runtime) of the technology transfer project “Do it yourself, but not alone: Companion-Technology for Home Improvement”, which was a collaboration between two Institutes of Ulm University and the Corporate Research Sector of Robert Bosch GmbH. July 2009-Dec. 2017: Dr. rer. nat. at the Institute of Artificial Intelligence of Ulm University, Germany. My supervisor was Prof. Dr. Susanne Biundo-Stephan. Oct. 2003-June 2009: Studies of Computer Science (Diploma, which is roughly Bachelor + Master in one degree) at the University of Freiburg, Germany. Research My research area is Artificial Intelligence (AI) Planning, also often referred to as Automated Planning. More specifically, I’m an expert for the following planning areas: Hierarchical Task Network (HTN) planning and Partial Order Causal Link (POCL) planning. The first is a hierarchical approach to planning that bases upon problem decomposition refining an abstract problem until it’s “primitive” and thus solved. (I also created a website for this discipline.) The second is concerned with reasoning about partially ordered sets of actions. Technology-wise, I’m interested in: Computational Complexity Analysis Algorithm and Heuristic Design Providing Modeling Assistance (this involves the above two!) Teaching, Project, and PhD Supervision This is just an excerpt of my teaching activities. For a complete list, visit my personal webpage (teaching). Coursework: In S1 2025 I convene COMP3630 (Theory of Computation). Looking for undergraduate research projects? I supervise several research projects each semester. You find a list of topics and several further information on my personal webpage (projects). For S2 2025 I will most likely not accept any further students as I’m already maxed out supervision-wise. If you are still looking for a research project (even if not with me), you might want to check out my personal webpage (research opportunities), where I give advice on how to find a supervisor. Looking for a PhD? I do not have any open positions. But maybe I can help you find another position… How? By providing a few helpful links and other advice. Check out my personal webpage (prospective PhD students). Service Roles I take multiple service roles at the ANU: I’m a member of the SOCO recognition and elevation committee (REC). Their job is to make sure SOCO members apply for appropriate awards to receive the recognition they deserve. I’m a member of CSS’s Work, Health, and Safety (WHS) committee. I’m a first Aider and mental first aider. I’m an incident investigator. For a more detailed list, visit my personal webpage (service). Publications I publish quite a bit, please find all my publications (with bibtex and PDFs) on my personal webpage (publications). You can also find me on google scholar and DBLP. Honours & Awards I list the most important award below. For a complete list visit my personal webpage (awards). Research Awards: Winner of 5 of 6 tracks on HTN Planning of the International Planning Competition (IPC) 2023 at ICAPS 2023. (I did not participate in the sixth track.) ICAPS 2022 Best Undergraduate Student Paper Award (second of two authors) ICAPS 2021 Best Undergraduate Student Paper Award (second of two authors) ICAPS 2019 Best Dissertation Award ICAPS 2018 Best Student Paper Award (second of four authors) ICTAI 2018 Best Paper Award (third of four authors) Best reviewer Awards: ECAI Outstanding Program Committee (PC) Member Award 2024 ICAPS Outstanding Senior Program Committee (SPC) Member Award 2022 AAAI Outstanding Program Committee (PC) Member Award 2021 AAAI Outstanding Program Committee (PC) Member Award 2019 Theoretical Computer Science journal (year omitted to remain anonymity) Note that ICAPS is the premier conference for Planning and Scheduling, and ranked A* by CORE. Likewise, AAAI is one of two top-tier conferences for AI in general, and also ranked A* by CORE. ICTAI is ranked B and a large platform for AI research as well. What can somehow be regarded an award: I was awarded the Discovery Early Career Researcher Award (DECRA), making me an ARC DECRA Fellow (from April 2024 to April 2027). This is a research project, which funds, among others, two PhD students who will, with me and under my supervision, work on a research project I developed. This research focuses on modeling support for Automated Planning. The following is the publicly available abstract of the funded proposal: Artificial Intelligence (AI) planning technology is used to control systems like automated factories, robots, or to solve complex optimisation problems. Creating these models is however rather complex and error-prone and requires experts to create them in the first place. This project aims at developing techniques and tools for automated modelling support. They will make the modelling process easier and guarantee desired model properties such as the desired system behaviour. The tools will thus contribute towards making the technology more easily accessible to companies that might want to deploy them, while reducing costs for doing so and increasing the quality of these models. bars search times",
  "content_length": 5689,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:08"
}