{
  "name": "Pascal Germain",
  "homepage": "http://www.pascalgermain.info",
  "status": "success",
  "content": "Pascal Germain Professeur agrégé en informatiqueAssociate professor in computer science Département d’informatique et de génie logiciel, Pavillon Adrien-Pouliot, Local PLT-3949 Université Laval, Québec (QC), Canada, G1V 0A6 Courriel / e-mail: firstname.lastname@ift.ulaval.ca Chercheur en apprentissage automatiqueMachine learning researcher Groupe de recherche en apprentissage automatique de l'Université Laval (GRAAL) Centre de recherche en données massives (CRDM) Institut intelligence et données (IID) Intérêts de recherche / Research interests: Statistical machine learning theory (with an emphasis on PAC-Bayesian learning), domain adaptation, learning algorithms, representation learning, interpretability ... Étudiants gradués et postdoctorantsGraduate Students and Postdocs Actuels / Current Benjamin Leblanc (PhD supervision). Thibaud Godon (PhD supervision); co-supervised by Alexandre Drouin and Jacques Corbeil. Mathieu Bazinet (PhD supervision); co-supervised by Valentina Zantedeschi. Élina Francovic-Fontaine (PhD co-supervision); supervised by Jacques Corbeil. Sandrine Blais-Deschênes (PhD co-supervision); supervised by Josée Desharnais. Simon Bertrand (PhD co-supervision); supervised by Nadia Tawbi. Shubham Gupta (PhD co-supervision); supervised by Cem Subakan. Jacob Comeau (MSc co-supervision); supervised by Cem Subakan. Nathaniel D'Amours (MSc supervision); co-supervised by Christian Ethier. Maxence Verhaverbeke (MSc supervision); co-supervised by Yannick Dufresne. Karine Dufresne (PhD supervision). Anthony Lavertu (MSc supervision); co-supervised by Jacques Corbeil. Anciens / Past Sokhna Diarra Mbacke (PhD supervision). Louis-Philippe Vignault (MSc co-supervision); supervised by Audrey Durand. Gaël Letarte (PhD supervision); co-supervised by François Laviolette. Paul Viallard (PhD co-supervision); co-supervised by Emilie Morvant and supervised by Amaury Habrard. Mathieu Alain (MSc co-supervision); supervised by François Laviolette. Luxin Zhang (PhD co-supervision); co-supervised by Yacine Kessaci and supervised by Christophe Biernacki. Étienne Gael Tajeuna (postdoc supervison); co-supervised by Jacques Corbeil. Vera Shalaeva (postdoc supervision). Linkedin, GitHub, ORCID dblp, Google Scholar, Semantic Scholar Mathematics Genealogy Publications scientifiquesScientific Publications Voir aussi / See also: dblp, Google Scholar, Semantic Scholar Rapports techniques choisis / Selected Reports Sample Compression for Self Certified Continual Learning [ arXiv ] Jacob Comeau, Mathieu Bazinet, Pascal Germain, Cem Subakan (2025) Invariant Causal Set Covering Machines [ arXiv ] Thibaud Godon, Baptiste Bauvin, Pascal Germain, Jacques Corbeil, Alexandre Drouin (2025) Travaux révisés par les pairs / Peer-Reviewed Works Generalization Bounds via Meta-Learned Model Representations: PAC-Bayes and Sample Compression Hypernetworks [ proceedings ] [ arXiv ] Benjamin Leblanc, Mathieu Bazinet, Nathaniel D'Amours, Alexandre Drouin, Pascal Germain (ICML 2025) On Selecting Robust Approaches for Learning Predictive Biomarkers in Metabolomics Data Sets [ paper ] Thibaud Godon, Pier-Luc Plante, Jacques Corbeil, Pascal Germain, Alexandre Drouin (Analytical Chemistry 2025) Sample Compression Unleashed: New Generalization Bounds for Real Valued Losses [ proceedings ] [ arXiv ] Mathieu Bazinet, Valentina Zantedeschi, Pascal Germain (AISTATS 2025) Application of machine learning tools to study the synergistic impact of physicochemical properties of peptides and filtration membranes on peptide migration during electrodialysis with filtration membranes [ paper ] Zain Sanchez-Reinoso, Mathieu Bazinet, Benjamin Leblanc, Jean-Pierre Clément, Pascal Germain, Laurent Bazinet (Separation and Purification Technology 2025) Unsupervised Insider Threat Detection Using Multi-Head Self-Attention Mechanisms [ proceedings ] Simon Bertrand, Pascal Germain, Nadia Tawbi (Intelligent Cybersecurity Conference, ICSC 2024) Phoneme Discretized Saliency Maps for Explainable Detection of AI-Generated Voice [ proceedings ] [ arXiv ] Shubham Gupta, Mirco Ravanelli, Pascal Germain, Cem Subakan (Interspeech 2024) Seeking Interpretability and Explainability in Binary Activated Neural Networks [ proceedings ] [ arXiv preprint ] Benjamin Leblanc, Pascal Germain (World Conference on eXplainable Artificial Intelligence, xAI 2024) A General Framework for the Practical Disintegration of PAC-Bayesian Bounds [ article ] [ arXiv preprint ] Paul Viallard, Pascal Germain, Amaury Habrard, Emilie Morvant (Mach. Learn. 2024) Statistical Guarantees for Variational Autoencoders using PAC-Bayesian Theory [ proceedings ] [ arXiv ] Sokhna Diarra Mbacke, Florence Clerc, Pascal Germain (NeurIPS 2023) PAC-Bayesian Generalization Bounds for Adversarial Generative Models [ proceedings ] [ arXiv ] [ bibtex ] Sokhna Diarra Mbacke, Florence Clerc, Pascal Germain (ICML 2023) Erratum: Risk Bounds for the Majority Vote: From a PAC-Bayesian Analysis to a Learning Algorithm [ paper ] Pascal Germain, Audrey Durand, Louis-Philippe Vignault (JMLR 2023) Sample Boosting Algorithm (SamBA) - An Interpretable Greedy Ensemble Classifier Based On Local Expertise For Fat Data [ proceedings ] [ bibtex ] Baptiste Bauvin, Cécile Capponi, Florence Clerc, Pascal Germain, Sokol Koço, Jacques Corbeil (UAI 2023) PAC-Bayesian Learning of Aggregated Binary Activated Neural Networks with Probabilities over Representations [ proceedings ] [ arXiv ] [ bibtex ] Louis Fortier-Dubois, Benjamin Leblanc, Gaël Letarte, François Laviolette, Pascal Germain (CANAI 2023) Interpretable Domain Adaptation Using Unsupervised Feature Selection on Pre-trained Source Models [ paper ] [ preprint ] [ code ] Luxin Zhang, Pascal Germain, Yacine Kessaci, Christophe Biernacki (Neurocomputing 2022) Interpretable Domain Adaptation for Hidden Subdomain Alignment in the Context of Pre-Trained Source Models [ proceedings ] [ supplemental ] [ HAL ] [ spotlight ] [ code ] Luxin Zhang, Pascal Germain, Yacine Kessaci, Christophe Biernacki (AAAI 2022) Learning Stochastic Majority Votes by Minimizing a PAC-Bayes Generalization Bound [ proceedings ] [ arXiv ] Valentina Zantedeschi, Paul Viallard, Emilie Morvant, Rémi Emonet, Amaury Habrard, Pascal Germain, Benjamin Guedj (NeurIPS 2021) Self-Bounding Majority Vote Learning Algorithms by the Direct Minimization of a Tight PAC-Bayesian C-Bound [ paper ] Paul Viallard, Pascal Germain, Amaury Habrard, Emilie Morvant (ECML 2021) Target to Source Coordinate-wise Adaptation of Pre-trained Models [ paper ] [ supplemental ] [ video ] [ code ] Luxin Zhang, Pascal Germain, Yacine Kessaci, Christophe Biernacki (ECML 2020) Landmark-based Ensemble Learning with Random Fourier Features and Gradient Boosting [ paper ] [ video ] Léo Gautheron, Pascal Germain, Amaury Habrard, Guillaume Metzler, Emilie Morvant, Marc Sebban, Valentina Zantedeschi (ECML 2020) PAC-Bayesian Contrastive Unsupervised Representation Learning [ proceedings ] [ supplemental ] [ arXiv ] [ bibtex ] [ video ] [ code ] Kento Nozawa, Pascal Germain, Benjamin Guedj (UAI 2020) PAC-Bayes and Domain Adaptation [ published version ] [ arXiv ] [ bibtex ] Pascal Germain, Amaury Habrard, François Laviolette, Emilie Morvant (Neurocomputing 2020) Improved PAC-Bayesian Bounds for Linear Regression [ proceedings ] [ arXiv ] [ bibtex ] Vera Shalaeva, Alireza Fakhrizadeh Esfahani, Pascal Germain, Mihaly Petreczky (AAAI 2020) Dichotomize and Generalize: PAC-Bayesian Binary Activated Deep Neural Networks [ proceedings ] [ arXiv ] [ bibtex ] [ video ] [ code ] Gaël Letarte, Pascal Germain, Benjamin Guedj, François Laviolette (NeurIPS 2019) Pseudo-Bayesian Learning with Kernel Fourier Transform as Prior [ pdf, supplemental ] [ bibtex ] [ poster ] [ code, datasets ] Gaël Letarte, Emilie Morvant, Pascal Germain (AISTATS 2019) Multiview Boosting by Controlling the Diversity and the Accuracy of View-specific Voters [ published version ] [ arXiv preprint ] Anil Goyal, Emilie Morvant, Pascal Germain, Massih-Reza Amini (Neurocomputing 2019) Domain-Adversarial Training of Neural Networks [ pdf ] [ bib ] [ source code: shallow version | deep version ] [ data ] Yaroslav Ganin, Evgeniya Ustinova, Hana Ajakan, Pascal Germain, Hugo Larochelle, François Laviolette, Mario Marchand, Victor Lempitsky (JMLR 2016, and Springer 2017*) *A slighlty shorter version of the JMLR version is published as a book chapter in Domain Adaptation in Computer Vision Applications (Editor: Gabriela Csurka). PAC-Bayesian Analysis for a two-step Hierarchical Mutliview Learning Approach [ pdf ] Anil Goyal, Emilie Morvant, Pascal Germain, Massih-Reza Amini (ECML 2017) PAC-Bayesian Theory Meets Bayesian Inference [ paper ] [ spotlight: video | slides ] [ poster ] [ code ] Pascal Germain, Francis Bach, Alexandre Lacoste, Simon Lacoste-Julien (NIPS 2016) A New PAC-Bayesian Perspective on Domain Adaptation [ pdf ] [ supplemental ] [ bib ] [ source code ] [ data ] Pascal Germain, Amaury Habrard, François Laviolette, Emilie Morvant (ICML 2016) PAC-Bayesian Bounds based on the Rényi Divergence [ paper ] [ bib ] [ poster ] Luc Bégin, Pascal Germain, François Laviolette, Jean-Francis Roy (AISTATS 2016) Risk Bounds for the Majority Vote: From a PAC-Bayesian Analysis to a Learning Algorithm [ paper ] [ source code ] [ erratum ] Pascal Germain, Alexandre Lacasse, François Laviolette, Mario Marchand and Jean-Francis Roy (JMLR 2015) PAC-Bayesian Theory for Transductive Learning [ paper, supplemental ] [ bib ] [ poster ] [ source code ] Luc Bégin, Pascal Germain, François Laviolette, Jean-Francis Roy (AISTATS 2014) A PAC-Bayesian Approach for Domain Adaptation with Specialization to Linear Classifiers [ paper, supplemental ] [ bib ] [ source code ] [ data ] [ extended version ] Pascal Germain, Amaury Habrard, François Laviolette, Emilie Morvant (ICML 2013) A Pseudo-Boolean Set Covering Machine [ pdf ] Pascal Germain, Sébastien Giguère, Jean-Francis Roy, Brice Zirakiza, François Laviolette, and Claude-Guy Quimper (CP 2012) A PAC-B",
  "content_length": 13616,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:09"
}