{
  "name": "Pascal Bouvry",
  "homepage": "http://wwwen.uni.lu/snt/people/pascal_bouvry",
  "status": "success",
  "content": "Pascal BOUVRY - FSTM - University of Luxembourg I Uni.lu Dean of the Faculty of Science, Technology and Medicine Contact pascal.bouvry@uni.lu (+352) 46 66 44 5258 Details Profile Profile CV Functions Dean of the Faculty of Science, Technology and Medicine In detail Faculty of Science, Technology and Medicine Department of Computer Science Optimisation | Grid & parallel computing | Ad-hoc networks | Bioinformatics Maison du Savoir2, place de l’UniversitéL-4365 ESCH MSA, E16 1625010 pascal.bouvry@uni.lu (+352) 46 66 44 5258 Publications on ORBilu Pascal Bouvry is a full Professor of parallel computing and optimisation techniques within the Department of Computer Science at the University of Luxembourg. He leads the Parallel Computing and Optimisation group. He is also Head of the High Performance Computing (HPC) infrastructure at the University of Luxembourg. Since October 2023, he is the Dean of the Faculty of Science, Technology and Medicine. His research focuses on parallel computing and optimisation techniques. The application domains include new generations of distributed environments and bioinformatics. Prof. Bouvry has led the University’s activities in HPC the last years and is active in various international scientific committees and technical working groups. Pascal Bouvry is also member of the editorial boards of IEEE Transactions on Sustainable Computing, IEEE Cloud Computing Magazine, Springer journal on Communications and Sustainable Computing, and Elsevier journal in Swarm and Evolutionary Computation. He initiated the launch of the Master in Technopreneurship and the Master in High-Performance Computing at the University of Luxembourg. He regularly gives courses to Bachelor and Master students in intelligent systems: problem solving ; optimisation techniques ; parallel and grid computing ; cloud computing ; algorithmics ; distributed systems and middleware ; ICT. Prof. Bouvry gained industrial experience as manager of the technology consultant team for FICS (belonging to S1 corp) a world leader in electronic financial services. Next, he worked as CEO and CTO of SDC, a Saigon-based joint venture between SPT (the second telecom operator in Vietnam), Spacebel SA (a Belgian leader in Space, GIS and Healthcare), and IOIT, a public research and training center. After that, Prof. Bouvry moved to Montreal as VP Production of Lat45 and Development Director for MetaSolv Software, a world-leader in Operation Support Systems for the telecom industry (e.g. AT&T, Worldcom, Bell Canada, etc). Prof. Bouvry earned his undergraduate degree in Economical & Social Sciences and his Master degree in Computer Science with distinction (1991) from the University of Namur, Belgium. He went on to obtain his Ph.D. degree (1994) in Computer Science with great distinction at the University of Grenoble (INPG), France. His research at the IMAG laboratory focused on Mapping and scheduling task graphs onto Distributed Memory Parallel Computers. Next, he performed post-doctoral researches on coordination languages and multi-agent evolutionary computing at CWI in Amsterdam. Stay connected and subscribe to our newsletter All fields are mandatory Choose among our mailing list(s) Mailing list 0 items selected University of Luxembourg – News and events FSTM – News and events Enter your email address Example: contact@uni.lu Please provide a valid email address. Example: jean.dupont@gmail.com I agree to the use of my email address in the context of subscribing to the University of Luxembourg’s newsletters. I am aware that I can unsubscribe or update my profile by clicking the unsubscribe or update profile link in the email communication. More information about data processing. Subscribe now To the top",
  "content_length": 3741,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:12"
}