{
  "name": "Pascal Berrang",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/berrang-pascal.aspx",
  "status": "success",
  "content": "Dr Pascal Berrang - School of Computer Science - University of Birmingham Dr Pascal Berrang BSc School of Computer ScienceAssociate Professor in Computer Science Contact details Emailp.p.berrang@bham.ac.uk View my research portal AddressUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Pascal Berrang is a Associate Professor for the School of Computer Science, at the University of Birmingham. His research interests are in the field of IT Security & Privacy with a focus on Blockchain Technology, and Artificial Intelligence & Machine Learning. Please follow the link below to find out more about Pascal's work: Dr Pascal Berrang - personal webpage PhD in Computer Science (topic: privacy of biomedical data), Saarland University, 2018 BSc in Computer Science, Saarland University, 2013 Pascal Berrang qualified with a BSc in computer science at Saarland University in 2013. Subsequently, he joined the Graduate School at Saarland University and became a PhD student in the Information Security and Cryptography Group under supervision of Michael Backes. He submitted his PhD thesis in November 2017 and received his PhD in July 2018 being awarded the highest possible grade “summa cum laude\". His PhD thesis has the title \"Quantifying and Mitigating Privacy Risks in Biomedical Data\" and received the Dr. Eduard-Martin award 2019 for the best PhD thesis in the category in mathematics and computer science. In 2017, Pascal Berrang started working as a freelance researcher and consultant for the blockchain project Nimiq. In October 2020, he then became Lecturer at the University of Birmingham working on Privacy of Health Data, Blockchain Protocols, and the intersection of Security & Privacy with Artificial Intelligence and Machine Learning. Recent publications Article Salem, A, Berrang, P, Humbert, M & Backes, M 2019, 'Privacy-Preserving Similar Patient Queries for Combined Biomedical Data', PoPETs, vol. 2019, no. 1, pp. 47-67. https://doi.org/10.2478/popets-2019-0004 Conference article Raab, R, Berrang, P, Gerhart, P & Schröder, D 2025, 'SoK: Descriptive Statistics Under Local Differential Privacy', PoPETs, vol. 2025, no. 1, pp. 118–149. https://doi.org/10.56553/popets-2025-0008 Wu, Y, He, X, Berrang, P, Humbert, M, Backes, M, Gong, N & Zhang, Y 2024, 'Link Stealing Attacks Against Inductive Graph Neural Networks', PoPETs, vol. 2024, no. 4, pp. 818–839. https://doi.org/10.56553/popets-2024-0143 Berrang, P, Gerhart, P & Schröder, D 2024, 'Measuring Conditional Anonymity—A Global Study', PoPETs, vol. 2024, no. 4, pp. 947–966. https://doi.org/10.56553/popets-2024-0150 Conference contribution Wu, Y, Wen, R, Backes, M, Berrang, P, Humbert, M, Shen, Y & Zhang, Y 2024, Quantifying Privacy Risks of Prompts in Visual Prompt Learning. in 33rd USENIX Security Symposium (USENIX Security 24). USENIX Conference Proceedings, USENIX , pp. 5841-5858, 33rd USENIX Security Symposium, Philadelphia, Pennsylvania, United States, 14/08/24. <https://arxiv.org/abs/2310.11970> Esiyok, I, Berrang, P, Cohn-Gordon, K & Kuennemann, R 2023, Accountable Javascript Code Delivery. in NDSS Symposium 2023 Accepted Papers., f96, The Internet Society, pp. 1-17, Network and Distributed System Security (NDSS) Symposium 2023, San Diego, California, United States, 27/02/23. https://doi.org/10.14722/ndss.2023.24096 Yang, Z, He, X, Li, Z, Backes, M, Humbert, M, Berrang, P & Zhang, Y 2023, Data Poisoning Attacks Against Multimodal Encoders. in A Krause, E Brunskill, K Cho, B Engelhardt, S Sabato & J Scarlett (eds), Proceedings of the 40th International Conference on Machine Learning. Proceedings of Machine Learning Research, vol. 202, Proceedings of Machine Learning Research, pp. 39299-39313, The Fortieth International Conference on Machine Learning, Honolulu, Hawaii, United States, 23/07/23. <https://proceedings.mlr.press/v202/yang23f/yang23f.pdf> Wang, Z, Chaliasos, S, Qin, K, Zhou, L, Gao, L, Berrang, P, Livshits, B & Gervais, A 2023, On how zero-knowledge proof blockchain mixers improve, and worsen user privacy. in WWW '23: Proceedings of the ACM Web Conference 2023. Association for Computing Machinery (ACM), pp. 2022-2032, The Web Conference 2023, Austin, Texas, United States, 30/04/23. https://doi.org/10.1145/3543507.3583217 Backes, M, Berrang, P, Hanzlik, L & Pryvalov, I 2022, A framework for constructing Single Secret Leader Election from MPC. in V Atluri, R Di Pietro, CD Jensen & W Meng (eds), Computer Security – ESORICS 2023: 27th European Symposium on Research in Computer Security, Copenhagen, Denmark, September 26–30, 2022, Proceedings, Part II. 1 edn, Lecture Notes in Computer Science, vol. 13555, Springer, Cham, pp. 672–691, 27th European Symposium on Research in Computer Security, Copenhagen, Denmark, 26/09/22. https://doi.org/10.1007/978-3-031-17146-8_33 Hagestedt, I, Humbert, M, Berrang, P, Lehmann, I, Eils, R, Backes, M & Zhang, Y 2020, Membership Inference Against DNA Methylation Databases. in IEEE European Symposium on Security and Privacy (EuroS&P). Hagestedt, I, Zhang, Y, Humbert, M, Berrang, P, Tang, H, Wang, X & Backes, M 2019, MBeacon: Privacy-Preserving Beacons for DNA Methylation Data. in Proceedings of the 26th Annual Network and Distributed System Security Symposium (NDSS). Salem, A, Zhang, Y, Humbert, M, Berrang, P, Fritz, M & Backes, M 2019, ML-Leaks: Model and Data Independent Membership Inference Attacks and Defenses on Machine Learning Models. in Proceedings of the 26th Annual Network and Distributed System Security Symposium (NDSS). Berrang, P, Humbert, M, Zhang, Y, Lehmann, I, Eils, R & Backes, M 2018, Dissecting Privacy Risks in Biomedical Data. in Proceedings of the 2018 IEEE European Symposium on Security and Privacy (EuroSP). IEEE. Backes, M, Berrang, P, Bieg, M, Eils, R, Herrmann, C, Humbert, M & Lehmann, I 2017, Identifying Personal DNA Methylation Profiles by Genotype Inference. in Proceedings of the 38th IEEE Symposium on Security and Privacy (S&P). IEEE, pp. 957-976. Doctoral Thesis Berrang, P 2017, 'Quantifying and Mitigating Privacy Risks in Biomedical Data', Saarland University. https://doi.org/doi:10.22028/D291-27302 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 6288,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:08"
}