{
  "name": "Pasi Raumonen",
  "homepage": "https://www.tuni.fi/en/pasi-raumonen",
  "status": "success",
  "content": "Pasi Raumonen | Tampere universitiesPasi RaumonenProfessor, sovellettu matematiikkaFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universitypasi.raumonen [at] tuni.fi (pasi[dot]raumonen[at]tuni[dot]fi)phone number+358503378719Hervanta CampusOrcidhttps://orcid.org/0000-0001-5471-0970About meI am a Professor of applied mathematics and I have a background in electrical engineering. My current research concentrates on 3D structure modelling of trees and forests from laser scanner data, uncertainty quantification of such modelling, and their applications in forest and ecological research. I am also one of the Principal Investigators in Academy of Finland’s Centre of Excellence in Modelling and Imaging 2018-2025 and FAME – Flagship of Advanced Mathematics for Sensing, Imaging and Modelling (2024-).Research topicsApplied mathematics, inverse problems, surface and object reconstruction, uncertainty quantification, tree and forest modelling, remote sensing (Lidar, point clouds) Selected publicationsMontagnoli A, Hudak A T, Raumonen P, Lasserre B, Terzaghi M, Silva C A, Bright B C, Vierling L A , de Vasconcellos B N, Chiatante D, Dumroese R K. 2024. Terrestrial laser scanning and low magnetic field digitization yield similar architectural coarse root traits for 32-year-old Pinus ponderosa trees. Plant Methods, 20, 102 (2024). https://doi.org/10.1186/s13007-024-01229-9 Su C, Kokosza A, Xie X, Pěnčík A, Zhang Y, Raumonen P, Shi X, Muranen S, Topcu M K, Immanen J, Hagqvist R, Safronov O, Alonso-Serra J, Eswaran G, Venegas M P, Ljung K, Ward S, Mähönen A, Himanen K, Salojärvi J, Fernie A R, Novák O, Leyser O, Pałubicki W, Helariutta Y, Nieminen K. 2023. Tree architecture: A strigolactone-deficient mutant reveals a connection between branching order and auxin gradient along the tree stem. Proceedings of the National Academy of Sciences of the United States of America, 2023  Vol. 120  No. 48  e2308587120, https://doi.org/10.1073/pnas.2308587120 Nunes M, Vaz M, Camargo J, Laurance W, de Andrade A, Vicentini A, Laurance S, Raumonen P, Jackson T, Zuquim G, Wu J, Penuelas J, ChaveJ, Maeda E. 2023, Edge effects on tree architecture exacerbate biomass loss of fragmented Amazonian forests. Nature Communications, 14, 8129 (2023). https://doi.org/10.1038/s41467-023-44004-5 Han T, Raumonen P, Sánchez-Azofeifa G A. 2023. A non-destructive approach to estimate buttress volume using 3D point cloud data. Ecological Informatics, Volume 77, November 2023, 102218. https://doi.org/10.1016/j.ecoinf.2023.102218 Calders K, Verbeeck H, Burt A, Origo N, Nightingale J, Malhi Y, Wilkes P, Raumonen P, Bunce R, Disney M. 2022. Laser scanning reveals potential underestimation of biomass carbon in temperate forest. Ecological Solutions and Evidence,  3, e12197. https://doi.org/10.1002/2688-8319.12197 Monica Herrero Huerta, Diego Gonzalez Aguilera, Pasi Raumonen. 2022. 4DRoot: root phenotyping software for temporal 3D scans by X-Ray Computed Tomography. Frontiers in Plant Science, Vol. 13, 2022, https://doi.org/10.3389/fpls.2022.986856 Brede B, Terryn L, Barbier N, Bartholomeu H Ms, Bartolo R, Calders K, Derroire G, Krishna Moorthy S, Lau A, Levick S R, Raumonen P,Verbeeck H, Wang D, Whiteside T, van der Zee J, Herold M. 2022. Non-destructive estimation of individual tree biomass: allometric models, terrestrial and UAV laser scanning. Remote Sensing of Environment, Vol 280, October 2022, 113180, https://doi.org/10.1016/j.rse.2022.113180 Maeda E, Nunes M, Calders K, Mendes de Moura Y, Raumonen P, Tuomisto H, Verley P, Vincent G, Zuquim G, Camargo J L. 2022. Shifts in structural diversity of Amazonian forest edges detected using terrestrial laser scanning. Remote Sensing of Environment, Vol 271, 15 March 2022, 112895, https://doi.org/10.1016/j.rse.2022.112895 Raumonen P, Brede B, Lau L, Bartholomeus H. 2021. A Shortest Path Based Tree Isolation Method For Uav Lidar Data. 2021 IEEE International Geoscience and Remote Sensing Symposium IGARSS, 2021, pp. 724-727,https://doi.org/10.1109/IGARSS47720.2021.9554346 Martin-Ducup O, II Mofack G, Wang D, Raumonen P, Ploton P, Sonké B, Barbier N, Couteron P, Pélissier R. 2021. Evaluation of automated pipelines for tree and plot metric estimation from TLS data in tropical forest areas. Annals of Botany, mcab051, https://doi.org/10.1093/aob/mcab051 Beyer R M, Basler D, Raumonen P, Kaasalainen M, Pretzsch H. 2021. Do trees have constant branch divergence angles? Journal of Theoretical Biology, Volume 512, 7 March 2021, 110567, https://doi.org/10.1016/j.jtbi.2020.110567 He, H.; Chen, X.; Mehmood, A.; Raivio, L.; Huttunen, H.; Raumonen, P.; Virkki, J. 2020. ClothFace: A Batteryless RFID-Based Textile Platform for Handwriting Recognition. Sensors, 2020, 20, 4878. https://doi.org/10.3390/s20174878 Terryn L, Calders K, Disney M, Origo N, Malhi Y, Newnham G, Raumonen P, Åkerblom M, Verbeeck M. 2020. Tree species classification using structural features derived from terrestrial laser scanning. ISPRS Journal of Photogrammetry and Remote Sensing, 168, October 2020, pp. 170–181. https://doi.org/10.1016/j.isprsjprs.2020.08.009 Krishna Moorthy S M, Raumonen P, den Bulcke J V, Calders K, Verbeeck H. 2020. Terrestrial laser scanning for non-destructive estimates of liana stem biomass. Forest Ecology and Management, Volume 456, 15 January 2020, 117751, 14p, https://doi.org/10.1016/j.foreco.2019.117751 Kunz M, Fichtner A, Härdtle W, Raumonen P, Bruelheide H, von Oheimb G. 2019. Neighbour species richness and local structural variability modulate aboveground allocation patterns and crown morphology of individual trees. Ecology Letters, Volume 22, Issue 12, December 2019, pp. 2130-2140, https://doi.org/10.1111/ele.13400 Brede B, Calders K, Lau A, Raumonen P, Bartholomeus H M, Herold M, Kooistra L. 2019. Non-destructive Tree Volume Estimation through Quantitative Structure Modelling: Comparing UAV Laser Scanning with Terrestrial Lidar. Remote Sensing of Environment, Volume 233, November 2019, 111355, https://doi.org/10.1016/j.rse.2019.111355 Pitkänen T, Raumonen P, Kangas A. 2019. Measuring stem diameters with TLS in boreal forests by complementary fitting procedure. ISPRS Journal of Photogrammetry and Remote Sensing, Volume 147, January 2019, Pages 294-306, https://doi.org/10.1016/j.isprsjprs.2018.11.027 Jackson T, Shenkin A, Wellpott A, Calders K, Origo N, Disney M, Burt A, Raumonen P, Gardiner B, Herold M, Fourcaud T, Malhi Y. 2019. Finite element analysis of trees in the wind based on terrestrial laser scanning data. Agricultural and Forest Meteorology, Volume 265, 2019, Pages 137-144. https://doi.org/10.1016/j.agrformet.2018.11.014 Raumonen P, Tarvainen T. 2018. Segmentation of vessel structures from photoacoustic images with reliability assessment. Biomedical Optics Express, Vol. 9, Issue 7, pp. 2887-2904, https://doi.org/10.1364/BOE.9.002887 Sievänen R, Raumonen P, Perttunen J, Nikinmaa E, Kaitaniemi P. 2018. A study of crown development mechanisms using a shoot-based tree model and segmented terrestrial laser scanning data. Annals of Botany, Volume 122, Issue 3, 27 August 2018, Pages 423–434, https://doi.org/10.1093/aob/mcy082 Disney M, Boni Vicari M, Burt A, Calders K, Lewis S, Raumonen P, Wilkes P. 2018. Weighing trees with lasers: advances, challenges and opportunities. Interface Focus 8: 20170048. http://dx.doi.org/10.1098/rsfs.2017.0048 Gonzalez de Tanago Menaca J, Lau A, Bartholomeus H, Herold M, Avitabile V, Raumonen P, Martius C, Goodman R, Disney M, Manuri S, Burt A, Calders K. 2018. Estimation of above-ground biomass of large tropical trees with Terrestrial LiDAR. Methods in Ecology and Evolution, Vol. 9, Issue 2, pp. 223-234, https://doi.org/10.1111/2041-210X.12904 Åkerblom M, Raumonen P, Mäkipää R, Kaasalainen M. 2017. Automatic tree species recognition with quantitative structure models. Remote Sensing of Environment, Vol. 191, 1-12, https://doi.org/10.1016/j.rse.2016.12.002 Potapov I, Järvenpää M, Åkerblom M, Raumonen P, Kaasalainen M. 2017. Bayes Forest: a data-intensive generator of morphological tree clones. GigaScience, Vol. 6, Issue 10, Pages 1–13, gix079, https://doi.org/10.1093/gigascience/gix079 Hackenberg J, Spiecker H, Calders K, Disney M, Raumonen P. 2015. SimpleTree —An Efficient Open Source Tool to Build Tree Models from TLS Clouds. Forests, Vol. 6, No. 11, 4245-4294, https://doi.org/10.3390/f6114245 Calders K, Newnham G, Burt A, Murphy S, Raumonen P, Herold M, Culvenor D, Avitabile V, Disney M, Armston J, Kaasalainen M. 2015. Non-destructive estimates of above-ground biomass using terrestrial laser scanning. Methods in Ecology and Evolution, Vol. 6, No. 2, pp. 198-208, https://doi.org/10.1111/2041-210X.12301 Raumonen P, Casella E, Calders K, Murphy S, Åkerblom M, Kaasalainen M. 2015. Massive-scale Tree Modelling from TLS Data. ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences, Volume II-3/W4, 189-196. https://doi.org/10.5194/isprsannals-II-3-W4-189-2015 Smith A, Astrup R, Raumonen P, Liski J, Krooks A, Kaasalainen S, Åkerblom M, Kaasalainen M. 2014. Tree Root system characterization and volume estimation by terrestrial laser scanning. Forests, Vol. 5, No. 12, pp. 3274-3294, https://doi.org/10.3390/f5123274 Janka M, Saukko E, Raumonen P, Lupo D. 2014. Optimization of large-area OLED current distribution grids with self-aligned passivation. Organic Electronics, Vol. 15, No. 12, pp. 3431–3438, https://doi.org/10.1016/j.orgel.2014.09.028 Raumonen P, Kaasalainen M, Åkerblom M, Kaasalainen S, Kaartinen H, Vastaranta M, Holopainen M, Disney M, Lewis P. 2013. Fast Automatic Precision Tree Models from Terrestrial Laser Scanner Data. Remote Sensing, Vol. 5, No. 2, pp. 491-520, https://doi.org/10.3390/rs5020491 Stenvall A, Tarhasaari T, Grilli F, Raumonen P, Vojenciak M, Pellikka M. 2012 Manifolds in electromagnetism and superconductor modelling: using their properties to model critical current of twisted conductors in self-field with 2-D m",
  "content_length": 11024,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:18"
}