{
  "name": "Patanjali SLPSK",
  "homepage": "https://patanjali.github.io",
  "status": "success",
  "content": "Patanjali SLPSK RV 2817, School of Computer and Cyber Sciences 100 Grace Hopper Lane Augusta, Georgia 30904 Hi, I am an Assistant Professor at the Department of Cybersecurity Engineering at Augusta. My research focuses on addressing the following question: How can we design, measure and build efficient and affordable security assurances for a given hardware design in the context of an untrusted supply chain while respecting the design constraints at each level of abstraction? I work on the following research areas, if you are interested in working with me or would like to more about my research, please feel free to reach out: AI for System Design: Data modelling and developing AI-models for designing the next generation of hardware systems AI for Hardware Security: Data modelling and AI-models for efficient countermeasure evaluation, vulnerability detection and AI-assisted countermeasures for mitigating higher-order supply chain threats Cybersecurity for AI: Developing metrics and algorithms for secure development, deployment and operations of AI-systems Previously, I worked as a Postdoctoral Researcher at University of Florida where I worked with Dr. Swarup Bhunia. I did my Ph.D. at IIT Madras, India where I was advised by Dr. Kamakoti Veezhinathan. News Jan 01, 2025 Joined Augusta University as Assistant Professor. Jul 01, 2024 Conducted a month long Cybersecurity workshop for Indian Army in conjunction with Pravartak and IIT Madras. Mar 07, 2024 Workshop on Hardware Security Mar 22, 2022 Our work on System on Chip Security was featured in the news Apr 22, 2019 Our Work on Netflix Privacy Analysis was featured in Wired Talks Jun 01, 2024 Delivered a talk on Cybersecurity and System Design at Sony Finishing School. IITM Pravartak. Jan 10, 2023 Delivered a demonstration on Secure SoC Architectures at Northrop Grumman. Jun 11, 2021 Delivered a Webinar on AI-guided heuristics for Trojan Attacks at IEEE CEDA/HSTTC organized Webinar on CAD for Assurance. Selected Publications IOLock: An Input/Output Locking Scheme for Protection Against Reverse Engineering Attacks Christopher Vega, Patanjali SLPSK, and Swarup Bhunia IEEE Transactions on Very Large Scale Integration (VLSI) Systems, Feb 2024 Abs DOI Bib Reverse engineering (RE) of hardware designs poses a significant threat to the modern distributed electronics supply chain. RE can be performed at both chip and printed circuit board (PCB) levels by using structural, functional, or combined analysis techniques. Recent studies on artificial intelligence (AI)-inspired RE techniques have seen a drastic increase in the effectiveness of such attacks. While various countermeasures, e.g., logic locking (LL) at the chip level and camouflaging at the board level, have been studies to combat RE, the advent of Boolean satisfiability (SAT)-based functional query at chip level and 3-D imaging attacks at board level has shown that these protections can be easily bypassed. We observe that a common factor that contributes to the success of these attacks at both chip and board levels is the ability of an attacker to observe the input/output (I/O) patterns of a working system. Based on this observation, we present a novel locking scheme called IOLock that can effectively prevent access to golden I/O behavior of a working system. IOLock restricts access to the actual I/Os of the chips in a PCB by introducing a low-overhead key management unit (KMU) that works in conjunction with internal encryption/decryption modules near the I/O ports. The encryption/decryption modules are designed to work with the existing joint test action group (JTAG) infrastructure. IOLock can be used in standalone mode or in conjunction with another LL scheme to enhance the overall security of the design. We evaluate the security guarantees offered by IOLock theoretically, through simulation, and hardware measurements. We show that IOLock provides robust protection against both chip-level and PCB-level RE attacks while incurring minimal design overhead. @article{iolock, author = {Vega, Christopher and SLPSK, Patanjali and Bhunia, Swarup}, journal = {IEEE Transactions on Very Large Scale Integration (VLSI) Systems}, title = {IOLock: An Input/Output Locking Scheme for Protection Against Reverse Engineering Attacks}, year = {2024}, volume = {32}, number = {2}, pages = {347-360}, keywords = {Registers;Pins;Cryptography;Threat modeling;Hardware security;Intellectual property;Reverse engineering;Printed circuits;Hardware security;IP protection;logic locking (LL);printed circuit board (PCB) security;reverse engineering (RE)}, doi = {10.1109/TVLSI.2023.3337310}, issn = {1557-9999}, month = feb } MeLPUF: Memory-in-Logic PUF Structures for Low-Overhead IC Authentication Christopher Vega, Patanjali SLPSK, Shubhra Deb Paul, and 2 more authors In 2023 IEEE Physical Assurance and Inspection of Electronics (PAINE), Oct 2023 Abs DOI Bib Physically Unclonable Functions (PUFs) are used for securing electronic devices across the implementation spectrum ranging from Field Programmable Gate Array (FPGA) to system on chips (SoCs). However, existing PUF implementations often suffer from one or more significant deficiencies: (1) Significant design overhead; (2) Difficulty to configure and integrate based on application-specific requirements; (3) Vulnerability to model-building attacks; and (4) Spatial locality to a specific region of a chip. These factors limit their application in the authentication of designs used in various applications. In this work, we propose MeLPUF: Memory-in-Logic PUF; a low-overhead distributed PUF that leverages the existing logic gates in a design to create cross-coupled inverters (i.e., memory cells), in a logic circuit as an entropy source. It exploits these memory cells’ power-up states as the source of entropy to generate device-specific unique fingerprints. A dedicated control signal governs these on-demand memory cells. They can be dispersed across the combinational logic of a design to achieve distributed authentication. They can also be synthesized with a standard logic synthesis tool to meet the target area, power, and performance constraints. We demonstrate the scalability of MeLPUF by aggregating power-up states from multiple memory cells, thus creating PUF signatures or digital identifiers of varying lengths. Our analysis shows the high quality of the PUF in terms of uniqueness, randomness, and robustness while incurring modest overhead. @inproceedings{melpufpaine, author = {Vega, Christopher and SLPSK, Patanjali and Paul, Shubhra Deb and Chatterjee, Atri and Bhunia, Swarup}, booktitle = {2023 IEEE Physical Assurance and Inspection of Electronics (PAINE)}, title = {MeLPUF: Memory-in-Logic PUF Structures for Low-Overhead IC Authentication}, year = {2023}, volume = {}, number = {}, pages = {1-7}, keywords = {Logic circuits;Authentication;Transforms;Logic gates;Robustness;Entropy;Table lookup}, doi = {10.1109/PAINE58317.2023.10317943}, issn = {}, month = oct } PROTECTS: Secure Provisioning of System-on-Chip Assets in Untrusted Testing Facility Patanjali SLPSK, Jonathan Cruz, Sandip Ray, and 1 more author In 2023 IEEE International Test Conference India (ITC India), Jul 2023 Abs DOI Bib System-on-Chips contain variety of Hardware Security Assets (HSAs) to protect the components of the system against untrusted entities. Binding the HSAs to each SoC silicon instance during the testing stage, known as provisioning, is a critical step in SoC life cycle since improper provisioning could compromise the secure, trustworthy field operation of SoC and/or lead to crucial supply chain threats (e.g., piracy, cloning and reverse engineering). However, existing SoC provisioning methods do not scale to more advanced threat vectors under the emergent zero trust model that considers the foundry and testing/assembly process untrustworthy. We address this problem through a comprehensive framework, PROTECTS that enables secure provisioning of HSAs under zero trust. We demonstrate PROTECTS using a representative RISC-V based SoC with diverse set of HSAs. Our analysis shows that PROTECTS incurs minimal design overheads (0.36%, 0.54% and 0.0%) in area, power, and gate-count, respectively, for the entire SoC), while providing strong security guarantees. @inproceedings{protects, author = {SLPSK, Patanjali and Cruz, Jonathan and Ray, Sandip and Bhunia, Swarup}, booktitle = {2023 IEEE International Test Conference India (ITC India)}, title = {PROTECTS: Secure Provisioning of System-on-Chip Assets in Untrusted Testing Facility}, year = {2023}, volume = {}, number = {}, pages = {1-6}, keywords = {Scalability;Supply chains;Computer architecture;Logic gates;Silicon;Foundries;Software;Zero Trust;SoC provisioning;Reverse Engineering;Counterfeiting;Piracy}, doi = {10.1109/ITCIndia59034.2023.10235499}, issn = {2833-8391}, month = jul } Invisible Scan for Protecting Against Scan-Based Attacks: You Can’t Attack What You Can’t See Pravin Gaikwad, Patanjali SLPSK, and Swarup Bhunia In 2023 IEEE International Test Conference India (ITC India), Jul 2023 Abs DOI Bib Sean-based Design-for- Test (DIT) infrastructure renders an ASIC design testable by making internal circuit nodes more controllable and observable. It, however, vastly conflicts with the security requirements of a design by making on-chip assets vulnerable to scan-based attacks. To address this critical security issue, over the past two decades, numerous scan protection solutions have been investigated. However, none of the existing solutions addresses the growing need to protect a scan chain under the emergent zero trust model. This model considers a fully untrusted fabrication and testing facility consistent with the modern globally distributed supply chain ecosystem. Under this model, existing protection against scan-based DIT can be easily bypassed, leading to unauthorized scan access. This work, for the first time, analyzes the vulnerabilities of state-of-the-art scan counte",
  "content_length": 13645,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:15"
}