{
  "name": "Patricia Bouyer-Decitre",
  "homepage": "http://www.lsv.ens-cachan.fr/~bouyer",
  "status": "success",
  "content": "Laboratoire Spécification et Vérification Patricia Bouyer-Decitre Senior researcher, CNRS Director of LMF (Laboratoire Méthodes Formelles) Since January 1, 2021, the LSV and the Vals team of LRI form the \"Laboratoire Méthodes Formelles\". (Formal Methods Lab). The new lab is a joint research unit (UMR9021) between University Paris-Saclay, CNRS and ENS Paris-Saclay. The lab has two institutional partners, CentraleSupélec and Inria. My new webpage on the LMF website Some pointers on my research ERC project I have been the Principal Investigator of ERC project EQualIS, January 2013 - February 2019. The tool TiAMo developped in this project. My publications My DBLP profile; my google scholar profile Some of my recent talks My curriculum vitae in english [July 2022] and in french [July 2022] Professional activities I will be PC co-chair of the conference FoSSaCS'22 I have been the PC chair of the conference LICS'19, which took place in Vancouver (Canada) in June 2019. I am a member of the editorial board of the Journal of Logical and Algebraic Methods in Programming (JLAMP) and of the journal Acta Informatica I take and took part to several programme committees of conferences. I have been the president of the committee for the Gilles Kahn PhD thesis award (2016-2018) I have been a member of section 6 of comité national (2012-2016) I have been the workshop chair of LICS conference (2013-2018) I teach in lecture 2.8.2 of Master parisien de recherche en informatique. Students supervision I co-supervise three PhD students: Nathan Thomasset (started in Sept. 2019, co-supervised by Stéphane Le Roux) Pierre Vandenhove (started in Oct. 2019, joint PhD thesis with UMONS Belgium, co-supervised by Mickael Randour) Benjamin Bordais (started in Sept. 2020, co-supervised by Stéphane Le Roux) Former students Awards I am the recipient of the Presburger Award in 2011, given by the EATCS. The ceremony took place during the conference ICALP'11 I have received the bronze medal of CNRS in 2007 I have been awarded a Marie Curie fellowship in 2006, for a one-year stay at Oxford University. Projects Ongoing projects Ticktac Past projects ImpRo P2R AS 93 du RTP 23 Misc Personal links Games Swimming? Pontivy forever Want to visit Damgan? Photography The cutest baby :-) in 2010, in 2011 and in 2012 The cutests babies :-) In 2013, in 2014, in 2015, in 2016, in 2017, in 2018, in 2019 and in 2020 Some of my favorite pictures My stay at Oxford in pictures A wonderful sunset in Iceland: in large or in small format A nice hotel The burger imperialism A one-picture-a-day website Astronomy Picture of the Day Visit the world with Geo Magazine! Computer science Le petit Nicolas en thèse How to have a rejected abstract? About LSV News People Research Seminars Teaching Contact Private Pages English Français Contact Address LSV, CNRS & ENS Paris-Saclay4, avenue des Sciences91190 Gif-sur-Yvette, France Office Bâtiment Nord, office 1S60 Phone +33 (0)1 81 87 ** ** with ** ** = 54 34 E-Mail bouyer (at) lmf (dot) cnrs (dot) fr Events FORMATS'23 September 2023 Antwerp (Belgium) TIME'23 September 2023 Athens (Greece) EUMAS'23 September 2023 Naples (Italy) RADICAL'23 September 2023 Antwerp (Belgium) CiE'24 July 2024 Amsterdam (The Netherlands) ICALP'24 July 2024 *** (***) Événements passés",
  "content_length": 3296,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:22"
}