{
  "name": "Patrick Marais",
  "homepage": "https://people.cs.uct.ac.za/~patrick",
  "status": "success",
  "content": "Patrick's CS Web Site Patrick Marais Home Research Teaching Publications About me I am an Associate Professor in the Department of Computer Science at the University of Cape Town. My initial studies were completed in South Africa at the University of Cape Town - BSc (computer science), BSc (Hons) (applied mathematics) and MSc (computer science). I later obtained my PhD in medical imaging from the University of Oxford in the UK. My research is currently focused on point cloud segmentation and analysis through machine learning and the analysis of drone imagery for crop management. I am also working in several other areas which utilise image processing, computer vision and machine learning. I am a member the Collaborative Visual Computing (CVC) laboratory and the High Performance Computing (HPC) laboratory. Contact details Contact Details: email - patrick [at] cs [dot] uct [dot] ac [dot] za office - RM309, computer science building, upper campus Postal Address: Department of Computer Science University of Cape Town Private Bag X3 Rondebosch 7701 South Africa Research Interests My research is currently focused around applications of computer vision and image processing, with an emphasis on machine learning. The two major themes are (1) 3D point cloud segmentation and analysis, focused on eroded and deteriorating cultural heritage sites; (2) analysis of drone/UAV imagery for orchard management. Prior to 2017 my work focused on computer graphics, mainly procedural modelling and sketch-based interfaces for such systems as well as novel interfaces for 3D data manipulation. This page lists the projects on which I am currently collaborating as well as some recently completed work. Please refer to the Publications page for publications which might have arisen from these projects or earlier work. Current research projects Structure/symmetry discovery in large cultural heritage site models (computer vision/machine learning) Efficient drone-based reconstruction of culutral heritage site models (computer vision) Semi-automated segmentation and cleaning of cultural heritage point clouds (machine learning) Bone age estimation from hand x-ray images (machine learning) Virtual Lecture tracking for 4K video streams (computer vision) Segmentation and analysis of drone imagery for orchards (computer vision/machine learning) I am seeking to recruit graduate students in the broad areas of 3D point cloud segmentation/analysis and drone/UAV-based image analysis for orchards/crop monitoring. Furthermore, I am also interested in related areas which emphasize the use of computer vision techniques coupled with machine learning. Recently completed projects Efficient matching for 3D fingerprints (DOI) Machine learning for better Warfarin dosing models (DOI) Semi-automated cleaning of cultural heritage scan campaigns (DOI) Teaching In 2023 I will be course coordinator for CSC3022F and CSC4029Z. I will also teach the following courses/modules: CSC3022F Introduction to C++ CSC4029Z 3D Computer Graphics I will be on sabbatical in the second half of 2023 so CSC5029Z will not be offered. Please refer to Vula for resources/assignments related to the courses listed above. The following are additional references/resources for the above courses: (None at present) Journal Publications A UAV-based sparse viewpoint planning framework for detailed 3D modelling of cultural heritage monuments. Z. Wu, P. Marais and H. Ruther. ISPRS Journal of Photogrammetry and Remote Sensing. Vol 218, pages 555 - 571. 2024. DOI: https://doi.org/10.1016/j.isprsjprs.2024.10.028 Evaluating warfarin dosing models on multiple datasets with a novel software framework and evolutionary optimisation. Journal of Biomedical Informatics. G. Truda and P. Marais. Journal of Biomedical Informatics, vol. 113, 2021. DOI: https://doi.org/10.1016/j.jbi.2020.103634 Semi-automated cleaning of laser scanning campaigns with machine learning. P Marais, M. Dellepiane, P. Cignoni and R. Scopigno. Journal of Computing and Cultural Heritage.J. Comput. Cult. Herit. 12, 3, Article 16 (June 2019), 29 pages. DOI: https://doi.org/10.1145/3292027 Montblanc: GPU accelerated Radio Interferometer Measurement Equations in support of Bayesian Inference for Radio Observations. S. Perkins, P. Marais, J. Swart, I. Natarajan, C. Tasse and O. Smirnoff. Astronomy and Computing. vol 12, pg 73-85, 2015. Parallel, Realistic and Controllable Terrain Synthesis. James Gain, Bruce Merry and Patrick Marais. Computer Graphics Forum. vol 34, No 2, pg 105-116, 2015 Moving least-squares reconstruction of large models with GPUs. Bruce Merry, James Gain and Patrick Marais. IEEE Trans. Vis. Comput. Graph., Vol 20, No 2, pp 249 - 261, 2014. Three-dimensional surface deformation based shape analysis of hippocampus and caudate nucleus in children with fetal alcohol spectrum disorders. J Joseph, C Warton, SW Jacobson, JL Jacobson,CD Molteno, A Eicher, P Marais, OR Phillips, KL Narr, EM Meintjes. Human brain mapping 35 (2), 659-672, 2014. Fast in-place binning of laser range-scanned point sets. Bruce Merry, James Gain and Patrick Marais. Journal of Computing and Cultural Heritage (JOCCH), vol 6, No 3, 2013. Field D* path-finding on weighted triangulated and tetrahedral meshes. Simon Perkins, Patrick Marais, James Gain and Mark Berman. Autonomous Agents and Multi-Agent Systems, Volume 26, Issue 3, pp 354-388, May 2013. Towards Realistic and Interactive Sand Simulation: A GPU-based Framework. Juan-Pierre Longmore, Patrick Marais and Michelle Kuttel. Powder Technology, Vol 235, pp 983-1000, Feb 2013. http://dx.doi.org/10.1016/j.powtec.2012.10.056 A Heuristic Image Search Algorithm for Active Shape Model Segmentation of the Caudate Nucleus and Hippocampus in Brain MR Images of Children with FASD. A. Eicher, P. Marais, C. Warton, S. Jacobson, J. Jacobson, C. Molteno and E. Meintjes. South African Computer Journal, Vol. 49, pp. 35-53, 2012. ISSN: 1015-7999. Enhanced Texture-Based Terrain Synthesis on Graphics Hardware. Flora Ponjou-Tasse, James Gain and Patrick Marais. Computer Graphics Forum, Vol. 31, No. 6, pp. 1959-1972, 2012. ISSN: 1467-8659. Efficient compression of molecular dynamics trajectory files. Patrick Marais, Julian Kenwood, Keegan Carruthers Smith, Michelle M. Kuttel, James Gain. Journal of Computational Chemistry, Vol. 33, No. 27, pp. 2131-2141, 2012. ISSN: 0192-8651. Simplifying Character Skins with Analytic Error Metrics. Bruce Merry, Patrick Marais and James Gain. Computer Graphics Forum, Vol 29 No. 1, pp 13-24, 2010. Exhaustive computational search of ionic-charge clusters that mediate interactions between mammalian cytochrome P450 (CYP) and P450-oxidoreductase (POR) proteins. A. Zawaira, M. Gallotta, N. Beeton-Kempen, L. Coulson, P. Marais, M. Kuttel and J. Blackburn. Computational Biology and Chemistry, Vol. 34, No. 1, pp. 42-52, February 2010. Distance-Ranked Connectivity Compression of Triangle Meshes. Patrick Marais, James Gain and Dave Shreiner. Computer Graphics Forum, Vol. 26, No. 4, pp. 813-823, 2007. (Zipped PDF file - 5.35MB) High fidelity compression of irregularly sampled height-fields. Patrick Marais and James Gain, South African Computer Journal, pp 40-50, Vol 38, June 2007. (Zipped PDF file - 1636KB) Animation space: A truly linear framework for character animation. Bruce Merry, Patrick Marais and James Gain, ACM Transactions on Graphics, Vol. 25, No. 4, pp. 1400-1423, October 2006. (Zipped PDF file - 467KB) Compression of Dense and Regular Point Clouds, Bruce Merry, Patrick Marais and James Gain. Computer Graphics Forum, Vol. 25, No. 4, pp. 709-716, December 2006. (Zipped PDF file - 6.6MB) Warp Sculpting, J. Gain and P. Marais. IEEE Trans. on Visualization and Computer Graphics, pp 217-227, Vol 11, No 2, March/April 2005. (Zipped PDF file - 1338KB) Model-based Segmentation of CT Images, O. Marte and P. Marais. South African Computing Journal, Vol 28, pp 54-59, 2002. Detecting the brain surface in sparse MRI using boundary models,P. Marais and J. M. Brady, Medical Image Analysis, Vol. 4(3), pp 283-302, September 2000, Elsevier Science. Conference Publications Deep Learning for Cleaning Cultural Heritage Point Clouds, L. Hayward, P. Marais and Jan Dirk Wegner. In Proceedings of the 5th Southern African Conference for Artificial Intelligence Research (SACAIR'24), pp 52 - 67. Bloemfontein, South Africa, December 2024. ISBN : 978-0-7961-6069-0, URL: https://2024.sacair.org.za/wp-content/uploads/2024/12/SACAIR24_vol_II.pdf Low Resource, Post-processed Lecture Recording from 4K Video Streams, C. Fitzhenry, T. Khatieb, P. Marais and S. Marquard. In Proceedings of the 43rd South African Institute for Computer Scientists and Information Technologists Conference (SAICSIT 2022), July 2022. Epic Series in Computing, vol 85. ISSN: 2398-7340. https://doi.org/10.29007/vfb6 Matching fingerprints with a toroidal Iterative Closest Point Algorithm. C. Pitcher, P. Marais and L. Darlow. In Proceedings of the South African Institute for Computer Scientists and Information Technologists Conference (SAICSIT 2020), September 2020. ACM Press. ISBN: 9781450388474. https://doi.org/10.1145/3410886.3410893 Supervised learning and image processing for efficient malaria detection. M. White and P. Marais. SA Forum for Artificial Intelligence (FAIR'19), December 2019, Cape Town, South Africa. URL: http://ceur-ws.org/Vol-2540/ Accelerating Point Cloud Cleaning. R. Mulder and P. Marais. Eurographics Workshop on Graphics and Cultural Heritage, Genoa, Italy, Oct 2016. Eurographics Association. ISBN: 978-3-03868-011-6. http://dx.doi.org/10.2312/gch.20161410. Reimagining gamification through the lens of Activity Theory.H. Vermeulen, J. Gain, P. Marais, S. O’Donovan. In Proceedings of the 49th Hawaii International Conference on System Sciences, Hawaii, USA. Jan. 2016 Scientific Visualization of Radio Astronomy Data using Gesture Interaction. In Proceedings Astronomical Data Analysis Software and Systems conference (ADASS XXIV), Calgary, Canada, Vo",
  "content_length": 17423,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:31"
}