{
  "name": "Patrick Crowley",
  "homepage": "https://www.arl.wustl.edu/~pcrowley",
  "status": "success",
  "content": "Patrick Crowley Welcome Patrick Crowley I am Professor of Computer Science & Engineering at Washington University. I am also the founder of Observable Networks, which was acquired by Cisco Systems in 2017. My interests span networking and computer systems, and much of my teaching and research has involved programmable networked systems, high-speed networking, network security, and information-centric networking. Research My goal is to develop networked systems with improved privacy, performance, scalability & ease-of-use, relative to contemporary systems.​ If you do systems networking research, the Open Network Lab might be useful to you. My primary current project is the Instrumented Multi-Platform Overlay, IMO sponsored by NSF. My recent projects can be organized into the following themes. More secure infrastructure for today's Internet. Founded Observable Networks, a cloud security SaaS company, based on my invention of endpoint modeling. New directions for tomorrow's Internet. Long-term research activity in Named Data Networking, a new approach to computer communications.​ Scalable algorithms, data structures, and protocols. Progress in networked systems relies on the invention of these new building blocks, to enable new possibilities.​ My collaborators and I have authored many papers on these subjects, and several are highly cited. Google Scholar is the best way to access my publications. My recent projects have been sponsored by DARPA, NSF, and Intel Corp. Teaching Except for the occasional break, I teach one class each in the Fall and Spring semesters. CSE 523: Systems Security (S25, F24, S24, F23, S23, F22, S22, S17, F15) CSE 591: Introduction to Graduate Study in CSE (F22, F16, F11, F10, F09) ID 141: The Digital Society (F16) CSE 507A: Technology Entrepreneurship (S15, S13, S11, S07) CSE 561: Computer Systems Architecture II (F14, S12, S10, S08, S06, S05, S04) CSE 361: Introduction to Systems Software (F12, F10, F05) CSE 560: Computer Systems Architecture I (F09, F08, F07, F06, F04, F03) Biography 2021: Fulbright-Nokia Distinguished Chair in Information & Communications Technologies, University of Helsinki, Helsinki, Finland 2021-2017: While on partial leave from WashU following sale of Observable Networks, Product Engineering executive in Security Business Group, Cisco Systems, Inc. 2017-2011: Founder & CTO of Observable Networks, Inc. 2015: Promoted to Professor 2009: Promoted to Associate Professor with tenure 2003: Joined WashU CSE as Assistant Professor 2003: PhD in Computer Science & Engineering (CSE), University of Washington, Seattle 1996: BA in Math, Physics, and Computer Science, Illinois Wesleyan University Contact Online Email pcrowley @ wustl.edu Twitter @pcrwly On Campus McKelvey Hall, Room 2039 Mailing Address Department of Computer Science & Engineering Campus Box 1045 Washington University One Brookings Drive St. Louis, MO 63130-4899",
  "content_length": 2911,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:24"
}