{
  "name": "Patrick Shih",
  "homepage": "https://patshih.luddy.indiana.edu",
  "status": "success",
  "content": "Patrick C. Shih Patrick C. Shih Associate Professor Myles Brand Hall E259 Department of Informatics Indiana University Bloomington Bloomington, IN 47408 patshih@iu.edu +1 (812) 856-4022 News “Faculty member awarded $3.7 million to investigate inequities in environmental stressors and cognitive decline in urban and rural older adults.” SPH News. August 26, 2024. “Stressed out? New study will use app to measure midlife adults’ stress in real time.” News at IU. February 16, 2023. “New research project brings mobile ‘just in time’ stress intervention to breast cancer survivors.” Indiana CTSI. July 20, 2022. \"Shih receives CAREER award to support his work on the wellbeing of underserved populations.” Luddy News. June 7, 2022. \"Luddy shines at CHI.” Luddy News. May 9, 2022. \"Luddy researchers earn honors at CHI 2021.” Luddy News. May 8, 2021. “Luddy faculty earn prestigious recognition from Association for Computing Machinery.” Luddy News. January 15, 2021. “Shih honored as ACM Senior Member.” Luddy News. January 15, 2021. “Grief support systems have been wrecked by COVID-19.” The Verge. April 1, 2020. “IU Researcher Creates Health App to Aid Those on Autism Spectrum.” Bloom Magazine. March 29, 2020. Teaching [2018-19 Indiana University Trustees Teaching Award] [2018-19 IU Groups Scholars Program STEM Mentor of the Year] [Fall 2017 IU Project and Research Symposium “Most Potential for Social Good” Award] [Fall 2017 IU Project and Research Symposium “People's Choice” Award] [2016-17 IU Office of Mentoring Services & Leadership Development Award] INFO-I 413 & 513 Usable Artificial Intelligence (Spring 2021, Spring 2022, Spring 2023, Spring 2024) INFO-I 527 Mobile and Pervasive Design & CSCI-P 535 Pervasive Computing (Fall 2017, Fall 2018, Fall 2019, Fall 2020, Fall 2024) INFO-I 400 & 590 Topics in Informatics: Usable Artificial Intelligence (Spring 2020) INFO-I 400 & 590 Topics in Informatics: Seminar in Animal-Computer Interaction (Fall 2018, Fall 2019) UNIV 184 Bridge to Informatics (DePauw University) (Spring 2017, Spring 2018) ILS-Z 516 Human-Computer Interaction (Fall 2015, Fall 2016) ILS-Z 604 Social Computing and Computer-Supported Cooperative Work (Spring 2016) Services Steering Committee HCIC (2016, 2017, Since 2020) LETI ACC (Since 2020) ACI (Since 2018) Grant Panelist, Reviewer, and Invited Workshop NSF Human-PIPP Workshop (2021) NSF SCH Workshop (2020) NSF Panelist (2016, 2017, 2018, 2020, 2021) NSF Reviewer (2015, 2019) Conference and Symposium Chair ACI (2021) Vietnam War/ American War Stories: A Symposium on Conflict and Civic Engagement (2018) Program Chair ACI (2019, 2020) ISCRAM (2014) Workshops Chair CSCW (2022) Doctoral Consortium Committee ASIS&T (2017) Proceedings Chair ACI (2022) ISCRAM (2014) Publicity Chair IS-EUD (2015) Marketing and Communication Committee ISCRAM (2014) Best Paper Award Committee iConf (2019) Session Chair CHI (2016, 2017) iConf (2015, 2016) Winter/Summer Schools ACC (2020) Workshops and Panels CSCW: Conducting Research with Stigmatized Populations: Practices, Challenges and Lessons Learned (2018) CSCW: Sociotechnical Systems of Care Workshop (2018) 4S: Animals and Technology Around the World, Past and Present (2018) Journal Special Issue/Research Topic Editor Rising Stars: Human Factors and Digital Health (2021 - 2022) Journal Associate Editor FDGTH (Since 2020) IJCRAM (2020) Journal Editorial Review Board Animals (Since 2022) PACMHCI-CSCW (2018-1st, 2018-2nd, 2020) PACMHCI-GROUP (2020-1st, 2020-2nd, 2022-1st, 2022-2nd) IJISCRAM (2016 - 2020) Conference Program Committee [* Special Recognitions for Outstanding Reviews] CHI (2016, 2018, 2021*, 2025) CSCW (2015, 2018, 2020, 2023) DIS (2016, 2019, 2020*, 2021) PervasiveHealth (2018, 2019, 2020) GROUP (2018, 2020, 2022) ACI (2019, 2020, 2021, 2022, 2023) iConf (2015, 2016, 2019) CHI BridgingHCI (2018) CHI LBW (2017) MobileHCI (2018) WebSci (2016, 2017, 2018) Chinese CHI (2015, 2016, 2017, 2018, 2019, 2020) MobiSPC (2017, 2018) ASIS&T (2018) DTGS (2018) ISCRAM (2014) HCC (2014) Presence (2012, 2014) Journal Paper Reviewer TOCHI (2017, 2018, 2020, 2021) PACMHCI-CSCW (2021) PACMHCI-CSCW Student Reviewer Program Mentor (2019) FCOMP (2020) IJHCS (2015, 2017, 2019) PeerJ CS (2016, 2019) BIT (2019) HIJ (2019) CACM (2017, 2018, 2024) JIHA (2018) Information (2018) IJERPH (2015, 2017) PLOS ONE (2016) IwC (2016) ICS (2016) JVLC (2016) IJDRR (2016) ZOO BIOL (2016) TVCJ (2014, 2015) HCI (2015) Future Internet (2015) INFSOF (2013) Conference Paper Reviewer [* Special Recognitions for Outstanding Reviews] CHI (2011, 2012, 2013, 2014, 2015, 2017*, 2019, 2020*) CSCW (2012, 2013, 2014, 2016*, 2017, 2021) DIS (2017*, 2018) iConf (2017, 2018, 2020, 2021) MobileHCI (2013, 2020) CSCL (2015, 2017, 2019) IASDR (2021) WISH (2020) HICSS (2017, 2019) OZCHI (2017, 2018) ECIS (2018) INTERACT (2017) ISS (2017) UbiComp (2016) ICIS (2016) C&C (2015) ISWC (2015) AMCIS (2015) About Me I am an Associate Professor of Informatics in the Luddy School of Informatics, Computing, and Engineering at Indiana University Bloomington. I am an ACM Senior Member (top 25% of ACM), and I am a recipient of the NSF CAREER award. I direct the Societal Computing Lab (SoCo Lab). I'm the Director of Graduate Studies for Data Science, and I'm also the Co-Director of the Animal Informatics MS and PhD track and the BS Cognate, BS Minor, and PhD Minor in Animal-Computer Interaction. I'm a core faculty of the Health Informatics PhD track. My research focuses on how to better support health and wellbeing, specifically that of underserved and vulnerable populations, through the design, development, and evaluation of sociotechnical systems and community-based mechanisms. I also design technologies to amplify human and animal capabilities in animal-assisted interventions, improve animal welfare, and cultivate empathy for others. Prior to joining IUB, I was a Research Associate and Lecturer in the College of Information Sciences and Technology at Penn State. I received my Ph.D. in Information and Computer Science from UC Irvine, where I was a Chancellor's Fellow, M.S. in Information Networking from Carnegie Mellon University, and B.S. in Computer Science and Engineering from UCLA. I have also worked at Microsoft Research and IBM Research. My CV: Funding Support Publications Journal Papers Cristina Bosco, Fereshtehossadat Shojaei, Alec A. Theisz, Vivian Nguyen, Haoru Song, Ruixiang Han, John A. Osorio-Torres, Xinran Peng, Jenny Lin, Darshil Chheda, Nawal Z. Waseem, Chelsea Simpkins, Bianca Cureton, Anna K. Himes, Nenette M. Jessup, Yvonne Lu, Huge C. Hendrie, Priscilla A. Barnes, Carl V. Hill, and Patrick C. Shih. In Press. \"I don’t see anything specifically about Black/African Americans\": Testing an Alzheimer-specific generative AI tool tailored for African American/Black communities. ACM Transactions on Computing for Healthcare. https://doi.org/10.1145/3712295 Forum J. Modi, Yuxing Wu, Cristina Bosco, and Patrick C. Shih. In Press. Finding a place to belong: Barriers and solutions for supporting trans people of color on reddit. Proceedings of the ACM on Human-Computer Interaction 9, CSCW2, Article 86 (Apr. 2025), 1-21. https://doi.org/10.1145/3710984 Alec A. Theisz, Cristina Bosco, John A. Osorio-Torres, Fereshtehossadat Shojaei, Jenny Lin, Bianca Cureton, Anna K. Himes, Nenette M. Jessup, Priscilla A. Barnes, Yvonne Lu, Huge C. Hendrie, Carl V. Hill, and Patrick C. Shih. In Press. Exploring design recommendations for promoting brain health, ADRD health literacy, and participation in clinical ADRD trials in older African American/Black adults. Proceedings of the ACM on Human-Computer Interaction 9, CSCW2, Article 75 (Apr. 2025), 1-26. https://doi.org/10.1145/3710973 Daehyoung Lee, Georgia C. Frey, Patrick C. Shih. In Press. Gamified mobile health strategies for promoting physical activity in autistic adults. Exercise and Sport Sciences Reviews. https://doi.org/10.1249/JES.0000000000000353 Alec A. Theisz, Aehong Min, and Patrick C. Shih. 2025. Reevaluating propensity to support sustainability. Sustainability 17, 3, 824 (Jan.2025), 1-15. https://doi.org/10.3390/su17030824 Cristina Bosco, Ege Otenen, John A. Osorio-Torres, Vivian Nguyen, Darshil Chheda, Xinran Peng, Nenette M. Jessup, Anna K. Himes, Bianca Cureton, Yvonne Lu, Carl V. Hill, Huge C. Hendrie, Priscilla A. Barnes, and Patrick C. Shih. 2025. Designing a multimodal and culturally relevant ADRD generative AI tool for African American / Black informal caregivers: Cognitive walk-through usability study. JMIR Aging 8, e60566 (Jan. 2025), 1-14. https://doi.org/10.2196/60566 Cristina Bosco, Fereshtehossadat Shojaei, Alec A. Theisz, John A. Osorio-Torres, Bianca Cureton, Anna K. Himes, Nenette M. Jessup, Priscilla A. Barnes, Yvonne Lu, Huge C. Hendrie, Carl V. Hill, and Patrick C. Shih. 2024. Testing three modalities - voice assistant, chat bot and mobile app - to assist older African American/Black adults in seeking information on Alzheimer and related dementias: Wizard of Oz usability study. JMIR Formative Research 8, e60650 (Dec. 2024), 1-19. https://doi.org/10.2196/60650 Betsey Z. Nuseibeh, Shelley A. Johns, Patrick C. Shih, Gregory F. Lewis, Tayler M. Gowan, and Evan J. Jordan. 2024. Co-designing the MOSAIC mobile health application with breast cancer survivors: User-centered design approach. JMIR Formative Research 8, e59426 (Dec. 2024), 1-16. https://doi.org/10.2196/59426 Fereshtehossadat Shojaei, John A. Osorio-Torres, and Patrick C. Shih. 2024. Insights from art therapists on using AI-generated art in art therapy: Mixed methods study. JMIR Formative Research 8, e63038 (Dec. 2024), 1-12. https://doi.org/10.2196/63038 John A. Osorio-Torres, Fereshtehossadat Shojaei, and Patrick C. Shih. 2024. Classifying technologies during the assessment, treatment planning, documentation and evaluation phases of music therapy: A survey of board-certified practitioners. Proceedings of the ACM on Hu",
  "content_length": 57046,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:32"
}