{
  "name": "Patrick Henry Winston",
  "homepage": "http://people.csail.mit.edu/phw",
  "status": "success",
  "content": "The home page of Patrick Henry Winston Research The Genesis Group To better understand our intelligence in general, and our keystone story understanding competence in particular, my students and I formed The Genesis Group. You can find detailed descriptions of what we do at the Genesis page and learn more about why we do it in Moonshot, below. Genesis plays the Globe Yes, Genesis is playing in the Globe today, the Boston Globe that is, not the London Theater. 3 June 2018 Moon Shot Copernicus taught us about the solar system. Darwin did the same for evolution. Then, Watson and Crick determined the structure of DNA. Collectively they answered fundamental questions about who we are. Now, we can realistically dream of another scientific achievement of equal importance: constructing a top-to-bottom, computational account of our own intelligence. My students and I want to do it now because we are curious, because the problems are hard, because the problems are exciting, and because we need a better understanding of ourselves and each other and the forces that make us what we are. We need to do it now because the scientific answers will revolutionize the engineering of intelligent systems. Applications with humanlike intelligence will emerge and empower in education, health care, policy development, business, energy, the environment, cybersecurity, and all the other high-impact areas with unsolvable problems that we must solve. We can to do it now because we are asking better questions; because computer power is now effectively unlimited; because of encouraging progress in the contributing fields; because of maturing techniques for studying the neural substrate; and because there is immense student interest. Our better questions include: How are we different from other species? And what are the competences we share with other species such that the difference matters. Our answer is that we do, in fact, have a differentiating, keystone competence: we build complex, highly nested symbolic descriptions of situations and events. Together with the competences we share with other species, the keystone competence enables story telling, story understanding, and story composition, and all that enables much, perhaps most, perhaps all of education. We may be wasting our time, of course, but the potential reward is that 1,000 years from now, everyone could say that we first understood our own intelligence. Will they take over Links to WCVB TV Chronical show devoted to concerns about the future of AI, first aired 2 March 2016. Segment 1 Segment 2 Segment 3 Segment 4 The Genesis Group is part of MIT's Computer Science and Artificial Intelligence Laboratory. Members of the Genesis Group particpate in MIT's Center for Brains, Minds, and Machines, sponsored by the National Science Foundation. The center is dedicated to developing a deep understanding of intelligence and the ability to engineer it, ephasizing how it works, how it develops in childhood, how it is implemented in neurobiology, and how it is amplified through social interaction. The Center for Brains Minds and Machines emerged from I2, MIT's Intelligence Initiative, a campus wide effort initiated by Marc Kastner, Dean of MIT's School of Science, aimed at developing a broad scientific understanding of the brain and human intelligence. Copyright © 2018 Patrick Henry Winston This site was updated on 25 March 2019Designer: Chiai Takahashi Teaching In the fall, I teach 6.034, Introduction to Artificial Intelligence, a large class. Grades are calculated in accord with several student-oriented principles. For example, because we want to encourage each student to compete with himself/herself and not with each other, we no longer compute a class average. Because anyone can have a bad day, each segment of the material is tested both in a quiz and on the final, and we only count the higher grade. We who teach the subject are pleased to note that grades are correlated with attendance at lectures, quiz reviews, recitations, and tutorials. Anticipating a shift of skill building to the on-line world, we have enriched the subject with what we call Right-now Talks, aimed at exposing exciting, up-to-the-minute research occuring at MIT. In the spring, I teach 6.xxx (also known as 6.803 and 6.833), The Human Intelligence Enterprise, a class in which I focus on contributions that visionary thinkers have made toward developing a computational explanation of intelligence. During the Independent Activities period, I talk on the subject of How To Speak. The talk helps people do a better job in lectures, theses defenses, and job talks. Awards All of us involved in developing and teaching 6.034 and 6.xxx over the years are immensely pleased that our work on these subjects has been appreciated by students. Our collective efforts led to the 2011 Eta Kappa Nu Teaching Award for excellence in instruction, a MacVicar Faculty Fellowship in 2011, the Baker Award for undergraduate teaching in 2010, and the Graduate Student Council Teaching Award in 2006. Unknown, but heroic students went to a lot of trouble to make it happen. We were also pleased to note that, according to a Bloomberg article, 6.034 is among Five of the Best Computer Science Classes in the U.S. Of course, what they meant to say was that 6.034 has had graduate-student teaching assistants that are consistently outstanding. Books During my book-writing phase, I wrote numerous editions of various textbooks and collections, 17 in all. Free, online editions of On To Java, On to Smalltalk On to C and On to C++ are available via the website. Video Various people have recommended my lectures on Neural Nets and Deep Neural Nets. Maybe that is why 6.034 is among the 10 most visited subjects of the 2340 MIT subjects with materials offered free to all via MIT's OpenCourseWare. In the fall, I hope to record for OCW a new lecture on deep-net enabled AlphaGo. I'll also hope to record a second lecture on Support Vector Machines featuring the latest ideas of Vladimir Vapnik and Rauf Izmailov. Pensées Hello world, Hello MIT, Hello Patrick “Looking back to look foward” is the 15 minute talk I gave at the celebration of MIT's new Swartzman College of Computing. The theme of the day was Hello World, Hello MIT. During early development, some programmers have their programs display “Hello world” to show that a program is starting to work. 28 February 2019 Transformational news: MIT's newSchwarzman College of Computing During the past several years, there has been a growing feeling here at MIT that we need to address new opportunities emerging from computing research. After much consultation with the faculty, the administration decided to create the Schwarzman College of Computing. The new college is a very big deal. It has been more than half a century since we have created anything at that level. It is visionary, enabling, and exciting. It could have been called a School of Computing, joining MIT's Schools of Engineering, Science, Architecture, Humanities, and Business. In many ways the new college is like a School, but I am glad it will be called a College. At MIT, schools, by tradition, tend to be inward looking. With a new label, structural experiments will be much easier. The leadership of the College of Computing can think about how to serve all of MIT, not just the College of Computing itself. With a different kind of mission, the College will take everything at MIT to another level. Some parts of MIT will benefit from AI; others will benefit from data science, computational modeling, new kinds of hardware and software, and systems with embedded computing. As with anything new, there are many ways to get it wrong. No one knows what all the right answers are now and those right answers may be wrong answers in a year or two. There are challenges and risks. The leadership of the new College will have to make difficult decisions and manage through pernicious uncertainties. But this is MIT. We like world-changing missions. In his inaugural address, President Reif said that our purpose is to solve the unsolvable, shape the future, and serve the nation and the world. The College of Computing can be a great enabler for all of that. Everyone is talking about analogs to going to the moon. So it is a great time to be at MIT. I am lucky to be here at this big moment. Of course I am pleased that President Reif's announcement featured AI, which inspired me to start thinking of where my own work could go with close collaborations with students, staff, and faculty in all five of our existing Schools. I focus on what makes our human intelligence unique, which could lead to applied systems that think in the same ways we do. With success, and close collaboration, we can create systems for architects that participate in design; systems for engineers that give machines a kind of self awareness; systems for business strategists that are as useful to them as spreadsheets are to financial analysts; and systems for scientists that can suggest analogies like the elevator analogy Einstein thought about when developing relativity. Perhaps more importantly, for humanists, we can contribute to a better understanding of how we humans think noble and not so noble thoughts. In the short term, the benefits will come from research in machine learning, especially applications of deep learning. In the long term, I have a very romantic dream of discoveries on par with those of Copernicus, who showed where we are in the universe, with those of Darwin, who showed where we are in evolution, and with those of Watson and Crick, who explained our biology. MIT will be where we uncover the secrets of our own intelligence, how it evolved, how it emerges in childhood, and how it continues to develop throughout life. 20 October 2018 Most recent pensées The General Patton diet Favorite pensées The Arcosanti file: Great works The MIT 100 The Infinite Connection Advisor The End of Live Lectures? . Subscribe",
  "content_length": 14937,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:29"
}