{
  "name": "Patrizio Pelliccione",
  "homepage": "http://www.patriziopelliccione.com",
  "status": "success",
  "content": "Patrizio Pelliccione website Patrizio Pelliccione Professor, Consultant, Software Engineer . Current Position Director of the Computer Science area at GSSI (Gran Sasso Science Institute) Professor in Computer Science and Software Engineering at GSSI (Gran Sasso Science Institute) Adjunct Professor at University of Bergen, Department of Physics and Technology Associate member of Gran Sasso Tech, a non-profit research organization where academia and industry collaborate in developing advanced technologies and education. Member of government council of the excellence research center on automotive EX EMERGE Other affiliations Member of the professor board of PhD studies in ICT, GSSI (Gran Sasso Science Institute) Member of the professor board of the National PhD program in Cybersecurity, Scuola IMT Alti Studi - Lucca, Italy Member of the scientific committee of the University College of Merit \"Ferrante d'Aragona\", L'Aquila ACADEMIC Career (previous positions) Associate Professor at University of LâAquila Associate Professor at Chalmers | University of Gothenburg Visiting Professor at the Charles University Assistant professor at University of LâAquila Research Associate at University of Paris Diderot-Paris Research Associate at Swinburne University of Technology Research Associate at ISTI-CNR Research Associate at INRIA Senior Researcher at University of Luxembourg Research Scholar at Kansas State University RESEARCH - SOFTWARE ENGINEERING I have an academic and educational background in Software Engineering and Computer Science covering both solution-oriented and knowledge-oriented research. I have been working in different countries and contexts and I have a consolidated experience on National (Italian, Swedish, Luxembourgish) and EU projects. I am very active in the research community and I collaborate with various companies around the world. The three main research areas in Software Engineering in which we are working are: Autonomous, self-adaptive, and smart systems Autonomous and smart systems are more and more required to cooperate and collaborate each other and with human actors, and, in general, they need to operate in environments shared with humans. This calls for innovative software engineering techniques. Specific techniques in which we focus are: testing techniques, e.g., self-adaptive testing in the field, testing approaches for BSNs, and approaches to test autonomous vehicles anomaly detection approaches and evaluation framework for autonomous systems. We also studied, through empirical industrial studies, the motivations for applying self-adaptation in practice, the problems solved using self-adaptation and how these problems are solved, and the difficulties and risks that industry faces in adopting self-adaptation. In this digital society, humans feel unprotected and unsafe, constrained by technology; values like safety, fairness, ethics and privacy are at risk. There is the need of new methodology and tools for engineering digital systems for humanity and trustworthy and trustable systems. From some years, we investigate techniques and methodologies aiming at better balancing of forces: we will no longer need to accept the opaque behaviour of the software technologies, rather, we will provide effective means to mold these technologies into shapes that better reflect our human values (see the Exosoul project). Robotic Software engineering We are pioneers in establishing the discipline of robotic software engineering for service robots. We investigated safety aspects and the readiness of using robots in real life scenarios, software variability in service robotics, runtime verification and field-based testing for ROS-based robotic systems, architectures for the coordination of heterogeneous robots, Model-Driven Engineering (MDE) for service robotics, synthesis of controllers of a planners under uncertainty. We also offered solutions for democratizing robots in everyday-life scenarios. We offer means to make systems programmable and usable by domain experts not necessarily experts in computer science or robotics. We identified and formulated mission specification patterns and mission specification patterns for quantitative properties to enable the specification of mission in structured English and, then, an automatic translation in temporal logic. We also contributed a Domain Specific Language (DSL) for mission specification, called Promise. Architecting complex system We have consolidated experience in languages for providing architecture descriptions. We have consolidated competencies in architecture frameworks (ISO/IEC/IEEE 42010:2011) and reference architectures. We investigated the definition of an architecture framework for Volvo Cars and the definition of a viewpoint for cars as constituents of a System of Systems (SoS), as well as a compositional approach to creating architecture frameworks with an application to distributed AI systems. Concerning ML and AI systems, we studied architectural challenges, best practices, and design decisions in architecting ML-enabled systems. We investigated the role of architectures when companies are in the transition towards the adoption of agile methodologies, and we introduced the concept of boundary objects and the use of boundary objects in agile systems engineering. Recently, we introduced the concept of Architecture as Code (AaC), intended as an approach where software architecture is continuously defined, managed, and evolved through a machine-readable, version-controlled code-base. research projects I have experience in European, Swedish, Italian, and Luxembourgish research projects, from basic research till industrial research. Get in contact if you want to collaborate in future projects. Follow a selection of active research projects. Department of Excellence Pattern Analysis and Engineering: Understand the creation of coherent structures and their self-organisation in systems with various degrees of freedom and strong nonlinear interactions. Four complementary and interconnected directions: A1. Identify, derive, and analyse (at different scale or level of abstraction, from micro to macro, or from local to global) effective models and fundamental qualities that describe the most relevant characteristics of such systems; A2. Study the emergence of coherent patterns and structures within effective models; A3. Develop control techniques and identify appropriate parameters within systems in order to obtain pre-established coherent structures; A4. Engineer software-intensive systems that enable specific prescribed global structures or behaviours to be achieved. Matisse - website MATISSE (Model-based engineering of Digital Twins for early verification and validation of Industrial Systems) is a European HORIZON-KDT-JU research project bringing together over 30 partners from 7 countries to develop an advanced framework for efficient engineering and validation of industrial systems using Digital Twins (DTs). MATISSE focuses on the integration of DTs with model-based, data-driven, and cloud technologies, and it aims to simulate, test, and predict system behaviours, enhancing both productivity and quality. This innovative approach helps companies optimise their ndustrial processes, reduce errors, and boost productivity, ultimately simplifying complex operations like machinery production and factory management. With 18.2 million euros in funding and a diverse international consortium, MATISSE is driving forward the next generation of industrial efficiency and innovation. Halo HALO (etHical-aware AdjustabLe autOnomous systems), Italian PRIN project, Call 2022 (28 September 2023 - 27 September 2025). HALO aims at empowering users with a software exoskeleton, which enables users to express their moral preferences and to adjust the system's autonomy and the related interaction protocols, in an ethical-aware manner. The customization of the system's autonomy is guaranteed by a software mediator that, depending on the user's ethical preferences, first determines the new level of autonomy and then (re-)distributes autonomy and control among the involved entities (e.g., system's components, software agents, humans interacting with the system, etc.). RoboChor RoboChor (Robot Choreography), Italian PRIN PNRR project, Call 2022 (30 November 2023 - 29 November 2025) RoboChor focuses on scenarios concerning multiple distributed and heterogeneous service robots (Multi-Robot Systems - MRSs) that collaborate with each other and with humans in a shared space to accomplish a common (globally specified) mission, while guaranteeing the preservation of ethical constraints of both the mission and the involved humans. The contributions of RoboChor are: (i) Methodologies and languages to enable domain experts to specify missions for MRSs as robot choreographies; (ii) Suitable assignment of robots to tasks; and (iii) Coordination of robots to avoid (emergent) behaviors that are undesired while guaranteeing ethics. Dream DREAM (Democratization of Robot Engineering for Advanced Manufacturing) is a project in the context of the Rome Technopole project financed by PNRR - NextGenerationEU, SPOKE 1 and 6. GSSI is subcontractor of  Gran Sasso Tech. The Dream project aims at conceiving and developing a high-level Domain Specific Language (DSL) to enable experts of the domain but not in robotics to correctly an confidently program and coordinate multi-robots, as well as their interaction with humans. ASTRA / Vitality - website ASTRA (Advanced Space Technologies and Research Alliance), Spoke GSSI of Vitality, Ecosistema Innovazione, Digitalizzazione e Sostenibilità per l'economia diffusa nel Centro Italia (MUR - Ministero dell'Università e della Ricerca), Piano nazionale di ripresa e resilienza (PNRR). The aim of the spoke is to investigate Advanced technologies for Space industry. The computer science part investigates innovative architectures to support the use of AI on board of satell",
  "content_length": 19306,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:37"
}