{
  "name": "Patrick Bahr",
  "homepage": "https://pure.itu.dk/portal/en/persons/patrick-bahr(5e271e6a-7a91-47bd-9f12-3b73f4e0d7ac).html",
  "status": "success",
  "content": "Patrick Bahr - IT-University of Copenhagen Patrick Bahr public CV Patrick Bahr Associate Professor, Theoretical Computer ScienceProgramming Logic and SemanticsCo-Head of Programme, MSc in Software Design https://orcid.org/0000-0003-1600-8261 Emailpabaitudk 20092025 Research activity per year Personal profile Research areasType SystemsRewritingCompilersDomain-specific LanguagesFormal VerificationRecursion Schemes Personal website KeywordsProgramming languagesCompilersType theoryFormal verificationFunctional programming Fingerprint Dive into the research topics where Patrick Bahr is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 1 Similar Profiles Compiler Keyphrases 100% Reasoning Technique Computer Science 75% Type Systems Computer Science 66% Partial Order Keyphrases 58% Term Graphs Keyphrases 54% lambda-calculus Computer Science 50% Functional Reactive Programming Keyphrases 45% Modal Keyphrases 45% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2009 2011 2012 2014 2015 2017 2018 2024 2025 20 Book chapter 12 Article in proceedings 9 Journal article 2 Anthology 5 More 2 Conference article 1 Paper 1 Master's thesis 1 PhD thesis Research output per year Research output per year Functional Reactive GUI Programming with Modal Types.Disch, J.-C., Heegaard, A. & Bahr, P., 1 Oct 2025, Trends in Functional Programming : 26th International Symposium, TFP 2025, Oxford, UK, January 14–16, 2025, Revised Selected Papers. Springer, Vol. 15652. p. 93-114 22 p. (LNCS, Vol. 15652).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile GUI Programming 100% GUI Framework 28% Operational Behavior 20% Motivated Behavior 20% Programming Style 14% The Calculated Typer (Functional Pearl)Garby, Z., Bahr, P. & Hutton, G., 9 Oct 2025, Proceedings of the 18th ACM SIGPLAN International Haskell Symposium. Association for Computing Machinery, p. 17 - 29 13 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Type Construction 100% Expression Language 50% Construction Types 50% Asynchronous Reactive Programming with Modal Types in HaskellBahr, P., Houlborg, E. & Rørdam, G. T. S., 10 Jan 2024, Practical Aspects of Declarative Languages. Springer, Vol. 14512. p. 18-36 (Lecture Notes in Computer Science).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile And-States 100% Programming Language 100% Async 80% Graphical User Interface 50% Typing Rule 50% Beyond Trees: Calculating Graph-Based Compilers (Functional Pearl)Bahr, P. & Hutton, G., 15 Aug 2024, In: Proceedings of the ACM on Programming Languages. 8, ICFP249, p. 370 - 394 25 p., 249.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Compiler 100% Graph-based 100% Pearl 100% Order Abstract Syntax 100% Graph Representation 16% Calculating Compilers Effectively (Functional Pearl)Garby, Z., Hutton, G. & Bahr, P., 29 Aug 2024, Proceedings of the 17th ACM SIGPLAN International Haskell Symposium. Association for Computing Machinery, p. 109 - 119 11 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Functional Programming 100% Programming Technique 100% Pearl 100% Algebraic Approach 33% Calculation Methodology 33% View all 48 research outputs Projects Projects per year 2015 2015 2019 1 Finished Projects per year Guarded recursive types in the foundations of programmingMøgelberg, R. E. (PI), Mannaa, B. (CoI) & Bahr, P. (CoI)Independent Research Fund Denmark01/07/2015 → 31/01/2019Project: Research Denotational Semantics 100% Type Theory 83% Syntactics 62% Guarded Recursion 53% Programming Language Feature 37% Datasets Supplementary Material for \"Monadic Compiler Calculation\"Bahr, P. (Creator) & Hutton, G. (Creator), ZENODO, 27 May 2022DOI: 10.5281/zenodo.6794696, https://zenodo.org/record/6794696Dataset: Software Supplementary Material for \"Calculating Compilers for Concurrency\"Bahr, P. (Creator) & Hutton, G. (Creator), ZENODO, 31 May 2023DOI: 10.5281/zenodo.8124116, https://zenodo.org/record/8124116Dataset: Software Haskell and Agda code for the article \"Calculating Compilers Effectively\"Zac, G. (Creator), Hutton, G. (Creator) & Patrick, B. (Creator), ZENODO, 18 Jul 2024DOI: 10.5281/zenodo.12771956, https://zenodo.org/records/12771956Dataset: Software Haskell and Agda code for the article \"The Calculated Typer\"Garby, Z. (Creator), Bahr, P. (Creator) & Hutton, G. (Creator), ZENODO, 6 Aug 2025DOI: 10.5281/zenodo.16751639Dataset: Software",
  "content_length": 5188,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:21"
}