{
  "name": "Patrick G. Bridges",
  "homepage": "http://www.cs.unm.edu/directory/faculty-profiles/patrick-bridges.html",
  "status": "success",
  "content": "Patrick Bridges :: Department of Computer Science | The University of New Mexico The University of New Mexico UNM A-Z StudentInfo FastInfo myUNM Directory Support News Find People Contact Us Location Search About Us About Us Faculty Directory Affiliate Directory Staff Directory Committee Service Computer Facilities Colloquium News Life in New Mexico Accreditation Programs & Degrees Bachelor's B.S./M.S. Shared-Credit Degree Program Master's Ph.D. CS4ALL Minor in Computer Science Courses Prospective Undergraduate Students Prospective Graduate Students Undergraduate Accreditation (ABET) Research CS Research Faculty Research Interests Theoretical Foundations Advanced Distributed System Platforms Complexity of Social Computing Biological Systems and Processes Students Admissions Financial Aid Advisement & Help Advisement FAQ Organizations Departmental Scholarships Peer Tutoring Program DirectoryFaculty DirectoryStaff DirectoryAffiliated Faculty UNM>Home>Directory>Faculty>Patrick Bridges Patrick G. Bridges Contact patrickb@unm.eduPhone: 505-277-3112Fax: 505-277-6927Physical Address Room 2370Farris Engineering CenterBuilding # 119 on the UNM map Mailing Address01 1130 1 University of New Mexico Albuquerque, NM 87131-1070 Professor Department of Computer ScienceDirectorUNM Center for Advanced Research ComputingCurriculum VitaeEducationPhD, Computer Science, University of Arizona, 2002BS, Computer Science, Mississippi State University, 1994BiographyPatrick G. Bridges is a Professor of Computer Science and the Director of the Center for Advanced Research Computing at the University of New Mexico, where he conducts research on system software for large-scale computing systems. His research interests include operating system and network protocol design, virtualization systems, and fault tolerance for high-performance and scientific computing systems, with a recent focus on next-generation high-speed computing systems as PI of an NNSA PSAAP-III center focused on research in this area. Bridges frequently collaborates with staff from Sandia, Los Alamos, Livermore, and Oak Ridge National Laboratories, and is a member of the ACM and the IEEE Computer Society.Teaching InterestsOperating SystemsVirtualizationFault ToleranceResearch InterestsHigh-performance and large-scale computing systemsOperating systemsComputer networksCenter/Laboratory/Program AffiliationsUNM Scalable Systems Laboratory Contact Info: (505) 277-3112 (phone) (505) 277-6927 (fax) Technical help: cssupport@cs.unm.edu All other questions: csinfo@cs.unm.edu The CS office hours 8 AM to 5 PM closed from 12 to 1PM for lunch. Location: Physical Location: Farris Engineering Center1901 RedondoMSC01 1130Suite 2200Albuquerque, NM 87131 Mailing Address: University of New Mexico Department of Computer Science MSC01 1130 1 University of New Mexico Albuquerque, NM 87131-0001 SOE Links School of Engineering Programs & Degrees Help & Advisement Research Useful Links Map & Directions Parking Life in Albuquerque & New Mexico Give to UNM Computer Science © The University of New Mexico, Albuquerque, NM 87131, (505) 277-0111 New Mexico's Flagship University Accessibility Legal Contact UNM",
  "content_length": 3174,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:25"
}