{
  "name": "Patrícia Amâncio Vargas",
  "homepage": "https://researchportal.hw.ac.uk/en/persons/patricia-a-vargas",
  "status": "success",
  "content": "Patricia A. Vargas - Heriot-Watt Research Portal View Scopus Profile Patricia A. Vargas Dr Associate Professor, School of Mathematical & Computer SciencesAssociate Professor, School of Mathematical & Computer Sciences, Computer Science https://orcid.org/0000-0002-3272-2521 Emailp.a.vargashw.acuk EH14 4ASUnited Kingdom 20092025 Research activity per year Personal profile Research interestsMy work focus on interdisciplinary research applied to the state of the art autonomous intelligent robotics and human-robot interaction. I am particularly interested in Evolutionary Robotics, Swarm Robotics, Biologically-inspired algorithms, Computational Neuroscience, Machine Learning, Rehabilitation Robotics and Neurorobotics. BiographyPatricia A. Vargas, PhD, is the Founder Director of the Robotics Laboratory, Director of Ethics and Associate Professor/Reader in Computer Science and Robotics at the School of Mathematical and Computer Sciences at Heriot–Watt University in Edinburgh, UK. She is an executive member of the Edinburgh Centre for Robotics. She is also an IEEE Senior Member and Fellow of the Higher Education Academy, plus an exec member of the IEEE Ro-Man Standing Steering Committee. She was a post-doc at the Centre for Computational Neuroscience and Robotics, University of Sussex, UK for 3 years. Her research interests include Evolutionary and Bio-inspired Robotics, Swarm Robotics, Computational Neuroscience, Machine Learning, Human–Robot Interaction, Rehabilitation Robotics and Neurorobotics. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Patricia A. Vargas is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles robots INIS 100% Robot Computer Science 46% neural networks INIS 25% environment INIS 24% humans INIS 24% brain INIS 24% learning INIS 22% interactions INIS 21% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2009 2014 2017 2021 2025 28 Conference contribution 28 Article 3 Paper 2 Other chapter contribution 5 More 2 Chapter (peer-reviewed) 2 Review article 1 Book Research output per year Research output per year Experimental study of a novel contact-based pose detection approach for digital twin-driven high-precision micro assemblyNazeer, B., Pradeep, C. S., Vargas, P. A., Erden, M. S. & Kong, X., 5 May 2025, In: Manufacturing Review. 12, 13.Research output: Contribution to journal › Article › peer-review Open AccessFile detection 100% precision 100% Pose Estimation 100% Digital Twin 100% accuracy 83% 101 Downloads (Pure) A Closed-Loop Deep Brain Stimulation Biomedical Model of Parkinson’s DiseasePetitjean, T., Millet, H., de Araújo, M. F. P., Moioli, R. C., Vargas, P. A. & Ranieri, C. M., 8 Oct 2024, 2024 IEEE Conference on Computational Intelligence in Bioinformatics and Computational Biology (CIBCB). IEEE, 10702117Research output: Chapter in Book/Report/Conference proceeding › Conference contribution stimulation 100% brain 100% nervous system diseases 100% Parkinson's Disease 100% Deep Brain Stimulation 100% Contact-Based Pose Detection Method for Small Components to Optimise the Digital Twin-Driven Robotic Assembly ProcessNazeer, B., Qian, K., Vargas, P. A., Erden, M. S. & Kong, X., 30 Aug 2024.Research output: Contribution to conference › Paper › peer-review detection 100% Assembly Process 100% Robotic Assembly 100% Digital Twin 100% efficiency 33% NeoSLAM: Long-Term SLAM Using Computational Models of the BrainPizzino, C. A. P., Costa, R. R., Mitchell, D. & Vargas, P. A., 9 Feb 2024, In: Sensors. 24, 4, 1143.Research output: Contribution to journal › Article › peer-review Open AccessFile mapping 100% brain 100% Computational Modeling 100% Simultaneous localization and mapping 100% Neuroscience 100% 2 Citations (Scopus) 51 Downloads (Pure) Precision Robotic Assembly of Industrial Components with Robust Pose Estimation and Cooperative ManipulationQian, K., Zhang, Y., Li, Z., Vargas, P. A., Erden, M. S. & Kong, X., 5 Jun 2024, 25th IEEE International Conference on Industrial Technology (ICIT 2024). IEEE, 10540754Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile precision 100% cooperatives 100% Pose Estimation 100% Robotic Assembly 100% Robotic System 75% 1 Citation (Scopus) 76 Downloads (Pure) View all 66 research outputs Prizes Spirit of Heriot-Watt Awards 2017, Outward LookingLane, D. M. (Recipient), Lohan, K. S. (Recipient), Vargas, P. A. (Recipient), Hastie, H. (Recipient), Broz, F. (Recipient), Vijayakumar, S. (Recipient), Hermann, M. (Recipient), Foster, M. E. (Recipient), Hauert, S. (Recipient), Couceiro, M. S. (Recipient), Baillie, L. (Recipient), Erden, M. S. (Recipient), McEwen, I. J. (Recipient), McConnell, A. C. (Recipient), Goodfellow, R. (Recipient), Dragone, M. (Recipient), Mastrogiovanni, F. (Recipient), Dondrup, C. (Recipient), Lim, M. Y. (Recipient), Murphy, S. A. (Recipient), Vallejo, M. (Recipient), Duncan, S. (Recipient) & Hassan, M. K. A. (Recipient), 1 Jul 2017Prize: Prize (including medals and awards) awards 100% Alcoholic Beverages 100% organizing 33% Press/Media Living and working with robots: European Robotics Forum to focus on robotics markets and future of workLohan, K. S., Lane, D. M. & Vargas, P. A.21/03/171 Media contributionPress/Media: Research",
  "content_length": 5950,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:37"
}