{
  "name": "Patrick J. Flynn",
  "homepage": "http://www3.nd.edu/~flynn",
  "status": "success",
  "content": "Pat Flynn's site | Department of Computer Science and Engineering Patrick J. Flynn is Professor of Computer Science & Engineering and Fritz Duda Family Professor of Engineering at the University of Notre Dame. He received the B.S. in Electrical Engineering (1985), the M.S. in Computer Science (1986), and the Ph.D. in Computer Science (1990), all from Michigan State University. Dr. Flynn has held faculty positions at Notre Dame (1990-1991, 2001-present), Washington State University (1991-1998), and The Ohio State University (1998-2001). In 2007-2008, he held a visiting scientist appointment at the National Institute of Standards and Technology during a sabbatical leave. In 2022-2023 he held an adjunct professorship in Electrical and Computer Engineering at Purdue University during a sabbatical leave. From 2017-2022 he was Chair of the Department of Computer Science and Engineering. In 2016-2017 he served as Director of Notre Dame California, during which he designed and piloted the Silicon Valley Semester off-campus semester for Notre Dame undergraduates. His research interests include computer vision, biometrics, and image processing. He has advised or co-advised twenty-one Ph.D. dissertations, ten postdoctoral fellows, twenty-two M.S. theses, and two B.S. theses. Dr. Flynn is an IEEE Fellow, an IAPR Fellow, an AAIA Fellow, and an ACM Distinguished Scientist. He was the Editor-in-Chief of the IEEE Biometrics Compendium from 2016-2017, and is a past Associate Editor-in-Chief of IEEE Trans. on PAMI, and a past Associate Editor of IEEE TIFS, IEEE TIP, IEEE TPAMI, Pattern Recognition, and Pattern Recognition Letters. He has received outstanding teaching awards from Washington State University and the University of Notre Dame, and Meritorious Service, Golden Core, Certificate of Achievement, and Technical Achievement awards from the IEEE Computer Society. Google Scholar Profile Curriculum Vitae Pages Patrick J. Flynn CVRL Research group Lab website",
  "content_length": 1977,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:30"
}