{
  "name": "Patrick Cousot",
  "homepage": "http://cs.nyu.edu/~pcousot",
  "status": "success",
  "content": "Patrick Cousot's Home Page at NYU Patrick COUSOT Professor of Computer Science Julius Silver, Roslyn S. Silver, and Enid Silver Winslow Professor Courant Institute of Mathematical Sciences New York University Short biography Biography on Wikipedia, the Engineering and Technology History Wiki, IEEE Computer Society, (and many others, probably resulting from automated plagiarism: People Pill, HowOld, Web Developers Notes, DBpedia, Wiki Data, WikiVisually, WorldCat Identities) Courses CSCI-GA.3140-001, spring 2025, Abstract Interpretation, CIWW, room 202, M 4:55—6:55 PM, course repository accessible to registered students (email to the instructor to get a login and password) and course presentation (accessible with an NYU Id and password) CSCI-GA.3110-001, fall 2025, Honors Programming Languages, 60 Vth Ave, room C10, TR 3:30—4:45 PM, course repository accessible to registered students (email to the instructor to get a login and password) and course presentation (accessible with a NYU Id and password) Summer schools Lipari Summer School on Abstract Interpretation, September 1st — September 7th, 2024   (course material, send me email to get a login and password), J.T. Schwartz International School Research, liparischool@dmi.unici.it) Applications requests that will be left unanswered I do not answer emailed application requests to monitor a research project for high-schoolers (since the necessary mathematical background in set theory, order theory, and logic is not taught in high school); undergraduate applications (since I am not in charge of undergrad admissions), see www.nyu.edu/admissions/undergraduate-admissions.html and cs.nyu.edu/home/undergrad/admissions.html masters applications (since I am not in charge of grad admissions, either), apply instead to cs.nyu.edu/home/master/prospective_admission.html PhD applications not in abstract interpretation and its applications to semantics, verification and static analysis (since I only work on abstract interpretation and its applications), in all cases apply to cs.nyu.edu/home/phd/admission.html RA, TA, GA from students that have not followed all of my classes with success (since assistants should be competent and knowledgeable); sign recommendation letters for unknowns, including any king of petition and even when the letter is provided (since my recommendation letters reflect only my own opinions)! fee waivers, of any kind, see the NYU Application Fee Information Research interests  (Abstract interpretation) (Radhia Cousot Award) I work on formal methods (i.e. how to use mathematics to design programs) as opposed to software engineering (i.e. how to design programs avoiding any use of mathematics or rigorous reasoning). Abstract interpretation is a mathematical theory to design program semantics (formalizing what programs do when executed), program properties (formalizing what are the interesting properties of program executions), deductive program verification (how to formally prove that program executions do have formal properties, including model checking), and program analysis (how to mechanically infer formal properties of program executions, including typing). A mostly non-technical video by Reinhard Wilhelm introducing static analysis for program verification Astrée The Abstract interpretation page on Wikipedia A grotesque copy-pasted replicate on grokipedia (with missing figures, among other incongruousnesses) Book The book ``Principles of Abstract Interpretation'' is available at MIT Press since September 21st, 2021 (ISBN-13: 978-0262044905, ISBN-10: 0262044900). The book webpage is https://github.com/PrAbsInt. Slides in support of the book « Principles of Abstract Interpretation » book A review by Reinhard Wilhelm Projects 2022 WhatsApp Privacy Aware Program Analysis Publications (by research themes), talks,  and summer schools Recent publications (with papers, slides, and presentation recordings when available): Patrick Cousot. The Contributions of Alan Mycroft to Abstract Interpretation In Symposium and festschrift to celebrate the work of Prof. Alan Mycroft, 1st December, 2023, Department of Computer Science and Technology, Cambridge, UK (to appear). Patrick Cousot. Calculational Design of [In]Correctness Transformational Program Logics by Abstract Interpretation. In Proc. ACM Program. Lang. 8, POPL, Article 7 (January 2024), 33 pages. doi.org/10.1145/3632849 Patrick Cousot. A Personal Historical Perspective on Abstract Interpretation In The French School of Programming, Bertrand Meyer (Ed), pp. 205—239, © Springer, June 2024. Patrick Cousot. On the Design of Program Logics In Podelski's Festchrift, 15 p., © Springer, 2024 (to appear). Patrick Cousot and Jeffery Wang. Calculational Design of Hyperlogics by Abstract Interpretation In Proc. ACM Program. Lang. 9, POP, Article 16, pages 446--478, ACM, 2025. Talks Recent talks (with slides, and presentation recordings when available):: Patrick Cousot. Is Peter Correct or Incorrect? In O'Hearn Fest, POPL 2024, London, UK, Sun. Jan 14th, 2024. Patrick Cousot. Abstract Interpretation and (Hyper)-Logics In Google, New York, NY, Wednesday, September 17th, 2025, 15:30-17:00 AM EST. Conferences SAS 2023: 30th Static Analysis Symposium, Sun 22 - Tue 24 October 2023 Cascais, Portugal (Radhia Cousot Award) Program committees SAS 2023, Sun 22-Tue 24 October 2023 Cascais, Portugal Honors Contact at NYU Web page at ENS Web page at MIT Web page on GitHub Bibliography ACM Core DBLP Google Scholar Microsoft Academic NYU Scholar Semantic Scholar Scopus Elsevier (where I discovered I am a specialist in \"Surface mount technology\", \"Costs\", \"Explosions\", \"Chemical analysis\", etc and now \"Acoustic waves\", so artificially intelligent) The Collection of Computer Science Bibliographies Springerlink Research Gate BibSLEIGH Guide2Research CS ranking ScholarGPS Photography",
  "content_length": 5861,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:23"
}