{
  "name": "Patricio A. Vela",
  "homepage": "https://pvela.gatech.edu",
  "status": "success",
  "content": "ECE@GT:Patricio A. Vela Patricio A. Vela Associate Professor School of Electrical and Computer Engineering Georgia Institute of Technology Institute for Robotics and Intelligent Machines google scholar by year Contact: Phone: 404.894.8749 (no voice-mail) Fax:404.894.5935 Office: 85 Fifth St. NW, Room 441 Atlanta, GA 30308 Mailing Address: MC 0250 School of ECE, Georgia Tech 777 Atlantic Dr Atlanta, GA 30332-0250 About Patricio A. Vela is an Associate Professor in the School of Electrical and Computer Engineering at Georgia Tech. He is also an active member of the Institute for Robotics and Intelligent Machines. He directs the Intelligent Vision and Automation Lab (IVALab), where the research focus revolves around algorithms and algorithmic formulations for perception and control with application to robot autonomy. His graduate studies were in geometric nonlinear control with application to biologically-inspired locomotion, where averaging theory played a prominent role in reducing time-periodic control signals to time-invariant forms. In the simpler time-invariant form, traditional nonlinear control methods could be applied to achieve closed-loop control for this class of systems. His post-doctoral research involved a detour into computer vision, specifically controlled active vision and visual tracking. After becoming a faculty member at Georgia Tech, this line of research continued into the first few years. Emphasis was on exploiting the underlying geometric and functional representations of point-based and segmentation-based tracking for deriving real-time target tracking solutions. The computer vision research has slowly evolved to encompass robotic applications as opposed to automated decision support tools, but continues to embody controlled active vision principles. Currently, his group's research revolves around closed-loop aspects related to robot autonomy with an emphasis on perception-in-the-loop algorithms and the use of machine learning for control of robotic systems with uncertain properties or uncertain robot-world interactions. Numerical methods and real-time implementation are critical factors considered in the research efforts. The robot platforms include traditional platforms (ground and aerial) as well as biologically-inspired platforms (snake, salamander-like). Ultimately, the research aims to bridge the theory-practice gap through advances in numerical and algorithmic design. Classes Online course material can be found in the classes Wiki. Courses actively taught on a regular basis include: ECE4560 Introduction to Robotics and Automation ECE4580Computational Computer Vision ECE6554Adaptive Control Course taught or involved with in the past include: ECE4011/12 Senior Design ECE3084Introduction to Signals and Systems For serious and proactive students whose curricular interests align with the group's research directions, special topics projects may be considered. Professional Experience 2011 - Associate Professor 2005 - 2011 Assistant Professor 2003 - 2005 Post-Doctoral Researcher School of Electrical and Computer Engineering Georgia Institute of Technology Education 2003 PhD Control and Dynamical Systems 1998 BS Engineering and Applied Sciences California Institute of Technology",
  "content_length": 3258,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:20"
}