{
  "name": "Patrick George Healey",
  "homepage": "http://www.eecs.qmul.ac.uk/profiles/healeypat.html",
  "status": "success",
  "content": "Prof Pat Healey - School of Electronic Engineering and Computer Science Skip to main content School of Electronic Engineering and Computer Science School of Electronic Engineering and Computer SciencePeopleProfiles Professor Pat HealeyProfessor of Human InteractionEmail: p.healey@qmul.ac.ukTelephone: +44 20 7882 5211Room Number: Peter Landin, CS 410TeachingResearchTeachingCreative Group Project (Undergraduate) The module will be practice-based where students work in a team to produce a creative system for audio-visual content production or interactivity. Students will work in a team to identify the elements in a product development cycle; develop an audio, video, multimedia product with particular attention to its aesthetics, usability and marketability; analyse and present results in qualitative and quantitative measures; report and present findings in a clear and coherent manner. Design for Human Interaction (Postgraduate/Undergraduate) Developments in information technology have radically altered the nature of human communication. Spatial and temporal constraints on communication have been weakened or removed and new structures and forms of communication have developed. For some technologies, such as video conferencing, text messaging and online communities, the importance of understanding their effect on human communication is clear. However, even the success of 'individualistic' technologies, such as spreadsheets, can be shown to depend partly on their impact on patterns of interaction between people. Conversely, some technologies, such as videophones, that are specifically designed to enhance communication can sometimes make it worse. Currently, there is no accepted explanation of how technologies alter, and are altered by, the patterns and processes of human communication. Such an explanation is necessary for effective design of new technologies. This research led module explores these issues by introducing psychological theories of the nature of human communication and socio-historical perspectives on the development and impact of communication technologies. These models are applied to the analysis of new communications technologies and the effects of those technologies on communication patterns between individuals, groups and societies. A variety of different technologies are introduced ranging from systems for the support of tightly-coupled synchronous interactions through to large-scale shared workspaces for the support of extended collaborations. Detailed studies of the effects of different technologies on task performance, communication processes and user satisfaction are reviewed. Particular attention is paid to the notion of communicative success and to the development of metrics that can be used in assessing it. Frameworks for analysing the communicative properties of different media will be introduced as well as approaches to the analysis of communication in groups and organisations. Design for Human Interaction (Undergraduate) Technology can support new forms of human communication. Embodied robotics, virtual avatars and social software applications (e.g. Twitter, Facebook and Flikr) create new forms of human interaction and new social economies ('crowdsourcing', 'prosumers', 'GPL licensing'). This research-led course introduces psychological theories of human communication that help us to understand how technology can enrich and transform human interaction. It also introduces the tools and techniques necessary for a principled approach to the design and evaluation of such technology.ResearchResearch Interests:See Pat Healey’s research profile pages including details of research interests, publications, and live grants. Back to top",
  "content_length": 3717,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:24"
}