{
  "name": "Patrick Olivier",
  "homepage": "https://research.monash.edu/en/persons/patrick-olivier",
  "status": "success",
  "content": "Patrick Olivier - Monash University View Scopus Profile Patrick Olivier Professor Professor, Department of Human Centred ComputingAdjunct Professor, Malaysia Sch of Information Technology https://orcid.org/0000-0003-2841-7580 EmailPatrick.Oliviermonashedu, Olivier.PatrickLukemonashedu Accepting PhD StudentsPhD projectsContact me directly to discuss potential PhD topics. 1994 …2025 Research activity per year Personal profile Monash teaching commitmentChief Examiner & Lecturer 2025: FIT5125 (Sem 2, SSB)2024: FIT4005 (Sem 1 & 2)2023: FIT4008 (Sem 1 & 2); FIT2002 (Sem 2)2022: FIT4008 (Sem 1 & 2); FIT2002 (Sem 2 & Oct)2021: FIT5125 (Sem 1 & Oct); FIT4441 (Sem 1 & 2); FIT4008 (Sem 1 & 2)2020: FIT5125 (Sem 1 & Nov)2019: FIT5125 (Sem 1 & 2)BiographyI am a human-computer interaction researcher with particular expertise in human-centred design methods, digital health, and collaborative and social computing. I joined Monash to found Action Lab: Australia, a multidisciplinary research group comprising impact-focused researchers working at the intersection of communities, technology and social innovation. This has since grown into a transnational research network spanning Action Lab: Malaysia and Action Lab: Indonesia (where I also hold adjunct professorships). I am currently the most published researcher ever at the highest impact venue of human-computer interaction research (ACM Human Factors in Computing Systems), although these days I'm much more focused on designing services and systems that actually get used. I made some of the earliest contributions to experience-centred design (i.e., before anyone talked about lived experience) and led some of the very first work on experience-centred design of digital technologies with overlooked populations such as people with dementia and older adults more generally. Much of my current research focuses on the link between human-centred design and implementation science in digital health, and the design of relational models of digital health and their implementation in Australian and international contexts. One key element of my work is a commitment to the creation of open-source software and hardware. This includes digital dietary assessment (e.g. Intake24 used in the UK and Australian national dietary surveys), physical activity and sleep assessment (e.g. the AX3 accelerometer, used by UK Biobank), and the design and development of scalable infrastructures for self-directed healthcare (e.g. the Induk platform, used in Australia national digital parenting intervention for youth mental health “Partners In Parenting”). Some background (before Monash): I was awarded my PhD in Language Engineering (applied natural language processing) way back in 1998 and worked as a Senior Lecturer, Reader and Professor of Human-Computer Interaction at Newcastle University, UK. I also founded Lexicle Ltd., creator of the first commercially deployed 3D synthetic character for automated customer service, and Axivity Ltd., currently the provider of the most widely used physical activity monitor in clinical studies globally.  Around 2013, I coined the term (and the field) of digital civics, an activity of theorising, designing, developing, and evaluating personal and community-based digital technologies to explore and create forms of civic engagement that support local communities, local service provision, and local democracy.  My digital civics agenda formed the basis of the EPSRC’s (Engineering and Physical Sciences Research Council, UK) Digital Economy Program priority area on Digitally Connected Citizens, for which I as Principal Investigator of the EPSRC Centre for Doctoral Training (CDT) in Digital Civics and the EPSRC Digital Economy Research Centre (DERC). One of the most distinctive characteristics of the digital civics research enterprise is the requirement it has placed on research teams to engage in long-term partnerships with external organisations, citizens, and their communities. This way of working laid the foundations for what Action Lab is today.Research interestsCo-design Methods, Digital-in-Health, Technology-Enhanced Learning, Collaborative Computing, Social Computing, Media Computing.Supervision interestsDigital-in-Health, Interaction Design Methods, Technology-Enhanced Learning, Collaborative Computing, Social Computing, Media Computing. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationLanguage Engineering, PhD, University of ManchesterAward Date: 1 Sept 1998MSc, Artificial Intelligence, University of WalesAward Date: 1 Sept 1991Computing, Postgraduate Diploma, University of BradfordAward Date: 1 Sept 1990Natural Sciences (Physics), BA, University of CambridgeAward Date: 1 Sept 1989 External positionsAdjunct Professor, Monash University Indonesia1 Apr 2024 → …Adjunct Professor, Monash University Malaysia1 May 2023 → 30 Apr 2028 Research area keywordsHuman-Computer InteractionDigital CivicsInteraction DesignSocial ComputingSocial MediaEducational TechnologyDigital in HealthICT4D Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2007 2021 2022 2023 2024 2025 2029 28 Active 42 Finished Projects per year Enhancing Deaf Healthcare Access and Outcomes through Inclusive Health ResearchPalanisamy, U. (Primary Chief Investigator (PCI)), Wong, K. S. (Chief Investigator (CI)), Lay Ki, S. (Chief Investigator (CI)), Olivier, P. (Chief Investigator (CI)), Chong , A. A. V. Y. (Chief Investigator (CI)), Appalasamy, J. R. (Chief Investigator (CI)), Selvaraj, A. (Chief Investigator (CI)), Ramadas, A. (Chief Investigator (CI)), Thanzami, V. (Chief Investigator (CI)), Alshehri, T. (Chief Investigator (CI)) & Watterson, J. (Chief Investigator (CI))1/08/25 → 31/07/29Project: Research CSIRO Next Generation AI in Mental Health: 12-NGAI-R1: Designing and developing an LLM-enabled tool to generate insights into workforce development needs of alcohol and other drug counsellors and managersMcNaney, R. (Primary Chief Investigator (PCI)), Olivier, P. (Chief Investigator (CI)), Varghese, D. (Chief Investigator (CI)), Connolly, K. (Chief Investigator (CI)) & Balasubramanian, L. (Chief Investigator (CI))1/07/25 → 31/12/28Project: Research Intake24-Japan: Development and deployment of an open-source online dietary assessment platform for JapanIvaturi, A. (Primary Chief Investigator (PCI)), Olivier, P. (Chief Investigator (CI)), Foster, E. (Chief Investigator (CI)) & McCaffrey, T. (Chief Investigator (CI))30/06/25 → 30/03/26Project: Research Intake24 Open Nutrition Network: Developing in-country capacity to collect low-cost, high-quality, granulated data on individual dietary intake across Africa and AsiaLietz, G. (Primary Chief Investigator (PCI)), Bradley, J. (Chief Investigator (CI)), Tessema, M. (Chief Investigator (CI)), Pongcharoen, T. (Chief Investigator (CI)), Abdulgalimov, D. (Chief Investigator (CI)), Foster, E. (Chief Investigator (CI)), Olivier, P. (Chief Investigator (CI)), Wangge, G. (Chief Investigator (CI)), Misra, S. (Chief Investigator (CI)), Zyl, T. (Chief Investigator (CI)), Nyirenda, M. (Chief Investigator (CI)), Adu-Afarwuah, S. (Chief Investigator (CI)), Thuy, N. (Chief Investigator (CI)), Ivaturi, A. (Chief Investigator (CI)) & Watterson, J. (Chief Investigator (CI))Monash University – Internal Faculty Contribution1/04/25 → 31/03/27Project: Research A Health Services Directory for Healthcare Navigation and Social PrescribingOlivier, P. (Primary Chief Investigator (PCI)), Altun, A. (Chief Investigator (CI)), Boyle, J. (Chief Investigator (CI)), Lim, S. (Chief Investigator (CI)) & Varghese, D. (Chief Investigator (CI))1/04/25 → 30/06/26Project: Research View all 70 projects Research output Research output per year 1994 2009 2011 2012 2013 2014 2015 2016 2017 2019 2020 2021 2023 2024 2025 232 Conference Paper 82 Article 5 Chapter (Book) 3 Comment / Debate 14 More 2 Foreword / Postscript 2 Abstract 2 Paper 2 Letter 2 Review Article 1 Other Report 1 Meeting Abstract 1 Editorial 1 Other contribution Research output per year Research output per year A coach-assisted, online parenting programme to support parents of adolescents who refuse school: evidence of acceptability and feasibilitySmout, A. (Leading Author), Melvin, G. (Leading Author), Cardamone-Breen, M., Jorm, A., Xie, J., Bartindale, T., Olivier, P., Seguin, J., Wu, L. & Yap, M. B. H. (Leading Author), Jul 2025, In: BJPsych Open. 11, 4, 12 p., e115.Research output: Contribution to journal › Article › Research › peer-review Open Access An evidence-based digital prescription opioid safety toolkit for national dissemination: co-design and user testingWaddell, A., Watterson, J. L., Basur, D., Prawira, C. O., Picco, L., Lam, T., Olivier, P., Seguin, J. P., Kay, L. & Nielsen, S., 11 Jul 2025, In: Frontiers in Digital Health. 7, 16 p., 1600836.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Developing digital mental health tools with culturally diverse parents and young people: qualitative user-centered design studyButorac, I., McNaney, R., Seguin, J. P., Olivier, P., Northam, J. C., Tully, L. A., Carl, T. & Carter, A., 2025, In: JMIR Pediatrics and Parenting. 8, 22 p., e65163.Research output: Contribution to journal › Article › Research › peer-review Open Access 1 Citation (Scopus) Leaving No One Behind: An Agenda for Voice-based Engagement of Remote CommunitiesIslam, M. A., Olivier, P. & Varghese, D., 2025, Proceedings of ",
  "content_length": 12812,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:31"
}