{
  "name": "Patricia Ordóñez 0002",
  "homepage": "https://informationsystems.umbc.edu/home/faculty-and-staff/faculty/patti-ordonez-ph-d",
  "status": "success",
  "content": "Patti Ordóñez, Ph.D. – Department of Information Systems – UMBC Skip to main content Department of Information Systems Menu Apply Search Search Context This Site All of UMBC Location ITE Building Suite 404 Contact Contact Us Department of Information Systems on myUMBCDepartment of Information Systems on FacebookDepartment of Information Systems on InstagramDepartment of Information Systems on YouTubeDepartment of Information Systems on LinkedIn Patti Ordóñez, Ph.D. Associate Professor patti.ordonez@umbc.edu Spring 2023 Classes IS 733 Data Mining Dr. Patricia Ordóñez joins the Department of Information Systems of the University of Maryland Baltimore County as an Associate Professor. Her research interests are in applying machine learning, data mining, and visualization to multivariate time series analysis, specifically to large repositories of clinical and biological data (now known as Clinical Informatics and Biomedical Data Science), creating a voice programming language (assistive technology), and advocating and working towards high-quality computer and data science education for all. She was the first Latina to graduate with a Ph.D. from the College of Engineering and Information Technology at the University of Maryland Baltimore County and the first female Associate Professor to earn tenure in the Computer Science Department at the University of Puerto Rico Río Piedras (UPRRP). She is a former National Science Foundation Graduate Research Fellow. She is serving as General Chair at the 2022 Tapia Celebration of Diversity in Computing Conference and is a former co-Chair of the Diversity, Equity, and Inclusion Council of the Association of Computing Machinery (ACM). She is the recipient of a Great Minds in STEM 2021 HENAAC Award in Education and the 2021 AccessComputing Building Capacity Award. She is passionate about creating a more inclusive culture in computing and STEM and about bridging the digital and data divide in global healthcare and education. Location ITE Building Suite 404 Contact Contact Us Department of Information Systems on myUMBCDepartment of Information Systems on FacebookDepartment of Information Systems on InstagramDepartment of Information Systems on YouTubeDepartment of Information Systems on LinkedIn © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 2606,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:19"
}