{
  "name": "Paul C. Attie",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=PATTIE",
  "status": "success",
  "content": "Paul Attie - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Paul Attie Professor Paul Attie Professor Academic Appointment(s)AdministrationDepartment of Computer ScienceSchool of Computer and Cyber SciencesDepartment of Computer ScienceAdministrationDepartment of The Graduate School BioPaul Attie is a Professor of Computer and Cybersciences Sciences at Augusta University.He received his Ph.D. in Computer Science from the University of Texas at Austin in 1995. PATTIE@augusta.edu (706) 721-0949 RV 2802 General Credentials Instruction Scholarship Service Education Ph.D., Computer Science University of Texas - Austin, 1995 Courses Taught Most Recent Academic Year CSCI 8940 Dissertation Research CSCI 8510 Independent Study: Independent Studies CSCI 1302 Principles of Comp Program II CSCI 4100 Algorithms CSCI 8320 Verification of Software Teaching Interests Software engineering, formal methods,algorithms, distributed computing,programming, theory of computation Scholarship Selected Recent Publications Model and Program Repair via Group Actions and Structure Unwinding, 2025 Journal Article, Academic Journal Model and Program Repair via Group Actions, 2023 Book, Chapter in Scholarly Book-New Operational Annotations, 2022 Book, Chapter in Scholarly Book-New Model and Program Repair via SAT Solving, 2018 Journal Article, Academic Journal Global and Local Deadlock Freedom in BIP, 2017 Journal Article, Academic Journal Research Interests software engineering, formal methods, anddistributed computing. Department Service Tenure and promotion committee 2021 - Present Role: Committee Member Ad hoc committee addressing comp org, low-level programming, and OS 2021 - Present Role: Committee Member Graduate curriculum committee 2020 - Present Role: Committee Member Ph.D. committee 2020 - Present Role: Committee Member Tenure and promotion committee 2020 - 2021 Role: Committee Chair University Service Augusta University Faculty Senate 2020 - Present Role: University Senate Service Information Technology Resources 2020 - Present Role: Committee Chair Pamplin Dean Search Comittee 2020 - Present Role: Committee Member Professional Service Sorbonne University 2022 - Present Role: Committee Member ACM Symposium on Principles of Distributed Computing 2022 - Present Role: Reviewer, Conference Paper Reviewer of PhD thesis of Mouhammad Sakr at the University of Saarland 2021 - 2021 Role: Reviewer",
  "content_length": 2469,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:41"
}