{
  "name": "Paul Hand",
  "homepage": "http://www.ccs.neu.edu/home/hand",
  "status": "success",
  "content": "Paul E. Hand - Northeastern University Paul E. Hand Home C.V. Publications Teaching Associate Professor Mathematics and Computer science College of Science and Khoury College of Computer Sciences Northeastern University 567 Lake Hall Northeastern University 360 Huntington Avenue Boston, MA 02115 p.hand@[atsign]northeastern.edu My Google scholar page Research Interests Applied Math Compressed Sensing Deep Learning Machine Vision Phase Retrieval Signal Recovery I am interested in signal recovery problems. My current research focus is to develop new and faster ways of recovering signals in a variety of noisy contexts. I'm particularly interested in deep-learning based approaches that have provable recovery guarantees. My Ph.D. research was in the derivation and simulation of macroscale partial differential equations that govern the electrical behavior of cardiac muscle cells. I am also interested in math instruction with a focus on how students learn the mathematical problem solving process. My recent hobby has been to write the website Leading Lesson that makes the problem solving process explicit for over a hundred multivariable calculus problems. Select Publications Machine Learning Invertible generative models for inverse problems: mitigating representation error and dataset bias (with M. Asim and A. Ahmed). arXiv preprint 1905.11672. Deep Decoder: Concise Image Representations from Untrained Non-convolutional Networks (with R. Heckel). International Conference on Learning Representations, 2019. arXiv preprint 1810.03982. Phase Retrieval Under a Generative Prior (with Oscar Leong and Vladislav Voroninski). Advances in Neural and Information Processing Systems, 2018. Oral Presentation. arXiv preprint 1807.04261. Blind Deconvolutional Phase Retrieval via Convex Programming (with A. Aghasi, A. Ahmed). Advances in Neural and Information Processing Systems, 2018. Spotlight Presentation. arXiv preprint 1806.08091. A convex program for bilinear inversion of sparse vectors (with A. Aghasi, A. Ahmed, P. Hand, B. Joshi). Advances in Neural and Information Processing Systems, 2018. 1809.08359. Global guarantees for enforcing deep priors by empirical risk (with Vladislav Voroninski). Conference on Learning Theory, 2018. arXiv preprint 1705.07576 Blind Deconvolution and Bilinear Recovery Blind deconvolution by a steepest descent algorithm on a quotient manifold (with Wen Huang). arXiv preprint 1710.03309, 2017. BranchHull: convex bilinear recovery from the entrywise product of vectors with known signs (with Alireza Aghasi and Ali Ahmed). arXiv preprint 1702.04342, 2017. Phase Retrieval Corruption Robust Phase Retrieval via Linear Programming (with Vladislav Voroninski). arXiv preprint 1612.03547, 2016. Compressed Sensing from Phaseless Gaussian Measurements via Linear Programming in the Natural Parameter Space (with Vladislav Voroninski). arXiv preprint 1611.05985, 2016. An Elementary Proof of Convex Phase Retrieval in the Natural Parameter Space via the Linear Program PhaseMax (with Vladislav Voroninski). arXiv preprint 1611.03935, 2016. PhaseLift is robust to a constant fraction of arbitrary errors, Applied Computational and Harmonic Analysis, 2015. (pdf) Stable optimizationless recovery from phaseless linear measurements (with Laurent Demanet). J. Fourier Anal. Appl., 20(1):199-221, 2014. (pdf) (code) Machine Vision ShapeFit and ShapeKick for Robust, Scalable Structure from Motion (with Thomas Goldstein, Choongbum Lee, Vladislav Voroninski, and Stefano Soatto). Proceedings of the European Conference of Computer Vision (ECCV), 2016. Accepted as a spotlight presentation. (pdf) ShapeFit: Exact location recovery from corrupted pairwise directions (with Choongbum Lee and Vladislav Voroninski). To appear in Communications on Pure and Applied Mathematics. (pdf) (code) Exact simultaneous recovery of locations and structure from known orientations and corrupted point correspondences (with Choongbum Lee and Vladislav Voroninski). To appear in Discrete and Computational Geometry. (pdf) Cardiac Electrophysiology Deriving Macroscopic Myocardial Conductivities by Homogenization of Microscopic Models (with Boyce Griffith and Charles Peskin). Bulletin of Mathematical Biology. 71: 1707-1726, 2009. (pdf) Current Grant Support My work is currently supported by an NSF CAREER Grant, DMS-1848087. Public Outreach In Summer 2017, I was the director of curriculum and instruction for communication intensive STEM summer camps at Rice University for over 300 8th-12th graders, teachers, and school administrators. Here is a video from the week of camp that was focused on high school students in the top of their class. These summer camps were written up in an article by National Science Teachers Association Reports. Here is a talk I gave to high school students about the intersection of signal recovery theory, information theory, and compression: Here is a website I developed that contains over 100 worked examples in multivariable calculus: Northeastern University Department of Mathematics and Khoury College of Computer Sciences",
  "content_length": 5084,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:50"
}