{
  "name": "Paul Gölz",
  "homepage": "https://paulgoelz.de",
  "status": "success",
  "content": "Paul Gölz - Personal academic website Paul Gölz About me: I’m an assistant professor in the School of Operations Research and Information Engineering at Cornell and a member of the Computer Science field. I think about new ways of doing democracy (e.g., citizens’ assemblies), about how to fairly allocate resources (e.g., capacity to host refugees), and developing AI for heterogeneous users (e.g., generative social choice). Before joining Cornell, I did my undergrad at Saarland University in Germany, got my PhD in computer science at Carnegie Mellon University, and did postdocs at Harvard, the Simons Laufer Mathematical Sciences Institute (formerly: MSRI), and UC Berkeley. You can find my CV here. Contact: E-Mail: mail-removethispart@paulgoelz.de Address/Office: Paul Goelz Rhodes 221 136 Hoy Rd Ithaca, NY 14850, USA I enjoy getting to know new people and chatting about research. Whether you're a researcher, a student interested in research, a practitioner, or just curious, please don’t hesitate to reach out! Papers: C20 Fair division among couples and small groups. Paul Gölz and Hannane Yaghoubizade. AAAI 2026 Oral presentation. Forthcoming. [Preprint] C19 City sampling for citizens' assemblies. Paul Gölz, Jan Maly, Ulrike Schmidt-Kraepelin, Markus Utke, and Philipp Verpoort. AAAI 2026 Oral presentation. Forthcoming. [Preprint] C18 Fair allocation of indivisible goods with variable groups. Paul Gölz, Ayumi Igarashi, Pasin Manurangsi, and Warut Suksompong. AAAI 2026 Oral presentation. Forthcoming. [Preprint] C17 Putting fair division on the map. Paula Böhm, Robert Bredereck, Paul Gölz, Andrzej Kaczmarczyk, and Stanisław Szufa. AAAI 2026. Forthcoming. [Preprint] C16 Distortion of AI alignment: Does preference optimization optimize for preferences? Paul Gölz, Nika Haghtalab, and Kunhe Yang. NeurIPS 2025. Forthcoming. [Preprint] C15 Generative social choice. Sara Fish, Paul Gölz, David Parkes, Ariel Procaccia, Gili Rusak, Itai Shapira, and Manuel Wüthrich. EC 2024. [Preprint] C14 Monotone randomized apportionment. José Correa, Paul Gölz, Ulrike Schmidt-Kraepelin, Jamie Tucker-Foltz, and Victor Verdugo. EC 2024. [Preprint] J5 In this apportionment lottery, the House always wins. Paul Gölz, Dominik Peters, and Ariel Procaccia. Operations Research (2025). Supersedes C12. [Full paper] [Recorded talk] [Slides] J4 Dynamic placement in refugee resettlement. Narges Ahani, Paul Gölz, Ariel Procaccia, Alexander Teytelboym, and Andrew C. Trapp. Operations Research (2024) Communications of the ACM research highlight. Supersedes C8. [Preprint] [Recorded talk] C13 Now we’re talking: Better deliberation groups through submodular optimization. Jake Barrett, Kobi Gal, Paul Gölz, Rose Hong, and Ariel Procaccia. AAAI 2023. [Preprint] O1 Mini-public selection: Ask what randomness can do for you. Bailey Flanigan, Paul Gölz, and Ariel Procaccia. Harvard Kennedy School Ash Center Policy Briefs (2023). [Full Brief] T2 Social choice for social good: Proposals for democratic innovation from computer science. Paul Gölz. Ph.D. thesis, 2022. [Official version] J3 Approval-based apportionment. Markus Brill, Paul Gölz, Dominik Peters, Ulrike Schmidt-Kraepelin, and Kai Wilker. Mathematical Programming (2022). Supersedes C6. [Full paper] C12 In this apportionment lottery, the House always wins. Paul Gölz, Dominik Peters, and Ariel Procaccia. EC 2022. Superseded by J5. [Full paper] [Recorded talk] [Slides] C11 Fair allocations for smoothed utilities. Yushi Bai, Uriel Feige, Paul Gölz, and Ariel Procaccia. EC 2022. [Full paper] [Recorded talk] [Slides] C10 Envy-free and Pareto-optimal allocations for agents with asymmetric random valuations. Yushi Bai and Paul Gölz. IJCAI 2022. [Full paper] [Code] J2 Fair algorithms for selecting citizens’ assemblies. Bailey Flanigan, Paul Gölz, Anupam Gupta, Brett Hennig, and Ariel Procaccia. Nature (2021). [Paper] [Appendices] [Code] C9 Incentive-compatible kidney exchange in a slightly semi-random model. Avrim Blum and Paul Gölz. EC 2021. [Full paper] [Recorded talk] C8 Dynamic placement in refugee resettlement. Narges Ahani, Paul Gölz, Ariel Procaccia, Alexander Teytelboym, and Andrew C. Trapp. EC 2021. Superseded by J4. J1 The fluid mechanics of liquid democracy. Paul Gölz, Anson Kahng, Simon Mackenzie, and Ariel Procaccia. ACM Transactions on Economics and Computation (2021). Supersedes C2. [Full paper] [Recorded talk] [Code] C7 Neutralizing self-selection bias in sampling for sortition. Bailey Flanigan, Paul Gölz, Anupam Gupta, and Ariel Procaccia. NeurIPS 2020. [Full paper] [Code] C6 Approval-based apportionment. Markus Brill, Paul Gölz, Dominik Peters, Ulrike Schmidt-Kraepelin, and Kai Wilker. AAAI 2020. Superseded by J3. C5 Paradoxes in fair machine learning. Paul Gölz, Anson Kahng, and Ariel Procaccia. NeurIPS 2019 Spotlight presentation (2.5% of submissions). [Full paper] [Code] C4 No stratification without representation. Gerdus Benadè, Paul Gölz, and Ariel Procaccia. EC 2019. [Full paper] [Recorded talk] [Code] C3 Migration as submodular optimization. Paul Gölz and Ariel Procaccia. AAAI 2019. [Full paper] [Poster] [Code] C2 The fluid mechanics of liquid democracy. Paul Gölz, Anson Kahng, Simon Mackenzie, and Ariel Procaccia. WINE 2018. Superseded by J1. C1 Synthesis in distributed environments. Bernd Finkbeiner and Paul Gölz. FSTTCS 2017. [Full paper] T1 Synthesis for Petri games with one system player. Paul Gölz. Undergraduate thesis, 2017. News: November: AAAI just accepted our four submissions: one on sortition and three (1, 2, 3) on fair division. September: Our paper on the distortion of AI alignment was accepted at NeurIPS! We show that standard methods like RLHF and DPO can fail at satisfying even the average user, while Nash Learning from Human Feedback achieves robust guarantees. April: I'm co-organizing the 2nd Workshop on New Directions in Social Choice at EC'25 (July 10 at Stanford). Submit your work and join us! January: Bailey Flanigan and I received a $40,000 Structural Democracy Fellowship, funded by the Crankstart Foundation, to update Panelot, our not-for-profit website allowing practitioners to draw citizens' assemblies. January '24: Our research project on generative social choice has been part of OpenAI's grant program for Democratic Inputs to AI (\"10 teams out of nearly 1000 applicants\" awarded). Check out the paper here! October '23: My thesis received an honorable mention at the George B. Dantzig dissertation award. July '23: My thesis was recognized with an honorable mention at the ACM SIGecom Doctoral Dissertation Award. April '23: I'm incredibly excited to join Cornell ORIE as an assistant professor in July 2024! Show older August '22: I got my PhD! You can find my thesis here. August '21: After a lot of work, Nature published our new paper on citizens' assemblies/sortition! April '21: I received a JPMorgan Chase AI Research fellowship! August '20: This Fall, Anson and I are founding a new MD4SG working group on novel forms of Civic Participation. April '20: My team finished 41st out of 10,724 at the Google Hash Code programming competition. Thanks to Alex, Andrii, and Da Qi! People: Gabriel Morete de Azevedo 2nd year ORIE PhD. Hannane Yaghoubizade 3rd year ORIE PhD (joint with David Williamson). Other students I've been recently working with include Robyn Burger (CS MSc), Shayan Ranjbarzadeh (ORIE 3rd year), Sonja Kraiczy (Oxford), Ben Schiffer (Harvard), Markus Utke (TU Eindhoven), Kunhe Yang (UC Berkeley), and Shirley Zhang (Harvard). Online Tools: Panelot.org (serious). Not-for-profit website for selecting citizens' assemblies using our state-of-the-art selection algorithms. Cumulative weather tool (whimsical). Check if your place is unusually sunny/cloudy/rainy/dry this year. Teaching: ORIE 6150: Collective Decision Making. PhD elective introducing students to fair division and computational social choice through paper reading and discussion. Cornell, Fall 2025. ORIE 4160/5160: Optimized Democracy. Undergraduate/Master's elective covering mathematical and computational approaches to democracy. Cornell, Spring 2025. ORIE 6300: Mathematical Programming. PhD course covering linear, convex, and nonconvex optimization. Cornell, Fall 2024.",
  "content_length": 8229,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:49"
}