{
  "name": "Paulo Shakarian",
  "homepage": "https://isearch.asu.edu/profile/2424157",
  "status": "success",
  "content": "Paulo Shakarian | ASU Search Paulo Shakarian Adjunct Faculty, Center for Cybersecurity and Trusted Foundations Affiliates [email protected] Long Bio Paulo Shakarian, Ph.D. is an Adjutant Faculty member at Arizona State University.  His research interests include logic programming, artificial intelligence, abductive learning, data mining, machine learning, and computer security.  Previously, he held a tenured position at ASU's School of Computing and AI.  He is currently a full Professor at Syracuse University. Education Ph.D. Computer Science, University of Maryland-College Park 2011 M.S. Computer Science, University of Maryland-College Park 2009 B.S. Computer Science, U.S. Military Academy 2002 Video Google Scholar URL https://scholar.google.com/citations?user=Xii5xrIAAAAJ&hl=en&oi=ao Research Interests artificial intelligence, logic, machine learning Courses 2025 Summer Course Number Course Title CEN 584 Internship 2025 Spring Course Number Course Title CSE 792 Research CSE 799 Dissertation CSE 790 Reading and Conference CEN 580 Practicum CSE 580 Practicum CSE 790 Reading and Conference CSE 580 Practicum CEN 799 Dissertation DSE 792 Research DSE 799 Dissertation ASU 101-CAI The ASU Experience CSE 471 Intro Artificial Intelligence 2024 Fall Course Number Course Title CSE 493 Honors Thesis CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 499 Individualized Instruction CSE 590 Reading and Conference CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 492 Honors Directed Study CEN 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 590 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration CSE 792 Research CEN 690 Reading and Conference DSE 792 Research CEN 792 Research ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience CSE 471 Intro Artificial Intelligence CSE 471 Intro Artificial Intelligence 2024 Summer Course Number Course Title CSE 584 Internship CSE 790 Reading and Conference CEN 584 Internship DSE 792 Research 2024 Spring Course Number Course Title CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 792 Research CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CSE 475 Found of Machine Learning DSE 792 Research ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience CEN 580 Practicum DSE 792 Research 2023 Fall Course Number Course Title CSE 493 Honors Thesis CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 499 Individualized Instruction CSE 590 Reading and Conference CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 492 Honors Directed Study CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 590 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration CSE 792 Research DSE 792 Research ASU 101-CAI The ASU Experience CEN 792 Research ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience CSE 475 Found of Machine Learning CSE 475 Found of Machine Learning CSE 598 Special Topics 2023 Summer Course Number Course Title CSE 584 Internship CEN 584 Internship 2023 Spring Course Number Course Title CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 595 Continuing Registration CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CSE 475 Found of Machine Learning ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience ASU 101-CAI The ASU Experience 2022 Fall Course Number Course Title CSE 792 Research CEN 792 Research CSE 492 Honors Directed Study ASU 101-CSE The ASU Experience ASU 101-CSE The ASU Experience CSE 591 Seminar CSE 475 Found of Machine Learning ASU 101-CSE The ASU Experience 2022 Summer Course Number Course Title CSE 584 Internship CEN 584 Internship 2022 Spring Course Number Course Title CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 595 Continuing Registration CSE 580 Practicum CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CSE 493 Honors Thesis 2021 Fall Course Number Course Title CSE 493 Honors Thesis CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 499 Individualized Instruction CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 590 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration 2021 Summer Course Number Course Title CSE 584 Internship CEN 584 Internship 2021 Spring Course Number Course Title CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 595 Continuing Registration CSE 580 Practicum CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CSE 493 Honors Thesis 2020 Fall Course Number Course Title CSE 493 Honors Thesis CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 499 Individualized Instruction CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 590 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration Expertise Areas Artificial Intelligence Logic Machine Learning",
  "content_length": 6113,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:23"
}