{
  "name": "Paul N. Watton",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/paul-watton",
  "status": "success",
  "content": "Professor Paul Watton | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Paul Watton BSc, MSc, PhD School of Computer Science Professor of Computational & Theoretical Modelling Head of the Complex Systems Modelling research group Open staff member portrait in a modal window p.watton@sheffield.ac.uk +44 114 222 6076 Regent Court (DCS) Full contact details Professor Paul Watton School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-5531-5953 Google Scholar Profile Paul Watton has a first degree in Pure & Applied Mathematics from the University of Newcastle, an MSc in Mathematical Logic and the Foundations of Computer Science from the University of Manchester, and a PHD in Applied Mathematics from the University of Leeds. Following his PhD he had postdoctoral positions at the University of Glasgow (2003-2006) and the University of Oxford (2006-2013).The main focus of his research is developing theoretical/computational models for the biomechanics and mechanobiology of soft biological tissues with application to homeostasis, ageing and disease.Paul was appointed as Lecturer in the Department of Computer Science in 2013, promoted to Senior Lecturer in 2017 and Professor of Computational and Theoretical Modelling in 2024. He also holds an adjunct professorship with the Department of Mechanical Engineering and Materials Science, University of Pittsburgh. Research interests Mathematical and computational biomechanics and mechanobiology; constitutive modelling of soft biological tissues; theoretical and computational analyses of growth and remodeling; cardiovascular mechanics; arterial mechanics; biofluid mechanics; continuum mechanics; vascular mechanobiology; aneurysms; bladder biomechanics and mechanobiology. Publications Journal articles Azari F, Robertson AM, Tobe Y, Watton PN, Birder LA, Yoshimura N, Matsuoka K, Hardin C & Watkins S (2025) Elucidating the high compliance mechanism by which the urinary bladder fills under low pressures. Scientific Reports, 15(1). View this article in WRRO Rahman MM, Watton PN, Neu CP & Pierce DM (2025) Predicting the heterogeneous chemo-mechano-biological degeneration of cartilage using 3-D biphasic finite elements. Computer Methods and Programs in Biomedicine, 270. View this article in WRRO Takaoka E, Kurobe M, Matsuoka K, Kamijo T, Kimura S, Watton PN, Robertson AM & Yoshimura N (2025) Adenosine receptor mechanisms underlying bladder dysfunction in male rats with bladder outlet obstruction. Neurourology and Urodynamics, 44(6), 1370-1377. View this article in WRRO Rahman MM, Watton PN, Neu CP & Pierce DM (2023) A chemo-mechano-biological modeling framework for cartilage evolving in health, disease, injury, and treatment. Computer Methods and Programs in Biomedicine, 231. View this article in WRRO Cheng F, Watton P, Pederzani G, Kurobe M, Takaoka E-I, Chapple C, Birder L, Yoshimura N & Robertson A (2022) A constrained mixture-micturition-growth (CMMG) model of the urinary bladder: Application to partial bladder outlet obstruction (BOO). Journal of the Mechanical Behavior of Biomedical Materials, 134. Krishna CV, Suja VC, Watton P, Arakeri JA & Gundiah N (2020) Shear stress rosettes capture the complex flow physics in diseased arteries. Journal of Biomechanics, 104. View this article in WRRO Bhogal P, Pederzani G, Grytsan A, Loh Y, Brouwer PA, Andersson T, Gundiah N, Robertson AM, Watton PN & Söderman M (2019) The unexplained success of stentplasty vasospasm treatment. Clinical Neuroradiology, 29(4), 763-774. Xu H, Mei Y, Han X, Wei J, Watton PN, Jia W, Li A, Chen D & Xiong J (2019) Optimization schemes for endovascular repair with parallel technique based on hemodynamic analyses. International Journal for Numerical Methods in Biomedical Engineering, 35(6). View this article in WRRO Bevan T, Hornsby J, Merabet N, Thompson M & Watton P (2018) A biomechanical model for fibril recruitment: Evaluation in tendons and arteries. Journal of Biomechanics, 74, 192-196. View this article in WRRO Cheng F, Birder L, Kullman FA, Hornsby J, Watton P, Watkins SC, Thompson M & Robertson AM (2018) Layer dependent role of collagen recruitment during loading of the rat bladder wall. Biomechanics and Modeling in Mechanobiology, 17(2), 403-417. View this article in WRRO Hornsby J, Daly D, Grundy D, Cheng F, Robertson AM, Watton P & Thompson M (2017) Quantitative multiphoton microscopy of murine urinary bladder morphology during in situ uniaxial loading. Acta Biomaterialia, 64, 59-66. View this article in WRRO Xu H, Li Z, Dong H, Zhang Y, Wei J, Watton P, Guo W, Chen D & Xiong J (2017) Hemodynamic parameters that may predict false-lumen growth in type-B aortic dissection after endovascular repair: A preliminary study on long-term multiple follow-ups. Medical Engineering & Physics, 50, 12-21. View this article in WRRO Grytsan A, Eriksson TSE, Watton P & Gasser TC (2017) Growth description for vessel wall adaptation: a thick-walled mixture model of abdominal aortic aneurysm evolution. Materials, 10(9). View this article in WRRO Aparício P, Thompson MS & Watton PN (2016) A novel chemo–mechano–biological model of arterial tissue growth and remodelling. Journal of Biomechanics, 49(12), 2321-2330. Poelma C, Watton PN & Ventikos Y (2015) Transitional flow in aneurysms and the computation of haemodynamic parameters. Journal of The Royal Society Interface, 12(105). Grytsan A, Watton PN & Holzapfel GA (2015) A Thick-Walled Fluid–Solid-Growth Model of Abdominal Aortic Aneurysm Evolution: Application to a Patient-Specific Geometry. Journal of Biomechanical Engineering, 137(3). Eriksson TSE, Watton P, Luo XY & Ventikos Y (2014) Modelling volumetric growth in a thick walled fibre reinforced artery. Journal of the Mechanics and Physics of Solids, 73, 134-150. View this article in WRRO Aparício P, Mandaltsi A, Boamah J, Chen H, Selimovic A, Bratby M, Uberoi R, Ventikos Y & Watton PN (2014) Modelling the influence of endothelial heterogeneity on the progression of arterial disease: application to abdominal aortic aneurysm evolution.. Int J Numer Method Biomed Eng, 30(5), 563-586. Selimovic A, Ventikos Y & Watton PN (2014) Modelling the evolution of cerebral aneurysms: Biomechanics, mechanobiology and multiscale modelling. Procedia IUTAM, 10, 396-409. Chen H, Selimovic A, Thompson H, Chiarini A, Penrose J, Ventikos Y & Watton PN (2013) Investigating the influence of haemodynamic stimuli on intracranial aneurysm inception.. Ann Biomed Eng, 41(7), 1492-1504. Schmid H, Grytsan A, Poshtan E, Watton PN & Itskov M (2013) Influence of differing material properties in media and adventitia on arterial adaptation - application to aneurysm formation and rupture. Computer Methods in Biomechanics and Biomedical Engineering, 16(1), 33-53. Robertson AM & Watton PN (2012) Computational fluid dynamics in aneurysm research: critical reflections, future directions. American journal of neuroradiology, 33, 992-995. Luo XY, Griffith BE, Ma XS, Yin M, Wang TJ, Liang CL, Watton PN & Bernacca GM (2012) Effect of bending rigidity in a dynamic model of a polyurethane prosthetic mitral valve.. Biomech Model Mechanobiol, 11(6), 815-827. Watton PN, Horner M, Penrose J, Thompson H, Chen H, Selimovic A & Ventikos Y (2011) Patient-specific modelling of intracranial aneurysm evolution. ASME 2011 Summer Bioengineering Conference Sbc 2011(PARTS A AND B), 691-692. Halliday I, Atherton M, Care CM, Collins MW, Evans D, Evans PC, Hose DR, Khir AW, König CS, Krams R , Lawford PV et al (2011) Multi-scale interaction of particulate flow and the artery wall. Medical Engineering and Physics, 33(7), 840-848. Ho H, Suresh V, Kang W, Cooling MT, Watton PN & Hunter PJ (2011) Multiscale modeling of intracranial aneurysms: Cell signaling, hemodynamics, and remodeling. IEEE Transactions on Biomedical Engineering, 58(10 PART 2), 2974-2977. Halliday I, Atherton M, Care CM, Collins MW, Evans D, Evans PC, Hose DR, Khir AW, König CS, Krams R , Lawford PV et al (2011) Multi-scale interaction of particulate flow and the artery wall.. Med Eng Phys, 33(7), 840-848. Watton PN, Selimovic A, Raberger NB, Huang P, Holzapfel GA & Ventikos Y (2011) Modelling evolution and the evolving mechanical environment of saccular cerebral aneurysms.. Biomechanics and modeling in mechanobiology, 10, 109-32. Bowker TJ, Watton PN, Summers PE, Byrne JV & Ventikos Y (2010) Rest versus exercise hemodynamics for middle cerebral artery aneurysms: a computational study.. AJNR Am J Neuroradiol, 31(2), 317-323. Schmid H, Watton PN, Maurer MM, Wimmer J, Winkler P, Wang YK, Roehrle O & Itskov M (2010) Impact of transmural heterogeneities on arterial adaptation. BIOMECHANICS AND MODELING IN MECHANOBIOLOGY, 9(3), 295-315. Yin M, Luo XY, Wang TJ & Watton PN (2010) Effects of flow vortex on a chorded mitral valve in the left ventricle. International Journal for Numerical Methods in Biomedical Engineering, 26(3-4), 381-404. Ventikos Y, Holland EC, Bowker TJ, Watton PN, Kakalis NMP, Megahed M, Zhu F, Summers PE & Byrne JV (2009) Computational modelling for cerebral aneurysms: risk evaluation and interventional planning.. Br J Radiol, 82 Spec No 1, S62-S71. Watton PN, Ventikos Y & Holzapfel GA (2009) Coupling the haemodynamic environment to the evolution of cerebral aneurysms. Proceedings of the ASME Summer Bioengineering Conference 2009 Sbc2009(PART A), 161-162. Schmid H, Watton P, Röhrle O, Wang Y & Itskov M (2009) 3D modelling of arterial growth for adaptation to hypertension — the influence of transmural changes in the mechanical environment. PAMM, 9(1), 71-74. Ventikos Y, Bowker TJ, Watton PN, Kakalis NMP & Byrne JV (2009) Risk evaluation and interventional planning for cerebral aneurysms: Computational models for growth, coiling and thrombosis. International Journal of Computational Fluid Dynamics, 23(8), 595-607. Watton P & Ventikos Y (2009) Model",
  "content_length": 31174,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:57"
}