{
  "name": "Paul Wollan",
  "homepage": "http://wwwusers.di.uniroma1.it/~wollan",
  "status": "success",
  "content": "Paul Wollan's Homepage Paul Wollan I am a Professor (Professore ordinario) in the Department of Computer Science at the University of Rome \"La Sapienza\". I completed my PhD in Algorithms, Combinatorics, and Optimization in 2005 at Georgia Tech. Robin Thomas was my thesis advisor. I spent 2006 as a Postdoctoral Fellow in the Department of Combinatorics and Optimization at the University of Waterloo. From 2007 - 2009, I was a Research Fellow under the support of the Alexander von Humboldt Foundation at the University of Hamburg in the research group of Reinhard Diestel. I was the group leader for Project DASTCO from 2011 - 2017 under funding by an ERC Starting Grant from the European Research Council under the European Unions Seventh Framework Programme (FP7/2007-2013). Postal Address Department of Computer Science University of Rome Piazzale Aldo Moro 5 00185 Rome, Italy Phone:  +39 06 49 91 84 25 Email: <last name> at di.uniroma1.it Publications and Recent Manuscripts Please see here for list of current publications and \t\t\tpreprints. Curriculum Vitae This is a recent copy of my curriculum vitae. Didattica Orari di ricevemento/Office hours: giovedì/ Thursday 10:30 - 12:00. Ufficio/Office: Via Regina Elena 295, Palazzina G 28 Secondo Semestre, 2024/25 Progettazione di algoritmi, canale 1: sito del corso. Optimization: course page. Graph Theory: course page. ERC DASTCO: Developing and Applying Structural Techniques for Combinatorial Objects I was the principal investigator of the European Research Starting Grant DASTCO. The project sought to create new structural tools and techniques for graphs and other combinatorial objects by studying labeled graphs with the goal of increasing our understanding of the classic results in graph theory while developing a broader structural theory of labeled graphs. Please see the project page for more information. Events and Recent Talks The next Bertinoro Workshop on Algorithms and Graphs will be held in October 2025. Bertinoro and Southern Italian Workshop on Algorithms and Graphs After a long hiatus, the Bertinoro Workshop on Algorithms and Graphs will be held again in October 2025 at the Bertinoro International Center for Informatics. The meeting was held at the Bertinoro International Center for Informatics in 2009 - 2013. The 2016 meeting was held near the town of Polignano a Mare on the Adriatic coast. The conference webpage can be found here. The plenary speakers for the 2025 meeting will be: Maria Chudnovsky, Princeton University James Davies, Cambridge University Agelos Georgakopoulos, Warwick University Tuuka Korhonen, University of Copenhagen Rose McCarty, Georgia Institute of Technology Vera Traub, University of Bonn Kristina Vuskovic, University of Leeds Sebastian Wiederecht, KAIST The 2013 and 2016 meeting were generously supported by the European Research Council under ERC grant number 279558. 2016: The list of talks and abstracts. 2013: The list of talks and abstracts, and the participants. 2011: The list of talks and abstracts, and the participants. 2009: The list of talks and abstracts, and the participants.",
  "content_length": 3113,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:03"
}