{
  "name": "Paul Goldberg 0001",
  "homepage": "https://www.cs.ox.ac.uk/people/paul.goldberg",
  "status": "success",
  "content": "Paul Goldberg | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyPaul GoldbergPaul Goldberg Professor Paul Goldberg Professor of Computer ScienceDirector of MSc in MFoCSE: paul.goldberg@cs.ox.ac.ukT: +44 (0)1865 610756 Room 255, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Algorithms and Complexity TheorySee Also:Personal home pageEPSRC project: Efficient Algorithms for Mechanism Design Without Monetary TransferEU COST action on Computational Social ChoiceInterestsI’m interested in hearing from prospective research students or other collaborators. Topics/key phrases: machine learning; game-theoretic models for data Agent-based models; calibration with real-world data decentralized computation of economic equilibria computational complexity, communication complexity, query complexity personal web page (with link to list of my papers, current teaching, etc) (tends to be more detailed and up-to-date than this page.) Algorithms and Data Structures MoodleBiographySince July 2013 I have been a professor at the Department of Computer Science, Oxford University. Prior to that I was a professor of Computer Science at the University of Liverpool, where I was founding head of the Economics and Computation (ECCO) research group. I have also taught at the University of Warwick, and been a member of research groups at Aston University and Sandia National Labs, USA. The unifying theme of my work is algorithms having mathematically proven performance guarantees. I have worked extensively in computational learning theory (machine learning algorithms, sample size bounds). Some other work is in computational biology and approximation algorithms. Most of my recent work since 2002 is in algorithmic game theory (complexity of equilibrium computation, analysis of best-response and better-response dynamics). More recently (since 2017) I have also worked on computational complexity of \"total search problems\" in the complexity class NP (this stems from earlier work on the complexity of Nash equilibrium computation).ActivitiesFoundational Issues in Computational LearningAlgorithms At LargeAlgorithmic Game Theory and Computational EconomicsProjectsOptimisation for Game Theory and Machine LearningBMW Current Students Matan GilboaOwen GreenGiannis Tyrovolas Research Abheek GhoshResearch AssociateNicholas TehPostdoctoral Research Associate Past Students Matthias GerstgrasserAlexandros HollenderStefano TurchettaAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2743,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:47"
}