{
  "name": "Paul Gazzillo",
  "homepage": "https://paulgazzillo.com",
  "status": "success",
  "content": "Paul Gazzillo - Paul Gazzillo Paul Gazzillo Associate Professor of Computer Science at University of Central Florida Recent Publication Check out our paper from ICSE 2025 “A Little Goes a Long Way: Tuning Configuration Selection for Continuous Kernel Fuzzing” by Sanan Hasanov, Stefan Nagy, and Paul Gazzillo. Publications APPLeSEEd Lab The Applied Programming Languages, Software Engineering, and Education (APPLeSEEd) Lab tackles problems in software, security, and systems and cultivates computational thinking. People CyberSP Cluster The Cyber Security and Privacy (CyberSP) Cluster is a university-wide research cluster formed as part of the Faculty Cluster Initiative that focuses on security and privacy in cyberspace. Homepage Paul Gazzillo is an Associate Professor of Computer Science at University of Central Florida. He received his PhD from NYU and previously worked as a Post-Doc at Yale and a Research Scholar at Stevens Institute. His research aims to make it easier to develop safe and secure software, and it spans program analysis, software engineering, and security. Projects include analysis of configurable software, software supply chain security, and corporate entity tracking. His work has been published in venues such as ICSE, ESEC/FSE, and PLDI and has been recognized with a DARPA Young Faculty Award, an NSF CAREER Award, and an ACM SIGPLAN Research Highlight. Email Twitter LinkedIn GitHub YouTube Blog ACM dblp Scholar News Apr 2025 Sanan Hasanov gave a talk at ICSE 2025 on our recent paper. Apr 2024 Donovan Reynolds has joined the lab. Jan 2024 Adam Betinsky, Kenneth Valladares, Ryan Mangeno, Shanna Byrd have joined the lab. Aug 2024 Brent Pappas was recognized as a Distinguished Artifact Reviewer for the OOPSLA 2024 AEC. Aug 2024 I have been promoted to Associate Professor. July 2024 Our paper \"A Little Goes a Long Way: Tuning Configuration Selection for Continuous Kernel Fuzzing\" by Sanan Hasanov, Stefan Nagy, and Paul Gazzillo has been accepted to ICSE 2025! June 2024 Derian Comas has joined the lab. See all news here.",
  "content_length": 2070,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:47"
}