{
  "name": "Paul A. Jenkins",
  "homepage": "https://warwick.ac.uk/fac/sci/statistics/staff/academic-research/jenkins",
  "status": "success",
  "content": "Professor Paul Jenkins Skip to main content Skip to navigation I am a Professor in the Depts of Statistics and Computer Science, with interests in Monte Carlo methods, inference from stochastic processes, mathematical population genetics, machine learning. I am a member of the Warwick Machine Learning group.TeachingST341 Statistical GeneticsST418 Statistical Genetics with Advanced TopicsST407 Monte Carlo MethodsI am currently supervising undergraduate and Masters projects via our project modules CS350, ST415, ST421, and ST955. I do not participate in URSS. Sorry I am currently unable to take on any undergraduate projects or internships from applications outside Warwick.PreprintsSant, J., Jenkins, P. A., Koskela, J., and Spanò, D. Bayesian inference from time series of allele frequency data using exact simulation techniques.[ arXiv ]Jenkins, P. A. The mutual arrangement of Wright–Fisher diffusion path measures and its impact on parameter estimation.[ arXiv ]Koskela, J., Jenkins, P. A., Johansen, A. M., and Spanò, D. Genealogical processes of non-neutral population models under rapid mutation.[ arXiv ]Hanson, P. A., Jenkins, P. A., Koskela, J., and Spanò, D. Diffusion limits at small times for coalescent processes with mutation and selection.[ arXiv ]PublicationsJenkins, P. A., Koskela, J., Rivero, V. M., Sant, J., Spanò, D., and Valentić, I. (2025). Excursion theory for the Wright–Fisher diffusion. Electronic Journal of Probability, 30: 1–31.[ Abstract & PDF ] [ arXiv ]Favero, M., and Jenkins, P. A. (2025). Sampling probabilities, diffusions, ancestral graphs, and duality under strong selection. Electronic Journal of Probability, 30: 1–42.[ Abstract & PDF ] [ arXiv ]Avalos-Pacheco, A., Crönjager, M. C., Jenkins, P. A., and Hein, J. (2024). An almost infinite sites model. Theoretical Population Biology, 160: 46–61.[ Abstract & PDF ]Kim, W., Jenkins, P. A., and Yau, C. (2024). Mixed type multimorbidity variational autoencoder: a deep generative model for multimorbidity analysis. Proceedings of the 9th Machine Learning for Healthcare Conference, PMLR 252.[ Abstract & PDF ]Jenkins, P. A., Pollock, M., and Roberts, G. O. (2023). Flexible Bayesian inference for diffusion processes using splines. Methodology & Computing in Applied Probability, 25: 83.[ Abstract & PDF ] [ arXiv ]Griffiths, R. C., and Jenkins, P. A. (2023). An estimator for the recombination rate from a continuously observed diffusion of haplotype frequencies. Journal of Mathematical Biology, 86: 98.[ Abstract & PDF ] [ arXiv ]Brown, S., Jenkins, P. A., Johansen, A. M., and Koskela, J. (2023). Weak convergence of non-neutral genealogies to Kingman's coalescent. Stochastic Processes and their Applications, 162: 76–105.[ Abstract & PDF ] [ arXiv ]Sant, J., Jenkins, P. A., Koskela, J., and Spanò, D. (2023). EWF: simulating exact paths of the Wright–Fisher diffusion. Bioinformatics, 39 (1): btad017.[ Abstract & PDF ] [ arXiv ] [ Software ]Kim, W., Jenkins, P. A., and Yau, C. (2022). Feature allocation approach for multimorbidity trajectory modelling. Proceedings of the 2nd Machine Learning for Health symposium, PMLR 193: 103–119.[ Abstract & PDF ]Sant, J., Jenkins, P. A., Koskela, J., and Spanò, D. (2022). Convergence of likelihood ratios and estimators for selection in nonneutral Wright–Fisher diffusions. Scandinavian Journal of Statistics, 49 (4): 1728–1760.[ Abstract & PDF ] [ arXiv ]Ignatieva, A., Hein, J., and Jenkins, P. A. (2022). Ongoing recombination in SARS-CoV-2 revealed through genealogical reconstruction. Molecular Biology and Evolution, 39 (2): msac028.[ Abstract & PDF ] [ biorXiv (an earlier version) ]Ignatieva, A., Lyngsø, R. B., Jenkins, P. A., and Hein, J. (2021). KwARG: Parsimonious reconstruction of ancestral recombination graphs with recurrent mutation. Bioinformatics, 37 (19): 3277–3284. [ Abstract & PDF ] [ arXiv ] [ bioRxiv (an earlier version) ] [ Software ]Brown, S., Jenkins, P. A., Johansen, A. M., and Koskela, J. (2021). Simple conditions for convergence of sequential Monte Carlo genealogies with applications. Electronic Journal of Probability, 26: 1–22. [ Abstract & PDF ] [ arXiv ]Ignatieva, A., Hein, J., and Jenkins, P. A. (2020). A characterisation of the genealogy of a birth-death process through time rescaling. Theoretical Population Biology, 134: 61–76.[ Abstract ] [ arXiv ]Koskela, J., Jenkins, P. A., Johansen, A. M., and Spanò, D. (2020). Asymptotic genealogies of interacting particle systems with an application to sequential Monte Carlo. Annals of Statistics, 48 (1): 560–583. [ Abstract ] [ arXiv ]Koskela, J., Spanò, D., and Jenkins, P. A. (2019). Consistency of Bayesian nonparametric inference for discretely observed jump diffusions. Bernoulli, 25 (3): 2183–2205.[ Abstract ] [ arXiv ]Favaro, S., Feng, S., and Jenkins, P. A. (2019). Bayesian nonparametric analysis of Kingman's coalescent. Annales de l'Institut Henri Poincaré (B) Probability and Statistics, 55 (2): 1087–1115.[ Abstract ] [ arXiv ]Chan, J., Perrone, V., Spence, J. P., Jenkins, P. A., Mathieson, S., and Song, Y. S. (2018). A likelihood-free inference framework for population genetic data using exchangeable neural networks. Advances in Neural Information Processing Systems 31:8594–8605. [ Abstract & PDF ] [ arXiv ] [ bioRxiv ]Griffiths, R. C., Jenkins, P. A., and Spanò, D. (2018). Wright–Fisher diffusion bridges. Theoretical Population Biology, 122: 67–77. [ Abstract ] [ arXiv ]Koskela, J., Jenkins, P. A., and Spanò, D. (2018). Bayesian non-parametric inference for Λ-coalescents: consistency and a parametric method. Bernoulli, 24 (3): 2122–2153.[ Abstract ] [ arXiv ]Koskela, J., Jenkins, P. A., and Spanò, D. (2018). Inference and rare event simulation for stopped Markov processes via reverse-time sequential Monte Carlo. Statistics & Computing, 28 (1): 131–144.[ Abstract ] [ arXiv ]Perrone, V., Jenkins, P. A., Spanò, D., and Teh, Y. W. (2017). Poisson random fields for dynamic feature models. Journal of Machine Learning Research, 18 (127): 1–45.[ Abstract & PDF ] [ arXiv ]Griffin, A., Jenkins, P. A., Roberts, G. O., and Spencer, S. E. F. (2017). Simulation from quasi-stationary distributions on reducible state spaces. Advances in Applied Probability, 49 (3): 960–980.[ Abstract ] [ arXiv ]Jenkins, P. A., and Spanò, D. (2017). Exact simulation of the Wright–Fisher diffusion. Annals of Applied Probability, 27 (3): 1478–1509.[ Abstract and Correction ] [ arXiv ] [ CRiSM Working Paper 14-27 (an earlier version) ]Griffiths, R. C., Jenkins, P. A., and Lessard, S. (2016). A coalescent dual process for a Wright–Fisher diffusion with recombination and its application to haplotype partitioning. Theoretical Population Biology, 112: 126–138.[ Abstract ] [ arXiv ] [ Oberwolfach report ]Dialdestoro, K., Sibbesen, J. A., Maretty, L., Raghwani, J., Gall, A., Kellam, P., Pybus, O. G., Hein, J., and Jenkins, P. A. (2016). Coalescent inference using serially sampled, high-throughput sequencing data from intra-host HIV infection. Genetics, 202 (4): 1449–1472.[ Abstract ] [ bioRxiv ]Koskela, J., Jenkins, P., and Spanò, D. (2015). Computational inference beyond Kingman's coalescent. Journal of Applied Probability, 52 (2): 519–537.[ Abstract ] [ arXiv ]Jenkins, P. A., Fearnhead, P., and Song, Y. S. (2015). Tractable diffusion and coalescent processes for weakly correlated loci. Electronic Journal of Probability, 20: 1–26.[ Abstract & PDF ] [ arXiv ]Jenkins, P. A., Mueller, J.W, and Song, Y. S. (2014). General triallelic frequency spectrum under demographic models with variable population size. Genetics, 196 (1): 295–311.[ Abstract ] [ arXiv ]Chan, A. H., Jenkins, P. A., and Song, Y. S. (2012). Genome-wide fine-scale recombination rate variation in Drosophila melanogaster. PLoS Genetics, 8 (12): e1003090.[ Abstract & PDF ] [ Software ]Jenkins, P. A., Song, Y. S., and Brem, R. B. (2012). Genealogy-based methods for inference of historical recombination and gene flow and their application in Saccharomyces cerevisiae. PLoS ONE, 7 (11): e46947.[ Abstract & PDF ]Jenkins, P. A. and Song, Y. S. (2012). Padé approximants and exact two-locus sampling distributions. Annals of Applied Probability, 22 (2): 576–607. (Technical Report #793, Department of Statistics, University of California, Berkeley, 2010.) [ Abstract ] [ arXiv ] [ Tech Report Version ]Jenkins, P. A. (2012). Stopping-time resampling and population genetic inference under coalescent models. Statistical Applications in Genetics and Molecular Biology, 11 (1): Article 9. [ Abstract ] [ PDF ]Jenkins, P. A. and Song, Y. S. (2011). The effect of recurrent mutation on the frequency spectrum of a segregating site and the age of an allele. Theoretical Population Biology, 80 (2): 158–173. [ Abstract ] [ Preprint ]Jenkins, P. A. and Griffiths, R. C. (2011). Inference from samples of DNA sequences using a two-locus model. Journal of Computational Biology, 18 (1): 109–127. [ Abstract ] [ PDF ]Jenkins, P. A. and Song, Y. S. (2010). An asymptotic sampling formula for the coalescent with recombination. Annals of Applied Probability, 20 (3): 1005–1028. (Technical Report #775, Department of Statistics, University of California, Berkeley, 2009.) [ Abstract ] [ arXiv ] [ Tech Report Version ]Jenkins, P. A. and Song, Y. S. (2009). Closed-form two-locus sampling distributions: accuracy and universality. Genetics, 183 (3): 1087–1103. [ Abstract ] [ PDF ] [ Software ]Griffiths, R. C., Jenkins, P. A., and Song, Y. S. (2008). Importance sampling and the two-locus model with subdivided population structure. Advances in Applied Probability, 40 (2): 473–500. [ Abstract ] [ Preprint ]Jenkins, P., Lyngsø, R., and Hein, J. (2006). How many transcripts does it take to reconstruct the splice graph? In: Proceedings of the Workshop on Algorithms in Bioinformatics, Lecture Notes in Computer Science vol. 4175, pp. 103–114. [ Abstract ] [ PDF ] [ Supplementary material ]MiscellaneousJenkins, P. A. (2013). Exact simulation of the sample paths of a diffusion with a fini",
  "content_length": 10753,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:38"
}