{
  "name": "Paul Maglio",
  "homepage": "http://mist.ucmerced.edu/pmaglio",
  "status": "success",
  "content": "Paul P. Maglio | B.A. in Management of Innovation, Sustainability & Technology @ UC Merced Skip to content Select Language Select Language English Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scottish Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sudanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Directory Apply Give Enter your keywords B.A. in Management of Innovation, Sustainability & Technology @ UC Merced School of Engineering Select Language Select Language English Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scottish Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sudanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Navigation menu Paul P. Maglio Professor of Management and Cognitive Science School of Engineering, UC Merced 5200 N. Lake Rd. School of Engineering University of California, Merced Merced, CA 95343 Paul P. Maglio is a Professor of Management and Cognitive Science at the University of California, Merced. He holds a bachelor’s degree in computer science and engineering from MIT and a Ph.D. in cognitive science from the University of California, San Diego. One of the founders of the field of service science, Dr Maglio was the Editor-in-Chief of INFORMS Service Science (2013-2018), and is lead editor of the Handbook of Service Science, Volumes I and II. He has published more than 125 papers in computer science, cognitive science, and service science. Vita | Biography | Teaching | Publications | pmaglio at ucmerced.edu Handbook of Service Science | Handbook of Service Science, Volume II | Taming Information Technology | Service in the AI Era Additional Links UC Merced Newsroom Executive Leadership University Library Academics School of Engineering School of Natural Sciences School of Social Sciences, Humanities & Arts Ernest & Julio Gallo Management Program Division of Graduate Education Division of Undergraduate Education Administration Office of the Chancellor Office of Executive Vice Chancellor and Provost Equity, Justice and Inclusive Excellence External Relations Finance & Administration Physical Operations, Planning and Development Student Affairs Research and Economic Development Office of Information Technology University of California, Merced 5200 North Lake Rd. Merced, CA 95343 Telephone: (209) 228-4400 © 2025 About UC Merced Directions Directory Privacy/Legal Site Feedback UC Regents Accessibility Nondiscrimination Policy Site List Please ensure Javascript is enabled for purposes of website accessibility",
  "content_length": 3932,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:55"
}