{
  "name": "Paul York",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=pyork1",
  "status": "success",
  "content": "Paul York - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Paul York Assistant Professor Paul York Assistant Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Information Systems/Technology BioDr. York has over thirty years of professional and academic experience in the computer science and information systems field. He holds an MS in Computer Science from Georgia Institute of Technology and a Ph.D. in Management Information Systems from the University of Georgia. PAUL.YORK@augusta.edu (706) 667-4538 University Hall Cyber Institute General Credentials Instruction Scholarship Service Education MSCS, Computer and Information Sciences, General Georgia Institute of Technolog, 2017 Ph.D., Business Administration and Management, General University of Georgia, 2011 BBA, Management Science University of Georgia, 1994 Awards & Honors Presidential Graduate Fellowship University of Georgia Edward T. Comer Fellowship University of Georgia, 2004 Courses Taught Most Recent Academic Year AIST 3410 Database Management Systems AIST 2120 Scripting & Automation II AIST 2110 Principles of Scripting Teaching Interests Teaching interests include software development of all kinds at all levels, software engineering, and database management systems. Scholarship Selected Recent Publications Use of a Telehealth System to Enhance a Home Exercise Program for a Person With Parkinson Disease: A Case Report, 2018 Journal Article, Academic Journal Auger - Automated Feedback and Grading for Web Projects (major new version), 2017 Software Auger - Automated Feedback and Grading for Web Projects, 2016 Software START - A System for Technology-Augmented Rehabilitation and Training, 2016 Software KinectEx, 2014 Software Research Interests Research interests include artificial intelligence and computer vision, assistive technologies, social media, open-source software, business models and communities, pedagogy and educational technology, and most anything that involve designing and creating technologies that improve lives. College Service Biomedical Systems Engineering Proposal Committee 2021 - Present Role: Committee Member SCCS Faculty Assembly 2020 - 2021 Role: Committee Chair IT Program Director 2017 - 2019 Role: Other SCCS Academic Affairs Committee 2017 - 2018 Role: Committee Chair SCCS Executive Committee 2017 - 2018 Role: Committee Member University Service Quality Enhancement Program Advisory Committee 2020 - Present Role: Committee Member Research Scholarship and Creative Activity Review Committee 2020 - 2020 Role: Committee Member AU Senate Bylaw Committee 2019 - 2020 Role: Committee Member Budget Advisory, Inf Tech and Univ Resources 2016 - 2018 Role: Committee Member Applied Information Systems and Technology Curriculum and Planning Committee 2007 - 2017 Role: Committee Member Professional Service 2013 International Conference on Information Systems 2013 - 2013 Role: Reviewer, Conference Paper 2012 International Conference on Information Systems 2012 - 2012 Role: Editor, Associate Editor ei2012 -- Energy Informatics Conference 2012 - 2012 Role: Editor, Associate Editor 2011 International Conference on Information Systems 2011 - 2011 Role: Reviewer, Conference Paper Information and Organization 2009 - 2011 Role: Reviewer, Journal Article",
  "content_length": 3492,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:03"
}