{
  "name": "Paul Amer",
  "homepage": "https://www.eecis.udel.edu/~amer",
  "status": "success",
  "content": "Paul Amer's Home Page Paul D. Amer Alumni Distinguished Professor Emeritus Welcome message 103 Smith Hall, CIS Dept, Univ of Delaware, Newark, DE 19716 cell: (302) 540-8840 click dots to the right to retrieve email address ----> a... Professional Activities My 2016 Retirement Party (YouTube) Photos Research: Protocol Engineering Laboratory Nasif Ekiz wins Applied Networking Research Prize for \"Misbehaviors in TCP SACK Generation,\" ACM Computer Communication Review, 41(2) by Nasif Ekiz, Abu Rahman and Paul Amer (more details) Tbit tests for ACM CCR paper \"Misbehaviors in TCP SACK Generation\" $50K Gift from Google to study SPDY-Chrome over SCTP CIS Research Day Poster - Transport Layer Reneging CIS Research Day Poster - Non-Renegable Selective ACKs (NR-SACKs) CIS and ECE receive $5.7M to become part of Army Research Lab Collaborative Technology Alliance Movie animations comparing HTTP over TCP vs. HTTP over SCTP The Transport Layer: Survey and Tutorial, ACM Computing Surveys, 31(4), Dec 1999 SCTP - Stream Control Transmission Protocol Transport Layer Comparison: SCTP vs TCP vs UDP SUNY at Albany Alumni 2009 Award for Excellence in Science and Technology (see bottom of article) Teaching: Courses taught at Univ of Delaware My 2011 College of Engineering Convocation Graduation Speech (127MB) My 2006 Alumni Distinguished Professor Inaugural Lecture (470MB) Transport Layer Applets: Designed for Kurose-Ross textbook: Computer Networking: A Top-Down Approach Go Back N Selective Repeat Computing Museum at UD: Inaugural exhibit opens Puzzles Interesting Triangle Puzzle House Number Puzzle (suggestion: try this one to prepare for the next one.) Most beautiful (i.e., simple to explain - hard to solve) brain teaser I have ever encountered Interesting Step Function Puzzle Fly Around The World Words With Something in Common Building a Minimal Fence Bag of Red and Blue Balls Anchor in Row Boat in Swimming Pool The Hotter Cup of Coffee Interesting Places to Go CIS Department Photos History of Unix Table of Byte Sizes Bits and Bytes - [kilo/mega/giga/tera/peta ...] vs [kibi/mebi/gibi/tebi/pebi ...] And remember: \"There are three types of people in this world; those who can count, and those who cannot.\" [This quote was used to help introduce me at the 2009 UAlbany Alumni Awards banquet. David Gellman (Albany class of 1978) came up to me after the banquet and told me: \"There are 10 types of people in this world, those who understand binary, and those who don't.\"] There are only two things you need to know in life. First, don't tell people everything you know. There are two kinds of people in the world: those who can extrapolate from incomplete data, ... [told to me by my son Sam, 5/2016] There once was an old man from Esser, Whose knowledge grew lesser and lesser. It at last grew so small, He knew nothing at all, And now he's a college professor. [borrowed from Prof. Matt Bishop, UC Davis] Last Updated: 9/2016 by: Paul D. Amer",
  "content_length": 2959,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:39"
}