{
  "name": "Paul Marshall",
  "homepage": "https://research-information.bris.ac.uk/en/persons/paul-marshall",
  "status": "success",
  "content": "Paul Marshall - University of Bristol View Scopus Profile Dr Paul Marshall BSc (Hons), DPhil Associate Professor in Human Computer Interaction, School of Computer Science https://orcid.org/0000-0003-2950-8310 Emailp.marshallbristol.acuk BS8 1UB Personal profile Research Groups and ThemesBristol Interaction Group Fingerprint Dive into the research topics where Paul Marshall is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Human-Computer Interaction Computer Science 100% Self-Care Psychology 57% Artificial Intelligence Computer Science 55% Machine Learning Computer Science 55% Learning System Computer Science 53% Embodied Interaction Computer Science 51% Human Computer Interaction Computer Science 42% Collaborative Learning Psychology 38% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 84 Conference Contribution (Conference Proceeding) 16 Article (Academic Journal) 3 Chapter in a book 3 Review article (Academic Journal) 5 More 2 Conference Paper 1 Authored book 1 Editorial (Academic Journal) 1 Other contribution Research output per year Research output per year Bridging Context and Culture: Designing Cross-Cultural Solutions for Type 2 Diabetes Care in NigeriaArueyingho, T., O'Kane, A. A., Marshall, P., Aprioku, J. S., Webb, H. & Shivam, R., 7 Jul 2025, DIS 2025 - Proceedings of the 2025 ACM Designing Interactive Systems Conference. Association for Computing Machinery (ACM)Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Burnout by Design: How Digital Systems Overburden Neurodivergent Students in Higher EducationTcherdakoff, A., Marshall, P., Dowthwaite, A., Bird, J. & Cox, A. L., 22 Jun 2025, CHIWORK 2025 - Proceedings of the 4th Annual Symposium on Human-Computer Interaction for Work. Amsterdam: Association for Computing Machinery (ACM), p. 1-18 18 p. 17. (CHIWORK 2025 - Proceedings of the 4th Annual Symposium on Human-Computer Interaction for Work).Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Digital Systems 100% Semistructured Interview 50% 188 Downloads (Pure) Creatively Supporting Mental Wellbeing: A Tangible Toolkit to Scaffold Self-Tracking through Mindful ColouringYu, J., Ayobi, A., Marshall, P. & O'Kane, A. A., 4 Mar 2025, Proceedings of the Nineteenth International Conference on Tangible, Embedded, and Embodied Interaction. Association for Computing Machinery (ACM), 23Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Lived Experience 100% Diverse Background 100% Felt Experience 100% Mood 100% Mental Health 66% View all 111 research outputs Projects 2 Finished Projects per year COTADS: 8030 EPSRC via Southampton TAS_PP_00034 - COdesigning Trustworthy Autonomous Diabetes SystemsO'Kane, A. A. (Principal Investigator), Marshall, P. (Principal Investigator) & Ayobi, A. (Co-Principal Investigator)1/05/21 → 30/06/22Project: Research Machine Learning 100% Learning System 93% Participatory Design 87% Artificial Intelligence 49% Life Transition 43% ML4D: InnovateUK ML4D: Machine Learning for Enhanced Diabetes Self-CareO'Kane, A. A. (Principal Investigator), Marshall, P. (Co-Investigator), Santos-Rodriguez, R. (Co-Investigator) & Flach, P. A. (Co-Investigator)1/11/18 → 30/04/20Project: Research Self-Care 100% Echo State Network 80% Model-Based Reinforcement Learning 80% Diabetes 80% Artificial Intelligence 53% Prizes Collaborate to Innovate 2020, Healthcare & Medical WinnerO'Kane, A. A. (Recipient), Marshall, P. (Recipient), Ayobi, A. (Recipient), Stawarz, K. (Recipient), Flach, P. A. (Recipient), Santos-Rodriguez, R. (Recipient) & Yamagata, T. (Recipient), 4 Feb 2021Prize: Prizes, Medals, Awards and Grants Diabetes 100% CSCW 2021 Honorary MentionAyobi, A. (Recipient), Stawarz, K. (Recipient), Katz, D. (Recipient), Marshall, P. (Recipient), Yamagata, T. (Recipient), Santos-Rodriguez, R. (Recipient), Flach, P. A. (Recipient) & O'Kane, A. A. (Recipient), 14 Oct 2021Prize: Prizes, Medals, Awards and Grants File Diabetes 100%",
  "content_length": 4538,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:54"
}