{
  "name": "Paulo J. P. Ferreira",
  "homepage": "http://www.gsd.inesc-id.pt/~pjpf",
  "status": "success",
  "content": "pjpf Paulo Ferreira MsC Thesis 2020-2021 more details here Some interesting URLS: - Middleware 2018 - Special issue on The Future of Blockchains and its Applications - Special issue on Ubiquitous Systems and its Applications Currently also with UiO: more details here ----------------------------------------------- >>>Short Bio (PDF) Paulo Ferreira holds a PhD from the Université Pierre et Marie Curie (1996) in Computer Science. His MSc (1992) and BSc (1988) are both from Instituto Superior Técnico (University of Lisbon) in Electrotechnical Engineering. He holds the “agregação” since November 2009 from the same University. He is currently Associated Professor with “Agregação” in Instituto Superior Técnico at the Department of Computer Science and Engineering where he has been teaching courses within the scientific area of Architecture and Operating Systems, at both undergraduate and graduate levels, including Mobile Computing, Middleware for Distributed Internet Applications, Operating Systems, and Advanced Distributed Systems. He was Pro-Rector at the Technical University of Lisbon (UTL) between 2007 and 2010, being responsible for the analysis and evaluation of existing information and communication systems. In this activity, among other tasks, he has coordinated the VoIP project, improved the computer system of the academic services as well as the infrastructure of communications between the various schools of UTL. He is also member of the Directory Board of Óbidos Technological Park representing UTL. He was responsible for the Distributed Systems Group (“Grupo de Sistemas Distribuídos”, GSD) of INESC ID since January 1999 to 2010 (sharing this responsibility every two years since 2010 on a rotative basis). This group is currently composed of nine PhDs and several PhD and MSc students. In addition to the responsibility for scientific coordination of GSD, he has also been responsible for the Research Action Line at INESC ID called Computing Systems and Communication Networks in 2012-2013 and 2008-2009. He is senior member of INESC ID in the Distributed Systems Group, where he develops his research work in the scientific research area of ​​distributed systems, with emphasis on middleware, mobile computing and operating systems. He has published, as author or co-author, more than 100 articles in international journals and conferences, 1 scientific book, 11 book chapters, a pedagogical book (with 3 editions, being one in Brazil), serves on various program committees (e.g. Middleware, ICDCS, DAIS, etc.), served as an expert to the European Union for assessment of projects proposals under the 7th Framework Program, led more than 15 research projects, was one of the founders and board officer of EuroSys (ACM - European Chapter of the Special Interest Group on Operating Systems) being currently member of the Steering Committee; he is also a member of the Steering Committee of the ACM/IFIP/Usenix Middleware (2013-2014) and ACM/IFIP/Usenix Adaptive and Reflective Middleware (ARM). He is currently member of the editorial board of the Springer Journal of Internet Services and Applications. He is senior member of ACM and IEEE, was awarded two Best Paper Awards at international events (ACM/IFIP/Usenix Middleware Conference, level A in both CORE and RADIST rankings), 1 Recognition of Service Award from ACM, his PhD thesis was top ranked at the Université Pierre et Marie Curie, and in the academic years of 2010/2011 (2nd semester) and 2013/14 (1st semester) he was awarded the mention of “excellent teaching” at IST in the courses of Mobile Computing (MSc, 1st year) and Operating Systems (BSc, 2nd year), respectively. ----------------------------------------------- >>>Publications reverse chronological order at the INESC-ID database at DBLP at Google Scholar >>>Thesis Supervision PhD Thesis MSc thesis (post-Bologna) MSc thesis (pre-Bologna) Final Year Project (pre-Bologna) >>>Projects Coordination Coordination of scientific projects Coordination of consulting projects ----------------------------------------------- >>>Courses Taught Mobile and Ubiquitous Computing / Computação Móvel e Ubíqua (MEIC, MERC) Distributed Applications for the Internet / Plataformas para Aplicações Distribuídas na Internet (LEIC) Operating Systems / Sistemas Operativos (LEIC, LERCI) Ubiquitous Computing / Computação Ubíqua (MEIC) Advanced Distributed Systems / Sistemas Distribuídos Avançados (PDEIC) >>>Scientific Events and Organizations Program Chair CloudDP 2013 Program Chair ARM 2013 Program Chair ARM 2012 Steering Committee for Middleware (2013-2014) General Chair of Middleware 2011 Chair of the EuroSys Roger Needham PhD Award 2011 General chair of EuroSys 2007 Program committee member of Middleware conferences. ----------------------------------------------- >>>Some of confs/journals I have been involved with (PC member, reviewer, editorial member, etc.), among many others: ACM/IFIP/Usenix International Middleware Conferences (2017, 2016, ...) EuroSys 2017 Workshop on Clouds and Applications (in conjunction with the 35th Brazilian Symposium on Computer Networks and Distributed Systems - SBRC) IEEE International Conference on Fog and Mobile Edge Computing (FMEC 2017) IEEE International Conference on Pervasive Intelligence and Computing (PICCom-2017) International Conference on MOBILe Wireless MiddleWARE, Operating Systems, and Applications, (2016) member of the editorial member of JISA - Springer Journal of Internet Services and Applications reviewer for several international journals, such as: Journal of Computers & Electrical Engineering - Elsevier Journal on Transactions on Parallel and Distributed Systems - IEEE Journal of Information Sciences - Elsevier Transactions on Autonomous and Adaptive Systems - ACM Journal of Systems Architecture - Elsevier Simulation Modelling Practice and Theory - Elsevier Distributed and Parallel Databases - Springer Data & Knowledge Engineering (DKE) - Elsevier Computing Journal Oxford Journal of Systems and Software - Elsevier ----------------------------------------------- >>>Awards/Mentions IEEE senior member since February 2014. ACM senior member since June 2013. Best paper at ACM/IFIP/Usenix International Middleware Conference (Middleware 2012), Sep. 2012, Springer. Unifying Thread-Level Speculation and Transactional Memory. João Barreto, Aleksandar Dragojevic, Paulo Ferreira, Ricardo Filipe, Rachid Guerraoui. Springer, ACM/IFIP/Usenix Middleware 2012. Awarded the \"excelllence\" grade for teaching Mobile Computing (Computação Móvel) at degrees MEIC-T and METI at Tagus, 2nd semester, 2014/2015. Awarded the \"excelllence\" grade for teaching Operating Systems (Sistemas Operativos) at degrees LEIC-T and LETI at Tagus, 1st semester, 2013/2014. Awarded the \"excelllence\" grade for teaching Mobile Computing (Computação Móvel) at degrees MEIC-T and METI at Tagus, 2nd semester, 2010/2011. Mentor of the winning team of Microsoft ImagineCup Portugal, 2010 (projecto Ubilert) representing Portugal in the worlwide final in Poland. Best paper at ACM/IFIP/Usenix International Middleware Conference (Middleware 2007), Sep. 2007, Springer. Vector-Field Consistency for Ad-hoc Gaming. Nuno Santos, Luís Veiga, Paulo Ferreira. Springer, ACM/IFIP/Usenix Middleware 2007. ACM recognition award 2007. Nominations for Best paper award: Object-Swapping for Resource-Constrained Devices. Luís Veiga, Paulo Ferreira. 5th Int. Workshop on Mobile Distributed Computing (MDC'07), ICDCS Workshops 2007. Extending .NET Remoting with Distributed Garbage Collection. Paulo Pereira, Luís Veiga, Paulo Ferreira. 2nd International Conference on Innovative Views of .Net, 2006. ----------------------------------------------- >>>Contacts INESC-ID / IST Rua Alves Redol 9 - 6 Andar 1000-029 Lisboa Portugal Tel.: +351(21) 31 00 230 Fax.: +351 (21) 31 45 843 Email: paulo.ferreira@inesc-id.pt HangOut: pjpf07@gmail.com Skype: pjpf-inesc-id",
  "content_length": 7934,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:13"
}