{
  "name": "Paul Edward Rayson",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/paul-rayson",
  "status": "success",
  "content": "Paul Rayson - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Paul Rayson FHEA, MBCS Professor of Natural Language Processing Web Links Personal website: http://www.lancaster.ac.uk/staff/rayson/ Show more… Professional Role Director of UCREL Research Centre Research Overview I am a Professor in Computer Science at Lancaster University, UK and Director of the UCREL interdisciplinary research centre which carries out research in corpus linguistics and natural language processing (NLP). A long term focus of my work is semantic multilingual NLP in extreme circumstances where language is noisy e.g. in historical, learner, speech, email, txt and other CMC varieties. Along with domain experts, I have applied my research in the areas of dementia detection, mental health, online child protection, cyber security, learner dictionaries, and text mining of biomedical literature, historical corpora, and financial narratives. I was a co-investigator of the five-year ESRC Centre for Corpus Approaches to Social Science (CASS) which is designed to bring the corpus approach to bear on a range of social sciences. I'm also a member of the multidisciplinary Institute Security Lancaster, the Lancaster Centre for Digital Humanities, and the Data Science Institute. Career Details Academic Qualifications: 2003 PhD, Computer Science, Lancaster University. 1990 BSc (Hons) Computer Science and Mathematics, Lancaster University. Employment: 2020 – now Professor (School of Computing & Communications, Lancaster University) 2015 – 2020 Reader (School of Computing & Communications, Lancaster University) 2012 – 2015 Senior Lecturer (School of Computing & Communications, Lancaster University) 2012 – 2015 Director of International Teaching Partnerships (Faculty of Science and Technology, Lancaster University) 2009 – 2012 Lecturer (School of Computing & Communications, Lancaster University) 2008 – 2014 Director of Isis Forensics (now Relative Insight) Ltd., Infolab21, Lancaster University 2006 – 2007 Teaching Fellow (Computing Department, Lancaster University) 2006 – 2011 Director of The Research Engine Ltd., Infolab21, Lancaster University 2003 – now Director of UCREL Research Centre (Computing & Linguistics Depts, Lancaster University) 1997 – 2009 Research Fellow (Computing Department, Lancaster University) 1990 – 1997 Research associate/assistant (Computing Department, Lancaster University) PhD Supervision Interests I am interested in supervising PhD students in the following areas: contextual disambiguation methods for automatic semantic annotation and WSD, multilingual semantic tagging, applications of NLP to real-world problems. Show less Publications Projects Activities PhD Students Research Groups Selected Publications Show all 335 publications Towards Interactive Multidimensional Visualisations for Corpus LinguisticsRayson, P.E., Mariani, J.A., Anderson-Cooper, B., Baron, A., Gullick, D.S., Moore, A., Wattam, S. 2017 In: Journal for Language Technology and Computational Linguistics. 31, 1, p. 27-49. 23 p.Journal article Creating and validating multilingual semantic representations for six languages: expert versus non-expert crowdsEl-Haj, M., Rayson, P., Piao, S., Wattam, S. 3/04/2017Conference contribution/Paper Lancaster A at SemEval-2017 Task 5: Evaluation metrics matter: predicting sentiment from financial news headlinesMoore, A., Rayson, P.E. 4/08/2017Conference contribution/Paper A time-sensitive historical thesaurus-based semantic tagger for deep semantic annotationPiao, S.S., Dallachy, F., Baron, A., Demmen, J.E., Wattam, S., Durkin, P., McCracken, J., Rayson, P.E., Alexander, M. 11/2017 In: Computer Speech and Language. 46, p. 113-135. 23 p.Journal article Word frequencies in written and spoken English: based on the British National Corpus.Leech, G., Rayson, P., Wilson, A. 2001 London : Longman. 304 p. ISBN: 0582320070.Book From key words to key semantic domainsRayson, P. 2008 In: International Journal of Corpus Linguistics. 13, 4, p. 519-549. 31 p.Journal article Experiments in 17th century English:: manual and automatic conceptual historyPumfrey, S., Rayson, P., Mariani, J. 2010Conference paper Classification of Short Text Comments by Sentiment and Actionability for VoiceYourViewSimm, W., Ferrario, M., Piao, S., Whittle, J., Rayson, P. 2010Conference contribution/Paper Differentiating act from ideology: evidence from messages for and against violent extremismPrentice, S., Taylor, P., Rayson, P., Giebels, E. 08/2012 In: Negotiation and Conflict Management Research. 5, 3, p. 289-306. 18 p.Journal article Safeguarding cyborg childhoods: incorporating the on/offline behaviour of children into everyday social work practicesMay-Chahal, C., Mason, C., Rashid, A., Walkerdine, J., Rayson, P., Greenwood, P. 2014 In: British Journal of Social Work. 44, 3, p. 596-614. 19 p.Journal article Automatic standardisation of texts containing spelling variation: How much training data do you need?Baron, A., Rayson, P. 2009Conference contribution/Paper All Publications Show only selected publications DSI: (NICE) Northern Intensive Computing Environment 01/08/2024 → 30/07/2025 Research DSI: A Small Welsh Language Model Pilot for Sentiment Analysis Testing 01/07/2024 → 28/02/2025 Research DSI: Welsh Digital Grid 01/07/2023 → 29/03/2024 Research DSI: Horizon Europe: 4D PICTURE: Design-based Data-Driven Decision-support Tools: Producing Improved Cancer Outcomes Through User- Centred Research 01/10/2022 → 30/09/2027 Research Understanding imprecise space and time in narratives through qualitative representations, reasoning, and visualisation 01/04/2022 → 30/09/2026 Research DSI: FreeTxt: supporting bilingual free-text survey and questionnaire data analysis 01/03/2022 → 31/10/2023 Research DSI: Realist evaluation of online mental health communities to improve policy and practice 01/03/2022 → 30/06/2025 Research The Igbo-English Machine Translation Project 03/02/2020 → 29/01/2021 Research BioTM Project 01/05/2018 → 31/03/2019 Research Analysing Narrative Aspects of UK Preliminary Earnings Announcements and Annual Reports: Tools and Insights for Researchers and Regulators 01/12/2017 → 31/07/2020 Research Encyclopaedia of Shakespeare's Language 01/05/2016 → 31/10/2019 Research The National Corpus of Contemporary Welsh 01/03/2016 → 31/08/2019 Research Native Language Influence Detection 6 Project 23/11/2015 → 31/10/2018 Research Geospatial Innovations in the Digital Humanities: A Deep Map of the English Lake District 19/10/2015 → 19/10/2018 Other SenseSourcing 01/12/2014 → 01/07/2015 Other Understanding Corporate Communications 01/12/2014 → 01/10/2016 Other VardSourcing 01/12/2014 → 01/07/2015 Other Semantic Annotation and Mark Up for Enhancing Lexical Searches (SAMUELS) 01/01/2014 → 31/03/2015 Research Software Architecture for Mental health Self management 01/04/2013 → 30/09/2016 Research ESRC centre for Corpus Approaches to Social Science - CASS 31/03/2013 → 30/03/2018 Research Understanding the Influences of Financial Reporting, Corporate Disclosure and financial media on the Corporate Financial Information Environment 01/12/2012 → 30/11/2014 Research Metaphor in End of Life Care 01/09/2012 → 28/06/2014 Research FP7: Spatial Humanities 01/01/2012 → 31/12/2016 Research Corpus Research in Early Modern English 01/10/2011 → … Research FP7: iCOP 01/06/2011 → 30/11/2013 Research FP7: CLARIN 01/01/2008 → 30/06/2011 Research Using a semantic annotation tool for research on metaphor in discourse 01/12/2005 → … Research Changing English across the 20th Century: A Corpus-based Study 01/08/2005 → 31/07/2007 Other ASSIST: Automated Semantic Assistance for Translators 01/04/2005 → 30/06/2007 Other Eighth International Workshop on Narrative Extraction from Textsheld in conjunction with the 47th European Conference on Information Retrieval (Event) Publication peer-review HealTAC 2025: 8th Healthcare Text Analytics Conference (Event) Publication peer-review LDK 2025 – 5th Conference on Language, Data and Knowledge (Event) Publication peer-review The 7th Healthcare Text Analytics Conference Participation in conference -Mixed Audience The 31st International Conference on Computational Linguistics (Event) Publication peer-review The First International Conference on Natural Language Processing and Artificial Intelligence for Cyber Security (Event) Publication peer-review Semantic Annotation Invited talk Integrating health research, natural language processing, and corpus linguistics to analyse peer online support forum posts on personal recovery in bipolar disorder Oral presentation EACL Student Research Workshop (Event) Publication peer-review Corpus Linguistics (Event) Publication peer-review Sixth International Workshop on Narrative Extraction from Texts held in conjunction with the 45th European Conference on Information Retrieval (Event) Publication peer-review Healthcare text analytics conference 2023 (Event) Publication peer-review Language, Data and Knowledge (Event) Publication peer-review What can you do with the CLARIN research infrastructure? Participation in workshop, seminar, course Spatial Humanities: Finding spatial and time narratives in corpus data Participation in workshop, seminar, course The 2023 Conference on Empirical Methods in Natural Language Processing (Event) Publication peer-review The 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (Event) Publication peer-review Methods and applications for multilingual semantic analysis Invited talk Methods and resources for multilingual semantic taggers Invited talk Corpus Framework Analysis: Integrating computational linguistics, corpus linguistics, and clinical psychology to analyse online posts on",
  "content_length": 14882,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:45"
}