{
  "name": "Paul Molitor",
  "homepage": "https://www.informatik.uni-halle.de/ti/mitarbeiter/molitor/index.de.php",
  "status": "success",
  "content": "Prof. Dr. Paul Molitor Aktuelle Sprache: Deutsch switch to english version Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zu weiteren Einstellungen Themennavigation Studium Forschung Weiterbildung Karriere Presse International Hauptnavigation Die Universität Fakultäten Naturwissenschaftliche Fakultät III - Agrar- und Ernährungswissenschaften, Geowissenschaften und Informatik Institut für Informatik Arbeitsgruppen am Institut Computer Engineering Mitarbeiter:innen der AG Computer Engineering Prof. Dr. Paul Molitor Publikationen International Office Zentrale Einrichtungen Graduierten-Akademie Wissenschaftliche Zentren An-Institute Universitätsklinikum Weiteres Sprache: English Schrift: größer , kleiner Login für Redakteure Prof. Dr. Paul Molitor Kontakt Prof. Dr. Paul Molitor Raum 217 Institut für Informatik Von-Seckendorff-Platz 1 06120 Halle (Saale) Telefon: +49 (345) 5524710 Telefax: +49 (345) 5527009 paul.molitor@informatik.uni-halle.de Postanschrift: Prof. Dr. Paul Molitor Institut für Informatik Martin-Luther-Universität Halle-Wittenberg 06099 Halle (Saale) Publikationen (peer-reviewed) [80] J. Dähne, A, J. Ritter, and P. Molitor. Improving text collations by local text resegmentation. In: Digital Scholarship in the Humanities, Volume 40, Issue 2, June 2025, pp. 477-486. Oxford University Press 2025. DOI: 10.1093/llc/fqaf033 [79] S. Balck, J. Dähne, F. Etling, F. Fischer, S. Frenzel, B. Grote, S. Hesse, Sascha, P. Molitor, M. Pöckelmann, J. Ritter, Y. Singh, and M. Stede. Collation of Multilingual Versions of a Text: Necessity, Approach, Challenges. Long Paper at the Digital Humanities 2025 (DH2025), July 14-18, 2025, Lisboa, Portugal. [78] M. Pöckelmann, A. Medek, J. Ritter, and P. Molitor. LERA - An interactive platform for synoptical representations of multiple text witnesses. in: Digital Scholarship in the Humanities, Volume 38, Issue 1, pp. 330-346. Oxford University Press 2023. Published online June 30 2022: DOI: 10.1093/llc/fqac021 [77] T. K. H. Luu, M. Pöckelmann, J. Ritter, and P. Molitor. Applying LERA for collating witnesses of The Tale of Kiêu, a Vietnamese poem written in Nôm script. Digital Humanities 2022 (DH2022), 25-29 July 2022, Tokyo, Japan. [076] J. Dähne, M. Pöckelmann, J. Ritter, and P. Molitor. Putting collation of text witnesses on a formal basis. In: Digital Scholarship in the Humanities, 37(2):375-390. Oxford University Press 2022. Published online October 14 2021. DOI: 10.1093/llc/fqab058 [075] M. Pöckelmann, J. Dähne, J. Ritter, and P. Molitor. Fast paraphrase extraction in Ancient Greek literature. In: Special Issue \"Digital Tools form Intertexuality Studies\", it - Information Technology, 62(2):75-89, de Gruyter 2020. DOI: 10.1515/itit-2019-0042 [074] P. Molitor, G. Necker, M. Pöckelmann, B. Rebiger und J. Ritter. Keter Shem Ṭov ‒ Prozessualisierung eines Editionsprojekts mit 100 Textzeugen. Poster auf der 7. Jahrestagung des Verbandes Digital Humanities im deutschsprachigen Raum (DHd 2020), Paderborn, March 2-6, 2020. [073] M. Pfuhl, J. Ritter, and P. Molitor. Finding the redundant gates in reversible circuits. In: Proceedings of the 10th Conference on Reversible Computation (RC 2018), LNCS 11106, pp. 205-219, Leicester, UK, September 13-14, 2018. DOI: 10.1007/978-3-319-99498-7_14 [mehr...] Drittmittelprojekte (DFG, BMBF, VolkswagenStiftung) Semi-automatic collation of versions of a text written in different languages    (DFG, 2024-2026) ♦ Excerpts. On the Digital Study and Edition of a Unique Text-Image Constellation – Based on the example of Johann Joachim Winckelmann (BMBF, 2021-2024) ♦ Synoptic edition of the Kabbalistic tractate Keter Shem Tov    (DFG, 2019-2025) ♦ Digital Plato: Tradition and Reception    (VolkswagenStiftung, 2016-2019) ♦ A New Supplement Dictionary of Sanskrit (DFG, 2013-2016) ♦ Vernetzte Korrespondenzen | Exilnetz33    (BMBF, 2013-2016) ♦ Semi-automatische Differenzanalyse von komplexen Textvarianten (BMBF, 2012-2015) ♦ Tolerance-based methods for solving the traveling salesman problem (DFG, 2005-2009) ♦ Universitärer Lehrverbund Informatik (BMBF, 2001-2003) ♦ Formal verification of hierarchically specified circuits (DFG, 1997-2002) ♦ Solving routing problems in VLSI systems by genetic algorithms (DFG, 1998-2001) ♦ Logic synthesis of random logic circuits (DFG, 1995-1997) ♦ Automatische Synthese und Optimierung kleiner Schaltungen (DFG, 1990-1994) Beruflicher Werdegang 1978: Abitur am Lycée de Garçons de Luxembourg    ♦ 1978-1982:Studium der Informatik mit Nebenfach Mathematik an der Universität Saarbrücken    ♦ 1986: Promotion in Informatik bei Prof. Dr. Dr. h.c. mult. Günter Hotz    ♦ 1992: Habilitation und Lehrbefugnis in Informatik ♦ 1982-1994: Wissenschaftlicher Mitarbeiter (1982-1991) und Projektleiter (1991-1994) in dem an die Universität des Saarlandes    und die Universität Kaiserslautern angegliederten Sonderforschungsbereich 124 VLSI-Entwurfsmethoden und Parallelität ♦ 1993: Universitätsprofessor für Schaltungstechnik an die Humboldt-Universität zu Berlin    ♦ Seit 1994:  Lehrstuhl für Technische Informatik an der Martin-Luther-Universität Halle-Wittenberg. Repertoire an Vorlesungen Automaten und Berechenbarkeit ♦ Datenstrukturen und Effiziente Algorithmen ♦ Einführung in Betriebssysteme ♦ Einführung in die Informatik für Hörer aller Fakultäten ♦ Einführung in die Rechnerarchitektur ♦ Einführung in die Technische Informatik ♦ Die Hardwarebeschreibungssprache VHDL ♦ Informatik und Gesellschaft ♦ Synthese kombinatorischer Schaltungen ♦ Test und Formale Verifikation integrierter Schaltungen Weitere berufliche Aktivitäten Innerhalb der Martin-Luther-Universität: 1994-1998, 2000-2003 und 2010-2025: Geschäftsführender Direktor des Instituts für Informatik ♦ 2000-2006: Gründungsdirektor des Universitätszentrums Informatik ♦ 2003-2010: Gewähltes Mitglied des Akademischen Senates ♦ 2003-2014: Vorsitzender der Rektoratskommission \"Rechentechnikgroßgeräte-Investitionen\" ♦ 2016-2022: Vorsitzender des IT-Lenkungskreises und Mitglied der Senatskommission Struktur und Haushalt ♦ 2022-2026: Mitglied der Senatskommission Haushalt und der Rektoratskommission IT und Digitale Transformation Kommissionen des Landes Sachsen-Anhalt: 1995-2014: Sprecher der Landes-Hochschul-DV-Kommission ♦ 2015-2023: Mitglied der neu gegründeten IT-Kommission der Hochschulen   , von 2015-2016 Vorsitzender Überregionale Aktivitäten: 2005-2019: Mitglied des Auswahlkomitees des Dissertationspreises    der Gesellschaft für Informatik e.V.    ♦ 2009-2017: Mitglied des Auswahlkomitees des FIT-Programms \"Forschung an internationalen Wissenschafts- und Technologiezentren\" (bis 2012) und (ab 2013) des Nachfolgeprogramms \"Internationale Forschungsaufenthalte in der Informationstechnologie\" des DAAD    ♦ 2009-2017: Mitglied der Studienkommission des Fakultätentages Informatik    ♦ 2003-2017, 2021-2023 Hauptherausgeber der it - Information  Technology   , der ältesten deutschen wissenschaftlichen Zeitschrift zur Informationstechnologie Links ORCID    ♦ Google Scholar    ♦ DBLP    ♦ Researchgate    ♦ wikipedia.lu Zum Seitenanfang Fußnavigation Startseite, Datenschutz, Disclaimer, Impressum, Letzte Aktualisierung: 02.06.2025 Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zum Seitenanfang",
  "content_length": 7363,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:55"
}