{
  "name": "Paulo Urbano",
  "homepage": "https://ciencias.ulisboa.pt/perfil/pjurbano",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo PAULO URBANO Contactos Departamento de Informática Email pjurbano@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Auxiliar Indicadores ResearcherID Orcid Google Scholar Palavras Chave Procura da Novidade, Inteligência Enxame, Robótica Enxame, Art Computacional, Arte Generativa, Arte Enxame, Simulação Multi-agente Keywords novelty search, swarm intelligence, swarm robotics, swarm art, multi-agent simulation Currículo Resumido Doutoramento em Informática, Universidade de Lisboa (2004). Mestrado em Engenharia Informática, Universidade Nova de Lisboa (1994). Licenciatura em Informática, Universidade de Coimbra (1989).Actualmente membro da unidade de investigação BioISI (BioSystems & Integrative Sciences Institute) fazendo parte do grupo MAS (Agents anos Systems Modelling). Interesses Científicos Arte Artificial Baseada em Insectos SociaisA Pesquisa Divergente a Pesquisa da NovidadeProgramação Genética e Computação Evolutiva Robótica Enxame EvolucionáriaOntologias na Arquitectura e Urbanismo Scientific Interests Swarm Artificial ArtNovelty Search and Divergent SearchGenetic Programming andEvolutionary ComputationSwarm Evolutionary RoboticsOntologies in Architecture and Urbanism Publicações selecionadas Evolution of swarm robotics systems with novelty search J Gomes, P Urbano, AL Christensen Swarm Intelligence 7 (2-3), 115-144 Wildlife–vehicle collision mitigation: Is partial fencing the answer? An agent-based model approach F Ascensão, A Clevenger, M Santos-Reis, P Urbano, N Jackson Ecological Modelling 257, 36-43 Urbano, P. (2005) Playing in the Pheromone Playground, in Proc. of the EvoMUSART 2005, 3rd European Workshop on Evolutionary Music and Art, Lausanne, Switzerland, March-2005, Springer-Verlag. odNEAT: An algorithm for distributed online, onboard evolution of robot behaviours F Silva, P Urbano, S Oliveira, AL Christensen Artificial Life 13, 251-258 Urbano, P. (2006). Consensual Painters. Proceedings EvoMusart’06, 4th European Workshop on Evolutionary Music and Art, Budapest, March-2006. Springer Verlag. Ver todas as Publicações",
  "content_length": 2264,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:23"
}