{
  "name": "Paul A. Farrell",
  "homepage": "https://www.kent.edu/cs/profile/paul-farrell",
  "status": "success",
  "content": "Paul A. Farrell Profile | Computer Science, Center for Materials Informatics Skip to main content Live Chat Paul A. Farrell Professor Emeritus Campus: Kent Contact Information Email: pfarrell@kent.edu Personal Website: http://www.cs.kent.edu/~farrell/ Biography Paul Farrell is an Emeriti Faculty member of Computer Science, Kent State University.  Paul received his M.Sc.  and Ph.D.  in the field of Numerical Computation and Analysis from Trinity College, Dublin, Ireland in 1978 and 1983 respectively.  He was a Lecturer at the Dublin Institute of Technology (1983-1985) before joining Kent State University as an assistant professor of Computer Science in 1985.  While at the Dublin Institute of Technology, he was supported by the European Community, under a industry/university co-operation grant on semi-conductor device simulation.  In 1986, he was a guest of the Soviet Academy of Sciences for a two week visit. In addition he is an associate member of the Institute for Computational Mathematics and a member of the IMACS Technical Committee on Partial Differential Equations. He is currently Chair of Faculty Senate, and has served as Vice-Chair of Faculty Senate, Chair of the University Council on Technology, Assistant Chair of the Computer Science Department, Systems Coordinator for the Computer Science Department, Applications Coordinator for Internet II for Kent State and Director of Electronic Publications for Institute for Numerical Computation and Analysis (INCA), in addition to membership of University and Department Committees. He has acted as a consultant to the United Nations Development Program and to the Irish Higher Education Development Cooperation Organization (HEDCO). His research interests include  parallel and distributed computation, cluster computing, computational steering, scientific visualization, high speed networking, numerical computation and algorithms, application of numerical methods to singularly perturbed differential equations, semi-conductor devices, Navier-Stokes equations, and liquid crystal problems, scientific visualization, automatic code generation for parallel architectures, application of expert systems in numerical computing, and mathematical text processing.  He is a member of ACM, the IEEE Computer Society, SIAM, and the Institute for Numerical Computation and Analysis (INCA). He has published a research monograph and in excess of 65 papers. He  has been Principal Investigator or co-Principal Investigator on 7 NSF grants, as well as grants from the Ohio Board of Regents and the Ohio Department of Development. More information on his research and class materials are available on his personal web page and the web page of his research group DiSCoV - the Distributed Scientific Computation and Visualization group. Education M.Sc. in Numerical Computation and Analysis, Trinity College, 1978 Ph.D. in Numerical Computation and Analysis, Trinity College, 1983 Expertise Parallel and Distributed Computation Cluster Computing Computational Steering Scientific Visualization High Speed Networking Numerical Computation and Algorithms Singularly Perturbed DIfferential Equations Semi-Conductor Devices Navier-Stokes Equations Parallel Architectures Affiliations Association for Computing Machinery Computer Science Street Address241 Mathematical Sciences Building, Kent, OH 44242-0001 Mailing Address800 E. Summit St.Kent, OH 44242 Contact Us330-672-9980 office@cs.kent.edu Contact Us 330-672-3000 info@kent.edu Facebook LinkedIn Instagram QUICK LINKS Faculty Office Hours Undergraduate CS Tutoring facebook instagram youtube linkedin TikTok X snapchat ... Information Accessibility Annual Security Reports Campus Concerns Reporting For Our Alumni For the Media Jobs & Employment Privacy Statement HEERF CARES/CRRSAA/ARP Act Reporting and Disclosure Website Feedback",
  "content_length": 3844,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:38"
}