{
  "name": "Paul Blain Levy",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/levy-paul.aspx",
  "status": "success",
  "content": "Dr Paul Levy - School of Computer Science - University of Birmingham Dr Paul Levy School of Computer ScienceReader in Theoretical Computer Science Contact details Telephone+44 (0) 121 414 44792Emailp.b.levy@cs.bham.ac.uk View my research portal AddressThe School of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Paul Levy is a Reader in Theoretical Computer Science and is a member of the Theory of Computation group at the University of Birmingham. Please follow the link below to find out more about Paul's work: Dr Paul Levy- personal webpage Denotational semantics, call-by-push-value, computational effects, nondeterminism, game semantics. Recent publications Article Levy, P 2025, 'Broad Infinity and Generation Principles', Notre Dame Journal of Formal Logic, vol. 66, no. 1, pp. 79-141. https://doi.org/10.1215/00294527-2024-0029 Levy, P 2022, 'The price of mathematical scepticism', Philosophia Mathematica, vol. 30, no. 3, nkac011, pp. 283-305. https://doi.org/10.1093/philmat/nkac011 Rot, J, Jacobs, B & Levy, P 2021, 'Steps and traces', Journal of Logic and Computation, vol. 31, no. 6, pp. 1482–1525. https://doi.org/10.1093/logcom/exab050 Levy, PB 2019, 'Strong functors on many-sorted sets', Commentationes Mathematicae Universitatis Carolinae, vol. 60, no. 4, pp. 533-540. https://doi.org/10.14712/1213-7243.2019.029 Levy, P 2018, 'A Ghost at ω1', Logical Methods in Computer Science, vol. 14, no. 3, 4714. https://doi.org/10.23638/LMCS-14(3:4)2018 Conference contribution Bowler, N, Goncharov, S & Levy, P 2025, Probabilistic Strategies: Definability and the Tensor Completeness Problem. in 2025 40th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS). Proceedings - Symposium on Logic in Computer Science, IEEE, pp. 485-498, 40th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2025, Singapore, Singapore, 23/06/25. https://doi.org/10.1109/LICS65433.2025.00043 Levy, PB & Goncharov, S 2019, Coinductive resumption monads: guarded iterative and guarded Elgot. in M Roggenbach & A Sokolova (eds), 8th Conference on Algebra and Coalgebra in Computer Science (CALCO 2019). vol. 139, Leibniz International Proceedings in Informatics (LIPIcs), Schloss Dagstuhl, pp. 13:1--13:17, 8th Conference on Algebra and Coalgebra in Computer Science (CALCO 2019), London, United Kingdom, 3/06/19. https://doi.org/10.4230/LIPIcs.CALCO.2019.13 Devesas Campos, M & Levy, PB 2018, A Syntactic View of Computational Adequacy. in C Baier & U Dal Lago (eds), Foundations of Software Science and Computation Structures (FOSSACS 2018): 21st International Conference, FOSSACS 2018 Held as Part of the European Joint Conferences on Theory and Practice of Software, ETAPS 2018 Thessaloniki, Greece, April 14–20, 2018 Proceedings. vol. 10803, Lecture Notes in Computer Science - Advanced Research in Computing and Software Science , vol. 10803, Springer, pp. 71-87, 21st International Conference on Foundations of Software Science and Computation Structures (FoSSaCS 2018), Thessaloniki, Greece, 14/04/18. https://doi.org/10.1007/978-3-319-89366-2_4 Bowler, N, Levy, PB & Plotkin, G 2018, Initial algebras and final coalgebras consisting of nondeterministic finite trace strategies. in S Staton (ed.), Proceedings of the 34th Conference on the Mathematical Foundations of Programming Semantics (MFPS XXXIV). Electronic Notes in Theoretical Computer Science, vol. 341, pp. 23-44, 34th Conference on the Mathematical Foundations of Programming Semantics (MFPS 2018), Halifax, Canada, 6/06/18. https://doi.org/10.1016/j.entcs.2018.11.003 Jacobs, B, Levy, P & Rot, J 2018, Steps and Traces. in C Cirstea (ed.), Coalgebraic Methods in Computer Science: 14th IFIP WG 1.3 International Workshop, CMCS 2018, Colocated with ETAPS 2018, Thessaloniki, Greece, April 14–15, 2018, Revised Selected Papers. 1 edn, Lecture Notes in Computer Science , vol. 11202, Springer, pp. 122-143, 14th IFIP WG 1.3 International Workshop on Coalgebraic Methods in Computer Science (CMCS 2018), Thessaloniki, Greece, 14/04/18. https://doi.org/10.1007/978-3-030-00389-0_8 Kammar, O, Levy, PB, Moss, SK & Staton, S 2017, A monad for full ground reference cells. in Proceedings of 32nd Annual ACM/IEEE Symposium on Logic in Computer Science (LICS2017). IEEE Computer Society Press, 32nd Annual ACM/IEEE Symposium on Logic in Computer Science (LICS 2017), Reykjavik, Iceland, 20/06/17. https://doi.org/10.1109/LICS.2017.8005109 Levy, PB 2017, Contextual isomorphisms. in G Castagna & AD Gordon (eds), POPL 2017: Proceedings of the 44th ACM SIGPLAN Symposium on Principles of Programming Languages . Association for Computing Machinery , pp. 400-414, the 44th ACM SIGPLAN Symposium, Paris, France, 15/01/17. https://doi.org/10.1145/3009837.3009898 Dal Lago, U, Gavazzo, F & Levy, PB 2017, Effectful applicative bisimilarity: monads, relators, and the Howe's method. in 2017 32nd Annual ACM/IEEE Symposium on Logic in Computer Science (LICS). IEEE Computer Society Press, pp. 1-12, 32nd Annual ACM/IEEE Symposium on Logic in Computer Science (LICS 2017), Reykjavik, Iceland, 20/06/17. https://doi.org/10.1109/LICS.2017.8005117 Geron, B & Levy, P 2016, Iteration and labelled iteration. in Proceedings of Mathematical Foundations of Programming Semantics XXXII, (MFPS 2016). Electronic Notes in Theoretical Computer Science , vol. 325, Elsevier, pp. 127-146, 32nd Conference on the Mathematical Foundations of Programming Semantics(MFPS XXXII), 23/05/16. https://doi.org/10.1016/j.entcs.2016.09.035 Review article Levy, P 2022, 'SIGLOG Semantics Column: Call-by-push-value', ACM SIGLOG News, vol. 9, no. 2, pp. 7. <https://siglog.org/download/32th-newsletter-april-2022/> View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 5840,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:41"
}