{
  "name": "Paul A. Rosen 0001",
  "homepage": "http://www.cspaul.com/wordpress",
  "status": "success",
  "content": "Paul Rosen – Associate Professor, University of Utah Skip to content Paul Rosen, Ph.D., MBA Associate Professor Scientific Computing and Imaging Institute Kahlert School of Computing University of Utah 72 S. Central Campus Dr., RM 3750 Salt Lake City, UT 84112 Office: WEB 4887 E-Mail: paul DOT rosen AT utah DOT edu I’m an Associate Professor at the University of Utah in the Scientific Computing and Imaging Institute and Kahlert School of Computing. I received my Ph.D. from the Computer Science Department of Purdue University in 2010. While at Purdue, I was also a key participant of the team which modeled, simulated, and visualized the September 11, 2001 attack on the World Trade Center North Tower. After Purdue, I served as a Research Assistant Professor in the Scientific Computing and Imaging (SCI) Institute and the School of Computing at the University of Utah until 2015. From 2015 to 2022, I was an Assistant and then Associate Professor at University of South Florida in the Department of Computer Science and Engineering. My broad research interests include geometry- and topology-based approaches for solving problems in scientific and information visualization. Along with my collaborators, I have received awards for best paper at PacificVis 2016, IVAPP 2016, PacificVis 2014, and SIBGRAPI 2013 and honorable mentions at the IEEE VIS Full Papers 2023, VAST Challenge 2017, and CG&A 2011 best paper of the year. I received a National Science Foundation CAREER Award in 2019. Recent Papers Buckaroo: A Direct Manipulation Visual Data Wrangler Gasp: A Gradient-Aware Shortest Path Algorithm For Boundary-Confined Visualization Of 2-Manifold Reeb Graphs A Survey On Annotations In Data Visualization: Empirical Insights And Applications Annogram: An Annotative Grammar Of Graphics Extension SearchSearch",
  "content_length": 1820,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:41"
}