{
  "name": "Paul Patras",
  "homepage": "http://homepages.inf.ed.ac.uk/ppatras",
  "status": "success",
  "content": "Paul Patras Paul PatrasThe University of Edinburgh Information About Me I am a Professor of Mobile Intelligence in the School of Informatics at the University of Edinburgh. I am also a Co-founder and the CEO of Net AI, a university spin-out whose mission is to revolutionise network management via AI-driven analytics. I lead the Mobile Intelligence Lab, I am a member of the Institute for Computing Systems Architecture (ICSA) and I am also affiliated to the Security & Privacy group. Before joining Edinburgh, I was a research fellow at the Hamilton Institute of the National University of Ireland, Maynooth. I held visiting research positions at the University of Brescia (2017, 2015), Northeastern University (2016), Technical University Darmstadt (2016), and Rice University (2010). I hold Ph.D. and M.Sc. degrees in Telematics Engineering from University Carlos III of Madrid, and I am the first alumnus of IMDEA Networks (Madrid Institute for Advanced Studies in Networks). I obtained a Dipl.Eng. degree from the Technical University of Cluj-Napoca, Romania. My research seeks to bridge the gap between fundamental mathematical models and real-world applications of networked systems. I focus on problems related to artificial intelligence for network traffic analytics, performance optimisation, security and privacy, and explainability. I also work on high-speed data stream processing and have a growing interest in AI for biomedical innovation. CONTACT Latest News Ph.D. in Machine Learning Systems: The EPSRC-funded Centre for Doctoral Training in Machine Learning Systems will be accepting applications for four-year Ph.D. scholarships. If you are motivated to solve hard problems in this space, please get in touch with me first. Ph.D. in AI for Biomedical Innovation: The EPSRC-funded Centre for Doctoral Training in AI for Biomedical Innovation will be accepting applications for four-year Ph.D. scholarships. If you are interested in developing lightweight deep learning models for monitoring neurodegenerative disease progression and you think you have the right skills, please get in touch with me first. 21 October, 2025 – Interview about network intelligence, Net AI's spin-out journey, the UK entrepreneurial landscape and more with The Entrepreneurs Network think tank. 14 October, 2025 – Panel on \"Engaging with National Experimentation Facilities - JOINER and Sonic Labs\" at Bristol Innovations. 9 September, 2025 – Invited talk T-Labs' Berlin Open-RAN Working Week. 13 August, 2025 – Panel on \"Hybrid AI and the Edge-Cloud Continuum\" at the IEEE International Conference on High Performance Computing and Communications. 1 July, 2025 – Spoke with Monica Paolini on her Sparring Partners podcast about \"Data sharing to optimize AI performance\". 9 June, 2025 – Shortlisted for the 2025 Allica Bank Great British Entrepreneur Awards in the AI Entrepreneur of the Year in Scotland category. 5 June, 2025 – Invited talk at the Bayes Innovation Fellows Day. 16 May, 2025 – Invited talk at the 5G & Digital Industry Observatory of Politecnico di Milano. 30 April, 2025 – Keynote talk at Digital Catapult's Open Future Networks Showcase. 5 February, 2025 – Guest speaker at the IEEE SPS 1st Winter School on AI for 6G Communications. Coverage in the Media Android OS Privacy Research with Doug Leith (Trinity College Dublin) and my student Haoyu Liu on the privacy of different Android distributions was featured in EuroNews, Hacker News, The Register, Yahoo News, Fox News, Voice of America, Help Net Security, The Irish Times, Belfast Telegraph, Irish Examiner, IT World Canada, Asia Financial, DIGIT, Science X, Techdirt, RT, Newsmax, Texplore, India Education Daily, Hypertext, 91mobiles, BGR, Techstory, Heise (DE), Tarnkappe.info (DE), Clubic (FR), ICTjournal (FR), OK Diario (ES), Gigazine (JP), CityPortal (GR), Fastweb (IT), IlCitadinoOnline (IT), TuttoAndroid (IT), Tiroler Tageszeitung (AT), Evenimentul Zilei (RO), GRYOnline (PL), Kallxo (XK), Diario Libre (RD), Droidsans (Th). Monitoring Covid-19 Incidence via Open Surveys Work with the CoronaSurveys team on monitoring and forecasting the incidence of Covid-19 using open surveys was featured in Business Wire, Bloomberg, BioSpace, Science X, Datanami, La Razon, Republica, Tele Madrid, Madri+d, Cope, Ambientum, Catalunya Vanguardista, Leganes Activo, Globo Rural, Publico Surgiu, RedibInforma, and Liverpool Noise. Deep learning in mobile networks Our survey of deep learning in mobile and wireless networks has been picked up by Chinese media and was covered in The Heart of the Machine, Tencent, NetEase, SINA, and Sohu.com. Smart-home security Our security and privacy investigation of the Belkin WeMo ecosystem featured in The National, The Herald, Phys.org, Technology.org, ECN Mag, tekk.tv, qianjia.com, The Edinburgh Reporter, Edinburgh Live, Scottish Construction Now, Scottish Housing News. Forth Radio also ran a short interview with me about this work. Wearable IoT security Our research on the vulnerabilities of fitness trackers featured in The Times, The Telegraph, International Business Times, Huffington Post, New York Post, The Scotsman, STV News, Yorkshire Post, The Northern Echo, Channel News, Market Watch, SC Magazine, The Inquirer, CORDIS News, Homeland Security News Wire, China Press, Xinhua News, China Industrial Control Network, Shenzhen News Network, Photoelectric News Network, Hong Kong News, Indo-Asian News Service, The Economic Times, The Hindu, Businessworld India, The New Indian Express, The Pioneer, domain-b.com, HackRead, Techworm, V3, texnologia.net, Gears of Biz, Infosecurity Magazine, Third Age, Phys.org, ECN Mag, Digtial Journal, Gadgets & Wearables, DIGIT, EurekAlert! The BBC Radio 4 Extra's Newsjack show mentioned us in their satire on fitness tracking (season 17, episode 2). I also gave an interview about our research to BBC Radio Scotland for the Newsdrive show (12/04/2019). Recent Publications A. Diallo, W. Li and P. Patras, \"ECHO: Effective coreset-driven learning via hierarchical optimizations\", IEEE ICDM, 2025. W. Li and P. Patras, \" Efficient Sketching for Heavy Item-Oriented Data Stream Mining With Memory Constraints\", IEEE Transactions on Computers, 2025. W. Li, T. Chu, C.S. Bouganis, and P. Patras, \"Harmonia: A Swift and Accurate Approximate Data Structure for Real-Time Heavy Flow Detection in High-Speed Networks\", ADMA, 2025. W. Li, B. Butun, T. Chu, M. Fiore, and P. Patras, \"Pallas: A Data-Plane-Only Approach to Accurate Persistent Flow Detection on Programmable Switches in High-Speed Networks\", IEEE ICNP, 2025. W. Li, Z. Li, B. Butun, A. Diallo, M. Fiore, and P. Patras, \"Pontus: A memory-efficient and high-accuracy approach for persistence-based item lookup in high-velocity data streams\", The Web Conference, 2025. W. Li and P. Patras, \"Stable-Sketch: A Versatile Sketch for Accurate, Fast, Web-Scale Data Stream Processing\", The Web Conference, 2024. A. Diallo and P. Patras, \"Sabre: Cutting through Adversarial Noise with Adaptive Spectral Filtering and Input Reconstruction\" IEEE S&P Spring 2024. FULL PUBLICATIONS LIST I am currently involved with the following Conferences/Workshops ACM CoNEXT 2026 ALL SCHOLARLY ACTIVITIES RESEARCH TEAM Alec Diallo (Postdoctoral Research Associated) Alec is working on active intelligence in networked systems, including adversarial robustness and neural network explainability. Weihe Li (Postdoctoral Research Associated) Weihe's research focuses on high-speed data stream processing using approximate data structures. Prospective Students Students interested in undertaking a PhD under my supervision may find this advice helpful. Previous Post-doctoral Research Associates Alexis Duque, 2020– 2021. (now at Net AI) Previous Students Weihe Li (PhD), The University of Edinburgh, 2025. (now at U. Edinburgh) Haoyu Liu (PhD), The University of Edinburgh, 2023. (now at Net AI) Rupen Mitra (MPhil), The University of Edinburgh, 2023 (now at Net Reply). Yini Fang (MPhil), The University of Edinburgh, 2022 (now at Chinese University of Hong Kong) Chaoyun Zhang (PhD), The University of Edinburgh, 2020. (now at Microsoft Research Asia) Rui Li (PhD), The University of Edinburgh, 2019. (now at Samsung AI Centre Cambridge) Visitors/Interns Ritvik Gupra, University of Edinburgh, June – Dec. 2025. Antonio Bazco, IMDEA Networks Institute, Jan. – Mar. 2025. Francesco Cerasuolo, University of Naples Federico II, Oct. 2024 – Mar. 2025. Luyang Xu, Computer Network Information Center, Chinese Academy of Sciences, Nov. 2020 –Oct. 2021. Stephen Waddell, University of Edinburgh, June–Aug. 2019. Marco Cominelli, University of Brescia, July–Dec. 2018 Adela Rotar, University of Edinburgh, May–July 2018. Haoyu Liu, University of Edinburgh, June–Sept. 2018. Ayush Bhardwaj, IIT Roorkee, June–Aug. 2018. Daniel Licciardello, University of Catania, Mar. 2016–May 2016. Chiara Capretti, University of Brescia, Sept. 2015–Dec. 2015. Nicolo Facchi, University of Brescia, Sept. 2014–Feb. 2015. I am/have been teaching the following COURSES Internet of Things Systems, Security, and the Cloud (IoTSSC, 2018–2021) The course gives students theoretical and practical grounding in IoT, covering systems architecture, hardware platforms, embedded programming and debugging, networking paradigms for IoT, secure operation, cloud integration, and simple data analytics. Computing in the Classroom (CiC, 2019–20) The course offers an in-depth, sustained experience in the classroom to fourth-year students contemplating a career in education. Computer Science Large Practical (CSLP, 2014–16) The course exposed students to the problems that arise with the design and implementation of large scale computer systems, and to methods of coping with such problems. Undergraduate Research Practical (URP, 2015) This course allowed undergraduate students to participate in a research project in collaboration with a member of staff or a research group. Computer & Communications Networks (CCN, 2013) This course introdu",
  "content_length": 10498,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:57"
}