{
  "name": "Paul Dourish",
  "homepage": "http://www.dourish.com",
  "status": "success",
  "content": "Paul Dourish Paul Dourish Main menu: Home | Students | Teaching | Publications | Bio | More.. Home I am a Professor in the Department of Informatics at UC Irvine. I've been here for quite a while and, like most people who hang around long enough in academia, I have accumulated other titles along the way such as Chancellor's Professor or Steckler Endowed Chair in Information and Computer Sciences or even Honorary Professorial Fellow in Computing and Information Systems at the University of Melbourne. I direct the Steckler Center for Responsible, Ethical, and Accessible Technology (CREATE). My research draws from anthropology, STS (Science and Technology Studies), and other humanistic social sciences to examine the contexts in which digital practices emerge and evolve. Much of the work revolves around what we might call \"data imaginaries\" -- data and technologies not just as things in the world, but as objects that live in the cultural imagination. For instance, when people working in city government encounter a problem, how do they come to conceive of it as one to which data tools might be a solution? How do they map organizational needs onto current (or anticipated) data platforms, and vice versa, and what do they do if they don't quite fit? Or, what futures do people imagine when they conceive of new digital tools? How do they interest others in adopting them, and what happens if the tools are used in ways they didn't anticipate? What if someone must still use them twenty or thirty years later? The fundamental character of my work is captured in a wonderful phrase by historian Steven Shapin which I am delighted to steal here quite shamelessly: \"Studies of Science as if It Was Produced by People with Bodies, Situated in Time, Space, Culture, and Society, and Struggling for Credibility and Authority\". What an idea, huh? Theoretically, most of the work I draw upon emerges from a pragmatist tradition (symbolic interactionism, say, or practice theory) although there is a distinct whiff of early British cultural studies to it too, along with hefty pinches of organizational science, feminist epistemology, and decolonial critique. For my sins, I spent long enough hanging out with ethnomethodologists during my intellectually formative years that their way of thinking has a major influence on mine. You say mishmash, I say epistemic generosity. Methodologically, my students and I work ethnographically for the most part. We like to know not just what people do and say but what they experience, how they feel, and how the places in which they find themselves sound and smell. My Ph.D. is in computer science, but I spend barely any time writing computer programs any more (and when I do, it's probably on some hobby project rather than formal research). Nevertheless, a deep and abiding nerdiness still manifests itself in my work from time to time. Once upon a time, I wrote mainly about computers and software systems. These days, life is more fun: I also get to write about zombies, spacecraft, science fiction, parole officers, bike messengers, indigenous Australians, medical administrators, Victorian rubber thieves, digital feudalism, online ghosts, and city planners. Although that feudalism paper is actually pretty nerdy. According to an anonymous student reviewer, I am \"by far the most eccentric professor in ICS,\" which I choose to take as a compliment; as a colleague pointed out, the competition for \"most eccentric\" is pretty tough around here. My Erdos Number is 3. I am a Fellow of the AAAS, a Fellow of the ACM, a Fellow of the BCS, and a member of the SIGCHI Academy. In 2025, I received ACM SIGCHI's Award for Lifetime Achievement in Research, but they won't get rid of me that easily. Also, I guess I talk a lot. Copyright © 2025 Paul Dourish Template design by Andreas Viklund",
  "content_length": 3832,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:44"
}