{
  "name": "Paul Rad",
  "homepage": "https://secureaiautonomylab.github.io",
  "status": "success",
  "content": "Secure AI Autonomy Lab - Secure AI Autonomy Lab Dr. Peyman NajafiradThe University of Texas at San Antonio Follow SP1 210BHomepageEmailGoogle ScholarGithubLinkedInX (formerly Twitter)Short BioPaul received his B.S. degree in computer engineering from the Sharif University of Technology, in 1994, the master’s degree in artificial intelligence from the Tehran Polytechnic, and the master’s degree in computer science, the Ph.D. degree in electrical and computer engineering from The University of Texas at San Antonio, San Antonio, Texas, USA. He is currently the Founder and the Director of the Secure AI and Autonomy Laboratory, Co-founder and Assistant Director of Open Cloud Institute, and an Associate Professor with the Departments of Information Systems and Cyber Security and Electrical and Computer Engineering (by courtesy) at UTSA.Research InterestMy research area is machine learning, an approach to Artificial Intelligence that relies on learning from data. I’m broadly interested in inference and causality using graphical and probabilistic deep models in applications such as computer vision, natural language understanding, and cyber analytics.AI securityKnowledge representationProbabilistic decision makingReinforcement learningNewsAug 20, 2025: Our paper “Reflective Agreement: Combining Self-Mixture of Agents with a Sequence Tagger for Robust Event Extraction” has been accepted to EMNLP 2025.July 18, 2025: Our paper “Sensitivity of Density-Ratio Estimation Based Fairness Measurement in Regression” has been accepted to AAAI/ACM Conference on AI, Ethics, and Society (AIES-2025)Dec 15, 2024: Our papers on jailbreaking LLMs and agent-based secure code generation presented in workshops @NeurIPS 2024August 15, 2024: Out paper on Deciphering Textual Authenticity presented in the 33rd USENIX Security SymposiumMay 22, 2024: Our paper on Inductive Learning to Infer Lateral Movement presented in 2024 IEEE Symposium on Security and Privacy (IEEE S&P)Jan 22, 2024: Our paper on Image Safeguarding using Conditional Vision Language Model present in the 38th Annual AAAI Conference on Artificial Intelligence.PhD StudentsPaul YoungAna NunezMohammad BahramiFatemeh HajiNasim FaridniaRinu JosephJesus GuerreroFormer Ph.D. StudentsDr. Abdalwahab Almajed, Ph.D. Computer Science Thesis Title: Evaluation of Machine Learning Fairness in Regression Domain, April 2025.Dr. Isaac Corley, Ph.D. Electrical and Computer Engineering Thesis Title: Multimodal Learning for Infrastructure Mapping in Remote Sensing, October 2024.Dr. Nafis Tanveer Islam, Ph.D. Computer Science Thesis Title: Static and Binary Source Code Vulnerability Analysis with Transformer-based Generative Models, July 2024Dr. Brandon Lwowski, Ph.D. Information Systems and Cyber Security Thesis Title: Towards Safe and Trustworthy Language Models: Understanding Performance Disparities in Computational Social Science, May 2023.Dr. Arun Das, Ph.D. Electrical and Computer Engineering Thesis Title: Interpretable Deep Learning Algorithms for Cognitive Neuroscience and Human Behavior Research, December 2021.Dr. Nima Ebadi, Ph.D. Electrical and Computer Engineering Thesis Title: Deep Representation Learning for Biomedical Text-based Documents, August 2021.Dr. Amin Sahba, Ph.D. Electrical and Computer Engineering Thesis Title: Intelligent Flow Control of Connected Driverless Vehicles in Smart City in Intersections, December 2021.Dr. Ramin Sahba, Ph.D. Electrical and Computer Engineering Thesis Title: 3D Object Detection for Autonomous Vehicles Perception Based on Combination of LiDAR, Radar, December 2021.Dr. Samuel Silva, Ph.D. Electrical and Computer Engineering Thesis Title: Robust Defense Algorithms against Adversarial Attacks and Deepfake, August 2021.Dr. Henry Chacon, Ph.D. Applied Statistics Thesis Title: Countermeasures against backdoor, data poisoning, and data adversarial attacks, August 2021.Dr. Gonzalo De La Torre Parra, Ph.D. Electrical and Computer Engineering Thesis Title: Distributed AI-Defense for Cyber Threats on Edge Computing Systems, May 2021.Dr. Nihar Bendre, Ph.D. Electrical and Computer Engineering Thesis Title: Explainability with Semantic Concept Composition and Zero-shot Learning for Anomaly Detection, May 2021.Dr. Ali Miraftab, Ph.D. Electrical and Computer Engineering Thesis Title: Real-time Adaptive Data Driven Perception for Anomaly Priority Scoring at Scale, December 2017.For more infoFor more info about Secure AI Autonomy Lab can be found at our website.",
  "content_length": 4488,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:58"
}