{
  "name": "Paul Schrater",
  "homepage": "http://gandalf.psych.umn.edu/users/schrater/PaulSchrater.htm",
  "status": "success",
  "content": "Paul R. Schrater, Ph.D. Paul R. Schrater Associate Professor Psychology & Computer Science N218 Elliott Hall 75 E. River Rd. Minneapolis, MN 55455 Phone: (612) 626-8638 FAX: 612-626-2079 schrater AT umn DOT edu Publications Courses Comp. Perception & Action Lab About me: My CV as of Nov, 2011: CV (2011) I hold a joint faculty position at the University of Minnesota, in the departments of Psychology and Computer Science. My current research interests generally involve using probabilistic methods to study issues in perception and motor control. Statement of Purpose From a single cell to the complexity of man, the story of life is one of creating an internal environment that protects against the forces of dissolution, of storing information, and of adapting to increase abilities to control its external and internal environment. Humans are the most sophisticated adaptive control engines we know of.  More than just an analogy, I believe that behavioral adaptation is a manifestation of deep control principles that are written on the history of life. Our brains have remarkably sophisticated control over almost all aspects of their own function, including what information gets in, how much food to eat in response to brain activity, even how much to learn. From cognition to motivation, from perception to action with memory in between, I believe that it is possible to construct an integrated theory of human behavior and brain function from a core principle – optimizing our ability to predict and control our internal, external and social environment.  My research is aimed at that goal,  incorporating methods and concepts from machine learning and artificial intelligence, including probabilistic inference, hierarchy, and structure learning.  I take a structured interdisciplinary approach, putting computational theory first - using theory to drive my empirical work.  I want to make precise and testable theories of the brain’s computations and experimentally test them using both behavioral measures and brain imaging. Recent Courses PSY 5018H Mathematical Models of Human Behavior, Spring 2011 CSCI 5512  Artificial Intelligence II Selected Publications by Topic Human Perception, Decision Theory and Human Behavior Decision Making Acuna, D., and Schrater, P.  (2010) Structure Learning in Human Sequential Decision-making. PLOS Computational Biology PLoS Computional Biol 6(12): e1001003.doi:10.1371/journal.pcbi.1001003 Green, C.S., Benson, C., Kersten, D., and Schrater, P. (2010) Alterations in choice behavior by manipulations of world-model. Proceedings of the National Academy of Sciences, 107(37) 16401-16406. Acuña, D. & Schrater, P. (2008). Bayesian Modeling of Human Sequential Decision-Making on the Multi-Armed Bandit Problem. In V. Sloutsky, B. Love, & K. McRae (Eds.), Proceedings of the 30th Annual Conference of the Cognitive Science Society. Washington, DC: Cognitive Science Society. [Details] Schrater, P. and Sundareswara, R. (2006) “Theory and Dynamics of Perceptual Bistability”, Proceedings NIPS*2006. PDF Schrater, P., Sodomka, E., and Sloane, C. (2005). (POSTER) Decision Making with Monetary Value Uncertainty., Society for Judgment and Decision Making. (POSTER PDF) Yuille, A. L., Fang, F., Schrater, P., & Kersten, D. (2004). Human and Ideal Observers for Detecting Image Curves. In S. Thrun, L. Saul & B. Schoelkopf (Eds.), NIPS*2004. (PDF) Schrater, P.R. (2003). Bayesian data fusion and credit assignment in vision and fMRI data analysis. Proc. SPIE Electronic Imaging, 5016, 24-35. (PDF) Schrater, P. R., and Kersten, D. (2000). How Optimal Depth Cue Integration Depends on the Task. International Journal of Computer Vision,  40(1): 71-89. PDF Schrater, P. R., and Kersten, D. (2000). Vision, Psychophysics, and Bayes. In: (R. Rao, B. Olshausen, and M. Lewicki, Ed.) Statistical Theories of the Brain, MIT Press. (PDF) Vision and Motor Control Christopolous, V. and Schrater, P. (2011) An optimal feedback control framework for grasping objects with position uncertainty. Neural Computation. Battaglia PW, Di Luca M, Ernst MO, Schrater PR, Machulla T, Kersten DJ (2010). Within- and cross-modal distance information disambiguate visual size-change perception, PLoS Computational Biology V.N. Christopoulos, Paul R. Schrater (2009), “Grasping objects with environmentally induced position uncertainty”, PLoS Comput Biol 5(10): e1000538. Doerschner, K., Kersten, D., and Schrater, P.R. (2010) Rapid classification of specular and diffuse reflection from image velocities, Pattern Recognition, online 15 September 2010, DOI: 10.1016/j.patcog.2010.09.007. Doerschner, K., Kersten, D., and Schrater, P. (2009), Rapid Classification of surface reflectance from image velocities. The 13th International Conference on Computer Analysis of Images and Patterns, 02/09-04/09, Accepted for publication in the Springer LNCS series. Zang, D., Doerschner, K., Schrater, P. (2009), Rapid inference of object rigidity and reflectance using optic flow. The 13th International Conference on Computer Analysis of Images and Patterns, 02/09-04/09, Accepted for publication in the Springer LNCS series. Battaglia, P.W.,  and Schrater, P. (2007)  Humans trade off viewing time and movement duration to minimize visuomotor variability in a fast reaching task.  Journal of Neuroscience LINK Schlicht, E., Schrater, P. (2007). Impact of coordinate transformation uncertainty on human sensorimotor control. Journal of Neurophysiology.  LINK Schlicht, E., Schrater, P. (2007). Reach-to-grasp trajectories adjust for uncertainty in the location of visual targets, Experimental Brain Research.  LINK Schlicht, E.J., & Schrater, P.R. Planning for uncertainty: Bayesian model for human reach and grasp. Kallie, C., Schrater, P., Legge, G. (2006) Variability in stepping direction explains veering behavior of blind walkers. JEP:HPP 33(1) 183–200. (PDF) Battaglia, P. W., Schrater, P., & Kersten, D. (2005).  Auxiliary object knowledge influences visually-guided interception behavior.  Proc. 2nd Symp. APGV, pp. 145 - 152. (PDF) Hartung, B., Schrater, P., Kersten, D., Bülthoff, H., Franz, V.H. (2005) Is prior knowledge of object geometry used in visually guided reaching? Journal of Vision, http://journalofvision.org/5/6/2. Paul R. Schrater, Erik J. Schlicht  (2006) Internal models for object manipulation: Determining optimal contact locations.  Department of Computer Science, University of Minnesota, Tech Report 06-003. Matoba, A. and Schrater, P. (2005) An Information-Theoretic Approach to Human Reach Path Analysis,  Computational Neural Systems 2005, Madison, WI. Bistability Sundareswara, R. and Schrater, P. (2007)  Perceptual multistability predicted by search model for Bayesian decisions,  Journal of Vision http://www.journalofvision.org/8/5/ Schrater, P. and Sundareswara, R. (2006) “Theory and Dynamics of Perceptual Bistability”, Proceedings NIPS*2006.  PDF Motion Perception Carlson, T. A., Schrater, P., & He, S. (2006). Floating square illusion: Perceptual uncoupling of static and dynamic objects in motion.  Journal of Vision, 6(2), 132-144, http://journalofvision.org/6/2/4/ Schrater, P.R., Knill, D.C., and Simoncelli, E.P. (2001). Perceiving visual expansion without optic flow. Nature, April, 12., 410, 816-819. PDF Schrater, P.R., Knill, D.C., and Simoncelli, E.P. (2000). Mechanisms of visual motion detection. Nature Neuroscience, 3(1), 64-68. PDF Schrater P R, and Simoncelli E P (1998) Local velocity representation: evidence from motion adaptation., Vision Research, 38, 3899-3912. PDF Machine Vision/Learning Acuña, D. & Schrater, P. (2009). Improving Bayesian Reinforcement Learning using Transition Abstraction. ICML/UAI/CLT Workshop on Abstraction in Reinforcement Learning 2009. Christopoulos, V. and Schrater, P. Handling shape and contact uncertainty in grasping planar objects. To appear: International Conference on Intelligent Robots and Systems (IROS'07). PDF preprint Tracking Veeraraghavan, H., Schrater, P.,R., Papanikolopoulos, N. (2007) Learning Dynamic Event Descriptions in Image Sequences. IEEE Proceedings on Computer Vision and Pattern Recognition, June, 2007. (PDF preprint) Veeraraghavan, Harini, Schrater, Paul and Papanikolopoulos, Nikos (2006). Robust Target Detection and Tracking through Integration of Motion, Color, and Geometry, Compuier Vision and Image Understanding, 103(2) 2006, 121-138. (PDF) Veeraraghavan, H., Schrater, P.,R., Papanikolopoulos, N. (2006) Adaptive Geometric Templates for Feature Matching.  Proceedings 2006 IEEE International Conference on Robotics and Automation 2006 (ICRA-2006), May 15-19, 2006. pp. 3393-3398. (PDF) Veeraraghavan, H., Schrater, P.,R., Papanikolopoulos, N. (2005) Switching Kalman Filter-Based Approach for Tracking and Event Detection at Traffic Intersections: Proceedings of the 2005 IEEE International Symposium on Intelligent Control, pp. 1167-72. (PDF) Veeraraghavan, H., Atev, S., Bird, N., Schrater, P, Papanikolopoulos, N. (2005).  Driver Activity Monitoring through Supervised and Unsupervised Learning. Proceedings 18th IEEE International Conference on Intelligent Transportation Systems, Sept. 17-20, 2006, pp. 1340-45. (PDF) Veeraraghavan, H., Papanikolopoulos, N., Schrater, P. (2006) Deterministic sampling-based switching kalman filtering for vehicle tracking.  Proceedings 2006 IEEE Conference on Intelligent Transportation Systems Sept. 17-20, 2006. pp. 1340-1345.  (PDF) Camera Calibration/Placement Sundareswara, R., and Schrater, P. (2010) Bayesian discounting of camera parameter uncertainty for optimal 3D reconstruction from images, Computer Vision and Image Understanding, In Press, Corrected Proof, Available online 26 August 2010, ISSN 1077-3142, DOI: 10.1016/j.cviu.2010.07.001. Bodor, R., Drenner,  A., Janssen,  M., Schrater, P., and Papanikolopoulos, N. (2005), \"Mobile Camera Positioning to Optimize the Observability of Human Activity Recognition Tasks\",  2005 IEEE/RSJ International Conference on International Conference on Intellig",
  "content_length": 14639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:00"
}