{
  "name": "Pauline C Haddow",
  "homepage": "https://www.ntnu.edu/employees/pauline",
  "status": "success",
  "content": "Pauline Catriona Haddow - NTNU Pauline Catriona Haddow Download press photo Download press photo Download press photo Foto: Kai T. Dragland / NTNU Close Pauline Catriona Haddow Professor Department of Computer Science pauline@ntnu.no +4773594458 Drivhuset IT-bygget, sydfløy Gløshaugen, Trondheim About Pauline Haddow leads the CRAB lab, which is part of the Artificial Intelligence Group. More informaiton may be found at http://crab.idi.ntnu.no. Publications 2025 Luiggi-Gørrissen, Axel; Woldseth, Trygve Johansen; Haddow, Pauline Catriona. (2025) Exploring Open Dimensions in Artificial Immune Systems for High-Dimensional Tasks. Academic chapter/article/Conference paper 2024 Rezaei, Babak; Guimaraes, Frederico Gadelha; Enayatifar, Rasul; Haddow, Pauline Catriona. (2024) Exploring dynamic population Island genetic algorithm for solving the capacitated vehicle routing problem. Memetic Computing Academic article 2023 Rezaei, Babak; Guimaraes, Frederico Gadelha; Enayatifar, Rasul; Haddow, Pauline Catriona. (2023) Combining genetic local search into a multi-population Imperialist Competitive Algorithm for the Capacitated Vehicle Routing Problem. Applied Soft Computing Academic article 2022 Wisløff, Erling Harald; Aarsnes, Marius; Ripon, Kazi Shah Nawaz; Haddow, Pauline. (2022) Extending the Push and Pull Search Framework with Boundary Search for Constrained Multi-Objective Optimization. Academic chapter/article/Conference paper 2021 Tenstad, Amund; Haddow, Pauline. (2021) DES-HyperNEAT: Towards Multiple Substrate Deep ANNs. Academic chapter/article/Conference paper Foss, Fredrik; Stenrud, Truls; Haddow, Pauline. (2021) Investigating Genetic Network Programming for Multiple Nest Foraging. Academic chapter/article/Conference paper Sverdrup-Thygeson, Simen; Haddow, Pauline. (2021) Feature Selection for Fake News Classification. Academic chapter/article/Conference paper Haddow, Pauline. (2021) IEEE Symposium Series on Computational Intelligence 2021. IEEE Press IEEE Press Academic anthology/Conference proceedings 2019 Baug, Eirik; Haddow, Pauline; Norstein, Andreas. (2019) MAIM: A Novel Hybrid Bio-inspired Algorithm for Classification. IEEE Xplore Digital Library Academic article 2018 Haddow, Pauline; Tyrrell, Andy. (2018) Evolvable Hardware Challenges: Past, Present and the Path to a Promising Future. Academic chapter/article/Conference paper Haddow, Pauline. (2018) Inspired by Nature. Springer Springer Academic anthology/Conference proceedings 2015 Haddow, Pauline. (2015) Developmental Evolvable Hardware. Academic chapter/article/Conference paper Haddow, Pauline. (2015) Developmental evolvable hardware. Natural Computing Series Academic article 2014 Fossum, Filip; Montanier, Jean-Marc; Haddow, Pauline. (2014) Repellent Pheromones for Effective Swarm Robot Search in Unknown Environments. Academic chapter/article/Conference paper Skjetne, Christian Berg; Haddow, Pauline; Rye, Anders Søbstad; Schei, Håvard; Montanier, Jean-Marc. (2014) The chIRP robot: A versatile swarm robot platform. Advances in Intelligent Systems and Computing Academic article Neumann, Frank; Doerr, Benjamin; Lehre, Kristian; Haddow, Pauline. (2014) Editorial for Special Issue on Theoretical Foundations of Evolutionary Computation. IEEE Transactions on Evolutionary Computation Editorial Haddow, Pauline. (2014) VP-Conference Activities Vision Statement. IEEE Computational Intelligence Magazine Academic article Gautam, Vinay Kumar; Czeizler, Eugen; Haddow, Pauline; Kuiper, Martin. (2014) Design of a Minimal System for Self-replication of Rectangular Patterns of DNA Tiles. Lecture Notes in Computer Science (LNCS) Academic article Montanier, Jean-Marc; Haddow, Pauline. (2014) Adaptive self-assembly in swarm robotics through environmental bias. Academic chapter/article/Conference paper 2013 Tyrrell, Andy; Haddow, Pauline. (2013) 2013 IEEE International Conference on Evolvable Systems (ICES). IEEE (Institute of Electrical and Electronics Engineers) IEEE (Institute of Electrical and Electronics Engineers) Academic anthology/Conference proceedings Haddow, Pauline; Gautam, Vinay Kumar. (2013) DNA Tiling for Digital Evolvable Hardware. Academic chapter/article/Conference paper 2012 Jevne, Håken; Haddow, Pauline; Gaivoronski, Alexei A.. (2012) Evolving constrained mean-VaR efficient frontiers. Academic chapter/article/Conference paper 2011 Gautam, Vinay Kumar; Ray, Kailash Chandra; Haddow, Pauline. (2011) Hardware efficient design of Variable Length FFT Processor. Academic chapter/article/Conference paper Haddow, Pauline. (2011) Special Issue on Evolvable Hardware Challenges. Springer Springer Report Jørgensen, Katarina Mariann; Haddow, Pauline. (2011) VISUALIZATION IN SIMULATION TOOLS:REQUIREMENTS AND A TOOL SPECIFICATION TO SUPPORT THE TEACHING OF DYNAMIC BIOLOGICAL PROCESSES. Journal of Bioinformatics and Computational Biology Academic article Djupdal, Asbjørn; Haddow, Pauline. (2011) The Route to a Defect Tolerant LUT through Artificial Evolution. Genetic Programming and Evolvable Machines Academic article Haddow, Pauline; Tyrrell, Andy. (2011) Challenges of Evolvable Hardware: Past, Present and the Path to a Promising Future. Genetic Programming and Evolvable Machines Academic article Haddow, Pauline. (2011) Introduction: Special issue on Evolvable Hardware challenges. Genetic Programming and Evolvable Machines Editorial 2009 Santini, Cristina Costa; Tufte, Gunnar; Haddow, Pauline. (2009) Bio-inspired Reverse Engineering of Regulatory Networks. Academic chapter/article/Conference paper Haddow, Pauline; Tyrrell, Andy. (2009) IEEE Congress on Evolutionary Computation. IEEE (Institute of Electrical and Electronics Engineers) IEEE (Institute of Electrical and Electronics Engineers) Academic anthology/Conference proceedings Laketic, Dragana; Tufte, Gunnar; Haddow, Pauline. (2009) Stochastic Adaptation to Environmental Changes Supported by Endocrine System Principles. Academic chapter/article/Conference paper Haddow, Pauline; Høye, Johan. (2009) Investigating the Effect of Regulatory Decisions in a Development Model. Academic chapter/article/Conference paper 2008 Hornby, Gregory; Sekanina, Lukas; Haddow, Pauline. (2008) Proceedings of the 8th International Conference on Evolvable Systems,ICES 2008. Springer Springer Academic anthology/Conference proceedings Haddow, Pauline. (2008) Evolvable Hardware: A Tool for Reverse Engineering of Biological Systems. Academic chapter/article/Conference paper Djupdal, Asbjørn; Haddow, Pauline. (2008) Defect Tolerance Inspired by Artificial Evolution. Academic chapter/article/Conference paper 2007 Laketic, Dragana; Haddow, Pauline. (2007) Extreme Temperature Electronics - From Materials to Bio-inspired Adaptation. Academic chapter/article/Conference paper Laketic, Dragana; Haddow, Pauline. (2007) Extreme Temperature Electronics Adaptability Based on Hormonal System Regulation. Academic chapter/article/Conference paper Haddow, Pauline; Høye, Johan. (2007) Achieving a Simple Development Model for 3D Shapes: Are Chemical Necessary?. Academic chapter/article/Conference paper Djupdal, Asbjørn; Haddow, Pauline. (2007) Evolving and analysing \"useful\" redundant logic. Lecture Notes in Computer Science (LNCS) Academic article Lehre, Per Kristian; Haddow, Pauline. (2007) Phenotypic complexity and local variations in neutral degree. Biosystems (Amsterdam. Print) Academic article Hartmann, Morten; Haddow, Pauline; Lehre, Per Kristian. (2007) The genotypic complexity of evolved fault-tolerant and noise-robust circuits. Biosystems (Amsterdam. Print) Academic article Haddow, Pauline; Hartmann, Morten; Djupdal, Asbjørn. (2007) Adressing the Metric Challenge: Evolved versus Traditional Fault Tolerant Circuits. Academic chapter/article/Conference paper Djupdal, Asbjørn; Haddow, Pauline. (2007) Evolving Redundant Structures for Reliable Circuits -- Lessons Learned. Academic chapter/article/Conference paper Djupdal, Asbjørn; Haddow, Pauline. (2007) Defect Tolerant Ganged CMOS Minority Gate. Academic chapter/article/Conference paper Djupdal, Asbjørn; Haddow, Pauline. (2007) Evolving Efficient Redundancy by Exploiting the Analogue Nature of CMOS Transistors. Academic chapter/article/Conference paper Tufte, Gunnar; Haddow, Pauline. (2007) Achieving environmental tolerance through the initiation and exploitation of external information. Academic chapter/article/Conference paper Tufte, Gunnar; Haddow, Pauline. (2007) Extending Artificial Development: Exploiting Environmental information for the achievement of Phenotypic Plasticity. Lecture Notes in Computer Science (LNCS) Academic article 2006 Lehre, Per Kristian; Haddow, Pauline. (2006) Accessibility and Runtime Between Convex Neutral Networks. Lecture Notes in Computer Science (LNCS) Academic article 2005 Lehre, Per Kristian; Haddow, Pauline. (2005) Accessibility between Neutral Networks in Indirect Genotype-Phenotype Mappings. Academic chapter/article/Conference paper Tufte, Gunnar; Haddow, Pauline. (2005) Towards Development on a Silicon-based Cellular Computing Machine. Natural Computing Academic article Hartmann, Morten; Lehre, Per Kristian; Haddow, Pauline. (2005) Evolved Digital Circuits and Genome Complexity. Proceedings (NASA/DoD Conference on Evolvable Hardware) Academic article 2004 Tufte, Gunnar; Haddow, Pauline. (2004) Biologically-inspired: A rule-based self-reconfiguration of a virtex chip. Lecture Notes in Computer Science (LNCS) Academic article Hartmann, Morten; Haddow, Pauline. (2004) Evolution of fault-tolerant and noise-robust digital designs. IEE Proceedings - Computers and digital Techniques Academic article 2003 Aunet, Snorre; Haddow, Pauline. (2003) Nye undervisningsformer i faget TDT4255 - Konstruksjon av datamaskinsystemer, H-2003. Seksjon for universitetspedagogikk, Program for lærerutd., SVT. Seksjon for universitetspedagogikk, Program for lærerutd., SVT. Report Tufte, Gunnar; Haddow, Pauline. (2003) Building Knowledge into Developmental Rules for Circuite Design. Lecture No",
  "content_length": 30436,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:06"
}