{
  "name": "Paul Tennent",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/paul.tennent",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Paul TennentAssociate Professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom C13 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKwork0115 84 66522fax0115 95 14254paul.tennent@nottingham.ac.ukhttps://paultennent.co.uk Recent Publications MARSHALL, JOE and TENNENT, PAUL, 2013. Mobile interaction does not exist In: CHI'13 Extended Abstracts on Human Factors in Computing Systems. 2069-2078TENNENT P., REEVES, S., BENFORD, S., WALKER, B., MARSHALL, J., BRUNDELL, P., MEESE, R. and HARTER, P., 2012. The machine in the ghost: augmenting broadcasting with biodata In: CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA'12), ACM, New York. 91-100MARSHALL, JOE, WALKER, BRENDAN, BENFORD, STEVE, TOMLINSON, GEORGE, RENNICK EGGLESTONE, STEFAN, REEVES, STUART, BRUNDELL, PATRICK, TENNENT, PAUL, CRANWELL, JO, HARTER, PAUL and LONGHURST, JO, 2011. The gas mask: a probe for exploring fearsome interactions In: Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems. 127-136RENNICK-EGGLESTONE, STEFAN, WHITBROOK, AMANDA, LEYGUE, CAROLINE, GREENSMITH, JULIE, WALKER, BRENDAN, BENFORD, STEVE, SCHNÄDELBACH, HOLGER, REEVES, STUART, MARSHALL, JOE, KIRK, DAVID, TENNENT, PAUL, IRUNE, AINOJE and ROWLAND, DUNCAN, 2011. Personalizing the theme park: psychometric profiling and physiological monitoring. In: UMAP'11 Proceedings of the 19th international conference on User modeling, adaption, and personalization 281-292 View all publications MARSHALL, JOE and TENNENT, PAUL, 2013. Mobile interaction does not exist In: CHI'13 Extended Abstracts on Human Factors in Computing Systems. 2069-2078TENNENT P., REEVES, S., BENFORD, S., WALKER, B., MARSHALL, J., BRUNDELL, P., MEESE, R. and HARTER, P., 2012. The machine in the ghost: augmenting broadcasting with biodata In: CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA'12), ACM, New York. 91-100MARSHALL, JOE, WALKER, BRENDAN, BENFORD, STEVE, TOMLINSON, GEORGE, RENNICK EGGLESTONE, STEFAN, REEVES, STUART, BRUNDELL, PATRICK, TENNENT, PAUL, CRANWELL, JO, HARTER, PAUL and LONGHURST, JO, 2011. The gas mask: a probe for exploring fearsome interactions In: Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems. 127-136RENNICK-EGGLESTONE, STEFAN, WHITBROOK, AMANDA, LEYGUE, CAROLINE, GREENSMITH, JULIE, WALKER, BRENDAN, BENFORD, STEVE, SCHNÄDELBACH, HOLGER, REEVES, STUART, MARSHALL, JOE, KIRK, DAVID, TENNENT, PAUL, IRUNE, AINOJE and ROWLAND, DUNCAN, 2011. Personalizing the theme park: psychometric profiling and physiological monitoring. In: UMAP'11 Proceedings of the 19th international conference on User modeling, adaption, and personalization 281-292TENNENT, PAUL, ROWLAND, DUNCAN, MARSHALL, JOE, RENNICK-EGGLESTONE, STEFAN, HARRISON, A, JAIME, Z, WALKER, BRENDAN and BENFORD, STEVE, 2011. Breathalising games: understanding the potential of breath control in game interfaces. In: Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology 58BRUNDELL, PATRICK, CRABTREE, ANDREW, MORTIER, RICHARD, RODDEN, TOM, TENNENT, PAUL and TOLMIE, PETER, 2011. The network from above and below. In: Proc. ACM SIGCOMM Workshop on Measurements Up the STack (W-MUST) BRUNDELL, PATRICK, CRABTREE, ANDREW, MORTIER, RICHARD, RODDEN, TOM, TENNENT, PAUL and TOLMIE, PETER, 2011. W-MUST'11 Best Papers-The Network From Above and Below SIGCOMM-Computer Communication Review. 41(4), 519KNIGHT, DAWN, TENNENT, PAUL, ADOLPHS, SVENJA and CARTER, RONALD, 2010. Developing heterogeneous corpora using the Digital Replay System ( DRS ) In: Language Resources Evaluation Conference Workshop on Multimodal Corpora: Advances in Capturing, Coding and Analyzing Multimodality. FIELDING, N, LEWINS, A, SILVER, C, CRABTREE, ANDREW, TENNENT, PAUL, BRUNDELL, PATRICK and FRASER, M, 2009. Shaping Next Generation CAQDAS Tools Workshop on Shaping Next Generation CAQDAS Tools. RODDEN, TOM, TENNENT, PAUL, CHALMERS, MATTHEW, GRINTER, BEKI, EDWARDS, KEITH and CRABTREE, ANDREW, 2009. Homework: Developing a Corpus of Domestic Network Usage In: CHI 2009 `Developing Shared Home Behavior Datasets to Advance HCI and Ubiquitous Computing Research` workshop. BRUNDELL, PATRICK, KNIGHT, DAWN, TENNENT, PAUL, NAEEM, A, ADOLPHS, SVENJA, AINSWORTH, SHAARON, CARTER, RONALD, CLARKE, DAVID, CRABTREE, ANDREW, GREENHALGH, CHRIS, O`MALLEY, CLAIRE, PRIDMORE, T and RODDEN, TOM, 2008. The experience of using the Digital Replay System for social science research In: 4th International e-Social Science Conference. BRUNDELL, PATRICK, TENNENT, PAUL, GREENHALGH, CHRIS, KNIGHT, DAWN, CRABTREE, ANDREW, O`MALLEY, CLAIRE, AINSWORTH, SHAARON, CLARKE, DAVID, CARTER, RONALD and ADOLPHS, SVENJA, 2008. Digital Replay System (DRS): A Tool for Interaction Analysis In: International Conference on Learning Sciences (Workshop on Interaction Analysis). KNIGHT, DAWN, ADOLPHS, SVENJA, TENNENT, PAUL and CARTER, RONALD, 2008. The Nottingham Multi-Modal Corpus: A Demonstration In: 6th Language Resources And Evaluation Conference (Workshop On Multi-Modal Corpora). TENNENT, PAUL, 2008. Defining The Role Of The E-Social Scientist In: The 4th International E-Social Science Conference. TENNENT, PAUL, CRABTREE, ANDREW and GREENHALGH, CHRIS, 2008. Ethno-Goggles: Supporting Field Capture of Qualitative Material Proceedings of the 4th International e-Social Science Conference. 18-20MORRISON, ALISTAIR, TENNENT, PAUL, WILLIAMSON, JOHN and CHALMERS, MATTHEW, 2007. Using Location, Bearing and Motion Data to Filter Video and System Logs Pervasive Computing. 109-126GREENHALGH, CHRIS, FRENCH, ANDY, TENNENT, PAUL, HUMBLE, JAN and CRABTREE, ANDREW, 2007. From ReplayTool to Digital Replay System In: (ICESS2007) 3rd International Conference on e-Social Science. GREENHALGH, CHRIS, FRENCH, ANDY, HUMBLE, JAN and TENNENT, PAUL, 2007. Engineering a replay application based on RDF and OWL Online Proceedings of the UK e-Science All Hands Meeting 2007. 10-13TENNENT, PAUL and CRABTREE, ANDREW, 2007. CAQDAS and Multi-dimensional Data Synchronization International Conference on E-Social Science, Workshop. TENNENT, PAUL and KNIGHT, DAWN, 2007. Multi modal corpora: Adapting gesture recognition techniques for linguistic analysis poster at the 3rd International Conference on e-Social Science, October. 7-9MORRISON, ALISTAIR, TENNENT, PAUL and CHALMERS, MATTHEW, 2006. Coordinated Visualisation of Video and System Log Data In: CMV `06: Proceedings of the Fourth International Conference on Coordinated & Multiple Views in Exploratory Visualization. 91-102CRABTREE, ANDREW, BENFORD, STEVE, GREENHALGH, CHRIS, TENNENT, PAUL, CHALMERS, MATTHEW and BROWN, BARRY, 2006. Supporting ethnographic studies of ubiquitous computing in the wild In: DIS `06: Proceedings of the 6th conference on Designing Interactive systems. 60-69TENNENT, PAUL, MORRISON, ALISTAIR and CHALMERS, MATTHEW, 2006. Replayer: Collaborative evaluation of mobile applications In: Workshop on Information Visualization And Interaction Techniques For Collaboration Across Multiple Displays, Held At ACM Conference On Human Factors In Computing (CHI 2006). BELL, MAREK, CHALMERS, MATTHEW, BARKHUUS, LOUISE, HALL, MALCOLM, SHERWOOD, SCOTT, TENNENT, PAUL, BROWN, BARRY, ROWLAND, DUNCAN and BENFORD, STEVE, 2006. Interweaving mobile games with everyday life In: Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI `06. 417MORRISON, ALISTAIR, TENNENT, PAUL, WILLIAMSON, JOHN and CHALMERS, MATTHEW, 2006. Auto-classifying Salient Content In Video Workshop on Computer Assisted Recording, Pre-Processing, and Analysis of User Interaction Data. TENNENT, PAUL, HALL, MALCOLM, BROWN, BARRY, CHALMERS, MATTHEW and SHERWOOD, SCOTT, 2005. Three applications for mobile epidemic algorithms In: MobileHCI `05: Proceedings of the 7th international conference on Human computer interaction with mobile devices & services. 223-226CHALMERS, MATTHEW, BELL, MAREK, BROWN, BARRY, HALL, MALCOLM, SHERWOOD, SCOTT and TENNENT, PAUL, 2005. Gaming on the edge: using seams in ubicomp games In: ACE `05: Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology. 306-309BARKHUUS, LOUISE, CHALMERS, MATTHEW, TENNENT, PAUL, HALL, MALCOLM, BELL, MAREK, SHERWOOD, SCOTT and BROWN, BARRY, 2005. Picking Pockets on the Lawn: The Development of Tactics and Strategies in a Mobile Game. In: Ubicomp. 358-374CHALMERS, MATTHEW, BARKHUUS, LOUISE, BELL, MAREK, BROWN, BARRY, HALL, MALCOLM, SHERWOOD, SCOTT and TENNENT, PAUL, 2005. Gaming on the edge: Using seams in pervasive games Proc. Pervasive, PerGames workshop. CHALMERS, MATTHEW, BELL, MAREK, BROWN, BARRY, HALL, MALCOLM, SHERWOOD, SCOTT and TENNENT, PAUL, 2005. Using Peer-to-Peer Ad Hoc Networks for Play and Leisure Proceedings UK-UbiNet Workshop. TENNENT, PAUL and CHALMERS, MATTHEW, 2005. Recording and Understanding Mobile People and Mobile Technology In: 1st International Conference on e-Social Science. TENNENT, PAUL, 2004. Augmenting Observation of Location Aware Systems In: 2004 Workshop on Location-Aware Computing Adjacent to UbiComp2004. 2CHALMERS, MATTHEW, BELL, MAREK, HALL, MALCOLM, SHERWOOD, SCOTT and TENNENT, PAUL, 2004. Seamful Games Adjunct Proceedings of 6th Int. Conf. on Ubiquitous Computing. 7-10CHALMERS, MATTHEW and TENNENT, PAUL, 2004. Recording and Reusing Mobile Game Play, In Games And Social Networks: A Workshop On Multiplayer Games In: Adjacent To The 18th British Hci Group Annual Conference. MA",
  "content_length": 10842,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:01"
}