{
  "name": "Paulo Mateus",
  "homepage": "http://sqig.math.ist.utl.pt/paulo.mateus",
  "status": "success",
  "content": "SQIG at IT home people work publications theses guests events seminars Paulo Mateus Departamento de Matemática Instituto Superior Técnico Av. Rovisco Pais 1049-001, Lisboa, Portugal Universidade de Lisboa pmat@math.ist.utl.pt paulocmateus at Skype Tel. +351 21 8417149 Fax. +351 21 8417048 Professor for Logic and Computation at ISTVice-coordinator of the PhD Program in Information Security at ISTFounding member and current Coordinator of SQIG at Instituto de Telecomunicações Short Biography He obtained his doctorate in Mathematics and was a Postdoc at the University of Pennsylvania. He was awarded the IBM scientific prize, Portugal, in 2005 for his habilitation thesis. Currently he is a Professor from the Mathematics Department of Instituto Superior Técnico and a researcher from Instituto de Telecomunicações. In 2006, he founded and presently coordinates the Security and Quantum Information Group. His present research is focused on using quantum resources for security and communication and has been author and co-author of more than 50 peer-reviewed international journal publications in mathematics. He has coordinated several national and international projects and has been guest editor of Logic Journal of the IGPL, IEEE Communications, and part of the program committee of several workshop and conferences. He was invited by the Hungarian (OTKA), Czech (GACR) science foundations, as well as by the Israeli Ministry of Science and Technology, to be a member of the evaluation board for their national projects and postdocs. He was a member of the Managing Board of the European Network and Information Security Agency, vice-president of Centro Internacional de Matemática, and consultant for the Portuguese National Security Agency. Teaching Discrete Mathematics (undergraduate course, co-designed with C. Sernadas) Cryptography and Security Protocols (graduate course) Quantum Information, Computation and Logic (PhD course, co-designed with A. Sernadas) ResearchMost of his research has been focused on probabilistic and quantum models of computation, including formal reasoning about concurrent and security protocols and quantum cryptography.Projects SPARTA - H2020 project QDOT: Quantum Distributed Oblivious Transfer - P2020 project QuantumMining: Quantum Data mining QuantTel: Quantum Telecommunications QSec: Quantum Security Multiparticle quantum walks and their algorithmic applications EuroNF: European Network of Excellence on the Future of Networks  (SQIG coordinator) PublicationsPapers and projects in the following links: OrcID 0000-0002-2393-8224 Google Scholar profile AMS profile PhD Students (current) Manuel Santos PhD Students (past) Manuel Goulão (Since September 2017 - 2022; grant DP-PMI from FCT) Pedro Branco (Since September 2017 - 2022; grant DP-PMI from FCT;co-supervised with N. Döttlling) Serena Di Giorgio (Since February 2016 - co-supervised with N. Paunkovic  - grant DP-PMI from FCT) Mariano Lemus (Since February 2016 - co-supervised with N. Paunkovic  - grant DP-PMI from FCT) Preeti Yadav (Since November 2015 - co-supervised with A. Souto - grant DP-PMI from FCT) Chrysoula Vlachou (2018 - co-supervised with N. Paunkovic - grant DP-PMI from FCT) João Rodrigues (2017 - co-supervised with N. Paunkovic - grant from FCT, currently at Delloite) Ricardo Loura (2017 - co-supervised with V. R. Vieira - grant from FCT, currently at Tekever) David Henriques (2016 - grant from FCT, currently at BNP Parisbas) Manuel Biscaia (2016 - grant from FCT, currently at Critical Software UK) Pedro Baltazar (2010, co-supervised with C. Sernadas - grant from FCT, currently at UBS Zurich) Pedro Adão (2006, co-supervised with A. Scedrov U. Pennsylvania - grant from FCT, currently at IST Lisbon) Post-docs (past) Andre Souto (From September 2012 to February 2016 - grant from FCT) Filipe Moura (November 2007 to June 2008 - grant from FCT) Nikola Paunkovic (March 2006 to June 2007 - grant from FCT) Rohit Chadha (co-supervised with A. Sernadas - grant from FCT), September 2005 - September 2006 location | contact | +info Webpage under Creative Commons License. 2009 SQIG-IT. Designed by Pedro Baltazar",
  "content_length": 4147,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:17"
}