{
  "name": "Paul Harvey 0002",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/paulharvey",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Paul Harvey Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffPaul HarveyMr Ethan KellyZhen Tian Dr Paul Harvey Senior Lecturer (School of Computing Science) email: Paul.Harvey@glasgow.ac.uk F142, School of Computing Science, University of Glasgow Import to contacts https://orcid.org/0000-0003-1243-938X Biography Paul Harvey is a senior lecturer at the School of Computing Science, University of Glasgow. Here, he is exploring the cross-section of technologies and skills required for safe and meaningful fully-autonomous behaviour of both design and operation. Additionally, he is a working group co-chair in the UN’s ITU-T Focus Group on Autonomous Networks and a visiting researcher at the University of Strathclyde. Paul also possess extensive experience in industrial research, where he was co-founder and research lead of the Rakuten Mobile Innovation Studio, and is a strong believer in open and collaborative research. paul-harvey.org Research interests Research groupsGlasgow Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011Number of items: 35.2025 Krishnamohan, Theviyanthan and Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X (2025) OpenRASE: Service Function Chain Emulation. In: SoftCOM 2025, Split, Croatia, 18-20 September 2025, ISBN 9798350392968 Thamsen, Lauritz ORCID: https://orcid.org/0000-0003-3755-1503, Elkhatib, Yehia ORCID: https://orcid.org/0000-0003-4639-436X, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Singer, Jeremy ORCID: https://orcid.org/0000-0001-9462-6802 and Vanderbauwhede, Wim ORCID: https://orcid.org/0000-0001-6768-0037 (2025) Energy-aware workflow execution: an overview of techniques for saving energy and emissions in scientific compute clusters. arXiv, 2506.04062. (doi: 10.48550/arXiv.2506.04062) Ding, Shenjia, Flynn, David ORCID: https://orcid.org/0000-0002-1024-3618 and Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X (2025) Automatic Generation of Digital Twins for Network Testing. In: IEEE ICDCS 2025 45th IEEE International Conference on Distributed Computing Systems, Glasgow, UK, 20-23 July 2025, (Accepted for Publication) Miyata, Sumiko, Miyata, Takamichi, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X and Khan, Irfanullah (2025) On the Effectiveness of Task Off-loading in Edge based Federated Learning Environment. In: IEEE ICDCS 2025 45th IEEE International Conference on Distributed Computing Systems, Glasgow, UK, 20-23 July 2025, (Accepted for Publication) Rodgers, Philip ORCID: https://orcid.org/0000-0001-5570-7490 and Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X (2025) The xApp Store: A Framework for xApp Onboarding and Deployment in O-RAN. In: IEEE ICDCS 2025 45th IEEE International Conference on Distributed Computing Systems, Glasgow, UK, 20-23 July 2025, (Accepted for Publication) Yanagida, Ryo ORCID: https://orcid.org/0000-0002-0819-6453, Singer, Jeremy ORCID: https://orcid.org/0000-0001-9462-6802, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Wong, Leon and Perkins, Colin ORCID: https://orcid.org/0000-0002-3404-8964 (2025) Distributing Quality of Service (QoS) Policies in Name-based Networks. In: ANMS Workshop in conjunction with the 45th IEEE International Conference on Distributed Computing Systems (ICDCS), Glasgow, Scotland, UK, 20-23 Jul 2025, (Accepted for Publication) Yanagida, Ryo ORCID: https://orcid.org/0000-0002-0819-6453, Singer, Jeremy ORCID: https://orcid.org/0000-0001-9462-6802, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Wong, Leon and Perkins, Colin ORCID: https://orcid.org/0000-0002-3404-8964 (2025) Name-based Quality for Name-based Networks. In: 45th IEEE International Conference on Distributed Computing Systems (ICDCS), Glasgow, UK, 20-23 July 2025, (Accepted for Publication) Liu, Jingzhao, Zhao, Xingyu, Bian, Zijun, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Watson, Scott ORCID: https://orcid.org/0000-0002-9235-9242, Sweeney, Stephen J. ORCID: https://orcid.org/0000-0001-8561-6071 and Hogg, Richard ORCID: https://orcid.org/0000-0002-0781-6809 (2025) Interdependence of parasitic losses in photonic crystal surface emitting lasers. AIP Advances, 15, 045321. (doi: 10.1063/5.0252646) 2024 Casadei, Roberto, Esterle, Lukas, Gamble, Rose, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X and Wanner, Elizabeth F. (2024) Editorial: Understanding and engineering cyber-physical collectives. Frontiers in Robotics and AI, 11, 1407421. (doi: 10.3389/frobt.2024.1407421) (PMID:38770438) (PMCID:PMC11102989) 2023 Liu, Jingzhao, Gao, Yunyun, Ivanov, Pavlo, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X and Hogg, Richard ORCID: https://orcid.org/0000-0002-0781-6809 (2023) Probabilistic Markov chain modelling of photonic crystal surface emitting lasers. Applied Physics Letters, 123, 261107. (doi: 10.1063/5.0168073) Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X (2023) HSBooster Report - Standardisation for OntoCommons. Documentation. Zenodo. (doi: 10.5281/ZENODO.8414882). Fúster De La Fuente, Jaime, Pendás Recondo, Álvaro, Wong, Leon and Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X (2023) Enabling Auditable Trust in Autonomous Networks with Ethereum and IPFS. In: NOMS 2023-2023 IEEE/IFIP Network Operations and Management Symposium, Miami, FL, USA, 8-12 May 2023, ISBN 9781665477161 (doi: 10.1109/noms56928.2023.10154327) Kliks, Adrian, Dryjanski, Marcin, Ram, Vishnu, Wong, Leon and Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X (2023) Towards autonomous open radio access networks. ITU Journal on Future and Evolving Technologies, 4(2), pp. 251-268. (doi: 10.52953/GJII3746) Fúster de la Fuente, J. et al. (2023) Build your own closed loop: Graph-based proof of concept in closed loop for autonomous networks. ITU Journal on Future and Evolving Technologies, (doi: 10.52953/opdk5666) 2022 Wu, Di, Ullah, Rehmat, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Kilpatrick, Peter, Spence, Ivor and Varghese, Blesson (2022) FedAdapt: Adaptive offloading for IoT Devices in federated learning. IEEE Internet of Things Journal, 9(21), pp. 20889-20901. (doi: 10.1109/JIOT.2022.3176469) Ullah, Rehmat, Wu, Di, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Kilpatrick, Peter, Spence, Ivor and Varghese, Blesson (2022) FedFly: toward migration in edge-based distributed federated learning. IEEE Communications Magazine, 60(11), pp. 42-48. (doi: 10.1109/mcom.003.2100964) Yanev, Mihail and Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X (2022) Herding the FLOQ: Flow Optimised Queueing. In: IFIP Networking 2022 Conference, Catania, Italy, 13-16 Jun 2022, ISBN 9781665487269 (doi: 10.23919/IFIPNetworking55013.2022.9829812) Anderson, Damien, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Kaneta, Yusaku, Papadopoulos, Petros, Rodgers, Philip and Roper, Marc (2022) Towards evolution-based autonomy in large-scale systems. In: GECCO '22: Genetic and Evolutionary Computation Conference, Boston, Massachusetts, USA, 9-13 July 2022, pp. 1924-1925. ISBN 9781450392686 (doi: 10.1145/3520304.3533975) Almasan, P. et al. (2022) Network digital twin: context, enabling technologies, and opportunities. IEEE Communications Magazine, 60(11), pp. 22-27. (doi: 10.1109/mcom.001.2200012) 2021 Varghese, B. et al. (2021) Revisiting the arguments for edge computing research. IEEE Internet Computing, 25(5), pp. 36-42. (doi: 10.1109/MIC.2021.3093924) Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Fowler, Simon ORCID: https://orcid.org/0000-0001-5143-5475, Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 and Gay, Simon J. ORCID: https://orcid.org/0000-0003-3033-9091 (2021) Multiparty Session Types for Safe Runtime Adaptation in an Actor Language. [Artefact] Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Fowler, Simon ORCID: https://orcid.org/0000-0001-5143-5475, Dardha, Ornela ORCID: https://orcid.org/0000-0001-9927-7875 and Gay, Simon J. ORCID: https://orcid.org/0000-0003-3033-9091 (2021) Multiparty Session Types for Safe Runtime Adaptation in an Actor Language. In: 35th European Conference on Object Oriented Programming (ECOOP 2021), 12-17 Jul 2021, (doi: 10.4230/LIPIcs.ECOOP.2021.10) Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Tatar, Alexandru, Imai, Pierre, Wong, Leon and Bringuier, Laurent (2021) Evolutionary autonomous networks. Journal of ICT Standardization, 9(2), pp. 201-228. (doi: 10.13052/jicts2245-800x.927) 2020 Intharawijitr, Krittin, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X and Imai, Pierre (2020) A Feasibility Study of Cache in Smart Edge Router for Web-Access Accelerator. In: 2020 IEEE/ACM 13th International Conference on Utility and Cloud Computing (UCC), 07-10 Dec 2020, pp. 360-365. ISBN 9780738123943 (doi: 10.1109/UCC48980.2020.00057) Lockhart, Luke, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Imai, Pierre, Willis, Peter and Varghese, Blesson (2020) Scission: Performance-driven and Context-aware Cloud-Edge Distribution of Deep Neural Networks. In: ",
  "content_length": 25077,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:51"
}