{
  "name": "Paul Barford",
  "homepage": "http://pages.cs.wisc.edu/~pb",
  "status": "success",
  "content": "Paul Barford Paul Barford Department Chair and Carl de Boor Professor Computer Sciences Department 1205 University Ave Madison, WI  53706 Email:  pb AT cs.wisc.edu Voice: (608) 262-6609 CV | Publications | Software & Data Paul Barford is a professor of Computer Sciences at the University of Wisconsin - Madison where he is a member of the networking group and the founder and director of the Wisconsin Advanced Internet Laboratory. He received his B.S. in Electrical Engineering from the University of Illinois and his Ph.D. in Computer Science from Boston University. He was a visiting professor at the Computer Laboratory at the University of Cambridge, a visiting fellow at Wolfson College and an EPSRC visiting fellow. He was also a visiting scholar at Wolfson College at University of Oxford. Prof. Barford worked in industry for 8 years prior to his academic career. He has been a consultant to companies and frequently gives talks and seminars on computer networking and security issues. He was the founder and CEO of Nemean Networks LLC., which developed network intrusion detection technology. Nemean was acquired by Qualys Inc. where he served as Chief Scientist.  Prof. Barford was also co-founder and Chief Scientist of Mdotlabs LLC., which developed fraud detection services for on-line advertising.  Mdot was acquired by comScore Inc. where he served as Chief Scientist. Prof. Barford's research interests are in computer networking and communications with a focus on measurement and analysis of Internet data, protocols and topological structure. He also investigates Internet security including detection and identification of fraud, traffic anomalies, malicious attacks and intrusions. His research activities have been supported by the NSF, DHS, ARO, Cisco, and Intel among others. Prof. Barford has served on numerous government panels. He has also served on executive, organizing and technical program committees of many different networking and IT security workshops and conferences including ACM SIGCOMM ('13 PC chair), ACM SIGMETRICS ('10 PC chair) and ACM IMC ('06 PC chair). He served on the board of directors of the National Lambdarail, as an associate editor for IEEE/ACM Transactions on Networking and as co-chair of the GENI Instrumentation and Measurement working group. \"We especially need imagination in science. It's not all mathematics, nor all logic, but it is somewhat beauty and poetry.\" - Maria Mitchell \"When people ask me why I run, I tell them that a lot of people run races to see who's the fastest. I run races to see who has the most guts.\" - Steve Prefontaine",
  "content_length": 2606,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:40"
}