{
  "name": "Paul Medvedev",
  "homepage": "http://bmb.psu.edu/directory/pzm11",
  "status": "success",
  "content": "Department of Biochemistry and Molecular Biology | Eberly College of Science Skip to main content Department of Biochemistry and Molecular Biology (BMB) Probing the behaviors of molecules, cells, and biological systems. Undergraduate Programs Learning about genomics, cloning, stem cells, cancer biology, microarrays, emerging diseases, and neurodegenerative diseases. BMB majors lead to exciting and rewarding careers! EXPLORE OUR PROGRAMS! Make discoveries and generate new knowledge through independent, original dissertation research in biochemistry, microbiology, and molecular biology (BMMB) laboratories. EXPLORE THE GRADUATE PROGRAM! BMMB Graduate Program Department News Spotlight Learn more $17.9M NIH grant to research neurodevelopment disorders Learn more Cancer drug could treat early-stage Alzheimer’s disease, study shows Learn more Disrupting parasite gene regulation reveals new malaria intervention strategy View more news stories Biochemistry and Molecular Biology Department Our faculty are recognized leaders in their fields and are dedicated to their research as well as educating the next generation of scientists. Featured Faculty See all Departmental Faculty Song Tan Verne M. Willaman Professor of Molecular Biology Learn More About Song Ying Gu Associate Department Head for Graduate Education and Professor of Biochemistry and Molecular Biology Learn more about Ying Melanie McReynolds Assistant Professor of Biochemistry and Molecular Biology, and Dorothy Foehr Huck and J. Lloyd Huck Early Career Chair in Biochemistry and Molecular Biology Learn More About Melanie Join Our Department The Department of Biochemistry and Molecular Biology at Penn State invites applications for multiple tenure-track assistant professor appointments in the broad areas of microbiology—including bacteriology, mycology, parasitology, and virology—and genetics and cell and developmental biology. View faculty positions in microbiology View faculty positions in genetics and cell and developmental biology",
  "content_length": 2016,
  "method": "requests",
  "crawl_time": "2025-12-01 14:09:55"
}