{
  "name": "Paulo R. F. Cunha",
  "homepage": "https://www.cin.ufpe.br/~prfc",
  "status": "success",
  "content": "Paulo Roberto Freire Cunha Paulo Roberto Freire Cunha Bolsista de Produtividade em Pesquisa do CNPq - Nível 1A Possui Graduação em Engenharia Elétrica pela Universidade Federal de Pernambuco (1974), Mestrado em Ciências da Computação pela Universidade Federal de Pernambuco (1977) e Doutorado em Ciência da Computação - University of Waterloo (1981). Atualmente é Professor Titular da Universidade Federal de Pernambuco, Consultor, Assessor do Conselho Nacional de Desenvolvimento Científico e Tecnológico, Consultor da Fundação Centro de Pesquisa e Desenvolvimento em Telecomunicações-CPqD, Membro da Sociedade Brasileira de Computação desde 1982 e Consultor, Assessor da Coordenação de Aperfeiçoamento de Pessoal de Nível Superior. Foi Pró-Reitor de Pesquisa e Pós-Graduação da Universidade Federal de Pernambuco de 1995/2003 e atualmente, é Diretor do Centro de Informática-CIn da Universidade Federal de Pernambuco. Tem Experiência na área de Ciência da Computação, com ênfase em Sistemas de Computação, Redes e Sistemas Distribuídos. Linhas de Pesquisas Sistemas Distribuídos Redes de Computadores Engenharia de Software (Pesquisas Básica e Aplicada) Publicações Recentes Trabalhos completos publicados em anais de congressos A. C. Soares ; W. F. GIOZZA ; CUNHA, P. R. F. . TONeTS: Símulador para Avaliação de Desempenho de Redes Ópticas Transparentes. In: Anais do WPerformance, 2007, Rio de Janeiro. Anais do WPerformance, 2007. A. C. Soares ; CUNHA, P. R. F. . A New Approach for Performance Evaluation of Survivability Services in All-Optical Networks. In: Proceedings of the IEEE International Conference on Telecommunications, 2007, Malaysia . Proceedings of the IEEE International Conference on Telecommunications, 2007. Rosa, N. S. ; CUNHA, P. R. F. . Behavioural Specification of Wireless Sensor Network Applications. In: Proceedings of the IEEE International Global Information Infrastructure Symposium, 2007, Marrakech. Proceedings of the IEEE International Global Information Infrastructure Symposium, 2007. Rosa, N. S. ; CUNHA, P. R. F. . A LOTOS Framework for Middleware Behaviour Specification. In: Proceedings of the 26th IFIP International Conference on Formal Methods for Networked and Distributed Systems, FORTE´06, 2006, París. Proceedings of the 26th IFIP International Conference on Formal Methods for Networked and Distributed Systems, FORTE´06. París : Lecture Notes in Computer Science, 2006. v. 4229. Artigos completos publicados em periódicos CUNHA, P. R. F. ; Rosa, N. S. . A Formal Framework for Middleware Behavioural Specification. ACM Software Engineering Notes, v. 32, p. 1-7, 2007. Rosa, N. S. ; CUNHA, P. R. F. . Using LOTOS for Formalising Wireless Sensor Network Aplications. Sensors (Basel), v. 7, p. 1-12, 2007. Rosa, N. S. ; CUNHA, P. R. F. . Behavioural Specification of Middleware Systems. Journal of the Brazilian Computer Society, v. 12, p. 62-74, 2006. SOUSA, C. T. ; CUNHA, P. R. F. . A Calculus for Reconfigurable Component-Based Systems. CLEI Electronic Journal, v. 7, p. 20-32, 2005 CUNHA, P. R. F. ; ROSA, N S . A Software Architecture - Based Approach for Formalising Middleware Behavior. Electronic Notes In Theoretical Computer Science, v. 95, p. 24-37, 2004. Endereço Universidade Federal de Pernambuco - UFPE Centro de Informática / Departamento de Sistemas de Computação. Av. Prof. Luiz Freire, s/n - Cidade Universitária 50740540 - Recife, PE - Brasil - Caixa-Postal: 7851 Telefone: (81) 2126-8430 Ramal: 4004 Fax: (81) 2126-8438 E-mail prfc@cin.ufpe.br",
  "content_length": 3515,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:17"
}