{
  "name": "Pavan K. Turaga",
  "homepage": "https://pavanturaga.com",
  "status": "success",
  "content": "Pavan Turaga – Arizona State University Skip to content Keynote on “Trends in generative AI” at DokuTech 2023.AME 294 Martial Arts and Motion CaptureASU Founders’ Day Award Ceremony, 2025We are part of a NSF ExpandAI award connecting ASU with UT-Austin’s Institute for Foundations of Machine Learning (IFML) on the topic of pervasive systems.WACV 2025 paper `Deep Geometric Moments Promote Shape Consistency in Text-to-3D Generation’Improving Shape Awareness and Interpretability in Deep Networks Using Geometric Moments, Best paper at DLGC Workshop 2023, in conjunction with IEEE CVPR.RagaAI webinar on LLM evaluation and product launch, March 2024MesquiteMocap: web-based open-source, low-cost motion capture solutions using IMU devices and javascript.The Air Around Us: network of IoT sculptures to actionize the impact of air quality in the Phoenix metro area deployed in local museums.CVPR 2023 Art Track Spotlight Video, made with VQ-GAN and depth-estimation. Pavan Turaga is the Founding Director of The GAME School at Arizona State University (2025). In this role they oversee a transdisciplinary group of faculty and degree programs, spanning gaming, esports, interactive, immersive and AI-enabled media creation. They hold a Joint Professor appointment between The GAME School and Electrical Engineering (ECEE). Their teaching portfolio in this role has included classes like Machine Learning for Media Arts, Machine Vision and Pattern Recognition, Martial Arts and Motion Capture, and Creating Games with Artificial Intelligence. To advance research, they created the Geometric Media Lab (Linkedin Page), where the work spans tools for representation drawn from statistics, optimization, geometry, and topology, and applied to the areas of computer vision, machine learning, immersive technologies, health-analytics, public understanding of science, arts and performance, and more. Their work included extensive collaborations with applied mathematicians, statisticians, health-scientists, and media-arts that informs their work and increases its impact. They have received several awards and grants through their career. Follow on social media: Twitter  LinkedIn Positions Founding Director, The GAME School (ASU), 2025 – presentDirector, School of Arts, Media, and Engineering (ASU), 2021 – 2025 Professor, Schools of AME + ECEE (ASU), 2022 – present Interim Director, School of Arts, Media, and Engineering (AME), 2019 – 2021Associate Professor, Schools of AME + ECEE, 2017 – 2022Assistant Professor, Schools of AME + ECEE, 2011 – 2017 Professional PreparationResearch Associate, Center for Automation Research (UMD), 2009 – 2011Ph.D. University of Maryland, College Park, 2004 – 2009B.Tech Indian Institute of Technology, Guwahati, 2000 – 2004 Affiliations Health Solutions Ambassador, College of Health Solutions (CHS)Center for Sensor, Signal, Information Processing (SenSIP)Center for Human, Artificial Intelligence, and Robot Teaming (CHART)Center for Innovation in Healthy and Resilient Aging (CIHRA)Simon A Levin Mathematical, Computational and Modeling Sciences Center (MCMSC)Cognitive Science ProgramCenter for Wireless Information Systems and Computational Architectures (WISCA) ASU Graduate faculty privileges Data Science, Analytics and Engienering (DSAE) PhD ProgramComputer Engineering (Computer Systems) PhD (Endorsed to Chair)Computer Engineering (Electrical Engineering) PhD (Endorsed to Chair)Electrical Engineering PhD (Endorsed to Chair)Systems Engineering PhD (Endorsed to Chair)Media Arts and Sciences PhD (Endorsed to Chair)Exploration Systems Design PhD (Endorsed as Member) We gratefully acknowledge the support received by several federal and industry grants over the years in support of our research. Current and prior support has included NSF, NIH, DARPA, DOE, ARO, ONR, Adobe Intel, Google ATAP, Raytheon, NVIDIA. Media Articles ASU News, Entrepreneurs, researchers among 2025 Founders’ Day awardees, Jan 17th 2025. ASU News, Team wins $10M XPRIZE Rainforest competition for novel solution, Nov 19th, 2024. University of Maryland, College Park, ECE Announces Recipients of 2024 Distinguished Alumni Awards, Nov 15th, 2024. ASU News, ASU researchers receive $2.8M grant to harness the power of AI for health, Jul 8th 2024. Diversity in Action, Diverse Voices, May/June 2024. ASU News, A massive unveiling of creativity, Mar 22nd 2024. ASU News, Summit explores digital trust in the accelerating age of AI, Oct 25th 2023. AZ Big Media, Here’s how experts see the role of AI in higher education, July 5th 2023. ASU News, Predicting future pandemic patterns, Nov 18th 2022. ASU News, ASU professor wins $1M DoD grant to boost AI technology, Apr 26th 2022. ASU News, New SUEDE shoes apply smart tech to ankle injury prevention, Apr 6th 2022. Podcast, AZ State Press, State Press Play: Tech’s ethical quandary, Oct 15th 2021. AZ State Press, Tech’s ethical quandary, Oct 6th 2021. AZ Big Media, “How ASU students will be empowered by ‘technofluency’“, July 21st 2021. ASU News, “ASU students to be empowered by ‘technofluency’“, July 16th 2021. Photonics Media, “Image Recovery Method Shows Improved Compressive Sensing, Phase Retrieval Capabilities“, Feb 2021. TWIML AI Rewind 2020, “Trends in Computer Vision with Pavan Turaga“, Jan 4th 2021. NSF Future of Work grant, “ASU researchers awarded grant for advancing workplace wellness“, Sep 9th 2020. NSF IUCRC Breakthrough Story, “New Technique Provides Faster, Lower-Cost Detection in Surveillance Images”, July 22nd 2020. TWIML AI Podcast, “Invariance, Geometry and Deep Neural Networks with Pavan Turaga” June 25th 2020. NSF RAPID grant on COVID modeling, “NSF grant to help ASU researchers design a new way to model the spread of COVID-19“ ASU Now, “Arts, Media and Engineering students tackle the big ‘why’ questions“ ASU Now and FullCircle, “Data, data everywhere, but not enough to think“ ASU Now “Reimagined hospital bed minimizes risk of pressure ulcers, Online team’s invention wins the Palais Senior Design Prize” Sacramento Bee, “Elk Grove stay-at-home dad leads fellow online students to create innovative hospital bed” Arizona State Press, “ASU’s College of Health Solutions, Herberger Institute collaborate on interdisciplinary projects” ASU Now,  “New ASU center confronts the silver tsunami” FullCircle ASU, “Young engineering faculty rapidly building a track record of innovation and high performance” ASU Now, “Research on human movement could lead to development of ‘assistive homes” News: Pavan TuragaDARPA TIAMAT We are part of a team led by Johns Hopkins, funded by the DARPA TIAMAT program, to develop new techniques for autonomy transfer! https://iaa.jhu.edu/multimillion-dollar-darpa-grant-to-support-transfer-of-autonomy-between-environments/ ExpandAI Award: ASU + UT-Austin IFML on Pervasive Systems We are proud to be part of the ExpandAI award with the UT-Austin NSF AI Institute on the Foundations of Machine Learning (IFML). The awards are aimed at “Expanding AI Innovation through Capacity Building and Partnerships program, NSF is supporting projects that are diversifying AI research across the U.S.” The ASU award will leverage expertise […] RagaAI webinar on LLMs Honored to participate in RagaAI LLM Hub product launch, and webinar on LLM testing. Trends in Generative AI at Doku.tech Looking forward to DOKU.TECH 2023 to present ongoing trends in generative AI in the creative industries. Focus is on the basic methods and their limitations, and how research continues to advance. PIPP Workshop, October 13th We are happy to host a workshop on October 13th 2023 to convene our interdisciplinary team developing a vision for future pandemic preparedness. Pls click the link to learn more. CVPR 2023 We are pleased to bring a diverse set of work spanning geometry, generative-AI, and AI-art to CVPR2023. Main conference paper + highlight: PolyINR https://lnkd.in/d7v6uCpi (Rajhans Singh and Ankita Shukla) Deep learning for Geometric Computing workshop paper: Deep Geometric Moment https://lnkd.in/d6tRkeZQ (Rajhans Singh and Ankita Shukla) Generative Models for Computer Vision workshop paper with Adobe Research […] NSF Predictive Intelligence for Pandemic Prevention We received a 18 month Phase 1 planning grant from the NSF PIPP program, with a large team consisting of Patricia Solis (KER + SGSUP), Visar Berisha (CHS + ECEE), Giulia Pedrielli (SCAI), Gautam Dasarathy (ECEE), Lalitha Sankar (ECEE), Daniel Rivera (SEMTE), Laimonas Kelbauskas (KE), Ni Trieu (SCAI + BioDesign), Michael Simeone (ASU Library Data Science and Analytics), Timothy […] Subscribe Subscribed Pavan Turaga Sign me up Already have a WordPress.com account? Log in now. Pavan Turaga Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar",
  "content_length": 8816,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:22"
}