{
  "name": "Pavel Skums",
  "homepage": "https://engineering.uconn.edu/person/pavel-skums",
  "status": "success",
  "content": "Skums, Pavel | College of Engineering Our websites may use cookies to personalize and enhance your experience. By continuing without changing your cookie settings, you agree to this collection. For more information, please see our University Websites Privacy Notice. UConn Cookie Information What are Cookies? Authentication Cookies Analytics Cookies Opt Out Web cookies (also called HTTP cookies, browser cookies, or simply cookies) are small pieces of data that websites store on your device (computer, phone, etc.) through your web browser. They are used to remember information about you and your interactions with the site. Purpose of Cookies: Session Management: Keeping you logged in Remembering items in a shopping cart Saving language or theme preferences Personalization: Tailoring content or ads based on your previous activity Tracking & Analytics: Monitoring browsing behavior for analytics or marketing purposes Types of Cookies: Session Cookies: Temporary; deleted when you close your browser Used for things like keeping you logged in during a single session Persistent Cookies: Stored on your device until they expire or are manually deleted Used for remembering login credentials, settings, etc. First-Party Cookies: Set by the website you're visiting directly Third-Party Cookies: Set by other domains (usually advertisers) embedded in the website Commonly used for tracking across multiple sites Authentication cookies are a special type of web cookie used to identify and verify a user after they log in to a website or web application. What They Do: Once you log in to a site, the server creates an authentication cookie and sends it to your browser. This cookie: Proves to the website that you're logged in Prevents you from having to log in again on every page you visit Can persist across sessions if you select \"Remember me\" What's Inside an Authentication Cookie? Typically, it contains: A unique session ID (not your actual password) Optional metadata (e.g., expiration time, security flags) Analytics cookies are cookies used to collect data about how visitors interact with a website. Their primary purpose is to help website owners understand and improve user experience by analyzing things like: How users navigate the site Which pages are most/least visited How long users stay on each page What device, browser, or location the user is from What They Track: Some examples of data analytics cookies may collect: Page views and time spent on pages Click paths (how users move from page to page) Bounce rate (users who leave without interacting) User demographics (location, language, device) Referring websites (how users arrived at the site) Here’s how you can disable cookies in common browsers: 1. Google Chrome Open Chrome and click the three vertical dots in the top-right corner. Go to Settings > Privacy and security > Cookies and other site data. Choose your preferred option: Block all cookies (not recommended, can break most websites). Block third-party cookies (can block ads and tracking cookies). 2. Mozilla Firefox Open Firefox and click the three horizontal lines in the top-right corner. Go to Settings > Privacy & Security. Under the Enhanced Tracking Protection section, choose Strict to block most cookies or Custom to manually choose which cookies to block. 3. Safari Open Safari and click Safari in the top-left corner of the screen. Go to Preferences > Privacy. Check Block all cookies to stop all cookies, or select options to block third-party cookies. 4. Microsoft Edge Open Edge and click the three horizontal dots in the top-right corner. Go to Settings > Privacy, search, and services > Cookies and site permissions. Select your cookie settings from there, including blocking all cookies or blocking third-party cookies. 5. On Mobile (iOS/Android) For Safari on iOS: Go to Settings > Safari > Privacy & Security > Block All Cookies. For Chrome on Android: Open the app, tap the three dots, go to Settings > Privacy and security > Cookies. Be Aware: Disabling cookies can make your online experience more difficult. Some websites may not load properly, or you may be logged out frequently. Also, certain features may not work as expected. Close UConn College of Engineering COE Search University of Connecticut Search UConn Search University Communications Search UConn Search UConn A to Z Index UConn A to Z Index Click to open menu Associate Professor, School of Computing Email pavel.skums@uconn.edu Mailing Address University of Connecticut 371 Fairfield Way, Unit 4155 Storrs, CT 06269-4155 Campus Storrs Link Affiliation Website Google Scholar Link Overview Research Interests Projects Teaching Publications Related News Fellows Brief Bio Discrete Mathematics Computational Genomics Bioinformatics Mathematical Biology Computational Biology and Bioinformatics, Epidemiology, Machine Learning, Algorithms and Optimization, Graph and Network Theory Eleven grand challenges in single-cell data science D Lähnemann, J Köster, E Szczurek, DJ McCarthy, SC Hicks, ... Genome biology 21 (1), 1-35 Good laboratory practice for clinical next-generation sequencing informatics pipelines AS Gargis, L Kalman, DP Bick, C Da Silva, DP Dimmock, BH Funke, ... Nature biotechnology 33 (7), 689-693 Technology dictates algorithms: recent developments in read alignment M Alser, J Rotman, D Deshpande, K Taraszka, H Shi, PI Baykal, HT Yang, ... Genome biology 22 (1), 249 Efficient error correction for next-generation sequencing of viral amplicons P Skums, Z Dimitrova, DS Campo, G Vaughan, L Rossi, JC Forbi, ... BMC Bioinformatics 13 (Suppl 10), S6 Accurate genetic detection of hepatitis C virus transmissions in outbreak settings DS Campo, GL Xia, Z Dimitrova, Y Lin, JC Forbi, L Ganova-Raeva, ... The Journal of infectious diseases 213 (6), 957-965 QUENTIN: reconstruction of disease transmissions from viral quasispecies genomic data P Skums, A Zelikovsky, R Singh, W Gussler, Z Dimitrova, S Knyazev, ... Bioinformatics 34 (1), 163-170 A large HCV transmission network enabled a fast-growing HIV outbreak in rural Indiana, 2015 S Ramachandran, H Thai, JC Forbi, RR Galang, Z Dimitrova, G Xia, Y Lin, ... EBioMedicine 37, 374-381 Next-generation sequencing reveals large connected networks of intra-host HCV variants DS Campo, Z Dimitrova, L Yamasaki, P Skums, DTY Lau, G Vaughan, ... BMC genomics 15 (Suppl 5), S4 Epidemiological data analysis of viral quasispecies in the next-generation sequencing era S Knyazev, L Hughes, P Skums, A Zelikovsky Briefings in bioinformatics 22 (1), 96-108 Unlocking capacities of genomics for the COVID-19 response and future pandemics S Knyazev, K Chhugani, V Sarwal, R Ayyala, H Singh, S Karthikeyan, ... Nature Methods 19 (4), 374-380 Benchmarking of computational error-correction methods for next-generation sequencing data K Mitchell, JJ Brito, I Mandric, Q Wu, S Knyazev, S Chang, LS Martin, ... Genome biology 21 (1), 71 Accurate assembly of minority viral haplotypes from next-generation sequencing through efficient noise reduction S Knyazev, V Tsyvina, A Shankar, A Melnyk, A Artyomenko, T Malygina, ... Nucleic acids research 49 (17), e102-e102 Antigenic cooperation among intrahost HCV variants organized into a complex network of cross-immunoreactivity P Skums, L Bunimovich, Y Khudyakov Proceedings of the National Academy of Sciences 112 (21), 6653-6658 GHOST: global hepatitis outbreak and surveillance technology AG Longmire, S Sims, I Rytsareva, DS Campo, P Skums, Z Dimitrova, ... BMC genomics 18 (Suppl 10), 916 Reconstruction of viral population structure from next-generation sequencing data using multicommodity flows P Skums, N Mancuso, A Artyomenko, B Tork, I Mandoiu, Y Khudyakov, ... BMC bioinformatics 14 (Suppl 9), S2 From alpha to zeta: Identifying variants and subtypes of sars-cov-2 via clustering A Melnyk, F Mohebbi, S Knyazev, B Sahoo, R Hosseini, P Skums, ... Journal of Computational Biology 28 (11), 1113-1129 CliqueSNV: an efficient noise reduction technique for accurate assembly of viral variants from NGS data S Knyazev, V Tsyvina, A Shankar, A Melnyk, A Artyomenko, T Malygina, ... bioRxiv 264242 Analysis of the evolution and structure of a complex intrahost viral population in chronic hepatitis C virus mapped by ultradeep pyrosequencing BA Palmer, Z Dimitrova, P Skums, O Crosbie, E Kenny-Walsh, LJ Fanning Journal of virology 88 (23), 13709-13721 Inference of genetic relatedness between viral quasispecies from sequencing data O Glebova, S Knyazev, A Melnyk, A Artyomenko, Y Khudyakov, ... BMC genomics 18 (Suppl 10), 918 Graph fractal dimension and the structure of fractal networks P Skums, L Bunimovich Journal of complex networks 8 (4), cnaa037",
  "content_length": 8686,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:27"
}