{
  "name": "Pavel Hubácek",
  "homepage": "https://iuuk.mff.cuni.cz/~hubacek",
  "status": "success",
  "content": "Pavel Hubáček Search Pavel Hubáček Assistant Professor Czech Academy of Sciences Charles University About I am a member of the Department of Mathematical Logic and Theoretical Computer Science at the Institute of Mathematics of the Czech Academy of Sciences. I am also a member of the Computer Science Institute of Charles University at the Faculty of Mathematics and Physics. My research is in theoretical computer science with a focus on problems at the intersection of cryptography, computational complexity, and game theory. Interests Theoretical Computer Science Cryptography Computational Complexity Education PhD in Computer Science - Cryptography, 2014 Aarhus University, Denmark Recent Publications DBLP Pavel Hubáček, Jan Václavek (2021). On Search Complexity of Discrete Logarithm. 46th International Symposium on Mathematical Foundations of Computer Science, MFCS 2021, August 23-27, 2021, Tallinn, Estonia. PDF Cite DOI Iddo Bentov, Pavel Hubáček, Tal Moran, Asaf Nadler (2021). Tortoise and Hares Consensus: The Meshcash Framework for Incentive-Compatible, Scalable Cryptocurrencies. Cyber Security Cryptography and Machine Learning - 5th International Symposium, CSCML 2021, Be’er Sheva, Israel, July 8-9, 2021, Proceedings. PDF Cite DOI Pavel Hubáček, Eylon Yogev (2020). Hardness of Continuous Local Search: Query Complexity and Cryptographic Lower Bounds. SIAM J. Comput.. PDF Cite DOI Pavel Hubáček, Chethan Kamath, Karel Král, Veronika Slívová (2020). On Average-Case Hardness in TFNP from One-Way Functions. Theory of Cryptography - 18th International Conference, TCC 2020, Durham, NC, USA, November 16-19, 2020, Proceedings, Part III. PDF Cite DOI See all publications Seminars and Teaching Join our Seminar on Theory of Computing (Seminář z teoretické informatiky)! 👩‍🏫🍕👨‍🏫 During the fall term of 2023, I am teaching the following course at Charles University: Foundations of Theoretical Cryptography Students I am always looking for motivated students of all levels interested in cryptography and computer security or computational complexity. Contact me via email to discuss possible topics for a research project. I had the chance to work with and supervise exceptional students in the past: PhD Veronika Slívová (2017 - 2021, → Google) On the complexity of search problems with a unique solution Master Kateřina Bžatková (2022) Multivariate polynomial commitment schemes Tomáš Krňák (2022) Verifiable delay functions from Lucas sequences Ľubica Jančová (2022) Effectivity and limitations of homomorphic secret sharing schemes Jan Václavek (2021, Dean’s prize for outstanding thesis) On search complexity of discrete logarithm Bachelor Martin Pastyřík (2021, 2nd place in student competition KEYMAKER 2021) Security of cryptographic schemes for contact tracing Petr Sedláček (2021, 3rd place in student research competition SVOČ 2021) Limitations of incompressible encodings Tomáš Krňák (2019) Moderní aplikace zero-knowledge protokolů Contact hubacek@iuuk.mff.cuni.cz Institute of Mathematics of the Czech Academy of Sciences, Žitná 25, Praha 1, 115 67 Office 523 – back building, 2nd floor Cite × Copy Download",
  "content_length": 3139,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:24"
}