{
  "name": "Pavel A. Pevzner",
  "homepage": "http://cseweb.ucsd.edu/~ppevzner",
  "status": "success",
  "content": "Home Pavel Pevzner Ronald R. Taylor Chair and Distinguished Professor of Computer Science University of California at San Diego Howard Hughes Medical Institute Professor Pavel Pevzner Ronald R. Taylor Chair and Distinguished Professor of Computer Science University of California at San Diego Howard Hughes Medical Institute Professor Pavel Pevzner is the Ronald R. Taylor Chair and Distinguished Professor of Computer Science and Engineering at University of California, San Diego. He holds Ph.D. from Moscow Institute of Physics and Technology in Russia. He was named Howard Hughes Medical Institute Professor in 2006. He was elected the Association for Computing Machinery Fellow (2010) for \"contribution to algorithms for genome rearrangements, DNA sequencing, and proteomics”, International Society for Computational Biology Fellow (2012), European Academy of Sciences (2016), and American Association for Advancement in Sciences (2018). He was awarded a Honoris Causa (2011) from Simon Fraser University in Vancouver and honorary doctorate from Tel Aviv University. Hewas a recipient of the Senior Scientist Award from the International Society for Computational Biology (2017), and the Kanellakis Theory and Practice Award from the Association for Computing Machinery (2019). Dr. Pevzner co-authored textbooks \"Computational Molecular Biology: An Algorithmic Approach\", \"Introduction to Bioinformatics Algorithms\", “Bioinformatics Algorithms: an Active Learning Approach”, and Learning Algorithms Through Programming and Puzzle Solving  (2019). In 2015, jointly with Phillip Compeau, he developed a Bioinformatics bioinformatics specialization on Coursera. In 2016, he co-developed a Data Structures and Algorithms specialization on Coursera and MicroMaster Program at EdX. READ MORE ABOUT THE BOOK It is impossible to imagine modern biology without computational ideas developed by bioinformatics pioneers in the last three decades. Today, computational molecular biology remains a wild frontier with still unexplored boundaries. Bioinformatics is often defined as applications of computers in biology. We respectfully disagree: reducing bioinformatics to applications of computers in biology diminishes the rich intellectual content of bioinformatics. Indeed, bioinformatics has become a part of modern biology and often dictates new fashions, enables new approaches, and drives further biological developments. Our lab is well equipped with the appropriate gear and ammunition to continue explorations of uncharted bioinformatics territories. University of California, San Diego 9500 Gilman Drive, EBU3b 4236 La Jolla, CA 92093-0404 Email:  ppevzner@ucsd.edu Phone: (858) 822-4365 Menu HOME RESEARCH Genome Sequencing Proteomics and Immunoproteogenomics Antibiotics Discovery Comparative Genomics EDUCATION My Teaching Philosophy Online Courses NEWS PAPERS BOOKS PRESENTATIONS PEOPLE Lab Members Alumni SOFTWARE Genome sequencing Proteomics / Immunoproteogenomics Antibiotics Discovery Comparative genomics CONTACT",
  "content_length": 3024,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:26"
}