{
  "name": "Pavithra Prabhakar",
  "homepage": "http://people.cs.ksu.edu/~pprabhakar/home.html",
  "status": "success",
  "content": "Pavithra Prabhakar's Home Page Home Service Group Publications By Year By Category By Topic Biographical sketch Teaching Contact Email: pprabhakar@ksu.edu Web: http://people.cs.ksu.edu/~pprabhakar Mail: Pavithra Prabhakar 2184 Engineering Hall Manhattan, KS, 66503 Pavithra Prabhakar Ph.D., University of Illinois at Urbana-Champaign Peggy and Gary Edwards Chair in Engineering Professor Department of Computer Science Kansas State University Research Interests Formal verification and synthesis of autonomous and cyber-physical systems; Formal analysis of AI-based controllers; Applications in robotics, aerospace systems, autonomous vehicles and agricultural automation (Research Opportunities) Multiple PhD and postdoctoral fellowships are available. Students and postdocs with strong mathematical background interested in PhD in formal methods, robotics and/or cyber-physical systems are encouraged to get in touch along with their CV. Recent News [09/21] Honored to receive the Dean's Award for Excellence in Research for the year 2021. [08/21] Spandan Das and Jahid Chowdhury join our group. [08/21] Ratan graduated with his PhD and started an assistant professor position at the Northwest Missouri State University. [07/21] Gave an invited talk at the Army Research Office Symposium on Stochastic Hybrid Systems. [07/21] Paper on Formally Verified Switching Logic for Recoverability of Aircraft Controller presented at CAV. [07/21] Ratan receives the first Distinguished Graduate Research Award from the department, the highest award for excellence in publication by the department. [05/21] Paper on Time-Optimal Multi-Quadrotor Trajectory Planning for Pesticide Spraying presented at ICRA 2021. [05/21] Ratan receives the first Excellence in Research Award from the department. [05/21] Honored to be visiting the Indian Institute of Science as the Satish Dhawan Visiting Chair Professor. [05/21] Gave an invited talk at the Isaac Newton Institute Workshop on Verified Software: from theory to practice. [07/20] Gave a Keynote talk at the Verification of Neural Networks workshop at CAV. See the video here. [07/20] Invited for a visiting position at the Simons Institute at UC Berkeley for Spring 2021. [07/20] Invited speaker at the Cyber-Physical Systems Symposium at IISc, Bangalore. [05/20] Two papers presented at the NASA Formal Methods Symposium. [04/20] Received an NSF grant from the core program for investigating scalable methods for providing provable guarantees of AI based CPS. [04/20] Received a NASA grant for investigating an evolving and certifiable autopilot for unmanned aerial vehicles with KU and DARCorporation. [04/20] Gave an Invited talk at the Washington University at St. Louis. [10/19] Ratan and Zahra receive the Outstanding Research Publication Award from the department. [08/19] Ratan and Zahra receive the first Outstanding Research Publication Award. [08/19] Paper on abstraction based analysis of neural networks accepted at the Neurips'19. [07/19] Paper accepted at the EMSOFT'19. [04/19] Ratan receives the Gattani Outstanding Graduate Student Award. Congratulations!! [01/19] Paper accepted at the robotics conference ICRA'19. [12/18] Miriam receives one of the three 2016/17 UPM PhD thesis awards. Congratulations!! [09/18] Paper accepted at 39th IEEE Real-Time Systems Symposium (RTSS). [07/18] Paper accepted at 56th Annual Allerton Conference on Communication, Control and Computing. [07/18] Two papers accepted at QESTâ18 and CONCURâ18. [04/18] Co-chairing HSCCâ19 , the 22nd ACM International Conference on Hybrid Systems: Computation and Control with Necmiye Ozay (Univ. Michigan). Submit your best papers! [01/18] Serving on the PC of CAV'18 and EMSOFT'18. [12/17] Tool paper on Algorithmic Verification for Stability (AVERIST) accepted at HSCC'18 (CPSWeek'18). [09/17] Served on the Cyber-Physical Systems Agriculture panel at the CPS PI Meeting. [09/17] Gave an invited talk at the University of Southern California Cyber-Physical Systems Seminar Series. [08/17] Co-chairing FORMATS'18, the 16th International Conference on Formal Modelling and Analysis of Timed Systems Submit your best papers! [07/17] Miriam García Soto successfully defended her thesis. Congratulations! [07/17] Co-organized the Verification Mentoring Workshop at CAV'17 (Thanks to NSF). [07/17] Two papers accepted at CDC'17. [07/17] Invited speaker at the Cyber-Physical Systems Symposium at IISc, Bangalore. [07/17] Honored to be named the Peggy and Gary Edwards Chair in Engineering. [03/17] Promoted to Associate Professor with Tenure (Announcement). [02/17] Received the Young Investigator Award from the Office of Naval Research (ONR YIP). [01/17] Named the Michelle Munson-Serban Simu Keystone Research Faculty Scholar (More). [12/16] Co-organizing the second workshop on Design and Analysis of Robust Systems co-located with CAV'17. [12/16] Paper on hybridization for nonlinear hybrid systems accepted at TACAS'17. [12/16] Paper on abstractions for stochastic hybrid systems accepted at ICCPS'17. [12/16] Two papers on Stabilizable Controller Synthesis and Robust Verification accepted at HSCC'17. [12/16] Invited talk at the AVERTS workshop (Co-located with FSTTCS'16 in Chennai, India) [10/16] Serving on the PC of CAV'17. [09/16] Co-organizing Dagstuhl seminar on Robustness in Cyber-Physical Systems. [09/16] Serving on the PC of QEST'17. [06/16] Paper on Global Asymptotic Stability verification accepted at EMSOFT'16. [04/16] Paper on CEGAR for stability analysis accepted at CAV'16. [03/16] Awarded Summer Faculty Fellowship from Air Force Research Lab. [02/16] Invited speaker at the Mysore Workshop on Trends and Challenges in Quantitative Verification. [01/16] Received the NSF CAREER Award for Robust Verification of Cyber-Physical Systems. (More.) More",
  "content_length": 5805,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:28"
}