{
  "name": "Pavlos Petoumenos",
  "homepage": "https://www.research.manchester.ac.uk/portal/pavlos.petoumenos.html",
  "status": "success",
  "content": "Pavlos Petoumenos - Research Explorer The University of Manchester Pavlos Petoumenos Dr Lecturer in Computer Architecture, Advanced Processor Technology https://orcid.org/0000-0002-1497-6536 Accepting PhD Students Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital Futures Fingerprint Dive into the research topics where Pavlos Petoumenos is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Active Learning Computer Science 100% Machine Learning Computer Science 95% Experimental Result Computer Science 93% Multicore Processor Computer Science 90% Reuse Distance Computer Science 80% Compiler Optimization Computer Science 75% User Experience Computer Science 70% Android Computer Science 70% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 29 Conference contribution 3 Article Research output per year Research output per year ESBMC v7.7: Efficient Concurrent Software Verification with Scheduling, Incremental SMT and Partial Order Reduction (Competition Contribution)Wu, T., Li, X., Manino, E., Sa Menezes, R., Gadelha, M. R., Xiong, S., Tihanyi, N., Petoumenos, P. & Cordeiro, L. C., 21 Jan 2025, (Accepted/In press) 31st International Conference on Tools and Algorithms for the Construction and Analysis of Systems.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Surface Mount Technology 100% Context Switch 33% Thread Identifier 33% Quff: A Dynamically Typed Hybrid Quantum-Classical Programming LanguageWright, C. J., Luján, M., Petoumenos, P. & Goodacre, J., 13 Sept 2024, MPLR 2024: Proceedings of the 21st ACM SIGPLAN International Conference on Managed Programming Languages and Runtimes. New York, NY: Association for Computing Machinery, p. 65-81 17 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Classical Programming 100% Quantum Program 33% Quantum Programming 33% Algebraic Representation 33% 28 Downloads (Pure) BenchPress: A Deep Active Benchmark Generator Tsimpourlas, F., Petoumenos, P., Xu, M., Cummins, C., Hazelwood, K., Rajan, A. & Leather, H., 1 Aug 2022, (Accepted/In press) International Conference on Parallel Architectures and Compilation Techniques (PACT).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Feature Space 100% Machine Learning 66% Source Codes 33% Code Generation 33% Machine Learning Technique 33% 34 Downloads (Pure) F3M: Fast Focused Function MergingStirling, S., Rocha, R. C. O., Hazelwood, K., Leather, H., O'Boyle, M. F. P. & Petoumenos, P., 6 Apr 2022, 2022 IEEE/ACM International Symposium on Code Generation and Optimization (CGO). IEEEResearch output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Search Space 100% Experimental Result 100% Exhaustive Search 100% 8 Downloads (Pure) HyBF: A Hybrid Branch Fusion Strategy for Code Size ReductionRocha, R. C. O., Saumya, C., Sundararajah, K., Petoumenos, P., Kulkarni, M. & O'Boyle, M. F. P., 19 Dec 2022, (Accepted/In press) ACM SIGPLAN 2023 International Conference on Compiler Construction.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile If-Then-Else Statement 100% Control Flow 50% Compiler Optimization 50% Downstream Cost 50% Computing Domain 50% 228 Downloads (Pure) View all 32 research outputs Datasets Artifact for F3M: Fast Focused Function MergingPetoumenos, P. (Creator), Rocha, R. (Creator) & Stirling, S. (Creator), University of Manchester Figshare, 14 Dec 2021DOI: 10.48420/17041502.v1, https://figshare.manchester.ac.uk/articles/software/Artifact_for_F3M_Fast_Focused_Function_Merging/17041502/1Dataset",
  "content_length": 4418,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:30"
}