{
  "name": "Pawan Goyal 0002",
  "homepage": "http://cse.iitkgp.ac.in/~pawang",
  "status": "success",
  "content": "Contact | Pawan Goyal Home Teaching Publications Students Pawan Goyal Professor Department of Computer Science and Engineering Indian Institute of Technology, Kharagpur, India -- 721302 Phone: +91-3222282370 (Office) Email: pawang AT cse DOT iitkgp DOT ac DOT in My Google Scholar page My CV Brief Bio I joined the Department of Computer Science and Engineering, Indian Institute of Technology, Kharagpur as an Assistant Professor on July 30th, 2013. Prior to that, I was working at INRIA Paris-Rocquencourt as a post doctoral fellow with Prof. Gérard Huet on The Sanskrit Heritage Site. I did my B. Tech. in Electrical Engineering from Indian Institute of Technology, Kanpur. I received my Ph. D. from Intelligent Systems Research Centre, Faculty of Computing and Engineering, University of Ulster, UK. My PhD advisors were Prof. Laxmidhar Behera and Prof. T. M. McGinnity. The topic of my PhD dissertation was \"Analytic Knowledge Discovery Techniques for Ad-Hoc information Retrieval and Text Summarization\". My main research interests include Text Mining, Natural Language Processing, Information Retrieval and Sanskrit Computational Linguistics. Professional Activities Senior Area Chair: EMNLP 2025, AACL-IJCNL 2025, EMNLP 2024 Academic Co-ordinator for the ACM India Summer School on Generative AI for Text at IIT Gandhinagar from June 24th - July 5th, 2024. PC Chair: BDA 2023, IndoML 2023 We organized sixth international conference on Sanskrit Computational Linguistics from October 23-25, 2019 at IIT Kharagpur. For more details, please visit this link. Senior PC / Meta-Reviewer / Area Chair: ACL ARR 2024, EMNLP 2023, AAAI 2023, AAAI 2021 News Nov 10th, 2025: Our AAAI 2022 paper, \"LeSICiN: A Heterogeneous Graph-Based Approach for Automatic Legal Statute Identification from Indian Legal Documents\" has won the Markose Thomas Memorial Award for being one of the two best research papers published from the Department of CSE, IIT Kharagpur during 2022-23. Oct 25th, 2025: Our paper, \"From Meters to Meaning: Untangling the Sanskrit Verses\" got accepted in AACL-IJCNLP'25. Sep 19th, 2025: Our paper, \"LLM Meets Diffusion: A Hybrid Framework for Crystal Material Generation\" got accepted in NeurIPS'25. August 21st, 2025: 6 main papers and a Finding paper got accepted in EMNLP'25. July 22nd, 2025: Our paper, \"ReFeR: Improving Evaluation and Reasoning through Hierarchy of Models\" got accepted in TMLR. May 16th, 2025: Our paper, \"Label-semantics Aware Generative Approach for Domain-Agnostic Multilabel Classification\" got accepted in ACL Findings'25. Jan 23rd, 2025: Our paper, \"Periodic Materials Generation using Text-Guided Joint Diffusion Model\" got accepted in ICLR'25. Dec 29th, 2024: I will be offering a new course on NPTEL, \"Deep Learning for Natural Language Processing\". Course Website Sep 20th, 2024: 3 main papers and a Finding paper got accepted in EMNLP'24. June 11th, 2024: Abhilash Nandy received the Microsoft Research India PhD Award. June 11th, 2024: Our paper, \"FastDoc: Domain-Specific Fast Continual Pre-training Technique using Document-Level Metadata and Taxonomy\" got accepted in TMLR. May 16th, 2024: Our papers, \"IL-TUR: Benchmark for Indian Legal Text Understanding and Reasoning\" (long paper, main) and \"On The Persona-based Summarization of Domain-Specific Documents\" (shot paper, Findings) got accepted in ACL'24. March 26th, 2024: Our papers, \"Instruction-Guided Bullet Point Summarization of Long Financial Earnings Call Transcripts\" (short paper) and \"Legal Statute Identification: A Case Study using State-of-the-Art Datasets and Methods\" (Resource and Reproducibility track) got accepted in SIGIR'24. March 13th, 2024: Our papers, \"Parameter-Efficient Instruction Tuning of Large Language Models For Extreme Financial Numeral Labelling\" and \"Order-Based Pre-training Strategies for Procedural Text Understanding\" got accepted in NAACL'24 (main conference). Februay 20th, 2024: Our paper, \"How Robust are the QA Models for Hybrid Scientific Tabular Data? A Study using Customized Dataset\" got accepted in LREC-Coling'24 (short). October 8th, 2023: 4 long papers accepted in EMNLP'23 (Findings). September 25th, 2023: Our proposal, \"A Human-Aligned Automated Evaluation Framework for Natural Language Generation via Large Language Models\" got selected for the Microsoft Accelerate Foundation Models Research Program. June 2023: I will be serving as an area chair for EMNLP'23. June 2023: I will be serving as PC co-chair for IndoML'23 in IIT Bombay along with Prof. Abir De and Prof. Sunita Sarawagi. May, 2023: I will be serving as PC co-chair for Big Data Analytics (BDA)'23 in IIIT Delhi along with Prof. Sourav Bhowmick, NTU. May 8th, 2023: Our paper, \"SanskritShala: A Neural Sanskrit NLP Toolkit with Web-Based Interface for Pedagogical and Annotation Purposes\" got accepted in ACL'23 (System Demonstrations). May 8th, 2023: Our paper, \"CrysMMNet: Multimodal Representation for Crystal Property Prediction\" got accepted in UAI'23. May 2nd, 2023: Our paper, \"Financial Numeric Extreme Labelling: A dataset and benchmarking\" got accepted in Findings of ACL'23 (short). January 22nd, 2023: Our papers, \"Intent Identification and Entity Extraction for Healthcare Queries in Indic Languages\" (Long paper, findings) and \"Systematic Investigation of Strategies Tailored for Low-Resource Settings for Low-Resource Dependency Parsing\" (Short paper, main) got accepted in EACL'23. November 19th, 2022: Our paper, \"CrysGNN : Distilling pre-trained knowledge to enhance property prediction for crystalline materials\" got accepted in AAAI'23. October 6th, 2022: Our papers, \"TransLIST: A Transformer-Based Linguistically Informed Sanskrit Tokenizert\" (Long paper, findings) and \"ECTSum: A New Benchmark Dataset for Bullet Point Summarization of Long Earnings Call Transcripts\" (Long paper, main) got accepted in EMNLP'22. September 21st, 2022: Our papers, \"Legal Case Document Summarization: Extractive and Abstractive Methods and their Evaluation\" (Long paper, main) and \"ArgGen: Prompting Text Generation Models for Document-Level Event-Argument Aggregation\" (short paper, findings) got accepted in AACL'22. August 17th, 2022: Our papers, \"A Novel Multi-Task Learning Approach for Context-Sensitive Compound Type Identification in Sanskrit\" (Long paper, Oral presentation) and \"Does Meta-learning Help mBERT for Few-shot Question Generation in a Cross-lingual Transfer Setting for Indic Languages?\" (Short paper, poster presentation) got accepted in Coling'22. August 16th, 2022: Received Faculty Excellence Award (Associate Level) from IIT Kharagpur. June 15th, 2022: Our paper, \"Linguistically Informed Post-processing for ASR Error correction in Sanskrit\" got accepted in Interspeech. May 30th, 2022: Our proposal, \" Adapting Dialog Systems to New Domains through Natural Language Interactionst\" got selected as part of Microsoft Academic Partnership Grant (MAPG 2022) program. April 8th, 2022: Our papers, \"Representation Learning for Conversational Data using Discourse Mutual Information Maximization\" and \"A Framework to Generate High-quality Datapoints for Multiple Novel Intent Detection\" got accepted in NAACL'22 (main and findings, respectively). March 4th, 2022: Our paper, \"Using Data Augmentation to Identify Relevant Reviews for Product Question Answering\" got accepted in the Web Conference as a poster. January 27th, 2022: Our paper, \"CrysXPP: An Explainable Property Predictor for Crystalline Materials\" got accepted in npj Computational Materials. December 1st, 2021: Our paper, \"LeSICiN: A Heterogeneous Graph-based Approach for Automatic Legal Statute Identification from Indian Legal Documents\" got accepted in AAAI'22. October 12th, 2021: Our paper, \"MTLVS: A Multi-Task Framework to Verify and Summarize Crisis-Related Microblogs\" got accepted in WSDM'22. September 3rd, 2021: Our paper, \"Network Embeddings from Distributional Thesauri for Improving Static Word Representations\" got accepted in Expert Systems with Applications. September 2nd, 2021: Our paper received Hypertext Ted Nelson Best Newcomer Paper Award. August 26th, 2021: Our papers, \"PASTE: A Tagging-free Decoding Framework using Pointer Networks for Aspect Sentiment Triplet Extraction\" and \"Question Answering over Electronic Devices: A New Benchmark Dataset and a Multi-Task Learning based QA\" got accepted in EMNLP'21 (main and findings, respectively). June 23rd, 2021: Our proposal, \" Multilingual Dialogue as a Novel Framework for AutoSuggest\" got selected as part of Microsoft Academic Partnership Grant 2021 program. May 6th, 2021: Our paper, \" Automatic Speech Recognition in Sanskrit: A New Speech Corpus and Modelling Insights\" got accepted in Findings of ACL'21. March 11th, 2021: Our paper, \" Hierarchical Transformer for Task Oriented Dialog Systems\" got accepted in NAACL-HLT'21. January 19th, 2021: Our paper, \" MatScIE: An automated tool for the generation of databases of methods and parameters used in the computational materials science literature\" got accepted in Computational Materials Science, Elsevier. December 31st, 2020: Abhilash Nandy and Ankan Mullick receive Prime Ministers Research Fellowship (PMRF). December 15th, 2020: One Full paper and One Reproducibility Track paper got accepted in ECIR'21. December 2nd, 2020: Our paper, \"HateXplain: A Benchmark Dataset for Explainable Hate Speech Detection\" got accepted in AAAI'21. October 3rd, 2020: Our paper, \"A Graph Based Framework for Structured Prediction Tasks in Sanskrit\" got accepted in Computational Linguistics Journal. September 30th, 2020: Our paper, \"Automatic Crime Identification from Facts: A Few Sentence-Level Crime Annotations is All You Need\" got accepted in COLING. September 15th, 2020: Our paper, \"Keep it Surprisingly Simple: A Simple First Order Graph Based Parsing Model for Joint Morphosyntactic Parsing in Sanskrit\" got accepted in EMNLP as a short paper. September 10th, 2020, 2020: Received INAE Young Engineer Awards 2020. July 24th, 2020: Our paper, \"Hat",
  "content_length": 16372,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:29"
}