{
  "name": "Pawel Grabarczyk",
  "homepage": "https://pure.itu.dk/portal/en/persons/pawel-grabarczyk(42147e05-f94c-471d-a889-c57a01e4bdd0).html",
  "status": "success",
  "content": "Pawel Grabarczyk - IT-University of Copenhagen Pawel Grabarczyk Associate Professor, Play, Culture, and AIHead of Research Group, Games Research GroupCenter for Computing Education ResearchCenter for Digital Play https://orcid.org/0000-0002-1268-7474 Emailpawgitudk 20082024 Research activity per year Personal profile KeywordsANT: Actor Network TheoryAugmented realityBig DataBig data ethicsCritical theoryGame designHuman cognitionHuman perceptiomPhenomenologyPrivacySTS: Science & Technology StudiesVirtual RealityEmulationRetrogamingGame Jams Fingerprint Dive into the research topics where Pawel Grabarczyk is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Video Games Keyphrases 100% Loot Boxes Keyphrases 56% Random Rewards Keyphrases 37% Gambling Keyphrases 37% Educational Activities Keyphrases 37% Theory of Meaning Keyphrases 37% Virtual Reality Keyphrases 37% Reward System Keyphrases 37% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2008 2008 2013 2016 2017 2018 2019 2020 2021 2024 21 Journal article 7 Article in proceedings 5 Book chapter 3 Book 6 More 3 Conference abstract for conference 2 Paper 1 Encyclopedia chapter Research output per year Research output per year Game Jams and 'Heavy' Topics: Navigating anxiety through game creationWirman, H. E., Bankler, J. V., Fiadotau, M., Prax, P., Walliander, H., Engström, H., Garda, M., Gissurardóttir, S. & Grabarczyk, P., 2024, Conference Proceedings of DiGRA 2024 Conference: Playgrounds. 16 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review File Creative Process 100% Mood 100% Social Engagement 100% Creativity 100% Creativity Level 33% On the Effect of Onboarding Computing Students without Programming-Confidence or -ExperienceGrabarczyk, P., Nicolajsen, S. M. & Brabrand, C., 2023, Koli Calling '22: 22nd Koli Calling International Conference on Computing Education Research. Koli, Finland: Association for Computing Machinery, p. 18:1-18:8 8 p. (ACM Proceedings of the Koli Calling International Conference on Computing Education Research (Koli)).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Computing Students 100% Onboarding 100% Dropout Rate 100% Software Development 100% Programming Experience 100% Computing Educational Programmes with more Women are more about People & less about ThingsGrabarczyk, P., Freiesleben, A., Bastrup, A. & Brabrand, C., 2022, ITiCSE 2022: Innovation and Technology in Computer Science Education (ITiCSE 2022). Association for Computing Machinery, p. 172-178 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Computing Educational Activities Involving People Rather Than Things Appeal More to Women (CS1 Appeal Perspective)Marcher, M. H., Christensen, I. M., Grabarczyk, P., Graversen, T. & Brabrand, C., 17 Aug 2021, Proceedings of the 17th ACM Conference on International Computing Education Research (ICER 2021). Association for Computing Machinery, p. 145–156 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access University Students 100% Educational Activities 100% Computing Task 100% High School Student 100% Educators 50% Computing Educational Activities Involving People Rather Than Things Appeal More to Women (Recruitment Perspective)Christensen, I. M., Høegh Marcher, M., Grabarczyk, P., Graversen, T. & Brabrand, C., 17 Aug 2021, Proceedings of the 17th ACM Conference on International Computing Education Research (ICER 2021). Association for Computing Machinery, p. 127–144 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Educational Activities 100% Programming Experience 100% High School Student 100% High School Students 33% Secondary Schools 33% View all 42 research outputs Projects Projects per year 2016 2016 2021 2022 2023 2024 4 Finished Projects per year NASG/2021 : Nordic Alliance for Sustainability in Gaming 2021Grabarczyk, P. (PI) & Wirman, H. E. (CoI)Danish Agency for Higher Education and Science15/05/2021 → 01/10/2022Project: Research Environmental Sustainability 100% Cultural Sustainability 100% Creation Session 100% Raise Awareness 100% Serious Game 100% MSG: Making Sense of Games: A Methodology for Humanistic Game AnalysisAarseth, E. (PI), Debus, M. S. (CoI), Jørgensen, I. K. H. (CoI), Blom, J. (CoI), Grabarczyk, P. (CoI), Nielsen, R. K. L. (CoI), Vozaru, M. (CoI), Houe, N. P. (CoI), Grabarczyk, P. (CoI), Jørgensen, I. K. H. (CoI), Blom, J. (CoI) & Bakkerud, F. (CoI)European Commission01/11/2016 → 30/04/2022Project: Research Game Analysis 100% Gamers 66% Making Sense 66% Representation in Games 66% Alien 66% NASG/2022: Nordic Alliance for Sustainability in Gaming 2022Wirman, H. E. (PI) & Grabarczyk, P. (CoI)The Nordic Council01/06/2022 → 01/10/2023Project: Research Environmental Sustainability 100% Cultural Sustainability 100% Game Education 100% Environmentally Conscious 100% Game Design 100% NASG/2023: Nordic Alliance for Sustainability in Gaming 2023Wirman, H. E. (PI) & Grabarczyk, P. (CoI)The Nordic Council15/05/2023 → 01/10/2024Project: Research Partner Institution 100% Game Education 100% Digital Games 100% Creativity 100% Gaming 100% Press/Media Computerspil lavet af forskere vil 'vaccinere' mod fake news - prøv det herGrabarczyk, P.19/05/20221 Media contributionPress/Media: Press / Media KVINDER FORETRÆKKER MENNESKERGraversen, T., Grabarczyk, P. & Brabrand, C.19/10/20211 Media contributionPress/Media: Press / Media FORSKERE FINDER VEJ:BEDRE KØNSBALANCE I ITVERDENENBrabrand, C., Graversen, T. & Grabarczyk, P.06/09/20211 Media contributionPress/Media: Press / Media Playstation og Xbox sætter barren for fremtidens computerspilPichlmair, M. & Grabarczyk, P.20/11/20201 Media contributionPress/Media: Press / Media De har været i krig i snart 20 år: Hvem vinder slaget om den nye generation af konsoller?Pichlmair, M. & Grabarczyk, P.19/11/20201 Media contributionPress/Media: Press / Media View all 7 press/media Activities Activities per year 2018 2018 2018 1 Lecture and oral contribution Activities per year Are Loot Boxes Gambling? Random Reward Mechanisms in Video GamesNielsen, R. K. L. (Speaker) & Grabarczyk, P. (Speaker)26 Jul 2018Activity: Talk or presentation types › Lecture and oral contribution",
  "content_length": 6970,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:31"
}