{
  "name": "Pawel Winter",
  "homepage": "http://www.diku.dk/~pawel",
  "status": "success",
  "content": "Pawel Winter Pawel Winter Professor Research Interests Computational biology. Computational methods to solve molecular biology problems. See the web-site Computational geometry. Applications of computational geometry in network design problems. Combinatorial optimization. Design of communication, distribution and transportation networks. Publications Project Proposals (I will gradually add more information to the topics below. You are of course welcome to drop by to discuss these topics or topics of your own) Computational Biology Protein Structure Prediction 3d Structure Database Search Evolutionary Trees Computational Geometry Alphaforms (applications to protein structure prediction in particular) Triangulations Spanners Collision Detection Kinetic Data Structures Network Design Euclidean Steiner Trees Multiconnected Steiner Networks Combinatorial Optimization Courses (on more or less regular basis): Computational Geometry (graduate) Discrete Optimization (graduate), new course in 2014 Topics in Algorithms (graduate) Computational Biology (graduate) Algorithms and Data Structures (undergraduate) Advanced Algorithmics (graduate) Projects supervised in 2015: Master Theses: Jens Fredskov, Finding Minimal Steiner Tress in Euclidan d-Space, completed Dan Brasovean and Georgi Muerov, Kinetic Data Structures Applied to Alpha Complexes in 3D Jacob Ingvar Grevald, Steiner trees in Minkowski- and Fixed-Orientation d-Space Claus Vium, Kinetic Euclidean Minimum Spanning Trees Graduate Projects: Nicolas á Rogvi Krog, Kinetic 2d Triangulation with Bending Linear Trajectories, completed. Thorbjørn Søgaard Christensen, Well-Separated Pair Decomposition Stephan Lorentzen, Euclidean Steiner Tree Heuristic Using Bottleneck Graphs Projects supervised in 2014: Master Theses: Ashwini Joshi, Information Retrieval Using Sufix Trees, with Ingemar Cox, HCC, completed Theodosios Kalfas, Euclidean Steiner Minimal Trees for Moving Points, completed Desiree Malene Schreyer Jorgensen, 3D Restricted Kinetic Alpha Complexes and Application, completed Onur Erturk, Native-Based Heuristics and Steiner Tree Problem - completed Bachelor Theses: Stephan Sloth Lorenzen and Andreas Emil Olsen, Euclidean Steiner Tree Heuristic in 3d, completed Kim Hogsberg and Henrik Hoeg, Kinetic Data Structures in CGAL, completed Graduate Projects: Irfan Siddiqui‎ and Shuhab Hussain, Kinetic Data Structures and Closest Pair Using CGA, completedL Projects supervised in 2013: Master Theses: Evangelos Moussas, Kinetic Data Structures and Kinetic Alpha Complex: Application on Protein Structure Prediction - completed Brian Brost, Computing Persistent Homology via Discrete Morse Theory - completed, with Jesper Michael Moller, MATH Soren Lynnerup, Kinetic Range Trees - completed Onur Erturk, Native-Based Heuristics and Steiner Tree Problem - continued in 2014 Desiree Malene Schreyer Jorgensen, 3D Restricted Kinetic Alpha Complexes and Application - continued in 2014 Bachelor Theses: Filip Bojanowski, Automatisering af ruteberegning til svaevefly - completed Claus Hauerbach Vium and Niklas Thiemann, Kinetic Nearest Neighbor - completed Graduate Projects: Brian Brost and Ashwini Joshi, Weighted Alpha and Beta Complexes, and Their Applications to Protein Structure Prediction Desiree Malene Schreyer Jorgensen, Restricted Kinetic Alpha Complex Soren Lynnerup, Clash Detection Using Range Trees Dept. of Computer Science (DIKU) University of Copenhagen Universitetsparken 5 DK-2100 Copenhagen O Denmark (45) 23 80 77 99 (45) 35 32 14 01 pawel@diku.dk",
  "content_length": 3544,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:39"
}