{
  "name": "Payam Zahadat",
  "homepage": "https://pure.itu.dk/portal/en/persons/payam-zahadat(8785f18a-1bf3-4c63-8d8b-d3e5d516ca40).html",
  "status": "success",
  "content": "Payam Zahadat - IT-University of Copenhagen Payam Zahadat Associate Professor, Data, Systems, and RoboticsRobotics, Evolution, and Art LabThe Maritime HubREAL Lab https://orcid.org/0000-0002-4521-7428 Emailpazaitudk 20082025 Research activity per year Personal profile KeywordsRobotics softwareSwarm roboticsBioinspired computing Fingerprint Dive into the research topics where Payam Zahadat is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Robot Computer Science 100% Collective Decision Making Computer Science 52% Controller Keyphrases 52% Vascular Morphogenesis Keyphrases 46% Morphogenesis Keyphrases 45% Collective Decision-making Keyphrases 38% Artificial System Computer Science 34% Case Study Computer Science 34% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2008 2015 2016 2018 2019 2021 2022 2024 2025 2025 17 Article in proceedings 13 Journal article 2 Paper 1 Book chapter 2 More 1 Conference abstract in proceedings 1 Preprint Research output per year Research output per year Macro-types in multi-scale feedback systems: a conceptual frameworkDiaconscu, A., Di Felice, L. J., Mellodge, P. & Zahadat, P., 2025, 2025 IEEE International Conference on Autonomic Computing and Self-Organizing Systems (ACSOS). IEEEResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Adaptive System 100% Theoretical Basis 20% Granularity 20% Design Pattern 20% Foraging Ants 20% Swarm-inspired controllers: a comparative study of decentralized behaviors for distributed manipulation surfacesBessone, N., Stoy, K. & Zahadat, P., 7 Oct 2025, In: Swarm Intelligence. 14987, p. 273-293 21 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access The value of information in multi-scale feedback systemsDi Felice, L. J., Diaconscu, A., Zahadat, P. & Mellodge, P., 2025, In: Frontiers in Complex Systems. 3 2025Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Multi-scale Feedback 100% Information Value 100% Pragmatic Information 50% Informational Theory 25% Semantic Measures 25% Animal-Robot Interaction - An Emerging Field at the Intersection of Biology and RoboticsRomano, D., Porfiri, M., Zahadat, P. & Schmickl, T., 2 Feb 2024, In: Bioinspiration & Biomimetics. 19, 020201Research output: Journal Article or Conference Article in Journal › Journal article › Research Open Access Robotics 100% Hybrid System 100% Animal-robot Interaction 100% Biohybrids 100% Human Factors 50% Decentralized Control of Distributed Manipulators: An Information Diffusion Approach.Bessone, N., Zahadat, P. & Støy, K., 2024, AAMAS. p. 2156-2158 3 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Information Diffusion 100% Manipulator 100% Decentralized Control 100% Diffusion Approach 100% Self-organization 33% View all 35 research outputs Projects Projects per year 2015 2015 2021 2022 2024 2026 2 Finished 2 Active Projects per year MOZART: Morphing Computerized mats with Embodied Sensing and Artificial IntelligenceStøy, K. (PI), Zahadat, P. (CoI), Faina, A. (CoI), Garcia, R. M. (CoI), Dacre, B. (CoI), Bessone, N. H. (CoI), Ingle, P. S. (CoI) & Walker, K. E. (CoI)European Commission01/10/2022 → 30/09/2026Project: Research Chicken 100% Artificial Intelligence 100% Point Tunneling 100% Reconfigurable 100% Tunneling Protocol 100% FloraRobotica: Societies of Symbiotic Robot-plant Bio-Hybrids as social Architectural ArtifactsStøy, K. (PI), Veenstra, F. (CoI), Zahadat, P. (CoI), Nielsen, S. A. (CoI), Blichfeldt, T. (CoI), Schmidt, M. (CoI) & Risi, S. (PI)European Commission01/04/2015 → 31/03/2019Project: Research Robot 100% Controller 83% Natural Plants 50% Hybrid System 50% Artificial Plants 50% Pushing the limit of robotics cognitionStøy, K. (PI) & Zahadat, P. (CoI)Danish Agency for Higher Education and Science24/08/2021 → 21/10/2021Project: Research Robotic Cognition 100% MUHMI-MOZART: Multimodal Human-Machine Interfaces for Morphing Computerized Mats with Embodied Sensing and Artificial IntelligenceStøy, K. (PI), Faina, A. (CoI), Garcia, R. M. (Collaborator), Zahadat, P. (CoI), Bessone, N. H. (Collaborator), Dacre, B. (Collaborator) & Ingle, P. S. (Collaborator)European Commission01/03/2024 → 30/09/2026Project: Research Human-robot Interaction 100% Human Robot Interaction 100% Wolfgang Amadeus Mozart 50% Distributed Manipulation 50% Multimodal Interfaces 50% Datasets Self-Organized Construction with Continuous Building Material: Higher Flexibility based on Braided StructuresHeinrich, M. K. (Creator), Wahby, M. (Creator), Divband Soorati, M. (Creator), Hofstadler, D. N. (Creator), Zahadat, P. (Creator), Ayres, P. (Creator), Støy, K. (Creator) & Hamann, H. (Creator), ZENODO, 24 Jul 2016DOI: 10.5281/zenodo.58524, https://zenodo.org/record/58524Dataset Photomorphogenesis for Robot Self-assembly: Adaptivity, Collective Decision-making, and Self-repairSoorati, M. D. (Creator), Heinrich, M. K. (Creator), Ghofrani, J. (Creator), Zahadat, P. (Creator) & Hamann, H. (Creator), ZENODO, 13 Jan 2019DOI: 10.5281/zenodo.2653590, https://zenodo.org/record/2653590Dataset",
  "content_length": 5730,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:33"
}