{
  "name": "Pedram Rooshenas",
  "homepage": "https://rooshenas.github.io",
  "status": "success",
  "content": "Pedram Rooshenas PedramMachine Learning Researcher Follow Chicago, IL EmailSemantic Scholar Github Google Scholar About MeI am an Assistant Professor at the University of Illinois Chicago and conducting machine learning research with a focus on the applications of deep generative models in language modeling, machine translation, multimodal learning, and scientific machine learning. I had the opportunity to do post-doctoral research with Andrew McCallum at UMass Amherst, focusing on structured prediction energy networks (SPENs). Prior to that, I completed my Ph.D. at the University of Oregon under the guidance of Daniel Lowd, specializing in tractable probabilistic models and probabilistic circuits. Research InterestStructured Prediction Deep Generative Models Probabilistic Graphical Models Machine Learning for Physical Sciences Deep Learning Machine Learning NewsOct. 23 -- I am hiring PhD students for Fall 2024. Please see here for more information! Jan. 23 -- Our paper \"Improved Training of Physics-Informed Neural Networks Using Energy-Based Priors: a Study on Electrical Impedance Tomography\" has been accepted to ICLR'23. Jun. 22 -- I am hiring PhD students for Spring/Fall 2023. Jun. 22 -- I will join UIC as an assistant professor in August 2022! May. 22 -- I gave an invited talk on \"Energy-Based Models for Structured Prediction\" at the Department of Computer Science, UIUC. Apr. 22 -- I gave an invited talk on \"Energy-Based Models for Structured Prediction\" at the Department of Computer Science, UIC. Mar. 22 -- I gave an invited talk on \"Energy-Based Models for Structured Prediction\" at NEC Labs America. May 21 -- Our paper \"Energy-Based Reranking: Improving Neural Machine Translation Using Energy-Based Models\" has been accepted to ACL'21, main conference. Apr. 21 -- We are organizing the 4th Workshop on Tractable Probabilistic Models (TPM'21) at UAI'21. Please submit your finest work! Sep. 20 -- I am hiring PhD students for Fall 2021. If you are interested in doing a PhD with me, please consider applying to UNC Charlotte! Feel free to contact me if you have any questions. Apr. 20 -- I will join UNC Charlotte as an assistant professor in August 2020!! I will be at AAAI-2020, Feb. 8 - 12. Dec. 19 -- Invited to be a program committee member for IJCAI 2020. Nov. 19 -- Invited to serve as a reviewer for ICML 2020. Nov. 19 -- Our paper on \"Differential Equation Units: Learning Functional Forms of Activation Functions from Data\" has been accepted to AAAI 2020 as an oral presentation. Sep. 19 -- Our paper on \"Search-Guided, Lightly-Supervised Training of Structured Prediction Energy Networks\" has been accepted to Neurips 2019.",
  "content_length": 2668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:32"
}