{
  "name": "Pedro Miguel Morgado",
  "homepage": "https://pedro-morgado.github.io",
  "status": "success",
  "content": "Pedro Morgado Pedro Morgado Member of Technical Staff Skild AI Address: Email Scholar Github Hello! I am a the Member of Technical Staff at Skild AI, focusing on building robust perception systems for robotics. I am particularly interested in systems capable of continuous, multi-modal learning. Prior to joining Skild, I was an Assistant Professor at the University of Wisconsin-Madison. I completed my PhD at UC San Diego advised by Nuno Vasconcelos, and was a postdoc with Abhinav Gupta at Carnegie Mellon University. News (Jul 2025) Our paper on TrackVerse, an object-centric video dataset for SSL, accepted at ICCV 2025. (Jun 2025) I have joined Skild AI. I am excited to start building the next generation of smart robots. (Jun 2025) Serving as Area Chair at CVPR and NeurIPS 2025. (Mar 2025) Awarded a OVCR Fall Research Competition grant. Thank you OVCR for supporting our research. (Feb 2025) Our paper on Efficient curricula for MIM models accepted at CVPR 2025. (Oct 2024) Our paper on Accelerating the pretraining of vision transformers accepted at NeurIPS 2024. (Jul 2024) Three papers accepted at ECCV 2024 on Audio-guided video generation, Language-driven ZSL and Latent MIM. (Jun 2024) Serving as Area Chair at CVPR and NeurIPS 2024. (Mar 2024) We've received a research gift from Adobe. Thank you for supporting our work! (Feb 2024) Paper on the early-fusion audio-visual transformers accepted at CVPR 2024. (Jul 2023) Paper on the robustness of prompt-tuning accepted at ICCV 2023. (Jun 2023) Invited talk at the ML4MI Seminar Series @ University of Wisconsin-Madison. (Apr 2023) Paper on unified audio-visual modeling (OneAVM) accepted at ICML 2023. (Mar 2023) Serving as Area Chair at CVPR and NeurIPS 2023. (Feb 2023) Invited talk at the MaVi Seminar Series @ University of Bristol and at the SIO ML Group @ UCSD (Jan 2023) Awarded the WARF Big Data Challenge Grant. Thank you WARF for supporting our research. (Oct 2022) Invited talk at AV4D Workshop @ ECCV 2022. (Sep 2022) Two papers (SLAVC and RepLAI) accepted at NeurIPS 2022. (Aug 2022) Starting as Assistant Professor at University of Wisconsin-Madison. (Jul 2022) Two papers on Continuous SSL and Visual Sound Localization accepted at ECCV 2022. (Jun 2022) Invited talk at the Sight and Sound Workshop @ CVPR 2022. (Aug 2021) Starting my postdoc at Carnegie Mellon University. (Jun 2021) Successfully defended my PhD thesis. Thank you to all mentors and collaborators! (Jun 2021) Our CVPR 2021 paper on audio-visual self-supervised learning (AVID) is a Best Paper Candidate. (Mar 2021) Two papers (AVID and Robust xID) accepted at CVPR 2021 (1 as oral). --- show more --- Publications From Prototypes to General Distributions: An Efficient Curriculum for Masked Image Modeling Jinhong Lin, Cheng-En Wu, Huanran Li, Jifan Zhang, Yu Hen Hu, Pedro Morgado Conf. on Computer Vision and Pattern Recognition (CVPR), Nashville, 2025. paper bibtex @InProceedings{lin2025prototypes, title={From Prototypes to General Distributions: An Efficient Curriculum for Masked Image Modeling}, author={Jinhong Lin and Cheng-En Wu and Huanran Li and Jifan Zhang and Yu Hen Hu and Pedro Morgado}, booktitle={IEEE/CVF Conf. on Computer Vision and Pattern Recognition (CVPR)}, year={2025}} Patch Ranking: Token Pruning as Ranking Prediction for Efficient CLIP Inference Cheng-En Wu, Jinhong Lin, Yu Hen Hu, Pedro Morgado Winter Conference on Applications of Computer Vision (WACV), Tucson, 2025. paper bibtex @InProceedings{chengen2025pruning, title={Patch Ranking: Token Pruning as Ranking Prediction for Efficient CLIP Inference}, author={Cheng-En Wu and Jinhong Lin and Yu-Hen Yu and Pedro Morgado}, booktitle={IEEE/CVF Winter Applications in Computer Vision (WACV)}, year={2025}} Accelerating Augmentation Invariance Pretraining Jinhong Lin, Cheng-En Wu, Yibing Wei, Pedro Morgado Neural Information Processing Systems (NeurIPS), Vancouver, 2024. paper bibtex @InProceedings{lin2024fastcl, title={Accelerating Augmentation Invariance Pretraining}, author={Jinhong Lin and Cheng-En Wu and Yibing Wei and Pedro Morgado}, booktitle={Advances in Neural Information Processing Systems (NeurIPS)}, year={2024}} Towards Latent Masked Image Modeling for Self-Supervised Visual Representation Learning Yibing Wei, Abhinav Gupta, Pedro Morgado European Conference on Computer Vision (ECCV), Milan, 2024. paper code website bibtex @InProceedings{wei2024lmim, title={Towards Latent Masked Image Modeling for Self-Supervised Visual Representation Learning}, author={Yibing Wei and Abhinav Gupta and Pedro Morgado}, booktitle={European Conference on Computer Vision (ECCV)}, year={2024}} Audio-Synchronized Visual Animation Lin Zhang, Shentong Mo, Yijing Zhang, Pedro Morgado European Conference on Computer Vision (ECCV), Milan, 2024. paper code website bibtex Oral presentation @InProceedings{zhang2024asva, title={Audio-Synchronized Visual Animation}, author={Lin Zhang, Shentong Mo, Yijing Zhang, Pedro Morgado}, booktitle={European Conference on Computer Vision (ECCV)}, year={2024}} Audio-visual Generalized Zero-shot Learning the Easy Way Shentong Mo, Pedro Morgado European Conference on Computer Vision (ECCV), Milan, 2024. paper bibtex @InProceedings{mo24avzsl, title={Audio-visual Generalized Zero-shot Learning the Easy Way}, author={Mo, Shentong and Morgado, Pedro}, booktitle={European Conference on Computer Vision (ECCV)}, year={2024}} Unveiling the Power of Audio-Visual Early Fusion Transformers with Dense Interactions through Masked Modeling Shentong Mo, Pedro Morgado Conf. on Computer Vision and Pattern Recognition (CVPR), Seattle, 2024. paper code bibtex @InProceedings{mo2024_efav, title={Unveiling the Power of Audio-Visual Early Fusion Transformers with Dense Interactions through Masked Modeling}, author={Shentong Mo, Pedro Morgado}, booktitle={IEEE/CVF Conf. on Computer Vision and Pattern Recognition (CVPR)}, year={2024}} A Unified Audio-Visual Learning Framework for Localization, Separation, and Recognition Shentong Mo, Pedro Morgado International Conference on Machine Learning (ICML), Honolulu, 2023. paper code bibtex @InProceedings{mo2022_slavc, title={A Unified Audio-Visual Learning Framework for Localization, Separation, and Recognition}, author={Shentong Mo, Pedro Morgado}, booktitle={Proceedings of the 40th International Conference on Machine Learning (ICML)}, year={2023}} Prompt Tuning Vision Language Models is Robust to Noisy Labels Cheng-En Wu, Yu Tian, Haichao Yu, Heng Wang, Pedro Morgado, Yu Hen Hu, Linjie Yang International Conference on Computer Vision (ICCV), Paris, 2023. paper code bibtex @InProceedings{wu2023_robust_pt, title={Why Is Prompt Tuning for Vision-Language Models Robust to Noisy Labels?}, author={Cheng-En Wu, Yu Tian, Haichao Yu, Heng Wang, Pedro Morgado, Yu Hen Hu, Linjie Yang}, booktitle={International Conference in Computer Vision (ICCV)}, year={2023}} A Closer Look at Weakly-Supervised Audio-Visual Source Localization Shentong Mo, Pedro Morgado Neural Information Processing Systems (NeurIPS), New Orleans, 2022. paper code bibtex @InProceedings{mo2022_slavc, title={A Closer Look at Weakly-Supervised Audio-Visual Source Localization}, author={Shentong Mo, Pedro Morgado}, booktitle={Advances in Neural Information Processing Systems (NeurIPS)}, year={2022}} Learning Visual Representation from Audible Interactions Himangi Mittal, Pedro Morgado, Unnat Jain, Abhinav Gupta Neural Information Processing Systems (NeurIPS), New Orleans, 2022. paper code bibtex @InProceedings{mittal2022_replai, title={Learning Visual Representation from Audible Interactions}, author={Himangi Mittal, Pedro Morgado, Unnat Jain, Abhinav Gupta}, booktitle={Advances in Neural Information Processing Systems (NeurIPS)}, year={2022}} Benchmarking and Automating the Image Recognition Capability of an In Situ Plankton Imaging System Kevin T. Le, Zhouyuan Yuan, Areeb Syed, Devin Ratelle, Eric C. Orenstein, Melissa L. Carter, Sarah Strang, Kasia M. Kenitz, Pedro Morgado, Peter J. S. Franks, Nuno Vasconcelos, Jules S. Jaffe Frontiers in Marine Science, 2022. paper bibtex @InProceedings{le2022_plankton_bench, title={Benchmarking and Automating the Image Recognition Capability of an In Situ Plankton Imaging System}, author={Kevin T. Le, Zhouyuan Yuan, Areeb Syed, Devin Ratelle, Eric C. Orenstein, Melissa L. Carter, Sarah Strang, Kasia M. Kenitz, Pedro Morgado, Peter J. S. Franks, Nuno Vasconcelos and Jules S. Jaffe}, booktitle={Frontiers in Marine Science}, year={2022}} The Challenges of Continuous Self-Supervised Learning Senthil Purushwalkam*, Pedro Morgado*, Abhinav Gupta European Conference on Computer Vision (ECCV), Tel Aviv, 2022. paper code data video bibtex Oral presentation @InProceedings{purushwalkam2022_continuous_ssl, title={The Challenges of Continuous Self-Supervised Learning}, author={Senthil Purushwalkam, Pedro Morgado, Abhinav Gupta}, booktitle={European Conference on Computer Vision (ECCV)}, year={2022}} Localizing Visual Sounds the Easy Way Shentong Mo, Pedro Morgado European Conference on Computer Vision (ECCV), Tel Aviv, 2022. paper code video bibtex @InProceedings{mo2022_ezvsl, title={Localizing Visual Sounds the Easy Way}, author={Shentong Mo, Pedro Morgado}, booktitle={European Conference on Computer Vision (ECCV)}, year={2022}} Learning to see and hear without human supervision Pedro Morgado PhD Thesis, University of California San Diego, 2021. thesis bibtex @phdthesis{morgado_phdthesis, author = {Pedro Morgado}, title = {Learning to see and hear without human supervision}, school = {University of California San Diego}, year = 2021} Robust Audio-Visual Instance Discrimination Pedro Morgado, Ishan Misra, Nuno Vasconcelos Conf. on Computer Vision and Pattern Recognition (CVPR), 2021. paper video bibtex Oral presentation @InProceedings{morgado2021_robust_xid, title={Robust Audio-Visual Instance Discrimination}, author={Pedro Morgado, Ishan Misra, Nuno Vasconcelos}, booktitle={Computer Vision and Pattern Recognition (CVPR), IEEE/CVF ",
  "content_length": 18602,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:41"
}