{
  "name": "Pedro Hermosilla Casajus",
  "homepage": "https://phermosilla.github.io",
  "status": "success",
  "content": "Pedro Hermosilla I am Assistant Professor in AI for Visual Computing at the Computer Vision Lab, at TU Wien, Austria. Before joining TU Wien, I did my PostDoc at the Viscom group headed by Prof. Timo Ropinski at Ulm University while working in close collaboration with Prof. Tobias Ritschel from University College London. I obtained my PhD at the Polytechnical University of Catalonia, under the supervision of Prof. Pere-Pau Vazquez and Prof. Alvar Vinacua. My research is focused on developing machine learning technologies for 3D and unstructured data, with a special interest in point clouds, graphs, and implicit representations. During my research, I applied these technologies to solve different problems in the fields of Computer Vision, Computer Graphics, and Bioinformatics. News Sep 24, 2025 Lisa Weijler got a paper accepted at NeurIPS and Christian Stippel a paper at SIGGRAPH Asia. Congratulations to both of them and all the collaborators that made it possible! Jun 27, 2025 We have a paper accepted at ICCV. Congratulations to Leon Sick! Mar 18, 2025 We have two papers accepted at CVPR. Congratulations to Sebastian Koch and Leon Sick! Nov 28, 2024 We have two papers accepted at 3DV and one paper accepted at WACV. Congratulations to Lisa Weijler and Leon Sick! Feb 28, 2024 We have two papers accepted at CVPR. Congratulations to Sebastian Koch and Leon Sick! Selected publications OpenHype: Hyperbolic Embeddings for Hierarchical Open-Vocabulary Radiance Fields L. Weijler, S. Koch, F. Poiesi, T. Ropinski, and P. Hermosilla Advances in Neural Information Processing Systems (NeurIPS) 2025 Bib HTML @article{weijler2025openhype, title = {OpenHype: Hyperbolic Embeddings for Hierarchical Open-Vocabulary Radiance Fields}, author = {Weijler, L. and Koch, S. and Poiesi, F. and Ropinski, T. and Hermosilla, P.}, journal = {Advances in Neural Information Processing Systems (NeurIPS)}, year = {2025}, } Marching Neurons: Accurate Surface Extraction for Neural Implicit Shapes C. Stippel, F. Mujkanovic, Leimkuehler T., and P. Hermosilla ACM Transactions on Graphics (Proc. SIGGRAPH Asia) 2025 arXiv Bib HTML @article{stippel2025neurons, title = {Marching Neurons: Accurate Surface Extraction for Neural Implicit Shapes}, author = {Stippel, C. and Mujkanovic, F. and T., Leimkuehler and Hermosilla, P.}, journal = {ACM Transactions on Graphics (Proc. SIGGRAPH Asia)}, year = {2025}, } Masked Scene Modeling: Narrowing the Gap Between Supervised and Self-Supervised Learning in 3D Scene Understanding P. Hermosilla, C. Stippel, and L. Sick Conference on Computer Vision and Pattern Recognition (CVPR) 2025 arXiv Bib HTML @article{hermosilla2025msm, title = {Masked Scene Modeling: Narrowing the Gap Between Supervised and Self-Supervised Learning in 3D Scene Understanding}, author = {Hermosilla, P. and Stippel, C. and Sick, L.}, journal = {Conference on Computer Vision and Pattern Recognition (CVPR)}, year = {2025}, } RelationField: Relate Anything in Radiance Fields S. Koch, J. Wald, M. Colosi, N. Vaskevicius,  P. Hermosilla, F. Tombari, and T. Ropinski Conference on Computer Vision and Pattern Recognition (CVPR) 2025 arXiv Bib HTML @article{koch2025relationfield, title = {RelationField: Relate Anything in Radiance Fields}, author = {Koch, S. and Wald, J. and Colosi, M. and Vaskevicius, N. and Hermosilla, P. and Tombari, F. and Ropinski, T.}, journal = {Conference on Computer Vision and Pattern Recognition (CVPR)}, year = {2025}, } CutS3D: Cutting Semantics in 3D for 2D Unsupervised Instance Segmentation L. Sick, D. Engel, S. Hartwig,  P. Hermosilla, and T. Ropinski International Conference on Computer Vision (ICCV) 2025 arXiv Bib HTML @article{sick2025cuts3d, title = {CutS3D: Cutting Semantics in 3D for 2D Unsupervised Instance Segmentation}, author = {Sick, L. and Engel, D. and Hartwig, S. and Hermosilla, P. and Ropinski, T.}, year = {2025}, journal = {International Conference on Computer Vision (ICCV)}, } TTT-KD: Test-Time Training for 3D Semantic Segmentation through Knowledge Distillation from Foundation Models L. Weijler, M. J. Mirza, L. Sick, C. Ekkazan, and P. Hermosilla International Conference on 3D Vision (3DV) 2025 arXiv Bib HTML @article{weijler2025tttkd, title = {TTT-KD: Test-Time Training for 3D Semantic Segmentation through Knowledge Distillation from Foundation Models}, author = {Weijler, L. and Mirza, M. J. and Sick, L. and Ekkazan, C. and Hermosilla, P.}, journal = {International Conference on 3D Vision (3DV)}, year = {2025}, } Efficient Continuous Group Convolutions for Local SE(3) Equivariance in 3D Point Clouds L. Weijler, and P. Hermosilla International Conference on 3D Vision (3DV) 2025 arXiv Bib HTML @article{weijler2025roteq, title = {Efficient Continuous Group Convolutions for Local SE(3) Equivariance in 3D Point Clouds}, author = {Weijler, L. and Hermosilla, P.}, journal = {International Conference on 3D Vision (3DV)}, year = {2025}, } Attention-Guided Masked Autoencoders For Learning Image Representations L. Sick, D. Engel,  P. Hermosilla, and T. Ropinski Winter Conference on Applications of Computer Vision (WACV) 2025 (Oral) arXiv Bib HTML @article{sick2025attMAE, author = {Sick, L. and Engel, D. and Hermosilla, P. and Ropinski, T.}, journal = {Winter Conference on Applications of Computer Vision (WACV)}, oral = {true}, year = {2025}, } Open3DSG: Open-Vocabulary 3D Scene Graphs from Point Clouds with Queryable Objects and Open-Set Relationships S. Koch, N. Vaskevicius, M. Colosi,  P. Hermosilla, and T. Ropinski Conference on Computer Vision and Pattern Recognition (CVPR) 2024 arXiv Bib HTML @article{koch2024opengraph, title = {Open3DSG: Open-Vocabulary 3D Scene Graphs from Point Clouds with Queryable Objects and Open-Set Relationships}, author = {Koch, S. and Vaskevicius, N. and Colosi, M. and Hermosilla, P. and Ropinski, T.}, journal = {Conference on Computer Vision and Pattern Recognition (CVPR)}, year = {2024}, } Unsupervised Semantic Segmentation Through Depth-Guided Feature Correlation and Sampling L. Sick, D. Engel,  P. Hermosilla, and T. Ropinski Conference on Computer Vision and Pattern Recognition (CVPR) 2024 arXiv Bib HTML @article{sick2023depthguided, title = {Unsupervised Semantic Segmentation Through Depth-Guided Feature Correlation and Sampling}, author = {Sick, L. and Engel, D. and Hermosilla, P. and Ropinski, T.}, journal = {Conference on Computer Vision and Pattern Recognition (CVPR)}, year = {2024}, } Weakly Supervised Virus Capsid Detection with Image-Level Annotations in Electron Microscopy Images H. Kniesel, L. Sick, T. Payer, T. Bergner, K. S. Devan, C. Read, P. Walther, T. Ropinski, and P. Hermosilla International Conference on Learning Representations (ICLR) 2024 Bib HTML @article{kniesel2024wem, title = {Weakly Supervised Virus Capsid Detection with Image-Level Annotations in Electron Microscopy Images}, author = {Kniesel, H. and Sick, L. and Payer, T. and Bergner, T. and Devan, K. S. and Read, C. and Walther, P. and Ropinski, T. and Hermosilla, P.}, journal = {International Conference on Learning Representations (ICLR)}, year = {2024}, } Lang3DSG: Language-based contrastive pre-training for 3D scene graph prediction S. Koch,  P. Hermosilla, N. Vaskevicius, M. Colosi, and T. Ropinski International Conference on 3D Vision (3DV) 2024 arXiv Bib HTML @article{koch2024lang3dsg, title = {Lang3DSG: Language-based contrastive pre-training for 3D scene graph prediction}, author = {Koch, S. and Hermosilla, P. and Vaskevicius, N. and Colosi, M. and Ropinski, T.}, journal = {International Conference on 3D Vision (3DV)}, year = {2024}, } G-Style: Stylized Gaussian Splatting A. S. Kovacs,  P. Hermosilla, and R. G. Raidou Computer Graphics Forum (Proc. Pacific Graphics) 2024 arXiv Bib Code @article{kovacs2024gstyle, title = {G-Style: Stylized Gaussian Splatting}, author = {Kovacs, A. S. and Hermosilla, P. and Raidou, R. G.}, journal = {Computer Graphics Forum (Proc. Pacific Graphics)}, year = {2024}, } Surface-aware Mesh Texture Synthesis with Pre-trained 2D CNNs A. S. Kovacs,  P. Hermosilla, and R. G. Raidou Computer Graphics Forum (Proc. Eurographics) 2024 arXiv Bib HTML Code @article{kovacs2024meshtexsynth, title = {Surface-aware Mesh Texture Synthesis with Pre-trained 2D CNNs}, author = {Kovacs, A. S. and Hermosilla, P. and Raidou, R. G.}, journal = {Computer Graphics Forum (Proc. Eurographics)}, year = {2024}, } Variance-Aware Weight Initialization for Point Convolutional Neural Networks P. Hermosilla, M. Schelling, T. Ritschel, and T. Ropinski European Conference on Computer Vision (ECCV) 2022 arXiv Bib Code @article{hermosilla2022variance, title = {Variance-Aware Weight Initialization for Point Convolutional Neural Networks}, author = {Hermosilla, P. and Schelling, M. and Ritschel, T. and Ropinski, T.}, journal = {European Conference on Computer Vision (ECCV) }, year = {2022}, } Clean Implicit 3D Structure from Noisy 2D STEM Images H. Kniesel, T. Ropinski, T. Bergner, K. Shaga Devan, C. Read, P. Walther, T. Ritschel, and P. Hermosilla Conference on Computer Vision and Pattern Recognition (CVPR) 2022 arXiv Bib Code @article{kniesel2022em, title = {Clean Implicit 3D Structure from Noisy 2D STEM Images}, author = {Kniesel, H. and Ropinski, T. and Bergner, T. and Shaga Devan, K. and Read, C. and Walther, P. and Ritschel, T. and Hermosilla, P.}, journal = {Conference on Computer Vision and Pattern Recognition (CVPR)}, year = {2022}, } RADU: Ray-Aligned Depth Update Convolutions for ToF Data Denoising M. Schelling,  P. Hermosilla, and T. Ropinski Conference on Computer Vision and Pattern Recognition (CVPR) 2022 arXiv Bib Code @article{schelling2022radu, title = {RADU: Ray-Aligned Depth Update Convolutions for ToF Data Denoising}, author = {Schelling, M. and Hermosilla, P. and Ropinski, T.}, journal = {Conference on Computer Vision and Pattern Recognition (CVPR)}, year = {2022}, } Gaussian Mixture Convolution Networks A. Celarek,  P. Hermosilla, B. Kerbl, T. Ropinski, and M. Wimmer International Confere",
  "content_length": 12244,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:37"
}