{
  "name": "Pedro Miguel Ruiz-Martinez",
  "homepage": "https://ants.inf.um.es/~pedrom",
  "status": "success",
  "content": "Personal Data for Pedro M. Ruiz Pedro M. Ruiz Martinez, Ph. D. Associate Professor of Telematic Engineering Dept. Information and Communications Engineering (DIIC) Fac. Informatica, Campus de Espinardo s/n E-30071, Murcia, Spain E-mail: pedrom@um.es Phone:+34868884335 Fax:+34868884151 News!!! Short Profile Dean of the Computer Science Faculty since January 1st, 2013. Head of the Information and Communications Department (DIIC) from January 2011 to December 2012. Appointed Mini-Conference Co-chair for IEEE INFOCOM 2011General Chair of AD HOC NOW 2009. Received positive evaluation for the outstanding research trajectory (I3 programme) from the spanish MEC Appointed member of IEEE Industrial Electronics Society Sub-committee on Wirelesss Sensor Networks. Appointed Workshop Co-chair ACM MobiCom 2008. Program Co-chair ACM HeterSenet 2008, co-located with ACM Mobihoc MARTA project has been approved for 4 years and received quality award. Guest Editor of upcoming Special Issue in Ad Hoc and Sensor Wireless Networks Journal from LOCAN 2007 and LOCALGOS-07 workshops Guest Editor of Special Issue on New Advances and Challenges in Smart Homes, Int'al Journal of Smart Home. My Erdos number is 3! (via Ivan Stojmenovic) I graduated in 2002 with a Ph.D. degree in Telematics from the University of Murcia. During last years I have held a few research positions including a \"Ramon y Cajal\" research career, Visiting Resarcher at ICSI in Berkeley, Research Associate within CCRG at Univ of California at Santa Cruz and Visiting Research Fellow within the CTR at King's College London. In addition, I also worked for the Spanish National Research Network (RedIRIS), Agora Systems S.A. and the Dept. of Telematic Enginieering of University Carlos III in Madrid. Currently I work in the area of Telematic Enginering at the Department of Information and Communications Engineering of the University of Murcia. My main research interests are related to analysis and designg of efficient communication protocols for highly distributed and heterogeneous systems including wireless ad hoc and sensor networks, mesh networks and vehicular ad hoc networks. Research Recent Publications Francisco J. Ros, Pedro M. Ruiz,  \"Minimum Broadcasting Structure for Optimal Data Dissemination in Vehicular Networks,\" IEEE Transactions on Vehicular Technology. Accepted for publication, 2013. J.J. Galvez, Pedro M. Ruiz, \"Efficient rate allocation, routing and channel assignment in Wireless Mesh Networks supporting dynamic traffic flows,\" Elsevier Ad Hoc Networks Journal. Aceptado para publicación. 2013. Francisco J. Ros, Pedro M. Ruiz, I. Stojmenovic, \"Acknowledgment-Based Broadcast Protocol for Reliable and Efficient Data Dissemination in Vehicular Ad Hoc Networks,\" IEEE Transactions on Mobile Computing, Vol. 11, No. 1, January 2012. J.J. Galvez, Pedro M. Ruiz, \"Responsive On-line Gateway Load-Balancing for Wireless Mesh Networks,\" Elsevier Ad Hoc Networks Journal (10), 2012, January 2012. Juan A. Sánchez, Rafael Marin-Perez, Pedro M. Ruiz, \"Beacon-less Geographic Multicast Routing in a Real-world Wireless Sensor Network Testbed,\" Springer Wireless Networks Journal, Vol. 18, no. 5, pp. 565-578. Ivan Lequerica, Miguel García Longarón, Pedro M. Ruiz, \"Drive and share: efficient provisioning of social networks in vehicular scenarios,\" IEEE Communications Magazine, Vol. 48, No. 11, November 2010. Ivan Lequerica, Pedro M. Ruiz, Victor Cabrera, \"Improvement of Vehicular Communications by Using 3G Capabilities to Disseminate Control Information,\" IEEE Network Magazine, Vol. 24, No. 1, January 2010. Juan A. Sanchez, Pedro M. Ruiz, Rafael Marin-Perez, \"Beacon-less geographic routing made practical: challenges, design guidelines, and protocols\", IEEE Communications Magazine, August 2009. J. Cartigny, Pedro M. Ruiz, D. Simplot-Ryl, I. Stojmenovic, C. Yago, \"Localized Minimum Energy Broadcasting for Wireless Multihop Networks with Directional Antennas,\" IEEE Transactions in Computers, 2009. Pedro M. Ruiz, R. Marin, F. Ros, J.A. Martinez, \"Enhanced Access Control in Hybrid MANETs Through Utility-based Preauthentication Control,\" Wiley Wireless Communications and Mobile Computing Journal (WCMC), 2009. Juan A. Sanchez, Rafael Marin-Perez, Pedro M. Ruiz, \"Beacon-less Geographic Routing in Real Wireless Sensor Networks,\" Journal of Computer Science and Technology, JCST, Vol. 23, no. 3, pp.438-450. Juan A. Sanchez, Pedro M. Ruiz, \"Locally Optimal Source Routing for Energy-Efficient Geographic Routing,\" Wireless Network (WINET) Journal. Juan A. Sanchez, Pedro M. Ruiz, \"Energy-Efficient Geographic Multicast Routing for Error-prone Wireless Sensor Networks,\" Wireless Communications and Mobile Computing (WCMC) Journal. Juan A. Sanchez, Rafael Marin, Pedro M. Ruiz, \"BOSS:Beaconless On-demand Strategy for Geographic Routing in Wireless Sensor Networks,\" in proc. of IEEE MASS-2007, October 2007, Pisa, Italy. Juan A. Sanchez, Pedro M. Ruiz, Jeniffer Liu, Ivan Stojmenovic, \"GMR: Geographic Multicast Routing for Wireless Sensor Networks,\" IEEE Sensors Journal, vol. 7, no. 5, pp.627-638. See all publications... Recent Research Projects T-CPS: Reaserch Cyberphysical Sytems for Transportation (AE-15240) MARTA: Advanced Communication Protocols for Vehicular Ad hoc Networks (CEN-2007-2006) MOTEGRID: Grid Arch. for Distributed Processing of WSNs Gathered Data (PII1C09-0101-9476) HospiSegur: Using Wireless Sensor Networks for the Secure Administration of Medications (FIT-350301-2007-15) See all previous projects... Recent Profesional Service Teaching Publicity Chair ICDCS 2013 TPC Member INFOCOM 2013 TPC Member IEEE LCN 2013 TPC Member IEEE WoWMoM 2013 TPC Member IEEE VTC 2013 Track Chair IEEE MASS 2012 TPC Member INFOCOM 2012 TPC Member IEEE LCN 2012 TPC Member IEEE WoWMoM 2012 Mini-Conference Co-Chair INFOCOM 2011 Demo-Chair IEEE MASS 2011Program Co-chair MobiWorld 2010TPC Member IEEE ICC 2010TPC Member IEEE GlobeCom 2010TPC Member IEEE MASS 2010TPC Member IEEE LCN 2010TPC Member ACM MSWiM 2010TPC Member IEEE VTC-spring 2010TPC Member IEEE WCNC 2010TPC Member ADHOCNETS 2010TPC Member IWCMC 2010TPC Member Special Sesion HSI-WSN-2010General Chair AD HOC NOW 2009 Program Co-chair VehiCom 2009Program Co-char InVeNET 2009Poster Co-chair ACM MSWiM 2009 Member IEEE IES Sub-Committee on WSNs Workshop Co-chair ACM MobiCom 2008 Program Co-Chair ACM HeterSenet 2008 Program Co-Chair LOCALGOS08 Publicity Co-Chair IEEE MASS 2008 See more... M.Sc. and Ph.D courses Master on New Technologies in Computer Science, Wireless Networks (1st year) Current Undergraduate Teaching (Degree on Computer Science Engineering) Degree on Computer Science Engineering Networking architectures (3rd year)   Mobile Computing (4th year)    Advanced Telematic Services (3rd year) Ph.D. Students Ivan Lequerica, Efficient communications in VANETs Juan A. Martinez, Efficient authentication in Hybrid Ad hoc Networks Former Ph.D Students Juan A. Sanchez, Geographic Multicast Routing in WSNs, graduated in 2006 Francisco J. Ros, Scalable Internet Connectivity for Hybrid Ad hoc Networks, graduated in 2011 Juan J. Galvez, Efficient Multipath Routing in Wireless Mesh Networks, graduated in 2012 Rafael Marin, Geographic Routing in Real Wireless Sensor networks, graduated in 2012 Former MSc StudentsFrancisco J. Galera, Routing in Realistic Ad hoc and Wireless Mesh NetworksPascual Cano, Energy efficient geographic routing in wireless sensor networksÁngel Bartomeu, Proposal for NEMO Route Optimization in vehicular networksFrancisco J. Ros, Ack-based Broadcasting for Reliable and Efficient Data Dissemination in VANETsJuan A. Martinez, Enhanced Access Control in Hybrid VANETs Through Pre-authenticationJuan J. Galvez, Spatial Path Separation for Multipath RoutingVictor Cabrera, Efficient Protocol for Multihop Routing in VANETs Last updated, 17 Mar. 2013",
  "content_length": 7854,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:44"
}