{
  "name": "Pedro Mediano",
  "homepage": "https://pmediano.gitlab.io",
  "status": "success",
  "content": "Pedro Mediano Search Pedro Mediano Coffee-powered beast-machine Department of Computing,Imperial College London Consciousness and Cognition Lab,University of Cambridge Partial information decomposition Can the whole be more than the sum of its parts? Most definitely. Complexity theory Emergence, self-organisation, and cellular automata. Altered states of consciousness Where does the brain go when the mind wanders off? Talk Philosophy of consciousness Hopefully, of the useful kind. Integrated information theory The promiment theory of consciousness, with a grain of salt. Information theory in neuroscience Do neurons talk if no one’s there to hear them? Selected Publications Reconciling emergences: An information-theoretic approach to identify causal emergence in multivariate data Rigorous theory of causal emegence based on information decomposition. Fernando Rosas, Pedro Mediano, Henrik Jensen, Anil Seth, Adam Barrett, Robin Carhart-Harris, Daniel Bor PDF Code DOI Effects of external stimulation on psychedelic state neurodynamics As John Lennon said: tripping is easy with eyes closed (or something like that). Pedro Mediano, Fernando Rosas, et al PDF A synergistic core for human brain evolution and cognition Large-scale study of synergy in resting-state fMRI shows links with cognition and human evolution. Andrea Luppi, Pedro Mediano, Fernando Rosas, et al PDF Lecturer (Assistant professor) Imperial College London Sep 2022 – Present London, UK Postdoctoral researcher University of Cambridge Oct 2019 – Sep 2022 Cambridge, UK Neuroscience intern DeepMind Apr 2018 – Sep 2018 London, UK Machine learning developer Wolfram Research Jun 2013 – Nov 2013 Oxford, UK About me Long ago, when the temperature of the universe was around 108 K, I did a Physics degree at the University of Valencia, Spain, truncating what could have otherwise been a promising career as a jazz melodica player. When I decided that neutrinos were interesting but not quite for me, I did a PhD at Imperial College and a postdoc at the University of Cambridge, where I (rather unsuccessfully, in all fairness) tried to solve the mysteries of consciousness and complexity. At the moment I continue to fail to solve consciousness and artificial intelligence as a lecturer at the Department of Computing, Imperial College London. Broadly speaking, my research lies at the intersection between consciousness science, information theory, complexity science, and machine learning. I strive to ground my research in solid mathematical and theoretical grounds, and whenever possible I publish open-source software to make my research accessible and reproducible. I also have a few online talks for both technical and general audiences you can find in this website. I often team up with my fantastic friends and collaborators Fernando Rosas and Andrea Luppi. They do awesome stuff, check out their papers too! For more information you can download my CV. Cite × Copy Download",
  "content_length": 2957,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:42"
}