{
  "name": "Pedro T. Monteiro",
  "homepage": "http://pedromonteiro.org",
  "status": "success",
  "content": "Pedro T. Monteiro @ INESC-ID/IST - Univ. Lisboa Pedro T. Monteiro Affiliation: INESC-ID / IST - Universidade de Lisboa Address: INESC-ID Lisboa Rua Alves Redol 9 P-1000-029 Lisboa PORTUGAL Email: Telef: Alameda campus - ext: 2320 / tel: +351 21 3100 320 TagusPark campus - ext: 5281 Index - Teaching - Supervision - Publications - Software - MEIC Scholarly IDs DBLP gScholar Pubmed WebofScience Scopus ORCID CiênciaID Research Interests - Algorithms, Formal verification, Model checking, Model revision, Boolean functions - Computational Biology, Bioinformatics, Regulatory networks, Logical modeling His research focuses on the formal and static analysis of biological regulatory networks using techniques like model checking and temporal logic to explore dynamical behaviors of qualitative models. He also investigates the impact of Boolean function structures on model dynamics and develops model revision procedures. He contributes to the development of tools such as GINsim for modeling genetic regulatory networks, EpiLog for simulating epithelial pattern formation, and is part of the CoLoMoTo consortium, promoting logical modeling standards. Additionally, he maintains YEASTRACT+, a repository for cross-species regulatory network analysis in yeast. Short CV Pedro T. Monteiro is an Associate Professor at the Department of Computer Science and Engineering of Instituto Superior Técnico (IST) - Universidade de Lisboa and a researcher at INESC-ID Lisboa in the Automated Reasoning and Software Reliability (ARSR) scientific area. Pedro T. Monteiro obtained a BSc and MSc from IST - Universidade Técnica de Lisboa (in Computer Science and Engineering), having then worked one year in the private sector. In 2010, he obtained a dual PhD from IST - Universidade Técnica de Lisboa (in Computer Science and Engineering) and Université Claude Bernard Lyon 1 (in Bioinformatique), developed mostly at the IBIS Group (Hidde de Jong) at INRIA Grenoble - Rhône-Alpes, France. He then held a Postdoctoral researcher position at Molecular Microbiology and Infection Unit (Mário Ramirez) from Instituto de Medicina Molecular (IMM), followed by a Postdoctoral researcher position at the Network Modelling group (Claudine Chaouiya) from Instituto Gulbenkian de Ciência (IGC). In 2013, he was the recipient of an Investigador FCT Starting Grant as a research fellow at INESC-ID Lisboa. In 2016 he joined the faculty of the CSE Dep. at IST - Universidade de Lisboa. During the spring semester of 2019, he was a Visiting researcher at the MABioS group at Institut de Mathématiques de Marseille (I2M), France. In 2020 he was promoted to Associate Professor. Since 2025, he is serving a two-year mandate (2025-2026) as Coordinator of the MSc in Computer Science and Engineering (MEIC), the largest and best MSc at IST - Universidade de Lisboa. He also served 2 years (2021-2022) as Deputy Coordinator, and 2 years (2023-2024) as Coordinator. He is also serving a two-year mandate (2025–2026) as a Counselor at the IST Pedagogical Council, representing the degree coordinators. Projects - PiCaSSo: Pediatric Palliative Care Support System, Task leader, funded by FCT in collaboration with CHULN-HSM - LAIfeBlood+: Artificial Intelligence for Blood Management, Task leader, funded by FCT in collaboration with IPST - FAIRY: FAIRification of YEASTRACT+ to Support Yeast-based Bioeconomy and Health, PI, funded by O.S.C.A.R.S. (Open Science Clusters' Action for Research & Society) Horizon Europe - LAIfeBlood: Artificial Intelligence for Blood Management, PI, funded by FCT in collaboration with IPST - BioData.pt: Portuguese Biological Data Network, Task leader, funded by FCT - MIXEDUP: Targeting pathogenesis and engineering cell factories: by developing mixed regulatory-metabolic genomic models in yeasts, Task leader, funded by FCT - ERGODiC: Formal methods for the analysis of modular gEnetic ReGulatOry network DynamiCs, PI, funded by FCT - CoMEDy: A COmputational Modelling platform for Epithelial DYnamics to explore the role of epithelial-mesenchymal transition and stemness acquisition in cancer recurrence, Task leader, funded by FCT - CANTROL: Deciphering the mechanisms of transcriptional regulation that control antifungal drug resistance in the pathogenic yeast Candida glabrata: aiming the development of improved diagnosis and therapeutic approaches, Task leader, funded by FCT - InvestigadorFCT: Towards a semi-automatic model revision of logical regulatory networks, PI, funded by FCT",
  "content_length": 4491,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:46"
}