{
  "name": "Pedro M. Ferreira",
  "homepage": "https://ciencias.ulisboa.pt/perfil/pmferreira",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Pedro Frazão Ferreira Contactos Departamento de Informática Sala/Gabinete 6.3.20 Ext. Principal 526320 Telefone Direto 217500645 Extensão pessoal 526320 Email pmferreira@ciencias.ulisboa.pt Carreira Docente Universitário Categoria Professor Associado Indicadores Orcid Scopus Google Scholar CiênciaVitae Interesses Científicos Cyber-Physical Systems; Data-Driven CyberSecurity; Buildings Energy Efficiency; Neural Networks; Machine Learning Scientific Interests Cyber-Physical Systems; Data-Driven CyberSecurity; Buildings Energy Efficiency; Neural Networks; Machine Learning Publicações selecionadas Pedro M. Ferreira, \"Entropy Based Unsupervised Selection of Data Sets for Improved Model Fitting\", in Proceedings of the 2016 International Joint Conference on Neural Networks (World Congress on Computational Intelligence), IEEE, Vancouver, Canada, July 2016. (Accepted) Antonio E Ruano, Shabnam Pesteh, Sergio Silva, Helder Duarte, Gonçalo Mestre, Pedro M Ferreira, Hamid R Khosravani, Ricardo Horta, \"The IMBPC HVAC system: A complete MBPC solution for existing HVAC systems\", Energy and Buildings, 120, pp. 145-158, Elsevier, 2016. Dionísio, N., Alves, F., Ferreira, P.M. and Bessani, A., 2019, July. Cyberthreat detection from twitter using deep neural networks. In 2019 international joint conference on neural networks (IJCNN) (pp. 1-8). IEEE. PM Ferreira, AE Ruano, S Silva, EZE Conceicao, \"Neural networks based predictive control for thermal comfort and energy savings in public buildings\", Energy and Buildings, 55, pp. 238-251, Elsevier, 2012 PM Ferreira, EA Faria, AE Ruano, \"Neural network models in greenhouse air temperature prediction\", Neurocomputing 43 (1), 51-75, Elsevier, 2002 Ver todas as Publicações",
  "content_length": 1883,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:42"
}