{
  "name": "Pedro Cabalar",
  "homepage": "https://www.dc.fi.udc.es/~cabalar",
  "status": "success",
  "content": "Pedro Cabalar's homepage Pedro Cabalar Full Professor Department of Computer Science Corunna University, Galicia, Spain Short bio. Teaching Research Publications Facultade de Informática, Campus de Elviña S/N E-15008, A Coruña, Spain. Tel.:   +34 881011265 Fax:    +34 981 167160 e-mail: Short Bio. Download a résumé paragraph Born in Cabanas, Corunna, on 20th of July of 1969 (Neil Armstrong was very busy that day...). Some facts, in reverse chronological order: October 23, 2023: full professorship, Dept. of Computer Science and IT, University of Corunna June 2023: visiting professor at the Institute of Logic and Computation, TU Wien, Vienna, Austria PhD course: Non-Monotonic Extension of Temporal Logic May 2022 - July 2022: research stay at the Institute of Logic and Computation, TU Wien, Vienna, Austria May 2010: research stay at Centro Universitario da FEI, São Paulo, Brazil. Nov. 2003: associate professor tenure at the Dept. of Computer Science of Corunna. Jun. 2003: Corunna University Dissertation Award. Dec. 2001: PhD in Computer Science (download dissertation). Apr. 2000 - Jun. 2000: research stay at the KR Lab., Dept. of Computer Science, University of Texas at El Paso, USA. Oct. 1997 - Nov. 2003: adjunct teacher at the Computer Science School of Corunna. Nov. 1995 - Oct. 1997: adjunct teacher at the Computer Science Technical School of Ourense, University of Vigo. Sep. 1993: Master Thesis \"Back-End de un compilador con optimizacion del uso de registros\". Jun. 1993: Master in Computer Science at the Computer Science School of Madrid, Politechnic University of Madrid. (admission plus 4th-6th courses). Jun. 1989: Bachelor in Computer Science (3 years), at the CS School of Corunna, University of Santiago de Compostela (now pertaining to Univ. of Corunna). (1st, 2nd and 3rd courses). External links Pedro Cabalar @ dblp Pedro Cabalar @ Researchgate Pedro Cabalar @ Google Scholar Pedro Cabalar @ ORCID (0000-0001-7440-0953) Research Research interests Knowledge Representation, Reasoning about Actions and Change Work in this field is oriented to temporal reasoning, action theories and languages (see Functional Action Language, FAL), the study of theoretical foundations of causality or the application to Qualitative Spatio-Temporal Reasoning. Logic Programming (LP) and Nonmonotonic Reasoning (NMR) both theoretical foundantions and practical applications. I'm interested in Answer Set Programming (ASP) and its logical characterisation, Equilibrium Logic, being specialised in extensions of ASP such as Temporal Equilibrium Logic, Functional ASP or Causal Logic Programming.  I am also interested in interpretations of general NMR (LP, Default Logic, Modal nonmonotonic logics, etc). Our group collaborates with the Potassco team and some of our members form the (preliminary) Spanish node of Potassco Solutions. Applied logics my research on the two topics above relies on applications of modal, temporal, multi-valued, intuitionistic and conditional logics, always under the perspective of their use for NMR. Our research group on logic in AI is integrated in the Information Retrieval Laboratory (IRLab), University of Corunna. Research projects and grants: GEISER: Generating Explanations in hybrid Intelligent Systems to Ensure Reliability PID2023-148531NB-I00, Spanish Ministry of Science, Innovation and Universities (MICIU), co-supervised with José Santos Reyes, 1/9/2024-31/8/2028. ARLEKIN: Automated Reasoning and Learning with Knowledge Induction PID2020-116201GB-I00, Spanish Ministry of Science and Innovation (MICINN), co-supervised with José Santos Reyes, September 2021 - August 2024. DigForASP: DIGital FORensics - evidence Analysis via intelligent Systems and Practices COST action CA-17124, European Cooperation in Science & Technology, Horizon 2020, European Union, October 2018 - September 2021. TARDIS: Temporal Automated Reasoning for Dynamic Intelligent Systems TIN2017-84453-P, Spanish Ministry of Economy and Competitivity (MINECO) January 2018 - December 2020. MERLOT: MEdical Reasoning with LOgical Tools TIN2013-42149-P, Spanish Ministry of Economy and Competitivity (MINECO) January 2014 - December 2016. FEAST: Foundations and Extensions of Answer Set Programming Technology TIN2009-14562-C05-04, Spanish Ministry of Science and Innovation (MICINN) inside a coordinated project with other 4 Spanish nodes: University of Málaga, Politechnic Univ. of Madrid, Univ. of Cadiz, and Univ. Rey Juan Carlos, Móstoles. January 2010 - December 2012. Logics, Deduction and Programming for Intelligent Systems: Extensions and Applications of Answer Set Programming TIN2006-15455-C03-02, Spanish Ministry of Education and Science (MEC) inside a coordinated project with University of Málaga (Spain), and Univ. Rey Juan Carlos, Móstoles (Spain). October 2006 - October 2009. Genetic Algorithms in Satisfiability Problems: Formal Study and Application to Answer Set Programming INCITE08-PXIB105159PR, Xunta de Galicia (Spain). October 2008 - October 2011. PhD supervising: Martín Diéguez Lodeiro, \"Temporal Answer Set Programming.\" PhD thesis, supervisor: Pedro Cabalar. Computer Science Department, Facultad de Informática, University of Corunna, February 23rd, 2015. Dissertation Award 2016. Jorge Fandiño García, \"A Causal Semantics for Logic Programming.\" PhD thesis, supervisor: Pedro Cabalar. Computer Science Department, Facultad de Informática, University of Corunna, September 11th, 2015. Brais Muñiz Castro. \"Generating Commonsense Explanations with Answer Set Programming.\" PhD thesis, supervisors: Pedro Cabalar and Gilberto Pérez. Department of Computer Science and Information Technologies, University of Corunna, June 25th, 2024. Other research activities include: Area Editor (Theory Foundations) of the journal Theory and Practice of Logic Programming (TPLP) Standard Editor of Artificial Intelligence journal (AIJ) Area Editor (Theoretical Foundations) of the ALP Newsletter, Association for Logic Programming from May 2010 to Sept. 2018. Scientific Editor of Inteligencia Artificial (Iberoamerican Journal of Artificial Intelligence) from Sept. 2007 to Sept. 2009. PC Co-chair of ICLP 2024 PC Co-chair and local organizer of LPNMR'13. Co-editor of the Special Issue on \"Equilibrium Logic and Answer Set Programming\" of the Journal of Applied Non-Classical Reasoning, 23(1-2), 2013. Program Committee member of IJCAI Intl. Joint Conf. on Artificial Intelligence (senior PC: 2023, 2021, 2020, 2019, 2018, 2016, as PC, 2017, 2015, 2013, 2011) KR Intl. Conf. on Principles of Knowledge Representation and Reasoning (2023, 2022, 2021, 2020, 2018, 2016, 2014, 2012) AAAI Conference on AI (2025, 2024, 2023, 2022, 2021, 2020, 2018, 2017, 2016, 2015, 2014, 2013, 2012, 2007) ECAI Europan Conf. on AI (2023, 2020, 2018, 2016, 2014) ICLP Intl. Conf. on Logic Programming (2023, 2022, 2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010, 2009) LPNMR Intl. Conf. on Logic Programming and Non-Monotonic Reasoning (2024, 2019, 2017, 2015, 2013 as PC co-chair, 2011, 2009, 2005) JELIA European Conference on Logics in AI (2023, 2021, 2019, 2016, 2014, 2012, 2010). International Joint Conference on Rules and Reasoning (RR+RuleML) (2023, 2022, 2021, 2020, 2019, 2018, 2017). CAEPIA Spanish Conference on AI (2020-21, 2016, 2015, 2013) Other conferences IBERAMIA'18, ESCIM'16, IBERAMIA'16, MICAI'10 ASPOCP Intl. Workshop on ASP and Other Computing Pardigms (2019, 2018, 2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009, 2008) . International Workshop on \"Experimental Evaluation of Algorithms for Solving Problems with Combinatorial Explosion\" (RCRA) (2018, 2017, 2016). Other workshops:  TAASP'16, STAIRS'16, GTTV'15, IULP'15, LANMR'11, LANMR'10, LANMR'09, Log-IC'09, , ASP'07, DRT'04. Reviewer for Journals: AIJ, JAIR, TPLP, JLC, JAL, ACM-ToCL, MVLSC, JIC, and IA. Reviewer for AMS Mathematical Reviews. Conferences: LPNMR'07, CSL'06, IJCAI'03, ICLP'14, CAEPIA'{97,99,01} Workshops: CENT'07 and LA-NMR'04 workshops. Organizer of LRC'15, LRC'18, LRC'22 and LRC'24 workshops. Co-organizer of HTNT'24, ACLAI'22, CAUSAL'20, DPSW'20, LRC'16, GTTV'11 and TARRAT'99 workshops. Former member of Management and Scientific Committees in CITIC Research Center (from 11/4/2017 to 21/11/2019). member of Texas Action Group member of associations: ACM, APPIA, AEPIA. Former member of AAAI. member of WASP (European Working Group on Answer Sets Programming, 2002-2005). Teaching coordinator Coordinator of the Master in Artificial Intelligence, Universities of A Coruña, Santiago de Compostela and Vigo (April 2022 - to date). past coordinator of the MSc in Computing and the PhD programme in Computer Science of the Department of Computer Science, University of Corunna (both from 2009 to 2012). Other tools an interpreter of Dijkstra's Guarded Command Language (GCL) Supervisor of: haspie- a tool for musical harmonization using Answer Set Programming, (in Spanish), Rodrigo Martín, Trabajo Fin de Grado, Univ. of Corunna, February 2016. Publications* by year * - the electronic versions of the papers included below correspond to either preliminary drafts, in a previous stage to their final publication, or open access publications in their final form. Unpublished drafts P. Cabalar, B. Muñiz, G. Pérez and F. Suárez, \"Explainable Machine Learning for Liver Transplantation\", unpublished draft. 2025 Pedro Cabalar, Martín Diéguez, François Olivier, Torsten Schaub and Igor Stéphan, \"Towards Constraint Temporal Answer Set Programming\", Theory and Practice of Logic Programming 25 (4), pp. 579-594, 2025. (Selected from ICLP 2025). Felicidad Aguado, Pedro Cabalar, Brais Muñiz, Gilberto Pérez and Concepción Vidal, \"Comparing Non-minimal Semantics for Disjunction in Answer Set Programming\", Theory and Practice of Logic Programming 25 (4), pp. 402-416, 2025. (Selected from ICLP 2025). Pedro Cabalar and Ovidio Manteiga, \"Deolingo: extending Answer Set Programming with Deontic Reasoning\", Proceedings of the 17th International Conference on Deontic Log",
  "content_length": 48239,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:36"
}