{
  "name": "Peer-Olaf Siebers",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/peer-olaf.siebers",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Peer-Olaf SiebersAssistant Professor in Computer Science, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsResearchPublications Contact workRoom B35 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/apeer-olaf.siebers@nottingham.ac.ukhttps://people.cs.nott.ac.uk/pszps/ BiographyMy main research topic is the application of Computer Simulation and Artificial Intelligence to study human-centric and coupled human-natural complex adaptive systems. I am a strong advocate of using Co-Creation for object oriented Agent-Based Modelling (ABM). This novel and highly interdisciplinary research agenda involves disciplines like Social Science, Economics, Marketing, Psychology, Geography, Operations Research, and Computer Science. My current research is primarily concerned with the following three areas. On the methodological frontier I aim to advance the model development strategies for ABM, through the Engineering Agent-Based Social Simulations (EABSS) toolkit. On the practical frontier I look at novel uses of simulation for studying Urban Sustainability (including Smart Cities and Smart Roads), modelling Human Behaviour in Floods using ABM and Virtual Reality, and modelling people's wellbeing at local and global scale. I was a co-investigator in the Leverhulme funded project Sustaining Urban Habitats. Furthermore, I am working together with Nottingham City Council's Transport Strategy Department on some Smart City projects. On the generative AI frontier I am looking into the use of Large Language Models to support and advance agent-based model design and implementation.Teaching SummaryCurrent Module(s) include: COMP4038 - Simulation and Optimisation for Decision Support Past Module(s) include: COMP2013 - Developing Maintainable SoftwareResearch SummaryMy current research focuses on further improving the Engineering Agent-Based Social Simulation (EABSS) framework, on applying agent-based modelling to support case study research in various domains,… read moreRecent Publications An up-to-date list of my publications can be found on my homepage. View all publications Current ResearchMy current research focuses on further improving the Engineering Agent-Based Social Simulation (EABSS) framework, on applying agent-based modelling to support case study research in various domains, and on exploring the role of Generative AI (Large Language Models) in advancing agent-based model design and implementation.Past ResearchAn up-to-date list of my past research can be found on my homepage.Future ResearchMy plans for future research include the development of a test-driven simulation modelling strategy, investigations into the use of simulation as a digital twin for continuous monitoring, analysis, and optimisation of systems, and the application of Generative AI in the context of data analysis and agent-based modelling. An up-to-date list of my publications can be found on my homepage. Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 3874,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:46"
}