{
  "name": "Peggy Gregory",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/peggygregory",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Peggy Gregory Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffPeggy GregoryMr Ethan KellyZhen Tian Dr Peggy Gregory Senior Lecturer in Software Engineering (Computing Science) telephone: 0141 330 8536 email: Peggy.Gregory@glasgow.ac.uk Room 410, Sir Alwyn Williams Building, Lilybank Gardens, Glasgow, G12 8RZ Import to contacts https://orcid.org/0000-0001-7891-6666 Biography I am a Senior Lecturer at Glasgow University. As an empirical researcher I investigate software engineering practice with the aim of developing theory and insights that result in improvements to practice. I focus on human and social aspects and use qualitative methods. My research involves working closely with industry partners to understand the context and complexity of specific practice challenges. I have worked with a wide range of private and public sector organisations from start-ups to multinationals and charities, and am interested in forming long term industry collaborations to improve the significance and impact of findings. I am a founder member of the Agile Research Network, a funded collaboration of academic researchers who have worked together for over ten years. As part of this collaboration I work with researchers at the OU and partner with the Agile Business Consortium. I am Chair of the XP Conference Series Steering Committee. My current research topics are agility, sustainability, and IT workplace practices. I am running funded projects in all these areas. Research interests My research interest is in empirical software engineering. I investigate processes and practices, agile software development, sustainability practices, agile transformation, software project management, and software engineering education. My work is human-centred, socio-technical, and often qualitative. It also encompasses the social and ethical impacts of digital technology development and use. Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019Number of items: 19.2025 Blair, Andrew ORCID: https://orcid.org/0000-0002-0453-1381, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666 and Foster, Mary Ellen ORCID: https://orcid.org/0000-0002-1228-7657 (2025) A Blessing or a Burden? Exploring Worker Perspectives of Using a Social Robot in a Church. In: 2025 IEEE International Conference on Robot and Human Interactive Communication (RO-MAN 2025), Eindhoven, The Netherlands, 25-29 Aug 2025, pp. 374-379. ISBN 9798331587710 (doi: 10.1109/RO-MAN63969.2025.11217840) Blair, Andrew, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666 and Foster, Mary Ellen ORCID: https://orcid.org/0000-0002-1228-7657 (2025) Observations of Atypical Users from a Pilot Deployment of a Public-Space Social Robot in a Church. PubRob-Fails: Workshop on Real-World HRI in Public and Private Spaces: Successes, Failures and Lessons Learned, 34th IEEE International Conference on Robot and Human Interactive Communication (RO-MAN), Eindhoven, The Netherlands, 25-29 Aug 2025. Uwasomba, Chukwudi, Deshpande, Advait, Sharp, Helen, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Willis, Rod, Barroca, Leonor, Uwadi, Maduka and Taylor, Katie (2025) Data-driven agility: assessing agile culture transformation in a technology organisation. Information and Software Technology, 183, 107729. (doi: 10.1016/j.infsof.2025.107729) Ghanta, Yogendra Naga Satwik, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666 and Calikli, Gul ORCID: https://orcid.org/0000-0003-4578-1747 (2025) Perspectives, Needs and Challenges for Sustainable Software Engineering Teams: A FinServ Case Study. In: 19th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM 2025), Honolulu, HI, USA, 28 September - 3 October 2025, (Accepted for Publication) Obode, Ehikioya, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Somerville, Derek and Deshpande, Advait (2025) Agile coaching research: a systematic mapping study. In: 26th International Conference on Agile Software Development (XP 2025), Brugg-Windisch, Switzerland, 02-05 Jun 2025, pp. 19-36. ISBN 9783031945434 (doi: 10.1007/978-3-031-94544-1_2) 2024 Moh'd, Shaima', Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Barroca, Leonor and Sharp, Helen (2024) Agile human resource management: a systematic mapping study. German Journal of Human Resource Management, 38(4), pp. 345-374. (doi: 10.1177/23970022231226316) Fasching, Chiara, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Mitchell, Nicholas and Frowd, Charlie (2024) Risk identification and mitigation in agile software re-engineering: a case study. Communications of the IIMA, 22(1), 3. (doi: 10.58729/1941-6687.1452) Blair, Andrew ORCID: https://orcid.org/0000-0002-0453-1381, Foster, Mary Ellen ORCID: https://orcid.org/0000-0002-1228-7657 and Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666 (2024) Human-Centered Design of Social Robots: Addressing Stakeholder Involvement to Enhance Long-Term Interaction Success. In: Socially Interactive Agent Applications Workshop in the 24th ACM International Conference on Intelligent Virtual Agents (IVA '24), Glasgow, UK, 16-19 Sep 2024, (Accepted for Publication) Nowland, Rebecca, McNally, Lara and Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666 (2024) Parents' use of digital technology for social connection during the COVID-19 pandemic: a mixed-methods study. Scandinavian Journal of Psychology, 65(3), pp. 533-548. (doi: 10.1111/sjop.12998) (PMID:38258304) 2023 Barroca, Leonor, Sharp, Helen, Deshpande, Advait, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666 and Papadeas, Stavros (2023) Sustaining agility: organizational change, factors and theoretical lenses. In: Stettina, Christoph J., Garbajosa, Juan and Kruchten, Philippe (eds.) Agile Processes in Software Engineering and Extreme Programming: 24th International Conference on Agile Software Development, XP 2023, Amsterdam, The Netherlands, June 13–16, 2023, Proceedings. Series: Lecture Notes in Business Information Processing (475). Springer, pp. 115-131. ISBN 9783031339752 (doi: 10.1007/978-3-031-33976-9_8) Nowland, Rebecca, Thomson, Gillian, Cross, Lucy, Whittaker, Karen, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Charles, Joanna M. and Day, Crispin (2023) Exploring blog narratives of parental loneliness: A thematic network analysis. Current Research in Behaviour Sciences, 5, 100137. (doi: 10.1016/j.crbeha.2023.100137) 2022 Strode, Diane E., Sharp, Helen, Barroca, Leonor, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666 and Taylor, Katie (2022) Tensions in organizations transforming to agility. IEEE Transactions on Engineering Management, 69(6), pp. 3572-3583. (doi: 10.1109/TEM.2022.3160415) Uwadi, Maduka, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Allison, Ian and Sharp, Helen (2022) Roles of Middle Managers in Agile Project Governance. In: 23rd International Conference on Agile Software Development (XP 2022), Copenhagen, Denmark, 13–17 June 2022, pp. 65-81. ISBN 9783031081682 (doi: 10.1007/978-3-031-08169-9_5) Weichbrodt, Johann, Kropp, Martin, Biddle, Robert, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Anslow, Craig, Buhler, Ursina Maria, Mateescu, Magdalena and Meier, Andreas (2022) Understanding Leadership in Agile Software Development Teams: Who and How? In: 23rd International Conference on Agile Software Development (XP 2022), Copenhagen, Denmark, 13–17 June 2022, pp. 99-113. ISBN 9783031081682 (doi: 10.1007/978-3-031-08169-9_7) Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Strode, Diane E., Sharp, Helen and Barroca, Leonor (2022) An onboarding model for integrating newcomers into agile project teams. Information and Software Technology, 143, 106792. (doi: 10.1016/j.infsof.2021.106792) 2021 Rigotti, Kevin, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666 and Fitton, Dan (2021) Design Discovery Practices: Engaging Professional Design Communities with Ketso. In: 34th British HCI Conference, London, UK, 20 - 21 July 2021, pp. 262-270. (doi: 10.14236/ewic/HCI2021.28) 2020 Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Strode, Diane E., Barroca, Leonor, Sharp, Helen and Taylor, Katie (2020) Stakeholder Perceptions of IT Business Value in a Public Sector IT Digitalisation Project. In: 28th European Conference on Information Systems (ECIS), 15-17 June 2020, ISBN 9781733632515 Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Strode, Diane E., AlQaisi, Raid, Sharp, Helen and Barroca, Leonor (2020) Onboarding: How Newcomers Integrate into an Agile Project Team. In: 21st International Conference on Agile Software Development (XP 2020), Copenhagen, Denmark, 8–12 June 2020, pp. 20-36. ISBN 978-3-030-49391-2 (doi: 10.1007/978-3-030-49392-9_2) 2019 Barroca, Leonor, Sharp, Helen, Dingsøyr, Torgeir, Gregory, Peggy ORCID: https://orcid.org/0000-0001-7891-6666, Taylor, Katie and AlQaisi, Raid (2019) Enterprise agility: a balancing act - a local government case study. In: Kruchten, Philippe, Fraser, Steven and Coallier, François (eds.) Agile Processes in Software Engineering and Extreme Programming: 20th International Confer",
  "content_length": 18798,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:48"
}