{
  "name": "Pei-Chi Huang",
  "homepage": "https://unocps.github.io",
  "status": "success",
  "content": "About me - Home Dr. Pei-Chi HuangAssociate Professor, the Department of Computer Science, the University of Nebraska at Omaha Follow Omaha, NE Google Scholar ORCIDDr. Pei-Chi Huang received her PhD in the Department of Computer Science from the University of Texas at Austin under the supervision of Prof. Aloysius K. Mok, and she joined the University of Nebraska Omaha as an assistant professor. Dr. Huang is currently looking for Master and PhD students, who are interested in her research. Preference will be given to candidates who have experience in her research interests.NewsAs a guest editor for the Journal of Electronics (ISSN 2079-9292), I am pleased to invite you to submit your work to our special issue, “Artificial Intelligence for Cyber-Physical Systems,” which is part of the “Computer Science & Engineering” section. You can find more details and submit your manuscript here: Special Issue on Artificial Intelligence for Cyber-Physical Systems. The deadline for submissions is 15 February 2025.I am a guest editor for Journal of a special issue of Electronics (ISSN 2079-9292). This special issue belongs to the section “Systems & Control Engineering”. Please consider submitting your work to our Special Issue on Recent Advances in Industrial Robots. Submission Deadline: April 30, 2023.I am a guest editor for Journal of Computer and Communications (JCC) Submssion: Please consider submitting your work to our Special Issue on Artificial Intelligence and Cyber-Physical Systems. Submission Deadline: March 15, 2021.Robotics, Networking, Artificial intelligence (R. N. A.) LaboratoryThe Robotics, Networking and Artificial intelligence (R.N.A.) laboratory houses the Center for Artificial Intelligence, Robotics, and Network Systems that encompasses the three areas of Cyber-Physical Systems, Computer Vision, and Networking.Research InterestsCyber-Physical Systems with Machine LearningReal-time Computing and Scheduling AlgorithmsWireless Communication/Networking SystemsContact Infophuang AT unomaha DOT eduOffice: PKI 173DPhone: (402) 554-3496",
  "content_length": 2067,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:46"
}