{
  "name": "Peihan Miao 0001",
  "homepage": "https://sites.google.com/view/peihanmiao/home",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationPeihan Miao 缪沛晗I am an Assistant Professor in the Department of Computer Science at Brown University. I am honored to be part of Brown's Theory Group.I received my Ph.D. from UC Berkeley in 2019 under the supervision of Sanjam Garg and my BS degree from ACM Honors Class at Shanghai Jiao Tong University. I am a recipient of the NSF CAREER Award, Meta Research Award, Google Research Scholar Award, and Amazon Research Award. Here is my CV. My research interests lie broadly in cryptography and security, with a focus on secure multi-party computation (both theoretical and applied). For Brown students: If you are interested in learning more about cryptography research, you are welcome to attend our crypto reading group. Subscribe to the crypto mailing list here for announcements!ContactEmail: peihan [at] brown.edu (or: peihan_miao [at] brown.edu)Office: 511 CITHow to pronounce my name: https://namedrop.io/peihanmiaoTeachingSpring 2025, 2024, 2023: CSCI 1515 Applied CryptographyFall 2024, 2023: CSCI 1510 Introduction to Cryptography and Computer SecurityFall 2022: CSCI 2952L Special Topics in Secure ComputationFall 2021, 2020: CS 494 Introduction to CryptographySpring 2021: CS 594 Secure Computation MentoringPhD: Xinyi Shi, Phuoc Van Long Pham, Jifeng WangPostdoc: Gayathri GarimellaPublicationsManuscriptsPseudorandom Correlation Generators for Multiparty Beaver Triples over F2 [eprint]Peihan Miao, Alice Murphy, Akshayaram Srinivasan, and Max Tromanhauser.PICS: Private Intersection over Committed (and reusable) Sets [eprint]Aarushi Goel, Peihan Miao, Phuoc Van Long Pham, and Satvinder Singh.New Framework for Structure-Aware PSI From Distributed Function Secret Sharing [eprint]Dung Bui, Gayathri Garimella, Peihan Miao, and Phuoc Van Long Pham.[26] Secure and federated quantitative trait loci mapping with privateQTL [link]Yoolim Annie Choi, Yebin Kim, Peihan Miao, Tuuli Lappalainen, and Gamze Gürsoy.In Cell Genomics Volume 5, Issue 2 (2025).[25] Finding Balance in Unbalanced PSI: A New Construction from Single-Server PIR [link]Chengyu Lin, Zeyu Liu, Peihan Miao, and Max Tromanhauser.In Communications in Cryptology (CiC) Volume 2, Issue 1 (2025).[24] Updatable Private Set Intersection Revisited: Extended Functionalities, Deletion, and Worst-Case Complexity [eprint]Saikrishna Badrinarayanan, Peihan Miao, Xinyi Shi, Max Tromanhauser, and Ruida Zeng. In Proceedings of the 30th International Conference on the Theory and Application of Cryptology and Information Security (ASIACRYPT) 2024.[23] Client-Aided Privacy-Preserving Machine Learning [eprint]Peihan Miao, Xinyi Shi, Chao Wu, and Ruofan Xu.In Proceedings of the 14th International Conference on Security and Cryptography for Networks (SCN) 2024.[22] Computation Efficient Structure-Aware PSI From Incremental Function Secret Sharing [eprint] [slides] [video]Gayathri Garimella, Benjamin Goff, and Peihan Miao.In Proceedings of the 44th International Cryptology Conference (CRYPTO) 2024.[21] Laconic Branching Programs from the Diffie-Hellman Assumption [eprint]Sanjam Garg, Mohammad Hajiabadi, Peihan Miao, and Alice Murphy.In Proceedings of the 27th International Conference on Practice and Theory of Public-Key Cryptography (PKC) 2024.[20] On the Round Complexity of Fully Secure Solitary MPC with Honest Majority [eprint]Saikrishna Badrinarayanan, Peihan Miao, Pratyay Mukherjee, and Divya Ravi.In Proceedings of the 21st Theory of Cryptography Conference (TCC) 2023.[19] Unidirectional Updatable Encryption and Proxy Re-encryption from DDH [eprint]Peihan Miao, Sikhar Patranabis, and Gaven Watson.In Proceedings of the 26th International Conference on Practice and Theory of Public-Key Cryptography (PKC) 2023.[18] Updatable Private Set Intersection [eprint]Saikrishna Badrinarayanan, Peihan Miao, and Tiancheng Xie.In Proceedings of the 22nd Privacy Enhancing Technologies Symposium (PoPETS) 2022.[17] Amortizing Rate-1 OT and Applications to PIR and PSI [eprint] [video]Melissa Chase, Sanjam Garg, Mohammad Hajiabadi, Jialin Li, and Peihan Miao.In Proceedings of the 19th Theory of Cryptography Conference (TCC) 2021.[16] Multi-Party Threshold Private Set Intersection with Sublinear Communication [eprint] [video]Saikrishna Badrinarayanan, Peihan Miao, Srinivasan Raghuraman, and Peter Rindal.In Proceedings of the 24th International Conference on Practice and Theory of Public-Key Cryptography (PKC) 2021.[15] Private Set Intersection in the Internet Setting From Lightweight Oblivious PRF [eprint] [video]Melissa Chase, and Peihan Miao.In Proceedings of the 40th International Cryptology Conference (CRYPTO) 2020.[14] Two-Sided Malicious Security for Private Intersection-Sum with Cardinality [eprint]Peihan Miao, Sarvar Patel, Mariana Raykova, Karn Seth, and Moti Yung.In Proceedings of the 40th International Cryptology Conference (CRYPTO) 2020.[13] Cut-and-Choose for Garbled RAM [eprint] [slides]Peihan Miao.In Proceedings of the Cryptographers' Track at the RSA Conference (CT-RSA) 2020.[12] Secretary Markets with Local Information [pdf]Ning Chen, Martin Hoefer, Marvin Künnemann, Chengyu Lin, and Peihan Miao.In Distributed Computing Volume 32 (2019).[11] Efficient Leakage Resilient Secret Sharing [pdf]Peihan Miao, Akshayaram Srinivasan, and Prashant Nalini Vasudevan.In NIST Threshold Cryptography Workshop 2019.[10] PASTA: PASsword-based Threshold Authentication [eprint] [short video] [long video]Shashank Agrawal, Peihan Miao, Payman Mohassel, and Pratyay Mukherjee.In Proceedings of the 25th ACM Conference on Computer and Communications Security (CCS) 2018.[9] Two-Round Multiparty Secure Computation Minimizing Public Key Operations [eprint] [video]Sanjam Garg, Peihan Miao, and Akshayaram Srinivasan.In Proceedings of the 38th International Cryptology Conference (CRYPTO) 2018.[8] Obfuscation from Low Noise Multilinear Maps [eprint]Nico Döttling, Sanjam Garg, Divya Gupta, Peihan Miao, and Pratyay Mukherjee.In Proceedings of the 19th International Conference on Cryptology in India (INDOCRYPT) 2018.[7] Laconic Oblivious Transfer and its Applications [eprint] [video]Chongwon Cho, Nico Döttling, Sanjam Garg, Divya Gupta, Peihan Miao, and Antigoni Polychroniadou.In Proceedings of the 37th International Cryptology Conference (CRYPTO) 2017.[6] Decentralized Anonymous Micropayments [eprint]Alessandro Chiesa, Matthew Green, Jingcheng Liu, Peihan Miao, Ian Miers, and Pratyush Mishra.In Proceedings of the 36th Annual International Conference on the Theory and Applications of Cryptographic Techniques (EUROCRYPT) 2017.[5] Secure Multiparty RAM Computation in Constant Rounds [eprint]Sanjam Garg, Divya Gupta, Peihan Miao, and Omkant Pandey.In Proceedings of the 14th  Theory of Cryptography Conference (TCC) 2016-B.[4] Nordhaus-Gaddum-Type Problems for Lines in Hypergraphs [arxiv]Xiaomin Chen, and Peihan Miao.In Discrete Applied Mathematics Volume 198 (2016).[3] Secretary Markets with Local Information [pdf] Ning Chen, Martin Hoefer, Marvin Künnemann, Chengyu Lin, and Peihan Miao.In Proceedings of the 42nd International Colloquium on Automata, Languages, and Programming (ICALP) 2015.[2] Graph Metric with No Proper Inclusion Between Lines [arxiv]Xiaomin Chen, Guangda Huzhang, Peihan Miao, and Kuan Yang. In Discrete Applied Mathematics Volume 185 (2015).[1] Number of Lines in Hypergraphs [arxiv]Pierre Aboulker, Adrian Bondy, Xiaomin Chen, Ehsan Chiniforooshan, Vašek Chvátal, and Peihan Miao.In Discrete Applied Mathematics Volume 171 (2014).ServiceProgram Committees2025: Crypto, TCC2024: CiC, Crypto, Asiacrypt, PPML@Crypto2023: TCC2022: Eurocrypt2021: PKC, AsiaCCS, Crypto, PPML@CCS2020: PPML@NeurIPSMentoring Workshop and Videos (@CRYPTO 2021)Check out the Mentoring Videos on questions such asHow to prepare a good talk? Was there a time when you doubted yourself? How do you find a research topic?and many many more questions, all answered by researchers in our field. There are many familiar faces.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 8049,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:47"
}