{
  "name": "Peisen Yao",
  "homepage": "https://rainoftime.github.io",
  "status": "success",
  "content": "Yao PeisenAssistant Professor (ZJU 100 Young Professor) School of Cyber Science and Technology College of Computer Science and Technology Zhejiang University Office: Room 311, Tower B06, ZJU-Hangzhou Global Scientific and Technological Innovation Center Office*: Room 216, Shaw Business Administration Building, Yuquan Campus, Zhejiang University Email: pyaoaa@zju.edu.cn Official homepage at ZJU: https://person.zju.edu.cn/pyao [ Publications ] [ Awards ] [ Software ] [ Service ] [ Teaching ] [ Students ] [ Misc ] News I am looking for self-motivated students! Please read this if you are interested in working with me (e.g., for Ph.D., Master, SRTP, and FYP). z3-owl ranked 3rd in the single-query tracks of OF_ABV, QF_AUFBV, and QF_BVFP at SMT-COMP 2025. We have released Lotus, a versatile and industrial-scale program analysis framework (ISSTA'25, OOPSLA'22) I am currently on the program committee of ISSTA 2026 and PLDI 2026. Please consider submitting a paper! Research Interests I am broadly interested in programming languages, software engineering, and cybersecurity, focusing on techniques that make software secure, usable, and fast. Current Research Program Analysis and Verification Path sensitivity [TOSEM'24] [PLDI'21a] [ISSTA'20], context sensitivity (via CFL-reachability) [OOPSLA'22a] Alias analysis [PLDI'24] [ISSTA'24 ] [TOSEM'23] [OOPSLA'22a] Numerical analysis [ISSTA'25] [ASE'23a] [ICSE'22] [OOPSLA'21] [ASE'21] Concurrency analysis [USENIX Security'23] [PLDI21'b], change impact analysis [ASE'23b] Fuzzing: directed [S&P'24] [S&P'22 ], sheduling [TDSC'23], hybrid [S&P'20], oracle [ESEC/FSE'21], configurations [ISSTA'21] Program Synthesis and Optimizations Program synthesis for code search [ECOOP'23] and translation [TOSEM'25] [ASPLOS'24] Optimizations of Java collections [OOPSLA'22b ] and database-backed applications [ICSE'23] Logic and Automted Reasoning Monadic predicate abstraction [preprint] Symbolic abstraction [OOPSLA'21] A formalization of conditional independence [ICSE'24] Manuscripts Analyzing the Analyzers: Model Counting Meets Abstract Interpretation. Junda Zheng, Peisen Yao, and Yuan Li. Working paper. Efficient Query Processing for Persistent Pointer Information. Zinan Gu, Peisen Yao, and Kui Ren. Working paper. Synthesizing Best Inductive Invariants. Hanrui Zuo, Peisen Yao, and Kui Ren. Working paper. Parallelizing Symbolic Abstraction. Weiqi Wang, Peisen Yao, Yuan Li, Hanrui Zuo, Hongfei Fu, and Kui Ren. Working paper. Boosting Compiler Optimization-Based SMT Simplifications. Hanyun Jiang, Peisen Yao, Jiachen Lu, Yongwang Zhao, and Kui Ren. Working paper. Monadic Predicate Abstraction. Jiening Siow, Hanrui Zuo, Hanyun Jiang, Weiqi Wang, Tingting Lin, and Peisen Yao. Working paper. [preprint] Selected Publications SAS 2025: Bounded-Exhaustive Subspace Diversification for SMT Solver Testing Junda Zheng and Peisen Yao The 32nd Static Analysis Symposium ISSTA 2025: Program Analysis Combining Generalized Bit-Level and Word-Level Abstractions Guangsheng Fan, Liqian Chen, Banghu Yin, Wenyu Zhang, Peisen Yao, and Ji Wang The ACM SIGSOFT International Symposium on Software Testing and Analysis FSE 2025: Understanding Industry Perspectives of Static Application Security Testing (SAST) Evaluations Yuan Li, Peisen Yao*, Kan Yu, Chengpeng Wang, Yaoyang Ye, Song Li, Meng Luo, Yepang Liu, Kui Ren The ACM International Conference on the Foundations of Software Engineering TOSEM 2025: KBX: Verified Model Synchronization via Formal Bidirectional Transformation Jianhong Zhao, Yongwang Zhao, Peisen Yao, Fanlang Zeng, Bohua Zhan, and Kui Ren ACM Transactions on Software Engineering and Methodology PLDI 2024: Falcon: A Fused Approach to Path-Sensitive Sparse Data Dependence Analysis Peisen Yao, Jinguo Zhou, Xiao Xiao, Qingkai Shi, Rongxin Wu, and Charles Zhang The ACM SIGPLAN Conference on Programming Language Design and Implementation The first PLDI paper from ZJU! ASPLOS 2024: SIRO: Empowering Version Compatibility in Intermediate Representations via Program Synthesis Bowen Zhang, Wei Chen, Peisen Yao, Chengpeng Wang, Wensheng Tang, and Charles Zhang ACM International Conference on Architectural Support for Programming Languages and Operating Systems ISSTA 2024: Precise Compositional Buffer Overflow Detection via Heap Disjointness Yiyuan Guo, Peisen Yao*, and Charles Zhang The ACM SIGSOFT International Symposium on Software Testing and Analysis ACM SIGSOFT Distinguished Paper Award TOSEM 2024: Octopus: Scaling Value-Flow Analysis via Parallel Collection of Realizable Path Conditions Wensheng Tang, Dejun Dong, Shijie Li, Chengpeng Wang, Peisen Yao, Jinguo Zhou, and Charles Zhang ACM Transactions on Software Engineering and Methodology ICSE 2024: Enabling Runtime Verification of Causal Discovery Algorithms with Automated Conditional Independence Reasoning Pingchuan Ma, Zhenlan Ji, Peisen Yao, Shuai Wang, and Kui Ren The 2024 IEEE/ACM International Conference on Software Engineering S&P 2024: Titan: Efficient Multi-target Directed Greybox Fuzzing Heqing Huang, Peisen Yao*, Hung-Chun Chiu, Yiyuan Guo, and Charles Zhang The 45th IEEE Symposium on Security and Privacy (Oakland) ASE 2023a: Demystifying Template-based Invariant Generation for Bit-Vector Programs Peisen Yao, Jingyu Ke, Jiahui Sun, Hongfei Fu, Rongxin Wu, and Kui Ren The 2023 IEEE/ACM Automated Software Engineering Conference ASE 2023b: DCLink: Bridging Data Constraint Changes and Implementations in FinTech Systems Wensheng Tang, Chengpeng Wang, Peisen Yao, Rongxin Wu, Xianjin Fu, Gang Fan, and Charles Zhang The 2023 IEEE/ACM Automated Software Engineering Conference ECOOP 2023: Synthesizing Conjunctive Queries for Code Search Chengpeng Wang, Peisen Yao*, Wensheng Tang, Gang Fan, and Charles Zhang European Conference on Object-Oriented Programming TDSC 2023: Balance Seed Scheduling via Monte Carlo Planning Heqing Huang, Hung-Chun Chiu, Qingkai Shi, Peisen Yao, and Charles Zhang IEEE Transactions on Dependable and Secure Computing ICSE 2023: Verifying Data Constraint Equivalence in FinTech Systems Chengpeng Wang, Gang Fan, Peisen Yao*, Fuxiong Pan, and Charles Zhang The 2023 IEEE/ACM International Conference on Software Engineering USENIX Security 2023: Place Your Locks Well: Understanding and Detecting Lock Misuse Bugs Yuandao Cai, Peisen Yao*, Chengfeng Ye, and Charles Zhang The 32nd USENIX Security Symposium TOSEM 2023: Anchor: Fast and Precise Value-Flow Analysis for Containers via Memory Orientation Chengpeng Wang, Wenyang Wang, Peisen Yao*, Qingkai Shi, Jinguo Zhou, Xiao Xiao, and Charles Zhang ACM Transactions on Software Engineering and Methodology OOPSLA 2022a: Indexing the Extended Dyck-CFL Reachability for Context-Sensitive Program Analysis Qingkai Shi, Yongchao Wang, Peisen Yao, and Charles Zhang The 37th ACM SIGPLAN Conference on Objected Oriented Programming, Systems, Languages, and Applications OOPSLA 2022b: Complexity-Guided Container Replacement Synthesis Chengpeng Wang, Peisen Yao*, Wensheng Tang, Qingkai Shi, and Charles Zhang The 37th ACM SIGPLAN Conference on Objected Oriented Programming, Systems, Languages, and Applications ACM SIGPLAN Distinguished Paper Award ICSE 2022: Precise Divide-By-Zero Detection with Affirmative Evidence Yiyuan Guo, Jinguo Zhou, Peisen Yao*, Qingkai Shi, and Charles Zhang The 2022 IEEE/ACM International Conference on Software Engineering S&P 2022: BEACON: Directed Grey-Box Fuzzing with Provable Path Pruning Heqing Huang, Yiyuan Guo, Qingkai Shi, Peisen Yao, Rongxin Wu, and Charles Zhang The 43rd IEEE Symposium on Security and Privacy (Oakland) Google Research Paper Rewards PhD Thesis: Solidifying and Scaling SMT-based Program Analysis, 2022. HKUST Honorable Mention in the CSE Best Dissertation Award, HKUST OOPSLA 2021: Program Analysis via Efficient Symbolic Abstraction Peisen Yao, Qingkai Shi, Heqing Huang, and Charles Zhang The 36th ACM SIGPLAN Conference on Objected Oriented Programming, Systems, Languages, and Applications (One of the algorithms has been integrated into SVF) ASE 2021: Transcode: Detecting Status Code Mapping Errors in Large-Scale Systems Wensheng Tang, Yikun Hu, Gang Fan, Peisen Yao, Rongxin Wu, Guangyuan Bai, Pengcheng Wang, and Charles Zhang The 2021 IEEE/ACM Automated Software Engineering Conference ESEC/FSE 2021: Skeletal Approximation Enumeration for SMT Solver Testing Peisen Yao, Heqing Huang, Wensheng Tang, Qingkai Shi, Rongxin Wu, and Charles Zhang The ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering ISSTA 2021: Fuzzing SMT Solvers via Two-Dimensional Input Space Exploration Peisen Yao, Heqing Huang, Wensheng Tang, Qingkai Shi, Rongxin Wu, and Charles Zhang The 30th ACM SIGSOFT International Symposium on Software Testing and Analysis PLDI 2021a: Path-Sensitive Sparse Analysis without Path Conditions Qingkai Shi, Peisen Yao, Rongxin Wu, and Charles Zhang The 42nd ACM SIGPLAN Conference on Programming Language Design and Implementation PLDI 2021b: Canary: Practical Static Detection of Inter-Thread Value-Flow Bugs Yuandao Cai, Peisen Yao, and Charles Zhang The 42nd ACM SIGPLAN Conference on Programming Language Design and Implementation ISSTA 2020: Fast Bit-Vector Satisfiability Peisen Yao, Qingkai Shi, Heqing Huang, and Charles Zhang The 29th ACM SIGSOFT International Symposium on Software Testing and Analysis S&P 2020: Pangolin: Incremental Hybrid Fuzzing with Polyhedral Path Abstraction Heqing Huang, Peisen Yao, Rongxin Wu, Qingkai Shi, and Charles Zhang The 41st IEEE Symposium on Security and Privacy (Oakland) Honors & Awards Third-place in the single-query tracks of OF_ABV, QF_AUFBV, and QF_BVFP, SMT-COMP 2025 ACM SIGSOFT Distinguished Paper Award (ISSTA 2024) CCF-Huawei Innovation Research Award (2023-formal method, 2024-compilers) NSFC Excellent Young Scientists Program (Overseas) 国家高层次青年人才计划 Google Research Paper Rewards, 2022 ACM SIGPLAN Distinguished Paper Award (OOPSLA 2022) Qizhen Scholar of ZJU (浙江大学启真优秀青年学者) Ho",
  "content_length": 16439,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:48"
}