{
  "name": "Peixiang Zhao 0001",
  "homepage": "http://www.cs.fsu.edu/~zhao",
  "status": "success",
  "content": "Peixiang Zhao - Florida State University Peixiang Zhao Department of Computer Science Florida State University Office: 361 James J. Love Building Address:   1017 Academic Way Tallahassee, Florida 32306 (Map) Email:    pzhao [AT] fsu [DOT] edu FSU Calendar || Home | Research | Publication | Teaching | Link || Bio Sketch I am a professor of the Department of Computer Science at the Florida State University. My research interest centers around data/network science, database systems, data mining, and data-intensive computing. Specifically, I have been focused on the foundations, methodologies, and systems for modeling, querying, and mining big, graph-structured data, such as large-scale graph databases and mathematical, physical, biological, and social networks, which are ubiquitous in a wide spectrum of disciplines and application domains, ranging from bioinformatics and computer systems, to business processes, social media, and the Web. My research has been recognized and funded in part by AFOSR-YIP (Air Force Office of Scientific Research-Young Investigator Program award), ARO-YIP (Army Research Office-Young Investigator Program award), NSF, Danfoss Turbocor, and FSU. Prior to joining FSU, I got my Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign (UIUC) in 2012, under the guidance of Prof. Jiawei Han. I got my M.S. and B.S. degrees from Computer Science at Peking University (PKU) in 2004 and 2001, respectively, and I used to be a Ph.D. student at the Chinese University of Hong Kong in 2004-2007, under the guidance of Prof. Jeffrey X. Yu. As a summer intern, I worked at Microsoft Research Asia (Beijing, China) and Microsoft Research (Redmond, Washington) in 2011 and 2010, respectively, and IBM Research (Yorktown Heights, New York) and IBM Research (Hawthorne, New York) in 2009 and 2008, respectively.",
  "content_length": 1858,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:50"
}