{
  "name": "Peizhong Ju",
  "homepage": "https://functionadvanced.github.io/PeizhongJu",
  "status": "success",
  "content": "Peizhong's Homepage About Me Hello, I'm Peizhong Ju, an Assistant Professor in the Department of Computer Science of University of Kentucky. I earned my Ph.D. degree from Purdue University in 2021 and my B.S. degree from Peking University in 2016. My research area includes machine learning, smart grid, optimization, and wireless communication. My recent research focuses on theories for explaining the performance of machine learning models. Before that, I worked on power systems and wireless communication. Generally speaking, the goal of my research is to use rigorous mathematical analysis (including probability theory, optimization, game theory, and random matrix theory) to understand the fundamental limits of a complex system under uncertainty and/or disturbance. You can contact me at peizhong.ju@uky.edu Copy My office location and phone number are available on my faculty webpage at University of Kentucky. My CV (as a pdf file) is here (Last updated: Nov 10, 2025). Check out my Google Scholar profile for a list of my publications. News On July 25, 2025, one of our papers on classification on edge devices was accepted by ACM MobiHoc'25. 🎉🎉 On May 8-9, 2025, I participated in AIMACCS'25 and served as a panelist for the session \"Thriving in Today's Job Market: Finding, Excelling, and Evolving in Your Career\" at the Ohio State University, Columbus, OH. On May 1, 2025, two of our papers were accepted by ICML'25: one on federated split learning and another on continual learning. 🎉🎉 On Feb 28, 2025, I presented our PSMGD work and chaired an oral session at AAAI'25 at Pennsylvania Convention Center, Philadelphia, Pennsylvania. On Feb 11, 2025, our paper \"How to Find the Exact Pareto Front for Multi-Objective MDPs?\" is selected to be presented as a Spotlight (5.1% of the submitted papers) by ICLR'25. On Jan 22, 2025, three of our papers were accepted by ICLR'25: two focused on diffusion models and one exploring multi-objective MDPs. On Jan 15-16, 2025, I attended the NeTS Early Career Workshop 2025 at NSF in Alexandria, VA On Dec 9, 2024, our research paper on Fast Multi-Objective Optimization was accepted to AAAI'25. I joined the Department of Computer Science of University of Kentucky in August, 2024. Photo On Jul 28, 2024, two of our papers were accepted by MobiHoc'24. One is about Federated Learning, and another is on network-edge classification. On Jan 16, 2024, two of my papers on Reinforcement Learning were accepted by ICLR'24. On Jul 27, 2023, I and Sen Lin presented our continual learning work at ICML'23 at the Hawaii Convention Center, Honolulu. On Jul 20, 2023, The Ohio State University News reported our continual learning research in a press release: \"Future AI algorithms have potential to learn like humans, say researchers.\" Experience Assistant Professor 2024 - Present Department of Computer Science at University of Kentucky, Lexington, KY, USA Postdoctoral Scholar 2021 - 2024 ECE department at The Ohio State University, Columbus, OH, USA NSF AI Institute on Future Edge Networks and Distributed Intelligence (AI-EDGE) Ph.D. in Electrical and Computer Engineering 2016 - 2021 Purdue University, West Lafayette, IN, USA B.Sc. in Electrical Engineering 2012 - 2016 Peking University, Beijing, China Honors & Awards Best Paper Award, 13th ACM International Conference on Future Energy Systems (ACM e-Energy 2022) The Bilsland Dissertation Fellowship, Purdue University, 2021 Best Paper Award Finalist of 9th ACM International Conference on Future Energy Systems (ACM e-Energy 2018) Outstanding Graduate Award of EE department of Peking University, 2016 (the only one that year) Outstanding Graduate Award of Peking University, 2016 IEEE Student Grant, 2015 Research Excellence Award, Peking University, 2015 China National Scholarship, 2015 Samsung Scholarship, 2014 Award of excellence, OpenHW2014 open source hardware and embedded computing contest (awarded by ARM and XILINX), 2014 EMC Scholarship, 2013 Research Postdoctoral Scholar, the Ohio State University Supervisor: Prof. Ness B. Shroff. Multi-agent Reinforcement Learning, Multi-task supervised learning, Generalization Performance Analysis. (Oct. 2021 - Aug. 2024) Research Assistant, Purdue University Advisor: Prof. Xiaojun Lin. Overfitting in Machine Learning (Oct. 2019 - Sept. 2021) Market Design for Renewable in Power Distribution Level (Aug. 2018 - Oct. 2019) Voltage Control in Power Grid with Renewable (Aug. 2016 - Aug. 2018) Undergraduate Research Assistant, Peking University, China Advisor: Prof. Xiang Cheng. Antenna Grouping for Massive MIMO (Sep. 2015 - June 2016) Self-Interference Cancellation for Full-Duplex (Oct. 2013 - Sep. 2015) Publications Conference Papers Chengzhang Li, Peizhong Ju, Atilla Eryilmaz, and Ness B. Shroff, \"Two Levels Are All You Need: Simplifying Data Compression for Timely Edge Classification,\" 26th International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing (MobiHoc'25), 2025 . paper (open access) BibTeX @inproceedings{li2025two, title={Two Levels Are All You Need: Simplifying Data Compression for Timely Edge Classification}, author={Li, Chengzhang and Ju, Peizhong and Eryilmaz, Atilla and Shroff, Ness}, booktitle={Proceedings of the Twenty-sixth International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing}, pages={301--310}, year={2025} } Srijith Nair, Michael Lin, Peizhong Ju, Amirreza Talebi, Elizabeth Serena Bentley, and Jia Liu, \"FSL-SAGE: Accelerating Federated Split Learning via Smashed Activation Gradient Estimation,\" 42nd International Conference on Machine Learning (ICML'25). arXiv version BibTeX @inproceedings{nair2025fsl, title={FSL-SAGE: Accelerating Federated Split Learning via Smashed Activation Gradient Estimation}, author={Nair, Srijith and Lin, Michael and Ju, Peizhong and Talebi, Amirreza and Bentley, Elizabeth and Liu, Jia}, booktitle={International Conference on Machine Learning}, year={2025}, organization={PMLR} } Junze Deng, Qinhang Wu, Peizhong Ju, Sen Lin, Yingbin Liang, and Ness Shroff, \"Unlocking the Power of Rehearsal in Continual Learning: A Theoretical Perspective,\" 42nd International Conference on Machine Learning (ICML'25). arXiv version BibTeX @inproceedings{deng2025unlocking, title={Unlocking the Power of Rehearsal in Continual Learning: A Theoretical Perspective}, author={Deng, Junze and Wu, Qinhang and Ju, Peizhong and Lin, Sen and Liang, Yingbin and Shroff, Ness}, booktitle={International Conference on Machine Learning}, year={2025}, organization={PMLR} } Yining Li, Peizhong Ju, and Ness B. Shroff, \"How to Find the Exact Pareto Front for Multi-Objective MDPs?\" 13th International Conference on Learning Representations (ICLR'25). spotlight arXiv version BibTeX @inproceedings{ li2024find, title={How to Find the Exact Pareto Front for Multi-Objective {MDPs}?}, author={Yining Li and Peizhong Ju and Ness B. Shroff}, booktitle={The Thirteenth International Conference on Learning Representations}, year={2025} } Yuchen Liang, Peizhong Ju, Yingbin Liang, and Ness B. Shroff, \"Theory on Score-Mismatched Diffusion Models and Zero-Shot Conditional Samplers,\" 13th International Conference on Learning Representations (ICLR'25). arXiv version BibTeX @inproceedings{ liang2024theory, title={Theory on Score-Mismatched Diffusion Models and Zero-Shot Conditional Samplers}, author={Yuchen Liang and Peizhong Ju and Yingbin Liang and Ness Shroff}, booktitle={The Thirteenth International Conference on Learning Representations}, year={2025} } Yuchen Liang, Peizhong Ju, Yingbin Liang, and Ness B. Shroff, \"Broadening Target Distributions for Accelerated Diffusion Models via a Novel Analysis Approach,\" 13th International Conference on Learning Representations (ICLR'25). arXiv version BibTeX @inproceedings{ liang2024broadening, title={Broadening Target Distributions for Accelerated Diffusion Models via a Novel Analysis Approach}, author={Yuchen Liang and Peizhong Ju and Yingbin Liang and Ness Shroff}, booktitle={The Thirteenth International Conference on Learning Representations}, year={2025} } Mingjing Xu, Peizhong Ju, Jia Liu, and Haibo Yang, \"PSMGD: Periodic Stochastic Multi-Gradient Descent for Fast Multi-Objective Optimization,\" 39th AAAI Conference on Artificial Intelligence (AAAI'25). arXiv version BibTeX @inproceedings{xu2025psmgd, title={PSMGD: Periodic stochastic multi-gradient descent for fast multi-objective optimization}, author={Xu, Mingjing and Ju, Peizhong and Liu, Jia and Yang, Haibo}, booktitle={Proceedings of the AAAI Conference on Artificial Intelligence}, volume={39}, number={20}, pages={21770--21778}, year={2025} } Peizhong Ju, Haibo Yang, Jia Liu, Yingbin Liang, and Ness B. Shroff, \"Can We Theoretically Quantify the Impacts of Local Updates on the Generalization Performance of Federated Learning?\" 25th International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing (MobiHoc'24), 2024 . arXiv version BibTeX @inproceedings{ju2024can, title={Can We Theoretically Quantify the Impacts of Local Updates on the Generalization Performance of Federated Learning?}, author={Ju, Peizhong and Yang, Haibo and Liu, Jia and Liang, Yingbin and Shroff, Ness}, booktitle={Proceedings of the Twenty-fifth International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing (MobiHoc'24)}, pages={141--150}, year={2024} } Chengzhang Li, Peizhong Ju, Atilla Eryilmaz, and Ness B. Shroff, \"Efficient Multi-dimensional Compression for Network-edge Classification,\" 25th International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing (MobiHoc'24), 2024 . paper BibTeX @inproceedings{li2024efficient, title={Efficient Multi-dimensional Compression for Network-edge Classification}, author={Li, Chengzhang and Ju, Peizhong and Eryilmaz, Atilla and Shroff, Ness},",
  "content_length": 21560,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:49"
}