{
  "name": "Pekka Jääskeläinen",
  "homepage": "https://researchportal.tuni.fi/en/persons/pekka-j%C3%A4%C3%A4skel%C3%A4inen",
  "status": "success",
  "content": "Pekka Jääskeläinen - Tampere University Research Portal View Scopus Profile Pekka Jääskeläinen Professor, Computing SciencesSoC Hub https://orcid.org/0000-0001-5707-8544 20062025 Research activity per year Personal profile Grants and awards01.08.2017 - 30.11.2017. . . Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationDoctor of Science (Technology), Information TechnologyAward Date: 5 Dec 2012Master of Science (Technology), Information TechnologyAward Date: 21 Sept 2005 Fingerprint Dive into the research topics where Pekka Jääskeläinen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Transport Triggered Architecture Keyphrases 100% Datapath Computer Science 91% Graphics Processing Unit Computer Science 86% OpenCL Keyphrases 82% Field Programmable Gate Arrays Computer Science 69% Computer Hardware Computer Science 68% Energy Efficiency Computer Science 63% ray-tracing Computer Science 56% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2006 2011 2014 2015 2016 2018 2019 2020 2022 2024 2025 88 Conference contribution 42 Article 3 Chapter 2 Abstract 7 More 2 Software 1 Doctoral thesis 1 Master's thesis 1 Editorial 1 Review Article 1 Other contribution Research output per year Research output per year Automatically Retargeting Hardware and Code Generation for RISC-V Custom InstructionsHepola, K., Ranasinghe Arachchige, T., Multanen, J. & Jaaskelainen, P., 2025, In: IEEE Transactions on Very Large Scale Integration (VLSI) Systems. 33, 10, p. 2852-2861Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile RISC-V 100% Rocket 75% Interface Protocol 25% Hardware Compiler 25% Hardware Extension 25% 1 Citation (Scopus) 1 Downloads (Pure) CV-Cast: Computer Vision-Oriented Linear Coding and TransmissionZadnik, J., Kieffer, M., Trioux, A., Mäkitalo, M. & Jääskeläinen, P., 2025, In: IEEE Transactions on Mobile Computing. 24, 2, p. 1149-1162 14 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Channel Quality 100% Computer Vision 100% Transmission Scheme 66% Wireless Channel 33% Digital Transmission 33% 2 Citations (Scopus) 36 Downloads (Pure) Dynamic Load Balancing for Real-Time Multiview Path Tracing on Multi-GPU ArchitecturesLeria, E., Mäkitalo, M., Ikkala, J. & Jääskeläinen, P., Aug 2025, In: Virtual Reality & Intelligent Hardware. 7, 4, p. 393-405Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Multi-GPU 100% GPU Architecture 100% Path Tracing 100% Dynamic Load Balancing 100% Graphics Processing Unit 100% 3 Downloads (Pure) Efficient reconfigurable system for home monitoring of the elderly via action recognitionDeniz, D., Isern, J., Solanti, J., Jääskeläinen, P., Hnětynka, P., Bulej, L., Ros, E. & Barranco, F., 22 Oct 2025, In: Engineering Applications of Artificial Intelligence. 158, 111383.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Reconfigurable Systems 100% Reconfigurable System 100% Smart Health 50% Short Latency 50% 1 Citation (Scopus) 4 Downloads (Pure) Latency Reduction Potential of Server-Side Command Buffers in OpenCL-Based Edge OffloadingSolanti, J. & Jääskeläinen, P., 7 Jul 2025, Proceedings of International Workshop on OpenCL and SYCL, IWOCL 2025. ACM, p. 1-4 4Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Latency Reduction 100% Remote Drivers 33% Re-execution 33% PCI Bus 33% 1 Downloads (Pure) View all 142 research outputs Datasets DDISH-GI: Dynamic Distributed Spherical Harmonics Global Illumination - Supplementary VideoIkkala, J. (Creator), Kivi, P. (Creator), Alanko, J. (Creator), Mäkitalo, M. (Creator) & Jääskeläinen, P. (Creator), Zenodo, 6 Jul 2021DOI: 10.5281/zenodo.5074903Dataset TauBench: A Dynamic Benchmark for Graphics Rendering (Dataset Reference Frames)Alanko, J. (Creator), Mäkitalo, M. (Creator), Momeni Yazdi, E. (Creator), Ikkala, J. (Creator) & Jääskeläinen, P. (Creator), Zenodo, 8 May 2023DOI: 10.5281/zenodo.7907164Dataset TauBench: A Dynamic Benchmark for Graphics Rendering (Dataset)Alanko, J. (Creator), Mäkitalo, M. (Creator), Momeni Yazdi, E. (Creator), Ikkala, J. (Creator) & Jääskeläinen, P. (Creator), Zenodo, 8 May 2023DOI: 10.5281/zenodo.7906987Dataset TauBench: Dynamic Benchmark for Graphics Rendering (Dataset)Alanko, J. (Creator), Mäkitalo, M. (Creator) & Jääskeläinen, P. (Creator), Zenodo, 8 May 2021DOI: 10.5281/zenodo.5729573Dataset Tauray: A Scalable Real-Time Open-Source Path Tracer for Stereo and Light Field Displays (Software)Ikkala, J. (Creator), Mäkitalo, M. (Creator), Lauttia, T. (Creator), Leria, E. (Creator) & Jääskeläinen, P. (Creator), Zenodo, 11 Oct 2022DOI: 10.5281/zenodo.7215072Dataset Prizes The \"Stamatis Vassiliadis Best Paper Award\"IJzerman, J. (Recipient), Viitanen, T. (Recipient), Jääskeläinen, P. (Recipient), Kultala, H. (Recipient), Lehtonen, L. (Recipient), Peemen, M. (Recipient), Corporaal, H. (Recipient) & Takala, J. (Recipient), 19 Jul 2018Prize: Award or honor granted for a specific work Energy Efficient 100% Object Recognition 100% CNN-based 100% Programmable Accelerator 100% Best Paper Award 100% The \"Stamatis Vassiliadis Best Paper Award\" for the Paper \"Programmable and scalable architecture for graphics processing units\"Jääskeläinen, P. (Recipient), 2009Prize: Award or honor granted for a specific work Activities Activities per year 2006 2014 2015 2023 12 Conference presentation 9 Visit abroad 4 Reviewer of Conference Article 4 Reviewer of Scientific Journal 6 More 2 Membership of a scientific or program committee of a conference or seminar 1 Chair of workshop, panel, session or tutorial 1 Organization of a workshop, panel, session or tutorial 1 Academic qualification (e.g. title of docent) 1 Public talk Activities per year Open Standard Software Stack for Low Latency Offloading from Lightweight Devices to Remote Heterogeneous PlatformsSolanti, J. (Speaker), Leppänen, T. (Speaker) & Jääskeläinen, P. (Contributor)18 Apr 2023 → 20 Apr 2023Activity: Talk or presentation › Conference presentation Presentation about AI acceleration and open source heterogeneous software stacksJääskeläinen, P. (Speaker)20 Sept 2018Activity: Talk or presentation › Conference presentation Offloading C++17 Parallel STL on System Shared Virtual Memory PlatformsJääskeläinen, P. (Speaker)28 Jun 2018Activity: Talk or presentation › Conference presentation Open Source Toolset for HW/SW Co-Design of High Performance Low Power Co-ProcessorsJääskeläinen, P. (Speaker)28 Jun 2018Activity: Talk or presentation › Conference presentation Title of DocentJääskeläinen, P. (Other)1 Dec 2017 → …Activity: Other › Academic qualification (e.g. title of docent) View all 35 activities",
  "content_length": 7484,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:51"
}