{
  "name": "Pekka Marttinen",
  "homepage": "https://research.aalto.fi/en/persons/pekka-marttinen",
  "status": "success",
  "content": "Pekka Marttinen - Aalto University's research portal Contact expert View Scopus Profile Pekka Marttinen Professor (Associate Professor), Department of Computer ScienceProfessor (Associate Professor), Computer Science ProfessorsProfessor (Associate Professor), Computer Science - Artificial Intelligence and Machine Learning (AIML) - Research areaProfessor (Associate Professor), Professorship Marttinen P. https://orcid.org/0000-0001-7078-7927 Phone+358 50 5124362 Aalto SCI Computer Science Konemiehentie 2 20102025 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationDoctoral degree, Natural Sciences, University of HelsinkiAward Date: 21 Nov 2008 KeywordsStatistical Machine LearningComputational biology Fingerprint Dive into the research topics where Pekka Marttinen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Deep Learning Method Computer Science 100% Large Language Model Computer Science 98% Prediction Accuracy Computer Science 75% Neural Network Computer Science 68% Machine Learning Computer Science 55% Learning System Computer Science 55% Electronic Health Record Medicine and Dentistry 39% Deep Neural Network Computer Science 36% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2010 2017 2021 2022 2023 2024 2025 2025 74 Article 28 Conference article in proceedings 2 Paper 2 Poster 6 More 2 Review Article 1 Abstract 1 Meeting Abstract 1 Conference article 1 Other contribution Research output per year Research output per year Basic reproduction number varies markedly between closely related pandemic Escherichia coli clonesOjala, F., Pesonen, H., Gladstone, R. A., Mäklin, T., Tonkin-Hill, G., Marttinen, P. & Corander, J., Dec 2025, In: Nature Communications. 16, 1, p. 1-9 9 p., 9490.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Basic Reproduction number 100% ST131 100% Urinary Tract 50% Extraintestinal Pathogenic Escherichia Coli 50% influenza viruses 33% 1 Downloads (Pure) Computational modeling enables individual assessment of postprandial glucose and insulin responses after bariatric surgeryPoyraz, O., Heinonen, S., John, S. T., Saarinen, T., Juuti, A., Marttinen, P. & Pietiläinen, K. H., Dec 2025, In: Communications Medicine. 5, 1, p. 1-11 11 p., 434.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Bariatric Surgery 100% Postprandial Glucose 100% Postprandial Insulin 100% Insulin Response 100% insulin 100% 1 Downloads (Pure) Efficient Knowledge Injection in LLMs via Self-DistillationKujanpää, K., Marttinen, P., Valpola, H. & Ilin, A., 2025, In: Transactions on Machine Learning Research. 2025, August, p. 1-42 42 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Large Language Model 100% Contributing Factor 33% Industry Standard 33% Training Data 33% Factual Knowledge 33% 73 Downloads (Pure) Generating Code World Models with Large Language Models Guided by Monte Carlo Tree SearchDainese, N., Merler, M., Alakuijala, M. & Marttinen, P., 2025, Advances in Neural Information Processing Systems 37 (NeurIPS 2024). Globerson, A., Mackey, L., Belgrave, D., Fan, A., Paquet, U., Tomczak, J. & Zhang, C. (eds.). Curran Associates Inc., (Advances in Neural Information Processing Systems; vol. 37).Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open Access Tree Search 100% Large Language Model 100% Model Benchmark 50% Reinforcement Learning 50% Model-Based Reinforcement Learning 50% 2 Citations (Scopus) Identifying latent state transitions in non-linear dynamical systemsHızlı, Ç., Yıldız, Ç., Bethge, M., John, S. T. & Marttinen, P., 2025, 13th International Conference on Learning Representations, ICLR 2025. Curran Associates Inc., p. 27529-27558 30 p.Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open AccessFile Independent Component Analysis 100% Dynamic State 100% State Transition 100% State Space Modeling 100% Interpretability 100% 4 Downloads (Pure) View all 112 research outputs Projects Projects per year 2015 2015 2018 2019 2023 2026 7 Finished 7 Active Projects per year -: FCAI Flag R4 reserarch/PMMarttinen, P. (Principal investigator)01/03/2024 → 31/12/2026Project: Academy of Finland: Other research funding STN LITERACY jatko/Marttinen: Data Literacy for Responsible Decision-Making (DATALIT)Marttinen, P. (Principal investigator), Honkamaa, J. (Project Member), Pöllänen, A. (Project Member), Gröhn, T. (Project Member) & Dainese, N. (Project Member)01/10/2023 → 30/09/2026Project: RCF SRC (STN) Postprandial Glucose 100% Postprandial Insulin 100% Insulin Response 100% Bariatric Surgery 100% Roux-en-Y Gastric Bypass 40% CLISHEAT/Marttinen: Green and digital healthcareMarttinen, P. (Principal investigator), Gao, Y. (Project Member), Moen, H. (Project Member) & John, T. (Project Member)EU The Recovery and Resilience Facility (RRF)01/01/2023 → 31/12/2025Project: RCF Academy Project targeted call Large Language Model 100% Deep Learning Method 63% Annotation 26% Feature Extraction 25% Training Data 25% -: Finnish Center for Artificial IntelligenceMarttinen, P. (Principal investigator)01/01/2023 → 31/12/2026Project: Academy of Finland: Other research funding -: Finnish Center for Artificial IntelligenceMarttinen, P. (Principal investigator)01/01/2023 → 31/12/2026Project: Academy of Finland: Other research funding View all 14 projects Datasets Supplementary material from \"Modelling methicillin-resistant Staphylococcus aureus decolonization: interactions between body sites and the impact of site-specific clearance\"Poyraz, O. (Creator), Sater, M. R. A. (Creator), Miller, L. G. (Creator), McKinnell, J. A. (Creator), Huang, S. S. (Creator), Grad, Y. H. (Creator) & Marttinen, P. (Creator), figshare, 2022DOI: 10.6084/m9.figshare.c.6016851.v2, https://rs.figshare.com/collections/Supplementary_material_from_Modelling_methicillin-resistant_i_Staphylococcus_aureus_i_decolonization_interactions_between_body_sites_and_the_impact_of_site-specific_clearance_/6016851/2 and 3 more links, https://doi.org/10.6084/m9.figshare.c.6016851.v1, https://rs.figshare.com/collections/Supplementary_material_from_Modelling_methicillin-resistant_i_Staphylococcus_aureus_i_decolonization_interactions_between_body_sites_and_the_impact_of_site-specific_clearance_/6016851, https://rs.figshare.com/collections/Supplementary_material_from_Modelling_methicillin-resistant_i_Staphylococcus_aureus_i_decolonization_interactions_between_body_sites_and_the_impact_of_site-specific_clearance_/6016851/1 (show fewer)Dataset Computational modelling of self-reported dietary carbohydrate intake on glucose concentrations in patients undergoing Roux-en-Y gastric bypass versus one-anastomosis gastric bypassAlizadeh Ashrafi, R. (Creator), Ahola, A. J. (Contributor), Rosengård-Bärlund, M. (Contributor), Saarinen, T. (Contributor), Heinonen, S. (Contributor), Juuti, A. (Contributor), Marttinen, P. (Contributor) & Pietiläinen, K. H. (Contributor), figshare, 1 Jan 2021DOI: 10.6084/m9.figshare.16904216.v1, https://tandf.figshare.com/articles/journal_contribution/Computational_modelling_of_self-reported_dietary_carbohydrate_intake_on_glucose_concentrations_in_patients_undergoing_Roux-en-Y_gastric_bypass_versus_one-anastomosis_gastric_bypass/16904216/1Dataset Data from: Single-cell genomics reveals hundreds of coexisting subpopulations in wild ProchlorococcusKashtan, N. (Contributor), Roggensack, S. E. (Contributor), Rodrigue, S. (Contributor), Thompson, J. W. (Contributor), Biller, S. J. (Contributor), Coe, A. (Contributor), Ding, H. (Contributor), Marttinen, P. (Creator), Malmstrom, R. R. (Contributor), Stocker, R. (Contributor), Follows, M. (Contributor), Stepanauskas, R. (Creator) & SW, C. (Creator), Dryad Digital Repository, 25 Apr 2014DOI: 10.5061/dryad.9r0p6, https://datadryad.org/resource/doi:10.5061/dryad.9r0p6 and 8 more links, https://doi.org/10.5061/dryad.9r0p6/1, https://doi.org/10.5061/dryad.9r0p6/2, https://doi.org/10.5061/dryad.9r0p6/3, https://doi.org/10.5061/dryad.9r0p6/4, https://doi.org/10.5061/dryad.9r0p6/5, https://doi.org/10.5061/dryad.9r0p6/6, https://doi.org/10.5061/dryad.9r0p6/7, https://doi.org/10.5061/dryad.9r0p6/8 (show fewer)Dataset Data from: Cryptic ecology among host generalist Campylobacter jejuni in domestic animalsSheppard, S. K. (Contributor), Cheng, L. (Contributor), Méric, G. (Contributor), Haan, C. (Contributor), Llarena, A.-K. (Contributor), Marttinen, P. (Contributor), Vidal, A. (Contributor), Ridley, A. (Contributor), Clifton-Hadley, F. (Contributor), Connor, T. R. (Contributor), Strachan, N. (Creator), Forbes, K. (Creator), Colles, F. (Creator), Jolley, K. (Creator), Bentley, S. (Creator), Maiden, M. (Creator), Hänninen, M.-L. (Creator), Parkhill, J. (Creator), Hanage, W. P. (Creator) & Corander, J. (Creator), Dryad Digital Repository, 28 Mar 2014DOI: 10.5061/dryad.hk860, https://datadryad.org/resource/doi:10.5061/dryad.hk860 and 3 more links, https://doi.org/10.5061/dryad.hk860/1, https://doi.org/10.5061/dryad.hk860/2, https://doi.org/10.5061/dryad.hk860/3 (show fewer)Dataset Activities Activities per year 2010 2010 2011 2014 2",
  "content_length": 12577,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:52"
}