{
  "name": "Pekka Abrahamsson",
  "homepage": "https://researchportal.tuni.fi/en/persons/pekka-abrahamsson",
  "status": "success",
  "content": "Pekka Abrahamsson - Tampere University Research Portal View Scopus Profile Pekka Abrahamsson Professor, Computing SciencesData Science Research Centre https://orcid.org/0000-0002-4360-2226 20162026 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Pekka Abrahamsson is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 10 Similar Profiles Artificial Intelligence Computer Science 100% Software Engineering Computer Science 79% Large Language Model Computer Science 54% Generative Artificial Intelligence Computer Science 51% ChatGPT Computer Science 50% Software Development Computer Science 45% Chat Generative Pre-trained Transformer (ChatGPT) Keyphrases 39% Artificial Intelligence Ethics Keyphrases 36% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2016 2024 2026 22 Conference contribution 9 Article 5 Preprint 4 Anthology 6 More 3 Chapter 2 Review Article 1 Book Research output per year Research output per year A Multi-agent LLM System for Automated Requirements Analysis: A Study on User Story Generation and PrioritizationSami, M. A., Zhang, Z., Waseem, M., Kemell, K. K., Rasheed, Z., Herda, T., Hasan, M. T., Rasku, J. & Abrahamsson, P., 2026, Software Engineering and Advanced Applications: 51st Euromicro Conference, SEAA 2025, Salerno, Italy, September 10–12, 2025, Proceedings, Part II. Taibi, D. & Smite, D. (eds.). Springer, p. 178-187 (Lecture Notes in Computer Science; vol. 16082 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Requirements Analysis 100% multi agent 100% Large Language Model 100% Project Description 100% Story Generation 100% Autonomous Agents in Software Development: A Vision PaperRasheed, Z., Waseem, M., Sami, M., Kemell, K.-K., Ahmad, A., Nguyen-Duc, A., Systä, K. & Abrahamsson, P., 2025, Agile Processes in Software Engineering and Extreme Programming – Workshops: XP 2024 Workshops, Bozen-Bolzano, Italy, June 4–7, 2024, Revised Selected Papers. Springer, p. 15-23 9 p. (Lecture Notes in Business Information Processing; vol. 524).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Software Creation 100% Chat Interface 100% 1 Citation (Scopus) 91 Downloads (Pure) Autonomous Legacy Web Application Upgrades Using a Multi-Agent SystemAla-Salmi, V., Rasheed, Z., Sami, A. M., Zhang, Z., Kemell, K.-K., Rasku, J., Siddeeq, S., Saari, M. & Abrahamsson, P., 2025, Proceedings of the 20th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE 2025). SCITEPRESS, Vol. 1. p. 185-196 (ENASE).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Web Application 100% Multi-agent Systems 100% Large Language Models 100% Reliability Issues 20% Publicly Available 20% 3 Downloads (Pure) Engineering RAG Systems for Real-World Applications: Design, Development, and EvaluationHasan, M. T., Waseem, M., Kemell, K. K., Khan, A. A., Saari, M. & Abrahamsson, P., 2025, (E-pub ahead of print) Software Engineering and Advanced Applications - 51st Euromicro Conference, SEAA 2025, Proceedings. Taibi, D. & Smite, D. (eds.). Springer, p. 143-158 16 p. (Lecture Notes in Computer Science; vol. 16082 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Generation System 100% Application Design 100% Retrieval-augmented Generation 100% World Application 100% Retrieval-Augmented Generation 100% Still just personal assistants? – A multiple case study of generative AI adoption in software organizationsKemell, K.-K., Saarikallio, M., Nguyen-Duc, A. & Abrahamsson, P., Oct 2025, In: Information and Software Technology. 186, 107805.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Personal Assistant 100% AI for Software Engineering 30% 2 Citations (Scopus) 4 Downloads (Pure) View all 46 research outputs Datasets Dataset for the Paper: Understanding the Issues, Their Causes and Solutions in Microservices Systems: An Empirical StudyWaseem, M. (Creator), Peng, L. (Contributor), Ahmad, A. (Creator), Khan, A. A. (Creator), Mojtaba, S. (Contributor), Abrahamsson, P. (Contributor), Nasab, A. R. (Creator) & Mikkonen, T. (Creator), Zenodo, 3 Feb 2023DOI: 10.5281/zenodo.7602413Dataset Dataset for the Paper: Understanding the Issues, Their Causes and Solutions in Microservices Systems: An Empirical StudyWaseem, M. (Creator), Liang, P. (Creator), Ahmad, A. (Creator), Khan, A. A. (Creator), Shahin, M. (Creator), Abrahamsson, P. (Creator), Nasab, A. R. (Creator) & Mikkonen, T. (Creator), Zenodo, 10 Jul 2023DOI: 10.5281/zenodo.8127229Dataset Prizes Certificate of Best PaperRantanen, P. (Recipient), Saari, M. (Recipient), Harjamäki, J. (Recipient), Sillberg, P. (Recipient), Soini, J. (Recipient) & Abrahamsson, P. (Recipient), 2024Prize: Award or honor granted for a specific work File Best Papers 100% ChatGPT 100% Report Generation 100% Intelligent Systems 50% Custom Instruction 50%",
  "content_length": 5836,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:50"
}