{
  "name": "Pengfei Xu 0002",
  "homepage": "http://pengfeixu.com",
  "status": "success",
  "content": "Homepage - Pengfei Xu Pengfei Xu Associate Professor @ Shenzhen University I am currently an Associate Professor with the VCC group at Shenzhen University. Before joining SZU, I worked with Prof. Chiew-Lan Tai as a Postdoctoral Research Fellow at the Hong Kong University of Science and Technology, where I also obtained my Ph.D in Computer Science in 2015, under the guidance of Prof. Chiew-Lan Tai and Prof. Hongbo Fu. Before that, I received my Bachelor's degree in Mathematics from Zhejiang University in 2009. My research falls in Computer Graphics and Human-Computer Interaction, especially automatic or interactive visual content creation. I am currently looking for master and PhD students. Please feel free to contact me if you are interested in my research. L6-808-B, South Campus, Shenzhen University, China xupengfei.cg(at)gmail.com Google Scholar Action required Problem: The current root path of this site is \"\", which does not match the baseurl (\"\") configured in _config.yml. Solution: Please set the baseurl in _config.yml to \"\". Education HKUST PhD in CSE Feb. 2012 - Jan. 2015 HKUST MPhil in CSE Feb. 2010 - Jan. 2012 Zhejiang University B.S. in Mathmatics Sep. 2005 - Jul. 2009 Experience Shenzhen University Associate Professor Aug. 2023 - Present Shenzhen University Assitant Professor, Associate Researcher Apr. 2016 - Jul. 2023 HKUST Postdoctoral Research Fellow Feb. 2015 - Feb. 2016 Tsinghua University Research Intern Sep. 2009 - Jan. 2010 News 2025 Two papers have been conditionally accepted by AAAI 2026 Nov 08 Jin Zhou's paper has been accepted by Pacific Graphics 2025 Aug 10 Hongliang's paper has been conditionally accepted by ISMAR 2025 Jul 28 Xin Hu's paper has been accepted by IEEE TVCG May 16 Xin Hu, Yi Zhou, Yijie, Jialuo, and Mu Liang have successfully defended their theses. Congratulations! May 15 Publications StrokeFusion: Vector Sketch Generation via Joint Stroke-UDF Encoding and Latent Sequence Diffusion Jin Zhou, Yi Zhou, Hongliang Yang, Pengfei Xu#, Hui Huang (# corresponding author) Annual AAAI Conference on Artificial Intelligence 2026 StrokeFusion: Vector Sketch Generation via Joint Stroke-UDF Encoding and Latent Sequence Diffusion Jin Zhou, Yi Zhou, Hongliang Yang, Pengfei Xu#, Hui Huang (# corresponding author) Annual AAAI Conference on Artificial Intelligence 2026 SCORE: Semantic Collage by Optimizing Rendered Elements Zefan Shao, Jin Zhou, Hongliang Yang, Pengfei Xu# (# corresponding author) Annual AAAI Conference on Artificial Intelligence 2026 SCORE: Semantic Collage by Optimizing Rendered Elements Zefan Shao, Jin Zhou, Hongliang Yang, Pengfei Xu# (# corresponding author) Annual AAAI Conference on Artificial Intelligence 2026 GenFODrawing: Supporting Creative Found Object Drawing with Generative AI Jiaye Leng, Hui Ye, Pengfei Xu, Miu-Ling Lam, Hongbo Fu IEEE Transactions on Visualization and Computer Graphics 2025 GenFODrawing: Supporting Creative Found Object Drawing with Generative AI Jiaye Leng, Hui Ye, Pengfei Xu, Miu-Ling Lam, Hongbo Fu IEEE Transactions on Visualization and Computer Graphics 2025 SPLICE: Part-Level 3D Shape Editing from Local Semantic Extraction to Global Neural Mixing Jin Zhou, Hongliang Yang, Pengfei Xu#, Hui Huang (# corresponding author) Proceedings of Pacific Graphics 2025 SPLICE: Part-Level 3D Shape Editing from Local Semantic Extraction to Global Neural Mixing Jin Zhou, Hongliang Yang, Pengfei Xu#, Hui Huang (# corresponding author) Proceedings of Pacific Graphics 2025 MRPilot: A Mixed-Reality System for Responsive Navigation of General Procedural Tasks Hongliang Yang, Jin Zhou, Pengfei Xu#, Hongbo Fu, Hui Huang (# corresponding author) IEEE International Symposium on Mixed and Augmented Reality 2025 [Project] MRPilot: A Mixed-Reality System for Responsive Navigation of General Procedural Tasks Hongliang Yang, Jin Zhou, Pengfei Xu#, Hongbo Fu, Hui Huang (# corresponding author) IEEE International Symposium on Mixed and Augmented Reality 2025 [Project] StructLayoutFormer: Conditional Structured Layout Generation via Structure Serialization and Disentanglement Xin Hu, Pengfei Xu#, Jin Zhou, Hongbo Fu, Hui Huang (# corresponding author) IEEE Transactions on Visualization and Computer Graphics 2025 [Paper] [Code] StructLayoutFormer: Conditional Structured Layout Generation via Structure Serialization and Disentanglement Xin Hu, Pengfei Xu#, Jin Zhou, Hongbo Fu, Hui Huang (# corresponding author) IEEE Transactions on Visualization and Computer Graphics 2025 [Paper] [Code] A General 2D Graphics Deformation Algorithm with Controllable Deformation Effects Zhonghao Cao, Pengfei Xu#, Hui Huang (# corresponding author) Journal of Computer-Aided Design and Computer Graphics (in Chinese) 2025 A General 2D Graphics Deformation Algorithm with Controllable Deformation Effects Zhonghao Cao, Pengfei Xu#, Hui Huang (# corresponding author) Journal of Computer-Aided Design and Computer Graphics (in Chinese) 2025 Brush-based Interactive Element Packing Mu Liang, Pengfei Xu#, Hui Huang (# corresponding author) Journal of Graphics (in Chinese) 2025 Brush-based Interactive Element Packing Mu Liang, Pengfei Xu#, Hui Huang (# corresponding author) Journal of Graphics (in Chinese) 2025 GLTScene: Global-to-Local Transformers for Indoor Scene Synthesis with General Room Boundaries Yijie Li, Pengfei Xu#, Junquan Ren, Zefan Shao, Hui Huang (# corresponding author) Computer Graphics Forum (Proceedings of Pacific Graphics 2024) 2024 [Code] GLTScene: Global-to-Local Transformers for Indoor Scene Synthesis with General Room Boundaries Yijie Li, Pengfei Xu#, Junquan Ren, Zefan Shao, Hui Huang (# corresponding author) Computer Graphics Forum (Proceedings of Pacific Graphics 2024) 2024 [Code] FRI-Net: Floorplan Reconstruction via Room-wise Implicit Representation Honghao Xu, Juzhan Xu, Zeyu Huang, Pengfei Xu, Hui Huang, Ruizhen Hu European Conference on Computer Vision (ECCV) 2024 [Code] FRI-Net: Floorplan Reconstruction via Room-wise Implicit Representation Honghao Xu, Juzhan Xu, Zeyu Huang, Pengfei Xu, Hui Huang, Ruizhen Hu European Conference on Computer Vision (ECCV) 2024 [Code] Region-aware Color Smudging Ying Jiang, Pengfei Xu, Congyi Zhang, Hongbo Fu, Henry Lau, Wenping Wang IEEE Transactions on Visualization and Computer Graphics 2024 [Paper] [Video] Region-aware Color Smudging Ying Jiang, Pengfei Xu, Congyi Zhang, Hongbo Fu, Henry Lau, Wenping Wang IEEE Transactions on Visualization and Computer Graphics 2024 [Paper] [Video] ProInterAR: A Visual Programming Platform for Creating Immersive AR Interactions Hui Ye, Jiaye Leng, Pengfei Xu, Karan Singh, Hongbo Fu ACM CHI 2024 [Paper] [Video] ProInterAR: A Visual Programming Platform for Creating Immersive AR Interactions Hui Ye, Jiaye Leng, Pengfei Xu, Karan Singh, Hongbo Fu ACM CHI 2024 [Paper] [Video] Sketchformer++: A Hierarchical Transformer Architecture for Vector Sketch Representation Pengfei Xu, Banhuai Ruan, Youyi Zheng, Hui Huang Computational Visual Media 2024 [Code] Sketchformer++: A Hierarchical Transformer Architecture for Vector Sketch Representation Pengfei Xu, Banhuai Ruan, Youyi Zheng, Hui Huang Computational Visual Media 2024 [Code] GTLayout: Learning General Trees for Structured Grid Layout Generation Pengfei Xu, Weiran Shi, Xin Hu, Hongbo Fu, Hui Huang Computational Visual Media 2024 [Code] GTLayout: Learning General Trees for Structured Grid Layout Generation Pengfei Xu, Weiran Shi, Xin Hu, Hongbo Fu, Hui Huang Computational Visual Media 2024 [Code] Screen Space Shape Manipulation by Global Structural Optimization Zhonghao Cao, Pengfei Xu#, Zhuoyue Chen, Hui Huang (# corresponding author) Computers & Graphics 2023 [Project] Screen Space Shape Manipulation by Global Structural Optimization Zhonghao Cao, Pengfei Xu#, Zhuoyue Chen, Hui Huang (# corresponding author) Computers & Graphics 2023 [Project] Hierarchical Layout Blending with Recursive Optimal Correspondence Pengfei Xu, Yifan Li, Zhijin Yang, Weiran Shi, Hongbo Fu, Hui Huang ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2022) 2022 [Project] [Code] Hierarchical Layout Blending with Recursive Optimal Correspondence Pengfei Xu, Yifan Li, Zhijin Yang, Weiran Shi, Hongbo Fu, Hui Huang ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2022) 2022 [Project] [Code] Element Layout Prediction with Sequential Operation Data Yingjin Li, Pengfei Xu#, Hui Huang (# corresponding author) Journal of Computer-Aided Design and Computer Graphics (in Chinese) 2021 Element Layout Prediction with Sequential Operation Data Yingjin Li, Pengfei Xu#, Hui Huang (# corresponding author) Journal of Computer-Aided Design and Computer Graphics (in Chinese) 2021 WireRoom: Model-guided Explorative Design of Abstract Wire Art Zhijin Yang, Pengfei Xu#, Hongbo Fu, Hui Huang (# corresponding author) ACM Transactions on Graphics (Proceedings of SIGGRAPH 2021) 2021 [Project] [Code] WireRoom: Model-guided Explorative Design of Abstract Wire Art Zhijin Yang, Pengfei Xu#, Hongbo Fu, Hui Huang (# corresponding author) ACM Transactions on Graphics (Proceedings of SIGGRAPH 2021) 2021 [Project] [Code] Global Beautification of 2D and 3D Layouts with Interactive Ambiguity Resolution Pengfei Xu, Guohang Yan, Hongbo Fu, Takeo Igarashi, Chiew-Lan Tai, Hui Huang IEEE Transactions on Visualization and Computer Graphics 2020 [Project] Global Beautification of 2D and 3D Layouts with Interactive Ambiguity Resolution Pengfei Xu, Guohang Yan, Hongbo Fu, Takeo Igarashi, Chiew-Lan Tai, Hui Huang IEEE Transactions on Visualization and Computer Graphics 2020 [Project] Discernible Image Mosaic with Edge-aware Adaptive Tiles Pengfei Xu, Jianqiang Ding, Hao Zhang, Hui Huang Computational Visual Media 2019 [Project] Discernible Image Mosaic with Edge-aware Adaptive Tiles Pengfei Xu, Jianqiang Ding, Hao Zhang, Hui Huang Computational Visual Media 2019 [Project] Model-Guided 3D Sketching Pengfei Xu, Hongbo Fu, Youyi Zheng, Karan Singh, Hui Huang, Chiew-Lan Tai IEEE Transactions on Visualization and Computer",
  "content_length": 14584,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:58"
}