{
  "name": "Peng Gao 0008",
  "homepage": "https://people.cs.vt.edu/penggao",
  "status": "success",
  "content": "Peng Gao Peng Gao Assistant Professor Department of Computer Science Virginia Tech Office: Gilbert Place 4104 E-mail: penggao [at] vt [dot] edu Follow @penggaotweets Bio | Publications | Lab | Teaching | Services I am an assistant professor of Computer Science at Virginia Tech. Previously, I was a postdoctoral researcher in Computer Science at UC Berkeley (with Dawn Song). I received my Ph.D. in Electrical Engineering from Princeton University (with Prateek Mittal, Sanjeev R. Kulkarni). I received my B.E. in Electrical and Computer Engineering from Shanghai Jiao Tong University. Research Interests Systems Security, Network Security, (Agentic) AI for Cybersecurity, AI Safety and Security Education & Experience Ph.D. in Electrical Engineering (M.A. en route), Princeton University, 2013-2019 B.E. in Electrical and Computer Engineering, Shanghai Jiao Tong University, 2009-2013 Exchange Student, Electrical and Electronics Engineering, The University of Hong Kong, Spring 2012 Postdoctoral Scholar, EECS Department, UC Berkeley, 06/2019-04/2021 Visiting Student Researcher, EECS Department, UC Berkeley, 01/2019-06/2019 Research Intern, Microsoft Research Asia, 06/2018-09/2018 Research Intern, Facebook (Meta), 06/2017-09/2017 Research Intern, NEC Laboratories America, 10/2016-12/2016 Research intern, NEC Laboratories America, 11/2015-01/2016 Research intern, Microsoft Research Redmond, 06/2015-09/2015 Selected Awards Google Academic Research Award, 2025 National Science Foundation (NSF) CAREER Award, 2025 IEEE Senior Member, 2025 Amazon-VT Initiative Faculty Research Award, 2022 Meta Research Award Finalist, 2021 Cisco Research Award, 2021 Commonwealth Cyber Initiative (CCI) Faculty Fellow, 2021 Google Cloud Research Credits Award, 2021 Amazon Research Award, 2020 Microsoft Security AI Research Award, 2020 CSAW Best Applied Security Paper Award Finalist, 2018 Princeton University Fellowship in Natural Sciences and Engineering, 2013 Shanghai Excellent Graduate, 2013 Li & Fung Scholarship, 2012 China National Scholarship, 2010, 2011 SJTU Academic Excellence Scholarship, 2010, 2012 Prospective students: I am seeking highly motivated Ph.D. students and postdoctoral researchers to join my lab. If you’re interested, please email your CV and transcript to penggao.jobs [at] gmail [dot] com. In your message, please include a brief statement explaining your understanding of our research topics and relevant publications. While I may not be able to respond to every message due to the volume of inquiries, I genuinely appreciate your interest.",
  "content_length": 2565,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:53"
}