{
  "name": "Peng Chen 0024",
  "homepage": "https://faculty.cc.gatech.edu/~pchen402/index.html",
  "status": "success",
  "content": "Peng Chen - Georgia Institute of Technology Hengduan Mountains copyright@planets_for SciML & UQ @ CSE Georgia Tech Home Group Research Publications Teaching Software Welcome to the Group of SciML & UQ! Prospective students: I am looking for highly motivated and strong students at computational math and machine learning! If you are interested, please send me an email with your CV, transcripts, and briefly discuss our work you are interested in and why you are a good fit. We are a research group on Scientific Machine Learning (SciML) and Uncertainty Quantification (UQ) at the School of Computational Science and Engineering (CSE), Georgia Tech. Our research is driven by grand challenge problems in scientific and engineering fields that involve data-driven modeling, learning, and optimization of complex systems under uncertainty. Examples of such problems include (1) how to quantify the system predictive accuracy of simulation-based or machine learning-based models under uncertain system and/or model parameters; (2) how to best learn and mitigate infectious diseases like COVID-19 from heterogeneous models, incomplete data, and uncertain track of disease spread; (3) how to robustly design new materials, such as nanoscale self-assembly materials in semiconductor and artificially engineered metamaterials in acoustic and electromagnetic devices under the uncertainty arising from material properties and manufacturing errors; (4) how to optimally design magnetic confinement devices and control coil currents for plasma fusion to harness fusion energy under the imprecision of the device shape and current control; (5) how to better characterize the sensitivity of cardiovascular diseases such as heart attack, stroke, aneurysms, etc., with respect to different physiological abnormalities and to better quantify the risk or reliability of corresponding treatments under large and uncertain variation of personalized physiological conditions; (6) how to optimally place sea-floor sensors to detect undersea earthquakes for tsunami early warning under the uncertainty of where, when, and how large the earthquake may happen. These problems brings significant challenges in high-fidelity modeling, large-scale simulation, high-dimensional Bayesian inference and data assimilation, optimal data acquisition and experimental design, as well as stochastic optimization for system design and control, all under various uncertainties. We tackle these challenges by developing fast, scalable, and parallel computational methods, which exploit the structure of the problems, including geometry, sparsity, intrinsic low-dimensionality, smoothness, derivative information, etc. Specific methods we have been developing include projected neural networks/operators, weighted/adaptive/goal-oriented reduced basis, high-order functional Taylor approximation, randomized low-rank tensor/operator decompositions, adaptive sparse grid interpolation/integration, derivative-based scalable optimization methods using high-order adjoints, symbolic differentiation, or automatic differentiation, etc. Our vision is to build real-time digital twins of real-world complex systems in, e.g., materials, energy, health, natural hazard, and use them to learn, simulate, and optimize the systems, while quantifying uncertainties that may bring significant impact such as the butterfly effect on the system performance. PI: Peng Chen Email: pchen402@gatech.edu Office: CODA E1350B School of Computational Science and Engineering College of Computing Georgia Institute of Technology Address: 756 West Peachtree Street Northwest, Atlanta, GA 30308 News September 19, 2025 Our paper PDPO: Parametric Density Path Optimization is accepted at NeurIPS 2025. Congratulations Sebastian! August 8, 2025 Peng receives a grant from IDEaS + Cloud Hub RFP: Generative Artificial Intelligence (GenAI) for Science; our project deploys generative AI for real-time flood prediction. Thank you Cloud Hub and IDEaS! July 20-24, 2025 Peng co-organizes a minisymposium and delivers an invited talk on uncertainty quantification and SciML at USNCCM18 in Chicago. July 24, 2025 Our paper Efficient PDE-constrained optimization under high-dimensional uncertainty using derivative-informed neural operators is published in SIAM Journal on Scientific Computing. Congratulations DC and all! July 1, 2025 Our paper Sequential infinite-dimensional Bayesian optimal experimental design with derivative-informed latent attention neural operator is published in the Journal of Computational Physics. Congratulations Jinwoo! June 20, 2025 Congratulations to Benjamin Burns on receiving an NSF GRFP for research in machine learning. June 10-12, 2025 Peng gives an invited talk at the DOE-ASCR Inverse Methods for Complex Systems under Uncertainty Workshop (Rockville, MD) on latent generative modeling for Bayesian data assimilation of complex dynamical systems. June 6, 2025 Peng gives an invited talk at the ASA/IMS Spring Research Conference (Baruch College, NYC) on sequential infinite-dimensional Bayesian optimal experimental design with derivative-informed latent attention neural operators for optimal MRI tumor monitoring. ...see all News",
  "content_length": 5197,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:52"
}