{
  "name": "Pengtao Xie",
  "homepage": "https://sites.google.com/site/pengtaoxie2008",
  "status": "success",
  "content": "Pengtao XieSearch this siteEmbedded FilesSkip to main contentSkip to navigationPengtao XieAssociate Professor, Department of Electrical and Computer EngineeringAssociate Adjunct Professor, Division of Biomedical Informatics, Department of MedicineAffiliated Faculty, Halıcıoğlu Data Science Institute in the School of Computing, Information and Data Sciences, Department of Molecular Biology in the School of Biological Sciences, Shu Chien-Gene Lay Department of Bioengineering, Skaggs School of Pharmacy and Pharmaceutical Sciences, AI Group in the Department of Computer Science and Engineering, Center for Machine-Intelligence, Computing and Security, Institute of Engineering in Medicine, Institute for Genomic Medicine, and Jacobs Center for Health Innovation.University of California San DiegoI obtained my PhD from the Machine Learning Department, School of Computer Science, Carnegie Mellon University. My research interests mainly lie in machine learning inspired by humans' learning skills (especially classroom learning skills), such as learning by self explanation, small-group learning, learning by teaching, etc., and their applications in Large Language Models, Foundation Models, Healthcare, and Biomedicine. Here is a summary of research outcome. Some highlights: (1) Our DreamPRM-1.5 and DreamPRM-1.0 methods achieve first place on the MMMU,  MathVista, and RBench-V leaderboards for multi-modal reasoning; (2) our GenSeg method is selected as Nature Communications Editors’ Highlights (“the 50 best papers recently published”); and (3) our Betty framework was recognized as a Notable-Top-5% paper at ICLR 2023. I received an NSF Career Award in 2024 and an NIH MIRA Award in 2025.https://pengtaoxie.github.io/ p1xie@ucsd.edu Twitter I am looking for highly-motivated PhD students, postdocs, and master students to join my group. If you plan to apply to the PhD program in the CSE department and are interested in working with me, please email me. I am also looking for research interns. News2025/10. Our method DreamPRM-1.5 for multi-modal LLM reasoning achieves first place on the RBench-V leaderboard!2025/10. Our BiDoRA work is featured in UCSD News.2025/9. Two papers are accepted by NeurIPS 2025, including DreamPRM.2025/9. Our method DreamPRM-1.5 for multi-modal LLM reasoning achieves first place on the MMMU leaderboard!2025/8. Our work - Generative AI enables medical image segmentation in ultra low-data regimes is selected as Nature Communications Editors’ Highlights (\"the 50 best papers recently published\").2025/8. Two papers are accepted by EMNLP 2025.2025/7. Our work - Generative AI enables medical image segmentation in ultra low-data regimes is featured in UCSD News.2025/7. Our work - Generative AI enables medical image segmentation in ultra low-data regimes - is published in Nature Communications.2025/7. Our work - BiDoRA: Bi-level Optimization-Based Weight-Decomposed Low-Rank Adaptation is accepted by Transactions on Machine Learning Research.2025/7. Co-organizing the NeurIPS 2025 2nd Workshop on Multi-modal Large Language Models and Foundation Models for Life Sciences.2025/6. I am promoted to Associate Professor with tenure. Huge thanks to my students, colleagues, collaborators, and family!2025/6. Our method DreamPRM for multi-modal LLM reasoning achieves first place on the MathVista leaderboard.2025/6. Our work on Reweighting Pretraining Objectives for Task-Adaptive Pretraining is accepted by Transactions on Machine Learning Research.2025/3. Our work on downstream task guided continual pretraining is accepted by Transactions on Machine Learning Research.2025/3. Co-organizing the ICML 2025 Workshop on Large Language Models and Generative AI for Health.2025/1. Received an NIH Maximizing Investigators’ Research Award (MIRA) for Early Stage Investigators. Thanks, NIH!2025/1. I will teach ECE 285 Deep Generative Models in Spring 2025, covering fundamentals and state-of-the-art about large language models, diffusion models, etc.2025/1. One paper is accepted by NAACL.2025/1. Co-organizing the AAAI 2025 Workshop on Large Language Models and Generative AI for Health 2025/1. One paper is accepted by IEEE Transactions on AI.2025/1. Continue to serve as Associate Editor for ACM Transactions on Computing for Healthcare.2024/12. One paper is accepted by Transactions on Machine Learning Research.2024/11. Serve as Area Chair for ICML 2025.2024/9. Received an NSF Smart and Connected Health award. Thanks, NSF!2024/9. One paper is accepted by NeurIPS.2024/6. Two papers are accepted by JAMA Network Open and British Journal of Ophthalmology.2024/5. Serve as Area Chair for NeurIPS 2024.2024/5. Three papers are accepted by ICML 2024.2024/5. Gave a talk at USC.2024/5. Gave a talk at UIUC AI for Health Webinar. 2024/4. Received the NSF Career Award. Thanks, NSF!2024/3. Received an NIH R21 Award. Thanks, NIH!2024/3. Two papers are accepted by NAACL 2024.2024/1. One paper is accepted by TACL.2024/1. Server as Area Chair for ICML 2024.2023/9. Two papers are accepted by NeurIPS 2023. 2023/6. Course evaluations are released. ECE269-Winter2022, ECE285-Winter2022, ECE285-Spring2023, ECE175B-Spring2023, ECE269-Winter2021, ECE285-Winter20212023/4. Three papers are accepted by ICML 2023.2023/1. Two papers are accepted by ICLR 2023, including one Notable-Top-5% paper.2023/1. I received the Best Graduate Teacher Award (presented by ECE at UCSD).2022/4. Course evaluations are released. ECE269-Winter2022, ECE285-Winter2022, ECE269-Winter2021, ECE285-Winter20212020/8. My PhD thesis was selected as a finalist (top 5) for the AMIA Doctoral Dissertation Award.PhD Students and PostdocsCaitlin Aamodt (Schmidt AI in Science Postdoc Fellow, co-advised with Prof. Nathan Lewis)Qi CaoHan GuoNiklas Klusch (Schmidt AI in Science Postdoc Fellow, co-advised with Prof. Elizabeth Villa)Youwei LiangPeijia QinLi ZhangRuiyi ZhangPhD AlumniSai Somayajula  (2025, now senior applied scientist in Generative AI at Oracle)Ramtin Hosseini (2024, now co-founder and CEO of Xero1 Inc.)PreprintsQi Cao, Ruiyi Wang, Ruiyi Zhang, Sai Ashish Somayajula, Pengtao Xie. DreamPRM: Domain-Reweighted Process Reward Model for Multimodal Reasoning, 2025. arXiv:2505.20241Ding Bai, Shentong Mo, Ruiyi Zhang, Yingtao Luo, Jiahao Gao, Jeremy Parker Yang, Qiuyang Wu, Digvijay Singh, Hamidreza Rahmani, Tiffany Amariuta, Danielle Grotjahn, Sheng Zhong, Nathan Lewis, Wei Wang, Trey Ideker, Pengtao Xie*, Eric Xing*. scLong: A Billion-Parameter Foundation Model for Capturing Long-Range Gene Context in Single-Cell Transcriptomics, 2024. (*Corresponding authors) bioRxiv 2024.11.09.622759v2Youwei Liang, Ruiyi Zhang, Yongce Li, Mingjia Huo, Zinnia Ma, Digvijay Singh, Chengzhan Gao, Hamidreza Rahmani, Satvik Bandi, Li Zhang, Robert Weinreb, Atul Malhotra, Danielle A. Grotjahn, Linda Awdishu, Trey Ideker, Michael Gilson, \\textbf{Pengtao Xie}. Multi-Modal Large Language Model Enables All-Purpose Prediction of Drug Mechanisms and Properties. bioRxiv 2024.09.29.615524.Li Zhang, Han Guo, Leah Schaffer, Young Su Ko, Digvijay Singh, Hamid Rahmani, Danielle Grotjahn, Elizabeth Villa, Michael Gilson, Wei Wang, Trey Ideker, Eric Xing, Pengtao Xie. ProteinAligner: A Multi-modal Pretraining Framework for Protein Foundation Models, 2024. bioRxiv 2024.10.06.616870Duy MH Nguyen, Nghiem T Diep, Trung Q Nguyen, Hoang-Bao Le, Tai Nguyen, Tien Nguyen, TrungTin Nguyen, Nhat Ho, Pengtao Xie, Roger Wattenhofer, James Zou, Daniel Sonntag, Mathias Niepert. LoGra-Med: Long Context Multi-Graph Alignment for Medical Vision-Language Model, 2024. arXiv:2410.02615Mingjia Huo, Han Guo, Xingyi Cheng, Digvijay Singh, Hamidreza Rahmani, Shen Li, Philipp Gerlof, Trey Ideker, Danielle A. Grotjahn, Elizabeth Villa, Le Song, \\textbf{Pengtao Xie}. Multi-Modal Large Language Model Enables Protein Function Prediction, 2024. bioRxiv 2024.08.19.608729Publications Since 2020Google ScholarPublications Before 2020Congzheng Song, Shanghang Zhang, Najmeh Sadoughi, Pengtao Xie, Eric Xing. Generalized Zero-shot ICD Coding. International Joint Conference on Artificial Intelligence (IJCAI 2020).Zeya Wang, Baoyu Jing, Yang Ni, Nanqing Dong, Pengtao Xie, Eric P Xing. Adversarial Domain Adaptation Being Aware of Class Relationships. European Conference on Artificial Intelligence (ECAI 2020).B. Huang, K. Zhang, P. Xie, M. Gong, E. P. Xing. Specific and Shared Causal Relation Modeling and Mechanism-based Clustering. Advances in Neural Information Processing Systems (NeurIPS 2019).K. Xu, M. Lam, J. Pang, X. Gao, C. Band, P. Mathur, F. Papay, A. K. Khanna, J. B. Cywinski, K. Maheshwari, P. Xie, E. P. Xing. Multimodal Machine Learning for Automated ICD Coding. Conference on Machine Learning for Healthcare (MLHC 2019).Z.Wang, N.Dong, S.Rosario, M.Xu, P.Xie, and E.P.Xing. Ellipse Detection of Optic Disc-and-Cup Boundary in Fundus Image with Unsupervised Domain Adaption. The IEEE International Symposium on Biomedical Imaging (ISBI 2019).P.Xie, W.Wu, Y.Zhu and E.P.Xing. Orthogonality-Promoting Distance Metric Learning: Convex Relaxation and Theoretical Analysis. The 35th International Conference on Machine Learning (ICML 2018) (Long Oral Presentation).P.Xie, H.Zhang, Y.Zhu and E.P.Xing. Nonoverlap-Promoting Variable Selection. The 35th International Conference on Machine Learning (ICML 2018) (Short Oral Presentation).P.Xie, H.Shi, M.Zhang and E.P.Xing. A Neural Architecture for Automated ICD Coding. The 56th Annual Meeting of the Association for Computational Linguistics (ACL 2018) (Oral Presentation)B.Jing, P.Xie and E.P.Xing. On the Automatic Generation of Medical Imaging Reports. The 56th Annual Meeting of the Association for Computational Linguistics (ACL 2018).P.Xie, J.Kim, Q.Ho, Y.Yu and E.P.Xing. Orpheus: Efficient Distributed Machine Learning via System and Algorithm Co-design. Symposium of Cloud Computing (SoCC 2018).D.Sachan, P.Xie and E.P.Xing. Effective Use of Bidirectional Language Modeling for Medical Named Entity Recognition. Conference on Machine Learning for",
  "content_length": 17137,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:59"
}