{
  "name": "Peng Zhang 0052",
  "homepage": "https://sites.google.com/site/pengzhang27182",
  "status": "success",
  "content": "Peng Zhang's homepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationPeng Zhang's homepageI am an assistant professor in Computer Science at Rutgers University, and a graduate faculty in Statistics at Rutgers. I was a postdoc at Yale University, under the supervision of Prof. Daniel Spielman, during 2018 - 2021. I obtained my Ph.D. from Georgia Tech in 2018, advised by Prof. Richard Peng. Before that, I got my MS from Purdue University in 2015 and my BS from Zhejiang University in 2013.Email: pz149@rutgers.eduHill Center, Room 444I am broadly interested in algorithm design and data science. Specifically, I am interested in causal inference and experimental design, and numerical optimization and linear algebra.My research is generously supported by the National Science Foundation (NSF) (Faculty Early Career Development (CAREER) Award: CCF-2238682), Adobe Data Science Research Award, and Rutgers Research Council Individual Fulcrum Award.I co-organized an IASM-BIRS five-day workshop on \"Frontiers in Combinatorics and Theoretical Computer Science\" with Hao Huang, Jie Ma, and Fan Wei, at the Institute for Advanced Study in Mathematics in Hangzhou, China, from June 8 to June 13, 2025.TeachingAt Rutgers:CS 323 Numerical Analysis and Computing: Fall 2025CS 323 Numerical Analysis and Computing: Spring 2025 CS 323 Numerical Analysis and Computing: Spring 2024 CS 522 Network and Combinatorial Optimization: Fall 2023CS 514 Advanced Algorithms II (Spectral Graph Algorithms): Spring 2023CS 323 Numerical Analysis and Computing: Fall 2022CS 673 Discrepancy Theory and Its Applications: Fall 2021At Yale:CPSC 662 Combinatorial Discrepancy and Its Applications: Fall 2020PhD Students:Jing Jia, Qing Chen, Ziyi Cai (2023 - present)Papers(All authors are ordered alphabetically.)Balanced and Robust Multi-Treatment Experimental Designs via Randomized Differencingwith Qing Chen, Jing JiaAlmost Sharp Bounds on Weaver’s Discrepancy for Gaussian Vectors Across Different Regimeswith Qing Chen, Yunwei RenMetric Distortion of Matching: A Stochastic Perspectivewith Ziyi Cai, Qing Chen, Kangning WangWeaver's Discrepancy for Gaussian Random Vectorswith Ziyi Cai and Qing ChenSIAM Journal on Discrete Mathematics, 2025On Distributional Discrepancy for Experimental Design with General Treatment Probabilitieswith Anup RaoAISTATS 2025 (oral, top 2%)arXiv: abs/2411.02956Efficient Algorithms for Partitioning Circulant Graphs with Optimal Spectral Approximation with Surya Teja Gavva, 2024arXiv: https://arxiv.org/abs/2509.11382Balancing covariates in randomized experiments using the Gram-Schmidt walk with Christopher Harshaw, Fredrik Savje, and Daniel SpielmanJournal of the American Statistical Association (JASA), 2024arXiv https://arxiv.org/abs/1911.03071Efficient $1$-Laplacian Solvers for Well-Shaped Simplicial Complexes  with Ming DingESA 2023Hardness Results for Minimizing the Covariance of Randomly Signed Sum of VectorsarXiv abs/2211.14658, 2022Hardness Results for Weaver's Discrepancy Problem  with Daniel SpielmanAPPROX 2022Hardness Results for Laplacians of Simplicial Complexes via Sparse-Linear Equation Complete Gadgets with Ming Ding, Rasmus Kyng, and Maximilian Probst GutenbergICALP 2022Two-Commodity Flow is as Hard as Linear Programming under Nearly Linear-Time Reductions with Ming Ding and Rasmus KyngICALP 2022Positive LPs are Hard to Solve Accurately, Assuming Linear Equations are Hard with Rasmus Kyng and Di WangSODA 2020Incomplete Nested Dissection with Rasmus Kyng, Richard Peng, and Robert SchwietermanSTOC 2018Hardness Results for Structured Linear Systems with Rasmus KyngFOCS 2017, won the best student paper awardSIAM Journal on Computing (2020)On Approximate Pattern Matching with Thresholds with Mikhail J. AtallahInformation Processing Letters 123 (2017): 21-26Approximating the Solution to Mixed Packing and Covering LPs in Parallel O~(ε^{−3}) Time with Michael W. Mahoney, Satish Rao, and Di WangICALP 2016Faster and Simpler Width-Independent Parallel Algorithms for Positive Semidefinite Programming with Richard Peng, Kanat TangwongsanArxiv abs/1201.5135, 2016 Optimal Query Complexity for Estimating the Trace of a Matrix with Karl Wimmer and Yi WuICALP 2014Minimizing Seed Set Selection with Probabilistic Coverage Guarantee in a Social Network with Wei Chen, Xiaoming Sun, Yajun Wang, and Jialin ZhangSIGKDD 2014My Ph.D. dissertation:Hardness and Tractability For Structured Numerical Problems. 2018. Georgia Tech College of Computing Dissertation AwardGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4570,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:55"
}