{
  "name": "Pengfei Wang 0009",
  "homepage": "https://wangpengfeii.github.io",
  "status": "success",
  "content": "Pengfei Wang Search Pengfei Wang wangpengfei@bupt.edu.cn Beijing University of Posts and Telecommunications Biography Graduated from the Institute of Computing Technology, Chinese Academy of Sciences in 2017 with a Ph.D. degree under the supervision of Prof. Xueqi Cheng. Joined the School of Computer Science, Beijing University of Posts and Telecommunications in 2017 as an Associate Professor and PhD supervisor. Research interests focus on sequential modeling of user behaviors, data mining, machine learning, satellite big data analysis, and related tasks. Published over 60 research papers in top-tier international journals and conferences, with more than 20 papers as first author or corresponding author in CCF-A/B category venues. Accumulated over 2500 citations on Google Scholar, with two highly cited papers. Nominated for the Best Paper Award at CCIR 2020. Serves as a reviewer for multiple prestigious international academic conferences and journals. Member of the Information Retrieval Special Committee of the Chinese Information Processing Society of China (CIPS) and the Youth Working Committee of CIPS. Served as the publication chair for the China Conference on Information Retrieval 2022 and the online chair for the 10th China National Conference on Social Media Processing (SMP 2022). Awarded the “AI 2000 Most Influential Scholar Honorable Mention in Information Retrieval and Recommendation” by AMINER in 2022. Hornors and Awards Recipient of the 2022 Beijing Municipal Exemplary Course in Ideological and Political Education Jan 2022 AI 2000 Most Influential Scholar Award Honorable Mention in Information Retrieval and Recommendation Jan 2022 Participant in the Ministry of Education’s 101 Plan Dec 2021 Professional Activities ● Member of International Conference Program Committees:AAAI2018-AAAI2020. KDD 2020- KDD2021. WSDM 2021-WSDM2023. COLING 2022, CCIR 2019-CCIR2022, SIGIR2021-SIGIR2022 EMNLP2021-2022. ● Reviewer for Prestigious Journals:Transactions on Information Systems,Frontiers of Computer Science, Journal of Computer Science and Technology, Data and Information Management, Transactions on Asian and Low-Resource Language Information Processing ● Publication Chair of CCIR2022, China Information Retrieval Conference ● Invited Speaker on Cutting-edge Research in Recommender Systems at the Shandong Province Artificial Intelligence Society in 2022 ● Tutorial Speaker at CCIR2022, China Information Retrieval Conference ● Online Chair of the Tenth National Conference on Social Media Processing (SMP2022) ● Committee Member of the Youth Work Committee (CIPS) of the China Computer Federation (CIPS), Chinese Information Processing Society of China ● Committee Member of the Information Retrieval Special Committee of the Chinese Information Processing Society of China ● Keynote Speaker at the 16th National Conference for Young Scholars in Natural Language Processing in 2019 ● Keynote Speaker at the Recommender Systems Workshop hosted by the Institute of Automation, Chinese Academy of Sciences in 2018 Selected Publications Quickly discover relevant content by filtering publications. Pengfei Wang(Corresponding Author) (2024). Context-based Fast Recommendation Strategy for Long User Behavior Sequence in Meituan Waimai.. WWW 2024 Industry Track. Cite Pengfei Wang(Corresponding Author) (2024). Contextual MAB Oriented Embedding Denoising for Sequential Recommendation.. The 17th ACM International Conference on Web Search and Data Mining. Cite Zihao Li, Yunfan Xie, Wei Emma Zhang, Pengfei Wang, Lixin Zou, Fei Li, Xiangyang Luo, Chenliang Li (2024). Disentangle interest trend and diversity for sequential recommendation. Information Processing & Management. Cite PDF Jinxiao Fan, Pengfei Wang, Yu Fan, Liang Liu, Huadong Ma (2023). Num2vec: Pre-Training Numeric Representations for Time Series Forecasting in the Sensing System. ACM Transactions on Sensor Networks. Cite DOI PDF Pengfei Wang, Chenliang Li, Lixin Zou, Zhichao Feng, Kaiyuan Li, Xiaochen Li, Xialong Liu, Shangguang Wang (2023). Tutorial: Data Denoising Metrics in Recommender Systems. Proceedings of the 32nd ACM International Conference on Information and Knowledge Management. Cite DOI PDF See all publications Contact wangpengfei@bupt.edu.cn No 10, Xitucheng Road, Haidian District, Beijing 100876 Cite × Copy Download",
  "content_length": 4339,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:57"
}