{
  "name": "Penghui Yao",
  "homepage": "http://penghuiyao.info",
  "status": "success",
  "content": "Penghui Yao - Home Penghui Yao's homepage Contact Email: phyao1985#gmail.com , pyao#nju.edu.cn Short Bio I am a professor in the Department of Computer Science and Technology at Nanjing University. I am a member of CS Theory group. I obtained Bsc. from East China Normal University majored in mathematics and Ph.D. degree from Centre for Quantum Technologies, National University of Singapore fortunately supervised by Rahul Jain and Miklos Santha. Prior to joining Nanjing University, I was a postdoctoral researcher at Centrum Wiskunde Informatica(CWI), then Institute for Quantum Computing (IQC) at University of Waterloo, then Hartree postdoctoral research fellow at Joint Center for Quantum Information and Computer Science (QuICS), University of Maryland. My full cv is here. Research interest Quantum algorithms and quantum computational complexity Classical and quantum information theory Analysis of Boolean functions and its applications in quantum computing Communication complexity See preprints and publications. Graduate students Mingnan Zhao (Ph.D., 2020.9- ) Xudong Wu (Ph.D. coadvised with Yitong Yin, 2020.9-) Yangjing Dong (Ph.D. 2021.9-) Haigang Zhou (Ph.D., 2023.9 -) Fengning Ou (Ph.D., 2024.9 -) Yifan Zhou (Msc., 2025.9-) Alumni Zekun Ye (Ph.D., 2021.9-2025.7) -> Associate Prof. @ Fuzhou University Minglong Qin (Ph.D., 2019.4-2024.7) -> Postdoc @ Centre for Quantum Technologies (CQT) Zongbo Bao (MSc., 2021.9-2024.7) -> Ph.D. @ Centrum Wiskunde Informatica(CWI) Changsheng Wang (MSc., 2020.9-2023.7) -> Microsoft (Suzhou) Interns We have a few intern positions on quantum computing/TCS. Please drop me an email if you are interested. 2025.10- : Yichao Liu (Bsc. UT Austin) 2025.1- : Yuheng Zhang (Msc. Nanjing University) 2024.8-2025.7 : Shen Cao (Bsc. Central South University, now Ph.D. @ The University of Hong Kong) 2023.9-2024.1 : Yizhou Yan (Bsc. Southern University of Science and Technology) 2020.12-2022.1 : Yunqi Huang (Bsc. Sun Yat-sen University, now Ph.D. @ University of Technology, Sydney) 2020.12-2021.7: Ziyi Guan (Bsc. CMU, now Ph.D. @ EPFL) 2020.9-2021.1: Tingjia Cao (Bsc. Fudan University, now Ph.D. @ University of Wisconsin-Madison) Services Program Committee: QIP 2020, TQC 2021, TQC 2022, QIP 2023 QIP 2024 TQC 2024 AQIS 2024, ALT 2025, QIP 2025,AQIS 2025 Students Travel Awards Commitee: Program Committees: QIP 2022 Organizer: NII Shonan Meeting (with François Le Gall and Fang Song) Resources Quantum Computing. A collection of references that I think may be useful for the students and researchers who are interested in the theory aspect of quantum information and quantum computation. The Theory of Quantum Information by John Watrous. Lecture Notes on Quantum Algorithms by Andrew Childs. Quantum Computing: Lecture Notes by Ronald de Wolf. Quantum Computation and Quantum Information by Michael Nielsen and Isaac Chuang. Matrix Analysis. Some references that surpass undergraduate linear algebra and at the same time have minimum prerequisites in functional analysis or operator theory. Matrix Analysis by Rajendra Bhatia. Positive Definite Matrices by Rajendra Bhatia. Matrix Analysis by Roger A. Horn and Charles R. Johnson. Theoretical Computer Science. Some cool textbooks on TCS. Computational Complexity: A Modern Approach by Sanjeev Arora and Boaz Barak. Analysis of Boolean Functions by Ryan O'Donnell. Foundations of Cryptography: Vol 1, Vol 2 by Oded Goldreich.",
  "content_length": 3430,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:58"
}