{
  "name": "Pengcheng An",
  "homepage": "https://www.sustech.edu.cn/en/faculties/pengchengan.html",
  "status": "success",
  "content": "AN Pengcheng - Faculty - SUSTech Menu News E-Hall ä¸­æ Academic Calendar Notice News Academic Calendar Notice Library News Admissions Global  ä¸­æ   Â© 2019 All Rights Reserved.ç½ç«è®¾è®¡æ¯æ ç²¤ICPå¤14051456å· ä¸­æ Home News Events About Overview Mission & Vision Leadership The Development Plan University Governance Milestones Facts Gallery Contact us Faculty Overview High-level Talents Talent Program Directory Academics Overview View Programs Undergraduate Education Graduate Education Overseas Studies Schools and Colleges International students Research Overview Research Centers & Facilities Technology Transfer Research News Research Administration Go Global Campus Life Overview Residential College Housing & Dining Clubs & Organizations Email Library Admissions Give University Intranets Old Site Faculty ä¸­æ Go Back Search AN Pengcheng Assistant Professor anpc@sustech.edu.cn Personal Homepage Assistant Professor of the School of Design at Southern University of Science and Technology, is a researcher and educator at the intersection of Design and Human-Computer Interaction (HCI). The scope of Pengchengâs research encompasses the design and implications of emerging intelligent, interactive systems in everyday scenarios, including Internet-of-Things (IoT) environments (e.g., smart classroom or office), and embodied, multi-modal user interfaces. Pengcheng received his Ph.D. degree from the Department of Industrial Design, Eindhoven University of Technology, the Netherlands. In the same department, he fulfilled a postdoctoral research program and several teaching duties. After that, he joined the School of Computer Science at the University of Waterloo, Canada, as a postdoctoral research fellow and sessional lecturer. Pengchengâs research has been published in top academic venues in HCI and received recognitions such as âBest Paper Honorable Mention Awardâ (ACM CHI) and âReviewersâ Choice Awardâ (INTERACT). His design works received two times of âRed Dot Design Award: Best of the Bestâ, and an âiF Design Talent Awardâ. Over the past years, he has also been contributing to the community of Design and HCI as an organizer or reviewer of international conferences (e.g., CHI, DIS, TEI, IDC, Chinese CHI), and reviewing editor of peer-reviewed journals (e.g., Behavior & Information Technology, Taylor & Francis, and Experimental Results, Cambridge University Press). Apply Now Careers@SUSTech Cooperation With SUSTech",
  "content_length": 2488,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:55"
}