{
  "name": "Peng Sun 0003",
  "homepage": "https://pengsun6.github.io",
  "status": "success",
  "content": "Peng Sun Peng Sun (孙 鹏) Associate Professor College of Computer Science and Electronic Engineering Hunan University Email: psun@hnu.edu.cn [Google Scholar] [Semantic Scholar] [ResearchGate] [ORCID] [Biography] | [Research Interests] | [Projects] | [Selected Publications] | [Services] | [Awards and Honors] Biography Peng Sun is currently an Associate Professor with Hunan University. Before that, he worked as a Postdoctoral Researcher with The Chinese University of Hong Kong, Shenzhen, advised by Prof. Jianwei Huang. He received his Ph.D degree from Zhejiang University in 2020, advised by Prof. Zhi Wang and Prof. Zhibo Wang, and his B.E. degree from Tianjin University in 2015. From Nov. 2018 to Nov. 2019, he was a visiting Ph.D student with The University of Tennessee, Knoxville, where he conducted research under the supervision of Prof. Hairong Qi. Research Interests Internet of Things, Privacy and Security in Federated Learning, Mobile Crowdsensing, Compressive Sensing. Projects Research on Key Technologies for Efficient and Robust Federated Learning, Projects of the Young Scientists Fund, National Natural Science Foundation of China (NSFC), RMB 300,000, PI. Research on Key Technologies for Secure and Efficient Federated Learning, General Project, China Postdoctoral Science Foundation, RMB 80,000, PI. Selected Publications (* denotes corresponding author) Journal Papers: Zhibo Wang, Defang Liu, Yunan Sun, Xiaoyi Pang, Peng Sun, Feng Lin, John C.S. Lui, and Kui Ren. A Survey on IoT-enabled Home Automation Systems: Attacks and Defenses. IEEE Communications Surveys & Tutorials, accepted, 2022. (Impact Factor: 33.84) Xiaoyi Pang, Zhibo Wang, Zeqing He, Peng Sun, Meng Luo, Ju Ren, and Kui Ren. Towards Class-balanced Privacy Preserving Heterogeneous Model Aggregation. IEEE Transactions on Dependable and Secure Computing (TDSC), accepted, 2022. (CCF A)(PDF) Liantao Wu, Zening Liu, Peng Sun, Honglong Chen, Kunlun Wang, Yong Zuo, and Yang Yang. DOT: Decentralized Offloading of Tasks in OFDMA based Heterogeneous Computing Networks. IEEE Internet of Things Journal (IoT-J), accepted, 2022. (JCR Q1) (PDF) Peng Sun, Haoxuan Che, Zhibo Wang*, Yuwei Wang, Tao Wang, Liantao Wu, and Huajie Shao. Pain-FL: Personalized Privacy-Preserving Incentive for Federated Learning. IEEE Journal on Selected Areas in Communications (JSAC), vol. 39, no. 12, pp. 3805-3820, 2021. (CCF A) (PDF) Peng Sun, Zhibo Wang, Liantao Wu, Yunhe Feng, Xiaoyi Pang, Hairong Qi, and Zhi Wang*. Towards Personalized Privacy-Preserving Incentive for Truth Discovery in Mobile Crowdsensing Systems. IEEE Transactions on Mobile Computing (TMC), vol. 21, no. 1, pp. 352-365, 2022. (CCF A) (PDF) Liantao Wu, Peng Sun*, Zhibo Wang, Yang Yang, and Zhi Wang. Temporal Correlation Enhanced Multiuser Detection for Uplink Grant-Free NOMA. IEEE Transactions on Mobile Computing (TMC), accepted, 2021. (CCF A) (PDF) Peng Sun, Zhibo Wang, Liantao Wu*, Huajie Shao, Hairong Qi, and Zhi Wang. Trustworthy and Cost-Effective Cell Selection for Sparse Mobile Crowdsensing Systems. IEEE Transactions on Vehicular Technology (TVT), vol. 70, no. 6, pp. 6108-6121, 2021. (JCR Q1) (PDF) Liantao Wu, Zhibo Wang, Peng Sun*, and Yang Yang. Temporal Correlation Enhanced Sparse Activity Detection in MIMO Enabled Grant-Free NOMA. IEEE Transactions on Vehicular Technology (TVT), vol. 71, no. 3, pp. 2887-2899, 2022. (JCR Q1)(PDF) Peng Sun, Liantao Wu, Zhibo Wang, Yunhe Feng, and Zhi Wang*. SCRA: Structured Compressive Random Access for Efficient Information Collection in IoT. IEEE Internet of Things Journal (IoT-J), vol. 7, no. 3, pp. 2356-2367, 2020. (JCR Q1) (PDF) Peng Sun, Zhi Tian, Zhibo Wang, and Zhi Wang*. PRSS: A Prejudiced Random Sensing Strategy for Energy-Efficient Information Collection in the Internet of Things. IEEE Internet of Things Journal (IoT-J), vol. 6, no. 2, pp. 2717-2728, 2019. (JCR Q1) (PDF) Liantao Wu, Peng Sun*, Zhibo Wang, and Yang Yang. Joint User Activity Identification and Channel Estimation for Grant-Free NOMA: A Spatial-Temporal Structure Enhanced Approach. IEEE Internet of Things Journal (IoT-J), vol. 8, no. 15, pp. 12339-12349, 2021. (JCR Q1) (PDF) Liantao Wu, Peng Sun*, Yang Yang, Zhibo Wang, and Zhi Wang. Towards Efficient Compressed Sensing-based RFID Identification: A Sparsity Controlled Approach. IEEE Internet of Things Journal (IoT-J), vol. 7, no. 8, pp. 7714-7724, 2020. (JCR Q1) (PDF) Liantao Wu, Peng Sun, Ming Xiao, Yuhen Hu and Zhi Wang*. Sparse Signal Aloha: A Compressive Sensing-Based Method for Uncoordinated Multiple Access. IEEE Communications Letters, vol. 21, no. 6, pp. 1301-1304, 2017. (PDF) Conference Papers: Peng Sun, Xu Chen, Guocheng Liao, and Jianwei Huang*. A Profit-Maximizing Model Marketplace with Differentially Private Federated Learning. IEEE International Conference on Computer Communications (INFOCOM), Virtual Conference, 2022. (CCF A)(Acceptance Rate = 19.9%)(PDF) Peng Sun, Zhibo Wang, Yunhe Feng, Liantao Wu, Yanjun Li, Hairong Qi, and Zhi Wang*. Towards Personalized Privacy-Preserving Incentive for Truth Discovery in Crowdsourced Binary-Choice Question Answering. IEEE International Conference on Computer Communications (INFOCOM), Virtual Conference, 2020. (CCF A)(Acceptance Rate = 19.8%)(PDF) Bo Zhao, Peng Sun*, Tao Wang, and Keyu Jiang. FedInv: Byzantine-Robust Federated Learning by Inversing Local Model Updates. The Thirty-Sixth AAAI Conference on Artificial Intelligence (AAAI), Virtual Conference, 2022. (CCF A)(Acceptance Rate = 15%)(PDF) Zhibo Wang, Jinxin Ma, Yongquan Zhang, Qian Wang, Ju Ren, and Peng Sun. Attention-over-Attention Field- aware Factorization Machine. The Thirty-Fourth AAAI Conference on Artificial Intelligence (AAAI), Virtual Conference, 2020. (CCF A)(PDF) Services Technical Program Committee Member: AAAI 2023 IEEE Globecom 2022, 2021, 2020, 2019 WASA 2022 Journal Reviewer: IEEE Journal on Selected Areas in Communications IEEE Transactions on Mobile Computing IEEE/ACM Transactions on Networking IEEE Transactions on Knowledge and Data Engineering IEEE Transactions on Communications IEEE Transactions on Wireless Communications IEEE Network Magazine IEEE Transactions on Industrial Informatics IEEE Transactions on Vehicular Technology IEEE Transactions on Cloud Computing IEEE Internet of Things Journal Awards and Honors Outstanding Graduate, Zhejiang Province, 2020 Outstanding Graduate, Zhejiang University, 2020 Nandu Scholarship, Zhejiang University, 2019 Award of Honor for Graduate, Zhejiang University, 2019, 2018, 2017, 2016 SUPCON Scholarship, Zhejiang University, 2017 First Prize of Academic Scholarship, Tianjin University, 2014 National Scholarship, Ministry of Education, 2013",
  "content_length": 6692,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:54"
}