{
  "name": "Peng Liu 0005",
  "homepage": "https://s2.ist.psu.edu/pliu",
  "status": "success",
  "content": "Peng Liu Peng Liu Raymond G. Tronzo, M.D. Professor of Cybersecurity College of IST Director, Cyber Security Lab Director, Center for Cybersecurity, Information Privacy, and Trust Pennsylvania State University, University Park Papers (over 400):  list PhD descendants: list Lab alumni in academia: list What is new -- (2025) I gave a talk on “LLM Agent Systems Meet Cybersecurity: Current Status and Future Directions” when attending the “Pushing the Boundaries of AI and Human Intelligence for Cybersecurity” workshop organized by the Singapore CyberRG R&D Program Office: slides -- (2023) I gave a talk on “AI for Cybersecurity: Current Status and the Role of GPT-4”: slides -- Cyber Security Lab “AI for Cybersecurity” Initiative -- (2022) We published a first handbook of “AI for Cybersecurity” use cases: https://psucybersecuritylab.github.io Research interests -- Agentic AI for Cybersecurity -- Systems Security Popular press -- My group’s research has been featured in Scientific American, The Association Press, The Times, Washington Post, USA Today, Business Week, Forbes, MSNBC, ABC Money, and PC World. To join my group: I am regularly looking for motivated students and post-docs. Contact -- Email: pxl20 AT psu.edu -- 413D Eric Barron Innovation Hub Building, University Park, PA 16802; 814-863-0641 (o) Services (selected) -- Program Committees: USENIX ATC’25, DSN’25, ESORICS’24 -- Editors-in-Chief, Journal of Computer Security -- Program Co-Chair, IEEE/IFIP DSN 2022 -- Program Co-Chair, ACM SACMAT 2020 -- Program Co-Chair, ACM IoT S&P Workshop 2019 -- Program Co-Chair, IEEE CNS 2018 -- Sponsorship Co-Chair, ACM CCS 2017 -- Program Co-Chair, ACM MTD Workshop 2016 -- Steering Committee Chair, SecureComm, 2008-2014 -- Program Co-Chair, ACM AsiaCCS 2010 -- Executive Editor-in-Chief, Cybersecurity, a SpringerOpen Journal, since 2017 My Erdos number: 3",
  "content_length": 1872,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:55"
}