{
  "name": "Peng-Shuai Wang",
  "homepage": "https://wang-ps.github.io",
  "status": "success",
  "content": "Peng-Shuai Wang Peng-Shuai Wang （王鹏帅） Assistant Professor, Ph.D. Advisor Wangxuan Institute of Computer Technology Peking University Address: Haidian District, Beijing, China Email: wangps AT hotmail.com GitHub Google Twitter Blog I am a tenure-track Assistant Professor at Peking University from 2022. I am now working closely with top graphics labs at Peking University led by Prof. Baoquan Chen, Prof. Zhouhui Lian, and Prof. Guoping\tWang. Before joining Peking University, I was a senior researcher in the graphics group at Microsoft Research Asia led by Dr. Xin Tong, where I was also a research intern from 2014 to 2018, mentored by Dr. Yang Liu. I received my Ph.D. from the Institute for Advanced Study at Tsinghua University in 2018, supervised by Prof. Baining Guo. I got my Bachelor's degree from the Department of Automation at Tsinghua University in 2013. I am leading the Spatial Intelligence Group (SIG) at Peking University. My research interests include computer graphics, geometry processing, and deep learning. My recent research focus is to develop a unified 3D deep learning framework for the understanding, generation, and rendering of 3D data. My paper on Octree-based 3D Convolutional Neural Networks is one of the Top-5 Most Cited Papers in ACM Transactions on Graphics from 2017 to 2022. I have been awarded the AsiaGraphics Young Researcher Award in 2023, and China3DV Excellent Young Researcher Award in 2025. I am always actively recruiting Ph.D. students and research interns! Welcome to contact me with your CV and research statement! Aug. 13, 2025, I have 1 paper accepted by SIGGRAPH Asia 2025. May. 27, 2025, I start to serve as the associate editor for IEEE TVCG. May. 17, 2025, I have 1 paper accepted by SGP 2025. Apr. 13, 2025, I am awarded the China3DV 2025 Excellent Young Researcher Award. Mar. 29, 2025: I have 2 papers accepted by SIGGRAPH 2025. Mar. 06, 2025, I will serve as a technical papers committee member for SIGGRAPH Asia 2025. Aug. 01, 2024: I have 1 paper accepted by SIGGRAPH Asia 2024. Apr. 24, 2024: Our paper SDF-StyleGAN is awarded one of the Top-10 Most Cited Papers in CGF from 2022 to 2023. Oct. 15, 2023: I am awarded the AsiaGraphics Young Researcher Award. Aug. 04, 2023: I have 5 papers accepted by SIGGRAPH (Asia) 2023, including one single-author paper. Neural Visibility of Point Sets Jun-Hao Wang*, Yi-Yang Tian*, Baoquan Chen, and Peng-Shuai Wang (*Joint first authors) ACM SIGGRAPH Asia (Conference track), 2025 Code Arxiv OctGPT: Octree-based Multiscale Autoregressive Models for 3D Shape Generation Si-Tong Wei, Rui-Huan Wang, Chuan-Zhi Zhou, Baoquan Chen, and Peng-Shuai Wang ACM SIGGRAPH (Conference track), 2025 Code Arxiv DeepMill: Neural Accessibility Learning for Subtractive Manufacturing Fanchao Zhong*, Yang Wang*, Peng-Shuai Wang, Lin Lu, and Haisen Zhao (*Joint first authors) ACM SIGGRAPH (Conference track), 2025 Code Arxiv OctFusion: Octree-based Diffusion Models for 3D Shape Generation Bojun Xiong*, Si-Tong Wei*, Xin-Yang Zheng, Yan-Pei Cao, Zhouhui Lian, and Peng-Shuai Wang (*Joint first authors) Computer Graphics Forum (SGP), 2025 Code Arxiv Joint Point Cloud Upsampling and Cleaning with Octree-based CNNs Jihe Li, Bo Pang, and Peng-Shuai Wang Computational Visual Media (CVMJ), 2024 Code Arxiv Neural Laplacian Operator for 3D Point Clouds Bo Pang, Zhongtian Zheng, Yilong Li, Guoping Wang, and Peng-Shuai Wang ACM Transactions on Graphics (SIGGRAPH Asia), 43(6), 2024 Code Slides Arxiv Point Transformer V3: Simpler, Faster, Stronger Xiaoyang Wu, Li Jiang, Peng-Shuai Wang, Zhijian Liu, Xihui Liu, Yu Qiao, Wanli Ouyang, Tong He, and Hengshuang Zhao Computer Vision and Pattern Recognition (CVPR), 2024 - (Oral, 0.78% acceptance rate) Code Arxiv 3D Feature Prediction for Masked-AutoEncoder-Based Point Cloud Pretraining Siming Yan, Yu-Qi Yang, Yu-Xiao Guo, Hao Pan, Peng-Shuai Wang, Xin Tong, Yang Liu, and Qixing Huang International Conference on Learning Representations (ICLR), 2024 Code Arxiv Swin3D: A Pretrained Transformer Backbone for 3D Indoor Scene Understanding Yu-Qi Yang, Yu-Xiao Guo, Jian-Yu Xiong, Yang Liu, Hao Pan, Peng-Shuai Wang, Xin Tong, and Baining Guo Computational Visual Media (CVMJ), 2024 Code Arxiv Project Learning the Geodesic Embedding with Graph Neural Networks Bo Pang*, Zhongtian Zheng*, Guoping Wang, and Peng-Shuai Wang (*Joint first authors) ACM Transactions on Graphics (SIGGRAPH Asia), 42(6), 2023 Code Slides Arxiv Neural-Singular-Hessian: Implicit Neural Representation of Unoriented Point Clouds by Enforcing Singular Hessian Zixiong Wang, Yunxiao Zhang, Rui Xu, Fan Zhang, Peng-Shuai Wang, Shuangmin Chen, Shiqing Xin, Wenping Wang, and Changhe Tu ACM Transactions on Graphics (SIGGRAPH Asia), 42(6), 2023 Code Arxiv SinMPI: Novel View Synthesis from a Single Image with Expanded Multiplane Images Guo Pu, Peng-Shuai Wang, and Zhouhui Lian ACM SIGGRAPH Asia (Conference track), 2023 Code Arxiv Randomized Quantization for Data Agnostic Representation Learning Huimin Wu*, Chenyang Lei*, Xiao Sun, Peng-Shuai Wang, Qifeng Chen, Kwang-Ting Cheng, Stephen Lin, and Zhirong Wu (*Joint first authors) International Conference on Computer Vision (ICCV), 2023 Code Arxiv Neural-IMLS: Learning Implicit Moving Least-Squares for Surface Reconstruction from Unoriented Point clouds Zixiong Wang, Pengfei Wang, Peng-Shuai Wang, Qiujie Dong, Junjie Gao, Shuangmin Chen, Shiqing Xin, Changhe Tu, and Wenping Wang IEEE Transactions on Visualization and Computer Graphics (TVCG), 2023 Code Arxiv OctFormer: Octree-based Transformers for 3D Point Clouds Peng-Shuai Wang ACM Transactions on Graphics (SIGGRAPH), 42(4), 2023 Code Slides Arxiv Project Locally Attentional SDF Diffusion for Controllable 3D Shape Generation Xin-Yang Zheng, Hao Pan, Peng-Shuai Wang, Xin Tong, Yang Liu, and Heung-Yeung Shum ACM Transactions on Graphics (SIGGRAPH), 42(4), 2023 Code Slides Arxiv Project SDF-StyleGAN: Implicit SDF-Based StyleGAN for 3D Shape Generation Xin-Yang Zheng, Yang Liu, Peng-Shuai Wang, and Xin Tong Computer Graphics Forum (SGP), 2022 Code Arxiv Project Dual Octree Graph Networks for Learning Adaptive Volumetric Shape Representations Peng-Shuai Wang, Yang Liu, and Xin Tong ACM Transactions on Graphics (SIGGRAPH), 41(4), 2022 Code Code (Stale) Slides Arxiv Project Semi-Supervised 3D Shape Segmentation with Multilevel Consistency and Part Substitution Chun-Yu Sun, Yu-Qi Yang, Hao-Xiang Guo, Peng-Shuai Wang, Xin Tong, Yang Liu, and Heung-Yeung Shum Computational Visual Media (CVMJ), 2022 Code Arxiv Project Interpolation-Aware Padding for 3D Sparse Convolutional Neural Networks Yu-Qi Yang, Peng-Shuai Wang, and Yang Liu International Conference on Computer Vision (ICCV), 2021 Code Arxiv Project Spline Positional Encoding for Learning 3D Implicit Signed Distance Fields Peng-Shuai Wang, Yang Liu, Yu-Qi Yang, and Xin Tong International Joint Conferences on Artificial Intelligence (IJCAI), 2021 Code Slides Arxiv Project Deep Implicit Moving Least-Squares Functions for 3D Reconstruction Shi-Lin Liu, Hao-Xiang Guo, Hao Pan, Peng-Shuai Wang, Xin Tong, and Yang Liu Computer Vision and Pattern Recognition (CVPR), 2021 Code Arxiv OctSurf: Efficient hierarchical voxel-based molecular surface representation for protein-ligand affinity prediction Qinqing Liu , Peng-Shuai Wang, Chunjiang Zhu, Blake Blumenfeld Gaines, Tan Zhu, Jinbo Bi, and Minghu Song Journal of Molecular Graphics and Modelling, 2021 Jeffry D. Madura Memorial Graphics Prize Code Paper Unsupervised 3D Learning for Shape Analysis via Multiresolution Instance Discrimination Peng-Shuai Wang, Yu-Qi Yang, Qian-Fang Zou, Zhirong Wu, Yang Liu, and Xin Tong AAAI Conference on Artificial Intelligence (AAAI), 2021 Code Slides Arxiv Project Deep Octree-based CNNs with Output-Guided Skip Connections for 3D Shape and Scene Completion Peng-Shuai Wang, Yang Liu, and Xin Tong Computer Vision and Pattern Recognition (CVPR) Workshops, 2020 Code Arxiv Adaptive O-CNN: A Patch-based Deep Representation of 3D Shapes Peng-Shuai Wang, Chun-Yu Sun, Yang Liu and Xin Tong ACM Transactions on Graphics (SIGGRAPH Asia), 37(6), 2018 Code Slides Arxiv Project DOI O-CNN: Octree-based Convolutional Neural Networks for 3D Shape Analysis Peng-Shuai Wang, Yang Liu, Yu-Xiao Guo, Chun-Yu Sun, and Xin Tong ACM Transactions on Graphics (SIGGRAPH), 36(4), 2017 Top-5 Most Cited Papers in ACM Transactions on Graphics from 2017 to 2022 Code Code (Stale) Slides Arxiv Project DOI Mesh Denoising via Cascaded Normal Regression Peng-Shuai Wang, Yang Liu, and Xin Tong ACM Transactions on Graphics (SIGGRAPH Asia), 35(6), 2016 Code Data Project DOI Rolling Guidance Normal Filter for Geometric Processing Peng-Shuai Wang, Xiao-Ming Fu, Yang Liu, Xin Tong, Shi-Lin Liu, and Baining Guo ACM Transactions on Graphics (SIGGRAPH Asia), 34(6), 2015 EXE Data Video DOI Computer Vision (Undergraduate course, 2023-2025 Fall) Programming in Artificial Intelligence (Undergraduate course, 2023-2025 Fall) The Frontiers of Geometry Computing (Undergraduate course, 2023-2025 Spring) Graduate Students supervised by me: Ph.D. Students: Rui-Huan Wang (Peking University, 2025), Si-Tong Wei (Peking University, 2024), Jun-Hao Wang (Peking University, 2024). Research Interns collaborating with me for more than 6 months with papers or theses: Ph.D. Students: Jia-Cheng Xu (Peking University, 2025/03 - now), Bo Pang (Peking University, 2022/10 - now); Xin-Yang Zheng (Tsinghua University, 2021/07 - 2023/01), Yu-Qi Yang (Tsinghua University, 2021/01 - 2022/02). Master's Students: Ran Dan (Peking University, 2024/10 - now); Kairui Jiang (Peking University, 2024/06 - 2025/06), Jihe Li (Peking University, 2023/05 - 2024/03), Bojun Xiong (Peking University, 2023/05 - 2024/05), Zhongtian Zheng (Peking University, 2022/10 - 2024/05). Undergraduate Students: Chuan-Zhi Zhou (Peking University, 2024/06 - now), Yi-Yang Tian (Peking University, 2024/09 - now); Tingyang Zhang (Peking University, 2024/11 - 2025/06), Bozhao Zhang (Peking Unive",
  "content_length": 10939,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:55"
}