{
  "name": "Peng Song 0001",
  "homepage": "https://songpenghit.github.io",
  "status": "success",
  "content": "Peng SONG Peng Song Assistant Professor of Computer Science Pillar of Information Systems Technology and Design (ISTD) Singapore University of Technology and Design (SUTD) Email: peng_song@sutd.edu.sg Office: 1.502-13, SUTD, Singapore Research My research is in the area of computer graphics, with a focus on topics in geometric modeling, computational design, and computational fabrication. I am particularly interested in developing computational representations, methods and algorithms for designing fabricable and functional real-world objects. See my Publications and YouTube channel for various objects (e.g., products, puzzles, furniture, architecture, mechanisms, robots) that are automatically designed by these computational methods. Biography I am an Assistant Professor in Singapore University of Technology and Design (SUTD). Before joining SUTD in 2019, I was a research scientist in the Geometric Computing Laboratory, EPFL, working with Mark Pauly. From 2014 to 2017, I was an associate researcher in University of Science and Technology of China. From 2013 to 2014, I was a research fellow in Nanyang Technological University, working with Chi-Wing Fu. I received my PhD in Computer Science from Nanyang Technological University in 2013, under the supervision of Chi-Wing Fu. I received my master degree in 2010, and bachelor degree in 2007, both from Harbin Institute of Technology. Find more about me: Google Scholar DBLP SUTD Page LinkedIn Group Page Teaching 50.017 Graphics and Visualisation     2020 - 2024 50.052 Extended Reality     2023 - 2024 10.020 Data Driven World     2021 - 2023 50.034 Introduction to Probability and Statistics     2020 50.006 User Interface Design and Implementation     2020 Awards 2025 Best Paper Award,     Shape Modeling International 2024 Best Paper Award,     Shape Modeling International 2022 Best Paper Honorable Mention Award,     SIGGRAPH 2017 Technical Paper selected for Press Release as Research Highlight,     SIGGRAPH Asia 2015 ACM Hefei Rising Star Award Research Grants 2024 Singapore MOE Academic Research Fund Tier 2 grant,   PI 2023 Singapore MOE Academic Research Fund Tier 2 grant,   PI Professional Services Editorial Board of Academic Journals Computers & Graphics,   Associate Editor 2024 - present Graphical Models,   Associate Editor     2024 - present Research Seminar Organizer Computational Fabrication Seminar   2021, 2022 Executive Committee Member Asiagraphics   2022 - present Program Committee Member SIGGRAPH Asia - Technical Papers 2025, 2023 SIGGRAPH Asia - Educator's Forum 2024 SIGGRAPH Asia - Courses 2019 SIGGRAPH Asia - Technical Briefs and Posters 2016 Pacific Graphics 2024, 2019 Symposium on Geometry Processing (SGP) 2024 Symposium on Solid and Physical Modeling (SPM) 2025, 2024, 2023, 2022 Geometric Modeling and Processing (GMP) 2024 Computational Visual Media (CVM)   2024, 2023 ACM Multimedia - Technical Demos and Videos   2024 Computer Graphics International (CGI) 2023 CAD/Graphics 2025, 2023, 2021, 2019, 2017 Last revised: Sep 03, 2024.",
  "content_length": 3044,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:54"
}