{
  "name": "Pengfei Su 0001",
  "homepage": "https://pengfei-su.github.io",
  "status": "success",
  "content": "Pengfei Su's Homepage Pengfei Su Assistant Professor HPCSA Group Department of Computer Science and Engineering University of California, Merced Office: SE2 276, 5200 N. Lake Road, Merced, CA 95343 Email: psu9 [@] ucmerced [DOT] edu Curriculum Vitae About I received a Ph.D. degree from William & Mary in 2021, under the supervision of Dr. Xu Liu, an M.S. degree from Institute of Computing Technology, Chinese Academy of Sciences in 2016, and a B.E. degree from Yunnan University in 2013. My research interests broadly lie in programming languages, program analysis, high-performance/parallel computing, ML systems, as well as software engineering, with an emphasis on providing tools support for analyzing and optimizing software inefficiencies. Multiple openings are available for self-motivated M.S. and Ph.D. students. Feel free to ping me with your resume, transcript, and anything else that could be a plus for your application! News 07/2025: A paper got accepted at CGO. 06/2025: An NSF proposal got funded. Thanks, NSF! 01/2025: Received the NSF CAREER Award. Many thanks to the NSF, Dr. Andresen, and the review panel! 08/2024: An NSF proposal got funded. Thanks, NSF! 05/2024: Received the Hellman Fellows Award. 04/2024: Two papers got accepted at USENIX ATC. 08/2023: A paper got accepted at TACO. 06/2023: An NSF proposal got funded. Thanks, NSF! 01/2023: A paper got accepted at ASPLOS. 11/2022: Mao Lin will be doing a part-time internship @Uber in developing auto patching techniques to fix data races in Go. 11/2022: A paper got accepted at CGO. 04/2022: Mao Lin will intern @PNNL this summer. 03/2022: Received the Academic Senate Faculty Grant. 12/2021: A paper got accepted at ICSE. 07/2021: My first NSF proposal got funded. Thanks, NSF! 05/2021: pprof++, an accurate, precise, and comprehensive Go profiler (collaborated with Dr. Milind Chabbi from Uber), draws ever-increasing attention. [Uber blog] [Design details] [Hacker news] [Code] Research Interests Programming Languages Static and Dynamic Program Analysis High-performance/Parallel Computing ML Systems Software Engineering Publications [CGO'26] \"Trace4J: A Lightweight, Flexible, and Insightful Performance Tracing Tool for Java\", Haide He, Pengfei Su. The IEEE/ACM International Symposium on Code Generation and Optimization, Jan 31-Feb 4, 2026, Sydney, Australia. [USENIX ATC'24] \"FlexMem: Adaptive Page Profiling and Migration for Tiered Memory\", Dong Xu, Junhee Ryu, Jinho Baek, Kwangsik Shin, Pengfei Su, Dong Li. The 2024 USENIX Annual Technical Conference, July 10-12, 2024, Santa Clara, CA, USA. [USENIX ATC'24] \"Centimani: Enabling Fast AI Accelerator Selection for DNN Training with a Novel Performance Predictor\", Zhen Xie, Murali Emani, Xiaodong Yu, Dingwen Tao, Xin He, Pengfei Su, Keren Zhou, Venkatram Vishwanath. The 2024 USENIX Annual Technical Conference, July 10-12, 2024, Santa Clara, CA, USA. [TACO'23] \"MicroProf: Code-level Attribution of Unnecessary Data Transfer in Microservice Applications\", Syed Salauddin Mohammad Tariq, Lance Menard, Pengfei Su, Probir Roy. ACM Transactions on Architecture and Code Optimization, Aug 2023. Original Work [HIPS'23] \"Designing Secure Performance Metrics for Last-Level Cache\", Probir Roy, Birhanu Eshete, Pengfei Su. The 28th International Workshop on High-Level Parallel Programming Models and Supportive Environments, May 15, 2023, Petersburg, FL, USA. [ASPLOS'23] \"DrGPUM: Guiding Memory Optimization for GPU-accelerated Applications\", Mao Lin, Keren Zhou, Pengfei Su. The 28th International Conference on Architectural Support for Programming Languages and Operating Systems, Mar 25-29, 2023, Vancouver, BC, Canada. [CGO'23] \"DJXPerf: Identifying Memory Inefficiencies via Object-centric Profiling for Java\", Bolun Li, Pengfei Su, Milind Chabbi, Shuyin Jiao, Xu Liu. The IEEE/ACM International Symposium on Code Generation and Optimization, Feb 25–Mar 1, 2023, Montreal, QC, Canada. [Paper] [PyTorch Conference'22] \"Poster: Squeezing GPU Memory Usage in PyTorch\", Mao Lin, Keren Zhou, Pengfei Su. [ICSE'22] \"OJXPerf: Featherlight Object Replica Detection for Java Programs\", Bolun Li, Hao Xu, Qidong Zhao, Pengfei Su, Milind Chabbi, Shuyin Jiao, Xu Liu. The 44th IEEE/ACM International Conference on Software Engineering, May 8-27, 2022, Pittsburgh, PA, USA. [Paper] [SC'19] \"Pinpointing Performance Inefficiencies via Lightweight Variance Profiling\", Pengfei Su, Shuyin Jiao, Milind Chabbi, Xu Liu. The International Conference for High Performance Computing, Networking, Storage and Analysis, Nov 17-22, 2019, Denver, CO, USA. [Paper] [Slides] [ESEC/FSE'19] \"Pinpointing Performance Inefficiencies in Java\", Pengfei Su, Qingsen Wang, Milind Chabbi, Xu Liu. The 27th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering, Aug 26-30, 2019, Tallinn, Estonia. [Paper] [Slides] [ICSE'19] \"Redundant Loads: A Software Inefficiency Indicator\", Pengfei Su, Shasha Wen, Hailong Yang, Milind Chabbi, Xu Liu. The 41st IEEE/ACM International Conference on Software Engineering, May 25-Jun 1, 2019, Montreal, Canada. [Paper] [Slides] ACM SIGSOFT Distinguished Paper Award [PPoPP'19] \"Lightweight Hardware Transactional Memory Profiling\", Qingsen Wang, Pengfei Su, Milind Chabbi, Xu Liu. The 24th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, Feb 16-20, 2019, Washington, D.C.. [Paper] [Slides] Best Paper Award Professional Services Organization Committee: PPoPP'24 (AE Chair), CLUSTER'21 (Session Chair), HDIS'21 (Session Chair) Program Committee: SC'26, ICS'26, PPoPP'25, HiPC'24, ICPP'24, PPoPP'24 (ERC), IPDPS'23, CLUSTER'23, ICPADS'22&23, HIPS'21, LCTES'21&24&25 Artifact Evaluation Committee: ASPLOS'20, CGO'18&19&20, PPoPP'18&19&21 Journal Reviewer: TECS'21, TACO'25 Conference Reviewer: CLUSTER'21, CGO'20, HPCA'20, IPDPS'20, BIGCOM'19, ICPP'17&19&20 Conference Volunteer: ASPLOS'18 Honors and Awards NSF CAREER Award, 2025 Hellman Fellows Award, 2024 Stephen K.Park Graduate Research Award, William & Mary, 2020 SIGSOFT Travel Award, ESEC/FSE, 2019 Distinguished Paper Award, ICSE, 2019 Best Paper Award, PPoPP, 2019 SIGPLAN Travel Award, PPoPP, 2019 NSF Travel Award, PPoPP, 2019 Grants NSF IUSE EDU, PI, 2024 NSF IUCRC Preliminary Proposal Planning, co-PI, 2023 UCM Academic Senate Faculty Research, sole PI, 2022 NSF Core Small, PI, 2021 Ph.D. Students Dinghong Song (Fall 2024 -, co-advised by Prof. Dong Li) Haide He (Spring 2024 -) Xingjian Ding (Fall 2023 -) Undergraduates Jayden John (Fall 2024 -) Past Students Mao Lin Tahea Hossain (Summer 2021) Teaching CSE100 Algorithm Design and Analysis: Fall 2025 CSE141 Introduction to Compiler Construction: Spring 2024&2025 CSE165 Introduction to Object-oriented Programming: Fall 2021&2022 EECS254 Compiler Construction: Spring 2022&2023, Fall 2023&2024 Industry Experiences Software Engineering Intern @Uber Technologies, Inc. (May - Aug 2019) Research Engineer @Facebook, Inc. (May - Nov 2020)",
  "content_length": 6979,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:56"
}