{
  "name": "Pengyu Hong",
  "homepage": "http://www.cs.brandeis.edu/~hong",
  "status": "success",
  "content": "Welcome to Pengyu Hong's Homepage ProfessorComputer Science Volen Center for Complex Systems 135 MS 018, Brandeis University Waltham, MA 02453 Phone: 781-736-2729 Fax: 781-736-2741 Email: Ack: our research is sponsored by Research My research focuses on machine learning and its applications, such as, Bioinformatics, Glycomics, Materials Research, FinTech, Medical Informatics, and so on. I am recruiting PhD students with solid backgrounds in math and programming. Recent publications: Chen, Z.; Li, P.; Dong, X.; Hong, P. (accepted) Uncertainty Quantification for Clinical Outcome Predictions with (Large) Language Models. The 2025 Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguisticss. Li, Y.; Xu, H.; Kumar, A.; Wang, D.; Heiss, C.; Azadi, P.; Hong, P. (2025) TransPeakNet for Solvent-aware 2D NMR Prediction via Multi-Task Pre-Training and Unsupervised Learning. Nature Communications Chemistry. DOI:10.1038/S42004-025-01455-9 Hong, P.; Xia, C.; Tang, Y.; Wei, J.; Lin, C. (2025) Glycan mixture analysis by kernel component composition for matrix factorization. Analytical and Bioanalytical Chemistry. DOI: 10.1007/s00216-025-05777-4 Chen, Z.; Madireddy, S.; Hong, P. (2024) Quantifying Uncertainty in Large Language Models: Applications in Molecular Chemistry Tasks. NeurIPS Workshop Statistical Foundations of LLMs and Foundation Models. Hao, X.; Zhou, Z.; Hong, P. (2024) \t \tEnhancing Peak Assignment in CNMR Spectroscopy: A Novel Approach Using Multimodal Alignment. ICML 2024 Workshop AI for Science: Scaling in AI for Scientific Discovery . Hao, X.; Zhou, Z.; Hong, P. (2024) \tGraph Multi-Similarity Learning for Molecular Property Prediction. ICML 2024 Workshop AI for Science: Scaling in AI for Scientific Discovery . Tran, P.N.; Ray, S.; Lemma, L.; Li, Y.; Sweeney, R.; Baskaran, A.; Dogic, Z.; Hong, P.*; Hagana, M.F.* (2024) Deep-learning Optical Flow Outperforms PIV in Obtaining Velocity Fields from Active Nematics. Soft Matter. DOI: 10.1039/D4SM00483C Chen, Z.; Badman, R.P.; Foley, L.; Woods, R.; Hong, P.* (2024) GlycoNMR: Dataset and Benchmark of Carbohydrate-Specific NMR Chemical Shift for Machine Learning Research. Journal of Data-centric Machine Learning Research 2024. Chung, J.; Li, J.; Saimon, A.I.; Hong, P.*; Kong, Z.J.* (2024) Predicting the Stereoselectivity of Chemical Reactions by Composite Machine Learning Method. Scientific Reparts (14):12131. DOI: 10.1038/s41598-024-62158-0 Li, Y.; Zarei, Z.; Tran, P.; Wang, Y.; Baskaran, A.; Fraden, S.; Hagan, M.F.; Hong, P.* (2024) A Machine Learning Approach to Robustly Determine Director Fields and Analyze Defects in Active Nematics. Soft Matter 2024. DOI: 10.1039/D3SM01253K Ni, Y.; Murray, N.B.; Archer-Hartmann, S.; Pepi, L.E.; Helm, R.F.; Azadi, P.; Hong, P.* (2023) Toward Automatic Inference of Glycan Linkages Using MSn and Machine Learning - Proof of Concept Using Sialic Acid Linkages. Journal of the American Society for Mass Spectrometry 2023. DOI: 10.1021/jasms.3c00132s Chen, Z.; Li, P.; Liu, H.; Hong, P.* Characterizing the Influence of Graph Elements. ICLR 2023 Wang, Y.; Chen, S.; Chen, G.; Shurberg, E.; Liu, H.; Hong, P.* Motif-Based Graph Representation Learning with Application to Chemical Molecules. Informatics 2023, 10, 8. DOI: 10.3390/informatics10010008 Yue, H.; Hong, P.; Liu, H. (2022). Graph-Graph Similarity Network. IEEE Transactions on Neural Networks and Learning Systemss. PMID: 36374897. DOI: 10.1109/TNNLS.2022.3218936 Yang, T.; Wang, Y.; Sha, L.; Engelbrecht, J.; and Hong, P.* (2022). Knowledgebra: An Algebraic Learning Framework for Knowledge Graph. Machine Learning and Knowledge Extraction. DOI: 10.3390/make4020019 Tan, W.; Zhang, Q.; Quinones-Frias, M.C.; Hsu, A.Y.; Zhang, Y.; Rodal, A.; Hong, P.; Luo, H.R.; and Xu, B. (2022). Enzyme-Responsive Peptide Thioesters for Targeting Golgi Apparatus. J. Am. Chem. Soc. DOI: 10.1021/jacs.2c02238 Tan, W.; Zhang, Q.; Hong, P.*; Xu, B.* (2022). A Self-Assembling Probe for Imaging the States of Golgi Apparatus in Live Single Cells. Bioconjugate Chemistry. DOI: 10.1021/acs.bioconjchem.2c00084 Chen, Z.; Wei, J.; Tang, Y.; Lin, C.; Costello, C.E.; Hong, P.* (2022). GlycoDeNovo2: An Improved MS/MS-Based De Novo Glycan Topology Reconstruction Algorithm. Journal of the American Society for Mass Spectrometry DOI:10.1021/jasms.1c00288 Wang, Y.; Tang, J.; Vimal, V.P.; Lackner, J.; DiZio, P.; Hong, P.* (2022). Crash Prediction Using Deep Learning in a Disorienting Spaceflight Analog Balancing Task. Front. Physiol. DOI: 10.3389/fphys.2022.806357 Du, H.+; Chen, F.+; Liu, H.; Hong, P. (+ equal contribution) (2021). Network-based Virus-Host Interaction Prediction with Application to SARS-CoV-2. Cell Patterns. DOI: 10.1016/j.patter.2021.100242 Li, P.; Wang, Y.; Zhao, H.; Hong, P.; Liu, H. (2021). On Dyadic Fairness: Exploring and Mitigating Bias in Graph Connections. International Conference on Learning Representations 2021. Teaching (co-teach) COSI 101A Fundamentals of Artificial Intelligence COSI 123A Statistical Machine Learning COSI/ECON 148B Introduction to Machine Learning with Economic Applications COSI 149B Practical Machine Learning with Big Data (with applications in FinTech, Computer Vision, NLP, and Life Sciences) COSI 178A Computational Biology",
  "content_length": 5293,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:01"
}