{
  "name": "Peng Cui 0001",
  "homepage": "http://pengcui.thumedialab.com",
  "status": "success",
  "content": "﻿ Peng Cui (Cui, Peng)'s Homepage Peng CUI Associate Professor (Tenured) Lab of Media and Network Department of Computer Science and TechnologyTsinghua University Address: Room 9-316, East Main Building, Tsinghua University, Beijing 100084, P.R.China Tel: +86-10-6279 0810Fax: +86-10-6277 1138Email: cuip at tsinghua dot edu dot cn [ News | Biography | Research Interests | Publications | Honors Awarded | Professional Experiences] Attention: We have several openings for Postdoctoral Fellowships on causal learning and related topics. News We have kicked off the NICO Challenge, a contest for OOD image recognition. Together with Susan Athey, we published a perspective paper on stable learning in Nature Machine Intelligence. We published a survey paper on out-of-distribution generalization here, accompanied with a website to maintain the paper list for OOD generalization. Biography Peng Cui is an Associate Professor with tenure in Tsinghua University. He got his PhD degree from Tsinghua University in 2010. His research interests include causally-regularized machine learning, network representation learning, and social dynamics modeling. He has published more than 100 papers in prestigious conferences and journals in data mining and multimedia. His recent research won the IEEE Multimedia Best Department Paper Award, SIGKDD 2016 Best Paper Finalist, ICDM 2015 Best Student Paper Award, SIGKDD 2014 Best Paper Finalist, IEEE ICME 2014 Best Paper Award, ACM MM12 Grand Challenge Multimodal Award, and MMM13 Best Paper Award. He is PC co-chair of CIKM2019 and MMM2020, SPC or area chair of ICML, KDD, WWW, IJCAI, AAAI, etc., and Associate Editors of IEEE TKDE, IEEE TBD, ACM TIST, and ACM TOMM etc. He received ACM China Rising Star Award in 2015, and CCF-IEEE CS Young Scientist Award in 2018. He is now a Distinguished Member of ACM and CCF, and a Senior Member of IEEE. Selected Publications Stable Learning and Causal Inference Shaohua Fan, Renzhe Xu, Qian Dong, Yue He, Cheng Chang, Peng Cui. Stable Cox Regression for Survival Analysis under Distribution Shifts. Nature machine intelligence, 2024.(Paper) Jiashuo Liu, Jiayun Wu, Tianyu Wang, Hao Zou, Peng Cui. Geometry-Calibrated DRO: Combating Over-Pessimism with Free Energy Implications. ICML, 2024.(Paper) Jose Blanchet, Peng Cui， Jiajin Li, Jiashuo Liu (α-β order). Stability Evaluation via Distributional Perturbation Analysis. ICML, 2024.(Paper) Yue He, Dongbai Li, Pengfei Tian, Han Yu, Jiashuo Liu, Hao Zou, Peng Cui. Domain-wise Data Acquisition to Improve Performance under Distribution Shift. ICML, 2024.(Paper) Han Yu, Jiashuo Liu, Xingxuan Zhang, Jiayun Wu, Peng Cui. A Survey on Evaluation of Out-of-Distribution Generalization. arxiv, 2024.(Paper) Han Yu, Xingxuan Zhang, Renzhe Xu, Jiashuo Liu, Yue He, Peng Cui. Rethinking the Evaluation Protocol of Domain Generalization. CVPR, 2024.(Paper) Jiashuo Liu, Jiayun Wu, Jie Peng, Xiaoyu Wu, Yang Zheng, Bo Li, Peng Cui. Enhancing Distributional Stability among Sub-populations. AISTATS, 2024.(Paper) Shaohua Fan, Xiao Wang, Chuan Shi, Peng Cui, Bai Wang. Generalizing graph neural networks on out-of-distribution graphs. IEEE TPAMI, 2023.(Paper) Jiashuo Liu, Tianyu Wang, Peng Cui, Hongseok Namkoong. On the Need for a Language Describing Distribution Shifts: Illustrations on Tabular Datasets. NeurIPS, 2023.(Paper) Xingxuan Zhang, Renzhe Xu, Han Yu, Yancheng Dong, Pengfei Tian, Peng Cui. Flatness-Aware Minimization for Domain Generalization. ICCV, 2023.(Paper) Renzhe Xu, Haotian Wang, Xingxuan Zhang, Bo Li, Peng Cui. Competing for Shareable Arms in Multi-Player Multi-Armed Bandits. ICML, 2023.(Paper) Xiaoyu Tan, Yong Lin, Shengyu Zhu, Chao Qu, Xihe Qiu, Yinghui Xu, Peng Cui, Yuan Qi. Provably Invariant Learning without Domain Information. ICML, 2023.(Paper) Haoxuan Li, Yanghao Xiao, Chunyuan Zheng, Peng Cui, Peng Wu. Propensity Matters: Measuring and Enhancing Balancing for Recommendation. ICML, 2023.(Paper) Haoxuan Li, Chunyuan Zheng, Peng Wu, Kun Kuang, Yue Liu, Peng Cui. Who should be Given Incentives? Counterfactual Optimal Treatment Regimes Learning for Recommendation. KDD, 2023.(Paper) Xingxuan Zhang, Yue He, Renzhe Xu, Han Yu, Zheyan Shen, Peng Cui. NICO++: Towards better bechmarks for Out-of-Distribution Generalization. CVPR, 2023.(Paper) Xingxuan Zhang, Renzhe Xu, Han Yu, Hao Zou, Peng Cui. Gradient Norm Aware Minimization Seeks First-Order Flatness and Improves Generalization. CVPR, 2023.(Paper) Hao Zou, Haotian Wang, Renzhe Xu, Bo Li, Jian Pei, Junjian Ye, Peng Cui. Factual Observation Based Heterogeneity Learning for Counterfactual Prediction. CLeaR (Conference on Causal Learning and Reasoning), 2023.(Paper) Jiashuo Liu, Jiayun Wu, Renjie Pi, Renzhe Xu, Xingxuan Zhang, Bo Li, Peng Cui. Measure the Predictive Heterogeneity. ICLR, 2023.(Paper) Jie Peng, Hao Zou, Jiashuo Liu, Shaoming Li, Yibao Jiang, Jian Pei, Peng Cui. Offline Policy Evaluation in Large Action Spaces via Outcome-Oriented Action Grouping. The WebConf, 2023.(Paper) Han Yu, Peng Cui, Yue He, Zheyan Shen, Yong Lin, Renzhe Xu, Xingxuan Zhang. Stable Learning via Sparse Variable Independence. AAAI, 2023.(Paper) Yue He, Xinwei Shen, Renzhe Xu, Tong Zhang, Yong Jiang, Wenchao Zou, Peng Cui. Covariate-Shift Generalization via Random Sample Weighting. AAAI, 2023.(Paper) Jiashuo Liu, Jiayun Wu, Bo Li, Peng Cui. Distributionally Robust Optimization with Data Geometry. NeurIPS, 2022.(Paper) Yong Lin, Shengyu Zhu, Lu Tan, Peng Cui. ZIN: When and How to Learn Invariance by Environment Inference? NeurIPS, 2022. (Paper) Renzhe Xu, Xingxuan Zhang, Bo Li, Yafeng Zhang, Xiaolong Chen, Peng Cui. Product Ranking for Revenue Maximization with Multiple Purchases. NeurIPS, 2022. (Paper) Zimu Wang, Yue He, Jiashuo Liu, Wenchao Zou, Philip Yu, Peng Cui. Invariant Preference Learning for General Debiasing in Recommendation. KDD, 2022. (Paper) Renzhe Xu, Zheyan Shen, Xingxuan Zhang, Tong Zhang, Peng Cui. A Theoretical Analysis on Independence-driven Importance Weighting for Covariate-shift Generalization. ICML, 2022. (Paper) Hao Zou, Bo Li, Jiangang Han, Shuiping Chen, Xuetao Ding, Peng Cui. Counterfactual Prediction for Outcome-oriented Treatments. ICML, 2022. (Paper) Xiao Zhou, Yong Lin, Renjie Pi, Weizhong Zhang, Renzhe Xu, Peng Cui, Tong Zhang. Model Agnostic Sample Reweighting for Out-of-Distribution Learning. ICML, 2022. (Paper) Peng Cui, Susan Athey. Stable Learning Establishes Some Common Ground Between Causal Inference and Machine Learning. Nature Machine Intelligence, 2022. (Paper) Xingxuan Zhang, Linjun Zhou, Renzhe Xu, Peng Cui, Zheyan Shen, Haoxin Liu. Towards Unsupervised Domain Generalization. CVPR, 2022. (Paper) Linjun Zhou, Peng Cui, Xingxuan Zhang, Yinan Jiang, Shiqiang Yang. Adversarial Eigen Attack on Black-Box Models. CVPR, 2022. (Paper) Renzhe Xu, Xingxuan Zhang, Peng Cui, Bo Li, Zheyan Shen, Jiazheng Xu. Regulatory Instruments for Fair Personalized Pricing. The WebConf, 2022. (Paper) Yue He, Zimu Wang, Peng Cui, Hao Zou, Yafeng Zhang, Qiang Cui, Yong Jiang. CausPref: Causal Preference Learning for Out-of-Distribution Recommendation. The WebConf, 2022. (Paper) Renzhe Xu, Peng Cui, Zheyan Shen, Xingxuan Zhang, Tong Zhang. Why Stable Learning Works? A Theory of Covariate Shift Generalization. arXiv, 2021.(Paper) Jiashuo Liu, Zheyuan Hu, Peng Cui, Bo Li, Zheyan Shen. Kernelized Heterogeneous Risk Minimization. NeurIPS, 2021.(Paper) Zheyan Shen, Jiashuo Liu, Yue He, Xingxuan Zhang, Renzhe Xu, Han Yu, Peng Cui. Towards Out-Of-Distribution Generalization: A Survey. arxiv, 2021.(Paper) Yue He, Peng Cui, Zheyan Shen, Renzhe Xu, Furui Liu, Yong Jiang. DARING: Differentiable Causal Discovery with Residual Independence. KDD, 2021.(Paper) Jiashuo Liu, Zheyuan Hu, Peng Cui, Bo Li, Zheyan Shen. Heterogeneous Risk Minimization. ICML, 2021.(Paper) Xingxuan Zhang, Peng Cui, Renzhe Xu, Linjun Zhou, Yue He, Zheyan Shen. Deep Stable Learning for Out-Of-Distribution Generalization. CVPR, 2021.(Paper) Jiashuo Liu, Zheyan Shen, Peng Cui, Linjun Zhou, Kun Kuang, Bo Li, Yishi Lin. Stable Adversarial Learning under Distributional Shifts. AAAI, 2021.(Paper) Hao Zou, Peng Cui, Bo Li, Zheyan Shen, Jianxin Ma, Hongxia Yang, Yue He. Counterfactual Prediction for Bundle Treatments. NeurIPS, 2020.(Paper) Yue He, Zheyan Shen, Peng Cui. Towards Non-I.I.D. Image Classification: A Dataset and Baselines. Pattern Recognition, 2020.(Paper)(Dataset) Zheyan Shen, Peng Cui, Jiashuo Liu, Tong Zhang, Bo Li and Zhitang Chen. Stable Learning via Differentiated Variable Decorrelation. KDD, 2020. (Paper) Yue He, Peng Cui, Jianxin Ma, Hao Zou, Xiaowei Wang, Hongxia Yang and Philip S. Yu. Learning Stable Graphs from Multiple Environments with Selection Bias. KDD, 2020. (Paper) Renzhe Xu, Peng Cui, Kun Kuang, Bo Li, Linjun Zhou, Zheyan Shen and Wei Cui. Algorithmic Decision Making with Conditional Fairness. KDD, 2020. (Paper) Zheyan Shen, Peng Cui, Tong Zhang, Kun Kuang. Stable Learning via Sample Reweighting. AAAI, 2020.(Paper) Kun Kuang, Ruoxuan Xiong, Peng Cui, Susan Athey, Bo Li. Stable Prediction with Model Misspecification and Agnostic Distribution Shift. AAAI, 2020.(Paper) Kun Kuang, Peng Cui, Bo Li, Meng Jiang, Yashen Wang, Fei Wu, Shiqiang Yang. Treatment Effect Estimation via Differentiated Confounder Balancing and Regression. ACM TKDD, 2019.(Paper) Hao Zou, Kun Kuang, Boqi Chen, Peng Cui, Peixuan Chen. Focused Context Balancing for Robust Offline Policy Evaluation. KDD, 2019.(Paper) Kun Kuang, Peng Cui, Susan Athey, Ruoxuan Xiong and Bo Li. Stable Prediction across Unknown Environments. KDD, 2018.(Paper) Zheyan Shen, Peng Cui, Kun Kuang, Bo Li, Peixuan Chen. Causally Regularized Learning with Agnostic Data Selection Bias. ACM Multimedia, 2018. (Paper) Kun Kuang, Peng Cui, Bo Li, Meng Jiang, Shiqiang Yang. Estimating Treatment Effect in the Wild via Differentiated Confounder Balancing. KDD, 2017. (Oral) (Download) Kun Kuang, Peng Cui, Bo Li, Meng Jiang, Fei Wang, Shiqiang Yang. Treatment Effect Estimat",
  "content_length": 30800,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:51"
}