{
  "name": "Penny Rheingans",
  "homepage": "http://www.csee.umbc.edu/~rheingan",
  "status": "success",
  "content": "Dr. Penny Rheingans Dr. Penny Rheingans Professor, Computer Science and Electrical Engineering Department Director, Center for Women in Technology University of Maryland Baltimore County Baltimore, MD 21250 (410) 455-3554 (410) 455-3969 (FAX) Email: rheingan AT cs.umbc.edu Education Ph.D in Computer Science. University of North Carolina, Chapel Hill. Dissertation title: Dynamic Exploration of Multiple Variables in a 2D Space. My research investigated the proposition that dynamic manipulation of color parameters is more powerful than viewing static images for exploring relationships in multivariate data. Experimental findings supported that claim. Advisor: Frederick P. Brooks, Jr. M.S. in Computer Science. University of North Carolina, Chapel Hill. A.B in Computer Science. Harvard University. Research Interests Visualization of spatial and non-spatial data, including the visualization of predictive models, data with associated uncertainty, and data about student success. Visualization based on perception and illustration. Dynamic and interactive representations and interfaces, and the experimental validation of visualization techniques. Computer science pedagogy and gender issues in technology education. Lab: VAnGOGH: Visualization, Animation, Graphical Object Modeling, and Graphics Hardware Laboratory Current externally funded projects: GLOBE: Global Collaboration Engine (bringing global and local together) TUES: Transforming the Freshmen Experience of Computing Majors SSTEM: A Community of Transfer Scholars in Information Technology and Engineering (T-SITE) Teaching Interests Develop and teach courses on data visualization, computer graphics, first year computing, foundations of computer science, and effects of computers on society. Undergraduate Courses: FYS 103a Thinking with Visualization: Spr07 CMSC101/IS101Y Computational Thinking and Design Fall12 CMSC 201 Computer Science I: Fall14, Fall16 CMSC 341 Data Structures: Fall00, Fall07 CMSC 435 Introduction to Computer Graphics: Spr99, Fall99, Spr01, Spr02, Spr03, Fall03, Fall05, Fall08, Fall09, Fall10, Spr12 CMSC 436 Data Visualization: Fall11, Fall13, Fall17 CMSC 491A Artistic Rendering: Fall06 CMSC 491B Visualization Techniques: Fall99 CMSC 491Z Data Visualization: Fall08 Graduate Courses: CMSC 634 Introduction to Computer Graphics: Fall99, Spr01, Spr02, Spr03, Fall03, Fall05, Fall08, Fall09, Fall10, Spr12 CMSC 635 Advanced Computer Graphics: Spr00, Spr01, Spr04 CMSC 636 Data Visualization: Fall02, Fall05, Fall08, Fall11, Fall13, Fall17 CMSC 691A Artistic Rendering: Fall06 CMSC 691 Visualization Techniques: Fall98, Fall99, Fall01 Other Courses: Principles of Visual Perception and its Applications in Computer Graphics, SIGGRAPH '97, '98, '99 Educational Materials: Refraction Revue Selected Publications Matt Fioravante, Adam Shook, Ian Thorpe, and Penny Rheingans (2013), Visualizing Motional Correlations in Molecular Dynamics using Geometric Deformations, Computer Graphics Forum (Eurovis 2013), vol. 32, no. 3, pp. 311-320. David Trimm, Marie desJardins, and Penny Rheingans (2012), Visualizing Student Histories Using Clustering and Composition, IEEE Transactions on Visualization and Computer Graphics, vol. 18, no. 12, pp. 2809-2818. Jesus Caban, Penny Rheingans, and Terry Yoo (2011), An Evaluation of Visualization Techniques to Illustrate Statistical Deformation Models, Computer Graphics Forum (Eurovis 2011), vol. 30, no. 3, pp. 821-830. Penny Rheingans, Anne Brodsky, Jill Scheibler, and Anne Spence (2011). The Role of Majority Groups in Diversity Programs, ACM Transactions on Computing Education. vol. 11, no. 2, July 2011. Alark Joshi, Jesus Caban, Penny Rheingans, and Lynn Sparling (2009). Case Study on Visualizing Hurricanes Using Illustration-Inspired Techniques, IEEE Transactions on Visualization and Computer Graphics, vol. 15, no 5, pp. 709-718. Jesus Caban and Penny Rheingans(2008), Texture-based Transfer Functions for Direct Volume Rendering, IEEE Transactions on Visualization and Computer Graphics, vol. 14, no. 6, pp. 1364-1371. Alark Joshi and Penny Rheingans (2008), Evaluation of illustration-inspired techniques for time-varying data visualization, Computer Graphics Forum, vol. 27, no. 3, pp. 999-1006. Jonathan Bronson, Penny Rheingans, and Marc Olano (2008), Semi-Automatic Stencil Creation through Error Minimization, Non-photorealistic Animation and Rendering Symposium (NPAR 2008), pp. 31-37. John Kloetzli, Marc Olano, and Penny Rheingans (2008), Interactive Volume Isosurface Rendering using BT Volumes, ACM Symposium on Interactive 3D Graphics (I3D) 2008, p. 45-52. Marie desJardins, Blazej Bulka, Ryan Carr, Eric Jordan, Priyang Rathod, and Penny Rheingans (2007), Heuristic search and information visualization methods for school redistricting AI Magazine, vol. 28, no. 3, pp. 59-72. Jason Pearlman and Penny Rheingans (2007), Visualizing network security events using compound glyphs from a service-oriented perspective, in Visualization for Computer Security 07, John Goodall, Gregory Conti, and Kwan-liu Ma, eds., Springer-Verlag Inc. , pp. 131-146. Jesus Caban, Alark Joshi, and Penny Rheingans (2007), Texture-based feature tracking for effective time-varying data visualization, IEEE Transactions on Visualization and Computer Graphics, vol. 13, no. 6, pp. 1472-1479. Jason Pearlman, Penny Rheingans, and Marie desJardins (2007), Visualizing Diversity and Depth over a Set of Objects, IEEE Computer Graphics and Applications, vol. 27, no. 5, pp. 35-45. Dana Wortman and Penny Rheingans (2007), Visualizing trends in student performance across computer science courses, SIGCSE Bulletin vol. 39, no. 1, pp. 430-434. Robert Moorhead, Chris Johnson, Tamara Munzner, Hanspeter Pfister, Penny Rheingans, and Terry S. Yoo (2006). Visualization Research Challenges: A Report Summary, Computing in Science and Engineering, vol. 8, no. 4, pp. 66-73, July/August 2006. Tamara Munzner, Chris Johnson, Hanspeter Pfister, Robert Moorhead, Penny Rheingans, and Terry Yoo (2006). NIH-NSF Visualization Research Challenges Report Summary, IEEE Computer Graphics and Applications, vol. 26, no. 2, pp. 20-25, March/April 2006. Invited paper. John R. Goodall, Wayne G. Lutters, Penny Rheingans and Anita Komlodi (2006), Focusing on Context in Network Traffic Analysis, IEEE Computer Graphics and Applications, vol. 26, no. 2, pp. 72-80, March/April 2006. Chris Johnson, Hanspeter Pfister, Tamara Munzner, Robert Moorhead, Penny Rheingans, Terry Yoo (2006). NIH-NSF Visualization Research Challenges Report . IEEE Press, ISBN 0-7695-2733-7, 2006. Marie desJardins, Blazej Bulka, Ryan Carr, Andrew Hunt, Priyang Rathod, and Penny Rheingans (2006), Heuristic search and information visualization methods for school redistricting. In Proceedings of the Eighteenth Annual Conference on Innovative Applications of Artificial Intelligence (IAAI-06), AAAI Press, 2006. Alark Joshi and Penny Rheingans (2005), Illustration-inspired techniques for visualizing time-varying data, Proceedings of IEEE Visualization 2005, pp. 679-686. Poonam Shanbhag, Penny Rheingans, and Marie desJardins (2005). Temporal Visualization of Planning Polygons for Efficient Partitioning of Geo-Spatial Data, Proceedings of IEEE Information Visualization 2005, pp. 211-218. Eleanor Chlan and Penny Rheingans (2005). Multivariate Glyphs for Multi-Object Clusters. Proceedings of IEEE Information Visualization 2005, pp. 141-148. Srinivas Bhagavatula, Penny Rheingans, and Marie desJardins (2005). Discovering High-level Parameters for Visualization Design, Proceedings of Joint EUROGRAPHICS - IEEE TCVG Symposium on Visualization, pp. 255-262. Gevorg Grigoryan and Penny Rheingans (2004). Point-based Probabilistic Surfaces to Show Surface Uncertainty, IEEE Transactions on Visualization and Computer Graphics, no. 10, vol. 5, 2004, pp. 564-573. Eleanor Chlan and Penny Rheingans (2004). A Botanically Inspired High-Dimensional Visualization with Multivariate Glyphs, Proceedings of Joint EUROGRAPHICS - IEEE TCVG Symposium on Visualization. Aidong Lu, Christopher Morris, Joe Taylor, David Ebert, Charles Hansen, Penny Rheingans, and Mark Hartner (2003). Illustrative Interactive Stipple Rendering, IEEE Transactions on Visualization and Computer Graphics, vol.9, no. 2, pp. 127-138, April-June 2003. David Ebert, Christopher Morris, Penny Rheingans, and Terry Yoo (2002). Designing Effective Transfer Functions for Volume Rendering from Photographic Volumes, IEEE Transactions on Visualization and Computer Graphics, vol. 7, pp. 183-197. Penny Rheingans (2002). Are We There Yet?: Exploring with Dynamic Visualization, IEEE Computer Graphics and Applications, vol. 22, no. 1, January/February 2002, pp. 6-10. Gevorg Grigoryan and Penny Rheingans (2002). Probabalistic Surfaces: Point Based Primitives to Show Surface Uncertainty, Proceedings of IEEE Visualizaton 2002 , pp. 147-154. Aidong Lu, Christopher Morris, David Ebert, Penny Rheingans, and Charles Hansen (2002). Non-photorealistic Volume Rendering Using Stippling Techniques, Proceedings of IEEE Visualizaton 2002 , pp. 211-218. Brad Lowekamp, Penny Rheingans, and Terry S. Yoo (2002). Exploring Surface Characteristics with Interactive Gaussian Images (A Case Study), Proceedings of IEEE Visualizaton 2002 , pp. 553-556 Penny Rheingans and David Ebert (2001). Volume Illustration: Non-Photorealistic Rendering of Volume Models. IEEE Transactions on Visualization and Computer Graphics, vol 7, no 3, pp. 253-264. Bryan Morse, Terry S. Yoo, Penny Rheingans, David T. Chen, and K.R. Subramanian (2001). Interpolating Implicit Surfaces from Scattered Surface Data Using Compactly Supported Radial Basis Functions. Proceedings of International Conference on Shape Modeling and Applications '01, IEEE Computer Society Press, May 2001, pp. 89-98. David Ebert and Penny Rheingans (2000). Volume Illustration: Non-Photorealistic Rendering of Volume Models. Proceedings of IEEE Visualization '00, pp. 195-200. Penny Rheingans and Marie desJardi",
  "content_length": 11828,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:02"
}