{
  "name": "Penny Sweetser",
  "homepage": "https://cs.anu.edu.au/people/penny-kyburz",
  "status": "success",
  "content": "Penny Kyburz | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Interests Video Games, Human Centred Computing, Artificial Intelligence, Machine Learning, Human-Computer Interaction, Human-AI Interaction Research I use video games to understand humans, machines, and the world around us. My research interests lie in understanding and enhancing human and machine intelligence, interaction, and performance. I use games and virtual environments to develop, simulate, and test models for AI, machine learning, human-AI teaming, and human-computer interaction. You can find my research papers via Google Scholar. Biography I lead the ANU Games Research Group and teach Game Development. I am a researcher in the areas of AI, player experience, and human-AI interaction in games and mixed reality and an experienced game developer. I developed the GameFlow model, which is a widely cited model of enjoyment in video games, and authored a book on Emergence in Games. I have contributed to 20 digital games, which have garnered many awards, including four prestigious BAFTA nominations. I have devised usability methods and lead usability testing on AAA games, resulting in very high critic scores. I have also worked in the Senate as a policy adviser in digital rights, communications, and disability. I am an advocate for diversity and inclusion in technology and games. Activities & Awards I have been a lead developer of 20 published digital games played by over 10 million people, which have attracted critical acclaim (e.g., review scores 88/100), prestigious awards (e.g., 4 BAFTA nominations), extensive media coverage, and generated at least $250M in revenue. I have led the design and usability on four AAA game titles for major publishers (Sega, 2K), as well as co-running my own independent games development company, all of which produced award-winning games. bars search times",
  "content_length": 2014,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:01"
}