{
  "name": "Pepa Atanasova",
  "homepage": "https://apepa.github.io",
  "status": "success",
  "content": "Pepa Atanasova :: Home Pepa Atanasova Assistant Professor CopeNLU group Department of Computer Science 📄 Download CV I am an Assistant Professor (Tenure Track) in the Department of Computer Science, NLP Section at the University of Copenhagen. I am currenly employed at the University of Copenhagen with special teaching duties dedicated to courses for industry practitioners. I am also co-leading the CopeNLU group with Isabelle Augenstein. I completed my PhD at the University of Copenhagen under the supervision of Isabelle Augenstein, Jakob Grue Simonsen, and Christina Lioma. My PhD was funded by a Marie Skłodowska-Curie Fellowship and the PhD Thesis titled \"Accountable and Explainable Methods for Complex Reasoning over Text\" was awarded two best PhD Thesis Awards by ELLIS and Informatics Europe. I also gained industrial experience during my PhD with two internships at Meta and Google. Furthermore, I conducted an interdisciplinary Postdoctoral fellowship at the University of Copenhagen with Isabelle Augenstein and Christian Borch, where we employed LM explanations to simulate trading behaviors. For more details and a list of recent publications, see Publications. I am looking for a PhD student on Trustworthy NLP with a start date in March 2026! The successful candidate will co-supervised by Prof. Isabelle Augenstein and will join our CopeNLU group. For more details see the APPLICATION LINK. See reasons to apply here. Research Highlights Interpretability of Language Models Understanding mechanisms of LLMs with some applications to context usage and parametric knowledge. Explainability Methods Designing robust and user-aligned explainability techniques that enhance the understanding of complex models. Factuality in LMs Addressing the challenge of maintaining factual accuracy in language models. Opportunities & Supervision There are opportunities to apply to Danish funding agencies for PhD and Postdoc positions within the group, as well as for visiting researchers. For more information, please see Contact. I supervise Master's and Bachelor's students from the University of Copenhagen. For more details, please see Contact. Awards & Recognition 🏆 ELLIS Best PhD Thesis Award 2023 - One of two recipients for the thesis \"Accountable and Explainable Methods for Complex Reasoning over Text\" 🏆 Informatics Europe Best Dissertation Award 2023 - Awarded for outstanding PhD dissertation with opportunity to publish in Springer series Recent News 2025 August 2025 Together with Sneha Das and Rune Nyrup, we received a grant from the Pioneer Center for AI in Denmark to organise workshops on the topics of Trustworthy AI! Stay tuned for more information! August 2025 Two papers accepted at EMNLP, 2025, Main on improving the faithfulness of natural language explanations: \"Self-Critique and Refinement for Faithful Natural Language Explanations\", \"Graph-Guided Textual Explanation Generation Framework\". July 2025 I am co-organizing a pre-ACL workshop in Copenhagen in July 2025! May 2025 New preprint: Self-Critique and Refinement for Faithful Natural Language Explanations March 2025 Our paper A Reality Check on Context Utilisation for Retrieval-Augmented Generation was accepted to ACL 2025! January 2025 Our paper Evaluating input feature explanations through a unified diagnostic evaluation framework was accepted at NAACL 2025! January 2025 New preprint on improving explanation faithfulness: Graph-Guided Textual Explanation Generation Framework. 2024 November 2024 I gave a talk for the Sheffield NLP Group (Slides) October 2024 Our paper \"DYNAMICQA: Tracing Internal Knowledge Conflicts in Language Models\" was accepted at Findings of EMNLP 2024! September 2024 I gave an invited talk on \"Facts Unveiled: Navigating Factuality in the Era of Generative Models\" at Romanian AI days 2024! September 2024 I gave an opening keynote on \"Facts Unveiled: Navigating Factuality in the Era of Generative Models\" at iGeLU 2024! September 2024 I am excited to start on a new position as a Tenure-track Assistant Professor at the University of Copenhagen, Department of Computer Science. See the news piece here! May 2024 Our paper \"Revealing the Parametric Knowledge of Language Models: A Unified Framework for Attribution Methods\" was accepted to ACL'2024! January 2024 I gave an oral talk titled \"Exploring the Explainability Landscape: Testing and Enhancing Explainability Techniques.\" at Chalmers University.",
  "content_length": 4434,
  "method": "requests",
  "crawl_time": "2025-12-01 14:10:59"
}