{
  "name": "Per Wahlund",
  "homepage": "https://katalog.uu.se/empinfo/?id=XX2255",
  "status": "success",
  "content": "Per Wahlund - Uppsala universitet Per Wahlund Universitetslektor vid Institutionen för informationsteknologi; Beräkningsvetenskap E-post: Per.Wahlund@it.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Per Wahlund vid Institutionen för informationsteknologi; Beräkningsvetenskap Akademiska meriter: FDCV: Ladda ned CV Publikationer Senaste publikationer High-order difference methods for waves in discontinuous media Wahlund, Per; Gustafsson, Bertil Ingår i Journal of Computational and Applied Mathematics, s. 142-147, 2006 DOI för High-order difference methods for waves in discontinuous media A new type of boundary treatment for wave propagation Tornberg, Anna-Karin; Engquist, Björn; Gustafsson, Bertil; Wahlund, Per Ingår i BIT Numerical Mathematics, 2006 DOI för A new type of boundary treatment for wave propagation Time compact high order difference methods for wave propagation, 2D Gustafsson, Bertil; Wahlund, Per Ingår i Journal of Scientific Computing, s. 195-211, 2005 DOI för Time compact high order difference methods for wave propagation, 2D Time Compact Difference Methods for Wave Propagation in Discontinuous Media Gustafsson, Bertil; Wahlund, Per Ingår i SIAM Journal on Scientific Computing, s. 272-293, 2004 DOI för Time Compact Difference Methods for Wave Propagation in Discontinuous Media Time Compact Difference Methods for Wave Propagation in Discontinuous Media Gustafsson, Bertil; Wahlund, Per 2003 Ladda ner fulltext (ps) av Time Compact Difference Methods for Wave Propagation in Discontinuous Media Alla publikationer Artiklar i tidskrift High-order difference methods for waves in discontinuous media Wahlund, Per; Gustafsson, Bertil Ingår i Journal of Computational and Applied Mathematics, s. 142-147, 2006 DOI för High-order difference methods for waves in discontinuous media A new type of boundary treatment for wave propagation Tornberg, Anna-Karin; Engquist, Björn; Gustafsson, Bertil; Wahlund, Per Ingår i BIT Numerical Mathematics, 2006 DOI för A new type of boundary treatment for wave propagation Time compact high order difference methods for wave propagation, 2D Gustafsson, Bertil; Wahlund, Per Ingår i Journal of Scientific Computing, s. 195-211, 2005 DOI för Time compact high order difference methods for wave propagation, 2D Time Compact Difference Methods for Wave Propagation in Discontinuous Media Gustafsson, Bertil; Wahlund, Per Ingår i SIAM Journal on Scientific Computing, s. 272-293, 2004 DOI för Time Compact Difference Methods for Wave Propagation in Discontinuous Media Computation of the maximum flow rate of a perfect gas through a slit in a plane wall Wahlund, Per Ingår i Computers & Fluids, s. 253-265, 1986 DOI för Computation of the maximum flow rate of a perfect gas through a slit in a plane wall Finite-difference methods for computing the steady flow about blunt bodies Gustafsson, Bertil; Wahlund, Per Ingår i Journal of Computational Physics, s. 327-346, 1980 DOI för Finite-difference methods for computing the steady flow about blunt bodies Rapporter Time Compact Difference Methods for Wave Propagation in Discontinuous Media Gustafsson, Bertil; Wahlund, Per 2003 Ladda ner fulltext (ps) av Time Compact Difference Methods for Wave Propagation in Discontinuous Media",
  "content_length": 3305,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:05"
}