{
  "name": "Per Kristian Lehre",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/lehre-kristian-per.aspx",
  "status": "success",
  "content": "Professor Per Kristian Lehre - School of Computer Science - University of Birmingham Professor Per Kristian Lehre School of Computer ScienceProfessor of Evolutionary Computation Contact details Emailp.k.lehre@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Professor Per Kristian Lehre is a professor of evolutionary computation in the School of Computer Science at the University of Birmingham. For more information, please see Professor Per Kristian's homepage. Nature Inspired Search and Optimisation (Spring 2020, co-taught with Shan He) Neural Computation (Autumn 2019, co-taught with Jinming Duan) Recent publications Article Hevia Fajardo, MA & Lehre, PK 2025, 'How Fitness Aggregation Methods Affect the Performance of Competitive CoEAs on Bilinear Problems', Algorithmica, vol. 87, no. 9, pp. 1274-1310. https://doi.org/10.1007/s00453-025-01313-z Lehre, PK & Sutton, A 2025, 'Runtime Analysis with Variable Cost', Algorithmica. https://doi.org/10.1007/s00453-025-01307-x Dang, D-C & Lehre, PK 2025, 'The SLO Hierarchy of pseudo-Boolean Functions and Runtime of Evolutionary Algorithms', Algorithmica. Chapter Hevia Fajardo, M, Lehre, PK, Toutouh, J, Hemberg, E & O'Reilly, U-M 2024, Analysis of a Pairwise Dominance Coevolutionary Algorithm with Spatial Topology. in S Winkler, L Trujillo, C Ofria & T Hu (eds), Genetic Programming Theory and Practice XX. 1 edn, Genetic and Evolutionary Computation, Springer Singapore, pp. 19-44. https://doi.org/10.1007/978-981-99-8413-8_2 Conference contribution Benford, A & Lehre, PK 2025, A General Upper Bound for the Runtime of a Coevolutionary Algorithm on Impartial Combinatorial Games. in GECCO '25: Proceedings of the Genetic and Evolutionary Computation Conference. GECCO: Genetic and Evolutionary Computation Conference, Association for Computing Machinery (ACM), The Genetic and Evolutionary Computation Conference (GECCO) 2025, Málaga, Spain, 14/07/25. Lehre, PK & Lin, S 2025, Hot off the Press: No Free Lunch Theorem and Black-Box Complexity Analysis for Adversarial Optimisation. in G Ochoa (ed.), GECCO '25 Companion: Proceedings of the Genetic and Evolutionary Computation Conference Companion. Genetic and Evolutionary Computation Conference, Association for Computing Machinery (ACM), pp. 37-38, The Genetic and Evolutionary Computation Conference 2025, Málaga, Spain, 14/07/25. https://doi.org/10.1145/3712255.3734247 Benford, A & Lehre, PK 2025, Theoretical Guarantees for the Retention of Strict Nash Equilibria by Coevolutionary Algorithms. in Advances in Neural Information Processing Systems 38 (NeurIPS 2025). Advances in Neural Information Processing Systems, vol. 39, NeurIPS, The Thirty-Ninth Annual Conference on Neural Information Processing Systems, San Diego, California, United States, 2/12/25. Lehre, PK & Lin, S 2025, Towards Runtime Analysis of Population-Based Co-evolutionary Algorithms on Sparse Binary Zero-Sum Games. in Proceedings of the 39th Annual AAAI Conference on Artificial Intelligence. Proceedings of the AAAI Conference on Artificial Intelligence, no. 25, vol. 39, AAAI Press, pp. 27054-27062, The 39th Annual AAAI Conference on Artificial Intelligence, Philadelphia, Pennsylvania, United States, 27/02/25. https://doi.org/10.1609/aaai.v39i25.34912 Benford, A & Lehre, PK 2025, Why Playing Against Diverse and Challenging Opponents Speeds Up Coevolution: A Theoretical Analysis on Combinatorial Games. in Advances in Neural Information Processing Systems 39 (NeurIPS 2025). Advances in Neural Information Processing Systems, vol. 39, NeurIPS, The Thirty-Ninth Annual Conference on Neural Information Processing Systems, San Diego, California, United States, 2/12/25. Fajardo, MAH, Hemberg, E, Toutouh, J, O'Reilly, U-M & Lehre, PK 2024, A Self-adaptive Coevolutionary Algorithm. in GECCO '24: Proceedings of the Genetic and Evolutionary Computation Conference. Association for Computing Machinery (ACM), pp. 841 - 849, GECCO '24: Genetic and Evolutionary Computation Conference, Melbourne, Victoria, Australia, 14/07/24. https://doi.org/10.1145/3638529.3654132 Benford, A, Olhofer, M, Rodemann, T & Lehre, PK 2024, Bicriteria optimisation of average and worst-case performance using coevolutionary algorithms. in 2024 IEEE Congress on Evolutionary Computation (CEC). Congress on Evolutionary Computation, IEEE, IEEE Congress on Evolutionary Computation (IEEE CEC) 2024, Yokohama, Japan, 30/06/24. Lehre, PK & Lin, S 2024, Concentration Tail-Bound Analysis of Coevolutionary and Bandit Learning Algorithms. in Proceedings of the 33rd International Joint Conference on Artificial Intelligence. Proceedings of the International Joint Conference on Artificial Intelligence, International Joint Conferences on Artificial Intelligence Organization (IJCAI), 33rd International Joint Conference on Artificial Intelligence, Jeju, Korea, Republic of, 3/08/24. Lehre, PK & Lin, S 2024, No Free Lunch Theorem and Black-Box Complexity Analysis for Adversarial Optimisation. in Advances in Neural Information Processing Systems 37 (NeurIPS 2024). Advances in neural information processing systems, vol. 37, NeurIPS, Thirty-Eighth Annual Conference on Neural Information Processing Systems, Vancouver, British Columbia, Canada, 10/12/24. <https://proceedings.neurips.cc/paper_files/paper/2024/hash/dc3a0fd5ef0f78ee5934919230d6664f-Abstract-Conference.html> Lehre, PK & Lin, S 2024, Overcoming Binary Adversarial Optimisation with Competitive Coevolution. in M Affenzeller, SM Winkler, AV Kononova, H Trautmann, T Tušar, P Machado & T Bäck (eds), Parallel Problem Solving from Nature – PPSN XVIII: 18th International Conference, PPSN 2024, Hagenberg, Austria, September 14–18, 2024, Proceedings, Part III. 1 edn, Lecture Notes in Computer Science, vol. 15150, Springer, Cham, pp. 117–132, 18th International Conference on Parallel Problem Solving From Nature PPSN 2024, Hagenberg, Austria, 14/09/24. https://doi.org/10.1007/978-3-031-70071-2_8 Hevia Fajardo, M & Lehre, PK 2024, Ranking Diversity Benefits Coevolutionary Algorithms on an Intransitive Game. in M Affenzeller, SM Winkler, AV Kononova, H Trautmann, T Tušar, P Machado & T Bäck (eds), Parallel Problem Solving from Nature – PPSN XVIII: 18th International Conference, PPSN 2024, Hagenberg, Austria, September 14–18, 2024, Proceedings, Part III. vol. 3, Lecture Notes in Computer Science, vol. 15150, Springer, 18th International Conference on Parallel Problem Solving From Nature PPSN 2024, Hagenberg, Austria, 14/09/24. https://doi.org/10.1007/978-3-031-70071-2_14 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 6752,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:03"
}