{
  "name": "Peter Minary",
  "homepage": "https://www.cs.ox.ac.uk/people/peter.minary",
  "status": "success",
  "content": "Peter Minary | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyPeter MinaryPeter Minary Professor Peter Minary Associate Professor of Computer ScienceWolfson Building, Parks Road, Oxford OX1 3QD Themes:Computational Biology and Health InformaticsInterestsMotivated by grand challenges in structural and molecular biology, our research combines applied statistics and scientific computing to perform applications that could not have been accomplished years ago.  Our work on algorithmic development is equally driven by our research interest in nanoscale design, experimental refinement, molecular genetics and related collaborations with both computational and experimental laboratories. One major area of our methodology development is inspired by the challenges in exploring the conformational space of large biological macromolecules.  Besides the development of basic optimization and sampling algorithms, we introduced a linear complexity chain closure algorithm, which enabled the use of arbitrary user defined degrees of freedom in a protocol called (Hierarchical) Natural Move Monte Carlo or (H)NM-MC.  All these and other relevant algorithms have been implemented into our software package, MOSAICS, http://www.cs.ox.ac.uk/mosaics. The potential impact of these new methods has been demonstrated by notable works such as a comprehensive investigation of the protein fold universe, aiding the design of RNA nanostructures and fitting molecular structures against their Cryo-electron microscopy images.  As such, our objectives include both the mechanistic study of structural phenomena using purely computational investigations and the better interpretation of experimental results. Representative publications on completed application projects and related algorithmic developments can be found here: http://www.cs.ox.ac.uk/mosaics/publications Our research interest continues to be driven by application oriented method and software development in computational structural biology.   Most notably, we are interested in 1) Functional motion of nanomachines using modelling and Cryo-EM fitting 2) Structural Immunoinformatics; antibody–antigen, MHC–protein binding 3) Modelling and designing large DNA structures like the nucleosome particle 4) Modelling RNA junctions, nanostructures and RNA–protein interactionsSelected PublicationsView AllManage publications Exploring peptide/MHC detachment processes using hierarchical natural move Monte Carlo Bernhard Knapp‚ Samuel Demharter‚ Charlotte M Deane and Peter Minary In Bioinformatics. Pages btv502. 2015. Details about Exploring peptide/MHC detachment processes using hierarchical natural move Monte Carlo | BibTeX data for Exploring peptide/MHC detachment processes using hierarchical natural move Monte Carlo Training−free atomistic prediction of nucleosome occupancy Peter Minary and Michael Levitt In Proceedings of the National Academy of Sciences. Vol. 111. No. 17. Pages 6293–6298. 2014. Details about Training−free atomistic prediction of nucleosome occupancy | BibTeX data for Training−free atomistic prediction of nucleosome occupancy Modeling and design by hierarchical natural moves Adelene YL Sim‚ Michael Levitt and Peter Minary In Proceedings of the National Academy of Sciences. Vol. 109. No. 8. Pages 2890–2895. 2012. Details about Modeling and design by hierarchical natural moves | BibTeX data for Modeling and design by hierarchical natural moves Team Xinzhe CaoDoctoral StudentShruti  ChakrabortyDoctoral StudentLyle HopkinsDoctoral StudentSami  LabbakiDoctoral StudentPeiheng LuDoctoral StudentJeffrey MakDepartmental Lecturer, Doctoral StudentYongyao MoDoctoral StudentFurkan OzdenDoctoral StudentLucas  SchneiderDoctoral Student Past Students Samuel DemharterFlorian StörtzAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 4055,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:37"
}