{
  "name": "Peter Ochs",
  "homepage": "https://www.mop.uni-saarland.de/people/ochs/index.shtml",
  "status": "success",
  "content": "Mathematical Optimization for Data Science Group, Saarland University Welcome to the homepage of the Mathematical Optimization for Data Science Group Department of Mathematics and Computer Science, Saarland University, Germany Home Teaching Research Publications Job Offers Saarland University Mathematics and Computer Science Prof. Dr. Peter Ochs Professor for Mathematics and Computer Science Mathematical Optimization for Data Science Group Faculty of the International Max Planck Research School (IMPRS) Office Hour: Contact by eMail Address: Department of Mathematics and Computer Science Saarland University Campus E1.1, room 4.06 66123 Saarbrücken, Germany eMail: Personal Publications Talks Curriculum Vitae Google Scholar Profile Research Interest: Non-smooth optimization and analysis (convex and non-convex) Optimization algorithms Bilevel optimization Image Processing, Computer Vision, and Machine Learning applications See also our research webpage. Brief Bio: Peter Ochs received the M.Sc. degree in mathematics from the Saarland University in Germany in 2010, and the Ph.D. degree in mathematics from the University of Freiburg in 2015. During his Ph.D., he spent three months as a visiting researcher at TU-Graz in Austria. After a year as a postdoctoral researcher at Saarland University in Germany, he returned to Freiburg. In November 2017, he became Juniorprofessor of Applied Mathematics at the Saarland University and, in September 2020, Tenure-Track Professor at the University of Tübingen with final evaluation successfully completed in 2020. Since March 2023, he is full Professor for Mathematics and Computer Science at Saarland University, where he is heading the Mathematical Optimization for Data Science group. He received the best paper award at the Scale Space and Variational Methods Conference (SSVM) in 2015 and at the German Conference on Pattern Recognition (GCPR) in 2016. His research interests are in non-smooth optimization with applications in computer vision, machine learning, image analysis, and data science in general. Impressum Datenschutz MOP Group ©2017-2025 The author is not responsible for the content of external pages.",
  "content_length": 2174,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:39"
}