{
  "name": "Peter Hastings",
  "homepage": "http://reed.cs.depaul.edu/peterh",
  "status": "success",
  "content": "Peter Hastings | Home ☰ Peter Hastings Teaching Research Publications Tools Personal Contact Regular mail: DePaul University Computing and Digital Media, 243 S. Wabash Ave. Chicago IL 60604 USA CDM 717 âpeterhâ at cdm.depaul.edu (312) 362-5736 (312) 362-6116 Biography I have been at DePaul University since 2001 in what is now called the School of Computing. Before that, I was a Temporary Lecturer in the School of Informatics at the University of Edinburgh. Previously, I worked as a post-doctoral research assistant at the University of Memphis in the Institute for Intelligent Systems and as a postdoc in the Soar group at the University of Michigan. I received my Ph.D. at the University of Michigan in Computer Science, specifically in Artificial Intelligence and Natural Language Processing. My masters degree was from the Johns Hopkins University and my bachelors degree was from Michigan State University, both in Computer Science. My research interests include Natural Language Processing, Machine Learning, Cognitive Science, Neuroscience, Intelligent Tutoring Systems, and Artificial Intelligence. For more information, see my curriculum vitae. Recent activities In fall 2023, developed a Wordle-inspired game for teaching Intro Psych concepts, with Britt and Noel from NIU. Extending it in Winter 2024 with Warren. My student, Keith Cochran and I presented paper, \"Improving Automated Evaluation of Student Text Responses using GPT-3.5 for Text Data Augmentation,\" at Artificial Intelligence in Education, 2023 in Tokyo. It was nominated for the Best Paper Award. My student, Daneih and I presented the poster, \"Emotionally Adaptive Intelligent Tutoring System to Reduce Foreign Language Anxiety,\" at Artificial Intelligence in Education, 2023 in Tokyo. It was nominated for the Best Poster Award. Published the article, \"Using BERT to Identify Causal Structure in Students' Explanatory Explanations\" in the International Journal for Artificial Intelligence in Education Published article, \"Improving Automated Evaluation of Formative Assessments with Text Data Augmentation,\" Cochran, Cohn, Hutchins, Biswas, and Hastings, in AIED 2022, at University of Durham, England. Gave invited talk at AI and Adaptive Education Conference in Beijing, May 2019. Awarded CDM summer faculty research grant for FakeNews game. Sabbatical, Fall 2018, Winter 2019! Working on computational neuroscience modeling (with Rachelle Jacobs), deep learning for tracking animal movements (with Doug Wallace, NIU), intelligent tutoring for source evaluation with Jean-François Rouet (U. Poitiers, France) and M.A.Britt (NIU). Published chapter: \"Computational analysis of explanatory essay structure\" in Multi-Disciplinary Approaches to Deep Learning Published chapter: \"Computer-based assessment of essays based on multiple documents\" in Handbook of Multiple Source Use Presented paper: \"Active Learning for Improving Machine Learning of Student Explanatory Essays\" at AIED 2018 in London. Attended the NSF-sponsored workshop: Experiments and Models for Teaching Undergraduate Neuroscience at the University of Missouri in July, 2017. Developed and taught Computational Neuroscience class, Winter 2018. Helped develop the new Bachelors degree in Neuroscience at DePaul. Gave an invited talk on \"Identifying causal structure in student essays\" at Valtech, and at the DePaul CDM Research Colloquium. At the Intelligent Tutoring Systems conference in Zagreb, Croatia, presented the paper, \"Stratified learning for reducing training set size\", exploring one way to improve a machine learning approach to identifying structure in student causal essays. Received a DePaul Quality of Instruction Council Collaborative Instruction grant to develop the Introduction to Computational Neuroscience course along with Eric Norstrom from Biology, and Sandra Virtue from Psychology. Taught Foundations of HCI and Learner-Centered Design in Spring 2016. Served as a Senior Program Committee for Intelligent Tutoring Systems 2016. Invitee to the 2015 Neuromorphic Natural Language Processing workshop in Telluride. Made with bib2html with extensions from MMoll.",
  "content_length": 4138,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:24"
}