{
  "name": "Peter Brusilovsky",
  "homepage": "http://www.pitt.edu/~peterb",
  "status": "success",
  "content": "Peter Brusilovsky - Research Page Peter Brusilovsky: Research Professor School of Computing and Information University of Pittsburgh Other affiliations: Human-Computer Interaction Institute @ Carnegie Mellon University Research | Teaching | Publications | Edited Work Research interests | Research Activities | Professional Service | Vitae Research Interests Adaptive Web-based Systems Personalized E-Learning Adaptive Hypermedia Social Computing and Social Web Intelligent Tutoring Systems and Shells Student and User Modelling Adaptive Interfaces Research Activities PAWS: Personalized and Adaptive Web Systems Lab Personalized and Adaptive Web Systems Lab explores various kinds of user-adaptive Web systems. New PAWS Lab Wiki Old PAWS Lab Home Page LTL: Learning Technologies Lab (was: Teaching and Learning Research Lab, TaLeR) The Learning Technologies Lab (LTL) is an interdisciplinary research and development laboratory that fosters innovative research in the area of learning technologies and transformational / serious games. Learning Technologies Lab Home Page Old TaLeR Lab Home Page Current and past NSF grants Professional Service The following links may be of interest for you if your research interests are close to mine. Do not hesitate to contact me if you are interested to submit a paper to one of the conferences and journals listed below. I usually update this list once a year. Conferences and Workshops I am serving as as a senior program committe member for the following conferences that I highly recommend: 30th ACM Annual Conference on Intelligent User Interfaces, IUI 2025 (Italy) 33rd International Conference on User Modeling, Adaptation, and Personalization, UMAP 2025 (USA) 19th ACM Conference on Recommender Systems, RecSys 2025 (Czech Republic) Journals I am an editorial, consulting, or reviewing board member of the following journals that I also recommend: User Modeling and User-Adapted Interaction (UMUAI) ACM Transactions on Social Computing ACM Transactions on Interactive Intelligent Systems International Journal of Artificial Intelligence in Education (IJAIED) The New Review of Hypermedia and Multimedia I served for 6 years as the Editor-in-Chief for the IEEE Transactions on Learning Technologies. If you work in the area of E-Learning technologies, consider to submit to this journal! Professional Societies I am the past Chair of ACM SIGWEB, a Special Interest Group of the ACM Association for Computing Machinery. I am also the past President of User Modeling Inc., a professional organization of User Modeling researchers, the organizer of UMAP conference series I am a member of the following professional organizations: Senior Member of ACM and member of ACM SIGs SIGWEB, SIGCSE, SIGCHI Senior Member of IEEE, member of IEEE Computer Society, and IEEE Educational Society Member of The International Artificial Intelligence in Education (AI-ED) Society (and proud to be a member of its inaugural steering committee) Vitae Below is my brief \"hypelinked\" vitae. And here is my CV in PDF format. Graduated with honor (1983) from the Moscow State University (Applied Mathematics). PhD from the Moscow State University, 1987 (Computer Science, advisor Prof. Lev Korolev). Junior and Senior Research Scientist in All-Union Scientific and Technical Information Center (1987 to 1990). Senior Research Scientist in International Centre for Scientific and Technical Information (1990-1994). Lecturer and student advisor at School of Computational Mathematics and Cybernetics of the Moscow State University (1987-1994). Visiting researcher at the University of Sussex, School of Cognitive and Computing Sciences, UK (1993). Alexander von Humboldt Fellow at the Cognition and Communication Group, Department of Psychology, University of Trier, Germany (1994-1996). Visiting Research Scientist at School of Computer Science, Carnegie Mellon University (1996-1998). My reseach work with John Anderson was suppoprted by a grant from James S. McDonnell Foundation. Director of Computer-Managed Instruction at Carnegie Technology Education (later iCarnegie), a wholly owned, non-profit subsidiary of Carnegie Mellon University (1998-1999). In 2000 I joined the University of Pittsburgh as an Assistant Professor at School of Information Sciences (SIS). I am currently a Professor and the head of Personalized and Adaptive Systems Lab in the School of Computing and Information, the successor of SIS. I have secondary appointments at Intelligent Systems Program, University of Pittsburgh and the Human-Computer Interaction Institute, School of Computer Science, Carnegie Mellon University. I also served as a Fulbright-Nokia Distinguished Chair at the Aalto University and University of Helsinki (2013-2014), E.T.S Walton Visiting Professor at National College of Ireland, Visiting Professor at Free University of Bozen-Bolzano (2002), and Visiting Assistant Professor at the Tokio Denki University, Japan (1993). In addition to my degrees from the Moscow State University, I also hold a Doctor Honoris Causa degree from the Slovak University of Technology in Bratislava (2009). Last updated on May 20, 2025",
  "content_length": 5144,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:16"
}