{
  "name": "Peter J. Haas",
  "homepage": "https://people.cs.umass.edu/~phaas",
  "status": "success",
  "content": "Home Page of Peter J. Haas Homepage: Peter J. Haas Manning College of Information and Computer Sciences 140 Governors Drive University of Massachusetts Amherst, MA 01003-9264 Room 204 +1 413/545-3140 +1 413/545-1789 (fax) phaas@cs.umass.edu I am a Professor and the Doctoral Program Director in the College of Information and Computer Sciences, and also an Adjunct Professor of Industrial Engineering, at UMass Amherst. My research centers on the application of techniques from applied probability and statistics to the design, performance analysis, and control of systems for information management, mining, integration, exploration, and learning. Other projects focus on techniques for modeling, simulation, design, and control of complex systems, especially discrete-event stochastic systems, as well as on the interface of simulation and bot information management and machine learning. Prior to joining the UMass faculty, I was a Principal Research Staff Member at the IBM Almaden Research Center from 1987-2017 and an Adjunct Professor of Management Science and Engineering at Stanford University from 1998-2017. A description of my work during this period can be found here. Bio Selected publications Talks and demos Vita Current/Recent Teaching Fall 2019, 2020, 2022: INFO 150 (A Mathematical Foundation for Informatics) Spring 2018--Spring 2022: CS 550 (Simulation, formerly CS590M) Spring 2022: CS 629G (Simulation and Causal Modeling) Spring 2020: CS 692T (Distributed Machine Learning and Data Mining) Current PhD Students Cen Wang Pracheta Amaranath Aman Malali Vasileios Vittis Graduated PhD Students Matteo Brucato Note to Potential PhD Applicants: Please do not contact me about information regarding admissions. Only the admissions committee can decide who is admitted; professors cannot admit individual students.",
  "content_length": 1831,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:27"
}