{
  "name": "Peter Buchholz 0001",
  "homepage": "https://ls4-www.cs.tu-dortmund.de/cms/de/home/buchholz",
  "status": "success",
  "content": "Prof. Dr. Peter Buchholz - MS - TU Dortmund To path indicator Subpages of “Professorship“ To navigation To quick access To footer with other services To content Department of Computer Science Address Prof. Dr. Peter Buchholz Computer Science IV TU Dortmund University D-44221 Dortmund Phone and E-Mail Tel.: +49 (0)231 755 4746 Fax: +49 (0)231 755 4730 E-Mail: peter.buchholz (at) cs.tu-dortmund.de Office Room 216, 2. Floor Otto-Hahn-Str. 16 D-44227 Dortmund Office hours Thursdays from 10:00 to 11:30. Registration by email. Contacting by email is possible at any time. © LS4​/​TU Dortmund Postal address Lehrstuhl Informatik 4 TU Dortmund Otto-Hahn-Straße 16 44227 Dortmund Deutschland Vita 1961 \tborn in Duisburg 1980 \tHigh School Diploma in Duisburg 1981 - 1987 \tStudied computer science at the University of Dortmund, graduated with a degree in computer science 1987 - 1991 \tResearch Assistant at the Department of Computer Science at the University of Dortmund, Computer Science IV (Head: Prof. Dr.-Ing. H. Beilner) 1991 \tDoctorate (Dr. rer. nat.) with a dissertation on the \"Structured Analysis of Markov Chains\". 1991 - 1993 \tAssistant Professor at the Department of Computer Science at the University of Dortmund 1993 - March 1999 \tSenior Engineer at the Department of Computer Science, University of Dortmund 1996 \tHabilitation in computer science with the habilitation thesis \"A framework for the hierarchical analysis of discrete event dynamic systems\" 1999- October 2003 \tProfessor for Modeling and Simulation at the TU Dresden since October 2003 \tProfessor for Modeling and Simulation at the TU Dortmund Research areas Numerical techniques for the analysis of Markov chains Stochastic models under uncertainty Stochastic dynamic programming Software tools for modeling and analysis Analysis of logistics systems Analysis of communication networks and protocols Books P. Buchholz, J. Kriege, I. Felko Input Modeling with Phase-Type Distributions and Markov Models - Theory and Applications \tSpringer Briefs in Mathematics 2014. P. Buchholz, U. Clausen (eds.) Große Netze der Logistik: Die Ergebnisse des Sonderforschungsbereichs 559. \tSpringer 2009. P. Buchholz, A. Kuhn (eds.) Optimization of Logistics Systems – Methods and Experiences. \tVerlag Praxiswissen 2008. P. Buchholz, F. Bause (eds.) 14th GIT/ITG Conference Measurement, Modelling and Evaluation of Computer and Communication Systems. \tSpringer 2009. P. Buchholz, R. Lehnert, M. Pioro (eds.) MMB & PGTS 2004. \tVDE Verlag 2004. P. Buchholz and M. Silva (eds.) Petri Nets and Performance Models (PNPM'99). \tIEEE CS-Press 1999. P. Buchholz. A framework for the hierarchical analysis of discrete event dynamic systems. \tFebruary 1996. Habilitations thesis (Postcript file available on request). P. Buchholz, J. Dunkel, B. Müller-Clostermann, M. Sczittnick and S. Zäske. Quantitative Systemanalyse mit Markovschen Ketten (in German). \tTeubner Texte zur Informatik Bd. 8, 1994. P. Buchholz. Die strukturierte Analyse Markovscher Modelle (in German). \tSpringer Informatik Fachberichte 282, 1991 (Dissertation). Tutorials P. Buchholz. Continuous Time Markov Decision Processes - Theory, Applications and Computational Algorithms \tTutorial at QEST 2011, September 2011, Aachen, Germany. (slides) P. Buchholz. Numerical Analysis Approaches for Large Markov Chains -Experiments, Observations, and Some New Results. \tTutorial at the 2003 Illinois Multiconference on Measurement, Modelling, and Evaluation of Computer-Communication Systems, September 2003.(slides) P. Buchholz. Structured Analysis of Markov Models. \tTutorial at QEST 2004, September 2004, Enschede, Netherlands. (slides) P. Buchholz \t.Numerical Analysis of Markov Models - From Conventional to Structured Models. \tTutorial at the 2001 Aachen Multiconference on Measurement, Modeling, and Evaluation of Computer-Communication Systems, September 2001. P. Buchholz. Analysis of large Markov chains based on Kronecker algebra. \tTutorial at the IPDS'00, March 2000, Schaumburg, Illinois, USA. P. Buchholz. Equivalence and exact aggregation of labelled (G)SPNs \tTutorial at the PNPM/TOOLS 97, June 1997, Saint-Malo, France. P. Buchholz. Structured analysis approaches for large Markov chains - a tutorial. \tTutorial at the Performance 96, October 1996 Lausanne, Switzerland. Publications 2025 Buchholz, P., Mészáros, A., & Telek, M. (2025). Dimensioning leaky buckets in stochastic environments. Performance Evaluation, Volume 167, March 2025, Buchholz, P., Mészáros, A., & Telek, M. (2025). Stationary analysis of a constrained Markov fluid model with two buffers. Stochastic Models, Volume 41 Issue 2, 159–179. Buchholz, P. (2025).  Queuing Analysis of a Traffic Shaping Scheme. 33rd International Symposium on the Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS) Current Conferences The 21st IEEE/IFIP International Conference on Dependable Systems and Networks, Baltimore (Maryland, USA), June 27 to 30, 2022. 19th International Conference on Quantitative Evaluation of SysTems (QEST 2022), Warsaw (Poland),  September 12-16, 2022 10th Vienna International Conference on Mathematical Modelling (MATHMOD 2022), Vienna (Austria), February 16-18, 2022. Past Conferences Int. Conference on Quantitative Evaluation of Systems (QEST): 2004 Twente (Netherlands), 2005 Torino (Italy), 2006 Riverside (USA), 2007 Edinburgh (UK), 2008 St. Malo (France), 2009  Budapest (Hungary), 2010 Williamsburg (USA)., 2012 London (UK), 2013 Buenos Aires (Argentinia), 2020 Vienna (Austria), 2021 Paris (France) Int. Conf. on Dependable Systems and Networks (DSN): 2005 Yokohama (Japan), PC-chair 2007 Edinburgh (UK), 2008 Anchorage (USA), 2009 Lisbon (Portugal), 2010 Chicago (USA), 2011 Hong Kong (China), 2012 Boston (USA), 2013 Budapest (Hungary), 2014 Atlanta (USA), 2015 Rio de Janeiro (Brazil), 2016 Toulouse (France),  2017 Denver (USA), 2020 Valencia (Spain), 2021 Taipei (Taiwan) ITC 2017, Genevo (Italy) Int. Workshop on Petri Nets and Performance Models (PNPM): 1995 Durham (USA), 1997 San Malo (France), PC-Co-chair 1999 Zaragoza (Spain), 2001 Aachen (Germany), 2003 Urbana-Champaign (USA) . Int'l. Conf. on Techniques and Tools for Computer Performance Evaluation (PerformanceTools): 2000 Chicago (USA), 2002 London (UK), 2003 Urbana-Champaign (USA). Int. Workshop on the Numerical Solution of Markov Chains (NSMC): 1999 Zaragoza (Spain), 2003 Urbana-Champaign (USA), 2010 Williamsburg (USA). Symp. on Modeling, Analysis and Simulation of Comp. and Telecomm Systems (MASCOTS): 1999 Maryland (USA), 2000 San Francisco (USA), 2001 Cincinnati (USA). International Conference on Performance Evaluation Methodologies and Tools (ValueTools), 2013, Torino (Italy (PC Co-Chair), 2015 Berlin (Germany), 2016 Taormina (Italy), 2017 Venice (Italy). Messung, Modellierung und Bewertung von Rechensystemen und -netzen (MMB), September 2001, Aachen (Germany), September 2004, Dresden (PC-Co-Chair), March 2006, Erlangen (Germany), March 2008, Dortmund (PC-Chair & General Chair), March 2010, Essen (Germany), 2012 Kaiserslautern (Germany), 2014 Bamberg (Germany), 2016 Münster (Germany), 2018 (Erlangen), 2020 (Saarbrücken). Int. Conf. on Leveranging Applications of Formal Methods (IsoLA): 2004 Paphos (Cyprus). European Dependable Computing Conference, 2010, Valencia (Spain), 2012 Sibiu (Romania), 2014  Newcastle upon Tyne (UK). Intern. Conference on Matrix Analytical Methods in Stochastic Models   MAM , 2014, Calicut (India), 2016, Budapest (Hungary), 2019, Hobart (Tasmania).. MobiHoc, 2010, Chicago (USA). Int. Symp. on Computer and Information Sciences (ISCIS): 2004 Antalya (Turkey). Int. Workshop on Distributed and Parallel Systems: Environments and Tools, Oct. 1996, Budapest (Hungary). Performance 1996, Lausanne (Switzerland), 2007, Cologne (Germany) Tutorial chair, 2010 Namur  (Belgium), 2011 Amsterdam (Netherlands), 2014 Turin (Italy) PC-cochair, 2015 Sydney (Australia). Sigmetrics/Performance 2006 Saint-Malo (France). European Simulation Multiconference (ESM'99), June 1999, Warschau (Poland). Workshop on System Design Automation (SDA), 2002 Pirna (Germany), 2003 Dresden (Germany) Modellierung 2006 Innsbruck (Austria) ETFA 2011 Industrial Communication Systems Track,  2011 Toulouse (France), 2012 Krakow (Poland). Workshop on Factory Communication Systems, June 2006, Torino (Italy), May 2008, Dresden (Germany), 2010, Nancy (France), 2012 Lemgo (Germany), 2014 Toulouse (France), 2015  Palma de Mallorca (Spain), 2016 Aveiro (Portugal), 2017 Trondheim (Norway). Workshop on Tools for Structured Markov Chains (SMCTools), PC-Chair 2007, Nantes (France), 2008 Athens (Greece), 2009 Pisa (Italy) Workshop on Advanced Computing for Critical Systems and Emergency Preparedness and Response (WCEMP) 2008, Sao Paulo (Brazil) International Workshop on Petri Nets Tools and Applications (PNATP); March 2008, Marseille (France) 5th Polish-German Teletraffic Symposium '08, Berlin (Germany). Workshop on Large Scale System and Application Performance, 2009, Munich (Germany), 2011, Chicago (USA). Workshop on Computational Stochastics, 2010, Amsterdam (Netherlands). Workshop on Petri Nets and Software Engineering,  2009, Paris (France). Int. Workshop on Dynamic Aspects in Dependability Models for Fault Tolerant Systems. 2010, Valencia (Spain) GI Sicherheit, 2012, Darmstadt (Germany) ASIM Simulation und Logistik, 2015, Dortmund (Germany) 14th Int. Workshop on Quantitatuive Aspects of Programming Languages (QAPL), April 2-3, 2016, Eindhoven (Netherlands). MATHMOD 2018, 9th Vienna International Conference on Mathematical Modelling, February 21 – 23, 2018, Vienna, Austria. Steering Committees Int. Conf. on Dependable Systems and Networks 2008-2010 Int. Conf. on Quantitative Evaluation of System, 2004-2005, 2011-2013, since 2020 Editorial board of journals Performance Evaluation Referee for the following journals ACM Transactions on Modelling and Computer Simulation     Acta Informatica     Advances/Journal of Applied Probabilit",
  "content_length": 11372,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:17"
}