{
  "name": "Peter Sanders 0001",
  "homepage": "http://algo2.iti.kit.edu/sanders.php",
  "status": "success",
  "content": "KIT – ITI Algorithm Engineering – Mitarbeiter Institut für Theoretische Informatik, Algorithm Engineering StartseiteMitarbeiter Willkommen am Institut für Theoretische Informatik, Algorithm EngineeringAktuellesForschungVeröffentlichungenStudium und LehreMitarbeiterSo finden Sie unsStellenangeboteMitarbeiter Prof. Dr. rer. nat. Peter Sanders Sprechstunden: Dienstag 13.45 bis 14.45 UhrRaum: 217Tel.: +49 721 608-47580Fax: +49 721 608-43088sanders ∂does-not-exist.kit edu Karlsruher Institut für Technologie Fakultät für Informatik Postfach 6980 76128 Karlsruhe Besucheradresse: Am Fasanengarten 5 76131 Karlsruhe LebenslaufVon 1988 bis 1996 studierte und promovierte Peter Sanders an der Universität Karlsruhe (TH). Neben kürzeren Aufenthalten an der North Carolina State University und der Chalmers University in Göteborg arbeitete er sieben Jahre am Max-Planck-Institut für Informatik in Saarbrücken. Seit 2004 hat er einen Lehrstuhl für Theoretische Informatik am KIT. Er beschäftigt sich mit grundlegenden Algorithmen in Theorie und Praxis, zum Beispiel Sortieren, Datenstrukturen oder Suche nach kürzesten Wegen. Schwerpunkte sind dabei Paralleles Rechnen und die Verarbeitung großer Datenmengen. Seine bekanntesten Arbeiten betreffen so verschiedene Themen wie Routenplanung in Straßennetzwerken, Graphpartitionierung, Index-Datenstrukturen, Lastbalancierung, effiziente Kommunikation großer Datenmengen in Netzwerken und ein Lehrbuch über Basisalgorithmen. Peter Sanders verfasste über 250 wissenschaftliche Arbeiten und wurde unter anderem mit dem Gottfried Wilhelm Leibniz-Preis der DFG und dem Landesforschungspreis Baden-Württemberg ausgezeichnet. Er koordinierte das DFG-Schwerpunktprogramm  Algorithm Engineering und ist derzeit Fachkollegiat der DFG. Seine Beratungstätigkeit reicht von Start-ups bis zu Weltfirmen wie SAP und Google und thematisch von Optimierung, Routenplanung und Suchmaschinen bis zu skalierbaren diskreten Algorithmen und Basisalgorithmen für Datenbanken. ForschungsschwerpunkteIch beschäftige mich mit Algorithmentheorie und Algorithm Engineering, d.h., ich arbeite an Entwurf, Implementierung und Analyse effizienter Algorithmen, wobei \"Analyse\" sowohl theoretisch als auch experimentell sein kann. Themen, die ich oft anspreche: Parallelverarbeitung und Kommunikation in Netzwerken Lösungen von Problemen mit \"irregulärer\" Struktur Randomisierte Algorithmen Handhabung großer Datenmengen Realistische Modelle für Probleme und Maschinen Ausgewählte Projekte DFG Schwerpunktprogramm Algorithmen für große Datenmengen mit den folgenden Unterprojekten Graphpartitionierung Textindizes für massive Datenmengen DFG Schwerpunktprogramm Algorithm Engineering (beendet) DFG Projekt Algorithm Engineering für Routenplanung (beendet) DFG Projekt Algorithm Engineering für große Graphen und Speicherhierachien (beendet) SoftwareAuswahl älterer Programme Lehre aktuell Veröffentlichungen 2025 ShockHash: Near Optimal-Space Minimal Perfect Hashing Beyond Brute-ForceLehmann, H.-P.; Sanders, P.; Walzer, S.2025. Algorithmica, 87 (11), 1620–1668. doi:10.1007/s00453-025-01321-z VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Fast and Lightweight Distributed Suffix Array ConstructionHaag, M.; Kurpicz, F.; Sanders, P.; Schimek, M.2025. A. Benoit, H. Kaplan, S. Wild & G. Herman (Hrsg.), 33rd Annual European Symposium on Algorithms (ESA 2025), Warsaw, 15th-17th September 2025, 47:1–47:18, Schloss Dagstuhl - Leibniz-Zentrum für Informatik (LZI). doi:10.4230/lipics.esa.2025.47 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Combined Search and Encoding for Seeds, with an Application to Minimal Perfect HashingLehmann, H.-P.; Sanders, P.; Walzer, S.; Ziegler, J.2025. A. Benoit, H. Kaplan, S. Wild & G. Herman (Hrsg.), 33rd Annual European Symposium on Algorithms (ESA 2025), Warschau, 15th-17th September 2025, Schloss Dagstuhl - Leibniz-Zentrum für Informatik (LZI). doi:10.4230/LIPIcs.ESA.2025.109 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Engineering Minimal k-Perfect Hash FunctionsHermann, S.; Kirmayer, S.; Lehmann, H.-P.; Sanders, P.; Walzer, S.2025. A. Benoit, H. Kaplan, S. Wild & G. Herman (Hrsg.), 33rd Annual European Symposium on Algorithms (ESA 2025), Warschau, 15th-17th September 2025, Schloss Dagstuhl - Leibniz-Zentrum für Informatik (LZI). doi:10.4230/LIPIcs.ESA.2025.99 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Customization Meets 2-Hop Labeling: Efficient Routing in Road NetworksFarhan, M.; Koehler, H.; Wang, Q.; Wang, J.; Laupichler, M.; Sanders, P.2025. Proceedings of the VLDB Endowment, 18 (10), 3326–3338. doi:10.14778/3748191.3748198 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Pareto Sums of Pareto Sets: Lower Bounds and AlgorithmsFunke, D.; Hespe, D.; Sanders, P.; Storandt, S.; Truschel, C.2025. Algorithmica, 87 (8), 1111–1144. doi:10.1007/s00453-025-01314-y VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Linear-Time Multilevel Graph Partitioning via Edge SparsificationGottesbüren, L.; Maas, N.; Rosch, D.; Sanders, P.; Seemaier, D.2025. 33rd Annual European Symposium on Algorithms (ESA 2025). Ed.: A. Benoit, Schloss Dagstuhl - Leibniz-Zentrum für Informatik (LZI). doi:10.4230/LIPIcs.ESA.2025.32 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen BlockFIFO & MultiFIFO: Scalable Relaxed QueuesKoch, S.; Sanders, P.; Williams, M.2025. arxiv. doi:10.48550/arXiv.2507.22764 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen The MultiQueue: A Simple and Fast Relaxed Concurrent Priority QueueWilliams, M.; Sanders, P.2025. ACM Transactions on Parallel Computing. doi:10.1145/3771738 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Synergistic Traffic AssignmentBläsius, T.; Feilhauer, A.; Jung, M.; Laupichler, M.; Sanders, P.; Zündorf, M.2025. Proceedings of the International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS). Ed.: Y. Vorobeychik, 352 – 360, International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS) VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Engineering Optimal Parallel Task SchedulingAkram, M.; Maas, N.; Sanders, P.; Schreiber, D.2025. 2025 Proceedings of the Symposium on Algorithm Engineering and Experiments (ALENEX), New Orleans, 12th-13th January 2025, 168–180, Society for Industrial and Applied Mathematics Publications (SIAM). doi:10.1137/1.9781611978339.14 TeilenPublikation exportieren/teilen 2024 Scalable Distributed String SortingKurpicz, F.; Mehnert, P.; Sanders, P.; Schimek, M.2024. T. Chan, J. Fischer, J. Iacono & G. Herman (Hrsg.), 32nd Annual European Symposium on Algorithms (ESA 2024), London, 2nd - 4th September 2024, Ed.: T. Chan, J. Fischer, I. Fischer, J. Grzegorz, H. Grzegorz, Art.-Nr.: 83, Schloss Dagstuhl - Leibniz-Zentrum für Informatik (LZI). doi:10.4230/LIPIcs.ESA.2024.83 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen PHOBIC: Perfect Hashing With Optimized Bucket Sizes and Interleaved CodingHermann, S.; Lehmann, H.-P.; Pibiri, G. E.; Sanders, P.; Walzer, S.2024. 32nd Annual European Symposium on Algorithms (ESA 2024). Ed.: T. Chan, Schloss Dagstuhl - Leibniz-Zentrum für Informatik (LZI). doi:10.4230/LIPIcs.ESA.2024.69 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Scalable SAT Solving on Demand (Abstract)Schreiber, D.; Sanders, P.2024. HOPC’24: Proceedings of the 2024 ACM Workshop on Highlights of Parallel Computing. Ed.: L. Dhulipala, 11–12, Association for Computing Machinery (ACM). doi:10.1145/3670684.3673414 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Modern Software Libraries for Graph Partitioning (Abstract)Gottesbüren, L.; Maas, N.; Sanders, P.; Seemaier, D.2024. HOPC’24: Proceedings of the 2024 ACM Workshop on Highlights of Parallel Computin, Nantes, 17th-21st June 2024, 19 – 20, Association for Computing Machinery (ACM). doi:10.1145/3670684.3673417 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Brief Announcement: Distributed Unconstrained Local Search for Multilevel Graph PartitioningSanders, P.; Seemaier, D.2024. K. Agrawal & E. Petrank (Hrsg.), SPAA ’24: Proceedings of the 36th ACM Symposium on Parallelism in Algorithms and Architecture, Nantes,17th - 21st June 2024. Hrsg.: K. Agrawal; E. Petrank, 443–445, Association for Computing Machinery (ACM). doi:10.1145/3626183.3660257 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Brief Announcement: Scalable Distributed String SortingKurpicz, F.; Mehnert, P.; Sanders, P.; Schimek, M.2024. SPAA ’24: Proceedings of the 36th ACM Symposium on Parallelism in Algorithms and Architectures, Nantes, 17th-21st June 2024, 375–377, Association for Computing Machinery (ACM). doi:10.1145/3626183.3660256 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Brief Announcement: (Near) Zero-Overhead C++ Bindings for MPIHespe, D.; Hübner, L.; Kurpicz, F.; Sanders, P.; Schimek, M.; Seemaier, D.; Uhl, T. N.2024. SPAA ’24: Proceedings of the 36th ACM Symposium on Parallelism in Algorithms and Architectures, Nantes, 17th-21st June 2024, 289–291, Association for Computing Machinery (ACM). doi:10.1145/3626183.3660260 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen Formally Verifying an Efficient SorterBeckert, B.; Sanders, P.; Ulbrich, M.; Witt, S.; Wiesler, J.2024. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000167846 VolltextVolltext der Publikation als PDF-Dokument TeilenPublikation exportieren/teilen MallobSat: Scalable SAT Solving by Clause SharingSchrei",
  "content_length": 79435,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:47"
}