{
  "name": "Peter Wonka",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/peter-wonka",
  "status": "success",
  "content": "Peter Wonka - Professor, Computer Science - King Abdullah University of Science and Technology Top Home Study Faculty Peter Wonka Professor, Computer Science Principal Investigator, Peter Wonka Research Group Computer, Electrical and Mathematical Science and Engineering Division peter.wonka@kaust.edu.sa Personal website Program Affiliations Computer Science Center of Excellence Center of Excellence for Generative AI Biography Peter Wonka holds an M.Sc. in Computer Science (Dipl.-Ing.) in 1997, an M.Sc. in Urban Planning (Dipl.-Ing.) in 2002, and a Ph.D. in Computer Science (Dr. techn.) in 2001 from the Vienna University of Technology, Austria.Before joining KAUST in 2011 as an Associate Professor of Computer Science, he worked as a postdoctoral researcher at the Georgia Institute of Technology and served as Assistant and Associate Professor at Arizona State University. He is currently a Full Professor at KAUST. He has also held roles as the CS Program Chair and Interim Director of the Visual Computing Center.Professor Wonka is the recipient of the National Science Foundation Career Award. Research Interests Professor Wonka’s research interests lie in computer vision, computer graphics, remote sensing, and machine learning. His current research focus is deep learning, generative modeling of images, videos and 3D scenes, 3D reconstruction, 3D computer vision, and 3D vision and language. Deep learning Computer Vision computer graphics machine learning remote sensing Education Profile M.S. Vienna University of Technology, Urban Planning, 2002Ph.D. Vienna University of Technology, Computer Science, 2001M.S. Vienna University of Technology, Computer Science, 1997 Awards and Recognitions NSF CAREER Award, 2006Best Proposal Award for GAMEWORLD, 2006Best Paper Award at VAST, 20062nd place (Eurographics Symposium on Virtual Reality, Archaeology and Cultural Heritage, 2006Erwin Schrödinger Fellowship, 2002 - 2003Günther Enderle Award for the best paper at Eurographics , 2002Best Student Paper Award at Eurographics, 2001 Show more Publications Show more Research Areas Computer Science Visual Computing Multimedia - ORCID - KAUST Repository - KAUST Academic Portal - Scopus - DBLP - Google Scholar",
  "content_length": 2221,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:53"
}