{
  "name": "Peter C. Rigby",
  "homepage": "http://users.encs.concordia.ca/~pcr",
  "status": "success",
  "content": "Peter C. Rigby Peter C. Rigby Professor of Software Engineering Concordia University, Montreal, Canada Professional Engineer (P.Eng in Ontario) Email: peter.rigby@concordia.ca Phone: +1-514-848-2424 ext 3167 Publication list on Google Scholar LinkedIn profile with my latest news and posts Office hours Mailing Address: Department of Computer Science & Software Engineering Sir George William Campus 1455 De Maisonneuve Blvd. W. Montreal, Quebec, Canada H3G 1M8 Bio and Research Interests Peter C. Rigby is an full professor in Software Engineering at Concordia University in Montreal. His overarching research interest is in understanding how developers collaborate to produce successful software systems. His research program is driven by a desire to determine empirically the factors that lead to the development of successful software and to adapt, apply, and validate these techniques in different settings. Empirical Software Engineering involves mining large data sets to provide an empirical basis for software engineering practices. Software Analytics is then used to provide statistical predictions of, for example, the areas of the system that would benefit from increased developer attention. Grounded, empirical findings are necessary to advance software development as an engineering discipline. He is currently focusing on the following research areas: software testing, developer turnover and knowledge loss, and code review. He has extensive industry collaboration with Ericsson and Meta. Before becoming professor at Concordia, he was a postdoctoral researcher working with Martin Robillard at McGill University. He received his PhD from the University of Victoria with advisers Margaret-Anne Storey (The Chisel Group) and Daniel M. German. He was a visiting researcher with Prem Devanbu at UC Davis. He received a Bachelor degree at the University of Ottawa in Software Engineering. Rigby introduced the PhD program in Software Engineering at Concordia University. As the Software Engineering undergraduate program director he was responsible for the CEAB accreditation and also led an update of the curriculum. He has taught Software Maintenance, Human Computer Interaction, Software Architectures, Mining Software Repositories, and Modern Software Testing. My top tier conference papers include 7 ICSE research track, 5 FSE research track, 8 FSE industry track, and 4 ICSE SEIP papers. I have received 2 ACM SIGSOFT Distinguished Paper Awards (FSE and ICSME) and have won 1 Most Influential Paper Award at MSR. For more information or to apply to work in my research lab, please email me. Publication list on Google Scholar My latest news and posts on LinkedIn",
  "content_length": 2681,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:14"
}