{
  "name": "Peter O'Shea",
  "homepage": "http://researchers.uq.edu.au/researcher/11892",
  "status": "success",
  "content": "Dr Peter O'Shea | UQ Experts Skip to menu Skip to content Skip to footer Dr Peter O'Shea Email: p.oshea1@uq.edu.au Phone: +61 7 336 54139 Positions Senior Lecturer in Elec Engineering School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Availability Dr Peter O'Shea is: Available for supervision Qualifications Bachelor (Honours) of Engineering, The University of Queensland Postgraduate Diploma, The University of Queensland Doctor of Philosophy, The University of Queensland Works Search Professor Peter O'Shea’s works on UQ eSpace All (22) Book (3) Journal Article (6) Other Outputs (1) Conference Publication (10) Book Chapter (2) Featured 2018 Book Employability in engineering: evidence based strategies to improve career success O'Shea, Peter (2018). Employability in engineering: evidence based strategies to improve career success. eBook: Amazon Australia Services. Employability in engineering: evidence based strategies to improve career success Featured 2014 Book The father factor O'Shea, Peter and Falzon, Robert (2014). The father factor. 1st ed. Australia: Connor Court Publishing. The father factor Featured 2011 Book Digital signal processing: an introduction with MATLAB and applications Hussain, Zahir M., Sadik, Amin Z. and O’Shea, Peter (2011). Digital signal processing: an introduction with MATLAB and applications. Berlin, Germany: Springer-Verlag. doi: 10.1007/978-3-642-15591-8 Digital signal processing: an introduction with MATLAB and applications 2024 Conference Publication Facilitating thinking skills development for improved student success and well-being O'Shea, Peter (2024). Facilitating thinking skills development for improved student success and well-being. Australasian Association of Engineering Education, Christchurch, New Zealand, 8-12 December 2024. Facilitating thinking skills development for improved student success and well-being 2023 Conference Publication Learning to program: a tale of two cohorts Fleming, Melanie, O'Shea, Peter, Vrbik, Paul, Webb, Brae and Birkett, Greg (2023). Learning to program: a tale of two cohorts. 34th Australasian Association of Engineering Education, Gold Coast, QLD, Australia, 3-6 December 2023. Gold Coast, QLD, Australia: Engineers Australia. Learning to program: a tale of two cohorts 2019 Conference Publication Facilitating the Development of Humor in Electrical Engineering Students O'Shea, Peter and Terrill, Philip (2019). Facilitating the Development of Humor in Electrical Engineering Students. 2018 IEEE International Conference on Teaching, Assessment, and Learning for Engineering, TALE 2018, Wollongong, NSW Australia, 4 - 7 December 2018. Piscataway, NJ United States: Institute of Electrical and Electronics Engineers. doi: 10.1109/TALE.2018.8615142 Facilitating the Development of Humor in Electrical Engineering Students 2017 Conference Publication A systemic approach to improving tutor quality in a large unit O'Shea, Peter and Terrill, Philip (2017). A systemic approach to improving tutor quality in a large unit. Proceedings of the 28th Annual Conference of the Australasian Association for Engineering Education, Sydney, NSW, Australia, 10-13th December 2017. Sydney, Australia: Australasian Association for Engineering Education (AAEE). A systemic approach to improving tutor quality in a large unit 2016 Journal Article A cognitive strategy scaffolding approach to facilitating reflection in engineering students O'Shea, Peter and Kearney, Michael (2016). A cognitive strategy scaffolding approach to facilitating reflection in engineering students. Australasian Journal of Engineering Education, 21 (1), 17-26. doi: 10.1080/22054952.2016.1214097 A cognitive strategy scaffolding approach to facilitating reflection in engineering students 2016 Book Chapter Instantaneous frequency estimation and localization El-Jaroudi, A., Emresoy, M. K., Stankovic, L. J., Hussain, Z. M., Boashash, B., O'Shea, P. J., Barkat, B., Sucic, V., Lerga, J., Rankine, L. J., Djurovic, I., Simeunovic, M., Djukanovic, S. and Ristic, B. (2016). Instantaneous frequency estimation and localization. Time-frequency signal analysis and processing: a comprehensive reference. (pp. 575-635) edited by Boualem Boashash. Amsterdam, Netherlands: Academic Press. doi: 10.1016/B978-0-12-398499-9.00010-8 Instantaneous frequency estimation and localization 2016 Conference Publication Don’t blame the student, it’s in their mind: helping engineering students to grasp complex concepts McCredden, Julie E., O'Shea, Peter, Terrill, Philip and Reidsema, Carl (2016). Don’t blame the student, it’s in their mind: helping engineering students to grasp complex concepts. 27th Australasian Association for Engineering Education Conference, Coffs Harbour, NSW, Australia, 4-7 December 2016. Coffs Harbour, NSW, Australia: AAEE. Don’t blame the student, it’s in their mind: helping engineering students to grasp complex concepts 2013 Journal Article Vision-based Estimation of airborne target pseudobearing rate using hidden Markov model filters Lai, John, Ford, Jason J., O'Shea, Peter and Mejias, Luis (2013). Vision-based Estimation of airborne target pseudobearing rate using hidden Markov model filters. IEEE Transactions on Aerospace and Electronic Systems, 49 (4), 2129-2145. doi: 10.1109/TAES.2013.6621806 Vision-based Estimation of airborne target pseudobearing rate using hidden Markov model filters 2013 Conference Publication An evidence-based approach to designing a first year Electrical Engineering Course Bergmann, Neil, O'Shea, Peter, Terrill, Philip and Sutton, Peter (2013). An evidence-based approach to designing a first year Electrical Engineering Course. AAEE 2013: 24th Annual Conference of the Australasian Association for Engineering Education, Gold Coast, QLD, Australia, 8-11 December 2013. Nathan, QLD, Australia: Griffith School of Engineering, Griffith University. An evidence-based approach to designing a first year Electrical Engineering Course 2012 Journal Article Demonstration of closed-loop airborne sense-and-avoid using machine vision Mejias, Luis, Lai, John, Ford, Jason J. and O'Shea, Peter (2012). Demonstration of closed-loop airborne sense-and-avoid using machine vision. IEEE Aerospace and Electronic Systems Magazine, 27 (4), 4-7. doi: 10.1109/MAES.2012.6203712 Demonstration of closed-loop airborne sense-and-avoid using machine vision 2012 Journal Article Improving polynomial phase parameter estimation by using nonuniformly spaced signal sample methods O'Shea, Peter (2012). Improving polynomial phase parameter estimation by using nonuniformly spaced signal sample methods. IEEE Transactions on Signal Processing, 60 (7), 3405-3414. doi: 10.1109/TSP.2012.2191546 Improving polynomial phase parameter estimation by using nonuniformly spaced signal sample methods 2012 Book Chapter See and avoid using onboard computer vision Lai, John S., Ford, Jason J., O'Shea, Peter J and Walker, Rodney A. (2012). See and avoid using onboard computer vision. Sense and avoid in UAS: research and applications. (pp. 265-294) edited by Plamen Angelov. Hoboken, NJ, United States: John Wiley & Sons. doi: 10.1002/9781119964049.ch10 See and avoid using onboard computer vision 2012 Conference Publication Ergodic capacity of the exponentially correlated slotted amplify and forward relay channel Widanagamage, Anushka, Jayalath, Dhammika and O'Shea, Peter J (2012). Ergodic capacity of the exponentially correlated slotted amplify and forward relay channel. 2012 IEEE Wireless Communications and Networking Conference (WCNC), Paris, France, 1-4 April 2012. Barton, ACT: Engineers Australia. Ergodic capacity of the exponentially correlated slotted amplify and forward relay channel 2011 Conference Publication Detection versus false alarm rate characterisation of a vision based airborne dim target collision detection system Lai, John, Ford, Jason J., Mejias, Luis, O'Shea, Peter and Walker, Rodney (2011). Detection versus false alarm rate characterisation of a vision based airborne dim target collision detection system. 2011 International Conference on Digital Image Computing: Techniques and Applications (DICTA 2011), Noosa, QLD, Australia, 6 - 8 December 2011. Piscataway, NJ, United States: Institute of Electrical and Electronics Engineers. doi: 10.1109/DICTA.2011.82 Detection versus false alarm rate characterisation of a vision based airborne dim target collision detection system 2011 Conference Publication A curriculum design approach which creates increased opportunity O'Shea, Peter and O'Shea, Gerard (2011). A curriculum design approach which creates increased opportunity. Australasian Association for Engineering Education Conference 2011, Freemantle, WA, Australia, 5-7 December 2011. Barton, ACT, Australia: Engineers Australia. A curriculum design approach which creates increased opportunity 2011 Journal Article Characteristics of modal sound radiation of finite cylindrical shells Lin, Tian Ran, Mechefske, Chris and O'Shea, Peter (2011). Characteristics of modal sound radiation of finite cylindrical shells. Journal of Vibration and Acoustics-Transactions of the ASME, 133 (5), 051011. doi: 10.1115/1.4003944 Characteristics of modal sound radiation of finite cylindrical shells 2011 Conference Publication On improving educational outcomes for indigenous Australian students O'Shea, Peter, Senadji, Bouchra and Kalyuga, Slava (2011). On improving educational outcomes for indigenous Australian students. Australasian Association for Engineering Education Conference 2011, Freemantle, WA, Australia, 5-7 December 2011. Barton, ACT, Australia: Engineers Australia. On improving educational outcomes for indigenous Australian students Supervision Availability Dr Peter O'Shea is: Available for supervision Looking for a supervisor? Read our advice on how to choose a supervisor. Supervision history Completed supervision 2018 Doctor Philosophy Virtual Laboratories for Electrical Engineering St",
  "content_length": 10302,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:40"
}