{
  "name": "Peter Steenkiste",
  "homepage": "http://www.cs.cmu.edu/~prs",
  "status": "success",
  "content": "Peter Steenkiste Home Page Peter Steenkiste Professor Departments of Computer Science and Electrical and Computer Engineering Carnegie Mellon University News! 2020 Research opportunities in networking for undergraduate and MS students (CMU only) Research Interests Networking and distributed computing Bio Teaching 18-452 / 18-750 Wireless Networks and Applications, Spring 2026. 15-712 Advanced and Distributed Operating Systems , Fall 2025 18-452 / 18-750 Wireless Networks and Applications, Spring 2025. 15-441 / 641 Networks and the Internet , Fall 2024. 18-452 / 18-750 Wireless Networks and Applications, Spring 2024. 15-440 / 15-640 Distributed Systems, Spring 2022. 18-452 / 18-750 Wireless Networks and Applications, Spring 2022. 15-441 / 15-641 Networking and the Internet, Fall 2021. Research Projects Network Telemetry for Mobile, Challenged Networks REACH: Robust, Efficient, and Asynchronous Content Delivery in Challenged Networks FLOYD: Edge Computing and 5G Communication for Vehicular Applications FIA control plane: A control plane for the future Internet Past projects Some code releases PhD Students and Postdocs Yuze He, postdoc Sofia Martins Shuoshuo (Shawn) Chen Rawan Al-Shaer Former Graduated Students and Postdocs 5th Year Master's program in CS Program overview Application Handbook AY 25-26 Recent Papers Precise Data Center traffic Engineering with Constrained Hardware Resources, Shawn Chen, Jeqiang He, Rui Wang, Srinivasan Seshan, Peter Steenkiste, 20th USENIX Symposium on Networked Systems Design and Implementation (NSDI'24), Santa Clara, April 2024 Towards Optimal Load Balancing in Multi-Zone Kubernetes Cluster via Reinforcement learning, Jose Pedro dos Santos, Time Wauters, Filip de Turck, Peter Steenkiste, 33rd Internation Conference on Computer Communication and Networks, IEEE, Hawaii, July 2024 A Methodology and Testbed to Develop an Energy Model for 5G Virtualization, Sofia Martins, Ana Aguiar, Peter Steenkiste, Green Network Workshop, ICC 2024, Denver, June 2024, best paper award. Enabling Adaptive and reliable Video Delivery over Hybrid Unicast/Broadcast Networks, Casper Haems, Jeroen Van Der Hooft, Hannes Mareen, Glenn Ven Wallendael, Time Wauters, Filip De Turk, Peter Steenkiste, 34th edition of the Workshop on Network and Operating System Support for Digital Audio and Video, Bari, Italy, April 2024. Sketchovsky: Enabling Ensembles of Sketches on Programmable Switches H. Namkung, Z. Liu, D. Kim, V. Sekar, P. Steenkiste, 20th USENIX Symposium on Networked Systems Design and Implementation (NSDI'23), Boston, April 2023 Battery-free Wideband Spectrum Mapping using Commodity RFID Tags Mohamed Ibrahim, Atul Bansal, Kuang Yuan, Swarun Kumar, Peter Steenkiste, ACM Mobcom'23, Madrid, Spain, October, 2023. Time-division TCP for Reconfigurable Data Center Networks, Shawn Shuoshuo Chen, Weiyang Wang, Christopher Canel, Srini Seshan, Alex Snoeren, Peter Steenkiste, ACM Sigcomm'22, August, 2022, Amsterdam. SketchLib: Enabling Efficient Sketch-based Monitoring on Programmable Switches, Hun Namkung, Zaoxing Liu, Daehyeok Kim, Vyas Sekar, and Peter Steenkiste, 19th USENIX Symposium on Networked Systems Design and Implementation (USENIX NSDI'22), 2022. More Papers By date (includes older papers) Papers on wireless Papers on Aura Papers on Libra Papers on Darwin Papers on Remulac Papers on Credit Net Mailing address Department of Computer Science Carnegie Mellon University 5000 Forbes Avenue Pittsburgh, PA 15213-3891 Office Gates 9111 Voice: 412-268-3261 Fax: 412-268-5576 E-mail: prs at cs.cmu.edu Directions Assistant Tracy Farbacher Gates 7117 Voice: 412-268-8824 E-mail: tracyf at cs.cmu.edu",
  "content_length": 3661,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:47"
}