{
  "name": "Peter Andreae",
  "homepage": "http://ecs.victoria.ac.nz/Main/PeterAndreae",
  "status": "success",
  "content": "Peter Andreae | Te Kura Mātai Pūkaha, Pūrorohiko / School of Engineering and Computer Science | Te Herenga Waka—Victoria University of Wellington Peter Andreae address 04 463 5834 Overview Peter has been connected to Artificial Intelligence since the 1960s when his father started researching Machine Learning systems. His first degree was in Electrical Engineering from the University of Canterbury (New Zealand); he then went to M.I.T. (Massachusetts Institute of Technology) and did a Masters (on a topic in complexity) and a PhD, in Machine Learning (finished in 1984). Since then he has been in Computer Science here at Victoria University of Wellington, first in the Department of Computer Science, then in the merged School of Mathematics, Statistics, and Computer Science, and now in the School of Engineering and Computer Science. He retired in April 2023 but still holds an adjunct position in the School of Engineering and Computer Science Academic positions Adjunct Professor, School of Engineering and Computer Science, Faculty of Engineering, Te Herenga Waka—Victoria University of Wellington Associate Professor, Engineering and Computer Science, Te Herenga Waka—Victoria University of Wellington Associate Dean (Students and Academic Development), Faculty of Engineering, Te Herenga Waka—Victoria University of Wellington Senior Lecturer, Computer Science/Mathematical & Computing Sciences/Engineering & Computer Science, Te Herenga Waka—Victoria University of Wellington. Degrees SM, PhD Massachusetts Institute of Technology 1977–1984 BE(Hons) University of Canterbury 1974–1976 Publications Dang, B. T., Nguyen, B. H., & Andreae, P. (2022). Operation-based Greedy Algorithm for Discounted Knapsack Problem. In Unknown Book (Vol. 13728 LNAI, pp. 646-660). doi:10.1007/978-3-031-22695-3_45Nguyen, B. H., Xue, B., Andreae, P., & Zhang, M. (2021). A Hybrid Evolutionary Computation Approach to Inducing Transfer Classifiers for Domain Adaptation. IEEE Transactions on Cybernetics, 51(12), 6319-6332. doi:10.1109/TCYB.2020.2980815Nguyen, B. H., Xue, B., Andreae, P., & Zhang, M. (2021). A New Binary Particle Swarm Optimization Approach: Momentum and Dynamic Balance between Exploration and Exploitation. IEEE Transactions on Cybernetics, 51(2), 589-603. doi:10.1109/TCYB.2019.2944141Londt, T., Gao, X., & Andreae, P. (2021). Evolving Character-Level DenseNet Architectures Using Genetic Programming. In Unknown Book (Vol. 12694 LNCS, pp. 665-680). doi:10.1007/978-3-030-72699-7_42Londt, T., Gao, X., Xue, B., & Andreae, P. (2020). Evolving Character-level Convolutional Neural Networks for Text Classification. doi:10.48550/arxiv.2012.02223Londt, T., Gao, X., & Andreae, P. (2020). Evolving Character-Level DenseNet Architectures using Genetic Programming. doi:10.48550/arxiv.2012.02327Jabeen, S., Gao, X., & Andreae, P. (2020). Semantic association computation: a comprehensive survey. Artificial Intelligence Review, 53(6), 3849-3899. doi:10.1007/s10462-019-09781-wNguyen, B. H., Xue, B., Andreae, P., Ishibuchi, H., & Zhang, M. (2020). Multiple Reference Points-Based Decomposition for Multiobjective Feature Selection in Classification: Static and Dynamic Mechanisms. IEEE Transactions on Evolutionary Computation, 24(1), 170-184. doi:10.1109/TEVC.2019.2913831Kho, Y. H., Watterson, C., Andreae, P., & Nekooei, M. (2019). An analysis of students' writing: The design of an online repository as a writing support. In TALE 2019 - 2019 IEEE International Conference on Engineering, Technology and Education. doi:10.1109/TALE48000.2019.9225963Mirghasemi, S., Andreae, P., & Zhang, M. (2019). Domain-independent severely noisy image segmentation via adaptive wavelet shrinkage using particle swarm optimization and fuzzy C-means. Expert Systems with Applications, 133, 126-150. doi:10.1016/j.eswa.2019.04.050Nguyen, B. H., Xue, B., Zhang, M., & Andreae, P. (2019). Population-based ensemble classifier induction for domain adaptation. In GECCO 2019 - Proceedings of the 2019 Genetic and Evolutionary Computation Conference (pp. 437-445). doi:10.1145/3321707.3321716Lin, Y., Andreae, P., Li, Z., Cai, J., & Li, H. (2019). Real-time co-registered photoacoustic and ultrasonic imaging for early endometrial cancer detection driven by cylindrical diffuser. Journal of Innovative Optical Health Sciences, 12(2). doi:10.1142/S1793545819500020Tran, C. T., Zhang, M., Andreae, P., Xue, B., & Bui, L. T. (2018). Improving performance of classification on incomplete data using feature selection and clustering. Applied Soft Computing Journal, 73, 848-861. doi:10.1016/j.asoc.2018.09.026Nguyen, H. B., Xue, B., & Andreae, P. (2018). PSO with surrogate models for feature selection: static and dynamic clustering-based methods. Memetic Computing, 10(3), 291-300. doi:10.1007/s12293-018-0254-9Tran, C. T., Zhang, M., Andreae, P., Xue, B., & Bui, L. T. (2018). An effective and efficient approach to classification with incomplete data. Knowledge-Based Systems, 154, 1-16. doi:10.1016/j.knosys.2018.05.013Mahmood, M. A., Welch, I., & Andreae, P. (2018). Enhanced event reliability in wireless sensor networks. In 2018 IEEE 32nd International Conference on Advanced Information Networking and Applications (AINA) (pp. 93-100). IEEE.Nguyen, B. H., Xue, B., & Andreae, P. (2018). A particle swarm optimization based feature selection approach to transfer learning in classification. In GECCO 2018 - Proceedings of the 2018 Genetic and Evolutionary Computation Conference (pp. 37-44). doi:10.1145/3205455.3205540Tran, C. T., Zhang, M., Xue, B., & Andreae, P. (2018). Genetic programming with interval functions and ensemble learning for classification with incomplete data. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) Vol. 11320 LNAI (pp. 577-589). doi:10.1007/978-3-030-03991-2_53Tran, C. T., Zhang, M., Andreae, P., Xue, B., & Bui, L. T. (2017). An ensemble of rule-based classifiers for incomplete data. In Proceedings - 2017 21st Asia Pacific Symposium on Intelligent and Evolutionary Systems, IES 2017 Vol. 2017-January (pp. 7-12). doi:10.1109/IESYS.2017.8233553Qu, Y., Ng, B., Yu, H., Andreae, P., & Seah, W. K. G. (2017). Fitness evaluation for channel assignment algorithms in IEEE 802.11 WMNs. In 2017 14th IEEE Annual Consumer Communications and Networking Conference, CCNC 2017 (pp. 361-364). doi:10.1109/CCNC.2017.7983135Nguyen, H. B., Xue, B., Andreae, P., & Zhang, M. (2017). Particle Swarm Optimisation with genetic operators for feature selection. In 2017 IEEE Congress on Evolutionary Computation, CEC 2017 - Proceedings (pp. 286-293). doi:10.1109/CEC.2017.7969325Tran, C. T., Zhang, M., Andreae, P., & Xue, B. (2017). Multiple imputation and genetic programming for classification with incomplete data. In GECCO 2017 - Proceedings of the 2017 Genetic and Evolutionary Computation Conference (pp. 521-528). Online. doi:10.1145/3071178.3071181Tran, C. T., Zhang, M., Andreae, P., & Xue, B. (2017). Genetic programming based feature construction for classification with incomplete data. In GECCO 2017 - Proceedings of the 2017 Genetic and Evolutionary Computation Conference (pp. 1033-1040). doi:10.1145/3071178.3071183Nguyen, H. B., Xue, B., Ishibuchi, H., Andreae, P., & Zhang, M. (2017). Multiple Reference Points MOEA/D for Feature Selection. In Proceedings of GECCO '17 Companion (pp. 157-158). Berlin, Germany: ACM. doi:10.1145/3067695.3075985Nguyen, B. H., Xue, B., & Andreae, P. (2017). A Novel Binary Particle Swarm Optimization Algorithm and Its Applications on Knapsack and Feature Selection Problems. In Unknown Conference (pp. 319-332). Springer International Publishing. doi:10.1007/978-3-319-49049-6_23Nguyen, H. B., Xue, B., & Andreae, P. (2017). A hybrid GA-GP method for feature reduction in classification. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) Vol. 10593 LNCS (pp. 591-604). doi:10.1007/978-3-319-68759-9_48Tran, C. T., Zhang, M., Andreae, P., & Xue, B. (2017). Bagging and Feature Selection for Classification with Incomplete Data. In G. Squillero, & K. Sim (Eds.), Unknown Conference (pp. 471-486). Springer International Publishing. doi:10.1007/978-3-319-55849-3_31Tran, C. T., Zhang, M., Andreae, P., Xue, B., & Bui, L. T. (2017). Multiple Imputation and Ensemble Learning for Classification with Incomplete Data. In G. Leu (Ed.), Proceedings in Adaptation, Learning and Optimization 8 (pp. 401-415). Canberra, Australia. doi:10.1007/978-3-319-49049-6_29Nguyen, H. B., Xue, B., & Andreae, P. (2017). Surrogate-model based particle swarm optimisation with local search for feature selection in classification. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) Vol. 10199 LNCS (pp. 487-505). Amsterdam, The Netherlands: Springer, Cham. doi:10.1007/978-3-319-55849-3_32Mirghasemi, S., Andreae, P., Zhang, M., & Rayudu, R. (2016, December 6). Severely noisy image segmentation via wavelet shrinkage using PSO and Fuzzy C-Means. In 2016 IEEE Symposium Series on Computational Intelligence, SSCI 2016 (pp. 1663-1670). Athens, Greece. doi:10.1109/SSCI.2016.7850051Tran, C. T., Zhang, M., & Andreae, P. (2016). Directly evolving classifiers for missing data using genetic programming. In 2016 IEEE Congress on Evolutionary Computation, CEC 2016 (pp. 5278-5285). doi:10.1109/CEC.2016.7748361Nguyen, H. B., Xue, B., Liu, I., Andreae, P., & Zhang, M. (2016). New mechanism for archive maintenance in PSO-based multi-objective feature selection. Soft Computing, 20(10), 3927-3946. doi:10.1007/s00500-016-2128-8Tran, C. T., Zhang, M., Andreae, P., & Xue, B. (2016). Improving performance for classification with incomplete data using wrapper-based feature selection. Evolutionary Intelligence, 9(3), 81-94. doi:10.1007/s12065-016-0141-6Nguyen, H. B., Xue, B., & Andreae, P. (2016). Mutual information ",
  "content_length": 43617,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:11"
}