{
  "name": "Peter Edwards",
  "homepage": "https://www.abdn.ac.uk/people/p.edwards",
  "status": "success",
  "content": "Professor Peter Edwards | The University of Aberdeen Professor Peter Edwards Professor Peter EdwardsPhD CITP FBCS FIET FRSAPrincipal & Vice-Chancellor About Email Addressp.edwards@abdn.ac.ukSchool/DepartmentPrincipal's Office ORCiDLinkedin Biography Professor Peter Edwards became Principal and Vice-Chancellor of the University of Aberdeen on 1 November 2025. He joined the University of Aberdeen as a postdoctoral fellow in Computing Science in October 1988, before moving into his first academic position as a Lecturer in 1991. His academic research focuses on the design of intelligent information infrastructures that promote transparency and accountability in computational systems, on which he has published widely. Much of this work has been interdisciplinary in nature, involving collaborations across fields including medicine, law, geography, transport studies, food science, and design. He has served as Principal Investigator on major UK Research Council awards valued at over £20m, including the eSocial Science Research Node PolicyGrid (ESRC, 2006–2012) and the UK Digital Economy Research Hub dot.rural (EPSRC, 2009–2015). In his nearly four decades at the University he has also held a range of senior leadership roles, including Head of Computing Science, Head of the College of Physical Sciences Graduate School, Director of the Northern Research Partnership Graduate School (a collaboration among the Universities of Aberdeen, Dundee, and Robert Gordon), Head of the School of Natural and Computing Sciences, Vice-Principal for Regional Engagement, and Acting Senior Vice-Principal. Professor Edwards is Chair of the University Senate, a member of the University Court and a member of the Board of the University's Development Trust. His external roles include membership of the Board of Opportunity North East, the Aberdeen City Deal Joint Committee, and the North East Scotland Investment Zone Steering Group. He is a Fellow of the British Computer Society, the Institution of Engineering & Technology and the Royal Society for the Encouragement of Arts, Manufactures and Commerce. Principal's Office Contacts Heather Crabb - Head of Principal's Office Tel: +44 (0) 1224272404 Email: h.crabb@abdn.ac.uk J Ross Anderson -  Governance & Executive Support Officer Tel: +44 (0)1224 273881 Email: ross.anderson@abdn.ac.uk Julia Garrow - Personal Assistant to Principal and Vice-Chancellor Tel: +44 (0)1224 272135 Email: PrincipalPA@abdn.ac.uk Fiona Beedie - Admin Assistant (8.30am to 1.45pm) Tel: +44 (0)1224 272134 Email: fiona.beedie@abdn.ac.uk Qualifications PhD Computational Chemistry 1990 - University of Leeds Memberships and Affiliations Internal Memberships Adapting for Continued Success Programme Board - Sponsor/Convenor Enterprise & Innovation Committee - Convenor Regional Engagement Committee - Convenor Startup & Spin-out Panel - Convenor University Promotions Committee I - Convenor Advisory Group on Collections Deaccessioning and Repatriation - Convenor Sustainable Heating Programme Board - Project Sponsor/Convenor Science Teaching Hub Project Board - Project Sponsor/Convenor Engagement CRM Project Board - Project Sponsor/Convenor Rowett Research Institute (RRI) Ltd - Chair & Director Campaign Management Board - Member Estates Committee - Member Honorary Degrees Committee - Member Information Governance Committee - Member Risk Management Committee - Member TRAC Steering Committee - Member Partnership and Negotiating Consultative Committee (PNCC) - Member University Management Group (UMG) - Member Senate - Ex Officio Member University of Aberdeen Superannuation & Life Assurance Scheme - Trustee External Memberships EPSRC Peer Review College - Member ESRC Peer Review College - Member Carnegie Trust Research Assessor Community Planning Aberdeen Board - Member Regional Inward Investment Forum - Member University of Aberdeen - NHS Grampian Liaison Group - Member North East Scotland Investment Zone Working Group - Member Aberdeen (Tertiary) Education Liaison Group, Aberdeen City Council - Member Latest Publications Embedding AI-Enabled Data Infrastructures for Sustainability in Agri-Food: Soft-Fruit and Brewery Use Case Perspectives 2024 - PublishedMarkovic, M., Li, A. H., Ayall, T. A., Watson, N. J., Bowler, A. L., Woods, M., Edwards, P., Ramsey, R., Beddows, M. A., Kuhnert, M., Leontidis, G. Sensors, vol. 24, no. 2024, 7327Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.3390/s24227327[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/56c28a6a-f00e-40ac-bba6-09604d02fea9/downloadFarm Explorer: A Tool for Calculating Transparent Greenhouse Gas Emissions 2024 - PublishedMarkovic, M., Germano, S., Garijo, D., Edwards, P., Li, A., Ayall, T. A., Ramsey, R., Leontidis, G. Contributions to Journals: Conference Articles[ONLINE] https://ceur-ws.org/Vol-3828/paper31.pdf[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/8933a31f-de0d-4382-8d8d-c6d04b6473a2/downloadModel pruning enables localized and efficient federated learning for yield forecasting and data sharing 2024 - PublishedLi, A. H., Markovic, M., Edwards, P., Leontidis, G. Expert Systems with Applications, vol. 242, pp. 1-12Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1016/j.eswa.2023.122847[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/b523b56b-12bc-42d0-bd50-a645cd3fd6bc/download[ONLINE] https://www.sciencedirect.com/science/article/pii/S0957417423033493Model Pruning Enables Localized and Efficient Federated Learning for Yield Forecasting and Data Sharing 2023 - PublishedLi, A., Markovic, M., Edwards, P., Leontidis, G. Working Papers: Preprint Papers[ONLINE] http://arxiv.org/abs/2304.09876v1[ONLINE] DOI: https://doi.org/10.48550/arXiv.2304.09876[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/07ff3577-c744-4c79-b169-34dd01e4002b/downloadUsing Knowledge Graphs to Unlock Practical Collection, Integration, and Audit of AI Accountability Information 2022 - PublishedNaja, I., Markovic, M., Edwards, P., Pang, W., Cottrill, C., Williams, R. IEEE Access, vol. 10, pp. 74383 - 74411Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/ACCESS.2022.3188967[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/4ed8948a-3cb0-4942-8fb5-39e86b847d38/download View My Publications Research Research Overview Intelligent information infrastructures that promote transparency and accountability in computational systems. My interests span models of provenance, trust, information quality, transparency and accountability and the realisation of these in the context of the web, the internet of things, and autonomous systems. My work has a strong applications focus in areas as diverse as food safety, transport, smart cities, logistics and healthcare; interdisciplinary collaborations have included Medicine, Law, Geography, Transport Studies, Food Science, and Design. Research Areas Computing Science SupervisingView Research Area Research Specialisms Knowledge and Information SystemsInformation ManagementInternet TechnologiesArtificial IntelligenceIntelligent Systems Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Past Research Enhancing Agri-Food Transparent Sustainability - EATS(Aberdeen, Dundee, SRUC, Nottingham)EPSRC: EP/V042270/1, 2022-2024 Funding and Grants Enhancing Agri-Food Transparent Sustainability - EATSEPSRC, 2022-2024 PROoFD IT!: Provenance of Food Delivery through IoTEPSRC Internet of Food Things Network+, 2019 Realising Accountable Intelligent Systems - RAInSEPSRC: EP/R033846/1, 2019-2022 Trusted Things & Communities: Understanding & Enabling a Trusted IoT EcosystemEPSRC: EP/N028074/1, 2016-2019 Trust & Privacy in Smart City IoT SolutionsRoyal Society of Edinburgh - Taiwan Ministry of Science & Technology, 2017-2019 The Food Sentiment Observatory: Exploiting New Forms of Data to Help InformPolicy on Food Safety & Food Crime Risks (with Food Standards Scotland)ESRC: ES/P011004/1, 2017-2018 Smart RoutingInnovate UK, 2016-2017 Food Safety Assurance: Combining Provenance & The Internet of ThingsIT as a Utility Network+ & Food Standards Agency, 2015-2016 Social Media: Developing Understanding, Infrastructure & Engagement ESRC: ES/M001628/1, 2014-2016 dot.rural Digital Economy Research HubEPSRC (with AHRC, ESRC, MRC): EP/G066051/1, 2009-2015 Trusted Tiny ThingsEPSRC IT as a Utility Network+, 2013-2014 Creativity @ Home AwardEPSRC, 2012-2014 A Trusted Mobile Platform for Self-Management of Chronic Illness in Rural Areas - TRUMPEPSRC - India DST: EP/J00068X/1, 2011-2014 SmartTourismSFC Horizon Fund, 2011-2014 PolicyGrid II: Supporting Interdisciplinary Evidence Bases for ScientificCollaboration and Policy MakingESRC: ES/F029713/1, 2009-2012 BEhaviour for Well-being, Environment and Life - BE-WELESRC (with BBSRC, MRC), 2009-2010eInfrastructure for Social SciencesESRC: RES-149-25-1063, 2006-2009SwarmCloudJISC, 2008-2009 PolicyGrid: Semantic Grid Tools for Rural Policy Development & AppraisalESRC: RES-149-25-1027, 2006-2009 Access Grid Node Competition - Equipment Award`ESRC, 2006 Pilot Semantic Grid Service for Environmental ModellingESRC: RES-149-25-0011, 2003-2005 Teaching Teaching Responsibilities I am not currently involved in teaching activity, other than PhD supervision. Publications Page 1 of 16 Results 1 to 10 of 155 Embedding AI-Enabled Data Infrastructures for Sustainability in Agri-Food: Soft-Fruit and Brewery Use Case Perspectives 2024 - PublishedMarkovic, M., Li, A. H., Ayall, T. A., Watson, N. J., Bowler, A. L., Woods, M., Edwards, P., Ramsey, R., Beddows, M. A., Kuhnert, M., Leontidis, G. Sensors, vol. 24, no. 2024, 7327Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.3390/s24227327[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/56c28a6a-f00e-40ac-bba6-09604d02fea9/downloadFarm Explorer: A Tool for Calculating Transparent Greenhouse Gas Emissions 2024 - PublishedMarkovic, M., ",
  "content_length": 14121,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:21"
}