{
  "name": "Peter L. Bartlett",
  "homepage": "http://www.stat.berkeley.edu/~bartlett",
  "status": "success",
  "content": "Peter Bartlett's Home Page Peter L. Bartlett Professor, Computer Science and Statistics Berkeley AI Research Lab Director, Foundations of Data Science Institute Director, Collaboration on the Theoretical Foundations of Deep Learning ML Research Director, Simons Institute for the Theory of Computing UC Berkeley Principal Scientist, Google DeepMind Publications, Google Scholar Talks Courses: Fall 2016: Stat155 Game theory Spring 2016: CS281B/Stat241B Statistical learning theory Fall 2015: CS281A/Stat241A Statistical learning theory Spring 2015: CS189/289A Introduction to Machine Learning Fall 2014: CS294/Stat260 Learning in sequential decision problems Spring 2013: Stat210B Theoretical Statistics Fall 2010: Stat153 Introduction to time series analysis Conferences: Exploring and Exploiting High-dimensional Phenomena in Statistical Learning and Inference, Harvard Radcliffe Institute, June 2, 2022. Rethinking High-Dimensional Mathematical Statistics, Oberwolfach, May, 2022. 56th Annual Conference on Information Sciences and Systems, Princeton, March 2022. London Mathematical Society Lectures on Mathematics of Deep Learning, Newton Institute, March 2022. Mathematical Statistics and Learning, BIRS, December 2021. Machine Learning and Nonparametric Statistics, CIRM, December 2021. NeurIPS 2021, December 2021. Mathematics of Machine Learning, Bielefeld, August 2021. IEEE International Symposium on Information Theory, Melbourne, July 2021. Mathematics of Deep Learning, INI Program, July 1 - December 17, 2021. Workshop on the Theory of Overparameterized Machine Learning, April 20-21, 2021. The Multifaceted Complexity of Machine Learning, IMSI, Chicago, April 12-16, 2021. Mathematical Foundations of Machine Learning, Oberwolfach, March 21-27, 2021. FOCS 2020, November 13, 2020. Foundations of Data Science Institute Kickoff Workshop, November 10, 2020. Workshop on Analytical Foundations of Deep Learning, CDTI, October 19-21, 2020. Statistics and Computation Workshop, Alan Turing Institute, London, January 13-14, 2020. TAU Theory-Fest \"Workshop on Advances in Learning Theory\", Tel Aviv University, December 31, 2019. AI Institute \"Geometry of Deep Learning\", Microsoft Research Redmond, August 26-28, 2019. Foundations of Deep Learning Program, Simons Institute for the Theory of Computing, May-August, 2019. Peter G. Hall Conference 2019: Statistics and Machine Learning, Department of Statistics, UC Davis, May 10-11, 2019. YES X : \"Understanding Deep Learning: Generalization, Approximation and Optimization\", Eurandom March 19-22, 2019. The Science of Deep Learning, Arthur M. Sackler Colloquium, National Academy of Science, Washington DC, March 13-14, 2019. Foundations of Data Science Program, Simons Institute, Berkeley, Fall 2018. DIMACS/TRIPODS Workshop, Lehigh University, 13-15 August, 2018. JSM 2018, Vancouver, Canada, July 28-August 2, 2018. ICML 2018, Stockholm, Sweden, July 10-15, 2018. COLT 2018, Stockholm, Sweden, July 5-9, 2018. Future Challenges in Statistical Scalability, Isaac Newton Institute for Mathematical Sciences, Cambridge, UK, June 25-29, 2018. Bridging Mathematical Optimization, Information Theory, and Data Science, Princeton Center for Theoretical Science, May 14-16, 2018. Workshop on Modern Challenges in Learning Theory, CRM, Montreal, Canada, April 23-26, 2018. AIStat 2018, Canary Islands, April 9-11, 2018. Algorithmic Learning Theory, Lanzarote, Spain, April 7-9, 2018. NIPS 2017, Long Beach, CA, December 4-9, 2017. Students and Postdocs: Ishaq Aden-Ali Spencer Frei Luiz Chamon Yeshwanth Cherapanamjeri Wenlong Mou Juanky Perdomo Alexander Tsigler Former Students and Postdocs: Kush Bhatia (Stanford) Aldo Pacchiano (Microsoft Research) Niladri Chatterji (Stanford) Yannik Pitcan (Quantfury) Xiang Cheng (MIT) Tan Nguyen Nan Ye (UQ) Victor Gabillon (Huawei) Alan Malek (MIT) Martin Peron (CSIRO) Brendan van Rooyen (ANU) Yasin Abbasi-Yadkori (Adobe Research) Walid Krichene (Google) Wouter Koolen (Researcher, CWI, Amsterdam) Yevgeny Seldin (Assistant Professor, Computer Science, University of Copenhagen) Fares Hedayati (Senior Data Scientist, Upwork, San Francisco) Alekh Agarwal (Researcher, Microsoft Research, New York) Jake Abernethy (Assistant Professor, CSE, University of Michigan, Ann Arbor) Afshin Rostamizadeh (Research Scientist, Google Research, New York) Ben Rubinstein (Senior Lecturer, University of Melbourne) Alexander Rakhlin (Associate Professor, Statistics, University of Pennsylvania) David Rosenberg (Chief Scientist, YP Mobile Labs, New York) Mikhail Traskin (Quantitative Researcher, Citadel LLC, Chicago) Ambuj Tewari (Assistant Professor, Statistics, University of Michigan, Ann Arbor) Evan Greensmith (Senior Software Engineer, Exari Systems) Matthias Seeger (Senior Machine Learning Scientist, Amazon, Berlin) Ying Guo (CSIRO, Sydney, Australia) Shahar Mendelson (Professor, Technion and ANU) Llew Mason (Vice President, Consumer Website, Amazon, Seattle WA) Alexander J. Smola (Professor, Machine Learning, CMU). Jonathan Baxter (Vice President, Two Sigma Investments, New York) Mostefa Golea (SW R&D Manager, JDS Uniphase, Ottawa) Leonardo Kammer (Senior Controls Engineer, GE Global Research, New York) Wee Sun Lee (Associate Professor, Computer Science, National University of Singapore) Note for Prospective Students: The graduate admissions process is handled by a departmental committee, not by individual faculty. You can find information about the process in Statistics here and in Computer Science here. I am unable to supervise summer interns. I apologize in advance for not responding to the email that I receive about graduate admission and about summer internships. \"Neural Network Learning: Theoretical Foundations\", Martin Anthony and Peter Bartlett, Cambridge University Press, 1999. CUP. Amazon. Biography Achievements Contact Information: University of California, Berkeley Department of Statistics 367 Evans Hall #3860 Berkeley, CA 94720-3860 Phone: +1 510-642-8079 Fax: +1 510-642-7892 Email: peter@berkeley.edu Last update: Sun Jul 24, 2022",
  "content_length": 6064,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:33"
}