{
  "name": "Peter Chunyu Yau",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/petercyyau",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Peter C Y Yau Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffPeter C Y YauMr Ethan KellyZhen Tian Dr Peter C Y Yau Assistant Professor in Computing Science (Singapore) (Singapore: Computing Science) email: PeterCY.Yau@glasgow.ac.uk Import to contacts https://orcid.org/0000-0001-8431-2770 Biography Dr Peter YAU is an Assistant Professor in the School of Computing Science, University of Glasgow (UofG, Singapore campus). Peter received his DBA at the University of Newcastle, Australia; his dissertation is entitled \"An Empirical Study of the Drivers and Impediments in the Adoption of Financial Technology\" Peter has international consulting experience with a track record in managing change in organizations and system development. He delivered ambitious results for financial institutions, public transport providers, Big 4 accounting firms, etc. He pioneered in building the first unmanned smart-tech laboratory in Hong Kong for teaching, learning and research purposes. Before joining the UofG, he worked as an adjunct faculty in various engineering institutes, and a global EMBA school. His recent commercial deployment is a Fintech project related to automation: \"Finding Global Investment Opportunities by Using Big Data Analysis - A Social Sentiment Listening Approach with Machine Learning\". He is an Amazon AWS Educate Cloud ambassador and a program evaluator for the computing accreditation commission at ABET. Peter loves to travel: he carried his laptop to Amazon, Himalayas, and Safari. Research interests Web Development Cloud Computing System Automation Internet of Things (IoT) Enterprise Software & Development Methodology Financial Technology (Fintech) Algo-trade, Behavioural Finance & Sentiment Analysis Research groupsEducation & Practice Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020Number of items: 42.2025 Candelario, Christian Angelo Lau, Chang, Zhi Hao Nelson, Fawaz, Mohamed Faizal Mohamed, Suresh Kumar, Balavignesh and Yau, Peter ChunYu ORCID: https://orcid.org/0000-0001-8431-2770 (2025) Enhancing Virtual Hearings: Interactive User Interface with Face Recognition for Improved Human-Computer Interaction. In: 9th International Conference on Intelligent Computing and Virtual & Augmented Reality Simulations (ICVARS 2025), Birmingham, UK, 25-27 July 2025, ISBN 9798331586591 (doi: 10.1109/ICVARS66454.2025.11198759) Yau, Peter C Y ORCID: https://orcid.org/0000-0001-8431-2770 (2025) University of Glasgow, Hackathon SG 2025. [Website] Iskandar Bin Mohamed Hanafiah, Muhammad, Kiat Desmond Loy, Yong, Long Rayson Ng, Wen, Ning Ang, Yan, Wang, Yifei, Jian Xavier Ong, Yu, Yau, Peter ChunYu ORCID: https://orcid.org/0000-0001-8431-2770, Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693, Wong, Dennis and Cheong, Ngai (2025) Integration of SGD Elements in Surveyed Design of Portable Assessment Apps to Foster Inclusive and Equitable Learning and Teaching Quality Education. In: 6th International Conference on Modern Educational Technology (ICMET '24), Tokyo, Japan, 13-15 Dec 2024, pp. 40-47. ISBN 9798400712630 (doi: 10.1145/3729434.3729455) Yau, Peter C Y ORCID: https://orcid.org/0000-0001-8431-2770 and Chan, Raymond (2025) Student-centric strategies in designing ethical AI framework. Education Technology Insights, June. Cheng, Joy Yee Shing and Yau, Peter C Y ORCID: https://orcid.org/0000-0001-8431-2770 (2025) How to create a VS code extension for API health checks? Educator Developer Blog, 13 May. Ong, Si Hui, Ang, Hui Lun, Lian, Elroy, Tan, Timothy, Tan, Kai Yang, Tay, Emanuel, Yau, Peter C. Y. ORCID: https://orcid.org/0000-0001-8431-2770, Hesse, Henrik ORCID: https://orcid.org/0000-0003-0360-2384, Woradit, Kampol and Bhatia, Dinesh ORCID: https://orcid.org/0000-0002-9803-377X (2025) FIREfly Project: Forest Fire Monitoring and Prediction Using Machine Learning. In: 2024 International Conference on Artificial Intelligence and Machine Learning Research (CAIMLR 2024), Singapore, 28-29 September 2024, p. 1363502. ISBN 9781510691797 (doi: 10.1117/12.3056811) Cheng, Joy Yee Shing and Yau, Peter C Y ORCID: https://orcid.org/0000-0001-8431-2770 (2025) Develop a VS code extension for your capstone project. Educator Developer Blog, 7 May. Yau, Peter C Y ORCID: https://orcid.org/0000-0001-8431-2770 (2025) Developing Transparent and Accountable Ethical AI Technologies to Build Trust in Higher Education. [Website] Mohamed Riduwan, Mohammad Rizqullah Hafizh bin, Beng, Jung Zen Mark, Oh, Jia Wei Darien, Ng, Jun Hong, Loh, Chloe Rayn, Ong, Shi Ya, Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 and Yau, Peter C.Y. ORCID: https://orcid.org/0000-0001-8431-2770 (2025) Exploring Peer Evaluation Methods in Group Projects of Software Engineering Education. In: IEEE Frontiers in Education Conference 2024 (FIE 2024), Washington DC, USA, 13-16 October 2024, ISBN 9798350351507 (doi: 10.1109/FIE61694.2024.10893587) Liow, Hui Jia Karin, Yau, Peter ChunYu ORCID: https://orcid.org/0000-0001-8431-2770, Tang, Lai Meng ORCID: https://orcid.org/0000-0001-6016-9797, Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410 and Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 (2025) Peer-Assessed (Evaluated) Automated Grading System. In: International Conference on Artificial Intelligence and Teacher Education (ICAITE '24), Beijing, 12-14 October 2025, pp. 91-96. (doi: 10.1145/3702386.3702404) 2024 Yau, Peter C.Y. ORCID: https://orcid.org/0000-0001-8431-2770 (2024) Effective Safety Measures in Peer Evaluation with Azure AI Content Safety. [Website] Yi Chan, Elicia Min, Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410, Wee Tan, Esther Su, Wang, Min, Yau, Peter Chunyu ORCID: https://orcid.org/0000-0001-8431-2770 and Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 (2024) SketchBoard: Sketch-Guided Storyboard Generation for Game Characters in the Game Industry. In: 2024 IEEE 22nd International Conference on Industrial Informatics (INDIN), Beijing, China, 18-20 August 2024, ISBN 9798331527488 (doi: 10.1109/INDIN58382.2024.10774282) Loo, ZongPoh, Tan, AnngKang, Choo, Clement JunKai, Tay, Shaun JiaLe, Lim, XueEr, Loh, Jeremiah XianMing, Ge-Hall, Andrew, Yau, Peter C.Y. ORCID: https://orcid.org/0000-0001-8431-2770 and Wong, Dennis (2024) GenDatr: visualizing probabilistic data generation in medical data science. In: Arai, Kohei (ed.) Proceedings of the Future Technologies Conference (FTC) 2024, Volume 3. Series: Lecture notes in networks and systems (1156). Springer, pp. 373-378. ISBN 9783031731259 (doi: 10.1007/978-3-031-73125-9_23) Moriguchi, Rie, Yau, Peter C Y ORCID: https://orcid.org/0000-0001-8431-2770, Falland, Matthias, Edo, Xavier Portilla and Fung, Dicky (2024) MVP’s Favorite Content: Learning environment, Fabric, AI [Blog Post]. Sum Lam, Ming, Shao, Jiahui, Zhou, Ruizhe, Yau, Peter Chunyu ORCID: https://orcid.org/0000-0001-8431-2770 and Wong, Dennis (2024) Inquiry-Based Education Technological Application Model in Distance Learning. In: 10th International Conference on Education and Training Technologies (ICETT '24), Macau, China, 11-13 April 2024, pp. 127-131. ISBN 9798400717895 (doi: 10.1145/3661904.3661912) Ng, Tyne, Bin Rawi, Ahadiyat Abadi, Sum, Chin Sean, Tso, Ejoe, Yau, Peter C.Y. ORCID: https://orcid.org/0000-0001-8431-2770 and Wong, Dennis (2024) Migrating from Monolithic to Microservices with Hybrid Database Design Architecture. In: ICIIT 2024: 2024 9th International Conference on Intelligent Information Technology, Ho Chi Minh City, Vietnam, 23-25 February 2024, pp. 536-541. ISBN 9798400716713 (doi: 10.1145/3654522.3654602) Lim, Kei Yiang, Priyadarshi, Ayan, Nadiah, Nur Farah, Lee, Jun Hao Jeff, Lau, Jun Xiang, Chew, Chyou Keat Lionel, Yau, Peter Chun Yu ORCID: https://orcid.org/0000-0001-8431-2770 and Wong, Dennis (2024) Towards seamless communication for sign language support: architecture, algorithms, and optimization. In: Auer, Michael E., Langmann, Reinhard, May, Dominik and Roos, Kim (eds.) Smart Technologies for a Sustainable Future: Proceedings of the 21st International Conference on Smart Technologies and Education. Series: Lecture Notes in Networks and Systems, 2 (1027). Springer: Cham, pp. 401-410. ISBN 9783031619052 (doi: 10.1007/978-3-031-61905-2_39) Cham, X. T. et al. (2024) AI-Assisted Manual Segmentation Web Application for Geospatial Satellite and Imagery Data. In: IEEE 9th World Forum on Internet of Things, Aveiro, Portugal, 12–27 Oct 2023, ISBN 9798350311617 (doi: 10.1109/WF-IoT58464.2023.10539446) Yong, Kai En, Hui Kieu, Daniel Kim, Goh, Yee Kit, Zhang, XiangHui, Loo, Xian Hui, Tong, Huiqing Glennice, Yau, Peter CY ORCID: https://orcid.org/0000-0001-8431-2770, Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410, Fornace, Kimberly ORCID: https://orcid.org/0000-0002-5484-241X and Hesse, Henrik ORCID: https://orcid.org/0000-0003-0360-2384 (2024) Drone Navigation System for Autonomous Mosquito Sampling in Tree Canopies. In: 2023 IEEE 9th World Forum on Internet of Things (WF-IoT), Aveiro, Portugal, 12-27 Oct 2023, ISBN 9798350311617 (doi: 10.1109/wf-iot58464.2023.10539459) Quek, Ser Wee Darren, Teo, Jared Kai Fu, Louahemmsabah, Nasruddine, Tong, Yap Boon Cyrus, Poh, Aaron Zheng Rong, Cao, Qi ORCID: https://orc",
  "content_length": 36744,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:16"
}