{
  "name": "Peter Dolog",
  "homepage": "https://peterdolog.wordpress.com",
  "status": "success",
  "content": "Peter Dolog Photo: Lars Horn / Baghuset, 29.10.21 Welcome to my academic homepage. I am an Associate Professor of computer science at the Department of Computer Science, Aalborg University. I have lead the IWIS – Intelligent Web and Information Systems research group primarily dealing with Web Science and Engineering. There, my main interest lie in applied machine learning and data mining, personalization, recommendation, user modeling, preferences, and their application in different tasks. Since 2022 I am a member of scientific board of Faculty of Informatics and Statistics, Prague University of Economics and Business as well as a member of PhD Program Board of Applied Informatics. Since 2022 I am also an external mentor for PhD students at KInIT. I am a member of the artificial intelligence and machine learning (AI-ML) team and data, knowledge and web engineering team. I was a member of Database and Web Technologies unit where I have served since September 2020 until January 2022 as a coordinator. Since 2012 until 2015 I served as a member on study board for computer science and since 2012 until 2020 I have been on the department council at the CS department. Between 2015 and 2016 I have served as a research leader and research committee member for machine intelligence area at the CS department. Between 2016 and 2018 I have served as a research leader of Web Science and Engineering area at the CS department and as a member of the research committee for that area. I am a member of ACM Hypertext and Social Media conference steering committee since January 2020 (see also the conference ACM SigWeb page). I am also a senior member of Association of Computer Machinery (ACM), a member of IEEE Computer Society. I was a steering committee member of International Conferences of Web Engineering between 2013 and 2016. I was also a member of  German Society for Computer Science (GI) until 2017. Here is my Google Scholar, DBLP, and AAU institutional publication record. My H-Number from Google Scholar retrieved on 17.2.2023 is 32. Google scholar lists (17.2.2023) me as #31 in the ranked list of researchers in personalization, and #29 in user modeling, #15 in web engineering, #31 in Web Science, and #131 in recommender systems. Visit the web site of IWIS: Intelligent Web and Information Systems group. Visit the web site of ACM HT 2017: The 28th ACM Conference on Hypertext and Social Media where I served as General Chair. Visit the web site of UMAP 2014: International Conference on User Modeling, Adaptation and Personalization where I served as General Chair. Visit the web site of ICWE 2013: International Conference of Web Engieering where I served as General Chair. Find out about other activities at Activities! FINISHED PROJECTS: EU FP7 STREP M-Eco: Medical Ecosystem: Personalized Event-Based Surveillance – Technical director, Principal investigator at Aalborg University, Personalization theme leader, WP5 leader EU FP7 STREP KIWI: Knowledge in a Wiki – Deputy project coordinator, Principal investigator at Aalborg University, Personalization theme leader EU FP7 STREP idSpace: Tooling of and Training for Collaborative Distributed Product Innovation – Principal investigator at Aalborg University, combination of creativity techniques and MDA theme leader EU-IST FP6 Prolearn – NoE on professional learning – project coordinator when at L3S and associate partner at AAU. EU-IST FP5 ELENA – Creating a Smart Space for Learning – workpackage coordinator. FROGS: A Famework for Forward Recovery Web Service Transaction Compensations The ontology for state machines Learner RDF bindings for personalization purposes in open RDF-based networks Short description with RDF schemas can be found at Elena project web site undepersonalization results. The Personal Reader Engine (Learning Service) which interprets UML State Machines adaptively according to learner profiles. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Recent Posts Carlsberg foundation supports my sabbatical in 2022 February 7, 2022 ACM Senior Membership January 4, 2021 Recommender System with Knowledge Graphs May 5, 2020 Best paper award at FLAIRS 2018 May 31, 2018 My former master students win a DBC master thesis prize for 2017 January 29, 2018 Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Subscribe Subscribed Peter Dolog Sign me up Already have a WordPress.com account? Log in now. Peter Dolog Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website Design a site like this with WordPress.comGet started",
  "content_length": 4868,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:17"
}