{
  "name": "Peter J. Funk",
  "homepage": "http://www.es.mdh.se/staff/11-Peter_Funk",
  "status": "success",
  "content": "IDT - ES MDH | IDT | ES | IPR | Admin HomePeoplePublicationsOrganizationProjectsOpen PositionsAbout ESContactNewsEvents MDH Home IDT Home IDT Education Peter Funk, Professor E-mail: peter.funk@mdh.se Room: U1-126 Phone: +46-21-103153 Phone (alt): +46 70-333 9150 Division: Division of Intelligent Future Technologies Research group: Artificial Intelligence and Intelligent Systems Web: Official university homepage Linkedin page BiographyResearchPublicationsProjectsPhD studentsMSc thesesDr Peter Funk is Professor in Artificial Intelligence/Computer Science at Mälardalen University and founded, and is heading the Artificial Intelligence group since 2001. The group was ranked as one of the 6 most productive and successful AI groups in Sweden in VINNOVAs (Sweden’s innovation agency) report to the government April 2018.Peter Funk was nominated 2018 and is listed on IVAs (the Royal Swedish Academy of Engineering Sciences) 100-list of influential researchers in digitalization (based on a set of criteras including innovation potential, productivity, application in society, scientific excelence). Peter has more than 150 scientific publication and more than 2500 citations. Research areas and interest:Applied Artificial Intelligence techniques for industrial, medical and business applications Machine Learning, Case-Based Reasoning and Experience Based Systems Knowledge discovery and Knowledge Sharing SystemsBig Data and Smart Data, Neural nets and Deep learningCapturing and using domain knowledge in hybrid AI systemsUX, natural language processing, conversational systems, Knowledge representations, semantic nets, data mining, ontologies .. Strategy for applying AI Peter Funk on ResearchGate Peter received his Ph.D. from the University of Edinburgh, Department of Artificial Intelligence 1998 funded by the Wallenberg grant for scientific research (the first candidate who received the Wallenberg grant 3 times). Edinburh University is one of the top ranked university’s in the world and was the first university with a department in Artificial Intelligence.Peter is dedicated to perform much applied research and use real problems as a driving force and motivator for new scientific research results. Peter's previous work with R&D in the Computer Science department at Ericsson for more than 7 year (novel applications of artificial intelligence) before perusing his PhD in Edinburgh has given him a strong foundation in applied research.Beside leading and participating in a large number of research projects in the medical, industrial and business area (funded by EU FP7, ITEA2, FFI, KKS, Vinnova, SSF and received granted adding up to more than 4,5 M€). Peter is also active in numerous conferences, program committees, in Editorial board for high ranked international journals (e.g. The International Journal of Artificial Intelligence, Springer). Beside project leader of large national and international projects Peter is also expert advisor/strategist both for companies, industry, funding agencies and research projects (e.g. a 4 M€  Vinnova project Citizen Communication Platform).Peter has a long track record of helping both small innovative companies and large organizations to more efficiently use of artificial intelligence. He uses his creativity and skill in seeing how research results can be adapted and used to solve their challenges in an efficient way, seeing novel and efficient solutions to tasks previously often believed to be to hard to solve using more traditional methods and techniques.Peter was the chair of the Swedish Artificial Intelligence Society 2006 - 2009.Main supervisor for 6 PhD students (all graduated). Assistant supervisor for 3 PhD students. Examination board/external examinerUmeå Universitet,  Chunli Yan, thesis \"Developing Clinical Decision-Support Systems for Learning and Skill Development\", 2018KTH, Hossein Shahrokni,  thesis \"Smart Urban Metabolism - Toward a new understanding of causalities in cities” 2015University College Dublin, Ireland, Zurina Saaya, 2014.MDH, Anna Granlund, 2014Örebro University, Rikard König, 2014Robert Gordon University, Ibrahim Adeyanju, Aberdeen, Scotland, 2011Örebro University, Christoffer Brax, 2011Örebro University, Fredrik Johanssons 2010Luleå University of Technology, Arne Nissen 2009Linköping University, Ulf Johansson 2007KTH, Christopher Johansson 2006MDH, Jenny Nyström 2006Trinity College Dublin, Ireland, Dónal Doyle, 2005.University College Dublin, Irland, Keith Bradley, 2004.Applied Artificial Intelligence techniques for industrial, medical and business  applications Machine Learning, Case-Based Reasoning and Experience Based Systems Knowledge discovery and Knowledge Sharing SystemsBig Data and Smart Data, Neural nets and Deep learningCapturing and using domain knowledge in hybrid AI systemsUX, natural language processing, conversational systems, Knowledge representations, semantic nets, data mining, ontologies .. Strategy for applying AI [Show all publications] [Google Scholar author page] Latest publications: Combining Ontology and Large Language Models to Identify Recurring Machine Failures in Free-Text Fields (Apr 2024) Marcus Bengtsson, Mobyen Uddin Ahmed, Ricky Stanley D Cruze , Peter Funk, Tomohiko Sakao , Rickard Sohlberg Dr H.C. THE 11th SWEDISH PRODUCTION SYMPOSIUM (SPS24) A Case Study on Ontology Development for AI Based Decision Systems in Industry (Jul 2023) Ricky Stanley D Cruze , Mobyen Uddin Ahmed, Marcus Bengtsson, Peter Funk, Rickard Sohlberg Dr H.C., Atiq Ur Rehman 7th International Congress and Workshop on Industrial AI and eMaintenance (IAI) Simulation Environment evaluating AI algorithms for Search Missions Using Drone Swarms (Jul 2023) Nils Sundelius, Peter Funk, Rickard Sohlberg Dr H.C. 7th International Congress and Workshop on Industrial AI and eMaintenance (IAI) Cooperative Search and Rescue with Drone Swarm (Jul 2023) Luiz Giacomossi, Nils Sundelius, José F. B. Brancalion , Marcos R. O. A. Maximo , Peter Funk, Rickard Sohlberg Dr H.C. 7th International Congress and Workshop on Industrial AI and eMaintenance (IAI) Artificial Intelligence-based Life Cycle Engineering in Industrial Production: A Systematic Literature Review (Jan 2023) Hamidur Rahman, Ricky Stanley D Cruze , Mobyen Uddin Ahmed, Rickard Sohlberg Dr H.C., Tomohiko Sakao , Peter Funk Journal of IEEE ACCESS (IEEE ACCESS) Vision-Based Driver’s Cognitive Load Classification Considering Eye Movement Using Machine Learning and Deep Learning (Nov 2021) Hamidur Rahman, Mobyen Uddin Ahmed, Shaibal Barua, Peter Funk, Shahina Begum Special Issue on Deep Learning in Biomedical Informatics and Healthcare (Sensors)Project TitleStatus A Canonical Model of the Primary Visual Cortex finished ADAPT2030, Adaptive lifecycle design by applying digitalization and AI techniques to production - Adapt 2030 finished AIM, Artificial Intelligence in Medical Applications finished AproC, Automated Process Control finished ARCUS, Autonomous reconnaissance capability for unmanned aerial systems active Artificiell Intelligens för att förvandla kvalitetsregister till individanpassat beslutstöd i vården, 2017-01555 finished CREATE ITEA2 finished CTEDS, Cooperative Perimeter Protection with Heterogeneous Drone Swarms active E-MOTIONS finished EKEN-Efficient knowledge and experience reuse within the business world finished El-hybrid hjullastare, Utveckling och analys med avseende på energieffektivitet, säkerhet och körbarhet finished EMOPAC - Evolutionary Multi-Objective Optimization and Its Applications in Analog Circuit Design finished ESS-H - Embedded Sensor Systems for Health Research Profile finished ExAct, Intelligent experience sharing for industrial applications finished Factory in a Box finished GIMME-SPACE finished IMod - Intelligent Concentration Monitoring and Warning System for Professional Drivers finished InMaint - Intelligent Monitoring and Maintenance in Production Industry finished Intelligent Embedded Systems finished IPOS, Integrated Personal Health Optimizing System finished ITS-EASY Post Graduate School for Embedded Software and Systems finished NFFP7-DYMA:System for dynamic matching of aviation maintenance capabilities and tactical needs using machine learning and big data active NovaMedTech finished Pain Out, WP decision support for pain relief finished PROEK, Ökad Produktivitet och Livskvalitet finished SafeDriver: A Real Time Driver's State Monitoring and Prediction System finished Safety Critical Industrial Machine Vision Inspection and Control System (SAFEi) finished SIMMILAR: Systems-of-Systems for Intelligent Manufacturing Maintenance using Industry 4.0, Lean, AI Reasoning finished The Siblings Project finished Tools for analysis of complex software systems finished Underhållsutveckling finished VDM - Vehicle Driver Monitoring finished PhD students supervised as main supervisor: Markus Nilsson (former) Mikael Sollenborn (former) Taha Kahn (former) Tomas Olsson (former) PhD students supervised as assistant supervisor: Hamidur Rahman (former) Shaibal Barua (former) MSc theses supervised (or examined):Thesis TitleStatus available Användarmodeller och beteendeprediktering available Combining Big Data with Domain Knowledge available Decision support in mission planning available Development of a Prototype System for Milling Tool Condition Monitoring available Fallbaserat resonerande för effektiv kunskapshantering i organisationer available Generic case based recommender module using AI and machine learning available Instrument validation available Intelligent sökmaskin för webben available Masters thesis in Algorithms for Recommender System available Similarity learning in case-based reasoning available Simulating Human Interactions with Assembly Processes by using Case-Based Reasoning available Artifact handling or filtering noise from the biological sensor signals EEG and ECG selected USING DOMAIN KNOWLEDGE FUNCTIONS TO ACCOUNT FOR HETEROGENEOUS CONTEXT FOR TASKS IN DECISION SUPPORT SYSTEM FOR ",
  "content_length": 15770,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:28"
}