{
  "name": "Peter Komisarczuk",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/peter-komisarczuk",
  "status": "success",
  "content": "Peter Komisarczuk - Royal Holloway Research Portal View Scopus Profile Peter Komisarczuk Professor Emeritus Professor Information Security, Department of Information Security Phone+44 1784 443089EmailPeter.Komisarczukrhul.acuk TW20 0EX Personal profile Personal profileProf. Peter Komisarczuk B.Sc. M.Sc. Ph.D. CEng is Head of Department for the Information Security Group at Royal Holloway, University of London. He received his B.Sc. and M.Sc. from the University of Nottingham and his Ph.D. from the University of Surrey (1998).Research interestsPeter researches and publishes in the areas of internet security, networks and protocols, next generation networks, cognitive radio, distributed systems and computer science.  Peter has worked in industry in various R&D roles at Ericsson, Fujitsu and Nortel Networks in the areas of next generation 'intelligent networks', access and optical networks and Internet network technology. AffiliationsIn an academic context Peter has worked at Victoria University of Wellington (VUW) 2003-2010 and the University of West London (UWL) 2010-2014. He is a chartered engineer (CEng), a member of the Institution of Engineering and Technology (IET), the Institute of Electrical and Electronics Engineers (IEEE), the British Computer Society (BCS) and the Association for Computing Machinery (ACM). Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research output 67 Conference contribution 9 Article 3 Chapter 1 Book 5 More 1 Commissioned report 1 Other report 1 Other contribution 1 Paper 1 Review article Research output per year Research output per year An Analysis of Phishing Blacklists: Google Safe Browsing, OpenPhish, and PhishTankBell, S. & Komisarczuk, P., 4 Feb 2020, Proceedings of the Australasian Computer Science Week Multiconference 2020, ACSW 2020. Association for Computing Machinery (ACM), p. 1-11 11 p. 3. (ACM International Conference Proceeding Series).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Measuring the Effectiveness of Twitter's URL Shortener (t.co) at Protecting Users from Phishing and Malware AttacksBell, S. & Komisarczuk, P., 4 Feb 2020, Proceedings of the Australasian Computer Science Week Multiconference 2020, ACSW 2020. Association for Computing Machinery (ACM), p. 1-11 11 p. 2. (ACM International Conference Proceeding Series).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution A survey on Reinforcement learning models and algorithms for traffic signal controlYau, K. L. A., Qadir, J., Khoo, H. L., Ling, M. H. & Komisarczuk, P., 1 Jun 2017, In: ACM Computing Surveys. 50, 3, 3068287.Research output: Contribution to journal › Review article › peer-review Challenges in developing Capture-HPC exclusion listsPuttaroo, M., Komisarczuk, P. & Cordeiro De Amorim, R., 2014, p. 334-338. 5 p.Research output: Contribution to conference › Paper › peer-review Challenges in developing Capture-HPC exclusion listsPuttaroo, M., Komisarczuk, P. & Amorim, R. C. D., 2014, Proceedings of the 7th International Conference on Security of Information and Networks, Glasgow, Scotland, UK, September 9-11, 2014. p. 334 1 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution View all 85 research outputs Projects 2 Finished Projects per year Task 1Komisarczuk, P. (PI)UK Government1/02/17 → 31/03/17Project: Research Identifying and Modelling Victim, Business, Regulatory and Malware Behaviours in a Changing Cyberthreat LandscapeKomisarczuk, P. (PI)Eng & Phys Sci Res Council EPSRC30/09/13 → 30/09/17Project: Research Prizes Best PaperBell, S. (Recipient) & Komisarczuk, P. (Recipient), 3 Feb 2020Prize: Prize (including medals and awards) Best Student PaperBell, S. (Recipient) & Komisarczuk, P. (Recipient), 3 Feb 2020Prize: Prize (including medals and awards)",
  "content_length": 4060,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:32"
}