{
  "name": "Peter-Michael Seidel",
  "homepage": "http://www.asecolab.org/people/pseidel",
  "status": "success",
  "content": "ASECOLAB | Peter-Michael Seidel Peter-Michael SeidelAssociate Professor Peter-Michael Seidel is an Associate Professor in the Information and Computer Sciences Department at the University of Hawaii at Manoa. He received BSc and MSc degrees in computer science from the University of Hagen, Germany in 1994 and 1996, and a Dr.-Ing. and a Habilitation degree in computer engineering from the University of the Saarland at Saarbruecken, Germany in 2000 and 2002, respectively. Prior to joining the University of Hawaii, he worked for Advanced Micro Devices as a PMTS design engineer from 2007 to 2012, and he was a faculty member in the Computer Science and Engineering Department at SMU from 2000 to 2007. His research interests include computer arithmetic, computer architecture, formal methods, and hardware security. Catherine MeadowsMember. Interested in algebras and logics of security systems... Christian CollbergMember. Christian's main interest is the Man-At-The-End Attack... Christina VasilakopoulouFormer postdoc. Christina’s interests lie in Category Theory, especially monoidal and enriched categories... Depeng LiMember. Dr. Li's research interests span from secure computation for Internet of Things to privacy at smart homes... Dusko PavlovicFounder. Dusko is interested in security and adaptation... Fred PiperMember. Fred advises across all research areas... Liang-Ting ChenFormer postdoc. Interested in categorical structures in computer science. Muzamil YahiaResearch Student. Interested in cryptography, game theory and algorithmic information theory... Nancy MogireFormer research student. Interested in cryptographic protocols for web applications... Peter-Michael SeidelMember. Interested in computer arithmetic, hardware security, formal methods.... Rui ZhangRui's research interests are security and privacy in wireless/mobile networks... Simon WillertonMember. He now often thinks a lot about category theory and is partly responsible for the Catster YouTube videos on category theory. Tobias HeindelResearch Scholar. Tobias’s research has been revolving around logic, verification, and category theory. Toshiki KataokaResearh student. Toshiki is interested in category theory and categorical logic... Viktor WinschelMember. Viktor is applying categorical tools to macroeconomics... Whitfield DiffieMember. Visiting Professor at Royal-Holloway... Yingfei DongMember. His current research interests are mostly in secure Internet architectures and network security...",
  "content_length": 2492,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:58"
}