{
  "name": "Peter G. Jeavons",
  "homepage": "http://www.cs.ox.ac.uk/peter.jeavons",
  "status": "success",
  "content": "Peter Jeavons | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleEmeritus FacultyPeter JeavonsPeter Jeavons Professor Peter Jeavons Emeritus ProfessorSenior Research Fellow, St Anne's CollegeE: Peter.Jeavons@cs.ox.ac.ukThemes:Algorithms and Complexity TheoryComputational Biology and Health InformaticsCompleted Projects:more…InterestsI'm interested in algorithms and computational complexity. Most of my own research has focused on constraint satisfaction problems. More details about this research can be found on the Constraints Group page. I'm also interested in computational biology. My recent DPhil student, Dan Nichol, was jointly supervised by Alexander Anderson, in the Integrated Mathematical Oncology Lab at the H. Lee Moffitt Cancer Center in Florida. My current DPhil student, Artem Kaznatcheev, is sponsored by Jacob Scott, at the Taussig Cancer Institute in Cleveland, Ohio. Selected PublicationsView AllManage publications Minimal Weighted Clones with Boolean Support Peter G. Jeavons‚ Andrius Vaicenavičius and Stanislav Živný In Takahiro Hanyu, editor, Proceedings of the 46th IEEE International Symposium on Multiple−Valued Logic‚ ISMVL 2016‚ Sapporo‚ Japan‚ May 18−20‚ 2016. Pages 90–95. IEEE Computer Society. May, 2016. Details about Minimal Weighted Clones with Boolean Support | BibTeX data for Minimal Weighted Clones with Boolean Support | Link to Minimal Weighted Clones with Boolean Support Steering Evolution with Sequential Therapy to Prevent the Emergence of Bacterial Antibiotic Resistance Daniel Nichol‚ Peter Jeavons‚ Alexander G. Fletcher‚ Robert A. Bonomo‚ Philip K. Maini‚ Jerome L. Paul‚ Robert A. Gatenby‚ Alexander R.A. Anderson and Jacob G. Scott In PLoS Computational Biology. 2015. Details about Steering Evolution with Sequential Therapy to Prevent the Emergence of Bacterial Antibiotic Resistance | BibTeX data for Steering Evolution with Sequential Therapy to Prevent the Emergence of Bacterial Antibiotic Resistance | DOI (10.1371/journal.pcbi.1004493) Simple Algorithms for Distributed Leader Election in Anonymous Synchronous Rings and Complete Networks Inspired by Neural Development in Fruit Flies Lei Xu and Peter Jeavons In International Journal of Neural Systems. 2015. Details about Simple Algorithms for Distributed Leader Election in Anonymous Synchronous Rings and Complete Networks Inspired by Neural Development in Fruit Flies | BibTeX data for Simple Algorithms for Distributed Leader Election in Anonymous Synchronous Rings and Complete Networks Inspired by Neural Development in Fruit Flies | DOI (10.1142/S0129065715500252) | Link to Simple Algorithms for Distributed Leader Election in Anonymous Synchronous Rings and Complete Networks Inspired by Neural Development in Fruit Flies ActivitiesAlgorithms At LargeConstraint Satisfaction ProblemsCompleted ProjectsGroebner Basis Techniques for Constraint Satisfaction ProblemsComplexity of Valued ConstraintsConstraint Satisfaction for Configuration: Logical Fundamentals, Algorithms, and ComplexityConstraint Network TractabilityPast StudentsArtem KaznatcheevDan NicholJustyna PetkeAndrás SalamonEvgenij ThorstensenLei XuAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3426,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:21"
}