{
  "name": "Peter McBurney",
  "homepage": "https://www.kcl.ac.uk/people/peter-mcburney",
  "status": "success",
  "content": "Peter McBurney | King's College London Skip to main contentProfessor Peter McBurney Professor of Computer ScienceFormer Head of the Department of InformaticsJoint editor in chief of the Knowledge Engineering ReviewFounder and GameMaster (2007-2009), TAC Market Design TournamentResearch interestsComputer scienceContact detailspeter.mcburney@kcl.ac.uk+44 020 7848 1253BiographyResearch Interests Argumentation Autonomous agents Agent communications Cyber-security Decision theory Public engagement Computerphile - Alternative Uses for Blockchain ResearchResearchDistributed Artificial IntelligenceUnderstanding AI in social and economic contexts where an intelligent entity may be interacting with other entitiesKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Finance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Security HubThe Security Hub consolidates the research related to securityTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Cyber Security Research GroupCSRG promotes research into cyber security bringing together experts from diverse disciplines.Centre for Non-Equilibrium Science (CNES)CNES acts as an international hub for cross-disciplinary research in non-equilibrium science. Music Computing LabComputational approaches to creating and understanding music at King's College London.ResearchResearchDistributed Artificial IntelligenceUnderstanding AI in social and economic contexts where an intelligent entity may be interacting with other entitiesKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Finance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Security HubThe Security Hub consolidates the research related to securityTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Cyber Security Research GroupCSRG promotes research into cyber security bringing together experts from diverse disciplines.Centre for Non-Equilibrium Science (CNES)CNES acts as an international hub for cross-disciplinary research in non-equilibrium science. Music Computing LabComputational approaches to creating and understanding music at King's College London.(N)7.15Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 3006,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:36"
}