{
  "name": "Peter J. Rodgers",
  "homepage": "https://www.cs.kent.ac.uk/people/staff/pjr",
  "status": "success",
  "content": "Peter Rodgers - School of Computing - University of Kent Jump to content design1 Peter Rodgers Professor of Visual Computing Research group head (AIDA) Email p.j.rodgers@kent.ac.uk Telephone +44 (0)1227 82 7913 More information Go to google-scholar ORCID iD: 0000-0002-4100-3596 Location Room 229 Kennedy Building University of Kent Canterbury Kent CT2 7FS On this page About Research interests Teaching Supervision Professional About Peter is an academic in the School of Computing, University of Kent. Research interests Peter belongs to the following research groups:Artificial Intelligence and Data Analytics GroupSoftware onlineDover: Scalable Algorithms for Graph Data MiningEulerAPE: Venn-3 with Ellipses AppletExact Euler-3 (and Venn-3) AppletLinear Diagram GeneratorPeter researches the visualisation of diagrams that represent complex interactions. In particular, Euler Diagrams and Graphs have interesting properties and are applied in great variety of areas. He also studies graph data mining methods and applications of artificial intelligence to visualisation and data mining. Schematic VisualizationAs a Royal Society Industrial Fellow, Peter worked in collaboration with INRIX Media. This work developed automatic techniques for drawing public transport schematics, sometimes called the metro map layout problem. The result was a web service allowing schematic layout tools to be accessed remotely, so potentially helping travellers navigate on public transport systems.Euler diagramsTry the 3 Circle Venn Diagram Applet which draws approximately area proportional diagrams. Implemented by Stirling Chow of the University of Victoria, Canada and myself. More accurate diagrams can be drawn with ellipses, see the eulerAPE tool developed by Luana Micallef as part of her PhD studies.The research project Visualization with Euler Diagrams developed new techniques for drawing Euler diagrams and was in collaboration with the University of Brighton. It was funded by the EPSRC.Linear DiagramsA generator for linear diagrams is available, see the Linear Diagram Generator. These diagrams have been shown to be more effective than either Venn or Euler diagrams for representing some set-based problems. Work exploring the practical and theorectical capabilities of linear diagrams is currently under way.Visual LanguagesThe Reasoning with Diagrams project looked at visual methods for representing constraint based languages. It was funded by the EPSRC. For more information visit the Reasoning with Diagrams home page.He has also developed data flow languages and, some time ago, languages based on graph rewriting systems. Teaching Peter has taught at undergraduate and postgraduate level on a variety of subjects over the years. Currently, he is teaching on an undergraduate second year databases module and an MSc web programming module.My ORCID: https://orcid.org/0000-0002-4100-3596 Supervision He is always interested in supervising new research students in the areas related to his research interests, as well as in other research topics related to visualisation. Scholarships, that include both fees and living expenses are available. If you would like to discuss starting a PhD, please email: P.J.Rodgers@kent.ac.uk.Past Research StudentsDominique Tranquille (PhD) 2019 The Effects of Manipulating Graphical Properties of LineSets on User ComprehensionDr Fadi Dib (PhD) 2018 Improved Neighbourhood Search-Based Methods for Graph LayoutDr Robert Baker (PhD) 2017 A Method for Graph Drawing Utilising PatternsDr Andrew Blake (PhD) 2015 The Impact of Graphical Choices on the Perception of Euler DiagramsDr Daniel Chivers (PhD) 2014 Improving Automated Layout Techniques for the Production of Schematic DiagramsDr Luana Micallef (PhD) 2013 Visualizing Set Relations and Cardinalities Using Venn and Euler DiagramsDr Martyn Taylor (PhD) 2012 Planarity Testing by Path AdditionDr Sabrina Panëels (PhD) 2010 Development and Prototyping of Haptic Interactions for Data ExplorationMs Tooba Nasir (MSc by Research) 2009 Sonification of Contour MapsDr Jonathan Stott (PhD) 2008 Automatic Layout of Metro Maps Using Multicriteria OptimisationDr Nadia Boukhelifa (PhD) 2006 Investigating Coordination Aspects of Multiple Views in VisualizationDr Octavian Patrascoiu (PhD) 2005 Model Driven Language Engineering Professional IEEE Computer SocietySoftware online- Dover: Scalable Algorithms for Graph Data Mining - EulerAPE: Venn-3 with Ellipses Applet - Exact Euler-3 (and Venn-3) Applet - Linear Diagram Generator Last updated 15 October 2025",
  "content_length": 4551,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:30"
}