{
  "name": "Peter Knees",
  "homepage": "https://informatics.tuwien.ac.at/people/peter-knees",
  "status": "success",
  "content": "Peter Knees — TU Wien Informatics People Overview Professors Scientific Staff Administrative Staff Student Staff External Lecturers By Responsibilities By Committee By Name Related Guest Professors Honoraries Alumni (LinkedIn) #5qw Peter Knees Associate Prof. Dipl.-Ing. Dr.techn. Research Focus Information Systems Engineering: 70% Visual Computing and Human-Centered Technology: 30% Research Areas Information Retrieval, User interfaces, Music Information Retrieval, Recommender Systems, Artificial Intelligence, Machine Learning Roles Head of Institute Information Systems Engineering, E194 Associate Professor Data Science, E194-04 Curriculum Coordinator Bachelor / Specialization / Artificial Intelligence + Machine Learning Contact peter.knees@tuwien.ac.at +43-1-58801-188312 Favoritenstrasse 11, Room HE0146 vCard from TISS www.ifs.tuwien.ac.at/~knees/ orcid.org/0000-0003-3906-1292 informatics.tuwien.ac.at/people/peter-knees tiss.tuwien.ac.at/person/47426 Courses 2025W Bachelor Thesis for Informatics and Business Informatics / 188.944 / PR Digital Humanism / 194.072 / VU Experiment Design and Execution / 194.192 / VU Interdisciplinary Project in Data Science / 194.147 / PR Introduction to Information Retrieval / 194.166 / VU Project in Computer Science 1 / 194.145 / PR Reproducible Evaluation and Experimentation in Information Retrieval / 194.208 / VU Research seminar for PhD students / 188.081 / SE Seminar for Master Students in Data Science / 180.772 / SE 2026S Digital Humanism for Doctoral Students / 194.178 / VU Project in Computer Science 1 / 194.145 / PR Projects Vienna Doctoral College on Digital Humanism 2024 – 2029 / Vienna Science and Technology Fund (WWTF) Fostering Austria's Innovative Strength and Research excellence in Artificial Intelligence 2024 – 2026 / Austrian Research Promotion Agency (FFG) Publications: 209781 / 210632 / 216865 Humans and Recommender Systems: Towards Mutual Understanding 2021 – 2025 / Austrian Science Fund (FWF) Publications: 150306 / 161680 / 177462 / 177655 / 193567 / 190669 / 191188 / 211127 / 191171 / 193576 / 193569 / 209781 / 209942 / 210045 / 209944 / 209318 / 212628 Digital Humanism Roadmap: Chancen an der Schnittstelle von Innovation und Forschung 2021 – 2023 / Vienna Business Agency (WAW) Publications: 139746 / 175643 DigHumHub 2020 – 2021 / MA 7 der Stadt Wien Automatic recommendation of music tracks and musicians for collaboration in an online jam community 2017 – 2019 / Austrian Research Promotion Agency (FFG) Publications: 142406 / 56721 / 57031 / 57033 / 57035 / 57038 / 57042 / 57190 / 57191 / 57451 / 57452 / 57453 / 57618 / 57622 / 57649 / 86636 / 86810 Publications 2024 MuRS 2024: 2nd Music Recommender Systems Workshop / Ferraro, A., Porcaro, L., Knees, P., & Bauer, C. (2024). MuRS 2024: 2nd Music Recommender Systems Workshop. In T. Di Noia, P. Lops, T. Joachims, K. Verbert, P. Castells, Z. Dong, & B. London (Eds.), RecSys ’24: Proceedings of the 18th ACM Conference on Recommender Systems (pp. 1202–1205). Association for Computing Machinery. https://doi.org/10.1145/3640457.3687097 Project: HumRec (2021–2025) Mission Reproducibility: An Investigation on Reproducibility Issues in Machine Learning and Information Retrieval Research / Staudinger, M., Kern, B. M. J., Miksa, T., Arnhold, L., Knees, P., Rauber, A., & Hanbury, A. (2024). Mission Reproducibility: An Investigation on Reproducibility Issues in Machine Learning and Information Retrieval Research. In Proceedings 2024 IEEE 20th International Conference on e-Science (e-Science). IEEE eScience 2024, Osaka, Japan. IEEE. https://doi.org/10.1109/e-Science62913.2024.10678657 Projects: FAIR-AI (2024–2026) / HumRec (2021–2025) Content-driven music recommendation: Evolution, state of the art, and challenges / Deldjoo, Y., Schedl, M., & Knees, P. (2024). Content-driven music recommendation: Evolution, state of the art, and challenges. Computer Science Review, 51, Article 100618. https://doi.org/10.1016/j.cosrev.2024.100618 Project: HumRec (2021–2025) Enhancing Sequential Music Recommendation with Negative Feedback-informed Contrastive Learning / Seshadri, P., Shashaani, S., & Knees, P. (2024). Enhancing Sequential Music Recommendation with Negative Feedback-informed Contrastive Learning. In T. Di Noia, P. Lops, T. Joachims, K. Verbert, P. Castells, Z. Dong, & B. London (Eds.), RecSys ’24: Proceedings of the 18th ACM Conference on Recommender Systems (pp. 1028–1032). Association for Computing Machinery. https://doi.org/10.1145/3640457.3688188 Download: PDF (575 KB) Project: HumRec (2021–2025) Mosaikbox: Improving Fully Automatic DJ Mixing Through Rule-based Stem Modification And Precise Beat-Grid Estimation / Sowula, R., & Knees, P. (2024). Mosaikbox: Improving Fully Automatic DJ Mixing Through Rule-based Stem Modification And Precise Beat-Grid Estimation. In B. Kaneshiro, G. Mysore, O. Nieto, C. Donahue, C.-Z. A. Huang, J. H. Lee, B. McFee, & M. C. McCallum (Eds.), Proceedings of the 25th International Society for Music Information Retrieval Conference (pp. 850–857). International Society for Music Information Retrieva. https://doi.org/10.5281/zenodo.14877463 Download: Camera Ready Paper (272 KB) Project: HumRec (2021–2025) Digitalisierung und wir: Lehrbuch zum Digitalen Humanismus mit praktischen Übungen / Eichinger, A., Knees, P., & Werthner, H. (Eds.). (2024). Digitalisierung und wir: Lehrbuch zum Digitalen Humanismus mit praktischen Übungen. Residenz. https://doi.org/10.34726/8506 Download: Full Textbook (2.73 MB) Project: FAIR-AI (2024–2026) 2023 Leveraging Negative Signals with Self-Attention for Sequential Music Recommendation / Seshadri, P., & Knees, P. (2023). Leveraging Negative Signals with Self-Attention for Sequential Music Recommendation. In Proceedings of the Music Recommender Systems Workshop (MuRS) at the 17th ACM Recommender Systems Conference (RecSys’23). Music Recommender Systems Workshop at the 17th ACM Recommender Systems Conference (RecSys’23), Singapore, Singapore. Zenodo. https://doi.org/10.5281/zenodo.8372449 Download: PDF (486 KB) Project: HumRec (2021–2025) Digital Humanism and Norms in Recommender Systems / Prem, E., Neidhardt, J., Knees, P., Woltran, S., & Werthner, H. (2023). Digital Humanism and Norms in Recommender Systems. In S. Vrijenhoek, L. Michiels, J. Kruse, A. Starke, J. Viader Guerrero, & N. Tintarev (Eds.), Proceedings of the First Workshop on the Normative Design and Evaluation of Recommender Systems. CEUR-WS.org. https://doi.org/10.34726/8560 Download: PDF (191 KB) Projects: CDL-RecSys (2022–2028) / HumRec (2021–2025) Exploring Effect-Size-Based Meta-Analysis for Multi-Dataset Evaluation / Sertkan, M., Althammer, S., Hofstätter, S., Knees, P., & Neidhardt, J. (2023). Exploring Effect-Size-Based Meta-Analysis for Multi-Dataset Evaluation. In Proceedings of the 3rd Workshop Perspectives on the Evaluation of Recommender Systems 2023 co-located with the 17th ACM Conference on Recommender Systems (RecSys 2023). PERSPECTIVES 2023 - Perspectives on the Evaluation of Recommender Systems Workshop co-located with the 17th ACM Conference on Recommender Systems, Singapore, Singapore. CEUR-WS.org. https://doi.org/10.34726/5352 Download: PDF (461 KB) Project: CDL-RecSys (2022–2028) MuRS: Music Recommender Systems Workshop / Ferraro, A., Knees, P., Quadrana, M., Ye, T., & Gouyon, F. (2023). MuRS: Music Recommender Systems Workshop. In J. Zhang, L. Chen, S. Berkovsky, J.-M. Zhang, T. Di Noia, J. Basilico, L. Pizzato, & Y. Song (Eds.), Proceedings of the Seventeenth ACM Conference on Recommender Systems, Singapore, 18th–22nd September 2023 (pp. 1227–1230). Association for Computing Machinery (ACM). https://doi.org/10.1145/3604915.3608750 Download: PDF (421 KB) Project: HumRec (2021–2025) Connecting Ethnomusicology Data Collections Using Distributed Repositories and Linked Data Technology / Weise, M., Knees, P., Hofmann, A., Ahmedaja, A., Anda Beitāne, & Rauber, A. (2023, May 24). Connecting Ethnomusicology Data Collections Using Distributed Repositories and Linked Data Technology [Conference Presentation]. 3rd Conference of the Portuguese ICTM National Committee, Aveiro, Portugal. https://doi.org/10.34726/4323 Download: PDF (2.18 MB) MILC 2023: 3rd Workshop on Intelligent Music Interfaces for Listening and Creation / Knees, P., & Lerch, A. (2023). MILC 2023: 3rd Workshop on Intelligent Music Interfaces for Listening and Creation. In Companion Proceedings of 2023 28th Annual Conference on Intelligent User Interfaces (IUI 2023 Companion) (pp. 185–186). Association for Computing Machinery. https://doi.org/10.1145/3581754.3584164 Download: PDF (409 KB) Project: HumRec (2021–2025) Digital Humanism: The Time Is Now / Werthner, H., Stanger, A., Schiaffonati, V., Knees, P., Hardman, L., & Ghezzi, C. (2023). Digital Humanism: The Time Is Now. Computer, 56(1), 138–142. https://doi.org/10.1109/MC.2022.3219528 Project: DigHum Roadmap (2021–2023) Recommender Systems: Techniques, Effects, and Measures Toward Pluralism and Fairness / Knees, P., Neidhardt, J., & Nalis-Neuner, I. (2023). Recommender Systems: Techniques, Effects, and Measures Toward Pluralism and Fairness. In H. Werthner, C. Ghezzi, & J. Kramer (Eds.), Introduction to Digital Humanism : A Textbook (pp. 417–434). Springer. https://doi.org/10.1007/978-3-031-45304-5_27 Projects: CDL-RecSys (2022–2028) / HumRec (2021–2025) Listener awareness in music recommender systems: directions and current trends / Knees, P., Schedl, M., Ferwerda, B., & Laplante, A. (2023). Listener awareness in music recommender systems: directions and current trends. In M. Augstein, E. Herder, & W. Wörndl (Eds.), Personalized Human-Computer Interaction (pp. 279–312). DeGruyter Oldenbourg. https://doi.org/10.1515/9783110988567-011 Project: HumRec (2021–2025) Causality Prediction with Neural-Symbolic Systems: A Case Study in Smart Grids / Schreiberhuber, K., Sabou, M., Ekaputra, F. J., Knees, P., Aryan, P. R., Einfalt, A., & Mosshammer, R. (2023). Causality Prediction with N",
  "content_length": 42639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:32"
}