{
  "name": "Peter Stone 0001",
  "homepage": "https://www.cs.utexas.edu/~pstone",
  "status": "success",
  "content": "Peter Stone :: Professor at the University of Texas at Austin, Department of Computer Science News July 2024: Our joint RoboCup team with Josiah Hanna's lab at University of Wisconsin, called WisTex United, won the Challenge Shield competition of the Standard Platform League at RoboCup 2024. July 2024: I was named Chief Scientist of Sony AI. Here's the press release. September 2022: I was honored to be named the Truchard Foundation Chair in Computer Science at UT Austin. February 2022: Along with colleagues at Sony AI, I published a paper that appeared on the cover of Nature on Outracing Champion Gran Turismo Drivers with Deep Reinforcement Learning. September 2021: The One Hundred Year Study on Artificial Intelligence (AI100), of which I'm chair of the Standing Committee, published \"Gathering Strength, Gathering Storms:\", the second AI100 Study Panel Report. [more] I am the founder and director of the Learning Agents Research Group (LARG) within the Artificial Intelligence Laboratory in the Department of Computer Science at The University of Texas at Austin, as well as Department Chair and Founding Director of Texas Robotics. I was a co-founder of Cogitai, Inc. and am now Chief Scientist of Sony AI. My main research interest in AI is understanding how we can best create complete intelligent agents. I consider adaptation, interaction, and embodiment to be essential capabilities of such agents. Thus, my research focuses mainly on machine learning, multiagent systems, and robotics. To me, the most exciting research topics are those inspired by challenging real-world problems. I believe that complete successful research includes both precise, novel algorithms and fully implemented and rigorously evaluated applications. My application domains have included robot soccer, autonomous bidding agents, autonomous vehicles, and human-interactive agents. LARG on social media: See Short, Medium, or Long Professional Bio. CV in PDF or HTML Format (as of Oct '25). Read my Timeline. Experience Research Publications Group Courses & Talks Service Press Fun Contact Copyright © 2009 Peter Stone :: Site by CarlKingCreative :: Useful Links",
  "content_length": 2155,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:48"
}