{
  "name": "Peter Triantafillou",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/peter_triantafillou",
  "status": "success",
  "content": "Peter Triantafillou Skip to main content Skip to navigation Professor, Computer ScienceContact Details: Room 2.28, Mathematical Sciences Building.Email: p dot triantafillou at warwick dot ac dot ukResearch InterestsPeter's interests are in (i) machine unlearning for discriminative and generative models and for various modalities (image, tabular data, text-to-image, and LLMs), (ii) machine learning for and by data systems, (iii) adaptive and scalable machine learning models, and (iv) distributed/federated machine (un)learning. Earlier research focused on large-scale Data Systems, including Distributed Data Management and Analytics, Decentralized Search Engines and Information Retrieval, Social Networks/Systems, Distributed File Systems, Multimedia Systems, Storage Servers, Peer-to-Peer Systems, and Publish-Subscribe / Event-based Systems.Short BioPeter Triantafillou is a Professor of Data Systems at the Department of Computer Science at the University of Warwick. He co-led the PVLDB Reproducibility effort (2018-2023), has been a Fellow of the Alan Turing Institute (2018-2023), a member of the Advisory Board of PVLDB (2019-2023), a member of the Advisory Board of the Huawei Ireland Research Centre (2020-2021) and an Associate Director of the Urban Big Data Research Centre (a national infrastructure for urban data services and analytics). Peter previously has held professorial positions at the University of Glasgow, the University of Patras, the Technical University of Crete, and Simon Fraser University, and held visiting professorships at the Max-Planck Institute for Informatics (2004-2005 and 2012-2013). Peter received his PhD in computer science from the University of Waterloo and was the Department of Computer Science and the Faculty of Mathematics nominee for the Gold Medal for outstanding achievements at the Doctoral level.Peter's papers have won numerous awards, including the most-influential paper award in ACM DEBS 2019, the best paper award at the ACM SIGIR 2016, the best paper award at the ACM CIKM 2006, and the best student paper award at the IEEE Big Data 2018. Peter has served in the Technical Program Committees of more than 150 international conferences and has been the PC Chair or Vice-chair/Associate Editor in several prestigious conferences (including ACM SIGMOD, IEEE ICDE, PVLDB Reproducibility, IEEE DSAA, ACM Middleware, Wise). Currently, Peter is serving as the General Co-Chair for VLDB 2025.Publications M. H. Ashiq, P. Triantafillou, H. Y. Tseng, and G. Chrysos, \"Inducing Uncertainty on Open-Weight Models for Test-Time Privacy in Image Recognition\", 29th Conference on Neural Information Processing Systems, Workshop on Regulatable ML, and Workshop on Reliable ML, December 2025. K. Zhao, M. Kurmanji, G. Barbulescu, E. Triantafillou and P. Triantafillou, \"What Makes Unlearning Hard and What to Do About it\", 28th Conference on Neural Information Processing Systems, (NeurIPS24), December 2024. K. Zhao and P. Triantafillou, \"Scalability of Memorization-Based Machine Unlearning\", NeurIPS24 FITML Workshop. G. Barbulescu and P. Triantafillou, “To Each (Textual Sequence) Its Own: Improving Memorized Data Unlearning in Large Language Models”, In Proc. of International Conference in Machine Learning (ICML24), July 2024. M. Kurmanji, E. Triantafillou, and P. Triantafillou, \"Machine Unlearning in Learned Database Systems: An Experimental Analysis”, In Proceedings ACM SIGMOD Conference on the Management of Data, (SIGMOD24), June 2024. M. Kurmanji, P. Triantafillou, J. Hayes, and E. Triantafillou, \"Towards Unbounded Machine Unlearning\", https://arxiv.org/abs/2302.09880, 27th Conference on Neural Information Processing Systems, (NeurIPS23), December 2023. M. Kurmanji, P. Triantafillou, \"Detect, Distill and Update: Learned DB Systems Facing Out of Distribution Data\", In Proceedings ACM SIGMOD Conference on the Management of Data, (SIGMOD23), June 2023. Shekelyan, G. Cormode, Q. Ma, A.M. Shanghooshabad, P. Triantafillou, “Streaming Weighted Sampling over Join Queries”, In Proceedings EDBT 2023, March 2023. George-Octavian Barbulescu and Peter Triantafillou, \"Anatomy of Learned Database Tuning with Bayesian Optimization\", In Proceedings of 13th International Workshop on Self-Managing Database Systems, (in conjunction with IEEE ICDE 2022), May 2022. Q. Ma and P. Triantafillou, “Query-Centric Regression”, Information Systems, 2022. A.M. Shanghooshabad, M Shekelyan, Q. Ma, M. Kurmanji, M. Almasi, P. Triantafillou, \"PGMJoins: Random Join Sampling with Graphical Models”, In Proceedings ACM SIGMOD Conference on the Management of Data, (SIGMOD21), June 2021. Q. Ma, A.M. Shanghooshabad, M. Kurmanji, M. Almasi, P. Triantafillou, \"Learned Approximate Query Processing: Make it Light, Accurate and Fast\", Accepted to appear, In Proc. 11th Conference on Innovative Data Systems, (CIDR21), January 2021. Video talk available at https://www.youtube.com/watch?v=Ds8lGWLrRh8 F. Savva, C. Anagnostopoulos, and P. Triantafillou, \"Large-scale Data Exploration using Explanatory Regression Functions\", in ACM Transactions on Knowledge Discovery from Data, TKDD, September 2020. F. Savva, C. Anagnostopoulos, and P. Triantafillou, “SuRF: Identification of Interesting Data Regions with Surrogate Models”, In Proc. 36th IEEE International Conference on Data Engineering, (ICDE20), April 2020 F. Savva, C. Anagnostopoulos and P. Triantafillou, “Adaptive Learning of Aggregate Analytics under Dynamic Workloads”, Future Generation Computer Systems, August 2020. Q. Ma and P. Triantafillou, “Query-Centric Regression”, In 22nd International Workshop on Design, Optimization, Languages ​​and Analytical Processing of Big Data (DOLAP 2020), In conjunction with EDBT2020, March 2020. Selected as one of the best papers and invited for journal submission. F. Savva, C. Anagnostopoulos, and P. Triantafillou, “Aggregate Query Prediction under Dynamic Workloads”, In Proc. IEEE International Conference on Big Data, (BigData19), December 2019. Q. Ma and P. Triantafillou, “DBEst: Revisiting Approximate Query Processing with Machine Learning Models”, ACM SIGMOD International Conference on Management of Data, (SIGMOD19) July 2019. Y. Moshfeghi, P. Traintafillou, F. Pollick, “Towards Predicting a Realisation of an Information Need based on Brain Signals”, The Web Conference (WWW19), May 2019. A. Cahsai, C. Anagnostopoulos, N. Ntarmos, and P. Triantafillou, “Revisiting Exact kNN Query Processing with Probabilistic Data Space Transformations”, In Proc. IEEE International Conference on Big Data, (BigData18), December 2018. Acceptance rate: 19%. Best Student Paper Award (among 500+ submissions). F. Savva, C. Anagnostopoulos, and P. Triantafillou, “Explaining Aggregates for Exploratory Analytics”, In Proc. IEEE International Conference on Big Data, (BigData18), December 2018. Acceptance rate: 19%. C. Anagnostopoulos, F Savva, and P. Triantafillou, “Large-scale predictive modelling and analytics through regression queries in data management systems”, Int. Journal of Data Science and Analytics, Springer, 2020. J. Wang, Z Liu, S. Ma, N. Ntarmos, and P. Triantafillou, “GC: A Graph Caching System for Subgraph / Supergraph Queries”, Proceedings of the VLDB Endowment, (PVLDB), vol. 11, no. 12, August 2018. C. Anagnostopoulos, F. Savva, and P. Triantafillou, “Scalable Aggregation Predictive Analytics: A Query-driven Machine Learning Approach”, Applied Intelligence, Volume 48, Issue 9, pp 2546–25671, Sept. 2018. P. Triantafillou, “Towards Intelligent Distributed Data Systems for Scalable Efficient and Accurate Analytics”, In Proc. 38th IEEE International Conference on Distributed Computing Systems (ICDCS18), July 2018. (Vision and Blue Sky Thinking Track). P. Triantafillou, “Data-Less Big Data Analytics (Towards Intelligent Data Analytics Systems)”, In Proc. 34th IEEE International Conference on Data Engineering, (ICDE18), April 2018, (Lightning Talk / Paper). F. Katsarou, N. Ntarmos, P. Triantafillou, “Hybrid Algorithms for Subgraph Pattern Queries in Graph Databases”, In Proc. IEEE International Conference on Big Data, (BigData17), December 2017. Acceptance rate: 18%. C. Anagnostopoulos and P. Triantafillou, “Query-Driven Learning for Predictive Analytics of Data Sub-Spaces Cardinality”, ACM Transactions on Knowledge Discovery from Data, (ACM TKDD), August 2017, Volume 11, Issue 4, 47 pages. Chen, L., Zhang, H., Jose, J. M. , Yu, H., Moshfeghi, Y. and Triantafillou, P. (2017) Topic detection and tracking on heterogeneous information. Journal of Intelligent Information Systems, (doi:10.1007/s10844-017-0487-y) (Early Online Publication). A. Cahsai, N. Ntarmos, C. Anagnostopoulos, and P. Triantafillou, “Scaling k-Nearest Neighbour Queries (the Right Way), in Proc. of the 37th IEEE International Conference on Distributed Computing Systems (ICDCS17), June 2017. C. Anagnostopoulos and P. Triantafillou, “Efficient Scalable Accurate Regression Queries in In-DBMS Analytics”, In Proc. 33rd IEEE International Conference on Data Engineering, (ICDE17), April 2017, Acceptance rate: 18%. F. Katsarou, N. Ntarmos, P. Triantafillou, “Subgraph Querying with Parallel Use of Query Rewritings and Alternative Algorithms”, 20th International Conference on Extending Database Technology, (EDBT17), March 2017. Acceptance rate: 21%. Wang, N. Ntarmos, P. Triantafillou, “GraphCache: A Caching System for Graph Pattern Queries“, 20th International Conference on Extending Database Technology, (EDBT17), March 2017. Acceptance rate: 21%. F. Katsarou, N. Ntarmos, P. Triantafillou, “Towards Hybrid Methods for Graph Pattern Queries”, Sixth International Workshop on Querying Graph Structured Data (GraphQ 2017), with EDBT2017, March 2017. Wang, N. Ntarmos, P. Triantafillou, “Ensuring Consistency in Graph Cache for Graph-Pattern Queries”, Sixth International Workshop on Querying Graph Structured Data (GraphQ 2017), with EDBT2017, March 2017. Y. Moshfeghi, Raoul Rothfeld, L. Azzopardi, P. Triantafillou, “A Task Completion E",
  "content_length": 51864,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:49"
}