{
  "name": "Peter M. Kogge",
  "homepage": "http://www3.nd.edu/~kogge",
  "status": "success",
  "content": "Notre Dame Computer Science and Engineering Dr. Peter M. Kogge McCourtney Professor of Computer Science and Engineering IBM Fellow, IEEE Fellow Department of Computer Science and Engineering University of Notre Dame Notre Dame, IN 46556 phone: (574) 631-6763 fax: (574) 631-9260 email: kogge@cse.nd.edu Education Ph.D. Electrical Engineering, Stanford University, 1973 M.S Systems & Engineering Sciences, Syracuse University, 1970 B.S. Electrical Engineering, University of Notre Dame, 1968 Vitae Dr. Kogge was with IBM, Federal Systems Division, from 1968 until 1994, and was appointed an IBM Fellow in 1993. In 1977 he was a Visiting Professor in the ECE Dept. at the University of Massachusetts, Amherst, and from 1977 through 1994, he was also an Adjunct Professor in the Computer Science Dept. of the State University of New York at Binghamton. In August, 1994 he joined the University of Notre Dame as first holder of the endowed McCourtney Chair in Computer Science and Engineering (CSE). Starting in the summer of 1997, he has been a Distinguished Visiting Scientist at the Center for Integrated Space Microsystems at JPL. He is also the Research Thrust Leader for Architecture in Notre Dame's Center for Nano Science and Technology. For the 2000-2001 academic year he was the Interim Schubmehl-Prein Chairman of the CSE Dept. at Notre Dame. Starting in August, 2001 he is the Associate Dean for Research, College of Engineering. Research Interests His current research areas include massively parallel processing architectures, advanced VLSI technology and architectures, non von Neumann models of programming and execution, parallel algorithms and applications, and their impact on computer architecture. Since the late 1980s' this has focused on single VLSI chip designs integrating both memory and logic into \"Processing In Memory\" (PIM) architectures, direct and efficient software models to support them, and scaling multiple chips to complete systems. This includes not only efficient parallel processing topologies, control strategies, and chip floor plans, but doing so with inherently low power CPU architectures, and for a range of real system applications, from highly scalable deep space exploration to petaflops level supercomputing as part of the HTMT project. Other current work is investigating how PIM-like ideas may port into quantum cellular array logic, where instead of \"Processing-In-Memory\" we have opportunities for \"Processing-In-Wire.\" While at IBM his group designed the first multi-processor PIM device with significant DRAM memory: the EXECUBE chip which integrated 4 Mbits of DRAM with over 100K gates of logic to implement on a single chip a complete 8 way binary hypercube parallel processor which could run in both SIMD and MIMD modes. He also designed and built the RTAIS parallel processor which demonstrated a pure SIMD PIM-like architecture optimized for supporting a LINDA-like parallel processing model, with real time scheduling included. Prior parallel machines included the IBM 3838 Array Processor which for a time was the fastest single precision floating point processor marketed by IBM, and the Space Shuttle Input/Output Processor which has flown on every Shuttle mission, and probably represents the first true parallel processor to fly in space, and one of the earliest examples of multi-threading architectures. His Ph.D. thesis on the parallel solution of recurrence equations was one of the early works on what is now called parallel prefix operations, and applications of those results are still acknowledged as defining the fastest possible implementations with limited fan-in blocks. Grants and Funded Research Sandia National Labs, \"Understanding Performance of New PIM-Based Execution Models,\" 2/1/03 through 12/31/03. DARPA through Cray Inc., \"High Productivity Computing Systems,\" 6/14/02 through 6/30/03. Architectures for trans-Petaflops computers. NSF, \"NIRT: Architectures and Devices for Quantum Dot Cellular Automata,\" 7/15/02 through 7/14/06. Fabrication techniques, experiments, and architectures for complex QCA-based systems. Semiconductor Research Corp., \"Memory Architectures in QCA,\" 9/1/00 through 8/31/03. Design and characterize memory structures developed from QCA devices. DARPA, \"Morphable Computer Architectures for Highly Energy Aware Systems,\" 5/19/00 through 5/18/02. Develop computer architecture where energy/performance characteristics can be shaped to meet available energy profiles, and matching support tools. JPL, \"Quantum dot Cellular Automata Defect Tolerant Architectures,\" 9/1/00 through 8/31/03. Definition of fault models in QCA and architectures that handle them. JPL, \"Phase III HTMT PIM Memory System Design,\" 1/1/00 to 5/31/01. As part of HTMT petaflops project, to more completely design PIM node architectures to implement multi-level smart memory hierarchy and support alternative execution models. DARPA, \"DIVA: Data IntensiVe Architecture,\" 4/98 to 3/01. Joint project with USC/ISI to architect and fabricate a PIM device using leading edge DRAM technology and to construct multi-chip memory systems capable of performing \"in-memory\" access, search, and processing of irregular data structures for data intensive applications. Lockheed Martin, Owego, \"System Concepts for PIM Accelerators,\" 9/1/98 to 8/31/99. Prototype software and applications for EXASPHERE M32R/D based PIM prototype accelerator. JPL, \"Hybrid Technology MultiThreaded (HTMT) System: PIM Based Memory Hierarchy,\" 5/23/97 to 12/31/99. Joint multi-university project to architect complete petaflops-level machine capable of deployment in 2007 timeframe. Lockheed Martin, Owego, \"PIM Prototype System Demonstrator,\" 9/1/97 to 8/31/98. Construction of EXASPHERE: multi M32R/D based \"smart memory\" PCI card. Extension of JPL Grant No. 960587, \"Scalable Spaceborne Computing Using PIM Technology.\" A PIM chip architecture for deep space applications. NSF CDA-9712921, \"From Bits to Chips: A Multidisciplinary Curriculum for Microelectronics System Design Education,\" Sept. 1997 to July 31, 2000. Reworking parts of the undergraduate computer science, computer engineering, and electrical engineering curricula to provide a comprehensive computer design thread that spans from instruction set and compiler issues, through computer organization, to fabrication of complete CMOS microprocessors. NSF ACS96-12028, \"Point Design for 100 TF PIM-based Computers,\" Sept. 1, 1996 to August 31, 1997. Architectural studies of potential machines designed with PIM technology to meet 100 TFs in 2004 timeframe. JPL Grant No. 960587, \"Scalable Spaceborne Computing Using PIM Technology,\" May 15, 1996 to Nov. 15, 1996. Applicability of PIM technology to potentially satisfy deep space exploration platforms. Mayo Foundation/ARPA, \"PIM Based Accelerator Technology Infrastructure,\" May 1, 1996 to May 31, 1997. Identify state of the art in PIM technology and roadblocks to its utilization in accelerators. NEC Research Institute, \"High Speed Content-based Image Retrieval Techniques,\" April 1, 1996 to May 31, 1997. Sizing of potential PIM-based image search engines for very large image database problems. NASA Grant # NAG5-2998, \"Processing-In-Memory Architectures Peta(Fl)ops Computing,\" July, 1995 to July 1996. Design space for PIM technology that is relevant to possible petaflops level computers. NSF Grant #MIP-9503682, \"Architectural Techniques for Inherently Low Power Computers,\" Sept. 1995 to August, 1998. Techniques starting at the instruction set architecture level that allow design of inherently low power computer architectures. Honors and Awards Kaneb Center Teaching Award, 2003 Outstanding CSE Teacher for 2002, Univ. of Notre Dame, CSE Dept. Outstanding CSE Teacher for 1999, Univ. of Notre Dame, CSE Dept. Distinguished Visiting Scientist, Jet Propulsion Lab, July 1997 Daniel Slotnick Award for Most Original Paper, Int. Conf. of Parallel Proc., Aug. 1994 IBM Fellow, 1993 5th Level IBM Invention Plateau, 1992 IBM FSD President's Award for Patented Parallel Processor Architecture Development, 1991 IBM Outstanding Innovation Award for AI Parallel Processor, 1990 IEEE Fellow, 1990 Elected Member, IBM Academy of Technology, 1990 IEEE Distinguished Visitor, 1988-1989 IEEE Senior Member, 1986 IBM Informal Award, B-1B Computer Performance, 1982 IBM Informal Award, Military Computer Family, 1981 Best Paper, 4th International Symposium on Computer Architecture, 1977 IBM Outstanding Innovation Award, 3838 Array Processor, 1976 IBM Outstanding Contribution Award, Space Shuttle IOP, 1974 IBM Informal Award, Space Shuttle Computer, 1973 IBM Resident Fellowship, Stanford Univ., 1970-1972 Summa Cum Laude, Univ. of Notre Dame, 1968 Fr. Steiner Award for Engineering Scholarship, Univ. of Notre Dame, 1968 Professional Societies: IEEE, ACM, AAAI, ASEE Books and Proceedings with Craig S. Lent, et al, \"Quantum-dot Cellular Automata,\" Book Chapter. Kogge, Peter M., Editor, Special Issue on Federal Systems, IBM Journal of Research and Development, March, 1994. Kogge, Peter M., The Architecture of Symbolic Computers, McGraw Hill, NY, 1990 Kogge, Peter M., Editor, Proc. of 1988 Int. Conf. on Parallel Processing, Vol. I, II, and III, Penn State Univ. Press, Aug. 1988 Kogge, Peter M., Apxntektypa Kohbenephhbix EBM, Russian language translation of The Architecture of Pipelined Computers, Radio Moscow, 1985 Kogge, Peter M., The Architecture of Pipelined Computers, McGraw Hill, NY, 1981 Patents and Disclosures Wilkinson, Paul Amba, Dieffenderfer, James Warren, Kogge, Peter M., R. R. Richardson, D. M. Lesmeister, V. J. Smoral, \"Controller for a SIMD/MIMD Array Having an Instruction Sequencer Utilizing a Canned Routine Library,\" US Patent 5,765,012, issued 6/09/98 Wilkinson, Paul Amba, Dieffenderfer, James Warren, Kogge, Peter M., and Nicholas Jerome Schoonover, \"Autonomous SIMD/MIMD processor memory elements,\" US Patent 5,717,944, issued 2/10/98 Barker, Thomas Norman, Kogge, Peter M., et al , \"Advanced p",
  "content_length": 44746,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:35"
}