{
  "name": "Peter A. Flach",
  "homepage": "https://www.cs.bris.ac.uk/~flach",
  "status": "success",
  "content": "Peter Flach Peter A. Flach Professor of Artificial Intelligence Intelligent Systems Laboratory School of Computer Science University of Bristol The Merchant Venturers Building, Room 3.31 Woodland Road Bristol BS8 1UB, United Kingdom Phone: +44-117-95-45162 Fax: +44-117-95-45208 School reception: +44-117-33-15201 Email: Peter.Flach@bristol.ac.uk LinkedIn News | Join our Centre for Doctoral Training in Practice-Oriented Artificial Intelligence | Read our latest paper on Shapley Compositions (presented at ECAI'24) | Check out my recent talks (viewable in browser) | Read our survey on Classifier Calibration (open access) | Check out our Python toolbox for algorithmic fairness, accountability and transparency | Discover Explainability Fact Sheets | Learn how we extended CRISP-DM | Simply Logical is 30 years old, but its Fully Interactive Online Edition is alive and kicking! | Not so new | Watch me discuss our SubSift reviewer matching system for Communications of the ACM | Check out my books on machine learning and Prolog | Find out about Beta Calibration as presented at AISTATS | Find out about Background Check as presented at ICDM | Find out about Precision-Recall-Gain curves as presented at NIPS | Short bio Peter Flach joined the Department (now School) of Computer Science at the University of Bristol in 1997 and was promoted to Professor of Artificial Intelligence in 2003. An internationally leading scholar in the evaluation and improvement of machine learning models, he has also published on mining highly structured data, on knowledge-driven and explainable AI, and on the methodology of data science. His books include Simply Logical: Intelligent Reasoning by Example (John Wiley, 1994; interactive online edition, 2022) and Machine Learning: the Art and Science of Algorithms that Make Sense of Data (Cambridge University Press, 2012), the latter of which has, to date, sold over 20,000 copies and has established itself as a key reference in machine learning with translations into Russian, Mandarin and Japanese. From 2010 until 2020, Prof Flach was Editor-in-Chief of the Machine Learning journal, one of the two top journals in the field that has been published for over 25 years by Kluwer and now Springer-Nature. He was Programme Co-Chair of the 1999 International Conference on Inductive Logic Programming, the 2001 European Conference on Machine Learning, the 2009 ACM Conference on Knowledge Discovery and Data Mining, and the 2012 European Conference on Machine Learning and Knowledge Discovery in Databases in Bristol. He is a founding board member, previous President and current Vice-President of the European Association for Data Science. He is a Fellow of the European Lab for Learning and Intelligent Systems, and of the European Association for Artificial Intelligence. He was the founding director of the UKRI Centre for Doctoral Training in Interactive Artificial Intelligence, and currently directs the UKRI AI Centre for Doctoral Training in Practice-Oriented Artificial Intelligence. Prof Flach has a strong track record of collaborations both in academia and in industry. In Bristol he collaborated with colleagues in Engineering on the SPHERE project, with colleagues in Population Health Science in the MRC-funded Integrated Epidemiology Unit, and others. International collaborations include Monash University, the Polytechnic University of Valencia, the University of Strasbourg, the University of Tartu, and several universities in Brazil. Most recently he led the work package on Network Collaboration in the TAILOR European network of AI excellence centres. Non-academic collaborators include LV=, QinetiQ, and over 20 partners in the Practice-Oriented AI CDT. Prof Flach is a member of the Advisory Board of XMOS. Research interests Classifier evaluation and calibration Human-centred, knowledge-intensive and explainable AI Foundations of data science More info on UoB web site Google Scholar profile Short CV (August 2023) Last changed: 15 October, 2024",
  "content_length": 4014,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:08"
}