{
  "name": "Peter James Stuckey",
  "homepage": "https://research.monash.edu/en/persons/peter-stuckey",
  "status": "success",
  "content": "Peter Stuckey - Monash University View Scopus Profile Peter Stuckey Professor Professor, Department of Data Science & AI https://orcid.org/0000-0003-2186-0459 EmailPeter.Stuckeymonashedu Accepting PhD StudentsPhD projectsDevelopment of high performance discrete optimization solving technologyDevelopment of high-level modelling languages for discrete optimizationMulti-agent path finding problems and extensionsHybrid approaches to solving discrete optimization 1986 …2025 Research activity per year Personal profile BiographyProfessor Peter J. Stuckey is a Professor in the Faculty of Information Technology at Monash University, and project leader in the Data61 CSIRO laboratory. Peter Stuckey is a pioneer in constraint programming, the science of modelling and solving complex combinatorial problems. His research interests include: discrete optimization; programming languages, in particular declarative programming languages;  constraint solving algorithms; bioinformatics; and constraint-based graphics. He enjoys problem-solving in any area, having publications in e.g. databases, timetabling, and system security, and working with companies such as Oracle and Rio Tinto on problems that interest them. Peter Stuckey received a B.Sc and Ph.D both in Computer Science from Monash University in 1985 and 1988 respectively. In 2009 he was recognized as an ACM Distinguished Scientist. In 2010 he was awarded the Google Australia Eureka Prize for Innovation in Computer Science for his work on lazy clause generation. He was awarded the 2010 University of Melbourne Woodward Medal for most outstanding publication in Science and Technology across the university. In 2019 he was elected as a Fellow of the Association for the Advancement of Artificial Intelligence. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Ph.D., On the Foundations of Constraint Logic Programming, MONASH UNIVERSITYAward Date: 21 Sept 1988Computer Science, B.Sc (Hons), MONASH UNIVERSITYAward Date: 1 Mar 1985 Research area keywordsConstraint ProgrammingDiscrete OptimizationProgramming LanguagesLogic ProgrammingPath PlanningProgram Analysis and TransformationBioinformatics Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2000 2020 2021 2025 2028 11 Active 13 Finished Projects per year Google: Improvement to the Minizinc Ecosystem Stuckey, P. (Primary Chief Investigator (PCI)), Tack, G. (Chief Investigator (CI)) & Dekker, J. (Chief Investigator (CI))3/06/25 → 31/12/25Project: Research NLCG: Huub: Next-Gen Lazy Clause GenerationStuckey, P. (Primary Chief Investigator (PCI)), Ignatiev , A. (Chief Investigator (CI)), Dekker, J. (Associate Investigator (AI)) & Zhong, A. (Associate Investigator (AI))14/04/25 → 13/04/26Project: Research Formal Explainability: Formal Explainability for Neuro-Symbolic Artificial IntelligenceStuckey, P. (Primary Chief Investigator (PCI)) & Ignatiev , A. (Chief Investigator (CI))ARC - Australian Research Council12/02/25 → 11/02/28Project: Research Measuring The Birrarung: Data Fusion and OptimisationStuckey, P. (Primary Chief Investigator (PCI)), Satur, P. (Associate Investigator (AI)), Mosienyane, C. (Partner Investigator (PI)) & Whitten, A. (Partner Investigator (PI))ARC - Australian Research Council5/02/25 → 5/02/28Project: Research Development of OPTIMA MicroCert.: Development of OPTIMA MicroCert.Smith-Miles, K. (Primary Chief Investigator (PCI)) & Stuckey, P. (Chief Investigator (CI))25/11/24 → 25/11/27Project: Research View all 24 projects Research output Research output per year 1986 2006 2008 2011 2012 2013 2014 2015 2016 2018 2019 2020 2021 2022 2023 2024 2025 2025 377 Conference Paper 135 Article 10 Chapter (Book) 5 Paper 13 More 4 Foreword / Postscript 3 Book 1 Commissioned Report 1 Other Report 1 Chapter (Report) 1 Comment / Debate 1 Editorial 1 Review Article Research output per year Research output per year Acoustic-to-hyper-spectral: real-time perimeter intrusion detection system monitoring through learnable filters and hyper-spectral image generation from distributed acoustic sensing systemsPierau, R.-E., Katsifolis, J., Meehan, A., Rezatofighi, H. & Stuckey, P. J., 10 Feb 2025, In: Optics Express. 33, 3, p. 4109-4126 18 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) Acoustic-to-Hyper-Spectral: Hyper-Spectral Image Construction from Frequency Spectrums through Simulated AnnealingPierau, R. E., Meehan, A., Rezatofighi, H. & Stuckey, P. J., 2025, Proceedings of the AAAI Conference on Artificial Intelligence. Walsh, T., Shah, J. & Kolter, Z. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 29466-29468 3 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 39, no. 28).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other Open Access Combining Constraint Programming and Metaheuristics for Aircraft Maintenance Routing with a Distribution ObjectiveGjergji, I., Kletzander, L., Bierlee, H., Musliu, N. & Stuckey, P., 2025, Integration of Constraint Programming, Artificial Intelligence, and Operations Research - 22nd International Conference, CPAIOR 2025 Melbourne, VIC, Australia, November 10–13, 2025 Proceedings, Part II. Tack, G. (ed.). Cham Switzerland: Springer, p. 1-17 17 p. (Lecture Notes in Computer Science; vol. 15763).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Concurrent Planning and Execution in Lifelong Multi-Agent Path Finding with Delay ProbabilitiesZhang, Y., Chen, Z., Harabor, D., Le Bodic, P. & Stuckey, P. J., 2025, Proceedings of the AAAI Conference on Artificial Intelligence. Walsh, T., Shah, J. & Kolter, Z. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 23387-23394 8 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 39, no. 22).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access Efficient weighting schemes for auditing instant-runoff voting electionsEk, A., Stark, P. B., Stuckey, P. J. & Vukcevic, D., 2025, Financial Cryptography and Data Security. FC 2024 International Workshops: Voting, DeFI, WTSC, CoDecFin, Willemstad, Curaçao, March 4–8, 2024, Revised Selected Papers. Budurushi, J., Kulyk, O., Allen, S., Diamandis, T., Klages-Mundt, A., Bracciali, A., Goodell, G. & Matsuo, S. (eds.). Cham Switzerland: Springer, p. 18-32 15 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 14746 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other › peer-review 1 Citation (Scopus) View all 540 research outputs Prizes Fellow of the Association for the Advancement of Artificial IntelligenceStuckey, P. (Recipient), 31 Jan 2019Prize: Election to learned society Finalist for the Australian Research Data Commons Eureka Prize for Excellence in Research SoftwareStuckey, P. (Recipient), Tack, G. (Recipient), Dekker, J. (Recipient) & Nguyen, J. (Recipient), 2024Prize: Other distinction Google Australia Eureka Prize for Innovation in Computer ScienceStuckey, P. (Recipient), 2010Prize: Prize (including medals and awards) University of Melbourne Woodward Medal in Science and TechnologyStuckey, P. (Recipient), 2011Prize: Prize (including medals and awards) Activities Activities per year 1998 1998 1998 1 Editorial responsibility Activities per year Journal of Logic Programming (Journal)Marriott, K. (Editor in chief) & Stuckey, P. (Editor in chief)1998Activity: Publication peer-review and editorial work types › Editorial responsibility",
  "content_length": 8346,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:29"
}