{
  "name": "Peter Corke",
  "homepage": "https://research.qut.edu.au/qcr/people/peter-corke",
  "status": "success",
  "content": "Peter Corke - QUT Centre for Robotics Skip to content Dist Prof Peter Corke Home Our People Dist Prof Peter Corke Please enable JavaScript Please enable JavaScript Find Peter Corke onPeter Corke's full profile, contact information and publications are available on: Adjunct Emeritus Distinguished Professor PhD (The University of Melbourne)Peter is a robotics researcher,  educator and writer.  He left full-time university service in January 2024 but maintains a connection to the university and the Centre for Robotics as a distinguished professor emeritus.He was director/codirector of the QUT Centre for Robotics (2020-23), and before that was director of the ARC Centre of Excellence for Robotic Vision (2014-2020).  His research is concerned with robotic perception using vision and force, dynamics and control, and the application of robots to tasks in the mining, agriculture and environmental monitoring sectors.  He has held a number of editorial positions including: editor-in-chief of the IEEE Robotics & Automation magazine; founding editor of the Journal of Field Robotics; founding multi-media editor and executive editorial board member of the International Journal of Robotics Research; member of the editorial advisory board of the Springer Tracts on Advanced Robotics series.His contribution has been recognized by fellowship of the IEEE, the Australian Academy of Technology and Engineering, and the Australian Academy of Science.Peter has served as a consultant to MathWorks (Boston); is currently a technical advisor to LYRO Robotics, Emesent, ARMHub; and chairs the Robotic Council of the Robotics Australia Group.Peter's true passion is robotics education.  He created widely used open-source software (in Python and MATLAB) for teaching and research in robotics and computer vision. He wrote the best selling textbook “Robotics, Vision, and Control”, now in its 3rd edition, and created the Robot Academy. Collectively these assets have taught robotics to millions of students around the world have led to national and international recognition such as the 2017 Australian University Teacher of the Year.Prior to QUT, Peter founded and led CSIRO's Autonomous Systems Laboratory (2004-2009). He received his undergraduate and masters degrees in electrical engineering and PhD in mechanical and manufacturing engineering, all from the University of Melbourne.  He has held visiting positions at Oxford, University of Illinois, Carnegie-Mellon University and University of Pennsylvania.Awards and recognitions2019: Fellow of the Australian Academy of Science2017: Fellow of the Australian Academy of Technology and Engineering, Australian University Teacher of the year.2016: Eureka Prize Finalist (research and innovation in environmental science), COTSBot team.2015: QS-Wharton: Engineering & IT award (gold); Teaching Delivery award (silver).2015: Australian Office for Learning and Teaching Citation for Outstanding Contributions to Student Learning.May 2009: Award in Research and Development for virtual fencing technology, Australian Information Industry Association, Queensland division2008: Award for Excellence in Physical Sciences and Mathematics for Springer Handbook of Robotics, Professional and Scholarly Publishing Division, Association of American Publishers, Inc.June 2008: Finalist (one of five) for the IEEE Robotics and Automation Society Invention & Entrepreneurship Award (LHD project team)Dec 2007: Fellow of IEEE2006: Australian Engineering Excellence award, Engineers Australia (Starbug project team)2006: Innovation award, Engineers Australia, Queensland Engineering Excellence Awards (Starbug project team)1999: Overseas Travel Fellowship, Australian Centre for Field Robotics1996: Finalist (one of five) for the King-Sun Fu Memorial Best Transactions Paper Award, S. Hutchinson, G. Hager, and P. Corke, \"A Tutorial on Visual Servo Control\", IEEE Trans. on Robotics and Automation, Vol. 12, No. 5, Oct. 1996, pp. 651-6701995: QANTAS Rolls-Royce Engineering Excellence Award (SafeTCam project team)1994: The Honda Award for Best Technology Presentation at ISATA (Aachen).Career history2010-: Professor, QUT2008: Transformational Capability Leader; Sensor Networks, CSIRO2007 - 2008: Research theme leader; Sensor Networks, CSIRO2004 - 2007: Research Director, Autonomous Systems Laboratory, CSIRO ICT Centre2003: Senior Principal Research Scientist, CSIRO Division of Manufacturing and Infrastructure Technology1995: Principal Research Scientist, CSIRO Division of Manufacturing Science and Technology1990: Senior Research Scientist, CSIRO Division of Manufacturing Technology1989: Research Scientist, CSIRO Division of Manufacturing Technology1984: Experimental Scientist, CSIRO Division of Manufacturing Technology1982 - 1983: Lecturer in control and computer architecture, Department of Electrical and Electronic Engineering, University of Melbourne.1981:Graduate Research Assistant, Department of Electrical and Electronic Engineering, University of Melbourne. Also held visiting positions at2009,12,13, 15: Mobile Robotics Group at Oxford University.2003: Robotics Institute at Carnegie-Mellon University1999: U. Illinois at Urbana-Champaign1988-1989: the GRASP laboratory at U.PennsylvaniaErdos number (no greater than 3)Erdos -> Goldberg -> Camtepe -> CorkeErdos -> Subbarao -> Vidyasagar -> (Spong|Hutchinson) -> CorkeErdos -> Noga Alon -> Erik Demain -> Daniela Rus -> CorkeWeb linksGoogle Scholar profileQUT Robot AcademyPeter on WikipediaVisual servoing backgroundRandom famous roboticists Projects (Chief investigator)“Dark“ Visual odometry for drone NavigationAustralian Robotic Inspection and Asset Management HubCobot contact tasks through multi-sensory deep learningDeformable/Compliant Object Manipulation with Tactile SensingHigh-speed robotic waste separationHigh-speed vision controlled motion of flexible planar robotic armsManipulation in NatureMobile Manipulation with LogisticsMultiple Manipulator Cooperation and CoordinationOff-road Mobile ManipulationOutdoor litter collectionReal-time semantic perception for autonomous field roboticsRobotic maintenance of equipmentRobust perception in dusty environments for autonomous dronesSubmarine ManipulationTactile SensingTraining Centre for Collaborative Robotics in Advanced ManufacturingVery high-speed dynamic motion planning for arm robots ProjectsACRV Picking BenchmarkAmazon Picking Challenge (2016)Amazon Picking Challenge 2017Antarctic Science for a Sustainable FutureAOS: KelpieDeep Learning for Grasping and ManipulationNovel autonomous robotic weed control to maximise agricultural productivityRheinmetall Defence Australia: Advanced Terrain Detection (ATD)Robotic knee arthroscopyRobotic Vertical Farming SystemsSemi-automated power pole inspectionTactile-based Robotic Manipulation of Delicate Compliant Objects NewsDr Fernando Vanegas Alvarez awarded Advanced Queensland Industry Research Fellowship Grant!Posted: September 19, 2024QCR CI Aaron McFadyen Wins 2024 Australian Museum Eureka Prize!Posted: September 8, 2024From PhD to Lecturer: Dr Jasmin Martin's JourneyPosted: August 18, 2024Recent TweetsFollow @QUTRobotics",
  "content_length": 7157,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:18"
}