{
  "name": "Peter Brass",
  "homepage": "http://www-cs.ccny.cuny.edu/~peter",
  "status": "success",
  "content": "homepage Peter Braß Peter Brass I am Professor of Computer Science at the City College of New York. My interests are problems related to Geometry, Algorithms, Data Structures, including problems in robotic exploration, sensor networks, pursuit games, and other things. If you have a nice problem, you can tell me about it; if you need a nice problem, I can tell you many. I mainly teach Algorithms classes, undergraduate and graduate. From early 2021 until the beginning of March 2025 I was Program Director in the National Science Foundation (NSF), Computer Science Directorate (CISE), Computing and Communication Foundations Division (CCF). My home program was Algorithmic Foundations (AF), of which I was Lead from summer 2023 on, but I served also several other programs, of which I liked robotics (FRR) and REU-Sites best. I very much enjoyed the time at the NSF, but it might be right now (March 2025) less enjoyable. I am always willing to discuss NSF. For my publications, you can look at google scholar dblp an old list which I stopped maintaining, but it contains also the mathematics papers from an earlier time in my career. I have also several books, The Problem Book: P. Brass, W.O.J. Moser, J. Pach: Research Problems in Discrete Geometry, Springer-Verlag 2005, 500 pages, 528 open problems. Since then there has also been a chinese reprint and a japanese and a russian translation of this book. The problem book has a very long back story, and for me it was the high point and end of my discrete geometry period. The Data Structures Book: Peter Brass: Advanced Data Structures, Cambridge University Press 2008, still the only graduate-level book on this fundamental topic of computer science. Please do not download the pirated pdf files you find on the web; this is my work, and as author I protest against people stealing the result of my work. I provide sample implementations of many of the data structures in the book. The History Book: Peter Brass: History of Engineering at the City College of New York. You can buy it on amazon. This book got finished in 2020, just in time for the 100th anniversary of the founding of the School of Engineering at City College. It was about the only thing that happened at that centennial, and the Covid year 2020 was really a bad time to launch a book. But I enjoyed writing it. I am currently gathering material on the history of the computer science directorate at NSF; if that works out, it will be entirely based on public documents. The problem with that is that information now exists only on web pages, and web pages change and disappear. Documenting history becomes a different task in a paperless environment. I have also some abandoned, or at least dormant, book projects, which might be revived if there is interest. Farthest along were the 'Notes on Asymptotic Analysis and Recursion'. They are available as letter-sized and A4-sized ps-file. There is also a book fragment on computer generation of images, with the postscript programming language, or with a raytracer. Here are some examples of images I made: the octahedra packing, the dendrites, the random reflecting ball packing. I still believe in the importance of open problems to guide and shape a field; at some time I would like to write a counterpart of the Problem Book for Computer Science problems. I spent in my pre-NSF years much time with various governance roles; I was in the City College Faculty Senate, the CUNY University Faculty Senate, and many committees. I also was for a year the City College Ombudsperson, but I did not run for re-election; I hope others are doing this job more successful than me. I produced a Report whose issues are still valid. I must express my frustration: after four years at the NSF I came back to CCNY, and nothing changed: same people running the same committees discussing the same issues. There are also many other sides to being a professor; here is a selection. All these are volunteer jobs, unpaid and without release time. I was for five years active as ABET Program Evaluator for Computer Science. The Progam Evaluator receives the self study of a program (about 200 pages), checks it against the ABET standards, cross-checks against web pages and other materials, and finally does a three-day site visit in the fall. For some years I was Deputy Editor-in-Chief of the Journal of Student Research of the School of Engineering. It was a good journal, until it was discontinued for financial reasons. Several years I was coach of a programming contest team for the International Collegiate Programming Contest. In the Greater New York Regionals of 2016, we were the best public university team, ahead of Stony Brook. My office is in NAC 8/216 (the inner office, the outer room does not belong to me). Last revision of this web page February 28, 2025 Peter Brass ( pbrass@ccny.cuny.edu), City College of New York, CUNY Department of Computer Science Convent Avenue at 138th Street New York, NY-10031 USA",
  "content_length": 4984,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:13"
}