{
  "name": "Peter Arbenz",
  "homepage": "https://www.inf.ethz.ch/personal/arbenz",
  "status": "success",
  "content": "Homepage of Peter Arbenz Prof. Dr. Peter Arbenz [retired] Computer Science Department Parallel and High Performance Computing ETH Zürich Universitätstrasse 6 CH-8092 Zürich Switzerland Mobile: +41-78 408 9228 Email: arbenz at inf.ethz.ch Research Interests Numerical Linear Algebra High Performance Computing Parallel and Distributed Computing Computational Science & Engineering Books Peter Arbenz and Wesley Petersen Introduction to Parallel Computing - A practical guide with examples in C February 2004 Oxford University Press Series: Oxford Texts in Applied and Engineering Mathematics No. 9 ISBN: 0-19-851576-6 (hardback), 0-19-851577-4 (paperback) Peter Arbenz, Marcin Paprzycki, Ahmed Sameh, and Vivek Sarin High Performance Algorithms for Structured Matrix Problems Series: Advances in Computation: Theory and Practice No. 2 November 1998, Nova Science Publishers, ISBN 1-56072-594-X Selected Papers and Reports [click here] Lectures / Courses Numerical Methods for Solving Large Scale Eigenvalue Problems (251-0504-00G) 3G (4 ETCS credit points) [Spring semester 2018] This is the last time I teach this course. Seminar in Computational Science (252-5251-00S) 2S (2 ETCS credit points) [Spring semester 2018] with Dr. Panagiotis Hadjidoukas Introduction to Finite Elements and Sparse Linear System Solving (263-5001) 2V1U (4 ETCS credit points) [Fall semester 2017] MATLAB - Einführungskurs (als pdf-file) Topics for master / bachelor theses and term projects I retired end of July 2018. Therefore, I cannot supervise master theses and other projects anymore. Projects Shape optimization and uncertainty quantification in radio frequency structures combined with beam dynamic simulations (2015-2019) A parallel space-time solver for the Navier-Stokes equations with periodic forcing (2013-2017) Efficient and precise simulation of particle accelerators using adaptive meshes (2013-2015) Resonant Lossy Electromagnetic Structures (2008-2012) Micro Finite Element Analysis of Human Bone Structures (2006-2012) A Self Consistent Particle-in-Cell Finite Element Time Domain Solver for Large Accelerator Structures (2007-2011) SNF SCOPES project: Establishing CS&E in Bulgaria and Macedonia (2002-2004) The Remote Computation System (1995-1996) Conferences SIAM Conference on Computational Science & Engineering (SIAM CSE17). Atlanta, USA, February 27-March 3, 2017. International Conference on Computational Science (ICCS) 2017. Zurich, Switzerland, June 12-14, 2017. Platform for Advanced Scientific Computing Conference (PASC 2017). Lugano, Switzerland, June 26-28, 2017. International Conference on Preconditioning Techniques for Scientific and Industrial Applications (Preconditioning 2017). Vancouver, Canada, July 31-August 2, 2017. SPEEDUP Workshop on High-Performance Computing. Bern, Switzerland, August 31 - September 1, 2017. 12th International Conference on Parallel Processing and Applied Mathematics (PPAM 2017). Lublin, Poland, September 10-13, 2017. International Conference on Parallel Computing (ParCo2017). Bologna, IT, September 12-15, 2017. SIAM Conference on Parallel Processing and Scientific Computing (SIAM PP18). Tokyo, Japan, March 7-10, 2018. SIAM Conference on Applied Linear Algebra (SIAM ALA 2018). Hong Kong, China, May 4-8, 2018. International Conference on Numerical Methods for Scientific Computations and Advanced Applications (NMSCAA'18). Hissarya, Bulgaria, May 28-31, 2018. 10th International Workshop on Parallel Matrix Algorithms and Applications (PMAA'18). Zurich, Switzerland, June 27-29, 2018. Platform for Advanced Scientific Computing Conference (PASC 2018). Basel, Switzerland, July 2-4, 2018. High Performance Computing in Science and Engineering (HPCSE 2019) Beskydy Mountains, Czech Republic, May 20-23, 2019. Platform for Advanced Scientific Computing Conference (PASC 2019). Zurich, Switzerland, June 12-14, 2019. 13th International Conference on Parallel Processing and Applied Mathematics (PPAM 2019). Bialystok, Poland, September 8-11, 2019. Modelling 2019. Olomouc, Czech Republic, September 16-20, 2019. Emerging Trends in Applied Mathematics and Mechanics 2020 (ETAMM 2020) . Ostrava, Czech Republic, June 15-19, 2020. (Cancelled due to CoViD19) Seminar on Numerical Analysis (SNA'21). Ostrava, Czech Republic, January 25-29, 2021. Platform for Advanced Scientific Computing Conference (PASC 2021). Geneva, Switzerland, July 5-July 7, 2021. Journals SIAM Journals Online Numerical Linear Algebra with Applications Journal of Parallel and Distributed Computing Parallel Computing Scalable Computing: Practice and Experience (SCPE) Other interesting sites Netlib repository of mathematical software, papers, and databases. NA-Digest The Trilinos Project home page TOP500 Supercomputer Sites Science & Engineering Journal Abbreviations Eric Weisstein's World of Science Wikipedia, die freie Enzyklopädie Last update: Jan 11, 2021",
  "content_length": 4890,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:11"
}