{
  "name": "Peter Baumann 0001",
  "homepage": "http://www.peter-baumann.org",
  "status": "success",
  "content": "Peter Baumann home profile publications research teaching service awards Multi-dimensional array (\"raster\") data occur in various dimensions, be they observed phenomena or generated data sets, e.g., satellite imagery and mapping, geo physics and exploration, document management, medical imagery, engineering data, and statistics data. They usually come in extreme volumes, often Giga- to Petabyte per single object. Welcome, Visitor! you have entered my academic site; see my profile and also the Wikipedia page someone has established. My core research interest is on flexible, scalable services on massive multi-dimensional sensor, image, simulation, and statistics data (often called \"datacubes\" today) in science, engineering, and business. We have developed the rasdaman array analytics engine which effectively has pioneered the research field of Array Databases and Actionable Datacubes, and has received a series of international innovation awards. Based on this experience, I have shaped several Big Data standards, most remarkably the ISO SQL/MDA (Multi-Dimensional Arrays) standard and the OGC/ISO/INSPIRE \"Big Earth Data\" coverage standards suite. As Professor of Computer Science I am heading the Large-Scale Scientific Information Systems research group at Constructor University (formerly: Jacobs University) in Bremen, Germany. Additionally, I am founder and CEO of research spin-off rasdaman GmbH. For our work on rasdaman I have secured overall project funding of 50+ mEuro in total. In teaching, a goal of prime importance is to make students fit for success in industry and science. Virtually yours, ORCID: 0000-0003-3860-4726 member #12210, GI e.V.; senior member, IEEE; member, European Geosciences Union. PS: You expect fancy effects? Javascript, HTML5, X3D, and all that? Dann möchte ich dies zu bedenken geben. Copyright © 2004+ Peter Baumann -- (allow Javascript for mail address) -- tel. +49-173-583 7882 -- Disclaimer",
  "content_length": 1946,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:10"
}