{
  "name": "Peter Thiemann 0001",
  "homepage": "http://www2.informatik.uni-freiburg.de/~thiemann",
  "status": "success",
  "content": "Peter Thiemann Home - Lehre - Forschung - Ausgewählte Veröffentlichungen - Gefundene Veröffentlichungen Informationen Professor für Informatik Leiter des Arbeitsbereichs Programmiersprachen, Institut für Informatik, Technische Fakultät, Universität Freiburg Addresse, Telefon, Fax Mitglied des Prüfungsausschusses Sprechstunde nach Vereinbarung Wissenschaftliche Aktivitäten Publikationen (DBLP) Links Beating the averages Inhaltsverzeichnis und Errata zu \"Grundlagen der funktionalen Programmierung\" (PostScript). Software. WASH: Web Authoring System Haskell : HTML generation, CGI scripts, and Web Programming in Haskell Ebnf2ps : generation of railroad (syntax) diagrams in encapsulated PostScript Quotes I tire so of hearing people say, / Let things take their course. / Tomorrow is another day. / I do not need my freedom when I'm dead. / I cannot live on tomorrow's bread. -Langston Hughes, poet and novelist (1 Feb 1902-1967) If only the sun-drenched celebrities are being noticed and worshiped, then our children are going to have a tough time seeing the value in the shadows, where the thinkers, probers and scientists are keeping society together. -Rita Dove, poet (b. 28 Aug 1952) It's easier to ask forgiveness than it is to get permission. -Grace Murray Hopper, US Navy Rear Admiral (1906-1992) A human being should be able to change a diaper, plan an invasion, butcher a hog, conn a ship, design a building, write a sonnet, balance accounts, build a wall, set a bone, comfort the dying, take orders, give orders, cooperate, act alone, solve equations, analyze a new problem, pitch manure, program a computer, cook a tasty meal, fight efficiently, die gallantly. Specialization is for insects. -Robert Heinlein, writer (1907-1988) You can never understand one language until you understand at least two. -Ronald Searle, artist (1920- ) To know another language is to have a second soul. -Charlemagne, king (742-814) Pedantry and mastery are opposite attitudes toward rules. To apply a rule to the letter, rigidly, unquestioningly, in cases where it fits and in cases where it does not fit, is pedantry... To apply a rule with natural ease, with judgment, noticing the cases where it fits, and without ever letting the words of the rule obscure the purpose of the action or the opportunities of the situation, is mastery. -George Polya, professor of mathematics (1887-1985) Several excuses are always less convincing than one. -Aldous Huxley, novelist (1894-1963) If you don't understand interpreters, you can still write programs; you can even be a competent programmer. But you can't be a master. -Hal Abelson, Foreword to \"Essentials of Programming Languages\" by Friedman, Wand, and Haynes One must be drenched in words, literally soaked in them, to have the right ones form themselves into the proper patterns at the right moment. -Hart Crane, poet (1899-1932) Fun with Translations english: pushdown automaton ->spanish: automata con pila ->english: automaton with battery pila has further interesting meanings like basin or atomic plant Peter Thiemann designed by www.agrafix.net",
  "content_length": 3106,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:50"
}