{
  "name": "Peter Liggesmeyer",
  "homepage": "https://seda.informatik.uni-kl.de/staff-members/prof-liggesmeyer",
  "status": "success",
  "content": "Prof Liggesmeyer HauptnavigationInhalt Lehrstuhl Software Engineering PositionLeiter des Lehrstuhls Software Engineering: Dependability und wissenschaftlicher Leiter des Fraunhofer Instituts für Experimentelles Software Engineering VitaPublikationenForschungsschwerpunkteDependability: safety, security, reliability, availability.Systems engineering of dependable embedded systems.Model-based safety and reliability analysis.Dynamic risk assessment and safety assurance under uncertainty.AnschriftProf. Dr. Peter Liggesmeyer Technische Universität Kaiserslautern Gebäude 32, Raum 425 Postfach 3049 67653 Kaiserslautern DeutschlandKontaktSekretariat: +49 (631) 205-3341 (Claudia Schwager)Fax: +49 (631) 205-3331N. Laxman, C. H. Koo and P. Liggesmeyer,  “U-Map: A Reference Map for Safe Handling of Runtime Uncertainties”, in International Symposium on Model-Based Safety and Assessment Springer, Cham, 2020, pp. 227-241. [doi]2020N. Laxman and P. Liggesmeyer,” Should we “Safely” handle uncertainties at runtime? - A rather seldom asked question”, in the 31st International Symposium on Software Reliability Engineering (ISSRE), 2020. [doi]2020N. Bhardwaj Haupt, P. Liggesmeyer, \"Systematic Specification of a Service Safety Monitor for Autonomous Vehicles\", in 5th Workshop on Critical Automotive Applications: Robustness & Safety, CARS 2019 (EDCC Workshop).  [pdf][doi]2019N. Bhardwaj Haupt, P. Liggesmeyer, \"A Runtime Safety Monitoring Approach for Adaptable Autonomous Systems\", in Computer Safety, Reliability, and Security - SAFECOMP 2019 Workshops, ASSURE, DECSoS, SASSUR, STRIVE, and WAISE, Turku, Finland, September 10, 2019, Proceedings, pp. 166-177. [pdf][doi]2019P. Liggesmeyer, D. Rombach and F. Bomarius, Smart Energy, Berlin, Heidelberg: Springer Berlin Heidelberg, 2019, pp. 335-351. [pdf][doi]2019N. Bhardwaj, P. Liggesmeyer, \"A Conceptual Framework for Safe Reconfiguration in Open System of Systems\", in Proceedings of the 6th International Workshop on Software Engineering for Systems-of-Systems, 2018, pp. 17-20. [pdf][doi]2018P. Liggesmeyer, D. Rombach and F. Bomarius, Smart Energy. Die Digitale Transformation im Energiesektor., Berlin, Heidelberg: Springer, 2018, pp. 347-363. [pdf][doi]2018P. Liggesmeyer, \"Autonome Systeme\", Informatik-Spektrum, vol. 40, no. 5, Oct 2017, pp. 399-399. [pdf][doi]2017S. Müller, P. Liggesmeyer, \"Systematic Composition of Services from Distributed Systems for Highly Dynamic Collaboration Processes\", in International Conference on Computer Safety, Reliability, and Security, 2017, pp. 225-236. [pdf][doi]2017P. Liggesmeyer, Smart Everything - welche Macht hat IT?, W. Blocher, D. Heckmann, H. Zech (Hrsg.): Jahrbuch der Deutschen Gesellschaft für Recht und Informatik (DGRI), Verlag Dr. Otto Schmidt KG, Köln, 2017, pp. 65-70. [doi]2017P. Liggesmeyer, \"Alles 4.0! Oder manchmal doch 3.5?\", Informatik-Spektrum, vol. 40, no. 2, 2017, pp. 210-215. [doi]2017N. Bhardwaj, P. Liggesmeyer, \"A Runtime Risk Assessment Concept for Safe Reconfiguration in Open Adaptive Systems\", in International Conference on Computer Safety, Reliability, and Security, 2017, pp. 309-316. [pdf][doi]2017P. Liggesmeyer, M. Trapp, \"Safety in der Industrie 4.0: Herausforderungen und Lösungsansätze\", in Handbuch Industrie 4.0 Bd.\\, 1: Produktion, 2 ed. B. Vogel-Heuser, T. Bauernhansl, M. ten Hompel, Eds., Berlin: Springer, 2017, pp. 107-123. [doi]2017S. Müller, P. Liggesmeyer, \"Safety Assurance for Emergent Collaboration of Open Distributed Systems\", in Software Reliability Engineering Workshops (ISSREW), 2016 IEEE International Symposium on. [doi]2016S. Müller, P. Liggesmeyer, \"Dynamic Safety Contracts for Functional Cooperation of Automotive Systems\", in International Conference on Computer Safety, Reliability, and Security, 2016, pp. 171-182. [pdf][doi]2016P. Liggesmeyer, \"IoT, Industrie 4.0 und Big Data: Herausforderungen für die Informatik und die GI.\", in GI-Jahrestagung, 2016, pp. 45-46. [pdf]2016M. Roth, A. Hartoyo and P. Liggesmeyer, \"Efficient reachability graph development for qualitive analysis of state/event fault trees\", in Software Reliability Engineering Workshops (ISSREW),  IEEE International Symposium on, 2015, pp. 144-151. [doi]2015C. Schmitt, P. Liggesmeyer, \"A Model for Structuring and Reusing Security Requirements Sources and Security Requirements\", in Proceedings of CRE'15 - 1st Workshop on Continuous Requirements Engineering, T. W. Raimundas Matulevi&269;ius, Ed., CEUR Workshop Proceedings, 2015, pp. 34-43. [pdf]2015P. Liggesmeyer, \"Deutschlands digitale Köpfe\", Informatik-Spektrum, vol. 38, no. 1, Feb 2015, pp. 1-1. [pdf][doi]2015S. Müller, P. Liggesmeyer, \"A Motion Certification Concept to Evaluate Operational Safety and Optimizing Operating Parameters at Runtime\", in International Conference on Computer Safety, Reliability, and Security, 2015, pp. 156-166. [pdf][doi]2015M. Steiner, P. Liggesmeyer, \"Qualitative and Quantitative Analysis of CFTs Taking Security Causes into Account\", in Computer Safety, Reliability, and Security: SAFECOMP Workshops, ASSURE, DECSoS. ISSE, ReSA4CI, and SASSUR, Delft, The Netherlands, September 22, 2015, Proceedings, F. Koornneef, C. van Gulijk, Eds., Cham: Springer International Publishing, 2015, pp. 109-120. [pdf][doi]2015C. Schmitt, P. Liggesmeyer, \"Instantiating a Model for Structuring and Reusing Security Requirements Sources\", in IEEE 2nd Workshop on Evolving Security and Privacy Requirements Engineering, ESPRE 2015, 25 August, 2015, Ottawa, Canada, 2015, pp. 25-30. [doi]2015C. Schmitt, P. Liggesmeyer, \"Getting Grip on Security Requirements Elicitation by Structuring and Reusing Security Requirements Sources\", in Complex Systems Informatics and Modeling Quarterly, 2015, pp. 15-34. [pdf][doi]2015M. Roth, P. Liggesmeyer, \"Sequential Logic for State/Event Fault Trees: A Methodology to Support the Failure Modeling of Cyber Physical Systems\", in Computer Safety, Reliability, and Security: SAFECOMP 2015 Workshops, ASSURE, DECSoS. ISSE, ReSA4CI, and SASSUR, Delft, The Netherlands, September 22, 2015, Proceedings, Cham: Springer International Publishing, pp. 121-132. [pdf][doi]2015P. Liggesmeyer, \"Big Data, Industrie 4.0 und Co.: Wie sich die Welt verändert\", in 45. Jahrestagung der Gesellschaft für Informatik, Informatik 2015, Informatik, Energie und Umwelt, 28. September - 2. Oktober 2015 in Cottbus, Deutschland, pp. 1491. [pdf]2015C. Schmitt, P. Liggesmeyer, \"Implications of the Operational Environmental on Software Security Requirements Engineering\", in Security in Information Systems, D. G. Rosado et al., Eds., SCITEPRESS, 2014, pp. 63-74. [doi]2014P. Liggesmeyer, J. Dörr and J. Heidrich, \"Big Data in Smart Ecosystems\", Informatik Spektrum, vol. 37, no. 2, 2014, pp. 105-111. [pdf][doi]2014P. Liggesmeyer, \"Die Vorstandsperspektive\", Informatik Spektrum, vol. 37, no. 4, 2014, pp. 284-285. [pdf][doi]2014M. Roth, P. Liggesmeyer, \"Qualitative analysis of state/event fault trees for supporting the certification process of software-intensive systems\", in 24th International Symposium on Software Reliability Engineering Workshops (ISSREW), 2013, pp. 353-358. [pdf][doi]2013M. Trapp, D. Schneider and P. Liggesmeyer, \"A safety roadmap to cyber-physical systems\", in Perspectives on the future of software engineering, Springer, 2013, pp. 81-94. [doi]2013M. Steiner, P. Liggesmeyer, \"Combination of Safety and Security Analysis - Finding Security Problems That Threaten The Safety of a System\", in SAFECOMP - Workshop DECS (ERCIM/EWICS Workshop on Dependable Embedded and Cyber-physical Systems) of the 32nd International Conference on Computer Safety, Reliability and Security, M. ROY, Ed..,2013  [pdf]2013M. Roth, P. Liggesmeyer, \"Qualitative Analyse der funktionalen Sicherheit software-intensiver Systeme mittels Zustands/Ereignis-Fehlerbäumen\", in Funktionale Sicherheit, W. A. Halang, Ed., Berlin / Heidelberg, Germany: Springer, 2013, pp. 117-126. [doi]2013M. Roth, P. Liggesmeyer, \"Modeling and Analysis of Safety-Critical Cyber Physical Systems using State/Event Fault Trees\", in SAFECOMP 2013 - Workshop DECS (ERCIM/EWICS Workshop on Dependable Embedded and Cyber-physical Systems) of the 32nd International Conference on Computer Safety, Reliability and Security, M. ROY, Ed.. [pdf]2013P. Liggesmeyer, \"Die Vorstandsperspektive\", Informatik Spektrum, vol. 36, no. 4, 2013, pp. 357-358. [pdf][doi]2013K. Jamboti, P. Liggesmeyer, \"A Framework for Generating Integrated Component Fault Trees from Architectural Views\", in 14th International Symposium on High-Assurance Systems Engineering (HASE), 2012, pp. 114-121. [doi]2012P. Keller, V. Köppen and P. Liggesmeyer, \"Sicherheit in der Fahrzeugtechnik\", OBJEKTSpektrum, vol. 06/12, Jun 2012. [pdf]2012P. Liggesmeyer et al., \"Quality Improvement Through Visualization of Software and Systems\", in Quality Assurance and Management, M. Savsar, Ed., Rijeka, Croatia: InTech, 2012, pp. 315-334. [pdf]2012Y. Yang, P. Keller and P. Liggesmeyer, \"Visual Approach Facilitating the Importance Analysis of Component Fault Trees\", in Computer Safety, Reliability, and Security - SAFECOMP 2012, F. Ortmeier, P. Daniel, Eds., Berlin/Heidelberg, Germany: Springer, pp. 486-497. [doi]2012M. Steiner, P. Keller and P. Liggesmeyer, \"Modeling the Effects of Software on Safety and Reliability in Complex Embedded Systems\", in Computer Safety, Reliability, and Security, F. Ortmeier, P. Daniel, Eds., Springer Berlin Heidelberg, 2012, pp. 454-465. [doi]2012M. Roth, M. Steiner and P. Liggesmeyer, \"Ein Ansatz zur integrierten Sicherheitsanalyse komplexer Systeme\", in Kommunikation unter Echtzeitbedingungen, W. A. Halang, Ed., Berlin / Heidelberg, Germany: Springer, 2012, pp. 109-118. [doi]2012P. Liggesmeyer, \"Die Vorstandsperspektive\", Informatik Spektrum, vol. 35, no. 5, 2012, pp. 329-330. [pdf][doi]2012M. Trapp, T. Kuhn and P. Liggesmeyer, \"Modellbasierte Entwicklung eingebetteter Softwaresysteme\", ELEKTRONIKPRAXIS. Embedded Software, Engineering Report, no. 1, 2011.2011P. Liggesmeyer, \"Architekture",
  "content_length": 25308,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:37"
}