{
  "name": "Peter Lammich",
  "homepage": "https://people.utwente.nl/p.lammich",
  "status": "success",
  "content": "Dr. P. Lammich | People Pages: Find employees & contact details | University of Twente Skip to content EEMCS-CS-FMTZilverling 3037p.lammich@utwente.nl+31534893403Business card My main research interest is the production of verified software by a top-down refinement process. For this, I'm using the theorem prover Isabelle/HOL, for which I have developed the Isabelle Refinement Framework and the Isabelle Collection Framework. It has been used to verify model checkers, and the GRAT unsat verification  tool.I'm developing the Isabelle-LLVM tool, which can be used to refine algorithms down to efficient imperative code. Highlights are efficient verified (parallel) sorting algorithms, and the verified IsaSAT -Solver.For a complete list of publications, see DBLP.Courses academic year 2025/2026Courses in the current academic year are added at the moment they are finalised in the Osiris system. Therefore it is possible that the list is not yet complete for the whole academic year.192199508 - Research Topics CS192199968 - Internship CS201300058 - Research Topics BIT201300059 - Internship BIT201300086 - Research Topics 2 CS201300294 - Master Research SE Computer Science201400171 - Capita Selecta ST201500039 - Security Verification201500371 - Capita Selecta BIT201800524 - Research Topics EIT202001051 - Research Project Core202001486 - Capita Selecta EngD (tailored assignm.)202001522 - Capita Selecta EngD (in-company tr.)202100126 - Interactive Theorem Proving202200133 - Intro Computer Science & Programming202300106 - M12 Research Project TCS202400371 - M12 Research Project Core BIT202500331 - Software DiamondCourses academic year 2024/2025192199508 - Research Topics CS192199968 - Internship CS192199978 - Final Project CS201300058 - Research Topics BIT201300059 - Internship BIT201300086 - Research Topics 2 CS201300294 - Master Research SE Computer Science201400171 - Capita Selecta ST201500039 - Security Verification201500371 - Capita Selecta BIT201800524 - Research Topics EIT202000975 - Algorithms for Creative Technology202001051 - Research Project Core202001444 - Placement Course for Exchange EEMCS202001486 - Capita Selecta EngD (tailored assignm.)202001522 - Capita Selecta EngD (in-company tr.)202001613 - MSc Final Project BIT + CS202100126 - Interactive Theorem Proving202200133 - Intro Computer Science & Programming202300106 - M12 Research Project TCS202400352 - Programming Pearls202400371 - M12 Research Project Core BIT+31534893403 (work)p.lammich@utwente.nlBusiness card (vCard)AddressUniversity of TwenteZilverling (building no. 11), room 3037Hallenweg 197522 NH EnschedeNetherlandsNavigate to locationUniversity of TwenteZilverling 3037P.O. Box 2177500 AE EnschedeNetherlandsOrganisationsFaculty of Electrical Engineering, Mathematics and Computer Science (EEMCS)Computer Science (EEMCS-CS)Formal Methods and Tools (EEMCS-CS-FMT)Digital Society InstituteScan the QR code orDownload vCard",
  "content_length": 2924,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:32"
}