{
  "name": "Peter Karsmakers",
  "homepage": "https://iiw.kuleuven.be/onderzoek/advise/People/PeterKarsmakers",
  "status": "success",
  "content": "Peter Karsmakers — Advise Professor in (embedded) signal processing & machine learning KU Leuven - Geel Campus Kleinhoefstraat 4 - 2440 Geel Belgium Faculty of Engineering Technology Department of Computer Science When pursuing my PhD of engineering science, I was able to delve into the design of learning algorithms for kernel-based models. More specifically, attention was given to algorithms to deliver sparse models based on processing large amounts of data and that allow to perform predictions efficiently. After finishing my PhD in May 2010, I integrated into the MOBILAB research group located on the campus in Geel. In this group traditional signal processing was used to analyse all kinds of sensor data. With the knowledge that I gained during my PhD, I was able to introduce machine learning techniques to this group, which translated into various publications. In 2013 as a post-doc, I co-founded the ADVISE research group at Geel campus together with a few other colleagues. Within this group I developed (from scratch) a application oriented research focus on software, that can be implemented on resource constraint devices, and that automatically attaches semantics to sensor data. With respect to acoustic monitoring for elderly care I closely worked together with prof. Bart Vanrumste. The projects with respect to radar-based monitoring are in collaboration with prof. Dominique Schreurs and prof. Paul Leroux. From February to July 2018 I was a visiting researcher in the IoT team at the Holst institute in Eindhoven, NL. This period was an inspirational period where I obtained different insights on how to manage projects, learned supporting tools to facilitate algorithmic research, and algorithms to interpret environmental data (such as CO2). From 2018 onward I started as an assistant professor at the Department of Computer Science from the KU Leuven which gives me access to all means to further extend this research focus. Since 2014, I acquired around 2.3M euro funding for projects related to acoustic and radar-based monitoring that are in close collaboration with industry. In many of these projects we have worked on setting up proofs-of-concept. When I started as an assistant professor, I joined the DTAI research group. In this group they integrate data-driven (“learning”) and knowledge-driven (“reasoning”) approaches. By including a symbolic layer in-between both approaches prior knowledge can be added to the modeling task which is expected to lower the amount of data needed and giving actionable insights. I recently hired a researcher to study the potential of such an approach in the context of acoustic monitoring.  Recently, I started a research track (and attracted funding) on the use of machine learning to control resonant power converters for the purpose of enhanced efficiency in cooperation with prof. Valentijn De Smedt. From 2001, I was involved in teaching and organized both theory and practice lectures ranging from electronics, (embedded) programming, signal processing, control engineering to databases, big data analysis, and machine learning. I have enjoyed teaching these courses, but I evolved towards a more focused teaching task that mainly ties in with my research expertise. Together with colleagues I also coordinate the bachelor projects where a team of students is assigned a problem definition from (preferably a real) customer. The last 5 years I supervised over 10 master's theses, in which one that was in collaboration with a company lead to a bilateral project. I'm happy to coordinate the work in the DTAI-ADVISE that currently consists out of 10 PhD students and a post-doc. My team works (and worked in the past) on the following projects (divided in 3 tracks): Acoustic monitoring:  in this context the following projects were started: Audio based home monitoring system for the elderly (2012-2015), IWT-SB (111433); Ultrasonic based home monitoring system for the elderly (2013-2016), IWT-SB (121565); SINS: Audio-based classification of human activity patterns using an energy proportional wireless sensor network (2014-2017), IWT-SBO(130006); APsense: Acoustic Presence detection (2016), bilateral contract with industrial partner; PERSES: Multi-modal and self-learning presence detection algorithms (2016-2018), VLAIO-R&D; WATCHDOG, Bringing in Artificial intelligence to context aware systems to enable the Cognitive Home (2019-2021), VLAIO-O&O. PANDA, Monitoring baby sounds (2019-2020), VLAIO-KMO Innovatie; ISAAC, Intelligent Sensors for Anomaly Detection in Harsh Environments (2018-2020), FOD economie; Artificial intelligence in live stock facilities (2019-2022), VLAIO-Baekeland; Algorithm-Hardware Co-Design for Adaptive Embedded Anomaly Detection (2019-2023), PhD funded by company Magics instruments; PLUGNPATCH: Continuous monitoring of cardio-respiratory sounds events (2020-2023), VLAIO-thematische ICON. Radar-based monitoring: in collaboration with prof. Schreurs from ESAT-TELEMIC the following projects got funded: FARADAY: Radar sensor system for real-time fall monitoring (2013-2014), IOF- leverage;  Grace-Age: Self-man. of mental health & well-being in older adults (2016-2018), H2020- EIT; SleepRadar: measuring vital signs in a contactless manner in bed (2017), bilateral contract with industrial partner; NextPerception: Next generation smart perception sensors and distributed intelligence for proactive human monitoring in health, wellbeing, and automotive systems (2020-2023), EU-ECSEL. Smart electronics: in collaboration with prof. De Smedt from the Department of Electrical Engineering we started a new track on developing a design strategy for radiation tolerant robust and highly efficient smart resonant power converters (SMIIRNOV). More details about the projects and a full publication list with preprints can be found here. Social media profiles can be found on linkedin and researchgate. keyboard_arrow_up To homepage kuleuven.be",
  "content_length": 5956,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:31"
}