{
  "name": "Peter W. H. van der Putten",
  "homepage": "https://liacs.leidenuniv.nl/~puttenpwhvander",
  "status": "success",
  "content": "Peter van der Putten Peter van der Putten Machine Learning, AI, AX and creative research Dive in Lorem Lorem Lorem Research As introduced in my welcome statement, my research focusses on questions such as 'How can machines learn from interaction?' or 'Or how can intelligence, or more in general, complex behavior emerge from simple parts?'. This translates into research in data mining and machine learning, as well as in broader creative research. A resulting example of the combination of these two areas can be seen in the image above. This was a MSc Media Technology project in computational creativity by Jules Verdijk. A system was created that evolves abstract paintings, that maximize a specific emotion. We asked people to indicate the emotion associated with paintings from a set of real world abstract paintings, and then classifiers were trained to predict this emotion from lower level image features. These classifiers were then used to evaluate the fitness of newly evolved paintings. For details, see my list of scientific publications and an overview of current and past supervised MSc and Phd thesis research projects. I also write or speak about these topics for general public audiences. Teaching I teach in the Creative Intelligence and Technology (CRIT, formerly Media Technology) MSc program and our BSc AI program at Leiden University. The CRIT MSc is a place where students are encouraged to formulate their own scientific questions, and to translate personal inspirations and curiosities into their own research projects. To answer these questions, students create actual products, because by doing and creating, new scientific insights into the underlying question are encountered. I teach the Artificial Creatures class and act as a coach in the Science to Experience exhibition. Furthermore I teach Orientation AI in our BSc AI and supervise BSc, MSc and Phd thesis research projects. Occasionally, I also give ad hoc or guest lectures or workshops on machine learning, robots or creative research. . Check out Teaching for more detail. Other academic activities I have been on program committees for conferences such as KDD, CIKM, ECMLPKDD, IDA, ECAI, Discovery Science, ICPM, MISDOOM, BNAIC and Benelearn. I was sponsor chair for ECMLPKDD 2013, organized workshops at KDD and PKDD, and organized the Benelearn 2011 (conference chair) and Society and Industry Chair for BNAIC-Benelearn 2020. I have also organized data mining competitions based on The Insurance Company (TIC) Benchmark, which has also been contributed to the UCI KDD repository, as well as the ECMLPKDD 2024 and 2025 Discovery Challenges. I also regularly write and present for the general public. Check out Other Activities for more detail. contact me",
  "content_length": 2750,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:51"
}