{
  "name": "Peter Mooney",
  "homepage": "https://www.cs.nuim.ie/~pmooney",
  "status": "success",
  "content": "Internet homepage of Dr. Peter Mooney, Dept. of Computer Science, Maynooth University, Ireland Dr. Peter Mooney Associate Professor Department of Computer Science, Office 1.36, Eolas Building, North Campus, Maynooth University, Maynooth, Co. Kildare, Ireland. Lat/Long:53.385267,-6.601603 Eircode: W23 F2H6 Ph: +353 (1) 708 3849 Email: peter [DOT] Mooney [AT] mu [DOT] ie My research interests I am a very ambitious and highly motivated researcher and teacher who has an excellent record of scholarly work and publication of international quality. In my career I have developed extensive experience of collaboration with national and international scientific networks, institutions and bodies. I have already become a significant contributor in my field of research and expertise and subsquently have built significant research capacity and integration into scientific networks. I am a passionate user and advocate for Open Source Software and Open Data. My research revolves around spatial data - I'm really interested in applying Computer Science methodologies and approaches to how any type of data with a geographic or spatial component can be: analysed, visualised, checked, re-used, and so on. This incorporates considering data for the challenges around sustainability and protection of the environment. My major research interests are listed below: Volunteered Geographic Information and Citizen Science OpenStreetMap - research on OpenStreetMap data, community, software Open Source Software and Open Data The quality and use of Volunteered Geographic Information by govenments and authoritative agencies Geocomputation: spatial data mining, machine learning with geographical applications and relevance Spatial Databases and management of spatial data ICT for environmental sustainability and protection Artificial Intelligence in Teaching and Learning Artificial Intelligence and the Circular Economy Smart Farming in Ireland Publications and Research Outputs You'll find listings of my publications in the usual places: Google Scholar (Link ), ORCID (Link ), Semantic Scholar (Link ), and the dblp Computer Science bibliography (Link ). If you cannot find a publication attributed to me then just drop me an email. Very happy to share the author version with you. Selected publications from 2025 Harish Sharma and Edgar Galván and Peter Mooney. MultiPath Island-Based Genetic Algorithm for the K-Most Diverse Near-Shortest Paths. Information Sciences (July 2025). https://doi.org/10.1016/j.ins.2025.122495 Luisa Lo Presti and Peter Mooney. Road network simplification to support air quality analysis. Proceedings of the 33rd Annual GIS Research UK Conference (GISRUK), University of Bristol, UK (April 2025). https://doi.org/10.5281/zenodo.15089554 Selected publications from 2024 Harish Sharma and Edgar Galván and Peter Mooney. A parallel genetic algorithm for multi-criteria path routing on complex real-world road networks. Applied Soft Computing (December, 2024). https://doi.org/10.1016/j.asoc.2024.112559 Niloufar Pourshir Sefidi and Peter Mooney. An exploration of the connection between COVID-19 and cardiovascular disease (CVD) in European countries. Journal of Public Health (Berl.) (November, 2024). https://doi.org/10.1007/s10389-024-02372-2 Niloufar Pourshir Sefidi, Amin Shoari Nejad and Peter Mooney. Effects of pandemic response measures on crime counts in English and Welsh local authorities. (Accepted October 2024, to appear) Applied Spatial Analysis and Policy Paddy Gorry and Peter Mooney. RADIAN A tool for generating synthetic spatial data for use in teaching and learning. Cartography and Geographic Information Science, 1–17. https://doi.org/10.1080/15230406.2024.2377981 Luisa Lo Presti and Peter Mooney: Analysis of renewable energy infrastructure representations in OpenStreetMap To appear: State of the Map 2024 Conference Proceedings - Niarobi, Kenya, September 2024. Paddy Gorry and Peter Mooney. A software tool for generating synthetic spatial data for GIS-classroom usage, AGILE GIScience Ser., 5, 26, https://doi.org/10.5194/agile-giss-5-26-2024 Selected publications from 2023 Aibhe Byrne and Peter Mooney \"Exploring the potential impact of ChatGPT on student learning activities\" HCAI-EP 2023: The Human-Centred AI Education & Practice Conference Proceedings, December 2023, Technical University Dublin, Tallagh, Dublin, Ireland. Paper (PDF) Peter Mooney, Wencong Cui, Boyuan Guan, and Levente Juhász. \"Towards Understanding the Spatial Literacy of ChatGPT--Taking a Geographic Information Systems (GIS) Exam.\" GeoAI '23: 6th ACM SIGSPATIAL International Workshopon AI for Geographic Knowledge Discovery Proceedings (to appear - November 2023). GeoAI '23 Harish, Edgar Galvan, and Peter Mooney \"A method for creating complex real-world networks using ESRI Shapefiles MethodX journal https://doi.org/10.1016/j.mex.2023.102426 (2023) Juhász, Levente, Peter Mooney, Hartwig H. Hochmair and Boyuan Guan. “ChatGPT as a mapping assistant: A novel method to enrich maps with generative AI and content derived from street-level photographs.” ArXiv abs/2306.03204 https://doi.org/10.48550/arXiv.2306.03204 (2023) Peter Mooney, Wencong Cui, Boyuan Guan, and Levente Juhász. \"Towards Understanding the Spatial Literacy of ChatGPT--Taking a Geographic Information Systems (GIS) Exam.\" Earth arXiv (2023). https://doi.org/10.31223/X5P38P Pourshir Sefidi, N., Shoari Nejad, A., and Peter Mooney: “An investigation of the effects of lockdowns and COVID-19 vaccinations in Ireland“, AGILE GIScience Ser., 4, 37, https://doi.org/10.5194/agile-giss-4-37-2023 , 2023. Pathan, Muhammad Salman, Edana Richardson, Edgar Galvan, and Peter Mooney. 2023. \"The Role of Artificial Intelligence within Circular Economy Activities—A View from Ireland\" Sustainability 15, no. 12: 9451. https://doi.org/10.3390/su15129451 Paddy Gorry and Peter Mooney. “A Reproducible Approach to Generating Synthetic Spatial Data for Teaching and Learning Purposes”. In Proceedings of 31st GIS Research UK (GISRUK) conference in Glasgow, Scotland. April 2023. Zenodo. https://doi.org/10.5281/zenodo.7825100 . Selected publications from 2022 Oteiza, Tzirath Perez, Peter Mooney and Liadh Kelly. \"Smart City Data in Urban Wellbeing Estimation.\" 2022 IEEE International Smart Cities Conference (ISC2) (2022): 1-4.https://doi.org/10.1109/ISC255366.2022.9921806 Levente Juhász and Peter Mooney, \"“I Think i Discovered a Military Base in the Middle of the Ocean”—Null Island, the Most Real of Fictional Places\" in IEEE Access, vol. 10, pp. 84147-84165, 2022, https://doi.org/10.1109/ACCESS.2022.3197222 Peter Mooney and Marco Minghini. \"Geospatial Data Exchange Using Binary Data Serialization Approaches\" The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences (2022) https://doi.org/10.5194/isprs-archives-xlviii-4-w1-2022-307-2022 Away from academic life .... Whilst not doing my day job you'll find me: running, taking photographs (see my Flickr profile) and enjoying the beauty of the midlands of Ireland, and tending to my vegetable and flower gardens. Running is a particular passion of mine and in the past few years I have set reasonably fast personal bests over different distances on the roads including: 2h:28m for the marathon, 1h:12m for the half marathon, 3h:16m for 50 Kilometers, and 15m:33s for 5KM. Since I started running in 2002 I have completed 94 marathons - which includes over 70 sub 3 hour marathons, 50 sub 2:50 marathons and 26 sub 2:40 marathons.",
  "content_length": 7542,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:37"
}