{
  "name": "Peter Michael Fischer",
  "homepage": "https://www.uni-augsburg.de/de/fakultaet/fai/informatik/prof/dbis/team/fischer",
  "status": "success",
  "content": "Prof. Dr. Peter M. Fischer Lehrstuhl für Datenbanken und Informationssysteme Universität Fakultäten Fakultät für Angewandte Informatik Institut für Informatik Lehrstühle und Professuren der Informatik Datenbanken und Informationssysteme Team Prof. Dr. Peter M. Fischer Prof. Dr. Peter Michael Fischer Lehrstuhlinhaber Lehrstuhl für Datenbanken und Informationssysteme Telefon: +49-821-598-2134 E-Mail: peter.fischer@informatik.uni-augsburginformatik.uni-augsburg.de () Raum: 2051 (N) Sprechzeiten: nach Vereinbarung (vorzugsweise per e-mail) Adresse: Universitätsstraße 6a, 86159 Augsburg Kontakt (.vcf) Lebenslauf Seit Herbst 2017 Lehrstuhlinhaber (W3) für Datenbanken und Informationssysteme an der Universität Augsburg 2011-2017                 Juniorprofessor für Web Science an der Universität Freiburg 2008-2011                 Oberassistent in der Systems Group an der ETH Zürich 2006-2008                 PostDoc in der Systems Group an der ETH Zürich 2006                          Promotion zum Dr. sc. ETH, Thema: „Adaptive Optimization Techniques for Context-Aware Information Filters“ 2004-2006                 Doktorand in der Database and Information Systems Group an der ETH Zürich 2003-2005                 Wissenschaftlicher Angestellter am Lehrstuhl Datenbanken und Informationssysteme an der Universität Heidelberg 2002-2003                 Wissenschaftlicher Angestellter am Lehrstuhl Datenbanken und Informationssysteme an der TU München 2002                          Diplom in Informatik, Nebenfach Wirtschaftswissenschaften an der TU München Forschungsschwerpunkte Analyse (sozialer) Ströme und Graphen Skalierbare (Hauptspeicher)-Datenbanksysteme für temporale Daten Situationsabhängiges, kontextualisiertes Datenmanagement Zusicherungen und Nachvollziehbarkeit von Daten und Operationen Lehrveranstaltungen Kurs Heimateinrichtung Dozent Semester Typ Sprache Publikationen Google Scholar DBLP Publikationen (lokal auf OPUS) Suche Suchbegriff eingeben",
  "content_length": 1974,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:36"
}