{
  "name": "Peter Szolovits",
  "homepage": "http://groups.csail.mit.edu/medg/people/psz",
  "status": "success",
  "content": "Peter Szolovits  CSAIL Clinical Decision Making Group Peter Szolovits CSAIL Clinical Decision Making Group Students (old and current) Research Publications Personal Contact Information: MIT CSAIL Stata Center, 32 Vassar Street, 32-254 Cambridge, MA 02139 (617) 253-3476 psz@mit.edu Assistant: Fern Keniston fernd@mit.edu (617) 253-5860 Accessibility Peter Szolovits is Professor of Computer Science and Engineering in the MIT Department of Electrical Engineering and Computer Science (EECS) and an Associate faculty member in the MIT Institute of Medical Engineering and Science (IMES) and its Harvard/MIT Health Sciences and Technology (HST) program. He is also head of the Clinical Decision-Making Group within the MIT Computer Science and Artificial Intelligence Laboratory (CSAIL). His research centers on the application of AI methods to problems of medical decision making, natural language processing to extract meaningful data from clinical narratives to support translational medicine, and the design of information systems for health care institutions and patients. He has worked on problems of diagnosis, therapy planning, execution and monitoring for various medical conditions, computational aspects of genetic counseling, controlled sharing of health information, and privacy and confidentiality issues in medical record systems. His interests in AI include knowledge representation, qualitative reasoning, and probabilistic inference. His interests in medical computing include Web-based heterogeneous medical record systems, life-long personal health information systems, and design of cryptographic schemes for health identifiers. He teaches classes in artificial intelligence, programming languages, medical computing, medical decision making, knowledge-based systems and probabilistic inference. Prof. Szolovits has served on journal editorial boards and as program chairman and on the program committees of national conferences. He has been a founder of and consultant for several companies that apply AI to problems of commercial interest. He received his bachelor's degree in physics and his PhD in information science, both from Caltech. Prof. Szolovits was elected to the National Academy of Medicine and to Fellowships in the American Association for Artificial Intelligence, the American College of Medical Informatics, the American Institute for Medical and Biological Engineering, and the International Academy of Health Sciences Informatics. He has served as a member of the National Research Council's Computer Science and Telecommunications Board and as a member of the National Library of Medicine’s Biomedical Library and Informatics Review Committee. He was the 2013 recipient of the Morris F. Collen Award of Excellence from the American College of Medical Informatics, which is part of the American Medical Informatics Association. A tribute video was shown at the annual AMIA Symposium in 2013.",
  "content_length": 2935,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:50"
}