{
  "name": "Peter Achten",
  "homepage": "http://www.cs.ru.nl/P.Achten",
  "status": "success",
  "content": "Peter's Home Page Peter Achten Currently I am Universitair Docent (assistant professor) at the department of Software Science, at the Nijmegen Institute for Computing and Information Sciences of the Radboud University Nijmegen. How to reach me E-mail Phone +31 24 3652483 Surface mail Peter Achten Dept. Software Science Institute for Computing and Information Sciences Faculty of Science PO Box 9010 6500 GL Nijmegen The Netherlands Visiting address Faculty of Science Mercator I Toernooiveld 200 6525 EC Nijmegen Office: 01.07 Teaching Activities These are the courses I am involved with this year (2025/2026): Course: Institute: Co-teachers: IBC040 (Functional Programming) Second-year course (6ects) Computing Science Twan van Laarhoven IBC033 (Bachelor thesis) Bachelor course (12ects) Computing Science Perry Groot, Bernadette Smelik I00032 (Advanced Programming)Master course (6ects) Computing Science Sven-Bodo Scholz Some of the courses that I have taught in the past: Imperative Programming; Algoritmen en Programma's; Functional Programming (for AI); GiP2; Systeem Ontwikkeling 1; Integratie Project; Human Machine Interfaces 2; Software Technology 1; Software Technology 2; Quality of Information Systems; Abstraction and Composition in Programming; Advanced Programming; Ontwikkeling van Grote Software Systemen; Compiler Construction. Further Activities Events More information Member programme committee IFL'01. Member programme committee IFL'02. Member programme committee IFL'07. Co-organiser of AFP'08 and TFP'08. Co-chair of TFP'08. Member steering committee TFP (may 2008). Member programme committee IFL'09. Member programme committee and symposium co-chair TFP'09. Member programme committee TFP'10. Member programme committee TFP'11. Member programme committee PPDP'11. Member steering committee AFP. Member programme committee TFP'12. Organizer with Marco T. Morazán of TFPIE'12. Member programme committee TFPIE'13. Co-organizer and member programme committee IFL'13. Member programme committee TFP'14. Member programme committee and co-chair TFPIE'14. Member programme committee WGP'14. Member programme committee IFL'14. Member programme committee TFPIE'15. Member programme committee TFP'17. Member programme committee CSERC'17. Member programme committee TFP'18. Member programme committee IFL'18. Member programme committee CSERC'18. Member programme committee CSERC'19. Organizer with Pieter Koopman of PLNL'19. Member programme committee CSERC'20. Member programme committee TFP'21. Chair TFPIE'21. Organizer and co-chair with Pieter Koopman of IFL'21 Member programme committee TFPiE'22 Member programme committee TFP'23. Organizer with Mart Lubbers and Sven-Bodo Scholz of IFL'24. Member programme committee TFP'25. TFP is a series of international symposia dedicated to promoting new research directions related to the field of functional programming and to investigate the relationships of functional programming with other branches of computer science. It is designed to be a platform for novel and upcoming research, combined with a post-event refereeing process and a formal publication of selected papers as a book. In particular TFP encourages young researchers to present their work at TFP. In recognition of the extra effort spent in giving polished presentations the programme committee of TFP each year gives out a Best Student Paper award. IFL is a series of international symposia that covers all aspects of the implementation and use of functional programming languages, including but not limited to: compilation and interpretation, abstract machine design, parallel and concurrent implementation, automatic program generation, novel applications, tools and techniques, program analysis, runtime profiling, memory management, type checking, computer architectures, array processing, debugging and tracing, language concepts, verification and formal aspects. AFP is a series of international summer schools which aims to bring computer scientists, in particular young researchers and programmers, up to date with the latest advances in practical functional programming. The main focus of the school is on the interface between results presented at programming conferences and the programming in the real world. TFPIE The goal of the International Workshops on Trends in Functional Programming in Education is to gather researchers, professors, teachers, and all professionals that use or are interested in the use of functional programming in education. TFPIE aims to be a venue where novel ideas, classroom-tested ideas, and work in progress on the use of functional programming in education are discussed. The one-day workshop will foster a spirit of open discussion by having a review process for publication after the workshop. The Computer Science Education Research Conference (CSERC) is an international forum for researchers with interests in all aspects of computer science education. It embraces a broad view of current and future trends in computer science education and aspires to be a lively environment for presenting the latest research results. It convenes yearly with a fitting international conference in the field of computer science. The purpose of the new annual PLNL workshop is to bring together researchers in the area of programming languages in the Netherlands. The workshop targets programming language research in the broad sense, included but not limited to the design, implementation, theory, application, and teaching of programming languages. History After my studies in computer science (at the University of Nijmegen) I have been an AiO (PhD student) at the Software Technology department. This resulted in a PhD.Thesis, entitled \"Interactive Functional Programs - models, methods, and implementation\". After this project I have worked as a Tewerkgesteld Erkend Gewetensbezwaarde (no translation available :-)) and researcher at subsequent projects at the department. I have developed a library for the functional programming language Clean to create pure functional programs that employ graphical user interfaces. This library is the Object I/O library (have a look). Now I am Universitair Docent (lecturer). During 2004-2011 I have been bachelor-studieadviseur Informatica (student advisor for Bachelor study of computer science). From 2012-2015 I have been member of the OLC (Programme Committee). I am member of the education board of computer science since december 2015, as coordinator of the bachelor programme for computing science. Research I am interested in the application of functional programming languages on 'real world' problems. These kinds of programs impose typical characteristics on the implementation and design of these languages. My current research interests are: High-level specifications of interactive applications. These can be GUI applications as well as WWW applications. In the past we have developed several high-level GUI libraries, such as the GEC (Graphical Editor Components) for the desktop, iData (interactive Data) for the web. Currently we are working on the iTask system (interactive tasks for dynamic, functional work flow systems) for the web. It has great potential for developing interactive systems in a concise way without the need to artificially break up the application logic in the way that we know from classic GUI tool kits. Task Oriented Programming (TOP) is the paradigm that has evolved from these research activities regarding the iTask system. Verification of interactive applications. We are customed to using equational reasoning when proving properties of functional programs. How does this extend to TOP programs? What testing techniques can be used to verify properties of interactive programs? How can formal artefacts such as functional programs and TOP programs be communicated with end-users / stakeholders? For teaching, I have developed the Soccer-Fun framework. Soccer-Fun is a functional language library developed for teaching functional programming. You can implement the brain of a footballer and create a team of football players and see if your team is the best! Soccer-Fun is open for participation by anybody who likes to contribute. Here is a list of my publications. Bachelor / Master Thesis projects Here is a list of ideas that I'm interested in. It is by no means exhaustive, so if you have another great idea then we can discuss it. Task Oriented Programming (TOP) as a paradigm: how does the TOP paradigm of programming compare to other programming paradigms? In what new way(s) can we construct programs? Task Oriented Programming as a formalism: an operational semantics of iTask is available. How can we use this to reason formally about TOP programs? Task Oriented Applications: with the iTask system distributed, web-based applications can be developed. What new type of applications can now be created? Augmented programming: traditionally, we use text-based editors and IDE's that offer tools for aiding us when developing software. In what ways can smart IDE's enhance this process? You can think of visualization techniques, more feedback during editing, immediate simulation, etc. Programming language concepts in general: programming languages and paradigms keep evolving. What are recent trends and how do they compare with known concepts of programming languages? I am interested in Graphical User Interfaces and how to program them. In the realm of functional programming dozens of approaches have been invented to deal with this. My interest is in comparing, improving, building, applying them. Other interests Running, tennis, billiards, holiday by bicycle/walking, listening to {symphonic, symphonic rock, heavy metal, decent pop} music, reading {science fiction, fantasy, philosophy, comics}, computer games (Witcher, Skyrim (Oblivion, Morrowind), Dragon Age 1/2, Neverwinter Night, Assassin's Creed, F.E.A.R., Thief), board games (Settlers of Catan, Lost Ruins of Arnak), movies {science fiction, fantasy, animati",
  "content_length": 10060,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:10"
}