{
  "name": "Peter Michael Garraghan",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/peter-garraghan",
  "status": "success",
  "content": "Peter Garraghan - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Peter Garraghan Professor in Distributed Systems Research Overview Machine Learning systems, AI Security, Sustainable computing, Distributed Systems Show more… Web Links Mindgard Profile 06/24 - I have multiple PhD positions open in cyber security for AI/GenAI. If interested, kindly reach out to me.Peter Garraghan is a Professor in Distributed Systems, EPSRC Fellow, and CEO of Mindgard. His research expertise is empirically studying and designing secure and sustainable systems at scale (AI/ML systems, Cloud datacentres, core network infrastructure). His research places strong emphasis on system experimentation within both laboratory and production environments. Peter has published over 60 research articles, led software teams to create bleeding-edge technology, has industrial experience building large-scale production distributed systems, and has worked and collaborated internationally with the likes of Microsoft, Nvidia, BT, BBC, Alibaba Group, STFC, CONACYT, UK government, as well as the UK datacenter and defence industry. He is the recipitent of the prestigious EPSRC Fellowship (2021 - 2026), and his research on AI/ML security and sustainable computing has featured in the media including the BBC and the Daily Mail. Research Interests Distributed Systems, Deep Learning systems, Cloud datacentersAI/ML Security, Adversarial Machine LearningSustainable & energy-efficient computing at scale Qualifications Ph.D. in Computer Science (University of Leeds, UK) PhD Supervision Interests I am happy to explore and supervise topics within distributed systems, AI/ML systems, AI security, and energy-aware computing. If you have your own ideas for a research project you would like to pursue, feel free to contact me to discuss further. I currently have multiple fully funded positions open. Show less Publications Projects PhD Students Research Groups Uncovering Mitigation Effectiveness for Cyber Attacks Against AI Systems 02/01/2025 → 31/03/2025 Research An Extraction Attack Targeting DL Model Architectures via Inferring TVM Auto- tuning Network Characteristics 01/01/2025 → 31/03/2025 Research SL: National Edge AI Hub for Real Data: Edge Intelligence for Cyber-disturbances and Data Quality 01/02/2024 → 31/01/2029 Research HTTP version 3 for unicast delivery of video services over the Internet 01/01/2023 → 31/03/2027 Research DSI: Reducing the Global ICT Footprint via Self-adaptive Large-scale (DCMS Supplement) 01/12/2022 → 31/05/2023 Research DSI:SL: The Security Gene: Discovering Embedded Commonalities within Adversarial Machine Learning 16/11/2022 → 31/03/2023 Research PINCH: Cyber Security Threat Assessment for AI: phase 2 26/09/2022 → 28/02/2023 Research MSI: Ultralow-power, Non-volatile, Random Access Memory Arrays for Data centers and Space Applications (ULTRARAM) 01/06/2022 → 30/06/2025 Research SL: PINCH: An End-to-end Cyber Security Technology to Better Understand the Risks of Deep Learning Model Stealing 01/04/2022 → 31/07/2022 Research ICASE: Sustainable Workload Scaling in Distributed Network Infrastructure (Matthew Hodkin) 01/10/2021 → 30/09/2025 Research Reducing the Global ICT Footprint via Self-adaptive Large-scale ICT Systems 01/06/2021 → 31/05/2026 Research Future Places: A Digital Economy Centre on Understanding Place Through Pervasive Computing 01/10/2020 → 28/02/2026 Research Investigation of intelligent Controller for indirect Heaters on Gas Networks 01/06/2018 → 15/07/2018 Research Pin the Tail: Understanding Straggler Manifestation in Internet-based Distributed Systems 01/09/2017 → 30/11/2019 Research Marta Adamska PhD student enable JavaScript to view email address Lewis Birch PhD student Security Lancaster, Security Lancaster (Secure Machine Learning and Intelligence), Security Lancaster (Systems Security) enable JavaScript to view email address William Hackett PhD student Security Lancaster, Security Lancaster (Secure Machine Learning and Intelligence) enable JavaScript to view email address Matthew Hodkin PhD student enable JavaScript to view email address Daria Smirnova PhD student, Associate Lecturer enable JavaScript to view email address Stefan Trawicki PhD student Security Lancaster, Security Lancaster (Secure Machine Learning and Intelligence) enable JavaScript to view email address DSI - Foundations MSF Supervisors 2019/20 SCC (Distributed Systems) SCC (Security) Security Lancaster Security Lancaster (Distributed Systems) Security Lancaster (Secure Machine Learning and Intelligence) Security Lancaster (Software Security) Sustainable Computing Back to listing Contact Details Department: Computing and Communications Office: B26, B - Floor, InfoLab21 TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 5052,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:36"
}