{
  "name": "Peter Sestoft",
  "homepage": "http://www.itu.dk/people/sestoft",
  "status": "success",
  "content": "Peter Sestoft Peter Sestoft I am professor at the IT University of Copenhagen, where my interests include functional and managed object-oriented programming languages and their implementation, parallel programming, software development and more. See also my CV. My programs and systems Funcalc, a spreadsheet with user-defined functions. Release September 2014. The C5 generic collection library for C# and CLI. Version 2.0.0 released May 2011. Moscow ML, a light-weight implementation of the elegant functional language Standard ML. Runtime code generation in the Java Virtual Machine and Microsoft Common Language Runtime. Biosequence analysis, a pedagogical implementation of algorithms from a textbook; Dina workshop version. KVL Aminosequencer, a program for de novo protein sequencing from tandem mass spectra. Lambda calculus reducer, a simple tool for visualizing various reduction strategies in the untyped lambda calculus. (A Raspberry Pi Linux server that runs some scripts mentioned above). My books, papers and so on Sestoft: Programming Language Concepts, Second edition, with a chapter by Niels Hallenberg. Springer, September 2017. Sestoft: Java Precisely: a concise quick reference to the Java programming language (MIT Press 2002; second edition MIT Press 2005; third edition MIT Press 2016). The book's page at MIT Press. A 2016 translation into English of Corrado Böhm's 1951 PhD dissertation: Digital computers. On encoding logical-mathematical formulas using the machine itself during program conception. Sestoft: Spreadsheet Implementation Technology. Basics and Extensions. MIT Press, August 2014. The book's page at MIT Press. Sestoft, Hansen: C# Precisely: a concise quick reference to the C# programming language. MIT Press, Second edition, February 2012. Jagger, Perry, Sestoft: C# Annotated Standard (Morgan Kaufmann 2007). See Amazon.com. Jones, Gomard, Sestoft: Partial Evaluation and Automatic Program Generation. Full text available online. (Prentice-Hall International 1993). Gansner and Reppy, editors: Standard ML Basis Library (Cambridge University Press 2004). External pages: Amazon author page and Twitter account. List of all publications. What am I doing Research project Popular Parallel Programming (P3) 2015-2018 with Aalborg University, supported by The Danish Research Council for Independent Research: Technology and Production, DFF-FTP. 2016 Workshop on Software Engineering Methods for Spreadsheets (SEMS), co-located with STAF 2016 in Vienna, Austria. Research project Actulus 2011-2015 with Edlund A/S and Department of Mathematics, Copenhagen University, supported by the Danish Advanced Technology Foundation. Past research projects Tools and Methods for Scalable Software Verification, with Lars Birkedal and Evolvable Software Products with Yvonne Dittrich. Head of the IT University's Software and Systems Section, and contact person for the Software Development Group. Contact person for the Programming Language Specialization of the Software Development MSc program. Teaching at ITU: Practical Concurrent and Parallel Programming (PCPP) (MSc) (E2016), Functional Programming (BFNP) (BSc) (F2016) MSc projects, BSc projects. Lecture notes using Java (in PDF): Systematic software testing and Searching and sorting and Grammars and parsing (the latter also exists in a Standard ML version and an F# version). How to create lecture slides and notes in PDF using LaTeX (in Danish). Random personal and/or fun stuff. Background I'm a graduate of computer science and mathematics (MSc 1988, PhD 1991) from the University of Copenhagen computer science department DIKU, more precisely the programming language group TOPPS. From 1992 to 1994 I was at the Department of Information Technology at the Technical University of Denmark, and from 1995 to 2007 at the Royal Veterinary and Agricultural University in Copenhagen, and also at the IT University of Copenhagen since its creation in 1999. From October 1994 to June 1995 I visited AT&T Bell Laboratories in Murray Hill, New Jersey, USA. From October to December 2001 I visited Microsoft Research, Cambridge UK. From March to July 2009 I visited Harvard School of Engineering and Applied Sciences. From 2017 to 2024 I was head of the the Computer Science Department at the IT University. Address E-mail: sestoft@itu.dk and sestoft@gmail.com Office: IT University of Copenhagen, room 4F25, desk 4T089, Emil Holms Kanal 20 Main address: Rued Langgaards Vej 7, DK-2300 Copenhagen S, Denmark. Tel: +45 7218 5083. Fax: +45 7218 5001. Peter Sestoft 1995, 2025-03-31",
  "content_length": 4563,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:49"
}