{
  "name": "Peter Tino",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/tino-peter-cs.aspx",
  "status": "success",
  "content": "Professor Peter Tino - School of Computer Science - University of Birmingham Professor Peter Tino School of Computer ScienceProfessor of Complex and Adaptive Systems Contact details Telephone+44 (0) 121 414 8558Emailp.tino@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Peter Tiňo is a Professor of Complex and Adaptive Systems at the School of Computer Science at the University of Birmingham. He is the author of over 160 research articles in the areas of dynamical systems, machine learning, natural computation and fractal geometry. Peter has been awarded three outstanding Journal Paper of the Year awards and the Head of School's Excellence in Teaching Award. Professor Tiňo is a co-supervisor of ECOLE, an Innovative Training Network (ITN) for early stage researchers (ESRs) funded by the EU’s Horizon 2020 research and innovation program under grant agreement No.766186. It is based on novel synergies between nature inspired optimisation and machine learning. The training programme will be targeted at the automotive industry and ESRs employed on the program will be provided with the transferable skills necessary for thriving careers in emerging and rapidly developing industrial areas. Please follow the link below to find out more about Professor Tiňo's work: Professor Tiňo's-personal web page After finishing his university studies in Slovakia, Peter managed to secure Fulbright scholarship to finalize his PhD work on dynamical systems at the NEC Research Institute in Princeton, USA. Returning back home, after a brief spell at the Slovak University of Technology, he worked as a research fellow in Vienna at the Austrian Research Institute for AI on predictive machine learning models for option pricing and  in Birmingham at Aston University within the Neural Computation Research Group on probabilistic modelling. He joined the School of Computer Science, the University of Birmingham in 2003, where he has been ever since. Peter still likes to span a range of disciplines from machine learning and natural computation to complex systems. He loves the challenges brought up by truly cross-disciplinary work  and enjoys collaborating with colleagues from around the world. Peter likes teaching. If you prefer the old-style teaching with pen and whiteboard, you are very welcome to his lectures! He believes that everything is teachable if the story behind the material is communicated in the right way. Peter has supervised and co-supervised 16 PhD students to successful completion of their studies. He currently supervises and co-supervises 13 research students. Peter is interested in theory and interdisciplinary applications of machine learning, probabilistic modelling and dynamical systems. Recent publications Article Vaghari, D, Mohankumar, G, Tan, K, Lowe, A, Shering, C, Tino, P & Kourtzi, Z 2025, 'AI-guided patient stratification improves outcomes and efficiency in the AMARANTH Alzheimer’s Disease clinical trial', Nature Communications, vol. 16, no. 1, 6244. https://doi.org/10.1038/s41467-025-61355-3 Kohls, G, Elster, EM, Tino, P, Fairchild, G, Stadler, C, Popma, A, Freitag, CM, De Brito, S, Konrad, K & Pauli, R 2025, 'Machine learning reveals sex differences in distinguishing between conduct-disordered and neurotypical youth based on emotion processing dysfunction', BMC Psychiatry, vol. 25, no. 1, 105. https://doi.org/10.1186/s12888-025-06536-6 Taghribi, A, Canducci, M, Mastropietro, M, De rijcke, S, Peletier, RF, Tino, P & Bunte, K 2025, 'More than a void? The detection and characterization of cavities in a simulated galaxy’s interstellar medium', Astronomy and Computing, vol. 51, 100923. https://doi.org/10.1016/j.ascom.2024.100923 James, T, Williamson, B, Tino, P & Wheeler, N 2025, 'Whole-genome phenotype prediction with machine learning: open problems in bacterial genomics', Bioinformatics, vol. 41, no. 7, btaf206. https://doi.org/10.1093/bioinformatics/btaf206 Rodgers, N, Tiňo, P & Johnson, S 2024, 'Fitness-based growth of directed networks with hierarchy', Journal of Physics: Complexity, vol. 5, no. 3, 035013. https://doi.org/10.1088/2632-072x/ad744e Raj, MA, Awad, P, Peletier, RF, Smith, R, Kuchner, U, van de Weygaert, R, Libeskind, NI, Canducci, M, Tino, P & Bunte, K 2024, 'Large-scale structure around the Fornax-Eridanus complex', Astronomy and Astrophysics, vol. 690, A92. https://doi.org/10.1051/0004-6361/202450815 Alzheimer’s Disease Neuroimaging Initiative, Lee, LY, Vaghari, D, Burkhart, MC, Tino, P, Montagnese, M, Li, Z, Zühlsdorff, K, Giorgio, J, Williams, G, Chong, E, Chen, C, Underwood, BR, Rittman, T & Kourtzi, Z 2024, 'Robust and interpretable AI-guided marker for early dementia prediction in real-world clinical settings', EClinicalMedicine. https://doi.org/10.1016/j.eclinm.2024.102725 Li, B, Fong, RS & Tino, P 2024, 'Simple Cycle Reservoirs are Universal', Journal of Machine Learning Research, vol. 25, no. 158, pp. 1-28. <https://jmlr.org/papers/v25/23-1075.html> Awad, P, Li, TS, Erkal, D, Peletier, RF, Bunte, K, Koposov, SE, Li, A, Balbinot, E, Smith, R, Canducci, M, Tino, P, Senkevich, AM, Cullinane, LR, Costa, GSD, Ji, AP, Kuehn, K, Lewis, GF, Pace, AB, Zucker, DB, Bland-Hawthorn, J, Limberg, G, Martell, SL, McKenzie, M, Yang, Y & Usman, SA 2024, 'S5: New insights from deep spectroscopic observations of the tidal tails of the globular clusters NGC 1261 and NGC 1904', Astronomy and Astrophysics, vol. 693, A69. https://doi.org/10.1051/0004-6361/202451930 Comment/debate Yan, M, Huang, C, Bienstman, P, Tino, P, Lin, W & Sun, J 2024, 'Author Correction: Emerging opportunities and challenges for the future of reservoir computing', Nature Communications, vol. 15, no. 1, 9971. https://doi.org/10.1038/s41467-024-54397-6 Conference contribution Fong, R, Li, B & Tino, P 2025, Universality of Real Minimal Complexity Reservoir. in T Walsh, J Shah & Z Kolter (eds), AAAI-25 Technical Tracks 16: Thirty-Ninth AAAI Conference on Artificial Intelligence, Thirty-Seventh Conference on Innovative Applications of Artificial Intelligence, Fifteenth Symposium on Educational Advances in Artificial Intelligence. 1 edn, Proceedings of the AAAI Conference on Artificial Intelligence, no. 16, vol. 39, AAAI Press, Washington, DC, pp. 16622-16629, The 39th Annual AAAI Conference on Artificial Intelligence, Philadelphia, Pennsylvania, United States, 27/02/25. https://doi.org/10.48550/arXiv.2408.08071, https://doi.org/10.1609/aaai.v39i16.33826 Adeyemo, H, Bahsoon, R & Tino, P 2024, An Approach for Dynamic Behavioural Prediction and Fault Injection in Cyber-Physical Systems. in BDCAT '23: Proceedings of the IEEE/ACM 10th International Conference on Big Data Computing, Applications and Technologies., 8, Association for Computing Machinery (ACM), BDCAT '23, Taormina (Messina), Italy, 4/12/23. https://doi.org/10.1145/3632366.3632389 Tino, P, Fong, RS & Leonarduzzi, RF 2024, Predictive Modeling in the Reservoir Kernel Motif Space. in 2024 International Joint Conference on Neural Networks (IJCNN). 1 edn, International Joint Conference on Neural Networks, IEEE, 2024 International Joint Conference on Neural Networks (IJCNN), Yokohama, Japan, 30/06/24. https://doi.org/10.1109/IJCNN60899.2024.10650380 Preprint Serra, G, Tino, P, Xu, Z & Yao, X 2024 'An Interpretable Alternative to Neural Representation Learning for Rating Prediction: Transparent Latent Class Modeling of User Reviews' arXiv. https://doi.org/10.48550/arXiv.2407.00063 Review article Yan, M, Huang, C, Bienstman, P, Tino, P, Lin, W & Sun, J 2024, 'Emerging opportunities and challenges for the future of reservoir computing', Nature Communications, vol. 15, no. 1, 2056. https://doi.org/10.1038/s41467-024-45187-1 View all publications in research portal Related Research Centre for Computational Neuroscience and Cognitive Robotics (CNCR) Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 8004,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:49"
}