{
  "name": "Petra van den Bos",
  "homepage": "https://petravdbos.nl",
  "status": "success",
  "content": "Petra van den Bos I am an assistant professor in the Formal Methods and Tools group of the University of Twente. My current research focusses on software correctness and software quality in general, and on model-based testing specifically. I like working on theory (formal methods), that can be applied in practice as well. Previously, I had a postdoc position in the Formal Methods and Tools group of the University of Twente. Before that, I had a PhD position in the Software Science group of the Radboud University, where I completed my thesis \"Coverage and Games in Model-Based Testing\". Publications Laura Brandán Briones, Marcus Gerhold, Petra van den Bos, Marielle Stoelinga. Time for Quiescence: Modelling quiescent behaviour in testing via time-outs in timed automata. ICTSS 2025. Pre-print with proofsDownLoad paperDownload slides Michael Mulder, Petra van den Bos. Introducing automated testing to video game development via Behaviour-Driven Development. ECMFA 2025. Download paper Download artefact Download slides Robert Rubbens, Petra van den Bos and Marieke Huisman. Verified Parameterized Choreographies. COORDINATION 2025. Best Paper Award. Download preprint Download paper Download artefact Tannaz Zameni, Petra van den Bos, Johan Foederer and Arend Rensink. Sequential Composition of BDD Transition Systems for Model-Based Testing. FORTE 2025. Download preprint Download artefact Petra van den Bos, Marielle Stoelinga. With a little help from your friends: semi-cooperative games via Joker moves (journal version). Logical Methods in Computer Science, March 18, 2025, Volume 21, Issue 1. Download paperDownload artefact Robert Rubbens, Petra van den Bos and Marieke Huisman. VeyMont: Choreography-Based Generation of Correct Concurrent Programs with Shared Memory. iFM 2024. Download preprint Download paper Download artefact Tannaz Zameni, Petra van den Bos, Arend Rensink, Jan Tretmans. An Intermediate Language to Integrate Behavior-Driven Development Scenarios and Model-Based Testing. VST 2024. Download preprint Download paper Petra van den Bos, Marielle Stoelinga. With a little help from your friends: semi-cooperative games via Joker moves. FORTE 2023. Best Artefact Award. Download paperDownload artefact Tannaz Zameni, Petra van den Bos, Jan Tretmans, Johan Foederer, Arend Rensink. From BDD Scenarios to Test Case Generation. A-MOST 2023. Download paper Humaid Mollah, Petra van den Bos. From User Stories to End-to-end Web Testing. INTUITESTBEDS 2023. Download paper Download slides Simon Bliudze, Petra van den Bos, Marieke Huisman, Robert Rubbens, Larisa Safina. JavaBIP meets VerCors: Towards the Safety of Concurrent Software Systems in Java. FASE 2023. Download paper Petra van den Bos, Sung-Shik Jongmans. VeyMont: Parallelising Verified Programs instead of Verifying Parallel Programs. FM 2023. Download preprint Download paperDownload artefactDownload slides Publications before 2023 Current teaching tasks Master CS: Software Testing (in Risk Assessment & Software Testing) Master CS: Industrial Software Engineering Project Bachelor CS: Design (in module Software Systems) Contact Email: p dot vandenbos at utwente dot nl Office: Zilverling 3120",
  "content_length": 3187,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:00"
}