{
  "name": "Petri Myllymäki",
  "homepage": "https://www.cs.helsinki.fi/u/myllymak",
  "status": "success",
  "content": "Petri Myllymaki Home Page Petri Myllymäki, Ph.D., Docent of Computer Science Professor, Artificial intelligence and machine learning Department of Computer Science University of Helsinki, Finland Director, Helsinki Institute for Information Technology (HIIT) Vice-Director, Finnish Center for Artificial Intelligence (FCAI) Director, Helsinki Doctoral Education Network in ICT (HICT) Petri Myllymäki is a professor of artificial intelligence and machine learning at the Department of Computer Science of University of Helsinki, Finland. He has over 35 years of experience in research and applications of artificial intelligence technologies, and he has published over 150 scientific articles in various areas from fundamental regularization and optimization issues in machine learning to methods for probabilistic modeling, clustering, data visualization, information retrieval and other application areas of machine learning. He is a co-founder of several AI start-up companies (Sprint.ai, Ekahau, BayesIT, Cloud'N'Sci, Sightful, Etsimo), and has also been responsible of numerous applied research projects, and his industrial co-operation has led to a number of fielded applications and patents. His current Google Scholar h-index is 37 and he has over 6700 citations. Myllymäki is an Ellis Fellow at Ellis Unit Helsinki, and a member of the Finnish Academy of Technology and the Finnish Academy of Science and Letters. Myllymäki is currently the Director of the Helsinki Institute for Information Technology and the Vice-Director of the Finnish Center for Artificial Intelligence, the Finnish Flagship on AI, and is working as a member of the UN High-Level Advisory Body on AI, appointed by the UN Secretary General. He is also a member of the Board of Directors of the AI, Data and Robotics PPP (ADRA) for the European Commission, the Board of Directors of the National IT Center for Science hosting the LUMI supercomputer, a member of the National Committee for Research Data Management, a member of the national expert group on EU Horizon Cluster 4, and a member of the national expert group on Digitalization. He is currently working as an editorial board member for the World Summit AI community of over 260.000 AI experts globally. In the European Laboratory for Learning and Intelligent Systems (ELLIS), a pan-European network of excellence in machine learning, he is a member of the Executive Committee as the Director of External Relations. Professional data Curriculum Vitae (Updated: October, 2024) Linkedin home page. Publications: A categorized list of publications (Updated: December 31, 2021). Google scholar home page (December 2021: h-index 36, over 6000 citations). Contact You can send a request for a meeting via email but always please check first my free slots in my public calendar. Office locations: Kumpula Campus: Room A320 (3rd floor, last office on the right in the A wing in the Exactum building), street address: Pietari Kalmin katu 3. Otaniemi Campus: Room A210 (2nd floor of the CS building), street address: Konemiehentie 2, Espoo. Mailing address: P.O.Box 68 (HIIT), FIN-00014 University of Helsinki, Finland Phone: +358 40 5531162 Email: Petri.Myllymaki(a)Helsinki.FI",
  "content_length": 3205,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:00"
}