{
  "name": "Petros Maragos",
  "homepage": "http://cvsp.cs.ntua.gr/maragos",
  "status": "success",
  "content": "Computer Vision, Speech Communication & Signal Processing Group skip to: page content | links on this page | site navigation | footer (site information) Computer Vision, Speech Communication & Signal Processing Group NTUA | ECE Home About Us People Research Publications Courses Software News search Faculty | PhD Students | Collaborators Journal | Book Chapters | Conference Undergraduate | Graduate | Diploma Theses Home / People / Petros Maragos Petros Maragos Biosketch Publications Courses Research Grants Full CV Petros Maragos Professor Office: 2.1.24 Phone: Direct: (+30) 210772-2360 Secretariat: (+30) 210772-3397, -1527 CVSP Lab: (+30) 210772-2964, -2420 Robotics Lab:(+30) 210772-1527, -1528 Fax: (+30) 210772-3397 E-mail: maragos @ cs . ntua . gr URL: https://robotics.ntua.gr/members/maragos/ Biosketch Petros Maragos received the M.Eng.Ε.Ε. Diploma from the National Technical University of Athens (NTUA), Greece, in 1980, and the M.Sc.E.E. and Ph.D. degrees from Georgia Tech, Atlanta, USA, in 1982 and 1985. In 1985 he joined the faculty of the Division of Applied Sciences at Harvard University, Boston, where he worked for eight years as professor of electrical engineering, affiliated with the interdisciplinary Harvard Robotics Lab. He has also been a consultant to several industry research groups including Xerox and Bellcore. In 1993 he joined the faculty of the School of ECE at Georgia Tech and its Center for Signal and Image Processing. During periods of 1996-98 he had a joint appointment as director of research at the Institute for Language and Speech Processing in Athens. In Fall 1998 he joined the faculty of the National Technical University of Athens, where he has been working as professor of electrical and computer engineering, and also as principal investigator of research projects at its Institute of Communication and Computer Systems. He founded the Computer Vision, Speech Communication & Signal Processing Lab in 1999, which he has led since its inception. From 2008 to 2025, he also served as the director of the NTUA Lab on Intelligent Robotics and Automation. In parallel, he has served for ten years as the director of the NTUA Division of Signals, Control and Robotics. He has held visiting positions at: MIT in 2012, UPenn in 2016, and USC in 2023. During 2012-2022 he was the scientific director of the Robot Perception & Interaction Unit and from 2023 the co-founder and acting director of the new Robotics Institute at the Athena Research & Innovation Center. Since 2025 he is the Director and Scientific Coordinator of the newly launched Hellenic Robotics Center of Excellence. His current research and teaching interests include computer vision and image processing, audio-speech & language processing, machine learning, and robotics. In the above areas he has taught 20 university courses and has authored or co-authored more than 450 publications as journal papers, book chapters and conference articles. The citations to his work are mentioned in Google Scholar and in Stanford/Elsevier’s list of top 2% highly cited scientists worldwide. He has been named an inaugural Highly Ranked Scholar by ScholarGPS (top 0.05% of all scholars worldwide). He has co-authored two textbooks, one on computer vision & machine learning and another on signals & systems, and has co-edited three research books, one on multimodal processing and interaction and two on shape analysis. He has supervised more than 30 PhDs, 10 Postdoc researchers, and 130 MEng/MSc students. He has also been the principal investigator and/or scientific director of more than 50 USA and European/Greek research projects. He has served as associate editor for the IEEE Transactions on Acoustics, Speech & Signal Processing, the IEEE Transactions on Pattern Analysis and Machine Intelligence, as well as editorial board member and guest editor for several other journals on signal processing, image analysis and computer vision. He has served as member of the IEEE DSP, IMDSP and MMSP technical committees, the IEEE SPS Education Board and the Conference Board. He has co-organized as general chair or co-chair several international conferences & workshops on image processing, computer vision, multimedia, and robotics, including the flagship conferences EUSIPCO-2017 and IEEE ICASSP-2023. He has also served as member of the Greek National Council for Research and Technology, and the Scientific Councils for Mathematics & Information Sciences, and recently for AI. He is the recipient or co-recipient of several awards and distinctions for his academic work, including a 1987-1992 US National Science Foundation’s Presidential Young Investigator Award; 1988 IEEE ASSP Young Author Best Paper Award; 1994 IEEE SPS Senior Best Paper Award; 1995 IEEE W.R.G. Baker Prize Award for the most outstanding original paper in all IEEE publications; 1996 Pattern Recognition Society’s Honorable Mention Award for best paper; CVPRW-2011 Gesture Recognition Best Paper Award; ECCVW-2020 Data Modeling Challenge Award; CVPR-2022 best paper finalist; PETRA-2023 best paper for novelty award; PETRA-2025 best paper award. In 1995 he was elected Fellow of the IEEE for his contributions to the theory and application of nonlinear signal processing. He received the 2007 EURASIP Technical Achievements Award for contributions to nonlinear systems, image processing, and speech processing. In 2010 he was elected Fellow of the EURASIP for his research contributions. He has been elected IEEE Distinguished Lecturer for 2017-18. Since 2023 he has been a Life Fellow of IEEE. Last modified: Sunday, 31 August 2025 | Created by Nassos Katsamanis and George Papandreou",
  "content_length": 5676,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:03"
}