{
  "name": "Petr Slovák",
  "homepage": "https://www.kcl.ac.uk/people/petr-slovak",
  "status": "success",
  "content": "Petr Slovak | King's College London Skip to main contentDr Petr Slovak ReaderResearch interestsComputer scienceMental HealthContact details+44 020 7848 1988petr.slovak@kcl.ac.ukBiographyMy research is positioned at the intersection of Human Centred Interaction, mental health intervention, and learning sciences. I am interested in understanding how technology can meaningfully help in supporting the development of core competencies known to promote mental health – such as self-regulation, coping with stress, or conflict resolution – in real-world contexts. This research agenda is supported through collaboration with multiple partners including Oxford University, UCL, Anna Freud Centre in London, UC Irvine, UC Santa Cruz, Harvard Medical School, and Committee for Children (a US-based non-profit developers of a social-emotional learning program used in more than 30% of US schools). We've published a series of papers at top tier HCI venues furthering this research direction over the last 4 years (with 3x CHI, 2x CSCW, 1x TOCHI as first authored), including a Best Paper awards at CHI'17 and CSCW'18. Currently, my main research project focuses on understanding of how novel digital objects (e.g., socially assistive robots) could lead to innovative intervention delivery approaches, which are embedded in the everyday lives of young children and their families; our specific case study focusses on the development of self-regulation competencies (UCL, UC Santa Cruz, CfC). The second core project investigates the potential of voice-assistants (such as Alexa/GoogleHome) to deliver prevention interventions in real-world settings (Oxford). I also serve as the Research Lead on two other projects: embedding conflict-resolution training into Minecraft gameplay for children aged 11-14 (UC Irvine, CfC) and a personal informatics app empowering parents of 2-5 year olds to develop positive parenting techniques (CfC); as well as supporting two projects at Oxford (digital self-control; child privacy). More information: Research Profile Petr Slovak's website PublicationsResearchResearchHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Supporting Parents And Kids Through Lockdown Experiences (SPARKLE) TrialA randomised control trial evaluating whether a digital public health parenting intervention can help parents to manage their children’s behaviour problems.Project status: OngoingPositioning Parent Positive (PPP) StudyA study of stakeholder views about the best way to optimise the clinical value of the Parent Positive digital parenting app.Project status: OngoingHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.Urban Data ScienceSupporting interdisciplinary research and innovation in and for LondonNewsNews31 October 2023Providing mental health support in peace efforts helps alleviate PTSD and depressionNew study shows group counselling and one -on-one peacebuilding activities improve mental health in NigeriaInternationalSocietyHealth08 June 2023Cuddly 'Purrble' robot visits No. 10 as King's celebrates design exhibitionDesign-led research was presented to the Secretary of State for Culture at Downing Street, as the university celebrated the 'Seeking Connection' research...Arts & CultureHealthSocietyUniversity03 May 2023King's exhibits research at 2023 London Design BiennaleThe King’s pavilion 'Seeking Connection' will showcase creative, cross-disciplinary research into digital technologies from across the university.Arts & CultureHealthSocietyTechnology & Science31 August 2022NMES academic promotionsNew readers and senior lecturers in NMESTechnology & Science15 October 2020Dr Petr Slovak granted UKRI Future Leaders Fellowship for research in child mental health interventionDr Petr Slovak, Lecturer in King’s Department of Informatics, has been awarded a UKRI Future Leaders Fellowship to support his research on the use of emerging...Technology & Science05 November 2019Seven collaborations launched as part of King's Artists programmeThroughout the 2019–20 academic year, seven new artists-in-residence will be based in departments across King’s College London. Arts & CultureHealthTechnology & ScienceSocietyStudentUniversity23 November 2018Best Paper award for new Lecturer in InformaticsA group of academics including Dr Petr Slovak, Lecturer in the Department of Informatics from January 2019, has received the Best Paper award at the...Technology & ScienceEventsEvents07AprCockney CHAI 202507 April 2025 09:30 to 17:00Cockney CHAI is a pre-CHI gathering for London-based HCI researchers and practitioners.Please note: this event has passed.FeaturesFeatures28 June 2022Emotional regulation in childrenIntervening where and when help is needed: how Dr Petr Slovak and his team have helped design a best-selling, research-backed smart toy that helps children...Technology & SciencePublicationsResearchNewsEventsFeaturesResearchHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Supporting Parents And Kids Through Lockdown Experiences (SPARKLE) TrialA randomised control trial evaluating whether a digital public health parenting intervention can help parents to manage their children’s behaviour problems.Project status: OngoingPositioning Parent Positive (PPP) StudyA study of stakeholder views about the best way to optimise the clinical value of the Parent Positive digital parenting app.Project status: OngoingHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.Urban Data ScienceSupporting interdisciplinary research and innovation in and for LondonNews31 October 2023Providing mental health support in peace efforts helps alleviate PTSD and depressionNew study shows group counselling and one -on-one peacebuilding activities improve mental health in NigeriaInternationalSocietyHealth08 June 2023Cuddly 'Purrble' robot visits No. 10 as King's celebrates design exhibitionDesign-led research was presented to the Secretary of State for Culture at Downing Street, as the university celebrated the 'Seeking Connection' research...Arts & CultureHealthSocietyUniversity03 May 2023King's exhibits research at 2023 London Design BiennaleThe King’s pavilion 'Seeking Connection' will showcase creative, cross-disciplinary research into digital technologies from across the university.Arts & CultureHealthSocietyTechnology & Science31 August 2022NMES academic promotionsNew readers and senior lecturers in NMESTechnology & Science15 October 2020Dr Petr Slovak granted UKRI Future Leaders Fellowship for research in child mental health interventionDr Petr Slovak, Lecturer in King’s Department of Informatics, has been awarded a UKRI Future Leaders Fellowship to support his research on the use of emerging...Technology & Science05 November 2019Seven collaborations launched as part of King's Artists programmeThroughout the 2019–20 academic year, seven new artists-in-residence will be based in departments across King’s College London. Arts & CultureHealthTechnology & ScienceSocietyStudentUniversity23 November 2018Best Paper award for new Lecturer in InformaticsA group of academics including Dr Petr Slovak, Lecturer in the Department of Informatics from January 2019, has received the Best Paper award at the...Technology & ScienceEvents07AprCockney CHAI 202507 April 2025 09:30 to 17:00Cockney CHAI is a pre-CHI gathering for London-based HCI researchers and practitioners.Please note: this event has passed.Features28 June 2022Emotional regulation in childrenIntervening where and when help is needed: how Dr Petr Slovak and his team have helped design a best-selling, research-backed smart toy that helps children...Technology & Science(S)5.05Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 8004,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:58"
}