{
  "name": "Petra Mutzel",
  "homepage": "https://ca.cs.uni-bonn.de/doku.php?id=people:mutzel",
  "status": "success",
  "content": "people:mutzel [Computational Analytics] skip to content Computational Analytics User Tools Log In Site Tools Search ToolsShow pagesourceOld revisionsBacklinksRecent ChangesMedia ManagerSitemapLog In> Recent ChangesMedia ManagerSitemap Trace: • mutzel Sidebar Home People Teaching Projects Contact Imprint/Impressum Internal people:mutzel Table of Contents Petra Mutzel Graph Edit Paper Accepted for Publication at VLDB Workshops in CPU and GPU Parallel Programming by Timothy Mattson (Co-Founder of OpenMP) Call for Participation for 23rd Symposium on Experimental Algorithms (SEA 2025): Research Interests Recent and Upcoming Invited Talks Recent and Upcoming PC Memberships Awards, Scientific Honours Education and Positions Recent Publications Petra Mutzel Room: 2.077 Phone: +49 (228) 73-69917 E-Mail: petra.mutzelcs.uni-bonn.de Address: Institute for Computer Science 1, Friedrich-Hirzebruch-Allee 8 Chair of Computational Analytics In addition: Scientific Director of HPC/A Lab at DiCe Graph Edit Paper Accepted for Publication at VLDB Our paper titled \"Enhancing Graph Edit Distance Computation: Stronger and Orientation-based ILP Formulations\" co-authored by Andrea D'axcezo, Julian Meffert, Petra Mutzel and Fabrizio Rossi, has appeared in the Proceedings for the VLDB Endowment (VLDB) 2025 (A* ranked). In there, we suggest new ILP formulations for the graph edit distance problem, and theoretically show that they theoretically and practically dominate all existing ones. We are able to solve many more instances (and much larger sizes) from the standard benchmark instances to provable optimality as previous approaches. Workshops in CPU and GPU Parallel Programming by Timothy Mattson (Co-Founder of OpenMP) Timothy Mattson is Honorary Professor of the University of Bristol and regarded as an important co-founder of OpenMP (an API supporting multi-platform shared-memory multiprocessing programming). During his time at Intel, he has also worked on the further development of MPI, PyOMP, and GraphBLAS. He has written over 150 publications including six books on parallel computing. He will visit Bonn University during the week of March 24-28, 2025, in order to provide three workshops on various aspects of parallel programming using OpenMP. Please visit the webpage for more information. Call for Participation for 23rd Symposium on Experimental Algorithms (SEA 2025): The Symposium of Experimental Algorithms 2025 (SEA 2025) has taken place from 22 to 24 July 2025 in Venice, Italy. The co-chairs have been Petra Mutzel and Nicola Prezza. SEA aims to attract papers from the Computer Science community, the Operations Research/Mathematical Programming community and any other scientific community that is concerned with the main theme of the symposium, namely the role of experimentation and of algorithm engineering techniques in the design and evaluation of algorithms and data structures. The Proceedings are available here. Research Interests Computational Analytics Algorithm Engineering, in particular graph algorithms and data structures Algorithmic Data Analysis, Graph Mining Combinatorial Optimization (polynomial time and ILP-based) Network Design and Optimization Graph and Network Visualization Analysis of chemical structures and biological networks Application areas: network analysis, cheminformatics (drug design), information visualization, network design and optimization, geosciences, cartography, computational biology, statistical physics, … Recent and Upcoming Invited Talks ``N. N.´´, Invited Talk at the 20th International Conference and Workshops on Algorithms and Computation (WALCOM 2026), Perugia (Italy), March 4-6, 2026 ``Computational Optimization in Geodesy´´, Invited Talk at the 3rd Vienna Workshop on Computational Optimization, University of Vienna (Austria), June 4-6,2025 ``Algorithmic Data Science on Graphs´´, AI Talks at JMU, Center for AI and Data Science (CAIDAS) at Julius-Maximilians University of Wuerzburg, January 16, 2024 ``Algorithmic Data Science on Graphs´´, TU Wien (Austria), November 16, 2023 ``Graph Similarity´´, Colloquium Jacques Morgenstern, Sciences et Technologies de l'Information et de la Communication, INRIA, Sophia Antipolis, March 24, 2023 ``Quantum annealing versus digital computing: An experimental comparison´´, Bonn Workshop on Combinatorial Optimization: Celebrating the 65th Birthday of William Cook, October 17 - 21, 2022, org. by D. Applegate, D. Espinoza, S. Held, and B. Korte, based on our paper published at ACM Journal of Experimental Algorithmics 2021 (link to paper) ``Lect. 1: ILP Formulations for the Graph Coloring Problem, Lect. 2+3: Graph Similarity´´, Hausdorff School: Computational Combinatorial Optimization, September 12 - 16, 2022, org. by William Cook (Waterloo) and Stephan Held (Bonn) ``Algorithmic Data Science´´, 19th Symposium on Experimental Algorithms, SEA 2021, Université Côte d'Azur, Valrose, France, June 7-9, 2021 International School on Mathematics ``GUIDO STAMPACCHIA´´, Graph Theory, Algorithms And Applications, 5th Edition, org. by R. Cerulli, A. Goldberg, G.F. Italiano, R.E. Tarjan, Centre “Ettore Majorana” for Scientific Culture Erice, Italy, July 2020 (postponed due to Corona) Recent and Upcoming PC Memberships PC member at the 48th German Conference on Artificial Intelligence (KI 2025), Potsdam, September 16-19, 2025, org. in cooperation with GI-SIG AI PC co-chair of the 23th Symposium on Experimental and Efficient Algorithms 2025 (SEA 2025), jointly with Nicola Prezza, Venice (Italy), July 22-24, 2025 PC member of the 33th International Symposium on Algorithms and Computation (ISAAC 2023), Kyoto, Japan, December 3rd - 6th, 2023 PC co-chair of the 16th International Conference and Workshop on Algorithms and Computation 2022 (WALCOM 2022), jointly with Md. Saidur Rahman and S. Slamin, University of Jember, East Java, Indonesia, March 24-26, 2022 PC chair of the 20th European Symposium on Algorithms 2021 (ESA 2021, track B), part of ALGO 2021, Lisbon, September 6-10, 2021 PC member of the 19th Symposium on Experimental Algorithms 2020 (SEA 2020), Catania (Italy), June 2020 PC member of Algorithm Engineering & Experiments 2020 (ALENEX 2020), Salt Lake City (USA), January 2020 Awards, Scientific Honours Spokesperson of the DFG research unit AI FOR 5361: Algorithmic Data Analysis for Geodesy (AlgoForGe), since 2023 PI of the Lamarr Institute for Machine Learning and Artificial Intelligence, since July 2022 Member of the Scientific Advisory Board of the Freiburg Institute for Advanced Studies (FRIAS), since 2020 Member of the Steering Committee of ESA ( European Symposium on Algorithms), since 2020 Elected Member of the Steering Committee of TRA 1: Mathematics, Modelling and Simulation of Complex Systems, Bonn University, since 05/2020 Regular Member of the Hausdorff Center for Mathematics (HCM), since 01/2020 (associate member since 11/2019) Member of the Advisory Board (Kuratorium) of the Fraunhofer SCAI (since 2020) Member of the 2021 and 2018 and 2015 Beale-Orchard Hays Prize Committee for Excellence in Computational Mathematical Programming by the Mathematical Optimization Society Member of the Steering Committee of ALENEX (SIAM Symposium on Algorithm Engineering and Experiments), 2020 - 2023 (previously also 2012-2017) Member of the Supervisory Board of the Helmholtz Center for Information Security (CISPA) in Saarbrücken, since 2019 Elected Member of the “DFG-Senatsauschuss” and the “DFG-Bewilligungsausschuss” for Collaborative Research Centres (SFB), 01/2013 – 12/2018 Elected “DFG-Fachkollegiatin” for the area of Theoretical Computer Science, 2008-2012 Member of the board of the GIBU: “Beirat der Universitätsprofessor/inn/en in der Gesellschaft für Informatik” (Professors in the Computer Science Society), 2008-2012 Research Prize “Technische Kommunikation 2000” by the Alcatel SEL Stiftung für Kommunikationsforschung (20.000 EUR) Member of the Innovationsbeirat of the German Ministry of Education and Research (2001-2005) Delegate of the Curatorium of the Austrian Academy of Sciences (2002) Reviewer in the EU-panel “Engineering and Computer Sciences” for the European Young Investigator Award (EURYI) of the ESF (2005-2007) External peer reviewer for the evaluation of the Computer Science Department of the University of Limerick (Ireland), 2002-2003 Editor of the ACM Journal on Experimental Algorithmics since 2013, EURO Journal on Computational Optimization (2012-2020), Mathematical Programming Computation since 2010, Graph Drawing E-print Archive since 2006, Journal of Graph Algorithms and Applications (JGAA) since 2005, and several guest editorials PI of many projects funded by the DFG, EU, BMBF, BMWi, and others. Current and past projects can be found here. Education and Positions since 2019: Full Professor for Computational Analytics, Institute for Computer Science, University of Bonn 2004-2019: Full Professor (C4) for Algorithm Engineering / Experimental Algorithms, Computer Science Department, Technische Universität Dortmund 1999-2004: Full Professor for Algorithms and Data Structures, Institute for Computer Graphics and Algorithms, Technische Universität Wien 1999: Temporary Professorship (C3) of Computer Science at Universität Heidelberg 1999: Habilitation at University of the Saarland (Member of the Max Planck Institute for Computer Science) 1994: Dr. rer. nat. (summa cum laude) in Computer Science, Universität zu Köln 1990: Dipl.-Math. at Universität Augsburg (Mathematics with Computer Science) Recent Publications Also see Google Scholar (h-index >= 52) and DBLP or io-port.net. My ORCID code is 0000-0001-7621-971X. Enhancing Graph Edit Distance Computation: Stronger and Orientation-based ILP Formulations Andrea D'ascenzo, Julian Meffert, Petra Mutzel, Fabrizio Rossi Proceedings of the VLDB Endowment (VLDB) (core rank A*), Eds.T. Palpanas, P. Pietzuch, N. Tatbul and P. Triantafillou, Vol. 18, no. 11, 2025, pp. 4737-4749, ISSN 2150-8097, doi:10.14778/3749646.374",
  "content_length": 28994,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:59"
}