{
  "name": "Petr Svenda",
  "homepage": "https://crocs.fi.muni.cz/people/svenda",
  "status": "success",
  "content": "doc. Petr Švenda Ph.D. (associate professor) [CRoCS wiki] Share via Share via... Twitter LinkedIn Facebook Pinterest Telegram WhatsApp Yammer RedditRecent ChangesSend via e-MailPrintPermalink × svenda@fi.muni.cz @rngsec PGP 0x62110517 Scholar ORCID GitHub Office A406, FI MUNI Courses I teach Low-level programming in C (PB071) Security technologies (PV204) Secure coding (PA193) Secure network design (PA197) PhD seminar on ITSec (PA168) My coding and other projects JCAlgTest (#smartcards, JavaCard performance testing) Myst (#smartcards, Secure multi-party on JavaCards) JCMathLib (#smartcards, ECPoint&Bignat open library) RSA key classifier (#crypto, Pubkey to library classificator) JCProfiler (#smartcards, JavaCard Applet speed profile) WSNProtectLayer (#wsn/IoT, Transparent enc&auth proxy) EACirc (#randomness, Randomness testing battery) APDUPlay (#smartcards, APDU logging and manipulation) JavaPresso (#smartcards, Source code packer for JavaCard) My astrophotography pictures (#astro) doc. Petr Švenda Ph.D. (associate professor) I'm computer security researcher, lecturer and active member of the Centre for Research on Cryptography and Security at Masaryk University in Brno, Czech Republic. My main research areas are cryptographic protocols for limited devices, analysis and use of secure hardware and randomness assesment and entropy extraction. I also enjoy programming, especially in area of security-sensitive applications. Current aim of my research “I want to empower people running secure multiparty protocols on cryptographic smartcards.” See full list of my publications. Read about research topics in CRoCS lab here. My older homepage is still available. Secure hardware I have a strong passion for cryptographic smartcards, both for the research and development topics. We recently analyzed millions RSA keys extracted from smartcards to detect biases in generated public keys (USENIXSec'16, best paper award). Our follow-up lead to discovery of the weak RSA key generation algorithm on Infineon smartcards known as ROCA vulnerability (CVE-2017-15361) received The Real-World Impact award at ACM CCS 2017. The more precise method to measure the popularity of cryptographic libraries detects the significant variation in a source of certificates submitted weekly to Certificate Transparency and shows that OpenSSL is more popular than ever in internet-wide scans (ACSAC 2017). The compromise-resistant ECC-based signing and key generation via secure multiparty computation protocol on a grid of smartcards was showcased at DEFCON 2017 with all details published at ACM CCS 2017. I co-developed library for Bignat and ECPoint for JavaCard platform which requires no vendor proprietary API JCMathLib showcased at BlackHat 2017 and used in ACM CCS 2017 prototype. In 2006 I started and still maintain the largest open-source database of performance and algorithmic support tests of smartcards with JavaCard platform (JCAlgTest project). I was involved in the laboratory testing of the resilience of smartcards hardware against power and fault analysis, reverse engineering of JavaCard bytecode from the power trace (paper), security code review of JavaCard applets and applications development. I worked on data retention compliant logging for AN.ON anonymity service at TU Dresden (paper) and massively parallel cloud security hardware platform (paper). Randomness and entropy extraction We work on non-tradition randomness testing battery based on genetic programming (EACirc project) with statistical tests continually adapted to analyzed binary sequence to find defects in cryptographic functions (paper). We also aim to provide guidance which part of an analyzed function is responsible for the observed defect. We proposed lightweight yet powerful bias detection method based on boolean functions (Secrypt 2017) with detection of previously unknown biases in Java Random and C rand generators. I was involved in practical entropy extractors from hardware sources available on mobile devices, especially from the microphone and camera input (paper, paper). Wireless Sensor Networks (WSNs) WSNs were my main Ph.D. research topic with thesis defended in 2009 (The link key security in wireless sensor networks, thesis). We inspect security protocols for networks with the assumption of an inevitability of partial compromise. We proposed several techniques how to maintain reasonably functional and secure network ranging from the node capture resilient key establishment (paper) over key strengthening mechanism called secrecy amplification (paper) to automatic protocol generation (paper). We developed transparent security platform via virtualized radio stack for TinyOS (WSNProtectLayer project). Teaching and thesis supervision I teach mostly security and applied cryptography focused courses (see list on the left), commonly with programming as the important component for deeper understanding. I really value feedback and participation - don't leave for yourself what you are happy and unhappy with. I do supervise bc. and mgr. thesis - read first the list of available topics here and projects we work on. Then ask for a personal meeting - the majority of the thesis I supervise are customized based on a discussion with you. And don't be shy to approach me with your own favorite topic. My publications 2025 Analysis of Input-Output Mappings in Coinjoin Transactions with Arbitrary Values Jiri Gavenda, Petr Svenda, Stanislav Bobon and Vladimir Sedlacek, Computer Security – ESORICS 2025, Springer Nature Switzerland, 2025, 126–146. Keywords: bitcoin, coinjoin, cryptocurrencies, pre-print PDF, DOI website, BibTeX @InProceedings{2025-esorics-gavenda, title = {Analysis of Input-Output Mappings in Coinjoin Transactions with Arbitrary Values}, author = {Jiri Gavenda and Petr Svenda and Stanislav Bobon and Vladimir Sedlacek}, booktitle = {Computer Security -- ESORICS 2025}, pages = {126--146}, publisher = {Springer Nature Switzerland}, address = {Cham}, year = {2025}, isbn = {978-3-032-07901-5}, doi = {10.1007/978-3-032-07901-5_7}, keywords = {bitcoin, coinjoin, cryptocurrencies}, abstract = {A coinjoin protocol aims to increase transactional privacy for Bitcoin and Bitcoin-like blockchains via collaborative transactions, by violating assumptions behind common analysis heuristics. Estimating the resulting privacy gain is a crucial yet unsolved problem due to a range of influencing factors and large computational complexity.}, editor = {Vincent Nicomette and Abdelmalek Benzekri and Nora Boulahia-Cuppens and Jaideep Vaidya}, } Details Chapter 10: Chapter ROCA and Minerva Vulnerabilities Jan Jancar, Petr Svenda and Marek Sys, Embedded Cryptography vol. 3, Wiley-ISTE, 2025. Keywords: smartcards, vulnerability, rsa, ecdsa, side-channel, DOI website, paper website, BibTeX @InProceedings{2025-bookembeeddcrypto-vulns, title = {Chapter 10: Chapter ROCA and Minerva Vulnerabilities}, author = {Jan Jancar and Petr Svenda and Marek Sys}, booktitle = {Embedded Cryptography vol. 3}, publisher = {Wiley-ISTE}, year = {2025}, isbn = {978-1-394-35193-0}, doi = {doi.org/10.1002/9781394351930.ch10}, url = {https://dx.doi.org/10.1002/9781394351930}, keywords = {smartcards, vulnerability, RSA, ECDSA, side-channel}, } ECTester: Reverse-engineering side-channel countermeasures of ECC implementations Vojtech Suchanek, Jan Jancar, Jan Kvapil, Petr Svenda and Lukasz Chmielewski, IACR Transactions on Cryptographic Hardware and Embedded Systems, Ruhr-University of Bochum, 2025, 290-316. Keywords: side-channel, ecc, DOI website, paper website, BibTeX @InProceedings{2025-ches-suchanek, title = {ECTester: Reverse-engineering side-channel countermeasures of ECC implementations}, author = {Vojtech Suchanek and Jan Jancar and Jan Kvapil and Petr Svenda and Lukasz Chmielewski}, booktitle = {IACR Transactions on Cryptographic Hardware and Embedded Systems}, publisher = {Ruhr-University of Bochum}, year = {2025}, keywords = {side-channel, ECC}, doi = {10.46586/tches.v2025.i4.290-316}, url = {https://tches.iacr.org/index.php/TCHES/article/view/12411}, pages = {290-316}, } Details Large-scale security analysis of hardware wallets Milan Sorf, Petr Svenda and Lukasz Chmielewski, Availability, Reliability and Security, Springer LNCS, 2025. Keywords: hardware wallets, trng, ecdsa, robotic testing, DOI website, BibTeX @InProceedings{2025-trustbus-sorf, title = {Large-scale security analysis of hardware wallets}, author = {Milan Sorf and Petr Svenda and Lukasz Chmielewski}, booktitle = {Availability, Reliability and Security}, publisher = {Springer LNCS}, year = {2025}, isbn = {978-3-032-00633-2}, doi = {https://doi.org/10.1007/978-3-032-00633-2_21}, keywords = {hardware wallets, trng, ecdsa, robotic testing}, } Revisiting the analysis of references among Common Criteria certified products Adam Janovsky, Lukasz Chmielewski, Petr Svenda, Jan Jancar and Vashek Matyas, Computers & Security, 2025. Keywords: sec-certs, DOI website, paper website, BibTeX @Article{2025-revisiting-janovsky, title = {Revisiting the analysis of references among Common Criteria certified products}, author = {Adam Janovsky and Lukasz Chmielewski and Petr Svenda and Jan Jancar and Vashek Matyas}, journal = {Computers & Security}, volume = {152}, year = {2025}, issn = {0167-4048}, doi = {10.1016/j.cose.2025.104362}, url = {https://www.sciencedirect.com/science/article/pii/S0167404825000513}, keywords = {sec-certs}, } Details Two-party ECDSA with JavaCard-based smartcards Antonin Dufka, Peeter Laud and Petr Svenda, Applied Cryptography and Network Security: 23rd International Conference on Applied Cryptography and Network, Springer, 2025. Keywords: smartcards, smpc, ecdsa, javacard, DOI website, paper website, BibTeX @InProceedings{2025-acns-dufka, title = {Two-party ECDSA with JavaCard-based smartcards}, author = {Antonin Dufka and Peeter Laud and Petr Svenda}, booktitle = {Applied Cryptography and Network Security: 23rd International Conference on Applied C",
  "content_length": 42515,
  "method": "requests",
  "crawl_time": "2025-12-01 14:11:57"
}