{
  "name": "Petteri Nurmi",
  "homepage": "https://researchportal.helsinki.fi/en/persons/petteri-nurmi",
  "status": "success",
  "content": "Petteri Nurmi - University of Helsinki Petteri Nurmi Professor, Department of Computer ScienceSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿Helsinki Institute of Sustainability Science (HELSUS) https://orcid.org/0000-0001-8262-6434 Phone+358294151396, +358505560451Emailpetteri.nurmihelsinkifi PL 68 (Pietari Kalmin katu 5)00014Finland 20052026 Research activity per year Personal profile Fields of Science113 Computer and information sciences Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2005 2005 2019 2020 2021 2022 2023 2024 2025 2026 91 Conference contribution 66 Article 6 Chapter 3 Book 9 More 2 Review Article 1 Anthology or special issue 1 Commissioned report 1 Abstract 1 Poster 1 Editorial 1 Doctoral Thesis 1 Preprint Research output per year Research output per year AI See What You Did There: Assessing the Rise of LLM-Generated Responses in Online LearningNurmi, P., Khan, M., Safaei, Z., Nguyen, N. T., Sarhaddi, F., Tompuri, M. S., Nygren, H., Kinnunen, P. A. & Zuniga, A., 2026, (Accepted/In press) Technical Symposium on Computer Science Education.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile A Tale of Many IoTs: A Modular Constructivist Course Design for Internet of Things EducationZuniga, A., Nguyen, N. T., Tompuri, M. S., Nygren, H. & Nurmi, P., 2025, (Accepted/In press) In: IEEE Transactions on Education. 11 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile BEE: Opportunistic Heat-Based Bio-Sensing for Produce Quality MonitoringYin, Z., Radeta, M., Post, K., Liyanage, M., Olapade, M., Kuchida, R., Ottun, A.-R., Akintola, A., Nurmi, P. & Flores, H., 2025, (Accepted/In press) In: Proceedings of ACM on interactive, mobile, wearable and ubiquitous technologies.Research output: Contribution to journal › Article › Scientific › peer-review File ContextLLM: Meaningful Context Reasoning from Multi-Sensor and Multi-Device Data Using LLMsPost, K., Kuchida, R., Olapade , M., Yin, Z., Nurmi, P. & Flores, H., 26 Feb 2025, HotMobile '25: Proceedings of the 26th International Workshop on Mobile Computing Systems and Applications. New York: Association for Computing Machinery (ACM), p. 13-18 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Drones in the Sky: Air Quality Monitoring at HeightsHossein Motlagh, N., Zaidan, M. A., Irjala, M., Rebeiro-Hargrave, A., Nurmi, P. & Tarkoma, S., 25 Sept 2025, MobiSys '25: Proceedings of the 23rd Annual International Conference on Mobile Systems, Applications and Services. ACM, p. 717–722 Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile View all 175 research outputs Projects Projects per year 2021 2021 2024 2028 1 Finished 2 Active Projects per year Team Finland Knowledge programmeNurmi, P. (Project manager), Nguyen, T. N. (Participant) & Zuniga, A. (Participant)Opetushallitus Ostolaskut01/08/2024 → 31/12/2026Project: Ministry funding NordForsk - Tarkoma 2024 - 2028Tarkoma, S. (Project manager), Abstreiter, M. (Participant), Liu, X. (Participant), Morabito, R. (Participant), Nurmi, P. (Participant), Rao, A. (Participant) & Wu, G. (Participant)NordForsk01/01/2024 → 31/12/2028Project: External funding Foundations of Pervasive Sensing SystemsNurmi, P. (Principal Investigator)01/09/2021 → 31/08/2025Project: Research Council of Finland: Academy Project Activities Activities per year 2009 2010 2022 2023 3 Academic visit to other institution 2 Academic visit at UH 2 Invited talk 1 Organisation and participation in conferences, workshops, courses, seminars 1 More 1 Oral presentation Activities per year The 21st ACM International Conference on Mobile Systems, Applications, and Services (ACM Mobisys 2023)Nurmi, P. (Chair of organizing committee)18 Jun 2023 → 22 Jun 2023Activity: Participating in or organising an event types › Organisation and participation in conferences, workshops, courses, seminars City-Scale Environmental Monitoring and Analytics in Future Smart CitiesNurmi, P. (Speaker)21 Jun 2022Activity: Talk or presentation types › Invited talk Loughborough UniversityNurmi, P. (Visiting researcher)Oct 2022Activity: Visiting an external institution types › Academic visit to other institution Pervasive Data Science in the DeepNurmi, P. (Speaker)2022Activity: Talk or presentation types › Invited talk AI Testing in the Real World: A Case Study in WiFi Cross-Technology Interference DetectionPulkkinen, T. (Speaker), Nurminen, J. K. (Speaker) & Nurmi, P. (Speaker)26 Nov 2020Activity: Talk or presentation types › Oral presentation View all 9 activities",
  "content_length": 5140,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:02"
}