{
  "name": "Petter Holme",
  "homepage": "https://www.aalto.fi/en/people/petter-holme",
  "status": "success",
  "content": "Petter Holme | Aalto University People Petter Holme Professor Professor T313 Dept. Computer Science I'm interested in understanding the world around us through networks describing how things are connected. Through the structure of these connections, we can understand some aspects of how a system works—it could be the spread of opinions among people, the interactions between organizations concerning climate change, the synchronization of power grids, and many other topics. My work is interdisciplinary and in collaboration with researchers from the social sciences, medicine, engineering, and more. I use tools from data science, mathematics, and computational modeling. Full researcher profile https://research.aalto.fi/... Email petter.holme@aalto.fi Areas of expertise network science, Complex networks, Complex Systems, Computational social science Honors and awards Fellow of the Network Science Society Recognizes researchers who have made outstanding and significant contributions to network science research and to the community of network scientists. Award or honor granted for academic or artistic career Department of Computer Science Jul 2024 Publications Postdoc publications and citations link to academic retention and faculty success Yueran Duan, Shahan Ali Memon, Bedoor AlShebli, Qing Guan, Petter Holme, Talal Rahwan 2025 Proceedings of the National Academy of Sciences of the United States of America Temporal Link Prediction in Social Networks Based on Agent Behavior Synchrony and a Cognitive Mechanism Yueran Duan, Mateusz Nurek, Qing Guan, Radoslaw Michalski, Petter Holme 2025 IEEE Transactions on Computational Social Systems Static network structure cannot stabilize cooperation among large language model agents Jin Han, Balaraju Battu, Ivan Romić, Talal Rahwan, Petter Holme 2025 PloS One Social networking agency and prosociality are inextricably linked in economic games Danyang Jia, Ivan Romić, Lei Shi, Qi Su, Chen Liu, Jinzhuo Liu, Petter Holme, Xuelong Li, Zhen Wang 2025 Nature Human Behaviour Human mobility in epidemic modeling Xin Lu, Jiawei Feng, Shengjie Lai, Petter Holme, Shuo Liu, Zhanwei Du, Xiaoqian Yuan, Siqing Wang, Yunxuan Li, Xiaoyu Zhang, Yuan Bai, Xiaojun Duan, Wenjun Mei, Hongjie Yu, Suoyi Tan, Fredrik Liljeros 2025 Physics Reports Quantifying the weakness of ties with hierarchy-based link centrality Jianhong Mou, Longyun Wang, Kang Wen, Bitao Dai, Suoyi Tan, Fredrik Liljeros, Petter Holme, Xin Lu 2025 Science China Information Sciences Navigation on temporal networks Omar F. Robledo, Petter Holme, Huijuan Wang 2025 Applied Network Science Measuring and utilizing temporal network dissimilarity Xiu Xiu Zhan, Chuang Liu, Zhipeng Wang, Huijuan Wang, Petter Holme, Zi Ke Zhang 2025 Communications Physics Public Health Impact of Paxlovid as Treatment for COVID-19, United States Yuan Bai, Zhanwei Du, Lin Wang, Eric H.Y. Lau, Isaac Chun Hai Fung, Petter Holme, Benjamin J. Cowling, Alison P. Galvani, Robert M. Krug, Lauren Ancel Meyers 2024 Emerging Infectious Diseases Epidemic criticality in temporal networks Chao Ran Cai, Yuan Yuan Nie, Petter Holme 2024 Physical Review Research",
  "content_length": 3148,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:02"
}