{
  "name": "Phaneendra K. Yalavarthy",
  "homepage": "https://cds.iisc.ac.in/faculty/yalavarthy",
  "status": "success",
  "content": "Phaneendra K. Yalavarthy - Home Page PHANEENDRA K. YALAVARTHY Home Research Publications ResumeLinks Home Research Group Research in News Research Activities Administrative Duties Education Research Interests Teaching Upcoming Events Opportunities Prospective Students IISc Quotes Contact Updated on: Oct-12-2025. I am a faculty member (Professor) of Department of Computational and Data Sciences (CDS), Indian Institute of Science (IISc), Bangalore, India. Research Activities: Chief Project Manager (P.I.), TANUH: AI-CoE in Healthcare at IISc. Convenor, Medical Imaging Group (MIG), CDS, IISc. Faculty Associate, Interdisciplinary Mathematical Sciences, IISc. MIG Monthly Research Seminars (Intra-IISc link). MIG Journal Club (Intra-IISc link). Education: B.Sc./M.Sc. (Physics), Sri Sathya Sai University, Prasanthi Nilayam (India) 2001. M.Sc. (Engineering), Indian Institute of Science (IISc), Bangalore (India) 2004. Ph.D.  (Engineering Sciences), Dartmouth College, Hanover (USA) 2007. Research Interests: Artificial Intelligence for Medical Imaging, Computational methods in Medical Imaging, Perfusion imaging, Medical Image Processing (reconstruction/analysis), Inverse problems in Imaging, Imaging in Digital Rock, and Cyber-Physical Systems. Teaching: August-December, 2024: DS 288 (3:0)/UE 201: Numerical Methods. August-December, 2022: DS 261(3:1): AI for Medical Image Analysis (Jointly with Prasad S. Murthy, GE Healthcare) January-April, 2022: DS 260 (3:0): Medical Imaging. August-December, 2021: DS 288 (3:0)/UE 201: Numerical Methods. August-December, 2021:  Executive program on Digital Health and Imaging. Mar-June, 2021: DS 294 (3:0): Data Analysis and Visualization. [Intra-IISc Link] February-July, 2021: Executive program on Digital Health and Imaging. October 2020-January 2021: DS 200 (0:1): Research Methods. [Link] August 2020-January, 2021: Executive program on Digital Health and Imaging. January-April, 2020: DS 260 (3:0): Medical Imaging. August-December, 2019: DS 288 (3:0)/UE 201: Numerical Methods. August-December, 2019: DS 200 (0:1): Research Methods. [Link] January-April, 2019: DS 260 (3:0): Medical Imaging. January-April, 2019: DS 294 (3:0): Data Analysis and Visualization. August-December, 2018: DS 211 (3:0): Numerical Optimization (Jointly with Atanu Mohanty). January-April, 2018: DS 200 (0:1): Research Methods. [Link] January-April, 2018: DS 260 (3:0): Medical Imaging. January-April, 2017: DS 294 (3:1): Data Analysis and Visualization. January-April, 2017: DS 260 (3:0): Medical Imaging. August-December, 2016: DS 288 (3:1): Numerical Methods. January-April, 2016: UE 201 (2:1): Introduction to Scientific Computing. August-December, 2014: SE 284 (2:1): Numerical Linear Algebra. August-December, 2014: SE 288 (3:1): Numerical Methods. January-April, 2014: SE 360 (JAN) 3:0: Topics in Medical Imaging January-April, 2013: SE 360 (JAN) 3:0: Topics in Medical Imaging. August-December, 2012: SE 284 (AUG) 2:1: Numerical Linear Algebra. January-April, 2012: SE 260 (JAN) 3:0: Medical Imaging. August-December, 2011: SE 288 (AUG) 3:1: Numerical Methods. January-April, 2011: SE 260 (JAN) 3:0: Medical Imaging. August-December, 2010: SE 284 (AUG) 2:1: Numerical Linear Algebra (Jointly with Murugesan Venkatapathi) August-December, 2009: SE 260 (AUG) 3:0: Medical Imaging. January-April, 2009: SE 289 (JAN) 3:1: Numerical Solutions of Differential Equations (Jointly with Apoorva Patel). Upcoming Events: Research Opportunities for Students: Prospective Students Note to the prospective visiting (short term/project) students. Famous Quotes about IISc in IISc: IISc provides you skills necessary to grab an opportunity, what is missing is sense and understanding of outside world, can there be a course on that?. - IISc Alumni, March 2020. The best days of IISc are yet to come, it is only 100 years old!. - IISc Alumni, March 2013. Today IISc is standing on hallow academic empires, here hardly 1% of people can survive on their own and rest 99% pretend to be in this 1%. - Over heard at Prakruti, December 2012. IISc is the only place, where the advisor works harder than the student. - J. Haritsa, SERC, IISc (in welcome address to new students, SERC, 2010). The campus of IISc is an addiction.  - Famous quote among IISc students, 2002. You thought that getting into IISc is most difficult, getting out is even more difficult - N. Balakrishnan, SERC, IISc (in welcome address to new students, SERC, 2011). Nothing is good enough in IISc or for IIScians, because what IISc is best at is offering criticism. - Over heard in the C-mess of IISc while having lunch, 2003. You think that Bangalore is lethargic, IISc is ten times more lethargic. - G. Mehta, Ex-Director, IISc (in welcome address to new students, 2001). If you think that IISc is going to do something for you, you are barking at the wrong tree. Only those people who take advantage of IISc can succeed in here. - G. Mehta, Ex-Director, IISc (in welcome address to new students, 2001). Contact: Phaneendra K. Yalavarthy, Ph.D. Room No: 305 Department of Computational and Data Sciences (CDS) Indian Institute of Science, Bangalore India  560012. Tel. No: +91-80-2293 2496. E-mail: yalavarthy # iisc.ac.in (or) phaneendra.yalavarthy#tanuh.ai (replace # by @). phaneendra.k.yalavarthy # gmail.com (replace # by @) [I do not have any-other e-mail id] Copyright Â© 2025-2028 Phaneendra K. Yalavarthy, CDS, IISc. All Rights Reserved.",
  "content_length": 5436,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:03"
}