{
  "name": "Philip C. Treleaven",
  "homepage": "http://www0.cs.ucl.ac.uk/staff/p.treleaven",
  "status": "success",
  "content": "Philip Treleaven Prof Philip Colic Treleaven (born 1950) is an Engineer and Computer Scientist specializing in Financial Computing, and Tech Entrepreneur. He is Professor of Computer Science at University College London (UCL). Former Pro-Provost International for UCL, and former Director UK Centre for Financial Computing. Education and early life Philip Treleaven was born in 1950 and grew up on a small farm in Cornwall. Advice from a family friend suggested a career in the emerging area of computers. First-generation to study Computer Science as an Undergrad getting to meet many early computer pioneers. During his career he lectured in 60 countries and graduated around 90 PhD students. He attended a Trade school in Cornwall. Followed by an MSc and PhD at the University of Manchester, famous for its pioneering work on early computers. Career and research Treleaven is known for his eclectic research interests covering novel Computer Architecture, Financial Computing, Government Innovation programs, Algorithmic Trading, RegTech Regulation, 3D Body Scanning, Creative Industries tech, and Tech Entrepreneurship etc. Novel computer architecture He did early work on Data Flow computer architectures.[1] subsequently used in Field Programmable Gate Arrays. Current computer architecture interests include Quantum computers and DNA programmable biological microcomputers[2]. Government Advisor on innovation programs He has acted as Advisor to governments on Industry Research Programs, including the Japans Ministry of Industry Fifth Generation program[3] (which led to government programs world-wide), and the European Commission ESPRIT program. Most recently he was Chair of the Luxembourg Research Council (FNR) FinTech panel. Financial Computing Treleaven established the UCL Financial Computing Research Group over 30 years ago. His research students developed the first Insider Dealing Detection system for the London Stock Exchange, and then developed early systems for financial fraud detection, launching the SearchSpace company. Working with Dr Giuseppe Nuti (Deutsche Bank), he helped develop the first Algorithmic Trading platform[4][5] in Europe, and working with Dr Dan Brown (UCL, MegaNexus) and Brit Insurance they developed the Ki-Insurance Algorithmic underwriting platform. The first in Europe. Treleaven was also Director of the Doctoral Training Centre in Financial Computing[6][7] that graduated over 230 PhDs. Automated Regulation Treleaven has worked closely with the UK Financial Conduct Authority (FCA) on the automation of regulation. Helping to establish their Tech Sprints (cf. hackathons), Sandbox innovation program and developing RegTech proof of concept software. Treleaven is credited with coining the term RegTech[8][9]. UK National Sizing survey (SizeUK) In 2000 Treleaven was the Director of the UK National Sizing Survey (SizeUK)[10][11][12] which used of 3D whole body surface scanners in partnership with the 14 largest UK clothing companies. SizeUK measured 11,000 UK adults to provide a reference body dataset for creating better fitting clothing. SizeUK also discovered the average UK ladies waists had increased by 12/30cm in 20 years! SizeUK led to similar national sizing surveys in most developed countries, including the USA, Germany, France, Italy, Spain etc. Tech Entrepreneurship Treleaven is passionate about encouraging entrepreneurship[13]. He taught the first UCL Tech Entrepreneurship course in 1995. UCL spins out large numbers of start-ups. The most famous been DeepMind, purchased by Google. He has co-founded over 9 start-ups. ConceptionX and VCs will launch a \"Treleaven Entrepreneurship\" annual award this year. AI for Social Good Treleaven, working with Dr Dan Brown (UCL, MegaNexus) has a program called AI for Social Good[14]. The program uses GenAI to support socially excluded and disadvantaged groups (e.g., people in prison, people on probation, refugees, long-term unemployed, low-aspiration young people in education), thereby transforming their future and addressing major social problems. The program provides Generative AI personalized education for the UK Prison and Probation Service for felons to help stop them reoffending. The UK has over 80,000 prisoners and education is the best deterrent to reoffending, which costs £18bn ($23b) pa. Publications and lecturing Treleaven has authored over 200 papers and lectured in 60 countries. Highlights in 1980 included a lecture tour of the Soviet Union including Novosibirsk Siberia (-30°C to -40°C) and China just after Mao Zedong, including a visit to the newly unearthed Terracotta Army in Xian. Personal life He is married to Isabel, who has held senior positions in Regulation and Compliance in IMRO (precursor of the UK Financial Conduct Authority) and many of the leading Financial Institutions, such as HSBC, Barclays and Citigroup. Including being Chief Control Office at HSBC. Unusually, Treleaven is a National-level Target shooter and has also written the UK Target Shooting Handbook: Art of Shooting[15]. References [1]         Philip Treleaven, David Brownbridge, Richard Hopkins, Data-Driven and Demand-Driven Computer Architecture, ACM Computing Surveys, Volume 14, Issue 1, March 1982 pp 93143 https://doi.org/10.1145/356869.356873 [2]         Philip Treleaven, Future Computers: digital, quantum, biological, IEEE COMPUTER, Volume: 54, Issue: 8, August 2021, https://ieeexplore.ieee.org/document/9504488 [3]         Philip Treleaven, Isabel Gouveia-Lima, Japan's Fifth Generation Computer Systems, IEEE COMPUTER, Volume: 15, Issue: 8, August 198, https://ieeexplore.ieee.org/document/1654113 [4]         Giuseppe Nuti, Mahnoosh Mirghaemi, Philip Treleaven, Chaiyakorn Yingsaeree, Algorithmic Trading, IEEE COMPUTER, Volume: 44, Issue: 11, November 2011, https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=5696713 [5]         Philip Treleaven, Michal Galas, Vidhi Lalchand, Algorithmic Trading Review, November 2013, Communications of the ACM 56(11):76-85, DOI: 10.1145/2500117 [6]         UK Research and Innovation EPSRC CENTRE for DOCTORAL TRAINING in Financial Computing & Analytics, https://gtr.ukri.org/projects?ref=EP%2FL015129%2F1 (retrieved January 2025). [7]         School for Quants, Financial Times Magazine, https://www.ft.com/content/0664cd92-6277-11e1-872e-00144feabdc0 [8]         Philip Treleaven, Financial Regulation of Fintech, Journal of Financial Perspectives, Vol. 3, No. 3, 2015, https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3084015 [9]         Philip Treleaven, Jeremy Barnett; Adriano Koshiyama, Algorithms: Law and Regulation, IEEE COMPUTER, Volume: 52 Issue: 2, February 2019, https://ieeexplore.ieee.org/document/8672418/authors#authors [10]       Jeni Bougourd, Philip Treleaven, UK National Sizing Survey (SizeUK), International Conference on 3D Body Scanning Technologies, Lugano, Switzerland, 19-20 October 2010, https://proc.3dbody.tech/papers/2010/10327_32bougourd.pdf [11]       Philip Treleaven, Sizing Us Up, IEEE Spectrum, April 2004, https://spectrum.ieee.org/sizing-us-up [12]       Philip Treleaven, Jonathan Wells, 3D Body Scanning and Healthcare Applications, IEEE COMPUTER, Volume: 40, Issue: 7, July 2007, https://ieeexplore.ieee.org/document/4287239 [13]       Sumi Helal, Philip Treleaven (Eds), Venture Scientists and Technology Entrepreneurship, Special issue IEEE COMPUTER, Volume: 57, Issue: 5, May 2024, https://ieeexplore.ieee.org/document/10517683 [14]       Philip Treleaven, Daniel Brown, AI for Social Good, SSRN Open Archive, March 2024, https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4746471 (retrieved January 2025). [15]       Philip Treleaven, Art of Shooting, Amazon, www.amazon.co.uk/Art-Shooting-Prof-Philip-Treleaven/dp/149613754X External links Official website (http://www.cs.ucl.ac.uk/people/P.Treleaven.html)",
  "content_length": 7851,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:09"
}