{
  "name": "Philippe Salembier",
  "homepage": "https://imatge.upc.edu/web/people/philippe-salembier",
  "status": "success",
  "content": "Philippe Salembier | Image Processing Group Skip to main content Image Processing Group Signal Theory and Communications Department Universitat Politècnica de Catalunya. BARCELONATECH People Publications Projects Demos Teaching Contact Search form Search User login Log in using UPC credentials Log in using UPC credentials Log in using UPC credentials Username * Password * Log in using UPC credentials Cancel CAS login Philippe Salembier Position e-mail Professor philippe.salembier@upc.edu Office Phone D5-202 +34 934 054 030 Journals Books Conferences Theses Other Projects Research Demos Teaching Biography Philippe Salembier received an engineering degree from the Ecole Polytechnique, Paris, France, in 1983 and an engineering degree from the Ecole Nationale Supérieure des Télécommunications, Paris, France, in 1985. From 1985 to 1989, he worked at Laboratoires d'Electronique Philips, Limeil-Brevannes, France, in the fields of digital communications and signal processing for HDTV. In 1989, he joined the Signal Processing Laboratory of the Swiss Federal Institute of Technology in Lausanne, Switzerland, to work on image processing and received a PhD in 1991. At the beginning of 1992, after a stay at the Harvard Robotics Laboratory as a Postdoctoral Fellow, he joined the Technical University of Catalonia, Barcelona, Spain, where he is currently professor lecturing on the area of digital signal and image processing. His research interests include image and video sequence processing, compression and indexing, mathematical morphology, level sets and nonlinear filtering, as well as remote sensing image processing and signal processing tools for genomics. In terms of standardization activities, he has been involved in the definition of the MPEG-7 standard (\"Multimedia Content Description Interface\") as chair of the \"Multimedia Description Scheme\" group between 1999 and 2001. He served as a Associate Editor of various journals including the Journal of Visual Communication and Image Representation (Academic Press), Signal Processing (Elsevier), Signal Processing: Image Communication (Elsevier), the Eurasip Journal on Image and Video Processing, the IEEE Transactions on Image Processing, the IEEE Transactions on Circuits and Systems for Video Technology and the IEEE Signal Processing Letters. He was member of the Image and Multidimensional Signal Processing Technical Committee of the IEEE Signal Processing Society between 2000-2006, an AdCom officer of the European Association for Signal Processing (EURASIP) between 1994-1999 and was technical chair (with Prof. Ed. Delp) of the IEEE Int. Conf. on Image Processing, ICIP'2003 organized in Barcelona. Philippe Salembier is a Fellow of the IEEE. Journal Articles top 2024 J. Perez-Cano, Valero, I. Sansano, Anglada, D., Pina, O., Salembier, P., and Marqués, F., “Combining graph neural networks and computer vision methods for cell nuclei classification in lung tissue”, Heliyon, vol. 10, no. 7, 2024.DOI Google Scholar BibTex (4.05 MB) 2023 M. Pardàs, Anglada, D., Espina, M., Marques, F., and Salembier, P., “Stromal tissue segmentation in Ki67 histology images based on cytokeratin-19 stain translation”, JOURNAL OF MEDICAL IMAGING, vol. 10, no. 3, 2023.DOI Google Scholar BibTex (13.78 MB) 2022 T. Sunn Pedersen, et, al, Casas, J., and Salembier, P., “Experimental confirmation of efficient island divertor operation and successful neoclassical transport optimization in Wendelstein 7-X”, Nuclear Fusion, vol. 62, no. 4, 2022.DOI Google Scholar BibTex (2.24 MB) 2021 A. Puig-Sitjes, Jakubowski, M., Naujoks, D., Gao, Y., Drewelow, P., Niemann, H., Felinger, J., Casas, J., Salembier, P., and Clemente, R., “Real-time detection of overloads on the plasma-facing components of Wendelstein 7-X”, Applied sciences (Basel), vol. 11, no. 24, 2021.DOI Google Scholar BibTex (6.09 MB) 2019 P. Salembier, Liesegang, S., and López-Martínez, C., “Ship Detection in SAR Images Based on Maxtree Representation and Graph Signal Processing”, IEEE Transactions on Geoscience and Remote Sensing, vol. 57, no. 5, pp. 2709 - 2724, 2019.Google Scholar BibTex (5.5 MB) see all Book Chapters and Bookstop 2019 P. Bellot, Salembier, P., Pham, N. C., and Meyer, P. E., “Unsupervised GRN Ensemble”, in Sanguinetti G., Huynh-Thu V. (eds) Methods in Molecular Biology , vol. 1883, New York, NY: Springer science, Humana Press, 2019, pp. 283-302.DOI Google Scholar BibTex 2018 G. Tochon, Dalla Mura, M., Veganzones, M. A., Valero, S., Salembier, P., and Chanussot, J., “Advances in utilization of hierarchical representations in remote sensing data analysis”, in Reference Module in Earth Systems and Environmental Sciences, vol. 2, Elsevier, 2018, pp. 77-107.Google Scholar BibTex 2015 J. Digne, Dimiccoli, M., Sabater, N., and Salembier, P., “Neighborhood Filters and the Recovery of 3D Information”, in Handbook of Mathematical Methods in Imaging, 2nd ed., Springer Verlag, 2015, pp. 1645-1673.Google Scholar BibTex 2011 J. Digne, Dimiccoli, M., Salembier, P., and Sabater, N., “Neighborhood Filters and the Recovery of 3D Information”, in Handbook of Mathematical Methods in Imaging, Springer Verlag, 2011, pp. 1203-1229.Google Scholar BibTex 2010 B. Marcotegui and Salembier, P., “Compression”, in Morphologie Mathématique II: estimation choix et mise en oeuvre, L. Najman and H. Talbot (Eds.)., Hermes, Lavoisier, 2010.Google Scholar BibTex see all Conference Papers top 2025 L. Sáez, Rabanaque, S., Casas, J., Marqués, F., and Salembier, P., “Closing the Loop: Continuous AI Model Improvement Through Pathologist-Guided Feedback”, in 21st European Congress on Digital Pathology, Barcelona, 2025.Google Scholar BibTex (92.01 KB) 2024 D. Anglada, Sala, J., Marqués, F., Salembier, P., and Pardàs, M., “Enhancing Ki-67 Cell Segmentation with Dual U-Net Models: A Step Towards Uncertainty-Informed Active Learning”, in IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) Workshops, 2024.Google Scholar BibTex (838.72 KB) 2021 A. Puig-Sitjes, Casas, J., Salembier, P., Vizcarro, D., Clemente, R., Jakubowski, M., Gao, Y., and Team, W. 7- X., “Spatio-temporal Detection and Tracking of Thermal Events on the Plasma Facing Components of Wendelstein 7-X”, in 4th IAEA Technical Meeting on Fusion Data Processing, Validation and Analysis, Shanghai (online), 2021.Google Scholar BibTex A. Puig-Sitjes, Jakubowski, M., Gao, Y., Drewelow, P., Niemann, H., Fellinger, J., Moncada, V., Pisano, F., Belafdil, C., Mitteau, R., Aumeunier, M. - H., Cannas, B., Casas, J., Salembier, P., Clemente, R., Dumke, S., Winter, A., Laqua, H., Bluhm, T., and Brandt, K., “Real-time detection of overloads on the PFCs of W7-X”, in European Conference on Plasma Diagnostics (ECPD 2021), online, 2021.Google Scholar BibTex (132.62 KB) 2020 A. Puig-Sitjes, Jakubowski, M., Fellinger, J., Drewelow, P., Gao, Y., Niemann, H., Sunn-Pedersen, T., König, R., Naujoks, D., Winter, A., Laqua, H., Dumke, S., Moncada, V., Belafdil, C., Mitteau, R., Aumeunier, M. - H., Pisano, F., Aymerich, E., Cannas, B., Kocsis, G., Szepesi, T., Cseh, G., Szabolics, T., Casas, J., Morros, J. R., Salembier, P., Clemente, R., Cobos, M., Caminal, I., A. Corral, P., A. Punzano, M., and S. Lopera, Q., “Strategy for the real-time detection of thermal events on the plasma facing components of Wendelstein 7-X”, in 31st Symposium on Fusion Technology (SOFT2020), Dubrovnik, Croatia, 2020.Google Scholar BibTex see all Theses top 2017 P. Bellot, “Study of Gene Regulatory Networks Inference Methods from Gene Expression Data”, 2017.Google Scholar BibTex (2.73 MB) 2014 G. Palou, “Monocular Depth Estimation in Images and Sequences using Occlusion Cues”, 2014.Google Scholar BibTex (107.61 MB) M. Bosio, “Hierarchical information representation and efficient classification of gene expression microarray data”, Universitat Politecnica de Catalunya, Barcelona, 2014.Google Scholar BibTex (2.76 MB) 2011 S. Valero, “Hyperspectral image representation and Processing with Binary Partition Trees”, Universitat Politècnica de Catalunya (UPC), 2011.Google Scholar BibTex (20.92 MB) 2010 J. Rolón, “Generalized Lifting for Sparse Image Representation and Coding”, Universitat Politècnica de Catalunya (UPC), 2010.Google Scholar BibTex see all Other top 2011 G. Palou and Salembier, P., “Monocular Depth Ordering Using Occlusion Cues”, Technical University of Catalonia, Barcelona, 2011.Google Scholar BibTex Report 1999 J. Llach and Salembier, P., “Analysis of Video Sequence. Method for Defining the Structure of a Video Sequence. Part I”, U.S. Patent 994025948-1999.Google Scholar BibTex Patent J. Llach and Salembier, P., “Analysis of Video Sequence. Method for Defining the Structure of a Video Sequence. Part II”, U.S. Patent 994026615-1999.Google Scholar BibTex Patent 1997 M. Pardàs, Salembier, P., Ayuso, X., and Martí, E., “Video coding method and corresponding coding and decoding systems”, U.S. Patent 9693276.5-1997.Google Scholar BibTex Patent 1996 A. Oliveras, Salembier, P., and Garrido, L., “Filtering Method and Corresponding Filtering System”, U.S. Patent 96402925.0-1996.Google Scholar BibTex Patent see all Projects top DIORAMA: Data-centric AI for medical imaging National Sep 2024 Dec 2027 AI-Enhanced Fiber-Wireless Optical 6G Network in Support for Connected Mobility European Jan 2024 Dec 2026 Piano & AI Other Jul 2021 Sep 2026 DigiPatICS: Projecte d'optimització del diagnòstic anatomopatòleg en xarxa als hospitals de l'Institut Català de la Salut a través de la digitalització i eines d'intel·ligència Artificial Other Oct 2020 Dec 2025 Image processing for Plasma Facing Components protection European Jan 2019 Dec 2022 see all Research Areas top Biomedical Applications Internal Jan 2012 Dec 2026 Remote Sensing Image Processing Internal Jan 2010 Jun 2021 Region-based image and video processing Internal Jan 1992 Dec 2020 Demos and Resources top AI4EU Grape Dataset Dataset Nov 2021 Binary Partition Tree for Polarimetric SAR data Software Sep 2015 Netw",
  "content_length": 11024,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:20"
}