{
  "name": "Philip K. McKinley",
  "homepage": "http://www.cse.msu.edu/~mckinley",
  "status": "success",
  "content": "Personal Page - Philip K. McKinley (Phil McKinley), Department of Computer Science Philip K. McKinley Professor Emeritus Department of Computer Science and Engineering Michigan State University Ph.D., University of Illinois at Urbana-Champaign Short Biography Curriculum Vitae (PDF) Contact Information I retired in 2025 after 35 years at Michigan State. My greatest joy in that time has been teaching, advising and mentoring young people. If you are one of them and happen across this page, drop me an email - I'd love to hear about your career and adventures. Research Enhancing the robustness, resiliency and security of autonomous vehicles. My recent research combined a digital twin framework with adversarial search methods and rigorous software engineering techniques in order to reveal and mitigate \"unlikely-but-possible\" situations (a.k.a. corner cases) that might arise due to unwanted feature interactions, unanticipated environmental conditions, human error, and novel attack vectors. We constructed an experimental platform, EvoRally, a 1:5-scale autonomous vehicle with a top speed of 60 mph, based on a physical design developed at Georgia Tech. Relevant Topics: Evolutionary robotics, high-assurance software, autonomous systems, cybersecurity, digital twins, learning-enabled system components, software engineering, Robot Operating System (ROS), self-adaptive systems, autonomic computing, cyber-physical systems, assurance cases, artificial life. Publications from Research Projects: Publications from Research Projects (2011 - 2020) (2007-2010) (2001-2006) (1987-2000) Harnessing Digital Evolution - 2008 IEEE Computer article on using artificial life to help construct robust software Composing Adaptive Software - 2004 IEEE Computer article on a taxonomy of adaptive software methods Other Research Projects: MAPE-SAC (AFRL): Uncertainty-Aware Certification of Assurance for Autonomous Systems X-PLORE (AFRL): Mitigating Uncertainty in High-Assurance Software Systems Evolution Park (NSF): An Evolutionary Robotics Habitat for the Study of Crawling, Swimming and Flying Creatures BEACON (NSF): An NSF Center for the Study of Evolution in Action TEAMS (NSF): Transplanting Artificial Life Behaviors to Mobile Robots Orchid (NSF): Harnessing Digital Evolution to Design High-Assurance Adaptive Systems AWARE (ARO): Adaptive Software Monitoring for Critical Infrastructure Protection RAPIDware (ONR): Adaptive Middleware for Heterogeneous Mobile Computing Meridian (NSF): Automated Development of Distributed Systems Software Earlier Research Projects Affiliations: Software Engineering and Network Systems (SENS) Laboratory BEACON Science and Technology Center Ecology, Evolutionary Biology, and Behavior Graduate Program Teaching Teaching Statement CSE 325, Computer Systems: Spring 2024, Fall 2023, Spring 2023, Fall 2022, Spring 2022, Fall 2021 CSE 422, Computer Networks: Spring 2021, Fall 2019, Fall 2018, Fall 2017, Fall 2016, Fall 2014, ... CSE 410, Operating Systems: Fall 2020, Spring 2020, Spring 2019, Spring 2018, Spring 2016, ... CSE 910, Special Topic: Systems Foundations of Cloud Computing and the Internet of Things: Spring 2017 CSE 824, Advanced Computer Networks and Communications: Fall 2023 CSE 912, Advanced Topics in Distributed Systems: Artificial Life Communities: Spring 2011 CSE 910, Special Topic: Biologically-Inspired Design of Networks and Distributed Systems: Spring 2010 Other Pointers Michigan State University MSU Department of Computer Science MSU College of Engineering For newcomers to Lansing Author: Phil McKinley",
  "content_length": 3574,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:09"
}