{
  "name": "Philipp Koehn",
  "homepage": "http://www.cs.jhu.edu/~phi",
  "status": "success",
  "content": "Philipp Koehn philipp koehn Professor at The Johns Hopkins University Department of Computer Science Hackerman 227 3400 North Charles Street Baltimore, MD 21218-2608 Fon: 1 410 516-3427 Mail: phi@jhu.edu Wikipedia Google Scholar ACL Fellow, 2024. IAMT Award of Honor, 2015. My work is currently focused on machine translation, but more broadly defined, my interest is to make use of the vast amount of information that is available in digital form. My book on neural machine translation is now available at amazon.com. My previous book on statistical machine translation is also still available at amazon.com. Find out about the Machine Translation Group. Come and join our weekly meeting! teaching EN 601.467/667 Introduction to Human Language Technology, Fall 2019-2025 EN 601.229 Computer Systems Fundamentals, Fall 2016, Spring 2018, Fall 2019 EN 601.464/664 Artificial Intelligence, Fall 2015, Spring 2017, 2019, 2020, 2024, 2025 EN 601.468/668 Machine Translation, Spring 2015, 2016, Fall 2017, 2018, 2020-2025 EN 601.868 Selected Topics in Machine Translation, every Spring and Fall software and resources Statistical Machine Translation Website Moses, an open source statistical machine translation system SMT Research Survey Wiki, a Wiki covering all research publications in statistical machine translation Computer Aided Translation Tool CASMACAT, CASMACAT project Pharaoh, 2003, 2004, a beam search decoder for phrase-based statistical machine translation models (replaced by Moses) Parallel Corpus European Parliament Proceedings, 2001, 2003, 2007. German-English Parallel Corpus \"de-news\", Daily News 1996-2000, 2000. media Straight Arrow News, 2025 il venerdì (Italian), 2024 The Global Podcast, 2020 Interview with NPR, 2018 Translation Europe Forum JIAMCATT, UN, 2015 Talk at Yandex CNN, 2013 Edinburgh inaugural lecture European Inventor Award, 2013 finalist French TV, 2010 phd students Rachel Wicks (with Matt Post) Elina Baral Bismarck Odoom Weiting Tan graduated phd students Haoran Xu, 2024 Elizabeth Salesky, 2024 Kelly Marchisio, 2023 Xutai Ma, 2022 Shuoyang Ding, 2022 Huda Khayrallah, 2021 Gaurav Kumar, 2021 Brian Thompson, 2020 Adithya Renduchintala, 2020 Rebecca Knowles, 2019 Maria Nadejde, 2017 Liane Guillou, 2016 Eva Hasler, 2015 Philip Williams, 2014 Michael Auli, 2012 Loïc Dugast, 2012 Hieu Hoang, 2011 Abhishek Arun, 2010 publications Recent and upcoming papers may appear on arXiv. 2025 Machine Translation in the Era of Large Language Models:A Survey of Historical and Emerging Problems, Duygu Ataman, Alexandra Birch, Nizar Habash, Marcello Federico, Philipp Koehn, and Kyunghyun Cho, Information, vol. 16, art. 723, 2025, pdf, bib. Learn and Unlearn: Addressing Misinformation in Multilingual LLMs, TaiMing Lu and Philipp Koehn, Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 Speech Vecalign: an Embedding-based Method for Aligning Parallel Speech Documents, Chutong Meng and Philipp Koehn, Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 Seeing is Believing: Emotion-Aware Audio-Visual Language Modeling for Expressive Speech Generation, Weiting Tan, Jiachen Lian, Hirofumi Inaguma, Paden Tomasello, Philipp Koehn, and Xutai Ma, Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP) - Findings, 2025 HiMATE: A Hierarchical Multi-Agent Framework for Machine Translation Evaluation, Shijie Zhang, Renhao Li, Songsheng Wang, Philipp Koehn, Min Yang, and Derek F. Wong, Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP) - Findings, 2025 Streaming Sequence Transduction through Dynamic Compression, International Conference on Spoken Language Translation, Weiting Tan, Yunmo Chen, Tongfei Chen, Guanghui Qin, Haoran Xu, Heidi C. Zhang, Benjamin Van Durme and Philipp Koehn, International Conference on Spoken Language Translation (IWSLT), 2025 X-ALMA: Plug & play modules and adaptive rejection for quality translation at scale, Haoran Xu, Kenton Murray, Philipp Koehn, Hieu Hoang, Akiko Eriguchi and Huda Khayrallah, Proceedings of the International Conference on Learning Representations (ICLR), 2025, pdf, bib. HadaSmileNet: Hadamard fusion of handcrafted and deep-learning features for enhancing facial emotion recognition of genuine smiles, Mohammad Junayed Hasan, Nabeel Mohammed, Shafin Rahman, and Philipp Koehn, Proceedings of the IEEE International Conference on Data Mining (ICDM), 2025. 2024 Self-Supervised Normalization for Non-autoregressive Speech-to-speech Translation, Weiting Tan, Jingyu Zhang, Lingfeng Shen, Daniel Khashabi, Philipp Koehn, Proceedings of the Conference on Neural Information Processing Systems (NeurIPS), 2024, pdf. Can Synthetic Speech Improve End-to-End Conversational Speech Translation?, Bismarck Bamfo Odoom, Nathaniel Robinson, Elijah Rippeth, Luis Tavarez-Arce, Kenton Murray, Matthew Wiesner, Paul McNamee, Philipp Koehn, Kevin Duh, Proceedings of the 16th Conference of the Association for Machine Translation in the Americas (Volume 1: Research Track), pdf, bib. Speech Data from Radio Broadcasts for Low Resource Languages, Bismarck Bamfo Odoom, Leibny Paola Garcia Perera, Prangthip Hansanti, Loïc Barrault, Christophe Ropers, Matthew Wiesner, Kenton Murray, Alexandre Mourachko, Philipp Koehn, Proceedings of the International Conference on Spoken Language Translation (IWSLT), 2024, pdf, bib. Neural Methods for Aligning Large-Scale Parallel Corpora from the Web for South and East Asian Languages, Philipp Koehn, Proceedings of the Ninth Conference on Machine Translation (WMT), 2024, pdf, bib. Benchmarking Visually-Situated Translation of Text in Natural Images, Elizabeth Salesky, Philipp Koehn and Matt Post, Proceedings of the Ninth Conference on Machine Translation (WMT), 2024, pdf, bib. Recovering document annotations for sentence-level bitext, Rachel Wicks, Matt Post, Philipp Koehn, Findings of the 2024 Conference of the Association for Computational Linguistics (ACL), 2024, pdf, bib. The language barrier: Dissecting safety challenges of llms in multilingual contexts, Lingfeng Shen, Weiting Tan, Sihao Chen, Yunmo Chen, Jingyu Zhang, Haoran Xu, Boyuan Zheng, Philipp Koehn, Daniel Khashabi, Findings of the 2024 Conference of the Association for Computational Linguistics (ACL), 2024, pdf, bib. Pointer-Generator Networks for Low-Resource Machine Translation: Don't Copy That!, Niyati Bafna, Philipp Koehn, David Yarowsky, Proceedings of the Fifth Workshop on Insights from Negative Results in NLP, 2024, pdf, bib. Findings of the WMT24 General Machine Translation Shared Task: The LLM Era Is Here but MT Is Not Solved Yet, Tom Kocmi, Eleftherios Avramidis, Rachel Bawden, Ondřej Bojar, Anton Dvorkovich, Christian Federmann, Mark Fishel, Markus Freitag, Thamme Gowda, Roman Grundkiewicz, Barry Haddow, Marzena Karpinska, Philipp Koehn, Benjamin Marie, Christof Monz, Kenton Murray, Masaaki Nagata, Martin Popel, Maja Popović, Mariya Shmatova, Steinþór Steingrímsson and Vilém Zouhar, Proceedings of the Ninth Conference on Machine Translation (WMT), 2024, pdf, bib. Findings of the WMT 2024 Shared Task of the Open Language Data Initiative, Laurie V. Burchell, Jean Maillard, Antonios Anastasopoulos, Christian Federmann, Philipp Koehn and Skyler Wang, Proceedings of the Ninth Conference on Machine Translation (WMT), 2024, pdf, bib. Findings of the WMT 2024 Shared Task on Discourse-Level Literary Translation, Longyue Wang, Siyou Liu, Chenyang Lyu, Wenxiang Jiao, Xing Wang, Jiahao Xu, Zhaopeng Tu, Yan Gu, Weiyu Chen, Minghao Wu, Liting Zhou, Philipp Koehn, Andy Way and Yulin Yuan, Proceedings of the Ninth Conference on Machine Translation (WMT), 2024, pdf, bib. Error Norm Truncation: Robust Training in the Presence of Data Noise for Text Generation Models, Tianjian Li, Haoran Xu, Philipp Koehn, Daniel Khashabi, Kenton Murray, Proceedings of the International Conference on Machine Learning (ICML), 2024, pdf. Narrowing the Gap between Zero- and Few-shot Machine Translation by Matching Styles, Weiting Tan, Haoran Xu, Lingfeng Shen, Shuyue Stella Li, Kenton Murray, Philipp Koehn, Benjamin Van Durme, Yunmo Chen, Findings of the Annual Meeting of the North American Chapter of the Association for Computational Linguistics (NAACL), 2024, pdf, bib. Where are you from? Geolocating Speech and Applications to Language Identification, Patrick Foley, Matthew Wiesner, Bismarck Bamfo Odoom, Leibny Paola Garcia Perera, Kenton Murray, Philipp Koehn, Proceedings of the Annual Meeting of the North American Chapter of the Association for Computational Linguistics (NAACL), 2024, pdf, bib. 2023 Multilingual Pixel Representations for Translation and Effective Cross-lingual Transfer, Elizabeth Salesky, Neha Verma, Philipp Koehn, Matt Post, Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 13845-13861, 2023, pdf, bib. Small data, big impact: Leveraging minimal data for effective machine translation, Jean Maillard, Cynthia Gao, Elahe Kalbassi, Kaushik Ram Sadagopan, Vedanuj Goswami, Philipp Koehn, Angela Fan, Francisco Guzman, Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL), pages 2740-2756, 2023, pdf, bib. Condensing Multilingual Knowledge with Lightweight Language-Specific Modules, Haoran Xu, Weiting Tan, Shuyue Li, Yunmo Chen, Benjamin Van Durme, Philipp Koehn, Kenton Murray, Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 1575-1587, 2023, pdf, bib. Multilingual Representation Distillation with Contrastive Learning, Weiting Tan, Kevin Heffernan, Holger Schwenk, Philipp Koehn, Proceedings of the 17th Conference of the European Chapter of the Association for Computational Linguistics (EACL), pages 1477-1490, pdf, bib. Machine Translation with Large Language Models: Prompting, Few-shot Learning, and Fine-tuning with QLoRA, Xua",
  "content_length": 68654,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:16"
}