{
  "name": "Philip Terrill",
  "homepage": "https://researchers.uq.edu.au/researcher/1138",
  "status": "success",
  "content": "Associate Professor Philip Terrill | UQ Experts Skip to menu Skip to content Skip to footer Associate Professor Philip Terrill Email: pterrill@eecs.uq.edu.au Phone: +61 7 336 58312 Positions Associate Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background I was awarded my PhD in biomedical engineeering in January 2011; and since then I have been employed at the University of Queensland as a lecturer in Electrical & Biomedical Engineering a within the school of IT and Electrical Engineering. I am trained as a biomedical engineer, and my overarching interest is the development of novel medical diagnostic tools and therapies with the goal improving the health outcomes of people in Australia and globally. My current research is focussed on the application of electronic instrumentation, mathematical modelling and signal's processing to pediatric and adult respiratroy and sleep medicine medicine, and I regard my research strength to be the ability to bridge the gap between clinical physiology and biomedical engineering. In particular: The development of novel instrumentation and mathematical modelling to better understand the physiology underlying disease; and The application of engineering and mathematics to translate recent advances in the understanding of physiology to the clinical environment My current research themes include: Quantifying (\"phenoyping\") the contribution of ventilatory control \"loop gain\" to obstructive sleep apnoea in the clinical environment Development of novel instrumentation to quantify head and torso posuture during sleep, and it's influence on obstructive sleep apnoea severity Developing novel actigraphy systems (using high temporal resolution accelerometry) to quantify sleep disturbance in children Quantifying cardio-respiratory stability in pre-term neonates I'm currently the Discipline Leader for Imaging Sensing and Biomedical Engineering within the School of Electrical Engineering and Computer Science (EECS). Read more Read less Availability Associate Professor Philip Terrill is: Available for supervision Media expert Fields of research Biomedical engineering Qualifications Bachelor (Honours) of Engineering, The University of Queensland Doctor of Philosophy, The University of Queensland Research interests Investigating sleep disorders in children and adults, with the goal of developing diagnostic, and treatment technologies Read more Read less Design of novel biological and biomedical transducers Read more Read less Design of novel electronic instrumentation systems for application to clinical medicine, and for testing clinical and physiological hypotheses Read more Read less Investigation of biological and physiological systems using non-linear mathematical tools, chaos theory, and signal's processi Read more Read less The practical implementation of effective engineering education Read more Read less View all research interests View less Works Search Professor Philip Terrill’s works on UQ eSpace All (118) Journal Article (46) Other Outputs (1) Conference Publication (71) Featured 2014 Journal Article Quantifying the ventilatory control contribution to sleep apnoea using polysomnography Terrill, Philip I., Edwards, Bradley A., Nemati, Shamim, Butler, James P., Owens, Robert L., Eckert, Danny J., White, David P., Malhotra, Atul, Wellman, Andrew and Sands, Scott A. (2014). Quantifying the ventilatory control contribution to sleep apnoea using polysomnography. European Respiratory Journal, 45 (2), 408-418. doi: 10.1183/09031936.00062914 Quantifying the ventilatory control contribution to sleep apnoea using polysomnography 2025 Journal Article “Sleep on side”: Awareness and anxiety around sleeping position during late pregnancy Wilson, Danielle L., Mann, Dwayne L., Szollosi, Irene, Callaway, Leonie, Kothari, Alka and Terrill, Philip (2025). “Sleep on side”: Awareness and anxiety around sleeping position during late pregnancy. Women and Birth, 38 (6) 102121, 102121. doi: 10.1016/j.wombi.2025.102121 “Sleep on side”: Awareness and anxiety around sleeping position during late pregnancy 2025 Conference Publication O002 Machine learning applied to oximetry to detect paediatric sleep apnoea Kevat, A, Iyer, K, Terrill, P, Lingawi, S, Kuo, C, Wensley, D, Suresh, S and Collaro, A (2025). O002 Machine learning applied to oximetry to detect paediatric sleep apnoea. Oxford University Press (OUP). doi: 10.1093/sleepadvances/zpaf053.002 O002 Machine learning applied to oximetry to detect paediatric sleep apnoea 2025 Journal Article Obstructive sleep apnea diagnosis and management in First Nations communities: protocol for the Let’s Yarn About Sleep-Obstructive Sleep Apnea Program Fatima, Yaqoot, Edmed, Shannon L., Von Senden, Roslyn, Bucks, Romola S., Nasir, Bushra, Sullivan, Daniel P., Potia, Azhar Hussain, Maddison, Kathleen, Williams, Wayne, Woodroffe, Tracy, Joosten, Simon, Olaithe, Michelle, Robinson, Mark, Lawson, Lauren P., Coussens, Scott, Wallace, Ruth, Solomon, Shaun, Chai-Coetzer, Ching Li, Eckert, Danny, Machan, Elizabeth A., Dunne, Neil, King, Stephanie, Nicholls, Charmaine, Mann, Dwayne, Terrill, Philip, Fanti, Markesh, Ashby, Caitie, Hava, Alvin and Skinner, Timothy (2025). Obstructive sleep apnea diagnosis and management in First Nations communities: protocol for the Let’s Yarn About Sleep-Obstructive Sleep Apnea Program. Sleep Advances, 6 (4) zpaf061, 1-10. doi: 10.1093/sleepadvances/zpaf061 Obstructive sleep apnea diagnosis and management in First Nations communities: protocol for the Let’s Yarn About Sleep-Obstructive Sleep Apnea Program 2025 Journal Article Sleep fragmentation and hypoxaemia as key indicators of cognitive impairment in patients with obstructive sleep apnoea Georgeson, Thomas, Atkins, Lacey, Zahnleiter, Alex, Terrill, Philip I., Eeles, Eamonn, Coulson, Elizabeth J. and Szollosi, Irene (2025). Sleep fragmentation and hypoxaemia as key indicators of cognitive impairment in patients with obstructive sleep apnoea. Sleep Science and Practice, 9 (1) 2, 1-11. doi: 10.1186/s41606-024-00120-9 Sleep fragmentation and hypoxaemia as key indicators of cognitive impairment in patients with obstructive sleep apnoea 2024 Conference Publication High resolution measurement of sleep position during pregnancy and the impact on infant birthweight Wilson, D., Mann, D., Szollosi, I., Callaway, L., Kothari, A. and Terrill, P. (2024). High resolution measurement of sleep position during pregnancy and the impact on infant birthweight. Sleep DownUnder 2024, Gold Coast, QLD Australia, 16-19 October 2024. Oxford, United Kingdom: Oxford University Press. doi: 10.1093/sleepadvances/zpae070.106 High resolution measurement of sleep position during pregnancy and the impact on infant birthweight 2024 Conference Publication Performance of a machine-learning based automated oximetry algorithm for detection of sleep apnoea in children Kevat, A., Hartnett, C., Suresh, S., Terrill, P. and Iyer, K. (2024). Performance of a machine-learning based automated oximetry algorithm for detection of sleep apnoea in children. Sleep DownUnder 2024, Gold Coast, QLD Australia, 16-19 October 2024. Oxford, United Kingdom: Oxford University Press. doi: 10.1093/sleepadvances/zpae070.043 Performance of a machine-learning based automated oximetry algorithm for detection of sleep apnoea in children 2024 Conference Publication Ventilatory burden predicts change in self‑reported sleepiness following continuous positive airway pressure treatment in obstructive sleep apnoea Staykov, E., Mann, D., Duce, B., Kainulainen, S., Leppänen, T., Töyräs, J., Azarbarzin, A., Sands, S. and Terrill, P. (2024). Ventilatory burden predicts change in self‑reported sleepiness following continuous positive airway pressure treatment in obstructive sleep apnoea. 2024 Australasian Sleep Association, Gold Coast, QLD Australia, 16-19 October 2024. Oxford, United Kingdom: Oxford University Press. doi: 10.1093/sleepadvances/zpae070.090 Ventilatory burden predicts change in self‑reported sleepiness following continuous positive airway pressure treatment in obstructive sleep apnoea 2024 Conference Publication Development and Evaluation of Two Non-Invasive Approaches for Estimating Breath-by-Breath Ventilatory Drive in Obstructive Sleep Apnea Patients Zhang, J., Mann, D., Leppänen, T., Sands, S. and Terrill, P. (2024). Development and Evaluation of Two Non-Invasive Approaches for Estimating Breath-by-Breath Ventilatory Drive in Obstructive Sleep Apnea Patients. Sleep DownUnder 2024, Gold Coast, QLD Australia, 16-19 October 2024. Oxford, United Kingdom: Oxford University Press. doi: 10.1093/sleepadvances/zpae070.034 Development and Evaluation of Two Non-Invasive Approaches for Estimating Breath-by-Breath Ventilatory Drive in Obstructive Sleep Apnea Patients 2024 Conference Publication Investigating the effects of airflow signal filtering on non-invasively quantified estimates of flow limitation Mann, D., Staykov, E., Sands, S. and Terrill, P. (2024). Investigating the effects of airflow signal filtering on non-invasively quantified estimates of flow limitation. 2024 Australasian Sleep Association, Gold Coast, QLD Australia, 16-19 October 2024. Oxford, United Kingdom: Oxford University Press. doi: 10.1093/sleepadvances/zpae070.040 Investigating the effects of airflow signal filtering on non-invasively quantified estimates of flow limitation 2024 Conference Publication O004 Incorporating arousals into sleep vs. wakefulness classification outperforms traditional binary classification at 1-second epoch resolution Somaskandhan, P., Korkalainen, H., Leppänen, T., Töyräs, J., Melehan, K., Wilson, D., Ruehland, W., Mann, D. and Terrill, P. (2024). O004 Incorporating arousals into sleep vs. wakefulness classification outperforms traditional binary classification at 1-second epoch resolution. Sleep DownUnder 2024, Gold Coast, QLD Australia, 16-19 October 2024. Oxford, United K",
  "content_length": 19794,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:13"
}