{
  "name": "Philipp Cimiano",
  "homepage": "http://ekvv.uni-bielefeld.de/pers_publ/publ/PersonDetail.jsp?personId=15020699",
  "status": "success",
  "content": "Philipp Cimiano - PEVZ - Universität Bielefeld Zum Hauptinhalt springen Universität Bielefeld Play rectangle-plus PEVZ Personen- und Einrichtungssuche Weitere Links Startseite Funktionsträger Meine Personendaten Einrichtungen einbinden Meine Uni App Verlauf Cimiano, Philipp, Prof. Dr. BIS Links Hilfe & Kontakt Zur BIS Homepage Personen- und Einrichtungssuche Weitere Links Startseite Funktionsträger Meine Personendaten Einrichtungen einbinden Meine Uni App Verlauf Cimiano, Philipp, Prof. Dr. BIS Links Hilfe & Kontakt Zur BIS Homepage Personen- und Einrichtungssuche Herr Prof. Dr. Philipp Cimiano Kontakt 1. Technische Fakultät / Arbeitsgruppen / AG Semantische Datenbanken E-Mail cimiano@techfak.uni-bielefeld.de Homepage Öffnen Telefon +49 521 106-12249 Telefon Sekretariat +49 521 106-12212 − Sekretariat zeigen Büro CITEC 2-307 − Lage-/Raumplan Kontakt im Adressbuch speichern 2. Center for Cognitive Interaction Technology CITEC / Vorstand CITEC-Koordinator / Vorstandsmitglied E-Mail cimiano@cit-ec.uni-bielefeld.de Telefon +49 521 106-12249 Telefon Sekretariat +49 521 106-12212 − Sekretariat zeigen Büro CITEC 2-307 − Lage-/Raumplan Kontakt im Adressbuch speichern 3. Center for Cognitive Interaction Technology CITEC / Beteiligte Forschungsgruppen / Semantische Datenbanken E-Mail cimiano@cit-ec.uni-bielefeld.de Telefon +49 521 106-12249 Telefon Sekretariat +49 521 106-12212 − Sekretariat zeigen Büro CITEC 2-307 − Lage-/Raumplan Erreichbarkeit Sprechstunde Donnerstag von 13:00 Uhr - 14:00 Uhr(Terminvereinbarung über Sekretariat Frau Svenja Berg) Kontakt im Adressbuch speichern 4. Center for Cognitive Interaction Technology CITEC / Beteiligte Forschungsgruppen / Semantische Datenbanken AG Semantische Datenbanken E-Mail cimiano@cit-ec.uni-bielefeld.de Kontakt im Adressbuch speichern 5. Technische Fakultät / Kommissionen und Ausschüsse / Fakultätskonferenz / Hochschullehrerinnen und Hochschullehrer Mitglied E-Mail cimiano@techfak.uni-bielefeld.de Kontakt im Adressbuch speichern 6. Technische Fakultät / Kommissionen und Ausschüsse / Prüfungsausschüsse Vorsitz Master ISY E-Mail cimiano@techfak.uni-bielefeld.de Kontakt im Adressbuch speichern 7. Technische Fakultät / Kommissionen und Ausschüsse / Forschung, wissenschaftlicher Nachwuchs E-Mail cimiano@techfak.uni-bielefeld.de Kontakt im Adressbuch speichern 8. Technische Fakultät / Kommissionen und Ausschüsse / Habilitationsausschuss Mitglied E-Mail cimiano@techfak.uni-bielefeld.de Kontakt im Adressbuch speichern 9. Technische Fakultät / Kommissionen und Ausschüsse / Forschung, wissenschaftlicher Nachwuchs Vorsitz E-Mail cimiano@techfak.uni-bielefeld.de Kontakt im Adressbuch speichern 10. Zentrum für Statistik 11. Scientific Data Services / Bielefeld Center for Data Science (BiCDaS) 12. Center for Cognitive Interaction Technology CITEC / IKM-Verantwortliche Verantwortlicher für Information, Kommunikation und Medien (IKM) 13. Institut für Bioinformatik-Infrastruktur (BIBI) 14. Institut für Bioinformatik-Infrastruktur (BIBI) / DILS-Faculty 15. Technische Fakultät / Beauftragte / Datenschutz- und Informationssicherheitskoordinator*innen (DISK) Datenschutz- und Informationssicherheitskoordinator 16. SFB / Transregio 318 “Constructing Explainability“ Stellvertretender Sprecher 17. SFB / Transregio 318 “Constructing Explainability“ / TRR 318 Projektbereich B: Soziale Praxis / TRR 318 Teilprojekt B01: Modelle des maschinellen Lernens mit einem dialogbasierten Ansatz erklären Projektleiter 18. SFB / Transregio 318 “Constructing Explainability“ / TRR 318 Projektbereich C: Darstellung und Berechnung von Erklärungen / TRR 318 Teilprojekt C05: Erklärbare Entscheidungen in kooperativer Mensch-Maschine-Interaktion finden Projektleiter 19. SFB / Transregio 318 “Constructing Explainability“ / TRR 318 Teilprojekt INF: Kriterien für die Bewertung von Erklärungsqualität Projektleiter 20. Joint Research Center on Cooperative and Cognition-enabled AI Ko-Sprecher 21. Technische Fakultät / Kommissionen und Ausschüsse / Lenkungsausschuss Promotionsstudiengang Bioinformatik MitgliedGruppe der Hochschullehrer*innen Modulverantwortlicher für 23-LIN-BaLin1-Inf Einführung Linguistik für Informatik-Studierende 39-IndErg-LUV Menschliches und maschinelles Lernen und Verstehen 39-Inf-10_a Datenbanken und Informationssysteme 39-Inf-DB2 Datenbanken II 39-Inf-ELSI Ethical, Legal and Social Impacts 39-Inf-SNLP Statistical Natural Language Processing 39-Inf-WP-IG Informatik & Gesellschaft (Basis) 39-Inf-WP-IG-x Informatik & Gesellschaft (Schwerpunkt) 39-M-Inf-AI-app Applied Artificial Intelligence 39-M-Inf-AI-app-foc_a Applied Artificial Intelligence (focus) 39-M-Inf-GP Grundlagenprojekt Intelligente Systeme 39-M-Inf-MA_IISY_a Masterarbeit 39-M-Inf-P Projekt 39-M-Inf-RDM Research Data Management 39-M-Inf-SW Semantic Web 39-M-Inf-TMKD Text Mining and Knowledge Discovery 39-M-INT1 International Courses in Data Science 1 39-M-INT2 International Courses in Data Science 2 39-M-INT3 International Courses in Data Science 3 39-M-INT4 International Courses in Data Science 4 39-M-INT5 International Courses in Data Science 5 39-M-INT6 International Courses in Data Science 6 Curriculum Vitae Philipp Cimiano studierte Informatik an der Universität Stuttgart und der University of South Australia in Adelaide. Nach seinem Diplom-Abschluss in Informatik promovierte am Karlsruhe Institute of Technology (KIT) am Lehrstuhl von Prof. Dr. Rudi Studer am Institut für Angewandte Informatik und Formale Beschreibungsverfahren (AIFB). Für seine Dissertation erhielt er den Carl-Adam-Petrie Preis der Fakultät für Wirtschaftswissenschaften am KIT. Seine Habilitation und Venia Legendi in Angewandter Informatik erhielt er ebenfalls vom KIT. Nach einer kurzen Zeit als Assistenzprofessor an der Technischen Universität Delft wurde er mit 31 Jahren an die Technische Fakultät der Universität Bielefeld berufen. Er fand früh seine Begeisterung, noch während seiner Diplomarbeit, für Forschungsthemen an der Schnittstelle zwischen Sprache, Semantik und Wissen. An dieser Schnittstelle forscht er heute noch aktiv. Im Zuge seiner Mitgliedschaft als Principal Investigator am Cognitive Interaction Technology Excellence Center erweiterte er sein Horizont und methodisches Spektrum in Richtung kognitiver Systeme die in der realen Welt handeln und interagieren. Er verfolgt die Vision von sprach-basierten interaktive intelligenten Systemen, die umfassendes Wissen über ihren Anwendungsbereich besitzen und dieses Wissen nutzen, um zielführend und situativ angemessen zu handeln. Aktuelle Forschungsthemen Wissensrepräsentation, OntologienWissensbasierte SprachverarbeitungErklärbare Künstliche IntelligenzKI in der Medizin Mitgliedschaften und Funktionen Koordinator Cognitive Interaction Technology Center (CITEC)Direktor des Joint Artificial Intelligence Institutes (JAII)Mitglied der NFDI ExpertenkommissionMitherausgeber Journal of Applied OntologyEditorial Board Mitglied Journal of Web SemanticsArea Editor Semantic Web JournalEditorial Board Mitglied Journal of Semantic Computing Seitenleiste Forschung Mein Forschungsprofil Publikationen Aktuelle Forschungsthemen Mitgliedschaften und Funktionen Lehre Lehrveranstaltungen Wochenplan Modulverantwortlichkeiten Curriculum Vitae Curriculum Vitae Fehler gefunden? Kontaktpersonen für Korrekturwünsche Mein PEVZ Anrufumleitung einrichten Curriculum Vitae bearbeiten Bild ersetzen / löschen Aktuelle Forschungsthemen, Mitgliedschaften und Funktionen bearbeiten Meine E-Mailverteiler Visitenkarten und Türschilder Quicklinks Verlinkung / Einbindung Seite zum Handy schicken Scannen Sie den QR-Code: Zum Seitenanfang",
  "content_length": 7636,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:13"
}