{
  "name": "Phillip B. Gibbons",
  "homepage": "http://www.cs.cmu.edu/~gibbons",
  "status": "success",
  "content": "Phillip B. Gibbons Phillip B. Gibbons Professor Computer Science Department Electrical & Computer Engineering Department Carnegie Mellon University Pittsburgh, PA gibbons@cs.cmu.edu Office: 7221 Gates-Hillman Center Mini-Bio Phil Gibbons is a Professor in the Computer Science Department and the Electrical & Computer Engineering Department at Carnegie Mellon University. He received his Ph.D. in Computer Science from the University of California at Berkeley in 1989. Gibbons was a researcher in the Mathematical Sciences Research Center at AT&T Bell Laboratories (1990-1996), the Information Sciences Research Center at Lucent Bell Laboratories (1996-2001), and the Intel Research Pittsburgh Lablet (2001-2011). He was Co-PI/Co-Director for the $15M Intel Science and Technology Center for Cloud Computing (2011-2015). Gibbons' research areas include parallel computing, machine learning systems, computer architecture, databases and distributed systems. His publications span theory and systems, across a broad range of computer science and engineering (e.g., conference papers in AAAI, AISTATS, APoCS, ASP-DAC, ASPLOS, ATC, ESA, EuroSys, ICAPS, ICML, ICRA, IPDPS, ISCA, ISPASS, MICRO, MLSys, NeurIPS, NSDI, OSDI, SIGMETRICS, SOCC, SOSP, SPAA, and VLDB since 2016). My Publication List (from DBLP) My Google Scholar page My CV Note: Everything below here has not been updated since 2019 News Our paper on pipelined parallel deep learning was accepted to SOSP'19. Congrats to lead student authors Aaron Harlap and Deepak Narayanan! New Conference:  1st SIAM Symposium on Algorithmic Principles of Computing Systems (APoCS'20) I am teaching 18-613 \"Introduction to Computer Systems\" this Fall. This course is for CIT Masters students. I will be teaching 15-712 \"Advanced Operating and Distributed Systems\" in Spring 2020. Past Teaching 15-745 \"Optimizing Compilers for Modern Architectures\", Spring 2019, Spring 2018, Spring 2017, Spring 2016. 18-213 \"Introduction to Computer Systems\", Fall 2018, Fall 2017, Fall 2016. 15-829 \"Performance Engineering of Software Systems\", Fall 2017. 15-712 \"Advanced Operating and Distributed Systems\", Fall 2015. Current Research Projects Write-efficient Algorithms for Emerging Memory Technologies: Write-efficient algorithms and systems, for settings (such as emerging non-volatile memories) where writes are significantly more costly than reads. Funding provided by NSF. Big Learning Systems: Mapping out and exploring the space of large-scale machine learning from a systems' perspective. Funding provided by Intel and NSF. Intel Science and Technology Center for Visual Cloud Systems: An Intel-funded $4M+ research center at CMU focused on system support for video analytics. Selected Prior Research Projects Parlay: Algorithms, programmming abstractions, and runtime systems in support of deterministic parallelism. Congrats to Julian Shun for winning the 2015 ACM Dissertation Award as part of this project! Intel Science and Technology Center for Cloud Computing: A $15M+ research partnership among Intel, Carnegie Mellon, Georgia Tech, Princeton, UC Berkeley, and U. Washington (2011-2015) Hi-Spade: A hierarchy-savvy approach to algorithm design and systems for emerging parallel hierarchies. Log Based Architectures: Hardware-supported logging for program monitoring and recovery on CMPs. Sybil Defenses: Novel protocols to limit the impact of malicious users in distributed systems. IrisNet: A core architecture and software infrastructure for a worldwide sensor web. Aqua: Approximate query answering for fast exploratory data analysis of massive data sets (data warehouses). Compas: Improved modeling, algorithm design, and performance for networks, parallel disk systems, SMPs, and supercomputers. LPWA: Browse the web with greater privacy, convenience, and spam control. Claytronics: Programmable matter composed of myriad tiny robots. Selected Talks and Surveys (Note: Viewing ppt files in a browser may miss out on the animations.) How Emerging Memory Technologies will Have You Rethinking Algorithm Design (pptx, pdf) . Keynote Talk at the 35th ACM Symposium on Principles of Distributed Computing (PODC'16), Chicago, IL, July 2016. What's So Special About Big Learning?...A Distributed Systems Perspective (pptx, pdf) . Keynote Talk at the 36th IEEE International Conference on Distributed Computing Systems (ICDCS'16), Nara, Japan, June 2016. Big Data: Scale Down, Scale Up, Scale Out (pptx, pdf). Keynote Talk at the 29th IEEE International Parallel and Distributed Processing Symposium (IPDPS'15), Hyderabad, India, May 2015. The Intel Science & Technology Center for Cloud Computing (pptx, pdf). Distinguished Lecture at EPFL, School of Computer and Communication Sciences (IC), Lausanne, Switzerland, December 2013. Multi-core Computing - lecture 1 (pptx, ppt); Multi-core Computing - lecture 2 (pptx, ppt); Multi-core Computing - lecture 3 (pptx, ppt). Lectures at the MADALGO Summer School on Algorithms for Modern Parallel and Distributed Models, Aarhus University, Denmark, August 2012. Trumping the Multicore Memory Hierarchy with Hi-Spade (pptx). Distinguished Lecture at Cornell University, Department of Computer Science, Ithaca, NY, September 2011. Trumping the Multicore Memory Hierarchy with Hi-Spade (ppt). Keynote Talk at the 10th SIAM International Conference on Data Mining (SDM '10), Columbus, OH, April 2010. Theory: Asleep at the Switch to Many-core (ppt). Invited talk at the NSF-sponsored Workshop on Theory and Many-Cores, College Park, MD, April 2009. Hang On for The Ride: The Thrills and Spills of Sensornet Research (ppt). Keynote Talk at the 6th ACM International Conference on Embedded Networked Sensor Systems (SenSys '08), Raleigh, NC, November 2008. Fun with Networks: Social, Sensor, and Shape-Shifting (ppt). Keynote Talk at the 22nd International Symposium on Distributed Computing (DISC '08), Arcachon, France, June 2008. Data-Rich Computing: Where It's At (ppt). Invited talk at the 2008 Data-Intensive Computing Symposium, Sunnyvale, CA, March 2008. Distinct-Values Estimation over Data Streams (pdf). Invited book chapter for Data Streams Management: Processing High-Speed Data Streams, January 2007. IrisNet: A Planetary Scale Architecture for Multimedia Sensors (ppt). Last version of an invited talk on IrisNet given at various venues, including as keynote talks at DCOSS '05 and BaseNets '06, January 2007. Approximate Query Processing: Taming the TeraBytes (ppt). Tutorial presented at VLDB '01, Rome, Italy, September 2001. Synopsis Data Structures for Massive Data Sets (pdf). Invited book chapter for External Memory Algorithms, September 1998. Conferences Conferences I've published in include: ASPLOS, ATC, CCS, CIDR, CVPR, DCOSS, DSAA, ESA, EuroPar, EuroSys, FAST, FC, HiPEAC, HPCA, ICDCS, ICDE, ICDM, ICFP, ICPR, IPDPS, IPSN, ISCA, KDD, MICRO, Multimedia, NDSS, NeurIPS, NSDI, Oakland, OSDI, PACT, PLDI, PODC, PODS, PPoPP, SenSys, SIGCOMM, SIGMETRICS, SIGMOD, SoCC, SODA, SOSP, SPAA, VCIP and VLDB. Conferences I've served on the Program Committee for include: APoCS, ASPLOS, ATC, DCOSS, DISC, EuroSys, GreenCom, ICALP, IC2E, ICDCS, ICDE, ICDM, IPDPS, IPPS, IPSN, ISPAN, KDD, Middleware, OSDI, PACT, PODC, PPoPP, RTSS, SenSys, Sigmetrics, Sigmod, SoCC, SPAA, SPDP, SSDBM, STOC, SysML and VLDB. Recent Awards and Honors (2006-present) IEEE Fellow (inducted 2014) ACM Fellow (inducted 2006) More Effective Distributed ML via a Stale Synchronous Parallel Parameter Server, by Q. Ho, J. Cipar, H. Cui, S. Lee, J.K. Kim, P.B. Gibbons, G. Gibson, G. Ganger and E. Xing. Selected for Oral Presentation at NIPS '13 (only 20 selected out of 1420 submissions) DSybil: Optimal Sybil-Resistence for Recommendation Systems, by H. Yu, C. Shi, M. Kaminsky, P.B. Gibbons and F. Xiao. On the short list for the best paper award for Oakland '09 Flexible Hardware Acceleration for Instruction-Grain Program Monitoring, by S. Chen, M. Kozuch, T. Strigkos, B. Falsafi, P. Gibbons, T. Mowry, V. Ramachandran, M. Ryan, O. Ruwase and E. Vlachos. Selected for IEEE Micro's Top Picks from the 2008 Computer Architecture Conferences Space Profiling for Parallel Functional Programs, by D. Spoonhower, G.E. Blelloch, R. Harper and P.B. Gibbons. Selected for a special journal issue for the best papers in ICFP '08 Online Maintenance of Very Large Random Samples on Flash Storage, by S. Nath and P.B. Gibbons. Selected for a special journal issue for the best papers in VLDB '08 Optimal Inter-Object Correlation when Replicating for Availability, by H. Yu and P.B. Gibbons. Selected for a special journal issue for the best papers in PODC '07 SybilGuard: Defending Against Sybil Attacks via Social Networks, by H. Yu, M. Kaminsky, P.B. Gibbons and A. Flaxman. Selected for a special journal issue for the best papers in SIGCOMM '06 Availability of Multi-Object Operations, by H. Yu, P.B. Gibbons and S.K. Nath. Co-winner of the best paper award for NSDI '06 Note: Additional (pre-2006) professional awards and honors are listed in my c.v. Recent Professional Service (2010-present) Editor-in-Chief:  ACM Transactions on Parallel Computing (TOPC) (2012-2018), a new journal launched in January 2013 Editorial Board:  Journal of the ACM (2001-2018) Editorial Board:  IEEE Transactions on Cloud Computing (TCC) (2013-2017) Steering Committee Member:  ACM Symposium on Cloud Computing (SoCC)   (2018-present) Steering Committee Member:  IEEE International Conference on Distributed Computing in Sensor Systems (DCOSS)   (2004-present) Steering Committee Member   ACM Symposium on Parallelism in Algorithms and Architectures (SPAA)   (2000-present). Conference Chair (head of Steering Committee), 2003-2007. Steering Committee Member:  ACM International Conference on Embedded Networked Sensor Systems (SenSys) (2007-2010) Program Committee:  3rd Conference on Systems and Machine Learning (SysML'20) Program Committee:  1st SIAM Symposium on Algorithmic Principles of Computing Systems (APoCS'20) Program Committee:  2019 ",
  "content_length": 14503,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:21"
}