{
  "name": "Philippos Pouyioutas",
  "homepage": "https://www.unic.ac.cy/pouyioutas-philippos",
  "status": "success",
  "content": "Professor Philippos Pouyioutas - University of Nicosia Skip to content APPLY Professor Philippos Pouyioutas Professor Philippos Pouyioutas Rector Professor School of Sciences and Engineering Department of Computer Science Member of the Council, Member of the Senate 22841572 [email protected] Central Building, 2nd Floor, A202 Brief CV Full CV Research Profile https://orcid.org/0000-0002-8476-1928 Google Scholar Dr Philippos Pouyioutas is Professor of Computer Science and the Rector of the University of Nicosia. He studied at the University of London (BSc Computer Science – Queen Mary College – 1988, MSc Databases and Information Systems – Birkbeck College – 1989, PhD Object-Oriented Databases – Birkbeck College – 1996). His doctoral degree studies were funded by scholarships from the University of London, the Overseas Research Scholarship (ORS) Award Scheme and the Leventis Foundation. Professor Pouyioutas also holds a Certificate in Teaching/Learning in Higher Education from the University of North London (1993). Prior to his return to Cyprus, he was a full-time lecturer (1992-1996) and the Director of the BSc programme in Business Information Systems (1993-1996) at the University of North London, teaching at undergraduate and postgraduate level. He also taught at Birkbeck College at postgraduate level from 1989 to 1996. He returned to Cyprus in 1996 and worked at Intercollege (1996-2007) where he served as coordinator of the Computer Science and Multimedia programmes, Director and Associate Academic Dean of Academic Affairs and as a chairperson of the Research Committee. He was/is in charge of the quality assurance/accreditation of Intercollege/University of Nicosia and their programmes of study. Professor Pouyioutas is the Vice President of the Cyprus Rectors’ Conference (2023-2024), previously serving as the General Secretary (2022-2023) a member of the Europe Regional Committee of the Association of Commonwealth Universities  (2020 – present) and a member of the Rectors Governing Board (2021 – present) of the NEOLAiA European University Alliance https://neolaiacampus.eu/. In the past, he has served from May 2007 to September 2014 as a Bologna Expert/Promoter for Cyprus and has been invited in Cyprus and abroad (UK, Greece, Malta, Israel) to deliver presentations on the Bologna Process and the European Higher Education Area (EHEA) reforms. He has also served on the Council of the Cyprus State Scholarship Foundation (2013-2017). He served (2015-2023) as a member of the Working Group of Quality Assurance of EURASHE (European Association of Institutions in Higher Education) and as an evaluation expert (2018) for the TESLA Adaptive Trust based e-assessment System for Learning https://tesla-project.eu/, a major European funded project for developing an e-invigilation system and an associated quality assurance framework. In June 2018, he chaired the External Evaluation Committee which evaluated the implementation of TeSLA at the UK Open University. He has developed software tools for implementing/adopting Learning Outcomes and ECTS in programmes of study, for mapping the National Qualifications Frameworks, for measuring the commitment of Higher Education institutions to teaching/learning quality, for measuring the commitment of EU member states to e-learning and for measuring the quality of e-learning. He successfully co-ordinated the applications of the University of Nicosia for the Diploma Supplement Label and the ECTS Label, which were awarded to the University, in 2010 (renewed 2013) and 2012 respectively. In 2016, he served as a member of the External Institutional Evaluation Committee that evaluated the Piraeus University of Applied Sciences, whereas in 2013 he served as chair and member of External Evaluation Committees that evaluated 1st cycle (Bachelor) and 2nd Cycle (Master) Computer Science programmes in Lithuania (Vilnius University, Kaunas University of Technology, Lithuanian University of Educational Sciences, Mykolas Romeris University, Vytautas Magnus University). He has also served as a member of international ranking/promotion committees for Universities/institutions in Greece. During his academic career, he has served as a chair, editor of proceedings and member of scientific committees of International Conferences and International Journals, and served/serves as supervisor of PhD students in the areas of Database Systems and Quality Assurance in e-learning. His research interests include 5G Networks, Relational and Object-Oriented Databases, Graphical and Visual Interfaces, Intranets and Information Technology, Quality Assurance in Higher Education and E-Learning. His research work has been supported by various research grants and has been published in International Conference Proceedings, Journals and Books (more than 100 publications). Professor Pouyioutas is an experienced project coordinator. He undertook and successfully co-ordinated and currently co-ordinating various major administrative/academic projects within the University, as well as major scientific and applied funded research projects of more than 25 million Euro. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 5770,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:23"
}