{
  "name": "Phillip Rogaway",
  "homepage": "http://www.cs.ucdavis.edu/~rogaway",
  "status": "success",
  "content": "Phillip Rogaway - Homepage Phillip Rogaway rogaway@cs.ucdavis.edu Department of Computer Science One Shields Ave University of California Davis, CA 95616 USA I am—or was—a professor in the Department of Computer Science at the University of California, Davis. I have also been a visiting professor at a bunch of places around the world, including many years at Chiang Mai University (TH) and extended stays at Chulalongkorn University (TH), ENS Paris (FR), ETH Zürich (CH), and the Isaac Newton Institute (UK). Most of my research has been on cryptography, the mathematical treatment of secure communication. I did my undergrad at UC Berkeley and my Ph.D. at MIT, in the Theory of Computation group, where I studied under Silvio Micali. After graduating (1991) I worked at IBM as a security architect, then came to UCD (1994), where I’ve been a professor ever since. Still, for a long time I managed to split my time about equally between the USA and Thailand. My research has focused on obtaining provably good solutions to protocol problems of utility to people’s privacy and security. I’ve been lucky enough to get some nice recognition for this work, including the Levchin prize (2016), PET Award (2015), IACR Fellow (2012), ACM Paris Kanellakis Award (2009), and the RSA Award in Mathematics (2003). In recent years I grew increasingly skeptical of the claimed benefits of CS, which routinely seem dwarfed by the harms we help cause. Correspondingly, I shifted much of my attention to social and ethical issues connected to technology, especially the climate crisis and the problem of mass surveillance. I shifted much of my university teaching to ethics (especially course ECS 188). I support social justice and environmental movements, including BLM, JVP, and XR. I am particularly appalled by Israel’s ongoing genocide of the Palestinians of Gaza. I retired from UCD in July of 2024, spending my last term teaching a course on cryptography and an experimental course on Black Mirror. I was sad to leave UCD, would have liked to work for several more years, but my views had drifted from those of my peers to an extent that I no longer felt comfortable where I was. Teaching has been as central to my life as research. I am honored to have taught thousands of university students, over the years, and some special elementary school, middle school, and high school students. These days, I’d be interested to get a position in a K-12 setting. I’ll soon do some mentoring for National Math Stars. Personal Zoom meeting room: https://ucdavis.zoom.us/j/4778298788 CV and related materials (I’d like to keep teaching, maybe K-12, and maybe work on curriculum.) Teaching: Course webpages · Teaching evaluations · ecs127.last-term (crypto) · ecs189.last-term (Black Mirror) · Advice to our CS/CSE undergrads Google Scholar list of my papers · DBLP list of my papers · Personal list of my papers · An old research summary Some cryptographic schemes of mine: AEZ · CMAC · DHIES · FF1 · OAEP · OCB · PSS · UMAC · XTS Sociopolitical essays: The Moral Character of Cryptographic Work (2015) · On Being a Computer Scientist Human Being in the Time of Collapse (2022) (last lecture in ecs20.W22) · Cancelling my Spring 2020 teaching (2020) · Radical CS (2023) (talk at NIST) · Lecture 10W: The Last Lecture: A dozen suggestions you probably don’t want to hear (2024) (ecs127.last-term) Further responses to the Snowden revelations: Statement of condemnation of U.S. mass-surveillance programs (2013) · An open letter from US researchers in cryptography and information security (2014) (organized by Joan Feigenbaum and me) (media coverage) · IACR’s Copenhagen Resolution (I wrote it) (2014) · Security of Symmetric Encryption against Mass Surveillance (2014) · Reimagining Secret Sharing (2020) · Anonymous AE (2022) My grad students Consulting Funding Personal information: my wife is Bongkotrattana Lailert. She goes by Kot (say goat quickly and with a low tone of voice). My son Banlu, age 15, loves rock climbing. He also competes. I am currently living full-time in Portland, Oregon. My sister, Jodi Walder, also lives in Portland. She is amazing at helping students navigate college admissions.",
  "content_length": 4192,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:22"
}