{
  "name": "Philip Dutré",
  "homepage": "https://sites.google.com/site/philipdutre",
  "status": "success",
  "content": "prof. dr. ir. Philip DutréSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcomeI am full professor (Dutch: Gewoon Hoogleraar) at the Department of Computer Science, Faculty of Engineering Science, KULeuven.I am heading the Computer Graphics group, advising several Ph.D. students and teaching various courses on computer graphics.I am currently chairing the Human Computer Interaction division of the Department of Computer Science.Online presence:Email (work): philip.dutre [AT] kuleuven [DOT] beEmail (private): philip [DOT] dutre [AT] gmail [DOT] com (2004)KULeuven Who's WhoSocial Media:Bluesky: @philipdutre.bsky.social  (2023)Mastodon: @philipdutre@mastodon.online (2022)Reddit: u/Phildutre (2016)LinkedIn (2004)Twitter: @philipdutre (2008, deactivated 2022)Google Plus (2012, deleted 2018)Facebook (2007, deactivated 2012, deleted 2017)Google ScholarAcademic Blog (Dutch) - musings about university life.Me next to TIntin's rocket in the Comics Art Museum in Brussels, January 2023. Reading Tintin's story \"Destination Moon\" was one of my inspirations for becoming interested in science and engineering.(This section in Dutch)Voor publieke voordrachten of lezingen, ook voor breed publiek, kan u me steeds via email contacteren.In het voorjaar van 2022 heb ik een lezing gegeven voor de \"Lessen voor de XXI Eeuw\", met als titel: \"Alan Turing: van 'Wat is berekenbaarheid' naar 'Wat is AI?'\"Computer Graphics: Kunst of Wetenschap / De Zoektocht naar Visueel Realisme / ... , over de technologie van computer graphic algoritmen en -visualisatie. Dit is mijn onderzoeksdomein, en kan dus zeer breed of zeer gespecialiseerd gaan.Wat is een Algoritme?, over hoe informatici naar algoritmen kijken en wat 'slimme' algoritmen nu precies zijn. Ik doceer diverse vakken over algoritmen in de opleidingen informatica en computerwetenschappen aan KU Leuven, dus hier voel ik me uiteraard ook als een vis in het water.Over het belang van lezen van boeken als wetenschapper ... zie voordracht November 2021 \"Wie Slim is Vist Hier\".... of meer in de hobbysfeer: \"Oorlogen in Miniatuur\", een niet-academisch topic over de geschiedenis van wargaming en waarom volwassen mannen met soldaatjes spelen. Dit is een onderwerp dat aansluit bij een persoonlijke interesse.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2351,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:06"
}