{
  "name": "Philip McMinn",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/phil-mcminn",
  "status": "success",
  "content": "Professor Phil McMinn | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Phil McMinn PhD School of Computer Science Professor of Software Engineering School PGR Lead Head of the Testing research group Open staff member portrait in a modal window p.mcminn@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Phil McMinn School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0001-9137-7433 Google Scholar Personal website Profile Phil McMinn is a Professor of Software Engineering who specialises in software testing. He primarily works on developing automated techniques to assist software engineers in developing test suites that are effective at finding bugs and are efficient to maintain.While he is well-known in the software testing field for his work in search-based automatic test data generation, his research has tackled a variety of problems including test flakiness, test oracles, and ensuring test quality through mutation analysis.His work has been funded by Meta (Facebook), the EPSRC, and HEFCE. Research interests Software testingSearch-based software engineering,Test oraclesTest flakinessMutation analysis Publications Journal articles Magill B & McMinn P (2025) deflake.rs: Detect Flaky Tests in Rust Projects using Execution Data. Journal of Open Source Software, 10(113), 8757-8757. Elgendy IT, Hierons RM & McMinn P (2025) A systematic mapping study of the metrics, uses and subjects of diversity‐based testing techniques. Software Testing, Verification and Reliability, 35(2). View this article in WRRO Parry O, Kapfhammer GM, Hilton M & McMinn P (2023) Empirically evaluating flaky test detection techniques combining test case rerunning and machine learning models. Empirical Software Engineering, 28. View this article in WRRO Parry O, Kapfhammer GM, Hilton M & McMinn P (2022) A survey of flaky tests. ACM Transactions on Software Engineering and Methodology, 31(1). View this article in WRRO Althomali I, Kapfhammer GM & McMinn P (2021) Automated visual classification of DOM-based presentation failure reports for responsive web pages. Software Testing, Verification and Reliability, 31(4). View this article in WRRO Mahajan S, Alameer A, McMinn P & Halfond WGJ (2021) Effective automated repair of internationalization presentation failures in web applications using style similarity clustering and search‐based techniques. Software Testing, Verification and Reliability, 31(10-2). View this article in WRRO Walsh TA, Kapfhammer GM & McMinn P (2020) Automatically identifying potential regressions in the layout of responsive web pages. Software Testing, Verification and Reliability, 30(6). View this article in WRRO McMinn PS, Wright CJ, McCurdy CJ & Kapfhammer GM (2019) Automatic detection and removal of ineffective mutants for the mutation analysis of relational database schemas. IEEE Transactions on Software Engineering, 45(5), 427-463. View this article in WRRO Hall M, Walkinshaw N & McMinn P (2018) Effectively incorporating expert knowledge in automated software remodularisation. IEEE Transactions on Software Engineering, 44(7), 613-630. View this article in WRRO Shamshiri S, Rojas J, Gazzola L, Fraser G, McMinn PS, Mariani L & Arcuri A (2018) Random or evolutionary search for object-oriented test suite generation?. Software Testing, Verification & Reliability, 28(4). View this article in WRRO McMinn P, Wright CJ & Kapfhammer GM (2015) The Effectiveness of Test Coverage Criteria for Relational Database Schema Integrity Constraints. ACM Transactions on Software Engineering and Methodology , 25(1). View this article in WRRO Kempka J, McMinn P & Sudholt D (2015) Design and analysis of different alternating variable searches for search-based software testing. Theoretical Computer Science, 605, 1-20. View this article in WRRO Barr ET, Harman M, McMinn P, Shahbaz M & Yoo S (2015) The Oracle Problem in Software Testing: A Survey. IEEE Transactions on Software Engineering, 41(5), 507-525. Shahbaz M, McMinn P & Stevenson M (2015) Automatic generation of valid and invalid test data for string validation routines using web searches and regular expressions. Science of Computer Programming, 97(4), 405-425. Fraser G, Arcuri A & McMinn P (2014) A Memetic Algorithm for whole test suite generation. Journal of Systems and Software, 103, 311-327. View this article in WRRO Fraser G, Arcuri A & McMinn P (2014) A Memetic Algorithm for whole test suite generation. Journal of Systems and Software. Anand S, Burke EK, Chen TY, Clark J, Cohen MB, Grieskamp W, Harman M, Harrold MJ & McMinn P (2013) An orchestrated survey of methodologies for automated software test case generation. Journal of Systems and Software. McMinn P (2012) An identification of program factors that impact crossover performance in evolutionary test input generation for the branch coverage of C programs. Information and Software Technology. Holcombe M, Adra S, Bicak M, Chin S, Coakley S, Graham AI, Green J, Greenough C, Jackson D, Kiran M , MacNeil S et al (2012) Modelling complex biological systems using an agent-based approach.. Integr Biol (Camb), 4(1), 53-64. McMinn PS, Harman M, Hassoun Y, Lakhotia K & Wegener J (2011) Input Domain Reduction through Irrelevant Variable Removal and its Effect on Local, Global and Hybrid Search-Based Structural Test Data Generation. IEEE Transactions on Software Engineering, 38(2), 453-477. (2011) Welcome Message from the Workshops Chair. 2011 IEEE Fourth International Conference on Software Testing, Verification and Validation Workshops, xiv-xiv. Lakhotia K, McMinn P & Harman M (2010) An empirical investigation into branch coverage for C programs using CUTE and AUSTIN. J SYST SOFTWARE, 83(12), 2379-2391. Harman M & McMinn P (2010) A Theoretical and Empirical Study of Search-Based Testing: Local, Global, and Hybrid Search. IEEE T SOFTWARE ENG, 36(2), 226-247. McMinn P, Binkley D & Harman M (2009) Empirical Evaluation of a Nesting Testability Transformation for Evolutionary Testing. ACM T SOFTW ENG METH, 18(3). Sun T, McMinn P, Holcombe M, Smallwood R & MacNeil S (2008) Agent based modelling helps in understanding the rules by which fibroblasts support keratinocyte colony formation.. PLoS One, 3(5), e2129. Kiran M, Coakley S, Walkinshaw N, McMinn P & Holcombe M (2008) Validation and discovery from computational biology models.. Biosystems, 93(1-2), 141-150. Harman M, Li Z & McMinn P (2008) Editorial: Testing practice and research.. Softw. Test. Verification Reliab., 18, 69-70. Sun T, McMinn P, Coakley S, Holcombe M, Smallwood R & Macneil S (2007) An integrated systems biology approach to understanding the rules of keratinocyte colony formation.. J R Soc Interface, 4(17), 1077-1092. McMinn P & Hierons RM (2006) Editorial: Addressing industrial challenges - UKTest 2005 and beyond. SOFTW TEST VERIF REL, 16(3), 131-132. Sun T, McMinn P, Coakley S, Holcombe M, Smallwood R & MacNeil S (2006) Development and validation of an agent-based computational model of normal human keratinocytes organisation in vitro. European Cells and Materials, 11(SUPPL.2), 28. McMinn P & Holcombe M (2006) Evolutionary testing using an extended Chaining Approach.. Evol Comput, 14(1), 41-64. McMinn P (2004) Search-based software test data generation: a survey. SOFTW TEST VERIF REL, 14(2), 105-156. Book chapters Roslan MF, Rojas JM & McMinn P (2022) An Empirical Comparison of EvoSuite and DSpot for Improving Developer-Written Test Suites with Respect to Mutation Score, Lecture Notes in Computer Science (pp. 19-34). Springer International Publishing Harman M, McMinn P, De Souza JT & Yoo S (2011) Search based software engineering: Techniques, taxonomy, tutorial (pp. 1-59). Harman M, Baresel A, Binkley D, Hierons R, Hu L, Korel B, McMinn P & Roper M (2008) Testability transformation - Program transformation to improve testability (pp. 320-344). Conference proceedings Osikowicz O, McMinn P & Shin D (2025) Empirically evaluating flaky tests for autonomous driving systems in simulated environments. 2025 IEEE/ACM International Flaky Tests Workshop (FTW). Ottawa, Ontario, Canada, 27 April 2025 - 27 April 2025. View this article in WRRO McMinn P, Roslan MF & Kapfhammer GM (2025) Beyond test flakiness: a manifesto for a holistic approach to test suite health. 2025 IEEE/ACM International Flaky Tests Workshop (FTW). Ottawa, Ontario, Canada, 27 April 2025 - 27 April 2025. View this article in WRRO Roslan MF, Rojas JM & McMinn P (2024) Viscount: a direct method call coverage tool for Java. 2024 IEEE International Conference on Software Maintenance and Evolution (ICSME) (pp 908-912). Flagstaff, AZ, USA, 6 October 2024 - 6 October 2024. View this article in WRRO Roslan MF, Rojas JM & McMinn P (2024) Private—Keep out? Understanding how developers account for code visibility in unit testing. 2024 IEEE International Conference on Software Maintenance and Evolution (ICSME) (pp 312-324). Flagstaff, AZ, USA, 6 October 2024 - 6 October 2024. View this article in WRRO Maton M, Kapfhammer G & McMinn P (2024) PSEUDOSWEEP: A pseudo-tested code identifier. 2024 IEEE International Conference on Software Maintenance and Evolution (ICSME) (pp 873-877). Flagstaff, AZ, USA, 6 October 2024 - 6 October 2024. View this article in WRRO Maton M, Kapfhammer G & McMinn P (2024) Exploring pseudo-testedness: empirically evaluating extreme mutation testing at the statement level. 2024 IEEE International Conference on Software Maintenance and Evolution (ICSME) (pp 587-598). Flagstaff, AZ, USA, 6 October 2024 - 6 October 2024. View this article in WRRO Elgendy I, Hierons R & Mcminn P (2024) Evaluating string distance metrics for reducing automatically generated test suites. AST '24: Proceedings of the 5th ACM/IEEE International Conference on Automation of Software Test (AST 2024) (pp 171-181). Lisbon, Portugal, 15 April 2024 - 15 April 2024. View",
  "content_length": 32973,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:10"
}