{
  "name": "Philip O. Ogunbona",
  "homepage": "https://documents.uow.edu.au/~philipo",
  "status": "success",
  "content": "New Page 1 Philip Ogunbona, B.Sc(Hons) (Ife), DIC, PhD(Lond), SMIEEE Philip was educated in Nigeria where he obtained the BSc(Hons)(1st Class) (Electronic and Electrical Engineering) from the University of Ife (now named Obafemi Awolowo University). He studied at the Department of Electrical and Electronic Engineering, Imperial College of Science, Medicine and Technology, University of London and obtained the DIC and PhD for research conducted in the field of Image Processing. He joined the University of Wollongong, School of Electrical, Computer and Telecommunications Engineering  in 1990 and taught subjects at both undergraduate and postgraduate levels. Subjects taught include, Circuit Theory, Electronic Circuit and Systems, Digital Signal Processing, Queueing Theory. His research interest include, image and video compression, image segmentation and analysis, and digital signal processing.  He left the University in 1998 to join the Visual Information Processing Lab, Motorola Labs in Sydney. He was Principal Research Engineer and  later became the foundation Manager of the Digital Media Collection and Management Lab,  Motorola  Labs, Sydney.  While at Motorola Labs, he worked on a range of research projects including, image and video segmentation, image compression (he was part of the Motorola team that worked on the JPEG2000 standardization), digital camera image processing, stereo image processing, multimedia security (watermarking and authentication) and multimedia content management for broadband applications. Apart from the many publications emanating from the research output, Philip was also co-author of several patent disclosures. He currently has four patents filed in the US and has published over 45 journal and conference papers. His current research interest include image and video processing, video surveillance, multimedia security and multimedia content management   He is a Senior Member of the IEEE and member of the IEEE NSW Committee. He has also served as the Chair of the IEEE Joint Chapter of the Communications and Signal Processing. In 2004, Philip returned to the University of Wollongong, School of InformationTechnology and Computer Science, where is now Professor and Head of School. He is also the Director of the Centre for Visual Information Processing and Content Management Research within the School.",
  "content_length": 2365,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:10"
}