{
  "name": "Phil Blunsom",
  "homepage": "https://www.cs.ox.ac.uk/people/phil.blunsom",
  "status": "success",
  "content": "Phil Blunsom | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyPhil BlunsomPhil Blunsom Phil Blunsom Professor of Computer ScienceSenior Research Fellow, St Hugh's CollegeLeaving date: 30th September 2024Themes:Artificial Intelligence and Machine LearningCompleted Projects:Deep LearningInterestsMy research interests lie at the intersection of machine learning and computational linguistics. I apply machine learning techniques, such as deep learning, to a range of problems relating to the analysis and manipulation of language. Recently I have focused on developing algorithms able to imbue artificial intelligence with the ability to understand, ground, generate, and act upon natural language utterances.BiographyI am originaly from Australia, where I completed my PhD at the University of Melbourne under the supervision of Timothy Baldwin, Steven Bird and James Curran. I then came to the United Kingdom as a Research Fellow at the University of Edinburgh. There I worked on the application of machine learning techniques to machine translation with Miles Osborne. Since 2009 I have been at the University of Oxford, both in the Department of Computer Science and as a Fellow of St Hugh's College. From 2014 to 2021 I founded and lead the Natural Language research group at DeepMind London. If you have a strong track record in Machine Learning or Natural Language Processing and would like to do a DPhil with my research group please follow the CS Department's application instructions. Please note that I am not able to reply to all email enquiries regarding graduate study. Unfortunately I am not able to accept interns or unsolicited visitors in my research group at this time.See alsoGoogle Scholar ProfileSelected PublicationsView AllManage publications Recurrent Continuous Translation Models Nal Kalchbrenner and Phil Blunsom Seattle. October, 2013. Association for Computational Linguistics. Details about Recurrent Continuous Translation Models | BibTeX data for Recurrent Continuous Translation Models Adaptor Grammars for Learning Non−Concatenative Morphology Jan A. Botha and Phil Blunsom In Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing. Pages 345−356. Seattle‚ Washington‚ USA. October, 2013. Association for Computational Linguistics. Details about Adaptor Grammars for Learning Non−Concatenative Morphology | BibTeX data for Adaptor Grammars for Learning Non−Concatenative Morphology | Download (pdf) of Adaptor Grammars for Learning Non−Concatenative Morphology The Role of Syntax in Vector Space Models of Compositional Semantics Karl Moritz Hermann and Phil Blunsom In Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Pages 894–904. Sofia‚ Bulgaria. August, 2013. Association for Computational Linguistics. Details about The Role of Syntax in Vector Space Models of Compositional Semantics | BibTeX data for The Role of Syntax in Vector Space Models of Compositional Semantics | Download (pdf) of The Role of Syntax in Vector Space Models of Compositional Semantics ActivitiesDeep LearningComputational LinguisticsPast StudentsSatwik  BhattamishraJan BothaJan BuysGregory DubbinNal KalchbrennerKazuya KawakamiTomas KociskyAdhiguna KuncoroQi LiuJulie MakelbergeYishu MiaoAndrew TraskPengyu WangAlex WilsonElle Michelle YangLei Yu (DeepMind) About UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3671,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:05"
}