{
  "name": "Philipp Krähenbühl",
  "homepage": "http://www.philkr.net",
  "status": "success",
  "content": "Philipp Krähenbühl Philipp KrähenbühlDepartment of Computer ScienceUniversity of Texas at Austin2317 SpeedwayAustin, TX 78712-1757email: philkr (at) cs.utexas.eduCV DBLP Google Scholar githubResearchI am an Associate Professor in the Department of Computer Science at the University of Texas at Austin and Researcher at Apple. I received my PhD in 2014 from the CS Department at Stanford University and then spent two wonderful years as a PostDoc at UC Berkeley.My research interests lie in Computer Vision, Machine learning and Computer Graphics. I’m particularly interested in deep learning, image, video and scene understanding.Publications2024Distilling Vision-Language Models on Millions of VideosYue Zhao, Long Zhao, Xingyi Zhou, Jialin Wu, Chun-Te Chu, Hui Miao, Florian Schroff, Hartwig Adam, Ting Liu, Boqing Gong, Philipp Krähenbühl, Liangzhe YuanCVPR 2024arxivPromptable Closed-loop Traffic SimulationShuhan Tan, Boris Ivanovic, Yuxiao Chen, Boyi Li, Xinshuo Weng, Yulong Cao, Philipp Krähenbühl, Marco PavoneCoRL 2024arxiv2023PartDistillation: Learning Parts from Instance SegmentationJang Hyun Cho, Philipp Krähenbühl, Vignesh RamanathanCVPR 2023code pdfLearning Video Representations from Large Language ModelsYue Zhao, Ishan Misra, Philipp Krähenbühl, Rohit GirdharCVPR 2023code arxivLanguage Conditioned Traffic GenerationShuhan Tan, Boris Ivanovic, Xinshuo Weng, Marco Pavone, Philipp KraehenbuehlCoRL 2023code arxivLanguage-conditioned Detection TransformerJang Hyun Cho, Philipp KrähenbühlCVPR 2023code arxivPredicting a Protein's Stability under a Million MutationsJeffrey Ouyang-Zhang, Daniel J. Diaz, Adam R. Klivans, Philipp KrähenbühlNeurIPS 2023code arxiv2022Real-Time Online Video Detection with Temporal Smoothing TransformersYue Zhao, Philipp KrähenbühlECCV 2022code arxivLong-tail detection with effective class-marginsJang Hyun Cho, Philipp KrähenbühlECCV 2022code arxivDetecting twenty-thousand classes using image-level supervisionXingyi Zhou, Rohit Girdhar, Armand Joulin, Philipp Krähenbühl, Ishan MisraECCV 2022code arxivLearning from All VehiclesDian Chen, Philipp KrähenbühlCVPR 2022code arxivCross-view Transformers for real-time Map-view Semantic SegmentationBrady Zhou, Philipp KrähenbühlCVPR 2022code arxivGlobal Tracking TransformersXingyi Zhou, Tianwei Yin, Vladlen Koltun, Philipp KrähenbühlCVPR 2022code arxivSimple multi-dataset detectionXingyi Zhou, Vladlen Koltun, Philipp KrähenbühlCVPR 2022code arxiv2021Multimodal Virtual Point 3D DetectionTianwei Yin, Xingyi Zhou, Philipp KrähenbühlNeurIPS 2021code arxivLearning to drive from a world on railsDian Chen, Vladlen Koltun, Philipp KrähenbühlICCV 2021arxivTowards Long-Form Video UnderstandingChao-Yuan Wu, Philipp KrähenbühlCVPR 2021arxivCenter-based 3d object detection and trackingTianwei Yin, Xingyi Zhou, Philipp KrähenbühlCVPR 2021code arxivMemory Optimization for Deep NetworksAashaka Shah, Chao-Yuan Wu, Jayashree Mohan, Vijay Chidambaram, Philipp KrähenbühlICLR 2021code arxivProbabilistic two-stage detectionXingyi Zhou, Vladlen Koltun, Philipp KrähenbühlarXiv 2021arxiv2020Domain Adaptation Through Task DistillationBrady Zhou, Nimit Kalra, Philipp KrähenbühlECCV 2020code arxivTracking Objects as PointsXingyi Zhou, Vladlen Koltun, Philipp KrähenbühlECCV 2020code arxivA Multigrid Method for Efficiently Training Video ModelsChao-Yuan Wu, Ross Girshick, Kaiming He, Christoph Feichtenhofer, Philipp KrähenbühlCVPR 2020code arxiv2019Learning by CheatingDian Chen, Brady Zhou, Vladlen Koltun, Philipp KrähenbühlCORL 2019code arxivMonocular plan view networks for autonomous drivingDequan Wang, Coline Devin, Qi-Zhi Cai, Philipp Krähenbühl, Trevor DarrellIROS 2019arxivObjects as pointsXingyi Zhou, Dequan Wang, Philipp KrähenbühlarXiv preprint arXiv:1904.07850 2019code arxivLong-Term Feature Banks for Detailed Video UnderstandingChao-Yuan Wu, Christoph Feichtenhofer, Haoqi Fan, Kaiming He, Philipp Krähenbühl, Ross GirshickCVPR 2019code arxiv supplementBottom-up Object Detection by Grouping Extreme and Center PointsXingyi Zhou, Jiacheng Zhuo, Philipp KrähenbühlCVPR 2019code arxiv supplementJoint Monocular 3D Vehicle Detection and TrackingHou-Ning Hu, Qi-Zhi Cai, Dequan Wang, Ji Lin, Min Sun, Philipp Krähenbühl, Trevor Darrell, Fisher YuICCV 2019code arxivDoes Computer Vision Matter for Action?Brady Zhou, Philipp Krähenbühl, Vladlen KoltunScience Robotics 2019code arxivDon't let your Discriminator be fooledBrady Zhou, Philipp KrähenbühlICLR 2019pdf2018Video Compression through Image InterpolationChao-Yuan Wu, Nayan Singhal, Philipp KrähenbühlECCV 2018code arxivDomain transfer through deep activation matchingHaoshuo Huang, Qixing Huang, Philipp KrähenbühlECCV 2018pdf projectCompressed Video Action RecognitionChao-Yuan Wu,Manzil Zaheer,Hexiang Hu,R. Manmatha,Alexander J. Smola, Philipp KrähenbühlCVPR 2018code arxiv projectFree Supervision from Video GamesPhilipp KrähenbühlCVPR 2018code pdf projectAssessing Generalization in Deep Reinforcement LearningCharles Packer, Katelyn Gao, Jernej Kos, Philipp Krähenbühl, Vladlen Koltun, Dawn SongarXiv 2018arxiv2017Sampling Matters in Deep Embedding LearningChao-Yuan Wu, R. Manmatha, Alexander J. Smola, Philipp KrähenbühlICCV 2017code arxiv projectAdversarial Feature LearningJeff Donahue, Philipp Krähenbühl, Trevor DarrellICLR 2017code arxiv2016Generative Visual Manipulation on the Natural Image ManifoldJun-Yan Zhu, Philipp Krähenbühl, Eli Shechtman, Alexei A. EfrosECCV 2016code arxiv projectContext Encoders: Feature Learning by InpaintingDeepak Pathak, Philipp Krähenbühl, Jeff Donahue, Trevor Darrell, Alyosha EfrosCVPR 2016code arxiv projectLearning Dense Correspondence via 3D-guided Cycle ConsistencyTinghui Zhou, Philipp Krähenbühl, Mathieu Aubry, Qixing Huang, Alyosha EfrosCVPR 2016arxiv projectData-dependent initializations of convolutional neural networksPhilipp Krähenbühl, Carl Doersch, Jeff Donahue, Trevor DarrellICLR 2016code arxiv2015Learning a Discriminative Model for the Perception of Realism in Composite ImagesJun-Yan Zhu, Philipp Krähenbühl, Eli Shechtman, Alyosha EfrosICCV 2015code arxivLearning Data-driven Reflectance Priors for Intrinsic Image DecompositionTinghui Zhou, Philipp Krähenbühl, Alyosha EfrosICCV 2015code arxivConstrained Convolutional Neural Networks for Weakly Supervised SegmentationDeepak Pathak, Philipp Krähenbühl, Trevor DarrellICCV 2015code arxiv supplementLearning to propose objectsPhilipp Krähenbühl, Vladlen KoltunCVPR 2015code pdf2014Geodesic Object ProposalsPhilipp Krähenbühl, Vladlen KoltunECCV 2014code pdf2013Parameter Learning and Convergent Inference for Dense Random FieldsPhilipp Krähenbühl, Vladlen KoltunICML 2013code pdf project2012Efficient Nonlocal regularization for Optical FlowPhilipp Krähenbühl, Vladlen KoltunECCV 2012pdfSaliency Filters: Contrast Based Filtering for Salient Region DetectionFederico Perazzi, Philipp Krähenbühl, Yael Pritch, Alexander HornungCVPR 2012code pdf project2011Efficient Inference in Fully Connected CRFs with Gaussian Edge PotentialsPhilipp Krähenbühl, Vladlen KoltunNIPS 2011code arxiv project2010Gesture ControllersSergey Levine, Philipp Krähenbühl, Sebastian Thrun, Vladlen KoltunSIGGRAPH 2010pdf2009A system for retargeting of streaming videoPhilipp Krähenbühl, Manuel Lang, Alexander Hornung, Markus GrossSIGGRAPH Asia 2009pdfResearch groupPhD Students:Brady ZhouYue ZhaoJeffrey Ouyang-ZhangJang Hyun (Vincent) ChoShuhan TanDor LitvakPast PhD students:Dian Chen (2023, next: Waabi)Xingyi Zhou (2022, next: Google)Chao-Yuan Wu (2021, next: Facebook)Undergraduates and MS:Past undergraduates and MS:Tianwei Yin (next: MIT)Scott Cao (next: Facebook)David Wang (next: Amazon)Chia-Wen Cheng (next: Facebook)Mina Lee (next: Google)Kamil Ali (next: Stanford)Brady Zhou (next: Intel, then UT)Nayan Singhal (next: Facebook AML)Shaayaan Sayed (next: some hedgefund)Nimit Kalra (next: finance)TeachingCS342 - Neural networks - Fall 2017, 2018, 2019CS395T - Deep learning seminar - Fall 2016, 2017, 2018, 2019CS394D - Deep learning WB - all year 2019-CS395T - Advances in Deep learning WB - all year 2025-Joining my research groupUT CS or ECE students: I’d recomment you to take my graduate deep learning class (CS395T), and start working with me through that class.Prospective students: Please read about our graduate admissions process and state your interested in my research group in your statement of purpose. Please do *not- contact me directly. The statistics are not in your favor either. We have not yet admitted a single student to UTCS who contacted me directly.About my last nameI’m well aware that my last name is not the easiest one to write or cite (and I saw it butchered a bunch of times over the years). So to make things easier just pick your document type below and copy the string:Regular textKrähenbühl Latex & BibtexKr\\\"ahenb\\\"uhl HTMLKr&auml;henb&uuml;hl If all the above fail, just use Kraehenbuehl.",
  "content_length": 8897,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:14"
}