{
  "name": "Philippe Cudré-Mauroux",
  "homepage": "https://exascale.info/phil",
  "status": "success",
  "content": "Philippe Cudré-Mauroux Full Professor AddressBd de Pérolles 901700 FribourgSwitzerland E-Mail [email protected] Phone+41 26 300 8332 Google Scholar Profile DBLP Computer Science Bibliography Philippe Cudré-Mauroux Brief Bio I'm a Full Professor at the University of Fribourg, Switzerland, where I lead the eXascale Infolab. Before coming back to Switzerland, I spent a few exciting years working with the Database Systems lab (Sam Madden & Mike Stonbraker) at MIT. I got my B.Sc. from EPFL, and two M.Sc., one from Eurecom and one from INRIA SOP/U. of Sofia-Antipolis. At the end of my studies, I spent six months at IBM T.J. Watson Research, working on media delivery architectures. I got my Ph.D. from EPFL, working in Karl Aberer's lab. My dissertation on data interoperability and emergent semantics won the school-wide EPFL Doctorate Award and the EPFL Press Mention in 2007. During my Ph.D., I also spent some time at U.C. Berkeley working on sensor data and at Microsoft Research Asia working on novel information-sharing systems. I recently won a 2M€ ERC Grant, a Google Faculty Research Award, as well as the VeriSign Internet Infrastructures Award. Research Interests Exascale Information Management Infrastructures for Big Data & AI Scientific Data Linked Data. Recent/Upcoming Events June 2024: ACM SIGMOD in Santiago [Panel Chair] March 2024: ACM WSDM in Mérida [Senior PC] October 2023: ACM CIKM in Birmingham [Senior PC] May 2023: ACM WWW in Austin [Senior PC] Recent Appointments 2021: Research Council Member (Responsible for Applied Computer Science), Swiss National Science Foundation 2021: Scientific Advisory Board Member, chist-era EU Research Programme 2016: Full Professor, University of Fribourg–Switzerland 2015-2016: Visiting Researcher, Microsoft CISL–USA 2015: Visiting Professor, MIT–USA 2015: Forum des 100–Switzerland 2011: President of the GITI–Switzerland 2011: Board of Directors, Swiss-Engineering–Switzerland 2010: Swiss NSF Professor, University of Fribourg–Switzerland Awards & Prizes 2020: Best Paper Award, Swiss Data Science Conference, Switzerland. 2020: Most Reproducible Paper Award, VLDB 2020, Japan. 2019: Best Paper Award, AAMAS 2019, Canada. 2016: ERC Consolidator Grant, European Research Council. 2013: Google Faculty Research Award, USA. 2012: Outstanding Contribution to Computer Science Award, Swiss National Center in Research MICS (link to the MICS event). 2012: Verisign Inc. Internet Infrastructures Award, USA. Press release here. 2011: Marie-Curie Career Integration Grant. 2011: Best Demo Award, ISWC, Germany. 2011: Outrageous Idea Award, Computing Community Consortium (CCC), Germany. 2011: Amazon AWS Teaching Grant, USA. 2010: SNSF Professorship, Swiss National Science Foundation, Switzerland. 2010: Best Mentor Award, International Semantic Web Conference, Shanghai–China. 2007: EPFL Doctorate Award (best EPFL thesis out of 292 Ph.D. theses), EPFL–Switzerland. 2007: EPFL Press Mention (for outstanding publication), EPFL, Switzerland. 2001: Best Student (out of 30 European students), M.Sc. program in Multimedia Communications, Eurecom Institute & EPFL. Publications Mourad Khayati, Guillaume Chacun, Zakhar Tymchenko, and Philippe Cudré-Mauroux. “A-DARTS: Stable Model Selection for Data Repair in Time Series.” Proceedings of the 41st IEEE International Conference on Data Engineering (ICDE), 2025. Bibtex PDF Code A-DARTS: Stable Model Selection for Data Repair in Time Series Mourad Khayati, Guillaume Chacun, Zakhar Tymchenko, and Philippe Cudré-Mauroux. “A-DARTS: Stable Model Selection for Data Repair in Time Series.” Proceedings of the 41st IEEE International Conference on Data Engineering (ICDE), 2025. @article{khayati2025adarts, title = {A-DARTS: Stable Model Selection for Data Repair in Time Series}, author = {Khayati, Mourad and Chacun, Guillaume and Tymchenko, Zakhar and Cudr{\\'{e}}{-}Mauroux, Philippe}, booktitle = {Proceedings of the 41st IEEE International Conference on Data Engineering (ICDE)}, year = {2025}, url = {/assets/pdf/khayati2025icde.pdf}, code = {https://github.com/eXascaleInfolab/recimpute} } × Quentin Nater, Mourad Khayati, and Philippe Cudré-Mauroux. “A Hands-on Tutorial on Time Series Imputation with ImputeGAP.” SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2025. Bibtex PDF Code A Hands-on Tutorial on Time Series Imputation with ImputeGAP Quentin Nater, Mourad Khayati, and Philippe Cudré-Mauroux. “A Hands-on Tutorial on Time Series Imputation with ImputeGAP.” SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2025. @article{nater2025kdd, title = {A Hands-on Tutorial on Time Series Imputation with ImputeGAP}, author = {Nater, Quentin and Khayati, Mourad and Cudr{\\'{e}}{-}Mauroux, Philippe}, year = {2025}, booktitle = {SIGKDD Conference on Knowledge Discovery and Data Mining (KDD)}, url = {/assets/pdf/khayati2025kdd.pdf}, code = {https://github.com/eXascaleInfolab/ImputeGAP} } × Sophie Pfister, Alberto Lerner, Abishek Ramdas, and Philippe Cudré-Mauroux. “Alpha Demo: A Hardware-Accelerated Data Model for Ad-Hoc Manipulation of Point Clouds.” In Proceedings of the 2025 International Conference on Management of Data. (SIGMOD’25), 2025. Bibtex PDF Alpha Demo: A Hardware-Accelerated Data Model for Ad-Hoc Manipulation of Point Clouds Sophie Pfister, Alberto Lerner, Abishek Ramdas, and Philippe Cudré-Mauroux. “Alpha Demo: A Hardware-Accelerated Data Model for Ad-Hoc Manipulation of Point Clouds.” In Proceedings of the 2025 International Conference on Management of Data. (SIGMOD’25), 2025. @inproceedings{pfister2025sigmod, author = {Pfister, Sophie and Lerner, Alberto and Ramdas, Abishek and Cudr{\\'{e}}{-}Mauroux, Philippe}, title = {Alpha Demo: A Hardware-Accelerated Data Model for Ad-Hoc Manipulation of Point Clouds}, year = {2025}, booktitle = {Proceedings of the 2025 International Conference on Management of Data}, series = {{(SIGMOD'25)}}, doi = {10.1145/3722212.3725078}, url = {/assets/pdf/pfister2025sigmod.pdf} } × Manuel Mondal, Mourad Khayati, Hông-Ân Sandlin, and Philippe Cudré-Mauroux. “A Survey of Multimodal Event Detection Based on Data Fusion.” VLDB Journal, (Invited for oral presentation at VLDB 2025), 34, no. 1 (2025): 9. Bibtex PDF A Survey of Multimodal Event Detection based on Data Fusion Manuel Mondal, Mourad Khayati, Hông-Ân Sandlin, and Philippe Cudré-Mauroux. “A Survey of Multimodal Event Detection Based on Data Fusion.” VLDB Journal, (Invited for oral presentation at VLDB 2025), 34, no. 1 (2025): 9. @article{DBLP:journals/vldb/MondalKSC25, author = {Mondal, Manuel and Khayati, Mourad and Sandlin, H{\\^{o}}ng{-}{\\^{A}}n and Cudr{\\'{e}}{-}Mauroux, Philippe}, title = {A Survey of Multimodal Event Detection based on Data Fusion}, journal = {{VLDB} Journal}, volume = {34}, number = {1}, pages = {9}, year = {2025}, series = {{(Invited for oral presentation at VLDB 2025)}}, url = {https://rdcu.be/d3vuS}, doi = {10.1007/S00778-024-00878-5}, timestamp = {Wed, 08 Jan 2025 21:11:21 +0100}, biburl = {https://dblp.org/rec/journals/vldb/MondalKSC25.bib}, bibsource = {dblp computer science bibliography, https://dblp.org} } × Michael Luggen, Benedikt Hitz, Julien Audiffren, Djellel Difallah, Jean-Luc Cochard, and Philippe Cudré-Mauroux. “Open Government Data as Multi-Dimensional 5 Star Data: Cube.link.” International Semantic Web Conference (ISWC), 2025. Bibtex PDF Open Government Data as Multi-dimensional 5 Star Data: cube.link Michael Luggen, Benedikt Hitz, Julien Audiffren, Djellel Difallah, Jean-Luc Cochard, and Philippe Cudré-Mauroux. “Open Government Data as Multi-Dimensional 5 Star Data: Cube.link.” International Semantic Web Conference (ISWC), 2025. @article{luggen2025iswc, title = {Open Government Data as Multi-dimensional 5 Star Data: cube.link}, author = {Luggen, Michael and Hitz, Benedikt and Audiffren, Julien and Difallah, Djellel and Cochard, Jean-Luc and Cudr{\\'{e}}{-}Mauroux, Philippe}, year = {2025}, booktitle = {International Semantic Web Conference (ISWC)}, url = {/assets/pdf/luggen2025iswc.pdf} } × Paolo Ceravolo, Tiziana Catarci, Marco Console, Philippe Cudré-Mauroux, Sven Groppe, Katja Hose, Jaroslav Pokorný, Oscar Romero, and Robert Wrembel. “Moduli: A Disaggregated Data Management Architecture for Data-Intensive Workflows.” SIGWEB 2024, no. Winter (2024): 4:1–4:16. Bibtex PDF moduli: A Disaggregated Data Management Architecture for Data-Intensive Workflows Paolo Ceravolo, Tiziana Catarci, Marco Console, Philippe Cudré-Mauroux, Sven Groppe, Katja Hose, Jaroslav Pokorný, Oscar Romero, and Robert Wrembel. “Moduli: A Disaggregated Data Management Architecture for Data-Intensive Workflows.” SIGWEB 2024, no. Winter (2024): 4:1–4:16. @article{ceravolo2024sigweb, author = {Ceravolo, Paolo and Catarci, Tiziana and Console, Marco and Cudr{\\'{e}}{-}Mauroux, Philippe and Groppe, Sven and Hose, Katja and Pokorn{\\'{y}}, Jaroslav and Romero, Oscar and Wrembel, Robert}, title = {moduli: {A} Disaggregated Data Management Architecture for Data-Intensive Workflows}, journal = {{SIGWEB}}, volume = {2024}, number = {Winter}, pages = {4:1--4:16}, year = {2024}, url = {https://doi.org/10.1145/3643603.3643607}, doi = {10.1145/3643603.3643607} } × Natalia Ostapuk, Ljiljana Dolomic, Alan Mermoud, and Phillipe Cudré-Mauroux. “Leveraging Pre-Trained Extreme Multi-Label Classifiers for Zero-Shot Learning.” In Swiss Conference on Data Science (SDS), 2024. Bibtex PDF Leveraging Pre-Trained Extreme Multi-Label Classifiers for Zero-Shot Learning Natalia Ostapuk, Ljiljana Dolomic, Alan Mermoud, and Phillipe Cudré-Mauroux. “Leveraging Pre-Trained Extreme Multi-Label Classifiers for Zero-Shot Learning.” In Swiss Conference on Data Science (SDS), 2024. @inproceedings{ostapuk24sds, author = {Ostapuk, Natalia and Dolomic, Ljiljana and Mermoud, Alan and Cudr\\'e-Mauroux, Phillipe}, title = {Leveraging Pre-Trained Extreme Multi-Label Classifiers for Zero-Shot Learning}, booktitle = {Swiss Conference on Data Science (SDS)}, year = {2024}, url = {/assets/pdf/XML_Ze",
  "content_length": 186892,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:18"
}