{
  "name": "Philipp Staudt",
  "homepage": "https://uol.de/informatik/abteilungen/esis/team/philipp-staudt",
  "status": "success",
  "content": "Prof. Dr. Philipp Staudt // Universität Oldenburg Fk. II Department für Informatik Wirtschaftsinformatik - Umwelt und Nachhaltigkeit Prof. Dr. Philipp Staudt Prof. Dr. Philipp Staudt Green Information Systems, Energy Information Systems, Smart Grid Economics, Energy Economics, Behavioral Experiments, Decision Support Systems, Sustainable Platform Economy Department für Informatik  (» Postanschrift) Carl von Ossietzky Universität Oldenburg Ammerländer Heerstraße 114-118 26129 Oldenburg uol.de/informatikIndustriestraße 11, R006 (» Adresse und Lageplan)Nach Absprache - By appointment - Google Scholar - LinkedIn Prof. Dr. Philipp Staudt Philipp Staudt is a professor for Information Systems with a focus on digital sustainability and digital technology for sustainability. He has extensively researched the energy transition and the integration of renewable resources in the energy market using digital technology. He also works on understanding the impact of information systems on organizational sustainability and the impact of digital sustainability on government and society. SummerSustainable Information Systems (Master)WinterDigital Technology on Energy Markets (Master)Wirtschaftsinformatik 1 (Bachelor) Digitale Sustainability – A reviewAntecedents to sustainability goals in organizationsA morphological box for the classification of power purchasing agreementsHow to facilitate Home Renovation by matching Homeowners and ContractorsAnalysis of Platform Ecosystems - Case Study with mosaikReinforcement learning-based analysis of bidding strategies for different block orders in electricity marketsBarriers and Countermeasures for the Digital Transformation of Municipalities in Germany Current thesis topics can be found here. Since 10/2022Junior Professor for Environmental and Sustainable Information Systems at the CvO University of Oldenburg04/2022 - 10/2022Marie Sklodowska Curie Postdoc Fellowship at Massachusetts Institute of Technology02/2018 - 03/2022Head of Research Group for Smart Grids and Energy Markets at the chair of Prof. Dr. Christof Weinhardt at the Karlsruhe Institute of Technology05/2016 - 01/2018Research assistant at the chair of Prof. Dr. Christof Weinhardt at the Karlsruhe Institute of Technology10/2013 - 04/2016Master of Science Mathematics & Economics at Karlsruhe Institute of Technology10/2009 - 09/2013Bachelor of Industrial Engineering & Management at Karlsruhe Institute of Technology Webmaster (Stand: 21.05.2025) |  Kurz-URL:Shortlink: https://uol.de/p94472 Zum Seitananfang scrollen Scroll to the top of the page",
  "content_length": 2568,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:15"
}