{
  "name": "Philip W. L. Fong",
  "homepage": "http://www.cpsc.ucalgary.ca/~pwlfong",
  "status": "success",
  "content": "Philip W. L. Fong Philip W. L. Fong Position: Professor Affiliation: Department of Computer Science University of Calgary 2500 University Drive NW Calgary, Alberta, Canada T2N 1N4 Office: ICT 640 Phone: (403) 210-6229 Fax: (403) 284-4707 Email: pwlfong AT ucalgary DOT ca Homepage: http://www.cpsc.ucalgary.ca/~pwlfong Biography Philip Fong is a Professor at the Department of Computer Science, University of Calgary, Canada. He held a Tier-2 Canada Research Chair in Software Security between 2009 and 2019. He was a faculty member at the Department of Computer Science, University of Regina, Canada, from 2003 to 2008. He received his B.Math. and M.Math. in Computer Science from the University of Waterloo, Canada, and his Ph.D. in Computer Science from Simon Fraser University, Canada. His research interests include access control, security and privacy for Internet of Things (IoT), protection technologies for social computing, and language-based security. Research My research interests include access control, policy mining, AI model security, security and privacy for Internet of Things (IoT), protection technologies for social computing, and language-based security. Publication list at DBLP (under Philip W. L. Fong) ACM author page Professional Activities Program Committee. The 24th ACM Symposium on Access Control Models and Technologies (SACMAT'2020), Barcelona, Spain, June 10-12, 2020. Program Committee. The 10th ACM Conference on Data and Application Security and Privacy (CODASPY'2020), New Orleans, LA, USA, March 16-18, 2020. Program Committee. The 24th ACM Symposium on Access Control Models and Technologies (SACMAT'2019), Toronto, Ontario, Canada, June 4-6, 2019 Program Committee. The 9th ACM Conference on Data and Application Security and Privacy (CODASPY'2019), Dallas, TX, USA, March 25-27, 2019. Past professional activities. Graduate Student Supervision Chahal Arora (MSc) Henrique Pereira (PhD) Syed Zain Raza Rizvi (PhD) Shauvik Shadman (MSc) Si Zhang (PhD) Past Students",
  "content_length": 2006,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:14"
}