{
  "name": "Philippe O. A. Navaux",
  "homepage": "http://www.inf.ufrgs.br/site/docente/philippe-olivier-alexandre-navaux",
  "status": "success",
  "content": "Philippe Olivier Alexandre Navaux - Instituto de Informática - UFRGS Contato Links úteisCiência da ComputaçãoEngenharia de ComputaçãoContatoLocalizaçãoWebmail Voltar para lista de docentes Philippe Olivier Alexandre Navaux Professor Titular CV LATTES → E-mail: *protected email* Telefone: +55 51 3308-9495 Prédio: 43413 Sala: 210 Qualificações Doutorado em Informática (Institut National Polytechnique de Grenoble (INPG), França, 1979) 1971-1973 Mestrado em Física 1968-1970 Especialização em Engenharia Nuclear 1976-1979 Doutorado em Informática Áreas de Interesse Projeto de Arquitetura de Computadores Paralelos Processamento de Imagens Estudo de Arquiteturas Avançadas Avaliação de Desempenho de Arquiteturas Paralelas Minibiografia Professor Emérito: - Aprovado no CONINF em 28/04/2020 - Aprovado no CONSUN em 15/10/2021 - Outorgado em Sessão Solene em 28/08/2023 Prof. Navaux é graduado em Engenharia Eletrônica (1970), mestre em Física (1973) pela UFRGS e doutor em Informática pelo INPG (Grenoble, França, 1979). Ingressou como docente na UFRGS em 1971, tornando-se Professor Titular do Instituto de Informática em 1996. Foi Diretor do Instituto de Informática, de 1998 a 2006, e Pró-Reitor de Pós-Graduação da UFRGS, de 2000 a 2001. Ao longo de sua vida acadêmica, entre muitas atividades, foi também coordenador do PPGC e chefe do Departamento de Informática Aplicada. Líder do GPPD, Grupo de Processamento Paralelo e Distribuído, Navaux é uma das principais lideranças da área de Computação Paralela e Computação de Alto Desempenho no país, tendo contribuído para sua construção e consolidação. Formou um grande número de pesquisadores e professores, que atuam no Brasil e exterior. Até o momento, orientou dezenas de mestres e doutores e mais de uma centena de bolsistas de Iniciação Científica, além de ter supervisionado diversos pós-doutorandos. Publicou ou editou mais de dez livros como autor, coautor ou organizador, e mais de 350 artigos em periódicos e conferências internacionais e nacionais. Foi organizador do primeiro Simpósio Brasileiro de Arquitetura de Computadores (SBAC-PAD), tendo participado de sua organização diversas vezes. Sócio da SBC desde sua fundação, foi também secretário geral, vice-presidente e conselheiro da SBC na década de 90. Da SBC, em 2012, recebeu o prêmio Newton Faller, e nesse mesmo ano recebeu o prêmio Pesquisador Gaúcho da FAPERGS. Em 2016, recebeu o PACIS Award, por sua contribuição na formação de pesquisadores em Processamento de Alto Desempenho. Coordenou diversos projetos de pesquisa financiados tanto por agências de fomento como FINEP, CNPq, CAPES e FAPERGS, quanto por empresas, tais como HP, Altus, Microsoft, Intel e Petrobras. Uma das características de sua carreira científica é a forte cooperação internacional, em especial com a França, em função da qual foi honrado como Cavaleiro da Ordem das Palmas Acadêmicas pelo Ministério da Educação e Pesquisa da França, em 2006. Ao longo da carreira, Navaux atuou em diversas instâncias relacionadas com atividades científicas. É Pesquisador Nível 1B e foi membro do Comitê Assessor de Ciência da Computação do CNPq. Foi membro do Conselho Superior da FAPERGS e do Conselho Técnico Científico do LNCC. Atuou, ainda, como: consultor do Comitê̂ de Computação da CAPES e coordenador dessa área da CAPES no período 2011-2018; membro do Conselho Técnico Científico da Educação Superior (CTC-CAPES); e consultor do MCT e da Comissão de Informática do MEC, tendo trabalhado na concepção do Projeto Pedagógico da UFABC. Tem sido consultor de universidades e agências de fomento nacionais, norte-americanas e europeias. Sua aposentadoria foi publicada no D.O.U. de 04 de janeiro de 2019.",
  "content_length": 3694,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:22"
}