{
  "name": "Philip Wadler",
  "homepage": "http://homepages.inf.ed.ac.uk/wadler",
  "status": "success",
  "content": "Philip Wadler's home page Philip Wadler's home page Contact details Wadler's Blog Towards Independence @PhilipWadler PLFA Links ABCD Haskell JFP FP in the real world SPLS Computational Thinking and Outreach Portrait by Scott Marshall, 2021 Bright Club, Edinburgh, 2019 CWI Amsterdam Projects Interested in applying for a PhD or Internship? Verifying smart contracts for Blockchain Funded PhD post. (No longer available; filled by Tudor Ferariu.) From Data Types to Session Types: A Basis for Concurrency and Distribution, an EPSRC Programme Grant, joint with Simon Gay, Glasgow, and Nobuko Yoshida, Imperial. TypeScript: The Next Generation funded by a Microsoft Research PhD Scholarship. (No longer available; filled by Jack Williamson.) Centre for Doctoral Training in Pervasive Parallelism. Journal of Financial Technology, member of editorial board. Please consider submitting. Our second issue will be a special issue devoted to formal methods. Currently: Professor of Theoretical Computer Science, Laboratory for Foundations of Computer Science, School of Informatics, University of Edinburgh (2003—). Senior Research Fellow, Area Leader Programming Languages, IOHK. Formerly: ACM Special Interest Group on Programming Languages, Chair (2009–2012), Past Chair (2012–2015). Avaya Labs, Basking Ridge, Researcher (2000–2003). Bell Labs 1127, Lucent Technologies, Murray Hill, Researcher (1996–2000). Glasgow University, Professor (1993–1996), Reader (1990–1993), Lecturer (1987–1990). University of Sydney, Guest professor (Jan–Feb 1991). University of Copenhagen, Guest professor (Aug 1989). Oxford University, Postdoc (1983–1987) Chalmers Tekniska Högskola, Göteborg, Visiting Fellow (Sep 1986–Feb 1987). Carnegie-Mellon University, Graduate student (1977–1982) Stanford University, Undergraduate (1973–1977) For details see my vita or short biography. https://orcid.org/0000-0001-7619-6378 Upcoming events Chalmers FP, 8 June 2020, invited talk. pdf video ZuriHac, Zurich, 13 June 2020. Keynote. (Virtual.) video HOPL IV, London, 14—16 June 2020. Program committee. (Postponed to 2021.) Rigorous Methods for Smart Contracts, Dagstuhl, June 2020. Invited attendee. (Postponed.) Monadic Party, Poznan, 18—19 June 2020. Invited speaker. (Postponed.) Logic Mentoring Workshop, Saarbrücken, 6 July 2020. Invited speaker. (Virtual.) pdf IOHK Cardano Virtual Summit, 2—3 July 2020. Invited speaker (three times). (Virtual.) Logic Mentoring Workshop Saarbrücken, Germany, 6 July 2020. Invited speaker. (Virtual.) Scala Symposium, Berlin, July 2020. Member of program committee. Formal Methods for Blockchains (FMBC), Los Angeles, July 2020. Member of program committee. (Virtual.) Haskell Love, 31 July—1 August 2020. Invited speaker. (Virtual.) Verified Software, Newton Institute, Cambridge, 2—22 August 2020. Invited attendee. (Postponed.) Brazilian Symposium on Programming Languages (SBLP), 9am BRT (1pm BST) 20 October 2020. Keynote speaker. (Virtual.) Research interests Concurrency. A recent result shows how to extend the Curry-Howard correspondence to session types. With Simon Gay and Nobuko Yoshida, I am leading the EPSRC programme grant From Data Types to Session Types: A Basis for Concurrency and Distribution (ABCD) (EPSRC). Agda. With Wen Kokke I coauthored the textbook, Programming Language Foundations in Agda. A paper describing the book appeared in SBMF 2018, and won the prize for best paper. Blame. The blame calculus, developed with Robby Findler, Jeremy Siek, and Amal Ahmed, integrates different type systems via casts. Casts may mediate between dynamic and static types, or between simple and dependent types. The key result is that when a cast fails, blame must lie on the less precise side of the cast. Links. I led the team that developed Links a programming language for web application development. My collaborators include Ezra Cooper, Sam Lindley, and Jeremy Yallop. Our work on formlets has been included in Intellifactory Web Sharper, and in libraries for Common Lisp, F#, JavaScript, Haskell, Racket, and Scala. XML. I represented Avaya on the W3C XML Query working group, which designed XQuery a query language for XML. My work on XQuery was done in close collaboration with Jerome Simeon and Mary Fernandez, who have an implementation of XQuery called Galax. I ran a workshop on XML and Data Binding. I formerly served on the W3C XSL working group, and I wrote a simple formal model for pattern matching in XSLT. Java. With Gilad Bracha, Martin Odersky, and David Stoutamire, I designed GJ, an extension of Java that incorporates generic types. With Benjamin Pierce and Atsushi Igarashi, I designed Featherweight Java, a small formal model of Java, comparable in simplicity to lambda calculus. With Maurice Naftalin I wrote Java Generics and Collections, published by O'Rielly. Functional languages. I was a principal designer of Haskell. With Simon Marlow, I developed a type tool for Erlang. I am a founding member of IFIP WG 2.8 Functional Programming, and served as editor-in-chief of the Journal of Functional Programming. Logic and programming. I occasionally write and speak on the history of logic and programming languages, most recently a paper on Propositions as Types, which appeared in CACM and was presented at Strange Loop (video). At The Stand in Edinburgh, I performed a routine on Computability (video). Awards Best paper, SBMF 2018, for Programming Language Foundations in Agda. SIGPLAN Distinguished Service Award, 2016. ACM Fellow, 2007. Fellow Royal Society of Edinburgh, 2005. Wolfon-Royal Society Research Merit Award, 2004–2009. EUSA Teaching Awards, Overall High Performer, runner up, 2009. Most Influential POPL Paper Award 2003 (for 1993), Imperative functional programming, by Simon Peyton Jones and Philip Wadler. Recent events Lambda Days, Krakow, 12&em;13 June 2025. FME Teaching, online, 6 June 2025. FLOPS, Akita, Japan, 23—25 April 2020. Program committee. WTSC, Malaysia, 14 February 2020. Program committee. WGT, New Orleans, 25 January 2020. pdf PADL, New Orleans, 20—21 January 2020. Panel. pdf Collège de France, Paris, 12 December 2019. Invited talk. pdf Loft, Sao Paul, 27 November 2019. video pdf SBMF, Sao Paulo, 27—29 November 2019. Program co-chair. PURPL, PurPL Fest, Purdue University, 23—24 September 2019. Keynote speaker. pdf key GPCE, Athens, 21—22 October 2019. Program committee. FMBC, Porto, 11 October 2019. Program committee. Bright Club, Edinburgh, 29 October 2019. A Profound Pun. video ICFP Tutorial, Berlin, 23 August 2019. Full Stack Fest, Barcelona, 3—6 September 2019. Speaker. RADICAL, Amsterdam, 26 August 2019. Program committee. Scottish Programming Languages and Verification Summer School (SPLV), Strathclyde University, Glasgow, 5—9 August 2019. Core course. Curry On, London, 15—16 July 2019. Invited speaker. BuzzConf, Buenos Aires, 12—14 June 2019. Keynote speaker. pdf Lecture series, Padova, 27—31 May 2019. Lecturer. UNSW/Data62. 20 May. Speaker. Melbourne University. 16 May. Speaker. Yow! Lambda Jam, Melbourne, 13—15 May. Keynote IOHK Summit, Miami, 17—18 April 2019. Speaker. IOHK School, Addis Ababa, 11—22 March 2019. Lecturer. POPL (and HOPL IV PC), Lisbon, 12—20 January 2019. ABCD, London, 17—18 December 2018. PI. Plutusfest, Edinburgh, 11 December 2018. Keynote speaker. SBMF, Salvador, 28—30 November 2018. Programming Language Foundation in Agda (key, pdf) and Panel Speaker (key, pdf). Hughes 60, Chalmers, Gothenburg, 17 October 201 (key, pdf). Strange Loop, St Louis, 27—28 September 2018. Categories for the Working Hacker (key, pdf). ICFP, St Louis, 23—29 September 2018. Member of ERC & attending. LambdUp, Prague, 13 September 2018. Keynote speaker. Curry On & ECOOP, 15—21 July 2018. Attending. Facebook, 20 June 2018. WG2.8, Asilomar, 10—15 June 2018. Attending. 2nd Workshop on Trusted Smart Contracts (WTSC), 1—2 March 2018, Santa Barbara Beach Resort, Curacao. Programme committee. Sysmics Workshop, Vienna, 26—28 February 2018, Propositions as Sessions: pdf, pdf Lambda Days, Krakow, 22—23 February 2018, Categories for the Working Hacker, pdf IOHK School, Barbados, 5—9 February 2018. University of Lisbon, 23 January 2018, pdf, pdf. IOHK annual meeting, Lisbon, 15—20 January 2018, video. Principles of Programming Languages (POPL), Los Angeles, 8—13 January 2018. Programme committe & coauthor of Refinement Reflection: Complete Verification with SMT. On sabbatical in Rio de Janeiro, 26 December 2017—11 July 2018. Google X, 16 November 2017. Quoted Domain-Specific Languages: pdf. QCon San Francisco, 13—15 November 2017. Presenting Category Theory for the Working Hacker: key, pdf. Apple Computer, 10 November 2017: key, pdf. International Conference on Functional Programming (ICFP), Oxford, 3—9 September 2017. Coauthor of Gradual Session Types & Theorems for Free for Free. Domain-Specific Language Design and Implementation (DSLDI), Vacouver, Sun 22 October 2017. Programme committee. Generative Programming: Concepts and Experience (GPCE), Vancouver, October 2017. Programme committee. Recent Advances in Concurrency and Logic (RADICAL), colocated with QONFEST, Berlin, 4 September 2017. Programme committee. WG 2.8 meeting, Edinburgh, Sunday 11--Friday 16 June 2017. Local host. QCon São Paulo, 24—26 April 2017. Presenting Theorems for Free, Blame for All. Strachey 100, 18—19 November 2016, Oxford. Speaker: pdf, keynote. Data Science CDT, 20 October 2016 (slides). Papers We Love, John Reynolds, Definitional Interpreters for Higher-Order Languages, 18 October 2016, Remote Meetup (slides pdf, slides key, links to papers, video). Lambda World, 1 October 2016, Cadiz. Keynote (slides). Programming Language Mentoring Workshop (PLMW), colocated with ICFP 18 September 2016, Nara. Speaker (slides). International Summer School on Metaprogramming, 8—12 August 2016, Cambridge. Lecturer (slides). Coherence Generalises Duality: a logical explanation of multiparty session types, Marco Carbone, Sam Lindley, Fabrizio Montesi, Carsten Schürmann, Ph",
  "content_length": 31375,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:12"
}