{
  "name": "Phoebe O. Toups Dugas",
  "homepage": "https://research.monash.edu/en/persons/phoebe-toups-dugas",
  "status": "success",
  "content": "Phoebe Toups Dugas - Monash University View Scopus Profile Phoebe Toups Dugas Assoc Professor Associate Professor, Department of Human Centred Computing https://orcid.org/0000-0002-6192-2004 EmailPhoebe.ToupsDugasmonashedu Accepting PhD Students 20172025 Research activity per year Personal profile BiographyPhoebe Toups Dugas (she/her) is an Associate Professor of Human-Centred Computing in the Exertion Games Lab at Monash University and a Science & Technology Australia Superstar of STEM. Phoebe’s research centres designing for transgender gender euphoria in games and interactive systems. She continues to address the role of information technology in disaster response and has an ongoing interest in maps and cartography. Phoebe formerly hails from New Mexico State University, Disaster City, and Texas A&M University. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Ph.D., Non-Mimetic Simulation Games: Teaching Team Coordination from a Grounding in Practice, Texas A&M UniversitySept 2004 → May 2010Award Date: 13 May 2010Computer Science, B.A., Southwestern University (United States of America)Aug 1999 → May 2003Award Date: 10 May 2003 External positionsAssociate Professor, New Mexico State UniversityAug 2018 → Aug 2023Assistant Professor, New Mexico State UniversityAug 2013 → Aug 2018 Research area keywordsqueer game designtrans game designgame designmixed realityteam coordinationdisaster response Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2017 2018 2019 2023 2025 2025 31 Conference Paper 6 Article 2 Foreword / Postscript 1 Book 1 More 1 Review Article Research output per year Research output per year Designed & Discovered Euphoria: Insights from Trans-Femme Players' Experiences of Gender Euphoria in Video GamesLiang, S., Cormier, M. V., Bohrer, R. & Toups Dugas, P. O., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 21 p. 104Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 2 Citations (Scopus) General Chairs' WelcomeYamashita, N., Evers, V., Yatani, K., Ding, X., Lee, B., Chetty, M. & Toups-Dugas, P., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 1 p.Research output: Chapter in Book/Report/Conference proceeding › Foreword / Postscript › Other Mobile Maps Continue to Fail Pedestrians: Synthesised Reflective Auto-Aggro-Ethnographies of WalkingToups Dugas, P. O., Seetharaman, B., Fleming, R. J., Liang, S., Elvitigala, D. S., Rode, J. A. & LaLone, N., 2025, Extended Abstracts of the 2025 CHI Conference on Human Factors in Computing Systems. Yatani, K. & Ding, X. (eds.). New York NY USA: Association for Computing Machinery (ACM), 12 p. 638Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other Papers Chairs' WelcomeLee, B., Chetty, M., Toups-Dugas, P., Arakawa, R., Chanenson, J. & Cormier, M., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Sytems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 1 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other Reframing Diversity in Computing on the Basis of GendersRode, J. A., Toups Dugas, P. O. & Kerne, A., 11 Jun 2025, In: Computer Supported Cooperative Work: CSCW: An International Journal. 34, p. 785–833 49 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile View all 41 research outputs Prizes Papers Honourable MentionLaLone, N. J. (Recipient), Toups Dugas, P. (Recipient) & Cormier, M. (Recipient), 12 Oct 2023Prize: Prize (including medals and awards) Papers Honourable MentionLiang, S. (Recipient), Cormier, M. V. (Recipient), Bohrer, R. (Recipient) & Toups Dugas, P. (Recipient), May 2025Prize: Prize (including medals and awards) Superstar of STEMToups Dugas, P. (Recipient), 11 Dec 2024Prize: National/international honour Activities Activities per year 2023 2025 2025 8 Public lecture/debate/seminar 3 Contribution to conference Activities per year X-Gender Experiences of Euphoria and Transgressive PlayToups Dugas, P. (Performer)3 Sept 2025Activity: Community Talks, Presentations, Exhibitions and Events › Public lecture/debate/seminar How & Why to Design for (Trans)gender EuphoriaToups Dugas, P. (Performer) & Cormier, M. V. (Performer)7 Oct 2025Activity: Community Talks, Presentations, Exhibitions and Events › Public lecture/debate/seminar Mobile Maps Continue to Fail Pedestrians: Synthesised Reflective Auto-Aggro-Ethnographies of WalkingToups Dugas, P. (Performer)May 2025Activity: Community Talks, Presentations, Exhibitions and Events › Public lecture/debate/seminar Designing for Joy: Creating Gender Euphoria in GamesToups Dugas, P. (Performer)17 Oct 2025Activity: Community Talks, Presentations, Exhibitions and Events › Public lecture/debate/seminar It Takes a Spark, STEM Conference 2025Toups Dugas, P. (Keynote/plenary speaker)23 Oct 2025Activity: Participating in or organising an event types › Contribution to conference View all 11 activities Press/Media Thousands of games have been censored from major platforms, with LGBTQIA+ creators caught in the crossfireToups Dugas, P.6/08/251 Media contributionPress/Media: Article/Feature Video games linked to gender euphoriaToups Dugas, P., Cormier, M. V. & Richards, S.26/06/251 item of Media coveragePress/Media: Profile/Interview Video games can help trans players feel seen and safe. It all starts with designToups Dugas, P. & Cormier, M. V.25/06/251 Media contributionPress/Media: Article/Feature Queer Inclusive Gaming & NaloxoneToups Dugas, P.6/06/251 item of Media coveragePress/Media: Profile/Interview Gender euphoria, video games & glam rock!Toups Dugas, P.4/06/251 Media contributionPress/Media: Profile/Interview",
  "content_length": 6677,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:22"
}