{
  "name": "Pierre Dillenbourg",
  "homepage": "https://people.epfl.ch/pierre.dillenbourg",
  "status": "success",
  "content": "EPFL - Pierre Dillenbourg Données administratives Pierre Dillenbourg pierre.dillenbourg@epfl.ch +41 21 693 20 71 http://chili.epfl.ch vCard Nationalité: Suisse et Belge Professeur ordinaire, Laboratoire d'ergonomie éducative EPFL IC IINFCOM CHILIRLC D1 740 (Rolex Learning Center)Station 201015 Lausanne +41 21 693 20 71 Office: RLC D1 660 EPFL › IC › IINFCOM › CHILI Site web: https://chili.epfl.ch/ Professeur ordinaire, SIN - Enseignement +41 21 693 20 71 EPFL › IC › IC-SIN › SIN-ENS Site web: https://sin.epfl.ch Professeur ordinaire, SSC - Enseignement +41 21 693 20 71 EPFL › IC › IC-SSC › SSC-ENS Site web: https://ssc.epfl.ch Directeur de programme doctoral, Programme doctoral Learning sciences Programme doctoral Learning sciences +41 21 693 20 71 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDLS-GE Site web: https://www.epfl.ch/education/phd/ Directeur de programme doctoral, EDLS - Enseignement +41 21 693 20 71 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDLS-ENS Site web: https://www.epfl.ch/education/phd/ Membre, Commission doctorale +41 21 693 20 71 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › CDOCT Expertise Learning TechnologiesOnline Education, MOOCsHuman-Computer InteractionCollaborative learning (CSCL/CSCW)Eye TrackingTangible interfacesEducational Robotics Expertise Learning TechnologiesOnline Education, MOOCsHuman-Computer InteractionCollaborative learning (CSCL/CSCW)Eye TrackingTangible interfacesEducational Robotics Biographie Recherche Enseignement et PhD Mon laboratoire fermera ses portes le 1er mars 2026. Il ne pourra plus accueillir de projets étudiants ou doctoraux.Ancien instituteur primaire, Pierre Dillenbourg obtient un master en Sciences de l'Education (Université de Mons, Belgique). Dans son projet de master en 1986, il est l'un des premiers au monde à appliquer les méthodes de 'machine learning' à l'éducation, afin de développer un 'self-improving teaching system'. Ceci lui permettra de débuter une thèse de doctorat en informatique à l'Université de Lancaster (UK) dans le domaine des applications éducatives de l'intelligence artificielle. Il a été Maître d'Enseignement et de Recherche à l'Université de Genève. Il rejoint l'EPFL en 2012, où Il fut le directeur du Centre de Recherche sur l'Apprentissage, la formation et ses technologies(CRAFT), puis du Centre pour l'Education à l'Ere Digitale (CEDE) qui a notamment mis en oeuvre la stratégie MOOC de l'EPFL (plus de 3 millions d'inscriptions). Il est actuellement professeur ordinaire en technologies de formation aux sein de la faculté Informatique et Communications et dirige laboratoire d'ergonomie éducative (CHILI). Depuis 2006, il a aussi été le directeur de DUAL-T, la 'leading house' dédiée aux technologies pour les systèmes de formation professionnelle duale. Il a fondé plusieurs start-ups dans l'éducation et rejoint plusieurs conseils d'administration. En 2017, Il a créé avec des collègues le 'Swiss EdTech Collider', un incubateur qui rassemble 80 start-ups dans le domaine des technologies éducatives. En 2018, ils ont lancé LEARN, le centre EPFL pour les sciences de l'apprentissage, lequel regroupe les initiatives locales en innovation éducative. Pierre est un 'inaugural fellow of the International Society of Learning Sciences'. Il fut actuellement le Vice-Président Associé pour l'Education à l'EPFL et le Vice-Président Affaires Académiques (provost) ad interim. Travaux actuels Cf. http://chili.epfl.ch/ Recherche List of publications Voir Infoscience Enseignement et PhD Current Phd Lucas Gérard Julien Burget Past Phd As Director Nicolas Nova, Mauro Cherubini, Mirweis Sangin, Guillaume Zufferey, Khaled Bachour, Marc-Antoine Nüssli, Hamed S. Alavi, Lenh Hung Son Do, Quentin Bonnard, Sébastien Cuendet, Andrea Mazzei, Flaviu Roman, Julia Fink, Nan Li, Mirko Raca, Himanshu Verma, Kshitij Sharma, Mina Shirvani Boroujeni, Ayberk Özgür, Lorenzo Lucignano, Shruti Chandra, Thibault Lucien Christian Asselborn, Arzu Güneysu Özgür, Louis Pierre Faucon, Alexis David Jacq, Kevin Gonyop Kim, Elmira Yadollahi, Ramtin Yazdanian, Jauwairia Nasir, Hala Khodr, Sina Shahmoradi, Utku Norman, Chenyang Wang Past Phd As Codirector Aurélien Lucchi, Stéphane Bonardi, Fanny Riedo, Adrian Dan Tarniceriu, Teresa Yeo Courses Digital education CS-411 Ce cours étudie les relations entre certaines caractéristiques techniques des environnements et les processus cognitifs des apprenants. Il aborde également les méthodes et les résultats des études empiriques : ces technologies favorisent-elles vraiment l'apprentissage? Introduction to Methods in Learning Sciences 1 LEARN-610 Introduction to Methods in Learning Sciences 2 LEARN-611 JDPLS Summer school LEARN-701 JDPLS Winter school LEARN-700 Theoretical Foundations of Learning Sciences 1 LEARN-600 Theoretical Foundations of Learning Sciences 2 LEARN-601 Back to top",
  "content_length": 4835,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:28"
}