{
  "name": "Pierluigi Plebani",
  "homepage": "http://home.deib.polimi.it/plebani",
  "status": "success",
  "content": "Pierluigi Plebani, Ph.D. Pierluigi Plebani, Ph.D. English Skip to content Home Research Projects Publications Books For students (thesis) Contacts Pierluigi PLEBANI – Associate Professor Dipartimento di Elettronica, Informazione e Bioingegneria pierluigi.plebani@polimi.it If you are looking for a thesis under my supervision, please have a look here Bio sketch I am currently an Associate Professor at Dipartimento di Elettronica, Informazione e Bioingegneria, Politecnico di Milano, where I also received the PhD degree in Information Engineering. I belong to the Information Systems group, and my research interests include Business Process Management, Service-Oriented Architectures, Adaptive Process-aware Information Systems, and Green IS. My research activity is now mainly focused on studying how to improve the data management in fog environments by leveraging on efficient balance between data and application movement (paper). I am also interested in studying how to monitor cross-organizational business processes using distributed architectures adopting smart devices (paper, slides), commitments (paper), and to make them resilient (paper). I am also currently studying potential of blockchain to make the process monitoring more trustful (paper). In the past, my research activity has focused on the design of adaptive service-based business processes. A Semantic-based matchmaking algorithm named URBE, based on the evaluation of similarity between service interfaces described with WSDL or SAWSDL, has been the result of my Ph.D. (paper, prototype). In the meanwhile, I also have investigated how to describe, negotiate, and monitor Web service and cloud quality (paper, paper, paper).  Recently, my work has moved to techniques for reducing CO2 emissions of applications deployed in the Cloud by changing their structure at both design-time and run-time (paper, paper). For more details on my research activity please refer to this page. A timely updated list of publications (including accepted but not yet published articles) is available at this page. Details on h-index (currently 23 for GoogleScholar and 17 for Scopus), citations and other bibliometrics are available via Google Scholar or via ResearchGate. Awards: CAiSE 2017 Best Paper Award for the paper “P. Plebani, A. Marrella, M. Mecella, M. Mizmizi, and B. Pernici. Multi-party Business Process Resilience By-Design: A Data-Centric Perspective” Chorafass Award for the Ph.D. thesis published in 2005 URBE selected as the best SAWSDL Matchmaker in Semantic Service Selection Contest in 2007 Scientific service: Associate Editor of International Journal of Cooperative Information Systems Member of ACM-TOSEM Board of Distinguished Reviewers Elected as chair of IFIP WG on Service Oriented Systems (WG 2.14/6.12/8.10) Program co-chair at ESOCC 2018 European Space Project Track co-chair at ESOCC 2020 Workshop chair at SOCA 2015, Track chair at CISIS 2011, Workshop and Tutorial co-chair at CAISE 2010, Demos and Poster co-chair at FIS 2010 Project proposal reviewer for Netherlands Organisation for Scientific Research (NWO), The Netherlands Project proposal reviewer for Knowledge Foundation/KK-stiftelsen, Sweden Reviewer for several journals and magazines such as IEEE TSE (Trans. on Software Engineering), IEEE TSC (Trans. on Services Computing), ACM TOIT (Trans. on Internet Technology), IEEE TPDS (Trans. on Parallel and Distributed Systems), IEEE TSNM (Trans. on Network and Service Management), SPE (Software Practice and Experience), John Wiley, JIS (Journal Information Systems), Elsevier, SOCA (Service Oriented Computing and Applications), Springer, IBM System Journal Membership in Program Committees: CAISE (International Conference on Advanced in Information Systems Engineering) BPM (International Conference on Business Process Management) ICSOC (International Conference on Service Oriented Computing) ESOCC (European Conference on Service-Oriented and Cloud Computing) IEEE SOCA (IEEE International Conference on Service Oriented Computing & Applications) IEEE GreenCom (IEEE International Conference on Green Computing and Communications) ICSOC-WESOA (International Workshop on Engineering Service Oriented Architecture) SmartGreens (International Conference on Smart Cities and Green ICT Systems) … other minor conferences and workshops Invited talk and panel: Invited talk at FAiSE Workshop @ CAiSE 2018 Conference “Orienteering in the Fog: an Information Systems perspective”, June 2018 (slides) Invited talk at ESOCC 2017 Conference “Business Processes and Smart Devices – a marriage of convenience?”, September 2017 (slides) Invited talk at ICGreen 2015 Conference “Reducing CO2 footprint of cloud-based applications: strategies and lessons learnt”, July 2015 Lecture on “Web service retrieval” at Semantic Web Services Winter Retreat, Seefeld, Austria, 2009 Lecture on “Quality of Web services” at International Summer School Chambery-Torino, Certosa di Collegno, Torino, 2006 Panel on “Quality of Service (QoS) Middleware for Web Services: Achieved Results and Challenges for the Future” at EDOC-MWS 2005 (Middleware for Web Services workshop in conjunction with the 9th International IEEE Enterprise Distributed Object Computing Conference) L. Baresi, M. Matera, and P. Plebani (Politecnico di Milano – Italy) Models and Technologies for Service Composition (issues and solutions). Presented at the 1st International Conference on Service-oriented Computing (ICSOC 2003). November, 2003, Trento, Italy. Teaching activities (information for students is available on BeeP): Lecturer for Ph.D. course at Politecnico di Milano on Business Process Management at Politecnico di Milano (April/May 2014, April/May 2016, April/May 2018) Lecturer for the Sistemi Informativi course (Management Engineering) and Process and Service Design course (Computer Science Engineering) at Politecnico di Milano (since A.Y. 2015-2016) Formerly lecturer for several courses at Politecnico di Milano including Informatica (for Management Engineering and Civil Engineering students) for 8 years, Sistemi Informativi (for Management Engineering and Computer Science Engineering students) for 8 years Lecturer for technical audience on Java Enterprise Edition, Information Systems design and development, Service Oriented Architectures, Web services. Printable version of CV (last update March 2018) Download Available thesis Looking for a thesis? Have a look here My detailed CV last update February 2022 Download BPMN modeling book (in italian) C. Cappiello, P. Plebani, M. Vitali, \"Business Process Modeling Notation (BPMN): esercizi di modellazione\", Dicembre 2015 (liberamente scaricabile) Download Enterprise Architecture Modeling with ArchiMate (v.0.9) P. Plebani, B. Pernici, \"Enterprise Architecture Modeling with ArchiMate. A Practical Introduction\", October 2024 Download IFIP WG SoS Join the IFIP WG on Service Oriented Systems More info Pierluigi Plebani, Ph.D. Proudly powered by WordPress.",
  "content_length": 6987,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:28"
}