{
  "name": "Pierre Kelsen",
  "homepage": "http://wwwen.uni.lu/snt/people/pierre_kelsen",
  "status": "success",
  "content": "Pierre KELSEN - FSTM - University of Luxembourg I Uni.lu Full professor Contact pierre.kelsen@uni.lu (+352) 46 66 44 5284 Details Profile Profile CV Functions Full professor In detail Faculty of Science, Technology and Medicine Department of Computer Science Software Engineering | Formal Methods Maison du Nombre6, avenue de la FonteL-4364 ESCH MNO, E03 0315070 pierre.kelsen@uni.lu (+352) 46 66 44 5284 Publications on ORBilu Software Complexity, Model-Driven Engineering, Formal Methods; Algorithms and Complexity; Combinatorial Methods; Algorithmic Graph Theory ASINE (2013 – present): Funding Source: FNR Pearl Title: Architecture-based Service Innovation in Networked Enterprises (ASINE) (together with CRP Henri Tudor) MaRCo (2010 – 2013): Funding Source: FNR Core Title: Managing Regulatory Compliance: a Business-Centred Approach Professor at UL since 2000, Computer Science and Communication Group Post-Doctoral Fellow, University of British Columbia, Vancouver, Canada and Max-Planck-Institut für Informatik, Saarbrücken, Germany. Ph.D. in Computer Science from University of Illinois at Urbana-Champaign in 1993 (advisor: Prof. Vijaya Ramachandran) M.Sc. in Computer Science from University of Illinois at Urbana-Champaign in 1989 Diploma in Computer Science from University of Karlsruhe in 1986 Stay connected and subscribe to our newsletter All fields are mandatory Choose among our mailing list(s) Mailing list 0 items selected University of Luxembourg – News and events FSTM – News and events Enter your email address Example: contact@uni.lu Please provide a valid email address. Example: jean.dupont@gmail.com I agree to the use of my email address in the context of subscribing to the University of Luxembourg’s newsletters. I am aware that I can unsubscribe or update my profile by clicking the unsubscribe or update profile link in the email communication. More information about data processing. Subscribe now To the top",
  "content_length": 1941,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:33"
}