{
  "name": "Pierre Boulanger",
  "homepage": "https://webdocs.cs.ualberta.ca/~pierreb",
  "status": "success",
  "content": "Pierre Boulanger Version July 2025 Pierre Boulanger, PhD., P. Eng Emeritus Professor Department of Computing Science University of Alberta Athabasca Hall, Room 411 Edmonton, Alberta T6G 2E8, CANADA Tel: (780) 492-3031 Fax: (780) 492-1071 Email: pierreb@ualberta.ca Who am I? Date of Birth: April 24, 1957 Hometown: Beautiful Quebec City I am a man who loves life, music, fine food, and most importantly, ideas. My new Best Friend A Short CV Dr. Boulanger is Professor Emeritus at the University of Alberta, where he held joint appointments in Computing Science and Radiology. His distinguished 42-year career included 18 years as a senior research officer at the National Research Council of Canada (1983-2001), followed by 24 years at the University of Alberta (2001-2025) as a full professor. He directed the Advanced Human Computer Interface Laboratory and continues to serve as scientific director of the SERVIER Virtual Cardiac Centre. During 2013-2023, he held the CISCO Chair in Healthcare Solutions, a $2 million endowment from CISCO Systems dedicated to applying network technologies and AI in healthcare. His research contributions span 3D sensing, geometric modeling, reverse engineering, patient-specific modeling, medical imaging, and more recently, quantum image processing. This work has yielded 410 publications and 8 patents. He remains active on editorial boards and international committees while serving as CTO of Naiad Lab Inc., a company specializing in AI healthcare technologies. Since retiring from the university in January 2025, Dr. Boulanger continues his research in quantum manifold-based image processing and is developing innovative geometry-aware neural networks. Full CV University Education Ph.D. in Electrical Engineering (1994), University of Montreal (Ecole Polytechnique), Department of Electrical Engineering, Montreal, Canada. Advising Professor: Dr. P. Cohen Dissertation: Multi-Scale Extraction of Geometric Elements MSc in Physics (1982), Laval University, Department of Physics Quebec City, Canada. Advising Professor: Dr. M. Baril Dissertation: Multi-Passage Mass Spectrometer BSc in Engineering Physics (1980), Laval University, Department of Engineering Physics, Quebec City, Canada. Dissertation: Design and Construction of a Multi-Channel Analyzer for an Electron Spectrometer Current Research Interests During my retirement, I am actively pursuing advanced research at the intersection of quantum computing and image processing, with a particular focus on leveraging quantum manifolds for novel computational approaches. This work explores how quantum mechanical principles can be applied to enhance traditional image processing algorithms, potentially offering exponential improvements in processing speed and capability for complex visual data analysis. Concurrently, I am pioneering the development of next-generation geometry-aware neural networks that integrate geometric understanding directly into their architectural design. These networks aim to process spatial and structural information more naturally than conventional neural networks, potentially revolutionizing applications in medical imaging, computer vision, and 3D reconstruction. By incorporating geometric priors and manifold learning principles, these networks promise to achieve better generalization with less training data while maintaining mathematical rigor in their representations. A significant portion of my time is dedicated to authoring a comprehensive textbook on Quantum Image Processing, which will serve as both a theoretical foundation and practical guide for researchers and practitioners in this emerging field. The book will cover fundamental quantum computing concepts, their application to image processing tasks, implementation strategies on current quantum hardware, and future directions for the field. This work aims to bridge the gap between quantum physics, computer science, and practical imaging applications, making this cutting-edge technology accessible to a broader scientific community. Past Projects See Advance Human-Computer Interfaces Laboratory Website Publication List The most recent publication list: Publications Recent Committee Work Scientific Director of the SERVIER Virtual Heart Center Member of ELIXR Board of Directors Chief Technology Officer of Naiad Lab Inc. Member of the editorial board of the Journal SENSORS Review Editor of Frontiers in Oncology Member of the CIHR Reviewers Board Past and Current Courses (2001-2025) Introduction to Computer Graphics This course introduces computer graphics concentrating on two- and three-dimensional graphics and interactive techniques. Course topics include fundamental concepts of raster graphics, simple output primitives, windowing, clipping, 2D transformations, 3D transformations, modelling and viewing, hidden-line and hidden-surface removal, illumination and shading models, morphing, etc., warping, texture mapping, raytracing, radiosity, and introduction to animation. Introduction to Multimedia Technology This course introduces basic principles and algorithms used in the current technologies of multimedia systems. One of these course goals is to give the student hands-on experience in multimedia data representation, compression, processing, and retrieval. The course also addresses sound transmission, music streaming, 2-D and 3-D graphics, image, and video. It also explores human perceptual problems associated with multimedia technologies. Introduction to Scientific Visualization Among the most significant scientific challenges of the 21st century will be effectively understanding and using the vast amount of information produced by supercomputers, sensors, and extensive simulations. By its very nature, visualization addresses the challenges created by such excess: too many data points, too many variables, too many time steps, and too many potential explanations. Thus, as we work to tame the accelerating information explosion and employ it to advance scientific, biomedical, and engineering research, visualization will be among our most essential tools. This course introduces scientists, engineers, and practitioners in medicine to data visualization fundamentals. Haptics Systems This graduate-level course introduces haptics, focusing on teleoperated and virtual environments displayed through the sense of touch. Topics covered include human haptic sensing and control, design of haptic interfaces (tactile and force), haptics for teleoperation, haptic rendering and modelling of virtual environments, control and stability issues, and medical applications such as telesurgery and surgical simulation. In addition, this course addresses students with interests in robotics, virtual reality, or computer-integrated surgical systems. Point-Based Graphics This course presents the latest research results in point-based computer graphics. After an overview of the critical research issues, we will discuss 3D scanning devices and novel concepts for the mathematical representation of point-sampled shapes. Next, the course describes high-performance and high-quality point model rendering, including advanced shading, anti-aliasing, and transparency. It also offers efficient data structures for hierarchical rendering on modern graphics processors and summarizes geometric processing methods, filtering, re-sampling point models, and physical modelling. Sensor-Based Modeling In recent years, sensors and algorithms for three-dimensional (3D) imaging and modelling of natural objects have received significant attention. The computer vision and graphics research communities are also increasingly used as tools for various applications in medicine, manufacturing, archaeology, and any field requiring 3D modelling of natural environments. This course's primary goal is to present a general overview of digital 3D imaging technology from photogrammetry to tomographic systems, and the various modelling techniques necessary to create 3D models of large and small structures compatible with multiple manufacturing and medical applications. Advanced Signal Processing for Computer Scientists This class addresses the representation, analysis, and design of discrete-time signals and systems. The central concepts covered include discrete-time processing of continuous-time signals; decimation, interpolation, and sampling rate conversion; flow-graph structures for DT systems; time-and frequency-domain design techniques for recursive (IIR) and non-recursive (FIR) filters; linear prediction; discrete Fourier transform, FFT algorithm; short-time Fourier analysis and filter banks; Wavelet Transform; Wiener and Kalman Filters, and various applications. This course qualifies as a breadth requirement in theory. Real-time Digital Signal Processing Using GPU This class addresses the representation, analysis, and design of discrete-time signals and systems. The central concepts covered include discrete-time processing of continuous-time signals; decimation, interpolation, and sampling rate conversion; flow-graph structures for DT systems; time-and frequency-domain design techniques for recursive (IIR) and non-recursive (FIR) filters; linear prediction; discrete Fourier transform, FFT algorithm; short-time Fourier analysis and filter banks; multivariate techniques; Wavelet Transform; Cepstral analysis, Wiener and Kalman Filters, and various applications. We also discuss and analyse the GPU implementations of many of these algorithms. Fundamentals of Medical Imaging After reviewing one-dimensional signal processing and sampling, the course will first review the two-dimensional signal processing theory. We will then study four general medical imaging modalities: projection radiography, computed tomography, magnetic resonance imaging, and ultrasound. The goal will be to understand these modalities in terms familiar to engineers and physicists. Flexibility exists to vary each topic area's depth and penetration after determining the stude",
  "content_length": 14203,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:27"
}