{
  "name": "Pierre Vandergheynst",
  "homepage": "https://people.epfl.ch/pierre.vandergheynst",
  "status": "success",
  "content": "Pierre Vandergheynst — People - EPFL Pierre Vandergheynst Edit profile Full Professor pierre.vandergheynst@epfl.ch +41 21 693 56 45 http://lts2.epfl.ch https://orcid.org/0000-0002-9070-900X Full Professor, Signal Processing Laboratory 2 EPFL STI IEL LTS2 ELE 235 (Bâtiment ELE) Station 11 1015 Lausanne +41 21 693 56 45 +41 21 693 26 01 Office: ELE 235 EPFL > STI > IEM > LTS2 Web site: Web site: https://lts2.epfl.ch/ Full Professor, SMT - Teaching EPFL STI IEM LTS2 ELD 241 (Bâtiment ELD) Station 11 1015 Lausanne +41 21 693 56 45 Office: EPFL > STI > STI-SMT > SMT-ENS PhD program committee member, Doctoral programm Computational and quantitative biology EPFL STI IEM LTS2 ELD 241 (Bâtiment ELD) Station 11 1015 Lausanne +41 21 693 56 45 Office: EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDCB-GE Web site: Web site: https://go.epfl.ch/phd-edcb Full Professor, SEL - Teaching EPFL STI IEM LTS2 ELD 241 (Bâtiment ELD) Station 11 1015 Lausanne +41 21 693 56 45 Office: EPFL > STI > STI-SEL > SEL-ENS Member, EPFL Committee of Academic Evaluation EPFL STI IEM LTS2 ELD 241 (Bâtiment ELD) Station 11 1015 Lausanne +41 21 693 56 45 Office: EPFL > VPA > VPA-FAC > CEAE vCard Données administratives Fields of expertise data sciencemachine learningcomputational harmonic analysisinverse problemscompressive sensingcomputer vision Links LTS2 lab home page Mission Data nowadays come in overwhelming volume. In order to cope with this deluge, we explore and use the benefits of geometry and symmetry in higher dimensional data. But volume is not the only problem: data models are also increasingly complex, mixing various components. We thus use redundant dictionaries as a dimensionality reduction tool to dig out information from complicated high-dimensional datasets and multichannel signals, or to model complex behaviours in more classical signals. Finally data can also be complex because they are collected on surfaces, or more generally manifolds, or because they are not scalar-valued. We thus explore extensions of Computational Harmonic Analysis in higher dimensions, in complex geometries or for non-scalar data.  Visit our lab web pages. Biography Pierre Vandergheynst received the M.S. degree in physics and the Ph.D. degree in mathematical physics from the Université catholique de Louvain, Louvain-la-Neuve, Belgium, in 1995 and 1998, respectively. From 1998 to 2001, he was a Postdoctoral Researcher with the Signal Processing Laboratory, Swiss Federal Institute of Technology (EPFL), Lausanne, Switzerland. He was Assistant Professor at EPFL (2002-2007), where he is now a Full Professor of Electrical Engineering and, by courtesy, of Computer and Communication Sciences. As of 2015, Prof. Vandergheynst serves as EPFL’s Vice-Provost for Education.  His research focuses on harmonic analysis, sparse approximations and mathematical data processing in general with applications covering signal, image and high dimensional data processing, computer vision, machine learning, data science and graph-based data processing.  He was co-Editor-in-Chief of Signal Processing (2002-2006), Associate Editor of the IEEE Transactions on Signal Processing (2007-2011), the flagship journal of the signal processing community and currently serves as Associate Editor of Computer Vision and Image Understanding and SIAM Imaging Sciences. He has been on the Technical Committee of various conferences, serves on the steering committee of the SPARS workshop and was co-General Chairman of the EUSIPCO 2008 conference.   Pierre Vandergheynst is the author or co-author of more than 70 journal papers, one monograph and several book chapters. He has received two IEEE best paper awards. Professor Vandergheynst is a laureate of the Apple 2007 ARTS award and of the 2009-2010 De Boelpaepe prize of the Royal Academy of Sciences of Belgium. Show more Awards 2023 : IEEE SIGNAL PROCESSING MAGAZINE BEST PAPER AWARD : IEEE 2022 : Signal Processing Society Best Paper Award : IEEE Publications Infoscience publications Recent publications (2009-present) Conditional Deep Learning Model Reveals Translation Elongation Determinants during Amino Acid DeprivationM. V. Nallapareddy; F. Craighero; L. Worpenberg; F. Naef; C. Gobet et al.Communications Biology. 2025. DOI : 10.1038/s42003-025-09092-7.Detailed recordView at publisherBridging Graph Neural Networks and Large Language Models: A Survey and Unified PerspectiveÁ. Arroyo; F. Barbero; H. Blayney; M. Bronstein; X. Dong et al.2025Detailed recordBeyond Ensembles: Simulating All-Atom Protein Dynamics in a Learned Latent SpaceA. Sengar; A. Hariri; P. Vandergheynst; P. Barth2025. The Thirty-Ninth Annual Conference on Neural Information Processing Systems, San Diego, CA, US, 2025-12-02 - 2025-12-07. Detailed recordGenerative Modeling of Full-Atom Protein Conformations using Latent Diffusion on Graph EmbeddingsA. Sengar; A. Hariri; D. Probst; P. Barth; P. Vandergheynst2025Detailed recordReturn of ChebNet: Understanding and Improving an Overlooked GNN on Long Range TasksA. Hariri; Alvaro Arroyo; Alessio Gravina; Moshe Eliasof; Davide Bacciu et al.2025Detailed recordView at publisherInterpreting and comparing neural activity across systems by geometric deep learningA. Gosztolai; P. VandergheynstNATURE METHODS. 2025. DOI : 10.1038/s41592-024-02581-3.Detailed recordView at publisherOn Vanishing Gradients, Over-Smoothing, and Over-Squashing in GNNs: Bridging Recurrent and Graph LearningÁ. Arroyo; A. Gravina; B. Gutteridge; F. Barbero; C. Gallicchio et al.2025Detailed recordView at publisherMARBLE: interpretable representations of neural population dynamics using geometric deep learningA. Gosztolai; R. L. Peach; A. Arnaudon; M. Barahona; P. VandergheynstNature methods. 2025. DOI : 10.1038/s41592-024-02582-2.Detailed recordView at publisherBoosting Protein Graph Representations through Static-Dynamic FusionP. Guo; B. Ferreira de Sousa Correia; P. Vandergheynst; D. Probst2025. 42nd International Conference on Machine Learning, Vancouver, Canada, 2025-07-13 - 2025-07-19. Detailed recordGraph rewiring for long range-aware protein learningA. Hariri; P. Vandergheynst38th Annual Conference on Neural Information Processing Systems, Vancouver Convention Center, Canada, 2024-12-10 - 2024-12-15.Detailed recordExploring “dark-matter” protein folds using deep learningZ. Harteveld; A. Van Hall-Beauvais; I. Morozova; J. Southern; C. Goverde et al.Cell systems. 2024. DOI : 10.1016/j.cels.2024.09.006.Detailed recordView at publisherGraph learning for capturing long-range dependencies in protein structuresA. Hariri; P. Vandergheynst2024. Machine Learning for Computational Biology, Seattle, 2024-09-05 - 2024-09-06. Detailed recordMolecular set representation learningM. Boulougouri; P. Vandergheynst; D. ProbstNature Machine Intelligence. 2024. DOI : 10.1038/s42256-024-00856-0.Detailed recordView at publisherBeyond fine-tuning: LoRA modules boost near-OOD detection and LLM securityE. Salimbeni; F. Craighero; R. Khasanova; M. Vasic; P. Vandergheynst2024. ICLR 2024, Vienna, Austria, 2024-05-07 - 2024-05-11. Detailed recordSafe Deep Neural NetworksK. M. Matoba / P. Vandergheynst; F. Fleuret (Dir.) Lausanne, EPFL, 2024. DOI : 10.5075/epfl-thesis-10384. Detailed recordView at publisherTowards improving full-length ribosome density prediction by bridging sequence and graph-based representationsM. V. Nallapareddy; F. Craighero; F. Naef; C. Gobet; P. Vandergheynst2024. 19th Machine Learning in Computational Biology meeting, Seattle, WA, USA, 2024-09-05 - 2024-09-06. Detailed recordInfusing structured knowledge priors in neural models for sample-efficient symbolic reasoningM. Atzeni / P. Vandergheynst; A. Loukas (Dir.) Lausanne, EPFL, 2024. DOI : 10.5075/epfl-thesis-10642. Detailed recordView at publisherBeyond fine-tuning: LoRA modules boost near-OOD detection and LLM securityE. Salimbeni; F. Craighero; R. Khasanova; M. Vasic; P. Vandergheynst2024. 7th Deep Learning Security and Privacy Workshop, San Francisco, CA, May 23, 2024. Detailed recordInterpretable Inflammation Landscape of Circulating Immune cellsL. Jiménez-Gracia; D. Maspero; S. Aguilar-Fernández; F. Craighero; S. Ruiz et al.2023Detailed recordView at publisherFinding information-rich electrocardiographic biomarkers to characterize atrial fibrillationA. M. Mc Cann / J.-M. Vesin; P. Vandergheynst (Dir.) Lausanne, EPFL, 2023. DOI : 10.5075/epfl-thesis-10284. Detailed recordView at publisherProbabilistic methods for neural combinatorial optimizationN. Karalias / P. Vandergheynst (Dir.) Lausanne, EPFL, 2023. DOI : 10.5075/epfl-thesis-10221. Detailed recordView at publisherInterpretable statistical representations of neural population dynamics and geometryA. Gosztolai; R. L. Peach; A. Arnaudon; M. Barahona; P. VandergheynstarXiv. 2023. DOI : 10.48550/arxiv.2304.03376.Detailed recordView at publisherRosettaSurf-A surface-centric computational design approachA. Scheck; S. Rosset; M. Defferrard; A. Loukas; J. Bonet et al.Plos Computational Biology. 2022. DOI : 10.1371/journal.pcbi.1009178.Detailed recordView at publisherPlasma-based Electroacoustic Actuator for Broadband Sound AbsorptionS. Sergeev / P. Vandergheynst; H. Lissek (Dir.) Lausanne, EPFL, 2022. DOI : 10.5075/epfl-thesis-9784. Detailed recordView at publisherAuditory externalization of a remote microphone signalV. P. O. Grimaldi / P. Vandergheynst; H. Lissek (Dir.) Lausanne, EPFL, 2022. DOI : 10.5075/epfl-thesis-8959. Detailed recordView at publisherGeneralised Implicit Neural RepresentationsD. Grattarola; P. Vandergheynst2022. 36th Conference on Neural Information Processing Systems (NeurIPS 2022), New Orleans, Louisiana, USA, November 28 - December 9, 2022. Detailed recordLeveraging topology, geometry, and symmetries for efficient Machine LearningM. Defferrard / P. Vandergheynst (Dir.) Lausanne, EPFL, 2022. DOI : 10.5075/epfl-thesis-7398. Detailed recordView at publisherSound Field Reconstruction in a room through Sparse Recovery and its application in Room Modal EqualizationV. T. ",
  "content_length": 67077,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:36"
}