{
  "name": "Pierre Maret",
  "homepage": "http://perso.univ-st-etienne.fr/mapi9921",
  "status": "success",
  "content": "Pierre Maret's Home Page Pierre Maret Professor in Computer Science Connected Intelligence Hubert Curien Laboratory, UMR CNRS 5516 Université Jean Monnet  Université de Lyon France You can contact me for projects, open positions, or cooperation Contact Teaching activity Software engineering, Programming XML technologies, Semantic Web, Interoperability Information systems, Data bases, Business Process Modeling Research methodology Research Activity Semantic web, data and knowledge modeling, ontologies Virtual communities, social networks Publications, Events Five main publications - Dennis Diefenbach, Vanessa López, Kamal Deep Singh, Pierre Maret: Core techniques of question answering systems over knowledge bases: a survey. Knowl. Inf. Syst. 55(3): 529-569 (2018) - Dennis Diefenbach, Andreas Both, and Kamal Singh and Pierre Maret. Towards a Question Answering System over the Semantic Web. In Semantic Web Journal (minor revision). 2018. - José Miguel Giménez-Garcıa, Antoine Zimmermann, Pierre Maret. NdFluents: An Ontology for Annotating Statements in Linked Data. Proceedings of the 14th ESWC 2017. - Pierre Maret, Rajendra Akerkar, Laurent Vercouter:Virtual communities, a typology. Web Intelligence Journal 15(3): 185-187 (2017) - Pierre-René Lhérisson, Fabrice Muhlenbach, Pierre Maret: Fair Recommendations Through Diversity Promotion. ADMA conference 2017: 89-103 (Best paper award) o Other publications: see DBLP, Research gate, and HAL o Workshop chair: Web Intelligence & Communities, WI&C hosted at the WWW conference in Lyon-2012, Rio de Janeiro-2013, Seoul-2014, Florence-2015, Montréal 2016. o Summer school organizations: Web of data 2014, Answering questions with the web 2015, Data Management and Questions Answering 2017. Supervised topics Collaborative ontology engineering. PhD. Omar Alqawasmeh, (co-supervised with Maxime Lefrançois) 2017-2020. Creating the French NELL knowledge base. Postdoc. Maisa Duarte, 2016. Meta data modelling with linked data, PhD. José Gimménez-Garcia (co-supervised with Antoine Zimmermann), 2015-2019 Question Answering over Knowledge Bases, PhD. Dennis Diefenbach (co-supervised with Kamal Singh), Defended in 1018 Les données d'interaction dans les systèmes collaboratifs d'ingénierie (Interaction data in collaborative engineering systems), PhD. Soumaya Yahiaoui (co-supervision with the University de Savoie, Christophe Courtin, Laurent Tabouret), 2015-2019 Système de recommandation équitable d'uvres numériques. En quête de diversité (Fair recommendation system for digital works. Quest of diversity), PhD. Pierre-René Lhérisson (co-supervised with Fabrice Muhlenbach), Defended in 2018 Constructing scientific narratives around the Dust Bowl: a network-based study of American scientist communities. PhD visiting student Aitong Li, 2014 A framework for the semantic exploration of online communities, PhD Johann Stan, Defended in 2011 (joint collaboration with Alcatel-Lucent Bell Labs France) A model for semantic agents. Application to virtual knowledge communities (in French) PhD Julien Subercaze, Defended in 2010. A Contextual Framework based on Wisdom of Crowds for Ambient Social Awareness applications, PhD Adrien Joly, Defended in 2010 (joint collaboration with Alcatel-Lucent Bell Labs France) Adaptive hypermedia browsing on composite data. Application on the health-data record. PhD Chirine Ghédira, Defended in 2002 (co-supervision with Professor Paul Rubel). Method and tools for the design of corporate memories (in French). Djida Bahloul, Defended in 2006 (co-supervision with Professor Youssef Amghar). Projects, collaborations Marie Skłodowska-Curie Innovative Training Network (ITN, EU funds) WDAqua, Answering questions using web data (Executive Board member, Training Director). 2015-2018 Head of the French German doctoral college Semantic reasoning and coordination, 2014-2021 Industrial collaborations and PhD in collaboration with companies (Alcatel-Lucent Bell Labs, Graphinium, Stample, 1D lab, Winfrontier ) International academic cooperations: University of Tokyo, Aoyama Gakuin University, JST, University of Bonn, Fraunhofer, York University, University of Twente Curriculum Born on September, 18th 1966 Nationality: French Status: Married, 3 children Positions: 1992-1995: S2Com society (consulting company). 1996-1997: Assistant professor, University of Lyon (France) 1998-2007: Associate professor, Institut National de Sciences Appliquées, Lyon, France 2003-2004: invited researcher at the University of Karlsruhe, Germany (1 year) 2008-present: Professor, University of Lyon (University Jean Monnet, Saint Etienne, France) 2014: Invited professor at the University of Tokyo, Japan (2 months) 2017: Invited professor at the Aoyama Gakuin University, Japan (2 months) Contact Pierre Maret (pierre.maret at- univ-st-etienne.fr) Université Jean Monnet de Saint-Etienne Laboratoire Hubert Curien - UMR CNRS 5516 18 rue du Professeur Lauras - 42000 Saint-Etienne Cedex 2 - France Tel: +33 (0)4.77.91.58.11",
  "content_length": 5012,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:33"
}