{
  "name": "Pierluigi Nuzzo",
  "homepage": "https://descyphy.usc.edu",
  "status": "success",
  "content": "DesCyPhy Lab – Ming Hsieh Department of Electrical and Computer Engineering Skip to content Cyber-Physical System Design (DesCyPhy) Lab Our lab has moved to UC Berkeley this summer. Stay tuned for more updates. News Sep 2024: Prof. Nuzzo gave the opening keynote at the 2024 International Forum on Specification and Design Languages (FDL) in Stockholm. May 2024: Congratulations to Subhajit for winning the 2024 USC Viterbi Best Research Assistant Award! May 2024: Matthew returns to RTX Technology Research Center as an A.I. Systems Engineering Intern. May 2024: Kaixin will join Intel as a CAD intern this summer. Apr 2024: Congratulations to Subhajit for successfully defending his PhD thesis! Mar 2024: Our paper “Efficient Exploration of Cyber-Physical System Architectures Using Contracts and Subgraph Isomorphism” receives the Best Paper Award at DATE 2024, a leading conference in system design automation. Congratulations again to Yifeng, Chanwook, and Michele! Feb 2024: Matthew presented “Learning Compositional TV-CBF Contracts” as part of the NASA ULI on Safe Aviation Autonomy. 2024: Our paper “DECOR: Enhancing Logic Locking Against Machine Learning-Based Attacks” has been accepted at ISQED 2024. Congratulations to Yinghua, Kaixin, and Subhajit! 2024: Our paper “Analyzing Adversarial Vulnerabilities of Graph Lottery Tickets” has been accepted at ICASSP 2024. Congratulations to Subhajit and Zhiyu! Nov 2023: Our paper “Efficient Exploration of Cyber-Physical System Architectures Using Contracts and Subgraph Isomorphism” has been accepted at DATE 2024. Congratulations to Yifeng, Chanwook, and Michele! Dec 2023: Our paper “Exact and Cost-Effective Automated Transformation of Neural Network Controllers to Decision Tree Controllers” in collaboration with Prof. Jain’s group has been accepted at CDC 2023. Congratulations to Kevin and Nathan! Oct 2023: Congratulations to Chanwook for successfully defending his PhD thesis! Oct 2023: Our paper “Task Assignment, Scheduling and Motion Planning for Automated Warehouses for Million Product Workloads” in collaboration with Prof. Sven Koenig’s group has been accepted at IROS 2023. Congratulations to Chris, Chanwook and Michele! Sep 2023: Prof. Nuzzo receives the IEEE CEDA Ernest S. Kuh Early Career Award for “outstanding contributions to high-assurance design of cyber-physical systems using a contract-based design methodology”. May 2023: Yifeng and Matthew have been selected to participate in the Young Fellows program promoted by the 60th Design Automation Conference (DAC). May 2023: Matthew will join the RTX Technology Research Center as an A.I. Systems Engineering Intern this summer! Congratulations! May 2023: Yifeng will join Micron as a machine learning intern this summer! Congratulations! May 2023: Our paper “Computer-Aided Generation of Assurance Cases” in collaboration with the RTX Technology Research Center has been accepted at the Computer Safety, Reliability, and Security (SAFECOMP) 2023 Workshops. Congratulations to Chanwook and Matthew! May 2023: Our paper “Similarity-Based Logic Locking Against Machine Learning Attacks” has been accepted at DAC 2023. Congratulations to Subhajit and Kaixin! Apr 2023: Our papers “AACE: Automated Assurance Case Environment for Aerospace Certification” and “Computer-Aided Evaluation for Argument-Based Certification” have been accepted at the 42nd AIAA/IEEE Digital Avionics Systems Conference (DASC), 2023. Each paper has earned a “Best of Session” award! Congratulations to Chanwook and Matthew! Apr 2023: Our paper “Unraveling Latch Locking Using Machine Learning, Boolean Analysis, and ILP” in collaboration with Prof. Beerel’s group has been accepted at ISQED 2023. Congratulations to Dake, Xuan, Yinghua, Yuke, and Kaixin! Mar 2023: Our paper “On the Security of Sequential Logic Locking Against Oracle-Guided Attacks” in collaboration with Prof. Beerel’s group has been accepted in IEEE Transactions on CAD. Congratulations to Yinghua, Yuke, Kaixin, and Dake! Dec 2022: Prof. Nuzzo receives the Okawa Foundation Research Grant for his research on “Trustworthy Intelligent Autonomy: A Contract-Based Approach.” Dec 2022: Our paper “Contract-based Control Synthesis with Barrier Functions for Vehicular Mission Planning” has been accepted at CDC 2022. Congratulations to Nikhil! Oct 2022: Congratulations to Yinghua for successfully defending his PhD thesis! He will be joining Synopsys after graduation. Nov 2022: Our paper “Co-Design of Topology, Scheduling, and Path Planning in Automated Warehouses” in collaboration with Prof. Sven Koenig’s group has been accepted at Design, Automation & Test in Europe Conference & Exhibition (DATE) 2023. Congratulations to Chris, Chanwook, and Michele! Oct 2022: Congratulations to Yinghua for successfully defending his PhD thesis! He will be joining Synopsys after graduation. Oct 2022: Our paper “Quantitative Verification and Design Space Exploration under Uncertainty with Parametric Stochastic Contracts” has been accepted at ICCAD 2022. Congratulations to Chanwook and Michele! Sep 2022: Our paper “Practical Control Design for the Deep Learning Age: Distillation of Deep RL-Based Controllers” has been accepted at Annual Allerton Conference on Communication, Control, and Computing. Congratulations to Kevin an Krishna! Aug 2022: Our paper “Optimal Control of Partially Observable Markov Decision Processes with Finite Linear Temporal Logic Constraints” has been accepted at the Thirty-Eighth Conference on Uncertainty in Artificial Intelligence, PMLR. Congratulations to Krishna! July 2022: Prof. Nuzzo receives the Early Career Award from the IEEE Technical Committee on Cyber-Physical Systems for “outstanding works with high potential in high-assurance design and design automation of cyber-physical systems, including requirement analysis, architecture exploration, and contract-based design.” July 2022: Prof. Nuzzo will be hosting a workshop on Design Automation for the Certification of Autonomous Systems (DAC-AS) at the 59th Design Automation Conference (DAC) on Sunday, July 10th. May 2022: Nikhil will join Raytheon Technologies Research Corporation (again) as a Formal Methods Research Intern this summer. Congratulations! May 2022: Kaixin and Yinghua have been selected to participate in the Young Fellows program promoted by the Design Automation Conference (DAC). May 2022: Subhajit will join Google as an IC validation intern this summer! Congratulations! May 2022: Yinghua will join Intel as a security research intern this summer! Congratulations! April 2022: Our paper “ARACHNE: Automated Validation of Assurance Cases with Stochastic Contract Networks” in collaboration with Raytheon Technologies Research Center has been accepted at SAFECOMP 2022. Congratulations to Chanwook and Nikhil! March 2022: Our paper “TriLock: IC Protection with Tunable Corruptibility and Resilience to SAT and Removal Attacks” will be presented at DATE 2022. Congratulations to Yinghua! February 2022: Our paper “Towards a Formal Treatment of Logic Locking” in collaboration with Galois Inc. has been accepted at CHES 2022. December 2021: Our paper “Fun-SAT: Functional Corruptibility-Guided SAT-Based Attack on Sequential Logic Encryption” has been accepted at HOST 2021. Congratulations to Yinghua and Kaixin! December 2021: Our paper “Model-Free Reinforcement Learning for Optimal Control of Markov Decision Processes Under Signal Temporal Logic Specifications” has been accepted at CDC 2021. Congratulations to Krishna! November 2021: Our paper “ReIGNN: State Register Identification Using Graph Neural Networks for Circuit Reverse Engineering” has been accepted at ICCAD 2021. Congratulations to Subhajit and Kaixin! October 2021: Nikhil and Subhajit have been selected to participate in the Young Fellows program promoted by the Design Automation Conference (DAC). July 2021: Our paper “SANSCrypt: Sporadic-Authentication-Based Sequential Logic Encryption” has been accepted at VLSI-SoC: Design Trends. Congratulations to Yinghua and Kaixin! May 2021: Our paper “Enhancing SAT-Attack Resiliency and Cost-Effectiveness of Reconfigurable-Logic-Based Circuit Obfuscation” has been accepted at ISCAS 2021. Congratulations to Subhajit and Yinghua! May 2021: Our paper “Optimal Control of Discounted-Reward Markov Decision Processes Under Linear Temporal Logic Specifications” has been accepted at ACC 2021. Congratulations to Krishna! May 2021: Our paper “Incremental Refinement of Goal Models with Contracts” has been accepted at FSEN 2021. May 2021: Our paper “A Sample-Efficient Algorithm for Episodic Finite-Horizon MDP with Constraints” has been accepted at AAAI 2021. Congratulations to Krishna! February 2021: Our paper “Risk-Aware Cost-Effective Design Methodology for Integrated Circuit Locking” has been accepted at DATE 2021. Congratulations to Yinghua, Kaixin, and Subhajit! December 2020: Our paper “Robustness Contracts for Scalable Verification of Neural Network-Enabled Cyber-Physical Systems” has been presented at MEMOCODE 2020. Congratulations to Nikhil for receiving the Best Paper award! December 2020: Our paper “CROME: Contract-Based Robotic Mission Specification,” joint work with our collaborators at Chalmers University of Technology and the University of Gothenburg, Sweden, has been presented at MEMOCODE 2020. October 2020: Our paper “SANSCrypt: A Sporadic-Authentication-Based Sequential Logic Encryption Scheme” has been accepted at VLSI-SoC 2020. Congratulations to Yinghua and Kaixin! May 2020: Nikhil will join Raytheon Technologies Research Corporation as a Formal Methods Research Intern this summer. Congratulations! October 2019: Our paper “Security-driven Metrics and Models for Efficient Evaluation of Logic Encryption Schemes” has been presented at MEMOCODE 2019. Congratulations to Yinghua! March 2019: Our paper “Optimizing Assume-Guarantee Contracts for Cyber-Physical System Design” has been presented at DATE 2019. Congratulations to Chanwook! March 2019: Our paper",
  "content_length": 10765,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:25"
}