{
  "name": "Pierre Poulin",
  "homepage": "http://www.iro.umontreal.ca/~poulin",
  "status": "success",
  "content": "Home Page of Pierre Poulin Pierre Poulin Adjunct (Retired) Professor Phone: (514) 343-6780 (office) Fax: (514) 343-5834 Dept: (514) 343-6602 Email: poulin@iro.umontreal.ca Lab: LIGUM (smail) Dept. I.R.O., Université de Montréal C.P. 6128, succ. Centre-ville Montréal, Québec, Canada, H3C 3J7 (fedex) 3423 (office), 2194 (main), or 3185 (LIGUM) Pavillon André-Aisenstadt 2920, chemin de la Tour Dept. I.R.O., Université de Montréal Montréal, Québec, Canada, H3T 1J4 Note on Retirement I am officially retired from my regular professor position since September 1st, 2025. I intend to remain active in research as an adjunct professor at DIRO until August 2028 (thereafter conditional to highly probable renewal). I will be physically at the office (at least) on Fridays. Other days, I am available through email/zoom/teams, but mostly early mornings, evenings, and weekends. I am still (and plan to continue) supervising M.Sc. students in research and internships, co-supervising Ph.D. students with colleagues, and participating on local committees (Predoc I, Predoc II, Defense) and external jurys. Although I would like to reduce my load of paper and grant evaluations, I can be contacted when they fall within my expertise. For the remaining days of the week, I am now finally involved in our company VYV, co-founded in 2004 with Martin Granger-Piché and Emric Epstein, two of my M.Sc. students. Research Interests Computer Graphics Realism Image Synthesis Local / Global Illumination Image-based Modeling and Rendering Natural Phenomena / Physical Simulation Procedural Modeling Real-time Rendering Animation Research Laboratoire d'Informatique Graphique de l'Université de Montréal (LIGUM) with Mikhail Bessmeltsev and Noam Aigerman former collaborative leaders: Neil F. Stewart, Bernhard Thomaszewski, Derek Nowrouzezahrai, and Victor Ostromoukhov Publications Our book on Shadow Algorithms Data Miner is available Teaching IFT6042: Image Synthesis IFT3355: Computer Graphics IFT2740: Tools for 3D Computer Graphics IFT2245: Operating Systems IFT1010: Programming I IFT6800: Atelier en informatique Responsabilities Responsible (Jan 2023 - May 2025 for the PREDOC Department Chair (July 2017 - June 2021) Coordinator (Sept. 2001 - Dec. 2016) for the International Student Exchanges with DIRO Responsible (June 2004 - ...) for the DESS : Diplôme d'études supérieures spécialisées en informatique Member (June - Nov. 2012) of the COPROM : Promotion Committee of the Faculty of Arts and Science Member (June 2010 - May 2011) of the CONOM : Nomination Committee of the Faculty of Arts and Science Member (Sept. 2005 - May 2008) of the COET : Curriculum Committee of the Faculty of Arts and Science Responsible (June 2004 - May 2007) for the CIA : Certificat en informatique appliquée Students (as of Sept 2025) Caio Brito, Ph.D. Paul Godbert, M.Sc. stage at LaForge, Ubisoft supervised by Arnaud Schoentgen Jie Bao, M.Sc. stage at ETS supervised by Adrien Gruson Matthew Georgy, M.Sc. recherche Alumni Collaborators at different stages of my career Marie-Paule Cani : GEOVIC, Ecole Polytechnique de Paris; EVASION, INRIA Grenoble, France; (Arnaud Emilien Ph.D. cotutelle ; Eric Plante M.Sc.) Emmanuelle Darles : Université de Poitiers, XLIM/SIC; (Arnaud Schoentgen Ph.D. cotutelle ; Mathias Brousset Ph.D. cosupervision) George Drettakis : REVES, INRIA Sophia Antipolis, France; (Eric Paquette M.Sc., Ph.D. cotutelle) Xavier Granier : IPARLA, INRIA Futurs, Bordeaux, France; (Romain Pacanowski Ph.D. cotutelle) Christopher G. Healey: North Carolina State University, USA; (texture visualization) Jean-Claude Iehl : Université de Lyon 1, CNRS/LIRIS; (Jonathan Dupuy Ph.D. cotutelle) Daniel Meneveaux : Université de Poitiers, XLIM/SIC; (Elsa Tamisier Ph.D. cotutelle ; Simon Courtin Ph.D. co-direction ; Mathias Brousset Ph.D. co-direction ; Valentin Gauthier Master2) Fabrice Neyret : AERIS/EVASION, INRIA Grenoble, France; (Eric Heitz Ph.D. visitor ; Alexandre Meyer Ph.D. visitor) Derek Nowrouzezahrai : University McGill, CS; (Alexandre Sirois-Vigneux M.Sc. co-direction) Victor Ostromoukhov : Université de Lyon 1, CNRS/LIRIS; (Jonathan Dupuy Ph.D. cotutelle ; Marie-Elise Cordeau M.Sc. ; Simon Bouvier-Zappa M.Sc.) Eric Paquette : ETS, Montréal; (Bruno Roy Ph.D. ; Jean-François St-Amour M.Sc.) Mathias Paulin : VORTEX, IRIT, Toulouse, France (Dorian Gomez Ph.D. cotutelle ; Anthony Pajot Ph.D.) Simon Premoze : Consultant; importance sampling of light paths in complex environments Houari A. Sahraoui : GEODES, IRO, Montréal; (Omar Benomar Ph.D. ; Guillaume Langelier Ph.D., M.Sc., 5 other M.Sc. students) Toki Takahashi : Tokyo Denki University (Shuhei Kodama Ph.D.) Marcelo Walter : UFRGS (Igor Fernandes M.Sc. co-direction) Andrew Woo : National Research Council Canada, Vancouver; (book on shadows) Activities Treasurer of CHCCS since 2021 Vice-president of CHCCS 2002-2024 Member of the Awards Committee of CACS/AIC, 2016-2018 Member of the Nomination Committee of CS-Can/Info-Can, 2016-2018 Member of the conference committee of Computer Graphics Society (CGS), since 2016 Member of the executive committee of Eurographics, 2013-2015 Theme AnImage co-leader, project PROMO leader, co-leader of project DATUM for the renewal, and RMC member of GRAND, 2009-2015 Founding committee: SIGGRAPH Montréal since 2001 Conference or paper Co-chair: CASA 2014: Computer Animation and Social Agents, Houston Eurographics 2013, Girona Computer Graphics International 2011, Ottawa Graphics Interface 2000, Montreal (and local organiser) Workshop Co-chair: Eurographics Workshop on Natural Phenomena 2005 Local Illumination, colocated with Graphics Interface 92, Vancouver Journal Editorial Board: Computers & Graphics, 2015-2022 Computer Animation and Virtual Worlds, 2012-2021 Revue Electronique Francophone d'Informatique Graphique, 2006-2015 Computer Graphics Forum 2011-2014 Guest editor with Holly Rushmeier of the March/April 2012 special issue of IEEE Computer Graphics and Applications, on Modeling and Rendering Material Appearance. Book Series Editorial Board: Information and Communication Technology, ISTE Ltd - Wiley 2010-2012 Program Committees: Afrigraph 10, 07-06, 04 CAD|Graphics 05, 03 CASA 16-14 Computer Graphics International 12-11, 08 Eurographics 16-15, 11-10, 08, 04-02 Eurographics short papers 24, 22, 14, 12 Eurographics Workshop on Natural Phenomena 09, 07-05 Eurographics Workshop on Rendering 98-96 Graphics Interface 17-10, 08-07, 04, 02, 00-98 High Performance Graphics 16-15 Spanish Computer Graphics Conference (CEIG) 24 Symposium on Interactive 3D Graphics and Games 16-14 Pacific Graphics 08-07, 05-03 Sibgrapi 25, 11-08, 98 SIGGRAPH 17 SIGGRAPH Asia 24 SIGGRAPH Asia, S&P 11-10 SIGGRAPH Asia, Courses 22, 14 Virtual Concept 05 Scientific Committee: Workshop on Image synthesis and applications, 8th Entretiens Jacques-Cartier 95, St.Etienne History 2025 September: Adjunct (Retired) Professor, Dept. I.R.O., Université de Montréal 2022 Fellow, Eurographics France 2022 January: Invited Professor (sabbatical 3 months), GEOVIC, Ecole Polytechnique de Paris, host: Marie-Paule Cani 2021 CHCCS Achievement Award and its presentation on youtube 2019 CHCCS Service Award 2017 July - 2021 May: Dept Chair Dept. I.R.O., Université de Montréal 2017 January: Invited Professor (sabbatical 6 months), MANAO, INRIA Bordeaux Sud Ouest, host: Xavier Granier 2016 January: Invited Professor (sabbatical 6 months), National Institue of Informatics (NII), host: Imari Sato, at Toho University, host: Mikio Shinya, and at The University of Tokyo, host: Toshiya Hachisuka 2012 March: Invited Professor (sabbatical 3 months), LIRIS, host: Victor Ostromoukhov 2009 February: Invited Professor (sabbatical 6 months), VORTEX, IRIT, host: Mathias Paulin and at ENSEEIHT, host: Géraldine Morin 2006 June: Full Professor, Dept. I.R.O., Université de Montréal 2001 March: Invited Professor (sabbatical 5 months), REVES, INRIA Sophia Antipolis, host: George Drettakis 2000 November: Invited Professor (sabbatical 4 months), Square USA, host: Kaveh Kardan 2000 Sept.: Invited Professor (sabbatical 2 months), Alias|wavefront, host: Andrew Woo 1999 June: Associate Professor, Dept. I.R.O., Université de Montréal 1994 June: Assistant Professor, Dept. I.R.O., Université de Montréal 1994 Winter: Postdoctoral fellow, Dept of Computer Science, Princeton University, host: Pat Hanrahan 1993 December: Ph.D., Imager Lab, Dept of Computer Science, University of British Columbia, supervisor: Alain Fournier 1990 Summer: Visitor, NTT Japan, host: Mikio Shinya 1989 January: M.Sc., DGP Lab, Dept of Computer Science, University of Toronto, supervisor: Alain Fournier 1986 May: B.Sc., Dept of Computer Science, Laval University DIRO | Infographie/Computer Graphics",
  "content_length": 8763,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:34"
}