{
  "name": "Pierre Le Bodic",
  "homepage": "https://research.monash.edu/en/persons/pierre-le-bodic",
  "status": "success",
  "content": "Pierre Le Bodic - Monash University View Scopus Profile Pierre Le Bodic Dr Senior Lecturer, Department of Data Science & AI https://orcid.org/0000-0003-0842-9533 EmailPierre.LeBodicmonashedu 20092025 Research activity per year Personal profile BiographyI am a senior lecturer in the faculty of IT at Monash University. I am primarily interested in solving general and applied Discrete Optimisation problems. I was previously a postdoc in Industrial and Systems Engineering at Georgia Institute of Technology, and I obtained my PhD in CS from Université Paris 11. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInformation Technology, Doctor of Philosophy, Université Paris-Sud (Paris-Sud University)Award Date: 28 Sept 2012 Research area keywordsCombinatorial OptimisationApproximationComplexity Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2019 2019 2020 2021 2023 2025 2027 2 Active 5 Finished Projects per year EBCS: Optimal Planning and Scheduling of Electric Bus Fleets and Charging stationsLe Bodic, P. (Primary Chief Investigator (PCI)) & Kheirkhah Rad, E. (Chief Investigator (CI))14/08/25 → 13/09/27Project: Research AI for Clean Energy and SustainabilityWang, H. (Primary Chief Investigator (PCI)), Jalili, M. (Chief Investigator (CI)), Strengers, Y. (Chief Investigator (CI)), Hill, D. (Chief Investigator (CI)), Razzaghi, R. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Liebman, A. (Associate Investigator (AI)), Pink, S. (Associate Investigator (AI)), Le Bodic, P. (Associate Investigator (AI)), Salehi, M. (Associate Investigator (AI)), Wang, T. (Associate Investigator (AI)), Vered, M. (Associate Investigator (AI)), Rong, J. (Associate Investigator (AI)), George, Y. (Associate Investigator (AI)), Song, H. (Associate Investigator (AI)), Tafakori, L. (Associate Investigator (AI)), Sajjadi, S. (Associate Investigator (AI)), Pourkhanali, A. (Associate Investigator (AI)), Moradiamani, A. (Associate Investigator (AI)) & Kamoona, A. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Agilent Thought Leader Project ExtensionMarriott, K. (Primary Chief Investigator (PCI)), Bonnington, P. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)) & Le Bodic, P. (Chief Investigator (CI))1/10/21 → 1/09/22Project: Research Health or economy? Making the best impossible decision.Le Bodic, P. (Primary Chief Investigator (PCI)), Ernst, A. (Chief Investigator (CI)), Thamrin, S. A. (Chief Investigator (CI)) & Nasir, S. (Chief Investigator (CI))27/08/20 → 27/11/20Project: Research Improved Constraint Reasoning for Robust Multi-agent Path PlanningStuckey, P. (Primary Chief Investigator (PCI)), Harabor, D. (Chief Investigator (CI)), Le Bodic, P. (Chief Investigator (CI)), Gange, G. (Chief Investigator (CI)) & Koenig, S. (Partner Investigator (PI))1/01/20 → 31/12/24Project: Research View all 7 projects Research output Research output per year 2009 2020 2021 2024 2025 28 Conference Paper 15 Article 1 Chapter (Book) 1 Comment / Debate Research output per year Research output per year Concurrent Planning and Execution in Lifelong Multi-Agent Path Finding with Delay ProbabilitiesZhang, Y., Chen, Z., Harabor, D., Le Bodic, P. & Stuckey, P. J., 2025, Proceedings of the AAAI Conference on Artificial Intelligence. Walsh, T., Shah, J. & Kolter, Z. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 23387-23394 8 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 39, no. 22).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access Needles in the Haystack-Rapid Error Detection for Cell Tracking SolutionsDoncila Pop, D., Le Bodic, P. & Nunez-Iglesias, J., 2025, ISBI 2025 - 2025 IEEE 22nd International Symposium on Biomedical Imaging, Proceedings. Wu, J. & Wong, S. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, 4 p. (Proceedings - International Symposium on Biomedical Imaging).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review An abstract model for branch and cutKazachkov, A. M., Le Bodic, P. & Sankaranarayanan, S., Jul 2024, In: Mathematical Programming. 206, p. 175–202 28 p.Research output: Contribution to journal › Article › Research › peer-review 2 Citations (Scopus) Optimal Unlabeled Pebble Motion on TreesLe Bodic, P. & Lam, E., 2024, Proceedings of the 17th International Symposium on Combinatorial Search. Felner, A. & Li, J. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 218-222 5 p. (Proceedings of the International Symposium on Combinatorial Search; vol. 17, no. 1).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 1 Citation (Scopus) Orthogonal Gradient Boosting for Simpler Additive Rule EnsemblesYang, F., Le Bodic, P., Kamp, M. & Boley, M., 2024, Proceedings of the 27th International Conference on Artificial Intelligence and Statistics (AISTATS) 2024. Dasgupta, S., Mandt, S. & Li, Y. (eds.). London UK: Proceedings of Machine Learning Research (PMLR), 22 p. (Proceedings of Machine Learning Research; vol. 238).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 3 Citations (Scopus) View all 45 research outputs",
  "content_length": 5997,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:32"
}