{
  "name": "Pietro Bonizzi",
  "homepage": "https://www.maastrichtuniversity.nl/pietro.bonizzi",
  "status": "success",
  "content": "Pietro Bonizzi (P.) - Pietro Bonizzi (P.) - Maastricht University Skip to main content Pietro Bonizzi (P.) Education Research Work for third parties Pietro Bonizzi (P.) I am an an Associate Professor at Maastricht University in the Department of Advanced Computing Sciences (DACS). I am also the Programme Director of the Bachelor's Computer Science, and of the Bachelor's Data Science & Artificial Intelligence at the Faculty of Science and Engineering. I am a member of the Systems & Control research theme. I completed my PhD in 2010 at the Laboratory of Computer Science, Signals and Systems (I3S) of Sophia Antipolis, Université Côte d'Azur, France. My research background is in biomedical engineering with a focus on biomedical signal processing. One of the main goals of my research is in developing data-driven and adaptive signal decomposition methods for the analysis of nonlinear and nonstationary signals (and of the underlying systems which generated those signals). My research interests are on signal processing, time series analysis, time-frequency analysis, and recurrence analysis. Applications span different fields, among which biomedical signals, and in particular the study of the complexity and level of organization of biological signals, with a specific focus on assessing the complexity of the atrial substrate for the generation and maintenance of atrial fibrillation. Over the years, I have also developed an interest on ECG-Imaging, a cardiac mapping technique that noninvasively images electrical potentials directly at the heart surface. With the help of Deep Learning, we have investigate how ECG-Imaging could be solved without the need for a person's torso and heart geometric information acquired from imaging techniques as CT-scan or MRI. The overall objectives of those applications in the medical field is to provide medical doctors with efficient diagnostic methods to improve the interpretation of the pathophysiological state of a patient, and yield information about pharmacological or surgical outcomes, thus helping medical doctors to define, evaluate, and tailor therapies.  Keywords: data-driven signal decomposition, signal processing, signal analysis, time-series analysis, time-frequency analysis, recurrence analysis, ECG-Imaging. Expertises My research interests are on signal processing, time series analysis, data-driven signal and time series decomposition, time-frequency analysis, and recurrence analysis, with application to the fields of medicine, biology, and cosmology. Career history September 2021 - present: Associate Professor at the Department of Advanced Computing Sciences, Maastricht University.May 2023 - present: Programme Director of the Bachelor's Computer Science at the Faculty of Science and Engineering.February 2020 - present: Programme Director of the Bachelor's Data Science and Artificial Intelligence at the Faculty of Science and Engineering.January 2013 - September 2021: Assistant Professor at the Department of Data Science and Knowledge Engineering, Maastricht University.January 2011 - December 2012: Post doc Researcher in Biomedical Signal and Image Processing at the Department of Knowledge Engineering, Maastricht University.2006-2010: PhD. in Biomedical Signal Processing at the University of Nice-Sophia Antipolis, Nice, France.Early stage training within the Marie Curie Action of the European Union (European Label). Pietro Bonizzi (P.) Associate Professor DACS Education Dept. of Advanced Computing Sciences Faculty of Science and Engineering ORCID Paul Henri Spaaklaan 1 6229 EN Maastricht C4.006 pietro.bonizzi@maastrichtuniversity.nl +31(0)43 3883479 Linkedin",
  "content_length": 3658,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:37"
}