{
  "name": "Pieter Jelle Toussaint",
  "homepage": "https://www.ntnu.edu/employees/pieter",
  "status": "success",
  "content": "Pieter Jelle Toussaint - NTNU Pieter Jelle Toussaint Download press photo Download press photo Foto: Close Pieter Jelle Toussaint Professor Department of Computer Science pieter@ntnu.no +4773550739 +4740646586 IT-bygget, 15, Gløshaugen, Sem Sælands vei 9 About Pieter Jelle Toussaint (1965) is a Professor at the Department of Computer and Information Science. He belongs to the Information Systems and Software Engineering research group. Professor Toussaint has a Msc in both Informatics and General Linguistics from the University of Leiden, The Netherlands, and a PhD in Medical Informatics from the same University. Fields of interest and present research activities Most of my research is related to the medical domain. My research interest is mostly covered by the overall theme Collaboration and Coordination of the IS group profile. Within that theme I focused on what can be seen as two sub-themes: Computer-mediated communication In 2003 I initiated a research programme at the clinical informatics group where I worked that focused on Computer-mediated communication in health care. Several research projects were initiated within this programme. In 2005 I co-edited a special issue for the International Journal of Medical Informatics on communication in health care, together with prof. E. Coiera from UNSW in Sydney. At NTNU I supervised a PhD-student (Ero Karlsen) who has a project on computer-mediated communication and at the moment we are in the process of hiring a postdoc and a PhD-candidate for a new computer-mediated communication project. This project is a collaboration with the telematics departement at NTNU. Computer-Supported Cooperative Work The COSTT project, for which I am the project manager, focuses on supporting coordination of clinical work. Some of the PhD candidates I supervise position their research explicitly in the CSCW research field. At the CSCW conference in Savannah in 2010 I presented a paper on a workshop on CSCW in health care, that was later reworked into an article that was accepted for a special issue of the International Journal of Medical Informatics (Level 2). Membership in academic and professional committees, scientific review work including peer-review, outreach activities, and other professional merits Recent grants acquired 2,4 million NOK in the EVASAM program of the Norwegian Research Council for the SIKT project (2014-2015) 23 million NOK in the stor IKT program of the Norwegian Research Council for the COSTT project (2008-2012) 3 Ph.D. positions within the ToKeN2000 program of the Dutch Council of Scientific Research, for a project called Narrator (2003-2007) 225.000 Euro for the development of an Internet based information system that supports patient education within elderly care. Project name; Geriwijzer (2002-2005) 60.000 Euro within the man-Machine Interaction program from the Dutch funding organization Senter/Novem, for a postdoc position on the development and evaluation of Agent-technology in assisting patients in selfcare (2003-2007) Scientific management Assistant head of the Clinical Informatics group of the Leiden University medical center Project leader of the Geriwijzer project Project leader of the Narrator project Project leader of the COSTT project Head of the IS-group at IDI/NTNU Scientific leader for the Health Informatics master at NTNU Member of the steering board of the strategic area NTNU Health Reviewer International Journal of Medical Informatics Computer methods and programs in Bio-medicine Methods of Information in Medicine Behaviour & Information Technology Professional Organizations Member of the board of the Dutch Organization for Medical Informatics till July 2007 Member of the track committee for IEEE CBMS “Supporting Collaboration in Healthcare” at CBMS 2009, 2010 and 2011 Professor Toussaint has supervised 3 doctoral students, and is currently supervising 5 PhD candidates. Publications 2025 Fosse, Kjersti Zakariassen; Toussaint, Pieter Jelle; Ellingsen, Gunnar. (2025) Implications on Work Practices for Mental Health Care Workers Using an Electronic Medication Management System. Studies in Health Technology and Informatics Academic article Melby, Line Kari; Anthun, Kirsti Sarheim; Toussaint, Pieter Jelle. (2025) Bright visions, shady days: Exploring hospital staff expectations and early experiences with a new EHR system in Norway. Health Informatics Journal Academic article 2024 Toussaint, Pieter Jelle; Ellingsen, Gunnar Adelsten; Hertzum, Morten; Melby, Line Kari. (2024) The Role of Health Informatics Research: A Case of a Large-Scale Implementation in Norway. Academic chapter/article/Conference paper 2022 Munoz-Gama, Jorge; Martin, Niels; Fernandez-Llatas, Carlos; Johnson, Owen A.; Sepúlveda, Marcos; Helm, Emmanuel. (2022) Process mining for healthcare: Characteristics and challenges. Journal of Biomedical Informatics Academic article Melby, Line; Toussaint, Pieter Jelle; Petersen, Per Storrø. (2022) Helseplattform i sol og regn. Feature article Gilstad, Heidi; Skogen, Martha Rice; Toussaint, Pieter Jelle; Larsen, Cathrin Brøndbo; Faxvaag, Arild. (2022) Negotiating scientific knowledge in the development of an eHealth MOOC. Education and Information Technologies : Official Journal of the IFIP technical committee on Education Academic article Verdaguer, Aina Goday; Toussaint, Pieter Jelle; Kooij, Rimmert Bessel Koert van der. (2022) Drivers and Barriers for the Implementation of Integral Capacity Management in Norwegian Hospitals. SINTEF Digital SINTEF Digital Report 2021 Mogård, Hans Tore; Toussaint, Pieter Jelle. (2021) Epic's implementation of the Willow module and the healthcare workers involving in standardization. International Journal of Medical Informatics Academic article Milanes, Anolan; Toussaint, Pieter Jelle; Krogstie, John. (2021) NOKOBIT 2021 Preface. NIKT: Norsk IKT-konferanse for forskning og utdanning Abstract 2020 Lauvsnes, Anders Dahlen Forsmo; Langaas, Mette; Toussaint, Pieter Jelle; Gråwe, Rolf W.. (2020) Mobile Sensing in Substance Use Research: A Scoping Review. Telemedicine journal and e-health Academic literature review 2019 Melby, Line; Hellesø, Ragnhild; Brattheim, Berit J; Toussaint, Pieter Jelle. (2019) Irrelevant, dårlig strukturert og forsinket informasjon – en analyse av utfordringer knyttet til samhandling mellom sykehus og kommuner. Academic chapter/article/Conference paper Melby, Line; Sand, Kari; Midtgård, Trude Mariane; Toussaint, Pieter Jelle; Karlstrøm, Henrik. (2019) Digitaliseringens konsekvenser for samhandlingen og kvaliteten på helse-, velferds- og omsorgstjenestene. Kunnskapsnotat. Norges forskningsråd Norges forskningsråd Report Duc, Anh Nguyen; Eikebrokk, Tom Roar; Johannessen, Trond Vegard; Karlsen, Anniken Th; Kaasbøll, Jens Johan; Toussaint, Pieter Jelle. (2019) Vol. 27 No. 1 (2019): Proceedings from the annual NOKOBIT conference held in Narvik 26-27 November 2019. Other 2018 Mannhardt, Felix; Toussaint, Pieter Jelle. (2018) Revealing Work Practices in Hospitals Using Process Mining. Academic chapter/article/Conference paper Mannhardt, Felix; Leoni, Massimiliano de; Reijers, Hajo A.; Aalst, Wil M.P. van der; Toussaint, Pieter Jelle. (2018) Guided Process Discovery - A pattern-based approach. Information Systems Academic article 2017 Toussaint, Pieter Jelle; Melby, Line; Hellesø, Ragnhild; Brattheim, Berit J. (2017) Does Information Quality matter?. CEUR Workshop Proceedings Academic article Woldaregay, Ashenafi Zebene; Chomutare, Taridzo; Albers, Dave; Mamykina, Lena; Hejlesen, Ole Kristian; Lovis, Christian. (2017) An early infectious disease outbreak detection system based on self-recorded data from people with diabetes. Diabetes Technology & Therapeutics Abstract 2016 Hellesø, Ragnhild; Melby, Line; Brattheim, Berit J; Toussaint, Pieter Jelle. (2016) Exchange of information between hospital and home health care: A longitudinal perspective. Studies in Health Technology and Informatics Academic article Klemets, Joakim Henrik M; Toussaint, Pieter Jelle. (2016) Does revealing contextual knowledge of the patient’s intention help nurses’ handling of nurse calls?. International Journal of Medical Informatics Academic article Mannhardt, Felix; Leoni, Massimiliano de; Reijers, Hajo A; Aalst, Wil M. P. van der; Toussaint, Pieter Jelle. (2016) From low-level events to activities - A pattern-based approach. Lecture Notes in Computer Science (LNCS) Academic article Melby, Line; Toussaint, Pieter Jelle. (2016) \"We walk straight past the screens\": The Power of the Non-Users of a Hospital Information System. Academic chapter/article/Conference paper Brattheim, Berit J; Toussaint, Pieter Jelle; Melby, Line; Hellesø, Ragnhild; Osmundsen, Tonje. (2016) Samhandling med IKT (SIKT), prosjekt 229623 Sluttrapport til Forskningsrådet. Prosjektrapport Prosjektrapport Report 2015 Klemets, Joakim Henrik M; Toussaint, Pieter Jelle. (2015) Availability communication: requirements for an awareness system to support nurses' handling of nurse calls. Studies in Health Technology and Informatics Academic article 2014 Wienhofen, Leendert Wilhelmus Marinus; Preuveneers, Davy; Toussaint, Pieter Jelle; Berbers, Yolande. (2014) Event quality awareness for contextualized decision support in e-health applications. Academic chapter/article/Conference paper Melby, Line Maria Haugen; Toussaint, Pieter Jelle; Hellesø, Ragnhild. (2014) Patients in transition: e-messages as a tool for collaboration between hospital and community healthcare - a Norwegian Case. Computer-Based Medical Systems Abstract 2013 Håland, Erna; Toussaint, Pieter Jelle. (2013) Kommunikasjon, samarbeid og læring: Erfaringer fra et nettbasert læringsprogram for helsepersonell på Fosen. Academic chapter/article/Conference paper Iversen, Tobias Buschmann; Melby, Line; Toussaint, Pieter Jelle. (2013) Instant Messaging at the Hopsital: supporting articulation work?. International Journal of Medical Informatics Academic article 2012 Iversen, Tobias Buschmann; Melby, L",
  "content_length": 30566,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:36"
}