{
  "name": "Pinaki Sankar Chatterjee",
  "homepage": "https://cse.kiit.ac.in/profiles/pinaki-sankar-chatterjee",
  "status": "success",
  "content": "Pinaki Sankar Chatterjee - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Pinaki Sankar Chatterjee Pinaki Sankar Chatterjee Pinaki Sankar Chatterjee Associate ProfessorPinaki Sankar Chatterjee received his B.Tech degree in Information Technology from B.P.U.T, Orissa, India, his M.Tech degree in Computer Science from IIT Kharagpur, West Bengal, India, and his PhD degree in Computer Science from KIIT Deemed-to-be University Bhubaneswar, India. He is a member of IET and Indian Science Congress. He has published numbers of research papers in peer-reviewed international journals and conferences. His areas of interest include WSN, CWSN, NLP, IoT. Profile LinksEmail :[email protected]Scopus Id :56438890100Google Scholar :https://scholar.google.co.in/citations?user=FYcOYZkAAAAJ&hl=en Social LinksProfileRecent PublicationsProfileResearch InterestsWSN, CWSN, NLP, IoTAdministrative ResponsibilityFIC B.Tech Project, Course coordinator, Coordinator class monitoring.MembershipsMember IET, Member Orissa IT SocietyRecent PublicationsJournals/Conferences :[1] Pinaki Sankar Chatterjee, Monideepa Roy, \"A lightweight Clone-Node Detection Algorithm for Efficiently Handling SSDF Attacks and Facilitating Secure Spectrum Allocation in CWSNs\", in the proc. of IET Wireless Sensor Systems, IET Publication, 2017. [2] Pinaki Sankar Chatterjee, Monideepa Roy, \"Detecting PUE attack by measuring aberrational node behavior in CWSN\", in the proc. of the Journal of Interconnection Networks, World Scientific Publication, 2018. [3] Pinaki Sankar Chatterjee, Monideepa Roy, \"Maximum Match Filtering Algorithm to Defend Spectrum-Sensing Data Falsification Attack in CWSN\", in the proc. of the International Journal of Wireless and Mobile Computing, Inderscience Publication, 2018. [4] Pinaki Sankar Chatterjee and Monideepa Roy, \"Using a UNPCC based Classification Algorithm for Detection of PUE Attackers in Cognitive Wireless Sensor Networks\", in the proc. of the International Conference on Advanced Networks and Telecommunications Systems (ANTS), IEEE, 2017. [5] Pinaki Sankar Chatterjee and Monideepa Roy, \"Base Station Controlled Spectrum Allocation Technique to Detect the PUE Attack in CWSN\", in the proc. of the Computational Intelligence in Data Mining, Springer, 2015. [6] Pinaki Sankar Chatterjee and Monideepa Roy, \"A Regression based Spectrum-Sensing Data Falsification Attack Detection Technique in CWSN\", in the proc. of the 14th International Conference on Information Technology (ICIT), IEEE, 2015. sachi2020-10-10T08:46:47+05:30 Page load link Go to Top",
  "content_length": 2656,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:39"
}