{
  "name": "Pinar Öztürk",
  "homepage": "https://www.ntnu.edu/employees/pinar",
  "status": "success",
  "content": "Pinar Øztürk - NTNU Pinar Øztürk Download press photo Download press photo Foto: Close Pinar Øztürk Professor Department of Computer Science pinar@ntnu.no +4773551019 +4791897451 Drivhuset IT-bygget, sydfløy Gløshaugen, Trondheim About Pinar’s main research area is artificial intelligence but she does multidisciplinary research linking AI with other parts of cognitive science. Her research activities lie in  knowledge representation and modellling, case-based reasoning, multiagent systems, and recently bias and (un)fairness in AI systems Pinar currently teaches these courses: Introduction to Artificial Intelligence , Distributed Artificial intelligence  and Multiagent Systems, and Context Sensitive Systems. Competencies Artificial intelligence Case-based reasoning Decision support Experience Transfer Machine learning Publications 2025 Jaiswal, Amar; Øztürk, Pinar; Meisingset, Ingebrigt. (2025) Leveraging Knowledge and Data-Driven Approaches in Case-Based Reasoning to Aid Physiotherapists Addressing Non-Specific Musculoskeletal Disorders - An Applied Research. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation 2022 Jaiswal, Amar; Yigzaw, Kassaye Yitbarek; Øzturk, Pinar. (2022) F-CBR: An Architecture for Federated Case-Based Reasoning. IEEE Access Academic article 2020 Groza, Adrian; Øzturk, Pinar; Slavescu, Radu Razvan; Marginean, Anca. (2020) Climate change opinions in online debate sites. Computer Science and Information Systems Academic article 2018 Mosavi, Amir; Øzturk, Pinar; Chau, Kwok-Wing. (2018) Flood prediction using machine learning models: Literature review. Water Academic literature review Giordanengo, Alain; Øzturk, Pinar; Hansen, Anne Helen; Årsand, Eirik; Grøttland, Astrid; Hartvigsen, Gunnar. (2018) Design and development of a context-aware knowledge-based module for identifying relevant information and information gaps in patients with type 1 diabetes self-collected health data. JMIR Diabetes Academic article 2017 Aydogan, Reyhan; Øzturk, Pinar; Razeghi, Yousef. (2017) Negotiation for Incentive Driven Privacy-Preserving Information Sharing. Lecture Notes in Computer Science (LNCS) Academic article Barik, Biswanath; Marsi, Erwin; Øzturk, Pinar. (2017) Extracting Causal Relations among Complex Events in Natural Science Literature. Academic chapter/article/Conference paper Sizov, Gleb; Øzturk, Pinar; Marsi, Erwin. (2017) Let me explain: Adaptation of explanations extracted from incident reports. AI Communications Academic article 2016 Prasath, Rajendra; Øzturk, Pinar. (2016) An Approach to Content Extraction from Scientific Articles using Case-Based Reasoning. Research on Computing Science Academic article Marsi, Erwin; Øzturk, Pinar. (2016) Deliverable D1.5: Source Code and Interface of LKDB Software. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Report Barik, Biswanath; Marsi, Erwin; Øzturk, Pinar. (2016) Event Causality Extraction from Natural Science Literature. Research on Computing Science Academic article Marsi, Erwin; Øzturk, Pinar. (2016) Text mining of related events from natural science literature. Lecture Notes in Computer Science (LNCS) Academic article Sizov, Gleb; Øzturk, Pinar; Marsi, Erwin. (2016) Compositional adaptation of explanations in textual case-based reasoning. Lecture Notes in Computer Science (LNCS) Academic article 2015 Marsi, Erwin; Øzturk, Pinar. (2015) Extraction and generalisation of variables from scientific publications. Academic chapter/article/Conference paper Svalestuen, Yngve; Øzturk, Pinar; Tidemann, Axel; Tiller, Rachel Gjelsvik. (2015) Agent-based simulation of stakeholder behaviour through evolutionary game theory. Lecture Notes in Computer Science (LNCS) Academic article Tiller, Rachel Gjelsvik; Svalestuen, Yngve; Øzturk, Pinar; Tidemann, Axel. (2015) Simulating stakeholder behavior in a marine setting: Integrated coastal zone planning and the influential power of selected stakeholders in Frøya, Norway. Frontiers in Marine Science Academic article Tanajura, Ana Paula M; Øzturk, Pinar; Lepikson, Herman. (2015) Collaborative agents supporting tactical planning activities – an industrial application. Lecture Notes in Electrical Engineering Academic article Sizov, Gleb; Øzturk, Pinar; Aamodt, Agnar. (2015) Evidence-driven retrieval in textual CBR: Bridging the gap between retrieval and reuse. Lecture Notes in Computer Science (LNCS) Academic article Høverstad, Boye Annfelt; Tidemann, Axel; Langseth, Helge; Øzturk, Pinar. (2015) Short-Term Load Forecasting With Seasonal Decomposition Using Evolution for Parameter Tuning. IEEE Transactions on Smart Grid Academic article 2014 Marsi, Erwin; Øzturk, Pinar; Elias, Aamot. (2014) Deliverable D1.1: Literature-based Knowledge Discovery in Climate, Marine and Environmental Science. Norwegian University of Science and Technology Norwegian University of Science and Technology Report Sizov, Gleb Valerjevich; Øzturk, Pinar; Styrak, Jozef. (2014) Acquisition and Reuse of Reasoning Knowledge from Textual Cases for Automated Analysis. Academic chapter/article/Conference paper Bach, Kerstin; Gundersen, Odd Erik; Knappskog, Christian H; Øzturk, Pinar. (2014) Automatic Case Capturing for Problematic Drilling Situations. Academic chapter/article/Conference paper Marsi, Erwin; Øzturk, Pinar; Aamot, Elias; Sizov, Gleb Valerjevich; Ardelan, Murat Van. (2014) Towards Text Mining in Climate Science: Extraction of Quantitative Variables and their Relations. Academic chapter/article/Conference paper Øzturk, Pinar; Tidemann, Axel. (2014) A review of case-based reasoning in cognition-action continuum: A step toward bridging symbolic and non-symbolic artificial intelligence. Knowledge engineering review (Print) Academic article Øzturk, Pinar; Munoz-Avila, Hector; Aamodt, Agnar. (2014) Explanation of opportunities. Academic chapter/article/Conference paper 2013 Sizov, Gleb Valerjevich; Øzturk, Pinar. (2013) Query-Focused Association Rule Mining for Information Retrieval. Academic chapter/article/Conference paper Tidemann, Axel; Høverstad, Boye Annfelt; Langseth, Helge; Øzturk, Pinar. (2013) Effects of scale on load prediction algorithms. Academic chapter/article/Conference paper Sizov, Gleb Valerjevich; Øzturk, Pinar. (2013) Automatic Extraction of Reasoning Chains from Textual Reports. Academic chapter/article/Conference paper Løvlid, Rikke Amilde; Øzturk, Pinar. (2013) Internal Models as Echo State Networks: Learning to Execute Arm Movements. Norges teknisk-naturvitenskapelige universitet Doktoravhandlinger ved NTNU, 1503-8181 (2013:335) Doctoral dissertation 2012 Shi, Min; Downing, Keith; Aamodt, Agnar; Øzturk, Pinar. (2012) An Exploration and Optimization of Cooperative Coevolution. Norges teknisk-naturvitenskapelige universitet Doktoravhandlinger ved NTNU, 1503-8181 (2012:314) Doctoral dissertation Sizov, Gleb; Øzturk, Pinar. (2012) Mining of Association Relations in Text. Academic chapter/article/Conference paper 2011 Valle, Kjetil; Øzturk, Pinar. (2011) Graph-based Representations for Text Classification. Academic chapter/article/Conference paper Øzturk, Pinar; Vulchanova, Mila Dimitrova; Martinez, Liliana Sergueeva Serbezova; Tumyr, Christian Ove Orrebakken; Kabath, David. (2011) Assessing the feature-driven nature of similarity-based sorting of verbs. POLIBITS Research Journal on Computer Science and Computer Engineering With Applications Academic article Øzturk, Pinar. (2011) Proceedings of the India-Norway Workshop on Web Concepts and Technologies 2011. Tapir Akademisk Forlag Tapir Akademisk Forlag Academic anthology/Conference proceedings Sizov, Gleb Valerjevich; Øzturk, Pinar. (2011) Evaluation Methods for Textual Case-Based Reasoning. Academic chapter/article/Conference paper Tavakolifard, Mozhgan; Almeroth, Kevin C.; Øzturk, Pinar. (2011) Subjectivity handling of ratings for Trust and Reputation systems: An Abductive Reasoning Approach. International Journal of Digital Content Technology and its Applications Academic article Prasath, Rajendra; Øzturk, Pinar. (2011) Finding Potential Seeds through Rank Aggregation of Web Searches. Lecture Notes in Computer Science (LNCS) Academic article Tavakolifard, Mozhgan; Øzturk, Pinar. (2011) Situation-based Trust Adjustment by Conditional Reasoning. Academic chapter/article/Conference paper Daramola, Olawande; Sizov, Gleb Valerjevich; Øzturk, Pinar. (2011) Improving Trust in Travel Recommendations Using a Conversational Textual CBR Framework, Tapir academic press, , pp. 15-28, 2011. Academic chapter/article/Conference paper 2010 Tidemann, Axel; Øzturk, Pinar. (2010) Using Multiple Models to Imitate Drumming. Academic chapter/article/Conference paper Tidemann, Axel; Øzturk, Pinar. (2010) A self-organising multiple model architecture for motor imitation. International Journal of Intelligent Information and Database Systems Academic article Øzturk, Pinar; Røssland, Kari; Gundersen, Odd Erik. (2010) A multiagent framework for coordinated parallel problem solving. Applied Intelligence - The International Journal of Research on Intelligent Systems for Real Life Complex Problems Academic article Øzturk, Pinar; Tidemann, Axel. (2010) Case-based reasoning in the cognition-action continuum. Academic chapter/article/Conference paper Øzturk, Pinar; Prasath, Rajendra; Moen, Hans. (2010) Distributed Representations to detect Higher Order Term Correlations in Textual Content. Lecture Notes in Computer Science (LNCS) Academic article Løvlid, Rikke Amilde; Øzturk, Pinar. (2010) Learning Bimanual Coordination Patterns for Rhythmic Movements. Lecture Notes in Computer Science (LNCS) Academic article Øzturk, Pinar; Prasath, Rajendra. (2010) Recognition of Higher-order Relations Among Features in Textual Cases Using Random Indexing. Lecture Notes in Computer Science (LNCS) Academic article Sizov, Gleb Valerjevich; Øzturk, Pinar; Valle, Kjetil. (2010) The Use of Game Theory in Feature Selection.",
  "content_length": 25466,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:42"
}