{
  "name": "Pinar Tözün",
  "homepage": "https://pure.itu.dk/portal/en/persons/pinar-toezun(63342b24-28ec-40c5-a7d9-ec49867dc75d).html",
  "status": "success",
  "content": "Pinar Tözün - IT-University of Copenhagen © The image copyright belongs to me. Pinar Tözün Head of Section Associate Professor, Data, Systems, and RoboticsData-intensive Systems and ApplicationsHead of Research Group, Resource-Aware Data SystemsCenter for Climate IT Academic Responsible, DASYA https://orcid.org/0000-0001-6838-4854 Emailpitoitudk 20192025 Research activity per year Personal profile KeywordsData systemsDatabasesWorkload characterizationHeterogeneous hardwareResource-aware Machine LearningResource-constrained hardware Fingerprint Dive into the research topics where Pinar Tözün is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Graphics Processing Unit Computer Science 100% Computer Hardware Computer Science 77% Deep Learning Method Computer Science 73% Internet-Of-Things Computer Science 70% Deep Learning Training Keyphrases 66% Analytical Processing Computer Science 49% Benchmarking Computer Science 49% Edge Devices Keyphrases 45% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2019 2019 2020 2022 2023 2024 2025 2025 17 Article in proceedings 11 Journal article 3 Conference article 1 Anthology 3 More 1 Report 1 Book chapter 1 Encyclopedia chapter Research output per year Research output per year Modyn: Data-Centric Machine Learning Pipeline OrchestrationBöther, M., Robroek, T. T., Gsteiger, V., Holzinger, R., Ma, X., Tözün, P. & Klimovic, A., 10 Feb 2025, In: Proc. ACM Manag. Data. 3, 1, p. 1-30 30 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Data-driven Machine Learning 100% Selection Policy 75% Triggering Policy 75% Training pipeline 25% Fair Comparison 25% Path to GPU-Initiated I/O for Data-Intensive SystemsTorp, K. B., Lund, S. A. F. & Tözün, P., 22 Jun 2025, Proceedings of the 21st International Workshop on Data Management on New Hardware, DaMoN 2025, Berlin, Germany, June 22-27, 2025. New York: Association for Computing Machinery, p. 1-9 9 p. 3Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Input/Output 100% Intensive System 100% Graphics Processing Unit 100% Storage Interface 50% Learning Database 50% Resource-Efficient Machine Learning (Dagstuhl Seminar 24311)Balmau, O., Boehm, M., Klimovic, A., Pietzuch, P. R. & Tözün, P., 14 Feb 2025, In: Dagstuhl Reports. 14, 7, p. 153-169 17 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research Open Access Resource-efficient Machine Learning 100% Learning Resources 10% Job Scheduling 10% Deep Learning Compiler 10% Scheduling Management 10% The Five-Minute Rule for the Cloud: Caching in Analytics SystemsDuwe, K., Anadiotis, A., Lamb, A., Lersch, L., Leskes, B., Ritter, D. & Tözün, P., 2025, Conference on Innovative Data Systems Research. Conference on Innovative Data Systems ResearchResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Analytics Systems 100% Design Space 50% System Designer 50% Review Paper 50% System Architect 50% Towards A Modular End-To-End Machine Learning Benchmarking FrameworkBayer, R., Robroek, T. T. & Tözün, P., 30 Mar 2025, In: TDIS '25. p. 23–26 4 p.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open Access Benchmarking Framework 100% Evaluating Performance 33% Complex Workloads 33% Concurrent Load 33% Retrieval-augmented Generation 33% View all 35 research outputs Projects Projects per year 2020 2020 2021 2023 2026 1 Active 4 Finished Projects per year RAD+: Resource-Aware Data ScienceTözün, P. (PI), Rosero, P. (CoI), Nielsen , N. K. (CoI), Tøttrup, J. V. (CoI), Bayer, R. (CoI), Duane, A. (CoI), Hvass Jørgensen, J. (CoI), Osterhammel, J. M. (CoI), Sørensen, P. K. (Admin) & Yousefzadeh-Asl-Miandoab, E. (Collaborator)Independent Research Fund Denmark01/12/2021 → 31/03/2025Project: Research Data Science 100% Resource Base 100% Computer Hardware 62% Learning System 62% Machine Learning 62% MOTH: Machine Learning on Tiny HardwareTözün, P. (PI), Bayer, R. (CoI) & Robroek, T. T. (Collaborator)Novo Nordisk Foundation01/08/2023 → 31/07/2026Project: Research Machine Learning 100% Edge Devices 63% Machine Learning Models 56% Resource-constrained 53% Benchmarking Framework 50% EuroCC: National Competence Centres in the framework of EuroHPCBonnet, P. (PI), Tözün, P. (CoI) & Greenwood, L. R. (CoI)European Commission01/09/2020 → 31/12/2022Project: Research EuroHPC 100% Competence Centers 100% High Performance Computing 100% High-Performance Computing 100% Public Administration 50% DAPHNE: Integrated Data Analysis Pipelines for Large-Scale Data Management, High-Performance Computing, and Machine LearningTözün, P. (PI), Bonnet, P. (CoI), Clausen, M. T. (CoI) & Hedam, N. (CoI)European Commission01/12/2020 → 30/11/2024Project: Research Machine Learning 100% High Performance Computing 100% Data Management 100% High-Performance Computing 100% Learning System 100% RAD: Resource-Aware Data ScienceTözün, P. (PI), Yousefzadeh-Asl-Miandoab, E. (CoI) & Robroek, T. T. (CoI)Independent Research Fund Denmark01/04/2021 → 30/04/2025Project: Research Resource Base 100% Data Science 100% Computer Hardware 100% Data Scientist 62% Modern Hardware 50% Press/Media Midt i AI-ræset føles ny data science-konference som et åndehulTözün, P.27/08/20251 Media contributionPress/Media: Press / Media Stort dansk forskningsprojekt: Hvordan gør vi hardware-teknologi mere bæredygtig?Tözün, P.11/02/20211 Media contributionPress/Media: Press / Media ITU forsker i bæredygtig softwareTözün, P.20/01/20211 Media contributionPress/Media: Press / Media Building a Next-Gen System Infrastructure for Integrated Data Analysis PipelinesTözün, P. & Bonnet, P.12/01/20211 item of Media coveragePress/Media: Press / Media Activities Activities per year 2023 2023 2023 1 Membership in review committee Activities per year Hiring committee for recruitment of assistant/associate professor in Data-Intensive Systems and Applications (Event)Sestoft, P. (Chair), Tözün, P. (Member) & Husfeldt, T. (Member)22 Aug 2023 → 31 Dec 2023Activity: Membership types › Membership in review committee",
  "content_length": 6715,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:43"
}