{
  "name": "Pinar Karagoz",
  "homepage": "http://user.ceng.metu.edu.tr/~karagoz",
  "status": "success",
  "content": "Pinar Karagoz @METU Computer Engineering Department CENG METU Google Scholar DBLP Teaching Publications Students Projects Research Related PINAR KARAGÖZ Interest Areas: Data Mining, Machine Learning, Database Management Systems, Big Data Analytics, Semantic Web, Workflow Systems Contact Information: E-mail : karagoz[at]ceng.metu.edu.tr Address : METU Computer Eng. Department A-404 06800 Ankara Turkey Telephone : +90-(312)-210-5518 Fax : +90-(312)-210-5544 News: Check our project TEGHUB on Graph Mining on Graph DB for News Text Processing. Trajectory Prediction for Maritime Vessels Using AIS Data received the 3rd Place in the Best paper Awards at Intenational Conference on Management of Digital Ecosystems (MEDES 2020) Link Here Check our article on Detecting Traffic Event Related Blog Posts by Using Traffic Related Named Entities on IEEE Smart Cities Newletter here. Dynamic Programming Solution to ATM Cash Replenishment Optimization Problem received the best paper award at International Conference on Intelligent Computing and Optimization (ICO 2018). Analyzing Implicit Aspects and Aspect Dependent Sentiment Polarity for Aspect-based Sentiment Analysis on Informal Turkish Texts, received the best paper award at MEDES 2017. Link here. Predicting the Location and Time of Mobile Phone Users by Using Sequential Pattern Mining Techniques , is in the shortlist of Wilkes Award 2017. Link here. You can find the paper here. A Novel Wind Power Forecast Model: Statistical Hybrid Wind Power Forecast Technique (SHWIP) received 2016 Best Paper Award for the IEEE Transactions on Industrial Informatics. Predicting the Location and Time of Mobile Phone Users by Using Sequential Pattern Mining Techniques is in ScienceNode article: Sifting big mobile phone data predicts your next move. For Erasmus program, outgoing students can find info in the following link: General Information Cross OrganizationaRecommendation Generation for Performance Improvement by using Cross-Organizational Process Mining (Plug-In on Prom) Available at Github (Link at ProM ) Sentimentality and Polarity for the ClueWeb09 Dataset (here) Teaching: Spring 2020-2021 CENG 488 Guided Research CENG 514 Data Mining Previous CENG514 Data Mining CENG351 Data Management and File Structures CENG770 Advanced Data Mining syllabus CENG591 Graduate Seminar CENG100 Computer Engineering Orientation CENG213 Data Structures CENG230 Introduction to Programming CENG301 Algorithms and Data Structures CENG302 Introduction to DBMS CENG488 Special Topics in Comp. Eng: Guided Research CENG491 Computer Engineering Design I CENG492 Computer Engineering Design II CENG553 Database Management Systems Publications: Journal Papers M. B. Ozkan, P. Karagoz, Reducing the cost of wind resource assessment: using a regional wind power forecasting method for assessment, International Journal of Energy Research, 2021. G. Altinok, P. Karagoz, I. Batmaz, Learning to Rank by Using Multivariate Adaptive Regression Splines and Conic Multivariate Adaptive Regression Splines, Computational Intelligence, 2020 (DOI: 10.1111/coin.12413). F. Ozer, I. Hakki Toroslu, P. Karagoz, Comparison of Integer Linear Programming and Dynamic Programming Approaches for ATM Cash Replenishment Optimization Problem, International Journal of Applied Metaheuristic Computing, 11:3, pp. 120- 132, July-September 2020. M. B. Ozkan, P. Karagoz, Data Mining-Based Upscaling Approach for Regional Wind Power Forecasting: Regional Statistical Hybrid Wind POwer Forecast Technique (RegionalSHWIP), IEEE Access 7:171790-171800, 2019. P. Karagoz , B. Kama, M. Ozturk, I. H. Toroslu, D. Canturk, A Framework For Aspect based Sentiment Analysis on Turkish Informal Texts, Journal of Intelligent Information Systems, pp. 53(3),431-451, 2019. A. Simsek, P. Karagoz, Wikipedia Enriched Advertisement Recommendation for Microblogs by Using Sentiment Enhanced User Profiles, J Intell Inf Syst (2018). https://doi.org/10.1007/s10844-018-0540-5 O. Ozdikis, P. Karagoz, H. Oguztuzun, Incremental Clustering with Vector Expansion for Online Event Detection in Microblogs, Social Network Analysis and Mining, 7:56, 2017. (DOI 10.1007/s13278-017-0476-8). K. D. Onal, Y. Zhang, I. S. Altingovde, M. M. Rahman, Pinar Karagoz, A. Braylan, B. Dang, H. Chang, H. Kim, Q. McNamara, A. Angert, E. Banner, V. Khetan, T. McDonnell, A. T. Nguyen, D. Xu, B. C. Wallace, M. de Rijke, M. Lease, Neural information retrieval: at the end of the early years, Information Retrieval Journal, (DOI 0.1007/s10791-017-9321-y) M. Mitik, O. Korkmaz, P. Karagoz, I. H. Toroslu, F. Yucel, Data Mining Approach for Direct Marketing of Banking Products with Profit/Cost Analysis, The Review of Socionetwork Strategies, June 2017, Volume 11, Issue 1, pp 17-31 O. Ozdikis, H. Oguztuzun, P. Karagoz, A Survey on Location Estimation Techniques for Events Detected in Twitter, Knowledge and Information Systems, 52:2, pp.291-339, August 2017 (DOI: 10.1007/s10115-016-1007-z) M. Ozer, I. Keles, H. Toroslu, P. Karagoz, H. Davulcu, Predicting the Location and Time of Mobile Phone Users bu Using Sequential Pattern Mining Techniques, The Computer Journal, 59(6): 908-922 (2016) (DOI 10.1093/comjnl/bxv075) O. Ozdikis, H. Oguztuzun, P. Karagoz, Evidential estimation of event locations in microblogs using the Dempster-Shafer theory. Inf. Process. Manage. 52(6): 1227-1246 (2016) E. Sen, I. H. Toroslu, P. Karagoz: Improving the prediction of page access by using semantically enhanced clustering. J. Intell. Inf. Syst. 47(1): 165-192 (2016) H. Bagci, P. Karagoz, Context-aware location recommendation by using a random walk-based approach, Knowledge and Information Systems, 2015 (DOI: 10.1007/s10115-015-0857-0) A. Mutlu, P. Karagoz , Policy-based Memoization for ILP-based Concept Discovery Systems, Journal of Intelligent Information Systems, 46(1), pp.99-120, 2016 (DOI: 10.1007/s10844-015-0354-7) O. Kirmemis Alkan, P. Karagoz , WaPUPS: Web access Pattern extraction under User-defined Pattern Scoring, Journal of Information Science, 42(2): 261-273 (2016) (DOI: 10.1177/0165551515593495) O. Kirmemis Alkan, P. Karagoz, CRoM and HuspExt: Improving Efficiency of High Utility Sequential Pattern Extraction, IEEE Transactions on Knowledge and Data Engineering, 2015 (10.1109/TKDE.2015.2420557) M.Ozkan, P. Karagoz, A Novel Wind Power Forecast Model: Statistical Hybrid Wind Power Forecast Technique (SHWIP), IEEE Transactions on Industrial Informatics, volume:11, issue: 2, pp375-387, 2015 (DOI: 10.1109/TII.2015.2396011) (received 2016 Best Paper Award for the IEEE Transactions on Industrial Informatics) G. Vural, B. B. Cambazoglu, P. Karagoz , Sentiment-Focused Web Crawling. TWEB 8(4): 22 (2014) M. Sattari, I. H. Toroslu, P. Karagoz, P. Symeonidis, Y. Manolopoulos, \"Extended feature Combination Model for Recommendations in Location-based Mobile Services\", Knowledge and Information Systems, Volume 44, Issue 3, pp. 629-661, September 2015 (DOI: 10.1007/s10115-014-0776-5) A. Mutlu, P. Senkul , \"Improving Hit Ratio of ILP-based Concept Discovery System with Memoization\", The Computer Journal, vol. 57, No: 1, pp. 138-153, 2014. (doi:10.1093/comjnl/bxs163). A. Mutlu, P. Senkul , Y. Kavurucu, \"Improving the Scalability of ILP-based Multi-Relational Concept Discovery System through Parallelization\", Knowledge-Based Systems, volume:27, 352-368pp, 2012 (DOI: 10.1016/j.knosys.2011.11.001). Y. Kavurucu, P. Senkul , I. H. Toroslu, \"A Comparative Study on ILP-based Concept Discovery Systems\", Expert Systems with Applications, vol:38, issue:9, pp11598-11607, 2011. (DOI: 10.1016/j.eswa.2011.03.038) P. Senkul , S. Salin, \"Improving Pattern Quality in Web Usage Mining by Using Semantic Information\", Knowledge and Information Systems, vol:30, 527-541pp., 2012 (DOI: 10.1007/s10115-011-0386-4). D. Canturk, P. Senkul , \"Using Semantic Information for Distributed Web Service Discovery\", International Journal of Web Science, vol 1, Nos:1/2, 21-35pp, 2011 . Y. Kavurucu, P. Senkul , I.H. Toroslu, \"Concept Discovery on Relational Databases: New Techniques for Search Space Pruning and Rule Quality Improvement\", Knowledge-Based Systems, vol:23, issue:8, 743-756pp, December 2010.(doi:10.1016/j.knosys.2010.04.011.) L. A. Guner, N. I. Karabacak, O. U. Akdemir, P. Senkul Karagoz, S. A. Kocaman, A. Cengel, M. Unlu, \"An open-source framework of neural networks for diagnosis of coronary artery disease from myocardial perfusion SPECT\", Journal of Nuclear Cardiology, vol: 17, issue: 3, 405-413pp, June 2010, doi:10.1007/s12350-010-9207-5. Y. Kavurucu, P. Senkul , I. H. Toroslu, ILP-based Concept Discovery in Multi-Relational Data Mining, Expert Systems With Applications, vol: 36, issue: 9, Pages 11418-11428, November 2009, doi: 10.1016/j.eswa.2009.02.100 E. Karakoc, P. Senkul , Composing Semantic Web Services Under Constraints, Expert Systems With Applications, Volume 36, Issue 8, October 2009, Pages 11021-11029, doi: 10.1016/j.eswa.2009.02.098. N. K. Cicekli, A. Cosar, A. Dogac, F. Polat, P. Senkul , I. H. Toroslu, A. Yazici, Data management research at the Middle East Technical University, SIGMOD RECORD 34 (3): 81-84 SEP 2005. P. Senkul, I. H. Toroslu, An Architecture for Workflow Scheduling Under Resource Allocation Constraints, Information Systems, vol 300 issue 5, pp. 399-422, July 2005. Books J. Joshua Thomas, P. Karagoz, B. Ahamed, P. Vasant (edt), Deep Learning Techniques and Optimization Strategies in Big Data Analytics, IGI Global, 2020. Book Chapters R. Aktunc, I. H. Toroslu, P. Karagoz, Event Detection on Communities: Tracking the Change in Community Structure within Temporal Communication Networks. In Putting Social Media and Networking Data in Practice for Education, Planning, Prediction and Recommendation, pp75-96, Springer, 2020 (https://doi.org/10.1007/978-3-030-33698-1) B. Yilmaz, H. Genc, M. Agriman, B. K. Demirdover, M. Erdemir, G. Simsek, P. Karagoz, Recent Trends in the Use of Graph Neural Network Models for NatÄ±ral Language Processing. In Deep Learning Tech",
  "content_length": 42301,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:41"
}