{
  "name": "Ping Hu 0001",
  "homepage": "https://feinanshan.github.io",
  "status": "success",
  "content": "Ping Hu Hu, Ping Home Publications Team Project Ping Hu Professor Center for Future Media School of Computer Science and Engineering University of Electronic Science and Technology of China No. 2006, Xiyuan Ave, West Hi-Tech Zone, Chengdu, Sichuan, P.R. China 611731 Email: chinahuping[AT]gmail.com Biography [中文版] Ping Hu is a faculty member with the School of Computer Science and Engineering, UESTC. He obtained his Ph.D. degree in the Image and Video Computing (IVC) Group at Boston University in 2023, advised by Prof. Kate Saenko and Prof. Stan Sclaroff . Before that, he was a research assistant at Nanyang Technological University, advised by Dr. Gang Wang and Prof. Yap-Peng Tan. He obtained his M.E degree from the University of Chinese Academy of Science under the supervision of Prof. Weiqiang Wang. Ping's primary research focuses on the open-world scene understanding and multi-modal learning. 👏👏👏 We are looking for self-motivated interns, research assistants, and graduate (Master/Ph.D.) students. If you are interested, please email with your resume. [More Details] News 11-2025: Serving as Publicity Chairs for BMVC 2026. 11-2025: Serving as an Area Chair for CVPR/ICLR/ICML/ICASSP 2026. 07-2025: Visiting School of EEE at Nanyang Technological University. 07-2025: Survey on efficient variants of SAM[Arxiv] is accepted to IJCV. 02-2025: Serving as an Area Chair for NeurIPS 2025. 01-2025: Serving as an Area Chair for ACM-MM 2025. 12-2024: Serving as an Area Chair for ICML 2025. 12-2024: Serving as an Area Chair for IJCAI-25. 10-2024: Check our survey on efficient variants of SAM[Arxiv]. 10-2024: Serving as an Associate Editor for Pattern Recognition (PR). 09-2024: Serving as an Area Chair for CVPR 2025. 08-2024: Serving as an Associate Editor for ACM Computing Surveys (IF 23.8). 05-2024: Serving as an Area Chair for NeurIPS 2024. 02-2024: We are organizing The 2nd Multi-Modal Video Reasoning and Analyzing Competition and Vision and Learning for an Enhanced Metaverse Workshop at ICME24. 01-2024: Serving as an Area Chair for ACM-MM 2024. 01-2024: Joining the UESTC as a faculty member at the School of Computer Science and Engineering. 12-2023: Serving as a Senior Program Committee (SPC) member for IJCAI-24. 08-2023: Serving as an Area Chair for CVPR 2024 05-2023: Serving as Assistant Program Chair for NeurIPS 2023. 04-2023: Serving as a DEI committee member for CVPR 2023 01-2023: We are organizing Efficient Deep Learning for Computer Vision Workshop at CVPR23 12-2022: Serving as a Senior Program Committee (SPC) member for IJCAI-23. Research My primary research interests are centered on intelligent visual computing. Services Workshop Organizers: IEEE ICME Grand Challenge – 2nd Multi-Modal Video Reasoning and Analyzing Competition 2024. IEEE Low Power Computer Vision Challenges 2023. Efficient Deep Learning for Computer Vision Workshop at CVPR23. Visual Domain Adaptation Challenge at ICCV2019. Academic Service: Associate Editor, Pattern Recognition (PR), 2024-Present. Associate Editor, ACM Computing Surveys (CSUR), 2024-Present. Area Chair, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024, 2025，2026. Area Chair, International Conference on Neural Information Processing Systems (NeurIPS), 2024, 2025. Area Chair, International Conference on Machine Learning (ICML), 2025, 2026. Area Chair, International Conference on Learning Representations (ICLR), 2026. Area Chair, ACM Multimedia (ACM-MM), 2024, 2025. Area Chair, International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2026. Area Chair, International Joint Conference on Artificial Intelligence (IJCAI), 2025. Area Chair, IEEE Conference on Artificial Intelligence (CAI), 2024. Senior PC, International Joint Conference on Artificial Intelligence (IJCAI), 2023, 2024. Senior PC, AAAI Conference on Artificial Intelligence (AAAI), 2026. Publicity Chairs, British Machine Vision Conference (BMVC), 2026. Assistant Program Chair, International Conference on Neural Information Processing Systems (NeurIPS), 2023. Session Chair, International Conference on Robotics and Automation (ICRA), 2020. Outstanding Reviewer, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2021. Conference Reviewer: CVPR, ICCV, ECCV, ICLR, NeurIPS, ICML, etc. Journal Reviewer: IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) International Journal of Computer Vision (IJCV) IEEE Transactions on Image Processing (T-IP) Pattern Recognition (PR) ISPRS Journal of Photogrammetry and Remote Sensing (ISPRS-JPRS) IEEE Transactions on Multimedia (T-MM) IEEE Robotics and Automation Letters (RA-L) Computer Vision and Image Understanding (CVIU) IEEE Transactions on Circuits and Systems for Video Technology (T-CSVT) IEEE Transactions on Computational Imaging (T-CI) Teaching Spring 2025, Machine Learning, UESTC © 2023 Ping Hu. Part of page is generated by jemdoc.",
  "content_length": 4924,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:42"
}