{
  "name": "Pingqiang Zhou",
  "homepage": "http://faculty.sist.shanghaitech.edu.cn/faculty/zhoupq",
  "status": "success",
  "content": "The CAD Group st ShanghaiTechU/People/Faculty Home People Faculty Members Visitor Archive Openings Projects Current projects Project archive Publications Album Academic Leisure Links Collaborators Academic Links Publications Prof. Zhou's  Google Scholar profile page is here. Please be aware that although PDF files are provided as a courtesy for the publications listed below, many of them are copyrighted by the corresponding publishers. Book Chapter Pingqiang Zhou and Sachin S. Sapatnekar, \"3D Placement and Routing,\" in Physical Design for 3D Integrated Circuits, CRC press, December 2015. (Invited) Pulkit Jain, Pingqiang Zhou, Chris H. Kim, and Sachin S. Sapatnekar, \"Thermal and Power Delivery Challenges in 3D ICs,\" in Three-Dimensional Integrated Circuit Design: EDA, Design and Microarchitectures, Springer, Boston, MA, 2010. Journal Supervised students are denoted with a '*'. [Access] Leilei Wang*, Lu Wang*, Cheng Zhuo and Pingqiang Zhou, \"Early-Stage Planning of Switched-Capacitor Converters in a Heterogeneous Chip,\" IEEE Access. Vol. 8, pp. 85900-85911, 2020. [TOADES] Yajun Yang*, Zhang Chen*, Yuan Liu*, Tsung-Yi Ho, Yier Jin and Pingqiang Zhou, \"How Secure is Split Manufacturing in Preventing Hardware Trojan?,\" ACM Transactions on Design Automation of Electronic Systems. Vol. 25, No. 2, pp. 1-23, 2020. [TCAD] Yaguang Li*, Cheng Zhuo and Pingqiang Zhou, \"A Cross-Layer Framework for Temporal Power and Supply Noise Prediction,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, Vol. 30, No. 10, pp. 1914-1927, 2019. [Access] Wei Gao* and Pingqiang Zhou, \"Customized high performance and energy-efficient communication networks for AI chips,\" IEEE Access, Vol. 7, pp. 69434-69446, May 2019. [Integration] Wei Gao*, Zhiliang Qian and Pingqiang Zhou, \"Reliability- and Performance-Driven Mapping for Regular 3D NoCs Using A Novel Latency Model and Simulated Allocation,\" Integration, the VLSI Journal, Vol. 65, pp. 351-361, March 2019. [Integration] Xiangwei Cai*, Jieming Yin and Pingqiang Zhou, \"An Orchestrated NoC Prioritization Mechanism for Heterogeneous CPU-GPU Systems,\"  Integration, the VLSI Journal, Vol. 65, pp. 344-350, March 2019. [Integration] Leilei Wang*, Cheng Zhuo and Pingqiang Zhou, \"Run-time Demand Estimation and Modulation of On-Chip Decaps at System Level for Leakage Power Reduction in Multicore Chips,\"  Integration, the VLSI Journal, Vol. 65, pp. 322-330, 2019. [TCPS] Yang Liu, Xiaoming Chen, Dileep Kadambi, Ajinkya Bari, Xin Li, Shiyan Hu and Pingqiang Zhou, \"Dependable Visual Light-Based Indoor Localization with Automatic Anomaly Detection for Location-Based Service of Mobile Cyber-Physical Systems,\" ACM Transactions on. Cyber-Physical Systems, Vol. 3, No. 1, pp. 1-17, Sept. 2018. [TCAD] Xiaochen Liu*, Shupeng Sun, Xin Li, Haifeng Qian and Pingqiang Zhou, \"Machine Learning for Noise Sensor Placement and Full-Chip Voltage Emergency Detection,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, pp.421-434, September 2016. [TVLSI] Pingqiang Zhou, Ayan Paul, Chris H. Kim, and Sachin S. Sapatnekar, \"Distributed On-Chip Switched-Capacitor DC-DC Converters Supporting DVFS in Multicore Systems,\" IEEE Transactions on Very Large Scale Integration Systems (TVLSI), Vol. 22, No. 9, pp.1954-1967, September 2014. -------------------------------------------------------------------------------------------------------------------------------------------- [TOADES] Pingqiang Zhou, Ping-Hung Yuh, and Sachin S. Sapatnekar, âOptimized 3D Network-on-Chip Design Using Simulated Allocation,â ACM Transactions on Design Automation of Electronic Systems, Vol.17, No.2, pp.1-19, 2012. [JCSC] Yuchun Ma, Qiang Zhou, Pingqiang Zhou, and Xianlong Hong, âThermal Impacts of Leakage Power in 2D/3D Floorplanning,â Journal of Circuits, Systems, and Computers, Vol.19, No.7, pp.1483-1495, 2010. [D&T] Pingqiang Zhou, Karthikk Sridharan, and Sachin S. Sapatnekar, âPower Grid Optimization in 3D Circuits Using MIM and CMOS Decoupling Capacitors,â IEEE Design & Test,  Vol.26, No.5, pp.15-25, 2009. Conference/Workshop Supervised students are denoted with a '*'. [GLSVLSI] Yu Ma*, Linfeng Zheng* and Pingqiang Zhou, \"Tolerating Stuck-at Fault and Variation in Resistive Edge Inference Engine via Weight Mapping,\" Proceedings of the 2021 ACM Great Lakes Symposium on VLSI, 2021. (to appear) [CSTIC] Jindong Zhou*, Youliang Jing and Pingqiang Zhou, \"The Study of TSV-Induced and Strained Silicon-Enhanced Stress in 3D-IC,\" Proceedings of the China Semiconductor Technology International Conference, 2021. [CSTIC] Linfeng Zheng* and Pingqiang Zhou, \"Optimizing the Energy Efficiency of Switched-Capacitor Converters in Multiprocessor System-on-Chips with a Preset DVFS Policy,\" Proceedings of the China Semiconductor Technology International Conference, 2021.(Best poster) [ASP-DAC] Chenguang Zhang* and Pingqiang Zhou, \"A Quantized Training Framework for Robust and Accurate ReRAM-based Neural Network Accelerators,\" Proceedings of the IEEE Asia and South Pacific Design Automation Conference, pp.43-48, 2021. [ASP-DAC] Yu Ma* and Pingqiang Zhou, \"Efficient Techniques for Training the Memristor-based Spiking Neural Networks Targeting Better Speed, Energy and Lifetime,\" Proceedings of the IEEE Asia and South Pacific Design Automation Conference, pp.390-395, 2021. [AsianHOST] Yuan Liu* and Pingqiang Zhou, \"Defending Against Adversarial Attacks in Deep Learning with Robust Auxiliary Classifiers Utilizing Bit Plane Slicing,\" Proceedings of the IEEE Asian Hardware Oriented Security and Trust Symposium, pp.1-4, 2020. [ICSICT] Linfeng Zheng*, Hui Zhao* and Pingqiang Zhou, \"An Input-Sensitive Dynamic Power Modeling Methodology for AI Chips in Black-Box Form,\" Proceedings of the IEEE International Conference on Solid-State and Integrated Circuit Technology, 2020.(Invited) [ICSICT] Yuanchen Qu* and Pingqiang Zhou, \"An Improved Design of Hybrid Integrated Voltage Regulator Based on DLDO and SCVR,\" Proceedings of the IEEE International Conference on Solid-State and Integrated Circuit Technology, pp.1-3, 2020. [ICSICT] Chengrui Zhang* and Pingqiang Zhou, \"Improved Hierarchical IR Drop Analysis in Homogeneous Circuits,\" Proceedings of the IEEE International Conference on Solid-State and Integrated Circuit Technology, pp.1-3, 2020. [ASICON] Yu Ma*, Dingcheng Jia*, Wei Gao* and Pingqiang Zhou, \"Addressing Aging Issues in Heterogeneous Three-Dimensional Integrated Circuits,\"  Proceedings of the IEEE International Conference on ASIC, pp.1-4, 2019. (Invited) [ASICON] Yu Ma*, Linfeng Zheng* and Pingqiang Zhou, \"CoDRAM: A Novel Near Memory Computing Framework with Computational DRAM,\"  Proceedings of the IEEE International Conference on ASIC, pp.1-4, 2019. [ASICON] Yu Ma*, Dingcheng Jia*, Huifan Zhang*, Ruoyu Wang* and Pingqiang Zhou, \"A Compact Memory Structure based on 2T1R against Single-Event Upset in RRAM Arrays,\" Proceedings of the IEEE International Conference on ASIC, pp.1-4,2019. [DATE] Lu Wang*, Leilei Wang*, Dejia Shang*, Cheng Zhuo and Pingqiang Zhou, \"Optimization of switched-capacitor DC-DC converters in heterogeneous multicore systems.\" The Design, Automation, and Test in Europe Conference, 2019. (Acceptance rate: 24%, long presentation) [CSTIC] Dingcheng Jia* and Pingqiang Zhou, \"Effective activating compensation logic for DRAMs in 3D-ICs,\" in China Semiconductor Technology International Conference, pp. 1-3, 2019. [ICSICT] Rusong Weng*, Yaguang Li*, Wei Gao*, Leilei Wang*, Xufeng Kou, and Pingqiang Zhou, \"Deep learning for spatial supply noise estimation in a processor chip,\" In Proceedings of the IEEE International Conference on Solid-State and Integrated Circuit Technology, pp. 1-4, 2018. (Invited) [DAC] Yaguang Li*, Cheng Zhuo and Pingqiang Zhou, \"A System-Level Framework for Online Power and Supply Noise Prediction in Processor Chips,\"  ACM/EDAC/IEEE Design Automation Conference, 2018. (Poster session) [PLANS] Jiuxin Zhang* and Pingqiang Zhou, \"Integrating low-resolution surveillance camera with smartphone inertial sensors for indoor positioning,\" in Proceedings of the IEEE/ION Position Location and Navigation Symposium, pp. 410-416, 2018. [CSTIC] Leilei Wang* and Pingqiang Zhou, \"An improved leakage-driven runtime decap modulation algorithm for microprocessors,\" in China Semiconductor Technology International Conference, pp. 1-3, 2018. [AMS] Yaguang Li*, Cheng Zhuo and Pingqiang Zhou, \"A system level framework for online supply noise prediction,\" in International Workshop on Design Automation for Analog and Mixed-Signal Circuits, 2017. [ASICON] Yaguang Li*, Pingqiang Zhou, \"An Outlier Detection Method and its Application to Multicore-Chip Power Estimation,\" Proceedings of the IEEE International Conference on ASIC, pp. 460-463, 2017. (Invited) [AsianHOST] Zhang Chen*, Pingqiang Zhou, Tsung-Yi Ho and Yier Jin, \"How Secure is Split Manufacturing in Preventing Hardware Trojan?,\" in Proceedings of the IEEE Asian Hardware Oriented Security and Trust Symposium, pp. 1-6, 2016. [CAD/CG] Kai Liao* and Pingqiang Zhou, \"A Study about Task-Based DVFS Policy,\" in Proceedings of the IEEE International Conference on Computer-Aided Design and Computer Graphics, 2016. [ICSICT] Pingqiang Zhou, \"Design and CAD of Noise Sensors for On-Die Supply Voltage Emergency Detection,\" Proceedings of the IEEE International Conference on Solid-State and Integrated Circuit Technology, pp. 593-596, 2016.  (Invited) [CSTIC] Leilei Wang* and Pingqiang Zhou, \"Leakage Power Reduction in Multicore Chips via Online Decap Modulation,\" in China Semiconductor Technology International Conference, pp. 1-3, 2016. (Best Student Paper Nomination) [DAC] Xiaochen Liu*, Shupeng Sun, Pingqiang Zhou, Xin Li and Haifeng Qian, \"A Statistical Methodology for Noise Sensor Placement and Full-Chip Voltage Map Generation,\" Proceedings of the ACM/EDAC/IEEE Design Automation Conference, pp. 1-6, 2015. [ICSICT] Pingqiang Zhou, \"Design and Optimization of On-Chip Vo",
  "content_length": 13739,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:42"
}