{
  "name": "Ping Wang 0024",
  "homepage": "https://leafnlp.org/ping",
  "status": "success",
  "content": "Leaflab Ping Wang Assistant Professor Department of Computer Science Stevens Institute of Technology Email: ping.wang [at] stevens [dot] edu Google Scholar Github Linkedin About me Ping Wang is an Assistant Professor in the Department of Computer Science at Stevens Institute of Technology and an affiliated member of The Stevens Institute for Artificial Intelligence (SIAI). She received her Ph.D. from Virginia Tech under the supervision of Dr. Chandan K. Reddy in 2021. Her research interests are in the broad area of data mining and machine learning with particular focus on healthcare analytics, including clinical question answering, information extraction, graph mining, and survival analysis. She has published papers in leading conferences (e.g., WWW, CIKM, and AAAI) and high impact journals (e.g., ACM Computing Surveys and IEEE TKDE). She received the NSF CRII award in 2023 to explore the reasoning augmented searching on NoSQL databases. She was recognized as the “Research PhD Student of the Year” (one per year) in the Department of Computer Science at Virginia Tech in 2021. Selected Publications Text-to-ESQ: A Two-Stage Controllable Approach for Efficient Retrieval of Vaccine Adverse Events from NoSQL Database (ACM BCB 2023) Event Detection Explorer: An Interactive Tool for Event Detection Exploration (ACM IUI 2023) Attention-based Aspect Reasoning for Knowledge Base Question Answering on Clinical Notes (ACM BCB 2022) Self-Supervised Learning of Contextual Embeddings for Link Prediction in Heterogeneous Networks (WWW 2021) A Simple and Effective Self-Supervised Contrastive Learning Framework for Aspect Detection (AAAI 2021) Text-to-SQL Generation for Question Answering on Electronic Medical Records (WWW 2021) Recent Presentations Event Detection Explorer: An Interactive Tool for Event Detection Exploration Poster, ACM IUI 2023, March 2023. Automatic Question Answering on Electronic Health Records Invited talk in CS 101 Research and Entrepreneurship in Computing Department of Computer Science, Stevens Institute of Technology, November 2022. Attention-based Aspect Reasoning for Knowledge Base Question Answering on Clinical Notes Talk, ACM BCB, August 2022. Automatic Information Retrieval and Extraction on Electronic Health Records Invited talk. Department of Computer Science The University of Massachusetts Lowell, April 2022. Text-to-SQL Generation for Question Answering on Tables Invited talk. Department of Computer Science The University of Hong Kong, October 2021. Automatic Question Answering on Electronic Health Records Invited talk. The Department of Electrical and Computer Engineering (ECE) Stevens Institute of Technology, October 2021. Automatic Question Answering and Knowledge Discovery on Electronic Health Records Job talk. The Department of Computer Science Stevens Institute of Technology, March 2021. Self-Supervised Learning of Contextual Embeddings for Link Prediction in Heterogeneous Networks Talk, WWW 2021, April 2021. Slides Video Text-to-SQL Generation for Question Answering on Electronic Medical Records Talk, WWW 2020, April 2020. Slides Video Professional Services Program committee: AAAI 2021-2023, ACL 2020-2021, 2023, EMNLP 2020-2023, COLING 2020, 2022, AMIA 2017-2023. Reviewer for journals: ACM Computing Surveys (CSUR) ACM Transactions on Knowledge Discovery from Data (TKDD) ACM Transactions on Computing for Healthcare (HEALTH) IEEE Transactions on Knowledge and Data Engineering (TKDE) EEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) Journal of Machine Learning Research (JMLR) Other services: NSF panel: 2021-2023 Graduate academic advisor for master students: 2021-present Student volunteer: EMNLP 2020, WiML@NeurIPS 2020 Poster mentor: WiML@NeurIPS 2020",
  "content_length": 3760,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:43"
}