{
  "name": "Piotr Wieczorek",
  "homepage": "http://www.ii.uni.wroc.pl/~piotrek",
  "status": "success",
  "content": "Piotr Wieczorek @ II UWrSearch this siteEmbedded FilesSkip to main contentSkip to navigationPiotr Wieczorek  Contact:Institute of Computer ScienceUniversity of Wroclawul. Joliot-Curie 15PL-50-383 WroclawOffice: 338piotrek [at] cs.uni.wroc.plPublicationsFull list on DBLPDownloadable versions:J. Michaliszyn, J. Otop, P. Wieczorek Reachability and Bounded Emptiness Problems of Constraint Automata with Prefix, Suffix and Infix. CONCUR 2023 B. Groz, A. Lemay, S. Staworko, P. Wieczorek Inference of Shape Graphs for Graph Databases. ICDT 2022J. Michaliszyn, J. Otop, P. Wieczorek Modular Path Queries with Arithmetic, Logical Methods in Computer Science, Volume 17, Issue 3, 2021S. Staworko, P. Wieczorek, Containment of Shape Expression Schemas for RDF, PODS 2019.J. Michaliszyn, J. Otop, P. Wieczorek Querying Best Paths in Graph Databases. 37th IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science (FSTTCS), 2017. full versionM. Graboń, J. Michaliszyn, J.Otop, P. Wieczorek Querying Data Graphs with Arithmetical Regular Expressions, International Joint Conference on Artificial Intelligence (IJCAI), 2016 S. Staworko, P. Wieczorek Characterizing XML Twig Queries with Examples, International Conference on Database Theory (ICDT), March 2015, Brussels (preliminary version: pdf) S. Staworko, P. Wieczorek Learning Twig and Path Queries, International Conference on Database Theory (ICDT), March 2012, Berlin, Germany (pdf) Jerzy Marcinkowski, Piotr Wieczorek. Modulo Constraints and the Complexity of Typechecking XML Views. Theory of Computing Systems Volume 44, Number 4 / May 2009 (preliminary version: pdf) Piotr Wieczorek. Complexity of Typechecking XML Views of Relational Databases. International Conference on Database Theory (ICDT 2007), Springer, LNCS 4353, Best Newcomer Award (pdf)Report abusePage detailsPage updated Report abuse",
  "content_length": 1886,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:50"
}