{
  "name": "Piotr Didyk",
  "homepage": "https://www.pdf.inf.usi.ch/people/piotr",
  "status": "success",
  "content": "Perception, Display, and Fabrication Group The Perception, Display, and Fabrication Group Home Team Publications Open positions Teaching Contact Piotr Didyk Associate Professor Faculty of Informatics Università della Svizzera italiana (USI) East Campus, Sector D, Office D4.12 (Level P4) Via la Santa 1 6962 Lugano-Viganello, Switzerland Email address: Phone: +41 58 666 4939 About me: I am an Associate Professor at Università della Svizzera italiana (USI) in Switzerland where I am heading a group on Perception, Display, and Fabrication. I am also a co-director of the Master's Program in Artificial Intelligence at USI. In my research, I combine perception, computation, and hardware to create better display and fabrication techniques. More specifically, my interests include human perception, new display technologies, image/video processing, 3D printing, and computational fabrication. Before my current position, I was an Independent Research Group Leader at Saarland University, MMCI and Max Planck Institute for Informatics in Germany. I have also spent two years as a postdoc with Prof. Wojciech Matusik at MIT. I obtained my Ph.D. from Saarland University and Max Planck Institute under Prof. Karol Myszkowski and M.Sc. degree from University of Wrocław in Poland. In 2018, I was awarded an ERC Starting Grant, and in 2019, I was elected Junior Fellow of the European Association for Computer Graphics. I usually spend my free time with my family as well as enjoy various outdoor activities such as mountain biking, hiking, running, skiing, and mountaineering. I also love taking photographs although for this I have recently slightly less time. Professional activities: Editorial Boards and Steering Committees: 2024 - present: Steering Committee Member of ACM Symposium on Computational Fabrication 2021 - present: Associate Editor of ACM Transactions on Graphics 2021 - present: Associate Editor of ACM Transactions on Applied Perception Organizing Committees: 2025: Paper Co-Chair of Computational Visual Media Conference 2024: General Co-Chair of ACM Symposium on Computational Fabrication International Program Committees: 2025: Eurographics (Full Papers) 2023: ACM SIGGRAPH (Technical Papers), Eurographics (Full Papers) 2022: Eurographics (Full Papers), Eurographics (State of the Art Reports), Eurographics Symposium on Rendering Techniques (Research Track),High Performance Graphics (Papers), Pacific Graphics (Full/Short Technical Papers), ACM Siggraph Asia (COI Coordinator) 2021: Eurographics (Full Papers), Eurographics Symposium on Rendering Techniques (Research Track),High Performance Graphics (Papers), ACM Symposium on Applied Perception 2020: ACM SIGGRAPH (Technical Papers), Eurographics (Full Papers), High Performance Graphics (Papers) 2019: ACM SIGGRAPH (Technical Papers), Eurographics (Full Papers), Pacific Graphics (Full/Short Technical Papers) 2018: ACM SIGGRAPH Asia (Technical Papers), Eurographics (Full Papers), Pacific Graphics (Full/Short Technical Papers) 2017: ACM SIGGRAPH Asia (Technical Briefs & Posters), High Performance Graphics (Papers), Eurographics (State-of-the-Art Reports), CAD/Graphics (Full Papers) 2016: ACM SIGGRAPH (Technical Papers), International Workshop on Egocentric Perception, Interaction and Computing 2015: ACM SIGGRAPH (Technical Papers), Eurographics (Short Papers), CAD/Graphics (Full Papers) 2014: Eurographics (Short Papers) Other Committees: 2023: ACM SIGGRAPH Best Paper Award 2018: Eurographics Günter Enderle Best Paper Award 2014: ACM SIGGRAPH Asia, E-Tech Prize Teaching: WS 2023/2024: Computer Graphics SS 2023: Image and Video Processing Computational Fabrication WS 2022/2023: Computer Graphics (rendering competition) SS 2022: Computational Fabrication WS 2021/2022: Computer Graphics WS 2020/2021: Computer Graphics SS 2020: Computational Fabrication WS 2019/2020: Computer Graphics (co-lecturer: Kai Hormann) WS 2018/2019: Computer Graphics (co-lecturer: Kai Hormann) WS 2017/2018: Perception for Computer Graphics (co-lecturer: Karol Myszkowski) SS 2017: Computational Fabrication WS 2016/2017: Perception for Computer Graphics (co-lecturer: Karol Myszkowski) SS 2016: Computational Fabrication WS 2015/2016: Perception for Computer Graphics (co-lecturer: Karol Myszkowski) SS 2015: Seminar on Computational Display and Fabrication (co-lecturer: Karol Myszkowski) WS 2014/2015: Perception for Computer Graphics (co-lecturer: Karol Myszkowski & Tobias Ritschel)",
  "content_length": 4453,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:46"
}