{
  "name": "Piyush Srivastava 0001",
  "homepage": "http://www.tifr.res.in/~piyush.srivastava",
  "status": "success",
  "content": "Piyush Srivastava - Home Home Research Teaching Contact पीयूष श्रीवास्तव Piyush Srivastava I work at the School of Technology and Computer Science at the Tata Institute of Fundamental Research. I am broadly interested in applications of probabilistic ideas in computer science. Before coming to TIFR, I studied at IIT Kanpur and UC Berkeley and was a post-doctoral scholar at Caltech. This semester, I am teaching a first year graduate course on mathematical foundations for learning, information, and decision sciences. Papers Click here for a list categorized by subjects. [Preprint] The rate-immediacy barrier in explicit tree code constructions.  with Gil Cohen and Leonard J. Schulman. [arXiv]. [ECCC]. [Preprint] Deterministically approximating the volume of a Kostka polytope.  with Hariharan Narayanan. [arXiv]. Approximating the total variation distance between Gaussians.  with Arnab Bhattacharya and Weiming Feng, in proceedings of AISTATS 2025. [arXiv]. Nuclear correlation functions using first-principle calculations of lattice quantum chromodynamics.  with Debsubhra Chakraborty (first author), Arpith Kumar, and Nilmani Mathur. [arXiv].  Physical Review D, 110, pp. 114505. December 2024. A direct proof of a unified law of robustness for Bregman divergence losses.  with Santanu Das (first author) and Jatin Batra. [arXiv].  IEEE Trans. Inf. Theory, early access version. May 2025. Sampling from convex sets with a cold start using multiscale decompositions.  with Hariharan Narayanan and Amit Rajaraman, extended abstract in proceedings of STOC 2023. [arXiv].  Probability Theory & Related Fields, 191, pp. 1169–1232, 2025. Published online in December 2024. On complex roots of the independence polynomial.  with Ferenc Bencs, Péter Csikvári, and Jan Vondrák, in proceedings of SODA 2023. [arXiv]. Universal lower bound for learning causal DAGs with atomic interventions.  with Vibhor Porwal (first author) and Gaurav Sinha, extended abstract in proceedings of AISTATS 2022 (oral presentation section). [arXiv]. Extended version (May 2022) of AISTATS 2022 paper which appeared in the proceedings under the title “Almost universal lower bound for learning causal DAGs with atomic interventions”. On the mixing time of coordinate Hit-and-Run.  with Hariharan Narayanan. [arXiv].  Combinatorics, Probability and Computing, 31(2), pp. 320–332, March 2022. Published online in August 2021. Condition number bounds for causal inference.  with Spencer Gordon, Vinayak Kumar, and Leonard J. Schulman, in proceedings of UAI 2021. Correlation decay and partition function zeros: Algorithms and phase transitions.  with Jingcheng Liu and Alistair Sinclair, extended abstract in proceedings of FOCS 2019. [arXiv].  SIAM J. Comput. (FOCS 2019 special issue). Online codes for analong signals.  with Leonard J. Schulman. [arXiv].  IEEE Trans. Inf. Theory, 65 (10), pp. 6633–6649. May 2019. Fisher zeros and correlation decay in the Ising model.  with Jingcheng Liu and Alistair Sinclair, extended abstract in proceedings of ITCS 2019. [arXiv].  J. Math. Phys., 20 (103304), 2019. Computing the independence polynomial: from the tree threshold down to the roots.  with Nicholas J. A. Harvey and Jan Vondrák, extended abstract in proceedings of SODA 2018. [arXiv]. Exact recovery in the Ising blockmodel.  with Quentin Berthet and Philippe Rigollet. [arXiv].  Ann. Stat. 47 (4), pp. 1805–1834. May 2019. The Ising Partition Function: Zeros and Deterministic Approximation.  with Jingcheng Liu and Alistair Sinclair, extended abstract in proceedings of FOCS 2017. [arXiv].  Journal of Statistical Physics. Online December 2018. Stability of causal inference. [Conference version] (Erratum for conference version).  with Leonard J. Schulman, extended abstract in proceedings of UAI 2016. Evolutionary dynamics in finite populations mix rapidly.  with Ioannis Panageas and Nisheeth K. Vishnoi, extended abstract in proceedings of SODA 2016. [Preprint]. Symbolic integration and the complexity of computing averages.  with Leonard J. Schulman and Alistair Sinclair, extended abstract in proceedings of FOCS 2015. [Preprint]. Spatial mixing and the connective constant: Optimal bounds.  with Alistair Sinclair, Daniel Štefankovič and Yitong Yin, extended abstract in proceedings of SODA 2015. [arXiv].  Probability Theory & Related Fields. Online July 2016. Spatial mixing and approximation algorithms for graphs with bounded connective constant.  with Alistair Sinclair and Yitong Yin, extended abstract in proceedings of FOCS 2013. [arXiv]. Lee-Yang theorems and the complexity of computing averages.  with Alistair Sinclair, extended abstract in proceedings of STOC 2013. [arXiv].  Comm. Math. Phys. 329 (3), pp. 827–858. August 2014. A finite population model of molecular evolution.  with Narendra M. Dixit and Nisheeth K. Vishnoi.  J. Comp. Biol. 19 (10), pp. 1176–1202. October 2012. Approximation algorithms for two-state anti-ferromagnetic spin systems.  with Alistair Sinclair and Marc Thurley, extended abstract in proceedings of SODA 2012. [arXiv].  J. Stat. Phys. 155 (4), pp. 666–686. March 2014. Service Conference program committees: [RANDOM 2024] [ITCS 2024] [FOCS 2021] [ITCS 2020] [FSTTCS 2018] Acknowledgments Site generated by Hakyll",
  "content_length": 5252,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:50"
}