{
  "name": "Piyush Rai",
  "homepage": "http://cse.iitk.ac.in/users/piyush",
  "status": "success",
  "content": "Piyush Rai: Home Piyush Rai Home Publication Teaching Students News Welcome I'm a professor in Computer Science & Engineering at Indian Institute of Technology, Kanpur. Before this (reverse chronologically), I was a research faculty in Electrical and Computer Engineering, at Duke University, a post-doctoral fellow in Statistics and Computer Science at UT Austin, and a Ph.D. student in School of Computing at University of Utah. I work in the area of machine learning and Bayesian statistics. My research is primarily on probabilistic/generative modeling and understanding of massive and complex data. My students and I focus on designing probabilistic generative models and efficient optimization/inference algorithms that can learn compact and interpretable latent structures and feature representations from such data, and leverage these to better understand/summarize the data, generate data with controllable properties, and make better predictions/decisions, especially in the face of data/model uncertainty. We also work on designing machine learning models and algorithms that can work well in resource-constrained settings (e.g., scarce training data or under limited compute/storage). Some Recent Courses (more) CS771A: Introduction to Machine Learning (2024), (2023), (2020), (2018) CS772A: Probabilistic Machine Learning (2025), (2024) CS698X: Topics in Probabilistic Modeling and Inference (2021), (2019) ESC101A: Fundamentals of Computing (2019) Some Recent Papers (full list and Scholar page) VERSE: Virtual-Gradient Aware Streaming Lifelong Learning with Anytime Inference With:Soumya Banerjee, Vinay Verma, Avideep Mukherjee, Deepak Gupta, and Vinay NamboodiriICRA 2024 RISSOLE: Parameter-efficient Diffusion Models via Block-wise Generation and Retrieval-Guidance With:Avideep Mukherjee, Soumya Banerjee, and Vinay NamboodiriBMVC 2024 A Probabilistic Framework for Lifelong Test-Time Adaptation With:Dhanajit BrahmaCVPR 2023 SITA: Single Image Test-time Adaptation With:Ansh Khurana, Sujoy Paul, Gaurav Aggarwal, and Soma BiswasCVPR 2023 workshop on Computer Vision in the Wild Federated Learning with Uncertainty via Distilled Predictive Distributions With:Shrey Bhatt and Aishwarya GuptaACML 2023 Gradient Perturbation-based Efficient Deep Ensembles With:Amit Chandak and Purushottam KarIKDD-CODS 2023 DiffuseVAE: Efficient, Controllable and High-fidelity Generation from Low-dimensional Latents With:Kushagra Pandey, Avideep Mukherjee, and Abhishek KumarTMLR 2022 Novel Class Discovery without Forgetting With:K.J. Joseph, Sujoy Paul, Gaurav Aggarwal, Soma Biswas, Kai Han, Vineeth BalasubramanianECCV 2022 Rectification-based Knowledge Retention for Task Incremental Learning With:Pratik Mazumder, Pravendra, Singh, and Vinay P. NamboodiriIEEE TPAMI 2022 CAM-GAN: Continual Adaptation Modules for Generative Adversarial Networks With:Sakshi Varshney, Vinay Verma, Srijith P.K., and Lawrence CarinNeurIPS 2021 Bayesian Structural Adaptation for Continual Learning With: Abhishek Kumar and Sunabha ChatterjeeICML 2021 Recent Service (External) Area Chair: ICML (2025, 2024, 2023, 2020), NeurIPS (2024, 2023, 2022), ICLR (2025, 2024, 2023, 2022), AAAI (2020, 2019), IJCAI (2020), ACML (2022) Senior Area Chair: AAAI (2024, 2023, 2022, 2021) Editorial boards: TMLR, IEEE-TPAMI, ACM-ToPML Program Co-chair: Indian Workshop on Machine Learning (2018, 2016) Tutorial Co-chair: IKDD CODS-COMAD (2019) Recent news (more) (October 2021) Our work on fine-grained emotion prediction, led by BT-MT student Gargi Singh, is the recipient of the best student paper award at ACII 2021. Congratulations, Gargi! (July 2021) Our work on semi-supervised continual learning, led by Ph.D. student Dhanajit Brahma, is the recipient of the best student paper award at CSSL@IJCAI 2021. Congratulations, Dhanajit! (June 2020) My Ph.D. student Dhanajit Brahma is one of the winners of Qualcomm Innovation Fellowship 2020. Congratulations, Dhanajit! Contact Email: firstname AT cse DOT iitk DOT ac DOT in Office: RM-502, CSE Department, IIT Kanpur Phone: +91-512-259-6894 Design by Mark Reid, (Some rights reserved) Powered by Jekyll, Pandoc, MathJax &lt;div class=\"statcounter\"&gt;&lt;a title=\"web counter\" href=\"http://statcounter.com/\" target=\"_blank\"&gt;&lt;img class=\"statcounter\" src=\"http://c.statcounter.com/9865744/0/2ba529e5/1/\" alt=\"web counter\"&gt;&lt;/a&gt;&lt;/div&gt;",
  "content_length": 4377,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:50"
}