{
  "name": "Plamen P. Angelov",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/plamen-angelov",
  "status": "success",
  "content": "Plamen Angelov - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Plamen Angelov Professor Profile Prof. Angelov (PhD'93, DSc'15) holds a Chair in Intelligent Systems and leads AI group at the School of Computing and Communications. He also served as School's Director of Research (2020-2025) this year being on sabbatical. Prof. Angelov is founding Director of the Lancaster Intelligent, Robotic and Autonomous systems (LIRA) Centre which brings together 70+ academics/faculty across 15 Departments of the University. Prof. Angelov is a Fellow of the IEEE, of the IET, of ELLIS and of AAIA. He has over 400 publications in leading journals (like TPAMI, Information Fusion, IEEE Transactions on Cybernetics, on Fuzzy Systems, etc.), peer-reviewed conference proceedings (such as CVPR, ICLR, AAAI, ICCV, ECCV, IEEE), 3 granted US patents, 3 research monographs (by Wiley, 2012 and Springer, 2002 and 2018) cited over 18600 times with an h-index of 66. Prof. Angelov is ranked top 0.2% (731th out of 399064 researchers in AI worldwide in 2024 ) according to the “Top 2% Scientists” Stanford University’s list\" and has 12 highly cited papers; around half of his publications are in top 10% venues according to SciVal. He has an active research portfolio in the area of interpretable (explainable-by-design) deep learning and internationally recognised results into explainable deep learning, evolving systems for streaming data and computational intelligence. Prof. Angelov leads numerous projects funded by UK research councils, EC, European Space Agency, DSTL, GCHQ, Royal Society, Faraday Institute, industry. He is recipient of the Dennis Gabor award (2020) for \"outstanding contributions to engineering applications of neural networks\", IEEE awards ‘For outstanding Services’ (2013 and 2017) and other awards. He is Editor-in-Chief of Springer’s journal Evolving Systems (recipient of Editorial Excellence awards for 2020 and 2024)and Associate Editor of IEEE Transactions on Cybernetics, IEEE Transactions on AI , IEEE Transactions on Fuzzy Systems and other journals. He gave 40 keynote talks and was General co-Chair of a number of high profile IEEE conferences. He is founding Chair of the Technical Committee on Evolving Intelligent Systems, SMC Society of the IEEE and was previously chairing the Standards Committee of the Computational Intelligent Society of the IEEE (2010-2012) where he initiated and chaired the Work Group P2976 on the IEEE standard on explainable AI. He is the founding co-Director of one of the funded programmes by ELLIS (on Human-centred machine learning). He was also a member of International Program Committee of over 150 international conferences (primarily IEEE). More details can be found on his web page Show more… Current Research https://www.lancaster.ac.uk/scc/research/elsa/ https://www.lancaster.ac.uk/scc/research/ai4eo/ https://www.lancaster.ac.uk/scc/research/h-unique/ https://tas-security.lancs.ac.uk/ https://www.lancaster.ac.uk/scc/research/transparent-deep-learning-classifiers-of-driving-scenarios/ Show less Publications Projects Activities PhD Students Research Groups Using Raman spectroscopy to distinguish between different types of ivory at customs 01/09/2023 → 31/03/2025 Other Horizon Europe: European Lighthouse on Secure and Safe AI – ELSA 01/09/2022 → 31/08/2026 Research Towards explainable AI4EO: a new frontier to gain trust into the AI (XAI4EO) 01/04/2021 → 31/10/2024 Research Multiscale Modelling Extension (Y4-5) 01/03/2021 → 31/03/2023 Research TAS-S: Trustworthy Autonomous Systems Node in Security 01/11/2020 → 31/10/2024 Research H2020 : Foundations of Trustworthy AI - Integrating Reasoning, Learning and Optimization (TAILOR) 01/09/2020 → 31/08/2024 Research Pozibot: Quantum-secured remote monitoring and data logging technology that enables a dynamic insured warranty for battery packs 01/03/2019 → 31/05/2021 Research H-unique: In search of uniqueness - harnessing anatomical hand variation 01/01/2019 → 31/12/2024 Research H-unique: In search of uniqueness - harnessing anatomical hand variation 01/01/2019 → 31/12/2024 Research Transparent Deep Learning Classifier of Driving Scenarios able to Identify and Learn from Unseen Situations 01/10/2018 → 30/09/2021 Research Rutherford Fund Strategic Partner Grant 2018 01/04/2018 → 31/03/2019 Research Autonomous Remote Inspection and Repair in Hazardous Environments 02/01/2018 → 01/01/2020 Research Intelligent Computer Vision agents Optimising Safety and Train Dwell Times 01/05/2017 → 30/04/2018 Research Forex Trends Clustering Analysis using Machine Learning 01/04/2017 → 30/09/2017 Research Early Detection of Insider Threats by Autonomous Analysis of User Behaviour Evolution 21/07/2015 → 20/01/2019 Research IS 2015 - Robotics and autonomous systems 01/06/2015 → 31/12/2015 Research Institutional Sponsorship 2015 01/06/2015 → 31/03/2016 Research New Machine Learning Methods Paradigms to Address Big Data Streams 17/03/2015 → 16/03/2017 Other Novel Machine Learning Paradigms to address Big Data Streams 16/03/2015 → 15/06/2017 Research Early Detection of Insider Threats by Autonomous Analysis of User Behaviour Evolution 01/10/2014 → 31/03/2018 Other GAMMA: Global ATM Security Management 01/09/2013 → 30/11/2017 Research AURORA: Automated Real-time On-board video/data Analytics 01/06/2013 → 30/11/2014 Research CASE: Autonomous Object Detection & Tracking in Real Time 22/04/2013 → 21/10/2016 Research CASE: Autonomous Object Detection and Tracking in Real Time 22/04/2013 → 21/10/2016 Research Cordinated Airborne Studies in the Tropics (CAST) 01/02/2013 → 31/07/2016 Research Autonomous Object Detection and Tracking 01/01/2013 → 30/06/2016 Other GAMMA: Growing Autonomous System Mission Management Applications 01/10/2012 → 30/09/2015 Research Growing Autonomous Mission Management Systems 01/10/2012 → 30/09/2014 Other Development of methods, algorithms and software for autonomous novelty detection by moving camera 01/06/2012 → 31/07/2012 Research STAKE: real time spatio-temporal analysis and knowledge extraction through evolving clustering 14/03/2011 → 31/12/2013 Research FP7: SVETLANA 01/08/2010 → 31/12/2012 Research UAS Passive Sense, Detect and Avoid Algorithm Development 01/10/2009 → 31/12/2009 Other Assisted carriage proposal: Intelligent leader follower algorithms for ground platforms 01/09/2009 → 30/11/2009 Research 2006 International Workshop EFS 06 01/07/2006 → 30/09/2006 Other Collision Avoidance Algorithm Development 01/03/2006 → 28/02/2007 Other ASTRAEA T5 Adaptive Routing 02/01/2006 → 31/12/2008 Other ASTRAEA, Collision Avoidance 02/01/2006 → 31/12/2008 Other Better Clinical Decisions for Less Efforts 01/01/2006 → 30/06/2009 Other EvoMap: On-Chip Implementation of Intelligent Information Modelling 01/07/2004 → 30/06/2005 Other Application of Fuzzy Rule based Models in HVAC Systems Simulation 01/03/2000 → 31/08/2001 Other HVAC System Design Synthesis and Optimization 01/01/2000 → 31/12/2002 Other READ-IT: Tools for understanding and supporting children's reading development 01/01/1900 → … Research Springer (Publisher) Publication peer-review 2014 IEEE World Congress on Computational Intelligence, WCCI-2014 Participation in conference -Mixed Audience IEEE (Publisher) Publication peer-review IEEE Press (Publisher) Publication peer-review IEEE Press (Publisher) Publication peer-review IEEE Press (Publisher) Publication peer-review IEEE Press (Publisher) Publication peer-review Evolving Hierarchical Fuzzy Systems Types of External academic engagement - Hosting an academic visitor IEEE Computational Intelligence Society (External organisation) Membership of committee Applied Soft Computing Journal (Journal) Editorial activity 2013 IEEE International Conference on Cybernetics, CYBCO-2013 Participation in conference -Mixed Audience 2013 International Joint Conference on Neural Networks Participation in conference -Mixed Audience Autonomous Learning Machines: Evolving Neuro-Fuzzy Representation of the Dynamic Intelligence Invited talk IEEE Press (Publisher) Publication peer-review 2012 IEEE Conference on Evolving and Adaptive Intelligent Systems Participation in conference -Mixed Audience Self-evolving Gaussian processes Types of External academic engagement - Hosting an academic visitor IEEE Transactions on Fuzzy Systems (Journal) Editorial activity IEEE Transactions on Systems, Man and Cybernetics, Part B: Cybernetics (Journal) Editorial activity Soft Computing (Journal) Editorial activity Autonomous Learning - the true intelligence is evolving Invited talk Autonomous Learning Machines: Generating Rules from Data Streams Invited talk IEEE Press (Publisher) Publication peer-review 2011 IEEE Symposium Series on Computational Intelligence Participation in workshop, seminar, course Self-evolving fuzzy rule-based controllers Types of External academic engagement - Hosting an academic visitor Fuzzy Sets and Systems (Journal) Editorial activity IEEE (External organisation) Membership of committee Evolving Intelligent Systems: Methods and Applications Invited talk AISB (Publisher) Publication peer-review University Carlos III Madrid, Spain Visiting an external academic institution Journal of Automation, Mobile Robotics and Intelligent Systems (Journal) Editorial activity Open Journal on Cybernetics and Systemics (Journal) Editorial activity 2010 IEEE International Conference on Intelligent Systems Participation in conference -Mixed Audience UAV Passive Sense, Detect and Avoid Algorithm Development Consultancy Evolving Systems (Journal) Editorial activity IEEE Symposium Series on Computational Intelligence Participation in workshop, seminar, course Jose Iglesias Hosting a Student (PhD) 3rd International Workshop on Ge",
  "content_length": 13185,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:50"
}