{
  "name": "Polina Golland",
  "homepage": "https://www.csail.mit.edu/person/polina-golland",
  "status": "success",
  "content": "Polina Golland | MIT CSAIL Skip to main content PI Core/Dual Polina Golland Professor Email polina@csail.mit.edu Phone 253-8005 Room 32-D470 I am a professor in the EECS Department and a principal investigator in the Computer Science and Artificial Intelligence Laboratory (CSAIL) at MIT. My primary research interest is in developing novel techniques for biomedical image analysis and understanding. I particularly enjoy working on algorithms that either explore the geometry of the world and the imaging process in a new way or improve image-based inference through statistical modeling of the image data. I am interested in shape modeling and representation, predictive modeling and visualization of statistical models. My current research focuses on developing statistical analysis methods for characterization of biological processes based on image information. In this domain, I am interested in modeling biological shape and function, how they relate to each other and vary across individuals. Related Links Web page Last updated Feb 16 '22 Research Areas AI & ML Graphics & Vision Impact Areas Health Care Related Links Web page Projects Project Quantification of Pulmonary Edema in Chest Radiographs Medical Vision Group Vision Group We develop machine learning algorithms to automatically and quantitatively assess the severity of pulmonary edema from chest x-ray images. Polina Golland Leads Polina Golland Research Areas AI & ML Graphics & Vision Impact Areas Health Care Polina Golland Project Clinical Neuroimaging Group Vision Group We develop novel algorithms for neuroimage segmentation, registration, generative modeling, and joint modeling of brain structure with clinical and genetic data. Polina Golland Leads Polina Golland Research Areas AI & ML Graphics & Vision Impact Areas Health Care Polina Golland Project Cardiac MRI analysis We develop image analysis algorithms for whole-heart cardiac MRI in patients with severe congenital heart disease. Polina Golland Leads Polina Golland Research Areas AI & ML Graphics & Vision Impact Areas Health Care Polina Golland Project Monitoring Fetal Health Group Vision Group We develop algorithms for fetal MRI interpretation, to enable noninvasive fetal monitoring from MRI. +2 Polina Golland Leads Polina Golland Research Areas AI & ML Graphics & Vision Impact Areas Health Care +2 Polina Golland 1 More Groups Community of Research Visual Computing at CSAIL The shared mission of Visual Computing is to connect images and computation, spanning topics such as image and video generation and analysis, photography, human perception, touch, applied geometry, and more. +11 Jonathan Ragan-Kelley Leads Jonathan Ragan-Kelley Research Areas AI & ML Graphics & Vision Impact Areas Entertainment Transportation Lead Jonathan Ragan-Kelley +11 Jonathan Ragan-Kelley Research Group Medical Vision Group We develop new algorithms for medical image analysis and visualization of medical imagery. +9 Polina Golland Leads Polina Golland Research Areas AI & ML Graphics & Vision Impact Areas Health Care Lead Polina Golland +9 Polina Golland Research Group Vision Group Our researchers create state-of-the-art systems to better recognize objects, people, scenes, behaviors and more, with applications in health-care, gaming, tagging systems and more. Leads Ted Adelson Fredo Durand William Freeman Polina Golland Berthold Horn Aude Oliva Antonio Torralba Eric Grimson Research Areas AI & ML Graphics & Vision Impact Areas Entertainment Health Care Transportation Lead Ted Adelson Fredo Durand William Freeman Polina Golland Berthold Horn Aude Oliva Antonio Torralba Eric Grimson News AI & ML Graphics & Vision Health Care September 15 '25 Machine-learning tool gives doctors a more detailed 3D picture of fetal health MIT CSAIL researchers developed a tool that can model the shape and movements of fetuses in 3D, potentially assisting doctors in finding abnormalities and making diagnoses. Machine-learning tool gives doctors a more detailed 3D picture of fetal health AI & ML Graphics & Vision Health Care April 04 '25 New method assesses and improves the reliability of radiologists’ diagnostic reports The framework helps clinicians choose phrases that more accurately reflect the likelihood that certain conditions are present in X-rays. New method assesses and improves the reliability of radiologists’ diagnostic reports",
  "content_length": 4378,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:51"
}