{
  "name": "Polo Chau",
  "homepage": "http://www.cc.gatech.edu/~dchau",
  "status": "success",
  "content": "Duen Horng \"Polo\" Chau - Georgia Tech, College of Computing Polo Club of Data Science Bio CV Students Publications Conference Journal Teaching Funding Press Fun How does Stable Diffusion work? Awesome grad school: advice to thrive in PhD 7 benefits of internship in 60 seconds Vivaldi 2 Cellos Concerto Collision-free Scatter Plot (D3) D3 Show Reel Start HTTP server with single Python command Blog My research group website: Students (see all) Austin Wright, ML PhD Seongmin Lee, CS PhD Anthony Peng, CS PhD Ben Hoover, ML PhD Matthew Hull, ML PhD Alec Helbling, ML PhD Mansi Phute, CS PhD Aeree Cho, ML PhD Alex Yang, CS UG Pratham Mehta, CS BS Aishwarya Chakravarthy, CS BS Sri Ranganathan Palaniappan, CS BS Chae Yeong (Grace) Kim, CS BS Rahul Narayanan, CS BS Kunal Mohindra, CS BS Recent Alumni (see all) Zijie (Jay) Wang, ML PhD Haekyu Park, CS PhD Harsha Karanth, CS MS David Munechika, CS BSMS Evan Montoya, CS BS Chakri RVK. Analytics MS Megan Dass, CS UG Kevin Li, CS UG Sivapriya Vellaichamy, Analytics MS Omar Shaikh, CS UG Zhiyan (Frank) Zhou, CS UG Rahul Duggal, CS PhD Nilaksh Das, CSE PhD Scott Freitas, ML PhD Jonathan Leo, CS BS/MS Fred Hohman, CSE PhD Teaching CSE6242/CX4242: Data & Visual Analytics Every semseter. Online + Campus. Funding & Support Our research made possible by support and funding from: NSF (RI, 2403297, CNS 1704701, IIS 1563816, OISE 2246298, IIS 1551614, TWC 1526254, IIS1217559, CMMI 1935551, EAGER IIS 1745382), NIH (1-U54EB020404-01), DARPA (GARD, ADAMS), NASA, Children's Healthcare of Atlanta, Google, Intel, Nvidia, Cisco, ADP, Amazon, Avast, Microsoft Research, Meta (Facebook), Bosch, Gen (Symantec), Yahoo, Fiddler Labs, eBay, LogicBlox, LexisNexis Dean's Award, James Edenfield Faculty Fellowship, Raytheon Faculty Fellowship Polo Chau Legal name: Duen Horng Chau Professor, School of Computational Science & Engineering Associate Director, MS in Analytics Georgia Tech Linkedin Google Scholar YouTube Bluesky pologatech.edu faculty.cc.gatech.edu/~dchau Read our FAQ if you are interested in joining my group. Positions Aug 2024 - Professor School of Computational Science & Engineering, Georgia Tech May 2014 - Associate Director MS in Analytics, Georgia Tech Jul 2021 - Adjunct Associate Professor School of Interactive Computing, Georgia Tech Oct 2019 - Jul 2025 Director of Industry Relations Institute for Data Engineering and Science (IDEaS), Georgia Tech Oct 2019 - Jul 2025 Associate Director of Corporate Relations for Machine Learning The Center for Machine Learning, Georgia Tech Aug 2018 - Aug 2024 Associate Professor School of Computational Science & Engineering, Georgia Tech Aug 2018 - Aug 2021 Machine Learning Area Leader College of Computing, Georgia Tech Aug 2012 - Aug 2018 Assistant Professor School of Computational Science & Engineering, Georgia Tech Dec 2012 - Dec 2015 Adjunct Assistant Professor School of Interactive Computing, Georgia Tech Education Aug 2012 Ph.D. Machine Learning Carnegie Mellon University Thesis: Data Mining Meets HCI: Making Sense of Large Graphs Award: Carnegie Mellon SCS Dissertation Award, Honorable Mention Committee: Christos Faloutsos, Jason Hong, Niki Kittur, Jiawei Han (UIUC) Watch my defense video on YouTube. May 2010 M.S. Machine Learning Carnegie Mellon University Aug 2005 Masters of Human-Computer Interaction Carnegie Mellon University 2004 B.Eng. Information Engineering (Honors) The Chinese Univ. of Hong Kong Online Auction Fraud Detection Advisor: Prof. Soung-Chang Liew 2000 Diocesan Boys' School (high school) Hong Kong Research Areas and Thrusts My research group Polo Club of Data Science innovates at the intersection of machine learning and visualization to synthesize scalable, interactive, and trustworthy tools that amplify human’s ability to understand and interact with billion-scale data and machine learning models. Our research thrusts include: human-centered AI (interpretable and safe AI; adversarial ML), AI education; adversarial ML; large graph visualization and mining, cybersecurity and social good. See all our projects at our group website. Some highlights: Advancing AI Education for Students and Educators: AI Explainers: Transformer Explainer (IEEE VIS Best Poster; went viral), Diffusion Explainer (went viral), and CNN Explainer helps beginners learn deep learning models (went viral; invited to SIGGRAPH), Dodrio compares NLP attention mechanisms with linguistic knowledge, GAN Lab visualizes how generative adversarial network (GAN) works (went viral; with Google), ActiVis enables visual exploration of industry-scale deep neural networks (deployed on Meta's ML platform used by 25% engineers; invited to SIGGRAPH), ManimML (IEEE VIS Best Poster; went viral) communicates ML architectures with animation, Communicating with Interactive Articles examines interactive article design by synthesizing theory from education, journalism, and visualization. Scalable Discovery for Trustworthy and Interpretable AI: ConceptAttention visualizes any concepts in generated images (ICML'25 oral paper, top 1% of 12,000 submission); the first survey bridging LLM interpretation and AI safety; Energy Transformer introduces novel energy-based Associative Memory that works like a Transformer with far fewer and more interpretable parameters; Summit and NeuroCartography scalably summarize and visualize learned concepts, Bluff pinpoints model vulnerabilities, Recast audits toxicity detection models, comprehensive survey on visual analytics for deep learning (best for practitioners and new researchers), industry human-AI guidelines comparison. Protecting AI models: LLM Safety Landscape uncovers the universal \"safety basin\" for assessing finetuning risks; RenderBender, the first survey on adversarial attacks using differentiable rendering; LLM Self Defense pioneers the idea of using LLM itself to filter out its own harmful content; Robust Principles contributes a novel suite of generalizable robust architectural design principles; ShapeShifter the first targeted physical attack (highlighted by DARPA as state-of-the-art; with Intel), SHIELD fast and practical defense (KDD Audience Appreciation Award, Runner-up), SkeletonVis reveals temporal and spatial incoherence of attacks, UnMask protects deep learning through robust feature alignment, robust accented speech recognition (with Amazon AWS AI), REST for robust sleep monitoring, ADAGIO for audio defense. Social good (education, health, human trafficking): NestedFusion learns high-resolution latent structure of multi-scale data on Mars Firebird for fire risk prediction (KDD Best Student Paper, Runner-up; with Atlanta Fire Rescue Department), Chronodes for mobile health visual data exploration (ACM TiiS Best Paper, Honorable Mention), CardiacAR for mixed-reality heart surgical planing (with Children's Healthcare of Atlanta), augmented coding (Best Poster, Chinese CHI), mixed-reality for learning programming (IDC Best Work-in-Progress, Honorable Mention), TrafficVis fights human trafficking (VIS Best Poster, Honorable Mention), Argo Scholar for literature exploration in browsers (VIS Best Poster, Honorable Mention), extends Argo Lite, Autograding of D3 visualizations (VIS Best Poster), EnergyVis explores ML model energy consumption, PeopleMap (VIS Best Poster, Honorable Mention), Magic Crop (auto-magically cropping headshot photos) Cybersecurity & fraud detection: Polonium and Aesop malware detection over 37 billion machine-file relationships (patented and deployed by Symantec; protects 120 million people), Marco (SDM Best Student Paper), NetProbe eBay auction fraud detection (covered by WSJ, USA Today, Washington Post, LA Times, etc.), LatentGesture mobile authentication via touch signatures (covered by Wired, Engadget, Gizmodo, Yahoo News, Atlanta Business Chronicle, etc.), D2M detects adversarial movements in networks (with Microsoft), insider trading pattern discovery (with Securities and Exchange Commission), FairPlay (fraud and malware detection on Google Play). Large graph visualization and mining: Apolo and Facets for mixed-initiative large graph sensemaking, Visage enables interactive visual graph querying, without writing complex code (SIGMOD Best Demo, Honorable Mention) Vigor summarizes query results. Novel datasets and tools: TIGER for evaluating graph robustness (part of Nvidia Data Science teaching kit), MalNet the largest graph- and image-based security datasets, PEGASUS billion-scale graph mining (Open Source Software World Challenge, Silver Award). Awards & Honors (my students' awards) 2025 Dean's Award for Faculty (group), for establishing Georgia Tech's AI leadership for College of Computing 2025 Best Paper, CVPR'25 Workshop on Visual Concepts, for ConceptAttention 2024 Innovator Award, MS Analytics 10 Year Anniversary 2024 IEEE VIS Best Poster Award, for Transformer Explainer 2024 KDD Best Paper, Runner-up (Applied Data Science) for Nested Fusion 2024 SIGIR Best Short Paper, Honorable Mention for MeMemo 2023 Google Research Award, for Scaling Up Educators' Capacities: Automating Visualization Assessment via Generative AI 2023 BMVC Best Poster, for Robust Principles 2023 IEEE VIS Best Poster Award, for ManimML 2023 ACL Best Paper, Honorable Mention, for DiffusionDB 2023 Senior Faculty Outstanding Undergraduate Research Mentor Award. Georgia Tech. 2022 IEEE VIS Best Paper, Honorable Mention, for TrafficVis 2022 Outstanding Mid-Career Faculty Research Award. College of Computing, Georgia Tech. 2022 NeuroCartography selected to present at SIGGRAPH’22 as a top IEEE VIS'21 paper (top 1% of 442 submissions) 2021 Best Paper Award, NeurIPS 2021 Workshop on Bridging the Gap: From Machine Learning Research to Clinical Practice (Research2Clinics), for GAM Changer 2021 IEEE VIS Best Poster Award, for autograding of D3 visualization 2021 IEEE VIS Best Poster Honorable Award, for Argo Scholar 2021 IEEE VIS Best Poster Honorable Mention, for TrafficVis 2020 IEEE VIS Best Poster Research Award, Honorable Mention (VAST t",
  "content_length": 138533,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:54"
}