{
  "name": "Pong C. Yuen",
  "homepage": "http://www.comp.hkbu.edu.hk/~pcyuen",
  "status": "success",
  "content": "Pong C Yuen Pong C Yuen (阮邦志) Professor Department of Computer Science Hong Kong Baptist University Home My Team Publications Professional Activities Teaching CV Contact Pong C Yuen received his B.Sc. degree in Electronic Engineering with first class honours in 1989 from City Polytechnic of Hong Kong, and his Ph.D. degree in Electrical and Electronic Engineering in 1993 from The University of Hong Kong. He joined the Hong Kong Baptist University in 1993, and served as the Head of Department of Computer Science from 2011 – 2017. Currently he is a Professor at the Department of Computer Science and Associate Dean of Science Faculty, Hong Kong Baptist University. Dr. Yuen was a recipient of the University Fellowship to visit The University of Sydney in 1996. In 1998, Dr. Yuen spent a 6-month sabbatical leave in The University of Maryland Institute for Advanced Computer Studies (UMIACS), University of Maryland at College Park. From June 2005 to January 2006, he was a visiting professor in GRAVIR laboratory (GRAphics, VIsion and Robotics) of INRIA Rhone Alpes, France. From July 2017 to January 2018, he was a visiting faculty at the ETH, Zurich. Dr. Yuen was the director of Croucher Advanced Study Institute (ASI) on biometric authentication in 2004 and the director of Croucher ASI on Biometric Security and Privacy in 2007. He has been serving the Director of IAPR/IEEE Winter School on Biometrics since 2017. Dr. Yuen has been actively involved in many international conferences and professional community. He was the track co-chair of the International Conference on Pattern Recognition (ICPR) 2006, the program co-chair of the IEEE Fifth International Conference on Biometrics: Theory, Applications and Systems (BTAS) 2012, the IEEE International Conference on Identity, Security and Behavior Analysis (ISBA) 2016, the International Conference on Pattern Recognition and Artificial Intelligence (ICPRAI) 2018, program co-chair of the International Workshop on Information, Forensics and Security (WIFS) 2018. He served as Associate Editor of IEEE Transactions on Information Forensics and Security from 2014 - 2018, and received the Outstanding Editorial Board Service Award in 2018. Currently, Dr. Yuen is the Vice President (Technical Activities) of the IEEE Biometrics Council, Editorial Board Member of Pattern Recognition, and Senior Editor of SPIE Journal of Electronic Imaging. He received the first-prize and second-prize Natural Science Awards from the Guangdong Province and the Ministry of Education, China, respectively. He is a Fellow of IAPR. Dr. Yuen's current research interests include video surveillance, human face recognition, biometric security and privacy. Recent publications M Ye, J W Li, A J Ma, L Zheng, P C Yuen, “Dynamic Graph Co-Matching for Unsupervised Video-based Person Re-Identification”, In Press, IEEE Transactions on Image Processing (TIP), 2019. G C Mai, K Cao, P C Yuen and A K Jain, “On the Reconstruction of Face Images from Deep Face Templates”, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), Vol. 41, No. 5, pp. 1188-1202, 2019. M Ye, X Zhang, P C Yuen and S F Chang, “Unsupervised Embedding Learning Using Invariant and Spreading Instance Feature”, Proceedings of IEEE International Conference on Computer Vision and Pattern Recognition (CVPR), In press, 2019. R Shao, X Y Lan, J W Li and P C Yuen, “Multi-adversarial Discriminative Deep Domain Generalization for Face Presentation Attack Detection” Proceedings of IEEE International Conference on Computer Vision and Pattern Recognition (CVPR), In press, 2019. B Y Yang and P C Yuen, “Cross-domain Visual Representations via Unsupervised Graph Alignment”, The Thirty-Second AAAI Conference on Artificial Intelligence (AAAI), 2019. J W Li, A Ma and P C Yuen, “Semi-Supervised Region Metric Learning for Person Re-identification”, International Journal of Computer Vision (IJCV), Vol. 126, No. 8, pp. 855-874, 2018. X Y Lan, S P Zhang, P C Yuen and R Chellappa, “Learning Common and Feature Specific Patterns: A Novel Multiple-Sparse-Representation-based Tracker”, IEEE Transactions on Image Processing (TIP), Vol. 27, No. 4, pp. 2022-2037, 2018. Y Wang, J Wan, J Guo, Y M Cheung and P C Yuen, “Inference-Based Similarity Search in Randomized Montgomery Domains for Privacy-Preserving Biometric Identification”, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), Vol. 40, No. 7, pp.1611-1624, 2018. Qingxiong Tan, Andy J Ma, huiqi Deng, Vincent Wong, Yee-Kit Tse, Terryfung Yip, Grace Wong, Ching Yuet Ling Jessica, Francis Ka-Leung Chan, Pong C Yuen, “A Hybrid Residual Network and Long Short-Term Memory Method for Peptic Ulcer Bleeding Mortality Prediction”, AMIA Annual Symposium, 2018. R Shao, X Y Lan and P C Yuen, “Feature Constrained by Pixel: Hierarchical Adversarial Deep Domain Adaptation”, ACM Multimedia (ACM MM), Oct 2018. M Ye, X Lan, P C Yuen, “Robust Anchor Embedding for Unsupervised Video Re-Identification in the Wild” Proceedings of the European Conference on Computer Vision (ECCV), pp. 170-186, Sept 2018. S Liu, X Lan, PC Yuen, “Remote Photoplethysmography Correspondence Feature for 3D Mask Face Presentation Attack Detection”, Proceedings of the European Conference on Computer Vision (ECCV), pp. 558-573, Sept. 2018. ... more",
  "content_length": 5365,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:50"
}