{
  "name": "Pooya Moradian Zadeh",
  "homepage": "http://www.uwindsor.ca/science/computerscience/1047/dr-pooya-moradian-zadeh",
  "status": "success",
  "content": "Dr. Pooya Moradian Zadeh | School of Computer Science Skip to main content University of Windsor Search Enter the terms you wish to search for. Search CLOSE QUICK LINKS Current StudentsBrightspaceUWinsite StudentCampus BookstoreFaculty + StaffUWinsite FinanceAlumni + DonorsIndustry + Community Partners Faculty of Science About Academics Research Student Experience News and Events Giving to Science EDI Alumni About About UWindsor Office of the President People, Equity and Inclusion Virtual Tour Visitor Information Campus Maps Parking VIEW Magazine Academics ProgramsUndergraduate Programs Graduate Programs International Programs Co-operative Education Continuing Education SupportOffice of the Registrar Financial Matters Office of the Provost Faculties Arts, Humanities, and Social Sciences Law Education Nursing Engineering Business Graduate Studies Human Kinetics Science Research Research & Innovation Research Partnerships Research Ethics Research Safety Animal Care Research Finance Leddy Library UWill Discover! Student Life About Student Life UWindsor Events SoCA Concerts & Events Lancers Varsity Sports Athletics + Recreation Services Student Accessibility Services Residence Food Services Student Support Back to Top FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR MENU FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR School of Computer Science School of Computer Science In this section Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us UWindsor Home School of Computer Science Dr. Pooya Moradian Zadeh Dr. Pooya Moradian Zadeh Associate Professor Acting Undergraduate Program Chair 519-253-3000 ext. 2992 pooya@uwindsor.ca Office: 5105 Lambton Tower Research Interests: Social computing, Social/Complex Network Analysis and Modeling. Big Data Analytics, Data Mining, and Intelligent Systems. Applied Artificial Intelligence. Computational Intelligence, and Optimization Algorithms. Selected Publications: Ishraque, M.T, Zjalic, N., Zadeh, P. M, Kobti, Z., Olla, P. (2018), Cardiac Rehabilitation Therapy Recommendation System. In 2018 IEEE MIT URTC. (in press) Moradianzadeh, N., Zadeh, P. M., Kobti, Z., & Pfaff, K. (2018), Using Social Network Analysis to Model Palliative Care. Journal of network and computer applications, Elsevier. 120 (2018): 30-41. Moradianzadeh, N., Zadeh, P. M., Kobti, Z., & Pfaff, K. (2018), Using social network analysis to optimize the Circle of Care in Compassionate Communities. 22nd International Congress on Palliative Care. Singh, D.; Zadeh, P.M, Kobti, Z.(2018), A Multilevel Cooperative Multi-Population Cultural Algorithm, 2018 IEEE International Conference on Innovations in Intelligent Systems and Applications (INISTA), IEEE. Selvarajah, K., Zadeh, P.M, Kobti, Z.; Kargar, M., Tazim, Mohd, Pfaff, K.(2018), Team Formation in Community-Based Palliative Care, 2018 IEEE International Conference on Innovations in Intelligent Systems and Applications (INISTA), IEEE. Selvarajah, K., Zadeh, P.M., Kargar, M., & Kobti, Z. (2017). A Knowledge-based Computational Algorithm for Discovering a Team of Experts in Social Networks. In KDD Workshop on Data-Driven Discovery (DDD) in conjunction with the 23rd ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2017. Moradianzadeh, N., Zadeh, P. M., Kobti, Z., & Pfaff, K. (2017, July). An Agent Model to Support Social Network-Based Palliative Care. In Computers and Communications (ISCC), 2017 IEEE Symposium on (pp. 300-305). IEEE. Zadeh, P. M., Pandey, M., & Kobti, Z. (2016, July). A Study on Population Adaptation in Social Networks Based on Knowledge Migration in Cultural Algorithm. In Evolutionary Computation (IEEE CEC), 2016 IEEE Congress on (pp. 4405-4412). IEEE. Zadeh P.M., Kobti Z. (2016) A Knowledge-Based Framework for Link Prediction in Social Networks. In: Gyssens M., Simari G. (eds) Foundations of Information and Knowledge Systems. FoIKS 2016. Lecture Notes in Computer Science, vol 9616. Springer. (Selected Paper) Zadeh, P. M., & Kobti, Z. (2015). A Multi-Population Cultural Algorithm for Community Detection in Social Networks. Procedia Computer Science, 52, 342-349. Elsevier Mohi, M., Movaghar, A., & Zadeh, P. M. (2009, January). A Bayesian Game Approach for Preventing Dos Attacks in Wireless Sensor Networks. In Communications and Mobile Computing, 2009. CMC'09. WRI International Conference on (Vol. 3, pp. 507-511). IEEE. Zadeh, P. M., & Moshkenani, M. S. (2008, November). Mining Social Network for Semantic Advertisement. In Convergence and Hybrid Information Technology, 2008. ICCIT'08. Third International Conference on (Vol. 1, pp. 611-618). IEEE. Website: http://pooya.myweb.cs.uwindsor.ca/ share post share CS Events Fall 2025 Demo Day Fri, 12/05/2025 - 10:00 SCS Demo Day - Looking Forward to Seeing You Fri, 12/05/2025 - 10:00 Accelerating Image Classification with Graph Convolutional Neural Networks using Voronoi Diagrams - PhD Dissertation Proposal by: Mustafa Mohammadi Gharasuie Fri, 12/12/2025 - 13:00 WiCyS Windsor Twitter Tweets by wicyswindsor Computer Science Society Instagram View this post on Instagram A post shared by UWin Computer Science Society (@uwindsorcss) share post share",
  "content_length": 5871,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:56"
}