{
  "name": "Poramate Manoonpong",
  "homepage": "https://www.manoonpong.com",
  "status": "success",
  "content": "Poramate Manoonpong \"What is happening today is the history of tomorrow; You cannot change it but you can design it\" Home Research Publications Events Talks Links (Internal) Navigation: Personal Details Academic Background Grants Honors/Awards Professional Experience Professional Activities Teaching Organizer Editor Biography: Poramate Manoonpong was born in Nan, Thailand, in 1978. Currently, he is a Professor of Bio-inspired Robotics at the School of Information Science and Technology, Vidyasirimedhi Institute of Science and Technology (VISTEC), Thailand and has also served as a Professor of SDU Biorobotics, the Mærsk Mc-Kinney Møller Institute, the University of Southern Denmark (SDU), Denmark. He received his B.Eng. degree in mechanical engineering from the King Mongkut's University of Technology Thonburi, Thailand, in 2000, M.Sc. degree in mechatronics from Fachhochschule Ravensburg-Weingarten, Germany, in 2002, and Ph.D. degree in electrical engineering and computer science from the University of Siegen, Germany, in 2006. He was a JSPS Postdoctoral fellow at Advanced Telecommunications Research Institute International, Computational Neuroscience Laboratories, Department of Brain Robot Interface, Kyoto, Japan. He was also the group leader of the Emmy Noether research project for \"Neural Control, Memory, and Learning for Complex Behaviors in Multi Sensori-Motor Robotic Systems\" at Bernstein Center for Computational Neuroscience (BCCN), Department for Computational Neuroscience, Third Institute of Physics-Biophysics, the University of Goettingen, Germany. He has been PI or co-PI of 16 funded projects. Currently he serves on an Associate Editor of Frontiers in Neuroscience (Neurorobotics) and Adaptive Behavior (SAGE journal), the editorial board of International Journal of Advanced Robotic Systems (ARS), (Topic: Bioinspired Robotics) and Advances in Robotics Research, Techno press, and as a program committee member for international conferences and workshops. He has published over eighty publications in major robotics journals and conferences and and edited two books. Research interests: Embodied AI, machine learning for robotics, neural locomotion control of walking machines, biomechanics, dynamics of recurrent neural networks, learning/plasticity, embodied cognitive systems, prosthetic and orthopaedic devices, exoskeletons, brain-machine interface, human-machine interaction, service/inspection robots. My long-term agenda: \"To understand how brain-like mechanisms including biomechanics can be realized in artificial agents so they can become more like living creatures in their level of performance\" In order to achieve my goal, I have developed neural mechanisms for locomotion generation and adaptation in legged robots, e.g., dynamic biped walking robot \"RunBot\" and adaptive animal-like robots AMOS. Personal Details Name: Poramate ManoonpongPlace of Birth: Nan, ThailandNationality and Race: ThaiSex: MaleMarital Status: Married SCOPUS ID PUBLONS ID RESEARCHER ID Twitter ID IEEE ID euRobotics ID Academic Background 1991-1995, High school (Hons.), Kasetsart University Laboratory School, Bangkok, Thailand 1996-2000, B.Eng. in Mechanical Engineering (Hons.), King Mongkuts University of Technology Thonburi, Bangkok, Thailand Supervisors: Assoc. Prof. Dr.Siam Charoenseang, Assoc. Prof. Dr.Djitt Laowattana 2000-2002, M.Sc. in Mechatronics, Fachhochschule Ravensburg-Weingarten, Weingarten, Germany Supervisors: Prof. Dr. Ing. Andreas Paczynski, Prof. Dr.-Ing. Franz Brümmer 2002-2005, Ph.D. student at Fraunhofer Institut fuer Autonome Intelligente Systeme, Sankt Augustin, Germany 2002-2006, Dissertation, University of Siegen, Department of Electrical Engineering and Computer Science, Institut fuer Regelungs-und Steuerungstechnik, Siegen, GermanySupervisors: Prof. Dr.-Ing. Hubert Roth, Prof. Dr. rer. nat. Frank Pasemann Honors/ Awards 2000, Second class honours in Mechanical Engineering (B.Eng.) at King Mongkut's University of Technology Thonburi, Bangkok, Thailand 2008, Best Ph.D. thesis award in Engineering and Industrial Research category from the Office of the National Research Council of Thailand (NRCT) 2008, Finalist of the Tzyh-Jong Tarn best paper award from IEEE International Conference on Robotics and Biomimetics 2008 2010, Research Fellowship of Japan Society for the Promotion of Science (JSPS: Research Abroad) 2011, Research Fellowship of Japan Trust International Research Cooperation Program (Research Abroad) 2011, Emmy Noether Programme of the DFG (German Research Foundation) 2012, Distinguished alumni award for outstanding achievements in scientific research from FIBO at 16 year FIBO Homecoming 2013, Innovation Award 2013- For Practical Innovation in the Field of Robotics (Highly recommended) from 16th International Conference on Climbing and Walking Robots and the Support Technologies for Mobile Machines (CLAWAR) 2013, Best Technical Paper Award (Highly recommended) from 16th International Conference on Climbing and Walking Robots and the Support Technologies for Mobile Machines (CLAWAR) 2015,.The Scandinavian Guest Professorship (Skandinavische Gastdozentur) Award of the Christian-Albrechts-Universitaet zu Kiel 2018, “Sky Talent” (“长空英才”) of Nanjing University of Aeronautics and Astronautics (NUAA) 2020, Best Technical Paper Award 2020-at 23rd International Conference on Climbing and Walking Robots and the Support Technologies for Mobile Machines (CLAWAR). 2020, The honorary title of Excellent Members of the International Society of Bionic Engineering (ISBE) 2021, Outstanding Paper Award from 25th Tecnical Forum (Engineering and Operations) of PTT Exploration and Production Public Company Limited (\"Morphological Adaptation for Speed Control of Pipeline Inspection Gauges (MC-PIG), T. Suthisomboon, P. Janbanjong, P. Kosanunt, S. Phodapol, P. Manoonpong) 2022, Jiangsu Youth Friendship Envoys 2022, Highlighting excellent innovation by the European Commission's Innovation Radar (Automatic FPGA-based Neural Network Implementation Tool) 2022, IEEE Senior member award 2022, The finalist prize of the work entitled \"Gecko-Inspired Robot with a Bendable and Hybrid Soft-Rigid Adhesive Feet for Agile and Versatile Gecko-like Locomotion\" from the international Bionic Innovation Competition 2022. 2022, Appointed external examiner (censor) for the Bachelor of Science (BSc), Master of Science (MSc) in Engineering programmes and master programmes (continuing education) within the field of Civil - Elektronik, IT og Energi, appointed by the Danish Agency for Science and Higher Education, the Ministry of Higher Education and Science (from 1st April 2022 to 31st March 2026). 2023, Standing member of the Youth commission of International Society of Bionic Engineering 2023, Board director of the education committee of International Society of Bionic Engineering 2023, Innovation Award 2013- For Practical Innovation in the Field of Robotics (Winning) from 26th International Conference on Climbing and Walking Robots and the Support Technologies for Mobile Machines (CLAWAR) 2024, Outstanding achievements (VISTEC honors) that brought recognition to VISTEC between April 2023 and March 2024 2025, the 31st Science & Technology Award Winner (Individual Category) from Thailand Toray Science Foundation (TTSF) Grants 2009: The Office of the Higher Education Commission of Thailand (OHEC), Neural Control for Reconfigurable Spherical Robots project, P.M. = co-PI 2010: Japan Society for the Promotion of Science (JSPS), Novel Neural Learning Models for Policy Improvement of Dynamic Motion Control project, P.M. = co-PI 2011: Japan Trust International Research Cooperation Program (NICT), Neural Learning for Adaptive Human-Humanoid Communication project, P.M. = PI 2010-2015: The Federal Ministry of Education and Research (Germany) through Bernstein Center for Computational Neuroscience II (BCCN II, project D1), Biomechanics and Adaptive Neural Control of Animal and Robot Locomotion project, P.M.= co-PI 2011-2014: Emmy-Noether Program, DFG (Germany), Neural Control, Memory, and Learning for Complex Behaviors in Multi Sensori-Motor Robotic Systems project, P.M. = PI 2012-2015: The Strategic Japanese-German Cooperative Program on Computational Neuroscience (Germany), Haptic Learning project, P.M. = co-Coordinator 2015-2017: SDU-research funding, Neural Predictive Control for Goal-directed Learning and Multi- scale Adaptation project, P.M. = PI 2017-2018: SDU Lighthouse initiative, \"Welfare Innovation\" project, P.M. = partner 2017-2020: Horizon2020-FETPROACT, Predictive Neural Information for Proactive Actions: From Monkey Brain to Smart House Control (Plan4Act) project, P.M. = technical coordinator & PI for SDU component 2017-2020: Innovation fund Denmark, Seamless huMan-robot interactiOn fOr THe support of elderly people (SMOOTH) project, P.M. = work-package PI 2017-2020: Interreg5, Health Care Assisting Technology (Health-CAT) project, P.M. = work-package PI 2017-2020: HFSP, A dung beetles life: how miniature creatures perform extraordinary feats with limited resources (Dlife) project, P.M. = co-PI 2017-2021: Startup Grant-IST Flagship researches (Thailand), “Bio-inspired Robotics” project, P.M. = PI 2018-2021: Nanjing University of Aeronautics and Astronautics NEUrorobotic Technology for advanced Robot mOtor control (NEUTRON) project, P.M. = PI 2019-2021: NSFC-DFG, \"Bio-inspired Smart Attachment and Adaptive Neuromechanical Control for Highly Efficient Locomotion and Adaptation to an Autonomous Climbing Robot” project, P.M. = co-PI 2021-2022: THOMAS B. THRIGES FOND, \"Advanced machine learning research platform for autonomous lifelong learning of complex robotic systems in dynamically changing real-world environments (ADLife)\" project, P.M. = PI 2021-2022: Odense Robotics, \"LOFT: Long-term autOnomy For service robots in consTruction (LOFT)” project, P.M. = Coordinator 2024-2028: MSCA (Doctoral Networks and Staff Exchange",
  "content_length": 27390,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:55"
}