{
  "name": "Posco Tso",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/tsoposco",
  "status": "success",
  "content": "Posco Tso | Computer Science | Loughborough University Professor Posco Fung Po Tso Professor in Computer Networks and Systems Research groups and centres Cyber, Networks and Systems Publications Google Scholar +44 (0) 1509 223 078 Send email Office: N.3.25 (Haslegrave Building) Personal website Biography Research Research Supervision Professor Tso's research is driven by a vision of a future where computer networks evolve into intelligent computation entities that work seamlessly with servers, revolutionising technological innovation for societal and environmental advancement. While traditional networks prioritise speed, acting as simple data conduits, this model creates a bottleneck in an era of data abundance. Professor Tso pioneers a transformative approach where the network itself participates in computation, redefining data processing within the network fabric to enable in-transit data transformation. This work paves the way for ultra-low latency applications, such as remote surgery. His research is inherently collaborative, bridging national and international academic and industry partners, as evidenced by his externally funded research projects. His current research interests are in computer networks and systems, including in-network computing, in-network intelligence, edge computing, and edge intelligence. Professor Tso serves as Impact Coordinator for the Department of Computer Science and a UoA co-lead for the university, developing new Impact Case Studies for the upcoming REF by identifying pathways for policy influence and commercialisation. He is a Fellow of HEA (FHEA) and a senior member of IEEE (SMIEEE). Professor Tso has a substantial grant portfolio, reflecting his ability to lead large national and international consortia in carrying out high-impact research. His research has been mainly funded by The Engineering and Physical Sciences Research Council (EPSRC) and Innovate UK, including: VISION: Virtual Integrated Supply-chain Improvement with Optimized Networking, 07/2025-06/2028, €3,852.8K IoDT2: Internet of Digital Twin Things, 05/2024-04/2027, €2,682.2K 5G-IoTNet: Enabling Seamless Federation of 5G and IoT Networks, 04/2024-03/2025, £1,004,204 Serverless Edge Computing for 5G Edge Devices, 11/2022-05/2024, £499,223 IEoT: Intelligent Edge of Things, 07/2020-06/2022, £972,750 SYNC: Synergistic Network Policy Management for Cloud Data Centres, 4/2017-3/2018, £100,786 Fruit: The Federated Raspberry Pi Micro-infrastructure Testbed, 1/2017-12/2018. £909,548 Professor Tso has a strong record of supporting the development of researchers through personalised supervision and professional development opportunities. He has supervised and line-managed multiple Post-Doctoral Research Associates (PDRAs) and Research Assistants (RAs). He has also supervised numerous Doctoral Researchers (DRs). I am always looking for talented and motivated PhD students to join my research team and contribute to the exciting field of computer networks and systems. My research focuses on transforming computer networks into intelligent computation entities to drive the next generation of technological innovation. I am particularly interested in supervising projects in the following areas: In-network computing and programmable networks Edge AI and edge intelligence Edge computing and serverless architectures Internet of Things (IoT) and Digital Twins Network security and privacy Energy-efficient networking and green computing While I do not have any fully-funded PhD positions available at this moment, I strongly encourage high-calibre candidates to get in touch to explore the following routes: Joint Funding Applications: I am keen to support outstanding candidates in applying for competitive scholarships and funded opportunities. If you have an excellent academic record and a strong research idea that aligns with my interests, we can work together to develop a compelling application. Self-Funded Students: I also welcome applications from self-funded students who have a clear passion for research and a well-developed project proposal. If you are interested in pursuing a PhD under my supervision, please send me an email.",
  "content_length": 4180,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:55"
}