{
  "name": "Prabhanjan Ananth",
  "homepage": "https://sites.google.com/site/prabhanjanva",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationPRABHANJAN ANANTHASSOCIATE PROFESSOR 1119 Harold Frank Hall,Department of Computer Science,University of California, Santa BarbaraEmail: prabhanjan at cs ucsb edu Ph.D.Postdoctoral AssociateGlenn and Susanne Culler Assistant Professor Associate Professor RESEARCH INTERESTSI'm a cryptographer and I'm interested in proposing theoretically grounded solutions for problems inspired from the real world.  Recently, I have mainly focused on exploring the feasibility and infeasibility of cryptographic notions equipped with quantum capabilities. Some topics I have worked on recently: Unclonable cryptography: this is an area of quantum cryptography that leverages the no-cloning principle of quantum mechanics to achieve cryptographic tasks that are impossible to achieve classically. There are many fascinating primitives in this area and I have mainly focused on quantum software copy-protection and unclonable encryption. Quantum pseudorandomness: I'm interested in understanding the (in)feasibility of generating quantum states or unitaries that mimic the behavior of the corresponding Haar random objects against computationally bounded adversaries. I have explored the constructions of different quantum pseudorandom objects (specifically, pseudorandom quantum states and unitaries) in addition to its implications to cryptography. Watermarking generative AI content: as generative AI models rise in popularity, it is important to be able to tell whether content is produced using a generative AI model or whether it is human produced. Watermarking allows us to address this problem. In particular, the process of watermarking a generative AI model does not significantly deteriorate the quality of the model while injecting a watermark into any content it produces that allows detection. I have explored the constructions of watermarking schemes both from an information-theoretic as well as from a cryptographic perspective. I'm grateful to the National Science Foundation for supporting my research!PUBLICATIONS(Note: Only published research papers with proceedings are numbered below)2026Less is More: On Copy Complexity in Quantum Cryptography(with Eli Goldin)QIP 2026Gluing Random Unitaries with Inverses and Applications to Strong Pseudorandom Unitaries(with John Bostanci, Aditya Gulati, Yao-Ting Lin)QIP 2026202563. On the Limitations of Pseudorandom Unitaries(with Aditya Gulati, Yao-Ting Lin)TCC 202562. Revocable Encryption, Programs, and More: The Case of Multi-Copy Security(with Saachi Mutreja, Alexander Poremba)ITC 202561. Pseudorandom Unitaries in the Haar Random Oracle Model [Part I, Part II](with John Bostanci, Aditya Gulati, Yao-Ting Lin)CRYPTO 2025 60. Ideal Pseudorandom Codes(with Omar Alrabiah, Miranda Christ, Yevgeniy Dodis, Sam Gunn)STOC 2025(Invited to the SICOMP Special Issue for STOC'25)59. Pseudorandomness in the (Inverseless) Haar Random Oracle Model(with John Bostanci, Aditya Gulati, Yao-Ting Lin)EUROCRYPT 202558. Simultaneous Haar Indistinguishability with Applications to Unclonable Cryptography(with Fatih Kaleoglu, Henry Yuen)ITCS 202557. Post-Quantum Zero-Knowledge with Space-Bounded Simulation(with Alex B. Grilo)LATINCRYPT 2025Cryptography in the Common Haar State Model: Feasibility Results and Separations(with Aditya Gulati, Yao-Ting Lin)QIP 2025Copy-Protecting Puncturable Functionalities, Revisited(with Amit Behera, Zikuan Huang)TQC 2025Less is More: On Copy Complexity in Quantum Cryptography(with Eli Goldin)Copy-Protection from UPO, Revisited(with Amit Behera, Zikuan Huang, Fuyuki Kitagawa, Takashi Yamakawa) [subsumes ABH]Quantum One-Time Programs: Less Assumptions, More Feasibility, and One-Message 2PC(with Divyanshu Bhardwaj)Non-Interactive MPC, |Revisited>(with Divyanshu Bhardwaj, Aparna Gupte) [subsumes AB]202456. Cryptography in the Common Haar State Model: Feasibility Results and Separations(with Aditya Gulati, Yao-Ting Lin)TCC 2024(preliminary version will appear in QCRYPT 2024)55. Quantum Key-Revocable Dual-Regev Encryption, Revisited(with Zihan Hu, Zikuan Huang)TCC 202454. Unclonable Secret Sharing(with Vipul Goyal, Jiahui Liu, Qipeng Liu)ASIACRYPT 202453. NIZKs with Maliciously Chosen CRS: Subversion Advice-ZK and Accountable Soundness(with Gilad Asharov, Vipul Goyal, Hadar Kaner, Pratik Soni, Brent Waters)SCN 202452. A Modular Approach to Unclonable Cryptography(with Amit Behera)CRYPTO 202451. Pseudorandom Isometries(with Aditya Gulati, Fatih Kaleoglu, Yao-Ting Lin)EUROCRYPT 202450. Pseudorandom Strings from Pseudorandom Quantum States(with Yao-Ting Lin, Henry Yuen)ITCS 202449. Provable Robust Watermarking for AI-Generated Text(with Xuandong Zhao, Lei Li, Yu-Xiang Wang)ICLR 202448. ORTOA: A Family of One Round Trip Protocols For Operation-Type Obliviousness(with Sujaya Maiyya, Yuval Steinhart, Adrian Davila, Jason Du, Divyakant Agrawal, Amr El Abbadi)EDBT 2024202347. Revocable Cryptography from Learning with Errors(with Alexander Poremba, Vinod Vaikuntanathan)TCC 202346. On the (Im)Plausibility of Public-Key Quantum Money from Collision-Resistant Hash Functions(with Zihan Hu, Henry Yuen)ASIACRYPT 202345. Cloning Games: A General Framework for Unclonable Primitives (with Fatih Kaleoglu, Qipeng Liu)CRYPTO 2023QCRYPT 2023Pseudorandom Quantum States, Revisited: New Properties, Variants, Constructions, and Cryptographic Applications(with Aditya Gulati, Luowen Qian and Henry Yuen)QIP 2023 (short plenary talk)On the Feasibility of Unclonable Encryption, and More(with Fatih Kaleoglu, Xingjian Li, Qipeng Liu, Mark Zhandry)QIP 2023 (contributed talk)202244. Pseudorandom (Function-Like) Quantum State Generators: New Definitions and Applications(with Aditya Gulati, Luowen Qian and Henry Yuen)TCC 2022QCRYPT 202243. Collusion-Resistant Functional Encryption for RAMs(with Kai-Min Chung, Xiong Fan, Luowen Qian)ASIACRYPT 2022 42. Cryptography from Pseudorandom Quantum States (with Luowen Qian, Henry Yuen)CRYPTO 2022QCRYPT 2022[Twitter summary by Henry]41. On the Feasibility of Unclonable Encryption, and More(with Fatih Kaleoglu, Xingjian Li, Qipeng Liu, Mark Zhandry)CRYPTO 202240. Pre-Constrained Encryption(with Abhishek Jain, Zhengzhong Jin, Giulio Malavolta)ITCS 2022A Note on Copy-Protection from Random Oracles(with Fatih Kaleoglu)Quantum Cryptography Workshop 2022202139. Unclonable Encryption, Revisited (with Fatih Kaleoglu)TCC 202138. On the Concurrent Composition of Quantum Zero-Knowledge(with Kai-Min Chung, Rolando L. La Placa)CRYPTO 202137. Secure Software Leasing [Video](with Rolando L. La Placa)EUROCRYPT 2021QIP 2021 (joint short plenary talk with ABDS)[Shtetl-Optimized]36. Towards Accountability in CRS Generation(with Gilad Asharov, Hila Dahari, Vipul Goyal)EUROCRYPT 2021Journal of Cryptology 202535. Unbounded MPC from Learning with Errors (with Abhishek Jain, Zhengzhong Jin, Giulio Malavolta)EUROCRYPT 2021202034. Secure Quantum Extraction Protocols (with Rolando L. La Placa)TCC 202033. Multi-key Fully-Homomorphic Encryption in the Plain Model (with Abhishek Jain, Zhengzhong Jin and Giulio Malavolta) [subsumes AJJ]TCC 202032. Towards Efficiency Preserving Round-Compression Compilers in MPC (with Arka Rai Choudhuri, Aarushi Goel and Abhishek Jain)ASIACRYPT 2020201931. Optimal Bounded-Collusion Secure Functional Encryption (with Vinod Vaikuntanathan)TCC 201930. Fully Homomorphic NIZK and NIWI Proofs  (with Apoorvaa Deshpande, Yael Tauman Kalai and Anna Lysyanskaya)TCC 201929. From FE Combiners to Secure MPC and Back (with Saikrishna Badrinarayanan, Aayush Jain, Nathan Manohar and Amit Sahai)TCC 201928. Towards Attribute-Based Encryption from LWE: Sublinear Decryption and More (with Xiong Fan and Elaine Shi)ASIACRYPT 201927. Indistinguishability Obfuscation Without Multilinear Maps: New Paradigms via Low Degree Weak Pseudorandomness and Security Amplification (with Aayush Jain, Huijia Lin, Christian Matt and Amit Sahai; merge of [AJS18] and [LM18])CRYPTO 201926. Two Round Information-Theoretic MPC with Malicious Security(with Arka Rai Choudhuri, Aarushi Goel and Abhishek Jain)EUROCRYPT 2019201825. Succinct Garbling Schemes from Functional Encryption through a Local Simulation Paradigm (with Alex Lombardi)TCC 201824. Private Circuits: A Modular Approach  (with Yuval Ishai and Amit Sahai)CRYPTO 201823. Round-Optimal Secure Multiparty Computation with Honest Majority (with Arka Rai Choudhuri, Aarushi Goel and Abhishek Jain)CRYPTO 2018201722. On Secure Two-Party Computation in Three Rounds (with Abhishek Jain)TCC 201721. A New Approach to Round-Optimal Secure Multiparty Computation  (with Arka Rai Choudhuri, Aarushi Goel and Abhishek Jain)CRYPTO 201720. Indistinguishability Obfuscation for Turing Machines: Constant Overhead and Amortization  (with Abhishek Jain and Amit Sahai)CRYPTO 201719. Projective Arithmetic Functional Encryption and Indistinguishability Obfuscation From Degree-5 Multilinear Maps  (with Amit Sahai)EUROCRYPT 201718. Cryptography with Updates  (with Aloni Cohen and Abhishek Jain)EUROCRYPT 201717. Patchable Indistinguishability Obfuscation: iO for Evolving Software  (with Abhishek Jain and Amit Sahai)EUROCRYPT 201716. Robust Transforming Combiners from Indistinguishability Obfuscation to Functional Encryption   (with Aayush Jain and Amit Sahai)EUROCRYPT 2017201615. Delegating RAM Computations with Adaptive Soundness and Privacy  (with Yu-Chi Chen, Kai-Min Chung, Huijia Lin and Wei-Kai Lin)TCC 2016-B14. Universal Obfuscation and Witness Encryption: Boosting Correctness and Combining Security  (with Aayush Jain, Moni Naor, Amit Sahai and Eylon Yogev)CRYPTO 201613. Functional Encryption for Turing Machines  (with Amit Sahai)TCC 2016-A201512. Indistinguishability Obfuscation from Compact Functional Encryption  (with Abhishek Jain)CRYPTO 201511. From Selective to Adaptive Security in Functional Encryption  (with Zvika Brakerski, Gil Segev and Vinod Vaikuntanathan)CRYPTO 2015Indistinguishability Obfuscation from Functional Encryption",
  "content_length": 14233,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:57"
}