{
  "name": "Prabhat Kumar Mishra",
  "homepage": "https://prabhatkmishra.github.io",
  "status": "success",
  "content": "PSALM Lab PSALM Lab Predictive Stochastic Adaptive Learning Machines Learn to control AI before AI learns to control! PSALM Lab Predictive Stochastic Adaptive Learning Machines Learn to control AI before AI learns to control! PSALM Lab Predictive Stochastic Adaptive Learning Machines Learn to control AI before AI learns to control! PSALM Lab Predictive Stochastic Adaptive Learning Machines Learn to control AI before AI learns to control! Principle Investigator Prabhat Kumar Mishra Assistant Professor Department of Aritificial Intelligence IIT Kharagpur Training AI/ML for Robot Autonomy AI for Cyber Physical Systems Linear Algebra for AI/ML Scientific Machine Learning Research Reinforcement learning model predictive control Fine tuning of Generative AI models Autonomous navigation in rough terrain News and Announcements I am looking for motivated students in PSALM lab to work at the intersection of control and learning. We are working on both theoretical and empirical methods to develop new AI algorithms. We are upgrading our robotics and computational resources through grants and industry collaborations. My course on Scientific Machine Learning has been approved by the senate, which will be offered in spring 2026. I will be visiting Control and Cyber Physical Systems Laboratory in June 2025. I will talk about \"A tour of reinforcement learning from cart-pole to language models\" at NIT Patna. Our paper Deep Model Predictive Control with stability guarantees is accepted for publication in IEEE Transactions on Automatic Control. Thank you Thank you Dr. Manas Bera for inviting me for an expert talk on \"Model Predictive Control with data and distribution\" in the online STC & FDP, ACEOCPS-2025 organized by Dept. of Electrical Engineering, NIT Rourkela. Thanks to Dr. Amit Kumar Chowdhary and the organizers of BITCON-2024 for inviting me as a keynote speaker to talk on \"Safe interaction of an agent with the environment\" at the 2024 IEEE Flagship International BIT Conference-2024 (BITCON-2024) at BIT Sindri. Thanks to Prof. D. Debnath and Prof. R. S. Chakraborty for inviting me as a Meta-reviewer and session chair for IEEE INDICON 2024. Thanks to Prof. Shreya Matilal for moderating the Symposium on Epistemological Innovation Reconnaissance of the Contours of Legal Research Methodology and to Prof. Arindam Basu for inviting me as a resource person to speak on \"Computational legal research and artificial intelligence\". PSALM Lab PSALM (Predictive Stochastic Adaptive Learning Machines) Lab at IIT Kharagpur is focused on research at the intersection of control theory and Artificial Intelligence (AI). The real world applications of AI require safety guarantee and explainability of the AI module. In addition, several modules such as sensing and perception, planning and action need to interact to complete the feedback loop. Our main focus is in planning and decision making but we also consider sensing and actuation along with the effects of communication channels whenever required. Deep MPC This paper presents a deep learning-based model predictive control algorithm for control affine nonlinear discrete-time systems with matched and bounded state-dependent uncertainties of unknown structure. Since the structure of uncertainties is not known, a deep neural network (DNN) is employed to approximate them. In order to avoid any unwanted behavior during the learning phase, a tube-based nonlinear model predictive controller is employed, which ensures satisfaction of constraints and input-to-state stability of the closed-loop states. Algorithmic contributions We have developed several computationally tractable classes of policies. A moving horizon estimator developed by us exploits control-estimation duality. Our current focus is on theoretical deevelopments based on physics informed neural networks, neural operators, polynomial chaos theory.",
  "content_length": 3889,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:57"
}