{
  "name": "Prachet Bhuyan",
  "homepage": "https://cse.kiit.ac.in/profiles/prachet-bhuyan",
  "status": "success",
  "content": "Prachet Bhuyan - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Prachet Bhuyan Prachet Bhuyan Prachet Bhuyan Associate ProfessorDr.Prachet Bhuyan received his B.E in Computer Science & Engineering from Utkal University, Odisha. M.Tech with specialization in Computer Science & Engineering from VTU, Belgaum, Karnataka. Ph.D in Computer Science & Engineering from KIIT University, Bhubaneswar. He served in various capacities from Lecturer to Head of the department in Vemana Institute of Technology, Bangalore over a decade. Also he has served abroad at Caledonian College of Engineering (An affiliation of Glasgow Caledonian University), Muscat, Sultanate of Oman in teaching and research. He joined KIIT University from September 2007. He is also the member of Industry Engagement Cell (IEC) of KIIT University and Government recognized KIIT-TBI as executive committee member of TDB. He has various significant publications to his credit in leading Journals indexed in Scopus and International conferences. He has co-authored a Book titled “BigData-A Primer”, published by Springer. His areas of research interest are Software Engineering,SOA, Software Testing, Soft computing, Grid Computing, Data Analytics, Cloud Computing, Machine Learning and IoT. He has been member of various technical organizations like IEEE, IET, ISTE, ISC and he is a member of ISAET (International Scientific Academy of Engineering & Technology) in its Scientific Technical Committee and Editorial Board on Engineering and Technology. He has successfully guided many industry based students’ projects in collaboration with Microsoft, SAP Lab, Novell, IBM, Preva Systems, Unisys, and Cognizant. Guided 11 M.Tech thesis, many B.Tech projects and Ph.D thesis. He is active in consultancies and project guidance on various domains using IoT, such as projects in smart city, smart home, green building, smart greenhouse, smart municipality, smart health care, smart vehicle pollution control to name a few. He is a member of industry engagements spear heading industry academia activities. Profile LinksEmail :[email protected]Scopus Id :35145408900 Social LinksProfileRecent PublicationsProfileResearch InterestsSOA, IoT, Software Engg.Administrative Responsibility Associate Dean (T&P)Recent PublicationsJournals/Conferences :1.\tBandita Sahoo, Prachet Bhuyan, \"A selection approach in service composition of SOA\",International Conference on Recent Trends in Information Technology (ICRTIT), IEEE, (2016/4/8),2016. 2.\tPrachet Bhuyan, Abhishek Ray, Durga Prasad Mohapatra, \"A Service-Oriented Architecture (SOA) Framework Component for Verification of Choreography\", Book Title: Computational Intelligence in Data Mining - Volume 3, Sub Title: Proceedings of the International Conference on CIDM, 20-21 December 2014, DOI 10.1007/978-81-322-2202-6_3, Print ISBN 978-81-322-2201-9, Online ISBN 978-81-322-2202-6, Series Title: Smart Innovation, Systems and Technologies, Series Volume 33, Series ISSN 2190-3018, Pages pp 25-35, Springer India Publisher, 2015 3.\tPrachet Bhuyan, Abhishek Kumar, DP Mohapatra, \"SOA Testing Perspective Model for Regression Testing\", Nirma University International Conference on Engineering (NUiCONE), IEEE,ISSN:2375-1282, Print ISBN:978-1-4799-0726-7, DOI: 10.1109/NUiCONE.2013.6780096, pp 1-5, Nov 2015. 4.\tPrachet Bhuyan, Mousumi Rout, \"A Survey Report on Reliability Models and Frameworks in SOA\", International Journal of Advanced Research in Computer Science and Software Engineering, ISSN: 2277 128X, Volume 4, Issue 4, April 2014. 5.\tAkhilesh Kumar Pandey, Prachet Bhuyan, Durga Prasad Mohaptra, \"Component based Exception Handling Framework for SOA based Services\", International Conference on Computing, Communication and Networking Technologies (ICCCNT),IEEE,Print ISBN:978-1-4799-2695-4,DOI: 10.1109/ICCCNT.2014.6963118 , pp 1-5, July 2014. 6.\tPrachet Bhuyan, Akhilesh Kumar Pandey, Durga Prasad Mohapatra, \"Dynamic Fault Handling Model for Webservices\", International Conference on Computing, Communication and Networking Technologies (ICCCNT), IEEE, Print ISBN: 978-1-4799-2695-4,DOI: 10.1109/ICCCNT.2014.6963110, pp 1-4, July 2014 7.\tPrachet Bhuyan, Durga Prasad Mohapatra,\t\"Automatic Test Case Generation of SOA based System using Class Diagram\", Pensee Journal, Volume 76, Issue 4, pp 379-387, Apr-14, 2014. 8.\tMousumi Rout, Prachet Bhuyan, \"A Survey Report on Reliability Models and Frameworks in SOA\", International Journal of Advanced Research in Computer Science and Software Engineering, Volume 4, Issue 4, pp 857-862,Apr'14 2014. 9.\tChoudhury Bandana Das,Prachet Bhuyan, \"A Systematic Survey report on Various Frameworks and Models for Verification of Choreography in SOA\", International Journal of Computer Science & Engineering Technology (IJCSET), ISSN : 2229-3345, Vol. 5 No. 04, Apr 2014. 10.\tPrachet Bhuyan, Abhishek Kumar, \"Model Based Regression Testing Approach of Service-Oriented Architecture(SOA) based Application:A Case Study\", International Journal of Computer Science and Informatics Volume 3, Issue 2, RTST-2013, NIT Rourkela,pp 11 - 16, 2013. sachi2020-05-31T17:06:37+05:30 Page load link Go to Top",
  "content_length": 5240,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:58"
}