{
  "name": "Pradeep K. Khosla",
  "homepage": "http://chancellor.ucsd.edu/chancellor-khosla",
  "status": "success",
  "content": "About the Chancellor's Office Search This Site All UCSD Sites Faculty/Staff Search Term Close Nav About About Chancellor Khosla Messages from the Chancellor About the Chancellor’s Office Role of the Chancellor Past UC San Diego Chancellors Strategic Plan Cabinet Community Community Advisory Board Government and Community Relations Honors Chancellor’s Medal Revelle Medal Medal Nominations Contact Chancellor Event Requests Chancellor Meeting Requests HOME About About the Chancellor’s Office About the Chancellor’s Office The goal of the Chancellor’s Office is to support the Chancellor’s leadership of UC San Diego in fulfilling its mission of teaching, research and service to society. Responsibilities that fall within the Chancellor’s Office range from outreach to the San Diego community to fiscal management in accordance with UC and UC San Diego policies. The Chancellor’s unit includes: Chancellor’s Executive Office Geisel House Chancellor’s Business Office Campus Counsel Government and Community Relations Special Events and Protocol University Communications Office of Ethics & Compliance Executive Office Staff Kelly Kish Associate Chancellor and Chief of Staff (858) 822-4382 kkish@ucsd.edu The Associate Chancellor and Chief of Staff is a strategic advisor to the Chancellor and campus executive leadership team. A member of the Chancellor’s Cabinet, the Associate Chancellor and Chief of Staff provides oversight and leadership of institutional priorities on behalf of the Chancellor and the campus. The Associate Chancellor and Chief of Staff ensures collaboration across central reporting units, and represents UC San Diego with the Regents, UC System offices, and a variety of internal and external partners. Courtney Giordano Associate Chancellor (858) 333-1942 clgiordano@ucsd.edu The Associate Chancellor is a strategic advisor to the Chancellor and campus executive leadership team, leading or coordinating a wide range of complex activities, providing strategic counsel, and ensuring effective communication and coordination across key initiatives, including the university's strategic plan and special events. The Associate Chancellor is a member of the Chancellor’s Cabinet and represents the Chancellor before a variety of internal and external constituencies. Chandra Bandril Chancellor Initiatives Administrative Officer (858) 534-5840 cbandril@ucsd.edu The Chancellor Initiatives Administrative Officer serves as a primary partner with the Associate Chancellor/Chief of Staff and the Associate Chancellor in the execution of a wide range of activities involving interaction with campus senior leadership to further the Chancellor’s initiatives; handles sensitive and confidential projects and issues; leads and/or participates on policy and planning committees and working groups across campus; and provides strategy development for organizational or research initiatives. Jessica Brown Senior Director of Executive Communications jbbrown@ucsd.edu The Senior Director of Executive Communications develops a wide range of strategic communications on behalf of the Chancellor to broadly communicate the Chancellor's vision and initiatives to advance UC San Diego. This position provides high-level counsel to the Associate Chancellor and Chief of Staff, as well as the Associate Chancellor, regarding all aspects of the Chancellor's leadership and serves on the senior leadership team of the Chief Communications and Marketing Officer. The senior director drafts content to broadly communicate the Chancellor's vision, researches, writes, edits and catalogs remarks, and prepares speeches and presentations that are delivered by the chancellor to internal and external audiences. Cairo Williams Assistant Director of Executive Communications caw024@ucsd.edu The Assistant Director of Executive Communications manages incoming email correspondence for the Office of the Chancellor, and researches, drafts, edits and coordinates approvals for executive leadership content to broadly communicate the Chancellor's vision and initiatives that advance UC San Diego. Rosie Goldberg Executive Assistant to the Chancellor (858) 534-5335 m1goldberg@ucsd.edu The Executive Assistant to the Chancellor provides support and advice to the Chancellor on a wide range of issues involving the highest level of administrative work. This position serves as primary contact for the Chancellor, manages the Chancellor’s day-to-day schedule, plans and coordinates the Chancellor’s extensive travel schedule and undertakes unique special projects, as assigned by the Associate Chancellor/Chief of Staff on behalf of the Chancellor. Andrew Basom-Turpin Business Operations Coordinator (858) 534-9533 acbasomturpin@ucsd.edu The Business Operations Coordinator is primarily responsible for administering the day-to-day operations of the Chancellor’s immediate office and ensuring the orderly functioning of the unit. The position administers the financial operations, reconciles financial matters, and coordinates travel/meeting arrangements for executive staff. Geisel House Staff Christiana Gerber Honnet Assistant Director of Geisel House and Chancellor's Events (858) 822-5911 c1gerber@ucsd.edu The Assistant Director of Audrey Geisel University House is responsible for assisting in the overall operations and upkeep of this Registered Historical University property. Primary duties also include assisting in preparation efforts at Audrey Geisel University House before and after events, and activities sponsored or hosted by the Chancellor and/or the Associate of the Chancellor. Claire Hopkins Director of Geisel House and Chancellor's Events (858) 534-3774 cfhopkins@ucsd.edu The Director of Audrey Geisel University House and Chancellor's Events serves as the key liaison with the Special Events & Protocol Office in planning events hosted by the Chancellor.  This position is responsible for planning and managing the various events that take place at Audrey Geisel University House, as well as overseeing all day-to-day operations, maintenance, and upkeep of the property. Business Office Staff Aileen Serrano Director, Chancellor's Business Office (858) 534-1699 adserrano@ucsd.edu The Director has primary responsibility for the administrative operations of the Chancellor’s immediate office and its administrative units. Provides oversight and management on all aspects of human resources, budget and financial operations, business operations, space and facilities. Works closely with department leaders in strategic planning and implementation of departmental initiatives and programs. Directs and supervises the Chancellor’s Business Office. Jocelyn Pacheco Director, Business and Fiscal Affairs (858) 534-3993 jpacheco@ucsd.edu The Director is responsible for centralized resource analysis and business operations management for the Chancellor’s immediate office and its administrative units. Manages the operating budgets and oversees the implementation of protocols and guidelines to ensure that controls are in place for accurate reporting of the Chancellor’s Office and Audrey Geisel University House business activities. Alyssa Cunanan Lead Personnel & Financial Analyst (858) 534-8573 alcunanan@ucsd.edu The Lead Personnel & Financial Analyst serves as the central personnel resource for the Chancellor's immediate office and its administrative units as a seasoned, experienced professional resolving the full range of HR-related issues. Serves as a resource and point of contact for the administrative units on financial operations providing training, support and guidance. Vanessa Colin HR & Finance Operations Coordinator vacolin@ucsd.edu The HR & Finance Operations Coordinator oversees human resources and fiscal operations for the Chancellor’s immediate office and administrative units. This position is responsible for managing personnel, classification and compensation, recruitment, timekeeping, budget/financial actions, UCPath transactions, and serving as the Department Security Administrator (DSA). Campus Counsel Daniel W. Park Chief Campus Counsel (858) 822-1236 dpark@ucsd.edu Reporting to the Chancellor and to the Vice President for Legal Affairs & General Counsel, Dan is the chief attorney for the UC San Diego campus. Dan provides legal advice, retains outside counsel, manages litigation, reviews university policies, and works closely with other administrative offices to ensure legal compliance and to respond to disputes. Dan is a member of the Chancellor’s Cabinet and the UC General Counsel’s systemwide leadership team. Dennis Klein Associate Campus Counsel (858) 822-1236 dklein@ucsd.edu Kate Mangan Counsel kmangan@ucsd.edu About About Chancellor Khosla Messages from the Chancellor About the Chancellor’s Office Role of the Chancellor Past UC San Diego Chancellors",
  "content_length": 8822,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:59"
}