{
  "name": "Pradip K. Das",
  "homepage": "http://www.iitg.ernet.in/pkdas",
  "status": "success",
  "content": "Prof. Pradip K. Das - Personal Website Headlines Pradip K. Das Professor - Dept. of Computer Science & Engineering Head - Centre for Drone Technology Indian Institute of Technology Guwahati Office: H Block, Room No. H-106 Joined Institute: July 1998 Phone: +91 361 2582353 Email: pkdas@iitg.ac.in / hocdt@iitg.ac.in Google Scholar LinkedIn Explore Our Research Frontiers We are actively seeking motivated PhD students to join our team! Speech & Language AI Pioneering work in speech recognition (ASR), synthesis, and analysis. We have a strong focus on low-resource languages and challenging pathological speech. Current Researchers Ms. Ashita Batra (PhD) Deepjyoti Brahma (M.Tech) AI in Medicine Developing computer vision models for automated polyp detection in colonoscopies, analyzing sleep apnea, and building assistive technology. Current Researchers Mr. Himanshu Sharma (PhD) Rahul (M.Tech) Drones & Intelligent Robotics As Head of the Drone Centre, our work includes drone-based organ transport, precision agriculture, and voice-controlled navigation. Current Researchers Ms. Jayanthy V Venkat (PhD) Mr. Sanjoy Das (PhD) Digital Forensics & Security Ensuring digital trust by creating robust systems for image forgery detection, analyzing adversarial attacks, and securing digital media. Key Alumni Dr. Badal Soni (PhD) News & Announcements NEW COLLABORATION Speech Lab Collaborates with Sleep Therapeutics 2025 We are proud to announce a collaboration with Sleep Therapeutics. This partnership will generate a novel Sleep Study clinical dataset comprising Speech, Snoring, EEG, and ECG signals. This initiative will open new doors for young researchers planning to pursue research in the medical domain, specifically in sleep apnea and related disorders. INNOVATION AWARD Innovation Award at RIC 2025 Congratulations to Research Scholar Ms. Ashita Batra for being awarded the Innovation Award at the Research & Innovation Conclave (RIC) 2025. 2025 NEW MEMBER Welcome Dr. Loitongbam Sanayai Meetei The Speech Lab welcomes Dr. Loitongbam Sanayai Meetei, who has joined us as an Institute Post-Doctoral Fellow (IPDF). We look forward to his contributions to our ongoing research projects. Joined 2025 OPPORTUNITY Internship Opportunity: Winters 2025 Applications are now open for Research Internships for Winter 2025. Motivated students with a background in Signal Processing and Machine Learning are encouraged to apply. Apply Now BEST PAPER AWARD Best Paper Award at MIND 2024 Paper: \"DDSS: Detecting Different Types of Stuttered Speech of Multiple Speakers Exploiting Various Feature Extraction Techniques\" (Ashita Batra and Pradip K. Das). Dec 2024 Centre for Drone Technology Prof. Das has been appointed Head of the new Centre for Drone Technology at IIT Guwahati, focusing on agriculture, healthcare, and autonomous navigation solutions. Ongoing Awards & Recognition BEST PAPER AWARD Ashita Batra, Pradip K. Das. \"DDSS: Detecting Different Types of Stuttered Speech of Multiple Speakers Exploiting Various Feature Extraction Techniques.\" 6th International Conference on Machine Learning, Image Processing, Network Security and Data Sciences (MIND 2024). BEST PAPER AWARD Thiyam Susma Devi, Pradip K. Das. \"Development of ManiTo: A Manipuri Tonal Contrast Dataset.\" Third International Conference on Artificial Intelligence and Speech Technology (AIST 2021). BEST PAPER AWARD Shrinivasa Naika C.L, Pradip K Das, Shashi Shekhar Jha, Shivashankar B. Nair. \"Automatic Facial Expression Recognition using Extended AR-LBP.\" Sixth International Conference on Information Processing (ICIP-2012). Education University of Delhi Ph.D. in Computer Science Department of Computer Science 1999 University of Delhi M.Sc. Mathematical Statistics Ramjas College, New Delhi 1991 Gauhati University B.Sc. Statistics (Hons.) Arya Vidyapeeth College, Guwahati 1989 Experience Professor Indian Institute of Technology Guwahati May 2015 - Present Associate Professor Indian Institute of Technology Guwahati October 2008 - May 2015 Senior Lecturer/Assistant Professor Indian Institute of Technology Guwahati July 1998 - October 2008 Publications All Speech Medical Drones Security No publications found Try adjusting your search or filter criteria. Books and Book Chapters Medical AI GastroVision: A Multi-class Endoscopy Image Dataset for Computer Aided Gastrointestinal Disease Detection. Machine Learning for Multimodal Healthcare Data. ML4MHD 2023. Lecture Notes in Computer Science, vol 14315. Springer. Debesh Jha*, Vanshali Sharma*, MK Bhuyan, Pradip K Das, et al. Link to Book Chapter Security Image Copy-Move Forgery Detection - New Tools and Techniques. Springer, 2022. Badal Soni & Pradip K. Das Link to Book Security Privacy and Security Issues in Big Data: An Analytical View on Business Intelligence. Springer, 2021. Pradip Kumar Das, Hrudaya Kumar Tripathy, Shafiz Affendi Mohd Yusof Link to Book Security Copy–Move Attack Detection from Digital Images: An Image Forensic Approach. Smart Computing Paradigms: New Progresses and Challenges. Springer, 2020. Soni, B., Das, P.K., Thounaojam, D.M., Biswas, D. Link to Book Security An Efficient Block Phase Correlation Approach for CMFD System. Progress in Computing, Analytics and Networking. Springer, 2018. Badal Soni, Pradip K. Das, D. Meitei Thounaojam Link to Book Papers Published in Journals Speech AI Dysarthric Speech Detection and Severity Classification using Audio Spectrogram Transformer. Engineering Letters, vol. 33, no. 6, 2025. Komal Bharti, Sandeep Agri and Pradip K. Das Link to paper Speech AI Multi Model Telugu Speech Signal Analysis Towards Controlling Home Appliances. IAENG International Journal of Computer Science, vol. 52, no. 7, 2025. Parabattina Bhagath, et al. Link to paper Security RobustFace: a novel image restoration technique for face adversarial robustness improvement. Multimedia Tools and Applications, 2024. Chiranjeevi Sadu, Pradip K. Das, et al. Link to paper Speech AI Hindi spoken digit analysis for native and non-native speakers. IAES International Journal of Artificial Intelligence (IJ-AI), 2024. Parabattina Bhagath, Shanmukha M, Pradip K Das Link to paper Medical AI A Multi-Scale Attention Framework for Automated Polyp Localization and Keyframe Extraction From Colonoscopy Videos. IEEE Transactions on Automation Science and Engineering, 2024. V. Sharma, P. Sasmal, M. K. Bhuyan, P. K. Das, et al. Link to paper Speech AI Disambiguation of Isolated Manipuri Tonal Contrast Word Pairs Using Acoustic Features. ACM Trans. Asian Low-Resour. Lang. Inf. Process., 2024. Thiyam Susma Devi and Pradip K. Das Link to paper Medical AI A DWT-Based Encoder-Decoder Network for Specularity Segmentation in Colonoscopy Images. Multimed Tools Appl, 2023. Vanshali Sharma, M.K. Bhuyan, Pradip K. Das, Kangkana Bora Link to paper Security Geometric Transformation Invariant Block based Copy-move Forgery Detection using Fast and Efficient Hybrid Local Features. Journal of Information Security and Applications, Elsevier, 2019. Badal Soni, Pradip K. Das and Dalton Meitei Thounaojam Link to paper Security Dual System for Copy-move Forgery Detection using Block-based LBP-HF and FWHT Features. Engineering Letters, 2018. Badal Soni, Pradip K. Das and Dalton Meitei Thounaojam Link to paper Security Keypoints based enhanced multiple copy-move forgeries detection system... IET Journal of Image Processing, 2018. Badal Soni, Pradip K. Das, D. Meitei Thounaojam Link to paper Speech AI i-Vectors in Speech Processing Applications: A Survey. International Journal of Speech Technology (IJST), Springer, 2015. Pulkit Verma, Pradip K. Das Link to paper Papers Published in Proceedings of Conferences Drones Optimally designed high-efficiency drone-based spray system for precision nutrient delivery in agricultural farms. 3rd International Conference on Agriculture-Centric Computation 2025 (ICA2025), IIT Guwahati. Sudhakar Kanaujia, Vaishali Gangwar, Ajay Dashora and Pradip Kumar Das Drones A model based comparative study for conventional and drone based farming: Case studies from India. 3rd International Conference on Agriculture-Centric Computation 2025 (ICA2025), IIT Guwahati. K Shiva Sankar, Ajay Dashora and Pradip Kumar Das Speech AI Boli: A dataset for understanding stuttering experience and analyzing stuttered speech. ICASSP 2025. Ashita Batra, Mannas Narang, Neeraj Kumar Sharma and Pradip K. Das Speech AI Exploring Whisper Embeddings for Stutter Detection: A Layer-Wise Study. EUSIPCO 2025. Ashita Batra, Barjesh Kar and Pradip K. Das Speech AI Does Data Balancing Impact Stutter Detection and Classification? ICDCIT 2025. Lecture Notes in Computer Science, vol 15507. Ashita Batra, Pratyush Shrivastava and Pradip K. Das Link to paper Medical AI Sleep Apnea Detection through Spectral Signatures of Snoring: An MFCC-Based Approach. MIND-2024. Himanshu Sharma and Pradip K. Das Speech AI Speech Signal Analysis Using Fractal Geometry for Phoneme Boundary Detection. TENCON 2024. P. Bhagath, S. R. Chindam, M. Shanmukha and P. K. Das Medical AI ControlPolypNet: Towards Controlled Colon Polyp Synthesis for Improved Polyp Segmentation. CVPR 2024. Vanshali Sharma, Abhishek Kumar, Debesh Jha, et al. Speech AI Development of ManiTo: A Manipuri Tonal Contrast Dataset. AIST 2021 (Best Paper Award). Thiyam Susma Devi, Pradip K. Das Security A Detection Method for Copy-Move Forgery Attacks in Digital Images. IEEE TENCON 2022. Chiranjeevi Sadu and Pradip K. Das Security A Defense Method Against Facial Adversarial Attacks. IEEE TENCON 2021. Chiranjeevi Sadu and Pradip K. Das Speech AI Phoneme Boundary Analysis using Multiway Geometric Properties of Waveform trajectories towards Low Resource Languages. 1st Joint SLTU and CCURL Workshop, 2020. P. Bhagath, Pradip K. Das Previous Page 1 of 1 Next Projects & Consultancies Sponsored Projects Prototyping Drone Carried Organ Payload Container Sponsoring Agency: Indian Council of Medical Research (ICMR), New Delhi Status: Ongoing | Designation: Co-P",
  "content_length": 25442,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:02"
}