{
  "name": "Pradeep K. Atrey",
  "homepage": "http://www.cs.albany.edu/~patrey",
  "status": "success",
  "content": "Dr. Pradeep Atrey Home Research Publications Teaching Professional activities What else I do? Dr. Pradeep K. Atrey [Brief bio] [Full CV] Associate Professor and Director of Undergraduate Studies Co-Director, Albany Lab for Privacy and Security (ALPS) Department of Computer Science College of Nanotechnology, Science, and Engineering University at Albany, State University of New York (SUNY) UAB 421, 1215 Western Avenue, Albany, NY 12222, USA, The Earth, The Universe Phone: 518-437-4943, Fax: 518-442-5638 Email: first letter of first name plus last name at albany dot edu Affiliated Faculty, AI Plus Institute, University at Albany Faculty Fellow, Center for Technology in Government (CTG UAlbany) What's new [05/2025] Our paper titled \" Spotting the Fakes: A Deep Dive into GAN-Generated Face Detection\" has been accepted at ACM Transactions on Multimedia Computing Communications and Applications. [04/2025] Prof. Pradeep Atrey delivered a Keynote talk on \"AI Behind the Cipher: Multimedia Intelligence in Encrypted Spaces\" at the AICON'25 conference. [04/2025] Noah Levine, an undergraduate researcher in Prof. Pradeep Atrey's group received the Presidential Award for Undergraduate Research. [04/2025] Prof. Pradeep Atrey received the Dean's Award for Excellence in Service to Students. [03/2025] Our paper titled \"Generating Higher-Quality Anti-Forensics DeepFakes with Adversarial Sharpening Mask\" has been accepted at ACM Transactions on Multimedia Computing Communications and Applications. [12/2024] Prof. Pradeep Atrey has been recognized among the World's Top 2% Researchers, as per a Stanford University study, and is one of UAlbany's 42 researchers, including three from the Computer Science Department. For details, click here. For past news, click here. Education [More details] - Ph.D. (Computer Science), School of Computing, National University of Singapore (2006). (Ranked among top 6 schools in the world in computer science as per the QS World University Rankings 2024) Research Interests [More details] [Google Scholar Profile] Motive: My scholarly endeavors are driven by principle of “Science in Service to Society.\" Current focus: My current research interests are at the intersection of cybersecurity, privacy, trust, and fairness, with a focus on multimodal data. Current Research Students \t[Former students] - Sharmilee Rajkumar -- (Ph.D. Student) [Topic: Multimedia Forensics] - Irien Akter (Ph.D. Student) [Topic: Toxicity Detection] - Athulya Mathew (MS Student) [Topic: Large Language Models] - Ryan McSweeney (Undergraduate Student) [Topic: Location-privacy driving monitoring] - Neal Mann (High School Intern) [Topic: Location-privacy driving monitoring] - Ahana Gandhi (High School Intern) [Topic: Image Forensics] Recent Ph.D. Graduates - Omkar Kulkarni (Ph.D., 2024) [Bias-Aware Gaze Uniformity Assessment in Group Images] (Currently a Machine Vision Engineer at Sakar Robotics, Pune, India) - Shashank Arora (Ph.D., 2022) [Frameworks for Secure Collaborative and Concurrent Editing] (Currently a Professor of Practice at University at Albany, State University of New York) - Oguz Aranay (Ph.D., 2022) [Deep Active Genetic with Evidential Uncertainty for Agriculture Crops and Water Quality Assessment] (Currently, a faculty at University at Kirkuk, Iraq) Recent Publications [Full list of publications] - I. Akter, V.K. Singh, and P. K. Atrey. Forecasting “Neg Storms”: Time-aware modeling of toxic situations in social media. ISM'25: IEEE International Symposium on Multimedia, Naples, Italy, December 2025. - S. Rajkumar Rajan, M.-C. Chang, and P. K. Atrey. Physics-guided exposure parameter estimation for image metadata verification. ISM'25: IEEE International Symposium on Multimedia,Naples, Italy, December 2025. - X. Wang, T.-Y. Tsai, L. Lin, H. Guo, S. Hu, M-C. Chang, P. K. Atrey, S. Lyu. Spotting the Fakes: A Deep Dive into GAN-Generated Face Detection. ACM Transactions on Multimedia Computing Communications and Applications (Just Accepted, June 2025). - B. Fan, F. Ding, G. Zhu, J. Huang, S. Kwong, P. K. Atrey, S. Lyu. Generating Higher-Quality Anti-Forensics DeepFakes with Adversarial Sharpening Mask. ACM Transactions on Multimedia Computing Communications and Applications (Just Accepted, April 2025). - O. Kulkarni, A. Mishra, S. Arora, V. K. Singh, and P. K. Atrey. LivePics-24: A multi-person, multi-camera, multi-settings live photos dataset. MIPR'24: IEEE International Conference on Multimedia Information Processing ad Retrieval, San Jose, CA, USA, August 2024. - O. Kulkarni, T. Lloyd-Jones, M. Tran, G. Vincent Jr, V. K. Singh, and P. K. Atrey. Where you look matters in group photos: A demo of GARGI iOS app. MIPR'24: IEEE International Conference on Multimedia Information Processing ad Retrieval, San Jose, CA, USA, August 2024. - V. Patil, S. R. Rajan, and P. K. Atrey. GeoSecure-B: A method for secure bearing calculation. MIPR'24: IEEE International Conference on Multimedia Information Processing ad Retrieval, San Jose, CA, USA, August 2024. Recent Professional Activities [Past professional activities] Editorial Boards - [2012-present] Associate Editor for ACM Trans. on Multimedia Computing, Communications and Applications. - [2010-present] Editor for the Wiley ETRI Journal. - [2019-2024] Associate Editor for IEEE Trans. on Multimedia. - [2016-2024] Associate Editor for Elsevier Signal Processing: Image Communication Journal. Conference Organization - Workshop Co-Chair, MIPR'25: IEEE International Conference on Multimedia Information Processing and Retrieval, San Jose, CA, USA, August 2025. - Area Chair, ICME'25: IEEE International Conference on Multimedia and Expo, Nantes, France, June-July 2025. - Program Co-chair, ICDSAIA'25: International Conference on Data Science, AI and Applications, Dhaka, Bangladesh, July 2025. - TPC Member, ICA'25: The 3rd International Conference on Agriculture-Centric Computation, Ropar, India, May 2025. - Program Co-chair, AICON'25: 5th International Conference on Artificial Intelligence for Communications and Networks, New Delhi, India, January 2025. Teaching [Past teaching] Fall 2025 ICSI-499 Capstone Project in Computer Science Awards & Honours - Prof. Pradeep Atrey received the Dean's Award for Excellence in Service to Students. Click here for photo. - Prof. Pradeep Atrey has been recognized among the World's Top 2% Researchers, as per a Stanford University study, and is one of UAlbany's 42 researchers, including three from the Computer Science Department. For details, click here. - Recognized for Outstanding Contributions as Technical Program Chair at the 31st ACM Int. Conf. on Multimedia (ACMMM23) in Ottawa, Canada. Click here for photo. - Outstanding Area Editor Award for service at the Signal Processing: Image Communication Journal (2022). Click here for photo. - Best Paper Award: GeoSecure-R: Secure computation of geographical distance using region-anonymized GPS data. The Sixth IEEE International Conference on Multimedia Big Data (BigMM) (2020). Click here for photo. - Plaque of Appreciation on completing 10 years of service on the editorial board of ETRI Journal. Click here for photo. - Outstanding Service Award for service at the 2017 IEEE SMC Conference. [photo] (2018) - Best Paper Award: Browshing: A new way of phishing using a malicious browser extension. IEEE Int. Conf. on Innovations in Power and Advanced Computing Technologies (i-PACT'17), Vellore, India (2017) - IEEE Comm. Soc. MMTC Best R-Letter Editor Award (2015) [Photo] - ACM TOMM Associate Editor of the Year (2015) [Award ceremony video] - Multimedia Rising Star at the ACM SIGMM Inaugural Workshop on Multimedia Frontiers (2015) - Erica and Arnold Rogers Award for Excellence in Research and Scholarship (2014) - UWinnipeg President's Merit Award for Exceptional Performance (2012-13) - IEEE ICME Outstanding Organizing Committee Member (as Publicity Chair) (2013) - UWinnipeg President's Merit Award for Exceptional Performance (2011-12) - UWinnipeg President's Merit Award for Exceptional Performance (2009-10) - Best Editor Award (2012), ETRI Journal - Best Reviewer Award (2009), ETRI Journal - IEEE ICME Quality Reviewer Recognition (2011) Media Coverage - [12/2024] UAlbany News: Prof. Atrey has been recognized among the World's Top 2% Researchers, as per a Stanford University study, and is one of UAlbany's 42 researchers, including three from the Computer Science Department. For details, click here. - [10/2024] UAlbany News: Prof. Atrey and his team's research on Gaze Uniformity in Group Photos was featured in UAlbany News. Click Researchers Utilize AI to Improve Group Photos for details. - [12/2018] NPR (WAMC) - Academic Minutes: Prof. Atrey appeared on NPR (WAMC) - Academic Minutes and talked about a new way to fight fake news. To listen, click \"here\". - [07/2018] UAlbany News: Prof. Atrey and his student Vikram Patil were featured in UAlbany News \"A Safer Way to Share Your Location\" featuring their recent work on GPS location privacy. - [06/2018] UAlbany News: Prof. Atrey and his student Shivam Parikh were featured in UAlbany News \"Fake News Detector\" featuring their recent work on fake news detection research. - [02/2018] Experian: Prof. Atrey offered his insight in an article \"Fighting Back Against Tax ID Fraud\" on experian.com, about the importance of keeping different passwords for different accounts. - [02/2018] UAlbany News: Prof. Atrey was featured in UAlbany News \"Protect Yourself: February is Data Privacy Month, a Good Reminder to Check Your Online Security\" offering his advice on identity theft protection. - [08/2017] BYU Radio: Prof. Atrey appeared on the Matt Townsend show of BYU Radio and talked about modern ATM security. Here is the interview. - [06/2017] The Conversation US: Prof. Atrey weighs in on security issues and concerns of modern ATMs as they turn fifty. Read his article in The Conversation US. - [04/2017] CSOonline: Tech journalist John Brandon, quotes Prof. Pradeep Atrey in his article titled \"How to",
  "content_length": 10772,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:59"
}