{
  "name": "Pradeep Sen",
  "homepage": "https://www.ece.ucsb.edu/~psen",
  "status": "success",
  "content": "Pradeep Sen Homepage Pradeep Sen Professor UCSB MIRAGE Lab Director, UCSB Gaucho Game Lab Dept. of Electrical & Computer Engineering University of California, Santa Barbara Santa Barbara, CA 93106-9560 psen at ece ucsb edu Ph.D., Stanford University, 2006 M.S., Stanford University, 1998 B.S., Purdue University, 1996 office: Harold Frank Hall 5117 telephone: 805-893-4265 fax: 805-893-3262 email: psen at ece ucsb edu availability: my calendar is here Welcome to my homepage! I'm the Director of the UCSB Gaucho Game Lab, the video game development program at UC Santa Barbara. I also help run the UCSB MIRAGE Lab to conduct research in computer graphics, imaging, visualization, and computer vision. I graduated with a Ph.D. in Electrical Engineering from the Graphics Lab at Stanford University, where my adviser was Pat Hanrahan. Professional Bio Pradeep Sen is a Professor in the UCSB MIRAGE Lab in the Department of Electrical and Computer Engineering at the University of California, Santa Barbara. He attended Purdue University from 1992 - 1996, where he graduated with a B.S. in Computer and Electrical Engineering. He then attended Stanford University where he received his M.S. in Electrical Engineering in 1998 in the area of electron-beam lithography. In 2000, he joined the Stanford Graphics Lab where he did research on real-time rendering and computational photography. He received his Ph.D. in Electrical Engineering in June 2006, advised by Dr. Pat Hanrahan. His research interests include algorithms for image synthesis, computational image processing, and computational photography, and he is a co-author of over 50 technical publications, including more than ten SIGGRAPH/SIGGRAPH Asia/ToG publications. Dr. Sen has been awarded more than $2.2 million in research funding, including an NSF CAREER award in 2009. Personal Bio Pradeep Sen was born in a small petroleum town in Northern Mexico and moved to Mexico City (Mexico D.F.) with his family when he was a young boy. He was raised in Mexico City until his family immigrated to the United States and settled in South Bend, IN. A proud Mexican-American, Dr. Sen is passionate about DEI and is involved in various activities on campus. He currently lives in Goleta, CA with his wife and two children. Selected Awards/Honors Symposium on Computer Animation (SCA) Best Paper Award (2016) High Performance Graphics (HPG) Best Paper Finalist (2015) CVPR 2015 Outstanding Reviewer Award (2015) Videogame development program at University of New Mexico (UNM) ranked in the top 10 by the Princeton Review (2012) University of New Mexico (UNM) Dept. of Electrical and Computer Engineering Distinguished Researcher Award (2012) National Science Foundation CAREER award (2009) NVIDIA Graduate Fellowship (2004) SIGGRAPH/Eurographics Graphics Hardware Conference Best Paper Award (2004) SIGGRAPH/Eurographics Graphics Hardware Conference Best Paper Award (2002) Research Interests My research interests are in the area of rendering/image synthesis and computational image processing. I study novel rendering algorithms to accelerate global illumination, as well as image-based techniques for capturing light transport. I am also interested in real-time rendering and graphics hardware. On the computational image processing side, I am interested in novel imaging architectures as well as new ways to combine processing and acquisition to capture new kinds of imagery. Current Students At UCSB, I have the pleasure of working with many great graduate students: Steve Bako -- B.S., University of California, Berkeley Abhishek Badki -- B.S., National Institute of Technology (NIT) India Ekta Prashnani -- B.S., Indian Institute of Technology (IIT) Gandhinagar, India. Qiaodong Cui -- B.S., Beihang University, China Ehsan Sayyad -- B.S., Sharif University, M.F.A, Sharif University of Tehran, Iran Trevor Morris -- B.S., University of California, Santa Barbara Shayan Sadigh -- B.S., University of California, Santa Barbara Adam Schmidt -- B.S., University of California, Santa Barbara I am also looking for a several more Ph.D. students who are interested in computer graphics, computer vision and image processing. If you want to work in these areas of research, applications can be found here. Former Students Over the years, I have had the pleasure of working with some truly remarkable students. Here is a list of students who have graduated under my supervision: Former Ph.D. Students (main advisor): Dr. Soheil Darabi, Ph.D. August 2012 (currently Senior Computer Scientist at Adobe) Dr. Nima Khademi Kalantari, Ph.D. December 2015 (currently Assistant Professor, Dept. of Computer Science, Texas A&M) Former Ph.D. Students advised (thesis committee): Dr. Victor Fragoso, Ph.D. December 2014 (currently Assistant Professor, University of West Virginia) Dr. Chris Sweeney, Ph.D. April 2008 (currently Postdoctoral Scholar at University of Washington) Former Masters Students: Mark Waligora, M.S. April 2008 (currently at Blizzard Entertainment) Mauricio Gomez, M.S. July 2012 (currently at Disney) Lei Xiao, M.S. July 2012 (Ph.D. from University of British Columbia 2017, currently at Facebook Reality Labs) Jon Waltman, M.S. 2014 (currently at Toyon Research) Chieh-Chi Kao, M.S. 2017 (currently at Amazon Research) Yuxiang Wang, M.S. 2018 (currently at Pinterest) Research Funding Current grants: CGV: Small: A Patch-based Framework for Capturing a World in Motion, Principal Investigator: P. Sen. Funded by the National Science Foundation (NSF). Oct. 1, 2013 - Sept. 30, 2016. Amount: $499,719. [ NSF website ] CAREER: A Framework for Sparse Signal Reconstruction for Computer Graphics, Principal Investigator: P. Sen. Funded by the National Science Foundation (NSF). Jun. 1, 2009 - May 31, 2014. Amount: $495,513. [ NSF website ] Previous grants: PFI: A Consortium for Fulldome and Immersive Technology Development, Principal Investigator: P. Sen, Co-PI's: E. Angel, D. Beining, A. Filemyr, A. Maji. Funded by the National Science Foundation (NSF). Mar. 1, 2010 - Aug. 10, 2012. Amount: $597,220. [ NSF website ] MRI: Acquisition of a GPU-Accelerated Parallel Supercomputer for Computational Science and Engineering Research at the University of New Mexico, Principal Investigator: S. Atlas, Co-PI's: H. Guo, P. Sen, J. Simpson, T. Thomas. Funded by the National Science Foundation (NSF). Sep. 1, 2010 - Aug. 10, 2012. Amount: $435,077. [ NSF website ] An augmented-reality display system for visualization and training (first-year proposal), Principal Investigator: P. Sen. Funded by Sandia National Laboratories. Oct. 1, 2007 - Sep. 30, 2008. Amount: $40,000. An augmented-reality display system for visualization and training (second-year extension), Principal Investigator: P. Sen. Funded by Sandia National Laboratories. Oct. 1, 2008 - Sep. 30, 2009. Amount: $40,000. Thinking Outside the Dome, Principal Investigator: P. Sen, Co-PI's: E. Angel, J. Kniss. Funded by the National Science Foundation (NSF). Aug. 1, 2009 - Oct. 31, 2009. Amount: $20,000. [ NSF website ] Total amount awarded as PI or Co-PI: $1,627,810 ($1,192,733 as lead PI) Teaching Here are some of the courses I have taught, along with their semester/quarter (sorted in descending order by the number of times taught): Advanced Image Synthesis (F08, F11, W13, W14, W15, W16, S17) Introduction to Computer Graphics (F07, F08, F09, F10, F14, W17) Computer Vision (S08, S09, S10, S11) Introduction to Video Game Development (F09, F10, F11) Probability and Statistics (S14, S15, S16) Image Processing (F15,F16) Advanced Video Game Development (S10, S11) Advanced Image Processing (S12, S13) Mobile Application Development (F09) Real-Time Rendering and Graphics Hardware (S07) Foundations of Computing (F07) ACM SIGGRAPH/SIGGRAPH Asia/Transactions on Graphics Publications The ACM SIGGRAPH and SIGGRAPH Asia conferences, along with the associated ACM Transactions on Graphics journal are the top venues for publishing technical research in computer graphics. Scalable Laplacian Eigenfluids Qiaodong Cui, Pradeep Sen, Theodore Kim ACM Transactions on Graphics, Vol. 37, No. 4, July 2018, (Proceedings of ACM SIGGRAPH 2018) [pre-print] [project page] Computational Zoom: A Framework for Post-Capture Image Composition Abhishek Badki, Orazio Gallo, Jan Kautz, Pradeep Sen ACM Transactions on Graphics, Vol. 36, No. 4, July 2017, (Proceedings of ACM SIGGRAPH 2017) [pre-print] [project page] Kernel-Predicting Convolutional Networks for Denoising Monte Carlo Renderings Steve Bako*, Thijs Vogels*, Brian McWilliams, Mark Meyer, Jan Novak, Alex Harvill, Pradeep Sen, Tony DeRose, and Fabrice Rousselle (* joint first authors) ACM Transactions on Graphics, Vol. 36, No. 4, July 2017, (Proceedings of ACM SIGGRAPH 2017) [pre-print] [lo-res pdf] [project page] A Machine Learning Approach for Filtering Monte Carlo Noise Nima Khademi Kalantari, Steve Bako, and Pradeep Sen ACM Transactions on Graphics, Vol. 34, No. 4, July 2015, (Proceedings of ACM SIGGRAPH 2015) [pre-print] [lo-res pdf] [project page] Patch-Based High Dynamic Range Video Nima Khademi Kalantari, Eli Shechtman, Connelly Barnes, Soheil Darabi, Dan B Goldman, and Pradeep Sen ACM Transactions on Graphics, Vol. 32, No. 6, November 2013, (Proceedings of ACM SIGGRAPH Asia 2013) [pdf] [lo-res pdf] [bibtex] [project page] Robust Patch-Based HDR Reconstruction of Dynamic Scenes Pradeep Sen, Nima Khademi Kalantari, Maziar Yaesoubi, Soheil Darabi, Dan B Goldman, and Eli Shechtman ACM Transactions on Graphics, Vol. 31, No. 6, November 2012, (Proceedings of ACM SIGGRAPH Asia 2012) [pdf] [lo-res pdf] [bibtex] [project page] Image Melding: Combining Inconsistent Images using Patch-Based Synthesis Soheil Darabi, Eli Shechtman, Connelly Barnes, Dan B Goldman, and Pradeep Sen ACM Transactions on Graphics, Vol. 31, No. 4, July 2012, (Proceedings of ACM SIGGRAPH 2012) [pdf] [bibtex] [project page] On Filtering the Noise from the Random Parameters in Monte Carlo Rendering Pradeep Sen and Soheil Darabi ACM ",
  "content_length": 27603,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:03"
}