{
  "name": "Pradeep Kumar Murukannaiah",
  "homepage": "https://ii.tudelft.nl/~pradeep",
  "status": "success",
  "content": "Pradeep Kumar Murukannaiah I am an Associate Professor in the Interactive Intelligence group (II/INSY/EEMCS) at TU Delft. I co-direct the Hippo lab, a Delft AI lab on AI for fair, efficient, and interpretable analysis of climate policies. I also hold lead roles—Use Cases Coordinator, Diversity Co-Chair, and (previously) Explainable HI Research Line Coordinator— in the Hybrid Intellgence center. Additionally, I am a Master Coordinator for MSc in Data Science and Artificial Intelligence Technology (DSAIT). I received a PhD in Computer Science (2016) from North Carolina State University. Prior to TU Delft, I have been an Assistant Professor at Rochester Institute of Technology (2017â2019), an intern at Google, and Software Engineer at Alcatel-Lucent. Pradeep Kumar Murukannaiah Van Mourik Broekmanweg 6 2628 XE Delft, The Netherlands Building 28, Room W4.800 p.k.murukannaiah at tudelft dot nl My research aims to support societal dialog and decision making on complex issues such as climate change. I pursue this endeavor by investigating Hybrid Intelligence (HI) methods, where Artificial Intelligence (AI) techniques support humans in multi-stakeholder deliberations and multi-objective decision making. Accordingly, my works seek to make fundamental contributions to AI along three research lines. Research Thrust Overarching Goal Example Topics Natural Language Processing (NLP) To facilitate effective stakeholder deliberations Argument mining, value alignment, claim analysis (fact checking) Multi-Agent Systems (MAS) To support multi-stakeholder, multi-objective, decisions Engineering MAS, negotiation, social choice, multi-objective RL Hybrid Intelligence (HI) To enable human-AI synergy in decision making Co-active design, social norms, responsible autonomy Cross-cutting these research lines, my works emphasize two key concepts important for deliberations and decision making: Values, representing what is important to a stakeholder, and norms, representing what stakeholders expect from each other. When put together, my research lines yield a truly sociotechnical system, i.e., a micro-society in which humans interact, make decisions, and stay accountable to each other, and AI agents augment human intelligence, e.g., by recognizing patterns in large datasets and providing recommendations, as shown below. Read more about my academic vision.",
  "content_length": 2369,
  "method": "requests",
  "crawl_time": "2025-12-01 14:12:59"
}