{
  "name": "Pradip Kumar Sharma",
  "homepage": "https://www.abdn.ac.uk/people/pradip.sharma",
  "status": "success",
  "content": "Dr Pradip Sharma | The University of Aberdeen Dr Pradip Sharma Dr Pradip SharmaSenior Lecturer Accepting PhDs About Email Addresspradip.sharma@abdn.ac.ukOffice Address 228 Meston BuildingOld Aberdeen CampusMeston Walk AB24 3UEView on Map School/DepartmentSchool of Natural and Computing Sciences Google ScholarLinkedinPurePersonal Website Biography Dr. Pradip Sharma, SMIEEE, SFHEA, is a globally recognised academic and researcher in Cybersecurity and Artificial Intelligence. As Associate Professor of Cybersecurity & AI at the University of Aberdeen, UK, he leads pioneering research and educates the next generation of cybersecurity professionals. Holding a PhD in Cybersecurity and an M.Tech in Computer Science, Dr. Sharma brings a unique blend of academic excellence and industry experience, having previously served as a Research Fellow and Software Engineer. A Senior Member of IEEE and Senior Fellow of Advance HE, Dr. Sharma is a thought leader in the global research community. Dr. Sharma serves as an editor for leading journals and is a regular keynote speaker and program chair at international conferences. His educational leadership includes spearheading innovative cybersecurity curricula and supervising a diverse cohort of doctoral researchers. With a portfolio exceeding £1M in funded research from EPSRC, Innovate UK, and international agencies, his work fosters interdisciplinary collaboration and drives impactful solutions to global security challenges. External Memberships Senior Fellowship Advance HE (SFHEA) IEEE Senior Member (SMIEEE) Latest Publications SoK: Towards Privacy-Centric Collaborative Machine Learning—A Classification Framework for Privacy Solutions 2025 - Accepted/In pressBoar, P. E., Akram, R. N., Li, W., Sharma, P. K. SN Computer ScienceContributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s42979-025-04482-4An Unsupervised Malicious Web Request Detection based on Transformer and Contrastive Learning 2025 - PublishedHe, S., Zhang, Y., Liang, D., Sharma, P. IEEE Transactions on Network and Service Management, vol. 22, no. 4, pp. 3281-3294Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TNSM.2025.3563089[ONLINE] View publication in ScopusGpDB: A Graph Partition Based Storage Strategy for DAG-Blockchain in Edge-Cloud IIoT 2025 - PublishedLiao, Z., Cheng, S., Zhang, J., Wu, W., Sharma, P. K. IEEE Transactions on Industrial Informatics, vol. 21, no. 8, pp. 5790-5798Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TII.2022.3162201[ONLINE] View publication in ScopusCan Image Quality Assessment Help Medical Image Segmentation? 2025 - Accepted/In pressLawal, M., Sharma, P., Murchie, P., Yi, D. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsMinecrafter: A secure and decentralized consensus protocol for blockchain-enabled vaccine supply chain 2025 - PublishedMaloth, S., Hada, N. S., Jatoth, C., Gupta, N., Fiore, U., Sharma, P. K. Peer-to-Peer Networking and Applications, vol. 18, no. 4, 168Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s12083-025-01980-3[ONLINE] View publication in Scopus View My Publications Research Research Overview Research interests: Cybersecurity, Blockchain, Edge Computing, Software-defined Networking, IoT Security Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Supervising Accepting PhDsView Research Area Research Specialisms Computer and Information SecurityComputer NetworksMachine LearningApplied ComputingCybernetics Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Funding and Grants 2025-2026            “Oil & Gas Cyber Benchmarking,” Nuclear Decommissioning Authority, £26K (PI) 2025-2028            “Digital Guardian: AI-Powered Shield Against Highly Sophisticated AI based Phishing Attacks,” International Doctoral Training Scholarship, £37K (Co-I) 2024-2026            “Secure, Privacy-aware, and Trusted Data Share in Smart Mobility,” EPSRC, £200K (PI) 2024-2025            “ZECURE Data Exchange Platform - Net Zero Mobility,” Innovate UK, £236K (PI) 2023-2026            “Quantum-resistant Cybersecurity,” International Doctoral Training Scholarship, £73K (PI) 2022-2023            “Secure and Privacy-aware Data Share in Smart Mobility,” Pump-Prime Interdisciplinary Research and Impact, £2K (PI) 2022-2023            “Distributed Big-data Service Framework based on Blockchain and Machine Learning for Smart Cities,” 2022 High-end Foreign Expert in China, £20K (PI) 2020-2022            “Development of Simulator for Virtual Learning,” Agency for Defence Development, £270K (Co-I) 2016-2019            “Developing a Green Smart Home Security Framework for Next Generation IoT Environment,”  National Research Foundation (NRF), £200K (Investigator) 2016-2019            “WellTEC Coaching Service and Content Development for Wellness Life,” Consortium Information Technology Research Center (C-ITRC), £16K (Investigator) 2016-2018            “Development of an immersive and interactive NUI/NUX Platform for Invoked Reality Contents,”  Institute for Information and Communications Technology Promotion (IITP), £5K (Investigator) Teaching Courses Distributed Systems and Security CS3524Security in Emerging Networks CS502BDigital Forensics and Incident Management CS552EInformation Security CS5099Distributed Systems And Security CS4595Blockchain and Smart Contracts CS552P Publications Page 1 of 12 Results 1 to 10 of 120 SoK: Towards Privacy-Centric Collaborative Machine Learning—A Classification Framework for Privacy Solutions 2025 - Accepted/In pressBoar, P. E., Akram, R. N., Li, W., Sharma, P. K. SN Computer ScienceContributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s42979-025-04482-4An Unsupervised Malicious Web Request Detection based on Transformer and Contrastive Learning 2025 - PublishedHe, S., Zhang, Y., Liang, D., Sharma, P. IEEE Transactions on Network and Service Management, vol. 22, no. 4, pp. 3281-3294Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TNSM.2025.3563089[ONLINE] View publication in ScopusGpDB: A Graph Partition Based Storage Strategy for DAG-Blockchain in Edge-Cloud IIoT 2025 - PublishedLiao, Z., Cheng, S., Zhang, J., Wu, W., Sharma, P. K. IEEE Transactions on Industrial Informatics, vol. 21, no. 8, pp. 5790-5798Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TII.2022.3162201[ONLINE] View publication in ScopusCan Image Quality Assessment Help Medical Image Segmentation? 2025 - Accepted/In pressLawal, M., Sharma, P., Murchie, P., Yi, D. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsMinecrafter: A secure and decentralized consensus protocol for blockchain-enabled vaccine supply chain 2025 - PublishedMaloth, S., Hada, N. S., Jatoth, C., Gupta, N., Fiore, U., Sharma, P. K. Peer-to-Peer Networking and Applications, vol. 18, no. 4, 168Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s12083-025-01980-3[ONLINE] View publication in ScopusLabel-free Medical Image Quality Evaluation by Semantics-aware Contrastive Learning in IoMT 2025 - PublishedYi, D., Hua, Y., Murchie, P., Sharma, P. IEEE journal of biomedical and health informatics, vol. 29, no. 4, pp. 2335-2344Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/JBHI.2023.3340201[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/44bef647-55d9-4576-9330-5f25b452ed91/download[ONLINE] View publication in ScopusUni-directional graph structure learning-based multivariate time series anomaly detection with dynamic prior knowledge 2025 - PublishedHe, S., Li, G., Wang, J., Xie, K., Sharma, P. K. International Journal of Machine Learning and Cybernetics, vol. 16, no. 1, pp. 267-283Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s13042-024-02212-5[ONLINE] View publication in ScopusZero Trust Networks: Evolution and Application from Concept to Practice 2025 - PublishedRen, Y., Wang, Z., Sharma, P. K., Alqahtani, F., Tolba, A., Wang, J. Computers, Materials and Continua, vol. 82, no. 2, pp. 1593-1613Contributions to Journals: Review articles[ONLINE] DOI: https://doi.org/10.32604/cmc.2025.059170[ONLINE] View publication in ScopusA dual encoder crack segmentation network with Haar wavelet-based high–low frequency attention 2024 - PublishedZhang, J., Zeng, Z., Sharma, P. K., Alfarraj, O., Tolba, A., Wang, J. Expert Systems with Applications, vol. 256, 124950Contributions to Journals: Articles[ONLINE] https://github.com/zZhiG/DECS-Net[ONLINE] DOI: https://doi.org/10.1016/j.eswa.2024.124950[ONLINE] View publication in ScopusMultivariate Time Series Anomaly Detection Based on Multiple Spatiotemporal Graph Convolution 2024 - PublishedHe, S., Guo, Q., Li, G., Xie, K., Sharma, P. K. IEEE Transactions on Instrumentation and Measurement, vol. 74, 3500714Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TIM.2024.3493890[ONLINE] View publication in Scopus Show 10 | 25 | 50 | 100 results per page Refine Chapters in Books, Reports and Conference Proceedings Conference Proceedings (11) Contributions to Conferences Papers (1) Contributions to Journals Articles (101) Conference Articles (1) Editorials (3) Review articles (1) Contributions to Specialist Publications Articles (2) Update",
  "content_length": 9600,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:03"
}