{
  "name": "Prajakta Nimbhorkar",
  "homepage": "http://www.cmi.ac.in/~prajakta",
  "status": "success",
  "content": "Prajakta Nimbhorkar's home page Welcome to my homepage Contact Information Academic Background Teaching Post-docs, Ph.D and M.Sc. students Research Interests Publications Contact Information Prajakta Nimbhorkar Professor G Chennai Mathematical Institute Plot H1, SIPCOT IT Park Padur PO, Siruseri 603103 India Email: my first name % cmi % ac % in (Replace % with appropriate characters and insert my first name) Academic Background 2007-2010: Ph.D.(Computer Science) at The Institute of Mathematical Sciences, Chennai (... continued from TIFR) Thesis Advisor: Prof. Meena Mahajan Thesis Title: Complexity analysis of some problems in planar graphs, bounded tree-width graphs, and planar point sets 2005-2007: JRF (Computer Science) at Tata Institute of Fundamental Research, Mumbai 2003-2005: M.Tech.(IT) from Kanwal Rekhi School of IT, IIT Bombay 1999-2003 : B.E. (CSE) from Govt. College of Engineering, Aurangabad 1999: H.S.C. from Saraswati Bhuwan College of Science, Aurangabad 1997: S.S.C. from Sharda Mandir Girls' School, Aurangabad Teaching Algorithmic Game Theory Fall 2025 Topics in Algorithms: Advanced design and analysis techniques Spring 2025 Design and Analysis of Algorithms Spring 2012 (Course for Msc 1st year, Applications of Mathematics class) Fall 2012 Fall 2014 Fall 2016 Spring 2016 (For M.Sc. Applications of Mathematics and M.Sc. Computer Science) Fall 2020 (Joint with G. Philip) Fall 2021 (Joint with Nithin Varma) Fall 2024 Computational Complexity Spring 2013 Spring 2018 Spring 2022 Approximation Algorithms Fall 2013 Advanced Algorithms Spring 2017 Fall 2019 Fall 2021 (Joint with Nithin Varma) Fall 2023 Theoretical Foundations of Computer Science Fall 2017 Fall 2018 Matchings under Preferences March-April 2019 Linear Programming and Combinatorial Optimization Spring 2019 (Jointly with B. Srivathsan) Spring 2021 Spring 2023 Topics in Algorithms: Matchings and flows Spring 2020 Communication Complexity Fall 2022 (joint with Nithin Varma) Combinatorial Optimization Spring 2024 Dynamic Graph Algorithms (Joint with Pranabendu Misra and Samir Datta)Fall 2024 Post-doctoral fellows Pratik Ghosal (Nov 2020-May 2023) Ph.D students Vishwa Prakash H. V. (2020-) Harish Chandramouleeswaran (2023-) M.Sc. students advised Name Year Thesis title Publication (if any) Nikhil Mande 2013 Spectral graph theory Pratik Ghosal 2013 A survey on matchings with preferences Link Biman Roy (Jointly with Prof. Meena Mahajan) 2013 Unified theory of pseudorandomness Sayantan Sen 2018 A survey on rank-maximal matchings Souvik Parial 2019 A survey on popular and dominant matchings Vishwa Prakash H.V. (Joint with Dr. G.Philip) 2020 Disjoint stable matchings Link Pratiksha Mondal 2020 Matchings with incentives and cheating strategies Sagarika Shahane 2020 Approximation algorithms for uncapacitated facility location problem Ankita Sarkar 2020 Popular Matchings under Lower Quotas and their relationship to Stability under Classifications Link Saideep Bhosale 2021 Strongly stable matchings Kushagra Chatterjee 2021 Popular edge problem with privileged men Link Samiparna Biswas 2023 Disjoint rank-maximal matchings in a bipartite graph Sagnik Dasgupta 2023 Existence of possibly PROPx allocations Arghyadeep Chakraborty 2024 Capacity modification for many-to-one matching problems Suneet Patil 2025 Envy-free house allocation Deepro Sarkar 2025 Envy-freeness with subsidy (tentative title) Gyanashree Giri 2026 (expected) Rental harmony Aditi Kulkarni 2026 (expected) Matchings under preferences Research Interests I am interested in complexity, algorithms. Publications Group Fair Matchings Using Convex Cost FunctionsAtasi Panda, Harsh Sharma, Anand Louis, Prajakta Nimbhorkar (To appear at AAAI 2026) EFX Exists for Three Types of AgentsVishwa Prakash H. V., Pratik Ghosal, Prajakta Nimbhorkar, Nithin Varma (EC 2025) Optimal Capacity Modification for Stable Matchings with TiesKeshav Ranjan, Meghana Nasre, Prajakta Nimbhorkar (IJCAI 2025) Fair Division in a Variable SettingHarish Chandramouleeswaran, Prajakta Nimbhorkar, Nidhi Rathi (AAMAS 2025) Almost EFX for Three Types of AgentsPratik Ghosal, Vishwa Prakash H V, Prajakta Nimbhorkar, Nithin Varma (AAAI 2025) Individual Fairness under Group Fairness Constraints in Bipartite Matching - One Framework to Approximate Them AllAtasi Panda, Anand Louis, Prajakta Nimbhorkar (IJCAI 2024) Weighted Proportional Allocations of Indivisible Goods and Chores: Insights via MatchingsVishwa Prakash H.V., Prajakta NimbhorkarAAMAS 2024 and 6th GAIW workshop at AAMAS 2024 Online Algorithms for Matchings with Proportional Fairness Constraints and Diversity Constraints(the arxiv version is older)Anand Louis, Meghana Nasre, Prajakta Nimbhorkar, Govind S. SankarECAI 2023 Critical Relaxed Stable Matchings with Two-Sided TiesMeghana Nasre, Prajakta Nimbhorkar, Keshav RanjanWG 2023 Fair Healthcare Rationing to Maximize Dynamic Utilities Aadityan Ganesh, Pratik Ghosal, Vishwa Prakash HV, Prajakta NimbhorkarPAKDD 2023 Planar Graph Isomorphism is in Log-space Samir Datta and Nutan Limaye and Prajakta Nimbhorkar and Thomas Thierauf and Fabian Wagner ACM ToCT 2022, and a preliminary version in CCC 2009. Popular Edges with Critical NodesKushagra Chatterjee, Prajakta NimbhorkarISAAC 2022 Popular Matchings in the Hospital-Residents Problem with Two-sided Lower QuotasMeghana Nasre, Prajakta Nimbhorkar, Keshav Ranjan, Ankita SarkarFSTTCS 2021 Matchings with Group Fairness Constraints: Online and Offline AlgorithmsGovind Sankar, Anand Louis, Meghana Nasre, Prajakta NimbhorkarIJCAI 2021 Disjoint Stable Matchings in Linear TimeAadityan Ganesh, Vishwa Prakash H V, Prajakta Nimbhorkar, Geeverghese PhilipWG 2021 Envy-freeness and Relaxed Stability: Hardness and Approximation AlgorithmsGirija Limaye, Meghana Nasre, Prajakta NimbhorkarSAGT 2020 Many-to-one Popular Matchings with Two-sided Preferences and One-sided TiesKavitha Gopal, Meghana Nasre, Prajakta Nimbhorkar and T Pradeep ReddyCOCOON 2019 Classified Rank-Maximal Matchings and Popular Matchings -- Algorithms and HardnessMeghana Nasre, Prajakta Nimbhorkar, and Nada Pulath WG 2019 How good are popular matchings? Krishnapriya A M, Meghana Nasre, Prajakta Nimbhorkar, and Amit Rawat SEA 2018 Popular Matchings with Lower QuotasMeghana Nasre, and Prajakta NimbhorkarFSTTCS 2017 Computing the maximum using (min,+) formulas Meena Mahajan, and Prajakta Nimbhorkar, and Anuj Tawari MFCS 2017 Dynamic Rank-maximal Matchings Prajakta Nimbhorkar and Arvind Rameshwar V. Journal of combinatorial optimization (2019) A preliminary version appeared in COCOON 2017 Rank-maximal Matchings: Structure and Algorithms Pratik Ghosal and Meghana Nasre and Prajakta Nimbhorkar Theoretical Computer Science (2019) A preliminary version appeared in ISAAC 2014 Near-Optimal Expanding Generating Sets for Solvable Permutation Groups Vikraman Arvind and Partha Mukhopadhyay and Prajakta Nimbhorkar and Yadu Vasudev SIAM journal of discrete mathematics (2018) MFCS 2012 Erdős-Rényi Sequences and Deterministic construction of Expanding Cayley Graphs Vikraman Arvind and Partha Mukhopadhyay and Prajakta NimbhorkarLATIN 2012. Pseudorandom Generators for Group ProductsMichal Koucký and Prajakta Nimbhorkar and Pavel PudlákSTOC 2011. Popularity at Minimum Cost Telikepalli Kavitha and Meghana Nasre and Prajakta Nimbhorkar Journal of Combinatorial Optimization, 2012. (A preliminary version appeared in ISAAC 2010.) Log-space Algorithms for Paths and Matchings in k-trees Samir Datta and Bireswar Das and Prajakta Nimbhorkar Theory of Computing Systems. (A preliminary version appeared in STACS 2010.) Isomorphism for K_{3,3}-free and K_5-free graphs is in Log-space Samir Datta and Prajakta Nimbhorkar and Thomas Thierauf and Fabian Wagner FSTTCS 2009. The planar k-means problem is NP-hard Meena Mahajan and Prajakta Nimbhorkar and Kasturi R. Varadarajan. To appear in Theoretical Computer Science, special issue for WALCOM 2009. A preliminary version appeared in Proceedings of 3rd Annual Workshop on Algorithms and Computation WALCOM, 18-20 Feb 2009, Kolkata. Longest Paths in Planar DAGs in Unambiguous Logspace Nutan Limaye and Meena Mahajan and Prajakta Nimbhorkar. In Chicago Journal of Theoretical Computer Science CATS 2009 special issue, 2010(8), 2010.A preliminary version appeared in Computing: The Australasian Theory Symposium CATS , January 2009, New Zealand. A preliminary version with a subset of these results appears as a technical report on the Computing Research Repository:arXiv:0802.1699v1, 2008. 3-connected planar graph isomorphism is in Logspace Samir Datta and Nutan Limaye and Prajakta Nimbhorkar. In Proceedings of Foundations of Software Technology and Theoretical Computer Science, FST & TCS, 2008.",
  "content_length": 8732,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:01"
}