{
  "name": "Prakash Ishwar",
  "homepage": "https://www.bu.edu/eng/profile/prakash-ishwar",
  "status": "success",
  "content": "Prakash Ishwar, PhD | College of Engineering Prakash Ishwar, PhDProfessor (ECE, SE Appointed) Office 8 St. Mary’s St Boston, MA 02215, Room 440Email pi@bu.eduPhone (617) 358-3499 Website Prakash IshwarAlternate Website Visual Information Processing Laboratory Education PhD, University of Illinois, Urbana-Champaign, 2002Primary Appointment Department of Electrical and Computer Engineering In the News Fall Conference Season Brings an Abundant Harvest for ECE Researchers October 31, 2024 BU ECE researchers have had a strong start in the current conference season, earning three best paper awards in September/October 2024. [ More ] Areas of Interest Network Information Theory Information-Theoretic Security Statistical Signal Processing and Machine Learning Visual Information Processing and Analysis PublicationsView a complete list of publications chronologically by year.View a complete list of publications by citation. Honors and Awards BU College of Engineering Faculty Service Award, 2021 Elected Member, IEEE SPTM Technical Committee, 2013 – 2015 Elected Member, IEEE IVMSP Technical Committee, 2009 – 2012 ICPR Winner, Aerial View Activity Classification Challenge (with K. Guo and J. Konrad), 2010 AVSS Best Paper Award (with K. Guo and J. Konrad), 2010 Dean’s Catalyst Award, 2007 Senior Member, IEEE, 2007 NSF CAREER Award, 2005 Associate Editor, IEEE Transactions on Signal ProcessingClasses Taught EK 381 Probability, Statistics, and Data Science for Engineers EC 414 Introduction to Machine Learning EC 503 Learning from Data EC 505 Stochastic Processes EC 517 Information Theory EC 719 Statistical Learning TheoryAdditional Affiliations Division of Systems Engineering Center for Information and Systems Engineering Department of Computer Science Departments or Divisions: Electrical & Computer Engineering, Systems Engineering Affiliations: Intelligent, Autonomous & Secure Systems, Primary & Affiliated Faculty View all profiles",
  "content_length": 1950,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:02"
}