{
  "name": "Prakash Panangaden",
  "homepage": "http://www.cs.mcgill.ca/~prakash",
  "status": "success",
  "content": "Prakash Panangaden FRS FRSC The areas in which I work are: probabilistic bisimulation, approximation of Markov processes, reinforcement learning, quantitative logics and quantum information theory. I was recently elected as a Fellow of the Royal Society. I was elected as a Fellow of the Royal Society of Canada in 2013 and of the Association of Computing Machinery in 2020. I was the 2021 Milner Lecturer at the University of Edinburgh and the November 2024 Strachey Lecturer at the University of Oxford. The slides for both talks are below. My co-authors, Richard Blute, Josee Desharnais, Abbas Edalat and I won the 2017 Test-of-Time Award from LICS for our 1997 paper on bisimulation for Labelled Markov processes. Josee Desharnais, Vineet Gupta, Radha Jagadeesan and I won the 2022 Test-of-Time award for our 2002 paper, A metric analogue of weak bisimulation. Prakash Panangaden FRS FRSC Some Recent Publications Policy... JMLR 2024. Conditions ... AISTATS 2024 Behavioural ... MSCS 2023 A kernel perspective .... TMLR 2023. Continuous .... NeurIPS 22 Riemannian .... NeurIPS 22 More Publications Recent Talks From probabilistic bisimulation to ... The Strachey Lecture, University of Oxford, 19th November 2024. From bisimulation to representation ... The Milner Lecture, University of Edinburgh, 30th September 2021. Representation learning via metrics. Bologna, May 2021. Distributional analysis of .... MPI, June 2021. More Talks Recent Conferences and Workshops LICS 2022 PC member ICALP 2022 PC member QPL 2021 PC member FoSSACS 2020 member CSL 2020 PC member > More Conferences E-mail: prakash.panangaden@mcgill.ca I am not coming in to McGill any longer. I have retired and do not have an office. I will only have video meetings. By the miracles of Zoom/Skype/Teams I am still active in research. Please check my Google cal link below for up-to-date information on my weekly schedule. Photos The SOCS home page My Google calendar",
  "content_length": 1942,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:04"
}