{
  "name": "Prakash Ramanan",
  "homepage": "https://www.wichita.edu/profiles/academics/engineering/SoC/Ramanan-Prakash.php",
  "status": "success",
  "content": "Prakash Ramanan Prakash Ramanan Professor College of Engineering School of Computing (316) 978-3920 prakash.ramanan@wichita.edu 208, Jabara Hall Main Campus Information Academic Interests and Expertise Research Interests Algorithms, MapReduce Database Systems Data Mining XML Education B.E. in Electronics, Birla Institute of Technology and Science, Pilani, India (1980) Ph.D. in Computer Science, University of Illinois, Urbana, Illinois, USA (1984) Areas of Teaching Interest Recent Courses CS 411: Object Oriented Programming CS 510: Programming Language Concepts CS 540: Operating Systems CS 560: Design and Analysis of Algorithms CS 665: Database Systems CS 898B: Information Retrieval CS 898D: Data Mining CS 865: Principles of DBMS Implementation CS 868: Database Transaction Management CS 866: XML Databases Publications P. Ramanan. A New Lower Bound Technique and its Application: Tight Lower Bound for a Polygon Triangulation Problem, SIAM J. Comput.23 (1994), pp. 834-851. P. Ramanan. An Efficient Parallel Algorithm for the Matrix Chain Product Problem, SIAM J. Comput.25 (1996), pp. 874-893. P. Ramanan. Conditions for Lossless Join , Internat. J. Computer Math.78 (2001), pp. 489-498. P. Ramanan. Efficient Algorithms for Minimizing Tree Pattern Queries , ACM SIGMOD Intl. Conf. Management of Data, 2002, pp. 299-309. P. Ramanan. Covering Indexes for XML Queries: Bisimulation - Simulation = Negation , Intl. Conf. Very Large Databases (VLDB), 2003, pp. 165-176. P. Ramanan. Evaluating an XPath Query on a Streaming XML Document , Intl. Conf. Management of Data (COMAD), 2005, pp. 41--52. P. Ramanan. Holistic Join for Generalized Tree Patterns , Information Systems32 (2007), pp. 1018--1036. A. Chapman, H. V. Jagadish and P. Ramanan. Efficient Provenance Storage , ACM SIGMOD Intl. Conf. Management of Data, 2008, pp. 993-1006. P. Ramanan. Worst-Case Optimal Algorithm for XPath Evaluation Over XML Streams , J. Computer and Systems Sciences75 (2009), pp. 465--485. P. Ramanan. Memory Lower Bounds for XPath Evaluation over XML Streams , J. Computer and Systems Sciences77(2011), pp. 1120--1140. P. Ramanan. Rewriting XPath Queries Using Materialized XPath Views , J. Computer and Systems Sciences78(2012), pp. 1006--1025. P. Ramanan and A. Nagar. Tight Bounds on One- and Two-Pass MapReduce Algorithms for Matrix Multiplication, Proceedings of the 3rd ACM SIGMOD Workshop on Algorithms and Systems for MapReduce and Beyond (BeyondMR 2016). P. Ramanan. Answering Conjunctive Queries using Sources with Access Restrictions, Intl. Conf. Management of Data (COMAD), 2017, pp. xx--xx. M. Deng and P. Ramanan. MapReduce Implementation of Strassen's Algorithm for Matrix Multiplication , Proceedings of the 4th ACM SIGMOD Workshop on Algorithms and Systems for MapReduce and Beyond (BeyondMR 2017). Other Interests Programming Contracts Very good C/C++ programmer. Looking for programming contracts/grants. ©",
  "content_length": 2918,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:05"
}