{
  "name": "Praneeth Chakravarthula",
  "homepage": "https://www.cs.unc.edu/~cpk",
  "status": "success",
  "content": "Praneeth Chakravarthula, UNC Praneeth Chakravarthula Assistant Professor Dept. of Computer Science Dept. of Applied Physical Sciences (Adjunct) UNC Chapel Hill Email: cpk[at]cs.unc.edu CV News July. 2025 [ New ] One very interesting paper accepted to ISMAR. Details coming soon! June. 2025 [ New ] Two upcoming papers at ICCP, one paper at Advanced Imaging. May. 2025 [ New ] We won a Disruptive Idea Award at Neuro-symbolic Systems. May. 2025 Two new papers accepted to ICCP. May. 2025 I got elevated to IEEE Senior Member. April. 2025 Two new papers accepted to Optics Express and Neuro-symbolic Systems. April. 2025 Event Fields selected as a CVPR Highlight. Biography I am an Assistant Professor of Computer Science at UNC Chapel Hill. My research interests lie at the intersection of optics, perception, graphics, optimization, and machine learning. I am a Senior Member of Optica, recipient of IEEE VR Best Dissertation Award, Timothy L. Quigg Inventor of the Year at UNC, and several Best Paper and Demo Awards. I completed my postdoctoral research at Princeton University, obtained my PhD from UNC Chapel Hill, and my B.Tech and M.Tech degrees in Electrical Engineering, with a specialization in Signal Processing, all from IIT Madras. I have previously held research internship positions at Facebook Reality Labs, Microsoft Research Cambridge, NVIDIA Research and I was also a visiting researcher at the Fluid Interfaces Group of MIT Media Lab and CoSMIC lab of NUS,Singapore. If you are interested in a PhD, postdoc, internship or a visiting position, please contact me with your resume. Best Paper and Demo Awards DARPA Disruptive Idea Award, From Road to Code: Neuro-Symbolic Program Synthesis for Autonomous Driving Scene Translation and Analysis, Neuro-symbolic Systems 2025. Highlight Paper, Event fields: Capturing light fields at high speed, resolution, and dynamic range, CVPR 2025. Best Paper Honorable Mention, Multimodal Neural Acoustic Fields for Immersive Virtual Reality and Telepresence, IEEE VR 2025. Best Paper Award, FlatTrack: Eye-tracking with ultra-thin lensless cameras, GMCV, WACV 2025. Best Paper Award, Cross-Domain Synthetic-to-Real In-the-Wild Depth and Normal Estimation for 3D Scene Understanding , OmniCV, CVPR 2024. Best Dissertation Award, Towards Everyday-use Augmented Reality Eyeglasses, IEEE VGTC 2023. Best Paper Award, Image Features Influence Reaction Time: A Learned Probabilistic Perceptual Model for Saccade Latency, ACM SIGGRAPH 2022. Best Paper Honorable Mention, Joint Neural Phase Retrieval and Compression for Energy- and Computation-Efficient Holography on the Edge, ACM SIGGRAPH 2022. Best Paper Award, FoV-NeRF: Foveated Neural Radiance Fields for Virtual Reality, IEEE ISMAR 2022. Best Paper Award, DeepCGH: 3D Computer-Generated Holography Using Deep Learning, OSA Biophotonics Congress 2020. Best Optical Design Award, Wirtinger Holography for Near-Eye Displays, SPIE Photonics West 2020. Best Paper Award, focusAR: Auto-focus Augmented Reality Eyeglasses for both Real World and Virtual Imagery, IEEE ISMAR 2018. Best in Show Award, Steerable Application-Adaptive Near-Eye Displays, ACM SIGGRAPH 2018. Best Optical Design Award, Mitigating vergence-accommodation conflict for near-eye displays via deformable beamsplitters, SPIE Digital Optics for Immersive Displays 2018. Publications Please see my Google scholar for a complete publication list. (* equal contribution) Why Slow Feels Fast and Fast Feels Slow: Evaluating and Predicting Speed Misperception Xi Peng, Colin Groth, Daniel Jiménez Navarro, Zihao Zou, Ana Serrano, Karol Myszkowski, Qi Sun, Praneeth Chakravarthula [ ISMAR 2025 ] HoloZip: High Hologram Compression via Latent-of-Latent Coding Huaizhi Qu, Yujie Wang, Ruichen Zhang, Hengyu Lian, Samarjit Chakraborty, Henry Fuchs, Tianlong Chen, Praneeth Chakravarthula [ ICCP 2025 ] Structured Light with a Million Light Planes per Second Dhawal Sirikonda, Praneeth Chakravarthula, Ioannis Gkioulekas, Adithya Pediredla [ ICCP 2025 ] Micron-Scale 3D Imaging of Macroscopic Objects with Multi-Camera Arrays Amey Chaware, Kevin Zhou, Vinayak Pathak, Ramana Balla, Clare Cook, Lucas Kreiss, Kanghyun Kim, Bryan Hilley, Julia McHugh, Praneeth Chakravarthula, Roarke Horstmeyer [ Advanced Imaging 2025 ] From Road to Code: Neuro-Symbolic Program Synthesis for Autonomous Driving Scene Translation and Analysis Johnathan Leung, Guansen Tong, Sridhar Duggirala, Praneeth Chakravarthula [ DARPA Disruptive Idea Award ] [ Neurosymbolic Systems 2025 ] DOF-GS: Adjustable Depth-of-Field 3D Gaussian Splatting for Post-Capture Refocusing, Defocus Rendering and Blur Removal Yujie Wang, Baoquan Chen*, Praneeth Chakravarthula* [ CVPR 2025 ] Event fields: Capturing light fields at high speed, resolution, and dynamic range Ziyuan Qu, Zihao Zou, Vivek Boominathan, Praneeth Chakravarthula, Adithya Pediredla [ Highlight ] [ CVPR 2025 ] Beating Bandwidth Limits for Large Aperture Broadband Nano-optics Johannes E Fröch*, Praneeth Chakravarthula*, Jipeng Sun, Ethan Tseng, Shane Colburn, Alan Zhan, Forrest Miller, Anna Wirth-Singh, Quentin AA Tanguy, Zheyi Han, Karl F Böhringer, Felix Heide, Arka Majumdar [ Nature Communications 2025 ] Present and Future of Everyday-use Augmented Reality Eyeglasses Praneeth Chakravarthula [ IEEE Computer Graphics and Applications 2025 ] Multimodal Neural Acoustic Fields for Immersive Virtual Reality and Telepresence Guansen Tong, Jonathan Leung, Haosheng Shi, Liujie Zheng, Shengze Wang, Xi Peng, Grace Fei, Praneeth Chakravarthula [ Best Paper Honorable Mention ] [ IEEE VR (TVCG) 2025 ] Perceptually-Guided Acoustic Foveation Xi Peng, Kenneth Chen, Iran Roman, Juan Pablo Bello, Qi Sun*, Praneeth Chakravarthula* [ IEEE VR 2025 ] Novel View Synthesis for 3D Computer-Generated Holograms Using Deep Neural Fields Kenneth Chen, Anzhou Wen, Yunxiang Zhang, Praneeth Chakravarthula, Qi Sun [ Optics Express 2025 ] FlatTrack: Eye-tracking with ultra-thin lensless cameras Purvam Jain, Althaf M. Nazar, Salman S. Khan, Kaushik Mitra, Praneeth Chakravarthula [ Best Paper Award ] [ GMCV, WACV 2025 ] Spatially Varying Nanophotonic Neural Networks Kaixuan Wei*, Xiao Li*, Johannes Froech*, Praneeth Chakravarthula, James Whitehead, Ethan Tseng, Arka Majumdar, Felix Heide [ Science Advances 2024 ] End-to-End Hybrid Refractive-Diffractive Lens Design with Differentiable Ray-Wave Model Xinge Yang, Matheus Souza, Kunyi Wang, Praneeth Chakravarthula, Qiang Fu, Wolfgang Heidrich [ SIGGRAPH Asia 2024 ] Cross-Domain Synthetic-to-Real In-the-Wild Depth and Normal Estimation for 3D Scene Understanding Jay Bhanushali, Manivannan Muniyandi, Praneeth Chakravarthula [ Best Paper Award ] [ OmniCV, CVPR 2024 ] Neural Etendue Expander for Ultra-Wide-Angle High-Fidelity Holographic Display Ethan Tseng, Seung-Hwan Baek, Grace Kuo, Nathan Matsuda, Andrew Maimone, Praneeth Chakravarthula, Qiang Fu, Wolfgang Heidrich, Douglas Lanman, Felix Heide [ Nature Communications 2024 ] Point Spread Function-inspired Deformable Convolutional Network for Holographic Displays Mi Zhou, Shuming Jiao, Praneeth Chakravarthula, Yang Yue, Ping Su, Ercan Engin Kuruoglu, Zihan Geng [ SPIE 2024 ] Thin On-Sensor Nanophotonic Array Cameras Praneeth Chakravarthula, Jipeng Sun, Xiao Li, Chenyang Lei, Gene Chou, Mario Bijelic, Johannes Froesch, Arka Majumdar, Felix Heide [ SIGGRAPH Asia 2023 ] Seeing with Sound: Long-Range Acoustic Beamforming for Automotive Scene Understanding Praneeth Chakravarthula, Jim Aldon D'Souza, Ethan Tseng, Joe Bartusek, Felix Heide [ CVPR 2023 ] Stochastic Light Field Holography Florian Schiffers, Praneeth Chakravarthula, Nathan Matsuda, Grace Kuo, Ethan Tseng, Douglas Lanman, Felix Heide, Oliver Cossairt [ ICCP 2023 ] End-to-End Compression-Aware Computer-Generated Holography Mi Zhou, Hao Zhang, Shuming Jiao, Praneeth Chakravarthula, Zihan Geng [ Optics Express 2023 ] Hexagonal Diffractive Optical Elements Yidan Zheng, Qiang Fu, Hadi Amata, Praneeth Chakravarthula, Felix Heide, Wolfgang Heidrich [ Optics Express 2023 ] ChromaCorrect: Prescription Correction in Virtual Reality Headsets through Perceptual Guidance Ahmet Guzel, Jeanne Beyazian, Praneeth Chakravarthula, Kaan Aksit [ Biomedical Optics Express 2023 ] Visual perception of noise in a simulated holographic display – a user study Andreas Georgiou, Joel Kollin, Charlie Hewitt, Praneeth Chakravarthula, Brian Guenter [ Elsevier Displays 2022 ] Pupil-aware Holography Praneeth Chakravarthula, Seung-Hwan Baek, Florian Schiffers, Ethan Tseng, Grace Kuo, Andrew Maimone, Nathan Matsuda, Oliver Cossairt, Douglas Lanman, Felix Heide [ Spotlight Poster ICCP 2022 ] [ SIGGRAPH Asia 2022 ] FoV-NeRF: Foveated Neural Radiance Fields for Virtual Reality Nianchen Deng, Zhenyi He, Jiannan Ye, Budmonde Duinkharjav, Praneeth Chakravarthula, Xubo Yang, Qi Sun [ Best Paper Award ] [ IEEE TVCG 2022 ] Neural 3D Gaze: 3D Pupil Localization and Gaze Tracking based on Anatomical Eye Model and Neural Refraction Correction Conny Lu, Praneeth Chakravarthula, Kaihao Liu, Xixiang Liu, Siyuan Li, Henry Fuchs [ ISMAR 2022 ] Image Features Influence Reaction Time: A Learned Probabilistic Perceptual Model for Saccade Latency Budmonde Duinkharjav, Praneeth Chakravarthula, Rachel Albert, Anjul Patney, Qi Sun [ Best Paper Award ] [ SIGGRAPH 2022 ] Hogel-free Holography Praneeth Chakravarthula, Ethan Tseng, Henry Fuchs, Felix Heide [ SIGGRAPH 2022 ] Joint Neural Phase Retrieval and Compression for Energy- and Computation-Efficient Holography on the Edge Yujie Wang*, Praneeth Chakravarthula*, Qi Sun, Baoquan Chen [ Best Paper Honorable Mention ] [ SIGGRAPH 2022 ] Seeing Through Obstructions with Diffractive Cloaking Zheng Shi, Yuval Bahat, Seung-Hwan Baek, Qiang Fu, Hadi Amata, Xiao Li, Praneeth Chakravarthula, Wolfgang Heidrich, Felix Heide [ SIGGRAPH 2022 ] Towards Everyday-use Augmented Reality Eyeglasses Praneeth Chakravarthula [ IEEE VR Best Dissertation Award ][ Ph.D. Dissertation, 2021 ] Gaze-contingent Retinal Speckle Suppress",
  "content_length": 12959,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:06"
}