{
  "name": "Prasad Calyam",
  "homepage": "https://engineering.missouri.edu/faculty/prasad-calyam",
  "status": "success",
  "content": "Prasad Calyam Skip to navigation Skip to content Curators' Distinguished Professor, Director of Mizzou CERI email calyamp@missouri.edu phone 573-882-9747 place 221 Naka Hall Electrical Engineering and Computer Science Biography Prasad Calyam is the interim associate dean for research and a Curators’ Distinguished Professor in the Department of Electrical Engineering and Computer Science, director of the Cyber Education, Research and Infrastructure Center (Mizzou CERI) and a core faculty member in the MU Institute for Data Science & Informatics. Previously, he was a research director at the Ohio Supercomputer Center/Ohio Academic Resources Network at The Ohio State University. He currently directs a research group in the Virtualization, Multimedia and Networking (VIMAN) Lab. His research and development areas of interest include cloud computing, cybersecurity, artificial intelligence and advanced cyberinfrastructure. He has published more than 250 papers in various conference and journal venues. As the principal investigator, he has successfully led teams of graduate, undergraduate and postdoctoral fellows in numerous federal-, state- and industry-sponsored research and development projects. His research sponsors include: National Science Foundation (NSF), Department of Energy (DOE), National Security Agency (NSA), Department of State (DOS), Army Research Lab (ARL), USDA National Institute of Food and Agriculture (NIFA), Small Business Administration (SBA), VMware, Cisco, Raytheon-BBN, Booz Allen Hamilton, Dell, Verizon, IBM, Huawei, Coulter Foundation, Knight Foundation, Missouri Department of Transportation, Alaska Department of Transportation, Internet2, City of Dublin, and others. His basic research on multi-domain network measurement and monitoring has been commercialized as ‘Narada Metrics’. He currently serves as an associate editor for IEEE Transactions on Network and Service Management, and previously served as an editor for IEEE Communications Magazine and chair of NSF visioning workshops. He is a Senior IEEE Member. Education PhD from Ohio State University MS from Ohio State University BE from Bangalore University Website: Home Page CERI Center Cybersecurity Center @ Mizzou Google Scholar Technical Focus Cloud computing Computer networking Cybersecurity News Stories Affiliated News",
  "content_length": 2332,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:06"
}