{
  "name": "Prasad Tetali",
  "homepage": "https://people.math.gatech.edu/~tetali",
  "status": "success",
  "content": "Prasad Tetali - Home Page Prasad Tetali Regents' Professor, School of Mathematics and School of Computer Science Georgia Institute of Technology Atlanta, GA 30332-0160 Office: Skiles 132 email : lastname at math daught gatech dot edu Adjunct Professor, Math/CS, Emory University ACO and ARC CV Research and Papers Teaching Links Educational Background: Postdoc, Mathematical Sciences Research Center, AT & T Bell Labs, Murray Hill, New Jersey Ph.D. (1991), Courant Institute of Mathematical Sciences, NYU, New York M.S. (1987), Indian Institute of Science, Bangalore, India Research Interests: My general research interest is in Discrete Math, Probability and Theory of Computing: Markov chains, Isoperimetry and Functional analysis, Combinatorics, Computational number theory, and Algorithms. Service: 09/2019--Current : Director, ACO Ph.D. Program, Georgia Tech 4/2015--12/2016 : Interim Chair, School of Mathematics 2014--2015 : Principal Organizer, IMA Thematc Year on Discrete Structures:Analysis and Applications 2011--2014: Director, Algorithms & Randomness ThinkTank   Ann. Report 2012  Ann. Report 2013 2009--2011 : Editor in Chief, SIAM J on Discrete Mathematics   SIDMA Professional Recognition: AMS Fellow (Inaugural Class, 2012), SIAM Fellow (Inaugural Class, 2009) 2008--2012 : SODA Steering committee 2007--2019 : Editor, Random Structures & Algorithms   Rand. Struct. Alg. 2005-2008, 2010--2016: Associate Editor, Annals of Applied Probability Ann. Appl. Probab. 2010--current : Associate Editor, Journal of Combinatorics JOC 2002-2007 : Advisory board of Journal of Combinatorial Theory (Series A) JCTA Welcome to the world of mood disorders : why you and I who do not necessarily suffer from a mood disorder should care? webpage on mental illness Return to School of Mathematics home page at Georgia Tech. Last modified: Saturday, 13-Dec-2014",
  "content_length": 1860,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:10"
}