{
  "name": "Pratik Mazumder",
  "homepage": "https://sites.google.com/view/pratikmazumder",
  "status": "success",
  "content": "Pratik MazumderSearch this siteEmbedded FilesSkip to main contentSkip to navigationPratik MazumderI am an Assistant Professor in the Department of Computer Science and Engineering, Indian Institute of Technology Jodhpur. I received my PhD from the Department of Computer Science and Engineering at the Indian Institute of Technology Kanpur supervised by Dr. Vinay P. Namboodiri and Dr. Piyush Rai. My Research areas include Bias Mitigation, Generative Models, Medical Image Processing, Few-Shot Learning, Zero-Shot Learning, Incremental Learning, Deep Learning, Computer Vision, Machine Learning.CV | Google ScholarNote: I am looking for motivated PhD, B.Tech., and M.Tech. students with at least some experience in Deep Learning. RECENT NEWSOne paper accepted at WACV 2024Two papers accepted at Neural Networks Journal 2023Paper accepted at IEEE Transactions on Pattern Analysis and Machine Intelligence (IEEE TPAMI)One paper accepted at ECCV 2022Outstanding PhD Thesis award, IIT Kanpur.One paper accepted at Elsevier Neurocomputing Journal 2022One paper accepted at Elsevier Knowledge-Based Systems Journal 2022Successfully defended my PhD thesis on “Data Efficient Techniques for Deep Learning”.Our work titled \"Fair Visual Recognition in Limited Data Regime using Self-Supervision and Self-Distillation\" is accepted at IEEE Winter Conference on Applications of Computer Vision (WACV), Waikoloa, Hawaii, United States, 2022. One paper accepted at Elsevier Knowledge-Based Systems Journal 2022One paper accepted at Elsevier Pattern Recognition Journal 2022Delivered my PhD Open Seminar on “Data Efficient Techniques for Deep Learning”One paper accepted at CVPR 2021One paper accepted at Elsevier Neurocomputing Journal 2021Defended my joint M.Tech. thesis on Contextual Pointwise Convolution for Object Recognition.One paper accepted at AAAI 2021Three papers accepted at IEEE Winter Conference on Applications of Computer Vision (WACV) 2021Received NeurIPS 2020 Financial Assistance Award to present our work at NeurIPS 2020One paper accepted at NeurIPS 2020One paper accepted at Elsevier Image and Vision Computing Journal 2020Our work titled \"Passive Batch Injection Training Technique: Boosting Network Performance by Injecting Mini-Batches from a different Data Distribution\"  is accepted at IEEE International Joint Conference on Neural Networks (IJCNN), Glasgow, Scotland, UK, 2020.Our work titled \"CPWC: Contextual Point Wise Convolution for Object Recognition\" is accepted at IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), Barcelona, Spain, 2020.Our work titled \"Accuracy Booster: Performance Boosting using Feature Map Re-calibration\" is accepted at IEEE Winter Conference on Applications of Computer Vision (WACV), Colorado, United States, 2020. Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:12"
}