{
  "name": "Pratyush Mishra",
  "homepage": "https://pratyushmishra.com",
  "status": "success",
  "content": "Pratyush Mishra Skip to main content Link Menu Expand (external link) Copy Copied Pratyush Mishra Assistant Professor Department of Computer and Information Science University of Pennsylvania Email: prat@seas.upenn.edu Office: Amy Gutmann Hall, Room 323 About meHi! I’m Pratyush. I am an Assistant Professor of Computer and Information Science at the University of Pennsylvania, where I am a member of the Security and Privacy Laboratory.My research lies at the intersection of cryptography and computer security, with a focus on efficient realizations and applications of cryptographic proof systems and secure computation.I am a co-author and co-maintainer of the arkworks ecosystem, which is a collection of libraries for zkSNARKs.I am a founding scientist at Aleo, a startup based on my research project Zexe (see below). Previously, I completed my PhD in Computer Science at UC Berkeley under the excellent supervision of Alessandro Chiesa and Raluca Ada Popa. Before that, I completed my BSc in EECS at UC Berkeley, where I did research under the guidance of David Wagner. Research Group CurrentAnubhav Baweja (PhD student, co-advised with Sampath Kannan)Tushar Mopuri (PhD student)Bharath Namboothiry (PhD student)Alireza Shirzad (PhD student) AlumniMatan Shtepel (Research Assistant → PhD at CMU) TeachingCIS 7000-9: Succinct Arguments (Penn, Fall ‘25)CIS 5560: Cryptography (Penn, Spring ‘25)CIS 5560: Cryptography (Penn, Spring ‘24)CIS 7000-2: Theory and Practice of Succinct Zero Knowledge Proofs (Penn, Fall ‘23)CS 294-163: Decentralized Security: Theory and Systems (Berkeley, Fall ‘19) AwardsACM SIGSAC Doctoral Dissertation Award Runner-Up, 2022 Program CommitteesIEEE S&P 2026CRYPTO 2025FC 2025IEEE S&P 2025IEEE S&P 2024CRYPTO 2023 Publications (Google Scholar, DBLP) PreprintsQuery-Optimal IOPPs for Linear-Time Encodable Codes Anubhav Baweja, Pratyush Mishra, Tushar Mopuri, Matan Shtepel (ePrint)FICS and FACS: Fast IOPPs and Accumulation via Code-Switching Anubhav Baweja, Pratyush Mishra, Tushar Mopuri, Matan Shtepel (ePrint)Scribe: Low-memory SNARKs via Read-Write Streaming Anubhav Baweja, Pratyush Mishra, Tushar Mopuri, Karan Newatia, Steve Wang (ePrint, code)Garuda and Pari: Faster and Smaller SNARKs via Equifficient Polynomial Commitments Michel Dellepere, Pratyush Mishra, Alireza Shirzad (ePrint, code) Conference publicationsCoral: Fast Succinct Non-Interactive Zero-Knowledge CFG Proofs Sebastian Angel, Sofía Celi, Elizabeth Margolin, Pratyush Mishra, Martin Sander, Jess Woods IEEE S&P 2026 (ePrint, code)Time-Space Trade-Offs for Sumcheck Anubhav Baweja, Alessandro Chiesa, Elisabetta Fedele, Giacomo Fenzi, Pratyush Mishra, Tushar Mopuri, Andrew Zitek-Estrada, TCC 2025 (ePrint, code)Arc: Accumulation for Reed–Solomon Codes Benedikt Bünz, Pratyush Mishra, Wilson Nguyen, William Wang CRYPTO 2025 (ePrint)Malicious Security for PIR (almost) for Free Brett Falk, Pratyush Mishra, Matan Shtepel CRYPTO 2025 (ePrint)DFS: Delegation-friendly zkSNARK and Private Delegation of Provers Yuncong Hu, Pratyush Mishra, Xiao Wang, Jie Xie, Kang Yang, Yu Yu, Yuwen Zhang USENIX Security 2025 (ePrint)Accumulation without Homomorphism Benedikt Bünz, Pratyush Mishra, Wilson Nguyen, William Wang ITCS 2025 (ePrint)Hekaton: Horizontally-Scalable zkSNARKs via Proof Aggregation Michael Rosenberg, Tushar Mopuri, Hossein Hafezi, Ian Miers, Pratyush Mishra ACM CCS 2024 (ePrint)Efficient Private Delegation of zkSNARK Provers Alessandro Chiesa, Ryan Lehmkuhl, Pratyush Mishra, Yinuo Zhang USENIX Security 2023 (ePrint, Code, Talk)Proof-Carrying Data without Succinct Arguments Benedikt Bünz, Alessandro Chiesa, William Lin, Pratyush Mishra, Nick Spooner CRYPTO 2021 (ePrint, Code, Talk)Muse: Secure Inference Resilient to Malicious Clients Ryan Lehmkuhl, Pratyush Mishra, Akshayaram Srinivasan, Raluca Ada Popa USENIX Security 2021 (ePrint, Code, Talk)Proofs for Inner Pairing Products and Applications Benedikt Bünz, Mary Maller, Pratyush Mishra, Nirvan Tyagi, Psi Vesely ASIACRYPT 2021 (ePrint, Code)Proof-Carrying Data from Accumulation Schemes Benedikt Bünz, Alessandro Chiesa, Pratyush Mishra, Nick Spooner TCC 2020 (ePrint, Code, Talk)Marlin: Preprocessing zkSNARKs with Universal and Updatable SRS Alessandro Chiesa, Yuncong Hu, Mary Maller, Pratyush Mishra, Psi Vesely, Nicholas P. Ward EUROCRYPT 2020 (ePrint, Code, Talk)Delphi: A Cryptographic Inference Service for Neural Networks Pratyush Mishra, Ryan Lehmkuhl, Akshayaram Srinivasan, Wenting Zheng, Raluca Ada Popa USENIX Security 2020 (ePrint, Code, Talk)Zexe: Enabling Decentralized Private Computation Sean Bowe, Alessandro Chiesa, Matthew Green, Ian Miers, Pratyush Mishra, Howard Wu IEEE S&P 2020 (ePrint, Code, Talk)Oblix: An Efficient Oblivious Search Index Pratyush Mishra, Rishabh Poddar, Jerry Chen, Alessandro Chiesa, Raluca Ada Popa IEEE S&P 2018 (Paper, Talk)Decentralized Anonymous Micropayments Alessandro Chiesa, Matthew Green, Jingcheng Liu, Peihan Miao, Ian Miers, Pratyush Mishra EUROCRYPT 2017 (ePrint, Talk)Hidden Voice Commands Nicholas Carlini, Pratyush Mishra, Tavish Vaidya, Yuankai Zhang, Micah Sherr, Clay Shields, David Wagner, and Wenchao Zhou. USENIX Security 2016 (Paper, Demo, CSAW Applied Research Award)Smart Locks: Lessons for Securing Commodity Internet of Things Devices Grant Ho, Derek Leung, Pratyush Mishra, Ashkan Hosseini, David Wagner, and Dawn Song AsiaCCS 2016 (Paper)Somebody’s Watching Me? Assessing the Effectiveness of Webcam Indicator Lights Rebecca S. Portnoff, Linda N. Lee, Serge Egelman, Pratyush Mishra, Derek Leung, and David Wagner CHI 2015 (Paper)",
  "content_length": 5588,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:13"
}