{
  "name": "Prateek Mittal",
  "homepage": "http://www.princeton.edu/~pmittal",
  "status": "success",
  "content": "Prateek Mittal's Webpage Prateek Mittal Professor Department of Electrical and Computer Engineering Associated Faculty, Department of Computer Science Associated Faculty, Center for Information Technology Policy Princeton University Email: pmittal@princeton.edu Twitter: @prateekmittal_ Links: [About Me] [Publications] [Open Positions] Research Interests I am broadly interested in privacy-preserving and secure systems. My current interests include the domains of privacy enhancing technologies (such as anonymous communications, statistical data privacy), adversarial machine learning, and Internet/network security. My research draws on techniques from data science, network science/complex networks, distributed systems, and applied cryptography. Please see my publications page for more details. News: IEEE Fellow, 2026 Andreas Pfitzmann Best Student Paper Award, PETS 2026 Blavatnik National Award Finalist, 2025 Associate Chair, ECE Department, 2025 Director of Undergraduate Studies, 2025 Outstanding Paper Award, ICLR 2025 Honorable Mention for Outstanding Paper Award, ICLR 2025 ACM Distinguished Member, 2024 Distinguished Alumni Award, Indian Institute of Technology at Guwahati, 2024 University of Illinois at Urbana-Champaign (UIUC) ECE Alumni Award, 2024 ACM Grace Murray Hopper Award, 2023 (awarded in June 2024) Interim Director, Princeton Center for Information Technology Policy (CITP), 2022-2023 Director of Undergraduate Studies at Princeton, 2021, 2022 Caspar Bowden Award for Outstanding Research in Privacy Enhancing Technologies, Runner Up, 2022 Caspar Bowden Award for Outstanding Research in Privacy Enhancing Technologies, Runner Up, 2021 Caspar Bowden Award for Outstanding Research in Privacy Enhancing Technologies, Runner Up, 2020 Facebook Systems for ML Research Award, 2020 Princeton Engineering Commendation List for Outstanding Teaching, 2019 ARO Young Investigator Prize (YIP), 2018 ONR Young Investigator Award (YIP), 2018 Princeton University's E. Lawrence Keyes, Jr./Emerson Elec. Co. Faculty Award Princeton Engineering Commendation List for Outstanding Teaching, 2018 IBM Faculty Award, 2017 Bell Labs Prize Finalist, 2017 Princeton Engineering Commendation List for Outstanding Teaching, 2017 Google Faculty Research Award, 2017 Princeton Innovation Fund Award, 2016-2017 Intel Faculty Research Award, 2016-2017 National Science Foundation CAREER Award, 2016 Google Faculty Research Award, 2016 Cisco Faculty Research Award, 2016 Princeton Engineering Commendation List for Outstanding Teaching, 2016 Co-chairing the USENIX Workshop on Free and Open Communications on the Internet FOCI, 2016 Teaching Security and Privacy --- ECE 574, Fall 2025. Information Security --- ECE/COS 432, Spring 2025. Designing Secure Systems --- ELE 476, Fall 2014. Professional Activities Deputy Chair, ACM Grace Murray Hopper Award Committee, 2025-2026 ACM Grace Murray Hopper Award Committee, 2024-present Editorial Board, Privacy Enhancing Technologies, 2015-present Steering Committee, USENIX Security and AI Networking Summit (ScAINet) Program co-chair, USENIX Workshop on Free and Open Communications on the Internet FOCI 2016 Program co-chair, Workshop on Hot Topics in Privacy Enhancing Technologies HotPETs 2013, 2014. Program committee member, Privacy Enhancing Technologies Symposium PETS 2025. Program committee member, IEEE Symposium on Security and Privacy S&P 2020. Program committee member, USENIX Security Symposium SEC 2019. Program committee member, Network and Distributed System Security Symposium NDSS 2018.",
  "content_length": 3554,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:12"
}