{
  "name": "Pratik Narang",
  "homepage": "https://www.bits-pilani.ac.in/pilani/pratiknarang/profile",
  "status": "success",
  "content": "Pratik Narang - BITS Pilani Campus Header Institute Header Home Academics Integrated first degree B.E.(Manufacturing Engineering) M.Sc.(Mathematics) M.Sc.(Chemistry) M.Sc.(General Studies) M.Sc.(Biological Sciences) M.Sc.(Physics) M.Sc.(Economics) B.E.(Mechanical) B.E.(Civil) B.E.(Electronics and Instrumentation) B.E.(Electronics and Communication) B.E.(Electrical and Electronics) B.E.(Chemical) B.Pharm.(Pharmacy) B.E.(Computer Science) Higher Degree M.E.(Sanitation Science, Technology and Management) M.E. Chemical Engineering (with specialization in Petroleum Engineering) M.E.(Chemical) MBA(Master of Business Administration In Business Analytics) Master in Public Health M.Sc. General Studies – Communication and Media Studies Stream M.E. (Mechanical with specialization in Thermal Engineering) M.E.(Software Systems) M.E. M.Pharm M.Pharm.(Pharmacology) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmacy) M.E.(Design Engineering) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E.(Microelectronics) M.E.(Mechanical) M.E.(Manufacturing Systems Engineering) M.E.(Embedded Systems) M.E. Electronics & Control M.E.(Computer Science) M.E.(Communication Engineering) M.E. Civil – Water Resource Engineering M.E.(Civil with specialization in Transportation Engineering) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Biotechnology) M.E.(Environmental Engineering) Doctoral Programmes Pharmacy Physics Civil Engineering Computer Science & Information Systems Electrical & Electronics Engineering Biological Sciences Chemical Engineering Chemistry Economics & Finance Humanities & Social Sciences Mathematics Mechanical Engineering Management WILP Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Department Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Faculty Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Students Student Activities Events & Festivals BITScan BITS Embryo Picture Gallery Convocation 2025 BITS BEAT Student Achievements Student Services Academic Counseling Academic Document/Verification Requests Student Facilities Student Welfare Procedure for Issurance of Duplicate Degree Anti Ragging Scrutiny of Grades Information for Prospective Students Prevention of Sexual Harassment Centers Teaching Learning Centre Centre for Women’s Studies Centre for Entrepreneurial Leadership Centre for Desert Development Technologies Centre for Robotics and Intelligent Systems Technology Business Incubator Central Instrumentation Facility AI Centre Alumni Quick Links Academic Counselling Center Medical Center Library e-services Outreach IT Services Unit Central Workshop Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITS Law School, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Pratik Narang Pilani Computer Science Associate Professor, Department of Computer Science & Information Systems, BITS Pilani, Pilani Campus Cyber Security, Deep Learning, Machine Learning Room 6121-L, New Academic Block, Department of Computer Science & Information Systems, Birla Institute of Technology & Science, Pilani- 333031, Rajasthan. India. pratik.narang@pilani.bits-pilani.ac.in 01596-255833 Dr. Pratik Narang is a Senior Member of IEEE and an Assistant Professor in the Department of CSIS at BITS Pilani, Rajasthan, India. His research focuses on building systems using Artificial Intelligence and Machine Learning for improving the existing technologies in Cyber security, Computer Vision, and Healthcare. Pratik has executed multiple Sponsored R&D projects (funded by Govt. of India and Industrial organizations) in the area of Applied Deep Learning and Artificial Intelligence. Pratik also has collaborations with leading Univerities (NUS, UIUC, etc.) and Industrial organizations (IBM, NVIDIA, Google, etc.) across the world. At BITS Pilani, Pratik is the Faculty Advisor for the Google Developer Student Clubs. Pratik is also a nucleus member of the Sponsored Research and Consultancy Division (SRCD) at BITS Pilani where he is involving in digitizing the activities of SRCD. Pratik completed his undergraduate studies in M.Sc. (Tech) Information Systems from BITS Pilani (Pilani campus) in 2011. From 2012 to 2015, he pursued his doctoral research at BITS Pilani (Hyderabad campus) under the supervision of Prof. Chittaranjan Hota and co-supervision of Prof. V. N. Venkatakrishnan (at the University of Illinois at Chicago). His research was funded by grants from the Ministry of Electronics & IT, Govt. of India. Prior to joining BITS Pilani, Pratik worked with Bennett University where he was the founding member and the coordinator of the Machine Intelligence research group. Prior to that, Pratik has held research positions with the National University of Singapore, Singapore (as a part of his Post-doctoral research), and The New York University, Abu Dhabi campus, UAE (where he carried out a portion of his PhD research).Click here for more details Loading... Keep Exploring Admission News Alumni Academics Admission Campus University Home K K Birla Goa Pilani Hyderabad Dubai BITSoM, Mumbai BITSLAW, Mumbai Faculty Explore Home Academics Integrated first degree Higher Degree Doctoral Programmes WILP Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Department Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Faculty Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Students Student Activities Student Services Centers Teaching Learning Centre Centre for Women’s Studies Centre for Entrepreneurial Leadership Centre for Desert Development Technologies Centre for Robotics and Intelligent Systems Technology Business Incubator Central Instrumentation Facility AI Centre Alumni Quick Links Academic Counselling Center Medical Center Library e-services Outreach IT Services Unit Central Workshop ",
  "content_length": 10109,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:14"
}