{
  "name": "Preeti Ranjan Panda",
  "homepage": "http://www.cse.iitd.ernet.in/~panda",
  "status": "success",
  "content": "Preeti Ranjan Panda NEWS [Oct 2024] Best Paper Nomination at VLSI-SoC'24 for our paper APPAMM: Memory Management for IPsec Application on Heterogeneous SoCs, by Ayushi, Radhika, et al. (NXP collaboration), Tangier, Morocco [Oct 2024] Research paper NOVELLA: Non-Volatile Last-Level Cache Bypass for Optimizing Off-chip Memory Energy, by Aritra Bagchi et al. to be presented at ESWEEK/CASES'24, Raleigh, USA. Published in IEEE TCAD. [Aug 2024] Divya Praneetha and Shailja Pandey receive PhD degrees at IITD's 55th convocation ceremony . Both are at Intel now. [Aug 2024] Research paper 3D-TemPo: Optimizing 3-D DRAM Performance Under Temperature and Power Constraints by Shailja Pandey et al. published in IEEE TCAD. [May 2024] Research paper NeuroTAP: Thermal and Memory Access Pattern-aware Data Mapping on 3D DRAM for Maximizing DNN Performance by Shailja Pandey et al. accepted for publication in ACM TECS. [Apr 2024] P. R. Panda is a receipient of the Qualcomm Faculty Award [Mar 2024] Research paper POEM: Performance Optimization and Endurance Management for Non-volatile Caches by Aritra Bagchi et al. accepted for publication in ACM TODAES. [Jan 2024] Research paper COBRRA: COntention aware cache Bypass with Request-Response Arbitration by Aritra Bagchi et al. published in ACM TECS. [Dec 2023] Research paper NeuroCool: Dynamic Thermal Management of 3D DRAM for Deep Neural Networks through Customized Prefetching by Shailja Pandey et al. published in ACM TODAES. [Sep 2023] Research paper CABARRE: Request Response Arbitration for Shared Cache Management by Garima Modi et al. (Intel collaboration) presented at CODES+ISSS and published in ACM TECS. [Aug 2023] Research paper Dynamic Thermal Management of 3D Memory through Rotating Low Power States and Partial Channel Closure by Lokesh Siddhu et al. accepted for publication in ACM TECS. [May 2023] Research paper Performance and Energy Studies on NC-FinFET Cache-based Systems with FN-McPAT by Divya Praneetha Ravipati et al. (collaboration with Univ. of Stuttgart) accepted for publication at IEEE Transactions on VLSI Systems. [Mar 2023] P. R. Panda delivers invited talk at Qualcomm Tech Talk Series [Oct 2022] Best Paper Nomination at ESWEEK/ CODES+ISSS'22 for our paper NeuroMap: Efficient Task Mapping of Deep Neural Networks for Dynamic Thermal Management in High-Bandwidth Memory, by S. Pandey and P. R. Panda. Published at IEEE TCAD. [Apr 2022] P. R. Panda delivers invited talk at Intel Tech Elevate Summit 2022 [Apr 2022] Research paper CoMeT: An Integrated Interval Thermal Simulation Toolchain for 2D, 2.5D, and 3D Processor-Memory Systems (collaboration with Univ. of Amsterdam and Karlsruhe Inst. of Tech.) accepted for publication in ACM TACO. [Mar 2022] Best Paper Nomination at DATE'22 for our paper CoreMemDTM: Integrated Processor Core and 3D Memory Dynamic Thermal Management for Improved Performance, by L. Siddhu, R. Kedia, P. R. Panda [Mar 2022] Research paper FN-CACTI: Advanced CACTI for FinFET and NC-FinFET Technologies by Divya Praneetha Ravipati et al. (collaboration with Univ. of Stuttgart and Karlsruhe Inst. of Tech.) published in in IEEE Transactions on VLSI Systems. [Feb 2022] P. R. Panda delivers invited talk at Google Performance Power Summit 2022 [Jan 2022] P. R. Panda is the program chair of CASES'22 [Jan 2022] Naman Jain wins the PMRF Fellowship to support his research collaboration with Stanford University [Dec 2021] P. R. Panda and Shailja Pandey present invited talk and tutorial at NSM Winter School on Computer Architecture [Dec 2021] P. R. Panda delivers invited talk at Madhya Pradesh Vigyan Sammelan, IIT Indore [Oct 2021] P. R. Panda delivers invited talk at Techfest, IIT Bombay [Oct 2021] P. R. Panda is the program co-chair of CASES'21 [Mar 2021] P. R. Panda delivers invited talk at FDP on RISC-V VLSI Implementation Flow, IITG, MNIT, NIT-P, and IIITDM [Feb 2021] Research paper Leakage-Aware Dynamic Thermal Management of 3D Memories by L. Siddhu, R. Kedia, P. R. Panda published in ACM TODAES more Preeti Ranjan Panda Prof. Anshul Kumar Chair Professor Dept. of Computer Sc. & Engg. and School of IT, IIT Delhi MARG: Memory and embedded Architectures Research Group I am a Professor of Computer Science and Engineering at IIT Delhi, and Associated Faculty of the Khosla School of Information Technology. My research interests are in the areas of: Embedded Systems and Computer Architecture Cache and Memory Technologies AI/ML Hardware and Systems Digital Design and Automation Our research group investigates several research problems that arise at the intersection of Embedded Systems and the adjacent areas of Computer Architecture, Compilers, and Systems-on-Chip design. How do we save energy while not sacrificing performance in computing systems? How do we restructure data and computation to address power and thermal issues? What are the system-level implications of emerging memory technologies? Lecture Videos Synthesis of Digital Systems Lecture videos for online course. Books Power-efficient System Design Preeti Ranjan Panda, Aviral Shrivastava, B. V. N. Silpa, Krishnaiah Gummidipudi Springer, New York, 2010. Memory Issues in Embedded Systems-On-Chip: Optimizations and Exploration Preeti Ranjan Panda, Nikil D. Dutt, and Alexandru Nicolau Kluwer Academic Publishers, Norwell, 1999. Copyright (C) 2017 P. R. Panda Original design by Dreamtemplatestudio",
  "content_length": 5394,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:17"
}