{
  "name": "Preetha Chatterjee",
  "homepage": "https://sites.udel.edu/preethac",
  "status": "success",
  "content": "Home | Preetha Chatterjee Preetha Chatterjee My website has moved to https://preethac.github.io/. This space is no longer maintained! Computer and Information Sciences University of Delaware Email: preethac[AT]udel.edu GoogleScholar   DBLP   ResearchGate I will be joining as an Assistant Professor of Computer Science in the Department of Computer Science at Drexel University from Fall 2021! Prospective Students: I am actively looking for motivated Masters/PhD students to work on Software Analytics. If you are enthusiastic about solving real-life Software Engineering problems, please get in touch with me via email. Detailed instructions [here] I am a final year PhD candidate in the department of Computer and Information Sciences at University of Delaware. I am currently working as a Research Assistant in the Software Analysis and Compilation Lab with Professor Lori Pollock. My research interests are primarily in software engineering (SE), with an emphasis on improving software engineers tools and environments through data mining, text analysis and machine learning. I am especially interested in mining software repositories at a large scale, extending data analytics solutions to transform the plethora of information available in software artifacts into actionable nuggets of knowledge and tools, useful for both software engineers and researchers. I am also broadly interested in empirical software engineering. Research Statement  Teaching Statement My dissertation is focused on analyzing developer chats, which are an important and previously unexplored resource in SE. I build tools based on evidence from quantitative and qualitative empirical studies, and adapting state-of-the-art techniques from the fields of Natural Language Processing and Machine Learning. Through my research, I intend to enable advances in areas including building/enhancing recommender systems for developers, information retrieval tasks from unstructured developer communications, and virtual assistants for software engineers. Media Coverage: My research on mining developer chat communications on: ABB news Starting ACM-W Chapter at University of Delaware: UDaily article Latest News! April 2021: Received Frank A. Pehrson Graduate Student Award for Outstanding Computer Science Research from the Department of Computer and Information Science, University of Delaware, in recognition of outstanding performance and future potential in the field. March 2021: Successfully defended my Ph.D. dissertation on “Mining Information from Developer Chats Towards Building Software Maintenance Tools” at University of Delaware March 2021: I will be joining as an Assistant Professor of Computer Science in the Department of Computer Science at Drexel University from Fall 2021! March 2021: Journal paper “Help with Programming Errors: An Exploratory Study of Novice Software Engineers’ Focus in Stack Overflow Posts” selected for the Journal of Systems and Software (JSS) Happy Hour. February 2021: Journal paper “Automatically Identifying the Quality of Developer Chats for Post Hoc Use” accepted in the Transactions on Software Engineering and Methodology (TOSEM). December 2020: Technical paper “Automatic Extraction of Opinion-based Q&A from Online Developer Chats” accepted in Proceedings of the 43rd International Conference on Software Engineering (ICSE 2021)",
  "content_length": 3358,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:15"
}