{
  "name": "Primal Pappachan",
  "homepage": "https://primalpappachan.com",
  "status": "success",
  "content": "Primal PappachanSearchPrimal PappachanAbout meI am an Assistant Professor at Portland State University in the Department of Computer Science. I completed my Ph.D. from the Department of Computer Science at University of California, Irvine. I lead the DIPr 🌌 (Database & Internet Privacy) Lab and co-organize the Database Reading Group.My research focuses on the intersection of data management and privacy, aiming to enhance user control and data privacy. Specifically, I work on policy-aware data processing to create data management systems that are fast, scalable, transparent, secure, and privacy-preserving.Contact MeVisit the DIPr lab website for details on ongoing projects.Recent NewsAll news»[Nov 2025] I was selected as a Catalyst Immersive fellow for 2025-2026.[Oct 2025] Our PacTrans Proposal “Developing SafeSpot: A New Crowdsourcing Tool for Real-Time Near-Miss Detection and Risk Mapping” was awarded.[Aug 2025] New full research paper titled “Meaningful Data Erasure in the Presence of Dependencies” accepted at VLDB 2025.[July 2025] My NSF proposal “CRII: SaTC: Preventing inferences in databases through Dependency-Aware Access Control” was awarded.[June 2025] I gave a talk on “Towards Policy-Aware and Privacy-Conscious Data Management Systems” as part of Oregon Cybersecurity Center of Excellence (OCCoE) Research Seminar SeriesFeatured PublicationsAll Publications» Primal Pappachan, Chenxi Qiu, Anna Squicciarini, Vishnu Sharma Hunsur Manjunath (2023). User Customizable and Robust Geo-Indistinguishability for Location Privacy. EDBT 2023.Preprint PDF Cite Code Project Slides Primal Pappachan, Shufan Zhang, Xi He, Sharad Mehrotra (2022). Don't Be a Tattle-Tale: Preventing Leakages through Data Dependencies on Access Control Protected Data. Proc. VLDB Endow..Preprint PDF Cite Code Project Poster Slides Primal Pappachan, Roberto Yus, Sharad Mehrotra, Johann-Christoph Freytag (2020). Sieve: A Middleware Approach to Scalable Access Control for Database Management Systems. Proc. VLDB Endow..Preprint PDF Cite Code Project Project VideoSee all publications Cite × Copy Download",
  "content_length": 2103,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:17"
}