{
  "name": "Priyanka Golia",
  "homepage": "https://priyanka-golia.github.io",
  "status": "success",
  "content": "Priyanka Search Priyanka Golia Assistant ProfessorChandruka New Faculty FellowEmail:pgolia@cse.iitd.ac.inBharti 415, CSE, IITD Research Statement I am an Assistant Professor in the Computer Science and Engineering Department at IIT Delhi. I am also an Associate Faculty at Yardi School of Artificial Intelligence (ScAI). Prior to that, I was faculty at CISPA Helmholtz Center for Information Security. I completed Ph.D. in a joint degree program with Indian Institute of Technology Kanpur, India and National University of Singapore, advised by Kuldeep S. Meel and Subhajit Roy. My research lies at the intersection of artificial intelligence and logic, with a focus on building trustworthy AI. I work on questions such as: Is an AI model fair? Is it robust? Can we prove that it will always behave as expected? Beyond verifying models, I also explore how to design systems with guarantees built in from the start (correct by construction). For example, our tool Manthan takes a specification, uses machine learning to generate a candidate program, and then verifies and repairs it until the required guarantees are met. If you are curious about AI, logic, verification, or building reliable systems, there are many opportunities to get involved — from using automated reasoning tools to exploring the limits of machine learning. I am actively recruiting students to work with me. If you are interested in a 6-month long research internship, with the possibility of extending it into a longer collaboration (including pursuing Ph.D., if mutually agreed), please see the projects listed below and fill out the form HERE. This will be an in-person, paid internship at CSE@IITD. Currently, I am working on several projects, including: Correct systems with LLMs in the loop: Large language models (LLMs) can generate code from a specification. But can we trust that the generated code is correct? We use automated reasoning tools to verify LLM-generated code, and if it fails, we aim to automatically repair it. (with Kumar Madhukar) Verification and repair of ML models: We study how to verify machine learning models against important properties. For example: how much can we perturb an input without changing the output? If the model fails these checks, can we repair it to meet the guarantees? (with Kumar Madhukar) Explainable AI and ranking functions: Given a dataset with ranked data points, can we explain how the ranking was generated? We explore realizable functions that map features to rankings, and study how to handle hidden features in explanations. (with Diptarka Chakraborty, Sujoy Bhore, and Suraj Shetiya) Automated reasoning across domains: We apply automated reasoning techniques to diverse domains where correctness is critical. One direction is approximate yet correct-on-critical-components synthesis of circuits, where we aim to balance efficiency with provable guarantees. Another is computational social choice, where we study fundamental questions of fairness, such as whether envy-free allocations of resources among agents always exist. (with Rohit Vaish on computational social choice) Research recognition: Received ACM India Doctoral Dissertation Award . Received Manas Mandal Outstanding Ph.D. thesis award at IITK. DATE-23 paper received Best Paper Award Nomination. CAV-22 paper invited to FMSD issue dedicated to the best papers from CAV. ICCAD-21 paper received Best Paper Award Nomination (6 out of 121 papers). Research grants: Indian government’s ANRF Early Career Research Grant. Co-organizer: 1. ACM IndiCS seminar on Automated Synthesis. 2. Workshop on Model Counting, Sampling, and Synthesis, co-located with SAT 2025. 3. Winter School on Formal Verification and Program Synthesis, CSE IITD. 4. 9th Edition of Indian SAT-SMT School, co-located with SAT 2024. 5.Workshop on Model Counting, Sampling, and Synthesis, co-located with SAT 2024. Selected recorded talks: 1. Manthan: A Data-Driven Apporach for Boolean Functional Synthesis [video @ SAT-SMT workshop-2020]. 2. Program Synthesis as Dependency Quantified Formula Modulo Theory [video @ Formal Method Update-2021]. Service: Program Committee: ATVA AE Chair 2025, SAT 2025, VMCAI 2025, CP 2024, IJCAI 2024, ECAI 2024, NeurIPS 2023 Workshop GenPlan, CP Doctoral symposium 2022. Tutorial: AAAI & IJCAI-22: Automated Synthesis: Towards the Holy Grail of AI. [description]. Team Masters Abhinav Rajesh Shripad B.tech, CSE IITD, co-advised with Rohit Vaish Deshmukh Sharayu Shivajirao B.tech + M.tech, CSE IITD, co-advised with Rohit Vaish Jahnabi Roy B.tech, CSE IITD Kushagra Gupta B.tech + M.tech, CSE IITD Raj Nareshkumar Chandak B.tech + M.tech, CSE IITD Yash Bansal B.tech + M.tech, CSE IITD co-advised with Kumar Madhukar News We are organizing the ACM India IndiCS seminar on Automated Synthesis, together with Supratik Chakraborty, Aalok Thakkar, and Kumar Madhukar. Sep 16, 2025 2:15 PM We are organizing workshop on Counting, Sampling, and Synthesis, together with Paulius Dilkas. Jul 2, 2025 2:15 PM Together with Jie An, I will be serving as the ATVA 2025 Artifact Evaluation Chair. I look forward to reviewing your systems! Check out the details at ATVA-AE 2025 Apr 2, 2025 2:15 PM Invited to give an early career researcher talk at (ARCS)-ACM India event. Feb 2, 2025 2:15 PM Extremely happy and deeply grateful to have been chosen as the recipient of the ACM India 2024 Doctoral Dissertation Award. Dec 2, 2024 2:15 PM See all news Conference Papers Provable Guarantees in Approximate Synthesis. Kushagra Gupta, Priyanka Golia, Subhajit Roy, and Kuldeep S. Meel. Design, Automation and Test in Europe Conference, DATE, 2026. Functional Synthesis via Formal Methods and Machine Learning. Priyanka Golia. PhD Thesis, National University of Singapore and Indian Institute of Technology Kanpur, 2023. PDF Cite Synthesis with Explicit Dependencies. Priyanka Golia, Subhajit Roy, and Kuldeep S. Meel. Design, Automation and Test in Europe Conference, DATE (received Best Paper Award Nomination), 2023. PDF Cite A Scalable Shannon Entropy Estimator. Priyanka Golia, Brendan Juba, and Kuldeep S. Meel. 34th International Conference on Computer-Aided Verification,CAV, 2022. PDF Cite Code On Quantitative Testing of Samplers. Mate Soos, Priyanka Golia, Sourav Chakraborty, and Kuldeep S. Meel. International Conference on Constraint Programming, CP, 2022. PDF Cite Code Engineering an Efficient Boolean Functional Synthesis Engine. Priyanka Golia, Friedrich Slivovsky, Subhajit Roy, and Kuldeep S. Meel. 40th International Conference On Computer Aided Design,ICCAD (received Best Paper Award Nomination), 2021. PDF Cite Code Slides Video Designing Samplers is Easy: The Boon of Testers. Priyanka Golia, Mate Soos, Sourav Chakraborty, and Kuldeep S. Meel. Formal Methods in Computer-Aided Design, FMCAD, 2021. PDF Cite Code Slides Video Program Synthesis as Dependency Quantified Formula Modulo Theory. Priyanka Golia, Subhajit Roy, and Kuldeep S. Meel. 30th International Joint Conference on Artificial Intelligence,IJCAI, 2021. PDF Cite Code Poster Video Manthan: A Data-Driven Approach for Boolean Function Synthesis. Priyanka Golia, Subhajit Roy, and Kuldeep S. Meel. 32nd International Conference on Computer-Aided Verification, CAV, 2020. PDF Cite Code Slides Video Software Manthan Manthan: A Data-Driven Approach for Boolean Function Synthesis Code CAV 2020, ICCAD 2021 Scalbarbarik On Quantitative Testing of Samplers Code CP 2022 DeQuS Program Synthesis as Dependency Quantified Formula Modulo Theory Code IJCAI 2021 EntropyEstimation A Scalable Shannon Entropy Estimator Code CAV 2022 CMSGen Designing Samplers is Easy: The Boon of Testers Code FMCAD 2021 Cite × Copy Download",
  "content_length": 7684,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:20"
}