{
  "name": "Priyanka Bagade",
  "homepage": "https://pbagade0.wixsite.com/priyanka/about",
  "status": "success",
  "content": "Team | Iot Vision Lab top of page This website was built on Wix. Create yours today.Get StartedTreat at OishiLab SquadIoT Vision LabTreat at Oishi1/3Meet the TeamPriyanka BagadeI am an assistant professor in the Computer Science and Engineering department at IIT Kanpur. Before that, I worked as a software architect in Intel Corporation, USA for 5 years. I have completed Ph.D. in Computer Science from Arizona State University under the guidance of Prof. Sandeep K. S. Gupta. My current research focuses on the internet of things, deep learning, and cyber-physical systems. ​ Education Ph.D. in Computer Science Arizona State University, AZ, USA Thesis: Evidence-based Development of Trustworthy Mobile Medical Apps B. Tech. Electronics and Telecommunication Engineering, College of Engineering Pune,  Maharashtra, India Curriculum Vitae (CV) ​ ​Current StudentsSenior Research FellowAkshan AgrawalLinkedIn MTech StudentAkshay ToshniwalLinkedIn Ph.D. Student - Co-advised with Prof Debapriya Basu RoyAnjali ManojLinkedIn MTech StudentAnsh MakweLinkedIn MTech StudentArpit NigamLinkedIn Research InternGargi JoshiLinkedIn MSR + Junior Research FellowKunal SaxenaLinkedIn MTech StudentNitish KumarLinkedIn MTech StudentRitikaLinkedIn Research InternSarthak DwivediLinkedIn Junior Research FellowShashwat GuptaLinkedIn MTech StudentSohel ModiLinkedIn Senior Research FellowSom V TambeLinkedIn MTech Student - Co-advised with Prof Purushottam KarSwaraj SonavaneLinkedIn MTech StudentVinay Kumar Reddy EdulaLinkedIn Graduated StudentsMTech Students Arpit Nigam (2025) / Leakage Detection using IoT and Machine Learning Nitish Kumar (2025) / Enhancing Person Re-Identification Through Depth Images Atanu Shuvam Roy (2024) / Smart Infrastructure Management Using Integrated IoT Systems Alok Trivedi (2023) / Detecting and Forecasting Cyber Attacks with Graph Neural Networks and Attention Layers Tej Kiran Boppana (2022) / Network forensics for MQTT-based IoT networks Naga Durga Krishna Mohan Eaty (2022) / Digital twin for electric vehicle battery management Gaurav Singh Parihar (2022) / Ground surveillance using deep learning-based object detection in aerial images Sandeep Kumar Mishra (2022) / Multi-sensor based maritime surveillance system MSR Students Nishant Valvi (2025) / Person re-identification using camera and radar sensors Debdeep Roy Chaudhuri (2024) / Applications of large language models (LLMs) in smart systems Ayushi Mishra (2023) / Digital forensics of medical Internet of Things UGP (Under Graduate Research Project)​ Aditi Khandelia (July 2024 – present) / Detecting DDoS attacks on IoT networks using adversarial neural network Kushagra Srivastava (July 2024 – present) / Detecting DDoS attacks on IoT networks using adversarial neural network Likhit Jonna Sai (Jan 2024 - present) / Spatiotemporal intrusion detection system for IoT networks Souptik Majumdar (Jan 2024 - present) / Spatiotemporal intrusion detection system for IoT networks Rohit Verma (Jan 2024 - present) / Spatiotemporal intrusion detection system for IoT networks L Gokulnath (Jan 2024 – May 2024) / Differentiating between Crohn’s and Intestine Tuberculosis using CT scan images and deep learning – in collaboration with SGPGI hospital, Lucknow Talin Gupta (July 2024 – May 2025) / Person reidentification using depth camera Shashwat Gupta (Jan 2024 – May 2024) / Differentiating between Crohn’s and Intestinal Tuberculosis using CT scan images and deep learning – in collaboration with SGPGI hospital, Lucknow Aditya Ajmera (Aug 2023 – Dec 2024) / Digital forensics of Medical Devices, project funded by GE Healthcare, India Kalika (Aug 2023 – Dec 2024) / Digital forensics of Medical Devices, project funded by GE Healthcare, India Mohak Singh Rana (Aug 2023 – Dec 2024) / Digital forensics of Medical Devices, project funded by GE Healthcare, India Bornadhya Abir Rajbongshi (Aug 2023 – Dec 2024) / Digital forensics of Medical Devices, project funded by GE Healthcare, India Dhruv Garg (Aug 2023 – Dec 2024) / Digital forensics of Medical Devices, project funded by GE Healthcare, India Mihir R Deshpande (Aug 2023 – Dec 2024) / Digital forensics of Medical Devices, project funded by GE Healthcare, India Nitesh Kaushal (Aug 2023 –  Dec 2024) / Digital forensics of Medical Devices, project funded by GE Healthcare, India Rajat Gattani (Aug 2023 – Dec 2024) / Digital forensics of Medical Devices, project funded by GE Healthcare, India Tejas Ramakrishnan (Jan 2023 – May 2023) / Water leakage detection using IoT Systems Aryan Vora (August 2022 – May 2023) / Brain Tumor Segmentation with input variable image Bhagwat Garg (Jan 2023 – May 2023) / Video Compression for Moving Ambulance Systems Aniket Borkar (Jan 2023 – May 2023)/ Water leakage detection using IoT Systems Hitesh Anand (Jan 2022 – Dec 2022) / AI based code generation for image processing Arpit Kumar Rai (Aug 2022 – Dec 2022) / AI based code generation for image processing Mehta Shrey Kartik (Aug 2022 – Dec 2022) / AI based code generation for image processing Divyansh (Aug 2022 – Dec 2022) / Video compression for teleambulance system Bhavya  Garg (Aug 2022 – Dec 2022) / Video compression for teleambulance system Samarpreet  Singh (Aug 2022 – Dec 2022) / Federated learning on IoT devices Som Tambe (Aug 2021 – Dec 2021) / Deep learning models performance evaluation of system containers bottom of page",
  "content_length": 5378,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:20"
}