{
  "name": "Priya Narasimhan",
  "homepage": "http://www.cs.cmu.edu/~priya",
  "status": "success",
  "content": "Priya Narasimhan | Professor, Carnegie Mellon | CEO, YinzCam Bio & Contact Research Publications Students Teaching Press Awards Downtime Incidents Resources for Research & Writing PRIYA NARASIMHAN CURRENT BIO Priya Narasimhan is a Professor of Electrical & Computer Engineering at Carnegie Mellon University. Her research interests lie in the fields of dependable distributed systems, fault-tolerance, embedded systems, mobile systems and sports technology. She serves as the academic lead of the Intel Science and Technology Center in Embedded Computing (ISTC-EC) that comprises Carnegie Mellon, Penn State, UIUC, University of Pennsylvania, Cornell, UC Berkeley and Georgia Tech. Priya Narasimhan is the CEO and Founder of YinzCam, Inc., a Carnegie Mellon spin-off company focused on mobile live streaming and scalable video technologies to provide the ultimate mobile fan experience to 40+ professional sports teams/venues. Her spare time is devoted to to watching professional (American) football and ice-hockey games. She is a rabid fan of the Pittsburgh Steelers and the Pittsburgh Penguins. Here we go, Steelers! Let's go, Pens! AWARDS Research awards: Her research has earned her an Alfred Sloan Fellowship, the 2009 Carnegie Science Center's Emerging Female Scientist Award, an NSF CAREER Award, a Best Paper Award, the 2001 UCSB Lancaster Outstanding Doctoral Dissertation Award and two IBM Faculty Partnership Awards. Entrepreneurship awards: Her entrepreneurship has earned her a 2012 International Bridge Award from Global Pittsburgh, and a 2011 ad:tech Innovation Award. Teaching awards: Her teaching has earned her the 2008 Eta Kappa Nu Excellence in Teaching Award (elected by students in the Carnegie Mellon Sigma Chapter), and the 2009 Benjamin Richard Teare Teaching Award (college-wide award) from Carnegie Mellon's College of Engineering. PAST EXPERIENCE She was the CTO and, later, the VP of Engineering of Eternal Systems, Inc., a startup company that commercialized the results of her Ph.D. research to develop and sell 24x7 highly available platforms and solutions for data centers and large online systems. Her research greatly influenced the development of the Fault Tolerant CORBA industrial standard. She has also served as the Director of Intel Labs Pittsburgh in 2010, and the Director of the CyLab Mobility Research Center, at Carnegie Mellon University in 2009. FOR CMU INQUIRIES email: priya@cs.cmu.edu tel: 412.268.8801 office: CIC 2202, Carnegie Mellon campus (Google Maps directions) FOR YINZCAM INQUIRIESemail: priya@yinzcam.com tel: 412.600.1165 office: 3846 S Water St, Pittsburgh, PA 15203 (Google Maps directions) CONNECT WITH ME Last updated: 19 February 2013, Priya Narasimhan",
  "content_length": 2720,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:19"
}