{
  "name": "Probir Roy",
  "homepage": "https://www.probir.info",
  "status": "success",
  "content": "Assistant Professor @ CIS UMich-DearbornSearch this siteEmbedded FilesSkip to main contentSkip to navigationProbir RoyAssistant ProfessorDepartment of Computer and Information Science (CIS)University of Michigan-DearbornEmail: probirr at umich dot eduPhone: 313-583-6620 Office:  230 CIS, 4901 Evergreen Road, Dearborn, MI 48128[CV]  (Last update: 10/04/2020)I am an assistant professor in the computer and information science department at the University of Michigan-Dearborn. My research focuses on building practical tools and techniques to expose various performance bottlenecks and optimization opportunities in software. Since the complexity of computational systems is increasing, designing performant software/hardware is becoming more challenging. To address these challenges, I develop practical “program analysis tools.” I did my PhD with Xu Liu at the College of William and Mary, developing lightweight memory profiling techniques to identify performance inefficiencies.\"I am looking for self-motivated students who are interested in system research. Please submit this form.\"News:Will give a talk at Concordia University on August 19, 2025.Will give a talk on \"Profile-guided Optimization for Cloud Services\" at the Scalable Tools Workshop 2025.One paper on optimizing serverless cold-start accepted to ICDCS'25. Congratulations to the team!Our proposal on \"Integrating Software Performance Analysis into CS Education\" has been funded! Thanks, NSF !!One paper on locating inefficient communication in microservice applications accepted to TACO. Congratulations to Tariq, Lance, and our collaborator!One paper on the empirical study of HPC performance bugs accepted to MSR'23. Congratulations to Azad and our collaborators!One paper on designing secure performance metrics accepted to HIPS'23 Our proposal on \"Towards Efficient Cloud Services\" has been funded! Thanks, NSF !!Publications (* denotes direct student,  ^denotes equal contribution):[ICDCS'25] \"SLIMSTART: Efficient Serverless Cold Start: Reducing Library Loading Overhead by Profile-guided Optimization,\" Syed Salauddin Mohammad Tariq^*, Ali Al Zein^*, Soumya Sripad Vaidya*, Arati Khanolkar*, Zheng Song, and Probir Roy, The International Conference on Distributed Computing Systems, 2025[SC'24 Poster] \"PcMINER: Mining Performance Related Commits at Scale,\" Md Abul Kalam Azad^*, Manoj Alexender^*, Matthew Alexender*, Syed Salauddin Mohammad Tariq*, Foyzul Hassan, and Probir Roy, The International Conference for High Performance Computing, Networking, Storage and Analysis, 2024[TACO'23] \"MicroProf: Code-level Attribution of Unnecessary Data Transfer in Microservice Applications,\" Syed Salauddin Mohammad Tariq*, Lance Menard*, Pengfei Su, and Probir Roy, ACM Transactions on Architecture and Code Optimization, 2023.[Paper] [Replication package][MSR'23] \"An Empirical Study of High Performance Computing (HPC) Performance Bugs\", Md Abul Kalam Azad*^, Nafees Iqbal^, Foyzul Hassan and Probir Roy, Proceedings of the 20th International Conference on Mining Software Repositories, 15-16 May, 2023, Melbourne, Australia.[Paper] [Replication package][HIPS'23] \"CERBERUS: Designing Secure Performance Metrics for Last-Level Cache\", Probir Roy, Birhanu Eshete, Pengfei Su. The 28th International Workshop on High-Level Parallel Programming Models and Supportive Environments, May 15, 2023, Petersburg, FL, USA[Paper][CGO'18] \"Lightweight Detection of Cache Conflicts\", Probir Roy, Shuaiwen Leon Song, Sriram Krishnamoorthy and Xu Liu, The 2018 International Symposium on Code Generation and Optimization, Feb 24 - 28th, 2018, Vienna, Austria. Acceptance ratio: 28%.[Paper] [CCProf-Source-code] [Slides][TACO'18] \"NUMA-Caffe: NUMA-Aware Deep Learning Neural Networks\", Probir Roy, Shuaiwen Leon Song, Sriram Krishnamoorthy, Abhinav Vishnu, Dipanjan Sengupta, Xu Liu, ACM Transactions on Architecture and Code Optimization, 2018.[Paper] [NUMA-Caffe-Source-code][Slides][TPDS'18] \"LWPTool: A Lightweight Profiler to Guide Data Layout Optimization\", Chao Yu^, Probir Roy^, Yuebin Bai, Hailong Yang, Xu Liu, IEEE Transactions on Parallel and Distributed Systems, 2018.[Paper][HPDC'16] \"SMT-Aware Instantaneous Footprint Optimization\", Probir Roy, Xu Liu and Shuaiwen Leon Song, The 25th ACM International Symposium on High-Performance and Distributed Computing, May 31 - Jun 4, 2016, Kyoto, Japan. Acceptance ratio: 15.5% (20/129).[paper] [SMTAnalyzer] [Slides][CGO'16] \"StructSlim: A Lightweight Profiler to Guide Structure Splitting\", Probir Roy and Xu Liu, The 2016 International Symposium on Code Generation and Optimization, Mar 12-18, 2016, Barcelona, Spain. Acceptance ratio: 23%.[paper] [StructSlim] [Slides]TeachingCIS/ECE 578 Advanced Operating System [Winter 2020]CIS 310 Computer Organization & Assembly Language [Fall 2020] [Fall 2019]Professional Services:Program Committee Member:CGO 2021 IEEE-ACM International Symposium on Code Generation and OptimizationICPP 2020 International Conference on Parallel Processing Journal reviewer: TPDS 2019 IEEE Transactions on Parallel & Distributed Systems TACO 2020 ACM Transactions on Architecture and Code OptimizationConference sub-reviewer: ICPADS, ICPP, HIPS, CGOReport abuseReport abuse",
  "content_length": 5218,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:20"
}