{
  "name": "Przemyslaw Musialski",
  "homepage": "https://web.njit.edu/~przem",
  "status": "success",
  "content": "Przemyslaw Musialski - Homepage Przemyslaw Musialski's Homepage (pronounced psheh-MISS-wahv) Update 2025-2026 I am serving as Chair of the EUROGRAPHICS 2026 Conference Short Papers Program (together with Isaak Lim). EUROGRAPHICS is the leading computer graphics conference in Europe. About I am an Associate Professor of Computer Science at New Jersey Institute of Technology, NJ, USA. My research in computer graphics focuses on geometric modeling, geometry processing, and digital fabrication combined with modern machine learning to create algorithmic solutions for digital content generation. Before joining NJIT, I was an Assistant Professor at the Institute of Discrete Mathematics and Geometry at Vienna University of Technology (TU Wien), where I also led the Computational Fabrication group at the Center for Geometry and Computational Design (GCD). From 2023 to 2025, I was a Visiting Professor at the Warsaw University of Technology and a Group Leader at IDEAS in Warsaw, Poland. Earlier in my career, I worked as a researcher at the VRVis Research Center for Virtual Reality and Visualization (VRVis) in Vienna, as a postdoctoral scholar at Arizona State University (ASU), as a postdoctoral associate in the Computer Graphics Group at TU Wien, and as a visiting research scientist at King Abdullah University of Science and Technology (KAUST). I received my MSc in Media Systems Science in 2007 from Bauhaus University Weimar in Germany and my PhD in Computer Science in 2010 from Vienna University of Technology (TU Wien) in Austria. Awards Winner of the Austrian Computer Graphics Award 2015, Category: Best Technical Solution Runner-up for the Austrian Computer Graphics Award 2016, Category: Best Technical Solution Best Paper Honorable Mention Pacific Graphics 2018 Recent Publications Beyond Blur: A Fluid Perspective on Generative Diffusion Models. ICCV 2025 [arXiv] [PDF] [Github] FlatCAD: Fast Curvature Regularization of Neural SDFs for CAD Models. Pacific Graphics 2025 [arXiv] [PDF] [Github] Disentangled Phoneme-Prosody Mapping for Controllable 3D Facial Animation, SIGGRAPH 2025 Posters [ACM PDF] Selected Grants and Other Funding Adobe Research Gift, 2022 (thanks to Adobe!) Computational Design of Geometric Materials, 03/2016 - 8/2021, (funded by WWTF) MAKE-IT-FAB: Modeling of Shapes for Personal Fabrication, 04/2015 - 03/2020, (funded by FWF) Selected Service EUROGRAPHICS 2026Chair of Short Papers Program (with Isaak Lim) SIGGRAPH 2026, 2025 Technical Papers Committee SIGGRAPH Asia 2025, 2021 Technical Papers Committee EUROGRAPHICS 2026, 2025, 2022, 2021, 2017, 2015 International Program Committee Pacific Graphics (PG): 2025, 2024, 2023 International Program Committee SGP 2024, 2023, 2022, 2021, 2020, 2019 Symposium on Geometry Processing, International Program Committee SPM 2024, 2023, 2022, 2021, 2018 Solid and Physical Modeling, International Program Committee Computer Graphics Forum Associate Editor 2021-2024 Memberships EUROGRAPHICS Association since 2010 ACM SIGGRAPH since 2011 ACM since 2021 Research Highlights FaçAID: SIGGRAPH Asia 2024 Layout Enhancer: SIGGRAPH Asia 2022 Elastic Geodesic Grids: SIGGRAPH 2020 and SIGGRAPH Asia 2021 Shape Optimization: SIGGRAPH 2015 and 2016 Research Featured Videos of Recent Research more videos ... Topics My group conducts research at the intersection of applied geometry, computer graphics, and computational fabrication. We investigate problems in geometric modeling, geometry processing, shape modeling, physically-based modeling, and computational fabrication. Our work encompasses computational processing of geometry, development of efficient algorithms for shape optimization, computational shape analysis and synthesis, computational design of layouts and spatial structures, and, last but not least, interaction with the user. Our research aims to provide solutions for the generation of geometric models suitable for digital manufacturing. The goal is to help humans, particularly designers, specialists, enthusiasts, and inexperienced users, to create digital content in an intuitive and automated manner. Current Students Haotian Yin, PhD Student at NJIT [Homepage] Shen Fan, PhD Student at NJIT [Homepage] Danzel Serrano, PhD Student at NJIT [Homepage] Aleksander Plocharski, PhD Student at WUT [Homepage] Alumni Kurt Leimer, PhD at TU Wien (graduated 2023) [Homepage] Stefan Pillwein, PhD at TU Wien (graduated 2022) [Homepage] Interested in Joining my Group? I look at multiple criteria, mainly mathematics skills and/or programming skills. A nice bonus is the knowledge of graphics or geometry. Also, natural curiosity and the drive to research are a strong plus. If you are interested, contact me by email! Teaching CS 438:Interactive Computer Graphics [Fall 2022] [Fall 2021] [Fall 2020] [Spring 2020] CS 675 and DS 675:Machine Learning [Spring 2023] [Spring 2022] [Spring 2021] Modern AI in Visual Computing [Spring 2025 at Warsaw UT] CS 786:Geometry Processing in Computer Science [Fall 2019] Advanced Geometry for Computer Science [Spring 2025 at Warsaw UT] Publications Beyond Blur: A Fluid Perspective on Generative Diffusion Models Grzegorz Gruszczynski, Michal Jan Wlodarczyk, Jakub Meixner, Przemyslaw Musialski International Conference on Computer Vision, ICCV 2025 [arXiv] [PDF] [Github] FlatCAD: Fast Curvature Regularization of Neural SDFs for CAD Models Haotian Yin, Aleksander Plocharski, Michal Jan Wlodarczyk, Mikolaj Kida, Przemyslaw Musialski Pacific Graphics 2025 (CGF Journal) [arXiv] [PDF] [Github] A Finite Difference Approximation of Second Order Regularization of Neural-SDFs Haotian Yin, Aleksander Plocharski, Michal Jan Wlodarczyk, Przemyslaw Musialski SIGGRAPH Asia Technical Communications 2025 [arXiv] [PDF] Scheduling the Off-Diagonal Weingarten Loss of Neural SDFs for CAD Models Haotian Yin and Przemyslaw Musialski ISVC 2025 [arXiv] [PDF] Joint Neural SDF Reconstruction and Semantic Segmentation for CAD Models Shen Fan and Przemyslaw Musialski ISVC 2025 [arXiv] [PDF] Disentangled Phoneme-Prosody Mapping for Controllable 3D Facial Animation Danzel Serrano, Przemyslaw Musialski ACM SIGGRAPH Posters 2025 [ACM PDF] Taking Control: Procedural Diffusion Guidance for Architectural Facade Editing Aleksander Plocharski, Jan Swidzinski, Przemyslaw Musialski ACM SIGGRAPH Posters 2025 [ACM PDF] Pro-DG: Procedural Diffusion Guidance for Architectural Facade Generation Aleksander Plocharski, Jan Swidzinski, Przemyslaw Musialski arXiv.2504.01571 [arXiv] [PDF] Neural Surface Priors for Editable Gaussian Splatting J. Szymkowiak, W. Jakubowska, D. Malarz, W. Smolak-Dyżewska, M. Zięba, P. Musialski, W. Pałubicki, P. Spurek International Joint Conference on Neural Networks (IJCNN 2025) [Homepage] [arXiv] [PDF] FaçAID: A Transformer Model for Neuro-Symbolic Facade Reconstruction Aleksander Plocharski, Jan Swidzinski, Joanna Porter-Sobieraj, Przemyslaw Musialski SIGGRAPH Asia 2024 Conference Papers [Homepage] [arXiv] [PDF] [Video] Neuro-Symbolic Transformation of Architectural Facades into Their Procedural Representations Aleksander Plocharski, Jan Swidzinski, Joanna Porter-Sobieraj, Przemyslaw Musialski SIGGRAPH 2024 Posters. Runner-up in ACM Student Research Competition. [ACM PDF] Animated Ink Bleeding with Computational Fluid Dynamics Grzegorz Gruszczynski, Mateusz Tokarz, Przemyslaw Musialski SIGGRAPH 2024 Posters [ACM PDF] Shrinking: Reconstruction of Parameterized Surfaces from Signed Distance Fields Haotian Yin, Przemyslaw Musialski Proceedings of ICMLA 2024 [ArXiv] [PDF] Optimizing 3D Geometry Reconstruction from Implicit Neural Representations Shen Fan, Przemyslaw Musialski Proceedings of ICMLA 2024 [ArXiv] [PDF] HOSC: A Periodic Activation Function for Preserving Sharp Features in Implicit Neural Representations Danzel Serrano, Jakub Szymkowiak, Przemyslaw Musialski ArXiv Preprint 2024/1/20 [ArXiv] [PDF] Geometric Guidance for the Deployment of Elastic Geodesic Grids Stefan Pillwein, Alexander Hentschel, Markus Lukacevic, Przemyslaw Musialski ArXiv Preprint 2023/12/28 [ArXiv] [PDF] LayoutEnhancer: Generating Good Indoor Layouts from Imperfect Data Kurt Leimer, Paul Guerrero, Tomer Weiss, Przemyslaw Musialski SIGGRAPH Asia 2022 Conference Papers [arXiv] [PDF] [Code] [Video] [Video] Generalized Deployable Elastic Geodesic Grids Stefan Pillwein, Przemyslaw Musialski ACM Transactions on Graphics (Proc. SIGGRAPH Asia 2021), 40, 6, Article 271 [Homepage] [arXiv] [PDF] [RG] Analysis of a Reduced-Order Model for the Simulation of Elastic Geometric Zigzag-Spring Meta-Materials Kurt Leimer, Przemyslaw Musialski Computers & Graphics, 2021 [arXiv] [PDF] [Video] [RG] Design and Fabrication of Multi-Patch Elastic Geodesic Grid Structures Stefan Pillwein, Johanna Kübert, Florian Rist, Przemyslaw Musialski Computers & Graphics, 98:218-230, Aug 2021 [Homepage] [arXiv] [PDF] [RG] [Video] On Elastic Geodesic Grids and Their Planar to Spatial Deployment Stefan Pillwein, Kurt Leimer, Michael Birsak, Przemyslaw Musialski ACM Transactions on Graphics (Proc. SIGGRAPH 2020), 39(4):1-12, Jul. 2020 [Homepage] [arXiv] [PDF] [Video] [RG] Reduced-Order Simulation of Flexible Meta-Materials Kurt Leimer, Przemyslaw Musialski In ACM Symposium on Computational Fabrication (ACM SCF), Nov. 2020 [arXiv] [PDF] [Video] Design and Fabrication of Elastic Geodesic Grid Structures Stefan Pillwein, Johanna Kübert, Florian Rist, Przemyslaw Musialski In ACM Symposium on Computational Fabrication (ACM SCF), Nov. 2020 [arXiv] [PDF] [Video] Simulation of Flexible Patterns by Structural Simplification Kurt Leimer, Przemyslaw Musialski In ACM SIGGRAPH 2020 Posters on - SIGGRAPH '20, Aug. 2020 [PDF] Pose to Seat: Automated Design of Body-Supporting Surfaces Kurt Leimer, Andreas Winkler, Stefan Ohrhallinger, Przemyslaw Musialski Computer Aided Geometric Design, 79, April 2020 [arXiv] [PDF] [Video] [RG] Sit & Relax: Interactive Design of Body-Supporting Surfaces Kurt Leimer, Michael Birsak, Florian Rist, Przemyslaw Musialski Compute",
  "content_length": 17803,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:22"
}