{
  "name": "Przemyslaw Andrzej Walega",
  "homepage": "https://sites.google.com/site/pawalega",
  "status": "success",
  "content": "P. A. WAŁĘGASearch this siteEmbedded FilesSkip to main contentSkip to navigationHomePrzemysław (Przemek) WałęgaI am an Associate Professor (Senior Lecturer) in Queen Mary University of London, Centre for Fundamental Computer Science and Senior Researcher in University of Oxford, Department of Computer Science.I received PhD in Logics in the Institute of Philosophy at the University of Warsaw, supervised by Joanna Golińska-Pilarek and Michał Zawidzki, BEng and MS degrees in Mechatronics from Warsaw University of Technology, and BS degree in Philosophy at the Institute of Philosophy, University of Warsaw.Below is a little help on my mysterious, for non-Poles, name:Pronunciation of my name (Przemysław Wałęga) 🔉Pronunciation of my nick name (Przemek) 🔉LaTeX encoding of my name: Przemys{\\l}aw Wa{\\l}\\c{e}gaResearch InterestsArtificial Intelligence (AI) and, in particular, Knowledge Representation and Reasoning (KRR) has quickly fascinated me and became the main source of my intellectual pleasure. My research is devoted to designing formal logical languages, studying their computational properties, and developing efficient reasoning algorithms for them. I am especially interested in methods for complex reasoning about time. Time is ubiquitous in our everyday lives, in the way we perceive and reason about the surrounding world, as well as how our AI algorithms do it. Consequently the topic of time brings together computer scientists, mathematical logicians, and philosophers, among others, providing a fascinating research area.My recent research is devoted to the temporal formalism DatalogMTL for which we have recently implemented at the University of Oxford Metric Temporal Reasoner MeTeoR - demo is available here.My PhD thesis is about interval temporal logics and on an interesting interplay between their computational complexity and expressive power - thesis is available here 📄 .Side ProjectsVisual Abduction.mp4Semantic Analysis of VideosCan AI understand what is happening in a video scene?We use Answer Set Programming for detecting events as `X is passing behind Y' to semantically explain videos and to increase precision of tracking algorithms.Stability Checking in Block Structures.mp4Robot ManipulatorWhich box can you pull out from a pile keeping other boxes stable?Our algorithms check it automatically using Qualitative Reasoning, which allows us to safely assemble and disassemble complex structures such as packages in a warehouse. AI in Angry Birds.mp4AI Playing Angry BirdsCan AI beat humans in the Angry Birds computer game?Currently humans significantly outperform AI using common sense reasoning about space and physics. Our algorithms mimic humans in this aspect.Email: przemyslaw dot walega at cs dot ox dot ac dot ukGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2836,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:21"
}