{
  "name": "Przemyslaw Pawelczak",
  "homepage": "http://www.pawelczak.net",
  "status": "success",
  "content": "Przemysław Pawełczak's Personal Webpage Przemysław Pawełczak Associate Professor Embedded Systems Group TU Delft Building 28, Room 2.W.680 Van Mourik Broekmanweg 6, 2628XE Delft The Netherlands, European Union p.pawelczak@tudelft.nl   +31 614 238 042 Publications Grants Students Teaching Career Service I am an associate professor within the Embedded and Networked Systems Group of TU Delft, The Netherlands, leading Sustainable Systems Lab. My research vision is to make Internet of Things free from batteries, less polluting and sustainable. With my students I do research that is experiment- and systems-oriented (where system is a creation of new hardware and software). Until the start of my tenure track at TU Delft in 2013 I researched performance of Cognitive Radio systems. I have obtained my MSc (magister inżynier) degree from Wrocław University of Science and Technology, Poland, in October 2004, and my PhD degree from TU Delft, The Netherlands in April 2009 (I was promoted by professor Ignas Niemegeers based on a thesis titled Opportunistic Spectrum Access: Designing Link and Transport Layer). In 2011 I completed my postdoctoral training at UCLA's Cognitive Reconfigurable Embedded Systems Lab, USA, under the mentorship of professor Danijela Čabrić. Between 2011 and 2012 I worked as a research scientist at Fraunhofer Heinrich Hertz Institute, Germany, under the supervision of professor Sławomir Stańczak. Project-wise I am involved in Dutch Research Council's ZERO project targeting energy-autonomous Internet of Things. I was also exploring new research avenues through my involvement in European Union's Quantum Flagship project on Quantum Internet. I was a recipient of Dutch Research Council's Veni 2012 grant and I am happily married with a dentist. Full CV (version: November 14, 2022) Publications An up-to-date list of all my publications can be found on my Google Scholar profile. Below is the list of recent most representative publications. Jasper de Winkel, Tom Hoefnagel, Boris Blokland, Przemysław Pawełczak, DIPS: Debug Intermittently-Powered Systems Like Any Embedded System, Proc. ACM SenSys 2022 Source code Abu Bakar, Rishabh Goel, Jasper de Winkel, Jason Huang, Saad Ahmed, Bashima Islam, Przemysław Pawełczak, Kasım Sinan Yıldırım, Josiah Hester, Protean: An Energy-Efficient and Heterogeneous Platform for Adaptive and Hardware-Accelerated Battery-free Computing, Proc. ACM SenSys 2022 Project website (with links to source code) Jasper de Winkel, Haozhe Tang, Przemysław Pawełczak, Intermittently-Powered Bluetooth that Works, Proc. ACM MobiSys 2022 Source code | Article artifact | ACM MobiSys 2022 video pitch Media coverage: Bits & Chips Vito Kortbeek, Souradip Ghosh, Josiah Hester, Simone Campanoni, Przemysław Pawełczak, WARio: Efficient Code Generation for Intermittent Computing, Proc. ACM PLDI 2022 Source code | Article artifact Vito Kortbeek, Abu Bakar, Stefany Cruz, Kasım Sinan Yıldırım, Przemysław Pawełczak, Josiah Hester, BFree: Enabling Battery-Free Sensor Prototyping with Python, Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. Volume 4, Issue 4, December 2020 and ACM UbiComp 2021 Source code Media coverage: Hackaday Jasper de Winkel, Vito Kortbeek, Josiah Hester, Przemysław Pawełczak, Battery-Free Game Boy, Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. Volume 4, Issue 3, September 2020 and ACM UbiComp 2020 Source code | ACM UbiComp 2020 presentation | ACM UbiComp 2020 video pitch Media coverage (selected): CNET, Wall Street Journal, Mashable, Hackaday, The Verge, Gizmodo, Engadget, PCMag, The Register, Tech Times, Nintendo Life, Daily Mail, The Independent, r/gadgets Jasper de Winkel, Carlo Delle Donne, Kasım Sinan Yıldırım, Przemys Pawełczak, Josiah Hester, Reliable Timekeeping for Intermittent Computing, Proc. ACM ASPLOS 2020 Source code | Article artifact | ACM ASPLOS 2020 presentation Media coverage: Bits & Chips, Phys.org Vito Kortbeek, Kasım Sinan Yıldırım, Abu Bakar, Jacob Sorber, Josiah Hester, Przemysław Pawełczak, Time-Sensitive Intermittent Computing Meets Legacy Software, Proc. ACM ASPLOS 2020 Source code | Article artifact | ACM ASPLOS 2020 presentation Axel Dahlberg, Matthew Skrzypczyk, Tim Coopmans, Leon Wubben, Filip Rozpędek, Matteo Pompili, Arian Stolk, Przemysław Pawełczak, Robert Knegjens, Julio De Oliveira Filho, Ronald Hanson, Stephanie Wehner, A Link Layer Protocol for Quantum Networks, Proc. ACM SIGCOMM 2019 Kasım Sinan Yıldırım, Amjad Yousef Majid, Dimitris Patoukas, Koen Schaper, Przemysław Pawełczak, Josiah Hester, InK: Reactive Kernel for Tiny Batteryless Sensors, Proc. ACM SenSys 2018 Source code Jethro Tan, Przemysław Pawełczak, Aaron Parks, Joshua R. Smith, Wisent: Robust Downstream Communication and Storage for Computational RFIDs, Proc. IEEE INFOCOM 2016 Source code Media coverage (selected): FastCompany, SlashDot, The Verge, Quartz Major Research Grants The list below summarizes the most important past and current research grants I am involved in. Towards Energy Autonomous Systems for IoT Perspectief NL 2016–Now Quantum Internet Alliance Quantum Flagship EU 2019–2022 Low-Energy Visible Light IoT Systems European Training Network EU 2019–2021 Veni Talent NL 2013–2016 Postdocs and PhD Students Supervision The list below summarizes past and current supervised students since I joined TU Delft in 2013. Current PhD students James Scott Broadhead 2019–Now Jasper de Winkel Cosupervisor: Koen Langendoen 2019–Now Carlo Delle Donne Cosupervisor: Stephanie Wehner 2019–Now Vito Kortbeek Cosupervisor: Koen Langendoen 2018–Now Graduated PhD students Coen van Leeuwen Now: Research Scientist, TNO 2013–2021 Amjad Yousef Majid Now: Postdoc, TU Delft 2016–2020 Qingzhi Liu Now: Lecturer, Wageningen University 2013–2016 Supervised Postdocs Yuxiao Hou 2018–2019 Kasım Sinan Yıldırım Now: Assistant Professor, University of Trento 2015–2017 Current Teaching Activities I am involved in the following courses at TU Delft. Fundamentals of Wireless Communications [ET4358] MSc course 2015–Now Wireless IoT and Local Area Networks [CESE4060] MSc course 2014–Now Mentorship [CSE1000] Academic Coordinator BSc course 2014–Now Academic Career and Education Academic Career Assistant Professor (with tenure): Embedded and Networked Systems Group, TU Delft, The Netherlands 2013–2021 Research Scientist: Fraunhofer Heinrich Hertz Institute, Germany Supervisor: Sławomir Stańczak 2011–2013 Postdoc: Cognitive Reconfigurable Embedded Systems Lab, UCLA, USA Mentor: Danijela Čabrić 2019–2011 Education PhD: TU Delft, The Netherlands Promotor: Ignas Niemegeers 2005–2009 Thesis: Opportunistic Spectrum Access: Designing Link and Transport Layer MSc: Wrocław University of Science and Technology, Poland 1999–2004 Recent Academic Service Editor: IEEE Wireless Communications Letters 2019 Distinguished Editor 2018–2021 Steering Committee: Energy Harvesting and Energy-Neutral Sensing Systems2017–Now Technical Program Committee (selected): ACM MobiSys 2023 ACM ASPLOS 2023 IEEE INFOCOM 2019, 2020 Distinguished Committee Member 2016–Now ACM/IEEE IoTDI 2021, 2022 ACM SenSys 2020–Now External Reviewer (selected): Conferences: ACM CHI, ACM UIST   Journal: ACM IMWUT 2020 Journal: IEEE Pervasive Computing 2018 Website source: przemyslaw-pawelczak.github.io   Last update: February 10, 2023, 22:52 Delft Time",
  "content_length": 7334,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:25"
}