{
  "name": "Pubali Datta",
  "homepage": "https://people.cs.umass.edu/~pdatta",
  "status": "success",
  "content": "Search Pubali Datta Assistant Professor University of Massachusetts Amherst Welcome! I am an assistant professor in the Manning College of Information & Computer Sciences (CICS) at the University of Massachusetts Amherst. My research interest is in securing emerging computing platforms. Modern computing systems are constantly growing in size and complexity, and layers of abstraction have helped us design these systems. However, as core design primitives are obscured, these indirections can also engender new security challenges. My research looks past these abstractions to study the core functionalities of modern computing systems. Through identifying the security and privacy challenges within these systems, I am able design mechanisms that prevent security violations while meeting the design and operational requirements of system users. I primarily work in the areas of Emerging Cloud Architectures, Internet of Things, and Threat Intelligence. My research detects, deters and investigates security attacks within large complex systems through the means of access control, information flow analysis, and auditing. I received my Ph.D. in Computer Science from the University of Illinois Urbana-Champaign, advised by Adam Bates and I worked as a part of The Secure & Transparent Systems Laboratory. My dissertation is on securing serverless computing platforms through information flow analysis. Learn more about my research here. Interests System Security and Privacy Serverless Cloud Security Internet of Things Auditing and Threat Analytics Education PhD in Computer Science, 2023 University of Illinois at Urbana-Champaign ME in Computer Science and Engineering, 2013 Jadavpur University BTech in Computer Science and Engineering, 2011 West Bengal University of Technology Recent Publications Mahmood Sharif, Pubali Datta, Andy Riddle, Kim Westfall, Adam Bates, Vijay Ganti, Matthew Lentz, David Ott May 2024 In IEEE SP DrSec: Flexible Distributed Representations for Efficient Endpoint Security. PDF Cite Isaac Polinsky, Pubali Datta, Adam Bates, William Enck May 2024 In WWW GRASP: Hardening Serverless Applications through Graph Reachability Analysis of Security Policies. PDF Cite Phoebe Moh, Pubali Datta, Noel Warford, Adam Bates, Nathan Malkin, Michelle L. Mazurek May 2023 In IEEE SP Characterizing Everyday Misuse of Smart Home Devices. PDF Cite Pubali Datta, Isaac Polinsky, Muhammad Adil Inam, Adam Bates, William Enck August 2022 In USENIX Security ALASTOR: Reconstructing the Provenance of Serverless Intrusions. PDF Cite Isaac Polinsky, Pubali Datta, Adam Bates, William Enck June 2022 In SACMAT SCIFFS: Enabling Secure Third-Party Security Analytics Using Serverless Computing. PDF Cite Arnav Sankaran, Pubali Datta, Adam Bates August 2020 In ACSAC 2020 Workflow Integration Alleviates Identity and Access Management in Serverless Computing PDF Cite Pubali Datta, Prabuddha Kumar, Tristan Morris, Michael Grace, Amir Rahmati, Adam Bates April 2020 In WWW Valve: Securing Function Workflows on Serverless Computing Platforms. PDF Cite Riccardo Paccagnella, Pubali Datta, Wajih Ul Hassan, Adam Bates, Christopher Fletcher, Andrew Miller, Dave Tian February 2020 In NDSS CUSTOS: Practical Tamper-Evident Auditing of Operating Systems Using Trusted Execution. PDF Cite Wajih Ul Hassan, Mohammad Ali Noureddine, Pubali Datta, Adam Bates February 2020 In NDSS OmegaLog: High-Fidelity Attack Investigation via Transparent Multi-layer Log Analysis. PDF Cite Pubali Datta *, Qi Wang *, Wei Yang, Si Liu, Carl Gunter, Adam Bates November 2019 In CCS Charting the Attack Surface of Trigger-Action IoT Platforms. (* denotes equal contribution) PDF Cite Contact pdatta@umass.edu 140 Governors Drive, Amherst, MA 01003 344 Computer Science Building DM Me Skype Me Cite × Copy Download",
  "content_length": 3799,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:23"
}