{
  "name": "Purushottam Kar",
  "homepage": "http://www.cse.iitk.ac.in/users/purushot",
  "status": "success",
  "content": "Roop Aparajita Subhra Purushottam Home Main About Research Articles, Code Talks, Tutorials Teaching Courses Internships Misc Service Awards Contact Thanks Roop Aparajita Subhra Purushottam Roop Aparajita Subhra Purushottam, Ph.D.(for formal/legal purposes I continue to use the name \"Purushottam Kar\") Associate Professor Department of Computer Science and Engineering The Indian Institute of Technology Kanpur Welcome to my homepage. You will find my contact details and some articles and talks of mine on this site. Please use the links on the left hand menu to navigate. News [10 May 2025] [New] Our work to appear at WWW 2025 enables significantly more efficient use of graph metadata for extreme classification applications, using graphs to regularize encoder and classifier weights instead of using expensive and bulky GNNs. A preprint is available [here]. [29 June 2024] Congratulations to Kush Shah for receiving the Rajiv and Ritu Batra Student Award in Cyber Security at the 57th Convocation at IIT Kanpur for his work on using machine learing and optimization techniques to make light-weight hardware authentication protocols resilient against machine learning attacks. [20 June 2024] We have been awarded the Gopal Das Bhandari Memorial Distinguished Teacher Award for the year 2024. The award is given at the annual convocation based on recommendations from the student senate and is meant to recognize excellence in teaching. I feel humbled by the honor the student community has chosen to bestow upon me despite my several shortcomings as a teacher. I cherish their association and am grateful and elated for their kind gesture. I must also express my gratitude to the several dozens of course admins and teaching assistants who make it possible for us to offer machine learning courses to thousands of students each year. Their timely and expert handling of various components of the course help us conduct massive courses in an orderly fashion. [15 May 2024] We have been awarded the IIT Kanpur PK Kelkar Faculty Fellowship for the year 2024. The PK Kelkar Faculty Fellowship was insitituted in honor of the founding director of IIT Kanpur and is one of the Young Faculty Research Fellowships awarded by the institute. To my bemusement, I found myself still eligible for a “young” faculty fellowship. Jokes aside, the recognition was given for work done in collaboration with dozens of faculty and student colleagues. Their support enables our team to experience new areas, learn new techniques, overcome novel challenges and make lasting impact. [04 November 2023] Our interdisciplinary work in collaboration with the Civil Engineering department, IIT Kanpur, on advancements in Non-negative Matrix Factorization techniques with applications to air-quality monitoring will appear at CODS 2024. A preprint and code will be released [here] soon. [04 November 2023] Our joint work with scientists at ISRO on an early anomaly detection technique for monitoring the health of spacecraft will appear at CODS 2024. A preprint and code will be released [here] soon. [28 August 2023] We have been selected for the IIT Kanpur 1989 Batch Faculty Award. This award is given in recognition of the use innovative and technology-enhanced content to improve the quality of undergraduate instruction. Credit goes to Prof. Amey Karkare who introduced me to the Prutor ecosystem, Dr. Umair Z Ahmed for working with me on several projects on the Prutor platform, student collaborators who worked on various Prutor-related projects such as TRACER (Dr. Umair Z Ahmed, Dr. Pawan Kumar), MACER (Darshak Chhatbar, Dr. Umair Z Ahmed, Fahad Shaikh, Sharath Padmanabha) and PRIORITY (Sharath Padmanabha, Fahad Shaikh, Debanjan Chatterjee, Preeti Singh, Mayank Bansal), and several dozens of teaching assistants (too numerous to mention here) due to whose efforts we were able to offer the CS771 machine learning course to thousands of IITK students. [02 July 2023] Congratulations to Bhaskar Mukhoty for receiving the Outstanding PhD Thesis Award at the 56th Convocation at IIT Kanpur for his thesis titled Learning in the Presence of an Adversary: A Provable Approach. [24 May 2023] Our work giving a more accurate way to train large language models for extreme classification applications will appear at KDD 2023. A preprint and code will be released [here] soon. [20 May 2023] Our work offering personalized retrieval at the scale of millions of users and millions of items will appear at SIGIR 2023. A preprint and code will be released [here] soon. [20 January 2023] Congratulations to Sharath H. Padmanabha, Fahad Shaikh, Mayank Bansal, Debanjan Chatterjee and Preeti Singh receiving the Best Paper Award at the 16th Innovations in Software Engineering Conference (ISEC 2023) for a paper that makes innovative use of ranking and recommendation techniques to help students who are learning to code by automatically suggesting tips on program repair when they make coding mistakes. [15 January 2023] Congratulations to Amit Chandak for receiving a Best Research Paper Nomination at the 10th ACM IKDD Conference on Data Sciences (CODS 2023) for a paper on techniques for creating light-weight yet expressive deep ensembles using first order perturbation methods. All browsers support the internet, and this internet site supports all browsers Page generated by jemdoc.",
  "content_length": 5361,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:26"
}