{
  "name": "Pushpendra Singh 0001",
  "homepage": "https://www.pushpendrasingh.info",
  "status": "success",
  "content": "Pushpendra SinghSearch this siteEmbedded FilesSkip to main contentSkip to navigation Pushpendra SinghAbout MeI am a Professor in the Dept. of Computer Science & Engineering at IIIT-Delhi. My research is at the interactions of mobile computing and human-computer interaction with a focus on translational research.  My research takes a user-centered and participatory design approach to system building. I am a recipient of the prestigious Bill & Melinda Gates Foundation grant for developing mobile-based learning platforms for community health workers. I have also received substantial funding from EU Erasmus+, NIHR-UK, and NIH-USA for my research activities. I have also received substantial research grants from Indian Funding agencies in the last ten years. I am also one of the Visvesvaraya Young Faculty Fellow. I helped establish the Center for Design and New Media (an initiative of Tata Foundation and supported by TCS)  with a grant of $4 million (28 Crore INR) at IIIT-Delhi and I was also the founding head of the Dept. of Human-Centered Design.  Recently, I received a $13.3 million (100 Crore INR) grant by DST to establish a Technology Innovation Hub, under the NM-ICPS scheme, in the area of \"Cognitive Computing & Social Sensing\". I currently serve as the Project Director for the same.Prior to IIIT-Delhi, I worked as a postdoc researcher at Inria-Rocquencourt, France, Culture Lab, Newcastle upon Tyne, UK, and at Portsmouth University, UK. Research InterestsHuman-Computer InteractionMobile & Middleware SystemsAwards & Honors1. Visvesvaraya Young Faculty Research Fellow (YFRF), 2016 - 2021. 2. Institute-wide Outstanding Educator Award by the graduating batch of 2019 (UG+PG).3. Institute-wide Outstanding Educator Award by the graduating batch of 2018 (UG+PG).4. Institute-wide Outstanding Educator Award by the graduating batch of 2015 (UG+PG).5. Teaching Excellence Letter for the course of Mobile Computing, 2019.6. Teaching Excellence Letter for the course of Programming Cloud Services for Mobile Applications, 2016.7. Teaching Excellence Letter for the course of Operating Systems, 2015.8. Teaching Excellence Letter for the course of Programming Cloud Services for Mobile Applications, 2015.9. Teaching Excellence Letter for the course of Operating Systems, 2013.10. Teaching Excellence Letter for the course of Operating Systems, 2012.11. Teaching Excellence Letter for the course of Computer Networks, 2012.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2513,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:26"
}